{
  "id": "32603",
  "title": "wages in Chicago for recent grad?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "How much should a recent grad look to make at a full time graphic design position in Chicago? What is normal, what is acceptable to live off of... considering loans, apt, car? (normal living expenses). Just to give me an idea... I live in a small town in MI, so I don't know where to start...\n\nThanks\n\n",
  "author": "ms. pater",
  "time": "27 Mar 2007 — 9:33pm",
  "uid": "16282",
  "comments": [
    {
      "time": "27 Mar 2007 — 9:40pm",
      "content": "did you check the AIGA website? they have the Aquent Salary Survey available...  \n [http://www.aiga.org/content.cfm/salary-survey](http://web.archive.org/web/20150104054840/http:/www.aiga.org/content.cfm/salary-survey \"http://www.aiga.org/content.cfm/salary-survey\")  \nif you're not a member of AIGA, i would recommend it.\n\n"
    },
    {
      "time": "27 Mar 2007 — 9:43pm",
      "content": "they list the average salary for an entry-level designer in the midwest as ranging from 30,000 to 33,000, i believe, but check the survey.\n\n"
    },
    {
      "time": "27 Mar 2007 — 9:57pm",
      "content": "yeah I checked and that is right.  \nso I should look for at least $30,000?\n\n"
    },
    {
      "time": "27 Mar 2007 — 10:08pm",
      "content": "here's the advice i give to a lot of students:  \nlook for a salary you're comfortable with.\n\nyou have to weigh a lot of factors. how badly do you want that \"first job\"? what size organization do you want to work for? how creative is the position? what are your expenses, and how much will you require to meet them? of course, you don't want to be underpaid, but think about these factors on sliding scales. for instance, you might say, \"Primo are offering me 29,000. Acme down the street are offering 31,500. but Primo is a studio i think i'd feel comfortable, and the work is more in line with what i'm interested in.\" in that case, the lower salary might be better overall, in terms of your chances to grow, do some interesting portfolio building and fit in.\n\nin the end, if you're getting a paycheck and you don't FEEL like you're being taken advantage of, then you're doing okay.\n\n"
    },
    {
      "time": "28 Mar 2007 — 6:42am",
      "content": "\"they list the average salary for an entry-level designer in the midwest as ranging from 30,000 to 33,000\"\n\nThe midwest is fairly large, though, and I'd guess that Chicago would be a bit higher.\n\n30k seemed to be the starting back in late 90s, though. Is the economy still that slow?\n\n\"so I should look for at least $30,000?\"\n\nYou should as for MORE that you want. Pick a price, then add 5k or so to it.\n\nOdds are that either a) they'll give it to you or b) they'll negotiate back down to your base price anyways.\n\n"
    },
    {
      "time": "28 Mar 2007 — 6:52am",
      "content": "that is better advice for someone with several years of experience, i think.  \nas far as the average, what can we say? average is average; there are some studios that offer a lot more and there are some that offer A LOT less for an entry-level designer.  \nin the end, all you can do is look at several of the places that are actually hiring, check out what starting salaries are like, and decide if it works or it doesn't.\n\n\"You should as for MORE that you want. Pick a price, then add 5k or so to it.\" -- I don't think that designers right out of school have quite so much power as that to dictate their starting pay, but maybe i'm out of touch.\n\n"
    },
    {
      "time": "28 Mar 2007 — 8:43am",
      "content": "Up here in Vermont I never made anything close to 35K, even as the art director of a magazine, actually about 10K less. But that was 10 years ago. More recently I made about 21K as a designer for a magazine, a salary not an hourly wage, and that meant working about 50 to 60 hours a week. As you say you are a recent grad I suspect your debts, especially if you owe on a student loan, are substantial. Given that I would strongly suggest you and your friends and anybody else read Anya Kamenetz's excellent book \"Generation Debt.\" Her site is [here](http://web.archive.org/web/20150104054840/http:/www.anyakamenetz.blogspot.com/) The book might be a bit depressing but it is certainly honest I think and points to where we might be going if we can't manage to rein in debt and do something about the cost of college education in this country.\n\n"
    },
    {
      "time": "28 Mar 2007 — 9:00am",
      "content": "I have to agree with Chuck here. Find out what you'd feel comfortable making. As a side note $30K seems to be standard these days unless you're in a small town or a huge metropolis. I started out at $28K in a smaller city in eastern Canada.\n\nI know the Canadian survey will break it down into some of the major cities as they tend to skew the mean a bit. The last job I took I gave a range of what I was expecting and literally got laughed at, but in a good way, they countered with substantially more than what I was expecting. Granted I think I make about the same now because I got bumped up a tax bracket.\n\n"
    },
    {
      "time": "29 Mar 2007 — 7:21am",
      "content": "\"I don’t think that designers right out of school have quite so much power as that to dictate their starting pay, but maybe i’m out of touch.\"\n\nI hear that a lot from design managers. Years ago at a AIGA student portfolio event, I offered up a question to the panel about that and was basically brushed off with the same response. I think that's bad advice. We all didn't spend money and time going through college JUST because we love design. We aimed to make money doing it.  \ng  \nMy first real job interview, after the portfolio review, the owner of the company came out and said 'so, what were you expecting salary-wise'. Being a student I really had no idea so blurted out a number. He said \"OK\". I, of course, said a number that was way low and it took me a year to get the courage to ask for a raise of 5k or so. Once again they said \"OK\".\n\nSo, my point is that you really do need to seriously think about salary and absolutely do NOT be afraid or intimidated of asking for more than you think you are worth. If the company has gotten to the point where they are actually willing to talk salary with you, they're not going to just say \"that's too much, get out\" when you answer. They'll either be happy to pay you what you want or will counter offer.\n\n"
    },
    {
      "time": "29 Mar 2007 — 11:03am",
      "content": "i would never recommend telling the hiring manager you would love to work for free; instead, i suggested finding out what the regional going rate was, and measure that against your real needs. but an unrealistic salary expectation is going to make a recent grad look foolish, and more than increase what they may receive it would likely indicate to the potential employer that the individual hasn't done their homework or research.\n\n"
    },
    {
      "time": "30 Mar 2007 — 10:23am",
      "content": "30,ooo is fairly normal in Chicago. And if you're not familiar with Chicago, Ms Pater, that's actually enough to live on. OK, that depends on your student loans if you have any, as well as your taste in food/booze/cars/guns. But it's enough to get by without too much scrounging.\n\nGood luck in your job hunt. The market here isn't exactly at its peak, but it's not dead either.\n\n"
    }
  ]
}
