{
  "id": "32608",
  "title": "looking for opinions on type book cost",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Could someone advise me on what would be a decent cost for me to purchase this specimen book. I have the option but have no idea on value.\n\nThis image is not of the actual book, but of roughly similar condition. Cover knocked about a bit, with few fingerprints. internally, a few fingerprints on a couple of pages, and foldouts well creased.\n\n| Attachment | Size |\n| --- | --- |\n| [3397\\_1\\_md.jpg](http://web.archive.org/web/20150417153405/http:/typophile.com/files/3397_1_md.jpg) | 25.3 KB |\n\n",
  "author": "typotheticals",
  "time": "28 Mar 2007 — 4:43am",
  "uid": "10671",
  "comments": [
    {
      "time": "28 Mar 2007 — 4:58am",
      "content": "The 1923 ATF Book generally sells for $250 to $350 here in the States. Check out Booksold.com + addall for some prices.\n\n"
    },
    {
      "time": "28 Mar 2007 — 5:14am",
      "content": "Thank you for the reply, Bob. Will have to think about it at that cost (about 400-450 Australian). Family and bills come first, unfortunately..\n\n"
    },
    {
      "time": "28 Mar 2007 — 8:30pm",
      "content": "I would put up a search on eBay. These show up every once in a while but they rarely break the $100 mark. These were printed in an enormous edition, can't recall it off the top of my head. Everyone interested in typography or letterpress already seems to have a copy. In the end, ATF still had so many of them they were used as fuel to heat the facilities.\n\n"
    },
    {
      "time": "28 Mar 2007 — 8:49pm",
      "content": "_they were used as fuel to heat the facilities._\n\n...which must be why they go for so much now.\n\nSmall world: I first saw the 1923 ATF catalog while visiting Gerald (aka bieler) and, not only that, purchased my own copy from someone in Australia (for $250 Australian).\n\n"
    },
    {
      "time": "28 Mar 2007 — 9:26pm",
      "content": "Hi Mark\n\nThat would have been in St Paul, I'd guess. :—) Those were good formative years for me.\n\nSomeone sent me a bunch of big old ATFs (pre-1923) a short while back as the result of a favor I did. Smelly, but turn-of-the-century smelly. I love books that smell.\n\nBut I've always favored the BB&S cat over ATF for some reason. Bit more funk to it I think. Whenever I see one on eBay I bid as they never ever sell for what they are worth. Probably have a half-dozen of em here and there. I really have to get serious about weeding my library!!! Still, never had a Hansen, which sort of bugs me, hmmm.\n\n"
    },
    {
      "time": "29 Mar 2007 — 4:18am",
      "content": "Looked on ebay, and there was one going there (still is). After 4 days no one had bid, so put down a $50 bid. Well it is now over the 100 mark.16 hours to go.\n\n"
    },
    {
      "time": "29 Mar 2007 — 4:23am",
      "content": "This ones going on ebay at present\n\nAuthor: Mergenthaler Linotype Company  \nDescription: xiv, [5-1078] pp. Illustrated throughout with advertisements, facsimiles, drawings, all showing various layout designs, type specimens examples, etc. 8¾x13, green cloth lettered in gilt.  \nOver 1200 faces and a large variety of special characters listed. Used to assist the Linotype user to a proper selection of Linotype matrices.  \nHeading: zze(Type Specimen Book)  \nPlace Published:New York  \nPublisher Name: Mergenthaler Linotype Company  \nDate Published: 1915\n\n ![](http://web.archive.org/web/20150417153405im_/http:/typophile.com/files/222222222222222_5217.jpg)\n\n"
    }
  ]
}
