{
  "id": "32621",
  "title": "Managing a Creative Team",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nit was quite a bit since I've posted anything on typophile. It's time to get back to The Source.\n\nMy one-man show finally gets promoted to a two-men show, where I am supposed to get the direction. It should seem like a good news and it is. But I do miss the things on managing a team. Now, after you rofled for sometime and got back to the monitor - the team will only get bigger now, so I've thought I'd better learn how to manage things (from data assets to the hardware to the team) itself before I lose the credentials and trust from the Top, which happens easily here.\n\nSo where do I start? My particular interest lies in readings and software I would eventually need.\n\nAnyone uses Bridge and Version Cue here from the CS?  \nHow do you handle data, when three designers, a copywriter and an art director work on one project?  \nHow do you use servers?  \nHow often do you back up the data?  \nDo you meet on weekly basis to discuss stuff or do you let it out on a daily basis at a cig break?  \nDo you write/require reports? Which ones?  \n... [and so on]\n\nAny feedback is hugely welcome here.  \n(and while you are writing, I'll get the eight\\_hours\\_delayed lunch)\n\n",
  "author": "popovich",
  "time": "28 Mar 2007 — 11:09am",
  "uid": "1788",
  "comments": [
    {
      "time": "29 Mar 2007 — 6:50am",
      "content": "I've worked in a handful of small and large firms.\n\nFor the most part, our system was fairly basic. File server where all files are stored for a project in folders adhering to some logical naming system. File servers backed up nightly to tape, rotated off-site and/or into a fire safe. Finished jobs archived off onto CD/DVD with at least two copies, one being stored off-site.\n\nUnless you have a fixing for middle management, I'd stay skip routine meetings and writing up reports.\n\n"
    },
    {
      "time": "29 Mar 2007 — 7:06am",
      "content": "I think, this is waht basically I am used to. I don't remember having some special file management software or even backups routines going on constantly (which is bad, of course).  \nI was thinking of setting up a pc with all data I have for the brand/product and fixing up a share folder/drive, so we can swap files easily. Plus weekly updates of the every new file edited or created during this week?... No tapes, just dvds.  \nI am no fan of reporting either, but I am looking into something like Studiometry [http://www.oranged.net/studiometry/](http://web.archive.org/web/20131014071857/http:/www.oranged.net/studiometry/ \"http://www.oranged.net/studiometry/\") for keeping records of things done. I have to test it first on my own, though.  \nVersion Cue and Bridge are not your devices of choice, are they? :)\n\nCheers,  \nA\n\n"
    }
  ]
}
