{
  "id": "32622",
  "title": "Any Photoshop professional on here? Please help, I have a dilemma.",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have a problem. I have scannned in a piece of material in photoshop. I have also done an  \nillustration in illustrator and brought it into Photoshop but i want to fill it  \nwith the priece of material so it will look like that the shoe is made of that material. How do I  \ngo about it? Is it something like mask off the area outside teh shoe and something? I’d like to knw  \nthe easy and real way. Not the ’use lasso tool and go round the shoe an ddelete every  \nlittle bit of material etc etc’. thank you. Please guide me. I really appreciate your help.  \nThanks.\n\n [‹ Meaning of this Symbol. Symbolologists](http://web.archive.org/web/20071010134650/http:/typophile.com/node/32741 \"Go to previous forum topic\") [Balken typeface ›](http://web.archive.org/web/20071010134650/http:/typophile.com/node/32575 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071010134650/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 28.Mar.2007 11.46am",
      "content": "I’d probably use a layer mask, either on the material layer or the shoe layer, depending on the situation and which one is easier.\n\nWhy not just import the scanned material photo into Illustrator? Or are you planning on working on it a bit more in Photoshop?\n\n"
    },
    {
      "time": " 28.Mar.2007 2.33pm",
      "content": "I was thinking maybe Illustrator would be easier if I am right? Do I use some sort of pathfinder tool I think. I’m not sure. Is it easier in Illustrator? Thanks.\n\n"
    },
    {
      "time": " 28.Mar.2007 3.26pm",
      "content": "A clipping path isn’t really easier in either program.\n\nAnd good god, get rid of that hideous icon.\n\n"
    },
    {
      "time": " 28.Mar.2007 3.34pm",
      "content": "if you have an image of a shoe and an image of material, open them both in photoshop. select the area of shoe you want to fill with the new material using either the lasso (sorry, but that’s how you do it!) or the magic wand or both. once the area is selected, go to other image, select all and copy,back to shoe and edit—paste into.  \nbut they should be teaching you this in school. it’s not a difficult task.\n\n"
    },
    {
      "time": " 28.Mar.2007 5.46pm",
      "content": "Look up layer mask in the help menu. That way it’s easy to change.\n\npeace\n\n"
    },
    {
      "time": " 28.Mar.2007 10.18pm",
      "content": "In Illustrator you should have a duplicate of the outline of the illustration you want to fill. Then place a photoshop picture under it, select both and choose make compound path. Move the new compound path under everything else, so you’ll get to keep possible details and outlines. Note, that these items should not have fills...\n\n"
    },
    {
      "time": " 28.Mar.2007 11.24pm",
      "content": "Assuming the shoe shape is an enclosed line, copy from illustrator and paste into photoshop, first as a path and then again as pixels, so you now have a layer with the shoe illustration and a background layer, between the two copy and paste the scanned material into a layer and create a layer mask (reveal all), go to your path drop down menu and using the option in the top right create a selection from the path, then inverse the selection and fill with black. If you need to move the material scan remember to unlink the scan layer and the layer mask.\n\nThere are many ways of doing this, depending on the final use, for example, I would also consider doing it as Mili suggests except making your duplicate illustrator path a compound path and then placing your material scan behind the path, select both and make clipping mask.\n\nTim\n\n"
    },
    {
      "time": " 28.Mar.2007 11.27pm",
      "content": "Thanks Tim, my bad! Of course clipping path, silly me. \\*hitting forehead\\*\n\n"
    },
    {
      "time": " 29.Mar.2007 1.27pm",
      "content": "It’s ok Mili, and thanks Tim, I shall try that :)\n\n"
    },
    {
      "time": " 30.Mar.2007 9.09am",
      "content": "Dangerous gases?\n\n"
    },
    {
      "time": " 31.Mar.2007 3.12am",
      "content": "Dangerous emanations of Gigglespeak. [edited]\n\n"
    },
    {
      "time": " 31.Mar.2007 9.44am",
      "content": "At first glance, I thought it was Faz on a broomstick :-)\n\n"
    },
    {
      "time": " 31.Mar.2007 11.35am",
      "content": "Dangerous Fazzes.\n\n"
    },
    {
      "time": " 31.Mar.2007 7.51pm",
      "content": "_the easy and real way_ – really not necessarily (nor likely to be) the same thing at all. RTFM Miss G! or failing that get a book like ’Real World Photoshop’ to learn from...\n\nWhich technique you employ for this depends very much on your intended outcome;  \n1. if you want the material to appear as a flat shape delineated by the outline of a shoe, then Illustrator.  \n2. if you want the material to appear as if it follows the contours of a shoe in three dimensions, then Photoshop.\n\nAs I’ve just reread your original post and it seems like 2. applies, so then a fair amount of layer-masking, adjustment layers and freehand addition of shadows and highlights will be inevitable if you want to achieve a realistic effect.\n\nI notice that no-one else here says you should be working with anti-aliased or feathered selections to keep the edges soft and natural-looking, or that you should be working with different layer blending modes (shadows=multiply, highlights=screen) and opacities.\n\n"
    },
    {
      "time": " 31.Mar.2007 8.23pm",
      "content": "What ben\\_archer - you don’t remember wondering how to make an area of an image transparent, or fill it with something else? Geez…\n\nYour last paragraph? Get over yourself.\n\n"
    },
    {
      "time": " 31.Mar.2007 10.36pm",
      "content": "\\>_1. if you want the material to appear as a flat shape delineated by the outline of a shoe, then Illustrator.  \n2. if you want the material to appear as if it follows the contours of a shoe in three dimensions, then Photoshop._\n\n1. Illy has had a groovy little feature called the Gradient Mesh for a while now Ben - perhaps you don’t use Illy as a graphics app? Here’s just one of a dozen or so Illy artist I know that can contour anything: [http://www.khulsey.com/masters\\_yukio\\_miyamoto.html](http://web.archive.org/web/20071010134650/http:/www.khulsey.com/masters_yukio_miyamoto.html \"http://www.khulsey.com/masters\\_yukio\\_miyamoto.html\") .\n\n2. Yeah ok, but Ps can do flat with the best of ’em.\n\nmissgiggles, in Ps there’s at least three solid different ways of doing most things - so... I’ll suggest after you have used a clipping path, try using the Dodge and Burn tools to give the textile some depth. And for an advanced depth technique, I can’t leave without suggesting the Ps Displace filter, and for that - here’s the funkiest tutorial around:  \n [http://thegoldenmean.com/technique/displace1.html](http://web.archive.org/web/20071010134650/http:/thegoldenmean.com/technique/displace1.html \"http://thegoldenmean.com/technique/displace1.html\")\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    }
  ]
}
