{
  "id": "32620",
  "title": "Art Center",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "First off, i wanted to just say how awesome this site it, i have been roaming around on it for a whole, but have not really posted much before.\n\nAnyway, I was just curious to see what everyone on here thinks about [Art Center](http://web.archive.org/web/20071102154305/http:/www.typophile.com/wiki/Art%252BCenter%252BCollege%252Bof%252BDesign) in Pasadena? My name is Josh, i am 18 and live in Austin, TX, and have decided over the past year or so that i want to become a graphic designer/motion graphic designer. I have gone out to LA and checked out Art Center, and it seems like a really great place, but does it really seem worth it for the cost? I think it is about 15,000 dollars a semester now, and it goes up a little bit every year, so with supplies, tuition, etc, its looking to be around 120,000 - 150,000 dollars, which is pretty freaking expensive.\n\nI am not really sure what the salary range for graphic designers is, but in your opinion, does a school like Art Center really seem worth it?\n\nThanks in advance for any replies, this seems like it is such an awesome forum and resource for designers, i will definitely be hanging around this site a lot more now.\n\nWhile i am at it, here are 2 recent pieces i have done. I tore a ligament in my ankle last week skateboarding, so i am basically stuck inside my house. Might as well work on my portfolio eh? One is a poster for a skateboard video, the other is a spec logo for a design firm called “joy”.\n\n[http://img.photobucket.com/albums/v79/guccipingpong/bignewposter.jpg](http://web.archive.org/web/20071102154305/http:/img.photobucket.com/albums/v79/guccipingpong/bignewposter.jpg \"http://img.photobucket.com/albums/v79/guccipingpong/bignewposter.jpg\")\n\n[http://img.photobucket.com/albums/v79/guccipingpong/newest.jpg](http://web.archive.org/web/20071102154305/http:/img.photobucket.com/albums/v79/guccipingpong/newest.jpg \"http://img.photobucket.com/albums/v79/guccipingpong/newest.jpg\")\n\n [‹ Images of type designers in action](http://web.archive.org/web/20071102154305/http:/www.typophile.com/node/32675 \"Go to previous forum topic\") [Quirky sources of typographic miscellany required! ›](http://web.archive.org/web/20071102154305/http:/www.typophile.com/node/32631 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071102154305/http://www.typophile.com/user/15289\" title=\"View user profile.\">wolfattack</a>",
  "time": "<br>",
  "uid": "15289",
  "comments": [
    {
      "time": " 28.Mar.2007 11.07am",
      "content": "\\>over the past year or so that i want to become a graphic designer/motion graphic designer.\n\n\\>I am not really sure what the salary range for graphic designers is\n\nI think you need to do a bit more research, and come up with a plan (like a career path, lottery win, marrying a doctor) that would allow you to repay the 150K+interest+medial bills. And if the numbers don’t add up then maybe look to a less expensive school.\n\n"
    },
    {
      "time": " 28.Mar.2007 11.28am",
      "content": "i guess when i said those things, i was just trying to not make a super long post that would take too long for people to read through.\n\nI interned for a year at a film production company, which i occasionally freelance for to do some simple motion graphic work for. I am currently interning at a motion graphics studio called Shiny Object here in Austin. I would like to do motion graphic design as well as graphic design, but i think my final goal is to be a motion graphic designer. I feel like it is more important to get a solid foundation in design, and then branch out into other forms of graphic design, in my case, motion graphic design.\n\nI really enjoy doing both motion and print design, so i could see my self doing either, or even both.\n\nthe reason i said “I am not really sure what the salary range for graphic designers is” is because i have heard many different opinions on how much a designer out of college makes, and just wanted to ask some people on this forum that are actually working graphic design jobs what they make, or what a “good” designer should expect to make out of school.\n\n"
    },
    {
      "time": " 28.Mar.2007 12.11pm",
      "content": "\\>or what a “good” designer should expect to make out of school.\n\nTalent is obviously important but I think the salary ranges have more to do with the personality of the designer. One person may put up with lousy wages and annoying boss and co-workers. Another may put up with lower-end wages because the work is interesting. A third might screw every penny they can out of their employer, run a freelance operation on their employer’s dime, and outsource the grunt work to their student ‘intern’. Maybe you need to be closer to the third person if you ever hope to get out of debt?\n\n"
    },
    {
      "time": " 28.Mar.2007 1.14pm",
      "content": "hey Josh,\n\nArt Center is a great school - very intense and demanding - if you are willing to put a lot into it, you will get a lot out of it.\n\nSalary of course depends on a lot of things - it will vary significantly with location/geography for example. However, a starting graphic designer’s salary is typically not going to look very attractive next to the total cost of an Art Center education.\n\nHowever, Art Center attracts the kind of people who go on to become art/creative directors, own their own firms, etc. - you have the potential to do very well.\n\nYou should definitely look into financial aid and see what that offers you as well.\n\nbest of luck,  \njarrod\n\n"
    },
    {
      "time": " 28.Mar.2007 1.14pm",
      "content": "Art center is a very respectable school, but if money is a problem take a look at the Academy of Art University in San Francisco. It’s a commercial school and doesn’t get the respect art center does in academia, but the students really do learn a lot, and churn out some great work. IIRC tuition at AUSF is around $8000-$9000 a semester, so it will do wonders for your future debt load. It’s a great place to go for motion graphics, because they’ve brought in Pixar and ILM to help develop curriculum and teach so that you’ll come out of school with a good portfolio and ready to work.\n\n"
    },
    {
      "time": " 28.Mar.2007 1.44pm",
      "content": "Art Center is a highly respected school in the design community although I’d say there are several across the country that are just as good. One thing to consider is the immediate recognition that you will get from having Art Center on your resume and how that, combined with Art Center’s network of alumni, might translate into future earnings.\n\nThe bottom line is you can get a good (maybe not great) education from numerous schools, what will really determine your worth is your individual talent and determination.\n\n"
    },
    {
      "time": " 28.Mar.2007 2.34pm",
      "content": "I teach in ArtCenter’s night program\\*, which means I don’t have direct insight into the degree program, but I do get exposed to it a lot. It’s very expensive. But: if you’re a good student you get hooked into the relevant industry like you wouldn’t believe; and they do give out scholarships. At a previous workplace two of the employees that I “directed” were from ArtCenter, and had had scholarships: both had natural talent, although they were really different people otherwise. Which makes me thing the scholarship process is pretty open-minded. BTW here’s a recent addition to their website which shows sort of trendy but nonetheless telling videos about some (admittedly hand-picked) students:  \n [http://www.artcenter.edu/insite/](http://web.archive.org/web/20071102154305/http:/www.artcenter.edu/insite/ \"http://www.artcenter.edu/insite/\") \\_  \nI actually got in touch with two of those students; one of them is currently in Singapore on some exchange program. In my book it’s a huge plus to be given such opportunities.\n\n\\* [http://typophile.com/node/30444](http://web.archive.org/web/20071102154305/http:/typophile.com/node/30444 \"http://typophile.com/node/30444\")\n\nOne other thing, which will seem flippant until you actually live here and then you wonder how people can live any which place: the weather. It’s not a joke.\n\nhhp\n\n"
    },
    {
      "time": " 28.Mar.2007 6.06pm",
      "content": "man, thanks so much guys, i really appreciate it.\n\nWell, i do not come from a rich family, and normally i would not be able to be anywhere close to affording Art Center, but last year i found out that my grandma had been putting aside money for my college every year since i was born, and i have about $70,000 for school. I feel so lucky to have this money because there is no way i would be able to get close to ever affording such an expensive school without this money.\n\nI am applying for the Spring of 08, and since i have this money, i guess i will not be able to get any scholarship, but i am going to apply for some scholarships anyway.\n\nArt Center seems like a really competitive place, and i really want to get as much out of school as i can. I was accepted to the University of Texas last year, which i turned down to go to a community college here in austin, just to get some of the basic courses out of the way so once i get to Art Center i can totally focus on design.\n\nI have always wanted to live in California (since i skateboard) and my best friend moved out there last year, so hopefully, if i get accepted, i will be moving out there next year to go to school.\n\nThanks again everyone, if anyone has anything else to add, i would really appreciate it.\n\n-Josh\n\n"
    },
    {
      "time": " 28.Mar.2007 6.13pm",
      "content": "\\>my grandma ...i guess i will not be able to get any scholarship\n\nCheck carefully into the aid requirements; they may only consider the financial condition of you and your parents. For goodness sake don’t put your Grandma’s money into your or your parent’s account before you check on this.\n\n"
    },
    {
      "time": " 28.Mar.2007 6.25pm",
      "content": "Josh  \nSince you have some money set aside courtesy of your grandmother, great. You are young, you have drive, and you have a good idea of what you want to do. Be careful, check out aid requirements as William suggests, but most of all you will have to be frugal otherwise by the end of your college career you might be in debt up to your eyeballs. No joke. Burn your credit cards, don’t borrow any money. Period. For more on what happens to students after school see Anya Kamenetz’s book Generation Debt. If that doesn’t open your eyes nothing will. Her book is [here](http://web.archive.org/web/20071102154305/http:/www.anyakamenetz.blogspot.com/) I’m a lot older than you are but have young children so this book really had an impact on my thinking about the future in college for them. Good luck. Jordan\n\n"
    },
    {
      "time": " 28.Mar.2007 6.40pm",
      "content": "Josh\n\nI currently work and have worked with several Art Center grads. All of them have been in the work place for some time now. At today’s prices, every one of them has lamented about the cost and how Art Center is not ’worth it’. Any school you go to will only be ’worth’ the amount of time/energy you put in; garbage in = garbage out. Establish residency in California and you’ll find equally challenging programs at CS-Long Beach, CS-Fullerton, etc. etc., but for A LOT less money.\n\nThere’s always an aleternative. . .\n\n"
    },
    {
      "time": " 28.Mar.2007 6.41pm",
      "content": "D’oh!\n\naleternative = alternative\n\n"
    },
    {
      "time": " 28.Mar.2007 6.44pm",
      "content": "i will check that book out. Luckily, i am a penny pincher, i hate spending money, so i am going to try my best watching my money.\n\nI actually called Art Center not too long ago about this very same thing William said, and they said if you are under 21 (i think), then they look at your parents financial conditions.\n\nBut yeah, i have been trying my best to have a plan for what i want to do. Being 18, i sometime get discouraged when i see other peoples work, or some of the big studios in LA and New York, and think that maybe i just was not born with natural talent. I have come to the conclusion thought that i will never know if i do not try, so if i get into Art Center, i might as well go and give it my all, and see where i go.\n\nA lot of people tell me “Austin is such a great place, how could you ever move to Los Angeles?” and i think there is just this feeling i have that i need to go live somewhere else for once, i have lived in Austin since i was 5, and i want to try something new, meet new people, and learn.\n\n"
    },
    {
      "time": " 28.Mar.2007 6.44pm",
      "content": "Josh, it’s very hard to exaggerate the merits of moving away.  \nEven if it’s to a place that’s “worse”.\n\n\\> my grandma had been putting aside money  \n\\> for my college every year since i was born\n\nInterestingly that’s how one of the students in those testimonials did it too. Except then she got sick and left him high and dry - which is when the scholarship kicked in. And yeah, like William said.\n\nPlus Jordan’s advice is golden too. A school like ArtCenter will actually drain some of your personal money on your student projects, but for the rest of your life try to get into the groove of being bohemian: this is the only time you’ll be able to do it with impunity, and it brings life into a very special perspective.\n\nhhp\n\n"
    },
    {
      "time": " 28.Mar.2007 6.45pm",
      "content": "\\>At today’s prices, every one of them has lamented about the cost and how Art Center is not ‘worth it’. Any school you go to will only be ‘worth’ the amount of time/energy you put in; garbage in = garbage out. Establish residency in California and you’ll find equally challenging programs at CS-Long Beach, CS-Fullerton, etc. etc., but for A LOT less money.\n\nreally? dang, hmm, i guess that is something i should think about.\n\n"
    },
    {
      "time": " 28.Mar.2007 7.17pm",
      "content": "I don’t have any experience with art schools in particularly, but here are my thoughts as one who spent a lot of time at Universities, as a student and teacher, and also sent my three kids to college.\n\nI assume you talked to students and attended classes when you visited. This is essential to seeing whether you are a good match—and doing the same for 4-5 other places. If the students who love it are like you, great. If those who hate it are like you, not so good.\n\nI am a great believer in the importance of the distinctive cultural chemistry or atmosphere of an institution. And you only get it by physically being there and talking to students and teachers. It is very important because that’s what you live with. The other thing, which is a totally different issue, is what kind of jobs the graduates go into. Does the Art Center actually have a cachet that gives you an advantage in the market place; and do they help graduates make the transition? Find out. The atmosphere and the job edge will help you judge about whether it’s worth the money.\n\nThere is also the question of great, inspiring teachers. Ask the students whether they have any of these. Even in the best institutions they are rare, and they also certainly exist at places that have less cachet. If you hear of some great teachers from the students, that is a very good sign.\n\n"
    },
    {
      "time": " 28.Mar.2007 7.29pm",
      "content": "wish i coulda’ gone to art center. lucky.\n\ninstead i went to a public university, lacking in funds and the appropriate curriculum. then again,i have learned a lot regardless i have a steady portfolio and am not up to my ears in debt i might never be able to pay off because my family and i are broke.\n\nwho is the lucky one? wish i knew. if opportunity is a’knockin’, look through the peep hole before you answer the door.\n\n"
    },
    {
      "time": " 28.Mar.2007 8.41pm",
      "content": "Wolfattack\n\nI’ve taught part-time at Art Center (book design, letterpress, typography) for about seven years now. It is expensive but you do get what you pay for. They have some very good programs. Automobile Design is second to none as I understand. And they do have state of the art facilities. I would say though, for the money spent, learn as much as you can, work as hard as you can. Leave the skate board in Texas (if you are serious). Then again, maybe not.\n\nAt any rate, I would think it is one of those rare places where the degree has some importance in the marketplace. But it is always what you put into it, and what you take away from it that matters.\n\n"
    },
    {
      "time": " 28.Mar.2007 9.30pm",
      "content": "_”...120,000 - 150,000 dollars, which is pretty freaking expensive.”_\n\nThat’s a fair bit of cash wolfattack - are you sure _you’re_ worth it... ;)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": " 29.Mar.2007 12.37pm",
      "content": "A couple of years after graduation I had a job tracking carnivores - bobcat, mountain lion, wolverine, fisher, etc. - with the wildlife department of the US Forest Service. It is worth noting that you can tell the difference between a wild animal and a domestic animal in the register of their prints. When a bobcat lifts its front left foot, for example, the rear left foot comes in and prints precisely in the same spot, no matter what speed the animal is moving. When you look at the print in snow there are sharp, crisp ridges between each of the pads; it looks like a single print, but is actually two.\n\nDomestic animals, by contrast, have a much more slovenly gait and leave tracks that are all over the place. It is as though they have become imprecise on a biomechanical level. The rear foot will frequently miss the print of the front foot entirely.\n\n"
    },
    {
      "time": " 29.Mar.2007 2.08pm",
      "content": "\\>A couple of years after graduation I had a job tracking carnivores\n\nDid you go to Art Center, or a different school? Are you still tracking animals or are you a designer now, just out of curiosity.\n\nThanks again for all the advice so far guys\n\n"
    },
    {
      "time": " 29.Mar.2007 2.59pm",
      "content": "I am a designer, but studied the fine rather than the graphic arts at a state rather than a private university. One rarely - if ever - achieves conventional success by unconventional means.\n\n"
    },
    {
      "time": " 29.Mar.2007 3.10pm",
      "content": "Not true in music at all - the trick is to keep your head on your shoulders after “The Man” comes around and tells you you’re cool.\n\nProbably true in most of the arts.\n\npeace\n\n"
    },
    {
      "time": " 29.Mar.2007 4.38pm",
      "content": "\\>One rarely - if ever - achieves conventional success by unconventional means.\n\nOkay, i see. So coming from your perspective, are you saying Art Center and graphic design are conventional and fine arts and State schools are unconventional?\n\n"
    },
    {
      "time": " 29.Mar.2007 4.51pm",
      "content": "Yes State schools are SO unconventional… :)\n\nArt Center has a sterling reputation. I live in LA. The environment here is challenging - there’s talent from everywhere converging trying to find the gold. Nothing has changed since 1849…\n\nAnd I like that.\n\npeace\n\n"
    },
    {
      "time": " 29.Mar.2007 5.00pm",
      "content": "\\>Yes State schools are SO unconventional… :)\n\nhaha, yeah i just sounded pretty stupid. Cut me some slack, i am stuck at home on pain meds for some torn ligaments in my ankle, but it is giving me some good time to work on my portfolio.\n\n"
    },
    {
      "time": " 29.Mar.2007 5.20pm",
      "content": "I thought you were making a joke…\n\nOf course I am an eLAlien… :)\n\nSucks about the ligaments - better put that board away for a while. Whatever you decide to do - best of luck!\n\npeace\n\n"
    },
    {
      "time": " 29.Mar.2007 6.48pm",
      "content": "[...skateboard deck chalkboard.](http://web.archive.org/web/20071102154305/http:/maryandmatt.net/Pages/cb.html)\n\n ![](http://web.archive.org/web/20071102154305im_/http:/www.typophile.com/files/chlkbrd1_5490.jpg)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": " 30.Mar.2007 1.55am",
      "content": "I graduated Art Center 7 years ago, and havent regretted the money spent for a second. It is a demanding education, and not all students make the best out of it, but the ones who do have a great career potential. Most of the guys I know got out and made 50-60K right off the bat, now they are around 100K + (this is all graphic designers).\n\nBUT, there are some that never had the drive and never went anywhere. I would also look into CalArts in Valencia if I was you. Difference between the two seems to be that ArtCenter is prepping you more for a professional career, and CalArts more creative push. I know great designers from both. If you think you can manage financially, and really want it, go ahead and do it.\n\n"
    },
    {
      "time": " 30.Mar.2007 9.50am",
      "content": "I teach Typography and Design in a Community College in the LA area, so I have some exposure to Art Center. Their program is very intense and can be completed in three years if one has the strength and $ to go continuously. Most of their “freshpersons” have several years of college already. I think that only a small percentage come directly from high school.\n\nMany local students go to Pasadena City College first to tighten up their admissions portfolio. The other posters are correct that there are some excellent programs at the local Cal State Universities including San Diego. CSU Long Beach has a national reputation in this area although it is “enrollment impacted” which means that it may be difficult to get classes. Admission into their upper division program is very competitive and available only to students who have been there for several semesters.\n\nAs a teacher, I tell my students that the greatest determinating factor in their education is their own contribution and effort, but that being said, a competitive place like Art Center can bring out the best in a talented and dedicated student.\n\nGood luck with your education!\n\n"
    },
    {
      "time": " 30.Mar.2007 12.23pm",
      "content": "\\>BUT, there are some that never had the drive and never went anywhere.\n\nYeah, I have always thought that there is no point in going to a design school unless you put everything you can into it. Especially since it costs so much, i definitely want go get as much out of those few years as possible. Thanks for the help.\n\n-Josh\n\n"
    }
  ]
}
