{
  "id": "32627",
  "title": "Adobe CS3 Design Premium Fonts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Has anyone found the list of included fonts for the new CS3 packages? I looked around adobe.com and found only vague references to \"over 100 fonts included\".  \nIn the CS2 copy, they refer to \"over 180 fonts included\". I do not know if this is just advertising copywriting, or if the fonts have been cut back. I am hoping to see Arno Pro in there.\n\nI am a community college educator. Our lab really depends on the bundled fonts, as we do not have the budget for outfitting 60 workstations with a large font library. We have to get along on system fonts and whatever Adobe gives us with the CS.\n\n",
  "author": "Beta",
  "time": "28 Mar 2007 — 2:40pm",
  "uid": "11821",
  "comments": [
    {
      "time": "28 Mar 2007 — 2:51pm",
      "content": "You will get Arno Pro with CS3 ... If you have a serial number for CS2 you can [download Photoshop CS3 beta](http://web.archive.org/web/20131013111855/https:/www.adobe.com/cfusion/entitlement/index.cfm?e=labs%5Fphotoshop) which includes Arno Pro.\n\n"
    },
    {
      "time": "28 Mar 2007 — 3:23pm",
      "content": "But the Arno Pro you get with the CS3 Beta is also a Beta font.....\n\n"
    },
    {
      "time": "28 Mar 2007 — 5:02pm",
      "content": "Well, yes, that is true. :^] But I did say you'd get it with CS3 so I was just saying it was available now ... but yes, only a Beta Version.\n\n"
    },
    {
      "time": "28 Mar 2007 — 6:22pm",
      "content": "Wow. I didn't realize that was included. What a beautiful type family.\n\n"
    },
    {
      "time": "31 Mar 2007 — 10:24am",
      "content": "All the various configurations of Creative Suite 3 will ship with Arno Pro and a medium-sized set of fonts. We'll be posting a list Real Soon Now. Hypatia Sans Pro will be available as one of the optional registration incentives, for the suites and individual CS3 applications.\n\nMore on these topics on my blog within the next week or two.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "31 Mar 2007 — 12:43pm",
      "content": "Thomas - I thought CS 3 was scheduled for spring release - it's spring!!! When will it be available?\n\nNow... tell me if I'm crazy. CS 2.3 premium retails for $1,199.00. CS 3 premium for $1,799.00. The upgrade from 2.3 to 3 is $440. So if I calculate properly it's cheaper for me to order CS 2.3 now and then buy the upgrade than to buy CS 3 from scratch?\n\nOr, conversely, to buy CS 3 Standard for the $1199 and then add on Dreamweaver (I don't use flash).\n\nI guess I'm pretty shocked at the $1799 sticker price for the Premium set! A pretty big bite for the freelance designer.\n\n"
    },
    {
      "time": "31 Mar 2007 — 1:30pm",
      "content": "Why don't you just ugrade to CS3 for $599 Patty? Check Adobe's upgrade qualifications and see what is best for you.\n\nChrisL\n\n ![](http://web.archive.org/web/20131013111855im_/http:/typophile.com/files/elegibility_6599.png)\n\n"
    },
    {
      "time": "31 Mar 2007 — 10:56pm",
      "content": "_Our lab really depends on the bundled fonts, as we do not have the budget for outfitting 60 workstations with a large font library._\n\nI haven't done the math on this, but I suspect that your software would be less expensive from this company:  \n [http://www.corel.com](http://web.archive.org/web/20131013111855/http:/www.corel.com/ \"http://www.corel.com\")\n\nCorel's applications come with fonts too, but you would have some money left over to let your students experience typefaces from a variety of foundries -- including Adobe. Surely working with faces like Gotham, Mrs Eaves and Chalet are an important part of a typographic education today?\n\n"
    },
    {
      "time": "1 Apr 2007 — 12:48am",
      "content": "Nick, I'm sympathetic to your arguments against bundling, and I license my share of type from independent foundries like yours. But suggesting that Bonnie's students forgo training with industry-standard tools from Adobe in favor of greater typographic variety is just silly. She'd be doing them a real disservice by following your advice.\n\n"
    },
    {
      "time": "1 Apr 2007 — 8:26am",
      "content": "\\>So if I calculate properly it’s cheaper for me to order CS 2.3 now and then buy the upgrade than to buy CS 3 from scratch?\n\nThat's what a lot of people are doing Patty.\n\npeace\n\n"
    },
    {
      "time": "1 Apr 2007 — 8:56am",
      "content": "I'm on it. Glad this thread got started and I figured this out before CS 2.3 was no longer available. Found it online for a bit cheaper than at Adobe's site too.\n\n"
    },
    {
      "time": "1 Apr 2007 — 9:00am",
      "content": "Take a close look at this link before you jump Patty:\n\n[http://www.adobe.com/cfusion/knowledgebase/index.cfm?id=tn\\_19582](http://web.archive.org/web/20131013111855/http:/www.adobe.com/cfusion/knowledgebase/index.cfm?id=tn_19582 \"http://www.adobe.com/cfusion/knowledgebase/index.cfm?id=tn\\_19582\")\n\npeace\n\n"
    },
    {
      "time": "1 Apr 2007 — 9:28am",
      "content": "Interesting. I already jumped, but I will have proof of purchase, in the form of a digital receipt and most likely a printed receipt when the product arrives.\n\nBut does this mean I might qualify to get the CS 3 upgrade for free? How do I find out if I'm eligible for this post-announcement upgrade? I can't find that info on the site. The other strange thing is they say \"Upgrades from $599\" but then also list the upgrade at $440. In any event unless it's free I'm not going to leap to it as my clients won't likely have it for months.\n\nI had thought you only needed a valid serial # for an upgrade, not proof of purchase. But I guess proof of purchase is necessary for the post-announcement upgrade because it's date-sensitive.\n\nThanks for the heads up. Maybe I'll call Adobe tomorrow to figure this out.\n\nApologies for thread-hijacking.\n\n"
    },
    {
      "time": "1 Apr 2007 — 5:56pm",
      "content": "_but suggesting that Bonnie’s students forgo training with industry-standard tools from Adobe in favor of greater typographic variety is just silly._\n\nMark, your practice is impeccable, but I should point out that Bonnie identified herself as an educator, not as an Adobe software trainer.\n\n"
    },
    {
      "time": "1 Apr 2007 — 8:09pm",
      "content": "Nick, you can't really suggest that she teach her students Corel over Adobe software? They'll never get jobs.\n\n"
    },
    {
      "time": "1 Apr 2007 — 8:20pm",
      "content": "\\> In the CS2 copy, they refer to “over 180 fonts included”.\n\nEach style (regular, bold, italic, light caption etc etc etc ) = 1 font.\n\n"
    },
    {
      "time": "1 Apr 2007 — 8:34pm",
      "content": "Nick, if you're suggesting that there's more to a design education than just learning how to use software, or that great design can be created with products other than those from Adobe, then I'm with you. (Heck, I started out using Ventura Publisher and Corel Draw.)\n\nBut, in the U.S. at least, experience with some combination of Quark Xpress, and the Big 3 (InD, AI, PS) from Adobe is required for the overwhelming majority of design positions, especially those that require the typographic savvy you (and the rest of us) advocate.\n\n"
    },
    {
      "time": "2 Apr 2007 — 7:17am",
      "content": "\"But suggesting that Bonnie’s students forgo training with industry-standard tools from Adobe in favor of greater typographic variety is just silly\"\n\nFor a designer, I'd argue type is a much more important tool than any particular flavor of image editing/DTP software.\n\n\"Nick, you can’t really suggest that she teach her students Corel over Adobe software? They’ll never get jobs.\"\n\nA good design education shouldn't consist of teaching software, but of teaching design. Students can learn software on their own.\n\n"
    },
    {
      "time": "2 Apr 2007 — 7:18am",
      "content": "So, can anyone recap the current deal? Does it make sense to purchase CS2 right now? Do we then get the free upgrade to CS3?\n\n"
    },
    {
      "time": "2 Apr 2007 — 8:36am",
      "content": "Darrel - I spoke to Adobe. If you purchase the full CS 2.3 premium right now (for $1199 + tax) you will get a free upgrade to CS 3 when it's released. It seems much easier to purchase it either from Adobe or a licensed reseller. I believe this offer is good for 30 days from the announcement date of March 27.\n\nBack to the thread - yes, of course you need to learn principles of design and type if you're going to be a designer. But it seems nonsensical to have students work in a software that is barely used professionally. Given that Bonnie is teaching at a community college and not Pratt I'd guess she's teaching the students professional skills as well as the fundamentals of design and therefore is right to have them working in InDesign, Illustrator or Quark.\n\nYou'd be hard-pressed to find a design job description that includes Corel, especially at the expense of those other programs.\n\n"
    },
    {
      "time": "2 Apr 2007 — 9:43am",
      "content": "Added to which the latest version of Draw doesn't run on a Mac.  \nGame, set and match, Adobe.\n\nBonnie, if you have a few cents left over after you've obscelesced last year's Apple and Adobe product, as an educational institution you can get a special deal on fonts (which are considerably more durable) from most foundries, including my own. There have been several threads about this at Typophile, eg  \n [http://typophile.com/node/29178](http://web.archive.org/web/20131013111855/http:/typophile.com/node/29178 \"http://typophile.com/node/29178\")\n\n"
    },
    {
      "time": "2 Apr 2007 — 9:52am",
      "content": "[Edit: This entire post was wrong. Mea culpa.]\n\n"
    },
    {
      "time": "2 Apr 2007 — 10:37am",
      "content": "Tiff,  \nI think you missunderstood Nick's post. The way I read it, he is saying that fonts (not just his) are more \"durable\" than the applications and computers that use them. I can still use my type 1 Adobe fonts from 1987 while my old Mac SE and Adobe Illustratoer version 1 are obsolete.\n\nChrisL\n\n"
    },
    {
      "time": "2 Apr 2007 — 10:55am",
      "content": "Ooh! :^( Dang!! I'll just edit my post and hope you, Nick, forgive me.\n\n"
    },
    {
      "time": "2 Apr 2007 — 11:48am",
      "content": "<cite>A good design education shouldn’t consist of teaching software, but of teaching design. Students can learn software on their own.</cite>\n\nGood point. While you’re at it write drawing, writing, and history out of design education as well. Those subjects can all be learned with a few trips to Barnes & Noble. Design firms will certainly appreciate your sentiments, they certainly have nothing better to do with their time than teach the interns how to use popular software.\n\n"
    },
    {
      "time": "2 Apr 2007 — 12:00pm",
      "content": "Aluminum - this is the kind of attitude that sends grads to me applying for a print job and when asked what ink density is - they stare at me blankly.\n\nAre you saying that the technical aspects of what we do are solely the students responsibility?\n\nI don't think it should be that black and white.\n\npeace\n\n"
    },
    {
      "time": "2 Apr 2007 — 1:15pm",
      "content": "I'd also argue (and I'm sure I'll be unpopular here) that design education is a waste of time. I learned on the job. As an employer I never cared whether an applicant had gone to design school. I'm for studying the ephemeral and impractical like philosophy or literature (or fine art!) and then taking a quick software class extracurricularly. Get an entry level job and you'll get your design education.\n\n"
    },
    {
      "time": "2 Apr 2007 — 1:49pm",
      "content": "The problem is that design schools continue to focus on the portfolio and not on the real world. Not enough business side at all.\n\n"
    },
    {
      "time": "2 Apr 2007 — 2:00pm",
      "content": "It is much tougher to talk someone into that \"entry level job\" these days though Patty. They want to make money on you right away and not take away time from other staff to train you.\n\nChrisL\n\n"
    },
    {
      "time": "2 Apr 2007 — 2:06pm",
      "content": "Couldn't agree more, Tiff.\n\nI'm a big proponent of (if you have the luxury) the real american university experience rather than going to trade school, which is what design school really is. And if it is trade school, it should be preparing you for the trade. Trying to make its goals seem any loftier than that is, IMHO, just pretension. And you cheat yourself out of a true well-rounded education. I don't know many people who went to design school - undergrad - who learned anything much about anything else. And design grad school - well why go into that much debt? Graphic design doesn't pay enough.\n\nI should clarify that I don't think design classes are necessarily a waste of time. But why narrow yourself down to design school when you're way too young to know what you really want to be doing? I don't think it gives you any advantages in the working world.\n\nAnd as long as I'm off on a rant, for any other job than entry-level I'd only hire someone with real work experience. For entry-level I didn't necessarily care if someone had much design experience, if they were creative and motivated they'd learn fast on the job. A lot of entry-level jobs require a good deal of grunt work before you get to really design anything and my experience was that design school grads were kinda expecting to be handed a nice juicy design to do on day one. I could live without the ego.\n\n"
    },
    {
      "time": "2 Apr 2007 — 2:11pm",
      "content": "pattyfab: <cite>But it seems nonsensical to have students work in a software that is barely used professionally.</cite>\n\nAgreed. Yet what 'used professionally' means may change during the course of a student life. When I studied, there was XPress and nothing else. At my university's design department, a single InDesign license was obtained upon my request and used by me and nobody else. Maybe two years ago they made a radical switch to Creative Suite. Today's students know of XPress by hear-say.  \nWith a designer life in mind, maybe students should be trained to ride different horses rather than one which is considered standard here and now, so: InDesign <cite>and</cite> XPress, Illustrator <cite>and</cite> Corel Draw. Software 'used professionally' is a quickly moving target. Now I notice that Freehand wasn't even mentioned on this thread.\n\n[edit: pattyfab, I saw your latest post after having posted mine -- in fact: a couple of latest posts ...]\n\n"
    },
    {
      "time": "2 Apr 2007 — 2:22pm",
      "content": "Maybe students should use cheaper software that is less feature rich than InD & QXP. Because that way they would have to concentrate on the process of designing, instead of 'learning' software and overusing 'features' that distract.  \nThere are some nice alternatives around, eg RagTime, Stone Create and VivaDesigner (VivaPress for the poor…).\n\n"
    },
    {
      "time": "2 Apr 2007 — 2:29pm",
      "content": "Patty,  \nI don't know what you think happens in design schools or which one you have experience with but they are not the same and many are far more than trade schools. It costs the same in time and money to major in philosophy as it does in design. I am not saying attending design school is essential but it certainly is more advantageous than a liberal arts education if you intend to find a career in design.  \nThere was no such thing as design software until I was in my 40s and I just picked it up on my own with no one to teach me. Anyone can learn it who really wants to. It helps if you know what it is for though.  \nAlso, egos are not limited to design school graduates. They can be found in equal numbers among all distributions of people.\n\nChrisL\n\n"
    },
    {
      "time": "2 Apr 2007 — 2:30pm",
      "content": "A short followup: VivaDesigner is very cheap and there even is a FREE licence:\n\n[http://software.viva.de/english/products/vivadesigner/](http://web.archive.org/web/20131013111855/http:/software.viva.de/english/products/vivadesigner/ \"http://software.viva.de/english/products/vivadesigner/\")\n\nCan you beat that? A 1000 bucks plus left to buy fonts with…\n\n"
    },
    {
      "time": "2 Apr 2007 — 2:37pm",
      "content": "Does anybody still use Freehand?\n\nI was trained in Pagemaker (on the job). That went out the window. I think students need to learn what's in common use at the time and when that shifts they'll learn the new programs as necessary. Besides once you have basic familiarity with one or more of these programs it becomes easier to learn the others. Like languages.\n\n"
    },
    {
      "time": "2 Apr 2007 — 3:11pm",
      "content": "Since I'm in print I wish that they would learn certain technical things about how to get print done effectively. It blows my mind that not one person straight out of school has ever been able to answer that simple question: What is ink density?\n\nUnless you are some designer who is so fabulous that the technical quality of your work doesn't matter and you are surrounded by production folks and separators to fix your mistakes (I consider them mistakes) then these are things you need to know.\n\nShould design courses not give some fundamental knowledge of real world conditions and technical problems?\n\nI just think you need to be technically as well as aesthetically sound to be truly employable.\n\npeace\n\n"
    },
    {
      "time": "3 Apr 2007 — 10:40am",
      "content": "\"Hypatia Sans Pro will be available as one of the optional registration incentives,\"\n\nHey! Can't wait! Thomas, can we get a tiny peek? We've seen and even used the early version of Arno. Just a snapshot, pleeease?\n\nPaul: Agreed. Graphic Design curricula generally seem to lack a substantial print production base. Lots of graphic designers need production people to make their creations printable.\n\n"
    },
    {
      "time": "3 Apr 2007 — 10:48am",
      "content": "\"Good point. While you’re at it write drawing, writing, and history out of design education as well.\"\n\nNo, that's all theory.\n\nListen, if you hire interns just to be production artists, fine, your argument makes sense. And students should DEFINITELY know the tools of the trade.\n\nHOWEVER, tuition should go towards quality education. Experienced professors and instructors. Not simple how-to tech classes.\n\nOur school, at the time, was big on this. Did a lot of kids graduate barely knowing how to use QuarkXPress? Yep. But they weren't great designers either. So, that just made it that much easier to cull them from the crowd. ;o)\n\n\"Those subjects can all be learned with a few trips to Barnes & Noble.\"\n\nIf you think learning a software program is as complex and vast as art history 101, then I guess you win the argument. Personally, my 5 year old can figureo out KidPix in 10 minutes, so I'm not too worried about upcoming genrations being able to figure out whatever software they have in front of them at the time.\n\n\"Design firms will certainly appreciate your sentiments, they certainly have nothing better to do with their time than teach the interns how to use popular software.\"\n\nThey certainly don't. They also shouldb't have to waste their time teaching their interns basic design concepts because they spend their classroom time learning InDesign QuickStart instead of proper type layout. ;o)\n\n"
    },
    {
      "time": "3 Apr 2007 — 10:59am",
      "content": "\"Aluminum - this is the kind of attitude that sends grads to me applying for a print job and when asked what ink density is - they stare at me blankly. Are you saying that the technical aspects of what we do are solely the students responsibility?\"\n\nThat's not quite the same thing. Learning ink density is a production concept of the media itself. And is important to learn. Learning a specific printing press? Not so much. The concepts are the same regardless of the printing press.\n\nTrapping, overprinting, CMYK, spot colors, line screens, etc...these are all important technical issues students should underststand. The specific software? Not so much, as understanding the underlying printing and pre-press technology is more important than a specific set of keyboard commands.\n\nI don't care you you use Adobe Illustrator, Freehand, Corel or inkscape to draw me a logo. If you understand the concept of printing, line art, and proper bezier curves, you'll do fine with any of them.\n\nMaybe another way to say this: It's easier to train staff on a specific piece of software vs. teaching them the vast underlying concepts and history of the media overall.\n\nTake web designers today. A lot of 'design schools' offer 'interactive design' which really is just a few semester's worth of Dreamweaver and Flash. These kids can't tell a UL tag from a MP3. As such, they really don't understand the medium they are working in. I'd much rather have a student that was tought HTML with notepad. I can teach them DW in a matter of hours if they fully understand the underlying concepts.\n\n\"Does anybody still use Freehand?\"\n\nI do. And it's like sticking with an abusive spouse. Yea, Freehand leaves us with a black eye every other weekend, but we love it so. Why can't I quit you Freehand!?\n\n(And may Freehand RIP...you will be truly missed!)\n\n"
    },
    {
      "time": "3 Apr 2007 — 11:12am",
      "content": "I think it's limiting to go to design school. Period. In many countries you are forced to decide on a \"trade\" before entering university. America still offers the liberal arts degree. I entered college expecting to major in art, ended up majoring in... art. But along the way I took astronomy, intellectual history, dance, psychology, russian literature, etc etc. Those were some of my best classes. I'd never have taken such a range of subjects had I been in design or art school (and if I had, the profs would probably not have been as good.) I feel like I graduated a more well-rounded, better-educated person than had I narrowed my focus to what interested me at age 18. And that no doubt makes me a better designer. It's not just about design.\n\nOr software.\n\nPlus I think it broadens one's perspective to be around all types of people, not only designers or artists.\n\nAnd yeah, I learned how to write, too. That has been an immeasurable help in publishing. It's amazing how illiterate some designers are.\n\n"
    },
    {
      "time": "3 Apr 2007 — 11:28am",
      "content": "Pursuant to the comment above mine - I think it's the responsibility of a design school to turn out designers who are employable. That means training them in design principles, current software, and in relevant technical issues. You can't cover everything, but the more a student is prepared to actually enter the profession, the better a job they'll get. Schools can't be asked to anticipate where the industry will be in the future, but they can do their best to prepare their students for the present.\n\nFor example too many design portfolios contain wildly impractical pieces such as books with 6 kinds of paper, metallic ink, die-cut, etc etc. This was my biggest problem with the design students I interviewed, many of them had little or no practical training. Design is an applied art, there is always a client, always a budget. Pretending that isn't so is foolish.\n\n"
    },
    {
      "time": "3 Apr 2007 — 1:08pm",
      "content": "Back to the fonts.  \nWhether experience with specific tyefaces/fonts is considered intellectual education or software training, students are being short-changed if all they've worked with are the Adobe bundle, no matter how good or inexpensive those fonts may be.\n\n"
    },
    {
      "time": "3 Apr 2007 — 1:09pm",
      "content": "Aluminum - the best way I know to train someone about ink density is to show them the Info Palette in Photoshop, show them how to read the density, and then show them how to achieve a given spec. It's a pretty abstract concept without applying it somewhere.\n\nOnce you know what it is and understand color management, then it is something you can implement.\n\nAnd overarching all this since I'm an auto-didact - I agree with Patty and will take it once step farther. I don't believe in school at all, not one bit. I believe in studying what drives you, not following a curriculum. I have no degree.\n\nSo there are many ways to get where you want to go. My way is looked down by society and many on this board (I've had this discussion before).\n\nFinally, I just wish the grads I interview had some clue about what it takes to print something correctly. Because so far, they don't. I have heard this complaint from many of my print colleagues.\n\npeace\n\n"
    },
    {
      "time": "3 Apr 2007 — 1:20pm",
      "content": "I agree with Nick if we are considering the larger picture. With student pricing in consideration -- as shown in the linked thread above -- it seems to me as if students should invest a little bit of that student loan money in a few non-bundled fonts.\n\n"
    },
    {
      "time": "3 Apr 2007 — 2:05pm",
      "content": "\"For example too many design portfolios contain wildly impractical pieces such as books with 6 kinds of paper, metallic ink, die-cut, etc etc. This was my biggest problem with the design students I interviewed\"\n\nI've found that there's 3 general groups of design graduates:\n\na) the group Patty describes. Comes from a respected design program, usually with a BFA. Work tends to be highly experimental and conceptual. Strong fine arts influence. Not necessarily practical. Student may or may not be technically savvy with the software.\n\nb) Also comes from a respected design program, usually with a BFA. Work tends to be more assignment based using more pragmatic scnearios. More emphasis on problem solving. Student may or may not be technically savvy with the software.\n\nc) The 2 or 4 year tech school. Might have a BS. Work tends to be quite bad conceptually and practically. Student does typyically have a solid grasp on the software.\n\nOf those, people from A or B tend to be the best hires for design work. Both have slightly different strengths, but, in the end, tend to make solid designers.\n\nGroup C never quite catches up, as they simply haven't had a solid foundation of art and design theory and history courses. Their skillset ONLY encompasses the ins and outs of a particular set of software apps. They may make decent production artists, but not terribly great designers.\n\nOf course, there's exceptions to all 3 of those groups, but, in general, that's how I see it...\n\n"
    },
    {
      "time": "3 Apr 2007 — 2:11pm",
      "content": "\"My way is looked down by society and many on this board (I’ve had this discussion before).\"\n\nI do mainly web work these days, and by far, the most intelligent, creative web developers I've met have had degress in:\n\n- Classical Music Composition  \n - Painting  \n - Geology\n\nOne gripe I had in the past with a lot of design firms was their insistence that every hire have a minimum 4-year design degree. That really limits your potential pool. In the end, you want to work with good thinkers more than anything.\n\nSo, yea, I'm with you on that. ;o)\n\n"
    },
    {
      "time": "4 Apr 2007 — 6:47am",
      "content": "Adobe is clever. They practically give away fonts in the Educational pack (less than $1 a font, I think). Other foundries are offering 20 and 30% discounts for students. Not in the same league.\n\nThe result is that the graduating student thinks first of Adobe, having worked with quality Adobe products and crap (sometimes/often) free web fonts while in school. So where does he/she look first when later specing and buying fonts?\n\nThe independent font producers might be wise to collaborate on a $99 package with 100 or more quality indie fonts. Then a school can make that a requirement, perhaps for second year students, who will be ready to expand their typographic horizons a bit.\n\nSuggesting that students buy individual fonts won't work. Good instruction works best if the students are on the same page with the same options. A teacher might assign a student to choose a good indie font, and 98% of students will come up with a web freebie, or a warez version of a commercial face.\n\nPractically giving away the fonts to students now will result in sales later on.\n\n"
    },
    {
      "time": "4 Apr 2007 — 7:57am",
      "content": "Not a bad idea, Don!\n\n"
    },
    {
      "time": "4 Apr 2007 — 10:10am",
      "content": "\\> Adobe is clever. They practically give away fonts in the Educational pack (less than $1 a font, I think). Other foundries are offering 20 and 30% discounts for students. Not in the same league.\n\nPlease bear in mind that Adobe isn't like ITC, Linotype etc etc. That said -- Type Foundry. However, they need to be like ITC, Linotype!!! That said -- more fonts + huge type dept!!!\n\n"
    },
    {
      "time": "4 Apr 2007 — 1:14pm",
      "content": "I just wanted to point something out about design school. I just graduated with a BDes from OCAD and had to take a full range of courses besides my main design ones in order to be eligiable for a degree as said by the government. I took geology, physc, history, english and math as well as several liberal studies courses.\n\nMy biggest gripe was not being able to take art/trade based classes such as letterpress because of the harsh distinction between art and design.\n\nAlso we were all trained on Adobe Software.\n\n"
    }
  ]
}
