{
  "id": "32656",
  "title": "\"Arial is designed for readability\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "How could you reply to a client claiming that he chose Arial because it is easy to read and most of his readers have eyesight problems? Please help. The more professional looking sources the better.\n\n\\_\\_  \nAL\n\n",
  "author": "fallenartist",
  "time": "29 Mar 2007 — 8:23am",
  "uid": "14482",
  "comments": [
    {
      "time": "29 Mar 2007 — 9:12am",
      "content": "Unfortunately, this is a subject of much controversy and claims of a research basis, when no decisive research exists.\n\nI think you can take two tacks on this. The first is to refer to actual large print books published for adults with visions problems.\n\nAccording to [this](http://web.archive.org/web/20150308211626/http:/www.gale.com/thorndike/about.htm), the world's leading publisher of large print books publishes their books in 16 point Plantin type with black ink on high opacity paper. In my view, the responsiveness of the market is probably the best test that exists now, and may influence your client.\n\n[Here](http://web.archive.org/web/20150308211626/http:/www.galeschools.com/thorndike/research.htm) is a reference to some research on large print. This is a biassed source, as they are selling large print books to kids, but still it is worth something. They also prefer seriffed fonts.\n\nThe 'research' on Tiresias claims the people self-report san serifs as being more legible. This 'research' is [very controversial](http://web.archive.org/web/20150308211626/http:/screenfont.ca/fonts/today/Tiresias/) and personally I think is completely unreliable as relates to print.\n\nThe other tack to take on this is to report the way typographers and type designers approach this, and their distinctions. Many distinguish between legibility and readability generally. Legibility is the ability to distinguish one letter from another. This is critical for signage.\n\nReabability has to do with ease of absorbing the message in extended text. The reality is that a very small amount of extended text is done in san-serif fonts, even though they are extensively used in titles and short copy. Hence by the test of what is actually done in print Ariel doesn't hold up.\n\nTypographers and type designers also distinguish between display and text fonts, and between fonts for screen and fonts for print. Arial can work as a display font and as a screen font. As a screen font it has been heavily 'hinted' so that its apprearance is actually very different from in print.\n\nThe best way to show that Arial is a bad text font--and I think it's just awful--is to put say Plantin or any other classic text font and Arial at the same copy in the same space.\n\nI recently had the following experience. Someone showed me a report in Arial. I said it would be better in Georgia. So I printed it out in the same format. She said, 'Arial looks more clear to me.' (It's what she always used.) Then I said, \"Try reading it.\" She said something like: \"Oh, yeah, it is smoother.\"\n\nTo me your main convincers are 1. What is actually done today with large print books, and 2. To do two or more settings of the same material, and actually have the client try to read it--not just look at it. If that doesn't convince then I think you're out of luck.\n\n"
    },
    {
      "time": "29 Mar 2007 — 9:40am",
      "content": "Depends where the reading is being done. On screen, especially in non-anti-aliased contexts Arial is esy to read, especially at the smaller sizes.\n\n"
    },
    {
      "time": "29 Mar 2007 — 9:49am",
      "content": "\\>Arial is esy to read\n\nThough not so easy as to catch one's own typos :)\n\nIt is a question of 'compared to what': screen Arial is EASIER to read than many fonts for screen, but it is also much HARDER to read in extended text than any of the widely used seriffed text fonts in print on paper.\n\n"
    },
    {
      "time": "29 Mar 2007 — 9:59am",
      "content": "I was really just offering a possible explanation for the clients confusion.\n\n\\>Though not so easy as to catch one’s own typos :)\n\nOn my machine it seems to be using Courier for comments. Arial would be a better choice ;-)\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:03am",
      "content": "Thanks William,\n\nActually it's all about (<cite>edit:</cite> printed) application forms and my first proposal was set in Myriad Pro which is narrower and definitely easier to read. After my client's previous e-mail with request \"please could you change the font to Arial\" I tried to explain the matter and even linked to Mark Simonson's article on Arial. But after my client's last message <cite>\"we have opted for Arial as it easy to read, and apparently is the choice font for people with eyesight problems (a lot of our clients are the older generation)\"</cite> I feel helpless. I don't care if the forms are in whatever typeface as it's not my most important project but would like to somehow politely make my client concious of being wrong.\n\n\\_\\_\\_\\_\\_\\_\\_  \n AL  \n [lenart.pl](http://web.archive.org/web/20150308211626/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:06am",
      "content": "Set it in Helv or AG and send it back :-)\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:08am",
      "content": "Microsoft's own research backs up the idea that Arial is inferior to Verdana and Georgia for readability. fwiw.\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:12am",
      "content": "The \"font of choice\" is a factual question, and I think that the links I give above show clearly that Arial is not the font of choice for those with eyesight problems. You can ask your client where he heard this, and give him the links. The large print movement I believe started in England, and you can probably find links there. Or just go to any library and pick the large print books off the shelf. I doubt you'll find a one in Arial.\n\nWhether there is a significant difference between Myriad and Arial for a form, I don't know. If the texts are very short, the questions of layout may be much more important.\n\nBut on the 'font of choice' for print for those with vision difficulties your client is just misinformed.\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:31am",
      "content": "Being a member of the \"older generation\" and a long-time trifocal wearer, I certainly don't find Arial easier to read than any number of other faces. Myriad, Verdana, and Georgia clearly read better to me as do hundreds of others both serifed and sans. Looks like your client is not interested in finding the real answer unless it is his own.\n\nChrisL\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:38am",
      "content": "Arial was recommended on the RNIB website as a good choice, it no longer recommends one particular typeface over another, this could be their source, alternatively that information has been repeated on other sites. That information seemed to be based on the bundled typefaces available on a pc rather than any wider research.\n\nOn the other hand if the client has requested it, a form would seem to be the best use for Arial, presuming that there isn’t a great deal of running text.\n\n\\>narrower and definitely easier to read  \nWhile I would accept that Myriad might be easier to read, narrower might not be a key point to mention to a client who is considering the readability of typefaces.\n\nTim\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:56am",
      "content": "Still recommended...\n\n[http://www.rnib.org.uk/xpedio/groups/public/documents/PublicWebsite/publ...](http://web.archive.org/web/20150308211626/http:/www.rnib.org.uk/xpedio/groups/public/documents/PublicWebsite/public_acinfaqs.hcsp \"http://www.rnib.org.uk/xpedio/groups/public/documents/PublicWebsite/public\\_acinfaqs.hcsp\")\n\n"
    },
    {
      "time": "29 Mar 2007 — 11:06am",
      "content": "\\>recommended\n\nHere is what they say:\n\n\"As a general rule, stick to typefaces that people are familiar with and will recognise easily, like Arial. Avoid italic, simulated handwriting and ornate typefaces as these can be difficult to read.\"\n\nThat is not a special endorsement of Arial, but a recommendation of anything familiar and not too ornate, like italic and handwriting fonts.\n\nIt is unfortunate that they mention only Arial. While it is, as you say, Si, a relatively good screen font, there is no evidence that it is better as printed text. And the market place in large print books for those with limited vision goes for serif fonts.\n\nOn the RNIB site they mention several teachers producing their own large print books in Arial. It is clear that many people in the UK think Arial has some special readability in print. This is unfortunate as there is zero evidence as to this.\n\nSi, do you think that Arial is significantly better for printed text than Plantin? Significantly worse? No difference?\n\n"
    },
    {
      "time": "29 Mar 2007 — 11:06am",
      "content": "This is from the link Si points to:  \n\"As a general rule, stick to typefaces that people are familiar with and will recognise easily, like Arial. Avoid italic, simulated handwriting and ornate typefaces as these can be difficult to read.\"\n\nThis does not seem to recomend only Arial. It just says \"familiar with ...like Arial\".\n\nChrisL\n\n"
    },
    {
      "time": "29 Mar 2007 — 11:17am",
      "content": "Tim, by saying narrower I meant the size of the font can be bigger. I guess 7 pt Myriad instead of 6 pt Arial is an obious choice.\n\n\\_\\_\\_\\_\\_\\_\\_  \n AL  \n [lenart.pl](http://web.archive.org/web/20150308211626/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "29 Mar 2007 — 12:00pm",
      "content": "\\>Still recommended…  \nI should have known it might be still in there somewhere, my search failed to find it. Although I remember another section that recommended Arial over Times New Roman, which was partly the reason I feel they were based on pc bundled typefaces.\n\n\\>It is clear that many people in the UK think Arial has some special readability in print.  \nUntrue and based on a similar lack of evidence.\n\nIf the users of the form have a problem with reading due to poor eyesight I doubt that 7pt Myriad or 6pt Arial will do them any favours.\n\nTim\n\n"
    },
    {
      "time": "29 Mar 2007 — 12:21pm",
      "content": "\\>Untrue and based on a similar lack of evidence.\n\nI may be mistaken, but we have just seen significant evidence. RNIB had recommended it according to you, and still mentions it favorably. That means that significant numbers of those attentive to issues of limited sight in the UK have a positive view of Arial. The three teachers they mention on the site also using Arial in self-produced large print books is also evidence. Also Aleksander's client. As none of these have got it from deep study of the issue, it means that there is something of an 'urban legend' going on. I see these facts, few though they are, as significant evidence of a legend.\n\nWhy do you say it is untrue?\n\nAlso there is a temptation in those who haven't tried it to think that in general sans must be more legible, because they are simpler. I have seen this again and again, such as in my friend who preferred Arial until she actually tried a side-by-side test in reading.\n\n"
    },
    {
      "time": "29 Mar 2007 — 12:48pm",
      "content": "\"Also there is a temptation in those who haven’t tried it to think that in general sans must be more legible, because they are simpler.\"\n\nSans vs Serif is not the issue here. This can open up yet another round of that too often refought battle and not help resolve the issue at hand.\n\nChrisL\n\n"
    },
    {
      "time": "29 Mar 2007 — 1:15pm",
      "content": "\\>This does not seem to recomend only Arial.\n\nDon't have time to look through all 93 (or is that 24) referenes to Arial on the RNIB site...\n\n[http://search.msn.com/results.aspx?q=site:www.rnib.org.uk+RNIB+arial&lf=...](http://web.archive.org/web/20150308211626/http:/search.msn.com/results.aspx?q=site:www.rnib.org.uk+RNIB+arial&lf=0&rf=0&FORM=MSRE \"http://search.msn.com/results.aspx?q=site:www.rnib.org.uk+RNIB+arial&lf=0&rf=0&FORM=MSRE\")\n\n;-)\n\n"
    },
    {
      "time": "29 Mar 2007 — 1:40pm",
      "content": "Si, I found an outright recommendation:\n\n\"reproduced in a clear sans-serif typeface, such as Arial or Helvetica, with a font size of at least 14 points (i.e. the same size as this text) \"\n\nThis is in a document called \"Accessible formats for older people with sight problems.\"\n\nAgain, so far as I know this is a myth.\n\n\\>Sans vs Serif is not the issue\n\nChris, I do think this is part of the issue. The legend of the readability of Arial is because it has been the most accessible sans on most people's computers for a long time.\n\nThere does seem to be good evidence that large print is helpful to the visually impaired, but none as far as sans vs serif. And certainly not as to whether Arial in particular is good.\n\nI tend toward the view that serifs are generally better for print text, but the fact is that research hasn't decided the issue.\n\nFor the RNIB to propagate this is not responsible, in my opinion, and maybe some of you Brits can set them straight as to the state of the research--and the fact that large-print books are generally in seriffed type, it seems by popular demand.\n\n"
    },
    {
      "time": "29 Mar 2007 — 4:35pm",
      "content": "Saw a lecture by one of the most 'professional sources' on readability, Gerard Unger, at the London Typographic Circle a few years ago. In the context of work for a Dutch newspaper he compared Helvetica letterforms (closed shapes) and Frutiger (open shapes) to guests at a party who hadn't been introduced properly. Helvetica was an awkward \"Hey, do you think we should join together and form words?\", \"I don't know shall we? Maybe we should, maybe we shouldn't, I don't really know.\" and with Frutiger it was \"Yes, let's all get together and form words! That would be great!\". So if your client is insisting on a sans maybe get them to compare reading Arial with reading the same thing in Frutiger or anything else with a 'open' shapes.\n\n"
    },
    {
      "time": "29 Mar 2007 — 5:12pm",
      "content": "\\>Gerard Unger ...Helvetica letterforms (closed shapes) and Frutiger (open shapes)\n\nHere you are getting into subtleties that typographers and type designers find quite important. But none of this has been scientifically tested, that I am aware of.\n\nPersonally, my take on the relative unreadablity of Arial and Helvetica as text vs the better readability of Unger's sans faces is not only the openness, but also that they are oval rather than round. This changes the way they can space together.\n\nI very much look forward to reading Unger's book on readability, which is about to come out in English.\n\nBut at the same time we have public institutions like the RNIB ignorant of both the state of the science and the practitioners' lore. And not only do they not know about these things, but they propagate what is very likely false information :(\n\n"
    },
    {
      "time": "29 Mar 2007 — 8:34pm",
      "content": "<cite>...my client’s last message “we have opted for Arial as it easy to read, and apparently is the choice font for people with eyesight problems (a lot of our clients are the older generation)” I feel helpless. I don’t care if the forms are in whatever typeface as it’s not my most important project but would like to somehow politely make my client concious of being wrong.</cite>\n\nUnless you really need the money, just send the client an email telling them that you’re dropping the job. Explain that they clearly know how the job needs to be done, so there’s no need for your expertise, and that they should handle the design themselves. If that doesn’t make them see their error, little else is likely to.\n\n"
    },
    {
      "time": "30 Mar 2007 — 12:42am",
      "content": "The critical point of this thread seems to me to be is Arial or Myriad, at 6 or 7 point respectively, capable of working in the situation of a form? I am inclined to think that although the difference might be significant the overall effect would be the same – that some readers will find it difficult to read and complete the form. Perhaps the most significant area to advise a change of typeface at this size is the similar forms of some numerals, if they are required in the form.\n\nWilliam, I found the conclusion (that many people believed Arial was endowed with some special readability quality) that you drew, joined too few dots for me to agree. I agree that the effect of RNIB’s advice is wrong, which is why I mentioned it, following a similar thread I wrote to RNIB asking about the sources for their advice, I did not receive a reply, however I don’t believe that they would give the recommendation based on no evidence whether or not it has any genuine research behind it. There are situations where a sans performs better than a serif and for people with some kinds of impairment there is belief and user-evidence that serifs hinder the reader, I believe that the effect is that a lowest common denominator (even if it is inaccurate) has been applied. As I said before the typefaces mentioned by RNIB seem restricted to bundled system fonts and the advice is aimed at giving non-designers best practice guidelines to produce letters, communications etc. unfortunately non-designers insist that this advice is followed in print and without contrary evidence (or even a respected national organisation offering opposing advice) there is sometimes no alternative but to follow their instructions.\n\nI cannot find any authoratitive information that Aleksander can show his client, maybe this will offer some help.  \n [http://www.textmatters.com/our\\_interests/guidelines/typog\\_visual\\_impaired/](http://web.archive.org/web/20150308211626/http:/www.textmatters.com/our_interests/guidelines/typog_visual_impaired/ \"http://www.textmatters.com/our\\_interests/guidelines/typog\\_visual\\_impaired/\")\n\n\\>dropping the job  \nNot really a practical solution\n\nTim\n\n"
    },
    {
      "time": "30 Mar 2007 — 4:58am",
      "content": "\\>I don’t believe that they would give the recommendation based on no evidence whether or not it has any genuine research behind it\n\nTim, I wish I could say that I am being unreasonably cynical here. But my experience is whereever there is evidence to support their viewpoint, people will make a point of quoting it. Indeed people often even claim support from evidence when there is none.\n\nI commend you for contacting the RNIB about the issue. If you involve others, such as those teaching typography at Reading, I suspect they will be more forthcoming. The fact that they did not reply reinforces my suspicion that they are expressing an opinion not backed by any kind of testing, scientific or not.\n\nI find it very plausible that they would jump to the conclusion that because sans are simpler they are more readable, because I have seen it often, such as the case of the friend I mentioned.\n\nThe 'text matters' guidelines are puzzling because they contradict the RNIB guidelines while refering the them as an authority. Also they do not mention the critical importance of large--generally greater than 12 pt--type for the visually impaired. Large type size seems to be the only thing that is really well established as important for the visually impaired. I say this not because of any scientific paper, but simply that large print books are evidently very widely used by the visually impaired. If type size weren't important for this population they wouldn't use the large-print books.\n\n"
    },
    {
      "time": "30 Mar 2007 — 5:27am",
      "content": "The Text Matters article continues over several pages, the next page makes mention of the size issue, again referring to RNIB.\n\nThis document (similar to the one you quoted does include some reference to further reading and legal requirements)  \n [http://www.rnib.co.uk/xpedio/groups/public/documents/PublicWebsite/publi...](http://web.archive.org/web/20150308211626/http:/www.rnib.co.uk/xpedio/groups/public/documents/PublicWebsite/public_progressinsighttext.txt \"http://www.rnib.co.uk/xpedio/groups/public/documents/PublicWebsite/public\\_progressinsighttext.txt\")\n\nThe Lighthouse link brings up this, again not conclusive or based on quoted research.  \n [http://www.lighthouse.org/print\\_leg.htm](http://web.archive.org/web/20150308211626/http:/www.lighthouse.org/print_leg.htm \"http://www.lighthouse.org/print\\_leg.htm\")\n\nMy cynicism needs more work :)\n\nTim\n\n"
    },
    {
      "time": "30 Mar 2007 — 5:48am",
      "content": "I believe I read somewhere, typically I cannot find it now, that Bruno Maag was involved in some research in this subject. There is a pdf link from the Dalton Maag website, which is specifically to do with type and signage at the Olympics, it seems he shares your cynicism abut typeface choice.  \n [http://www.daltonmaag.com/news/32.html](http://web.archive.org/web/20150308211626/http:/www.daltonmaag.com/news/32.html \"http://www.daltonmaag.com/news/32.html\")\n\nTim\n\n"
    },
    {
      "time": "30 Mar 2007 — 6:40am",
      "content": "With Photoshop Lens Blur tool you can do your own \"research\". I used same blur settings for both text samples:\n\nArial, tracking 25\n\n ![](http://web.archive.org/web/20150308211626im_/http:/typophile.com/files/arial_5597.gif)\n \n ![](http://web.archive.org/web/20150308211626im_/http:/typophile.com/files/arial_blur_5314.gif)\n \n ![](http://web.archive.org/web/20150308211626im_/http:/typophile.com/files/arial_blur_light_3694.gif)\n  \n--\n\nMyriad Pro, tracking 25\n\n ![](http://web.archive.org/web/20150308211626im_/http:/typophile.com/files/myriad_5323.gif)\n \n ![](http://web.archive.org/web/20150308211626im_/http:/typophile.com/files/myriad_blur_6725.gif)\n \n ![](http://web.archive.org/web/20150308211626im_/http:/typophile.com/files/myriad_blur_light_3682.gif)\n\n\\_\\_\\_\\_\\_\\_\\_  \n AL  \n [lenart.pl](http://web.archive.org/web/20150308211626/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "30 Mar 2007 — 6:40am",
      "content": "Our center for dissabilities assistance uses Lighthouse as a sourse. Here is a snip from their recomendations for low vision users:  \n\"Avoid complicated, decorative or cursive fonts and, when they must be used, reserve them for emphasis only. Standard serif or sans-serif fonts, with familiar, easily recognizable characters are best. Also, there is some evidence that sans-serif fonts are more legible when character size is small relative to the reader’s visual acuity.\"\n\nChrisL\n\n"
    },
    {
      "time": "30 Mar 2007 — 8:06am",
      "content": "The Lighthough guidelines, unlike the RNIB ones, make excellent sense to me.\n\nEven that small sans are better for deciphering (slowly) than small serifs makes sense. But as they say, the key thing is large letters and high contrast. Once the letters are large enough to read, rather than simply decipher, I would suspect that the same preference for serifed faces in extended text holds as in the normally sighted world.\n\nThe best testing on legibility that I know of has been for [James Montalbano's Clearview Highway font](http://web.archive.org/web/20150308211626/http:/clearviewhwy.com/ResearchAndDesign/index.php). It went beyond the photoshop blur test, and did testing under highway conditions. It does confirm the idea that open counters are a plus for legibility, at least for signage.\n\n"
    },
    {
      "time": "30 Mar 2007 — 8:24am",
      "content": "\"Low Vision\" is not a sample of the larger normal vision group most of us belong to. I would not be too quick to equate findings for one group as valid for another. It may or may not be so but it is a stretch to assume as much. The Lighthouse for the Blind mentions \"some\" research saying sans serif seems better for low vision readers but does not seem to feel there is enough evidense to say so outright. I would avoid conclusions about readability/deciphurability extrapolated from highway signage research on normal vision readers as being valid with low vision readers of printed text until there is some real science in that arena.\n\nChrisL\n\n"
    },
    {
      "time": "30 Mar 2007 — 8:42am",
      "content": "\\>I would avoid ...extrapolation ...until real science\n\nI agree, Chris. The reason I mention the Clearview Highway research is that you can see what good tests look like, as opposed to no tests or bogus ones.\n\n"
    },
    {
      "time": "30 Mar 2007 — 8:51am",
      "content": "What I am about to say is not science but a lay mere observation of but two people. I have two longtime friends who developed macular degeneration (they don’t know each other). I knew them when they both had healthy vision as well. One of them is almost totally blind now and the other is severely limited. At some point along there loss of vision path, both of them began needing large-print to be able to read. One was an editor and the other an illustrator/graphic designer. The graphics person was more cognizant of type than the editor and was able to communicate more specifically about it to me. She mentioned specifically liking sans serif more as her vision got worse. The editor was less specific. She said “plainer” type was easier for her. Both said they liked more letterspacing than before and larger size was a must.  \nAgain, this is not scientific evidence and only addresses observations by two people with only one form of visual impairment. I am hoping that some real research is done by trained scientists in this area so that the laymen does not make assumptions which may seem logical to them but are not in evidence.\n\nChrisL\n\n"
    },
    {
      "time": "30 Mar 2007 — 10:35am",
      "content": "For what it's worth, I used to work for Reader's Digest where a lot of readers are elderly and have impaired vision. (There also is a large print addition of the publication as well.) One of the fonts we used was Vectora, because it was specifically designed to be read easily at small sizes. [Here's some info.](http://web.archive.org/web/20150308211626/http:/www.linotype.com/1577/vectora-family.html#usage)\n\nIf you want some leverage for switching to another face, I'd think about this as an alternative.\n\n"
    },
    {
      "time": "31 Mar 2007 — 4:51am",
      "content": "\"Microsoft’s own research backs up the idea that Arial is inferior to Verdana and Georgia for readability. fwiw.\"\n\nMS's study shows that the subject group preferred Verdana until and certain size, and then the subject group preferred Arial. Please READ the study, (if you can). If you still believe your statement after that, I'd be delighted to change your mind.\n\nIn this designer's case, selecting a font for forms to be filled by older users, size is more important than style. The designer, in my opinion, is likely to be destroying their profit margin by arguing about it.\n\n"
    },
    {
      "time": "31 Mar 2007 — 4:54am",
      "content": "Sorry, not perfect enough:\n\n“Microsoft’s own research backs up the idea that Arial is inferior to Verdana and Georgia for readability. fwiw.”  \nMS’s study shows that the subject group preferred Verdana until a certain size, and then the subject group preferred Arial. Please READ the study, (if you can). If you still believe your statement after that, I’d be delighted to change your mind.\n\nIn this designer’s case, selecting a font for forms to be filled by older users, size is more important than style. The designer, in my opinion, is likely to be destroying their profit margin by arguing about it.\n\n"
    },
    {
      "time": "31 Mar 2007 — 2:27pm",
      "content": "Hi David,  \nHere is the article I think Thomas is talking about. What study are you talking about?\n\nText Legibility and the Letter Superiority Effect  \nAuthors: Sheedy, James E.; Subbaram, Manoj V.; Zimmerman, Aaron B.; Hayes, John R.  \nSource: Human Factors: The Journal of the Human Factors and Ergonomics Society, Volume 47, Number 4, Winter 2005, pp. 797-815(19)\n\nCheers, Kevin\n\n"
    },
    {
      "time": "1 Apr 2007 — 10:29am",
      "content": "I saw a lovely comment about legibility which said (and I paraphrase):\n\n\"Legibility is about familiarity. If we want to increase legibility, stop designing new typefaces\"\n\nI suspect there is a lot of truth in this, and of course, if the world were forced to choose one typeface, what would it be...\n\nNo, there are no prizes for guesssing.\n\nI haven't had time to read through the full postings, but my suitably cynical view is that Arial is lauded because it's common, and free.\n\n"
    },
    {
      "time": "1 Apr 2007 — 3:29pm",
      "content": "Kevlar: \"What study are you talking about?\"  \nThe shadey Sheedy study, one and the same.\n\nThis study admits that size is a critical aspect of readability, but maketh not attempt to normalize the x-hts of Verdana and Arial to the same size when presented to the reader... does it? so, the subjects like the smaller sizes of Verdana (because theya re bgger than Arial), and the larger sizes of Helvetica (becasue they are smaller than Verdana), now don't they? big deal, unless you are interested in the effects of optical scaling, which we are not in this study....\n\nIn addition, the two fonts are not hinted equally and neither is hinted well, (except for WYSIWYG applications). Do you understand that? This study was not typographically peer-reviewed and it is of little, bordering on no, practical use, except as I have implied, for testing optical scaling, and the uses that you might put to it.\n\nDo you want me to go on to the next test?\n\nCheers!\n\nBerlow\n\n"
    },
    {
      "time": "1 Apr 2007 — 5:10pm",
      "content": "_The more professional looking sources the better._\n\nWhat typographers really want, something from a boffin to back up their preferences.\n\n\\*\\*\\*\n\nWith that in mind, I think I'll rename my foundry \"Readability Fonts\".  \nAll the fonts are of course designed for readabiity (none for unreadability) and backed up with statements from various authorities stating that,  \n\"Sans serif faces are more readable\" (for the sans faces)  \n\"Serif faces aere more readable\" (for the serif faces)  \n\"large x-height faces are more readable\" (for the large x-height faces)  \n\"small x-height faces are more readable\" (for the small x-height faces)  \n\"scripts are more readable\", and so on.\n\nCheers!\n\nShinn\n\n"
    },
    {
      "time": "1 Apr 2007 — 5:30pm",
      "content": "David, I'm sorry you find Sheedy's research inadequate. I think his work is excellent. My team has sponsored much of his work and we provide him with research, engineering, and typographic consulting.\n\nI ask that you reread his work for I think you missed a few points. Table 1, which takes up much of page 801, shows the conversion between point size and the number of pixels of lowercase height and uppercase height for each of 6 fonts. He presents data both in terms of nominal size and pixels used.\n\nPage 803: \"Results calibrated to font size (FS in Figure 2) show Verdana has the best legibility for both capital letters and for words, Times New Roman (TNR) has the worst, and the other two are in between. When the results are normalized for letter size (LS in Figure 2), Verdana continues to have the best capital letter and lowercase word legibility.\"\n\nThis work is much more interesting than a comparison between typefaces. Sheedy demonstrates that letter legibility is greater than word legibility (named the letter superiority effect). Lateral inhibition in the retina is the likely cause for this - essentially that neighboring letters makes letter feature recognition more difficult.\n\nCheers, Kevin\n\n"
    },
    {
      "time": "1 Apr 2007 — 11:27pm",
      "content": "I'd also be mentioning that Myriad may be a better choice from a branding perspective. It may be harder to explain to a client without a design background, but to me, Myriad gives an impression of a quality and friendliness moreso than Arial. I'd also be looking at whether the use of Arial was consistent with the client's other printed materials.\n\nAnd if my persuasive powers were still unaffective, I'd say \"fine, have your Arial!\"\n\n"
    },
    {
      "time": "2 Apr 2007 — 5:35am",
      "content": "\"Sheedy demonstrates that letter legibility is greater than word legibility (named the letter superiority effect).\"\n\nLegibility in the Sheedy study amounts to discrimination affordance at thresholds of size. Sheedy demonstrates that discrimination affordance at threshold sizes is greater for isolated letters than for letters in words. If reading performance is a curve that rises steeply from a threshold and than hits a plateau, then these tests say something about letter identification at threshold sizes, but nothing about the height of the plateau, and it's extent. It might be argued that the plateau is the domain of readability and visual wordform resolution affordance.\n\nThis means that the comparison of the four fonts used, Arial, Verdana, Times New Roman and Georgia is in terms of relative discrimination affordance at thresholds of size in terms of letter identification when letters stand alone and when letters are in the context of words.\n\nIt could be argued that the task (to identify at thresholds) forces the subject to revert to a letter by letter processing routine, thus bringing into play the inhibitory force of contour interference. (Contour here means somthing more like 'adjacent stroke of flanking letter' than what is meant by contour in a vector description environment.)\n\nIf lateral inhibition or contour interaction is the likely cause of the poorer performance on words, then the results suggest there is an interaction of font and amount of lateral inhibition or contour interaction. And this is different when fonts are compared by assigned font size versus absolute letter size in pixels!\n\nAlso, uppercase was used in the isolated conditions and lower case was used in the letters in words condition, but the cap height was normalized to the height of the lower case x-height in the letter size comparisons.\n\n"
    },
    {
      "time": "2 Apr 2007 — 6:26am",
      "content": "\"we provide him [Prof. Sheedy] with research, engineering, and typographic consulting.\"  \nIs that all? Seriously, you don't supply him with Money, Goals and Fonts too?\n\n\"neighboring letters makes letter feature recognition more difficult.\"  \nThanks, but it is an inevitable consequence of our script and language that neighboring letters be there. That letters need to be properly and consistently formed, and that words be formed from these kinds of letters is a given for me.\n\nOr can you explain this please?\n\nCheers!\n\n"
    },
    {
      "time": "2 Apr 2007 — 6:30am",
      "content": "To add to my post above, Sheedy et. al., draws conclusions that appear generalize his results concerning thresholds to legibility, readability and reading as such.\n\nIn terms of the curve mentioned above (rises steeply from a threshold and than hits a laterally extended plateau), this is like applying the results calculated at the base of the steep rise for one task (letter identification under two conditions) to what happens on the plateau for another (visual wordform resolution)!\n\nSheedy of course admits his generalizations require confirmation.\n\nNote: I encountered the steep rise / extended plateau scheme in Denis Pelli's paper \"Reading is crowded\" but I don't think it originates with him.\n\n"
    },
    {
      "time": "2 Apr 2007 — 7:08am",
      "content": "I am curious why the effort was put into studying individual letter recognition. There must be some basis that would be strong enough to commit funds to do it? Letter-to-letter interaction is always going to happen if we are to create words. Comprehension requires it. The grouped letters may interfere with single glyph recognition but aid in word recognition. This would seem like more fruitful ground for research rather than the opticians vision test chart. Perhaps Kevin or someone involved with the test can explain what the objective of the study was?\n\nChrisL\n\n"
    },
    {
      "time": "2 Apr 2007 — 7:53am",
      "content": "\\>The grouped letters may interfere with single glyph recognition but aid in word recognition. This would seem like more fruitful ground for research ...\n\nThat has been Peter E's argument in his Paper in Thelessoniki and since in post after post on Typophile. It only took me only about a year to understand him :) I see you get his idea too.\n\nKevin has argued that this is not a particularly promising line of research, as it contradicts the prevailing parallel letter-processing view--what Peter calls 'slot processing'.\n\nI was initially very skeptical of Peter's view, but now I think he's right.\n\n"
    },
    {
      "time": "2 Apr 2007 — 8:04am",
      "content": "\"...not a particularly promising line of research, as it contradicts the prevailing parallel letter-processing view\"\n\nAll the more reason to investigate it! Is there petty politics in research too? I was hoping that scientists had more sense than that.\n\nChrisL\n\n"
    },
    {
      "time": "2 Apr 2007 — 8:49am",
      "content": "Chris, as David notes, one of the problems of scientific research is that funding sources tend to prejudice goals and results.\n\nIn the Microsoft video on ClearType, it was revealed that the project was greenlighted by Bill Gates on the proviso that measurable results be obtained. That's understandable, the boss is an engineer; but it leads to a situation that ties font development to reading research in a way where each channels the other, resulting in \"go faster\" fonts and the privileging of the contextually-divorced notion of speed as the main criterion of readability.\n\n"
    },
    {
      "time": "2 Apr 2007 — 8:56am",
      "content": "Great responses -\n\nI'd just like to add one more point for this argument...\n\nThis of course, based on why we study typography to begin with.\n\nWhen we were in school, learning how to read with our primers, we learned to recognize the printed LETTER. Most primers from Uncle Remus to Dick and Jane were set in Century Schoolbook - with yes, slab serifs -- to help our little eyes grow more accustomed to the set word.\n\nAs we grow older - we find it is still EASIER for reading large paragraphs (body text) in a serif typeface.\n\nMy favorite example of this was in a type book - where the same headline - set in both San Serif and Serif - were cut in half - and only the top half of the letters shown. 10 out of 10 people had no problem figuring out what the words were from the Serif typeface -- can't say that about the san serif.\n\nOh yes, and Arial is definitely a San Serif!!! LOL\n\nCase closed. :)\n\n"
    },
    {
      "time": "2 Apr 2007 — 8:57am",
      "content": "In terms of the topic of the thread, the Sheedy results might lead one to say: Yes, Arial might be _designed for_ readability, but in terms of discrimination affordances _at thresholds of size_ for _normal sighted_ readers it is out-performed by Verdana at both nominal and x-height normalized sizes (more for the latter) on letter identification tests.\n\nWhat might _designed for_ mean?\n\n"
    }
  ]
}
