{
  "id": "32658",
  "title": "111 years later, Akzidenz in Greek & Cyrillic",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "It took a bit of time, but [Akzidenz Grotesk](http://web.archive.org/web/20150106212434/http:/typophile.com/wiki/Akzidenz%20Grotesk) is here in Greek & Cyrilic as a true OPENTYPE PRO family:\n\n[http://www.bertholdtypes.com/bq\\_library/790030.html](http://web.archive.org/web/20150106212434/http:/www.bertholdtypes.com/bq_library/790030.html \"http://www.bertholdtypes.com/bq\\_library/790030.html\")\n\n(I wonder whether there where any Greek hands involved in this... long expected font)\n\n",
  "author": "spyros",
  "time": "29 Mar 2007 — 8:48am",
  "uid": "10156",
  "comments": [
    {
      "time": "29 Mar 2007 — 9:53am",
      "content": "The Berthold press release doesn't mention the designers invovled in the extension work... [http://www.microsoft.com/typography/links/news.aspx?NID=5786](http://web.archive.org/web/20150106212434/http:/www.microsoft.com/typography/links/news.aspx?NID=5786 \"http://www.microsoft.com/typography/links/news.aspx?NID=5786\")\n\nI have no idea who does the dev work for them, and my guess is that whoever they are, they are under NDA :-)\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:19am",
      "content": "Odd thing is it looks like they used the same ogonek from the regular weight all the way through extra bold. It looks pretty wimpy there hangin' out of the bolder weights like a broken wire coat hanger. That makes me wonder if they were using a Greek consultant for the Greek glyphs.\n\nChrisL\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:44am",
      "content": "\"a Greek consultant\"\n\nI thought there is only one! Gerry, been on any trips to Chicago recently ;-)\n\n"
    },
    {
      "time": "29 Mar 2007 — 11:34am",
      "content": "Are there any Berthold employees or contractors at Typophile? Now is the time to come out of the closet and claim your fine work!\n\n"
    },
    {
      "time": "29 Mar 2007 — 11:36am",
      "content": "No, I've had no involvement in designing these fonts. But I wouldn't object to a trip to Chicago, mind you, if anybody out there is offering!\n\n"
    },
    {
      "time": "29 Mar 2007 — 2:27pm",
      "content": "From Myfonts... \"In recent years creative work centers on the “type atelier” in Munich where Dieter Hofrichter and Bernd Möllenstädt work with type design master craftsman Günter Gerhard Lange.\" Is Dieter a Greek name? ;-)\n\n"
    },
    {
      "time": "29 Mar 2007 — 3:03pm",
      "content": "I'm afraid not. Sounds German to me...\n\n"
    },
    {
      "time": "29 Mar 2007 — 5:26pm",
      "content": ":-)\n\nChrisL\n\n"
    },
    {
      "time": "3 Apr 2007 — 1:41pm",
      "content": "Well, after Spyros' alert, the Greeks (who do not all live in Reading :-) ) found out that the development work for Akzidenz Greek (and not only for this typeface) was done by Panos Haratzopoulos (Cannibal Fonts [fonts.gr]), after discussing it with Matthew Carter (who developed Helvetica Greek) and Dieter Hofrichter.  \nCheers, typophiles!\n\n"
    },
    {
      "time": "3 Apr 2007 — 3:56pm",
      "content": "...and I didn't really understand the connection between the ogonek and the Greek consultants. I obviously missed a joke (?)\n\n"
    },
    {
      "time": "3 Apr 2007 — 4:05pm",
      "content": "Hi Angelo,\n\nI don’t think it was a joke. I think the point was that the ogonek design showed little input from an ogonek expert (ie. Adam Twardoch or Fillip Balzek) so led Chris to believe that maybe the Greek was done without Greek consultation. Glad to hear that wasn’t the case.\n\nHowever if anyone can think of a joke, or better yet a pun, involving the ogonek and Greek consultants then Chris can. I’ll start him off… “Gerry and Kimis walk into a bar in Warsaw…”\n\n"
    },
    {
      "time": "4 Apr 2007 — 6:21am",
      "content": "Gerry and Klimis walk into a Packed Warsaw bar and order Gin and Monotonic. Adam Twardoch is in a nearby booth amorously involved with a young lady. Their mutual flirtations become vocal and obvious enough that everyone in the bar is complaining to the bartender. The bartender says something in Polish to the passionate couple. Everyone in the bar cheers. Gerry and Klimis don’t understand Polish so they ask the bartender what he said. The bartender replies, I just said to them “Oh go neck in the park!”\n\nChrisL\n\n"
    },
    {
      "time": "4 Apr 2007 — 9:43am",
      "content": "Perfect! Thanks Chris!\n\n"
    },
    {
      "time": "4 Apr 2007 — 9:54am",
      "content": "Beware of Greeks bearing gifts--but that is a horse of a different color :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Apr 2007 — 4:34am",
      "content": ":D\n\nBack to the topic, the ogonek looks OK in the lighter weights but not so in the bolder weights. As for the Cyrillic, I think it is modeled on the authentic Akzidenz Grotesk Cyrillic which was offered by the St Petersburg branch of H Berthold AG in the early 20th century.\n\nMost certainly, the Cyrillic part does not come \"111 years later\".\n\nA.\n\n"
    },
    {
      "time": "5 Apr 2007 — 8:58am",
      "content": "- _As for the Cyrillic, I think it is modeled on the authentic Akzidenz Grotesk Cyrillic which was offered by the St Petersburg branch of H Berthold AG in the early 20th century._\n\nTo me it looks much closer to the [cleaned-up] adaptation—of the late 1960s? early 1970s?—developed by G.G.Lange and his team for Diatype, Starsettograph, Staromat, and other Berthold photolettering devices.\n\nSpeaking of which. Have you seen that movie on type design at H. Berthold AG (c. 1986), posted at _http://www.global-type-movie.de/mov/Berthold\\_type\\_design.mp4_  \nA real hymn to GGL...\n\n"
    },
    {
      "time": "5 Apr 2007 — 9:04am",
      "content": "Should I wait until a Sunday to play that hymm or is today OK? :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Apr 2007 — 9:48am",
      "content": "- _Should I wait until a Sunday_\n\nDear Chris,\n\nWith all due respect to GGL, he may be a father, and a son, but not the Holy Spirit, for sure.\n\n"
    },
    {
      "time": "5 Apr 2007 — 10:21am",
      "content": "LOL!!!  \nChrisL\n\n"
    },
    {
      "time": "5 Apr 2007 — 3:21pm",
      "content": "Well, almost...  \nProbably my post at a Greek forum was slightly misinterpreted by Angelo.\n\nI never had the privilege to discuss any project with Matthew Carter, I wish I had.  \nWhat I mentioned was that (in Helsinki) I had the chance to exchange views and listen from him about his experience in developing Greek Helvetica in the early 70's.  \nSecondly, as Dieter Hofrichter has worked closely with G.G. Lange, he explained to me several things about Lange's design approach and philosophy.\n\n"
    },
    {
      "time": "6 Apr 2007 — 9:44am",
      "content": "Thanks Panos! You know what happens to information after the first hand...\n\n"
    },
    {
      "time": "12 Apr 2011 — 4:44pm",
      "content": "Akzidenz Grotesk Cyrillic was designed by Gayaneh Bagdasaryan and Alexei Kassian in 2007.  \n [http://cyreal.org/cyrillics/akzidenz-grotesk](http://web.archive.org/web/20150106212434/http:/cyreal.org/cyrillics/akzidenz-grotesk \"http://cyreal.org/cyrillics/akzidenz-grotesk\")\n\n"
    },
    {
      "time": "13 Apr 2011 — 9:13am",
      "content": "On Sunday, it appears you need to try _this_ URL:\n\n[http://www.global-type-movie.de/Berthold\\_type\\_design.mp4](http://web.archive.org/web/20150106212434/http:/www.global-type-movie.de/Berthold_type_design.mp4)\n\nIt might be safer to go to this page\n\n[http://www.global-type.org/Type-Desig.738.0.html](http://web.archive.org/web/20150106212434/http:/www.global-type.org/Type-Desig.738.0.html)\n\nand click on the link there.\n\nHowever, if you go directly to [http://www.global-type-movie.de/](http://web.archive.org/web/20150106212434/http:/www.global-type-movie.de/ \"http://www.global-type-movie.de/\") you will see a page indicating the domain is parked, so I'm surprised the movie is still there at all.\n\nThe movie is 12 minutes and 40 seconds in length, and is, as might be expected, in the German language.\n\n"
    },
    {
      "time": "14 Apr 2011 — 4:29pm",
      "content": "<dl>\n<dt>• <em>It took a bit of time, but Akzidenz Grotesk is here in Greek &amp; Cyrilic</em>\n</dt>\n</dl><dl>\n<dt> </dt>\n</dl><dd>In fact, Akzidenz-Grotesk Cyrillic was there for quite a while. It is shown in the Berthold specimen of 1911.\n\n<dl>\n<dt><div class=\"imageWrap\"><img src=\"http://web.archive.org/web/20150106212434im_/http:/typophile.com/files/Akz-Gr_Cyr_Sm_6095.png\"></div></dt>\n</dl>\n</dd><dl>\n<dt>\n</dt>\n<dd>The above sample, from a catalogue of the Ivan Fedorov Printing Plant No. 3 (Leningrad, 1976), shows a badly worn font of <em>Rublenaya Garnitura demibold</em>, née Akzidenz-Grotesk, in 36 pt. (Didot). What was called <em>Rublenaya Garnitura regular</em> was actually the Russian version of Berthold’s (ealier Theinhardt’s) <a href=\"http://web.archive.org/web/20150106212434/http:/typophile.com/node/17643\" rel=\"nofollow\">Royal-Grotesk</a>. </dd>\n</dl>\n"
    },
    {
      "time": "14 Apr 2011 — 6:06pm",
      "content": "<dl>\n<dt><em>Akzidenz Grotesk Cyrillic was designed by Gayaneh Bagdasaryan and Alexei Kassian in 2007.</em></dt>\n</dl><dl>\n<dt> </dt>\n</dl><dd>This is my first time seeing this design. I am not sure it is available as a usable font. In fact, the lettershapes shown on <a href=\"http://web.archive.org/web/20150106212434/http:/cyreal.org/cyrillics/akzidenz-grotesk\" rel=\"nofollow\">cyreal.org</a> are different from the Berthold’s version (Akzidenz-Grotesk Pro+) linked by the ‘<a href=\"http://web.archive.org/web/20150106212434/http:/www.bertholdtypes.com/font/akzidenz-grotesk/proplus/\" rel=\"nofollow\">Buy this font</a>’ button:<div class=\"imageWrap\"><img src=\"http://web.archive.org/web/20150106212434im_/http:/typophile.com/files/Akz-Gr_Berthold-Cyreal_6140.png\"></div>\n\n<dl>\n<dt></dt>\n</dl>\n</dd><dl>\n<dt>\n</dt>\n<dd></dd>\n</dl><dl>\n<dd>Even if the Cyrial.org version shows the ‘Extended’ style of A-G, there are still many differences besides the proportions. I always thougt that the Cyrillic part of Akzidenz-Grotesk Pro+ was designed by <a href=\"http://web.archive.org/web/20150106212434/http:/paratype.com/help/designers/designer.asp?code=PT_EV\" rel=\"nofollow\">Vladimir Yefimov</a>.</dd>\n<dl>\n<dt> </dt>\n</dl>\n</dl>\n"
    },
    {
      "time": "15 Apr 2011 — 12:57pm",
      "content": "Dear Maxim,  \nYou're absolutely right. Cyrillics for Akzidenz-Grotesk Pro+ were designed by Vladimir Yefimov.\n\nThe [Condensed](http://web.archive.org/web/20150106212434/http:/cyreal.org/cyrillics/akzidenz-grotesk) version was designed by Gayaneh Bagdasaryan in 2006.\n\nApparently we've got it mixed up with [AG Book](http://web.archive.org/web/20150106212434/http:/cyreal.org/cyrillics/ag-book), which was designed by Gayaneh Bagdasaryan.\n\nWe've corrected that on our website.  \nSorry for misleading and thank you for spotting that.\n\n"
    }
  ]
}
