{
  "id": "32680",
  "title": "Carol Twombly.. Please help me!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have spent the past 3 weeks trying to obtain every piece of information about [Carol Twombly](http://web.archive.org/web/20131015174520/http:/typophile.com/wiki/Carol%20Twombly) for a project in my typography class. I keep seeing things on the web about interviews with her.\n\nIf anyone knows where (website) I can find an interview with her it would extremely helpful.\n\nI am also looking for information about her life today. Is she married? any kids? that kind of information. The last thing I found is that she retired from Adobe.\n\n",
  "author": "softbluecries1",
  "time": "29 Mar 2007 — 9:30pm",
  "uid": "17002",
  "comments": [
    {
      "time": "29 Mar 2007 — 9:41pm",
      "content": "If you can't find this info elsewhere, you might try Chuck Bigelow, he's in Rochester too (at RIT), and I'm sure he could fill you in on the details - he must know what she's up to.\n\n"
    },
    {
      "time": "29 Mar 2007 — 9:43pm",
      "content": "There's a decent interview of her in an old issue of Serif magazine. I myself have heard pretty much nothing of what she's done since Adobe. Question: will you be covering Mirarae well? It's a superb design, and proves ol' Blaise Pascal's maxim.\n\nBTW, I'm curious, what made you take this on?\n\nhhp\n\n"
    },
    {
      "time": "29 Mar 2007 — 9:55pm",
      "content": "I have contacted Charles Bigelow but the only information he could give me I already knew. How would I go about finding the issue of Serif Magazine? Is it viewable online?\n\nMy professor gave us a list of type designers and when I looked up her info I was interested. It is our final project.\n\n"
    },
    {
      "time": "29 Mar 2007 — 10:43pm",
      "content": "\\> How would I go about finding the issue of Serif Magazine?\n\nBy bartering with somebody who has it, hint hint? :-)\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2007 — 3:34am",
      "content": "There's a bit of info on her in Adobe's old promo mag, Font and Function. I'll try to hunt it up this weekend. Still, this would be not recent info, perhaps 10 years old.\n\n"
    },
    {
      "time": "30 Mar 2007 — 4:35am",
      "content": "Here is a scan of the designer page in an old Adobe Trajan specimen from 1989:\n\n ![](http://web.archive.org/web/20131015174520im_/http:/typophile.com/files/TwomblyAdobeTrajanBooklet_4565.jpg)\n\n"
    },
    {
      "time": "30 Mar 2007 — 5:30am",
      "content": "I remember I read an interview by Tim Rolands, it might be online.\n\n"
    },
    {
      "time": "30 Mar 2007 — 5:50am",
      "content": "Heather:  \nWhen is your assignment due?\n\n"
    },
    {
      "time": "30 Mar 2007 — 10:30am",
      "content": "The last I heard about Carol was that she wasn't married but had a steady and had gone off to Nevada or somewhere like that to weave. She liked skiing. She hated working at Adobe. She was knowledgeable about type but obviously wasn't interested in it by the time I was spending time with her between 1996 and 1998. It's a little cruel to say, but anybody who thinks she made, on her own, an important contribution to type design simply doesn't know anything about Carol Twombley other than the public relations puffery that Adobe put out about her. At Adobe she was hemmed in by powerful figures like Slimbach and Stone, and never had a chance to express anything particularly original. I don't think she had any interest in doing so. If she had, we would have heard something from her in all the years after. Or perhaps her decades of corporate warfare at Adobe had bludgeoned the creativity out of her. Type wasn't a happy story Carol and she got out as soon as she could. For the gory details, assuming they would talk, and I don't think they will, E.M. Ginger in Oakdale or Linnea Lundquist were (and I imagine still are) good friends. When all is said and done, Adobe Caslon is a fabulous typeface, perhaps the best text typeface Adobe ever produced in the Originals series. How much of it was Carol's and how much of it was Sumner Stone's? ? ? ? Sumner was, after all, the art director, and Sumner knows a lot about type . . . . . . . That last big family she did -- what name was it called? named after some sort of desert grass -- was misconceived in my opinion. Carol's story at Adobe is a classic and ugly and common tale of male subjugation. Was she particularly vulnerable? Why did she put up with it for as long as she did? Was there a happy ending? Lots of interesting questions.\n\nThere definitely was a mystique attached to her. How much that was the creation of Adobe's brilliant PR people and how much due to Carol's own talent and innate glamour, is not immediately apparent. But it was there. I know a type-besotted fellow who, when he was a teen, had a poster of Carol in his bedroom. You can imagine the rest. Of course he also believes in UFOs, but then lots of people do.\n\nWhat I'm trying to say is that the little that is known about Carol Twombley (does her name have an e or not?) is the result of a carefully constructed PR edifice. Arriving at the truth of what happened with her and type will bring you to some completely different places.\n\n"
    },
    {
      "time": "30 Mar 2007 — 10:44am",
      "content": "Heather, it sounds like you indeed chose an interesting candidate!\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2007 — 10:55am",
      "content": "Twombley spaces much better than Twombly - but like Wembley it is hard for Americans to pronounce.\n\n"
    },
    {
      "time": "30 Mar 2007 — 1:50pm",
      "content": "Hello Bill Troop !\n\n"
    },
    {
      "time": "30 Mar 2007 — 5:12pm",
      "content": "_I keep seeing things on the web..._\n\nHave you tried looking through those antiquated, old-fashioned things called books, like [this one](http://web.archive.org/web/20131015174520/http:/www.amazon.com/American-Design-Designers-David-Consuegra/dp/1581153201/ref=sr_1_1/102-2355574-4800156?ie=UTF8&s=books&qid=1175299580&sr=1-1)?\n\nThe world doesn't begin and end with the World Wide Web, y'know.\n\n"
    },
    {
      "time": "30 Mar 2007 — 6:30pm",
      "content": "\\>The world doesn’t begin and end with the World Wide Web, y’know.\n\n'begin', no, but 'end', let's wait and see.\n\nCheers, Si\n\n"
    },
    {
      "time": "30 Mar 2007 — 7:14pm",
      "content": "Yes Ricardo, I have looked through books. The assignment is due Tuesday.\n\n"
    },
    {
      "time": "30 Mar 2007 — 9:30pm",
      "content": "My apologies for the sarcasm, and good luck.\n\n"
    },
    {
      "time": "30 Mar 2007 — 9:51pm",
      "content": "Mr. Troop, I don't want to sidetrack this thread, but something has been bugging me since I read your long and opinionated comment -- no matter how well you know someone, aren't they entitled to some privacy? Would you want someone writing about **you** this way, and with this much detail, on a public forum?\n\nJust a thought.\n\n"
    },
    {
      "time": "31 Mar 2007 — 3:10am",
      "content": "If its factual, I say tell it and tell it some more.\n\nMike\n\n"
    },
    {
      "time": "31 Mar 2007 — 3:50am",
      "content": "BTW... I doubt your instructor knows more about her than you do. She has really been a silent figure in type. Bill Troops scandal is exclusive stuff there although I strongly disagree with his assessment of Chaparral.\n\n"
    },
    {
      "time": "31 Mar 2007 — 4:07am",
      "content": "_The last I heard about Carol..._\n\n...we would have heard something from her in all the years after...\n\n...assuming they would talk, and I don’t think they will...\n\n...were (and I imagine still are) good friends...\n\nWas she particularly vulnerable? Why did she put up with it for as long as she did? Was there a happy ending? Lots of interesting questions. [...] (does her name have an e or not?)\n\nLots of questions indeed. And comments bordering on the gossipy. Are these facts, or assumptions? And facts or no, if the subject herself and her friends are so quiet about it, maybe that means they don't want to talk about it.\n\n_I know a type-besotted fellow who, when he was a teen, had a poster of Carol in his bedroom. You can imagine the rest._\n\nNo, I can't. And what the heck is this comment supposed to mean???\n\n"
    },
    {
      "time": "31 Mar 2007 — 7:01am",
      "content": "this is a scream... i'm sure it's EXACTLY what heather's looking for.\n\ni think typophile should open up an entirely new forum category for humorous tabloid scandals of all our favorite designers.\n\n"
    },
    {
      "time": "31 Mar 2007 — 7:55am",
      "content": "Heather:  \nEmail me and I'll send you a scan of the Serif article, and another one from a 1994 Design Graphics magazine.\n\n"
    },
    {
      "time": "31 Mar 2007 — 8:27am",
      "content": "_Would you want someone writing about you this way, and with this much detail, on a public forum?_\n\nI agree. If anything, its just in poor taste.\n\n"
    },
    {
      "time": "31 Mar 2007 — 9:42am",
      "content": "\\>a little cruel\n\nI agree with Terry. I have no way of judging the accuracy of what Bill Troop writes, but whatever the truth it is not an excuse for cruelty. In traditional Jewish ethics this kind of thing is called lashon hara--the evil tongue--and is regarded not simply as in poor taste, but as seriously unethical.\n\nThere is enough cruelty in the world. Why add to it?\n\n"
    },
    {
      "time": "31 Mar 2007 — 10:27am",
      "content": "Chapparrall is a great face (although I always have trouble spelling it).  \nSo she definitely quit at the top of her game.  \nTwombly has her own style that runs through Charlemagne, Nueva and Chaparal -- too bad she didn't stick with the tour, we're missing the sans.\n\n"
    },
    {
      "time": "31 Mar 2007 — 12:24pm",
      "content": "Heather, you could simply use Dr Evil's background speach... [http://en.wikipedia.org/wiki/Doctor\\_Evil](http://web.archive.org/web/20131015174520/http:/en.wikipedia.org/wiki/Doctor_Evil \"http://en.wikipedia.org/wiki/Doctor\\_Evil\") and replace all Dr Evil references with Carol's name.\n\n"
    },
    {
      "time": "31 Mar 2007 — 4:50pm",
      "content": "Chaparral is a warm yet strong slab. It fits in place nicely.  \nHere is wishing Carol both a happy and a private life.\n\nChrisL\n\n"
    },
    {
      "time": "2 Apr 2007 — 10:03pm",
      "content": "Heather, I have a good interview with Carol from Design Graphics magazine, No. 4, 1994. I could send you a PDF if you want to contact me offline (if you haven't found it elsewhere).\n\n"
    },
    {
      "time": "3 Apr 2007 — 8:36am",
      "content": "\\>Mr. Troop, I don’t want to sidetrack this thread, but something has been bugging me since I read your long and opinionated comment — no matter how well you know someone, aren’t they entitled to some privacy? Would you want someone writing about you this way, and with this much detail, on a public forum?  \nJust a thought.\n\nI think you go too far. Have you read any biography of anyone published in the last 30 years? Or indeed any good biography published after 'Eminent Victorians' which I take as the gold standard for modern biography? There is a dose of behind the scenes truth in what I wrote but it is hardly salacious. There is no point in pretending that Carol's life in type was some sort of idyll. If it had been, she wouldn't have quit it. The original poster did ask for some biographical information. I provided some. What is your sense of biography and what it should provide? Let us say you're going to treat a type designer seriously. You want to know what motivated them to work in the first place, what kept them there, how their career evolved. When the career ends quite prematurely, you want to know why. There is certainly an inextricable link between anyone's personal life and private life, and anyone whose achievements are in the least substantial is fair game for biography. And let's face it: when a career does end prematurely, there is usually to some extent a tragic explanation. What exactly are you looking for? Could we have your theory of biography? What biographers do you most admire? What is it you like about the way they cover their subjects? Precisely what do you think a biographer should not cover, and why?\n\n"
    },
    {
      "time": "3 Apr 2007 — 9:23am",
      "content": "I would say that a few dishy paragraphs of specious hyperbole do not approach any reasonable description of good biographical information.\n\n"
    },
    {
      "time": "3 Apr 2007 — 10:58am",
      "content": "_I would say that a few dishy paragraphs of specious hyperbole do not approach any reasonable description of good biographical information._\n\nAbsolutely. There is a very large difference between divulging gossip, and chronicling one's life story. It seems pretty apparent who went too far here. I'd be very upset if I found a friend of mine sharing information like this on a public forum.\n\n"
    },
    {
      "time": "3 Apr 2007 — 11:13am",
      "content": "Bill, I agree with your rationale, but the tone of your original post is creepy.\n\n"
    },
    {
      "time": "3 Apr 2007 — 11:18am",
      "content": "You're also talking about someone who is not a public figure. Known in typographic circles, but to the general public - an unknown. And because you're talking to a relatively small group of people here it resembles gossip more than anything else.\n\n"
    },
    {
      "time": "3 Apr 2007 — 5:02pm",
      "content": "Plus, Mr. Troop, I believe you have not stated any intention to write a biography of Ms. Twombly. As far as I know, a biography would go through an editor before becoming public.\n\nBesides, a student asks for info for a school paper and you provide comments that are at best difficult to corroborate, as you yourself acknowledge... Where can she get a second opinion on what you say? I think it's pretty clear from some of your comments that you have some sort of beef against Adobe, as if you were defending Ms. Twombly, but then some of your other comments also make Twombly herself look bad...\n\nI'm sorry, but I agree with William Berkson's earlier comment about cruelty, and with what Terry, Nick, Dezcom and Christopher have posted.\n\n"
    },
    {
      "time": "4 Apr 2007 — 3:21pm",
      "content": "_As far as I know, a biography would go through an editor before becoming public._\n\nNot to mention fact checkers. And that interviews with all involved parties would at the very least be attempted...\n\n"
    },
    {
      "time": "4 Apr 2007 — 4:09pm",
      "content": "Wow, I didn't mean to upset anyone by asking for information. I thought that perhaps there was more information out there that I could not track down. I was not trying to pry into Carol's life, only looking for noted facts.\n\n"
    },
    {
      "time": "4 Apr 2007 — 5:19pm",
      "content": "Heather, I don't think it was your question that did any of the upsetting! :-)\n\n"
    },
    {
      "time": "5 Apr 2007 — 9:40am",
      "content": "Regarding the Design Graphics interview I mentioned (issue #4, 1994), I am surprised to see that it is still available [here](http://web.archive.org/web/20131015174520/http:/www.designgraphics.com.au/issues/backissues.php).\n\n"
    },
    {
      "time": "6 Apr 2007 — 12:22pm",
      "content": "Who is to say, as Mr Troop has said about Ms Twombly, that a career has ended \"quite prematurely\"? Certainly not a person who has not even done the research necessary to determine the correct spelling for the name of the person under consideration.\n\nCareers end for all sorts of reasons. People quit fine printing to do landscape work, or to become environmental activists. Peoples' interests and motivations change. A serious biographer does need to inquire about those changes. But no one in this discussion has done anything approaching a serious biography of Carol T. A little bit of sloppy innuendo, but that's all.\n\nLet it be.\n\npowers\n\n"
    },
    {
      "time": "7 Apr 2007 — 10:11am",
      "content": "These sanctimonious comments concern me. What do you complaining gentlemen want? The gospel according to the PR department? Is that where your heads are? In my view one should be glad, truly glad, to have done anything that warrants being talked about at all. My purpose here -- and it is a serious purpose -- was only to point out that anyone who wants to learn anything substantive about Carol will not find, in the sophomoric fantasies produced by PR scribes, anything that even tangentially approaches the truth. You cannot start with commercial material expressly designed to conceal a reality that almost rises to tragedy. Surely so much as that is evident? There is some sociologist of the 1940s or 1950s who wrote of persons who had important roles projected upon them -- for example, Marian Anderson, who wished to be a successful singer, not an ambassador for her race. Anderson nevertheless accepted this role when it was thrust upon her. In her way, I think Carol belongs to this type. The role of the successful, female, happy, fulfilled typeface designer was projected upon her because it was necessary for reasons of sentiment and commerce. It wasn't just Adobe that needed it -- so did the rest of us. Carol opted out. The reasons why are interesting and worth discussing; it would be a lovely subject for an above-average master's thesis.\n\n"
    },
    {
      "time": "7 Apr 2007 — 11:06am",
      "content": "There is some validity to the comments against Bill. His objectivity concerning anything related to Adobe is historically suspect (not that some people here can't be accused of the same thing, in the opposite direction). On the other hand, it wouldn't susprise me if Twombly actually appreciates seeing her story told in whatever way it can, whatever it is. Even if it's not fully accurate! It's a funny human reality, but sometimes you have to throw out conjectures to get the truth to come out, because some people don't speak out unless it's to defend themselves. And some people are too quiet for the own good, and sometimes they know it, and sometimes they appreciate the third-party expositions.\n\nThe way I look at it, it takes morally risky stuff like this to effectively  \ncounter the PR hogwash that's become the mainstay of this society.\n\nhhp\n\n"
    },
    {
      "time": "7 Apr 2007 — 12:19pm",
      "content": "Heather, a bit late, but this may be relevant to your project:  \n [http://vcj.sagepub.com/cgi/reprint/4/2/186](http://web.archive.org/web/20131015174520/http:/vcj.sagepub.com/cgi/reprint/4/2/186 \"http://vcj.sagepub.com/cgi/reprint/4/2/186\")\n\n"
    },
    {
      "time": "7 Apr 2007 — 1:15pm",
      "content": "\\>What do you complaining gentlemen want?\n\nWell, that you and others not say negative things about other people, \\*particularly in a public forum\\*, unless there is a compelling reason to do so.\n\nBy the way, the same concept that it is wrong to disparage others, even if what you say is true, is also present in Buddhist ethics. So if I am being sanctimonious, at least it is in two religions!\n\nNow what is a 'compelling reason' is, I admit, not always so easy to figure out. A lot of office gossip is prudent self-defense. But your comments about lack of originality are clearly to a big extent personal opinion--others in fact disagree--so that is not revealing helpful facts, but simply disparaging opinion and so is out of bounds by these standards.\n\nI know there are arguments on the other side of this issue. Somerset Maughm said with his usual wit that an ideal friend has \"a heart that is kind, a hand that is generous, and a tongue that is neither.\" But the reality is that toward the end of his life by following these standards he alienated and embittered his daughter and all his friends. Admittedly he was dotty by then, but still it clearly shows you what this kind of thing does.\n\n"
    },
    {
      "time": "7 Apr 2007 — 1:28pm",
      "content": "People who are part of the establishment don't like negativity.  \nYou see, it upsets the status quo that feeds them.\n\nhhp\n\n"
    },
    {
      "time": "7 Apr 2007 — 1:38pm",
      "content": "\\>part of the establishment\n\nHrant, if I am part of the establishment, you are the King of Armenia :)\n\n"
    },
    {
      "time": "7 Apr 2007 — 1:53pm",
      "content": "Nobody is pure anything, but everybody is more something than some others.\n\nhhp\n\n"
    },
    {
      "time": "7 Apr 2007 — 3:49pm",
      "content": "I suspect Todd Rundgren must have been contemplating this very matter in his double album of the early 1970s, _Something/Anything?_\n\n ![](http://web.archive.org/web/20131015174520im_/http:/typophile.com/files/f68971crhvi_4396.jpg)\n\n"
    },
    {
      "time": "7 Apr 2007 — 4:19pm",
      "content": "William, you are on thin ground here, and I doubt you have really read (why should you?) what I wrote or asked yourself how I could possibly be saying what I was saying. Very little of what I am saying is my opinion. How could it be? I make clear that to the extent I knew Carol at all, it was during her last couple of years at Adobe. So where does all of this come from? Well, obviously, from the people who were there at the time. Each one of course tells a different story. And I thought I was being terribly discreet at not going into any detail about who said what and what their possible motives might be. So who have I talked about Carol with? First of all with Carol. Second of all with Robert Slimbach, with Fred Brady, with Sumner Stone, with EM Ginger, with David Lemon, and with a lot of other people. They were all there; they each have a different story. I make a deduction when I say that Carol was a victim of the predominantly male culture in her environment, but I think it would be a safe deduction to make on far fewer facts. I don't think there's anything nasty in talking about it. It's simply what happened. I know perfectly well that Carol wasn't interested in doing type at the end, because she often spoke of it to me, and her wish to try out managerial projects instead --one of which was art directing me. I know there was a lot of tension. People really were saying, 'so-and-so is trying to stab me in the back -- please don't repeat this -- and don't think you can ever trust him/her/it --ever.' Good heavens, it was a viper's nest! On the tangential question of originality, you could learn much though far from all by digging through the archives of the type design list, which is where I think John Downer published a lengthy and I think quite convincing expose of the process that led to the creation of Trajan -- several years ago. An excellent piece of research on his part.\n\nBy the way, I have some reason to believe that some of my conversations with Carol were taped. Perhaps they still exist in some corporate archive?\n\nThe funniest remark she made is one I regret having made public, but since I have already long since done so, there's no harm in repeating it here. I had drawn her attention to the remarkable similarity between Robert's Cronos and Volker Kuester's celebrated Today Sans Serif.\n\n'Not again!' said Carol.\n\nFoolishly, I didn't ask her what she particularly meant by that. I really don't have the makings of a proper journalist.\n\nNobody has asked me what my personal feelings are in any of this. They're very simple. I was disappointed that Carol left Adobe without sorting out my project in the way she had promised, from the start, she would, if there was a problem. (She foresaw intractable problems from the start, and had candidly warned me that it was likely to end in tears, as it did.) On the one hand, I thought it was unnecessarily chicken-hearted of her. But by then I knew too much about what she was up against. It was impossible to blame her. I wasn't an angel myself at all times. There was an incident, when I was doing one of the first stories on OpenType, when Adobe PR wasn't I thought doing its job, and I exploded in a vile manner at one of the PR minions or product managers who I knew was a good friend of Carol's. Everyone was very polite about it -- they wanted a good story after all -- but I sensed I had done something awful not just to this woman but to all of her friends in similar positions there. I had taken unfair advantage of my position not just as a journalist but quite simply as a male, and it wasn't a good thing. Carol had to put up with this sort of thing for more than ten years. For me, being exposed to it for two or three years, part-time, and at the presumably safe distance of 3000 miles, was enough to wash me out for a decade as far as type was concerned. Carol tactfully put up with far worse for much longer. I have enormous sympathy with that.\n\nAnd no, I don't think these are things that, like cancer decades ago, should 'never be talked about'. Air it all out, I say!\n\n"
    },
    {
      "time": "7 Apr 2007 — 4:35pm",
      "content": "_Very little of what I am saying is my opinion. How could it be?_\n\nOkay, so let's clarify (these are direct quotes from one of your previous posts):\n\n_1. At Adobe she was hemmed in by powerful figures like Slimbach and Stone, and never had a chance to express anything particularly original._   \nSubjective.\n\n_2. I don’t think she had any interest in doing so._  \nOpinion.\n\n_3. If she had, we would have heard something from her in all the years after._  \nClearly an opinion.\n\n_4. When all is said and done, Adobe Caslon is a fabulous typeface, perhaps the best text typeface Adobe ever produced in the Originals series._  \nA nice compliment, but still _your_ opinion.\n\n_5. That last big family she did — what name was it called? named after some sort of desert grass — was misconceived in my opinion._  \nI find this comment dismissive and insulting. And if you were truly concerned about documenting \"truth\" or \"fact\" you would have left comments like this out of your post. That seems like A LOT of opinions to me.\n\n"
    },
    {
      "time": "7 Apr 2007 — 5:28pm",
      "content": "God this is boring. Do you have anything interesting to say about Carol or her work? And by the way has anyone here other than me said the slightest thing of interest about Carol or her work? For that matter, has anyone, ever, anywhere, treated her work in the last bit seriously? Has she ever had a Max Caflisch-quality critique? Probably not. If what I say about Adobe Caslon really is true (and I think it is), that's an example of blatant and hitherto uncriticized sexism on the part of the type community. What does Carol really mean to us then? What do we really want from her?\n\nBy the way, for a view of the early days at Adobe that enraged no less a personage than Hermann Zapf, see my Mac Directory article from a year or two ago on Sumner Stone's type:\n\n[http://www.macdirectory.com/newmd/mac/PAGES/REVIEWS/SizeDoesMatter/](http://web.archive.org/web/20131015174520/http:/www.macdirectory.com/newmd/mac/PAGES/REVIEWS/SizeDoesMatter/ \"http://www.macdirectory.com/newmd/mac/PAGES/REVIEWS/SizeDoesMatter/\")\n\nUnfortunately, while the magazine has posted two pages of the article in pdf (links at the bottom of the article -- it was designed and set by Sumner) the most important part, a full page illustration of Cycles and some other fonts showing why size optimization is necessary -- was never uploaded although I suppose I could post it on some site or another of my own. For what it's worth, I couldn't get the page 1 pdf to display in Safari when I tried it just now, though page 2 worked. It really did look good. Cycles is a great typeface! This article was written for a coffee table 'Mac lifestyle' magazine so it is necessarily drastically simplified by type people standards . . . . .\n\n"
    }
  ]
}
