{
  "id": "32700",
  "title": "problems with my usb drive?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i just bought a new 1G USB drive. But I’ve been having trouble with larger illustrator files [10 MB+]. They go on the card fine, but then when I try to open them on another computer, I almost always get an error message or it opens only patially.\n\nI know I’m giving it enough time to load on, and I’m properly removing the drive, but is it defective?\n\nshould I return it or am I missing something?\n\n [‹ Crit My Work..whats working whats not](http://web.archive.org/web/20081008041934/http:/www.typophile.com/node/32695 \"Go to previous forum topic\") [The differences between Meta, MetaPlus, Meta LL, and Meta LF? ›](http://web.archive.org/web/20081008041934/http:/www.typophile.com/node/32664 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081008041934/http://www.typophile.com/user/8034\" title=\"View user profile.\">evilfansanfran</a>",
  "time": "<br>",
  "uid": "8034",
  "comments": [
    {
      "time": " 30.Mar.2007 1.42pm",
      "content": "Are you copying to desktop or opening from USB drive - sometimes they will not open from drive and need to be copied to desktop.\n\n"
    },
    {
      "time": " 30.Mar.2007 1.58pm",
      "content": "sometimes, illustrator files will save to the usb drive as pdfs. try dragging the file directly onto the illustrator icon instead of double-clicking.\n\n"
    },
    {
      "time": " 30.Mar.2007 3.07pm",
      "content": "USB is awful slow - is it that or USB2? If it’s USB I would just use the second comments suggestion.\n\npeace\n\n"
    },
    {
      "time": " 31.Mar.2007 4.37am",
      "content": "I use USB all the time & I’ve only had some problems with Windows/Mac interaction. I’ve made the mistake of deleting a few Windows-files while the USB was still in my Mac & not emptying the trashcan. Now no matter what I do, I can’t get this stuff out of my trashcan. The files have been deleted, but the folders are still in my trashcan & I can’t seem to find any way to get rid of them.  \nI’ve never had any problems opening Illustrator files straight from the USB, working in them & saving them on the USB again. But then again, I don’t think I’ve ever had an Illustratorfile over 3 or 4 MB tops. How on earth did you manage to get it that big anyway? I have however opened & edited pdf-files approximately that size without any problems (accept maybe for some required patience).\n\n"
    },
    {
      "time": " 31.Mar.2007 5.14am",
      "content": "I would assume that esf has some placed PS files in there to get it that big. Either that or you are converting dxf files or some other kind of CAD file - those are the only pure vector files I’ve seen that get that big. I suppose you could also get there if you are rasterizing lots of objects and applying PS effects.\n\nPDFs are fine and perfectly editable if you use the Illustrator default preset when you save them. And they are a lot smaller. Although I prefer .ai since InDesign just loves native formats.\n\npeace\n\n"
    }
  ]
}
