{
  "id": "32701",
  "title": "HELP: Wedding Invitations / Paper Specs",
  "forum": "Design",
  "tags": [

  ],
  "content": " **I am designing invitations for a wedding, but cannot find any 6x6 inch sqaure envelopes.** I’ve looked through every swatch book I can find. Is there a trick to finding square envelopes? I can find them online, but I want them to be the same paper as the invites. I am looking for a slight off-white smooth paper and am too scared to order cream envelopes off the internet - for fear they will be way off color wise. I also need a smaller envelope to match for the RSVP. I am leaving the dimensions up in the air, until I find some envelopes, but these can’t be sqaure.\n\nAny advice?\n\n [‹ Balken typeface](http://web.archive.org/web/20080503010740/http:/www.typophile.com/node/32575 \"Go to previous forum topic\") [Sex Font? (Sorry!) ›](http://web.archive.org/web/20080503010740/http:/www.typophile.com/node/32694 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080503010740/http://www.typophile.com/user/16282\" title=\"View user profile.\">ms. pater</a>",
  "time": "<br>",
  "uid": "16282",
  "comments": [
    {
      "time": " 30.Mar.2007 1.40pm",
      "content": "I googled for “envelopes” and “square” and was given many pages of links. Here one which should help: [http://www.lcipaper.com/envelopes/square.shtml](http://web.archive.org/web/20080503010740/http:/www.lcipaper.com/envelopes/square.shtml). You might also try [paper.com.](http://web.archive.org/web/20080503010740/http:/www.paper.com/)\n\n"
    },
    {
      "time": " 30.Mar.2007 1.45pm",
      "content": "[Paper Source](http://web.archive.org/web/20080503010740/http:/www.paper-source.com/) has 6.5” square envelopes\n\n"
    },
    {
      "time": " 30.Mar.2007 1.47pm",
      "content": "How many invitations will be sent out? If it isn’t a large wedding, you could have the die made but tell your printer that you will be doing the converting. We have done this in the past for clients after a nationwide search (literally) for a paper converter to make some custom evenvelopes.\n\n"
    },
    {
      "time": " 30.Mar.2007 1.49pm",
      "content": "Darn it! I hit the post button instead of the preview before I was finished.\n\nTo continue:\n\n6x6 envelopes are already mass produced so many converters will have the die. You just give them the matching stock and - presto!\n\n"
    },
    {
      "time": " 30.Mar.2007 2.15pm",
      "content": "ohh... that sounds like an awesome idea. I will ask around because I keep finding lovely paper, but hate to settle on the envelopes. The wedding is small, only 100 invites will be sent out - so this I can handle. THANK YOU\n\n"
    },
    {
      "time": " 31.Mar.2007 3.43am",
      "content": "nice links everyone!\n\n"
    },
    {
      "time": " 31.Mar.2007 3.33pm",
      "content": "For only 100 envelopes I wouldn’t suggest getting them converted. Unless, of course, this is a wedding for the Donald or one of his kids.\n\n"
    }
  ]
}
