{
  "id": "32724",
  "title": "The old opt-shift shortcut in Quark; does it exist in InDesign?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I need help, otherwise I'll need a straight jacket.\n\nI'm sure all you Quark users have come to love the opt-shift and click shortcut to quickly apply a paragraph style from one paragraph to another (if you haven't you can have that one for free). I need to know if an equivalent exists in InDesign or am I destined to spend the rest of my life flicking little arrows up and down, or worse building a list of style sheets longer than the screen?\n\nAny help very gratefully received – very is such an understatement.\n\nThanks\n\nRobert\n\n",
  "author": "<a href=\"/web/20110602002232/http://typophile.com/user/14595\" title=\"View user profile.\">flowersandchocolate</a>",
  "time": "<br>",
  "uid": "14595",
  "comments": [
    {
      "time": "",
      "content": "I'm not sure if you can do that, and my InDesign book is at work. :-(\n\nBut what I do know is that you can set up your InDesign preferences to use QuarkXPress shortcuts, so that would be my first step. Good luck!\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the suggestion Ricardo. I'd actually tried that but no joy. I'm not sure it's an official Quark shortcut (although I'm happy to be told I'm wrong) so I don't know if it made it into InDesign's shortcuts :(\n\nThanks for the help though, I was convinced the first response was going to be the virtues of Quark over InDesign!\n\nRobert\n\n"
    },
    {
      "time": "",
      "content": "Sorry to hear that, Robert... I'm pretty sure that it's an \"official\" shortcut in Quark, or at least a documented one, because I first picked it up from a book about the program... But I know what you mean. And there are other Quark shortcuts that InDesign does not use in that mode either.\n\n"
    },
    {
      "time": "",
      "content": "What a shame that Quark let their market slip away like they did. For many years, they set the standard, but now InDesign is not only gaining, but I'd guess has surpassed Quark in usage. Especially since InDesign comes bundled with CS2 (and CS3). It's beyond me, though, why Adobe still insists on organizing the menus and shortcuts so differently between InDesign, Illustrator and Photoshop.\n\n"
    },
    {
      "time": "",
      "content": "anyway, to answer your question:  \ncan't you just use the eyedropper to apply paragraph attributes between graphs, just like we do in Illustrator?\n\n"
    },
    {
      "time": "",
      "content": "I just found a website where someone posed [the very same question](http://web.archive.org/web/20110602002232/http:/www.tek-tips.com/viewthread.cfm?qid=749324&page=102). One reply mentions the eyedropper tool, as Chuck says; the other reply sounds complicated but seems to work.\n\n"
    },
    {
      "time": "",
      "content": "Hi Robert. Contrary to what Ricardo says above I believe it was an undocumented, unofficial shortcut that came about in v.2 or v.3 of QX, and I remember reading about it in a trade mag (possibly the UK issue of MacWorld) rather than any Quark documentation. I never really had any call to use it because my production background meant that I usually assign keyboard shortcuts to stylesheets anyway... however I'm currently baffled because I can't get this feature to work in QX 6.5 at all. Can anyone confirm that it has been discontinued? And what version of QX are you using?\n\nAs Chuck says, InDesign has the eyedropper tool just like Illustrator; it has preferences (double click to ensure that the Paragraph Settings is checked), and it is contextual upon how (item, content, text) the target paragraph has been selected, although the paragraph styling will transfer if the text cursor is simply positioned within the target paragraph, much like that 'ol QX shortcut.\n\n"
    },
    {
      "time": "",
      "content": "Thank you for all the help from the various corners of the globe (is that possible :oS)\n\nUsing the eyedropper tool does seem to have the desired effect. It seems a little more fussy than the Quark way of doing things but I'm sure there are plenty of people who want - and need - this flexibility. I can now march onwards with my cobbled together typesetting . My only grumble is that I still need to click in the toolbar to activate the function; as Adobe haven't used the option-shift and click combo for anything else couldn't they have thrown it in anyway.\n\nBen. I was using QX 6.5 and the shortcut functioned fine for me. I'm not aware of any extensions I had enabled.\n\nOnce again, thanks for the help guys.\n\nHappy typing\n\n"
    },
    {
      "time": "",
      "content": "I can't figure out the eyedropper thing either. I miss that shortcut terribly, use it all the time in Quark. And if you're going to have to go click in the toolbar then you might as well just apply the style sheet. The QX shortcut was designed to enable you to work fluidly within the doc without needing to move the cursor over to a palette.\n\nI guess keyboard shortcuts for style sheets might be the way to go here. I never used them in Quark because I liked their own keyboard shortcuts (turning on and off the grid for example) but since I don't use InDy's keyboard shortcuts - in fact don't even know them - this might be something to look into.\n\n"
    },
    {
      "time": "",
      "content": "But here's another question - does InDesign have a keyboard way to jump to a specific page? In Quark it's command+J then you type in the page number. Much easier than scrolling thru the pages panel.\n\n"
    },
    {
      "time": "",
      "content": "There's a \"go to first\" and \"go to last\" as well as \"next\" and \"previous\" but no shortcut to random pages at will. I actually like he pages panel -- particularly for shortish documents with more than two numbering systems.\n\n"
    },
    {
      "time": "",
      "content": "I gots no probs with the pages panel, I just like a shortcut to a specific page. I work on some long-ish docs.\n\n"
    },
    {
      "time": "",
      "content": "Patty,\n\nyou can double click and enter the desired page to jump to at the bottom of the document window, which is marginally slower than the Quark keyboard shortcut, but a lot faster than scrolling through the pages panel.\n\n"
    },
    {
      "time": "",
      "content": "I use the eyedropper tool all the time, and find it very useful. The only problem is that you have to be quite careful when sampling, sometimes a wrong attribute is copied. I also like the fact that once you've got the sample in the dropper for text attributes, you can paint different texts with it (for example if there are several single words that need fixing).\n\n"
    },
    {
      "time": "",
      "content": "Patty, curious but true: that shortcut (Command-J and the pagenumber) also works in InDesign (at least in v.4.0.5/CS2)… Notice that typing Command-J highlights the spot Chris mentions.\n\n"
    },
    {
      "time": "",
      "content": "_Contrary to what Ricardo says above I believe it was an undocumented, unofficial shortcut that came about in v.2 or v.3 of QX, and I remember reading about it in a trade mag (possibly the UK issue of MacWorld) rather than any Quark documentation._\n\nHere's a screenshot from version 6's Help section.\n\n ![](http://web.archive.org/web/20110602002232im_/http:/typophile.com/files/qxp_6_help_5892.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I discovered the cmd+J thing too, It just caught me out that it doesn't bring up a box. In fact the result of pressing the keys is so anonymous it's easy to miss. Oh well, at least it made me popular at work. Now everyone can work more efficiently – leaving more time for cups of tea (oh dear that sounded terribly British!)\n\n"
    },
    {
      "time": "",
      "content": "Ooh thanks for the tip about command+J! I totally missed it for the same reason - it doesn't bring up a box and my monitor is so big I didn't notice the highlighting at the bottom. Too subtle, man...\n\nI did just accidentally enable Quark keyboard shortcuts in InDy and now am happily hiding my grids by just hitting the old F7 key.\n\n"
    },
    {
      "time": "",
      "content": "Good to see you embracing the new technology Patty ;o)\n\n"
    },
    {
      "time": "",
      "content": "One thing I have to admit about Adobe... they really went out of their way to please (and win over) QuarkXPress users... I think that if enough InDesign users tell them about these \"missing\" favorite Quark features and shortcuts, Adobe will try to add them to the next upgrade. Seriously.\n\n"
    },
    {
      "time": "",
      "content": "Of course! I'm not THAT old, for gods sake. Altho I have currently 2 clients who don't accept InDesign, only Quark, so I gotta stay current w/both. Old media (publishing) don't you know.\n\nI still need to understand this eyedropper biz tho. I know how to use it in Illy but not yet in Indy.\n\nFor the record I embraced the new technology back in the 80s and that got me my dream job, companies were desperate for computer-literate designers back around 1990.\n\n"
    },
    {
      "time": "",
      "content": "Handy tip: If you double-click on the eyedropper tool, the Eyedropper Options come up, and you can choose which attributes it will copy, depending on what you want.\n\n ![](http://web.archive.org/web/20110602002232im_/http:/typophile.com/files/eyedrop_options_4398.jpg)\n\n"
    },
    {
      "time": "",
      "content": "...and then, within each set of settings, there are MORE options for you to turn on or off. :-)\n\n ![](http://web.archive.org/web/20110602002232im_/http:/typophile.com/files/more_options_5859.jpg)\n\n"
    },
    {
      "time": "",
      "content": "[removed double post]\n\n"
    },
    {
      "time": "",
      "content": "Patty,\n\nyou just need to press the letter i to get the eyedropper, no need to click in the toolbar.  \nof course if you are using the type tool, you need to command click to \"deactivate?\" the type  \ntool, then press \"i\" to get the eye dropper.\n\nmaybe that is much more complicated than the Quark way though.\n\n"
    },
    {
      "time": "",
      "content": "It's more complicated. I mean, if you're gonna do all that then just click on the paragraph style.\n\n"
    },
    {
      "time": "",
      "content": "Ahh true.  \nBut what if  \nyou left your styles  \npalette all the way \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_over there.\n\nI just use the style palette too. But now that I know there was once an easier way,  \nI have become obsessed.\n\n"
    },
    {
      "time": "",
      "content": "Ricardo please accept my apologies for such a wrong-headed contradiction; I've just seen the same screen in my own QX copy's Help Viewer... and I've also just reread the line that specifies the text to be formatted this way must be in _the same text chain_. Duh!\n\nFWIW, I still favour keyboard shortcuts for para styles, especially ones that use the numeric keypad (with a modifier key).\n\n"
    },
    {
      "time": "",
      "content": "I'm all for using keyboard shortcuts for setting paragraphstyles. Did it in QXP and do it in InD.\n\nMy system (for what it's worth) is that I always use the modifier-key Option; row 1,2,3 is for Bodytype (eg with and without indent, slightly different h&j etc); row 4,5,6 for Subtitles in various guises and/or hierarchy; row 7,8,9 for Headings.\n\nSo in most of my layouts I use (Option) 1, 4 and 7, which makes doing the preliminary styling a no-brainer… ; )\n\n"
    },
    {
      "time": "",
      "content": "About the eyedropper tool: add to the shortcut CTRL-E (or whatever is standard) and you can be inside textboxes and at the same time choose the tool. The same tip goes for hide/show grids (CTRL-W) since you can be in a textbox and stay there and still hide show. Also, one risk of getting lots of mishaps in text.\n\nAlso, InDCS2 is pretty nice when right-clicking a paragraph style and choosing use this style then next style (and everything just gets the right style, if you built all styles on top of each other that is). And this connected to nested styles... :)\n\n"
    },
    {
      "time": "",
      "content": "No worries, Ben; it's not such a big deal, even though I felt the need to go and look that shortcut up after your comment. Which proves that I am just a stubborn Taurean, if you believe in such things! Thanks. :-)\n\nI have lately had to use InDesign more and more at work, and I am still learning as I go, so I will try out these latest tips from Bert and Copper.\n\n"
    },
    {
      "time": "",
      "content": "Speaking of the Styles palette  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_over there\n\nis there a way to move the styles, color, or pages palette any way other than up and down?\n\nI ask because one of the things that really bugs me about InDesign is the fact that when I jump to a spread (either on the pages palette or now that I know, using command+J) the spread shows up shifted way to the right in the window, with a vast empty area to the left of my verso. I can't see the full spread without scrolling it over to the left. And then all the palettes clustered and seemingly rooted on the right. Anybody else have this problem? Know the solution?\n\nNext style existed in Quark too, that's nothing new to Indy.\n\n"
    },
    {
      "time": "",
      "content": "Patty, just do a fast Command-Option-zero after the Command-J-number and you'll get the full spread centered. (Provided you have the main doc window positioned properly — without pallettes or panels obscuring it…)\n\nBTW I'm a Taurus too (with Taurus ascendant, to make matters even worse…).\n\n"
    },
    {
      "time": "",
      "content": "When I do that it reduces the spread. Then if I hit command-1 it looks ok. But still, that's a whole extra step. And if I hit command-0 (fit in window) it shifts the spread to the right again - centering the page in the window I suppose.\n\nI'm guessing the default for InDesign is to position the page in the center of the window. Which is fine if you're working in single pages but a huge pain if you're working in spreads and click on a verso. I'm going to look into Preferences and see if there's an override that would place the page at the left rather than at the center. Probably not.\n\n"
    }
  ]
}
