{
  "id": "32727",
  "title": "What have Frutiger's typefaces been used in?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Can anyone help me?\n\nI am trying to list as many different ways in which Adrian Frutigers typefaces have been used.(for a student project.) By “used” I mean adopted in brand identities, signage systems, etc.\n\nWhat i have so far includes; Avenir's use in the visual identity of Amsterdam and Univers's use in the Paris Metro, Montreal Metro and numerous airports.\n\nAny use will be of help but the quirkiest the better!\n\nThank you\n\n",
  "author": "<a href=\"/web/20110530070827/http://typophile.com/user/17749\" title=\"View user profile.\">Brett Stabler</a>",
  "time": "<br>",
  "uid": "17749",
  "comments": [
    {
      "time": "",
      "content": "Frutiger (1975) was made specifically for signage at the Paris-Roissy Airport (for a reference refer to Bringhurst's The Elements of Typographic Style, p. 257).\n\nAnd according to wiki:  \n[Frutiger] was commissioned in 1968 by the newly built Charles De Gaulle International Airport at Roissy, France, which needed a new directional sign system. Instead of using one of his previously designed typefaces like Univers, Frutiger chose to design a new one. The new typeface, originally called Roissy, was completed in 1975 and installed at the airport the same year.\n\n"
    },
    {
      "time": "",
      "content": "More information [here](http://web.archive.org/web/20110530070827/http:/www.linotype.com/2596/part1.html). It replicates Andys point about the Fruti airport usage, but part of the problem you face with this is that  \na) Frutiger is prolific – lots of examples from lots of typefaces  \nb) many corporate brand identities may have used the 'unquirky' Frutiger faces as a starting point, but will have tweaked them in development and application  \nc) Linotype doesn't appear to be trumpeting the 'quirky' aspects of Frutiger's work.\n\nI know that Meridien and Univers were used for corporate IDs for banks here (in NZ). Univers Condensed Thin and Ultra get used for film poster credit lines (as Stephen Coles has pointed out elsewhere on typophile).\n\n"
    },
    {
      "time": "",
      "content": "Very helpful guys, thank you!\n\nIf you can think of any of the brands you have mentioned in your second point (ben\\_archer) that would be great to add to my research. The link you gave was of great help also.\n\nThanks again\n\n"
    },
    {
      "time": "",
      "content": "Both CIBC and Scotiabank (two of the \"big four\" Canadian banks) use Frutiger as their corporate typeface.\n\n ![](http://web.archive.org/web/20110530070827im_/http:/typophile.com/files/CIBC2_6547.jpg)\n  \n\n ![](http://web.archive.org/web/20110530070827im_/http:/typophile.com/files/Scotia_4754.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Amtrak uses Frutiger in its brand identity.\n\n[http://www.amtrak.com/servlet/ContentServer?pagename=Amtrak/HomePage](http://web.archive.org/web/20110530070827/http:/www.amtrak.com/servlet/ContentServer?pagename=Amtrak/HomePage \"http://www.amtrak.com/servlet/ContentServer?pagename=Amtrak/HomePage\")\n\n"
    },
    {
      "time": "",
      "content": "The National Health Service in the UK appears to use Frutiger as its main corporate font. See for example:\n\n[http://www.nhsidentity.nhs.uk/nonstatutoryorganisations/index.htm](http://web.archive.org/web/20110530070827/http:/www.nhsidentity.nhs.uk/nonstatutoryorganisations/index.htm \"http://www.nhsidentity.nhs.uk/nonstatutoryorganisations/index.htm\")\n\n"
    },
    {
      "time": "",
      "content": "Even more specific:\n\n[http://www.nhsidentity.nhs.uk/mainidentity/index.htm#typefaces](http://web.archive.org/web/20110530070827/http:/www.nhsidentity.nhs.uk/mainidentity/index.htm#typefaces \"http://www.nhsidentity.nhs.uk/mainidentity/index.htm#typefaces\")\n\n"
    },
    {
      "time": "",
      "content": "A quirk of megacorp proportion. Critics would say that \"adopted\" is somewhat of a euphemism:\n\n[http://typophile.com/node/18257](http://web.archive.org/web/20110530070827/http:/typophile.com/node/18257 \"http://typophile.com/node/18257\")\n\n"
    },
    {
      "time": "",
      "content": "Thank you all! Some excellent examples, all very helpful. Please keep them coming, if you see any of frutiger's typefaces (Frutiger, Avenir and Univers are at the top of my list) used in anything, then please let me know.\n\nThanks again\n\n"
    },
    {
      "time": "",
      "content": "Safeway (US) does. [Frutiger](http://web.archive.org/web/20110530070827/http:/www.frutiger.com/) (CH) does not.\n\n"
    }
  ]
}
