{
  "id": "32730",
  "title": "A New Sans Serif Typeface Family Discovered in the Sierra Nevada",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [billdavis](http://web.archive.org/web/20110530071110/http:/typophile.com/user/3095 \"View user profile.\") : 31.Mar.2007 7.37pm \n\nAPRIL 1, 2007 – The view of picturesque Half Dome, in Yosemite National Park, was obscured this week by the mysterious appearance of a lowercase ‘e’. Other popular landmarks across the Sierra Nevada – often called the ‘range of light’ – experienced the strange effects of being encased in bezier curves.\n\n“This typo-geological effect is a rare occurrence” said officials at the U.S. Geological Survey. “It’s not often that typefaces take root in such an organic source.” Experts in the field noted that this particular typeface’s angular tension and smooth curves recalled the craggy formations of granite polished smooth by glacial activity found all over the Sierra Nevada.\n\nOne hiker on the scene remarked: “The designer’s obvious intent was to impart organic character to letter forms while retaining crisp readability. It could be the effects of altitude, snow-blindness or even poorly-fitted boots, but the effect is quite striking and could make for good reading.”\n\nRumour has it that the typeface will be named “Massif”. It is expected that the typeface will leave no trace once all of its family members are released to the public.\n\nMore information can be found here:  \n [http://www.ascendercorp.com/Ascender\\_fonts.html#massif](http://web.archive.org/web/20110530071110/http:/www.ascendercorp.com/Ascender_fonts.html#massif \"http://www.ascendercorp.com/Ascender\\_fonts.html#massif\")\n\n| Attachment | Size |\n| --- | --- |\n| [Massif.jpg](http://web.archive.org/web/20110530071110/http:/typophile.com/files/Massif.jpg) | 87.11 KB |\n\n",
  "author": "<a href=\"http://web.archive.org/web/20110530071110/http:/typophile.com/user/3095\" title=\"View user profile.\">billdavis</a>",
  "time": ": 31.Mar.2007 7.37pm",
  "uid": "3095",
  "comments": [

  ]
}
