{
  "id": "32738",
  "title": "Typophiles Take Over",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "AP (1 April 2007)\n\nIn stunning developments a formerly obscure group of type fanatics have asserted themselves in the public arena.\n\nStanding in front of the Washington monument, Chris Lozos has announced he will be running for President. When asked why he said that he hasn’t heard a single pun from any of the other candidates in either party. Challenged on his qualifications, Chris argued that anybody could do better than the current guy.\n\nIn a related development Hrant Papazian has been annointed King of Armenia. King Hrant’s first act was to declare that there will never be another election in Armenia, as he intended to save his country from the pitiable fate of Los Angeles, California.\n\nIn Beirut, Lebanon, John Hudson announced his conversion to Islam, and has been appointed chief negotiator to reconcile Hezbollah and the government of Israel. Speaking through a translator, Hudson explained that Arabic is much more elegant than his former Church’s blackletter, and the Lebanese food is much better than the English fare he is used to. The government said that for anybody who can draw both Arabic and Hebrew, the negotiation ought to be easy.\n\nSimon Daniels, at Microsoft, reported these developments on his ‘Type News’, but added that they don’t matter, as the nation-state is finished, and actually Bill Gates rules the world.\n\n",
  "author": "<a href=\"/web/20110407095310/http://typophile.com/user/1551\" title=\"View user profile.\">William Berkson</a>",
  "time": "<br>",
  "uid": "1551",
  "comments": [
    {
      "time": "",
      "content": "On another note, William Berkson burned all of his refernce material so that he can prove he has committed every quote on Earth to memory [except the ones not printed in Caslon].\n\nFurther news just in: Vincent Connaire in a surprising announcement, swore off photographing beautiful women forever. He said it was just too boring and was going to focus his new-found energies on taking pictures of socks being darned.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "This just in from CNN! Tiffany Wardle was recorded as swearing a blue streak even sailors would be too embarassed to utter. The outburst was in response to the U.S. Supreme Courts recent banning of the EULA as a legal document. Tiffany was quotes as saying to the Chief Justice:  \n\"@#$%%#@&&\\*\\*###@@%!!!\"\n\nThomas Phinney's response was, \"It'll be on my blog in a few weeks.\"\n\nYves Peters could not be reached for comment because Sabine had locked up his laptop until May.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Maxim Zhukov was seen picketing NASA claiming he had proof that the recent demotion of Pluto from planet status was not a change in position, but a screwup! The UN would not comment saying it was their policy to not interfere with other worldly issues.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Linda Cunningham set the artworld on fire recenly by igniting 400 gallons of gasoline in the Toronto Art museum as part of her burning desire to create conceptual art.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Dan Reynolds booked his flight to Reading early to get a good price. He was quite proud of his bargain ticket price until he realized that his non-refundable ticket was to Reading Pennsylvania.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Patty Fabricant just broke the Guiness World record for most type identifications done while unconcious. When Typophile moderator Yves Peters was asked to comment, he said he would \"have to sleep on it first.\"\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "And as Patty was awarded the prize, she made a shocking confession: She and 'missgiggles' are actually one and tha same person! \"Being a serious professional is so taxing,\" she said. \"I need to keep in touch with my inner student.\"\n\n"
    },
    {
      "time": "",
      "content": "Satya won the Most Bigga Avatar price.\n\n"
    },
    {
      "time": "",
      "content": "Alessandro Segalini learned to draw glyphs using Turkish taffy :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "ROFL!\n\n(In fact, I told Vince that he can come over and photograph me darning socks any time he wants.)\n\n"
    },
    {
      "time": "",
      "content": "Ricardo Cordoba explains his aquisition of a famous shirt maker. He was speechless when asked, \"What is it like to be an Arrow Head?\"\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Erik Spiekermann was made honorary king by te Czech Republic yesterday after his newly released FF-MT typeface was adopted by the Czechs as their official typeface.\n\n[http://typophile.com/node/32737](http://web.archive.org/web/20110407095310/http:/typophile.com/node/32737 \"http://typophile.com/node/32737\")\n\nChrisL\n\nPS: Finland strongly objected to the royal honor bestowed on Spiekermann saying that his FF-Mt was unusable in Finland. The Czechs reported no problem whatsover with the type.\n\n"
    },
    {
      "time": "",
      "content": "Well done, Chris!\n\n"
    },
    {
      "time": "",
      "content": "Filip Blažek sent a press release earlier this week announcing the the Czech portions of the April issue of Typo Magazine will be typeset in FF-Mt. The translations into Hawaiian and Finn will revert to Helvetica due to a technical issue which Blažek refused to elaborate on.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Adam Twardoch announced at a Sunday brunch for the printing press that the soon to be released new manual for FontLab Studio will be set in FF-Mt in a space saving move. Customers were complaining about the huge volume of pages that were almost indecipherable for the current manual. Twardoch was quoted as saying, \"The new manual will now be so compact that it will fit on the head of a pin!\" Twardoch later added: \"Customers will be happy not only for the size reduction of the FL5 manual but that it will still remain unintelligible as ever.\"\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "On this past Sunday, Peter Enneson and David Berlow held a debate on “Readability of Type” on the new TV show “Are You Smarter Than a 5th Grader?” and everyone easily understood every word they said, even the adult contestants!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Gerry Leonidas recently obtained a special student discount for [Americans traveling to Reading](http://web.archive.org/web/20110407095310/http:/www.geocities.com/ironhorseusa2000/rdghome.htm).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "After years of delay, Sarah finally replied to the letters sent by [Christian Robertson](http://web.archive.org/web/20110407095310/http:/typophile.com/wiki/Christian%20Robertson).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Too much, guys!\n\nAn Arrowhead.\n\n:-)\n\n"
    },
    {
      "time": "",
      "content": "Actually Ricardo, looking at your avatar, it is two arrowheads :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Correspondent Allyson Zaner reported that a volcano erupted creating new Hawaiian Island, The island named “Wikikahuna” burst from the pacific rim last Sunday as Hawaiian huntsman watched in amazement. “Hundreds of clyphs were formed in flourishes of lava.” Zaner reported. Zaner, a native Californian, was forced to write her report on her old Remington Typewriter because of power outages caused by Wikikahuna’s eruption. Aftershocks were heard as far as Arizona and the glowing sky was seen as far as Reading England.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Well, Chris, you know that old saying...\n\nTwo arrowheads are better than one!\n\n;-)\n\n"
    },
    {
      "time": "",
      "content": "Right on target Ricardo :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "good spelling Chris on the connaire... it's the original Irish version...\n\n"
    },
    {
      "time": "",
      "content": "Bullseye, Mr. Dezcom!\n\n"
    },
    {
      "time": "",
      "content": "Spelling was such a strong suit for me:-)  \nVince, it was truly an accident. I have had an occasional Irish beer but not enough to make me a better speller :-)\n\nChrisL\n\n"
    }
  ]
}
