{
  "id": "32731",
  "title": "Printing on a glass bottle",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am doing a product design and packaging project in my Communication Design 1 class, and i chose to make up a new sparkling fruit drink company to design a bottle for as well as the 6 pack cardboard holder.\n\nSo my main question is, does anyone have any idea how to print a logo and some text onto a clear glass bottle? I am kind of stumped on this one. I am guessing they normally screen print onto the bottle, but i am only going to be making a couple of bottles, not a ton, does anyone have any ideas for the next best thing? I was thinking maybe printing onto some acetate, and running it through one of those adhesive machines that puts sticky stuff on the other side, but i don't know how professional that will look.\n\nAny advice is greatly appreciated.\n\n-Josh\n\n",
  "author": "wolfattack",
  "time": "31 Mar 2007 — 11:08pm",
  "uid": "15289",
  "comments": [
    {
      "time": "1 Apr 2007 — 2:05am",
      "content": "An alternative might be to get some rubdowns done, this is a UK company  \n [http://www.clearestcolourworks.co.uk/transfers\\_rubdowns\\_films.php](http://web.archive.org/web/20150219021510/http:/www.clearestcolourworks.co.uk/transfers_rubdowns_films.php \"http://www.clearestcolourworks.co.uk/transfers\\_rubdowns\\_films.php\")\n\nGoogle returned mainly massage parlours in the US, so perhaps an alternative term is used there :)\n\nA more DIY approach if you have access to an inkjet printer, a water slip transfer might attach better than a dry rubdown.  \n [http://www.craftycomputerpaper.co.uk/clear%20water-slip%20decals.htm](http://web.archive.org/web/20150219021510/http:/www.craftycomputerpaper.co.uk/clear%20water-slip%20decals.htm \"http://www.craftycomputerpaper.co.uk/clear%20water-slip%20decals.htm\")\n\n[http://www.craftycomputerpaper.co.uk/Dry%20Decals%20product%20page.htm](http://web.archive.org/web/20150219021510/http:/www.craftycomputerpaper.co.uk/Dry%20Decals%20product%20page.htm \"http://www.craftycomputerpaper.co.uk/Dry%20Decals%20product%20page.htm\")\n\nIf you use the acetate method trim it down to go round the bottle with a slight overlap at the back and then use double sided tape to attach it, most adhesives will be apparent and spoil the effect, so try to use as little as possible.\n\nTim\n\n"
    },
    {
      "time": "1 Apr 2007 — 5:03am",
      "content": "Inkjet or Laser transparency film is the answer (apply like Tim suggested) - available at most offuce supply stores, Staples, Office Depot, Office Max etc.\n\n"
    },
    {
      "time": "1 Apr 2007 — 5:33am",
      "content": "I should have pointed out that rubdown is the best way if the image is white.\n\nTim\n\n"
    },
    {
      "time": "1 Apr 2007 — 7:29am",
      "content": "I don't have links offhand, but we use rubdowns at work periodically, and I can get you some links tomorrow - that are in the U.S., and not massage parlors. =P\n\n"
    },
    {
      "time": "1 Apr 2007 — 7:58am",
      "content": "\\>and I can get you some links tomorrow - that are in the U.S., and not massage parlors. =P\n\nsounds good, thanks guys\n\n"
    },
    {
      "time": "1 Apr 2007 — 8:38am",
      "content": "If you live in NYC I have many contacts for transfers. Is your design 1 color or more than 1. Transfers used to be a lot cheaper than they are now. The more colors the more the cost. I work in packaging design and this is definitely how I would accomplish that type of comp.\n\nLet me know if you would like the NYC contacts.\n\nSteve\n\n"
    },
    {
      "time": "1 Apr 2007 — 11:27am",
      "content": "I found this site that has a video showing how rubdown transfers work, i was not really sure before but i guess it is pretty self explanatory.\n\n[http://www.ambientgraphics.net/color\\_transfers.php](http://web.archive.org/web/20150219021510/http:/www.ambientgraphics.net/color_transfers.php \"http://www.ambientgraphics.net/color\\_transfers.php\")\n\nThere is a link to a video on the link called \"View Transfer Application Video (Quicktime)\"\n\nI guess it is time to start calling print studios in Austin, there is bound to be a place that can make these rubdown graphic prints. I mean, what is the material actually used in those rubdown prints? I am also not too sure how well this will hold up on a glass bottle.\n\n"
    },
    {
      "time": "1 Apr 2007 — 12:08pm",
      "content": "I thought it might be helpful to actually show the logo, because different transfer methods probably work better than other for text, or big solid logos, etc. There are going to be 6 flavors all together, each flavor has that fruit in the logo, but this is the \"Pear\" logo. I am only going to be making the bottle for one of the flavors. This is not my final version of the logo either, i might change it up a little bit.\n\n[http://img.photobucket.com/albums/v79/guccipingpong/cure.jpg](http://web.archive.org/web/20150219021510/http:/img.photobucket.com/albums/v79/guccipingpong/cure.jpg \"http://img.photobucket.com/albums/v79/guccipingpong/cure.jpg\")\n\n"
    },
    {
      "time": "1 Apr 2007 — 12:27pm",
      "content": "Sorry for posting 3 times in a row, but has anyone ever seen this thing in person?\n\n[http://www.pulsarprofx.com/DecalPRO/Vertical/1\\_MENU/1c\\_How\\_It\\_Works/How\\_...](http://web.archive.org/web/20150219021510/http:/www.pulsarprofx.com/DecalPRO/Vertical/1_MENU/1c_How_It_Works/How_It_Works.html \"http://www.pulsarprofx.com/DecalPRO/Vertical/1\\_MENU/1c\\_How\\_It\\_Works/How\\_It\\_Works.html\")\n\nIt actually seems like a pretty good little machine. Only thing is it is 90 bucks, and i am a student right now, which makes it harder to justify spending that on some machine. They do have a money back guarantee though. Check out the video, it seems to work pretty good, and i am going to go to a design school next year (Art Center) hopefully, and it might come in handy.\n\nNevermind, you have to have a 130 dollar laminator too.\n\n"
    },
    {
      "time": "2 Apr 2007 — 7:21am",
      "content": "You can purchase transparent adhesive labels that you can run through an ink-jet. Might be 'good enough' for what you need.\n\nAlternatively, use the acetate but don't adhere it with glue. Just wrap it tightly and fasten in the back.\n\n"
    },
    {
      "time": "2 Apr 2007 — 7:36am",
      "content": "The transfers will hold on a glass bottle, but if you are worried about spending 90-130 dollars on a machine, you might not be happy with the price of a 2 color transfer. Unless Austin prices differ that much, you will probably spend that much or more on a 2 color 8 x 10 transfer sheet. I would take the method aluminum is advising with the acetate printed from an ink jet.\n\n"
    },
    {
      "time": "15 Aug 2007 — 2:47pm",
      "content": "Hi Josh  \nIts Ashlea from your Des Comm 1 Class. I need to print on glass now, how did you do that? I was lookin it up and I found this blog. I saw it was you and I remembered cure. Small world huh?  \n-ash\n\n"
    },
    {
      "time": "27 Jan 2010 — 6:15am",
      "content": "Dear verle,\n\nDo you mind sharing some of your transfer contacts in New York city? I am trying to transfer stuff onto mirricard or some sort of mirror paper..thanks for any help. If you get this, you can also email me at amritab@yahoo.com/\n\nThanks, Amrita\n\n"
    },
    {
      "time": "27 Jan 2010 — 10:36am",
      "content": "Depending on your specific needs, cut vinyl may be a better solution for rapid prototyping a bottle label. It's a basic product in the sign business, and there are sign shops in nearly every town everywhere. It may not be a better solution than the dry-transfer option, but is almost certainly more readily available.\n\n"
    },
    {
      "time": "19 Apr 2013 — 10:36am",
      "content": "Hi Steve,\n\nI'm trying to find an affordable way to get a one-color logo printed onto about 100 mason jar mugs (w/handles). Do you have any contacts in NYC that I could be in touch with? Even the websites that purport to be \"wholesale\" and \"discount\" seem like they're including a huge upcharge. I'd really appreciate any leads you have. Thanks!\n\nMadeleine  \n [madeleine.rowan@gmail.com](mailto:madeleine.rowan@gmail.com)\n\n"
    },
    {
      "time": "19 Apr 2013 — 3:08pm",
      "content": "Madeleine, Steve's post was made 6 years ago.\n\n"
    }
  ]
}
