{
  "id": "32739",
  "title": "A good math face is hard to find",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I just recently learned of Microsoft's Cambria+Math font. Having been long dissatisfied with the LaTeX standard packages and with the continued delay of STIX, I had high hopes for Cambria. That didn't last long. I am struck by the sloppiness of the design. For example, the lower-case roman alphabet looks like a mixture of two or three different typefaces. Strangely, the fonts I have (from the MS Office beta download) show differences from the sample PDF downloadable from the designer's web site.\n\nWhat really bothers me, though, is that while Cambria+Math is clealy intended for producing documents with math in them, it does not take into account two problems that most fonts have when used to typeset math.\n\nFirst, unlike writing in a natural language, glyphs can be adjoined arbitrarily. So the font must be designed such that no glyph intrudes into the columnar space of its neighbor or leaves gaping holes. A quick test is to diplay \"QJqygf\" in roman and italics. Also try the lower-case with sub/super-scripts.\n\nSecond, again unlike natural language, one often cannot identify a glyph just from context. So every glyph must be immediately and uniquely recognizable. Common problems are with the roman-lc vs. italic-lc \"z\" and with the Greek-ltalic-lc \"nu\" vs. the italic-lc \"v\".\n\nI'd expect that most typographers are humanities types with little exposure to scientific literature. But I assure you that these issues do on occasion cause great vexation with typesetters and readers. For reference, fonts that I think handle these issues well are Caledonia, Palatino, and the Century family. Utopia is mostly OK.\n\nAmong type designers, is there ever discussion of the points I have raised?\n\n",
  "author": "Wendell",
  "time": "1 Apr 2007 — 10:55am",
  "uid": "17761",
  "comments": [
    {
      "time": "1 Apr 2007 — 11:16am",
      "content": "\\>Strangely, the fonts I have (from the MS Office beta download) show differences from the sample PDF downloadable from the designer’s web site.\n\nMaybe try the release version? Note the font was designed to be used with Office 2007's Math engine. With betas and outside of Office your mileage will vary.\n\n\\>Among type designers, is there ever discussion of the points I have raised?\n\nI don't think so - individual type designers may work things out for themselves but I've not seen any recent public discussion.\n\n\\>But I assure you\n\nSome references would be helfpul.\n\n\\>For reference, fonts that I think handle these issues well are Caledonia, Palatino, and the Century family.\n\nSounds like co-incidence rather than by design?\n\n"
    },
    {
      "time": "1 Apr 2007 — 11:51am",
      "content": "[www.typoma.com](http://web.archive.org/web/20150414172438/http:/www.typoma.com/ \"www.typoma.com\") has [this pdf](http://web.archive.org/web/20150414172438/http:/www.typoma.com/publ/20041002-atypi.pdf) from a presentation at ATypl 2004.\n\n"
    },
    {
      "time": "1 Apr 2007 — 12:01pm",
      "content": "I don't know if it can be of any help but you may like to check this [.pdf](ftp://ftp.ctex.org/CTAN/info/Free_Math_Font_Survey/en/survey.pdf) out as well.\n\n"
    },
    {
      "time": "1 Apr 2007 — 3:51pm",
      "content": "Some comments from Murray Sargent...\n\nFrom: Murray Sargent  \nSent: Sunday, April 01, 2007 3:33 PM  \nTo: Simon Daniels  \nCc: Geraldine Wade  \nSubject: RE: Criticism of Cambria Math\n\nA math display program uses different italic characters (the math alphabetic in the range U+1D400..U+1D7FF) from the ones Wendell refers to and the Cambria-Math math italic lc “nu” is quite distinct from the math italic lc v. Furthermore, math spacing in Word 2007 is controlled according to glyph ink, italic correction, and cut-ins, so overlaps don’t occur and a significant amount of spacing tweaks that TeX delegates to the user are performed automatically. More about math spacing is given in my [post](http://web.archive.org/web/20150414172438/http:/blogs.msdn.com/murrays/archive/2006/09/13/752206.aspx). The only possibly valid criticism given in Wendell’s comment on Cambria Math is about the look of the typeface. This look was chosen to allow significantly better on-screen display than other typefaces such as Times Roman. Initially I didn’t like the typeface as much as Times Roman, but I like it now and the font is pure magic when it comes to math typesetting thanks to its myriad glyph variants. To see Cambria Math in action, check out the [math linear format paper](http://web.archive.org/web/20150414172438/http:/www.unicode.org/notes/tn28/UTN28-PlainTextMath-v2.pdf).\n\nThanks  \nMurray\n\n"
    },
    {
      "time": "1 Apr 2007 — 9:31pm",
      "content": "Mmm. I'm glad to see that the Century family makes Wendell's list of faces meeting the criteria for good math work. That's basically why I picked Century Catalogue to work on.\n\nI happen to be very interested in math faces, but it's not clear that my work situation is going to allow me much, if any, time to actively develop them. We'll know in a couple of months.\n\nIn any case, I also found the \"linear\" paper to be somewhat disappointing. One of the major factors is the lack of optical scaling - I think a case can be made that a properly scaled family is far more important for math than in just about any other context, because of the use of different sizes in close proximity.\n\nBut that's not the only problem. The stretchable curly braces are very blah (see [this paper](http://web.archive.org/web/20150414172438/http:/tex.loria.fr/typographie/inria-1972.ps.gz) for a more sophisticated approach). The large parens on page 5 are not quite large enough. It's not _bad,_ but it's not a huge improvement over TeX quality.\n\n"
    },
    {
      "time": "2 Apr 2007 — 11:25am",
      "content": "John: Thanks, that link is great. Johannes Küster identifies a lot of points that need consideration.\n\nSimon: On the chance that you were not just being peevish, what sort of references would you find helpful to support my assertion that poorly spaced and/or indistinguishable glyphs cause aggravation?\n\nMurray Sargent makes a good point. If Cambria+Math is designed to look right only when used in Office 2007, users of other systems like OpenOffice, LaTeX, QuarkXpress, and 3B2 need to be aware of it.\n\nThere is another issue with math that doesn't get much if any discussion, and that is what font to use for the text body. If you look at handbooks on typesetting math, it appears that the issue of body text is too trivial a problem to require mention. But consider this, the typical reading rate for professional-level math is about one or two hours per page. Reading twenty pages at a sitting would be unusual. Most likely would be less than six. Surely this case requires some special attention to typeface choice.\n\nWhen reading, the mathematician goes back and forth between printed page and scratchpad. The type should aid quickly finding one's place again but not become tedious with prolonged staring and rereading.\n\nMy impression has been that a large x-height is bad for math text, as it is meant to cause the eye to slide quickly down a line of text and gives too little distinction to individual words. The opposite, like Perpetua, is not comfortable in prolonged staring. Striking forms, as when the type designer decides to personalize the \"W\" or \"Q\" become very irritating.\n\nAnother major consideration is the use of italics. It is the standard practice in math to set the most important paragraphs, the \"Theorems\", in all italics. So you need an italic face that is not only good for setting whole paragraphs, but will support even more intensive scrutiny than the roman. I think very few faces have such a suitable italic.\n\n"
    },
    {
      "time": "2 Apr 2007 — 11:38am",
      "content": "I was interested in references to fonts that took this into account. To me I suspect you can't do good math with a text font, without as is the case with Cambria, having specific Math forms.\n\n"
    },
    {
      "time": "2 Apr 2007 — 2:30pm",
      "content": "Wendell, by any chance do you know of anyone doing a lot of math with 3B2 (or Arbortext Advanced Print Publisher, as it's now known)? I'm working on a text-and-math typeface and I'd like to talk to a few users about how math is set up and handled on that system.\n\n"
    },
    {
      "time": "3 Apr 2007 — 10:51am",
      "content": "On a general note, we are at first iteration of our math layout system. Of course, there are thing to improve, in both layout engine and Cambria Math font. We learned a lot about math and math fonts at the same time as we moved forward. We are creating platform that provide both good layout and will enable font designers to create great fonts. We see that TeX achieves too many things through hardcoded values and tweaks, frequently tied to Computer Modern family, which font designers and typesetters should take into account. Our (very ambitious) goal for first version was to have math layout quality to be same or better than TeX automatically, without user need for manual tweaking.\n\n<cite> That didn’t last long. I am struck by the sloppiness of the design. For example, the lower-case roman alphabet looks like a mixture of two or three different typefaces. </cite>\n\nI guess this is a matter of taste. Like with Murray, it took some time for me to get used to Cambria both as a body and math font. It is quite different from what I usually used before. Now, I like it and even use Cambria Bold with PDFs on my Sony reader.\n\n<cite>First, unlike writing in a natural language, glyphs can be adjoined arbitrarily. </cite>  \n<cite> So the font must be designed such that no glyph intrudes into the columnar space of its neighbor or leaves gaping holes.A quick test is to diplay “QJqygf” in roman and italics. Also try the lower-case with sub/super-scripts.</cite>\n\nConditions for font design you set are very hard to meet at the same time, especially for slanted math font. You admit that even existing LaTeX fonts do not meet your requirements, after so many years passed.\n\nI agree spacing does not look very good, but this letter combination is not common. On the other hand, letters should not be set as tight as in normal text. They are separate entities in math, not single word. We do not do normal kerning in math and rely on font to have natural spacing to look better. There are other cases when we have to avoid clashes between glyphs, frequently from different fonts/sizes. This can’t be done by font itself, and we concentrated on these issues.\n\n<cite>Second, again unlike natural language, one often cannot identify a glyph just from context. So every glyph must be immediately and uniquely recognizable. Common problems are with the roman-lc vs. italic-lc “z” and with the Greek-ltalic-lc “nu” vs. the italic-lc “v”.</cite>\n\nFrankly, I do not see a big problem with 'z', who would mix it in a formula anyway. And I do not see a problem with nu/v either. We spent time ensuring there is no confusion between these particular pair of letters.\n\nThanks,  \nSergey\n\n"
    },
    {
      "time": "3 Apr 2007 — 10:57am",
      "content": "\\> We see that TeX achieves too many things through hardcoded values and tweaks, frequently tied to Computer Modern family, which font designers and typesetters should take into account\n\nI agree that TeX is a bear, but you really don't need to depend on the CM font family. The Lucida math set mirrors the characters from CM, with the benefits of the more professional design. As for non-Math fonts, they are easy to load into TeX, if you have the afm files to provide the metrics.\n\nI think the reason most TeX setting looks like TeX setting is that the schools and scholars that use it won't pay for decent fonts. That doesn't seem to be a problem for you. (Of course, that doesn't eliminate the problem of TeX requiring so much hand holding.)\n\n"
    },
    {
      "time": "3 Apr 2007 — 11:23am",
      "content": "Raph wrote:  \n<cite>But that’s not the only problem. The stretchable curly braces are very blah (see this paper for a more sophisticated approach). </cite>\n\nCan you do that for every font and glyph? We are working in OpenType font environment, where even multiple masters fonts are not in the standard anymore. I am not even talking about METAFONT.\n\nOf course, if you can do arbitrary sizes for glyphs as good as pre-designed ones you can do better layout. You can do even better if you draw every parents for a given formula. Even if we are not completely flexible, we provide open format where, unlike in TeX, font designer can provide as many growing forms as he think are necessary for their design. Cambria Math has 8 forms for parents, for example.\n\n<cite>The large parens on page 5 are not quite large enough. It’s not bad, but it’s not a huge improvement over TeX quality.</cite>\n\nI thin this is a standard use of TeX's 95% rule (if I remember this number correctly) for choosing size for parents. This is just an accident with existing forms that they have parents that cover full size of first expression and cover only part of higher one. You cannot cover all possible formulas. You design you font to cover most commonly used.\n\n<cite> One of the major factors is the lack of optical scaling - I think a case can be made that a properly scaled family is far more important for math than in just about any other context, because of the use of different sizes in close proximity.</cite>\n\nI am not sure what you mean, at least in relation to math typography. We offer mechanism for optical sizes for smaller sizes in math, e.g. in superscript, although they are all reside in a single font. There are pros of having single font, e.g. set of constants is not spread between typefaces or flexibility in having only some variants for particular size. But nothing in font format prevents other layout engines (or future versions of MS's engine) to use separate fonts for each of sizes.\n\n"
    },
    {
      "time": "3 Apr 2007 — 11:39am",
      "content": "<cite>Murray Sargent makes a good point. If Cambria+Math is designed to look right only when used in Office 2007, users of other systems like OpenOffice, LaTeX, QuarkXpress, and 3B2 need to be aware of it. </cite>\n\nCambria Math is intended to look good in Windows environment and on paper. But this is said only about glyph design and hinting, so there is nothing specific to math layout. This is just particual glyph rendering technology, not math layout engine. You can look at Murray's paper, to see how formulas formatted by Word look in Acrobat Reader.\n\nMath layout tables format is open and other apps can work on support for it. Office2007 was just the first app implemented it. I hope you do not count this as a Microsoft fault. We made format open and generic enough to be used in different layout algorithms. XeTeX, as I understand, is looking into MATH table support in TeX.\n\nThanks,  \nSergey\n\n"
    },
    {
      "time": "3 Apr 2007 — 1:14pm",
      "content": "Perhaps you might like up-and-coming Maxwell by Tiro Typeworks.\n\n[http://www.tiro.com/fonts.html](http://web.archive.org/web/20150414172438/http:/www.tiro.com/fonts.html \"http://www.tiro.com/fonts.html\")\n\n[http://www.tiro.com/Maxwell/Maxwell\\_alpha1.04\\_spec.pdf](http://web.archive.org/web/20150414172438/http:/www.tiro.com/Maxwell/Maxwell_alpha1.04_spec.pdf \"http://www.tiro.com/Maxwell/Maxwell\\_alpha1.04\\_spec.pdf\")\n\nMikey :-)\n\n"
    },
    {
      "time": "3 Apr 2007 — 1:38pm",
      "content": "\\>Perhaps you might like up-and-coming Maxwell by Tiro Typeworks.\n\nYou are aware that Ross Mills has done most of the work on Cambria Math?\n\n"
    },
    {
      "time": "3 Apr 2007 — 5:27pm",
      "content": "I am aware. If he is concerned with looks- Maxwell may be be better choice- it certainly looks more readable. Perhaps the kinks/beefs he has with Cambria will be resolved with Maxwell.\n\nOr better yet... send an email outlining your concerns to Mr. Ross.\n\nMikey :-)\n\n"
    },
    {
      "time": "3 Apr 2007 — 6:29pm",
      "content": "In think what Maxwell needs is a long line of deep pocketed customers (or maybe just one with very deep pockets) ready to licnese the font. That would give Ross the incentive to get moving on it. ;-)\n\nSomewhat unrelated... [http://www.washingtonpost.com/wp-dyn/content/article/2007/03/30/AR200703...](http://web.archive.org/web/20150414172438/http:/www.washingtonpost.com/wp-dyn/content/article/2007/03/30/AR2007033001957.html \"http://www.washingtonpost.com/wp-dyn/content/article/2007/03/30/AR2007033001957.html\")\n\n"
    },
    {
      "time": "3 Apr 2007 — 7:26pm",
      "content": "The appropriate style for a maths type is an interesting topic, and because of the complexity of the design and production of maths fonts there will probably only ever be a small number of options. Ross started designing Maxwell while he was still working on the math table for the Cambria Math font, in part as a relief from the technical nitty-gritty of that work.\n\nI have my own ideas about possible designs for maths types. We've inherited a largely 19th century set of typographic conventions for maths and sciences, which have been extended in subsequent decades but not significantly altered. Yet there is a body of mathematical publishing that predates these conventions, and while some of the notation of that period is now obsolete, the style of types involved are a possible source for new directions in the design of digital maths types. In the days of metal type, there was a natural conservatism in the typesetting of mathematics, in which fonts of type might be extended by the cutting and casting of new symbols, but in which the idea of introducing whole new styles of maths types would be prohibitively expensive. I see no reason why we can't be a bit more adventurous in the design of new types for digital maths settings. Johannes Küster is basing his maths font on Adobe Minion, which may be the most refreshing thing anyone has ever done with Minion. :)\n\n"
    },
    {
      "time": "3 Apr 2007 — 9:26pm",
      "content": "sergeym: Thanks for responding. I do appreciate that you're trying to make math typesetting as good as possible, and that you're studying the TeX precedents.\n\nRegarding the parens in the binomial construct, I think this picture makes it clear. I used this TeX:\n\n`\n(a+b)^n = \\sum_{k=0}^n \\binom n k a^k b^{n-k}\n`\n\n ![](http://web.archive.org/web/20150414172438im_/http:/typophile.com/files/math_3984.png)\n\nI used Apple Preview to make the screencap. Results will vary with other viewers. Overall, the Cambria is bolder than the CMR, which fixes one of the biggest problems with the latter; TeX often looks spindly and insubstantial, especially on the screen.\n\nObviously you are using variant forms of the parens, and they look good. But, to my eyes, the curly braces aren't anywhere nearly curly enough, and seem to be made largely from straight sections. This is an aesthetic choice, of course, and perhaps the mostly-straight approach is more consistent with the design of Cambria.\n\nI took another close look at the optical scaling of the superscripts in that example and, if there is optical scaling, it is too subtle for me to see by eye. In CMR, of course, the scaling is immediately clear to the eye, largely because of the width changes. If these are, in fact, separate super/sub-script glyphs as opposed to mathematically scaled instances of the primary size, then I think quite a bit more should have been done to make them harmonize better optically.\n\nMaxwell looks great, and if the math capabilities of the new Word open up a market for high quality math typefaces, that will be a service to the word. The subscripts there _are_ optically scaled, and very nicely (compare the \"a\" under the summa to the one in the body). The greeks, especially, have a tremendous amount of life. And I'm sure Hrant will love the \"g\".\n\nOf the fonts shown by Küster, the Minion is to my eyes by far the best. I can see why he's choosing that as the basis for his work. In my thesis work, I'm spending a lot of time with a [book by Euler](http://web.archive.org/web/20150414172438/http:/math.dartmouth.edu/~euler/pages/E065.html) from a quarter-millennium ago, and am very much enjoying the typography. It's set in the standard Garalde typical of the era, which looks fine to me. I think this whole thing about moderns is convention rather than serving a true functional purpose. I'm also a big fan of the historical math books I have set in Monotype Old Style No. 2, and, again, that's one of the reasons I chose (the similar) Century Catalogue for revival.\n\n"
    },
    {
      "time": "3 Apr 2007 — 10:25pm",
      "content": "Raph, there are indeed two optical sizes for most common superscripted characters in Cambria Math. Jelle Bosma drew a set of superior glyphs as part of the initial Cambria development; I scaled these up to the size required for the math layout handler, and then interpolated another size, which Ross then adjusted (the final relationships are not linear, as you can see in the illustration below).\n\nI think this is one of the areas in which designing a font for intensive on screen use led to different decisions than would be the case if one were making a font for use predominantly in print. For a print typeface, I might be inclined to make a greater weight change in the optical sizes, but on the coarse pixel grid this can easily lead to the smaller sizes looking too dark relative to the base forms.\n\n ![](http://web.archive.org/web/20150414172438im_/http:/typophile.com/files/CambMathOpt_6527.gif)\n\n"
    },
    {
      "time": "3 Apr 2007 — 11:19pm",
      "content": "John: the images you posted look fine. However, in the \"linear\" pdf posted above, I don't think these optical variants are being used. That could well be a problem specific to the preparation of that document, and not a problem with the math setting of Word 2007. If that is the case, then I withdraw much of my criticism above.\n\nThe same could be true of the curly braces - the ones I see in the [Cambria Math basic specimen](http://web.archive.org/web/20150414172438/http:/www.tiro.nu/Articles/Cambria/Cambria_Math_Basic_Spec_V1.pdf) are much closer to what I would hope for than the version in the pdf.\n\n"
    },
    {
      "time": "4 Apr 2007 — 1:31am",
      "content": "Off topic:\n\nJohn\\> Does Tiro have any current offerings for end user licensing?\n\nManitcore, 1530 Garamond, and Aeneas are not sold through any channels that I could find. Is there opentype development in the works? (tiro.com doesn't have anything about these fonts either.) Most of the type on the site is in development or are commissioned projects... very exciting stuff though!!!\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "4 Apr 2007 — 1:53am",
      "content": "Sergey,\n\nIn general, I like the letterforms in both Cambria (used as text) and Cambria Math. However, I am intrigued by the changes made to Cambria italic when creating Cambria Math italic. The biggest change is the serifs, but other changes have occurred, too. The x, for instance, was changed a lot. How did you decide what changes to make?\n\nI find the v and nu to be quite distinct, but actually reversed: I expect a nu to have a backward facing curl on the top right, not the v. Since in most fonts, neither the nu nor the v have a curl serif on the right, I'm guessing my expectation comes from the way that most people handwrite the nu.\n\n"
    },
    {
      "time": "4 Apr 2007 — 1:40pm",
      "content": "_Does Tiro have any current offerings for end user licensing?_\n\nCurrently we don't have any retail licensing, only some fonts that are freely available under license from our customers (e.g. the SBL scholarly fonts, the Inuktitut fonts for the government in Nunavut). Our old retail fonts were withdrawn from circulation a few years ago, partly out of our own dissatisfaction with them and partly because we did not have time to make OT versions and didn't want to offer ongoing support for Type 1.\n\nSo for the time being we're just working on custom fonts, and this keeps us pretty busy.\n\n"
    },
    {
      "time": "4 Apr 2007 — 1:43pm",
      "content": "_I am intrigued by the changes made to Cambria italic when creating Cambria Math italic. The biggest change is the serifs, but other changes have occurred, too. The x, for instance, was changed a lot. How did you decide what changes to make?_\n\nJelle Bosma, the original designer of Cambria, designed the math italic glyphs. I believe his intention was to more closely follow the style of italic letters used in previous mathematical typesetting, while the basic Cambria text italic forms derive from Jelle's approach to screen font design.\n\n"
    },
    {
      "time": "5 Apr 2007 — 4:10pm",
      "content": " **Dan:** _by any chance do you know of anyone doing a lot of math with 3B2?_\n\nSorry, I've had little contact with 3B2. I'd suggest you start by posting very specific questions on comp.text.tex. There is a lot of cross-platform expertise there.\n\nIf you have questions about other systems, I could probably offer some pertinent comment. A while back, I did an evaluation of all the math editing systems I could get my hands on. That includes Amaya, FrameMaker 7.1, Infty Editor, LyX, MathMagic, MathType, MicroIMP, OpenOffice, PCTeX, Publicon, SciViewer, SciWord, TeXaide, Texmacs, Texmaker, TeXnicCenter, VisualTeX, WinEdt, and WordPerfect. I haven't tried Miles33 or InDesign.\n\n"
    },
    {
      "time": "5 Apr 2007 — 4:27pm",
      "content": " **Sergey:** _Frankly, I do not see a big problem with ‘z’, who would mix it in a formula anyway. And I do not see a problem with nu/v either._\n\nThis is a really odd comment, as _xyz_ are just about the most-used italic letters in mathematics. The _z_ is used constantly in complex analysis and in any applied field dealing with 3D space. As for 'nu'/_v_, physics and engineering can often throw them together.\n\nAs for the problems they cause, just this week I typed a document with a lot of _z_'s and didn't catch the missed italics until I printed it out, since I couldn't easily distinguish z and _z_ on-screen. And I still remember some time ago reading a physics text, not typeset by the author, that used same-looking 'nu' and _v_ in the same equation!\n\nDon't discount problems the _Q_ either. It is used with great frequency in logic and geometry, often with subscripts.\n\n"
    },
    {
      "time": "5 Apr 2007 — 5:11pm",
      "content": " **John:** _Ross started designing Maxwell while he was still working on the math table for the Cambria Math font._\n\nI took a look at _Maxwell_ and it is quite attractive, but I wonder what your target market would be. Scientific publishing is extremely conservative. Times Roman has been almost the sole font of choice since the 1960's and with STIX coming out, that will probably continue indefinitely. I could imagine _Maxwell_ being used in semi-literary writing, such as a [biography of Maxwell](http://web.archive.org/web/20150414172438/http:/www.amazon.com/Man-Who-Changed-Everything-Maxwell/dp/0470861711/ref=sr_1_1/104-3734276-9775113?ie=UTF8&s=books&qid=1175816776&sr=1-1), but not a technical publication. Have you wandered over to a bunch of physicists and asked?\n\n_I see no reason why we can’t be a bit more adventurous in the design of new types for digital maths settings._\n\nI've just finished re-reading Gill's _An Essay on Typography_ in which he holds that the fewer faces on the page, the better. He certainly hasn't been the only designer to thing so. On the math side, notable authors like Paul Halmos have insisted that an essential part of good math writing is resisting the urge to overpopulate your notational menagerie.\n\nOver the past twenty years, some typographically-naive mathematicians have used the power of LaTeX to ignore this advice with wild abandon. Maybe things would get better if typographers used their artistic influence to try to rein them in, not encourage them. :-)\n\n"
    },
    {
      "time": "5 Apr 2007 — 5:55pm",
      "content": " **Raph:** _I’m also a big fan of the historical math books I have set in Monotype Old Style No. 2, and, again, that’s one of the reasons I chose (the similar) Century Catalogue for revival._\n\nI, also, search out older math books for their typography. Tracy, in his _Letters of Credit: A View of Type Design_ recommends keeping examples of books published from 1930 to 1960 because that was the high-point of typographic quality, the furthest advance of technical ability before the decline caused by automation.\n\nFor math books, I would modify the recommendation to the frame of about 1920-1939. In the 20s and 30s, it is clear that the production of a math book was considered Art. But with WWII, economy became the prime consideration. Even after things got better in the 1950s, while math books show much more skill than they would in the 1970s, it is clear that often the primary objective was to get as much as possible on a page.\n\nFor insight into attitudes of the day, take a look at Chaundy's _The Printing of Mathematics_. This was the styleguide for Oxford University Press, which along with Cambridge produced some of the best printing. What is interesting is the constant attention they give to economy of work and space, things that don't seem to have been as important in prewar days.\n\nFollowing the output from 1920 to 1939, there is a significant improvement in technical ability. So if you are hunting for good exemplars, I would advise concentrating on the 1930s. I rarely find anything from before 1910 that impresses me. If you have suggestions I'd like to hear them.\n\n"
    },
    {
      "time": "5 Apr 2007 — 6:23pm",
      "content": " **Simon:** _I was interested in references to fonts that took this into account. To me I suspect you can’t do good math with a text font..._\n\nI think you are absolutely right. The requirements for a math and a text font are diametrically opposed; text letters need to blend and equation letters need to stand distinctly.\n\nNevertheless, the lack of dedicated math fonts forces us to make do. So what do we have to take into consideration to make the best compromise? Thinking just about italic lower-case:\n\n- Every italic letter must be clearly identifiable as such.\n- No letter should cross into its neighbor's space.\n- To distinguish from 'nu', _v_ must be rounded and _w_ must match _v_.\n- To avoid mistaken identity, _v_ can't look like 'nu' normally does. It also must be distinct from roman-bold-lc **v**.\n- The tail of _g_ should be open and _y_ should match.\n- Since it is often used as small super/subscript, _k_ should be open.\n- To leave room for super/subscripts on both sides, flourishes should be kept minimal.\n\nTo illustrate how hard it is to meet all these conditions, here is a sample of some common fonts.\n\n ![](http://web.archive.org/web/20150414172438im_/http:/typophile.com/files/latins_4514.jpg)\n\n"
    },
    {
      "time": "5 Apr 2007 — 7:29pm",
      "content": "<cite>This is a really odd comment</cite>\n\nI haven't said z is not used. I said that you use only one of them inside the formula.\n\nI do not see a problem distinguishing these letters. I just looked at them again and clearly see which one is which, they are very different at any size on my screen.\n\n"
    },
    {
      "time": "5 Apr 2007 — 11:31pm",
      "content": "I agree with Sergey that upright z and italic z are never a problem, because they are never used together (unlike italic z and upright bold z, which do appear together). Similarly, a rounded v is a good solution to the conflict with nu, even though a rounded v is almost indistinguishable from an upsilon. However, no one uses v and upsilon together, whereas v and nu frequently appear together. Just as with text, the design for distinguishability should follow from the usage.\n\nWendell: <cite>The tail of g should be open and y should match.</cite>\n\nI have frequently seen this said, but I've never heard a justification for it. It seems the y in Cambria Math works quite well.\n\nWendell: <cite>Over the past twenty years, some typographically-naive mathematicians have used the power of LaTeX to ignore this advice with wild abandon.</cite>\n\nCould you give some examples of what you are referring to? I'm not sure if you mean that there are too many different typefaces used in mathematics, or if there are too many mathematical symbols. Given how overloaded most math symbols are already, it's hard to imagine how to avoid the latter when expressing new concepts.\n\n"
    },
    {
      "time": "6 Apr 2007 — 12:39am",
      "content": "_A while back, I did an evaluation of all the math editing systems I could get my hands on. That includes Amaya, FrameMaker 7.1, Infty Editor, LyX, MathMagic, MathType, MicroIMP, OpenOffice, PCTeX, Publicon, SciViewer, SciWord, TeXaide, Texmacs, Texmaker, TeXnicCenter, VisualTeX, WinEdt, and WordPerfect. I haven’t tried Miles33 or InDesign._\n\nWendell, thanks for this list. You mention a few that I haven't heard of that might be worth taking into account. And if you are curious about Miles 33, I've been setting math in it for ages and can answer any questions you might have.\n\n"
    },
    {
      "time": "6 Apr 2007 — 10:14am",
      "content": "[EXP](http://web.archive.org/web/20150414172438/http:/www.expswp.com/) is another WYSIWYG math editing program that has been around for a while.\n\n"
    },
    {
      "time": "6 Apr 2007 — 10:25am",
      "content": "Wendell,\n\nMaxwell is very much Ross' personal project, and not something I'm involved with. I don't know if he has a 'market' in mind, but one of his reasons for starting the design was to make something closer than Cambria to the style of types (e.g. Computer Modern) that TeX users are familiar with.\n\nWhen I spoke about being more adventurous in the design of new maths fonts, I wasn't suggesting mixing multiple styles or extending notation, only that there could be a wider range of options for the basic style of type used. The style would be applied consistently across the typeface, so there certainly would not be a mix of styles on the page.\n\n"
    },
    {
      "time": "6 Apr 2007 — 11:21am",
      "content": "I'm presently developing a large Modern typeface family, and advanced math capability would certainly be appropriate, as this genre of type traditionally evolved in tandem with scientific and mathematic progress, hence the meaningful distinctions it makes in the above chart. (Computer Modern is in this genre.)\n\nBut like Cyrillic and Greek development, the market is sketchy for an independent foundry, and a considerable amount of research is required to figure out which characters are required in a font, and how they are deployed by applications.\n\nHowever, there's an opportunity here for a math-minded intern....\n\n"
    },
    {
      "time": "6 Apr 2007 — 8:44pm",
      "content": "_I’d expect that most typographers are humanities types with little exposure to scientific literature._\n\nNot, however, the typographers who made sure the standard keyboard has an ASCII tilde, circumflex, and greater than/less than symbols, but omitted curly quotes and f-ligatures :-)\n\n"
    },
    {
      "time": "27 Apr 2007 — 8:17am",
      "content": "_I’m presently developing a large Modern typeface family, and advanced math capability_\n\nNick, can we take a peek at this? Or is it too soon?\n\n"
    },
    {
      "time": "27 Apr 2007 — 9:39am",
      "content": "For those that are interested there will be a math font workshop during TypeCon week. Due to scheduling issues it will be on Tuesday July 31st (ie. the day before the other workshops start) at Microsoft (main campus in Redmond) transfers from the conference hotel will be arranged (ie. bus tickets).\n\nCheers, Si\n\n"
    },
    {
      "time": "10 Sep 2007 — 10:09pm",
      "content": "Does anyone have a link to the \"open\" math layout tables format Sergeym references?\n\n"
    },
    {
      "time": "10 Sep 2007 — 10:21pm",
      "content": "Sergey is able to send this out on request. Contact him via SergeyM @ you know where.\n\nCheers, Si\n\n"
    },
    {
      "time": "9 Aug 2008 — 6:23pm",
      "content": "I know this an old thread, but XeTeX did add Unicode Math support, although it's still considered experimental. I don't have Office 2007 for a side-by-side comparison, but using the Cambria Math landed on my laptop by Expression Suite (should be the same font), I get better looking results from XeTeX that what was posted above. Comparison at 12pt (magnified in evince) of Latin Modern (a Unicodified CM) and Cambria Math; text font is unchanged. Given the way XeTeX works, you cannot currently mix Unicode with non-Unicode math in the same document without running in trouble.\n\n ![](http://web.archive.org/web/20150414172438im_/http:/typophile.com/files/Screenshot-uni_5573.pdf.png)\n  \n\n ![](http://web.archive.org/web/20150414172438im_/http:/typophile.com/files/Screenshot-uni_4341.pdf-1.png)\n\n"
    },
    {
      "time": "9 Sep 2009 — 9:58pm",
      "content": "@raph I would kill to see a page scan from the Euler book.\n\n@Wendell another reference point in math typesetting is Knuth's own _The Art of Computer Programming_ that was first set in a version of \"Modern\" (ATF?) Somewhere, Knuth tells us that the tribulations of typesetting early editions drove him to build what became TeX and METAFONT. As a result we have at least three iterations of the work to compare: The traditional version (which I think is beautiful); the first digital edition of some volumes which was built with a markedly more primitive, early version of the software and fonts; and the \"modern\" TeX and CMR that was introduced in the _TeXbook_ and _METAFONTbook_ (themselves showcases of math).\n\nThis is of interest, in my opinion, because Knuth, as a working mathematician, values excellence in mathematical setting and makes high demands of it; and in developing his digital typography tools he paid close attention to its conventions and details. Optical scaling in CMR was one example, decades in advance of mainstream (PostScript) digital type...\n\nAnd wasn't his _Concrete Mathematics_ set in a different math family entirely? AMSfonts? I forget. (It's 1am)\n\n"
    },
    {
      "time": "10 Sep 2009 — 7:06am",
      "content": "Looks like the old/new CMR transition was 1992. [http://www-cs-staff.stanford.edu/~uno/cm.html](http://web.archive.org/web/20150414172438/http:/www-cs-staff.stanford.edu/~uno/cm.html \"http://www-cs-staff.stanford.edu/~uno/cm.html\")\n\n"
    },
    {
      "time": "9 Oct 2009 — 12:36pm",
      "content": "@qu1jot3 (Toby):\n\nFortunately, there are very high quality scans of many of Euler's works hosted at the Euler project at Dartmouth. The one I spent the most time studying is the [Methodus Inviendi](http://web.archive.org/web/20150414172438/http:/math.dartmouth.edu/~euler/pages/E065.html), particularly Additamentum I.\n\nI'm sure there's a lot of beautiful mathematical typesetting in those historical originals. I think it might make a great Master's project or something to go back and identify the best samples, find out more about the people who made them, etc.\n\n"
    },
    {
      "time": "28 Jul 2010 — 8:15am",
      "content": "Thoes with 3B2 (Arbortext APP) question from this thread, feel free to drop me a line via [www.tformat.com](http://web.archive.org/web/20150414172438/http:/www.tformat.com/ \"www.tformat.com\"), chris\n\n"
    }
  ]
}
