{
  "id": "32744",
  "title": "Designing a font!",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti"
  ],
  "content": "Hello! I am very very new at 'designing' a font...so please take that into consideration when you tell me your thoughts. This is the final sketches before going to fontlab. The name of the font will be called \"mizzet\".\n\nThank you very much!\n\nLindaGK\n\n ![](http://web.archive.org/web/20150419063513im_/http:/typophile.com/files/Mizzet_4003.jpg)\n\n",
  "author": "LindaGK",
  "time": "1 Apr 2007 — 9:27pm",
  "uid": "17771",
  "comments": [
    {
      "time": "1 Apr 2007 — 10:31pm",
      "content": "I think you should take the sizes of the letters into consideration. Right now there are a lot of different sizes and this will cause certain letters to stand out more in text.  \nWhat if I want to spell zebra? z\\_\\_\\_\\_\\_ebra.\n\nI really like the numbers but I feel they don't match the rest of the set very well. They feel more controlled.\n\n"
    },
    {
      "time": "9 Apr 2007 — 4:45pm",
      "content": "Hello Haley,\n\nThank you very much for your comments....I'm going to work on it tonight  \nat my class here in San Francisco. Will let you see some new results later.  \nLindaGK\n\n"
    },
    {
      "time": "26 Apr 2007 — 4:40pm",
      "content": "I haven't seen the FontLab results in class, but I like the flow of the letters. I agree with Haley that some of the letters have really deep ascenders or trail too much. Otherwise, I'm looking forward to seeing it...\n\n"
    },
    {
      "time": "30 Apr 2007 — 1:07am",
      "content": "You may want to loosen up and try \"!?$\" again; they're rather rigid as compared to your alphanumerics. Actually, don't bother drawing a new dollar sign, just put a stroke through the big S you have and that would look great. Try to draw a question mark that looks appropriate next to your P.\n\n"
    },
    {
      "time": "30 Apr 2007 — 2:22am",
      "content": "The tail of the lower case z could descend below the baseline if it has a curve like the first cap, and be spaced so that it underscores following letters - it's not a problem.\n\nNick Cooke\n\n"
    }
  ]
}
