{
  "id": "32756",
  "title": "Just Another Test Text Generator",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all,\n\noriginally I wrote [this test text generator](http://web.archive.org/web/20090807111149/http:/justanotherfoundry.com/tools/generator) for my own use but I think it may be useful for every type designer. It is similar to Miguel’s [adhesiontext](http://web.archive.org/web/20090807111149/http:/adhesiontext.com/) but the texts are synthesised using a different system.  \nI hope it works with all your browsers and OSes - if you have any problems or suggestions just let me know! Implementing further languages would be fairly easy if there is need for it (Danish/Norwegian is already on my list).\n\nTim\n\n",
  "author": "<a href=\"/web/20090807111149/http://typophile.com/user/4763\" title=\"View user profile.\">Tim Ahrens</a>",
  "time": "<br>",
  "uid": "4763",
  "comments": [
    {
      "time": " 2.Apr.2007 11.51am",
      "content": "Thanks Tim! Always happy to see a new tool to tinker with :-)\n\nChrisL\n\n"
    },
    {
      "time": " 2.Apr.2007 2.12pm",
      "content": "lol, this is too much coincidence. I actually searched the forum and the internet for such a tool yesterday, because I was making a couple of specimen...  \nI could hardly find anything useful, and now this topic. :)\n\nVery nice and useful.\n\n"
    },
    {
      "time": " 2.Apr.2007 4.44pm",
      "content": "Hi Tim,\n\nCongratulations for this text tool.\n\nI don’t know if it’s because of the text sources you’ve used, or the system you’ve used, but I have to say that the output for Portuguese doesn’t look like Portuguese at all. There are way too many ’y’s, ’k’s and ’w’s. I also see many sequences of letters that in Portuguese are not frequent or don’t exist at all, like ’ll’, ’ff’ and ’nn’. (I’ve just searched [adhesiontext](http://web.archive.org/web/20090807111149/http:/typophile.com/wiki/adhesiontext) and the only words using ’nn’ that came up were ’scanner’, ’cannabis’, ’connosco’ and a few obscure ones)\n\nOn the generator’s page you say that the “text is synthesized on the basis of language-specific lists of triplet frequencies”, and I wonder, did the system take syllables into account when those lists of triplets were created?\n\n"
    },
    {
      "time": " 3.Apr.2007 12.58am",
      "content": "Miguel,  \nyou must have selected something else in addition to Portuguese because the triplets list for Portuguese does not contain any ’y’s. Note that if you check Portuguese and “neutral” it will mix these two databases, introducing letters and combinations from other languages. If you really want purely one language make sure all others - including the ready-made mixes - are unchecked.  \nAlso, if you want a typically Portuguese letter frequency distribution you should set both “variety” settings to 0 because otherwise letters which are rare in Portuguese would be boosted.\n\n**[This](http://web.archive.org/web/20090807111149/http:/justanotherfoundry.com/tools/generator/generator.py?language=pt&characters=all&chars=&kern=typ&kernchars=&kernlevel=0&lettervariety=0&pairvariety=0&frequencies=output&generate=Generate+Text)** should generate a more Portuguese-looking text. Does it look better?\n\nThe tool does not take into account syllables, not even words. Every character, including the space character, is processed in the same way (with a little tweak to avoid extremely long words).\n\n"
    },
    {
      "time": " 22.Jan.2008 8.33pm",
      "content": "\\> _This should generate a more Portuguese-looking text. Does it look better?_\n\nYeah, that looks much closer to Portuguese. I must have selected the wrong settings.\n\n"
    }
  ]
}
