{
  "id": "32750",
  "title": "Jackie T Logo Design",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone,  \nI'm designing a logo for a company called Jackie T, and I started playing with this sort of retro custom type for it, and I'd like to hear comments and how can I make this better.  \nThanks!  \nRodrigo\n\n| Attachment | Size |\n| --- | --- |\n| [jackie.jpg](http://web.archive.org/web/20150420005347/http:/typophile.com/files/jackie.jpg) | 131.41 KB |\n\n",
  "author": "rosaiani",
  "time": "2 Apr 2007 — 8:37am",
  "uid": "4563",
  "comments": [
    {
      "time": "2 Apr 2007 — 10:28am",
      "content": "What kind of company are they?  \nThe lettering looks pretty good up to the k, I think I would look at larger counters on the k and e, the i looks a bit lonely and differently styled, the absence of lower serifs on other characters are contributing to this.\n\nTim\n\n"
    },
    {
      "time": "2 Apr 2007 — 12:10pm",
      "content": "If I had to guess, I'd say this was a clothing company.\n\nThe counter of the 'k' could be made a little larger by reducing the angle between the top of the loop and the stem. Otherwise, it's really cool. Great job.\n\n- Lex\n\n"
    },
    {
      "time": "2 Apr 2007 — 12:34pm",
      "content": "I agree the \"i\" definitely stands out from the rest of the group, and Tim's comment is right on the money.\n\nIt feels more like a logo for an Irish pub. What's the audience/company you're creating this for? I don't think we have enough information to give a true creative critic on the word mark. Do you have any previous idea sketches?\n\n"
    },
    {
      "time": "2 Apr 2007 — 2:49pm",
      "content": "Hey Guys, thanks for the comments.  \nWouldn't the \"i\" issue be just because it's on the first place a very different letter than all the other round ones in the logo? If not what do you think would make the whole thing tighter? Make it connect like an italic (while keeping it upright) would be one solution I guess.\n\nThe logo is for an upscale hair salon (I was starting to like the guessing game). Ornament is part of what the client enjoys. And part of what inspired us too. Here are a couple of sketches. I decided to render the sketch for the first rendered post really soon in the sketch process so I don't have many other things to show. But here it goes.  \nThanks\n\n ![](http://web.archive.org/web/20150420005347im_/http:/typophile.com/files/JackieT-Rabiscos-2007_5545.03.29.jpg)\n\n"
    },
    {
      "time": "2 Apr 2007 — 4:06pm",
      "content": "agree with comments made about the letter 'k', 'i' and we're still not sure of the proposed clientele. can you provide previews at a more realistic size?\n\n----------  \n**Paul Ducco**  \n [Graphic Design Wellington](http://web.archive.org/web/20150420005347/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "2 Apr 2007 — 4:29pm",
      "content": "Sorry for the insanely huge images, here is a evolution of the type from the sketch and incorporating your comments (unworked as far as perfection of curves goes).\n\nThe clientele is rich ladies. Very rich. It's a huge hair dressing salon.\n\nThanks\n\n ![](http://web.archive.org/web/20150420005347im_/http:/typophile.com/files/JackieT-evolution-2007_6414.04.0.gif)\n\n"
    },
    {
      "time": "2 Apr 2007 — 5:44pm",
      "content": "I like the lower left sketch the best, just not the closed loop of the k.\n\n"
    },
    {
      "time": "2 Apr 2007 — 6:11pm",
      "content": "Be careful not to let the \"ck\" combination look like a lc d.\n\nLike Lex, I thought it looked like a clothing store mark too.\n\n"
    },
    {
      "time": "2 Apr 2007 — 6:25pm",
      "content": "I think it works well for a hair salon.\n\nRe my original comment, I liked where the join was on the original 'k', (it flows well from the 'c') just not the angle of the loop:\n\n ![](http://web.archive.org/web/20150420005347im_/http:/typophile.com/files/k_4505.png)\n\nYou've actually increased the angle by raising the join up.\n\n- Lex\n\n"
    },
    {
      "time": "2 Apr 2007 — 8:01pm",
      "content": "A hair salon for rich women, and the customer likes the ornamental look. I don't really get that feeling from this word mark. I admit it's a clean start, but I think it could be pushed further to get that ornamental feel. You need to keep in mind your audience is old rich women, this mark should feel RICH and EXPENSIVE. I like your sketches, there are some good ideas in there but honestly, I think you're going with the safe choice, keeping it simplistic.\n\nAnyone else feel the same way, that he could be pushing this design further and that it's currently newlywed wife rich, but not widowed millionaire rich?\n\n"
    },
    {
      "time": "3 Apr 2007 — 12:12am",
      "content": "You could reinforce the serif of the i by treating the k in a less calligraphic way, instead of the loop you could use a straight line with a serif, keeping the swashy leg, it's a shame because I like the loop, but currently I cannot think of a better way to bring the i into the design. To add to the expensive (and hair) look you could combine one of the features in your sketches, the double line, a bit like Delphian, see if it is possible to keep the thin look though.  \n [http://www.myfonts.com/search?search%5Btext%5D=delphian](http://web.archive.org/web/20150420005347/http:/www.myfonts.com/search?search%5Btext%5D=delphian \"http://www.myfonts.com/search?search%5Btext%5D=delphian\")\n\nTim\n\n"
    },
    {
      "time": "3 Apr 2007 — 8:36am",
      "content": "Hey guys, thanks a lot! Lex, thanks for the sketch, now I got what you meant and I think you're right. As for the ornament, it's still a work in progress, and this is one of other paths we're trying (I do tend to go simple and I need to work that out). Also, we still have to work out the \"T\" in Jackie T and we could go crazy on that (We've been researching a lot of ornamental designs, old and contemporary in order to get the ornaments just right). But you're definitely right when you say I have to add more flair to it. Will do! Check back soon with changes and hopefully new stuff!\n\nTim, I like that bowl too, let's how it looks without it and if it's better, than I still have a bowled k to make an alternate for Jackie T's typeface :D Also the Delphian feature is a nice suggestion, but I'd say I'd still need more flair. Maybe some Marian Bantjes' stuff ( [www.bantjes.com](http://web.archive.org/web/20150420005347/http:/www.bantjes.com/ \"www.bantjes.com\")) would come in handy for the logo (though I'm not sure I could pull that off lol). Let's see how it goes\n\n"
    },
    {
      "time": "3 Apr 2007 — 5:40pm",
      "content": "really enjoying this thread so far.\n\n:)\n\n----------  \n**Paul Ducco**  \n [Graphic Design Wellington](http://web.archive.org/web/20150420005347/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "16 Apr 2007 — 4:27pm",
      "content": "Back with some new stuff...  \nTurns out my brother is out of this world in terms of ornamentation. The T is all his (created in pencil, vectorized and just now applied brushes in illustrator - will work on it if client approves). Also tried a sort of modern custom type (not sure how they are going together yet but you can't say we haven't tried). This is a rough version of a new proposition (I've saved that other one just in case.\n\n ![](http://web.archive.org/web/20150420005347im_/http:/typophile.com/files/Jackie-T-T-com-Volume-2007_4749..gif)\n\n"
    },
    {
      "time": "17 Apr 2007 — 12:04am",
      "content": "That is looking very nice, you might need to alter the height of the i, it looks a little tall. I like the T but it seems a little too much for small use, I think you might try removing certain elements to lighten it up to see how far you can go and still keep an amount of legibility.  \nHave a look at Missionary, which might be too far.  \n [http://www.myfonts.com/search?search%5Btext%5D=Missionary](http://web.archive.org/web/20150420005347/http:/www.myfonts.com/search?search%5Btext%5D=Missionary \"http://www.myfonts.com/search?search%5Btext%5D=Missionary\")\n\nTim\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:26am",
      "content": "Thanks Tim,  \nwe are thinking of different versions for small and big applications. I can't help but wonder how it would look like really big though. But definitely should be treated for small application as well. We have a client meeting today (I'll post what the client thought of the whole deal afterwards) and we'll take adjustments from there, thanks for the i tip (literally) :D\n\n"
    },
    {
      "time": "17 Apr 2007 — 8:35am",
      "content": "And thanks for the missionary link!\n\n"
    },
    {
      "time": "17 Apr 2007 — 9:57am",
      "content": "This is beautiful to look at. I hope you will post more.\n\nThe ball terminals are all different sizes. Goldilocks might agree that the J's is too big, and the K's is small. I like the C the best.  \nMaybe bring the ball back into the C a touch.\n\nThe serif on the J could be smaller.\n\n"
    },
    {
      "time": "17 Apr 2007 — 3:55pm",
      "content": "the T looks like a female in a kimono/caftan with arms outstretched\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20150420005347/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "17 Apr 2007 — 8:06pm",
      "content": "Hi guys!  \nThe client loved the direction! This is it! Now we'll go crazy in the refinement. Andrew, thanks for the positive feedback. I agree with you and I hope to correct the terminals real soon (I like C's ball terminal best too). I'm also not sure what to do with the serif on the J... it might need to be on both sides to sort of balance it (like a normal serifed capital J). Lowercase e might need more personality and I'll fiddle with that too.\n\nPaul, what interested me about the T was the fact that the arms (can't remember the typographic term for it now) are sort of bending up a little making it more triumphant. I saw a little bit of a female (with a moustache though heheheh) now (small head up the middle) and that'll be another card we can play if it comes up on the discussions...\n\nAll in all, we're very excited on how this is coming along, and the process of posting stuff up here is really helping us! Thanks to everyone participating in the discussion! Be back soon with more stuff!\n\nP.S.: It'd be fun to hear Marian Bantje's comments on this... I think we would all learn a lot! If you are out there, we are big fans of your work :D!\n\n"
    },
    {
      "time": "18 Apr 2007 — 12:28pm",
      "content": "Take a look at Daliance from Emigree, don't over think the process\n\n"
    },
    {
      "time": "19 Apr 2007 — 11:05am",
      "content": "Here is an evolution on the Jackie Type. I did some research on Bodoni's swash letters which helped improve a little on the Capital J. The J on the middle one ended up with too small a terminal so I kept the old one. I rounded the J's curve a little more (it was sort of squarish). Also made some adjustments on the lowercase \"k\" (the curve leading to the terminal looks weird) and \"e\". Still a lot of work to do but it's an improvement.\n\n ![](http://web.archive.org/web/20150420005347im_/http:/typophile.com/files/jackie_revisions_4277.gif)\n\nCheers!  \nRodrigo\n\n"
    },
    {
      "time": "19 Apr 2007 — 11:08am",
      "content": "Here is an evolution on the Jackie Type. I did some research on Bodoni's swash letters which helped improve a little on the Capital J. The J on the middle one ended up with too small a terminal so I kept the old one. I rounded the J's curve a little more (it was sort of squarish). Also made some adjustments on the lowercase \"k\" (the curve leading to the terminal looks weird) and \"e\". Still a lot of work to do but it's an improvement.\n\n ![](http://web.archive.org/web/20150420005347im_/http:/typophile.com/files/jackie_revisions_4277.gif)\n\nCheers!  \nRodrigo\n\n"
    },
    {
      "time": "19 Apr 2007 — 11:58am",
      "content": "Your latest version is getting there, the serif on the a might be improved with a curl to it and the bar of the e is too angled for me, especially in the way it interacts with the vertical stress of the characters, maybe somewhere between present and horizontal would work better, you could also try reducing the size of the tittle above the i, it is a touch too prominent and try pulling the curve of the J down a touch the improved curve is pulling it above the baseline.\n\nTim\n\n"
    },
    {
      "time": "20 Apr 2007 — 8:14am",
      "content": "Hello Rodrigo,  \nThe T of course is very beautiful, and the Jackie is coming together in a 1970s kind of way. However I see a huge disconnect between the two. The logo on your April 16 post reads \"Jackie\" to me, like an American ad girl with long straight hair and big eyes sitting bare-breasted (all ad girls were bare breasted in the 1970s) atop an ancient, vaguely Spanish pedestal. Obviously it's a T, but it's a T which does not belong to Jackie. Jackie is a tourist, posing with a T from another culture and time.\n\nUnfortunately, to bring them together, you would have to start from scratch with either Jackie, or the T.\n\n-marian\n\n"
    },
    {
      "time": "20 Apr 2007 — 12:16pm",
      "content": "Thanks a lot Marian. We are going to go both ways of adaptation and see what comes up. We'll post new stuff soon!\n\nAlso, today we've been working on getting a Jackie T on the same style as the lettering. Don't know if I should have a swash T in this case, but here it goes (with display and small application versions):\n\n ![](http://web.archive.org/web/20150420005347im_/http:/typophile.com/files/jackiet-bigandsmall_6645.gif)\n\nCheers  \nRodrigo\n\n"
    },
    {
      "time": "28 Apr 2007 — 5:58pm",
      "content": "The vertical positioning of the T looks off. I can see that you aligned it to the top of the J and k, and it is also aligned with the bottom of the J, but it looks off. I keep wanting to shift it to the baseline of the e.\n\nAlso, in the logo for small output version, the c and e look too high off the baseline. Compared to the ki combo, the c and e could be lowered a tad to optically compensate.\n\nFinally, in the small version on the bottom right corner, the letters could be tracked out slightly. The J and a are a little too close, at least that's how it looks on my computer screen. You will have to see a print out to get a better idea.\n\nA subdued swash version of the T might be nice. Right now it looks a little plain standing next to Jackie.\n\n"
    },
    {
      "time": "29 Apr 2007 — 10:06pm",
      "content": "looking great Rodrigo. GREAT progression.\n\nAgree about the T looking a bit off. By rights the base of it should sit with the baseline of the lowercase ... in my opinion.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20150420005347/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "7 May 2007 — 8:50am",
      "content": "Hey guys, thanks, I just saw the new posts and I see the point on all your comments. Right on. I was sort of unsure about the super plain T too and have been trying a swash version that is posted here:\n\n ![](http://web.archive.org/web/20150420005347im_/http:/typophile.com/files/jackie_2007_05_07_3794.gif)\n\nDesigned the swash T but I'm not sure yet which one links better to the logo (Its curves look a little rough at this point). Also the Jackie T's capital T on the bottom is baseline aligned and has the c and e optically aligned with the rest.\n\nAgain, thanks a lot for the feedback!  \nCheers  \nRodrigo\n\n"
    },
    {
      "time": "22 May 2007 — 3:10am",
      "content": "I'm diggin the angled T stokes (1 & 3) but really have to see them seperated to see which I prefer ... technically 3 should be best ... but technically doesn't always cut it. does it!\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20150420005347/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "29 Dec 2011 — 12:55am",
      "content": "i liked the e at the same angle as the k\n\nthe baseline complient T is best but what about if the swash on T#1 was lower to match the height of the J ?\n\n"
    },
    {
      "time": "29 Dec 2011 — 3:26pm",
      "content": "Top of J and T should be consistent i think. One visual style.\n\nMaybe you could tweak the curls on option b some more.\n\nStick to the baseline.\n\n"
    },
    {
      "time": "29 Dec 2011 — 3:43pm",
      "content": "Guys, you do realize this thread has been dead for 4.5 years?\n\n"
    },
    {
      "time": "29 Dec 2011 — 4:15pm",
      "content": "Actually you just contributed to its... revival. :-)\n\nhhp\n\n"
    },
    {
      "time": "2 Jan 2012 — 10:34pm",
      "content": "actually - nah - i didn't see that... my bad\n\n"
    },
    {
      "time": "6 Jan 2012 — 7:53am",
      "content": "No, it's a good thing!\n\nhhp\n\n"
    },
    {
      "time": "9 Jan 2012 — 7:45pm",
      "content": "Thanks for the replies!  \nIf someone ever wants to do a Jackie T hair salon, let me know :) this logo never saw the light of day, but it's in my \"gotta make a font out of this\" drawer :)\n\n"
    },
    {
      "time": "10 Jan 2012 — 3:27pm",
      "content": "That's a shame. Certainly hope you got payed. :P\n\n"
    },
    {
      "time": "16 Jan 2012 — 4:44am",
      "content": "Fortunately yes.\n\n"
    },
    {
      "time": "1 Feb 2012 — 8:40am",
      "content": "I just want to compliment everybody on their input, some very good points and designs! I'm a newer web designer and amateur typographer and I'm loving the help and critique of all you folks, great work!\n\n"
    }
  ]
}
