{
  "id": "32765",
  "title": "Fictional travel guide ... (comments/critique appreciated)",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I've attached a sample spread from my grad project (one part of it) it's a publication series that is composed of cultural ephemera from various 'island nations'. This particular aspect is a sort of 'hub' for the rest of the publication, it's a travel guide to these island nation / utopias.\n\nI've gotten it to a stage where I am fairly happy, just wanted to hear from fresh eyes. There are a few things I am unsure about; how do are the page numbers / running heads working? are they not anchored enough? Is the line length for the marginalia too short? General comments about how it feels / navigates would be appreciated as well.\n\nIn case some more context is required; the finished book will be about 100 pages (50 islands for Volume 1) and the size is about half-letter (5.5 x 8.5). The typeface used is Galaxie Polaris by Chester & Tracy Jenkins.\n\nThanks.\n\n| Attachment | Size |\n| --- | --- |\n| [folm\\_b2.pdf](http://web.archive.org/web/20131106080508/http:/typophile.com/files/folm_b2.pdf) | 42.82 KB |\n\n",
  "author": "abi",
  "time": "2 Apr 2007 — 3:15pm",
  "uid": "14874",
  "comments": [
    {
      "time": "2 Apr 2007 — 3:39pm",
      "content": "Reminiscent of [San Serriffe](http://web.archive.org/web/20131106080508/http:/en.wikipedia.org/wiki/San_Serriffe) (and [here](http://web.archive.org/web/20131106080508/http:/wikitravel.org/en/San_Serriffe)). But I guess you will probably know them. :)\n\nOn topic: I think your example does mimic a travel guide quite well.  \nMaybe it does look a bit 'serious', so to speak, but then again the lay-out is primarily to transfer information. However, maybe it could use a bit of flair, if you know what I mean.\n\n"
    },
    {
      "time": "2 Apr 2007 — 7:51pm",
      "content": "I'd lose the hyphenation -- you've got two consecutive ones in the verso main text that really don't make much sense, and things like \"re-cent\" are just jarring. I like the marginalia, but the hyphens on the recto aren't very comfortable either.\n\nYour use of colour is very nice, but it does feel a little sterile -- you might want to think about using a sans with a touch more warmth and contrast to it.\n\n"
    },
    {
      "time": "3 Apr 2007 — 10:24am",
      "content": "Agreement on the hyphenation. The marginal texts' measures are just too short.\n\nThere are a few too many horizontal rules. I kind of like them at the foot of the marginalia, but then again I'm not sure they're necessary. The rule at the end of the body text seems superfluous.\n\nThis is a tiny thing, but I'd equalize the space before & after the subheads' gray square bullet. Or maybe even drop the bullet entirely and use an em space to separate the subhead from the text.\n\n--John\n\n"
    },
    {
      "time": "5 Apr 2007 — 10:14pm",
      "content": "Thanks for the comments,\n\nQuincunx: Yeah, I remember reading about San Serriffe a few years back, as for the 'seriousness' I think I wanted to stick to that because the rest of the publication really diverges from the serious look. But I agree if this was all there was it could use more flair.\n\nLinda Cunningham: I think I chose Galaxie Polaris because it has a very 'open' feeling to it, I think it lends the page a nice balance. I did an initial version with an overt friendliness and warmth, but since the content verges from dreary to (perhaps) humourous I thought a touch of sterility would contrast with the content itself. If that makes any sense.\n\njslabovitz: Yes, superfluous is a fitting word, I've been on the verge of taking it out for a while though, but you can never really convince yourself of some things till you hear it from someone else.\n\n"
    },
    {
      "time": "6 Apr 2007 — 6:30am",
      "content": "I like it. It's very clean, which is perfect for a travel guide. I agree with Linda's comment about the sterility though. I might get yelled at for this, but I wonder what the blue sidebars would look like justified.\n\nI know it's not in your initial question, but I feel like the image needs a compass rose or a marker for the capital. Although I like the simplified look, I think it's needs something more.\n\nBut I like it overall.\n\n"
    },
    {
      "time": "6 Apr 2007 — 5:28pm",
      "content": "sch2525: thanks, a compass rose is a great suggestion i think, my roommate had suggested the marker for the capital (maybe a tiny understated star?) but i'll definitely play around with a compass.\n\n"
    },
    {
      "time": "6 Apr 2007 — 8:10pm",
      "content": "Absolutely, it needs some sort of directional indicator: not necessarily a full rose, but at least a \"North\" arrow would be useful.\n\nI'm sure detailing all the maps (assuming they are different) is beyond the time you can/need/want to spend, but some content there would be useful.\n\nJustifying the sidebars really would be awkward -- they're just too narrow.\n\nTo be honest, unless you're setting guide books like telephone books (with flimsy paper, minimal graphics, and totally jejune text), you really need some warmth in your text face. It's late (for me), but offhand, both ITC Tiepolo and Poppl-Laudatio spring to mind....\n\n"
    }
  ]
}
