{
  "id": "32768",
  "title": "Book Design (Andrew Haslam), Book Typography (Ari Rafaeli)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello typophiles,\n\nI came across these two books the other day: [Book Design](http://web.archive.org/web/20120105005006/http:/www.amazon.com/Design-abrams-studio-Andrew-Haslam/dp/0810992205/ref=sr_11_1/002-3174691-4066419?ie=UTF8&qid=1175554855&sr=11-1) by Andrew Haslam and [Book Typography](http://web.archive.org/web/20120105005006/http:/www.oakknoll.com/detail.php?d_booknr=79445) by Ari Rafaeli.\n\nI was wondering if any of you have read them and, if you did, what do you think of them?\n\nI already own Book Design by Hendel, Designing Books by Hochuli and Notes on Book Design by Birdsall, do these two books bring any new information worth the purchase?\n\n",
  "author": "<a href=\"/web/20120105005006/http://typophile.com/user/5681\" title=\"View user profile.\">rafael_lueder</a>",
  "time": "<br>",
  "uid": "5681",
  "comments": [
    {
      "time": "",
      "content": "Well, I'm biased of course. Rafaeli quoted one of my emails without my permission. He could have had permission (1) if he asked, and (2) if the email was explained -- it was a private email to Rich Hendel and was a follow-up to a telephone conversation. Unless the phone conversation was included, the email made no sense -- which may have been his goal.\n\nHis real purpose seemed to be to get at Rich Hendel, who I both admire and call a friend. I take the whole thing as deceitful.\n\nWith that in background, I suppose anything I say about this being a more or less useless book, and not that well set or designed, will have to be viewed as biased. However, that is my view.\n\nCharles Ellertson\n\n"
    },
    {
      "time": "",
      "content": "There is a very well-put review of Ari Rafaeli's book by Robin Kinross for Eye magazine at  \n [http://www.eyemagazine.com/review.php?id=126&rid=606](http://web.archive.org/web/20120105005006/http:/www.eyemagazine.com/review.php?id=126&rid=606 \"http://www.eyemagazine.com/review.php?id=126&rid=606\")\n\nLast year at some point I borrowed a copy from my University library and read it; of the other titles you mention I know only 'Designing Books' by Jost Hochuli, but I suspect that they all might provide a bigger, and perhaps more balanced picture than 'Book Typography'.\n\n"
    },
    {
      "time": "",
      "content": "A have both books, but they just don't compare to\n\nnotes on book design by Derek Birdsall\n\nThat one truly is an eyeopener. Esp. Birdsalls system of dealing with reproductions of art. A must have, imho.\n\n(PS · Rafaeli's book is a let down.)\n\n"
    },
    {
      "time": "",
      "content": "Those of you who know the other books on this area, what do you think of 'Book Typography' by Mitchell & Wightman?\n\n"
    },
    {
      "time": "",
      "content": "For a review of Book Typography by Mitchell & Wightman take a look here:\n\n[http://typophile.com/node/30048](http://web.archive.org/web/20120105005006/http:/typophile.com/node/30048 \"http://typophile.com/node/30048\")\n\nStill waiting for some opinions on Haslam's book, anyone? :)\n\n"
    }
  ]
}
