{
  "id": "3277",
  "title": "Guhfaw",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "looked nice on paper, but it sucks as a font. i tried making it thicker but certain parts ran into each other and it looked crappy. help needed, wanted, appriciated.   \n   \n ![guhfaw](http://web.archive.org/web/20131023080911im_/http:/www.typophile.com/forums/messages/29/2712.gif)   \n   \n-phillip\n\n",
  "author": "eightone",
  "time": "12 Sep 2002 — 4:50am",
  "uid": "782",
  "comments": [
    {
      "time": "12 Sep 2002 — 7:46pm",
      "content": "I like this font...at first glance, I thought that it had   \n graf stylings, but looking at it a little longer, I'm   \nseeing a Whimsy-like face with some character.   \n   \nIt looks like your original intention (and the source   \nof your frustration) was to have nice, smooth curves.   \n But to me it looks like the letters are a little   \nchoppy/chunky...and that's a good thing. It has   \na very hand drawn look.   \n   \nFrom what I see here, my suggestion would be to   \neven out the size & weight of the characters.   \nThe \"e\" seems a little small in relation to the other   \ncharacters. But on the other hand, I think that   \nvariation adds to the hand drawn feeling. The stem   \nof the \"m\" also looks a little heavy in relation to the   \n rest of the lines...   \n   \nI say keep it up and post more examples!\n\n"
    },
    {
      "time": "12 Sep 2002 — 10:45pm",
      "content": "thanks first off. second yeah it was a hand drawn font. I scanned it traced it and did a lil \"outline stroke\" in illustrator and tada. here's the rest of the alphabet   \n   \n ![guhfaw2](http://web.archive.org/web/20131023080911im_/http:/www.typophile.com/forums/messages/29/2719.gif)   \n   \n   \nthanks again i'll be trying out making the letters more the same size (and correct that \"m\" stem).\n\n"
    },
    {
      "time": "20 Feb 2004 — 12:38pm",
      "content": "About the typeface: Guhfaw   \n   \nThis playful typeface can be used for two-color work for special effects.   \n   \nHow would a set of capitals work?   \n   \nDo you know when it will be available at Myfonts.com?   \n   \n Yours truly,   \n Robert\n\n"
    },
    {
      "time": "20 Feb 2004 — 3:18pm",
      "content": "Sorry Mr.Donona I don't happen to sell my fonts, thanks for the comments though.   \nCapitals are still in my sketchbook waiting to be turned into vectors.\n\n"
    }
  ]
}
