{
  "id": "32773",
  "title": "Petition: Fair pricing for European Software",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "For years Adobe has been ripping of European customers with higher pricing. You can read more about it from here:  \n [http://www.amanwithapencil.com/adobe.html](http://web.archive.org/web/20080821135031/http:/www.amanwithapencil.com/adobe.html \"http://www.amanwithapencil.com/adobe.html\")\n\nIf you’re fed up paying more of the same software, please sign your name in this petition:  \n [http://www.gopetition.com/petitions/fair-pricing-for-european-software.h...](http://web.archive.org/web/20080821135031/http:/www.gopetition.com/petitions/fair-pricing-for-european-software.html \"http://www.gopetition.com/petitions/fair-pricing-for-european-software.html\")\n\n [‹ Showing a portfolio and the number of pieces to show](http://web.archive.org/web/20080821135031/http:/www.typophile.com/node/32815 \"Go to previous forum topic\") [Playstation Spiderfont ›](http://web.archive.org/web/20080821135031/http:/www.typophile.com/node/32671 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821135031/http://www.typophile.com/user/14710\" title=\"View user profile.\">tomii</a>",
  "time": "<br>",
  "uid": "14710",
  "comments": [
    {
      "time": " 3.Apr.2007 5.02am",
      "content": "why not just buy from the US?\n\n"
    },
    {
      "time": " 3.Apr.2007 5.17am",
      "content": "elliot: The license bought from the US is not valid in the EU.\n\n"
    },
    {
      "time": " 3.Apr.2007 5.24am",
      "content": "…and Adobe don’t deliver to UK from US\n\nTim\n\n"
    },
    {
      "time": " 3.Apr.2007 7.05am",
      "content": "If you want to support fair software pricing, don’t spend money with Adobe ;o)\n\nFYI, I think the license is perfectly valid in that it will work just fine. It’s what’s called grey-market at that point. Adobe may not SUPPORT that license, but there’s no reason you can’t install and run it wherever you want to.\n\n"
    },
    {
      "time": " 3.Apr.2007 7.44am",
      "content": "Why do you think a company which sells its products for different prices in different countries is cheating those that get the higher price?\n\nSurely a business has the right to determine the prices it asks for its products?\n\n"
    },
    {
      "time": " 3.Apr.2007 9.23am",
      "content": "Nick: I agree, still I can’t figure out why I can’t purchase the software from the US and download it. There’s no extra cost for Adobe.\n\n"
    },
    {
      "time": " 3.Apr.2007 9.28am",
      "content": "If Europeans want better prices, they need to stop buying stuff at higher prices. The reason Europe, Australia, and Japan pay so much more for stuff than Americans is because you guys grumble a lot, and maybe send the European Commission out to do a little legal harassment, but in the end you still buy the software. When companies try jacking up prices in the US we just buy elsewhere. Don’t complain about price discrimination if you’re eventually just going to buy the software regardless.\n\n"
    },
    {
      "time": " 3.Apr.2007 9.56am",
      "content": "I just bought CS \\*2\\* upgrade from Photoshop from Amazon US and got it shipped to the UK (well, it’s currently only got as far as Philadelphia). Paying UK import taxes. Can you not do the same with CS3?\n\nYes, I know I’m one version out of date, but this was my last chance to upgrade to the suite from Photoshop 5.5 (which I bought second hand).\n\n“Why do you think a company which sells its products for different prices in different countries is cheating those that get the higher price?\n\nSurely a business has the right to determine the prices it asks for its products?”\n\nI don’t regard it as cheating the consumer; fair game, but also a game the consumer can play.\n\n"
    },
    {
      "time": " 3.Apr.2007 10.02am",
      "content": "_There’s no extra cost for Adobe._\n\nAs James notes, what the market will bear is a factor in pricing.  \nBut there may be costs involved that the purchaser is not aware of.  \nFoir instance, there are financial complexities for any seller in a foreign market, dealing with book-keeping, banks and taxation.  \nAlso, if a company has extra marketing expenses maintaining a presence in a foreign market, it may wish to factor that into its pricing.  \nFinally, there are product development and after sales support costs, which on a per-item basis are more expensive for a small, foreign language market than for a large, English-speaking home market.\n\n"
    },
    {
      "time": " 3.Apr.2007 10.35am",
      "content": "And there’s the more direct cost of FX fluctuations if sold in foreign currencies, given that retail prices aren’t adjusted very often.\n\nBut from the consumer’s point of view, if any product should be available at a fixed price globally, it would surely be a virtual - ie downloadable one.\n\n"
    },
    {
      "time": " 3.Apr.2007 10.40am",
      "content": "“Why do you think a company which sells its products for different prices in different countries is cheating those that get the higher price?”\n\nBecause it’s a completely arbitrary decision to sell software and other electronic media per-region. It’s an outdated concept that only applies logically to physical goods.\n\nCombine that with the ’global economy’ and ’free trade’ and the like and it just becomes more and more of an absurd concept.\n\nThe only logical (IMHO) price differentiation should be LOWER prices in developing countries. Typically, the US has the higher SOL able to afford the higher prices for software.\n\n“Surely a business has the right to determine the prices it asks for its products?”\n\nAnd surely the consumer can shout about it being unfair. ;o)\n\nIn the end, I think it’s just yet-another-reason to donate to your favorite open source project. ;o)\n\n"
    },
    {
      "time": " 3.Apr.2007 10.45am",
      "content": "I suspect that one of the reasons that software in the EU costs more than in the US is that there are Adobe operations in UK, France, Germany, etc., and the company has the odd idea that these people should be paid. And paid by the sales of the software in those countries. Smaller numbers of units per employee means higher prices, unfortunately.\n\n"
    },
    {
      "time": " 3.Apr.2007 11.17am",
      "content": "So, Adobe UK have lost me as a customer this week because I have bought much cheaper (50% at point of sale) from the territory in which their HQ is based.\n\nPresumably the UK prices should go up to cover the lost sale? But that would make it more likely that others would buy from the US. I might even consider buying several copies and selling them in the UK at a profit, as I’m sure others already do, further eroding UK sales...\n\n"
    },
    {
      "time": " 3.Apr.2007 12.52pm",
      "content": "_it’s a completely arbitrary decision to sell software and other electronic media per-region_\n\nNo, it’s a result of national sovereignty, and hence a business requirement, legislated by governments, and enforced if you are audited. Governments are in cahoots too, with reciprocal tax agreements, so businesses doing international trade have to be very careful. You don’t want to be hit up for several years’ back taxes from foreign sales that you \\*didn’t know\\* you were liable for, and then have those taxes collected by your own government!\n\n_I have bought much cheaper (50% at point of sale) from the territory in which their HQ is based._\n\nJust don’t tell HM Revenue and Customs.\n\n"
    },
    {
      "time": " 3.Apr.2007 1.09pm",
      "content": "Maybe the reason US companies with a large share in a given market might be overcharging in Europe, is that they are investing the proceeds, and waiting for the day when the EU decides it’s time to give back. ;-)\n\n"
    },
    {
      "time": " 3.Apr.2007 1.10pm",
      "content": "“No, it’s a result of national sovereignty, and hence a business requirement, legislated by governments, and enforced if you are audited”\n\nIf you can show me that it’s more expensive in the UK because UK law somehow mandates it, then I’d agree 100%.\n\nAnd, I imagine that’s PART of the issue, but I doubt the only issue. It goes beyond software as well...like DVD region encoding and the like.\n\n"
    },
    {
      "time": " 3.Apr.2007 2.12pm",
      "content": "<cite>Just don’t tell HM Revenue and Customs.</cite>\n\nTell them whatever you like — as I already said, I’ve paid the correct import tax.\n\nIt was actually 40% saving at point of sale, 26% all in:\n\nfrom amazon.com: $487, plus $28 shipping, + $85 import tax and fees = $605\n\nfrom amazon.co.uk and other UK retailers: £413 = $815 all inclusive.\n\nAmazon charge an estimate of import tax and fees as a deposit up front - if they overestimate they refund; if they underestimate they pay the difference. All above board and no unpaid tax exposure for vendor or buyer.\n\n"
    },
    {
      "time": " 3.Apr.2007 2.46pm",
      "content": "Sorry Elliot, I didn’t realize the vendor took care of that.\n\n"
    },
    {
      "time": " 4.Apr.2007 12.35pm",
      "content": "Kinda related:\n\n[http://arstechnica.com/news.ars/post/20070402-eu-investigating-apple-big...](http://web.archive.org/web/20080821135031/http:/arstechnica.com/news.ars/post/20070402-eu-investigating-apple-big-four-labels-over-country-specific-pricing.html \"http://arstechnica.com/news.ars/post/20070402-eu-investigating-apple-big-four-labels-over-country-specific-pricing.html\")\n\nApparently there is something not right with different pricing for the same product!\n\nMikey\n\n"
    },
    {
      "time": " 4.Apr.2007 1.54pm",
      "content": "<cite>Apparently there is something not right with different pricing for the same product!</cite>\n\nNo, there’s just something not right with the EC. Fortunately I live with an anti-trust attorney, so this kind of stuff benefits me financially :)\n\n"
    },
    {
      "time": " 6.Apr.2007 4.59am",
      "content": "I know this isn’t strictly a matter of fairness, but these differences in pricing have certainly made me angry many a time in the past.\n\nThe last time I checked, Adobe’s font prices differed too.\n\n"
    },
    {
      "time": " 6.Apr.2007 7.02am",
      "content": "Something that once happened to me & may be of interest:\n\nWhen buying my first Mac I had to get software for it & I most of all needed QuarkXPress. At that time (1989) it cost more than 2500 guilders in The Netherlands. I decided to try to buy in in the States & after a few attempts (where I was rebuffed on account of ’not permitted to export’) I found a place where to were willing to sell. I think I paid 799 dollars for it (at the time the equivalent of about 1200 guilders).\n\nThe version I received was 2.0. As the ’elder’ Typophiles may remember that dot-zero-version was a disaster — you just couldn’t work with it. So I tried to upgrade, first contacting the European rep of Quark. When they checked my serialnumber they firmly told me they would NOT provide me with an upgrade on the regular conditions — because it was a ’US-version’ they were going to charge me extra, to the tune of 1600 guilders.Crazy, right?. Definitely not okay by me, so I contacted Quark HQ in Denver, several times, a story by itself. Turned out they would not support a version that was ’illegally’ exported from the States.\n\nAfter several months of this kind of hassle, I decided to use a copy of 2.11 that a friend of mine was using. Maybe not completely legal, but I did pay a fair price for a product that turned out to be unusable. I wrapped up the original package and sent it by special delivery to Tim Gill. Never heard back from Quark.\n\nAt this time Adobe’s online activation policy is (as far as I know) not tied to any info on the box of the software, BUT that can change & ’gray’ imports could be the first casualties of a new policy. Marketingbased companies really like to control the pipelines…\n\n"
    },
    {
      "time": " 6.Apr.2007 7.22am",
      "content": "What REALLY gets me about Bert’s story is that so many media companies INSIST on using tangible metaphors to describe their virtual goods, yet like to cry foul when consumers want the same flexibility.\n\nFor instance, they insist that every “pirated (I really hate the misuse of that term)” copy of their music/movie/software is akin to actual theft of physical goods and real income. If it’s real, then the product is a product and should be the same no matter where you are on the planet.\n\nBert, I empathize...I think we all have our own favorite Quark support story that ends somewhat like yours...\n\n"
    }
  ]
}
