{
  "id": "32788",
  "title": "stuck in logo design",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello everybody, this is my first post, I’m french, please excuse my poor english.\n\nI’m designing a logo for a company involved in promoting and installing solar panels to produce energy.\n\nThe brief is tricky.\n\nThe company is at birth stage, but it shoulp compete with majors like Solar BP (British Petroleum etc..).  \nThe company name means “blue” in French. It represents the blue of the sky and concepts such as pure, air, nature, tomorow, etc... The problemis that this name does not represent the activity, the color either.\n\nI thought the only choice was to play with some type. Do you know a font that would vehicle the ideas I just listed ?\n\nAny help woul be muchly appreciated.\n\n [‹ Coalition Logo](http://web.archive.org/web/20070911195737/http:/typophile.com/node/32393 \"Go to previous forum topic\") [23914 ›](http://web.archive.org/web/20070911195737/http:/typophile.com/node/32503 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911195737/http://typophile.com/user/17803\" title=\"View user profile.\">john good</a>",
  "time": "<br>",
  "uid": "17803",
  "comments": [
    {
      "time": " 4.Apr.2007 3.44pm",
      "content": "No offense, but weren’t you hired to do this?\n\nPost some ideas or sketches, no matter how bad you might think they are, and then you might get some feedback. Even providing us with some examples of typefaces you like and why you like them would help.\n\n- Lex\n\n"
    },
    {
      "time": " 5.Apr.2007 7.37am",
      "content": "Yes I was hired, and I was not asking for somebody to do the job for me.  \nI was just asking for some help or advice, new eyes are always welcomed when you work alone.\n\nI’m sorry if this was not the good way to ask. The reason why I did not show my sketches is that I was expecting fresh ideas, not turnarounds of what I already had.\n\n+\n\n"
    },
    {
      "time": " 5.Apr.2007 7.39am",
      "content": "thread deleted.  \n+\n\n"
    },
    {
      "time": " 8.Apr.2007 7.20am",
      "content": "None of those designs do it for me. The first one is alright, but I fail to the see the concept. I guess your energy logo is lacking in energy.\n\nHave you observed and analysed other companies logos in the same industry?\n\n"
    }
  ]
}
