{
  "id": "32792",
  "title": "Display font with Times New Roman",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,\n\nI am setting a 300 pages long reference book. I have to admit that Im doing it for the first time, and I came across some difficulties. First one is the chose of type. The book is translation, and original was set in Times New Roman. My publisher insists on using the same font for text, however, I am free to change at least chapter header font.\n\nWhat sanserif would you advise to use as a display font with [Times New Roman](http://web.archive.org/web/20111019202514/http:/typophile.com/wiki/Times%20New%20Roman)? It should be set at about 18pt, while Times text is set at 11pt.\n\nConsidering the book character (reference/study book for social workers), i was thinking of something close to Gill Sans or \"friendly\" fonts from Erik Spiekermann, but that is rather arbitrary idea. However, font should have central european glyphs.\n\nThanks for reply in advance,  \nOndrej\n\n",
  "author": "<a href=\"/web/20111019202514/http://typophile.com/user/13745\" title=\"View user profile.\">nin</a>",
  "time": "<br>",
  "uid": "13745",
  "comments": [
    {
      "time": "",
      "content": "[FF Kievit](http://web.archive.org/web/20111019202514/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=kievit)  \n [FF Unit](http://web.archive.org/web/20111019202514/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=FF%20Unit)  \n [Cronos](http://web.archive.org/web/20111019202514/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Cronos)  \n [FF Scala Sans](http://web.archive.org/web/20111019202514/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=FF%20Scala%20Sans)  \n [Prenton](http://web.archive.org/web/20111019202514/http:/www.myfonts.com/fonts/blhd/prenton-rp/?refby=typographica)\n\n"
    },
    {
      "time": "",
      "content": "why, Arial of course.\n\n"
    },
    {
      "time": "",
      "content": "You are setting TNR at 11? Could you at least drop it down to 10 and just open up the track and lead? As far as a good sans for TNR I like to pair a sans with a two story a and a similar x-height to cap ratio. Some suggestions would be:  \nTrade Gothic  \nNews Gothic  \nMeta Sans  \nBell Gothic\n\n"
    },
    {
      "time": "",
      "content": "thanks for suggestions and advice. ryan, I read somewhere that at text sizes, you shouldnt change original tracking and leading, because it will destroy font design concept and crush legibility. however, i lack practice to confirm that\n\n"
    },
    {
      "time": "",
      "content": "Well it all depends on how long your line of text is. The idea of adding leading is to allow enough space when you go from one line to the other. If the leading is too tight then you have a chance of losing your place on the page. Have you ever read a line, gotten to the end and then read the same line or skipped up to the previous one? Not a big deal in a short text, but if you are doing it constantly over 300 pages, then you are putting a large burden on the reader. As for the track/letter spacing, it is a matter of taste, but I find some opening of the track too give the text some air. I think fonts like TNR set too close and since the kerning tables are usually imperfect, it leads to uneven letterspacing. I've put together a quick sample. With a version of Baskerville just for comparison. Notice how much easier it is to pick up the next line after opening the lead and and notice how much more even the letterspacing is even with a relatively small track of 10.  \n [SAMPLE](http://web.archive.org/web/20111019202514/http:/xs.to/xs.php?h=xs314&d=07144&f=TNRsample.jpg) The first one is the default, the second is Baskerville, then TNR with more lead, then more lead with opened track.\n\n"
    }
  ]
}
