{
  "id": "32807",
  "title": "TYPERADIO — THE SWEET 16 SESSION",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20080820040711/http:/typophile.com/user/108 \"View user profile.\") : 4.Apr.2007 9.23am \n\nFOR IMMEDIATE RELEASE  \nTyperadio press announcement  \nThe Hague - 04 April 2007\n\n ![](http://web.archive.org/web/20080820040711im_/http:/typophile.com/files/typ-rad_4035.jpeg)\n\n**TYPERADIO — THE SWEET 16 SESSION**\n\nA 16 hour non-stop radio session on the 16th of May, broadcast worldwide from the 10th floor of the ‘Haus des Reisens’ at Alexanderplatz, Berlin. A 16 hour countdown to TypoBerlin 2007.\n\nIn the recent years Typeradio has travelled to international design meetings in Helsinki, Berlin, New York, Lisbon, Vienna, San Francisco & Bologna to meet designers and to talk to them.\n\nIn January 2006 the very first Typeradio show in the 4th dimension took place, featuring the translating bear, the legendary Colour Girl, MC Rick Vermeulen & MC Loudmouth. Since then Typeradio has performed this ‘radio-in-the-4th-dimension’ show at various locations and events, with a very different international line-up.\n\nMay 2007, and it’s time for the next step. Welcome to **SWEET 16,** the live 16 hour radio marathon on the 16th of May. **SWEET 16** will present and interview 16 international guests (designers, artists, creative, architects), dealing with type and design in a very diverse way. To give you a glimpse of the line-up, here a few who already have been confirmed:\n\n**Justus Oehler:** Pentagram, Partner.\n\n**Malcolm Garrett:** widely regarded as a key influence on the development of contemporary UK graphic design and a pioneer of digital design. Malcolm Garrett made his name as a record cover designer, working with the Buzzcocks, and later established his own design company Assorted Images which produced similarly renowned pieces for Duran Duran, Culture Club, Simple Minds and Peter Gabriel.\n\n**Jonathan Meese:** artist and self-proclaimed cultural exorcist who developed a paraphrasing universal language, making use of various sources, including parody, to create a composed work of language art.\n\nMore guests to be announced very soon on Typeradio.org.\n\nAll this will be presented by Typeradio **(LoveLiza, DBXL & Underware)** in cooperation with **Stilvorlagen** - A Lecture Series on Contemporary Graphic Design at the Design Department of the University of Applied Sciences Hamburg directet by **Prof Heike Grebin** and students of **Prof Henning Wagenbreth,** Universität der Künste Berlin & TypoBerlin. The session will be hosted by the fabulous Typeradio hosts LoveLiza and Donald Beekman (DBXL) with real-time visualisation by action- and distraction-designer **Bruno Setola.**\n\nAnd the best of all: **SWEET 16** is for free!  \nSo please come and meet us live in our sky-high-studio-bar (Haus des Reisens - 10th floor), or follow the live session on Internet. More info on [www.typeradio.org](http://web.archive.org/web/20080820040711/http:/www.typeradio.org/ \"www.typeradio.org\").\n\nBest regards, Typeradio\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  \nOne more thing: look out for the secret SWEET 16 AFTER HOURS PARTY.  \nLocation and time will be announced on typeradio.org.  \n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080820040711/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 4.Apr.2007 9.23am",
  "uid": "108",
  "comments": [

  ]
}
