{
  "id": "32815",
  "title": "Showing a portfolio and the number of pieces to show",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Intern interview season is upon me again, and this year my collection of stuff is pretty big. I am showing it all on boards so that I can easily swap stuff in and out for different firms, but I have some questions about the size of the portfolio. I usually see the expected size of professional portfolios as 12-20 pieces, and for students with smaller bodies of work, 5-10 really good pieces. But what constitutes a piece? If I bring in ten pages of spreads from two publications, should I only toss a few more pieces to top it off, or do firms see those ten spreads as just ten pages from two pieces of work?\n\n [‹ 111 years later, Akzidenz in Greek & Cyrillic](http://web.archive.org/web/20080906213806/http:/www.typophile.com/node/32658 \"Go to previous forum topic\") [Petition: Fair pricing for European Software ›](http://web.archive.org/web/20080906213806/http:/www.typophile.com/node/32773 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906213806/http://www.typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 4.Apr.2007 2.52pm",
      "content": "Hey, JP, I’ve read the same regarding how many pieces to show, and you bring up a good question. When I include several spreads from one publication, I consider them one piece. But I have no idea how design firms see this.\n\nWhen preparing a portfolio, I try to keep in mind that the interviewer probably won’t have a lot of time to look at it. I also try to select pieces that won’t overlap. So if you are showing ten spreads from two publications, make sure that each one says something unique about your work. One might be typographic, the other might show good page composition, etc.\n\nJust my two cents.\n\n"
    },
    {
      "time": " 4.Apr.2007 4.28pm",
      "content": "Jpad,  \nYou are right to target your portfolio to who you are talking to. If you have printed pieces, they show you can get a job done from a to z and the thing will RIP and print. The other thing is, wha do you want to do mostly? Show the kind of work that most interests you. 10 to 20 is fine. If your work is complex with book work, then closer to 10. If you have done mostly single page jobs and trifolds, you may want to show closer to 20. Show your production skills too! These will often land you a job because you are able to work right off.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2007 5.21pm",
      "content": "What about cover letters for design jobs? I omit a cover letter unless a job specifically asks for one or if I know exactly who the resume is going to and have something worth saying to that person. This is a holdover from my last career, where cover letters were usually ignored because they were assumed to be form letters with a sentence or to tweaked for impact.\n\nI rarely see design firms or nonprofits even mention cover letters in their job postings, so is it safe to assume that they probably just don’t want to be bothered with one?\n\n"
    },
    {
      "time": " 4.Apr.2007 6.25pm",
      "content": "It is a mixed bag depending on who gets it. A cover letter should have added value, not just “here is my stuff” otherwise, leave it out. Sometimes if you want to reawake a memory in the person you are sending it to, it can help. As in reminding them where you met to establish that you know the person.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2007 7.48pm",
      "content": "Hmmm, I too have heard differing views. But I always send one. As Dezcom says, it is a chance to say something more. And I also think that it is an opportunity to show your communication skills.\n\n"
    },
    {
      "time": " 4.Apr.2007 8.27pm",
      "content": "And particularly to highlight some skill that connects the various positions you may have held previously. I’m thinking particularly along the lines of “I learned how to run A in position 1, and was able to extend my knowledge to utilize it to do B in position 2, which also now qualifies me to do C for you.”\n\n"
    },
    {
      "time": " 5.Apr.2007 6.57am",
      "content": "So what’s a plausible connection between network engineering/system administration and design? I guess Visio and Illustrator are sort of similar...and I do know how to make a mean pot of coffee.\n\n"
    },
    {
      "time": " 6.Apr.2007 7.37am",
      "content": "Well, you are computer- and caffeine-savvy. :-)\n\n"
    }
  ]
}
