{
  "id": "32814",
  "title": "How much paid Monotype for Linotype?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Who wants to know the exact sum that Monotype shelled out for buying Linotype may send me an email.\n\n",
  "author": "Uli",
  "time": "4 Apr 2007 — 1:12pm",
  "uid": "11274",
  "comments": [
    {
      "time": "4 Apr 2007 — 1:56pm",
      "content": "what's with all the secrecy? spit it out.\n\n"
    },
    {
      "time": "4 Apr 2007 — 2:10pm",
      "content": "Uli,\n\nare you saying that you have downloaded, read and actually understood the annual report of the Heidelberg group that they publish in PDF format on their website?\n\nROTFL. The sum was either 50 or 60 million dollar, I don't remember the details, I'm sorry. I'd have to look it up again.\n\nA.\n\n"
    },
    {
      "time": "4 Apr 2007 — 4:25pm",
      "content": "Why should we care? Business is Business and Art is Art.\n\n"
    },
    {
      "time": "4 Apr 2007 — 5:45pm",
      "content": "Well, people should care. This community is not only about the \"art of typography\" but also about the \"business of typography\".\n\nAs Max Caflisch used to say:  \n_Typography is one demure art, if it is art at all._\n\nA.\n\n"
    },
    {
      "time": "4 Apr 2007 — 7:31pm",
      "content": "Apart from the annual report, way back in January Monotype Imaging's owners [TA Associates](http://web.archive.org/web/20131015154605/http:/www.ta.com/) [announced](http://web.archive.org/web/20131015154605/http:/www.monotypeimaging.com/aboutus/pr_display.aspx?year=2007&pr=306) that they are planning to offer an IPO - so all manner of financial details would been submitted to the FTC, and are thus public record. Anyone who's not looked at the numbers must either a. not be interested and has more interesting things to do, or b. has been sitting under a rock somewhere for the past few months.\n\nAlso TA has \"$10 billion of capital\" so whatever they paid I think they can afford it. A more interesting question, is who here is planning to buy a piece of the action once the shares go on sale? ;-)\n\n"
    },
    {
      "time": "5 Apr 2007 — 2:13am",
      "content": "Monotype had to borrow the money to be able to pay the purchase price, i.e. Linotype was bought on credit.\n\n"
    },
    {
      "time": "5 Apr 2007 — 3:30am",
      "content": "I do agree with you Adam, What I wanted to know was why do we care in this case. What makes the business aspect of this deal of special interest?\n\n"
    },
    {
      "time": "5 Apr 2007 — 4:15am",
      "content": "Bojev,\n\nI think it is interesting because it gives an estimate on how much money there is \"in the font business\" altogether. Linotype is a major player so its acquisition price gives a reasonable basis for estimations of other companies.\n\nA.\n\n"
    },
    {
      "time": "5 Apr 2007 — 8:52am",
      "content": "I would assume what we are talking about here is the value of all the intellectual property carried forward into the future plus \"good will\" generated by the name. This compared then to the sale of Berthold is interesting. I wonder what are the implications for an individual designer in selling a font outright to a company?\n\n"
    },
    {
      "time": "8 Apr 2007 — 12:44am",
      "content": "I really could care less about what the exact amount it cost Monotype to buy Linotype because its not what it cost them- its what it costs me and you.\n\nA side effect of the merger was an increase in the price of postscript type from $21 to $24... and the reason is... to pay for the crown jewels- Helvetica???\n\nAlso I believe Linotype had a program in which the more you purchase the more you save:\n\n21 for 1\n\n19 for 3\n\nsomething to that effect- now its gone!\n\nThere were other perks too- certain families of type were lower in price than Monotype- of course that has been moderated... I'm okay with that though.\n\nBut I'm still curious if Monotype's price increase mandated that their distributors do the same (FontShop for instance) or did these distributors decide to do it on their own?\n\nBut I shouldn't grip too much... I try to purchase only OpenType PostScript. Its more money but you get more features or versatility so the $29 or $35 is worth it to me.\n\nMikey :-|\n\n"
    },
    {
      "time": "9 Apr 2007 — 10:24pm",
      "content": "<cite>I wonder what are the implications for an individual designer in selling a font outright to a company?</cite>\n\nNone. For any of the big players, 10% of the fonts in their library make 90% of the revenue (or perhaps it's even more extreme than that). For Linotype, the overwhelming majority of their revenue comes from designs that are at least 35 years old. So the total value of the entire Linotype Library tells you very little indeed about the value of a \\*new\\* typeface that you are trying to get somebody to buy today.\n\nI agree with Adam and Si as to why this stuff is interesting, and I certainly recommend reading Monotype's filing with the SEC. (Not the FTC, btw.)\n\n[http://www.hoovers.com/free/co/sec.xhtml?ID=155441&Page=1&Sort=D](http://web.archive.org/web/20131015154605/http:/www.hoovers.com/free/co/sec.xhtml?ID=155441&Page=1&Sort=D \"http://www.hoovers.com/free/co/sec.xhtml?ID=155441&Page=1&Sort=D\")\n\nCheers,\n\nT\n\n"
    }
  ]
}
