{
  "id": "32817",
  "title": "Mac Cyrillic to Windows Cyrillic",
  "forum": "Build",
  "tags": [

  ],
  "content": "greetings everybody, i stumbled on this site while searching for a solution to my mess..and you are kind of my last hope, as my dead line is in about 5-6 hours...\n\nthe situation:  \ni have .doc files, with [cyrillic](http://web.archive.org/web/20100204115444/http:/typophile.com/wiki/cyrillic) text (macedonian if it matters), the font used for displaying is MAC C TIMES...the problem is that i desperately need it preferrebly in myriad pro light condensed cyr (i guess this exists) or some other condensed font  \n(i'm on windows xp, indesign cs2)\n\nwhenever i select the text and choose another cyr font (minion pro cyr for instance), it converts the cyr characters to latin with some errors...\n\nso, what could i possibly try so that i can select the text, choose a variant of myriad pro cyr...and the letters stay cyrillic?  \nor is there any other way to get things done? find/replace maybe?\n\ni have used fontlab for some basic stuff..so if you have a suggestion, please consider writing at least a small hint on where the settings/options are where i'd have to be careful..\n\nplease if you're reading this and have the slightest clue...consider sharing it, i really need this one badly..\n\nthanks in advance...\n\n",
  "author": "<a href=\"/web/20100204115444/http://typophile.com/user/17826\" title=\"View user profile.\">NeXs</a>",
  "time": "<br>",
  "uid": "17826",
  "comments": [
    {
      "time": "",
      "content": "Maybe this will help:\n\n[Universal Online Cyrillic Decoder](http://web.archive.org/web/20100204115444/http:/www.2cyr.com/decode/?lang=en)\n\n"
    },
    {
      "time": "",
      "content": "[Problem with the link]\n\n"
    },
    {
      "time": "",
      "content": "So, your problem is that your original font and text are likely MacCyrillic. Meanwhile InDesign (both platforms), Windows, Myriad Pro, and newer Mac OSes are all using Unicode.\n\nSo, go to that \"Universal Cyrillic Decoder\" and tell it the source text is \"maccyrillic\" and you want it as Unicode.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "thanks but the link isn't working..i did however, found it through google..unfortunately i don't believe this would've help me much with my current situation...thank you for trying though\n\ni was unpatient and started to find/replace every character to his equivalent in myriad pro cyr light con, almost finished..God bless InDesign...and cursed shall be cyrillic stuff o.O  \nit's not the fastest way but at least it's a working one..  \nif anyone still has a good answer, i'd appreciate it since i would like to know how to solve the problem if i run across it in future....\n\n"
    },
    {
      "time": "",
      "content": "thanks thomas, the link might've been helpful after all,...my mind is a little bit clouded atm (3:06 AM)..i'll give it another reading..this time focusing on the words and trying to comprehend them..\n\n"
    },
    {
      "time": "",
      "content": "sorry the link was broken, fixed it now.\n\n"
    },
    {
      "time": "",
      "content": "Microsoft Word for Windows has a nice built-in conversion routine labeled \"Fix Broken Text\". It deals with formatted text, RTF etc. as well as with plain text.\n\nFor Mac OS, there is the excellent [Cyclone](http://web.archive.org/web/20100204115444/http:/www.alanwood.net/unicode/utilities_fonts_macosx.html#cyclone).\n\nFor Windows, I often use [SC UniPad](http://web.archive.org/web/20100204115444/http:/www.unipad.org/) for this kind of work.\n\nAlso, [Alan Wood’s Unicode resource page](http://web.archive.org/web/20100204115444/http:/www.alanwood.net/unicode/) in general is worth recommending as a source of such information.\n\nAdam\n\n"
    }
  ]
}
