{
  "id": "32812",
  "title": "(x) Looking for the freeware font \"Mohammed\" - Warlock {Angel}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello all:\n\nI am an author and about four months ago I downloaded a font called “Mohammed” from a free internet site to use as the title font for my new book “The Sparrow’s Blade.” I recently had to install a new hard drive on my computer and completely forgot to back-up my font files and so now “Mohammed” is gone so work can’t continue on the cover art. I have only a .jpg of the cover art but it does show the now missing font. I have searched the internet for two weeks now but to no avail...you folks are my last hope. I will attempt to post the .jpg of the cover here but if it doesn’t work please go to my website at [www.kennethrlewis.com](http://web.archive.org/web/20081012174019/http:/www.kennethrlewis.com/ \"www.kennethrlewis.com\") and click on the page called “books” and you can see the cover art there...”The Sparrow’s Blade.” And please be advised that on this cover for the words The Sparrow’s Blade a red Mohammed font has been overlayed with another black Mohammed font but slightly off center for a shadow effect. The smaller words “a novel” are lower case black Mohammed. So, I know the name of my missing font but need to know where I can find it again? Thanks to all of you in advance, for your help.\n\n ![](http://web.archive.org/web/20081012174019im_/http:/typophile.com/files/THE%20SPARROW'S%20BLADE_5552.font.JPG)\n\n| Attachment | Size |\n| --- | --- |\n| [THE SPARROW'S BLADE.font.JPG](http://web.archive.org/web/20081012174019/http:/typophile.com/files/THE%20SPARROW'S%20BLADE.font.JPG) | 61.42 KB |\n\n [‹ \"Lightning\" slanted techno sans on firework box](http://web.archive.org/web/20081012174019/http:/typophile.com/node/32719 \"Go to previous forum topic\") [American Grotesque Font? ›](http://web.archive.org/web/20081012174019/http:/typophile.com/node/31607 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012174019/http://typophile.com/user/17822\" title=\"View user profile.\">kennethrlewis</a>",
  "time": "<br>",
  "uid": "17822",
  "comments": [
    {
      "time": " 4.Apr.2007 2.00pm",
      "content": "That’s obviously an unfortunate font name, because searching for it gets you too many places that have nothing to do with fonts. The only fonts with this name I could find at freebie sites I know look like pseudo-arabic, and not like your typeface at all.\n\nIf someone else doesn’t solve this, I’d strongly recommend looking for a new typeface, and backing it up.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 4.Apr.2007 3.39pm",
      "content": "I realize this is the ID board, not the critique board, but that font really looks like a free font. Perhaps losing it was a blessing in disguise. I’d suggest [Macbeth](http://web.archive.org/web/20081012174019/http:/www.fontshop.com/fonts/downloads/linotype/macbeth/) as a better-drawn alternative.\n\n- Lex\n\n"
    },
    {
      "time": " 4.Apr.2007 4.27pm",
      "content": "Go with Macbeth - 24 bucks well spent - you get what you pay for.\n\n"
    },
    {
      "time": " 4.Apr.2007 5.03pm",
      "content": "Also, regardless of what font you end up using, you really _really_ shouldn’t squoosh it. At all.\n\n"
    },
    {
      "time": " 4.Apr.2007 6.16pm",
      "content": "Yes it was a free font and I thought I downloaded it from a website called “1001 Free Fonts.” Ok, look guys...I am obviously way out of my element here among the “font elite”, but free, crude, and as squished as it is I really do like this font and more importantly, it works for the book cover. I will look at MacBeth, but I would appreciate it if some of you could keep looking, racking your brains, or whatever it is you do when you go on a font search. Anyhow, thanks for the responses so far...you typophiles are great folks!\n\n"
    },
    {
      "time": " 5.Apr.2007 3.07am",
      "content": "Also known as [Warlock](http://web.archive.org/web/20081012174019/http:/www.dafont.com/warlock.font?&psize=l&text=Sparrows+Blade).\n\nI actually like what you’ve done with the cover! It seems in keeping with your subject matter.\n\n"
    },
    {
      "time": " 5.Apr.2007 3.32am",
      "content": "What can we learn?  \nIts not recommandable to use unprofessional free fonts for a professional job. Take it as “Lehrgeld”. This is the german word for money you have to spend for wrong decisions in the past, you did.\n\nDoes it smell too hard?  \nSorry, but its the truth.\n\nGeorg\n\n"
    },
    {
      "time": " 5.Apr.2007 7.48am",
      "content": "Kenneth, it’s obvious how many of us feel about free fonts, but Angel came though and did what you asked for. When you come here for help you can also get ’free advice’. It’s a bargain :)\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 5.Apr.2007 9.40am",
      "content": "Kenneth - Aaron Beck’s Warlock was the original for that font you used. He created it way (in computer time) back in 1994 and, until recently, offered it as $5 shareware. [The website](http://web.archive.org/web/20081012174019/http:/www.recordkeeper.com/products/fonts.html) appears to mostly be defunct now in favor of Beck’s [latest Web incarnation](http://web.archive.org/web/20081012174019/http:/www.awbeck.com/).\n\n"
    },
    {
      "time": " 5.Apr.2007 8.25pm",
      "content": "SUCCESS! I have the font again and refinements may now continue on my book’s cover. My thanks to all of you, and especially to Angel 71. By the way, I did find out this font is shareware and I am doing my best to contact its creator and pay him his $6.00...don’t know how I missed this the first time but I guess I was so excited about finding the “perfect” font I didn’t bother to read the “read me” file attached with it. Thank you again for introducing me to the world of typophiles...I had no idea such an alternate universe existed! But I’m inspired now. Here’s the title and a short synopsis to my next novel:\n\n“The Deadliest Font” by Kenneth R. Lewis\n\nWhen a gathering of typohiles at the annual  \n Stockholm Typophile Convention in Sweden leads  \n to contention between two rival groups...the Sans,  \n and the Serifs...over who designed the year’s  \n prize winning font and will go home with the coveted  \n “Typie” Award, bickering leads to brain bashing murder  \n in this fast paced tale of deadly secrets, intrigue, and  \n steamy typography inside one of the modern day world’s  \n most misunderstood societies.\n\n"
    },
    {
      "time": " 5.Apr.2007 8.26pm",
      "content": "Thank you, Mike! I really appreciate your help.\n\n"
    },
    {
      "time": " 5.Apr.2007 8.28pm",
      "content": "Thank you Angel! You really are one!\n\n"
    }
  ]
}
