{
  "id": "32827",
  "title": "Kompilat",
  "forum": "Serif",
  "tags": [

  ],
  "content": "this thread continues here: [Kompilat + italic](http://web.archive.org/web/20080503010750/http:/typophile.com/node/33937)\n\nthank you\n\n- - -\n\n07-04-05\n\nhey. i’m working on my first serious typeface. my aim is not to create something highly original, but to get into the type and construction rules. now i got to a point of the process when some feedback would be very helpful for me.\n\nthank you for your critique, comments and advices.\n\n| Attachment | Size |\n| --- | --- |\n| [urt\\_kompilat.pdf](http://web.archive.org/web/20080503010750/http:/typophile.com/files/urt_kompilat.pdf) | 64.58 KB |\n\n [‹ Rutaban](http://web.archive.org/web/20080503010750/http:/typophile.com/node/34370 \"Go to previous forum topic\") [Gentium versions: Smallcaps and Sans serif ›](http://web.archive.org/web/20080503010750/http:/typophile.com/node/19776 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080503010750/http://typophile.com/user/17806\" title=\"View user profile.\">ugla</a>",
  "time": "<br>",
  "uid": "17806",
  "comments": [
    {
      "time": " 5.Apr.2007 6.39am",
      "content": "I like this, it has a hap-hazardous feel to it which gives it originality. I think the strokes are to be credited with that feeling, I’ve noticed that they taper at the top and fan out as your eye moves down.\n\nThe **J/j** is very unique as well. The only characters that don’t seem to follow the tapering effect are **h, n and m** , they start with the taper at the top and the proceeding stroke starts thin, thickens at the apex of the curve and then thins out again. I think this works fine on the **m** , but the outside stroke should probably be consistent with the vertical, based on your serifs.\n\nThe **a** does seem to be inconsistent with the rest of the characters though. It’s very top heavy and the bowl doesn’t seem to support the weight well. I might try opening up the bowl more. The **s** feels as if it’s falling forward, you might want to thin the top curve a bit.\n\nAll in all, this is a very nice typeface. Are there plans to do an italicized version or bolder weights?\n\n"
    },
    {
      "time": " 5.Apr.2007 7.26am",
      "content": "looks nice!\n\n"
    },
    {
      "time": " 5.Apr.2007 7.55am",
      "content": "thank you!  \nyeah, the plan is to make it complete with italics and at least one bolder weight. well, i made first sketches of this in august 2006, so the complete opentype thing will be ready in 2028, i guess :) i didn’t even take closer look on the italics so far. but now i see it’s worth to keep it up.  \nthanks.\n\n"
    },
    {
      "time": " 5.Apr.2007 8.08am",
      "content": "FF Quadraat and FF Absara in one! I like it.\n\n"
    },
    {
      "time": " 5.Apr.2007 8.41am",
      "content": "I like it as well. Though I agree with Asvetic on the ’a’.  \nIn the larger sizes it isn’t really a problem, but in text sizes the ’a’ gets less legible.\n\n"
    },
    {
      "time": " 5.Apr.2007 8.46am",
      "content": "I like it very much, too. I’m pretty much in agreement with Asvetic on the _a_ and _s_. I wonder if _h_, _m_, and _n_ would be improved by flattening the curve a little? Maybe if they didn’t taper quite so much toward the stem? Or if the taper were more “chiseled”? But having said that, I am fine with the _h_, _m_, and _n_. The only thing that bothers me is the _a_’s small aperture.\n\nCan’t wait to see what you do with the bold, italic, and ligatures.\n\nVery nice! I really like it.\n\n"
    },
    {
      "time": " 7.Apr.2007 1.26pm",
      "content": "It looks great!\n\nHope you’ll get some serious critique & feedback from the guys here and finish it soon, so I’ll be able to finally use it!\n\nGood luck.\n\n"
    },
    {
      "time": " 3.May.2007 5.44pm",
      "content": "Any progess on this wonderful typeface?\n\n"
    },
    {
      "time": " 5.May.2007 9.42am",
      "content": "hi. i spent last few weeks working on this one: [http://typophile.com/node/33307](http://web.archive.org/web/20080503010750/http:/typophile.com/node/33307 \"http://typophile.com/node/33307\"). i’d be happy to read some comments. i’m starting with Kompilat’s italics tomorow, can’t wait to draw first sketches. i will post the result as soon as possible.\n\n"
    },
    {
      "time": " 6.May.2007 4.33pm",
      "content": "Yeah, I saw that one, but personally I’m not very much in to monospaced faces. :)  \nBut I love Kompilat a lot. Eventhough I still think the bowl of the ’a’ is a bit too small, especially for textsizes. But apart from that, I like the quirkyness it has, the calligraphic ’indents’ in the lines and such. Keep it up.\n\n"
    },
    {
      "time": " 10.May.2007 9.07pm",
      "content": "Please keep going. this is a wonderful effort. I agree the bowl on the a could get a bit bigger, but not much. Also, consider adding a touch more weight to the head serifs (top left of i,n,m and top of d,b etc.\n\nReminds me of the toothiness of FF Eureka, my favorite type by Peter Bil’ak.\n\nRandy\n\n"
    }
  ]
}
