{
  "id": "32823",
  "title": "Illustrated type",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Apologies for asking this again, but I can't think of the name of the guy who does  \nbeautifully illustrated type –&nbsp;I think it was used in a Casio advert a short while ago.  \nIt's hard to describe, apart from a sans serif type with swirls and tendrils coming  \nout of it.\n\nI'd appreciate anyone helping me out here, words are failing me...\n\n",
  "author": "wordsfailme",
  "time": "5 Apr 2007 — 4:13am",
  "uid": "15625",
  "comments": [
    {
      "time": "5 Apr 2007 — 4:27am",
      "content": "Si Scott?\n\n[http://typophile.com/node/27750](http://web.archive.org/web/20121102080617/http:/typophile.com/node/27750 \"http://typophile.com/node/27750\")\n\n[http://www.siscottdesign.com/homeframeset.htm](http://web.archive.org/web/20121102080617/http:/www.siscottdesign.com/homeframeset.htm \"http://www.siscottdesign.com/homeframeset.htm\")\n\nTim\n\n"
    },
    {
      "time": "5 Apr 2007 — 4:47am",
      "content": "Brilliant! A prize of an Easter egg is yours, if only I knew where to send it.\n\n"
    },
    {
      "time": "5 Apr 2007 — 4:51am",
      "content": "Give it to the Bunny, he’ll know where I am.\n\nTim\n\n"
    },
    {
      "time": "5 Apr 2007 — 7:40am",
      "content": "Beware how MASSIVELY overused this effect is right now.\n\n"
    },
    {
      "time": "5 Apr 2007 — 8:14am",
      "content": "Patty, it's Easter, loads of people are giving eggs, still effective though :)\n\nTim\n\n_I know what you mean, every Christmas identity had a take on that style_\n\n"
    },
    {
      "time": "5 Apr 2007 — 8:31am",
      "content": "Alvy Singer: It was great seeing Annie again and I realized what a terrific person she was and how much fun it was just knowing her and I thought of that old joke, you know, the, this, this guy goes to a psychiatrist and says, 'Doc, uh, my brother's crazy, he thinks he's a chicken,' and uh, the doctor says, 'well why don't you turn him in?' And the guy says, 'I would, but I need the eggs.' Well, I guess that's pretty much now how I feel about relationships. You know, they're totally irrational and crazy and absurd and, but uh, I guess we keep going through it...because...most of us need the eggs.\n\n"
    },
    {
      "time": "5 Apr 2007 — 8:39am",
      "content": "Of course, this was a man who thought the only difference between LA and NYC was that LA lets you make a right-hand turn on a red light. ;-)\n\nGreat movie....\n\n"
    }
  ]
}
