{
  "id": "32836",
  "title": "(x) What is the meaning of the \"e\" symbol - \"estimated\" {Choz Cunningham}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Hello all,\n\nI am a newcomer to this forum and look forward to learning from you. I have been working in the industry for a while as a packaging designer.\n\nMy co-worker and I are stumped as the official name for this symbol and what typefaces carry this. It has been identified as the \"euro\" but that is for currency. This is often used in weight claims in beauty / body products. Anyone can help with this one?\n\nThank you,  \nC\n\n| Attachment | Size |\n| --- | --- |\n| [e symbol.jpg](http://web.archive.org/web/20130331031626/http:/typophile.com/files/e%20symbol.jpg) | 37.27 KB |\n\n",
  "author": "codsgn",
  "time": "5 Apr 2007 — 12:41pm",
  "uid": "17814",
  "comments": [
    {
      "time": "5 Apr 2007 — 12:51pm",
      "content": "estimated\n\n[http://en.wikipedia.org/wiki/%22Estimated%22\\_sign](http://web.archive.org/web/20130331031626/http:/en.wikipedia.org/wiki/%22Estimated%22_sign \"http://en.wikipedia.org/wiki/%22Estimated%22\\_sign\")\n\n"
    },
    {
      "time": "5 Apr 2007 — 12:54pm",
      "content": "You may find it interesting that both the Euro symbol and the Estimated sign were not to be tampered with, but to have precise forms in all use. This was then immediately ignored by type designers in the case of the Euro. Tradition has normally had currency symbols styled to match the faces they are a part of.\n\n"
    },
    {
      "time": "5 Apr 2007 — 12:59pm",
      "content": "While the 'e' symbol is probably one of the ugliest things that has ever been invented... let's hope it is also allowed to evolve!\n\n"
    },
    {
      "time": "5 Apr 2007 — 2:25pm",
      "content": "\\> _and what typefaces carry this_\n\nYou'll find the [estimated](http://web.archive.org/web/20130331031626/http:/www.typophile.com/wiki/estimated) symbol in all Adobe's (alphabetic) fonts. Some of these fonts even carry \"alternates\" of it, like the small cap variation in Minion Pro, and the alternate form in Garamond Premier Pro. These were just made to harmonize better, but such variations are uncommon.\n\n ![](http://web.archive.org/web/20130331031626im_/http:/typophile.com/files/estimated_3740.png)\n\n"
    }
  ]
}
