{
  "id": "3284",
  "title": "FF Info Text spacing",
  "forum": "Build",
  "tags": [

  ],
  "content": "I'm doing a little customization on FF Info Text, and notice that the capital T is really off centre (left baring +25, right -15), all other symetrical characters are centered in their space except this one, FontShop explain 'that is how the font is set up.'   \nThis looks like a flaw to me, but it is consistent throughout the family. I've been mistaken before, so i'm not at ease 'fixing' it.\n\n",
  "author": "miles",
  "time": "Tue, 2004-02-24 03:19",
  "uid": "967",
  "comments": [
    {
      "time": " Tue, 2004-02-24 03:35",
      "content": "Oh, I get it now, the kerning fixes the 'all caps' settings and other spacing issues, though its still not a practice that I see the point of, unless it's to make the best of applications that don't support kerning.\n\n"
    },
    {
      "time": " Tue, 2004-02-24 11:47",
      "content": "Relying on the availability of kerning is a tricky business.   \n   \nThe positive side of this is that people who have kerning off generally don't care about superb all-caps spacing anyway! And the \"T\" with the tight right side will \"house\" the lc better under it with no kerning. The negative is that you need a bunch of kerns to fix the funny spacing for sensitive users.   \n   \nIn the end I don't think what they did is a good idea. But I agree it's safer to leave it as is, otherwise you'd have to get a handle on their entire kerning scheme to adjust it, or redo the spacing yourself.   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2004-02-25 05:51",
      "content": "thanks Hrant,   \nare you aware of any other 'non kerning' spacing operations?\n\n"
    },
    {
      "time": " Wed, 2004-02-25 10:10",
      "content": "Probably the biggest one is where round/round adjacencies (like \"oo\") are made too tight. This is because straight/rounds and round/straights are more common linguistically, and making the round/rounds look right (without kerning) would make the (more-frequent) straight combos too loose. Kerns should then be used to loosen all the round/rounds.   \n   \nBTW, I remember you asking (a while back - on the TD list?) about the funny round/round spacing in some Berthold fonts, right?   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2004-02-25 11:04",
      "content": "I found the actual post:   \nYou asked about the positive kerning pairs in Berthold Garamond on March 5, 1999.   \nBut on Typo-L, not TD... My memory is getting worse with age. :-\\>   \n   \nhhp\n\n"
    }
  ]
}
