{
  "id": "32840",
  "title": "AP misquote?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This [AP piece](http://web.archive.org/web/20081007161338/http:/www.sfgate.com/cgi-bin/article.cgi?f=/n/a/2007/04/05/entertainment/e112626D88.DTL)...\n\n“Today, Helvetica is the most widely distributed typeface in the world, if you discount Arial,” says Otmar Hoefer of German company Linotype, which now owns the design.\n\nWonder if he intended to say “if you include Arial” - as surely Times, Verdana or even Comic Sans are more widely distributed?\n\n [‹ Mercedes-Benz: Luxury cars with Arial on the gearknob](http://web.archive.org/web/20081007161338/http:/www.typophile.com/node/32777 \"Go to previous forum topic\") [111 years later, Akzidenz in Greek & Cyrillic ›](http://web.archive.org/web/20081007161338/http:/www.typophile.com/node/32658 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007161338/http://www.typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 5.Apr.2007 4.47pm",
      "content": "Maybe he meant “Today, Helvetica is the most widely distributed typeface in the world, EVEN if you discount Arial,” instead of “Today, Helvetica is the most widely distributed typeface in the world, if you discount Arial,”?\n\n"
    },
    {
      "time": " 5.Apr.2007 5.24pm",
      "content": "“Today, Helvetica is the most widely distributed typeface in the world, if you COUNT Arial,”\n\nChrisL\n\n"
    },
    {
      "time": " 5.Apr.2007 5.26pm",
      "content": "Even better yet:  \n “Today, ARIAL is the most widely distributed typeface in the world, EVEN if you DISCOUNT Helvetica,”\n\nChrisL\n\n"
    },
    {
      "time": " 5.Apr.2007 5.40pm",
      "content": "How about “Helvetica is the most widely distributed typeface in the world if you don’t count any font bundled with Linux, Windows, Office or the iPod, and only look at fonts shipped with Mac OS that begin with H.” ;-)\n\n"
    },
    {
      "time": " 5.Apr.2007 9.13pm",
      "content": "Note that he said distributed, not sold, shipped, purchased, or even used. Depending on how the suits at Linotype define distribution, he could very well be speaking truthfully.\n\n"
    },
    {
      "time": " 5.Apr.2007 9.35pm",
      "content": "Maybe - but what definition of “distribute” would make this accurate?\n\nPS. Re truthiness - I think he was misquoted, not being untruthful.\n\n"
    },
    {
      "time": " 6.Apr.2007 10.08am",
      "content": "Suntory time?\n\n"
    }
  ]
}
