{
  "id": "32850",
  "title": "What's your opinion of Relato Sans?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Okay, so i know [Relato Sans](http://web.archive.org/web/20101215202112/http:/typophile.com/wiki/Relato%20Sans) is a TDC winner and all, and it's currently on special at myfonts.com, but i'm not sure if i should spring for it. i love the roman fonts, but the italics are a little out there for me. can any of you sway me one way or the other on whether or not i should scoop this one up?\n\n",
  "author": "<a href=\"/web/20101215202112/http://typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": "<br>",
  "uid": "7006",
  "comments": [
    {
      "time": "",
      "content": "I don't like the italics. The roman is nice but for me not special enough - I have other fonts that could fit the same bill. But the italics would be a deal breaker.\n\n"
    },
    {
      "time": "",
      "content": "I feel exactly the same way about the italics.\n\n"
    },
    {
      "time": "",
      "content": "Why does Relato Sans link to an empty wiki page?\n\nA link to a specimen:\n\n[http://www.myfonts.com/images/library/source/Medium\\_Black.gif](http://web.archive.org/web/20101215202112/http:/www.myfonts.com/images/library/source/Medium_Black.gif \"http://www.myfonts.com/images/library/source/Medium\\_Black.gif\")\n\nYea, the italics is a bit odd...the spacing is off and the various angles make you a bit woosy when reading it. Unique, though. So, for that alone, I have to give it some points.\n\n"
    },
    {
      "time": "",
      "content": "The italics are not quite as smooth as I would prefer but I like the warm feeling it generally has for a sans. I like \"out there\" though so I may lead you astray. Go with your gut. Look at it and see if you would use it or not.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I actually quite like the italics. :)\n\n"
    },
    {
      "time": "",
      "content": "_Why does Relato Sans link to an empty wiki page?_\n\nbecause i didn't feel like coming back someday in the future and putting the link in then. thanks all for your input, always good to hear others' thoughts on these things.\n\n"
    },
    {
      "time": "",
      "content": "Paul let me try to sway you. ;^)\n\nThink of Dwiggins's M-Formula when you consider the italics. At smaller sizes it will be just interesting enough to be original and when you use it at display sizes it will be an entirely new font. Relato's italics, for me, are a lot of what I would consider the reason to license it. Where the roman is nice, I have many other fonts in my library which are similar enough that I couldn't rationalize the license. However, those italics! They remind me of the italics that [John Downer](http://web.archive.org/web/20101215202112/http:/typophile.com/wiki/John%20Downer) designed for [Triplex](http://web.archive.org/web/20101215202112/http:/www.emigre.com/EF.php?fid=141). Don't shy away from something because it doesn't appear to be the norm.\n\nAlthough, I don't see a double-f ligature! So that might be a reason for me not to license it. ;^)\n\n"
    },
    {
      "time": "",
      "content": "I don't have a problem with the italics, although I probably wouldn't licence it either: I agree with Patty that it lacks a distinctive-enough hook to make me want to add it to my collection.\n\nThat's part of the problem, I guess, with freelancing -- it takes more than being just a pretty face to get bought.\n\n"
    },
    {
      "time": "",
      "content": "\"I don’t see a double-f ligature! So that might be a reason for me not to license it. \"\n\nSo tell us Miss Ti\"ff\"any, why prey tell is that?  \n:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Cause if my name don't look good in the typeface, nothin' else is going to! ;^P\n\nAs silly as it sounds my name has two of the most difficult\\* kerning pairs, and a double-f ligature, if all are present and accounted for, this demonstrates how well they paid attention to details.\n\n\\*Maybe not most difficult, but you'd be surprise how many great typefaces fail to do a good job with them.\n\n"
    },
    {
      "time": "",
      "content": "Some how I kinda' figured that ;-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "[FF Absara's italics](http://web.archive.org/web/20101215202112/http:/www.fontshop.com/search/?q=absara+sans+italic) tend to generate the same sort of polarized responses. I happen to enjoy both families, but haven't yet tested Relato in print.\n\n"
    },
    {
      "time": "",
      "content": "(Wow, Fontshop's site is MUCH faster now. And the pages are cleaner too. Good job!)\n\n"
    },
    {
      "time": "",
      "content": "Yes! That page just jumped open!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "<cite>Although, I don’t see a double-f ligature! So that might be a reason for me not to license it. <cite></cite></cite>\n\nok, I take note for future revisions... : )\n\nEM\n\n"
    },
    {
      "time": "",
      "content": "Heehee. Thanks Eduardo!\n\n"
    },
    {
      "time": "",
      "content": "For me Relato Sans is a mix of Mundo Sans (and similar types), Klavika, and let say 'informational' dutch sans types.\n\nI have to disagree with the comments about the roman- perhaps the tone of its not serious enough for certain jobs but it is special. The hyper-modulation in the italics are not distracting (nor apparent) at book sizes. But like Tiff says... enlarge them and you have something new and very funky. And that goes for the roman too.\n\nThe small caps look to die for!!!\n\nThe Absara family has bony less friendly feel. And I don't like serif in print.\n\nI also would like to see more ligatures added to this family- as well as Bohemia!!!\n\nMikey :-)\n\n"
    },
    {
      "time": "",
      "content": "_Wow, Fontshop’s site is MUCH faster now. And the pages are cleaner too. Good job!_\n\nFaster but FontShop now limits the amount of fonts you view on a page. I like to look at 100 on a page for large comparisons or just to see as much as I can.\n\nNow only myfonts and Linotype let you do this.\n\nMikey :-(\n\n"
    },
    {
      "time": "",
      "content": "That will change soon.\n\n"
    },
    {
      "time": "",
      "content": "<cite>And I don’t like serif in print.</cite>\n\nYou have got to be kidding.\n\n"
    },
    {
      "time": "",
      "content": "I think he means \"I don't like FF Absara Serif in print\".\n\n"
    },
    {
      "time": "",
      "content": "Paul, back to your question, for what sort of work would you be using Relato Sans?\n\n"
    },
    {
      "time": "",
      "content": "just personal use. maybe some small personal book projects, maybe on a poster. just was wondering if it would be worth adding to my library.\n\n"
    },
    {
      "time": "",
      "content": "I feel like Manso's technique is sound and the quality of the type isn't questionable, so it's down to your personal opinion. Print it at various sizes and see how you feel. Compare it to other faces you're considering, or what might already be in your library.\n\n"
    },
    {
      "time": "",
      "content": "Coles\\> thank you for the info on FontShop and for clarifing what I said for pattyfab\n\nPaul the Relato Sans is a 'personal' font... its warm yet useful on all levels. Use the Italic by itself or use the Bold Caps by itself or use just the Roman Sans and it stands by itself. Use them together and you have text system full of personality and options.\n\nMikey :-)\n\n"
    },
    {
      "time": "",
      "content": "I'm surprised no-one, except SuperUltraFabulous, mentioned the bold, which is beautifully emphatic. One of the reasons I bought Relato Serif was for the superb bold (plus it was also on the same ridiculously cheap deal at MyFonts a couple of months back:-). I'm certainly going to scoop up some Relato Sans faces at these prices! Plus, I would presume it will set more or less identically to the Serif, in which case it's a very economical font, almost identical to Myriad.\n\n"
    }
  ]
}
