{
  "id": "3286",
  "title": "Diameter logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi all,   \n   \nThe company is a new technology transfer business -- they take newly developed materials and technologies and try to fashion useful products out of them. Their clients will mostly be people buying or selling these materials/products, so sciency material engineering type companies and people who buy weird and wonderful, high-tech things -- from aeronautical to IT manufacturers.   \n   \nThey are a British company, and want something that makes them look serious and modern, as well as something that will work equally well in the US, Europe and Asia.   \n   \nTo make things a bit more complicated, the name is pronounced dia-meter rather than just diameter, and I've been told not to punctuate the word in the logo to make this distinction clear.   \n   \nI'd love to hear any opinions on the logos I've come up with, including the colours and tag-line -- it's difficult to think of something snappy involving material applications!   \n   \nThanks in advance everyone, it's most appreciated.   \n   \n [http://www.jordanharper.uklinux.net/diameter\\_logos.gif](http://web.archive.org/web/20100311192054/http:/www.jordanharper.uklinux.net/diameter_logos.gif)   \n   \nJordan   \n   \nPS I know that the arc on 1a and 1b could do with shifting a little to be optically central wrt to 'dia'.\n\n",
  "author": "<a href=\"/web/20100311192054/http://typophile.com/user/2278\" title=\"View user profile.\">Jordan Harper</a>",
  "time": "<br>",
  "uid": "2278",
  "comments": [
    {
      "time": "",
      "content": "Did you mean \"NOT\" punctuate the word \"dia\" or?   \n   \nIf it was meant to be punctuated, I would pick 1b. Modern for sure, but I'm not sure about serious. Maybe you should revise your color choices. Is that Cholla?   \n   \nOverall I like the logo. Good job! At first glance, I thought about Citi. [http://www.citi.com](http://web.archive.org/web/20100311192054/http:/www.citi.com/)\n\n"
    },
    {
      "time": "",
      "content": "Logo 1b works the best...So far, but I still think this has far to go. I think the dark orange color could symbolize rust as in old metal. It is a complementary color but no good in this case. Typeface Cholla is overused in my opinion. Tagline should not extend beyond logo, It is had to tell form picture , maybe it does not extend beyond logo but with all the negative space around the lc. r is may need to be moved left a bit.\n\n"
    },
    {
      "time": "",
      "content": "Did you mean \"NOT\" punctuate the word \"dia\" or?   \n   \nIf it was meant to be punctuated, I would pick 1b. Modern for sure, but I'm not sure about serious. Maybe you should revise your color choices. Is that Cholla?   \n   \nOverall I like the logo. Good job! At first glance, I thought about Citi. [http://www.citi.com](http://web.archive.org/web/20100311192054/http:/www.citi.com/)\n\n"
    },
    {
      "time": "",
      "content": "I don't like the #2 options at all. The arc looks like a \"c\" that fell down from the sky.   \n   \n1b is best. As everyone else is suggesting, the colors are a little weak for a company going for \"serious\". Serious colors tend to be on the darker side (dark blues, purples, reds, etc.). Good job so far.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "",
      "content": "i agree, 1b is the best, somehow i find the ascender of the \"t\" too tall, nice work   \n   \nnice job   \n   \nCG\n\n"
    },
    {
      "time": "",
      "content": "I think Cholla is working OK here, but Ole is right - try to find something in that spirit but less common.   \n   \nThe top ones are nice (except your circle arc is wobbly on the bottom-left) - but maybe use a darker weight of the type.   \n   \nBTW, I'm also confused about \"punctuation\" being desired or not by the client. If it is desired, I was thinking you could put a bullet with a slanted line going through it between \"dia\" and \"meter\". Because for one thing what you're shoing now is a _circumference_...   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "It looks like he's showing Diameter to me.   \n   \nThe Cholla concerns I would agree with, but   \noveruse to a Typophile is different than overuse   \nin general, imo.   \nIf you posted this at any non-type forums, I'm   \nguessing it wouldn't be a concern.\n\n"
    },
    {
      "time": "",
      "content": "![](http://web.archive.org/web/20100311192054im_/http:/www.typophile.com/forums/messages/29/27158.gif)\n\n"
    },
    {
      "time": "",
      "content": "Hey, I thought you were fiercely against actually showing logo suggestions! ;-\\>   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Nestled in the circumference/diameter relationship is a   \ncapital D ... that might be a direction   \nworth exploring with some sketches.   \n   \nbj\n\n"
    },
    {
      "time": "",
      "content": "I donno about the b's. how many times have we seen this treatment - prefixing with colour.   \n   \nAnd how would this logo work in black and white and on reverse backrgounds?\n\n"
    },
    {
      "time": "",
      "content": "I hope/think you are kidding Hrant ... well half   \nkidding I'm sure, especially about the word   \nfiercely. ;)   \nAgain, i didn't proffer the rules. I'm a   \nreformed sketcher myself.   \n   \nbtw, that is an image from google   \nto show circumference/diameter   \nto hhp.   \n   \nOnly after posting did I see the capital   \nD and pointing this out I didn't think   \nwent against Pemberton's \"let people   \ndo their own work\" mantra. ![:-)](http://web.archive.org/web/20100311192054im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nbj\n\n"
    },
    {
      "time": "",
      "content": "Thank you so much everyone for your feedback -- I'm kind of glad a common (stylistic at least) consensus has settled on 1b. Everyone else (non designers) points there too, so I think I'm on to something (as embryonic as it may be!)   \n   \nJust to clarify the punctuation thing: the word is pronouced (for the purposes of this client) diamEter, as if it were two words, dia and meter, but he wants to emphasise this without punctuating the logotype with a hyphen or anything (hence the duotone word).   \n   \nole: I see what you mean about the orange -- rust + modern materials company = bad idea! Cholla is overused from our point of view, but (as BJ Harvey says) most non-designers don't see the overuse in the same light do, I don't think. I'm happy with the face at the moment (you may notice that I modified the upper join of the 'a' bowl a little). You're absolutely right about the tag-line too, it's an oversight on my part, thanks for bringing it to my attention.   \n   \nScott: I'll look in to some more 'serious' colours, thanks for the feedback.   \n   \nCristian: I agree about the 't' height, I may try bringing it down a little, thanks.   \n   \nHrant: The arc is actually a segment of a (pixel) perfect circle, it's distortion may be an optical illusion caused by the fact that it's a little more than a semicircle and I've rounded the ends. Good spot though ![:-)](http://web.archive.org/web/20100311192054im_/http:/www.typophile.com/forums/clipart/happy.gif) Nice idea about the punctuation too, I almost want to try it out!   \n   \nThanks again everyone, I'll post up some new comps once I've processed all this feedback.   \n   \nJordan\n\n"
    },
    {
      "time": "",
      "content": "adjustments to 't' height and tracking here :   \n [http://www.jordanharper.uklinux.net/diameter\\_logos\\_v2.gif](http://web.archive.org/web/20100311192054/http:/www.jordanharper.uklinux.net/diameter_logos_v2.gif)   \n   \nblack on white/white on black here:   \n [http://www.jordanharper.uklinux.net/diameter\\_logos\\_BW.gif](http://web.archive.org/web/20100311192054/http:/www.jordanharper.uklinux.net/diameter_logos_BW.gif)   \n   \nThoughts are most welcome, and positively encouraged ![:-)](http://web.archive.org/web/20100311192054im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nJordan\n\n"
    },
    {
      "time": "",
      "content": "Hi BJ. Well to some extent I agree with you about your counter-punch to my critique of using Cholla. But besides commonality and overuse lets take it one step further. Copyrighting. A semi-circle and Cholla for a logo. Could easily get you a bit stuck when you need to proper legal mark. This is one reason why I often do custom type in my clients identity work.\n\n"
    },
    {
      "time": "",
      "content": "Tanya has brought up a good point. Logo must work in B+W.\n\n"
    },
    {
      "time": "",
      "content": "Ole, i agree with you about the custom type, for sure!   \n   \nCholla is/was the regular titling typeface at Entertainment Weekly,   \nprobably its most prominent usage ...   \nbut I don't think it's in the Mrs. Eaves or Helvetica category   \nas far as overuse.   \n   \n(i haven't seen EW lately, however.)   \n   \nAnd this particular usage doesn't scream Cholla the   \nway other uses might. (With ligatures turned on, etc.)   \n   \nOf course determining overuse is subjective.   \n   \nanyway, yeah, custom type is a good idea. ![:-)](http://web.archive.org/web/20100311192054im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nbj\n\n"
    },
    {
      "time": "",
      "content": "I've taken on board the comments I've had from here and elsewhere, and made a few more changes.   \n   \nI've increased the size contrast between the main logotype and the tagline to help the tag fit underneath more comfortably -- I wasn't happy with tracking out the main logotype so I've tightened it up.   \n   \nI've increased the weight of the arc a little, and tried to position it slightly better wrt to 'dia'.   \n   \nI'm also experimenting with some different colours.   \n   \nThank you kindly for your attention, opinions welcomed:   \n   \n [http://www.jordanharper.uklinux.net/diameter\\_logos\\_colours.gif](http://web.archive.org/web/20100311192054/http:/www.jordanharper.uklinux.net/diameter_logos_colours.gif)   \n   \nJordan\n\n"
    },
    {
      "time": "",
      "content": "1f is playful.   \n   \nI cant stand 1g. It's so muddy\n\n"
    },
    {
      "time": "",
      "content": "Thanks for all the feedback everyone (and you're right Andrew, 1g is horrible, in hindsight). If I'm not being too much of a pain, could I ask for some more?   \n   \nMy client has requested 'more corporate' looking colours, so I'm experimenting with the tried and trusted grey/blue grey/green combos, though I am trying to use slightly more contemporary shades of blue/green.   \n   \nI've also begun working on some rudimentary marks, for use when the logo + tag line is too much.   \n   \nhttp://www.jordanharper.uklinux.net/diameter\\_logos\\_v4.gif   \n   \nThanks in advance for all the help, it's all most appreciated.   \n   \nJordan\n\n"
    },
    {
      "time": "",
      "content": "sorry, link didn't activate for some reason:   \n   \n [http://www.jordanharper.uklinux.net/diameter\\_logos\\_v4.gif](http://web.archive.org/web/20100311192054/http:/www.jordanharper.uklinux.net/diameter_logos_v4.gif)\n\n"
    },
    {
      "time": "",
      "content": "Refer back to my post #196.   \n   \nIf your client is going for \"serious\" and \"corporate\", the solution is to simply use almost any color, but dark. For example, your blue looks like PMS 641C (on my screen anyway), but to make it corporate you should use something more in the neighborhood of PMS 648C, and maybe replace the gray with PMS 647C. I'm not suggesting that these are the colors to use, but I promise if you show your client these darker ranges, he'll be a much easier sell.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "",
      "content": "Thanks Scott, I'll try!   \n   \nJordan\n\n"
    }
  ]
}
