{
  "id": "32869",
  "title": "Folio Bold Extended - The Forgotten Typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "FBE seems to be the lost member of Konrad F. Bauer's \"Folio\" designs created between 1957-1962. It was used extensively by Universal Studios back in the late 60s to the mid-70s for various TV shows such as THE ROCKFORD FILES, BANACEK, McMILLAN & WIFE, McCLOUD, and COLUMBO (see attatched image). It was never available as instant lettering from Letraset but Letterpress put out a version of it in the late 1980s. I had a 24 pt. sheet but lost it before the wonders of Photoshop and Fontographer became available to me! I have tried many times to duplicate it as working font but original source material (a complete alphabet of a usable size)is impossible to obtain. It's very similar to Swiss Bold Extended but more elegant, in my opinion. Does anyone know why this beautiful typeface has never surfaced as a working font, or why it was removed from the \"Folio\" family to begin with? I'd be most interested in any and all comments.\n\n ![](http://web.archive.org/web/20150402093328im_/http:/typophile.com/files/Folio%20Bold%20Extended%20(Columbo)_3975.jpg)\n\n",
  "author": "steviebaby",
  "time": "7 Apr 2007 — 1:46am",
  "uid": "17831",
  "comments": [
    {
      "time": "7 Apr 2007 — 5:05am",
      "content": "I have a complete alphabet specimen of Folio Bold Extended in an old VGA catalog from 1976 - it is still in a VGA catalog of the early eighties but not as good print quality - contact me by clicking on my name above icon and clicking contact - I will e-mail you a 600 or 1200 dpi scan of the sample - it is 24pt appx.\n\n"
    },
    {
      "time": "7 Apr 2007 — 8:24am",
      "content": "\"Folio Bold Extended\" (\"Folio breitfett\" was the German font name of the German Bauersche Gießerei foundry) is contained as specimens (uc & lc, figures, and punctuation marks) in the book \"Typos\" by Ben Rosen, New York 1963, Reinhold Publishing, in the point sizes 48, 36, 28, 24, 20, 16, 12.\n\n"
    },
    {
      "time": "7 Apr 2007 — 10:18am",
      "content": "Steve, just found a good 36pt specimen in a collection of specimens I have from Adcraft Typographers from the 1960s - will forward a scan of that to you later, Bob\n\n"
    },
    {
      "time": "7 Apr 2007 — 11:36am",
      "content": "Folio-Grotesk breitfett  \nBauersche Gießerei, Frankfurt am Main  \nErstguß 1963  \nK.F.Bauer, W.Baum\n\nIt is still produced by \"bauer types\", barcelona.  \nAnd of course they still hold the copyright :-)\n\nIn Germany you can find in every second or third old letterpress company lots of cabinets full with it. Its not sold as good as Helvetica or Futura.\n\nGeorg\n\n ![](http://web.archive.org/web/20150402093328im_/http:/typophile.com/files/1_6460.jpg)\n\n"
    },
    {
      "time": "7 Apr 2007 — 2:56pm",
      "content": "Checked Bauertypes.com and no Folio Bold Extended shown - why this font got dropped from inventory is still the question.\n\n"
    },
    {
      "time": "7 Apr 2007 — 7:13pm",
      "content": "Guys, so sorry for taking so long to reply. I'd like to thank all of you for the information, and bojev - a special thank you to you for emailing me the FBE scan. I'm very grateful to you all. Regards, Steve.\n\n"
    },
    {
      "time": "12 Jul 2013 — 1:14am",
      "content": "I wonder if this is Folio Extended? [http://typophile.com/node/104464#new](http://web.archive.org/web/20150402093328/http:/typophile.com/node/104464#new \"http://typophile.com/node/104464#new\")\n\n"
    },
    {
      "time": "12 Jul 2013 — 3:58am",
      "content": "I would say it could be - just looked at my old Folio Extended specimen and it is close to right on.\n\n"
    },
    {
      "time": "19 Dec 2013 — 12:45am",
      "content": "And this example, suspect it is also folio extended looking at the 'a'…\n\n[http://typophile.com/node/107720](http://web.archive.org/web/20150402093328/http:/typophile.com/node/107720 \"http://typophile.com/node/107720\")\n\nWould anyone our there have a scan I could beg?\n\nmany thanks\n\nMatt\n\n"
    }
  ]
}
