{
  "id": "32874",
  "title": "Is there a way to convince non-designers that typography is important?",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "I am a student, but nontheless I occasionally volunteer my time to design for local non-profit organizations. Just a few minutes ago I recieved an email after asking for the body copy for a new leaflet to educatate people about how to reduce their carbon footprints and such and recieved a reply:  \n\"I'm not sure if anything needs to be done with these three; I'm going to run them by  \nthe committee this afternoon at 4:00 and ask what they think (whether they  \nwant to add or subtract any text, or if they think any graphic design needs  \nto be added. Considering that they'll be B/W, I shouldn't think so). So  \nthere may be nothing you need do.\"\n\nThe text that they are running by the committe is two sheets per 8.5x11 page, double-sided, with huge line lengths and 14 point Times.\n\nI guess my question lies in this: how do you convince people who are unaware of the importance of typography and how type IS design and why they should care about it. How do I word something to say, line lengths and point size and typeface selection are all important in readability and capturing the audience's attention, keeping it, and helping disperse the information correctly without getting into heavy theory and mumbojumbo that they don't care about/don't have time to listen to? Is there some sort of article out there that is concise that I could send to them? Research that would make it credible? Or is this a venture I should take up on my own to try to create such an article that is easy to understand and not too terribly long?\n\nYour help is appreciated!  \n-Persa\n\n",
  "author": "bxfl",
  "time": "7 Apr 2007 — 10:05am",
  "uid": "16693",
  "comments": [
    {
      "time": "7 Apr 2007 — 1:01pm",
      "content": "You could show them how else it could be done & maybe they'll admit there is a difference & agree to your design... But to be honest, I wouldn't get my hopes up, non-designers are very easy to please & they don't really care much about legibility and such. Maybe try to sell your ideas in a \"pimp my flyer\" kind of way, make it sound cool or something. Find their weaknesses and use them in your advantage (eg. for youthclubs you could tell them to make something more appealing to kids, for restaurants, try to focus on style,...). Find out whatever is important in what they do & try to convince them the design should reflect that also. But again, don't get your hopes up, people are hopelessly uninterested in these matters. I can't begin to tell you the times I've sat down in what looked like a classy or trendy restaurant only to find Comic Sans on the menu (how's that for spoiling your appetite?).\n\n"
    },
    {
      "time": "7 Apr 2007 — 1:07pm",
      "content": "This is an age old problem. Imagine a biologist trying to explain the importace of insects in our life.\n\nOnly when you can demonstrate a value to people in a visible direct way, will they perhaps see your point. To most people, type is just \"there' and they would not give it notice until it were taken away from them.\n\nChrisL\n\n"
    },
    {
      "time": "7 Apr 2007 — 1:34pm",
      "content": "Obviously I would'nt want to stop your quest to 'educate' the non-design community, but in my experience you are probably better off trying to 'rise above it'.\n\nIf you feel you want to see it through, I don't think a few bullet points will change opinions, in my experience 'clients' either appreciate the value of design or not, whichever you have to show them something material rather than just verbal/text descriptions. As a last resort do the design you want without their input, use dummy text, whatever it takes, just show them something that is immediately superior to what they have got. I have a personal rule, if you believe in something and the client says no, tweak it, show them again, if they say no again, forget it, move on.\n\nI'm sure your ultimate goal of doing this sort of project, is to show potential employers that you can bridge the gap between art school and the realities of professional design. I often look at portfolios and would not have a problem if a designer showed two examples of the same project, firstly what the client wanted and got! and second the non-client solution, especially if they could talk about the positives (and negatives) of BOTH. There are more factors in getting a job than just a great portfolio.\n\nI have worked with and employed junior designers over the years and one of the hardest lessons for most is the influence that clients have on our work, for some it can be a tough learning curve. I think, with experience, successful designers learn how to nudge clients 'softly' into doing what they want using a multitude of means, unfortunately that experience often only comes with trail and error, so what you are doing right now is a postive experience, if only for reasons that you might not expect.\n\nGood luck.\n\n"
    },
    {
      "time": "7 Apr 2007 — 3:17pm",
      "content": "I've had similar experiences, mostly with artists that aren't designers. A filmmaker client of mine is very big on Impact and Arial. It takes me awhile to explain why Univers and Helvetica are perfect substitutes that are for more legible and more thought out. Of course it's really hard to tell her that her favorites are knock offs of the ones I'm pitching for.\n\nWith her, I've fought and fought numerous times [I somehow ended up working with this lady for two years straight] and it's incredibly ironic how she'll reject my ideas and then at the completion of a job she'll decide on my initial idea. It's absolutely absurd.\n\nThat and she owns photoshop so she thinks she's a designer too.\n\nDon't be too persistent with them, and create multiples. What they want vs. your well thought out and finished product will be sure to get them to submit, even if just a little bit.\n\n"
    },
    {
      "time": "7 Apr 2007 — 9:51pm",
      "content": "(poster's note: i just wrote about three paragraphs in response to your question. just before hitting 'submit,' i deleted it all. moral: discretion is often the better part of valor.)\n\ni don't know. we all run into this all the time. i once gave a remarkable proposal presentation to a prospective client for an identity campaign (client saw this only as \"logo.\") after my presentation, i told the client what the development would cost, and he scoffed, \"What? my nephew has a computer! he'll do it for $50!\" his nephew has a computer. ok. so, how do you 'educate' these clients? i don't know that we can. if we can get them to hire us, we do the best work we know. and maybe they will, on some level (even if it's only by others' responses) catch on that at least we know what we're doing.\n\n(i just deleted a bunch more...)\n\n"
    },
    {
      "time": "8 Apr 2007 — 12:28am",
      "content": "<cite>“What? my nephew has a computer! he’ll do it for $50!”</cite>\n\nYou don't want this guy to hire you. Trust me, your much better off. I've found that the best course of action to take in these scenarios is to thank the person for the opportunity to present your work, and find another client.\n\nSocial engineering is really the only way to educate these people. They won't listen to you. You just want their money. Besides, any fool teenager can drop a gradient on a swooshey sphere. No, in their mind you are simply a wandering soul asking for a handout in exchange for something shiny. The tables have to be turned. They have to come to a place where they are humbled.\n\nThey have to get to a point where they ask, \"why does competitor x get so much more credence in the marketplace?\" Then someone who they trust has to say, \"your branding looks like a high school hack-job.\" then they go, \"oh.\"\n\nSo when this epiphinal moment finally occurs, you will be vindicated and in a position to demand twice the rate for your services. (It's been a long time. You've won some awards, inflation, an evil fee, whatever you want to call it.) This of course assumes they hadn't given a copy of your comps to the kid to replicate. We all know where that discussion goes. But frankly, you are better off trying to make a living off of the lotto commission than this guy.\n\nOr I'm cynical.\n\nJac  \n_\"pronounced by saying 'Jake' without conjuring imagery of lumberjacks or mans best friend.\"_\n\n"
    },
    {
      "time": "8 Apr 2007 — 5:59am",
      "content": "forget non-designers..my own batchmates(at NID)..the non-graphic dedign ones i mean...they just think typo is a waste of time. All they say is \"but why so MANY fonts?\". Considering its a design school, you'd think all the people here would be sensitive top these things. But no. Iv tried explaining to my product design friends why they need graphic design- starting from making their ugly(no really they are) presentations look decent, right upto selling the product that they do end up making(surface graphics included).  \nI think before we think abt getting the non design world sensitised, we have a lot of work to do within \"designer-dom\" itself.  \nshreyas\n\n"
    },
    {
      "time": "8 Apr 2007 — 9:25am",
      "content": "Persa,\n\nAt least the people you’re working with know how to increase the point size of Times New Roman from the default 12 to 14. Be thankful that they don’t want to decrease the size to 10 points, but still using their 0.25 inch margins, “to get it all on one sheet of paper”, or to change the font to Arial Narrow.\n\nAs a non-designer who works in the decidedly non-design world of a state-run human services institution, I have to say that the vast majority of people do terrible things with type. I can’t begin to tell you how many documents I have had to look at that are set in all caps (because it’s faster to type if one uses the caps lock key rather than holding down the shift key periodically). Then there are the documents where someone has learned to change the font formatting to all small caps, for 7 pages. And of course they all have every heading and subheading set in all caps, boldface, and underlined. Don’t even get me started about 40 page documents set in 12-point Arial with microscopic margins and single line spacing. And we need not mention the flagrant misuse of decorative typefaces for body text, such as Comic Sans and others. Then there are two spaces after every sentence, using quotation marks or all caps in place of italic, and the list goes on. My point is that most people don’t know, understand, or have a clue about type, or about how to make their computer produce a decent looking document. And they believe that those who do understand the basics of type are some sort of font fanatics.\n\nI also want to voice my agreement with the point brought up by several of the posters above that the best way to try to convince people about typography is to show them how much better good type looks, and how much better it will convey their message to their target audience. I find it interesting that I have seen so many posts on Typophile that ask for ways to phrase written or verbal arguments to convince clients that good design rules should be followed, or for articles to give to them. I would think that designers, being highly skilled in visual communication, would prefer to persuade their clients through visual examples rather than verbal arguments.\n\nFinally, as a professional who has spent countless hours working with individual clients, I have learned that not everyone is able to make use of my services. In other words, not everyone who crosses the threshold of my office is an appropriate client. I have no doubt that the same is true for graphic designers.\n\n"
    },
    {
      "time": "8 Apr 2007 — 12:08pm",
      "content": "Reading your comments was painfully hilarious to me, Ex Libris. I recognized all those typical \"Word\"-things (those double spaces, the horror!) people do to type. And it reminded me of something my boss (!!!) who had worked over 20 years as a desktop publisher did: he had once put a title in Helvetica Black Extended squished down to almost 40% (the fact that there's also a Helvetica Compressed apparantly never occured to him). Even in our workfield, there's a lot of misuse (not to mention the abuse) of type. I guess people who care about it or who are somewhat concious about how they use type have become very rare. The fact that programs like Quark actually allowed people to set things in a \"Word-like italic\" (you knòw what I mean) & allows you to just squish your type to fit almost anything without having to change its size says it all. We're a rare breed & probably a lot better off trying just to laugh it off...\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:57am",
      "content": "Thanks for all of your input. I will try the approach of showing them visually, instead of trying to convince them \"scientifically\". I do like the analogy about the insects, though :)\n\n"
    },
    {
      "time": "26 Aug 2007 — 11:29pm",
      "content": "I partly understand why you wanted to \"prove\" your statements with an article written by a regarded professional. Trying to make a point to a client using visual proof sometimes doesn't work. Not everybody is a visual person, especially non-designers, and the subtleties of explanations why a serif is better than a sans-serif sometimes doesn't make sense to a non-designer. They tend to think we're just inventing that, or it's a personal taste of ours. I guess I had some tough clients in the past...\n\nBesides, visual arts can be very subjective. People see and feel colors, layout, type in different ways and they tend to be more comfortable with what it's most familiar to them, almost always. Sometimes I just think when it comes to design, everybody wants to seems like they know something too, and they don't like to be educated. I agree with people that said try once or twice, if nothing comes out of it, move on to the next client.\n\nI truly enjoyed reading this thread. There were good points made.\n\n"
    },
    {
      "time": "29 Aug 2007 — 5:16am",
      "content": "Lately I've found that it can also help to be a little cocky sometimes & maybe even do a little bluffing. I've experienced this to be useful twice in the past few weeks. My neighbours from across the street own a restaurant here & when I went there 2 weeks ago I told them their menu really needed approvement (trust me, it was the dreaded homemade Word kind) to fit the style of the restaurant. They admitted they didn't know anything about it & gave me complete carte blanche to improve it. And then a week ago I saw the site of a bar I go to (which was probably even worse) & I just tòld the owner I was going to make him a new site... He was obviously a little shocked, but I boldly told him it looks like crap & needs to be redone. Again, he pretty much immediately agreed to let me do this after asking me what was wrong with the current site & I only summed up a few flaws. Sure enough, this approach will not work on everyone, but with familiar faces you can even convince people to give you a job (not to mention carte blanche) without even having thought about doing anything about it themselves ;-)  \nYou don't always have to wait for someone to ask you to do something, sometimes you can just TELL them you're going to do it & they'll agree. The world can be your oyster if you just know who to pick as your next client ;-p\n\n"
    },
    {
      "time": "3 Sep 2007 — 11:22pm",
      "content": "I know exactly what you mean. I just finished re-doing an ad for a nonprofit peace group I belong to.\n\nThe group had scraped together about $800 for a half-page newspaper ad in the form of a letter to our reps in Congress, signed by about 200.\n\nSomeone had volunteered to make this ad for them. I was horrified at its utter ugliness. Of course it was done in Word - text in Times Roman, headline in Arial Bold reversed on a thick bar of black. Ugh!\n\nThe long list of signers'names was in tiny italics, centered in their table rows. This text was overprinted on two photos (symbolizing war and global warming) the highlight of the piece, which were lightened to about 10% and completely unrecognizable.\n\nThe group members viewed the \"draft\" and knew it wasn't great, but couldn't quite say why (\"That's a polar bear? Where? I can't see it...\")\n\nI just redid the whole thing decently, with a dramatic design, different images (NOT overprinted), three weights of Bookman for the letter, and a legible 8 point sans for the names.\n\nThe one guy who has seen it loves it, but now is worried they need to come up with an excuse to the other guy why they didn't use his design, which he \"worked so hard on\".\n\n"
    },
    {
      "time": "4 Sep 2007 — 5:35am",
      "content": "“worked so hard on”\n\nLOL! Sure, grab some default fonts and throw them at some bad photos--must have taken him a whole hour :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Sep 2007 — 7:56am",
      "content": "Thanks for understanding dezcom, that is why I come here to vent. But as others have stated so well, non-designers really are mystified about such things.\n\nThey were puzzled when I said if someone designs in MS Word, he really doesn't know graphic design.\n\nOne said the \"long list\" of fonts on the Word menu was confusing, so she never used them. \"Why don't you like Times Roman?\" We didn't get into it, but since then I've tried to think of an analogy which would resonate with the average person.\n\nMaybe something to do with food? I notice in every bookstore and library, the largest sections are devoted to cookbooks - every nuance of food preparation. It's a topic I have very little interest in myself.\n\nThese books must number in the millions world-wide, yet daily more cookbooks are published and snapped up - some people can never get enough. Thousands of websites and chatgroups exist for foodies trading recipes. Countless yuppie stores devoted to special cooking equipment and serving dishes like salmon-shaped mousse pans and boar-bristle basting brushes, whatever.\n\nNow: Suppose everywhere you went, people served potato chips? Your honey serves potato chips for dinner and potato chips at picnics. You encounter potato chips at friends' dinner parties and luncheons. Appetizer: potato chips. Dessert: potato chips. Potlucks: potato chips, potato chips, potato chips. How long before you start ranting about potato chips?\n\n\"What's wrong with potato chips? They taste good.\"\n\n"
    },
    {
      "time": "4 Sep 2007 — 1:18pm",
      "content": "Nice analogy. I may use that.\n\n"
    },
    {
      "time": "4 Sep 2007 — 1:50pm",
      "content": "short answer: take them to see the [Helvetica film](http://web.archive.org/web/20150416142433/http:/typophile.com/wiki/Helvetica%20film).\n\n"
    },
    {
      "time": "4 Sep 2007 — 1:59pm",
      "content": "I convinced my neighbours to buy some exotic food (Kevlar from [http://www.letterbox.net.au/](http://web.archive.org/web/20150416142433/http:/www.letterbox.net.au/ \"http://www.letterbox.net.au/\"))... I'll sure be feasting on that one myself! ;-)\n\n"
    },
    {
      "time": "4 Sep 2007 — 1:59pm",
      "content": "I convinced my neighbours to buy some exotic food (Kevlar from [http://www.letterbox.net.au/](http://web.archive.org/web/20150416142433/http:/www.letterbox.net.au/ \"http://www.letterbox.net.au/\"))... I'll sure be feasting on that one myself! ;-)\n\n"
    },
    {
      "time": "4 Sep 2007 — 4:00pm",
      "content": "ill sans: just viewed Kevlar. I LOVE IT! Especially the slab. I'm tempted.\n\nClosest thing I have is Jeff Levine's Penmanshift:  \n [http://www.myfonts.com/fonts/jnlevine/penmanshift/](http://web.archive.org/web/20150416142433/http:/www.myfonts.com/fonts/jnlevine/penmanshift/ \"http://www.myfonts.com/fonts/jnlevine/penmanshift/\")\n\nand Evening News:  \n [http://www.myfonts.com/fonts/wiescherdesign/eveningnews/](http://web.archive.org/web/20150416142433/http:/www.myfonts.com/fonts/wiescherdesign/eveningnews/ \"http://www.myfonts.com/fonts/wiescherdesign/eveningnews/\")\n\nbut those don't have the strong horizontal effect at the bottom. Very distinctive.\n\nI tried to design something gorgeous in Evening News Fancy for my client/friends, a Middle Eastern Dance Arts org. But they insisted I use \"Aladdin\", just like almost every other bellydancer I know, and I know lots. They admitted it's overused, but the \"general public\" wouldn't realize that.\n\n"
    },
    {
      "time": "5 Sep 2007 — 12:44am",
      "content": "I fell in love with Kevlar at first sight as well. I can't begin to tell you how happy I am I managed to convince my neighbours... They weren't even thinking about changing the menu (or rather; the look of it) & now they're buying me Kevlar. I only took a slight suggestion as well. They were actually very pleased with one of the designs I made (in which I used Kursivschrift Stehend from Linotype, another one of my favourites), but one quick glance at Kevlar & my sales talk (hm-hm) reeled them in.\n\n"
    },
    {
      "time": "5 Sep 2007 — 6:26am",
      "content": "You must be a good salesman! Can you share some of your more successful lines with us?\n\nAlso, it's clear your neighbors trust your judgement AND are ready to make a major improvement in their image. If only all clients were like that!\n\n"
    },
    {
      "time": "6 Sep 2007 — 5:06am",
      "content": "Just win their trust first & sound as if you knòw what you're talking about. Self-confidence is the best sales pitch ;-)\n\n"
    }
  ]
}
