{
  "id": "32875",
  "title": "Logo dilemma",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I was just wondering if you guys might be able to check out this pdf and tell me if you like the left or right logo the best. It is for a package design project in my Communication Design 1 class. I created a sparkling fruit drink called “cure” and came up with 4 flavors, and have to create the actual bottle and 4-pack carton.\n\nI thought i was finished with my logo, but i started messing around with it again today, and came up with a new version (the logo on the right). I am leaning towards the new one, just because it seems a bit more universal, but i wanted a second opinion from you guys. I think if i choose the one on the right, i will have the little pear at the bottom of the bottle, maybe with a little text saying “pear” to distinguish the flavor. Oh yeah, this is just the “pear” flavor.\n\nThanks!\n\nJosh\n\nhere is the pdf (its less than 1 mb)....\n\n[http://www.yousendit.com/transfer.php?action=download&ufid=7E9AD6D2446AB...](http://web.archive.org/web/20071102154315/http:/www.yousendit.com/transfer.php?action=download&ufid=7E9AD6D2446ABFA2 \"http://www.yousendit.com/transfer.php?action=download&ufid=7E9AD6D2446ABFA2\")\n\n [‹ Street Sheet newspaper masthead/logo - student work](http://web.archive.org/web/20071102154315/http:/www.typophile.com/node/33100 \"Go to previous forum topic\") [Moth Exhibit Symbol - School Project ›](http://web.archive.org/web/20071102154315/http:/www.typophile.com/node/33042 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071102154315/http://www.typophile.com/user/15289\" title=\"View user profile.\">wolfattack</a>",
  "time": "<br>",
  "uid": "15289",
  "comments": [
    {
      "time": " 7.Apr.2007 12.48pm",
      "content": "My first impression: Your pear with bubbles resembles a bomb with a burning fuse if you don’t look close enough, so you perhaps better stick to the right version…\n\n"
    },
    {
      "time": " 7.Apr.2007 12.57pm",
      "content": "Thanks for the reply, someone else said to me it looked like a bomb with burning fuse too.\n\nWhat do you think of the right logo though? Just okay? Or do you like it. The U is suppose to resemble a glass with the bubbles coming out of it, do you see that? I am going to use the little pear, without the bubbles, at the bottom of the bottle with text saying “pear” so people will know which flavor it is.\n\nthanks.\n\n"
    },
    {
      "time": " 7.Apr.2007 1.12pm",
      "content": "I would definitly prefer the one on the RIGHT side - it’s almost obvious to me.\n\n"
    },
    {
      "time": " 7.Apr.2007 1.27pm",
      "content": "Hmm, overall I like it, but I am not sure if the very light ’cure’ wordmark and Futura light are clearly indicating a sparkling drink (could be the wordmark of some high-end hairdresser’s chemistry kit as well).  \nI did not see the glass at the first glimpse, but now that you mention it it’s clear. Have you tried altering the u shape at the bottom to form a more realistic ’drinking glass’ (instead of a test tube ;-) impression?  \nCan you post a little bit more of your bottle/label design so that we can get the overall impression?\n\n"
    },
    {
      "time": " 7.Apr.2007 2.02pm",
      "content": "This is actually the bottle i am using...\n\n[http://www.tynant.com/images/TauGlass.jpg](http://web.archive.org/web/20071102154315/http:/www.tynant.com/images/TauGlass.jpg \"http://www.tynant.com/images/TauGlass.jpg\")\n\nI am using the small one for my bottle.\n\nI altered the bottom of the U shape, and it looks a lot more like the bottom of a glass, i looks a lot better i think now. Thanks for the idea.\n\nI am trying to figure out how i want to label the pear flavor at the bottom of the glass, here are a few of the different little ideas i have for how to label the flavor. I really don’t know which one i like the best. I am a pretty indecisive person, and i need to get out of that phase, haha.\n\nThanks again for the advice.\n\nhere is another pdf...\n\n[http://www.yousendit.com/transfer.php?action=download&ufid=700E920D1EA96...](http://web.archive.org/web/20071102154315/http:/www.yousendit.com/transfer.php?action=download&ufid=700E920D1EA96D10 \"http://www.yousendit.com/transfer.php?action=download&ufid=700E920D1EA96D10\")\n\n"
    },
    {
      "time": " 7.Apr.2007 2.46pm",
      "content": "Definitly the one at the right.\n\nDo you try to inverse the color, I mean the cre in green and the u in black\n\n"
    },
    {
      "time": " 7.Apr.2007 4.51pm",
      "content": "The one on the right - with the fruit shape at the bottom of the bottle/\n\n"
    },
    {
      "time": " 7.Apr.2007 5.07pm",
      "content": "\\>The one on the right - with the fruit shape at the bottom of the bottle/\n\nThe farthest one on the right? If you don’t mean that one, how many over from the left is the one you are talking about. Thanks!\n\nStephan, what do you think, which of the bottles?\n\n"
    },
    {
      "time": " 7.Apr.2007 9.00pm",
      "content": "I think you have a few issues to fix with the look of the logo. I don’t know if the “sparkling fruit remedy” should be kerned across the entire length of the word. It just seems too open. I’d almost like to see you still explore more with the U and the “bubbles.” I think there’s a better solution out there for that. Perhaps try using the circles inside the U – containing the fizz as the bottle is not yet open when it’s on the shelf. I would also think about the placement of the pear, as I find that is the strongest solution of the naming conventions displayed. Remember, at eye level you’re reading “cure” at the top of the bottle, you want to quickly find the flavor and not search for it at the bottom. Perhaps it’s right above or below the wordmark. I hope this helps –&nbsp;best of luck.\n\n"
    },
    {
      "time": " 7.Apr.2007 9.25pm",
      "content": "Thanks for the advice John. I am having trouble using the pear within the logo and keep it as a balanced logo. It just does not feel right wherever i place it. And another thing is, like you were talking about, you want to quickly find out the flavor, but some people might not realize that it is a silhouette of a pear, but i don’t want to clutter up the bottle too much with a main type logo, then the pear, then text saying “pear”.\n\nI had tried using the fizz inside the U instead of outside, but i also ran into some problems with that. Since the U is open at the top, the bubbles made it look like the U had chicken pocks or something.\n\nOne reason i disliked the original logo with the fruit to the left, was because it wrapped too much around the bottle for me, looking straight on at it, you lose either part of the fruit or the last letter or so. Making it smaller looks awkward, so i thought maybe vertical, which makes the type look good, but the fruit on it’s side looks weird.\n\nI am getting frustrated with this, because i have worked on it for a while, and when i think i am done, i start to notice things i want to chance, but i am not sure how to change them for the better, guess that is part of design that i will learn to overcome.\n\nOh and John, do you have any suggestions for “sparkling fruit remedy”? I personally don’t think the kerning is too loose, but someone else had mentioned that to me as well.\n\n"
    },
    {
      "time": " 7.Apr.2007 9.36pm",
      "content": "here are more revisions, sorry to bombard this topic with pdf links everywhere.\n\nSame Kerning\n\n[http://www.yousendit.com/transfer.php?action=download&ufid=711976C36F742...](http://web.archive.org/web/20071102154315/http:/www.yousendit.com/transfer.php?action=download&ufid=711976C36F742E33 \"http://www.yousendit.com/transfer.php?action=download&ufid=711976C36F742E33\")\n\nLess Kerning\n\n[http://www.yousendit.com/transfer.php?action=download&ufid=754426C9050D4...](http://web.archive.org/web/20071102154315/http:/www.yousendit.com/transfer.php?action=download&ufid=754426C9050D4D34 \"http://www.yousendit.com/transfer.php?action=download&ufid=754426C9050D4D34\")\n\n"
    },
    {
      "time": " 7.Apr.2007 10.07pm",
      "content": "I understand what you’re saying about the bubbles inside the U. I just threw it out there as an option.\n\nI’m a big fan of using complimenting serif/sans type together to find a solution, so this is just a quick 5 minute rendering of your mark. Please don’t take this as anything but a quick study but you can see what I’m trying to do: less kerning, serif typeface for tagline, move the flavor closer to the product name. I also threw in a variation on the right just for kicks, but it needs lots of work.\n\n[www.feldhouse.net/cure\\_revision.pdf](http://web.archive.org/web/20071102154315/http:/www.feldhouse.net/cure_revision.pdf \"www.feldhouse.net/cure\\_revision.pdf\")\n\n"
    },
    {
      "time": " 8.Apr.2007 7.23pm",
      "content": "If it looks like a pear, and it does, you don’t need to have the word pear. Your wine sippers will not want to have their intelligence insulted.\n\nIf you want to bend the rule of “don’t label an icon” then add something useful to the text. Somewhere else, you could give the quantity, or any other bit of info.\n\n“24 oz of pure pear pleasure.”  \nOr Whatever. :)\n\n"
    },
    {
      "time": " 8.Apr.2007 7.25pm",
      "content": "Also - !\n\nDon’t get frustrated by wanting to revise something repeatedly. Enjoy it while you CAN revise it over and over. In the real world it would have been due yesterday and you’d already be working on the next project.\n\n"
    },
    {
      "time": " 8.Apr.2007 9.38pm",
      "content": "Hey guys,\n\nI am not done yet, but here was a test run for the transfer onto my bottle.\n\nI admit, i had to do some touchups in photoshop because there were a few spots that the transfer messed up. The green is also not so dark in real life, it is much much brighter, but there is a shadow over it in the picture.\n\nAfter i am totally done, i am gonna shoot some good photos for my portfolio. This was a super quick photo.\n\nBrian, well, i guess you said “In the real world it would have been due yesterday” because i had my transfers printed before i read what you said in the post before, oh well.\n\nTell me what you think.... (better photos coming at the end of the week). Also, i have not done the top of the cap yet...\n\n[http://img.photobucket.com/albums/v79/guccipingpong/cure3copy.jpg](http://web.archive.org/web/20071102154315/http:/img.photobucket.com/albums/v79/guccipingpong/cure3copy.jpg \"http://img.photobucket.com/albums/v79/guccipingpong/cure3copy.jpg\")\n\n"
    },
    {
      "time": " 9.Apr.2007 9.31am",
      "content": "Trying out all these suggestions has been a great exercise in exploration and comparison, but to be honest, I’m not convinced it has necessarily improved upon your original preferred workmark.\n\nIn your first post, your gut was telling you that the option on the right was perhaps better than your first. I think your gut was right, as many here have said. However, I’m of the opinion that flattening the bottom of the “U” was unnecessary and has failed to make it a recognizable drinking glass. The (questionable) benefit of seeking out this resemblance is outweighed by how awkward this new “U” now looks beside the other letterforms. Looking at it, I was left wondering: Wouldn’t a convincing test tube be better than an unconvincing drinking glass? Haven’t we just inadvertantly turned it into a beaker? [http://img.alibaba.com/photo/51184814/Beaker.jpg](http://web.archive.org/web/20071102154315/http:/img.alibaba.com/photo/51184814/Beaker.jpg \"http://img.alibaba.com/photo/51184814/Beaker.jpg\")\n\nIn the end, we get a sort of drinking glass/test tube hybrid. A compromise.  \nIn my mind, the test tube connotation was much bolder, more intriguing and conceptually richer. Your original preferred design achieves everything the latest version does, and is, in my opinion, the simpler and more elegant of the two.\n\nAs for identifying the flavour, I think you’re on the right track using a combination of colour and icon. Keep Brian’s suggestion in mind, use text creatively and avoid being redundant.\n\n"
    },
    {
      "time": " 9.Apr.2007 3.53pm",
      "content": "i understand what you are saying Andre. It is hard to decide between so many different opinions of advice as to what is better and what is not.\n\nThese sheets of transfer paper that i have had printed are somewhat expensive, and i could go get them reprinted, but i am just not sure.\n\nIf anyone else looks at this thread, do you think that the flattened out U looks better or worse than the original curved U?\n\nThanks. (by the way, the project is due in 2 days and i have to have 4 flavor logos transfered to the bottles by then! and it takes a while to do)\n\n"
    },
    {
      "time": " 10.Apr.2007 8.48am",
      "content": "It looks very good...Nice and clean - just as a water product should be.\n\nI like the U that you used on the transfer. And I’m glad you went with that flavor mark - trying to fit the word “tangerine” inside of a small orange circle would have been tough! ;)\n\nDon’t forget to post the final project. Do you have to create packaging to hold the bottles as well (i.e. the cardboard 6-pack boxes)?\n\n-Scott\n\n"
    },
    {
      "time": " 14.Apr.2007 4.38pm",
      "content": "Okay guys, here are images of the final product. Hope you like them...\n\n[http://img.photobucket.com/albums/v79/guccipingpong/red-1.jpg](http://web.archive.org/web/20071102154315/http:/img.photobucket.com/albums/v79/guccipingpong/red-1.jpg \"http://img.photobucket.com/albums/v79/guccipingpong/red-1.jpg\")\n\n[http://img.photobucket.com/albums/v79/guccipingpong/purple-1.jpg](http://web.archive.org/web/20071102154315/http:/img.photobucket.com/albums/v79/guccipingpong/purple-1.jpg \"http://img.photobucket.com/albums/v79/guccipingpong/purple-1.jpg\")\n\n[http://img.photobucket.com/albums/v79/guccipingpong/pink.jpg](http://web.archive.org/web/20071102154315/http:/img.photobucket.com/albums/v79/guccipingpong/pink.jpg \"http://img.photobucket.com/albums/v79/guccipingpong/pink.jpg\")\n\n[http://img.photobucket.com/albums/v79/guccipingpong/green-1.jpg](http://web.archive.org/web/20071102154315/http:/img.photobucket.com/albums/v79/guccipingpong/green-1.jpg \"http://img.photobucket.com/albums/v79/guccipingpong/green-1.jpg\")\n\n[http://img.photobucket.com/albums/v79/guccipingpong/allofem.jpg](http://web.archive.org/web/20071102154315/http:/img.photobucket.com/albums/v79/guccipingpong/allofem.jpg \"http://img.photobucket.com/albums/v79/guccipingpong/allofem.jpg\")\n\n"
    },
    {
      "time": " 16.Apr.2007 7.44am",
      "content": "They look very nice!\n\nAlthough I didn’t make the connection before, I just realized that the “beaker” reference that Andre pointed out maybe not be bad considering the Cure is a “remedy” and makes reference to science or medicine. Nice.\n\n-Scott\n\n"
    },
    {
      "time": " 17.Apr.2007 7.36am",
      "content": "Josh,\n\nNice work.\n\nIf I saw it, I’d try it.\n\n"
    }
  ]
}
