{
  "id": "32879",
  "title": "Eritrean youth organisation",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Fellow Typophiles,\n\nI was asked to design a new logotype for an organization called NUEYS. The National Union of Eritrean Youth and Students (NUEYS) is an independent organization that was established in the 1960’s. The purpose of the organization is to uplift and consolidate scattered youth initiatives into a coherent group movement. This is the first project of this type I have worked on and I found it a great experience.\n\nThe wreath is directly inspired by the golden arch found on the Eritrean flag. For the character I was inspired by the branches of the wreath that looked like legs. What do you think of the mark?  \nI have also added a branding variant of the mark which will be used for very young children in the region.\n\n ![](http://web.archive.org/web/20131016235451im_/http:/typophile.com/files/flag_5306.jpg)\n\nI am not too sure about the type. Ideally it should be in majuscule already. I have used the Delicious typeface by Jos Buivenga, its lovely and free (which is an important factor) but I am not sure it fits the design. If anyone has any alternatives I am open to any propositions.\n\n ![](http://web.archive.org/web/20131016235451im_/http:/typophile.com/files/nueys_6654.png)\n\nAny thoughts and comments?  \nThanks!\n\n",
  "author": "dache",
  "time": "8 Apr 2007 — 6:44am",
  "uid": "9823",
  "comments": [
    {
      "time": "8 Apr 2007 — 10:30am",
      "content": "I like your use of the Delicious typeface- very good!\n\nThe figure holding up the wreath needs to look a little more child like- looks more man not a boy. When I first see this design- it looks Olympic or United Nations to me.\n\nIn fact have you tried variations with boys and girls near the wreath?\n\nI like the wreath with colors in it- but that happy face is not working for me.\n\nSo if I had to choose a design now- it would be the first one with the colors of the last one.\n\nAll my best to you,\n\nMikey :-)\n\n"
    },
    {
      "time": "8 Apr 2007 — 12:34pm",
      "content": "Thanks for taking the time to comment. I attempted portraying a teenager but you are correct, it is too much like an adult. I will try making the character younger. Having more characters will be difficult as I think it could lose a lot in legibility.  \nThe smiley face version is simply the logo that will appear on products for much younger Eritrean. Its a sucursal in a way.  \nI dont think having a UN / Olympics connotation is a bad thing do you? It was never intended that said.\n\nSo thats one vote for the Delicious font :)\n\n"
    },
    {
      "time": "8 Apr 2007 — 4:39pm",
      "content": "I agree with your use of Delicious (so now it's 2 votes). It conveys a professional, yet youthful feel.\n\nAt first, I thought the same about the figure being too adult-looking, but I think if it were made any smaller, then it would be harder to see at smaller sizes.\n\nThe happy face reminds me of my Playmobil toys from when I was a kid - maybe not a bad thing considering they were my favorite toys growing up.\n\nNice job!\n\n"
    },
    {
      "time": "8 Apr 2007 — 10:04pm",
      "content": "Good choice of typeface. I'd also include the multicoloured leaves in the logo targeted to the older youth as well.\n\nIf you find the figure is looking too old, try making the head a little bigger.\n\n- Lex\n\n"
    },
    {
      "time": "9 Apr 2007 — 7:17am",
      "content": "I was thinking the same thing about making the heads bigger, but I forgot to say it. So if Lex says so, then it must be a good idea ;)\n\nI disagree, however, about making the leaves multicolor for the \"older\" logo. If I was a teenager (which I'm not that far from), I wouldn't want a logo with rainbow leaves.\n\n"
    },
    {
      "time": "9 Apr 2007 — 9:50am",
      "content": "Thank you all for the comments. My concern is the Delicious type when used the way the board desires, in majuscules, does it still look ok?  \nThis is the revision they have asked of me with the colored wreath. I added a larger head, very well thought Lex!\n\n ![](http://web.archive.org/web/20131016235451im_/http:/typophile.com/files/nuez_5963.png)\n\n"
    },
    {
      "time": "9 Apr 2007 — 10:07am",
      "content": "I take back what I said about the multicolored wreath - I really like it after seeing it executed. I think your use of Delicious here still looks good, except now it reminds me more of a heathcare company or hosiptal - the uppercase loses it's youthful feel.\n\nStill looks great!\n\n"
    },
    {
      "time": "10 Apr 2007 — 12:04am",
      "content": "Well done!!! I love it very much!\n\nYou have proved that free fonts are not all evil but are in fact essential for all!\n\nMikey :-)\n\n"
    }
  ]
}
