{
  "id": "32883",
  "title": "Contemporary sans for body text",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nI am new to the forum, and very impressed of the quality and amount of information on this site. I am hoping for your help on finding a contemporary sans serif, that has readability in long text settings and large enough family to include condensed styles.\n\nThis is for a minor redesign of a magazine on culture and society. The magazine uses a lot of illustration and it's printed with just two spot colors on an uncoated paper. The overall feel is quite airy, graphic and a bit experimental. Current fonts for body text and headlines are ITC Franklin Gothic and Arnhem Blond, with occasional SerifedSans headlines and some flourishes to spice it up. I will keep the flourishes, and the basic layout, but I will change the text fonts and redesign some of the details.\n\nThe reason why I am looking for something contemporary and new instead of, say Frutiger, is quite vain - it's just to keep it fun for me. I already have some good candidates, but I would love to hear of any new ideas. I'm sure there are still some treasures to be found.\n\nThis is what the new font set should consist of:\n\n2 headline fonts  \n- Farnham Display Swash Italic / this is decided & bought already  \n- a condensed sans serif - like Trade Gothic Bold Condensed No. 20, but Trade Gothic doesn't cut it for the body text\n\n2 body text fonts  \n- modern, light sans serif with readability (even for long finnish words) with a family that has the condensed style needed for the headline. I'm thinking maybe Fresco Sans?  \n- a serif that's something like ITC Charter - and has a 'b' similar to Charter. Arnhem is beautiful, but starting to be a bit overused here and lacks the lightness and modern feel of Charter. Any ideas for this are also welcome.\n\nBoth the sans and the serif need to have a light, modern feel, but also some warmth. For sans I would love to use Bliss, or maybe even Mundo Sans, but both lack the condensed style.\n\nI might be getting my terms wrong, or explain myself poorly, so let me know if this doesn't make any sense to you. Attached are some pictures of the magazine to give you an idea of the design. Thanks in advance for your help!\n\n| Attachment | Size |\n| --- | --- |\n| [tulva\\_cover.jpg](http://web.archive.org/web/20130224080729/http:/typophile.com/files/tulva_cover.jpg) | 134.38 KB |\n| [tulva\\_layout.jpg](http://web.archive.org/web/20130224080729/http:/typophile.com/files/tulva_layout.jpg) | 96.5 KB |\n\n",
  "author": "katju",
  "time": "8 Apr 2007 — 1:57pm",
  "uid": "17881",
  "comments": [
    {
      "time": "8 Apr 2007 — 2:07pm",
      "content": "I highly recommend [Brown Gothic](http://web.archive.org/web/20130224080729/http:/www.fontshop.com/search/?q=brown+gothic) to replace Trade Gothic. It works well in text sizes, but is even better for display as it has more character than Trade. [Bulldog](http://web.archive.org/web/20130224080729/http:/www.fontshop.com/fonts/downloads/creative_alliance/bulldog/) is also a good alternative for the same reasons. Its true italic makes it an even better candidate for text. It could be used along with Brown Gothic Condensed for headlines.\n\nI'm surprised to hear that Arnhem is overused. Things must be looking beautiful in Finland. Have you considered [OurType](http://web.archive.org/web/20130224080729/http:/www.ourtype.be/)'s newest text serif Amalia? [Download the PDF](http://web.archive.org/web/20130224080729/http:/www.ourtype.be/pdf/OT-Amalia.pdf) for a decent look.\n\n"
    },
    {
      "time": "8 Apr 2007 — 2:58pm",
      "content": "Thank you for your quick reply!  \nI quite like Bulldog for text setting and Brown Gothic for display. But without the other neither of them is quite what I need for this project. And I would like to use just one font for sans to keep the total number of fonts down to three - and to have one full family for later use.  \nAny other suggestions..?\n\n\\> I’m surprised to hear that Arnhem is overused.\n\nWell, this might be my subjective view, having worked on 4 different magazines using it. Although, it is a small market so sometimes good things just spread around on a word-to-mouth basis everywhere really quickly.\n\n\\> Things must be looking beautiful in Finland.\n\nNah, of Nordic countries, I'd say Sweden is the place to look for beautifully set magazines.\n\n"
    },
    {
      "time": "8 Apr 2007 — 3:31pm",
      "content": "Perhaps [Spiegel](http://web.archive.org/web/20130224080729/http:/www.fontshop.com/fonts/downloads/lucasfonts/spiegel/) is just right then.\n\n\\> I’d say Sweden is the place to look for beautifully set magazines.\n\nI certainly experienced that when I lived there a few years ago.\n\n"
    },
    {
      "time": "8 Apr 2007 — 3:31pm",
      "content": "Hi!\n\nNow if you like Swedish magazines you might like Swedish typefaces as well.  \nSee if you find anything tasy at MAC Rhino Fonts? let me know if you have further questions?\n\ncondesed sans serif: Stalemate\n\nText faces: Delicato, Anziano and Tarocco\n\n[http://www.macrhino.com](http://web.archive.org/web/20130224080729/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": "9 Apr 2007 — 5:58am",
      "content": "Hmm, I see now you only ask for Sans serifs... sorry about that.\n\n"
    },
    {
      "time": "9 Apr 2007 — 9:02am",
      "content": "Thanks for your recommendations. I liked both Spiegel and Stalemate as sans, but I didn't go crazy over them - and that's what I'm looking for now. Or maybe I just don't know what I want as well as I thought.\n\nI need to do some other work for now, but will study all the options, including Amalia and other serifs, and any other new ideas for sans, at a later moment.\n\n"
    },
    {
      "time": "9 Apr 2007 — 1:38pm",
      "content": "Is Spiegel too \"rigid\" (a word you used in the other thread)?\n\n"
    },
    {
      "time": "13 Apr 2007 — 2:31pm",
      "content": "Hi,\n\nOk, been thinking about it a while, and now I know what I need:\n\n- a humanist sans  \n- open forms ('c' and 's' for example)  \n- curved serifs in 'a'  \n- a beautiful italic\n\nSo yes, Franklin, Spiegel and Bulldog would be too 'rigid'. [Mundo Sans](http://web.archive.org/) fits the description perfectly (but does not have the condensed bold).\n\nBut – with these specifications I am not likely to find a font with a condensed bold and/or the kind of closed forms as in [Trade Gothic Bold Condensed no 20](http://web.archive.org/) or [Franklin Gothic Extra Condensed](http://web.archive.org/), am I?\n\nDo you think that it would be too much to mix 4 different fonts in one magazine? I have always preferred to keep the number down to 2-3 so I hesitate.\n\nIf I go for 4 different fonts, Mundo Sans is on the top of my list. Any other suggestions with these specifications?\n\n"
    },
    {
      "time": "13 Apr 2007 — 2:36pm",
      "content": "What about [Agenda](http://web.archive.org/web/20130224080729/http:/www.fontbureau.com/fonts/Agenda)?\n\n"
    },
    {
      "time": "13 Apr 2007 — 3:02pm",
      "content": "[Fresco Sans](http://web.archive.org/web/20130224080729/http:/www.fontshop.com/search/?q=fresco%20sans)\n\n"
    },
    {
      "time": "13 Apr 2007 — 3:19pm",
      "content": "Formata Light? beautiful body sans.  \n [http://www.myfonts.com/fonts/berthold/formata-be/](http://web.archive.org/web/20130224080729/http:/www.myfonts.com/fonts/berthold/formata-be/ \"http://www.myfonts.com/fonts/berthold/formata-be/\")\n\n"
    },
    {
      "time": "13 Apr 2007 — 4:37pm",
      "content": "Thanks! I took a new look at Fresco Sans, which was my original favorite, and Agenda - they got on the list. Formata is beautiful but not quite what I'm looking for.\n\ntop 3 for now:\n\n1. Agenda – in text setting, exactly what I'm looking for, but would require another sans for display  \n2. Mundo Sans – would work both text and display, if I give up on the condensed bold cut  \n3. Fresco Sans – not as warm and rounded as the other two, and not as much character in display as Mundo Sans\n\nSo I guess it'll be either Agenda or Mundo Sans. Any comments on either one? Is there still something I should see, similar to these two?\n\n"
    },
    {
      "time": "13 Apr 2007 — 4:53pm",
      "content": "If you don't need the condensed then you should go with Mundo Sans. :^)\n\nBut, I also think if you chose to go with Agenda that you could use it for display as well.\n\n"
    },
    {
      "time": "14 Apr 2007 — 12:56pm",
      "content": "I think that in the end it comes down to pairing it with the other fonts. So one last poll, which one do you think pairs better with Farnham Display Swashes and ITC Charter, which will most likely be the new serif?\n\n"
    },
    {
      "time": "16 Apr 2007 — 4:41pm",
      "content": "Definitely Fresco Sans. It's almost made for Charter. Compare them side by side. They'd even work well within one line.\n\n"
    },
    {
      "time": "19 Apr 2007 — 9:26am",
      "content": "You're right Stephen, they do go well together! And I hadn't noticed that there's a Fresco Condensed in FontShop - didn't see one in OurType pages. I had already decided to go with Mundo Sans, but you made me change my mind.\n\nThis has been a difficult choice, not least because the project is more of a hobby and has no budget, so I need to be able to use the fonts later too. But I think I have a good set now.\n\nSo thank you all, my choice is Fresco Sans + Charter + Farnham Display.\n\n"
    }
  ]
}
