{
  "id": "32892",
  "title": "Kinsey ID, please",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "anyone know what this is? sorry for the crap scan\n\n| Attachment | Size |\n| --- | --- |\n| [kinsey.jpg](http://web.archive.org/web/20150221211838/http:/typophile.com/files/kinsey.jpg) | 28.46 KB |\n\n",
  "author": "Will Miller",
  "time": "9 Apr 2007 — 8:31am",
  "uid": "4552",
  "comments": [
    {
      "time": "9 Apr 2007 — 8:52am",
      "content": "The structure reminds me of [Platelet](http://web.archive.org/web/20150221211838/http:/fontshop.com/search/?q=platelet&site=d&btnG=Go&sample_text=kinsey%20KINSEY&sample_size=36) but that is no go.\n\n"
    },
    {
      "time": "9 Apr 2007 — 10:29am",
      "content": "I'm not sure what it is either, the answer is definitely in the curved legs of the k and the chiseled ends of the s.\n\nOn a complete side note, I noticed Will that you did the Drew Kennedy logo. I hung out with Drew on a few occasions. What a small world. He used to play a few small bars around South Central PA before he left to make it big. That logo looks like the one he had before he left. You weren't from Hanover by any chance were you?\n\n"
    },
    {
      "time": "9 Apr 2007 — 10:48am",
      "content": "wow. hanover indeed. he and i went to school together and played a few gigs back in the summer of 01 i think. did that logo for him years ago. havent talked to him in ages tho. havent been back PA's way for more than a day in quite some time. small world for sure. were you from that area?\n\nw|m\n\n"
    },
    {
      "time": "9 Apr 2007 — 10:54am",
      "content": "yeah, I grew up in New Oxford, when there as well. I ran into Drew a few times, we had a mutual friend (Chris Kershaw). Also, you might remember another guy, Sam Juergens. He and I work together for a consulting firm here in Harrisburg.\n\nWhere'd you go for college? You have some really cool pieces in your portfolio, are you a screen printer as well? Have you been in Chi-town long?\n\n"
    },
    {
      "time": "9 Apr 2007 — 11:05am",
      "content": "thanks for the kind words on the work. i knew sam as well. cool guy. almost everyone i knew back there i lost touch with after i moved to chicago. i went to school in sarasota, FL. small art school called ringling school of art and design. about 1,000 students give or take. hell of an education. i moved up here in spring 02 with a couple buddies from college and did some freelance for a few years since the economy was crap. found a couple full time deisgn gigs and now i'm at a small firm called firebelly as senior designer. great place. good work for good causes too. most of my stuff lately has been in type. really trying to develop a lettering thing and get some font creation happening. slow so far but time is scarce.\n\nnew oxford. crazy. i didnt think anyone from that area would give a rat's ass about type..\n\nw|m\n\n"
    },
    {
      "time": "9 Apr 2007 — 11:25am",
      "content": "I don't think to many people give a crap about much from there either, especially type. I guess I'm an exception to the rule.\n\nSounds like things are going well for you. It's good to see a local doing well at anything art related, Hanover definitely was NOT the cultural mecca we all hoped it would be. I spent a lot of time in Baltimore when I was in HS, hoping to get some exposure to anything.\n\nFlorida sounds like a popular destination for designer from this area as well. I knew another kid from Gettysburg that went to Full Sail for 3D design. He's now doing web work in Brooklyn.\n\nI'd like to move on, Harrisburg isn't much of a mecca either. I started a thread about it (a href=\"http://typophile.com/node/32853\"\\>Design Limbo) so I won't go into much detail.\n\nI'll pass the word on to Sam you said Hi, I think he still talks to Drew so I'm sure he'll say something.\n\nNice meeting you, keep up the good work.\n\n"
    },
    {
      "time": "9 Apr 2007 — 3:36pm",
      "content": "I thought it might be [Extreme Sans](http://web.archive.org/web/20150221211838/http:/www.myfonts.com/fonts/galapagos/extreme-sans/), that rip-off of Platelet -- yup, Alex Kaczun _again_ -- but nope. I _have_ seen this one before though. :^/\n\n"
    },
    {
      "time": "9 Apr 2007 — 5:18pm",
      "content": "VSV-Melon would be another Platelet look alike. Not sure what happened to Vasava fonts.\n\n"
    },
    {
      "time": "11 Apr 2007 — 12:05am",
      "content": "[Reflex](http://web.archive.org/web/20150221211838/http:/www.sudtipos.com/fonts/44) has similarities, if you replace the lc 'y' with UC like in Sudtipos example of \"andy wharhol\".\n\n"
    },
    {
      "time": "3 Apr 2008 — 3:11am",
      "content": "Sorry for warming up this one year old thread, but it looks like VSV Melon as Angel remarked. Got a typespecimen from [this german thread](http://web.archive.org/web/20150221211838/http:/www.typografie.info/typoforum/viewtopic.php?f=3&t=5161&p=40389) today. Just wanted to share this as Vasava Fonts are quite rare these days.\n\n ![](http://web.archive.org/web/20150221211838im_/http:/typophile.com/files/VSV_Melon_6411.jpeg)\n\n"
    },
    {
      "time": "22 Jul 2009 — 7:42am",
      "content": "wow, just saw this finally got resolved! is there a place to purchase this font?\n\nw|m\n\n"
    }
  ]
}
