{
  "id": "3289",
  "title": "David's Bagels & Deli",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone,   \n   \nI'm a beginning graphic design student. My first assignment was to design/redesign a restaurant logo. I've chosen a takeout bagel joint named \"David's Bagels & Deli\" -- it's a mom-and-pop-type shop frequented by neighborhood locals. The interior is pretty nondescript and there's currently no logo. Existing signage and awning just states the name in a generic manner, like many New York City shop awnings. The place has a cozy, neighborhood feel, generated mostly by the customers and the friendly folks who work there. It's the kind of place where they'll know your name and your regular order after a couple of visits.   \n   \nHere's the logo I came up with. I would greatly appreciate any feedback I can get to improve upon this... Thanks very much in advance for your help.   \n   \nCheers,   \nNoah   \n ![david's bagels logo](http://web.archive.org/web/20131023204521im_/http:/www.typophile.com/forums/messages/29/27146.gif)\n\n",
  "author": "noahp",
  "time": "24 Feb 2004 — 9:32am",
  "uid": "3119",
  "comments": [
    {
      "time": "24 Feb 2004 — 10:18am",
      "content": "You have successfully captured the Mom'n'Pop genre. Technically, there is a lot of work to do here, but first things first\n\n"
    },
    {
      "time": "24 Feb 2004 — 10:27am",
      "content": "I think the Dom is working well (except for the fake apostrophe), but if you want \"cozy\" that slab serif is way too brutal. For something heavy but fiendly, try Adobe's Motter Corpus, or Underware's Sauna.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Feb 2004 — 10:43am",
      "content": "Peter - your setting of the word Bagel made me   \nthink of the Ben and Jerry's font. That   \nslab serif has a hand-drawn, neighborhood   \nfeel. ... if that's the aesthetic you are going for,   \nyou might try sketching out some roughs   \nas a starting point. Flourishes could add a   \nhomespun flavor.   \n   \nAnd like Scott said, a digital photo would be great.   \nI'm picturing a rectangular awning but   \nyour layout suggests more squarish.   \n   \nbj\n\n"
    },
    {
      "time": "25 Feb 2004 — 12:52pm",
      "content": "I agree with what others have said (particularly talking to the owners/ workers about the place). I think the most key thing to focus on here is not tweaking what you have (in the first post), but thinking about things that feel unique and related to what you're dealing with: hand-drawn, printing irregularities, soft variations like dough or a on well-used kitchen tool.   \n   \nYour logotype is set in a fairly common typeface (from what's available at school, right?) and a pretty standard configuration. It definitely makes it look like a typical NYC awning, but it looks that way because it looks like it was set by the printing company that did the awning. Do research online and walking around NYC. Sketch lettering that's been around for a while, or looks really unique and warm. Maybe image-search on google for 'deli' or 'bagels' and see what strikes you. Just beware of the fake mom 'n' pop look, like a big chain trying to look like it's a little shop.\n\n"
    },
    {
      "time": "26 Feb 2004 — 10:32am",
      "content": "I can't thank you folks enough for your feedback, it's been a great help. I had to present my work last night, and I've included the final results of what I wound up with presenting (#2 and #3 only. These came about after numerous discussions with my instructor). I unfortunately didn't have the time to interview the owners before turning this in, but since I have another week to turn in the final version I will definitely make time for this.   \n   \nI was able to find one of the fonts suggested here but not the others (I'm limited to what the school computers offer).   \n   \nThis is a picture of the shop itself. There is another sign in the shop that says \"David's Bagels & Deli\". Our instructor told us to only work with the complete name (that being the most complete name of the place) but in the end the \"& Deli\" was so problematic that she suggested dropping it. In the end this seemed OK to do, as really the focus of the place is bagels. People really come here for bagels and it's their bread and butter.   \n   \nSome of the crits I received for this is that the bagel needs to look more \"bagely\". Folks suggested that I continue sketching bagels and trying to find unique qualities of them that I can translate into this bagel. My instructor seemed to prefer #3 over #2.   \n ![bagel pics](http://web.archive.org/web/20131023204521im_/http:/www.typophile.com/forums/messages/29/27303.gif)\n\n"
    },
    {
      "time": "27 Feb 2004 — 5:34am",
      "content": "Peter what street is that shop on I swear I've seen it before.   \nSomething to note about Mahattan walk-in eateries. Most of the Tex-Mex shops are run by Koreans and most of the Deli's are too. My local bagel shop is all latin americans, with english being the second language. Vision about their business isn't the driving goal, these deli's and tex-mex and bagel shops are part of an organization that pools the resources and distributes the wealth. One year a water main broke on 5th avenue and the korean deli was forced to shut down for 3 months but it never had to go out of business, because it was part of the organization.\n\n"
    },
    {
      "time": "27 Feb 2004 — 9:44am",
      "content": "Hi Daniel: It's right off the corner of 19th and 1st ave.   \n   \nThanks for your post. It's quite possible that the owners might not be interested in anything I have to say, but I'll find that out soon enough.   \n   \nBut even if that turns out to be the case, I'd still like to finish this project (actually I have to finish it for this class) and I guess I'll just have to declare some assumptions about the owners' \"vision\" for the sake of completing the classwork.\n\n"
    },
    {
      "time": "27 Feb 2004 — 2:50pm",
      "content": "I knew I saw that awning before. Peter what school are you attending?\n\n"
    },
    {
      "time": "1 Mar 2004 — 10:37am",
      "content": "I'm attending the New School.\n\n"
    },
    {
      "time": "24 Feb 2004 — 10:57am",
      "content": "The weight of your DOM doesn't match that of your BAGELS. Perhaps something more like [Fat Tony](http://web.archive.org/web/20131023204521/http:/www.letterheadfonts.com/letterheadfonts/fattony.shtml) or another bolder handlettered style. I'll agree with BJ about doing some sketching too. You might end up playing with other contrasts and use type more like Fink Gothic and Fink Heavy. (Off the top of my head)   \n   \nI can see what you, Hrant, mean about the Slab being rigid against the Dom, but I think that this will have a lot more to do with the treatment of the type, methods employed by signpainters like outlines or shadows. The idea of a handpainted sign is nice, and could be an interesting exploration in the idea of a hand-lettered sign.\n\n"
    }
  ]
}
