{
  "id": "329",
  "title": "Japanese exclusive typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am glad to participate in this forum.   \nThis is the news from Japan.   \nTypeface named \"AXIS FONT\" was put on the market in Japan last month.   \nThis typeface was developed as an exclusive typeface of a Japanese design magazine \"AXIS\" in 2001.   \nIn Japan, it is very rare that the typeface of exclusive use is developed(except newspapers), and this project can be called very epoch-making thing. Because, since no less than at least 9000 characters(Adobe-Japan 1-3) are needed per one weight, Japanese is not easy to develop an exclusive typeface. Very much time and money are needed.   \n   \n7 weights of family are contained in this typeface. In many cases, development of a Japanese typeface is performed by several persons.   \nHowever, Isao Suzuki who superintends this project designed most of these typefaces alone.   \n   \nSince this design magazine \"AXIS\" is put on the market not only Japan but overseas, Japanese and English are written together. Therefore, in order to design this typeface so that Japanese and the Latin alphabet may combine beautifully from the time of development, and to fulfill the condition, Akira Kobayashi(now he is Type director : Linotype Library GmbH) designed the alphabet.   \n   \nYou can see this typefaces in the following address.   \n [http://www.typeproject.com/](http://web.archive.org/web/20131021114719/http:/www.typeproject.com/)   \n(Sorry, this site is Japanese only, but you can see the typeface GIF data in the following address .)   \nSample page   \n [http://www.typeproject.com/AXIS/sample.html](http://web.archive.org/web/20131021114719/http:/www.typeproject.com/AXIS/sample.html)   \n   \nAXIS Magazine (English page. But no information about \"AXIS\" font.)   \n [http://www.axisinc.co.jp/English\\_f/E\\_top.html](http://web.archive.org/web/20131021114719/http:/www.axisinc.co.jp/English_f/E_top.html)   \n   \nThanks.\n\n",
  "author": "Kunihiko_Okano",
  "time": "11 Jun 2003 — 4:44am",
  "uid": "1927",
  "comments": [
    {
      "time": "11 Jun 2003 — 7:31am",
      "content": "Nice to hear the news from Japan!   \n   \nMe, personally, thinks that designing a Japanese typeface   \nis not only time-demanding, it's really a harder task than   \ndesigining Latin. How to design a glyph with 36 strokes? ;-)   \n   \nThe Axis typeface is very nice. Did you work on the project   \ntoo?\n\n"
    },
    {
      "time": "11 Jun 2003 — 7:54am",
      "content": "It's great how the vertical alignments of the two scripts have been determined in a way as to take account of linguistics, and produce true harmony.   \n   \nI only worry that the Latin component looks more like a subordinate match to the Japanese - it might be too bland to be able to carry entire articles in parallel (as I understood from your explanation).   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jun 2003 — 9:04am",
      "content": "Thanks, Edulald.   \nI am very glad with interest to this information.   \nI have not participated in this project. However, I am also looking at this project with a big interest.   \nAlthough I have seen various forums recently, there is no information about a typeface of Japan anywhere. The Japanese typeface is developed and sold also in Japan every year. I think that I also want the man in the world to know such situations.   \n   \nI am a Japanese, However, it is interested in the Latin alphabet, and I am under work so that it can put on the market in the future. In my country, the alphabet is an element indispensable to a design, and I think that many Japanese Latin alphabet designers continue to be born. Like Mr. Akira Kobayashi.\n\n"
    },
    {
      "time": "11 Jun 2003 — 9:37am",
      "content": "Welcome to Typophile, shotype. A very interesting contribution your info on the Axis typeface.\n\n"
    },
    {
      "time": "11 Jun 2003 — 10:27pm",
      "content": "I have an issue of Axis that discusses the creation of the typeface. Perhaps I'll scan it is and share it with you folks!   \n   \nThe editor in chief of Axis, Katsutoshi Ishibashi, came to my school a few weeks ago and talked a bit about the typeface as well as the process of creating the magazine each month. We'll visit the magazine's offices (a pretty famous building and design shop in Tokyo) later this month. I only wish my Japanese was better.\n\n"
    },
    {
      "time": "11 Jun 2003 — 10:42pm",
      "content": "\\> Perhaps I'll scan it is and share it with you folks!   \n   \nThat would be great!   \n   \n\\> I only wish my Japanese was better.   \n   \nYeah, me too - I have trouble outside of a sushi bar.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jun 2003 — 1:27am",
      "content": "Dear, Eduardo.   \nI have made the big mistake.   \nI made a mistake in spelling of your name.   \nPlease forgive me.   \n   \n \\>How to design a glyph with 36 strokes?   \nWhat meaning is it?   \nI have not understood a meaning well.   \n36 strokes???   \n   \nBasically, Japanese typeface was designed by only em square.   \nIt is for setting a character also horizontally and vertically.   \nNot proportional.   \n   \n   \nHello, Hrant.   \nI can want to be able to speak English well now.   \nIt is shameful, I have had translation software help.   \nTherefore, I did not find the meaning of an opinion your beginning clearly. Sorry.   \nBut I am always looking forward to your opinion.   \n   \nHello, Paul.   \nSince I am poor at English, I may be unable to speak about this information well.   \nI want you to tell detailed information instead of me.\n\n"
    },
    {
      "time": "12 Jun 2003 — 1:56am",
      "content": "\\>What meaning is it?   \n\\>I have not understood a meaning well.   \n\\>36 strokes???   \n   \nI think this is \"kakesu;\" the amount of lines drawn to create a kanji character.   \n   \nI'm sure there are kanji with 36 strokes, but my dictionary doesn't have them, and I doubt the AXIS font would include them. Although there are (I could be wrong) over 20,000 kanji in existence, I don't think a publication needs more than 8,000 or so to get its point across.   \n   \nI know little (read: nothing) about the process of designing a Japanese typeface (are the radicals designed in some general way so that they may work aesthetically in several combinations?), but I doubt that designing a Japanese typeface requires designing every single Kanji, just as designing a Latin face doesn't require us to design each word but just to consider the possible combinations.   \n   \nI think I remember that the AXIS font took 4 years to design. I thought I had the article here at school, but to my frustration I can't find it. I will continue my search when I get home.   \n   \nKunihiko: Don't be ashamed of using translation software. I've studied Japanese for 6 years, and have lived in Japan for 3 and a half, but I still use Babelfish ( [http://babelfish.altavista.com/](http://web.archive.org/web/20131021114719/http:/babelfish.altavista.com/)) to help make sense of Japanese. It works both ways, often to amusing effect!\n\n"
    },
    {
      "time": "12 Jun 2003 — 2:16am",
      "content": "Silly me, I'm rereading this thread and see that Kunihiko has already told us that no less than 9,000 characters were needed. At least I wasn't far off, give or take a thousand characters.\n\n"
    },
    {
      "time": "12 Jun 2003 — 8:25am",
      "content": "Kunihiko, you're way ahead of me! I can't even _recognize_ any of your wonderful Katakana, Hiragana and Kanji characters. I only know things like \"domo arigato\" and \"spider roll\".   \n   \nWhat I meant in my first post was that:   \n1) It's great that the Japanese and Latin components do not share alignments, like the baseline or the top line: because the way the two languages compose their characters on the page is of course very different, and aligning everything would destroy the true harmony.   \n2) When a short piece of Latin text is mixed within a body of Japanese, it seems very nice. But I wonder if the Latin font has enough strength to stand on its own in composing long paragraphs.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jun 2003 — 9:31am",
      "content": "\\>I made a mistake in spelling of your name.   \n\\>Please forgive me.   \n   \nSure, not a problem. ;-) BTW, if you prefer, call me Omine (or Hiroshi, my middle name). Somehow you can consider me Japanese too, since I'm grandchild of Japanese immigrants that came here to Brazil. I have basic knowledge of Japanese language.   \n   \n   \n\\>\\>36 strokes???   \n\\>I think this is \"kakesu\"   \n   \nYes, Paul got it right. See, it's already hard to design a Latin M or W (4 strokes). There's just another level of complexity on Kanji characters. What makes hard to design a CJK typeface IMHO is not the large amount of characters to be drawn, it's the complexity of the characters.   \nBTW, I think there are some kanjis with more than 36 strokes, but I can't   \nconfirm it right now...   \n   \n   \n\\>When a short piece of Latin text is mixed within a body of Japanese, it   \n\\>seems very nice. But I wonder if the Latin font has enough strength to   \n\\>stand on its own in composing long paragraphs.   \n   \nI think it has. But I guess the Latin alphabet was actually designed to be subordinated to the Japanese.   \n   \nBTW, one of the things I can't stand these days in Japanese culture is the crescent use of English words, specially when written/printed. Sure, there are inevitable words, but there's a lot of unnecessary use of it too.\n\n"
    },
    {
      "time": "12 Jun 2003 — 9:45am",
      "content": "\\> I guess the Latin alphabet was actually designed to be subordinated to the Japanese.   \n   \nKunihiko's description seemed to imply otherwise.   \n   \n\\> one of the things I can't stand ....   \n   \nIt's all due to their dishonorable capitulation in WWII. Honor is historically huge in Japan, and one should not underestimate the profound damage done to the Japanese psyche because of it. It was of course a difficult decision, but I wonder if a poll was taken at that time, what the actual people of Japan would have decided.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jun 2003 — 11:54am",
      "content": "Sorry, I forgot about Kunihiko's original post. He's correct. Anyway, I went there again and found some few things about the Latin companion (BTW, what a confusing website they have):   \n   \nAkira Kobayashi joined the project in April 1999 (the Axis project started in 1998), and the typeface was completed in July 2000. The 3 principles for its design were:   \n1. To make it a little less elegant than Frutiger, and a little less \"cool\" than Meta.   \n2. Big x-height.   \n3. Slightly condensed (a little less than Meta).   \n   \n   \nI guess the thing is, a Japanese typeface needs to be quite neutral to handle its inherent complexity. It's probably impossible to design a Japanese Rotis, for example. ;-)   \nSo, it's natural that a Latin companion to a Japanese typeface looks neutral too. Maybe too much neutral (bland) for some people, but Axis' Latin alphabet is nice to me...\n\n"
    },
    {
      "time": "12 Jun 2003 — 11:57pm",
      "content": "Hi, Paul.   \nI am helped by your suitable support.   \n   \n\\>but I doubt that designing a Japanese typeface requires designing every single Kanji,   \n\\>just as designing a Latin face doesn't require us to design each word but just to consider   \n\\>the possible combinations.   \n   \nJapanese character can be set also horizontally and vertically. When a text is set vertically, we read from top to bottom. When a text is set horizontally, we read from left to right. (Before WWII, when a text was set horizontally, we had the time which was being read from the right to the left.)   \nFor such a feature, a Japanese typeface must be designed so that it may match, even if set in which direction.   \nMoreover, since a Chinese character is an ideographic character(For example, the character the \"east\" and \"west\" is expressed with only one character.), the proportion must be beautiful even if it is set independently.   \n   \n\\>Kunihiko: Don't be ashamed of using translation software.   \n   \nthank you, Paul.   \nI must not be mistaken in translation as much as possible.\n\n"
    },
    {
      "time": "13 Jun 2003 — 12:13am",
      "content": "Hello, Omine.   \n   \n\\>\\>\\>36 strokes???   \n\\>\\>I think this is \"kakesu\"   \n\\>Yes, Paul got it right.   \n   \n\"kakusu\"! I understand well! 36 strokes means \"36kaku\". Probably, I think that the character of 36 strokes is not contained in an axis font. It will be up to at most 30 strokes.   \n   \nA character with 30 strokes needs many devices. Since these characters must be drawn into the square of the same size as a character with few strokes, each stroke is made thin and the whole is homogenize tone. It is important point that the width of a stroke of a character with many strokes and a few character(For example, which shows \"one: Japanese pronunciation is i-chi.\" is one stroke.) looks the same black tone.\n\n"
    },
    {
      "time": "13 Jun 2003 — 12:34am",
      "content": "Thanks, Hrant.   \nI was able to understand the meaning by your second post.   \n   \n\\>But I wonder if the Latin font has enough strength to stand on its own in composing long paragraphs.   \n   \nI think that your opinion is right. In fact, it can be said that not only Latin alphabet but also a Chinese character of the AXIS FONT is a bland design compared with many of other Japanese typefaces. It is reasonable in the AXIS FONT being a quiet design.   \n   \nThe AXIS magazine has carried many photographs and illustrations. It is a very graphical magazine. In order not to break balance with a photograph, I consider a typeface as it is better to be a bland design. Therefore, it may not be omnipotent.   \nIt will be easy to make it harmonize, when carrying many photographs and illustrations. There was neither a photograph nor an illustration in the AXIS magazine, and probably, it became a tedious page if it was only the AXIS FONT.\n\n"
    },
    {
      "time": "13 Jun 2003 — 8:08am",
      "content": "That makes sense - thank you for explaining.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jun 2003 — 7:24pm",
      "content": "I'm not finding the issue in question, AXIS Sept/Oct 2001. I did find what, if memory serves me correctly, is the English version of the article here: [http://www.typeproject.com/AXIS/AXISfontTopics01E.html](http://web.archive.org/web/20131021114719/http:/www.typeproject.com/AXIS/AXISfontTopics01E.html)   \n   \nUnfortunately, it's not very enlightening. I remember the actual article having some pretty pictures AND it was followed by a nice little interview with Frutiger.   \n   \nSorry I couldn't come through. ![:-(](http://web.archive.org/web/20131021114719im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "19 Jun 2003 — 7:47am",
      "content": "It's still pretty interesting, especially culturally - thanks!   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jun 2003 — 11:04am",
      "content": "This is **great**! This is one of the most harmoneous CJK/Latin combination I have seen! Kobayashi's Latin is a beautiful type in its own right, but it was designed to make mixed Latin/Japanese setting as painless as possible. I have great respect for Japanese type designers for paying attention to every detail, and even take great care to designing a supposedly 'subordinate' set of foreign characters. Well done. The Japanese characters are beautiful too, but I really can't see how that could be different from other Gothic typefaces... I need to see it as a block of text to really get a feeling of it. Kunihiko, do you have a sample page from the magazine, in PDF format? Also, as a Chinese, I need to see more Kanji characters!   \n   \n_BTW, one of the things I can't stand these days in Japanese culture is the crescent use of English words, specially when written/printed. Sure, there are inevitable words, but there's a lot of unnecessary use of it too._   \n   \nThe same is true for Chinese, especially the Hong Kong Chinese. Chinese text dotted with large numbers of English words is a nightmare for typesetters, since the spacing and texture of the page is disturbed by the proportional spacing, sometimes completely destroyed if it gets too obsessive. That's why well-designed matching Latin character sets for CJK fonts are really important. I try to avoid using English words when I write or speak Chinese as much as possible, but it's very difficult since I live in North America. I have a better excuse than the people in Hong Kong or China though!   \n   \n_I doubt that designing a Japanese typeface requires designing every single Kanji, just as designing a Latin face doesn't require us to design each word but just to consider the possible combinations._   \n   \nWell, for Kanjis there are 8 basic strokes, or building blocks, but there are many different permutations that these stokes can appear in. Then there are radicals. Radicals can appear as single characters or combined with others to make up characters. That means they have to appear in different porportions/sizes according to the amount of space available for that radical in a particular character. Sometimes when the space is limited, the stroke widths have to be reduced so that the character doesn't look too dense. So, you can decide how you want the basic 'building blocks' to look overall, but really you have to 'design' each and every character. Not an easy task, and certainly not a task for a sigle type designer. Afterall, 9,000 characters does mean 9,000 separate glyphs that have to be designed!   \n   \nMy Chinese dictionary doesn't have any characters over 36 strokes.   \n   \n_I guess the thing is, a Japanese typeface needs to be quite neutral to handle its inherent complexity._   \n   \nNot true! There are some extremely complex and intricate designs around, like an ultra-bold rounded with overlapping strokes!   \n   \nThe following PDF shows some not so harmoneous Latin/Chinese matches from Monotype.\n\n<!--attachment: monotype_chinese3-11935.pdf*mime_pdf.gif*application/pdf*1932.5*Whacky+Latin%2fChinese+combos*monotype_chinese3%2epdf --><!--attachment: monotype_chinese3-11935.pdf*mime_pdf.gif*application/pdf*1932.5*Whacky+Latin%2fChinese+combos*monotype_chinese3%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131021114719im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Whacky Latin/Chinese combos<br><a href=\"http://web.archive.org/web/20131021114719/http:/www.typophile.com/forums/messages/30/monotype_chinese3-11935.pdf\" target=\"_blank\"><b>monotype_chinese3.pdf</b></a> (1932.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "19 Jun 2003 — 8:13pm",
      "content": "\\> BTW, one of the things I can't stand these days in Japanese culture is the crescent use of English words, specially when written/printed. Sure, there are inevitable words, but there's a lot of unnecessary use of it too.   \n   \nLiving in Japan, I see it all the time and it's easy to get annoyed by it. But, on second thought, it does appear pretty exotic to the Japanese eye and pleases many people. Considering that their audience is primarily Japanese who are looking for a little International flavor without actually experiencing anything foreign (like a sushi diner in America getting \"California Rolls\"), it is most likely working the way they want it to. Isn't that what's important?   \n   \nWhat annoys me most, which might not survive the above arguement, is the lack of care with Latin typography (or Japanese, for that matter) over here. And the lack of good Latin companions to Japanese faces.\n\n"
    },
    {
      "time": "19 Jun 2003 — 8:22pm",
      "content": "\\> I doubt that designing a Japanese typeface requires designing every single Kanji, just as designing a Latin face doesn't require us to design each word but just to consider the possible combinations.   \n   \nDefinitely an over-simplification of what I meant, but I don't think we're saying anything too different, just approaching it from different directions (and yours is the more informed direction). I just meant that designing 9,000 characters doesn't mean designing 9,000 wholly unique characters. Still, certainly not a task that I'm up to.\n\n"
    },
    {
      "time": "19 Jun 2003 — 8:26pm",
      "content": "\\> International flavor without actually experiencing anything foreign   \n   \nYeah. Viva Las Vegas. I heard that due to the current fad with \"ecotourism\", they're gonna build a new casino there called Kinshasa Kinshasa. But you'll have to sign a release form saying they're not liable for arms and legs being bitten off by the animatronic crocodiles. For the ambiance, you know.   \n   \n\\> it is most likely working the way they want it to.   \n   \nThings tend to work on their own. And they do things to you, usually without you realizing.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jun 2003 — 5:34am",
      "content": "Thanks. Paul, Keith, Hrant.   \n   \nSorry, Although I have an AXIS magazine, it cannot be carried to this board without permission. Therefore, I made the simple specimen book using the AXIS font.   \n   \n(4pages PDF data. Size:A4)   \n   \nRecommend   \nAdobe Acrobat version 5 or later. Check the Line art smoozing(anti-aliasing)button.   \n(Not include font data.)\n\n<!--attachment: AXIS_sample-11945.pdf*mime_pdf.gif*application/pdf*1034.7*the+AXIS+font%2e*AXIS_sample%2epdf --><!--attachment: AXIS_sample-11945.pdf*mime_pdf.gif*application/pdf*1034.7*the+AXIS+font%2e*AXIS_sample%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131021114719im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">the AXIS font.<br><a href=\"http://web.archive.org/web/20131021114719/http:/www.typophile.com/forums/messages/30/AXIS_sample-11945.pdf\" target=\"_blank\"><b>AXIS_sample.pdf</b></a> (1034.7 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "20 Jun 2003 — 6:25am",
      "content": "Delete\n\n"
    },
    {
      "time": "20 Jun 2003 — 6:49am",
      "content": "On this page, you can download the trial version of the AXIS FONT\n\n"
    },
    {
      "time": "20 Jun 2003 — 10:35am",
      "content": "Wow, thank you for that!   \n   \nBTW, it's interesting that in the vertical setting the \"20\" is horizontal but the \"10,000\" is not only vertical, it also looks so strange (to me)!   \n   \nhhp\n\n"
    },
    {
      "time": "21 Jun 2003 — 3:27am",
      "content": "Various ways of the setting of numerals were shown.   \nWhen we set chraracter vertically, in the case of the double-Arabic-figures as shown in \"20\", sometimes it may set horizontally.   \nIn this example text, \"10000\" is Chinese numerals. Therefore, it is set vertically.   \nGenerally, in order to show age and the date, we don't use two kinds of methods of the setting at a time.   \nAnd when we set a text vertically, we use Chinese numerals. While horizontally setting, we use Arabic numerals. However, it is not a strict rule but recommendation.\n\n"
    },
    {
      "time": "23 Jun 2003 — 8:48am",
      "content": "The Axis website have a pdf showing the full character set:   \n [http://www.typeproject.com/common/AXIS\\_chars.pdf](http://web.archive.org/web/20131021114719/http:/www.typeproject.com/common/AXIS_chars.pdf)   \n   \n   \n_\\>My Chinese dictionary doesn't have any characters over 36 strokes._   \n   \nYeah, I could only find 33 strokes in my dictionary. :-/   \n   \n_\\>Not true! There are some extremely complex and intricate designs around, (...)_   \n   \nSure. I wasn't clear enough in my previous post...   \nI was thinking about text typefaces. For example, in your (Keith) sample, almost all the typefaces are for display. Nice typefaces (I really like that 2nd, from top to bottom), but certainly not text typefaces (for setting magazines and books, for example). It becomes clearer in CJK that calligraphy and typography have different goals. ;-)   \n   \n_\\>International flavor without actually experiencing anything foreign_   \n   \nSee, that's \\*the\\* issue, like Hrant pointed out too.   \nBTW, I wrote, more than a week ago: \"crescent use of English words\". I meant \"growing use of English words\". Sorry.   \n   \n_\\>(...) the lack of good Latin companions to Japanese faces._   \n   \nI wonder why most of the Latin companions (to Japanese typefaces) have huge x-height, and very small descenders (check Keith's sample, the 7th typeface). On the other hand, the Axis' Latin companion is really very nice.\n\n"
    },
    {
      "time": "23 Jun 2003 — 11:20am",
      "content": "\\> [http://www.typeproject.com/common/AXIS\\_chars.pdf](http://web.archive.org/web/20131021114719/http:/www.typeproject.com/common/AXIS_chars.pdf)  \n   \nScary. In a good way.   \n   \nhhp\n\n"
    }
  ]
}
