{
  "id": "32908",
  "title": "Ecology book cover",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I would appreciate constructive criticism on this A5 book cover:  \n [_Red & Green: Socialism and the Environment_](http://web.archive.org/web/20131106080109/http:/www.nothingisreal.com/tmp/Red_and_Green_cover.pdf). Please bear in mind that I have no formal training in graphic design or typography, and this is the first book cover I've designed. Expect elementary mistakes and faux pas, and please help me correct them.\n\n",
  "author": "Psychonaut",
  "time": "9 Apr 2007 — 3:10pm",
  "uid": "17917",
  "comments": [
    {
      "time": "9 Apr 2007 — 10:39pm",
      "content": "I like the image a lot.\n\n[sermon]That plus the fact that you're putting the effort into getting the type looking equally nice is a poignant illustration of how anarchism (compared to socialism) will never catch on until more anarchists stop using DIYism as an excuse for aesthetic laziness.[/sermon]\n\nThe font used for the subtitle (Courier?) feels cold, mechanical, technological -- not at all like what I presume the book intends by either socialism or ecology.\n\nAlso, three typefaces seems too much here. I would simplify and use one for the title and one for everything else (including the \"Socialist Press\" bit), though in the latter case, different styles of the same face could be fine.\n\nWith that in mind, perhaps you need a type face that looks attractive as a display (for the subtitle) yet can be used for the text on the back. I've been rather interested in [Sebastian](http://web.archive.org/web/20131106080109/http:/www.stormtype.com/typefaces-fonts-shop/families-42-sebastian), which has something of an organic look.\n\n"
    },
    {
      "time": "10 Apr 2007 — 2:24am",
      "content": "The subtitle is in Computer Modern Teletype and the other text is in Andale Sans. Now that you mention it, I agree that CM is perhaps a bit too cold; I think I used it mostly because the various Sans typefaces I tried looked odd.\n\nUnfortunately, I don't think we have the budget to spend €200 or even €30 on a typeface for a single book cover. As this is a volunteer effort, we've been limiting ourselves to the fonts that come with LaTeX, the standard PostScript fonts, and free fonts. Do you think something in one of those categories would be appropriate? (Computer Modern Sans, Helvetica, Avant Garde, Bitstream Vera Sans, etc.)\n\n"
    },
    {
      "time": "10 Apr 2007 — 6:33am",
      "content": "Couple of things on the type on the back, remove double word spaces (this is a hangover from typewriters) and replace the em dash (—) with space en dash space ( – ) this use is more normal for UK publishing. You could also spend some time cleaning up the rag (the non-aligned margin), possibly by increasing the width of the column and turning over some of the shorter words, the idea is to get the righthand margin making a smooth (not necessarily straight) line. The red of the cover seems a little more organic than socialist, however given the subject why not keep it.\n\nWhat does the interior look like?\n\nThere are some quality free\\* typefaces linked here, some freebies on the net are of variable quality.  \n [http://typophile.com/wiki/FAQ\\_Free](http://web.archive.org/web/20131106080109/http:/typophile.com/wiki/FAQ_Free \"http://typophile.com/wiki/FAQ\\_Free\")\n\n\\*check the permitted uses.  \nTim\n\n"
    }
  ]
}
