{
  "id": "32918",
  "title": "Check out some Helvetica Type Specimens",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey Chaps,  \nCame across some cool old Helvetica specimens, thought I would post them for people to see...  \nThese are just the first lot, Ill be going through a box of more stuff to photograph\n\n[http://www.experimenta.co.nz/Helvetica.html](http://web.archive.org/web/20131014031042/http:/www.experimenta.co.nz/Helvetica.html \"http://www.experimenta.co.nz/Helvetica.html\")\n\nEnjoy\n\nDuncan\n\n",
  "author": "Duncan Forbes",
  "time": "9 Apr 2007 — 9:46pm",
  "uid": "12186",
  "comments": [
    {
      "time": "10 Apr 2007 — 12:55am",
      "content": "Some weeks ago it was the 50th birthday of Helvetica. A lot of very famous type designers were there and agreed that the original form of the Helvetica medium (the Haas Helvetica) was really missing because of a poor digitalization. It's kinda interesting because you can easly find some old letraset of this Haas Helvetica and I do own a lot of them. There are some little differences between the Haas and the Lynotype version like the non parallelism of the endings, a better lowercase a bowl and a lot of other detalis that makes it look better than the actual one. I wanted to digitalize it by myself but for the moment I don't have the time and the experience to do so. I hope someday the Haas Helvetica medium will come back!\n\n"
    },
    {
      "time": "10 Apr 2007 — 3:37am",
      "content": "Thanks for sharing this, Duncan. There's a lot of Helvetica bashing going on on this site & although I have to admit it's probably the most common & overused font, I'm still a big fan. It's been around for 50 years & there has to be a reason for that... After 50 years it still doesn't look one bit outdated & you just have to admire its neutral appearance. Sure, it might be a little \"misused\" in terms of an easy answer for any kind of design, but that's exactly where its beauty lies; it càn't really be misused in any design because it's so universal. Great font, great link!\n\n"
    },
    {
      "time": "10 Apr 2007 — 7:41am",
      "content": "Duncan,  \nwould you like to add some pictures of lead Helvetica, Folio and/or Walbaum?\n\nThe standard of lead what was and is used by the foundries:  \n5-6 Sn  \n28-29 Sb\n\nBut Monotype used less Antimon:  \n8,5-9,5 Sn  \n18,5-19,5 Sb  \nAnd therefore Monotype types look \"cheap\".\n\nSn (Stannum) Zinn  \nSb (Stibium) Antimon  \nPb (Plumbum) Lead\n\nSo the Walbaum of Berthold from 1922 looks much more better the Monotype one does:\n\n ![](http://web.archive.org/web/20131014031042im_/http:/typophile.com/files/walbaum_5980.jpg)\n\nAnd D. Stempel AG used more Antimon for Helvetica (and Lithographia) to make it harder and more metallic looking:\n\n ![](http://web.archive.org/web/20131014031042im_/http:/typophile.com/files/helv_3733.jpg)\n\nGeorg\n\n"
    },
    {
      "time": "11 Apr 2007 — 6:48am",
      "content": "Really interesting stuff (especially Stempel's letterhead) - cheers for posting this.\n\n"
    },
    {
      "time": "19 Jun 2011 — 12:21pm",
      "content": "This is in response to kuroneko – I too personally believe that the initial cut of Die Neue Haas Grotesk by Max Miedinger has (or had) a certain charm that the following designs simply failed to carry, for whatever reason – technical or otherwise.\n\nHere’s a compilation of the letter pair “ca” of Helveticas I’ve come across and spent some time examining. Please note that I haven’t included versions of Monotype Imaging (CG Triumvirate), ParaType (Pragmatica), Bitstream (Swiss 721) and many many more. Corrections/modifications/additions welcome!\n\nTo me, Christian Schwartz’ Haas Neue Grotesk is the hottest thing ever, which TOO is now controlled by Linotype.\n\nRG\n\n ![](http://web.archive.org/web/20131014031042im_/http:/typophile.com/files/ca_4042.JPG)\n\n"
    },
    {
      "time": "30 Nov 2011 — 7:16am",
      "content": "But something of the ‘organic’ construction of Miedinger's drawing is still not captured in these versions. An attempt:\n\n ![](http://web.archive.org/web/20131014031042im_/http:/typophile.com/files/Antique_can_6329.jpg)\n\n"
    }
  ]
}
