{
  "id": "32927",
  "title": "national typefaces",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "We are doing some research on national typefaces.  \nWe would like to know if any country's  \ngovernment has commissioned a national typeface as Canada did with \"Cartier\".  \nIs there an equivalent for other countries?\n\nIs there a typeface that immediately makes you think of a particular country/nation?\n\nDo you have tips/links for us?  \nthanks\n\n",
  "author": "<a href=\"/web/20120121081541/http://typophile.com/user/17867\" title=\"View user profile.\">moachret</a>",
  "time": "<br>",
  "uid": "17867",
  "comments": [
    {
      "time": "",
      "content": "For me it's :\n\nHelvetica \\> Switzerland  \nDidot & Garamond \\> France  \nFraktur & DIN \\> Germany  \nInterstate \\> USA\n\n"
    },
    {
      "time": "",
      "content": "Germany uses DIN for all its roadsigns, and the official typefaces for government print design are Neue Praxis and Neue Demos, both by Gerard Unger.\n\n[http://styleguide.bundesregierung.de/index\\_de.html](http://web.archive.org/web/20120121081541/http:/styleguide.bundesregierung.de/index_de.html \"http://styleguide.bundesregierung.de/index\\_de.html\")\n\n"
    },
    {
      "time": "",
      "content": "Sure.  \nPaul Renner's Futura Buchschrift.  \nThis was Germany in 1925 to 1930.\n\nGeorg\n\n ![](http://web.archive.org/web/20120121081541im_/http:/typophile.com/files/kopfgrafik_5985.gif)\n\n"
    },
    {
      "time": "",
      "content": "Sure, Futura was used all over (not just) Germany around 1930, but it wasn't commissioned as a national typeface. This makes it different from say, DIN, and maybe Cartier, Neue Demos, etc.\n\nDuring the late 17th century, King Louis XIV of France commissioned an offical royal typeface, which would turn into Romain du Roi. There is another example for you ;-)\n\n"
    },
    {
      "time": "",
      "content": "Czar Peter \"commissioned\" a whole new script for Russia :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hi Margaret  \nGreat Britain would be Gill Sans.\n\n"
    },
    {
      "time": "",
      "content": "…and Caslon!\n\n"
    },
    {
      "time": "",
      "content": "Of course Futura was not a commissioned font by the german government of 1930.\n\n\"Is there a typeface that immediately makes you think of a particular country/nation?\"\n\nThis - for me - is Futura.  \nI associate Germany of the 30ies with this font.\n\nGeorg\n\n"
    },
    {
      "time": "",
      "content": "RE: The UK  \n…and maybe Clarendon, too. And don't forget Times New Roman, then.\n\n"
    },
    {
      "time": "",
      "content": "Switzerland = Helvetica ???\n\n"
    },
    {
      "time": "",
      "content": "Well, I associate Germany of the 1930s with Futura, too, but I associate it just as much with Memphis or Koch-Fraktur or Bernhard-Fraktur, too, not to mention National, Element, Tannenberg et al!\n\n"
    },
    {
      "time": "",
      "content": "This is what I was wondering about.  \nHelvetica is a german font.  \nBut its not necessary to hurt the guys from up the hills.  \nLet them Helvetica. They anounce it everytime as a swiss font.\n\nGeorg\n\n"
    },
    {
      "time": "",
      "content": "Well, this makes it difficult for me.  \n\"Fraktur\" fonts - this is Germany before 1925.  \nAfter it its Futura. And after 1933 it was, what we call \"New Gothic\" fonts like the ones you listed.  \nBut the character of a German was and is Futura.  \nNo question for me.\n\nGeorg\n\n"
    },
    {
      "time": "",
      "content": "\\>Helvetica is a german font.\n\nWell… yes, it is!  \nBut it is really just the grown up version of Neue Haas Grotesk, which is a Swiss typeface. And the Swiss never forgot that the German Helvetica typeface has had these Swiss origins. I've always felt that the Germans have tended to overlook this by saying, \"well even Neue Haas Grotesk was based on Akzidenz-Grotesk, or something else German.\"\n\nThe Germans can think that Helvetica is German, the Swiss can think it is Swiss, and the Americans can even think it is American ;-)\n\nIt is not a typeface's birthplace that necessarially gives it its \"nationality,\" but more where and how it is used, I think. In other words, maybe Helvetica was born in Frankfurt, but does it still have a German passport? The beautiful Helvetica may have met some nice foreigner and emigrated to other shores a long time ago, for all we know.\n\n"
    },
    {
      "time": "",
      "content": "\\>But the character of a German was and is Futura.  \n\\>No question for me.\n\nUnless the character of a German is Walbaum Fraktur, Helvetica, or even FF Meta! Surely these have been used as much in Germany as Futura. I think that, with 80 million Germans, there is probably a bit of a question as to what a German is, too ;-) But I can say with certainty that I am not a German, if that helps any. What typeface I'd be personally, I really can't say.\n\n"
    },
    {
      "time": "",
      "content": "Well I live in NY - which is not exactly America - and the \"national\" font here is probably Gotham! Not commissioned as such but pretty appropriate.\n\n"
    },
    {
      "time": "",
      "content": "Wasn't their a version of Gill Greek commissioned for the Greek Olympic Games?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "This thread reminds me about the efforts on a logo for the European Union's 50th anniversary… (see [ec.europa.eu](http://web.archive.org/web/20120121081541/http:/ec.europa.eu/avservices/photo/event_reportage_en.cfm?id=1622))\n\n"
    },
    {
      "time": "",
      "content": "I think Union is government commissioned:\n\n[http://praegnanz.de/essays/391/union](http://web.archive.org/web/20120121081541/http:/praegnanz.de/essays/391/union \"http://praegnanz.de/essays/391/union\")\n\n"
    },
    {
      "time": "",
      "content": "Romain du Roi, c.1700.\n\nCartier was designed to celebrate Canada's centennial, not as branding for the government, which uses Fry's Baskerville for its wordmark.\n\n\"National typefaces\" is a frequent Typophile topic. People are always trying to tag formal qualities as being specifically national, sexual, violent, whatever. It's a meaningless minefield, IMHO, but a good opportunity to voice one's opinions, as most people have strong feelings about nationality, sex, and violence. But if you are going to go there, why not compare national typefaces with international typefaces such as Verdana and Comic Sans, or the more recent ClearType faces -- commissioned by the trans-national corporation Microsoft.\n\nFutura is a great American typeface of the 1930s, 40s and 50s.\n\n"
    },
    {
      "time": "",
      "content": "While other people are always trying to pretend they're an island...\n\nBut yes, the RdR is the ultimate \"national\" typeface. And yes, Futura  \nis not very German at all. Helvetica? That's just processed cheese.\n\nBTW, we should really distinguish between \"commissioned by a nation\",  \n\"intended for use as a national type\" and \"ending up as a national type\".\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_While other people are always trying to pretend they’re an island…_\n\n[http://www.screenonline.org.uk/film/id/441383/index.html](http://web.archive.org/web/20120121081541/http:/www.screenonline.org.uk/film/id/441383/index.html \"http://www.screenonline.org.uk/film/id/441383/index.html\")\n\nOr part of a distributed community.\n\n"
    },
    {
      "time": "",
      "content": "An archipelago at most.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Helvetica was not commissioned by the Swiss Government. However the new typeface for all roadsigns in Switzerland is a commissioned font:\n\nFrutiger ASTRA\n\n"
    },
    {
      "time": "",
      "content": "\"Helvetica was created by Miedinger with Eduard Hoffmann at the Haas’sche Schriftgießerei (Haas type foundry) of Münchenstein, Switzerland.\"\n\nPlus Switzerland is also called Helvetic Confederation (CH) ...\n\nHowever I acknowledge that it's as swiss as german, but they already have the DIN so let us the Helvetica lol\n\n"
    },
    {
      "time": "",
      "content": "I think this issue is dangerously worth discussing with a smile. If Canada has selected a style to represent the government's voice in a typographic way, good for them, good for all. If Canada.gov want to imply or market the notion that this face, this one typeface (and its Italic and bold presumably?), represent \"Canadians\" in typographic form, instead, perhaps think of that One Person's Face, (and that person's significant other presumably, and maybe their dog, home and children?), that should represent Canada. Is that possible? :-)  \nCheers.\n\n"
    },
    {
      "time": "",
      "content": "Well, Binney and Ronaldson's Old No. 2 was \"aided\" by U.S. statesmen. It is now know by the name Monticello.\n\nOf course, B&R were transplanted Scotts . . . who needed antimony . . .\n\nAnd didn't Caslon pretty much copy some Dutch fonts? That is, after he got less violent & abandoned Blackletter . . .\n\n"
    },
    {
      "time": "",
      "content": "I have to concur with Nick and add that we all have our own aesthetic/national associations but they are flimsy and almost completely without merit. Giving this kind of project as a teacher seems like a cop-out on their responsibilities. I mean what possible value can a project like this have for a student? To show them that sometimes there is no answer and it's all messy? It's no better than banal chatter as far as I can see and not the stuff of a lesson. Maybe I am being over strong in my codemnation but ... that's how it looks to me at the moment.\n\n"
    },
    {
      "time": "",
      "content": "Yeah you're right, blackletter conveys Armenia as much as it does Germany...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "An ad from _Harper's Bazaar_ in 1929, for a French perfume.  \nFor these particular American readers, Futura was leveraged for its qualities of style and modernity. Severity, as critics of the day would have termed it.\n\n ![](http://web.archive.org/web/20120121081541im_/http:/typophile.com/files/Fut1_5842.png)\n  \n\n ![](http://web.archive.org/web/20120121081541im_/http:/typophile.com/files/Fut2_6376.png)\n\n ![](http://web.archive.org/web/20120121081541im_/http:/typophile.com/files/big43_4065.jpg)\n  \nAmerican art director Helmut Krone used Futura in his VW ads in the sixties, but that was somewhat arch, and a rare occasion where Futura's Germanity was specifically referenced.\n"
    },
    {
      "time": "",
      "content": "wacky fi ligature in that sample! But love the Futura osf, and noticed that they are available now if I only had the cash.\n\n[http://www.myfonts.com/fonts/neufville/futura-nd/](http://web.archive.org/web/20120121081541/http:/www.myfonts.com/fonts/neufville/futura-nd/ \"http://www.myfonts.com/fonts/neufville/futura-nd/\")\n\n"
    },
    {
      "time": "",
      "content": "the german gevernment commissioned Gerard Ungers' \"Neue Praxis\" and \"Neue Demos\".\n\n[http://www.typografie.info/typowiki/index.php?title=Neue\\_Demos](http://web.archive.org/web/20120121081541/http:/www.typografie.info/typowiki/index.php?title=Neue_Demos \"http://www.typografie.info/typowiki/index.php?title=Neue\\_Demos\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks for your quick responses.\n\nWe started this discussion not to get the ultimate answer or to  \narchive typefaces with national labels on them.\n\nWe are aware of the how slippy this subject is (It graded us up to the hottest topic within one day ;)) as soon as you try to classify it strictly.\n\nBut many countries have a kind of national look in typedesign, no?\n\n"
    },
    {
      "time": "",
      "content": "<cite>But many countries have a kind of national look in typedesign, no?</cite>\n\nSort of. To the extent that that exists it is the result of fashion. These trends last a decade or even a century. But like a local fashion for a color or a fabric or music they go away and are replaced. And this goes on faster now than ever. And it's a more & more global world in design. So if you are looking for historical fashion trends in type ( or lettering) over time - then sure, that's good to know about. Important too. No student of type should be without that information. But looking for the 'Dutchness', or 'Englishness' or 'Germanness' in a type design is intellectually shallow and unsupportable. If you look closely you will find that it is individuals or small groups who choose a path & win support for their ideas for a while. Along with fashion; technology, economics, and company policies and wars influence the type we see too. National 'character' per se has 0% to do with it.\n\n"
    },
    {
      "time": "",
      "content": "Eben, I'm glad to see you're now moderating your position.  \nAlthough it seems you still have some ways to go.\n\n\\> To the extent that that exists it is the result of fashion.\n\nAlmost entirely, yes. Almost.  \nBut try ignoring the fashion element in type and see what happens.\n\n\\> looking for the ‘Dutchness’, or ‘Englishness’ or ‘Germanness’  \n\\> in a type design is intellectually shallow and unsupportable.\n\nOn the contrary, ignoring the national dimension in type is those things.  \nFurthermore, it is feel-good escapism.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_many countries have a kind of national look in typedesign, no?_\n\nSure, most places have a visual personality, but it's a very different proposition to say that places are a complex amalgam of their constituent parts, as opposed to the premise that places can be visually represented by iconic stereotypes.\n\nYou would also have to decide on how to measure the relative significance of typefaces.\n\n-Font sales  \n-Fonts installed  \n-Quantity of words read  \n-Online or print  \n-Environmental exposure (billboards, signage, product packaging, POP displays, junk mail, pizza menus, spam)  \n-Mentions on Typophile  \n-Appearance in award-winning ads  \n-TDC type design awards  \n-Mention in trade publications and history books\n\nOtherwise it's pure conjecture as to which typefaces are representative of which culture.\n\nFact is, without any form of statistical analysis based on a coherent strategy, this kind of research just bats around second hand ideas, a meta-discussion.\n\nIt would perhaps be fruitful to take a publishing sector, such as newspapers, and compare countries. That would be manageable, and focus demographics. But even it would be clouded by the presence of international newspaper redesigners, and you would have to wonder, are the type choices a national preference, or the designer's?\n\n"
    },
    {
      "time": "",
      "content": "\\> it’s a very different proposition\n\nNot really - it's essentially the same thing.\n\n\\> Otherwise it’s pure conjecture\n\nHuh, sort of like how we decide most things in life...  \nNot to mention how some people design type...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite> Eben, I’m glad to see you’re now moderating your position.<br>\nAlthough it seems you still have some ways to go. </cite>\n\nI am not sure I see what you mean.\n\nLet's look at an example: I suspect that you could be interested in, for instance, Armenian-ness in type. Needless to say I think that's just silly. And I hope that's not the case. You should do & think as you like of course...\n\nOn the other hand, if you are instead interested in specific things like the history of Amerinan type, the things that are unique about the way the Armerian language's glyph/letterforms work and how they got to be that way, how to make them better, how they relate to Roman forms - or don't - in other words : specific things. Then, I think that's great!\n\nThe one thing is utter mush & not even poetic. The other is mushy enough already, lacks no savouriness, and is at least worthwhile. This is the distinction I am making.\n\nI am ceratin I have some way to go still. What direction do you suggest?\n\n<cite> Otherwise it’s pure conjecture</cite>\n\nConjecture per se is better than talking about National character in type because it has some hope of revealing something. The idea of 'national charcter' on the other hand is obviously fatuous tomfoolery. At best - useless. At worst - dangerous.\n\nNick, that's a nice example of how you might begin to look at the issue of local difference ( which is real, and worth thinking about ) in a deliberate methodical manner.\n\n"
    },
    {
      "time": "",
      "content": "Eben, especially judging from the atypically colorful and meaningless adjectives you're using, I think you're exhibiting the classical post-WWII knee-jerk reaction against the -admittedly present- dangers of nationalism. But looking the other way has never worked.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I don't think what Iam getting at oblierates value of the idea that cultures exist. It just insists that people be more thoughtful & specific when they describe it. But clearly you think that's not enough. So please explain further. What is your outlook? How does it differ? Also, if you believe in the idea of 'national character': say so. I won't agree with you - but that's okay.\n\n"
    },
    {
      "time": "",
      "content": "It's pretty simple: national characters exist, no matter how faint or secondary they can be in making design decisions. Good design (or good anything) takes as many things into consideration as possible (or at least as is feasible). Practically, typographically most countries don't have a character worth considering, but many have enough that it's escapist (and bad design) to ignore that. If you completely ignore national character in type, just a few short steps away would be to ignore type design outright.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I am confused - do you mean national charcter - in terms of font designs made by citizens of that country; or do I read you correctly as saying national charcater in terms of the current (or past) preferences as consumers from a country - or the preferences as a corpus of designers from a country? Or all 3? Or something else? In each case I have named so far I think it's more accurate to think in terms of trends & fashion. To say 'national character' is to invoke something supposedly eternal. And I still think that's silly or even absurd - and therefore not useful. What is more useful is to think in terms of smaller demographics : eg the intended audience for a design.\n\n"
    },
    {
      "time": "",
      "content": "I don't understand what's so confusing. Eternal?!\n\nWhat I'm simply saying is that certain fonts can make people think of certain nations (or anything else), if only rarely and to a limited extent. And yes, these associations change all the time, and vary between people. What else is new?\n\nThis works differently in display and text fonts, and it's not like one font can only have an association with one nation, but for example if you have a choice between Font-X and Font-Y and the former has a French connection and what you're setting has a French connection, all things being equal chances are good it's better design to use Font-X. Reading anything else into anything I've written involves \"motivated\" presumptions. And thinking that society is just a bunch of 100% independent ethereal individuals is pure lala-land.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite> What I’m simply saying is that certain fonts can make people think of certain nations (or anything else), if only rarely and to a limited extent. And yes, these associations change all the time, and vary between people. What else is new? </cite>\n\nOkay I am good with that.\n\n<cite> And thinking that society is just a bunch of 100% independent ethereal individuals is pure lala-land. </cite>\n\nAnd this too.\n\n<cite>all things being equal chances are good it’s better design to use Font-X. </cite>\n\nThis made some sense but I would have maybe said instead something like : \"If you know that your audience is people of Algerian descent in their late 40's-60's who live in France and have for the last 30 years - then you would be foolish to discount the fact that they live in France & have seen & grown accustomed to that French set of media etc. Where as if you are talking about Heugenots ( ethnic french folk ) living in the US say in NY state for the last 150 years ( or whatever - sorry my history is not all it should be ) I would not worry too much about their ethnic 'Frenchness' imapcting a font choice. Because Frenchness is a cultural construct not something in the blood.\n\nI suspect we are disagreeing any longer. Am I right?\n\n"
    },
    {
      "time": "",
      "content": "So far the discussion has been about faces that have been commissioned by governments and then faces that are often thought [by some] to represent a national character.\n\nThere's a third category: types that have been created by a designer with the goal in mind of representing a culture or nation. The only one that immediately comes to mind at the end of a long work day is Gabriel Martinez Maeve's Mexica, which he has explained to me was an attempt to forge a face with a decidedly Mexican feel from the European roots of the Latin alphabet. It is a wonderful face.\n\nHis web site [http://www.kimera.com.mx] is undergoing re-construction, so you may have to go elsewhere to see it.\n\nI gotta go to a party right now, so I haven't time to root out any oter URLs so you can see it. maybe later. Good night.\n\npowers\n\n"
    },
    {
      "time": "",
      "content": "For a long time Gill Sans and Plantin were dead giveaways that a publication had originated in the UK. No more! Other forms have taken their place, those typefaces have migrated or expanded their \"territory\", and later generations have different associations with them. PowerPoint, for example.\n\nPatzcuaro, display face by F. Storm, is based very closely on lettering that represents an official style in the town of Patzcuaro, MX. The town only allows signage to be hand-painted in black and red on the walls of buildings by approved signpainters (as I understand it). Sort of a historical district thing. The result is a relatively consistent and distinctive appearance to the signage all over the town. Nice! Some of the signs would just make you sigh. But if you never saw the typeface or traveled through Patzcuaro, is it a local style (does a tree fall in the woods...)?\n\nEben, I think Hrant is saying there's more to it than simple association or fleeting trends. Flag colors and design, road layout, architecture, food, geography, agriculture, dances, music and lots of other things about cultures are (or should be) very specific to places. Especially in these times, this is of great value and should be preserved, not dismissed as arbitrary. Just because most of the US is a giant endless mall doesn't mean the rest of the world should be.\n\nWill's comment reminds me that Menhart explicitly intended some of his typefaces to represent Czech character or culture. Not sure whether ultimately this came to pass, but there's an example of an intentional production.\n\n"
    },
    {
      "time": "",
      "content": "\\> There’s a third category\n\nSee my first post in this thread.\n\nBesides Mexica there's the infamous cluster of \"authentic\" German types  \nmade during the Nazi reign. I think \"jackboot grotesk\" is the label for these.  \nAlso, L Mandel seems to have often strove to create \"authentic\" French fonts.  \nCertainly there's a style of lc \"a\" for example that occurs pretty much only  \namong French designs.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite> Eben, I think Hrant is saying there’s more to it than simple association or fleeting trends. </cite>\n\nWell put & 100% right.\n\nI think I am somehow being misinterpreted. I am not trying to deny locality and culture and history as a factors in type design. In fact quite the opposite. I am denying the role of nationality/race. All the specifics of culture and historical precedent is what I am suggesting exists instead.\n\nI am not saying for instance that there is no such thing as French type culture. I am saying that a type which distills it or part of it ( or tries to ) isn't more 'French' than another one as a result. Certainly if it does a good job it would have strong relation to the type culture of France. And really, you might have to be more specific still to really something meaningful.\n\nThis doesn't preclude having personal or even poetic associations or feelings about that type. But even those don't make a typeface 'french' or 'frenchier' than another.\n\nPut another way I think it's reasonable and even useful to say\n\n- 'This typeface feels more French to me than this one'.\n\nYou could also say:\n\n- 'I think people will find this typeface feels more French that this one'.\n\nAlso quite reasonable. Whereas saying:\n\n- 'This typeface is more French than this one'\n\n...is to my mind utter balerdash.\n\nSo: <cite> Will’s comment reminds me that Menhart explicitly intended some of his typefaces to represent Czech character or culture.</cite>\n\n'Culture': yes, by all means. 'Character': if that means something inherent in Czech folk at birth then no. Absolutely not. If that means history & culture then again: Yes.\n\nI realize that I must seem seem overwrought here, or like I am splitting hairs. But I really do think one lind of thinking is lazy, unspecific, messy & prone to nationalist racism hate etc where the other is interesting, rich & deeply useful.\n\n<cite> Some of the signs would just make you sigh. </cite>\n\nI like it when you say stuff like that.\n\n"
    },
    {
      "time": "",
      "content": "\\> I am denying the role of nationality/race.\n\nWhy? Those are groups just like any other. Groups have associations.\n\n\\> a type which distills it or part of it ( or tries to )  \n\\> isn’t more ‘French’ than another one as a result.\n\nHow can this make any sense?  \nAnyway immediately following you contradict yourself.\n\n\\> inherent in Czech folk at birth\n\nI think you're assuming something like \"Czech\" can even have a fully reliable meaning. That said, peoples are different, and generalization is a powerful and useful -if/thereby also dangerous- tool.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Of course I enjoy seeing designers out of Germany using famous german fonts like Futura. And it gives me a very warm feeling to know that there are very famous font designers from Germany.\n\nBut of course for me Futura is a typical german font. And its not typical american. The US have their own fonts with a associtation to Amrica, but not the Futura. This is my opinion.\n\nGeorg\n\n"
    }
  ]
}
