{
  "id": "3293",
  "title": "Has this article already been discussed?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "okay, so i know that Mr. Frederick Nader is rather infamous on these forums, but i was cruising all my old font links today and noticed that he had a rather interesting article up on apostropic lab's website here: [http://www.hardcovermedia.com/lab/articles/ot.htm](http://web.archive.org/web/20081204115412/http:/www.hardcovermedia.com/lab/articles/ot.htm)   \ni was wondering if there had already been some discussion along these lines (since i'm new to these forums) that anyone could point me to. I think Mr. Nader makes some interesting assertions and would love to read some further commentary on the topics addressed in this article. (oh, and if you want a laff, check out the article on how many font designers it takes to change a light bulb, hilarious!)\n\n [‹ Crillee Alternative](http://web.archive.org/web/20081204115412/http:/www.typophile.com/node/3309 \"Go to previous forum topic\") [Killing/f&#42;&#42;king Symbiotogram ›](http://web.archive.org/web/20081204115412/http:/www.typophile.com/node/3394 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081204115412/http://www.typophile.com/user/2910\" title=\"View user profile.\">pablohoney77</a>",
  "time": "<br>",
  "uid": "2910",
  "comments": [
    {
      "time": " 24.Feb.2004 4.09pm",
      "content": "What do I think of the article? I think that those readers who enjoy recreational drugs should ask him to share, since obviously he's got some pretty powerful stuff.   \n   \nMany of the assertions in this article are simply factually false, and many others are misleading at best. Plus he's got some axes to grind. The combination makes it pretty absurd. There are a couple of other folks out there who operate in a similar alternate universe, but luckily none of them are all that prominent.   \n   \nI seem to recall that there are some perfectly good points as well in there, but it's hard to distinguish them from the rubbish. I suppose I could go through it again... (shudder).   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 24.Feb.2004 4.28pm",
      "content": "LOL, I was hoping you would enlighten me, Thom, on which points were valid! The part that intrigued me, I guess, was the artist vs. the programer notion, just simply because i'm not much of either! I realize that Mr. Nader's philosophy & practices run contrary to the majority, but i was hoping for some level headed discussion about some of the issues he addresses, i realize that this article is written as a propaganda (just check out that closing line!) but can i just have some commentary on this to help sort out the facts sans the drama. (I hate drama, unless it's a good classic tragedy) So no name calling! I just want the facts and some good solid opinions. Or is that too much to ask?\n\n"
    },
    {
      "time": " 24.Feb.2004 5.49pm",
      "content": "Oh, fine, I'll dissect the article.   \n   \nFirst off, it's certainly true that with the \\*current\\* state of OpenType development tools, it takes a moderately technical mindset to develop feature-ful OpenType fonts with lots of goodies.   \n   \nThat being said, one of the beauties of OpenType is that it frees the type designer from the arbitrary character set and encoding constraints of Type 1 and TrueType (though at least TrueType had more flexibility on the language support side). Speaking as a designer, if I want to throw in just one extra ligature or a couple of alternate characters or whatever into my font, I can.   \n   \nThe new technology doesn't remove the critical role of the type designer any more than any other type technology has done. To be sure there is a new kind of technical type development role, for people who know how to make OpenType features work, but the general category of technical type development roles as distinct from type designers has existed for at least a century, perhaps more.   \n   \nOn to other stuff, from the top....   \n   \n   \nI disagree with Nader's opinion of how \"the user\" is the lowest common denominator and is responsible for the degradation of technologies and typography. If this were true, each technology would go downhill from the time of its introduction (created by engineers and designers) until being replaced by something else. In fact, each technology has generally improved steadily, being ever refined, until replaced by something else that offers some significant advantages, even though the new tech has some rough edges. Those rough edges are generally fixed over time. The first DTP was pretty bad in some ways, mostly due to resolution limitations. But it improved.   \n   \nNader claims that OpenType makes it possible to do \"things like report usage statistics to the manufacturer through online connections, keep logs of certain things, conduct machine surveys, enforce usage parameters, and all kinds of actions that some people might consider malicious, intrusive, or reckless.\"   \n   \nThis is almost entirely untrue. The only \"usage parameter\" existent in OpenType that I can think of is the fsType embedding bit, which specifies the type developers' desires as far as how the fonts can be embedded. This is present in TrueType as well, so is not new to OpenType. The rest as far as I know is pure fantasy, but to whatever extent it is true it would be true only of TrueType flavored OpenType, and only to the exact same extent it's true of TrueType.   \n   \n\"Open Type technology itself is in fact so open that it is certainly possible to place a viral element inside a font, or make the font activate or deactivate system modules or, as has already been proven, even cause a machine to restart itself no matter what tasks are running or which work has been saved.\"   \n   \nAgain, this is largely nonsense. Until recently, it was possible to make a font in any major format (Type 1, TrueType, OpenType with either kind of outlines) that would cause Windows to blue screen or reboot. These security problems have been solved. However, there was nothing \"viral\" about it, it was simply bad fonts that could cause crashes. No self-replication or infection of any sort. Also nothing particularly unique to OpenType.   \n   \nHowever, I do think that Nader is largely right that if user's expectations go way up, it will be hard on type designers who have to produce a lot more glyphs. Today's better tools will reduce the time to add more glyphs, but it's still a noticeable extra amount of work. It is not clear to me that this change will happen, as there are an awful lot of existing typefaces that do not have tons of extra goodies, and many of those don't particularly need to be extended to a bigger glyph complement.   \n   \n   \n   \nI mostly disagree about the comments about IP. These are at most extensions to existing works, not clones or knockoffs. The comparisons made here are inappropriate.   \n   \nNader's claims about Lithos are misleading at best, as Carol was personally involved in the extensions to her design. The \"figure variations\" are not oldstyle figures, but simply smaller versions of the full-size figures, to go with the small caps. Adobe does generally credit the people who do major extensions to typefaces, which is why Myriad Pro now lists Fred Brady and Christopher Slye, who did the Myriad Pro Cyrillic and Greek coverage (respectively) with Robert Slimbach as art director.   \n   \nI agree that as type tech advances there have been tradeoffs and we've had to give up things to gain other things. But what almost always happens is that some of those things that have been sacrificed are able to come back as the next generation of technology improves.   \n   \nThe speculation that the \"underground\" might somehow as a group tend to outdo the above-ground developers in typographic innovation is pretty laughable to me. After all, the average shareware font has significantly less than a full Win-ANSI or MacRoman character set. Probably a few people will do some very cool stuff, but the existence of cool technology won't change the average state of shareware. How many superhinted TrueType fonts have you seen as shareware?   \n   \nThe last section (\"what are we sacrificing?\") is pretty fantastical to my mind, and hardly worth commenting on.   \n   \nSo, those are my thoughts.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 24.Feb.2004 7.00pm",
      "content": "hey thom, thnx for humoring me. it's nice to be able to sepaprate the fact from the fantasy. i guess i shoulda picked up better on the whole \"sci-fi\" vibe of that \"article.\"   \nI for one am excitied about the capabilites of OpenType, but am on the steep end of a learning curve (as you can well atest to my ignorance in naming proceedures!) but i think with some help from you guys on the boards i might be able to figger it out someday!\n\n"
    },
    {
      "time": " 26.Feb.2004 4.56pm",
      "content": "Oh, just further on the Lithos Pro nonsense: I double-checked, and Carol did the Greek herself, and oversaw the small caps development.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 27.Feb.2004 6.04am",
      "content": "I can't get myself to think about this too much but I'll add that   \nOT development is not hard. It just takes some patience and   \nwillingness to part with the FOG dinosaur.   \n   \nI'm often miffed by this. It's the old model if you ask me.   \nOther desingers (web, interactive etc.) change all the time.   \nOften weekly.   \n   \nI knew I shouldn't have looked at the Nader thing...\n\n"
    },
    {
      "time": " 27.Feb.2004 8.38am",
      "content": "\\> Carol did the Greek herself   \n   \nDoes it look too white as well?   \n   \nhhp\n\n"
    },
    {
      "time": " 27.Feb.2004 11.01am",
      "content": "Frederick Nader seems to have buried some good point. Certainly within his passion is elements of truth.\n\n"
    },
    {
      "time": " 27.Feb.2004 11.09am",
      "content": "\\> adding idiotic symbols   \n   \nLike ornaments?   \n   \n\\> Or Greek, I know nothing of Greek. What, I am going to design them a typeface?   \n   \nCertainly, there are no Greek type designers out there. Greek doesn't need fonts anyway.   \n   \n\\> At least in English we don't use accents as a crutch.   \n   \nInstead the pronounced mismatch between the spelling and the pronunciation is a permanent crutch for many users of English. I don't like accents either, but they would certainly make English writing less idiotic.   \n   \nhhp\n\n"
    },
    {
      "time": " 27.Feb.2004 11.16am",
      "content": "Gerald, I disagree.   \n   \nOpentype has made so-called \"fine typography\" accessible for the people, and not only those that speak English. (I think the trend for making fonts for the world and not just the few that speak English is a positive trend in the world of typography.) I see nothing wrong with that.   \n   \nIt has also made some of the minutiae of typography a little easier. I also see nothing wrong with that. At the end of the day, even with opentype fonts, the designer/typographer still has to futz with the spacing, decide smallcaps or italic, choose a weight ... and on and on and on ...   \n   \nEven though the font software might be cross-platform, I doubt the licenses allow for twice the installs. Each install counts as an install. I personally don't think that is one of the greatest features. It doesn't benefit me, as I don't use PC computers. (Not that there is anything wrong with PC computers).   \n   \nAnother thing about accents ... Accents are part of the cultures of other languages, aren't they? It would be boring and sad and safe and bland to castrate those languages which depend upon accents and make them conform to a so-called preferred (more bland) looking page.   \n   \nI wish I did speak another language. (I only speak enough Italian to get myself into trouble.) If I did speak another language it would be to embrace the differences, not to find the similarities.\n\n"
    },
    {
      "time": " 27.Feb.2004 12.10pm",
      "content": "Gerald -   \n   \nI'm not with you my man.   \n   \nAccents are as important as ever, especially with the opening   \nup of Europe etc. OpenType, Fontlab and Python make this   \neasy stuff. Again, patience.   \n   \nAs for boating, I like to canoe.\n\n"
    },
    {
      "time": " 27.Feb.2004 12.21pm",
      "content": "Tiffany   \n   \n_Another thing about accents ... Accents are part of the cultures of other languages, aren't they?_   \n   \nI am extremely sensitive to accents. That is why I am not arrogant. I was teasing. Most fonts do not have well made accents. When they do, it is often for \"one language only\". You must live, read and speak the language of a country to determine what is right for the language. You must know the people, their history.   \n   \nNot to mention that some countries have their own political aspects about language, such as the Estonians. History has been unkind to languages, book burnings and keyboards forced upon them. What I was indicating is that if we try to make all things for all people why not we all have our head shaved at the same time? Why not have only one model of car, one type face? Where do you stop. Where is Barbie, where is Ken?   \n   \nOpen Type's inclusions is _defined by its exclusions._ Making culture the orphan of economy. And they ask for consent?   \n   \nI believe designers from different countries should speak more strongly at the protection of their mother tongue alphabets. And for god sakes folk, this donuts on top of the\n\n"
    },
    {
      "time": " 27.Feb.2004 12.31pm",
      "content": "Gerald, I'm glad you were teasing. It kinda took me by surprise.   \n   \nI understand your points, and I do agree with there being \"no global 'one size fits all'.\" I don't hope that all type becomes open type, but, I'm happy with the type that has become OT.   \n   \nAdmittedly, I know very little about the engine. I shop by exterior shape and color. And if it happens to come with a Turbo, I'm not going to complain.   \n   \nDoesn't it make some things easier, OT I mean, in the production for all languages?\n\n"
    },
    {
      "time": " 27.Feb.2004 12.33pm",
      "content": "\\> Open Type leads away from these considerations.   \n   \nActually, from what I understand OpenType is language-sensitive.   \nSo you can have your Polish acute steeper than the Fench acute.   \n   \nNothing is perfect, but OpenType is far less imperfect than the ASCII-7 straightjacket that's been the norm for so long.   \n   \nhhp\n\n"
    },
    {
      "time": " 27.Feb.2004 1.02pm",
      "content": "Hrant,   \n   \nDo you plan on doing it both ways? Or better would it not be that Adobe and the font vendors give open license? What is your thought. Or should type designers learn all languages, live in all countries, learn all histories.   \n   \nSounds great. Where is my suitcase? Send me the tickets. Maybe I will go learn Greek.   \n   \nBut I do hope your theory is correct.\n\n"
    },
    {
      "time": " 27.Feb.2004 1.14pm",
      "content": "\\> Or better would it not be that Adobe and the font vendors give open license?   \n   \nWhat does that mean?   \nAre you saying that third-parties should provide mechanisms for you to support various scripts without you having to know the details? I think that's expecting too much. I'm just happy they so often provide the \"raw\" information, like MS does with their Character Design Standards and such.   \n   \n\\> Or should type designers learn all languages, live in all countries, learn all histories.   \n   \nThey should know the culture they're making fonts for as best they can. This doesn't have to include being fluent in a language btw. If you have the skill and talent you can make decent -if not culturally very significant- fonts for languages just by looking at existing designs. It requires a certain mindframe, but it's entirely possible, and not even highly uncommon.   \n   \nhhp\n\n"
    },
    {
      "time": " 27.Feb.2004 10.08pm",
      "content": "_They should know the culture they're making fonts for as best they can. This doesn't have to include being fluent in a language btw. If you have the skill and talent you can make decent -if not culturally very significant- fonts for languages just by looking at existing designs. It requires a certain mindframe, but it's entirely possible, and not even highly uncommon._   \n   \n_and not even highly uncommon._ Feeling brave are we?   \n   \nThe problem with that theory is that most fonts are based on type faces historically supplied by large font vendors, such as Monotype, Linotype? Or large foreign foundries. If you were going to make a Finnish type face, you would have to work a little harder than that. They don't have one except carved in stone.   \n   \nWhat the Finnish designers have found is this. They wish to use a typface but the accents are wrong. They have approached the vendors and been told they can not open up and alter the typeface. Then they have asked if the vendor would provide the font with alterations. Answer no.   \n   \nSource is the question. Present source and past source is provided by vendors which think how you think.   \n   \nHence this sort of thing\n\n"
    },
    {
      "time": " 27.Feb.2004 10.09pm",
      "content": "\\> Open Type's inclusions is defined by its exclusions. Making culture the orphan of economy. And they ask for consent?   \n   \nWhat on earth does that mean?   \n   \n\\> ... Open Type leads away from these considerations.   \n   \nThat's simply false. The older font formats lead away from these considerations. OpenType actually has mechanisms to deal with them, unlike Type 1 or classical TrueType. (AAT/GX may also have means of dealing with these issues; I don't know.)   \n   \nT\n\n"
    },
    {
      "time": " 27.Feb.2004 10.30pm",
      "content": "Thomas,   \n   \nOne of the big problems with Open Type can best be described as this.   \n   \n_a. (ppem size is 3 50) AND (difference between the rounded linear width and the rounded instructed width_\n\n"
    },
    {
      "time": " 27.Feb.2004 11.02pm",
      "content": "Gerald:   \n   \nYes, font format specs are incomprehensible to normal humans. This is unfortunate, but does not doom the font formats. The part you are quoting is a part of the OpenType spec that is also part of the older TrueType spec. This density of programmer-speak did not stop TrueType from being successful. The Type 1 spec is only a little better, not much. Have you tried reading it?   \n   \n\\> Also I get sick of hearing how you simply insert tab \"a\" into hole \"b\" and voila!   \n   \nSometimes that's how it works, at the normal-person level of explanation. If you want to understand it at the programming level you will have to put some real time and effort into understanding the underlying technologies. Maybe start by attending some of the workshops and seminars that keep on happening at ATypI and other venues.   \n   \n\\> By the way can you send me a sample of Adobe's Finnish version of accents? That would put my mind to rest.   \n   \nWhy? The question of whether anyone will bother to do such culturally-sensitive work is quite independent from what is or is not enabled by the technology.   \n   \nThe main case like this I can point to at Adobe is that all of our Cyrillic fonts have italics where three or four characters have quite different alternate forms for Serbian than for other Cyrillic languages. The fonts use the locale feature to specify these alternates.   \n   \nI believe that Adam Twardoch has used the locale feature to create various language-specific accent forms in some fonts he's worked on. But you should ask him on that score.   \n   \nAs for optical size, there's no question that the multiple master solution was the best one going in digital typesetting. It's a shame that OpenType's 'size' feature is not nearly as versatile, and requires separate fonts. You won't get any argument from me that OpenType has the best solution in this area. I will say that it's better than nothing, and that Adobe's type group continues to care about optical size scaling.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 28.Feb.2004 12.46am",
      "content": "Adam,   \n   \nThank you.   \n   \n_Yes, font format specs are incomprehensible to normal humans._  \n   \nEspecially the artist.   \n   \n\\> By the way can you send me a sample of Adobe's Finnish version of accents? That would put my mind to rest.   \n   \n_Why? The question of whether anyone will bother to do such culturally-sensitive work is quite independent from what is or is not enabled by the technology._   \n   \n**I take that as, a no-wanna-do!**  \n   \nSo here we have this culturally sensitive engineering crusade claiming the linguistically abused can preserve their own type nuances. The same crusaders dismiss the Finnish language as trivia.   \n   \nNo monkey see, monkey do.   \n   \nAbout my quoting True Type, it is included in the format. I would have chosen something more specific, such as, Open Type Tables, however I have no way of opening Word documents. Sorry, I am such a Luddite.\n\n"
    },
    {
      "time": " 28.Feb.2004 10.02am",
      "content": "\\> So here we have this culturally sensitive engineering crusade claiming the linguistically abused can preserve their own type nuances. The same crusaders dismiss the Finnish language as trivia.   \n   \nBaloney. I never dismissed any language as trivia. Adobe has not yet done language-specific accent variants, but that does not mean it will not do so in the future.   \n   \nI wasn't giving you heck for quoting TrueType, merely making the point that _all_ font format specs are pretty impenetrable, so using the impenetrability of one of them as an argument against that format _in particular and compared to others_ is pretty much indefensible.   \n   \n\\> To forbid linguistic cultures to alter then refuse to supply them with their needs is clearly, a take it or leave it mentality. Not culturally enlightened, sorry. It is just as hideous as book burning.   \n   \nHere you're speaking of licensing issues. Adobe is one of the few foundries that has long historically allowed modifications of its fonts. However, it's true that the current EULA does not explicitly permit the kinds of modifications that you want folks to be able to do. I have made a proposal internally to change the EULA in this regard, but I don't know when or if that will occur.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 28.Feb.2004 12.25pm",
      "content": "Thomas, a question on Optical scaling. If I remember rightly, John Hudson mentioned that in principle Open Type has the capacity of coding in such as way that InDesign would automatically choose a different size-sensitive design, depending on the point size you chose. Is it correct that such a linking can be done? Has it been done or are there plans to do it?\n\n"
    },
    {
      "time": " 28.Feb.2004 1.43pm",
      "content": "\\> automatically choose a different size-sensitive design   \n   \nI've actually figured out a way for this to happen automatically with no participation from the app at all! Now I just need somebody to pay me to implement it.   \n   \n\\> I have made a proposal internally to change the EULA in this regard   \n   \nCool.   \n   \nhhp\n\n"
    },
    {
      "time": " 29.Feb.2004 10.28am",
      "content": "Thomas.   \n   \nI am not ignoring you, I appreciate your remarks. I think I have a better way to state my complaint. Maybe I am missing something. Maybe you can help me find it.   \n   \nBut it is too late in the day now, I will leave it until the morning.\n\n"
    },
    {
      "time": " 1.Mar.2004 2.22am",
      "content": "Thomas,   \n   \nGood morning from Finland.   \n   \nYou said _I never dismissed any language as trivia. Adobe has not yet done language-specific accent variants, but that does not mean it will not do so in the future._   \n   \nWell, it is a problem, that and licensing. To be honest I have not adjusted _Finnish accents._ I don't know what to do with them. There is not much you can do with two dots other than make them smaller, or bigger, or move them up down, over, closer or wider between. Those small adjustments make a big difference.   \n   \nHad the Finnish artisans completed, or where not over ridden by foreign influences their alphabet was taking a life of it very own. The second _upper case A_ was not defined by two dots, (I hate to use the right name, you understand) _but became an upright Italic lowercase a._ That was the direction their alphabet was taking. The _uppercase_ was early traditional classical _roman,_ very remarkable work by the way. _\"Pre-printing\"_ in structure. There was no lowercase. However, strangely there was a complete upright italic, _\"printing in structure\"_ Aldine in considerations.   \n   \nBut let me back up a bit. The G, was no more than a C with a very kerned \"small cap (i) \" next to it. I don't know Finnish, what I do know is they have trouble with the G's in my name.   \n   \nHow did the original model for the alphabet find its' way to Finland? I am not speaking of the transition, I am speaking of the original forms, which are intact. Some thoughts are promoted for instant consideration. Sailing, the Finns are swarthy seamen for sure. Foreign occupation. And others. What others? The Church, sleigh, skiis, skates. Not an easy exercise because remember, the _roman_ without the _lowercase,_ the _italic fully developed._ That indicates separate influences.   \n   \nThe _roman with no lowercase_ indicates very early, as does the upright Aldine Italic, but later. _(I use Aldine to describe.)_ Dutch Foundry Italics leaned towards a sloping italic, which sailed its way to influence the English, hence the very sloping Caslon italic.   \n   \nThe italic I speak of is not of Dutch influence.   \n   \n**Transitional Influence**   \n   \nWhat is the influence for the Finnish _\"transitional introductions to the alphabet?\"_ Dare I suggest, the _\"Finnish mother tongue\"._   \n   \nI was very honoured to have found the Ramsay Stones. For me it was like walking through a language, alphabet cathedral. The stones covered a period of time, illustrating within walking distance, an orderly sequence of transitional development. All dated.   \n   \nAlso if you have any thoughts these works were work of inferior hands you would be delighted to see how wrong you would be. Especially one them. The work is exemplary.   \n   \nThis is truly a transitional phase I am speaking of, independent of any I have seen elsewhere. Furthermore, it would have better suited the Finnish language.   \n   \nThis is why I seem so fanatical about languages maintaining independence   \n   \nThe French find sacred things in their spoken language, they find merit in Garamond. Quebec has language police. Jail time for abusers.   \n   \nI see nothing wrong with that.   \n   \nSo for me, I would rather go back and pick up where the Finnish artisans left off. Since only an _uppercase roman_ exists, but they were introducing _italic lowercase_ forms for variable sounds, the same approach would probably have resulted in reverse when they got around to a lowercase roman. That is my guess, or where I would have taken it.   \n   \nRather than bump dots around. But that is just me.   \n   \nIn any event, had I viewed the Ramsay Stones first, Bodoni 26 would have looked much different.   \n   \n [http://lanstontype.com/Bodoni26.html](http://web.archive.org/web/20081204115412/http:/lanstontype.com/Bodoni26.html)\n\n"
    },
    {
      "time": " 1.Mar.2004 11.42am",
      "content": "\\> \"Optical Scaling\" out trumps musical ligatures.   \n   \nBut Gerald, after all these years, why do none of your fonts have optical scaling?   \n   \nBTW, I think optical scaling is indeed more important than ligatures, but it's less important than multilingual support (which OpenType is great at). The reason is that you can always simply use _separate_ fonts for different sizes! Only other designers would really mind...   \n   \n\\> Adobe has not yet done language-specific accent variants,   \n\\> but that does not mean it will not do so in the future.   \n   \nThe problem, of course is that there has to be money in it. That's anti-cultural.   \n   \nhhp\n\n"
    },
    {
      "time": " 1.Mar.2004 11.51am",
      "content": " **Thomas**   \nAs for optical size, there's no question that the multiple master solution was the best one going in digital typesetting. It's a shame that OpenType's 'size' feature is not nearly as versatile, and requires separate fonts. You won't get any argument from me that OpenType has the best solution in this area. I will say that it's better than nothing, and that Adobe's type group continues to care about optical size scaling.\n\n"
    },
    {
      "time": " 1.Mar.2004 11.54am",
      "content": "Hrant,   \n   \n_But Gerald, after all these years, why do none of your fonts have optical scaling?_   \n   \nWe had optical scaled fonts in 1987.\n\n"
    },
    {
      "time": " 1.Mar.2004 12.03pm",
      "content": "\\> Pay these chaps off   \n   \nI'm not really very materialistic, but I'm not a philanthropist either. Some ideas are rarified enough that they need to be leveraged for my material profit. This one is nothing - you should hear about my Tamagochi killer (but you won't until I get a preliminary patent on it).   \n   \nBTW, what I'm talking about I've actually mentioned -although only in a related form- on Typophile before. But good luck finding it - you see, it's a good thing I've made so many posts! :-)   \n   \n\\> We had optical scaled fonts in 1987.   \n   \nSo can we have a link? Or are those just for naval themes?   \n   \nhhp\n\n"
    },
    {
      "time": " 1.Mar.2004 12.24pm",
      "content": "No links Hrant.   \n   \nType Three fonts.   \n   \nFor a matter of record we were not the first. ATF was. I am sure somewhere you will find archived how our optical scaled fonts crashed the entire system for Aldus Freehand's booth at Seybold.   \n   \nAs I once mention we accomplished optical scaling with hinting. Aldus made the mistake of installing the printer font. As you can see, you really didn't need the printer font. You only needed the hinting font and an alias in the extensions folder for the screenfont. I think it was the extensions.   \n   \nDo you think Type 3 will make a comeback? Does Open Type support Type Three fonts?   \n [http://lanstontype.com/StoneGrinders.html](http://web.archive.org/web/20081204115412/http:/lanstontype.com/StoneGrinders.html)\n\n"
    },
    {
      "time": " 1.Mar.2004 12.33pm",
      "content": "\\> we were not the first. ATF was.   \n   \nYes, I know about Kingsley's attempts.   \n(BTW, do you know of any former employees who might be liable to spill the beans?)   \n   \nBut if you were second or third, please do show some evidence. You know, like fonts for sale that feature optical scaling. Or even not for sale.   \n   \nhhp\n\n"
    },
    {
      "time": " 1.Mar.2004 12.52pm",
      "content": "Hrant,   \n   \n(BTW, do you know of any former employees who might be liable to spill the beans?)   \n   \nYes, but Henry probably want to make a buck or two. I would call them much more than attempts. ATF made high quality fonts. Not many of them, not my taste, but well made.   \n   \nHrant, I am in Finland, I did not even bring my books. So at the moment that is not possible. I am returning briefly to Vancouver March 21st. If you are serious I will look for a \"floppy\" with the fonts. You realize we had a tidal wave and my belonging were greatly reduced. Also I was in the hospital and was not part of the packing when I moved. So it is pot luck what is there. And if I had anything to do with the move the last thing I would have dragged along is a salt damaged floppy. So if it is there it is only because my wife did not know any better.   \n   \nSo I will look for you. Possibly one of my ex-employees has one kicking around. I will ask them as well.\n\n"
    },
    {
      "time": " 1.Mar.2004 12.58pm",
      "content": "Hrant,   \n   \nAnd one more thing. I am not going to look just to prove something to you. I will only look if you think we can do something with it.   \n   \nSo before I bother wasting my time, tell me that you might find use for it. Otherwise I will not bother.\n\n"
    },
    {
      "time": " 1.Mar.2004 1.07pm",
      "content": "\\> Henry probably want to make a buck or two.   \n   \nHenry who? What's his email? I might start by telling him that the money isn't what it used to be.   \n   \n\\> I would call them much more than attempts.   \n   \nBut from what I understand they were all single-master fonts, at least what was released.   \n   \n\\> If you are serious I will look for a \"floppy\" with the fonts.   \n   \nI'm always serious. My idea of fun isn't meant for this place and age.   \n   \nSomebody who thinks so much of optical scaling would have more than a salty floppy preserved, I hope. But please do find what you can. At the very least it would be part of a conference presentation this year. But it could very well find its way into the \"real world\" as well.   \n   \nBTW, Type3 doesn't support hinting.   \n   \nhhp\n\n"
    },
    {
      "time": " 1.Mar.2004 3.32pm",
      "content": "Type 3 also isn't supported in OpenType, nor is it supported in any common WYSIWYG form (it never worked with ATM, and Display PostScript is hardly widespread).   \n   \nIt apparently was possible to do things akin to hinting in Type 3, as long as you created the infrastructure from scratch. That is, Type 3 doesn't have any intrinsic understanding of hinting the way Type 1 does.   \n   \nIn any case, I think the chances of Type 3 making a comeback, rounded to the nearest whole number as a percentage, are zero.   \n   \n\\* \\* \\* \\*   \n   \nAs for the question of national preferences in accent structure, I think what is lacking is a single central listing of what the various national preferences are. For instance, I know that Polish favors very steep acute accents on the lowercase, because there are no grave accents in Polish. But if I were to recommend doing language-specific variant accents, I'd want to do them across the board for a bunch of languages, not just Polish.   \n   \nIf we do try to catalog this info, I suggest a different thread. Or maybe even using the ATypI mailing list, which has a stronger international readership.   \n   \n\\* \\* \\* \\*   \n   \nWilliam and Gerald: Yes, OpenType as a format already has scaled optical sizes with the ability to handle them as well as lead type. This isn't as elegant as what was possible with MMs, but is still something. All of Adobe's fonts that have optical size variants have been set up with this feature.   \n   \nHowever, almost every OpenType layout feature is dependent on support from elsewhere. In the case of optical size, no application has chosen to support the feature as yet. InDesign does support automatic use of the optical size axis in MM fonts, but does not yet make use of the OpenType layout feature for optical size.   \n   \nT\n\n"
    },
    {
      "time": " 1.Mar.2004 3.41pm",
      "content": "\\> It apparently was possible to do things akin to hinting in Type 3   \n   \nInteresting. But why would they have used T3 instead of T1? Maybe because T1 was still a closed format back then? Anyway, now we have TT with its quantum advantage in hinting power.   \n   \n\\> I know that Polish favors very steep acute accents on the lowercase, because there are no grave accents in Polish.   \n   \nI'm not sure about that \"because\". Steep accents were the norm in early French printing too, and they have both.   \n   \n\\> InDesign does support automatic use of the optical size axis in MM fonts   \n   \nReally? Wow, I had no idea.   \n   \nCan somebody remind me why making MM fonts now (I mean for a third-party) is a bad idea?   \n   \nhhp\n\n"
    },
    {
      "time": " 1.Mar.2004 3.56pm",
      "content": "Yes, this was probably before Type 1 was an open format. Or in situations where people wanted to do something odd that was not supported in regular hinting in Type 1 (like use hints for optical size scaling?).   \n   \nMaking MM fonts now, as an end-user consumable, is a bad idea because they clearly have a very limited shelf life. Adobe has stopped selling MM fonts, and we expect to make an announcement fairly soon about how long we intend to continue supporting them for in our products. Non-MM Type 1 support will doubtless continue for years after Adobe stops selling them. MMs are not going to be so lucky.   \n   \nOf course, Adobe alone wouldn't be your sole determining factor. But I wouldn't want to place any bets on MMs still being supported in future Mac and Windows operating systems 3-5 years from now.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 1.Mar.2004 4.30pm",
      "content": "\\> they clearly have a very limited shelf life.   \n   \nBut InDesign support by itself is a big deal, because people who are sensitive enough to typography are good targets for both InDesign and MM. And wasn't InDesign released _after_ MM was demoted?   \n   \nBTW, is it true that the PDF font-matching technique (like in Adobe Serif and Sans) relies on MM technology? Doesn't this mean de facto support for MM will take a while to abate?   \n   \nAnyway, to me even just 3 years is a long time.   \n   \nhhp\n\n"
    },
    {
      "time": " 1.Mar.2004 6.54pm",
      "content": "Basically the feature had already been implemented before the decision was made not to do more MM development.   \n   \nIt's true that there are several bits of technology that use MM internally, such as Acrobat's font fauxing. But that isn't the same as support for end-user MM fonts.   \n   \nMultiple master technology, or something much like it, is still a wonderful development tool, and has other uses in \"private\" ways that are internal to an application such as Acrobat. But those uses are separate from general system-level support in the OS.   \n   \nIt's up to you if you want to keep on making MM fonts. I'm not making any commitments on a minimum time for future support, just being very clear that those days are definitely numbered.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 1.Mar.2004 7.50pm",
      "content": "\\>InDesign ...does not yet make use of the OpenType layout feature for optical size.   \n   \nIs this planned for the next upgrade of InDesign?\n\n"
    },
    {
      "time": " 1.Mar.2004 9.13pm",
      "content": "Two things.   \n   \n[1] As for the question of national preferences in accent structure, I think what is lacking is a single central listing of what the various national preferences are.   \n   \nAs a hopeful type designer, I would find this immensly useful, as I intend for my typefaces to be as inclusive as possible. Anybody know anything much about this?   \n   \n[2] Can somebody remind me why making MM fonts now (I mean for a third-party) is a bad idea?   \n   \nI have only just started playing around with MM, but from what I have experienced with the format and in regards to it's future potential I think it is a bit of magic for type design. If Adobe drops it, will FontLab & Co still implement the option to design using MM technology? Generating instances is a Godsend.   \n   \nkris.\n\n"
    },
    {
      "time": " 2.Mar.2004 12.41am",
      "content": "Thomas   \n   \n_Non-MM Type 1 support will doubtless continue for years after Adobe stops selling them. MMs are not going to be so lucky._   \n   \nI just want to clarify what is meant about the support you refer to for MM fonts.   \nDoes that mean that the font will not be recognized by InDesign or Illustrator or just the feature of of optical scaling will not be recognized.   \nSince I have all the MM fonts from Adobe and use them daily without using the optical scaling feature I am a little concerned about the support. you refer to.   \n   \nThanks for your reply,   \ngln\n\n"
    },
    {
      "time": " 2.Mar.2004 1.10am",
      "content": "When I began using type, I started with MM. It's wonderful how you can work with optical scaling.   \n   \nI cannot understand why that technology has been given up. Optical scaling on OT, even the Adobe Opticals aren't nearly as fine.   \n   \nI would wish very much, to have a technology that makes it able to use fonts that have their own optical specifics over 6 or 8 sizes (or more) like in ancient lead-type, combined with the ease of working with a computer and for example InDesign, that does it automatically.   \n   \nSo a good quality of type could return.   \n   \nWith MM that was possible (a good worked font provided of course). Some (or most?) optical axes had non-linear scaling measures, and so a very fine adjusting to optical issues was possible.   \n   \nThe few \"opticals\" of OT-Fonts are far away of that skill.   \n   \nI would wish that these possibilities would come back. With MM or OT or something.   \n   \nMichael\n\n"
    },
    {
      "time": " 2.Mar.2004 4.32am",
      "content": "William and Gerald: Yes, OpenType as a format already has scaled optical sizes with the ability to handle them as well as lead type. This isn't as elegant as what was possible with MMs, but is still something. All of Adobe's fonts that have optical size variants have been set up with this feature.   \n   \nHowever, almost every OpenType layout feature is dependent on support from elsewhere. In the case of optical size, no application has chosen to support the feature as yet. InDesign does support automatic use of the optical size axis in MM fonts, but does not yet make use of the OpenType layout feature for optical size.   \n   \nSo how do we read this?\n\n"
    },
    {
      "time": " 2.Mar.2004 5.25am",
      "content": "MM as a font development tool is a big part of our work flow. I'm holding on to Illustrator 10 since the new CS does not contain any MM controls. So I hope so long as AI10 works, I'll have MMs.   \n   \nThat said, I can understand their demise. Most art directors and designers I have worked with have no idea what a MM font is. When I have brought a new design to them in MM format so they can get a better idea on the range of weight that are possible, they are, what's that English idiom, Gobsmacked.\n\n"
    },
    {
      "time": " 2.Mar.2004 7.20am",
      "content": "The subject of MM abandonment has come up on Typophile before.   \n [Here is a summary.](http://web.archive.org/web/20081204115412/http:/typographi.ca/000706.php)\n\n"
    },
    {
      "time": " 2.Mar.2004 12.25pm",
      "content": "I do recommend following the link back to the original discussion, since my full post (Oct 8 2003) also discussed the compatibility/information issue, which I think was also significant.   \n   \nGerald:   \n   \nThe optical size feature is explained clearly in Adobe's FDK documentation, and supported by the FDK (which is a no-cost download from Adobe.com). I am not 100% certain, but I don't think it is supported by FontLab at this time, so it might be a good feature request for them. Don't know about FontMaster.   \n   \nI don't know that we've bothered covering this in any of our workshops, since it is really very simple compared to a lot of aspects of OpenType, it's something that only a minority of font developers are interested in, and the details are mostly specific to our FDK tool, which few people are using since FontLab is a much more integrated environment.   \n   \nAs for support for the feature in InDesign, I am of course generally not allowed to comment on features for future versions of Adobe applications.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 2.Mar.2004 2.02pm",
      "content": "\\> only a minority of font developers are interested in   \n   \nThat will be changing this year.   \n   \nhhp\n\n"
    },
    {
      "time": " 2.Mar.2004 7.56pm",
      "content": "_InDesign ...does not yet make use of the OpenType layout feature for optical size._   \n**Is this planned for the next upgrade of InDesign?**   \n   \nHe did write _yet_, now didn't he? :-)   \n   \n_InDesign does support automatic use of the optical size axis in MM fonts_   \n**Really? Wow, I had no idea.**   \n   \nYes, another interesting point: the only app that can make use of MM fonts on Mac OS X is Adobe InDesign. I wish the people who continually accuse Adobe of \"abandoning\" MM knew this.   \n   \n**Can somebody remind me why making MM fonts now (I mean for a third-party) is a bad idea?**   \n   \nYes, absence of Unicode support. AAT variation fonts are a better way to go at this point. More on AAT soon.\n\n"
    },
    {
      "time": " 2.Mar.2004 8.30pm",
      "content": "\\> AAT variation fonts are a better way to go   \n   \nEven with no Windows support? Dunno...   \n   \nhhp\n\n"
    },
    {
      "time": " 2.Mar.2004 11.30pm",
      "content": "Hrant:   \n   \nYou think that by the end of this year, a majority of type designers will be interested in making fonts with optical size variation? You must be much more of an optimist than I am. Why the surge of interest now when there have been good technologies for it for over a decade?   \n   \nThen again, I agree with you that AAT, as a fundamentally Mac-only technology, is not very interesting. Too bad, because it would be interesting in almost every other respect. Of course, if Apple had licensed AAT to Microsoft a decade ago, things might be very different....   \n   \nT\n\n"
    },
    {
      "time": " 3.Mar.2004 4.40am",
      "content": "I'm not saying AAT has much of a chance. I'm saying it has more life left in it than Type 1 MM. You disagree?   \n   \nMake no mistake... I recommend MM designers release fonts as single-master OpenType. But if they must have axes, they might as well have Unicode too.\n\n"
    },
    {
      "time": " 3.Mar.2004 7.38am",
      "content": "OK, I got it now:   \n   \nA better way to put it is that AAT is more interesting than Type 1 MM in the same way that Ralph Nader is more interesting than Lyndon Larouche.\n\n"
    },
    {
      "time": " 3.Mar.2004 7.58am",
      "content": "One of my first jobs in NYC was working at a type shop that was owned and run by Mr Larouch's followers. Obviously one of the big accounts in the shop was for his U.S. Labor Party (I don't know what he calls his party today).   \n   \nNow that was interesting!   \n   \nThey still use a cover format I designed over 20 years for their EIR (Executive Intelligence Review) magazine. They were cheap then and must still be.\n\n"
    },
    {
      "time": " 3.Mar.2004 8.07am",
      "content": "\\> You think that by the end of this year, a majority of type designers   \n\\> will be interested in making fonts with optical size variation?   \n   \nNo, no - not a majority - just enough to build up motivation for better font creation app support in 2005. The main reason is that the 90s are over.   \n   \nBut yes, I'm a certified hopeless optimist.   \n   \nhhp\n\n"
    },
    {
      "time": " 3.Mar.2004 8.23am",
      "content": "\\>I don't know what he calls his party today   \n   \nYou may have lost track of him during his five years in jail for fraud. Larouche is running for US President as a Democrat. If you do a google, you will find that his critics are somewhat divided on whether he is a Fascist or neo-Nazi.\n\n"
    },
    {
      "time": " 3.Mar.2004 9.29am",
      "content": "I remember his followers were quite devoted. It was an opportunity to watch cult behaviour up close. There were only a few of us working there that did not belong to \"the party\".\n\n"
    },
    {
      "time": " 3.Mar.2004 10.08am",
      "content": "\\> optical size variation   \n   \nSpeak of the devil:   \n [http://typographi.ca/000794.php](http://web.archive.org/web/20081204115412/http:/typographi.ca/000794.php)   \n   \n(Or as we say in Armenian: \"Shounuh hisheh - payduh kasheh\", \"Remember the dog - pull the stick\" - no idea what the hell that's supposed to mean.)   \n   \nhhp\n\n"
    },
    {
      "time": " 4.Mar.2004 2.08am",
      "content": "Folks,   \n   \nI feel like I have abandoned this thread. But for now I am getting ready for my trip to the US.   \n   \nI will look for the software that created the Lanston optical scaled fonts, better that then obsolete font products. The engineers are more likely to have the code. If they have anything. Also, my chance of looking through what I do have will be later. I have a project.   \n   \nAlso it seems, I could be wrong, that ATF did not sell their fonts in individual sizes, but they too sold a single scalable font, which contained individual optical scaled sizes within.   \n   \nHrant, I will send you a note when I get a chance.\n\n"
    },
    {
      "time": " 4.Mar.2004 9.23am",
      "content": "BTW, in reference to earlier discussion about EULAs permitting modifications, it turns out that Adobe is explicit about allowing fonts to be modified -- it just is in the \"Licensing FAQ\" instead of in the EULA per se.   \nSee \\< [http://www.adobe.com/type/browser/legal/pdfs/fontfaq.pdf](http://web.archive.org/web/20081204115412/http:/www.adobe.com/type/browser/legal/pdfs/fontfaq.pdf)\\>\n\n"
    },
    {
      "time": " 4.Mar.2004 10.52am",
      "content": "Gerald, thanks! I'll be waiting anxiously.   \n   \nhhp\n\n"
    },
    {
      "time": " 4.Mar.2004 12.24pm",
      "content": "I suspect this is the URL that Thomas meant: [http://www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf](http://web.archive.org/web/20081204115412/http:/www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf)\n\n"
    }
  ]
}
