{
  "id": "32938",
  "title": "let's talk about : BdD - Bram de Does' Monograph",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "BdD - Bram de Does' Monograph\n\nI have started reading this over the weekend and even though I am not done with it I am already interested in hearing some opinions of the book - and failing that of the typefaces. I am holding mine back for now because of course I am still reading... But I do have some general questions/obsorvations to make\n\nAll the translated dutch texts on type I have come into contact with so far have had an informal/andecdotal style. Is this a general trend in writen dutch or is it a type culture thing? Or am I mistaken? I have invented some possible reasons for this but that's what they are inventions. Can anyone comment on this?\n\nThe book so far has been very much about the physical result of printing - the paper, the ink, the binding, the cloth - in short : the actual physical object. I think that's pretty keen. It makes me interested to hear about materials+type all the more.\n\n",
  "author": "ebensorkin",
  "time": "10 Apr 2007 — 9:49am",
  "uid": "2942",
  "comments": [
    {
      "time": "10 Apr 2007 — 4:00pm",
      "content": "On page 90 it says 'excunable' which the OED seems not to recognize. Can anybody tell from the Dutch what is meant?\n\n"
    },
    {
      "time": "10 Apr 2007 — 6:20pm",
      "content": "I did find this thread as well\n\n[http://typophile.com/node/3340](http://web.archive.org/web/20131222234028/http:/typophile.com/node/3340 \"http://typophile.com/node/3340\")\n\n"
    },
    {
      "time": "10 Apr 2007 — 11:39pm",
      "content": "'excunable' is not a Dutch word. I don't know what it means.\n\n"
    },
    {
      "time": "10 Apr 2007 — 11:41pm",
      "content": "You could post the Dutch word.\n\n"
    },
    {
      "time": "11 Apr 2007 — 3:15am",
      "content": "excusable or executable? – What is the context?\n\nOr cunabula is cradle or cunae is nest.\n\nTim\n\n"
    },
    {
      "time": "11 Apr 2007 — 4:40am",
      "content": "Isn't an excunable simply everything that's not an incunable?\n\n"
    },
    {
      "time": "11 Apr 2007 — 5:33am",
      "content": "Eben --\n\nFrom the context, I think Tim is on the right track. I believe that De Does is coining a term, somewhat tongue-in-cheek, in contrast to _incunable_ -- or, more commonly, _incunabulum_ (_incunabula_ = plural).\n\nIf \"incunabula\" refers to books from the very infancy of printing, then De Does is joking that his <cite>Typefoundries</cite> might be called an \"excunable\" -- a book from the very twilight days of printing -- utilizing, as it did, already outmoded methods of production at such a large scale.\n\nI don't read Dutch, but a little sleuthing yielded the original passage. You have to go back to p. 84:\n\n\"De <cite>Typefoundries</cite> noemt hijzelf wel schertsend een 'excunabel'. Het was namelijk al in 1976 heel bijzonder zo'n omvangrijke handelsuitgave (477 p.) met de hand te zetten.\"\n\n-- K.\n\n"
    },
    {
      "time": "11 Apr 2007 — 9:05am",
      "content": "<cite> utilizing, as it did, already outmoded methods of production at such a large scale.</cite>\n\nTim, Kent - Yes, that makes sense. Thanks very much!\n\nKent, if you don't mind; what did you get out of reading the book?\n\n"
    },
    {
      "time": "11 Apr 2007 — 1:54pm",
      "content": "\\>\\>\\> All the translated dutch texts on type I have come into contact with so far have had an informal/andecdotal style. Is this a general trend in writen dutch or is it a type culture thing? Or am I mistaken? I have invented some possible reasons for this but that’s what they are inventions. Can anyone comment on this?\n\nI asked myself the same question after having read some books and texts by Fred Smeijers and the various members of the Noordzji family. Does someone have an answer?\n\n"
    },
    {
      "time": "13 Apr 2007 — 1:00am",
      "content": "Maybe it is already clear... But here is the translation:\n\nincunabel from the dictionary:\n\nin·cu·na·bel (de ~ (m.), ~en/~s)  \n 1 boek dat voor 1501 gedrukt is =\\> paleotype, wiegendruk\n\ntranslated: A book that is printed before 1501.\n\nT.\n\n"
    },
    {
      "time": "13 Apr 2007 — 5:11am",
      "content": "De Does' use of 'excunabel' appears to mean: a book printed after 1501, but put together with the same care and amount of work of books printed before 1501. A bit tongue in cheek, but typical of his way of expressing himself.\n\nBTW In Holland the graphic arts have a long tradition of being formost in the 'elevation of the working class', being unionized very early on. Lectures and self study groups were very common amongst printers, typesetters, etc. in the early 1900's. This aura of 'intellectualism' has stuck.\n\n"
    },
    {
      "time": "13 Apr 2007 — 11:34am",
      "content": "I found several errors and corrected them today. I also changed the added to the text a bit.\n\nI have finnished the book now and have to say I am very impressed with the book & glad I have it! But I would like to describe what it contents are like a little for folks who are thinking of buying it because it's not a cheap book so it's not an easy thing to decide to buy without enough info. I couldn't find enough info about it before I bought it and wished that I could at the time. I also admit I was hoping for more type centered thinking/detail than I found in the book! Maybe some old style type-culture reticence is at work here. In any even here is my review:\n\nBdD is not in any way a how-to book, or an academic book or a book about type in any direct way. Therefore it's not a book about Trinté or Lexicon as type ( although they are important secondary subjects ) so much as it is a biography, a character study and sets the real world context for Bram's work. There are some observations made in it that will be helpful for type designers and some observations can be much better made as a result of looking the images & thinking about what's being said but again it is far from being a type design oriented or in any way a didactic book.\n\nIt's form is series of longer & shorter pieces all of which that take an informal tone that ranges from that of a magazine article to that of a letter or perhaps an email. Each of these has been suplemented nicely with images relevant to the story, ideas, or observations in question. Unfortunately & fortunately there is some repetition in topics. Unfortunately because I would have wished for more insight into Bram's choices, process, thinking etc re: type. I wanted more info about his design decisions. But fortunately too because some of the material that is there is further fleshed out and enriched because of the multiple perspectives provided.\n\nWhat I came away from the book with was a strong sense that the reason for Trinté & Lexicon's existence had everything to do with the physical and visual result on paper that Bram was seeking. So it was not a Font or Type that BdD had in mind in designing Trinté or Lexicon but a result specific to a printing process, paper, ink and even to some extent down even to the specific company & pressmen. The fonts were mearely a means an end - that end being the ability to produce a book with a complex series of definite qualities.\n\nThis profound context or use centeredness is of course not a new idea, it is actually THE old idea when it came to metal type, and It's what Erik Spiekermann has spoken about as well ( paraphrasing too loosly: type designed without a purpose in mind is a bad idea / type designed to a specific context is a good idea ). But what different here is that in BdD the context of a book, a specific kind of book, is dwelled on at length and the process and evolution of thought that led up to Bram's outlook and then the fonts Trinté & Lexicon is exposed bit by bit over the course of the text. In some ways reading BdD leaves you in the position of an odd kind of detective - one who can only read the stories left by others and who cannot ask questions of your own.\n\nTies & Bert: Thank you for the additional specificity!\n\nBTW - Have either of you read this book?\n\nIf anybody has additional comments about what I wrote or the book itself I would love to hear what you have to say.\n\n"
    },
    {
      "time": "13 Apr 2007 — 11:03pm",
      "content": "My understanding of incunabula is that it is a term used to define printed books during the period of the latter half of the 15th century, from the beginning of Western printing up to Aldus. Basically meaning, \"of the cradle.\" Neruda's famous take, \"out of the cradle, endlessly rocking.\"\n\nThe standardization that the Aldine work brought to bear essentially ended the rather dramatic transformation and evolution of type during this period. Nothing quite like that has ever occurred again. Incunbular ends with Manutius.\n\nGerald\n\n"
    },
    {
      "time": "13 Apr 2007 — 11:46pm",
      "content": ":—)\n\nWell, yes, originally Whitman but Neruda, a great admirer of the bard, appropriated it for either Ode to the book or Ode to typography—at least that is my understanding. I don't have ready access to the text of either of these.\n\n"
    },
    {
      "time": "14 Apr 2007 — 8:46am",
      "content": "Thanks! That makes sense.\n\n"
    }
  ]
}
