{
  "id": "32933",
  "title": "What does 100% mean?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I have a relatively new iMac and I’m noticing on this screen that viewing a document in either Quark or InDesign at 100% is quite misleading. In fact I pulled out a ruler and figured out that viewing a doc at 137% gives me accurate size. Of course I print things out to really check my font size etc but I’m wondering when the software companies will get with the program (so to speak) and recalibrate. I still have an old CRT monitor where the files now look HUGE but are in fact more accurately sized at 100%.\n\nThis also hearkens to the earlier (endless) conversation about dpi’s relevance to the web. Conclusion of course that the term “dpi” is irrelevant, it’s pixels we’re dealing with, but I remember the conversation turning to whether to work in 96 vs 72 dpi. 96 is 133% larger than 72 - which is pretty close to my Quark mark-up. Given this it seems that for wysiwyg we should be working in 96 dpi as a default when preparing p-shop files for the web.\n\n [‹ indesign.line indent?](http://web.archive.org/web/20070911195302/http:/typophile.com/node/33242 \"Go to previous forum topic\") [FLS5 - Generate Glyphs syntax snafu ›](http://web.archive.org/web/20070911195302/http:/typophile.com/node/32974 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911195302/http://typophile.com/user/3275\" title=\"View user profile.\">pattyfab</a>",
  "time": "<br>",
  "uid": "3275",
  "comments": [
    {
      "time": " 10.Apr.2007 9.21am",
      "content": "“I’m wondering when the software companies will get with the program (so to speak) and recalibrate.”\n\nIt’s not a software issue in the sense that the design application can do much about it. It’s an operating system issue. The operating system has no idea how physically big your monitor is, so really has no way of knowing what ’true size’ really is. It has to assume x pixels = x inches even though even monitor is different.\n\nThat said, it would be nice to maybe have some sort of calibration option within the DTP application. Of course, if someone goes and changes your screen resolution, that get screwed up again. ;0)\n\n“Given this it seems that for wysiwyg we should be working in 96 dpi as a default when preparing p-shop files for the web.”\n\nAll you need to work at in photoshop is where 1 pixel of your image takes up 1 pixel of your screen. I don’t know what photoshop defaults too for that. It maybe 72dpi or 96dpi or (more accurately) maybe it’s just a ’full size’ setting somewhere.\n\n"
    },
    {
      "time": " 10.Apr.2007 10.48am",
      "content": "100% in inDesign and Illustrator means 1 pixel on screen for every point on the printed page. That’s where 72 DPI comes from, isn’t it?\n\n"
    },
    {
      "time": " 10.Apr.2007 11.06am",
      "content": "That meaurement is only right when your monitor is 72 pixels/inch. If the pixels are smaller (higher monitor resolution), everything is scaled down. In practice, this can help you (more pixels are better, right?). But it does mean that those rulers or percentages are wrong; So you might ignore them completely, since that standard resolution is being replaced or superseded. Unless the DTP app can somehow be told the actual monitor resolution and then calculate the true size, those numbers will be meaningless. If you want to be able to have this “100 percent” view, zoom in until your onscreen page is the same size as the printed page and then save or remember that zoom factor.\n\n"
    },
    {
      "time": " 10.Apr.2007 11.26am",
      "content": "<cite>save or remember that zoom factor</cite>\n\nwhich is 137% on a screen resolution of 1680 x 1050 (largest available on my year-old iMac).\n\n"
    },
    {
      "time": " 10.Apr.2007 1.13pm",
      "content": "“which is 137% on a screen resolution of 1680 x 1050 “\n\nWell, keep in mind that that’s just for YOUR monitor. Another 1680 x 1050 screen might have larger or smaller pixels, thereby requiring a differnt zoom setting in the DTP application.\n\n"
    },
    {
      "time": " 10.Apr.2007 7.41pm",
      "content": "To calibrate your own monitor, the steps would appear to be quite easy: Simply draw a 6 in. line in your favorite DTP program, and increase the magnification until it is as long as a 6 in. ruler you hold up to the screen. Make note of the resulting magnification percentage and, Bob’s your uncle, you’ve got the return of true WYSIWYG.\n\nThe page below has a good overview of the history of higher and higher resolutions on Apple screens, and a nice table of effective dpi for relatively current Mac hardware. (I’ve been working under the assumption that my PB G4 17” had 96 dpi. Turns out that’s closer to 100 dpi. Who knew? [Well, besides them, smartypants.])\n\n[http://lowendmac.com/tech/pixels.html](http://web.archive.org/web/20070911195302/http:/lowendmac.com/tech/pixels.html \"http://lowendmac.com/tech/pixels.html\")\n\n"
    },
    {
      "time": " 10.Apr.2007 8.15pm",
      "content": "Yes, Mike, that’s how I got 137%. But 137% is not a quick key command like command-1 when viewing pages. 137% x 72 dpi gives me a screen res of 98.7 - which is pretty close to the 98.4 ppi on your link there, and also to my body temperature.\n\nOf course that article is 4 years old.\n\n"
    },
    {
      "time": " 10.Apr.2007 8.27pm",
      "content": "I concur Patty, but recall that my previous monitor was “size as” at 111%, so we must be making progress. Pretty soon 100% will be 200%.\n\n"
    },
    {
      "time": " 10.Apr.2007 8.28pm",
      "content": "_But 137% is not a quick key command like command-1 when viewing pages._\n\nNo, but you could set something up that would function as such....\n\n"
    },
    {
      "time": " 10.Apr.2007 10.11pm",
      "content": "I believe you can setup a quick key in Indy for your favorite zooms. I’ll check into this tomorrow.\n\n"
    },
    {
      "time": " 11.Apr.2007 1.11am",
      "content": "AFAIK there is now ’easy way to define a shortcut for a particular zoompercentage. Maybe scripting is the way to go, but I’m completely ignorant re that.\n\nA workaround: Set your main window for a document to the zoompercentage that’s equiovalent to a hundred percent. Use Arrange:New Window to create a new window. That’s going to be in front… Use that for layout and mucking around. Want to see the ’real’ size? Go to original window (now in background), selecting it from the bottom of the Window-menu, or by clicking in a visible part (provided you use a cascade view).\n\nDon’t forget to close the ’first’ window last when quitting. The last view of a doc is the way it’s shown when you reopen it.\n\n"
    },
    {
      "time": " 11.Apr.2007 8.19am",
      "content": "I’m not sure I understand Bert but I’ll try. My problem is I’m not often “mucking around” but more frequently trying to lay out a book.\n\nTiff, that would be great. I’m a moron when it comes to setting up quick keys & shortcuts tho.\n\nI find InDy maddening in terms of viewing sizes and arrangements. I hate the way it automatically centers the page you click on, meaning if you’re working in spreads your spread is askew in the window rather than at the left as Quark. Also don’t like that it tends to default to “fit in window” rather than 100% or another size.\n\nBut I do love that it will give you your bleed lines (and snap to) automatically. Hope Quark 7 has that feature!\n\n"
    },
    {
      "time": " 11.Apr.2007 8.32am",
      "content": "It’s very easy to set up shortcuts — InD will even let you (well, mine lets me!) use Quark’s set, or you can create one of your own.\n\nCheck out Edit, then Keyboard Shortcuts: there’s even a half-decent Help blurb for use....\n\n"
    },
    {
      "time": " 11.Apr.2007 12.22pm",
      "content": "“Pretty soon 100% will be 200%.”\n\nIf only.\n\nOddly, in the world of computing, most elements have increased exponentially over the years...HD space, RAM size, Processor speed, printer resolution...but NOT screen resolution. In the past 20+ years we’ve gone from what? 72ppi to 100ppi? That’s slower than a snails pace. ;o)\n\n"
    },
    {
      "time": " 11.Apr.2007 1.34pm",
      "content": "The screen of the upcoming iPhone appears to be araound 120 ppi. That’s progress!\n\n"
    },
    {
      "time": " 11.Apr.2007 2.27pm",
      "content": "Well, I think real progress will be when the 30 inch displays are 200 ppi. Then I’ll spend money again.\n\n"
    },
    {
      "time": " 11.Apr.2007 8.31pm",
      "content": "At InDesignSecrets.com, you can get a nifty little script that will set the document size at whatever you want. Just make a shortcut to the script, and zoom to 137% or whatever you want.  \n [http://indesignsecrets.com/plug-ins-and-scripts/](http://web.archive.org/web/20070911195302/http:/indesignsecrets.com/plug-ins-and-scripts/ \"http://indesignsecrets.com/plug-ins-and-scripts/\")\n\n"
    },
    {
      "time": " 12.Apr.2007 5.43am",
      "content": "“I’m wondering when the software companies will get with the program (so to speak) and recalibrate.”\n\nApple = Never, but middle C is Middle C, so at least they got that right.  \nMS = “in the “next” OS”, is what I’ve been told, but I’m waiting to celebrate.\n\nThat’ a pretty darn good range to choose from, don’t you think? I know they do.\n\nMonitors sold today have met a standard for reporting their native resolutions and have made it possible (finally) for OS to “do the right thing.” (that being to become scaleable) at the OS level. Shortened, this means if your resolution is 200 or 72, 12 pt is within a pixel of 1/6th of an inch.\n\nDo not hold your breath though, there does not seem to be much interest in “actual size” and 100% being one-and-the-same “out there”. “Just make a shortcut to the script, and zoom to 137% or whatever you want,” is what we are left with because of this. Fine as it is, it’s pathetic to consider that digital outlines were provided to solve this problem in OS 18 years ago!\n\n"
    },
    {
      "time": " 12.Apr.2007 10.20am",
      "content": "To make matters more complicated, there is the issue of perceived size. Resolution, viewing distance and even contrast can alter how we perceive scale. Unfortunately, simply altering the zoom level of your on screen document to match the physical dimensions won’t give you an accurate picture of what it will look like, as evidenced by the comment, “the files now look HUGE”.\n\nI do a lot of work for mobile phone screens that have an effective resolutions anywhere from 72 to 150 dpi. It’s amazing how the visual relationships and hierarchies change when I move things from the 96 dpi computer monitor to much higher resolution phone screens.\n\nOne time we wanted to run some tests on some designs before we had access to the target device, so we printed them out. The designs looked way too small. Oddly enough, though, they looked great on the actual device once we got them on there. Somehow on the bright backlit screen of the device they looked way larger then the print outs, even though they were exactly the same size and resolution at around 150ppi.\n\n"
    },
    {
      "time": " 12.Apr.2007 11.19am",
      "content": "<cite>That said, it would be nice to maybe have some sort of calibration option within the DTP application... </cite>\n\nQuark has had this since I can remember.\n\nGo to Preferences \\> Display \\> Display DPI value, and then put in your actual screen’s DPI, measured with a ruler (my 19” is 120dpi, I imagine all other 19” LCDs are too)\n\nThen 100% will indeed be 100%!\n\nI have no idea why this doesn’t feature in other graphics software, in lieu of it being supported in the OS.\n\n"
    },
    {
      "time": " 12.Apr.2007 11.38am",
      "content": "Actually a search tells me it is supported in Acrobat 7. Not in any other Adobe apps though.\n\n<cite>100% in inDesign and Illustrator means 1 pixel on screen for every point on the printed page. That’s where 72 DPI comes from, isn’t it?</cite>\n\nThat’s kind of backwards... The Postscript point was defined as 1/72 inch, so to display 1 pixel per point on early DTP systems the screen was designed to be 72dpi. So at least to start with, it all worked fine.\n\nOh and I have come across a couple of resolution independent UIs - one is the open source 3d app Blender ( [http://www.blender.org/](http://web.archive.org/web/20070911195302/http:/www.blender.org/ \"http://www.blender.org/\")) where all the menus and dialogs are scalable vectors. Some Linux front ends (probably not correct terminology) already have scalable vector icons.\n\nWindows 95-2000 (and beyond if you use the Classic visual themes) used fonts to render window controls - the minimise, maximise and close icons, resize handles, etc were all in a Truetyoe font called Marlett.\n\nBut I digress.\n\n"
    },
    {
      "time": " 12.Apr.2007 12.09pm",
      "content": "“I’m wondering when the software companies will get with the program (so to speak) and recalibrate.”\n\nAs far as Mac OS X is concerned, resolution independence will be built into Leopard, expected this June. From Apple’s Leopard developer pages ( [http://developer.apple.com/leopard/overview/](http://web.archive.org/web/20070911195302/http:/developer.apple.com/leopard/overview/ \"http://developer.apple.com/leopard/overview/\")):\n\n<cite>The old assumption that displays are 72dpi has been rendered obsolete by advances in display technology. Macs now ship with displays that sport native resolutions of 100dpi or better. Furthermore, the number of pixels per inch will continue to increase dramatically over the next few years. This will make displays crisper and smoother, but it also means that interfaces that are pixel-based will shrink to the point of being unusable. The solution is to remove the 72dpi assumption that has been the norm. In Leopard, the system, including the Carbon and Cocoa frameworks, will be able to draw user interface elements using a scale factor. This will let the user interface maintain the same physical size while gaining resolution and crispness from high dpi displays.</cite>\n\n<cite>The introduction of resolution independence may mean that there is work that you’ll need to do in order to make your application look as good as possible. For modern Cocoa and Carbon applications, most of the work will center around raster-based resources. For older applications that use QuickDraw, more work will be required to replace QuickDraw-based calls with Quartz ones.</cite>\n\nIndeed, there is some resolution independence already in 10.4 Tiger. Geek out below:  \n [http://developer.apple.com/releasenotes/GraphicsImaging/RN-ResolutionInd...](http://web.archive.org/web/20070911195302/http:/developer.apple.com/releasenotes/GraphicsImaging/RN-ResolutionIndependentUI/ \"http://developer.apple.com/releasenotes/GraphicsImaging/RN-ResolutionIndependentUI/\")\n\n"
    },
    {
      "time": " 12.Apr.2007 12.37pm",
      "content": "As long as operating systems don’t know (or don’t care, due to pixel orientated rendering engines) about the physical monitor size, you’ll have to rely on what the apps can provide.\n\nxPress has a setting for screen resolution. If you enter your real physical resolution, 100% will be what you see is what you get.\n\nSame you can do with acrobat 7 and 8.\n\nIndesign and Illustrator don’t have such a setting, and Photoshop doesn’t need one (but please, let’s not discuss on this again :), but there are scripts that help you to get the appropriate zoom level via shortcut.\n\nHow to determine your ppi-screenresolution (example):\n\nhorizontal pixel dimension: 1600  \nvertical pixel dimension: 1200  \ndiagonal screen in inches: 21” (measure this exactly!)\n\ndetermine diagonal pixel count:  \nsqrt(1600² + 1200²) = 2000\n\nget the pixel number for one inch:  \n2000px/21” = 95,2 = 95ppi\n\nIf you enter this number to xpress or acrobat, you get wysiwyg at 100% zoom.\n\n"
    },
    {
      "time": " 12.Apr.2007 1.37pm",
      "content": "<cite>Go to Preferences &gt; Display &gt; Display DPI value, and then put in your actual screen’s DPI, measured with a ruler (my 19” is 120dpi, I imagine all other 19” LCDs are too)</cite>\n\n<cite>xPress has a setting for screen resolution. If you enter your real physical resolution, 100% will be what you see is what you get.</cite>\n\nI can’t find this under preferences. I’d love to set this up as a default. Seems like a no-brainer. I’m using Quark 6.1. Maybe this is new to 6.5 or 7.\n\nAhhh - Windows only. No wonder I couldn’t find it. Well that’s the first good reason I’ve ever heard to use Windows over a Mac.\n\n"
    },
    {
      "time": " 12.Apr.2007 3.42pm",
      "content": "Did I say Leopard was coming out in June? Uh, I meant October...  \n [http://www.apple.com/hotnews/](http://web.archive.org/web/20070911195302/http:/www.apple.com/hotnews/ \"http://www.apple.com/hotnews/\")\n\n"
    },
    {
      "time": " 13.Apr.2007 7.33pm",
      "content": "What a great thread. Thanks!\n\n"
    },
    {
      "time": " 14.Apr.2007 4.38am",
      "content": "“(or don’t care, due to pixel orientated rendering engines) “\n\nbut but, it’s not the pixel orientated rendering engines, but rather the pixel orientated description lingos, isn’t it?\n\n"
    },
    {
      "time": " 20.Apr.2007 12.18pm",
      "content": "“orientated”?\n\n"
    }
  ]
}
