{
  "id": "32943",
  "title": "Quest for fonts designed for subtitles",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nI am interested in finding fonts designed for subtitling, or fonts that are fine tuned to be suitable also for subtitles as a side product of the design process. Only a few days back I read about a recent font, a sans serif, that was designed for display, text _and_ subtitles. But now I can't remember what it was!\n\nI figure that if somebody went through the trouble of designing something especially for subtitle use, then I should opt for that instead of something that just works ok on tv.\n\nThis might be a minor issue in the english speaking world - and many european countries that dub their films - but for example in Finland & Sweden it is quite relevant, since everything is subtitled. In Finland people are so used to reading subtitles (finns read the equivalent of 20 books a year from the screen), that they should easily be able to read pretty much anything. But now the most used font is helvetica. So there is room for graphic and type designers efforts there. Especially now, when technical issues will no longer limit the number of fonts available (from European Broadcasting Union's site):\n\n\"The EBU recommends the use of DVB Subtitling for new installations. This format allows broadcasters to determine the font (style & size), position and spacing – ensuring the same legibility on all compliant receivers. Special characters, scripts and icons are also supported without any concern for receiver legacy issues, supported character sets, etc.\"\n\nSo please, can you help me locate what could be the contemporary sans I saw and any other fonts that have been designed to work in subtitles. I do need a font to use quite urgently, but this list would be useful anyway, hopefully to others too.\n\nFor the first part of the quest, the font I saw was most likely designed in 2000-2007. I went through many of the contemporary font foundries often mentioned on this site. The font was recommended for magazine use, but subtitles were also listed in the description.\n\nI start the list with  \n [Tiresias](http://web.archive.org/web/20130224082337/http:/http/www.tiresias.org/fonts/index.htm) (used by BBC)\n\n(I did go to Joe Clark's page, but couldn't find any named fonts.)\n\n",
  "author": "katju",
  "time": "10 Apr 2007 — 11:11am",
  "uid": "17881",
  "comments": [
    {
      "time": "10 Apr 2007 — 1:52pm",
      "content": "Ascender Corp. is a firm that sells on screen fonts. Maybe a good starting point:\n\n[http://ascendercorp.com/devicefonts.html](http://web.archive.org/web/20130224082337/http:/ascendercorp.com/devicefonts.html \"http://ascendercorp.com/devicefonts.html\")\n\n"
    },
    {
      "time": "11 Apr 2007 — 12:45am",
      "content": "Thanks, Ascendercorp's [Mayberry](http://web.archive.org/) is definitely a good choice for DVB standard.\n\nIt seems that Tiresias Screenfont is not available for purchase.\n\n"
    },
    {
      "time": "13 Apr 2007 — 11:32pm",
      "content": "[http://www.ccfonts.com/](http://web.archive.org/web/20130224082337/http:/www.ccfonts.com/ \"http://www.ccfonts.com/\")\n\n"
    }
  ]
}
