{
  "id": "32949",
  "title": "Need help kerning",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello all,\n\nI'm having trouble with this logo, getting the kerning right. does anyone have any advice? and also, if anyone has any links on a how-to kerning primer, that'd be greatly appreciated.\n\nthanks,\n\n// Ed\n\n ![](http://web.archive.org/web/20150417151219im_/http:/typophile.com/files/beth_6422.gif)\n\n",
  "author": "edfladung",
  "time": "10 Apr 2007 — 12:48pm",
  "uid": "12454",
  "comments": [
    {
      "time": "10 Apr 2007 — 12:55pm",
      "content": "Kerning is definitely in the eye of the designer, but some tips to get a more atheistic appeal to your letter spacing would be,\n\n1. turn the type upside down and stand back (atleast 30 inches) from your type, the spacing between words should become more apparent. Squinting your eyes will also help.\n\n2. Remember that the spacing is the negative space between two positive shapes, so the letterforms will usually dictate if spacing should be tighter or looser. (Edit: I meant to imply that the negative space should be balanced based on how much positive shapes are around it.) Don't be afraid to tuck letters into each other if you feel it'll be balanced visually better (such as under the cross of a T or the arms of a Y).\n\n"
    },
    {
      "time": "10 Apr 2007 — 1:47pm",
      "content": "hey, thanks for the good advice. i'll keep on it.\n\n"
    },
    {
      "time": "10 Apr 2007 — 2:02pm",
      "content": "Try to look at letters 3 per 3 comparing the space between the middle lettre with the previous and the following one.\n\nI agree with Asvetic, there is a problem with the T and the Y.\n\n"
    },
    {
      "time": "22 Apr 2007 — 1:02am",
      "content": "My recommendation would be to tighten up the Z and A and the B and E in \"Elizabeth\" and the O and Y in \"Lloyd\". Other than that it's looking good. Like Avisetic said, just stand back and look at how everything looks all together.\n\n"
    },
    {
      "time": "22 Apr 2007 — 1:18am",
      "content": "i can only voice my opinion here, guided by my eye (there are doubtless many others who have greater credentials than i):\n\ni would tighten up the I-Z-A-B string and certainly the L-O-Y-D string.\n\n"
    },
    {
      "time": "23 Apr 2007 — 6:32am",
      "content": "You could also look at visually centering the type, the curve of the D (because it is curved) looks further from the edge than the E. When kerning you should also consider the final size use, too tight kerning at a small size should be avoided.\n\nTim\n\n"
    }
  ]
}
