{
  "id": "32970",
  "title": "Beer Label Critique",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello Everyone\n\nYour comments and critique of this beer label that I've just sent to print would be most welcome...\n\n ![](http://web.archive.org/web/20150401025854im_/http:/typophile.com/files/FistralLabel01x600px_4027.jpg)\n\nI could make any improvements after this initial short print run.\n\nThe label is to be printed PMS 3155 and metallic silver PMS 877. The dotted line is the die cut.\n\nThe 'Fistral' logotype font is a customised Hartwig Schrift and most of the other type is ATF Antique, plus a little Trade Gothic.\n\nI have asked the printers to change the barcode numbers font from Arial (please Lord, for the sake of the children, anything but Arial) to something more techy/utilitarian if possible.\n\nTo give you some context, Fistral beach is the UK's surfing capital and is on the international competion circuit. The brewery that makes the beer is just a few miles inland. This is the only label going on the bottle which is a standard 330ml clear one and will have a silver crown cap. The beer itself is a pale gold. And chilled. Nice.\n\n",
  "author": "wormwood",
  "time": "11 Apr 2007 — 10:30am",
  "uid": "14065",
  "comments": [
    {
      "time": "11 Apr 2007 — 10:46am",
      "content": "That is a pleasure to the eyes! Nice work\n\n"
    },
    {
      "time": "11 Apr 2007 — 11:13am",
      "content": "If we say nice things about it, will you send over a six-pack? ;-)\n\n(edit: FWIW, you could change the bar code numbers to something from the OCR family without much problem.)\n\n"
    },
    {
      "time": "11 Apr 2007 — 11:17am",
      "content": "Quality stuff!\n\n"
    },
    {
      "time": "11 Apr 2007 — 11:38am",
      "content": "Would love to see a picture of this on the bottle. I think it is outstanding.\n\nSharon\n\n"
    },
    {
      "time": "11 Apr 2007 — 11:42am",
      "content": "I'm sorry, but I find the Fistral logo hard to read. The Fi ligature seems awkward and the final l reads as an f to me.\n\nWill the bottle be clear, green, or brown?\n\nIt looks nice otherwise, but it might have been fun to make it even more RAD for the surf set.\n\n"
    },
    {
      "time": "11 Apr 2007 — 11:53am",
      "content": "Phase II, friendly & romantic.\n\n"
    },
    {
      "time": "11 Apr 2007 — 11:54am",
      "content": "I enjoy a beer now and then, and I must say I don't recall a color combination such as this. The overall design gave me the sense of a Belgian White.\n\nI agree with Patty, reading Fistral was not my first impression, I actually thought it was a German word or something.\n\nEDIT: That doesn't mean I think you should change it, I've definitely seen a lot of difficult to read beer labels, which in itself is a unique quality of the label's design. Plus it gives the alcoholics something to enjoy while they're sitting there waiting for the buzz to start.\n\n"
    },
    {
      "time": "11 Apr 2007 — 12:05pm",
      "content": "I share Patty’s concern on the readability of the logo, especially glimpsed in a chiller cabinet over a bar, pertinent to the readability is the amount of logo visible when the label is wrapped around the bottle, even though most of the target audience will know the name from the beach. On the label I might centre on the bullet between Newquay • Cornwall, regardless that that would uncentre the type either side; and increase the size of the scroll in proportion to the trident lozenge and insert a comma after strong on the front.\n\nFor the volume I think you must show the e estimated symbol  \n [http://en.wikipedia.org/wiki/%22Estimated%22\\_sign](http://web.archive.org/web/20150401025854/http:/en.wikipedia.org/wiki/%22Estimated%22_sign \"http://en.wikipedia.org/wiki/%22Estimated%22\\_sign\")\n\nTim\n\n"
    },
    {
      "time": "11 Apr 2007 — 12:40pm",
      "content": "IIRC The OCR code is measured by stroke width and not height so you could shorten that a bit. (But do check this out with those in charge!) I shorten the codes on some book jackets I design.\n\n"
    },
    {
      "time": "11 Apr 2007 — 12:44pm",
      "content": "I have done so as well, Tiff -- in fact, I can't remember doing one in anything other than OCR....\n\n"
    },
    {
      "time": "11 Apr 2007 — 12:47pm",
      "content": "I usually shorten them too.\n\nAlso you might check to make sure the blue you're using is cool with the scanners. Most blues are but they shouldn't have yellow in them.\n\n"
    },
    {
      "time": "11 Apr 2007 — 12:55pm",
      "content": "I think it doesn't really matter which font is used for the numbers, as long as it's legible and fits in it's place. That's the part for the human eyes. But one musn't fiddle with the lines. If they are shortened, scaled or pasted inside, it has to be done so that the lines don't change in proportion to each other.  \nI've changed the font to Gill Sans in the past (as it was used in the package anyway) with no problems reported.  \nI use Barcode producer now, and it lets me change the number font, or it can be changed in Illustrator. The said application also warns me if the size of the code is too small.\n\nGood point about the colour, Patty. You don't want to be the favourite hate person of the cashiers, who have to type the code in every time.\n\n"
    },
    {
      "time": "11 Apr 2007 — 2:03pm",
      "content": "Thank you everyone for your comments and advice.  \nThe bottle is clear flint glass BTW.\n\n_\"If we say nice things about it, will you send over a six-pack? ;-)\"_\n\nSorry Linda. It's a local beer for local people.  \n(a reference to brilliantly twisted British comedy [League of Gentlemen](http://web.archive.org/web/20150401025854/http:/en.wikipedia.org/wiki/League_of_gentlemen))\n\nFor comparison here's how Fistral looked set in Hartwig Schrift before customising...\n\n ![](http://web.archive.org/web/20150401025854im_/http:/typophile.com/files/FistralHartwigSchriftx600_4976.jpg)\n\n ![](http://web.archive.org/web/20150401025854im_/http:/typophile.com/files/FistralLabel01x600px_4027.jpg)\n\nPatty and Tim, mmmmm, yes, I'm also not sure if my Fi ligature is as elegant and legible as it could be, but I'm pretty happy with the final l.\n\nDoes anyone else think the overall readability or the Fi ligature and the final l are problematic?\n\nI had been thinking along the lines of Asvetic's comments, in that I wanted the design to have some continental quirkiness. And then I covered my asѕ by having 'Fistral Premium' further down the label.\n\nPatty, a RAD surfer design was considered, but it needs to appeal to the Newquay high end bar, restaurant and hotel market too, not just the doods on the beach. But, yes, it would of made for a more fun design job.\n\nThanks Tim. Astute and practical comments as usual. I think I agree with them all. I have been careful to allow for the bottle wraparound effect.\n\nThe client is checking the blue for acceptability with the Official Bureau of Barcodes.\n\nThe setting of the barcode is, unfortunately, out of my hands. Barcodes really screw up a design with limited space. It's about time technology advanced and they were replaced with some kind of micro digi dot. And a blue lazer.\n\n_\"Phase II, friendly & romantic.\"_\n\nAlessandro, I'm sorry, I'm not really sure what you mean, but I think I like the sound of it.\n\n"
    },
    {
      "time": "11 Apr 2007 — 2:09pm",
      "content": "I like it general and the oceanic color scheme will work with redish colored glass or clear with a warm colored ale. If you choose to make the Letters more legible I would look at the t and maybe even consider a ligature. I know two ligatures next to each other might be odd... Also what about raising the height of the el 'l' at the end for better visual balance? Actually raising the height of the F & the l together might be pretty awesome. And what about raising the position of the 'calligraphy' itself slightly. The text at the bottom looks slightly cramped and there is space above available I think. Not a huge adjustment though.\n\n"
    },
    {
      "time": "11 Apr 2007 — 2:40pm",
      "content": "i did not struggle with the Fi, but did with the l.  \nactually, i really like the typography. the earlier suggestion of centering the bullet is a good one, but i think the overall label is pretty strong typographically. the main thing that gives me pause is the green/silver combo on a white label. i'm just curious -- did you consider white and black on a silver (or maybe gold?) metallic stock?\n\n ![](http://web.archive.org/web/20150401025854im_/http:/typophile.com/files/FistralLabel_5120.jpg)\n\n"
    },
    {
      "time": "12 Apr 2007 — 5:53am",
      "content": "Except for the color, which is not beerish enough for me, I like it. But I don't see any advantage to hiking the middle of the \"s\" up to its chest. It's too important to legibility in this case.\n\nCheers!\n\n"
    },
    {
      "time": "12 Apr 2007 — 6:08am",
      "content": "I would love to see this with the background in one of your 2 colors, with reversed type. Maybe the shield background is different than the band? There is too much white for my eyes, it looks unfinished to me, but still nice.\n\n"
    }
  ]
}
