{
  "id": "32971",
  "title": "I'm BACK!! and now toting my Thesis project!",
  "forum": "Design",
  "tags": [

  ],
  "content": "It's been a long hiatus from Typophile for me this past school year, I've been super busy and have not only my Thesis project, but also an award from American Corporate ID 23 for some knock down packaging design I did in the fall! It will be featured in October's hard bound annual. Just wanted to say hello and I should be frequenting the boards more often again. I'll post a seperate topic for the packaging project soon.\n\nWithout further ado, I'd like to send a special thank you to the type designers (some who are members and some whom aren't) that donated faces for my project, it couldn't be what it is without your help! Michael Abbink, Paul Hunt, Ray Larabie, Mark Simonson, Richard Kegler & Patrick Griffin, thank you soooo much.\n\nUPDATE:\n\nScreen res. PDF: [http://www.davebailey.us/stuff/david.bailey.thesis.pdf](http://web.archive.org/web/20110607082233/http:/www.davebailey.us/stuff/david.bailey.thesis.pdf \"http://www.davebailey.us/stuff/david.bailey.thesis.pdf\")\n\nContact me if you'd like a high res. PDF for any education reason!\n\n",
  "author": "<a href=\"/web/20110607082233/http://typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": "",
      "content": "Fun and very well done, Congratulations!\n\n"
    },
    {
      "time": "",
      "content": "Aw man, you made us download it? Why not post a link to the pdf on line?\n\nThat said, I like it!\n\n"
    },
    {
      "time": "",
      "content": "Congratulations, it's beautiful and fun - one to keep!\n\n"
    },
    {
      "time": "",
      "content": "I enjoyed it, especially the logo anagrams. I hope you won't mind a bit of fact fixing:\n\n ![](http://web.archive.org/web/20110607082233im_/http:/typophile.com/files/PreviewScreenSnapz002_6082.png)\n\nYou have some fonts here misattributed to Mark Simonson. [Futura](http://web.archive.org/web/20110607082233/http:/typophile.com/wiki/Futura) is [Paul Renner](http://web.archive.org/web/20110607082233/http:/typophile.com/wiki/Paul%20Renner), Motter Corpus is [Othmar Motter](http://web.archive.org/web/20110607082233/http:/typophile.com/wiki/Othmar%20Motter), and Wendy LP is by [Garrett Boge](http://web.archive.org/web/20110607082233/http:/typophile.com/wiki/Garrett%20Boge) based on an old film font by an anonymous artist.\n\nI see you're making an effort to mention the websites of the originating foundries, which is great. If that's the case, Wendy should probably show letterspace.com and Bickham Script and Pepperwood should be adobe.com.\n\nFinally, P22 Declaration is misattributed to Briem and should list p22.com.\n\n"
    },
    {
      "time": "",
      "content": "Very Nice - I will show it to my students as a good example.\n\n"
    },
    {
      "time": "",
      "content": "Stephen,\n\nDavid is not crediting the design to the names give, he's crediting thos folks for donating the fonts to him for use in the project.\n\n"
    },
    {
      "time": "",
      "content": "i believe the apostrophe on Mr. Mojo Risin' is facing the wrong way.\n\n"
    },
    {
      "time": "",
      "content": "Patty: I'll post a fixed PDF as an attachment when I get home. Thanks!\n\nStephen: Ah crap, old PDF up there. All of those things mentioned were never meant to be that way as the specimens got moved around. Wouldn't it be nice if Mark did in fact design such esteemed and historic faces? :-P\n\nBob: I would be honored. Wait for the updated PDF attachment.\n\nPaul: Yeah.....that's the one thing that managed to slip my attention. I guess nobody's perfect. If I rebuild my book it'll get fixed. I can't thank Richard and you enough for your help. I've got plans for a thank you but need some time to get it done.\n\n"
    },
    {
      "time": "",
      "content": "Minor criticism - I found HITLER hard to read, the way the letters run together. Didn't leap out at me.\n\n"
    },
    {
      "time": "",
      "content": "Very nice. Much more interesting than my thesis.\n\n"
    },
    {
      "time": "",
      "content": "Patty: agreed, that could potentially be a problem\n\nHaley: thanks!\n\n"
    },
    {
      "time": "",
      "content": "I was just wondering if you took the idea for the evian/naive logo from \"Reality Bites\"? ;-)\n\n"
    },
    {
      "time": "",
      "content": "<cite>I was just wondering if you took the idea for the evian/naive logo from “Reality Bites”? ;-)</cite>\n\nNever seen it! I'll have to check it out.\n\n"
    },
    {
      "time": "",
      "content": "Nice job, David! I've had an affinity for anagrams since I was a 6th grader. I noticed the evian/naive reversal as a kid, and then years later started to hear about it. Alan Fletcher did a collage of that logo.\n\nI'll be sure to check out the DU senior show.  \nCan you let me know when that is?\n\n"
    },
    {
      "time": "",
      "content": "koleslaw: Thanks, I had never seen any instances of the Evian reversal, but I guess it's a bit obvious to us designers? Shoot me an email ( dave at davebailey dot us ) and i'll be sure to get you a \"Save The Date\" flyer (I'll forget if you don't remind me :-D). The show is on the 13th of June, from 6pm to 9pm.\n\nEDIT: Is your name Sal? Did you go to Drexel?\n\n"
    },
    {
      "time": "",
      "content": "Yes, and yes.\n\n"
    },
    {
      "time": "",
      "content": "Haha, I've been working with John since sophomore year on my own creative pieces (ambigrams, anagrams, type, etc.) as well as helping him with his commissions. I've been to your website numerous times, so yeah, I've heard about you and took a wild guess based on your minimal profile here. I'm also good friends with Laura Schetzsle and Andrew Long from your year. Funny that we meet like this. I've always liked your type/design work.\n\n"
    },
    {
      "time": "",
      "content": "Were you \"toting\" or \"touting\" your Thesis project? And who pays for the reprinting? (just foolin')\n\n"
    },
    {
      "time": "",
      "content": "You tell me! (which one is correct) I'm definitely not an English major. :-) Reprinting? As in fixing my mistakes or requesting a copy?\n\n"
    },
    {
      "time": "",
      "content": "Well, either could be correct -- depends on what you mean:\n\ntote (toting): to carry by hand; bear on the person.\n\ntout (touting) has lots of meanings, from \"to spy out\" through \"to solicit bets\", to \"to make much of, promote.\"\n\nI still remember an experience in 1980 or so, when setting the <cite>South Atlantic Quarterly</cite> -- I got \"Jane Austen\" right on the article opening, but got the running heads as \"Jane Austin.\" It was printed that way, fortunately caught in F&Gs. I offered to pay for the reprinting, but the publisher allowed the proofs had been seen by a number of people, none of whom caught the error, so they would absorb the cost of reprinting.\n\n"
    },
    {
      "time": "",
      "content": "Earache Records complilation recorded by Mark Smoot @ in July of 1992. As far as I know, this compilation is no longer available in the U.S. due to a lawsuit from Evian.\n\nview image: [http://i68.photobucket.com/albums/i28/schmuckatelly/naive\\_cover\\_T.jpg](http://web.archive.org/web/20110607082233/http:/i68.photobucket.com/albums/i28/schmuckatelly/naive_cover_T.jpg \"http://i68.photobucket.com/albums/i28/schmuckatelly/naive\\_cover\\_T.jpg\")\n\nI enjoyed looking at this project. I'd much rather see more experimentation with wordforms rather than just making a cool looking alphabet like so many tend to want to do. However, I wish there could have been more interesting or unique type used. It looks like you simply chose a font and typed the words out. Maybe you could have manipulated some of them to make them your own. I dunno. I'm not giving you a hard time. Like I said, I enjoyed the project but considering I've seen a lot of them before, I suppose more type manipulation would have made up for it. Make the words behave more like images and let the actual images recede. Make it about type! These are the kinds of things I've had to go through. My profs are never satisfied. Heh.\n\nI have a friend that is presenting his thesis on ambigrams today. Wish him luck!\n\n"
    },
    {
      "time": "",
      "content": "schmuckatelly: I'm glad you enjoyed it, but am confused by your statement \"It looks like you simply chose a font and typed the words out\" as there was careful deliberation over each typeface chosen for the project to integrate it with the appropriate imagery and context. The point was to use exclusively type set words and an image to convey an idea or juxtaposition. Each piece of typography was carefully considered and the overall feel of the book was to be 'fun' but nothing of the 'grunge/flourish/trendy' design thematics you see often nowadays. I'd also like to add that most of the logos had to be redrawn by hand and then digitized, quite a bit of work in itself.\n\nI'd be interested in seeing your friend's thesis, as John Langdon ( [http://www.johnlangdon.net](http://web.archive.org/web/20110607082233/http:/www.johnlangdon.net/ \"http://www.johnlangdon.net\")) is my professor/mentor/employer. I've designed ambigrams myself and have one I designed tattooed on my back.\n\n"
    },
    {
      "time": "",
      "content": "Very Nice! What is the name of the font for \"ROMA\" on page 16??\n\n"
    },
    {
      "time": "",
      "content": "Penumbra Serif Semibold weight....thanks for the page # but honestly I spent 10 weeks working on the project every day so they're nailed into my head. :-)\n\n"
    },
    {
      "time": "",
      "content": "I'm not 100% sure but I think he actually studied Langdon. I can't be sure until I ask him though. He searched and searched for resources on ambigrams and found very little. He worked as well as he could around what research he could find but a lot of the work was based on his own sketches. He also related his ambigrams on life experiences and real-world situations.\n\nI don't mean to be rude or anything, but your project never would have passed in the program that I'm going through. Much less, it would not have passed the proposal stage. The guy that did the ambigrams was sort of lucky. He basically stood his ground with the idea until they finally said \"ok you want to do this project so you better come back with something good.\" Even now they tell him this project is meaningless but I encouraged him to stick with it and make it a real study of type. While his project could have been much more thorough, I think he did a good job of creating his own ambigrams. We talked about not only creating orientation reversals, but contrast situations, opposites and synonyms reversed as well as the integration of image and text. It came out quite successful. Not only that, he made the ambigrams illustrate the meanings of the words that they represented. The letterforms became the image without any support of photography.\n\nAgain, not to bash your project, I'm glad you made the effort, but a large portion of that we have seen before. That's why I would have urged you to do more with manipulating the type to make it your own. It seems as if the background images are doing more than what the type is doing. I know you said there was careful deliberation in choosing the type. But where does deliberation within your font list end and creativity begin? You know well enough that choosing a typeface is not the terminal decision. You have every bit of control after the fact. The font choice is only a starting point. It's what you do with it afterward is where you make the expression. Are you passionate about type or not? If you are, then go there. Go there or don't go at all. That's what we always say.\n\nTypography is a very difficult skill to grasp within graphic design or any of the arts for that matter. You're never going to get it perfect. It's really just an exercise in getting it as close as you can. And that's really the way you have to look at it. Never get discouraged when you don't get it perfect but, at the same time, never be satisfied. You have control. Sieze it.\n\n"
    },
    {
      "time": "",
      "content": "Nice job, David!\n\n--Mark (a.k.a. Paul Renner :-)\n\n"
    },
    {
      "time": "",
      "content": "schmuck: I obviously can't convince you about the intent of my project or the amount of work and research put into it. It seems obvious to me that it's a success when I get an overwhelmingly positive response here where the majority are seasoned designers and are always 100% honest with their opinions. Not to mention the same response from my professors who all work in the industry at the same time as they teach, many whom have been for 20+ years. I respect that you have your opinion and will leave it at that. Like I said though, I'm very interested in your friend's thesis project if he's willing to share. Where do you two go to school?\n\nMark: Wonderful, I'm glad you enjoyed it! Hope your travels over in Belgium are going well (or went well if you are back!) Yves gave us the heads up. :-) I will be contacting you soon about a mailing address.\n\n"
    },
    {
      "time": "",
      "content": "Popular opinion doesn't make truth. A lot of people like Britney Spears' music but I happen to think she sucks. So I must be wrong. You obviously got offended and that's not what I'm trying to do. I just saw something that I think you could have considered and thought it needed to be said. Just trying to help. Moving along now...\n\n"
    },
    {
      "time": "",
      "content": "Only a bird poem I could remember...\n\nOn a tree by a river a little tom-tit  \n Sang \"Willow, tit-willow, tit-willow!\"  \n And I said to him, \"Dicky-bird, why do you sit  \n Singing 'Willow, tit-willow, tit-willow?'\"  \n \"Is it weakness of intellect, birdie?\" I cried,  \n \"Or a rather tough worm in your little inside?\"  \n With a shake of his poor little head he replied,  \n \"Oh, willow, tit-willow, tit-willow!\"\n\nHe slapp'd at his chest as he sat on that bough,  \n Singing \"Willow, tit-willow, tit-willow!\"  \n And a cold perspiration bespangled his brow,  \n Oh, willow, tit-willow, tit-willow!  \n He sobb'd and he sigh'd, and a gurgle he gave,  \n Then he threw himself into the billowy wave,  \n And an echo arose from the suicide's grave-  \n \"Oh willow, tit-willow, tit-willow!\"\n\nNow I feel just as sure as I'm sure that my name  \n Isn't Willow tit-willow, tit-willow,  \n That 'twas blighted affection that made him exclaim,  \n \"Oh, willow, tit-willow, tit-willow!\"  \n And if you remain callous and obdurate, I  \n Shall perish as he did, and you will know why,  \n Though I probably shall not exclaim as I die,  \n \"Oh willow, tit-willow, tit-willow!\"...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nJust foolin’ with Flowers\n\n"
    },
    {
      "time": "",
      "content": "About Brittney Spears, if my memory serves me right, didn't she give head to Fred Durst according to Eminem? Or was that Christina Aguilera? Either way, they definitely both suck. Brittney nearly even swallowed down Madonna's tonsels ;-p\n\n"
    }
  ]
}
