{
  "id": "32973",
  "title": "FF DIN",
  "forum": "Home",
  "tags": [
    "Typeface",
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150307230621/http:/typophile.com/wiki/Indices) : [Typefaces](http://web.archive.org/web/20150307230621/http:/typophile.com/wiki/Typefaces) : FF DIN**\n\n[Albert-Jan Pool](http://web.archive.org/web/20150307230621/http:/typophile.com/wiki/Albert-Jan%20Pool), [Achaz Reuss](http://web.archive.org/web/20150307230621/http:/typophile.com/wiki/Achaz%20Reuss), 1995-2002\n\nAfter re-working and expanding OCR-B to include three weights for the [FontFont](http://web.archive.org/web/20150307230621/http:/typophile.com/wiki/FontFont) 14 release (FF OCR-F), Pool began working on his second FontFont, the famous [DIN Mittelschrift](http://web.archive.org/web/20150307230621/http:/typophile.com/wiki/DIN%20Mittelschrift). This face has not only dominated the traffic signs and public buildings in Germany, but with its technical orientation and straightforwardness it has also found many friends internationally. FF DIN has been expanded to a family of five weights. For each weight there is an Alternate cut with old style figures, circular i-dots and full points and oblique terminals on some characters.\n\nPool himself considers DIN Mittelschrift -- the German \"Autobahn\" typeface -- to be \"probably the most non-designed typeface ever made\". Taking this opinion as a starting point it seemed to be logical to only enhance the typographic quality of the design while maintaining its overall appearance. The original DIN Mittelschrift is built up from strokes having a constant thickness, all curves being drawn with a compass. This provides a spotty typeface with quirky letterforms, as can especially seen in the characters a, e and s. Compared with characters with fewer strokes, such as b, d, p, q, and o and n they appear rather black. For FF DIN, the weight of the horizontal strokes has been reduced, and the curves were designed in a more fluent way. The medium weight of FF DIN resembles the original weight of DIN Mittelschrift. Using it for reading text in smaller point sizes gives a rather dark appearance. The weight scheme for FF DIN was conceived to accommodate the addition of a new and lighter \"regular\" version. Each of the weights has been provided with over 700 kerning pairs, including those with international accents. With FF DIN, designers can now use the image and impact of a typeface family relating to items as \"traffic\", \"engineering\" and the German \"Wirtschaftswunder\". It is left to each designer to determine how much the original typeface retains its character, as they can now opt for new weights or the alternate fonts that have friendly circular i-dots and old style figures.\n\n**External Links**  \n [FF DIN](http://web.archive.org/web/20150307230621/http:/www.fontshop.com/fontcase/super_families/ff_din/) at FontShop  \n [FF DIN fonts](http://web.archive.org/web/20150307230621/http:/www.fontfont.com/fonts/din) at FontFont  \n5-part FF DIN series in _Encore_: [1](http://web.archive.org/web/20150307230621/http:/www.magwerk.com/mag.php?magazine=encore&language=en&issue=13&page=32) | [2](http://web.archive.org/web/20150307230621/http:/www.magwerk.com/mag.php?magazine=encore&language=en&issue=14&page=12) | [|](http://web.archive.org/web/20150307230621/http:/www.magwerk.com/mag.php?magazine=encore&language=en&issue=15&page=76) [3](http://web.archive.org/web/20150307230621/http:/www.magwerk.com/mag.php?magazine=encore&language=en&issue=17&page=10) | [4](http://web.archive.org/web/20150307230621/http:/www.magwerk.com/mag.php?magazine=encore&language=en&issue=18&page=14) | [5](http://web.archive.org/web/20150307230621/http:/www.magwerk.com/mag.php?magazine=encore&language=en&issue=19&page=12)  \n [DINfont.com](http://web.archive.org/web/20150307230621/http:/dinfont.com/)\n\n",
  "author": "Stephen Coles",
  "time": "11 Apr 2007 — 11:52am",
  "uid": "103",
  "comments": [

  ]
}
