{
  "id": "32985",
  "title": "Font Management for Windows: Tried MainType?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I've recently received a kind email from Erwin Denissen at High-Logic filling me in on a few details of the latest release of MainType. I think he contacted me because I've been rather vocal on the topic of font managment for Windows ( [27616](http://web.archive.org/web/20101227071916/http:/typophile.com/node/27616), [30644](http://web.archive.org/web/20101227071916/http:/typophile.com/node/30644), etc.), and have, for the most part, been holding up Proxima's FontExpert as the best of the bunch (IMHO).\n\nAfter Erwin's email and a few messages back and forth, I have to say MainType is quite impressive. The interface, easily customizable, is similar to FontExpert and includes the panels you'd expect. The preview-text panel is nice in that you can simply type right in it: no saving text files or jumping to Options windows to create sample strings [although the preview doesn't pop in OT featured switches]. There's also a handy zoom panel, where clicking on a glyph in the Character pane displays an enlarged sample of that glyph in its own pane.\n\nThe Character map panel itself lists each Unicode grouping that is mapped in the font, providing access to what you're looking for in a nicely organized fashion. Aside from a small bug that Erwin has now fixed, the only thing missing is an option in the Character panel to view glyphs which are missing Unicode points (for example, Fedra Serif B Pro doesn't have it's small caps mapped, which means you can't see them in MainType at the moment); this is, of course, a weakness in such a font itself, but Erwin has mentioned he'll look into making these glyphs visible too.\n\nAuto-activation for InDesign/Quark is absent, but after raising a stink about this a while ago I've come to realize I don't really need it anyway. Handy, sure, but the implementation of the plug-in in FontExpert was clumsy (slow) and I ended up turning it off. Besides, I'm a freelancer, so if I can't keep track of my own projects I should probably take a holiday, not bitch about the fact that my software is lazy.\n\nI should also mention that my main irritation with FontExpert was a real lag in start-up, and the fact that the app didn't sit in the system tray made this worse because every start was a fresh (slow) start. MainType is much quicker on the draw, and you can either keep it active in the tray or shut it down to free up some processing juice.\n\nFor what it's worth, I'd strongly suggest those still hunting for the right manager for Windows to take a look: [http://www.high-logic.com/maintype.html](http://web.archive.org/web/20101227071916/http:/www.high-logic.com/maintype.html)\n\n",
  "author": "<a href=\"/web/20101227071916/http://typophile.com/user/3771\" title=\"View user profile.\">jason</a>",
  "time": "<br>",
  "uid": "3771",
  "comments": [
    {
      "time": "",
      "content": "been looking for a good font manager for windows for some time. On the mac i use lonoptype fontexplorer with no problems but on windows i just havent been comfortable with anything.\n\nI am going to try maintype & see how it goes.\n\nthanks jason.\n\n"
    },
    {
      "time": "",
      "content": "<cite>the only thing missing is an option in the Character panel to view glyphs which are missing Unicode points (for example, Fedra Serif B Pro doesn’t have it’s small caps mapped, which means you can’t see them in MainType at the moment); this is, of course, a weakness in such a font itself</cite>\n\nHello Jason, actually Fedra follows Adobe's glyph naming recommendations. No weakness in the font. Small caps are alternate glyph forms which should not have their own Unicode points; those that Adobe assigned in earlier OTFs are 'private use'.  \nThe way in which layout or font management software addresses these glyphs (via OT feature or via glyph palette) is a different story.\n\n"
    },
    {
      "time": "",
      "content": "[Have you seen this?](http://web.archive.org/web/20101227071916/http:/www.linotype.com/3321/freedownloadpc.html) It's Beta but free...\n\n"
    },
    {
      "time": "",
      "content": "Karsten, you know more about this sort of thing than I do, but by weakness I simply meant in relation to MainType; that is, Fedra Serif B Pro does not have Unicode points assigned to its small caps (or many of its ornaments, superior/inferiors, ligs, alternates, etc.), and thus such glyphs don't show up in a Unicode-only display such as the one built into MainType. Fedra is a wonderful font and I've corresponded with Peter as he was building the OT Pro version, but in this particular situation MainType isn't displaying all of the glyphs because many of them don't have Unicode tags. Thus, you're right, the issue here is simply to do with how font management applications pick and choose what to preview, not with any weakness in the font _as a font_.\n\nCarl, I've seen it, heard the horror stories, and am boycotting the thing after far too long a wait. Linotype dropped the ball on this, in my opinion, so free or not I'd rather support those who seem to care about Windows users.\n\n"
    },
    {
      "time": "",
      "content": "What horror stories? Is it buggier than you would expect for beta software?\n\n"
    },
    {
      "time": "",
      "content": "Well, sure, I was exagerating: there have simply been a few posts about frustrating issues, but the beta-warnings from Linotype alone are a bit of a joke. I realize they probably wanted to get _something_ out there, but (and, again, this is just my cranky opinion) it's simply too little too late. I am, of course, making an issue out of nothing: the software is free afterall, but the principle of the thing gets under my skin.\n\n"
    },
    {
      "time": "",
      "content": "Well, I've been experimenting with MainType, and I like it quite a bit. The interface is similar to FontExpert's, but it's less cluttered and more intuitive. A few features that are not working or missing:\n\n1. In the font properties pane, the kerning pairs line does not seem to work, at least for OTF's of a postscript persuasion. For Cambria, I get 14,000 kerning pairs. For Adobe Jenson I get none.\n\n2. I wish the sample window had a button that would apply kerning (much like FontExpert does).\n\n3. The scroll wheel on my mouse doesn't work inside the various panes.\n\nOther than that, it's terrific. I'm certainly going to dump Suitcase now.\n\n"
    },
    {
      "time": "",
      "content": "High-Logic's MainType is really nice. I have trialled all the other Windows options and MainType is by far the best. It's fast and easy to use, but very powerful.  \nThe main thing I like about it is that it doesn't try to 'organise' your fonts for you. If your fonts are already organised how you like, it will work with this.  \nYou can browse your active fonts or fonts in folders elsewhere on your computer. You get to see a sample preview which you can easily type over or revert to a number of presets, plus a full character map. You also get a choice between activating and permanently installing fonts.  \nHope this helps.  \nbtw I don't work for them, just seems that people have a lot of trouble finding decent, stable font managers for Windows!\n\n"
    }
  ]
}
