{
  "id": "33004",
  "title": "Bezier question",
  "forum": "Build",
  "tags": [

  ],
  "content": "Are there any resources out there for good bezier drawing guidelines? I notice that most fonts try to use orthogonal tangent points as much as possible. If I were to draw the curve pictured, which would be the better way to go?\n\n| Attachment | Size |\n| --- | --- |\n| [curve2.gif](http://web.archive.org/web/20070718033646/http:/typophile.com/files/curve2.gif) | 7.35 KB |\n\n [‹ InDesign CS2 required fonts in OSX](http://web.archive.org/web/20070718033646/http:/typophile.com/node/33077 \"Go to previous forum topic\") [FL5 component position ›](http://web.archive.org/web/20070718033646/http:/typophile.com/node/33052 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070718033646/http://typophile.com/user/4186\" title=\"View user profile.\">koleslaw</a>",
  "time": "<br>",
  "uid": "4186",
  "comments": [
    {
      "time": " 12.Apr.2007 11.47am",
      "content": "In theory the right, HOWEVER...\n\nFor a lot more see [http://www.logofontandlettering.com/](http://web.archive.org/web/20070718033646/http:/www.logofontandlettering.com/ \"http://www.logofontandlettering.com/\")\n\n"
    },
    {
      "time": " 12.Apr.2007 12.10pm",
      "content": "It took me some time to find it on the new site, but here it is. The official Type1 Specs:  \n [http://partners.adobe.com/public/developer/en/font/T1\\_SPEC.PDF](http://web.archive.org/web/20070718033646/http:/partners.adobe.com/public/developer/en/font/T1_SPEC.PDF \"http://partners.adobe.com/public/developer/en/font/T1\\_SPEC.PDF\")\n\nIt has all the information you need.\n\nRalf\n\n"
    },
    {
      "time": " 12.Apr.2007 12.26pm",
      "content": "Hinting plays a role in point placement for type unlike normal Adobe Illustrator drawing.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 6.36am",
      "content": "I’m making my drawings in Fontlab.\n\n"
    },
    {
      "time": " 13.Apr.2007 6.46am",
      "content": "You might find [this](http://web.archive.org/web/20070718033646/http:/typies.blogspot.com/2006/10/vector-drawing.html) and [this](http://web.archive.org/web/20070718033646/http:/typies.blogspot.com/2006/11/vector-drawing-mistakes.html) useful. (Typies)\n\n"
    },
    {
      "time": " 13.Apr.2007 7.17am",
      "content": "T Bones, the posts at ’Typies’ are useful only if you don’t take them too seriously, as they can also be seriously misleading. As one person notes in reply to your second link at the site, intermediate points and unbalanced handles may be desirable to get the right curve. You will find such things regularly in the fonts of masters like Matthew Carter, who says he doesn’t hesitate to break such ’rules’.\n\nAs I understand it—and my understanding is definitely limited—things like crossed handles are really the only things that are going to mess up your font in the sense of causing it to crash.\n\nThe other ’rules’ relate either to what is a ’good’ or ’sweet’ curve, or to hinting.\n\nOn the hinting issue, the Adobe rules explicitly say that you don’t need extrema points at something like the terminal on the e. Also there is something called ’flex’ hinting and also placement of ’blue zones’ that relate to drawing.\n\nI would be happy if someone would lay out what is really helpful and not in terms of what drawing rules in these three areas:\n\n1. What Bezier drawing mistakes may cause your font to not work or crash.\n\n2. What is advantageous for ’good’ curves. Here inevitably will be guidelines, rather than hard and fast rules.\n\n3. What rules will facilitate or harm hinting, both for roman and italic fonts.\n\nAs it is, it seems to me the ’rules’ are problematic, and it is not clear what is needed for what.\n\n"
    },
    {
      "time": " 13.Apr.2007 8.23am",
      "content": "Here is Galliard’s italic D to illustrate:\n\n ![](http://web.archive.org/web/20070718033646im_/http:/typophile.com/files/Galliard%20ital%20D_4686.gif)\n\nYou will notice the intermediate point at the bottom right. It’s not clear what makes a handle ’unbalanced’ according to De Gregorio, but here all the handles are unequal in length. The red arrows mark the four places where there are ’missing’ points at the extrema.\n\n"
    },
    {
      "time": " 13.Apr.2007 8.39am",
      "content": "It seems to me, from my but 3 years in the game, that italics have their own set of rules when it comes to extrema. It is just too damn difficult to get a smoothe transition from a straight to a curve with a slanted stem. You have to weigh the value of “The Rule” against the sweetness of the curve. It also helps a bit if italic glyphs are drawn above the 1000 unit limit. Since handles have to fall on the grid, doubling the resolution to 2000 or 2048 makes italics more aminable.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 8.49am",
      "content": "William,  \nYou will notice that the unequal arms of the handles of your Galliard D on the right would become close to equal if the “so called” extra point were removed from the lower right. This would of course add a bit of a bulge on the lower quadrant and probably why he put that point there to begin with. As an experiment, draw a circle and then delete the points at the left and right. This would give you a near circle drawn with only 2 points. Note where they end by placing a blue vertical guide where the arms of the handles extend. Now put an extrema on the right half where the red arrow says you need it. Now notice that the two arms of the 2-point circle that had stuck out well beyond the extrema before, now have shortened to well inside the extrema. This shows the effect of adding another point between two.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 9.06am",
      "content": "Two point circle with guide showing arm length\n\n ![](http://web.archive.org/web/20070718033646im_/http:/typophile.com/files/2pointCircle_6637.png)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 9.07am",
      "content": "Add point at right extremma and see arm length cut itself in half:\n\n ![](http://web.archive.org/web/20070718033646im_/http:/typophile.com/files/addExtrema_6234.png)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 9.09am",
      "content": "Now add “extra point” as in your Galliard’s italic D above and see unequal arm of right extremma point occurr:\n\n ![](http://web.archive.org/web/20070718033646im_/http:/typophile.com/files/addXtraPoint_4650.png)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 9.12am",
      "content": "Now notice where the bottom extrema’s right arm has cut itself in half (red guide) after adding the “extra point”.\n\n ![](http://web.archive.org/web/20070718033646im_/http:/typophile.com/files/armHlves_3964.png)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 9.16am",
      "content": "Notice that the curves have barely changed at all in any of the above example but adding or deleting points changes handle lengths. If a point is added mid-way between two existing points on a perfect circle, the handle length reduces by half.  \nBallancing lengths of arms must take into accounct the length of the adjacent arcs, not just the handle arm lengths.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 9.16am",
      "content": "William,\n\nBe aware that the outlines from ITC Galliard are not likely to have been drawn by Matthew himself. The design came out long before Adobe first digitized it. I’m not completely sure, but it might be true that Carter and Cone’s version of Galliard (with slightly longer descenders) is Carter’s handiwork. That would be one to examine. That, or more recent designs which he digitized himself.\n\nThe leftmost Font Audit arrow isn’t pointing to a missing extrema point, it’s flagging a curve constructed poorly; one handle is doing all the work and overextends the box or boundaries of a curve. The curve above (while missing an extrema point) is correctly constructed; the one at lower left is a good example of how not to make a curve. Notice how it bows in, narrowing the stem where it ought to be tapering out.\n\n"
    },
    {
      "time": " 13.Apr.2007 9.59am",
      "content": "Chris, the handles for the top arc of the D are also not equal. Also when I deleted the intermediate point, the arms were still significantly unequal. More to the point, when I first pasted a copy of the glyph into mask I could see that the new curve overshot the old one both ways: first moving inside, then crossing over and going outside.\n\nAnd if you’ve played with this kind of situation you know you “can’t get there from here”: you can’t get to the same curve with the nodes in those locations, and no intermediate point. So then you’d have to move the bottom node to the left, which would mess up the bottom arc leading into the serif.\n\nSo basically, Carter knew what he was doing: this was the only way to get the curve he wanted.\n\nJust checking the Roman of Galliard, he doesn’t seem to use intermediate points, but he does have many places with no extrema.\n\n"
    },
    {
      "time": " 13.Apr.2007 10.42am",
      "content": "Carl, I cross-posted with yours.\n\nInteresting that the bezier drawing might not be his—but I would be interested to learn definitely if this isn’t just what he wanted. I have heard Carter distaining the ’rules’ and the current font does work. (Can anyone check the Carter & Cone version?)\n\nAs you rightly point out, the lower left arrow of FontLab’s ’audit’ is flagging an ’unnecessary inflection’, not a missing extremum. It does flex in a way that many would not choose, but again I still wonder if Carter didn’t want it that way.\n\nBy the way Adobe Garamond’s italic Cap D also has an intermediate point at the same place, and four ’missing’ extrema. And certainly Slimbach is following or maybe setting the Adobe standard.\n\nSo far as I can remember, Slimbach never does a situation where one of the handles, if extended, would cross the other on the same curve—the ’unnecessary inflection’ situation. I don’t have the chutzpah to do this violation either, but I wouldn’t be surprised if Carter does.\n\n"
    },
    {
      "time": " 13.Apr.2007 11.14am",
      "content": "I doubt he would; based simply on the design; the orderly and regular stem and serif weights, and the rich bracketing of Galliard don’t call for such illegal situations. If you look at the letter at a large size, this dent in the lower left is very uncharacteristic of the design. See the corresponding Roman shapes, or other Italic cap stems. Keep in mind that this is one of the earliest typefaces to be digitized; done in the infancy of PostScript. These could be artifacts of that time.\n\nI very much believe that the outlines in ITC Galliard are not digitized personally by Carter. I can confirm this in the next few days.\n\n"
    },
    {
      "time": " 13.Apr.2007 11.22am",
      "content": "“you can’t get to the same curve with the nodes in those locations, and no intermediate point. So then you’d have to move the bottom node to the left, which would mess up the bottom arc...”\n\nWilliam you missed my point completely. Put the points wherever you “see” them. I was not saying that intermediate points were a no-no. I was just indicating that the “equaled arms” rule was not always to be followed. Actually, only when symetrical arcs connect, should it be done. I was trying to indicate that you cannot just write a rule without including all the factors. As a matter of fact, I have gotten to the point where I don’t bother with any such rules and just draw curves. When I am done, what is amazing is that I get very few little red arrows and know that those I can ignore because I know what is going on. I can just draw faster and more freely without overanalizing operational technique. I allow my eyes to be trained and then trust them.\n\n“Zen and the Art of Archery” is still a good book and teaches much more aboutdoing things than rule books with recipies for success or failure.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 11.31am",
      "content": "William,  \nIt is hard to explain online but I do alot of copying my glyph to the mask layer and then releasing points in the front layer and the adjusting the other arms before I replace the deleted points. Some time you might come over and I’ll show you what I mean.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 12.03pm",
      "content": "\\>William you missed my point completely.\n\nChris, sorry I wasn’t clear. I was addressing the ’rules’ of De Gregorio and not your statement.\n\nThe only thing of yours that I was taking issue with was where you said: “You will notice that the unequal arms of the handles of your Galliard D on the right would become close to equal if the “so called” extra point were removed from the lower right.”\n\nIn fact, if you do this one arm is 15% longer than the other, and the arms on the top arcs are even more different in length. I thought, wrongly it turns out, that you were defending the stuff about “imbalanced” handles in the De Gregorio piece.\n\nAs to how you play with the intermediate points and mask it sounds similar to what I do, but I’d love to come and watch you at work for a bit.\n\nLet me see if I can do a ’Muzzer’ on the De Gregorio piece. “It’s a load of old rubbish, mate! Take it out and bury it!”\n\n"
    },
    {
      "time": " 13.Apr.2007 12.13pm",
      "content": "There’s a way in FL to grab the curve itself, with shift held down, and slide both nodes around. It can be awkward, so it’s best used while zoomed in close. This is very useful in creating nuanced curves with fewer points. The general suggestion to have balanced handles is a starting point from which you can then refine curves greatly, while staying within the bounds of proper PS technique. If you ever need to replicate a curve with fewer points, this technique is excellent. It is what I use to get the curve I want in situations like the lower right Galliard D, where there’s an extra point. Only if the curve isn’t satisfactory will I then add a point.\n\nFor more about Galliard, check Typophile node 6833.\n\n"
    },
    {
      "time": " 13.Apr.2007 12.15pm",
      "content": "I think you still need a few lessons from Muzzer but I get the idea —I think he would have cut De Gregario to the quick in about half as many words and still had time for some of the brown stuff :-)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 1.16pm",
      "content": "This is C&C Galliard italic D. Quite a few more points than the ITC/Adobe version.\n\n ![](http://web.archive.org/web/20070718033646im_/http:/typophile.com/files/ccgalliard_D_5664.png)\n\n—Kathleen\n\n"
    },
    {
      "time": " 13.Apr.2007 1.29pm",
      "content": "Thanks Kathleen, that’s really interesting.\n\nIt seems to confirm Carl’s view that Carter didn’t do the ITC version’s Bezier curves. And also that the ’unnecessary inflection’ is a mistake.\n\nHowever, it even more seems to confirm that intermediate points can be a ’good thing’. I wonder whether this might have so many intermediate points because it was converted from a true type version?\n\n\\>to grab the curve itself, with shift held down, and slide both nodes around.\n\nI regularly in smoothing curves try grabbing a node with the shift on, and then slide the node with both handles fixed. Carl, are you saying that there is a way to grab two nodes and keep the four handles fixed? I don’t quite understand what you are describing, though it sounds interesting. When I click on the curve itself with the shift on it turns red and I can move the whole curve as a rigid piece. Is that what you mean?\n\n\\>to have balanced handles is a starting point\n\nNow you’re talking.\n\n\\>proper PS technique\n\nAh, that is the issue. I think that is what Koleslaw was asking about. Is there a good summary anywhere? Any wisdom you want to pass along?\n\nPS Congratulations, Carl, on the TDC award for Beorcana. Well deserved!\n\n"
    },
    {
      "time": " 13.Apr.2007 2.16pm",
      "content": "William,  \nYou have to grab the cuve segment and drag thus pushing one handle and pulling the other. This works just like Adobe Illustrator direct select tool when adjusting the curve. You do not select the handle or points, just the segment between. There is kind of a delicate touch you soon learn which moves the path without selecting it. Putz with it a few minutes, it will come to you.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 2.25pm",
      "content": "Thank you William, it’s very nice to have all that work recognized.\n\nI probably won’t be able to pinpoint exactly how you get this result, platforms, versions and all, but I’m on a Mac with FLS5.02. Without Shift down, you can click on a curve and drag, causing the BCP handles to swivel all over the place; this might be useful sometimes, but holding down shift constrains the handles in their current direction (typical constraint from the Shift key). The result is that both BCPs slide out (smoothly) from the endpoints, and depending on where you move your mouse, the curve adjusts dynamically. This is like what you describe above in Shift-selecting a single node, except you are touching the curve, and both nodes move. It feels rather uncontrollable, which is why I suggest zooming in on the curve; more fine control and a better view of the results. This is a situation where you want a copy of the existing outline in the mask layer to compare with, since the changes can be very subtle. Try touching the curve in different places; there’s a better place to grab that gives you more control - typically in the middle of the curve.\n\n"
    },
    {
      "time": " 13.Apr.2007 3.08pm",
      "content": "Thanks for the insight, everyone. I found Vag Rounded’s ampersand has the sort of curve that I needed. A quick outline in illustrator revealed that drawing #2 is the way to go. My original question was basically on priority. Fewer and angled tangents vs. more but orthogonal ones.\n\n ![](http://web.archive.org/web/20070718033646im_/http:/typophile.com/files/vagamp_5624.gif)\n\n"
    },
    {
      "time": " 13.Apr.2007 3.21pm",
      "content": "Got it Carl, thanks. When you shift + click on the curve and then let go of the click, then it lights up red and you can move it as a whole. But when you shift, then click on the curve and \\*hold down\\* the mouse button, then dragging the mouse (or trackball in my case) does as you say.\n\nAnd it looks useful—thanks!\n\nNot to sing the same old song, but I don’t think that’s in the manual :)\n\n"
    },
    {
      "time": " 13.Apr.2007 5.13pm",
      "content": "I came across the drag technique by assuming it would work like Illustrator and was pleasantly surprised that it did.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2007 10.55pm",
      "content": "_My original question was basically on priority_\n\nI’ve always worked to the general principle that fewer points are better – in any Postscript artwork, not just in glyph drawings – so I agree with Carl about _Only if the curve isn’t satisfactory will I then add a point._\n\nHaving said that, the C&C Galliard ’D’ that Kathleen posted was what I would _expect_ to see in terms of point number and placement, rather than the earlier ITC Galliard ’D’ that William posted – the comparison between the two is very informative.\n\nAnd I’ve lost track of the number of times I’ve heard art directors say ’but can’t you make the curve sweeeeeter...?’\n\n"
    },
    {
      "time": " 14.Apr.2007 9.03pm",
      "content": "Shouldn’t this be in the Build section?\n\n"
    }
  ]
}
