{
  "id": "33002",
  "title": "Letterspacing/kerning - how/what when why?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What is letterspacing?\n\nHow do you kern letters 'by eye'?  \nJim Krause in 'Type Index' on page 90 says to 'try focusing on sets of three (adjacent) letters at a time;'  \n'squinting helps accentuate \"dark spots\" and \"holes\" within the word-'\n\n'Thinking in Type' by Alex White on page 365 says to flip a headline upside down so it's shapes become noticeable or by imagining equal amounts of water poured between characters.  \nIn the example he gives he has the spaces between letters as grey on the x height of the letters. So you are supposed to compare unequal/strange shapes.  \nHe uses 'Avelas' as an example. I am not sure why he doesn't include the ascender or rather the parts of the letter that extends past the x height in the equal spacing calculation. Why does he not include the bowls and the negative space of the letters in the calculation (e.g. the 'A' has a space - the 'counter')? He provides a chart of most significant kerning pairs on page 364.\n\n'Av'  \nWould equal spacing be optically okay spacing? If you measured from the 'A' to the lowercase 'v' would that be the same for all letters?\n\n",
  "author": "joeking_tp",
  "time": "12 Apr 2007 — 10:18am",
  "uid": "18010",
  "comments": [
    {
      "time": "12 Apr 2007 — 10:38am",
      "content": "Try doing the Krause method by printing the work out and covering up all but the three letters you’re working on. Space them evenly. Slide the paper over one letter. Repeat. After you get them all, pull aside the cover sheets and tweak by looking at the letters as a whole.\n\n"
    },
    {
      "time": "12 Apr 2007 — 10:38am",
      "content": "I use the squinting method, by squinting you lose the ability to see colours and the eye uses rods which discern black, white and grey. The aim is that you don’t see dark or light groups but a generally even grey.  \nSince you cannot (well you can, but not easily in running text) alter the shapes of the letters you have to accept the counters and work on the spaces between them, all the while bearing in mind that you don’t want to affect the readability of your piece (so, for example, you have to accept that an rn combination is going to have an open space and by closing it you will raise the chances of it being read as an m).  \nOptically even does not equal mathematically even, so your Av sample wouldn’t hold true, for example, Av might need loosening while ve might need closing.  \nI suspect that practical experiment, as in so many things, is better than reading about it.\n\nTim\n\n"
    },
    {
      "time": "12 Apr 2007 — 11:31am",
      "content": "Spacing is actually a big subject, believe it or not. If you want to kern headings, you can test yourself on this site:\n\n[http://typography.art.udel.edu/index.html](http://web.archive.org/web/20131018015138/http:/typography.art.udel.edu/index.html \"http://typography.art.udel.edu/index.html\")\n\nIf you want to go deeper into the theory of spacing a font you can start with Briem's excellent site:\n\n[http://briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm](http://web.archive.org/web/20131018015138/http:/briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm \"http://briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm\")\n\n"
    },
    {
      "time": "12 Apr 2007 — 12:28pm",
      "content": "First read \"Zen and the Art of Archery\".\n\nChrisL\n\n"
    },
    {
      "time": "12 Apr 2007 — 1:37pm",
      "content": "Good link William Berkson.\n\nPhew!  \n'Know the rules, but trust your eyes  \nA large part of design is a succession of unconscious choices. We like to think of them as sensible, logical decisions. Not all of them are. We talk of the demands of balance and tension, of tradition and innovation. Strip away the fancy words, and what is left? Somebody’s saying “this I like.”'\n\n"
    },
    {
      "time": "12 Apr 2007 — 5:33pm",
      "content": "<cite>Somebody’s saying “this I like.”’</cite>\n\nThere is a lot of truth to this, but as with most things aesthetic, you need to consider the audience. What \"I\" like can matter to an artist, what \"the audience\" likes should matter to a designer.\n\nAs to letterspacing & kerning, Bill is right, fashion changes. But I would say that you cannot get good spacing (kerning or letterspacing) mathematically. Worse, I believe you can't use the same values for all sizes -- what works for a 10-point setting will not look right at a 36-point setting. Notice the word \"look.\" Best I can do; it is why you have to kern by eye (with the other eye on the audience).\n\n"
    },
    {
      "time": "12 Apr 2007 — 7:00pm",
      "content": "Charles, the quote is from someone else--Who?\n\n"
    },
    {
      "time": "12 Apr 2007 — 7:15pm",
      "content": "It is the last few words of Joe King's post, right above my replay. Guess I'm use to another board where, when you cite a previous poster, it fills it in for you.\n\n"
    },
    {
      "time": "12 Apr 2007 — 7:21pm",
      "content": "I know you were referring to Joe King's post, but you said 'Bill is right, fashion changes', I thought you were referring to the quote in his post, thinking it came from me. Now I'm just confused.\n\nIn any case, I am of the mind that there is ideal spacing for readability--with some latitude--and that variations in fashion is just because nobody really understands it fully.\n\n"
    },
    {
      "time": "12 Apr 2007 — 7:36pm",
      "content": "Oh, OK, sorry for the confusion. One of the links you provided:\n\n[http://briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm](http://web.archive.org/web/20131018015138/http:/briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm \"http://briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm\")\n\nchronicled changes in the spacing of Palatino, caused by changes in time & technology. As the old type is still available (somewhat), I take it as a change in fashion. I do agree with you about an ideal spacing for a particular font in a particular situation, but am also aware I come from a particular background, and am fast becoming a dinosaur.\n\n<cite> edit</cite>\n\nFor example, & from that site, I happen to think Tschichold was right; it is a bit misleading to compare a gothic font with Palatino.\n\n"
    },
    {
      "time": "12 Apr 2007 — 7:53pm",
      "content": "Well, Charles, I have a feeling we agree on this. I don't think that the tight spacing of caps is a good idea, when they are set as all caps. I think Briem feels the same way--which is what I gather from the tone of his comment.\n\nThe type designer has the problem that if the caps are spaced well for matching the lower case they are probably too tight ideally for the uppercase only setting. On the other hand, if they are set larger, in headings, and then they should be tighter than if smaller. So the usual decision is to design the spacing to match the lower case, and leave it to the type setter to adjust all caps. I don't know of a better solution.\n\n"
    },
    {
      "time": "13 Apr 2007 — 5:32am",
      "content": "\"...and leave it to the type setter to adjust all caps. I don’t know of a better solution.\"\n\nPerhaps a spacing adjustment for all caps in Opentype as a feature when the \"All Caps\" mode is selected? This would require that the user invoke the \"All Caps\" setting from the menu though, even if the characters were typed as all caps to begin with.\n\nChrisL\n\n"
    },
    {
      "time": "13 Apr 2007 — 5:39am",
      "content": "“First read ‘Zen and the Art of Archery’.”\n\nGreat recommendation. Things really started working for me when I learned to kern with a samuri sword.\n\n"
    },
    {
      "time": "13 Apr 2007 — 6:06am",
      "content": "Now that is cutting edge thinking :-)\n\nChrisL\n\n"
    },
    {
      "time": "15 Apr 2007 — 4:21am",
      "content": "‘squinting helps accentuate “dark spots” and “holes” within the word-‘\n\nI am not sure how blurring a hole (squinting would cause some blurring) would 'accentuate' the hole.\n\nI was looking at some 90pt (old style numerals - \"90\" looks ugly in this case?) text in photoshop with my head the usual distance away - about an arms length - and tried to squint. The letters didn't actually disappear into a grey blur or what photoshop would produce with gaussian blur.\n\n"
    },
    {
      "time": "16 Apr 2007 — 12:32am",
      "content": "\\>I am not sure how blurring a hole (squinting would cause some blurring) would ‘accentuate’ the hole.\n\nBlurring is indeed what you want, although the eye can discern black and white in low-light, mostly you see shades of grey, while losing the sharp edges where characters meet spacing. With a black on white headline by squinting you should be able to compare the lighter inter-letter grey patches and easily pick up areas whether they are dark or light. Depending on size and use, you would normally close up the large light areas and open up the dark areas so that the areas are equal(ish), bearing in mind that you don’t want to reduce (or increase) the inter-letter space to such an extent that it hinders reading. 90pt at arms length might be too close/big to get the effect.  \nIt doesn’t work for all, an alternative might be to look at it upsidedown.\n\n\\>“90” looks ugly in this case?  \nOr does it clearly differentiate between the numerals? Which is more important, harmony between characters or the message they carry?\n\nTim\n\n"
    },
    {
      "time": "17 Apr 2007 — 8:17am",
      "content": "Watch out for light/dark balance onscreen; it's not the same as on paper. Light-emitting, low-res monitors give a very different impression, halation is actually an issue. But you certainly can use photoshop, or your eyes, to approximate a blurred view of type, and that is useful for finding light or dark spots in the overall texture. Older techniques: print a sample large, then walk all the way across the room to look at it. Or, get a reducing glass and look through that.\n\nI think what's crucial about the idea of letting the eye be final arbiter, is that so many people prefer to rely on logical rules and formulas of one kind or another, and the more you rely on some kind of logic, the less you are seeing the actual fit of a typeface. The eye is what will be using the type in the end. It's like designing a chair. Coming up with an elaborate rationalization and concept for why a chair will be comfortable is no substitute for sitting in the damn thing to test it out. We use these tools with our bodies. The smoother, more comfortable they are, the easier it is to use them subconsciously and do our work (or reading or dining).\n\n"
    },
    {
      "time": "17 Apr 2007 — 9:04am",
      "content": "\"...so many people prefer to rely on logical rules and formulas of one kind or another, and the more you rely on some kind of logic, the less you are seeing the actual fit of a typeface.\"\n\nYou dang betcha Carl! Seein is believin.\n\nChrisL\n\n"
    },
    {
      "time": "18 Apr 2007 — 3:11pm",
      "content": "Oh, and remember t o a l w a y s l e t t e r s p a c e l o w e r c a s e.\n\n"
    }
  ]
}
