{
  "id": "33034",
  "title": "Comic Sans Travel Warning",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I received this email this morning and couldn't believe what I saw. The emailer formats all of their email in Comic Sans and today their forwarded message was very amusing.\n\n ![](http://web.archive.org/web/20140530005640im_/http:/typophile.com/files/comicsans_travelwarning_6285.gif)\n\n",
  "author": "sembacher",
  "time": "13 Apr 2007 — 9:15am",
  "uid": "18032",
  "comments": [
    {
      "time": "13 Apr 2007 — 9:38am",
      "content": "Haha maybe they thought it wouldn't be so scary in comic sans.\n\n"
    },
    {
      "time": "13 Apr 2007 — 10:32am",
      "content": "Then they wonder why there are terrorists... ;-)\n\nHaley, on the contrary, they want us to be scared. And singling out an Evil One (or even better, an Evil... Axis! Damn those Nazis all over again!!) is exactly how we're made to feel we're the Good Guys.\n\nhhp\n\n"
    },
    {
      "time": "13 Apr 2007 — 11:59am",
      "content": "If it was a fake email from the Department of Homeland Security the Comic Sans would have added authenticity.\n\n"
    },
    {
      "time": "13 Apr 2007 — 1:05pm",
      "content": "Whenever I get spam with the word \"Worldwide\" in the title, I get excited. But that's just because I named a typeface Worldwide.\n\n"
    },
    {
      "time": "13 Apr 2007 — 1:20pm",
      "content": "it would have really been scary with a bulleted list written in Sand...\n\n"
    },
    {
      "time": "13 Apr 2007 — 1:39pm",
      "content": "Do you think the terrorists use papyrus in their official emails?\n\n"
    },
    {
      "time": "13 Apr 2007 — 1:43pm",
      "content": " ![](http://web.archive.org/web/20140530005640im_/http:/typophile.com/files/paniclist_4471.jpg)\n\n"
    },
    {
      "time": "13 Apr 2007 — 2:40pm",
      "content": "<cite>it would have really been scary with a bulleted list written in Sand…</cite>\n\nOddly I once found a good use for Sand—it’s very similar to the wild, expressive lettering Toulouse Lautrec used in his posters for Aristide Bruant.\n\n"
    },
    {
      "time": "13 Apr 2007 — 3:12pm",
      "content": "bruant was famous for his insulting treatment of friends and patrons... could it be lautrec was returning the favor?\n\n"
    }
  ]
}
