{
  "id": "33037",
  "title": "20 years of type: what happened?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm writing an article on the development of graphic design the last 20 years for my magazine: the idea is to give a picture of the evolution of graphic design since early days of desk top publishing.\n\nType is of course a vital part of this. The digital font scene in 1987 was small, the number of fonts in a normal computer was microscopical, at least compared to today.\n\nMy main interests are the development of type technology, and the trends. On the tech side, Open Type has been the latest big leap; among the trendiest fonts during the last two decades are (maybe) Template Gothic and Interstate.\n\nTips, ideas and thoughts on these subjects are very welcome and helpful!\n\n",
  "author": "Textism",
  "time": "13 Apr 2007 — 12:32pm",
  "uid": "4006",
  "comments": [
    {
      "time": "13 Apr 2007 — 5:37pm",
      "content": "Can you get hold of a copy of _An A-Z of Type Designers_ edited by Neil Macmillan? The essay I wrote for this book covers the technical developments in font formats during this period (though mainly focusing on the post 1995 period).\n\n"
    },
    {
      "time": "13 Apr 2007 — 7:21pm",
      "content": "I don’t really see how Opentype could be considered the latest big technical leap; high-quality anti-aliasing has made digital type far more legible than it used to be. IMHO that’s much more important than OpenType, which has really just made typesetting easier.\n\nAnd if you’re going to cover the trendiest fonts of the last two decades, don’t forget Meta!\n\n"
    },
    {
      "time": "13 Apr 2007 — 11:20pm",
      "content": "Hi Per. I thought you were someone else! Are you aware of Dean Allen's site at [www.textism.com](http://web.archive.org/web/20131018200651/http:/www.textism.com/ \"www.textism.com\")?\n\nJames is right, the ClearType rendering is a more recent development than OT. There is a very good article on that 20 years of type theme at\n\n[http://www.aiga.org/content.cfm/the-digital-past-when-typefaces-were-exp...](http://web.archive.org/web/20131018200651/http:/www.aiga.org/content.cfm/the-digital-past-when-typefaces-were-experimental \"http://www.aiga.org/content.cfm/the-digital-past-when-typefaces-were-experimental\")\n\n(please remember to reference sources correctly in your article)\n\nGood luck!\n\n"
    },
    {
      "time": "14 Apr 2007 — 12:53pm",
      "content": "Hi, thanks for the tips!\n\nJohn: yes, I can and will get hold of a copy – thanks!\n\nJpad: obviously, I need to brush off the dust from my eyes :-) And thanks for mentioning Meta, which of course has its place among the trendiest!\n\nBen: No, Dean Allen is news to me, I believe. But never underestimate the subconscious mind ...  \nThanks for the Aiga article, it will come handy. And of course I'll remember to credit my sorces!\n\n"
    }
  ]
}
