{
  "id": "33045",
  "title": "guillemets in english texts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hello,\n\ni'm working on a catalog, which will have the german text and the according english translations side by side. i'm currently using «guillemets français» (respectively for german typesetting the »other« way round). for the english translations, however, it even does not seem to be an alternative option to do so.  \nbut before having different looking quotes, i'd like to ask, whether it is allowed by any reason to use these quotes in english texts.\n\nopinions?\n\n//alex\n\n",
  "author": "Plaintype",
  "time": "13 Apr 2007 — 5:00pm",
  "uid": "9326",
  "comments": [
    {
      "time": "13 Apr 2007 — 5:05pm",
      "content": "Using guillemets for English text is extremely rare - I've only seen it like twice.  \nBut I think it's also extremely NICE! Please don't give up on it.\n\nhhp\n\n"
    },
    {
      "time": "13 Apr 2007 — 6:14pm",
      "content": "Depends on what you mean by \"allowed\": is it suggested by any English-language style guide in North America? Nope.\n\nI think you might get some direction from looking at classical recording liner notes: as an example, I've pulled out my 1983 (remastered 1997) Teldec recording (0630-18952-2) of Handel's _Messiah_ that has notes in English, French, and German. The French and German quotes use guillemets as you've specified, but the English use \" -- the North American ones, not the British.\n\nWhile I will agree with Hrant that they look nice, you risk confusing your readers if you use them: FWIW, I wouldn't, but YMMV.\n\n"
    },
    {
      "time": "13 Apr 2007 — 6:52pm",
      "content": "I speak fluent French and am fairly comfortable in German, and therefore use the guillemets in both directions as you mentioned above (and in French, use them almost every day).\n\nHowever, even though I am very fond of those languages and **adore** using the guillemets for their shapes and the strong associations that they carry for me, I agree with Linda.\n\nIf you are addressing an audience that is not very familiar with European languages, they will be confused. If you are addressing Europeans, won't they _also_ be confused, because they will be expecting to see the “ ” symbols?\n\nTo my eye -- and thinking about how skillful design can support and underscore the language -- it seems perfect to set these things »auf deutsch« and “in English” to give each language its strongest flavor. Oder?\n\n"
    },
    {
      "time": "13 Apr 2007 — 7:04pm",
      "content": "If I wasn't interested in type, I would probably be confused when I saw guillemets in Dutch texts. I agree they usually look pretty nice, but I agree with Bruce.\n\n"
    },
    {
      "time": "13 Apr 2007 — 7:12pm",
      "content": "The only context where I would consider doing something like that seriously is if I was making a catalog of french or german stuff for sale and I was seeking to signal the french or german feeling of the good s in the text. And then only if I thought my audience was going to 'get' the joke. Actually if I was doing something maybe an art piece where I wanted to deliberately make the english major type crazy I would be all over the bird's feet then too. Or for a punk-emo-hystrionic CD/album cover.... But yeah, if I was really trying to sell stuff to americans... I wouldn't do it.\n\n"
    },
    {
      "time": "13 Apr 2007 — 7:12pm",
      "content": "This is really surprising to me. I did desktop publishing for 5 years at a translations company and worked with language producers from both Germany and France, among other countries. We **never** set German quotation marks using guillemets -- we used curly quotes (set in reverse order, of course).\n\nWe only used guillemets when typesetting French, never for German **or** English.\n\n"
    },
    {
      "time": "13 Apr 2007 — 7:17pm",
      "content": "It might be a good idea to ask the client what they prefer; particularly if you decide to go with the guillemets and do no not want to change them later.\n\n"
    },
    {
      "time": "13 Apr 2007 — 7:20pm",
      "content": "During the time (1976-77) that I spent studying with Friedrich Neugebauer, and assisting him on projects, he _always_ used the reverse guillemets. Personal preference, perhaps? A more Austrian usage? Something harkening back to ur-times?\n\n"
    },
    {
      "time": "13 Apr 2007 — 7:36pm",
      "content": "I didn't get into the \"allowed\" business because the way I think and live that tends to not work out for me. :-) But I was sort of implying that it's so extremely rare because people totally don't expect it. <cite>On the other hand</cite> how much confusion are you really liable to cause? Especially in a bilingual book - not your average boondocks lit. And if there is any confusion, would it last more than half a minute?\n\n\\> give each language its strongest flavor.\n\nI'm all for that, it's just that the English quotes are so lame when  \nit comes to: spacing; and differentiation with the apostrophe.\n\n\\> doing something like that seriously\n\nWell one of those places I've seen guillemets used in English is a pretty \"serious\" work: G Knuttel's \"The Letter as a Work of Art\", set exquisitely in De Roos Roman.\n\n--\n\nGuys, come on: live a little!\n\nhhp\n\n"
    },
    {
      "time": "13 Apr 2007 — 7:52pm",
      "content": "A couple of previous threads related to this topic, including a look at a highly  \nfascinating hybrid between quotes and guillemets, which I call quotemets...\n\n[http://typophile.com/node/13581](http://web.archive.org/web/20140127082855/http:/typophile.com/node/13581 \"http://typophile.com/node/13581\") \\_  \n [http://typophile.com/node/20061](http://web.archive.org/web/20140127082855/http:/typophile.com/node/20061 \"http://typophile.com/node/20061\")\n\nhhp\n\n"
    },
    {
      "time": "13 Apr 2007 — 7:54pm",
      "content": "The \"guys\" might want to, but frankly, us practical women would rather not p\\*ss off or confuse the readers. ;-)\n\nC'mon, Hrant, there's a time and a place for paddling upstream (and this ain't it!): that you've managed to cite a grand total of _one_ really specialized and/or serious book that uses guillemets in English proves to me that the \"rule\" is there for a reason, and the breakage thereof is the obvious (and needed) exception.\n\n"
    },
    {
      "time": "13 Apr 2007 — 8:43pm",
      "content": "For a long time the long s was a rule, too. But eventually a few important individuals synchronously decided to ditch it, and made English a little easier to deal with in the process. Don’t even get me started on the various indications of new paragraphs that have come and gone. Who knows, maybe swapping our quotes for guillemets is a shift whose time has come?\n\nOf course, if the clients are not willing to pay for it, the point is moot ;)\n\n"
    },
    {
      "time": "13 Apr 2007 — 8:59pm",
      "content": "Come on, Linda, that sort of mentality leads to total stasis - you know that.\n\nSure, you shouldn't try to change a \"rule\" on a whim, and there are better and worse places to try such a change, but this really seems like a decent place to nudge things in a better direction. For a designer it's almost a cultural responsibility to push the envelope, isn't it? Otherwise it's just another office job.\n\nhhp\n\n"
    },
    {
      "time": "13 Apr 2007 — 9:52pm",
      "content": "Guys can be practical, too, Linda. :-)\n\nWithout **any** innovation there **would** be stasis, Hrant, but this is a question of common practice, and of what 99% of the English-speaking and -reading populace expect.\n\nAnd can I quote a guy whose name gets thrown around a lot here on Typophile as part of some sort of quasi-biblical Triumvirate? ;-D\n\n_\"Single and double guillemets are widely used as quotation marks with the Latin, Cyrillic and Greek alphabets in Europe, Asia and Africa. Attempts to introduce them into North America have met with only slight success.\"_\n\n_--The Elements of Typographic Style, by Robert Bringhurst, version 3.1, page 310_\n\n"
    },
    {
      "time": "13 Apr 2007 — 9:56pm",
      "content": "I should also say that I really like the way they look for pullquotes and would tollertate them well there - but I would find them distracting is running text.\n\n"
    },
    {
      "time": "13 Apr 2007 — 9:58pm",
      "content": "By the way, having said what I said above, I love the idea of rounded guillemets and Hrant's cool name for them, quotemets.\n\n:-)\n\n"
    },
    {
      "time": "13 Apr 2007 — 10:02pm",
      "content": "I'm not saying _never_, but I just don't see this one going the way of the great auk anytime soon.\n\nThere just isn't a plausible rationale for it, for starters. Heaven forfend, I've pushed envelopes all my life, and not-so-long-ago, gave a client a total of 22 choices for using their address in publications. That there were slim rationales for ten of those, and only legitimate (and, I might add, legal postage regulation) choices for two, I merely shrugged when they picked \"something else.\"\n\n(That they couldn't even be bother to be consistent with their choice is what led me to bail out of what you might label as _just another office job._) :-)\n\nThere's bleeding edge, and then there's just plain dumb -- using guillemets for English is, right here and right now, the latter, IMO.\n\n"
    },
    {
      "time": "13 Apr 2007 — 10:10pm",
      "content": "Common practice is for common things. So I guess it depends on how common Alex's project is, or rather should be. That depends on a few things, not least Alex.\n\n\\> what 99% of the English-speaking and -reading populace expect.\n\nWell, 99% of readers don't expect a new font, but we still make them.  \nReally, it's not just what they expect, but what [we think] they need.\n\n\\> \"Attempts to introduce them into North America  \n\\> have met with only slight success.\"\n\nI'm curious, where would one see these attempts?\n\nEben, their lower degree of distraction (after the initial -and I feel short- period of... acostumbration :-) is the main reason I like them! In fact in the case of those quotemets I remember I actually didn't notice them at first - and I'm a font freak!\n\nhhp\n\n"
    },
    {
      "time": "13 Apr 2007 — 10:17pm",
      "content": "\\> There just isn’t a plausible rationale for it\n\nSure there is; in fact there are two - which I've mentioned:  \n1) No confusion with the apostrophe. Think of a plural possessive in quotes, like this: \"dogs'\". This is especially true for the British practice of using single quotes.  \n2) Better spacing - fewer distracting and ugly gaps, especially next to punctuation, like a period or comma. You know those funny typesetting rules that say a period or comma should be inside the quotes (even if it doesn't make content sense)? Those rules are in place to reduce crappy spacing. Plus fewer collisions, like after an \"f\".\n\nI wouldn't suggest changing something simply for novelty.\n\nhhp\n\n"
    },
    {
      "time": "13 Apr 2007 — 10:54pm",
      "content": "_\\> “Attempts to introduce them into North America  \n\\> have met with only slight success.”_\n\n_I’m curious, where would one see these attempts?_\n\nHe doesn't say, Hrant. That's part of the glossary entry for \"guillemet,\" in the back of the book. He goes on to say how they should be used in French, German, etc.\n\n"
    },
    {
      "time": "14 Apr 2007 — 5:28am",
      "content": "wow, so many posts over night. thank you for all the aspects you are bringing in.\n\nregarding eben sorkin's first post, i should mention, that it is an art catalog, which is actually selling nothing but the artist himself. it's a documentation of a rather weird performance. i added a slight historical touch to the design and that's also a reason, why i intend to use guillemets as quotes. although it is less common, it is an option, when setting text in german language (i guess, it is rather unsuitable for scientific texts or other highly official stuff).  \nin spite of hrant encouraging the use of guillemets in english language, i see, that for most english speaking people it seems so unfamiliar, that they will point fingers at me (\"don't you know, you mustn't use these quotes!\"). and, well, using hybrid quotes in the height of the minuscules would easily be even more confusing, wouldn't it? i guess, i stick to the official quotes, though, i might change my mind, if there showed up more \"references\" for the usage of guillemets in english literature.\n\n// alex\n\n"
    },
    {
      "time": "14 Apr 2007 — 7:15am",
      "content": "\\> they will point fingers at me\n\nThink carefully about who that \"they\" is, and  \nyou might realize They don't matter too much.  \nAnd some of those They will even say: \"Wow\".\n\nhhp\n\n"
    },
    {
      "time": "14 Apr 2007 — 8:09am",
      "content": "Since it is for an artist ( not selling chairs ) then I suddenly think you might have grounds for using them - depending on if they related to what the artists' work is about & depending on if you want the text to be integrated with the work in some way or if you want it to be transparent/supportive/subordonate etc. Does that make sense to you?\n\n"
    },
    {
      "time": "14 Apr 2007 — 9:37am",
      "content": "I think it also depends what the \"art\" is -- I've got a great T-shirt from a boutique press on Saltspring Island that has their name made up using alt and accented letters: I'd expect to see guillemets used on it!\n\nBut if it's not specifically/hardcore type-related, I highly doubt the intended audience would \"get it\"....\n\nIt's also a nice, and rather subtle, way of indicating which text to read, particularly if you're using one font for all three languages.\n\nMake things easy for the audience, and they'll be more likely to buy the art. ;-) Friend of mine teaches a class in marketing for artists, and I know that's one of his mantras....\n\n"
    },
    {
      "time": "14 Apr 2007 — 9:55am",
      "content": "\\> It’s also a nice, and rather subtle, way of indicating which text to read\n\nThat's a good point. A great, sad example of how language  \ndifferentiation can be totally shot is Emil Ruder's book.\n\nhhp\n\n"
    },
    {
      "time": "14 Apr 2007 — 10:13am",
      "content": "there is a text part, which includes preface, summary and explanation of the work, interview and the english translation of the script (dialogs).  \nthe original german dialogs are directly integrated into the image part, which has a collage-like look. quotes appear rarely in the script, but a few are in there. so it is basically the real text part, which, for instance, sometimes features extracts from the script.\n\n// alex\n\n"
    },
    {
      "time": "14 Apr 2007 — 4:41pm",
      "content": "Beacause the quotes will appear intermittently and are not integral to what your doing I think that the choice to use the feet won't look all that deliberate. If you were using a short quote from the artist at the top of every other page then it might seem deliberate. Do you see what I mean? So yeah, I would now say just use the english style quotes.\n\n"
    },
    {
      "time": "14 Apr 2007 — 7:58pm",
      "content": "Of all the gazillion of lines of type I've designed / set, I've only used guillemets with English once. It MADE the piece. I just wish I had a tear sheet of it.\n\nMaybe this is one of the two things Hrant has seen. Circa 1990; cannot recall the product name, but I do know it was an ad for a shampoo made by a midwestern company. The main feature of the ad was a sultry dame on a bar stool, all legs, smirk, and hairdo. The art director had succeeeded [by some lights] in giving her a \"European\" look, but we struggled with the type for days.\n\nFinally, switching to Friz Quadrata, I set a version with guillemets around her sassy words. I saw the success immediately, but we did play around with the direction of the guillemets, pointing them in different directions in different versions. This, of course, did not matter; it was a short ad in English, and the assumption was that readers would not care about these matters, but would recongize the asserted European-ness of the product, and then be aware that their sex lives would be remarkably enhanced if they scrubbed with this stuff.\n\nI did have to instruct several levels of art directors, creative directors, and client managers just what the hell those funny marks were, though.\n\nThat's one instance where this can work. Otherwise, I'm with the cautious ones -- in general.\n\npowers\n\n"
    },
    {
      "time": "14 Apr 2007 — 8:15pm",
      "content": "Will, I'm pretty sure I missed that shampoo ad. :-)  \nIt sounds tantalizing though! You know, I mean those stems and bowls...\n\n\\> I did have to instruct ...\n\nGood insight (if pretty sad).\n\nhhp\n\n"
    },
    {
      "time": "14 Apr 2007 — 8:32pm",
      "content": "But not terribly surprising, unfortunately....\n\nWish I had caught that ad too, Will -- FQ is one of my fave faces.\n\n"
    },
    {
      "time": "15 Apr 2007 — 8:50am",
      "content": "If it's only going to be you doing it on one job then it's probably not a good idea. Readers will be confused.\n\nHowever, guillemets do look better and rules are made to be broken. If you can recruit some other designers — like people here — form a group, issue a press release about why you're doing it and then all of you do it on all your design jobs from now on it might become a major shift in design style. Or a curiosity in the history of type. But isn't this how the long s died?\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "15 Apr 2007 — 9:12am",
      "content": "I think outward-pointing guillemets are esthetically and communicatively the best kind of quotes:\n\n(1) As so many of you have said, guillemets beat the so-called inverted/raised commas because they leave no ugly gaps. Hrant’s point about avoiding confusion with the apostrophe may be communicatively even more important.\n\n(2) For maximum clarity, opening and closing quotes should point in a different direction. It may seem odd that I mention this, but in Finnish composition we have this unfortunate convention – it may come from Sweden – of all the quotes pointing right (i.e. either »this way» or ”this”).\n\n(3) The outward direction looks better, the quotes – especially when they are guillemets – enclosing the quoted matter in the same way as parentheses.\n\nI don’t think things like this should be considered part of the language per se. They have little to do with the grammatical system; they are arbitrary conventions (though certainly part of the literary tradition and culture of each country).\n\nHaving said all this, would I have the guts to use guillemets in English text? Probably not. I considered it when doing my own thesis (in English), but ended up using the traditional forms.\n\n"
    },
    {
      "time": "15 Apr 2007 — 11:14am",
      "content": "thanks again for the great participation.  \ni'm still double-minded, however, it's more likely, that i'm going with the “traditional” quotes after all. but don't stop the discussion right now, it's very interesting to get to know all the different opinions.\n\n// alex\n\n"
    },
    {
      "time": "15 Apr 2007 — 11:43am",
      "content": "George, brilliant idea. I would certainly be a signatory to such a thing, and would love to even write a paragraph or two in its promulgation. Not being an actual font <cite>user</cite> however :-) I wouldn't try to carry the torch myself here even though I'm so vocally supportive of the idea. So if a real font user starts it, I'll jump in.\n\n\\> opening and closing quotes should point in a different direction.\n\nAgreed. On the other hand I'm no fan of the ductally imposed vertical flipping of the opening/closing quotes. What I call \"rationalist\" quotes (some others call it mirrored) such as used by Licko and Carter (the latter mostly in his screen fonts) are generally superior in my mind. And there are in fact long-standing historical precedents, for those who need that sort of thing: the French curiosity I showed in that other thread; and much of what ATF produced\\* around a century ago.\n\n\\* Probably motivated by the pantograph.\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2007 — 12:41pm",
      "content": "George wrote:\n\n_If you can recruit some other designers — like people here — form a group, issue a press release about why you’re doing it and then all of you do it on all your design jobs from now on it might become a major shift in design style. Or a curiosity in the history of type._\n\nMy guess is the latter. Not that this would be the first time that the \"best\" solution isn't the one that gets adapted by the masses, and it could keep company with Esperanto, the Dvorak keyboard, and BetaMax....\n\n"
    },
    {
      "time": "15 Apr 2007 — 12:57pm",
      "content": "Linda, this is no different than the \"masses\" keeping on  \nwith Times and Comic Sans - but we still make new fonts.\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2007 — 4:23pm",
      "content": "Well, as Mencken wrote, \"No one ever went broke underestimating the intelligence of the American public.\"\n\n"
    },
    {
      "time": "15 Apr 2007 — 6:26pm",
      "content": "Linda wrote:\n\n_My guess is the latter. Not that this would be the first time that the “best” solution isn’t the one that gets adapted by the masses, and it could keep company with Esperanto, the Dvorak keyboard, and BetaMax…._\n\nGee, I was hoping a bunch of folks would jump in here and support this. I imagined this would be the beginning of a sea change in punctuation. Guess not.\n\nWhich made me think of:  \nIn the 1930s Jack Northrop developed a flying wing aircraft, the YB-35, which morphed into the YB-49 that first flew in 1948. Turned out no one could fly the thing due to it's instability. There were several crashes and the program was canceled. When the Air Force developed the B2 Stealth Bomber which was based in part on Northrop's work he was invited to see the B2 fly. His idea was sound, it just took time for the technology and thinking to catch up to Northrop. Incidentally the wing span of the B2 matches the YB-49. He was that right about it.\n\nSo I have my fingers crossed on the guillemets. Alex may be a harbinger.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "15 Apr 2007 — 6:40pm",
      "content": "_He was that right about it._\n\nWell, eventually.\n\nThe Canadian government developed an incredible fighter plane in the late 1950s that blew everything else away, and the Avro Arrow was not only cancelled, but virtually every part or model was dismantled, destroyed, and the engineers were threatened, all because the U.S. government wasn't keen about someone else having a better plane than the F-series.\n\nThere is, BTW, a documented set of plans and a prototype of that engine was later used to power the Concorde, but I don't expect my government to roll Arrows off an assembly line any time soon.\n\n"
    },
    {
      "time": "15 Apr 2007 — 6:56pm",
      "content": "_The Canadian government developed an incredible fighter plane in the late 1950s that blew everything else away, and the Avro Arrow was not only cancelled, but virtually every part or model was dismantled, destroyed, and the engineers were threatened, all because the U.S. government wasn’t keen about someone else having a better plane than the F-series.  \nThere is, BTW, a documented set of plans and a prototype of that engine was later used to power the Concorde, but I don’t expect my government to roll Arrows off an assembly line any time soon._\n\nWho was it who said the only causes worth fighting for were lost ones? So lets all get together and start building Arrows. There's gotta be a market in the private sector. Know any rich folks who want to invest?\n\nAnd arrows look like guillemets don't they? Or two flying wings in formation. Or. . .\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "15 Apr 2007 — 7:01pm",
      "content": "George, how many does one need simply to start something?  \nI figure two. It's looking like we already have three.\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2007 — 8:01pm",
      "content": "I'm game to use them sometime soon in English, especially if it's a text that exists _only_ in English so there's no confusion.\n\nAnd by the way, here's a long-standing use of these shapes.\n\n ![](http://web.archive.org/web/20140127082855im_/http:/typophile.com/files/citroen-logo_4598.gif)\n\nIn the first years of the twentieth century, André Citroën started out with a company that made gears with herringbone-patterned teeth. My simplistic understanding is that these gears will not lose/waste as much energy as teeth with simple horizontal teeth, but require greater precision in manufacturing and alignment. Once he got into the business of making cars he retained the shapes of his gear teeth as a symbol for the Citroën car business. As you can see, though, a realistic representation of the parallel gear teeth was supplanted by guillemets.\n\n"
    },
    {
      "time": "15 Apr 2007 — 8:04pm",
      "content": "Hrant, if you're counting me in that \"three,\" you're very mistaken.\n\nRead [this](http://web.archive.org/web/20140127082855/http:/nobelprize.org/nobel_prizes/economics/laureates/2002/kahneman-autobio.html) -- in the immortal words of that brilliant philosopher Kenny Rogers....\n\n_You've got to know when to hold 'em  \nKnow when to fold 'em  \nKnow when to walk away  \nKnow when to run._\n\nIf there's one thing I've learned over the years, it's which battles that are worth fighting and which are worth walking away from: this is the latter....\n\n"
    },
    {
      "time": "15 Apr 2007 — 8:18pm",
      "content": "Perfect example of the handsome qualities of the guillemets: Just now I went to my own site to grab the Citroën logotype, and I noticed the juxtaposition of guillemets and conventional anglo-american quotes in paragraph 4. The guillemets certainly look nicer!\n\n[http://www.brucekennettstudio.com/citroen.html](http://web.archive.org/web/20140127082855/http:/www.brucekennettstudio.com/citroen.html \"http://www.brucekennettstudio.com/citroen.html\")\n\nThey appear again in paragraph 6 in an English sentence -- since this page has been up for a while, can I claim to be an early adopter?\n\n"
    },
    {
      "time": "15 Apr 2007 — 8:23pm",
      "content": "Let me hasten to add, though, in support of what several of us were saying above, that paragraph 4 also illustrates how surrounding the French with guillemets and the English with quotes gives an instantaneous extra measure of differentiation between the two languages. In something like the brochure with German and English quotes, that could be a great help.\n\n"
    },
    {
      "time": "15 Apr 2007 — 8:40pm",
      "content": "\\> if you’re counting me in that “three,”\n\nThat would be crazy of me, since you've been the most vocal opponent here!\n\nBruce, using guillemets for French (quoted) content in non-French text I find very tasteful, and the least we can do. I've done it myself once - see frame 14 here:  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20140127082855/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    },
    {
      "time": "16 Apr 2007 — 5:11am",
      "content": "Ah this is interesting. I have a book on Mies van der Rohe at home that is in both English and German. Both the German and English texts are all set with guillemets, _French_ style. It looked a little odd at first but the meaning was quite clear.\n\n/hunts for book\n\nAha: [http://tinyurl.com/yrccow](http://web.archive.org/web/20140127082855/http:/tinyurl.com/yrccow \"http://tinyurl.com/yrccow\")\n\n(Click forward to 'Glass skyscraper on a polygonal plan' to see it)\n\n"
    },
    {
      "time": "16 Apr 2007 — 5:28am",
      "content": "\"using guillemets for French (quoted) content in non-French text I find very tasteful\"\n\nHrant, I hate to be such a killjoy, but in keeping with my comments about this sort of thing not really being part of the language, I would generally prefer each publication to use just one type of quotes, even if it has several languages (whether as parallel texts or more freely mixed).\n\nAdd (after seeing the previous post): yes, just as in Aegir's example.\n\n"
    },
    {
      "time": "16 Apr 2007 — 5:32am",
      "content": "great find, aegirthor.  \nhowever, i don't understand, why he used the wrong direction of the guillemets for german typesetting. but maybe <cite>this</cite> is, what could be confusing for readers, rather than heaving this or that type of quotes consequently. they can easily read both texts with a view and then get wondering about, why they point in two different directions, respectively why they are different at all. in this case, i would have preferred inward pointing guillemets for both languages. at least, the german part would be correct then.\n\n// alex\n\n"
    },
    {
      "time": "16 Apr 2007 — 7:36am",
      "content": "Aegir, great find.\n\nOlli, for a <cite>bilingual</cite> text I agree that reducing the types of quotes is a good idea.\n\nAlex, how often does a reader read both texts?  \nRemember, people generally read to efficiently get at the content.\n\nhhp\n\n"
    }
  ]
}
