{
  "id": "33056",
  "title": "The Power of the Quote",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The quote is a tricky, powerful “shape-shifter” of a character, with abilities way beyond its formal uses for marking verbal expressions, titles, etc. We’ve all seen it used to mean “not exactly”, or even “not really, but this way you can’t sue me”, when a product is advertised to do something it doesn’t. I’ve also seen it used to mean “not exactly but there’s something to it”: during a visit to the Cayman Islands I saw a car rental place with a large “JEEP ONLY” sign, in quotes; it actually had other vehicles for rent too, but/so wanted to succinctly state: “This is the place for renting a jeep, but we have other stuff too”\\*. And during this past spring break I saw the quote used thus:\n\n ![](http://web.archive.org/web/20080924105601im_/http:/www.typophile.com/files/quotes_s_4715.jpg)\n  \n\\_  \nCan you guess what it’s doing there?  \n\\_  \n\\* Some years later I saw a similar thing at a motorcycle rental place in Hawaii: “HARLEYS ONLY”.\n\n—\n\nPlease post other example of the quote doing something  \nbesides what it’s “supposed” to. (And there it is again!)\n\nhhp\n\n [‹ Help please!](http://web.archive.org/web/20080924105601/http:/www.typophile.com/node/33090 \"Go to previous forum topic\") [Vine to the Trellis ›](http://web.archive.org/web/20080924105601/http:/www.typophile.com/node/33129 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924105601/http://www.typophile.com/user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": " 14.Apr.2007 11.25am",
      "content": "Quotes used for “emphasis” are funny every time.\n\n"
    },
    {
      "time": " 14.Apr.2007 11.38am",
      "content": "It’s funny, but here it’s also cool because there’s (probably) no other way to do it. Except letterspacing, but these guys aren’t German... In fact some years ago they were <cite>shooting</cite> Germans around there. :-)\n\nhhp\n\n"
    },
    {
      "time": " 14.Apr.2007 11.42am",
      "content": "_Can you guess what it’s doing there?_\n\nWell, they started out in all caps, so when it came time to emphasize a word, they were stumped. Setting it in lower case wouldn’t look right, and they didn’t have a bold or italic font, or underlines [edit: or as hhp notes, maybe didn’t think of letterspacing], so quote marks did the trick.\n\nSomewhat related, \\*certain\\* Typophilers use asterisks for emphasis — what’s with that?\n\n"
    },
    {
      "time": " 14.Apr.2007 12.24pm",
      "content": "I used asterisks heavily on Typo-L, and still do when when stuck without formatting (although sometimes I prefer all-caps these days). In fact I’ve noticed that sometimes the discussion list software will automatically make a word between asterisks bold.\n\nhhp\n\n"
    },
    {
      "time": " 14.Apr.2007 12.35pm",
      "content": "Here’s my favorite commentary on the matter, from the drunken Irish author Garth Ennis. Link goes to a PDF that expounds further, using language not remotely appropriate for posting directly into this forum.\n\n[\n ![](http://web.archive.org/web/20080924105601im_/http:/www.typophile.com/files/quotes1b_5562.jpg)\n](http://web.archive.org/web/20080924105601/http:/www.jpad.biz/pdfs/quotes.pdf)\n\n"
    },
    {
      "time": " 14.Apr.2007 1.34pm",
      "content": "Certain markup filters such as [Markdown](http://web.archive.org/web/20080924105601/http:/daringfireball.net/projects/markdown/) and [Textile](http://web.archive.org/web/20080924105601/http:/www.textism.com/tools/textile/) automatically convert words between asterisks.\n\n"
    },
    {
      "time": " 14.Apr.2007 1.36pm",
      "content": "Maybe he’s making a „kniebuiging”?  \nNodding his head gently; pointing at ‚non-verbal-communication’? And why double-qoutes? Why not single? Or «German» or ‹Swiss› or Maybe French? I can’t remember?\n\n"
    },
    {
      "time": " 14.Apr.2007 1.41pm",
      "content": "There’s a sushi restaurant on my block that used to be a Chinese restaurant. They have a sign out front saying\n\n“Chinese Food” for take-out and delivery only.\n\nIt makes me wonder what they’re trying to pass off as chinese food...\n\nEven tho I hate underlining, wouldn’t it be more appropriate for emphasis than quotes?\n\n"
    },
    {
      "time": " 14.Apr.2007 1.43pm",
      "content": "Haha!\n\nWhere was this published? Great for educational purposes, there’s nothing more credible than comics.\n\n"
    },
    {
      "time": " 14.Apr.2007 3.11pm",
      "content": "I think the fingers making quote marks in the air while a snearilly spoken term is said demonstrates the most graphic form of this—as in some one saying, The Bush Center for “Intelligence”.\n\nChrisL\n\n"
    },
    {
      "time": " 14.Apr.2007 4.11pm",
      "content": "_Where was this published? Great for educational purposes, there’s nothing more credible than comics._\n\n_Alamo_, the ninth and final collected volume of the comic book _Preacher_. I think that I may have to post this one in the graphic design studios at school.\n\n_Even tho I hate underlining, wouldn’t it be more appropriate for emphasis than quotes?_\n\nYes, but creating legibility issues is worse in some circumstances, especially signage.\n\n"
    },
    {
      "time": " 14.Apr.2007 4.37pm",
      "content": "Thanks!\n\n"
    },
    {
      "time": " 14.Apr.2007 5.30pm",
      "content": "I always thought the non-sarcastic use of emphatic quotes was the punctuation-equivalent of a misspelling or grammatical error. However, it is so common, and not condemned to the same degree. Lately, I am starting to suspect that there may be something more historical to it.\n\nNevertheless, with all the uses they already have, and visual similarity to primes, I think enough is enough. I am all for little \\*asterisk\\* stickers that I can slap over “abused” quotation marks.~\n\n"
    },
    {
      "time": " 14.Apr.2007 5.47pm",
      "content": "Ah, a Typographic Decency Vigilante! :-)\n\nhhp\n\n"
    },
    {
      "time": " 14.Apr.2007 10.01pm",
      "content": "Even “better” than the inappropriate quotation marks - when they’re done with the “inches symbol!”\n\n"
    },
    {
      "time": " 14.Apr.2007 10.48pm",
      "content": "Here in Mx I see quoted words for emphasis all the time on hand made signs at markets, automotive workshops and diners along with underlining and terrible ortography... they can be funny as when a sign advertises «”original” audio cd’s»\n\nHéctor\n\n"
    },
    {
      "time": " 15.Apr.2007 2.42am",
      "content": "I vividly remember an ’”Eggs” for sale’ sign a while back. Still wondering what they were selling to this day.\n\nFor the few Dutchies here:\n\n[http://www.gummbah.nl/media/Foto%20van%20de%20maand/Natuurlijk.jpg](http://web.archive.org/web/20080924105601/http:/www.gummbah.nl/media/Foto%20van%20de%20maand/Natuurlijk.jpg \"http://www.gummbah.nl/media/Foto%20van%20de%20maand/Natuurlijk.jpg\")\n\nCourtesy of gummbah.nl\n\n"
    },
    {
      "time": " 15.Apr.2007 7.35am",
      "content": "«”original” audio cd’s»\n\nThat sounds something like the “original” Rolex watches you get on the streets of New York from guys with brief cases :-)\n\nChrisL\n\n"
    },
    {
      "time": " 15.Apr.2007 7.46am",
      "content": "I wish I could find one of my favourite old Dilbert cartoons, where Anne L. Retentive, the editor, spots a typo and goes into a comma — I had to explain both the typo and the sentiment to many people.\n\nWhere one can use emphasis tags, like here, I prefer them, but if I want to emphasize something elsewhere, I will use asterisks, as, has been noted above, there are programs that will convert them to bold.\n\nAnytime I use quote to emphasize, I invariably put _soi-disant_ before it. ;-)\n\n(And don’t get me started with carved wooden signs like “The Carson’s”....)\n\n"
    },
    {
      "time": " 15.Apr.2007 11.48am",
      "content": "\\> “Chinese Food” for take-out and delivery only.\n\nThose are Japanese quotes. As a translator I see them all the time.  \nI won’t bore you with the details, but basically this is one way that people used to thinking in a topic-comment language try to make up for English’s lack of ways to formally mark the topic.\n\nThey just want everyone to be very clear that this sentence is about Chinese Food.\n\n"
    },
    {
      "time": " 16.Apr.2007 2.41am",
      "content": "That made me recall another one: In Max Goldt’s book _Die Kugeln in unseren Köpfen_, there is a photo of a run-down snack stand and its sign saying _»Fruchtsäfte« und »Appetithappen«_ (_“Fruit juices” and “Tasty Bits”_). Goldt captioned the image with “This stand had to close, because nobody demanded so-called fruit juices and pretended tasty bits” …\n\n"
    },
    {
      "time": " 16.Apr.2007 3.14am",
      "content": "One of my favourite throwaway gags in the Simpsons is a sign outside the sports arena that says “no” gambling.\n\n"
    },
    {
      "time": " 16.Apr.2007 5.01am",
      "content": "Though you are all showing a great sense of humor about the quotes - I doesn’t sound like anyone here has set type hand in hand with an editor - trying to meet deadline.\n\nA decent editor would take those quotes (I am speaking from interior book design) and make them _Italics_ for the emphasis.\n\nRight now, I am laying out a story on Duesenbergs - and the author refers to them as “Duesys” (hmmm should that be Duesies?) and yes, in quotes - but when the article is published the readers shall see it in Italics...\n\nOr are we just picking on the word that’s has the quotes around it...\n\nAnd I love the inch-mark remark. When the New York Times back in 1987 printed a full page ad - and the quote marks were inch marks — everyone at TANY (remember them? Typographic Association of New York) commented how it was the end of the professional typesetting age... and yes, they were right.\n\nMeanwhile, I always loved the oversized quotes found in Zapf Dingbats - they really get the quoted message across.\n\n"
    },
    {
      "time": " 18.Apr.2007 12.33am",
      "content": "My sister sent me this “link” years ago:  \n [http://www.juvalamu.com/qmarks/](http://web.archive.org/web/20080924105601/http:/www.juvalamu.com/qmarks/ \"http://www.juvalamu.com/qmarks/\")\n\nThis one’s “good” too:  \n [http://www.flickr.com/groups/quoteabuse/pool/](http://web.archive.org/web/20080924105601/http:/www.flickr.com/groups/quoteabuse/pool/ \"http://www.flickr.com/groups/quoteabuse/pool/\")\n\nDavid Thometz\n\n"
    },
    {
      "time": " 18.Apr.2007 6.50am",
      "content": "David, super stuff! Thanks.\n\nhhp\n\n"
    }
  ]
}
