{
  "id": "33066",
  "title": "Digital Dinosaurs",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m getting rid of some things that were once thriving contributors to my studio but are now just dead weight. One thing that will never go away is my Precision Type Reference Guide. I only hope I don’t completely wear it out. However I have two of the Precision Type Fontlink CDs in Macintosh version. Is there any use for those at all?\n\n [‹ myriad pro makes me mad!](http://web.archive.org/web/20080210013659/http:/www.typophile.com/node/33125 \"Go to previous forum topic\") [Lubalin Graph Alternates ›](http://web.archive.org/web/20080210013659/http:/www.typophile.com/node/18889 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080210013659/http://www.typophile.com/user/9700\" title=\"View user profile.\">BlueStreak</a>",
  "time": "<br>",
  "uid": "9700",
  "comments": [
    {
      "time": " 15.Apr.2007 4.20pm",
      "content": "You could always try donating them to your favorite design museum. So many firms trash or lose their discs over time that I doubt there are a lot of museums with good collections of the stuff. Stanford just accepted a collection of 28,000 video games, so somebody must want old type stuff.\n\n"
    },
    {
      "time": " 19.Apr.2007 7.24am",
      "content": "Thanks for the suggestion JP. I found a museum that is interested. But they say I need to bury these elaborate CDs in a landfill so an archaeologist can discover them in a couple of hundred years. I only hope they find these mixed in with the millions of AOL CDs already in the garbage dump.\n\n"
    },
    {
      "time": " 19.Apr.2007 7.33am",
      "content": "I hope that St. Bride is collecting this stuff. It would be a shame for all the early digital fonts to eventually be lost because everybody decided that tech was so ubiquitous that it was pointless to hold onto their collections.\n\n"
    },
    {
      "time": " 19.Apr.2007 8.29am",
      "content": "What do I do with my Adobe Type floppy disks from 1986? They came in a very big plastic case with a speciman book. There were usually 2 floppies inside one screen and one printer. Those 400k floppies were just filled with space you know:-)\n\nChrisL\n\n"
    }
  ]
}
