{
  "id": "33065",
  "title": "ISBN sticker",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am cooperating on a online magazine publishing site project and i've been asked to design the identity. It's been going okay so far with the logo etc, but now I have to do the ISBN-sticker. I don't need to add a barcode, because the magazines will not be available in stores, they will only be available online. the only things i need is the ISBN code, the name of the artist, the name of the magazine/booklet, the website, the logo, the number of the magazine. The sticker will be given to the artist to place anywhere they want on the cover of the magazine. It will be about 3 centimeters big.  \nI've been doing some tests, but haven't come across the best solution so far. I thought if I would post the last test i did here, you guys could maybe give some critiques on it. The people i'm working with are looking for something that is not so 'designy', but they want it to look colourful and nice..  \nhere is a little bit about the project:\n\n(ABOUT XYM ONLINE PUBLISHING\n\nXYM IS A WEB-BASED PROJECT BRINGING YOU THE LONGEST SHORT-TERM TEMPORARY AND TRANSIENT YET CONSTANT DATABASE OF POSSIBILITIES TO DOWNLOAD, PRINT, BIND, STAPLE, FOLD AND READ EACH INDIVIDUAL PORTABLE DATA FORMAT (.PDF) ARTISTS PUBLICATION.\n\nPRESENTING A WIDE RANGE OF ARTISTS WITH A MULTI-DISCIPLINARY CONTENT, EACH ISSUE IS SPECIFICALLY CREATED FOR THE PROJECT, WHERE ONE ARTIST BECOMES THE AUTHOR AND EDITOR OF A HISTORY MAKING FREE-DOWNLOADABLE PDF FILE WITH A RAPIDLY NEARING BEST BEFORE DATE AND INCUBATION AS ITS' FUTURE. ACTIVATED ON ITS MOMENT OF RELEASE ON XYM, INIVIDUALLY VARYING BUT AT THE SAME TIME PERMANENT COUNTDOWN PERIODS ARE PROGRAMMED TO EACH PUBLICATION WITH INNUMERABLE POSSIBILITIES BETWEEN ONE SECOND AND INFINITY.\n\nWITHIN THE GIVEN FORMAT, NOT EXCEEDING THE DESKTOP-PRINTABLE A4 AND DOWNLOAD FRIENDLY 25 MB, A SELF-GENERATING ARTS PERIODICAL CREATES A LAUNCHING BASE AND PLATFORM FOR A DIVERSE NUMBER OF PROJECTS, LITERALLY FUNCTIONING BEWEEN THE MARGINS OF YOUR COMPUTER SCREEN AND THE EDGES OF YOUR DESK.)\n\nThe 'rules' I have set now for the typography on the sticker now are that the ISBN code is the most important, so that is always as long as the logo. The rest of the text on the sticker is also a fixed size, about 3 points smaller than the ISBN code. So depending on the length of the title and the artists name, the sticker will get more full, or there will be more white.  \nThe thing I am also wondering if Din is the right typeface, being maybe a little bit too designy/industrial. I have not yet decided on the typeface I will use on the website, which also makes it harder to bit a good font.\n\n ![](http://web.archive.org/web/20141108102534im_/http:/typophile.com/files/test5_3667.jpg)\n\n",
  "author": "eeliene",
  "time": "15 Apr 2007 — 10:24am",
  "uid": "17760",
  "comments": [
    {
      "time": "15 Apr 2007 — 10:28am",
      "content": " ![](http://web.archive.org/web/20141108102534im_/http:/typophile.com/files/test5a_4399.jpg)\n\nI decided that it was a little weird to put the isbn in the middle between the name of the artist and the title, in this example it is switched around\n\n"
    },
    {
      "time": "15 Apr 2007 — 8:16pm",
      "content": "You might want to look at other online-only pubs, my fave is [The Bonefolder](http://web.archive.org/web/20141108102534/http:/www.philobiblon.com/bonefolder/).\n\n"
    }
  ]
}
