{
  "id": "33088",
  "title": "cmyk vs rgb [photoshop] filters and stuff?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Whats the deal with filters and stuff in photoshop? I can’t use a lens flare or a lot of the other effects in CMYK mode?\n\nThey are blocked out.\n\nI works whenI copy RGB stuff into the CMYK file, but will that mess up the colors?\n\n [‹ Advice about software](http://web.archive.org/web/20080906231122/http:/www.typophile.com/node/32987 \"Go to previous forum topic\") [FORUM LINKS ›](http://web.archive.org/web/20080906231122/http:/www.typophile.com/node/32989 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906231122/http://www.typophile.com/user/8034\" title=\"View user profile.\">evilfansanfran</a>",
  "time": "<br>",
  "uid": "8034",
  "comments": [
    {
      "time": " 16.Apr.2007 1.12pm",
      "content": "I’m no pro but I think you need to do that stuff in RGB and then convert to CMYK for print. The colors will change a little from RGB to CMYK but that’s the nature of the beast when you go from screen to print.\n\nIf you’re doing screen work only, there’s no reason to work in CMYK at all.\n\n"
    },
    {
      "time": " 16.Apr.2007 1.30pm",
      "content": "Using Lens flare may be hazardous to your health. Keep in mind any color corrections you make to an image will change when you convert to CMYK.\n\n"
    },
    {
      "time": " 16.Apr.2007 1.30pm",
      "content": "CMYK is a color space for print and has a limited color range compared to RGB. So you wouln’t wanna use filters in a CMYK image anyway.\n\nRalf\n\n"
    },
    {
      "time": " 16.Apr.2007 2.16pm",
      "content": "so you wouldn’t recomment putting a lens flare on something then converting it to cmyk?\n\n"
    },
    {
      "time": " 16.Apr.2007 3.35pm",
      "content": "That would be fine.\n\n"
    },
    {
      "time": " 16.Apr.2007 4.51pm",
      "content": "Just do it in RGB then convert to CMYK - CMYK converts to the limits of the color space of printed materials - a more limited color space than RGB - pigment as opposed to light.\n\n"
    },
    {
      "time": " 17.Apr.2007 6.17am",
      "content": "ok, thanks\n\n"
    },
    {
      "time": " 17.Apr.2007 4.44pm",
      "content": "Nearly all filters that will work in RGB but not other modes will also work in Grayscale mode. Thus, you can use them in CMYK or Lab color modes if you apply them to their separate channels individually, as though each channel of CMYK or Lab were a grayscale image. This, of course, is time consuming, and the results will likely be very different from those achieved by filtering in RGB mode, but it’s worth it to try to see what happens.\n\n"
    }
  ]
}
