{
  "id": "33086",
  "title": "Share your Typophile Story",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Today, the 16th of April, we celebrate the seventh anniversary of Typophile. When did you discover Typophile, and how? Tell your story here.\n\n",
  "author": "<a href=\"/web/20110812145617/http://typophile.com/user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": "<br>",
  "uid": "3",
  "comments": [
    {
      "time": "",
      "content": "Very simple story. I was looking for the Guggenheim's font and sent an email around to some designer friends. One of them linked me to a thread here on that topic and I was hooked. Now of course that font is available - Verlag - but at the time it was exclusive to the Gugg.\n\nThis was 3 years, 3 weeks ago according to my profile.\n\n"
    },
    {
      "time": "",
      "content": "I was searching for information on the history of Akzidenz-Grotesk. The two relevant typophile threads make up the two most detailed English language documents on the subject, making the threads extremely useful for a paper I was writing.\n\nMaybe one of these days I’ll flesh that research paper out, get my friend who knows German well enough to help me through some old German books to help corroborate everything, and publish it.\n\n"
    },
    {
      "time": "",
      "content": "It was so long ago (1999?) I don't remember how I found typophile.com. At the time it was nothing more than a lovely teaser splash page and an invitation to participate. I emailed Jared and we talked a bit about ideas for the site, including a directory of foundries and designers (the wiki has worked out to be a good tool for that end). I think Typophile has become more of a discussion central than Jared ever imagined, and much more active.\n\n"
    },
    {
      "time": "",
      "content": "I also got the original invitation. The rest is hiss-toh-ree.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Somewhere around the Spring of 2004, while Googling some type related keyword, Typophile popped up as one of the hits. I don’t remember what I was looking for at the time but I became so enamored with the existence of a forum filled with type geeks that I just wandered about the place. Soon, I was hooked and signed up and got my T-shirt, screen name and an avatar—not the current one. I was particularly intrigued with the Critique Forum and was impressed with not only the work of Kris Sowersby, but the dialogue which ensued in the making of his now-released typeface. The whole experience rekindled my dormant interest in type design. I soon after began work on Leporello and posted it for critique. I am still thankful to all those who took the time to help me on my way.\n\nThanks to Joe and Jared for the reawakening!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "It's all Yves' fault and that wacky TypeCon in NYC. I was volunteering and ended up getting lunch with Yves and Ascender Corp. We were discussing type resources and he told me to join up, so I did!\n\n"
    },
    {
      "time": "",
      "content": "The first online type forum I visited was Typographi.ca, at the time (2002) a well-known Canadian site. It was there that I first heard tell of Typophile.\n\nInvestigating the phenomenon further, [here's](http://web.archive.org/web/20110812145617/http:/www.shinntype.com/Assets/Depts/Essays/TextTalk.pdf) what I wrote for _Graphic Exchange_ in 2003.\n\n"
    },
    {
      "time": "",
      "content": "\\> a well-known Canadian site.\n\nFunny.  \nAh wait, do you mean English? ;-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I gave a talk about W. A. Dwiggins at TypeCon2006 in Boston, and I got wind of Typophile through that gathering. A few months later I finally got around to visiting, saw what a great community this is, and Madame Tiffany la Merveilleuse helped me to get signed up.\n\nI haven't been the same since.\n\n"
    },
    {
      "time": "",
      "content": "_Ah wait, do you mean English? ;-)_\n\nPerhaps you're thinking of Typographi.fk (another Anglophone domain).\n\n"
    },
    {
      "time": "",
      "content": "No, I'm thinking of the Toronto Star piece. :-\\>\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "When I first heard about Typophile the front page navigation was Mac-only, which made it difficult for me to promote on microsoft.com/typography. That changed, along with a lot of other things, in September 2001...\n\n[http://www.microsoft.com/typography/links/news.aspx?NID=2208](http://web.archive.org/web/20110812145617/http:/www.microsoft.com/typography/links/news.aspx?NID=2208 \"http://www.microsoft.com/typography/links/news.aspx?NID=2208\")\n\n"
    },
    {
      "time": "",
      "content": "It was in my Typography class in school that I first learned of Typophile. Keith Tam, my teacher at the time, had listed it as a course reference. I checked it out, got way obsessed with being a lurker, then one glorious day I saw a posting for an intern. I applied, and here I am 3 years later, bossing Christian around. :) Ok, so he bosses me around.\n\n"
    },
    {
      "time": "",
      "content": "I am a visitor-stats whore; I am addicted to tracking how people come to my sites. Thus, I found Typophile in 2002 because you guys found me first and linked to my little movie. I followed the link back, and between here and Typographica, I finally discovered where my community had been hiding all my online life. Thanks for providing a safe haven for type geeks all these years -- happy birthday, Typophile!\n\n"
    },
    {
      "time": "",
      "content": "I think I found a few stickers from my bag o'schwag at TypeCon 2004 and I decided to check it out... This is an excellent resource and I always tell my students about it. Thanks Typophile! Without you I'd be a typo-nothing! :)\n\n"
    },
    {
      "time": "",
      "content": "I'm only a member for 30 weeks or something, but I think I was just searching for typography- and typedesign-related websites, and I stumbled upon this one. Or I may have seen it linked on one of the type-blogs. I'm not sure, to be honest. :D\n\n"
    },
    {
      "time": "",
      "content": "The House of the Bezier Curve\n\nThere is a site upon the net  \nThey call it Typophile.  \nIt’s been the ruin of many a poor son  \nAnd God I know I’m one.\n\nMy Uncle was a printer  \nHe taught me 'bout the type  \nI have loved the Baskerville  \nAnd you know that ain't no hype.\n\nNow the only thing a typehead needs  \nIs his FontLab and his Suite,  \nAnd the only time he’s satisfied  \nIs when the curves are sweet.\n\nOh mother tell your children  \nNot do to what I have done.  \nTo spend your life before the screen  \nTrying to make that notan hum.\n\nWell I got one hand on the trackball  \nand the other on the keys  \nand I’m going back to Typophile,  \na-cryin' help me, help me please.\n\nYes, there is a site upon the net  \nThey call it Typophile.  \nIt’s been the ruin of many a poor son,  \nAnd God I know I’m one.\n\n"
    },
    {
      "time": "",
      "content": "I was playing with \"upgrading\" one of our Type 1 database fonts to OpenType format, & trying to figure out the proper names to give glyphs we had previously called \"oneoldstyle,\" \"oneoldstyletab,\" etc. There was a long thread which popped up in a Google search. It, and other threads were so helpful, I sent the $40 donation. Never got the promised T-shirts thought. (Just kidding I've gotten much, much more from the site).\n\nCharles Ellertson\n\n"
    },
    {
      "time": "",
      "content": "Hey W.B., you clearly have a future in writing lyrics! Very clever and very funny. I liked singing along and having all the syllables fall in the right spots in the rhythm, too.\n\n"
    },
    {
      "time": "",
      "content": "I don't remember exactly how I found out about it, but I'm pretty sure it was from something on Typographica. It was probably not long after it started, but I remember feeling like I was late to the party.\n\n"
    },
    {
      "time": "",
      "content": "Damn. I wish I could match William's post!\n\nI stumbled on you twisted typesters while looking for some answers about aligning last lines on the page... You guys set me straight pretty quickly.\n\nThe first night I must've spent easily 3 hours reading back threads, often not understanding much (especially Eben's threads) but getting a real kick out of the writing and arguing -- in particular, Hrant's comments.\n\nI have often thought of turning some of it into found poetry. Who can resist the word \"bouma\"? Especially \\<\\< Bouma \\>\\> in guillemets?\n\n;) keep it up! You have gotten me through many a work day.\n\n"
    },
    {
      "time": "",
      "content": "Bill, you want to have a look at [today's (Monday, April 16, 2007) Facts & Arguments essay](http://web.archive.org/web/20110812145617/http:/www.theglobeandmail.com/factsandarguments)....\n\nI started up here last summer, when a type-related search hit here first. (edit: I've learned a lot, made some great friends, and like every other place in the e-world, found there are people who just \"don't get it\" in every sphere of consciousness in the universe.)\n\nWhich means, of course, that Typophile is a lot like the real world: most folks are great, but a few aren't. ;-)\n\n(edit: that's not either approval or condemnation, it's what it is.)\n\n"
    },
    {
      "time": "",
      "content": "I suppose I heard about Typophile at typographi.ca, but I cannot recall when. I only occasionally looked at the site. In July 2005 I was at the SHARP conference in Halifax and something I saw here spurred me to write a comment. I decided to join. But I was using a really crappy computer on a really slow hotel dial-up about 3 in the morning, and I kept getting some stupid-ass message that made me believe the action was not working. Since I had to give a talk in only a few hours I slammed shut the laptop and went to sleep.\n\nThe urge to say anything must have left, for I never thought again about making a comment until recently. So I tried to join up. I must have entered the same user name and password, because came back a note that led me to see I'd been a member since that night in Halifax. Who knew?\n\nGlad to be here; very worthwhile. But I have very little to say to the world these days, so I doubt I'll add very much.\n\ngood night.\n\npowers\n\n"
    },
    {
      "time": "",
      "content": "Thanks to Blueflag from Dafont.com  \nI now have friends like Hrant+Dezcom\n\nTypohile(s) has made my wife  \nAlways says, holding knife:\n\nForgot kids+house!  \nThrow keys+mouse!  \nTypophile! Typophile! Typophile!  \nCurse the Day of Typophile!\"\n\nPlease, do not blame her,  \nI ..................................... hair\n\n"
    },
    {
      "time": "",
      "content": "I think I was googling for something type related about 2 years ago, stumbled upon Typophile, got stuck, then hooked. Lurked around for a while and finally posted my first post June 17, 2005. Time sure flies! Ever since my typomania has got worse and money spent on fonts and type books is increasing. I spend a lot of time here, and it sometimes affects my work and/or sleep.  \nThank you for existing! Typophile has helped me a lot and entertained me too.\n\n"
    },
    {
      "time": "",
      "content": "Happy Birthday T-ophile! I don't remember when I came here or how, sorry.\n\n"
    },
    {
      "time": "",
      "content": "Well, I see that next week I will have been a member for 5 years. I don't remember how I learned about Typophile. It might have been via Typographi.ca or the Typo-L list. I was heavily involved for a while in the beginning (much at the expense of other aspects of my life).\n\nAs many of you know, I disappeared for a while a few years ago. Rumor was that I had checked into Typophile Rehab; but really, I just took on a very all-consuming creative director job for a couple years.\n\nNow I've been making my way back on to the forums. But I find I don't have as much to say (or prove, perhaps?) as before. Still, I'm very glad Typophile is still around and going strong. I enjoy touching in now and again and keeping up with things.\n\nHere's to many more great years of Typophile!\n\n-- K.\n\n"
    },
    {
      "time": "",
      "content": "I was still at school and very interested in editorial design so I frequently browsed reading and learning about type on many now dissapeared small websites until one day I stumbled on Typophile. About four years ago.\n\nI remember the first thread I read it was something about the future of type and the alphabet, it looked very interesting and there was this guy with a strange name making such radical propositions that made me post.\n\nI remember some other notorius personalities that marched upon the typophile threads such as an excentric Italian printer who went to sail a couple of years ago, a birdwatching expert on dwiggings that who knows where did he flyed to and many others that still remain.\n\nI'm thankful to typophile and oh god... I know... I'm one...\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "A friend turned me onto the site. I realized I could study the glyph here. Since I believe in microscosmic analysis that suited me.\n\nThanks for all the hard work…\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "As one of the regulars at What the Font, along with Phiippe, Mike F— we chat occasionally and share stories about type. Mike F insisted (as he does) one day, that I read a thread here - and so here I've continued to be.\n\nHappy BIrthday Typophile.com and thank you MikeF\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20110812145617im_/http:/typophile.com/files/curly_4761.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\\*Sorry I'm a day late\\*\n\nI'm a typoholic, (or as a close friend says \"typophiliac\"),so I was looking for a place where I could extend my knowledge of typography and font design. It was the first forum that popped up when I searched and here I remain and always will. Whether I've improved is debatable though.\n\nThankyou Typohile.\n\n"
    },
    {
      "time": "",
      "content": "I found Typophile.com quite by accident -- a Google search for some font or another, I believe. As I had just begun experimenting with Fontographer, I posted my first few tinkerings -- Atlantis, Architrave, and Hefeweizen, I think they were, with Silvertone Woodtype, the Seriatim sorts and several others following soon thereafter.\n\nMy thanks to Joe, Jared, and all of you who are involved with Typophile for giving us all a great forum for exhibiting and critiquing our work. Happy anniversary, and I look forward to many more.\n\nDavid Thometz\n\n"
    },
    {
      "time": "",
      "content": "I remember it as if it was yesterday. A friend of mine, Anthony Hadden, mentioned that Jared's site was up. I zoomed over and haven't left since. So many new friends found through this site I can't even begin to say how much Typophile means to me. Yey for type geeks!\n\n"
    },
    {
      "time": "",
      "content": "I was doing research for my Thesis project (which included the design of a typeface) and I couldn't seem to find any resources for creating a working font. I did a few Google searches and found some tutorials on this site (what happened to those, BTW) and I've been hooked ever since. That was almost 2 years ago.\n\nI've learned so much about type on this site, that I now spend less time talking about it here and more time trying to make it!\n\n"
    },
    {
      "time": "",
      "content": "Two days from now it will be one year since I signed in for the first time. I lurked for about 6 months before that. I think I found Typophile via a link from Typographi.ca, which is now Typographica.com. While I have always loved type, and my undergrad graphic design concentration was typography, I have been learning so much from you masters here. I am inspired an hopeful, to the point that I've finally become serious about producing my first family of faces. And I will be asking you all a lot of questions and posting here for your critiques and advice. Thanks for everything.\n\n--Bruce\n\n"
    },
    {
      "time": "",
      "content": "In April 2000, I met Jared by the vending machine where he was selling his font [Review Beta](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/Review%20Beta) beside candy bars and chips. The font I was working on, \"Raisin Nut\", came up. He said, \"you should post that on Typophile\". The rest is history.\n\n"
    },
    {
      "time": "",
      "content": "it might sound kind of silly, but typophile has changed my life. I had just started toying with building fonts and was wanting to do a revival of [Nymphic](http://web.archive.org/web/20110812145617/http:/typophile.com/node/2733) by [Hermann Ihlenburg](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/Hermann%20Ihlenburg). I came here for help and that started my [typophilism](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/typophilism). That was Jan 2004. i'm sure my following onslaught of questions was a bit annoying, but folks like [Adam Twardoch](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/Adam%20Twardoch), [Thomas Phinney](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/Thomas%20Phinney), [Hrant Papazian](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/Hrant%20Papazian), [John Hudson](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/John%20Hudson), [Miss Tiff](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/Tiffany%20Wardle) and others were always willing to answer and educate me, for which i will always be appreciative (please forgive me if i didn't list your name in this short list). By the end of the year, I had quit my job and been taken on by [P22](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/P22) as an intern for 3 months (a fortunate series of events). I've been at P22 ever since. At Typecon 2005 [Jared](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/Jared%20Benson) and [Joe](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/Joseph%20Pemberton) invited me to be a moderator at Typophile with my charge being to look over the newly-formed [typowiki](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/typowiki). I never really thought of becoming a [typeface designer](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/type%20designer)before all of this, and now i forsee type continuing to be a large part of my future (likely for the rest of my natural life). thanks to all the guys & gals at [Punchcut](http://web.archive.org/web/20110812145617/http:/typophile.com/wiki/Punchcut) and to all of you who contribute here, you've enriched my life in ways you may never know.\n\np.s. and i've made some great friends along the way! who knew you could make _real_ friends in a _virtual_ community? y'all are the greatest!\n\n"
    },
    {
      "time": "",
      "content": "Paul's story is actually quite a bit richer: at least from what I can tell, Paul was hired mostly because P22 needed somebody to \"refresh\" the essentially dormant Lanston library which they had recently acquired from Gerald Giampa thanks to some guerilla marketing on... Typophile!\n\nIf Typophile ever needs to show off a case  \nstudy of its positive role, this is The Story.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Paul also left out the part where he helps EVERYBODY with everything. I know he has helped me a great deal with many of my \"onslaught of questions\".\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "After more than seven years of absence from the type scene I realised that I simply _had_ to go back at last. I searched the internet, found Typographica, Typographer.org and Typophile.\n\nThen I stumbled upon the [Type Identification Board](http://web.archive.org/web/20110812145617/http:/typophile.com/node/3847)... :^)\n\n"
    },
    {
      "time": "",
      "content": "_he helps EVERYBODY with everything_\n\nwell, i try to do what i can. i guess i still feel indebted for everything i've gained from this site and try to give that back whenever i get a chance to.\n\n"
    },
    {
      "time": "",
      "content": "I've had a general interest in typography for many years, and as an Adobe customer I started reading the Adobe Typography forum. They kept referring people over here for interesting articles, quick type IDs and such, so I started reading over here, and ....\n\ns'marks\n\n"
    },
    {
      "time": "",
      "content": "Thanks for sharing everybody. This thread has been a great ride down memory boulevard. William, that's a great tribute... I need that tune set to some acoustic guitar. And, Aziz, I'm going to read that again later when I need a laugh.\n\n"
    },
    {
      "time": "",
      "content": "\"House of the Rising Sun\" would do it for you, Joe :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"House of the Rising Sun\" would do it for you, Joe :-)\n\n[http://www.last.fm/music/The+Animals/\\_/House+of+the+Rising+Sun](http://web.archive.org/web/20110812145617/http:/www.last.fm/music/The+Animals/_/House+of+the+Rising+Sun \"http://www.last.fm/music/The+Animals/\\_/House+of+the+Rising+Sun\")\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>I need that tune set to some acoustic guitar.\n\nLook out, I'll bring my blues guitar and amp :)\n\n"
    },
    {
      "time": "",
      "content": "I asked a couple of seemingly innocent questions in an other forum...\n\n_What is good type, and who are the designers of good type._\n\n...no one answered my questions.\n\nAnd then somehow I wound up here, I guess \"...the wind just kind of pushed me this way.\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "",
      "content": "I have known about this site for about awile now but never joined until taking a higher level typeface design class in university with Greg Van Alstyne which ended up being one of my favourite classes.  \nI haven't posted any of my work yet because I am a rabid perfectionist.\n\n"
    },
    {
      "time": "",
      "content": "I was at the pub and this young bloke with a funny accent wlaked in with a red t-shirt that said \"I like type\", so I told him \"Mate, your kernings \\*\\*\\*\\*!\" and we almost got into a fight. luckily we had a beer (or a few) and ended up being good mates and he told me about this place.\n\nso there you go!!\n\nMuzz\n\n"
    }
  ]
}
