{
  "id": "33080",
  "title": "The best way to design - steal.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "[http://www.amazon.co.uk/Typology-Steven-Heller/dp/0811823083/ref=sr\\_1\\_27...](http://web.archive.org/web/20131018015012/http:/www.amazon.co.uk/Typology-Steven-Heller/dp/0811823083/ref=sr_1_27/202-1205498-9344602?ie=UTF8&s=books&qid=1176743599&sr=8-27 \"http://www.amazon.co.uk/Typology-Steven-Heller/dp/0811823083/ref=sr\\_1\\_27/202-1205498-9344602?ie=UTF8&s=books&qid=1176743599&sr=8-27\")  \nBook design by Mary Jane Callister/Louise Fili Ltd.  \nTypology by Steven Heller and Louise Fili has a nice cover, some letters though overlap the rectangles. Helpfully enough the book contains the original design which was a type specimen sheet by Bruce Rodgers of a Frederic Goudy 1924 type design.\n\n",
  "author": "joeking_tp",
  "time": "16 Apr 2007 — 10:21am",
  "uid": "18010",
  "comments": [
    {
      "time": "16 Apr 2007 — 11:07am",
      "content": "I think it would only qualify as stealing if they hadn't included the original. In fact, all of the books in their series have been versions of something from the interior.\n\n"
    },
    {
      "time": "16 Apr 2007 — 11:13am",
      "content": " ![](http://web.archive.org/web/20131018015012im_/http:/typophile.com/files/09_duchamp_6430.jpg)\n\n"
    },
    {
      "time": "16 Apr 2007 — 11:47am",
      "content": "If it is not stealing the idea then what does it qualify as?  \nUsing as a template?\n\n"
    },
    {
      "time": "16 Apr 2007 — 11:55am",
      "content": "You can't steal a concept. Only duplicate/copy/parody/etc it. ;o)\n\n"
    },
    {
      "time": "16 Apr 2007 — 11:59am",
      "content": "I think it qualifies as an homage. I wouldn't call that stealing, agree with Tiff on that.\n\n"
    },
    {
      "time": "16 Apr 2007 — 12:06pm",
      "content": "Anyone who believes in original ideas slept through Joseph Campbell day in Social Anthropology 101.\n\n"
    },
    {
      "time": "16 Apr 2007 — 12:15pm",
      "content": "Or one of my favourite songs by [Tom Lehrer](http://web.archive.org/web/20131018015012/http:/members.aol.com/quentncree/lehrer/lobachev.htm).\n\n_Plagiarize,  \nLet no one else's work evade your eyes,  \nRemember why the good Lord made your eyes,  \nSo don't shade your eyes,  \nBut plagiarize, plagiarize, plagiarize...  \nOnly be sure always to call it please, \"research\"._\n\n"
    },
    {
      "time": "17 Apr 2007 — 12:43am",
      "content": "He he. jpad, that's very good.\n\nNothing is original, just new ways of processing it, and that's the originality. If you look at it as separating concept from form and medium.\n\n"
    },
    {
      "time": "17 Apr 2007 — 5:59am",
      "content": "In advertising we call that appropriation.\n\n"
    },
    {
      "time": "17 Apr 2007 — 6:12am",
      "content": "\\>Anyone who believes in original ideas\n\nI believe in original ideas. Eccleciastes was wrong: there is something new under the sun. Airplanes were new. Computers are new. Even Art Nouveau was new.\n\nThere is a novelty today even in type, which is an inherently conservative medium. Verdana was new, Amplitude, using traps decoratively, is new. Beorcana, handling serifs in a new way is new. There are minor novelties compared to the airplane, but still new.\n\n"
    },
    {
      "time": "17 Apr 2007 — 10:50am",
      "content": "It's not either/or, there are shades of \"call it what it is\".  \nThe book cover in question totally swipes someone else's layout -- but as we now believe, there's more to design than layout, concept is important too. Is the concept here original -- i.e. taking an old piece of artwork and substituting new copy for all or part of it?  \nOf course not, so the question is, how well or cleverly is the substitution handled; and indeed there is some subtlety in the choice of how much of the text has been rewritten, and how to highlight it in colour. There is also the quality of the reconstruction (or forgery as Uli would term it) to be considered. But despite all those considerations, it's still not as good as creating an original layout in the style of Rogers would have been.\n\nI produced a specimen brochure for my 1920s-style typeface Oneleigh, in which I took pages from old specimen books of that era and substituted Oneleigh, with fresh text. I also did some original layouts. Appropriation was a lot easier, of course, and you know the design is good, so no self-doubt about that. And the contrast between the original and the new is fascinating in its own right. But I'm not sure any of that really comes in to play beyond the redesigner and a few viewers, as most aren't aware of the repurposing. It does feel good, remaking something exquisite and venerable, which is a powerful justification for the redesigner. Like performing a classic piece of music, or copying an old type design, when it all comes together, bingo. Although others who have not been through the process might not be so convinced.\n\nConsidered for its marketing power (getting people to look at the book and buy it), the Typology cover is outright plagiarism. But once you get the book, and realize how clever the relationship between past and present is, that changes things.\n\nThese days, across the arts, more respect is given to thinking than making, which validates the process of \"appropriation\", as the use of that euphemistic term (with knowing irony or not) would suggest.\n\n"
    },
    {
      "time": "17 Apr 2007 — 12:03pm",
      "content": "\"It's hard enough to be clever, you don't have to be original.\"\n\n— Quote attr. to David Bowie\n\nBTW Nick: Is that Marcel Duchamp's addition to La Mona? Or your take on that? ; )\n\n"
    },
    {
      "time": "17 Apr 2007 — 3:20pm",
      "content": "<cite>I believe in original ideas.</cite>\n\nMy previous post was made somewhat tongue-in-cheek; I guess it was probably more obvious to those of use who went to school after Moyers and PBS made Campbell accessible to college freshmen. I only meant to emphasize that creativity is an evolutionary process and that there is nothing wrong with designers shining a little light on the matter.\n\n"
    },
    {
      "time": "17 Apr 2007 — 4:03pm",
      "content": "The best way to steal is to hold a design contest.\n\npeace\n\n"
    },
    {
      "time": "17 Apr 2007 — 5:03pm",
      "content": "Right, design my web banners for free. I remember that guy.\n\n"
    },
    {
      "time": "17 Apr 2007 — 6:03pm",
      "content": "<cite>The best way to steal is to hold a design contest.</cite>\n\nOH SNAP! Anyway, remind me to tell you a story about the neighborhood association newsletter my publication design class just redesigned as part of a contest...\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:44pm",
      "content": "_I think it qualifies as an homage._\n\nI'm with Patty Fab and Miss Tiffany.\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:47pm",
      "content": "_I believe in original ideas. Eccleciastes was wrong: there is something new under the sun._\n\nThank you, William Berkson. The world would be an awfully boring place if Eccleciastes was right about that.\n\n"
    },
    {
      "time": "17 Apr 2007 — 8:25pm",
      "content": "Homage I'd say (or maybe lack of an original concept). But apart from that... It's a really good reference book. It's worth it plagiarism or not.\n\n"
    },
    {
      "time": "17 Apr 2007 — 9:59pm",
      "content": "[Ballerina with Action Man Parts,](http://web.archive.org/web/20131018015012/http:/www.flickr.com/photos/50202597@N00/383883408/in/pool-banksy/)£96,000\n\n_Is that Marcel Duchamp’s addition to La Mona?_\n\nRight. Painting has been obsolete for almost a century now :-)\n\n"
    },
    {
      "time": "17 Apr 2007 — 10:55pm",
      "content": "I actually read that book when I was doing research on 19th century typefaces and I seem to remember it having the original specimen printed inside.\n\n"
    }
  ]
}
