{
  "id": "33124",
  "title": "garamond anyone?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "there are sooooo many versions of [garamond](http://web.archive.org/web/20150202154321/http:/typophile.com/wiki/garamond). can anyone give me the low-down on what to use when? thanks!\n\n",
  "author": "sbobrow",
  "time": "17 Apr 2007 — 3:19pm",
  "uid": "18098",
  "comments": [
    {
      "time": "17 Apr 2007 — 3:29pm",
      "content": "Not ITC\n\n"
    },
    {
      "time": "17 Apr 2007 — 3:33pm",
      "content": "Seriously, tho, Adobe Garamond is very versatile, elegant, understated and complete. I think you get more bang for your buck with that one than any other. But I recently used both Garamond 3 and FB Garamond (not on the same job!) and think those are both beautiful fonts. Garamond 3 was probably the inspiration for Adobe Garamond but it lacks the range. FB Garamond is very expensive, as are all the Font Bureau fonts. I've never worked with Berthold but you can't buy individual weights. And the rest (Stempel, Simoncini, etc) don't have the range of weights either.\n\n"
    },
    {
      "time": "17 Apr 2007 — 3:40pm",
      "content": "Just stick to Adobe Garamond.. In my opinion, ITC Garamond is a bit 'chunky,' and it has indentations on the stems, which I hate. However, its x-height is larger than Adobe Garamond's, so it might be more fitting for smaller font sizes.\n\nIf you're designing for print, use Adobe Garamond -- I do, at least.\n\n"
    },
    {
      "time": "17 Apr 2007 — 3:54pm",
      "content": "The Berthold Garamond is a very nice alternative to the much used Adobe Garamond. The Berthold cut is slightly more open, edgier and quirky. It also has slightly less contrast than the Adobe cut I remember. I haven't checked out the Premier Pro version yet, but it there are cut corrected for optical size, then the choice is one of taste.\n\n"
    },
    {
      "time": "17 Apr 2007 — 4:19pm",
      "content": "What about Sabon/Sabon Next?\n\n"
    },
    {
      "time": "17 Apr 2007 — 4:28pm",
      "content": "For authenticity, completeness and full-service at any size, go with Adobe's new Garamond Premier Pro. Thousands of characters per font, including Greek and Cyrillic, several weights, four separate size masters. ITC Garamond is not good at small sizes.\n\n"
    },
    {
      "time": "17 Apr 2007 — 4:54pm",
      "content": "From myfonts.com\n\nSabon  \nIn the early 1960s, the German masterprinters’ association requested that a new typeface be designed and produced in identical form on both Linotype and Monotype machines so that text and technical composition would match. Walter Cunz at Stempel responded by commissioning Jan Tschichold to design the most faithful version of Claude Garamond’s serene and classical roman yet to be cut. The boldface and particularly the italic are limited by the twin requirements of Linotype and Monotype hot metal machines. Bitstream’s Cursive is a return to the form of one of Garamond’s late italics, recently identified. Punches and matrices for the romans survive at the Plantin-Moretus Museum.\n\nThe name refers to Jacques Sabon, who introduced Garamond’s romans to Frankfurt, although the typefaces that Sabon himself cut towards the end of the sixteenth century have a faintly awkward style of their own.\n\nOf the other Garamonds, Granjon, Stempel Garamond, and Berthold Garamond are also based directly on Garamond’s work. Garamond 3, Monotype Garamond, and Simoncini Garamond, with Deberny & Peignot’s Garamont, are based on the work of Jean Jannon, an early seventeenth century French punchcutter whose work was confused with Garamond’s early in the twentieth century, a mistake that was not corrected until 1926 by Beatrice Warde. ITC Garamond is a distant derivative of Jannon, while Ludlow Garamond can be considered an original Middleton design with little to do with Jannon or Garamond.\n\nIndeed, how could I forget Sabon Next? Maybe because I haven't used it. Who have used it, and how does it compare to the others?\n\n"
    },
    {
      "time": "17 Apr 2007 — 5:04pm",
      "content": "<cite>ITC Garamond is not good at small sizes.</cite>\n\nITC Garamond is not good at any size. Plus it looks so dated now.\n\n"
    },
    {
      "time": "17 Apr 2007 — 5:21pm",
      "content": "First, learn the difference between Garamonds and Jannons.\n\nITC Garamond is 95% crap, but one place it's passable crap is actually for (very) small sizes, as long as you track it way loose.\n\nhhp\n\n"
    },
    {
      "time": "17 Apr 2007 — 5:50pm",
      "content": "- Except for the little problem of the fine hairlines. Care to go for 100%?\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:14pm",
      "content": ":-\\>\n\nBTW a huge question here is: why exactly are you after a Garamond?\n\nhhp\n\n"
    },
    {
      "time": "17 Apr 2007 — 8:01pm",
      "content": "IMSLTHO the Jannon Garamonds have not fared too well in PostScript. In the case of Linotype's Garamond No. 3, this goes back to the Linotron 202 fonts. I never use the Monotype LaserComp, so I don't know the how far back the problems with Monotype Garamond go. I re-weighted PostScript Monotype Garamond, & worked on the ascenders & descenders, in the days when we used Type 1 fonts but still ran repro. With the repro-negative-plate process, the type picks up a bit more weight. This was the font used in Hendel's <cite>On Book Design</cite> -- except that was set (by someone else) without running repro -- Applications files output to a film negative, with halftones in place, which meant the characters picked up almost no weight. I've since reworked it for DTP printing, but of course, that font isn't available to anybody, though it wouldn't be too hard for anybody with the correct (old) license to replicate this for their own work. When I did this, I kept one eye on letterpress printed specimens of Monotype Garamond. Except for the comma, which I can't stand.\n\nI think the advice to use Adobe Garamond is about right. Jannon's fonts were wonderfully quirky, but unless you work over the current offerings, they don't print well.\n\n"
    },
    {
      "time": "17 Apr 2007 — 8:37pm",
      "content": "One of my great loves is George Jones's Granjon but, like so many designs, it did not make it over the hump from metal to digital with any grace. Linotype composition in Granjon, well cast, and printed carefully with proper makeready on nice uncoated paper, is as nice a Garamond as I can remember seeing, even with the limitations imposed by the Linotype system. Great stuff. Not in digital, though!\n\nSo far my choice for digital comp has been Adobe Garamond. I should probably upgrade to Pro: I've been using the same A.G. font since it first came out, and it doesn't owe me anything by now.\n\nCharles, I had a Lasercomp with a Penta front end and never felt that what we produced could match metal Monotype for good readability (we were printing books almost exclusively). Even though it was only 1000 dpi, it held its own against a number of the types output at 2540 on the linotronic machines, and at 1000 dpi you could really only see pixels with a lupe.\n\nI may be alone in this, but I also felt that the type from the VIP was more welcoming and readable than the 202, which produced results with greater resolution but more contrasty and dazzling.\n\nBut that may be my personal prejudice: I would always have proofs from linotype or hand type pulled on high-finish Superfine rather than the clay-coated Relyon that we were supposed to use, because the Relyon was so !@#$% hard and unyielding. Matter set in something like Caslon Old Face or Janson would gain contrast horribly, especially in the thin strokes.\n\n"
    },
    {
      "time": "17 Apr 2007 — 9:03pm",
      "content": "Granjon was in fact B Warde's favorite Garamond, IIRC.\n\n\\> at 1000 dpi you could really only see pixels with a lupe.\n\nYes but the difference in color and texture between that  \nand 2400+ is very clear, especially for small sizes.\n\n\\> type from the VIP was more welcoming and readable\n\nThis is interesting.  \nI've had this theory that letterpress is more readable than offset (at any resolution)\\* and this is not due to impression (and certainly not to irregularity) but the fact that it has this very slight softness, something that our perceptual system somehow naturally prefers. And by extension phototype -as despised as it deservedly is for all the things it did wrong and all the crappiness it facilitated- just might have had an advantage over digital in this respect, at least towards the end when (assumedly) the fuzziness was largely tamed. Based on your experience and judgment do you think this is a real possibility?\n\n\\* This part is admittedly not a very original thought.\n\nhhp\n\n"
    },
    {
      "time": "17 Apr 2007 — 9:26pm",
      "content": "I do think it's a possibility, but I also think there is inherently less contrast with letterpress than there is with the same type design rendered digitally.\n\nI'd like to take your softness comment and move it to a couple of slightly different arenas:\n\nThese days in photographic reproduction there seems to be a lust for unsharp masking. The apparent increase in sharpness is traded for a loss in tonal smoothness. I think there is much to be said for tones being as important in the message of a picture as edge definition.\n\nAlso I am lucky to have a really good stereo. I can listen to LPs all day long and never feel tired or bored. Although CDs offer more definition and greater dynamic range, I can only listen to one or two albums before I begin to feel some fatigue.\n\nI think the analog realm, softer by (lack of) definition, is easier to live with.\n\n"
    },
    {
      "time": "17 Apr 2007 — 9:58pm",
      "content": "When you say less contrast, do you mean the \"color\" contrast between the body and the background, or the crispness of the border between those two? Because: in the former digital can actually do that; but in the latter digital can only do that by... defocusing the imagesetter laser! Just by a hair, mind you.\n\n\\> ... I can only listen to one or two albums before I begin to feel some fatigue.\n\nInteresting.\n\n\\> ... easier to live with.\n\nThis makes sense to me as well, and I think Nature (meaning here the way Nature ends up looking to us) is the reason (as ambiguous as that is). The thing is, I think there are ways digital can be made more like analog (if never exactly). We just have to take the necessity of doing so to heart, instead of obsessing over higher resolutions, finer color control, etc.\n\nhhp\n\n"
    },
    {
      "time": "17 Apr 2007 — 10:29pm",
      "content": "It's very late, so I'll be brief here. I mean that any given character will all have reduced contrast between thin and thick strokes (prob because of ink squeeze having a greater impact on thins?)in letterpress printed on uncoated paper.\n\n"
    },
    {
      "time": "18 Apr 2007 — 5:47am",
      "content": "As to the softness -- I think I disagree, if you mean the edges of the letters. I scanned in some type printed letterpress at 800 ppi (Bembo, by the Stinehour Press) & took a look at it. It seems to me the metal type pushes the ink outward, so there is a heavier, solid black on the edge of the printed letter. This is one phenomena we can't produce with Type 1 PostScript; I guess you could have with Type 3, but it isn't worth it. The other differences are the bit of randomness with the individually cast letters, and the bit of randomness with their positioning, esp. with Linecasters.\n\nHaving said that, it isn't too difficult to recapture the <cite>feel</cite> of metal type. You can't get the feel of letterpress, but remember that Linotype metal was only good for about 5,000 impressions; the harder metal of Monotype maybe 7,500 impressions. Longer runs meant stereo plates, or pulling repro & printing offset. I think we can easily beat the repro/offset with metal fonts using todays technology.\n\nThe other difference is the foundries seemed to feel their old metal font designs will sell better if they changed the ascender/descender relationships. This isn't just x-height, as it affects the fit of letters with ascenders/descenders to the capitals as well. A magazine look . . .\n\nAs to the type itself, it is largely a matter of the contrast within the letterforms. Adjusting this isn't too hard. Find a well-printed book, scan in a bit at high resolution, & examine how the letterforms look when printed. Granjon can be revived. As a commercial typesetter, I have done this with a few PostScript fonts, but the problem was most people have already decided that the revivals in photocomp (OK, PostScript) fonts aren't any good, so they don't use them. I don't sell fonts (or with rare exceptions, even give them to my wife, who is a book designer), so they by in large lay idle. The best of the old metal fonts could be revived, but I wonder if the marketplace would support this.\n\nI sometime think the reason I prefer the metal fonts, printed letterpress (even when printed from stereo plates) was that was how the books I read as a child were produced. Anybody remember the \"Freddy the Pig\" books?\n\n"
    },
    {
      "time": "18 Apr 2007 — 6:43am",
      "content": "_Indeed, how could I forget Sabon Next? Maybe because I haven’t used it. Who have used it, and how does it compare to the others?_\n\nThe difference between Sabon and Sabon next is also quite noticable.  \nSabon Next Regular compared to Sabon Roman, the best comparison I can get (from PDF specimen), Sabon Next is much more rounded, a bit more heavy, and the general shapes have been toned down a bit, as is the contrast.\n\nAdobe Garamond compared to Sabon Next, Sabon Next has a little bit taller x-height, it's a bit heavier, more smooth, and I think the shapes are more refined than those of Adobe Garamond.\n\nIf I had the money to buy it ($1200 or so for the Platinum version) I might actually use Sabon Next, instead of AGaramond.\n\n"
    },
    {
      "time": "18 Apr 2007 — 7:38am",
      "content": "\\> reduced contrast between thin and thick strokes\n\nOh. Well digital can obviously match that.\n\n\\> Linotype metal was only good for ...\n\nBut foundry type is much more durable, so...\n\nhhp\n\n"
    },
    {
      "time": "18 Apr 2007 — 8:35am",
      "content": "<cite>But foundry type is much more durable, so…</cite>\n\nso not only does it take forever to set, but you run out of sorts, have to set a while, print a while, redistribute the type, set awhile . . . and go blind, get too much lead in your system, & die young.\n\n"
    },
    {
      "time": "18 Apr 2007 — 12:02pm",
      "content": "\"...and go blind, get too much lead in your system, & die young\"\n\nSounds like a rockstar death... cool!\n\nHéctor\n\n"
    },
    {
      "time": "18 Apr 2007 — 12:20pm",
      "content": "ITC faces in Manhattan have become logo faces on Vans like XYZ Plumbing. I doubt they are useful for much of anything but logos. Patty sites they look dated and I agree. Maybe has one ITC face they think works for text, I would like to see an example of that (that wasn't produced in the '70s or earlier).\n\n"
    },
    {
      "time": "18 Apr 2007 — 5:54pm",
      "content": "I forgot to mention that I think one of the other big differences with letterpress printing is the inks. And modern, politically correct offset inks aren't as good as the older 1980s offset inks. But I gotta admit they stink a whole lot less. I couldn't stand to be in a offset printing plant in the 1980s. Letterpress inks I actually find a pleasant smell. They look better, too.\n\n"
    },
    {
      "time": "18 Apr 2007 — 6:33pm",
      "content": "Not too long ago I read a novel in Granjon--must be digital--and found it very pleasant. It had a rhythm to the characters that was lovely.\n\nAdobe Garamond is a triumph, and probably Premier is even better, but I haven't got it.\n\n\\>letterpress printing is the inks\n\nI that brings me back to one of my pet theories: that letter press ink was blacker on the page. This was rejected by a knowledgeable printer I told this theory to. But I recently looked at old letter press print and compared it to offset, with a 50 x magnifier (low magnification microscope). The letter press had some whitish veins running through it--fibers--but offset looked like granite, with white and black flecks throughout. Was I actually seeing the digital dots? Whether there is more of letterpress ink on the page, or digital offset is actually speckles--whatever the cause--digital offset looks greyer to my eyes. And worse.\n\nCan you shed any light on this issue Charles?\n\n"
    },
    {
      "time": "18 Apr 2007 — 6:46pm",
      "content": "Adobe Garamond Premier almost makes me want to go back to being a graphic designer or art director. It's really beautiful. One regret I have now that I'm mainly doing type design, I don't get to use other people's fonts very often.\n\nI've always been a fan of the early twentieth century Garamond (Jannon) revivals: ATF Garamond and Lanston Garamont. Linotype's Garamond 3 has always seemed to be a second-rate version of ATF Garamond.\n\n"
    },
    {
      "time": "18 Apr 2007 — 7:08pm",
      "content": "As to seeing the dots of digital type being the difference, no. Some of the old photocomp type we set (repro) looked quite gray when printed. I use to complain, but was told it was more than the ink/water balance; it was the ink itself.\n\nBut it is true that the paper fibers & dust seem to show through more with offset/text stock (not so much with coated stocks, obviously). I'm no ink expert, but I think the letterpress inks were thicker, and as I said earlier, I know they were pushed out to form a blacker edge, even though the center of the letter was lighter.\n\nSo in addition to the inks, the paper may be another factor.\n\nBut as to what you <cite>can</cite> do with uncoated paper, if you ever get a chance to look at <cite>South Street</cite> by Barbara Mensch (Columbia University Press), take a look at the photographs. These are duotones we did, black & brown, not double black. What we wound up doing was profiling the printer's proofer, and adjusted the dotgain for that. The printer did have to match their own proofer, of course. Anyway, I think these are nice blacks, esp. for an uncoated stock. (Finch Smooth Text Opaque, Vanilla). Inks were Process Black, & Pantone 4655 U. In passing, the type was bumped 2/1000s over foundry, but it is a real old version, so newer ones may be different.\n\nEven so, the dynamic range of the original photos was way more than what you can achieve with ink on paper, so some HRD compression techniques were used in preparing the scans.\n\nI'll allow this is an exceptional sheet for an uncoated stock, not so much for it's feel, but it's ability to hold blacks.\n\nThe old pressmen I knew used to say that with letterpress, the ink is <cite>in</cite> the paper, with offset, it is <cite>on</cite> the paper. While this is technically sort of backwards, it does capture the feel of letterpress.\n\nEdit:\n\nP.S. Mark, my grumble with AG Premier Pro is that the descenders are a bit too short. If they would offer longer descenders, I'd be a happier camper. If the descenders currently balance with the ascenders, then I have two grumbles. But I haven't used it yet, just compared it to our AG.\n\n"
    },
    {
      "time": "19 Apr 2007 — 8:09am",
      "content": "I think Garamond96DTPro is just great, but then I am a bit biased.  \n [http://www.dtptypes.com/opentypepros.htm](http://web.archive.org/web/20150202154321/http:/www.dtptypes.com/opentypepros.htm \"http://www.dtptypes.com/opentypepros.htm\")\n\n"
    },
    {
      "time": "19 Apr 2007 — 9:38am",
      "content": "_Whether there is more of letterpress ink on the page, or digital offset is actually speckles—whatever the cause—digital offset looks greyer to my eyes. And worse._\n\nCharles is right, as far as I know, that letterpress ink is much thicker then offset-ink. Offset ink is more oily-textured, it can almost be poored. While letterpress ink is much more solid, you practically have to scoop it out of the can. At least the inks I have used. So I guess offset ink is much better distrubuted across the surface of the printed characters. Letterpress ink too, but by a lesser extent, so less paper shows through. And don't forget the impression letterpress might leave on the paper, that can also create small 'shadows', that make the image darker and also press the ink into the paper (like Charles also mentioned).\n\n"
    },
    {
      "time": "19 Apr 2007 — 10:37am",
      "content": "I'll add another voice behind Garamond Premier Pro.\n\n"
    },
    {
      "time": "19 Apr 2007 — 8:48pm",
      "content": "I’m a bit late getting into this, and I must start by saying that I am apparently no fan of \"Garamond\" types. Over the past 12 years I have probably designed around 250 books, and I doubt I have used \"Garamonds\" more than 12 times.\n\nBut I do have a few comments, following some of the tangents this thread has taken.\n\n\\*\\* Given that I don’t care for Garamonds, I will say I have found Adobe Garamond a pretty dull face. It has not enough vigor or color for me. I have resisted its use, submitting only when pressed. But after all this high praise, I shall listen to you all and give it a closer look.\n\n\\*\\* Monotype Garamond. Now there’s a typeface that dances and is a joy to look at! When I worked in letterpress I had lots of it, and loved it for job work. I did not then use it for text setting. But I do recommend you look at the work charles\\_e has set in it. He has made the face work really well. Maybe he can list some ISBNs.\n\n\\*\\* I’m really glad to see charles\\_e contributing here. If you are interested in how to set books well, pay attention to what he says, and try to look at some of his books. He has put a lot of effort into this craft, and has done significant work.\n\n\\*\\* Garamond 3 may not be the perfect Garamond, but I see it is the one I use most. Its letterfit is a bit wonky at times, but for a PS face it has good offset color. I find I use it for books dealing with American arts of the 1900s-1920s, when the original face was used a lot: F. Scott Fitzgerald, Sinclair Lewis, Cass Gilbert. But not for academic work.\n\n\\*\\* INK: I can tell you from 20 years of working in commercial letterpress book printing shops that by and large letterpress ink is thicker than the juice used in offset presses. But there is a lot of variation among letterpress inks. Much depends on paper, press, density of forme, and the overall intent of the designer and / or the production manager. At times I have used two different blacks in one job. Say: one black for type, another for woodcuts. Whether or not ink is well-distributed almost always depends on the skill of the press operator. And as an \"old pressman\" I can say to Charles that the other old guys were right: the very nature of relief printing does indeed push letterpress ink \"into\" the paper, while offset lays it \"on\" the sheet. Depending on the sheet, some offset ink will, of course, be absorbed into the paper.\n\n\\*\\* as for the \"color\" of letterpress vs. offset, Charles is right. That little ink spread is responsible for the good density of black. & that disappeared with generations of photo and computer type because it was not added into the letter shapes. Type designers now know about that and are making types that can yield the equivalent of letterpress blackness. Thank goodness. But much still depends on presswork.\n\n\\*\\* Paper. Let me second Charles on the Finch vanilla. I have just done two books on it. It is a wonderful sheet for that illustrated book that does not want coated stock, but demands something better than the standard text offerings.\n\n\\*\\* and finally: Hrant never got an answer to: \"Why exactly are you after a Garamond?\"\n\nOK. That’s it for me tonight. The mescal glass is empty & I must go to bed.\n\npowers\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:26am",
      "content": "Will, thanks for the kind words. The only book I <cite>remember</cite> being printed DTP with the Monotype Garamond adjusted for that is <cite>Conjectures of Order: Intellectual Life and the American South, 1810--1860.</cite> by Michael O'Brien. There are two volumes. The ISBN for vol 2 is 0-8078-2800-9. But unless you just happen to be in the Library with some spare time . . .\n\n"
    },
    {
      "time": "21 Apr 2007 — 4:07pm",
      "content": "Don't forget that there are a few \"Garamond-inspired\" designs of that period, or close to it, that may be of interest.\n\n[MVB Verdigris](http://web.archive.org/web/20150202154321/http:/www.mvbfonts.com/html/fonts/verdigris/pk_verdigris.htm)\n\n[Monteverdi](http://web.archive.org/web/20150202154321/http:/www.fountain.nu/catalogue/monteverdi.asp) and [Montrachet](http://web.archive.org/web/20150202154321/http:/www.fountain.nu/catalogue/montrachet.asp)\n\n[Galliard](http://web.archive.org/web/20150202154321/http:/www.fontshop.com/fonts/downloads/carter_cone/itc_galliard_cc/)\n\nI've heard that Abrams [Augereau](http://web.archive.org/web/20150202154321/http:/www.myfonts.com/fonts/abramslegacy/augereau/) is nice, but I've never seen it used.\n\nAnd while [Philomela](http://web.archive.org/) may be inspired by types from an earlier period than Garamond, it's a great Renessaince type -- I just used it for a small project.\n\nThese are just a few, but I'm sure there are more.\n\n"
    },
    {
      "time": "21 Apr 2007 — 6:00pm",
      "content": "Hey Sandy, I think those respondents here who are turning the question around and saying 'why? what are you using it for?' deserve an answer...\n\nI say this because typeface choice is contextual to the job in hand – and that includes the differences between one Garamond and another.\n\nMuch of the discussion here focuses on letterpress book production; this is what the Garamonds were traditionally used for, so fair enough, I see the Jannon-based ATF and Monotype Garamonds rightfully praised for their appearance in text setting, but if (for example) you are designing a big poster about cheesy 1980s corporatism, then the ITC Garamond (hideous tho' it is), might be entirely appropriate.\n\nMyself, I would tend to use the Sabon and the Stempel Garamond in preference to anything else, assuming the job _had_ to be set in a Garamond of some kind, but (shameless plug) there is more information about the many versions [here...](http://web.archive.org/web/20150202154321/http:/www.100types.com/100types.com.4garamond.html)\n\nTo add to what Addison Hall's just said, the 'Poliphilus' (facsimile rendering) of the Garamond scene would have to be Paul Shaw's [Old Claude LP.](http://web.archive.org/web/20150202154321/http:/www.letterspace.com/LETTERPERFECT_FONTS/old_claude.htm)\n\n"
    },
    {
      "time": "30 Apr 2007 — 2:38pm",
      "content": "Galliard I think is actually based on Plantin and the italic may be chancery style... on my fonts it says it's based on Granjon.\n\nHéctor\n\n"
    },
    {
      "time": "30 Apr 2007 — 2:40pm",
      "content": "Galliard seems modelled more after 16th- and less 15th-century contrast and details.\n\n"
    },
    {
      "time": "6 May 2007 — 8:59pm",
      "content": "Ok, I read a bit and now I know Plantin was designed by Granjon.\n\nHéctor\n\n"
    },
    {
      "time": "18 May 2007 — 2:13pm",
      "content": ""
    },
    {
      "time": "10 Aug 2007 — 5:21am",
      "content": "I do like the original Garamont (made by Jannon I believe) of the Imprimerie Nationale Paris a lot.  \nI did my first steps of drawing letters (by hand) with a beautiful specimen they had sent to me.\n\nDigital Garamonds?  \nAs someone said in this discussion almost none that made it with grace to the digital age.  \nOnly exception for me is the very fine FontBureau version. Yet, the italic isn’t convincing to my eye.  \nThe roman is very charming but in fact very thin so one may have to think about for using it in text in masses.  \nIts particularly beautiful for example making a classic stationery, letterheads etc.\n\nAdobes Garamond is like almost all Adobe creations very good but nothing special. Little charm.\n\nStefan\n\n"
    },
    {
      "time": "13 Aug 2007 — 11:10pm",
      "content": "Adobe Garamond is certainly a safe choice, but I feel it's just a tad delicate below 10 point and so I usually use Stempel Garamond with oldstyle figures (its liner figure for zero is just too strange). Garamond Three is too small for most use, and Simoncini Garamond, though elegant, is even more delicate in its fine strokes than Adobe Garamond, and its wide letterforms come close to the disastrous proportions that doomed ITC Garamond. Sabon, among Garamonds, is unique and outstanding: it's Garamond, and yet it isn't. It's a true miracle among postwar typefaces for wide editorial use, and for book designs, only Adobe Janson Text works better. And if you want historically literate versions of Garamond, you need look no further than Storm Foundry in Prague, carried on MyFonts.\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:20am",
      "content": "Is adobe garamond not available as a Pro font yet? I thought is was. That would mean there is a caption weight (style/cut?) that should eliminate some of the fineness at the smaller sizes.\n\n"
    },
    {
      "time": "14 Aug 2007 — 12:06pm",
      "content": "While I still like Adobe Garamond, it has been outmoded by Garamond Premier Pro. GPP does have caption weights.\n\n"
    },
    {
      "time": "14 Aug 2007 — 11:03pm",
      "content": "I don’t like Sabon.  \nIt’s too clean, too German. Too open also.\n\n"
    },
    {
      "time": "16 Aug 2007 — 12:41am",
      "content": "Lanston Garamont - I'd like to see this now that LTC has re-issued it digitally. It's a Jannon, but it looks like it has that quirky Goudy feel to it.\n\n@ben\\_archer\n\nI LOVE Old Claude LP. I has a touch of that real oldstyle feel, without so going overboard on the \"distressed\" look that it is totally cheesy.\n\n"
    },
    {
      "time": "16 Aug 2007 — 7:18am",
      "content": "I think what I like best in Sabon, and something that has disappeared in the more historical Sabon Next, is the anti-kerning dagger-shaped italic f. Quite a German idea I suppose, with Fraktur (or gothic cursive) lurking in the background.\n\n"
    },
    {
      "time": "16 Aug 2007 — 6:08pm",
      "content": "Marc,\n\nThe sharp f in Sabon is actually an artifact of Linotype's metal typecasting technology. Lines of Type (Linotype) mean all the matrices have to be assembled first, and then a single piece of type, containing the whole line of glyphs, is cast. This meant there could be no overhanging kerns, and it also meant the Italic or Bold, whatever was duplexed on the matrices, had to match the roman widths. Optima, Palatino, Melior, Caledonia, Electra, and other classic Linotype faces designed in the metal era had this constraint. Some designers met the challenge so well we don't notice the unusually narrow italic f, but with a classic design like Garamond as a model, the Sabon f had to stand out.\n\n"
    },
    {
      "time": "16 Aug 2007 — 9:23pm",
      "content": "Garamond No.3 is the Linotype version of ATF GAramond. The ATF version still suits me fine.\n\n"
    },
    {
      "time": "17 Aug 2007 — 12:33am",
      "content": "[Some clarification](http://web.archive.org/web/20150202154321/http:/www.linotype.com/3474/garamondfontfeature.html) about some of the many \"Garamonds\"…\n\n"
    },
    {
      "time": "18 Aug 2007 — 4:27am",
      "content": "I bought Adobe Garamond in 1990, as part of a Christmas software—tho', of course, not strictly software if you think of that as _programs_—buying spree for myself in my last holiday season as a single person. I bought it because I loved how it looked—just a really elegant typeface. Same for Adobe's Futura 1 family, tho' I imagine I could get more argument there. (Actually, I bought the teo together in that selfish shopping spree.)\n\nAnd, although I've retired straight AG in favor of Adobe Garamond Premier Pro—yes, indeed, wider assortment of glyphs—I haven't used it in a book in ages, either of my own design or in the majority of my work lately, straight layout jobs (where the design was part of a long-established series or house style of the client). ITC Slimbach is one that's been used.\n\nI just recently used ITC Usherwood for an illustrated children's story book on which I did page design and layout. I was _very_ pleased with how it looked on the page, as was my client, a self-publisher. I actually used Medium, rather than Book, for the body type. Normally, that'd be an unusual choice. But for a book geared towards 6- to 8- or 9-year olds, I though the slightly heavier appearance worked nicely. A nice, large x-height and not a great deal of contrast in the ever-so-slight thickening and thinning of vertical to horizontal.\n\n"
    },
    {
      "time": "19 Aug 2007 — 7:19pm",
      "content": "Personally, I don't feel Garamond Premier renders Adobe Garamond obsolete. The former is a more restrained and modernized interpretation, and the latter is a more directly authentic revival. There's room for both, and more besides.\n\nOf the various non-Adobe takes on the original Garamond types, I find the Monotype and Berthold versions both quite good.\n\nOf the Jannon revivals, I have a fondness for both Granjon and Garamond #3 (or ATF Garamond). I've recently been introduced to Linotype Estienne, which is also interesting, if rather quaint and not available in digital form.\n\nIn related typefaces, I'll put in another good word for MVB Verdigris. It's a first-rate book face.\n\nCheers,\n\nT\n\n"
    }
  ]
}
