{
  "id": "33120",
  "title": "Thanks, MyFonts.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "It wasn't too long ago that MyFonts announced its one millionth font sale (licence sales, really).  \nNow they just hit three million.  \nThey've been a Shinntype distributor for six years, taking over when Makambo dropped out.\n\nSo thanks, MyFonts, for making it financially viable for me to be a full-time\\* type designer, and also on behalf of the booming \"indie\" font business sector which you have, in large part, created.\n\n\\*by that I mean I no longer work as an art director/graphic designer -- I wish that I could spend more time on type, but running a small business, marketing, production, etc., takes up a fair amount of time.\n\n",
  "author": "Nick Shinn",
  "time": "17 Apr 2007 — 12:58pm",
  "uid": "2021",
  "comments": [
    {
      "time": "17 Apr 2007 — 2:40pm",
      "content": "And thanks to Myfonts for being such a useful resource for design students. The information available on Myfonts is a big help for those of us researching type; printed sources for much of the information on Myfonts are not available to those of us at smaller schools with limited libraries.\n\n"
    },
    {
      "time": "17 Apr 2007 — 3:27pm",
      "content": "and thanks myfonts for your keyword search and whatthefont which has helped with innumerable IDs.\n\n"
    },
    {
      "time": "17 Apr 2007 — 4:15pm",
      "content": "yeah thanks myfonts for flooding the market with total \\*\\*\\*\\* rubbish.\n\n"
    },
    {
      "time": "17 Apr 2007 — 4:28pm",
      "content": "_yeah thanks myfonts for flooding the maerket with total rubbish_\n\ni was thinking about this the other day and the fact that it may actually be a good thing. if all they hobbyists are now selling their fonts instead of giving them free on the internet, perhaps folks will eventually stop looking for a free lunch? once they see that they can buy crap fonts or well-made fonts for the same $$$, hopefully they will choose the better.  \non the other hand, a customer might have a bad experience purchasing poor quality fonts and conclude it's not worth paying the $$$ for fonts if the quality is the same as a font that's free.  \ni guess it could work both ways, eh? :^/\n\n"
    },
    {
      "time": "17 Apr 2007 — 5:55pm",
      "content": "\"yeah thanks myfonts for flooding the market with total--------rubbish.\"\n\nIf you bothered to take the time to find out what rubbish is then you might have a different opinion. What is rubbish? Is it rubbish because it is a font available from myfonts for a low price? Is it rubbish because you don't like it? Would you rather get the rubbish for free instead of paying for it?\n\nI applaud Nick for the kind words he has to say about myfonts. The company makes money for me which I much appreciate. And I certainly don't make a lot, but enough to keep the wolf from the door. While my work is not the work of Nick or Matthew Carter or Nevile Brody or Just van Rossum or Martin Majoor or Fred Smeijers or Erik Spiekermann or Jean-Francois Porchez or many other fine designers I enjoy doing it. You really don't have to trash people whose work appears on myfonts and I can't guess nor do I care to what your reasons might be. And I'm not a \"hobbyist.\"\n\n"
    },
    {
      "time": "17 Apr 2007 — 6:04pm",
      "content": "mate, if you don't agree that 95% of myfonts are shit, then youre living in some sort of dreamworld! I just don't see how it is good ecxept for the owners of myfonts sucking up all the cash. Quality control is needed.\n\nMuzz\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:22pm",
      "content": "98.6% of everything is crap, and 86.4% of all statistics are made up.\n\n\\>Quality control is needed.\n\nI think that Laurence and co. highlight the quality stuff via the newsletters - Rising Stars and In Your Face. However I for one would welcome user-based ratings systems and technical quality reports from every online distributor.\n\nCheers, Si\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:23pm",
      "content": "Oh so that is the problem. Myfonts is making all of the money. Too bad. Maybe simply encouraging mediocrity is what you're complaining about. So if you feel so strongly about it why look? Or is what it is that is making you uncomfortable is mediocrity in general. Well genius, live with it. It's everywhere. And of course myfonts does not make all of the money, never has and never will. Myfonts does not encourage mediocrity and they never will. Myfonts has rather strict guidelines and they follow them. I am happy, thrilled in fact, that they sell and promote my work and that they also sell and promote designers like Nick and many others who continue to make a real contribution to font design.\n\nThe font design world is an open market and the best will do well and most won't - everyone knows that except, maybe, you. And I am going to say \"thanks\" to myfonts too.\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:31pm",
      "content": "_user-based ratings systems and technical quality reports from every online distributor_\n\ngood ideas! i'm curious, si, what kind of things would you like the foundries to report on?\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:44pm",
      "content": "I was thinking maybe a summary based on errors and warnings from Font Validator. I realize this may be a little problematic.\n\n"
    },
    {
      "time": "17 Apr 2007 — 7:48pm",
      "content": "maybe some criteria like Ascender used in their [Study of Free/Shareware Fonts](http://web.archive.org/web/20141112054518/http:/www.ascendercorp.com/webfontstudy.html)? namely presence or absence of various tables (hinting/kerning), % of completeness of character sets (particularly Mac Roman and Codepage 1252), &c.?\n\n"
    },
    {
      "time": "17 Apr 2007 — 8:11pm",
      "content": "Myfonts doesn’t need a rating system. Fonts people like get purchased, fonts people don’t take up an insignificantly tiny spot in a massive database. It’s a business based on sales; not an online popularity contest.\n\n"
    },
    {
      "time": "17 Apr 2007 — 8:42pm",
      "content": "\\>maybe some criteria like Ascender\n\nYep, something like that. An alternate might be an independent font certification body. However when we looked into this it seemed as if it would need significant long-term support from someone like us, and couldn't be supported by certification fees alone.\n\n\\>Myfonts doesn’t need a rating system.\n\nYou could say the same thing about Amazon.com - you don't need the reviews or the rankings, but obviously they think it adds value to their service.\n\n"
    },
    {
      "time": "17 Apr 2007 — 8:45pm",
      "content": "Fonts are too subjective for a ratings system. One man's trash is another's treasure. You can hardly blame myfonts for the fact that most of them are crap.\n\n"
    },
    {
      "time": "18 Apr 2007 — 4:29am",
      "content": "Sometimes I find it very difficult to figure the average typophile here out. I'm not speaking of the professionals who have a broader understanding of where type use to be, where it is today and where we see it going in the future.\n\nI joined in again with Typophile due to a dafont.com thread. I knew that the majority of people had no understanding of the true inner working of dafont, and that was a shame.\n\nToday, some of you feel you must pick on What the Font? Give me a break. I've been with them for years. Yes, they sell fonts - yes of all sorts. I guess you all mean that foundries like Monotype, Emigre, Adobe, Berthold, etc. are rubbish?\n\nYes, WTF has given breaks to type designers, so they have an outlet to \"sell\" their fonts - rather than place them out there somewhere on the web. Is that so terrible giving inspiration to the new kid on the block. Where will the future designers come from if they are not allowed a decent break. Type, some of you forget, is ART. And not all art is loved and apprecialed by the masses.\n\nAs a professional typographer, I lived through grunge type and graffiti type - let's really talk rubbish. It is horrible to realize the training of clarity and easy readiblity for customers products and then be given a grunge type selection for -- body copy. I'm sorry, it's against every moral fibre I have.\n\nSo, are you upset that there is a capitalist world out there? That someone is offering a site that you can buy, for immediate gratification, a font? Are you upset that before you buy that font you can 1) have people (like myself) identify a face you might like to own; 2) Test the font on line to see what it reallly looks like and 3) buy it for immediate use?\n\nOne thing WTF does is help the type industry thrive. No one gives any fonts away. When someone wants a \"freebie\" they are told where to go -- and I don't mean online to get it.\n\nMany of the type IDs are impersonal -wham bang - here's the font. Some become very personal like a year ago when Graham Meade showed up. Here is a very talented person, who has away of putting letters together for fonts. He took his time to redesign Koster (because it wasn't available) -- Yes, WTF put it on line -- and for all his work - six separate fonts -- you can buy it ALL for $6. Graham was ecstatic but there is something here for you to truly understand. The fonts on WTF are not all priced the same. Many are exactly what the manufacturer has selected. Every Letraset font there is the 39.99 that Letraset wanted it to be.\n\nFor those of you that praise WTF, I am sure they thank you. For those of you who have written negative things about WTF - well, you do have this site and others. Enjoy them.\n\n"
    },
    {
      "time": "18 Apr 2007 — 5:47am",
      "content": "Jackie, there is no average typophile. We are extremely diverse, having in common only a love of type--and a touch of lunacy :)\n\nWTF. The name of the company is MyFonts (owned by Bitstream). WTF means, erm, [something else](http://web.archive.org/web/20141112054518/http:/www.typophile.com/node/16343) to most people on the internet.\n\n"
    },
    {
      "time": "18 Apr 2007 — 6:44am",
      "content": "Jackie,\n\n ![](http://web.archive.org/web/20141112054518im_/http:/typophile.com/files/appl_3435.gif)\n\n"
    },
    {
      "time": "18 Apr 2007 — 6:52am",
      "content": "\\>WTF means, erm, something else to most people on the internet.\n\nBut to the average typophile it means [What the Font](http://web.archive.org/web/20141112054518/http:/www.myfonts.com/WhatTheFont/).\n\nTim\n\n"
    },
    {
      "time": "18 Apr 2007 — 7:05am",
      "content": "\\>Today, some of you feel you must pick on What the Font?\n\nWTF!? I think you need to re-read the thread. Only one person came out swinging at MyFonts (Muzzer) and everyone else has been defending them, praising them (how this thread started out) or making suggestions as to how they can become even better.\n\n\\>But to the average typophile it means What the Font.\n\nNo, WTF means WTF. That's why most typophiles don't abbreviate What The Font to WTF, unless they're having a laugh. As I recall the feature in MyFonts was originally called something else, and Bitstream changed the name to avoid some possible trademark issue - they likely picked the rather silly \"What The Font\" name for the same reason as Apple named their sound file [Sosumi](http://web.archive.org/web/20141112054518/http:/en.wikipedia.org/wiki/Sosumi).\n\nedit - WhatTheFont was orignally called \"Identafont\" See [http://www.microsoft.com/typography/links/news.aspx?NID=1029](http://web.archive.org/web/20141112054518/http:/www.microsoft.com/typography/links/news.aspx?NID=1029 \"http://www.microsoft.com/typography/links/news.aspx?NID=1029\")\n\n"
    },
    {
      "time": "18 Apr 2007 — 7:11am",
      "content": "MyFonts is a great site. I like Simon's idea of having 'user reviews', Amazon style, on a font site. It would be logical for any of the 'omnibus' sites--MyFonts, FontShop, Veer--to have these.\n\nBy the way, even on the Typophile ID board, which occasionally I peek in on, WhatTheFont is called that,and not by an acronym, so far as I have seen.\n\n"
    },
    {
      "time": "18 Apr 2007 — 8:35am",
      "content": "Identifont is another great site, btw, altho I've found WhatTheFont much more useful for IDs (but that capitalized \"The\" bugs my inner editor!). However I like Identifont's \"fonts by similarity\" and its ease of use for the basic character set.\n\n"
    },
    {
      "time": "18 Apr 2007 — 8:40am",
      "content": "\\>No, WTF means WTF.\n\nI suppose a joke (or light-hearted comment) that needs explaining isn’t a joke.\n\nTim\n\n"
    },
    {
      "time": "18 Apr 2007 — 9:45am",
      "content": "\"To Market, to Market...\"\n\nIf you go to a major grocery chain (Safeway, et al), you get their take on the food you can choose from. If you go to a farmers market, you get many more takes on food choices. The big guys advertise big and have the committees to make decisions. Committees can reduce the chances of bad stuff going out but reduce the chances of innovative stuff going out as well. Sometimes you feel like a nut, sometimes you don't. When you want to play it safe, shop at safeway. When you are looking for something that pushes the envelope more, you might try farming the marketplace. MyFonts just gives the buyer options and the seller opportunities. When you buy a font, wherever, you look at it and decide one way or the other. It is your choice.\n\nIf there are to be ratings, then they should be unbiased and across the board. I mean big foundries get their stuff rated too, not just the little guys. Who is going to pay for these ratings and manage the database, and insure unbiased ratings? We have Miss America Pageants, Best Dressed surveys, Academy Awards, People Magazine popularity contests. Is this really helping? The marketplace speaks. If people want to buy Wonderbread from Safeway or Mom's Organic 7 Grain Bread from a farmers market, that is their choice. Your results may vary but your choice should still be yours.\n\nChrisL\n\n"
    },
    {
      "time": "18 Apr 2007 — 9:55am",
      "content": "Increasingly, now, you can also get Mom's Organic Bread at a Safeway or a Walmart. And often cheaper. And that's causing a problem for the smaller retailers when the big box stores go in.\n\nBut maybe the question is, who is Myfonts hurting? Is it hurting the independent foundry the way Barnes and Noble has hurt the independent bookseller? Does it undercut their prices? If not, then I can't see who suffers by their having such a vast selection. Shopping online is - more or less - the same wherever you shop. Fonts don't strike me as something you buy in bulk, more likely one here, one there for a particular job, so the fact that they have such a large collection shouldn't matter.\n\nAnd it might help the independent foundries to have their fonts in Myfonts's catalog and thus in their keyword search or WhatTheFont, in order to draw the less-educated font buyers to the smaller foundries. As long as they get their royalty...\n\n"
    },
    {
      "time": "18 Apr 2007 — 9:57am",
      "content": "To Nick and everyone else: the thanks goes to you!\n\nAbout a year ago, I voiced some of my opinions on the downfalls and successes of MyFonts in the [synopsis](http://web.archive.org/web/20141112054518/http:/www.nicksherman.com/degreeproject/) of my senior degree project in Graphic Design from MassArt.\n\nSince then I have been hired by MyFonts to deal with some of these issues (as well as a whole bunch of other ones).\n\nWith all that said, I must admit there are still plenty of aspects of the site which still have plenty of room for improvement, and I am excited to be working on these kinds of things.\n\nMuzzer, I have to agree with you that there are many fonts on MyFonts that I personally don't consider among my favorites. Ironically, the fact that these fonts get a chance to be seen is one of the things I love about MyFonts. As strongly as I may feel about a font, one way or the other, I would be uncomfortable if the choice to exclude bad fonts were left to a select few. As of now we've used font sales as a rating system of sorts, but I must admit that I like the idea of a dedicated, visible, public system.\n\nIndeed, this democratic approach to font sales often reveals many diamonds in the rough and enables amazing independent designers like Nick Shinn to do what they love. I can't express how happy I am to be able to help with something like that!!!\n\nAlso, I must say that MyFonts is definitely not sucking up all the cash. In fact, as far as I know, we give a higher percentage (65%) of each sale to the foundry than any other site (anyone, please correct me if I'm wrong).\n\nPlease don't consider this rebuttal a call to end any negative comments about MyFonts though! On the contrary, it is very helpful to hear what is not working as much as it is to hear what is. Many of the things mentioned above have already been considered by the MyFonts team, and might even be in the process of being worked on as we speak; but all the same, I'm sure there must be things we haven't thought of.\n\nWith that in mind, please keep the comments coming, good or bad! Just know that it is much more helpful for us when criticism is accompanied by specifics or suggestions.\n\nThank you all!\n\n"
    },
    {
      "time": "18 Apr 2007 — 10:31am",
      "content": "I was going to voice my massive respect for the royalty arrangement that MyFonts has maintained. It's a give and take situation to have your work adrift in a sea of what some may consider rubbish, but I think the self-promoters out there leverage the situation to their clear advantage.\n\nI'm also very happy to see the focused attention to the personality of the folks MyFonts is supporting. I read the interviews in the eBlasts. It's always encouraging to hear fellow type designers talk about their experience in the business.\n\nSet style bias aside and you'll see that MyFonts is a worthy model for a major percent of the font-buying public. It works and is continuing to work!\n\n"
    },
    {
      "time": "18 Apr 2007 — 10:53am",
      "content": "\"Increasingly, now, you can also get Mom’s Organic Bread at a Safeway or a Walmart. \"\n\nAnd you can buy some Shinntype and Mark Simonson fonts at FontShop too. The big guys are making deals with the small guys perhaps because they have seen their stuff do well in the marketplace. The difference is that Walmart comes to town and shuts down the mom and pop stores while FontShop and Veer just partner with them and don't interfere with their own or other distribution methods. While Walmart may be actually killing competition, MyFonts and Veer are promoting it in a healthy way. It even keeps the big guys from sitting back and getting lethargic. They see interesting stuff done by independents and push themselves to new highs. The biggest winner is the type buyer whogets the best of both. The indy guy also gets a bigger voice than he did alone before.\n\nChrisL\n\n"
    },
    {
      "time": "18 Apr 2007 — 11:32am",
      "content": "Right Chris.  \nIt could be said that Adobe, Microsoft and Apple are the Wal-Marts of the font world, putting their big boxes right in the neighbourhood of everybody's font menu -- but it's not really the same, as the indie font market appears to be thriving despite bundling.\n\nWhat I do think bundling does is channel the genres of type that are viable in the retail market. As long as the megacorps stick to serious, corporate, bookish font development, the retail market is wide open for scripts, grunge, etc -- and for foundries that move very quickly. So perhaps Muzzer should berate Adobe, Microsoft, and Apple for the \"crap\" at MyFonts :-)\n\n"
    },
    {
      "time": "18 Apr 2007 — 11:55am",
      "content": "Nick, don't encourage him!\n\nI'm glad even to see Microsoft and Adobe giving their users (the ones who are too lazy or don't have the money or inclination to buy fonts) a greater variety than before. Yes, that sword cuts both ways - comic sans comes to mind - but at least the average user isn't stuck with Arial and Palatino.\n\nI'll also add that Myfonts \"font of the day\" is a nice feature. Today they're showing a pretty script from someone in the Ukraine with just two fonts to his credit. If that's not promoting the little guy I don't know what is.\n\n"
    },
    {
      "time": "18 Apr 2007 — 12:00pm",
      "content": "\"Nick, don’t encourage him!\"  \nDo you mean me or Muzzer? :-)\n\nChrisL\n\n"
    },
    {
      "time": "18 Apr 2007 — 12:12pm",
      "content": "Not you Chris.\n\n"
    },
    {
      "time": "18 Apr 2007 — 12:25pm",
      "content": "Not disagreeing with Nick but the bundling doesn't harm MyFonts, in fact it drives traffic - \"Windows user, come for the [Helvetica](http://web.archive.org/web/20141112054518/http:/www.myfonts.com/bestsellers.html), stay for the Froggy.\"\n\n"
    },
    {
      "time": "18 Apr 2007 — 12:35pm",
      "content": "_stay for the Froggy_\n\nyou done with that one yet, dez? :^p\n\n"
    },
    {
      "time": "18 Apr 2007 — 12:42pm",
      "content": "\"Come for Helvetica?\" we are fresh out of that Si, How about some Froggy instead? :-)\n\nYou saw my latest last Sunday Paul :-)  \nRegular, Italic, and bold; CE and Cyrillic done--bold italic to come.\n\nChrisL\n\n"
    },
    {
      "time": "18 Apr 2007 — 12:49pm",
      "content": "I just followed Si's link to the \"Best Sellers\" page at MyFonts. I didn't realize that many of the best sellers there were from Linotype and ITC! That kind of adds a bit to the mix, not only does MyFonts sell the little guy's stuff, but the BIG guys as well! Helvetica and Zapfino doin' their thing right along side the stuff Muzzer hates.\n\nChrisL\n\n"
    },
    {
      "time": "18 Apr 2007 — 2:27pm",
      "content": "Don't know offhand, without checking, but Frantisek Storm's fonts should be best sellers. He is one of the best. Period. And he sells his stuff through myfonts and via his own site. Especially good is his revival of Vojtech Preissig's \"Preissig\" font of 1925.\n\n"
    },
    {
      "time": "18 Apr 2007 — 2:53pm",
      "content": "Well, if I had been merely considering it before, this settles it. Whenever I finish [Agamemnon,](http://web.archive.org/web/20141112054518/http:/typophile.com/node/28862) I'll be selling it on MyFonts.\n\nI might even slide my old freebies in there along with it, but I kind of hesitate to do that if they might reflect badly on those that I charge for.\n\n"
    },
    {
      "time": "18 Apr 2007 — 4:32pm",
      "content": "Jason, yes, absolutely, get yourself over to myfonts. Looking through your pdf files of Agamemnon I must say I like it a lot. And yes, as in your discussion regarding your design, Eben certainly helped a lot, but so did many others. That is one of the nice features about Typophile in the design section of the forum - members will always make helpful suggestions and it is a great forum for learning. Some might not like your work but they will be helpful. Just a suggestion but Fontographer, though I still use it after many years, can be a bit quirky so I also use Type Tool 3 as well as FontLab Studio. Type Tool 3 is great for $99. No, I don't work for FontLab, just like the products. Good luck with your work.\n\n"
    },
    {
      "time": "18 Apr 2007 — 4:40pm",
      "content": "PattyFab wrote: <cite>Fonts are too subjective for a ratings system.</cite>\n\nI only have several problems with that statement:\n\n1) Plenty of things that are much more subjective than fonts get rated in this world (think IMDB).\n\n2) Fonts are not art, they are a craft - and there \\*is\\* such a thing as better or worse craftsmanship. (In my mind, \"craft\" combines elements of art and science. Architecture is a craft, too.)\n\nThere are plenty of NON-subjective aspects to what typically makes a font crud: incomplete character sets, bad hinting, inconsistent stem weights, inconsistent spacing, lack of kerning, not understanding overshoots, not understanding that verticals need to be heavier than horizontals to look the same thickness, not understanding strokes needing to thin where a curve attaches to a stem.... Getting all that stuff right doesn't make a great font, but getting it all wrong certainly makes a bad one.\n\nPersonally, I'm glad MyFonts exists and that there are outlets for fonts of a wide range of both quality and pricing (which are not synonymous, of course).\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "18 Apr 2007 — 4:46pm",
      "content": "\\> I was thinking maybe a summary based on errors and warnings  \n\\> from Font Validator. I realize this may be a little problematic.\n\nSimon,\n\nIf only Microsoft ever enables FontValidator to be run from a commandline or anyhow different so that a project file can be specified externally -- why not? FontVal is a useful tool but a \"click only\" one. I have proposed this directly to you folks several times and I have just posted a feature request on the [FontVal group](http://web.archive.org/web/20141112054518/http:/groups.msn.com/MicrosoftFontValidatorCommunity).\n\nBest,  \nAdam\n\n(who is also a typographic consultant for MyFonts)\n\n"
    },
    {
      "time": "18 Apr 2007 — 7:40pm",
      "content": "It's impossible to speak without bias, but I'll try to take off my [FontShop](http://web.archive.org/web/20141112054518/http:/typophile.com/wiki/FontShop) hat for a moment and don my [Typographica](http://web.archive.org/web/20141112054518/http:/typophile.com/wiki/Typographica) visor.\n\nIn his endearing Aussie way, muzzer speaks the untarnished truth about quality. Still, [MyFonts](http://web.archive.org/web/20141112054518/http:/typophile.com/wiki/MyFonts) has a generally positive influence on the industry. It offers a reliable web shop for those who are new to type design and want to test the market. There was never an easier way to release a commercial typeface to the world than through MyFonts.com.\n\nResellers like FontShop have a different role to play with their foundry selection process, worldwide print marketing, and telephone support. They appeal to a different kind of market as well.\n\nThen there is exclusive self-release, which has been successful for some. Or even releasing exclusively through one reseller who will offer additional promotion in return. [Veer](http://web.archive.org/web/20141112054518/http:/typophile.com/wiki/Veer) has become famous for this and FontShop offers the option as well.\n\nThere is room for all these approaches, and each foundry might benefit more from one strategy than others. So, in critiquing any reseller (well, these specifically), it's easy to lob insults and defenses (I've done it too), but it's more productive to consider what is best for each foundry/designer in question.\n\n"
    },
    {
      "time": "19 Apr 2007 — 3:57am",
      "content": "Thomas I tend to agree with you re type quality as a function of the mechanics of font creation, \"incomplete character sets, bad hinting, inconsistent stem weights, inconsistent spacing, lack of kerning, not understanding overshoots, not understanding that verticals need to be heavier than horizontals to look the same thickness, not understanding strokes needing to thin where a curve attaches to a stem…. Getting all that stuff right doesn’t make a great font, but getting it all wrong certainly makes a bad one.\"  \nI do think however that most purchasers of fonts these days can discern those faults easily, although I try to include pdf files in my own stuff so customers can more closely examine the things you talk about. As for the specifics of the mechanical stuff, I think everyone in the type \"craft\" business is very much interested to a greater or lesser degree in creating work which meets or certainly exceeds the demands of quality. And yes it can and probably does take years to fully understand the importance of the many nuances of type design. I'm one of these older dudes and I've been learning for many years and will continue to do so until, you know, that day . . .\n\n"
    },
    {
      "time": "19 Apr 2007 — 5:18am",
      "content": "Myself living in Berlin, I greatly value and appreciate flea markets and generally open-sky markets. Sometimes, I do think that MyFonts is that kind of a market square rather than a professionally-sorted department store. On the market square, there is usually a load of people selling plastic pens that will break before the next refill and cheap sport shoes that will fall apart next month. The fruit or the fish there is not shrink-wrapped, but is often fresher than in the department store and is preservative-free. And you're actually able to buy authentic Chanel as well as the knockoff copy.\n\nThe owner of the market square does provide security, and makes sure that the merchants don't cheat. He sorts out the black sheep but does not interfere with their product offerings in other ways.\n\nAmong the buyers at a market square, you'll find the hobos, the seniors and the workers as well as the dandys and the intellectuals. At a department store, you'll more likely to only find the latter, who know how to dress up.\n\nIn the weak moments of pathetic self-appreciation, I like thinking of myself as an intellectual. So I do my shopping both at department stores and at market squares. There are people who'll only pick the former and those who only choose the latter. And I think it is just fine the way it is.\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "19 Apr 2007 — 5:45am",
      "content": "Was that a fish story Adam? :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Apr 2007 — 8:11am",
      "content": "_There are plenty of NON-subjective aspects_\n\nThere are some, but I wouldn't include most of your list.  \nTake hinting for instance. Not every font needs hinting, and some fonts are impossible to hint. So at some point there are grey areas where certain fonts may or may not benefit from hinting, and subjectivity comes into play in appraising them.\n\nThere are different philosophies of hinting. IMO, an alignment-zone hinted font makes a mockery of overshoots, because even at quite large screen sizes, you get the \"v\" and \"w\" stretched to the full height of the \"o\".\n\nSame issue with kerning. Too much can be worse than none.\n\n"
    },
    {
      "time": "19 Apr 2007 — 8:50am",
      "content": "_There are some, but I wouldn’t include most of your list._\n\nwhy not? i think as much info as possible should be made available to the customer and she can decide which aspects are important and which are not for her own purposes.\n\n"
    },
    {
      "time": "19 Apr 2007 — 9:04am",
      "content": "But Paul, how are you going to describe the hinting in a family which has a mix of hints, for vertical, horizontal, and alignment zones, which vary with weight? Font by font, with three check-boxes?\n\nJust saying \"this font has hinting\" is not a measure of quality, because people will be more inclined to believe that's good, when in fact the opposite might be true.\n\nHere's what I mean about how hinting destroys overshoot, on my Mac monitor.  \nThe top font is Lucida Grande -- the Apple system font -- the bottom is Myriad, both of which have alignment zone hinting. The middle is one of mine, where there is no alignment zone hinting, and I did that because I don't like the effect you get in the hinted faces where the \"e\" is dwarfed by the \"v\" and \"r\" on either side.\n\n ![](http://web.archive.org/web/20141112054518im_/http:/typophile.com/files/hint_6740.jpg)\n\n"
    },
    {
      "time": "19 Apr 2007 — 12:36pm",
      "content": "So yay for myfonts, where hacks and hobbyists can sell their poorly made, ill-concieved typefaces alongside the 'big guys' andf make some beer money on the side? Is this why it is so bloody fantastic?? At least back in the day typefaces were considered and crafted, an investment of time was m,made. But now it is GREAT, because the floodgates are open. which results in things like this: [http://typophile.com/node/32643](http://web.archive.org/web/20141112054518/http:/typophile.com/node/32643 \"http://typophile.com/node/32643\") . So good for some i suppose.\n\nkeep up the good work.\n\nMuzz\n\n"
    },
    {
      "time": "19 Apr 2007 — 3:55pm",
      "content": "a rating system? Bloody good idea mate! Leave some feedback, might actually be helpful. fmyonts has no editorial board or techincal requirements or quality control. They gaurantee nothing about what they sell. The only thing they offer is access to a large collection of stuff. Amazon is sortof the same, but they let their customers to comment on what they have purchased, and they also let other customers rate those ratings. This might actually save myfonts from its bloat??\n\nMuzz\n\n"
    },
    {
      "time": "19 Apr 2007 — 4:12pm",
      "content": " ![](http://web.archive.org/web/20141112054518im_/http:/typophile.com/files/mcd_5113.gif)\n\n"
    }
  ]
}
