{
  "id": "33125",
  "title": "myriad pro makes me mad!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i have the full fam of myriad pro. i used linotype x font explorer. when i go into photoshop and try to edit text in that font, it works for a second and then alerts me that the font is missing. changes it to meta or aksidenz.\n\nhelp!!!!\n\nany thoughts?\n\nps: i even went as far as purchasing the font in two styles and reimporting - didn't work.\n\n",
  "author": "<a href=\"/web/20100315120400/http://typophile.com/user/18096\" title=\"View user profile.\">dbsneakers</a>",
  "time": "<br>",
  "uid": "18096",
  "comments": [
    {
      "time": "",
      "content": "I have a 5 year project that uses Myriad Pro. I'm in the last year of it so I've been using it extensively for 4 years. (Edit) Actually it started as Myriad MM.\n\nI also use Lintotype FontExplorerX.\n\nI haven't had one single problem with it.\n\nAre there maybe some Duplicates since you have installed two styles again?\n\nClean the font caches also under the Tools menu in FXX.\n\nBest of Luck!\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "Try completely removing it from FontExplorer, nuking any copies left in the system font directories, and blasting all of your font caches (which font explorer can do).\n\n"
    },
    {
      "time": "",
      "content": "I think you should have titled the thread \"FontExplorer X makes me mad\" or \"OS X makes me mad\" - nothing wrong with the fonts as far as we know.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "\"I think you should have titled the thread...\"  \nmaybe\n\n\", it works for a second and then alerts me that the font is missing. changes it to meta or aksidenz.\"  \nDoes this happen with any other font?\n\n"
    },
    {
      "time": "",
      "content": "I don't have this happen at all on my system. I also have meta and akzidenz loaded so it's a mystery. I wonder if the FON IDs (I believe it's called that) could be confilcting?\n\nDo you have Font Doctor?\n\nHow about FontExplorer X / OSX / Myriad Pro make me mad - take your pick… :)\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "\\> _I wonder if the FON IDs [...] could be confilcting?_\n\nOpenType fonts don't have such thing.\n\n"
    },
    {
      "time": "",
      "content": "Dana, in which platform are you? I hope you're not using the infamous PC version of FontExplorer X...\n\n"
    },
    {
      "time": "",
      "content": "Good to know Miguel.\n\nHave you tried deactivating Meta and Akzidenz to see if that will make Myriad Pro stick?\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "Hi\n\nHave you tried saving the font to base/library/application support/Adobe/fonts.\n\nhope this helps :)\n\n"
    },
    {
      "time": "",
      "content": "I have a client for whom I use the Myriad Pro family as well. The conflict for me, I believe, is in between FEX and Keynote. I finally had to give up using FEX in this instance. I do still use FEX for all of my font management, except for system font management and Myriad Pro management. I've installed, through font book, Myriad Pro into my user folder and have had no problems with Myriad Pro in Keynote since.\n\n"
    }
  ]
}
