{
  "id": "3313",
  "title": "Excuse me please if this posts twice",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have Adobe programs on my PC, running Win98 but the fonts don't show up outside of the program. I haven't installed an ATM because I understand ATM and XP don't get along. How do I install Post Script fonts on XP without an ATM (or can I) ? Where are the fonts located, what extention are they?   \nThanks.\\</font\\>\n\n [‹ Looking for Berlin-city-related font](http://web.archive.org/web/20071211142037/http:/www.typophile.com/node/3288 \"Go to previous forum topic\") [Proper formatting for a period following &#40;tm&#41; ? ›](http://web.archive.org/web/20071211142037/http:/www.typophile.com/node/3310 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071211142037/http://www.typophile.com/user/2662\" title=\"View user profile.\">link</a>",
  "time": "<br>",
  "uid": "2662",
  "comments": [
    {
      "time": " 25.Feb.2004 5.51pm",
      "content": "I never heard about ATM and Win XP not getting along...   \nThat said, you install PostScript fonts on Windows 2000 and XP the same way you install TT or OT fonts - go to \"Fonts\" in the Control Panel, or to the Windows\\Fonts folder with Explorer, then go to File \\> Install New Font.   \n   \nWindows XP and 2000 natively support PostScript fonts.\n\n"
    },
    {
      "time": " 25.Feb.2004 6.18pm",
      "content": "Thanks for posting and your help.   \nWhere do I find the PostScript fonts?\n\n"
    },
    {
      "time": " 25.Feb.2004 6.33pm",
      "content": "The location of the fonts will depend on the programs you have installed and their respective versions. Just do a search for .pfm or .pfb files within your \\program files\\adobe folder and they should come up.\n\n"
    },
    {
      "time": " 25.Feb.2004 6.47pm",
      "content": "Thanks again Adriano ... do I need to highlight and install both the .pfm and .pfb ... or, are they the same?\n\n"
    },
    {
      "time": " 25.Feb.2004 6.58pm",
      "content": "You'll need both.\n\n"
    },
    {
      "time": " 25.Feb.2004 7.02pm",
      "content": "Thanks! You're the best. Thanks for hanging in there with me ![:-)](http://web.archive.org/web/20071211142037im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nBest, linda\n\n"
    },
    {
      "time": " 25.Feb.2004 7.54pm",
      "content": "I am running ATM 4.1 and XT on my laptop without any problem.\n\n"
    },
    {
      "time": " 25.Feb.2004 8.30pm",
      "content": "Is there an advantage to having ATM? Is 4.1 the light version or $?\n\n"
    },
    {
      "time": " 25.Feb.2004 9.12pm",
      "content": "ATM will let you install and uninstall fonts without going through the control panel, but that's about it.   \n   \nI stopped using it after the transition to XP because I couldn't stand the way it interacted with the system. And no matter what I did, I couldn't get the windows font viewer to reassociate with postscript fonts, even after uninstalling ATM.\n\n"
    },
    {
      "time": " 25.Feb.2004 10.10pm",
      "content": "It lets me group fonts by sets and activate/ deactivate them as groups.   \nMaybe you can do that in control panel too, I don't know. I also use it as   \na font viewer (just double click). It works for me, but I wouldn't say I'm   \npassionate about it.\n\n"
    },
    {
      "time": " 26.Feb.2004 3.34am",
      "content": "Thanks so much! My new PC is smarter this morning; me too, marginally ;) I installed directly to XP without an ATM. Figured I might as well be safe than sorry. I've had enough trouble setting this latest and greatest machine up. Still having XP growing pains. Still looking for BroadwayBT-Regular and Engravers Gothic BT-Reg (they are on one PC and not the other)Woe is me ![:-)](http://web.archive.org/web/20071211142037im_/http:/www.typophile.com/forums/clipart/happy.gif))   \nHave a great day! linda\n\n"
    }
  ]
}
