{
  "id": "33142",
  "title": "Rounded Form = Organic?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "has anyone noticed a trend in organic this and that? nearly every instance i come in contact with on a day to day basis that utilizes type has some sort of rounded features softening the edges. i’m not saying the aesthetic is entirely off the mark, just seems weird that rounded types have come to mean organic. i guess childish/cute and soft means healthy and good for the enviornment…pure perhaps? has anyone else noticed this? does it bother anyone?\n\n\\_will\n\n",
  "author": "<a href=\"user/4552\" title=\"View user profile.\">Will Miller</a>",
  "time": "<br>",
  "uid": "4552",
  "comments": [
    {
      "time": " 18 April, 2007 - 11:15am",
      "content": "“childish/cute and soft means healthy and good for the enviornment”\n\nI don’t draw this parallel. Sounds like there are several ideas/trends that overlap. Maybe it’s worthwhile to identify the different trends. For instance, lots of polluting consumer items are styled to look soft and round (like cars). At the same time, lots of people concerned with sustainability and green materials don’t follow the “soft and cuddly” esthetic. Form, in a lot of cases, is not following function, it’s following trends.\n\nI think “organic” applied to type means there are human, natural elements, as opposed to mechanistic, geometric or modular. This could be anything from the proportions to the serif shapes to the curves to the edge quality. Not necessarily rounded or cute.\n\n"
    },
    {
      "time": " 18 April, 2007 - 12:22pm",
      "content": "<cite>At the same time, lots of people concerned with sustainability and green materials don’t follow the “soft and cuddly” esthetic.</cite>\n\nI work for an environmental non-profit, and we use \\*interstate\\* on a lot of our publications.\n\n"
    },
    {
      "time": " 18 April, 2007 - 4:45pm",
      "content": "Yes, Modernism is dying. Godspeed.\n\nhhp\n\n"
    },
    {
      "time": " 18 April, 2007 - 9:04pm",
      "content": "Interesting… I have been working on an organic rounded font. I’ve shown it on typophile before, but I’ll show it here again for the sake of this discussion.\n\nJ\n\n ![](http://web.archive.org/files/router_6280.jpg)\n\n"
    },
    {
      "time": " 18 April, 2007 - 9:17pm",
      "content": "Wow, Jeremy. That tagline feels curiously paralell to those like “Ribbed for her pleasure”.\n\n"
    },
    {
      "time": " 18 April, 2007 - 9:26pm",
      "content": "[http://emigre.com/fontpage.php?PMoRib.html](http://web.archive.org/web/20070618145007/http:/emigre.com/fontpage.php?PMoRib.html) \\_  \nAnd that’s nothing - you should see the 3D version.\n\nhhp\n\n"
    },
    {
      "time": " 19 April, 2007 - 7:56am",
      "content": "“Yes, Modernism is dying.”\n\nThe radicalism of Modernism was killed a long time ago. First by the cooption of it’s formal stategies by Corporate Capitalism and then by the pastiche of Postmodernism.\n\n"
    },
    {
      "time": " 19 April, 2007 - 8:03am",
      "content": "\\>childish/cute and soft\n\nThat’s only one kind of curve, not that I’m prejudiced against cute. The sinuous curves of art Nouveau are not ‘cute’ nor are the curves of Caslon’s muscular italic. Curves can be dynamic, like the Concorde, or sexy, like—well choose your favorite lady or gentleman.\n\nSharp corners and straight lines are mechanical, and can have their own power, but the world of curves has a much greater variety, both of form and mood.\n\n"
    },
    {
      "time": " 19 April, 2007 - 8:22am",
      "content": "And the best world is the hybrid one.\n\nhhp\n\n"
    },
    {
      "time": " 20 April, 2007 - 5:29am",
      "content": "joshua darden’s Omnes…we used it for awakeningorganics.com mostly in the thinner weights but a few areas of the fatter variety. it got me looking at rounded letter forms. i love the way that face shines in it’s fatest form. the contrast of sharp to soft. it started to make me feel as if the usual completely rounded forms were like squishy, plush toys; filled to the gills with foam and bloated for no better reason than because.\n\nw|m\n\n"
    }
  ]
}
