{
  "id": "33151",
  "title": "Gothic Fonts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I need something like Walden Font's Type No. 5, the same height and weight. But I want something with other weight options and a lower case. I have included some samples. Thanks.\n\nSharon\n\n| Attachment | Size |\n| --- | --- |\n| [TypeNo5.jpg](http://web.archive.org/web/20140912004411/http:/typophile.com/files/TypeNo5.jpg) | 12.27 KB |\n\n",
  "author": "Sharon Van Lieu",
  "time": "19 Apr 2007 — 12:06am",
  "uid": "3775",
  "comments": [
    {
      "time": "19 Apr 2007 — 6:27am",
      "content": "Check the [Knockout](http://web.archive.org/web/20140912004411/http:/www.typography.com/catalog/knockout/index.html) series and [Titling Gothic](http://web.archive.org/web/20140912004411/http:/www.fontbureau.com/fonts/TitlingGothicFB/styles), and try to avoid that [squooshed](http://web.archive.org/web/20140912004411/http:/typophile.com/wiki/squooshed).\n\n"
    },
    {
      "time": "19 Apr 2007 — 8:14am",
      "content": "Brown has something of that distressed quality.  \n [http://www.fontshop.com/search/?q=brown&site=d&btnG=Go](http://web.archive.org/web/20140912004411/http:/www.fontshop.com/search/?q=brown&site=d&btnG=Go \"http://www.fontshop.com/search/?q=brown&site=d&btnG=Go\")\n\n"
    },
    {
      "time": "19 Apr 2007 — 10:23am",
      "content": "Thank you, both.\n\nSharon\n\n"
    },
    {
      "time": "20 Apr 2007 — 11:07pm",
      "content": "I highly recommend Nick's Brown, as well as [Maple](http://web.archive.org/web/20140912004411/http:/www.fontshop.com/search/?q=Maple) and [FF Hydra](http://web.archive.org/web/20140912004411/http:/www.fontshop.com/search/?q=FF%20Hydra).\n\n"
    },
    {
      "time": "21 Apr 2007 — 10:56am",
      "content": "One question I have is how you match fonts in photoshop with what you see on sites like Font Shop. A font at 36pts in Font Shop is much larger/wider than the same font on my computer in Photoshop at 36pts. How can I match the size? My browser, Firefox, is set for Normal text size.\n\nI know this is a dumb question, but sometimes I buy fonts and they aren't really the right size for what I need. I only need a few weights now at a certain size.\n\nThanks,\n\nSharon\n\n"
    },
    {
      "time": "21 Apr 2007 — 4:08pm",
      "content": "They may be different versions of the font and that's why you see a difference at the same point size. But I'm not sure I understand why it matters. Do you need to set the type at a certain point size? Any font can be set at any size.\n\n"
    },
    {
      "time": "21 Apr 2007 — 4:36pm",
      "content": "I understand about setting the font sizes. :-) I think I'm not expressing this very well. I'll try to think of a way to explain it better. I have a feeling it's just a visualization defiency of mine. Thanks for your suggestions above, Stephen.\n\nSharon\n\n"
    },
    {
      "time": "21 Apr 2007 — 5:07pm",
      "content": "I am going with Titling Gothic. However, choosing between compressed, condensed and narrow is where I get confused. I can't determine from what I see on Font Shop or Font Bureau which one will match the text on my web page the closest. I don't know why this is so hard for me to see but I sometimes have this problem. The only thing I know to do is buy several weights and see which one is right. So I'm getting compressed and condensed light, compressed and condensed regular, condensed medium, condensed and normal black.\n\nSharon\n\n"
    }
  ]
}
