{
  "id": "3315",
  "title": "Senator",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "this is a sketch I'm working on right now - I've been trying to make a family, ideally for body text, but in the end it could end up only being worthwhile as a display font (if it's worthwhile at all, that is!)   \n   \nunfortunately the lowercase in this style looks terrible - and I don't see any way of making it look right - so I'm thinking of making it into a small caps face, which would make it a less impossible matter of combining the right heights for UC / lc.   \n   \nso, I have a question:   \nhas this been done already? :D   \n   \nit just seems like such an obvious idea, someone must have done it already (as a bitmap, like this)?   \n   \nany thoughts or criticism of the face itself are also greatly appreciated.   \n   \n ![senator](http://web.archive.org/web/20150414200558im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n",
  "author": "afo",
  "time": "13 Sep 2002 — 11:23pm",
  "uid": "830",
  "comments": [
    {
      "time": "13 Sep 2002 — 11:33pm",
      "content": "woops... didn't think going back would still submit.   \n   \nhere we go again:   \n   \n ![senator](http://web.archive.org/web/20150414200558im_/http:/www.typophile.com/forums/messages/29/2726.gif)\n\n"
    },
    {
      "time": "14 Sep 2002 — 2:33am",
      "content": "\\> has this been done already?   \n   \nOnly the [name](http://web.archive.org/web/20150414200558/http:/www.emigre.com/EF.php?fid=119).   \n   \nI know Hrant will be thrilled with the 2-pixel stem widths.   \n   \nI really enjoy it at 5-7 pts.\n\n"
    },
    {
      "time": "14 Sep 2002 — 2:42am",
      "content": "I would drop the interior stroke on the 'Q' at   \nsub-10 sizes.\n\n"
    },
    {
      "time": "14 Sep 2002 — 9:36am",
      "content": "I do like the thick-and-thin stems - it has a nice Art Deco feel, and I can't remember a font like this offhand.   \n   \nThe main problem is that without an lc this can't be a text face... Why would the lc look terrible? Maybe it gains too much width because of the 2-pixel stems? I'd like to see what you have. Also, maybe try a version of 16-pixel height.   \n   \nhhp\n\n"
    },
    {
      "time": "14 Sep 2002 — 12:48pm",
      "content": "here's what I had for the lc:   \n   \n ![lc](http://web.archive.org/web/20150414200558im_/http:/www.typophile.com/forums/messages/29/2729.gif)   \n   \nthe first 2 rows are trying to follow the same stem-width \"rule\" set by the UC - the 1st row is just more strict about it than the second.   \n   \nthe other option, the 3rd row, would be to leave out any thickness to the lc, which might work - but... I think that would also defeat the whole purpose of this font.\n\n"
    },
    {
      "time": "14 Sep 2002 — 12:58pm",
      "content": "I think your second row is just dandy - and don't let \"rules\" reduce the functionality of your font. The only thing I'd change is in making the middle stem of the \"m\" thick.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Sep 2002 — 3:42am",
      "content": "\\> has this been done already?   \n   \nwell, i remember once i made a sketch of something that looks alot like this. and counting how creative the pool of type designers are, i guess some people have allready thought of this. but - this is a very nice font. ahnd i have never seen a family built on this idea. ive never seen any font like this. so i advice you to continue to work on it. the X's and W's look alittle broken in all wieght. and i think hrant is totaly right, a wider middle stem for the 'm' will make it look better. maybe a wider middle stem for the 'w' too...\n\n"
    },
    {
      "time": "16 Sep 2002 — 8:13am",
      "content": "yay contrast!   \nthe Q is a little wonky looking...thought it was my screen breaking up the line.\n\n"
    }
  ]
}
