{
  "id": "33173",
  "title": "A sans that plays nice with Clarendon?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm using Clarendon at 64 points and need a sans that reads well and looks good at 20, 14, and 10pts on page that has huge Clarendon. This is for a photographer's website, not a print piece, by the way.\n\nEDIT  \nI don't normally use images as text when I make websites, this time I'm making an image heavy rather than a copy heavy site and feel the look is more important, so I'll be using image text.\n\n",
  "author": "grod",
  "time": "19 Apr 2007 — 11:53am",
  "uid": "5267",
  "comments": [
    {
      "time": "19 Apr 2007 — 12:01pm",
      "content": "If it's for a website why don't use a times or an arial ?\n\n"
    },
    {
      "time": "19 Apr 2007 — 12:04pm",
      "content": "Nobody is a bigger advocate of accessibility than I am, but this is for a photographer's portfolio, times and arial don't meet my needs.\n\n"
    },
    {
      "time": "19 Apr 2007 — 12:08pm",
      "content": "I've always thought that Helvetica looked reasonably good with Clarendon. They share a similar underlying structure.\n\n"
    },
    {
      "time": "19 Apr 2007 — 12:08pm",
      "content": "If it has to be a web font you have to choose between : Arial, Times, Courrier, Georgia, Geneva and Verdana.\n\n"
    },
    {
      "time": "19 Apr 2007 — 12:08pm",
      "content": "Are you setting the text as html or as an image?\n\nI think Avenir and Gotham both would go nicely with Clarendon's roundness but not for html.\n\n"
    },
    {
      "time": "19 Apr 2007 — 12:27pm",
      "content": "I'll be using images everywhere except the \"about\" page, which will be the only copy heavy page, anyway. I'm only looking to set about twelve words in this font, so using a picture is fine.\n\n"
    },
    {
      "time": "19 Apr 2007 — 12:47pm",
      "content": "Image texts are really annoying on a website, especially when you want to copy some informations so what you can do is to use css code which says that if someone hasn't the first typography it swaps to the following one, for exemple :\n\n{font-family: Helvetica, Arial, sans-serif}\n\nThis way users that has a mac and those who bought Helvetica can see it and the others will see Arial.\n\n"
    },
    {
      "time": "23 Apr 2007 — 11:42am",
      "content": "I've used Trade Gothic with Clarendon. I especially like how the \"Extended\" fonts go with it.\n\n"
    }
  ]
}
