{
  "id": "33171",
  "title": "Narrow Caps-only Display Font",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "So, I basically threw this together in an evening. It sort of reminds me of the very narrow type used in movie credits on posters, except a little wider.  \nI need to work on metrics a little (for example, L has too much space on the right).  \nI'm also still working on implementing diacritics, but before I do, I need some advice for Æ and Œ, which you can see at the bottom of my PDF. I created the first set by basically just sticking the letters together and adjusting where they connect. The second is opened up a little to help balance the counter. I think I like the second set better (certainly for Æ), but what do you think?  \nI haven't settled on a name yet--I always seem to come up with those at the very last.\n\n| Attachment | Size |\n| --- | --- |\n| [Premier sample.pdf](http://web.archive.org/web/20150419043555/http:/typophile.com/files/Premier%20sample.pdf) | 22.32 KB |\n\n",
  "author": "WurdBendur",
  "time": "19 Apr 2007 — 11:25am",
  "uid": "8474",
  "comments": [
    {
      "time": "20 Apr 2007 — 1:10pm",
      "content": "This looks really nice. I especially like the curve in the lower right of the G. The second set of Æ / Œ look much better than the first.\n\nI think the M is too wide. It stands out because it's about twice as wide as all the other characters. I'd make it close to the same width as the E, with diagonals at about 45 degrees which only reach down about 1/3 of the way from the top. Maybe try the same thing with the W (I'm assuming it's similar width to the M). I don't see the Cyrillic Ж, but that's also a wide character with the potential to stand out too much.\n\n"
    },
    {
      "time": "20 Apr 2007 — 4:24pm",
      "content": "I also find the M a bit too wide. The solution Matt has posted, sounds like it could work. The spine of the S seems a bit too geometric. It could be more smooth.  \nI understand geometrics are the basis for this typeface, but especially then optical corrections are needed here and there.  \nI like the G and the R, and the lower right curve of the G as well, although that one has a little bump in it. :)\n\n"
    },
    {
      "time": "21 Apr 2007 — 12:03am",
      "content": "I too thought the M might be too wide. Let's try something more narrow.  \n [Here](http://web.archive.org/web/20150419043555/http:/img.photobucket.com/albums/v629/WurdBendur/m_height.png) I've made a series of Ms, starting with the original on the left. I narrowed so it's a bit more comfortable (It's still wider than the E, though, and I might try to narrow it a little more) and brought up the middle. I'm not sure how far to go, but I think you're right to suggest that it should go about 1/3 of the way down.\n\n<cite>Maybe try the same thing with the W (I’m assuming it’s similar width to the M).</cite>\n\nIt's actually the same width (with a little less space), but the angles make it look narrower. It's a lot less obtrusive. It may be okay, but I'll [experiment](http://web.archive.org/web/20150419043555/http:/img.photobucket.com/albums/v629/WurdBendur/w_height.png) with it anyway. I've done the same thing here as with the M, but also widened the base a bit because it started to look odd as I lowered the middle.\n\nAs for Cyrillic, [here](http://web.archive.org/web/20150419043555/http:/img.photobucket.com/albums/v629/WurdBendur/basic_cyrillic.png) is the full basic alphabet.  \nI usually like to distinguish the Cyrillic К from the Latin K, usually just by turning or hooking the arm, but this time I just let it be the same since I'm simplifying everything so much anyway. The Ж is just built from two of these back-to-back, but it looks a little wide this way.  \nI also considered making the Ф wider, but I'm afraid it'll become too big.\n\n<cite>The spine of the S seems a bit too geometric. It could be more smooth.</cite>\n\nGood point. I think there's [more than one solution](http://web.archive.org/web/20150419043555/http:/img.photobucket.com/albums/v629/WurdBendur/geometrics.png) to this. I can keep it geometric and make it less horizontal, or I could really smooth it out. Either way, I think I need to adjust my proportions.\n\n<cite>although that one has a little bump in it. :)</cite>\n\nOops. [Bump fixed](http://web.archive.org/web/20150419043555/http:/img.photobucket.com/albums/v629/WurdBendur/fixedg.png) (on the left).\n\n"
    },
    {
      "time": "21 Apr 2007 — 4:57am",
      "content": "The link of 'more than one solution' seems to be not there. :)\n\n"
    },
    {
      "time": "23 Apr 2007 — 10:45am",
      "content": "I like the 6th and 7th Ms, and the last W, best. Have you tried sloping verticals on the M, so that it's basically an upside-down W? That sometimes looks good.\n\nI'd forgotten about the Ш and Щ, which are equally wide in Cyrillic. Perhaps you don't need to take them, and the Ж, down to as narrow as the rest of the characters, but I still think they will stand out somewhat in a line of text at their current almost double-width.\n\nI agree that the spine of the S is too horizontal -- I think it should be diagonal.\n\nAnyway, this is great work and I'm glad that my comments were helpful.\n\n-matt\n\n"
    },
    {
      "time": "23 Apr 2007 — 1:03pm",
      "content": "<cite>The link of ‘more than one solution’ seems to be not there. :)</cite>\n\nOops, I broke my HTML. It' fixed now, or you can just look here: [http://img.photobucket.com/albums/v629/WurdBendur/geometrics.png](http://web.archive.org/web/20150419043555/http:/img.photobucket.com/albums/v629/WurdBendur/geometrics.png \"http://img.photobucket.com/albums/v629/WurdBendur/geometrics.png\")\n\n<cite>I like the 6th and 7th Ms, and the last W, best. Have you tried sloping verticals on the M, so that it’s basically an upside-down W? That sometimes looks good.</cite>\n\nI haven't tried it, but I've had it in mind.\n\n<cite>I’d forgotten about the Ш and Щ, which are equally wide in Cyrillic. Perhaps you don’t need to take them, and the Ж, down to as narrow as the rest of the characters, but I still think they will stand out somewhat in a line of text at their current almost double-width.</cite>\n\nOh, I had forgotten those too. I guess I can narrow the first two easily enough, though I might have to do something tricky with the Ж.\n\n<cite>Anyway, this is great work and I’m glad that my comments were helpful.</cite>\n\nThanks to both of you!\n\nComing soon: Greek\n\n"
    },
    {
      "time": "23 Apr 2007 — 3:36pm",
      "content": "Ah, stupid html! ;)  \nAnyway, you can see that by giving that S some work, it has already improved.  \nThe second S from the left is looking far more natural, eventhough it is still pretty geometric. The second one from the right is also ok, though the right one is not geometric enough anymore, in my opinion.\n\n"
    },
    {
      "time": "6 May 2007 — 5:00pm",
      "content": "very nice... V magazine-ish.\n\n"
    }
  ]
}
