{
  "id": "33188",
  "title": "Art versus Design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I have always been artistic. When I was a kid I use to pain watercolors of dinosaurs and fighter jets. When I was in middle school it was comic book character and rock and metal band logos. In high school I took a class called Drawing and Commercial art, and it was around that time that I really seriously became involved in design, especially concert posters and album covers and the like. I recently started going to school for design after a few false starts. One thing I have noticed is that I clash with some of my instructors over design... because I am so art oriented they have a hard time with that because it's not rigid or organized or whatever.\n\nI recently heard David Carson remark on the following question... where does art end and design begin? It's a question I have been thinking a lot about, especially since I'm at a crossroads in my education. So what is the difference? Where does one begin and the other end?\n\n",
  "author": "thetophus",
  "time": "19 Apr 2007 — 8:09pm",
  "uid": "18133",
  "comments": [
    {
      "time": "20 Apr 2007 — 3:17am",
      "content": "I think design IS a form of art (the new Pop Art), but hasn't been recognized as that yet. The difference is maybe that art is usually not made for someone else & should only satisfy the artist. In design however the client has the final word & he has to be satisfied even if that means leaving the designer in complete disagreement. The times, they are a-changing & just as much as Pop Art was first sniffed at by the art connaisseurs, it will take some time for design to find its way to recogntition. Today, there are more means & tools for reaching more people than ever & there's no longer a need for a \"bridge\" (read: galleries and such) between the artist & his audience. Design is a far more direct & interactive kind of art, but I'm sure within a few years the already fine lines between art & design will blur even more & eventually disappear. In the future there will probably be no more need for art as such, because it will be all around us. Most people just still need to learn to look at things with different eyes. It's about changing the state of people's mind & time will surely do that for us.\n\n"
    },
    {
      "time": "20 Apr 2007 — 3:22am",
      "content": "In art you please yourself - in design you please the client. In art you can be universal - in design you solve a specific problem. If you only want to do your own thing stick to art but if you want to help other people with their thing go for design.\n\n"
    },
    {
      "time": "20 Apr 2007 — 4:52am",
      "content": "OK, so you're a student and you have a design problem to solve.  \nSome of you will seek the direction that's \"out there\", working with precedents that have proven effective, and in this you're learning to sync up with the way that professional design culture works, becoming familiar with its techniques, styles and nuances. Others will take a more experimental approach, which is likely to be more expressive of what's inside. There's room for both approaches to design, and anything on the spectrum, because clients vary. Just be aware that David Carson's kind of design, revered though it may be in the metaculture of the design world, and the kind of clients who support that kind of approach/attitude, are in the minority in the workaday world.\n\n"
    },
    {
      "time": "20 Apr 2007 — 4:56am",
      "content": "the two previous make very good points (\"design is a form of art\" / \"\"in art you can be universal - in design you solve a specific problem...\"). this is actually a topic that's being delved into in another current thread: [http://typophile.com/node/33143](http://web.archive.org/web/20130824173737/http:/typophile.com/node/33143 \"http://typophile.com/node/33143\")  \nthe problem is, the question itself is so subjective that 100 people will give one hundred different responses. was lautrec an \"artist,\" or was he a \"designer\"? what about warhol or rembrandt or carson? depending on your viewpoint, contradictory arguements can easily be made.  \na more important question (i believe), then, is how does an individual find their voice of expression? one of my favorite authors is gabriel garcia marquez. he lives and writes in colombia. he writes in spanish.\n\ni can't read spanish.\n\nedith grossman is his translator, and through her work, i am able to understand and appreciate garcia marquez's writing.\n\n"
    },
    {
      "time": "20 Apr 2007 — 5:03am",
      "content": "Is this for a dissertation? My friend is doing it on this topic. Art is a form of communicating thoughts and feelings in any form i.e be it abstract or realistic and design is something designed for a purpose i.e. a chair for sitting on, a bed to sleep on but then it has the aesthetics of becoming a part of art too as you could have a simple chair but then they are all different beacuse some oare jsut wooden and are minimalist and others have chrome legs and a different material for the back etc so then it becomes a form of art and design as Bauhaus believed in 'Form over Funnction'. Look into Bauhaus.\n\n"
    },
    {
      "time": "20 Apr 2007 — 5:40am",
      "content": "A classic discussion of art vs craft is in R.G. Collingwood's [Principles of Art](http://web.archive.org/web/20130824173737/http:/www.amazon.com/Principles-Art-Galaxy-Books/dp/0195002091/ref=sr_1_13/002-0804764-7091213?ie=UTF8&s=books&qid=1177071260&sr=8-13).\n\nBasically the generally accepted view, probably influenced by Collingwood, is, as Miss G. says, that the difference is in the goal: art is aimed at self-expression or communication of a personal vision, whereas design is in service of another purpose. That may be a comfortable chair, a readable book, a liveable house, and advertisement that sells a product. Aesthetics is always part of design, but it is in a service role--serving the purpose of the design.\n\nThus the difference is not in use of materials or even in aesthetic merit, but purpose. Thus there are said to be Frank Lloyd Wright houses that are great aesthetically but their roofs leak and the kitchens are too small for use. Great as art, but failures as design.\n\nAs I wrote in the other thread, to me what is exciting about design is that it is part of the texture of daily life, and makes other people's lives better. The down side for some is that design has a service role, not a starring role. There is an essential humility about good design. What the designer gets in return for that humility is a widespread presence and usage that art almost never has.\n\nAnother aspect that Collingwood writes about is that in artistic creation the artist doesn't know the end goal, but it is discovered in the artistic process. The craftsman knows much better his or her end goal, and what constitutes success in achieving it. This distinction is a bit more problematic, as there is also discovery in a design process, but I think there is something in it.\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:04am",
      "content": "Art ends and design begins with the client.\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:12am",
      "content": "If you have a specific content that intends to be communicated to elicit a specific response from a targeted audience, you have design.  \nClient is saying something to his potential customers to get them to buy his product.  \nClient is explaining to shopping mall visitors how to get around the facility so they find their desired destination.\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:15am",
      "content": "chris -- but what about rembrandt's portraits? almost all of them were commissions (work for clients)... the line's more blurry, i think. maybe there isn't even a line at all. sometimes, it seems like seuss's sneetches. us and them.\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:28am",
      "content": "Chris, though I agree in general, there is an exception. As Patty noted in the other thread on 'best designer', some people are commissioned to do art.\n\nIf a maker of things visual has a client that wants art, then that maker can be an artist rather than a designer. So it seems the key issue of art vs design is not only whether there is a client, but whether the priority is on serving primarily needs and goals of the client, or primarily the creative's own personal expression.\n\nedit: I cross posted with you, Chuck. The case of Rembrandt I think shows that the difference is in the purpose of the work rather than the result. You can have dreadful, failed art that is still clearly art, in terms of the goal of self-expression. And you can have things that are clearly design, but are artistically superior to much art.\n\nSo maybe Rembrandt had to put a priority on some of his portraits being good likenesses and flattering, but they ended up great art anyway. And if I executed a portrait with self-expression in mind, I am sure the result wouldn't be any Rembrandt!\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:44am",
      "content": "The lines that devide art from design are very thin & more than often get intertwined. I likes Chris's statement that art ends & design begins with the client, but as Chuck said even artists like Rembrandt worked for clients. Heck, Warhol spent a great deal of his artistic life doing commisioned portraits just to finance his filming career. It's too much of an ideal to think that the goals in art & design are different. Ever since art became popular for the masses & branding became a part of design, there's no longer a line to draw between the two. And even designers sometimes use an older idea for a new assignment, so the approach is not all that different either. New techniques have just made it easier for both artists & designers to showcase & promote their work. Maybe the given deadline in design is the only distinctive difference left. I think the terms artists & designers are titles that you can only get through recognition by others & their point of view will then decide which of the two you really are. I predict that in a few years from now graphic design & art will all be consumed under the same factor being culture.\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:46am",
      "content": "My definition:  \nArt = client is you  \nDesign = client is paying you\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:51am",
      "content": "i agree that intent is very important when we're separating art from everything else. another example might be william carlos williams; \"this is just to say\" moves from a quick note to poetry solely because of intent. but i also maintain that ultimately such classifications are more a human desire to generalize than they are useful or meaningful understandings.\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:57am",
      "content": "But what if the artist makes his work for an exposition (they're often asked to participate in group expostions for example) or sells a piece of art? Does the art became design in that case?\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:58am",
      "content": "but i would also say that many students use the \"i'm an artist\" crutch to justify their own work in response to an instructor's goal of instructing. it becomes a \"i can't be wrong because i'm an artist\" excuse, as if the student is struggling against the whole purpose of their education.\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:02am",
      "content": "Chuck and William,  \nI added my second post as a way of clarifying the first. I realize that there has been commissioned art for centuries. The pieta, the ceiling of Michaelangelo, etc. You might call these things design in art's clothing. If the Pope or the Medici, or the wealthy patrons of Rembrandt either specifically said \"This is what I want, do it this way\" or if was just implied by their position of power, criteria were set with a purpose to be achieved and a price was paid for that. There is no doubt that an artist with the talent of Rembrandt would certainly be quite artful in his execution of the portrait contract. I wonder what he would have done if he could just do it his own way? To me, when the message is clear to convey and the terms are agreed upon, it is design--or at least \"by\" design. For my taste in art, the stuff I quickly pass by in any museum or gallery, is the commissioned portrait of the wealthy and powerful. Even though they may be exquisitely painted, they are typically boring to me. I can admire them for great articulation and painterly skill--even for getting the rich old bugger to agree to pay for the thing but I would rather see something done without the need for ego-stroking and anointment to deity of the commissioner.\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:06am",
      "content": "what i think was particularly \"artful\" in rembrandt's portraits was his ability to (in a fairly subversive way) inject his own viewpoints into his commissioned work, saying what he felt was important while tricking the client into thinking otherwise.\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:10am",
      "content": "\"students use the “i’m an artist” crutch\"\n\nOh, how true! These are the same folks who will grow up to become an \"Artiste\" and do selfannointing crap while living off of someone else's labors.\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:12am",
      "content": "\"while tricking the client into thinking otherwise\"\n\nThat is what I meant by \"getting the old bugger to pay\" . :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:14am",
      "content": "arty and crafty!\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:17am",
      "content": "Ah yes! There is a movement in there somewhere Chuck :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:54am",
      "content": "I kind of like the old terms \"commercial artist\" and \"fine artist.\"\n\nIf a fine artist gets a commission to do a painting, it's not the same as when a commercial artist gets an illustration assignment. In a fine art commission, it would be pretty outrageous for the client to send a painting back to the artist with a list of revisions. With commercial art, revisions are normal.\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:57am",
      "content": "Well, as a kid & adolescent I was often referred to as \"an artist\" & since then I've come to dislike the term. It was also -in a very \"box minded\" way- used to describe parts of my personality that had absolutely nothing to do with drawing (eg. a kind of laissez-faire attitude, an -occording to others- weird sense of dressing, sleeping till noon & staying up all night) & apparantly most of these prejudices have survived till today. And now, the same is happening with the word \"designer\". Proclaiming oneself as either an artist or a designer is just pretentious & as stated in previous posts often an easy excuse. I don't like to be referred to as either, but I'd rather have myself described as a (graphic) illustrator. That's the most objective describtion I can think off & I hate the idea of myself or anyone else for that matter putting me in a predefined box. I also like to write every now and then & everyone that has read some of my texts defines it as poetry, but the same problem arises here. Poetry is also something for others to decide, but every arty farty term now comes with a denotation due to misuse by pretentious wannabe's. Therefor I simply refer to my texts as lyrics without music or simply texts. My drawings or designs if you will (the term can be broadly interpreted & can also just mean graphic work) are just drawings. Nothing more, nothing less.\n\n"
    },
    {
      "time": "20 Apr 2007 — 8:03am",
      "content": "art history is full of portrait artists having to redo paintings until the patron was happy.\n\n"
    },
    {
      "time": "20 Apr 2007 — 8:18am",
      "content": "\"art history is full of portrait artists having to redo paintings until the patron was happy.\"\n\nI know of several cases in this year. Think of why some people today get their portraits painted instead of photographed?\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 8:39am",
      "content": "I would put commissioned portraits in the commercial art column, in spite of the fact that they sometimes end up in art museums. As has been said, the line is a bit fuzzy.\n\nUltimately, I think it comes down to expressing one's own message or vision vs. expressing a client's message or vision. The fuzzy part comes when these two goals are intermingled.\n\n"
    },
    {
      "time": "20 Apr 2007 — 9:11am",
      "content": "Here’s a fun one: how much classic fine art should really be classified as design? Why do art historians seem to think that the Sistine Chapel and all of the paintings inside are great examples of fine art that have more in common with the work of Mark Rothko than with the environmental design that Vignelli and Associates did at St. Peter’s in New York? Why do the great Roman sculpture copyists get associated more with Rodin than with Aalvar Aalto? Why are the great scribes who produced the _Book of Kells_ covered in surveys of western art history, as well as William Morris, but one has to pick up design history books to find mentions of Jan Tschichold, and a biography to understand the work of Paul Renner?\n\nI think that one reason the line between art and design is so hard to define is that even art historians have a hard time dealing with the magnitude of the break with tradition that occured in the Twentieth Century. I believe that today’s designers are the scions of the masters that preceded modernism, and that what people now refer to as fine artists are a very different animal following—and establishing—an entirely new tradition.\n\n"
    },
    {
      "time": "20 Apr 2007 — 9:31am",
      "content": "Agreed. Michaelangelo was a designer with a brief and a client.\n\nThe Goldberg varaiations were commissioned in order to allow someone to sleep (the story is slightly different but this part remains true).\n\npeace\n\n"
    },
    {
      "time": "20 Apr 2007 — 9:37am",
      "content": "it's true. very confusing. i try to avoid the classifications altogether.  \ni mean think about it: until last century, i would guess almost 50% of western art was religious in subject. so-- were these paintings, drawings, etchings, etc. \"art,\" or were they illustrations?\n\n"
    },
    {
      "time": "20 Apr 2007 — 9:41am",
      "content": "Graphic design as we know it is a fairly new profession. I might guess that if we begin looking at when words and pictures were created together as a piece, we might get closer to a defining moment. The words would also have to be with purpose and meant to augment the image with a message. Georges Braque's still lifes with \"Journal\" in the mix don't cut it but perhaps the work of Toulouse-Lautrec really bridges the gap. Perhaps art historians have ignored commercial work like posters and play bills as ‘non art’ unless the artist involved also had a painting career.  \nAndy Warhol studied art at my alma mater CMU, and we had some of the same teachers. Robert Lepper was one of them. He spoke of Warhol occasionally and mentioned he had taken some graphic arts classes there as well. Andy used combined graphic arts images with his fine art work as a mode of self expression rather than for a clients need.\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 9:53am",
      "content": "At school/college, you do it all yourself.  \nOr perhaps there is some collaboration.  \nBut in work, there is division of labour, which introduces the role of art director (/senior designer) and production worker.  \nThere's a certain amount of that in both fine and commercial art and design (Fine Design -- now there's a category!)  \nThere was division of labour in the _bodegas_ of the old masters, just as there is with today's art, and in both cases the person in charge could be termed art director.\n\n"
    },
    {
      "time": "20 Apr 2007 — 10:53am",
      "content": "<cite>Graphic design as we know it is a fairly new profession. I might guess that if we begin looking at when words and pictures were created together as a piece, we might get closer to a defining moment.</cite>\n\nBut even that’s a pretty iffy distinction. Designers today convey messages without words when literacy/language barriers occur much like the way religious art of Europe was used to reach the illiterate majority. And words and images have been used together since language began, when A looked like V and meant _cow_.\n\n<cite>Perhaps art historians have ignored commercial work like posters and play bills as ‘non art’ unless the artist involved also had a painting career.</cite>\n\nIt seems to me that they tend to focus on the starving artists and the weirdos. Just about every art historian considers Lautrec relevant to the era of the impressionists and post impressionists; but plenty entirely ignore Mucha when discussing art nouveau while others credit him with starting it. What’s the difference? One was an inbred alcoholic who drank himself to death, the other was disciplined, internationally famous, and enormously successful. I suspect that, had Warhol found ways to work his critiques of culture into his advertising as opposed to turning to “fine art” he would be ignored by mainstream art historians and known only to designers.\n\n"
    },
    {
      "time": "20 Apr 2007 — 11:05am",
      "content": "Artists like a 'Rembrandt' were/are commissioned because of their own individual brush. They have achieved a clearity of understanding not only how to paint but what to paint (ie composition). Rembrandt's was unique in many ways - command of light and shadow, quality of line - are just two of the more obvious characterists to _his_ brush.\n\nDesigners are no less individual, they just use a different kind of brush - like Alexander McQueen, [http://www.alexandermcqueen.com/flash.html](http://web.archive.org/web/20130824173737/http:/www.alexandermcqueen.com/flash.html \"http://www.alexandermcqueen.com/flash.html\") , Ralph Lauren [http://www.polo.com/frontdoor/index.jsp?videoflash=false&flashversion=9](http://web.archive.org/web/20130824173737/http:/www.polo.com/frontdoor/index.jsp?videoflash=false&flashversion=9 \"http://www.polo.com/frontdoor/index.jsp?videoflash=false&flashversion=9\")\n\nAnd as for the team player, compromise your unique voice, argument goes take a look at these two ukiyo-e graphic artist - Hiroshige [http://en.wikipedia.org/wiki/Hiroshige](http://web.archive.org/web/20130824173737/http:/en.wikipedia.org/wiki/Hiroshige \"http://en.wikipedia.org/wiki/Hiroshige\") , and Hokusai [http://en.wikipedia.org/wiki/Hokusai](http://web.archive.org/web/20130824173737/http:/en.wikipedia.org/wiki/Hokusai \"http://en.wikipedia.org/wiki/Hokusai\") , are well known examples. These graphic artist shook up the whole global 'establisnment' - and didn't even touch their own work. It was the unsung wood block carvers who produced their work - and yet Hiroshige and Hokusai (amoungst many other fine wood block print graphic artist) each maintained a very distinctive voice.\n\nI don't buy into the argument that commercial art is to appease the public and fine art is to appease the artist because no master that I've known would/could be pushed, no matter where their work is to be used. I'm sure that if you were to tell a _master_ how to compose their work and try to instruct them on how to depict a form - they would toss you out of their studio in a heart beat.\n\nHaving said that - the accomplished Type, Graphic, Fashion, Canvas, Sculpture etc., etc., 'artist/designer' are well aware of the guidelines they not only exist in - but they enjoy pushing those boundaries however possible, whilst maintaining their unique voice.\n\nUnfortunately I understand that not everyone has/can develope their own unique voice, or simply have bills to pay, and must make 'compromises' along the way - then yeah sure, portraits are repainted to the buyer's taste and graphics are pushed by the client's taste.\n\nAnd for those who don't believe in the Individual as an artist/designer - [http://www.segmation.com/](http://web.archive.org/web/20130824173737/http:/www.segmation.com/ \"http://www.segmation.com/\") & [http://www.paintbynumberz.com/](http://web.archive.org/web/20130824173737/http:/www.paintbynumberz.com/ \"http://www.paintbynumberz.com/\")\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "20 Apr 2007 — 11:09am",
      "content": "\"look at these two ukiyo-e graphic artist - Hiroshige...\"\n\nIs that the derivation of your screen name?\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 11:55am",
      "content": "\\>\\>I’m sure that if you were to tell a master how to compose their work and try to instruct them on how to depict a form - they would toss you out of their studio in a heart beat.\n\nalthough that thought is very idealistic, i think most people -- including the majority of masters -- are probably a bit more pragmatic. rembrandt altered work to suit patrons, as did botticelli, ghirlandaio and da vinci. even the great galileo knew the pressures of the day.  \nbut more than that, i don't buy into the idea that understanding the objective art of design makes a person less of an artist or puts their work on par with paint-by-numbers.\n\n"
    },
    {
      "time": "20 Apr 2007 — 12:07pm",
      "content": "Thanks for all your thoughts about what separates art and design. It does seem like quite a murky subject, doesn't it?\n\nHere's my two cents: I actually didn't start out in design via the traditional way of going to school, getting an internship, then getting a job. I started out doing design for bands and concert promoters, and realized it really was what I wanted to do because I recognized the art behind it. I think the people who are arguing that design is driven by the client are correct, but it is moving to where designers are starting to become artists. Most of the famous designers, from Saul Bass to David Carson, have a distinct style. Even Paula Scher, who many people say doesn't have a specific style, has something there that makes me say \"I bet Paula Scher did that\". There are still the ad agencies and design houses that do things the traditional way, and they aren't going to go away, but I am starting to see that there is a commodity out there. People hired Carson because they wanted that style. If someone wants a simple corporate website, they're going to go with the local design house.\n\nSomeone made the comment about Commercial Art... I like that term a lot!\n\n"
    },
    {
      "time": "20 Apr 2007 — 12:39pm",
      "content": "There is a difference between \"a certain style\" and deducing who the designer is. I think the whole concept of style for design (other than things like fashion/clothes) is counterproductive. If someone after-the-fact lays a style label on a designers work, that is bad enough. If a designer tries to emulate a style when they do their work instead of solving the clients communication problem, then they are pißing in the wind and full of themselves. If a designer honestly approaches a design problem with the tools of his time, there may be an indication that they worked during a particular era. That is not the same as the retro-is-everything guys who look for a past era to rip off just for the \"Look\" rather than solving the communication problem. It is an issue of honesty, not style.\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 12:41pm",
      "content": "Hiroshige has made me wonder if discussions like this should be conducted with the works of the greatest matters as part of the discussion, or if they should simply be placed into some different class requiring different discussion. Of course that would also require defining who is and is not a great master, but I digress...\n\nThere are countless unknown artists for all of the knowns. Hokusai is probably the greatest artist to every handle a brush, Michaelangelo the greatest to carve stone, and so on. What happens when we consider the common art and common artists; the pottery and painting produced by our mothers and grandmothers? What about the countless reports, advertisements, and magazine layouts with no design credits? Should we really be examining art at that level, which accounts for far more of the world’s creative output than does the work of masters? And when we do, does the expression of the Sunday painters and compromising unknowns designers indicate a much greater split betweeen art and design than the work of the masters, or does is show us that there is even less contrast than we previously thought?\n\n"
    },
    {
      "time": "20 Apr 2007 — 12:47pm",
      "content": "It's interesting the way that the word \"art\" was used in commercial graphics. Prior to digitization, \"the artwork\" meant the art board with the type galleys and PMTs pasted up on it, suitably keylined with rules drawn for picture areas and crop marks, and with cut rubylith overlays and tissue overlays indicating colour breaks. When ready to go to the film house, this was \"finished art\". Put together by the \"paste-up artist\"/\"mechanical assembly artist\". So \"art\" referred quite specifically to skilled handwork which was an interim step in the production process.\n\n"
    },
    {
      "time": "20 Apr 2007 — 1:33pm",
      "content": "Chris, I agree to a certain extent, but to me design is all about style. When I say style I mean style, not kitch. I agree the the retro for the sake of retro thing is dumb and overused. But style is not necessarily genre... for example, Saul Bass had a distinctive style to everything, from his more rigid identity work to his fun and playful movie posters.\n\nThis is where a lot of designers frustrate me. I feel that a lot of us get into a mindset of being information architects. And I think that design is more. Sure, you can design a brochure that looks pleasing to the eye and presents all of the information in a great way. But I feel that if we are hired by a client we are doing them a disservice if we remain sterile in our work. So instead of a good brochure, make an amazing brochure. If we are to do the best for our client we continue to come up with innovative ways to present the information.\n\nPart of what we are paid for is presenting a creative solution. So throw yourself into it. If a client is paying you $75 an hour (or more depending on who you are), make it worth their while. Don't give them vanilla.\n\n"
    },
    {
      "time": "20 Apr 2007 — 1:34pm",
      "content": "\\>Hokusai is probably the greatest artist to handle a brush\n\nI saw the amazing Hokusai exhibition here at the Smithsonian recently. Strangely enough, he impressed me more as a designer and illustrator than an artist in the Western sense. You could see he was absolutely the father of modern design in his use of space--notan--and assymetric balance of flat colors. His mastery is just breathtaking; I have not seen an equal to that.\n\nThough his stuff is brilliantly dramatic and eye-catching, somehow I missed the inner light of soulfulness that you see in Rembrandt, some of the Chinese scrolls, and others.\n\nI wonder what his conception of what he was doing, in terms of art vs design.\n\n"
    },
    {
      "time": "20 Apr 2007 — 1:54pm",
      "content": "im inspired just by reading this wonderful thread.\n\npersonaly i see design and art not as contradictory but as a kind of prism, a gradient if you will of colors. one side is artist, the middle is designer, and at the far end of the other side is advertiser.\n\nwhen i started learning design, we were taught that being \"arty\" is okay but not for the purpose of being a designer. then later i found out that art can be intertwined with design, if the conditions allow it. personally i aspire as a student now and as a designer in the future, to do art as well as design, and to touch different shades of this theroretical prism. if we are talking about branding, then it's supposed to better for the client to have a designer with strict advertising skills. but now im working on rebranding a pro-peace organization called \"peace core\" (some of you may have seen it). as a part of this rebranding, i had to reccomend and design ways to advertise the organization and to generate responces and awareness amongst civilians, about recent events that are related to the palestinian-israeli relationship. my suggestion, (alongside guerilla advertising) was to create art instalations on the street. and so an important part of branding process, included artistic installations and basically art. (important to notice that this wasn't a real job but a class in the design college).\n\nart and design can leave in peace side by side. when designing certain products it's more possible. if you are designing things like books or books covers, you can use artistic measures as well as design measures.  \nso i think it's possible if you really want and willing to try doing that.  \ni can't think of myself withought art, i think i have been a much more boring designer. i have another project where we were told to design a book, and i think that using my artistic skills, i designed the book with images and text that respond to the text, thus weaving my \"unique hand\" into a product that requires design solution.\n\nby the way - about artists - i understood something about art. i was offered to do a big exhibition of my art in my school. the head of the design department is the curator of the exhibition, and when we sat to decide which of my works to exhibit and which not, he chose some that i liked and some i liked less. he also turned down on several works i wanted to exhibit. i understood that the institution i exhibit in (this case it's my college) has it's needs and it's perception. the curator has his own mind of what to use, and what would be un suitable. this resembles design, and i think that it happens all along the art world.\n\ni think (from my brief brief knowledge in design) that designers aren't just humble servile vassals of a client, we have qualities that the client has chosen us for. some can appreciate it, some can't.\n\n"
    },
    {
      "time": "20 Apr 2007 — 1:58pm",
      "content": "<cite>This is where a lot of designers frustrate me. I feel that a lot of us get into a mindset of being information architects. And I think that design is more.</cite>\n\nIt can be hard to resist the temptation to try and be Josef Müller-Brockmann or Alan Fletcher; I think that the answer is to find a sweet spot in the middle, and that is not an easy thing to do. It does not seem that the constant influx of technology into, and the effect said technology has on design, is helping much. But few things worth doing are done with ease.\n\n<cite>I saw the amazing Hokusai exhibition...I wonder what his conception of what he was doing, in terms of art vs design.</cite>\n\nThat was one amazing exhibition. It left me with the feeling that Hokusai transcended what most of the world understands about art and artists. I felt similar, albeit less powerful, effects when I walked through the Orsay and the Uffizi.\n\nMaybe the problem with trying to really understand art and design is that creativity, and appreciation of creativity’s fruits, is an essential part of our brains and minds. As the old saying goes, if it were simple enough for us to understand, we would be to simple to understand it.\n\nOr maybe the answer to these questions is so simple that we won’t resolve it by thinking at all.\n\n"
    },
    {
      "time": "20 Apr 2007 — 2:05pm",
      "content": "What does style have to do with being or not being sterile, with throwing yourself into a project or not, with a good brochure or an amazing brochure? Nothing!  \nStyle is one of those words art reps throw around to hype up something. A design should stand on its own without the need to be pigeon holed into a style.  \nSaul Bass's \"rigid identity work\" was done by the folks who worked for him (like one of my old classmates). Saul was the name and the connection. His love was motion work and he was damn good at it. I fail to see a continuity of style between his \"Walk on the Wild Side\" and \"Around the World in 80 Days\" titles. Style says \"It is all about me\" instead of it is all about a good [great, amazing, stupendous] solution to a communication issue.\n\nChrisL\n\n"
    },
    {
      "time": "20 Apr 2007 — 2:14pm",
      "content": "[Style is puppy breath.](http://web.archive.org/web/20130824173737/http:/www.lyricsfreak.com/p/prince/style_20111123.html)\n\n"
    },
    {
      "time": "20 Apr 2007 — 2:25pm",
      "content": "i'm reminded of a conversation i had with a student. he was a wonderful student, and did some really outstanding work. but he was very worried. \"chuck,\" he moaned one day, close to graduation, \"i love what i'm doing, but i still haven't found my STYLE yet!\"  \ni told him he should thank his lucky stars, and if he could say the same thing 10 years later, he'd really be blessed.\n\n"
    },
    {
      "time": "20 Apr 2007 — 10:02pm",
      "content": "Chuck, your ignorance of how an artist describes form and _how_ to compose (especially a master) is holding you back. Note: I did not say _what_ to compose.\n\n_although that thought is very idealistic, i think most people — including the majority of masters — are probably a bit more pragmatic. rembrandt altered work to suit patrons, as did botticelli, ghirlandaio and da vinci. even the great galileo knew the pressures of the day._\n\nRembrandt never compromised his brush. Sure subjects in his canvas may have changed (aka the elements of the composition) - but _how_ he described mass and space was _never_ conducted by his patrons, could be why he was commissioned in the first place? Again, the subject matter may change - but the technique stays constant. Please try to understand the difference.\n\nFurthermore Chuck, to find your voice (what you glib as 'style') in any given discipline is a great great thing. It's a blessing - not a curse ...at any age.  \nAnd those that do have a voice and have found a way to communicate their 'art' (including designers of Type), go on to inspire others not only from their work, but also from their writtings. A classic case are the complete letters of van gogh - who can't learn from his voice?\n\n'nough said.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "20 Apr 2007 — 11:37pm",
      "content": "From what I understand Bass had a friggin tight technique.\n\nI think most people don't understand what 'art' is. Probably because of crap cliches like \"art is in the eye of the beholder\".\n\nBut, just as all noise is not music, all paint/graphics is not art. Noise can _become_ music when it comes from one who has developed an understanding of technique - ie a Mozart, _the_ Rolling Stones et al.. But without technique it's still just noise.\n\nWhen technique has been mastered, then the heavens open up. You can sleeze a technique, rock a technique, or be as refined and elegant as the day is long.\n\nBut yeah I agree, first must come sound technique. Technique is everything - purpose is everything too. And for those who can master 'technique' and get a grip on 'purpose' then 'expression' can have a chance. And that, I believe, is where 'art' begins.\n\nit's only rock and roll\n\nBut I like it\n\nlike it\n\nyes I do...\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "21 Apr 2007 — 3:41am",
      "content": "But not everyone likes rock and roll...  \nIn the end everything from art to design (if you want to distinguish the two), music to movies, etc. is still in the eye of the beholder meaning that not everyone will appreciate a piece of art (/design/whatever...) as much as the next person. You can argue about the fact that there's always a group of ignorants that don't \"understand\" the art, but when you throw music into the whole discussion, it's a lot clearer. Who of all people who enjoy music actually know anything about sound technique?  \nBesides, some of what we call the greatest artists of all time now we're not recognised as such in their time and had to struggle to make ends meet. You could say that time is the best judge to test something's value, but then again, not everything that survives is great. I believe that art is indeed in the eye of the beholder & that whatever ends up in a museum is probably enjoyed by more people, but not necessarely better than a scribbling on a wall somewhere. Personal taste is always a factor in judging a piece of work (sure, there's are some \"basics\" (such as technique) that might be \"objectively\" discussed) & where the majority of personal tastes agree, that's where art is born (or broken), but it remains a matter of taste. I generally like to see all these things as a sign of the times & part of our culture which is now broader than ever.\n\n"
    },
    {
      "time": "21 Apr 2007 — 6:41am",
      "content": "I think there is a distinction between \"style\" and \"voice.\"\n\n"
    }
  ]
}
