{
  "id": "33192",
  "title": "Quark - Some questions from an Idesign user",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hey all,\n\nI recent have been learning Quark, and I have been having a few problems which seems so easy in Indesign.\n\nSuch as:  \n- How do you change the outline of text?  \n- How can I turn Hyphenation on/off? Went into the H/J dialog box but can’t seem to turn it off or on. ITS JUST A SIMPLE TICK IN INDESIGN!  \n- And maybe I’m blind/dump but how do I get space between the top of the text-box and the text, in version 6.5?\n\nThese things are so straight forward (at least for me) in Indesign, I can’t believe it’s not so in Quark. Very frustrating.\n\nThanks for any help.\n\n [‹ Question about TypeTool](http://web.archive.org/web/20071010134505/http:/typophile.com/node/33227 \"Go to previous forum topic\") [indesign.line indent? ›](http://web.archive.org/web/20071010134505/http:/typophile.com/node/33242 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071010134505/http://typophile.com/user/9184\" title=\"View user profile.\">3dsnail</a>",
  "time": "<br>",
  "uid": "9184",
  "comments": [
    {
      "time": " 19.Apr.2007 11.57pm",
      "content": "1 Sorry, don’t understand  \n2 In the H & J’s dialogue untick (or tick) auto-hyphenation  \n3 Modify the text box (cmd+m on a mac) go to the text section and change the inset, you can do this for any side of the box\n\nTim\n\n"
    },
    {
      "time": " 20.Apr.2007 5.03am",
      "content": "_I can’t believe it’s not so in Quark._\n\nIt’s just what you’re used to.  \nI’ve worked with Quark since 1988, and when InDesign came out in 2002, and did things differently of course, it took me a while to become familiar with it. So try to overcome the resentment and accept that it’s just a different piece of software with a slightly different design logic.\n\n"
    },
    {
      "time": " 20.Apr.2007 6.44am",
      "content": "Thanks for the replies guys. And Nick, you’re right but it’s busting my nuts.\n\nAnd the first questions was, as you add the type style “outline” (the ’0’ in the measurements box) to the text, how do you change its colour? And thanks for answering the other questions.\n\nCheers\n\n"
    },
    {
      "time": " 20.Apr.2007 6.48am",
      "content": "If you know Indesign, why use Quark?  \nYou are obligated by the client or you just want to study it?  \nI worked in quark at one project cause i had to, but never again.  \nwebee is a design blog.  \n [www.webee.ro](http://web.archive.org/web/20071010134505/http:/www.webee.ro/ \"www.webee.ro\")\n\n"
    },
    {
      "time": " 20.Apr.2007 7.07am",
      "content": "Avoid using those modification boxes for anything you don’t get a true outline, italic or bold. If you want outlined text, create it in Illustrator and import it, if you must, select the text and apply colour either from the colour dialogue box or the style drop down menu.\n\nTim\n\n"
    },
    {
      "time": " 20.Apr.2007 12.55pm",
      "content": "Isn’t the command “Text to Picture”? — that turns live text into a picture box, so you can then apply a stroke value to the outline, and colour it, fill it with an image, whatever.\n\n"
    },
    {
      "time": " 21.Apr.2007 1.13am",
      "content": "I haven’t looked at that in recent versions of Quark, when it was introduced the quality of the outline was really unimpressive I compared the points in Quark to the points in Illustrator there were more in the Quark version and they seemed stiff, plus to outline text one needs the rule on the outside of the text and for most of my work it is preferable to have the rule on the inside of boxes etc and the preference can only be set one way or the other. Maybe I should have another look.\n\nTim\n\n"
    },
    {
      "time": " 21.Apr.2007 9.19pm",
      "content": "I’m with Tim: if there’s no reason to use Quark, you’re better off using InD....\n\n"
    },
    {
      "time": " 22.Apr.2007 12.18am",
      "content": "Actually that is not what I said or implied, when these threads occur I try not to make judgements on the quality of software, just to reply to the question since that _is_ the question. I imagine the frustration of posters asking questions about a specific piece of software only to be told that they should be using something else, rather like asking for directions and being told, ‘Oh, I wouldn’t start from here’. FWIW I find the interface of Quark less cluttered than InDesign and that it is capable of producing fine work.\n\nTim\n\n"
    },
    {
      "time": " 23.Apr.2007 6.04am",
      "content": "<cite>I’m with Tim: if there’s no reason to use Quark, you’re better off using InD….</cite>\n\nFine if you want to limit yourself to only one design software, but a lot of companies (at least here in NY) still use and require knowledge of Quark. I think it’s well worth the effort to be fluent in both. Like Nick, I came from a Quark background, and I’m still more comfortable in Quark, got annoyed when I had to learn InD to keep up with the Joneses, and still get confused a bit when I jump from one to the other in the same day. But I’d limit my employement opportunities if I didn’t have good working knowledge of both programs.\n\nOutlining type is definitely something InD does better/more easily than Quark.\n\n"
    },
    {
      "time": " 23.Apr.2007 6.19am",
      "content": "Good point Patty, clients/printers drive the choice more frequently than users in my experience.\n\nTim\n\n"
    },
    {
      "time": " 23.Apr.2007 9.09am",
      "content": "And I won’t disagree with either of you two — I haven’t used Quark seriously for years, but that doesn’t mean I don’t have it floating around on a back-up somewhere and would trot it out if desired by a client.\n\nHowever, that doesn’t mean that one has to do the DTP equivalent of wearing a hair shirt just to prove that one can, either. ;-)\n\n"
    }
  ]
}
