{
  "id": "33209",
  "title": "Helvetica Serif?",
  "forum": "Design",
  "tags": [

  ],
  "content": "This question crossed my mind a couple of weeks ago:  \n_has there ever been made any type of modifing to the Helvetica making it a serif?_ That would be a fun project to take care of if it never has been done yet. Simply putting some serifs to the original structure.\n\n [‹ Gothic Fonts](http://web.archive.org/web/20071126054923/http:/www.typophile.com/node/33151 \"Go to previous forum topic\") [Goodbye pixel fonts & hinting. ›](http://web.archive.org/web/20071126054923/http:/www.typophile.com/node/33168 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071126054923/http://www.typophile.com/user/9403\" title=\"View user profile.\">birgit</a>",
  "time": "<br>",
  "uid": "9403",
  "comments": [
    {
      "time": " 20.Apr.2007 4.09pm",
      "content": "Sounds like an interesting idea, but I don’t think it’s been done. Snapping serifs on to the letters wouldn’t be that hard, but making them look good and still be recognized as Helvetica is another matter.\n\nThis sort of thing has been done with other fonts, or at least remarkably similar fonts in sans and serif versions (e.g. Avant Garde and Lubalin Graph, or Officina).\n\nI do recall a magazine article featuring design challenges (I think it was HOW, in a mid 1990s issue somewhere) featuring a redesign of Helvetica Italic that looked very nice, but I have no idea if that design was ever released as a font.\n\n"
    },
    {
      "time": " 20.Apr.2007 4.54pm",
      "content": "It has been done: [Helserif](http://web.archive.org/web/20071126054923/http:/roostertypes.com/prod_display.asp?group_id=HelserifURW), designed by Phil Martin in 1976. Not completely successful, in my opinion. A better, similar font is [Serifa](http://web.archive.org/web/20071126054923/http:/www.fontshop.com/search/?q=serifa&x=0&y=0), designed around the same time by Adrian Frutiger. It is basically Univers with serifs.\n\n"
    }
  ]
}
