{
  "id": "33227",
  "title": "Question about TypeTool",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I'm new to the font making world and do it as a hobby. I'm looking to purchase a font editor and TypeTool seems to be a good option but I'm wondering if I will be able to create a font using TypeTool that uses pairs and triples. The typeface Im creating contains certain a few versions of certain characters so they can combined with other characters. For instance AV. I want to know if it can do this before I purchase.\n\n",
  "author": "YOTS",
  "time": "21 Apr 2007 — 10:20pm",
  "uid": "18154",
  "comments": [
    {
      "time": "23 Apr 2007 — 3:42am",
      "content": "Yots,\n\nyou can obviously do pair kerning in TypeTool 3. Also, you can draw your pair and triplet ligature glyphs in TypeTool 3, and use Microsoft VOLT or Adobe FDK for OpenType (both free) to add OpenType Layout feature definition code that takes care of ligature substitution in OpenType-savvy applications.\n\nAdam\n\n"
    },
    {
      "time": "23 Apr 2007 — 11:28am",
      "content": "I know that you can do kerning pairs in TT but what I'm asking is if I can create a font that is smart enough to know when to use certain characters.\n\nFor example, the typeface I'm creating has two different versions of \"A\" and three versions of Y. I've attached a JPG of the typeface so you can reference it.\n\nNow, lets say I'm type the word WAYS, I want it to be able to recognize that combo of characters and use the correct A and Y so that they seem to \"fit\" together. I also want it to use different versions of the letters depending on which character procedes it or follows it.\n\nIs this possible?\n\n ![](http://web.archive.org/web/20130516131610im_/http:/typophile.com/files/typeface_4069.jpg)\n\n"
    },
    {
      "time": "23 Apr 2007 — 2:03pm",
      "content": "Very cool!  \nYes. It's possible using conditional substitutions. You are going to have to work out the tables very well to anticipate all the possible combinations. You can download VOLT from Microsoft's site. The FDK has a higher learning curve. Look around on Microsoft's typography site. You'll find a lot of information.\n\n"
    }
  ]
}
