{
  "id": "33221",
  "title": "Adobe Garamond Pro: looser kerning, new fences",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi all,\n\nIt’s time for me to ask for your comments before I forget this project altogether. Partly to teach myself FontLab, I’ve been working on a modified version of Adobe Garamond Pro – so far, just the Regular. (My point of departure was the font that came with InDesign 2. The modified version is strictly for my own use, of course. But I’d really appreciate feedback, so I can learn something.)\n\nThe only glyph outlines worth mentioning that I’ve changed are the various “fences”, ( ) [] { }, as shown at the top of page 1 of the enclosed PDF. **GIF added:**\n\n ![](http://web.archive.org/web/20150418115527im_/http:/typophile.com/files/Garamond_6069.gif)\n\nI prefer the traditional (?) kind of fences, with relatively even thickness. I also lowered these glyphs a bit so they’ll look better surrounding old-style numerals. (It occurred to me that you could perhaps use the OT feature “onum” to adjust the vertical position, but I couldn’t get it to work. I didn’t try very hard, though, and can’t remember the details.) Furthermore, I like to have plenty of space on the inside of these glyphs. On the outside, however, they’re negative-kerned (-50) with the word space.\n\nOtherwise, I’ve loosened up the spacing, most importantly (1) the left sidebearings, and kerning with preceding r y, of the period, the comma, and other punctuation marks, also shown near the top of the PDF, and (2) uppercase-lowercase kerning pairs, which take up the rest of the PDF.\n\nAs for the latter, I first intended just to loosen the Ta, Te, and To pairs – which looked way too tight to me – but I ended up going through all the uppercase–lowercase pairs and loosening most of them. (The specimen does include some pairs that haven’t been modified, e.g. Hu.)\n\nWhile all the original uppercase–lowercase kerning pairs were negative, I now have cumulatively perhaps as much positive as negative kerning. I’ve read somewhere that kerning should generally be negative. Is this because fonts may be used without kerning and too loose is better than too tight? (I do agree with the latter principle!) I only intend to use this font with kerning.\n\nThe alternative would be to increase the right sidebearing of the caps in such a way that these kerning pairs can all be made negative or zero again. But I thought that for now, it would be better not to touch the sidebearings (and consequently the other kerning pairs involving the caps – though I suspect that these, too, will look too tight to me once I get to them).\n\nI’ve also been planning to increase the sidebearings slightly across the board, and that’s why **the specimen has +8 tracking.** Wouldn’t the equivalent of this be an increase of 4/1000 em to the sidebearings?\n\nAs the above suggests, I generally find today’s fonts too tightly spaced. This is most notable in the case of punctuation and kerning, but I also find myself using positive tracking in InDesign to give the text some breathing room in general; I think (hope) that this improves readability.\n\nActually, even many metal classics, like Bembo, look a little tight to me. I like the looseness of Stempel Garamond, for example. Some might argue that in that case, I should use Stempel Garamond, rather than trying to make the Adobe face look like it. But AGaramond is otherwise a good face (though it would really benefit from size variants), and I don’t have the Stempel version.\n\nBy the way, I’m also tempted to slightly increase the right sidebearing of e and the left sidebearing of z—even though the tightness here might be traditional. Any opinions?\n\nDo you think the above kinds of changes would be too much for a job for which _someone else_ has specified Adobe Garamond? What about the fact that the loosened version will take up more space?\n\nOlli\n\n**Sorry:** the first PDF was flawed (wrong spacing); corrected version posted Saturday at about 4:50. I also now realize that I haven't actually changed the v. w. v, w, pairs – but I think I should.\n\n| Attachment | Size |\n| --- | --- |\n| [Garamond\\_specimen.pdf](http://web.archive.org/web/20150418115527/http:/typophile.com/files/Garamond_specimen.pdf) | 167.96 KB |\n\n",
  "author": "ocular",
  "time": "21 Apr 2007 — 6:35am",
  "uid": "9632",
  "comments": [
    {
      "time": "24 Apr 2007 — 7:04am",
      "content": "It seems to me that the square brackets are not very well drawn and that the kerning between 9) is not taking into account the curved back of the 9. My take is that seeing the two together I prefer the stressed fences to the more monoline ones. The Mil of the modified doesn’t work as well as the Mil of the original, the modified is biased against the space between i and l.\n\nTim\n\n"
    },
    {
      "time": "24 Apr 2007 — 9:04am",
      "content": "Thanks so much for your comments, Tim! I thought I wasn't getting anything at all.\n\n\"the square brackets are not very well drawn\"\n\nAgreed. I deliberately left them pretty rough, partly just to see what people would say. But their roughness is quite accidental, really, which is probably not a good thing – and in any case, I guess it clashes with the otherwise polished outlines of the face.\n\n\"the kerning between 9) is not taking into account the curved back of the 9\"\n\nActually, there's no kerning here in either the original or the modified version. But I agree that the combination looks too loose in the modified one (so I should perhaps add a pair for this).\n\n\"The Mil of the modified doesn’t work as well\"\n\nWell, I sort of feel that caps need their space; but you might be right, now that I look at the combination. (The original Mi is -12, the modified -8.) I have to say that as I was modifying the kerning pairs, they just kept looking too tight; maybe I did go too far!\n\nWhat do others feel? I would appreciate it very much if you took at least a quick look at the PDF (as unpolished as it is). But all comments are welcome!\n\nOlli\n\n"
    },
    {
      "time": "24 Apr 2007 — 9:41am",
      "content": "Olli, Bringhurst complains that parentheses are often too skinny, and the brackets too fat. To my eyes, you're taking them these wrong direction, making them out of character with the face. Slimbach's are good. If anything, I would fatten Slimbach's vertical on the bracket, though the skinniness in your showing might just be a screen artifact.\n\n"
    },
    {
      "time": "24 Apr 2007 — 10:15am",
      "content": "William, my GIF is not good. In the font, both my parentheses and my brackets are 49 units thick, while Slimbach’s parentheses are 66 units and brackets 53 units at about the vertical middle.\n\nLooking at the PDF now, I feel that if anything, both my parentheses and my brackets are too thick (but I guess I was worrying that they might lose in legibility if I were to make them thinner). **Edit:** Perhaps the brackets should be thinner than the parentheses (because their rectangular shape makes them visually stronger).\n\nI do have a lot to learn, though. Could you maybe take a look at the PDF and then say what you think?\n\n"
    },
    {
      "time": "24 Apr 2007 — 10:31am",
      "content": "Ok, I looked at the PDF. I think Slimbach's parentheses and curly braces are fine. I don't particularly like the way he's handled the right angle bits on the brackets, but there's nothing terrible about it.\n\nI still think your monoline versions are out of character with the face, and worse than what's already there. There is something to be said for these non-alphabetic characters to be somewhat different visually than alphabetic characters, but the 'fences' already distinguish themselves by their length.\n\nOn your revised kerning. Though I am generally a big admirer of Slimbach's work, I do feel he has a tendency to overdo tightness in kerning, particularly with punctuation. So, yeah, in principle I like your approach better, but I'd have to see it in print, in context, to really judge.\n\n"
    },
    {
      "time": "24 Apr 2007 — 11:18pm",
      "content": "\"I still think your monoline versions are out of character with the face, and worse than what’s already there\"\n\nThanks for your honesty! However, I would point out in my defense that the monoline form seems to be the historically more authentic one, though the only source for Garamond himself that I have at hand right now is the specimen on p. 5 of Adobe's Garamond Premier specimen book (and this has only the parentheses).\n\nAdobe Garamond is, of course, a modernized, or at least \"polished\", interpretation of Garamond's faces – but I don't think that it's too far from the original to have the original kind of parentheses and other fences. We're just used to seeing it with the now more common kind.\n\nBesides, Robert Bringhurst, to whom you referred above, uses monoline parentheses and brackets with _Minion_ in the second edition (1996 printing) of _Elements_; see also his comments on pp. 84–85 of that book. (This was my main inspiration here.)\n\nIt's another question whether my particular monoline versions are entirely successful; indeed, the brackets probably do need to have their quirks removed.\n\n\"On your revised kerning … I’d have to see it in print, in context, to really judge\"\n\nYes, of course. Judging a PDF on screen, or even in a laser printout, is hard. I fear myself (actually, I'm quite certain) that I haven't been completely consistent in the amount of kerning.\n\n"
    },
    {
      "time": "25 Apr 2007 — 5:33am",
      "content": "\\>uses monoline parentheses and brackets with Minion in the second edition\n\nI have that edition, too. But in the current, 'Pro' version of Minion, Slimbach has changed them to a stressed version.\n\nThis is a small matter, but I do think the stressed ones are more harmonious with the face, and nothing is gained by monoline ones.\n\nBy contrast, in the case of the relatively unstressed 0 of many old style numbers, you gain by having it differentiated from the lower case or small caps o. But you aren't going to confuse a parenthesis with anything else anyway.\n\n"
    },
    {
      "time": "25 Apr 2007 — 9:03am",
      "content": "\"But in the current, ‘Pro’ version of Minion, Slimbach has changed them to a stressed version\"\n\nAh … yes, I know that in the newer editions of his book, _Bringhurst_ has gone back to the stressed fences. I don't think there has been a change in Adobe Minion itself.\n\n\"nothing is gained by monoline ones\"\n\nMaybe not functionally, but I just happen to like that kind better – perhaps because I tend to be a traditionalist :)\n\nBut thanks again for your comments!\n\n"
    }
  ]
}
