{
  "id": "33239",
  "title": "Need guidance on how to purchase FONTS for COMMERCIAL use?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’ve downloaded an “Old English.ttf” font several years back and now I’m thinking about using it for commercial use. But the zip.file wich contains the txt.file doesn’t say exactly what author I should contact for purchasing and negotiations. It just lists a bunch of not so serious looking websites.  \nEven when I google the name of the font I’m given a bunch of none sersious looking e-shop sites.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Question 1.) \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*  \nCan someone recommend me to a trusted e-shop which sells the “Old English.ttf” font?  \nWhich doesn’t cost a fortune.  \n—————————————————\n\nI want to use the font for my website, logo, and use the font to print messages on T-shirts which I want to sell commercially.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Question 2.) \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*  \nWhat sort of license fits my needs?  \n—————————————————\n\nAny kind of guidance and tips would be much appreciated.\n\n [‹ Licensing fonts for a design school](http://web.archive.org/web/20070911195425/http:/typophile.com/node/33263 \"Go to previous forum topic\") [common errors? rare instances? ›](http://web.archive.org/web/20070911195425/http:/typophile.com/node/33313 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911195425/http://typophile.com/user/10661\" title=\"View user profile.\">biffy</a>",
  "time": "<br>",
  "uid": "10661",
  "comments": [
    {
      "time": " 23.Apr.2007 7.46am",
      "content": "try _[myfonts](http://web.archive.org/web/20070911195425/http:/www.myfonts.com/fonts/itfmecanorma/old-english/)_\n\n"
    },
    {
      "time": " 23.Apr.2007 8.17am",
      "content": "Biff, if you could post a sample perhaps we could better direct your efforts.\n\n"
    },
    {
      "time": " 23.Apr.2007 10.57am",
      "content": "It depends entirely on whose font it is, but if it’s a commercial font, a basic user license will work for your uses.\n\n"
    },
    {
      "time": " 25.Apr.2007 6.55am",
      "content": "Here’s a sample of the font.  \n [http://i17.tinypic.com/2m2ucg3.png](http://web.archive.org/web/20070911195425/http:/i17.tinypic.com/2m2ucg3.png \"http://i17.tinypic.com/2m2ucg3.png\")\n\n1.)  \nAlmost identical as kuroneko’s link tips it seems.  \nBut my Old English version the E,V,B for instance have slight varations to it.\n\n2.)  \nAnyhow when adding the font to the shopping cart it says this in the number of users part:  \n<cite><br>\nLicensed Users: 1-5<br>\nPrice: $45.00<br>\n</cite>\n\nI’m gonna make it for the web that’s like several 1.000 visitors, and I’m planning on selling T-shirts using that font to several 1.000 visitors.  \n**Will this 1-5 License cover me legally?**\n\n"
    },
    {
      "time": " 25.Apr.2007 9.15am",
      "content": "Do you have the EULA? I can’t help but think we need to know from where you licensed the font before we can answer your question. Some foundries allow you to use their fonts commercially. Other foundries do not and are quite specific about it.\n\n"
    },
    {
      "time": " 25.Apr.2007 3.14pm",
      "content": "<cite>I’m gonna make it for the web that’s like several 1.000 visitors, and I’m planning on selling T-shirts using that font to several 1.000 visitors.<br>\nWill this 1-5 License cover me legally?</cite>\n\nGenerally, with a regular user license, you are allowed to sell images of the characters comprising the font on finished products. That’s what fonts are for. (Some free fonts specifically disallow this under their non-commercial use only clause.) Sometimes the amount of use comes into the terms of the license, but that is not typical.\n\nWhat you can’t do is package the font software, either on a disc or as a downloadable file and sell or give it away it yourself. An entirely different sort of licensing is required in that case.\n\n"
    }
  ]
}
