{
  "id": "33238",
  "title": "TheSans Office - Help me find a place to buy it!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have WinME and IE 5.5 SP2.\n\nI can't get TheSans Office from LucasFonts because the site won't work with IE 5.5. (It gets stuck in a loop after registration.)\n\nI can't get the font from FontHaus because they sell (but don't list) TT on their site and want to charge me extra to buy via fax or mail.\n\nI tried FontShop, but there are no scroll bars that I need to navigate the site. Strangely, their European and Australian sites don't have that problem, but I can't read German, and the prices are higher than $123.\n\nAnybody know where I can purchase and download TheSans Office?\n\n",
  "author": "<a href=\"/web/20110818111336/http://typophile.com/user/15371\" title=\"View user profile.\">Renaissance Man</a>",
  "time": "<br>",
  "uid": "15371",
  "comments": [
    {
      "time": "",
      "content": "Why not send Luc a mail, he may be willing to process your order the old fashioned way.\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "Hi,  \nYou cans end an email at [sales@lucasfonts.com](mailto:sales@lucasfonts.com)  \nOr call directly: +49 30 78 71 85 67  \nThere will be no extra costs :)\n\nBut what about changing browser? I am very happy with Firefox.  \n [http://www.mozilla.org/](http://web.archive.org/web/20110818111336/http:/www.mozilla.org/ \"http://www.mozilla.org/\")\n\nElena\n\n"
    },
    {
      "time": "",
      "content": "This link should work on your browser: [TheSans Office](http://web.archive.org/web/20110818111336/http:/www.fontshop.com/fonts/downloads/lucasfonts/thesans_office/). Please let me know if not.  \nYou can also call FontShop at 1 888 FF FONTS.\n\n"
    },
    {
      "time": "",
      "content": "Elena, thanks. I did email them, and they have been very kind. I'm sure Luc & Co. are honorable people, but it makes me nervous to do the currency conversion, write a check, mail it to Germany, await its receipt, and then wait for an email with a zip attachment. It's more convenient, safer, and faster to use a credit card and then to get an immediate download.\n\nStephen - I got to that page before. No scroll bars on any pages on that site in my browser, and (therefore) the registration page can't be filled out. I sent you an email with a screenshot to illustrate the problem.\n\n"
    },
    {
      "time": "",
      "content": "Get firefox. :)\n\n"
    },
    {
      "time": "",
      "content": "I want a font. I don't want a new computer, a new OS, a new browser, or advice on how to get anything other than a font.\n\nIf foundries make it hard for people like me to buy fonts, it's my loss AND theirs. I thought foundries were in business to sell fonts.\n\n"
    },
    {
      "time": "",
      "content": "A friend of mine has an old PC running Windows ME, and Firefox works just fine on it. You won't need a new computer or a new OS. Just a few minutes to wait for the download and install process to be finished. Then, you should be able to buy just about anything from just about anybody.\n\n"
    },
    {
      "time": "",
      "content": "The answer to my question is PhilsFonts.com\n\nThanks for the replies, but none answered my question.\n\n"
    },
    {
      "time": "",
      "content": "\"_I want a font. I don’t want a new computer, a new OS, a new browser, or advice on how to get anything other than a font.  \nIf foundries make it hard for people like me to buy fonts, it’s my loss AND theirs. I thought foundries were in business to sell fonts._ \"\n\nWell, thats a skewed perspective, I would say. :)  \nThey don't make it hard for you, since the online shops and registration seems to be working for everyone else.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Well, thats a skewed perspective, I would say. :)<br>\nThey don’t make it hard for you, since the online shops and registration seems to be working for everyone else.</cite>\n\nYour making a joke, right? Like when I get a message from one of the largest U.S. foundries saying \". . . since you wanted your password changed . . .\" But I didn't. So when I called to make sure no identity theft was going on, after a 20 minute wait, the person can't help. Against policy. Then I get another email asking how my \"experience\" with my latest transaction went. Of course, the problem didn't fit the form, so had to be \"other.\" No reply, after 2 months. Thank God Ellis Island messed up grandpa's name; there aren't too many other \"Ellertson's\" in the states.\n\nOh yes, I do use Firefox . . .\n\n"
    },
    {
      "time": "",
      "content": "Ouch, Charles. That should never happen.\n\nIn regards to Steve's issue, I understand his frustration. He is probably able to access most sites without issue. Roadblocks like this one are unexpected. But these roadblocks will become more common as his browser ages.\n\nIE 5.5 (released 7 years ago) sees the web much differently than modern browsers. Whenever a company updates their site, decisions need to be made about what features to include, some of which will disable compatibility with older software. In the end, the convenience of the vast majority of customers takes precedence over the smallest minority.\n\nIn FontShop's case, less than 0.1% of our visitors use IE 5.5. We make the (sometimes painful) decision to serve our largest customer base first, putting resources into more modern technologies, and then look to comply with least common browsers as time permits.\n\nThis is why [web standards](http://web.archive.org/web/20110818111336/http:/www.webstandards.org/) are so vital. Standards-compliant web browsers should have a longer lifespan than those that are not.\n\nAll this said, keeping your software updated will always save you time and headaches in the long run. I echo the calls for using Firefox and keeping it up-to-date, which is surprisingly simple.\n\n"
    },
    {
      "time": "",
      "content": "Stephen, I do understand that sooner or later I'll get a new computer with all the bells and whistles, but right now, mine works just fine, never had a virus, and get's me into 99% of sites where I want to go.\n\nHaving said that, FontShop Australia and those in Europe do not have the incompatibility that FontShop USA has, and apparently MyFonts and Phil'sFonts have designed their websites to be friendly to new AND old browsers.\n\nLucasFonts not only won't work with my IE 5.5, but but I've been told (but I can't verify) that that it doesn't work with Macs either.\n\nI appreciate Charles Ellertson's comment, because it puts the focus BACK where it belongs -- on the foundries and vendors. Those who would rather blame the \"victims\" than take responsibility will just lose business, or at least mine anyway, which is as it should be -- just as it is with the US auto industry.\n\n"
    },
    {
      "time": "",
      "content": "According to the Microsoft web site, [Internet Explorer 6](http://web.archive.org/web/20110818111336/http:/www.microsoft.com/downloads/details.aspx?FamilyID=1e1550cb-5e5d-48f5-b02b-20b602228de6&displaylang=en) runs on Windows ME. That may resolve the difficulties you are experiencing.\n\n"
    },
    {
      "time": "",
      "content": "\"_Your making a joke, right?_\"\n\nNo, I'm not joking. I'd say what you are telling has little to do with compatability of websites with browsers.\n\nTrying to access new websites that use fairly new technology with obsolete ancient browsers that do not support it, and complain when it does not work, is a whole different story all together. :)\n\nNo offence to anyone.\n\n"
    },
    {
      "time": "",
      "content": "<cite>LucasFonts not only won’t work with my IE 5.5, but but I’ve been told (but I can’t verify) that that it doesn’t work with Macs either.</cite>\n\nIt does. I still use old Mac OS 10.3.9 and Safari and Firefox and had no problem with online orders through this website.  \nAs to the Mac version of IE, Microsoft neither distributes nor supports this app any more. I think this says it all.\n\n"
    },
    {
      "time": "",
      "content": "I just recently made a special Thesis purchase. What I did was call FontShop USA and talked with Jeff Sinclair who was very helpful. He e-mailed me the files directly. No muss, no fuss. I'm sure he or another representative would be happy to help you if you give them a call.\n\n"
    },
    {
      "time": "",
      "content": "You forgot to mention that Firefox is free.\n\n"
    }
  ]
}
