{
  "id": "33247",
  "title": "New Globe and Mail today",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "An edgy design by David Pratt with sans heads and rag right text throughout, and custom display and text faces by myself.\n\n",
  "author": "<a href=\"/web/20110524040800/http://typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": "",
      "content": "No samples?\n\n"
    },
    {
      "time": "",
      "content": "Best seen in print :-)\n\nActually, I had expected their front page to be in PDF at Newseum as usual, but not today.\n\n"
    },
    {
      "time": "",
      "content": "[NewsDesigner](http://web.archive.org/web/20110524040800/http:/newsdesigner.com/blog) has some images from the redesign (and in the text of the blog entry, it links to some samples of Nick's three new typefaces). I have to agree with Nick: it's a really smart, contemporary design. The front page is very well organized, and those odd, thick horizontal rules actually unify the headlines and articles beautifully. But I'll never understand the reasoning behind the huge amount of white space between the headlines and text (a la The Guardian).\n\n"
    },
    {
      "time": "",
      "content": "The smaller page size is interesting, and I'm glad it's now being set ragged right, although there is still some really awkward hyphenation (_previ-ous_, for example).\n\nFits better into our recycling box as well.... ;-)\n\n"
    },
    {
      "time": "",
      "content": "I had a quite a surprise this morning when the Globe arrived---I hadn't known about the redesign. I'm not sure about the addition of the \"Life\" section, but the design throughout is gorgeous; I'm loving the ragged right and the magnificent sans headlines. The first thing I did was try and find out who designed the type...now I've 'heard the news'. Congratulations, you've made mornings better across the country with these fresh faces. I like the new page size too.\n\n"
    },
    {
      "time": "",
      "content": "Overall, an excellent re-design -- my preferred newspaper just got easier on the eyes.\n\nI love the look of Globe & Mail Sans Thin...\n\n"
    },
    {
      "time": "",
      "content": "Nick, I read the teaser last night and had a hunch it was you who did the type. Glad to discover it is indeed. The new faces are daringly modern for a newspaper (the stemless glyphs in the Sans, the tails in the News). It's good to see a large paper take the plunge. How did News Designer get the samples of your fonts?\n\n"
    },
    {
      "time": "",
      "content": "I love the Globe, too bad it's not a common paper up here in the north. It's the best thing to read while flying IMO.\n\n"
    },
    {
      "time": "",
      "content": "Congradulations Nick!\n\n"
    },
    {
      "time": "",
      "content": "That’s one gorgeous newspaper design. I especially love the massive horizontal rules—Pratt was courageous to try it, and the risk paid off. I agree with Nick about the whitespace; the hanging tagline makes a distracting little shape in there. Perhaps Pratt feels that there’s something about the gap that draws attention in a crowded row of newspaper boxes.\n\n"
    },
    {
      "time": "",
      "content": "_How did News Designer get the samples of your fonts?_\n\nSomeone at the Globe must have provided them with a pdf of page A3, which discusses the redesign and shows the fonts -- there's a link to that pdf at News Designer, so you can inspect the fonts up close in that.\n\nThe premise of two matched sans faces is that one is busy, with \"some serifs\", for use in straight news where the type must carry a lot of the interest, and the other is pared down, for use in feature sections where there is more design space for the art directors and a more reticent face will work better. That distinction emerged during the design process. For precedents, think Tarzana vs Futura, although David Pratt first drew my attention to two \"colours\" of the same face in Lisboa (not quite the same idea as the Thesis variants?). He wanted a lot of tools (or toys) in the box, but wanted to avoid the typical serif vs. sans play, to give it a contemporary sans-y look. So the contrast is sans vs. sans, as when there is a \"GM News\" head and \"GM Sans\" sidebar text.\n\n"
    },
    {
      "time": "",
      "content": "Congratulations, Nick!\n\nWow, massive undertaking--how big a window of time did you have?\n\n"
    },
    {
      "time": "",
      "content": "That's fresh looking. Good work Nick.\n\nJust a shame about the nameplate. The 'THE' and the 'AND' in capitals are too prominent for me. And that maple leaf tagged on the end is a bit lame.\n\nI'm not keen on those 'floating in space' subheadings either.\n\nThe subheadings appear to be missing final full stops which seems odd if there are already full stops in the same line. Maybe that's the norm in newspaperland. I can't remember the last time I read one ‡^B\n\nSorry. I ended up being a rather picky. But it is just pickyness. The fonts work a treat.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Bill. Four months, so it was a bit of a slog. But I know a few tricks.\n\n"
    },
    {
      "time": "",
      "content": "\\>I love the Globe, too bad it’s not a common paper up here in the north. It’s the best thing to read while flying IMO.\n\nI know Air Canada has financial issues, but surely they still provide toilet paper? ;-)\n\n"
    },
    {
      "time": "",
      "content": "<cite>I know Air Canada has financial issues, but surely they still provide toilet paper? ;-)</cite>\n\nHarper took it all away to toughen Canadians up for the coming war over the Northwest Passage.\n\n"
    },
    {
      "time": "",
      "content": "Congratulations Nick!\n\nYou've drawn really nice typeface. All of them!\n\n"
    },
    {
      "time": "",
      "content": "_I know Air Canada has financial issues, but surely they still provide toilet paper? ;-)_\n\nHarper took it all away to toughen Canadians up for the coming war over the Northwest Passage.\n\nLOL @ both. Surely everyone knows to avoid Air Canada at all costs (which is usually a lesser one in the west.)  \n\\_\n\nBack on track though, I saw yesterdays paper today and I quite like it. I only glanced, but the fonts are lovely, as is the new design is nice. I'm glad going right ragged isn't considered a bad idea anymore in newspapers – full justification is a nightmare when people don't care about how it looks.\n\n"
    },
    {
      "time": "",
      "content": "Very, very nice indeed, Nick. Congrats.  \nI love both the sans faces especially.\n\nI don't know the paper, but on the design; I have no problems with either the large amount of white space between the headers and the text, or the subheadings. I like it when newspapers show some paper through. There are a couple of newspapers here that totally cram everything close together, and it looks horrible. I never read those. But do read the ones that show more white (which also happen to use Unger type ;)).\n\n"
    },
    {
      "time": "",
      "content": "Truly awesome Nick. Always tricky I thought, ragged right in narrow text columns, but it works, somehow or other. Four months!!!!! The pdf from NewsDesigner shows the fonts and scheme very clearly. Congratulations. Can't get over the 4 months.\n\n"
    },
    {
      "time": "",
      "content": "Nick,  \nI am missing out on all the fun! Where can one of those non-Canadian souls from south of the border gat a peek at the paper? Is there a PDF available yet? or a scan you can post?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I can mail you the contents of our recycling bin, Chris.... ;-)\n\n"
    },
    {
      "time": "",
      "content": "\"I can mail you the contents of our recycling bin,\"\n\nBefore or after it has been under your birds cage? :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Before -- it's cheaper that way.... ;-)\n\n"
    },
    {
      "time": "",
      "content": "Cheaper but but not deeper (and less fertile).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "ROFL! Why don't you just pop across the Mall to the embassy and see if they've got a copy? They used to get the Mop and Pail next day when I lived there....\n\n"
    },
    {
      "time": "",
      "content": "Yes... more paper space and harder horizontals makes a really natural and easy framework. Not unlike the Chicago Reader redesign.\n\nThe half page guide is horribly set though! Such a heavy face to read! The News Italic is rather friendly. I wouldn't want to read any bad news with it dancing at me. I'd pick up a USA Today if I wanted such a cheerful delivery.\n\nThe Text faces are fantastic, Nick. Why so many weights of the Sans and News while only two of the Text? I could easily see a Text Light in the same value as the News and Sans counterparts. Are they actually using all of the weights in the toolbox?\n\nThe big question... will they go retail?\n\nbtw: I always enjoy seeing your Chicago Trib contribution.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Silas. The emphasis is on the sans faces, restricting the serif face just to text, hence the more weights of the sans. From a font production point of view, there are many efficiencies in producing multi-weight families through interpolation. There is actually a display version of the serif face, which is used sparingly, and not mentioned in the guide.\n\nYes, they will be using all the weights, as they have a lot of different sections throughout the week, so the Thin will appear in Fashion, of course.\n\nAbout the \"cheerful delivery\". There's certainly a fair bit of personality and calligraphic action in the GM News version of the sans, those qualities were developed to make it the humanist contrast with the stripped-down, more geometric GM Sans sans. With smooth execution, that may come across as cheerful, but I would hope it's more like \"pleasant\", as a newscaster might be considered, even when delivering bad news.\n\nIt could be compared to other ductus-informed news faces such as Luc De Groot's Corpid, used in the Metro papers, which has some cute qualities too, such as the bendy-stemmed v's and w's, and the semi-serifed i, which don't seem to hurt it.\n\nUltimately, the humanist liveliness of the GM Sans was a direction of my design brief, stipulated, I would assume, as a necessary foil for the gridularity of the layout, all rectangles and rules, and the dry tone of the Globe and Mail's headline copy. So I think that on a daily reading basis, when readers have developed a familiarity with the paper as a whole, that bit of warmth won't stand out, but will be a comfortable part of the reading experience.\n\nYes, the fonts will go retail after a year's exclusitivity, which may just give me time to develop CE characters and the OpenType features.\n\n"
    },
    {
      "time": "",
      "content": "Sorry to be late to the party, but congrats Nick on another brilliant set of fonts. Are your Richler fonts ever to become commercially available?\n\n"
    },
    {
      "time": "",
      "content": "Nick: I agree that any redesign takes a bit of warming up to, especially when its as progressive as what we have here. I say we need more of this sort of work too -- keep the humanist wave rolling. There's so much to explore, and a daily newspaper is a tremendous place to do so. Get the public eye tuned to where type design is naturally heading.\n\nI don't think it will take very long at all for the GM's readers to cozy up though. The layout and type direction are clean, sensible and purposeful. Just gotta trust the design team to polish and maintain the system.\n\nOne year's exclusivity passes so quickly! Godspeed with fleshing out the OTFs.\n\n"
    },
    {
      "time": "",
      "content": "I thought I'd replied to this!\n\nNick, really great work. Your typefaces really do go a long way in making this redesign strong. Nice work!\n\n"
    },
    {
      "time": "",
      "content": "Without wishing to diminish what Nick has achieved -- in only four months --, I think there are some problems with the new text face. Maybe the eastern edition of the newspaper is better printed than the western edition, but when I picked up a copy yesterday I really didn't think the quality of the printing was good enough for the kind of subtleties Nick has included in the design, and which look so nice in the PDF. Arguably, this is a problem with the printing and not with the typeface, but surely the design of a typeface for a particular newspaper should take the production standard of that paper into account. I actually found the new text face quite hard to read, and while I like the idea of the ragged-right setting very much, the columns are too narrow. The column width in the old design on the larger page was much better, especially considering that lines in the new columns are made narrower-still by being ragged-right. I find it a very fragmentary reading experience.\n\nThe top of the lowercase s is very cramped, and this catches my eye more than any other letter. I want to grab that droopy terminal and pull it up a bit. Given that the usual aim in 9pt text type is to make very open counters, and Nick has done this elsewhere in the design, I find the s very out-of-character and distracting.\n\nOverall, the new design is a lot more interesting than the majority of north American newspapers, but I'm not convinced it actually works very well. Compared to the Guardian redesign of a couple of years ago, the new Globe and Mail seems quite crude. Of course, the production standards of the Guardian, like those of most European newspapers, are very much higher and the type very much crisper on the page.\n\n"
    },
    {
      "time": "",
      "content": "_surely the design of a typeface for a particular newspaper should take the production standard of that paper into account._\n\nOf course, and these types were press tested during development. Not having seen the issue you refer to, I can't say what your problem is.\n\n ![](http://web.archive.org/web/20110524040800im_/http:/typophile.com/files/sasnse_5697.png)\n\nWith regards to the \"s\", what you're probably noticing is that its lower counter is more open than the top -- but I designed the glyphs not so much for individual poise, rather for how they ineract with other glyphs, and IMO if that consideration is met, then having a bit of attitude in the individual glyph is a benefit.\n\n_quite crude._\n\nYou must be kidding. The templates are complex and extremely precise, they have to be, with all those line rules. But yes, The Guardian does have slightly better printing. However, it too had some production issues at immediate launch, which is par for the course for newspapers. Fortunately, unlike, say, a brochure, there's the opportunity to refine things through successive issues.\n\nJust pulled out a copy of that Guardian first issue, 12/09/05, and compared it to Monday's Globe and Mail -- its paper is still brighter and black inker darker than Monday's Globe and Mail. We must be using too much recycled content :-)\n\n"
    },
    {
      "time": "",
      "content": "_Fortunately, unlike, say, a brochure, there’s the opportunity to refine things through successive issues._\n\nIndeed. Maybe I got a dud copy on the first day. It's looked better since then, although I still don't think the printing does the type design many favours.\n\nThe thing with the lowercase s is that I really don't think it does interact well with the other glyphs: I think it stands out, and the main reason for this is that the heavy top terminal sags and gives the whole letter a pronounced downward slope. I also think it is too narrow, and this exacerbates the problem by making the internal curves very tight compared to letters like c and e. [By the way, a good trick to getting the width of the s to harmonise well is to design a Cyrillic at the same time as the Latin: if you design the s with an eye on the Latin a and the Cyrillic в it is possible to triangulate the width.]\n\nRegarding the layout of the new design, after a couple of days I still think the columns are painfully narrow and a very unpleasant reading experience. When they adopted the smaller page size they should have gone to a 5-column layout. I wouldn't be surprised to find that the new Globe and Mail wins some sort of prize for the narrowest column measure in a national newspaper. When I said it was crude, I wasn't questioning the complexity and precision of the templates. I meant maintaining the same editorial structure based around a six-column layout was crude compared to what we saw when various UK newspapers adopted a smaller format and revised not only the appearence of the paper but the way in which news was structured. [Mark Barratt gave a very interesting presentation on this at ATypI Prague. The most fascinating case was the Times, which maintain a broadsheet and tabloid format side-by-side for some time, so one could compare the ways in which the same stories and images were packaged.]\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20110524040800im_/http:/typophile.com/files/resaspt_3740.jpg)\n  \nJohn, humanist faces are characterized by a variance in character width and angled stress. Compare GM Text with Garamond and Times (or Manticore)--and of course the venerable news face Plantin-- and note that they all have a narrow s. \n\nIn the GM Text s, the top aperture is plenty open enough, as you can see in comparison to the other faces here.\n\nGM text replaces Utopia, which had served the G&M well, but David Pratt wanted something with a bit more attitude, on a par with the liveliness of the GM News face, and to contrast with the reserve of GM Sans. So I gave the face wedge-shaped terminals and an angularity that animates the top of the x-height, with some of the \"cut\" I admire in Nimrod and Palatino.\n\n_maintaining the same editorial structure_\n\nBut it's not the same! They have integrated web and print (physically, too, in the newsroom), and the new editorial structure grew out of that. The six columns gives them the flexibility to break down stories into multiple graphic treatments -- sidebars, charts, pull quotes, infographics, \"links\" etc., -- which seems to be where news presentation is heading, like it or not. Having six columns gives a little more scope for this than five. In fact, when there's only five coulmns in a paper, and, as can happen, there's not much going on in a page, it can look really dull and more like a newsletter than a paper.\n\n"
    },
    {
      "time": "",
      "content": "Nick, you like to dip your 'a' tails way below the baseline. Here and in [Nicholas](http://web.archive.org/web/20110524040800/http:/www.fontshop.com/fonts/singles/shinntype/nicholas_regular/&sample_text=%EF%AC%82animals&sample_size=96). Can you tell me more about that decision?\n\n"
    },
    {
      "time": "",
      "content": "Here, because the a's right stem doesn't curve out at the bottom, I felt a demonstrative serif was appropriate, or else it would be too weak an ending -- so its relationship to the baseline is a rotation of the relationship of the serif on top of \"p\" etc. to the median line across the top of u, v, and the crossbar on f and t.  \nIn Nicholas/Goodchild, I followed Jenson faithfully.\n\n"
    },
    {
      "time": "",
      "content": "Perhaps Nicholas and Goodchild are just jarring to my 21st century eyes, accustomed to the other typefaces you illustrate above.\n\n"
    },
    {
      "time": "",
      "content": "There's always a place for funky, calligraphically-informed faces such as Palatino and Maiola.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for posting the image, Nick, it demonstrates my complaint very well. The proportions of the s in Utopia and Nimrod are far better suited to newspaper type than the narrower forms in the other types. [Despite it's origins, it should be remembered that Times, as James Mosley observed, had a much more successful career as a book face than as a newspaper face.] The width of the GM Text s relative to the other letters is closest to the proportions of Garamond: a model I consider very inappropriate for a newspaper type. Further, in the examples shown, only GM Text exhibits the drooping top terminal which gives the letter a thrust to the lower right, contrary to the dynamics of all the other letters. In all the other types, the top of the s is designed to optically lift slightly, precisely to avoid this problem. In the narrow Garamond s this feature is particularly strong im order to keep the narrow letter open.\n\nThe other thing that Utopia and Nimrod have in common is a very good evenness of colour, while GM Text has much greater variety in terminal and stroke weight. This does indeed make GM Text funkier, but it is this feature of the design that I don't think fares well in the print quality of the newspaper. If the basic colour of the text is even, then ink gain or loss will still result in an even colour. If the base colour is uneven, then variation in pressure and ink coverage in particular can exagerate certain features of letters (to the point where the heavy upper terminal of the s almost merges into the middle stroke as I saw in one ink-heavy place today). This kind of variation is impossible to avoid in newspaper printing, in which even different areas of the same page can be subject to ink gain or loss due to the density of nearby images. [This is a feature of newspaper production that the Poynter types brilliantly address, providing variant designs for use in closer or further proximity to photographs.]\n\nRegarding the column width, if they were dedicated to six columns, why did they go to a narrower page size? and why did they decide to force the actual line length to be even narrower by sticking entirely unnecessary rule lines between columns and using ragged right. The average line length in a random story I examined today was only 4-5 words long. We know quite a lot from eye movement studies about what a reader does at the end and beginning of a line, and in very narrow measures the cues to shift to the next line are happening almost as soon as we start a line. Simply put, the columns are too narrow to be read properly, and what happens is vertical skimming. I find myself doing this all the time in the new Globe and Mail.\n\n_In fact, when there’s only five coulmns in a paper, and, as can happen, there’s not much going on in a page, it can look really dull and more like a newsletter than a paper._\n\nI think this captures very well the apparent concerns of the redesign: to make the newspaper _look_ interesting. In that I suppose it succeeds, but the only page I _read_ with any pleasure or ease today was the Comment and Letters page, which has a five column layout. It does indeed look dull compared to many other pages, but it's friggin' readable!\n\nOh well, the National Post is a more entertaining read anyway: I'd rather be outraged and offended by the content than by the difficulty of reading it. :)\n\n"
    },
    {
      "time": "",
      "content": "_a model I consider very inappropriate for a newspaper type_\n\n ![](http://web.archive.org/web/20110524040800im_/http:/typophile.com/files/displayed_6598.jpg)\n\nJohn, there is nothing inherently wrong with the form of the humanist/old style of type for news text. Plantin (shown at top) was for many years a succesful news face, and although it has fallen from favour, the old Dutch style that it represents was the driving idea behind Poynter OS.\n\n_drooping top terminal which gives the letter a thrust to the lower right, contrary to the dynamics of all the other letters._\n\nIt's not about dynamics, by which I presume you mean direction, but shape. The shape of the GM Text s's top terminal is mirrored/flipped in the top stem of the p, and in the top terminal of the a, etc. -- so there is harmony (repetition) of form there, as well as contrast (mirroring).\n\n_If the base colour is uneven, then variation in pressure and ink coverage in particular can exagerate certain features of letters_\n\nThis is incorrect. The \"uneven\" quality of GM Text, i.e. its pronounced contrast of thick and thin strokes, is designed in anticipation of the substantial press gain that occurs in newsprint, which fattens everything, significantly reducing contrast, toning down features not, as you state, exaggerating them. This is because the same absolute amount of gain has a far greater effect on the relative width of a fine stroke than it does on a thick one. Note the bottom sample. It is precisely because of gain, and the \"grey on grey\" of news ink on news paper, that an initially dramatic letterform is desirable.\n\n_We know quite a lot from eye movement studies_\n\n...which can be used to back up just about any theory one may wish to advance as to what is most readable.\n\n_the only page I read with any pleasure_\n\nDesigners and typographers react differently to text than ordinary readers. If there is something in the layout or typography which contradicts their preference or theories about what is ideal, they find it distracting in a way that the intended reader doesn't. Which is why a progressive design will get flak from the pros.\n\nThe Globe and Mail redesign was, of course, done with numerous focus groups, and response was remarkably positive. Of course, as with all redesigns, there will be some lost readers, but most will stick with it and adapt, and there will be new readers attracted. This is a consistent finding in news publishing: print readership is in slow decline, but redesigns provide a spike.\n\nAs Macleans columnist Paul Wells commented recently on his blog,\n\n\"my overwhelming response is a cranky old reader's cliché that redesign editors everywhere have come to wearily expect: I can't read the damned thing.  \nWe were told the same thing when Ken Whyte shook up Maclean's, yet circulation has held steady, fully paid-up circulation is rising, and newsstand sales are galloping along.\"\n\n"
    },
    {
      "time": "",
      "content": "Sorry, on further investigation News Plantin wasn't as widely used as I had assumed.  \nOther than Times, Olympian, by Matthew Carter, is an old style news face, and his Charter, more recently popular as a news face, has a narrow s. Anyway, whatever the precedents may be, I have no reservations about that s.\n\n"
    },
    {
      "time": "",
      "content": "Nick, when I talked about uneven colour I was not refering to the contrast between thick and thin strokes, which I expect and which we all know how to manipulate to produce an overall even texture. I was talking about the difference in weight between thick stroke and thick strokes, which is exagerated by ink gain as clearly shown in the photograph you posted: the straight ascending strokes are all markedly heavier than other features.\n\nYou quote Paul Wells saying 'We were told the same thing when Ken Whyte shook up Maclean’s, yet circulation has held steady, fully paid-up circulation is rising, and newsstand sales are galloping along.' What that doesn't acknowledge, and probably Mr Wells and most other people are unaware of it, is that the Macleans type was revised after the initial launch of the redesign precisely to address the complaints that had been raised by readers.\n\n_Designers and typographers react differently to text than ordinary readers. If there is something in the layout or typography which contradicts their preference or theories about what is ideal, they find it distracting in a way that the intended reader doesn’t. Which is why a progressive design will get flak from the pros._\n\nI guess there is nothing more to be said on the topic, since you have just a priori dismissed any criticism I may make. I thought I was thinking critically, but apparently I was just reacting against progress in favour of my preferences and pet theories. Silly me.\n\n"
    },
    {
      "time": "",
      "content": "_the difference in weight between thick stroke and thick strokes, which is exagerated by ink gain as clearly shown in the photograph you posted: the straight ascending strokes are all markedly heavier than other features._\n\nI don't see that at all, and as I said, it's not what happens. Ink gain swells all strokes by the same absolute amount, not by a percentage. Therefore it diminishes contrast, not exaggerates.\n\n_you have just a priori dismissed any criticism I may make._\n\nNot at all, but you must choose your ground. You can't claim to be \"a reader\" who claims it's friggin' impossible to read, and at the same time make disspassionate statements about readability based on typographic knowhow. That's a conflict of interest.\n\n"
    },
    {
      "time": "",
      "content": "Let's forget about the Globe and Mail for a bit (although I'll later have some further, illustrated comments about the problems of the narrow column width), because I think your most recent comments have raised a more interesting if troublesome topic: how can we be critical of design, and specifically typographic design?\n\nIn one message you dismissed both the relevance of the findings of the scientific study of reading, on the grounds that they 'can be used to back up just about any theory one may wish to advance', and dismissed the criticisms of designers and typographers -- the 'pros' -- as being reactionary against a 'progressive' design. Of course, this makes the claim that the design in question is progressive an unchallengeable presumption. The other adjectives that have been used are the equally vague 'edgy' and 'funky'. 'Humanist' is used as a synonym for arbitrary and inconsistent. Overall, this form of dismissal of criticism -- not just of my particular criticisms, but of the possibility of criticism: especially and ironically criticism by typographic professionals -- gives carte blanche to any arbitrary decision in design which can be justified by appeals to edginess, funkiness or progressiveness.\n\nI've known you long enough, Nick, to know that you're a thoughtful designer, so I'm sure you see the problems of cutting off the possibility of criticism in this way and the subsequent reduction of critical opinion to personal preference. But it does raise interesting questions about how we can, as typographic professionals, i.e. as a particular kind of reader, make critical judgements about type design, layout, etc. I don't think there is a 'conflict of interest' between being a typographer and being a reader, because the implication of such a conflict is that the very fact that I might know what I'm talking about disqualifies me from saying anything, which is insane. As far as I know, all typographers are also readers\\*, and their professional skills and experience make them _informed_ readers; that is, they are capable not only of reading but of examining and drawing conclusions about the material form of text as it relates to their own experience of reading.\n\n\\* I know of one example of a type designer who was not a reader, i.e. he was illiterate, but so far as I know no one involved in the planning, setting and arrangement of text has done so without also being able to read it.  \n\\_\\_\\_\\_\\_\n\n_This is a consistent finding in news publishing: print readership is in slow decline, but redesigns provide a spike._\n\nYes, and this is something that should be a red flag to any type designer and typographer, because this consistent finding says nothing about the quality of the redesign, only about the financial impact of novelty. There is an economic incentive in terms of increased circulation that is very attractive to publishers. I suspect that as the overall readership figures continue to decline we will see more and more frequent redesigns, but also less and less money invested in those redesigns as publishers seek that circulation spike at the lowest possible cost.\n\n"
    },
    {
      "time": "",
      "content": "_the subsequent reduction of critical opinion to personal preference._\n\nPerhaps professional opinion, when applied to the work of a peer, can be objective, but how is it possible to know? This is the idea behind conflict of interest. By the same token, an analysis of the services of a competing colleague cannot be considered objective.\n\n_this form of dismissal of criticism ... gives carte blanche to any arbitrary decision in design which can be justified by appeals to edginess, funkiness or progressiveness._\n\nJohn, the Globe and Mail redesign and typography were based on principles. They may not be the principles you subscribe to, but that doesn't make the design arbitrary. When I described the paper as edgy and progressive, that was a straightforward description; not a justification for the design, but a consequence of it. Safe, dull, and conservative was not the intention.\n\n_...this [print readership in slow decline, redesigns provide spike] ... is something that should be a red flag to any type designer and typographer, because this consistent finding says nothing about the quality of the redesign, only about the financial impact of novelty._\n\nNot so. It is the high quality of newspaper redesign that boosts an otherwise declining medium, keeping it up to date. It is an inspiration to know that innovation (which John dismisses as \"novelty\") in news presentation can help maintain readership and the relevance of print journalism.\n\n"
    },
    {
      "time": "",
      "content": "_When I described the paper as edgy and progressive, that was a straightforward description_\n\nI don't see how the catchwords of popular culture branding exercises constitute a 'straightforward description'. A straightforward description is saying e.g. that the page size is x number of millimetres narrower than in the previous design and there are an average of y.z fewer words per line, etc. 'Edgy' and 'progressive' are judgements about the design, not descriptions of it.\n\nThere seems to be a lot of confusion, these days, about the difference between description of a thing and expression of judgements about a thing, much of it involving the language of marketing hype. People are so used to throwing these vague but positive-sounding catchwords around that critical communication becomes very difficult. I believe much of this confusion is deliberately manufactured by a marketing industry that has a vested interest in making it difficult for people to talk meaningfully about quality.\n\nI'm not claiming that my criticisms of the new Globe and Mail design are 'objective', and I don't see that they need to be. I'm saying that these are my criticisms and these are my reasons for them. I suppose I could have just said 'I don't like it very much', but that wouldn't be completely accurate and it wouldn't be sufficiently respectful of the work, which deserves some kind of analysis. So I've said what I find problematic and the reasons why these things seem to me problematic.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for your comments John, I'll try and be a bit more gracious in future and accept the brickbats along with the bouquets.\n\n"
    },
    {
      "time": "",
      "content": "Brickbats are, in any case, more useful than bouquets, do not require water, and last longer. You can use them as paperweights or doorstops while waiting for an opportune moment to chuck them back. :)\n\n"
    },
    {
      "time": "",
      "content": "_Postscript_\n\nWithout wishing to stir further debate, since Nick and I seem to have reached a kind of accomodation, I still wanted to post the promised illustration of a particular problem of the narrow column width and ragged right setting. This is one of those situations in which if you push something too far in one direction, you inevitably end up having to compromise elsewhere. In this case, you purchase the narrow columns and the ragged right setting at the cost of excessive hyphenation. There's no other option, because if you reduce the hyphenation the stories overrun their column inches and half the ragged lines end up with excessively large white space on the right. Achieving a visually pleasing, even rag requires considerable care even on wide measures; on a narrow measure it can only be achieved by plentiful use of the hyphen.\n\nIronically, the copy introducing readers to the new design reads: _'We have adopted a universal ragged-right format so we can use large-text type in narrow columns, which reduces the need to hyphenate words. This makes for smoother reading.'_\n\nThe photo below was taken from a randomly selected story last week. When 60% of the lines are hyphenated, two in the middle of proper nouns, I don't think the 'smoother reading' theory is holding up too well.\n\n ![](http://web.archive.org/web/20110524040800im_/http:/typophile.com/files/GMhyphens_5380.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Congratulations, Nick!\n\n"
    },
    {
      "time": "",
      "content": "60%?\n\nYour criticism of the format would be more meaningful if you calculated the percentage of hyphenated lines in the body text on 6-column pages, and compared it with the percentage of hyphenated lines on 5-column pages (the main editorial).  \nI look forward to your numbers -- I did some quick calculations and came up with around 25% for both.\n\n"
    },
    {
      "time": "",
      "content": "Thanks David.\n\n"
    },
    {
      "time": "",
      "content": "So Nick, are you involved in the Toronto Star redesign as well? I saw a notice in the paper that they have one coming out in a few weeks. Lopping another inch or so off the width of the pages again. I'm surprised that they haven't hit the minimum roll size for their presses yet.\n\n"
    },
    {
      "time": "",
      "content": "No. I was briefly involved in developing the present design, but they didn't go with any of my stuff. As a longstanding Star reader, I thought the present design didn't look enough like my \"alternative\" paper -- with its mainstream North American news typography. The way I heard it, ex-publisher John Honderich was very keen on having all-serif headlines; you can see the designers breaking out on the weekend when they don the sans faces, even setting body in it for some stories.\n\nSo it's ironic at the moment that the G&M has broken the mould, and I'm really looking forward to seeing how the Star responds. Really, if they want to position themselves to the left/ahead of the G&M, they have to go for sans body text. Wouldn't that be something. But maybe they have something else up their sleeve, I hope so, and would love to be outraged. Bring it on! -- the Toronto/Canada \"newspaper wars\" of c.2000 resulted in some marvellous invention. And now, with the broadsheets shrinking, and both Now and Eye well established, and Metro, Exclaim, Xtra, etc., the newsprint scene here is pretty intense.\n\n"
    },
    {
      "time": "",
      "content": "Congratulations Nick.\n\nI've had my head down to the grindstone so severely lately I haven't even looked on my neighbours porch or in his recycle bin to grab a peek while picking up our Star. Even the Star's two-week-old stories on the Helvetica film and your Softmachine are sitting under a pile of loose ends for a read!\n\nAnd logging on to typophile--forget it.\n\nBut I do want to say, after reading this thread for the first time today: while the intensity in the exchange between you and John is palpable, for the observer of the excahnge is intensely valuable, because it brings out for consideration aspects and motivations which might not have become articulated otherwise.\n\nI wonder if what happened with the CBC Radio One programming a few years back is now happening with the Globe and Mail as well. While we baby-boomers are or were it's biggest demographic and strongest patrons in terms of tax dollars, our now-adult children became it's target or lusted after audience. Smart, but irritating. We become indulgant and nostalgic.\n\nI think it's right that 'funkier' and 'edgier' as brief must be seperated from those terms as foils for criticism. John, how would you have handled an assignment that included those terms in the brief and wanted to retain the considerable layout flexibility advantages of a six column grid over a five column grid on a narrower paper?\n\n"
    },
    {
      "time": "",
      "content": "I agree that the exchange was valuable.\n\nPeter, it's interesting that you have decided this might be is a generational difference.\n\nIt's nice to hear your perspective again.\n\n"
    },
    {
      "time": "",
      "content": "The penalty of size:\n\nBig newspapers suffer a typographic handicap from the get-go.  \nThe state of the art pagination systems that coordinate the activities of several hundred workstations are short on typographic finesse.  \n(My anecdotal experience from dealing with newspapers of various sizes -- not an expert on pagination systems.)\n\nOf particular note are the lack of support for ligatures (even f\\_i and f\\_l), and relating to John's interest in hyphenation, the lack of multi-line composition. And of course, because the text is necessarily always live, there is no opportunity for manual tweaking.\n\nMulti-line H&J software would, I suspect, reduce hyphenation -- just a little thing like nixing partial-word widows would be a huge improvement!\n\nIt would be interesting to compare hyphenation percentages by:  \n1. Rag right vs. Justified  \n2. Single-line composition vs. Multi-line composition  \n3. Characters-per-line\n\nI wonder if there is research on this?\n\nVariables such as the number of successive hyphenated lines permitted may also be a factor, as well as letterspace and wordspace settings. And minute changes to tracking, horizontal scaling, line length, and type size can also move the sweet spot significantly. We're all familiar with the situation where changing one letter in a paragraph will suddenly cause several hyphenations where none existed before. With so many variables, setting H&J specs becomes something of an art.\n\n"
    },
    {
      "time": "",
      "content": "Peter: _I think it’s right that ‘funkier’ and ‘edgier’ as brief must be seperated from those terms as foils for criticism. John, how would you have handled an assignment that included those terms in the brief and wanted to retain the considerable layout flexibility advantages of a six column grid over a five column grid on a narrower paper?_\n\nI sometimes have clients who throw out similarly vague catchwords as part of what they want in a typeface design, and the only way to interpret such words is as what the client is hoping other people will say about the design when they see it. So its a kind of anticipatory marketing. For me, this kind of thing is always a problem because I like specific targets, so I end up either ignoring these catchwords and focusing on the technical goals of the project that, in the end, are what really need to work, or risk annoying the client by pushing them to explain what they mean.\n\nI'm typically quite ready to point out to clients the contraditions that are often inherent in their goals, and the choices that these present in terms of where the compromises can fall. What I don't like clients to do is to proceed in the belief that there won't be compromises, even if this undermines the optimism of their marketing strategy. Some goals are simply at odds with each other, and either need to be revised or the inevitable compromises accepted (in which case part of the design brief becomes the minimisation of the impact of these compromises, and at that point we're in the realm of the kind of design issues that I like most: specific functionality rather than vague or fluid stylistic associations). So in the case of a newspaper reducing its page size while maintaining the same number of columns per page, the first thing out of my mouth would probably be about the impact of narrower columns, just as it has been in this thread, and the stylistic aspects of the brief would be of secondary concern to me.\n\nI suspect that central to the debate that Nick and I have had on this subject is that we're probably quite different kinds of designers, and he is more comfortable dealing in the language of stylistic associations (edgy, funky, etc.). This is clearly a strength on his part in terms of dealing with certain kinds of jobs and clients.\n\nI'd like very much to have the opportunity to design a text face for a specific newspaper, because the technical challenges posed by both layout design and print production are exactly the sort of things I like to deal with and which I can't often address as precisely as I would like in types that are aimed at broader use (multiple sizes, many different kinds of layout, different output devices, etc.) But I would find a brief that specified styslistic considerations, i.e. that sought to use the typeface to evoke particular associations or catchwords, either frustrating or irrelevant, because I would be setting out to design the most readable typeface possible within the framework imposed by the layout and production, and that would ultimately determine the style of the type.\n\n"
    },
    {
      "time": "",
      "content": "Peter: _I think it’s right that ‘funkier’ and ‘edgier’ as brief must be seperated from those terms as foils for criticism._\n\nYes. I used the term \"edgy\" to describe the outcome of a design process, and I qualified it in my first post here with regards to all sans heads and all ragged body text. Those features of the design are quite unusual in a newspaper. I don't recall that any client has ever given me a direction to make it \"edgy\" or \"funky\", certainly not the Globe and Mail.\n\n_I would be setting out to design the most readable typeface possible_\n\nThat's how I work too, although \"readable\" isn't one of my catchwords :-)\n\n"
    },
    {
      "time": "",
      "content": "Eben Sorkin has posted [photos](http://web.archive.org/web/20110524040800/http:/www.flickr.com/photos/ebensorkin/tags/torontoglobe/) of Nick Shinn's Globe and Mail presentation at TypeCon.\n\n"
    },
    {
      "time": "",
      "content": "With a great shot of Nick! Well done, Eben!\n\nChrisL\n\n"
    }
  ]
}
