{
  "id": "33241",
  "title": "Thanks to CS3, I can now KNOW one icon from the next! Thanks Adobe!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Thanks to Adobe’s latest release, I can now actually tell all their programs apart! I just loaded my newly arrived CS3 suite. Miguel a while back posted some previews of the new icon system and I am pleased to say I LOVE the new system! With a very quick peek at the dock, I can instantly launch the Adobe app I want without having to figure what the butterfly/flower/whatever business is all about. It is now just, BaDaBing, right there! WHAT A PLEASURE!\n\nSo Miguel, I don’t know who was smart enough to make the decision to go that way, but buy them a beer for me! BRAVO!!!\n\nChrisL\n\n ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/CS3icons_3956.png)\n\n [‹ How could they not lose?](http://web.archive.org/web/20080121184052/http:/www.typophile.com/node/33282 \"Go to previous forum topic\") [Looking for Mini-cooper fold-up car ad from a few years ago. ›](http://web.archive.org/web/20080121184052/http:/www.typophile.com/node/33356 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080121184052/http://www.typophile.com/user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": " 23.Apr.2007 9.06am",
      "content": "Looking forward to getting my upgrade!\n\nBut... ummmm... I’m sure you meant “a very quick peek at the DOCK”... didn’t you? ;-)\n\n"
    },
    {
      "time": " 23.Apr.2007 9.17am",
      "content": "Maybe he did.\n\nMaybe he didn’t.... ;-)\n\n"
    },
    {
      "time": " 23.Apr.2007 9.35am",
      "content": "The cock does look nicer now, doesn’t it? ;)\n\n"
    },
    {
      "time": " 23.Apr.2007 9.39am",
      "content": "Real Life Conversation with Chris\n\nChris: Dude, the new icons for CS3 are Da bomb.  \nMe: Really man, why?  \nChris: Fo’ sho, a quick peek at the ol’ cock and blam instant photoshop.  \nMe: Did you just say cock?!  \nChris: Dock Fool, I said Dock  \nMe: Sure ya did.\n\nChris, punching me in the ribs: Gotcha!\n\nEnd Scene\n\n"
    },
    {
      "time": " 23.Apr.2007 9.46am",
      "content": "Yay for post-announcement upgrades! My CS3 upgrade will cost me a whopping $5.\n\n"
    },
    {
      "time": " 23.Apr.2007 9.49am",
      "content": "Pfff, $5? That’s just too much. ;)\n\n"
    },
    {
      "time": " 23.Apr.2007 10.21am",
      "content": "The icons certainly are an improvement in their (relative) simplicity.\n\nBut to change the subject a bit: If anyone’s using the new CS 3 programs on a G5 (or other PPC-based) Mac, how does the speed compare to the CS 2 versions? I’d be anxious to know especially if they’re really slow (edit: though that’s not what I’ve read so far regarding PS).\n\nOlli\n\n"
    },
    {
      "time": " 23.Apr.2007 10.31am",
      "content": "Now Otis, what was I tryin’ to say? Sing it for me please!\n\n ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/DOCK_4791.jpg)\n\nChrisL\n\nPS: NEVER trust spell check!\n\n"
    },
    {
      "time": " 23.Apr.2007 10.39am",
      "content": "Quickly moving right along now past my red-faced embarrassment and fat-fingered lack of typing skill :-/\n\nI have one of the original PPC G5 2ghz desktops and CS3 is actually FASTER!!! than its predecessor! So don’t sweat it, just get it! It is quite snappy!\n\nChrisL\n\nPS: Now I better proooof read this puppy quick!\n\n"
    },
    {
      "time": " 23.Apr.2007 10.46am",
      "content": "But back to the earlier conversation, I worked on a cookbook that had been translated from French to English (I did only the cover design). There was a recipe for coq au vin. The first instruction read “First find your cock. The cock meat should feel firm to the touch.”\n\nWe got a lotta laughs out of that one.\n\n"
    },
    {
      "time": " 23.Apr.2007 10.57am",
      "content": "Patty,  \nLOL! You definitly win the prize for that one!\n\nChrisL\n\n"
    },
    {
      "time": " 23.Apr.2007 11.05am",
      "content": "I’ve been using CS3 exclusively for a couple of weeks now, it really is a killer update. The new icon system is killer; I have yet to launch the wrong app. And talk about performance, it’s a pretty impressive performance tweak, at least by Adobe standards. All the DP apps are rock solid stable too.\n\nOf course, I’m still pretty ticked that getting this requires an expensive update with few new features that can justify the price. If Creative Suite had been published by a video game company, as opposed to Adobe, the performance overhaul and stability fixes from CS2 and CS3 would have been a free patch. If I actually had any money I would establish a fund to try and bring Inkscape, Scribus, and the GIMP up to par with Adobe’s apps so that we could stop having to buy upgrades just to get bugfixes.\n\n"
    },
    {
      "time": " 23.Apr.2007 11.18am",
      "content": "I don’t know how Jpad got his copy so early or how Patty swung the deal for 5 bucks but I am jealous on both counts!\n\nI do wish there was more Opentype support in this rev though. There are some added dictionairies and some type related interface changes which I am not sure are better or worse until I give it some time.\n\nChrisL\n\n"
    },
    {
      "time": " 23.Apr.2007 2.09pm",
      "content": "For me, CS3 appears to be a more-power-for-mac-users update, which is very okay of course. Me Windows-User will wait for CS4. Updating is too expensive for me now.\n\nOn the icons: It’s long time I have abandoned the original butterfly-flower-feather icons and changed them for my own versions.\n\n"
    },
    {
      "time": " 23.Apr.2007 2.16pm",
      "content": "I don’t particularly dislike the new icons  \nI see the purpose/function  \nthough its kind of peculiar to me, going from an image to 2 characters\n\nif you launched the wrong app before,  \nhow much attention were you really paying?  \n(maybe i’m a little bitter, i like pretty pictures)\n\n"
    },
    {
      "time": " 23.Apr.2007 2.37pm",
      "content": "“how much attention were you really paying?”\n\nMuch more than any user should be required to and MUCH more than with any application I have ever used since 1986. I have used the Adobe apps since they hit the streets on day one. I was quite able to figure out which was which untill they started the CS naming series. I use these applications every day—practically all day. When I am working in a fury trying to meet a deadline or keep a train of thought, I should not be impeded by a cryptic icon system. If I wanted pretty pictures, I can load my desktop with them. To me, the previous picture icons were like trying to read my tax forms in Bickham Script with swash and all the frillies turned on. It might look pretty but is a pain in the aß to read. Thank heavens Adobe saw the light and made their icons readable.\n\nChrisL\n\n"
    },
    {
      "time": " 23.Apr.2007 2.52pm",
      "content": "\\>When I am working in a fury trying to meet a deadline or keep a train of thought, I should not be impeded by a cryptic icon system.\n\nIgnorant question, but does the Mac have an equivalent to the ALT+TAB shortcut on the Windows application bar? I’d not think to use the mouse for switching between apps.\n\n"
    },
    {
      "time": " 23.Apr.2007 2.52pm",
      "content": "I can’t tell you how many times I opened InDesign when I was going for Photoshop. I had to separate them on the dock.\n\nThe $5 upgrade: three words “post-announcement upgrade”. I am indebted to Paul Cutler for tipping me off to this and saving me $440.\n\n"
    },
    {
      "time": " 23.Apr.2007 3.05pm",
      "content": "<cite>Ignorant question, but does the Mac have an equivalent to the ALT+TAB shortcut on the Windows application bar? I’d not think to use the mouse for switching between apps.</cite>\n\nIt does, and that features allows me to disable expose and get more hotkeys in Indesign.\n\n"
    },
    {
      "time": " 23.Apr.2007 3.36pm",
      "content": "That shortcut is Command-Tab, where you just hold the Command-key and Tab thru a list of open programs (with Shift to modify the direction you tab in). I like that you can do this with your left hand, freeing up the right for mouse action.\n\n"
    },
    {
      "time": " 23.Apr.2007 3.38pm",
      "content": "_Ignorant question, but does the Mac have an equivalent to the ALT+TAB shortcut on the Windows application bar? I’d not think to use the mouse for switching between apps._\n\nYes, but it only shows applications that are running. To start one up, the usual method is to go to the dock.\n\n"
    },
    {
      "time": " 23.Apr.2007 3.55pm",
      "content": "I love the Photoshop CS3 beta and I’m on windows. Getting Dreamweaver and Flash with the Design Premium upgrade makes it pretty economical.\n\nI’m with you on the icons, Chris. I think they are great.\n\nI just hope there is an osmosis filter for Illustrator so I can get a lot better with it.\n\nSharon\n\n"
    },
    {
      "time": " 23.Apr.2007 4.08pm",
      "content": "If you used a little app called [Fruit Menu](http://web.archive.org/web/20080121184052/http:/unsanity.com/haxies/fruitmenu), you could setup a contextual menu with your apps and you’d never have to visit the dock again.\n\n"
    },
    {
      "time": " 23.Apr.2007 6.09pm",
      "content": " ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/tootyfruity_3732.jpg)\n\nChrisL\n\n"
    },
    {
      "time": " 23.Apr.2007 10.19pm",
      "content": "“I have one of the original PPC G5 2ghz desktops and CS3 is actually FASTER!!! than its predecessor!”\n\nThanks, Chris! That’s so good to hear. (I have a late dual 2 GHz.)\n\n(Sorry for changing the subject – again!)\n\nOlli\n\n"
    },
    {
      "time": " 24.Apr.2007 5.31am",
      "content": "Here’s a link to a set of updated CS3 icons with a little more character...\n\n[CS3 Icons](http://web.archive.org/web/20080121184052/http:/www.artofadambetts.com/weblog/?p=190)\n\n"
    },
    {
      "time": " 24.Apr.2007 5.53am",
      "content": "So now there is a set of arty replacement icons for those who want them. I am happy and proud to stick with the set that ships with CS3 from Adobe. “Different strokes...”\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 5.55am",
      "content": "Not a problem at all, Olli. Enjoy your upgrade!\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 7.21am",
      "content": "When I first saw the PSCS3 icon I thought it was a beta icon. It looks like an unfinished icon project to me.\n\nI’m going to wait to upgrade since it’s [too f’in expensive in the UK](http://web.archive.org/web/20080121184052/http:/news.zdnet.co.uk/software/0,1000000121,39286561,00.htm). It’s priced at almost double the price and I’ve already bought the [(PhaseOne)Capture One Pro](http://web.archive.org/web/20080121184052/http:/www.phaseone.com/) RAW application.\n\nAdobe CS3 Design Premium (upgrade) is: $599.00 (US) but $1199.49 (£599 +VAT) in the UK.\n\n"
    },
    {
      "time": " 24.Apr.2007 7.38am",
      "content": "Why is it so much more in the UK? Is there some kind of import tax or something?\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 7.49am",
      "content": "I guess American company accounts can only add and can’t divide or multiply so they use the same number $599 and £599. But it’s really £703.82 since you can’t escape the VAT. ($1409.70) so It’ll cost European companies hundred thousand more.\n\nThere is no import tax most US companies have Irish or Euro Sales/shipper places. Compugraphic had a place in Shannon and Microsoft has one in Dublin and Reading and London, so most set up a company to localize and ship around the world.\n\nIf they don’t keep the prices the same in the European Union they will get in big trouble with Brussels.\n\n"
    },
    {
      "time": " 24.Apr.2007 8.03am",
      "content": "Vince,  \nThat sounds like a mistake. Surely, Adobe knows pounds, euros, and dollars are not valued the same. Has anyone questioned Adobe about this disparity in pricing? It may just be a typo or some other screwup. The software they send to the UK is exactly the same as the U.S. version, I assume.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 8.56am",
      "content": "[http://news.zdnet.co.uk/software/0,1000000121,39286561,00.htm](http://web.archive.org/web/20080121184052/http:/news.zdnet.co.uk/software/0,1000000121,39286561,00.htm \"http://news.zdnet.co.uk/software/0,1000000121,39286561,00.htm\") this was linked in my first response....\n\n"
    },
    {
      "time": " 24.Apr.2007 9.07am",
      "content": "“Adobe blamed the increased prices on the fact that the UK market is smaller than the US. “Adobe sets pricing in each market based on customer research, local market conditions and the cost of doing business. The costs of doing business in European markets are significantly higher per unit of revenue than in the US,” the company said in a statement sent exclusively to ZDNet UK....\n\nThe revelation over Adobe’s prices follows just a month after a petition was created on the 10 Downing Street website to protest over unfair pricing of Microsoft Vista. ...priced in the UK at more than double the retail price in the US.”\n\nUnbelievable, Vince!\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 10.44am",
      "content": "My CS3 upgrade is still on the way, but I’ve already prepared this set of customized icons for it.\n\n ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/CS3icons_mod_5715.png)\n\ns’marks\n\n"
    },
    {
      "time": " 24.Apr.2007 11.12am",
      "content": "Well I guess those UK prices make up for how Americans are totally fleeced when we travel to London. I find most prices are the same in dollars and pounds, i.e. $2 or £2 for a coffee; $200 or £200 for a hotel, which of course comes to double in dollars.\n\n"
    },
    {
      "time": " 24.Apr.2007 12.23pm",
      "content": "“I’ve already prepared this set of customized icons”\n\nThose must be the comic relief version :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Apr.2007 2.40am",
      "content": "I don’t particularly like the new icons. For me real semplicity and visual effectiveness look like this:\n\n[http://www.kare.com/shop.html](http://web.archive.org/web/20080121184052/http:/www.kare.com/shop.html \"http://www.kare.com/shop.html\")\n\nSorry to bring back this old debate.  \nI’m one of those who customize everything since MacOsX’s first appearance. I don’t want it to look old, or as it was before, but design choices should make sense.\n\nAnd I agree that this icons are a big improvement, mainly because the colors haven’t changed again (which was the reason why I always clicked on the wrong icon)\n\n"
    },
    {
      "time": " 25.Apr.2007 4.59am",
      "content": "Elena,  \nThose were GOOD icons back then and only 16 pixels wide! That was before the marketing departments came in and screwed it all up with “pissazz”\n\nChrisL\n\n"
    },
    {
      "time": " 25.Apr.2007 5.10am",
      "content": "Yes you’re absolutely right.  \nBut I’m not saying that those icons are the best and should be used now. They are a good example of a good design answer in relation to a particular technology.  \nAnd black and white, or at least coherence in defining the color code, are still important aspects of graphic design, right?\n\n"
    },
    {
      "time": " 25.Apr.2007 5.36am",
      "content": "Absolutely.\n\nChrisL\n\n"
    },
    {
      "time": " 25.Apr.2007 5.48am",
      "content": "\\>looks like an unfinished icon project to me.\n\nAs I said in the first thread discussing these, I have the same feeling. The design has many virtues, but there is a plainness or bareness about it that is unnerving, like a room without furniture. Is it the elaborate gradient and no frame? I don’t know what exactly is ’wrong’, but something is.\n\n"
    },
    {
      "time": " 25.Apr.2007 6.04am",
      "content": "It does not look a bit wrong to me. The clean starkness makes all the Adobe icons stand out from the crowd of over-sizzled icons prolifferating the rest of my Dock now.  \nRight on, Adobe, I can see clearly now!\n\nChrisL\n\n"
    },
    {
      "time": " 25.Apr.2007 6.11am",
      "content": "Well, if you don’t like the icons, you can always [download another set, made by Adam Betts](http://web.archive.org/web/20080121184052/http:/www.artofadambetts.com/weblog/?p=190), based on the CS3 packaging (for OSX).\n\n"
    },
    {
      "time": " 25.Apr.2007 7.21am",
      "content": "\\>clean\n\nThe colored squares aren’t clean, as they have gradients slapped on them. The Susan Kare icons look complete in themselves. But to me—and Vince and others—these don’t.\n\n"
    },
    {
      "time": " 25.Apr.2007 7.31am",
      "content": "“But to me—and Vince and others—these don’t.”\n\nThen you can get the 3rd party Skins to either clean out those pesky gradients for a truly antiseptic look, or add all the bells and whistles from soup to nuts—even butterflies and flowers. :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Apr.2007 7.33am",
      "content": "I got your back, Chris. These icons are totally awesome. I vote for clean, clear, understandable, and recognizable.\n\n"
    },
    {
      "time": " 25.Apr.2007 8.08am",
      "content": "\\>I vote for clean, clear, understandable, and recognizable.\n\nDan, I said the design has a lot of virtues, and these are included. But ’totally awesome’? No doubt there is a lot of subjectivity in this, but it seems a lot of us don’t feel it gets to the ’awesome’ level.\n\nAnd among those, some are already supplying new 3rd party icons. Did this happen before with the earlier icons?\n\n"
    },
    {
      "time": " 25.Apr.2007 8.21am",
      "content": "Functional now for what used to be useless last year, is truly awesome to me. It is like last year I was blind and now, after a cornea transplant, I can SEE again but the colors are less saturated. “I see,” said the blind man, as he picked up his hammer and saw.\n\nIcons, above all, need to function. It is not unlike glyph readability. There is a place for decorative display faces, even grunge or graffiti faces, but in a situation where being able to read is key, a plain text font fits the Bill better.\n\nChrisL\n\n"
    },
    {
      "time": " 25.Apr.2007 8.25am",
      "content": "Are these localized? Interesting to see the Greek and Russian versions.\n\n"
    },
    {
      "time": " 25.Apr.2007 8.28am",
      "content": "And the Chinese version?\n\nChrisL\n\n"
    },
    {
      "time": " 25.Apr.2007 9.32am",
      "content": "”...I don’t know who was smart enough to make the decision to go that way, but buy them a beer for me!”\n\nYou can thank MetaDesign, San Francisco for the icon strategy.\n\n"
    },
    {
      "time": " 25.Apr.2007 10.26am",
      "content": "“The colored squares aren’t clean, as they have gradients slapped on them.”\n\nI’d say: lose the gradients! That would be closer to real simplicity. I’m basically with Elena.\n\nOlli\n\n"
    },
    {
      "time": " 25.Apr.2007 11.05am",
      "content": "Why is InDesign Caps&SmallCaps when the other two U&lc? Am I missing something??\n\n"
    },
    {
      "time": " 25.Apr.2007 11.17am",
      "content": "U/lc signify two words  \nU/sc signify one word\n\n"
    },
    {
      "time": " 25.Apr.2007 11.23am",
      "content": "I assume the A in Ai is for Adobe. Why isn’t there an A with InDesign or Photoshop? (okay, now I’m just being a jerk)\n\n"
    },
    {
      "time": " 25.Apr.2007 11.28am",
      "content": "Good question. They could’ve used IL ...\n\n"
    },
    {
      "time": " 25.Apr.2007 11.32am",
      "content": "Perhaps they went with SC when the word was in the form of a single hump camel?\n\n"
    },
    {
      "time": " 25.Apr.2007 11.34am",
      "content": "Illustrator has been known as Ai for years including the file extension on the Mac platform. I don’t know how many times I have said or heard the words, “Send me the Ai files”\n\n“IL” would be a totally new thing and require more relearning. I think they did it right.\n\nChrisL\n\n"
    },
    {
      "time": " 25.Apr.2007 11.37am",
      "content": "Plus Ps and IN are also their respective file extensions minus the D for document.\n\n"
    },
    {
      "time": " 25.Apr.2007 12.05pm",
      "content": "_Perhaps they went with SC when the word was in the form of a single hump camel?_\n\nhahahahahahahahaha LOL\n\nThe point I’m trying to make in a roundabout way is that I agree that Adobe’s icon project feels unfinished and could have been better though out. I like Adobe very much, have used their products for about a billion years, and don’t mean to disparage them. But they recognized an opportunity for consistency and made only a half-hearted stab at it, IMHO. Though I agree with everything in Chris’ original post, and I applaud this new approach, I feel it could have been taken further.\n\nThe “extensions” argument doesn’t work with me. My Illustrator files (and I don’t call them Ai files) are usually .eps extensions, and my Photoshop files are usually .tif extensions. My .ind extensions are lowercase, not small caps.\n\n"
    },
    {
      "time": " 25.Apr.2007 12.20pm",
      "content": "Without googling, boy I’m lazy, does anyone have a link to something from the horse’s mouth, MetaDesign, in regards to this?\n\n"
    },
    {
      "time": " 25.Apr.2007 12.35pm",
      "content": "<cite>The “extensions” argument doesn’t work with me. My Illustrator files (and I don’t call them Ai files) are usually .eps extensions, and my Photoshop files are usually .tif extensions. My .ind extensions are lowercase, not small caps.</cite>\n\nNative File extensions Ken, and you’re just being a jerk now.\n\n"
    },
    {
      "time": " 25.Apr.2007 12.41pm",
      "content": "Okay, that wasn’t very nice of me to say. I don’t have a “real” explanation of why they did them the way they did. Unless someone really cares enough to contact MetaDesign and ask, we’ll probably never know.\n\n"
    },
    {
      "time": " 25.Apr.2007 1.30pm",
      "content": "MetaDesign’s strategy for the system was born of the idea of mnemonics. Due to the acquisition of Macromedia by Adobe their product portfolio went from roughly seven products to around sixteen. A system similar to the periodic table was proposed. The characters chosen to represent the product are for memorability purposes; sometimes this leverages the already familiar.\n\nI should note, Meta proposed this strategy along with an entire brand evolution (having been the agency responsible for the design of CS1 and CS2 packaging and icons), they were not responsible for the execution of anything CS3.\n\n"
    },
    {
      "time": " 25.Apr.2007 2.36pm",
      "content": "Maybe I haven’t stated emphaticly enough that I like this new icon system. I like the gradation. I like the colors. I like the typeface. And, as with Chris, I remember Miquel posting a diagram of the entire family (but can’t seem to find it now) which was very yummy.\n\nThe periodic table, which this icon system uses for inspiration, doesn’t use Small Caps. I don’t know how many camelbacked words Adobe uses for its sixteen products, or why they felt a need to use Small Caps to indicate camelback words. I’m only saying that in a row of three icons (Ai, IN, Ps) the Small Cap N looks out of place.\n\nMaybe Miquel can offer some insight.??\n\nCheers, Ken\n\n"
    },
    {
      "time": " 25.Apr.2007 2.49pm",
      "content": "\\>Small Cap N looks out of place\n\nOf course this is so perfectly executed in logic and design that there is no possibility of confusion. Except that it’s a small cap D :)\n\n"
    },
    {
      "time": " 25.Apr.2007 2.57pm",
      "content": "Thanks William for catching my mistake.\n\nAnd apologies to Miguel for misspelling his name.\n\n"
    },
    {
      "time": " 25.Apr.2007 3.01pm",
      "content": "Actually, from the chart, there’s quite a few that used smallcaps. And I think Tiffany was right, the small caps are used when the program is devised from 2 words like FireWorks or InDesign and lowercase is used if it’s a single word like Photoshop or Audition.\n\n ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/3adobeapps_4033.jpg)\n  \n [click for larger image](http://web.archive.org/web/20080121184052/http:/blogs.adobe.com/jnack/images/wheel-o'-icons.html)\n"
    },
    {
      "time": " 25.Apr.2007 3.16pm",
      "content": "Well then Ai makes no sense. But I don’t care as long as I know what program I’m reaching for. I’m not going to have more than 3 or 4 of these on my dock anyway.\n\nI’m all for clarity. Tired of opening InDesign when I want Photoshop. Not to mention the grey stretch on my dock which contains the calculator, Disk Utility, Stuffit, Preferences. Gotta break that up somehow...\n\nI also keep my dock icons very very small, so these will read perfectly.\n\n"
    },
    {
      "time": " 25.Apr.2007 6.40pm",
      "content": " ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/plp_5461.jpg)\n\nI like the Adam Betts redesigned icon set (shown here in my dock). It keeps the the periodic theme and colors but adds a little more excitement to what is IMHO too plain an icon set. Also, the original icons add too much weight to the dock especially with the square edges. They were way too conspicuous and out of place in my dock. I think Adobe should have at least rounded the edges of the icons with a small radius.\n\n"
    },
    {
      "time": " 26.Apr.2007 12.49am",
      "content": "\\>No doubt there is a lot of subjectivity in this,  \n\\>but it seems a lot of us don’t feel it gets to the ‘awesome’ level.\n\nYou bet, William. This is subjective. But I can objectively say that I find these icons to be quite awesome. My undestanding of awesome-ness is not a democracy. I do not care if some people don’t feel that these get to that level. I deem them awesome.\n\n"
    },
    {
      "time": " 26.Apr.2007 6.01am",
      "content": "\\>I do not care if some people don’t feel that these get to that level.\n\nI think it is reasonable to expect a diversity of opinion on every issue, especially where art and design are concerned. I see such differences as opportunity to learn from others, which is one reason I enjoy Typophile so much.\n\n"
    },
    {
      "time": " 26.Apr.2007 1.22pm",
      "content": "Adobe CS2 applications crash at least once everyday on an mactel machine I’m working on. Who knows how long will it be before we get CS3 for stability.\n\nHéctor\n\n"
    },
    {
      "time": " 26.Apr.2007 3.26pm",
      "content": "Héctor,\n\nI have only used CS3 this week but so far, no crashes!\n\nChrisL\n\n"
    },
    {
      "time": " 27.Apr.2007 10.18am",
      "content": "After a careful study of the comments in this thread I have made a set of icons that should, without a doubt, please everybody and put an end to this ridiculous debate ;^P\n\n ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/AdobeAppIcons01_6534.jpg)\n\n"
    },
    {
      "time": " 27.Apr.2007 11.07am",
      "content": "“If ya can’t please everone, then ya’ oughta’ please yourself.”  \nRick Nelson, Garden Party\n\nChrisL\n\n"
    },
    {
      "time": " 27.Apr.2007 11.31am",
      "content": "Nice job, Jon!\n\nFuller version, from the official web site:\n\n“But it’s all right now, I learned my lesson well.  \nYou see, ya can’t please everyone, so ya got to please yourself.”\n\n"
    },
    {
      "time": " 27.Apr.2007 12.05pm",
      "content": "I knew my memory wasn’t good enough and I knew Bill would find the link :-)\n\nChrisL\n\n"
    },
    {
      "time": " 27.Apr.2007 4.30pm",
      "content": "Jon, they’re great! Although, I think the Ps icon looks more like a slide than a photo. :)\n\n"
    },
    {
      "time": " 27.Apr.2007 11.35pm",
      "content": "Those who really like two-letter abbreviations might be better served by LaunchBar or Quicksilver. If you seek the certainty of language, why mess about with abbreviations squeezed onto little squares?\n\nWant to open Photoshop?  \nTrigger Launchbar, then type “PS” - and weigh, hay, up she rises.  \nOr type “Photoshop.”  \nOr key in “Adobe Phot.”\n\nIn the early days of the Mac, icon designers adhered to the notion that icons ought to be, you know, _iconic_ - that their form should reflect the thing that they signified. Not so, these new linguistic squares.\n\n"
    },
    {
      "time": " 28.Apr.2007 9.51am",
      "content": "Thanks William and Stephen.\n\nI began making them just as a joke for this thread and an excuse to push some pixels. God, how I love pixels, and miss DPaint3 on my old Amiga 1200 :(\n\nStephen, you’re right, the Ps icon was intended to be a photographic slide which I now think was a crap choice. Here’s an updated set...\n\n ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/AdobeAppIcons01b_4449.jpg)\n\nIf anyone feels like turning them into a working icon set then that would be groovy. Just let me know first. And send me a copy :)\n\nI will make them available under a ’Send Me A Plane Ticket To Australia License Agreement’ ;)\n\n"
    },
    {
      "time": " 28.Apr.2007 12.58pm",
      "content": "Shouldn’t the Flash icon look more like a guy in a raincoat? ;)\n\n"
    },
    {
      "time": " 28.Apr.2007 2.13pm",
      "content": "I can’t stop fiddling with these bloody icons. Last version. Promise.\n\n ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/AdobeProgIcons01c_4768.jpg)\n\nBut following Archaica’s suggestion here’s a Flasher icon for web creatives of dubious moral fibre...\n\n ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/AdobeFlasherIcon_5761.jpg)\n\n"
    },
    {
      "time": " 28.Apr.2007 2.23pm",
      "content": "“here’s a Flasher icon for web creatives of dubious moral fibre…”\n\nThat is revealing but, after all, it is a show-and-tell profession :-)\n\nChrisL\n\n"
    },
    {
      "time": " 28.Apr.2007 3.12pm",
      "content": "_That is revealing but, after all, it is a show-and-tell profession :-)_\n\nChris, that was a rather trenchcoat— I mean, trenchant comment.\n\ns’marks\n\n"
    },
    {
      "time": " 28.Apr.2007 4.55pm",
      "content": "Well, it might be that I typed in on a Macintosh :-)\n\nChrisL\n\n"
    },
    {
      "time": " 30.Apr.2007 7.42am",
      "content": " ![](http://web.archive.org/web/20080121184052im_/http:/www.typophile.com/files/AdobeCS3Icons01d_5432.jpg)\n\nI lied about the last version being the last. But it’s because I have a pixel addiction.\n\n"
    }
  ]
}
