{
  "id": "33244",
  "title": "jobs @ type foundries",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nSince some of you are professional type designers and type founders, I was wondering how one  \ncould enter this craft seriously, and which are the functions one could have in a type foundry developing or designing fonts.  \nAre there many varieties of jobs within a type design in a big foundry? How is the working structure of a big type foundry like, for instance, LinoType?  \nAnd the boldest question: Does anyone one about jobs in type foundries for those of us who want to work in type design and actually make a living of it?\n\nThanks in advance.\n\n",
  "author": "rui abreu",
  "time": "23 Apr 2007 — 9:29am",
  "uid": "12433",
  "comments": [
    {
      "time": "23 Apr 2007 — 9:42am",
      "content": "This is not a rich field, so there are very few \"jobs\" in the conventional sense of the word. This is why so many type designers are their own foundries! But whether you're trying to succeed solo or by being an employee, first you need to have at least a couple of really promising designs out there, either to sell or to impress.\n\nSo make something, maybe post it here for a critique, and see where you get.  \nJust know that it's both creatively and technically a high challenge.\n\nhhp\n\n"
    },
    {
      "time": "23 Apr 2007 — 10:21am",
      "content": "<cite>how one could enter this craft seriously</cite>  \nRight now, FontShop International (Berlin) \\< href=\"http://www.fontblog.de/praktikumsstelle-bei-fsi-fontshop-international\"\\>is looking for an intern.\n\n"
    },
    {
      "time": "23 Apr 2007 — 10:45am",
      "content": "\\> _I was wondering how one could enter this craft seriously_\n\nWith a LOT of work! A higher degree will help as well; just look at Reading's track record:  \n [http://wiki.typefacedesign.org/matd/show/graduate+destinations](http://web.archive.org/web/20150214062908/http:/wiki.typefacedesign.org/matd/show/graduate+destinations)\n\nBTW, not long ago H&FJ was looking for a font developer:  \n [http://blogs.adobe.com/typblography/2007/03/hfj\\_font\\_produc.html](http://web.archive.org/web/20150214062908/http:/blogs.adobe.com/typblography/2007/03/hfj_font_produc.html \"http://blogs.adobe.com/typblography/2007/03/hfj\\_font\\_produc.html\")\n\n\\> _and which are the functions one could have in a type foundry developing or designing fonts_\n\nBoth. You're expected to be good in both designing a typeface and developing it into a full set of commercial fonts. That's the minimum at Adobe.\n\n"
    },
    {
      "time": "23 Apr 2007 — 10:55am",
      "content": "On the other hand some font houses have what are affectionately called \"bezier monkeys\" :-) who don't/can't come up with strong original designs but are highly valued for their \"finishing\" skills, which some \"official\" type designers actually lack enough of. Eric Gill for example never did any of his spacing - that was left to the \"boys\" at Monotype. Now, this sort of thing isn't glamorous, but if you happen to enjoy it, and the money it brings, then hey. Also, it can lead to becoming an \"official\" type designer, like it did with Ole Schäfer at FontFont. A number of people [formerly] at FontBureau also seem to have started off that way.\n\n\\> not long ago H&FJ was looking for a font developer:\n\nHow strange that they didn't announce it on Typophile.\n\nhhp\n\n"
    },
    {
      "time": "23 Apr 2007 — 11:03am",
      "content": "What sort of work would you like to do?\n\nHrant - I believe H&FJ _did_ announce the job here.\n\n"
    },
    {
      "time": "23 Apr 2007 — 11:06am",
      "content": "Sorry, I must have missed it (no surprise these days). Link?\n\nhhp\n\n"
    },
    {
      "time": "23 Apr 2007 — 11:13am",
      "content": "Have things really changed that much from pre-digital days?  \nIf you want a type-specific education, there is not much choice, and the same holds true if you want a job.  \nThe big difference is that it is now feasible to start your own foundry.\n\nThe good news is that some small foundries, although they may not have job openings, will take on interns. I presently have one -- it's a requirement of his design degree course that he works six weeks as an intern in a design firm.\n\n"
    },
    {
      "time": "23 Apr 2007 — 11:49am",
      "content": "Nick how does the intern work for you? Specifically, what tasks do you delegate, has that worked well, is it something of a break even, does the intern seem satisfied?\n\n"
    },
    {
      "time": "23 Apr 2007 — 12:40pm",
      "content": "I do think that full-time, \"professional\" employment is probably hard to come by. You might have better luck setting your sights on freelance or contract employment. When I was getting into type (in the early '90s), there were a lot of small freelance jobs around. If you can make some friends and find those jobs, it's not a bad way to go.\n\nThese days Reading seems to be the most straightforward path, but if you have the time and energy, you can work your way up. Get the software and make your own typeface; that will get you some skills to use the tools efficiently. Then you might find a job to design something customized or ephemeral. Or perhaps someone needs help with kerning. Most of all, you need to develop a tolerance for horrifyingly long, monotonous projects -- which is a big part of real type work. If you cannot deal with that, I think your success will be limited.\n\nTry to work with and understand all the technical aspects of font production (OpenType layout and tables, hinting, Python scripting, etc.). It's important to carefully read a lot of type books, and, of course, look at a lot of type.\n\nIf you can get some small projects under your belt, you might find one day that you are qualified to help a \"real\" foundry with some contract assistance, which will give you more experience with how a font company needs to have their font data prepared. (It's often a level higher in precision and quality.)\n\nIn the end, like others here have said, foundries (like most employers) want a person with an ability to perform skillfully, intelligently and reliably. Such qualities usually come with experience and simply logging a lot of hours doing the same thing over and over again. All of this takes time, patience and commitment -- but there are lots of ways to get there.\n\nOne more thing worth mentioning: Once you have the skills, you will need to convince people of that without the benefit of a university's stamp of approval. The value of networking and schmoozing should not be underestimated.\n\nI agree that having original design vision is optional. It's a goal that drives many people into the field, but like lots of other creative fields (e.g. music, theater) there are always lots of opportunities for skilled craftspeople who are not destined for stardom.\n\n"
    },
    {
      "time": "23 Apr 2007 — 1:17pm",
      "content": "Hi Rui,\n\nWe're sorting out some staffing needs right now, so if you're interested you might want to send a resume to Carleen Borsella at [jobs2007@typography.com](mailto:jobs2007@typography.com). Thanks!\n\nJonathan Hoefler  \nH&FJ\n\n"
    },
    {
      "time": "23 Apr 2007 — 1:39pm",
      "content": "_Nick how does the intern work for you?_\n\nGreat. He knows a bit of Russian, so I've had him doing a Cyrillic version of Handsome.  \nHe also knows Flash, and has been contributing to my site redesign.  \nHe's having a good time.\n\n"
    },
    {
      "time": "23 Apr 2007 — 4:01pm",
      "content": "Thank you all, you have been a great help.\n\nThanks for the tip Jonathan Hoefler, I think I'll do that.\n\n"
    }
  ]
}
