{
  "id": "33259",
  "title": "concept-opinions required, Thanks.",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I am currently doing a book for final year students that is useful to potential employers if they are willing to take on new designers for work placements or may it be for a job. It is a book that has been produced every yr and now this yr, it is it’s tenth anniversary. So i was wondering if you think this solution is ok or not?\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 79.png](http://web.archive.org/web/20080706084354/http:/typophile.com/files/Picture%2079.png) | 10.11 KB |\n| [Picture 80.png](http://web.archive.org/web/20080706084354/http:/typophile.com/files/Picture%2080.png) | 6.66 KB |\n| [Picture 81.png](http://web.archive.org/web/20080706084354/http:/typophile.com/files/Picture%2081.png) | 14.79 KB |\n| [Picture 82.png](http://web.archive.org/web/20080706084354/http:/typophile.com/files/Picture%2082.png) | 5.38 KB |\n\n [‹ Handwritten font](http://web.archive.org/web/20080706084354/http:/www.typophile.com/node/34472 \"Go to previous forum topic\") [Your Feedback is Needed ›](http://web.archive.org/web/20080706084354/http:/www.typophile.com/node/32999 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706084354/http://www.typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 23.Apr.2007 9.28pm",
      "content": "One thing I will say is that the ’10’ bits look a little off to me. Since in oldstyle figures 1 and 0 are both the same height, that they should be so different from each other suggests that they’re not part of the same number. It looks like 1º to me.\n\n"
    },
    {
      "time": " 23.Apr.2007 9.56pm",
      "content": "IMHO: Anything remotely similar to Bank Gothic looks like a huge cliche (to me anyway)...\n\n"
    },
    {
      "time": " 24.Apr.2007 6.10am",
      "content": "You need to spell MAXIMISE correctly!\n\n"
    },
    {
      "time": " 24.Apr.2007 12.31pm",
      "content": "Ooops i didn’t realise. Sorry. Is that why Nathan above is laughing or does he find my design funny? I was really upset when he wrote ’IMHO’. Isn’t it suppose to be LMHO? I feel really bad about my design now so please Nathan, if you had to laugh, atleast you could have told me why :( Don’t just laugh and not tell me.  \nZ.D.Smith, the 10 is meant to look like a face and it’s also meant to look like 1 degree becausethe book is for the end of yr degree show and also because of the 10th anniversary of the higher education at the college. Is it still funny now? I feel crap about my work now. please encourage, not discourage. You have put my cinfidence really down, like beyond ground level :(\n\n"
    },
    {
      "time": " 24.Apr.2007 12.40pm",
      "content": "’IMHO’ means ’In My Humble Opinion’ as opposed to ’IMNSHO’ which is ’In My Not So Humble Opinion’. So take heart nobody is calling you names. What is LMHO? I have never seen that. Nathan is ’laughing’ because that’s just his Avatar or Icon. It’s not directed at you. It looks like that all the time.\n\nI think the 1 degree & 10 think isn’t quite gelling yet. Keep going.\n\n"
    },
    {
      "time": " 24.Apr.2007 12.47pm",
      "content": "you ask for opinions then sulk when you think someone is laughing! as the wise Chopper Reid says, Youll really have to harden the \\*\\*\\*\\* up if you want to survive as a designer in the real world!! I would not put work up here just to get a confidence boost, the wrong place.\n\nthe idea is sound, but yer excecution has to be much sharper to catch employers attention. IMHO\n\nMuzz\n\n"
    },
    {
      "time": " 24.Apr.2007 1.22pm",
      "content": "Yep for once I’m agreeing with Muzzer ;-P\n\n"
    },
    {
      "time": " 24.Apr.2007 2.11pm",
      "content": "It would be worse if the concept wasn’t interesting. Don’t give up. Throw all your ideas onto the sketch pad and work ’em until they talk to you.\n\n[Edited to read correctly!]\n\n"
    },
    {
      "time": " 24.Apr.2007 5.15pm",
      "content": "Muzzer: I am not sulking. I like a good crit on my work, no matter how harsh. It’s the misunderstanding of IMHO as opposed to LMAO as in Laughing My Arse Off. Sorry, I did not know it meant In My Humble Opinion. I actually thought that it wa smade a joke out of, that’s all and that made me upset. I’m not sulking and I am not a sulky person. Peace.  \nEben: Thank you for making it clear to me that I am not being laughed at. LMAO means (see above).\n\n"
    },
    {
      "time": " 24.Apr.2007 11.51pm",
      "content": "Okay Cool. Thanks for answering my question.\n\nOh yeah, and take TIff’s good advice.\n\n"
    },
    {
      "time": " 25.Apr.2007 3.48pm",
      "content": "OK, so here goes. On top of that, I have come up with 10 commandments kind of idea but for students i.e. I am going to be using words that have the word TEN within it so ’atTENtion’, ’inTENtion’ etc so it will tie in with my theme of ’maximise your poTENtial’. What do you think? And could i pull it off by saying that the 10 could be understood as 1 degree as in this is your one and only degree’ or ’this is it!, your 1st degree’ or could you think of anything else I could say about the 1 degree which is also meant to be a number 10 and a face too or am i confusing my audience?\n\n"
    }
  ]
}
