{
  "id": "33271",
  "title": "Quotation about Typography",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi, I am looking for some quotes about typography, especially about form and counterform.  \nIf anyone can help me to find some quotes about typography stractures, that will be really nice.  \nI was looking for some but they did not talk about negative spaces.\n\nAnd also does anyone know whos quote this is?\n\n“Space is an equal and integral partner in both typeface design and page layout of typography. The two forces of positive and negative require each-other to exist”\n\nCheers\n\n [‹ Futura Question Mark?](http://web.archive.org/web/20080907015106/http:/www.typophile.com/node/33299 \"Go to previous forum topic\") [It is your fault, shopkeepers. It is your ugly font-abusing fault. ›](http://web.archive.org/web/20080907015106/http:/www.typophile.com/node/33254 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907015106/http://www.typophile.com/user/18215\" title=\"View user profile.\">vari</a>",
  "time": "<br>",
  "uid": "18215",
  "comments": [
    {
      "time": " 24.Apr.2007 5.15am",
      "content": "im sorry about my bad English.  \nEnglish is not my first language :(\n\n"
    },
    {
      "time": " 24.Apr.2007 5.28am",
      "content": "That sounds like something I said here on Typophile but that would not be a helpful quote since I am mere mortal.\n\nCheck this link:\n\n[http://typophile.com/node/32534](http://web.archive.org/web/20080907015106/http:/typophile.com/node/32534 \"http://typophile.com/node/32534\")\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 5.33am",
      "content": "Vari,  \nWhere did you find the quote?\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 5.34am",
      "content": "Vari,  \nDo you know Kris Sowersby there in New Zealand? He is quite a good type designer.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 5.58am",
      "content": "You can also check Evert Bloemsma and his FF Legato. Is about form and counter form. see also: [http://typophile.com/wiki/ff\\_legato](http://web.archive.org/web/20080907015106/http:/typophile.com/wiki/ff_legato \"http://typophile.com/wiki/ff\\_legato\")\n\n"
    },
    {
      "time": " 24.Apr.2007 6.08am",
      "content": "Emil Ruder’s Typographie book should have some quotes regarding negative space in typographic layout. It is in German, English, and French, if that is helpful.\n\n[http://www.amazon.com/Typography-Emil-Ruder/dp/3721200438](http://web.archive.org/web/20080907015106/http:/www.amazon.com/Typography-Emil-Ruder/dp/3721200438 \"http://www.amazon.com/Typography-Emil-Ruder/dp/3721200438\")\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 6.22am",
      "content": "I don’t know the source of your quotes, but the best bets are either  \n [Adrian Frutiger](http://web.archive.org/web/20080907015106/http:/www.linotype.com/793-12657/black-and-white.html) or [Gerrit Noordzij](http://web.archive.org/web/20080907015106/http:/www.letterror.com/noordzij/index.html). If you look into their works you will find interesting discussions of the the balance of black and white, form and counterform. The discussions go back to end of the 19th century, with the introduction of East Asian ideas about the balance of dark and light, known as ‘nóng dàn’ in Chinese or [notan](http://web.archive.org/web/20080907015106/http:/www.typophile.com/wiki/notan) in Japanese.\n\n"
    },
    {
      "time": " 24.Apr.2007 6.44am",
      "content": "If you can find a copy, I think either edition of Hermann Zapf’s _Manuale Typographicum_ would be an ideal source for you.\n\nMy edition (1968, MIT Press) has 100 pages. Each page contains one or more important thoughts about typography, type design, printing, books, culture, language. Some pages have three or four quotes. There are quotes comparing the form of typography to that of architecture, or music, in addition to the expected things such as, “With 26 soldiers of lead I shall conquer the world.”\n\nWhat is most impressive is that Zapf has printed the quotations in the original language of the author (!) and provides a translation into English in the back of the book. I assume the other edition (late 1950s?) is the same general idea, although I have not seen it in person.\n\nI do not know if either of these was ever reprinted in a subsequent (offset, thus cheaper) edition. The original editions were very carefully made in multiple colors, printed letterpress, so they are rare at this point and you would be likely to find them only in the special-collections section of a university library, or in a private collection.\n\n"
    },
    {
      "time": " 24.Apr.2007 7.10am",
      "content": "You might also read Weingarts Typography book:\n\n[http://www.amazon.com/Wolfgang-Weingart-My-Way-Typography/dp/390704486X](http://web.archive.org/web/20080907015106/http:/www.amazon.com/Wolfgang-Weingart-My-Way-Typography/dp/390704486X \"http://www.amazon.com/Wolfgang-Weingart-My-Way-Typography/dp/390704486X\")\n\nand “The New Typography” by Tchichold.\n\n[http://books.google.com/books?id=48YYG5M4e7MC&dq=the+new+typography+tsch...](http://web.archive.org/web/20080907015106/http:/books.google.com/books?id=48YYG5M4e7MC&dq=the+new+typography+tschichold&printsec=frontcover&source=web&ots=aAbAYykFzR&sig=YdfjXHNXi2l3upDEfydhj-urWag \"http://books.google.com/books?id=48YYG5M4e7MC&dq=the+new+typography+tschichold&printsec=frontcover&source=web&ots=aAbAYykFzR&sig=YdfjXHNXi2l3upDEfydhj-urWag\")\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 7.18am",
      "content": "Ah, Chris is being too modest. Following his link, I see your quote is from him. No ’mere’ mortal, I’ve heard that Chris can leap tall buildings like a frog :)\n\n"
    },
    {
      "time": " 24.Apr.2007 7.41am",
      "content": "I find your comment ribbitting, William :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2007 1.29pm",
      "content": "Thank you all.  \nHi, ChrisL, my friend found this quote, but she doesnt know where shes got if from..(she just written down)  \nbut when I looked at [http://typophile.com/node/32534](http://web.archive.org/web/20080907015106/http:/typophile.com/node/32534 \"http://typophile.com/node/32534\")  \nyou said exactly same thing, I was wondering maybe shes got from you??  \nhahaha.  \nIm going to Uni, and check all books\n\nVari\n\n"
    },
    {
      "time": " 26.Apr.2007 6.40am",
      "content": "Hi Ria, my bet is Bauhaus,Moholy-Nagy, Feininger, Gropius himself even. But it could also be Rudolf Arnheim.\n\n"
    },
    {
      "time": " 26.Apr.2007 6.55am",
      "content": "“Hi, ChrisL, my friend found this quote, but she doesnt know where shes got if from..”\n\nShe or someone she knows probably got it here on Typophile. Although it is flattering to see my words associated with famous designers in history, I know that is not the case. I am just an ordinary designer. If it were not for the internet and this forum, nothing I said would ever have been seen or certainly not quoted. Google is a funny thing, it can find a segment of text without any caring for the status of the writer—true democratization :-)\n\nChrisL\n\n"
    },
    {
      "time": " 26.Apr.2007 7.03am",
      "content": "Ria, your effort has a lot of merit, but there’s a big problem: virtually all expressions of form-counterform (better called notan) in type design are nothing but lip-service. This is especially true of those who believe that chirography (loosely meaning calligraphy) should be a central force in type design; they tend to say nice things about notan, but in practice work to demote it. As my father is fond of saying: You can call you daughter George, but that won’t make her a boy.\n\nReally the only type designer who’s said anything worthwhile about notan is Bloemsma: study his work and thoughts - you will derive a singular benefit.\n\nhhp\n\n"
    },
    {
      "time": " 30.Apr.2007 1.12pm",
      "content": "Ria, I think I’ve encountered something you might appreciate.\n\nIn the Helvetica movie there’s a short segment where Mike Parker waxes poetic about the ability of the Swiss to make the black and white lock together. Not that I agree (especially not concerning Helvetica!) but he delivers it in such a compelling, even sensual way - it’s really impressive.\n\nYou might ask Gary Hustwit (a modest and accessible person if there ever was one) for a video clip of that segment - a text transcript would not do it justice.\n\nhhp\n\n"
    },
    {
      "time": " 30.Apr.2007 8.03pm",
      "content": "Chris-\n\nHenry Ford once said, “history is bunk.” Some people may read that to mean that it’s meaningless— I don’t. i prefer to think it refers to the vast oceans of experience that exist beyond what we normally consider as “historical.” Each person in the crowd — every unrecorded, unremembered utterance added, in it’s way, meaning and relevence to even the most important events. As Ken Nordine put it[i’m paraphrasing]: the face in the mob crying, “yes! yes!’ as ’history’ unfolded helped condition the truth.\n\nWhenever someone can give voice (eloquence? understanding?) to our achievements and fumblings, it’s important.\n\n"
    },
    {
      "time": " 1.May.2007 4.52am",
      "content": "Thanks Chuck.\n\nChrisL\n\n"
    }
  ]
}
