{
  "id": "3328",
  "title": "O P T I C A",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi typophiles, this is our fist proyect as a team, in Chile. We start to think in how the   \neye changes the perception of the forms in a typeface with far distance exposure, on highways.   \n   \nPlease help us with your feedback, thanks.   \n   \n   \n   \nOPTICA\n\n",
  "author": "Miguel Hernandez",
  "time": "26 Feb 2004 — 12:27pm",
  "uid": "1109",
  "comments": [
    {
      "time": "26 Feb 2004 — 12:48pm",
      "content": "What is your source of insights into what really happens in highway signage?   \nIs there a book, or have you been talking to James? :-)   \n   \nhhp\n\n"
    },
    {
      "time": "26 Feb 2004 — 10:00pm",
      "content": "We dont have a referece in a book, and we dont talk with James Montabano yet. We are building the letters on empiric tests at this first step, comparing the problems who occur in common used typefaces, here in chile we found Interstate on highways,and Frutiger on small signages and information in buses(local transportation). In the internet we look at Clearview now,and we want to start to compare some of our proposals with the Clearview typeface.   \n   \n1.- Clearview, 2.-Optica   \n   \n   \n ![](http://web.archive.org/web/20131012111529im_/http:/www.typophile.com/forums/messages/29/27369.gif)   \n   \nHern\n\n"
    },
    {
      "time": "27 Feb 2004 — 7:02am",
      "content": "Hola penquistas!!!   \n   \ni like optica, i know where are you going now, but some observations..   \n   \nfirst...\n\n"
    },
    {
      "time": "27 Feb 2004 — 7:19am",
      "content": "Note that the counters of the e and a on Clearview stay open better in the most blurred, bottom samples.   \n   \nI like the wavy stems on the full height letters. They have a friendliness, while being quite readable. I think on the mnu it might be a little much though, giving a shaky look.\n\n"
    },
    {
      "time": "6 Mar 2004 — 3:46pm",
      "content": "It would be neat if you had a plugin for FL that auto-blurred the glyphs - instant preview 'blur mode'. Then you could see almost immediately what the forms would look like while you're manipulating the curves.   \n   \nThis is a nice face. I think it has some huge potential.   \n   \nkris\n\n"
    },
    {
      "time": "10 Mar 2004 — 5:19am",
      "content": "kris:   \n   \nNot sure how practical this would be, but in Fireworks, you can apply extreme anti-aliasing to a vector path to get the same live blurred effect.\n\n"
    },
    {
      "time": "31 Mar 2004 — 1:14pm",
      "content": "I personally think this looks great. Very clever ideas behind it. My only crit would be that the \"a\" looks a bit sloppy.\n\n"
    },
    {
      "time": "10 Aug 2004 — 1:44pm",
      "content": "Eventually I'll take a close look at Optica and give some feedback, but for the time being here's something I just rediscovered that might interest you - a glyph I drew about two years ago, intended for tiny sizes:   \n   \n ![mini_p](http://web.archive.org/web/20131012111529im_/http:/www.typophile.com/forums/messages/29/42573.gif)   \n   \nNote: every feature is on purpose.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Aug 2004 — 3:03am",
      "content": "Very interesting the use of irregularity on a sans serif typeface to increase its legibility. I like this idea.   \nDo you have some bibliographic reference about this topic?   \n   \nThe irregularity helps to transform letter in words. Letters work better together than isolated.   \nMaybe it is also a good idea for a sanserif typeface for text.   \n   \nAnother question: which will be the colour of the letter and of the panel?   \nI printed the pdf and looked the paper from far (I have sight handicap and I could be a good tester..). It works very well, but I fear that the eye of \"e\" and of \"a\" is a little bit small.   \nIn my opinion the capital \"E\" is too much condensed.\n\n"
    },
    {
      "time": "13 Aug 2004 — 1:39am",
      "content": "Hrant, are you the Doctor Who of Typophile? I notice you keep reincarnating as a younger version of yourself.   \n   \nRob\n\n"
    },
    {
      "time": "13 Aug 2004 — 9:19am",
      "content": "Hey, I've only had two pics here, and this new one was kind of a social commentary. Or something. Anyway, I'm highly unphotogenic (or just plain ugly) so a good photo comes around like every 12 years. Hey wait, that means I'm overdue!   \n   \nhhp\n\n"
    },
    {
      "time": "14 Aug 2004 — 7:14am",
      "content": "I just stumbled across this thread.   \n   \nYour comparisons and samples of halation look like they are computer generated. This is of no use whatsoever. The optics of halation are quite a complex phenomenon. The only way to truely get an idea of what is going on is to make signs on the appropriate retro-reflective material and document what happens through a carefully controlled experiment.   \n   \nDifferent retro-reflective materials from different manufacturers (ie Diamond Grade, Prismatic) will create different halation issues.   \n   \nAnother thing to keep in mind when dealing with these sorts of fonts is their acceptability to the general highway engineering community. One of the reasons Clearview looks the way it does was it was designed to solve problems of legibility and readability without scaring the very conservative highway engineers with a radical \"designed\" solution.\n\n"
    },
    {
      "time": "17 Aug 2004 — 8:44am",
      "content": "It seems to me most signage type in Italy follow quite raw and simplicistic rules.   \nI've had no actual problem in reading it, but this does not meen it can't be improved.   \n   \nDoes anyone of you (from Italy) know who designed most of the types we found in our cities (and highways). I'm sure there's more than two alphabets around, even considering the condensed ones.\n\n"
    },
    {
      "time": "17 Aug 2004 — 9:15am",
      "content": "I don't know who is the designer, sorry. I remember some year ago Manuela Rattin told me something about this topic, but I can't remember.   \n   \nAbout italian signs, it's almost impossible for me to drive in an unknown place, as I can't read the road signs at all...   \n: )   \nThe all caps condensed bold is a big problem for me. There is too few \\*white\\* (green, blue) inside and between the letters, I suppose.\n\n"
    },
    {
      "time": "26 Feb 2004 — 1:08pm",
      "content": "Nice work, Miguel. Let me see if I get your meaning on the vertical   \nstroke structure: the middle sections of the glyphs generally   \nsuffer from more halo-ing, so the solution was to make that   \nportion of the vertical stroke thinner?   \n   \nI predict a Montalbano swoop on this thread within a couple days.   \nThe sooner the better.\n\n"
    },
    {
      "time": "1 Apr 2004 — 8:54am",
      "content": "I've read very little about this sort of thing, but shouldn't there be some sort of motion blur test too?\n\n"
    }
  ]
}
