{
  "id": "33293",
  "title": "Job salaries",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am in the process of working my way into an Junior Art Director position. I am wondering what is a good salary range to ask? It is not a full-blown Art Director job so I can't ask too much, but if I don't ask enough they will not take me seriously. If I get the job it will be my first job in this position, so I am not super experienced. I am also in a good-sezed metropolitan area (Denver, Colorado). Is $35,000 too much for a rookie Junior Art Director?\n\n",
  "author": "thetophus",
  "time": "24 Apr 2007 — 9:54pm",
  "uid": "18133",
  "comments": [
    {
      "time": "25 Apr 2007 — 6:16am",
      "content": "[http://www.aiga.org/resources/content/1/0/7/3/documents/salary-survey-20...](http://web.archive.org/web/20130824175630/http:/www.aiga.org/resources/content/1/0/7/3/documents/salary-survey-2006.pdf \"http://www.aiga.org/resources/content/1/0/7/3/documents/salary-survey-2006.pdf\")\n\n"
    },
    {
      "time": "25 Apr 2007 — 7:04am",
      "content": "\"I am wondering what is a good salary range to ask?\"\n\nMore than you are making now. And more than you hope to get. (you can always negotiate down.)\n\n"
    },
    {
      "time": "25 Apr 2007 — 7:47am",
      "content": "It really depends on the company and the type of work you are doing. Off the bat, $35,000 sounds at least $10k too little. I'd say mid-$40k range and let them make you an offer from there.\n\nDo some research on the Bureau of Labor Statistics Web site, which is more reliable than salry surveys. You can find figures for Art Directors or Senior Designers working in the Denver Metropolitan area, and then break those figures down by industry (publishing, advertising, etc.)\n\nI believe the concept of a Junior Art Director or Associate Art Director is kind of a tough one in terms of figuring out salaries. Most places seem to stick with Junior Designer, Senior Designer, Art Director and Creative Director.\n\nTrust me, unless the amount you ask for is extremely high, employers will not be put off by your request. They expect them and they will always come down to a lower figure. So aim high.\n\n"
    },
    {
      "time": "25 Apr 2007 — 8:07am",
      "content": "Good advice from seventy7. $35K sounds a little low. Thats essentially what I do in Raleigh, NC for a higher salary + pretty good benefits, granted with a few years experience.\n\nGood luck.\n\n"
    },
    {
      "time": "25 Apr 2007 — 9:43am",
      "content": "I think the moderators of this forum should be very careful when it comes to these sorts of discussions. Taking about prices and salaries in a forum such as this could be construed as price fixing (at least under US law). I think Typophile is treading on very shaky ground allowing these sorts of discussions.\n\nJames\n\n"
    },
    {
      "time": "25 Apr 2007 — 12:10pm",
      "content": "\"Taking about prices and salaries in a forum such as this could be construed as price fixing\"\n\nUnless you can somehow show that a majority of junior art directors read this thread and are conspiring to ask for the same raises, I kind of doubt it. ;o)\n\n"
    },
    {
      "time": "25 Apr 2007 — 12:10pm",
      "content": "Thanks, James. Perhaps this is a good place to reiterate that the views expressed herein are the views of their individual authors and not Typophile, its moderators or owners.\n\nThat said, getting career insight and guidance from designer peers is one of the reasons a community like Typophile can thrive.\n\nThetophus, your question is a common one. I do think that your best bet in these matters is to go with a reputable source; the AIGA has been posting their Salary Survey for years and would provide the best guidance. Their document may also provide insight into your local area to know what are competitive rates.\n\n"
    },
    {
      "time": "25 Apr 2007 — 12:41pm",
      "content": "Thanks for all the responses. I'll definitely research this some more.\n\n"
    },
    {
      "time": "25 Apr 2007 — 1:37pm",
      "content": "James, and that is I believe why posts are no  \nlonger emailed; they can just remove dangerous  \nstuff as needed. :-/ Virtual shredding.\n\nhhp\n\n"
    }
  ]
}
