{
  "id": "33301",
  "title": "Helvetica vs. Univers",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm pro- [Helvetica](http://web.archive.org/web/20150413075532/http:/typophile.com/wiki/Helvetica) and have quite a bit of experience using it, and I haven't used [Univers](http://web.archive.org/web/20150413075532/http:/typophile.com/wiki/Univers) much. But lately I've seen things designed with Univers that look great. Does anyone have any thoughts on comparing the two? Univers seems to have slightly more personality /warmth/elegance, but maybe that's just because it seems \"newer\" to me (since I haven't used it much).\n\nThoughts?\n\nThanks.\n\n",
  "author": "BrooklynRob",
  "time": "25 Apr 2007 — 8:29am",
  "uid": "9177",
  "comments": [
    {
      "time": "25 Apr 2007 — 9:26am",
      "content": "Rob,  \nThey both came out at the same time in the mid 50s. There are those who are in one camp or another. I much prefer Univers because it is much more thought out as a family and just feels right to me.\n\nChrisL\n\n"
    },
    {
      "time": "25 Apr 2007 — 10:03am",
      "content": "Helvetica was drawn by an idealist. Univers was drawn by a type designer.\n\n"
    },
    {
      "time": "25 Apr 2007 — 10:12am",
      "content": "Univers is a further departure from the original 19th-century models. Helvetica is essentially a 19th-century grot cleaned up and sanitised for modern consumption. It's very monoline, the letters are very unified in shape and width. Univers takes the model and adjusts the widths, stroke contrast, curves and aperture to be more clean, soft, simple, and truly modern. If you compare Univers with AG or other older grotesques, it looks visibly newer. Unlike Helvetica, Univers has letters of more classic roman proportions; compare R, A, S, E, B and D between Helvetica and Univers to see this proportion modulation. Helvetica is nearly monospaced in its width consistency. Helvetica's apertures are more closed, most notably in c, a, S, C and e. Oddly, while Univers is as squarish as Helvetica, its higher stroke contrast relieves what in Helvetica is a blocky and heavy appearance. Univers is a more evolved design; Frutiger completely adapted it for 20th-century use. More important than all of these, Univers is spaced for text, which immediately makes it more suitable for small sizes.\n\n"
    },
    {
      "time": "25 Apr 2007 — 11:05am",
      "content": "Type represents the technology of its day.  \nArial is a revival of Helvetica, which in turn is a revival of Akzidenz Grotesk, a 19th century letterform.  \nHelvetica has the shape of steam engine boilers and cast iron machinery.  \nUnivers, on the other hand, has the \"supercurve\" (as Zapf termed it, and also used in Melior) of the CRT, the TV screen. This is more obvious, even, in Frutiger's original drawings. Novarese's Microgramma/Eurostile, is the most CRT-shaped face.  \nBut ultimately, all those types still have a lot of lead in them, in particular that means quite subtle spacing (despite complaints about Helvetica as a text face).  \nMore recent developments in type design take their sources from other media, less finely spaced than print. For instance highway signage (Interstate, DIN) typewriters (Officina), neon, and low res monitors. So now the vertical linearity of 'l' and 'i\" become problematic, hence emergence of \"some serifs\" (to use the Berlow term) in sans faces, because these features help to moderate letterspacing.\n\n"
    },
    {
      "time": "25 Apr 2007 — 11:38am",
      "content": "Nick, very interesting analysis. Gosh, I love reading thoughtful texts about type.\n\nAnd beautiful work with the Globe and Mail!\n\n~Roy Wilhelm  \na publication designer in Richmond, Va.\n\n"
    },
    {
      "time": "25 Apr 2007 — 11:45am",
      "content": "\\*adds to project list for summer: make Helvetica _v_ Univers text-figure animation fight à la stick-figure fighting videos\\*\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "25 Apr 2007 — 12:02pm",
      "content": "Both are better avoided (especially Helvetica, which is dated and gross).  \nBut if you must ask the Helvetica vs Univers question, the answer is Unica.\n\nhhp\n\n"
    },
    {
      "time": "25 Apr 2007 — 12:19pm",
      "content": "Nick, that really is a great answer. Very thoughtful, as Roy said.\n\n"
    },
    {
      "time": "25 Apr 2007 — 12:36pm",
      "content": "BTW: [http://typophile.com/node/33285](http://web.archive.org/web/20150413075532/http:/typophile.com/node/33285 \"http://typophile.com/node/33285\")\n\n:-\\>\n\nhhp\n\n"
    },
    {
      "time": "25 Apr 2007 — 2:42pm",
      "content": "The big difference is personality. Being a revival of Akzidenz-Grotesk with the life sucked out, Helvetica has almost none. Univers, on the other hand, has a cool technocratic feeling that borders on arrogance. I prefer to see Helvetica as a big display face, so that those big bones take on a warm feeling. I use Univers when I need to set a bunch of text and want it to look thoughtful and precise, and carry an air of authority.\n\n"
    },
    {
      "time": "25 Apr 2007 — 5:12pm",
      "content": "Gurtler + Haas Unica related links\n\n[http://typophile.com/node/4840](http://web.archive.org/web/20150413075532/http:/typophile.com/node/4840 \"http://typophile.com/node/4840\") -  \n [http://typophile.com/node/18387](http://web.archive.org/web/20150413075532/http:/typophile.com/node/18387 \"http://typophile.com/node/18387\") -  \n [http://typophile.com/node/12529](http://web.archive.org/web/20150413075532/http:/typophile.com/node/12529 \"http://typophile.com/node/12529\") -  \n [http://typophile.com/node/30859](http://web.archive.org/web/20150413075532/http:/typophile.com/node/30859 \"http://typophile.com/node/30859\")\n\nBTW I think Univers is always beguiling. Especially the numbers.\n\n"
    },
    {
      "time": "25 Apr 2007 — 7:34pm",
      "content": "Interesting analysis Nick.\n\nWhile different, just out of curiosity, how would you characterize Champion & Knockout?\n\n"
    },
    {
      "time": "26 Apr 2007 — 8:40am",
      "content": "Re-reading this thread I wanted thank Rob for bringing up a question I thought I basically knew the answers to - and to Carl & Nick for answers extended my knowlege. Now I am keen for more questions about stuff I falsely think I already have my head around. Cheers!\n\n"
    },
    {
      "time": "26 Apr 2007 — 9:52am",
      "content": "James, what are your feeling about the new Univers compared with the old?\n\nKnockout: strikes me as exemplifying hands-on engineering (which will make ad hoc adjustments to optimize the efficiency of each part) rather than the smoothly consistent systematic exigesis of design principles, and in that is characteristic of the 19th century.\n\nYou see that still in Helvetica, where the \"a\" has a foot serif in the light weights, but not in the bold.\n\nTwo references to support this view of the Victorian engineer: Brunel working himself to death on the details of his huge projects, because the appropriate infrastructure of a large engineering firm had yet to be developed; and Maudslay, inventor of the bench micrometer, the \"finest man with a file\" (sorry, can't find the exact quote), very much the craftsman.\n\n"
    },
    {
      "time": "28 Apr 2007 — 9:59am",
      "content": "Interesting thread, everyone.\n\nre: Brunel, I recommend a superb book called _The Great Iron Ship_ by James Dugan (New York: Harper & Brothers, 1953) that describes Brunel in loving detail as he worked on his masterpiece, the _Great Eastern_, which laid the transatlantic cable. Of course he did so much more than that, including railway right-of-way design, Temple Meads Station, bridges, and so forth. One cool cat.\n\nNick so rightly plants Helvetica's roots in the 19th century. Has anyone come across a comment that 19th-c. types wanted to express a kind of egalitariansim that was increasingly present in a society that was moving from industrial revolution into a time with much more social consciousness? It is so instructive to see a line of Helvetica set in A/C compared to something like Syntax or Penumbra, in which the allegedly desirable trait of all letters being \"equal\" actually reduces legibility and recognition of individual identity. I have the feeling that I read this perhaps back in early 70s when I first started getting passionately interested in type, but for the life of me I can't remember where.\n\nAlthough HZ may refer to that meeting point between a square and a circle as \"supercurve\" I think we have to give credit to Gabriel Lamé and Piet Hein. Apparently there is some controversy as to whether HZ came up with the idea in Melior on his own, or if his abiding interest in things mathematical may have led him to see the work of these others at an earlier time, perhaps filing it away sub-consciously.\n\n[http://en.wikipedia.org/wiki/Gabriel\\_Lam%C3%A9](http://web.archive.org/web/20150413075532/http:/en.wikipedia.org/wiki/Gabriel_Lam%C3%A9 \"http://en.wikipedia.org/wiki/Gabriel\\_Lam%C3%A9\")\n\n[http://www.oberonplace.com/products/plotter/tutor/lesson2.htm](http://web.archive.org/web/20150413075532/http:/www.oberonplace.com/products/plotter/tutor/lesson2.htm \"http://www.oberonplace.com/products/plotter/tutor/lesson2.htm\")\n\nI don't get to come here as much as I would like to, but boy oh boy does Typophile give me good brain food! Not that everyone will read it in this one thread, but I hereby thank all of you for your curiosity, your wide-ranging interests, and your willingness to set them down in type for the rest of us to read. Great, great stuff.\n\n"
    },
    {
      "time": "29 Apr 2007 — 9:40am",
      "content": "I guess in being a student I've been completely turned off by helvetica. Everyone uses it in excess, or they use the crazy scribbly freeware typefaces that are already messy.\n\nIn response to Nick's first comment, arial was created to try to beat helvetica for windows platforms, not to renew it, but in regards to everything else, right on.\n\nI'm glad this discussion came up because I frequently argue with friends but it becomes an argument on form and usefulness and does not contain nearly as much historical background.\n\nI discovered Univers about two years ago. I appreciate it for it's versatility and it will always be superior to helvetica in my eyes. Every possible combination of weights looks amazing together, and although I know this is subjective I really truly feel that way. I even refered to the actual universe as the \"univers\" in writing. Real smart, I know.\n\n"
    },
    {
      "time": "29 Apr 2007 — 12:29pm",
      "content": "_arial was created to try to beat helvetica for windows platforms, not to renew it,_\n\nI used the term \"revival\", which is a quite specific typographic euphemism. \"Renew\" has a more general meaning.\n\nIn other design areas, what we call revivals are often termed reproductions or imitations.\n\nAdrian Frutiger created Univers from scratch -- starting with original drawings.\n\n"
    },
    {
      "time": "29 Apr 2007 — 12:45pm",
      "content": "\\> a quite specific typographic euphemism.\n\nActually it's used quite loosely by most of us.\n\nhhp\n\n"
    },
    {
      "time": "29 Apr 2007 — 5:03pm",
      "content": "And I wouldn't term them <cite>euphemisms</cite> -- well, at least, not those done well. But some have truly \"passed on.\"\n\n"
    },
    {
      "time": "29 Apr 2007 — 7:41pm",
      "content": "Arial is not a revival of Helvetica.\n\nAccording to Mark Simonson Arial seems to be an adaptation of Monotype's grotesque series made by Birmy to match Helvetica's spacing so it could be substituted without disrupting a document's text flow.\n\nMicrosoft adopted Arial instead of Helvetica because of licensing and price issues but Microsoft didn't create Arial.\n\nAll this I learned at Mark Simonson's \"The scourge of Arial\".\n\nHéctor\n\n"
    },
    {
      "time": "29 Apr 2007 — 8:13pm",
      "content": "Héctor, would you please list a print source for that? I have seen the Arial/Monotype Grot connection mentioned many times but never seen anything substantial written on the subject. I find it a curious claim, as Arial really resembles Helvetica whereas MT Grot looks, at least to me, to have grown out of late 19th century light grotesk designs.\n\nEdit: Nevermind, I just found the article.\n\n"
    },
    {
      "time": "12 Jul 2010 — 12:42am",
      "content": "The choice to use which face in the number discussed above: it's almost spiritual.\n\nHelvetica reminds me of the airport signage of my youth, riding with my parents in a 707. Univers reminds me of the space program reaching out for the moon. Akzidenz Grotesk brings back the revelation from design school days when I discovered it was older than most sans-serif faces. Microgramma reminds me of space movies of the 1970s searching for space-age fonts to apply to sets and props.\n\nTo employ any of them in a specific design is like throwing the I Ching and becoming a typographical oracle. Helvetica's a little more voluptuous, Univers is a little more graceful, Akzidenz is a little more direct.\n\nBut then, I'm a positivist: I think just about every typeface is beautiful, if it can find the proper design environment in which to exist.\n\n"
    },
    {
      "time": "12 Jul 2010 — 3:37am",
      "content": "Nick:\n\n\\> Univers has the \"supercurve\" of the CRT\n\nDo you think of CRT typesetting?\n\nUniverse was developed in the 1950s\n\nsee [http://de.wikipedia.org/wiki/Univers](http://web.archive.org/web/20150413075532/http:/de.wikipedia.org/wiki/Univers \"http://de.wikipedia.org/wiki/Univers\")\n\n(The Universe release year was 1957)\n\nCRT composition was developed in the 1960s\n\nsee [http://de.wikipedia.org/wiki/Digiset](http://web.archive.org/web/20150413075532/http:/de.wikipedia.org/wiki/Digiset \"http://de.wikipedia.org/wiki/Digiset\")\n\n(The Digiset release year was 1965)\n\n"
    },
    {
      "time": "12 Jul 2010 — 6:52am",
      "content": "A \"supercurve\" is like the shape of a 1950s television (CRT) screen, a sort of squarish curve. Nothing to do with CRT typesetting.\n\n"
    },
    {
      "time": "12 Jul 2010 — 11:12am",
      "content": "Thanks for the explanation.\n\nDo you also happen to know, in which book or paper Zapf coined this term?\n\n"
    },
    {
      "time": "12 Jul 2010 — 11:57am",
      "content": "Pretty sure it's in one of his books, but I'm away from home at the moment and can't remember which.\n\n"
    },
    {
      "time": "12 Jul 2010 — 12:13pm",
      "content": "It’s a superellipse, the Wikipedia entry has more information. Mmmm, Melior.\n\n"
    },
    {
      "time": "14 Jul 2010 — 9:16pm",
      "content": "In design school, I was eventually banned from using Helvetica. I came to love Univers.\n\n"
    },
    {
      "time": "15 Jul 2010 — 4:29am",
      "content": "Meet the new boss.\n\n"
    },
    {
      "time": "15 Jul 2010 — 7:23am",
      "content": "Being \"banned from using Helvetica\" is just as bad as using it all the time!  \nThe typeface you choose should be on how well it does the job, not on some philosophical stance.\n\nAs Nick stated, the boss/client may intervene but if you are making the decision, make it on effectiveness.\n\n"
    },
    {
      "time": "15 Jul 2010 — 7:52am",
      "content": "\\> Being \"banned from using Helvetica\" is just as bad as using it all the time!\n\nWell, _almost_ as bad. :-)\n\nhhp\n\n"
    },
    {
      "time": "15 Jul 2010 — 9:41am",
      "content": "OK, Hrant--almost ;-)\n\n"
    },
    {
      "time": "15 Jul 2010 — 11:45am",
      "content": "_Meet the new boss._\n\nSame as the old boss; reference to _Baba O'Riley_ noted...\n\n"
    },
    {
      "time": "19 Jul 2010 — 11:10am",
      "content": "akaczun ,\n\nPlease don't post ads in the discussion forums. There is a \"Release Area\" for that sort of thing.\n\n"
    },
    {
      "time": "19 Jul 2010 — 11:25am",
      "content": "I believe that Zapf has said he didn't know about the mathematical concept of the super ellipse when he designed Melior. He designed it in 1952, and the super ellipse became known more widely when Piet Hein, an engineer (and poet and cartoonist) in 1959 won a design prize for a round-about in Stockholm in a super ellipse.\n\nPersonally, I never liked Melior, though I do like the new Ibis, which has Melior ancestry, but doesn't do the same curves inside and out. Univers has a slight squareness, compared to Helvetica.\n\n"
    },
    {
      "time": "19 Jul 2010 — 12:26pm",
      "content": "Melior was my favorite of the Zapf faces. The so-called super ellipse was also admired as a furniture shape for table tops.\n\n"
    },
    {
      "time": "19 Jul 2010 — 12:49pm",
      "content": "Chris, this was due to Piet Hein's influence, as he was also a designer.\n\nHe is has been a hero to me because he did engineering, furniture design, poetry, cartooning, and was part of the anti-Nazi resistance. What a cool guy!\n\nHere is the wikipedia article on him: [http://en.wikipedia.org/wiki/Piet\\_Hein\\_%28Denmark%29](http://web.archive.org/web/20150413075532/http:/en.wikipedia.org/wiki/Piet_Hein_%28Denmark%29 \"http://en.wikipedia.org/wiki/Piet\\_Hein\\_%28Denmark%29\")\n\nAnd here are some of his designs, which you can still buy: [http://www.piethein.com/usr/piethein/HomepagUK.nsf](http://web.archive.org/web/20150413075532/http:/www.piethein.com/usr/piethein/HomepagUK.nsf \"http://www.piethein.com/usr/piethein/HomepagUK.nsf\")\n\nBut for some reason I never liked the superellipse!\n\n"
    },
    {
      "time": "20 Jul 2010 — 11:25am",
      "content": "<cite>Being \"banned from using Helvetica\" is just as bad as using it all the time!<br>\nThe typeface you choose should be on how well it does the job, not on some philosophical stance.</cite>\n\nFor the sake of the argument, _why not_ choose a typeface based on a philosophical stance?\n\n"
    },
    {
      "time": "20 Jul 2010 — 12:05pm",
      "content": "Because the user doesn't [need to] care about the designer.  \nThat said, making any decision at least partly based on  \na personal philosophy is an unavoidably human thing.  \nIt's just important not to do it with intent.\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2010 — 12:16pm",
      "content": "Admittedly, I'm a young buck, but the whole thing seems pretty arbitrary to me. With modernism, _so much_ design was based on personal philosophy, and that was the way to do it. I tend to believe that we are simply looking at these problems from a different perspective. Can we now say that our current perspective is better than before?\n\n"
    },
    {
      "time": "20 Jul 2010 — 2:38pm",
      "content": "Well, I do hope mine is improving all the time! :-)\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2010 — 4:20pm",
      "content": "\"For the sake of the argument, why not choose a typeface based on a philosophical stance?\"\n\nThe issue is wether the nature of the typeface chosen contributes to the communication of the printed piece it is used for. If it does, then it is a good choice (there may be several good choices possible). The attributes of the typeface being judged center around the needs of the target audience and the message being conveyed. The personal philosophy of the person who decides on the typeface is at best irrelevant in the \"Audience, Purpose, Message\" triumvirate of determinants. In some cases of coincidence, the type specifier's philosophy may echo that of the intended audience but this is not likely.\n\nAs an example: Assume some graphic designer was given the job of designing a poster for a joint presentation by Massimo Vigneli, and Josef Mueller-Brockmann. In this case, using Helvetica would be a fine choice of a typeface. If the designer were forbidden from doing so based on his bosses' philosophy of only using brush scripts, it would be just silly. That is not to say that it would now be impossible to do a proper poster--it would just interject an unneeded hindrance.\n\n"
    },
    {
      "time": "20 Jul 2010 — 4:53pm",
      "content": "Ah, it is clearer to me now the nature of what we are talking about. I quite agree with that, dezcom.\n\nTell me if this would be an equally applicable example: _A designer uses Helvetica (or Univers, or whatever) for the logo and branding of a kindergarten school in the United States, based on reasons on goals involving rationality and objectivity, and the hope that children should be exposed to these design ideals and philosophies at a young age, that they may be further propagated._\n\n"
    },
    {
      "time": "20 Jul 2010 — 5:43pm",
      "content": "I think both typefaces are just fine. I personally prefer certain glyphs from Helvetica versus Univers, notably R, G, C, and Q. They feel more solid, serious. But that’s just my from-the-heart-and-gut opinion.\n\nI also don’t want to come up with a clever metaphor to describe the Helvetica-hate going on as outrageously snobby-sounding. Sorry guys. It’s tiring to note the fact that if I’m not wearing authentic Ray Bans with a Leica camera strapped around my neck while driving a Ford Torino and making layouts with the original cut of Akzidenz, someone out there will not be happy.\n\n"
    },
    {
      "time": "20 Jul 2010 — 7:31pm",
      "content": "You don't have to be a snob to realize Helvetica's _technical_ faults.  \nThere's a whole world to type beyond mere superficial fashion/style.\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2010 — 9:46pm",
      "content": "Actually, I take back what I said about the super ellipse. I just looked at [these tables](http://web.archive.org/web/20150413075532/http:/www.fritzhansen.com/en/fritz-hansen/designers.aspx#/piet_hein?i=i) designed by Piet Hein and Bruno Mathsson in 1968, and they're gorgeous.\n\nI guess it's a question of which super ellipse, and its use. A lot of stuff that came out which resembled this was lame, but the real thing is lovely.\n\n"
    },
    {
      "time": "21 Jul 2010 — 7:16am",
      "content": " ![](http://web.archive.org/web/20150413075532im_/http:/typophile.com/files/telefunken_rfb-t2_4688.jpg)\n\nTelefunken, 1939: the first \"rectangular\" CRT.  \nPrior to that, TV tubes were round, but had a \"landscape picture format\" viewing area cropped onto them.  \nSimilarly, cameras crop the circular image from a camera lens into a square film format -- so the new media, cameras and then TVs (and computer screens), adopted the traditional image-display shape.\n\nThe cartouche shape goes back to Ancient Egypt (Ramses era):\n\n ![](http://web.archive.org/web/20150413075532im_/http:/typophile.com/files/Ramses_6086.jpg)\n\n...and an oval shape was used for the traditional Japanese fan (here, 1808):\n\n ![](http://web.archive.org/web/20150413075532im_/http:/typophile.com/files/toyokuni_i_1808_fan_4741.jpg)\n\nThese in themselves are quite specific and different ellipses.\n\nIMO, the super ellipse emerged as an intriguing, recognizable shape about 70 years ago, a compromise because it was impossible to blow a square glass tube. This compromise shape had a cachet of style and glamour, representing the leading edge of technology.\n\nThis shape was then adopted by furniture makers and type designers, cross-over.  \nAlessandro Butti and Aldo Novarese were the first to thoroughly base a type design on the super ellipse CRT, in 1952.\n\n ![](http://web.archive.org/web/20150413075532im_/http:/typophile.com/files/TV_6359.png)\n\nInterestingly, Adrian Frutiger's working drawings (I recall seeing them in a small paperback monograph) for Univers show much more super-ellipse than in the finished item.\n\n"
    },
    {
      "time": "21 Jul 2010 — 7:25am",
      "content": "Did I just make another post to a thread with \"Helvetica\" in its title?  \nThis is too Mariah vs. Beyoncé, gotta stop.\n\n"
    },
    {
      "time": "3 Aug 2010 — 7:00am",
      "content": "It's baaaaack...  \n [http://www.engadget.com/2010/08/03/logitech-announces-alert-series-of-hi...](http://web.archive.org/web/20150413075532/http:/www.engadget.com/2010/08/03/logitech-announces-alert-series-of-high-def-security-cameras-we/ \"http://www.engadget.com/2010/08/03/logitech-announces-alert-series-of-high-def-security-cameras-we/\")\n\nYou could say it never left, but I think it's starting to ramp up for real.  \nLike that _security camera_ - I don't think I'd seen one like that.\n\nBTW, a true superellipse has no flat sides.\n\nhhp\n\n"
    },
    {
      "time": "3 Aug 2010 — 9:01am",
      "content": "speaking of microgrammar.. it is such a handsome font!  \nit is about the past-future kind of imagining the future and i liked how stark it is  \ni'd picture it in something like total recall, demolition man, terminator kind of future i guess? at once have brooding, artistic elmeents too\n\nanyways helvetica vs univers.... i'd go for the latter if i have to choose one.. it's slightly more elegant and geometrically appealing i think\n\n"
    }
  ]
}
