{
  "id": "33307",
  "title": "Monoxil",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "hello. this is Monoxil, monospace typeface i am working on right now. i would really appreciate your feedback.\n\nNOTES:\n\nyes, O-like characters are exact ellipses.\n\ngrey characters are stylistic alternates. i am not sure if i shouldn't switch regular and alternative versions, so maybe you could help me to decide. except for the \"a\" which is a bit disturbing in text because there is this long diagonal stroke, but it looks nice in biggers sizes.\n\nso far i haven't done much work on the optical details.\n\nthere is still a lot of characters missing, but i think you can get the concept. i will add them soon.\n\nthank you\n\n| Attachment | Size |\n| --- | --- |\n| [monoxil\\_specimen.pdf](http://web.archive.org/web/20150123085927/http:/typophile.com/files/monoxil_specimen.pdf) | 75.73 KB |\n\n",
  "author": "urtd",
  "time": "25 Apr 2007 — 10:05am",
  "uid": "17806",
  "comments": [
    {
      "time": "25 Apr 2007 — 10:47am",
      "content": "Much of this is very nice. Unfortunately, I'm not a fan of the elliptical rounds in the C, G, O, c, e, o. The curves in the numerals have more potential, and you use them nicely in the b, p, q.\n\nThe 'j' is interesting, but feels out of place, next to the curves. The v, w, x, y can get away with sharp angles, I think.\n\n"
    },
    {
      "time": "25 Apr 2007 — 11:26am",
      "content": "thank you stephen.  \nmonoxil is a school project, in which we had to define a particular subject of inspiration, like insects, heavy metal, lord of the rings and such (...) so i came up with \"medicine\" which reminds me of something clean and well organized but with a lot of disturbing details. that's why i decided to use ellipses. anyway, i think the c, e and o work very good, they give the text exactly that feeling i wanted. i think the typeface would loose it's character completly, if i remove them.\n\nthank you.\n\n"
    },
    {
      "time": "25 Apr 2007 — 11:36am",
      "content": "Your font looks good but I'm just not sure about the lowercase \"a\" and there is a problem with your curves logic. For exemple when you draw an almost square \"b\" you can't have a round \"c\" and \"e\". Same thing for the rest of letters. You have to find one only esthetic for your curves : )\n\n"
    }
  ]
}
