{
  "id": "33316",
  "title": "Help finding a good sans serif face for media magazine",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I normally wouldn't ask for help with something like this since I am a control freak and generally knowledgeable but I am redesigning a magazine in a hurry and was looking for input since you guys and gals know your stuff. I am looking for a good legible sans serif with a modern touch but without the goofy flourishes that many of the modern humanist faces have – basically I'm looking for a Trade Gothic but with an edge. It needs to have a big family (condensed, three or four weights and italics a must). The Bold faces need to be cover-line solid and because the magazine has a humorous tone, it needs to be able to carry that tone as well. Trade Gothic was great for Vice Magazine when I was there because it had this exact quality but it's too visibly dated for this magazine, which is trying to be more modern to go with the rebranding of the company.\n\nI'd say the closest I've gotten is FF Bau, which is nice and classy with a potential for humour but its heavier faces are just a touch clunky and Kabel-ish for my taste.\n\nAny help appreciated - even just suggesting foundries to check out (Font Bureau is good - I bought our slab serif font – Dispatch – there). I've got FontFont's book of fonts being delivered as well so hopefully that will turn up some things.\n\nthanks\n\nedit: I should note that currently the magazine is using Myriad Pro and while it's fine for a women's health magazine or Punch Bowl Monthly, it is killing me with it it's complete lack of sleekness.\n\n[www.3eige.com](http://web.archive.org/web/20110214132710/http:/www.3eige.com/ \"www.3eige.com\") | [www.arstechnica.com](http://web.archive.org/web/20110214132710/http:/www.arstechnica.com/ \"www.arstechnica.com\")\n\n",
  "author": "<a href=\"/web/20110214132710/http://typophile.com/user/18124\" title=\"View user profile.\">BEIGE</a>",
  "time": "<br>",
  "uid": "18124",
  "comments": [
    {
      "time": "",
      "content": "I forgot to mention that it also needs full diacritics and ligatures since the magazine is in both English and French.\n\n[www.3eige.com](http://web.archive.org/web/20110214132710/http:/www.3eige.com/ \"www.3eige.com\") | [www.arstechnica.com](http://web.archive.org/web/20110214132710/http:/www.arstechnica.com/ \"www.arstechnica.com\")\n\n"
    },
    {
      "time": "",
      "content": "have you tried looking at anything from Village ( [http://www.vllg.com](http://web.archive.org/web/20110214132710/http:/www.vllg.com/ \"http://www.vllg.com\")) or Process Type Foundry ( [http://www.processtypefoundry.com/](http://web.archive.org/web/20110214132710/http:/www.processtypefoundry.com/ \"http://www.processtypefoundry.com/\"))? Both offer some nice contemporary sans serif faces, though I am unsure as to what you mean by 'goofy flourishes'.\n\n"
    },
    {
      "time": "",
      "content": "I don't toot my horn here too much, but I might suggest my own [Proxima Nova](http://web.archive.org/web/20110214132710/http:/www.ms-studio.com/FontSales/proximanova.html)... sounds like it might be the kind of thing you are looking for.\n\n"
    },
    {
      "time": "",
      "content": "From your description I'm getting a distinct Storm Foundry vibe.  \n [http://www.myfonts.com/foundry/storm/](http://web.archive.org/web/20110214132710/http:/www.myfonts.com/foundry/storm/ \"http://www.myfonts.com/foundry/storm/\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think I might have found it - Zeppelin by Storm is sort of dead on. Great font.\n\nedit: ahaha - awesome that you just suggested Storm. was just going over them.\n\n"
    },
    {
      "time": "",
      "content": "Proxima Nova is really nice but I find the eye (or is it the bowl?) of the a to be a little less sleek and more towards the too fun for a copy font.\n\n"
    },
    {
      "time": "",
      "content": "Have you looked at/considered Parisine/Parisine PTF?\n\n[http://www.typofonderie.com/](http://web.archive.org/web/20110214132710/http:/www.typofonderie.com/ \"http://www.typofonderie.com/\")\n\n"
    },
    {
      "time": "",
      "content": "I'll bite:\n\n[ClearviewText](http://web.archive.org/web/20110214132710/http:/www.terminaldesign.com/fonts/set/?ID=111)\n\n"
    },
    {
      "time": "",
      "content": "ooh - Parisine is nice. I'm thinking that Zeppelin is lacking something so that might be the one. Thanks\n\nI find Clearview's nice but it's a little wide and the lowercase l has a Din-like foot that I'm not loving.\n\n"
    },
    {
      "time": "",
      "content": "ClearviewText has a alternate non-footed lowercase l accessible via the Swash OT feature. All three widths are too wide?\n\n"
    },
    {
      "time": "",
      "content": "So I think I'm going to go with FB Antenna. I bought a few variants last night (the whole collection is $1500!) and it's great for cover lines and since we're only running shorter sidebar copy and decks in the sans-serif, it is perfect.\n\nI'm a bit of a hyprocrite though - it's got a foot on the l, but it's less extreme than others I've seen.\n\nNow to find a serif font...\n\nAny suggestions? We're using Utopia now but I would like something with a bit more to it to go with the Dispatch/Antenna combination.\n\n"
    },
    {
      "time": "",
      "content": "And if anyone knows someone in Montreal looking for an assistant art director position, email me at daveg at spafax.com. We're looking for people for the future mag. they'd need magazine experience.\n\n"
    },
    {
      "time": "",
      "content": "Seeing the slabs in Dispatch and the full forms of Antenna  \ngives me the courage to suggest a look at my Patria:  \n [http://www.themicrofoundry.com/ad/CR.pdf](http://web.archive.org/web/20110214132710/http:/www.themicrofoundry.com/ad/CR.pdf \"http://www.themicrofoundry.com/ad/CR.pdf\")\n\nIf you'd like more samples I can send you the PDF of  \nmy article from TYPO #13 which was set in Patria.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "it's a lovely font for sure but I think it's a bit too bookish for the mag. We're somewhere between Esquire and Radar magazine.\n\n"
    },
    {
      "time": "",
      "content": "Makes sense.\n\nhhp\n\n"
    }
  ]
}
