{
  "id": "33312",
  "title": "Im trying to get old of David Earls",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all\n\nMy name is Siaron Hughes, and I'm studying an MA in Graphic Design at London College of Communication. Being Welsh, I'm keen to explore my national identity with visible words, type and language.\n\nMy field of study is Typography, Welsh National Identity and Culture. And the questions I'm exploring are:  \n1) Can typography enhance national and cultural identity?  \n2) Can a typeface communicate the special character of a national identity?  \n3) Can typography reflect the richness of the way we speak, through accent, gender, age, speed, rhythm and geography in order to preserve meaning and identity?  \n4) How does a personal identity get constructed and reflected through typography and graphics?  \n5) Could a typeface be engineered with sense-of-place somehow sewn in?\n\nI noticed there was a discussion David Earls posted some time ago about the lettering on the front of the Millenium Centre building in Cardiff, and I'd very much like to talk to him further about this.\n\nIf anyone else has some thoughts/adivse on my field of study, Id appreciate it also!\n\nThanks  \nSiaron\n\n",
  "author": "shughes",
  "time": "25 Apr 2007 — 12:11pm",
  "uid": "17425",
  "comments": [
    {
      "time": "25 Apr 2007 — 12:18pm",
      "content": "Hi Siaron, try [the contact page](http://web.archive.org/web/20131019191601/http:/typographer.org/about.html) on his site, Typographer.org\n\n"
    },
    {
      "time": "25 Apr 2007 — 1:12pm",
      "content": "Hi Siaron, I'm not sure how much I can help, but I've sent you an email about this. Apologies for the delay in getting back to your email earlier in the month.\n\nDavid\n\n"
    },
    {
      "time": "25 Apr 2007 — 2:15pm",
      "content": "Hi David, Im so pleased to get hold of you. I dont think I remember receiving your email.\n\nI'd be really interested to talk to you more about the lettering on the Millenium Centre/David Jones/and Welsh typography. I've also been in touch with John Hudson who's been really great. He sent me a link to the Gododdin the other month, which sent me on a quest to the British Museum to meet a Prof of Illuminated Manuscripts to try and understand more abouc what we term \"Celtic\" lettering.\n\nWould it be possible to have a chat with you? Im attempting to make a typeface for the Welsh language at the moment, something I've never done before.\n\nAny advise/comments would be greatly appreciated.\n\nSiaron\n\n"
    }
  ]
}
