{
  "id": "33334",
  "title": "Geometric Spiral Design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm curious how one would reconstruct the geometric design used for this logo. It seems like a simplistic thing, but I'm having little luck in Illustrator. Not looking to steal the design, I'd just like to figure out how the pattern was created.\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/englogo_4134.jpg)\n\nSorry for the image size, it was the best I could find.\n\n",
  "author": "AndrewSipe",
  "time": "26 Apr 2007 — 10:27am",
  "uid": "6496",
  "comments": [
    {
      "time": "26 Apr 2007 — 10:47am",
      "content": "My guess is that it's programmatic. It certainly resembles [Fibonacci phyllotaxis](http://web.archive.org/web/20150326031447/http:/www.mcs.surrey.ac.uk/Personal/R.Knott/Fibonacci/fibnat.html), for which there is a long history of analysis and tools for generating the spiral designs.\n\n(I'm finishing up my doctorate in spirals, so I should know!)\n\n"
    },
    {
      "time": "26 Apr 2007 — 10:50am",
      "content": "Do you want to create the shape before it was distorted?  \nIt is essentially based on a twelve pointed star with curved sides, create a basic star in Illustrator to get the centre and then draw one half petal using the start and finish points of one segment of the star, reflect/copy that to form one petal, position your smallest circle and use the rotate tool to position it along the line of the petal, using the centre of your base star as the point it rotates around, and then scale them, reflect/copy the circles and using the centre again rotate copy them 30º.  \nMore confusing to write than do, honest.\n\nTim\n\n"
    },
    {
      "time": "26 Apr 2007 — 10:59am",
      "content": "I'll give a try, even though I'm not sure what you just said.\n\n"
    },
    {
      "time": "26 Apr 2007 — 11:07am",
      "content": "timd: actually, you're right, it's based on 12-fold symmetry, rather than a Fibonacci spiral.\n\nSo probably the simplest way to do this is to take a 1/12th slice, draw it more or less by hand, then replicate it around 12 times. That slice also has a mirror symmetry, but it may be easier to just draw both halves rather than trying to draw a single half and doing a mirror copy.\n\nI find the Fibonacci spiral more appealing - it's closer to what's in nature - but it is more complicated to pull off, for sure.\n\n"
    },
    {
      "time": "26 Apr 2007 — 11:19am",
      "content": "Raph, your suggestion definitely makes more sense.\n\nSo, I'm drawing a 12 point star, then dividing it into 12 equal pieces. Then in one of the pieces I create my 2 column staggered descending size circles. Then I rotate/copy that piece on a 30 degree axis based on the center of the original 12 point star.\n\n"
    },
    {
      "time": "26 Apr 2007 — 11:31am",
      "content": "Okay, apparently I didn't understand at all. Have either of you guys tried what you suggested and had luck?\n\n"
    },
    {
      "time": "26 Apr 2007 — 11:44am",
      "content": "Dude, make two equal circles, copy-paste them and rotate the new pair 360/12=30 degrees. Do that four more times, each time on the newest pair. Then take the whole ring, copy-past it, shrink the new ring down by whatever amount, rotate it 30/2=15 degrees. Repeat with the smallest ring until you have enough.\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2007 — 11:59am",
      "content": "Would you mind visualizing that for me? Apparently I'm extra dense and that \"Aha\" moment hasn't happened yet.\n\n"
    },
    {
      "time": "26 Apr 2007 — 12:10pm",
      "content": "Nevermind, I just had the \"Aha\" moment. I'll post my results shortly.\n\n"
    },
    {
      "time": "26 Apr 2007 — 12:14pm",
      "content": "Spiral-Graph Tutorial: Based on Hrant's input. Thanks Hrant!\n\n1. Create 2 circles, space them out (this will be outside diameter of the spiral graph)\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/1_4669.gif)\n\n2. Group the 2 circles, Copy and Rotate 30 degrees\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/2_3938.gif)\n\n3. Duplicate 4 more times\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/3_3845.gif)\n\n4. Select and Group all the circles, copy, reduce size, and Rotate 15 degrees. This will be the smaller staggered row.\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/4_4665.gif)\n\n5. Select and Group these 2 rings of circles, reduce size, and repeat as desired.\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/5_4268.gif)\n\n"
    },
    {
      "time": "26 Apr 2007 — 12:30pm",
      "content": "Hey, nice illustration! :-)\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2007 — 12:42pm",
      "content": "\\>Apparently I’m extra dense\n\nNot at all, it would have been easier to show with images in the first place. I now have dots before my eyes and I might have hypnotised myself. Your next challenge is to try it with the Fibonacci spiral, I had a split Nautilus shell, a thing of wonder and delight\\* :)\n\nTim\n\n\\*Unfortunately fragile as well\n\n"
    },
    {
      "time": "26 Apr 2007 — 12:44pm",
      "content": "Thanks Hrant. You too Tim and Raph! Sorry I was so dense at first, I'm a visual learner. Trying to understand the suggestion to accomplish this was taking their toll on my noodle. Luck for me, it sunk in before I had an Aneurysm .\n\n"
    },
    {
      "time": "26 Apr 2007 — 1:30pm",
      "content": "Oh I also discovered, that if you start with the 2 circles as suggested by Hrant, Group them, then go to Object\\>Transform\\>Transform Each and set the Scales to something less than 100% (I used 90%) and set Rotate to 30 degrees and press the Copy button. Then duplicate this over and over (Ctrl+D or Cmd+D), till you get what look like 2 spirals that seem to reduce infinitely. When you've duplicated till your hearts desire. Select all these new circles, group them and then rotate them 45 degrees, do this 2 more times for a much tighter looking spiral-graph.\n\nComparison Spirals:\n\nOriginal Technique on Left. New Technique on Right.\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/new_5338.gif)\n\n"
    },
    {
      "time": "26 Apr 2007 — 2:16pm",
      "content": "The same technique is applied in CorelDraw. But, instead of grouping the circles, I combine them to make them share same outlines+fill color. Combining makes smaller and thus faster to manipulate file. That's how I built [Flowers](http://web.archive.org/web/20150326031447/http:/www.crauswords.com/flowers/WFlowers.htm) with CorelDraw3.0, 15 years ago.  \nIs there something like that in Adobe Illustrator?\n\n"
    },
    {
      "time": "26 Apr 2007 — 2:39pm",
      "content": "If you're going to try for the Fibonacci spiral, try rotating by 180/phi = 111.246118 degrees.\n\n"
    },
    {
      "time": "26 Apr 2007 — 3:31pm",
      "content": "i didn't know either, but i took a stab and was able to come up with this in just a couple of minutes:\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/perspective1_5225.jpg)\n\ni used illustrator to draw the hex, and then dragged it into the brush palette. i drew a circle and applied the brush. copy and paste, then scale (i did it 150% -- scaling strokes and effects) repeat repeat repeat... paste into photoshop and free distort.\n\n"
    },
    {
      "time": "26 Apr 2007 — 5:14pm",
      "content": "That is not a spiral. :)  \nAnd the rotating and perspective you can do in Illustrator itself, no need for photoshop. Quick try:\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/spiralthingy_6286.jpg)\n\n"
    },
    {
      "time": "26 Apr 2007 — 6:12pm",
      "content": "you're right\n\n"
    },
    {
      "time": "26 Apr 2007 — 7:36pm",
      "content": "What if you want the small shapes on the outside? ;^P\n\n"
    },
    {
      "time": "26 Apr 2007 — 8:51pm",
      "content": "this plug-in may help:\n\n[http://www.cvalley.com/products/xtreampath/index.html](http://web.archive.org/web/20150326031447/http:/www.cvalley.com/products/xtreampath/index.html \"http://www.cvalley.com/products/xtreampath/index.html\")\n\n"
    },
    {
      "time": "27 Apr 2007 — 4:59am",
      "content": "Jon, I was thinking the same thing. Course, I'm just glad we figured out how to do the original design.\n\nAny ideas for Jon's inquiry?\n\n"
    },
    {
      "time": "27 Apr 2007 — 5:08am",
      "content": "Raph, actually it would be 360/pi = 114.591559\n\n"
    },
    {
      "time": "27 Apr 2007 — 10:05am",
      "content": " ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/whirrlpool_6420.jpg)\n\n"
    },
    {
      "time": "27 Apr 2007 — 4:34pm",
      "content": "Then you will probably have to use Offset Path, to keep making the outer copies smaller. I've tried a quick one, without really paying attention if the decrease in size is mathematically correct every time. I just did the offset path by eye, which is of course not mathematically correct. So the decrease in size outward might not be very consistent. I also rotated the shapes themselves by 30 degrees to start with, to make them fit together more nicely.\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/flowerding1_3449.jpg)\n\nTo make it look more 'spiraly', below I placed the two outermost  \nsizes on almost the same diameter circle.\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/flowerding_5372.jpg)\n\nNot perfect, maybe someone else knows a way to do it  \npartially automatic, like with the original design.\n\n"
    },
    {
      "time": "27 Apr 2007 — 7:06pm",
      "content": "Nice Stuff! I did similar stuff to build a line patern similar to what you see on Certificates and US paper money. See the thing on the left?\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/leftbtm_6317.jpg)\n\n"
    },
    {
      "time": "28 Apr 2007 — 7:44am",
      "content": "[Debbie New](http://web.archive.org/web/20150326031447/http:/www.philosopherswool.com/Pages/DebbieNewCards.htm)is a brilliant knitter who has done Fibonacci work -- it's always interesting to see the different ways of interpretation.\n\n"
    },
    {
      "time": "28 Apr 2007 — 7:48am",
      "content": "Eben, I did something similar for a project in college using the Transform Palette. But, more recently I figure out how to do it using the Blend tool, which gave me a lot more control and broke away from that Spiral-graph look. Start with 2 lines (straight or curved) then blend them together using 20, 50, 100 steps, sometimes the more the merrier. You can alter the lines themselves (adding anchor points and curves), and/or you can alter the blend path (more anchor points and curves as well). You can also blend multiple lines together for an even more intricate look. This method would be closer to mimicking that Certificate look.\n\n"
    },
    {
      "time": "28 Apr 2007 — 4:30pm",
      "content": "That sounds great. Care to offer a 2nd graphic tutorial? I am sure the many & sundry would be happy to see it & not just me!\n\n"
    },
    {
      "time": "30 Apr 2007 — 6:52am",
      "content": "I'm not sure how to do a tutorial for this. It's something you have to experiment with to really get the idea.\n\nJust draw 2 or more lines, then blend them together with a few steps. Using the direct select arrow (the white arrow) select the lines that form the blend and add anchor points or using the Convert Anchor Point tool (carrot), add curves. The effect becomes even more apparent when you crisscross curved lines.\n\nBelow is a simple blend of 2 lines with 10 steps. The lines have a simple s curve and I rotated the bottom line 90 degrees perpendicular. The lines I started with are in black and the blended lines are red.\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/curve_3749.gif)\n\n"
    },
    {
      "time": "30 Apr 2007 — 8:07am",
      "content": "I see. Yes that makes sense. Thanks!\n\n"
    },
    {
      "time": "1 May 2007 — 11:45am",
      "content": " ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/spiral_variations1_5115.jpg)\n\nillustrator 9  \nfilterit pluging to create 12 hex symmetry  \nvarious rotations and scalings\n\n"
    },
    {
      "time": "11 Jan 2009 — 4:53am",
      "content": "Hi,  \nI found this thread very interesting, although it wasn't exactly what I was after, hence I was wondering if someone may be able to help. I want to create a Fibonacci spiral in Illustrator CS3 that uses equal size circles. Similar to this beautiful logo by Stefan Sagmeister (see below), but I would like the same sized circles, as they grow out to increase the space between each. So the circles are really tight together and touching in the centre and as the spiral increases it becomes more spacial.  \nI apologise if I am unclear with my explanation. Thanks and look forward your responses to this.\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/seed_1_6288.png)\n\n"
    },
    {
      "time": "12 Jan 2009 — 5:49am",
      "content": "What spiral?\n\n"
    },
    {
      "time": "12 Jan 2009 — 2:32pm",
      "content": "I see what you mean (ie. Seed Media Group logo). The curve is very slight on the outer rim and gets a bit lost in the centre.  \nWhat I am after though is a more refined method of doing this. If you have any ideas I would appreciate your feedback.\n\n"
    },
    {
      "time": "25 Jun 2013 — 7:44pm",
      "content": "Apparatus, have you discovered a more refined method? I am trying to recreate the following in Illustrator using 'transform each' and I can't figure it out. There are issues with this, and I would like o make it more symmetrical, programmable, mathematical, and based on a Fibonacci spiral.\n\n ![](http://web.archive.org/web/20150326031447im_/http:/typophile.com/files/spiral_3932.png)\n\n"
    },
    {
      "time": "25 Jun 2013 — 7:49pm",
      "content": "That's very cool.\n\nhhp\n\n"
    },
    {
      "time": "26 Jun 2013 — 7:49pm",
      "content": "All very well, but as a type guy I wonder about the symmetry of these images, especially when used with a neo-grotesque face, rather than a geometric.\n\nI mean, why do we go to such trouble to optically correct typographic glyphs, and yet this is not a criterion of the symbols?\n\n"
    },
    {
      "time": "26 Jun 2013 — 7:55pm",
      "content": "Conscious versus subconscious. At least partly.\n\nhhp\n\n"
    }
  ]
}
