{
  "id": "33365",
  "title": "Canadian ad campaign inspired by unfortunate video store sign",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.cbc.ca/canada/ottawa/story/2007/04/26/flick-off-campaign.html](http://web.archive.org/web/20070911200544/http:/www.cbc.ca/canada/ottawa/story/2007/04/26/flick-off-campaign.html \"http://www.cbc.ca/canada/ottawa/story/2007/04/26/flick-off-campaign.html\")\n\n [‹ Need better typeface](http://web.archive.org/web/20070911200544/http:/typophile.com/node/33497 \"Go to previous forum topic\") [Suggestions for a bitmap typeface (others then Screen Matrix, Knit Map and Folk Art) ›](http://web.archive.org/web/20070911200544/http:/typophile.com/node/33340 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911200544/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 27.Apr.2007 12.08pm",
      "content": "There is a flicker of hope for Canadian energy conservation after all :-)\n\nChrisL\n\n"
    },
    {
      "time": " 27.Apr.2007 12.11pm",
      "content": "I saw the light Si—come mornin’, I am getting off with the program!\n\nChrisL\n\n"
    },
    {
      "time": " 27.Apr.2007 12.14pm",
      "content": "Proof that Idiocracy is well under way.\n\n"
    },
    {
      "time": " 27.Apr.2007 12.16pm",
      "content": "It’s Ontario — it figures.... ;-)\n\n(But hey, it appeals to de yootds!)\n\n"
    },
    {
      "time": " 27.Apr.2007 12.31pm",
      "content": "In Queens, they say Yoots, Linda :-)\n\n[http://en.wikipedia.org/wiki/My\\_Cousin\\_Vinny](http://web.archive.org/web/20070911200544/http:/en.wikipedia.org/wiki/My_Cousin_Vinny \"http://en.wikipedia.org/wiki/My\\_Cousin\\_Vinny\")\n\nChrisL\n\n"
    },
    {
      "time": " 27.Apr.2007 12.51pm",
      "content": "Not on the border between Flushing and Jamaica.... ;-)\n\n"
    },
    {
      "time": " 27.Apr.2007 12.56pm",
      "content": "I’ll let you know how my offspring, who never turn off lights when they leave a room, and should appreciate a vulgar visual typographic pun, respond, but I don’t anticipate any change in their behaviour. Too ingrained.\n\nAwareness campaigns are not the way to combat global warming.  \nNeither are percentage reduction targets for industry — because we live on a finite planet, we need absolute targets.  \nBanning incandescent bulbs is a token gesture.  \nGasoline and air miles should be rationed.\n\n"
    },
    {
      "time": " 27.Apr.2007 1.10pm",
      "content": "And glossy magazines (and their art directors).\n\nhhp\n\n"
    },
    {
      "time": " 27.Apr.2007 2.22pm",
      "content": "Is the NDP akin to our neocon evangelical republicans?\n\n(oh, wait, it appears the NDP is the one sponsoring it, eh?)\n\n"
    },
    {
      "time": " 27.Apr.2007 3.27pm",
      "content": "If someone can get me one of those campaign shirts in a medium size I’ll be more than happy to pay you for your efforts.\n\n"
    },
    {
      "time": " 27.Apr.2007 3.45pm",
      "content": "_Is the NDP akin to our neocon evangelical republicans?_\n\nIf anything, they are the diametrically exact opposites.\n\n"
    },
    {
      "time": " 27.Apr.2007 3.55pm",
      "content": "_If someone can get me one of those campaign shirts in a medium size I’ll be more than happy to pay you for your efforts._\n\nDo you have a Roots store up there in the Yukon?\n\n[canada.roots.com](http://web.archive.org/web/20070911200544/http:/canada.roots.com/style.aspx?catid=27&dptid=1&saleGroup=&template=1)\n\n"
    },
    {
      "time": " 30.Apr.2007 5.34am",
      "content": "It’s as bad as French Connection fashion label’s branding that was in vogue with dullards in the UK not long ago. FCUK in big letters on your chest. Why not just tatoo moron across face? I think the label has dropped this approach now after slowly realising that it just cheapened everything.\n\n"
    },
    {
      "time": " 30.Apr.2007 11.15am",
      "content": "FCUK still does that. Around 1/4 of the clothing in their stores are labeled with clever slogans like fcuk safely, and fcuk toronto.\n\n"
    },
    {
      "time": " 30.Apr.2007 12.29pm",
      "content": "Conservation and environment education is like an ocean cruise ship trying to turn, you can turn the wheel but the ship will take a long time to turn. The problem is no one is steering. In the USA the administration’s solution is to exhaust the resources we have, damn the environment.\n\n"
    },
    {
      "time": " 30.Apr.2007 1.08pm",
      "content": "This reminds me of the (probably apocryphal) stories from the Vietnam war about painting “flicker” on the sides of trucks.\n\n"
    },
    {
      "time": " 30.Apr.2007 2.14pm",
      "content": "_Do you have a Roots store up there in the Yukon?_\n\nWell I’m in NWT, but no, no Roots. We’re lucky to have Canadian Tire.\n\n"
    },
    {
      "time": " 30.Apr.2007 2.21pm",
      "content": "Speaking of things it reminds people of. This reminds when I was working on the east coast and the wife of one of our designers worked for the competition across the street. They did a summer morale BBQ and gave people shirts with the slogan “Good is the opposite of great”. We all begged for a copy of the shirt, sadly she had given hers away before the end of the day, before we found out about it.\n\n"
    },
    {
      "time": " 30.Apr.2007 2.29pm",
      "content": "Yellowknife isn’t at the end of the world (although I bet you can see it from there....) ;-)\n\n"
    },
    {
      "time": " 30.Apr.2007 6.13pm",
      "content": "“painting “flicker” on the sides of trucks.”\n\nThat required all caps though. I did a little truck lettering myself in the Nam. :-)\n\nChrisL\n\nFLICKER\n\n"
    },
    {
      "time": " 1.May.2007 8.35pm",
      "content": "Seems like the campaign is working well for them - its stirring up a big brewhaha and attracting great coverage towards the client; this is the third time it has been brought to my attention. The PR guys and gals for the client must be licking there lips over this.\n\nWhether the ad campaign is ethical and has worked for the client ’for the right’ reasons is another question?\n\n"
    },
    {
      "time": " 1.May.2007 9.47pm",
      "content": "It’s been picked up by Much Music. I walked past the building on Queen today and there were giant posters and you could buy t-shirts.\n\n"
    },
    {
      "time": " 3.May.2007 2.26pm",
      "content": "_Yellowknife isn’t at the end of the world (although I bet you can see it from there….) ;-)_\n\nI swear when I’m on a hill or out on the lakes I can see the earth bend. I’ll be in the arctic in 2 weeks for a few days. Maybe I’ll see where the ice forms a big wall/cliff at the end of the world. :D\n\n"
    },
    {
      "time": " 3.May.2007 4.15pm",
      "content": "ROFL! I spent a month in Inuvik and Tuk one summer back in the 70s: the high arctic is an amazing place.\n\n"
    }
  ]
}
