{
  "id": "33364",
  "title": "My first face",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi, everyone. This is my first foray into typeface design. I've designed this for a class I'm taking.\n\nIt is inspired by Frutiger. My idea was to add an arc to the ascenders and an opposite arc to the descenders to create a sense of movement. I've felt that sometimes sans serifs are too static and could use a little excitement.\n\nI appreciate any constructive criticism you can offer.\n\nThanks,  \nDoug\n\n| Attachment | Size |\n| --- | --- |\n| [dalliance.pdf](http://web.archive.org/web/20131011231944/http:/typophile.com/files/dalliance.pdf) | 495.99 KB |\n\n",
  "author": "cyberdouglas",
  "time": "27 Apr 2007 — 11:47am",
  "uid": "18274",
  "comments": [
    {
      "time": "27 Apr 2007 — 11:56am",
      "content": "Two problems you might have:\n\n1. There is already a typeface called [Dalliance](http://web.archive.org/web/20131011231944/http:/emigre.com/EF.php?fid=87).\n\n2. It's considered unethical to use the outlines of [another font](http://web.archive.org/web/20131011231944/http:/www.fontshop.com/fonts/singles/monotype/myriad_pro_regular/&sample_text=sans%20arc&sample_size=110) to create your own.\n\nI think you have some interesting ideas with the stroke endings, but you need to build your typeface from scratch.\n\n"
    },
    {
      "time": "27 Apr 2007 — 12:11pm",
      "content": "To me it looks like Frutiger created on a bad press. I like the little flashes but don't think they're suitable on a font like this. Frutiger was designed for legibility - Charles de Gaulle Airport I think (I suspect Stephen will have more idea than me) Hence it was never intended as a font with \"movement\". My personal opinion is that it is deathly dull, but we suffer from a total overload of it in the UK and I'm using it on a particularly uninspring project at the moment so I'm a little biased. It is however very successful at it's job (without opening up the legibility debate AGA!N)\n\nI think you need a more suitable typeface to \"inspire\" your idea.\n\n"
    },
    {
      "time": "27 Apr 2007 — 12:13pm",
      "content": "Stephen,\n\nThanks for your comments and letting me know that Dalliance is already in use.\n\nAs for the outlines: all were drawn by hand in Illustrator...from scratch. Ethics are important to me, too.\n\nThanks,  \nDoug\n\n"
    },
    {
      "time": "27 Apr 2007 — 12:17pm",
      "content": "It's no fun being discouraging to a student, but I would advise running away from this as fast as you can. Besides the ethical issues, the main thing is this type of effort is boring as hell. :-/ Yes, look at existing fonts, but make your own forms from your own head - that's what makes it interesting.\n\nThat said you have a very good point concerning the static nature of most sans designs (including Frutiger). When you're making your forms from scratch try sheared/concave terminals but also experiment with a slight slant.\n\nhhp\n\n"
    },
    {
      "time": "27 Apr 2007 — 12:25pm",
      "content": "I apologize for assuming, but even if you created the outlines from scratch they are much too close to Myriad, the font I linked in my post. Your details will be much more successful if your bones are original.\n\n"
    },
    {
      "time": "27 Apr 2007 — 1:51pm",
      "content": "Uncannily close. Many of your points line up. Perhaps you're the long long child of Robert Slimbach. ;^)\n\nI agree with Hrant and Stephen.\n\nNow that you've experienced drawing it might be good to go back and experiment a bit more.\n\n"
    },
    {
      "time": "27 Apr 2007 — 1:54pm",
      "content": "\\>As for the outlines: all were drawn by hand in Illustrator…from scratch.\n\nI wish that I could believe that, but looking specifically at the original forms of such glyphs as @ & \\* in Myriad, it becomes very clear that the outlines from Myriad were simply appended with little \"flicks\". (And this site was probably the absolute worst place to post your \"first face\". Folks here tend to be pretty protective when it comes to type design.)\n\nSince you stressed that you were looking for \"constructive criticism\", please allow me to offer this: Construct something.\n\n"
    },
    {
      "time": "27 Apr 2007 — 2:03pm",
      "content": "cyberdouglas wrote: _Ethics are important to me, too._\n\nThe copying of other people's designs I can live with (I'm quite sympathetic to the copyright reformer's position, and in fact plan to do a free release of my adaptation of Bruce Rogers' Centaur soon). The lying about it, even after being confronted, not so much.\n\nLet me guess, you're a Republican, right?\n\n"
    },
    {
      "time": "27 Apr 2007 — 2:10pm",
      "content": "As for the outlines: all were drawn by hand in Illustrator…from scratch.\n\nYou're full ofshit mate. Just apologise and get on with drawing somwthing yourself, not mucking around witha decent face.\n\nIf i was your teacher I would fail you.\n\nMuzz\n\n"
    },
    {
      "time": "27 Apr 2007 — 2:38pm",
      "content": "Raph, come on. VOTING IS NOT THE ANSWER.\n\nhhp\n\n"
    },
    {
      "time": "27 Apr 2007 — 3:35pm",
      "content": "Ouch.\n\n"
    },
    {
      "time": "27 Apr 2007 — 4:46pm",
      "content": "I love all of you. I had no idea type geeks had so much spunk.\n\n-Doug\n\n"
    },
    {
      "time": "27 Apr 2007 — 6:04pm",
      "content": "lol, what do you expect when you claim a design is yours, when it is clearly not?  \nWhat did you mean by 'drawn from scratch'?\n\n"
    },
    {
      "time": "27 Apr 2007 — 7:01pm",
      "content": "Yes, 'loving us' and admiring our spunk is not the issue. But 'Awe Shucks' just the same.\n\nAlso, I have to agree about your addition. It's pretty weak.\n\nLook at it this way. If you drew this yourself or not; still, putting a hat on a kitten is not the same as making a kitten.\n\nI know it can be hard to see this because alot of type does look suspiciously alike to a newbie. A new serif can seem like it should 'count' - I mean what's the difference? Trust me, the differences are there. Go looking for them.\n\n"
    },
    {
      "time": "28 Apr 2007 — 2:22am",
      "content": "Apart from the whole discussion about \"inspiration\" of dubious sorts: I think those little arcs would vanish when printed in small sizes … they're just too small.\n\n"
    },
    {
      "time": "29 Apr 2007 — 6:34pm",
      "content": "\"putting a hat on a kitten is not the same as making a kitten\"\n\n ![](http://web.archive.org/web/20131011231944im_/http:/typophile.com/files/secret_5363.jpg)\n  \nMaking a kitten? That sounds _so_ wrong. \n"
    },
    {
      "time": "29 Apr 2007 — 11:01pm",
      "content": "Choz: I see you are planning to follow in Chris' footsteps.\n\n"
    },
    {
      "time": "30 Apr 2007 — 5:17am",
      "content": "If Chris didn't do a much better job of it, I would attempt to fill the role. In this one case, I just _had_ to! Sorry. I'd commented on your interesting analogy, then minutes later was fetching a Valentines wallpaper from acceptable.tv's operation kitten calendar. With what you said on my mind I saw the above, hats and all, and just started cracking up.\n\n"
    },
    {
      "time": "30 Apr 2007 — 12:50pm",
      "content": "\"I’ve designed this for a class I’m taking. It is inspired by Frutiger.\"\n\nAs a student of typography, you must understand from the beginning that your submission is neither \"designed\" or \"inspired\"... it is simply copied, and your embellishments add nothing to the original.\n\nI agreee with the others, you need to explore your own resourses and come up with an original creation.\n\nFrutiger, was designed by a master and his solutions do not need to be improved upon.\n\n"
    },
    {
      "time": "30 Apr 2007 — 12:55pm",
      "content": "\\> his solutions do not need to be improved upon.\n\nI couldn't disagree more. Type, being Design and not Art,  \nalways has room for improvement, in every single aspect.\n\nhhp\n\n"
    },
    {
      "time": "30 Apr 2007 — 1:00pm",
      "content": "Type is design AND art.\n\n"
    },
    {
      "time": "30 Apr 2007 — 1:07pm",
      "content": "Not in the useful sense of those two terms.  \nExpression for its own sake is anti-design.\n\nFrutiger the font is a tool, not a painting.\n\nhhp\n\n"
    },
    {
      "time": "30 Apr 2007 — 1:17pm",
      "content": "If you can only see the practicality of a \"font\" without appreciating the artistry of a well designed typeface, then I can offer no further comments.\n\n"
    },
    {
      "time": "30 Apr 2007 — 1:57pm",
      "content": "It's not about the results, but the intention.\n\nThere is no tool designed by anybody (master or no) that is Perfect.\n\nhhp\n\n"
    }
  ]
}
