{
  "id": "33398",
  "title": "Lettermade.com",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Thought everyone at Typophile may find this interesting:\n\n[http://www.lettermade.com](http://web.archive.org/web/20071126132411/http:/www.lettermade.com/ \"http://www.lettermade.com\")\n\nThis ongoing project, started in 1998, is aimed at documenting, appreciating, and recontextualizing our vernacular letterforms and typography.\n\nI have been working on this project in the background for several years and have only recently managed to get a substantial portion of my images online. I would love to hear any questions, comments, etc.\n\nRegards,  \nBrad.\n\n [‹ pasame la birthday cake, por favor](http://web.archive.org/web/20071126132411/http:/www.typophile.com/node/34126 \"Go to previous forum topic\") [Typography ASAP ›](http://web.archive.org/web/20071126132411/http:/www.typophile.com/node/33559 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071126132411/http://www.typophile.com/user/18315\" title=\"View user profile.\">dicharry</a>",
  "time": "<br>",
  "uid": "18315",
  "comments": [
    {
      "time": " 29.Apr.2007 11.52pm",
      "content": "The images of decayed lived-in signs are really attractive, well composed shots, I’ll bookmark this.\n\nTim\n\n"
    },
    {
      "time": " 29.Apr.2007 11.56pm",
      "content": "Great stuff, Brad. Thanks for the link. Many of the images are striking; I think the saturated, high-contrast photography style really suits the subject.\n\nReminds me of a very pleasant afternoon I spent photographing old signs in Salt Lake City...\n\n ![](http://web.archive.org/web/20071126132411im_/http:/www.typophile.com/files/slc_sign_5873.jpg)\n\n"
    },
    {
      "time": " 30.Apr.2007 1.27am",
      "content": "Great pictures, thank you!  \nJust wanted to let you know that I had to play around with my browsers’ text encoding in order to enter your website.  \n[Safari, encoding “Standard”, only delivered some character soup. Switched manually to “UTF-8”, then it worked fine. Same with Firefox (Mac) …]\n\n"
    },
    {
      "time": " 30.Apr.2007 4.36am",
      "content": "I only get the character soup also....  \nThat’s what I get for lagging behind on technology :-(\n\n"
    },
    {
      "time": " 30.Apr.2007 5.24am",
      "content": "The hand painted letterforms in the misc section stand out for me.  \nThe texture and composition of those make them feel like large canvases.\n\nLike it.\n\n"
    },
    {
      "time": " 30.Apr.2007 6.44am",
      "content": "Yea, the site is broken for me as well (firefox/PC)\n\n"
    },
    {
      "time": " 30.Apr.2007 6.44am",
      "content": "Sorry to hear that some people are having trouble viewing the site. I will take a look at the index file and see what the reason could be. Meanwhile here is a link straight into the photos:\n\n[http://www.lettermade.com/photos](http://web.archive.org/web/20071126132411/http:/www.lettermade.com/photos \"http://www.lettermade.com/photos\")\n\nThanks for all the kind words!\n\nRegards,  \nBrad.\n\n"
    },
    {
      "time": " 30.Apr.2007 7.29am",
      "content": "Brad, thank you for making this. Your gallery is just wonderful. People walking by keep stopping in their tracks to stare. I’ve been through a bit and decided I had to savor it and let it soak in. I will peek through your lens again soon.\n\n_(BTW, I’m in Firefox 2.0.0.3/PC, no problems, but I’ve kept encoding on UTF-8 instead of Auto for not-related compatibility reasons)_\n\n"
    },
    {
      "time": " 30.Apr.2007 4.37pm",
      "content": "Choz,\n\nThanks for the kind words. This project is something I have been working on off and on for the past 8-9 years. I never really intended to make it a public display, but I know there are others out there who would enjoy it as much as I do.\n\nThe site SHOULD be accessible to everyone now. There was an issue with the DNS settings for the domain that was causing the index file to get scrambled.\n\nThanks again,  \nBrad.\n\n"
    },
    {
      "time": " 1.May.2007 10.24pm",
      "content": "I just surfed some more of lettermade. Totally fun, but you make taking a week off from type difficult!\n\n"
    },
    {
      "time": " 2.May.2007 4.52am",
      "content": "Have you considered contacting a publisher & have it turned into a photobook? I always prefer things on paper rather than on screen & I’d love to add it to my bookshelf!\n\n"
    },
    {
      "time": " 2.May.2007 5.42am",
      "content": "It’s a great effort, but have you considered posting less arty photographs as well? Two of your stated aims are documenting and appreciating vernacular typography; I feel like these aims would be better handled by photographs that are not shot at angles with parts of the featured words and letters cropped out.\n\n"
    },
    {
      "time": " 2.May.2007 2.39pm",
      "content": "For some reason this did not post earlier:\n\nill sans: Eventually I will work up the steam to push this project out to potential publishers. For now I am simply happy to have it online. Do you know of any publishers who would be predisposed to this sort of publication?\n\njpad: I do have other photographs that often show the signs in their entirety. However it was/is my intention with this project to really focus on using the camera as a compositional tool while examining the unique letterforms and weathering of each sign. I guess in some ways I do not see the documentation, appreciation, and recontextualization as three separate things, but as a single goal—each component of which is essential to the other. Hopefully that makes sense.\n\nEssentially I wanted, personally, to admire these letterforms as something a little removed from their original intent. The camera was my way of doing that. Hence the ’arty’ compositions of these images.\n\n"
    },
    {
      "time": " 2.May.2007 3.28pm",
      "content": "I’d also like to see whole letters and signs. I think the audience here is different from the average layperson or photographer: whatever the medium, I am interested in the letterforms first and foremost. So these fragments are frustrating for me, especially knowing there is more. For that matter, you could bring these same images, or other photos of the same signs, to an even more abstract level than you have. Why leave them recognizable as letters, or even as signs?\n\n“I do not see the documentation, appreciation, and recontextualization as three separate things, but as a single goal—each component of which is essential to the other.”\n\nI would argue with that. Document: record. Appreciate: view, assess. Recontextualize: obscure, dislodge, reframe, repurpose. One of these is not like the others. It may be that your goal for this project is all three, and of course I can’t argue with that. But this audience may value the originals more than the recontextualizations.\n\n"
    },
    {
      "time": " 2.May.2007 9.15pm",
      "content": "crossgrove,\n\nthanks for the insightful comments.\n\nyou may very well be right—it may be an issue of audience. I can indeed understand why these photographs may frustrate those looking for full specimens. But the aim here is to appreciate the micro (as opposed to macro) properties of the letterforms by focusing on the presence of nature and the human hand and not so much the content of the sign itself. This is the reason that the letters are not completely abstracted.\n\nTo this end the “document, appreciate, and recontuxtualize” components are not the same things, but equal parts of an inseperable process. if i had stripped the recontextualize portion from this process we would probably be seeing the full sign. However for me the crop and composition play an essential role in allowing the viewer (typographer or otherwise) to appreciate the work on a formal/sensory level.\n\n"
    },
    {
      "time": " 3.May.2007 5.52pm",
      "content": "I have never been to most of those places. I do not work with trains, or hand paint exteriors with scriptures. TO be fair, I considered the term “document” lightly on the front of the site, but the pictures document well other things, such as the chemistry of the decomposition, quite well. Brad’s recontextualization (as pretty art stuff)is what creates the value to some of us, as too busy adults, to go and appreciate. It also helps keep me from reading the words in what is a picture, to some extent. Could there be more type-documentation and less recontexting? Sure, but this works well for me. Also, ya can’t beat the price.\n\n"
    },
    {
      "time": " 4.May.2007 6.17am",
      "content": "I think any publisher of typography/graphic design/photography books would be potentially interested. I’ve seen a book once similar to your project but it was presented in an alphabetic way (for each letter there was one photograph & some text about where it was taken & what was special about it). I’ll look it up for you if you like & I can also make a (small) list of publishers from books I own.\n\n"
    },
    {
      "time": " 4.May.2007 6.39am",
      "content": "Brad  \nJust had a cursory glance but a great project. I do take the point about showing complete pictures instead of details, at least for this audience, but the images are neat. For publishers one guy who loves this stuff is Steven Heller. I won’t speak for him but he should be able to help. He is [here](http://web.archive.org/web/20071126132411/http:/www.hellerbooks.com/index.html)  \nGood luck with it.\n\n"
    },
    {
      "time": " 29.May.2007 10.04pm",
      "content": "Just a quick note to say I just returned from my childhood home of New Orleans and managed to take some photos along the way. The new photos can be seen in the ’Latest Additions’ album—you will notice I am now making a conscious effort to take 2 shots (sometimes more) to satisfy those wishing to see the whole sign as well as those drawn to the more abstracted crops.\n\nSome of the signs in the Newest Additions gallery are the same signs I have photographed before, but I can never resist an opportunity to perhaps look at these in a new way.\n\nTrips to Chicago and Seattle are planned within the next month, so I should have more to add to the site then.\n\nThanks again for all the kind words and suggestions. The overall response has been quite positive and has given me a new energy for this project. I am still far away from pushing for book publication, but I do have a few ideas of how I would like to see lettermade grow in the future.\n\nRegards,  \nBrad.\n\n"
    }
  ]
}
