{
  "id": "33396",
  "title": "Semi-serif with serifs?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was pondering the influence of contemporary faces on the perceptions of “proper” letter forms. Specifically, the trend to include “some serifs” to distinguish things like the l, 1, I and i in sans faces. Nick mentions the trend [in this other thread](http://web.archive.org/web/20080906232326/http:/typophile.com/node/33301). Another example might be the little right angle hook on some Js.\n\nAre there serifed faces that have begun to draw from this trend? Examples, thoughts?\n\n [‹ Fontexplorer x](http://web.archive.org/web/20080906232326/http:/www.typophile.com/node/33429 \"Go to previous forum topic\") [Nod ›](http://web.archive.org/web/20080906232326/http:/www.typophile.com/node/33434 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906232326/http://www.typophile.com/user/13605\" title=\"View user profile.\">Choz Cunningham</a>",
  "time": "<br>",
  "uid": "13605",
  "comments": [
    {
      "time": " 29.Apr.2007 7.29pm",
      "content": "I suppose another related inquiry is, are there effective examples of these “load-bearing” semi-serifs being used in high resolution media where a more classical sans would have had equal clarity and similar connotation?\n\n"
    },
    {
      "time": " 29.Apr.2007 11.48pm",
      "content": "Load-bearing:\n\nThe special issue of Wired that came out in the mid-nineties, very texty — lots of spreads with just a few sentences of really huge body copy — set entirely in TheMix.\n\nAlso, annual reports of that era set in FF Letter Gothic Text, which is the proportionally-spaced version of what is primarily a monospace design.\n\n"
    },
    {
      "time": " 30.Apr.2007 5.44am",
      "content": "By those dates are you suggesting that it is an artifact of mid-90’s design, or a quick trend come and gone?\n\nBecause screen resolution is still dismal, I am assuming the “edge” of design is still on paper.\n\n"
    },
    {
      "time": " 30.Apr.2007 8.36am",
      "content": "_By those dates are you suggesting that it is an artifact of mid-90’s design, or a quick trend come and gone?_\n\nCan’t say.  \nThose are uses that quickly came to mind, probably because one tends to remember something from when it first registers as a phenomenon. I doubt whether such things would strike me as being so noteworthy now.\n\n"
    },
    {
      "time": " 30.Apr.2007 8.42am",
      "content": "In the case of a typeface like ’Meta’ I wouldn’t call this ’some serifs’ — the diversification of uc i en lowercase l in sans serifs has a long tradition: Johnston’s London Underground comes to mind…\n\n"
    },
    {
      "time": " 30.Apr.2007 12.54pm",
      "content": "The earliest case I know of somebody explicitly mixing up  \nserifs for reasons of functionality is Otl Aicher in Rotis.\n\nThings like a curl in the “el” don’t qualify, I don’t think.\n\nhhp\n\n"
    },
    {
      "time": " 30.Apr.2007 1.16pm",
      "content": "Koch Antiqua is an example of a serif face with a few “missing” serifs, and other early 20th century faces, eg Parsons, have semi-serifs.\n\n"
    },
    {
      "time": " 30.Apr.2007 6.54pm",
      "content": "Unlike i or l, the serif in G seems much more accepted in a sans serif font. Similarly, the tail of the t is also very common. Does anyone know about the history of why these adoptions to a pure sans serif font have become more accepted?\n\n"
    },
    {
      "time": " 30.Apr.2007 7.25pm",
      "content": "<cite>Because screen resolution is still dismal, I am assuming the “edge” of design is still on paper.</cite>\n\nAb edge exists on the web, but there seems to be a gap between the kind of designers who create and/or appreciate great edgy digital design and designers who focus on print. In my case I ignore it because I just do not have the time to sift through bas Web 2.0 sites and Flashturbation to find the good stuff.\n\nPersonally I feel that the serifs on some characters are just important parts of the character of the letter, particularly _I_. While they may have originally appeared to clean up rough stroke ends or simply as ornament, I feel like they have become an integral part of some letters over time and that we are often better off when some of those critical serifs, tails, and loops are left in.\n\n"
    },
    {
      "time": " 30.Apr.2007 7.55pm",
      "content": "In fact seeing letters are skeletons that may or may not  \nhave serifs tacked on is very artificial and short-sighted.\n\nhhp\n\n"
    },
    {
      "time": " 1.May.2007 10.22pm",
      "content": "I would say that letters themselves are artificial, so the negative connotation you imply is needless. I would have to say, from my limited experience, that the skeleton approach is just one of many methods, and has some validity.\n\n"
    }
  ]
}
