{
  "id": "33405",
  "title": "rounded corners punchcut",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anybody if there's some kind of paper puncher to make rounded corners available for home use? I've drawn a simple example of what I mean (hope it's obvious enough to illustrate what I'm thinking off).  \nIf not, I hereby proclaim the patent on this idea ;-)\n\n| Attachment | Size |\n| --- | --- |\n| [Punchcut.gif](http://web.archive.org/web/20111224062654/http:/typophile.com/files/Punchcut.gif) | 4.72 KB |\n\n",
  "author": "<a href=\"/web/20111224062654/http://typophile.com/user/13099\" title=\"View user profile.\">ill sans</a>",
  "time": "<br>",
  "uid": "13099",
  "comments": [
    {
      "time": "",
      "content": "in the states you can find these types of things at scrapbooking stores.\n\n"
    },
    {
      "time": "",
      "content": "I've never seen anything like this, but I'll keep on searching then.  \nDoes it have a special name that you're aware off?  \nToo bad about the patent though ;-p\n\n"
    },
    {
      "time": "",
      "content": "Corner rounder? I used one to round the corners of 500 wedding announcements. Got quite the bruise on my palm.\n\n"
    },
    {
      "time": "",
      "content": "Do a Google search for Rounded Corner Punches. Most craft stores carry them, usually the radius is .25\" or .5\". Also if you have a lot of stuff to punch, you could probably stop by your local printer and see if they'll do it for you. Usually, they'll do it for free.\n\n"
    },
    {
      "time": "",
      "content": "Fiskar's is probably the best known name -- their stuff is pretty high-quality....\n\n"
    },
    {
      "time": "",
      "content": "Thanks guys!\n\n"
    },
    {
      "time": "",
      "content": "There's always fingernail clippers...\n\n"
    },
    {
      "time": "",
      "content": "LOL eliason, the problem with fingernail clippers would be to get the paper ligned up perfectly not to get \"dents\" or semi-rounded corners. But thanks for the tip anyway! I've already been out & hàve found a few ornamental corners punchers, but no regular rounded one. Since tomorrow all stores will be closed, I'll go check out some more stores on wednesday. Wish me luck!\n\n"
    },
    {
      "time": "",
      "content": "Linda's right, I picked up a Fiskar Round Corner Punch from Staples a few years ago. Forgot I had it, and just found it buried in my art supplies. It's nice, but like Stephen says, it's murder on your hands after a few punches.\n\nSeriously, if you have a lot of corners to round, hit up the printers, they'll either have a slab press that have a corner rounder thing on it, or they might have a small appliance that's operated by foot pressure and they'll probably let you do the work.\n\n"
    },
    {
      "time": "",
      "content": "Friend of mine converted their drill press to hold a dowel where the drill would be and built a small jig for the punch and to line up the papers -- that's about the only way I'd ever do more than a dozen or so.... ;-)\n\n"
    },
    {
      "time": "",
      "content": "Fiskars does indeed make high quality stuff. I am _still_ using the pair of orange-handled scissors I bought in 1972, and have never had them sharpened. Admittedly I never use them to cut chipboard, plastic, etc. but still . . . pretty amazing that they have kept their edge for so long.\n\n"
    },
    {
      "time": "",
      "content": "Try contacting Blade Rubber in the UK. We have exactly the tool you're  \nlooking for in our studio, and I'm pretty sure you can get them at this shop.\n\n[http://www.bladerubberstamps.co.uk/onlinesales/shop.php?category\\_id=12](http://web.archive.org/web/20111224062654/http:/www.bladerubberstamps.co.uk/onlinesales/shop.php?category_id=12 \"http://www.bladerubberstamps.co.uk/onlinesales/shop.php?category\\_id=12\")\n\n"
    },
    {
      "time": "",
      "content": "Wow, thanks for all the links and information. I'm looking for a cheap one for personal use (greeting cards and such). I'll probably never have to do more than 20 at a time tops, so it'll be pretty gentle on my wrists ;-)\n\n"
    },
    {
      "time": "",
      "content": "I found some similar to the bladerubberstamp ones, but not the regular corner :-( But I'm pretty sure I'll be able to find it now though.\n\n"
    },
    {
      "time": "",
      "content": "Found this at Fiskars.com : [Combo Corner Punch](http://web.archive.org/web/20111224062654/http:/www.fiskarsschool.com/tools/kid-friendly-crafting/combo-corner-punch/default.aspx)\n\n[Rounder Corner-Edger](http://web.archive.org/web/20111224062654/http:/www.fiskarscrafts.com/tools/t_rounder-corner-edgers.aspx)\n\nI couldn't find the simple round corner punch though. But, if you're trying to spruce up a gift card there are decorative corner punches too.\n\n"
    },
    {
      "time": "",
      "content": "Yeah, I did find the more decorative ones, but I'm a big fan of rounded corners (in my designs) & would like to have a device to add the effect to the paper instead of having to leave some white spacing around the edges to give it that rounded corner look.  \nI do like some of the more decorative ones as well, but I usually make very simplistic, geometric drawings, so I'd prefer a simple corner punch. But at least I know now these things exist & I'm sure I'll find one to my likings soon. Too bad the stores are closed tomorrow ;-)\n\n"
    },
    {
      "time": "",
      "content": "No luck today either :-(  \nI've walked around the entire city looking for possible stores that might carry these corner punchcuts (I even went to a toystore since they sometimes have arts & crafts supplies as well), but all I could find was the decorative corner punchers... Even AVA (which is a wellknown arts & crafts supplies wholesale store chain in Belgium) didn't have them. in the last store (where they had the decorative ones BTW) I asked if they could order it, but sales(wo)men tend to get kind of crabby around closing time apparantly.  \nI'll be going to Antwerp next week & I know a few adresses there where they might have it, so wish me luck!\n\n"
    },
    {
      "time": "",
      "content": "You might try this letter sized paper from [Southworth](http://web.archive.org/web/20111224062654/http:/www.southworth.com/catalog/product_info.php?cPath=5&products_id=97&osCsid=052af239cef7d46deacafa4d2e80fca5).\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the link, GraphicFuzz, but I actually need it for custom labels & such. I'm putting my hopes on Antwerp (I know quite a few stores there that might have it).\n\n"
    },
    {
      "time": "",
      "content": "I guess you're selling your soul at a discount as well, huh?  \nGo advertise somewhere else!\n\n"
    }
  ]
}
