{
  "id": "33407",
  "title": "Looking for a sans serif w/ an italicized lc 'e'",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Sorry I don’t have an example. I’m pulling from the collective pool here. I’m looking for a Sans Serif where the standard e is styled like an italicized _e_. I’ve seen examples around, the most recent was the text on the back of the Arrested Development DVD case. I don’t have it, or I’d scan and post (Google only had front covers and everything is in UPPERCASE).\n\nAny suggestions would be helpful.\n\n [‹ (x) Looking for an italicised font w/ swashed 'w's - various {gang}](http://web.archive.org/web/20080907050011/http:/www.typophile.com/node/33556 \"Go to previous forum topic\") [(x) The Guardian typefaces - proprietary {Edward Maddison} ›](http://web.archive.org/web/20080907050011/http:/www.typophile.com/node/33231 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907050011/http://www.typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 30.Apr.2007 7.56am",
      "content": "Jeremy Tankard’s Aspect has an e like that.\n\nNick Cooke\n\n"
    },
    {
      "time": " 30.Apr.2007 9.17am",
      "content": "Do you mean like a Venetian ’e’ with angled horizontal?\n\n[ITC Legacy Sans](http://web.archive.org/web/20080907050011/http:/www.fontshop.com/fonts/downloads/monotype/itc_legacy_sans_std/)  \n [California Sans](http://web.archive.org/web/20080907050011/http:/www.myfonts.com/fonts/bagraphics/california-sans/?refby=typographica)\n\n"
    },
    {
      "time": " 30.Apr.2007 9.23am",
      "content": "Ahh, I think they used [Triplex Sans](http://web.archive.org/web/20080907050011/http:/www.fontshop.com/fonts/downloads/emigre/triplex_sans/) for the Arrested Development art.\n\n"
    },
    {
      "time": " 30.Apr.2007 9.28am",
      "content": "Triplex has the e I’m looking for. Are there other Sans Serifs that have a similar e as well?\n\n"
    },
    {
      "time": " 30.Apr.2007 9.53am",
      "content": "[ITC Atelier Sans](http://web.archive.org/web/20080907050011/http:/www.fontshop.com/fonts/downloads/itc/itc_atelier_sans/)\n\n"
    },
    {
      "time": " 30.Apr.2007 10.09am",
      "content": "ITC Atelier Sans and Triplex Sans are very identical. But, I like the simplistic form of JTT’s Aspect, which is more of what I was hoping to find. And it all hinges on that e. It’s strange how few Sans there are that stylized e.\n\nAny more suggestions?\n\n"
    },
    {
      "time": " 30.Apr.2007 10.42am",
      "content": "Choosing a typeface based on one character is inadvisable. It might be better to choose the typeface that works best and then edit the ’e’ so it’s exactly as you want it.\n\n"
    },
    {
      "time": " 30.Apr.2007 10.55am",
      "content": "True. It’s weird, I can imagine the text but I can’t remember where I saw it or what it’s for and for this I should apologize. I shouldn’t be asking for a type identification without proper examples. I was hoping the braintrust here at Typophile could help. It’s not a live or die situation though. I do appreciate the suggestions that have been made by Stephen and Nick.\n\n"
    },
    {
      "time": " 30.Apr.2007 11.43am",
      "content": "Could it have been HOW magazine using [Parisine Plus](http://web.archive.org/web/20080907050011/http:/www.typofonderie.com/alphabets/view/ParisinePlus)?\n\n"
    },
    {
      "time": " 30.Apr.2007 11.58am",
      "content": "That’s close but the e has a sharp corner. Are there any Sans where the e is almost a complete circle (not sure if that’s actually right.) It’ll look like an uninterrupted stroke, very fluid without any pinch points, not necessary an perfect circle, but close.\n\n"
    },
    {
      "time": " 30.Apr.2007 12.13pm",
      "content": "Ok, it wasn’t clear if you were looking to identify something or for a recommendation.\n\n"
    },
    {
      "time": " 30.Apr.2007 12.23pm",
      "content": "Right now, it’s purely for my benefit. I’ve been noticing this style “e” for a while now and every time I see it I want to ask about it, but of course it’s always when I’m away from my computer and when I do get back to the computer, I usually forget to ask with a relevant example in mind. The style looks fresh and new, and I just assumed it could be a new face that’s starting to get popular. Hence the picky nature of getting as many suggestions as possible.\n\nHopefully I see another example or remember where I’ve seen them in the past and put a decent sample to be ID’ed.\n\nI do appreciate all the responses and I’m sorry this is a wild goose chase.\n\n"
    },
    {
      "time": " 30.Apr.2007 4.16pm",
      "content": "[Parisine Plus](http://web.archive.org/web/20080907050011/http:/www.typofonderie.com/alphabets/view/ParisinePlus) from PTF has a nice e similar to what you are looking for ... I believe.\n\n"
    },
    {
      "time": " 30.Apr.2007 8.11pm",
      "content": "This sounds like we could go around in circles on this one, since we don’t really know the look you are after. You can use the [Sans Serif Font ID Guide](http://web.archive.org/web/20080907050011/http:/bowfinprintworks.com/SansIDPage.html), and search for all the style codes that use the non-horizontal crossbar on the ’e’, starting with Codes 1 and 3 and working your way down the pages.\n\nMaybe that will help you pick something according to the look.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 30.Apr.2007 11.45pm",
      "content": "Kabel might have the look you are thinking about.\n\n[http://www.myfonts.com/fonts/linotype/itc-kabel/](http://web.archive.org/web/20080907050011/http:/www.myfonts.com/fonts/linotype/itc-kabel/ \"http://www.myfonts.com/fonts/linotype/itc-kabel/\")\n\n"
    },
    {
      "time": " 1.May.2007 7.42am",
      "content": "You’re right Mike, I should just wait till I see another example of it and remember to post for ID. It’s hard to describe a font without an example and based on a single character from memory.\n\nFor all I know, it might have been an italic e that I thought was a standard e anyway.\n\nThanks for all the responses everyone. I do appreciate the attempt.\n\n"
    },
    {
      "time": " 3.May.2007 11.16am",
      "content": "The previous suggestions reminded me of [Sassoon Sans](http://web.archive.org/web/20080907050011/http:/www.identifont.com/show?3XL).\n\n"
    },
    {
      "time": " 3.May.2007 11.52am",
      "content": "Wow, that’s the “e” I’m looking for and it’s attached to a family that’s not overly ornate. Thanks Florian.\n\n"
    }
  ]
}
