{
  "id": "33425",
  "title": "Hebrew Font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I need a classical opentype font that supports both Western and [Hebrew](http://web.archive.org/web/20150326031448/http:/typophile.com/wiki/Hebrew) encoding. It is intended to use that font for reciting biblical texts, so I need a hebrew font that also supports accents.\n\nAny suggestion is highly appreciated.\n\nMany thanks,  \nCarlo\n\n",
  "author": "Monoecus",
  "time": "1 May 2007 — 12:54am",
  "uid": "11193",
  "comments": [
    {
      "time": "1 May 2007 — 8:37am",
      "content": "Typophiler and multiscript expert John Hudson has done [SBL Biblical Hebrew](http://web.archive.org/web/20150326031448/http:/www.bible-researcher.com/sblhebrew.html), which is free.\n\nTypophiler [David Hamuel](http://web.archive.org/web/20150326031448/http:/www.myfonts.com/search?search%5Btext%5D=David+Hamuel) has recently released a number of beautiful Hebrew fonts. I don't know if they have cantillation marks.\n\n[MasterFont](http://web.archive.org/web/20150326031448/http:/www.masterfont.co.il/) is I think the biggest Hebrew foundry, and some of their fonts have the Bibilical cantillation marks in them. [Fontbit](http://web.archive.org/web/20150326031448/http:/www.fontbit.co.il/) is another Hebrew foundry with many fonts.\n\n"
    },
    {
      "time": "1 May 2007 — 10:12am",
      "content": "Thank you Bill. No, no cantillation marks. I don't think you'll find retail font with cantillation. So, I'll go with SBL or Adobe Hebrew (InDesign CS2 ME).\n\n"
    },
    {
      "time": "1 May 2007 — 7:29pm",
      "content": "Adobe Hebrew does not support cantillation, only vocalisation.\n\nThe current release version of SBL Hebrew does not include Latin characters, only Hebrew. The next version (v2.00) will include Latin characters from the SBL BibLit to provide accurate codepage support. But depending on the style of Latin you are looking for and the kind of relationship to the Hebrew, you might be able to find a good companion font for the current version of SBL Hebrew.\n\n"
    },
    {
      "time": "1 May 2007 — 8:17pm",
      "content": "Oh, another way to go that is not open type, but will do Latin, Hebrew vowels and cantillation markes is are the dedicated bilingual word processors, [Davka Writer](http://web.archive.org/web/20150326031448/http:/www.davka.com/cgi-bin/product.cgi?product=367) and [Dagesh](http://web.archive.org/web/20150326031448/http:/www.jewishsoftware.com/products/Dagesh_Pro_IV_52.asp).\n\nThe problem with these is that offset printers may not be able to use their files. If you are only printing out things on a laser printer for small distribution, then these programs are very useful.\n\n"
    },
    {
      "time": "1 May 2007 — 10:40pm",
      "content": "\\> Adobe Hebrew does not....\n\nahh, I know :) (or Adobe Hebrew (InDesign CS2 ME) -- opentype font that supports both Western and Hebrew encoding)\n\n\\> If you are only printing out things on a laser printer for small distribution....\n\nor Publish to PDF (Dagesh)\n\n"
    },
    {
      "time": "2 May 2007 — 1:59am",
      "content": "Many thanks David, William and John. I am surprised that there are not more commercial fonts including hebrew. Whereas Adobe and many others now publish their new fonts with Greek and Cyrillic letters, Hebrew is unfortunately still rare. Maybe the market is just too small.\n\nNevertheless, many thanks for your helpful comments,  \nCarlo\n\n"
    },
    {
      "time": "2 May 2007 — 6:49am",
      "content": "\\>not more commercial fonts including hebrew.\n\nThere are tons of commercial Hebrew fonts. As I said there are many fonts from MasterFont, FontBit, and indivivual designers like David Hamuel and John Hudson. Also sets of fonts, both Hebrew and Latin that come with both Davka Writer and Dagesh. What is harder to come by is those fonts that do not just nikud (vowel points) but also the cantillation marks. Since this is only used in Bible texts, it is more specialized. However, Davka Writer and Dagesh both have the capacity to put in cantillation marks.\n\nAs to what Latin to match to what Hebrew, that is more or less a creative decision you will have to make.\n\nAlso I am not clear when you say 'recite' Bible texts whether you meant 'chant' using cantillation marks, as I had supposed, or simply read out phonetically, in which case just the vowel points (nikud) will do, and many Hebrew fonts have these. MasterFonts, for example, has 50 opoen type fonts that they say will perfectly place Nikud. John Hudson's and David Hamuel's fonts will also do this very well.\n\n"
    },
    {
      "time": "2 May 2007 — 1:56pm",
      "content": "\\> that is more or less a creative decision\n\nIt's more a technical decision.  \nYou have to understand how scripts are built and used deep down.\n\nhhp\n\n"
    },
    {
      "time": "10 Jun 2007 — 9:52am",
      "content": "FontWorld ( [www.fontworld.com](http://web.archive.org/web/20150326031448/http:/www.fontworld.com/ \"www.fontworld.com\")) is releasing a professional Biblical Hebrew publishing package for Macintosh or Windows that has both traditional and semi-modern Hebrew font designs (FrankReuhl and Hadasa, in regular and bold). They also feature two different kinds of shva-na characters (popularly used by different publishers), the komatz katan and the hataf komatz katan.\n\nFontWorld also offers a broader range of Biblical Hebrew fonts (Vilna in various weights) for typesetting projects at competitive prices.\n\n"
    },
    {
      "time": "3 Aug 2008 — 10:27am",
      "content": "FontWorld has released this already.\n\n"
    },
    {
      "time": "15 Oct 2010 — 11:29pm",
      "content": "[Many thanks David, William and John. I am surprised that there are not more commercial fonts including hebrew. Whereas Adobe and many others now publish their new fonts with Greek and Cyrillic letters, Hebrew is unfortunately still rare. Maybe the market is just too small.](http://web.archive.org/)\n\nNevertheless, many thanks for your helpful comments,  \nCarlo\n\nIt's a lie. There're more Hebrews font in Windows 7. Arial, Lucida Sans, Segoe, Verdana have Hebrew characters. I got many script, displau, futuristic, etc Hebrew fonts from Wazu, they're all free. Here's the link:\n\n[http://www.wazu.jp/gallery/Fonts\\_Hebrew.html](http://web.archive.org/web/20150326031448/http:/www.wazu.jp/gallery/Fonts_Hebrew.html \"http://www.wazu.jp/gallery/Fonts\\_Hebrew.html\")\n\n"
    },
    {
      "time": "17 Oct 2010 — 2:52am",
      "content": "It depends to what level of positioning of Hebrew diacritics that you want.\n\nThe best suggestion that has been made is actually DavkaWriter. It exports pdf and there should be no problem with commercial printers (from my experience).\n\nObviously if you want a much higher level of typography, then it's not going to be cheap or easy. Even the Koren typeface is only 99% automatic (VOLT couldn't compile any more code) and you'll need extra software for that 1% (we had some created for in-house use and is in alpha).\n\nSBL Hebrew is also a direction, but for a refined eye on trop, it's not really the answer, but this depends on the use.\n\nFontworld has made some progress, but from their website images, the positioning is no better than SBL Hebrew (not that this is a bad thing, but it's at that level).\n\nThe best solutions are customised I'm afraid and not just out of the box.\n\n"
    },
    {
      "time": "20 Oct 2010 — 6:48pm",
      "content": "\\>\\> Fontworld has made some progress, but from their website images, the positioning is no better than SBL Hebrew (not that this is a bad thing, but it's at that level).\n\nFontWorld's new generation (version 2) provides the high end or Rolls Royce of everything you wanted in a Hebrew/Latin font. They are scheduled for release  \nfor Chanukah 5771, or December 2010.\n\nThey come in two flavors:  \n1) \"Enhanced\", with vowels and the meteg accent mark,  \nwith English and Latin characters;  \n2) \"Biblical Hebrew\", with all vowels and the meteg accent mark,  \nall cantillation marks, two shva-nas, extended characters.  \nwith Yiddish, English and Latin characters.\n\nQuality comes with a price.  \n\"Enhanced\" begins at $299 to $350.  \n\"Biblical Hebrew\" begins at $750 to $5000.\n\nMultiple font discounts apply.  \nSite licenses available.  \nEducational discounts available.\n\nThese fonts are guaranteed to operate fully  \nin Adobe InDesign ME CS3, CS4, CS5 and beyond.\n\nContact 'info@fontworld.com'\n\n"
    },
    {
      "time": "20 Oct 2010 — 8:30pm",
      "content": "Raphael: _SBL Hebrew is also a direction, but for a refined eye on trop, it's not really the answer, but this depends on the use._\n\nI'd be interested to know what you consider the shortcomings or limitations of appropriate use of SBL Hebrew to be. I am aware of some problems with spacing of adjacent letters with multiple dots, which is not optimised in the current versions of the font. I started work on a different approach to these situations, but have not had time to pursue it.\n\nIn general terms, SBL Hebrew seeks to provide mark positioning that corresponds to expectations of scholars working with various editions of the masoretic text, in particular those based on the Leningrad Codex (the German Bible Society BHK and BHS, and Professor Dotan's BHL). I've also cross-referenced with the JPS Tanakh.\n\n"
    },
    {
      "time": "23 Oct 2010 — 10:42pm",
      "content": "Gohebrew, are you serious????? $750 to $5000 dollars????  \nwhich means 3000 to 20,000 Israeli Shekels??????  \nman, on what planet are they living???????\n\nJ.Hudson , your current SBL project is good enough for viewing Biblical text on a screen.  \nI don't think that anyone with basic understanding of hebrew typography would use SBL for print as a first choice.  \nother than that, Remember that Rephael is a YEKE when it comes to these things.\n\n"
    },
    {
      "time": "23 Oct 2010 — 11:21pm",
      "content": "J.Hudson, Let me clearify.  \n2 basic problems with your positioning.\n\nA. the diacritics should always be in place and the Taam after it, only when absolutly necessary you move back or forth the nikud so the nikud and taam work.\n\nB. Nikud and teamim are secondary, you should never insert thin spaces or wide spaces to solve dibukim. doing so results devision of word in to two words.\n\nC. also your basic positioning of single nikud or single taam are ton accurate in some cases.\n\nD. Taam Mukdam should come befor the letter and not alligned to the right of the letter, but that is less important\n\nC. PATAH GANUV should be optional and not forced.\n\nE. the font does not destinguish between holam male and haser.\n\nComments A&B are my main critiques on the SBL\\_Hebrew font.\n\n"
    },
    {
      "time": "24 Oct 2010 — 3:40am",
      "content": "Eli,\n\n\\>\\>\\> Gohebrew, are you serious????? $750 to $5000 dollars????  \nwhich means 3000 to 20,000 Israeli Shekels??????  \nman, on what planet are they living???????\n\nFor low end low quality, there is DavkaWriter.  \nFor non-professionals, there is SBL-Hebrew. Commercial licenses are available to those who seek to publish the SBL non-standard deign.\n\nFont World aims at the customer who intend to make much income from the GH fonts. To them, this is not costly.\n\nThere is also FontBit, Ofek, Masterfont. But the results are hit or miss. You get what you paid for.\n\n"
    },
    {
      "time": "24 Oct 2010 — 3:44am",
      "content": "SBL is beautiful, a result of knowledge and craftmanship. But few if any Jewish publishers would use it.\n\nRaphael, with all his vast knowledge in Hebrew typography is too overwhelmed with Koren's work on his Bible, and ignores many centuries of Jewish publishing.\n\n"
    },
    {
      "time": "24 Oct 2010 — 6:53am",
      "content": "Gohebrew:  \nfontbit has no fonts supporting taamey mikra except Livorno Regular.  \nfrom what i understued from them, it's simply not worth it for them to get involved and givig extreem support. in other words for now they feel they don't need to be the ones solving this issue.\n\nMasterfont have some fonts developed by Yehuda Brum and work much better than what you call \"hit or miss\"\n\nTell me what do you consider quality fonts that make them so much more than the masterfont fonts???\n\nSBL\\_Hebrew is infact a beautiful type face  \nA bold weight would do it good (but again, whats the point if its not made for comercial perposes)\n\n"
    },
    {
      "time": "24 Oct 2010 — 12:54pm",
      "content": "Thanks for the comments re. SBL Hebrew, Eli. These are useful criticisms.\n\nI expect some differences of practice based on different user communities: SBL Hebrew was primarily made for scholars who are either Christians or otherwise working within an academic tradition that has certain expectations based on previous editions and typography (BHK, BHS, etc.), and I do see more movement of vowel+accent combinations as units in that than in Jewish publications.\n\nWith regard to some specific points:\n\n_B. Nikud and teamim are secondary, you should never insert thin spaces or wide spaces to solve dibukim. doing so results devision of word in to two words._\n\nThe method used to avoid mark collisions in the current release versions of SBL Hebrew is indeed crude, and I've never been very happy with it. I've started work on a more refined approach, involving more precise contextual kerning adjustments. In cases where, for instance, two narrow letters both have marks below and these crows each other, what would you consider the preferred solution?\n\n_C. PATAH GANUV should be optional and not forced._\n\nIt is active by default in the OpenType lookups, but can be turned off by selectively disabling the Contextual Alternates OTL feature in e.g. InDesign. There's no way to turn this off in Microsoft apps, but since this typographic feature is standard in the texts the SBL users are most commonly working with, it is expected to be on by default.\n\n_E. the font does not destinguish between holam male and haser._\n\nIt does. See page 16 of the [SBL Hebrew user manual](http://web.archive.org/web/20150326031448/http:/www.sbl-site.org/Fonts/SBLHebrewUserManual1.5x.pdf).\n\n"
    },
    {
      "time": "24 Oct 2010 — 1:33pm",
      "content": "<cite>For low end low quality, there is DavkaWriter.<br>\nFor non-professionals, there is SBL-Hebrew. Commercial licenses are available to those who seek to publish the SBL non-standard deign.</cite>\n\n<cite>Font World aims at the customer who intend to make much income from the GH fonts. To them, this is not costly.</cite>\n\nYou will forgive me, I am a young man, only 65 year old. Somehow, when I left teaching and started a business as a typesetter working in scholarly publishing, I missed the part where scholars made so much money. Perhaps I should start teaching again, to get all those fancy cars, mansions, fine dining, etc..\n\nWhen a fair-sized west coast university press informed us that in order for everyone at their press to keep their jobs, they would, for the time being have to set all their books in house, I offered to help them, for free, any way I could, so they could keep publishing texts more complex that \"see spot run.\"\n\nI know what planet you live on. It is the Ronnie Regan trickle-down one. Too bad not much trickles down.\n\nKudos here belong to John Hudson, who is at least trying.\n\n"
    },
    {
      "time": "24 Oct 2010 — 1:36pm",
      "content": "Eli,\n\nAsk if a Lincoln can match a Honda? But it does the same for less. So, buy a Honda then.\n\nThis is the analogy between Font World's professional quality typeface software, and inexpensive MasterFont fonts. You seem to claim that they work 100% now. I got Narkissim last week, and it had missing glyphs and worked poorly. Bt it was $58 each, 2 for $45 each, and so on\n\nIf you need a font to make you much money, a font that costs you 1% of net is very little. This is high end. Masterfont is for the low end.\n\n"
    },
    {
      "time": "24 Oct 2010 — 1:46pm",
      "content": "Charles,\n\nWelcome.\n\n\\>\\>\\> You will forgive me, I am a young man, only 65 year old. Somehow, when I left teaching and started a business as a typesetter working in scholarly publishing, I missed the part where scholars made so much money. Perhaps I should start teaching again, to get all those fancy cars, mansions, fine dining, etc..\n\nMF, DW, etc. is intended for small budgets, scholars, etc.\n\nFont World is really best suited with profession commercial publishers who don't get concerned about the pricings.\n\nFor scholars or college, the price is reduced usually by 50%.\n\n"
    },
    {
      "time": "24 Oct 2010 — 1:48pm",
      "content": "Btw, many Christian schools who had SBL wanted to upgrade to our versions of FrankReuhl and Hadasa (Henri). The prices were cut in half, and we included site licenses.\n\n"
    },
    {
      "time": "25 Oct 2010 — 1:25am",
      "content": "Gohebrew:  \nI was just askung for toy to point out the differenes between your fonts and masterfont's fonts.  \nwhat are the elements that make your fonts so much better than the masterfont fonts???\n\nYou say you biught the basic font bt masterfont for $58 that is a price for a font supporting Nikud Only.  \naccourdeing to mt knowledge, a font from master font that supports postiong of ttamim cost more like $450 (not including MAM);\n\nanother question to go hebrew.  \nI have a script that goes through the entier TANAKH and checks for dibukim, how do you check for dibukim???\n\n"
    },
    {
      "time": "26 Oct 2010 — 6:56am",
      "content": "Actually $5K is quite cheap if the font really does what gohebrew says it does.\n\nFontbit's Livorna trop was developed for me for a project that I started some years ago and is near completion (not for Koren). The collisions have to be handled though with external scripts (latest incarnation is harbs' glyph mover).\n\nMasterfont can sell you Koren Tanakh Bold with correct nikud positioning (well correct according to me :-) ) which handles 99% of situations, but due to limitations in Volt, there will still be the occasional tweaking. But the price is in the same range as gohebrew.\n\nSorry folks, but these kind of fonts are very expensive for commercial use, but I must reiterate, DavkaWriter does a very good job and is a small fraction of the price, but is a different target audience to those with a budget of $5K for a typeface.\n\n"
    },
    {
      "time": "27 Jul 2014 — 10:02am",
      "content": "Hi Typograph,  \nCould you please provide a link to Livorno Regular?  \nMany thanks\n\n"
    },
    {
      "time": "27 Jul 2014 — 10:27am",
      "content": "Alphabetum Unicode is $15, and includes cantillation marks, although I can't say how well it works. Code 2000, also shareware for $5, does also. And Ezra SIL, Marin, and SBL Hebrew, which are free, include cantillation marks as well.\n\nThese are all mentioned and linked to from the Wazu site mentioned above.\n\n"
    },
    {
      "time": "28 Jul 2014 — 3:28pm",
      "content": "@elfersi: [http://www.fontbit.com/commercial/fonts/new-livorno-mf-medium.htm](http://web.archive.org/web/20150326031448/http:/www.fontbit.com/commercial/fonts/new-livorno-mf-medium.htm) (Ware: I do not know if this is the exact one mentioned above or a reworked version.)\n\n"
    }
  ]
}
