{
  "id": "33437",
  "title": "Typesetting series codes in copy",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm doing a brochure for my theatre company, and I'm finally using a full-featured typeface. In certain places, we have copy including series codes:\n\n<cite>Choose series D3, F1, or F4.</cite>\n\nGiven that I'm using OSF in copy throughout, how should I set these series codes?\n\n1. cap letter + lining figure\n\n2. small cap letter + OSF\n\n3. some other way (please detail)\n\nThanks!\n\n",
  "author": "cheshiredave",
  "time": "1 May 2007 — 11:28am",
  "uid": "1112",
  "comments": [
    {
      "time": "1 May 2007 — 11:45am",
      "content": "Would be nice if the font had smallcap and lining small cap figs ... does it?\n\n"
    },
    {
      "time": "1 May 2007 — 11:59am",
      "content": "No, unfortunately. I was surprised that it didn't have lining small cap figs -- that's what I would have gone for had it been in there. Bummer!\n\n"
    },
    {
      "time": "1 May 2007 — 12:01pm",
      "content": "I could try to fake it by bumping up the size of denominator numerals of a lighter weight, but that's pretty dicey...\n\n"
    },
    {
      "time": "1 May 2007 — 12:04pm",
      "content": "Will thoses series codes be placed in table? If so, I do not suggest using the lining figure. To my point of view it's hard to read the lining figure and they are often not aligned one towards the other. But sometimes it could be nice too. Could you show us few samples?\n\n"
    },
    {
      "time": "1 May 2007 — 2:55pm",
      "content": "They are elsewhere in the brochure in a table, but here they're in text.\n\n"
    },
    {
      "time": "1 May 2007 — 4:40pm",
      "content": "Chesh I know I'll be against what others think, but in this instance I think lining figs would be best. it is information not prose.\n\n"
    },
    {
      "time": "1 May 2007 — 4:46pm",
      "content": "I decided in favor of lining as well. I used the same idea as when to use small caps as dictated by the Chicago Manual of Style: two or three capital letters stay capped; any more than that at once, use small caps. It seemed as good a guideline as any.\n\n"
    },
    {
      "time": "1 May 2007 — 4:53pm",
      "content": "In some ways, it might depend on the theater company -- using small caps with oldstyle numbers has a certain look -- more literary. Full caps with lining figures looks more like the social sciences, or accounting. If this isn't a financial statement, I'd go with sc/os figs. In short, think about what the audience might expect or appreciate.\n\n"
    },
    {
      "time": "1 May 2007 — 9:10pm",
      "content": "As much as I love OSF, you really do want to use lining figs here, and the small caps.\n\nMy first editing instructor, who we all referred to as \"The Goddess of Words,\" always suggested going with Chicago when in doubt. ;-)\n\n"
    },
    {
      "time": "2 May 2007 — 5:01am",
      "content": "<cite>My first editing instructor, who we all referred to as “The Goddess of Words,” always suggested going with Chicago when in doubt</cite>\n\nThe emphasis here should be \"when in doubt.\" Slavishly following the Chicago Manual doesn't even make you a genius, let alone a Goddess.\n\nFor what it is worth, the Chicago manual gets worse and worse the farther removed they get from editing and the closer to typography. When we were writing the <cite>Glossary of Typesetting Terms,</cite> which Chicago published, they kept pointing out that some of our definitions & comments ran counter to what was in the manual. We had to keep pointing out that the manual was wrong.\n\nI have profound respect and gratitude for Chicago's editors for improving the writing, and for establishing a good style for citation. I don't have much respect for their understanding of typography. Unfortunately, The University of Chicago Press is one of those publishing houses where the editorial department gets final say on design matters. A strong case, well presented, will occasionally sway the editors -- during his tenure as Design & Production manager at Chicago, Cameron Poulter was sometimes able to do this -- but anything less falls on ears disinclined to listen. This attitude removes a channel of information & correction between typographers and editors, and it isn't found only at Chicago.\n\nI would have expected more concern for typography on a site dedicated to type.\n\nAnd by the way, this is the first time I have ever seen anyone recommend small caps and (full) lining figures.\n\n"
    },
    {
      "time": "2 May 2007 — 6:49am",
      "content": "I think small caps and full lining figs would look strange. I'd say in the interest of clarity to use full caps and lining figs, but perhaps reduce them a point or two from the body type so they don't pop out too much.\n\n"
    }
  ]
}
