{
  "id": "33448",
  "title": "Logo Help for Self-Promotion",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi All,\n\nI’m developing my personal identity. The logo is narrowed down to a few versions of the same basic idea. I’m mostly looking for formal and aesthetic comments, but everything is welcome. I don’t really want to give any description of the concept; out in the real world, the viewer will be on their own to determine what it expresses, so why manipulate others’ reactions now? I’m very interested in what everyone thinks of the graphic, what impression it gives off, and how it’s crafted.\n\nThanks!  \nJim\n\n—  \nJim Hargreaves  \nMA Graphic Design  \nSavannah College of Art and Design\n\n| Attachment | Size |\n| --- | --- |\n| [jh01.jpg](http://web.archive.org/web/20080118115519/http:/typophile.com/files/jh01.jpg) | 10.27 KB |\n| [jh02.jpg](http://web.archive.org/web/20080118115519/http:/typophile.com/files/jh02.jpg) | 7.91 KB |\n| [jh03.jpg](http://web.archive.org/web/20080118115519/http:/typophile.com/files/jh03.jpg) | 11.49 KB |\n| [jh04.jpg](http://web.archive.org/web/20080118115519/http:/typophile.com/files/jh04.jpg) | 8.39 KB |\n\n [‹ Dance Company Logo](http://web.archive.org/web/20080118115519/http:/www.typophile.com/node/33409 \"Go to previous forum topic\") [Modern Logotype - Analog Roots ›](http://web.archive.org/web/20080118115519/http:/www.typophile.com/node/35294 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080118115519/http://www.typophile.com/user/12496\" title=\"View user profile.\">jimsbee</a>",
  "time": "<br>",
  "uid": "12496",
  "comments": [
    {
      "time": " 2.May.2007 12.53am",
      "content": "I like \\_01 best, though I couldn’t say which variant. It’s well crafted and I like the type treatment. The only sure message it sends me is that you would like your name to be pronounced “har-gree-ayves”. As for the mark, it seems exceptionally neutral, evoking nothing and just being a design - and since you’re selling design, I guess that works.\n\n"
    },
    {
      "time": " 2.May.2007 1.17am",
      "content": "I like \\_03 best. I think it looks a more confident mark.  \nI generally prefer logos where the type and icon interact with each other, and are’nt separate parts. With \\_01 and \\_02 if the purpose of this project is a visual device to promote your name, then the size ratio between the type and icon needs attention.\n\nYou have another design element of the ’-’ symbol above the ’a’, not sure what this is telling me?\n\nAlso for \\_03 I think you should spell out your full name and not the initial.\n\n"
    },
    {
      "time": " 2.May.2007 4.13am",
      "content": "I like number 1, the one in the middle best. Looks really nice, I’d like to see that one with the none-filled corners rounded like the inside of the filled ones, to see if it improves it or not. The ã bothers me when the j and i dosen’t have any dots.\n\nI think number 2 would be better if the “flower” would be filled instead of just having a stroke.\n\nI like number 3 the least.\n\nNice examples though.\n\npeter\n\n"
    },
    {
      "time": " 3.May.2007 9.46pm",
      "content": "Initially \\_03 was the one I liked the most think the placement and the serif type sold me to it, however i dont understand the bag (in case thats a bag) or the frame outside it, on a second look I liked \\_02 best i feel it more generic, and still comunicating the same. however i wonder about the icon placement perhaps tilting it up a notch.\n\n ![](http://web.archive.org/web/20080118115519im_/http:/www.typophile.com/files/jh02_4224.jpg)\n\nI would like to know what the frame in comp\\_03 means though.\n\nmy2cents\n\nMak Gutierrez\n\n"
    },
    {
      "time": " 4.May.2007 5.13pm",
      "content": "This is why logos ought to be designed in single color. Others think the symbol is a flower. I thought it was an orange slice. If that’s the case, I imagine this is about “fresh” design or something. I also see a hub and partnership. Let us know if this was intended or not.\n\nI’d like to see the type (from 02 as well) made a little less neutral. I’m not sure I feel much relationship between it and the symbol. And, like the others, I’d like to know what the macron over the ’a’ is about.\n\n"
    },
    {
      "time": " 4.May.2007 8.29pm",
      "content": "I agree that it’s a finely constructed mark that conveys simplicity, sophistication, and freshness.\n\nI’m cursed with corny shape associations ... so take what I say with a grain of salt from this point forward. Stupidly, I see the orange/flower as as a Trivial Pursuit game piece. (Maybe I’m just bitter for sucking at Trivial Pursuit.)\n\nThe examples that are “framed”, my crazy brain sees a piece of toast, which makes the “flower” a rather distinctive burn pattern embossed by a novelty toaster.\n\nI hope Dr. Phil isn’t reading this.\n\n"
    },
    {
      "time": " 24.Jul.2007 2.17pm",
      "content": "I love the second version in the last set you’ve shown. Having the shape a little above the name gives it a lot of interest and is unique.\n\n"
    }
  ]
}
