{
  "id": "3345",
  "title": "A font of boumas",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "LettError has released a couple of (ironic) free fonts:   \n [http://www.letterror.com/foundry/goodies/index.html](http://web.archive.org/web/20131020085807/http:/www.letterror.com/foundry/goodies/index.html)   \n   \nWhat's interesting about the \"Printed\" one is that the   \nglyphs are boumas (or actually instances of boumas).   \n   \n(BTW, last month I started working on some simple animations of what happens to words as they're perceived at increasing distances from the point of fixation, and the results look just like those glyphs! They probably used GaussianBlur then Threshold, via an Action script, and probably some more automation to get it into a font.)   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "17 Sep 2002 — 3:51pm",
  "uid": "1250",
  "comments": [
    {
      "time": "17 Sep 2002 — 10:11pm",
      "content": "I think LettError missed the mark on this one. At least in the presentation - which is a surprise, for them. What are these? Tiny, tiny blobs? What do you do with them? Can we see these at handwriting size, please?   \nHrant: your bouma idea is way ahead of its' time. If you can really convincingly start to show people that this is really the way they are reading then you may start off some kind of offshoot revolution in type design. Perhaps it only means letters are kerned differently, or perhaps it means a font requires Xthousand ligatures. How do you think the bouma approach might affect type design?   \nAnd by the way, I'm open to any discussion here, but I think the bouma movement got off on the wrong foot with yet another example of bad nomenclature. Boomer??\n\n"
    },
    {
      "time": "18 Sep 2002 — 5:54am",
      "content": "Hey!   \n   \nWhat's \"Bouma\"?   \n   \nDictionary.com gave me:   \n\"No entry found for boumas.\"   \n   \nRamiro.\n\n"
    },
    {
      "time": "18 Sep 2002 — 6:58am",
      "content": "Ramiro --   \n   \n\"Bouma\" is a term that Hrant made up. He uses it to mean \"word gestalt\" or \"word shape.\" I believe he derived the word from the name of a pioneer in legibility/readability research.   \n   \nI'll take this opportunity to point out, and regular Typophiles should take note: There are a number of terms that Hrant uses that are unique to him and will not be recognized outside of the various Typo-lists where he holds court. (_Bicameral 'g'_ is another Hrantism that comes quickly to mind.) It's a part of his iconoclastic -- how shall I say? -- charm??   \n   \nAnd, hey, there's nothing really wrong with this; that's how new words get coined. (I personally happen to dislike / disagree with / find irritating his use of some words -- like _bicameral_ -- but that's a different matter.) Perhaps through persistent use he will manage to get some of them to become generally accepted.   \n   \nBut I think it's important to remember, every now and then, that for the time being these terms remain personalized jargon.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "18 Sep 2002 — 9:56am",
      "content": "Hrant - we're expecting daily updates from ATypI. Watch out for flying boumas.\n\n"
    }
  ]
}
