{
  "id": "33467",
  "title": "Exhibition Type - Vinyl Cut Help",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm helping a friend with a photographic exhibition, laying up all the text for the wall of the gallery.\n\nI have to set the type in Helvetica Neue. It will be black on a white wall.\n\nAre there any special tips/tricks to this?\n\nWhat would be the smallest point size?\n\nIs applying the Vinyl tricky?\n\nAny help would be greatly appreciated\n\n",
  "author": "vonslam",
  "time": "2 May 2007 — 5:44pm",
  "uid": "15667",
  "comments": [
    {
      "time": "2 May 2007 — 6:00pm",
      "content": "Helvetica?! Ah, a photographer. Then it should be fine...\n\nhhp\n\n"
    },
    {
      "time": "2 May 2007 — 6:00pm",
      "content": "What kind of vinyl are you using? Some are easier than others.... :-) You want to make sure your horizontal cuts are perfect, and if you get access to a laser level, it will be of great assistance.\n\nI wouldn't set anything smaller than 12/16 (unless it's some sort of reference number of a picture from an outside source) and the top of the label no higher than a meter/40\", otherwise you will alienate people with bifocals.\n\n"
    },
    {
      "time": "3 May 2007 — 12:18pm",
      "content": "On a general level 10mm cap height is advised as the minimum, mainly because weeding it can be a ’mare, also vinyl cutting machines are rarely 100% accurate (±15% in some cases).\n\nTim\n\n"
    },
    {
      "time": "3 May 2007 — 4:55pm",
      "content": "Hey! Here is something I actually know about.  \nUnfortunately much of it has been said aready.\n\nlet's see... where to start...\n\nOK, I assume you'll be applying these to interior walls. Make sure the paint on the walls has dried thoroughly and that the surface is grease free.\n\nAs for text, anything smaller than 18pt I really wouldn't recommend, but consider the typical viewing distance and adjust accordingly. Sometimes you have to go smaller.\n\nWhen weeding text that is less than a half inch high:  \nfirst only pull out the counters from the letters,  \nthen make cuts through the vinyl, but not the release liner, between the lines of text.  \nApply transfer tape over the text block, including the remaining waste vinyl (being careful to apply smoothly with no bubbles or wrinkles) and remove the release liner.\n\nLay the transfer tape with the vinyl letters on your table, adhesive side up.  \nNow, carefully remove the waste vinyl line by line.\n\nReplace the release liner on the exposed adhesive until reeady to mount.\n\n"
    },
    {
      "time": "3 May 2007 — 4:58pm",
      "content": "If the letters are cut on a vinyl cutting machine from a sign shop no problems. You can do the layout in vector format and they will cut it exactly like you laid it out.  \nThey can pretty well cut any size but what is more important what is a good readable size from a given distance.  \nHave the sign shop \"weed out\" the background and apply a large sheet of premask.  \nThis premask can hold all the lines or block of copy together so you can apply it all at once.  \nAsk the sign shop for help and they will teach you the tricks on how to apply it.\n\nGood luck  \nGerry\n\n"
    },
    {
      "time": "4 May 2007 — 10:14am",
      "content": "Of course, the easiest thing would be to hire the sign shop guys to come out and do the installation for you.\n\n"
    }
  ]
}
