{
  "id": "33468",
  "title": "Font Suggestions Please!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've got a word logo I'm working on and I simply cannot find a font that suits it.\n\nHave a look at the attached graphic and send any suggestions my way please! I've searched everywhere I can think of, to no avail!\n\nTyler\n\n| Attachment | Size |\n| --- | --- |\n| [poptwin.gif](http://web.archive.org/web/20150415092851/http:/typophile.com/files/poptwin.gif) | 4.54 KB |\n\n",
  "author": "tyleryoung",
  "time": "2 May 2007 — 6:10pm",
  "uid": "2139",
  "comments": [
    {
      "time": "2 May 2007 — 6:42pm",
      "content": "[Chalet](http://web.archive.org/web/20150415092851/http:/www.houseind.com/index.php?page=showfont&id=4) from House immediately came to mind, though I don't know why.\n\n- Lex\n\n"
    },
    {
      "time": "2 May 2007 — 7:04pm",
      "content": "How about Rian Hughes' similarly-named [Popgod](http://web.archive.org/web/20150415092851/http:/www.veer.com/products/typedetail.aspx?image=DET0000189)?\n\n"
    },
    {
      "time": "2 May 2007 — 7:40pm",
      "content": "Roto - I believe this is already set in [Popgod](http://web.archive.org/web/20150415092851/http:/www.fontshop.com/fonts/singles/device_fonts/popgod/&sample_text=POPTWIN&sample_size=96) with a reversed 'W'.\n\nTyler - Are you looking for something to compliment this logo, or something to _replace_ Popgod? Who is the company? Who is its audience? More info please!\n\n"
    },
    {
      "time": "2 May 2007 — 9:15pm",
      "content": "Lex, thank you for your tip! I'm looking into Chalet now. London 1970 might work, but I have to figure out how to get a typeset sample.\n\nStephen, you are on the money, as always. I really like Popgod for its funkiness, but for my word, Poptwin, the letterforms clash.\n\nSo, yes, I am looking for a replacement for the entire logo. I'm starting to think that a custom design is the only real solution here.\n\n\\*\n\nPoptwin is media-driven online meetingplace, and represents one of the new projects I'm putting together now for my new venture, Plastic Trophy.\n\nTarget ages: 16-35 with runoff into 45; which is what makes the branding tricky; I want it to be a little cliche, but not without sophistication. Something for the clubbers and the boosters as well.\n\nI'm thinking something like Bomb magazine, but with the edge toned down.\n\n"
    },
    {
      "time": "2 May 2007 — 9:44pm",
      "content": "How about another Hughes face: [Paralucent](http://web.archive.org/web/20150415092851/http:/www.fontshop.com/fonts/singles/device_fonts/paralucent_bold/&sample_text=Poptwin&sample_size=96)\n\n"
    },
    {
      "time": "3 May 2007 — 10:45am",
      "content": "Yes, I've looked at this face before. It's an interesting combination of sophistication and funky, no?\n\nI really like it on its own merit, but don't think it's right for my project. In fact, I haven't seen any face that suits me when set in upper/lower case.\n\nSo I've focused my efforts on an all-caps solution.\n\n\\*\n\nRegardless, I really appreciate your help Stephen!\n\n"
    },
    {
      "time": "3 May 2007 — 11:42am",
      "content": "Are you sure? All caps makes for a tough TW pair.\n\n"
    },
    {
      "time": "3 May 2007 — 12:24pm",
      "content": "Yes, you are absolutely right. I just haven't found a lowercase set yet that was \\*pop\\* enough for me.\n\nMaybe what I ought to do is double back and begin my search again just focusing on the lc version of the word.\n\nThe closest I've come to finding a lc set that felt right was Omnes Black Italic at the Village. I l-o-v-e that family of faces, and while the word looks great to me, and looks \\*popish\\* as well, it has a bit too much motion in it, me thinks.\n\n"
    }
  ]
}
