{
  "id": "33485",
  "title": "New Identity/Biz Card",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I’m graduating in just over a month and I’ve developed a new identity for myself. This is the application to the biz card, which will then be followed by the resumé and website. Please let me know your thoughts.\n\n| Attachment | Size |\n| --- | --- |\n| [db.bizcard.00.pdf](http://web.archive.org/web/20081120072520/http:/typophile.com/files/db.bizcard.00.pdf) | 52.7 KB |\n| [db.bizcard.01.pdf](http://web.archive.org/web/20081120072520/http:/typophile.com/files/db.bizcard.01.pdf) | 46.64 KB |\n| [db.bizcard.02.pdf](http://web.archive.org/web/20081120072520/http:/typophile.com/files/db.bizcard.02.pdf) | 44.98 KB |\n| [db.bizcard.04.pdf](http://web.archive.org/web/20081120072520/http:/typophile.com/files/db.bizcard.04.pdf) | 44.97 KB |\n\n [‹ Resumé Crits ASAP](http://web.archive.org/web/20081120072520/http:/www.typophile.com/node/33812 \"Go to previous forum topic\") [Comparison of languages ›](http://web.archive.org/web/20081120072520/http:/www.typophile.com/node/33400 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081120072520/http://www.typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": " 3.May.2007 11.37am",
      "content": "Love the mark and the colors!\n\nFor how tight you’ve spaced the letters in “Dave Bailey”, the word spacing isn’t tight enough. (I do think you’ve spaced it too tightly for the typeface.)\n\nI’m not sure about the em-dashes surrounding your titles.\n\nThe three lines that follow need more line-spacing.\n\nI’m might consider make your name smaller and try left-justifying instead of right.\n\nI’m not sure about the white outline on the back. Or the white box for that matter. Gratuitous maybe? What if you just had the two lines/boxes of color? This would echo the logo and be more subtle.\n\n"
    },
    {
      "time": " 3.May.2007 11.42am",
      "content": "Ah, lovely quick response! The mark came from a bunch of doodling I did in the margins of my notebook, imagine that!\n\nI was wondering about it being too tight, the glyph designs have unique serif designs and as such I couldn’t make up my mind if it was ok to overlap them. There was even a slight mod. to the leg of the \\_L\\_ for spacing reasons...I’ll rethink my name.\n\nMaybe I should stick to original ideas and stop thinking so much, that’s what I did with the mark. The back was originally just the two colors, like you suggested.\n\nI shall report back!\n\n"
    },
    {
      "time": " 3.May.2007 12.46pm",
      "content": "I would echo the comments of Miss Tiffany...\n\n..and add that I’m not sure your choice of typeface reflects the interesting logo you have designed yourself. I like your logo design and think you could also push the layout a bit further.\n\nAs a starting point I like the way the logo sits on the front, however I think you could be a bit more adventurous with the layout of the text, maybe reflect the shape of the logo a bit more... don’t be afraid of leaving white space? Maybe overlap some of the text on top of the logo in the way that the ’d’ and ’b’ interact with each other?\n\nThe back does’nt match the design you have on the front, maybe keep it simple like the front without the text, or an abstract version of the logo?\n\n"
    },
    {
      "time": " 3.May.2007 5.10pm",
      "content": "New PDF at the top.\n\nbelleisle: I was always taught that contrast in typography is of utmost importance. i.e. don’t try to match a typeface to a logo’s physical structure. Thanks for your thoughts.\n\n"
    },
    {
      "time": " 3.May.2007 5.46pm",
      "content": "\\>contrast in typography is of utmost importance\n\nI agree. Here I think you might introduce more by making the web addresses and phone number significantly smaller, and putting them lower, so the card is really about who you are and what you do.\n\nMy feeling is that this other stuff can be small because the reader is not going to read it, but only use it if and when he or she wants to contact you. I like the logo too. It more easily reads “db” when small, so you might want it small on the other side somehow.\n\n"
    },
    {
      "time": " 3.May.2007 8.53pm",
      "content": "William: I was thinking that it was competing a bit too much, but seriously didn’t know if going below 9pt on a biz card would be in poor form. There’s the logo small on the back of the first PDF if you didn’t see that. Thanks for taking time to observe my work!\n\n"
    },
    {
      "time": " 3.May.2007 9.04pm",
      "content": "Oh, my mistake, I was looking at it full screen, which is deceiving. The 9 pt may be ok, but then maybe the other should be bigger—or perhaps the info just less leading and moved more distant. I don’t know the best way but they look a bit too equal to me. On the first one, the back, the competition of the logo with the stripes confuses the eye, so the db isn’t so apparant. Again at true size just on the front it is probably fine...\n\n"
    },
    {
      "time": " 3.May.2007 10.55pm",
      "content": "Very nice!\n\nI was wondering about the dots in the phone number, never seen this before. Is this a typical treatment in the US? It reminds me of ftp addresses.\n\n"
    },
    {
      "time": " 4.May.2007 12.03am",
      "content": "“don’t try to match a typeface to a logo’s physical structure”  \nWho said anything about trying to do this?\n\nI was just urging you to experiment with the layout a bit, on the back of the sufficiently interesting logo design you had created.\n\n"
    },
    {
      "time": " 4.May.2007 12.37am",
      "content": "I think you should look at the alignment of name and title especially on the right, kerning between Da, Ba, around & Ty and po seem a touch loose, the interline spacing needs some work. And, to agree with Belleisle, I don’t see why you cannot or should not interact type with image, you have already defined white areas with the logo, to the left and the counter, and almost aligned the addresses with the x-height.\n\nTim\n\n"
    },
    {
      "time": " 4.May.2007 7.34am",
      "content": "belleisle: Sorry, I misinterpretted what you said. I had comments elsewhere about choosing a typeface that looks more like my logo and thought you meant the same thing.\n\ntim: I will heed your comments and try to get everything consistant for this next version.\n\n"
    },
    {
      "time": " 4.May.2007 8.38am",
      "content": "I think it is interesting that the smaller your logo gets, the more legible it becomes. That seems like a hard thing to pull off. Nice work, Dave. I look forward to your final version.\n\nSharon\n\n"
    },
    {
      "time": " 4.May.2007 10.07am",
      "content": "Posted another PDF with a better sense of grid on the front and hopefully a better sense of heirarchy through color and size.\n\n"
    },
    {
      "time": " 4.May.2007 10.24am",
      "content": "You are working on an asymmetric balance here. I like the right alignment, but to me your latest is too heavy to the left. To balance the big logo I am guessing you need to push the text to the right and let more white space pull against the logo. You can play with sizes and placements here until it clicks.\n\nFor examples of good asymmetric balance see the great stuff of Hokusai, or in typography early Tschichold.\n\nAlso the IL in your name is too tight compared to the the rest. I think you might find the text will work better if everything is in a bolder weight, possibly caps smaller, and the caps more widely spaced.\n\n"
    },
    {
      "time": " 4.May.2007 10.58am",
      "content": "Ah, ha....the heavier weight. I think that may have been the key to the overall balance.\n\n"
    },
    {
      "time": " 5.May.2007 8.20pm",
      "content": "You may consider aligning the division of the color fields on the back with the x-height of your logo on the front. Currently, these elements are very close to aligning. So close that it seems like they should align.\n\nDoing this would mean moving the division downward, possibly making the back of the card appear top heavy or accidentally off-center. So perhaps this is a bad choice. I just thought it was worth pointing out to you.\n\n"
    },
    {
      "time": " 6.May.2007 12.12pm",
      "content": "seventy7: Good points/tips...I think it may work. As William said above, I’m working with asymmetric design here. The continuation of the grid from the front to the back could work well too i.e. slightly top heavy band of colors. I’m posting an update now.\n\n"
    },
    {
      "time": " 6.May.2007 3.40pm",
      "content": "I wonder about making the name a bit smaller. Maybe letting the text all be one color too. I know that the design is meant to feel punchy to a certain extent but I am ways like a quieter more understated card. And I think the logo design guarantees that the design will remain punchy. I am a fan of dot with phone #s. It will be a fun and memorable card. Cheers!\n\n"
    },
    {
      "time": " 7.May.2007 12.07pm",
      "content": "Still working on the kerning of my name, heh. I think I want the entire thing to be punchy, but I understand where you’re coming from. The punchy-ness will hopefully make it memorable like you said!\n\nOne of my classmates just saw me working on it and said ’Typophile? that sounds so dirty’ and gave me a weird look. Pshhhhhhh.\n\n"
    }
  ]
}
