{
  "id": "33495",
  "title": "Question about italic",
  "forum": "Design",
  "tags": [

  ],
  "content": "I hope I’m in a good section.\n\nI’m looking for tips, suggestions or your knowledge to draw my second weight of my [italic](http://web.archive.org/web/20071126132430/http:/www.typophile.com/wiki/italic) typeface. So far, I drew the roman in thin, light, regular, bold and black. I also drew the regular italic. So, I wonder which way is the best one: start from the italic and drawing the bold weight or start from the roman bold and draw the bold italic.\n\nThank you to share your experiment.\n\n [‹ Finding your way on the MTA (NYC subway)](http://web.archive.org/web/20071126132430/http:/www.typophile.com/node/33344 \"Go to previous forum topic\") [Kerning for a quotation: ›](http://web.archive.org/web/20071126132430/http:/www.typophile.com/node/33536 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071126132430/http://www.typophile.com/user/5264\" title=\"View user profile.\">sim</a>",
  "time": "<br>",
  "uid": "5264",
  "comments": [
    {
      "time": " 3.May.2007 5.48pm",
      "content": "well, depending on what style of face it is, this may or may not be useful:  \n [obliques how-to](http://web.archive.org/web/20071126132430/http:/www.typophile.com/wiki/obliques%252Bhow-to)\n\n"
    },
    {
      "time": " 3.May.2007 5.58pm",
      "content": "The style of my face is a Sans serif.\n\nI will read thoses links attentively.\n\nThanks Paul\n\n"
    },
    {
      "time": " 3.May.2007 8.29pm",
      "content": "” So, I wonder which way is the best one: start from the italic and drawing the bold weight or start from the roman bold and draw the bold italic.”  \nBoth actually. One normally is using the contours from the italic, and information from the Bold to make the bold Italic. But I do not think, once one has an italic, that one should go back to the bold contours for anything but a visual reference.\n\n"
    },
    {
      "time": " 4.May.2007 5.25am",
      "content": "David:  \nIf I understand what you explained, I should draw my bold italic weight from my regular italic and use the bold roman only as a reference for the weight or for other basic reference.\n\n"
    },
    {
      "time": " 5.May.2007 6.20am",
      "content": "Here’s how I do it. Start from your Italic outlines. Since the point placement and structure will be pretty much the same, you’ll be in a much better starting position.\n\nI put a copy of the original Italic in the template/mask/background (different terms, same thing, depending upon your software) of the Bold Italic, to compare with. I also keep open a glyph window from my Bold, with a copy of the Regular in the template/mask/background.\n\nUsing visual comparison, the relationships between your Bold Italic and Italic should be similar to the relationships between your Bold and Regular.\n\nSo, for example, you might center a Regular ’o’ behind the Bold ’o’, and then you’ll have a guide for how much weight to add to your Italic ’o’ and how much you should add inside and how much outside.\n\nYou can keep shifting the relationship to check different aspects. For instance, I will usually position the ’n’ centered on the counter and compare, then aligned on the right side of left stem and compare again.\n\nThis is how I use the Bold for visual reference. I believe it is essentially the same kind of thing that David is talking about.\n\n— K.\n\n"
    },
    {
      "time": " 5.May.2007 6.28pm",
      "content": "Kent:\n\nYour suggestion seems to me very effective. I will experiment it and I will give you news of them.\n\nThanks\n\nAndré\n\n"
    }
  ]
}
