{
  "id": "33529",
  "title": "Typeface for colonial anthropology/archaeology?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Thinking about the colonial past - specifically, the scientific discourse of the nineteenth century, especially evolutionary anthropology, archaeology and the like - would anyone care to recommend a typeface that would simulate (or indeed, parody) the objectivist discourse of the period?\n\nMy thoughts turned immediately to Didot, Bodoni, etc. (given the modernism-cum-romanticism of many anthropologists) but I then wondered if there was a more distinctively 'scientific' (authoritative, objective) face in use throughout the 19th century?\n\nAny suggestions would be appreciated. Thanks.\n\n",
  "author": "ffetish",
  "time": "4 May 2007 — 11:01pm",
  "uid": "16361",
  "comments": [
    {
      "time": "4 May 2007 — 11:25pm",
      "content": "19th century. I'd think with the anthropology, archaeology, etc connection, likely British? Watered out Bodonis were around but what else as a text face that survives? (or deserved to survive?) Caslon was revived in mid-century.\n\nGerald\n\n"
    },
    {
      "time": "5 May 2007 — 12:00am",
      "content": "\\>or indeed, parody  \nFor Parry i would say mimik, interpret …\n\n[http://www.ourtype.be/](http://web.archive.org/web/20131019111353/http:/www.ourtype.be/ \"http://www.ourtype.be/\")  \nHave a look at Parry and Parry Grotesque\n\n"
    },
    {
      "time": "5 May 2007 — 1:44am",
      "content": "'When in doubt, use Caslon' ... advice that may well have been current in the colonial era. Thanks, I think it's a likely contender (probably the Adobe Pro version).\n\n"
    },
    {
      "time": "5 May 2007 — 7:00am",
      "content": "I assume you mean a text face? If so, the font you want is by a  \nvenerable French foundry, but has not been made into digital yet.\n\nhhp\n\n"
    },
    {
      "time": "5 May 2007 — 7:07am",
      "content": "The apocryphal story goes that slab serifs are called Egyptian/Egyptienne because dispatches from Napoleon's expeditions into Egypt were set using them (the dates don't quite align right?), or else some sort of book published later on the subject used them. If anyone less hazy on the subject than me can substantiate this, it would be an interesting connection to explore. Things don't get much more colonial than Napoleon in Egypt, and it was also when the Rosetta stone was found, if I'm not mistaken.\n\n"
    },
    {
      "time": "5 May 2007 — 8:04am",
      "content": "I thought it was mostly because Egyptology was fashionable at that time. Anyway, history is one thing, current perceptions another, and I don't think slabs say colonial to most people. On the other hand, I do agree that conveying colonialism, especially a parody of it, would do best to look towards France.\n\nhhp\n\n"
    },
    {
      "time": "5 May 2007 — 11:41am",
      "content": "All the nineteenth-century archaeology books (either original or facsmile reprint) that I have are set in moderns of one sort or another, the Anglophone ones being generally more or less Scotch in appearance and the Italian ones more Bodoni-ish. In the late nineteenth century US, in the heyday of cultural evolutionism, you get faces that look very much like Monotype Modern Extended (some sort of Linotype equivalent, I suppose?), and then around the turn of the century some Century-ish faces also.\n\n"
    },
    {
      "time": "7 May 2007 — 12:58am",
      "content": "Thanks for all of the different (and intriguing) perspectives, there's much to consider. At the moment, MTScotchRoman seems to suit the content of the project perfectly (a rejoinder to anthropological discourse, almost a broadside, rather than an academic monograph or formal treatise on the subject). I'm drawn to Modern Extended (and Condensed as well!) but simply adore the weighty uppercase and kerning idiosyncracies of MTScotchRoman. The alternative approach would be to use a thoroughly contemporary font (it's an essay on postcolonialism, after all), but I'll work with ScotchRoman for now, see what comes to fruition. Thanks everybody for your respective two cents' worth - which has already proven invaluable!\n\n"
    },
    {
      "time": "7 May 2007 — 6:43am",
      "content": "To my eye, what you see as \"kerning idiosyncracies\" in Monotype Scotch Roman is really just lousy letterfitting. & the \"weighty uppercase\" just throws spots of discordant color into your line. This was true in the metal face and only got worse in subsequent versions.\n\nYou are on the right track to think of Scotch, and I'll let you get away with MT Scotch for this quasi-broadside, but if you do a book-length project and want to use Scotch, for heaven's sake, use a decent version of it. Miller is the only choice whenever I need to use Scotch Roman. Check that out. But use that alternate R.\n\npowers\n\n"
    },
    {
      "time": "8 May 2007 — 1:03pm",
      "content": "Go for a Scotch Roman, the uglier the better. And be sure to put two spaces after every period. Oh, and not larger than 9pt.\n\nI've read some 19th century books recently. Can you tell?\n\n"
    },
    {
      "time": "8 May 2007 — 1:04pm",
      "content": "Oh, and setting two columns on a page is always good for 19th century. Even for novels.\n\n"
    },
    {
      "time": "8 May 2007 — 3:43pm",
      "content": "Fine by me. But only if they are two en spaces, not just two justifying spaces. Gotta get real here.\n\nI recently designed and composed a book for which the client [the writer] insisted on 2 spaces after every period. He felt that made it look more like a letterpress book. Hmmmmm.\n\npowers\n\n"
    },
    {
      "time": "9 May 2007 — 12:06am",
      "content": "Well, ugliness (lol!) wasn't my main barrier to using ScotchRoman -- but the version I have doesn't include an italic, which is inherent to the form of the essay (it's very short, by the way, far from book length). So I will check out Miller as an alternative. Thanks for the suggestions.\n\nEdit: I found the ScotchRomanItalic font -- for some reason Linotype Font Explorer failed to copy it across the first time.\n\n"
    },
    {
      "time": "9 May 2007 — 9:51am",
      "content": "Did somebody say stinky old Italic?  \n [http://www.myfonts.com/fonts/lanston/ltc-law-italic/](http://web.archive.org/web/20131019111353/http:/www.myfonts.com/fonts/lanston/ltc-law-italic/ \"http://www.myfonts.com/fonts/lanston/ltc-law-italic/\")\n\nhhp\n\n"
    },
    {
      "time": "9 May 2007 — 11:40am",
      "content": "@John & Will: LOL!!  \nSo I've mistakenly been blaming the \"Typewriter Era\"??\n\n"
    },
    {
      "time": "10 May 2007 — 12:33pm",
      "content": "Hrant, I think that Law Italic is a really fun, idiosyncratic typeface. It reaches beyond text use and is now a display font, I think, but is by no means stinky!\n\n"
    },
    {
      "time": "10 May 2007 — 12:42pm",
      "content": "Maybe not stinky, but definitely moldy!\n\nhhp\n\n"
    },
    {
      "time": "10 May 2007 — 1:07pm",
      "content": "Only moldy in a cool ephemeral way.\n\n"
    },
    {
      "time": "10 May 2007 — 5:08pm",
      "content": "That looks an awful lot like a font I was trying to identify at my old job (scanning in old law books). It's very beautiful in its own strange little way.\n\n- Lex\n\n"
    },
    {
      "time": "11 May 2007 — 6:39am",
      "content": "Indeed, hand comps were inserting wide spacing after periods long before typewriters came into general use. At least that was the practice in the USA, and I think in Britain. I'm not sure what the overall history of the practice is. I looked at three books this morning from different times & places.\n\nA small volume of Horace printed by Ambroise Firmin Didot in Paris in 1855 shows no extra space after the periods. (It does show space added fore and aft of some punctuation, which has been discussed in a different thread here.)\n\n\"Sylvie,\" by Nerval, printed by William Bird Mosher in Portland, Maine in 1896 has spaces after periods into which one could park a Hummer. & generally crappy typesetting.\n\n\"ABCs of Book Collecting,\" London, 1952 has spaces less wide than the Nerval, but greater than the justifying spaces in its lines.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*  \nSeeing the revival of Law Italic was a pleasant surprise; thanks, Hrant. This does make me believe Everything That Has Been Shall Be Again. I am constantly surprised, for instance, by the re-issue of obscure jazz LPs originally on small labels from 45 or so years ago. Thus it appears to be with typefaces also.\n\npowers\n\n"
    }
  ]
}
