{
  "id": "33532",
  "title": "My dissertation plan, please help! add anything to the list if you must. thanks",
  "forum": "Design",
  "tags": [

  ],
  "content": "Please add anything you think is appropriate to the list if you must. Thank you :)\n\nThe Art of Persuasion\n\nINTRODUCTION\n\n-What power is and how it affects our attitudes and  \nreactions to certain thing in society.  \n-It’s influences on people and how it psychologically  \nworks with our minds.  \n- How it affects us and our daily lives generally.  \nHave a part that can leads into referring to the past  \nof Christianity, Egyptian Era and beyond.\n\nPart 1\n\n- Christianity and how people saw it as their lives.  \nChristianity made their lives. It was some form of  \npersuasion.  \n- Egyptian Pharaohs etc. They had power over the  \npeople. They Pharaohs had gold which equals power  \nbecause rich and wealthy and therefore able to have  \nanything and everything they ever wish for, thus  \nmaking them hierarchy and powerful.  \n- Alexander the Great. His statue was made to look  \npowerful and so the people chose him as leader  \nalthough they had never seen the guy before! He was  \nnoway like he was in real life so they were persuaded  \nby the power of the statue to remind them who their  \nleader was and who t hey should aspire to.  \n- Renaissance onwards, talking about church, mosques  \n(architecture and how it helped people to believe in  \nreligions etc - Not sure on the architecture bit  \nbecause I have not yet looked into it).  \n- You once mentioned the Notre dam Cathedral (again,  \nneed to research, not sure what it is about though.)  \n- Are Romans important enough in this context? Should  \nthey be included? And if so, in what form?\n\nPart 2\n\n- Propaganda posters = World War I (Hitler and how he  \nwas backed by his people even though he was in the  \nwrong).  \n- Uncle Sam War posters 'WE WANT YOU'  \n- You mentioned at one point about Goebbels, Minister  \nof Germany (need to look into, I am not sure what it  \nis though).  \n- Triumph of the Will film which is a propaganda film  \nby Leni Riefenstahl (German film maker)  \n- Eternal Jew film from 1940. Anti Semitic.  \n-Would I have to mention quotes from Genesis?  \n- Italian Fascism ruling between World War I and World  \nWar II. Hitler was inspired by Italian Fascism.  \n- deconstruct advertising after World War I and II  \n- Barbara Kruger, born 1945 and worked as guerrilla  \nartist. Guerrilla art is philosophical thus, focuses  \nmore on ‘cause and effect’  \n [http://en.wikipedia.org/wiki/Guerilla\\_art](http://web.archive.org/web/20120121081546/http:/en.wikipedia.org/wiki/Guerilla_art \"http://en.wikipedia.org/wiki/Guerilla\\_art\") Her work was  \nblack, red and white therefore relates to Hitler in  \nsome form; also the Russian Constructivism.\n\n- You mentioned Robin Hood so I might speak to you  \nabout it I think. Is it because he was seen as a  \nlegend and a hero because he gave money to the poor  \nbut then was seen as bad because he robbed passers by  \nto do it?\n\nPart 3\n\n-Advertising, packaging etc How we decide on what to  \nbuy and which brands. is it because they stand out as  \nquality via packaging design or are they well  \nestablished companies and so they tend to appeal more?  \nOr what would people on a budget generally go for and  \nwhy? Is it financial situations that help us decide  \nwhich brand of product to buy or some other  \npsychological aspect that needs looking into i.e.  \ncolour psychology advertisers and designers use to  \nattract people to buy their products. Is it the  \n'celebrity endorsement' technique they use to persuade  \npeople to buy to represent 'quality' ?  \n- I might choose certain design pieces of advertising,  \nbranding or packaging that I can expand on in terms of  \npersuading the consumer to buy. How and why? Including  \ncolours used which have certain connotations, choice  \nof graphics and typeface used etc and why? Who are  \nthey aiming for and how successful they are in  \ntargeting their chosen T.A and how they do it. What  \nmethods and how ideas work.  \n-TV advertising. Effective use of type, image and  \nsound and how long they last for. Humans don't have  \nlong attention spans, therefore advertisers have to  \naccomodate in a short, clear, concise manner.\n\nCONCLUSION\n\nOverall message and what i found out etc Sum out my  \nfindings. Should be strong and to the point so reader  \nleft to make their own mind up whether they agree or  \nnot. Not sure at this moment in time.\n\n",
  "author": "<a href=\"/web/20120121081546/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": "",
      "content": "Well, that is ample material for at least a dozen dissertations. Reduce to the max.\n\nGreetings  \nFlorian\n\n"
    },
    {
      "time": "",
      "content": "Persuasion can come from reasoning, and the tool of reasoning is the argument. Arguments an be (1) conclusive, such \"All A is B, All B is C, therefore All A is C.\" Conclusive arguments are usually what are termed \"truths of logic, or formal truths, and are pretty boring.\n\nArguments can also be (2) compelling, which take the same form as (1), but disputes arise because the premises aren't commonly agreed to, and the form of disputation is usually an attempt to refine the premises so both parties reach agreement. Usually agreement over premises isn't reached, but it is a lot more fun than formal logic. Another term for this would be \"critical thinking.\"\n\nIt appears this is a form of persuasion (rational argumentation) is not what you are after. Taking a convenient dicotomy (reason versus emotion), you appear to be after chronicling persuasion that appeals to emotional issues. But this is a terribly presumptive dicotomy; read <cite>Blink</cite>. I found Chapter 3 particularly interesting; my understanding of this chapter was that the very thing that lets us function well without a syllogistic analysis also requires us to rely on generalizations. Generalizations are quick, useful summations which are known to contain untruths as well as truths, so don't lend themselves to becoming \"absolutes.\" One form of this is the \"stereotype,\" which is, roughly, a generalization once useful, but either not currently useful or far less useful than formerly. Stereotypes lead to, in Gladwell's terms, \"the dark side of thin-slicing.\"\n\nNow there is a point to all this. Most of us allow that there is some -- and sometimes a lot -- of truth of generalizations. Advertisements appeal to generalizations, while trying to get us to ignore the places where the generalization breaks down. How successful they are depends on how well they get us to ignore that breakdown. Not much has changed since <cite>Generation of Vipers.</cite>\n\nI find your inclusion of Religion strange. Religious truths are <cite>revealed truths.</cite> If the truth has not been revealed to you, you do not accept it; i.e., if it has not been revealed <cite>to you,</cite> no reasoning process will change your mind. This isn't to say religious truths are wrong, simply that they are of a different form.\n\nI once had a professor who, when we complained about the Ph.D. exams told us \"Exams are puberty rites. Get past them.\" His view on the dissertation was that it was one more term paper, designed to please the small audience of your adviser and his friends. Success there lead to a degree, a job, and eventually tenure. Any search for truth could wait until after you had tenure. He persuaded me. After passing exams, I quit academics; time was too precious.\n\nBlink\n\n"
    },
    {
      "time": "",
      "content": "Your writing is not very coherent, so I may not understand where you are going at all, but here goes:\n\nKeep in mind that that while imagery as a persuasive tool did exist in the past, the reasons leaders stayed in power and religions were a greater factor in life are far more complicated than anything that can be boiled down to the visual arts. For example, while Alexander may have sent forth a stone simulacrum as an emissary, people were probably caving in to him to avoid their nations being razed by his armies.\n\nIf you do examine Nazism look into Albert Speer. He was essentially Hitler’s head of design, and wrote a big fat memoir about his work in the Third Reich.\n\nTrying to connect propaganda from the second world war with modern advertising is too much of a stretch. The war propaganda was total (as any true propaganda system must be); governments put out their messages in every media in existence. Aside from Coca-Cola’s ubiquitous advertising, there has never been any commercial advertising that comes close to reaching the level of propaganda at all, much less WWII propaganda.\n\nFlorian is right, you really need to boil this down to something much simpler. What you seem to be proposing would generate a stack of research notes larger than the Mahabarata, getting a dissertation out of that would be a nightmare.\n\n"
    },
    {
      "time": "",
      "content": "You wrote World War I and Hitler in the same line. He was house decorator in that time. :D\n\n"
    },
    {
      "time": "",
      "content": "Hitler served in the Imperial German army through the First World War and was wounded and decorated, it is not unreasonable to link the propaganda of the time to his subsequent life.\n\nThe line that he was “backed by his people even though he was in the wrong” reveals a hindsight view of history that will confuse the issue.\n\nI, like others, suspect that this is too broad a topic for a dissertation and making some of those links coherent will be problematical.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Hitler was elected democratically! :-/\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite>Hitler was elected democratically! :-/</cite>\n\nHe was, but the Nazi party did not get unchecked power until it used the Reichstag fire as an excuse to suspend the Weimar constitution. I doubt that many German voters saw that one coming, although they probably should have.\n\n"
    },
    {
      "time": "",
      "content": "\\> I doubt that many German voters saw that one coming\n\nAs a rule voters don't get much.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The idea that Hitler was elected democratically is misleading, as he never got a majority, but was appointed over a divided opposition. Then he used criminal means to secure power. [Here](http://web.archive.org/web/20120121081546/http:/www.fff.org/freedom/fd0403a.asp) is a version of the story. I don't know about the guy who writes it, but he quotes pretty reliable historians.\n\n"
    },
    {
      "time": "",
      "content": "More bogus democracy apologism.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I once talked with the widow of the man who was head of the Communist Party of Germany during the time of the Nazi takeover. She said that the party did not ally with the center parties--which would have created a majority--because they thought that Hitler was so bad that the people supporting the center would soon react against him, and go over to them, and then the Communists could take over. In other words, they did not try to make democracy work, but relied on a reaction to put them in power. \"That was our guilt,\" she said.\n\nOf course it was not surprising that the Party did not try to make democracy work, as Marx, like Hrant, was contemptuous of democracy.\n\n"
    },
    {
      "time": "",
      "content": "I am feeling guilty about participating in hijacking Miss G's thread, so I'll make a suggestion:\n\nMiss G., focus on one clear question about persuasion, and look at different competing answers to it.\n\nYour proposal so far sounds like one of those papers I got from students that whose first words were, \"Ever since the beginning of time...\". Whenever I saw that phrase I would have to restrain myself from throwing the paper into the trash, and instead steel myself to try to be fair. Not the reaction you want.\n\n"
    },
    {
      "time": "",
      "content": "\\> I am feeling guilty about participating in hijacking\n\nDon't worry, you have much more serious things to feel guilty about.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>you have much more serious things to feel guilty about\n\nNo doubt I have done worse things. But you don't know me, nor what I have done for good or ill in the world.\n\n"
    },
    {
      "time": "",
      "content": "so we've got a stupid idiot who shold soak a tyre in petrol, hang itaround her neck and set fire to it, anazi, and a religous fanatic. why dont u all find aplace to be to getherand get laid?\n\n"
    },
    {
      "time": "",
      "content": "Welcome to Typophile, drinktoomuch.~\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "I'm much worse than a nazi, I'm a monarchist. You peon.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Missgiggles,\n\nNot to hijack the thread too far off the current course (heh heh), but I have to agree with some of the others that this is, to say the least, an ambitious self-assignment. Wouldn't hurt to narrow it down a little. What's your field, or what would the Ph.D be in?\n\nJust as a starting point, here's a [reading list](http://web.archive.org/web/20120121081546/http:/mktg-sun.wharton.upenn.edu/advertising/PDF%20and%20Other%20Files/advertising%20bibliography.pdf) on \"Advertising and the art of persuasion\" someone already compiled. Note that it's 40+ pages long, yet at a quick glance I can already see holes in it, and it doesn't even venture into the historical perspective as you propose to do.\n\nAny SINGLE one of the bullet points in Part 2 and Part 3 would probably be enough to build a dissertation around. I suspect you are looking to do a dissertation which is a more comprehensive whole than a focused inquiry, but there are problems with that approach, one being that there will always be holes that your dissertation committee can, should they choose, drive trucks through. If you focus enough, you should be able to wow them with your detailed level of knowledge, yet be able to fit your topic into larger ones (typically one near and dear to their hearts - be sure to do the research on your committee members!).\n\n"
    },
    {
      "time": "",
      "content": "Faz, I agree with Todd, it's probably better to draw general conclusions from a few deeply-analysed examples.\n\nTo get a sense of history, you don't need the whole narrative, just compare a couple of points in time, the rest will fall into place.\n\n"
    },
    {
      "time": "",
      "content": "Nice posts Nick/Todd!\n\n"
    },
    {
      "time": "",
      "content": "Hmmm...I know it is soooooo vast. I don't know what to do and how should I narrow it down? Should I change the title and focus on, I don't know? Just posters or advertising or...any other suggestions? What about Pursuasion of German graphics during the war? Please help. Thanks.\n\n"
    },
    {
      "time": "",
      "content": "Narrow it down by choosing a subject you are either interested in or already know about, my impression is that German graphics during World War II is a subject that might be interesting but as has been noted it was propaganda and was backed up by men in leather coats, it would be difficult to gauge the persuasiveness of the graphics separate from the secret police and the full state apparatus without deep understanding of the situation Germans found themselves in.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "hmmm...okay but do you think I could find enough info for an 8000 word dissertation?\n\n"
    },
    {
      "time": "",
      "content": "Please don't take offense, Faz, but isn't this the sort of thing it makes sense to sit down and talk to your tutor about? Is it not part of their job to advise you on selecting and narrowing your focus? I'm just not sure throwing it out there onto a typography forum is going to give you the kind of answers you're looking for. Your dissertation is a really big deal—you're going to spend the next year writing it, you're going to have to defend it—and I for one feel you should be doing this sort of legwork yourself rather than asking us to do it for you. This is problem you've encountered here before...\n\n"
    },
    {
      "time": "",
      "content": "I am not asking anyone to do my dissertation for me am I? I am asking for people's advice. I'm not asking for a title or anything either? I'm the one who has done the thinking here. Now I jsut need advice. I could have just asked 'what should I do my dissertation on?' but no! I haven't so what is the problem here? Sorry but if you're out to get me again, you can forget it. I know you said 'no offence' but I have spoken to teh tutor and he said it is all absolutely fine but i'm not sure whetehr I can tackle such a vast subject so I just wanted help on narrowing it down from my original idea, that's all. Nothing more. I can put it forward again and see the responce I get because it is going to be massive and squashing it in 8000 words, well...it could be bigger and because I have dyslexia, its harder as I get frustrated really easily with too much words, reading and too much info so yup.\n\n"
    },
    {
      "time": "",
      "content": "Faz, I think Patty is correct to warn that we might not be the best people to advise you, your tutor knows you and what you are capable of, he is, therefore, in the best position to advise you. You have consistently received the advice that you are taking on a vast subject and you have expressed your own doubts, my feeling is that there is more than enough to write 8,000 words from your topics in your introduction without relating to historical (pre-1960) references. The Barbara Kruger/Guerilla Art reference in your list could make for interesting comparison to an advertising campaign and what happens when marketing tries to co-opt guerilla art.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Ok sorry but he says its ok. I don't personally believe that because it is far too big to research. It's going to drive me mental don;t you think? I have to tell him I want to narrow it down. See what he says? I haven't expressed my concern to him yet but jsut thought it would be useful asking on here because my tutor may not be aware of something missing and someone else could looking at it from d different perspective. Nevermind.\n\n"
    },
    {
      "time": "",
      "content": "You should start by reading The Craft of Research.  \nIt'll teach you a great deal about writing a dissertation.\n\n"
    },
    {
      "time": "",
      "content": "Haha! funny...I have done reaserch to help me come to the above conclusions. All i asked was did I miss anything? That's all...and an additional joke is a bonus.\n\n"
    },
    {
      "time": "",
      "content": "_\"worse than a nazi, I’m a monarchist\"_\n\nNow you're just splitting heirs.\n\n"
    }
  ]
}
