{
  "id": "33544",
  "title": "Help! FH Foco...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all. This is a message mostly directed to 'Haag' but also to anyone else who might help. About a month ago I purchased 'Foco' for a corporate job but unfortunately it was never used.\n\nNow I'm doing a book on New Zealand Maori facial tatoos, called Moko's. The book explores both traditional and modern interpretations of Moko design. It's both an academic text as well as a book of beautiful modern portraits (like the one attached).\n\nFoco is perfect as an alternate text font, for the purposes of this job it complements the subject but also works well paired with Plantin. Unfortunately it has no Italic forms (or none that I can find anywhere online). I desperately want to use this font but need an Italic for us to proceed as the book 272 pages.\n\nCan anyone help? Unfortunately this is an urgent request as we are presenting a blad in the next week.\n\nIf there isn't an italic version then can someone suggest an appropriate alternative that posesses the same character and tone.\n\nRegards\n\nBevan.\n\n ![](http://web.archive.org/web/20150225214341im_/http:/typophile.com/files/MauMoko_4445.jpg)\n\n",
  "author": "Bevan",
  "time": "5 May 2007 — 3:21pm",
  "uid": "15480",
  "comments": [
    {
      "time": "5 May 2007 — 3:52pm",
      "content": "Show us Foco.\n\n"
    },
    {
      "time": "5 May 2007 — 3:56pm",
      "content": "Ahh, [found it](http://web.archive.org/web/20150225214341/http:/typophile.com/node/1197).\n\nConsider [Omnes](http://web.archive.org/web/20150225214341/http:/www.joshuadarden.com/shop/omnes.php), [Cronos](http://web.archive.org/web/20150225214341/http:/www.fontshop.com/search/?q=cronos), [FF Strada](http://web.archive.org/web/20150225214341/http:/www.fontshop.com/search/?q=FF%20Strada), or [FF Cocon](http://web.archive.org/web/20150225214341/http:/www.fontshop.com/search/?q=Cocon).\n\n"
    },
    {
      "time": "6 May 2007 — 6:52pm",
      "content": "Thanks for your help. They look like great alternatives. I bought Omnes for another job so I'm a little apprehensive about using it again so soon though it is a fantastic font.\n\nAny idea if there is in fact an Italic version of Foco? I read some old forum posts (2004) where 'Haag' was getting feedback on the early iterations of what would be FH Foco. There was a post regarding a proposed Italic but the trail dries up there.\n\nAny exta help would be great.\n\n"
    },
    {
      "time": "6 May 2007 — 8:47pm",
      "content": "[Fabio Haag](http://web.archive.org/web/20150225214341/http:/typophile.com/user/2079). Did you try to contact him?\n\n"
    },
    {
      "time": "7 May 2007 — 12:27pm",
      "content": "Thanks, yeah that was the first thing I tried to do but his profile says he's not accepting emails so I'm at a little bit of a loss.\n\n"
    },
    {
      "time": "7 May 2007 — 12:49pm",
      "content": "I'll ping him for you. Perhaps he'll visit this thread.\n\n"
    },
    {
      "time": "7 May 2007 — 1:06pm",
      "content": "Hi everyody!!\n\nThings have been so busy that I couldn't catch up with this forum.\n\nThanks a lot Tiffany for contacting me in private.  \nI already changed my account settings to allow other users to contact me (it was a shame the way it was ;)\n\nI already answered Bevan in private, but considering all you guys in this threat, I'll clarify:\n\nFoco doesn't have italics, yet. It was released in partnership with DaltonMaag and designing them is one of our goals... but I'm sorry to say that it won't happen soon.\n\n\"see ya\" all around ;)\n\n"
    },
    {
      "time": "7 May 2007 — 3:17pm",
      "content": "Interesting project, Bevan. Can you please tell us how, exactly, Plantin & Foco work together to compliment the deep spiritual nature of Moko? I am sure you have a good understanding of typography (seven is a top design firm) and your reasoning is sound—but it is nice to hear it from the horses mouth, as it were!\n\n—K\n\n"
    },
    {
      "time": "7 May 2007 — 6:32pm",
      "content": "Hi Kris. Plantin & Foco have a very similar line colour which was the primary reason for the pairing. As this is primarily an academic text (although by nature of the subject it will no doubt become a coffee table book), I need to pair two fonts that would occupy the same negative space so the change in type face doesn't interupt the reader.\n\nPlantin is favourite of mine, it was a selfish choice.\n\nFoco possess some very nice subtlities in the tails and feet. To me, and that is not to say this is fact, it seemed sympathetic to Maori line. It's a bit of a stretch but it just seem to work.\n\nTo be fair post-rationalising is for clients. There's something to be said when things 'just work' together. So I apologise if you were after a deeper meaning.\n\nB.\n\n"
    },
    {
      "time": "7 May 2007 — 8:13pm",
      "content": "Thanks for the reply. I thought you would say as much.\n\n\"To be fair post-rationalising is for clients\"\n\nDo your clients know about this? Whatever happened to pre-rationalising the design?\n\n—K\n\n"
    }
  ]
}
