{
  "id": "33541",
  "title": "Differing italic angles",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’ve noted in a lot of my older Spanish texts the capital italic is less angled than the lowercase. It’s an effect I quite like, but I’ll be damned if I can’t get it to look right in my own tests. My lowercase angle is 17 degrees, and I first tried 12-13 for the uppercase, but it’s not different enough. Going much straighter though and it doesn’t seem much different from an ever-so-slightly oblique of the roman.\n\nWhat are some successfull set ups y’all have found? Should punctuation and symbols follow the same angle as the lowercase or the uppercase? Also, do y’all think it’s a good idea if doing the differently-angled uppercase to include a stylistic set at the original angle for those who prefer everything to fall over the same?\n\nI could have sworn I’ve seen this talked about somewhere but neither google nor the forum search pulls up much for advice on this.\n\n [‹ Still making a logo, still needing feedback](http://web.archive.org/web/20071126132513/http:/www.typophile.com/node/33567 \"Go to previous forum topic\") [Finding your way on the MTA (NYC subway) ›](http://web.archive.org/web/20071126132513/http:/www.typophile.com/node/33344 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071126132513/http://www.typophile.com/user/16708\" title=\"View user profile.\">guifa</a>",
  "time": "<br>",
  "uid": "16708",
  "comments": [
    {
      "time": " 6.May.2007 11.44am",
      "content": "And answering my own question ... 17 for lowercase and 10 for uppercase works quite nicely. But I’m still not quite decided on whether punctuation should be at the lowercase or uppercase angle. I’m included to think lowercase so I’ll go with that for now unless it looks totally out of place.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 6.May.2007 11.54am",
      "content": "Generally speaking I believe that old style italics have many different angles involved, and not just of upper and lower case. For example, in the original Caslon fonts the italic l is generally less sloped than the left leg of the ’n’—and the right leg is steeper than the left. And K is less sloped than the H and on and on.\n\n"
    },
    {
      "time": " 6.May.2007 8.22pm",
      "content": "In the most classical Armenian type the angles are about 16 and 19 for UC and lc.\n\nhhp\n\n"
    }
  ]
}
