{
  "id": "33559",
  "title": "Typography ASAP",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have a question for this esteemed panel:\n\nIf you were asked to teach someone AS MUCH AS POSSIBLE about typography in a single one-hour lecture, what would be the most important issues you would cover? Type terms? History? Families? Or something completely different?\n\n(While I’m aware this question sounds somewhat akin to “what would you grab to save from a burning house,” I’m seriously interested in your responses.)\n\n [‹ Lettermade.com](http://web.archive.org/web/20081015171030/http:/www.typophile.com/node/33398 \"Go to previous forum topic\") [Some nice hand lettering on 1912 greeting card ›](http://web.archive.org/web/20081015171030/http:/www.typophile.com/node/34062 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015171030/http://www.typophile.com/user/9273\" title=\"View user profile.\">ChuckGroth</a>",
  "time": "<br>",
  "uid": "9273",
  "comments": [
    {
      "time": " 6.May.2007 6.02pm",
      "content": "What is the purpose of teaching them? Is this informative or practical? History is interesting but not nearly as essential as, say, the fundamentals of using and setting type, kerning, what fonts are appropriate for what type of usage, type terms, etc. I never studied typography but learned it on the job. I am blown away by the knowledge of some of the members of this forum. But I do feel like I could give a quickie lecture on type based on my experience using it.\n\n"
    },
    {
      "time": " 6.May.2007 6.17pm",
      "content": "I’d spend the hour just _looking_ at typography, and trying to break down a page into all its elements. I’d talk about the choices that were made in a given example, and other choices that could be made if it was designed differently. And I’d try to emphasize the spatial organization of the page, perhaps even over details of typeface design. Hopefully the time would be enough to convey the essence of typographical design.\n\nI’d avoid much talk of technology, history, or jargon — unless you’re asked.\n\n—John\n\n"
    },
    {
      "time": " 6.May.2007 6.23pm",
      "content": "OK - I was going to edit my post to add that I think a basic understanding of families is useful too but the link button isn’t there...\n\nI don’t agree that going over a single example in detail is the best use of a one hour lecture, I’d try to cover more of the basics. But again, it depends on the audience and the purpose.\n\n"
    },
    {
      "time": " 6.May.2007 6.25pm",
      "content": "Interesting takes.  \npattyfab- it’s instructional, particularly practical.  \nJohn- I think you’re approach would be really terrific as a SECOND lecture. I might be wrong, but my feeling is that the “let’s examine this, understand why it does or doesn’t work and see how we might improve it” could be daunting for someone before they felt like they had their sea legs.\n\n"
    },
    {
      "time": " 6.May.2007 7.00pm",
      "content": "I think I’d do “One-hour Typographical History for Dummies” — where it started, how it progressed, Gutenberg, Letraset, computers.\n\nQuick cuts between slides, very MTV.... :-(\n\n"
    },
    {
      "time": " 6.May.2007 8.23pm",
      "content": "Start with the purpose, not how it generally ends up looking.\n\nhhp\n\n"
    },
    {
      "time": " 6.May.2007 8.44pm",
      "content": "Use your hour to get this people higly interested on fundamental topics of type practice. Then they will know exactly what they need to learn and get as much as they need by themselves\n\nHéctor\n\n"
    },
    {
      "time": " 6.May.2007 9.16pm",
      "content": "But you still haven’t told us either the audience or the purpose for the one-hour lecture. You might get different advice if you do. Or is this just a theoretical question: what is the most important info to impart on type?\n\n"
    },
    {
      "time": " 6.May.2007 10.24pm",
      "content": "It’s an educational lecture for beginning designers and people wanting to expand skill sets. I was planning to start with some basic terms and then a very brief history, primarily how the families developed and how attitudes about type are closely linked to other cultural trends.  \nAfter that, I wanted to discuss type “voice” and close with a lot of visual examples of typographic excellence.\n\nI wanted to hit briefly on the subjects off terms and history, not because I think I could do it justice in half and hour or forty five minutes, but because it’s difficult for me to really look at how type works, appropriate applications, its character and vibe without talking about x-heights, historical connotations, etc.\n\n"
    },
    {
      "time": " 6.May.2007 10.25pm",
      "content": "Oh, and they will be mostly adults.\n\n"
    },
    {
      "time": " 6.May.2007 10.25pm",
      "content": "Oh, and they will be mostly adults, but not necessarily saavy designers.\n\n"
    },
    {
      "time": " 7.May.2007 2.08am",
      "content": "well if I was attending this lecture, I would be more interested in how to actually use type.. Considering the lack of time, it will be hard to get into anything in much detail, so if you just focus on the basics of how to use it practically then they will come away with some helpful information that they will be able to apply, then they may get more interested in the _why_ aspect of type...\n\n"
    },
    {
      "time": " 7.May.2007 4.20am",
      "content": "I will make the lazy dog jumps over the quick Brown Fox simply by letting him/her go on changing Fonts/Sizes/Colors and line spacing on the wordpad or alike. Typography in Flash?!\n\n"
    },
    {
      "time": " 7.May.2007 4.23am",
      "content": "I’m hopeful.\n\n"
    },
    {
      "time": " 7.May.2007 4.27am",
      "content": "Learn to rap ;-p\n\n"
    },
    {
      "time": " 7.May.2007 4.59am",
      "content": "From the T to the Y to the P...\n\n"
    },
    {
      "time": " 7.May.2007 5.04am",
      "content": "By the way, do not let him/her fall in love with the mouse, donkey+monkey (Enter+ Tab) but to remain a faithful dog (Esc).  \nCheers\n\n"
    },
    {
      "time": " 7.May.2007 5.15am",
      "content": "[Looking Good in Print](http://web.archive.org/web/20081015171030/http:/www.amazon.com/Looking-Good-Print-Roger-Parker/dp/193309706X/ref=pd_bbs_sr_1/002-0804764-7091213?ie=UTF8&s=books&qid=1178538987&sr=8-1) I found very useful when I started to learn graphic design on my own. It is now in its sixth edition. The best part of it is the ’before’ and ’after’ section.\n\nI think the ’before’ and ’after’ pictures of poor ’before’ and improved ’after’ versions is the best way to illustrate the impact of good design, and to show some of the typical amateur mistakes.\n\nThat’s about all you can do in an hour, but you can really open people’s eyes, if they are at all sensitive to the issues. I see there is a version of the book with a CD rom, which may contain the ’before’ and ’after’ illustrations.\n\n"
    },
    {
      "time": " 7.May.2007 6.04am",
      "content": "Everyone has been very helpful. I’ll let you know how it goes.  \nWilliam- thanks for the link for Looking Good... I wasn’t familiar with that book.  \nAziz- I’ll try to get jiggy wit it.\n\n"
    },
    {
      "time": " 7.May.2007 6.26am",
      "content": "1) Tell your audience what typography is, i.e., placing type.\n\n2) Show them what type is by presenting them with a picture of a metal sort and how they are assembled.\n\n3) Show them a picture of a digital (bezier) description of a character in a font.\n\n4) Illustrate how fonts very. How widely and how narrowly, and in what respects.\n\n5) Illustrate the _plasticity_ of how they are assembled into words, then lines of type, then blocks of text, than arrangements of blocks of text, then sequencences of arrangements of blocks of text.\n\n6) Show some widely diverse high points of typographic formatting and some aberrations.\n\n7) State what kind of a task typography is; what the ’cares’ or concerns or attunements of a typographer are in all of this.\n\nTerms can be introduced and names or designations dropped ’on the fly.’\n\n"
    },
    {
      "time": " 7.May.2007 6.36am",
      "content": "And make sure to convey your own passion about it.  \nIt’s the human connection.\n\nhhp\n\n"
    },
    {
      "time": " 7.May.2007 9.08am",
      "content": "I was interested to see what was said here because I will have an intern this summer and I will be teaching ( to the best of my ability ) her about type use and design. And admittedly over a longer period than an hour.\n\nEven though I think you got great answers I think I do have two additional suggestions:\n\n- Have a look at Ellen Lupton’s book I think it covers things pretty well and best of all it is highly organized. Actually, anybody got a crit of that book at all?  \n- Point out that there is much much more than can be covered in an hour but that they have fantastic resources available these days - and point to 10 or so.  \n- There is this [http://www.alttype.com.sg/erik\\_s\\_typo\\_tips.html](http://web.archive.org/web/20081015171030/http:/www.alttype.com.sg/erik_s_typo_tips.html \"http://www.alttype.com.sg/erik\\_s\\_typo\\_tips.html\") too.\n\n"
    },
    {
      "time": " 7.May.2007 2.07pm",
      "content": "i will certainly convey my passion — i can’t help it. i believe several of my full-time students already think of me as somewhat of a type nerd as it is,\n\neben- i will be compiling a list of web and print resources “for further reading.” and you’re right, i’ll probably point to lupton’s book and url; she has a very strong knack for explaining concepts in a personable way.\n\n"
    },
    {
      "time": " 8.May.2007 8.12am",
      "content": "I think I would start with a few - loosen things up - explaining where phrases like “lower case” came from.\n\nMove on to x-height, descenders and ascenders...\n\nTalk about how each letter is a piece of art unto itself - but it is used to convey a message, and how each letter needs to fit together for easier readability. Meanwhile, a side discussion on the merits of a good marriage between type and graphic elements.\n\nIf there is time - discuss how body copy upside down, when set properly, is gray matter — and bring the tops of serif letters to show how easy we can recognize and read them.\n\nAlso, bring a piece of lead type to be passed around. Explaining that 10 point type is not the type - but the piece of lead it is on. If you have spacers - bring those relics too...\n\nWait - I did this once before in 15 minutes to a group of women...\n\n"
    },
    {
      "time": " 10.May.2007 6.54am",
      "content": "“AS MUCH AS POSSIBLE about typography in a single one-hour lecture, what would be the most important issues you would cover? Type terms? History? Families? Or something completely different?”\n\nI would explain in that hour, what happens when the user types one character, on a Mac, from the keystoke back to the foundry, and then forward to the bits that show up on the display. That should take about an hour, and whet some appetites.\n\n"
    },
    {
      "time": " 10.May.2007 10.34am",
      "content": "that would be a really interesting lecture...\n\n"
    },
    {
      "time": " 10.May.2007 12.19pm",
      "content": "Chuck, by now you probably have more suggestions than you can use, so what I’ll do is try and highlight those that I believe to be the most useful ones.\n\nFirst and foremost, as Patty pointed out, you need to be very clear about the purpose of your talk; this, in turn, should ideally be based on an assessment of the needs of your audience. My understanding is that you’ll be lecturing a group of aspiring graphic designers with little or no awareness of the complexities of type and typography. From this I draw a few conclusions:\n\n1. **First things first –** It’s tempting to show off what we know about type when talking to novices, but I don’t see much point in _starting_ with nomenclature and an anatomy of letterforms. As Hrant has suggested, I believe it’s important to “start with the purpose”: what the principal goal of typography is; the things that one should never lose sight of when designing a page and making decisions about typeface, line length, text block, etc. \n2. **Developing awareness –** The first step towards becoming good at painting, sculpting, cooking or taking photographs is developing an awareness of the art/craft. The very first thing aspiring chefs need to learn is not how to chop vegetables lighting fast like they do on TV, or how to combine ingredients, but how to identify nuances in smells and tastes, judge their intensity, and appreciate the harmony and subtleties of a really good dish or meal. For this, John Labovitz’s idea makes a lot of sense: take a seemingly ordinary page and help the audience start appreciating it; help them see the craft (and the science?) behind something that looks so simple but is actually the product of a lot of hard work.\n3. **Whetting appetittes –** Héctor’s and David’s suggestions have one thing in common: they talk about getting the audience curious and interested in things that they’ll later need to find out more about on their own. Frankly, I don’t think there’s any other way to introduce typography in one hour! Going back to John’s suggestion, if you take the time to study a well-composed page, you’ll have the opportunity to drop a few terms in passing and also to call the audience’s attention to a few traditions (history) here, a little math there, some design principles, etc. This way you won’t be “lecturing” — which can be boring — and will be giving the audience a digestible amount of information, perhaps even leaving them slightly hungry and wanting to learn to cook for themselves...\n\n"
    },
    {
      "time": " 10.May.2007 2.35pm",
      "content": "Does anyone know about the typeface  \n“Egypiennes Elargies”?\n\nIt is old slap serif. I am looking for as digital font.  \nPlease help.\n\n"
    },
    {
      "time": " 10.May.2007 8.15pm",
      "content": "Slap serif, I like that! Serif, you’ve been a very bad boy...\n\n"
    },
    {
      "time": " 11.May.2007 8.40am",
      "content": "everyone has made some very good suggestions, and i’m reshuffling my strategy a bit.  \nthanks!\n\n"
    },
    {
      "time": " 11.May.2007 8.42am",
      "content": "and i have to say, martiniflat’s beautifully inspired non sequitor brightened my whole day.  \nslap serif! brilliant! THAT’s making its way into the lecture, certainly!\n\n"
    },
    {
      "time": " 11.May.2007 11.38am",
      "content": "I know, I know you guys are laughing at me.  \nMy typo...  \nFirst: “Egyptiennes Elargies” Yes Egyptian face.  \nSecond: “Slab” not “Slap”\n\nI feel embarrassed.  \nOK back to work.\n\n"
    },
    {
      "time": " 11.May.2007 11.53am",
      "content": "Well, “slap serif” is certainly a better term than “snap-on  \nserifs”, which is an actual (if quite rare) typographic style! :-)\n\nhhp\n\n"
    },
    {
      "time": " 11.May.2007 12.20pm",
      "content": "Or “strap-on” serifs.\n\nThis is getting silly.\n\n"
    },
    {
      "time": " 29.May.2007 12.45pm",
      "content": "martiniflatsdon’tgoawaygoofy now; it’s them not you, and feel free to start your own thread on almost any Egyptians you like. These ’ophiles were, just digital moments from now, about to start on about the great font hawkey movie “Slabshot”.\n\n"
    }
  ]
}
