{
  "id": "33579",
  "title": "Similar to Neutraface, but allows for web embedding",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Suggestions?\n\n",
  "author": "Miss Tiffany",
  "time": "7 May 2007 — 11:02am",
  "uid": "108",
  "comments": [
    {
      "time": "7 May 2007 — 6:10pm",
      "content": "Well, Futura from Adobe allows editable embedding, the Futuras from ScanGraphic, EF and Bitstream allow read only embedding, as does Lanston's 20th Century.\n\n"
    },
    {
      "time": "8 May 2007 — 6:50am",
      "content": "What do you mean by \"web embedding\"?\n\nHTML font embedding is a fad/idea that has come and gone. It's not a practical option anymore.\n\nOr are you referring to PDF/Flash embedding?\n\n"
    },
    {
      "time": "10 May 2007 — 12:39pm",
      "content": "I was referring to Flash/SiFR. But, the client has decided to stick with Neutraface so we will only use it in static images. Thanks guys.\n\n"
    },
    {
      "time": "10 May 2007 — 2:03pm",
      "content": "What's with foundries not allowing embedding? Absurd.\n\n"
    },
    {
      "time": "10 May 2007 — 7:24pm",
      "content": "What's with people buying from foundries that don't allow embedding?\n\nFriends don't let friends buy fonts they can't use!\n\n"
    },
    {
      "time": "10 May 2007 — 8:41pm",
      "content": "<cite>What’s with foundries not allowing embedding? Absurd.</cite>\n\nTo be fair, most foundries will allow embedding, but with a different licenses and cost structures than are allowed when a font is licensed for use in print.\n\n"
    },
    {
      "time": "11 May 2007 — 7:43am",
      "content": "\"What’s with people buying from foundries that don’t allow embedding?\"\n\nTouche!\n\nSo, who's willing to make the first embeddable Neutraface knock-off? I'm thatt person will garner equal amounts of praise and hatred from the type community. ;o)\n\n\"To be fair, most foundries will allow embedding, but with a different licenses and cost structures than are allowed when a font is licensed for use in print.\"\n\nMeh. OK, fine. I'll grant them that one. But it's still absurd, IMHO. Why should the substrate change the license? (That said, I concede that that is not an uncommon concept especially when you look at licensed stock photography and the like...)\n\n"
    },
    {
      "time": "11 May 2007 — 10:16am",
      "content": "It comes down to two things, I think. (Based on recent EULA research.)\n\n1. Many foundries do not trust the current technology to protect their IP.  \n2. All businesses have the right to determine what their fonts are worth and in what instances the fonts become worth more.\n\nYeah, sad, but I don't charge based on the project, necessarily, either. I charge by what the client needs too.\n\n"
    },
    {
      "time": "11 May 2007 — 11:53am",
      "content": "\"most foundries will allow embedding, but with a different license\"...\n\nYes, but an embedding license for House fonts which allows for general use adds a fee of $150 PER YEAR for each font, so an embedding license for the full range of Neutraface fonts means you would be paying an additional $2,250 PER YEAR, over the original one time cost of $249.\n\nThat's a _very_ different license, \"to be fair\" !\n\nI'm not saying that they shouldn't charge that fee, I'm just saying I wouldn't pay it, I'd buy something else. They're clearly not trying to sell to small time operators like me.\n\n"
    },
    {
      "time": "11 May 2007 — 4:55pm",
      "content": "<cite>So, who’s willing to make the first embeddable Neutraface knock-off?</cite>\n\nAnyone who can knock off Christian Schwartz probably has better things to do. His curves are better than Mamie Van Doren’s!\n\n"
    },
    {
      "time": "11 May 2007 — 5:40pm",
      "content": "<cite>To be fair, most foundries will allow embedding, but with a different licenses and cost structures than are allowed when a font is licensed for use in print.</cite>\n\nHere is one from column B: All the book printers I know require the fonts in the PDF (sent to them for printing) to be embedded. Usually subsetting is OK. So, the \\*unembeddable fonts\\* can't be used for printing either, except I guess on your personal laser/inkjet printer.\n\nAs the man said; \"Friends don't let friends buy such things.\"\n\n"
    },
    {
      "time": "12 May 2007 — 9:12am",
      "content": "Just to clear up any confusion about our license:\n\nIf you look at our [licensing pricing page](http://web.archive.org/web/20140815035107/http:/www.houseind.com/index.php?page=licensing&section=pricing), you'll see that \"our base license does, however, allow you to embed fonts in a .pdf to be sent to a service bureau or printer.\" Where we do charge extra is for cases when one is using the fonts in a PDF document that is sent out for distribution (as in the case of a PDF newsletter). If the text is non-editable, then it is either 10 cents per PDF sent, or a flat fee of $150 dollars for the year. John is correct that this is per font. However it is just for the fonts used in the PDF document, so I doubt that one would run into the case of having to embed every font in the Neutraface family into a PDF. Also note, that the yearly fee is the one that is re-occurring, and only if you are still distributing PDFs with the font in it.\n\nFor PDFs that are editable, we treat the PDF file like a raster device, meaning that one does need to have a license for each PDF. This is licensed at our multiple device site license pricing schedule (which gives a very healthy discount to multiple licenses).\n\nFor Flash, we judge the fee on a case by case basis, though in general this is free for static text (meaning text that isn't being edited by a user, not text that is moving around the screen) and with a fee for a font being embedded as 'dynamic' text. Call us and we'll be more than happy to help you out.\n\n"
    },
    {
      "time": "12 May 2007 — 10:10am",
      "content": "Thanks Ben. I should've made that point right away. I didn't mean this to turn into a negative thread. I respect the EULA which came with my license of Neutraface and that is why I was searching for an alternative in the even that my client thought they might like some sort of embedding which might be questionable.\n\n"
    },
    {
      "time": "14 May 2007 — 6:56am",
      "content": "\"it is either 10 cents per PDF sent\"\n\nCrazy. More power to you guys if it works, though...\n\n"
    }
  ]
}
