{
  "id": "33578",
  "title": "Undefeated Slab Serif with Tuscan Bulges?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I'm not sure why but I suspect this may be a custom font...\n\n ![](http://web.archive.org/web/20130817080512im_/http:/typophile.com/files/Undefeated04_5814.jpg)\n\nBTW is there a typographic name for those half diamonds on the outer sides of the uprights?\n\n",
  "author": "wormwood",
  "time": "7 May 2007 — 10:32am",
  "uid": "14065",
  "comments": [
    {
      "time": "7 May 2007 — 10:42am",
      "content": "Don't know what I'd call it other than a decorative embellishment usually associated with [old west fonts](http://web.archive.org/web/20130817080512/http:/www.fontshop.com/search/?q=old+west).\n\n"
    },
    {
      "time": "7 May 2007 — 11:09am",
      "content": "IIRC the triangular shape first appeared in the Didot on the lowercase-l (ell) to differentiate it somehow. I've emailed the big guns to see if they can't clarify.\n\n"
    },
    {
      "time": "7 May 2007 — 11:23am",
      "content": "Sure you aren't thinking of a [long s](http://web.archive.org/web/20130817080512/http:/en.wikipedia.org/wiki/Long_s), Tiff?\n\n"
    },
    {
      "time": "7 May 2007 — 11:37am",
      "content": "You might be able to closely replicate this by adding the diamond thingies to Berthold City.\n\n- Lex\n\n"
    },
    {
      "time": "7 May 2007 — 12:16pm",
      "content": "I belief the \"diamond thingies\" described here are typical Tuscan embelishment arising out of 19th century woodtype design. I'm no type historian so identifying the \"first\" example is beyond my brain.\n\nWhat's cool about this is that it combines the tuscan element with an industrial feeling geometric slab. The result is a very hip mashup.\n\nBTW following is a digital font I'm pretty sure, the serifs are off but the basic slab, and diamonds are right on.\n\n ![](http://web.archive.org/web/20130817080512im_/http:/typophile.com/files/western_4452.jpg)\n\nThis also is in the same veign, but a sans:  \n [http://www.myfonts.com/fonts/woodentypefonts/gothic-tuscan-round/](http://web.archive.org/web/20130817080512/http:/www.myfonts.com/fonts/woodentypefonts/gothic-tuscan-round/ \"http://www.myfonts.com/fonts/woodentypefonts/gothic-tuscan-round/\")\n\n"
    },
    {
      "time": "7 May 2007 — 12:52pm",
      "content": "Perhaps I'm going to far back in history. It was the lowercase-l (ell) and I'm pretty sure it was Didot.\n\n"
    },
    {
      "time": "7 May 2007 — 1:23pm",
      "content": "Tiffany you're talking about the mark first seen in  \nthe RdR, but it's not really the same thing as this.\n\nhhp\n\n"
    },
    {
      "time": "7 May 2007 — 1:33pm",
      "content": "Thanks, Hrant. That's right. Yes, I know that now. That's why I said I think I went too far back.\n\n"
    },
    {
      "time": "7 May 2007 — 4:38pm",
      "content": "Blimey. Have I really stumped Typophile twice in one post? I doubt it.\n\nSo it's a custom font and those embellishments have no standardised typographic anatomical name then.\n\nI'm guessing Tuscan embellishments come in a variety of forms and positions on a glyph? Googling the phrase \"Tuscan embellishment\" only results in one highly inappropriate result. So it doesn't look like that singular element can be called that then.\n\nThanks for your efforts everyone anyway :)\n\n"
    },
    {
      "time": "7 May 2007 — 4:53pm",
      "content": "\"Tuscan flourish\" is the more common expression.\n\nhhp\n\n"
    },
    {
      "time": "7 May 2007 — 5:29pm",
      "content": "Sorry to go on, but just to clarify, is “Tuscan flourish” the expression for just those side spur thingies or for a variety of wobbly bits like in Randy's picture above?\n\n"
    },
    {
      "time": "8 May 2007 — 11:12am",
      "content": "If anything, given this genre, spur is perfect.\n\n"
    },
    {
      "time": "10 May 2007 — 12:28pm",
      "content": "According to the Baines/Haslam [Typography](http://web.archive.org/web/20130817080512/http:/www.amazon.com/Type-Typography-Phil-Baines/dp/0823055280/ref=pd_bbs_sr_1/002-0092307-4095208?ie=UTF8&s=books&qid=1178825147&sr=8-1) book, Tuscans are classified as such based on whether or not their serifs fork. The passage goes on to say that toward the end of the 19th century, Tuscan stems began to aquire \"bulges\" (from which one would guess the diamond-shaped embellishments evolved).\n\n"
    },
    {
      "time": "10 May 2007 — 2:17pm",
      "content": "Thanks Eric. That will do for me.\n\nSo without anything more definitive can we declare those half diamonds on the outer sides of the uprights a...\n\n**TUSCAN BULGE**\n\nHow would one go about making it official? I like the phrase for its risqué double entendre alone. It's a shame the Tuscany region isn't one of the bulges in the Italian coastline.\n\n"
    },
    {
      "time": "10 May 2007 — 2:32pm",
      "content": "_How would one go about making it official?_\n\nstart using it. if others like it they'll start using it.\n\n"
    },
    {
      "time": "10 May 2007 — 2:34pm",
      "content": "Of course even better would be to use the Italian term for bulge...\n\nAnd what Paul said.\n\nhhp\n\n"
    },
    {
      "time": "10 May 2007 — 2:40pm",
      "content": "Hey, Paul, did you happen to see those Tuscan Bulges on the Undefeated logotype at the start of this thread? I thought, as Tuscan Bulges go, they were quite good ones. I especialy liked the way these Tuscan Bulges were complimentary to the angles elsewhere in the font.\n\nOf course these Tuscan Bulges are not the most Tuscan of Tuscan Bulges or even the most bulging of Tuscan Bulges but they are still very nice Tuscan Bulges all the same.\n\n"
    },
    {
      "time": "10 May 2007 — 2:54pm",
      "content": "Nah, nice try, but that won't do it. It's got to become widely used by lots of folks in these forums, like Tiffany's term _' [Squooshed](http://web.archive.org/web/20130817080512/http:/typophile.com/wiki/squoosh)'_. ;)\n\n- Mike Yanega\n\n"
    },
    {
      "time": "10 May 2007 — 3:52pm",
      "content": "heh, my new favorite term i hope catches on is [some-serifs](http://web.archive.org/web/20130817080512/http:/typophile.com/wiki/some-serifs). Hypatia Sans is a great exemplar of the _some-serifs_ genre of typefaces.\n\n"
    },
    {
      "time": "10 May 2007 — 5:17pm",
      "content": "Paul, it's funny you should mention that because I've been working on a design for a **some-slab serif** typeface.\n\nI may even do a version with Tuscan Bulges :D\n\n"
    },
    {
      "time": "10 May 2007 — 5:22pm",
      "content": "I thought I might return to the original question, and suggest a similar typeface, though not as squared. It does have the 'Tuscan Bulges' (patent pending). See [Cowboy Western](http://web.archive.org/web/20130817080512/http:/www.myfonts.com/fonts/fontmesa/cowboy-western/) from Font Mesa.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "10 May 2007 — 5:47pm",
      "content": "Jeepers Mike, someone could lose an eye on those Tuscan Bulges ;)\n\n"
    },
    {
      "time": "10 May 2007 — 5:57pm",
      "content": "The only Tuscan Bulge I get is when I eat too much good Italian food. ;-)\n\n"
    },
    {
      "time": "10 May 2007 — 6:01pm",
      "content": "Hey, Linda, youz can call me Toni. I got a Tuscan Bulge in my Levi's just for you sweet cheeks ;)\n\n"
    },
    {
      "time": "10 May 2007 — 7:27pm",
      "content": "ROFL: take a number and stand in line. ;-)\n\n"
    },
    {
      "time": "11 May 2007 — 5:27am",
      "content": "Good point, well made, denis, but I don't see the relevance to Tuscan bulges?\n\nGraham\n\n"
    },
    {
      "time": "11 May 2007 — 7:19am",
      "content": "I like how \"Denis\" entered a first name, but put random gibberish in the other fields of his registration.\n\n- Lex\n\n"
    },
    {
      "time": "11 May 2007 — 7:32am",
      "content": "If you gonna do something (pointless - especially on a type website) you might as well do it properly.\n\nbye bye denis.\n\nGraham\n\n"
    },
    {
      "time": "11 May 2007 — 10:27pm",
      "content": "Don't mind me. Just taking notes here for future developments...\n\nBut anyway, [Bablefish](http://web.archive.org/web/20130817080512/http:/babelfish.altavista.com/) translates \"Tuscan bluge\" as \"Rigonfiamento toscano\".\n\n"
    },
    {
      "time": "13 May 2007 — 11:32am",
      "content": "Iberian bulges?  \n [http://www.myfonts.com/fonts/cubanica/sombra/](http://web.archive.org/web/20130817080512/http:/www.myfonts.com/fonts/cubanica/sombra/ \"http://www.myfonts.com/fonts/cubanica/sombra/\")\n\nhhp\n\n"
    },
    {
      "time": "14 May 2007 — 5:57am",
      "content": "_Iberian bulges?_\n\nA bit too sharp for my liking.\n\nLatino bulges?\n\n ![](http://web.archive.org/web/20130817080512im_/http:/typophile.com/files/LatinoBulgesJLo_4033.jpg)\n\n"
    },
    {
      "time": "14 May 2007 — 9:59am",
      "content": "I think bulge in this instance implies something ugly. If something is bulging, it seems to me, it is a lack of proper engineering or design. However, the above typographic and \\*ahem\\* physcial features are both not ugly and designed on purpose.\n\n"
    }
  ]
}
