{
  "id": "33586",
  "title": "Kate Moss the brand, Kate Moss the typeface",
  "forum": "Joe Pemberton's blog",
  "tags": [

  ],
  "content": "Kudos to Kate Moss for having her own font... Every super model should have her/his own typeface, just as every one-person \"celebrity brand\" should. But, it shouldn't be released to the public when the design feels like a draft version.\n\nI can imagine the brand brief describing the need for a typeface that matches Moss' anemic and unnatural look, in which case, maybe this design fits the brief. There are just too many problems to mention, and this post would become a mean-spirited critique. See it for yourself -- it just doesn't hold up even under the most basic scrutiny.\n\n[\n ![](http://web.archive.org/web/20141012030657im_/http:/typophile.com/files/katemoss_4751.jpg)\n](http://web.archive.org/web/20141012030657/http:/www.creativereview.co.uk/crblog/kate-moss-the-brand/)  \n(Kate Moss typeface designed circa 2007)\n\nYou probably remember Paul Barnes' much more successful design of Björk's typeface for her Pagan Poetry album in 2005. That font was available for download for free (and still may be [free at DaFont.com](http://web.archive.org/web/20141012030657/http:/www.dafont.com/font.php?file=pagan_poetry)). However, the work for Pagan Poetry felt much more finished, even though it has a lot of the negative qualities of free fonts -- too oft repeated shapes and awkward characters forced into artificial compliance. But, overall, the Pagan Poetry face works, especially in the context of 2 words, and not a typeface meant for long text.\n\n[\n ![](http://web.archive.org/web/20141012030657im_/http:/typophile.com/files/pagan_poetry_6031.png)\n](http://web.archive.org/web/20141012030657/http:/www.dafont.com/font.php?file=pagan_poetry)  \n(Pagan Poetry typeface designed circa 2005)\n\nRead the article on [Creative Review's blog](http://web.archive.org/web/20141012030657/http:/www.creativereview.co.uk/crblog/kate-moss-the-brand/).\n\n",
  "author": "Joe Pemberton",
  "time": "7 May 2007 — 2:01pm",
  "uid": "1160",
  "comments": [
    {
      "time": "7 May 2007 — 2:24pm",
      "content": "\\> even though it has a lot of the negative qualities of free fonts\n\nBut Barnes was paid to do it, right?  \nSo it's not exactly a \"free\" font in the useful sense.\n\nhhp\n\n"
    },
    {
      "time": "7 May 2007 — 2:45pm",
      "content": "I should read before I blog. Turns out there's a Typophile discussion on [this subject already...](http://web.archive.org/web/20141012030657/http:/typophile.com/node/30745)\n\nIt's funny, but the original Alexey Brodovitch sample has some quirks in the printing, and in it's usage that give back some life that is lost in the digital translation.\n\n"
    },
    {
      "time": "7 May 2007 — 2:58pm",
      "content": "I agree, Joe. That which has been lost is the hand. I'd call this a parody because it really lacks the same spirit.\n\n"
    },
    {
      "time": "7 May 2007 — 3:00pm",
      "content": "Interesting... Guess they decided not to go with the font already named for her: Interstate Kate Moss Four (and Ten)\n\nj\n\n ![](http://web.archive.org/web/20141012030657im_/http:/typophile.com/files/moss_6021.png)\n\n"
    },
    {
      "time": "7 May 2007 — 3:19pm",
      "content": "\"See it for yourself — it just doesn’t hold up even under the most basic scrutiny.\"\n\nWhat are you looking for? I think it works. You know the history of the type, surely you can see how it works!\n\n—K\n\n"
    },
    {
      "time": "7 May 2007 — 3:28pm",
      "content": "And here, Joe: [http://typophile.com/node/33422](http://web.archive.org/web/20141012030657/http:/typophile.com/node/33422 \"http://typophile.com/node/33422\") :-P\n\n"
    },
    {
      "time": "7 May 2007 — 3:30pm",
      "content": "I think it works for the market. Aren't her clothes being sold \"on a high street near you\" at Top Shop? That is trend central. Nothing lasts forever.\n\n"
    },
    {
      "time": "7 May 2007 — 10:43pm",
      "content": "Dear Joe,\n\nMaybe it's just because I'm English but I don't find Kate Moss to be odd looking or anemic at all. Yes she's slender but quite average looking really, and that's why she's such a good model! I can imagine myself wearing a lot of the clothes she wears if only I had thousands of quid to buy them. Perhaps I'm not paying good enough attention but I haven't seen mention anywhere of a whole typeface being made for Kate, just this logo which I find quite cute and VERY Kate and I don't understand why so many people have piled on to hate it so much, particularly men. I'm going to assume that you're not a transvestite, so you're not really in the target market for Kate's fab new brand are you? I'd kill to look good in the hotpants but I'm quite pleased with the tunic dress I waited on queue all night for.\n\n"
    },
    {
      "time": "8 May 2007 — 2:33am",
      "content": "Everybody, put on your best [Blue steel](http://web.archive.org/web/20141012030657/http:/www.wapers.com/tvsnmovie/zoolander/zoolander11024.jpg) face and realize: It was art directed by Peter Saville. By his mere presence in this project it _is_ fashion. If we don't get it now, we will eventually.  \nIn that sense this is as close as design gets to art; not relying on inherent qualities, it will become art/fashion by context. Not that I think the logo isn't nice – I do. Now stop sucking in those cheeks.\n\nƒ\n\n"
    },
    {
      "time": "8 May 2007 — 11:39am",
      "content": "Nigella, I'm not an 11 year old, but I've designed for them. I'm not a mom, but I've designed for moms. I am a designer and I've designed for designers (probably the most fun, and most challenging at the same time). A designer worth any salt should have an ability to step outside him/herself and view something objectively.\n\nFor the record I do think Peter Saville's work is very interesting. I also agree that fashion is fickle, fleeting, and ephemeral, but it doesn't have to be weakly executed.\n\n"
    },
    {
      "time": "8 May 2007 — 3:00pm",
      "content": "_There are just too many problems to mention, and this post would become a mean-spirited critique._\n\nActually, I'm interested to hear your critique. It's almost as mean-spirited _not_ to mention what's wrong, no?\n\nFrom what little I know of the brand, I think the type fits perfectly.\n\n"
    },
    {
      "time": "10 May 2007 — 1:59am",
      "content": "Just my two cents:  \nI love the way Kate Moss looks and I have seen pictures of her playing around with children in which she looks actually very natural and comfortable in her (quite skinny) naked body.  \nAnd then there is this logo which seems completely geometrical, defunct of charm, a clumsy redrawing of a bad copy of a Didone of some sort... To me it doesn't seem particularly fashionable or trendy or stylish, just awkward.\n\nI think she deserves better!\n\nGoodness—Truth—Beauty\n\n"
    },
    {
      "time": "10 May 2007 — 9:39am",
      "content": "Kate Moss has balls.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    }
  ]
}
