{
  "id": "33603",
  "title": "TypoWiki",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I read these boards pretty often, I find that for the most part it's the best design-related discussion spot on the web. Certainly, the folks posting here have a more honest relationship to letterforms, spacial graphic design, etc.—it's nice to find a place where design isn't an \"occupation\" but a practice. An art that is open and encouraging of conversation.\n\nWhy all of the fluff? It isn't to stroke egos or anything. Actually, it's about the [wiki](http://web.archive.org/web/20150417124843/http:/typophile.com/wiki/typowiki) site. Every once in awhile I look at the typowiki to see if there is anything fresh there. Sadly, i'm usually unsatisfied. As a young, emerging letterpress printer and design enthusiast, i'd like to encourage all of the seasoned veterans out there to help fill in the holes on the wiki page. It has the potential of being a great resource that could really help those of us eager young ones who are skeptical of schools. I've read my fair share of text—robert bringhurst, for example—on the subject, but i've found the web, time and time again, sorely lacking in educational material about typography, type-design/philosophy, and history.\n\nI'm not from some kid going through a phase with a macbook, but from someone genuinely longing to discover more about the history and components of type design. I don't have the money for school, I volunteer all of my time for local community-based mutual aid projects and i just barely get by with odd-jobs here and there. I'm not looking to make a bunch of money either. I just want to run a print studio and make those resources available to my neighborhood.\n\nConsider this a plea. A plea for contributions to the TypoWiki. I'll do what I can to help from my end, but is it possible to start working on taking the trajectory of that seriously? Photos/screenshots. Cross-referenced articles. Biographies? It seems like if everyone too the time to write up a few paragraphs about something they feel particularily strongly about, it could easily become the only elaborate resoure available online.\n\nAnyone agree? I'm definitely willing to provide moral support, and offer what i can when i can.\n\n",
  "author": "circehouse",
  "time": "8 May 2007 — 7:48am",
  "uid": "16375",
  "comments": [
    {
      "time": "8 May 2007 — 8:27am",
      "content": "I have a few suggestions to improve the usability of the wiki.\n\n1.) A wiki-only search box would help people use the wiki more easily, and this would increase the likelihood of the wiki becoming a more prominent resource. I know you can use the advanced search options to limit your search, but it's not obvious. E.g. If i search for \"helvetica\", the first several results are links to the forum, and the wiki entry on Typefaces comes before the wiki entry on Helvetica itself.\n\n2.) There should be a simple option to \"create a new wiki entry\". On a cursory examination, I couldn't find any instructions on how to do it, even in the FAQ.\n\n2b.) Perhaps I've been spoiled by Wikipedia, but It would be really grand if upon failing to find a given entry, you would be automatically presented with an option to create that entry.\n\nThanks for listening, and thanks for encouraging me to edit the wiki; I will take some time to contribute.\n\n"
    },
    {
      "time": "8 May 2007 — 8:50am",
      "content": "The search is quite bad anyway. It doesn't work half of the time. :)\n\n"
    },
    {
      "time": "8 May 2007 — 8:59am",
      "content": "<cite>I’ve read my fair share of text—robert bringhurst, for example—on the subject, but i’ve found the web, time and time again, sorely lacking in educational material about typography, type-design/philosophy, and history.</cite>\n\nTypography is a subject that is both esoteric and highly technical. Not many people in the world who are highly qualified to write about type have the time or are even interested in doing so. Asking Typophile’s knowledgeable members to fill in a Wiki is not the same as Jamie Wales asking the general public to fill in Wikipedia. Wikipedia is a collection of random factoids constantly being strung together into semi-comprehensible articles by a small army of hack writers, not knowledgeable professionals. It’s unreasonable to expect the people who do have this knowledge to take time out of their lives write for a Wiki knowing that they will receive no compensation for their efforts and that anyone else can come along and muck it up at any time.\n\n"
    },
    {
      "time": "8 May 2007 — 9:36am",
      "content": "First of all, let me clarify that i'm not asking for history lessons, or obscure nuggets of trivial esoteric information. What i'm saying is that a good chunk of the conversations that happen in this community occur between only a handful of people, and I think it's because the level of information about the subjects online is significantly inadequate. It wouldn't require much more time than is devoted to the conversations themselves to fill the holes in the wiki. If not us, then who?\n\nYou understand what I'm suggesting? This is less of a demand on a few longest-inning scholars to provide relic data, and more a charge to fill in very BASIC parts of the wiki.\n\nFor example, it's not to out-of-the-question to want to look up \"apostrophe\" in the wiki and find _something_. Please don't think this is a guilt-trip or a substance-lacking demand on some non-existent responsibility the more experienced among us have to preserve this tradition, I just gathered from what i've read that participants in the discussions here are enthusiastic about these processes/practices in a way that supersedes the typical \"whats in it for me?\" business person.\n\nAm I the only one who thinks something VERY important about the craftsmanship and art of type and typography is being lost right now? I think that the lack of online information is proof of that. All of the accomplished scholars are moving into the realm of the internet, but none of the accompanying collective-information is following them.\n\nI'm not trying to ride free on others experience here, I'm trying to access and preserve something I'm worried I'm too young to explore, and that is typography and type design as a craft. I'm not a business person.\n\nI've said this a few times, I'm really not trying to simply \"expect people to take time out of their lives\" for this, or me. I'm assuming that time is already devoted to sharing and sculpting the art form, and am simply encouraging that some of that take place on the wiki. Does that seem crazy? I'm I just another jerk? Let me know.\n\n"
    },
    {
      "time": "8 May 2007 — 10:34am",
      "content": "<cite>Am I the only one who thinks something VERY important about the craftsmanship and art of type and typography is being lost right now? I think that the lack of online information is proof of that. All of the accomplished scholars are moving into the realm of the internet, but none of the accompanying collective-information is following them.</cite>\n\nAFAIK there are more books being published about typography and design now than ever before. At the same time, Google, Microsoft, and several universities are scanning up vast book collections to go online for free, typography books are in there. Information is not being lost.\n\n<cite>I’m really not trying to simply “expect people to take time out of their lives” for this, or me. I’m assuming that time is already devoted to sharing and sculpting the art form, and am simply encouraging that some of that take place on the wiki. Does that seem crazy?</cite>\n\nTheres a big difference between people having conversations about this stuff and writing finished pieces for a Wiki that will be treated as an authoritative source. Wikis also have upkeep problems—people with differing opinions overwriting each other constantly, people dumping in incorrect information, defacement, etc. Simply posting to forums may be less convenient for information seekers but it is easier on the authors.\n\n"
    },
    {
      "time": "9 May 2007 — 8:56am",
      "content": "tyler,  \ngood on you for wanting to learn more here at typophile. that's exactly what this site is for. when i stumbled upon typophile a few years ago i must have been thirsty for knowledge like yourself. at that time there was no typowiki, so my _modus operandi_ was to ask questions: a lot of them. as i got to know typophile better, i realized what a wealth of information is on these boards and i think i may have been the first to publicly wish for a wiki. my vision was to have a place to bring together all the separate threads on related topics into one place. the wiki can be so much more than this though. with the rebirth of typophile in 2005 and the advent of the wiki, my MO is somewhat different now. when i have questions about type i 1) search, 2) gather relevant information, and 3) enter what i have learned into an article in the wiki. i don't think it's unreasonable to ask those who use typophile as a resource to give back in this manner. the typowiki is still young and the number of contributers is relatively small, but it's growing. if you want to see the wiki grow, do your research and leave what you've learned for others to build on. that's what i try to do, hopefully what i cobble together is of use to others of you out there.\n\n"
    },
    {
      "time": "11 May 2007 — 5:20pm",
      "content": "Paul - Exactly the response I was hoping for. Of course, I don't expect lay about while everyone else fills the holes. Like I said, I want to contribute to the wiki as much as possible. Thanks for the encouragement.  \nTyler\n\n"
    }
  ]
}
