{
  "id": "33621",
  "title": "Do you know info on Giambattista Bodoni?",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "I'm doing a research pape on [Giambattista Bodoni](http://web.archive.org/web/20150416134608/http:/typophile.com/wiki/Giambattista%20Bodoni). I was wondering if anyone knows information about him of what tools he used to make his type. Also, more about his life for instance if he had children and other things. I've found a couple pages of info, but I feel like i'm missing a lot of data.\n\nthank you\n\n",
  "author": "dcorbera26",
  "time": "8 May 2007 — 2:42pm",
  "uid": "18485",
  "comments": [
    {
      "time": "8 May 2007 — 3:25pm",
      "content": "Haven't had a chance to read it yet (it's on my to-read list), but I've heard good things about Alessandro Segalini's [timeline](http://web.archive.org/web/20150416134608/http:/www.typeculture.com/academic_resource/articles_essays/pdfs/tc_article_42.pdf) of Bodoni.\n\n"
    },
    {
      "time": "8 May 2007 — 3:44pm",
      "content": "_Typographic Milestones_ by Allan Haley has a good article on Bodoni and his background. He was married, but I don't recall if he had children or not.\n\nU&lc also had a Bodoni issue when they released the ITC Bodoni, and the out of print FMR magazine had an article on the Bodoni museum in Parma including pics of his punches and tools. I believe it was just files and gravers like most type cutters of the time.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "5 Sep 2007 — 4:49pm",
      "content": "Are you kidding me? I'm not going to do you homework. Use Wikipedia for Godssakes.\n\nH. Todd Duren,  \ndesigner. educator. yada yada\n\nmyopendoor.net\n\n"
    },
    {
      "time": "5 Sep 2007 — 6:59pm",
      "content": "On the other hand, Todd, you don't need to be so mean. Yes, one can't expect others to do the work for them, but simple suggestions are a polite way to say the same thing.\n\n"
    },
    {
      "time": "10 Sep 2007 — 11:09am",
      "content": "Yeah, Wikipedia has 141 words on Bodoni. Should be no problem fleshing that out into a 20 page essay. (And since the original post was in May, I suspect that the user has finished the paper).\n\n"
    },
    {
      "time": "10 Sep 2007 — 2:52pm",
      "content": "Dave: most of the books about type history, especially the anthologies like Lawson’s <cite>Anatomy of a Typeface</cite> or Updike’s <cite>Printing Types</cite> have informations on Bodoni. Some of them are listed [here on Typophile](http://web.archive.org/web/20150416134608/http:/typophile.com/books/typedesign-history), I would recommend to check with your school library if they have any available.\n\nThere’s also a great deal of information available on the man, depending how deep you want to go in your research. Unfortunately most of what I’ve found so far is available only in Italian (but that’s an advantage for me since that’s my first language!). For example, [issue #9 of <cite>Progetto Grafico</cite>](http://web.archive.org/web/20150416134608/http:/www.aiap.it/libreria.php?ID=335), one of Italy’s leading graphic design journals, has a substantial section about Bodoni’s types and derivative works.\n\n"
    },
    {
      "time": "31 May 2008 — 3:01pm",
      "content": "I hope your experience of writing an essay has sparked an interest in Bodoni. If you can its a great experience to visit the Bodoni Museum in Parma italy. You will have to ring to make an appointment and when I went in February last year it was freezing cold as the heating was off. I had the chance to hold Bodoni's punches in my hand (as there were only two of us visiting) and they looked as if they had been cut yesterday.\n\n"
    },
    {
      "time": "3 Aug 2008 — 6:29pm",
      "content": "Frederick Goudy's book refers to Bodoni and his students (apparently, he had a famous school of type design), and their involvement in the creation of type used to ptoduce the classic Jewish books.\n\nInterestingly, the design of the Romm family typeface designs, based upon ancient Sephardic drawings resembled Bodono's unique design style making one wonder who influenced who?\n\n"
    }
  ]
}
