{
  "id": "33629",
  "title": "Altered Fonts and Legal Issues",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I altered a version of Gill Sans for a project in art school. I recently was considering making it available for free to a few fellow designers who asked for a copy but was unsure of the legal issues surrounding it. Is there anywhere I can view guidelines on that sort of thing?\n\nHere is the extent of the editing:  \n [http://www.kingdomofawesome.com/images/gillrounded.jpg](http://web.archive.org/web/20131012195546/http:/www.kingdomofawesome.com/images/gillrounded.jpg \"http://www.kingdomofawesome.com/images/gillrounded.jpg\")\n\n",
  "author": "HaleyFiege",
  "time": "9 May 2007 — 8:45am",
  "uid": "17709",
  "comments": [
    {
      "time": "9 May 2007 — 9:01am",
      "content": "Generally, when a font is purchased it comes with a EULA that outlines what is acceptable use of the font and often includes a clause for such things as modifying and use of the modified font.\n\nEach foundry is different, so the best thing to do is to go and check out the ELUA on the vendors website and see what they have to say about it.\n\n"
    },
    {
      "time": "9 May 2007 — 9:39am",
      "content": "Read the EULA (or eewULA) or just look at this very informative chart (I would love to credit who made this, but I can't remember offhand... SOTA?):  \n [http://fontlab.wikidev.net/Image:Interrobang2-EULA-chart.gif](http://web.archive.org/web/20131012195546/http:/fontlab.wikidev.net/Image:Interrobang2-EULA-chart.gif \"http://fontlab.wikidev.net/Image:Interrobang2-EULA-chart.gif\")\n\nBut in general, I would venture that the answer is NO NO NO.\n\n"
    },
    {
      "time": "9 May 2007 — 10:23am",
      "content": "Yeah didn't think so.  \nThat graph is amazing!\n\n"
    },
    {
      "time": "9 May 2007 — 10:31am",
      "content": "The law will allow the appropriation of letterforms, but not \"point piracy\" -- i.e. tampering with font software. This creates the strange scenario where typefaces that look a lot more like Gill than yours are legal because they were created with fresh BCPs, whereas yours, which is conceptually quite a stretch from the original, is illegal because you started with someone else's digital data.\n\nI think the law is correct, because the intent is to stop cheating (i.e. capitalizing on someone else's work and taking a short-cut to the finished product), but not to give creators the kind of monopoly that censors cultural give-and-take. One issue is that this distinction is abused by foundries that knock off designs, but nonetheless remain within the letter of the law by making fresh outlines. Another issue is that sampling is a legitimate creative technique in the digital era, but its legality is problematic for copyright laws that were developed much earlier.\n\nSo, if you were to print out your font, scan it, paste the images in the mask layer, and then use the pen tool to trace the outline of the glyphs, that would make it copasetic.\n\nOf course, you would have to make the metrics from scratch -- and that's an important chunk of work that isn't usually figured into the ethical equation.\n\n"
    },
    {
      "time": "9 May 2007 — 1:17pm",
      "content": "<cite>I would love to credit who made this, but I can’t remember offhand</cite>  \nIt's right there: Nathan Matteson and Tiffany Wardle.\n\nThe font is actually very funny and in the light of other \"chubby\" faces like Sauna Black, one can see how it could be used. Maybe you could recreate from scratch, and use it as an opportunity to improve it.\n\nEDIT: I mean funny in the good sense, of course!\n\n"
    },
    {
      "time": "9 May 2007 — 3:32pm",
      "content": "Thanks Nick, that was very informative.  \nI really like the font, but there are things I would change that I couldn't earlier because of the brief for the project.\n\nI think I will re-draw it. And then you can all have a copy.\n\n"
    },
    {
      "time": "9 May 2007 — 3:37pm",
      "content": "Two \"Gill Concept\" fonts:  \nJillican (Typodermic)  \nEric Sans (Fountain)\n\n"
    },
    {
      "time": "9 May 2007 — 6:58pm",
      "content": "Nick, I believe it is actually more complex than that. If the original EULA permitted modifying for one's own use, and the intended recipient had also purchased the same font, with the same EULA, I believe it could be given to that person. If EULA's never changed, as long as both parties owned a license, both could have the modified font, as long as the \"number of computers installed on\" was adheared to. But EULA's do change.\n\nSecondly, I believe in Europe, you can copyright the design as well as the software that renders the font. Correct me if I'm wrong. But I hear you loud & clear on the big foundries rip-offs. I believe Monotype was once sued over that; in the States, anyway, the ripoff of the \"design only\" was OK, since the data was not taken.\n\nIn passing, when Apple sued Microsoft (over Windows), I always wondered why Xerox didn't file suit against Apple . . .\n\n"
    },
    {
      "time": "9 May 2007 — 10:57pm",
      "content": "Even if the EULA allowed for modifications, chances are it didn't allow for transferring. Further, and even less likely, it probably didn't allow for derivatives, or in other words, versions of the fonts to be given away for free or sold for profit. Given that Gill is owned by and/or licensed from Monotype I'd say you are stepping of shady ground in all 3 counts.\n\nNick, however, makes a good point. Albeit questionable.\n\n"
    },
    {
      "time": "9 May 2007 — 11:13pm",
      "content": "Charles, while your thinking is clever I'm not sure it would work as EULAs are geographic location sensitive. Adobe's EULA allows for modifications, but then that modified version becomes one of the copies licensed. Or in other words, if the given EULA (Adobe's in this case) is for 5 workstations, and you modify it to be used on 2 workstations, you only have 3 un-modified workstations left.\n\nAck! A math problem. Run!\n\n(It's late I shouldn't be righting about EULAs at this hour.)\n\n"
    },
    {
      "time": "10 May 2007 — 5:06am",
      "content": "I really wasn't trying to be clever. It is more that the EULA represents a lawyer's effort to protect his client -- the type founder/seller. The language used is to me incomprehensible, but that's not the point. What I assume is going on is the lawyer is trying to help his client from (1) not losing sales, and (2) not looking foolish, should someone poorly modify a font.\n\nIf I hold a license and modify a font for my use (when permitted), another holder of the same license could hire me to modify <cite>their</cite> font. Of course it counts as one of the permitted copies. But exactly the same situation results if I just send them a copy of my modification. Nobody's lost any money they would otherwise receive. I assume that's the point of the license in the first place.\n\nIsn't this correct?\n\n"
    },
    {
      "time": "10 May 2007 — 7:46am",
      "content": "I think these laws are in place to protect business. They don't necessarily make sense to individual designers who are just experimenting and not interested in commercial gain.\n\nThe Gill version I own was from Adobe.\n\n"
    },
    {
      "time": "10 May 2007 — 7:57am",
      "content": "Take this opportunity to redraw the letterforms based on what you have (alont with any tweaks you feel are necessary). That way, you're not modifying the original 'software' itself. At that point, you've made a very nice custom typeface based on the a great classic face.\n\nThat is a nice face, btw!\n\n"
    },
    {
      "time": "10 May 2007 — 8:04am",
      "content": "Thanks! Yes I'm planning on re-drawing it anyway. Was just wondering about the legality issues.  \nSo whats the deal with dafont.com? How are they not being sued constantly by foundries? I see they have a disclaimer but obviously a lot of work on that site is modified versions of original files.\n\n"
    },
    {
      "time": "10 May 2007 — 11:09am",
      "content": "You can not TM the actual shape of the letterforms (at least not in the US). You can copyright the actual code that makes up said font, however. You can also TM the name of the font.\n\nAs such, there is nothing technical illegal about buying a font, printing it out, tracing it, scanning it back in, and selling that as a copy. Ethically and morally there are issues, of course.\n\nIn your case, I think you are creating a significant departure from the original face while retaining enough likeness to call it a tribute. So I think you are fine on the ethical and moral POVs (IMHO, of course. Legally, you jsut want to be sure you are using your own set of mathematical curves and vectors in the software (the font itself).\n\n"
    },
    {
      "time": "10 May 2007 — 12:11pm",
      "content": "Law, shmaw. Your font is way different enough,  \njust try to avoid swiping any actual outlines.\n\nAnd put it in the crit section so we can suggest improvements.\n\nhhp\n\n"
    },
    {
      "time": "12 May 2007 — 6:03am",
      "content": "I am wondering: I made a font, more to learn about fonts than anything else, based on a book which I now suspect was typeset in Linotype Didot. It is very different now. Would I still be infringing the law?\n\nBesides, I have also worked on a font based on the free font champion, which is the only font close to Boltana's Champion I have ever been able to find. I have numerised new glyphs based on an article by Boltana. I just use the font privately, but if I were to give it to friends, would I be infriging the law?\n\n"
    },
    {
      "time": "12 May 2007 — 6:15am",
      "content": "As to your \"maybe Didot inspired\" font. The European copyright laws are different from those in the States, but even so, since it isn't a direct visual copy, I would think it is not an issue. Otherwise, all the larger foundries would constantly be suing each other -- and some of the smaller ones, too.\n\nAs to the free font: Cost & license are unrelated. You may well have accepted a licensing agreement when you downloaded the font. There are free fonts that have more restrictive agreements than fonts you pay for. Check the EULA of your free \"Champion\" to see.\n\n"
    },
    {
      "time": "12 May 2007 — 7:22am",
      "content": "From a design perspective (legal issues put aside):\n\nI consider it dangerous to start with an existing font, or with an existing non-digital type design: The original design may shine through even if you changed every detail. Design is more than serif forms, curves, stem width, sharp or curved edges, some ornamental addition, even proportions -- it is the 'mind' or 'logic' or 'rules' which make the various details a unity. Changing one or some of these details may just break the design, but most likely produce something derivative. Starting with something existing requires a deep understanding of the original design to do something truely different.  \nIf I look at the rounded extra bold Gill Sans, I think what is so interesting about it (despite having round edges which is a current trend) are the proportions and the funny stroke contrast in the 'a' 'e' 'f', and the Sisyphean 'i'-dot, all of which are in the original design. Moreover, the rounded version inherits all shortcomings of the original design.  \nTo make more evident what I mean: Do with Helvetica what you did with Gill Sans. Notice the difference?\n\n"
    },
    {
      "time": "12 May 2007 — 7:43am",
      "content": "There already is a helvetica rounded.\n\n"
    },
    {
      "time": "12 May 2007 — 9:19am",
      "content": "Karsten, there may be a fault in your argument.  \nAs far as I know, Gill \"Kayo\" wasn't designed by Eric Gill.  \nBut I hear what you'r saying.  \nSo Haley should probably take a few liberties with the underlying structure, both to claim more authorship of the new design, and also to better suit the letter forms to the rounded treatment.  \nFor instance, the pointed bit on the \"t\" is too sharp--maybe a different concept for the \"t\" is required.\n\n"
    },
    {
      "time": "12 May 2007 — 10:46am",
      "content": "Not the Kayo, but Gill did make (or at least took part in making) a dark condensed weight that served as the basis for Kayo, and is very close to it. It was meant for advertising, and Gill himself called it \"an ugly font for an ugly profession\".\n\nhhp\n\n"
    },
    {
      "time": "12 May 2007 — 11:20am",
      "content": "Ah yes, there were Gill Sans additions not by Gill. Consulting Robert Harling's <cite>The letter forms and type designs of Eric Gill</cite>, page 46 shows <cite>sans 'double elefans'</cite> drawings by Gill, uppercase only but including this strange lowercase 'f' and a few numerals. Obviously an early version.\n\n<cite>So Haley should probably take a few liberties with the underlying structure, both to claim more authorship of the new design, and also to better suit the letter forms to the rounded treatment.</cite>\n\nThat's it. Maybe even study the rounded version very carefully to find out what makes it so special, then put it aside and draw something based on the special elements. This makes it also necessary to think about, how do I solve the 'n' shoulder? and which shape do I give the 'b' 'd' 'p' 'q' bowls and how do they intersect with the stem? Maybe the result will be even more radical than the ultra bold Gill Sans? I think this is a very funny game.&nbsp;&nbsp;:)\n\nStarting from zero (of course you have many typefaces in mind and even 'cite' this or that one) prevents you from the question you asked in the first place.  \nSorry that my other post sounds rude, Haley. It was the combination with the Didot question which I found alarming. My opinion is: It is ok to modify a typeface for one's own use if the EULA allows. A very good exercise too. But the designer or foundry may not be too happy if one would start distributing a 'better' version of their typeface. (Irrespective if it's distributed for free or not, or if receivers do or don't have licensed the original version or not.) To me, this is more a fairness than a legal issue, both as regards intellectual and physical work on which one builds.\n\n"
    },
    {
      "time": "12 May 2007 — 1:20pm",
      "content": "Thank you for all the responses, I just want to clarify that I am in no way happy with this face (as with most school related projects). Just in case there was any confusion I would never dream of distributing this in such an unfinished state. I was just curious about the legality of starting with digital files.\n\nDon't want you all thinking I'm some sort of appropriating wanker... even though I do have a degree in advertising :)\n\n"
    }
  ]
}
