{
  "id": "33632",
  "title": "Chicle ST and Cooked released at Veer",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "**[Sudtipos](http://web.archive.org/web/20131013162038/http:/www.sudtipos.com/)** is proud to announce the release of two new fonts\n\n ![](http://web.archive.org/web/20131013162038im_/http:/typophile.com/files/cookedchicle1_5032.jpg)\n  \n **[Chicle ST](http://web.archive.org/web/20131013162038/http:/www.veer.com/products/typedetail.aspx?image=UMT0000266#specimen)**\n\n\"Taking a break from complex scripts and polished packaging fonts, Koziupa and Paul show their more playful side. Chicle is bold. Chicle is stretchable. Chicle is kid-proof. Chicle is pet-resistant. This typeface has been built to take the abuse of software and designer alike. Perfect for creating the elaborate, attention-grabbing artwork required to promote sugary sweets, Saturday morning cereal, the loudest toys imaginable, and of course, those smelly treats you buy for your cat or dog. Chicle is Spanish for bubble gum. It’s a pure sugar fix - accept no substitutes.\n\n ![](http://web.archive.org/web/20131013162038im_/http:/typophile.com/files/cookedchicle2_5400.jpg)\n  \n **[Cooked](http://web.archive.org/web/20131013162038/http:/www.veer.com/products/typedetail.aspx?image=UMT0000268#specimen)**\n\n\"Koziupa and Paul prove that they’re just as good in the kitchen as they are on the drawing board. Cooked is now on the menu. A juicy alphabet ready to complement any visual stew you care to put together. This meaty design, with even meatier OpenType programming, was designed to satisfy the most demanding sense of style and taste, inducing drool at a mere glance. Cooked is just as suitable on packaging as it is on posters or book covers.  \nThe OpenType version of Cooked is a single face, including multiple alternate characters for advanced typographic flexibility. The Mac OS and Windows flavours are supplied as a set of three distinct weights. Same great taste, different format.\n\n",
  "author": "Ale Paul",
  "time": "9 May 2007 — 9:20am",
  "uid": "827",
  "comments": [

  ]
}
