{
  "id": "33647",
  "title": "Uppercase germandbls is coming to Unicode",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Andreas Stötzner and the German DIN committee submitted a proposal to the ISO 10646 working group that **uppercase ß** (germandbls, [eszett](http://web.archive.org/web/20141101211021/http:/typophile.com/wiki/eszett), sharp s) should be added to Unicode/ISO 10646.\n\n**U+1E9E** is the envisioned codepoint.\n\nThe proposal can be viewed at:  \n [http://std.dkuug.dk/jtc1/sc2/wg2/docs/N3227.pdf](http://web.archive.org/web/20141101211021/http:/std.dkuug.dk/jtc1/sc2/wg2/docs/N3227.pdf \"http://std.dkuug.dk/jtc1/sc2/wg2/docs/N3227.pdf\")\n\nIt is important to note that according to the proposal, even after adding this character to Unicode, the **standard uppercase mapping for \"ß\" will remain \"SS\"**. This encoding effort is not about changing existing application or even spelling rules -- it is simply an effort to encode a character to be used in an \"alternate\" spelling which some people use (and currently have problems with properly encoding the text). It is an observed fact that \"uppercase ß\" exists, even if the official rules don't envision it.\n\nI believe it is an interesting effort, and it would be reasonable to discuss what the best possible shape for the new character would be.\n\nSome links in German:\n\n[http://www.signographie.de/cms/signa\\_9.htm](http://web.archive.org/web/20141101211021/http:/www.signographie.de/cms/signa_9.htm \"http://www.signographie.de/cms/signa\\_9.htm\") (published by Andreas Stötzner, I recommend reviewing all the PDFs published there.)\n\n[http://de.wikipedia.org/wiki/Versal-Eszett](http://web.archive.org/web/20141101211021/http:/de.wikipedia.org/wiki/Versal-Eszett \"http://de.wikipedia.org/wiki/Versal-Eszett\")\n\nSome German type designers posted some of their design proposals for an uppercase ß at:  \n [http://www.typeforum.de/modules.php?op=modload&name=XForum&file=viewthre...](http://web.archive.org/web/20141101211021/http:/www.typeforum.de/modules.php?op=modload&name=XForum&file=viewthread&tid=353 \"http://www.typeforum.de/modules.php?op=modload&name=XForum&file=viewthread&tid=353\")\n\nI find many of these design proposals structurally flawed -- they don’t look like uppercase letters. They look like lowercase letters enlarged to match uppercase. The graphical structure of the Roman uppercase is very different from lowercase. If one were to invent a new uppercase letter, it would have to stylistically match the Roman uppercase. If Unicode really decides to encode uppercase ß, type designers should imagine what the uppercase ß would have looked from the very beginning, rather than trying to work out of the existing lowercase ß form.\n\nNote that the **history of \"ß\"** is somewhat surprising. The letter developed in a two-wise way: as a ligation of long s and round (\"normal\") s, and as a ligation of long s and z. The German language adopted unified spelling rules only in 1901. Before that, both in the middle ages and in the humanist period, German spelling differed much. For example, \"Thor\" and \"Tor\" were equal variants of spelling the word meaning \"gate\".\n\nSharp s was denoted by different writers differently (as ſs or ſz, which looked like ſʒ). The graphical shape of the ß ligature developed independently in these two ways.\n\nThis dichotomy still shows itself in a small minority practice of uppercasing ß as \"SZ\" rather than \"SS\". Incidentally, this practice is understandable for most German readers (though not actively practiced), i.e. \"GROSZSTADT\" or \"MASZGEBLICH\" is understandable as the uppercasing of Großstadt or maßgeblich.\n\nSee [http://www.flickr.com/photos/adamt/490566363/](http://web.archive.org/web/20141101211021/http:/www.flickr.com/photos/adamt/490566363/ \"http://www.flickr.com/photos/adamt/490566363/\") for an example.\n\nOne interesting issue is that in the **1996 spelling reform** the status of ß as a single letter has been finally confirmed. In the previous spelling, the general rule was that short vowels are denoted by following them by doubled consonant letters while long vowels are followed by single consonant letters. So writing \"met\" always indicates a long \"e:\" while \"mett\" indicates a short \"e\".\n\nIn case of \"s\"/\"ß\", it was confusing. Following a vowel with a single \"s\" always denoted a long vowel, following a vowel with a doubled \"ss\" indicated a short vowel, but following a vowel with \"ß\" did not give clue whether the vowel was short or long. So \"Ruß\" was actually pronounced \"ru:s\" as if the \"ß\" stood for a single consonant letter, but \"Nuß\" was pronounced \"nus\" as if the \"ß\" stood for a doubled consonant letter.\n\nThe 1996 spelling removed this uncertainty by changing the spelling of all \"ß\" into \"ss\" when the preceding vowel was to be pronounced short. Today’s spelling of \"Nuss\" or \"dass\" underlines that the vowels are to be pronounced short.\n\nThe uppercasing of \"ß\" as \"SS\" but also as \"SZ\" defeats this clear rule. If I uppercase the word \"Rußpartikel\" into \"RUSSPARTIKEL\" or even \"RUSZPARTIKEL\", suddenly the natural way of pronouncing the \"U\" changes from short to long, so the reader is confused. The confusion is even bigger now, after the reform, because the special \"undefined\" treatment of \"ß\" no longer exists, so readers are used to \"ß\" being always treated as a single consonant letter, not as a ligature of a doubled consonant.\n\nTo remain logical, consistent and reader-friendly, \"ß\" needs (at some point) to assume a single graphemic shape in the uppercase.\n\nI strongly feel that uppercasing \"ß\" as \"SS\" is now -- especially under the new rules -- a **temporary anachronism**. \"ß\" is a single CHARACTER (as per orthographic perception). It has functionally liberated itself from its historical background (which was a ligature of ſs or ſz).\n\nToday, \"ß\" is no more a ligature of \"ſs\" than \"ä\" is a ligature of \"ae\". The transition process from \"ae\" to \"ä\" has been completed about 200 years ago, and the transition process between \"ſs\" to \"ß\" is happening now. Encoding the uppercase \"ä\" as \"A ZWJ E\" (or something like that) would make as little sense as encoding the uppercase \"ß\" as \"S ZWJ S\".\n\nI believe that \"SS\" is an anachronic, still-in-use but slowly-to-vanish poor man’s solution to write the uppercase \"ß\". I believe that it should be an exciting task for type designers now to come up with a new form. In my opinion, this issue is definitely not one that is completely solved. We’re in the middle of a slow transition period for \"ß\". The 1996 reform started it and showed the direction.\n\n**I myself once had the idea** that Scedilla (U+015E, Ş) would be most appropriate for denoting uppercase ß.\n\nAfter all, Ş is historically an S with a subscribed z (that at this time looked like ʒ). Since ß is a ligature of either ſs or of ſʒ, uppercasing it as Sʒ, or, effectively, Ş, would historically make sense.\n\nUsing this notation, \"Gauß\" or \"Roßberg\" would be uppercased to \"GAUŞ\" or \"ROŞBERG\".\n\nSimilarly, the umlaut in \"ä\" or \"ö\" is historically a superscripted \"e\", so historically \"ä\" and \"æ\" are two different ligations of \"ae\", and \"ö\" and \"œ\" are two different ligations of \"oe\".\n\nSince German readers are currently used to uppercasing ß as SS, i.e. they write \"GAUSS\" or \"ROSSBERG\", I even thought of a compromise: the SS remains doubled but for added distinctiveness, a subscribed z (i.e. a cedilla) is added after the first S. In other words, \"Gauß\" or \"Roßberg\" should be uppercased as \"GAUŞS\" or \"ROŞSBERG\".\n\nHistorically, this would make sense. The cedilla would here have a similar function to the trema in Spanish or French: \"GAUŞS\" would make clear that it comes from \"Gauß\" while \"GAUSS\" would make clear that it comes from \"Gauss\".\n\n\"ROŞSBERG\" does not look very awkward to a German reader. The addition of a diacritic does not dramatically change the reading pattern but still adds a distinctive mark that is, indeed, needed. If I were to design a glyph that should go into U+1E9E, it would probably look like ŞS, or perhaps just SS, depending on the style of the typeface.\n\n**An alternative approach** is to look at the existing uppercase-to-lowercase relations within the Latin alphabet and try to derive a shape for the uppercase ß which maintains the same relations.\n\nIn most of the middle ages and the period up until the 19th century, the long s (\"ſ\") and \"f\" were closely related, \"f\" being simply a \"ſ\" with a stroke going through. The same, very primitive graphic relation exists between the prototypic shapes of the Greek letters gamma (Γ) and digamma (Ϝ). Since the minuscule \"f\" always has been a \"ſ\" with a middle stroke, then the capital \"F\" might also be considered an uppercase \"ſ\" with a stroke going through. Of course an uppercase long s never existed, but this relation may be helpful when constructing the uppercase ß.\n\nBecause I think that \\*if\\* the Latin alphabet ever used or needed another capital S, the preferred shape could be that of a gamma (Γ). This is a simple, effective shape that maintains a stylistic relation to the lowercase long s that is typical of other uppercase-to-lowercase relations.\n\nIf we look at the relations between Aa Ee Ff Mm Pp, we will notice that sharp, edgy connections in the uppercase are related to more smooth, round connections in the lowercase. If \"F\" developed into \"f\" in a cursive hand, then it is very easy to imagine that a cursive rendition of the \"Γ\" shape might, indeed, look very much like \"ſ\".\n\nThis is an important observation when thinking about the shape of an uppercase \"ß\": I assert that the shape of uppercase \"ß\" must be \"edgier\" than the lowercase. In short, I think that the left part of uppercase ß should be \"Γ\".\n\nWhat about the right part? Here, I would call to exploit the double origin of \"ß\", which developed paralelly as a ligature of \"ſs\" as well as of \"ſz\" (where the \"z\" historically used the \"ʒ\" shape, so \"ſʒ\").\n\nThese days, the lowercase \"ß\" is typically derived from the ligated form of \"ſs\". For visual dissimilation purposes -- to strongly set apart the lowercase and the (new) uppercase \"ß\" I would derive the uppercase \"ß\" from a ligation of the hypothetical uppercase \"ſ\" (i.e. \"Γ\") and the shape of \"the other\" origin of \"ß\", i.e. of the historical \"Z\" shape.\n\n**In short, I believe that the best graphical rendition of an uppercase \"ß\"** would be be a well-designed ligature that incorporates these shapes: \"ΓƷ\"\n\nI have made a small simulation using Garamond Premier (please excuse my poor drawing abilities):\n\n ![](http://web.archive.org/web/20141101211021im_/http:/typophile.com/files/germandbls_garamond_5881.png)\n  \n [http://www.twardoch.com/tmp/germandbls\\_garamond.png](http://web.archive.org/web/20141101211021/http:/www.twardoch.com/tmp/germandbls_garamond.png \"http://www.twardoch.com/tmp/germandbls\\_garamond.png\")\n\n_The first line shows what the historical origin of ß looks like, i.e. long s followed by a round s. The second line shows the current shape of ß as we know it. The third line shows what a hypothetical uppercase long S might look like (\"Γ\"), which is just a mental exercise. The fourth line is my proposal for the uppercase ß shape._\n\nAndreas Stötzner has proposed an elaborate document that tries to explore all possible combinations of drawing an uppercase ß:\n\n[http://www.signographie.de/cms/upload/pdf/Signa9\\_Kombinatorik\\_SZ\\_3.0.pdf](http://web.archive.org/web/20141101211021/http:/www.signographie.de/cms/upload/pdf/Signa9_Kombinatorik_SZ_3.0.pdf \"http://www.signographie.de/cms/upload/pdf/Signa9\\_Kombinatorik\\_SZ\\_3.0.pdf\")\n\nMy proposal corresponds to the scheme A1-B2-C1, which I has the most \"uppercase\" appearance of all those presented there.\n\n**On a related matter,** at the exhibition \"Neue Baukunst. Berlin um 1800\", which is on display at the Alte Nationalgalerie in Berlin until May 28, I have discovered a fantastic calligraphic lowercase \"ß\" shape, in which the \"long s\" part connects to the BOTTOM and not to the top of the following \"short s\". Please take a look:\n\n ![](http://web.archive.org/web/20141101211021im_/http:/typophile.com/files/490547406_474a61e6b0_5721.jpg)\n  \n [http://www.flickr.com/photos/adamt/490547406/](http://web.archive.org/web/20141101211021/http:/www.flickr.com/photos/adamt/490547406/ \"http://www.flickr.com/photos/adamt/490547406/\")\n\nThis got my imagination going.\n\nRegards,  \nAdam\n\n",
  "author": "twardoch",
  "time": "9 May 2007 — 4:38pm",
  "uid": "1133",
  "comments": [
    {
      "time": "9 May 2007 — 6:11pm",
      "content": "I remember reading something online about this a while back and thinking it was as pointless as proposing uppercase forms of fi, fl, and ff. But maybe not. I don't read, write, or speak German, but I like your solution best of all the ones I've seen so far.\n\n"
    },
    {
      "time": "9 May 2007 — 6:25pm",
      "content": "Mark,\n\nit is not like uppercase forms for fi or fl. The lack of \"uppercase ß\" means that it is uppercased to \"SS\", but \"ss\" is also uppercased to \"SS\". So \"SS\" is an ambiguous representation of two different lowercase combinations. This is particularly important in personal names: \"Peter Weiß\" and \"Peter Weiss\" are two distinct names and one may not be substituted by the other. But in uppercase, it's only \"PETER WEISS\" which is ambiguous because it does not exactly tell you what name it actually stands for.\n\nIt is a bit like the French practice of removing accents over vowels when uppercasing. This practice was introduced when typewriters came into use simply because typewriters did not have separate uppercase accented letters. These days, it's a bad ambiguous anachronic practice which is no longer necessary but still practiced by many French people who are used to the typewriter customs and actually think you HAVE TO remove the accents when uppercasing.\n\nThis also reminds me of another practice, i.e. replacing long dashes by single or (perhaps) double hyphens.\n\nAs I have explained, the method of uppercasing \"ß\" as \"SS\" is in my eyes an anachronism. It is still the majority practice according to official German spelling rules, but I think this is largely a technological limitation. If well-designed uppercase ß exists in fonts, and there is a Unicode codepoint for it, \\*and\\* (at some point) it is mapped to the German keyboard layout in Windows and Mac OS X, some people will \\*happily\\* start using it.\n\n\"Popular use\" of \"ß\" in the middle of all-uppercase text suggests that there is an authentic need for that character. I believe we're still years ahead of widespread adoption, but I think type designers should do their best now to come up with appropriate forms, or at least once the character has been officially encoded.\n\nBesides, isn't it fun to invent a new letter?\n\nAdam\n\n"
    },
    {
      "time": "9 May 2007 — 6:27pm",
      "content": "Oh boy, another letter to add to [Agamemnon](http://web.archive.org/web/20141101211021/http:/typophile.com/node/28862), but I like it! You'll see it in my next revision.\n\n"
    },
    {
      "time": "9 May 2007 — 6:41pm",
      "content": "BTW, in a font, the appropriate glyphname for the uppercase ß would be `germandbls.case` or `germandbls.cap` but _not_ `Germandbls`! Should the character be encoded in Unicode under the proposed codepoint, a better glyphname would be `uni1E9E`, but I wouldn’t start using that glyphname yet.\n\nIn an OpenType font, you might want to encode the glyph as a \"stylistic case variant\". To do that, do the following:\n\n1. Create an indentical duplicate of the lowercase `germandbls` glyph named `germandbls.ss01`. \n2. Design your uppercase ß and name it `germandbls.case`. \n3. In the OpenType Layout feature definition code for the `salt` and `ss01` features, include the substitution `sub germandbls by germandbls.ss01`.\n4. In the OpenType Layout feature definition code for the `case` feature, include the substitution `sub germandbls.ss01 by germandbls.case`. \n\nIf your font contains smallcaps, then in addition:\n\n1. Provide a glyph named `germandbls.smcp` which looks like two smallcap-S letters (the \"traditional\" way of making a smallcap ß). \n2. Design your \"new\" (\"true\") smallcap-S and name it `germandbls.smcp_ss01`. \n3. In the OpenType Layout feature definition code for the `smcp` feature, include the substitution `sub germandbls by germandbls.smcp`.\n4. In the OpenType Layout feature definition code for the `salt` and `ss01` features, include the substitution `sub germandbls.smcp by germandbls.smcp_ss01`.\n5. Make sure that the feature definitions for `salt` and `ss01` are ordered _below_ the definition of `smcp`.\n6. If uppercase ß gets encoded in Unicode and your font has a glyph with it named `uni1E9E`, then in the OpenType Layout feature definition code for the `c2sc` feature, include the substitution `sub uni1E9E by germandbls.smcp_ss01`. It that case, you may also consider using the name `uni1E9E.smcp` instead of `germandbls.smcp_ss01`. \n\nIt just occured to me that another approach to the uppercase ß might also be feasible (again, sorry for the imperfect color of the strokes):\n\n ![](http://web.archive.org/web/20141101211021im_/http:/typophile.com/files/germandbls_garamond2_5760.png)\n\nThis alternative treatment is analogical to the alternative treatment of the \"J\", which may reside on the baseline or descend below it.\n\nAdam\n\n"
    },
    {
      "time": "9 May 2007 — 7:36pm",
      "content": "Does SS ever begin a word? I would guess not, in which case there wouldn't seem to be a need for it in a formal script. (Except perhaps to accommodate people who insist on setting formal scripts in all caps...?)\n\n"
    },
    {
      "time": "9 May 2007 — 7:49pm",
      "content": "No words or names ever start with a \"ß\" so you're right, the character would not be necessary in a formal script.\n\nA.\n\n"
    },
    {
      "time": "9 May 2007 — 7:52pm",
      "content": "Rats.\n\n"
    },
    {
      "time": "10 May 2007 — 12:46am",
      "content": "This isn't the euro currency symbol. I wouldn't expect to see most font producers integrating an uppercase ß into their products anytime soon.\n\n"
    },
    {
      "time": "10 May 2007 — 2:09am",
      "content": "You can see a lot of stuff in Germany, where people put in a lowercase-ß when using All Caps, like ROßMANN and such. There is surely a need for it, especially for names. It's different, if you called ie Heike Rossmann or Heike Roßmann. Written in All Caps, it is impossible to know, if it's Rossmann or Roßmann.  \nBut the Versal-ß has no common known form yet. If there would be a typeface with Versal-ß included, would i, as a designer, use this Versal-ß or the common \"SS\"? I think, i would use the \"SS\" to play save. Ok, it really depends on how obvious is the connection between the Versal-ß and the common lowercase ß.\n\n"
    },
    {
      "time": "10 May 2007 — 2:48am",
      "content": "» the history of “ß” is somewhat surprising. The letter developed in a two-wise way: as a ligation of long s and round (“normal”) s, and as a ligation of long s and z.« (A.Tw.)\n\nNO! No, no, no.  \nWe need to distinguish the ORIGIN OF THE CHARACTER from the LETTERSHAPES.  \nThis has been mixed up by everybody for far too long.\n\nThe origin of the ß \\*as a character\\* is: a long s with \\*some\\* curl or swash or stroke attached, in order to mark it being not an 'ordinary [long] s'. That attachment became randomly written like the ezh- (or 3-) shape by time (the same we find with other Latin letters for abbr., e.g. q).  \nTherefor the letter became named “eszett”, the common mind thus just describing what he sees, regardless of the fact that the letter (the character) was NOT derived from long-s and z functionally or phonetically or in the sense of a typographic ligature. Note that up today “Eszett” is also named “Dreierles-Es” or “Scharfes Es” which indicates the very idea of ß as a character of its own.  \nThe earliest sample of a “ß” in an upright roman-style printed German text (1667) is definitely no long-s\\_s nor a longs\\_z (ezh-shape). It’s something else.\n\nThe “ß is a s\\_s-ligature” theory was induced by the italic long-s\\_s ligature later becoming (ab-)used to represent the German ß. Today the glyphs we use in Roman and Italic for ß are actually two different letters (or glyphs) by origin.\n\nA tricky history, admittedly.\n\nBut thanks Adam, for your elaborate explanations. Sorting out what the capital ß might look like this should be the level to work on it.\n\nBy the way, you’ll find it notable that we (searching for Signa 9) actually testified two medieval examples for the capital long S, one of them Gamma-shaped.\n\n"
    },
    {
      "time": "10 May 2007 — 3:30am",
      "content": "It says here that it’s official. The uppercase “ß” is coming:  \n [http://www.fontblog.de/das-versale-ss-rueckt-naeher-bauanleitung](http://web.archive.org/web/20141101211021/http:/www.fontblog.de/das-versale-ss-rueckt-naeher-bauanleitung \"http://www.fontblog.de/das-versale-ss-rueckt-naeher-bauanleitung\")\n\nThere’s also a guide how to build an uppercase “ß”:  \n [http://fontshop.de/pdf/versales\\_eszett.pdf](http://web.archive.org/web/20141101211021/http:/fontshop.de/pdf/versales_eszett.pdf \"http://fontshop.de/pdf/versales\\_eszett.pdf\")\n\nAll in german, of course ;-)\n\n"
    },
    {
      "time": "10 May 2007 — 3:35am",
      "content": "Thank you Adam for this very elaborate and profound thesis of ways to find a design for a new UC Germandbls. This is the best thread i have read on this topic so far. There are very hot discussions in Germany about wether or not it makes sense to include this character.\n\nAs nice as it would be to \\*invent\\* a new character (i am convinced of your examples of the Gamma-S ligature), i find the S-cedilla followed by S solution very plausible.\n\nMy concern is: if the knowledge of the inclusion of an UC Germandbls into Unicode is spread everywhere i fear that some commission will determine what that character has to look like. The S-cedilla proposal is very easy and fast to determine as standard (and it would follow the convention to capitalize \\*ß\\* by \\*SS\\*). Also there would be no need to update fonts. This could be taken up into the orthography (and the Duden) immediately.\n\nThat’s my pragmatic view. A new character might come up in a disaster as it happened with the Euro (if some commission sets up the design guides) or it will take a very long time until there is a form for the new character that will be widely accepted. I absolutely agree that a new character has to follow the forms and origins of the Roman alphabet (which are the preceding Greek letters).  \nIt also could all end up in a design competition (hope not!)\n\nThank you Andreas for an update of this character’s tricky history.\n\n"
    },
    {
      "time": "10 May 2007 — 3:56am",
      "content": "If this world would be populated by typographers only, S-cedilla would certainly do.\n\nSorry gents, but this consideration was under discussion already 1903 and again 1956.  \nForget about it. The common German reader-writer Herr WEIßMANN will \\*never accept a S-cedilla in his name.  \nAnd as to the Euro-sign: yes, the commission did a dreadful job, like commission tend to do. But today, since the character is “free”, we have fonts with lots of fairly well-designed Euro’s.\n\n"
    },
    {
      "time": "10 May 2007 — 6:35am",
      "content": "Well, i doubt that Herr WEIßMANN even cares if he wears a ß in his all caps setting. Only typographers do.\n\nIf you want to do something for the general public, forget it. How many people in Germany think the ß doesn’t exist anymore anyway? They thought it was banned with the last spelling reform.\n\nI think the UC-ß should be designed with the above mentioned roots in mind and not what Herr WEIßMANN likes. He was never used to see anything else than the ß in his name. But there are more important spelling situations where this character changes meaning (Maße and Masse, e.g.). So please forget the WEIßMANNS and the like. It doesn’t change the meaning of their name nor does it change its intonation.  \nMy two cents.\n\n"
    },
    {
      "time": "10 May 2007 — 9:05am",
      "content": "Jürgen,\n\n\\> It doesn’t change the meaning of their name nor does  \n\\> it change its intonation.\n\nOf course it does. Herr ROSSBERG (i.e. Rossberg) is pronounced \"rosberg\" and Herr SCHUSS (i.e. Schuss) is pronounced \"ʃus\", while Herr ROßBERG (i.e. Roßberg) is pronounced \"ro:sberg\" and Herr SCHUß (i.e. Schuß) is pronounced \"ʃu:s\".\n\nAdam\n\n"
    },
    {
      "time": "10 May 2007 — 10:00am",
      "content": "Got me. Accepted. Yet, i don’t think that names are the foremost concern.  \nIn your examples it’s only about intonation but not meaning. Roß or Ross is generally short and it means horse. A ro:s doesn‘t exist, as far as i know. Could be short for Rose which is a rose, hence it would be ROSBERG.\n\nI was only saying that in names it occurs to me that there is a favour towards a UC-ß only for aesthetic reasons. To denote different pronounciation a S-cedilla would do perfectly well. I am not against a new letter, i only try to be pragmatic and the cedilla does make sense in the historical and formal context.\n\n"
    },
    {
      "time": "10 May 2007 — 10:58am",
      "content": "Adam, superb contribution to typographic discourse.\n\nPersonally I'm very happy to hear about this Unicode proposal,  \nand even if most people never take advantage of it a slot for the  \nUC eszet would be a great thing to have.\n\nIn fact in general I feel we need more characters, not fewer.\n\nhhp\n\n"
    },
    {
      "time": "10 May 2007 — 11:35am",
      "content": "I start with the caution that I was not involved in the implementation of the German spelling reform and that I am not an expert in this matter. However, having been a tutor at the German spelling reform publishing house DUDEN for nearly a quarter of a century, I occassionally had discussions with the editors of the spelling reform rule books.\n\nI am under the impression that both Mr. Twardoch and Mr. Stötzner missed the crucial point concerning the s rules. The \"long/short\"-vowel rule as stated by Mr. Twardoch does not reflect the full rule, because the full rule distinguishes between surd (voiceless) and sonant (voiced) s sounds, i.e. the spelling depends on whether the s sound is surd or sonant.\n\nThe IPA chart was quoted by me in another context on my website\n\n[http://www.sanskritweb.net/deutsch/ipa\\_sans.pdf](http://web.archive.org/web/20141101211021/http:/www.sanskritweb.net/deutsch/ipa_sans.pdf \"http://www.sanskritweb.net/deutsch/ipa\\_sans.pdf\")\n\nOn page 2 of this PDF, in the top chart \"consonants\", row \"fricatives\", the surd s sounds are to the left and the sonant s sounds are to the right.\n\nIn the \"alveolar\" column, the surd s is \"s\" as IPA symbol, and the sonant s is \"z\" as IPA symbol.\n\nWhile some languages, e.g. Sanskrit, do not have sonant (voiced) s sounds, German (and also English) have both voiceless and voiced s sounds. Therefore, in such words as e.g. \"Ruß\" and \"Nuß\", we must examine two things:\n\nFirstly, is the preceding vowel sound short or long?  \nSecondly, is the following s sound sonant or surd?\n\nMr. Twardoch considered the first question and omitted the second question. However the full rule states (I translate \"DUDEN\", 24th edition 2006, page 94):\n\n\"For the voiceless s sound after long vowel or diphthong, the spelling is \"ß\", provided that the s sound in all inflectional forms remains voiceless and no other consonant follows.\"\n\nSince proper names (see e.g. English \"Smith, Smyth\") often disregard spelling rules, the matter is highly tricky, and I doubt whether the Unicode committee ever examined what sound (voiceless, voiced) is to be defined by the proposed \"uppercase ß\", considering that neither Mr. Twardoch nor Mr. Stötzner mention the tricky phonetical implications stated above.\n\n"
    },
    {
      "time": "10 May 2007 — 4:35pm",
      "content": "This is how we do it. The graphic can be downloaded as eps too.  \n [http://www.germantype.com/cms/upload/data/GTF\\_versales\\_sz.zip](http://web.archive.org/web/20141101211021/http:/www.germantype.com/cms/upload/data/GTF_versales_sz.zip \"http://www.germantype.com/cms/upload/data/GTF\\_versales\\_sz.zip\")\n\n ![](http://web.archive.org/web/20141101211021im_/http:/typophile.com/files/sz_birth_4896.gif)\n\n-- [www.germantype.com](http://web.archive.org/web/20141101211021/http:/www.germantype.com/)--\n\n"
    },
    {
      "time": "11 May 2007 — 2:54am",
      "content": "Adam, I echo Hrant's comment on quality of discussion. I found your writing lucid and really interesting. Thanks for the time you have taken on this.\n\n_These days, the lowercase “ß” is typically derived from the ligated form of “ſs”. For visual dissimilation purposes — to strongly set apart the lowercase and the (new) uppercase “ß” I would derive the uppercase “ß” from a ligation of the hypothetical uppercase “ſ” (i.e. “Γ”) and the shape of “the other” origin of “ß”, i.e. of the historical “Z” shape._\n\nIn short, I believe that the best graphical rendition of an uppercase “ß” would be be a well-designed ligature that incorporates these shapes: “ΓƷ”\n\nYes but if I want my C and c to look similar, and my S and s, and my O and o, etc why would I want my U/c ß to be different in design derivation from its lower case counterpart? i.e. if you're going to use s for derivation of ß then shouldn't you be using S for derivation of u/c ß? Is visual dissimilation (between upper and lower cases at least) necessary in a font? (It probably depends what the font's going to be used for which is a whole different discussion.)\n\nAndreas: your pdf is excellent. It appeals to me that there are people that are willing to do lots of very hard work and then generously share the results with all for free.\n\nMy personal view is that the Γ approach makes it look like an uppercase character (whatever that looks like - it's very subjective) more so than the long s/inverted U approach. That is not to say that I'll use the Γ approach if it doesn't suit the rest of the font. The u/c ß is certainly not going to be a fundamental character which shapes the rest of the font.\n\nBut nobody's seriously going to tell me _which actual design_ to use in my own font? Are they?\n\nYou've surely got to do what suits the font best and, as with all fonts, there are going to be some u/c ß's which are totally different from others because there are fonts which themselves are totally different. This reflects the diversity of man and the wisdom of his Creator.\n\nI don't pretend to know anything about the history of type, derivation of characters especially German ones, German pronunciation and the like. Nevertheless, a bigger principle is at stake:\n\nIndividual 'interpretation' of character forms is surely one of the things that makes a font great. That's probably why some of us were so hacked off by being told what the euro symbol should look like - in every font! The thought that a designer must, in any measure, _comply_ is abhorrent to me.\n\nProvided my font can be 'read' (whatever that word means - one person reads very differently from the next), then it can look like anything I please, can't it?\n\nI guess the real art is designing a font that can be read well by as many different types of reader. And unfortunately, when it comes to the real art is designing a font, I'm well out of my depth.\n\n"
    },
    {
      "time": "11 May 2007 — 3:00am",
      "content": "You know, if I had a German castle, I'd print all ten pages of Andreas' pdf and hang them side by side in one of the long rooms.\n\n"
    },
    {
      "time": "11 May 2007 — 6:16am",
      "content": "\\> if I want my C and c to look similar, and my S and s, and my O and o, etc\n\nWell, you shouldn't. :-)  \nI mean for text.\n\n\\> if you’re going to use s for derivation of ß then  \n\\> shouldn’t you be using S for derivation of u/c ß?\n\nDerivation should be a means, not an end.\n\n\\> nobody’s seriously going to tell me which actual  \n\\> design to use in my own font? Are they?\n\nSome people will. Ignore them.\n\n\\> one person reads very differently from the next\n\nActually, during immersion, \"normal\" adults all read about the same way.\n\nhhp\n\n"
    },
    {
      "time": "11 May 2007 — 8:00am",
      "content": "\\> Yes but if I want my C and c to look similar,  \n\\> and my S and s, and my O and o, etc  \n\\> why would I want my U/c ß to be different  \n\\> in design derivation from its lower case counterpart?\n\nThe handwriting practice for ß by contemporary writers allows both \"IS\" and \"I3\" structures. The S shape is more flowy, cursive, written in nature than the 3 shape, which is more constructed, drawn. The uppercase-vs-lowercase contrast is exactly about that: drawn vs. written. Pretty much all of Latin uppercase has very simple, basic forms stitched together, which are easy to construct and draw. \"S\" is the by far most complex form within the basic scheme.\n\nCombining a complex \"long s\" skeleton with an equally complex \"S\" skeleton is an overkill for a letter. It starts looking like a horribly complex character such as \"&\", which practically no-one can write properly.\n\nI assert that letters must be simple. Uppercase letters must be simpler in skeleton than lowercase, because that is their very nature. Also, uppercase forms should be solid, strong, monumental in character.\n\nI believe that the \"monumental skeleton\" of uppercase ß I propose:\n\n[http://typophile.com/files/germandbls\\_garamond2\\_5760.png](http://web.archive.org/web/20141101211021/http:/typophile.com/files/germandbls_garamond2_5760.png \"http://typophile.com/files/germandbls\\_garamond2\\_5760.png\")\n\nfulfils the criteria better than the \"Dresdner skeleton\" that Andreas Seidel and Andreas Stötzner prefer:\n\n[http://typophile.com/files/sz\\_birth\\_6221.gif](http://web.archive.org/web/20141101211021/http:/typophile.com/files/sz_birth_6221.gif \"http://typophile.com/files/sz\\_birth\\_6221.gif\")\n\nThe Dresdner form lacks something sturdy, defined, at their top-left. It simply looks like it is half-way between uppercase and lowercase.\n\n\\> Is visual dissimilation (between upper and  \n\\> lower cases at least) necessary in a font?\n\nOf course, within a reasonable range.\n\nA.\n\nPs. Edit: I meant \"Dresdner form\", not \"Leipziger form\", i.e. I meant the form that Andreas Stötzner included in his DIN/ISO/Unicode proposal (first link in my first posting).\n\n"
    },
    {
      "time": "11 May 2007 — 8:05am",
      "content": "Uli,\n\nUnicode does not need to deal with phonetics. The uppercase ß character is for people who wish to unmistakengly represent the lowercase ß in an uppercase context. There are defined rules for the use of lowercase ß, and there is no need to explain them in the Unicode standard or anywhere near that context.\n\nThe phonetic rules I described in my original posting are, of course, simplified. I did not deal with \"s\" that is pronounced like the English \"z\" (sonor). In fact, I did not mention single \"s\" at all, because in German, the rules of its use are actually fairly complex. What I wrote about is the difference between \"ß\" and \"ss\", which both stand for a voiceless \"s\" sound.\n\nA.\n\n"
    },
    {
      "time": "11 May 2007 — 10:49am",
      "content": "I think there is room for both the \"Monumental\" and \"Leipziger\" forms of the character, as one shape or the other will be more readable and graphically complementary within a given font, but it seems this is for the Germans to decide which one, if not both, is acceptable. (How, I don't know.)\n\nWhat would a blackletter cap ß look like?\n\n"
    },
    {
      "time": "11 May 2007 — 11:49am",
      "content": "\\> letters must be simple.\n\nIt's very easy to read that in a detrimental way. I think the ideal is that letters are no simpler than readers can handle (which too often they are, like in the lc \"el\") otherwise you're reducing differentiation for no reason. Sure, maybe Chinese is too complex, but to me Latin is clearly too simple, and when given an opportunity to add a character to it we should diversify, not solidify.\n\nAs for what structure I prefer, I do tend to agree that your structure is better than that of Seidel & Stötzner, but Jason is right that the actual design on hand will always have a lot to do with it.\n\nhhp\n\n"
    },
    {
      "time": "11 May 2007 — 11:51am",
      "content": "Just to stay on the right terms like Mr. Stötzner has \"invented\" it.  \nLeipziger shape = S / Dresdner shape = Z (З).\n\n ![](http://web.archive.org/web/20141101211021im_/http:/typophile.com/files/leipzig_vs_dresden_4831.gif)\n  \nTo the \"problem\" of the upper left corner, (make it true uppercase like a Γ or more round) is not a significant issue for me. Both approaches can work!  \nTo me, Adams favorite shape is a derivate of the Dresdner shape like we have done it for our GTF typefaces.  \nI like the Leipziger shape too. It depends on the nature of the project which one I would prefer. The Leipziger shape is more complicated and usefull for some delicate titlings or for more calligraphic styles. The Dresdner shape I prefer for everyday typefaces.\n\n-- [astype.de](http://web.archive.org/web/20141101211021/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "11 May 2007 — 12:21pm",
      "content": "\\>What would a blackletter cap ß look like?  \nBlackletter don't work\\* in All Caps and there is no beginning \"ß\" same as in Serif and Sansfaces. That's why, there is/was no Versal-ß for blackletter \"possible\".\n\n\\*and never intended to work\n\n"
    },
    {
      "time": "11 May 2007 — 12:28pm",
      "content": "There is no there is no.  \nJust picture a document that explains this cap-eszet business, set in blackletter.\n\nhhp\n\n"
    },
    {
      "time": "11 May 2007 — 12:41pm",
      "content": "Poms is right, since the ONLY word what has a tradition in gothic or fraktur typefaces (in German languages) to set in uppercase is the word for god/lord \"GOTT\" and \"HERR\". But if you need the latest Hells Angels golf club tattoo, then of course, you need an uppercase blackletter sharp s. :-)\n\n-- [astype.de](http://web.archive.org/web/20141101211021/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "11 May 2007 — 1:20pm",
      "content": "@hrant and cuttlefish  \nI try to show you the \"why it (especially in Frakur) was not intended\" later, in another thread, cause i don't want to hijack this one.\n\nEdit:  \nNot another thread :-)  \nYou see [why it was not intended](http://web.archive.org/web/20141101211021/http:/www.luftzentrale.de/tmp/Versalien-gebrocheneSchrift.png). Even in Schwabacher or Neu-Gotische Schriften made in the beginning of the 1930s it doesn't work.\n\n"
    },
    {
      "time": "11 May 2007 — 1:31pm",
      "content": "I love intent. But as a means, not a goal.\n\nSaying a blackletter cap-eszet should't be  \nmade does not befit a good type designer.\n\nhhp\n\n"
    },
    {
      "time": "11 May 2007 — 1:50pm",
      "content": "This has certainly given me a lot more insight on how to treat the character in my unicase face.\n\n"
    },
    {
      "time": "11 May 2007 — 2:13pm",
      "content": "I am well aware that it is not right to set blackletter (and especially Fraktur) in all caps, and that no word in German begins with ß, but people will try to do either anyway. What is the harm in acommodating them? Let's leave that conflict of capitalization to the copy editors and tattooists. If they want to use the letters we design, let them do what they wish.\n\n"
    },
    {
      "time": "2 Jun 2014 — 4:15am",
      "content": "<cite>Yet, i don’t think that names are the foremost concern.</cite>\n\nOh, no, they are! I come from a town called **Pößneck** and we have a battle for decades how it should be pronounced and how it should be written in uppercase texts. It literally splits a whole town.\n\n<cite>Of course it does. Herr ROSSBERG (i.e. Rossberg) is pronounced “rosberg” ... while Herr ROßBERG (i.e. Roßberg) is pronounced “ro:sberg” </cite>\n\nNo, the reform of 1996 doesn't apply to names. On my businesscard is says »Roßbach and Herrmann GbR« and it is still (and will always be) pronounced »Rossbach«.\n\n**In our business** the correct spelling of names is the biggest concern in the capital sharp s debate. Just think of all the bibliographies in books. We usually like to set names in small caps, but names have to keep their Eszett, because **Weiß** and **Weiss** are different names.\n\n**For the public** this is a solution for a problem that most of the people aren't even aware of. Again: Herr Roßbach from Pößneck will always write ROßBACH and PÖßNECK to keep the proper names. So now we offer him a way to do it with letters that are typographically correct.\n\nAbout the shape:  \nI don't think we should define the one and only way of designing the capital sharp s. There are different solutions and over time one will eventually prevail.\n\n"
    },
    {
      "time": "12 May 2007 — 5:44am",
      "content": "CORRECTION\n\nThe glyph prefered by the germantype-colleagues and me is the \\*Dresden glyph\\*, not the \"Leipziger form\". The Dresden glyph was first proposed by a man from Dresden in 1955.  \nIt does not help to mix things up.\n\n"
    },
    {
      "time": "12 May 2007 — 5:59am",
      "content": "Actually having a descender on it (at least in fonts that have a descending  \n\"J\" and/or \"Q\") seems quite smart, as it helps differentiate it from the \"B\".\n\nhhp\n\n"
    },
    {
      "time": "13 May 2007 — 12:32am",
      "content": "Although the tail makes it easier to cofuse with Beta. That said; the tail appeals to my eye in big way and (obviously subjectively) helps me resolve what I am seeing as an Eszett much faster.\n\nFor more on my beta comment see here\n\n[http://en.wikipedia.org/wiki/Eszett](http://web.archive.org/web/20141101211021/http:/en.wikipedia.org/wiki/Eszett \"http://en.wikipedia.org/wiki/Eszett\")\n\n"
    },
    {
      "time": "13 May 2007 — 1:14am",
      "content": "<cite>Although the tail makes it easier to cofuse with Beta. </cite>\n\nYou would expect a greek lowercase letter in an uppercase German proper name!? ;-)\n\n"
    },
    {
      "time": "13 May 2007 — 1:50am",
      "content": "Folks have used ß as a substitute for beta for as long as computers have had the character in their fonts, for such things as marking pre-release version numbers and such. Why anyone would want to uppercase their version number marker, I don't know, but if it extends utility, I don't have a problem with maintaining a passing resemblance.\n\n"
    },
    {
      "time": "13 May 2007 — 3:07am",
      "content": "\\>You would expect a greek lowercase letter in an uppercase German proper name!? ;-)\n\nWhy not? Most readers on the planet know neither German nor Greek. Yet we expect them to know the difference between betas and Eszetts. When I was doing corporate design work in Washington, DC, we had to disguise a lot of the companies who we researched. So instead of publishing a report on Acme, Inc., we called them Beta Corporation, or something like that. Readers of our reports knew who we were talking about, but we didn't name names without permission.\n\nAnyway, the authors I worked with always thought that it would be clever for the first letter of Beta Corporation's name to be an actual beta, rather than a b. But their fonts did not have betas in them, or they didn't know how to input a beta. So they just write ß (ßeta Corporation). Most of them thought that the ß actually was a beta anyway. Good luck trying to educate them to see around that one ;-)\n\n"
    },
    {
      "time": "13 May 2007 — 7:48am",
      "content": "As a teen, I myself used to think the eszet was a beta. But I think in context (not least the context that somebody reading German probably knows German...) it's not a problem.\n\nhhp\n\n"
    },
    {
      "time": "13 May 2007 — 10:38am",
      "content": "<cite> So they just write ßeta Corporation.</cite>\n\nThat's a completely different thing. Expectations play a big role in reading texts. So when you write ßeta you suggest this way of reading.  \nOf course people could be confused with ß vs. β when placed as a single letter. But in this discussion of a capital Eszett in proper names this really isn't an issue.\n\n"
    },
    {
      "time": "14 May 2007 — 1:20am",
      "content": "I think Ralph's point about context is a good one. Also, the sharp angle of the 1st loop does a good job at quickly clueing you in. And having a descender is a nice way to keep distiction with the UC B.\n\nMy hat is off to Adam like eveeryone else for introducing the thread and his highly lucid text on the subject, but to my eye the samples he gave feel cyrillic rather than latin which Ralph & Andreas' do not. And I think German aught to feel mostly latin - even in a glyph such as this. I do like the fact that he showed some descenders though.\n\n"
    },
    {
      "time": "14 May 2007 — 10:37am",
      "content": "\\> I think German aught to feel mostly latin\n\nOnly after it feels fully German.\n\nhhp\n\n"
    },
    {
      "time": "14 May 2007 — 11:16am",
      "content": "<cite>Only after it feels fully German.</cite>\n\nIn the sense that a 'new' glyph should be 'on the team' and not stand out particularly much when used. Then yes. Entirely. In the sense that it should extend naturally from the historical German culture of letters. Again yes.\n\nIn the sense that it's 'Germaness' as an essence needs somehow to measured - then no.\n\nActually, I had been wondering if anybody would confuse my statement as being anti-blackletter. It wasn't. (There is a false but long held historical/cultural dichotomy of Roman/Latin vs. Blackletter/Fraktur) But actually what I meant by Latin was this visual/cultural continuity and the reality of intercultural pentration via loan words etc.\n\nAnd in fact one great way to give consideration to a form might be to try to write it out in the various blackletter styles: Textura, Bastarda, Schwabacher, Fraktur, Burgundica, etc, to see what happens. BTW, I am also not suggesting that direct continuity of form from the Sans serif to the Blackletter would be desirable either. Looking at Fette Fraktur's C,L, and S certainly suggest the opposite might be true.\n\nWhen I think about this letter it seems like the top 3 purposes would be :\n\n- Monuments in a Trajanesque mould,  \n- Signs in a Sans Serif style,  \n- and things like Pickle Jars ( packaging )\n\n... Admittedly tattoos and the back windows of pickup trucks might be candidates as well but I am less worried about those applications.\n\n"
    },
    {
      "time": "22 Jun 2007 — 3:35pm",
      "content": "At Hrant's request, here's the text of a message regarding the uppercase eszett that I sent to the ATypI discussion list. I should note that I originally opposed the encoding of the new character in Unicode, arguing that it could be implemented as a ligature of SS, with a plain text distinction made using the Combing Grapheme Joiner control character. I still think that good arguments can be made in favour of such an encoding -- for instance, it enables documents to be backwards compatible with older fonts that do not support the uppercase eszett glyph --, but on the whole I've accepted Andreas Stötzner and, especially, Asmus Freytag's reasoning in favour of the proposed encoding.\n\nAnyway, Hrant thought the following was a good synopsis of the matter, offered here as a contribution to the understanding of how we came to be where we are: wondering what this thing should look like.\n\n_A few comments about the proposed uppercase eszett character:_\n\nThis has been proposed to ISO 10646 (and hence Unicode) by DIN, so the likelihood of it being accepted for encoding is very high. Since it is a German character, with no implications for other languages, no one feels particularly inclined to vote against a DIN proposal. If the Germans determine that they want this character, they can have it.\n\nSo why do they want it? Basically, they want it because at least some people are using it and it is considered better to have an unambiguous encoding distinct from SS. The uppercase eszett is not a new invention: it has been around for at least a hundred years. It has been used on-and-off by some publishers -- notably on the cover of the DDR edition of Duden -- and although it has never been enshrined in the official norms of German orthography it persists. As Asmus Freytag wrote on the Unicode discussion list: it is remarkable that something without official sanction should have persisted so long in such a rule-bound culture.\n\nThere can be little doubt that at least some of the users of the uppercase eszett have employed it in the interests of alphabet reform, i.e. they want to see it become standard. Others may have used it only as a display solution for a particular piece of typography. For whatever reasons, some Germans have found a use or a need for it, in preference to SS.\n\nAnd let's be clear that the casing rule ß = SS is really messy for a nominally bicameral alphabet. Although ß began life as a ligature, it has long since ceased to function as one: it has distinct semantics from the sequence of two letters that it used to represent. It is a distinct character. The idea that it can be a distinct character in lowercase but not in uppercase is perverse, and causes major headaches in German text processing. The simple fact that case conversions in German are not roundtripable without dictionary support is crazy. Even if it were decided that the uppercase form of ß should always look _like SS, a good argument could be made for encoding this as a distinct uppercase character. However..._\n\n...that's not how German is encoded, and the DIN proposal for uppercase ß is explicit that the new character should not interfere with existing standards for German text. So this means that ß still = SS, and the Unicode casing rules for German remain in place. The new uppercase ß character will exist alongside these rules. What this means is that any software performing case mapping between the new uppercase ß and the lowercase ß characters must do so at a level independent of the Unicode character properties. This is quite possible, and if the uppercase ß character starts to become widely used I think we can expect to see it handled in such ways.\n\nThe uppercase ß encoding is an interesting instance of a character being made available outside of the norms of encoding for the language in which it might be used. This might sound silly, but it allows this persistent heterographic letter to function in modern text encoding and display environments, and in so doing puts a lot of control in the hands of users to determine its future. It may fall by the wayside -- one more little used Unicode codepoint -- or it may, in time, become formally recognised and made part of the standard orthography.\n\nAt first glance, it may seem contrary that, on the one hand, the Germans have regularised and simplified the use of ß -- suggesting, at least to Bruno, that it is on the way out --, but on the other hand providing at least some recognition for an uppercase ß. But it is easy to see how these may be complementary moves: providing a distinct uppercase equivalent to a lowercase character regularises an anomaly in a bicameral alphabet and simplifies case conversion.\n\n"
    },
    {
      "time": "22 Jun 2007 — 3:41pm",
      "content": "_Monuments in a Trajanesque mould..._\n\n[http://www.tiro.com/John/TrajanEszett.gif](http://web.archive.org/web/20141101211021/http:/www.tiro.com/John/TrajanEszett.gif \"http://www.tiro.com/John/TrajanEszett.gif\")\n\nThis is an illustration I made during discussions of this topic on the Unicode list. I decided to put the uppercase eszett to the Trajan Test. In this instance, I was also interested to see how convincingly a form could be created that explicitly referenced the uppercase S for the right side. I'm not completely satisfied with the results, and in general prefer the models I have seen with the diagonal at the top right, but some people liked it.\n\n"
    },
    {
      "time": "22 Jun 2007 — 3:51pm",
      "content": "Thanks John.\n\nFor the Trajan cap eszett, I think it's decent, but what I might try is  \nadding an explicit serif/terminal of some sort at the top-right corner.\n\nhhp\n\n"
    },
    {
      "time": "22 Jun 2007 — 3:52pm",
      "content": "Thanks John.\n\nFor the Trajan cap eszett, I think it's decent, but what I might try is  \nadding an explicit serif/terminal of some sort at the top-right corner.\n\nhhp\n\n"
    }
  ]
}
