{
  "id": "33649",
  "title": "Reversed apostrophe and Helvetica",
  "forum": "Design",
  "tags": [

  ],
  "content": "this apostrophe doesn’t look quite right to me.\n\n ![](http://web.archive.org/web/20070716085730im_/http:/typophile.com/files/07_5680.gif)\n\ndo you think i should replace the apostrophe with one from another font or is it ok as is?\n\nthanks,\n\ngregg\n\n [‹ Keeping Rupee, Peseta Tabular?](http://web.archive.org/web/20070716085730/http:/typophile.com/node/33642 \"Go to previous forum topic\") [Tyeface to represent 'Caravanner' ›](http://web.archive.org/web/20070716085730/http:/typophile.com/node/33648 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070716085730/http://typophile.com/user/5823\" title=\"View user profile.\">hereandthere</a>",
  "time": "<br>",
  "uid": "5823",
  "comments": [
    {
      "time": " 9.May.2007 5.00pm",
      "content": "It’s just the wrong one.\n\nTake this one \\> ’\n\nOh, you want it reversed?  \nMaybe something more round - like Clarendon.\n\n"
    },
    {
      "time": " 9.May.2007 5.11pm",
      "content": "i don’t need it reversed - is the regular apostrophe the correct usage in this case?\n\n"
    },
    {
      "time": " 9.May.2007 5.16pm",
      "content": "I’d say so.\n\n"
    },
    {
      "time": " 9.May.2007 5.29pm",
      "content": "_is the regular apostrophe the correct usage in this case?_\n\nYes! What you’ve got in your sample is a single left quote mark, not an apostrophe. An apostrophe is the same as a single right quote mark.\n\nUnfortunately, we see this mistake frequently due to the simplemindedness of desktop publishing software, which can’t tell the difference between the beginning of a quoted passage and a contraction. So much for “smart” quotes.\n\n"
    },
    {
      "time": " 9.May.2007 5.31pm",
      "content": "thanks a million!\n\n"
    },
    {
      "time": " 9.May.2007 7.04pm",
      "content": "Traditionally, what you want is a “turned comma.” An apostrophe is a “raised comma.” The “reversed apostrophe” or “reversed quote” is yet a different character — see the Unicode General punctuation range, I forget the Unicode number. The Lakeside Press use to use reversed quotes & double quotes in a series they published — <cite>Tom Horn</cite> used them for sure.\n\n"
    },
    {
      "time": " 9.May.2007 7.23pm",
      "content": "_Traditionally, what you want is a “turned comma.”_\n\nYou do? On a numerical contraction like ’70?\n\n"
    },
    {
      "time": " 9.May.2007 8.10pm",
      "content": "No, Mark, for publications in North America you are correct, not only in your assessment of what is the current state and what the appropriate replacement should be, but also in how it got there.\n\n"
    },
    {
      "time": " 9.May.2007 8.24pm",
      "content": "“is the regular apostrophe the correct usage in this case?”\n\nYes, and here’s why: because in this case, the apostrophe indicates [an omission](http://web.archive.org/web/20070716085730/http:/en.wikipedia.org/wiki/Apostrophe#Apostrophe_showing_omission). Which is why the apostrophe is in “here’s”, which is a truncated version of “here is” which omits the space and i.\n\nIn your case, the apostrophe indicates the omitted 20.\n\n"
    },
    {
      "time": " 10.May.2007 4.57am",
      "content": "Mark, you’re right. I got so caught up in the naming convention, I forgot the original problem.\n\nI do think the naming conventions have some importance, perhaps less so in this instance, but rather more when the marks are used in phonetics . . .esp. since some web sites use the ’straight-up-and-down” mark for an ’apostrophe,’ which leads to yet more confusion.\n\n"
    }
  ]
}
