{
  "id": "33670",
  "title": "(x) \"Anwendungen\" sans serif (small and distorted sample) - Sys {Yves}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "tought it was klavika, but obiously the g is not...\n\n| Attachment | Size |\n| --- | --- |\n| [fontID.gif](http://web.archive.org/web/20110401105557/http:/typophile.com/files/fontID_1.gif) | 3.1 KB |\n\n",
  "author": "<a href=\"/web/20110401105557/http://typophile.com/user/17803\" title=\"View user profile.\">john good</a>",
  "time": "<br>",
  "uid": "17803",
  "comments": [
    {
      "time": "",
      "content": "How about FF Sanuk?  \nYour sample is so tiny. It could be anything.  \nLooks FontFont to me.\n\n"
    },
    {
      "time": "",
      "content": "What happened to the image? It seems all twisted and rather small. Can you get a better sample?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "_\" It could be anything.\"_\n\nIndeed. Including [FF Strada](http://web.archive.org/web/20110401105557/http:/www.myfonts.com/fonts/fontfont/strada/), or [FF Unit](http://web.archive.org/web/20110401105557/http:/www.myfonts.com/fonts/fontfont/unit/), but your guess ( [FF Sanuk](http://web.archive.org/web/20110401105557/http:/www.fontshop.com/fonts/downloads/fontfont/ff_sanuk_rg_lf_tf/)) seems like a good one too.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Neo Sans has a similar feel\n\n"
    },
    {
      "time": "",
      "content": "My bet is [FF Fago](http://web.archive.org/web/20110401105557/http:/www.fontshop.com/fonts/singles/fontfont/ff_fago_normal_regular_roman/&sample_text=Anwendungen&sample_size=36).\n\nA reminder: FontShop.com still offers links to custom samples. Helps a lot in a case like this.\n\n"
    },
    {
      "time": "",
      "content": "or [Camingo](http://web.archive.org/web/20110401105557/http:/www.myfonts.com/fonts/jan-fromm/camingo/regular/testdrive.html) but, yes, hard to say without a better sample.\n\n"
    },
    {
      "time": "",
      "content": "_\"A reminder: FontShop.com still offers links to custom samples. Helps a lot in a case like this.\"_\n\nYes, I know Stephen, and I use it at times, but I'm sorry to say your site there is still slow, and now it has become 'browser-hostile' to my antique Mac browsers. (My Mac OS X experiment was too much effort, for a variety of reasons, and will have to wait until I buy a new Mac later this year.)\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I'm sorry to hear you're not OS X yet. Also sorry that our little company doesn't have the resources to make our site compatible with antique browsers. We want to make it happen. It's just a matter of time. And by that time, the number of OS 9 and Windows ME users is even smaller.\n\nBut, hey, it looks like you got to the Sanuk page ok! Would love to know what issues you encounter. I assume you're using IE5 on OS 9?\n\n"
    },
    {
      "time": "",
      "content": "I agree with Mike, tho, Stephen. Your site is vastly improved and much more useful but still slow to load (altho not as slow as typophile these days). And I'm on OS X.\n\n"
    },
    {
      "time": "",
      "content": "This is great to know. Thus far we've only had reports that it's quicker than the previous version. Is it image loading that's slow or getting initial connections to the pages? May I ask what is your internet connection and CPU? Thanks Patty!\n\n"
    },
    {
      "time": "",
      "content": "I think FontShop.com is much faster. But, stuff like load time is so relative that you can't possibly take everything single person into consideration.\n\n"
    },
    {
      "time": "",
      "content": "Stephen, I can't get it to show the font samples all the time, and it doesn't seem to change the url to show the test setting for a customized sample, if it will make a sample.\n\nRegarding the site speed, as Patty says, it's better, but still feels slow compared to MyFonts. It also doesn't hold a custom sample while you look at various fonts.\n\nI use either iCab (a German-designed Mac browser) or MS IE5. I can restart my computer in Mac OS X and use Mozilla, but then I lose access to my old graphics applications and e-mail.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "\"and it doesn’t seem to change the url to show the test setting for a customized sample\"\n\nWe've changed custom samples on FontShop.com so they render much more quickly by not forcing the entire page to reload. Any [custom sample](http://web.archive.org/web/20110401105557/http:/www.fontshop.com/fonts/singles/itc/rapier/&sample_text=Gamblin%20&sample_size=130) is still linkable. On any search result page, package page, or [single font page](http://web.archive.org/web/20110401105557/http:/www.fontshop.com/fonts/singles/itc/rapier/), just change your sample and click the \"Link to this Custom Text\" or copy that underlined link.\n\n"
    },
    {
      "time": "",
      "content": "I wish it didn't show the fonts grouped by package. If I want to look at, say, Scala Bold I don't want to have to guess whether it's in package 1, 2, whatever.\n\nTHe keyword search also needs some refining. For example I typed \"circus\" in both fontshop.com and myfonts.com. Fontshop gives me Helvetica, Bodoni, Snell Roundhand... huh? Myfonts gives me circus fonts (and fonts with circus in the name).\n\nThe sample feature is great, tho. And I like that you don't have to get the \"waterfall\" like in myfonts - that is a useless feature.\n\nI use Mac OS X (Tiger), Safari.\n\n"
    },
    {
      "time": "",
      "content": "\\> If I want to look at, say, Scala Bold I don’t want to have to guess whether it’s in package 1, 2, whatever.\n\nActually, this is one of the improvements we made in the last revision. [Search for \"Scala Bold\"](http://web.archive.org/web/20110401105557/http:/www.fontshop.com/search/?q=Scala%20Bold) and get packages that contain Scala Bold _and_ single fonts. Try the [same search on MyFonts](http://web.archive.org/web/20110401105557/http:/www.myfonts.com/search?search%5Btext%5D=scala%20bold). I realize our new search engine isn't ideal in all cases, but it's far better than before. Each site's methodology has its merits.\n\n\\> The keyword search also needs some refining.\n\nI agree. It is sometimes far too loose right now and we'll improve it over time. The quality of results from any font reseller varies depending on the keyword.\n\n"
    },
    {
      "time": "",
      "content": "I guess I meant that I'd like to actually see the entire Scala family at once without it being package driven. But realize that I mostly use these sites for type IDs. For someone looking to buy a font, which I suppose is your target audience, the packages are very useful.\n\nBut it is nice to be able to search for an individual weight, thanks for adding that.\n\n"
    },
    {
      "time": "",
      "content": "OK, Ancient Mac Tester reporting in (Let's see, I'm ancient and so is my Mac, so I guess that works either way you interpret it.):\n\nWith OS 9 and iCab: - I don't get the unsupported browser message at the top of the screen. I can go to the 'downloads' and 'singles' levels and generate custom samples, but the url info never changes to show the \"&sample\\_text=\" part, and I don't see any \"Link to this custom text\" choice.\n\nWith OS 9 and IE5: - I get the unsupported browser message at the top. I can get the Package showing (downloads) and I can see my custom sample, but no url change. If I go to the single font level I cannot generate a sample and do not even see the font, just the name.\n\nI can volunteer to do 'Beta testing' on compatibility changes for Old Macs. Seriously. (If you deem it useful). I know I'm a dying breed, so it probably isn't worth it, but now you know where I am coming from.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Thank you very much Mike. I'll report this to our (very small) development team. Perhaps they are simple fixes and we can get you and your ancient ilk back in full compatibility.\n\n"
    },
    {
      "time": "",
      "content": "The original \"Anwendungen\" sample looks like Fedra sans alt. It's been bugging me for days.  \n [http://www.typotheque.com/font\\_tester/](http://web.archive.org/web/20110401105557/http:/www.typotheque.com/font_tester/ \"http://www.typotheque.com/font\\_tester/\")\n\n"
    },
    {
      "time": "",
      "content": "It _might_ be Fedra Sans Alt Alex, but our problem was that the sample is not clear enough to be sure. Personally, I think it's a good guess, and my philosophy about these id's is that if you can't tell if it _isn't_ the font you picked, then it's a good enough choice to use to re-create it.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "typofoto - I still think it's FF Fago. Check my link again. Fedra Sans has an x-height larger than the font in this sample.\n\n"
    },
    {
      "time": "",
      "content": "I don't know Stephen. If nothing else, the ear on the 'g' seems angled up slightly, and doesn't look like either Fago or Fedra to me, but the darn sample is twisted and small. Who can be sure?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "This sample gives me a wonderful feeling, and I'm dissapointed with every substitute I try.  \nThanks for all your efforts, I think I'm maybe after something that's not real, and that exists only in my immagination. This lower case n is haunting my dreams.\n\nIs it time to create ? it might be...\n\nby the way, this comes from the wonderful [work](http://web.archive.org/web/20110401105557/http:/www.felixheinen.de/020.html) of [Felix Heinen](http://web.archive.org/web/20110401105557/http:/www.felixheinen.de/)\n\n+\n\n"
    },
    {
      "time": "",
      "content": "Ahh, well that link helps a lot. This image proves it's not Fago _or_ Fedra, but should get us closer to an answer. Some of the caps and the 'e' have a very square, almost [Isonorm](http://web.archive.org/web/20110401105557/http:/www.fontshop.com/search/?q=Isonorm)ish quality.\n\n ![](http://web.archive.org/web/20110401105557im_/http:/typophile.com/files/2008_6455.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I'm pretty sure this is [Fabrizio Schiavi](http://web.archive.org/web/20110401105557/http:/typophile.com/wiki/Fabrizio%20Schiavi)'s [Sys](http://web.archive.org/web/20110401105557/http:/www.fontshop.com/fonts/downloads/schiavi_design/sys_family/).\n\n"
    },
    {
      "time": "",
      "content": "Here's [Camingo](http://web.archive.org/web/20110401105557/http:/www.myfonts.com/fonts/jan-fromm/camingo/?refby=typographica) again. Nearly a match, but no.\n\n ![](http://web.archive.org/web/20110401105557im_/http:/typophile.com/files/904c0e975c39fc9a4b5a666f0d2cc1b7_4237.png)\n\n"
    },
    {
      "time": "",
      "content": "Yves [schooled us all](http://web.archive.org/web/20110401105557/http:/www.fontshop.com/fonts/downloads/schiavi_design/sys_family/&sample_text=12345%20Anwendungen&sample_size=36) again. Amazing how soft focus photography can skew a typeface's characteristics. If we saw it up close we would have called out Sys' ink traps right away.\n\n"
    },
    {
      "time": "",
      "content": "shame on me, should care my screenshots.\n\nsorry, thanks and congrats.  \nmasters.\n\n+\n\n"
    },
    {
      "time": "",
      "content": "4 styles 228€  \nI've got to love that font !\n\n"
    },
    {
      "time": "",
      "content": "A good catch! I doff my hat. I even licenced Sys myself, ages ago, and didn't recognise it.\n\n"
    }
  ]
}
