{
  "id": "33671",
  "title": "portfolio rip off",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi Everyone,\n\nI am senior in the design school in NYC and about graduate in this summer. I have a portfolio class at the moment. Our teacher asked us to give our portfolio files and give it to them. They even dare enough to ask to put the fonts that we used to the cd. (Outlines is still acceptable) if we dont give our portfolio files they would fail us. I opposed this idea but apparently I still have to give the files.\n\nPlease let me know if you have any suggestion.\n\nthank you\n\n [‹ typeface classification](http://web.archive.org/web/20080906234455/http:/www.typophile.com/node/33953 \"Go to previous forum topic\") [what is this font? ›](http://web.archive.org/web/20080906234455/http:/www.typophile.com/node/33952 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906234455/http://www.typophile.com/user/15190\" title=\"View user profile.\">LoveType</a>",
  "time": "<br>",
  "uid": "15190",
  "comments": [
    {
      "time": " 10.May.2007 8.54am",
      "content": "What exactly are you opposed to?\n\nIllegally re-distributing fonts? (It seems if outlining your type is OK, that’s not a problem.) Submitting your portfolio on CD instead of on paper? Or doing it at all?\n\n"
    },
    {
      "time": " 10.May.2007 9.00am",
      "content": "Do you think your school wil steal or sell your work or something?  \nIf so, I would ask myself what I’m doing at that place to start with. :)\n\n"
    },
    {
      "time": " 10.May.2007 9.01am",
      "content": "I imagine they want to look at the files to asses the design but also your technical skills. Apart from the font question I don’t think you have grounds for objection.\n\n"
    },
    {
      "time": " 10.May.2007 9.04am",
      "content": "What would be risky or unethical about making PDFs of everything, all fonts converted to outlines (vectors)? Then the work can’t be opened or used and there are no fonts present.\n\n"
    },
    {
      "time": " 10.May.2007 9.08am",
      "content": "What exactly do you mean by ’portfolio files’? Do you mean board layouts? or copies of every project you’re showing in your portfolio?\n\n"
    },
    {
      "time": " 10.May.2007 9.12am",
      "content": "<cite>Our teacher asked us to give our portfolio files and give it to them. They even dare enough to ask to put the fonts that we used to the cd.</cite>\n\nIf you look at the student handbook, you will likely find something about you owning the work, but the school having unrestricted rights to reproduce the work for promotional purposes. Getting original files from students is how schools get the materials for reprinting. Chances are that there is nothing you can do about this that won’t allow the school to toss you out right before graduation.\n\n"
    },
    {
      "time": " 10.May.2007 9.17am",
      "content": "I have had to do give sourcefiles of designs to my schools countless of times. I don’t see any problem with it.\n\n"
    },
    {
      "time": " 10.May.2007 10.03am",
      "content": "Schools also need to collect work for program review purposes and other forms of evaluation. No one is trying to rip you off here - turning in projects is not going to get you in trouble - educational use is “fair use”.\n\n"
    },
    {
      "time": " 10.May.2007 10.43am",
      "content": "Yeah. I don’t get the objection at all. I especially am taken aback with the use of “they even dare enough to ask...” You’re in school. Your instructors don’t “dare to ask,” they give assignment parameters. If this is offensive to you, then you’re in the wrong place AND the wrong field, because you’ll be collecting for output the rest of your career.\n\n"
    },
    {
      "time": " 10.May.2007 10.56am",
      "content": "And this is sent out like a beacon to all students of graphics or art:  \nYOUR TEACHERS ARE NOT INTERESTED IN STEALING YOUR WORK.  \nSheesh.\n\n"
    },
    {
      "time": " 10.May.2007 11.05am",
      "content": "I think we need more information here.\n\n"
    },
    {
      "time": " 10.May.2007 11.29am",
      "content": "As a recent graduate myself I had to do this last week as part of our final portfolio review.\n\nWe however only had to submit 300dpi or higher PDF files of all of our work. Most of what I submitted was photography of the work itself and not the actual files.\n\n"
    },
    {
      "time": " 10.May.2007 11.42am",
      "content": "Well, there are several very good reasons why an instructor would ask for such material. First, without knowing the format or application in which the portfolios are being created, it’s possible the instructors need the font files and all placed images to view them correctly (if a PDF won’t dofor the purpose of the assignment). Second, it’s just darn good practice for students to learn about proper file preparation, collecting for output, and assembling COMPLETE and ACCURATE files. The third reason, as stated already, is that institutions have the right (and in another sense, an obligation) to collect work being produced by students for either academic review (very necessary) or for promotion of the program to prospective students (also very necessary).\n\n"
    },
    {
      "time": " 10.May.2007 1.15pm",
      "content": "portflio files means they want everything that i put in my porfolio\n\n"
    },
    {
      "time": " 10.May.2007 1.16pm",
      "content": "thank you for all your comments. I have some freelance works as well that i want to put in the portfolio because there would be some professionals would come to school to see our portfolios.\n\nthank you for the coments.\n\n"
    },
    {
      "time": " 10.May.2007 1.29pm",
      "content": "I can understand them wanting to include all the files. However, that said, it would seem to me that they would accept PDFs. Any educational institution worth their salt would not require a student to include fonts.\n\n"
    },
    {
      "time": " 10.May.2007 1.57pm",
      "content": "Dear ChuckGroth,\n\nI always gives my files to my teacher.  \nPortfolio class is helping student to do lay out their portfolio.\n\n"
    },
    {
      "time": " 10.May.2007 2.01pm",
      "content": "LoveType:\n\nCan you explain why you think this is a bad thing?\n\n"
    },
    {
      "time": " 10.May.2007 2.04pm",
      "content": "_Any educational institution worth their salt would not require a student to include fonts._\n\nI don’t think that’s quite fair. We don’t know the exact details of the assignment; keeping track of and including the fonts may well have been a integral part of preparing the piece. For graphic design projects, I don’t usually instruct students to include fonts, but I OFTEN require them to list each font used in the piece by its exact name and weight.\n\n[edit]  \nWithout being in the class or hearing the assignment ourselves, it’s very difficult to condemn an instructor or institution. There may have been (re: probably were) particular objectives the instructor was trying to achieve.\n\n"
    },
    {
      "time": " 10.May.2007 2.10pm",
      "content": "Sorry, Chuck. Maybe I spoke to harshly.\n\nIf one part of the reason for reviewing the work is to check for how they prepare for print perhaps including the fonts might be good, if it weren’t so wrong. Listing the fonts, as you’ve suggested, is the best and most correct thing to do.\n\n"
    },
    {
      "time": " 10.May.2007 2.13pm",
      "content": "Sorry, Miss Tiffany. I’ve been grading all day!\n\n"
    },
    {
      "time": " 10.May.2007 3.30pm",
      "content": "_If you look at the student handbook, you will likely find something about you owning the work, but the school having unrestricted rights to reproduce the work for promotional purposes. Getting original files from students is how schools get the materials for reprinting._\n\nSeveral of our faculty ask for pdf versions of student work for grading, me included. It makes life easier and we don’t end up having to haul a pile of boards around. Mounted work is a pain to deal with and students often don ’t bother to pick it up or come by to get it until two semesters after it’s been discarded. Using pdfs makes my life much easier.\n\nThe school does have a disclaimer as jpad said, but it differentiates what the school uses for promotional purposes. For that students sign a waiver granting permission for the artwork to be used. If the student doesn’t want to do that it’s no problem. The stuff faculty collects is only used for grading purposes and can’t be used for anything else.\n\nI also photograph some projects that won’t pdf well — 3D stuff. Occasionally I will ask for InDesign files just to check on whether the student properly set indents and paragraph styles and didn’t just hit the tab key. I hate that.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 10.May.2007 3.43pm",
      "content": "Lovetype, what’s your issue with this ’submitting working files ... AND FONTS’?\n\nI’m tipping we’re being taken for a nice slow walk around the park ... we all needed the fresh air anyway. Cheers.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20080906234455/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": " 10.May.2007 8.33pm",
      "content": "I’m young and haven’t even graduated from school yet, but I was shocked reading your statement.\n\nNo offense or anything, but you need a reality check if you’re that protective of your work as a college student. I would imagine, your best work is ALL ahead of you.\n\nYou need to prepare for the real world. If you’re not giving college work to your own college, have fun working for demanding bosses.\n\n"
    },
    {
      "time": " 10.May.2007 9.46pm",
      "content": "I just realize how bad year in school has changed my mind. I can understand that most of the people don’t agree with me. I would give the same comment like most of you guys. I used to give all my works with no problem. I even gave all my prints to my teacher. Sometimes I did design for appreciation as well. I did intern for two of my teachers as well. One of my previous teacher also asked me to do project for him.\n\nIn this senior year, I almost didn’t learn anything for graphic design or typography but I still learn different things :-). I felt very frustrated. I always spent my time in library ( I remember where most of the good books put even some of the book hasn’t been took out for more than ten year). I go to museums, galleries or speaker to get inspiration. I do some freelances as well and do some competitions to improve my skill.\n\nSome of my teacher don’t know what they doing. It is very sad but true. A week ago I was yelled because I corrected something. I don’t want to talk to much about negative things that happened to me. I belive I was trained to deal with people.\n\nI felt in a year I didn’t learn anything and most of my portfolio in 5th and 6th semester. None of the my work would be put in my portfolio from 7th to 8th semester. Suddenly my instructor ( I had this teacher for the first time)asked me to give all my portfolio files and i felt that my teacher ripped of my works. My teacher also asked to give our website file.\n\nwithout your comments I wouldn’t realize this. I am really appreciate it.  \nthank you\n\n"
    },
    {
      "time": " 22.May.2007 3.01am",
      "content": "ok\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20080906234455/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 22.May.2007 8.01am",
      "content": "Another reason an instructor might be asking for files is that they might have been burned in the past by a student stealing someone else’s work and claiming it their own. It is very easy to copy/scan a commercial piece and make a few modifications to it. A good teacher opening a file can see which bits are original and which were stolen.\n\n"
    }
  ]
}
