{
  "id": "33694",
  "title": "Letterhead Policy is going to ruin them!!! PLEASE READ",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Please Pass the word around so that no one gets burned by Letterhead. I talked to them today and they will not budge on this. They know you can't embed the font in a PDF for a proof to customers and that you can't package the fonts with an Indesign document. I was told that the solution is for us as users of their fonts to convert them to curves/outlines before saving the files. The lady I talked to told me that this is going to be the policy from now on because of piracy and that they don't care if it makes customers mad or if they loose my business. She told me there are other font venders out there and I was welcome to go elsewhere if I did not agree with their policy.  \nI am saddened by this. We all know that this will do nothing to prevent piracy. We have many examples that this sort of anti-piracy effort does not work. It does however, curtail the rights of honest consumers, just trying to purchase and use their fonts.\n\nPlease help me make this known\n\n\"…Personally, I think they will regret this. I hope they do.  \nLet's make noise and boycott them so that maybe they will change.  \nWe need to pass this along to others and get the word out.  \nHere is what they’ve done:  \n1. You no longer receive an actual font file, at least not that you can see.  \n2. Instead what you download is an installer that installs an application called “Letterhead Fonts” (at least on Macintosh which is what I use).  \n3. The fonts are either embedded in this “Letterhead Fonts” application or somewhere else unknown/hidden from the user. No fonts are installed in the traditional Font folder locations.  \n4. Once installed, the “Letterhead Fonts” application activates the fonts permanently, at least as far as I can tell, like a font manager. You see them only in the font menus of your other applications, nowhere else. It also doesn’t currently allow fonts to be seen or managed in font manager applications like Suitcase, Font Agent, etc., though LHF apparently plans to add this capability.  \nAside from the obvious antipiracy objective, here are the biggest ramifications and problems I see for the user (myself, for one):  \n- You are completely prohibited from organizing the fonts like you want on your hard drive, such as for classification or other purposes. All your flexibility is taken away including any system or method that you might have had in place to manage fonts for your own needs.  \n- As mentioned, the LHF fonts can’t be activated individually. It’s an all or nothing proposition. (Unless/until they enable font managers to “see” the fonts perhaps, but maybe not even then, I haven’t seen them say.)  \n- It means you can’t add kerning pairs to a font, for example, or otherwise tweak the font yourself if problems are found or you have special needs.  \n- And of course, you can’t really back up the fonts themselves. Your only recourse if something were to happen is a reinstall from the various installers you may have accumulated over time, or else go back to their site for the installers there. (They do make provision for downloading previous font orders you have made with their new shopping cart system.)  \nA real shame since this will probably make a lot of people think twice about buying additional fonts once they see how it works the first time. I know it has me, despite LHF’s unique fonts. Lots of other good independent foundries around these days as alternatives. What do the rest of you think about where LHF has gone with this?\"\n\n",
  "author": "<a href=\"/web/20110703012742/http://www.typophile.com/user/18525\" title=\"View user profile.\">samasu</a>",
  "time": "<br>",
  "uid": "18525",
  "comments": [
    {
      "time": "",
      "content": "Here is a link to the previous thread:\n\n[http://typophile.com/node/30452/](http://web.archive.org/web/20110703012742/http:/typophile.com/node/30452/ \"http://typophile.com/node/30452/\")\n\nI agree with you.\n\n"
    },
    {
      "time": "",
      "content": "I'm still waiting to hear from Letterhead if this scheme is actually reducing 'piracy' as they hoped.\n\n"
    },
    {
      "time": "",
      "content": "Let them drown in their own persecution syndrome quagmire.  \nSurvival of the fittest, as they say.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "One of their protected fonts was pirated May 6th.\n\n"
    },
    {
      "time": "",
      "content": "\"One of their protected fonts was pirated May 6th.\"\n\nCracked? So, we're back to that old situation where the cracked software, by virtue of having the protection removed, is actually more convenient to use; \"better\" than the product paying customers get!\n\n"
    },
    {
      "time": "",
      "content": "Cracking the protection on a Mac was simple. The pirated posting seems to have come from a PC. I'm neither a hacker nor a pirate, just curious.\n\n"
    },
    {
      "time": "",
      "content": "Bad Press + already cracked fonts.\n\nSeems this equals fewer sales. The lady was right. There ARE other font vendors out there. In fact, these other vendors should all hire her to do their advertising, but keep her at a good, safe distance.\n\n"
    },
    {
      "time": "",
      "content": "\"One of their protected fonts was pirated May 6th.\"\n\nI'm shocked.\n\nNo, just kidding. I'm more surprised it took that long. ;o)\n\n"
    },
    {
      "time": "",
      "content": "How do they know the font was pirated?\n\n"
    },
    {
      "time": "",
      "content": "\\> How do they know the font was pirated?\n\nThey asked for support :^)\n\n"
    },
    {
      "time": "",
      "content": "“How do they know the font was pirated?”\n\nOne of their protected-only fonts was posted for download from file-sharing sites. A licensed user doesn't receive an actual font, just a very round-about way to load the font data into memory.\n\n"
    }
  ]
}
