{
  "id": "33704",
  "title": "Typeface for rebrand",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there. I’m working on a rebrand for a technological company which creates software solutions for mobile phones / smart phones. It’s a rapidly expanding company, at the cutting edge of this technology and I want a type family which reflects this but doesn’t look like it’s trying too hard to be trendy. I was thinking of one of Xavier Duprés’ typefaces - possibly Sanuk (I know Sony used Vista) - but I’d like to hear if anyone has any other ideas as I think Sanuk may be a bit harsh. They currently use Futura. Obviously it will have to translate across the all usual corporate literature.  \nThanks  \nSarah\n\n",
  "author": "<a href=\"/web/20091204155351/http://typophile.com/user/18531\" title=\"View user profile.\">SarahD</a>",
  "time": "<br>",
  "uid": "18531",
  "comments": [
    {
      "time": " 11.May.2007 3.19am",
      "content": "Sophisto might do the trick? A bit tech in its style. It has a lot of weights, symbols and patterns. Good for branding and available as OTF. Have a look here...\n\n[http://www.macrhino.com](http://web.archive.org/web/20091204155351/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\nor here\n\n[http://www.psyops.com/html/spec\\_sophisto\\_ss.html](http://web.archive.org/web/20091204155351/http:/www.psyops.com/html/spec_sophisto_ss.html \"http://www.psyops.com/html/spec\\_sophisto\\_ss.html\")\n\n"
    },
    {
      "time": " 11.May.2007 3.56am",
      "content": "Thanks Stefan - I’ve had a quick look at Sophisto and think it could fit the bill. I’d like to give it a tryout anyway, it does appear to cover all the bases and offer a fair bit of variety.\n\n"
    },
    {
      "time": " 11.May.2007 4.35am",
      "content": "There is a thread with a comparison between the different square sans faces.  \nSanuk is in it, but also Klavika and Camingo, for example. You can [find it here](http://web.archive.org/web/20091204155351/http:/typophile.com/node/28458).\n\nAnd Sophisto is a very nice typeface, Stefan.\n\n"
    },
    {
      "time": " 15.May.2007 7.54am",
      "content": "Some of the DTL typefaces have that quality. Prokyon, for instance.\n\n"
    },
    {
      "time": " 15.May.2007 7.57am",
      "content": "Amplitude could also be an option\n\n"
    },
    {
      "time": " 15.May.2007 7.58am",
      "content": "Amplitude could also be an option\n\n"
    }
  ]
}
