{
  "id": "3370",
  "title": "Press Release 9/19/02: SOTA Announces TypeCon2003: Counter Culture",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "BUFFALO, NY, SEPTEMBER 19, 2002 - The Society of Typographic Aficionados (SOTA) has announced plans for TypeCon2003. To be held in Minneapolis, Minnesota, July 18-20, 2003, the fifth annual TypeCon will feature a stellar group of speakers, including Matthew Carter, John Downer, Dave Farey, James Montalbano, and Jim Parkinson.   \n   \nAn international event designed for type makers and type users, TypeCon2003 offers workshops, presentations, panel discussions, type and design galleries, and plenty of opportunities for networking and fun. Letterpress printing, the history of wood type, and hand lettering techniques will be explored alongside the latest developments in digital type design, advancements in onscreen typography, and the art of producing quality typography with contemporary tools.   \n   \nWhile offering more education, entertainment, and exhibits than ever before, TypeCon2003 retains its uniquely intimate appeal - it's a gathering where first-year students and novice type designers can comfortably mingle with some of the biggest names in the type and graphic design fields.   \n   \nTypeCon2003 is presented by the not-for-profit Society of Typographic Aficionados, an international organization dedicated to the promotion, study, and support of type design, typography, and the related arts. Further information about TypeCon2003 may be obtained at [http://www.typecon2003.com](http://web.archive.org/web/20131014142752/http:/www.typecon2003.com/), or by email at [info@typecon2003.com](mailto:info@typecon2003.com). For more information about SOTA, please visit the website at [http://www.typesociety.org](http://web.archive.org/web/20131014142752/http:/www.typesociety.org/), or email [info@typesociety.org](mailto:info@typesociety.org).\n\n",
  "author": "tamye",
  "time": "19 Sep 2002 — 9:57pm",
  "uid": "107",
  "comments": [

  ]
}
