{
  "id": "3371",
  "title": "Ahoy Scrappin' Pirates!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The modern day font designer has a new more evil, more deadly threat than those who enjoy Carracho, Gutella, Hotline, etc. . .   \n   \n40 Year old single women with a pension for scrapbooking. These gals will stop at nothing to get their grubby hands on a as many fonts as are available and to add insult to injury will make these super secret \"collections\" available to the public in the form of eBay auctions and, retail software products for sale.   \n   \nIn almost every case, these font finds are indeed commercial fonts or fonts with a do not distribute read me.   \n   \nI am starting this thread to spotlight what may be infringing efforts on the part of those who'd care to make a quick buck at our expense. Please feel free to contribute what you deem questionable font collections for resale.   \n   \nStuart :D   \n   \nPlease check out: [http://www.instantscrapbookfonts.com/](http://web.archive.org/web/20081025121035/http:/www.instantscrapbookfonts.com/)\n\n [‹ Killing/f&#42;&#42;king Symbiotogram](http://web.archive.org/web/20081025121035/http:/www.typophile.com/node/3394 \"Go to previous forum topic\") [Heavy metal ›](http://web.archive.org/web/20081025121035/http:/www.typophile.com/node/3407 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025121035/http://www.typophile.com/user/1226\" title=\"View user profile.\">Diner</a>",
  "time": "<br>",
  "uid": "1226",
  "comments": [
    {
      "time": " 29.Feb.2004 8.12pm",
      "content": "Geeze, what a rip off. For 39 bucks they can get 1000 fonts from that other guy instead of 300.\n\n"
    },
    {
      "time": " 1.Mar.2004 6.12am",
      "content": "Excuse my ignorance, but what the chuffing McF\\*ckery is '_scrapbooking_'?\n\n"
    },
    {
      "time": " 1.Mar.2004 6.25am",
      "content": "My wife is into it. She took all the printed ephemera from our wedding and glued it into a book.\n\n"
    },
    {
      "time": " 1.Mar.2004 7.29am",
      "content": "John,   \n   \nShe probably wants something to remember you by after you smoke yourself to death. She loves you. You must be a great guy.   \n   \nMy wife will be cutting my picture out of every family scene. No scrapbook problem there. But these ladies with the selling font thing going on should be strung up by their curlers.\n\n"
    },
    {
      "time": " 1.Mar.2004 8.45am",
      "content": "This \"scrapbooking\" thing is a growing hobby in certain circles. I have a feeling Martha Stewart may have something to do with it. There are magazines, [websites](http://web.archive.org/web/20081025121035/http:/www.scrapbook.com/), etc. A rather slick little store called Archivers opened nearby recently. It's so busy that customers of nearby stores have a hard time finding parking spots.\n\n"
    },
    {
      "time": " 1.Mar.2004 8.48am",
      "content": "I'm noticing a cumulative effect over the last year or so where as many individuals are as much to blame as is the major companies making many of these types of products.   \n   \n [http://www.quickutz.com/](http://web.archive.org/web/20081025121035/http:/www.quickutz.com/) - Has just released a new die cut font product using one of my fonts without having asked permission OR obtaining the appropriate licensing for this type of product. While this normally wouldn't bother me, look what they're charging for MY work. [http://www.quickutz.com/public/products/alphabets/classic/katie/](http://web.archive.org/web/20081025121035/http:/www.quickutz.com/public/products/alphabets/classic/katie/)   \n   \nDouble check fellow font makers, I'm under the impression NOBODY is taking the time to properly license fonts for resale in any form.   \n   \nStuart :D\n\n"
    },
    {
      "time": " 1.Mar.2004 9.00am",
      "content": "I've been told by a friend that \"real\" scrapbooker's don't use fonts. Perhaps you could start by contacting [sales](http://web.archive.org/web/20081025121035/http:/www.quickutz.com/public/contact/sales/)?\n\n"
    },
    {
      "time": " 1.Mar.2004 9.36am",
      "content": "Scrapbooking is the new feng shui!   \n   \nIt's also where all those stickers have gone -- the colorful and often textured cutesy stick-ons that were popular when my daughters were in junior high school 10 years ago.   \n   \nLike Tiffany's friend, I'm surprised fonts are being used. It's more common to use stickers based on themes (Halloween, My 18th Birthday, etc.). Font designers who are worried might also need to check out the sticker collections to be sure the manufacturer has properly licensed their fonts.\n\n"
    },
    {
      "time": " 1.Mar.2004 10.09am",
      "content": "Ironic, that was surprise number two: [http://www.karenfosterdesign.com/images/products/10420.jpg](http://web.archive.org/web/20081025121035/http:/www.karenfosterdesign.com/images/products/10420.jpg)   \n   \nAn epidemic!\n\n"
    },
    {
      "time": " 1.Mar.2004 4.37pm",
      "content": "\" [http://www.quickutz.com/](http://web.archive.org/web/20081025121035/http:/www.quickutz.com/) - Has just released a new die cut font product using one of my fonts without having asked permission OR obtaining the appropriate licensing for this type of product. While this normally wouldn't bother me, look what they're charging for MY work. [http://www.quickutz.com/public/products/alphabets/classic/katie/](http://web.archive.org/web/20081025121035/http:/www.quickutz.com/public/products/alphabets/classic/katie/) \"   \n   \nIf they bought the font, do they have to ask permission to sell products using it? I thought buying the font lets you actually use it for anything you want?\n\n"
    },
    {
      "time": " 1.Mar.2004 4.48pm",
      "content": "This is a sticky wicket. The product they are selling lets users punch out letters. It doesn't wash with most font licenses, (at least mine). In this case, Quikutz has to reproduce the letterforms to create the tool, and make minute adjustments to create the \"die\" that punches the letter.   \n   \nI'll note the sad irony that a mechanical device is being used to create unathorized uses of a digital font.   \n   \nJoe VanDerBos   \n [www.joevanderbos.com/frametype.html](http://web.archive.org/web/20081025121035/http:/www.joevanderbos.com/frametype.html)\n\n"
    },
    {
      "time": " 2.Mar.2004 8.39am",
      "content": "We have clarified our \"value added\" fair use clause in our license. This page was intended to help describe \"fair use\"   \n [http://www.p22.com/comlicensing.html](http://web.archive.org/web/20081025121035/http:/www.p22.com/comlicensing.html)\n\n"
    },
    {
      "time": " 2.Mar.2004 8.47am",
      "content": "P22 has set a new standard as far as I'm concerned. It would seem to me that foundries who do have a \"derivative works\" clause in their license should do all they can to make it clear to the person(s) who might license their types.\n\n"
    },
    {
      "time": " 2.Mar.2004 9.52am",
      "content": "That is a fantastic illustration of appropriate licensing. I will indeed be adding such an illustration to the Diner in the near future.   \n   \nAlso to address Chris' post, to clarify, they contacted me to aquire permission to use the font in this manner and I explained permission would not be granted without first securing an OEM license, needless to say they went ahead anyway and now I'm playing clean-up.   \n   \nStuart :D\n\n"
    },
    {
      "time": " 2.Mar.2004 10.08am",
      "content": "RIchard, this is great stuff.   \nJust one problem: you don't want to show people getting away with it. Like in the Starbucks case, I know it's a really juicy one worth showing, but instead of something like \"(Which Starbucks has not done after repeated requests)\" you should say that legal action is pending, or at least being considered, or something.   \n   \nhhp\n\n"
    },
    {
      "time": " 2.Mar.2004 10.15am",
      "content": "We are close to resolution with Starbucks, so an appropriate modification will be made soon.\n\n"
    },
    {
      "time": " 2.Mar.2004 11.59am",
      "content": "Richard what a clear explaination of licencing. I like you used Illustration as well as type. Most licencing is written by lawyers in a language most people don't understand. Great Job.\n\n"
    },
    {
      "time": " 2.Mar.2004 12.23pm",
      "content": "It took a long time to write our new EULA (we had hired a lawyer to write it, but then threw out what they did and started over), but also we realized that we had to show examples of what was allowed with the basic license and what required additional licensing. We have had some good response so far.\n\n"
    },
    {
      "time": " 2.Mar.2004 3.26pm",
      "content": "Typespotting at a craft store is amusing (well, possibly). Besides the scrapbooking section, there are rubber stamps, wall stencils, etc. You can play spot-the-Lithos-knockoff or wonder why letters with dots at the terminals are popular so long after Tekton's heyday. I've often wondered if any of these products were from licensed designs. (Any success stories?)   \n   \nI'm having difficulty understanding how a EULA would prevent someone from, say, collecting all the nearby lost cat posters to obtain Comic Sans in A-Z, then creating the scrapbooking dies from those. What am I missing?\n\n"
    },
    {
      "time": " 2.Mar.2004 3.34pm",
      "content": "I'll guess that no one could stop you from doing that, David. ;)   \n   \nAgfa's definition is useful and understandable -- after reading it 2 or 3 times ::wink::\n\n"
    },
    {
      "time": " 3.Mar.2004 5.22am",
      "content": "If the fonts on the disk are pirated, then the designers who are being ripped off should be informed, and take action.   \n   \nBut I doubt the people purchasing this software would ever buy fonts, so is it damaging the font industry?   \n   \nIf this is such a money spinner, maybe we should be doing font CD's for these stores, taking type into the mainstream and making being a typophile the next big thing!\n\n"
    },
    {
      "time": " 3.Mar.2004 7.23am",
      "content": "Regarding the Starbucks/P22 Cezanne problem...   \n   \nMy opinion is that as long as somebody purchases the the proper license for the number of CPUs/devices/whatever, I don't care how extensively they use it. In fact, I hope they use it as much as possible and as _visibly_ as possible because in my experience there is a direct relationship between how often people see a font and how well it sells. Is it just a coincidence that P22 Cezanne is the best-selling P22 font at [MyFonts](http://web.archive.org/web/20081025121035/http:/www.myfonts.com/fonts/bestsellers.html)?\n\n"
    },
    {
      "time": " 3.Mar.2004 7.44am",
      "content": "Good point Mark, The main issue with Starbucks is that they did not purchase the proper license. The extensive use of the font for commercial products is actually a separate issue.   \n   \n\\>Is it just a coincidence that P22 Cezanne is the \\> best-selling P22 font at MyFonts?   \n   \nI don\n\n"
    },
    {
      "time": " 3.Mar.2004 8.00am",
      "content": "Is there a link to something I can read about this Starbucks thing?\n\n"
    },
    {
      "time": " 3.Mar.2004 8.06am",
      "content": "Richard, I agree with you about derivative works and getting the proper license to begin with.   \n   \nWhat I meant was, I don't think I would try to sell a special \"large scale\" license. If somebody buys a font and uses it in some \"large scale\" way in, say, an ad campaign, I'm getting more than the license fee from them already. (Less tangible, of course, but a real value.)\n\n"
    },
    {
      "time": " 3.Mar.2004 8.12am",
      "content": "That is the Key: proper licensing to begin with. Don't even get me started with Team One and the Lexus campaign!   \n   \n\\>Is there a link to something I can read about this Starbucks thing? There will be soon.\n\n"
    },
    {
      "time": " 3.Mar.2004 8.33am",
      "content": "Richard   \n   \n_I don?t think it is a coincidence, but if someone makes a set of \"cezanne\" rubber stamp alphabets or alphabet sticker sets, they they are making a derivative product that would require an additional licensing arrangement. In these cases, they are essential re-selling a version of the font in another format._   \n   \nDo you consider a font still a font when it has been turned into outlines or outlines and modified in Adobe Illustrator?   \n   \ngln\n\n"
    },
    {
      "time": " 3.Mar.2004 8.44am",
      "content": "\\> Do you consider a font still a font when it has been turned into \\> outlines or outlines and modified in Adobe Illustrator?   \n   \nI consider it a design with intellectual property rights. If someone chooses to use that design, they chose to accept the terms of the licensing. The design does not cease to be a design when it is converted to outlines anymore than a song that is sampled in another song. If the original is recognizable, it retains it's IP rights. (disclaimer: I'm not a lawyer, although I play one on the internet)\n\n"
    }
  ]
}
