{
  "id": "33741",
  "title": "Whats does Mickey Mouse and the Swaztika have in common and what differences?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Apart from them being the same colours and the fact that Hitler dipised the Jews and so did Walt Disney. They were both icons of the 1930's but the swaztika symbolised good luck. Is that true? and why would Hitler not allow students to wear the Micky Mouse badge when they were supporting Hitler? That's weird and he made them wear the swaztika instead. Did you know that Hitler was found with a Mickey mouse watch on? Hmmmm...so why did he get rid of Mickey mouse badges from students then? So back to my original question, they were both meant to be symbols but what of? Symbols of power? Were they both rebelious?  \nWhat about the crucifix and the swaztika? Do they have much more in common than that of Mickey mouse and the swaztika? I know that the swaztika is a bent cross from the religious cross so it derives from there but it was meant to be a symbol of well being. So from my knowledge, did the swaztika come before the cross or after but then it's confusing because they say that the swaztika derived from the cross so what came first? Anyone able to confirm?\n\n",
  "author": "<a href=\"/web/20100331013807/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": "",
      "content": "\\> the swaztika is a bent cross from the religious cross\n\nNo, it's much older than Christianity.  \nAlthough the cross as an \"abstract\" symbol is older still.\n\nYou might be interested in getting a copy of \"The Cross as  \nSymbol & Ornament\", J Troyer, 1961. The text of which  \nis all hand-lettered BTW (although it's not too much).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The swastika dates back to the neolithic period. The cross is probably an even older symbol.  \n [http://en.wikipedia.org/wiki/Swastika](http://web.archive.org/web/20100331013807/http:/en.wikipedia.org/wiki/Swastika)  \n [http://en.wikipedia.org/wiki/Cross](http://web.archive.org/web/20100331013807/http:/en.wikipedia.org/wiki/Cross)\n\nAs for what these symbols \"mean\" it depends on whose ascribed meaning you're talking about, and when.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Is this a joke?\n\nSome questions are so dumb they are impossible to answer.\n\nYou should first try some basic research before posting a thread for discusion.\n\n[http://en.wikipedia.org/wiki/Research](http://web.archive.org/web/20100331013807/http:/en.wikipedia.org/wiki/Research \"http://en.wikipedia.org/wiki/Research\")\n\n"
    },
    {
      "time": "",
      "content": "Dumber than any <cite>question</cite> is assuming a canned answer.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "No. It's true. I also heard that Mussalini had a cedar chest (hidden behind a bookcase in his private study) _filled_ with rubber chickens (ancient symbol of bad wedding reception dinners) and seltzer bottles, although publicly, he claimed to hate Vaudeville.\n\n[http://en.wikipedia.org/wiki/Rubber\\_chicken](http://web.archive.org/web/20100331013807/http:/en.wikipedia.org/wiki/Rubber_chicken \"http://en.wikipedia.org/wiki/Rubber\\_chicken\")\n\n"
    },
    {
      "time": "",
      "content": "[I don't see any similarities at all.](http://web.archive.org/web/20100331013807/http:/www.iht.com/articles/2007/03/28/arts/boomers.php)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100331013807im_/http:/typophile.com/files/Nazi_Mickey_6420.jpg)\n\n ![](http://web.archive.org/web/20100331013807im_/http:/typophile.com/files/9224141_a81e7b4cf9_m_4994.jpg)\n\n"
    },
    {
      "time": "",
      "content": "<cite>Apart from them being the same colours and the fact that Hitler dipised the Jews and so did Walt Disney.</cite>\n\nWow, that line is SO much funnier than it should be.\n\nAnyway, Walt Disney was a big Nazi sympathizer for a while when he was trying to get a German film distribution deal. It didn’t last. Anyway, you should have no trouble finding stuff about this if you start hitting up the libraries.\n\n"
    },
    {
      "time": "",
      "content": "Why do some people on here think i am DUMB? I am certainly not what you think I am!!! By the way, sorry to those peopel who took it serious (unlike the silly peopel who did not! You know who you are.) Anyway, Thomas, you said that the cross would have come about before the swaztika. My research suggests that teh swaztika used to be a symbol of peace in Hinduism way before the cross but then the Nazi's turned it around, I think 90 degrees and used it.  \nJpad, why would my line be soooo funny? I'm being straight to the point without any extra waffling. Is that meant to be funny? I don't know what's so wrong? i'm totally not with you. I really arn't.  \nWormwood, maybe you're a joke! My question is defiantely realistic and there is definitely some connnection. Maybe you're just not aware of it in the contexual manner. Sorry but I had to mention that. it upsets me that people just think I am dumb, when in actual fact, i'm not! Sheeesh, what is the world coming to.\n\n"
    },
    {
      "time": "",
      "content": "I don't think that you are dumb, and I hope that no one else here thinks that you are dumb either. I think that your ideas for your thesis are a bit too broad. This is something that happens or has happened to a lot of students—myself included. The trick is to narrow yourself down to one specific topic, and then discover the depth inside that and describe that well and persuasively. If you do that, your thesis will be great. Focus on one thing, though. You can't do everything! (nor should you!)\n\n"
    },
    {
      "time": "",
      "content": "I didn't think you were dumb, either; I just didn't think you were serious. Your question sounded a lot more like someone having a bit of fun on a Saturday afternoon.\n\n[an edit to show it can be done]\n\n"
    },
    {
      "time": "",
      "content": "Sorry I did not mean to say that. I feel really bad now and I can't even delete it. Sorry, OMG! How could I say something like that. Sorry.\n\n"
    },
    {
      "time": "",
      "content": "You can't delete it? I thought you said you weren't a blonde?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Dont want to upset any more people do I? an yup I can delete and have deleted it so :D\n\n"
    },
    {
      "time": "",
      "content": "By the way, why is this post also on  \n [http://dotsandloops.net/headlines/iid/347173](http://web.archive.org/web/20100331013807/http:/dotsandloops.net/headlines/iid/347173 \"http://dotsandloops.net/headlines/iid/347173\")\n\nI wonder...and Ricardo, where did you find that image? Was it in an article? Have a look at this  \n [http://www.bradblog.com/?p=3409](http://web.archive.org/web/20100331013807/http:/www.bradblog.com/?p=3409 \"http://www.bradblog.com/?p=3409\")\n\nIs Hitler's nose a Mickey Mouse nose in that image?  \n [http://mickhartley.typepad.com/blog/2006/02/mickey\\_mouse\\_po.html](http://web.archive.org/web/20100331013807/http:/mickhartley.typepad.com/blog/2006/02/mickey_mouse_po.html \"http://mickhartley.typepad.com/blog/2006/02/mickey\\_mouse\\_po.html\")\n\n[http://everything2.com/index.pl?node=Mickey%20Mouse](http://web.archive.org/web/20100331013807/http:/everything2.com/index.pl?node=Mickey%20Mouse \"http://everything2.com/index.pl?node=Mickey%20Mouse\")\n\n[http://www.bertisevil.tv/pages/bert003.htm](http://web.archive.org/web/20100331013807/http:/www.bertisevil.tv/pages/bert003.htm \"http://www.bertisevil.tv/pages/bert003.htm\")\n\nSo this question is not a joke, I can reassure you. I'm looking at in the contexual, historic manner which includes political too.\n\n"
    },
    {
      "time": "",
      "content": "The swastika is an ancient symbol of sun, also a good luck symbol  \nSee the history of the symbol of the Finnish air force pre-Hitler  \n [http://www.sci.fi/~ambush/faf/faf.html](http://web.archive.org/web/20100331013807/http:/www.sci.fi/~ambush/faf/faf.html \"http://www.sci.fi/~ambush/faf/faf.html\")\n\nI know I've posted this before to the Darfur thread, there's more about the symbol there  \n [http://typophile.com/node/31690](http://web.archive.org/web/20100331013807/http:/typophile.com/node/31690 \"http://typophile.com/node/31690\")\n\n"
    },
    {
      "time": "",
      "content": "seen this poster with the swaztika on the tail? [http://www.universityofthepoor.org/schools/artists/wwII/goebbels.htm](http://web.archive.org/web/20100331013807/http:/www.universityofthepoor.org/schools/artists/wwII/goebbels.htm \"http://www.universityofthepoor.org/schools/artists/wwII/goebbels.htm\")\n\n"
    },
    {
      "time": "",
      "content": "but i was serious about the rubber chickens and seltzer\n\n"
    },
    {
      "time": "",
      "content": "I don’t think that you’re dumb, but sometimes your matter-of-fact way of stating things is amusing. It’s probably because I’m a pretentious fop who needs at least a paragraph to say much of anything.\n\n"
    },
    {
      "time": "",
      "content": "Dyslexia aside Faz, if you put more care into the wording and spelling of your posts, and organized your thoughts a little more coherently, you might get taken more seriously here. I have said this before. Contrary to what you seem to think, I am not out to get you! It might help to listen to what people say instead of getting defensive.\n\nYour curiosity and variety of interests is admirable and the last thing I want is to discourage you. But your posts read like you composed them on the fly, and yet you expect (and often get) extremely thoughtful responses from the patient folk on this forum. It's a two-way street.\n\n"
    },
    {
      "time": "",
      "content": "and the vaudeville\n\n"
    },
    {
      "time": "",
      "content": "I did not say YOU were dumb. Though there is evidence to suggest it...\n\n_user account  \nFull name: missgiggles  \nCity: england_\n\nthe swaztika used to be a symbol of peace in Hinduism way before the cross but then the Nazi’s turned it around, I think 90 degrees and used it.\n\nMaybe I am a joke. I've often thought so.\n\nMaybe you should think about losing that chip on your shoulder and how it got there in the first place.\n\n"
    },
    {
      "time": "",
      "content": "the youth of today...\n\n"
    },
    {
      "time": "",
      "content": "I don't know what you're driving at. England is one of my favorite cities.\n\nAnyway, I would absolutely love to see gci footage of goose-stepping troops wearing Mickey Mouse insignia armbands. Could anything be better? (I'm being serious)\n\n(I've decided to include the additive \"I'm being serious\" each time I actually AM being serious, so as to avoid confusion in the future)\n\n"
    },
    {
      "time": "",
      "content": "_Anyway, I would absolutely love to see gci footage of goose-stepping troops wearing Mickey Mouse insignia armbands._\n\nThis [post](http://web.archive.org/web/20100331013807/http:/uncyclopedia.org/wiki/Admiral_Donald_Duck) comes from that same parallel universe... ;-)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100331013807im_/http:/typophile.com/files/wj4_3586.jpg)\n\n"
    },
    {
      "time": "",
      "content": "yes...\n\n(I'm serious)\n\n"
    },
    {
      "time": "",
      "content": "_the youth of today…_\n\nDon't you mean 'the Hitler Youth of today'?\n\n_footage of goose-stepping troops wearing Mickey Mouse insignia armbands_\n\nIt sounds like something I may have already seen in some nu punk video.\n\n"
    },
    {
      "time": "",
      "content": "I think you may be thinking of Pink Floyd. Or maybe I'M thinking of Pink Floyd...\n\n(i'm serious)\n\n"
    },
    {
      "time": "",
      "content": "Yeah, possibly the film version of 'The Wall'.\n\n"
    },
    {
      "time": "",
      "content": "This is just a statement:\n\nMy sides hurt.\n\n(I'm serious)\n\n"
    },
    {
      "time": "",
      "content": "Wow, a single image with Nazism, Mickey Mouse, references to George Bush, AND fake condensed Comic Sans.\n\nOnly in a Miss Giggles thread...\n\n"
    },
    {
      "time": "",
      "content": "On the 90 degrees notes: Why are the Giggles in that picture coming from the wrong source and in the wrong direction?!\n\n"
    },
    {
      "time": "",
      "content": "Aziz, like I've said [before](http://web.archive.org/web/20100331013807/http:/typophile.com/node/32622), those are emanations of Gigglespeak. Highly toxic stuff.\n\n(I'm not serious.)\n\n"
    },
    {
      "time": "",
      "content": "Burj al-Arab\n\n ![](http://web.archive.org/web/20100331013807im_/http:/typophile.com/files/250px-DubAymx_5769.JPG)\n\nsymbols of peace and love can also be found in many places.\n\nThe Tower of the Arabs greets boats approaching Dubai with a huge Christian cross.\n\n"
    },
    {
      "time": "",
      "content": "Sadly, against the outward thereof most such places soft+mercy,  \nbut the inward thereof thorns+chastisement?!\n\n"
    },
    {
      "time": "",
      "content": "well, we did discuss the swastika in our mythologies course. The swastika has been used in three contexts(in history i mean).  \nIn Hinduism, apart from luck its also a symbol of sorts of protection from evil.  \nIf im right,It is also a part of Nordic culture. It stood for the unity/brotherhood and blah blah.  \nThe national socialist party(germany) or the nazis, used the same cocept of brotherhood, twisted it to include racial superiority as well. And obviously, the swastika became infamous thanks to the nazis and Hitler.  \nAs for the mickey mouse..no clue..\n\nShreyas\n\n"
    },
    {
      "time": "",
      "content": "Don't overlook the Celtic triskelion, triple spiral, and running man symbols. They may only have three segments, but they're Indo-European solar and good luck symbols nonetheless. There's also the lauburu (Basque cross) and the Japanese tomoe.\n\nNow, since there were three Axis members (ignoring, of course, the twenty-odd minor powers, co-belligerents, puppet states, and collaborator states), but the swastika has four legs, that can only mean that Hitler intended to enlist one more major power. Certainly, there were significant fascist and pro-German movements in the United States before WWII. Was Walt Disney Hitler's front man and subliminal propagandist in the United States?\n\nWell, when Leni Riefenstahl went to the US in 1938 to try to make film deals, Walt Disney was the only studio head who met with her. This means you should look for hidden Mickeys\\* in Victory of the Faith, Triumph of the Will, Day of Freedom, Festive Nuremberg, Olympia, and Tiefland. You can use the Chryse Planitia or Cydonia filters in Photoshop to do so (these were originally developed by NASA to identify human faces on Mars\\*\\*).\n\n\\* [http://www.hiddenmickeys.org/WhatIs.html](http://web.archive.org/web/20100331013807/http:/www.hiddenmickeys.org/WhatIs.html \"http://www.hiddenmickeys.org/WhatIs.html\")  \n [http://en.wikipedia.org/wiki/Hidden\\_Mickey](http://web.archive.org/web/20100331013807/http:/en.wikipedia.org/wiki/Hidden_Mickey \"http://en.wikipedia.org/wiki/Hidden\\_Mickey\")\n\n\\*\\* [http://www.marstoday.com/news/viewsr.html?pid=15245](http://web.archive.org/web/20100331013807/http:/www.marstoday.com/news/viewsr.html?pid=15245 \"http://www.marstoday.com/news/viewsr.html?pid=15245\")  \n [http://science.nasa.gov/headlines/y2001/ast24may\\_1.htm](http://web.archive.org/web/20100331013807/http:/science.nasa.gov/headlines/y2001/ast24may_1.htm \"http://science.nasa.gov/headlines/y2001/ast24may\\_1.htm\")\n\n"
    },
    {
      "time": "",
      "content": "Speaking of 3, there's also Terreblanche.  \n [http://newsimg.bbc.co.uk/media/images/40260000/jpg/\\_40260627\\_terre1\\_ap\\_o...](http://web.archive.org/web/20100331013807/http:/newsimg.bbc.co.uk/media/images/40260000/jpg/_40260627_terre1_ap_ok.jpg \"http://newsimg.bbc.co.uk/media/images/40260000/jpg/\\_40260627\\_terre1\\_ap\\_ok.jpg\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I know that everyone on typophile is supposed to only provide constructive criticism, and that most everyone here is quite genteel, but I have to say that missgiggles's posts have only gotten more bizarre and demanding over the last six months, and I do not understand why someone who is asking for help is so frequently rude as well as unable to articulate even the most basic ideas.\n\n"
    },
    {
      "time": "",
      "content": "'Bizarre'? It's not bizarre...food for thought you could say! By the way, who said you can't learn from someone not as experienced as you guys/women on here. I may be little in the design industry now but doesn't mean to say I don't have big ambitions... So am I still bizarre? Arn't designers suppose to be bizarre so they can come up with innovative designs and ideas etc? Hmmm...food for thought (I am serious)\n\n"
    },
    {
      "time": "",
      "content": "I live for bizarre.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Designers are supposed to be articulate and professional and communicate their ideas well. Designers are supposed to be able to take criticism along with encouragement and not stamp their feet and go on the attack when people offer constructive advice. Designers should be able to learn from their mistakes and not repeat them. Being bizarre is rather low on the list of qualities a successful designer should strive for. However, on this forum, I do find it endlessly entertaining. Swastikas and Mickey Mouse, why the hell not?\n\n"
    },
    {
      "time": "",
      "content": "Think Different - Bizarre:  \nmarkedly unusual in appearance, style, or general character and often involving incongruous or unexpected elements; outrageously or whimsically strange; odd: bizarre clothing; bizarre behavior. markedly unusual in appearance, style, or general character and often involving incongruous or unexpected elements; outrageously or whimsically strange; odd: bizarre clothing; bizarre behavior.\n\n"
    },
    {
      "time": "",
      "content": "You left out the bottom part:\n\n—Synonyms weird, freakish, grotesque, ludicrous.\n\n"
    },
    {
      "time": "",
      "content": "Artists and Designers try to elevate the bottom parts and shoot for higher things\n\n"
    },
    {
      "time": "",
      "content": "The bottom part's the best part (of definitions, I mean)\n\n(I'm only a little serious)\n\n"
    },
    {
      "time": "",
      "content": "Oh my god, this thread is so hilarious… Ms Giggles, your questioning technique is really unrivalled and beyond comparison. I also always admire the patience and the ›helper syndrome‹ of all the experts involved.\n\n"
    },
    {
      "time": "",
      "content": "Um. I must have been too subtle (a first if so). The second and third paragraphs of my first post are jokes.\n\n"
    },
    {
      "time": "",
      "content": "I think that was unmistakable, Gus.\n\n"
    },
    {
      "time": "",
      "content": "\\> Artists and Designers try to elevate the bottom parts and shoot for higher things\n\nBojev, that reminds of underware's seller named \"Sayyad= Kingfisher\" in my hometown who could not resist a chunky goldfish turning shirts and shorts on his desk. Here the story goes:\n\nGoldfish: How much is this shirt?  \nKingfisher: 6 Dirhams  \nGoldfish : And this short?  \nKingfisher: 5 Dirhams.\n\nGoldfish: No discount?  \nKingfisher: Shirt 7 + Short 4, OK?  \nGoldfish : More?  \nKingfisher: Shirt 8 + Short 3, OK?\n\nGoldfish: The short is going down and the shirt is going up?  \nKingfisher: How are you off for the cash?  \nGoldfish: How are you off for the ... ?!\n\n"
    },
    {
      "time": "",
      "content": "Miss Giggles,\n\nI wondered what happened to you - it's been a long while since I've seen one of your topics emerge here.\n\nI also wonder why you have selected this topic, better, what does it have to do with type?\n\nThis is a day that I am in mourning. My mind is all over the place as I grieve for my dog (see the Bichon in the photo) got run over and killed by a UPS truck this morning.\n\nI am trying to keep my mind on anything but Bogie, and yet I see your ridiculous \"argument\" open for discussion, and dear lady, I wonder are you for real?\n\nNotice, not asking if you have an IQ of a genius, or the lack of any mentality whatsoever - just curious if you are really for real?\n\n"
    },
    {
      "time": "",
      "content": "Jackie,\n\nI am so sorry about your dog, how awful.\n\n"
    },
    {
      "time": "",
      "content": "I think the mods make these threads up to keep silliness confined.\n\n"
    },
    {
      "time": "",
      "content": "Sorry to hear about the Dog Departure.  \nAnd so are Kingfisher+Goldfish for their Dogfish.  \n(The 3 are real).\n\n"
    },
    {
      "time": "",
      "content": "Sheesh Jackie, i'm very sorry about your dog but don't take out your life aggression on me thank you. I am human and I have had many peopel close to me pass away within 3 months but don't mean I take it out on others and on someone who has started a thread on design. Sorry for your grief but I have had much of that myself from a very young age and still do. My thread is about Mickey Mouse and Swaztika. You didn't have to post an answer you know...  \nAbout when someone asked what it had to do with type...I did not ask about type and niether did I asked in the type section so what are you complaining about? Sheesh...what's the world coming to? I asked in regards logos and identity and its effects on society and people during the war and around the contextual design area so I asked in the DESIGN section! I don't mean to be rude sorry.\n\n"
    },
    {
      "time": "",
      "content": "Jackie,\n\nSometimes truth is stranger than fiction. I am not sure any of us are quite creative enough to invent a character as entertaining as missgiggles. But you're not the first to wonder.\n\n"
    },
    {
      "time": "",
      "content": "Miss G, your question \"What does Mickey Mouse and the Swaztika have in common and what differences?\" is such a combination of freshness, energy, muddle, pedantry, and bad grammar and spelling as to deserve landing in some kind of 'student topic hall of fame.'\n\nJudging by history, it seems that you can be as muddled as you like and get along fine as a designer. But professional designers generally believe in craftsmanship, and sloppiness is something many of them won't forgive. And these professionals include your potential future bosses.\n\nSo just for your edification here is an inferior but grammatical revision of your topic question:\n\n\"What do Mickey Mouse and the Swastika have in common as symbols and what are their differences?\"\n\n"
    },
    {
      "time": "",
      "content": "Your interjection of \"as symbols\" is distortive.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>distortive\n\nI think you should become Miss G's tutor :)\n\n"
    },
    {
      "time": "",
      "content": "Too late.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Okay - it's a day later. Thank you all for your concern about my poor little dog.\n\nThe other dog, Lauren has been running around searching - including going many times to the last place she saw Bogie. I hope she will be okay. She always knew how to keep to herself for long periods of time -- it was Bogie that forced her to play, run, skip, jump and dance. (Yep the two of them would cha cha cha all over the living room.)\n\nAs for swatstikas and Mickey Mouse - it is a laugh and a topic that to me, does not make sense here -- even in the \"design\" column.\n\nIf you continue your research you will learn such lovely words as:\n\n\"For the sheer power of the graphics,\" the sculptor Ernest Trova once said, \"Mickey Mouse is rivaled only by the Coca-Cola trademark and the swastika.\"\n\nand I think you have twisted what Ernest Trova said into this ridiculous question.\n\nOr maybe you stumbled across a little bit of information in an anti-nazi campaign of the 30s - where Goebbels was portrayed as a mouse with a swastika -- in an attempt to allow the masses to know that the master race was not being controlled by the master race.\n\nPerhaps you are a fan of the art director Chip Kidd - who once said, \"\"...Graphic Design, if you wield it effectively, is Power. Power to transmit ideas that change everything. Power that can destroy an entire race or save a nation from despair. In this century, Germany chose to do the former with the swastika, and America opted for the latter with Mickey Mouse and Superman.\"\n\nand somehow in your giggly mind I think you take pleasure in antagonizing -- being familiar with some of your threads, I have noticed you just like to pick a topic, maybe confuse it even, and try to get people to jump. You probably don't even care what they are saying or how they are saying it. And if someone is oppose to what you say - you change your meaning in mid-stream. If some one is with you - oh, wait - I haven't found that yet, so I cannot comment.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\n\nI do thank you for taking my mind off my grief even only for a moment.\n\nI will now say kaddish for tens of millions of deaths, that includes 6 million jews, 6 million gypsy and Eastern Europeans, soldiers and civilians from all nations. Among that I will say an extra prayer for my own family members who did not survive the war. Followed by prayers for my mother, grandmother, great aunt, uncle - all of whom I've missed for the past 25 years and a special prayer for Bogie.\n\nPlease try to be careful Miss Giggles - life is very short. The world is smaller than you think. And since I'm going for cliches - What comes around -- goes around. Perhaps thinking what you really want to say and add to the community before writing would be a great asset to your future endeavors.\n\n\\*\\*\\*\\*\\*  \nP.S. I see you have taken a shorter version of your quesiton to Yahoo  \n [http://answers.yahoo.com/question/index?qid=20070424135335AA3XJeQ](http://web.archive.org/web/20100331013807/http:/answers.yahoo.com/question/index?qid=20070424135335AA3XJeQ \"http://answers.yahoo.com/question/index?qid=20070424135335AA3XJeQ\")  \nand didn't get much of a response.\n\nMaybe that is the answer...\n\n"
    },
    {
      "time": "",
      "content": "The murder of my grandparents paved the way for that of yours.  \nBut the convenient, one-sided denial continues.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "[deleted]\n\n"
    },
    {
      "time": "",
      "content": "Well, maybe I should just say thank you Ms Giggles for making me think. I looked around the internet and came across an interesting article for you. You see - the ban on Mickey Mouse just didn't sit right. I could understand Hitler wanted his swastika on children's uniforms being first and foremost...\n\nAnd Popeye did a much better job reaching the establishment about being pro-American during those same years. You should if you find them check out his cartoons.\n\nMeanwhile I came across this and thought it might help you out a bit. Of all the crap out there, this at least has a sense of research and intelligence.\n\n[http://www.freewebs.com/banmickey/theproof.htm](http://web.archive.org/web/20100331013807/http:/www.freewebs.com/banmickey/theproof.htm \"http://www.freewebs.com/banmickey/theproof.htm\")\n\n"
    },
    {
      "time": "",
      "content": "Jackie, I really appreciate everyone's advice and comments. I do read them. I am not the kind of person people on here think. I do sympathise with your situation because I have been in bad situations myself when it comes to loosing beloved people may it be human or pet but sometimes we have to keep career as career and personal life as personal life beacuse for example a teacher's relationship with her partner is getting bad to worse and nearly ending in divorce. She comes in angry in class and punishes the students by her agitated, agressive behaviour and tells the kids off for somethign they didn't do. That is really unfair. I feel like I am being punished for your dog passing away and it's not even my fault. This puts someone down totally and why would you want to do that for? Lots of peopel ahve lost their beloved partners etc to cancer, war, accidents etc but you certainly don't go punishing others. As for the advice. I really appreciate your help. Please keep the above in mind. I totally believe in 'What comes around goes around' but I didn;t do anything to cause your dog passing away so why do you want to punish me for? You know what, I can't be botehred to keep going anymore. You are all adults on here and you should all know the difference between right and wrong by now, surely! I am just as human as the rest of you.\n\n"
    },
    {
      "time": "",
      "content": "Miss Giggles\n\nI will once again, as I have in previous threads, reminded you that because you do not hear intonations, see facial gestures or know the person the is writing -- or the style of writing -- that you seem to not grasp a comprehension of what is being written to you.\n\nWhat I have written has nothing, not a thing, to do with Bogie. It does have to do with the stupidity of your original posting in this thread.\n\nIs that clear enough now?\n\nand here is a P.S. for you to comprehend. Though it is more than 30 years ago, I received my BA from University, and have forgotten so much of what I learned, I did not study graphic arts there. I hold a BA in Europeean History 1805-1945, and find this \"design discussion\" too much off the wall for anyone serious to contend with. Please, go talk to Chip Kidd instead - you can find him at Random House in NYC. You can talk about Mickey's 4 limbs being bent out of shape - and ohhhh, maybe it looks like a swastika.\n\n"
    },
    {
      "time": "",
      "content": "No need to be nasty now and what was the 'Well, maybe I should just say thank you Ms Giggles for making me think' phrase above? Now now, I hear myself cry...is my thread really that stupid?\n\n"
    },
    {
      "time": "",
      "content": "Good night Miss Giggles.\n\n"
    },
    {
      "time": "",
      "content": "God bless...\n\n"
    }
  ]
}
