{
  "id": "33740",
  "title": "Thoughts on Logo development companies",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all,\n\nI’m new here and decided to post my question here as it seems like a rather mature forum. :)\n\nAnyway, time’s tight for me I have a client who needs some logo work done. I had informed him that I am simply to busy, but that there be some options. Here’s what I was thinking:\n\nThe background:  \n- The client has a very distinct and clear idea of what they want.  \n- A limited budget.  \n- They are a good past client.  \n- This is a small side venture for them (hence the budget constraints).\n\nThe plan:  \n- Possibly use a company like logoloft.  \n- I have mentioned the idea to the client so they are aware, and beyond the cost they would pay me to be a go between and most likely to do final tweaks.\n\nWhy Logoloft:  \n- It fits the budget constraints.  \n- There is a clear vision to start with.  \n- Even if they get the logo 70% of the way that’s time saved for me. I can then just come in a spice it all up and add finishing touches.\n\nThe downsides:  \n- There are many people with a strong opinion about places like logoloft.\n\nMy general outlook is the same way I look at development, it’s business and you need to consider not only the quality but general feasibility in everything that you choose.\n\nI’m hoping that perhaps some people here may have experience with logoloft (or other such companies) and may be able to point me in a reliable direction. Or in general just be able to recap their experiences with companies like logoloft. :)\n\nThanks for anytime you spend following up on this thread,  \ncmarley\n\n [‹ layout suggestions for a coursepack](http://web.archive.org/web/20081007180041/http:/www.typophile.com/node/46536 \"Go to previous forum topic\") [principles of design with type ›](http://web.archive.org/web/20081007180041/http:/www.typophile.com/node/46202 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007180041/http://www.typophile.com/user/18554\" title=\"View user profile.\">cmarley</a>",
  "time": "<br>",
  "uid": "18554",
  "comments": [
    {
      "time": " 12.May.2007 2.44pm",
      "content": "ah well,\n\nguess I’ll give it a try and see how things go. I’ll post up my experiences if anyone else is interested in the future. :)\n\nThanks again to anyone who may have read through this post.\n\n"
    },
    {
      "time": " 12.May.2007 5.40pm",
      "content": "Before handing such a project off to such a 3rd party, perhaps you could find a student designer that could use the money and the education? Just a thought. I have no experience with Logoloft so I can’t speak to their quality and level of service.\n\n"
    },
    {
      "time": " 12.May.2007 6.59pm",
      "content": "Hi,\n\nI had been thinking about that, my concern was budget though. I like to believe that even a student designer should be paid 75% the rate of a working pro. The budget for this logo is a to low to pay a student what I’m thinking would be reasonable rates (ideally I think a student should still get between 700-900).\n\nIt’s a decision I’m having a hard time with, the client is very good to me. And provides constant well paying work, that’s really the only reason I had looked at finding an alternate solution for them.\n\nThanks for the feedback, it’s very much appreciated.\n\n"
    },
    {
      "time": " 12.May.2007 7.14pm",
      "content": "Just looked at the Logoloft site. They advertise Microsoft as a customer. I clicked on the link—and found that their customer is not actually Microsoft, but a company that has done some kind of unspecified work on a Microsoft game.\n\nThat degree of misrepresentation would be enough for me never to recommend them to anybody.\n\n"
    },
    {
      "time": " 12.May.2007 8.24pm",
      "content": "I honestly don’t see how what Logoloft does is worse than what a lot of big design firms are doing. Logoloft gives you a trendy logo based on existing ideas for next to nothing. Plenty of big design firms do the same thing and charge $20,000. Is it really any surprise that Logoloft has no trouble finding customers?\n\n"
    },
    {
      "time": " 13.May.2007 7.28am",
      "content": "The fact that sites such as ’logoloft’ exist are a reason why its difficult for the benefits of graphic design to be taken seriously in some areas of the business world.\n\nI would always make time for design origination, especially creating logos, as decisions taken now will potentially have an effect in the visual marketing decisions in years to come. How can you argue that logoloft would ’design’ a better logo, than yourself when you already understand the personality, nature of business etc. etc. etc. of the client in question.\n\nI’d guess that in the time you have spent posting on this forum and looking to see if you had received any feedback, you could have put together the early stages of a logo, that would for many reasons be better than what can only ever amount to a ’clip art’ website.\n\n"
    },
    {
      "time": " 13.May.2007 2.06pm",
      "content": "you get what you pay for. and it may reflect badly on you.\n\n———————————-  \nChopper Reid says “Harden the \\*\\*\\*\\* up”.\n\n"
    },
    {
      "time": " 13.May.2007 5.46pm",
      "content": "Hi everyone,\n\nThanks for the feedback, positive or negative it’s appreciated. Muzzer I think that you have summed up my concerns pretty good. Well they are open Monday-Friday, guess I’ll give them a call and see what kind of impression I get over the phone. I still have about a week before a final decision is made. :)\n\nIf I decide to go through with logoloft I’ll be sure and give an update on my experience with them. Again thank you everyone for your thoughts and time.\n\ncmarley\n\n"
    },
    {
      "time": " 14.May.2007 6.55am",
      "content": "“The client has a very distinct and clear idea of what they want.”\n\nThey don’t need a logo then...just a production artist. Shouldn’t be hard to find someone that can tackle that without having to sell your soul to the logo sweatshops.\n\n"
    },
    {
      "time": " 14.May.2007 5.16pm",
      "content": "Speaking for myself, I am never very keen on “tweaking” the work of others; either I have (or want to invest the time in developing) an idea for a project, or I don’t. Likewise, either I take a project or I don’t, and this decision is based on all the things you’ve already stated: budget, schedule, work load, etc.\n\nIf I feel like I can’t take the project on, I am always happy to steer the client somewhere else, but I avoid coming into a job to clean up the mess or dot the “i”s.\n\nThat’s just me, though.\n\n"
    },
    {
      "time": " 19.May.2007 5.22pm",
      "content": "ya,\n\nAt the end of it all I just couldn’t convince myself to go through logoloft. Looks like I’ll just pull a few long days. :)\n\n"
    },
    {
      "time": " 20.May.2007 5.07am",
      "content": "Chet,  \nI think you’ve made the right decision. Doing the job yourself well will strenghten your position with your client, and they’ll be likely to use your services in the future, too.\n\n"
    },
    {
      "time": " 19.Jun.2008 8.14am",
      "content": "Thought I would point out an incorrect post regarding the “Microsoft” customer on The LogoLoft. If you actually read the page you will find that Microsoft is actually the client. Microsoft came to The LogoLoft to have them develop a logo for their GamesIT (technical department for the Xbox). It isnt for a “game” or anything related to a game. It is for their IT department. William, before you blame someone for misrepresentation, you should actually read the page and know what you are talking about. I personally received a great logo from The LogoLoft and felt that I should signup and post this so their isnt any confusion.\n\n"
    },
    {
      "time": " 19.Jun.2008 10.23am",
      "content": "David, I tried to conscientiously report on what I read a year ago. I don’t see the link any longer, so I can’t go back and check to see if I made an error. I would be very distressed if I gave someone a bum rap here, and will apologize. But first I want to see the evidence that I made an error a year ago.\n\nCan you give us the links at Logoloft and directly to the Microsoft department, with the logo?\n\nPerhaps Si Daniels at Microsoft can confirm whether they actually used LogoLoft for this “GamesIT” department of XBox.\n\nWhen I do a search for GamesIT at Microsoft.com, I come up with nothing.\n\nAlso your anonymity undermines your credibility here on Typophile.\n\nI would be happy to clear this up one way or the other, but which way is not clear to me at this point.\n\n"
    },
    {
      "time": " 19.Jun.2008 11.26am",
      "content": "I wouldn’t be distressed about giving any of the logo farms a bum rap. ;o)\n\n"
    },
    {
      "time": " 19.Jun.2008 1.10pm",
      "content": "Logo farm???\n\nI’m liking the idea a lot right now... Fresh air... Bib overalls... You get to drive a tractor...\n\n-=®=-\n\n"
    },
    {
      "time": " 19.Jun.2008 1.11pm",
      "content": "-=®=-\n\n"
    }
  ]
}
