{
  "id": "33756",
  "title": "twenty-six soldiers of lead",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello typophiles.\n\nI was struck by the phrase \"marshalling your twenty-six soldiers of lead\" in Vincent Steer's _Printing Design & Layout_. Googling it has mostly thrown back the quotation \"With twenty-six soldiers of lead I can conquer the world\" variously attributed to Karl Marx, Anonymous, William Caxton and Benjamin Franklin.\n\nCould anyone here tell me who in fact coined the expression or offer any other details?\n\nThanks.\n\n",
  "author": "woof",
  "time": "13 May 2007 — 3:58pm",
  "uid": "13750",
  "comments": [
    {
      "time": "14 May 2007 — 12:28am",
      "content": "“That dramatic statement is French in origin, and (as they say) of a certain age –&nbsp;which means, here as always, of an uncertain age. Who said it, and when? Was it a village-bound boaster with a sudden and wonderful revelation of the dramatic spirit? Or was it in very truth a conqueror of men’s minds?  \nLet those who know further tell us. Let the birthplace of his aunt, the recollections of his schoolmaster, the intrigues which gave him his start in life, let his habits in face of the bottle (to which he was wont to ascribe so musch of his success or failure), his taste in cigars, or sword-hilts, or politics, or religion – let all be left unknown and ungathered. For whoever he was, however he prospered, he said and he did (I'll be bound) nothing else that could justify the sublime arrogance of that declaration – ‘with twenty-five soldiers of lead I have conquered the world’. Anything more of his were a derogation from that assertion, or a flat denial, or (worst of all) a jest thrown at it –&nbsp;a very profanation of his moment of divinity”\n\nFrancis Meynell, Typography, Pelican Press, 1923\n\nThe number indicates that it is a mid-17th century quote, possibly 1640 (again, according to Meynell). Taken from Typographers on Type edited by Ruari McLean.\n\nTim\n\n"
    },
    {
      "time": "14 May 2007 — 1:28am",
      "content": "Thank you Tim!\n\n"
    },
    {
      "time": "14 May 2007 — 5:09am",
      "content": "That's a brilliant phrase. Thank you for posting it.\n\n"
    },
    {
      "time": "14 May 2007 — 6:25am",
      "content": "Yes - I wonder what the digital-age equivalent would be?\n\n"
    },
    {
      "time": "14 May 2007 — 7:40am",
      "content": "Twenty-six soldiers of vector?\n\n"
    },
    {
      "time": "14 May 2007 — 8:11am",
      "content": "Cannon-fodder of OpenType?\n\nTim\n\n"
    },
    {
      "time": "14 May 2007 — 8:23am",
      "content": "256 unicode ninjas?\n\n"
    },
    {
      "time": "14 May 2007 — 2:47pm",
      "content": "[Mosley](http://web.archive.org/web/20150124155727/http:/typefoundry.blogspot.com/2007/05/with-twenty-five-soldiers-of-lead-he.html) is characteristically thorough on the question.\n\n"
    },
    {
      "time": "14 May 2007 — 4:08pm",
      "content": "Yes indeed. Thanks for the link. Crikey – that's enlightening. The description of the guard of honour for the Monotype Corporation float at the Lord Mayor's Show conjures up quite the Busby Berkeley image.\n\n"
    },
    {
      "time": "15 May 2007 — 6:47am",
      "content": "If you liked \"twenty-six soldiers of lead,\" you'll love this one:\n\nMore powerful than all poetry  \nMore pervasive than all science,  \nMore profound than all philosophy,  \nAre the letters of the alphabet,  \nTwenty-six pillars of strength  \nUpon which our culture rests.\n\nOlof Lagercrantz\n\n"
    },
    {
      "time": "15 May 2007 — 11:50am",
      "content": "In Germany we say:  \n\"Mehr als das Gold hat das Blei die Welt verändert,  \nund mehr als das Blei in der Flinte. das Blei im Setzkasten.\"\n\nMore than gold, lead changed the world,  \nand more than the lead out of a gun the lead of a typestter's case did it.\n\n(sorry for my poor translation).\n\nGeorg\n\n"
    },
    {
      "time": "15 May 2007 — 1:46pm",
      "content": "\"...I am the leaden army that conquers the world. I am type.\"\n\n- Frederic W. Goudy\n\n"
    },
    {
      "time": "15 May 2007 — 2:14pm",
      "content": "Thanks Georg, wonderful quote. I found out by googling that it is from Georg Christoph Lichtenberg, who is apparently not much read outside Germany. I see from a bit of reading about him that he is a fascinating personality--I will have to get a book on him!\n\n"
    }
  ]
}
