{
  "id": "33764",
  "title": "süddeutsche zeitung",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20110616165614im_/http:/typophile.com/files/headline_6250.jpg)\n\nAm I asking too much ?\n\n",
  "author": "<a href=\"/web/20110616165614/http://typophile.com/user/17803\" title=\"View user profile.\">john good</a>",
  "time": "<br>",
  "uid": "17803",
  "comments": [
    {
      "time": "",
      "content": "It is custom made (the ›g‹ is amazing, isn’t it?). I once heard that it was lettered by the architect Prof. Hans Döllgast – but I cannot confirm that.\n\nGreetings  \nFlorian\n\n"
    },
    {
      "time": "",
      "content": "Amazing, yes. contrast is also incredible.\n\n"
    },
    {
      "time": "",
      "content": "But surprisingly readable, no? However, the contrast with Helvetica in the titling of the articles hurts my eyes.\n\n"
    },
    {
      "time": "",
      "content": "_the contrast with Helvetica in the titling of the articles hurts my eyes_\n\nha ha ha ! yes make them bleed !\n\n"
    },
    {
      "time": "",
      "content": "Does it look so strange for your eyes?  \nSüddeutsche Zeitung is one of the most serious newspapers in Germany.  \nFirst edition started on 6th of October 1945, the first newspaper license given by the US Military Government in Germany after conquer of Germany.\n\nI like the layout:  \n [http://epaper.sueddeutsche.de/digiPaper/html/start.html](http://web.archive.org/web/20110616165614/http:/epaper.sueddeutsche.de/digiPaper/html/start.html \"http://epaper.sueddeutsche.de/digiPaper/html/start.html\")\n\nGeorg\n\n"
    },
    {
      "time": "",
      "content": "Georg, Sie auch hier! – The »Süddeutsche« ist an excellent newspaper, no doubt about that (though I prefer the »Neue Zürcher Zeitung«…). I like the masthead very much and I’m in love with that ›g‹ – but no, those Helvetica titles are not my cup of tea.\n\nGreetings  \nFlorian\n\n"
    },
    {
      "time": "",
      "content": "Georg, Du auch hier! – The »Süddeutsche« ist an excellent newspaper, no doubt about that (though I prefer the »Neue Zürcher Zeitung«…). I like the masthead very much and I’m in love with that ›g‹ – but no, those Helvetica titles are not my cup of tea.\n\nGreetings  \nFlorian\n\n"
    },
    {
      "time": "",
      "content": "@ Florian  \nPreußen is everywhere where its flagg is blowing in the wind - strong and free.\n\nEvery successful newspaper in the world has its own strong face, controlled by its layouters. I found this striktly rules everywhere in Europe and US, too. E.g. the Sun in London has its own girlie macro for page 3. (I know it, 'cause I wrote the first version of it in 1986(?) being part of \"No Stopping - Wapping\", when Mr. Murdoch broke the big fleet street strike together with 70 Kodak newspaper spezialists :-)\n\nA change of a layout or only a font is a major thing. They discuss it for months before changes will appear. And what ever they change: Lots of readers of the paper will give protest. They want their paper like it was before.\n\nSo - to write \"The Helvetica headlines hurt my eyes\" is not enough for a discussion about a newspaper's layout bible.\n\nGeorg\n\n"
    },
    {
      "time": "",
      "content": "Georg, you’re missing the point: There might be hundreds of experts involved in, say, the design of a car – and I might still not like it (but my neighbour does). So in a harmless chat like that it’s perfectly ok to express one’s taste.  \nBesides, you needn’t teach my about newspaper layouts – I’m working in this business.\n\nGreetings  \nFlorianG\n\n"
    },
    {
      "time": "",
      "content": "I remember the Süddeutsche Zeitung's masthead from when I studied in Stuttgart. I had a friend that loved that 'g' and used to refer to it as \"the g that looks like a baby\". I'm still not sure what makes that 'g' resemble a baby, but I have admit that she's right.\n\nIn terms of design I've always preferred the [Stuttgarter Zeitung](http://web.archive.org/web/20110616165614/http:/www.stuttgarter-zeitung.de/). It's one of the few that uses [Unger's](http://web.archive.org/web/20110616165614/http:/typophile.com/wiki/Gerard%20Unger) [Gulliver](http://web.archive.org/web/20110616165614/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns14.html).\n\n"
    },
    {
      "time": "",
      "content": "Florian,  \neverybody in the world might have another opinion in relationship to his personal taste. That's not the question. But nevertheless its senseful to think about the reasons for a decision like this Süddeutsche layout.\n\nWhat I said is:  \nIts not enough to say \"My personal taste tells me: \"These Helvetica headlines hurt my eyes.\" Not in a semi-pro or pro forum. Otherwise it would be the same level than a whatever-do-I-want-to-do-next-weekend-forum.\n\nAnd I did not want to tell you how newspaper layout works, Florian. I tried to start a small and senseless smalltalk about the newspaper business, where I am coming from and which I love. That's all.\n\nGeorg\n\n"
    },
    {
      "time": "",
      "content": "_I’m still not sure what makes that ‘g’ resemble a baby, but I have admit that she’s right._\n\nBecause it has a big head and little body. :^)\n\n"
    },
    {
      "time": "",
      "content": "<cite>I’m still not sure what makes that ‘g’ resemble a baby, but I have admit that she’s right.</cite>\n\nBecause it has a tail and one ear.\n\nOr perhaps the loop looks umbilical to some. I think Herb Lubalin did this one with an [ampersand and an O](http://web.archive.org/web/20110616165614/http:/38one.com/logos/mother.jpg). I also have a colorful friend who always refers to open-loop g's as \"sperm-and-egg\" g's.\n\n"
    },
    {
      "time": "",
      "content": "Aw, not the 'mother' logo again... ;)\n\n"
    }
  ]
}
