{
  "id": "33765",
  "title": "Help needed. Fonts to match Engravers Lt",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm a little stuck. My client has chosen \"Engravers Lt\" for a logotype for a restaurant that we're working on. Not a choice I would've made, but since it was one of the suggestions I gave, I'd be happy to roll with it and work with it.\n\nThe look we're going for is classy (where have you heard that one before), contemporary, but not too formal, stuffy or otherwise fuddy duddy.\n\nNow I need to find a matching \"text\" face to go with it. He has a preference for serif faces, but I'm open to both. I have suggested Neutraface to contrast with Engravers and to give the identity a modern edge.\n\nI am looking for something that is  \n-slightly broad (like engravers),  \n- something with both old style and lining figures and also  \n- small caps. IS that too much to ask?\n\nI have tried Goudy Old Style, Mrs Eaves, Adobe Caslon. But it seems like none of them are working very well. Mrs Eaves small caps is ok but the rest of it looks too \"pretty\" for this quite androgynous or even \"masculine\" look we have going.\n\nOn the bright side, we're not really setting prose, so it does not need to be \\*too\\* readable. Just namecards and menus.\n\nAny suggestions at all would be welcome.\n\nThanks!\n\n",
  "author": "karenhuang",
  "time": "14 May 2007 — 12:16am",
  "uid": "7022",
  "comments": [
    {
      "time": "14 May 2007 — 12:26am",
      "content": "Hi Karen. The first thing that comes to mind if you want a text match for [Engravers LT](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/singles/linotype/engravers_lt_std_bold_face_ot/) is [Luxury Text](http://web.archive.org/web/20140615145225/http:/www.houseind.com/index.php?page=showfont&id=536&subpage=viewfonts).\n\nOtherwise:  \n [Corporate A](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/urw/corporate_a/)  \n [FF Clifford](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/fontfont/ff_clifford/)  \n [Gianotten](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/linotype/linotype_gianotten_virtual/)  \n [Centennial](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/linotype/linotype_centennial_virtual/)  \n [Swift](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/search/?q=swift)  \n [FF Absara](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/fontfont/ff_absara/)  \n [FF Acanthus Text](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/fontfont/ff_acanthus_text/)  \n [Miller](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/font_bureau/miller_1_text/) - hybrid figures  \n [ITC Modern No. 216](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/itc/itc_modern_no_216/) - no small caps or OSF  \n [Escrow Text](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/font_bureau/escrow_text/) - no small caps or OSF\n\nSome of these are not what I would call \"contemporary\", but that term is a far cry from Engravers, so I went with the best fit for the type you are working with. Scotch romans, text didones, sharp serifs, and a few contemporary faces that share characteristics of those.\n\n"
    },
    {
      "time": "14 May 2007 — 1:13am",
      "content": "Hi Steph,  \nThanks for your suggestions!\n\n\\> Some of these are not what I would call “contemporary”, but that term is a far cry from Engravers,\n\nExactly what I told the client. \"Contemporary\" is not equals to what he chose. But I supposed ever since the genre got mixed up with luxury goods, it became somewhat associated with being modern, classy and \"contemporary\".\n\nSo now, I'm taking a step back and trying to see through his eyes. How something like \"Engravers\" is contemporary, and how to use it as if it was \"modern\" and \"contemporary\".\n\nActually, I made a mistake, he chose AT Sackers.\n\nI first looked at Luxury, and I really liked Diamond, etc, so I chose a poor man's version — engravers and gave Sackers as an option.\n\nThe client liked the funky \"C\" in Sackers. I have MAJOR MAJOR problems with the Sackers \"R\". And also the contrast. It's not nearly as high contrast as engravers, which I kinda prefer. But the serifs in Engravers, I find too pronounced.\n\nSo now I know what exactly we're paying for when you dish out $$$ for Luxury.\n\nBut first, I'll check out all your suggestions!!!\n\n"
    },
    {
      "time": "14 May 2007 — 1:31am",
      "content": "[Walbaum](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/linotype/walbaum_virtual/)  \n [Stancia](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/search/?q=stancia). An elegant option that I never paid any mind until now. No SC or OSF, though.\n\n"
    },
    {
      "time": "14 May 2007 — 9:30am",
      "content": "Meridien?  \n [http://www.myfonts.com/fonts/linotype/meridien/](http://web.archive.org/web/20140615145225/http:/www.myfonts.com/fonts/linotype/meridien/ \"http://www.myfonts.com/fonts/linotype/meridien/\")\n\nAs Carter says, it has a certain timeless grace. The x-height is a  \nlittle big though. And the \"f\" needs fixing (sorry, Chris Costello).\n\n\\> I have MAJOR MAJOR problems with the Sackers “R”.\n\nWould the client pay to have it changed?  \nIf so, let me know.\n\nhhp\n\n"
    },
    {
      "time": "14 May 2007 — 11:03am",
      "content": "One that might fit your width requirement: [URW Antiqua Wide](http://web.archive.org/web/20140615145225/http:/www.fontshop.com/fonts/downloads/urw/urw_antiqua_wide/)\n\n"
    },
    {
      "time": "14 May 2007 — 11:21pm",
      "content": "Thanks guys. I'm trying out the fonts now.\n\nWould Farnham work with this?\n\nHey Hrant, there won't be any budget to fix anything professionally. If there were, it would be nice to get it redrawn. I'll have to think of a low-cost way to fix it.\n\n"
    },
    {
      "time": "15 May 2007 — 6:39am",
      "content": "Actually, I owe you one (at least one!) and the thing <cite>is</cite> pretty horrid so I'd be doing society a favor too :-) so please get in touch and I'll take care of it.\n\nhhp\n\n"
    }
  ]
}
