{
  "id": "33774",
  "title": "Help...",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi!  \nI have chosen a font for my logotype (on my website) which apparently isn’t that common and I’ve been told that it has to be “converted” into an image in Photoshop or else one won’t be able to see it in most computers. (?!) Is this true and how do I go about doing that? This might be completely obvious to most people but I am new to this so I don’t have a clue. :-)\n\nCharlotta\n\n [‹ Help me pick the right on.. (letter paper)](http://web.archive.org/web/20080821140339/http:/www.typophile.com/node/33644 \"Go to previous forum topic\") [Crit my logo (sort of a joke) ›](http://web.archive.org/web/20080821140339/http:/www.typophile.com/node/33441 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821140339/http://www.typophile.com/user/17880\" title=\"View user profile.\">Charlotta</a>",
  "time": "<br>",
  "uid": "17880",
  "comments": [
    {
      "time": " 14.May.2007 6.53am",
      "content": "Yes, unfortunately only a handful of typefaces are common across mac and pc systems. If you’re looking for something outside of verdana, arial, etc. you’ll need to make it a gif or jpeg.\n\nYou could also try something like [sIFR](http://web.archive.org/web/20080821140339/http:/www.mikeindustries.com/sifr/)\n\n"
    },
    {
      "time": " 14.May.2007 7.00am",
      "content": "The web is more about suggesting than dictating. You can suggest fonts, and if the end-user has them installed, that’s what they’ll see, but if they don’t, they won’t necessarily see the same font you see.\n\nSo, yea, if you want to be absolutely sure that your font is seen by the end user, you either need to make it an image or use flash.\n\n"
    },
    {
      "time": " 14.May.2007 7.40am",
      "content": "This list should help a little: [http://www.ampsoft.net/webdesign-l/WindowsMacFonts.html](http://web.archive.org/web/20080821140339/http:/www.ampsoft.net/webdesign-l/WindowsMacFonts.html \"http://www.ampsoft.net/webdesign-l/WindowsMacFonts.html\")\n\nIt might help you find a font that’s common to both PC and MAC Systems.\n\n"
    },
    {
      "time": " 14.May.2007 7.56am",
      "content": "Charlotta,\n\nTo “convert” text into an image in Photoshop, simply make an image of the text as you want it, and then “Save for web”. This usually works best as a .GIF image. Then, in your web design, replace the text with your new image. This works best when replacing Headings, etc, rather than blocks of text - it also makes the text you replace unreadable for screen readers and search engines (since it’s now an image).\n\nA more advanced technique is to create your text as an image, but also place the text in your website with HTML, and style it using CSS, then substitute the image for the text. This allows greater accessibility for search engines and screen readers.\n\n"
    },
    {
      "time": " 14.May.2007 8.53am",
      "content": "Thank you for all your advice and help! I am a beginner at this so I need a lot of it... Lherrou - I wish I were good enough to try the CSS thing - if it’ll look better in the end - but that might be too advanced for me, like you said.\n\n"
    },
    {
      "time": " 14.May.2007 11.44am",
      "content": "Charlotta,\n\nFirst, take a look at [www.csszengarden.com](http://web.archive.org/web/20080821140339/http:/www.csszengarden.com/ \"www.csszengarden.com\"). This will show you what can be accomplished with this technique (not to mention that it’s a fun site to wander through).\n\nDoing the CSS part is not too difficult, but can be a bit tricky the first time. I’d be happy to help you walk through it.\n\n"
    },
    {
      "time": " 14.May.2007 12.15pm",
      "content": "<cite>Doing the CSS part is not too difficult, but can be a bit tricky the first time. I’d be happy to help you walk through it.</cite>\n\nSmooth Todd, real smooth.\n\n"
    },
    {
      "time": " 14.May.2007 5.16pm",
      "content": "Err, thanks Andrew, but perhaps what motivates you is not what motivates me?\n\n"
    },
    {
      "time": " 15.May.2007 3.17am",
      "content": "Thank you - Todd - for the kind offer to help me. I don’t question your motives. :-) But just so you know, at this point I have no knowledge at all about what CSS is - do you still think I can do it?\n\n"
    },
    {
      "time": " 15.May.2007 7.31am",
      "content": "I made up a quick demo for you (and any others): [http://www.electronic-village.com/typophile/](http://web.archive.org/web/20080821140339/http:/www.electronic-village.com/typophile/ \"http://www.electronic-village.com/typophile/\")\n\nPlease ask if you have any questions.\n\nThank you to [exljbris](http://web.archive.org/web/20080821140339/http:/www.josbuivenga.demon.nl/) for making Fontin free.\n\n"
    }
  ]
}
