{
  "id": "33777",
  "title": "Ceiling Logo Help Please: an exercise in branding the undefined",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello, I am currently trying to create a logo for a construction company, but the name is so vague that I cannot think of any mark that is suitable. I have done all the conceptual work - mind mapping, sketching, word association, image searching, etc - but still cannot think of anything suitable.\n\nI think it may be partially because I am creating the logo for my father's business (note: I am a design student currently completing my Des BA) and thus I am too close to it, so now I ask you all for help with coming up with a suitable idea. It has been quite a challenge for me (frustratingly so as usually these things are not so difficult for me) so I hope you all can provide some insight be it a word, an image, a concept, a typeface, whatever you can provide.\n\nI really appreciate any help anyone could provide.\n\nThe company name is: Ceilings and More (note: the word \"and\" is spelled, not \"&\", and he is very adamant about that).\n\nThanks again everyone, I hope to be posting later with some critique of some kind of logo!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAPPENDED: attached is a digital sketch of one of my concepts. Any feedback would be greatly appreciated. Feel free to rip it and be as honest as possible too, I am not attached to it: it is just some of my work, it's not me!\n\n ![](http://web.archive.org/web/20140527214531im_/http:/typophile.com/files/ceilings_4963.jpg)\n\n",
  "author": "cmcd",
  "time": "14 May 2007 — 8:20am",
  "uid": "17134",
  "comments": [
    {
      "time": "14 May 2007 — 9:15am",
      "content": "I'm curious, why is he adamant about the \"and\"?  \nDid a large ampersand once fall on him during a construction project?\n\nAnyway, here's an idea: instead of having the letters  \nsit on a baseline have them \"hang\" from the cap height.\n\nhhp\n\n"
    },
    {
      "time": "14 May 2007 — 9:30am",
      "content": "Thanks for the idea. I'll see what I can do with that to start.\n\nHe's adamant about it because he says \"it is the company name (without the ampersand)\". He's very old fashioned/traditional.\n\n"
    },
    {
      "time": "14 May 2007 — 9:36am",
      "content": "Well, if people are already familiar with the \"and\" spelling  \nand business isn't suffering from seeming old-fashioned,  \nthen there's no reason to change to an ampersand.\n\nhhp\n\n"
    },
    {
      "time": "14 May 2007 — 10:21am",
      "content": "i think it's probably been said here on typophile boards before, but i'll say it again - one can not be a design student or professional and not be able to come up with ANY suitable ideas.\n\ngenerating ideas and figuring out how to properly execute them is the essence of what you do. it would be more helpful if you showed some work, concepts, sketches - whatever it is - and asked for feedback.\n\njarrod\n\n"
    },
    {
      "time": "14 May 2007 — 12:22pm",
      "content": "Do people tend to shop for ceilings? That seems like a very odd specialty.\n\nWhat is the 'and more' specifically cover?\n\n"
    },
    {
      "time": "14 May 2007 — 12:29pm",
      "content": "That's the whole probelm with the name (a name I protest to this very day): it's too vague. He is basically a woodworker/construction man, but ceilings are his specialty and the core of his business.\n\nIt is odd, I know, something you don't really think about, but a ceiling is something that nearly every place has, don't believe me, just look up over the course of a day!\n\n"
    },
    {
      "time": "14 May 2007 — 12:35pm",
      "content": "APPENDED: attached is a digital sketch of one of my concepts. Any feedback would be greatly appreciated. Feel free to rip it and be as honest as possible too, I am not attached to it: it is just some of my work, it’s not me!\n\n ![](http://web.archive.org/web/20140527214531im_/http:/typophile.com/files/ceilings_4247.jpg)\n\n"
    },
    {
      "time": "14 May 2007 — 1:03pm",
      "content": "Do you need to use all uppercase on the \"and more\"... maybe it's my time spent on the net, but uppercase tends to SCREAM too much for my taste -- especially when it's only used on \"half\" a logo.\n\nOverall, I wonder if the face (this is Galliard, yes?) is a little too \"middle-of-the-road\"... it has some nice curves, but it's also kind of angular. The squared-off dot in the \"i\"s would stand out more in a more organic, curved face. Maybe even Galliard Italic? On the other hand, a more modern/geometric/tech face would likely convey the \"industrial\" quality of the company (if, indeed, it is more of a B-to-B rather than consumer enterprise).\n\nThe overall letter spacing seems a bit open too, though I tend to subscribe to the \"tight but not touching\" school when it comes to logos and headlines.\n\nI kinda like the mark/dingbat, but it \\_is\\_ pretty generic. Maybe the ornate panel would work better \\_inside\\_ the box rather than outside, as you are selling ceilings, not exterior walls.\n\nI just keep thinking about how you could convey \"above-ness\" or \"overhead-ness\" in a design. Try to think of how others do it, like Travellers insurance (they've \"got you covered\" with an unbrella), or maybe look at roofing company logos. Don't steal, just get inspired. I keep (mentally) coming back to the ceiling of the Sistine chapel for some reason... the \"ultimate\" ceiling i suppose.\n\n"
    },
    {
      "time": "14 May 2007 — 2:50pm",
      "content": "Nice critique, Scott.\n\n"
    },
    {
      "time": "14 May 2007 — 3:31pm",
      "content": "However, the face is Minion, not Galliard.\n\n"
    },
    {
      "time": "14 May 2007 — 3:36pm",
      "content": "Thank you so much for the crit. It seems, as I figured, that I've gone too literal again. It's a usual part of my process when I get stuck. I think I'll have to revisit the essence of what I am trying to achieve with this mark. I appreciate the feedback.\n\nAnd he's right, it is Minion.\n\n"
    },
    {
      "time": "14 May 2007 — 8:39pm",
      "content": "My first impression of the logo was that it'd be for an office supply company.\n\nIt seems unfitting to use a serif font for a construction company. Construction is mainly about robustness, not delicateness. Plus, the delicate aspect is already sufficiently represented by the ornamental symbol on the left. Therefore, a sans serif font should be more suitable here -- a tall and narrow one, if you want the text to have some elegancy and less massiveness.\n\nAlso, the two colors used are both a bit pale, which does not only enforces the \"more delicate than robust\" impression, but also could be problematic if the logo is used in single color situations. Have you thought about how a greyscale version is supposed to look like?\n\n"
    },
    {
      "time": "15 May 2007 — 5:29am",
      "content": "Collin, here's my wandering thoughts on the subject...\n\nIt's a crap name and one of those banal and cheesey business naming conventions of the 1980's like World of Chairs, Worktops 'r' Us, Ovens Etc, Supadoors.\n\nBut it does have a quality you could play with. Think of it as two surnames and it sounds a bit like a business partnership from the 1800's possibly founded by Dr Samuel Ceilings and the Reverand Quentin More to promote, as they might have put it \"the edification of interior heavens\".\n\nCombine that with your father being \"very old fashioned/traditional\" and that he's probably been in the business for a good number of years now and you have a possible solution...\n\n...design it in the style of shop and truck signage from, say the 1880's to 1900, or any classic period.\n\nMake it a period study or revisionist exercise or parody or whatever by looking at font's and ornate embelishments / flourishes / devices from a particular era.\n\nHere's just one reference I found quickly... [http://www.signmuseum.com/](http://web.archive.org/web/20140527214531/http:/www.signmuseum.com/ \"http://www.signmuseum.com/\")\n\nMaybe have the name in all capitals with a ceiling rose style graphic\\* between them for symmetry...\n\nCEILINGS \\* AND MORE\n\nYou could go with deep bold colours with strong contrast or blended natural tones and textures. Maybe even incorporate a \"SINCE 1978\" style phrase.\n\nBTW Does Ceilings need to be plural? Flooring tends not to be pluralised. Too late to change it I guess?\n\n"
    },
    {
      "time": "15 May 2007 — 8:41am",
      "content": "Wow, thank you all for the replies, I am continually blown away by the typographic/design community I am becoming a part of. It is absollutely wonderful that you all took the time to comment, and so thoroughly too. Thank you all from the bottom of my heart.\n\nJon, I laughed at that \"More\" and \"Ceilings\" comment, but you know, it actually makes sense. And I think taking a more reverential approach may work well.\n\nAgain, thank you all, everything said here has gone into the hopper and is going to result in something much better than this initial sketch.\n\n"
    },
    {
      "time": "15 May 2007 — 3:12pm",
      "content": "with a business name like this, maybe you should use a starburst (joke) ;)\n\nwhat about a glass ceiling ... endless opportunities (which covers the 'and more' too).\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20140527214531/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "15 May 2007 — 4:45pm",
      "content": "Ya know, you're in a tough spot. It's just a really bad name for a company. It has zero personality and is like naming a chain of grocery stores 'Food and more'.\n\nAny chance you can talk him into using 'Ceilings and more' as the tagline and go with a more logical company name? Even if it's something as generic as 'Smith Fine Woodworking' or the like.\n\nIf you must stick with the name, what about using a perspective plane representing the ceiling and an iconic rendering of your dad holding it up ala Atlas? (just throwing out ideas...)\n\n"
    },
    {
      "time": "16 May 2007 — 1:39am",
      "content": "You might get ideas for a logo from looking at houses being built. There are some nice patterns in the rafters that might make an interesting logo. I find that most construction company names in my area are rather bland. I wouldn't worry about it.\n\nSharon\n\n"
    },
    {
      "time": "17 May 2007 — 11:35am",
      "content": "I keep thinking about a circular logo for this for some reason, and I think mainly because of ceiling medallions. I think the more traditional look (like woodworm said) could be the way to go, maybe incorporating a ceiling medallion. If anything I hope this sparks more creative juices.\n\n"
    },
    {
      "time": "17 May 2007 — 7:49pm",
      "content": "I should add that in contrary to what seems to be the consensus here, I don't think the name \"Ceilings and More\" is that bad. It certainly isn't something that can't be worked with.\n\nPlus, naming is a marketing skill, and this is a design forum, so the people here are probably no expert in that area anyway...\n\n"
    },
    {
      "time": "18 May 2007 — 9:12pm",
      "content": "Stylize a sophisticated/clean length of crown molding - and set the word 'Ceilings' upon it. Allow the 'g' to descender below the top line of the crown molding.\n\nUnderneath the length of crown molding set an ampersand and the word 'more'.\n\nThe ampersand will associate with the 'g' descender', thus giving the composition a wholeness, a completivity (new word!), unity.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    }
  ]
}
