{
  "id": "33786",
  "title": "(x) Need typesetting services urgently",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I need a simple typesetting job in [Quicksilver](http://web.archive.org/web/20081007161637/http:/typophile.com/node/3030) for a slide of my presentation Saturday at [Typo Berlin](http://web.archive.org/web/20081007161637/http:/www.typoberlin.de/index.php/Stephen+Coles;107/1). Can anyone who can help me please contact me through my profile? Thank you very much.\n\n [‹ 2 typefaces from Arthur magazine](http://web.archive.org/web/20081007161637/http:/www.typophile.com/node/46470 \"Go to previous forum topic\") [italic garamond-ish? ›](http://web.archive.org/web/20081007161637/http:/www.typophile.com/node/46479 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007161637/http://www.typophile.com/user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": "<br>",
  "uid": "110",
  "comments": [
    {
      "time": " 14.May.2007 3.29pm",
      "content": "If you are in a hurry, Yves, take [Neon lights](http://web.archive.org/web/20081007161637/http:/www.dafont.com/neon-lights.font) …\n\n"
    },
    {
      "time": " 14.May.2007 3.50pm",
      "content": "OK thanks Rainer.\n\nI’m not a big fan of this, but as it simply is to demonstrate something — not actually use it for a design — I guess I’ll be able to look myself in the mirror tomorow. ;^)\n\n"
    },
    {
      "time": " 14.May.2007 4.21pm",
      "content": "Yah, I know. But is there an _original_ Quicksilver digital out there? Unfortunately the link in the above thread leads to nowhere. And is the Neon Lights-font a knock-off? Or a revival? Who knows? Not me.\n\nPS:  \n– »It also appears that Letraset’s Quicksilver is only available in the form of crummy unauthorized free fonts.« [Mark Simonson](http://web.archive.org/web/20081007161637/http:/typophile.com/node/2807).  \n– »Yup, an unfortunate fate for quite a few typefaces it seems...« Bald Condensed (ibid)\n\nCase closed. Case closed?\n\n"
    },
    {
      "time": " 14.May.2007 5.09pm",
      "content": "Yeah I guess so. You are right on all counts. BTW The digitisation of Neon2 is kinda crummy, so I don’t think it’s an authorised digitisation. ;^)\n\n"
    },
    {
      "time": " 14.May.2007 5.10pm",
      "content": "BTW The spoof album cover with the font worked out great. I’ll show it to you after Typo Berlin. Will you be there?\n\n"
    },
    {
      "time": " 15.May.2007 12.29am",
      "content": "Great, you are very welcome, of course.  \nSorry; I will not be there. Alas. But would like to see your presentation.\n\nAnd, you know, Jürgen Siebert is rolling the [advertising drums](http://web.archive.org/web/20081007161637/http:/www.fontblog.de/opentype-das-schweizer-messer-unter-den-fonts) every day. ;^)\n\n"
    },
    {
      "time": " 15.May.2007 12.49am",
      "content": "Oy, he’s advertising our presentation! The pressure, the pressure...\n\n"
    },
    {
      "time": " 15.May.2007 1.14am",
      "content": "Hahaha, good luck.  \nI KNOW you two will make it wonderful.\n\n"
    },
    {
      "time": " 15.May.2007 8.39am",
      "content": "_The digitisation of Neon2 is kinda crummy, so I don’t think it’s an authorised digitisation_\n\nThere are many fonts which have been digitized that are crappy versions. Sadly. I don’t think having authorization to do so guarantees a good version.\n\n"
    },
    {
      "time": " 29.May.2007 5.37pm",
      "content": "FYI—  \n [Dean Morris](http://web.archive.org/web/20081007161637/http:/www.typophile.com/wiki/Dean%252BMorris), the designer of the one and only true original Quicksilver, just posted the [**full story**](http://web.archive.org/web/20081007161637/http:/www.desktoppublishingforum.com/bb/showthread.php?p=45759#poststop) (at another forum where I ocassionally ID faces) behind his designing the typeface, Letraset and the laments of poor rip-offs.  \nMaybe we can entice him here!\n\nWith his permission, I am able to “_pass along this modest piece of graphic microhistory._”\n\n**\\*\\*\\*THE STORY OF LETRASET’S QUICKSILVER TYPEFACE\\*\\*\\***\n\nI’m Dean Morris, the designer of the typeface “Quicksilver” that came out in 1976 as part of Letraset’s Letragraphica range of rub-down fonts, the stylishly aggeressive ones in the yellow pages of the catalog.\n\nI named the typeface “Quicksliver” because it looked like bent thermometers — quicksilver being a nickname for mercury (I never meant it to suggest neon), and because “Quicksilver” had some of the cooler letters such as Q, K, E, and R. The name was my second choice, however. Letraset Englishly felt that my first choice,  \n“Polished Sausage”, would be “rather unpopular in foreign markets”.\n\nI designed it as a 16 year-old kid in John Glenn High School in Bay City, Michigan, and sent Letraset a xerox of a tight sketch of 3” letters kerned with the heavy outlines slightly overlapping as I originally intended. I drew only the skinny S without an alternate and submitted no punctuation (what did I know?).\n\nLetraset must have wanted it real fast (disco was WHITE HOT then, remember), because they did the finished art themselves at 5” high (they can’t have known my age, maybe they had no confidence in my technical talent), starting with the E as did I in the design stage. And what a gorgeous rendering job they did in the pre-Mac days of ruling pens, straightedges, and handdrawn curves (those aren’t compass curves)!\n\nLetraset stayed very close to my tight sketch, designed the punctuation, and suggested an alternate but weird wide S, which I approved, figuring there was probably no other decent way to design it. I imagined the punctuation would match the stroke width of the letters but they drew them narrower and slightly oddly, but I figured what the hell.\n\nIf you wondered, “What was I thinking?” when you looked at the A, B, E, F, K, N, Q, R, and Y, I’ll tell you. I was simply trying to describe part of the letter being drawn in the wrong direction. I thought I was so clever. For instance the E cross-stroke goes from right to left rather than from left to right like, oh, any other Roman cap E in history. R and Q diagonals came from waaaaaaaay on the other side, N goes waaaaaaay around the wrong way before starting the diagonal. “Chrome” letters can branch but these “glass tube” letters don’t!\n\nAlas, digitization came along eventually and Fontographer technology followed. Crash went sales of rub-down type, and control of artwork was pirated without my knowledge and beyond my control, which I don’t condone but I totally understand.\n\nThe first album cover I saw with Quicksilver was Men At Work’s first smash LP, then punk pioneer Stiff Records’ logo appeared on 45 rpm labels with a clearly Quicksliver-inspired F. For about ten years I, family, and friends collected food packages, posters, took photos of signs, etc. with Quicksliver from around the world. I think it’s about the easiest typeface to mishandle ever. Eventually I stopped trying to keep track of it.\n\nMaybe I’m overestimating its popularity now after 30 years (I totally forgot about it for about a decade), but to me seeing it around at all is itself a rave. I can’t remember why I Googled “Quicksilver Letraset” a few days ago and what I found was a whole community of sites for font identification and original name lists (where they bothered to accurately credit me as designer which gets me RIGHT HERE). It makes me feel less forgotten even though I don’t see royalties.\n\nBTW, I never did, nor did Letraset ask me to, design a lower case version. Feel free to pass along this modest piece of graphic microhistory to any Letraheads.\n\nDean Morris, May 2007, New York City.\n\n"
    },
    {
      "time": " 30.May.2007 12.31am",
      "content": "Dean visited us as well, Norbert. ;^)\n\n[Here](http://web.archive.org/web/20081007161637/http:/typophile.com/node/20222) and [here](http://web.archive.org/web/20081007161637/http:/typophile.com/node/12498), plus a mention of the MyFonts thread [here](http://web.archive.org/web/20081007161637/http:/typophile.com/node/2807).\n\n"
    },
    {
      "time": " 30.May.2007 8.16am",
      "content": "Sorry... that’s what happens when one becomes an _infrequenter_.\n\n"
    },
    {
      "time": " 30.May.2007 8.23am",
      "content": "Yeah, where _were_ you!? :^D\n\n"
    },
    {
      "time": " 11.Jun.2008 8.34am",
      "content": "i’m putting my quicksilver paraphenalia onto flicker. this is a start and i have are more examples to scan and post...\n\n[http://www.flickr.com/photos/27088565@N07/sets/72157605297772027/](http://web.archive.org/web/20081007161637/http:/www.flickr.com/photos/27088565@N07/sets/72157605297772027/ \"http://www.flickr.com/photos/27088565@N07/sets/72157605297772027/\")\n\n"
    },
    {
      "time": " 16.Jun.2008 6.20pm",
      "content": "Hey Letraheads! Thanks for your interest in this historic cultural oddity. Quicksilver, the Citroen Deux-cheval of typographic aesthetics, looks lame from any angle. I’ve put together examples that I and others have collected over the years.\n\n[http://www.flickr.com/photos/27088565@N07/sets/](http://web.archive.org/web/20081007161637/http:/www.flickr.com/photos/27088565@N07/sets/ \"http://www.flickr.com/photos/27088565@N07/sets/\")\n\n"
    }
  ]
}
