{
  "id": "33797",
  "title": "Rawkes Design - Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m new here - so Hi everybody =D\n\nCurrently I’m working on the logo and website for my freelance web design company. The company is called Rawkes - I want to portray youth, strength and a feel of modernism in the logo.\n\nI have come up with some graphical logos, but I will keep them off here. The latest attempt at the logo is purely text based, and I would love some feedback on it.\n\nThe ‘R’ in the logo was designed on paper and traced into a vector application.\n\n[Below is the original design]\n\n ![](http://web.archive.org/files/rawkes_text_4571.jpg)\n\n.\n\n[The version below has some tweaks (..but no styling at the moment)]\n\n ![](http://web.archive.org/files/rawkes_text_take2_6261.jpg)\n\nThank you,  \nRob\n\n",
  "author": "<a href=\"user/18476\" title=\"View user profile.\">Rob Hawkes</a>",
  "time": "<br>",
  "uid": "18476",
  "comments": [
    {
      "time": " 15 May, 2007 - 12:09pm",
      "content": "_\\> I want to portray youth, strength and a feel of modernism in the logo._\n\nWhat do you mean by modernist? is it the [modernist art movement](http://web.archive.org/web/20070520130234/http:/en.wikipedia.org/wiki/Modernism)(which I don’t relate to much to your logo) or “New-Fresh”\n\nWhy don’t you give us a bit more background about this freelance company? What is it that you do? how different could you make it from others? why should I hire you to do some freelance work? Maybe that could help you integrate some new elements to it. Think about metaphors, or anything that could relate to it.\n\nPersonally, I really hate to see the “R” chopped like that, I recently saw it done to another logo that I can’t recall at the moment and it really bothers me. The letter has no balance and looks like its going to fall backwards.\n\nHope that helps to keep you going!\n\nKco\n\n"
    },
    {
      "time": " 15 May, 2007 - 2:57pm",
      "content": "I obviously used modernism in the wrong way - I mean I just want it to look fresh and new, exactly like you said.\n\nHere is a brief background behind Rawkes. It is a web site design company set up by a young creative to build fresh, clean and efficient web sites - in both design and programming. It prides itself on following current web standards and guidelines which let it stand out from the many other ‘web design’ companies that offer quick and dirty websites produced with no skill or affection.\n\nThat’s enough spiel.\n\nI think you are right about the balancing of the R, which is a shame. Luckily I came up with many different R’s in my sketches - so I can try picking another one.\n\nDo you have any advice on the styling of the R, or any metaphors that sprung to mind after hearing about me?\n\nThank you,\n\nRob\n\n"
    },
    {
      "time": " 15 May, 2007 - 3:18pm",
      "content": "a play on the word ROCKS! in ‘leet’ speak i.e, “Web Design Rawkes”\n\non a side note, just for thought … “build fresh, clean and efficient web sites” by “following current web standards and guidelines” - the use of the word ‘fresh’ is destroyed by including ‘following’ - fresh = original and of a kind not seen before.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20070520130234/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": " 15 May, 2007 - 5:06pm",
      "content": "My skills obviously don’t lie in writing. Thanks for pointing that discrepancy out though, I’ll use something other than ‘following’ in the future.\n\nI like the ‘rocks’ idea, it might confuse people with the pronunciation of Rawkes, but it is definitely something to play with - Thank you.\n\n"
    },
    {
      "time": " 15 May, 2007 - 10:22pm",
      "content": "Rob,\n\nI do not doubt that you can build fresh, clean and efficient websites. In fact there’s a ton of talented people out there. There’s also plenty of mediocre design out there. There’s a ton of people that follow web standards too, [here’s one](http://web.archive.org/web/20070520130234/http:/simplebits.com/) that I believe do their job quite as you describe yours. I think you don’t need to let us know your skills (your clients will see that once they see your portfolio. Instead have fun with this, put some extra meaning to it.  \nI like the ROCKS idea too. The name is a clever too, I believe it comes from your name “Rob Hawkes” right? well you got a good start. You have shorten it why not emphasize that? perhaps add an apostrophe then try to find a reason for it. First though, why do you shorten things? maybe because it doesn’t fit somewhere, well now it does! you could play along with concepts/metaphors/stories like that. Perhaps it fits into a box or what not?\n\nAs of the “R” i would say don’t get stuck on trying to fit a special “R”. If the concept recalls it, then do so after you have your Idea clear.\n\nKeep it up!\n\nKco\n\n"
    },
    {
      "time": " 16 May, 2007 - 2:14am",
      "content": "All this advice is very helpful. You were correct about the origins of the word Rawkes, I felt that I would be restricting future growth by naming the company after my full name.\n\nMy one concern with using a phrase (ie. Web design that Rawkes), do you mean to use a phrase as the logo - or just an idea for a banner or strap line? I’m still a little confused about what is being suggested here for the logo in particular.\n\nI’ve only just got up and my brain isn’t quite up to speed, but what do you mean by “Perhaps it fits into a box..”?\n\nThank you.\n\nRob\n\n"
    },
    {
      "time": " 16 May, 2007 - 5:54am",
      "content": "my suggestion was just an idea of a new way of thinking … outside the box (not wanting to confuse you with your ‘fits within a box’ comment.)\n\nAnd just to clarify … my initial thought was “Web Design Rawkes” … without the “that” - it shows a passion and playfulness that simply shines freshness. However you convey that visually is up to you, but it sure opens a few more doors that just saying “Ok, the name is Rawkes, let’s make it [insert ‘fresh’ word here]”\n\ni.e, just brainstorming\n\nenjoy\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20070520130234/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": " 16 May, 2007 - 5:56am",
      "content": "regarding your existing logos … they don’t do much for me.\n\nThe foot of the R should (IMO) definitely sit on the baseline though.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20070520130234/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": " 16 May, 2007 - 11:55am",
      "content": "Don’t lock up on what I said, I was just trowing words. What I meant is that you could find an interesting reason for your name to be shortened. The key element is being said by Paul, \\*BRAINSTORM.\n\n\\*Get all your ideas out, start with your worst (don’t be afraid) and then the good ones will come up. Write words, thoughts, get a [mind map](http://web.archive.org/web/20070520130234/http:/en.wikipedia.org/wiki/Mind_map) going. That would help you squeeze your brain for ideas. At least that’s how I do.\n\nKco\n\n"
    },
    {
      "time": " 18 May, 2007 - 1:22pm",
      "content": "Drop the gradient effect — it looks very cheap. And to get a “modern and fresh” feel, consider thinning down the letters.\n\n"
    }
  ]
}
