{
  "id": "33801",
  "title": "Font-Commerce site",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "[http://www.dtptypes.co.uk](http://web.archive.org/web/20150123084549/http:/www.dtptypes.co.uk/ \"http://www.dtptypes.co.uk\")\n\nNew UK based Font-Commerce site.\n\nIf there are any UK or European based font designers/developers who are interested in a new revenue stream - email [mail@dtptypes.co.uk](mailto:mail@dtptypes.co.uk) for further information.\n\nThis site is OpenType only.\n\n",
  "author": "malcolm",
  "time": "15 May 2007 — 6:42am",
  "uid": "3320",
  "comments": [
    {
      "time": "15 May 2007 — 7:45am",
      "content": "No way to just browse the fonts?\n\nI like the display by letter if you search without entering anything, but it would be nice to have a browse function.\n\n"
    },
    {
      "time": "15 May 2007 — 9:39am",
      "content": "Anything that encourages font development and provides revenue for designers has got be good, but...\n\nThe website is very cold and looks built from a template.\n\nIt's confusing too. What \"high quality font software\"?\n\nWhere's all the lovely the font samples?\n\nThe logo is typographically very poor...\n\n ![](http://web.archive.org/web/20150123084549im_/http:/typophile.com/files/DTPTypesLogo_5210.png)\n\nYour out of date too...\n\n_Copyright © 2006 DTP Types Limited_\n\nSorry to be critical, but there's tough competition out there :)\n\n"
    },
    {
      "time": "15 May 2007 — 11:24am",
      "content": "The DTP Types outfit ( [www.dtptypes.com](http://web.archive.org/web/20150123084549/http:/www.dtptypes.com/ \"www.dtptypes.com\")) sells the usual rip-off fonts under new and old names (e.g. Century Schoolbook DT, Engravers DT, Goudy Old Style DT, Kabel DT, etc.) and is also an outlet for the customary \"inspired by\" knock-off stuff produced by other forgers, cloners, pirates, and plagiarists.\n\n"
    },
    {
      "time": "16 May 2007 — 2:19am",
      "content": "lherrou and wormwood, many thanks for taking your time to look at the web site. It is hoped that the site will develop over time as more designers and developers join the site.\n\nlherrou - how would you like to browse the fonts? You can list the fonts by name or do a more detailed search by keywords. Every font can be tested also.\n\nAll comments are welcome at this stage - be they helpful, rude or sladerous.\n\n"
    },
    {
      "time": "16 May 2007 — 8:36am",
      "content": "\"sladerous\"\n\n ![](http://web.archive.org/web/20150123084549im_/http:/typophile.com/files/thumbnail_3431.jpg)\n\n"
    },
    {
      "time": "17 May 2007 — 10:32am",
      "content": "I recognize these designs by their original names. Slightly manipulating Times Roman, Optima, Icone, Franklin Gothic, Sabon, Tekton, does not make them new or original. Many of the designs are identical to the originals they're derived from. Your client base, and any designers who might want to join you, are going to be limited by that.\n\nThere is a wide, wide difference between what is strictly legal, and what is ethical.\n\n"
    },
    {
      "time": "17 May 2007 — 10:52am",
      "content": "Thanks, Mr. Crossgrove!\n\nAt last, there is someone at Typophile who has the courage to say the truth.\n\n"
    }
  ]
}
