{
  "id": "33800",
  "title": "choice of type-advice needed",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I am designing packaging for chocolates and I want to get the message across as them having a luxury feel to them. They are aimed at women, maybe over 25 who want to relax and enjoy eating these luxurious chocolates. I would like feedback on the choice of typeface I have chose but not sure which one works the best. Please feel free to give feedback.\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 557.png](http://web.archive.org/web/20121102080622/http:/typophile.com/files/Picture%20557.png) | 20.92 KB |\n| [easter egg type.png](http://web.archive.org/web/20121102080622/http:/typophile.com/files/easter%20egg%20type.png) | 26.98 KB |\n| [Picture 558.png](http://web.archive.org/web/20121102080622/http:/typophile.com/files/Picture%20558.png) | 10.58 KB |\n| [Picture 560.png](http://web.archive.org/web/20121102080622/http:/typophile.com/files/Picture%20560.png) | 9.95 KB |\n\n",
  "author": "missgiggles",
  "time": "15 May 2007 — 6:33am",
  "uid": "14600",
  "comments": [
    {
      "time": "15 May 2007 — 6:39am",
      "content": "Fourth down on the \"easter egg\" image. Cursive seems the way to go to me, and that option isn't crazily nuptual-looking.\n\n"
    },
    {
      "time": "15 May 2007 — 6:51am",
      "content": "I agree with Eric.\n\nBTW, the colors are super, but I'd get rid of \"about\".\n\nhhp\n\n"
    },
    {
      "time": "15 May 2007 — 7:20am",
      "content": "Thanks for the confidence. Hmmm...serious chocolate sounds good too.\n\n"
    },
    {
      "time": "15 May 2007 — 7:21am",
      "content": "Futura's also quite interesting (3rd on 557). It perhaps doesn't cue chocolates as much as the cursive options, but for the same reason it's less predictable too.\n\nIt might be worth trying Cochin.\n\n"
    },
    {
      "time": "15 May 2007 — 7:27am",
      "content": "Am I being silly using the top one on 557? I thought it would give a modern, contemporary feel like Arun mentioned above? Hmmm...now thats a hard choice. Cochin seemed too uneasy for me because of the baseline where the letters sit. It doesn't seem too happy in its place using Cochin. It doesnt do it for me for this but thanks for the feedback. Much appreciated.\n\n"
    },
    {
      "time": "15 May 2007 — 7:34am",
      "content": "That's quite nice too. I'd loosen the spacing a little - ab and at in particular.\n\nProbably redraw the forms so that even in on-screen applications (if you expect to have any), the lines remain well-defined.\n\n"
    },
    {
      "time": "15 May 2007 — 7:39am",
      "content": "Why not have about in much smaller size, probably reversed out of a forms sitting between Serious and Chocolates? Would be some added fun.\n\n"
    },
    {
      "time": "15 May 2007 — 8:09am",
      "content": "yup definately, I shall try Arun :)\n\n"
    },
    {
      "time": "15 May 2007 — 2:32pm",
      "content": "I was wondering what kind of type would be suitable for body copy in conjunction with thrid one down on 577? Should I have small caps for ingriedients on my easter egg packaging? Or should it be a light font but remember it is going to be printed on a brown background. Therefore, I need it to be legible and not have the ink bleed on to my white type. Any suggestions?\n\n"
    },
    {
      "time": "17 May 2007 — 7:36am",
      "content": "What exactly is easter egg packaging?\n\nThe safe option, I imagine would be to use Futura for the back-of-pack too. But maybe not small caps.\n\nIf the text is not too small, wouldn't a rather fine serif work? I'd try Weiss (... and why do I keep thinking of Cochin?)\n\n"
    },
    {
      "time": "17 May 2007 — 11:09am",
      "content": "I don't know. Does it depend where in teh world you live? I mean we all have different tastes etc but we could all see one font working well in a different light. Like Eric and Hrant have mentioned that the typeface they pointed out would definitely work but so would the one you mentioned that I had on my images. Nevermind...maybe it would work for some people and not for others. Its always debatable I guess...but I don't think it works as strong as them two if you know what I mean but nevermind. thanks for the advice though. Much appreciated :)\n\n"
    },
    {
      "time": "17 May 2007 — 11:39am",
      "content": "Unfortunately, all things in design are subjective.\n\n"
    },
    {
      "time": "17 May 2007 — 10:40pm",
      "content": "Does where I live determine what typeface I choose?... Maybe. But certainly not any more than the books I read, or the movies I watch, or the people I meet.... or a milion other things.\n\nAnd all of that is hardly unfortunate :)\n\n(By the way, I used to live in a place called Cochin. So probably you're right after all!)\n\n"
    },
    {
      "time": "18 May 2007 — 2:12am",
      "content": "sorry, i didn't mean like that. I meant could it possibly be...OK styles vary from country to country in clothes, design etc. I'm not sure whether you agree. Something might look sophisticated in one place but not so sophisticated in another. Does age and taste determine design solutions too to some extent or does it not? I'm not sure. What do you think? I'd like your opinion.  \nPS noway you lived in a placed named Cochin. haha :)\n\n"
    },
    {
      "time": "18 May 2007 — 9:12am",
      "content": "I hate to be a sour puss, but it's really hard to make any call from only a stripe + text. Any of these typefaces could work in some context to accomplish your goal. But here we have no context. It feels like you're starting with a typeface instead of a direction. And there are so many directions that would fit your demographic.\n\nIf the packaging had line illustration, that might dictate a certain type choice.  \nIf the packaging had watercolor illustration, perhaps another type choice.  \nIf the packaging was wrapped in sassy fishnet stockings a very different choice.  \nIf the packaging was a just a stripe, I'll take the fishnet.\n\nAll that to say... show us the packaging. Show us your direction so we can help you.\n\nAs a lover of chocolate I admire the shelf appeal and taste of the following:  \n [http://www.charleschocolates.com](http://web.archive.org/web/20121102080622/http:/www.charleschocolates.com/ \"http://www.charleschocolates.com\") (hip contemporary - especially their bars)  \n [http://www.scharffenberger.com](http://web.archive.org/web/20121102080622/http:/www.scharffenberger.com/ \"http://www.scharffenberger.com\") (old world with a twist - love the nibby bar)  \n [http://www.vosgeschocolate.com](http://web.archive.org/web/20121102080622/http:/www.vosgeschocolate.com/ \"http://www.vosgeschocolate.com\") (juicy couture meets tiffany's over truffles)\n\nFWIW, Sabbath Black is the type of choice to go with the fishnet :-)  \nGive your chocolate a voice...\n\nBest of luck.  \nRandy\n\n"
    },
    {
      "time": "18 May 2007 — 1:07pm",
      "content": "OK thanks for the advice, much appreciated. Your right.\n\n"
    },
    {
      "time": "18 May 2007 — 2:06pm",
      "content": "[Choxie](http://web.archive.org/web/20121102080622/http:/sites.target.com/site/en/supertarget/featured_brands.jsp?title=Choxie) at Target is another nice clean chocolate brand.\n\n[V Chocolates](http://web.archive.org/web/20121102080622/http:/www.vchocolates.com/) straight outta Midway, Utah (huzzah!) has beautiful packaging too.\n\n"
    },
    {
      "time": "18 May 2007 — 2:17pm",
      "content": "Randy, impressive.\n\nhhp\n\n"
    },
    {
      "time": "18 May 2007 — 4:34pm",
      "content": "[http://www.hotelchocolat.co.uk/default.asp?src=cj&gclid=CO6L9q\\_wmIwCFQPi...](http://web.archive.org/web/20121102080622/http:/www.hotelchocolat.co.uk/default.asp?src=cj&gclid=CO6L9q_wmIwCFQPilAodVR7I0Q \"http://www.hotelchocolat.co.uk/default.asp?src=cj&gclid=CO6L9q\\_wmIwCFQPilAodVR7I0Q\")\n\n"
    },
    {
      "time": "18 May 2007 — 4:43pm",
      "content": "[http://www.neuhaus.be/150/](http://web.archive.org/web/20121102080622/http:/www.neuhaus.be/150/ \"http://www.neuhaus.be/150/\")\n\nhhp\n\n"
    }
  ]
}
