{
  "id": "33812",
  "title": "Resumé Crits ASAP",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I found a job listing that I'd like to send my resumé to, but I need a couple fresh set of eyes to look at what I have before I make the jump. Any comments/crits/concerns would be great!\n\n| Attachment | Size |\n| --- | --- |\n| [resume.5.01.pdf](http://web.archive.org/web/20141109082404/http:/typophile.com/files/resume.5.01.pdf) | 70.84 KB |\n| [resume.5.02.pdf](http://web.archive.org/web/20141109082404/http:/typophile.com/files/resume.5.02.pdf) | 74.83 KB |\n| [resume.5.03.pdf](http://web.archive.org/web/20141109082404/http:/typophile.com/files/resume.5.03.pdf) | 74.83 KB |\n| [resume.5.04.pdf](http://web.archive.org/web/20141109082404/http:/typophile.com/files/resume.5.04.pdf) | 73.69 KB |\n| [resume.5.final.pdf](http://web.archive.org/web/20141109082404/http:/typophile.com/files/resume.5.final.pdf) | 71.61 KB |\n\n",
  "author": "dave bailey",
  "time": "15 May 2007 — 10:29am",
  "uid": "8451",
  "comments": [
    {
      "time": "15 May 2007 — 10:48am",
      "content": "Looks nice, very clean. I going to be persecuted for this, but I don't believe typophile is an actual word.\n\ntypographer, type designer or type setter maybe.\n\n"
    },
    {
      "time": "15 May 2007 — 10:49am",
      "content": "Much as I enjoy being a typophile, I don't think it is a vocation! Also many people may not know what it means. So I would consider substituting some other self-description.\n\n"
    },
    {
      "time": "15 May 2007 — 10:52am",
      "content": "I guess I should change it on my biz card too then huh? (as seen here: [http://typophile.com/node/33485](http://web.archive.org/web/20141109082404/http:/typophile.com/node/33485 \"http://typophile.com/node/33485\") )\n\n"
    },
    {
      "time": "15 May 2007 — 10:55am",
      "content": "To my eye the type is a little heavy. I think you've set it up nicely though. The heads could be a tiny bit smaller, and I'd look at adding a point of space between your title (at each job) and the first bullet point.\n\nNot sure you need periods after the job titles and bullet points - they are not sentences after all.\n\nI'd make the hyphens under AWARDS into M-dashes for consistency.\n\nI like its simplicity, especially compared with some of the nonsense you see from students.\n\n"
    },
    {
      "time": "15 May 2007 — 11:04am",
      "content": "The dashes in the dates should be en dashes and coworker can be closed, even though it looks like cow orker.\n\n"
    },
    {
      "time": "15 May 2007 — 11:08am",
      "content": "The indent of Bachelor of Science, Graphic Design might be a bit much, at least pull it back to line up with your bullet points.\n\nThe bottom 3 columns of Course Work, Computer Skills and Personal Skills seems awkward. The spacing between them doesn't seem right.\n\nOn the second pass, I would agree with Patty that the type is heavy. You might want to consider using some ruled likes to break things up abit.\n\nIf you do use some lined rules, set the stroke to the mustard yellow used in your logo and then set your bullets with a fill of the same.\n\n"
    },
    {
      "time": "15 May 2007 — 11:09am",
      "content": "On your Langdon job, you say, \"2004 to present\" yet it is half-way down the resumé. Is this a typo or are you doing that along with the other jobs?\n\nChrisL\n\n"
    },
    {
      "time": "15 May 2007 — 11:09am",
      "content": "I think a card is somewhat more personal, so you have more latitude--but that may be just me.\n\nI was was uneasy about the type also. Now I see it is Chapparal. To me PMN Caecilia, also a humanist slab, would give much more of a \"I'm a cool designer dude\" message, which I guess is what you want.\n\n"
    },
    {
      "time": "15 May 2007 — 11:16am",
      "content": "All valid points! Thank you! (New PDF attached)\n\npatty: That means a lot to me, I've busted my ass for the past 4 years in order to set higher standards and stand out amongst my peers. This place has been such a valuable resource for me.\n\n"
    },
    {
      "time": "15 May 2007 — 11:18am",
      "content": "Drexel's a great school. My sister went there for Interior design. She's now designing for Paul Steelman who does Casino hotels exclusively.\n\n"
    },
    {
      "time": "15 May 2007 — 11:30am",
      "content": "I think it really looks nice now. You might consider using all small caps for 'Designer & Typographer'. Then it may more cleanly underline your name.\n\n"
    },
    {
      "time": "15 May 2007 — 11:30am",
      "content": "dez: Sorry, missed your comment...not sure why that was the case, the order in the next one will be fixed!\n\nWilliam: I've changed the weight and relationships in the second PDF. I think I will change my card as well, as I feel consistancy is important. The 'Typophile' branding might confuse some people and that's the last thing I need! I have the Linotype OT version of Caecilla, I think I may do a version in that typeface to see how it 'feels'\n\n"
    },
    {
      "time": "15 May 2007 — 11:32am",
      "content": "The lined rules are nice, you might want to consider taking them all the way to your right margin. Which seems to be like 1.5 or 2 inches wide.\n\nThe 3 columns at the bottom should also fit between these margins.\n\n"
    },
    {
      "time": "15 May 2007 — 11:33am",
      "content": "Ok....updates posted!!\n\n"
    },
    {
      "time": "15 May 2007 — 11:44am",
      "content": "This does look very good. Just a few thoughts, really:\n\n- The section titles seem very large and create a heavy bold spot in the experience area as you have the Office name bold as well. Does this font have small caps? What if you use all small caps and made it smaller with a little spacing?\n\n- I'd use the vertical space. Align the top and bottom margins.\n\n- I'd also make the left margin the large margin, not the right. Think of the recto page in a book, not the verso.\n\n"
    },
    {
      "time": "15 May 2007 — 11:45am",
      "content": "The last 'r' in 'designer & typographer' would ideally align better with the 'Y' at the end of your name. This would mean tightening it or making it a hair smaller. Probably it will look right visually with the right branch of the Y hanging a bit beyond the 'r' in typographer.\n\n(Do you know Dowdling's 'Finer Points'?)\n\nAsvetic does put his finger on a weakness, whether his solutions or some other turn out to work best...\n\n"
    },
    {
      "time": "15 May 2007 — 11:45am",
      "content": "Hmm. I might also make the logotype smaller. It almost over powers the mark.\n\n"
    },
    {
      "time": "15 May 2007 — 12:01pm",
      "content": "Ok I've fiddled with it a bit more, now I need to head to class and the Helvetica premier here in Philly. Your quick responses and guidance were extremely helpful.\n\nWilliam: I am not familiar with that book, but I am familiar with optical alignment...I had placed the wrong file in my INDD doc. should be fixed now.\n\nTiff: Version 4 any better?\n\n"
    },
    {
      "time": "15 May 2007 — 12:05pm",
      "content": "I think the rules need to extend out at least as far as the last line of copy (excellent time management, under Personal skills). Which brings up - why have that category anyway? Totally unnecessary IMHO. That's the sort of thing references are for. I hate extra words on a resume, you can read my screed about it on that other resume thread where the guy spent like 10 pages telling us why we should hire him before we even got to the CV.\n\nIt's looking much improved. I agree your name is a tad large at the top, and also that the bold is a bit bold.\n\nBut you have a nice professional looking piece here.\n\n"
    },
    {
      "time": "15 May 2007 — 12:34pm",
      "content": "Dave, this is better. I'd still play with using more vertical space. But, that's just me. ;^)\n\n"
    },
    {
      "time": "15 May 2007 — 12:35pm",
      "content": "Oh, and I agree with Patty about the rules.\n\nDoes the before and after space around the rules match everywhere? Looks of below the bottom rule.\n\n"
    },
    {
      "time": "15 May 2007 — 3:29pm",
      "content": "Here's my (rather blunt) 2 cents worth...\n\nI don't think there is enough areas of solid body text to warrant a secondary headline typeface. Maybe do them in the regular of the font you've used for \"DESIGNER & TYPOGRAPHER\".\n\nLose the m/n dashes. They're ugly and break the flow.\n\nThe spacing above and below the rules are both inconsistent.\n\nThe position and size of the whole 'block' of text on the page seems a bit awkward and cramped.\n\nI think your logo and name should share a baseline.\n\nToo much space between the 3 columns at the bottom.\n\nI don't like the colour split in your name.\n\nNot too keen on the use of italics.\n\nThe text under 'Personal Skills' is higher than the other 2 columns.\n\nSorry to be presumptuous but I couldn't resist a bit of tweakage. See what you think :) ...\n\n ![](http://web.archive.org/web/20141109082404im_/http:/typophile.com/files/DaveBaileyResume600px_5936.gif)\n\n"
    },
    {
      "time": "15 May 2007 — 4:50pm",
      "content": "Pull the rules from the right to mirror the left side margin.\n\n"
    },
    {
      "time": "15 May 2007 — 6:24pm",
      "content": "Minor thing, but it's now \"Adobe Dreamweaver\" and \"Adobe Flash\"; using the up-to-date names will make sure employers know that you're truly hip to the latest technology.\n\n"
    },
    {
      "time": "15 May 2007 — 6:32pm",
      "content": "EDUCATION WORK EXPERIENCE AWARDS are not working well as headings. need to be bolder, perhaps? Also Caecilia is nicer than chapperal in my humble opinion. Chapperal is a bit wishywashy? but whatever smokes your tyres!!\n\n-----------------------  \nChopper Reid says \"Harden the \\*\\*\\*\\* up\".\n\n"
    },
    {
      "time": "15 May 2007 — 6:56pm",
      "content": "Thanks for everyone's advice, both public and private. I need to call this finished as I'm applying for an awesome job opportunity. Obviously, I changed some things, and left some...I feel like it's where I want it to be and worthy of submission.\n\n"
    },
    {
      "time": "16 May 2007 — 4:44pm",
      "content": "Sounds like you already submitted your resume, but for next time you might want to change all ampersands (&) to \"and\". Maybe you used the ampersand for stylistic reasons, but it doesn't really make sense from an editorial standpoint.\n\n"
    },
    {
      "time": "18 May 2007 — 2:47pm",
      "content": "I made a few last changes if anyone is interested. Check them out on my site: [http://www.davebailey.us/about.html](http://web.archive.org/web/20141109082404/http:/www.davebailey.us/about.html \"http://www.davebailey.us/about.html\")\n\n"
    }
  ]
}
