{
  "id": "33831",
  "title": "InDesign CS3: importing preferences from CS2",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've just installed InDesign CS3 (trial) and am a little disappointed that it didn't import -- or even offer to import -- my InDesign CS2 configurations and preferences. I just can't believe that I'll have to recreate all my workspaces, arrangement of panels, default character and paragraph styles, etc, etc, etc. Any suggestions?\n\n(Sorry if this has been asked and answered before, but the search facility yielded no results. I'm a bit suspicious, though, because the term _cs3_ alone returned no results either, but I'm sure there's been some discussion about the new Creative Suite.)\n\n",
  "author": "Erik Fleischer",
  "time": "16 May 2007 — 12:08pm",
  "uid": "10481",
  "comments": [
    {
      "time": "16 May 2007 — 12:55pm",
      "content": "FWIW I do agree, but it may not automate those, you can import them. Can't you?\n\n"
    },
    {
      "time": "16 May 2007 — 1:27pm",
      "content": "I have found the search to be non-functional as of late, too.\n\n"
    },
    {
      "time": "17 May 2007 — 6:16am",
      "content": "_(...) you can import them. Can’t you?_\n\nHaven't found a way to do that. Mind you, I googled this extensively before posting my question here. If anyone finds a way to import preferences, please share the solution with the rest of us.\n\n"
    },
    {
      "time": "17 May 2007 — 6:35am",
      "content": "hm, workspaces are living in a file called \"Active-Workspace.xml\".\n\n"
    },
    {
      "time": "17 May 2007 — 9:18am",
      "content": "Ok I was wrong, it isn't importing. Within the application folder you have a presets folder. Within that folder you'll find the workspace folder. I believe, you can move your old workspace into there.\n\n"
    },
    {
      "time": "17 May 2007 — 1:59pm",
      "content": "Thanks, Tina and Tiffany. I was reluctant to copy files from the CS2 to the CS3 install/configuration directories because there have been changes in the way some things work, so inevitably there will be changes in the structure of most configuration files. But by now I think it's pretty clear that Adobe has not provided us with any simple, hassle-free alternatives.\n\nAin't that nice: launch a slightly modified version of your software every year, charge a few hundred dollars for the upgrade (several hundred if you are in the developing world), and don't even bother to make transition from the previous version easy. Way to go, Adobe.\n\n"
    },
    {
      "time": "18 May 2007 — 9:43am",
      "content": "Erik et al,\n\nThe workspace model has changed dramatically from CS2 to CS3. The underlying technology is completely different, and that was the only way to go, [in order to provide the current flexibility](http://web.archive.org/web/20131014040538/http:/www.adobe.com/designcenter/video_workshop/?id=vid0065).\n\nUnfortunately that comes with the trade-off that the preferences are not sharable between the two versions. AFAIK, if anyone tries to use the “Active-Workspace.xml” file from CS2 with CS3, will get a warning message saying that the file was saved in an old format.\n\nBTW, in case someone is doing InDesign scripting, this change will also affect you.  \n [As noted on this file](http://web.archive.org/web/20131014040538/http:/www.adobe.com/devnet/indesign/sdk/InDesign_CS3_SDK_whats-new.pdf) (PDF),  \n<cite><strong>Palette and Panel-related APIs Changes</strong> — Adobe adopted a new common palette appearance for all Adobe Creative Suite® 3 applications. Implementing this new appearance in InDesign required an extensive rewrite of InDesign’s palette system, including changes to public APIs and how palette resources are specified.</cite>\n\n"
    },
    {
      "time": "18 May 2007 — 11:55am",
      "content": "Thanks for the clarification, Miguel.\n\n"
    }
  ]
}
