{
  "id": "33835",
  "title": "Atlantis - Ligatures",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello, This is my first post on the forum.\n\nIm a graphic design student (Year two), AUT University, Auckland, NZ.\n\nI have an indentity assignment, \"Atlantis\" - Aquarium.\n\nCurrently its set in Baskerville.  \nI have Mrs Eaves, and was hoping for some possible ligature combinations, there are none.  \nI no this probably means that there is no need, But damn, Mrs eaves ligatures are beautiful!\n\nWhat are some possible combinations that you can think of? be they decorative or functional?\n\n",
  "author": "Julian_N",
  "time": "16 May 2007 — 3:31pm",
  "uid": "18635",
  "comments": [
    {
      "time": "16 May 2007 — 4:10pm",
      "content": "Half of the fun of being a student is just coming up with some crazy stuff. The good part about it is there are no wrong answers, as long as they make sense. Check out this simple ligature: [http://www.underconsideration.com/brandnew/archives/love\\_at\\_first\\_glanci...](http://web.archive.org/web/20131020153758/http:/www.underconsideration.com/brandnew/archives/love_at_first_glancia.php \"http://www.underconsideration.com/brandnew/archives/love\\_at\\_first\\_glancia.php\")\n\nIt is beautiful and subtle. I think you could go with either extreme ligatures or subtle but I see combinations between the A+t, t+l, a+n, t+i, and the i+s. So, almost every letter could have a ligature. Don't go overboard, no pun intended, but see which combinations work the best in whatever typeface you end up using. Baskerville is a nice typeface to experiment in so have fun!\n\n"
    },
    {
      "time": "16 May 2007 — 9:41pm",
      "content": "this fulla has a shed load of ligatures, and also one of your contrymen!\n\n[http://www.klim.co.nz/feijoa\\_charset.php](http://web.archive.org/web/20131020153758/http:/www.klim.co.nz/feijoa_charset.php \"http://www.klim.co.nz/feijoa\\_charset.php\")\n\nmight be something in there?\n\n-----------------------  \nChopper Reid says \"Harden the \\*\\*\\*\\* up\".\n\n"
    }
  ]
}
