{
  "id": "33844",
  "title": "Typeright - Infowrong",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "The \"Typeright\" website ( [http://www.typeright.org](http://web.archive.org/web/20150124161309/http:/www.typeright.org/ \"http://www.typeright.org\")) is an example of how shady American lawyers (here the attorney Leonard DuBoff) disseminate wrong information for the purpose of lobbyism.\n\nE.g., shady lobbyist Leonard DuBoff states as \"General Counsel\" at above site:\n\n<cite>\"Under the Berne Convention, one signatory nation agrees to respect the copyrights of every other signatory. The United States is one of these nations. Since most developed countries protect typeface designs, the U.S. is in the strange and paradoxical position of officially respecting the copyright on foreign typeface designs but not its own domestic designs.\"</cite>\n\nApart from the fact that the statement \"Most developed countries protect typeface designs\" is not based on proof, even third-rate American shysters know very well that the Berne Convention is based on the \"principle of national treatment”. This means that the USA, under the Berne Convention (see RBC, Art. 5, Par. 1), grants to non-nationals (i.e. to foreigners or citizens of other countries) the same copyright protection as it grants to the works of its own nationals (i.e. to domestic United States citizens).\n\nAs the USA does not grant copyright protection to the typeface designs of its own nationals, it also does not grant copyright protection to the typeface designs of non-nationals so that e.g. the typeface designs made by Spanish, French, German, etc. designers are not copyrightable in the USA.\n\nThe shady lawyer Leonard DuBoff knows that <cite>\"the U.S. is ***NOT*** in the strange and paradoxical position of officially respecting the copyright on foreign typeface designs\"</cite> and he also knows that he is disseminating wrong information at Typeright, for which site he acts as \"General Counsel\" for the purpose of lobbyism.\n\n",
  "author": "Uli",
  "time": "17 May 2007 — 1:37am",
  "uid": "11274",
  "comments": [
    {
      "time": "17 May 2007 — 2:49am",
      "content": "What do you mean by 'lobbyism'? And who would he be lobbying? Or do you just mean that he is misleading type designers/his company's customers?\n\n"
    },
    {
      "time": "17 May 2007 — 7:48am",
      "content": "I think it would help your argument if you used the word \"shady\" a few more times.\n\n"
    },
    {
      "time": "17 May 2007 — 8:49am",
      "content": "\\>I think it would help your argument if you used the word “shady” a few more times.\n\nBut, Will the real slim (use of) shady stand up (to scrutiny)?\n\n"
    },
    {
      "time": "17 May 2007 — 9:22am",
      "content": "\\> What do you mean by ‘lobbyism’?\n\nBy lobbyism I mean that you are expected to sign a petition to the U.S. Congress and Copyright Office (see [http://www.typeright.org/mission.html](http://web.archive.org/web/20150124161309/http:/www.typeright.org/mission.html \"http://www.typeright.org/mission.html\")) based on false statements made by this so-called lawyer Leonard DuBoff:\n\n<cite>\"Type designers the world over enjoy legal protection for their typefaces (false) - except those working in the United States. Designers in other countries even enjoy protection from the U.S. government in U.S. courts (false). Type designers in the U.S., on the other hand, are offered no protection for their creative efforts, and TypeRight wants to see this changed.\"</cite>\n\nPresently (2007), there are 163 Berne Convention members (incidentally, the oldest one is Switzerland, 1887, and the newest one is Brunei, 2006):\n\nAlbania  \nAlgeria  \nAndorra  \nAntigua and Barbuda  \nArgentina  \nArmenia  \nAustralia  \nAustria  \nAzerbaijan  \nBahamas  \nBahrain  \nBangladesh  \nBarbados  \nBelarus  \nBelgium  \nBelize  \nBenin  \nBhutan  \nBolivia  \nBosnia and Herzegovina  \nBotswana  \nBrazil  \nBrunei Darussalam  \nBulgaria  \nBurkina Faso  \nCameroon  \nCanada  \nCape Verde  \nCentral African Republic  \nChad  \nChile  \nChina  \nColombia  \nComoros  \nCongo  \nCosta Rica  \nCôte d'Ivoire  \nCroatia  \nCuba  \nCyprus  \nCzech Republic  \nDemocratic People’s Republic of Korea  \nDemocratic Republic of the Congo  \nDenmark  \nDjibouti  \nDominica  \nDominican Republic  \nEcuador  \nEgypt  \nEl Salvador  \nEquatorial Guinea  \nEstonia  \nFiji  \nFinland  \nFrance  \nGabon  \nGambia  \nGeorgia  \nGermany  \nGhana  \nGreece  \nGrenada  \nGuatemala  \nGuinea  \nGuinea-Bissau  \nGuyana  \nHaiti  \nHoly See  \nHonduras  \nHungary  \nIceland  \nIndia  \nIndonesia  \nIreland  \nIsrael  \nItaly  \nJamaica  \nJapan  \nJordan  \nKazakhstan  \nKenya  \nKyrgyzstan  \nLatvia  \nLebanon  \nLesotho  \nLiberia  \nLibyan Arab Jamahiriya  \nLiechtenstein  \nLithuania  \nLuxembourg  \nMacedonia (Former Yugoslav Republic of)  \nMadagascar  \nMalawi  \nMalaysia  \nMali  \nMalta  \nMauritania  \nMauritius  \nMexico  \nMicronesia (Federated States of)  \nMoldova  \nMonaco  \nMongolia  \nMontenegro  \nMorocco  \nNamibia  \nNepal  \nNetherlands  \nNew Zealand  \nNicaragua  \nNiger  \nNigeria  \nNorway  \nOman  \nPakistan  \nPanama  \nParaguay  \nPeru  \nPhilippines  \nPoland  \nPortugal  \nQatar  \nRepublic of Korea  \nRomania  \nRussian Federation  \nRwanda  \nSaint Kitts and Nevis  \nSaint Lucia  \nSaint Vincent and the Grenadines  \nSamoa  \nSaudi Arabia  \nSenegal  \nSerbia  \nSingapore  \nSlovakia  \nSlovenia  \nSouth Africa  \nSpain  \nSri Lanka  \nSudan  \nSuriname  \nSwaziland  \nSweden  \nSwitzerland  \nSyrian Arab Republic  \nTajikistan  \nThailand  \nTogo  \nTonga  \nTrinidad and Tobago  \nTunisia  \nTurkey  \nUkraine  \nUnited Arab Emirates  \nUnited Kingdom  \nUnited Republic of Tanzania  \nUnited States of America  \nUruguay  \nUzbekistan  \nVenezuela  \nViet Nam  \nZambia  \nZimbabwe\n\nThis so-called lawyer Leonard DuBoff claims:\n\n<cite>\"The fact that copyright laws in most developed countries provide protection for the typeface designer... \"</cite>\n\nIs this a fact? No, it is a lie!\n\nYou can easily check the falseness of Leonard DuBoff's statement by sending an email to this so-called lawyer (lduboff [at] dubofflaw.com) requesting him to tick off those countries in above list of the 163 RBC member states which - according to this so-called lawyer Leonard DuBoff - provide copyright protection for typeface designs.\n\n"
    },
    {
      "time": "17 May 2007 — 8:51pm",
      "content": "By using the phrase \"so-called lawyer\" you are implying that Mr DuBoff is not in fact a lawyer. Please provide some evidence for your insinuation. (An error on Mr DuBoff's part is not evidence that he is not a lawyer.)\n\n"
    },
    {
      "time": "17 May 2007 — 9:04pm",
      "content": "Thomas, don't be such an Uli.\n\nhhp\n\n"
    },
    {
      "time": "17 May 2007 — 10:07pm",
      "content": "But, we must use the weapons of the enemy against him!\n\nNo, wait, that was Boromir's mistake, too, wasn't it. Oh well.\n\nT\n\n"
    },
    {
      "time": "18 May 2007 — 2:18am",
      "content": "\\> By using the phrase “so-called lawyer” you are implying...\n\nThis is pettyfogging, and you know that (\"pettifogging = paying too much attention to unimportant details\").\n\nThe only important and decisive question here is the following:\n\nHow many of the 163 national copyright laws of the 163 Berne Convention states contain provisions that typeface designs are copyrighted? Are there only two or three states, whose copyright laws contain such typeface design provisions? Or are such typeface design provisions contained in the copyright laws of \"most developed countries\", as Leonard DuBoff claims?\n\nYou should know that Leonard DuBoff is totally blind. He will never be able to see your typeface Hypatia, nor any other typeface, and due to his blindness, he could not read the copyright laws of the 162 foreign Berne convention states, except the American copyright law which he could read in Braille script. And Leonard DuBoff, who could never read the copyright laws of foreign states and who never sees any typeface due to his blindness, disseminates the false statement that the copyright laws of \"most developed countries\" protect typeface designs, or even all other 162 states except the USA (<cite>\"Type designers the world over enjoy legal protection for their typefaces - except those working in the United States.\"</cite>)\n\nIt is deplorable that Leonard DuBoff is totally blind. But this is not an excuse that he disseminates blatant lies at Typeright in order to take the visitors of this website and the members of the American Congress or House of Representatives as the addressees of the petition for a ride (see [http://www.typeright.org/petition.html](http://web.archive.org/web/20150124161309/http:/www.typeright.org/petition.html \"http://www.typeright.org/petition.html\")).\n\n"
    },
    {
      "time": "18 May 2007 — 6:08am",
      "content": "I hereby coin \"pettylifing\".  \nNay, I hereby claim copyright and trademark on \"pettylifing\".\n\nhhp\n\n"
    },
    {
      "time": "21 May 2007 — 3:10am",
      "content": "@Thomas - but Boromir at least had a grand exit :-)\n\n@Uli - paying too much attention to unimportant details... sounds good. Go ask yourself what you are spending your time with - I daresay pettyfogging should be familiar to you.\n\nTo tell you the truth, claiming that a blind lawyer is unable to read copyright laws of other countries is one of the worst lies I have ever heard of. You do know that we are living in the 21st century, do you? And you are aware of computer programs which actually READ text to you? You do know that blind people no longer need Braille to read?? Oh, and did you ask this \"so-called lawyer\" in person if he knows those laws or not? You did not? I hadn't expected. I am quite sure he does - and I would not be astonished to find that they ARE available in Braille. Oh, in case you hadn't noticed - there is a Braille terminal which transforms normal text into Braille on the fly. These blind people read like HELL, OKAY?\n\nI think you are disgusting, mocking a blind man and claiming that he cannot do his job right because of his blindness. And your proof is? I don't see any proof - and I'm not blind! You should be ashamed of yourself!\n\n"
    },
    {
      "time": "21 May 2007 — 5:51am",
      "content": "The persons of the Typeright website, e.g.\n\n- Clive Bruton (Fontzone)  \n- Simon Daniels (Microsoft Typography)  \n- Zuzana Licko (Emigre)\n\n(see [http://www.typeright.org/insight.html](http://web.archive.org/web/20150124161309/http:/www.typeright.org/insight.html \"http://www.typeright.org/insight.html\") for complete list)\n\nand the persons of the Leonard DuBoff outfit, e.g.\n\n- Colleen DuBoff  \n- Leonard DuBoff  \n- Mary Ann DuBoff\n\n(see [http://www.dubofflaw.com/directory/index.html](http://web.archive.org/web/20150124161309/http:/www.dubofflaw.com/directory/index.html \"http://www.dubofflaw.com/directory/index.html\") for complete list)\n\ncannot even list 5 Berne Convention states (out of 163 Berne Convention states) whose copyright laws contain provisions for the protection of typeface design.\n\nNotwithstanding, these persons of the Typeright website headed by Leonard DuBoff disseminate the blatant lie <cite>“Type designers the world over enjoy legal protection for their typefaces - except those working in the United States”</cite> for the purpose of deceiving the politicians in Washington.\n\nIt is not my job to prove <cite>“Most developed countries protect typeface designs”</cite>, because I did not disseminate this blatant lie.\n\nIf this blind lobbyist Leonard DuBoff, who cannot even distinguish between Frutiger and Zapfino, since he cannot see any typefaces, had read the copyright laws of all 163 Berne Convention states, he would not dare to disseminate his blatant lies.\n\nBut since this lobbyist never read the copyrights laws of\n\nAlbania  \nAlgeria  \nAndorra  \nAntigua and Barbuda  \nArgentina  \nArmenia etc. etc. etc.\n\nhe promulgates his blatant lie that type designers in these countries enjoy legal protection for their typefaces.\n\nTypophiler \"sii\" alias Mr. Simon Daniels ( [http://typophile.com/user/1049](http://web.archive.org/web/20150124161309/http:/typophile.com/user/1049 \"http://typophile.com/user/1049\")) belongs to the Typeright website too (see [http://www.typeright.org/insight.html](http://web.archive.org/web/20150124161309/http:/www.typeright.org/insight.html \"http://www.typeright.org/insight.html\")).\n\nBut even Mr. Simon Daniels cannot name 5 states whose copyright laws contain provisions for the protection of typeface design, because the only purpose of Typeright is to deceive gullible visitors of this website and to deceive members of Congress in Washington.\n\nI repeat what I said above: You can easily check the falseness of Leonard DuBoff’s statement by sending an email to him (lduboff [at] dubofflaw.com) requesting him to tick off those countries in above list of the 163 Berne Convention member states which - according to him - provide copyright protection for typeface designs.\n\nOr else ask \"sii\" to tick off above list, if you don't believe me.\n\n"
    },
    {
      "time": "21 May 2007 — 7:37am",
      "content": "Listen - YOU are the one insulting people as shady, so-called, blind, making fun of others, mocking others, bragging to be Mr. Righteous. You know what: How about this?\n\nYOU PROVE IT, THEN WRITE SOMETHING!\n\nStop writing stuff, and when asked to prove it, you shrug and tell people to write emails. NO! Even should you be correct - this is absolutely unethical and actually not worth reading. People like you make me sick.\n\n"
    },
    {
      "time": "21 May 2007 — 10:10am",
      "content": "On 21st May, I sent this email:\n\n-----------------------------------\n\nTo the attention of\n\nChristopher W. Brown  \nLeonard D. DuBoff  \nMary Ann DuBoff  \nMarisa N. James  \nChristy O. King\n\nRe: Claims made by Leonard D. DuBoff at Typeright Website\n\nLadies and Gentlemen:\n\nWith reference to website\n\n[http://typophile.com/node/33844](http://web.archive.org/web/20150124161309/http:/typophile.com/node/33844 \"http://typophile.com/node/33844\")\n\nyou are herewith requested to specify those RBC member states,  \nwhose national copyright laws contain provisions for the protection  \nof typeface design.\n\nYours faithfully,\n\nUlrich Stiehl, Heidelberg (Germany)  \n( [http://www.sanskritweb.net/forgers](http://web.archive.org/web/20150124161309/http:/www.sanskritweb.net/forgers \"http://www.sanskritweb.net/forgers\"))\n\nEncl.: List of all 163 RBC member states\n\n"
    },
    {
      "time": "22 May 2007 — 12:13am",
      "content": "Oh, great!!\n\nListen, you should go and hide in a hole, okay? So you actually DID start this whole thread of bashing and insulting BEFORE getting any proof!\n\nSorry - but you are not worth talking to. Have a nice life. And listen - how about spending it somewhere else, hmmm? I read somewhere that you actually had plans to leave this community. Please do so.\n\n"
    },
    {
      "time": "22 May 2007 — 9:22am",
      "content": "It is a waste of time to try to explain to you the legal principle of \"cui incumbat onus probandi\", as the chance is remote that you will be able to understand it.\n\n"
    },
    {
      "time": "22 May 2007 — 9:25am",
      "content": "Yes, please feel free to not waste your time any more.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2007 — 10:31am",
      "content": "Oh my god - now you've got me! A learned man, mighty in old, dead, and foreign tongues, hath spoken, so my argument is void. He that claimeth that someone is a shady character, thereby insulting him and making fun of his blindness by claiming that said person cannot read, may do so, without proof, provided that he knoweth enough Latin.\n\nOh no, wait! I actually can speak the damn language myself. \\*slap\\*\n\nSo in case you thought you could just ignore my argument (since I am undoubtedly right, and your behaviour highly unethical), and instead silence me by acting the superior intellectual, spouting Latin phrases you picked up somewhere - without REALLY knowing what it means - and of course not translating them in order to prove me being the small-and-meek, then you are...\n\n... mistaken. Dulce et decorum est, pro typographia mori :-)\n\nNow, just to get you silenced: Yes, it is a general rule that the party who alleges the affirmative of any proposition shall prove it. In court. Okay? IN COURT!\n\nAn example: if I claim in court that a font is a forgery (I heard this is a favorite word of yours, so I use this example just for you), I need to prove it, otherwise my argument is worthless, and the judge will not accept it. However, as you very well know, I can claim this on my website until doomsday - until there is someone PROVING that I am false, there is no way in hell to stop me from claiming it. You should know this, as I can see that your website is full of correct as well as very wrong accusations of this sort. Be glad that those companies take you for harmless, and leave you alone. It is called freedom of speech, by the way. Should I say this in Latin, so that it sounds better and impresses some idiot? Naw, better not.\n\nNow, taking your own legal argument, you here claim something without being able to prove it, so you are breaking the law you claim to rest on. You are claiming that what this lawyer says is not true (by the way, nowhere is it said that this is a legal text of any way) without having proof. The stuff on his site is information, and as such, may be wrong, exaggerated, correct, dumb, wishful thinking, twiddlestick, satire, fake, stupid, cum grano salis (mean, am I) or simpy biased - there is a lot of information out there on the internet like this. Your website, for example.\n\nSo, in dubio pro reo, smart aleck. You had no proof, but nevertheless started yapping. And now you are trying to get out of it by saying that the person you were yapping about should have proven what he's yapping about before yapping. Heh, before asking others do obey the law, how about doing it yourself?\n\nAnd don't you go and try to do the smart one on me. If you come up with Sanskrit next time, I'll give you some Klingon to think about! Now shut up and stop posting rubbish, UNLESS YOU CAN PROVE IT! And even if proved, please think about one thing before you post: is anyone likely to be interested in it?\n\nOh, and never again claim that anyone who is blind cannot have read anything, because of his blindness. I happen to have blind friends, and I love them dearly. They read more than I do, and we often talk about books. They are very book-learned, and they do their jobs fine. So never ever again claim that someone cannot do their job because he or she cannot read. That is plain dumb! Either admit it, or go away!\n\n"
    },
    {
      "time": "22 May 2007 — 2:14pm",
      "content": "\\> UNLESS YOU CAN PROVE IT!\n\nEi incumbit probatio, qui dicit, non qui negat.\n\nThis means: It is NOT my job to prove “Most developed countries protect typeface designs”, because I did not disseminate this blatant lie. Although I do NOT have the onus probandi, I COULD prove that this blatant lie is a blatant lie.\n\nThe first country in the above list of the 163 Berne Convention countries is Albania. The following text proves that the Albanian copyright law does not protect typeface designs.\n\nWe could continue with the copyright law of Algeria, then with the copyright law of Andorra, then of Antigua, then of Argentina, then of Armenia etc. etc. etc. After having read all these copyright laws of all Berne Convention countries, it will become evident that Leonard DuBoff's statement“Most developed countries protect typeface designs” is a blatant lie.\n\n-----------\n\nChapter I  \nThe Protection of Copyright\n\n1. This law protects the literary, artistic, public and other works (hereinafter referred to as “works”), including any original intellectual creation of this nature, regardless of their form of expression as:\n\n(a) written works including computer programs;\n\n(b) lectures, addresses, sermons and other orally expressed works;\n\n(c) musical works with or without accompanying text;\n\n(d) dramatic or dramatico-musical works;\n\n(dh) audiovisual works;\n\n(e) choreographic works and pantomimes;\n\n(f) works of fine arts: drawings, paintings, sculptures, engravings and lithography;\n\n(g) architectonic works;\n\n(h) photographic works;\n\n(i) works of applied art;\n\n(j) illustrations, maps, plans, sketches and three-dimensional works related to geography, topography, architecture and science.\n\nThe protection does not depend in the manner and form of expression, quality or aim of the work.\n\nThe protection shall not extend to ideas, procedures, processes, systems, ways of action, concepts, expressed principles or discoveries, which are foreseen and explained in the work.\n\nDerived Works and Collections\n\n2. The same protection as to the works is applied to:\n\n(a) translations, adaptations, arrangements, and other alterations of works and folkloric materials;\n\n(b) collections of works, popular sayings or data and facts as encyclopedias, anthologies and other sources of data which, by reason of the selection and arrangement of their contents constitute original creations.\n\nProtection of the works defined in the first paragraph is applied without prejudice to the copyright of the original works, which are used then for the protection of the derived works;\n\n3. The protection provided by this law for the literary and artistic works, shall not apply to:\n\n(a) summaries of the official gazette of legislative and administrative nature and their official translations;\n\n(b) popular sayings;\n\n(c) news of the day;\n\n(d) miscellaneous facts and data.\n\nChapter II  \nRights Which Enjoy Protection\n\nMoral Rights of the Author\n\n4. The author of the work in addition to the economic rights defined by Article 5 of this law, even if they have been transferred by his desire (sic), has the right to:\n\n(a) claim authorship of the work, especially the right to write his name on the copies of the work. When allowed by practice and in conformity with the tradition, his name may accompany his work mentioned in public.\n\n(b) remain anonymous or use a pseudonym\n\n(c) object to any distortion, mutilation or modification and to other derogatory action in relation to his work, which would be prejudicial to his honor or reputation;\n\n(d) object the joint authorship put in an arbitrary way from other persons because of different reasons.\n\n(Hereinafter, the rights provided for in this article will be referred to as “moral rights”).\n\nEconomic Rights of the Author\n\n5. The author shall have the exclusive right of authorizing:\n\n(a) the reproduction of the work;\n\n(b) the import of the work within the country with the purpose of its distribution (selling, leasing renting, loaning) for/to the public;\n\n(c) the translation of the work;\n\n(d) the preparation of adaptations, alterations or other alterations of the work;\n\n(e) the public recitation of the work;\n\n(f) the communication of the work to the public by broadcasting and rebroadcasting;\n\n(g) the communication of the work to the public by wire or other means;\n\nThe author of an audiovisual work, or any other work like phonograms, computer programs, data base, and of any other work readable in machine, has the exclusive right to authorize giving on lease of his work.\n\n(Hereinafter the rights mentioned in this article will be referred to as “economic rights”).\n\nChapter III  \nLimitations of the Economic Rights\n\nFree Reproduction for Personal Use\n\n6. Reproduction of a published work without the author’s approval and without payment or remuneration, according to the laws, is allowed only for personal use (use for research and scientific purposes included).\n\nThe first paragraph is not applicable for:\n\n(a) the reproduction of architectural works in terms of a building or other constructions;\n\n(b) the reprographic reproduction of fine arts works published (sic) in limited copies, the graphic presentation of musical works, notebooks or other publications, which are meant for a single use purpose;\n\n(c) the reproduction of computer programs, excluding what provided for in Article 13;\n\n(d) any other reproduction which would come against the process of work employment or would damage the legitime interest of the author.\n\nFree Reproduction in the Form of Citation\n\n7. It is permitted, without the author’s approval and without payment or remuneration, the citing, according to the law, of a published work in another work under the condition that in the citation must be included the source and author’s name, if it is in the original work. The citing has to be honest, correct and it must not exceed the context of its original use.\n\nFree Usage for Teaching\n\n8. It is permitted the free usage of a work for teaching, without the author’s approval and without payment or remuneration, upon the condition that in the citation must be included the source and author’s name, if it is in the original work. It is permitted to:\n\n(a) use a published work, according to the law, for illustrations in publications, broadcasts or sound or visual recordings for teaching;\n\n(b) reproduce, my means of reprography, special articles published according to the law in a newspaper or magazine; to reproduce written pieces taken out of a published work according to the law, or a short full work published according to the law, for the purpose of teaching or for the period of the exams in educational institutions. The activity of these institution must not bear any direct or indirect profit purpose and the use of the work must be always honest.\n\nFree Reproduction from Libraries and Archives\n\n9. The reproduction from a library or archive, which activity does not bear any direct or indirect profit purposes, is permitted without the author’s approval and without payment or remuneration. The copy under discussion belongs then to the fund of the library’s archives with the purpose of:\n\n(a) storing and if necessary (in case of loss or overuse) replacing the work itself;\n\n(b) replacing of a copy (lost, damaged or overused) for the permanent fund of another library or archive.\n\nThese procedures can take place if it is not possible to buy an original copy for a long period of time and under reasonable conditions.\n\nFree Reproduction for Legal and Administrative Purposes\n\n10. The reproduction of a work is permitted, without the author’s approval and without payment or remuneration, for the purpose of using it in a court case or in other administrative processes within a reasonable required extend.\n\nFree Use for the Purpose of Giving Information\n\n11. It is permitted without the author’s approval and without payment or remuneration but the obligatory citing (mentioning) the source and the author’s name if it is in the original work:\n\n(a) the reproduction and distribution by the press, the broadcasting or the communication to the public by wire of any article published in newspapers or magazines treating an economic, political or religious issue or of any other broadcast work, if the right of reproduction, broadcast or any other similar communication to the public is not expressly limited;\n\n(b) the reproduction and offering to the public, in case of news on current events, of a work seen or heard during that event, by means of photography, cinematography, broadcasting or communication to the public by wire, without exceeding the informatory purpose;\n\n(c) the reproduction by the press, broadcast or by other mass media means of political speeches, lectures, reports, sermons and of other works similar to them, held on public places, as well as the speeches held during legal proceedings, when all these have an informatory purpose (hence not exceeding this informatory purpose). The authors of these works have the right to publish works summaries.\n\nFree Use of Pictures of Publicly Exposed Works\n\n12. It is allowed without the author’s approval and without payment or remuneration the reproduction, broadcasting or the communication to the public by wire of a picture of an architectonic work, of a fine arts work, photographic work or applied arts work placed in a public area, excluding the cases when the picture is the main theme of the reproduction, broadcasting or communication and when it is used for commercial purposes.\n\nFree Reproduction and Adaptation for Computer Programs\n\n13. The legal owner of a computer program is permitted, without the author’s approval and without payment or remuneration, to make a copy or adaptation of such a program, if this copy or adaptation is:\n\n(a) indispensable for the usage of the computer program and for the purpose the program is legally obtained;\n\n(b) used for archives and if necessary (in case of lost, damage or overuse) to replace the legally obtained copy.\n\nThe copy or the adaptation provided for in the first paragraph is destroyed in cases when the ownership of the copies of the computer programs is no more legal.\n\nFree Use of Computer Programmes\n\n14. The author’s approval is not obligatory if the reproduction of the code and the adaptation (“translation”) are necessary to get the required data for the interaction of a computer program which is created independently of the other programs. The reproduction can be made upon the following conditions:\n\n(a) when this action is done by means of a license, by another person who has the right to use the copy of the program or by any authorized person;\n\n(b) when the necessary data for interaction are not previously given to the persons mentioned in paragraph “a”;\n\n(c) when these actions are limited in those parts of the original program which are indispensable for the creation of the interaction capacity.\n\nThe use of the following data is prohibited because of the provisions of the first paragraph:\n\n(a) for a purpose different from that of interacting capacity of the computer program created in an independent way;\n\n(b) for giving them over to third parties, except for the cases when this is indispensable for the interacting capacity of the computer created in an independent way;\n\n(c) for the development, production and handing over of a similar computer program concerning the way of expression or for any other purpose which violates the copyright.\n\nThe provisions of this article must not be interpreted in such a way that causes its applications to come contrary to the normal use of the computer program, or infringes the legitimate rights of the author.\n\nFree Temporary Recording by Broadcasting Organizations\n\n15. A broadcasting organization can record for temporary use, by its own means, a work on which it enjoys this right without the author’s approval and without special remuneration. This agency is obliged to destroy this recording within six months from the day of recording it, except when there is an agreement with the author for longer terms. However, a recording of this kind may be stored in official archives even without an agreement, if it has special historical or documenting values.\n\nThe Free Public Performance\n\n16. It is permitted without the author’s approval and without payment or remuneration the public performance of a work during the activity of a school institution, prepared by the staff, if the audience is simply the staff and the students of that institution, the parents or tutors of the students, as well as other people who have a direct relation to the institution.\n\nChapter IV  \nTerm of Protection\n\nTerm of Protection\n\n17. Unless otherwise provided in this chapter, the moral rights of a work are protected forever and the economic rights of a work are protected during the whole author’s life and 70 years after his/her death.1\n\nTerm of Protection of Anonymous or Pseudonymous Works\n\n18.2 The moral and economic rights of an anonymous or pseudonymous work are protected for 70 years from the first day of the first legal publication of the work. If the identity of the author is disclosed before the expiration of the term, the provisions of Article 17 and 18 are applied, according to the case.\n\nTerm of Protection of Photographic and Audiovisual Works of Joint Authorship\n\n19.3 The moral and economic rights of a photographic or audiovisual work of joint authorship are protected for 70 years from the day this work is legally offered to the public or in a contrary case, for 70 years from the day of the production of the work, i.e. 70 years after its creation.\n\nTerm of Protection of Works of Applied Art\n\n20. The moral and economic rights of works of applied art are protected for 25 years from the day of its production.\n\nCalculation of the Terms\n\n21. The term provided by this Chapter lasts to the end of a calendar year.\n\nChapter V  \nThe Ownership of the Copyright\n\nThe Ownership of the Copyright\n\n22. The author of a work is the first owner of the moral and economic rights on his work.\n\nThe Ownership of the Copyright on Works of Joint Authorship\n\n23. The co-authors of a work of joint authorship are the first co-owners of the moral and economic rights of this work. But, if this work can be divided into parts (i.e. if its parts can be reproduced, stored or used separately), the co-authors have the independent rights for these parts of the work, maintaining the co-ownership of the rights for the common work.\n\nThe Ownership of the Copyright on Collective Works\n\n24. The owner of the moral and economic rights of a collective work will be the physical person or the legal entity on whose initiative and direction the work was created and whose name appears as the author of the work.\n\nThe Ownership of the Copyright on the Works Created  \non an Employment Contractual Basis\n\n25. If the work is created by an author for a physical person or a legal entity (hereinafter referred to as “employer”) on an employment contractual basis and during employment period, the first owner of the moral and economic rights will be the author, unless the contract provides otherwise. The economic rights of such a work will be considered transferred to the employer at the required extent for the proper activities that the employer accomplishes at the time the work is created.\n\nOwnership of the Copyright for Audiovisual Works\n\n26.4 The producer of the audiovisual work will be the natural or juridical person that undertake the initiative to create the work.\n\nThe contract between the producer and the compositor and the others authors of an audiovisual work provides for the transfer to the producer of the right to use of the audiovisual work, without prejudice to the moral and economic rights of the author.\n\nThe audiovisual work is considered finished when the final version is decided upon agreement between the author or co-authors and the producer.\n\nThe remuneration of the authors for the use of the work is made according to the circumstances and manners of usage.\n\nObtaining the Authorship\n\n27. In order that the author of a work is recognized to be as such, and consequently to have the right to make a legal complaint in case of procedure violation, in lack of contrary facts, it will be enough that his name appears in the work in the usual way.\n\nIn case of an anonymous or pseudonymous work, the editor, whose name appears in the work has the responsibility to represent the author, and when there are no contrary facts, he has the right to protect the author and ask the enforcement of the author’s right. This paragraph is not valid when the author discloses his identity and proves the claim on the work’s authorship.\n\nPresuming of the Producer’s Right\n\n28. The natural or juridical person, whose name appears on an audiovisual work as the producer of this work, will be considered the producer of such a work if there are no facts to contradict this.\n\nChapter VI  \nTransferring of the Rights and the Licenses\n\nTransferring of the Rights\n\n29. Transferring the economic rights can be done by assignment between the living people, by provisions of legal heritage or by will.\n\nMoral rights can not be transferred between living people, but can be transferred by provisions of legal heritage or by will.\n\nLicenses\n\n30. The author of a work may issue a license to third persons to perform activities which are included in his economic rights. These licenses may be exclusive or non-exclusive.\n\nThe non-exclusive license enables the licensee the right to perform activities related to the author and to other licensees according to the rules.\n\nExclusive license enables the licensee the right to perform activities which exclude others, even of the author itself, according to the rules.\n\nNo license can be considered as a non-exclusive one apart from cases when it is expressly defined in the contract between the licensee and the author.\n\nForm of Contracts for Transfers and Licenses\n\n31. Contracts for transferring the economic rights as well as the exclusive licenses, for performing activities included in the economic rights, are made in a written form.\n\nPurpose of Transfers and Licenses\n\n32. The transfer of the economic rights and licenses, for performing activities included in the economic rights, can be limited to the performance of some specific activities as well as to the time period, purpose, territorial extension, width and the ways and means of usage.\n\nThe fact that the name of the territory in which the economic rights are transferred or the license is given to act according to the economic rights, is not mentioned is considered as a limitation of the transfer or the license within the territory in which the transfer is made.\n\nThe fact that the extension, ways and means of usage for which the transfer of the economic rights is made or the license to act according to the economic rights is granted, is not mentioned, is considered a limitation of the transfer or the license to the extension, ways and means of usage, that are necessary for the provided purpose at the time when the right of transfer or the license is granted.\n\nThe Alienation of the Original Work or its Copies.  \nTransfers and Licenses Concerning the Copyright of these Works\n\n33. When the author alienates the original or a copy of his work, it is not considered that the economic rights and the grant of a license for performing activities included in the economic rights are transferred too, unless it is provided otherwise by the contract.\n\nDespite the first paragraph, the legitimate buyer of an original work or its copy, has the right to expose the original work or its copy directly to the public, unless the contract provides otherwise.\n\nThe privilege defined in the second paragraph does not include the persons who possess the original works or their copies because of a rent, lease or other ways, without being the owners of the original work or of its copy.\n\nChapter VII  \nProtection of Performances, Phonograms and Programmes\n\nActs Requiring the Authorization of the Performers\n\n34. No one can undertake the following acts without the authorization of the performers:\n\n(1) The broadcasting of their programmes, except for the cases when the programme consists of:\n\n(a) a fixation of the performance, excluding the registration done according to the provisions of Article 39;\n\n(b) a rebroadcasting authorized by the organization which has broadcasted the programme for the first time;\n\n(2) The communication to the public of their performance, except for the cases when this performance consists of:\n\n(a) the fixation of the programme;\n\n(b) the broadcasting of the performance.\n\n(3) The fixation of the unfixed performance\n\n(4) The reproduction of fixation of their performance in the following cases:\n\n(a) when the performance is fixed once without the authorization of the performers;\n\n(b) when the reproduction is done for purposes other than those authorized by the performers;\n\n(c) when the performance is first fixed in compliance with the provisions of Article 35, but the reproduction is done for purposes other than those defined in that article.\n\nIn case of absence of a contractual agreement that provides otherwise or of the employment condition, out of the which the contrary is deducted;\n\n(a) the authorization to broadcast does not mean authorization to great license to other organization to broadcast the performance;\n\n(b) the authorization for broadcasting does not mean authorization to fix the performance;\n\n(c) the authorization for the fixation of the performance and the reproduction of the fixation does not mean the authorization to broadcast the performance;\n\n(d) The authorization for broadcasting and fixing the performance does not mean authorization for reproduction and fixation.\n\nThe provisions of the first and second paragraph, letters ‘c’ and ‘d’ are not applicable from the moment that the performers give the authorization to include their performance in a visual and audiovisual fixation.\n\nNone of the paragraphs of this article takes off the right of the performers to sign contracts in more favorable conditions for their performances.\n\nThe term of protection provided for in the article lasts for 50 years, starting from the end of the year in which the performance took place\n\nActs Requiring the Authorization of the Producers of Phonograms\n\n35. Without the authorization of the producers of phonograms no one can;\n\n(a) reproduce directly or indirectly the phonogram;\n\n(b) import any copy of the phonogram;\n\n(c) lease or loan copy of the phonogram\n\nThe term of protection provided for in the first paragraph lasts for 50 years, starting from the end of the year, in which of the phonogram was produced for the first time.\n\nRemuneration for the Production of Phonograms\n\n36. If a phonogram published for commercial purposes, or its reproduction, is directly used for the broadcasting or the communication to the public, the user pays to the producer a remuneration, upon agreement, for the performers and the producers of the phonogram.\n\nIf there is no agreement between the performers and the producer, then the half of the remuneration the producer has been given, shall go to the performers by the producer.\n\nThe obligation for a remuneration, as provided in this article, ends up in 50 years, starting from the end of the year in which the phonogram was for the first time produced.\n\nActs Requiring the Authorization of the Broadcasting Organizations\n\n37. No one can undertake the following acts without the authorization of the broadcasting organizations:\n\n(1) The rebroadcasting of their programmes\n\n(2) The fixation of their programmes\n\n(3) Reproduction of the fixation of their programmes:\n\n(a) When the fixation on which bases a reproduction is done, is realized without the authorization of these organizations, or\n\n(b) When the broadcasting is firstly fixed in accordance with the provisions of Article 39, but the reproduction is done for other purposes from those mentioned in that article.\n\nAs provided in this Article, protection ends up in 50 years, starting from the end of the year, in which the broadcasting took place.\n\nLimitations on the Protection\n\n38. Articles 35, 36 and 37 of this law are not applied when acts provided by these articles are undertaken;\n\n(a) for private use, teaching or scientific research, on these condition that the use does not conflict with the normal use (of a performance, phonogram or broadcasting) and always without prejudice at a large scale to the legitimate interests of the holders of the rights provided in this chapter;\n\n(b) for issuing current topics, provided that only short pieces of a performance, phonogram or broadcast are used;\n\n(c) for citations, in short pieces from a performance, phonogram or broadcast, provided that these citations concur with the usual practice of the informatory purpose of these citations;\n\n(d) for other purposes which are included in the limitations for the economic rights of the literary and artistic works, as provided in Chapter III.\n\nRequirements for an authorization mentioned in the Articles 35, 36 and 37 to fix performances and broadcastings, to reproduce published phonograms for commercial purposes, are not taken into consideration when the reproduction is done by a broadcasting organization with its own means and for its own programmes only in case of:\n\n(a) broadcasting the fixation of a performance or of its reproduction, as defined by this paragraph, the broadcasting organization has the right to broadcast exactly this performance;\n\n(b) broadcasting the fixation of a program or its reproduction or such a fixation of a program made according to the conditions of this program, the broadcasting organization has the right to broadcast exactly this program;\n\n(c) a fixation, made according to this paragraph, or its reproduction, the fixation of any reproduction is destroyed within sixty days, except for a single copy which can be preserved only for archive purposes.\n\nSigns for the Protection of the Phonograms\n\n39. As a condition for the protection of the phonograms provided for by Articles 35, 36 of this law, all the copies of the published phonograms and their packages must bear the sign “P” (which must be circled), accompanied by the date and the year of the first publication, with the purpose of making known that it is a protected production. If the copies or their packages does not identify the producer or the buyer of the patent, by giving the name, the production mark or other notes, then the name of the holder of the rights of the productions must be included in the notes. When the copies or their packages do not identify the main performers, the notes then must include the name of the person who has the right of the authorship of these performers, as provided by this law.\n\nField of Application\n\n40. The protection of the performers as provided by Articles 35 and 36 of this law is applicable when:\n\n(a) the performer has the Albanian citizenship;\n\n(b) the performance took place in the territory of Albania;\n\n(c) the performance is fixed in a phonogram, which is included in the protection’s rights, as provided by the third paragraph;\n\n(d) the performance which is not registered in the phonogram, is included in a testament which enjoys the right of protection as provided by the third paragraph.\n\nThe protections of phonograms provided by Article 36 and 37 is applicable when:\n\n(a) the headquarters of the organization is in Albania;\n\n(b) the program is broadcasted by a station situated in Albania.\n\nThis law is applied also for performances, phonograms and programs which must be protected in accordance with the conventions on which Albania adheres.\n\nChapter VIII  \nThe Collective Administration of Copyright and Neighboring Rights\n\nThe Agencies for the Protection of Copyright\n\n41.5 The authors may protect their rights themselves. When they can not exercise these rights themselves, they have the right to found agencies for the protection of their rights in a collective way. The agencies of authors are private companies of partners which do not have commercial aims and operation of which is guided by a statute and the general regulations. The agencies are created according to the branches of art.\n\nActs which Regulate the Operation of the Agency\n\n42.6 The agencies operate in accordance with this law, other legal and sub-legal acts as well as with their own statutes and regulations approved by the Minister of Culture, Youth and Sports.\n\nAdmissions in the Agency\n\n43.7 The agencies accept for co-operation between all the branches of art all the authors, their heirs, producers of records, cassettes or films and those who bear the authorship.\n\nThe prerogative attributes of the agencies are determined by open voting in the General Assembly, which functions as defined by its own statute and general regulations, prepared by the agencies and approved by the Minister of Culture, Youth and Sports.\n\nSetting Tariffs\n\n44.8—(1) The tariffs for the users of the artistic property on the part of budgetary or non-budgetary institutions are regulated by Law No. 7581, dated 7.7.1992 “On Prices and Tariffs” or by contracts between the users and the collective agencies founded according to the branches of art.\n\nUsers of the intellectual property in the field of art and culture, budgetary or non-budgetary, within 15 December of each previous year are require to enter into contract with agencies of authors, to determine obligations of parties and tariffs that should be paid such agencies of authors for next year.\n\nThe use of literary works without contract and without the authorization of the agencies of authors is a infringement of copyright and entails penal responsibility.\n\n(2) Tariffs for distribution are set after discussions between authors and commissions and after approval by the administrative board of the agencies of authors.\n\nCriteria for Managing Revenues\n\n45.9 Agencies are required to manage strictly equally all rights provided to them. They respect the principle that any member should take his portion which belongs to him from the use of his work.\n\nSuch remuneration is distributed each year, each six or three months for each author or co-author.\n\nThe Minister of Culture, Youth and Sports supervises the agencies. The authorized representatives of the Minister attend the meetings of the agencies and intervene only in case of infringement of the normative acts that regulate their activity.\n\nFunctions of Agencies of Authors\n\n46.10 The agencies of authors have the following functions:\n\n(a) negotiate on the conditions and remuneration to be paid and issue authorizations for actions included in the exclusive economic rights administered by the agencies;\n\n(b) collect remuneration for the authorizations mentioned in item (a);\n\n(c) distribute collected remuneration to the authors;\n\n(d) carry out other activities, for which they are authorized by the authors as provided for by Article 48 on the exercising of the exclusive economic right that they administer.\n\nGuarantees for Running the Agencies of Authors\n\n47.11 The administration of the rights as provided by in the Article 46 must not restrict the exclusive economic rights administered by the agencies of authors. In order to guarantee and prevent such restrictions, all decisions for methods and rules of collecting and distributing remuneration, as well as for other important aspects of administrative actions of agencies are taken by authors who are protected by agencies.\n\nThe authors whose rights are administered by the agencies, are provided with regular, full, and detailed information on the activity of their agency, for exercising their rights.\n\nWithout the authorization of the authors, whose rights are administered directly or through their representatives, no remuneration collected by the agency of authors can be used for other purposes, except purposes relating to covering actual overhead cost of rights in question and distributing the remaining portion of remuneration after the cost mentioned above is deducted.\n\nThe amount of the remuneration collected by the agency of authors, after deduction of the actual overhead cost, profit tax according to the appropriate law and other possible deductions that the authors themselves authorize, is distributed to the authors in a just ratio with the actual use of their works.\n\nThe Common Administration of the Rights for Performances,  \nPhonograms and Programs\n\n48. The rights of performance, phonograms and programs mentioned in the Chapter VII (Articles 42 and 47) will be applied mutatis mutandis.\n\nPosition of Foreign Authors\n\n49. The works of the foreign authors are protected by the dispositions of this law and the international conventions to which the Republic of Albania adheres.\n\nChapter IX  \nMeasures and Sanctions in Case of Violation of the Rights Defined by this Law\n\n50. The authors or the persons who are enjoying their rights on a work according to this law are entitled to challenge at the court if they are hindered in exercising these rights or they record that someone else in using them unjustly.\n\nThe court considers the case on the basis of norms defined in this law and decides on the moral and economic rights of the work.\n\nAfter the challenge made by the agency of authors or by any of their associations against the person who has made use of the moral and economic rights of the work created in the sense of this law, the penal case starts according to the provisions defined in the Penal Code.\n\nThe penal case stops upon the request of the author of the work.\n\nChapter X  \nGeneral Provisions\n\nField of Application\n\n51.12 The provisions of this act refer to:\n\n(a) works of the authors who have Albanian citizenship or live permanently in Albania;\n\n(b) works which are published for the first time in Albania, in spite of the citizenship or the inhabiting place of the authors;\n\n(c) Intellectual property of art works, created before this law was approved, are used according to the dispositions determined by this law provided that the economic rights are fulfilled after the proposed changes have come into power.\n\nThis act is applicable to:\n\n(a) unpublished works or published for the first time in a foreign country from authors with foreign citizenship and with permanent residence in a foreign country, in the cases when the country where the author lives, or when the works are published, the country where they are published for the first time, offers the same protective measures for the authors with Albanian citizenship or living in Albania for their unpublished works or published for the first time in Albania;\n\n(b) works which will be protected in Albania in accordance with international conventions to which Albania adheres.\n\nSub-Legal Acts for the Implementation of the Law\n\n52. The Council of Ministers, the Ministry of Culture, Youth and Sports, the Committee of Science and Technique and the Ministry of Education are in charged to issue the instructions and the respective regulations to the implementation of this law.\n\n53. Article 315 up to 328 of the Civil Code of the Republic of Albania are repealed.\n\n54. This law becomes effective immediately.\n\nLaw No. 7564, dated 19.05.1992\n\nProclaimed by decree No. 192, dated 23.05.1992 of the President of the Republic of Albania, Sali Berisha.\n\n"
    },
    {
      "time": "22 May 2007 — 2:23pm",
      "content": "Get lostum promptus, stinkit lawyerum.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2007 — 2:41pm",
      "content": "Uli, there are some deep-seated beliefs people don't want challenged. Typeright is evidently one of them. Clive has a history of not getting the facts right. Wouldn't surprise me if he hangs out with a lawyer that makes mistakes.\n\n"
    },
    {
      "time": "22 May 2007 — 2:56pm",
      "content": "Uli:\n\nWhat do you want from us?\n\nWhy do you care about these topics?\n\nI ask because it seems you are completely uninvolved with type making, marketing or use, and it also seems that you have no regard for anyone who is involved. So I don't understand your basic motivation.\n\nBesides that, your strident, accusing tone and unrealistic and flawed logic make your posts unpleasant and pointless to read. Nobody needs the entire text of any country's copyright law posted here. Consider what Typophile is for, and whether your diatribes really have a place here.\n\nFor perspective, consider whether you would be satisfied to be involved in the film, garment, food, automotive, electronics or pharmaceutical industries, or in government. Do you imagine any of them to be pure, holy oases of moral rectitude? You do not have a right to expect perfect ethical consistency from the type industry, and you do not have a right to expect Typophile to support you or provide answers, especially when you have such vague goals, so little direct involvement, and such a bad attitude.\n\n"
    },
    {
      "time": "22 May 2007 — 11:24pm",
      "content": "You really are a cutie. Let's keep on ignoring other people's points, since they are uncomfortably true, and let's just go on harping about something nobody cares about.\n\nYou just don't get it, so let me put it simple: This is not about the shady lawyer's website anymore. It is about YOU and your inacceptible behaviour! This is no way to post things, especially when we're talking about accusations!\n\n1. You claim somebody is a blatant liar  \n2. When asked if you have proof for such a harsh accusation, you state that you do NOT have proof, and furthermore that YOU DO NOT NEED PROOF! You are elligible to call anyone a blatant liar because YOU think or imagine that this is so.  \n3. When pressed hard, you finally start your first efforts to prove your point, still insisting on the fact that you can call someone a blatant liar in public without a shred of proof, although you claim that you COULD prove it, although you STILL haven't done so.  \n4. Since impressing people with Latin did not work, you post a long legal text in the hope of making people shut up. Since the text is from 1992 and covers just one country, no one is impressed.\n\nIt is your way of arguing which is sickening. Let me just turn this around:\n\n1. I call you a blatant liar because of something you say on your website.  \n2. When challenged, I say it is not my job to prove it.\n\nWould you like it? WOULD YOU LIKE IT? And I am quite sure I can prove it, I just have to browse through your website and then do a little research, but actually, why should I, when it is so much more comfortable to simply claim it BECAUSE I FEEL LIKE IT?! Hey, you are a shady liar! A blatant forger! Wow, that felt good! And furthermore, you have freckles and talk with a Danish accent. And wasn't that you I saw with this prostitute last night? PROOF? Sheesh, who needs it?\n\nDo you really REALLY think you are such a great chap when you walk around claiming things without really knowing? Do you know how these people are called?\n\nAnd one more thing, you despicable Mr. Righteous:\n\n\"due to his blindness, he could not read the copyright laws of the 162 foreign Berne convention states\"\n\nis a way of arguing which will definitely cause you to get hurt, should I ever meet you. So blind people cannot do their job because they cannot read anything. Can you hear yourself talking? HELLO?? HELLOOOO? ANYBODY HOME? Stop ignoring that your way of arguing is\n\na. wrong  \nb. not acceptable to anyone I know  \nc. probably not even acceptable to yourself, should anyone use this method on you\n\nIf I were a mod here, and you should thank god that I'm not, I would delete each and every post from you which claims something and insults somebody without being able to prove it.\n\nPlease, go away. No one wants to talk to you here. Learn how to argue properly. Don't come back until you've learnt it.\n\n"
    },
    {
      "time": "23 May 2007 — 12:40am",
      "content": "In view of the pathological hatred of this Pike Werfer, Members of Congress in Washington receiving this bizarre petition ( [www.typeright.org/petition.html](http://web.archive.org/web/20150124161309/http:/www.typeright.org/petition.html \"www.typeright.org/petition.html\")) containing the blatant lie \"that copyright laws in most developed countries provide protection for the typeface designer\" should watch out that they do not get harmed by aggressive petitioners.\n\n"
    },
    {
      "time": "23 May 2007 — 2:31am",
      "content": "I see what the other guys mean.... it is useless talking to you. You do not even consider that you might have done something wrong, do not take into consideration any point brought up in a discussion, but simply go on rambling, feeling mighty grand. Blahblahblah.\n\nOne last try, before I give up on you!\n\nWhat about:\n\n1. I accuse someone, but I do not have proof. Is this okay?  \n2. I claim blind people are not being able to read. Is this ethical?  \n3. I call something a blatant lie, but actually don't know, but just assume. Is this correct?  \n4. I state that something published on a website is a binding fact, referring to onus probandi, although websites by their nature are in no legal way bound to give facts, and the legal phrase of onus probandi does not apply here. Am I doing the right thing?  \n5. When people oppose me, I ignore their objections, such as the above questions, but keep on repeating my point, trying to find ways out of the argument, which I de facto lost. Am I a nice person?  \n6. You post things on a forum. The majority of community members tell you to stop doing it, because they either don't believe you, don't care what you write about, or don't like the way you write it. Should you ignore them and go on annoying them, or should you reconsider?  \n7. You have nothing to do with type, and many people here, renowned designers and type specialists, have told you to get some education before talking about something you do not fully understand. Should you ignore them, or could they maybe have a point?  \n8. You state that you publish all this stuff so that prosecutors can use it to bring these blatant cases before the courts. Has this ever happened? If not, could you think of a reason? Are all those prosecutors lazy - or maybe, just a slight possibility, could it be that they think your wrong?\n\nPlease answer each question, using the according number.\n\nOh and .... I don't feel any pathological hatred. I pity you. You must have a boring life. It's too bad you picked our scene to hanf around. I think the shady forgers in the motorcycle scene are nice, too. Go and tell those Honda bikers over there that it is a blatant lie that their bike is an original - it is a forged Harley!! Go tell 'em. :-)\n\nHmmm.... somehow I begin to get an idea why Uli decided to wreck the nerves of us type people. We are just too nice. We need some type hooligans :-))\n\n"
    },
    {
      "time": "23 May 2007 — 6:31am",
      "content": "Yes, single lines of ridicule are already more attention than this warrants.\n\nhhp\n\n"
    },
    {
      "time": "23 May 2007 — 7:16am",
      "content": "I received a cryptic email from Mr. DuBoff. It seems that he wants to deny that he has been the General Counsel of Typeright for the past ten years and that he wants to attribute the legal statements made at this website to others.\n\n(For the term of \"General Counsel\" see a legal dictionary, or see Wikipedia, etc.)\n\n"
    },
    {
      "time": "23 May 2007 — 5:18pm",
      "content": "Clearly we are being too delicate here. The real message, Uli, is:\n\nYou and your paranoid obsessions are not interesting. They are boring. I don't care about inaccuracies in old websites, and you have no point or purpose. Please shut up.\n\n"
    },
    {
      "time": "23 May 2007 — 5:39pm",
      "content": "The real words are _We all invoke [The Silence Brigade](http://web.archive.org/web/20150124161309/http:/typophile.com/wiki/The%20Silence%20Brigade)._\n\n"
    },
    {
      "time": "24 May 2007 — 12:36am",
      "content": "@Linda - that is SO cool!! Thanks for pointing this out to me :-) Since Uli is not willing to answer my questions (since he is intelligent enough to know that this would embarrass him greatly), I think this is a nice method of getting rid of trolls.\n\nI invoke The Silence Brigade!\n\n"
    },
    {
      "time": "24 May 2007 — 9:41am",
      "content": "The only problem with invoking [The Silence Brigade](http://web.archive.org/web/20150124161309/http:/typophile.com/wiki/The%20Silence%20Brigade) is that I highly doubt any of us, when we were young, or even still, could win a game of \"Who can be quiet the longest?\". ;^)\n\n"
    },
    {
      "time": "24 May 2007 — 9:49am",
      "content": "Plus, it's the opposite effect that I want.\n\n"
    },
    {
      "time": "24 May 2007 — 3:04pm",
      "content": "But it's worth a try, Tiff: even a brief reduction in the vitriol level would be an improvement.... Some people don't seem to realize that screaming (on both sides) is not terribly effective.\n\nAnd you're quite welcome, Pike. ;-)\n\n"
    },
    {
      "time": "25 May 2007 — 7:22am",
      "content": "pettyfogging! I just learned a new word!\n\n"
    },
    {
      "time": "25 May 2007 — 4:09pm",
      "content": "Maybe if we just keep talking about it we will drown out the other stuff. :^P\n\n"
    },
    {
      "time": "31 May 2007 — 1:01am",
      "content": "@Linda - you deserve a bow. :-)\n\nAnd pettyfogging is a nice one.... :-)\n\n"
    },
    {
      "time": "19 Aug 2007 — 10:05pm",
      "content": "Mexican law doesnt contain provisions that typeface designs are copyrighted.\n\n"
    },
    {
      "time": "19 Aug 2007 — 10:24pm",
      "content": "My point of view about you guys: Werfer es un elitista sangron que bien puede vivir a diario arrpoado de mentiras, utilizandolas, viendolas como algo \"normal\" mientras que Uli se desgañita defendiendo la verdad (o sea, atacando la mentira) sin que tenga eco en este ambiente groseramente individualista y envidioso. And as you are so, but so well read, well I guess I don't need to translate.\n\n"
    },
    {
      "time": "23 Dec 2007 — 7:14pm",
      "content": "The Berne Convention provides, in Article 2, that \"[t]he expression 'literary and artistic works' shall include every production in the literary, scientific and artistic domain, whatever may be the mode or form of its expression\" and that \"[t]he works ... shall enjoy protection \"in all countries of the Union.\" While typefaces are not specifically included in the \\*examples\\* of protected works, neither are they specifically excluded.\n\nI certainly do not consider myself a legal expert but Leonard DuBoff is. He been highly respected in the field for some 30 years and I have personally known him for more than 20 years. The suggestion that Mr. DuBoff is a \"shady lobbyist\" is without merit, as is calling him a \"shady lawyer.\" While he has testified before Congress (in favor of the adoption of the Visual Artists Rights Act long before a weak version was adopted), he is not a lobbyist, nor is he shady. (Perhaps Uli should be reminded that casting aspersions on one's character, especially in relationship to the subject's profession, is defamatory.)\n\nAs to Mr. DuBoff's \"cryptic email,\" I suspect that his response was no more puzzling than the correspondence he received. If he denies being TypeRight's General Counsel for the past 10 years, then he hasn't been. Further, Mr. DuBoff is not responsible for the content of TypeRight's website (if he were, would he list an out-of-date weblink for himself)?\n\nIt is true that Leonard cannot see a typeface. Further, contrary to Uli's assertion, he cannot read Braille. Braille is a two-handed language and, sadly, the chemical explosion that robbed Leonard of his sight also took one of his hands. The accident did not, however, deprive him of his fine mind and remarkable memory. Leonard remembers color and form, and can describe in detail every piece of art in his office and home, regardless of the medium, 2-D or 3-D. Before the accident, Leonard had been a Marine, an engineer and an artist. After his recovery, he attended law school, graduating summa cum laude. Leonard was one of the founders of the legal specialty of art law, writing the first textbook on the subject (The Desk Book of Art Law) more than 20 years and several related works. He has authored more than 30 books on legal subjects, for lawyers, professionals and consumers.\n\nI do not think that Leonard is infallible (any more than I or any of you) but I suggest that Uli not believe everything he reads (or thinks).\n\n"
    },
    {
      "time": "3 Jan 2008 — 3:10am",
      "content": "@Playground\\_Girl - it was I who assumed that Mr. DuBoff - being a blind man - would probably be reading Braille, since all of my blind friends do so. I did not know about his hand. However, I am quite sure that he nevertheless has his means to \"read\" a text, using something like ViaVoice.\n\nUli simply denies that blind people have the capability of reading, i.e. understanding things which are not communicated orally, which slightly (!) infuriated me.\n\nI do not know Mr. DuBoff, but I principally do not like the accusation of blind people being \"inferior\" to people who are lucky enough to have sight.\n\n"
    },
    {
      "time": "3 Jan 2008 — 9:49am",
      "content": "On the 1st of January, 2008, the administrator of the [www.typeright.org](http://web.archive.org/web/20150124161309/http:/www.typeright.org/ \"www.typeright.org\") website updated the \"copyright\" notice from \"1997-2007\" to \"1997-2008\" as follows:\n\n**\"Copyright ©1997-2008 by TypeRight. All rights reserved.\"**\n\nHowever, a few lines above this \"copyright\" notice, the statement\n\n**\"Leonard DuBoff, General Counsel\"**\n\nwas NOT removed by the administrator of the TypeRight website.\n\nI think the \"Playground Girl\" is barking up the wrong tree:\n\nIf it were true that Leonard DuBoff has never been the \"General Counsel\" of this TypeRight website since 1997, why has Leonard DuBoff never objected to being declared as the \"General Counsel\" of this TypeRight website during the past 10 years (1997-2008)?\n\nWhy has Leonard DuBoff never sued this TypeRight website to remove this so-called \"false declaration\" during the past 10 years?\n\nWhy does the above \"Playground Girl\" not request the administrator of [www.typeright.org](http://web.archive.org/web/20150124161309/http:/www.typeright.org/ \"www.typeright.org\") to declare at this TypeRight website that the \"General Counsel: Leonard DuBoff\" declaration has always been a \"false declaration\" during the past 10 years?\n\n"
    }
  ]
}
