{
  "id": "33858",
  "title": "Danalink",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello again,\n\nI’m making a logo for a company that imports and sells hearing aids, they sell other hearing equipment also but their main focus are hearing aids. The name Danalink comes from Denmark (Dana) from where they import their porducts and “link” as a ink between Denmark and Finalnd, where the company is based. Target group is elderly people from 60 years old and upwards.\n\nThey wanted a simple and humanist logo.\n\nThe sketches I’ve made so far are mainly my thoughts around a symbol. haven’t thought much about the color or type yet, although DIN looks pretty nice.\n\nI’m kinda stuck on the shape of a hearing aid and soundwaves at the moment. Any more ideas or suggestions would be greatly appreciated.\n\nThat’s their old logo [http://danalink.tulilla.fi/palkit/bsi/Danalink\\_logo\\_harmaalla.gif](http://web.archive.org/web/20071020200239/http:/danalink.tulilla.fi/palkit/bsi/Danalink_logo_harmaalla.gif \"http://danalink.tulilla.fi/palkit/bsi/Danalink\\_logo\\_harmaalla.gif\") a friend pointed out that it kinda looks like a smiling penis :)\n\nPeter\n\n**EDIT:** made another version\n\n| Attachment | Size |\n| --- | --- |\n| [danalink\\_logo\\_comp.jpg](http://web.archive.org/web/20071020200239/http:/typophile.com/files/danalink_logo_comp.jpg) | 113.96 KB |\n| [danalink\\_logo\\_ex6.jpg](http://web.archive.org/web/20071020200239/http:/typophile.com/files/danalink_logo_ex6.jpg) | 34.53 KB |\n\n [‹ Logo for Myself - wedding photography](http://web.archive.org/web/20071020200239/http:/typophile.com/node/36542 \"Go to previous forum topic\") [Handwritten Logo Critique ›](http://web.archive.org/web/20071020200239/http:/typophile.com/node/36449 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071020200239/http://typophile.com/user/17519\" title=\"View user profile.\">kattttor</a>",
  "time": "<br>",
  "uid": "17519",
  "comments": [
    {
      "time": " 17.May.2007 2.55pm",
      "content": "How bout if the soundwave slowly turn into a stylized ear, like an outline with some subtle details showing the earlobe. You might want to consider using bold DIN to make it easier to read or track out Danalink.\n\nIt’s a nice start, lets see some more ideas.\n\n"
    },
    {
      "time": " 17.May.2007 3.17pm",
      "content": "An ear is my next attempt, looked up some images of ears last week but I haven’t got anything good out of it yet. I’ll have to try your idea and see what comes out of it, thanks.\n\nThe DIN that I have don’t go any bolder than that. I’ll see if I can find another version, or change some settings in illustrator, I’ll change some font setting in illustartor and see if i can get a bolder version.\n\n"
    },
    {
      "time": " 17.May.2007 3.31pm",
      "content": "The ’D’ in your logo has the potential to become an ear.\n\n- Lex\n\n"
    },
    {
      "time": " 18.May.2007 1.15pm",
      "content": "<cite>The ‘D’ in your logo has the potential to become an ear.</cite>\n\nTrue, but it’ll be facing the wrong way.\n\nI think the symbol 5 in your sketch already sufficiently resembles an ear — maybe even more if further tweaked.\n\nIn any case, you need to adjust the kerning of the letters, it looks terrible right now.\n\n"
    },
    {
      "time": " 19.May.2007 10.34am",
      "content": "i thought one of your sketches might be the soundwave things becoming a D\n\n"
    },
    {
      "time": " 23.May.2007 5.57am",
      "content": "Your post made me immediately think of the Massachusetts Eye and Ear Infirmary logo that I pass everyday. I think it’s one of the nicer and more imaginative medical logos I’ve seen.\n\n ![](http://web.archive.org/web/20071020200239im_/http:/typophile.com/files/mass_eye_and_ear_4620.gif)\n\n"
    },
    {
      "time": " 7.Jun.2007 4.40pm",
      "content": "I’m going to send three of the six versions to the client, they want a progress report of sorts. I’m gonna send versions of 2, 3 and 4 for them to look at.\n\nThat logo that Scott posted of Massachusetts Eye and Ear Infirmary is a cool concept. I started thinking that maybe I should make something with an element that makes sound instead of an ear, hearing aid or sound waves.\n\nMaybe water and wind. A three that has some leaves that blows away. That would be more humanist. Right now I feel that what I made is a little too cold and technical.\n\npeter\n\n"
    },
    {
      "time": " 27.Jul.2007 1.56pm",
      "content": "7 weeks since my last update.\n\nThis is what happens when you try and hold 5 jobs simultaneously.\n\nI think I got my color palette at least.\n\nScrapped the sound waves. Now theres a D evolving to an ear. The little D also serves as the inner ear where the small plastic part of the hearing aid goes. I think it’s a fairly solid idea that the client will like. Having some problems with the symbol, doesn’t look right and I can’t see why at the moment, been staring at this version for a while now.\n\nFound a type that I really like, Bliss.\n\nI like it to have this effect depending on where you look you’ll either see a D or an ear.\n\nFeedback always welcome.  \nPeter\n\n ![](http://web.archive.org/web/20071020200239im_/http:/typophile.com/files/danalink_logo_v7_4635.jpg)\n\n"
    },
    {
      "time": " 27.Jul.2007 6.07pm",
      "content": "I really like this.\n\nThe swooshes, especially the orange one, get a little thin in the southeast corner. Otherwise, I think it works very well. Somehow the ’l’ looks a little dark, but this could just be caused by the small size of the graphic. Maybe open up the kerning by a pixel or two between ’al’.\n\n- Lex\n\n"
    },
    {
      "time": " 28.Jul.2007 12.53am",
      "content": "I like it a lot. But the ear ending doesn’t seem right. It just ends.\n\nBoth of your arcs are thinner in the middle of the arc (south east)... Maybe correct that. It’s more visible with the orange one that the yellow one.\n\nI like the font a lot. “l” does seem a bit darker but I wouldn’t change kerning. I’d rather change the letter “l” itself to be just a straight line. Because you have a strange word looking like Danal-ink...\n\n"
    },
    {
      "time": " 28.Jul.2007 5.11am",
      "content": "thanks,\n\nOne of the reasons I picked Bliss is because of the l. The same kind of l that you find in DIN but the rest of the letters are softer. I haven’t actually kerned this yet manually, going to do that later and try to increase the space between the a and the l. I think that l gives it a more humanist touch then a straight one.\n\nThe ear needs work. Started thinking that maybe it should have a straighter line from the top to the D, going to try that and see how it looks.\n\nAlso maybe adding a rounder shape to the end of the yellow line. So it would resemble an ear a little more and not end so abruptly.\n\nGoing to fix the arches.\n\nAlso going to try and add a gradient to the ear.\n\npeter\n\n"
    },
    {
      "time": " 31.Jul.2007 6.17pm",
      "content": "So now I have to versions.\n\nRight now I like number 1 the most. They wanted a more modern version then the old one and I think that 2 is too static.\n\nMade some changes in the type.\n\nI’m going to remove the shadow on the ear. make the bottom part of the biggest swoosh rounder, like in 1. Try some gradients and strokes and see if I can keep the 3D feel without the shadow.\n\n ![](http://web.archive.org/web/20071020200239im_/http:/typophile.com/files/danalink_logo_v8_4612.jpg)\n\n"
    },
    {
      "time": " 1.Aug.2007 3.37am",
      "content": "The bottom one has some improvements to the previous version but it doesn’t work for me. The #1 looks nice, but it has too much dimension. I’d make the inner ear “D” the same slant as the italics in type. The distance between the lines is too big.\n\n"
    },
    {
      "time": " 1.Aug.2007 10.00am",
      "content": "updated.\n\nI’m not 100% on this yet. I don’t know what it’s missing.\n\n ![](http://web.archive.org/web/20071020200239im_/http:/typophile.com/files/danalink_logo_v9_5582.jpg)\n\n"
    },
    {
      "time": " 1.Aug.2007 10.06am",
      "content": "Also I started thinking that they might see this as an infected ear with the inner ear (D) being red.\n\n"
    },
    {
      "time": " 1.Aug.2007 10.29am",
      "content": "I’m particular to the last set of redos. I like #2 over #1. I think when you “laid the ear down” for the more dimensional version, you lost a lot of the characteristics that make it seem “ear like”. Such as the “lobe” at the bottom and the more recognizable shape of an ear.\n\nI’ll agree, that red mark could be seen as an infection. How bout changing it to purple to compliment the purple used in the word mark.\n\n<cite>I’d make the inner ear “D” the same slant as the italics in type.</cite> Robert is on to something there as well. Repetition never hurts a design, and if line angles are consistent they’ll amplify instead of compete.\n\nAll in all, it’s a major improvement over the original comps.\n\n"
    },
    {
      "time": " 1.Aug.2007 1.29pm",
      "content": "I think 1 is too obvious. I sent the latest version to some people and 3 out of 4 saw an ear.\n\nI think I’ll put more effort into the dimensional version. Change the red and make some other tweaks.\n\npeter\n\n"
    },
    {
      "time": " 1.Aug.2007 1.38pm",
      "content": "Maybe lower the dimension a little bit more...\n\nI can see you adjusted the slant, nut since the curve of the inner ear is different to “D” they don’t complement the slant. You’ll have to either change that a bit and in the end visually adjust the match.\n\nAbout the colours. You can put purple as Asvetic suggested or change to something else. But if you’ll choose something else, you’ll probably have to change type colour too.\n\n"
    },
    {
      "time": " 3.Aug.2007 11.02am",
      "content": "Maybe you could put some sort of a lobe onto the end of the orange and yellow swipe? I’m afraid I can’t further that idea, but you’re right... It just sort of ends abruptly without something there.\n\nWhat if you put the whole thing in a rectangle with rounded corners or something? Make it a stamp, almost, instead of a mark. That way it’ll be more self-contained and easier to use as a graphic.\n\n-Andrew Welfle\n\n"
    },
    {
      "time": " 12.Aug.2007 4.14pm",
      "content": "Ok some more changes.\n\nOne problem that I have now is that the two lines melt together when you go really small. Then it looses it’s original shape but I’m thinking that at such a small size it doesn’t really matter anyway. It will be ok at use for a website and it will probably pass on a business card as well.\n\nI think I will show this version to the client. Kinda nervous because this is the first logo I’m actually getting paid for.\n\nFeedback appreciated.\n\n ![](http://web.archive.org/web/20071020200239im_/http:/typophile.com/files/danalink_logo_v10_5844.2.jpg)\n\npeter\n\n"
    },
    {
      "time": " 11.Sep.2007 4.01pm",
      "content": "the client wanted different colors so I sent some examples. The graphic is also updated.\n\n ![](http://web.archive.org/web/20071020200239im_/http:/typophile.com/files/danalink_logo_comp3_6588.jpg)\n\n"
    }
  ]
}
