{
  "id": "33859",
  "title": "Teaspoon display face",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is just a small personal project loosely based on a version of gill sans extra bold I did for a project in college.  \nIt's no where near finished, but I wanted to get some feedback before continuing.\n\nThank you :)\n\n| Attachment | Size |\n| --- | --- |\n| [teaspoon1.jpg](http://web.archive.org/web/20150416165844/http:/typophile.com/files/teaspoon1.jpg) | 137.02 KB |\n\n",
  "author": "HaleyFiege",
  "time": "17 May 2007 — 3:17pm",
  "uid": "17709",
  "comments": [
    {
      "time": "17 May 2007 — 3:36pm",
      "content": "This is adorable.\n\n"
    },
    {
      "time": "17 May 2007 — 4:30pm",
      "content": "Tiff is right. It is.\n\nMy comments: I would like to a see a small impression on the left top of the t - that would be even more adorable. The s Seems to be the most sober character and it stand s of slighly. It's nice - don't get me wrong, I am just not sure it fits 100% with the others. The f is my favorite. It is super duper.\n\n"
    },
    {
      "time": "23 May 2007 — 1:50pm",
      "content": "yummy\n\n"
    },
    {
      "time": "23 May 2007 — 2:04pm",
      "content": "i would think that you would want the [counter](http://web.archive.org/web/20150416165844/http:/typophile.com/wiki/counter) of the 'o' to visually equal the counter of the other letters with a round: b,d,p,q. it popped out at me as odd that the o's are darker when i read the word \"teaspoon.\"\n\n"
    },
    {
      "time": "23 May 2007 — 6:30pm",
      "content": "Yeah, I think paul is right.\n\n"
    },
    {
      "time": "29 May 2007 — 6:34am",
      "content": "Thanks! Here is an updated version.\n\n ![](http://web.archive.org/web/20150416165844im_/http:/typophile.com/files/teaspoonv3_3562.jpg)\n\n"
    },
    {
      "time": "29 May 2007 — 6:53am",
      "content": "can we see some words or lines set in your typeface?\n\n"
    },
    {
      "time": "29 May 2007 — 10:06am",
      "content": "The lc\\_s seems a little funky, the lc\\_y too wide, the lc\\_x too small...\n\nStill really cute though. I agree with Paul. Can you show us some samples?\n\n"
    },
    {
      "time": "29 May 2007 — 2:23pm",
      "content": "Yes, The 's' could have a bit more weight to fit. And you could peel off a little weight in some of the other glyphs to give them just a little more expression. Not lots; but just enough to help the letters into a cohesive team and to heighten expression. I think the e for instance might help you make a better c. What about a slightly deeper cut under the ball on the lc r? I also echo Paul. And It is still tasty!\n\n( edited for clarity )\n\n"
    },
    {
      "time": "29 May 2007 — 4:37pm",
      "content": "Thanks I'm going to make some more changes right now. Here are some words.\n\n ![](http://web.archive.org/web/20150416165844im_/http:/typophile.com/files/teaspoontest4_5779.jpg)\n\n"
    },
    {
      "time": "29 May 2007 — 7:16pm",
      "content": "Wow. Now you really see which letters stand out from the rest. Those 'els' (l) are way too heavy huh? The a is holding up pretty well - but I am starting to wonder about a wider opening - and maybe a less tall one. The d needs to be less heavy too -in the bowl & the ascender. I would looks for ways to make the u less like a reversed & flipped n. The big surpise though is the 't'. It is really not fitting. That would be my suggestion as job #1.\n\nCheers!\n\n"
    },
    {
      "time": "7 Jul 2007 — 8:03am",
      "content": "God, I really lòve it!!!\n\n"
    },
    {
      "time": "7 Jul 2007 — 10:42am",
      "content": "Me, too! Very cute. :-)\n\nNow, does anybody else think the **s** could use some adjusting? To me, it feels like it should be a wee bit darker or thicker, perhaps by modifying the interior curves.\n\n"
    },
    {
      "time": "7 Jul 2007 — 10:48am",
      "content": "i'd like to see heavier terminals on the s, so that it harmonizes better with the a.\n\n"
    },
    {
      "time": "7 Jul 2007 — 10:55am",
      "content": "You've got very cute letter forms, but they aren't in balance with one another yet.\n\nThe middle of the s is normally thicker rather than thinner than the bends. I don't know how best to fix it, but as others say, it needs fixing. Are your vertical arches thicker than your vertical stems? They usually need to be thicker to look balanced with the stems.\n\n"
    },
    {
      "time": "7 Jul 2007 — 12:36pm",
      "content": "\\> The middle of the s is normally thicker  \n\\> rather than thinner than the bends.\n\nConvenionally yes, but sometimes\\* making the curves  \nthicker clicks, and I think that's very much the case here.\n\n\\* See Excoffon's work, as well as some of Goudy's IIRC.\n\nhhp\n\n"
    },
    {
      "time": "7 Jul 2007 — 5:44pm",
      "content": "What Paul said\n\nSee also the obvious: Cooper black.\n\n[http://www.myfonts.com/fonts/linotype/cooper-black/](http://web.archive.org/web/20150416165844/http:/www.myfonts.com/fonts/linotype/cooper-black/ \"http://www.myfonts.com/fonts/linotype/cooper-black/\")\n\nAnd maybe as an alternative JP's\n\n[http://www.typofonderie.com/alphabets/try/CostaPTF](http://web.archive.org/web/20150416165844/http:/www.typofonderie.com/alphabets/try/CostaPTF \"http://www.typofonderie.com/alphabets/try/CostaPTF\")  \n [http://www.typofonderie.com/alphabets/try/ParisinePTFSombre](http://web.archive.org/web/20150416165844/http:/www.typofonderie.com/alphabets/try/ParisinePTFSombre \"http://www.typofonderie.com/alphabets/try/ParisinePTFSombre\")\n\nTry sketching with a pencil too maybe...\n\n"
    },
    {
      "time": "10 Jul 2007 — 12:16pm",
      "content": "Thanks so much everyone.  \nTeaspoon was snatched up by a Toronto based ad agency for some ads:  \n [http://www.kingdomofawesome.com/images/hurryup.jpg](http://web.archive.org/web/20150416165844/http:/www.kingdomofawesome.com/images/hurryup.jpg \"http://www.kingdomofawesome.com/images/hurryup.jpg\")\n\nI think I'll probably take a break from it for awile. In the meantime I put it up for free download on my website.\n\nHere is the for now final version.\n\n ![](http://web.archive.org/web/20150416165844im_/http:/typophile.com/files/teaspoonfinal_3428.jpg)\n\n"
    },
    {
      "time": "10 Jul 2007 — 6:53pm",
      "content": "Congradulations!\n\n"
    },
    {
      "time": "19 Jul 2007 — 4:29am",
      "content": "sweet. cooper black's little brother.\n\n\\_\\_\\_\\_\\_  \n [www.choppingblock.com](http://web.archive.org/web/20150416165844/http:/www.choppingblock.com/ \"www.choppingblock.com\")  \n [www.chopshopstore.com](http://web.archive.org/web/20150416165844/http:/www.chopshopstore.com/ \"www.chopshopstore.com\")  \n [www.wanderingspace.net](http://web.archive.org/web/20150416165844/http:/www.wanderingspace.net/ \"www.wanderingspace.net\")  \n [www.grodzki.com](http://web.archive.org/web/20150416165844/http:/www.grodzki.com/ \"www.grodzki.com\")\n\n"
    },
    {
      "time": "19 Jul 2007 — 4:29am",
      "content": "where does one buy that?\n\n"
    },
    {
      "time": "19 Jul 2007 — 9:25am",
      "content": "What a fun face! Thanks so much for sharing it!\n\n"
    },
    {
      "time": "6 Aug 2007 — 1:28am",
      "content": "Excellent work, Haley, but I am curious. How old are you, and how many more fonts do you have in your head?\n\n"
    },
    {
      "time": "6 Aug 2007 — 2:26am",
      "content": "Hey Haley,\n\nI love your font, but due to an enormous technological delay (don't laugh, but I'm still working on a G3 clam iBook running on OS 9.1), I'm not able to view your site, let alone download teaspoon & I'd really love a copy of it. It makes a nice alternative to Cooper Black, so I'd love to add it to my font collection. Could you contact me at [aspronaut@gmail.com](mailto:aspronaut@gmail.com) so we can work something out? Thanks in advance!\n\n"
    },
    {
      "time": "13 Aug 2007 — 10:05pm",
      "content": "Thanks for the font, Haley. That's very generous of you. I think I'll find some good uses for it.\n\nSharon\n\n"
    },
    {
      "time": "14 Aug 2007 — 1:06am",
      "content": "I think it's pretty safe to say we're all in love with it... And the fact that you distribute it for free is indeed very generous (especially considering that with most free fonts you also get what you \"pay\" for ;-p ). It's indeed a very generous & great gift for all typelovers!\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:39am",
      "content": "Haley, I just realized you were giving the font away and downloaded it -- thanks so much!\n\n"
    },
    {
      "time": "22 Aug 2007 — 4:44am",
      "content": "Thank you for the delicious font! Now don't keep giving them away for free - or maybe just for forum members ;-)\n\n"
    },
    {
      "time": "18 Sep 2007 — 3:33pm",
      "content": "Thanks Haley! Cooper Black has always been my guilty pleasure, now it has a Hello Kitty loving friend.\n\n"
    },
    {
      "time": "18 Sep 2007 — 9:48pm",
      "content": "Thanks!\n\n ![](http://web.archive.org/web/20150416165844im_/http:/typophile.com/files/teaspoonbait_5921.gif)\n\n"
    },
    {
      "time": "23 Sep 2007 — 12:30pm",
      "content": "Thanks love the font it reminds me of mr men for some reason\n\n"
    },
    {
      "time": "25 Sep 2007 — 10:26am",
      "content": "Yay! Thank you for all the comments everyone :) Someone asked how old i am... only 22. I am the baby of typophile I think.\n\nFor those who can't view the site - you can download it at [http://www.kingdomofawesome.com/teaspoon.zip](http://web.archive.org/web/20150416165844/http:/www.kingdomofawesome.com/teaspoon.zip \"http://www.kingdomofawesome.com/teaspoon.zip\")\n\n"
    },
    {
      "time": "25 Sep 2007 — 10:27am",
      "content": "ps fontplayer you are hilarious.\n\n"
    },
    {
      "time": "25 Sep 2007 — 10:30am",
      "content": "Hehe, the baby of Typophile. Well, I'm only 23. ;)\n\n"
    },
    {
      "time": "25 Sep 2007 — 8:40pm",
      "content": "Really?! It's so hard to judge ages on here.\n\nI'm 22 but I have a degree and a salary!\n\n"
    },
    {
      "time": "26 Sep 2007 — 4:15am",
      "content": "Yeah, really. :)\n\nAnd it's indeed hard to judge ages on here. But thats positive,  \nbecause no one _is_ judged on their age.\n\n"
    },
    {
      "time": "26 Sep 2007 — 8:08am",
      "content": "Well, I just turned 29, have NO degree (trust me, fontwise it definitely shows) & I'm working for a minimum wage... Just goes to show ;-)  \nBTW, Quincunx, is your avatar a custom font? I simply love it!\n\n"
    },
    {
      "time": "26 Sep 2007 — 8:46am",
      "content": "It's a heavily customized sans. I don't remember exactly which one, a very generic one anyway. I wanted characters that were as heavy as possible, so I had to do it myself.\n\n"
    },
    {
      "time": "26 Sep 2007 — 9:02am",
      "content": "Well, let me be the first to say: a job well done!  \nAny chances you'll be making an entire alphabet? It kind of reminds me of those rulers with stencil letters & I just lóve those!\n\n"
    },
    {
      "time": "26 Sep 2007 — 11:25am",
      "content": "Thanks. :)  \nI would like to, but since it's based on a typeface, I'm not sure if I should.  \nWell, I think I can draw it from scratch, using the shapes only as guide, instead of basing it on them. Then it would be ok... I will look in to that. :)\n\n"
    },
    {
      "time": "27 Sep 2007 — 8:17am",
      "content": "I've been told that if you re-draw the characters by hand and scan them in it'll be different enough than the original.  \nI love the fat fonts.\n\n"
    },
    {
      "time": "27 Sep 2007 — 11:39am",
      "content": "Even so, there's a lot of \"customising\" going on in design; best example (at least from the top of my head): the customised Century Schoolbook for Ikea. I can't really think of any others right now, but I knów there's a lot of them. As far as selling the font afterwards as being your own creation, that's a different question, but you might want to contact Eduardo Recife from [www.misprintedtype.com/](http://web.archive.org/web/20150416165844/http:/www.misprintedtype.com/ \"www.misprintedtype.com/\") for information. He practically doesn't do anything but mixing and messing up existing fonts ;-) Don't get me wrong, I absolutely love his work, and not just his fonts!\n\n"
    },
    {
      "time": "28 Sep 2007 — 9:56pm",
      "content": "I think in terms of type design everything is based on something else anyway. It has such a rich history and such a limited range of forms I think it's very very hard to make something actually original.\n\nIf you base but don't steal I don't see what the big deal is. Esp if you're not interested in monetary gain.\n\nI'm so pro-open-source :)\n\n"
    },
    {
      "time": "28 Sep 2007 — 9:57pm",
      "content": "Do you guys use facebook? I'd love to converse in a non thread form.\n\n"
    },
    {
      "time": "29 Sep 2007 — 3:51am",
      "content": "Here's something I wrote about myself & my work a few months back. It seconds your opinion, Haley, about it being very hard to make anything original... After all, for every single thing there can only be one pioneer.\n\nIn my opinion innovation is overrated. Everything has been done before & the only thing left for us to do is to add personal flavour. My work is merely a reflection of personal taste & skills. You can't hide the things that inspire and I've never had the intention to do so in any way. I'm not ashamed of my muse & everything I do can be seen as an ode to her. I can’t take credit for my own work ‘cause even if the apprentice should exceed his master, the honour still belongs to the latter. I’m a thief of ideas. I steal with my eyes the creations of other people’s minds and use their blueprints as my guide. But always with love and respect for what I’ve seen –secretly hoping that one day I too will be copied in some kind of poetic justice where the hunter gets hunted, inspiring others with what I admire and pass the torch, so to speak. I can only pray to become a chackle in the chain of inspiration, bringing life to new creations & encourage them to breed.  \nMost of my friends & family think of me as being creative, but I beg to differ. I just think I have a good eye for detail & the stamina to apply this to my work. In graphic design you always need to find the right balance between clarity & aesthetics. I always opt in favour for the latter. Even the simplest design can eat up a whole lot of my time 'cause I like to explore all possibilities before settling with a final result & although the last word may suggest otherwise, I'll take quality over quantity anytime.\n\n"
    }
  ]
}
