{
  "id": "33869",
  "title": "greek ductus",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nI am looking for the [ductus](http://web.archive.org/web/20131019092013/http:/typophile.com/wiki/ductus) of the [greek](http://web.archive.org/web/20131019092013/http:/typophile.com/wiki/greek) alphabet for lower and upper cases.  \nthanks in advance,\n\nd.\n\n",
  "author": "docunagi",
  "time": "18 May 2007 — 12:09am",
  "uid": "3596",
  "comments": [
    {
      "time": "18 May 2007 — 2:02am",
      "content": "I am guessing that there is more than one way to make/write each glyph just like in latin. So it wouldn't be the ductus. It would be the ducti (or whatever the plural is). Still, it's an interesting question. I hope somebody can point us to more info. I have never seen a caligraphic guide to greek forms. But I bet it's out there somewhere. That's how I would go about looking for the Ducti you seek if I was you.\n\n"
    },
    {
      "time": "18 May 2007 — 2:18am",
      "content": "I did find this\n\nBarbour, Ruth. Greek Literary Hands, A.D. 400-1600. Oxford : Clarendon Press, 1981. ISBN: 0198182295.\n\nAnd this\n\n[http://www.jcsparks.com/painted/Greek\\_Palaeo.html](http://web.archive.org/web/20131019092013/http:/www.jcsparks.com/painted/Greek_Palaeo.html \"http://www.jcsparks.com/painted/Greek\\_Palaeo.html\")\n\n"
    },
    {
      "time": "18 May 2007 — 6:23am",
      "content": "I'm sorry, you are too late. The ductus is leaving.  \n\"Please close the door as you exit.\"\n\nhhp\n\n"
    },
    {
      "time": "18 May 2007 — 11:40pm",
      "content": "Hrant;\n\nIf there 'aught to be ductus in type' vs. 'what is it when it is written' are different issues.\n\nI don't see the harm in being aware of the hisitory. Do you? Thinking that that history is destiny is, I agree, counterproductive.\n\n"
    },
    {
      "time": "19 May 2007 — 2:03am",
      "content": "very interesting link but not so useful…  \nI am looking for something more explicite like this example in russian :  \n [http://www.callig.ru/img/samples/toots-036-ex-widepero-1.gif](http://web.archive.org/web/20131019092013/http:/www.callig.ru/img/samples/toots-036-ex-widepero-1.gif \"http://www.callig.ru/img/samples/toots-036-ex-widepero-1.gif\")\n\n"
    },
    {
      "time": "19 May 2007 — 7:09am",
      "content": "Eben, the differentiation between Description  \nand Prescription is often a wool over our eyes.\n\n\\> [http://www.callig.ru/img/samples/toots-036-ex-widepero-1.gif](http://web.archive.org/web/20131019092013/http:/www.callig.ru/img/samples/toots-036-ex-widepero-1.gif \"http://www.callig.ru/img/samples/toots-036-ex-widepero-1.gif\")\n\nOh, you want kiddie diagrams.\n\nhhp\n\n"
    },
    {
      "time": "19 May 2007 — 8:15am",
      "content": "Just one point, for what it's worth. Lowercase alpha, which Westerners (at least in France) are taught to write like an elementary goldfish, should actually be done just like an italic lowercase a. It's an interesting case of handwriting adapting to a false impression of ductus derived from a printed letterform.\n\n"
    },
    {
      "time": "19 May 2007 — 9:37am",
      "content": "\\> should actually be done just like an italic lowercase a.\n\nIn <cite>type</cite> it should be done with outlines, not a skeleton.  \nFalse impression, shmalse impression.\n\nBTW, my older son often writes the Latin \"a\" like a goldfish.  \nI don't \"correct\" him. Because it doesn't matter.\n\nhhp\n\n"
    },
    {
      "time": "19 May 2007 — 10:17am",
      "content": "RE: Kiddie diagrams.\n\nIt's also true that for any given script the form changes and the ductus used will vary - my point being that while many people are eager to reform or codify or reify the way to write something in fact it is your own eye or that of your audience that you should be concerned with. Really there are no rules as such; just ways that are more or less typical for a given time period.\n\nAnyway, with those caveats you can try this. I can't vouch for it's 'correctness' especially since as I have already said I don't believe in the idea.\n\n[http://www.greece.org/gr-lessons/gr-english/Gif/script.gif](http://web.archive.org/web/20131019092013/http:/www.greece.org/gr-lessons/gr-english/Gif/script.gif \"http://www.greece.org/gr-lessons/gr-english/Gif/script.gif\")\n\nBTW: Do you want to know for writting or for font making?\n\n"
    },
    {
      "time": "19 May 2007 — 11:22am",
      "content": "From Apollonia, a decent <cite>typographic</cite> alpha:\n\n ![](http://web.archive.org/web/20131019092013im_/http:/typophile.com/files/goodalpha_6325.gif)\n\nIf you try to write it, you're not getting it.\n\nhhp\n\n"
    },
    {
      "time": "19 May 2007 — 11:31am",
      "content": "The pattern of thick and thin strokes is interesting in Greek. Unlike the standard forms for Latin, there are many thick horizontal strokes. There are also many fonts that have strong top-right-to-bottom-left diagonal strokes, most noticably in the chi, but also in alpha, gamma, and lambda. Does anyone know how these differences in stress arose? Interestingly, I've never seen any difference in the stress pattern of uppercase Greek and uppercase Latin.\n\n"
    },
    {
      "time": "19 May 2007 — 11:40am",
      "content": "Stephen & Hrant - thanks!\n\n"
    },
    {
      "time": "19 May 2007 — 11:42am",
      "content": "\\>Does anyone know how these differences in stress arose?\n\nI don't know about the Greek, but, to add some balance here, many type designers do think that the original pen formation of the letters, including stroke direction and order, is relevant to type design. For example Jan van Krimpen, while being opposed to making type calligraphic, never the less said that the pen remains an \"underlying force\" in type.\n\n"
    },
    {
      "time": "19 May 2007 — 11:49am",
      "content": "\\> I’ve never seen any difference in the stress  \n\\> pattern of uppercase Greek and uppercase Latin.\n\nThen you've never seen a good Sigma?\n\nIf you mean the 14 or so so-called \"cognate\" letters that  \n(supposedly) have the same \"structure\", that's actually called  \nLatinization (or at best, Modernism). When it's not called Lazy.\n\n\\> many type designers do think that the original  \n\\> pen formation of the letters, including stroke  \n\\> direction and order, is relevant to type design.\n\nCorrection: most.\n\nBalance? My own essential objective.\n\n\\> while being opposed to making type calligraphic\n\nLip service.  \nJust like all the chiro-posers claiming they respect notan.\n\nhhp\n\n"
    },
    {
      "time": "19 May 2007 — 12:50pm",
      "content": "\\>\\> I’ve never seen any difference in the stress  \n\\>\\> pattern of uppercase Greek and uppercase Latin.\n\n@hrant\\> <cite>Then you’ve never seen a good Sigma?</cite>\n\nI should qualify my statement: usually Delta, Sigma, and Xi have thick horizontal strokes at the bottom. Is this what you are referring to? Could you post an example of a \"good\" Sigma?\n\n@hrant\\> <cite>If you mean the 14 or so so-called “cognate” letters that (supposedly) have the same “structure”, that’s actually called Latinization (or at best, Modernism). When it’s not called Lazy.</cite>\n\nCould you post some examples of non-Lazy Greek letters that show different \"structure\" from their Latin \"cognates\"? Thanks!\n\nNew Century Schoolbook is an interesting example: the accompanying Greek script (designed by Matthew Carter, actually) is highly Latinized and Modernized. I'm working on a new set of Greek glyphs that are more natural but that will still harmonize with New Century Schoolbook. Hence the issue of stress pattern is of great interest to me.\n\n"
    },
    {
      "time": "19 May 2007 — 1:50pm",
      "content": "Docunagi, Stephen, Gerry Leonides has been very helpful to others on issues of Greek type design, so perhaps he will post on this thread. If not you can find a link to his e-mail at [his Reading U. web address.](http://web.archive.org/web/20131019092013/http:/www.rdg.ac.uk/AcaDepts/lt/home.html?staff/academic/gerry_l.html)\n\n"
    },
    {
      "time": "19 May 2007 — 3:21pm",
      "content": "[http://typophile.com/node/32859](http://web.archive.org/web/20131019092013/http:/typophile.com/node/32859 \"http://typophile.com/node/32859\")\n\n"
    },
    {
      "time": "19 May 2007 — 4:03pm",
      "content": "Stephen, yes I meant that some Greek caps do \"violate\" the Latin cap \"rules\".  \nOn the other hand, some Latin fonts do have an UC \"Z\" with thick horizontals...\n\n\\> Could you post some examples of non-Lazy Greek letters  \n\\> that show different “structure” from their Latin “cognates”?\n\nI wish I could. I mean, they do exist, but they're so rare that I can't think of any off the top of my head. And fonts that do have that feature will generally (sadly) be intended for display setting - like they might be caps-only.\n\nA good example of the type of thing I'm talking about though is Adobe's Sava, where the \"Y\" is different in each script, even though it doesn't \"have to be\".\n\nRecent related:  \n [http://typophile.com/node/33576](http://web.archive.org/web/20131019092013/http:/typophile.com/node/33576 \"http://typophile.com/node/33576\") \\_  \n [http://typophile.com/node/33414](http://web.archive.org/web/20131019092013/http:/typophile.com/node/33414 \"http://typophile.com/node/33414\") \\_  \nAt the end of the latter thread there's something that sheds some moderating light on your \"designed by Matthew Carter\". In fact Carter had a subsequent reaction against those Linotype efforts and made Cadmus, which in a way (although apparently not too robustly) is an effort at cultural authenticity; and way after that he made a Hellenicized Latin companion to Cadmus: the widely-used Skia.\n\n\\> I’m working on a new set of Greek glyphs that are more natural  \n\\> but that will still harmonize with New Century Schoolbook.\n\nSounds like a worthwhile effort. Just one bit of advice, which is hard to  \ngrasp the merit of easily: if it's a text face, don't match the x-height.\n\nhhp\n\n"
    },
    {
      "time": "19 May 2007 — 8:36pm",
      "content": "Hrant, thanks for your reply! I was aware of some of the history behind the design of the Century Schoolbook Greek, so the \"designed by Carter\" comment was a bit tongue-in-cheek.\n\n\\>\\> I’m working on a new set of Greek glyphs that are more natural  \n\\>\\> but that will still harmonize with New Century Schoolbook.\n\n@hrant\\> <cite>Sounds like a worthwhile effort. Just one bit of advice, which is hard to grasp the merit of easily: if it’s a text face, don’t match the x-height.</cite>\n\nCould you explain this comment more? I presume you think the x-height for the Greek should be larger (the x-height of Century Schoolbook is fairly low). What is a good method for figuring out the appropriate height?\n\n"
    },
    {
      "time": "19 May 2007 — 10:54pm",
      "content": "Methods to determine optimal relative vertical proportions between scripts can vary from the primitive (looking at the \"raw\" alphabets themselves) to the somewhat refined (weighting the letter structures according to linguistic frequency\\*) to the highly refined (possibly using surface area computations of the letter structure frequencies). But since this is all deterministic (meaning that you can never really arrive at The Answer) the important thing is simply to have a method at all. The important thing is not to blindly impose the vertical proportions (or other things, like serif structures) of one script onto another.\n\n\\* This is the method I use, and the one I've described in  \nthe 2005 edition of Hyphen (and Spatium #4 before that).\n\nhhp\n\n"
    },
    {
      "time": "20 May 2007 — 2:17pm",
      "content": "Sorry if I sounded normative about the alpha, that wasn't my point (and my point was about handwriting rather than type). What I was after was that Greeks do it differently (by hand) and so perceive it differently (in print), and that the relationship (and history of the relationship) between handwritten and printed letterforms is an important part of how we perceive Greek writing. (As to being normative about ductus in general, any palaeographer knows that ductus is the most conservative aspect of writing, but that it does change occasionally, resulting in structural changes that are invisible at first but gradually become more radical, leading to completely new letterforms).\n\nThe history and present form of Greek was (and still is) largely determined by Greek type being designed by non-Greeks. The Byzantine cursive scripts that inspired the first Greek fonts had virtually no contrast compared to Latin scripts, because of different writing implements (weight being added to the end of strokes, with something like ball terminals, rather than to certain strokes vs others according to direction). So the introduction of contrast into Greek scripts is mainly a matter of Latinisation.\n\nUppercase first: Greek inscriptional capitals had no thicks and thins. Contrast according to direction of the brush or pen works more or less consistently in Latin capitals because it was developed based on that limited set of letters. Adapting it to the Greek alphabet is impossible without cheating, particularly because of the greater importance of horizontal strokes in certain letters (Xi being most obvious): visual balance can only be achieved at the expense of consistency in the 'virtual pen angle'. Serifs of course, an essential part of the Latin thick-and-thin structure, were also virtually unknown in Greek before they were imported from Roman capitals. And using inscriptional capitals together with medieval minuscules is itself an essentially Latin invention, which entails all sorts of problems in visual consistency, even worse in Greek than they ever were in Latin.\n\nIn lowercase Greek, stronger contrast is a late development, having originated, I believe, mainly in the Bodoni-Didot kinds of Greek. What made it possible was that by then contrast in Latin cursive handwriting was no longer determined by a broad nib but by pressure: in G. Noordzij's terminology, expansion vs translation. So a lc sigma, for instance, can end with a horizontal thick stroke. And even then there was quite a lot of \"cheating\" for regular colour's sake, with stress patterns that would be quite impossible by hand.\n\nA further obvious observation is that Greek type, even though it was based on cursive, joined, scripts in the first place, dropped the ligatures very soon because they must have been hell (meaning expensive) to engrave and to compose. Which is why, learning the script from printed books, we are taught to write Greek by hand with cursive letterforms originally designed to join, but without being told we could (may I say should?) join them. If we did use (traditional) ligatures, anyone would understand what makes a goldfish alpha awkward. (BTW even the lovely alpha in Apollonia seems perfectly orthodox in ductus, impossible to see as the goldfish type).\n\nI wonder if Opentype Greek might bring about new changes in Greek handwriting. I'd love to see all those crazy Byzantine ligatures back in classrooms.\n\n\\* A footnote: interesting article about Greek type by Gerry Leonidas in Berry's great book [Language, Culture, Type](http://web.archive.org/web/20131019092013/http:/www.atypi.org/05_About_us/70_publications/50_LCT). Something like a short version of that is here: [http://typophile.com/wiki/Greek](http://web.archive.org/web/20131019092013/http:/typophile.com/wiki/Greek \"http://typophile.com/wiki/Greek\")\n\n"
    },
    {
      "time": "20 May 2007 — 3:08pm",
      "content": "Hrant and Marc, thanks for your comments! Hrant, what's the best way to get copies of the articles that you mentioned?\n\n"
    },
    {
      "time": "20 May 2007 — 3:47pm",
      "content": "Funny, I was convinced the fish-alpha was a western thing, and then I checked out this thread (pointed out by Nick, thanks) which has a picture of a recent hand, genuinely Greek it seems, and full of them (written with a ball-point pen though, which has been the main cause for disruption in the ductus of any script in the late 20th century):\n\n[http://typophile.com/node/32859](http://web.archive.org/web/20131019092013/http:/typophile.com/node/32859 \"http://typophile.com/node/32859\")\n\nI wonder how far back it goes and how common it is in Greece?  \nWarnock and others also have that kind of alpha.  \nMaybe this is moving away from docunagi's question so I won't push it any further. Let's just say that in some instances there is more than one ductus.\n\n"
    },
    {
      "time": "20 May 2007 — 4:43pm",
      "content": "Marc, I don't think that there is much correspondence between writing and type, although other media can give cues to type design.\n\nConsider the Rome type of Sweynheym and Pannartz, often cited as the first true humanist/roman type. In it, the caps have pronounced serifs, but the lower case has barely any serifs at all. This corresponds to the way that Renaissance scribes handled the _lettera umanistica,_ lavishing a little bit of extra work on capitals. The Big Idea that an upper case detail may be applied to the lower case was entirely typographic, and had nothing to do with writing practice and the tools thereof, as it is too cumbersome to \"write\" serifs on every lower case letter.\n\nTherefore, it seems that the archaic quality of classic Greek typography (without lowercase serifs) stemmed, indeed, from foreigners, because they paid too much respect to making it look \"authentic\" -- like writing. However, it's interesting that this backwardness turned out to be forward-looking, producing several monoline, sans serif faces at one time or another, such as Hibbert's _Greek Uncial_ of 1827.\n\n"
    },
    {
      "time": "21 May 2007 — 12:15am",
      "content": "Of course I agree type does not follow handwriting all the way, although its initial motive was reproduction. I am more concerned with reciprocal interaction: just as Greek print influences our Greek hands, Humanistic manuscripts after 1450 soon showed signs of the influence of type on scribes; and 17th century calligraphy was even more typographic. Still, it may be pointed out that symmetrical foot serifs were already used in late (11th cent.) Italian Caroline minuscule, and this just may have played a part in the idea for 15th cent. serifs. No pre-Jenson examples spring to mind just now, but I'll look if I can find any. Even that, of course, would not account for bracketed serifs.\n\nPS Hrant, I am also interested in your article.\n\n"
    },
    {
      "time": "21 May 2007 — 1:43am",
      "content": "I am looking for calligraphy first and then for typo.  \nBut the links provided are very good. There is the ductus of letters. that's all I needed. thanks a lot !  \nThis thread has grown during the week end !!! :D\n\n"
    },
    {
      "time": "21 May 2007 — 3:04am",
      "content": "Lowercase serifs, 1456.\n\n ![](http://web.archive.org/web/20131019092013im_/http:/typophile.com/files/Vat_4865.lat.1893.jpg)\n\n"
    },
    {
      "time": "21 May 2007 — 10:23am",
      "content": "You might also want to read Noordzij on the subject of serifs not for the historical sense of when they show up in writing ot type, that isn't his focus; but for a clear theoretical context in which to fit serifs & ductus. His ideas are practical & process oriented. I am paraphrasing quite a bit but his point as I recall it is re: serifs some kinds of serif like shapes can & do occur in some running hands without extra trouble. And more of them can show up in a hand where letters are composed not in one stroke but as a result of sokes & lifts & stokes etc. I suspect that you had both kinds of hands at work even in the early days to which Nick refers.\n\nThe main point I would make here is that 'serifs' as such may not have been seen as ontologically distinct in the miniscule when this writing was being made. And our seeing them as such may have to do with looking at the material through the lens of type. To them it might just have been 'feet' and different from the Roman serifs, or they may have been an invisble, unnamed, unthought about part of the process. The mental connection to the Roman Cap forms probably came up gradually. Anyway this is all speculation in the service of urging caution or at least provisionality when talking about 'serifs' & the miniscule forms in early Latin calligraphy. Certainly it takes a while for the serifs on the miniscule to be visually harmonized with the Majiscule or Caps.\n\nIn the conext of greek this might be different - or not. The scripts are alike enough & the tooks alike enough that I bet there is a great deal of overlap. Still, only looking at a range of historical materials will let you know what did happen as opposed to what could have happened.\n\n"
    },
    {
      "time": "21 May 2007 — 11:15am",
      "content": " ![](http://web.archive.org/web/20131019092013im_/http:/typophile.com/files/Poggio_4729.jpg)\n  \nAbove: Writing by Poggio, 1406  \n.\n\n ![](http://web.archive.org/web/20131019092013im_/http:/typophile.com/files/Sweyn_5326.jpg)\n  \nSweynheym & Pannartz, from _Lactantius_\n\nCertainly, there were \"serifs\" in pre-print writing, but they were small and generally transitive. The S&P type follows that convention.  \nEven Jenson's foot serifs at the bottom of the left stem of \"n\" for instance, although pronounced, were a bit like that (taken up by Goudy) -- but by the time of Griffo's work, that serif has become substantial and symmetrical, to match the cap serifs. The characteristic repose of the roman script, as seen in Griffo's type, results in large part from giving the lower case symmetrical, non-transitive serifs on the vertically-stemmed letters.\n\n"
    },
    {
      "time": "21 May 2007 — 11:35am",
      "content": "With regard to the history of Latin script, Eben, I see in several references that the Carolingian miniscule was distinctive in being less cursive than the other hands which proceded it, such as the half-uncial. These previous scripts were influenced by the Roman cursive hand, as opposed to the formal 'Capital' letters used in inscriptions. The Carolingian miniscule was, then, a conscious effort to make the lower case resemble more the Roman Capitals.\n\nIn the examples I see of Carolingian miniscule, the lc serifs do not extend to the left as well as the right on eg the last stroke of the n. However, Harry Carter in his book has an example of a humanist script of 1450, just before the first Roman type. Though the reproduction is small and hard to see, it does seem to have serifs extending both ways. And this would, then have been an even more deliberate attempt to make the lower case look like the formal Roman letters. And our Roman type it seems is based on this hand-written revival of an earlier script.\n\n[edit: this was cross-posted with Nick's interesting examples and analysis. The example of Harry Carter from 1450 does seem to have a bit more serif to the left, though.]\n\n"
    },
    {
      "time": "21 May 2007 — 12:17pm",
      "content": "Whatever the mechanism for the evolution towards the \"standard\" roman typeform of say Griffo, it seems that there was a lot of variety in calligraphic forms prior to the Incunabula, and a lot of experimenting going on during it, especially the interplay between northern and southern letterforms, and I think this must have led to the emergence of post-calligraphic, type form letters.\n\nFust & Schoffer's 1459 small type was more like a southern rotunda in form, and perhaps influential on S&P's type. They may have been pointed in that direction by the practical demands of being small type, more than cultural or stylistic considerations. In other words, \"let's make small type, which available script model works best?\"\n\n\\*\\*\n\nAnother factor that may have kept Greek in a more scripty form was its frequent use in contrast situations with Latin. For instance in The Polyglot Bible c.1500, lines of Latin and Greek text are alternated. Typically in the West, a learned work would be in Latin script, and quote a few lines of Greek, so a slanted Greek form provided good contrast. I would guess that there were far more works printed that contained a minority of Greek text, than works that were all Greek. And for Classic studies, comparison in texts was their main reason.\n\n"
    },
    {
      "time": "21 May 2007 — 1:00pm",
      "content": "\\> the introduction of contrast into Greek scripts is mainly a matter of Latinisation.\n\nSometimes, like in this case, Latinization can be a good influence.  \nThe same thing happend to Thai, and it added a functional richness.\n\n\\> dropped the ligatures very soon because they must have  \n\\> been hell (meaning expensive) to engrave and to compose.\n\nAlthough there is a certain truth to this, I've always had a problem with this logic, especially these days, where the motivation to make a new font at all tends to come from the designer, not a burning need in society.\n\nLigatures <cite>now</cite> make superb sense.\n\n\\> even the lovely alpha in Apollonia seems perfectly orthodox in ductus\n\nAs I've said before, you can see anything anywhere if you set your mind to it! People see the pen in Legato, in spite of Bloemsma's long-standing, explicit and conscious deviation from chirography.\n\nThe difference here comes down to: is it \"natural\" to write the alpha in  \nApollonia, compared to the cursive-Roman-\"a\", or the goldfish? No.\n\n\\> I’d love to see all those crazy Byzantine ligatures back in classrooms.\n\nMe too, but not necessarily/just Byzantine - I'm thinking of Granjon's work for example. Humans can handle a lot more than the Modernists give them credit for.\n\n\\> what’s the best way to get copies of the articles that you mentioned?\n\nMy preference would be for a person to purchase the 2005 edition of Hyphen. But if you're going to be in LA in mid-October I'll be giving a talk at the annual APHA conference about it, and will hand out stuff.\n\n\\> The Big Idea that an upper case detail may ...\n\nNick, sorry but your version of serif history doesn't sound right at all.\n\nAlso, seeing serifs as something you either  \ntack on or not is essentially anti-typographic.\n\n\\> Another factor that may have kept Greek in a more scripty  \n\\> form was its frequent use in contrast situations with Latin.\n\nGood point.\n\nhhp\n\n"
    },
    {
      "time": "21 May 2007 — 2:13pm",
      "content": "Serifs transitive & intransitive: The point of my 1456 example (as in Carter's) is that the serifs here seem to be deliberately intransitive, unlike Poggio and S&P and most humanistic scripts, not to mention Italian rotunda, even though they aren't quite as neat as Griffo's yet.\n\nIt's difficult to tell from the very small script of my sample, but this does look like possibly a revival of earlier Italian styles (11th c. as I said) in which symmetrical serifs were quite clearly added on as horizontal hairlines. At any rate it isn't just accidental or unconscious movements. As for the original Caroline minuscule, it was \"less cursive\" than previous, early mediaeval minuscules (not really half-uncial) mainly because it dropped almost all standard ligatures. I wouldn't say the letterforms themselves were made any more similar to Roman caps, but having separate letters, and a single shape for each (or nearly), certainly was felt to be more \"classical\", because Latin grammarians had explained that every sound should be represented by a distinct sign. (Sorry if I sound a bit stuffy, I didn't mean to turn this Greek calligraphy thread into a course on mediaeval palaeography.)\n\nAs far as I remember Noordzij on serifs, he has an exciting and paradoxical theory about the influence of the French or Burgundian bâtardes on the development of serifs, but I do think it needs to be reassessed in the light of late-Caroline precedent.\n\n\\> dropped the ligatures very soon etc.  \nActually complex ligatures were also omitted in the earliest, more rudimentary Greek fonts. Whatever engravers and printers would have liked to do, it obviously required uncommon craftsmanship and capital to get it right.\n\n\\> Byzantine ligatures: sorry, I mean late medieval and Renaissance Greek cursive in general. Even Granjon was following that kind of model, wasn't he? I would be glad to see what his Greeks look like, I haven't got much material on Greek type. Any pictures or bibliography welcome. Cheers.\n\n"
    },
    {
      "time": "21 May 2007 — 2:27pm",
      "content": "Marc, the 'Roman' character of the Carolingian miniscule I thought lay in the roundness of the obpdq bowls which is similar to the Roman Capital letter. The roundness of the mnh, which echo this, are different from the Roman Capitals, but do give a roundness that is more consistent with the Roman Caps than broken scripts.\n\nInteresting point you make about getting rid of ligatures as being deliberately non-cursive. In a long thread on ligatures here, I thought David Berlow put it best when he said something like: it is a negative for readability if you ligate in a separated script or if you separate in a connected script. Of course there may be positives that make you want to do a ligature (or not) anyway, such as in the fi ligatures.\n\nThat is why I am not so keen on ligatures in text. For display they can be cute, but they can also get out of hand.\n\n"
    },
    {
      "time": "21 May 2007 — 2:45pm",
      "content": "Well yes, 9th to 11th-c. Caroline minuscule is nice and round, but so were most previous minuscules. Roundness as opposed to broken strokes applies to neo-Caroline, i.e. 15th century humanistic scripts (even though Italian gothic wasn't nearly as spiky as the northern varieties).\n\nPre-caroline scripts are considered cursive or semi-cursive mainly because of their many ligatures, which modified letterforms more than any ligs used in type today, since a single letter would take on a completely different form (or more than one) in order to join up with another. So, when learning to write, you were taught the shape of single letters plus the special shapes of pairs (mainly pairs). In that respect Caroline minuscule made both writing and reading easier, essentially br reverting to the basic letterforms of semi-uncial (plus a few letters borrowed from other scripts). Of the few ligatures that stayed on, the most frequent of course was the ampersand, e+t.\n\n"
    },
    {
      "time": "21 May 2007 — 3:04pm",
      "content": "Very interesting, Marc. Is there a book or article that has an overview of this history?\n\n"
    },
    {
      "time": "21 May 2007 — 4:14pm",
      "content": "One of the most enlightening illustrated introductions is: Rutherford ARIS, Explicatio formarum litterarum = The unfolding of letterforms, from the first century to the fifteenth…, Saint Paul (Minn.): Calligraphy Connection, 1990, XVI-50 pp., 24 plates, 185 ills. It has masses of early medieval stuff.\n\nGet it from John Neal's excellent [bookshop](http://web.archive.org/web/20131019092013/http:/www.johnnealbooks.com/prod_detail_list/30/2).\n\nPlenty more titles (c. 1300) in a general bibliography of palaeography I have posted [here](http://web.archive.org/web/20131019092013/http:/theleme.enc.sorbonne.fr/document.html?id=30).\n\nAnd a selection of palaeography websites [here](http://web.archive.org/web/20131019092013/http:/www.ext.upmc.fr/urfist/menestrel/paleo/07tutoriels.htm).\n\nOne of my favourites is this Australian site: [Medieval Writing](http://web.archive.org/web/20131019092013/http:/medievalwriting.50megs.com/writing.htm).\n\nCheers.\n\n"
    },
    {
      "time": "21 May 2007 — 6:32pm",
      "content": "Marc, here is a slide from my Thessaloniki  \npresentation of '04, showing the Granjon:\n\n ![](http://web.archive.org/web/20131019092013im_/http:/typophile.com/files/12_fell_100_3535.gif)\n\n\\> That is why I am not so keen on ligatures in text.\n\nOn the contrary, it is in text that ligatures  \ncan go way beyond the cute and into the useful.\n\nhhp\n\n"
    },
    {
      "time": "21 May 2007 — 6:45pm",
      "content": "Marc, thanks for the references!\n\n"
    },
    {
      "time": "21 May 2007 — 9:20pm",
      "content": "The pen angle in the Byzantine cursive hand is much more variable than in most Latin writing: in some hands it varies by as much as 40 degrees, and may involve rotation past the vertical, although that is extreme. In general terms it is much steeper than the typical Latin ductus, and closer to the ductus of Hebrew and Arabic than to Latin. This shouldn't be surprising if one considers the geographical territory covered by the Byzantine empire during the evolution of the miniscule hand.\n\nThe most obvious impact of this steep ductus is found in the typical forms of letters like pi and tau, in which the heavier stroke is the horizontal. When a less steep ductus is applied to Greek, these letters and others can end up looking quite strange, which is why one often sees hybrid type designs in which different letters have different ducti. I've designed Greek types using this approach (e.g. Constantia) -- usually when close harmony of texture with a companion Latin is a desired goal -- but I'm never as satisfied with the results as I am when I design with a more traditional Greek contrast pattern consistently across the letters. It is very difficult to avoid a spotty appearance when some letters have a horizontal contrast pattern and some a more vertical.\n\n"
    },
    {
      "time": "22 May 2007 — 12:25am",
      "content": "Hrant, thanks for the picture. Splendid. That Chi does look a bit lonely though, poor thing, standing on its two feet in the middle of the dance.\n\nJohn, thanks for the enlightening observations on pen angle. I had never noticed that, since contrast isn't usually as strong in Greek as it can be in Latin writing (and as consistent, but now I know why). I suspect the different stress pattern might be a factor in our mistaken perception of some ductus (pl.): e.g. the thick upstroke at the bottom of alpha, as in Granjon, might easily be mistaken for a downstroke with pressure on the nib. Hence the goldfish.\n\n"
    },
    {
      "time": "22 May 2007 — 10:13am",
      "content": "Hrant, where is your sample of the Granjon Greek from, and what size is it? It looks very light to me, but I'm used to looking at the small sizes.\n\nMarc, yes the stroke contrast is often quite low in Byzantine cursive writing, and I suspect this reflects the dominant tool: the reed pen, which becomes worn more quickly than quill or steel. But the same steep ducti can be seen in the 18th and early 19th century Greek styles written with a steel split nib, which are the model for the Didot Greek types. [The Bodoni Greeks are erratic. They're among the first to mix steep and flat ducti and, frankly, I don't think they're very good.]\n\n"
    },
    {
      "time": "22 May 2007 — 10:23am",
      "content": "It's from Morison's \"Fell Types\" book - I think page 100.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2007 — 5:54pm",
      "content": "Thanks. I thought it might be from the Fell collection, which includes the larger sizes. This is the Double Pica Greek. And what a delightful discovery:\n\n_A resetting of a passage in Thucydides as edited by John Hudson, Oxford, at the Theatre, 1696._\n\nIt's worth noting that not all the ligatures in the Fell Double Pica were original to the Granjon/Plantin face. More than half of them were cut for Fell, presumably by Isaiah de Walpergen. He did a very good job, and they blend very seamlessly with the main font.\n\nThere is an interesting thing to note regarding the Granjon Greeks, which I alluded to in my presentation at the ATypI Rome conference in 2002: the smaller the type size, the greater the number of ligatures. The relatively small number of ligatures in the Double Pica size prior to the additions of de Walpergen further confirms the pattern. My belief is that because the smaller sizes of type were used mainly for marginalia, footnotes and other text in constrained spaces, they benefited from more ligatures, which reduced the length of the text.\n\n"
    },
    {
      "time": "22 May 2007 — 6:01pm",
      "content": " ![](http://web.archive.org/web/20131019092013im_/http:/typophile.com/files/Ratdolt_4718.jpg)\n\nDetail of Ratdolt specimen, 1486.  \nToday, that Greek would be described as Latinized.\\*  \nBut at the time?  \nAnyway, Aldus' hugely ligatured, sloped, archly exotic Greek is better known and perhaps pointed development away from the modernity suggested by Ratdolt.\n\n\\*anti-chirographic, and with many symmetrical forms; nu = latin v, and \"small cap\" forms of kappa, eta. Very tidy mu; iota is no different than the roman i's that have lost their dots.\n\n"
    },
    {
      "time": "22 May 2007 — 6:50pm",
      "content": "If memory serves, De Walpergen's Armenians however were not so hot.\n\n\\> Today, that Greek would be described as Latinized.\n\nNot by me.  \nI would simply describe it as lazy and sloppy.\n\nhhp\n\n"
    },
    {
      "time": "23 May 2007 — 2:50pm",
      "content": "Nick, Ratdolt's Greek simply isn't very good. It belongs to a struggling effort of non-Greek printer-publishers, beginning with Fust and Schoeffer, faced with the need to incorporate bits of Greek text in their Latin books. What is notable about Ratdolt's specimen, if the date is correct, is just how bad it is, because by then Jenson and others had done much better Greek types in the non-ligated style.\n\nDo you have access to a copy of Scholderer's \\_Greek Printing Types\\_? It reproduces a fine set of examples of 40 years worth of pre-Aldine Greek types, many of which are non-ligated or display only a small number of ligatures.\n\nI wouldn't call these types Latinised. Their point of typographic departure is the mediaeval formal book hand that preceded and continued to be used alongside the late Byzantine cursive writing. Such letters are upright, quite broad and generally employing fewer and simpler kinds of ligation. Barbours very good \\_Greek Literary Hands\\_ shows dozens of examples from the 10th century onwards. Since ligation was a less vital aspect of the formal book hand than than the cursive, it could more easily be dispensed with in the transition to type.\n\nAldus' cursive Greek types should be seen in context of his Latin 'italic' types, i.e. as the adoption of the manuscript conventions for the kind of small format pocket book that he was publishing.\n\n"
    },
    {
      "time": "23 May 2007 — 3:57pm",
      "content": "_Do you have access to a copy of Scholderer’s \\_Greek Printing Types_\n\nNo, I haven't seen many samples of medieval and incunable material.\n\n_simply isn’t very good ...their point of typographic departure is the mediaeval formal book hand ... Such letters are upright, quite broad and generally employing fewer and simpler kinds of ligation._\n\nWhat's the connection -- Is the whole genre of formal upright non-ligated Greek \"not very good\"?\n\nAnd why isn't Ratdolt's Greek very good? It's not as refined as his Latins, but it reads easily enough, and speaking of Sholderer, it's remarkably similar to his New Hellenic:\n\n ![](http://web.archive.org/web/20131019092013im_/http:/typophile.com/files/NeoH_5532.jpg)\n  \n(OK, I cheated with the eta)\n\nThe main question I'm asking is, IF Latin and Greek came from the same scribal tradition, why did they end up so differently in type?\n\n"
    },
    {
      "time": "23 May 2007 — 4:14pm",
      "content": "\\> And why isn’t Ratdolt’s Greek very good?\n\nBecause (to use a term of yours) it looks like a dog's breakfast?\n\n\\> IF Latin and Greek came from the same scribal tradition,  \n\\> why did they end up so differently in type?\n\nBut that \"if\" is false to begin with.\n\nI think they ended up differently in type not least because  \none was done by people with nativity and the other without.\n\nhhp\n\n"
    },
    {
      "time": "25 May 2007 — 11:36am",
      "content": "Nick: _What’s the connection — Is the whole genre of formal upright non-ligated Greek “not very good”?_\n\nNo, not at all. There's a lot of good writing and type in this style. My point was that the example you provided by Ratdolt is not a good one. It is very crude, especially compared to contemporary types in similar style by Jenson and others, and all the more remarkably so because Ratdolt worked in Venice and would have been familiar with these other Greek types.\n\n_IF Latin and Greek came from the same scribal tradition, why did they end up so differently in type?_\n\nBut this is my point: they do _not_ come from the same scribal tradition. The Latin miniscule and Greek miniscule alphabets developed in geographical and largely in cultural isolation (especially after the Great Schism), and did not come back into significant contact until the advent of typography (which was initiated in Europe by Gutenberg at almost exactly the same time as Constantinople fell to the Turks, causing a massive influx of Greek refugees to the west, especially to Italy). This happened to coincide with the revived interest in classical civilisation that had begun in the west in the late Middle Ages and that we now think of as the Renaissance. The influx of Greeks into the western centres of scholarship and publishing assisted the rapid development of study of ancient Greek literature in the original.\n\nHrant: _I think they ended up differently in type not least because  \none was done by people with nativity and the other without._\n\nThat ignores the major involvement of emigré Greeks in the development of Greek typography in Italy and elsewhere, which has been excellently documented by Konstantine Staïkos in _Charta of Greek printing._ No, the reason why they ended up differently in type is that they were already different in manuscript. One can say that Latin type dispensed with most ligatures while Greek type, in the cursive style, maintained them (for almost 300 years), but a) Latin writing was never as heavily ligated as Greek, and b) there was already plenty of manuscript precedence for both roman and italic writing with very little ligation (in explicating the chancery italic hand, the writing masters make an important distinction between _corsiva_ and _formata_). Such precedence did not exist in the Byzantine cursive hand, and I think printer publishers -- both Italians like Aldus and Greeks like Kallierges and Vlastos -- saw it as an all-or-nothing proposition. If you were going to print books in this style of lettering, i.e. in the style that convention considered appropriate for small format pocket books, then you had to deal with the ligatures.\n\n"
    }
  ]
}
