{
  "id": "33872",
  "title": "Flickr wars!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://news.bbc.co.uk/1/hi/technology/6665723.stm](http://web.archive.org/web/20071010134716/http:/news.bbc.co.uk/1/hi/technology/6665723.stm \"http://news.bbc.co.uk/1/hi/technology/6665723.stm\")\n\nSeems Rebekka is right!\n\nThe current trend for companies stealing photos and not paying has gotten out of hand.\n\nThis morning on TV the BBC News ended a story about this weeks FA Cup final with a request for people to send in there images from the days event. Gee that is a cheap way to get content. No need to send out photographer or pay them for that matter.\n\nThen there are the prowlers who ask to use your photos for their applications. I get request all the time.\n\nMany of my clients ask me to send some high res images to magazines and I get no credit usually.\n\nStop the open source style stealers, save a photographer today.\n\n [‹ Search to Download L&C Hairline](http://web.archive.org/web/20071010134716/http:/typophile.com/node/33910 \"Go to previous forum topic\") [Standard Type Size Increments ›](http://web.archive.org/web/20071010134716/http:/typophile.com/node/33913 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071010134716/http://typophile.com/user/7029\" title=\"View user profile.\">vinceconnare</a>",
  "time": "<br>",
  "uid": "7029",
  "comments": [
    {
      "time": " 18.May.2007 6.21am",
      "content": "[http://news.bbc.co.uk/2/hi/entertainment/6579839.stm](http://web.archive.org/web/20071010134716/http:/news.bbc.co.uk/2/hi/entertainment/6579839.stm \"http://news.bbc.co.uk/2/hi/entertainment/6579839.stm\")\n\nBut, again, don’t let me bring on the chocolate.\n\nhhp\n\n"
    },
    {
      "time": " 18.May.2007 11.31am",
      "content": "If it’s open source, then they’re not stealing it, provided they are adhering to the open source license.\n\n"
    },
    {
      "time": " 18.May.2007 1.12pm",
      "content": "And if one sets one’s Flickr account up so that all the photos are available to everyone, I think you’re asking for abuse, especially if you’re good. It’s a trade-off, certainly.\n\nGuess that’s why my account’s set to friends and family only.... (Not that I’ve got anything someone would want to rip off, but that’s another story!)\n\n"
    },
    {
      "time": " 18.May.2007 6.09pm",
      "content": "\\> So far no one has ripped me off,\n\nWell, I guess it was bound to happen. I just discovered while perusing my stat page, that a Turkish? Photoshop site had pasted in my thumbnail tables, complete with links to the source images on my host’s server, making their own free photo site using only my photos and bandwidth. And filled it chock full of Google ads.\n\nAnd then I saw they had just made an English version, also using my bandwidth. There is \\*always\\* someone who will abuse a good thing.\n\nConveniently, there is no contact option on their pages, although the site seems fairly sophisticated otherwise.\n\n"
    },
    {
      "time": " 18.May.2007 7.37pm",
      "content": "And then there is the flipside, like Wilco’s new album cover that uses an image originally on Flickr that they undoubtedly paid for. Or Microsoft finding photos for their Vista wallpaper on Flickr and commissioning a couple of the Flickr photographers to fill it out.\n\nIt’s a two-way street: some people get ripped off, and others get noticed and compensated. I’d rather lose a few images to the WWW and gain a few photo clients than never take the chance at all. Not that it’s balanced or fair, but it is not black and white either (no pun intended).\n\nAt my design shop, we use Flickr for comping now more than Getty because of its quality, quantity, resolution, and reality. And I think the day draws near when we buy a photo from somebody there.\n\nHorton  \nFounder, [This Day in Type](http://web.archive.org/web/20071010134716/http:/www.thisdayintype.com/)\n\n"
    },
    {
      "time": " 19.May.2007 2.29am",
      "content": "That’s what you wanted: The open internaional beautiful world for everyone and everything.  \nNow you got it and you have to live with it.  \nSo stop crying about it.\n\nGeorg\n\n"
    },
    {
      "time": " 19.May.2007 6.45am",
      "content": "There’s also a really creepy side to flickr for anyone posting photos of kids. Seriously. Plenty of discussion on there for those who care to look into it, and of course opinions vary. I took all my pictures off and reposted them as private to ensure that they were only viewable by family and friends because of some insane activity on 2 or 3 pictures of my kids. (I was advertising my apartment for rent, but the pictures of the apartment were getting less hits than those 2 or 3 of the kids which had my son in his undies in the water fountain and my daughter eating a popsicle.)\n\nRegardless where your opinion lies on the subject, it is better to make an informed decision than uninformed one, I think.\n\nK.\n\n"
    },
    {
      "time": " 19.May.2007 7.31am",
      "content": "Photography in general is pretty creepy.\n\nhhp\n\n"
    },
    {
      "time": " 19.May.2007 9.26am",
      "content": "Are documentaries creepy too? Photography will just document some partial reality.\n\nI just saw a photo of a red rose on Flickr that my cousin (a much better photographer than I am) took, and it is stunning, and definitely not creepy, capturing almost all but the smell.\n\n"
    },
    {
      "time": " 19.May.2007 9.38am",
      "content": "The stun is in your head. The photo is a parody.  \nEven video is less bad.\n\nhhp\n\n"
    },
    {
      "time": " 19.May.2007 10.11am",
      "content": "Well, I can’t argue with “The stun is in your head”. I had been trying to overcome this for some time, but to no avail. Now I just let ’er rip.  \n; )\n\n"
    },
    {
      "time": " 19.May.2007 11.21pm",
      "content": "_The photo is a parody._\n\nAnd so is every other means of expression, including Type.\n\nThe camera, is as valid as any other tool of the artist. One of my charcoal and pastel sketches is no more a unique/honest expression than a photograph.\n\nIt’s just a matter of technique.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": " 20.May.2007 7.46am",
      "content": "1) Type, good type, is not a “means of expression”, not an art.  \n2) Type has an essential abstract, non-literal, subtle heart.\n\nPhotography, due to its <cite>intent</cite> of conveying the Real is nothing like type at all,  \nwhich has as its intent the subconscious enrichment of a third-party Reality.  \nType is culture. Photography is creepy. And that’s why Flickr is creepy.\n\nhhp\n\n"
    },
    {
      "time": " 20.May.2007 8.00am",
      "content": "\\> has as its intent the subconscious enrichment of a third-party Reality.\n\nWho can argue with someone who comes up with statements like the above? But can’t photography claim the same? I certainly claim it for my photos.  \n; )  \nMaybe creepy, like beauty, is in the eye of the beholder\n\n"
    },
    {
      "time": " 20.May.2007 8.09am",
      "content": "BTW don’t get me wrong, creepy does not equate to pointless.\n\nhhp\n\n"
    },
    {
      "time": " 20.May.2007 8.17am",
      "content": "FP-  \nThis may be rhetorical, but I was then struck by this thought:  \nWho owns the “rights” to graffiti art? The artist? the buiding owner? the photographer that chronicles it?\n\nExample: it is perfectly legal to photograph the Eiffel Tower during the daylight hours and sell the photos as copyrighted images. It is illegal to photograph the tower at NIGHT and sell the images, because the company that illuminates the tower has copyrighted the lighted aspect of the site. No one is required to credit Gustave Eiffel (although this is most likely a Public Domain issue, due to the date, etc.).\n\n"
    },
    {
      "time": " 20.May.2007 8.20am",
      "content": "Just playing Devil’s Advocate, but I’m reminded of the Grateful Dead and their stance on bootleg recording. Paraphrasing, Garcia once said that once they had played a note — in essence, “released” it or “set it to flight” — it no longer belonged to the band, but to whomever may encounter it.\n\n"
    },
    {
      "time": " 20.May.2007 8.22am",
      "content": "\\> Who owns the “rights” to graffiti art?\n\nVery interesting question!\n\nhhp\n\n"
    },
    {
      "time": " 20.May.2007 8.25am",
      "content": "\\> Who owns the “rights” to graffiti art?\n\nI have wondered the same thing. I was approached by Paramount Pictures requesting the use of my graffiti photos in a dancing movie that recently came out (the sequel to “Save the Last Dance” with Julia Stiles), and I signed their release with the caveat that I don’t know what right the graffiti artists may have, so they use them at their own risk. I noticed my photos weren’t in the movie.\n\n"
    },
    {
      "time": " 20.May.2007 8.35am",
      "content": "It’s possible that we may be moving toward a time where once we post something online or otherwise distribute it (set it to flight?), we may be relinquishing control implicitely. Sure, we can argue intellectual, creative property and copyright issues, but laws themselves, and certainly enforcement of laws, follow cultural and social consents. If, as a society, everyone is “lifting” whatever they find, copyrights may become harder and harder to control.\n\n"
    },
    {
      "time": " 20.May.2007 8.43am",
      "content": "I have also wondered the same about the street chalk painting festivals. There is a transitory art form if ever there was one. Started on Saturday, finished on Sunday, and washed away Monday.\n\n"
    },
    {
      "time": " 20.May.2007 8.48am",
      "content": "And besides, I never even said I _liked_ caramel — I just asked what other people thought about the subject.\n\n"
    },
    {
      "time": " 20.May.2007 9.05am",
      "content": ":-)  \nI think “caramel” should be the official Typophile euphemism for going off-topic.\n\nhhp\n\n"
    },
    {
      "time": " 20.May.2007 10.09am",
      "content": "hrant, even Architecture is a vain attempt to imitate. Type is no different. For all that we do in design in art is a parody. Any expression is a vain attempt to convey a meaning - Type is no different. Take Romany for instance... it’s lines (like any other Type) try to imitate/convey a feeling. How vain is that? How many times has someone said a particular Type has a ’such and such’ feeling?\n\nAll is parody and all is in vain - I want to meet the guy who created feelings/emotions. Perhaps ’parody’ is not what you meant.\n\nCopyright of an expression ie a photograph, a piece of music, a canvas, a building (ie.Fallingwater), Type etc., etc... should be strictly enforced!, whether it be distributed via camel or via the internet.\n\nTheft of ones work - is a direct attack on the Individual.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": " 20.May.2007 10.20am",
      "content": "Here we go...\n\n_Theft of ones work - is a direct attack on the Individual._\n\nDevil’s Advocate again here, but that sentiment views experience and interaction as an advesarial enterprise. “I thought this, so it’s mine!” “I said this, so it’s mine!” What if, however, that weren’t the case? What if everything we did was less proprietary and more contributional?\n\n"
    },
    {
      "time": " 20.May.2007 12.00pm",
      "content": "\\> What if, however, that weren’t the case? What if everything we did was less proprietary and more contributional?\n\nIn an ideal world, all for one and one for all, and all that.\n\nUnfortunately there is man’s nature to deal with in this real world, which negates all semblance of \\*ideal\\*.\n\nIn this world, however, I imagine then artists would have an even harder time surviving without another gig?\n\n"
    },
    {
      "time": " 20.May.2007 12.08pm",
      "content": "_What if everything we did was less proprietary and more contributional?_\n\nAn old and tired argument - the value of self-worth.\n\nWhen work (ie photography) is protected by law, you must push your own creativity. Proprietary rights help drive/push the creative process - not diminish it. And in return proprietary rights strengthen democracy as a ’whole’. And it’s the free association of Individuals which makes a democracy great. And then if the Individual wants to freely contribute their work, there should be websites which allow for that give and take.\n\nI’m always amazed by how many people don’t vote ...sigh.\n\nDid Garcia ever make it to Burning Man, [http://www.burningman.com/](http://web.archive.org/web/20071010134716/http:/www.burningman.com/ \"http://www.burningman.com/\") , the celebration of the Individual’s creative spirit?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": " 20.May.2007 12.15pm",
      "content": "FP-  \nThey sure would. A point that can be made, however is that everything is a matter of appropriation anyway. There is no art, thought, musing, song, scientific discovery, etc. that is not the direct result of other things. It may be “new” in that it’s somewhat diffferent — another way to phrase something, a different color combination that really makes it appear unique — but at the root, it’s modification.  \nEven many designers make this point: Art Chantry, and Andy Warhol each borrow(ed) freely from surrounding culture. Milton Glaser’s famous DYLAN poster is a direct modification of Marcel Duchamp’s work. Mozart, Bach, Beethoven each produced great numbers of pieces derived from the work of others, and not only is it accepted, it’s celebrated.\n\n"
    },
    {
      "time": " 20.May.2007 12.17pm",
      "content": "It comes down to a level of degrees. Legally, there are precise and determined “percentages” to which a piece must be altered before it can be claimed as being a “new” piece of art.\n\n"
    },
    {
      "time": " 20.May.2007 12.18pm",
      "content": "For work, I photograph buildings. Sometimes that’s boring but I’m not sure about creepy!? For my landscape photographs, I am not interested in photographing what is real but rather what I see.\n\n"
    },
    {
      "time": " 20.May.2007 12.19pm",
      "content": "\\> A point that can be made, however is that everything is a matter of appropriation anyway.\n\nI hope I don’t get anyone’s dander up, but it seems the font world resembles this remark. (do I get some caramel, or chocolate for bringing this round to on-topic?)\n\n"
    },
    {
      "time": " 20.May.2007 12.24pm",
      "content": "If I were actually supportive of the view, I could say not only the font world, but the WHOLE world.\n\n"
    },
    {
      "time": " 20.May.2007 12.36pm",
      "content": "And what about the Burning Man partners all suing each other right now over Burning Man trademark use? HA!\n\n"
    },
    {
      "time": " 20.May.2007 3.28pm",
      "content": "I am not a professional photographer. I have specifically made most of my non-portraits on Flickr creative commons-licensed, as I am very happy and flattered that my pictures have been used by:\n\na) Gibbs-Smith Publishers  \nb) The Washington Post  \nc) The San Francisco Chronicle  \nd) NPR/PRI’s Marketplace radio website  \ne) two dozen private clients  \nf) University of California Press, and many others.\n\nThis has led, in turn, to perhaps $10,000 worth of freelance work in the past two years.\n\nI think Creative Commons licensing is fantastic and a good way to grow your business if you are creative, open-minded and flexible enough to do it right. If you’re married to conservative and inflexible business models, though, you’ll always find someone to blame for a loss of business...\n\n—-\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20071010134716/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\")\n\n"
    },
    {
      "time": " 20.May.2007 3.42pm",
      "content": "\\>\\>\\>\\>\\>\\<\\<\\<\\<\n\n"
    },
    {
      "time": " 20.May.2007 3.42pm",
      "content": "\\>\\>\\>\\>\\>\\<\\<\\<\\<\n\n"
    },
    {
      "time": " 20.May.2007 3.56pm",
      "content": "I agree, jlt. The marketplace is changing VERY quickly, and those who catch it ahead of the curve are going to make some serious strides. For instance, there’s a young artist producing video diaries of her painting process, interspersed with “journal” entries about her life that week. She’s been doing this for several months, starting with about 1,000 views per week. Now she’s getting 600,000 views in a week, and selling her paintings and prints of those painting on eBay. It’s an incredibly creative business model! I can imagine sometime very soon, she will be extremely wealthy and pretty famous. And it looks like she’s about twenty two yrs. old.\n\nAs for you— I applaud your freelance success AND your marketing view as well.\n\nHaving said all that, the original poster called attention to someone on Flickr that specifically did NOT offer their work for free use, but had it taken anyway. That example has nothing to do with conservative and inflexible business models. That’s stealing.\n\n"
    },
    {
      "time": " 20.May.2007 10.41pm",
      "content": "Chuck, sorry, I should have been a bit more specific.\n\nI am as angry as anyone at those who steal folks’ work without paying for it.\n\nHowever, with his rallying cry to “Stop the open source style stealers,” Vince Connare reiterates the argument he’s made at least twice previously: that CC licensing, other cooperatively-made and freely distributed projects (i.e., sourceforge, project gutenberg, openoffice, etc.) and the open source movement in general are a bad idea and won’t ever produce anything worthwhile. So - THAT is what I was repsonding to.\n\nJLT\n\n—-\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20071010134716/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\")\n\n"
    }
  ]
}
