{
  "id": "33886",
  "title": "Adobe PDF Help",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey guys,\n\nTotally off the subject of typography, but I have a question about PDFs.\n\nI am trying to create editable fields and am able to do so inside Acrobat (I'm on 8 now, but created the form back in 6). I am able to edit the fields myself and save the PDF, however, when I send the form out to others, some are able to save it and some can't. For those who can't it gives a warning \"Please fill out the following form. You cannot save data typed into this form. Please print your completed form if you would like a copy for your records.\"\n\nI know the IRS has forms like this online. The same people who can't save my PDF can fill out the IRS' and save it. So I don't know what's going on. Does anyone have any ideas of what I'm doing wrong or not doing at all?\n\nThanks for the help!\n\nJohn\n\n",
  "author": "feldhouse",
  "time": "18 May 2007 — 12:31pm",
  "uid": "15269",
  "comments": [
    {
      "time": "18 May 2007 — 1:07pm",
      "content": "I've had this problem with a client before. You either need to downsave to an older version of Acrobat or they need to upgrade their copy of Reader.\n\n"
    },
    {
      "time": "18 May 2007 — 1:09pm",
      "content": "I just tried to get her to upgrade to Reader 8 but she is still having the same issue.\n\n"
    },
    {
      "time": "18 May 2007 — 1:18pm",
      "content": "Hmmm. Perhaps the standard questions are in order: what platform/OS version/etc. is she running? We also had one person who had problems upgrading as well (there's one in every crowd, I guess), and I ended up having to save it as an Acrobat 5 document, because she was on an ancient PC. Worked then.\n\n"
    },
    {
      "time": "18 May 2007 — 2:44pm",
      "content": "We're working on Windows XP company wide. I guess I'll try saving down to 4 or 5. Thanks for the help, Linda.\n\n"
    },
    {
      "time": "18 May 2007 — 2:59pm",
      "content": "Any time....\n\n"
    }
  ]
}
