{
  "id": "33880",
  "title": "Who owns the \"Linotype\" design rights (Geschmacksmusterrechte)?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Who owns the \"Linotype\" design rights (Geschmacksmusterrechte)?\n\nIn August 2006, nearly one year ago, Monotype Imaging Inc. is said to have acquired the Linotype GmbH from its German owner, the Heidelberger Druckmaschinen AG.\n\nBut apparently, Monotype only acquired Linotype as a naked company shell without the design rights (Geschmacksmusterrechte).\n\nIf Monotype had acquired the design rights too, then today, one year later, Monotype would be registered as owner of the design rights at the German and European design offices.\n\nBut this is not the case. I checked dozens of entries at the design offices and discovered that the Heidelberger Druckmaschinen AG is still the owner of the design rights.\n\nExample: Who owns the design rights to \"Zapfino\"?\n\nAnswer: Neither Linotype GmbH nor Monotype Imaging Inc. own the design rights to \"Zapfino\", because the design rights are still owned by Heidelberger Druckmaschinen AG.\n\nThe registration documents for \"Zapfino\" are difficult to locate. Therefore, for the convenience of readers, I scanned some of the public documents as evidence:\n\nFor the entries of the German design office see:\n\n[http://www.sanskritweb.net/temporary/zapf1.pdf](http://web.archive.org/web/20131013161939/http:/www.sanskritweb.net/temporary/zapf1.pdf \"http://www.sanskritweb.net/temporary/zapf1.pdf\")\n\n[http://www.sanskritweb.net/temporary/zapf1a.gif](http://web.archive.org/web/20131013161939/http:/www.sanskritweb.net/temporary/zapf1a.gif \"http://www.sanskritweb.net/temporary/zapf1a.gif\")\n\n[http://www.sanskritweb.net/temporary/zapf1b.gif](http://web.archive.org/web/20131013161939/http:/www.sanskritweb.net/temporary/zapf1b.gif \"http://www.sanskritweb.net/temporary/zapf1b.gif\")\n\nFor the entries of the European design office see:\n\n[http://www.sanskritweb.net/temporary/zapf2.pdf](http://web.archive.org/web/20131013161939/http:/www.sanskritweb.net/temporary/zapf2.pdf \"http://www.sanskritweb.net/temporary/zapf2.pdf\")\n\n[http://www.sanskritweb.net/temporary/zapf2a.gif](http://web.archive.org/web/20131013161939/http:/www.sanskritweb.net/temporary/zapf2a.gif \"http://www.sanskritweb.net/temporary/zapf2a.gif\")\n\n[http://www.sanskritweb.net/temporary/zapf2b.gif](http://web.archive.org/web/20131013161939/http:/www.sanskritweb.net/temporary/zapf2b.gif \"http://www.sanskritweb.net/temporary/zapf2b.gif\")\n\nNote that file zapf2.pdf was \"last updated on: 15/05/2007\".\n\nNote that above temporary files will be deleted in a few days.\n\nThe design office registrations are public evidence and cannot be refuted by Linotype or Monotype as \"false\" registrations. This has the following legal consequence:\n\nIf, for example, Linotype sells you a \"license\" to \"Zapfino\", you do not obtain a license to \"Zapfino\", because neither Linotype nor Monotype own the design rights to \"Zapfino\" and hence cannot sell any licenses to these design rights.\n\nThe same is true for other \"Linotype\" fonts. By generalisation we can say:\n\nWho buys fonts at Linotype, gets nothing, because Linotype owns nothing.\n\n",
  "author": "Uli",
  "time": "18 May 2007 — 8:45am",
  "uid": "11274",
  "comments": [
    {
      "time": "18 May 2007 — 10:20am",
      "content": "\\> Who owns the “Linotype” design rights (Geschmacksmusterrechte)?\n\nYes.\n\n\"Seriously\": I'm sure it's some so-called lawyer.\n\nhhp\n\n"
    },
    {
      "time": "21 May 2007 — 12:03am",
      "content": "Who cares?\n\n"
    }
  ]
}
