{
  "id": "339",
  "title": "HELLOOO!!! Ever heard of optical masters!?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I just had to tell someone who would understand my pain. my art director handles (clutches onto) nearly all of our packaging projects. the problem with this is that he is really quite terrible with type. every time he creates a new package, I squirm and argue a bit--to no avail. I'm able to do something to salvage much of the other material we produce, but with packaging, he wants it all to himself.   \n   \nthe straw that has snapped my spine in two is his using Adobe Garamond \\*Titling\\* at 6pt on a re-packaging that was just completed. when I brought up the intended use of such a design early on, he simply informed me that he liked the fine detail of this font and thought it was absolutely appropriate for the job at hand. of course, the silk-screened version of this face on the clear plastic bottles that just came in looks like crap at 6pt (and the other various small sizes he used it at). sometimes it's really hard to work with this guy!\n\n",
  "author": "plainclothes",
  "time": "15 Apr 2002 — 5:28pm",
  "uid": "872",
  "comments": [
    {
      "time": "15 Apr 2002 — 5:53pm",
      "content": "...have the clients chew him out since will not listen to you. If they don't, then I guess he did a fine job as far as they are concerned, and it is just your typographic super ego we have to deal with. (as you know there is plenty of other typographic prey to feed it-so don't stress it)\n\n"
    },
    {
      "time": "15 Apr 2002 — 6:48pm",
      "content": "It sounds like your art director is a typographic retard.   \n   \nNext time, try some psychological warfare: when he's about to make a stupid decision, just smile -as if to yourself- and don't say anything... You might be surprised at the results.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Apr 2002 — 11:29am",
      "content": "to my great displeasure, I'm working in-house -- in order to finish my degree, i need the flexible schedule and relatively short hours they provide. the relevance of this is that here this guy is considered a creative god. no matter how many times we have to repackage, deal with consumer complaints, etc. he's always the greatest! funny thing is, everything he has done for the past two years to \\_save\\_ the company image has been a \\*direct\\* rip-off from some other similar company who has had some level of success. the worst thing is, since he is such a hap-hazard designer, he always ends up with a very sloppy translation of something that was less than inspiring in the first place (he never chooses to rip-off spectacular work).   \n   \noh well! this place is certainly alot better than strict production work. certainly, when the degree is done, I can start checking out some more inspiring workplaces. for now, I just don't have the time or energy.\n\n"
    }
  ]
}
