{
  "id": "3390",
  "title": "Absolute Minimal",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "I like to fit as much information as I can into as tight a space as possible.   \n   \nI am a masochist with good eyesight.   \n   \n ![1,absolute_minimal.png](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n",
  "author": "fluffy",
  "time": "21 Sep 2002 — 7:13pm",
  "uid": "1216",
  "comments": [
    {
      "time": "21 Sep 2002 — 7:17pm",
      "content": "Argh. I didn't realize typophile didn't allow PNG attachments. Let's try this again...   \n   \n ![absolute_minimal.gif](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/messages/29/2760.gif)\n\n"
    },
    {
      "time": "21 Sep 2002 — 7:55pm",
      "content": "![psa_dontsteal](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "21 Sep 2002 — 7:58pm",
      "content": "Argh.   \n ![1,psa_dontsteal.gif](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "21 Sep 2002 — 8:01pm",
      "content": "Argh.   \n ![1,copion.gif](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "21 Sep 2002 — 8:17pm",
      "content": "Argh.   \n ![1,copion.jpg](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "21 Sep 2002 — 8:57pm",
      "content": "Miguel? Did you mean this?   \n   \n ![psa_dontsteal](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/messages/29/2762.gif)   \n   \nExplain.\n\n"
    },
    {
      "time": "21 Sep 2002 — 9:20pm",
      "content": "Sorry for the messy posts, the idea is discuss about steal here, with open mind ok? ;)   \n   \nAbsolute \"Minority\" looks like \"three dots...   \n   \nMiguel\n\n"
    },
    {
      "time": "22 Sep 2002 — 11:21am",
      "content": "Miguel, I think the idea of \"stealing\" and   \nplagiarism in low-res bitmap fonts is elusive to   \nsay the least. There's only so much one can do   \nwith that few pixels. In the case in point, the   \nidea is not terribly original anyway, and as one   \nreduces the design grid, solutions naturally   \ntend to converge. Of course, there's always   \nscope for some personality: for instance, your   \nThree-Dots 'E' is rather original (and not very   \nlegible ;), but it's in any case slightly similar   \nto the one in an [exercise](http://web.archive.org/web/20150414235621/http:/www.typophile.com/forums/messages/30/753.html#POST4768) done by a student   \nof mine a few years ago - and you didn't know   \nit (of course, the art-déco guys had done this   \nsort of 'E' 70 years before Gustavo or you ;).   \n   \nI'd think very hard before deciding that a low-res   \nbitmap font was \"stolen\". Having said that, I   \nshould add that I didn't bother to enlarge the   \nimage of Absolute Minimal to check if there's   \nany unexpected similarity to your design.   \nCheers.\n\n"
    },
    {
      "time": "22 Sep 2002 — 2:58pm",
      "content": "I'd never seen any absolute minimal bitmap font before. I'm sure I'm not the first to do one, and yeah, there's not that many ways to do a 3x3 font (I mean, there's only 512 unique 3x3 bitmaps altogether, most of which do not actually represent a letter. ![:)](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI only discovered this site very recently (yesterday, in fact) and in a cursory examination of the forums, I didn't find another minimal font. Also, I'd like to point out that I did the tiny font [way back in March](http://web.archive.org/web/20150414235621/http:/www.kuro5hin.org/story/2002/3/12/20853/2238). You might want to consider that before accusing me of plagiarism.\n\n"
    },
    {
      "time": "23 Sep 2002 — 12:02am",
      "content": "The Word \"STEAL\" is terrible, so its the reason for the discuss (I think that im too sensible to the idea of someone´s s\\_\\_\\_\\_\\_ something post here)   \n   \n\\>Rodolfo: Im agree with working with tree pixels is hard to do something original who keeps the legibility, and the work done of your student is not similar to mine. The \"e\" have 1 pixel more than mine ;), but i think that im done the best   \n(right, the best means keeps the legibility)design with three pixels...and you`re right cause i didnt think very hard using the ugly word..   \n   \n\\>Magenta:I did \"Minoriry\" before, so that´s all.   \nI consider that to accusing you, cause is arrogant to pretend that im the only designer who made the most beauty 3 pixels high bitmap font ever ![:)](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n-There´s a fact if that if someone did similar font designs somewere before discover this site or other work, are pure coincidence so i think that is too hard too consider that something is original, exept for the quatity of the design.(?)   \nCheers.\n\n"
    },
    {
      "time": "23 Sep 2002 — 9:23am",
      "content": "miguel, i'm not understanding. you were the one to bring up the concept of stealing (if you did mean to post the image that joe posted), and then you back away from it, saying it's a terrible word and doesn't apply to the situation. so why bring it up in the first place? accusations like this should not be made lightly, even if it's in the spirit of \"discussion\"...\n\n"
    },
    {
      "time": "23 Sep 2002 — 9:39am",
      "content": "Ok. The point speaking about steal is :There´s a fact if that if someone did similar font designs somewere before discover this site, and then put here with a suspect similarity. For the first time that i saw magenta`s absolute i feel disapointed.. understand? i never back away any idea before someone prove it! ;)\n\n"
    },
    {
      "time": "23 Sep 2002 — 9:44am",
      "content": "Miguel:   \n\\> Rodolfo: Im agree with working with three pixels   \n\\> is hard to do something original who keeps the legibility,   \n\\> and the work done of your student is not similar to mine.   \n\\> The \"e\" have 1 pixel more than mine ;),   \n   \nYes, of course. Like the quality of your work, that's not   \nin dispute. His was a 4-pixel design (huge!). But on the   \nother hand ... he did a lower-case! ;)   \n   \nI wasn't saying, BTW, that his work was similar to yours,   \nI only mentioned that particular 'E' structure to show   \nthat coincidences do exist.\n\n"
    },
    {
      "time": "23 Sep 2002 — 6:29pm",
      "content": "I don't think it's even possible to do a complete lowercase in only 3 pixels.   \n   \nFWIW, MANY years ago (like, 1996) I did a 3x4 pixel font for some old DOS software of mine (which had a complete symbol set and a lowercase and so on). I might actually still have it around somewhere, too. I don't want to get into a \"I did it first\" battle though. :P\n\n"
    },
    {
      "time": "23 Sep 2002 — 7:06pm",
      "content": "I found it, and it was indeed 3x4 (not counting the 1-pixel intra-character spacing, which some characters make use of for descenders etc.), dated November 4, 1996. The file format I used back then (my own custom bitmap font editor) was pretty simple so I was able to convert it pretty easily.   \n   \nDon't mind the first few columns of characters; they're IBM extended ASCII stuff (smileyfaces and arrows and so on). They made sense at the time. ![:)](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n ![tinyfont.gif](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/messages/29/2768.gif)\n\n"
    },
    {
      "time": "24 Sep 2002 — 12:44pm",
      "content": "Sorry, is an absolute mess.\n\n"
    },
    {
      "time": "24 Sep 2002 — 3:10pm",
      "content": "Magenta, if you get rid of the grey gridlines   \nand organize your characters in a normal   \nhorizontal order, with some space between   \nlines, it will be easier to see something.   \n   \nAt least I was able to _decode_ \"Hello\" there.   \n;)\n\n"
    },
    {
      "time": "24 Sep 2002 — 11:43pm",
      "content": "Yeah. That was just the most convenient way to deal with it in the format that I had it stored in. Also, it was harder to read without the guidelines. It's not intended to be a good font, anyway, it's just to show a font I did back in 1996. ![:)](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI don't want to spend more time dredging it up than absolutely necessary, I just wanted to show that these ideas weren't exactly \"new\" (and I know that even in 1996 I wasn't the first to do them, since when I showed it to friends, a couple of them said, \"Yeah, I've done something like that too\").   \n   \nIt seems to be a very common thing for people to do when bored. ![:)](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nOoh, now this other font I did in 1996 (which I called 'futura' though I know that name's already taken) actually looks pretty good. I think I'll do a proper job of organizing it for a post here...\n\n"
    },
    {
      "time": "25 Sep 2002 — 9:11pm",
      "content": "Here we go, a proper image of it.   \n   \n ![minimal.gif](http://web.archive.org/web/20150414235621im_/http:/www.typophile.com/forums/messages/29/2783.gif)\n\n"
    },
    {
      "time": "26 Sep 2002 — 8:01am",
      "content": "\\>Looks better,please check out: [http://www.typophile.com/forums/messages/29/803.html?1013654745](http://web.archive.org/web/20150414235621/http:/www.typophile.com/forums/messages/29/803.html?1013654745)   \n   \n   \nMiguel\n\n"
    },
    {
      "time": "26 Sep 2002 — 8:23am",
      "content": "Miguel, it looks \\*nothing\\* like what you've done.   \nPlease let other people do good work too.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Sep 2002 — 11:08pm",
      "content": "Sorry I dont like both. I want to read it but it is very hard. I need my eyes! Yes it is a funny font but where will you use it?   \n   \nBut thats just a Critique... ;-)   \n   \nGreets Jens\n\n"
    }
  ]
}
