{
  "id": "33901",
  "title": "Freelance Collaboration logotype",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone,\n\nAnother freelance Graphic Designer & I have decided to associate,  \nand here is the logotype we've vcreated for our collaborative work.  \n\"fluonoir\" means \"fluorescentblack\" in French.  \nPlease feel free to criticize it (pros and cons).\n\nThx a lot. Virginie\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/fluonoir_4321.jpg)\n\n",
  "author": "drduckling",
  "time": "19 May 2007 — 5:04am",
  "uid": "14086",
  "comments": [
    {
      "time": "19 May 2007 — 7:26am",
      "content": "Well, I for one like it a lot, both the name & the logo although I would suggest sharp edges for the lightning. Otherwise it's very pleasing to the eye.\n\n"
    },
    {
      "time": "19 May 2007 — 7:44am",
      "content": "I like the type.\n\n"
    },
    {
      "time": "19 May 2007 — 8:09am",
      "content": "I agree with you ill sans, I think the lightening edges should be a little sharper (though not absolutely sharp, just less round...).  \nAnyway, thank you both for ur comments. Any others ?\n\n"
    },
    {
      "time": "19 May 2007 — 9:40am",
      "content": "Hmmmm, it's not bad but...\n\nI think it's conceptually problematic because there is no such such thing as fluorescent black as the logo so clearly shows in all its normal black and dirty mustardness.\n\nFluorescent Black as a name feels like you're trying to hard to be clever in some post modern kind of way.\n\nI sort of get it, but just how is a lightning cloud symbolic of fluorescent black?\n\nThe cloud could be better. The left bulge feels too big and some curves just look like parts of circles. The bottom curve eats into the lightning's space.\n\nThe lightining is dwarfed by the cloud, looks cramped and might be better if the middle 'stroke' didn't have 2 angles. At small sizes the lightning may get lost and the whole logo could look more like a cartoon speech/thought bubble.\n\nI like the font, but I would join the first 'o' to the 'n'. The f is a bit lost and maybe more could be done with the fl ligature. Maybe the terminals of the f and r could end more sharply to echo the lightning.\n\nSorry. I'm feeling rather picky today.\n\n"
    },
    {
      "time": "20 May 2007 — 3:28am",
      "content": "Let me tell you a little bit more about the name and the logotype : we chose \"black\" as it's the result of CMY(K) for print and RGB for screen as we're print & web Graphic Designers... The \"fluo\" thing was kind of a joke since (obviously) fluorescent black doesn't exist, it underlines the \"true nature\" of our professional activity which is creativity / inventivity. which brings us to the cloud and lightening that clearly evoks that (intense) creative process (cloud = imagination - lightening = idea). Pretty simple, ain't it?... At least, not as pretentious as you seem to think it is. : P\n\n"
    },
    {
      "time": "20 May 2007 — 5:18am",
      "content": "Here is the CMYK variation of the logotype with a sharper lightening.  \n(Jon can you post those files you mentionned in your e-mail?)\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/CMYK_6506.jpg)\n\n"
    },
    {
      "time": "20 May 2007 — 10:18am",
      "content": "Here's an image to show some of what I suggested above...\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/FluonoirLogos_5663.jpg)\n  \nI'm not sure if the colour spectrum effects are cheesey, over the top or just crap, but it does kind of validate the Fluonoir name in a way.\n\nI don't think the name is pretentious. I just wasn't too sure about the nonsensical juxtapostion.\n\nI like the concept of the lightning cloud representing creativity. It makes sense in a nicely poetic way.\n\nBTW In the Chinese I Ching one of the 8 trigrams is Zhèn/Chên, which is thunder (that obviously comes from a lightning cloud) for symbolising the arousing, movement, activity, shock and growth. Which is good :)\n\nBTBTW In my ridiculous youth I got a lightning cloud tattoo :/\n\n"
    },
    {
      "time": "20 May 2007 — 12:20pm",
      "content": "You know what? I actually kinda like what you did!!!  \nI think it needs to be \"improved\" but I like the flat bottom of the cloud I also like (contre toute attente) the lightening in the prolongation of the \"n\" and I like the spectrum I think it has some kind of 80's vibe.\n\n"
    },
    {
      "time": "20 May 2007 — 12:29pm",
      "content": "Thank God, I got a dingbat tattoo instead of a lightning cloud ;-)  \nThe flat bottom of the cloud and the extension of the \"n\" in the lightning are good improvements, but I liked the first colour best (I assume it was a yellow/black gradient), somehow that's how I picture fluorescent black...\n\n"
    },
    {
      "time": "20 May 2007 — 12:44pm",
      "content": "My own tattoo is quite hard to explain...  \nit's half a pear half a cello and it has \"dharma\" written in Sanskrit in it's \"belly\"...\n\n"
    },
    {
      "time": "20 May 2007 — 12:54pm",
      "content": "With all my efforts, I can't imagine what that would look like, but maybe that's just the alcohol effecting my brains ;-)  \nI just have the capital \"H\" from Nat Vignette tattooed on my lower back & a nice little dragon on my lower left wrist.  \nThere's this guy, Raoul Wassenaar, who actually had the name Helvetica tattooed on his lower right arm... Damn, I wish I had thought of that first! Very Rock & Roll in a designer kind of way!\n\n"
    },
    {
      "time": "20 May 2007 — 1:18pm",
      "content": "Absolutely!  \nMine's on the inside of my lower right arm...  \nI suggest you guys post pictures of yours, I'm gonna try take a picture of mine and post it here too... (I wanna see the lower back one especially, hehehe)\n\n"
    },
    {
      "time": "20 May 2007 — 1:37pm",
      "content": "Too bad for you I haven't got a digital camera then. Anyway, it looks like this: [http://www.myfonts.com/fonts/paratype/nat-vignette/one/mac-t1/213930/cha...](http://web.archive.org/web/20140307100938/http:/www.myfonts.com/fonts/paratype/nat-vignette/one/mac-t1/213930/character/0048/CP4/1/ \"http://www.myfonts.com/fonts/paratype/nat-vignette/one/mac-t1/213930/character/0048/CP4/1/\") but in green. The dragon is in green too.  \nIsn't this supposed to be a thread about your logo BTW? ;-p  \nJust out of curiousity: what have you got tattooed on your lower right arm? The Helvetica tattoo is really cool, maybe you can see it if you google for Raoul Wassenaar...\n\n"
    },
    {
      "time": "20 May 2007 — 3:28pm",
      "content": "I like the shape BUT I have no idea what it represents. What is fluorescent black anyway and how does that relate to a lightning bolt from a cloud. What are you representing? I think giving that information should be valid.  \nI hate gradients and color spectrums. Why are you doing it? Is there a need for it? Why make it so glowy? Out of all of them I prefer the solid black with the white type.  \nI'd try a lot more typefaces. Why are you sticking to just that?  \nWhy are you not exploring more concepts instead of just sticking with the one you chose?  \nI think you should push yourself a lot further before deciding on a logo mark.\n\n"
    },
    {
      "time": "20 May 2007 — 3:43pm",
      "content": "_You know what? I actually kinda like what you did!!!_\n\nGee thanx. No need to sound so surprised ;P\n\nWhat does \"contre toute attente\" mean?\n\n_I like the spectrum I think it has some kind of 80’s vibe_\n\nI think the spectrum colour effect has that French retro dance/funk/disco culture vibe. It made me think of this...\n\n[http://www.dailymotion.com/video/x1upou\\_justice-dance](http://web.archive.org/web/20140307100938/http:/www.dailymotion.com/video/x1upou_justice-dance \"http://www.dailymotion.com/video/x1upou\\_justice-dance\")\n\nHow cool is that? Sure is some groovy type in the video too.\n\nMaybe you could try a version of the logo where you loosen it up in a hand drawn funky/graffiti style inspired by some of the stuff in the video. It might give a feeling of spontaneous creative thought better than the clean cut italic font and precise geometry you have now.\n\nIf you stick with your rounded terminals on the f and r maybe you could work it so they are positioned at the centre of their respective cloud curve circles.\n\nI look forward to seeing it “improved” as you put it ;)\n\n_I suggest you guys post pictures of your (tattoo)_\n\nSorry, my tattoo is only available for private viewings. It's on my penis.\n\n_My own tattoo... ...has “dharma” written in Sanskrit_\n\nJust out of curiosity, in just a few words, what does the word dharma mean to you?\n\n"
    },
    {
      "time": "20 May 2007 — 3:52pm",
      "content": "Leapingazelle, you really should read the whole thread before commenting and not make so many assumptions.\n\nBTW you're out of touch. Spectrums are back in dude.\n\n"
    },
    {
      "time": "21 May 2007 — 4:10am",
      "content": "I had to look up the word \"dharma\", it didn't mean anything to me.\n\n"
    },
    {
      "time": "21 May 2007 — 4:10am",
      "content": "I had to look up the word \"dharma\", it didn't mean anything to me.\n\n"
    },
    {
      "time": "21 May 2007 — 7:24am",
      "content": "\"Pretty simple, ain’t it?… At least, not as pretentious as you seem to think it is.\"\n\nWell, I thought the explanation was a tad pretentious. ;o)\n\nNothing wrong with the cloud and lightning and a slightly goofy name, though. They work together well...just don't expect clients to 'get' or even care why you came up with the name. ;o)\n\n"
    },
    {
      "time": "21 May 2007 — 10:05am",
      "content": "Go with a flat bottom. It says thunderhead. Rather than mix the two colors in a murky gradient, have you tried flourescent ink and black ink for the two seperate parts? Several combos could work:  \n1. black cloud, flour text, white page  \n2. flour cloud, black text, white page  \n3. white cloud, black text, flour page\n\nEtc.\n\nI think that would give it the zing required and keep you 100% gradient free.\n\n"
    },
    {
      "time": "21 May 2007 — 10:26am",
      "content": "I agree with randy with taking the gradient away and spicing it up with the fluourescent ink.  \nIt would definately give it an elegent and edgy touch\n\nabout my last post, I was just trying to throw some suggestions, i wasn't trying to be arrogant. the typeface i think is fine, I just thought that it would be nice to see a bunch of the different typefaces that you tried because we have nothing to really compare it to.\n\nBest\n\nGhaz\n\n"
    },
    {
      "time": "21 May 2007 — 11:38am",
      "content": "Randy/Gahz, exactly what colour would the fluorescent ink be and how would it be conveyed on screen?\n\nIt would have to be something other than black which would then contradict the name Fluonoir.\n\nGahz, I didn't suggest that you were arrogant. It was just clear from your questions that you hadn't read the whole thread and made an assumption on how many concepts were explored before this one was posted. See Virginie's third post for her explanation of what the lightning cloud represents.\n\n_ **100% gradient free** _\n\nSounds like a tagline on a pack of organic food.\n\n"
    },
    {
      "time": "21 May 2007 — 11:51am",
      "content": "One other thought on the type. Usually, trying to transform and italic into a connected script is problematic. In this case it's giving you a zig zag effect that works well with the lightning. The same kind of thing going on here:\n\n[http://www.milwaukeetool.com/](http://web.archive.org/web/20140307100938/http:/www.milwaukeetool.com/ \"http://www.milwaukeetool.com/\")\n\nThe cloud gives the design a playful feeling, whilst the type suggest a more understated approach. Not knowing your combined styles, it's hard to make a recommendation on type. I do think drawing the type from scratch in a more bolder and more lively style (think Calcite or Fakir) would unify the design.\n\nAnd one other thing: consider connecting fluo and noir as in the \\*noi\\* join rather than two separate words. It would enhance the lightning rythm in the italic.\n\n"
    },
    {
      "time": "21 May 2007 — 12:50pm",
      "content": "here are my 2 cents:  \n-what if the sharpness/roundness of the bolt reflects the shape of dot in the \"i\" in noir?  \n-i dont dislike the idea of a flat bottomed cloud, but it starts looking more like a tree than a cloud..(to me)\n\n-although i think people are on the right track telling you to connect fluo-noir, i think its also important to consider those are the 2 words and there is a logical separation.. so i wouldnt be sure that just connecting them is tooootally the right approach\n\noverall its nice, but kind of similar to other styles found in that somewhat cliché \"web2.0\" look that is EVERYWHERE!\n\ngood luck.\n\n"
    },
    {
      "time": "21 May 2007 — 4:02pm",
      "content": "OMG, I'm gonna read all those comments tomorrow morning, I was out for the day...  \nAnyhow thank you all for your opinions...\n\n"
    },
    {
      "time": "21 May 2007 — 4:05pm",
      "content": "PS to WormWood : I love \"Justice\" (listen to : we are your friends)\n\n"
    },
    {
      "time": "21 May 2007 — 4:09pm",
      "content": "PS to Ill Sans : for \"Dharma\" look up \"Buddhism\"...\n\n"
    },
    {
      "time": "21 May 2007 — 4:10pm",
      "content": "Jeff, I'm really surprised (and not happy) about the \"web 2.0 cliché\" thing, can you be more specific...?\n\n"
    },
    {
      "time": "21 May 2007 — 4:15pm",
      "content": "leapinggazelle, this is not the first logotype I came up with, for christ sake !!!  \nI posted the result that I like the most...  \nAs it probably needs some more \"peaufinage\", I exposed it to the typophile critiques to get some feedback. So please don't assume I haven't done any research before posting that one...\n\n"
    },
    {
      "time": "21 May 2007 — 4:31pm",
      "content": "If you are going to go with a flat bottom make it flat ... Also I think the lightening needs to shift over a bit more.\n\nThis is fun. I like the name. If you can't have fun with the name of your own company when can you have fun!?\n\nThe inks are a little on the muddy side, but I am not so sure about the neon rainbows. What about randomly picking from the rainbow?\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/likezees_FluonoirLogos_5663_5261.jpg)\n\n"
    },
    {
      "time": "21 May 2007 — 9:12pm",
      "content": "I also think the best solution would be to change the rainbow glow into a single color glow -- green, as it associates best with fluorescence.\n\nAlso is there any chance you could fine-tune the letters to make them really connect? \"fl\" seems to be no real ligature, and the connection of \"lu\" and \"ir\" are terrible. Maybe you want to consider using Adobe Caflish which provides very nice contextual alternatives that connect perfectly with each other:\n\n[http://www.adobe.com/type/browser/P/P\\_1725.html](http://web.archive.org/web/20140307100938/http:/www.adobe.com/type/browser/P/P_1725.html \"http://www.adobe.com/type/browser/P/P\\_1725.html\")\n\n"
    },
    {
      "time": "22 May 2007 — 4:07am",
      "content": "the fl is the actual ligature of Calisto MT, I like the font you suggested henrypijamas\n\n"
    },
    {
      "time": "22 May 2007 — 4:08am",
      "content": "henrypijamas,  \nthis is the actual fl ligature of Calisto MT...  \nI like the font you suggested though.  \nworking on it!\n\n"
    },
    {
      "time": "22 May 2007 — 6:45am",
      "content": ""
    },
    {
      "time": "22 May 2007 — 6:46am",
      "content": "Here is an improved version of the typographic signature...  \nI worked on the ligatures, i'm not too sure about the end of the \"r\" though...\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/fln_6172.jpg)\n\n"
    },
    {
      "time": "22 May 2007 — 8:23am",
      "content": "Better \"r\"...\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/fln2_4434.jpg)\n\n"
    },
    {
      "time": "22 May 2007 — 8:23am",
      "content": "Better \"r\"...\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/fln2_4434.jpg)\n\n"
    },
    {
      "time": "22 May 2007 — 3:28pm",
      "content": "The more I look at it the more I like it. I just really didn't like the spectrum thing and it came out as anger...\n\nSorry I didn't mean to assume that you didn't try other logotypes and I guess I didn't read the post properly that it was a logo representing two people's collaborative work. So, that doesn't need any more explanations. I thought it was for a client.\n\nThe ligature is really nice and the round edges of the type embrace the soft round edges of the cloud and the ligatures do the same with the lightning bolt.\n\nI like the idea of the cloud glowing but not with a million colors. Maybe on black it could be a yellow and on white it could be another color, maybe like a pink or something.\n\n"
    },
    {
      "time": "23 May 2007 — 12:51am",
      "content": "So what do you guys like better : the round \"f\" and \"r\" or the sharper one ?\n\n"
    },
    {
      "time": "23 May 2007 — 5:47am",
      "content": "I would just use the type itself. Really like the improvement of it! In my point of view, the cloud makes the logo childish and unseriuos...\n\n[www.zwoelf.hu](http://web.archive.org/web/20140307100938/http:/www.zwoelf.hu/ \"www.zwoelf.hu\")\n\n"
    },
    {
      "time": "24 May 2007 — 7:29am",
      "content": "zwoelf, thank you for your comment.  \nBut I think we're gonna stick to the cloud+lightening sign with the typographic signature.\n\nHere is the retouched version. What do you think?  \nDid you guys prefer when the lightening was imitating the slope of the italic or now that it's parallel to the cloud?\n\nI'll take care of the color/spectrum/gradient thing in a second time.\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/flnlogo_4070.jpg)\n\n"
    },
    {
      "time": "24 May 2007 — 7:35am",
      "content": "I liked the first lightning better, the \"straight\" version doesn't really have that lightning zest, it lacks power or something less obscure ;-)\n\n"
    },
    {
      "time": "24 May 2007 — 3:35pm",
      "content": "Right!  \nWhat about that then?\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/thunderbird_6684.jpg)\n\n"
    },
    {
      "time": "25 May 2007 — 3:08am",
      "content": "Better, but still not as good as the original. Sorry...\n\n"
    },
    {
      "time": "25 May 2007 — 4:29am",
      "content": "Do you mean the very first one...?  \nBecause it gave that dymanic feeling because it was on the side  \nand cropped by the \"fluffy\" cloud.  \nIf I use the flat bottom cloud and that same lightening it looks like that last post...\n\n"
    },
    {
      "time": "25 May 2007 — 5:22am",
      "content": "I meant the very first, \"slanted\" lighning, yes & I think if you decide to go with the flat bottom, it works well in the example Miss Tiffany posted here. I have taken a look again at the very first draft & indeed the fluffly cloud seems to add a bit more spice to the lightning. All in all, I think Miss Tiffany's example is the perfect solution.\n\n"
    },
    {
      "time": "25 May 2007 — 7:23am",
      "content": "I think the ligtening in the last one is way too whimpy.\n\nI do like the type, but seems to be it's not quite a good match for the big, poofy clouds. Can you beef up the type a bit?\n\n"
    },
    {
      "time": "29 May 2007 — 9:10am",
      "content": "Last but not least !  \nAny comments ?\n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/finalduofemale_5369.jpg)\n  \n\n ![](http://web.archive.org/web/20140307100938im_/http:/typophile.com/files/finalduomale_4115.jpg)\n\n"
    },
    {
      "time": "29 May 2007 — 10:04am",
      "content": "It's a shame about the cloud, but I think we've got a winner!  \nThis looks really classy (I prefer the circles) & definitely suitable for a design studio. The cloud worked as well, but indicated a kind of playfullness which is now replaced by pure class & professionalism (not that the cloud could not work as a professional logo, but it would certainly attract different customers).  \nThe question you need to ask yourself & your partner at this point is what's primary to you 2? Do you opt for the younger playfullness of the cloud or the professional class of your latest design?  \nEither way, I absolutely LOVE the new circle logo!\n\n"
    },
    {
      "time": "29 May 2007 — 1:52pm",
      "content": "Hi Virginie,\n\ni am joining this discussion at a rather late point, but I feel the need to say: Please don't loose that fabulous cloud. When i saw your first post, my initial reaction was \"Yes, this i great.\" It looked fresh without trying to hard or being pretentious. Well done.\n\nThe new logo concepts are good, but in my opinion feel too safe, especially after seeing some of your work on your site.\n\nI hope you and your partner find a logo that works for both of you.\n\n"
    }
  ]
}
