{
  "id": "33913",
  "title": "Standard Type Size Increments",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for some background on the traditional scale of sizes used for type sizes: 8 ... 12, 14, 18, 24, 36, 48, 60, 72, 96 etc. I am interested in finding out what the progression is. Why is it so handy for creating contrasts of size, for example, 36 pt heading with either a 24 pt. or 18 pt. subhead? As opposed to something more arbitrary, like 43 pt with 21.5 pt subs? How would the progression extend to very large sizes (say, above 120).\n\nI appreciate any thoughts from anyone less numerically challenged than myself.\n\nJim\n\n",
  "author": "hanneman",
  "time": "19 May 2007 — 10:54pm",
  "uid": "2314",
  "comments": [
    {
      "time": "20 May 2007 — 5:05am",
      "content": "The de facto standard list of point sizes used across many computer programs probably got its start with the original Macintosh, which, due to technical limitations, came with matching bitmapped screen and printer fonts for only certain point sizes. If I recall correctly, the list was 9, 10, 12, 14, 18, and 24 for most fonts. (There were a few oddball fonts that didn't follow that rule; for example, I remember Venice being available in only 14, and Athens and San Francisco being available in only 18. But these were the exceptions.)\n\nI believe that most of the standard point sizes in use today were chosen because they're divisible by six, which makes them both easily halved and easily divided by three.\n\nAt smaller point sizes, you need finer granularity, which is why the list starts out with small steps. But beyond, say, 36 points, there is very little to be gained from offering default sizes in a smaller increment than six. If user wants something around 50 points high, he can just select 48 from the list, and then manually adjust it later if 48 turns out to be a bit too small.\n\nAbove a certain size (maybe at 48 points), it would probably be practical to increase the default increment to 12 points, and later to 24.\n\n"
    },
    {
      "time": "20 May 2007 — 6:38am",
      "content": "As an Alphatype shop - the progression was:  \n6, 12, 18, 24, 36, 48\n\nWhen Alphatype created new typesetting equipment that went beyond 48 points - it continued wiht  \n64 and 72.\n\nSome how there is some rhyme and reason to it - the point system itself in increments of 12.\n\nIf you ever look at old type speciman books, the ones designed to help designers do proper character counts for lines, these were set as standards.\n\nI remember in the 1950s when artists were able to start using typositor for headlines - that started the change in headline sizes. Stat cameras were available to reducing and increasing type - most artist would ask that the Cap Height would be in \"inches.\"\n\nIt may also have to do with what was the most popular sizes being sold in hot metal. - This is only an educational guess and not fact. A typeshop had to buy type sizes in lead - and several ofr the same point size. (After all, how many lowercase Es do we use in a paragraph?)\n\nWhen cold type came about - the manufacturers used standards to make their master fonts. Mergenthaler used 6 point type - and blew it up - which is why their type always \"chunky.\" Compugraphic used 24 point masters - creating all their point sizes from that. I was Alphatype, because they used several point sizes to create their masters, so the type set from them was closer in feeling, positioning, to hot metal type.\n\nI just wonder if this was another one that the answer to the real question was money...\n\n"
    },
    {
      "time": "20 May 2007 — 11:15am",
      "content": "Check this page out.\n\n[http://www.sizes.com/tools/type.htm\"\\>](http://web.archive.org/web/20141226010905/http:/www.sizes.com/tools/type.htm)\n\n"
    }
  ]
}
