{
  "id": "33920",
  "title": "American Design",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Why do Americans insist on using 3D bevel text and script typefaces for their signage.............or am I just seeing one side of things!!!!!\n\n",
  "author": "andrewkerrb",
  "time": "20 May 2007 — 3:08pm",
  "uid": "18696",
  "comments": [
    {
      "time": "20 May 2007 — 4:25pm",
      "content": "Seems a bit like saying \"Why do Scots insist on using Flash for their websites?\" \\*grin\\*\n\nMy son worked at a shop that did vehicle and shop signage for two years, and I don't he ever did 3D bevel text. I know he complained about some people asking for script, but often he could convince them to do otherwise, on the basis of legibility.\n\n"
    },
    {
      "time": "20 May 2007 — 7:08pm",
      "content": "I really can’t remember the last time I saw 3D beveled text in signage. In what part of the country did you see these icky signs?\n\n"
    },
    {
      "time": "20 May 2007 — 9:22pm",
      "content": "Because most of the people doing signage are not designers, but sign companies who don't know any better. Americans are about faster and cheaper, and not always better unfortunately.\n\n"
    },
    {
      "time": "21 May 2007 — 6:47am",
      "content": "Without examples it hard to know where the hasty generalization is coming from.\n\n"
    },
    {
      "time": "21 May 2007 — 7:20am",
      "content": " ![](http://web.archive.org/web/20130825232945im_/http:/typophile.com/files/carved_480x360_3667.jpg)\n\n"
    },
    {
      "time": "21 May 2007 — 8:34am",
      "content": "Somehow I don't think he was talking about hand-carved, gilded wooden signs. I'm not sure what's up with the different colors in the outlines, but the rest of the sign looks pretty nice.\n\n"
    },
    {
      "time": "21 May 2007 — 2:54pm",
      "content": "It was a hasty generalisation..............it was my first post and I was happy to get any response....\n\nHello.\n\n"
    },
    {
      "time": "21 May 2007 — 8:13pm",
      "content": "Hi Andrew. Looks like you took the link down, but I was browsing through your website earlier. I wouldn't mind seeing some of the images larger, like The Gateside Inn. I'm a sucker for gilded dimensional letters. You do some very nice work.\n\n"
    },
    {
      "time": "22 May 2007 — 1:27pm",
      "content": "russ.....that's a v section moulded resin letter.........trajan I think....with threaded rod fixing so it sits flush.\n\nCheers\n\n ![](http://web.archive.org/web/20130825232945im_/http:/typophile.com/files/resin_3716.jpg)\n\n"
    },
    {
      "time": "22 May 2007 — 10:36pm",
      "content": "It's a nice look. Especially on the black background.\n\n"
    },
    {
      "time": "4 Dec 2012 — 11:14pm",
      "content": "Americans consist a unique designs of an [irvine signs](http://web.archive.org/web/20130825232945/http:/www.americasinstantsigns.com/ \"irvine signs\") that looks so good for attaining their shops or clubs.\n\n"
    },
    {
      "time": "5 Dec 2012 — 7:40pm",
      "content": "Spambot fails at being relevant, but just by a little bit.\n\n"
    }
  ]
}
