{
  "id": "33938",
  "title": "suggestions on classic punk rock typefaces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for some help finding classic punk typefaces.  \nMaybe the kind of type you'd see on a Clash or Blondie poster.\n\nAny help would be awsome.  \ncheers Sullivan.\n\n",
  "author": "sullivan",
  "time": "21 May 2007 — 6:49am",
  "uid": "17800",
  "comments": [
    {
      "time": "21 May 2007 — 6:58am",
      "content": "[http://www.houseind.com/index.php?page=showfont&id=13](http://web.archive.org/web/20150204040558/http:/www.houseind.com/index.php?page=showfont&id=13 \"http://www.houseind.com/index.php?page=showfont&id=13\")\n\n"
    },
    {
      "time": "21 May 2007 — 7:47am",
      "content": "I was going to suggest the same collection, but also you can also achieve a punk effect by using really simple sans from that era (Futura, Franklin Gothic, etc) and black, white, red, hot pink. Stay away from any contemporary fonts and any fancy typesetting tricks. Those were the cut and paste days. DIY.\n\n"
    },
    {
      "time": "21 May 2007 — 7:56am",
      "content": "I've even set my type before in, say, Impact or something (or, as pattyfab suggests, Franklin Gothic -- very 70s), 14pt, printed it, distressed it manually, and blown it up via xerox to emphasize the divets.\n\n"
    },
    {
      "time": "21 May 2007 — 7:59am",
      "content": "It was all done cut and paste. Charlie Chan (the then equivalent of Kinko's) was a place we went a lot. I used Letraset pretty much exclusively. Or I would type something and tear it out…\n\nThat was a lot of fun and I'm really glad it's over… :)\n\npeace\n\n"
    },
    {
      "time": "21 May 2007 — 8:07am",
      "content": " ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/marx_6334.jpg)\n\n"
    },
    {
      "time": "21 May 2007 — 8:09am",
      "content": "But Paul-- you still love the xerox, don't you? (I mean, now that you don't have to feed dimes into it)\n\n"
    },
    {
      "time": "21 May 2007 — 8:28am",
      "content": "ROFL! Brilliant, Chuck. ;-)\n\n"
    },
    {
      "time": "21 May 2007 — 8:30am",
      "content": "Marxism? What's that? Does it have to do with Mickey Mouse?\n\n"
    },
    {
      "time": "21 May 2007 — 8:32am",
      "content": "And gee, isn't it supposed to be red and black? What would that make you think of?\n\n"
    },
    {
      "time": "21 May 2007 — 8:40am",
      "content": "Ladies and gents, this game is not becoming. Please stop.\n\n"
    },
    {
      "time": "21 May 2007 — 8:51am",
      "content": "Paul - it was a lot of fun. I'm not so glad it's over. I don't miss cut and paste but I miss the attitude.\n\n"
    },
    {
      "time": "21 May 2007 — 9:52am",
      "content": "I want to suggest that the only way to make a punk grap[hic ( historically speaking ) is with markers, cutting letters out of magazines as source type, and using a typewriter. That and getting an art student to make you something - whatever they want.\n\nPunk type is a byproduct of process not an end in itself.\n\n"
    },
    {
      "time": "21 May 2007 — 10:36am",
      "content": "I just thought Marxism was a good word for the counter-Thatcher/Reagan establishment.\n\nEben: _Punk type is a byproduct of process not an end in itself._  \nAbsolutely. But much of designing with type is not so much an effort to _create_ the subject at hand as it is to evoke its _spirit._\n\n"
    },
    {
      "time": "21 May 2007 — 10:41am",
      "content": "\"Punk typeface\" is an oxymoron.  \nBut then again, so is \"script font\".\n\nIMO, the \"Ransom note\" fonts (there are several available free) are most like the work Jamie Reid did for the Sex Pistols. Situationist, not Marxist, BTW :-)\n\n"
    },
    {
      "time": "21 May 2007 — 10:42am",
      "content": "anarchist more like it.\n\n"
    },
    {
      "time": "21 May 2007 — 12:37pm",
      "content": "I still cut and paste, now sometimes I use \"domain shifting\" back and forth from analog to digital - print out type on laser - wad up- rub on sidewalk - flatten - scan - rework in Photoshop - and, and, and, ..................\n\n"
    },
    {
      "time": "21 May 2007 — 2:47pm",
      "content": "You don't have any idea how many times I want to use the word 'anarchist' but I'm afraid I'll either misspell or be misunderstood...\n\nit's a weird phobia, i know.\n\n"
    },
    {
      "time": "21 May 2007 — 2:51pm",
      "content": "anarchistanarchistanarchistanarchistanarchistanarchist  \nanarchistanarchistanarchistanarchistanarchistanarchist  \nanarchistanarchistanarchistanarchistanarchistanarchist\n\n(that was really cathartic.)\n\nthanks.\n\n"
    },
    {
      "time": "21 May 2007 — 3:44pm",
      "content": "_it’s a weird phobia, i know._\n\nYou probably think that instead of typing \"anarchist\" that you're going to type \"antichrist\" -- it's a common misapprehension. ;-)\n\n"
    },
    {
      "time": "22 May 2007 — 7:08am",
      "content": "I'm with Nick. Check out situationist posters etc., I think they inspired punk graphics.\n\n"
    },
    {
      "time": "22 May 2007 — 9:34am",
      "content": "The sex pistols cover was just one approach to punk graphics and by no means the only one. Actually it was pretty diverse body of graphic work. Whatever it's roots might have been I think it evolved a recognizable feeling just because of the techniques/means employed. At least for quite a while. By 83-85 I think the urge to inject some polish back in became overwhelming.\n\nInteresting Note Nick! Are there more examples? Lorenza, - you got any?\n\nChuck ;-)\n\n"
    },
    {
      "time": "23 May 2007 — 7:13am",
      "content": "I googled it because I wanted to post an example but didn't find anything representative. I'll see if I find something with friends or books but, yeah, basically it's what has been said above, ramsone note sort of stuff etc.\n\n"
    },
    {
      "time": "23 May 2007 — 7:21am",
      "content": " ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/cover_si-times_4312.jpg)\n  \noriginal 60s\n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/poster_si2007-1_5480.jpg)\n\nthe above is recent, it's a poster for an exhibition but I think it captures the atmosphere.\n\n"
    },
    {
      "time": "23 May 2007 — 8:26am",
      "content": " ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/Sniffin_5518.jpg)\n  \n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/Erica_5461.jpg)\n  \n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/Punkture_4850.jpg)\n  \n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/Ripped_6057.jpg)\n  \n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/LiveWire_3890.jpg)\n  \n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/paragraph_3775.jpg)\n  \nFanzines from 1977  \n.  \n.  \n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/I-D2_5490.jpg)\n  \nI-D fashion magazine, 1980  \nStencil, punch tape and typewriter later appear in Just & Erik FF Dirty Fonts (?) package, 1992: grunge=punk2.  \n.  \n.  \n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/Warhol_5951.jpg)\n  \nClassic \"scrawl + typewriter\" collage \n"
    },
    {
      "time": "23 May 2007 — 2:13pm",
      "content": "Nice samples, Nick. But I have a question in regards to the Interview cover ... Is it still \"punk\" if it has become \"art\"?\n\n"
    },
    {
      "time": "23 May 2007 — 3:21pm",
      "content": "Interview preceded punk, but used the same graphic language, avoiding display typography. Founded 1969. A real magazine with ads, but high concept: interviews with celebrities.\n\n"
    },
    {
      "time": "23 May 2007 — 3:33pm",
      "content": "Hmm. Interesting. I didn't know that.\n\n"
    },
    {
      "time": "24 May 2007 — 2:22am",
      "content": "[http://www.operationphoenixrecords.com/archivespage.html](http://web.archive.org/web/20150204040558/http:/www.operationphoenixrecords.com/archivespage.html \"http://www.operationphoenixrecords.com/archivespage.html\")\n\n"
    },
    {
      "time": "24 May 2007 — 8:13am",
      "content": "More\n\n[http://www.punkrockposters.net/](http://web.archive.org/web/20150204040558/http:/www.punkrockposters.net/ \"http://www.punkrockposters.net/\")\n\n"
    },
    {
      "time": "24 May 2007 — 12:32pm",
      "content": "crass records \"and stencil\" – [http://www.southern.com/southern/label/CRC/09401.html](http://web.archive.org/web/20150204040558/http:/www.southern.com/southern/label/CRC/09401.html \"http://www.southern.com/southern/label/CRC/09401.html\")  \n [http://www.southern.com/southern/label/CRC/1978.html](http://web.archive.org/web/20150204040558/http:/www.southern.com/southern/label/CRC/1978.html \"http://www.southern.com/southern/label/CRC/1978.html\")  \n [http://www.southern.com/southern/label/CRC/07006.html](http://web.archive.org/web/20150204040558/http:/www.southern.com/southern/label/CRC/07006.html \"http://www.southern.com/southern/label/CRC/07006.html\")\n\n"
    },
    {
      "time": "24 May 2007 — 12:45pm",
      "content": "Cat woman recommends Jamie Reid  \n [http://www.jamiereid.uk.net/](http://web.archive.org/web/20150204040558/http:/www.jamiereid.uk.net/ \"http://www.jamiereid.uk.net/\")\n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/100016_3523.jpg)\n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/100081_3469.jpg)\n\n"
    },
    {
      "time": "24 May 2007 — 12:58pm",
      "content": "Great Book:  \nPhotocopied: Instant Art Of The Punk Rock Movement\n\n ![](http://web.archive.org/web/20150204040558im_/http:/typophile.com/files/FAVs_6266.jpg)\n\nFutura and Century.  \nIt’s more about how you do it than what type you use.\n\n"
    },
    {
      "time": "24 May 2007 — 3:59pm",
      "content": "\\> Paul - it was a lot of fun. I’m not so glad it’s over. I don’t miss cut and paste but I miss the attitude.\n\nWho says the attitude is over? I was talkiing about the lifestyle, which was over for a lot of people very quickly.\n\nI perceive it as a lot of outsiders (for many different reasons) that gathered together for that reason - we didn't fit in anywhere else. That lead to a lot of self-destructive behavior and a lot of dead people - at least in LA, NY, and SF - locations I am most familiar with.\n\nBeing an outsider is really hard Patty, it's a strength and a tremendous burden. You have to be a supreme egotist for it not to hurt. I'm still an outsider but have learned how to deal, unlike a lot of my friends who aren't here anymore…\n\nArtistically speaking there were 2 schools - the glam school (Bowie, The New York Dolls, Andy Warhol, Iggy, etc…) and the avant garde school (Sun Ra, Mauricio Kagel, Stockhausen (even if he was a puppet of the state like John Cage pronounced) The Art Ensemble of Chicago, Mr. Cage himself, etc…). I belonged to the latter and had stopped listening to rock and roll when Spiders From Mars came out. From there it was into jazz and avant garde classical music. There was great music that was generated from both camps and that was part of the fun. The glamsters thought we were really weird and we thought they were really lame and we were both partially right… :)\n\npeace\n\n"
    },
    {
      "time": "25 May 2007 — 1:29am",
      "content": "Paul,\n\nI recognize that much of the punk aesthetic was not sustainable, but as a friend of mine who was there for the duration (actually even further back, he was part of the factory scene) said, where's the underground today? Two republican mayoral administrations have driven it so far down you can't really find it anymore.\n\nI guess that's what I miss - and I was around for the NY part of the punk scene - the ability to experiment and live an alternative lifestyle. Very difficult in today's economy. Not to mention the collaboration, cross-pollination btw the different arts.\n\nYou really didn't include in your roundup the NY side of things, or the anarchist school. I designed a great book called The Downtown Book that has a lot of graphics from '74 to '84.\n\n"
    },
    {
      "time": "25 May 2007 — 6:59pm",
      "content": "Don't get me wrong Patty - I loved it and am very glad I was a part of it. But I also saw a bunch of folks drop and that wasn't cool. My belief in that grows stronger as time goes by…\n\nPunks were idealistic, the province of youth. It may have been idealism flipped on its head, but idealism it was.\n\nI think there are young idealists out there, but if they create something real it is co-opted so fast by the media that the life is sucked out instantly. Part of the reason punk worked is that it got to stay separate from \"reality\" for awhile - there was absolutely no chance to make it (unless you were a poseur like Patty Smith, Talking Heads, Blondie or The GoGos - probably get slaughtered for this statement).\n\nIt was crazy noise made by crazy people. Love it. But there is one thing that absolutely drives me crazy and that is reflecting on that time period like it was better than now. That's just not punk.\n\npeace\n\n"
    }
  ]
}
