{
  "id": "33936",
  "title": "Symbol for enfant terrible??",
  "forum": "Design",
  "tags": [

  ],
  "content": "I've been working on a project for a long time now trying to find an image/symbol to represent an \"enfant terrible\" and the only thing I've come up with so far is a black sheep. Very creative...And besides, is a black sheep applicable to other people when they think about an enfant terrible? My interpretation is an interesting person who might have a problem \"fitting in\", who's not afraid to be different, and someone rebellious and flamboyant and that's what I want to portray in this project.  \nIf anyone out there has a suggestion for this I would be INCREDIBLY grateful since my whole frickin project is an arrested development right now because I'm stuck trying to figure this one out. :-)\n\n",
  "author": "<a href=\"/web/20110209163948/http://typophile.com/user/17880\" title=\"View user profile.\">Charlotta</a>",
  "time": "<br>",
  "uid": "17880",
  "comments": [
    {
      "time": "",
      "content": "How about putting devil's horns or a devil's tail on your black sheep. In addition to what you described, I think of an enfant terrible as being a bit of a provocateur, a thorn in the side of respectable society. Horns might not really read properly though since some sheep do have horns.\n\nOr a baby/devil?\n\n"
    },
    {
      "time": "",
      "content": "An \"enfant terrible\" is ideal for mixing cute with hardcore...  \nTake anything cute (this can be a teddybear, a lettercube,... or something more symbolic like a heart) & set it to fire! Lock it in chains, tattoo it, pierce it! Basically, go nuts & have fun!\n\n"
    },
    {
      "time": "",
      "content": "_And besides, is a black sheep applicable to other people when they think about an enfant terrible?_\n\nHmm. Well, not to me. ;-)\n\n\"Black sheep\" do what they do because they are intelligent, confident and competent to a high degree, aware that they are different than others, and aren't ashamed of it. Oscar Wilde is a pretty good example of one.\n\nAn \"enfant terrible\" is just a whiny brat, desperate for attention, and oblivious to the world around them (and vice versa). Find your own example. ;-)\n\n"
    },
    {
      "time": "",
      "content": "Thank you for great ideas and thoughts about this! I have considered doing something with a devil - maybe an angel with horns, or is that too blasphemous? ;-)  \nThe AD I worked with earlier suggested a little girl with pig tails holding a gun, but I'm not that crazy about weapons. ;-)  \nLinda - I totally agree with you about finding my own example, or interpretation of what it means to me, but I don't agree with your explanation of an enfant terrible. They're usually known as provocateurs, for example, \"he's the enfant terrible of the art world\". But then again, maybe a provocative artist is just a whiny brat looking for attention deep inside. ;-)\n\n"
    },
    {
      "time": "",
      "content": "I think the difference is substance -- black sheep have it, and \"enfants terribles\" don't.\n\nYou can be almost as crazy as you want if you're a genius. ;-)\n\n"
    },
    {
      "time": "",
      "content": "The Wikipedia says:  \nAn enfant terrible, from the French meaning \"terrible child\", is one whose startlingly unconventional behavior, work, or thought embarrasses or disturbs others.\n\nTricky, that one.\n\n"
    },
    {
      "time": "",
      "content": "The problem with the enfant terrible is that the behavior can actually distract you from whether or not there's any substance. It can be hard to get past the antics. But life without them would be a big bore.\n\nAll artists are looking for attention.\n\nI don't agree with Linda's assessment of the black sheep either, the black sheep can just be the family f\\*\\*k-up. It's not always a choice and they're not always looking for attention.\n\nFrom wikipedia (just so we're comparing apples to apples - and not to pc's)  \nBlack sheep is a derogatory colloquialism in the English language meaning an outsider or one who is different in a way which others disapprove of or find odd. This can be someone who has been shunned by others, or one who has chosen to be an outsider, due to actions and aims that separate them from the rest of the people or \"flock\". A typical example might be a family member who has chosen to follow a religion other than that of the rest of his family.\n\nSo as I see it, the black sheep symbol doesn't really apply.\n\nMaybe a sassy baby sticking it's tongue out?\n\n"
    },
    {
      "time": "",
      "content": "I come from a family full of black sheep and we resent that remark. ;-)\n\n"
    },
    {
      "time": "",
      "content": "I am influenced by the Jean Cocteau Novel of the same name\n\nCocteau, Jean, The Holy Terrors (Les enfants terribles)\n\nSo my idea about the phrase is that the 'enfants terribles' is presnet to some degree in all children. To me that's the more interesting idea. It isn't a suggestion I know but perhaps a different spin will help. Also, the book is short & quite good I think.\n\nWhat's the context for your project anyway? Why 'enfants terribles'?\n\n"
    },
    {
      "time": "",
      "content": "immediately thought of him:\n\n ![](http://web.archive.org/web/20110209163948im_/http:/typophile.com/files/3_Struwwelpeter_6371.jpg)\n\n[http://en.wikipedia.org/wiki/Struwwelpeter](http://web.archive.org/web/20110209163948/http:/en.wikipedia.org/wiki/Struwwelpeter \"http://en.wikipedia.org/wiki/Struwwelpeter\")\n\nEven Mark Twain had a go at translating this, included in his rather wonderful book \"The Awful German Language\".\n\n"
    },
    {
      "time": "",
      "content": "[http://www.shockheadedpeter.com/](http://web.archive.org/web/20110209163948/http:/www.shockheadedpeter.com/ \"http://www.shockheadedpeter.com/\")\n\nThe Tiger Lillies are amazing.\n\n"
    },
    {
      "time": "",
      "content": "Interesting project.\n\nI think a key element would be a tongue sticking out.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "This is very interesting and certainly thought provoking. I have always felt (and called myself) the black sheep in my family, in spite of being deeply loved by my parents. I wasn't acting out and being a difficult teenager but I was the sensitive and creative one,  \nnothing like my pragmatic, down-to-earth, older sister. And then growing up I never knew what to do with my life - there never was a \"straight path to follow\" career-wise. I was always the bohemian, the creative, the impulsive, the one always sticking out and never feeling I belonged. I think this often applies to children who are more creatively talented. For me it was music at first, then design. My sister followed my mother's path and became a nurse. Life was always so much easier for her.  \nWhen I came across the words \"enfant terrible\" the first time I immediately could relate but now I don't know. I might be provocative,  \nflamboyant and go my own way, but never because I desperately need to assert myself or crave attention.\n\nThe project is jewelry (my own). One collection is called \"Social Butterfly\" the other \"Enfant Terrible\". The first is more subtle, pretty, feminine, classic with understated colors, and the \"Enfant Terrible\" is bold, flamboyant, edgy, and colorful - for people who like to stand out and wanting to be noticed. I chose these two \"epithets\" because they're so far apart and beause I can identify with both. I am so grateful for all your comments but it bothers me a bit that most of you have negative feelings about an enfant terrible.  \nThat's not good consider I'm launching a collection. ;-) Maybe I should just go with Black sheep instead? ;-)\n\n"
    },
    {
      "time": "",
      "content": ":-) There's a nice contrast there too, though -- a mammal/vertebrate with four feet on the ground vs. insect/invertebrate that flies.\n\nI agree with you that there are a lot of negatives associated with \"enfant terrible\": must be that \"more prone to toss a tantrum\" aspect. :-(\n\n"
    },
    {
      "time": "",
      "content": "But of course a true enfant terrible relishes those negative associations!\n\nCharlotta, those are two great names for your jewelry lines.  \nOnce in a while, I wish I were a woman. For a second.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Actually, I think \"black sheep\" has a more negative ring to it than \"enfant terrible\" although in a different, kind of depressing way. Even though Wikipedia clearly states it can come from a personal choice, I associate black sheep with empathy for a stranger, the quiet, shy kid in the back of the class that no one speaks to whereas I associate \"enfant terrible\" with the rebel (in which I can see the flamboyant colours working). To me an \"enfant terrible\" is a bit like a joker, provocative in a playfull manner much like the joker Jack Nicholson portrayed in Batman.\n\n"
    },
    {
      "time": "",
      "content": "Don't drop the name. It has much more swagger than \\*black sheep\\*. How much mileage has Blue Q gotten out of negative connotations? Enfant seems tame compared to their tongue in cheek bad girl/rodeo/sacrilege theme.\n\nThanks for sharing about both lines. The contrasting labels seems like they give you more leeway with the design. I think you can play more loosely with Enfant Terrible, because the key is the contrast.\n\nSpiders (brown recluse vs social butterfly), bettles, or bats might contrast well too. I liked pattyfab's suggestion of the sheep with devil tail. Got me thinking about mythological beasts and somehow Enfant Terrible says Dragon in Diapers to me.\n\n"
    },
    {
      "time": "",
      "content": "Linda - I agree. There is definitely a contrast but at the same time something links them together - both being animals which kind of binds them nicely together.\n\nhrant - I agree with you too! :-) Obviously I want a reaction to draw attention to my jewelry. And thank you for saying that you like the names, that made me really happy! :-) Do you wish you were a woman so you could make jewelry or wear them? ;-)\n\nill sans - I do think a black sheep has a slightly sad feeling about it whereas an enfant terrible is someone you at least don't feel sorry for. But at the end of the day I do think these two epithets belong together. Thinking of the context of jewelry, however, a black sheep might not be associated with color and edgy, bold pieces. This is really hard - I've been working on it for weeks and I can't come to a solution I'm happy with. Having said that, all of your intelligent and creative opinions and ideas really help. :-)\n\n"
    },
    {
      "time": "",
      "content": "Wear. You don't have to be a woman to <cite>make</cite> jewelry.  \nWell, I guess you don't really <cite>have</cite> to be a woman to wear  \njewelry either, but... it's different. And I like differences.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I believe François Truffaut had a movie by that name. - Les Enfant Terrible.  \nMy favorite scene - a baby tumbling several feet down to the ground, from a 3rd or 4th floor window - and when he landed on his bottom (sitting upright) laughing, he said, \"Je fai BOOM.\" It was out about 1973-74.\n\nThat was a enfant terrible image I have kept in my head -- forever.\n\n"
    },
    {
      "time": "",
      "content": "I like this description from Merriam-Webster: \"2. a usually young and successful person who is strikingly unorthodox, innovative, or avant-garde.\"\n\nAnd here's something else I found from a swedish site. Love the picture - I think it's an album cover.\n\n ![](http://web.archive.org/web/20110209163948im_/http:/typophile.com/files/musik_3937.jpg)\n  \n\"When is someone considered to be an \"enfant terrible\"? Or a \"bad boy\"? What characterizes an \"enfant terrible\", what distinguishes a \"bad boy\" from others, from normal ones (?!)? Are they within music composers/musicians who go their own way unwaveringly, who support their ideas, regardless if others think it amateurish, simplistic, bad, eccentric or whatever?\" Steffen Schleiermacher\n\nApparently this topic brings up a lot of opinions/feelings.\n\n"
    },
    {
      "time": "",
      "content": "How about a baby's dummy or rattle with horns or punk studs/spikes? It could make a nice design for a piece of jewellery too.\n\n{Edit: FreakBabies03Temp600px.jpg removed}\n\n"
    },
    {
      "time": "",
      "content": "I don't think of sheep as particularly sexy (unless you're a lonely shepherd I guess) whereas enfant terrible sounds more enticing - to me. I do NOT have negative connotations with enfants terribles - as I said earlier, they make life interesting. I guess I don't focus on the hissy fits as much as them thumbing their nose at convention.\n\nSo I'd stick with your first instinct, I like it.\n\nAnd I'd love to see the jewelry.\n\nJon - I read that as \"Steak Babies\" and got confused!\n\n"
    },
    {
      "time": "",
      "content": "Randy - Another insect is a great idea but I absolutely loathe spiders. But finding an insect that is the opposite of the stunningly beautiful and innocent butterfly is an interesting idea.\n\nhrant - It goes without saying that you can make jewelry even if you're a man, but you could've meant that it's easier to make it if you're a woman - or a woman's jewelry would be more beautiful, creative, sensual, delicate, alluring. That is a way to interpret what you said.\n\n"
    },
    {
      "time": "",
      "content": "An important aspect of enfants terribles is  \nthat they piss people off for the hell of it.\n\n\\> a woman’s jewelry would be more beautiful,  \n\\> creative, sensual, delicate, alluring.\n\nI might like to mean that too.\n\nBTW, I find spiders much more beautiful than butterflies.  \nWhich is why I'm a text font guy, not a display font guy.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Patty - Enfant terribles do make life more interesting. I just read that they called Katherine Hepburn an enfant terrible. Who could be more representative? I have always stood my ground and I have never asked anyone about what to wear or what I should buy - I've always trusted my own taste and what I like. But now I apparently, at least according to all these marketing people and AD:s that I have worked with since I started my business, have to start to think about how other people perceive things and what kind of message I want to send out and how people want to FEEL when they buy something. I think it's so fake at times but I guess I have to play along. So, this is why I began to waver when I got all these opinions about how people perceive an enfant terrible. But maybe I have to take that into consideration?\n\n"
    },
    {
      "time": "",
      "content": "An enfant terrible is not introverted at all.  \nShe tends to care a lot about what people think.  \nHow else could she intentionally piss them off?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_I just read that they called Katherine Hepburn an enfant terrible._\n\nShe was certainly acknowledged (both by her and her family) as being a black sheep. ;-)\n\n_But now I apparently, at least according to all these marketing people and AD:s that I have worked with since I started my business, have to start to think about how other people perceive things and what kind of message I want to send out and how people want to FEEL when they buy something. I think it’s so fake at times but I guess I have to play along. So, this is why I began to waver when I got all these opinions about how people perceive an enfant terrible._\n\nTotally understandable in wanting to \"do your own thing\" but good marketing means taking into account what will result in the most sales.\n\nWho can forget when Chevrolet wanted to market one of their cars in Mexico but never considered that just because English-speaking clients would buy a Nova that in Spanish-speaking countries, \"no va\" means \"it doesn't go\"?\n\nBig oops there.... ;-)\n\n"
    },
    {
      "time": "",
      "content": "Phillipe Starck has been called the \"enfant terrible\" of the interiors/furniture world. I think it has wicked and fun connotations. I like it more than black sheep. Although I have a t-shirt that says, \"pink sheep of the family\" on it.\n\n"
    },
    {
      "time": "",
      "content": "If you're gonna go with a spider it has to be a black widow.\n\nIt seems tho that Linda is the only one voicing negative connotations with enfant terrible. Seems like it appeals to most everyone else who's responded.\n\n"
    },
    {
      "time": "",
      "content": "Linda - I hear you... :-) It's just that the whole marketing thing is totally new to me. I just want to be creative - the thought of being pushy and \"selling\" myself and my jewelry freaks me out! :-)  \nAnd I am too honest, apparently. I wrote an \"About\" text for my website and mentioned living in NYC and not being able to work beause I didn't have a working permit, (which actually made me begin with the jewelry business in the first place so it was very relevant), but I had to take that out because it gave the wrong impression and was too negative. I really have to question if people are that gullable? I have also been told that my jewelry can't be priced too low?! It's apparently all about the \"feeling\" an expensive item gives a person. :-)\n\n"
    },
    {
      "time": "",
      "content": "_It seems tho that Linda is the only one voicing negative connotations with enfant terrible. Seems like it appeals to most everyone else who’s responded._\n\nIt's the editor in me, and I doubt that the audience reading this thread are representative of the sort of clients Charlotta is hoping to attract . :-) That I'm also working to market more of my art, and thus it's a topic I have more than a passing interest in, also figures into the mix.\n\n"
    },
    {
      "time": "",
      "content": "Yes, maybe there is a difference between my potential customers and the people in this forum. I have sometimes thought that \"enfant terrible\" might be too pretentious for \"the average customer\".\n\n"
    },
    {
      "time": "",
      "content": "Depends on the sort of client mix you want to appeal to, I guess. Pretentious people pay more, even though there's fewer of them (well, not here....hahaha). ;-)\n\n"
    },
    {
      "time": "",
      "content": "That's so true...probably me included. ;-)  \nI actually do think pretentious (perhaps a tad noveau riche) people pay more because they want to - and then go and flaunt it.\n\nJust have to say that I looked at your profile and that I am deeply envious of you for having attended Parson's. I was going to study interior design there years ago but something got in the way (read boy trouble). Ironically enough, I ended up moving to NYC and lived on Fifth ave. at 14th street so I pretty much walked by the school on a daily basis. Boo-hoo. ;-) But good for you!\n\n"
    },
    {
      "time": "",
      "content": "If you remove the wings from most butterflies, you're left with a rather disturbing looking bug.\n\nOf course I wouldn't recommend doing that.\n\n"
    },
    {
      "time": "",
      "content": "Setting aside the whole enfant terrible thing for a min, I want to bring up chocolate. Actually, in response to:  \n\\>\\> Who can forget when Chevrolet wanted to market one of their cars in Mexico...\n\nI wanted to point out that that is a long-perpetuated myth. [http://www.snopes.com/business/misxlate/nova.asp](http://web.archive.org/web/20110209163948/http:/www.snopes.com/business/misxlate/nova.asp \"http://www.snopes.com/business/misxlate/nova.asp\")\n\nWhen it comes to Enfant Terrible, I guess I see it as a bit of an antiquated term, and this image comes to mind:  \n [http://www.library.pitt.edu/libraries/is/enroom/juvenile/enfant1.jpg](http://web.archive.org/web/20110209163948/http:/www.library.pitt.edu/libraries/is/enroom/juvenile/enfant1.jpg \"http://www.library.pitt.edu/libraries/is/enroom/juvenile/enfant1.jpg\")  \nIf you are thinking insects still, perhaps the scarab is a good one to juxtapose against the butterfly, it's somewhat recognizable, and it's pretty much the opposite of the flighty butterfly.\n\n"
    },
    {
      "time": "",
      "content": "{Edit: BabyDummy01a2Temp600px\\_6486.jpg removed}\n\n"
    },
    {
      "time": "",
      "content": "Show off.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20110209163948im_/http:/typophile.com/files/EnfantTerrible1_6218.jpg)\n\n ![](http://web.archive.org/web/20110209163948im_/http:/typophile.com/files/EnfantTerrible2_5236.jpg)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "",
      "content": "Terrifying children  \n [http://www.raycaesar.com/friendlyFire/galleriaFF.html](http://web.archive.org/web/20110209163948/http:/www.raycaesar.com/friendlyFire/galleriaFF.html \"http://www.raycaesar.com/friendlyFire/galleriaFF.html\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Lherrou - I like the idea of the scarab, I've always liked the look of them. I even made a pendant of a carved scarab once, but will it make sense? Can one find a correlation between an enfant terrible and a scarab?\n\nWormwood - That is just brilliant! Maybe there's a future for you  \nas a jewelry designer? :-) A bit too hard core punk/goth for me but put it on a long, thick silver chain and I'm sure someone who's into that style would love to wear that around the neck. Very wicked. :-)\n\n"
    },
    {
      "time": "",
      "content": "Tim - Very scary images but yet stunningly beautiful. I especially liked the one of the two children wearing those little \"hats\" with  \nhorns. It makes me believe that they're not evil children, only dressed up for a masquerade.\n\nHiro - That's an hilarious picture, but again, it seems most people associate this epithet with something that's mostly negative - being loud, obnoxious, bratty and provocative in a way that isn't necessarily positive.\n\n"
    },
    {
      "time": "",
      "content": "Tim's link reminded me of the work of Mark Ryden, some creepy stuff on his site too... [http://www.markryden.com/](http://web.archive.org/web/20110209163948/http:/www.markryden.com/ \"http://www.markryden.com/\")  \nDon't know if it's on his site, but he made a painting of a little boy on a tricycle in a pink Nazi-uniform. Now thàt's a horrible child!\n\n"
    },
    {
      "time": "",
      "content": "Der Struwwelpeter is one of my favourite (and a great source of my childhood's anxieties...)  \n\"Oh, che schifo quel bambino!  \nÈ Pierino il Porcospino.  \nEgli ha l'unghie smisurate  \nChe non furon mai tagliate;  \nI capelli sulla testa  \nGli han formata una foresta  \nDensa, sporca, puzzolente.  \nDice a lui tutta la gente:  \nOh, che schifo quel bambino!  \nÈ Pierino il Porcospino.\"\n\netc. etc. thanks, Franz!\n\nWhat about Calvin (from Calvin & Hobbes)? Maybe you can try to find one of his great faces and reduce it to its essence. You have to be careful that it doesn't actually remind Calvin toooo much.\n\n ![](http://web.archive.org/web/20110209163948im_/http:/typophile.com/files/hungrycalvin_3560.gif)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20110209163948im_/http:/typophile.com/files/evilCalvinHobbes_4821.gif)\n\n"
    },
    {
      "time": "",
      "content": "Lore - I need the symbol for my jewelry collection so I don't think that Calvin will work. Thanks for the suggestion though. :-)  \nI looked at your work and was very impressed - so beautiful and moving. I especially liked \"Tree\".\n\n"
    },
    {
      "time": "",
      "content": "How about something similar to the rolling stones logo?\n\n"
    },
    {
      "time": "",
      "content": "Yeah, pity about Calvin, I understand, it should be something more poetic.  \nEnfant terrible could be associated with \"wild\" I guess, so personally I'm not sure about the sheep thing. Even if it's a black one ; )\n\nMaybe more like a crazy horse or any other animal that could have these wild/not tame connotations...or what about a whip? Sorry I'm not being very selective today!\n\nAnd wow, thanks for your comments on my stuff, it means a lot to me. : )\n\n"
    },
    {
      "time": "",
      "content": "\\>only dressed up for a masquerade  \nOh, they probably have tentacles hidden somewhere, but evil-lovely, lovely-evil images.\n\nEnfant Terrible is a term that has been thrown about so much that it has lost much of its meaning so all the above could be correct, almost defying definition, so here is mine – a student/follower who turns on the precepts of his/her mentor, but the title is ephemeral and can only be held until the student has students/followers of their own, after which it becomes insulting (Damien Hirst, David Carson).  \nSymbol –&nbsp;a pram with a tentacle coming out? Ronald Searle’s drawings come to mind  \n [http://lambiek.net/artists/s/searle\\_ronald.htm](http://web.archive.org/web/20110209163948/http:/lambiek.net/artists/s/searle_ronald.htm \"http://lambiek.net/artists/s/searle\\_ronald.htm\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Lore - Yes, to me an enfant terrible is partly wild. There have been so many different interpretations on it which have been really stimulating and interesting but I guess I have to stick to my own feeling about what it is.  \nYour work is amazing so, you're welcome! :-) If I had decided to ask an artist to do my logotype - to draw something - I would've wanted something like \"tree\". Not too dark and sad, but with the similar poetic feel to it.\n\n"
    },
    {
      "time": "",
      "content": "The obvious thing here for Jewelry would be a cartoon of a girl who is defiant, sexually provocative, and laughing at the world--with jewelry. It could work with her having horns and a tail, but if the drawing were good enough, it could be best without. If you want it to be more chaste, it could be in a frame with just the head, neck and hands in the frame...\n\nThe ideal I think you want to project is a girl who is not obnoxious, but who is defiantly independent, and having great fun being so. That's the 'good' enfant terrible.\n\nHere's an example, from Leslie Cabarga's book, 'Logo, Font and Lettering Bible'. He was illustrating good drawing. The drawing is by [Shane Glines](http://web.archive.org/web/20110209163948/http:/www.shaneglines.net/contact/contact.html). Cabarga says \"You can't be stupid and be able to draw this well.\"\n\n ![](http://web.archive.org/web/20110209163948im_/http:/typophile.com/files/Shane-Glines-bad-girl_4232.gif)\n\n"
    },
    {
      "time": "",
      "content": "<cite>Enfant Terrible is a term that has been thrown about so much that it has lost much of its meaning</cite>  \n...a bit like avant-garde\n\n<cite> a pram with a tentacle coming out </cite>  \nsimply brilliant.\n\n"
    },
    {
      "time": "",
      "content": "oops. getting used to this place...\n\nI just glanced over 'The Three Incestuous Sisters', I guess the 'enfant terrible' would have an aspect of self loathing, an introverted hatrid that fuels the desire to malign, shock and disturb. I agree that the icon needs an aspect of beauty and grace, and I also like the 'insect' idea. A moth however is too ephemeral, the terrible child is far more robust and glistens in its own torrid glory. The beauty has to be ambiguous. I prefer a scorpion to a spider, and a whole octopus to a tentacle...\n\nAn octopus pulling the strings of a child puppet?\n\nAn octopus with malevolent rattles in each tentacle?\n\nThen again, I prefer a squid to an octopus...\n\n"
    },
    {
      "time": "",
      "content": "Searle's stuff is absolutely amazing -- Ralph Steadman is also similarly warped. ;-)\n\n(edit: And Terry Gilliam....)\n\n"
    },
    {
      "time": "",
      "content": "Tim - So one can't be an enfant terrible as a mentor/leader? If you are defiant and rebel against your mentor, couldn't you then continue to be an enfant terrible although you had followers? But now against someone or something else, society, for example? Or am I reading you completely wrong? I can see why it might be ephemeral since it's often an epithet applied to younger people and it feels a little sad and pathetic to be an old enfant terrible, but why not? (I know that's not what you meant with it being ephemeral). A pram with tentacles? That's certainly interesting.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Charlotta. I'm glad you liked my 'pacifier terrible'. It might be less hardcore if it were made as small earings. I would like to have a go at jewellery design someday.\n\nSorry to be negative but to me 'enfant terrible' is a rather tired phrase that I associate with the media hype that surrounded conceptual art in the 1990's. The phrase seemed to lose some of it's original meaning and power after that. I quite like what it means but just not very keen on the actual words.\n\nAlso, like any phrase borrowed from the French, it can sound pretentious, especially when attempting to say it with a French accent or otherwise it can just sound clumsy in your own accent.\n\nMaybe something like 'Voodoo Child' would be more timeless and cool?\n\nHmmm. 'Baby Chrome' just popped in to my mind. Strange :)\n\n"
    },
    {
      "time": "",
      "content": "Yes, I've thought about the risk of it sounding too pretentious. But then again, pretentious can be provocative and isn't that what I want? At least I want the attention. \"Voodoo Child\"? \"Baby Chrome\"?  \nI definitely think there's a future for you as a punk/goth jewelry designer! :-) But my collection isn't supposed to be scary. Colorful, flamboyant, edgy, bold, but not gothic and dark. ;-)\n\nI just realised - speaking about languages and the phrases and words we borrow from each other - the English language has no noun for gloating. We have it in Swedish, and in German it's \"schadenfreude\" and in French it's \"joie méchant\". But why not in English? (But that's a whole different discussion...)\n\n"
    },
    {
      "time": "",
      "content": "_But my collection isn’t supposed to be scary. Colorful, flamboyant, edgy, bold, but not gothic and dark._\n\nI thought 'Voodoo Child' was quite mainstream in a rock n roll way. Everybody loves Hendrix.\n\n"
    },
    {
      "time": "",
      "content": "A true enfant terrible cannot lead, because she cannot be followed.\n\nJon, <cite>jewelry</cite> is pretentious.\n\nJust had an idea leading off from the S&M pacifier:  \nWhat about a pacifier with a forked sucking part?  \nAnd I would get Underware to draw it.  \n [http://www.underware.nl/site2/index.php3?id1=sauna&id2=detailsdingbats&i...](http://web.archive.org/web/20110209163948/http:/www.underware.nl/site2/index.php3?id1=sauna&id2=detailsdingbats&idbp2=ding-solo.gif#bp2 \"http://www.underware.nl/site2/index.php3?id1=sauna&id2=detailsdingbats&idbp2=ding-solo.gif#bp2\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "William - I like your interpretation. It's very similar to my personal feeling about what an enfant terrible is. \"...defiant, sexually provocative, laughing at the world — someone who is defiantly independent, and having great fun being so. That’s the ‘good’ enfant terrible\". And also according to Merriam Webster's explanation - \"...a successful person who is strikingly unorthodox, innovative, or avant-garde.\" But to find a figure/symbol/image of this to represent a jewelry collection is very, very difficult.  \nWhat about a crooked halo? Is that too meek and cliché? I just don't want the figure to look too dark or evil.\n\nWormwood - I think that \"rock n roll\" isn't mainstream in the context of my jewelry collection. (Which is obviously hard for you to figure out since you haven't seen it). If the style of my jewelry was more \"rock chick meets punk\" it would be an absolutely brilliant idea. But my jewelry are not that \"out there\". This collection is for women who aren't afraid to \"stand out\" and be a bit colorful, but it's not like I'm using thick chains and leather. The pacifier earrings would be the perfect piece for a collection named \"Baby Chrome\" or \"Voodoo Child\".\n\n"
    },
    {
      "time": "",
      "content": "Jewelry is pretentious? Elaborate, please. :-)\n\n"
    },
    {
      "time": "",
      "content": "Noooo, I love enfant terrible. Just because it's French it doesn't mean it sounds pretentious to the rest of the world. Maybe this is an American point of view and I'm not sure Charlotta wants to conquer the average American. I find that using an English word could have a similar effect for some non-English speakers. And I don't think jewels are pretentious either. Not sure where this idea comes from. Anyway...I'm very opinionated today ; )\n\nCrooked halo? Sounds intriguing, any sketches? I'm kind of in love with the pram thing. And the whip, except that the whip might be too erotic but it goes well with the wild/rebellious concept.\n\nI don't think we have an Italian translation for gloating either, we borrow shadenfreude. I guess in Europe it's no big deal to use a word in French or German every now and then, it doesn't make anyone sound pretentious, just educated. I think.\n\n"
    },
    {
      "time": "",
      "content": "_I guess in Europe it’s no big deal to use a word in French or German every now and then, it doesn’t make anyone sound pretentious, just educated. I think._\n\nI'm english, live south of the London metropolis and reasonably well educated, but I couldn't say it and keep straight face. Or risk getting beaten up for being 'gay'.\n\n"
    },
    {
      "time": "",
      "content": "In English we also use 'schadenfreude', though in some contexts it would be pretentious.\n\nTo me the tentacle thing sounds like a terrible idea--what girl wants to look like an octopus?\n\nThe crooked halo could also work. I think the challenge is to hit the right note of being fun and cute--without being too cute or childish. A good illustrator hopefully could pull it off.\n\nThe basic concepts of 'social butterfly' and 'enfant terrible' line of jewelery is just fabulous. You'd better register the trademark get your jewelery out there before a big company steals the ideas.\n\n"
    },
    {
      "time": "",
      "content": "cuttlefish mentioned earlier the idea of taking the wings off the butterly. I wonder if something along those lines would be a good solution to your problem of not wanting to get too dark with the bolder line of jewelry.\n\nPerhaps alter your buttlerfly to the point that it is clearly a little \"terrible\"? Horns, bold colors, edgy angles on the wings? Then you'd get some consistency with your lines, but also say \"this line is different. It's enfant terrible.\"\n\n"
    },
    {
      "time": "",
      "content": "To develop Lindsay's idea a bit, what about a moth?\n\n"
    },
    {
      "time": "",
      "content": "I once drew a heart with horns and a wavy tail,  \na dingbat for my Domination Available font:  \n [http://www.themicrofoundry.com/f\\_dominava.html](http://web.archive.org/web/20110209163948/http:/www.themicrofoundry.com/f_dominava.html \"http://www.themicrofoundry.com/f\\_dominava.html\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Rolling Stone is the status quo ...\n\n"
    },
    {
      "time": "",
      "content": "Take a look at the BSD devil:\n\n[http://www.freebsd.org/](http://web.archive.org/web/20110209163948/http:/www.freebsd.org/ \"http://www.freebsd.org/\")\n\nThat would be something I consider to fit the term :-)\n\n"
    },
    {
      "time": "",
      "content": "Sorry Charlotta, i wasn't trying to push you in an unsuitable direction.\n\nI just tried to swap the words enfant and terrible with ones that I thought had a similar vibe but were less spoilt brat and were more bold and edgy. Yeah, Voodoo Child maybe too much. What about 'Wild Child'?\n\nBad pun warning: Misschievous?\n\nAny logo could possibly limit the appeal of your brand so maybe consider just using a (custom?) type design and let the jewellery do the talking.\n\nI'm sure we would all like to see some of your jewellery collections. Could you post some designs here?\n\nBTW thanks for the inspiration. I may try designing some more 'Baby Chrome'. Fancy doing a collaborative collection sometime?\n\n"
    },
    {
      "time": "",
      "content": "Well, as long as we're still open to other suggestions...  \nHow about birds? A swan is the perfect symbol for feminniity (or is it maybe too Swarovski-like? in that case I suggest a flamingo as an alternative) & a parrot has that flamboyant (maybe even misschievous, the pirate link) thing to it. Just a thought...\n\n"
    },
    {
      "time": "",
      "content": "It's interesting to see that most suggestions have something to do with the devil or being evil and bad. Tails, horns, tentacles, spiders, bats, and that might scare people off. I have to be - although I don't like this - a bit commercial. :-)\n\nI just read in a magazine someone who said \"Can't a bad girl be a good person?\" and I like that. I have been \"bad\" - wild, flirty, partying like crazy, unfaithful, a bit promiscuous, always craving freedom to the point of insanity, but I have always been a good person. Not as good as I am today - older and wiser - but this is the  \ndichotomy I am looking for. Maybe an Eve luring you with an apple?  \nBTW - I am European too and I don't get away with using French phrases either. ;-)\n\n"
    },
    {
      "time": "",
      "content": "<cite>what girl wnats to look like an octopus?</cite>\n\n ![](http://web.archive.org/web/20110209163948im_/http:/typophile.com/files/cthulhu_4311.png)\n\n"
    },
    {
      "time": "",
      "content": "No need to apologise! I just tried to explain. I feel a bit fastidious and hard to please with all these brilliant ideas coming in and nothing \"suits\" me. That's all.\n\nI think a collection between us would be very successful! :-) If I need to think about designing jewelry in that style, I immediately begin to think about several models/designs. It's what I did when I was an interior decorator, just get the feel of the clients style and decorate accordingly. :-) I'll see if I can find some good enough pictures of a couple of jewelry pieces to post.\n\n"
    },
    {
      "time": "",
      "content": "Nice one, Cuttlefish!\n\n"
    },
    {
      "time": "",
      "content": "\\> that might scare people off.\n\nOnly somebody who's not an enfant terrible.  \nOr really, somebody who doesn't want to <cite>pretend</cite> she's an enfant terrible.  \nBecause that's what this is all about anyway.\n\nBTW, Charlotta, please don't feel too bad reading this, but I think you have to stop believing you're an enfant terrible yourself. That might actually been good news, in terms of seeing your ET line more objectively.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite>In English we also use ‘schadenfreude’, though in some contexts it would be pretentious.</cite>\n\nand then we have to explain what it means. I always use Martha Stewart as an example.\n\nCharlotta - in terms of edgy vs goth, enfant terrible vs bad girl, maybe it would help if you could point to a celebrity or public figure who you could envision wearing your jewelry, or being its spokesperson. While I hate to bow to celeb culture, that might put us all on the same page. Are you talking Lindsay Lohan or Courtney Love? Edie Sedgwick or Paris Hilton? Blondie? Samantha from Sex & the City? Or none of the above, not even close?\n\n"
    },
    {
      "time": "",
      "content": "Madonna's life's work.\n\nBtw, in my annual report from Aber Diamond Corp came images from this guy...\n\n ![](http://web.archive.org/web/20110209163948im_/http:/typophile.com/files/HarryWinston_6626.jpg)\n  \n...that crow is marvelous.\n\nThink about showing your work on different hand gestures which are eithered coloured bold and dynamic or left monotone and the background of the hand gestures has those 'stepping out' qualities. My middle finger graphic could do as a ring finger and cuff links. A peace sgin to show off bracelets or watches, etc., etc.\n\nI think you're after a rock n' roll attitude.\n\n\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "",
      "content": "Well the debate is going on strategies of your brand and thorough its conception in a multiuser base. :-) Good luck on your designs Charlotte!\n\nYour \"Black Sheep\" reminded me of something: black jeans campaign - an iconic piece of BBH's for Levi's with the \"when the world zigs zag\" strapline...\n\n[http://www.bbh.co.uk/clientAd.aspx?adId=242](http://web.archive.org/web/20110209163948/http:/www.bbh.co.uk/clientAd.aspx?adId=242 \"http://www.bbh.co.uk/clientAd.aspx?adId=242\")\n\nA.\n\n"
    },
    {
      "time": "",
      "content": ".\n\n"
    },
    {
      "time": "",
      "content": "Hiro - Those pictures are stunning! It makes one feel incredibly small looking at jewelry from Harry Winston... :-)\n\nI like the butterfly the best. It's funny because we initially had a picture of a piece and then the AD took an image of exactly that kind of butterfly and cut it in half, putting it along one side of the picture. That was really beautiful. Maybe I should do that again...\n\n"
    },
    {
      "time": "",
      "content": "Well, I'm French and \"Enfant Terrible\" is, even in its language of origin, (over)used in the hype musical press to classify edgy artist. I LOVE the pretention/punkness of this word, I like \"mouton noir\" too... After all my name is \"Dr. Duckling\" after the \"Ugly Duckling\"...\n\n"
    },
    {
      "time": "",
      "content": "So how would someone speaking the language describe an enfant terrible? There have mostly been kind of \"dark\" interpretations and suggestions about horns, tails, tentacles and sort of \"devilish\" traits to that image. What do you think?\n\n"
    },
    {
      "time": "",
      "content": "Patty - I would be happy if anyone would buy and wear my jewelry! :-) But if I have to pick celebrities I like (their style, I mean), I would say Jennifer Aniston, Halle Berry, Katie Holmes, Michelle Williams, Naomi Watts, Amanda Peet. My collections are not outrageous. I picked the names for the collections first because I couldn't decide on one style and they were very different. I liked the names of the collections. It wasn't like a made such wild, crazy, over the top jewelry that I decided to call it Enfant Terrible.\n\n"
    },
    {
      "time": "",
      "content": "\\>“dark” interpretations\n\nMy suggestion of tentacles coming from a pram was based on a literal terrible child, because the multiple understandings of the meaning don’t allow for one based on **one** meaning of the term.\n\nbtw your interpretation of my definition was correct, my feeling is that once an enfant has created an approach/form of working which breaks from the established norm, they then have to create a body of work to be _promoted_ to the level of a mentor\\*, in effect one becomes a member of the establishment to a degree.\n\n\\*(since we already have some french terms I’ll add another) alternatively one could become an éminence grise if one still worked out of the mainstream and influenced students/disciples. I don’t get beaten up for using french and german terms, but then my appearance discourages that.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "ok, then. You win. But I don't think that simply translating enfant terrible to English would be a good solution but there you go. Hey, nice pieces Charlotta.\n\n"
    },
    {
      "time": "",
      "content": "There’s no competition, my opinion is as invalid as anyone else’s.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Tim - Does that mean that your appearance is as dark (and threatening?) as your thoughts? ;-)\n\nI most frequently use the French expression/phrase \"fait accomplit\" because that's not pretentious and it's a good solid phrase and most people understand it. Maybe at times \"joie de vivre\", which actually seems to be pretty intergrated in the English language. At least when I lived in the US.\n\n"
    },
    {
      "time": "",
      "content": "Put it like that: It's ok to use French words (<cite>merde</cite> for example) if you say \"excuse my French\" afterwards.\n\n"
    }
  ]
}
