{
  "id": "33957",
  "title": "Jekyll and Hyde",
  "forum": "Design",
  "tags": [

  ],
  "content": "A recent brief of mine asks for me to present the entire text from the book ’Dr. Jekyll and Mr. Hyde’, all 25,000 words of it. Of course, to present this in the context of a book would be a process of tedium and torment. we are encouraged to break the boundries of ’the form of a book’, so setting and binding a book is out of the question.\n\nI decided to display the book through a selection of decorative picture frames that I have either built, salvaged or bought from various charity shops. I need to consider size and printing costs.\n\nI intended on using Caslon for the entire body text. I realise that the content and era of the book are intrinsic to the piece. The book was released in 1886 in Victorian London, obviusly the type needs some kind of horror vibe. I realise caslon was created over 100 years previous to this date, but I understand it was widely used throughout the victorian era. I wanted to ask the following questions:\n\nI have both adobe caslon and caslon Old face, for the body text, which would be most appropriate?\n\nCould you reccomend any ornaments/fleurons that would work well with the body text\n\nWhat would work well with Caslon as a headline text? Here is the crux of the problem. I need two fonts, both of them complimenting the body text, one for the respectable ’Dr. Jekyll’ and another for the tyrannical ’Mr. Hyde’. The fonts will need to be displayed together as the main headline, but would also be used for chapter headings. The faces really need to opitimise the eponymous character(s) in the book.\n\nAny feedback will be greatly appreciated.\n\nThankyou\n\n [‹ Using em dash to mark interview dialogues](http://web.archive.org/web/20080422033343/http:/www.typophile.com/node/33787 \"Go to previous forum topic\") [handwriting ›](http://web.archive.org/web/20080422033343/http:/www.typophile.com/node/33289 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080422033343/http://www.typophile.com/user/18732\" title=\"View user profile.\">TomShep</a>",
  "time": "<br>",
  "uid": "18732",
  "comments": [
    {
      "time": " 22.May.2007 9.41am",
      "content": "Interesting project!  \nBefore I dive deeper, let me ask: are you sure you want to use Caslon?\n\nhhp\n\n"
    },
    {
      "time": " 22.May.2007 1.29pm",
      "content": "caslon seemed right for the brief, I mean, the course tutors want to see historical background. The face has to relate to the timeframe of the text itself. Stevenson leaves an ambiguity about the actual date that the proceedings occured, when the date is mentioned he marks the year as “18—”, so it could exist anywhere whithin C19th.\n\nI read that Caslon was a widely used face during the 18th century, and from my samples it seems to work well for the subject matter. Baskerville seems to be a litte contrived, a fantastic face that fits the restrictions of the text, but I would like to be a little...different.\n\nWhat would you suggest hrant? Thankyou for the feedback. It is really appreciated.\n\nTomShep\n\n"
    },
    {
      "time": " 22.May.2007 1.40pm",
      "content": "What about using different optical variations of [ITC Founder’s Caslon](http://web.archive.org/web/20080422033343/http:/www.myfonts.com/fonts/itc/founders-caslon/) to illustrate the sinister duality of the story?\n\n"
    },
    {
      "time": " 22.May.2007 3.44pm",
      "content": "now that IS a good idea. Of course, this will command a complete re-edit of the text.\n\nYou see, TomShep is a student who takes his macintosh everywhere. At the moment I am residing in a bar in deep south london. It is 11:40.\n\nAside from my alcohol intake, the face seems to relate far more to the old stlyle caslon. Do you think it would be wise to use the ’adobe caslon’ for the rational Dr Jekyll, and revert to the founders caslon for the manical Mr. Hyde?\n\nThe font will be purchased tomorrow mornig after this frivolous night is over.\n\nI can onky thank you for the input.\n\nThnakyou x\n\n"
    },
    {
      "time": " 22.May.2007 5.19pm",
      "content": "Happy to help. Here are the two set side by side. You would have to play with the settings to get them to work together.\n\n ![](http://web.archive.org/web/20080422033343im_/http:/www.typophile.com/files/Jekyll-Hyde_5779.gif)\n\n"
    },
    {
      "time": " 23.May.2007 1.05pm",
      "content": "I guess Caslon makes sense. I just don’t like it - it’s so diluted.  \nDefinitely not Baskerville though. Hey what about Bell, or a Scotch?\n\nBTW, if Jekyll/Hyde was French I would’ve suggested Meridien and Vendome!\n\nThe idea of using a “rough” Caslon for the nasty fellow seems intuitive,  \nand it can probably work, but I think there’s room for more subtlety.\n\nhhp\n\n"
    },
    {
      "time": " 23.May.2007 1.20pm",
      "content": "What about Monotype Bulmer. It looks like a Baskerville but isnt so wide and looks better in Text\n\n"
    },
    {
      "time": " 23.May.2007 6.59pm",
      "content": "I also generally stay away from Caslon (with the exception of Mr. Carter’s Big Caslon). I agree with Hrant that Bell MT would be gorgeous. But what about the two contrasting display faces?\n\nOne option would be to stick with one face throughout and treat it differently for each character, such as using white titles on black for the bad guy.\n\n"
    }
  ]
}
