{
  "id": "33963",
  "title": "Help with Learning Grid Systems by Joseph Muller-Brockmann",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nI am trying to take the book Grid Systems and learn Joseph Müller-Brockmann's approach to setting up a functional grid but I am having some troubles with his examples and was hoping someone could shed some light on what it is I am not understanding.\n\n1. When I look at his examples in the book or any of his work the head line, body copy and captions all line up to my eye from the same baseline. Is this correct?\n\n2. In his examples he writes things like 20 pt head on 4 pt lead. Would this be 20 pt font size and 24 pt leading in my inDesign type pallet? I know this is a stupid question but when I set up three text blocks side by side in inDesign it doesn't look like his examples.\n\nFor example he says 20 pt head on 4 pt lead(20pt on 24pt) with body copy set at 10 pt with 2 pt lead(10pt on 12pt) and captions set at 7 pt on 1 pt lead(7pt on 8pt) and then nothing lines up.\n\n3. I have my text box set at Cap Height since he says your first line of type should fit in the grid at the cap height. Is this wrong?\n\n4. In his examples he has his breaks for the vertical spacing margins starting the top margin line at the base of the descender in the above line and then the bottom margin line at the Cap Height of the line below. Is there a formula for figuring out the height to the break?\n\n5. Am I just not understanding how to set things up in inDesign.\n\nI think it would be fun to understand how his grids work as I really am attracted to everything Joseph Müller-Brockmann has done. Can someone please help me out with understanding how to work this out.\n\nThank you so much for your time and help.\n\nMark\n\n",
  "author": "MarkG",
  "time": "22 May 2007 — 9:46am",
  "uid": "18736",
  "comments": [
    {
      "time": "22 May 2007 — 1:18pm",
      "content": "It's hard to diagnose your specific problems without seeing examples, but the vertical spacing you mentioned sounds about right. Using 20pt type and adding 4pts of lead (as in physical strips of lead) would equal a total vertical line height of 24pt. This is usually written 20pt/24pt and spoken 20 _over_ 24.\n\nMuch of what you're asking is, in the end, subjective. I know designers who prefer to laterally line up with the x-height of letters rather than the cap height. And some of my teachers who studied under Müller-Brockmann point out that he often used blindingly tight leading on [his posters](http://web.archive.org/web/20120423183056/http:/www.internationalposter.com/artpick.cfm?SortResults=Title&ArtistNumber=450&ArtistName=Josef+Mueller-Brockmann&ResultsFormat=thumbnail&ShowPosters=Show+Posters).\n\nI suggest that you play around with the numbers until it feels right to you.\n\n"
    },
    {
      "time": "22 May 2007 — 3:52pm",
      "content": "1. It depends, but generally this is how it’s done. That doesn’t mean that there’s anything wrong with text not aligning to a common baseline, but doing so can make a layout seem less ordered.\n\n2. 24 points of leading in indesign should be the same as 20 points type with 4 points of leading. If things don’t look exactly the same it may be because you’re using digital revivals of the fonts, and they may not have the same proportions.\n\n3. That’s up to the designer, but again, that’s how it’s usually done.\n\n4. There are plenty of forumlae for page margins, you should be able to find several in any book of typography. In the end the size of margins will be driven by a lot of factors, including paper budget.\n\n5. Maybe. If you really don’t think you understand indesign, put Muller-Brockman aside and read an indesign manual first.\n\n"
    },
    {
      "time": "24 May 2007 — 1:01am",
      "content": "\\>and then nothing lines up  \nIf you have a baseline grid set at 4pt and the copy set to align with baseline grid then they should line up, with a bit of fiddling.\n\nTim\n\n"
    },
    {
      "time": "24 May 2007 — 3:43am",
      "content": "If you are having problems trying to recreate examples using his quoted dimensions, it's probable that the points he is using are not the same size as the points you are using. I think I'm right in saying that one point only became exactly 1/72 of an inch with the apple Mac. Can anyone back me up on this? Since he is describing pre-dtp technology, he is probably using the didot point.Have a look at\n\nTypographical Mesurement Systems in Comparison\n\nat this link:\n\n[http://www.paratype.com/help/term/terms.asp?code=95](http://web.archive.org/web/20120423183056/http:/www.paratype.com/help/term/terms.asp?code=95 \"http://www.paratype.com/help/term/terms.asp?code=95\")\n\nA\n\n"
    },
    {
      "time": "24 May 2007 — 6:55am",
      "content": "Brockman’s points may be pres-postscript, but it shouldn’t matter. Even if the point sizes are different, the proportions should stay the same as long as Mark is just using points/picas for everthing and not converting it all to some other units.\n\nMark, do you have text set to align to the baseline grid in the document? If you accidentally turned the baseline grid on, and only for some of the text, that could keep things from aligning.\n\n"
    }
  ]
}
