{
  "id": "33974",
  "title": "Unzipped celebrates its 1st anniversary",
  "forum": "Bald Condensed's blog",
  "tags": [

  ],
  "content": "Today marks [Unzipped](http://web.archive.org/web/20131019083154/http:/www.fontshop.be/)’s first anniversary. Exactly one year ago I posted my first three entries, after having done a test run with the premiere of my movie poster critiques the day before. Now, one year later, I am pleased to announce a new era in the existence of this blog – Unzipped will switch to (mostly) English.\n\nThe initial plan – as explained in my [introductory post](http://web.archive.org/web/20131019083154/http:/www.fontshop.be/details.php?entry=15) – was to write in Dutch, with occasionally English and French translations. However it soon became obvious that I couldn’t free up enough time to do these translations. It is for that exact same reason that I discontinued my English tutorials on [The FontFeed](http://web.archive.org/web/20131019083154/http:/www.fontfeed.com/).\n\nAt several moments the past year I have been discussing with Rudy whether or not to switch to English, but I was unsure as to how my Dutch-speaking audience would react to that. To me it felt a bit like “betraying” them, silly as it may sound. It was my trip to [Typo Berlin](http://web.archive.org/web/20131019083154/http:/www.typoberlin.de/index.php/1/3) last week that convinced me the switch would be beneficial. I encountered some French-speaking compatriots who lamented the fact that Unzipped didn't cater for half the population of Belgium, and even Dutch-speaking readers reassured me that a switch would not be taken badly. Plus the language issue possibly prevents further growth.\n\nSo tonight I am pleased to announce a new era in the existence of this blog. Unzipped will switch to (mostly) English. Announcements for local and Dutch language events will continue to be posted in Dutch, but the bulk of the entries will now be readable by everyone. I hope this won’t slow me down too much, because Dutch is still my native language, but I guess we’ll just have to wait and see. Oh, and if and when you notice mistakes, please do tell me.\n\nI hope you’ll enjoy the ride. I sure will.\n\n",
  "author": "Bald Condensed",
  "time": "22 May 2007 — 2:56pm",
  "uid": "110",
  "comments": [
    {
      "time": "22 May 2007 — 3:10pm",
      "content": "Now that I was practicing my Dutch ;^)  \nAll the best for you and Unzipped.\n\nDino\n\n"
    },
    {
      "time": "22 May 2007 — 3:19pm",
      "content": "Congrats Yves!! Yey! Now I can read it too. Feel the love.\n\n"
    },
    {
      "time": "23 May 2007 — 8:46pm",
      "content": "Hallelujah. I feel like the gates to the chocolate factory have opened and now millions can partake of your goodness.\n\n"
    }
  ]
}
