{
  "id": "34005",
  "title": "Printing problems with a PDF",
  "forum": "Build",
  "tags": [

  ],
  "content": "I have a weird problem with a PDF.\n\nI made a specimen with InDesign featuring a typeface I made. When I print the PDF from Acrobat all the letters are overlapped on top of each other.\n\nScanned page:  \n [http://www.re-type.com/notaweblog/images/print-caca.jpg](http://web.archive.org/web/20071215013000/http:/www.re-type.com/notaweblog/images/print-caca.jpg \"http://www.re-type.com/notaweblog/images/print-caca.jpg\")\n\nThe PDF look perfect on screen and if I print from InDesign there is no problem. The embedding permits of the fonts are set to ’everything is allowed’.\n\nApparently the problem is with inkjet printers (only with this font). Laser printers seem to print the specimen with no problem.\n\nThanks for any feedback.\n\n [‹ Accent Height with Create Glyphs FL5](http://web.archive.org/web/20071215013000/http:/www.typophile.com/node/33900 \"Go to previous forum topic\") [OpenType Application Support ›](http://web.archive.org/web/20071215013000/http:/www.typophile.com/node/33122 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071215013000/http://www.typophile.com/user/1137\" title=\"View user profile.\">RamiroE</a>",
  "time": "<br>",
  "uid": "1137",
  "comments": [
    {
      "time": " 24.May.2007 6.53am",
      "content": "Have you checked to make sure your drivers for your inkjet printer are up to date? It seems like a tracking issue with the print head. The signals from the computer aren’t translating properly to the printer and that’s usually a driver issue.\n\n"
    },
    {
      "time": " 24.May.2007 9.03am",
      "content": "I think it has more to do with the file, but most likely the embedded font. It almost looks like if the sidebearings and spaces have disappeared or something.  \nI don’t think it’s the printer itself, if the tracking of the printhead was off, the horizontal lines would not print either? Also the glyphs seem to be printed non-distorted, just overlapped. The fact that it only happens with inkjets, probably has something to do with postscript.\n\nHave you already tried converting the font to outlines, and print again? I know it is not a solution, but it will let you know if the error is in the font.\n\n"
    },
    {
      "time": " 24.May.2007 9.15am",
      "content": "I might be wrong, but I wonder if the font which you are trying to print doesn’t allow printing and so it is defaulting to Adobe Sans. But, I can’t explain the kerning. Does it look like your font?\n\n"
    },
    {
      "time": " 24.May.2007 9.40am",
      "content": "I agree with Jelmar that it’s an embedding issue, but I’m not sure that it’s happening because you’re running this off on an inkjet (i.e. a Postscript problem). Which version of InD and Acrobat are you using? I’ve had problems in the past because I didn’t have the latest and greatest fixes for both....\n\n"
    },
    {
      "time": " 25.May.2007 1.08am",
      "content": "Thanks for the comments. The problems only occur with one of my families. If I do just the same with the rest of my typefaces (generating the PDF and printing from Acrobat), there is nor problem.  \nIt is true that the outlines are well printes, but it is the spacing that is set to zero. Weird...\n\n"
    },
    {
      "time": " 26.May.2007 12.31pm",
      "content": "How did you make the PDF, exactly?\n\nDid you use Mac OS X’s PDF creation capability, or InDesign’s, or Acrobat’s?\n\nT\n\n"
    },
    {
      "time": " 28.May.2007 10.39am",
      "content": "Hi Thomas,\n\nI used InDesign CS1. Then I opened in Acrobat 7 and I printed from there.\n\n"
    },
    {
      "time": " 28.May.2007 1.20pm",
      "content": "Not sure, but this could be similar to a problem I had with Tyfa PS Smallcaps. I have to export out of InDesign as a PS file and then run that through distiller for the file to look right.\n\n"
    },
    {
      "time": " 29.May.2007 3.38am",
      "content": "Hi Thomas,  \nIf you want to test it by yourself I can provide you with a copy of the FL file, the specimen and the PDF.\n\n"
    },
    {
      "time": " 29.May.2007 4.04pm",
      "content": "I’d be curious to see the PDF (and maybe the FL file).\n\nThanks,\n\nT\n\n"
    },
    {
      "time": " 29.May.2007 5.42pm",
      "content": "[deleted nonsense ...]\n\n"
    }
  ]
}
