{
  "id": "34002",
  "title": "@",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "\\*\n\n",
  "author": "carolbee",
  "time": "23 May 2007 — 11:50pm",
  "uid": "18773",
  "comments": [
    {
      "time": "24 May 2007 — 1:57am",
      "content": "Hmm, sounds very tempting...\n\n"
    },
    {
      "time": "24 May 2007 — 3:37am",
      "content": "I may be interested too\n\n"
    },
    {
      "time": "24 May 2007 — 11:39am",
      "content": "Put 'em on eBay and post a link here, so everyone can take a crack at it. I might bid as well.\n\n"
    },
    {
      "time": "27 May 2007 — 5:45am",
      "content": "Me me! Please me! Send me a link and I might be able to negotiate some price. oh pleeease...\n\n"
    },
    {
      "time": "28 May 2007 — 7:24am",
      "content": "Hey Carol :) You thought about it yet?\n\n"
    },
    {
      "time": "6 Aug 2007 — 10:11pm",
      "content": "\\*\n\n"
    },
    {
      "time": "29 May 2007 — 11:40pm",
      "content": "I would gladly make an offer, but I have no idea what quantity/quality where talking about here & I'm afraid to make a complete fool of myself when doing so (I can't even think of the value of a single issue to be honoust) ;-) Ebay seems like the perfect solution! But please, sell the 80s & 90s issues separately (per decade, not per issue) since I'm mostly intersted in the 90s issues ;-) You can still include an all-in offer.\n\n"
    },
    {
      "time": "30 May 2007 — 3:59pm",
      "content": "Please can you email the link onto this post so everyone is aware of it. Thanks :)\n\n"
    },
    {
      "time": "30 May 2007 — 10:28pm",
      "content": "Carolbee\n\nIf you are thinking of setting up an eBay account, note that there are sellers' fees. Both eBay and PayPal. U&lc issues don't go for much (somewhat of a hard sell). And their non-standard size is a negative factor in regard to shipping. They are what you might call a \"give-away.\"\n\nBut if you decide to partake, best word of advice: don't close an auction on a full moon. . . or during holidays. Or for that matter Fridays or Saturdays—web traffic drops dramatically. For some reason Sunday night through Monday morning is prime time and it just drops off from there on, with Thursday afternoon as endgame. And if you don't believe that, monitor the daily usage statistics of Typophile (ain't nothing ever going on here on the weekends—not sure what that reveals about type designers/typographers).\n\nGerald\n\n"
    },
    {
      "time": "31 May 2007 — 1:38am",
      "content": "I can always ask my mom for ebay tips, she's hooked on it ;-)\n\n"
    },
    {
      "time": "3 Jun 2007 — 4:21am",
      "content": "hmmm...\n\n"
    },
    {
      "time": "3 Jun 2007 — 11:18pm",
      "content": "ill sans\n\nis she buying or selling?\n\nmissgiggles\n\nLOL\n\nBTW: I have an issue of U&lc up on eBay every week.\n\nFYI: In it's short period of reign ITC had a literal monopoly over the type industry and treated type designers like s\\*\\*t. ITC was so arrogant \"it\" didn't get digital type and DTP. 1987 was the signal year and they were soon to be suddenly out of the picture. It took them years to finally figure it out.\n\nGerald\n\n"
    },
    {
      "time": "4 Jun 2007 — 3:03am",
      "content": "She's buying, but forced to sell as well in order to finance her purchases ;-)\n\n"
    },
    {
      "time": "6 Aug 2007 — 10:11pm",
      "content": "\\*\n\n"
    },
    {
      "time": "6 Aug 2007 — 10:13pm",
      "content": "\\*\n\n"
    },
    {
      "time": "6 Aug 2007 — 10:10pm",
      "content": "\\*\n\n"
    },
    {
      "time": "15 Aug 2007 — 5:37am",
      "content": "Hello people :) I wonder if these are sold yet? Which ones are left, please let me know :) Thanks\n\n"
    },
    {
      "time": "15 Aug 2007 — 10:11am",
      "content": "[http://search.ebay.com/U-lc\\_W0QQ\\_trksidZm37QQfromZR40QQsatitleZUQ26lc](http://web.archive.org/web/20131018122826/http:/search.ebay.com/U-lc_W0QQ_trksidZm37QQfromZR40QQsatitleZUQ26lc \"http://search.ebay.com/U-lc\\_W0QQ\\_trksidZm37QQfromZR40QQsatitleZUQ26lc\")\n\n"
    },
    {
      "time": "15 Aug 2007 — 11:10am",
      "content": "I added them to my Mom's eBay-list ;-)\n\n"
    },
    {
      "time": "8 Oct 2009 — 12:30pm",
      "content": "This is a late reaction to this post,\n\nIm just reading it cause I have a lot of those old big-format-newspaper-size U&Lc... ánd seriously thinking of thrashing them... not sure if its worth anything...\n\nAnyone an idea if it is worth a lil? Maybe... someone interested? :)\n\nHope someone is still reading along,\n\nVery best, Matt\n\n"
    }
  ]
}
