{
  "id": "34004",
  "title": "Scriptina - who did it?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I absolutely love Scriptina, which is a great typeface - but an abysmally bad font. Does anyone here know who actually designed this typeface?? My research never comes up with an actual person. I would very much like to ask this person if it were possible in any way to improve the font quality.\n\n",
  "author": "Werfer",
  "time": "24 May 2007 — 2:20am",
  "uid": "10639",
  "comments": [
    {
      "time": "24 May 2007 — 2:31am",
      "content": "Some Apostophe guy or gal...  \n [http://desktoppub.about.com/library/fonts/hs/uc\\_scriptina.htm](http://web.archive.org/web/20130707032456/http:/desktoppub.about.com/library/fonts/hs/uc_scriptina.htm \"http://desktoppub.about.com/library/fonts/hs/uc\\_scriptina.htm\")\n\n"
    },
    {
      "time": "24 May 2007 — 2:56am",
      "content": "[Identifont](http://web.archive.org/web/20130707032456/http:/www.identifont.com/find?font=Scriptina) says it's a guy named Frederic Nader.\n\nTyler\n\n"
    },
    {
      "time": "24 May 2007 — 6:07am",
      "content": "For fonts of that style that are both technically and artistically sound, look to the [scripts of Alejandro Paul](http://web.archive.org/web/20130707032456/http:/www.veer.com/partner/link.aspx?i=1048&c=4&p=/search/results.aspx?savedSearch=b202340179e390a6).\n\n"
    },
    {
      "time": "24 May 2007 — 1:47pm",
      "content": "Fred told me he considers his free fonts to be in the public domain, which means you are free to clean it up if you want. I might even have it in writing, if I can find the e-mail.\n\n"
    },
    {
      "time": "24 May 2007 — 2:15pm",
      "content": "I agree with Stephen. The scripts that Alejandro produces are beautiful and well-crafted. You'll find something very much in the style of Scriptina.\n\n(Not to take anything away from Umbrella or House, other fine script producers.)\n\n"
    },
    {
      "time": "31 May 2007 — 1:22am",
      "content": "@fontplayer - REALLY???? GREAT!! Oh, please, please.... can you get this for me? I would be soooo happy. The characters are sooo beautiful, but the font is just crap.\n\n"
    },
    {
      "time": "31 May 2007 — 10:22pm",
      "content": "I 'll be sure to tell him your feelings when I call him. It turns out that when I checked and couldn't find it, I remembered that when my 40 Gb HD was running out of space, I deleted all folder e-mails (except save) that were older than one year old, and compressed folders (a Windows thing), to save disc space.\n\nMaybe when I tell him you think it is crap he will e-mail me a dispensation to allow you to make it less smelly.  \n; )\n\n(I imagine that something like \"it has problems\" would be more politic, but I can relate to just letting fly with what I consider to be the truth)\n\n"
    },
    {
      "time": "1 Jun 2007 — 12:11am",
      "content": "@fontplayer - that would really be cool. You are of course right, \"it has problems\" sounds much nicer. I daresay these problems are not in any way related to the creator, who just designed supercool characters, and then put them in his font creating software, which made this abysmal TT I am currently using. So, no blame or insult intended to the designer (the programmers of whatever software he used, on the other hand...) :-)\n\n"
    },
    {
      "time": "1 Jun 2007 — 12:31am",
      "content": "\\> but the font is just crap  \n\\> this abysmal TT\n\nThe quality of the original PS and TT fonts available here\n\n[http://moorstation.org/typoasis/designers/lab/lab\\_scriptina.htm](http://web.archive.org/web/20130707032456/http:/moorstation.org/typoasis/designers/lab/lab_scriptina.htm \"http://moorstation.org/typoasis/designers/lab/lab\\_scriptina.htm\")\n\nare neither crap nor abysmal.\n\nBut then, for Pike Werfer, most things are crap and abysmal.\n\n"
    },
    {
      "time": "1 Jun 2007 — 2:08am",
      "content": "Well, looky here - it is Uli, our great Latin speaker and self-proclaimed legal expert :-) So now your a font technology expert, too? I'm impressed.\n\nSo, this font is not crap. Let me ask a few questions:\n\n1. What do you know about font technology? (We are talking about the SOFTWARE here, you do realize, I hope? We are NOT, I repeat, NOT talking about the design, we are NOT talking about the typeface, which is great.)  \n2. How many fonts have you actually done yourself?  \n3. What is the status of your education concerning font programming?  \n4. On what do you base your assumption that these fonts are okay? (and please do not say that letters come up when you press keys, please, please, please...)  \n5. What do you know about the structure of Truetype fonts?  \n6. What do you know about unicode tables?\n\nOh, and one more thing - \"But then, for Pike Werfer, most things are crap and abysmal.\" Please prove this by naming examples. As far as I know, we have not met, and I daresay I never tagged anything as crap before in this forum. I do believe the word abysmal popped up in our last conversation, though. However, \"ULI\" is not the equivalent of \"most things.\" :-)\n\nOtherwise, I would be forced to categorize this as a stupid and untrue attempt to insult me, proclaim things about me which are untrue and simply act the troll. Which means I will once more stop taking you serious, laugh about you, and invoke \"The Silence Brigade.\"\n\nPlease allow me to be so bold as to state my opinion: you know next to nothing about font software programming. Sorry to say it.\n\nThis, however, is a conversation where people who DO know talk about how to improve a font which is not so good in order to honour the wonderful design which it visualises. Oh, and no shady lobbyists here. No money involved. Just enthusiastic type people. Sorry to disappoint you.\n\nShould I be correct, and should you not be able to answer the questions (as you did the last time we had an argument, which was quite embarrassing for you, I daresay), then I would politely ask you to stay out of it. Okay? It is simply rude to interrupt people who have a conversation by spouting unproved insults. It is a nono, Uli. Your mother should have taught you that.\n\nOh, by the way - just to inform you, since I believe you are trying to get your fun out of annoying people (this is indeed an assumption, I have no proof of it :-), let me tell you that you do not annoy me. You entertain me. Therefore, stay with me and keep posting stuff like this - don't go away like last time. I do adore having arguments with people like you :-)\n\n"
    },
    {
      "time": "1 Jun 2007 — 8:10am",
      "content": "The slang term \"crap\" and the hazy term \"abysmal\" prove that Mr. Werfer is unable or unwilling to supply a technical description of the flaws, if any, of the Scriptina font file. And in addition, Mr. Werfer is unable or unwilling to specify \"this abysmal TT I am currently using\".\n\nFor instance, the different font files named SCRIPTIN.TTF downloadable from\n\n1) [http://www.dafont.com/scriptina.font](http://web.archive.org/web/20130707032456/http:/www.dafont.com/scriptina.font \"http://www.dafont.com/scriptina.font\"), and also from\n\n2) [http://desktoppub.about.com/library/fonts/hs/uc\\_scriptina.htm](http://web.archive.org/web/20130707032456/http:/desktoppub.about.com/library/fonts/hs/uc_scriptina.htm \"http://desktoppub.about.com/library/fonts/hs/uc\\_scriptina.htm\")\n\nare \\*\\*\\*not\\*\\*\\* identical with the original font file downloadable from the website specified by me. The Dafont and Desktoppub font files have been tampered with by persons like Mr. Werfer who want \"to improve the font quality\".\n\n"
    },
    {
      "time": "1 Jun 2007 — 9:20am",
      "content": "It is all subjective people. One person's crap is another person's gold. Please don't turn this into a negative shouting match.\n\n"
    },
    {
      "time": "2 Jun 2007 — 12:16pm",
      "content": "Werfer, the phone number I had is now someone else's. So I e-mailed using the last address I had. If I hear back I'll resurrect this thread.\n\n"
    },
    {
      "time": "4 Jun 2007 — 1:58am",
      "content": "@fontplayer - thank you so much. I'm really thankful!! Let's hope he answers back. Since I would never touch a font without the consent of the person who made it. Golden Rule :-)\n\n@Miss Tiffany - sorry, but I guess I've got no choice. I didn't start this, but since he asks for it, I'll gladly let 'em have it. :-)\n\n@Uli - Hey Uli, since you are once again unable to answer a single question - could it be that you can't read? I do hope you're not blind :-)\n\nWell, your answer proves my point. You don't know anything about fonts, do you? But you like to be important, and prove it by posting links you found in google. So very clever of you. Why this community, I once again ask myself. Why not motorcycles?\n\nSo, what would it help you if I told you that some of the table entries in the font are wrong? What would you say when I tell you that this font needs contextual features to really work? Would you understand when I tell you that the scaling is not always correct? What would you say if I pointed out that the hinting in some places could be improved?\n\nI remember some guy named Uli telling me that he could prove his point, but that I should check for myself, hihi.... Do you want me to post the link of the topic where you said it? I could, you know :-) Oh, it is a bad thing when your own words come back to haunt you, is it not? Was it not you who claimed things without being able to prove them? (Want the link :-) And now you're blaming me for not doing it. Oh, you would be such a bad politician. Don't you realize everybody can see through it, and is laughing about you (well, apart from the people who get aggravated by you - luckily, I'm not one of them)?\n\nI did not prove them, because I simply wanted to talk to people who are able to get me into contact with the designer, so that I can talk to him, or get the permission to do a new version. So I am talking to people like fontplayer. This topic was not about dissing the typeface. It was not about dissing the designer. I thought it unnecessary to prove anything, because it was not my intention to attack anyone. Read the initial question. So there was nothing negative in this topic until you dropped in. Do you feel good now? Oh, and do you WANT me to prove them? If so, I might sit down and make a list. Just for you. To shut you up properly. Come on, ask me :-)\n\nIn case you want to learn something about fonts - and we are still talking about the SOFTWARE - then feel free to get a book. Oh, and the term \"crap\" simply states my opinion. Nothing else.\n\nOh, just to make you happy - I have ALL versions of Scriptina here, and the links you posted were known to me - I have access to google, too, you know.\n\nOh: 'The Dafont and Desktoppub font files have been tampered with by persons like Mr. Werfer who want “to improve the font quality”.' So you think you have enough knowledge to state that\n\na. I tamper with fonts without the consent of the creator (why this thread, then?)  \nb. claim that I am not good enough to do it properly  \nc. you yourself have enough know-how to know when a font has been improved or not\n\nUli, go away. Please. This is hilarious. Claiming without proof - did you not, just a few lines ago, state that this is a bad thing? Come on, make up your mind. Or is it like: other people need to prove it, I, the great Uli, do not need to. You claim that \"people like me\" manipulate software without the consent of the creator. You are accusing me of a crime, you do realize that? Without proof, of course. :-)) You should be thankful I do not know any shady lawyers, hihi... Oh, what fun. Every forum should have someone like you. Well, need to get to work now. See you soon, Mr. Stiehl. Naw, let's drop the Mister, eh, shouldn't we, Uli? Doesn't sound good :-)\n\n"
    },
    {
      "time": "4 Jun 2007 — 4:19am",
      "content": "I wonder why this strange Mr. Pike Werfer (a pseudonym?) wants to know my \"status of education concerning programming\". Anyone who visits my website will easily discover that I wrote 4 books about computer programming and that I was the editor in chief of a computer programming magazine and that I wrote a couple of commercial computer programs. For instance, Bill Gates programmed the Applesoft program interpreter in assembly language, and I programmed the Applesoft program editor in assembly language. That's not a joke, that's a fact.\n\nI wish there were other authors of computer programming books at Typophile, so that the false claim \"Fonts are software\" made by font sellers in order to deceive gullible font buyers could be discussed by experts instead of by laymen who have never written any books about computer programming.\n\n"
    },
    {
      "time": "4 Jun 2007 — 4:53am",
      "content": "Again you fail to answer a single question. I did not ask your status of education concerning programming. I asked your status of education concerning FONT programming! I don't care if you don't like to call fonts software - I do. But if it makes you happy, you could also call it script file, or executable (if its PS), or data. But what do you know about it? In other words: DO YOU HAVE KNOWLEDGE ABOUT WHAT A FONT REALLY IS? Oh, and what about those other questions? Don't you go and start picking raisins here! :-)\n\nSo you wrote some software. Great. But I don't care. It's beside the point. I was talking to somebody about fonts, and you come barging in. Oh, and comparing yourself will old Billyboy is not really a good one.\n\nSo you wish there were other authors of computer programming books here, but there are none? Why don't you then go and look some place else? Leave people alone who do not want to talk to you, hmmm?\n\nAnd no, I have NEVER written a book about computer programming. I've been to busy doing it for the last 20 years. :-) And the last 10 years were mostly concerned with fonts.\n\nTell ya what:\n\nYou claim that, for me, most things are crap and abysmal - prove it!  \nYou claim that I am one of those people tampering with fonts - prove it!  \nOh yes, and how about proving that blind people cannot read :-))\n\nIf you do so, I will give you a lecture about fonts as such and Scriptina in particular. I promise!!\n\nOtherwise - Silence Brigade for you once more :-) You do amuse me, but I do have things to do.\n\n"
    },
    {
      "time": "4 Jun 2007 — 5:51am",
      "content": "It is pretty obvious that this man/woman \"Pike Werfer\" is a pseudonym for someone else who wants to vent his/her pent-up frustrations.\n\nAccording to his/her entry [http://typophile.com/user/10639](http://web.archive.org/web/20130707032456/http:/typophile.com/user/10639 \"http://typophile.com/user/10639\")\n\nhe/she claims to be living in Hamburg in Germany.\n\nBut neither in the Hamburg telephone book nor in any other city of Germany occurs anyone with the family name \"Werfer\", let alone anyone with the complete name \"Pike Werfer\".\n\n"
    },
    {
      "time": "4 Jun 2007 — 7:07am",
      "content": "This is too funny!! :-)) ROFL I am actually the white rabbit, Uli. I live in a hole in the ground, and I drink my tea with dwarves. Every Wednesday. Come join. Oh, my, oh my.... \\*Werfer needs air\\*\n\nSorry, but you are really a lunatic. ;-) Here I was, talking to a fellow typophile about a topic you do not fully grasp. You come barging in to annoy us, claiming stuff you cannot prove and which you probably even know to be wrong.\n\nThen, when I point out your inconsistent and rather unintelligent behaviour, you start ranting about my name in order to discredit my valid arguments as well as myself as a person, and to camouflage your insulting behaviour. I have got news for you: it won't work. People on this forum are much too clever.\n\nGo and look for me if ya like - come to Hamburg, I will give you a sightseeing tour. :-) And until then, stay out of the conversations of grown-up people. fontplayer and I are talking to each other. Oh, and by the way, you DO know that Pike is a male name, don't you? I am married with children :-)) Oh, and one more thing:\n\n\\*whisper\\*  \nI am NOT listed in the phonebook. I don't like it. My initial idea was to protect myself from annoying calls from people who want to sell something to me while I am preparing dinner; looks like it has other advantages, too :-)  \n\\*end of whisper\\*\n\nand now for the last secret:  \n\\*whisper again\\*  \nWerfer is not a real person - he is actually a little elf with pointy ears, taken from my favourite comic, Elfquest. Pike is the English version of his name, so I thought it would be a cool pseudonym. I've used it since I don't know when. But thanks for checking the Hamburg telephone book. Now I at least know that there is no one living here who is REALLY called like that :-) Did you really, honestly believe that all these people here don't use nicknames? Ye flipping gargoyles, this is the internet. Did you check the Seattle telephone book for fontplayer? Is there a Miss Tiffany in New York? What about hrant? God, don't you at least feel a little bit stupid now?  \n\\*end\\*\n\n"
    },
    {
      "time": "4 Jun 2007 — 7:57am",
      "content": "It must be something in the air that makes us all a little nuts these days...  \nThere's a lot of personally addressed aggression on Typophile lately. Don't get me wrong, I don't mind it & I've even taking part in some of it ;-) It's just funny to see how it spreads & amusing to read people's arguments in their discussions. Keep up the good work! ;-)\n\n"
    },
    {
      "time": "4 Jun 2007 — 8:19am",
      "content": "@ill sans - thanks! I enjoy it, too :-)\n\nHowever, I must admit that all thanks should be passed on to Uli here. Hilarious - the things he writes are so ... well, unique ... that one can't go wrong. It is like a herring jumping into the can all by itself :-)\n\nOh, I should try to find you in the phone book. Is sans your first or your last name :-))\n\n"
    },
    {
      "time": "4 Jun 2007 — 8:30am",
      "content": "I'm only listed in medical journals as ill sans (check for the psychiatric wards) ;-)  \nTom Lukacs is however my real name, but I'm not listed in any phonebook simply because I don't have a phoneline (just a cell phone like any good yuppie).  \nIf you enjoy this, I can recommend the \"enfant terrible\"-thread as a good read ;-p\n\n"
    },
    {
      "time": "4 Jun 2007 — 9:48am",
      "content": "\\>Again you fail to answer a single question.\n\nI always ignored his long lists of bizarre questions, because I discovered at once that this so-called Pike Werfer is a phoney. He not only faked his name. The other \"facts\" he supplied are faked too.\n\nWhy should Freddy bother to deal with a phoney?\n\n"
    },
    {
      "time": "4 Jun 2007 — 11:59pm",
      "content": "\"The other facts he supplied are faked too.\" You are unbelievable :-) And of course you have proof for that, you great big font expert? Oh, my...\n\nOh, well.... enough fun! I was now asked by several people to stop playing with you - some mods, too - so I will: Silence Brigade for you, Uli. Please ignore my questions. Actually, please ignore me. And my threads. Go home. Although you really tempt me, I will ignore you, too, to get this topic back on track. It's boring, I admit, but it's peaceful. :-)\n\n@fontplayer - just send me a message as soon as you hear anything from Fred. You would make my day! :-) I will also check if I can contact him in any way.... really would like to see this baby go OpenType.\n\n@ill sans - thanks for the hint, I will certainly look into it :-) I do have a phone line, since my wife likes being on the phone, hihi... and I WON'T post my real name, otherwise I might get calls from Uli!\n\n"
    },
    {
      "time": "5 Jun 2007 — 4:44am",
      "content": "Good call (mind the pun ;-p )!\n\n"
    },
    {
      "time": "5 Jun 2007 — 5:35am",
      "content": "hehe - that's a good 'un :-)\n\n"
    },
    {
      "time": "5 Jun 2007 — 5:48am",
      "content": "Remember this one (one of my favourite movie moments):\n\n- #There's something strange in the neighbourhood, who you gonna call?#\n\n° HE-MAN! HE-MAN!\n\n(Ghostbusters 2)\n\n"
    },
    {
      "time": "5 Jun 2007 — 6:31am",
      "content": "Hmmmm... I wonder what HE-MAN would do in a case like this? I daresay we need a Typophile hero. How about TYPO-MAN?\n\n"
    },
    {
      "time": "5 Jun 2007 — 6:36am",
      "content": "typo-man sounds like a hero with the hidden weakness of spell-check.\n\n"
    },
    {
      "time": "5 Jun 2007 — 6:39am",
      "content": "misplaced keystrokes don't sound like very impressive superpowers.\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:07am",
      "content": "The battle against Comic Sans! Typo-man to the rescue! ;-)  \nIs it an editor? Is it a reviewer? No, it's Typo-man!\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:18am",
      "content": "Hihi.... CuckGroth is of course right. A very likable, yet handicapped super hero. How about SUPERFONT? :-)\n\n"
    },
    {
      "time": "5 Jun 2007 — 10:08am",
      "content": "Why not make a group of superheroes: the Fontforce?  \nEach can have their own specialty: one fights Comic Sans, another one strides against Wordart, a third one could search and destroy \"wrong use\" of type (the Word-like \"obliquening\" & \"bolding\", stretching & squiching fonts),...  \nI'm sure we'll be able to sell the comics via Typophile.  \nAnd if success is obtained, a movie is not out of the question (see the Helvetica movie) ;-)\n\n"
    },
    {
      "time": "6 Jun 2007 — 2:11am",
      "content": "That sounds cool - but there is one flaw. I can't draw comics :-/ Can you?\n\n"
    },
    {
      "time": "6 Jun 2007 — 2:54am",
      "content": "As a kid I've always wanted to be a cartoonist...  \nAnd most of the things I draw have a very high \"Picto-plasma\"-like ( [www.pictoplasma.com/](http://web.archive.org/web/20130707032456/http:/www.pictoplasma.com/ \"www.pictoplasma.com/\")) quality.  \nCute & simple characters that sometimes explode or burst into flames and stuff like that ;-)  \nI'm not much of a scenarist though, are you?\n\n"
    },
    {
      "time": "18 Jul 2007 — 1:02am",
      "content": "Sorry for taking so long - was on vacation with the family :-))\n\n@ill sans - I guess I am not too bad at that. Do you have an overall concept for a storyline?\n\n@fontplayer - any news??? I created an OpenType and am currently playing around with the settings, but naturally I would never release such a thing without the consent of the creator. \\*sniff\\* It MUST be possible to reach him somehow.\n\n"
    },
    {
      "time": "18 Jul 2007 — 7:54am",
      "content": "Well, I know he likes to go to MacWorld in January.\n\nI just though of one other way to get in touch. I'll give it a go this weekend.\n\n"
    },
    {
      "time": "18 Jul 2007 — 1:17pm",
      "content": "I don't have an overall idea for a storyline & I can't be bothered to think about one now just yet, sorry. I'm been swamped in a lot of personal projects lately & with every single thing I do, I get 3 new ideas. Workwise it's hell, but I just get such a great rush from these \"creative sprees\". I can't sleep, I forget to eat, I drink & smoke an awfull lot, but I feel fantastic! Mind you, I might have some ADHD symptons ;-p The idea of working together on a story really appeals to me though. My first font ever included a whole bunch of cute dingbats ( [http://typophile.com/node/27678](http://web.archive.org/web/20130707032456/http:/typophile.com/node/27678 \"http://typophile.com/node/27678\")) & since I have a lot of sketches to make an extended family of it, I was thinking of \"promoting/showcasing\" it in a little comic book or illustrated storybook. So far, I've only got one limerick ( [http://typophile.com/node/31766](http://web.archive.org/web/20130707032456/http:/typophile.com/node/31766 \"http://typophile.com/node/31766\")), but if you can think of a nice story that includes zombies, squirrels, batman, monkeys, spiderman, strawberries, the smurfs, hamburgers & fries, Mickey Mouse, butterflies & Mario Bros, it might be nice to work together ;-)\n\n"
    },
    {
      "time": "19 Jul 2007 — 6:30am",
      "content": "To generalize the info I just received, he is in a remote part of the world with no internet access, doing work with a group of friends for a well-known non-profit organization. So a definitive answer won't be soon in coming. I was told our query will be relayed when he calls.\n\nI can't say I know him well, but I do know he does things that make it seem like he dropped off the face of the earth from time to time.\n\n"
    },
    {
      "time": "23 Jul 2007 — 2:27am",
      "content": "@fontplayer - well, then I will wait for your input. Impatiently, of course, but I'll wait :-)) Wow, though! Working in a remote part of the world, that I could do. But without internet access?? I would die!! :-))\n\n@ill sans - zombies, squirrels, batman, monkeys, spiderman, strawberries, the smurfs, hamburgers & fries, Mickey Mouse, butterflies & Mario Bros??? Woah there :-)) I'll give it a thought, though....\n\n"
    },
    {
      "time": "23 Jul 2007 — 2:55am",
      "content": "There's more: a werewolf, The Creature From The Black Lagoon, Nosferatu, Dracula, a mummy, Frankenstein's monster, Pennywise from It, Leatherface from the Texas Chainsaw Massacre, Jason Voorhees from Friday The 13th, Freddy Krueger from A Nightmare On Elm Street, Michael Myers from Halloween, Dr. Zaius fromThe Planet Of The Apes, The Fly, Ghostface from Scream, Jigsaw from Saw, the Terminator, Gizmo & a Gremlin, aliens (own design, not the H.R. Giger ones), a robot, a king, a cook, a captain, an astronaut, an angel & a demon, a ghost, a whale, an octopuss, a chicken, fruits & plants & some office icons. Stretch your imagination where no mind has gone before ;-)\n\n"
    },
    {
      "time": "24 Jul 2007 — 3:02am",
      "content": "Woah there - and who is supposed to be the main hero???\n\n"
    },
    {
      "time": "24 Jul 2007 — 3:46am",
      "content": "It doesn't really matter. A bunch of short stories could also be nice. But don't worry, you've got some time to think about it, I've still got too much on my hands right now anyway.\n\n"
    }
  ]
}
