{
  "id": "34010",
  "title": "A pair for Trebuchet",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm working on a redesign of a website for a College of Fine Arts. I've got a fair amount of flexibility creatively, but I'm trying to remain true to the established ID system, as well as give a bit of a nod back to the design I'm replacing.\n\nNow, one of the things I'm keeping from the previous design is [Trebuchet](http://web.archive.org/web/20150219143841/http:/www.myfonts.com/fonts/ascender/trebuchet/regular/), which I'm using for the copy (it's currently also used for headlines, and just about everything save for the Logo type - that's done in [Friz Quadrata](http://web.archive.org/web/20150219143841/http:/www.myfonts.com/fonts/itc/friz-quadrata/friz-quadrata/index.html)). I would like to find a good headline font, and my options are pretty open - I intend to use font replacement to combat the more restrictive choices I face if I rely solely on browser-friendly fonts (currently, I'm looking at [sIFR](http://web.archive.org/web/20150219143841/http:/www.mikeindustries.com/sifr/)). Of course, if I don't have to, I would rather use something more universal. The big rub of all this, of course, is that these headlines need to be dynamic, so creating a static image for each headline is not a solution.\n\nI'm trying to maintain a more modern feel, and to keep the design clean. I've been placing [News Gothic (bold)](http://web.archive.org/web/20150219143841/http:/www.myfonts.com/fonts/linotype/news-gothic/bold/) as my headlines, and I like the way it feels, but my fear is that the difference between the two fonts - Trebuchet and News Gothic - is not different enough, and/or that either of them don't sit nicely with Friz Quadrata. Any suggestions?\n\nSample from one of the sites (includes all in their respective uses):\n\n ![](http://web.archive.org/web/20150219143841im_/http:/typophile.com/files/panpainter_trebuchet_4360.jpg)\n\n",
  "author": "panpainter",
  "time": "24 May 2007 — 8:51am",
  "uid": "18763",
  "comments": [
    {
      "time": "24 May 2007 — 9:10am",
      "content": "I think you're going backwards with the design process here. Rather than try to match the site's identity to the web font, I'd finish the design and then set the text in a web font that fits. In this case, I think Georgia, Gill Sans, Verdana, or Tahoma would be better suited to News Gothic. Not to mention they are more readable typefaces than Trebuchet.\n\n"
    },
    {
      "time": "24 May 2007 — 9:25am",
      "content": "Well, you'll want to keep the EULA in mind then as many foundries do not allow embedding on the web. Those who do require an additional license.\n\nSome foundries who do allow web embedding without additional licensing: Adobe, Ascender, and Mark Simonson.\n\n"
    },
    {
      "time": "24 May 2007 — 9:47am",
      "content": "Trebuchet doesn't sit nicely anwhere. Ditch it. If you want a web font that relates to the logo, specify Candara, Lucida Grande, Gill Sans and Verdana in that order. Use that same font everywhere.\n\n"
    },
    {
      "time": "24 May 2007 — 10:17am",
      "content": "Thanks for the point about the EULA - I hadn't considered that, so I'll be sure to do my homework there.\n\nAnd thanks also for the quick responses - I'll definitely look to ditch Trebuchet, and start experimenting with your suggestions.\n\n"
    },
    {
      "time": "24 May 2007 — 11:14am",
      "content": "I disagree; I'm actually quite surprised by how well Trebuchet and Friz Quadrata seem to go together. But don't add a third font because it won't fit no matter what it is.\n\n"
    },
    {
      "time": "30 May 2007 — 8:25am",
      "content": "(Just as follow up, and to close this out... )\n\nThanks everyone for being kind to a new-poster. What I ended up doing was leaving Trebuchet out of the equation entirely, and instead I'm using a Helvetica/Verdana pairing; Verdana's too wide for the headlines, but it works better for the body copy. Trebuchet just didn't reduce as well as I'd like, and I moved away from News Gothic in favor of something more standardized.\n\nMost of the faces suggested just didn't feel... right, although I've got some ideas for future projects now. Again, thanks for the assistance.\n\n"
    },
    {
      "time": "30 May 2007 — 10:24am",
      "content": "\"as many foundries do not allow embedding on the web.\"\n\nPerhaps this is a goofy and innaccurate term the foundries have coined, but there is no such thing as 'web embedding' these days. I've seen this term pop-up in here a few times.\n\nAt one point in time, you could embed the font in your HTML page and it'd get downloaded by the browser. NN4 and an early version of IE supported this). But browsers no longer support this.\n\nNowadays, you can embed fonts in a PDF or in a SWF file. These aren't inheritently 'web' based, though they certainly can be.\n\nYou can just convert your type to outlines as well, though that defeats the purpose of it being text and accessible online.\n\nIn the end, if you REALLY want a custom font, just make it an image. That gets around any silly licensing and if implemented correctly, can still be very accessible (within reason).\n\n"
    },
    {
      "time": "30 May 2007 — 2:23pm",
      "content": "Yes, I've come to realize that web embedding isn't the right phrase, but for lack of something correct that encompasses all forms, for better or worse, that is what it has become.\n\n"
    },
    {
      "time": "31 May 2007 — 7:50am",
      "content": "\"for better or worse\"\n\nSo, is it a term the foundries have coined? It seems very odd. As it seems completely arbitrary as to whether or not the application I'm embedding it into is on the web or not. If I sent it via email, is that OK? Or on a CD?\n\n"
    },
    {
      "time": "31 May 2007 — 9:30am",
      "content": "Adobe defines embedding this way:  \n<cite>Font embedding is a process by which fonts used in the creation of a given document, are incorporated within, and travel with, the document. When a document with an embedded font is viewed, the viewer sees the document exactly as the creator intended the document to be seen. The formatting and stylized design of the document are retained. (<a href=\"http://web.archive.org/web/20150219143841/http:/www.adobe.com/aboutadobe/antipiracy/ff_faq.html#section-2\" rel=\"nofollow\">Adobe Anti-Piracy Initiative: Font FAQ</a>)</cite>\n\nAs far as usage ... -  \n<cite>14.7.5 You may embed copies of the font software into your electronic documents for the purpose of printing and viewing the document. If the font software you are embedding is identified as \"licensed for editable embedding\" on Adobe’s website at <a href=\"http://web.archive.org/web/20150219143841/http:/www.adobe.com/type/browser/legal/embeddingeula.html\" title=\"http://www.adobe.com/type/browser/legal/embeddingeula.html\">http://www.adobe.com/type/browser/legal/embeddingeula.html</a>, you may also embed copies of that font software for the additional purpose of editing your electronic documents. No other embedding rights are implied or permitted under this license. (<a href=\"http://web.archive.org/web/20150219143841/http:/www.adobe.com/type/browser/legal/pdfs/EULA5seat_USEnglish02.03.04.html\" rel=\"nofollow\">Software License Agreement</a>)</cite>\n\nGranted, that doesn't mean that it's a universally agreed upon definition, and really doesn't apply to the web - though the method I was talking (sIFR) about _does_ fall under this definition, but I did leave out a crucial tid-bit of information - sIFR is set up in such a manner that the font usage is restricted to a domain, thus preventing said piracy. Also, most of what I'm reading pertains more to print than it does to the web.\n\nAnyway, it does seem a tad vague and subject to situational judgment.\n\n"
    },
    {
      "time": "31 May 2007 — 9:39am",
      "content": "Perhaps they fear having to identify every form of embedding. This could also be the reason some foundries keep it simple and don't allow embedding at all or they only list PDF embedding.\n\nIn the end I've found that many foundries have a basic license which either allows for most reasonable things and don't want to be bothered with random questions ... OR ... their basic license only allows for a few things and they do want you to call them and open up dialogue with them. This is over-simplifying, of course, because their are also those foundries who offer extended licenses online.\n\n"
    },
    {
      "time": "1 Jun 2007 — 1:04pm",
      "content": "I like trebuchet!\n\nI'd say forget about embedding fonts, it's so complex now .. maybe in a few years that'll be a good option - Rather than placing News Gothic headline images, maybe you just need to use generously-spaced all-caps for a few of the headlines to help with the hierarchy.\n\nby the way, this is helpful for web type [http://typetester.maratz.com/](http://web.archive.org/web/20150219143841/http:/typetester.maratz.com/ \"http://typetester.maratz.com/\")\n\n"
    },
    {
      "time": "1 Jun 2007 — 2:33pm",
      "content": "What a fantastic resource! Thanks Erin.\n\nYeah, I like Trebuchet too, but it just wasn't working for the body copy - hence the Helvetica/Verdana pairing.\n\n"
    }
  ]
}
