{
  "id": "34013",
  "title": "Bring back the Interrobang",
  "forum": "Design",
  "tags": [

  ],
  "content": "Many people would argue that we should just simply type “!?” or “?!” However, then the question arises: Is this statement more of a question or an exclamation? The [interrobang](http://web.archive.org/web/20070911200509/http:/typophile.com/wiki/interrobang) obliterates the need to distinguish between the two.\n\n| Attachment | Size |\n| --- | --- |\n| [Yeswecan.jpg](http://web.archive.org/web/20070911200509/http:/typophile.com/files/Yeswecan.jpg) | 6.25 KB |\n\n [‹ Your opinions on Century](http://web.archive.org/web/20070911200509/http:/typophile.com/node/34046 \"Go to previous forum topic\") [font for a military project ›](http://web.archive.org/web/20070911200509/http:/typophile.com/node/34097 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911200509/http://typophile.com/user/17709\" title=\"View user profile.\">HaleyFiege</a>",
  "time": "<br>",
  "uid": "17709",
  "comments": [
    {
      "time": " 24.May.2007 1.01pm",
      "content": "The problem with the conventional [interrobang](http://web.archive.org/web/20070911200509/http:/typophile.com/wiki/interrobang) — and maybe one of the reasons it never gained acceptance — is that it is an extremely awkward form. My favorite solution is in Christian Schwartz’s [Amplitude](http://web.archive.org/web/20070911200509/http:/www.fontshop.com/fonts/singles/font_bureau/amplitude_wide_bold/&sample_text=%C3%B7&sample_size=144) and [Fritz](http://web.archive.org/web/20070911200509/http:/www.fontshop.com/fonts/singles/font_bureau/fritz_robusto/&sample_text=%C3%B7&sample_size=144).\n\n"
    },
    {
      "time": " 24.May.2007 1.23pm",
      "content": "\\> Christian Schwartz’s Amplitude and Fritz.\n\nI had never seen that version before, but I agree. It is much more comfortable looking.\n\n"
    },
    {
      "time": " 24.May.2007 1.27pm",
      "content": "Many times when I use an exclamation point followed by a question mark I am being emphatic. However, there isn’t always humor attached to the emphasis. I find most interrobang designs to be a little on the odd and silly side.\n\n"
    },
    {
      "time": " 24.May.2007 1.37pm",
      "content": "That’s a good point, Tiff. I also wonder if the lack of popularity of the interrobang isn’t also because it’s (relatively) recent — my Webster’s shows a first citation of 1967, and even a source as august as Chicago lumps “interrogative point” in with “question mark.”\n\nPerhaps the fact that it really doesn’t “do” anything radically different than the marks we’ve already got, and, at least to me (YMMV), it’s not something terribly intuitive from a handwriting aspect either.\n\n"
    },
    {
      "time": " 24.May.2007 3.39pm",
      "content": "I think it has real potential for internet short hand. I would personally probably use it daily if it wasn’t so hard to key in.\n\n"
    },
    {
      "time": " 24.May.2007 5.28pm",
      "content": "So much new punctuation! We already have the [snark](http://web.archive.org/web/20070911200509/http:/typophile.com/node/28817) (period with tilde above), which has [medieval origins](http://web.archive.org/web/20070911200509/http:/www.mufi.info/specs/), revived here on Typophile by Choz Cunningham.\n\n"
    },
    {
      "time": " 24.May.2007 7.33pm",
      "content": "The snark. That is bound to take off. The interrobang is just rather useless, I would never user it!!\n\n———————————-  \nChopper Reid says “Harden the \\*\\*\\*\\* up”.\n\n"
    },
    {
      "time": " 24.May.2007 8.15pm",
      "content": "Are you trying to be funny.~‽\n\n"
    },
    {
      "time": " 25.May.2007 4.24am",
      "content": "Well, that shows it doesn’t work in Georgia.\n\nTim\n\n"
    },
    {
      "time": " 25.May.2007 6.10am",
      "content": "<cite>HaleyFiege: However, then the question arises: Is this statement more of a question or an exclamation? The interrobang obliterates the need to distinguish between the two.</cite>\n\nThis is precisely the problem with the interrobang. The two need to be distinguished. It makes a difference whether you punctuate !? or ?! The two are not the same.\n\nThe first (!?) is an exclamation that’s being questioned, often indicating a sarcastic, sardonic, or self-deprecating tone. _“Typophile is going to start allowing animated flash avatars. Hurray!?”_\n\nThe second order (?!) denotes a question that is being emphasized. _“Typophile is going to start allowing animated flash avatars. What the f\\*\\*\\*?!”_\n\nBy far the more common need is the latter (?!), but the design of the interrobang makes it look more like the former.\n\nPunctuation is intended to clarify meaning. The interrobang does just the opposite.\n\nBesides, it clots terribly in text settings.\n\n— K.\n\n"
    },
    {
      "time": " 25.May.2007 8.39am",
      "content": "bring it back!\n\n"
    },
    {
      "time": " 25.May.2007 11.08am",
      "content": "Coincidentally, I was recently interviewed about the interrobang for a programme on CBC radio. The programme, about changing punctuation practices, can be heard here: [http://www.cbc.ca/andsometimesy/pastshows.html?episode18](http://web.archive.org/web/20070911200509/http:/www.cbc.ca/andsometimesy/pastshows.html?episode18 \"http://www.cbc.ca/andsometimesy/pastshows.html?episode18\")\n\nAs I say in the interview, and as I’ve explained at some length in previous Typophile discussions on the subject, I don’t consider the interrobang a punctuation mark, because it doesn’t mark a grammatical structure. It’s a kind of extra-grammatical and informal expressive mark.\n\nHaley writes, re !? and ?!: _the question arises: Is this statement more of a question or an exclamation?_\n\nIn fact, this question never arises, because grammatically a question and an exclamation are entirely distinct, and in English the punctuation marks ! and ? are most often only aids to reading. The distinction can almost always be determined from word order:\n\n’How big is that dog?’ vs ’How big that dog is!’\n\nThe first is a question and the second is an exclamation. Note that these marks are the only grammatically correct ways to terminate these two sentences. The exclamation mark is not simply a kind of louder or more emphatic full stop: ’How big that dog is.’ would be incorrect because the sentence is grammatically an exclamation.\n\nThe punctuation marks only become essential to comprehension when the utterance is truncated to a sentence fragment:\n\n’How big?’ vs. ’How big!’\n\n"
    },
    {
      "time": " 25.May.2007 2.28pm",
      "content": "John: _...grammatically a question and an exclamation are entirely distinct.._\n\nHow about the sports commentator who says “How big is that goal?!”\n\nGrammatically, it’s not a real question, because it doesn’t call for an answer; it’s a _rhetorical_ question, but doesn’t a rhetorical usage require the proper mark?\n\n"
    },
    {
      "time": " 25.May.2007 5.33pm",
      "content": "I’d be inclined to punctuate ’How big is that goal!’ with an exclamation mark, because it is really an exclamation about how big the goal is, not a question, even though the word order is that of a question.\n\nBut most rhetorical questions are simply questions, and are punctuated with the question mark. We don’t have separate question marks for rhetorical and non-rhetorical questions because there is no _grammatical_ difference between them. A lot of people seem to want a kind of extra grammatical text marking, e.g. to indicate excitement or irony or rhetorical usage, but that’s not the system we have. We use punctuation to help us comprehend the structure of text, not the use of text. [Articulating the use of text is one of the things for which we use typographic variation, setting things in italic or bold, or at differen sizes to signal different kinds of information or different levels of stress or importance.]\n\n"
    },
    {
      "time": " 25.May.2007 7.08pm",
      "content": "I think I am with Kent & John on this. The interobang is the grapmatical typographical equivalent of bold italic underlined. It almost certainly isn’t really needed even if you can do it. And if you really do there is always the two glyph combination.\n\nI would also make the technical point that it would be better & more practical to simply kern two standard glyphs (or make a special one if you really need to) in order to solve what the interobang supposedly solves.\n\nIn a related vein; it seems to me ( and actually I would welcome counterarguement here ) that making a ff or ffl or fi ligature out of two or three glyphs kerned into a ligature is preferable to one glyph because they can be designed to ’degrade’ from the original design more elegantly when automatically spaced in various ways than a single fixed ligature glyph can.\n\nBut the point made earlier by Haley about the Interobang being hard to access is I think the most salient point. You can cheer or boo as you like but it doesn’t matter. It isn’t going to get traction because it’s not on the keyboard.\n\n"
    },
    {
      "time": " 26.May.2007 6.12am",
      "content": "I had no idea of the existance of the interrobang, but personally I just use “?!” or “!?” depending on how the sentence is formulated and what its purpose is (like some previous posters already illustrated, it’s not only used in “real” questions & the “?!”/”!?” should be used accordingly).\n\n"
    },
    {
      "time": " 26.May.2007 8.32pm",
      "content": "Tom, can you explain exactly how, maybe with examples, you differentiate use of ’!?’ and ’?!’?\n\n"
    },
    {
      "time": " 26.May.2007 9.07pm",
      "content": "_hard to access_\n\nEnterprising foundries could make it a “ligature” in an OT font, so that when you type !? or ?! you get the interrobang.\n\n"
    },
    {
      "time": " 26.May.2007 9.13pm",
      "content": "One interesting and functional example of existing usage of the interrobang comes from algebraic notation systems for chess games. See the [Wikipedia article](http://web.archive.org/web/20070911200509/http:/en.wikipedia.org/wiki/Algebraic_chess_notation).\n\nThe following short-hand notations are frequently used to comment moves:\n\n! - a good move  \n !! - an excellent move  \n ? - a mistake  \n ?? - a blunder  \n !? - an interesting move that may not be best  \n ?! - a dubious move, but not easily refuted  \n □ - only legal move from this position (forced)\n\nSo, a whole series of moves and countermoves might look like:  \nWhite / Black  \n1. e4 / d5  \n2. exd5 / Nf6  \n3. d4 / Bg4  \n4. Bb5+ / c6?!  \n5. dxc6! / Bxd1?  \n6. c7+ / Qd7??  \n7. c8Q# (# denoting checkmate)\n\n"
    },
    {
      "time": " 27.May.2007 2.11am",
      "content": "Well, to use the example of the goal, I would use “!?” since it’s a rhetorical question more used to emphasize the size of the goal & not actually respecting a response in measurements: “How big is that goal!?”. When baffled at something, I’d write “What the f\\*\\*\\* what thàt?!”. But I have to admit though that I use languages as they please me & sometimes deliberaltey “break the rules” when I don’t find them appropriate (eg. I’ve recently read in a styleguide of Dutch that one should use single quotiation marks solely unless actually quoating someone, I always use he double quotation marks; another example is again about emphasizing... when emphasizing a word in Dutch you always have to use the accent aigu, but I use my accents according to their phonetical purpose).\n\n"
    },
    {
      "time": " 27.May.2007 3.37am",
      "content": "The only problem with the premise of exclamations and interrogatives as simply grammatical structures, is that punctuation is part of (written) language, and hence, living. Were they _only_ to function to explain grammar, they would be redundant. Yes, they can do that, but they really do evoke inflection, tone or even subtext. Just like the unending sea of alternate spellings and neologisms, if that’s not the intention or origin of punctuation, it is still the vox populi.\n\nThe interrobang’s problem is that either !? and ?! do the job well enough for regular Joe (where it needs to be clearly more ? or!, they’ll just drop the weaker), and it is just not elegant enough for the letterati. Designers far more talented than I make funky underdotted Ps when trying to cram the old i-bang into a text face.\n\nAfter my bias for the snark, I have to say I love the “wtf” lig. The grace of the form clashes deliciously with the meaning.\n\n"
    },
    {
      "time": " 27.May.2007 5.41am",
      "content": "\\> _Enterprising foundries could make it a “ligature” in an OT font, so that when you type !? or ?! you get the interrobang._\n\nThat would be a really bad idea. What about the (majority[?] of) people that don’t want to see what they typed transformed into the interrobang? One could argue that ’ligatures’ could (perhaps) be turned off, but still... The interrobang has earned its one codepoint, so we better use it, for the sake of having the message correctly encoded.\n\n"
    },
    {
      "time": " 27.May.2007 8.49am",
      "content": "Choz, we _use_ combinations of ?! and ?! to evoke inflection, tone or subtext, but my point is that in so doing we are using these marks as something other than punctuation. We don’t use , : ; . etc. for those purposes. It is only ! that we have loaded with an extra-grammatical, expressive function. Personally, I think the reason for this is that the majority of primary school teachers no longer teach grammar in any systematic way, and couldn’t explain the construction of an exclamation. So one ends up with silly explanations like ’! means something said loudly or emphatically’: the mark is now taught as an expressive mark and not as a punctuation mark.\n\n"
    },
    {
      "time": " 27.May.2007 10.26am",
      "content": "Miguel: _That would be a really bad idea._\n\nThank you for taking my suggestion seriously.  \nAfter all, I didn’t add a smiley (which also has its own codepoint).  \nHowever, I didn’t intend it as a definitive recommendation; for instance, I didn’t specify whether it should be a standard (default) or discretionary ligature.  \nSo it was half in jest, open-ended, let’s see where it leads.  \nBy “enterprising”, the implication is that not every font from every foundry has to play by the rules of correctly encoding characters. So such a font may make the ?!-to-interrobang ligature a default ligature, as a feature.\n\nOne of the difficulties of setting unusual characters is how to find the damn things in a massive OpenType glyph palette. Even before, it was a hassle to find the inch mark in the Symbol font. So little things like making the interrobang a Discretionary Ligature, and the inch mark a Stylistic Alternate of “, should help typographers.\n\nJohn: _because it is really an exclamation about how big the goal is, not a question,_\n\nCan it be both? In many converstions, one person makes an exclamation, signifying their opinion, but also asking the other person’s. So one commentator says “How big is that goal?!” and the other replies, “It’s big, but they haven’t won the game yet.”\n\nPerhaps more to the point, is it really necessary to have two punctuation characters compressed into one? Maybe not, but there are plenty of precedents! (; : …)\n\n"
    },
    {
      "time": " 27.May.2007 11.52am",
      "content": "_Can it be both? In many converstions, one person makes an exclamation, signifying their opinion, but also asking the other person’s. So one commentator says “How big is that goal?!” and the other replies, “It’s big, but they haven’t won the game yet.”_\n\nIs the second replying to the question, or simply making a further observation? It seems to me that both commentators are simply saying, in different ways, that it is a ’big’ goal, one via a rhetorical question and the other with a plain statement (and appended caveat). The second commentator isn’t treating the first’s question as if it were anything other than rhetorical: he isn’t trying to express in some quantitative terms just how big the goal is. In any case, sports commentators, despite their banter, are not really engaged in conversation with each other: they’re talking at the invisible audience.\n\nNow let’s image a novelist writing a scene in which two sports commentators make these comments. Is there anything really conveyed by\n\n’How big is that goal?!’  \n’It’s big, but they haven’t won the game yet.’\n\nthat is not conveyed by\n\n’How big is that goal!’  \n’It’s big, but they haven’t won the game yet.’\n\nIn fact, I would argue that the latter punctuation, by making clear that the statement is an exclamation, conveys more of the excitement of the match than the addition of the question mark, which, as Tom noted above, may express bafflement.\n\n"
    },
    {
      "time": " 27.May.2007 5.36pm",
      "content": "When reading, aloud or to myself, I apply “voice” (inflection/tone/etc.) to other punctuation: extended preceding syllable and a quick dramatic pause to a comma, longer to a colon, a hurried whisper to parentheses, a meandering fade to ellipsis, and a pitch shift to a question. The exclamation is hardly exceptional for having a vocal insinuation.\n\nIn Spanish, the preceding inverted question mark was created to serve a pointedly grammatical function. A sentence may very often be declarative or interrogative with the exact same words. Here the marks are grammar marks because they define an otherwise unknown element of the sentence. (I suspect the inverted exclamation was folk use to appear consistent.)\n\nIn English, however, questions are almost always discernible without the ’?’. So, is the current function just a reminder that there was an “asking word” earlier on? A quaint leftover from another time? Why not just reserve it for ambiguous wordings? Likewise, if you comprehend the words, the exclamation mark’s only remaining value is it’s voice.\n\n—-\n\nDid anyone ever notice that they use more word problems in math books for public schools at the same time that they continue to reduce sentence diagramming and grammar lessons in general?\n\n—-\n\nOn a related note, I usually map the interrobang to point redundantly at the glyph: !? That solves the aesthetic problems for me, and I think my font fan base has never-ever-ever commented on the subject.\n\n"
    },
    {
      "time": " 27.May.2007 10.22pm",
      "content": "Choz, you explain how you impose an intonation in reading — in ways that I find rather mannered, but who am I to tell you how to read —, but associating particular or even idiosyncratuc vocal intonations with punctuation marks serving their usual grammatical functions in text — dividing clauses, making clear the organisation of thoughts — is different from using a punctuation mark in a non-grammatical way in order to signal a particular intonation.\n\n"
    },
    {
      "time": " 28.May.2007 8.02am",
      "content": "Isn’t the particular intonation just a symbol of the exclamation to express immediacy, relative to other expressions?\n\nDo you have more written elsewhere, or links to look at showing more of your hypothesis?\n\nOMG, listening to that radio show. “Punk’d, punk’d punctuation”. Thats the sort of line that gets co-opted by the other side.\n\n"
    },
    {
      "time": " 28.May.2007 1.05pm",
      "content": "Choz, If I understand what John is saying he is stressing the role of puncuation as an aide to meaning via grammer etc - as opposed to some kind of match of or notation for vocal inflection. Obviously the two are related but even so I think his emphasis is right. Trying to match the vocal range in letterforms and punctuation is a little bit of a fools erand once you begin dividing things too finely. One you start, where do you stop? I don’t want to see texts littered with !!?!! & !!? & ?!!! Moreover I just don’t think we get much from ’?!’ or ’!?’ except in rare circumstances. Of the two, I am more sympathetic to ’?!’ to denote a stongly felt interjection. Probably because I read it in comic books as a kid. And I would prefer not to see an interobang pretty much ever again. At least in English anyway. Maybe someone will change my mind... but you can count on me a skeptic for now.\n\n"
    },
    {
      "time": " 28.May.2007 3.02pm",
      "content": "Eben, thanks. Yes, punctuation is fundamentally a system for indicating the structure and organisation of written thoughts, most importantly by identifying the relationship of clauses. The marks used are conventional, i.e. the shape of the little mark that we call a comma is recognised by convention, but what they signify are structures of language, which are not conventional (or not wholly conventional). Over time, the use of punctuation varies, but this generally doesn’t mean that the linguistic structures are changing — we’re still using the same kind of clauses in the same kinds of relationships —, but only that we conventionally mark or do not mark particular structures, according to something like fashion or individual taste. Some punctuation is discretionary, e.g. when we can understand the text equally well with or without a comma in a particular place, and depends on the prose style of the author or editor; other punctuation is essential for avoiding ambiguity or enabling the reader to easily make sense of complex sentences. This is the primary role of punctuation.\n\nThere is a secondary role, which is as a guide to pause and intonation when reading aloud (in which category I include reading aloud in your head, which is sometimes necessary if one wants to avoid embarassment when reading poetry or plays on the bus). But this role is not only secondary to the grammatical function of punctuation, it is also entirely conventional and ultimately exterior to writing, i.e. it is an interpretative imposition on the text. Punctuation is useful as a guide to pause and intonation because both punctuation and intonation are ultimately concerned with expressing the thoughts contained in and organised through the text. But punctuation isn’t necessary to intonation, and if one were to mark up a text in order to indicate as fully as possible the desired intervals and intonation, one would very quickly exhaust and need to surpass the limited usefulness of common punctuation marks. Full notation of pause and intonation would resemble something like musical notation.\n\nChoz, you described above the kind of intonation you associate with different punctuation marks. I think it would be interesting to record you reading a passage aloud, and to analyse just how regular these associations are. My guess is that they are a lot less regular than you imagine, and that, for instance, what your voice does at a comma will vary considerably depending on how the comma is being used, i.e. the kind of clauses it is separating and their relationship to each other and to the overall structure of the sentence. We read the meaning of a text — giving emphasis through stress, pause and speed to articulate thought — not the punctuation as if it were a musical score.\n\n"
    },
    {
      "time": " 28.May.2007 3.40pm",
      "content": "What is the grammatical purpose served by an exclamation point that could not be served just as well by a period or comma?\n\n"
    },
    {
      "time": " 28.May.2007 8.45pm",
      "content": "An exclamation is a particular class of sentence, sentence fragment or interjection, usually associated with heightened emotive expression. Note that I have not distinguished the exclamation from a sentence, such as might be terminated by a period, only from a question. Grammatically, exclamations _could_ could be terminated by period, but we’ve developed a punctuation system that gives them their own sign, because we’ve found this ’adds value’ to our writing and avoids ambiguity. One of the principle values of the exclamation mark is that it allows us to distinguish between actual questions and similarly phrased exclamations, which are a feature of our rhetoric. This is why I find a pseudo punctuation mark that conflates interrogation with exclamation silly: it undermines the function of the independent signs.\n\nIf we consider, again, those examples above, it should be clear that we read\n\n’How big is that goal?’\n\ndifferently from\n\n’How big is that goal!’\n\neven though the words and the word order are identical.\n\nI don’t think we read\n\n’How big is that goal?!’,\n\n’How big is that goal!?’,\n\nor\n\n’How big is that goal‽’\n\nsignificantly different from\n\n’How big is that goal!’,\n\ni.e. as an exclamation.\n\nBut we may well read\n\n’How big is that goal?’\n\ndifferently, and that seems to me a good test of what kind of utterance we’re dealing with.\n\n’How big is that goal?’\n\nis a question.\n\n’How big is that goal?!’,\n\n’How big is that goal!?’,\n\n’How big is that goal‽’,\n\nand\n\n’How big is that goal!’\n\nare all exclamations, and therefore adequately punctuated with !\n\n’How big is that goal.’\n\nis ambiguous, since the structure is that of a question but the punctuation not clearly indicative, in our system, of an exclamation. Therefore, we may consider it incorrectly punctuated.\n\n"
    },
    {
      "time": " 28.May.2007 9.30pm",
      "content": "How ’bout those Ducks?!\n\n"
    },
    {
      "time": " 28.May.2007 10.10pm",
      "content": "John: _I don’t think we read  \n‘How big is that goal?!’,  \n‘How big is that goal!?’,  \nor  \n‘How big is that goal‽’  \nsignificantly different from  \n‘How big is that goal!’,_\n\nI think we do.  \nAnd the difference becomes apparent if the exchange is completed:\n\n“How big is that goal?!”  \n“It’s big, but they haven’t won the game yet.”\n\nThis is a rhetorical question being answered, which is what happens in conversation (though not when addressing a reader or an audience).  \nSo it makes more sense than:\n\n“How big is that goal!”  \n“It’s big, but they haven’t won the game yet.”\n\n—which is a non-question being answered.\n\nIf exclamation marks didn’t exist,\n\n“How big is that goal?”  \n“It’s big, but they haven’t won the game yet.”\n\n—would suffer a loss of meaning, because the partly rhetorical quality of the question is absent. So in transcripts of conversation, an exclamation mark can provide a purely grammatical function (not just to “express heightened emotion”), when used in conjunction with a question mark.\n\n"
    },
    {
      "time": " 28.May.2007 10.50pm",
      "content": "” How big is that goal‽ “\n\nAnd here is the problem. There _may_ be a theoretical benefit in the interrobang. However, I had to zoom the text size 3x to see what that blotch was, in a thread about it. Yes, it is late here. Nevertheless, that’s a weak graphic.\n\nI wish it worked, it is a neat idea. Something to reserve exclusively for display faces, at best?\n\n"
    },
    {
      "time": " 28.May.2007 11.43pm",
      "content": "After being offline for a few days, I’ve had a lot to catch up on, so I apologize in advance for not directing my post to the original posters or refering to them.  \nIt’s been interesting to read how people here seem to have different uses of punctuation. Personally, I can not have enough variation & room to play with it since I feel the purpose of punctuation is to highlight the “feel” of the sentence.  \nOn the other hand -as contradictory as this may sound- in my own texts (non prose), I only use , ; & : in de middle of sentences, but never any kind of punctuation to close the sentence. Someone wrote about the ? that in English (& other languages) it is pretty much redundant because the construction of the phrase already indicates the question. Still, I think punctuation -as redundant as it may be under certain curcumstances- still adds to a text, but maybe that’s because I’m a sensitive person & I can never have enough words to express myself & punctuation to emphasize them.  \nThe paradox in all this is that in the texts I write which are all very personal/emotional, I don’t use any punctuation at all (unless a , ; : to divide a sentence & only when it’s not redundant) & I can honoustly not say why... I conveniently call this “artistic freedom”, but maybe I’m just trying to get the reader to make its own assumptions & interpretations?\n\n"
    },
    {
      "time": " 29.May.2007 10.17pm",
      "content": "Nick: _would suffer a loss of meaning, because the partly rhetorical quality of the question is absent. So in transcripts of conversation, an exclamation mark can provide a purely grammatical function (not just to “express heightened emotion”), when used in conjunction with a question mark._\n\nNo, that is not a grammatical function, it is an extra-grammatical, rhetorical function. Rhetoric and grammar are different things. What you have demonstrated is what I wrote right at the beginning of this discussion: that ! when combined with ? is being used as an expressive mark, not as a punctuation mark. A rhetorical question is grammatically identical to any other question, and it is only in the conventions of rhetoric that we generally understand that it does not expect a reply.\n\nTom: _Personally, I can not have enough variation & room to play with it since I feel the purpose of punctuation is to highlight the “feel” of the sentence._\n\nBut punctuation marks will not give you the variation and ’room to play’ that you want, because they belong to a system whose purpose is indicate what a sentence _thinks_ not what it feels. As I wrote above, if you wanted to capture visually in text the nuances of articulation, you would need something akin to musical notation.\n\n"
    },
    {
      "time": " 29.May.2007 11.31pm",
      "content": "Punctuation surely has its limits (hence the remark that I can not have enough variation), but it is a tool that -when used creatively, not necessarely correctly- can actually be of help to give an extra zing to your words. I find it stimulating to try and get my feelings across in written language as much as in spoken language. I agree with you, there will never be enough punctuation marks for the entire spectrum of human emotions, but it’s a start. I consider limitation (along with laziness) the mother of creativity. Even in my work I deliberately limit myself, set “style bounderies” for each design I do, just to not get overwhelmed with choice and to keep consistancy in the end product. Choice is good, but if the balance of supply and demand shifts to an oversaturation in supply a blessing can easily become a curse (after all, the circle’s ends meet again at the two extremes). Once past the point of enough, it becomes too much. It’s the western modern day disease, but in case of punctuation marks I don’t think we have anything to worry about. So for now, I can not have enough variation. By the time the variation in punctuation marks becomes enough to cover the basic human emotions (which is still a long way from here & a road that will probably never be walked), the danger of oversaturation lurks around the corner. Luckily enough, human beings are complex enough -even in their basic emotions- to prevent that from ever happening ;-)\n\n"
    },
    {
      "time": " 30.May.2007 9.59pm",
      "content": "The notion that that punctuation is grammatical by nature and that the “scoring” of the text is a second, subservient affair is the part where I am suspicious. Nick posed a question I almost asked. The mass acceptance of the exclamation mark as a valid punctuation seems to fly in the face of the grammar-first approach, if it only exists to intone.\n\nRhetorical and grammatical are absolutely different things. But I am not convinced that punctuation lives in one world (or belongs rightly to it), but not the other.I suspect that both sides of the brain must be satisfied to make a mark of punctuation sustainable. Is there other media anyone knows of to expand on these ideas? If anyone is looking for a thesis proposal, have fun with this.\n\nI’ve had the unpleasant task of listening to recordings of my own voice, particularly in variations of the same work, when preparing for live performance. There is a consistency to my own treatment of punctuation as a notation. There may be some improvisation, and the overall tempo is arbitrary, but within one piece a colon has a distinct affect unlike a semicolon, for example. I would even say that these, along with text variants and layout are the score to the words. Would you read and “feel” a letter the same way with indented, inline and left block paragraphs? Context and commentary could provide all the needed cues to any exclamations or questions,but would it be the same?\n\n"
    },
    {
      "time": " 31.May.2007 2.17am",
      "content": "\\> Rhetorical and grammatical are absolutely different things.  \nI agree these are 2 (very) different things, but it’s always interesting when 2 worlds collide or blend. I think both (can) have an influence on each other, but as every linguistic issue, much of it lies in the hands of the user. I’ve never been much of a reader (comics aside), but I’ve always been fond of language & as it happens I recently got back in touch with my old high school English & Dutch teacher. We met last week & spent over 6 hours discussing both the Dutch & English language. It really struck me that even people with the appropriate academic background can still be baffled within their field of expertise. But isn’t that what makes our languages interesting? To find your own way to express yourself within the grammar & a whole bunch of extra unwritten rules? To bend and shape it within these bounderies to best fit your personality & to see how other people do this?  \nLike I said in another post, I do even “break” the rules every now & then when I find it more suitable for my expression. But the fact that there’s so much aspects to language makes that even this can be seen as merely bending the rules. A perfect example for this is my use of accents for emphasis; I’m breaking the rule of always having to use the accent aigu, but on the other hand I have the phonetic rules to back me up on this & give me a valid excuse to do so. Artistic freedom has now -more than ever- become a big part in the use of our language (what with the internet & cell phones and all) & it’s just pure fun to play with it.  \nAnother thing we (my ex teacher and I) talked about is that -probably due to the same factors that have inspired artistic freedom- the language of our own mother tongue has increasingly worsened in just a few years time (I graduated 10 years ago to give you a reference) & that it’s probably just a matter of time before it is attuned to the level of the next generation. For instance, one of the major issues with today’s students is that they make a lot of mistakes in the use of verbs in the past time. In Dutch we have “strong” (also called irregular) & “weak” verbs who -depending on what they are- may or may not change vowels in the past time (strong verbs change -hence the alternative term irregular- whereas weak verbs keep the vowel(s) from their infinitive). I foresee a dismissal of the disctinction between strong & weak verbs & a future with only weak verbs. Darwin’s survival of the fittest theory doens’t apply to languages. On the contrary, in time things that are now considered incorrect will actually become the standard norm. In the past 20 years our language (Dutch that is) has already undergone 2 changes of which the first one was quite drastic. This evolution will continue as long as people are still using the language. A language is by definition a tool for expression & therefor bendable to fit the moment. I haven’t seen any changes of punctuation however, but I can imagine that this is also just a matter of time assuming people will “play” with it enough. Or maybe a “wrong” use of punctuation will always be considered a form of artistic freedom? Time will tell...\n\n"
    },
    {
      "time": " 31.May.2007 7.31am",
      "content": "“Darwin’s survival of the fittest theory doens’t apply to languages. On the contrary, in time things that are now considered incorrect will actually become the standard norm.”\n\nThat sounds exactly like natural selection to me. The environment of culture, ideas and communication needs changes. Language and writing are constantly mutating. The most useful innovations will survive, while others will make us go, “what on earth was I thinking?”\n\n"
    },
    {
      "time": " 31.May.2007 7.55am",
      "content": "What I meant by that is that language indeed constantly changes, but not always for the better... In Dutch at least I can foresee the language “dumbening” just in order to fit the next generations disability to use it correctly now. That way, less people will make mistakes, but if you’ll look at the (d)evolution, you’ll notice that the language will actually have to “stoop down” to the overall lower level of future generations. The language has to give up a lot of its rules and therefor becomes less “rich”. In my view, it’s proof that the weaker one wins the battle.\n\n"
    },
    {
      "time": " 31.May.2007 8.29am",
      "content": "It is commonly assumed that evolution progresses towards a goal. or that it has a positive future outcome and stumbles irregularly towards that. While Devo and Idiocracy were interesting entertainment, nature is much less interested in our higher selves that we are, and has no grand philosophical design for us to aspire to. So, as long as it works, things will continue to trend towards “dumbing down”.\n\nSome of each generation will continue to fight to be interesting, quirky or special, with lessening degrees of success, but until humanity’s environments trend towards isolated cultures again (if ever) life will be generally more homogeneous every day.\n\nMy apologies to those who are bothered by how far off-topic this is. :)\n\n"
    }
  ]
}
