{
  "id": "34029",
  "title": "Zhe on drugs?",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "A first application of the \"Papazian\" Zhe, conceived  \n(structurally) on an Aeroflot flight in late 2004.\n\n ![](http://web.archive.org/web/20150414042626im_/http:/typophile.com/files/PapaZhe_4283.gif)\n\nFire at will - brutal honesty preferred.\n\nhhp\n\n",
  "author": "hrant",
  "time": "25 May 2007 — 8:52am",
  "uid": "1250",
  "comments": [
    {
      "time": "25 May 2007 — 8:57am",
      "content": "how many cocktails did you have before you drew that? :^P\n\n"
    },
    {
      "time": "25 May 2007 — 9:08am",
      "content": "Wouldn’t mind seeing the rest of the glyphs to put the odd asymmetry in context. You’d know better than I would… does it need to symmetrical?\n\n"
    },
    {
      "time": "25 May 2007 — 9:28am",
      "content": "I assume you mean lateral symmetry, since as you might know Cyrillic tends to have a mix of straights and curls (which I adore) although in Industria-like fonts such as this things tend to be tamed. But if so, what other characters can I really compare to in this way?\n\nPaul, in fact this is designed to help readers with drinking problems,  \nwho I suspect outnumber dyslexics among Cyrillic-using populations. ;-P\n\nhhp\n\n"
    },
    {
      "time": "25 May 2007 — 9:44am",
      "content": "i think it's perfectly recognizable as a Zhe, but i probably wouldn't use this form unless it's a display face, otherwise i think it might make the reader stop because the form is so unexpected. of course, this is just guessing...\n\n"
    },
    {
      "time": "25 May 2007 — 12:05pm",
      "content": "\\> _Fire at will - brutal honesty preferred._\n\nFirst thought that came to mind: Walk like an Egyptian !\n\n"
    },
    {
      "time": "25 May 2007 — 3:00pm",
      "content": "Ah, Egyptified Cyrillic! :-)\n\nPaul, I think the potential \"stopping effect\" here is exactly the sort of thing in type that you can't know until you try it out. Sometimes you can tell with enough certainty before you even try something out, but my lack of \"culturally progressive\" experience in Cyrillic precludes that here; until now I'd only made \"safe\" Cyrillic glyphs.\n\nSo, you'll never know if you don't push. The trick I guess is to glean what kind of design (for what kind of customer) is a good opportunity to push, and when it's better to humbly follow precedent. In that this is clearly not a face for long text anyway, my chances seem decent; on the other hand it's a commissioned design, not a speculative retail one, so there's more risk than I might like.\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2012 — 1:16pm",
      "content": "{Edited reference link.}\n\nBTW, the original sketch can be seen here:  \n [http://typophile.com/node/30024#comment-173469](http://web.archive.org/web/20150414042626/http:/typophile.com/node/30024#comment-173469 \"http://typophile.com/node/30024#comment-173469\")\n\nhhp\n\n"
    },
    {
      "time": "26 May 2007 — 1:02am",
      "content": "Lovely hybrid.\n\n"
    },
    {
      "time": "28 May 2007 — 11:08am",
      "content": "Doesn't Tom Grace's Zhe from his U. of Reading MA typeface (2003) have a flipped-symmetric form?\n\n"
    },
    {
      "time": "28 May 2007 — 4:15pm",
      "content": "Needless to say I'd love to see it.\n\nhhp\n\n"
    },
    {
      "time": "29 May 2007 — 12:19am",
      "content": "Just a click away…  \n [http://www.personal.rdg.ac.uk/~lts98gl/](http://web.archive.org/web/20150414042626/http:/www.personal.rdg.ac.uk/~lts98gl/ \"http://www.personal.rdg.ac.uk/~lts98gl/\")\n\nTom Grace '03  \nTypeface: Strella (with distinction, it seems)\n\n(click on the typeface name for the PDF)  \nYou can see the Zhe rather big on page three of the PDF\n\n"
    },
    {
      "time": "29 May 2007 — 1:00am",
      "content": "The flipped-symmetric treatment seems to be present on the lowercase only.\n\n ![](http://web.archive.org/web/20150414042626im_/http:/typophile.com/files/Zhe_Strela_5072.png)\n  \n(Screenshot from page 5) \n"
    },
    {
      "time": "29 May 2007 — 6:22am",
      "content": "Niiice. This is quite encouraging, including the fact that the structures are different between the lc and UC, which I'm doing myself\\*. The fact that Grace has left the UC Zhe symmetrical also makes sense, since the UC set is monumental while the lc is more organic (and secondarily that the UC doesn't need to be as readable). You can see this in the Ya as well (and probably elsewhere - I'll be perusing the PDF for sure). And there's some other funkiness as well, like all the serif action - wow, brave student, that one.\n\n\\* Mostly by having more rounded corners in the lc, and almost none in the UC.\n\nOne place I've been a little bit more pushy (quite likely too pushy) is that the Ka and the Zhe are <cite>vertically</cite> flipped: the curly arm on the Ka is the top one. Problem?\n\nhhp\n\n"
    },
    {
      "time": "29 May 2007 — 12:19pm",
      "content": "<cite>the curly arm on the Ka is the top one. Problem?</cite>\n\nThere's a display sans that I see everywhere here in Moscow that does just that, so it shouldn't be a problem.\n\n"
    },
    {
      "time": "29 May 2007 — 12:32pm",
      "content": "But does it also have the curl on the <cite>Zhe</cite> at the <cite>bottom</cite>?\\*  \nIt's that alternation (in mine) that I worry about.\n\n\\* In case it matters: specifically, on its right side.\n\nhhp\n\n"
    },
    {
      "time": "30 May 2007 — 12:03am",
      "content": "No, it doesn't also have that. It is symmetrical in the examples I've seen. Your Zhe strikes me as a reasonable display Zhe, but not for text, where it is a bit too unusual.\n\nAs for pondering Zhe, this is the view out my window:\n\n ![](http://web.archive.org/web/20150414042626im_/http:/typophile.com/files/Zhe_4674.jpg)\n\n"
    },
    {
      "time": "30 May 2007 — 8:48am",
      "content": "Thanks for the feedback!\n\nhhp\n\n"
    },
    {
      "time": "30 May 2007 — 10:52am",
      "content": "Here's the whole main alphabet:\n\n ![](http://web.archive.org/web/20150414042626im_/http:/typophile.com/files/MyCyr_4928.gif)\n\nFire at will.\n\nhhp\n\n"
    },
    {
      "time": "30 May 2007 — 11:27am",
      "content": "интереснно, overall it seems pretty good. a couple things that are concerning. Your shape for У makes it hard to be read, i think it would be too easy to confuse with Џ. i don't understand why the leg on the д continues from the main stroke when this is not the case with Д, ц or щ. i'm wondering what your reasoning was behind this decision. i'd like to see the Д/д, Л/л all share the same structure, in particular i like the shaping of Д/д better, but that's just me. i'm sure you chose disparate forms for readability sake, but i think it would make the face more cohesive if they matched. The bar on the Ф can actually extend below the baseline and above the cap height a bit: I think it would look better with a bit bigger body. I'm wondering why you made the Г/г so narrow. Also, i would think the flag on the Ъ/ъ could be more pronounced as this is a distinguishing feature and would aid deciphering this letter in text. lastly, i wonder why the crossbar on the Ю/ю is so high, it looks funny to me.\n\n"
    },
    {
      "time": "30 May 2007 — 11:39am",
      "content": "Thanks Paul!\n\n\\> i think it would be too easy to confuse with Џ\n\nEven though there's a difference of vertical scale? Should I make  \nthe top of it diagonal, even though it's a \"U\" shape in the Latin \"Y\"?\n\n\\> i don’t understand why the leg on the д continues\n\nTo differentiate it from the UC. I actually started with the left spur also  \ncoming straight out of the top part, but it was way too much like an \"A\".\n\nBut the same trick doesn't seem to work in the other spurred characters,  \nmaybe because their structures are too plain? Maybe I should give those  \nones another chance at straight-down spurs.\n\nBasically it's the old Papazian \"sacrifice consistency for the sake of differentiation\"  \nroutine. :-) This font is for use on-screen (although anti-aliased) so I think it needs all the help it can get.\n\n\\> The bar on the Ф can actually extend below  \n\\> the baseline and above the cap height a bit\n\nDo you mean optically or obviously?\n\n\\> I’m wondering why you made the Г/г so narrow.\n\nIt's based on the Latin \"L\".  \nNormally I wouldn't think in those terms but when I suggested to the client that the Cyrillic should be wider overall than the Latin (I mean for so-called \"cognate\" forms as well) they were unwilling. And to be fair the narrowness of the overall design is a big part of its usefulness to them, so...\n\n\\> i wonder why the crossbar on the Ю/ю is so high\n\nMaybe it is too high. But it does match certain  \nthings, including the way Verdana seems to do it.\n\nhhp\n\n"
    },
    {
      "time": "30 May 2007 — 11:49am",
      "content": "_Do you mean optically or obviously?_\n\neither way is legit (i think).\n\n_i think it would be too easy to confuse with Џ  \nEven though there’s a descender difference?_\n\nWell maybe native readers wouldn't make this mistake, but i for one would have a hard(ish) time recognizing it as an У if it weren't lined out in alphabetical order.\n\none thing i just noticed, the descenders on Д, Ц, Щ, д, ц, щ could be more pronounced (descend further) and they may not need to stick out so far (to the right). can we see some words or a bit of text in this?\n\n"
    },
    {
      "time": "30 May 2007 — 11:59am",
      "content": "\\> the descenders on Д, Ц, Щ, д, ц, щ could be more pronounced  \n\\> (descend further) and they may not need to stick out so far\n\nYes they could. Right now they're just brutally (but characteristically?) modular.\n\nFrom: [http://en.wikipedia.org/wiki/Pangram#Other\\_languages](http://web.archive.org/web/20150414042626/http:/en.wikipedia.org/wiki/Pangram#Other_languages \"http://en.wikipedia.org/wiki/Pangram#Other\\_languages\") \\_  \n(Thanks to John H for that ref.)\n\n ![](http://web.archive.org/web/20150414042626im_/http:/typophile.com/files/MyCyr2_4282.gif)\n\nBTW, what do you think about the extenders of the ф (lc)?\n\nhhp\n\n"
    },
    {
      "time": "30 May 2007 — 12:21pm",
      "content": "_what do you think about the extenders of the ф (lc)?_\n\ni think they're fine.\n\ni think the descenders on Д, Ц, Щ, д, ц, щ could definitely be inward or add more space to the right side of these characters, or a bit of both: the descenders are almost crashing into neighboring letters.\n\none more tip: the bowl of the б doesn't have to necessarily rise to the x-height, it might look better a bit smaller.\n\n"
    },
    {
      "time": "30 May 2007 — 12:27pm",
      "content": "OK, thanks again!\n\nAnybody else have opinions?\n\nhhp\n\n"
    },
    {
      "time": "30 May 2007 — 4:57pm",
      "content": "The width of characters seems somehow not 100% ok to me. Maybe л and ч too wide? х too narrow? Zhe is very nice. Almost a logo.  \nJust my 2 cents.\n\n"
    },
    {
      "time": "30 May 2007 — 5:40pm",
      "content": "In fact I'm not happy with the widths - they were rushed.  \nAny (further) specific complaints would be appreciated.\n\nBTW Paul, it turns out the bar height on the ю (lc) was a plain vanilla mistake.\n\nhhp\n\n"
    },
    {
      "time": "30 May 2007 — 5:49pm",
      "content": "i know you don't want to hear from me, but the kratka (breve-like symbol) is a bit weak.\n\n"
    },
    {
      "time": "30 May 2007 — 6:12pm",
      "content": "Why would I not want to hear from you?! The kratka/breve is from the base font, but maybe I should've made my own. Do you mean weak as in too small/light, or its shape?\n\nhhp\n\n"
    },
    {
      "time": "30 May 2007 — 6:34pm",
      "content": "_Do you mean weak as in too small/light, or its shape?_\n\nyes and yes. i'd like to see something more squarish to match the letters.\n\n"
    },
    {
      "time": "31 May 2007 — 1:37am",
      "content": "I wrote up a bunch of stuff yesterday, but my internet died just as I went to post it. When I got connected again several hours later, I was just too tired to re-write it. (I've not yet had a day in Russia where my connection didn't go down for several hours during the day.)\n\nFortunately, Paul addressed most of my concerns. I, too, don't care for the U or the d. Aside from the bar position on the l.c. yu, I find it a bit too wide (esp. the bar part).\n\nI also agree with Paul about the form of D/d and L/l matching a bit more. In fact, if you make your L more like the D, the face closely resembles the lettering used in the metro for \"Don't lean\" on the doors of the subway cars. (Which is something I get to stare at quite a bit.)\n\n"
    },
    {
      "time": "31 May 2007 — 6:02am",
      "content": "Sorry to hear about your lost feedback. :-(\n\nBefore I get into the mini-resurection of your feedback, let me check:\n\nU = У  \nD/d = Д/д  \nyu = ю  \nL/l = Л/л\n\nCorrect?\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 7:14am",
      "content": "Indeed.\n\n"
    },
    {
      "time": "31 May 2007 — 7:31am",
      "content": "My main question I guess is: what kind of У would you (plural) prefer?  \nRemember, in case it matters, that the Latin \"Y\" has the U top.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 8:51am",
      "content": "I don't think it matters, because Y and У are usually different. My return question is: what does your Latin l.c. y look like?\n\n"
    },
    {
      "time": "31 May 2007 — 9:06am",
      "content": "Not mine, but it's the same as the Cyrillic u.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 10:39am",
      "content": "The same as the Cyrillic l.c. u? In other words, there is a stroke the whole way down the right side? Ultimately, that's what I think the У's gotta have.\n\n"
    },
    {
      "time": "31 May 2007 — 10:53am",
      "content": "But wouldn't that make the UC and lc forms too  \nconfusable, especially with that huge x-height?\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 11:33am",
      "content": "The problem with Cyrillic is that there are quite a few cases where the UC and lc have the same form. In the case here, if you move your tail over (typographically speaking :-), there is still a difference in the treatment of the tail: curled back up for lc and curved leftward for UC.\n\nAlthough I see where you are coming from, I just think your current idea is too novel, and will therefore seriously impede reading.\n\n"
    },
    {
      "time": "31 May 2007 — 2:30pm",
      "content": "Hrant, you might like [this form for У](http://web.archive.org/web/20150414042626/http:/farm1.static.flickr.com/48/183911274_bfcbadcc6d.jpg?v=0), particularly if you can make it harmonize with that wacky Zhe of yours.\n\n"
    },
    {
      "time": "31 May 2007 — 4:24pm",
      "content": "Reminds me of Fleischmann's \"y\"!\n\nhhp\n\n"
    },
    {
      "time": "1 Jun 2007 — 12:52pm",
      "content": "Good news, Hrant. One of the lights on the Zhe from my picture burned out, rendering the form asymmetric.\n\n"
    },
    {
      "time": "1 Jun 2007 — 4:29pm",
      "content": ":-\\>\n\nhhp\n\n"
    },
    {
      "time": "7 Jun 2007 — 9:24am",
      "content": "The reason I asked about the ф (lc) is that I've noticed a  \nnumber of fonts\\* where its ascender is short. What to think?\n\n\\* Most recently: [http://typophile.com/files/pejkova\\_normal.jpg](http://web.archive.org/web/20150414042626/http:/typophile.com/files/pejkova_normal.jpg \"http://typophile.com/files/pejkova\\_normal.jpg\")\n\nhhp\n\n"
    },
    {
      "time": "8 Jun 2007 — 1:11am",
      "content": "In Russian, the short ascender was more common in the 18th century. I rarely see it today.\n\nI was thinking about your zhe a bit more. I have been very dilligently looking around town, and one absolutely never sees the asymmetry you have, with one exception: quick hand lettering. The pen strikes again...\n\n"
    },
    {
      "time": "8 Jun 2007 — 10:01am",
      "content": "Hey, I'll take an excuse from anywhere! :-)\n\nAnd thanks for keeping your eyes so open.\n\nhhp\n\n"
    },
    {
      "time": "7 Jul 2007 — 12:09am",
      "content": "I saw a non-symetrical zhe on a billboard yesterday: [http://www.seneg.ru/](http://web.archive.org/web/20150414042626/http:/www.seneg.ru/ \"http://www.seneg.ru/\").\n\n:-)\n\n"
    },
    {
      "time": "7 Jul 2007 — 7:14am",
      "content": "Funny!\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2009 — 9:59pm",
      "content": "From Yerevan:\n\n ![](http://web.archive.org/web/20150414042626im_/http:/typophile.com/files/Zhemtchoug_6643.jpg)\n  \nAny ideas whatduheltheywerethinking?\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2009 — 10:11pm",
      "content": "Maybe it's supposed to be a pearl in the middle of some seaweed?\n\n- Lex\n\n"
    },
    {
      "time": "20 Feb 2010 — 1:48pm",
      "content": "[http://www.mimifroufrou.com/scentedsalamander/images/kim-kardashian-perf...](http://web.archive.org/web/20150414042626/http:/www.mimifroufrou.com/scentedsalamander/images/kim-kardashian-perfume-2.jpg \"http://www.mimifroufrou.com/scentedsalamander/images/kim-kardashian-perfume-2.jpg\")\n\nFunny, she doesn't _look_ like a woolly mammoth.\n\nhhp\n\n"
    }
  ]
}
