{
  "id": "34046",
  "title": "Your opinions on Century",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello  \nWhich version of Century is best, in your opinion? Is there a good version with small caps?  \nI'm also wondering if people think it looks dated. I really like it and actually think it looks contemporary in some ways, but I've had other people tell me it looks old-fashioned to them.  \nThanks for any thoughts you have...\n\n",
  "author": "BrooklynRob",
  "time": "26 May 2007 — 8:50am",
  "uid": "9177",
  "comments": [
    {
      "time": "26 May 2007 — 9:03am",
      "content": "No, it is pretty old-fashioned. Which can be useful however, depending.\n\nYou should be able to find another font that carries whatever  \nyou feel is contemporary about it, without the moldy baggage.\n\nhhp\n\n"
    },
    {
      "time": "26 May 2007 — 2:51pm",
      "content": "Rob,\n\nIf it makes you feel any better, I have an ongoing debate with a couple of my typoholic buddies about this very subject. I agree that Century feels somewhat contemporary, and I just don't see the \"moldy baggage\" that my friends and Hrant continue to point out. So I guess the point of this being, we may be wrong, but at least we're not alone :)\n\nHrant, could you suggest a font that Rob and I might find an acceptable replacement for Century? Thanks!\n\n"
    },
    {
      "time": "26 May 2007 — 3:05pm",
      "content": "\\> Hrant, could you suggest a font that Rob and I might find an  \n\\> acceptable replacement for Century? Thanks!\n\nYeah, that would be great.\n\nI like Century, especially the Expanded (why ever it’s called so).  \nIt certainly gives anything you do with it that retro look.  \nAn update of Century and even more of Clarendon would be great, even greater when done by H&FJ maybe.\n\n"
    },
    {
      "time": "26 May 2007 — 5:27pm",
      "content": "Well, Stephen & Co. are better at this sort of thing. But maybe if you figured out  \nwhat in Century looks contemporary to you I could help find something better.\n\nhhp\n\n"
    },
    {
      "time": "26 May 2007 — 5:53pm",
      "content": "Personally, I've always liked Century Schoolbook. The original Century was drawn by Linn Boyd Benton. To me it isn't as good at the later Century Expanded and Schoolbook drawn by his son Morris Fuller Benton.\n\n"
    },
    {
      "time": "26 May 2007 — 6:08pm",
      "content": "I like Century Schoolbook too.  \nBut tellingly I happen to know that I'm old-fashioned. :-)\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 4:32am",
      "content": "I'm also a taker for Century Schoolbook. And i don't think it looks dated, I'm convinced that no typeface does look dated per se, it all depends how a typeface is used and in what (formal) context. ( I do admit that there are typefaces that are more likely to look dated/old-fashioned than others, but there's no absolute IMO)  \nIn other words, I wouldn't be put off from using a face because somebody says it looked dated to them, i'd rather understand this as a challenge to use it in a way that doesn't make it appear old-fashioned\\*. If somebody said the way i use it or my design looked dated, THAT would make me think tho.\n\n\\* Unless an old-fashioned look is required, but that's a completely different story.\n\n"
    },
    {
      "time": "27 May 2007 — 5:58am",
      "content": "Century was of course commissioned for <cite>Century</cite> magazine. I don't know, but imagine it was a multi-column format, to explain how condensed the original \"Century\" font was. It was just too condensed for single-column texts such as books, so an expanded version was made quite a bit later (\"expanded\" only in comparison to the original). This was the \"Century\" font most often selected for book work. I don't know about the linecaster days, but it did have small caps in the Linotron 202 format. I think it didn't have old-style figures, but I don't really remember.\n\nBut the best \"Century\" for bookwork was Primer, which did have small caps and old-style figures. P.J. Conkwright selected it for Princeton's Thoreau books. Bitstream has a sort-of revival (Century 751?), but as I remember, it was a typical Type 1 font with no small caps, os figs, etc., and not particularly well done. I tried to make a version of Primer, and while it was OK, it just didn't have the magic of Ruzicka's Primer in metal. But I'm a comp first & text interior designer second. If any true font designer were to make a good Primer, I think it would be welcome.\n\nAs to being dated -- Depends. If you're trying to impress other designers or marketing managers, probably so. I was at a meeting last week, where it came out that for some presses, the marketing manager had final say on book jacket designs. Turns out that for a number of them, a \"good jacket\" is one which will sell when placed in an airport terminal. That few university press books are sold in airport terminals seems to have escaped them.\n\nIf you're trying to help an author connect with a reader, of course Century isn't dated. On the other hand, Century Expanded was one of those fonts that didn't survive the move from the Linotron 202 to PostScript -- like so many others.\n\nWith the Linotron 202 fonts, Century Schoolbook worked for text with about a 9-point setting. It is aother of those fonts that worked well in one or two sizes & IMSLTH opinion, not others.\n\n"
    },
    {
      "time": "27 May 2007 — 6:15am",
      "content": "Century Schoolbook is an extremely wide font, so I can see that it might not be suitable for books except at very small size.\n\nHowever, when an extremely readable, wide type is suitable, it can work admirably. For example, the Government Accounting Office here puts out reports on letter sized paper (8 1/2 x 11), which is always a problem. Their solution is to use Century Schoolbook with wide margins. This to me is a pretty good solution, and results in extremely readable reports.\n\nThe layout is a bit old-fashioned 'modernist', but still it delivers the goods admirably well. [Here is one example](http://web.archive.org/web/20150302111354/http:/www.cherrycommission.org/docs/Resources/Completion/GAO%20Completion%20report.pdf).\n\n"
    },
    {
      "time": "27 May 2007 — 6:34am",
      "content": "Bill,\n\nAs to Century Schoolbook & book composition: it may be the width of the letterforms, but I think it is a bit more, particularly their weight. I've specified Schoolbook once or twice, and set a few more books where it was specified by other designers, but it has been quite a while. When you specify a type size, some designers at least are looking at \"the color of the page,\" which includes a number of relationships, character fit, word spacing, line spacing, margins, and of course the type itself. For some reason, Schoolbook seems to \"snap\" with a nominal 6x9 trim & 24-26 pica measure in around a 9-point setting.\n\nOf course, that's old school (i.e., dated). Nowadays, any font is OK if you specify it 10/15, unless you can sneak 9/15 by the people who have to sign off on the design.\n\n"
    },
    {
      "time": "27 May 2007 — 7:17am",
      "content": "\\>color of the page\n\nI also feel that this is a critical factor--which is why I think optical sizing is so important if the design is to work at different sizes.\n\nBecause Century Schoolbook is so unusual in its width and, as you point out, weight, it may only work well in very special situations. But it may work very well then.\n\nPersonally, this style of design, which I think of as a variety of 'Scotch', is not one I am that fond of aesthetically. I should have written above that I \"admire\" Century Schoolbook rather than really like it. It is admirably well executed. The only scotch I really like in print is Caledonia, but maybe it crucially departs--I haven't studied it enough to know.\n\nOn the issue of leading, I was very interested to read in Mitchell & Wightman's 'Book Typography' that blacker type usually requires more leading to work. Thus Quadraat calls for a lot of leading.\n\nI do prefer the older style in which there is less leading and somewhat longer ascenders and descenders. To me the type looks more graceful, and it knits the page together better. But working well with tighter leading depends on the design of the type.\n\n"
    },
    {
      "time": "27 May 2007 — 7:34am",
      "content": "\\> blacker type usually requires more leading to work.\n\nThis doesn't sound right.  \nThink of how darker fonts need tighter (lateral) spacing.\n\n\\> I do prefer the older style in which there is less  \n\\> leading and somewhat longer ascenders and descenders.\n\nDepends on size.\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 8:01am",
      "content": "\\>darker fonts need tighter (lateral) spacing\n\nI don't think there is a generally valid rule. My feeling is that it depends on the design and intended size.\n\n\\>Depends on size.\n\nMitchell and Wightman were discussing normal book text sizes.\n\n"
    },
    {
      "time": "27 May 2007 — 8:08am",
      "content": "This thread is taking an odd twist. Anybody have more thoughts on Primer (aka Century improved)?\n\n"
    },
    {
      "time": "27 May 2007 — 8:11am",
      "content": "\\> it depends on the design and intended size.\n\nNo, all else being equal, darker weights need  \nless inter-letter spacing. This is very old news.  \nAnd the reason is the most basic: balanced notan.\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 8:17am",
      "content": "\\>odd twist\n\nHere the Talmudic style is followed: the side issues often are more important than the topic. I like it, but then I also like the Talmud :)\n\nI haven't seen Primer used, so I don't know. The MyFonts text on it is interesting, saying that Chauncy Griffith commissioned it to correct fitting problems. As they also say, Primer loses that iconic form of Century Schoolbook.\n\nOf course my feeling about it being 'iconic' may well because I learned to read with the 'Dick and Jane' primers, which I believe were in Century Schoolbook.\n\n"
    },
    {
      "time": "27 May 2007 — 8:28am",
      "content": "<cite>No, all else being equal</cite>\n\nOK, back to the odd twist.\n\nYes, it depends. I've seen some beautiful 19th century French books, where wide word spacing was used -- it was in fashion then. To compensate, the leading was increased, as were the margins. The character fit was not tight, but hardly loose. At first it looks odd to a modern eye, but the overall balance soon takes over & you don't notice it.\n\nGood balance is more than one parameter, and will to a large extent survive a change in fashion.\n\n"
    },
    {
      "time": "27 May 2007 — 8:38am",
      "content": "Let me try to explain better: If you have a text face in a light weight and in a dark weight, the dark weight needs to be spaced tighter than the light weight, otherwise it's no longer a text face. This is basic type design stuff.\\* If we are in fact discussing \"normal book text sizes\", then if you stray from a quite tight relationship between internal versus external white, you are killing readability. No matter what kind of boots you prefer. Issues of functionality do not make those of \"fashion\" moot - in fact the two do need to be balanced, always. But let's not pretend that It Doesn't Matter.\n\n\\* William: ask Berlow.\n\nThe way this relates to what William wrote about linespacing is that the  \nsame type of thing (although certainly to a lesser degree) probably applies.  \nAnd it makes sense: a darker line holds itself better, so you need less leading.  \nWhat happens to look better to whom in what century is beside the point.\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 8:44am",
      "content": "<cite>this is basic type design stuff.</cite>\n\nAh, Betty Crocker. OK, I'll travel\n\n"
    },
    {
      "time": "27 May 2007 — 8:46am",
      "content": "Don't forget a laptop with FontLab on it. :-)\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 8:47am",
      "content": "\\>more than one parameter\n\nThat strikes me as the complex heart of the matter.\n\nThe problem with saying 'other things being equal' is that they \\*can't\\* be equal when you make a design bolder. You will affect either the width of counters or the character as a whole, or both, and you have a choice on how to do this. And those choices will affect best spacing.\n\nGood balance of white and black, or 'notan,' and in particular good letter spacing also depends on optical size.\n\n"
    },
    {
      "time": "27 May 2007 — 9:04am",
      "content": "My previous post was cross-posted with Hrant's and Charles's.\n\n\\>I'll travel.\n\nPlease stick around. I love to hear your views, as they are based on experience and accomplishment, which I really respect. --Not that I will always agree :)\n\nHrant, as a general rule in contemporary type design a bolder version of a design is tighter. But then also the bold is not usually intended for continuous text, but for titles and emphasis. But the way it's generally done now is not necessarily the only way.\n\n\\>a darker line holds itself better, so you need less leading\n\nMitchel and Wightman say the opposite: that with tight leading the color of the paragraph with dark lines will be too dark, and hurt readability. Charles here also notes the great importance of good color, which I think is correct.\n\nTighter word spacing does tend to reduce the need for leading, but that is a different (though interacting) variable.\n\n"
    },
    {
      "time": "27 May 2007 — 9:25am",
      "content": "\\> as a general rule in contemporary type design  \n\\> a bolder version of a design is tighter.\n\nMy contention is that it has to do with more than just fashion, but how we read. And we're not really talking about using a Bold for text, but the general case of how spacing (and leading) relate to weight. Think for example of using a Demi of a font for somewhat small text; it should be easy to read, and it can't be if it's not tighter than the Regular (assuming the Regular is spaced properly of course). I don't know why you're resisting this classic axiom.\n\n\\> Mitchel and Wightman say the opposite\n\nWell, yes, you just said that, and that's what I was complaining about.\n\n\\> the paragraph with dark lines will be too dark, and hurt readability.\n\nI'm not seeing how a dark parapraph of itself can hurt readability. I think you're essentially talking about aesthetics. And the way I see it, a parapgraph set in dark lines with large leading turns into a Modernist's inadvisable wet dream.\n\n\\> Charles here also notes the great importance of good color\n\nI'm not seeing how that's related.  \nAnd let's not start about \"good color\" again, eh?\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 9:34am",
      "content": "William, could you point out some text faces where  \na darker weight is looser than a lighter weight?\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 9:57am",
      "content": "\\>let’s not start about “good color” again, eh?\n\nCharles mentioned this key factor again, and in my opinion he's right, and on this particular point you're profoundly mistaken. You regularly poo-poo the importance of good color in type. But design, spacing and setting of type is not all about 'notan'. It is both notan \\*and\\* color, at least as far as I understand these terms. And yes, color affects readability. Try \\*looking\\* at Mitchell and Wightman's examples.\n\nAs to text faces where a darker weight is looser, I believe that in the very small sizes, optical adjustment of metal type sometimes involved slightly increasing all three: width, stroke weight and letter spacing. That's not just the one isolated factor of weight, but as I said before it is anyway impossible to make 'everything equal' because the factors are interdependent.\n\n"
    },
    {
      "time": "27 May 2007 — 10:47am",
      "content": "\\> You regularly poo-poo the importance of good color in type.\n\nFalse.  \nI do however jauntily poo-poo on your terminology and your grasp of reading.\n\n\\> in the very small sizes, optical adjustment\n\nYou are skirting the issue.  \nBecause you're having trouble admitting a mistake.  \nPoo-poo on that.\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 10:58am",
      "content": "\\>You are skirting the issue.\n\nHrant, I said in my first post (11:01 am) on this that spacing depends on size as well as darkness. That's what you took issue with. And I said immediately that 'everything equal' can't apply because of interaction between factors.\n\nInstead of addressing the point you issue insults.\n\nCharming.\n\n"
    },
    {
      "time": "27 May 2007 — 11:59am",
      "content": "\\> That’s what you took issue with.\n\nNo, I totally agree with you on those (as I have  \nsaid myself often). What I've taken issue with were:  \n1) Mitchel and Wightman's claim.  \n2) Your \"I don’t think there is a generally valid rule\"  \nto my \"darker fonts need tighter (lateral) spacing\".\n\n\\> ‘everything equal’ can’t apply because of interaction between factors.\n\nIt can apply just fine, in the realm of thought.  \nThought being one of two foundations for practical decisions.\n\n\\> you issue insults.\n\nYou know, I insult you often enough that  \nyou really don't need to invent instances.  \nI poo-poo on victim syndrome.\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 2:45pm",
      "content": "\\>It can apply just fine in the realm of thought\n\nNo, it doesn't even work in the realm of thought, or theory. As I said, \\*geometry\\* dictates that a bolded glyph is either wider on the outside or narrower in the inside, or both. And depending on what you do with the width of the glyph, it will affect what spacing will look best. --As will changing the optical size. So to talk about best spacing you have to also talk about width of counters and optical size, not just boldness. It may be typical nowadays to 'go East or go West' [as Nick Shinn put it] in bolding a glyph, but there are other options.\n\nAnd, as Charles pointed out overall style can also affect spacing. Many of the traditional 'modern' (Bodoni style) serifs style were quite bold, but as he points out, their wide, high contrast shapes didn't take kindly to very tight spacing in text.\n\nSo your rule is just too simplistic. While often true, it has important exceptions and so is misleading and wrongly restrictive.\n\nThe Mitchell and Wightman issue is different. Quite clearly \\*here\\* you are (without looking) denying their view, which is explicitly based on color considerations. And in many discussions you have also denied the traditional view--which I follow--that evenness of color is one primary goal in good text type design.\n\n"
    },
    {
      "time": "27 May 2007 — 3:28pm",
      "content": "You're just flailing. And what's really funny is that you're hinding behind \"even color\" now, even though what I'm explaining actually helps that too! What you're advocating ensures even color all right - between the two weights! :-/\n\nThis really isn't very complicated. Darker weights, when done properly (as in your own \"normal book text sizes\" - you know, something you'd read a book in) have less white space inside than lighter weights, almost always in absolute measurements, but at the very least in relation to the black bodies.\\* Heck, otherwise they wouldn't look darker! The fact that the inside whites are relatively smaller means the outside whites have to be smaller too, otherwise either the lighter or the darker weight will have bad notan - like how Helvetica is too tight. I shouldn't have to explain this, and frankly I don't, because you already know it, you simply slipped, possibly in your eagerness to defend Mitch & Whitie against me; or really anybody against me. We all make mistakes; but some of us have great trouble admitting it.\n\n\\* Meaning that even if a darker weight has the same absolute inside counter measures (which is very hard to find examples of, not least because it makes the widths too great), the darker stems etc. will make them look relatively smaller. But as a rule the insides do get smaller, because that's the smart way.\n\nIf you have a real-world counter-example, please show it.  \nShow me a font where a darker weight is looser. And if you  \nfind it, go ahead and call it readable with a straight face.\n\n\\> So your rule is just too simplistic.\n\nIt's not my rule! Please, ask around. Yes it's basic, but that's the good kind of rule.  \nIt comes straight from notan (although that's not the usual term used).\n\n\\> The Mitchell and Wightman issue is different.\n\nYes, but not different enough. Not different enough to be true. If a darker weight needs tighter letterspacing between letters to maintain readability, tighter leading would generally help too. For one thing, think of wordspaces and their role in the determination of optimal leading.\n\nTrue, unlike letterspacing it's harder to ruin readability with looser leading, but it's still functionally bad in terms of readability (at the very least by wasting saccades over pages, but probably more significantly).\n\n\\> evenness of color is one primary goal in good text type design.\n\nNow <cite>that's</cite> simplistic.\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 4:20pm",
      "content": " ![](http://web.archive.org/web/20150302111354im_/http:/typophile.com/files/Per_5815.jpg)\n\n"
    },
    {
      "time": "27 May 2007 — 4:32pm",
      "content": "And what do we think about the readability of Perpetua Bold?\n\nAnd I don't mean you, Nick, since you think Eunoia-Text can be  \nused for a book. You might ask William what he thinks about that.\n\nhhp\n\n"
    },
    {
      "time": "27 May 2007 — 6:29pm",
      "content": "BrooklynRob,\n\nAlso, Century might well more appealing in the USA than in other places. See [http://typophile.com/node/12634](http://web.archive.org/web/20150302111354/http:/typophile.com/node/12634 \"http://typophile.com/node/12634\")\n\n"
    },
    {
      "time": "27 May 2007 — 6:54pm",
      "content": " ![](http://web.archive.org/web/20150302111354im_/http:/typophile.com/files/avis04_5733.gif)\n\nHelmut Krone's art direction for Avis ads in the 1960s is often cited in best-of lists.\n\n"
    },
    {
      "time": "27 May 2007 — 9:03pm",
      "content": "Yeah, and people think that stuff set in Mrs Eaves is great too.  \nBut some of us know better: [http://typophile.com/node/34030](http://web.archive.org/web/20150302111354/http:/typophile.com/node/34030 \"http://typophile.com/node/34030\")\n\nhhp\n\n"
    },
    {
      "time": "28 May 2007 — 7:12am",
      "content": "Times New Roman Bold also has wider side bearings on the lower case than does Times New Roman Regular. And I have never heard complaints about the readability of Times Bold.\n\nIt is true that Walter Tracy thinks that the total side bearings of the n should never be greater than the counter of the n, which Times New Roman Bold violates. However, he doesn't criticise the fact that the Times bold has greater sidebearings than the regular. And indeed, he says that proportionally to the counter, the bold H usually requires larger sidebearings than the regular. It would be interesting to see what Tracy did in his own fonts.\n\nAs Tracy notes, the phenomenon of related bold is a 20th century invention. And as we can see from Perpetua, Times New Roman, and Adobe's recent faces, there have been diverse approaches to the companion bold.\n\nIn Adobe's case, the effort has been to use Multiple Master technology to produce a great range of weights for serifed fonts, in the way that such a range was introduced for sans faces--first for Futura, if I'm not mistaken. This has resulted in much more similarity in size to size than in the case of old metal fonts, especially pre-pantographic punch cutter fonts. Current practice of Slimbach more or less follows Tracy, but with considerably tighter spacing than Tracy recommends.\n\nAs to readability, I don't think companion bolds are particularly readable in extended text, nor are they intended to be. You almost never see extended text in a bold weight. That rarity is, I believe, because excessive darkness hurts readability--as does excessive lightness. The 'good notan' gained by tight spacing of seriffed bolds is a matter of aesthetics, and the purpose of contrast to the companion regular, rather than readability.\n\nOverall, I am inclined to not to regard the issues of spacing bolder fonts as settled art. I do think it depends partly on style and optical size. For example Times New Roman Bold deliberately has stylistic differences from Times New Roman--harkening back to the pre-pantographic punch cut days. This is not necessarily a bad idea.\n\n"
    },
    {
      "time": "28 May 2007 — 7:27am",
      "content": "\\> Times New Roman Bold\n\n\\> the phenomenon of related bold is a 20th century invention.\n\n\\> I don’t think companion bolds are particularly readable\n\nI previously tried to get you to see past the Bold angle, but apparently I've failed.  \nHopefully as you progress in making your Caslon, you'll come around.\n\nhhp\n\n"
    },
    {
      "time": "28 May 2007 — 7:42am",
      "content": "Charles, I checked my late Uncle Ben Lieberman's 1967 book 'Types of Typeface' for Primer. At the end of the book he has a variety of typefaces (metal) all set in the same paragraph at 10/11. This is a useful device for comparison, though of course it has its limits.\n\nAt any rate, the contrast between Century Schoolbook and Primer--he has both--is striking. The most obvious thing is that Primer is much lighter. At this small size with little leading, Primer is much more of a 'text' face, much more readable.\n\nMy guess is that Century Schoolbook was designed for primers and other children's books, and intended to be used at very large size with lots of leading. And it does look very readable and pretty in such useage.\n\nI suspect that it works well as an alternative to Courier on letter sized paper, or that it works at 9 point in some settings, as you say, is more or less good luck, beyond its original 'brief'.\n\n"
    },
    {
      "time": "28 May 2007 — 7:55am",
      "content": "\\>I previously tried to get you to see past the Bold angle, but apparently I’ve failed.\n\nHuh? I don't know what you are talking about.\n\nYou wrote:\n\n\\>What I’ve taken issue with were:  \n\\>1) Mitchel and Wightman’s claim.  \n\\>2) Your “I don’t think there is a generally valid rule”  \n\\>to my “darker fonts need tighter (lateral) spacing”.\n\nYou haven't even looked at Mitchell and Wightman, and the success of Times New Roman Bold I think is a reason to question your perported 'rule' as an iron one. And it seems that you have already conceded that comparing small optical sizes to regular your 'rule' might not hold.\n\nThe practice of Wm Caslon I was certainly different from Adobe's today. I'm working hard to get the best of both worlds. And I've wasted way too much time posting to this thread, so bye bye for now.\n\n"
    },
    {
      "time": "28 May 2007 — 8:02am",
      "content": "\\> Huh? I don’t know what you are talking about.\n\nReminds me of another thread.\n\nhhp\n\n"
    },
    {
      "time": "28 May 2007 — 8:19am",
      "content": "Bill.\n\nPrimer was an improvement on \"Century (Expanded),\" not Century Schoolbook. I suppose both the Schoolbook & Expanded could be considered variants on the original font \"Century,\" but CE appeared far earlier. In my circles at any rate, Century Expanded was far more common than Schoolbook.\n\n"
    },
    {
      "time": "28 May 2007 — 9:30am",
      "content": "I used Primer (c.1985) for a product brochure -- it was great in a large text size (14-18pt) and for very big headlines. It was still Century, and not Clarendony, as the usual Centuries become when used large, or Moderny/Didony, which is the way Centuries often end up in display versions. Is it available digitally?\n\nAnd what about a Century with sc&osf?\n\n"
    },
    {
      "time": "28 May 2007 — 9:47am",
      "content": "\\> Is it available digitally?\n\nYes, Linotype does have it, but sans the most significant thing about it: being the last of the great faces of that era, it embodies the greatest sophistication of optical scaling ever. (Credit to either Kent or Gerald for once pointing this out to me.)\n\nhhp\n\n"
    },
    {
      "time": "28 May 2007 — 10:31am",
      "content": "<cite>Charles: Anybody have more thoughts on Primer (aka Century improved)?</cite>\n\nNo way am I going to touch that other tangent, but I'll gladly discuss Primer.\n\nPrimer is another of those classic American book faces whose unavailability in a decent digital form I lament. (Caveat: I have never worked with the Bitstream version, but what I have seen doesn't impress me.)\n\nPrimer is a lot harder to find \"in the wild.\" But, William, here are two samples from my collection.\n\n ![](http://web.archive.org/web/20150302111354im_/http:/typophile.com/files/Primer_HessePage_3998.jpg)\n\n ![](http://web.archive.org/web/20150302111354im_/http:/typophile.com/files/Primer_Woodpeckers2_6116.gif)\n\nThe first is from the book I mentioned in Eben's [book-collecting thread](http://web.archive.org/web/20150302111354/http:/typophile.com/node/33915): <cite>Beneath the Wheel</cite>, by Hermann Hesse [Farrar, Straus and Giroux, Inc., 1968]. This is set in either 10/14 or 11/14 (see below for why I'm hedging), printed on an ivory antique-finish stock. This particular book is in only fair/good condition and there's quite a bit of foxing, which I didn't bother to try to clean up.\n\nThe second is from <cite>Song and Garden Birds of North America</cite>, edited by Alexander Wetmore [National Geographic Society, 1964]. This was printed on a pretty hard, coated stock. The text setting is 9/12. The head is 24 pt.\n\nNote: These examples are not to scale with one another.\n\nPrimer was produced in two variations: one with short descenders and one with long descenders. You'll notice that the Nat'l Geo book uses the short descenders, while the Hesse is set with long descenders. Both versions would have been cut on the standard alignment for the nominal point size. The short descenders would fit on the nominal body, but the long descender version would need to be cast on a body at least one size larger. This is why I'm hedging a little in declaring the size of the Hesse setting. But the Hesse text is the same size as the subhead in the bird book (_\"Family Picidae\"_).\n\nAnother interesting aspect I've noticed is that the typical optical adjustments between sizes is particularly pronounced in the Primer series. (I thought I had something from Griffith mentioning this, but I can't put my hands on it.)\n\nFrom some 1954 MLCo. advertising copy: \"In the small sizes, Primer can crowd considerable type into a small space without graying into fuzziness. The even gradation of color through the various sizes from 6- to 12-pt. results directly from Linotype's policy of making separate drawings for each point size, _modifying the width_ of individual characters as needed.\" [emphasis in the original]\n\nI'm pretty sure Primer was indeed conceived to replace (i.e. compete with) Century Schoolbook, hence the name. (Again, I can't seem to put my hands on a primary source.)\n\nNaturally, it was primarily marketed toward textbooks and educational materials. From the same ad copy quoted above: \"Primer was designed for us by Rudolph Ruzicka primarily for textbook or schoolbook use. But Ruzicka drew us an alphabet so clear, so free of frills and mannerisms that might interrupt the reader, that we strongly recommend it for all types of work where legibility and dignity are of the essence.\" (Remember, this is marketing copy.)\n\nRuzicka had this to say [from <cite>Rudolph Ruzicka: Speaking Reminiscently</cite>, edited by Edward Connery Lathem, The Grolier Club, 1986.]: \"Finally, after Fairfield Medium, I did Primer, which was intended to be a text type; that is to say, one principally meant for text books and that sort of thing. It was to be totally without artificial refinement, without affectations of any kind. Supposedly; but it isn't, really.\"\n\nCharles -- I don't know whether I'd qualify for you as a \"true font designer,\" but I have, on several occasions, toyed with the idea of doing a revival of Primer. The original Linotype working drawings are at the Printing History Museum in North Andover, and I've had a brief look at some of them. Gardner would never let me work from them without permission from Linotype, but now that Lino ownership is back in the States, it might be easier to get some traction with the idea. I could bring it up with Allan Haley. Still, I'm not convinced that there would really be enough broad market appeal to make the venture truly viable.\n\n-- K.\n\n"
    },
    {
      "time": "28 May 2007 — 10:59am",
      "content": "Fascinating, Kent.\n\n\\>don't know if I’d qualify for you as a “true font designer,”\n\nAre you KIDDING? Say 'Whitman' three times.\n\nTo me this feels too much like a newspaper type modified for book work. I'm not sure I like it, but I probably would if you redrew it :)\n\nMy problem with it is that it looks awfully wide to me. But at the moment everything wider than Caslon (which varies width with optical size!) looks wrong, so my vision is probably distorted.\n\n\\>Gardner would never let me\n\nHeh,heh. Don't tell him who told you, but though he presents a very gruff exterior, I think you can sweet talk him. They let Matthew Carter use those drawings for his digital Monticello. Admittedly, that is a Linotype digital font, and he is Matthew Carter. But hey, you are Kent Lew :)\n\n"
    },
    {
      "time": "28 May 2007 — 11:34am",
      "content": "\\> No way am I going to touch that other tangent\n\nBut you already have. Here's a composite of Whitman  \nRegular and Bold, with the right sides of the rightmost  \nstems of the \"m\"s aligned, and with the Bold in gray:\n\n ![](http://web.archive.org/web/20150302111354im_/http:/typophile.com/files/WhitmanSpacing_4141.gif)\n\nWilliam, you're working with FontBureau as well.  \nExpect to hear from them what I've been saying, eventually.\n\nPrimer: It would certainly be great to see a proper revival; and  \nthere's no reason to doubt that you could do it justice yourself,  \nespecially considering your proper awareness of optical scaling.  \nBut I have to agree with your hunch that the market for it would  \nbe minimal; and maybe that was the case with the original, which  \nwould explain the apparent general disinterest in a digital version.\n\nSince you're so good at making original contributions  \nand not just revivals, I would stick to that instead!\n\nhhp\n\n"
    },
    {
      "time": "28 May 2007 — 12:49pm",
      "content": "Kent,\n\nBy \"real\" or \"true\" font designer, I means essentially someone other than me. I can usually \"fix\" a font, but that is a far cry from starting from step 1. Looks like you qualify.\n\nI would think that if Linotype gave you access to their materials, they might want to co-release it. I will try a \"personal message\" through Typophile.\n\nBest,\n\nCharles\n\n"
    },
    {
      "time": "28 May 2007 — 2:19pm",
      "content": "<cite>CE: By “real” or “true” font designer, I means essentially someone other than me. </cite>\n\nWell, then I guess I would qualify ;-)\n\nWilliam, you are kind; but one font could just be a fluke. We'll see what future efforts yield, and then time will tell.\n\n<cite> WB: Heh,heh. Don’t tell him who told you, but though he presents a very gruff exterior, I think you can sweet talk him. </cite>\n\nOh, I know that. I have a great relationship with Gardner. But he explained his position vis-a-vis Heidelberg (owners of Lino at the time) and I respect his position. The work that Matthew did on Monticello was done with the full blessings of Linotype (and they co-own the results, and it's a shame they didn't launch any marketing efforts in conjunction with the Princeton project), and that's why he was allowed to use the drawings.\n\nPrimer is a wide design. In fact, it has pretty unique proportions all around -- rather wide and extremely large x-height, especially for its time. But, you're also probably reacting strongly to the 9-pt above, which is unduly emphasized by the screen enlargement.\n\nNevertheless, some of these aspects, which admittedly are part of its charm, also give it some limitations. Which is why it was always better suited to textbooks and was never as popular or broadly useful in general book work as Caledonia or Electra or Fairfield, for instance.\n\nHrant, you're right. Although I constantly toy with ideas about reviving faces I admire (and don't think have been done justice), I am possibly more temperamentally inclined to do other work and to just let it be deeply informed by those models.\n\n-- K.\n\n"
    },
    {
      "time": "28 May 2007 — 6:44pm",
      "content": "Hrant, you are completely off the mark in your assumptions about what I am doing, and I am well aware of what you are illustrating with Kent's wonderful typeface.\n\n"
    },
    {
      "time": "28 May 2007 — 8:07pm",
      "content": "\\> you are completely off the mark in your assumptions about what I am doing\n\nYou are making a typeface, am I correct?  \nWill it have more than one weight?\n\n\\> I am well aware of what you are illustrating\n\nThe next step for you is to realize that it's functional, not fashionable.\n\nhhp\n\n"
    }
  ]
}
