{
  "id": "3404",
  "title": "Logo for Drywall Finishing Council",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi, this is a logo I'm working on for dwfc.org. I'm on a team that may be doing a complete overhaul and branding for their company and was hoping to get some early critiques. I haven't put too much work into this... only a couple hours. I'm open to font ideas and any comments on the idea overall. (I'm not a big drywall fanatic; my google research on \"drywall\" brought up a lot of those paste spatulas which are used for spreading the goo over the seams... so I thought I'd work one in.) The colors are not set in stone, as we have ZERO feedback on that from the company yet. I just need some prelim ideas.   \n   \nThanks!\n\n",
  "author": "brianford",
  "time": "2 Mar 2004 — 4:08pm",
  "uid": "3153",
  "comments": [
    {
      "time": "2 Mar 2004 — 4:15pm",
      "content": "Hrm... seem to be having some trouble with my original post. It showed up in the preview... I'll try this:   \n   \n ![](http://web.archive.org/web/20131021021024im_/http:/www.typophile.com/forums/messages/29/27644.gif)\n\n"
    },
    {
      "time": "2 Mar 2004 — 4:19pm",
      "content": "Thanks, Tiffany... I thought about that not working but then stupidly tried anyway. Seeing the logo online already gives me some ideas, but I'll see what everyone else has to say...\n\n"
    },
    {
      "time": "2 Mar 2004 — 4:33pm",
      "content": "Heheh, well... honestly... I haven't done much else....   \n   \n ![](http://web.archive.org/web/20131021021024im_/http:/www.typophile.com/forums/messages/29/27647.gif)   \n   \nAs you can see, I started with a different font just to get the layout basically the way i wanted it, and for a while the Spatula handle conformed to the color of the D and the W... Oh, and my very earliest version didn't have the negative space in the D.   \n   \nBut, other than that.. this is what I got right out of the gate.\n\n"
    },
    {
      "time": "2 Mar 2004 — 4:51pm",
      "content": "Well, my thinking behind that:   \n   \nBasically, Drywall Finishing Council is a group of people who oversee standards in drywall finishing materials for the industry. I think they're probably known mainly by members of the Drywall community. (Hehe) Anyway, I was using the fact that they used the acronym dwfc as their domain name as a basis for using it in their logo. Do you have suggestions other than utilizing dwfc? Unfortunately, Drywall Finishing doesn't conjure a lot of graphic images in my mind, which is another reason why I went with dwfc, while incorporating the one notworthy graphic element that I could consistently find in searches.\n\n"
    },
    {
      "time": "2 Mar 2004 — 6:09pm",
      "content": "Brian:   \n   \nAn acronym is commonly used for a group, such as a \"Council\", but DWFC is not an acronym friendly title, meaning that it doesn't flow. \"W\" rarely lends itself to a nice sounding acronym (exception, A&W Rootbeer). DFC is not bad, but unfortunately, it isn't consistent with their URL.   \n   \nRE: \"Drywall Finishing doesn't conjure a lot of graphic images in my mind\"   \n   \nHave you considered doing a strictly typographical logo? This would be an appropriate approach for a \"Council\". Maybe a very simple shape such as a trapazoid (representing an angled sheet of drywall) could be incorporated\n\n"
    },
    {
      "time": "2 Mar 2004 — 7:41pm",
      "content": "\\> Drywall Finishing doesn't conjure a lot of graphic images in my mind   \n   \nThe image I'm getting is of a hole where a fist went through it. :-/   \n   \nSeriously, I'm thinking you should use a bitmappy font.   \nI don't think anything too literal is going to work well.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Mar 2004 — 8:11pm",
      "content": "Scott... Good suggestions... I'll see if i can work on something to incorporate your ideas. I've had enough feedback encouraging me away from the acronym idea that I'm going to try something different.\n\n"
    },
    {
      "time": "2 Mar 2004 — 8:59pm",
      "content": "okay, I was brainstorming on something new:   \n   \n ![](http://web.archive.org/web/20131021021024im_/http:/www.typophile.com/forums/messages/29/27654.gif)\n\n"
    },
    {
      "time": "2 Mar 2004 — 9:05pm",
      "content": "hrm.. let me try that again with a transparent background:   \n   \n ![](http://web.archive.org/web/20131021021024im_/http:/www.typophile.com/forums/messages/29/27657.gif)\n\n"
    },
    {
      "time": "2 Mar 2004 — 9:55pm",
      "content": "Also, just to be comprehensive, Here's the logo at 90 and 180 degrees. (A friend was mistakenly under the impression that I was still trying to convey DWFC in the last logo and searching in vain for a W and F, so... I thought this might help get rid of that association.)   \n   \n ![](http://web.archive.org/web/20131021021024im_/http:/www.typophile.com/forums/messages/29/27660.gif)\n\n"
    },
    {
      "time": "2 Mar 2004 — 10:20pm",
      "content": "Grey background keeps making it apparent that i'm cutting corners in order to rush... Final versions will of course have the white areas cut out completely, so that it's technically possible for the logo to be against something OTHER than a white background...   \n   \n ![](http://web.archive.org/web/20131021021024im_/http:/www.typophile.com/forums/messages/29/27663.gif)\n\n"
    },
    {
      "time": "2 Mar 2004 — 11:53pm",
      "content": "This looks more like an illustration for some collateral or something than it does a logo.\n\n"
    },
    {
      "time": "3 Mar 2004 — 4:07am",
      "content": "Brian, your logo looks like you are selling drywall products. Too Commercial. I suggest you find out what the goals of the council are. I think an all type logo would probably be appropriate.\n\n"
    },
    {
      "time": "2 Mar 2004 — 4:13pm",
      "content": "Brian, the forums seem to not like .PNG files. Try .GIF or .JPG\n\n"
    },
    {
      "time": "2 Mar 2004 — 4:22pm",
      "content": "You're welcome, Brian. Perhaps to get us up-to-date, you could show us your thumbnails up to this point. Just so we can understand the direction so far.\n\n"
    },
    {
      "time": "2 Mar 2004 — 4:38pm",
      "content": "Right off the top of my head, I wonder if an acronym is the best way to go. Are they known by this, or are they known by their name proper?\n\n"
    }
  ]
}
