{
  "id": "34058",
  "title": "New Period Font",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello All,\n\nThis is my second typeface to design, and I am hoping for some feedback. My inspiration was the cigar branding coming out of the Spanish Carribean in the the late 1800's and early 1900's. Shown are all my fancy letters.. for the letters with large swashes I am creating \"standard\" letterforms so any swash interference can be resolved.\n\n ![](http://web.archive.org/web/20150317172424im_/http:/typophile.com/files/hispaniola_3689.gif)\n\n",
  "author": "blakeyoung59",
  "time": "27 May 2007 — 9:47am",
  "uid": "12726",
  "comments": [
    {
      "time": "27 May 2007 — 12:31pm",
      "content": "I like it overall. I especially like the horizontal stroke on the A and H extending to the left, the diamond in the center of the O, the center mark in the S and Z, and the curve of the D.\n\nThe horizontals in the A, E, F, G, and H are all at slightly different heights, which looks accidental. (It's accentuated by the fact that EFGH are shown right next to each other.) I would pick one or two horizontal stroke positions and make these five letters conform to them.\n\nThe lower horizontal swash in E, L, and 2 match, and the Z and Q's match, but I think the two slightly different swashes are going to look weird when they are close together, like in words like 'lizard' or 'equal.' Either make them identical or make them more different.\n\n6, 8, and 9 are very flowing and freeform -- much more so than the rest of the font. Maybe make them more geometric, add some straight lines or a serif.\n\nHope this is helpful. :)\n\n"
    },
    {
      "time": "27 May 2007 — 2:01pm",
      "content": "The numbers kick butt.\n\n"
    },
    {
      "time": "27 May 2007 — 7:40pm",
      "content": "yeah.. i understand what you're saying about the crossbar heights... but I arranged them according to the guidelins in Designing Type(karen cheng).. in usage though... I think they are optically correct. thanks for the feedback\n\n"
    },
    {
      "time": "27 May 2007 — 11:01pm",
      "content": "That's really lovely. The S is my favorite.\n\nBut that X swash is in bad shape.\n\nI think that if you made one shape from the tail of the 9 and the bowl of the 6, it would improve them both.\n\n"
    },
    {
      "time": "28 May 2007 — 10:08am",
      "content": "It’s a gorgeous design. I really hope you do some ligatures that take advantage of the visual grammar you created with the swashes and open counters on letters that are usually closed.\n\nMy nitpicks follow:\n\n- The narrowness of **S** draws attention to itself and away from words.  \n- Where the upper and lower lobes of **B** connect there’s either a flaw in the drawing or just and optical problem that’s putting a tiny bulge inside the upper lobe. It may just be a rendering issue that would go away in a PDF specimen.  \n- Something funny is going on with the height of **O** and **Q**. In the word Hispanola the O extends above the capline and baseline, but when they appears in the alphabet the O and Q stop at those lines.  \n- **3** looks like it has been rotated about ten degrees.  \n- The gap in the counter of **8** is much larger than any of the other gaps in the typeface. All three of the gaps in the numbers are out-of-scale with the alphabet.  \n- The connection between the vertical stroke and tail of **J** needs to flow better. It would also play better with the other letters if moved down a little.\n\n"
    },
    {
      "time": "2 Jun 2007 — 10:04pm",
      "content": "The diagonal stems of the **A** look backwards. If they are going to be different, the heavier stroke should be on the right. The rest of the letters look like they are supposed to have a uniform stroke weight, so the **A** should probably be the same on both sides. Also, the stem weights seem to vary slightly from letter to letter. Seems like some might need adjustment.\n\n"
    },
    {
      "time": "3 Jun 2007 — 7:19am",
      "content": "_but I arranged them according to the guidelins in Designing Type(karen cheng).. in usage though… I think they are optically correct. thanks for the feedback_\n\nthe criticism by glyphobet are totally legitimate. Those \"guidelines\" by Karen Cheng aren't rules, they are just observations. But those observations apply to typefaces for text usage. Look at some display faces with similar horizontal stroke positions. In most display typefaces the strokes are exactly or almost at the same height\n\nfor example:  \n [http://www.myfonts.com/fonts/linotype/industria/](http://web.archive.org/web/20150317172424/http:/www.myfonts.com/fonts/linotype/industria/ \"http://www.myfonts.com/fonts/linotype/industria/\")  \n [http://www.myfonts.com/fonts/linotype/itc-anna/](http://web.archive.org/web/20150317172424/http:/www.myfonts.com/fonts/linotype/itc-anna/ \"http://www.myfonts.com/fonts/linotype/itc-anna/\")  \n [http://www.myfonts.com/fonts/fontbureau/bodega-sans/](http://web.archive.org/web/20150317172424/http:/www.myfonts.com/fonts/fontbureau/bodega-sans/ \"http://www.myfonts.com/fonts/fontbureau/bodega-sans/\")  \n [http://www.myfonts.com/fonts/marksimonson/mostra/](http://web.archive.org/web/20150317172424/http:/www.myfonts.com/fonts/marksimonson/mostra/ \"http://www.myfonts.com/fonts/marksimonson/mostra/\")\n\nand when you praise the observations by Karen Cheng as guidelines, why is your A backwards, and why does your O look so eggy!??!\n\nbest regards: Steven\n\n"
    },
    {
      "time": "5 Jul 2007 — 4:14pm",
      "content": "A lovely type face. Wonderful for monograms too. It's the irregularities that make a winner.\n\n"
    },
    {
      "time": "18 Nov 2007 — 11:52am",
      "content": "Are you planning to continue development of Hispaniola and your previous (unnamed) effort - the ribbon-ey typeface? And if so, it would be intereting to know whether you're planning to offer them as computer fonts or just as graphics.\n\n- hvb\n\n"
    },
    {
      "time": "7 Aug 2010 — 6:01am",
      "content": "Just because the A is backwards doesn’t mean it’s wrong!\n\n"
    },
    {
      "time": "11 Aug 2010 — 3:29pm",
      "content": "I definitely agree over these last few years, a lot of health conscious families and individuals have been searching for alternative routes for more nutritious diets. I live in San\n\nFrancisco area, although the economy is not as robust as before, but when I go to farmers markets, Whole Foods, Trader Joe's, there are still a good amount of people\n\nshopping there all the time.\n\n"
    },
    {
      "time": "26 Feb 2012 — 12:06pm",
      "content": "Have you published this font? I would like to use it . . .\n\n"
    },
    {
      "time": "4 Aug 2014 — 11:03am",
      "content": "I would love to use this font...is it accessible?\n\n"
    }
  ]
}
