{
  "id": "34064",
  "title": "San-Serif for religion or faith based content?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Greeting all,\n\nhere's a weird one...\n\nI have a client with a Christian-based business. He's a good friend so I agreed to do the design. After a quick look in my arsenal, I realized - What the heck kind of San-serif face to use for this sort of identity?\n\n",
  "author": "MarvinMe",
  "time": "27 May 2007 — 9:22pm",
  "uid": "13460",
  "comments": [
    {
      "time": "27 May 2007 — 9:25pm",
      "content": "[http://www.virusfonts.com/](http://web.archive.org/web/20130822015727/http:/www.virusfonts.com/ \"http://www.virusfonts.com/\")\n\n"
    },
    {
      "time": "27 May 2007 — 9:28pm",
      "content": "I think this would be beautiful.\n\n[http://www.beorcana.com/](http://web.archive.org/web/20130822015727/http:/www.beorcana.com/ \"http://www.beorcana.com/\")\n\n"
    },
    {
      "time": "27 May 2007 — 9:54pm",
      "content": "i second the Beorcana suggestion.\n\n"
    },
    {
      "time": "27 May 2007 — 10:09pm",
      "content": "Interesting looking choice. The history of the design also matches well. pearlstreet you found a good one!\n\n"
    },
    {
      "time": "28 May 2007 — 8:13am",
      "content": "What sort of business is it? The type should reflect his business sector.\n\n"
    },
    {
      "time": "28 May 2007 — 8:18am",
      "content": "I always found Rotis to have that look you’re probably looking for.\n\n"
    },
    {
      "time": "28 May 2007 — 1:01pm",
      "content": "Focus on what the business does, not it’s connection to religion. Religion taints almost every aspect of life worldwide, so unless your friend is part of some tiny sect that has a very distinct identity already it will be hard to express the religion with letters.\n\n"
    },
    {
      "time": "29 May 2007 — 7:20am",
      "content": "\"I have a client with a Christian-based business.\"\n\nThat can mean one of two things, IMHO:\n\na) they are a business related to the church industry (pews, bibles, hymnals, choir robes, etc.)\n\nb) they are a business completely unrelated to the church but think that saying they are christian will attract other christian's to hire them.\n\nwith a), obviously, you can go nuts with religious iconography and fonts that are in the spirit of it.\n\nwith b), though, unless they are wanting to be EXCLUSIVELY targetting other christians, I'd say you want to stay away from anthing too literal to avoid annoying those that aren't looking for 'christian based' companies.\n\nI also have to smile after visiting Nick's link, and also would agree that Beorcana is quite nice.\n\n"
    },
    {
      "time": "29 May 2007 — 7:31am",
      "content": "Christian-based? Oh, easy, easy, too easy. Pick anything from this [man](http://web.archive.org/web/20130822015727/http:/www.christianschwartz.com/). Heh. Sorry.\n\nƒ\n\n"
    },
    {
      "time": "21 Jul 2007 — 9:14am",
      "content": "...\n\n"
    },
    {
      "time": "26 Jun 2007 — 3:01pm",
      "content": "I would think that Friz Quadrata with its range would be useful; especially if there was any hotstamping involved.\n\n"
    }
  ]
}
