{
  "id": "34070",
  "title": "Slate.com : Helvetica",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Interesting slideshow article on Slate.com about the evolution of Helvetica (Mark get's linked, Erik gets quoted.)\n\n[http://www.slate.com/id/2166887/](http://web.archive.org/web/20110420143707/http:/www.slate.com/id/2166887/)\n\n",
  "author": "<a href=\"/web/20110420143707/http://typophile.com/user/6496\" title=\"View user profile.\">AndrewSipe</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": "",
      "content": "Interesting, how the author mentions Carson as the designer to replace the helvetica-corporate-look with a new approach, forgetting all about Neville Brody ten years earlier. Probably too young.\n\n"
    },
    {
      "time": "",
      "content": "Too young? Or too journalistic.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> too journalistic\n\nBad research?\n\n"
    },
    {
      "time": "",
      "content": "Too sensationalistic. Mass media. Masses like sensation.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The author's name is Mia. I assume she is a woman. She also misspelled [Erik Spiekermann](http://web.archive.org/web/20110420143707/http:/typophile.com/wiki/Erik%20Spiekermann)'s name.\n\n"
    },
    {
      "time": "",
      "content": "\\> Masses like sensation.\n\nI was so naive to believe the film would be shown at regular cinemas. Well, it’s not because it isn’t for the masses. It’s a film for geeks.\n\n"
    },
    {
      "time": "",
      "content": "Well, one \"regular\" cinema here did show it.  \nBut yeah, it's totally geeky. And a great film! :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Actually, I think it's a great primer for non-designers. It says as much about the craft of graphic design as it does Helvetica. I am hoping it will see wider release.\n\n"
    },
    {
      "time": "",
      "content": "\\> Actually, I think it’s a great primer for non-designers. It says as  \n\\> much about the craft of graphic design as it does Helvetica. I am  \n\\> hoping it will see wider release.\n\nI agree and I share those hopes, but cinema is business. I doubt that even underground film goers will be interested in “helvetica? - huh?”. The audience is just too limited to - geeks.\n\n"
    },
    {
      "time": "",
      "content": "Helvetica is described as an \"updated version\" of Akzidenz Grotesk, but Arial is a \"digital knock-off\" of Helvetica.\n\nNo fair, eh Si?\n\n"
    },
    {
      "time": "",
      "content": "I dragged my non-designer sister to the RISD screening and she claimed to have enjoyed it, and to have learned a lot about design if not the typeface.\n\n"
    },
    {
      "time": "",
      "content": "My point is: If you hadn’t \\*dragged\\* her there, would she have ever gone to see it by herself?\n\n"
    },
    {
      "time": "",
      "content": "No. And honestly there were a lot of other people who resisted being dragged.\n\n"
    },
    {
      "time": "",
      "content": "\\>No fair, eh Si?\n\nI noticed in the comments that someone accused Mia of lifting key phrases (virus and homely, as I recall) from Mark's article. ;-) I suppose in journalism as well as fonts if you get offended by someone accusing you of plagiarism you're in the wrong business.\n\nAs for Arial, one of my adopted children, its interesting that when people make metrically compatible sans faces today, Arial is the model.\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "Such a great reply I posted it twice!\n\n"
    },
    {
      "time": "",
      "content": "\\> As for Arial, one of my adopted children, its interesting that when people make metrically compatible sans faces today, Arial is the model.\n\nHaha. This is like Vince's (perhaps jocular) boasting that Comic Sans is the most popular typeface for anything \"fun\". We all know it's not because it's the best font for the job. It's just the one most widely available.\n\n"
    },
    {
      "time": "",
      "content": "I am no big fan of Helvetica (too uniformed in my opinion), but Arial makes me sick. I was on a convention not too long ago, and had to listen to some people from Microsoft boasting what a great design Arial was, and what an even greater design Segoe is.\n\nFace it, they're both clones, stolen from fonts made by somebody else. I simply hate it when people do that, and I hate it even more when big companies do that, because they know they'll get away with it.\n\nOh, and I do think that Akzidenz Grotesk and Helvetica are quite different - Miedinger and Hoffmann did design a new typeface here, but they of course had references (don't we all?). But Arial is just copied. If you print it on thin paper and put the letters on top of each other, you can see that clearly. One of our profs at the university did this, and I was astonished to find that it was hard to find any differnces. 95% of the letters are simply the same! That is not true with Akzidenz Grotesk and Helvetica (or Neue Haas).\n\nI was very sorry to see Berthold go... they had some great typefaces!! But they just did not make it through to modern technology. It sometimes reminds me of Commodore :-)) It's always the companies I like, hihi...\n\n"
    },
    {
      "time": "",
      "content": "While I don't have anything particularly intelligent to say, I did find this exciting flash game a while back, it's somewhat relevant to the topic at hand...\n\n[Click](http://web.archive.org/web/20110420143707/http:/www.engagestudio.com/helvetica)\n\nOf course, I'm sure many of you already know about this. =P\n\n"
    },
    {
      "time": "",
      "content": "_If you print it on thin paper and put the letters on top of each other, you can see that clearly._\n\nPike, have you tried this with AG and Helvetica?\n\n"
    },
    {
      "time": "",
      "content": "Helvetica is tighter than AG and has a larger x-height. A deadly combination.  \nUnica is the fixed Helvetica. Call it \"Helvetica Fixed\"!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hi all. Agreed, that Slate piece was sort of weak.\n\nIn terms of <cite>Helvetica</cite> coming to \"normal\" cinemas, this will be happening this fall in selected cities. Generally independent films do festivals and special event screenings first, then normal art house cinema runs. So the film will have a two-week run at the IFC Center in New York City in September, and there will be more runs like that announced in the next few months. The DVD release will happen immediately after those September cinema showings.\n\nBut overall the response from both design and non-design audiences so far has been fantastic.\n\nCheers from Minneapolis (we had two great screenings at the Walker Art Center last night),\n\n-Gary\n\n"
    },
    {
      "time": "",
      "content": "<cite>The DVD release will happen immediately after those September cinema showings.</cite>\n\nAre you releasing an HD-DVD or Bluray High Definition version with advanced hinting?\n\n"
    },
    {
      "time": "",
      "content": "\\> I was on a convention not too long ago, and had to listen to some people from Microsoft boasting what a great design Arial was\n\nSounds more than a little far-fetched. What was the name of the convention?\n\n"
    },
    {
      "time": "",
      "content": "_Cheers from Minneapolis (we had two great screenings at the Walker Art Center last night),_\n\nAnd I missed it! It was sold out (you snooze, you lose). The Walker added another showing tonight, but I unfortunately have other plans.\n\nIt will be shown at this year's TypeCon, right? And, Gary, will you be there?\n\n"
    },
    {
      "time": "",
      "content": "Mark, yes to both.\n\n"
    }
  ]
}
