{
  "id": "34072",
  "title": "Calgary typophile",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A small subset of this forum resides in the city of Calgary. And we have taken to meeting once a week at a local pub to continue our discussions about type. (Also, some beer drinking is involved.)\n\nThis is a general invitation for any others in the Calgary area who would like to accompany us. The conversation isn't always about serifs and such, and there are other people at the table who aren't typophiles. Everybody is welcome. Bring a friend, bring a spouse. Bring a biker gang. No appetite for beer? Still welcome.\n\nOther typophiles passing through the city (yeah, right!) are also invited.\n\nInterested? Feel free to contact Linda Cunningham or myself for details.\n\n",
  "author": "KenBessie",
  "time": "28 May 2007 — 8:46am",
  "uid": "13948",
  "comments": [
    {
      "time": "28 May 2007 — 9:03am",
      "content": "_(Also, some beer drinking is involved.)_\n\nThey also have really good cheeseburgers. ;-)\n\n"
    },
    {
      "time": "29 May 2007 — 8:57am",
      "content": "More info for those thinking about attending:\n\n_When:_ Thursday evenings, around 6:00  \n_Where:_ The Cat & Fiddle pub (16th Ave. & 5th St. NW). Once you get there, ask the bartender to direct you to Table 49, then come over and introduce yourselves.  \n_Fun-Time Activities:_ This week I'm showing up with Veer's latest promo. It's a jigsaw puzzle. And what could be more fun than sitting in a pub, assembling a jigsaw puzzle??? (Or maybe Veer-folk could show up to explain why they think badly done photo collages make good marketing pieces.)\n\n"
    },
    {
      "time": "29 May 2007 — 9:28am",
      "content": "Good to know if I ever have a reason to pass through more than your airport. I was hoping to come down for Stamped week but am too late in booking time off for it.\n\n"
    },
    {
      "time": "29 May 2007 — 12:20pm",
      "content": "You don't want to come here for Stampede anyway -- too many crazy people and businesses jack up their prices to rip off tourists.\n\n"
    },
    {
      "time": "30 May 2007 — 8:07am",
      "content": "I like Calgary during Stampede. The city gets all tingly with excitement, and there's a lot of things to do. Granted it isn't the city-wide party it was 15 years ago. But I would recommend it as a good time to visit. Bring raingear, though. The weather is Calgary is very fickle in June.\n\nAnd stay away from the crazy people.\n\n"
    },
    {
      "time": "30 May 2007 — 8:17am",
      "content": "_The weather is Calgary is very fickle in June._\n\n(And July, when Stampede is. ;-) You sure you need beer tomorrow?)\n\n_And stay away from the crazy people._\n\nOf which there are many. :-( And the only beer you can get on the grounds tastes like they took the stall bedding and wrung it out. Blech.\n\nBut in general, I like Stampede too -- I must, or I wouldn't keep working as a volunteer at it.\n\nAnd not just for the mini-donuts.\n\n"
    },
    {
      "time": "30 May 2007 — 8:23am",
      "content": "Dang. Linda, are you telling me Stampede isn't a 2-month experience? :-)\n\n"
    },
    {
      "time": "30 May 2007 — 8:25am",
      "content": "Well, the hangovers used to be, back in the bad old days.... ;-)\n\nAnd it can take awhile to scrape all the horse poop off one's boots (although one could also say that lately for a few threads around here....).\n\n"
    },
    {
      "time": "31 May 2007 — 8:25am",
      "content": "_Dang. Linda, are you telling me Stampede isn’t a 2-month experience? :-)_\n\nAnd here I thought it was cowboys all the time. :P\n\n"
    },
    {
      "time": "31 May 2007 — 8:33am",
      "content": "Jonathan, why aren't you on the plane already? We've got a place reserved for you at the table tonight. Let me know when your flight arrives and I'll pick you up at the airport.\n\nDon't worry about packing the cowboy hat. Yet. :-)\n\n"
    },
    {
      "time": "31 May 2007 — 8:41am",
      "content": "In some ways it still is -- you can see men in dress western suits and boots in the corporate world, but not like it was when I was a kid (far too many years ago).\n\nUnfortunately, there's a serious push on to make the whole \"Stampede Experience\" (blech) warmer, fuzzier, and a whole lot less \"icky\" and \"offensive\" to city slickers. :-(\n\n(You can still learn to milk a cow at Stampede, except it's a full-sized, plastic cow so no one -- cow or human -- gets hurt. And if you go into the barns, there's all kinds of signs around saying no one is liable if anything happens, and \"don't forget to wash your hands when you leave.\" That sure wasn't how the west was tamed: a century ago, men were men and sheep were nervous.)\n\n"
    },
    {
      "time": "31 May 2007 — 11:16pm",
      "content": "A short report after a successful meeting:\n\nWe managed to assemble a goodly portion of Veer's jigsaw puzzle. We were hampered by the overall painted artwork on the surface of Table 49. It interfered with the {same color palette of the} puzzle. There was some beer drinking and throwing of jigsaw pieces involved. But the typographic bits of the puzzle got done.\n\nWe're sending a package off to Veer which includes a large portion of the puzzle (assembled or not), some beer-stained coasters, and possibly a few well-gnawed chicken bones.\n\nLex was unavailable because of previous commitments, so we put his name to the courier waybill.\n\n"
    },
    {
      "time": "6 Jun 2007 — 12:08pm",
      "content": "Sorry, I’m so late to the party Ken.\n\nI’ll keep my eyes peeled for the puzzle (and chicken) parts.\n\n"
    },
    {
      "time": "6 Jun 2007 — 12:37pm",
      "content": "_you can see men in dress western suits and boots in the corporate world, but not like it was when I was a kid_\n\nThe eastern/southern version of a classic summer biz style would be the pink/powder blue seersucker suit. And a bow tie. When I first arrived in T.O. in the 1970s, there would still be a few around on Bay St. The summer version with shorts and a straw hat, maybe even a boater (very Mad. Av.) was way cool. But I guess you could wear seersucker with cowboy boots and a Stetson? No doubt Veer has a stock shot...\n\n"
    },
    {
      "time": "6 Jun 2007 — 12:54pm",
      "content": "Location Change (for any interested parties):\n\nStarting next Wednesday, the 13th, We will be meeting (perhaps monthly) at the Kensington Pub. In the north room. Anybody in Calgary, or passing through Calgary, who is interested in typography or typophile is welcome.\n\nNick, if you show up wearing a pink/powder blue seersucker suit (with bow tie) and cowboy boots and a Stetson, you're still welcome. And if it's during Stampede, you'll probably fit in!\n\n"
    },
    {
      "time": "6 Jun 2007 — 12:58pm",
      "content": "Given the new location is less than a 10-minute walk from Veer, we expect to see you next week, Grant. :-)\n\n"
    },
    {
      "time": "6 Jun 2007 — 1:40pm",
      "content": "you two aren't going to have anything left to talk about tomorrow.\n\n"
    },
    {
      "time": "6 Jun 2007 — 2:14pm",
      "content": "There is **always** Thursday Drinkin' Night. And now, starting next week, there will be Wednesday Drinkin'+Typography Night. Oooooohh, my social calendar is filling up :-)\n\n"
    },
    {
      "time": "12 Jun 2007 — 7:46am",
      "content": "Just bumping this to remind anybody interested that the Calgary typophiles are meeting tomorrow, Wednesday, at the Kensington Pub, in the north room.\n\nMostly, we talk about things typographic. But it's also a social, and everybody is welcome.\n\nThe Kensington Pub is nowhere near Cowboys Nightclub, so we're not expecting a visit from Prince Harry.\n\n"
    },
    {
      "time": "12 Jun 2007 — 8:03am",
      "content": "And Sammy would likely punch him out rather than kiss him anyway -- she's one tough bartender.... ;-)\n\n"
    },
    {
      "time": "13 Jul 2007 — 12:18pm",
      "content": "A gentle bump for our monthly meeting. The Stampede will be over, so we won't need to discuss Ponderosa, Playbill or Rosewood.\n\n ![](http://web.archive.org/web/20131017022520im_/http:/typophile.com/files/CalTypos2_5344.gif)\n\n"
    },
    {
      "time": "13 Jul 2007 — 1:46pm",
      "content": "The phrase 'after work' and the word 'typophiles' really don't work well together.\n\n"
    },
    {
      "time": "13 Jul 2007 — 4:21pm",
      "content": "Yeah, well, we do \"talk shop.\" ;-)\n\n"
    },
    {
      "time": "14 Jul 2007 — 8:04am",
      "content": "Simon, point taken. We'll add that to the agenda for discussion.\n\n"
    },
    {
      "time": "14 Jul 2007 — 9:11am",
      "content": "Before or after the second round? ;-)\n\n"
    },
    {
      "time": "18 Jul 2007 — 10:08am",
      "content": "(bump)\n\nIf you're in Calgary, bring your post-Stampede hangover to our monthly beer night this evening. :-)\n\n"
    }
  ]
}
