{
  "id": "34090",
  "title": "Typeface suggestions please",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nI’m looking for the ideal typeface to put my name - Benjamin Knight - in. I started by looking at the usual suspects... Helvetica and Univers and Futura etc. Heldustry wasn’t bad. But they just don’t look right. It might be that the particular combination of letters in my name just doesn’t look good. Any help is much appreciated.\n\nIt’ll be on letterheads and business cards etc etc. But also on - interlaced - tv screens... so best not to go thinner than medium weight, lest it disappear between pixels. Sans serif is probably better, but I could be talked round. I want something that looks reasonably slick and masculine; sort of the Michael Mann of typefaces.\n\nAny ideas?\n\nThanks in advance,\n\nBenjamin.\n\n [‹ Contemporary Caslon-like font](http://web.archive.org/web/20080829231736/http:/www.typophile.com/node/34099 \"Go to previous forum topic\") [mixing two sans serifs legit? ›](http://web.archive.org/web/20080829231736/http:/www.typophile.com/node/34074 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829231736/http://www.typophile.com/user/18851\" title=\"View user profile.\">BenjaminKnight</a>",
  "time": "<br>",
  "uid": "18851",
  "comments": [
    {
      "time": " 29.May.2007 8.33am",
      "content": "With an upper K and lower j and i’s, I’d think that italics might suit you? Not a script, certainly, but I am sure there is one that is still ’manly’ and solid enough to work?\n\n"
    },
    {
      "time": " 29.May.2007 9.37am",
      "content": " ![](http://web.archive.org/web/20080829231736im_/http:/www.typophile.com/files/BKn_5757.gif)\n\nhhp\n\n"
    },
    {
      "time": " 29.May.2007 9.54am",
      "content": "It is a very clever solution Hrant, very impressive!\n\nA.\n\n"
    },
    {
      "time": " 29.May.2007 10.21am",
      "content": "[FF Sanuk](http://web.archive.org/web/20080829231736/http:/fontshop.com/fonts/downloads/fontfont/ff_sanuk_md_lf_tf/&sample_text=Benjamin%20Knight&sample_size=48) could be a fun sans for this.  \nOr [Process Maple](http://web.archive.org/web/20080829231736/http:/fontshop.com/fonts/downloads/process/maple_medium/&sample_text=Benjamin%20Knight&sample_size=48).  \nOr something new and [totally different](http://web.archive.org/web/20080829231736/http:/typetease.emigre.com/cgi-bin/fontRender?action=set&fontList=MalagReg.ttf,MalagMed.ttf,&fontSize=0&renderText=Benjamin%20Knight)?\n\nThere are many faces that would look good given the sequence of letters, but since it’s going to serve as your personal identity, you alone must find the right fit.\n\n"
    },
    {
      "time": " 29.May.2007 10.39am",
      "content": "Thanks Ayse!  \nBTW Benjamin, more than Trajan what I’m really suggesting is that “KN” metaligature\\*. If you like it, when you arrive at what font you’d like to use, I could easily make a glyph like that in that font (and being a type designer I would make it balanced and polished, which is harder than it might seem, except for the most modular of fonts). Cost: US$50.\n\n\\* [http://typophile.com/node/14040](http://web.archive.org/web/20080829231736/http:/typophile.com/node/14040 \"http://typophile.com/node/14040\")\n\nhhp\n\n"
    },
    {
      "time": " 29.May.2007 10.51am",
      "content": "Nice work, Hrant. That would add a nice mnemonic device to the name. (In fact, you could probably do something similar to the word, _mnemonic_ .)\n\n"
    },
    {
      "time": " 29.May.2007 12.31pm",
      "content": "The word MNEMONIC allows the quite satisfactory ligature og NE. Hrant’s KN ligature is not bad at all. I wonder whether Benjamin Knight likes it.  \nLigatures and ’nested’ letters were used by Roman and Romanesque lettercutters to save space. Now we reinvent them and use them as design features. A clever student of mine, Massimiliano Frangi, found several in the Milan Cemetry. Here is one (EM, with a flipped E) from a relief Latin inscription that seems quite osé and probably dates back to the 1930s. How do you put images into this discussion?\n\n"
    },
    {
      "time": " 29.May.2007 12.38pm",
      "content": "James, I’d love to see your examples. Perhaps you should start a new thread on the subject?\n\n(To add images, make sure your cursor is in the “Comment” text area, click the “Insert image” link just below the box, then browse to the image you would like to insert. It will add a bracketed statement to your comment which will include the image in your post.)\n\n"
    },
    {
      "time": " 29.May.2007 1.12pm",
      "content": "How about a triple metaligature?\n\n ![](http://web.archive.org/web/20080829231736im_/http:/www.typophile.com/files/mnemonic_6085.gif)\n\n"
    },
    {
      "time": " 30.May.2007 12.17am",
      "content": "This works very well. I think it is a step ahead of Hrant’s interesting idea. What is needed now is a client called Mnemonic!\n\n"
    },
    {
      "time": " 30.May.2007 1.53am",
      "content": "Firstly, a huge thank you to everyone who has posted; very cool. The idea that i, j and K suggest something italic is exactly the kind of design nous I was looking for. But would you advise the same if I went all uppercase?\n\nOf the fonts suggested I like Sanuk the most. Maple is too cartoony for me. Malaga is nice too. Not sure it’s been cracked yet though.\n\nThe whole metaligature discussion is really interesting, not sure if it works for this application though; I just saw a K at first and thought you’d missed out the N. Of course - like any illusion - once you’ve seen it you can’t go back, but the fact that it took me a few seconds means it’s probably not right for the tv screen instance I mention in my original post... it’ll only be up there for a limited time.\n\nBut I was beginning to think about playing with the letters in some way... adapting them... beginning to think that there might not be a pure ’font solution’.\n\nThanks again for all your input. I’ll keep working on it.\n\nBenjamin.\n\n"
    },
    {
      "time": " 30.May.2007 7.01am",
      "content": "Scott, pretty nice! It seems kind of borderline,  \nuntil you factor in the phonetic situation there.\n\n\\> playing with the letters in some way\n\nAlways a good idea - in fact some people think a logo isn’t one  \nif you can just type it up. Just don’t go as far as the following! :-)\n\n ![](http://web.archive.org/web/20080829231736im_/http:/www.typophile.com/files/Knight_5176.jpg)\n\nhhp\n\n"
    },
    {
      "time": " 30.May.2007 8.23am",
      "content": "What is that supposed to be anyway? I think I see a squirrel in there.\n\nAs for the “mnemonic” exercise, I love the mental (optical?) gymnastics that these kinds of ligatures provoke.\n\nBenjamin, have fun with it. There just aren’t enough opportunities to be one’s own client.\n\n"
    },
    {
      "time": " 31.May.2007 7.33am",
      "content": "“How about a triple metaligature?  \n(image)”\n\nThat’s hot!\n\n"
    }
  ]
}
