{
  "id": "34091",
  "title": "A Typophile's Exercise Program",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m curious, **what do the rest of you do to stay in shape?**\n\nI currently live a pretty sedentary lifestyle, work several hours a day in front of a computer sitting on my posterior and getting little to no exercise.\n\nI’m wondering how many of you have shared my fate and were able to make modifications to successfully achieve a healthier more active lifestyle?\n\nI’m hoping to be inspired and possibly learn about some new activities. I’m not necessarily excited about going back to the gym. Please enlighten me.\n\n_Sorry about the absence of type talk in this discussion._\n\n [‹ P is for portfolio](http://web.archive.org/web/20070911194837/http:/typophile.com/node/34202 \"Go to previous forum topic\") [Recognise this typeface? ›](http://web.archive.org/web/20070911194837/http:/typophile.com/node/34211 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911194837/http://typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 29.May.2007 8.57am",
      "content": "I hit the gym regularly, for long periods of time. For a while I was down to four days a week, but now I’ve pushed back up to six days a week of intense bodybuilding workouts followed by time on the elliptical trainer, for a total of around 12-14 hours a week. If I don’t work out like this I get (more) misanthropic and my entire body starts to cramp, twitch, and be generally unfriendly toward my lifestyle of curling up in front of books and computers.\n\nOn top of the gym time I also walk to and from work (and just about everywhere else that I go) and walk my dogs several times a day.\n\n"
    },
    {
      "time": " 29.May.2007 9.02am",
      "content": "I hate going from being inside behind my computer, to being inside at a gym, I get OUTside to clear my head and have more fun ( I also live in paradise; my own opinion of course). I get most of my work done in the early AM, but still take a break in between there to go on a steady sprint single track bike ride.\n\nHaving a dog helps alot, because she lets me know that I better take her out two to three times a day. Start swimming, find a hobby, take up trail running, surfing, road or MTB biking, rock climbing, sky diving, anything. I just had to find another passion and stick with it.\n\nYou can be real meaty like myself and crank out pushups and turn it into a game, who doesnt like pushups anyways. Working out is just as mental as design. Its EASY for us (to some extent) to sit behind a computer and work, and dread getting excercise, but if you do it enough, you long for the excercise, and more over NEED it. Stop thinking about it and go do it. GO. DO. BE. once you get into the routine its like figuring out your design process, it just works.\n\n"
    },
    {
      "time": " 29.May.2007 9.39am",
      "content": "Wow Jpad, are you an amateur bodybuilder? That’s a pretty intense week of weights. Your six pack has a six pack doesn’t it?\n\nJames, were you always an outdoorsy type of person or did you decide one day to make a change to try and be more adventurous? I agree with the idea of finding something active that I can be passionate about and then incorporate it into my routine. I’m not making the necessary changes to accommodate this idea yet and I really should just do it.\n\n"
    },
    {
      "time": " 29.May.2007 9.48am",
      "content": "Have kids.\n\nhhp\n\n"
    },
    {
      "time": " 29.May.2007 10.05am",
      "content": "I use public transport, bicycle (season permitting) and steps, avoid lifts and escalators, and carry my groceries home from the supermarket (it’s close, but there are four of us...). I also do chen taiji 2-4 times a week, go swimming and for walks every now and then.  \nI should do more and eat less, and spend less time at the computer.  \nMy better half does a certain amount of sit-ups and push-ups every morning (+ a lot of walking), I wish I was as organized!\n\n"
    },
    {
      "time": " 29.May.2007 10.07am",
      "content": "I don’t get enough exercise, to be honest. lol. I spend a lot of time sitting at the computer lately, for work, too busy. Next to that I draw alot, watch movies and go to school. My only exercise at the moment consists of riding my bike to school, which is only about 30 mins in all daily, and walking to the city and back.  \nOh well, it has been (even) worse and it has been better. I have about 3 months of holidays coming up in about 3 weeks, so then I will take long walks and such. :)\n\n"
    },
    {
      "time": " 29.May.2007 10.09am",
      "content": "no substitute for progressive resistance training... at least 3 times a week, combined with a nutritious, calorie-controlled diet, plus some outdoor activities to keep you sane, oh, and plenty of sleep!\n\nit will only take up a small percentage of your life, but it will make the whole of your life more enjoyable and productive\n\n"
    },
    {
      "time": " 29.May.2007 11.04am",
      "content": "<cite>Your six pack has a six pack doesn’t it?</cite>\n\nHopefully I’ll get there one day. I ended up working out to train for a week of biking in Provence and found that the exercise nipped most of my health problems in the bud, and that adding in more resistance training gave me a sunnier outlook on...everything. The harder I work at the gym, the better I feel everywhere else, so now I’m starting to really push my workouts.\n\nAlso, learning a lot about exercise has also taught me a lot about eating better. I have a pretty fast metabolism, so I have to make sure that I eat right to fuel every little bit of exercise. Cutting all that crap out of my diet compounds all the benefits of exercise. When I get really strict about it I feel almost as good as I do after a week in France, where even the junk food is healthy compared to the crap on the shelves here in the USA.\n\n"
    },
    {
      "time": " 29.May.2007 11.18am",
      "content": "Now that the warm weather has come, I throw my canoe on my yj and go find some water almost everyday. Anything from still waters like swamps and lakes, up to class 2 rivers will do.  \nAnd when I’m not out with my canoe, I head straight into ’the bush’ and hike around - sometimes for days on end. I always take along a sketch book and me old pentax k1000 - design ideas are everywhere.\n\nIn winter it’s hockey and snowshoeing.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": " 29.May.2007 11.24am",
      "content": "I really appreciate all the responses. I’m actually surprised about how active everyone is, and I’m jealous (in a good way) of you all. I’m trying to get myself psyched up to get back in shape.\n\nI’ve been doing my homework, reading up about exercise and diets.  \nI’ve tried to alter my diet to include more protein and reduce unnecessary sugars and processed carbohydrates. However, I’m still lax about how much I eat and I definitely don’t get enough fruits and veggies. I also have a penchant for whole grains.\n\nApparently, 30 minutes a day, 3 days a week would be plenty if I focus on building muscle mass (which would in turn burn calories faster.) and then getting plenty of rest (which is currently not a problem.)\n\nIn the past, I would spend most of my time at the gym on an Elliptical machine, and after a few months, I’d dreaded going. I ended up stopping mid-Fall, mixed with my lack of enthusiasm and the crumby weather, I never returned. Now I’m easily 15lbs heavier and tired all the time. I’ve realized how much not exercising has affected me and I wish I would have been more diligent. It’s going to be a tough transition back into an active lifestyle, but I’ve done it before. I know after about 2 weeks, I’ll be re-energized and hopefully more motivated to continue. It would be nice to have someone to keep me in line though.\n\n"
    },
    {
      "time": " 29.May.2007 11.32am",
      "content": "I like squash. And biking. Squash gets me through the winters. Biking gets me outdoors.\n\n"
    },
    {
      "time": " 29.May.2007 11.36am",
      "content": "Cardio machines are mind-numbing on their own. At my gym nearly everyone using them is simultaneously reading. If you’re lucky enough to find a gym without loud ambient noise and music, try listening to some of the various type and design podcasts on the net while you chug away.\n\n"
    },
    {
      "time": " 29.May.2007 11.48am",
      "content": "<cite>...while you chug away.</cite>  \nI plan not to chug away, or atleast not at the frequency of which I used to.\n\nGood idea, but I don’t think I could listen to a podcast while I work out. I need loud music, preferably with a fast beat. In the past, I would listen to DFA1979, a great mix of rock and electronic. I’ll have to find some new stuff to fill the iPod with, maybe some classics, like the Stones, or something new like Justice. As long as it’s upbeat.\n\n"
    },
    {
      "time": " 29.May.2007 12.01pm",
      "content": "Slightly off-topic: ten years ago I purchased the best top-of-the-line ergonomic chair I could find. I figured sitting in some beat-up, posture-killing piece of used office trash for eight+ hours a day was contributing to my decline in well-being. (I’m happier now and so is my back.)\n\n"
    },
    {
      "time": " 29.May.2007 12.16pm",
      "content": "I used to backpack in summer and ski in winter all the time, but a series of injuries has kind of curtailed most of that. So I golf, and we’re taking up curling this fall.\n\nAnd we walk most places and use our bikes — not owning a car (by choice) means we also haul groceries and recycling by hand. Like Mili said, lots of stairs as well (not hard when you live on the top floor of a walk-up building!).\n\nOne of the biggest changes we’ve done in the last five years is eating better: fresh local meat and produce, as few processed foods as possible (but I won’t give up dark chocolate), and a vegetarian “day” at least once a month. We rarely do take-out and never McD’s: we could probably do more grains and less booze, but there’s no reason to get that keen. ;-)\n\n"
    },
    {
      "time": " 29.May.2007 1.52pm",
      "content": "We don’t own a car, so I walk to and from work every day, about 15 minutes each way. Either walk or bike to the grocery store (2km each way) then carry it all back, usually in a backpack. Also have 2 sled dogs, so that ads about another 45min-1hr or walk/run/jog at night and 1km in the morning if I have to do it, otherwise my wife takes them out.\n\nNow that it’s nice our I’ll bike a few places, but never really for ’fun’ only as a means of transportation. Also soccer is starting up and I play midfield, so it increases how much I run by a lot. Speaking of which, I am walking like a peg-leg today because my calves are so sore from Sunday’s pick-up game.\n\nIn the winter we’ll snowshoe, ski and skijor with the dog, dogs now, but we just got the second one. We also hike all year round, and hopefully this summer we’ll get into doing some rock climbing. We love canoeing but don’t own a canoe or car.\n\nI don’t really do much with the intent of getting in shape or anything, especially with 2 wrecked knees, these are just activities I enjoy. I’ve never been to a gym and would be lost in one, I think.\n\n—\n\n@ Linda: I’ve recently started taking glucosamine tablets and it’s made a huge difference on my knees. The pain isn’t as sharp and I can get more done, I find, w/o them bothering me.\n\n"
    },
    {
      "time": " 29.May.2007 2.14pm",
      "content": "It sounds as if a lot of you are in nice little villages right next to a huge forests in the Great White North. I wish I lived in a location where a car was optional, it’s such a burden sometimes. Course there are times when I couldn’t stand not having a car to help me excape.\n\n"
    },
    {
      "time": " 29.May.2007 2.43pm",
      "content": "Calgary’s a city of 1 million, so it isn’t a pimple on the prairie anymore (which is somewhat unfortunate, actually). And we do rent some weekends to get up to the mountains, although it’s just as cheap to take Greyhound, when you factor in gas, etc.\n\nBut you could do a lot worse than Harrisburg — the Adirondack Trail is practically on your doorstep.... ;-)\n\n"
    },
    {
      "time": " 29.May.2007 4.17pm",
      "content": "quit booze for a few weeks, youll lose all the fat you want. . . cept had less fun!\n\nI’ve always loved the outdoors, but until recently havnt had the $$ to pay for the hobbies. IE a season pass at Squaw Valley is just over $1,000, imagine skiing in the middle of abig project, just hit a couple of runs and come back in. Mountain biking is a passion, and its even more expensive for the bike and regular maintenence, but like getting a new office setup, once you splurge, then your set to have some fun.\n\n"
    },
    {
      "time": " 29.May.2007 4.39pm",
      "content": "I bike. And since I love speed, I go out and boot it for an hour or so. There is nothing, for me at least, like the high I get from going as fast as I can on my bike. Best is in the morning when there are fewer people on the bike paths and it’s usually cooler, too. I wish I could bike to work every day, but I drive my kids to and from school and daycare 3 or 4 days a week, so on the off days, I try to bike, or I walk to the metro station. Sometimes, if I’m wearing appropriate shoes, I’ll walk home at a brisk trot.\n\nIn the summer I also try to go to the outdoor pool and do an hour of laps 2 or 3 times a week. Doesn’t always work out because of the schedule with the kids, tho. I’ve been trying to improve my breathing — doing consecutive laps without panicking is a challenge I’m working on.\n\nOn my lunch hour twice a week, I go to a yoga class given by the university’s athletics and recreation dept. They offer a ton of classes and I’ve been thinking that next winter I will try the spinning class, tho I’m sure it won’t live up to cycling. Also the university’s gym and classes are WAY cheaper than regular gyms.\n\nAnd, once a week I have a 2 hour tango class with my guy and we also go dancing (tango) on Friday night every second weekend. Problem is, the alcohol consumed on those nights cancels out any of the calorie-burning potential, I’m sure. But as a side note, learning tango can be a great way to meet people — and I mean friends, too.\n\nMmm and every once in a while my boyfriend drags me down to the dungeon to lift weights. I find it brutal, but it feels great afterwards. I don’t quite have the discipline or motivation for the 4 days a week at 6am routine, though.\n\nI live in central Montreal in one of the neighbourhoods that will be trendy ten or fifteen years from now, but for the moment is still exhibiting signs of welfare, social housing, and general poverty. Ain’t no green forests around here.\n\nK.\n\n"
    },
    {
      "time": " 29.May.2007 6.00pm",
      "content": "I hate the outdoors mostly. Bugs. I hate bugs. But I have a largish dog so I walk for at least 2 hours everyday. And I do at least 20 min (40 if i have time) of yoga every second day. And I don’t eat trash.\n\nThats pretty much it. Not too intense.\n\n"
    },
    {
      "time": " 30.May.2007 12.08am",
      "content": "Asvetic, I live in Helsinki, the capital of Finland, and thanks to the well-functioning public transport I don’t need a car. Things would be different if I lived almost anywhere else in this country, especially in a remote village. Mind you, I suppose this place almost fits the definition of a remote village, since in the whole of capital area there are 1 million people and in Helsinki only 0,5 mil. with plenty of forest and water around.\n\n"
    },
    {
      "time": " 30.May.2007 1.52am",
      "content": "I continuously PLAN to get exercise, but never do… My girlfriend tells me every day she’s worried about me ’not moving at all’. And she’s right. I used to play squash (until I tore a calfmuscle) and before that swam (until someone jumped on me and I almost lost an eye).\n\nWe just bought another place in Amsterdam (about 140 kms from where my main residence is) and plan on staying there a week or so per month. There’s a public bath nearby, so I might take up swimming again. And walk a lot along the canals, ofcourse.\n\nFoodwise we are doing great — no junk, lots of fresh vegs, little meat. But I do like a glass of white wine, so…\n\nLast year, when I was separated from my wife, I lost a lot of weight because of the stress of that situation and workrelated problems (and gained all of that back after I stopped working and hooked up with the love of my life). Nowadays most of the stress from my existence has been eradicated, so it looks like I will have to take that advice and get moving. ; ).\n\n"
    },
    {
      "time": " 30.May.2007 3.05am",
      "content": "I try and jog with a mate three times a week getting up while it’s still dark. I think getting a friend on board is a good move, it’s so easy to lose your motivation if you’re not accountable to anyone. We tend to cancel out each other’s lack of motivation\n\n—N\n\n"
    },
    {
      "time": " 30.May.2007 4.59am",
      "content": "I’m like you - I sit in front of this computer and the weight over the years have crept up on me. Sometimes I look in the mirror and I cannot believe what I’ve done to myself.\n\nDeath works great for me as a diet. Everytime I lose anyone close, the pounds come off because I can’t eat or sleep for days.\n\nWhen I first got Bogie (pup on right side)— I walked him 6 times a day - and within two months I was down two dress sizes.\n\nOllie comes tomorrow - I am so looking forward to all our puppy walks together.\n\nMy advice - get a pet to walk (or borrow one) keep up the routine and it will do you a world of good.\n\nOh and to be ethically/politically/legally or whatever correct - please consult your doctor before starting any rigorous exercise program. :-)\n\n"
    },
    {
      "time": " 30.May.2007 5.11am",
      "content": "Ascender Corp runs and loses weights... the Shaiman has lost a lot. And Rickner and Matteson are bicycle riders.  \n [http://www.flickr.com/photos/adamt/29578792/](http://web.archive.org/web/20070911194837/http:/www.flickr.com/photos/adamt/29578792/ \"http://www.flickr.com/photos/adamt/29578792/\")\n\nand typecon dance contest keeps some geek types fit.  \n [http://www.flickr.com/photos/sheritagirl/29355600/in/pool-typecon/](http://web.archive.org/web/20070911194837/http:/www.flickr.com/photos/sheritagirl/29355600/in/pool-typecon/ \"http://www.flickr.com/photos/sheritagirl/29355600/in/pool-typecon/\")\n\n"
    },
    {
      "time": " 30.May.2007 5.43am",
      "content": "Well, now I don’t feel so bad. There’s a few Typies that are in the same boat with me and we all have short oars.\n\nI’ve never had a pet, and my current living arrangements prevent me from having any. I do take walks with a friend who has 2 small pugs. They’re a handful, but I enjoy the challenge of keeping them in line while we try and trek a decent distance. Maybe in the near future I’ll consider getting a puppy of my own.\n\nI don’t actually live in Harrisburg, but one of it’s smaller neighboring suburbs. There’s not much here except a bunch of houses. I walk as much as I can, but it does get repetitive. I’ve exhausted most of my common routes and there aren’t too many new ones. There’s a few parks in the area, but the closest is about a 20 minute car ride. I try and get out as often as I can, I actually like to play Disc Golf (Frisbee Golf to the layman) when I can.\n\nLinda you were close, I live near the Applachians not the Adirondacks.\n\n"
    },
    {
      "time": " 30.May.2007 5.56am",
      "content": "Is Disc Golf fun and/or difficult? Do you need a lot of discs to play it and how are they chosen? There is a track within walking distance from where I live, perhaps I should try it sometime.\n\n"
    },
    {
      "time": " 30.May.2007 6.05am",
      "content": "I swear by cycling for exercise, but really, it’s as much a hobby as it is a workout.  \n [http://www.flickr.com/photos/krautwald/sets/72157600221610852/](http://web.archive.org/web/20070911194837/http:/www.flickr.com/photos/krautwald/sets/72157600221610852/ \"http://www.flickr.com/photos/krautwald/sets/72157600221610852/\")\n\n(off-topic, is there a typophile flickr group?)\n\n"
    },
    {
      "time": " 30.May.2007 6.38am",
      "content": "_Linda you were close, I live near the Applachians not the Adirondacks._\n\nROFL: true enough, but it’s been ten years since I lived in suburban VA. At least they both begin with “A”. ;-) We used to go up to Catoctin Park a lot — lots of good hiking there.\n\n_(off-topic, is there a typophile flickr group?)_\n\nThere are certainly other Typophiles with Flickr sites: Tiff’s is huge.\n\n"
    },
    {
      "time": " 30.May.2007 7.48am",
      "content": "<cite>Is Disc Golf fun and/or difficult? Do you need a lot of discs to play it and how are they chosen? </cite>\n\nWell, I’ll try and give you a broad answer. Disc Golf is definitely fun, and if you understand the concept of golf, it’s also pretty easy.\n\nYou do not need a lot of discs. Your needs might differ, some people play with 1 or 2 discs, others with 30. It all depends on how much you get into the sport.\n\nThere are 4 types of discs. Distance Drivers (Very Long Drives, but not always accurate. Most driver discs look very aerodynamic with a sharp edge), Fairway Drivers (Shorter Drives, but much more reliable accuracy wise), Approach Discs (These are the brute discs, good for mid to short ranges or out of dense forest/wooden areas. The edge of the disc isn’t as sharp) and finally Putting discs (Similar to the Approach Discs but made to fly very accurate only at short ranges, they look the most like a common Wamm-O Frisbee with a very blunt edge.)\n\nMy advice, spend $10-20 bucks (they’re cheap) and pick up at least 2 discs. A Driver (Fairway preferably) that weights about 10-11 grams (this is a safe starters weight) and an Approach/Putter that weights about 10-13 grams with a soft/pliable feel, almost like rubber if you can find one.) The weight is marked on the underside of the discs usually.\n\nHere’s a PDF chart for selecting [Innova Driver discs](http://web.archive.org/web/20070911194837/http:/www.innovadiscs.com/downloads/2006_driverweb.pdf) and [Approach/Putter discs](http://web.archive.org/web/20070911194837/http:/www.innovadiscs.com/downloads/2006_midweb.pdf).\n\nThere’s also a few different ways to throw the discs (Cross Step, Side Arm, Hammer and Roller) but it’s hard to discribe them in words.\n\n(here’s a PDF of illustrations on how to throw : [Innova Throwing Chart](http://web.archive.org/web/20070911194837/http:/www.innovadiscs.com/downloads/ThrowingCharts.pdf) and a list of [Youtube videos on Throwing](http://web.archive.org/web/20070911194837/http:/www.youtube.com/results?search_query=Throwing+disc+golf&search=Search).\n\nI hope this gives you an idea of what’s involved with Disc Golf. If you’d like to find other courses/events in your area check this [Course Directory](http://web.archive.org/web/20070911194837/http:/www.pdga.com/course/index.php).\n\n"
    },
    {
      "time": " 30.May.2007 7.57am",
      "content": "Amen to the disc golf! Too bad there is a bar right next to our course.\n\n"
    },
    {
      "time": " 30.May.2007 8.03am",
      "content": "We lived near a course in DC — looked like a lot of fun, but I never gave it a shot.\n\n(Edit: and it turns out we have quite an organization for it here, with the Alberta Open being played in three weeks. Sure cheaper than regular golf.)\n\n"
    },
    {
      "time": " 30.May.2007 8.34am",
      "content": "I’ve played a few of the courses down around DC, they’re nice. I’ve only had to pay to play once, in California. But that was to get into the protected national forests out there. Disc Golf definitely is the poor man’s golf. If you’re new to the sport, expect to see a lot of bohemian hippie types on the course.\n\n"
    },
    {
      "time": " 30.May.2007 9.09am",
      "content": "So I’ll fit right in if I wear some tie-dye and my Birkenstocks? ;-) Certainly the equipment is considerably easier to tote around.\n\nThe big course here requires you to become a member to play (although it’s reasonable), and that’s where the city league and the provincial championships are being played.\n\n"
    },
    {
      "time": " 30.May.2007 9.43am",
      "content": "Four time a week a 4 pm I take my bike and I go play 2 or 3 hours at beach volleyball in Jeanne-Mance Park in Montréal and two time a week a go swimming.\n\nThats the deal I made whit my self, you dont want to stop smoking at least your are going to be in shape.\n\n"
    },
    {
      "time": " 30.May.2007 10.18am",
      "content": "I play hockey. But that’s beginning to hurt.\n\nSo, I think it’s back to running twice a week with coworkers at lunch and biking with the kids on weekends.\n\n"
    },
    {
      "time": " 30.May.2007 10.45am",
      "content": "Stay in shape ??? Wouldn’t that involve getting into shape first?\n\nActually, round is a shape, isn’t it? So I guess sitting in front of the TV eating snacks is how I maintain my shape.\n\nYeah, I know, I am going to die someday. But so will all the fit people. (I’ll just make all the pallbearers do a bit more work.)\n\n"
    },
    {
      "time": " 30.May.2007 12.14pm",
      "content": "yeah, have kids...  \nDon’t drive, walk or ride a bicycle.  \nOn my side, I also do yoga (check out [www.yogatoday.com](http://web.archive.org/web/20070911194837/http:/www.yogatoday.com/ \"www.yogatoday.com\"), there is one new (free) yoga class in video to download everyday...), meditation, and I snowboard and surf whenever I can.\n\n"
    },
    {
      "time": " 30.May.2007 12.18pm",
      "content": "Thanks for the info, Asvetic! From your link I found out that I live near three Disc Golf tracks, all free.\n\n"
    },
    {
      "time": " 30.May.2007 12.22pm",
      "content": "I run, swim, do soccer coaching and ski to keep up with  \nmy older boy. The question is, when the younger one is  \nold enough, will I be exercising twice as much or half  \nas much? I’m just happy about the weather here I guess.\n\nhhp\n\n"
    },
    {
      "time": " 30.May.2007 12.22pm",
      "content": "I’ve always been intrigued by yoga. I more interested in the flexibility and stretching aspect of yoga. Should I consider anything before jumping into yoga, especially since I’m not very flexible, in fact I bend, just in the opposite direction.\n\nDon, you’re a rare bred, how do you like your steak? With plenty of beer I presume.\n\n"
    },
    {
      "time": " 30.May.2007 6.22pm",
      "content": "I tried disc golf once, and had a blast. We played in a nature reserve forest on an island somewhere near Vancouver on this privately owned property that a pal was overseeing as a forest ranger. He had developed the course himself, and it wove between the huge tree. I’m not sure any other kind of course would quite live up to that first experience. Also I can’t throw for sh\\*t.\n\nI love yoga. There are different kinds, so find out before you try it — or not. Jump in and see if you like it. Any good teacher will respect your level of flexibility. There will be others able to go way further into the posture, but you go at your own pace and to the point where you can without hurting yourself. The other thing with yoga that many people don’t realize is that it also builds strength. You can certainly build up a sweat in even a very mild class.\n\nGood luck!\n\n"
    },
    {
      "time": " 30.May.2007 6.38pm",
      "content": "do you realize how far it is between the frig and couch? i must walk miles everyday.\n\n"
    },
    {
      "time": " 30.May.2007 7.04pm",
      "content": "And lifting up those cans can really strengthen your biceps.\n\n"
    },
    {
      "time": " 30.May.2007 7.12pm",
      "content": "like you wouldn’t believe. (unfortunately, since they’re a little heavy, i usually opt for the sippy-straw hat, so i don’t get all the lifting benefits)\n\n"
    },
    {
      "time": " 30.May.2007 7.17pm",
      "content": "I have a bike with flat tires and yoga clothes getting wrinkles in my drawer.\n\nLinda, you need to remember to alternate hands with those cans.\n\n"
    },
    {
      "time": " 30.May.2007 7.35pm",
      "content": "I try to, but after the first six, I forget — you know how it goes.\n\nChuck, you need to do more with the ice bucket you take outside. Trust me, it works!\n\n"
    },
    {
      "time": " 30.May.2007 7.46pm",
      "content": "To add to Kristina’s comment, yoga not only builds flexibility and strength but also balance, both physical and mental. I agree you need to ease your way into it, tho, try different kinds and different teachers and don’t push yourself too hard. You can hurt yourself if you get all macho and do things your body really doesn’t want to do. I absolutely love it, but my favorite teacher had a baby and I never got back into the swing of it, my bad.\n\nProblem for me too is that when I have time off from working I want to paint, not exercise. But I’m not getting younger...\n\n"
    },
    {
      "time": " 31.May.2007 1.03am",
      "content": "a) Live in New York or a city where you have to walk 30+ minutes a day just to get around. Or, b) Get a dog and walk him/her for 40 minutes a day.\n\nI’ve done both, but now having a dog I’ve gotten to actually know some of my neighbors — which almost never happened in New York. Sometimes I even walk my son and my dog at the same time.\n\n"
    }
  ]
}
