{
  "id": "34120",
  "title": "Day of the Dead movie logo",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20141228174732im_/http:/typophile.com/files/day_of_the_dead_font_4080.jpg)\n\nI'm pretty sure I found this one in a movie magazine as well. Pretty characteristic with the serifs and all, but I haven't been able to find the right font yet. Any ideas?\n\nm.\n\n",
  "author": "kellerman",
  "time": "30 May 2007 — 6:42am",
  "uid": "18875",
  "comments": [
    {
      "time": "30 May 2007 — 7:05am",
      "content": "Might be custom, movie titles often are & if you look closely at the first & second D of \"dead\", the serifs seem to be shorter in the second. The small E from \"the\" only seems to have a downword middle serif as opposed to the E from \"dead\".  \nGreat trilogy though & even the remake of \"Dawn of the dead\" was not as bad as many people claimed it was. And everybody just hàs to love \"Shaun of the dead\"! ;-)\n\n"
    },
    {
      "time": "30 May 2007 — 7:20am",
      "content": "[Latin Wide](http://web.archive.org/web/20141228174732/http:/www.myfonts.com/fonts/linotype/latin/wide/) could easily have been the starting point (or H&FJ Saracen). Then it might have been 'eroded' graphically.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "30 May 2007 — 7:33am",
      "content": "Maybe. But it could just as easily be the very poor scan. If it is a custom design, I'm fairly sure the magazine just pulled off a poster or something.\n\nI had assumed it was the new movie [http://www.impawards.com/2006/day\\_of\\_the\\_dead.html](http://web.archive.org/web/20141228174732/http:/www.impawards.com/2006/day_of_the_dead.html \"http://www.impawards.com/2006/day\\_of\\_the\\_dead.html\") ...\n\n... but after another search it's obvious I've been looking at the wrong decade [http://www.impawards.com/1985/day\\_of\\_the\\_dead.html](http://web.archive.org/web/20141228174732/http:/www.impawards.com/1985/day_of_the_dead.html \"http://www.impawards.com/1985/day\\_of\\_the\\_dead.html\") ;-)\n\nI wonder if the magazine simply scanned the poster, rearranged the words, and reduced the height of all text. Hmm...\n\nWell, if anyone knows about a Day of the Dead font I'd be very interested.\n\nCheers!\n\nm.\n\n"
    },
    {
      "time": "30 May 2007 — 7:34am",
      "content": "\\> Latin Wide could easily have been the starting point (or H&FJ  \n\\> Saracen). Then it might have been ‘eroded’ graphically.\n\nYep. Although the A looks more like a very black Copperplate.\n\n"
    },
    {
      "time": "30 May 2007 — 7:52am",
      "content": "Since it turned out the original logo is from 1985 it's probably a custom design to begin with, and even though Latin Wide might serve as a good starting point for making a custom design oneself, I'm really looking for a font that's much closer to the Day of the Dead logo as can be seen here [http://www.impawards.com/1985/day\\_of\\_the\\_dead.html](http://web.archive.org/web/20141228174732/http:/www.impawards.com/1985/day_of_the_dead.html \"http://www.impawards.com/1985/day\\_of\\_the\\_dead.html\") or in the scan I posted.\n\nIf I remember correctly the erosion is just a bad scan, the text was probably as clean as in the poster.\n\nI tried checking out Saracen on myfonts.com but there was no preview available, and the previews on typography.com were too small to tell how close to the target this one is, and the test drive function wouldn't let me enter any text of my own. Still, I got the feeling it might be closer to the target than Latin Wide.\n\nI guess what I'm really hoping for is a modern day font version based on the Day of the Dead logo. But thanks for taking the time, nevertheless.\n\nCheers!\n\nm.\n\n"
    },
    {
      "time": "30 May 2007 — 8:02am",
      "content": "This movie is from 1985 and concluded Romero's Dead-trilogy.  \nHe was however involved in the remake of \"Night of the living dead\" & actually approached Tom Savini (who initially wanted to apply as a make-up artist for the original, but due to circumstances (I think army duty) didn't make it) personally for remaking his classic. In 2005 Romero made a fourth contribution to his trilogy (I am aware of the contradiction in my terminology BTW) called \"Land of the dead\".  \nIf anyone should be interested ;-)  \nI've seen different fonts used throughout several posters & covers for at least the \"actual trilogy\", but this was very common in those days. I've even seen promotion posters for \"Alien\" with an alien drawn on it that doesn't even resemble the one in the movie by a long shot. This was due to the fact that artists were often asked to do a poster without having seen anything or knowing anything about the movie except for the title.\n\n"
    },
    {
      "time": "30 May 2007 — 6:17pm",
      "content": "Saracen looks quite similar.  \nI also found some old font(marked as 1991?) called \"flare gothic\".  \nIt looks different from saracen, and a bit in the style of this logo.  \nNot sure if it's a renamed typeface or not though. It indicates DTC as the origin here. (I also see an alternate version called \"Flange\" from berthold 1992)\n\nIf anyone has more info, I'd be glad to hear about it.\n\n"
    },
    {
      "time": "1 Jun 2007 — 7:16am",
      "content": "You have any pictures of the font you are talking about? The only 'Flange' I know was a Les Usherwood design, which used to be offered by Scangraphic, but they changed the name to ['Flower'](http://web.archive.org/web/20141228174732/http:/www.myfonts.com/fonts/efscangraphic/flower-sh/). It's not much like the Latin serif styles, such as Saracen.\n\n[edit: NOW I see why the name was changed. Here is [Flange](http://web.archive.org/web/20141228174732/http:/www.myfonts.com/fonts/berthold/flange-bq/) from Berthold.]\n\n- Mike Yanega\n\n"
    }
  ]
}
