{
  "id": "34139",
  "title": "Stuck with my own company's logo.",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi guys. It came to a point I had to design a logo for my own company. Just when I got to do it I found out I’d rather change the name of my company. I made it too complicated for me.\n\nI’m a actually a developer but I also do design jobs (press/web/ux/ia). I used to do design as my second job but I ended up without any time of my own so I focused more on development lately.\n\nAbout the logo. I made many designs so far but I couldn’t get any “wow idea” so far. I tried all kinds of stuff (starting on paper) but ended up with some very clean and too simple logo that just has a font variation. I wanted something that makes you smile.\n\nLogo should be half serious and reflect (if possible):  \n- software solutions on Microsoft products  \n- innovation  \n- quality  \nLogo should be applicable on different mediums of different quality.\n\nSince it’s sole proprietorship company it has a rather complicated full name (EN translation):  \nInovares, innovative solutions Robert Koritnik s.p.\n\nI would be really glad to get any input from you gurus.\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/inosp_6288.jpg)\n\n [‹ Freelance Collaboration logotype](http://web.archive.org/web/20070921100547/http:/typophile.com/node/33901 \"Go to previous forum topic\") [Agency Logo Hell(p) ›](http://web.archive.org/web/20070921100547/http:/typophile.com/node/34311 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070921100547/http://typophile.com/user/18888\" title=\"View user profile.\">litera</a>",
  "time": "<br>",
  "uid": "18888",
  "comments": [
    {
      "time": " 30.May.2007 7.10pm",
      "content": "I suggest that like a program or code you write you list for yourself all the goals you have in mind for the design. And your survey your competition so you see what you are competing against, what you need to be different from & maybe better than. When you have made your survey of what is around you you can decide on tone. I don’t suggest half serious that’s too wishy-washy. Pick a direction or emphasis - especially when you are small.\n\nBTW- Why ’something that makes you smile’? That is only one way to make people remember you. It might be the right way to do that - but keep in mind the larger goal it serves. Being remebered is usualy the #1 goal of a logo design.\n\nI suggest that even though what you made is nice - it isn’t memorable. I would start again with a plan & work up to the solution in an intentional/deliberate way.\n\nFeel free to post more stuff or talk about your thought process.\n\n"
    },
    {
      "time": " 30.May.2007 9.28pm",
      "content": "play. sketch. thumbnail. what saul bass called “fooling around...”\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/didyoutry_4402.jpg)\n\nyou have some very nice type going on. but think “innovative” (or as apple used to say, “think different.” [ly])\n\n"
    },
    {
      "time": " 31.May.2007 1.33am",
      "content": "Ok. Thank you. Both of you. I really needed this.\n\nFirst of all I wanted to “pump” from the following things and conceptions:  \n- innovation  \n- idea  \n- new  \n- change  \n- @ (these days related to internet/web/email)  \n- exclamation mark (as wow when there’s an innovation)  \n- future  \n- development\n\nHere are some scans of my paper drawings (some). None of them got realised so far because I didn’t find them worth going deeper.\n\nthere are more ideas here.  \n- letter i in some 3D shape: cube/sphere  \n- stars/sparks as ideas  \n- egg with stars as “idea is born”  \n- i in shape of @\n\nI also had a daisy (happy go lucky) in normal and digitised (squared) and flying dandelion seed (free/innovative ideas).\n\nBut none of them is like: “WOW this is clever.”\n\n...Robert\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/Idea-Scans_5088.jpg)\n\n"
    },
    {
      "time": " 31.May.2007 4.34am",
      "content": "I have always loved the Impulse Records logo...\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/masthead_r_3810.gif)\n\n"
    },
    {
      "time": " 31.May.2007 4.54am",
      "content": "thank god I didn’t scan the paper idea that was VERY similar to the Impulse symbol on the logo.\n\n:)\n\nThanks for the input.\n\nAny of the scanned ideas worth working on?\n\n...Robert\n\n"
    },
    {
      "time": " 31.May.2007 5.16am",
      "content": "I think the 3-D form is interesting, but doesn’t really say innovation. The star could also be a workable symbol...\n\nThis is probably corny:\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/withstar_3526.jpg)\n\nBut generally, I like your clean approach - I don’t think it’s dull or anything. It just needs more punch (for my tastes).\n\n"
    },
    {
      "time": " 31.May.2007 7.29am",
      "content": "I was playing a bit with the combined i and @ and came out with these three minor different symbols. If you look at them you could also see a person. because I’m a one person consultant/developer this could also be a way of doing it.\n\nI was thinking how to make this more “person” and more importantly even a computer person but still not too much so it will also resemble into an i as @...\n\nI’ll concentrate on typography later.\n\n...Robert\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/ino%20symbol%201_3444.jpg)\n\n"
    },
    {
      "time": " 31.May.2007 7.31am",
      "content": "And more importantly: has anyone seen a logotype like this before, because it looks too easy not to be implemented yet?\n\n...Robert\n\n"
    },
    {
      "time": " 31.May.2007 7.38am",
      "content": "chuckgroth:\n\nI was also playing with stars a bit. Here’s the result. I was also thinking of capturing stars on a negative square (or something) to capture them somehow “on the sky”.\n\nBecause of four stars of different size we get dimension and “non-corny” look of a single five-star that too much reminds on communist times... ;) if it was red, no one would think in any other way.\n\n...Robert\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/inosp2_4251.jpg)\n\n"
    },
    {
      "time": " 31.May.2007 7.55am",
      "content": "“And more importantly: has anyone seen a logotype like this before, because it looks too easy not to be implemented yet?”\n\nClose, but not the same:\n\n[http://www.primordia.com/blog/archives/images/The\\_Incredibles.png](http://web.archive.org/web/20070921100547/http:/www.primordia.com/blog/archives/images/The_Incredibles.png \"http://www.primordia.com/blog/archives/images/The\\_Incredibles.png\")\n\nFYI, I liked the cracked-egg w/stars idea...\n\n"
    },
    {
      "time": " 31.May.2007 9.28am",
      "content": "The last version seems strong to me. And any of these ideas might be a good direction but I suggest that you have to be more rigorous to pick the right one to focus on. You can just decide that you like one best or that it is the most memorable - but that is just ’shooting from the hip’. Who are you competitors? What do they do for logos? Take a look at it against it’s competition.\n\nThis is beyond what is normally done for a small company but to take things to a really professional level you could do a careful experiment with strangers ( maybe pay them a small fee ) & see if your logo is more memorable than your competitors\\* by flashing the logos in a random order on a screen and then asking for the names. Or by showing the logos again with extras they didn’t see & asking which ones they subject saw in the series. Time the response. There are many possibilities. 20 people or so may be enough to get a good sense. You can also ask what people feel or associate with your logo & the others - you may be surprised.\n\n\\*you should mix in local logos from other categories of business as well and maybe some famous ones too.\n\n"
    },
    {
      "time": " 31.May.2007 10.32am",
      "content": "Here is the possible solution with i integrated into an @:\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/inosp4_4695.jpg)\n\nand the other one that I found a great way to put a star in. I guess it’s quite nice. I may add a star or two (smaller) to make the “sparkling effect” but this is the basic idea.\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/inosp3_4104.jpg)\n\nI guess I came far enough to go with one of these. I know it’s not going to be a perfect logo and I’m small, but I like challenges.\n\n"
    },
    {
      "time": " 31.May.2007 10.34am",
      "content": "@eben:  \nthank you. the last version was interesting, but I think I found a better place to put the star in.\n\nRegarding competition I don’t consider anyone that does the same things as competitor. More like a possible business partner. Because I’m primarily a contractor which means I’m normally not bidding on projects. At least 95% of the time I’m not. Most of the small companies don’t really have a logo whatsoever. Some do. I’ll make a research.\n\nI’m definitely showing this to others too.\n\nYou’re right. I will have to go one way. I just wanted to refine ideas into a better and more comparable result than just sketches. I will have to go with one of that I made.\n\n"
    },
    {
      "time": " 31.May.2007 10.37am",
      "content": "Robert, this last version is strong. I only wonder if the 2 sub-lines shouldn’t be pushed to the right. At the moment they are centered under the star, but not under the word and I find it distracting.\n\n"
    },
    {
      "time": " 31.May.2007 10.43am",
      "content": "I deliberately optically centred them under the star because it’s the most visually emphasized symbol in the logo.\n\nI’ll play with this last one more because it also looks quite promissing to me.\n\nDo you find the star distracting on the neighbouring letters O and A? I’ve also put it in the back of the letters but the impact diminishes...\n\n"
    },
    {
      "time": " 31.May.2007 12.13pm",
      "content": "I like the star and how it is used. The logo itself is nice and the fact that the star isn’t exactly in the center doesn’t bother me. If the start were in the exact center I’d say centering the sublines would be fine, but it isn’t so it is distracting.\n\n"
    },
    {
      "time": " 31.May.2007 2.59pm",
      "content": "Your ideas w/the star are interesting — more so than the “i” and “@” combination.  \nI agree with MT about the placement of the secondary text. Slightly off-center feels odd to me; I also would try flush right.\n\n"
    },
    {
      "time": " 31.May.2007 8.14pm",
      "content": "Your original logo is way better than anything else on this page. Tricky logos look cheap. Go simple, then add the surprise with other brand elements.\n\n"
    },
    {
      "time": " 31.May.2007 8.46pm",
      "content": "I think the clean type was strong, but I;m not going to dissuade him from exploring options. And I think he’s moving toward something HE’S more comfortable with, which is the true aim of a logo.\n\n"
    },
    {
      "time": " 31.May.2007 9.50pm",
      "content": "I remember passing through Ljublana (sp?) several years ago, on my way through central europe, and down into croatia. Beautiful part of the world. I taught myself a little Croatian and Bosnian to get by, but confess to knowing scant Slovenian...\n\n"
    },
    {
      "time": " 1.Jun.2007 1.25am",
      "content": "Nice.\n\nSo you have another good reason to visit Slovenia again... :)\n\n"
    },
    {
      "time": " 4.Jun.2007 4.10pm",
      "content": "Yes. Like I said, beautiful part of the world. Looks like ski-country.\n\n"
    },
    {
      "time": " 5.Jun.2007 9.48am",
      "content": "We’re slowly getting there. :) This is the latest version in four different variants. The remaining text is missing and will be added afterwards. Star sizes are adjusted to the V letter of a certain typeface and have therefore different shapes and sizes.\n\nI incorporates stars on V and added two additional one to:  \n1. balance the stars to the optical centre of the text  \n2. make the “sparkling” not just a star. Innovation is a sparkling idea.\n\n**Some questions for you:**  \n1. What’s your opinion about the logo solution?  \n2. Which typeface do you prefer if any of the shown?  \n3. Would you suggest another one to test? Which?\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/inosp5_5398.jpg)\n\nI would like your opinion.\n\n"
    },
    {
      "time": " 5.Jun.2007 12.16pm",
      "content": "Out of the 4 Insignia but with a flat bottom v.\n\n"
    },
    {
      "time": " 6.Jun.2007 2.22am",
      "content": "Here’s a flat bottom “v” Insignia version:\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/inosp6_6401.jpg)\n\nAnyone else’s preference? I was leaning toward Avenir but don’t like the italics, because they have no cursive letters... For the same reason I like Myriad, but I don’t like the “va” part of it because it makes it too “poetic”.  \nInsignia was chosen for it’s very clean industrial shapes but lacks other versions...  \nAvantgarde is also very geometric as Insignia and has sets and all but I prefer insignias style better.\n\n"
    },
    {
      "time": " 6.Jun.2007 6.16am",
      "content": "Actually Insignia does have the best style for my eye. But...\n\nThe best possible font would be:\n\n- complete family with real cursive italics\n- geometric industrial shapes like Insignia\n- very little stroke modulation\n\nAnyone has any particular font in mind?\n\n"
    },
    {
      "time": " 7.Jun.2007 10.07am",
      "content": " **I’m still open for opinions/suggestions** about the last logo solution with stars (whatever typeface used).\n\nThank you.\n\n"
    },
    {
      "time": " 7.Jun.2007 10.13am",
      "content": "Check out Mark Simonson’s [Proxima Nova](http://web.archive.org/web/20070921100547/http:/ms-studio.com/FontSales/proximanova.html) if you want an alternative to Avenir but with true italics.\n\n- Lex\n\n"
    },
    {
      "time": " 11.Jun.2007 1.43pm",
      "content": "I need your opinion.  \nWhich of the two would you choose:\n\n<dl></dl>\n\n**A:** customized Insignia\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/inosp6_4650.jpg)\n<dl></dl>\n\n**B:** custom font (probably still needs some work)\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/inosp7_3654.jpg)\n\n"
    },
    {
      "time": " 12.Jun.2007 9.48am",
      "content": "Insignia!\n\nI like your custom font, but with the offset stars, I think the letters looks a little wobbley.\n\n"
    },
    {
      "time": " 12.Jun.2007 11.36pm",
      "content": "The problem that I have with Insignia is that it’s too geometric. Custom font has more “creativity” in it why I like it. And it’s weight is lighter than Insignia’s (only has one single weight - which also makes it rather unusable to me) and that is another reason for me to like it even more.\n\nDo you think I would go completely off if I <cite>don’t</cite> choose Insignia?\n\n"
    },
    {
      "time": " 13.Jun.2007 7.40am",
      "content": "I don’t think you have anything to lose by _not_ chosing Insignia - I just like how it looks. In fact, I like how it is geometric...but that’s just my opinion obviously.\n\nBut on second though, I do really like the unique qualities of your custom font. Hmmm\n\nTough one.\n\n"
    },
    {
      "time": " 28.Jun.2007 11.05am",
      "content": "Sorry to say this, but the first thing it reminds me of: adidas.\n\nEspecially the geometric sans versions (too many round characters). Even though adidas is having three stripes (and way bigger) where you have three stars the shape drawn by these is triangular. They won’t sue for this but resemblance is not what you’re trying to achieve.\n\nThe custom font version is the way to go I guess. I really liked the spec you showed in the other thread.\n\n"
    },
    {
      "time": " 28.Jun.2007 3.07pm",
      "content": "Thanks golfomat. The sans serif type is still in development and I also decided to give it a try. The letters seen here are first revision. Now I’m already on the fourth and it becomes slowly what I want it to be. Every day. I’m closer.\n\nAbout the adidas comparison. I don’t think there’s a big percentage of people that would see it the way you did. So I guess I’ll be going with the same idea.\n\nI’ll post the result when the type is ready enough to make the complete logo (didn’t want it to turn this way but we learn every day).\n\n"
    },
    {
      "time": " 29.Jun.2007 10.18am",
      "content": "Actually, it reminded me of Macy’s, especially with Avant Garde. Any geometric sans gives almost the same illusion, too.\n\n"
    },
    {
      "time": " 5.Jul.2007 1.57pm",
      "content": "If we stick to discussing this topic here we might get slightly dragged away into psychology and branding - another thread? “When is it resemblance and when is it you?”?!?\n\nFor the logotype: I think the “e” needs some work. I’d consider making the eye a little smaller. Or lower the spine of the “s”. For me there’s a slight imbalance with these characters. The “wobbliness” within the other characters has a lot of charme. Maybe counterspaces are to symmetric, which is irritating.\n\n"
    },
    {
      "time": " 6.Jul.2007 3.55am",
      "content": "There’s another thread where this font is designed and yes in the fifth revision of the font, letter “e” has smaller eye that matches “s”. :) How convenient. :)\n\nCheck the thread here:  \n [Opinion on this sans serif font (Inovares)](http://web.archive.org/web/20070921100547/http:/typophile.com/node/34406)\n\nAnd you’re welcome to comment in that one also.\n\n"
    },
    {
      "time": " 6.Jul.2007 1.44pm",
      "content": "The e,s look much better in your most recent revision. I comment on both threads if you set your logo in Inovares No.5 (or 6!).\n\n"
    },
    {
      "time": " 11.Jul.2007 10.38am",
      "content": "I think this is going to be the last version of my logo. Anyone has any additional suggestions before I close the decision?\n\nChanges:\n\n- font used is my own Inovares Medium\n- stars have rounded inner corners to make them look non communist-times like\n- stars’ angles were not perfect the last time that’s why I made a variation of letter “v” to make them more balanced and perfect shape with 36 degree angles\n\n ![](http://web.archive.org/web/20070921100547im_/http:/typophile.com/files/inosp8_6196.jpg)\n\n"
    },
    {
      "time": " 11.Jul.2007 11.13am",
      "content": "The one thing I keep thinking: the stars are overpowering the word. Either the word needs the same level of tone as the stars or more than the stars. I also keep thinking the star is too close to the v ... I find that distracting as well.\n\n"
    },
    {
      "time": " 11.Jul.2007 3.35pm",
      "content": "A couple little things, read through the thread and agree with “innovative solutions...s.p” might look better flush right. Second, the stars are pretty dominant and causing conflict with the company name. A suggestion might be tone it down or reverse the blue with the grey.\n\n"
    }
  ]
}
