{
  "id": "34153",
  "title": "Black Blogs on-screen Type",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Roger has been busy lately blogging about onscreen type. It might be of interest here\n\n[http://www.rogerblack.com/](http://web.archive.org/web/20100620015210/http:/www.rogerblack.com/ \"http://www.rogerblack.com/\")\n\n",
  "author": "<a href=\"/web/20100620015210/http://typophile.com/user/5882\" title=\"View user profile.\">mike_duggan</a>",
  "time": "<br>",
  "uid": "5882",
  "comments": [
    {
      "time": "",
      "content": "Off-list I've been asked if Roger's entry regarding the [opening up of the EOT format](http://web.archive.org/web/20100620015210/http:/www.rogerblack.com/blog/getting_in_bed_with_type) is accurate.\n\nBasic answer is yes. The Embedded OpenType format (EOT) is essentially a wrapper to an OpenType font, and we're in the process of documenting the format. We hope to provide a draft to the W3C fonts working group by mid June. In addition, and equally important is the Microtype compression which was licensed from Agfa. Monotype Imaging are documenting the compression algorithm with a view to licensing it free of charge for web based implementers (browsers and authoring tools).\n\nEOTs have been around in one form or another for 15 years, and with respect to the Web most font creators have documented their policy towards the format in their EULAs. We’d hope that opening up the format would have a positive impact on type designers approach to the format.\n\n"
    },
    {
      "time": "",
      "content": "_We’d hope that opening up the format would have a positive impact on type designers approach to the format._\n\nIt will.\n\n"
    },
    {
      "time": "",
      "content": "The problem is that the only folks that get that upset about the 'limitations' of web typography are those in the graphic design and type realms.\n\nSince the web is really made for and by pretty much everyone, this isn't THAT much of a concern.\n\nNot that I wouldn't rejoice and embrace an embeddable font standard that will be supported by many web browsers and many type foundries--I just ain't holding my breath. ;o)\n\n"
    },
    {
      "time": "",
      "content": "Darrel, that's pretty much saying fonts aren't important.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Well, this isn't on the front page of the times or even slashdot, but it might be big news to us.\n\nLets draw a parallel. There are a lot of things that people want to do with electronics, as soon as there are better storage than today's batteries. Those in the biz are constantly trying to find a new technology to hold electricity, and every breakthrough is nice, even the little ones. So is every step forwards really a major concern? Not to me, my thing is type. But I'd still love a phone that needed charging once a month.\n\nI would also happen to like better type on the web. Open, css-friendly, **non-proprietary** , cross-server, cross-browser consistent type. And all those who don't care much will have an opportunity to do more to express themselves.\n\nThis isn't everything, but it is a step forward. Interestingly, from one of the companies that helped create the problem in the first place. If all the other browsers take the bait to code in retrieval of EOT's, it will be a trivial step for the FOSS fanatics to implement allowing non-wrapped fonts too. The css standard is already there, waiting. Then this long running joke will end.\n\n"
    },
    {
      "time": "",
      "content": "<cite>If all the other browsers take the bait to code in retrieval of EOT’s, it will be a trivial step for the FOSS fanatics to implement allowing non-wrapped fonts too.</cite>\n\nWould that even be necessary? There are some advantages to using EOT other than the DRM, and just because the DRM options are there does not mean that web developers actually need to use them. From the radical libertarian perspective of the FSF I can see why just running the file through gzip and uploading it to the server is an improvement, but for most users and developers I doubt that the involvement of EOT matters much.\n\n"
    },
    {
      "time": "",
      "content": "The independent anaysis we've done shows that a good proportion of commercial font vendors allow \"embedding\" as defined in the OpenType spec, but none allow \"zipping\" as currently proposed.\n\nSo the difference boils down to legal access to commerical fonts and public domain fonts with EOT vs only public domain fonts with the zip scheme.\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "My independent analysis says, not 'none'. Anyway, this is a good step forward, something that might have been lost in my last post.\n\nDue to the way Free Software works, FOSS fonts will become more and more relvant as time goes by, regardless of our tastes for it. OFL fonts can be served by virtually any method described above or in the W3C's recommendations.\n\n"
    },
    {
      "time": "",
      "content": "If free/open fonts get that popular, you’ll see the foundries tripping over themselves to license fonts for web use at low prices and with very agreeable licenses. Monotype owns thousands of classic fonts that could be licensed for online distribution at dirt cheap prices because there’s so little overhead with digital sales, and could easily treat most of the old fonts as cash cows and just dump them on the market at rock-bottom prices. Indie types might also become great sellers in such an environment, because companies that can’t afford tens-of-thousands of dollars for a standout printed piece could easily drop a few thousand on a nice website developed from a template and given a nice standout look with great type. The huge volume of sales that open web type could generate have the potential to create a sales volume that will bring font prices to bargain-basement levels.\n\n"
    },
    {
      "time": "",
      "content": "BTW, one really great thing about this is that it enables the support of  \non-screen rendering schemes unavailable (I mean via HTML) otherwise:  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20100620015210/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "If there were a practical, cross platform/browser way to embed fonts, people would use it, I guarantee it. Almost any site of any significance on the internet uses some hacks somewhere to use custom type, whether it be images or flash. If the crusty old foundries won't license their type this way, people will use fonts from foundries like mine ;)\n\nThe reality is that in not too many years, almost all type will be read off of screens (even signage and packaging will be configurable displays, as horrible as that may be). Either the type industry will get with the program and figure out a business model that works for screens, or they will be marginalized and someone new will figure it out. Hopefully typography won't suffer on the next generation of screens like it has on the web.\n\nIt will be interesting to see of OSS fonts take off. Free fonts (as in liberty and beer) have been around for some time, and the quality has been pretty weak up to this point. My view is that OSS fonts will fill a niche for people who need letters to communicate, but can't match their shirt to their pants. Indie foundries will get even more business through long-tail type aggregators like My Fonts. But there will always be a market for people who know that type is a powerful differentiator for their brand, and would rather pay for something that other people can't afford. These fonts are expensive enough that their owners will be able to spider the web and enforce their IP in any markets that matter.\n\nPhotographers have been freaking out for a long time about people on the web using their images. It turns out that it just doesn't matter. More dangerous than the pirates are all the kids with digicams. And these kids aren't afraid of putting their huge images on Flickr. The days where big companies could sit on big stacks of old crap are over. People are going to want new, fresh stuff, and the people who matter aren't going to get it from pirating old garbage. They are going to buy from people like me ;) through aggregators/filters who will carry the little guys' stuff with creator friendly terms like Veer.\n\n"
    },
    {
      "time": "",
      "content": "\\>My independent analysis says, not ‘none’.\n\nCare to name the vendor?\n\n"
    },
    {
      "time": "",
      "content": "Sii\n\n!Exclamachine, for one. I sell more fonts directly than through a third party, at the moment. I'm on your registry. At this point all my works are flagged \"embeddable\", and the commercial ones come with preset or custom choices in licensing, always allowing electronic embedding. A quick scan of Christian's post suggest that Betatype is open for all sorts of new ideas as well.\n\nJpad\n\nFree/open software works. It isn't a cure-all for \"nasty old capitalism\", and isn't supposed to be. Nevertheless it has taken an important place in all the areas of \"utility software\" like OS's, databases and such because people want an open, fixable, solution that no one can take away from them for essential, unglamorous tasks.\n\nThe thing about free/open is that it doesn't have to catch fire to \"succeed\". The way the licenses work, generally, something can sit there untouched for days or years. One day someone needs a quick project for class, then it gets suddenly polished. Now it is still there, only better. It is something like all the history of arts that we can still draw on for inspiration, before the copyright drift in the 20th century. Every free/open piece of software never goes away, it just sits there on the web, and the whole body grows.\n\nWorkhorse text fonts are one of those things that free/open will take the place of very well. There are several now that aren't too bad, and the ability to web-embed them will make development all the more worthwhile.\n\nSeveral things have held the development of free/open fonts back, but the free/open culture is now turning its collective eyes this way:\n\nDespite the US government's consideration of type as non-creative work, the designers disagree, and have been reluctant to give away their babies. The OFL was created to specifically mitigate that feeling. And similar sentiments in other art fields created the successful Creative Commons.\n\nThe mainstream users are currently looking at non-proprietary software as a \"cool thing\". They don't like it when a song they buy won't play on their walkman, and have begun to wonder about other software, and what they can do about it. While DIY isn'tt for everyone, neither was coding Linux, but its caught on in servers quite well, and somehow \"long-tail\" became a term that needs no introduction!\n\nMicrosoft no longer gives away some of the most practical font files available. (Not with purchase of Windows, but the old free IE font pack.)To keep things cheap yet kosher, some businesses are looking for new solutions. This has lead to the beginnings of paid development of free/open works.\n\nPatents restricted some of the most broadly supported font formats from appealing to FOSS zealots. Many of those patents are running out. Simultaneously, the free/open community is maturing beyond the zealotry stage.\n\nSo, (important) free/open fonts are coming. Demand has risen, and free data persists. I am not trying to evangelize FOSS. I am assuming that all things fluctuate; if so, and free/open never diminishes, then it must be growing at some rate.\n\n"
    },
    {
      "time": "",
      "content": "SII? \"We’d hope that opening up the format would have a positive impact on type designers approach to the format.\"\n\nCan you please explain how?\n\nCC \" Open, css-friendly, non-proprietary, cross-server, cross-browser consistent type.\"\n\nCan You please explain how?\n\n"
    },
    {
      "time": "",
      "content": "Choz, I was not trying to belittle free software, just pointing out that I doubt the FOSS crowd will have much of an objection to using the EOT format to begin with.\n\n"
    },
    {
      "time": "",
      "content": "\"Darrel, that’s pretty much saying fonts aren’t important.\"\n\nThey really aren't outside our sphere. \"Is the type readable?\" is pretty much the only major requirement that most of the internet cares about. And, even then, that consideration is often tossed aside.\n\nAgain, I'm all for being able to use more typefaces on the web. It would be a benefit to all. That said, there are just way too many stars that need to properly align for this to go anywhere anytime soon.\n\n\"If free/open fonts get that popular, you’ll see the foundries tripping over themselves to license fonts for web use at low prices and with very agreeable licenses.\"\n\nMaybe. Though, at this point, the only folks that seem to really push for custom fonts on the web are the ad agencies working on major brand campaigns. As they also see fit to turn the web into pure Flash, there is little reason for them to need another font embedding method. ;0)\n\n\"The huge volume of sales that open web type could generate\"\n\nI'm not sure there would be a huge volume of sales. Seems to me that it's a fallacy akin to the RIAA thinking that people would flock to re-purchase all their music they had purchased on CD in DRMed MP3 format as well. The difference is that music is a mass-market while font sales is still relatively small in comparison.\n\nThat said, there's always the scrapbooking market...\n\nScreens are of such a low quality that the details of a particular corporate typeface are lost to the point that I'd find it hard to justify paying for yet-another license for the font vs. just using Verdana and Images for any important custom-set headlines.\n\n"
    },
    {
      "time": "",
      "content": "\\> “Is the type readable?” is pretty much the only  \n\\> major requirement that most of the internet cares about.\n\nI'm sorry but this is quite shallow.\n\n\\> Screens are of such a low quality that ...\n\nWhen you factor in anti-aliasing (I mean  \ndone properly) then a whole world opens up.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>!Exclamachine, for one.\n\nI think you misread my post - do you allow your commercial fonts to be attached to web pages in a zip file? Can you send me a pointer to your EULA?\n\n"
    },
    {
      "time": "",
      "content": "There is only thing that needs to happen for fonts to become useful on the web. The three major html renderering engines need to allow pages to reference fonts in a consistent way. My preference would be TrueType files that can be referenced inside of css.\n\nI'm sure that this is much harder than is sounds, just from a security and sandboxing standpoint. Fonts can do a lot to screw up operating systems. There would probably have to be a separate layer for rendering type that isn't so close to the OS. The worst thing would be for remote web pages to be able to install fonts on your machine, even if it were just temporary.\n\n"
    },
    {
      "time": "",
      "content": "<cite>My preference would be TrueType files that can be referenced inside of css.</cite>\n\nWhy TrueType? So foundries can go back to selling truetype _and_ Opentype versions of fonts?\n\n"
    },
    {
      "time": "",
      "content": "Couldn't they be TT flavored OT?\n\nI'm also curious about your EULA Choz.\n\n"
    },
    {
      "time": "",
      "content": "Christian's 'preference' mirrors that of the Opera CTO. TTF (or OT TTF) basically have a better cross-platform story than OT CFF. People are going to want to include one font that will work on Windows (down to Win 9x) Mac OS (8 and up), Linux, Windows Mobile, Symbian devices, etc., and many of these don't natively support OT CFF or PS T1.\n\nNot to re-state the obvious but there are drawbacks to raw TTFs, specifically licensing and file size (esp. for East Asian).\n\n"
    },
    {
      "time": "",
      "content": "\"I’m sorry but this is quite shallow.\"\n\nYes, it is. I completely agree. But, that is how it is. Show your corporate serif text typeface set at 11px alongside Georgia set at 11px on your website to your customer base and I bet you'd get a huge chunk of 'huh?' responses.\n\nWould font embedding increase Amazon's bottom line? I doubt it, but, honestly, I dunno. It'd certainly be an interesting thing to study.\n\n"
    },
    {
      "time": "",
      "content": "SII? “We’d hope that opening up the format would have a positive impact on type designers approach to the format.”\n\nBerlow: Can you please explain how?\n\nI think a few type designers/vendors don't like EOT purely because it is currently an MS proprietary technology and not supported cross-platform.\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "\\> a huge chunk of ‘huh?’ responses.\n\nIt depends who your clients are. There are a lot of companies that really do get branding and the power of typography. These are the people who buy typefaces. They are buying type for the web right now for gifs and flash, and they would buy more of it if embedding worked.\n\n"
    },
    {
      "time": "",
      "content": "it should be as simple as this:\n\n`\nh1 { font-family: url(\"PillGothic300mg-Black.ttf\"),Helvetica,Arial; }\n`\n\n"
    },
    {
      "time": "",
      "content": "\"It depends who your clients are. There are a lot of companies that really do get branding and the power of typography.\"\n\nTypography is important. A specific font for body text, not so much. At least not in the eyes of the end-user.\n\n\"These are the people who buy typefaces. They are buying type for the web right now for gifs and flash, and they would buy more of it if embedding worked.\"\n\nMaybe. Hopefully we'll get a chance to find out down the road. ;0)\n\n"
    },
    {
      "time": "",
      "content": "Jpad- I wasn't meaning to champion FOSS either. I haven't the inclination or the knowledge. The FOSS fanatical types will not settle for free (in cost) methods to accomplish this goal. The main thing keeping them from calling for/developing a solution was that no \"open\" browser support a way for fonts to be served into a web page, even if they were licensed appropriately. Christian is right, there is a lot that it entails in the sandbox department, and also with integrating it in web dev/management tools.\n\n_Another interesting thought: To go into Firefox needn't the methodology be GPL'ed, not on indefinite loan from a private interest?_\n\nAnyway, the radical libertarians are out there, and this will be another step closer to making fonts as simple as serving an image or a text file.\n\nChristian- it should be as simple as this:\n\n`h1 { font-family: url(PillGothic300mg-Black.ttf); }`\n\nOr, at least start that way. The W3C likes to write imaginary software then wait for someone to make it, and they've come up with a pretty extensive method of defining the font, including degrading back to plainer fonts, real and emulated variants, small caps and all sorts of stuff. If I recall, Microsoft's new method of font substitutions in Vista is based on a portion of this, so it has some viability, too.\n\nDavid- Simon explained the gist of it, but I'll break it down a bit.  \nOpen - consisting of fully-public documented procedures  \ncss friendly - conforming to the xhtml font-face and css @font-face rules of the W3CC specs.  \nnon proprietary - not controlled, dictated or dependent on components of code controlled by private parties through licensing agreements.  \ncross server - Works consistently with any full-featured software that spits out web pages.  \ncross browser - Works in every major current pc browser, and _could_ work in even more, or at least, not break them.  \nconsistent type-What the designer makes looks, by default, virtually identical in default view, standard browser windows, and can be manipulated (zoomed, etc.) like \"normal\" text.\n\nDarrel- For the moment you are largely right. But... screen resolution has and will continue to improve. The population will continue to move online, and bring more arts and culture with it. Computers will get faster, bandwidth and storage cheaper, font rendering software will improve. Every one of these factors will make a more viable market for any digital media, including fonts. The main money maker will be display fonts which stand to improve in the screen-arena the most, and are easy to appreciate to designers and lay-folk alike.\n\nFor big companines, rendering display text in the native browser space instead of through a plug in and a hack will reduce costs. They can keep accessibility and still market themselves. They can have dynamic headlines and such that really stand out, but managed without adding another layer of re-rendering graphics or such.\n\nYour comments give me an interesting line of thought about font-on-demand services to serve to others' pages. Hmm...\n\nSii- I think I read correctly, but grossly misunderstood the post. I've since re-read it a few times.\n\n_\"but none allow “zipping” as currently proposed._\"\n\nI think this means \"zipping\" as currently possible and very rarely done.\n\nI just could not get my brain around that. Why would someone want to zip the file to transmit it as an element of presentation? Most font files are small, when considered as media, and the wrapping in a generic container would only make the user unsure of what they are getting. Additionally, if they were downloaded and the user knew what to do with them, they still have to go through the process of installation and restart of the browser. As I see it, that is a non-solution.\n\nAs a designer, I would be helping my clients make bad web sites if I endorsed this method, with the obvious risks to my work.\n\nThis is essentially a survey that asks, \"do you prefer doing something this one way, or in the worst possible way?\" Yes, I'll take the former.\n\nWhat I thought it meant was that there was a proposal to run simple zip-style compression on a font, with the typical extension change or similar, so that it would be rendered immediately inside the web, but with a slightly smaller transmission size and isolated from the OS. Sure it would be rather trivial security to my work, but it would be of great benefit to the consumer. In which case I would have to say that it is appealing.\n\nThe topical section of my Pre-formed EULAs goes like so (emphasis added):\n\n`The output of the software may be embedded in any manner of portable document or interactive electronic document, assuming a reasonable, common level of care is exercised to prevent extraction and/or installation of the font data.`\n\nThis leaves a lot of leeway for the most basic systems of presenting the text electronically. Since there was no cross-platform solution when I wrote that, and still isn't, I decided to gloss things. Remember I do not consider anything that requires the client's end-user's interaction as truly \"embedded\".\n\nOver half of what I've licensed this year closed with a custom EULA, and no end-user has yet asked for zip-link access. When I offer a license's full text to them prior to sale, they are told to reply if there is something else they want or need, both in my correspondence and in the license itself. Every sale has been through contact with just me, and no one has yet requested it. I'm open to it.\n\nBTW one \"vendor\" that I thought of that currently buys fonts and then serves them as links is SIL. (Clarification: SIL is a font purchaser from whatever vendor(s) allowed them to post the fonts as zips.)\n\nTiff- The ones I linked to a while back are slightly out of date. Once Myfonts figures out how to handle the leading !- in my font names, the new EULAs will go up, with the products. Any day. Really. Like soon.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Another interesting thought: To go into Firefox needn’t the methodology be GPL’ed, not on indefinite loan from a private interest?</cite>\n\nAccording to Mozilla.org:  \n_All of the code which makes up the core Mozilla products is licensed under a MPL/GPL/LGPL tri-license or a licence compatible with all three of those (e.g. the BSD licence)._\n\nGiven those license terms I doubt that there will be any trouble getting Firefox support. Microsoft has gotten along just fine with the BSD license for decades, so and Microsoft code could simply be released under a BSD license. But Microsoft doesn’t even need to write the code, it just needs the W3C to sign off on EOT and then the Firefox team is stuck supporting EOT because they would never let IE support an open standard that the Firefox team does not.\n\n"
    },
    {
      "time": "",
      "content": "But Microsoft doesn't own all the code, they license it from Agfa, who borrowed it from Monotype, who has it on a lease from a guy in Wisconsin, who knows a guy who... or whatever. ;) The peer pressure response is very valid, since Firefox is the self-proclaimed force that keeps IE competitive where the free market and our gov't failed. Mozilla devs would likely be able to code compliant behavior from the data that would be released to get W3C approval.\n\n"
    },
    {
      "time": "",
      "content": "There's no code license - it's documentation, a format spec, which would likely be appended to the CSS spec. Likewise from Monotype, they are documenting their compression, with a free license for Web use. Sorry if I didn’t make that clear.\n\n"
    },
    {
      "time": "",
      "content": "Obviously Darrel I meant that your viewpoint is shallow, or at least over-simple. The truth isn't like that at all - as usual it's quite complex! For one thing, relying on the conscious evalution of readability on the part of end-users is just plain nuts; in fact it has been shown empirically that users over-estimate the font size that's most conducive to reading - which is to be expected. And if they get the size wrong, you can bet they get everything else wrong too.\n\nThe bottom line is that discerning designers design things <cite>in spite</cite> of what users say (or often even think) they prefer; and -like Christian said- discerning designers spend money on fonts to get their results <cite>just right</cite>; yes, more often in print, but there's so much room to grown on-screen.\n\n\\> The main money maker will be display fonts\n\nWhile the main \"comfort maker\" will be text fonts,  \nspecifically in the area of hand-made grayscale fonts.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"it should be as simple as this:  \nh1 { font-family: url(\"PillGothic300mg-Black.ttf\"),Helvetica,Arial; }\"\n\nI see... If you are not either rooting for a confluence of the enabling and rendering technologies, or for an embedding scheme that answers more questions than \"FONTNAME\", I think you need a rethink.\n\n\"\"consistent type-What the designer makes looks, by default, virtually identical in default view, standard browser windows, and can be manipulated (zoomed, etc.) like “normal” text.\"  \nI do not see all this hap'nin as a result of this embedding today, do you?\n\n\"I think a few type designers/vendors don’t like EOT purely because it is currently an MS proprietary technology and not supported cross-platform.\"\n\nI see MS proprietary technology that has considerably more effect on the appearence of fonts than embedding, that is not supported cross-platform/browser, don't you?\n\nI'm all for...embedding... but eventually, the fonts must emerge from their \"hidden\" folder and express the will of the reader or writer in a local font environment. To do this on a spectrum of technical foundations that are not consistently able to support high-quality output of fonts in low resolution environments is more than hard.\n\nCT left pure TT behind and went for fake resolution. OS10 left TT, for ad hoc fat pixeled greyscale and TT was not fully licensed unto Freetype We all lost a place to do consistent high quality work, and who knows why? But if embedding becomes sophisticated enough to ask the \"entire specification\", down to user rendering preferences, one can deliver very specific fonts of the highest possible quality for each and every user.\n\nDelivering jam to spread on \"whatever\" and \"promising\" it will \"taste good\" is someone else's job, apparently. Anyone today can see that the Windows CT and TT fonts once moved to the Mac look poor at most sizes. Moving \"normal\" TT fonts into a CT environment yields poor results as well, and browsers don't allow enough options, consistently, to assure user comfort or allow publisher's even modest quality control.\n\n\"the only folks [who] seem to really push for custom fonts on the web are the ad agencies working on major brand campaigns. As they also see fit to turn the web into pure Flash, there is little reason for them to need another font embedding method\"\n\nI see...So if this is only about text...\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "_Likewise from Monotype, they are documenting their compression, with a free license for Web use. Sorry if I didn’t make that clear._\n\nNo, you were clear, there's no need to apologize, to me. I was being a bit tongue in cheek, but I meant, that to some activist, it will still be too fettered.\n\n_I do not see all this hap’nin as a result of this embedding today, do you?_\n\nNot instantly. That was from my list of the ideal situation. Ideals aere rarely attainable, but i see this as a more pivotal step forward than others in the line.\n\n_I see MS proprietary technology that has considerably more effect on the appearance of fonts than embedding, that is not supported cross-platform/browser, don’t you?_\n\nThat's why some people are developing non-hinted grayscale fonts, alternate text rendering engines, FOSS screen rasterizers and about a million other things.\n\n----\n\nHere's an interesting idea. SVG fonts are well suited to browsers, and well poised for general cross-platform use. How much work would it be to integrate them into the EOT style system?\n\n"
    },
    {
      "time": "",
      "content": "\\> for an embedding scheme that answers more questions than “FONTNAME”\n\nTrue, true. Though it doesn't need to \\*start\\* complicated. The advanced features should be available, but not required to make it work.\n\n"
    },
    {
      "time": "",
      "content": "David: _But if embedding becomes sophisticated enough to ask the “entire specification”, down to user rendering preferences, one can deliver very specific fonts of the highest possible quality for each and every user._\n\nAmen.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Here’s an interesting idea. SVG fonts are well suited to browsers, and well poised for general cross-platform use. How much work would it be to integrate them into the EOT style system?</cite>\n\nThat’s probably not a great idea. SVG was always Adobe’s baby and Adobe dropped it after the Macromedia merger. Aside from maybe satisfying the tiny number of FOSS zealots who still care about SVG, and might refuse to work with EOT because they’re crazy, what would the point be?\n\n"
    },
    {
      "time": "",
      "content": "\\>Amen.\n\ntranslation... \"$$$$!\" ;-)\n\n"
    },
    {
      "time": "",
      "content": "\" Though it doesn’t need to \\*start\\* complicated\"  \n1994, 1999, or 2004 was when it needed starting simply. Now it is time to ask the user 's appearence prefs and the browser version. Is that too much? Who would be against such a thing? oops...I almost forgot...lol...\n\nSimon Daniels of Microsoft Corporation: \"translation… “$$$$!” ;-)\"  \nlol, not quite: $$$$$$$$$$$$$$$$$$$! is more like it, (split $$$$$$$$$$$ ways of course). But besides that, anytime Simon wants to go strolling through MS's entire font library looking for functioning i-no-dots, on any platform, I'll be there with a teeny-tiny doll spoon to hold what we find...Really.\n\nmeme on,\n\nBerlow\n\n"
    }
  ]
}
