{
  "id": "34150",
  "title": "Time to brainwash the kids again",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "One thing that scares me with children is, what if You have one and they turn out to have the worst taste in music? My plan is to brain wash them from day one minus 9 months by playing my music over and over again. I'm fairly sure they will appreciate this later on. Not too sure about the mother, though.\n\nOn to this particular case, I assume some of you have kids and You fear they will never spot the difference between Sabon and Sabon Next, Arial and Helvetica, Frutiger and Myriad, etc. Scary awkward dinner conversations ensue as an apparent divide between generations and interests manifest. Now we don't want that.\n\nI'm not saying you're doing a bad job, but just to be on the safe side I thought I'll mention a book now available in english that Mark Batty recently published; [The Serif Fairy](http://web.archive.org/web/20120421233552/http:/www.markbattypublisher.com/servlet/book_view?number=47) by René Siegfried, to hopefully avoid such situations. You can still dream of a Linn Boyd-Morris Fuller kind of relationship with the kid.\n\nGood luck!\n\nƒ\n\n",
  "author": "fredo",
  "time": "31 May 2007 — 7:28am",
  "uid": "7230",
  "comments": [
    {
      "time": "31 May 2007 — 7:33am",
      "content": "Face it, your kids are gonna rebel and use Comic Sans for everything.\n\nBut by the time they grow up info will be beamed directly into their brains obviating the need for type at all.\n\n"
    },
    {
      "time": "31 May 2007 — 7:42am",
      "content": "Cute book.  \nMy favorite kid's type book: \"A Type Detective Story\", M Woolman, 1997.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 7:46am",
      "content": "I don't think you can \"enforce\" your musical taste on your children (even on a subconscious level). I can only look at my family to see your upbringing doesn't have an influence on your personal taste. Best case scenario, you'll only be able to pass on your moral standards to your children and maybe spark an interest by showing them yours. Both my sisters & I all have different tastes in movies, music,... & overall different interests. I can't even seem to find a genetic reason in my entire family that explains my affection for typography, graphic design & sharks. I think the only thing you can do with your kids is to keep your fingers crossed & stimulate them in whatever turn out to be their interests.\n\n"
    },
    {
      "time": "31 May 2007 — 7:47am",
      "content": "The best thing my parents did for me (my mother especially) is make me curious about things. It keeps life interesting.\n\nThey also tried serious brain washing of the Mormon variety but that didn't take too well… :)\n\npeas\n\n"
    },
    {
      "time": "31 May 2007 — 7:51am",
      "content": "All parents brainwash, to some degree or other, whether it's religion or other variant of behaviour. The trick, as you pointed out Paul, is to instill that sense of curiousity, along with the appropriate social skills to enable the child to navigate their society successfully.\n\n"
    },
    {
      "time": "31 May 2007 — 7:54am",
      "content": "At the very least a type book is better than the recent proliferation of childrens books involving farts.\n\n"
    },
    {
      "time": "31 May 2007 — 7:55am",
      "content": "\\> your upbringing doesn’t have an influence on your personal taste.\n\nThat's just crazy-talk!  \nBut of course, never total influence.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 7:57am",
      "content": "Interesting idea, but I couldn't even begin to describe the differences between two types of ammunition (my father was in the military), just as he probably doesn't know what a descender is. I have a feeling if he'd have made any kind of effort to educate me about the minutiae of his profession, I wouldn't be on this board right now.\n\nI am definitely going to buy that book, though.\n\n"
    },
    {
      "time": "31 May 2007 — 8:13am",
      "content": "Your upbringing can have an influence when the parent's interests somehow spark a similar interest in their children, but I think all children reach a period of rebellion & nothing (or very little) of all things that were \"enforced\" to the child will survive. Children can definitely be molded to a certain degree, but I think it would take some serious brainwashing to make it last through puberty ;-) Like Paul said, you might be able to make children curious about things, but you have to keep in account that children will come across other sources (school & mostly friends) that will have a much bigger impact on their final interests & personality.\n\n"
    },
    {
      "time": "31 May 2007 — 8:38am",
      "content": "My son will be born in October. All I am hoping for is that he has some critical thinking skills and situational awareness. I assume his tastes will totally confound me. I expect no appreciation of type, unless it totally consumes him.\n\nI am preparing for a worst-case scenario where he becomes the #3 sycophant to a cult leader, and wastes all his time, vision and resources to support some whacko's half-baked ideas, and is eliminated by a federal sting operation with out even a notable obituary.\n\nIf I can handle that, I'll probably be very happy if he just becomes a shoe salesman.\n\n"
    },
    {
      "time": "31 May 2007 — 8:43am",
      "content": "I think brainwashing is a rather extreme term for the influence parents have on kids.\n\nLike Paul I was pretty lucky to have parents with wide ranging taste and natural curiosity - they took me traveling from a young age and exposed me to lots of different types of food, music, culture. But I know I was lucky in that regard.\n\nChoz - I used to know someone whose daughter joined a cult. She had to hire someone to kidnap her back, it was hideous. But I don't think that happens often - I know two OTHER people whose parents indoctrinated them into cults, now that is brainwashing for sure. One of them was Synenon (her dad was kinda high up in the pantheon there), I don't remember the other - some flakey group in Colorado.\n\n"
    },
    {
      "time": "31 May 2007 — 8:47am",
      "content": "_I am preparing for a worst-case scenario where he becomes the #3 sycophant to a cult leader, and wastes all his time, vision and resources to support some whacko’s half-baked ideas, and is eliminated by a federal sting operation with out even a notable obituary._\n\nWow, you really think he can make it as far as Speaker of the House? ;-)\n\n"
    },
    {
      "time": "31 May 2007 — 8:50am",
      "content": "I proudly indoctrinated my offspring in rockist ways from an early age. Things went well, took them to their first concert, Moist, in 1993 (aged 9 and 12). That was the grunge era, guitar rock on its way back, so the universe was unfolding as it was intended. But that was shortly before they discovered raves, techno, and hip-hop. If anyone ended up being brainwashed, it's me, as I've developed some taste for \"their\" music, which I generally find more interesting than today's guitar rock -- been there, done that. They've always been font people, the result of working with professional graphics software, on hand-me-down Macs with large font libraries, from an early age.\n\n"
    },
    {
      "time": "31 May 2007 — 9:11am",
      "content": "Patty, I use the word in the lightest sense (Philip Larkin would say [too light](http://web.archive.org/web/20120421233552/http:/www.artofeurope.com/larkin/lar2.htm)). Perhaps indoctrination is more appropriate. OK, positive influence?\n\nNick, perhaps You wouldn't be so grateful had they caught on to Korn, Green day or Slipknot.\n\nAnd perhaps I shouldn't worry so much about my potential kids as I should worry becoming Mainstream Dad myself.\n\nStill, as I have no children I can plan all kinds of crazy schemes.\n\nƒ\n\n"
    },
    {
      "time": "31 May 2007 — 9:19am",
      "content": "<cite>I am preparing for a worst-case scenario where he becomes the #3 sycophant to a cult leader, and wastes all his time, vision and resources to support some whacko’s half-baked ideas, and is eliminated by a federal sting operation with out even a notable obituary.</cite>\n\nWow, you really think he can make it as far as Speaker of the House? ;-)\n\nLMFAO. Unfortunately it's too late for my brood. Now in their teen years, they regularly print out entire reports in display faces created by eastern european teenagers with names like \"Demontooth\" and \"Crazy Uncle.\" Oh if only they would even consider Comic Sans. If you'd seen the horrors that I've seen you would run, not walk, to the nearest bookstore and buy this book. You may want to pick up a book on sucessful brainwashing techniques while you're at it...\n\n"
    },
    {
      "time": "31 May 2007 — 9:22am",
      "content": "\\> If anyone ended up being brainwashed, it’s me, as I’ve developed some taste for “their” music\n\nI go to the Coachella Festival every year and the only part that feels modern to me is the techno tent, everything else feels pretty retro…\n\npiece\n\n"
    },
    {
      "time": "31 May 2007 — 10:00am",
      "content": "Speaker of the House? Ouch, nice. ;) Like I said, it is a mental excercise, to brace for the worst, or even, if possible, figure out how to prevent that sort of thing before hand. Meanwhile, I still feel compelled to to teach him to become more of a happy, mindless drone that I ever was.\n\nFredo, once I persuaded my mother to appreciate the relationship of the lyrics to the music, she became a moderate fan of Korn, and keeps the first album next to her Phil Ochs and Peter Paul and Mary. She even through some insights my way about how she relates to parts of herself she isn't completely comfortable with through it. This has followed with an interest in the Randy Rhoads-era Ozzy, and lately she beginning to think suspect might be more than Arialvetica in the sans genre of type.\n\nI hope I am still learning new tricks at her age.\n\n"
    },
    {
      "time": "31 May 2007 — 10:07am",
      "content": "I hate lyrics.  \nBut if my kids don't, that's OK.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 10:12am",
      "content": "I was named after Pat Benatars' daughter who was born 1 month before me. I'm a huge fan of classic rock and pop and i think it partly stemmed from being curious about the time and reasoning of my name.\n\nPerhaps you should name your kid Spiekermann.\n\n"
    },
    {
      "time": "31 May 2007 — 10:47am",
      "content": "I'm with you Hrant - in general I believe lyrics are too powerful. Doesn't stop me from writing them though…&nbsp;:)\n\nps\n\n"
    },
    {
      "time": "31 May 2007 — 10:57am",
      "content": "Too powerful? Well, I wouldn't mind that. What I mind is that they're so deathly predictable and boring. I can't remember any lyrics that surprised me (at least not after my teen years). I only like lyrics when they're part of the sound, like with Soul Coughing and goa. I goddam love goa.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 10:59am",
      "content": "_Green day_\n\nMy son bought their Dookie CD, which was pretty good. (That was before he discovered Aphex Twin.) And last week I was quite moved watching them perform Working Class Hero on the American Idol finale. Ruben Studdard in a business suit singing Lucy in the Sky, well, that really blew my mind!\n\n"
    },
    {
      "time": "31 May 2007 — 11:20am",
      "content": "I already decided to name my kids Agee and Sabon. Spiekermann is too much for a first name, and nobody would figure out if the name were just Erik.\n\n"
    },
    {
      "time": "31 May 2007 — 11:28am",
      "content": "Just make sure your kids hear someone sing with their own voice so they know everyone doesn't sound like an electronic dog whistle.\n\n"
    },
    {
      "time": "31 May 2007 — 11:31am",
      "content": "Just know that \"sabon\" is the word for soap in some cultures.  \n\"Sabon, pass the sabon!\"\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 12:20pm",
      "content": "<cite>I goddam love goa.</cite>\n\nHrant, you're so... so... so 90's! Really man, step into the twenty-first century. Go pick up the new Mickey Avalon CD. Now those are some lyrics!\n\n"
    },
    {
      "time": "31 May 2007 — 12:35pm",
      "content": "90s?! Now that's an insult!\n\nWhat I like about the (alleged) lyrics in trance-style  \nmusic that they're stupid, but they know they're stupid.  \nThe don't pretend to be \"deep\" - all deep thought does  \nto music is bring it down. It's like how watching a soap  \nopera in a language you don't know is so much better.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 1:03pm",
      "content": "Hey, don't get me wrong, I like a good rave just as much as the next gal, and Soul Coughing is always on my playlist. But when it comes to lyrics I want something that yanks my chain, not senseless babble coming from the other room. And you're gonna have to do something drastic to get me to take back the 90's comment ;)\n\n"
    },
    {
      "time": "31 May 2007 — 1:11pm",
      "content": "You know, if you meant 1890s then I'm more than cool with that.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 1:40pm",
      "content": "Haha! My daughter begs me to put on Pink Floyd. She's 8. But she also asks for Raffi sometimes.\n\nOn the other end of things, I still love the music I grew up listening to at home (won't mention names, don't need the rolling eyes) and a lot of the stuff I loved as a teen I kinda think, muh.\n\nI love raffi, too. Especially when my kids sing it.\n\nType related: Once a week, my daughter has to write a response to a story she's read. Most of the time, she tries to rush through it, and she really doesn't have the neatest handwriting. The last time I started to get on her case for these really long descenders on the g and y. She said \"but mommy, it's nice and it does swish\" (making the motion with her hand). I smiled, but had to tell her to re-write parts of it that were close to illegible.  \n:)\n\n"
    },
    {
      "time": "31 May 2007 — 1:54pm",
      "content": "Just tell her it's anti-typographic, I'm sure she'll come right around.\n\nOh, and Raffi rules.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 5:16pm",
      "content": "Well, not to wander too far off track, but the O's on pedestals in one of the sample illustrations for _The Serif Fairy_ seems to have come from Marc Simont's illustrations in Thurber's _The Wonderful O_ (parents, read that one to your kids at least once a year!).\n\n"
    },
    {
      "time": "31 May 2007 — 5:20pm",
      "content": "\\>\\> My daughter begs me to put on Pink Floyd. She’s 8.\n\nLast year, when he was 9, my younger son got a gift card to Barnes and Noble. He spent most of it on two CDs from the music section, where he chose albums by Tom Petty and also The Doors.\n\n"
    },
    {
      "time": "31 May 2007 — 5:30pm",
      "content": "Now Tom Petty, he has some semi-decent lyrics.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2007 — 5:34pm",
      "content": "This book looks delightful, and I am sure I will purchase it very soon. I actually have a large children's book collection, and I especially enjoy my section dedicated to typography, such as Van Allsburg's \"The Z was Zapped.\" and Lane Smith's \"Math Curse.\"\n\n"
    },
    {
      "time": "1 Jun 2007 — 4:44am",
      "content": "My daughter is 17 months old, she's been dancing (!!!) to Kings of Leon, Pixies, Au Revoir Simone, CSS, The Long Blondes and such. I'm facinated...  \nShe also seem to appreciate my collection of magazines (and she doesn't even rip the pages off), so it seems that we share that common interest/passion.  \nI must admitt that I'd be kinda bummed if she doesn't turn out to have a strong sense of style/aestetics...\n\n"
    },
    {
      "time": "1 Jun 2007 — 6:52am",
      "content": "_...Pixies..._\n\nThis would save me a lot of problems: Can I adopt her? Or is it out of the question?\n\nƒ\n\n"
    },
    {
      "time": "1 Jun 2007 — 6:58am",
      "content": "yeah Pixies... especially the Doolittle album...\n\n"
    },
    {
      "time": "1 Jun 2007 — 6:58am",
      "content": "Virginie, is there any music she's <cite>not</cite> dancing to at this point? Our little one would dance to the faintest hint of any music at all, including grocery store isle crap. Now though he seems to have gotten bored of that. Must be my bad influence.\n\nhhp\n\n"
    },
    {
      "time": "1 Jun 2007 — 7:12am",
      "content": "lol, good point hrant...  \nI caught her dancing to the commercials' music on TV...\n\nPS = I must precise : \"dancing\" as waving her arms and shaking her little diapered butt...\n\n"
    },
    {
      "time": "1 Jun 2007 — 10:47am",
      "content": "ooh yes, i loved \"type detective story\". really cool.\n\nIs it fair to play eugenics with kids? i mean c'mon. How can u decide what a good taste in music is?\n\nshreyas\n\n"
    },
    {
      "time": "1 Jun 2007 — 11:38am",
      "content": "You can \"brainwash\" your kids all you want, but once they hit puberty, they will suddenly become less enamored of your musical taste, maybe even hate it, even if they liked it when they were younger. It's nothing to do with the music per se, it's that your kids will associate it with \"being a kid\" and everything that means. Later on, as adults, they will rediscover your music and find it to be unaccountably beautiful.\n\nThat's my theory, anyway.\n\n"
    },
    {
      "time": "1 Jun 2007 — 11:52am",
      "content": "_Later on, as adults, they will rediscover your music and find it to be unaccountably beautiful._\n\nAh, yes, the return of disco.... ;-)\n\n"
    },
    {
      "time": "1 Jun 2007 — 12:57pm",
      "content": "Music has long been a vehicle for rebelion. So if I force my daughter to listen to the Ramones, does that mean she'll run with a Chopin crowd in high school?\n\nI had the benefit of listening to my father's records growing up, which included Bowie, The Stones, Hendrix, and the like. I eventually stole all of those records, and now he listens to Andrea Boccelli. Go figure.\n\n"
    },
    {
      "time": "1 Jun 2007 — 1:41pm",
      "content": "Just hope that doesn't happen to you! :-(\n\nI grew up listening to everything from the Ink Spots (my parents' choice, not mine) to the Stones (when they played the blues), now it's mostly old Quebecois rock and minimalist classical (Cage/Glass/etc.).\n\n"
    },
    {
      "time": "1 Jun 2007 — 4:45pm",
      "content": "_does that mean she’ll run with a Chopin crowd_\n\nOr that druggie Berlioz...\n\n_unaccountably beautiful_\n\n\"My\" music was beat, not ballad. However, my lad has \"rediscovered\" Humpie. Go figure.\n\n ![](http://web.archive.org/web/20120421233552im_/http:/typophile.com/files/Engelbert-Humperdinck-A-Man-Without-Lov-376653_5790.jpg)\n\n"
    },
    {
      "time": "2 Jun 2007 — 5:18am",
      "content": "It's a little bit of a late reply, but I was out most of the day yesterday.  \nHrant, maybe you'll find a better appreciation for lyrics if you don't see them as a whole, but break them down to little pieces? Music has always been very imortant to me (unlike for the rest of my family; combined they don't even own half of my collection & they only occasionaly listen to them whereas I àlways have my headset on at home & never leave the house without my trusted MD walkman (the best \\*\\*\\*\\* buy I ever did)) & growing up I started paying more & more attention to the lyrics as well. There are still some I find close to poetry & others that sound worse each time you listen to them, but in almost every song, there's at least one thing that touches me. Not necessarely on an emotional level, but on a linguistic level as well. It can be something very plain, but described in a beautiful way (again I'm talking mere linguistics, no emotions attached). I write texts myself (mostly in English) which are probably best comparable with lyrics (without the music to accompany it). I've still kept the ones I wrote as a teenager & even though those are really predictable & overall crappy, there's always this one perfectly formulated sentence in each of them of which I am still proud to this day. Later on, I've started \"experimenting\" more with ambiguous texts & starting doing a lot of \"wordplay\". I have seen my texts evolving immensely in a few years time & I see the same evolution in the lyrics of some of my favourite bands. Right now, I'm completely consumed by the music of \"the Smashing Pumkins\" again (partially due to the upcoming new album) & the lyrics are mostly quite predictable, but there's an obvious evolution in them. The funny thing with them is that for a long time I misheard one part of the lyrics from \"Tonight, tonight\" & I was actually a bit disappointed when I read what they really said ;-)  \nI have many CD's from groups that might have benifited from limiting themselves to being instrumental, but if you'll look closely enough, you'll usually find something to appreciate. I have a little notebook in which I write everything that comes to mind that I can -at one point- use in one of my texts & I've also started writing stuff down from existing lyrics hoping to try & make a \"compilation text\" with them someday. A lot of them kind of lose their impact in the existing lyrics & some of them might even sound bad or pointless on their own, but they can gain beauty from using them with other lyrics. It's just a matter of finding the beauty in the beast. Putting a puzzle together with pieces from different puzzles & trying to make a nice (albeit abstract) picture nevertheless.  \nAs for learning to appreciate your parents' musical taste, I think I've developped a love for it that exceeds my moms... Like SD's dad, my mom has gone from the Stones to Boccelli-like stuff. She even comlains to me when I put the Stones on now (luckily she still likes Janis Joplin & Bob Dylan) ;-) It just goes to show that people have no definite taste & are always changing. I wouldn't call this evolving at this point 'cause it still seems to me that her taste is going downhill, but maybe I'll learn to appreciate it in time as well... Either way, I think people's personal tastes (not only in music) are always influenced by circumstances (mostly interests & the crowd you hang with), but as far a \"indoctrination\" goes, I don't think ànything can survive puberty, it's just plain murder in the first degree ;-)\n\n"
    },
    {
      "time": "2 Jun 2007 — 7:22am",
      "content": "My son likes to have loud music in the car. He also likes me to \"race\" the other cars (pass them) and he is starting pressure tactics to get me to buy either a convertible or a jeep. He's 4.\n\nBut, I like to listen to CBC so I can get the news (I don't read a daily newspaper or watch tv) and he gets very annoyed with all the talking. Occasionally I switch over to the rock station, CHOM, but often that's a lot of yapping too. More often than not, the little voice comes from the back seat asking me to turn it up at the first musical advertisement. :/ I've tried explaining it's not music, to no avail. But he also gets creeped out by the Floyd my daughter likes. He says it sounds like bad-guy music. :)\n\nThe question of how much influence we have is really interesting. I think often the most powerful influence is the one we don't really notice. The other stuff, like hoping or trying to direct them to certain interests or abilities seem to most often have little effect, except in the residual \"my dad wanted me to be a doctor like him and I've been a disappointment to him ever since I decided to go into widget-making.\"\n\nI do think parents pass on deeper (bad word choice, I know) characteristics, the kind that become a large part of who they are and how they see themselves. The interests, the skills, career, etc. are, in my opinion, pretty irrelevant.\n\nBad Saturday morning philosophizing. :)\n\n"
    },
    {
      "time": "2 Jun 2007 — 7:30am",
      "content": "<cite> Later on, as adults, they will rediscover your music and find it to be unaccountably beautiful. </cite>\n\nI'm with Mark, but to a certain extent, yes to Paul Simon no to Cliff Richard.\n\nHrant are you serious with: <cite> I hate lyrics </cite>? How can you hate lyrics?\n\n--N\n\n"
    },
    {
      "time": "2 Jun 2007 — 7:40am",
      "content": "I hate people getting paid to emotionally  \ntell me things I've already assimilated.\n\nhhp\n\n"
    }
  ]
}
