{
  "id": "34165",
  "title": "Do most designers on here use a PC or a Mac?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Please can we not have another war on this thread either :D What do you use and how effective is it? i personally feel that a Mac gives me more speed and freedom to work effectively, being wireless too, I can connnect to the Internet at my local university too anywhere and everywhere. Do you think PC gives enough speed and storage. Prove me wrong if you have to! :D Tell me more, tell me more... :D\n\n",
  "author": "<a href=\"/web/20090924021303/http://www.typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 31.May.2007 3.10pm",
      "content": "You can’t raise that topic without starting a war. It’s already been covered here, quite recently, do a search and find that thread. It was within the last few weeks.\n\nFound it: [http://typophile.com/node/32531](http://web.archive.org/web/20090924021303/http:/typophile.com/node/32531 \"http://typophile.com/node/32531\")\n\nFor the record I use a Mac.\n\nI was using my mother’s PC last week for internet stuff and found it ugly and cumbersome (not the machine, which was a cute little Dell) but the OS.\n\n"
    },
    {
      "time": " 31.May.2007 3.18pm",
      "content": "Sounds like a question by a neo-Luddite, good luck.\n\n"
    },
    {
      "time": " 31.May.2007 3.28pm",
      "content": "There are many things to like about Macs over PCs, but storage and wireless capability are not particularly among them. (Nor is “speed” in any literal sense - do you mean that you are or feel you are more efficient?)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 31.May.2007 3.36pm",
      "content": "For the record, I now officially believe that Miss Giggles is just a troll.\n\n"
    },
    {
      "time": " 31.May.2007 3.43pm",
      "content": "Yes, most designers in here use a PC or a Mac.\n\n"
    },
    {
      "time": " 31.May.2007 3.45pm",
      "content": "I prefer to set my type by hand.\n\n"
    },
    {
      "time": " 31.May.2007 3.45pm",
      "content": "Like I said in the previous thread, this is like asking what brand of chisel Michelangelo used.\n\nPersonally, I use a PC. I could probably switch to a Mac with no great loss of productivity. It’s not the computer, it’s what you do with it. Many bad designers use Macs. Many good designers use Macs. Many bad designers use PCs. Many good designers use PCs. Obviously the brand of computer being used has no bearing on quality of design.\n\nWireless access, speed, and storage capabilities are not specific to any brand of computer. A Mac could have a smaller hard drive than a PC, or vice versa.\n\nI don’t see why this debate keeps coming up over and over again. If you work better on a Mac, then use one. If you work better on a PC, then use one.\n\n- Lex\n\n"
    },
    {
      "time": " 31.May.2007 3.48pm",
      "content": "P.S. Offering PC and Mac as the only two choices is quite narrow-minded.\n\n- Lex\n\n"
    },
    {
      "time": " 31.May.2007 4.36pm",
      "content": "Buy Apple hardware and install Windows if you need to. Bam, best of both worlds, and you can decide for yourself if you like Windows or Mac OS better.\n\n"
    },
    {
      "time": " 31.May.2007 5.58pm",
      "content": "<cite>For the record, I now officially believe that Miss Giggles is just a troll.</cite>\n\nOr a griefer, cause everytime I read one of her insipid inquires, I think Good Grief.\n\n"
    },
    {
      "time": " 31.May.2007 7.29pm",
      "content": "<cite>Do most designers on here use a PC or a Mac?</cite>\n\nI would say yes.\n\n"
    },
    {
      "time": " 31.May.2007 7.53pm",
      "content": "Mac?\n\n"
    },
    {
      "time": " 31.May.2007 7.55pm",
      "content": "_(i refrain... \\*sigh\\*...)_\n\n"
    },
    {
      "time": " 31.May.2007 10.50pm",
      "content": "I got a pencil I particularly like. It’s non-repro blue. I like it from my paste-up days. I also use HB, No.2 and 2B pencils when I’m in the mood.\n\nI’ve got four computers: 3 Macs and 1 PC. One Mac is really really old, and kinda stooopid, which leaves me with two Macs and 1 PC. Today I like this Mac. Tomorrow, I might like the PC. If I’m in the mood.\n\n"
    },
    {
      "time": " 31.May.2007 10.53pm",
      "content": "_Yes, most designers in here use a PC or a Mac._\n\ngood answer!\n\n"
    },
    {
      "time": " 1.Jun.2007 2.21am",
      "content": "I mainly use a Mac, but do own a PC, too.\n\nI also got my nifty Amiga 4000 here :-)) But, the software running on it is a little outdated - although there are a lot of cool games, hihi....\n\n"
    },
    {
      "time": " 1.Jun.2007 2.42am",
      "content": "It IS general discussion... :D Does that mean we can discuss what we’re having for dinner tonight? Come on, I know design agencies who use a PC and I keep wondering why.\n\n"
    },
    {
      "time": " 1.Jun.2007 3.31am",
      "content": "It is cheaper. :-) Would be my guess, because that would be MY only reason for using a PC instead of a Mac. I surely can’t see any other reason for doing it. I have done things with Windows and Linux, but it’s either more work, or more annoying, or both.\n\n"
    },
    {
      "time": " 1.Jun.2007 7.35am",
      "content": "“Come on, I know design agencies who use a PC and I keep wondering why.”\n\nWhy not?\n\n"
    },
    {
      "time": " 1.Jun.2007 9.26am",
      "content": "Werfer speaks the truth. However, it is a generalization. We recently compared a PC system and a Mac system for video editing and the Mac ended up being less expensive.\n\n"
    },
    {
      "time": " 1.Jun.2007 10.12am",
      "content": "That’s what i’m trying to understand Darrell :) I need to know the pros and cons.\n\n"
    },
    {
      "time": " 1.Jun.2007 10.22am",
      "content": "I have never used an Apple but I did have an Amiga 500. Week-long Sim games were cool.\n\nMy husband can do beautiful woodwork with a well-sharpened chisel. Macs may be cool, but it’s the artist that really matters.\n\n"
    },
    {
      "time": " 1.Jun.2007 12.03pm",
      "content": "“That’s what i’m trying to understand Darrell :) I need to know the pros and cons.”\n\nWell, it depends on what you’re going to do with it.\n\nIf you’re comparing hardware, then you need to realize that it’s not a PC vs. Mac issue. It’s an Apple vs. Dell vs. HP. vs. Sony vs. Lenovo vs. Gateway vs. etc vs. etc vs. etc\n\nAnd then you have to compare the multitude of models available by each company.\n\nIn terms of the operating system, Windows and OSX and Linux are about 90% the same. They all do the basic same things, albeit in slightly different ways.\n\nIn terms of software availability, again, 90% of the tools an average graphic designer would use are available on either Windows or OSX platforms (or there’s an equivalent for either one).\n\nIn the end, if you are truly looking for a comparison, then you need to tell us your requirements for a machine. Based on that, then we can give you specific pros and cons.\n\n"
    },
    {
      "time": " 1.Jun.2007 9.41pm",
      "content": "Dearest Miss Giggles\n\nI’d suspect agencies use PC over Mac mainly because the hardware is cheaper, the software is better understood by the techs, etc. Mainly economics.\n\nApple does not hold anywhere near the market share that the PC/Microsoft does, and in the late 90s was almost a goner.\n\nI’ve been working with computers since 1970. I was using mini-computers and the internet in 1975. In 1985 I was setting type on proprietary systems. In 1990 I was introduced to the Mac. While I have used PCs and my wife has one and swears by them, no way in hell I would use anything other than an Apple product.\n\nThey aren’t necessarily expensive. I just buy used machines and gut them out. New processor, max memory, hard drive controller, video card, media ports; whatever it takes to get it to where it needs to be to function on a par with the newer than the newest. Cheaper and far more efficient than buying a junk new PC. The Mac OS is friggin unbelievably rock solid.\n\nGerald\n\n"
    },
    {
      "time": " 1.Jun.2007 10.14pm",
      "content": "While the debate remains ’which of the two options is the best’ (the one with the 95% market share or the one with the 5% market share) people will remain distracted from the real issue, the fact that there are only two choices.\n\nAt least there are choices other than Ford and Chevy, or Coke and Pepsi - can’t think of anywhere else (except government) where there are only two serious options. But it could be worse, take creativity software, is there any serious competition for CS?\n\n"
    },
    {
      "time": " 1.Jun.2007 10.36pm",
      "content": "Sii\n\nNo kidding. Also, is there any serious competition other than FL for font editing/creation software? any forthcoming option to OT? Ha! 1984 came 20+ years later than expected. “They” sure played their cards right.\n\nGerald\n\n"
    }
  ]
}
