{
  "id": "34177",
  "title": "Charlotte Sans. What do you think of it?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi\n\nI have started using Charlotte Sans at work and going to use it for a big project as it has Serif and Sans.\n\nWhat do others feel about it?\n\nAlso any views on using Zine Sans and Serif for a large project, corporate brochures and annual reports?\n\nCheers\n\n [‹ /need to get in touch with a greek designer/](http://web.archive.org/web/20080906234336/http:/www.typophile.com/node/3862 \"Go to previous forum topic\") [Do most designers on here use a PC or a Mac? ›](http://web.archive.org/web/20080906234336/http:/www.typophile.com/node/34165 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906234336/http://www.typophile.com/user/18568\" title=\"View user profile.\">technique</a>",
  "time": "<br>",
  "uid": "18568",
  "comments": [
    {
      "time": " 1.Jun.2007 4.25am",
      "content": "I used the Charlotte family, love it.  \nOnce I also tried to contact Michael Gills to ask him a question about the typeface.\n\n"
    },
    {
      "time": " 1.Jun.2007 4.33am",
      "content": "The typeface is not without it’s merits, but on a practical level, I really hate working with it. There’s something fishy about the font files, maybe I’ve got an old version.\n\nFor instance, look at the size of the cursor in Illustrator:  \n [http://www.flickr.com/photos/krautwald/524776957/](http://web.archive.org/web/20080906234336/http:/www.flickr.com/photos/krautwald/524776957/ \"http://www.flickr.com/photos/krautwald/524776957/\")\n\n"
    },
    {
      "time": " 1.Jun.2007 4.44am",
      "content": "Yes you are right, it was not like that on Mac OS 9, Andreas Krautwald.\n\n"
    },
    {
      "time": " 1.Jun.2007 5.06am",
      "content": "ITC has an OpenType version. Has anyone tried that?\n\n"
    },
    {
      "time": " 1.Jun.2007 5.09am",
      "content": "That might be worth looking into. A decent OpenType version of Charlotte should solve my problems.\n\n_edit_  \nThe ITC OT edition seems to be a few weights short of the old Letraset Charlotte family.\n\n"
    },
    {
      "time": " 1.Jun.2007 5.54am",
      "content": "\\>The typeface is not without it’s merits\n\nNor is the proper use of the apostrophe. ;-)\n\n"
    },
    {
      "time": " 1.Jun.2007 6.05am",
      "content": "So it’s worth giving it a go then? Had never heard of it before now, so you always wonder whether you should stick with something tried and tested.\n\nIt’s a very warm font.\n\nHaven’t seen the cursor issue with this. I am on MAC.\n\nAnything on Zine then?\n\n"
    },
    {
      "time": " 1.Jun.2007 6.33am",
      "content": "Very true, blame it on the rapidly approaching weekend . . .\n\n"
    },
    {
      "time": " 1.Jun.2007 7.13am",
      "content": "I haven’t used Charlotte, but the Zine family has a few annoying quirks, particularly in the serif version. This is a subjective view, of course.\n\nIn general, I try to stay away from using both sides of a sans/serif familiy together. It always seems like a safe and somewhat boring choice. Having said that, though, there are a number of other great faces in this camp:\n\nSmeijers’ Quadraat  \nMajoor’s Scala, Seria, and Nexus  \nChester’s Apex  \nStorm’s Sebastian/Serapion\n\nIf you’re into the work of Ole Schäfer, you might also consider using FF Fago (or Info) as the sans, and finding a contrasting serif to pair.\n\n"
    },
    {
      "time": " 1.Jun.2007 8.04am",
      "content": "And yes it is the weekend thank god!\n\nI like the sound of Sebastian and Serapion. Will check those out.\n\nYes Zine does seem to be a quirky old font but I do like it. Might be hard ot work with though.\n\n"
    }
  ]
}
