{
  "id": "34174",
  "title": "Jobs: Flash Developer Wanted",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "**Mid to Senior Flash Developer (Flash, Flex, Flash Lite)**\n\nPunchcut is growing our Flash team to support ongoing demand for FlashCast, Flex and Flash Lite opportunities to create desktop, rich web and device interfaces (portable media players, mobile phones). This is a full-time, permanent position for mid to senior-level Flash developers, to start immediately.\n\nThis is primarily a development position, but qualified visual designers with the required Flash skills will be strongly considered.\n\nThe developer should have a strong understanding of Flash development best practices, ActionScript 2.0 for web is required (AS 2.0 and 3.0 for Flash Lite are plusses). The candidate should be equally comfortable working both independently and alongside other dev team members. The ideal candidate has 5 years of experience developing web and mobile or device interface products and/or services and thrives in a fast-paced, creative, agency environment.\n\n**// Responsibilities**\n\nWork with multi-disciplinary teams to represent development perspectives during the design process\n\nMeet with clients to understand client technical requirements, present Punchcut’s development perspectives and propose development solutions and approaches\n\nUnderstand web and mobile user interface standards\n\nDevelop web-based Flash and Flex interfaces and applications\n\nDevelop mobile and device related Flash Lite interfaces\n\nSupport collaborative teams by creating Flash and Flash Lite prototypes of interaction models\n\nWrite development specifications and guidelines for client delivery\n\nWork with a multi-disciplinary team to evaluate the technical feasibility of proposed solutions\n\n**// Required Qualifications**\n\n5+ years developing interfaces for web and/or mobile sites or applications\n\nPrincipled adherence to object oriented development practices and versioning\n\nUndergraduate degree in relevant field and/or equivalent work experience\n\nSolid understanding of the user-centered design process\n\nAbility to communicate technical concepts and development rationale to non-developers and clients\n\nWillingness to learn new languages and platforms (Flex, FlashCast, XHTML, uiOne, etc.)\n\nFocused attention to detail\n\nSense of humor and positive, flexible attitude\n\nAbility to multi-task and work on or oversee multiple small-to-mid sized projects in parallel\n\nStrong interpersonal communication and problem-solving skills\n\nDesign firm or agency experience a strong plus\n\nThis position is located in San Francisco. Only candidates with proper permits to work in the United States can be considered. Punchcut is an Equal Opportunity Employer.\n\n**ABOUT PUNCHCUT**\n\nPunchcut is a user interface design company specializing in improving users’ experiences with mobile devices. We provide strategy, design, and development services — from user research to the complete design and development of custom interfaces and applications. Our clients span the wireless industry, including operators, device manufacturers, application developers, and leading entertainment brands. Our clients partner with us to create solutions that engage customers, streamline transactions, and enhance mobile user experiences.\n\nInterested candidates should email a resume and URL with work samples to work [at] punchcut.com.\n\n [‹ \"greek alphabet\" exhibition](http://web.archive.org/web/20070718033556/http:/typophile.com/node/33513 \"Go to previous forum topic\") [Berlin signage typeface ›](http://web.archive.org/web/20070718033556/http:/typophile.com/node/34166 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070718033556/http://typophile.com/user/1160\" title=\"View user profile.\">Joe Pemberton</a>",
  "time": "<br>",
  "uid": "1160",
  "comments": [

  ]
}
