{
  "id": "34183",
  "title": "Portfolio Advice",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just wondering what everyone's take is on portfolios.\n\nIn my final semester of college, we were required to create an identity for ourselves (applied to a resume, business card) and then were to incorporate that into a portfolio book. For most of the class, it became more about implementing that identity than focusing on how the work itself was presented. In my opinion, I don't think anyone generally gives a hoot about that identity - only the work in the portfolio.\n\nWhat is my best bet in presenting work in this industry?\n\nThanks for the help everyone. I always receive valid and helpful feedback here.\n\n",
  "author": "TypophileGirl",
  "time": "1 Jun 2007 — 11:33am",
  "uid": "17237",
  "comments": [
    {
      "time": "1 Jun 2007 — 11:59am",
      "content": "This is just my opinion, but I'm a fan of pragmatic design. I think it's a major part of succesful design.\n\nAs such, even though we we were pushed out the door as graduates with 16\" x 20\" black matte board with spray mounted work on it in a $160 black portfolio case that weighed about 200lbs, I think it was rather goofy in hindsight...and especially today when quality printing is so cheap and available.\n\nAs such, I'd suggest making a nice booklet...be it 8x11 or ledger or what have you. Color laser printed, nice cover. Something nice, but no so nice and expensive that you don't mind just leaving with the person you are interviewing with. I also like the idea of using removable bindings (I like the medical clips) to make it easy to pass items around a table when multiple people are viewing your work.\n\nAnd, of course, a handful of real, printed samples of pieces is always nice to have as well.\n\nNow, I'm sure someone else will come in and say that they are, actually, impressed with large hand-made industrial looking portfolio cases, and I imagine that's true, as well. Just not for me.\n\n"
    },
    {
      "time": "1 Jun 2007 — 12:01pm",
      "content": "In a school/university environment (I used to teach), the recommendation is always \"Show only your best work,\" the crème de la crème as it were, even if that's only a half-dozen pieces. I'm not sure I ever agreed with that.\n\nIn the \"real\" world (where i am now), it really comes down to what have you got, and what do you want to show? When I look at portfolios, I enjoy seeing lots of stuff; it's nice if it all hangs together, but I'm also impressed with a range of work.\n\nKeep in mind that you (likely) will not know the needs of the client/studio before you go in for your interview. You've only got the one shot (usually), so try to be flexible.\n\nFor example, my portfolio (now ancient) was a box-type case, fairly large (and not in the greatest shape - i got it used), and I stocked it with just about everything I could think of that I had created in the last $%#&! years. It still has some ancient stuff, including marker comps and airbrush comps, just in case. The last time I actually interviewed (most of my jobs have been word of mouth anyway), it turned out the studio was looking for more of an illustrator (rather than a designer), and my earlier (non-computer) sketches and technical illustrations came in really handy. After being hired, my position morphed into a designer (they already had good traditional illustrators, but they really needed a Mac guru/designer/art director).\n\nI know some out there will disagree, but I say put as much as you can into your book, then pull out and show the best when you get there, modifying it with what the needs of the client are. Start with the best, in case you've got limited time, but more often than not the interviewer will just keep asking to see more... we're artists too, and we love to see your work. Since you're coming out of school, you'll only have the wacky \"fictional\" stuff, but it reminds us of our school days. If you've got \"real\" world work, even banal stuff the client sucked the life out of, put that in too -- we all know too well the limitations of idiots, but \"real\" work shows more than talent... it shows experience.\n\nThe harder dilemma is putting together a \"drop-off\" package. You'll find a lot of job listings requiring you to either A) drop off or mail your book, or more likely B) mail in samples of your work. For this, you'll need to edit your choices of work down to a coherent, reasonable grouping, unless you're made of money and can afford all those color copies. The hardest part of this scenario is not being there to explain/highlight your work... it will have to stand on it's own, so don't be afraid to use some method (an outline, post-its) to briefly explain what they're looking at.\n\nGood Luck!\n\n"
    },
    {
      "time": "1 Jun 2007 — 12:07pm",
      "content": "\"Now, I’m sure someone else will come in and say that they are, actually, impressed with large hand-made industrial looking portfolio cases, and I imagine that’s true, as well. Just not for me.\"\n\n--I'm impressed with big metal industrial cases because I always wanted one (so d\\*mn expensive)!\n\n"
    },
    {
      "time": "1 Jun 2007 — 12:50pm",
      "content": "Have different portfolios for different interviews. If you’re going to a publishing house, they probably don’t give a damn about your self-banding. A big marketing firm, OTOH, might be really impressed by it. This is why it’s so easy to swap the pages in and out of portfolios.\n\nDon’t try presenting stuff on boards unless you have to. Remembering the order and what to say about them is a bugger. If you want something that’s less sterile, design a portfolio book (I know a guy who leaves handmade casebound portfolio books behind at interviews.) that has the feeling you want.\n\n"
    },
    {
      "time": "1 Jun 2007 — 1:17pm",
      "content": "I saw a portfolio someone had done as through iPhoto - cloth bound. It looked very nice.\n\nI used to do the black matte board thing too, very cumbersome. Then I switched to a black leatherette binder which did the trick because I can swap things in and out for different clients. And I bring along a sampling of books I've done, also customized for the client.\n\n"
    },
    {
      "time": "1 Jun 2007 — 1:26pm",
      "content": "Well, I teach in the \"real\" world and I have a \"virtual\"`.pdf` portfolio, still I can say that the effort I put designing a book (hardcover, letterpress in Quirinus) with many \"extra\" pieces (by the way alienated under \"academic works\" for the sake of uniformity or the hell of it), led me to the great experience of studying in Helsinki yet living in Finland.  \nSo \"my\" advice is, _What is life if, full of care / We have no time to stand and stare._\n\n"
    },
    {
      "time": "1 Jun 2007 — 1:59pm",
      "content": "Well yes, the most important thing nowadays is a good web site.\n\n"
    },
    {
      "time": "1 Jun 2007 — 3:24pm",
      "content": "Seems that “appropriacy” as a word applied to “Design/Aesthetics” was discussed for the first time in Plato’s “Ippia Maggiore” (“Hippias Major”), a dialogue between Socrate and Ippia, where the case of having a wooden spoon or a golden spoon was one of the topics.\n\n"
    },
    {
      "time": "1 Jun 2007 — 4:22pm",
      "content": "<cite>I saw a portfolio someone had done as through iPhoto - cloth bound. It looked very nice.</cite>\n\nThat’s one of the best ideas I’ve heard for a portfolio. Maybe even better than Lulu.com.\n\n"
    },
    {
      "time": "2 Jun 2007 — 2:20am",
      "content": "James Puckett started this [thread](http://web.archive.org/web/20120727034522/http:/typophile.com/node/32815)——more posts via the [search](http://web.archive.org/web/20120727034522/http:/www.google.com/search?q=site:typophile.com+portfolio) engine.\n\n"
    }
  ]
}
