{
  "id": "34190",
  "title": "(x) Bumble and Bumble sans - Avenir {Mark S}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hey Yves (or anyone), do you know what type does this composition is set in? It's not set in Gotham, I think, though it's pretty close.\n\nThe site's [here](http://web.archive.org/).\n\nThanks much!\n\n| Attachment | Size |\n| --- | --- |\n| [bumble and bumble.png](http://web.archive.org/web/20131010194240/http:/typophile.com/files/bumble%20and%20bumble.png) | 11.13 KB |\n\n",
  "author": "brampitoyo",
  "time": "1 Jun 2007 — 7:39pm",
  "uid": "13047",
  "comments": [
    {
      "time": "1 Jun 2007 — 8:23pm",
      "content": "Actually, I think it IS set in Gotham.\n\n"
    },
    {
      "time": "1 Jun 2007 — 9:18pm",
      "content": "Looks more like Avenir to me.\n\n"
    },
    {
      "time": "2 Jun 2007 — 2:05am",
      "content": "Looks like Nobel to me.\n\nGeorge Triantafyllakos - backpacker.gr\n\n"
    },
    {
      "time": "2 Jun 2007 — 4:01am",
      "content": "Just confirming that this is definitely Avenir Demi. The lowercase \"a\" gives it away. (Tip: if you're trying to ID type in a flash movie, you can often use the context menu to zoom in to see more detail.)\n\n ![](http://web.archive.org/web/20131010194240im_/http:/typophile.com/files/bumble_4066.gif)\n\n"
    },
    {
      "time": "3 Jun 2007 — 12:02am",
      "content": "Mark, you killed it. One day I'll be as good as you (no hope in getting as good as Yves, though :) in IDing type. And great tip on that, SD. At that size, it does look like Avenir. I'm surprised that it looked 'humanist' on small sizes, even when set in all caps.\n\nPS. did I see an apostrophe in there :) ?\n\n"
    },
    {
      "time": "3 Jun 2007 — 5:32am",
      "content": "Well, Avenir _was_ Frutiger's humanist take on Futura.\n\nFrom Linotype:\n\n<cite>\"Adrian Frutiger designed Avenir™ in 1988, after years of having an interest in sans serif typefaces. In an interview with Linotype, he said he felt an obligation to design a linear sans in the tradition of Erbar™ and Futura® , but to also make use of the experience and stylistic developments of the twentieth century. The word Avenir means 'future' in French and hints that the typeface owes some of its interpretation to Futura. But unlike Futura® , Avenir™ is not purely geometric; it has vertical strokes that are thicker than the horizontals, an \"o\" that is not a perfect circle, and shortened ascenders. These nuances aid in legibility and give Avenir a harmonious and sensible appearance for both texts and headlines...\"</cite>\n\n"
    },
    {
      "time": "4 Jun 2007 — 11:50am",
      "content": "Well, some says that Avenir _is_ a better Futura, so... I still think that it's more geometric than humanist in spirit, though. Well, okay, maybe it's more 'tough' and 'sturdy' rather than 'geometric' proper; but it's also warmer than, say, DIN.\n\n"
    }
  ]
}
