{
  "id": "34212",
  "title": "How to \"sharpen\" the font?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I don't really know if I'm in the right forum, but this is my problem - I have chosen Perla for my logotype and posted another topic about that a while ago when I needed help to make an image out of it. Every single person I asked - and I talked to about ten or so - gave me different solutions how to do that, but I followed Lherrou's advice - thank you! :-) But I took the easy suggestion and not the one including CSS. It worked, but the font looks \"grainy\" and not sharp enough. My question is - does the \"CSS way\" make the font sharper? Or is there another way I can do that? I paid quite a lot for that font and I love it and it's a big part of my web site so it's really bad if I can't make it look better. Would be really grateful for some help! :-)\n\n",
  "author": "Charlotta",
  "time": "3 Jun 2007 — 5:27am",
  "uid": "17880",
  "comments": [
    {
      "time": "3 Jun 2007 — 7:21am",
      "content": "If you're making an image out of the font, CSS has nothing to do with it (it has nothing to do with rendering quality anyway), and what you're encountering is the limits of resolution of the screen: there aren't enough pixels to make small text look very nice (especially for something as expressive as Perla). One thing you should check is that (if you're using Photoshop) the text rendering (the \"aa\" field) is set to \"Smooth\" and not \"None\". But if it is set to smooth and you're still unhappy then it means there's only one way to go: painting the individual pixels by hand to get the maximum quality. The thing is, this is pretty hard to do yourself, and pretty expensive to get somebody else to do.\n\nBut I'm sort of guessing here, and I might be off concerning  \nwhat you're unhappy with, so showing an image would help.\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2007 — 7:21am",
      "content": "Could you show an example?\n\nPerla has fine details that will get lost at smaller sizes. I don't know what you mean by \"CSS way,\" but CSS can't sharpen a graphic. There are ways to adjust the antialiasing in Photoshop which can affect the sharpness.\n\nEdit: Hrant beat me to it, but we're saying the same thing.\n\n"
    },
    {
      "time": "3 Jun 2007 — 9:31am",
      "content": "Hrant - Thanks for the advice - I set it to Smooth and it got a bit better but not as sharp as it looks when I type it in Word. And obvioulosy there's no way I can paint the pixels myself, let alone pay someone. Truthfully, I have no idea how to do it even theoretically.\n\nScott D - Yes, Perla has these really fine details in the lower case letters, especially with the a:s and e:s. I mentioned CSS because that came up when I was going to convert the letters to an image and I just wanted to know if that could improve the quality.\n\nAn example of the text that's \"grainy\"?\n\n"
    },
    {
      "time": "3 Jun 2007 — 9:45am",
      "content": "\\> not as sharp as it looks when I type it in Word.\n\nThat's not surprising, especially if you have ClearType enabled.  \nBTW if you like the Word rendering better, you can use it! Just  \ndo a screen-grab of the Word setting and bring it into Photoshop.\n\n\\> I have no idea how to do it even theoretically.\n\nYou just zoom in in Photoshop and click away,  \nwith the pencil tool, set to one pixel. But that  \n\"just\" is deceptive...\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2007 — 9:51am",
      "content": "In general, this has to do with [hinting](http://web.archive.org/web/20120625104701/http:/www.myfonts.com/activity/hinting/). Most fonts simply don't look good in small screen sizes unless they're extensively tweaked (\"hinted\") with low resolution in mind. Fonts such Verdana, Arial or Times New Roman have undergone months of manual hinting done by best experts in the field.\n\nA.\n\n"
    },
    {
      "time": "3 Jun 2007 — 10:01am",
      "content": "hrant - \"Screen-grab\"? You're talking to a rookie here. I need a lot more information than that.\n\ntwardoch - \"Hinting\" - that's a new term I just learned! I consider myself pretty smart but in this field I really have very little clue. What is kerning? Is that when you make a space between every letter in a word, or something like that?\n\nBTW - You talk about smaller sizes and small screen sizes - how small is that?\n\n"
    },
    {
      "time": "3 Jun 2007 — 10:09am",
      "content": "On Windows you do a screen grab by hitting the Alt-PrintScreen key sequence;  \nthen you do a Paste in Photoshop. On Mac I think it's Shift-Option-1 or something,  \nI forget; then you load up the screen grab file that's on the desktop.\n\nHinting and kerning are different things. The kerning you might need  \nto worry about is manual spacing adjustments between letters in a given  \nsetting to make the spaces balance. But in Word this is quite tedious, so it  \nmight be better here to nudge things around in Photoshop.\n\nSmall, for a normal font, is less than about 24 pt (18 pt in \"native\"  \nWindows). But for a font like Perla the threshold is much higher.\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2007 — 10:53am",
      "content": "Thank you! I did that and it worked (I've never done that Alt-Printscreen-thing before, good to know!). But I don't know how it's going to look when I load it up. I think Perla looks great in 72 pt, but that's apparently too big for a normal size screen - or so I've been told. (I mean, in doing a web site with all these \"frames\". I'm not doing that myself, I have help.)\n\n"
    },
    {
      "time": "3 Jun 2007 — 11:08am",
      "content": "BTW the Alt is for grabbing the active window.  \nWithout the Alt it grabs the whole screen, which is generally less useful.\n\n\\> I don’t know how it’s going to look when I load it up.\n\nIt will look the same, unless you scale it, which is almost never  \na good idea however. But it will look a bit lighter on Macs.\n\nIf you're trying to figure out how large your images  \nwill come out on your users' screens, all you have to  \ndo is factor in your own screen's size, comparing it  \nto the typical screen size, which is about 1024×768.\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2007 — 11:12am",
      "content": "Yes, 1024x768 is what we're doing. Just wanted to make sure - from a pro - that I can't make it bigger. Feel free to make suggestions on a new topic I just posted about fonts. If you want to. And thank you.\n\n"
    },
    {
      "time": "3 Jun 2007 — 11:25am",
      "content": "Web page sizing is actually a somewhat complex issue,  \nit's not just a matter of determining some maximum.  \nBTW, I don't consider myself a pro at web design.\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2007 — 12:00pm",
      "content": "Yep, I would use Perla in large sizes only on screen, generally bigger than 48 pt. And use it for display purposes (headings and such), not lengthy copy.\n\nAs for the \"ideal\" size of a web page, it depends on your content, layout, and audience. You're probably fine with a design that has an overall width of less than 1024 pixels these days. Just keep your line length around 66 characters for copy or it will become difficult to read.\n\n"
    },
    {
      "time": "3 Jun 2007 — 12:19pm",
      "content": "A great trick is to use layers in PhotoShop. Just duplicate the textlayer several times. Play with the settings (eg bottom smooth, second layer sharp with 50& opacity, and so on). This way the end result is way beyond what PS can do out of the box.\n\nAnother trick is to build the type-images at twice or thrice the required size and downsample them in the end, where the different GIF-settings provide alternative endresults.\n\n"
    },
    {
      "time": "4 Jun 2007 — 4:30am",
      "content": "Thank you for all your advice - I've tried everything  \nexcept painting the pixels myself and even though  \nit improved, it doesn't look good enough.  \nIt's very frustrating since I spent so long  \nsearching for the perfect font and now I might  \nbe forced to launch my web site with an unsharp logotype. :-(\n\nBert - Thank you for the suggestions! I'll try to do what you recommended today. One question - when you say downsample, do you mean just make the size smaller? (I'm sorry if I sound like an idiot, but most of the \"typographical lanuguage\" and web design techniques is like greek to me.) :-)\n\n"
    },
    {
      "time": "4 Jun 2007 — 5:02am",
      "content": "It should be no problem to create good \"type graphics\" in PhotoShop. But it's impossible to see where your problems are if you don't show us what you have done so far. Just \"Save for Web …\" in PhotoShop and upload the image here.\n\n"
    },
    {
      "time": "4 Jun 2007 — 7:11am",
      "content": "Charlotta...please post some samples so we can take a look at them.\n\nMake sure you are saving your type as GIF files and are optimizing the color pallet to best cater to the type color.\n\n"
    },
    {
      "time": "4 Jun 2007 — 8:14am",
      "content": "Yes, of course I need to show an image in order for you  \nto help me and I was going to do that yesterday when I  \nwas adviced not to. A person working close to me (with PR  \nand marketing) thought it wouldn't be smart to display my  \nlogotype in a forum. (?)  \nSeriously, would that be stupid of me? I just remember when  \nI revealed the two names of my collections in this forum and  \nwas adviced to register the trademark before another  \ncompany stole my ideas. I've been accused of nagging  \nabout this - but I am really new at all of this -  \nmarketing, graphic design, rights and trademarks -  \nso I just don't want to make a mistake.  \nI'm trying to be responsible here. :-)\n\n"
    },
    {
      "time": "4 Jun 2007 — 10:16am",
      "content": "You don't have to use your logotype for the sample images. Just make up a new name! ;-)\n\n"
    },
    {
      "time": "4 Jun 2007 — 11:30am",
      "content": "I know, I am actually doing that. Such an easy solution... :-)\n\n"
    },
    {
      "time": "4 Jun 2007 — 12:29pm",
      "content": "Here it is, the way it looks on the internet. Am I a perfectionist  \nfor thinking that this does not look any where near okay?  \n(People around me think I should just be satisfied and go  \nfor it. If the majority of people in this forum think it’s  \nfine, I will, but first I want an opinion from the  \n“professionals” in this forum.) It’s looks perfectly fine in Dreamweaver but then it ends up looking like this.  \nI’m having a very pale pink background to the black font  \nand this is suppose to be the start page.  \nIs there any way I can fix this without having to go to a graphic designer? I would be SO grateful!! :-)\n\nI can post a link if it’s easier to view the whole picture on the screen.\n\n ![](http://web.archive.org/web/20120625104701im_/http:/typophile.com/files/sample_3880.gif)\n\n"
    },
    {
      "time": "4 Jun 2007 — 12:40pm",
      "content": "This image uses a limited (and not optimized) color palette of 8 colors. In which color mode do you work in Photoshop? It should be RGB or Greyscale, so Photoshop can use the correct colors for anti aliasing the text.  \nWhen you export for Web Photoshop can reduce the color palette. Choose \"selective\" here.\n\nThe ornament doesn't use greyscale/anti aliasing at all. You can get a better result if you scale down a larger version (as described before).\n\nRalf\n\n"
    },
    {
      "time": "4 Jun 2007 — 1:00pm",
      "content": "There really is no way you are going to be able to use this typeface any any size smaller than what you see there online without massive hand tweaking at the pixel level. The stroke width contrasts in this face are just too extreme.\n\nThat said, I'm always up for a challange and managed to come up with this::\n\n ![](http://web.archive.org/web/20120625104701im_/http:/typophile.com/files/perla_4284.gif)\n\nStill needs a lot of tweaking but is maybe passable. I took your source file, reduced it to 50% using bicubic interpolation, duplicated the layer, set the top layer to 'multiply' mode, then tweaked the opacity of the top layer to suit.\n\nI then merged that and reduced it down to 75% of that.\n\nThe next step would be to go back in at the pixel level and make sure the horizontal strokes are truly just one pixel thick.\n\n"
    },
    {
      "time": "4 Jun 2007 — 5:22pm",
      "content": "\"Yes, of course I need to show an image in order for you  \nto help me and I was going to do that yesterday when I  \nwas adviced not to. A person working close to me (with PR  \nand marketing) thought it wouldn’t be smart to display my  \nlogotype in a forum. (?)\"\n\nYes, heaven forfend you post your logo on the internet so we can help you fix your logo, which you're going to post on the internet.\n\n"
    },
    {
      "time": "5 Jun 2007 — 2:01am",
      "content": "Ralf Hermann and Aluminium - Thank you so much for your help! :-)  \nI was going to try your suggestions last night - with some  \nhelp - but couldn't log on to Typophile to get the info.  \nI am doing it today and I hope I can make it look better.\n\nBut if not - the question is, do you think it looks so  \nbad that I should find another font? Or is it acceptable?  \nI'd be deeply grateful for opinions on this.\n\n\\> Yes, heaven forfend you post your logo on the internet so we can help you fix your logo, which you’re going to post on the internet.\n\nMaybe you didn't understand? I haven't launched the site yet.  \nThis is a logotype for a new business and there could be  \na risk that someone would \"steal\" or copy an idea and then  \nI would end up looking like the copy cat. There are thousands  \nof visitors here every day so I don't think my concern was  \ncompletely unfounded. There's no need to be sarcastic.\n\n"
    },
    {
      "time": "5 Jun 2007 — 6:47am",
      "content": "\"This is a logotype for a new business and there could be  \na risk that someone would “steal” or copy an idea \"\n\nThey could infringe on your copyright or patent, but we have laws for that. I wouldn't loose too much sleep over it.\n\nAs for the typeface, I guess that's your call. It definitely isn't a face that scales well on-screen, but if you find it acceptable, go for it.\n\n"
    },
    {
      "time": "6 Jun 2007 — 1:26am",
      "content": "Aluminium - Thanks! If I can't make it look better in black,  \nI might try another softer color, maybe that will \"disguise\"  \nthe fact that the font isn't sharp. It's really sad though  \nbecause I do love Perla and it wasn't exactly cheap.  \nIf I had known this fact about fonts and having to make it into an image, I would've thought twice. But now I know better -  \ntrial and error. :-)\n\n"
    },
    {
      "time": "6 Jun 2007 — 10:54am",
      "content": "I’m very curious as to what is happening. It’s certainly not the font. It must have something to do with the method you’re using to produce the image.\n\nHere is Perla set in Photoshop at the same size as your example. I have used the four anti-aliasing method provided in Photoshop CS2 to show the subtle variations in rendering that can occur. (Top to bottom: Sharp; Crisp, Strong, Smooth) The bottomost example shows Perla with anti-aliased turned off completely.\n\nI would argue that all of these (save the aliased version) are acceptable.\n\n ![](http://web.archive.org/web/20120625104701im_/http:/typophile.com/files/Photoshop002_5474.png)\n\nAgain, here are the same samples scaled to 50% of the original size in Photoshop. Still nowhere near as chunky as the example you posted.\n\n ![](http://web.archive.org/web/20120625104701im_/http:/typophile.com/files/Photoshop003_4130.png)\n\nWhat file format are you saving the image as?\n\n"
    },
    {
      "time": "6 Jun 2007 — 10:17pm",
      "content": "Grant, that \"sharp\" version looks very nice.\n\nI have heard that Photoshop may not be the best program for saving out fonts as images for the web. Though the person who told me this didn't reveal a better product (perhaps fireworks?) Apparently there is software that can render better than PS with certain fonts. I generally set to sharp myself (my work is almost exclusively websites).\n\n"
    },
    {
      "time": "7 Jun 2007 — 5:36am",
      "content": "Fireworks has finer anti-aliasing controls. I hoped that CS3 would provide a similar slider/numeric control for this...\n\nI mean, has anyone ever been able to tell the difference between \"crisp\" and \"smooth\" anti-aliasing in Photoshop CS2? Look at Grant's second and fourth examples above.\n\n"
    },
    {
      "time": "7 Jun 2007 — 10:00am",
      "content": "Scott,  \nYup, I always found the biggest differences to be between \"strong\", \"sharp\" or \"none.\" I can't ever remember using crisp or smooth. Both add too much aliasing in a blurry way for my taste.\n\nDo you have CS3 and are saying there's really no improvement in the aliasing controls?\n\nThanks for the heads up on Fireworks. Between that and some of the vector controls that are nicer, it might be worth sucking up a few hundred bucks for.\n\n"
    },
    {
      "time": "7 Jun 2007 — 10:09am",
      "content": "I tend to prefer Smooth - not least because my  \nown grayscale pixelfonts rely on that setting.\n\nhhp\n\n"
    },
    {
      "time": "7 Jun 2007 — 1:34pm",
      "content": "I don't find Fireworks particularly useful, but there are a few things like text anti-aliasing and export options that would be nice to see in Photoshop. Who knows? It's all one company now. Maybe Adobe will start integrating Fireworks and Photoshop the way the used to do with Image Ready (a truly useless program).\n\nAs for CS3 -- I've heard there have been \"improvements\" but I have yet to test them.\n\n"
    },
    {
      "time": "7 Jun 2007 — 4:40pm",
      "content": "_\"my own grayscale pixelfonts\"_\n\nHrant, do you know where I might look to learn about creating grayscale pixelfonts? Thanks.\n\n"
    },
    {
      "time": "7 Jun 2007 — 6:20pm",
      "content": "The making of grayscale pixelfonts is a black art (pardon the pun).  \nSomebody wanting to learn it from me would need to emulate Kis.\n\nhhp\n\n"
    },
    {
      "time": "7 Jun 2007 — 7:58pm",
      "content": "watch your step. don't you remember \"the sorcerer's apprentice\"?\n\n"
    },
    {
      "time": "7 Jun 2007 — 8:44pm",
      "content": "Hrant, I would attempt to emulate whatever you ask. Even 'Kis' if I knew what it was.\n\nI thought maybe you could just point me in the direction of some tutorials or specialist software. But if the process is a cunning contrivance you worked out for yourself, then fair enough.\n\nWould I be right in thinking it involves applying a virtual pixel grid in a vector font making program and then filling the virtual pixels with a percentage of solid vector that would equate to the subpixel sampling greyscale level?\n\nSorry. That sounded like I was masturbating pure techno jargon. But I think it made some sort of sense.\n\n"
    },
    {
      "time": "7 Jun 2007 — 9:22pm",
      "content": "Kis had agreed to leave The Netherlands after learning punchcutting. I'm pretty sure you wouldn't like to engage in the cyberspace equivalent. :-) So since you're bereft of a practical place to leave to...\n\nIt's not my invention, and I wouldn't call it \"cunning\" - although there typically is an \"Ah! Why didn't I think of that?!\" moment when one finds out the (main) trick: in terms of bezier mechanics, you simply need to think of a 4×4 subgrid. This is actually patented, but the patent owners (not me) have decided not the enforce it.\\* The way you get to a 4×4 subgrid pixelfont varies; ideally you use the Ultrafonts converter (don't ask for it dude) which saves you a <cite>lot</cite> of time, by taking a GIF image of a glyph matrix and spitting out a TT font; but you can roll your own too.\n\n\\* Like Mercedes does (used to do?) a lot in the interest of safety. Pure class.\n\nThe thing is though, the bezier mechanics is the (potentially) tedious, but easy part; the really hard, zen-mastery part is striking a quite peculiar balance, one not present in either 1-bit pixelfonts or outline fonts: a balance between design fidelity, crispness, and even color. When you get \"in the zone\" of this balance, it's really quite unlike anything else in type design, and it's very brain-draining to keep properly focused. Somewhat like kerning, but without anything to write on paper to keep yourself on track, and with a lot more guesswork, experimentation and definitely way more squinting. You literally find yourself moving your upper body like a cobra in a trance. And all this doesn't even address the gamma issue: between platforms, but also between normal and \"reverse-video\" setting.\n\nA totally different way is not to use an outline font, but to use something like BitFonter (now available for Windows - yay!) to produce a \"true\" bitmap font, which now can be grayscale, or even full color. But pixelfonts still have the advantage of being easier to deploy and more robust, especially cross-platform from what I gather.\n\nhhp\n\n"
    },
    {
      "time": "8 Jun 2007 — 1:16pm",
      "content": "_\"So since you’re bereft of a practical place to leave to\"_\n\nI wouldn't mind going to Transylvania to print bibles. It might be fun. For a weekend.\n\nThanks, Hrant, for your explanation. I'm not sure I understand everything you said. I shall commune with some spirits and hope for an epiphany or two.\n\nIf the Zen like process you speak of is like anti-aliasing by hand then I'm already rather adept thanks to years of pushing pixels in DPaint on an Amiga. Happy days.\n\nI would be satisfied with creating just one grey level for a pixel font in outline format. I wonder if I could generate a 50% grey pixel by dividing a single grid square into 2 equal triangles and leaving the outer one empty?\n\nHmmmm. Now where's that old copy of Fontographer?\n\n"
    },
    {
      "time": "8 Jun 2007 — 1:36pm",
      "content": "Ah, a fellow Amigan! That explains a lot. :-)  \nYes, your previous experience would be invaluable here.\n\nBTW in practice you need at least 5 grays (I mean including black and white) to  \nbreak into good usefulness; I originally made Mana-16 with only 4 grays, and  \nyou can tell the compromise is too great. In the other two sizes I ended up using  \nmost of the 17 (spooky number, I know) available grays.\n\nhhp\n\n"
    },
    {
      "time": "8 Jun 2007 — 2:01pm",
      "content": "Thanks, Hrant. Much appreciated.\n\nMay the voluptuous Amigan queens of the planet Amiga abduct you for sexual experimentation and fine cuisine testing.\n\n"
    },
    {
      "time": "8 Jun 2007 — 2:20pm",
      "content": "Well thank you - thank you very much.  \nAnd I hope that \"and\" means \"integrated with\".\n\nhhp\n\n"
    },
    {
      "time": "8 Jun 2007 — 3:51pm",
      "content": "Oh, of course. As you already know everything's better on planet Amiga.\n\n(Insert your own Amiga multi-tasking capability joke here.)\n\n"
    },
    {
      "time": "8 Jun 2007 — 4:08pm",
      "content": "Did somebody say... Fast RAM?\n\nhhp\n\n"
    }
  ]
}
