{
  "id": "34219",
  "title": "What digital camera do you use?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Just wondered what digital cameras board members use and recommend? My 3 year old point & shoot Samsung still does the job, but is starting to look very bulky and outdated.\n\nSo i’m looking to get something new, i’ve got around £250 to spend, and want another point & shoot (I can’t afford an SLR & would miss the convenience) but I want something with a little extra quality which really makes it stand out from the crowd.\n\nI’ve been looking at the new Panasonic Lumix DMC-TZ3EB-K [http://www.panasonic.co.uk/high-zoom/dmc-tz3eb-k/index.htm](http://web.archive.org/web/20080704154316/http:/www.panasonic.co.uk/high-zoom/dmc-tz3eb-k/index.htm \"http://www.panasonic.co.uk/high-zoom/dmc-tz3eb-k/index.htm\") which has a great 28mm lense and lots of features, but what would you spend your money on? thanks.\n\n [‹ Type & Design Education Forum at TypeCon](http://web.archive.org/web/20080704154316/http:/www.typophile.com/node/34817 \"Go to previous forum topic\") [Spot/Process Question ›](http://web.archive.org/web/20080704154316/http:/www.typophile.com/node/34779 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080704154316/http://www.typophile.com/user/18805\" title=\"View user profile.\">do</a>",
  "time": "<br>",
  "uid": "18805",
  "comments": [
    {
      "time": " 3.Jun.2007 11.06pm",
      "content": "You do know this site right? [http://dpreview.com/](http://web.archive.org/web/20080704154316/http:/dpreview.com/ \"http://dpreview.com/\")\n\n"
    },
    {
      "time": " 4.Jun.2007 3.26am",
      "content": "I second the recommendation to look at [www.dpreview.com](http://web.archive.org/web/20080704154316/http:/www.dpreview.com/ \"www.dpreview.com\"). Then look at the Canon Powershot cameras - I have bought a number of them for family and school use and they are great. Small - strong - and feature rich.\n\n"
    },
    {
      "time": " 4.Jun.2007 4.28am",
      "content": "Anti-shake is good, although it doesn’t work if people in the picture are moving. I also specifically chose a camera with the 28mm wide angle range; not all cameras have that. Olympus cameras have good color reproduction, which for me was an important factor. Some camera review websites have downloadable sample photos, which I would encourage you to download and take to your developer and then compare the prints rather than going mental over pixels on the screen.\n\n"
    },
    {
      "time": " 4.Jun.2007 7.07am",
      "content": "I have a 5 year old 3mp Canon Powershot. It was great, but I figured it was time for an upgrade.\n\nGot talked into a Sony cybershot 7mp camera.\n\nI hate it.\n\nHate it, hate it, hate it.\n\nHATE IT!\n\nCappy interface, crappy image quality. CRAPPY connection to my Macbook.\n\nSince then, I’ve done enough research to safely feel that the best advice for any digital camera is simply: “canon”...at least at the consumer/prosumer levels.\n\n"
    },
    {
      "time": " 4.Jun.2007 7.41am",
      "content": "dpreview is great.\n\nI have had 4 digicams. First was a 3 MP Olympus which I just loved but it was bulky. Then I got a 4 MP Canon Elph which I didn’t like because you couldn’t set it so the flash was on off. It busted after 2 years. I currently have two. One is a Canon S80 which is a fantastic camera (and no longer available) but not that tiny. I brought it to the beach once however and a grain of sand lodged in the mech. The sand worked itself out (thank god) but as a result I ordered from eBay a used Panasonic/Leica 5 MP to toss around. It’s a sweet little camera but no viewfinder and a grainy display (improved in the newer Panasonics). The pics are fine, but the display looks like they just enlarged a 2” to 2.5” without increasing the resolution.\n\nMy father has that 7MP Sony and it is a ridiculous camera - 4 clicks to delete a photo!\n\nProblem is, no camera yet has all the features I want in the right package. Anti-shake is very good, they all have big screens and at least 3x zoom. I think the lens is key, which is why I’d stick with Canon, Panasonic (Leica lens) or Sony (Zeiss). I don’t think Nikons have anti-shake yet, and I think the Canon Elphs are much better now than they were when I had mine a few years ago. Touchscreen menus seems like a bad idea to me because of fingerprints on the display, but some people find the controls too small.\n\nOne of my beefs is that a lot of them don’t have an optical viewfinder anymore. I still use that in bright light.\n\nSo... my advice is to isolate the two or three features most important to you - size, viewfinder, manual capabilities, aspect ratio, etc. Narrow down your search to a few, and then go mess around with them in a camera store. Definitely figure out how to delete a photo before you buy because you’ll want to be able to do that easily. Also see how to switch modes. And the ability to view your pix without having to actually turn on the camera (and extend the lens) is nice. My Canon S80 has a separate button for that, it’s not on the mode dial, I like that.\n\nAnother beef with the Elph I had was that the on/off button was right next to the shutter and I can’t tell you how often I shut the camera off instead of taking a pic. Dunno if they’ve fixed that on the current Elphs.\n\n"
    },
    {
      "time": " 4.Jun.2007 8.07am",
      "content": "I’ll second the recos for the Canon Powershot line: I bought an A540 (now discontinued) a year ago and love it. Nice interface with my Mac, reasonably intuitive software, and the Basic manual will have you up and shooting within 15 minutes.\n\nThe only negative I can think of off-hand is that it doesn’t take pictures in RAW format, but JPG.\n\n(edit: and one of the reasons I bought it was because it does have a real viewfinder. I think only Canon still has them for point-and-shoots, but not on the ELPHs)\n\n"
    },
    {
      "time": " 4.Jun.2007 8.12am",
      "content": "The new Nikon coolpix have image stabilization. I haven’t seen them but the earlier coolpix were awesome. The dp review advice was good.\n\nPS..I very badly want a Canon 5d.\n\nSharon\n\n"
    },
    {
      "time": " 4.Jun.2007 8.15am",
      "content": "The 10X is good. The anti-shake is good. Reading the customer reviews indicates most people are pleased with the purchase. I would like a see-through lens for framing the shot in bright light. But the size certainly is nice.\n\nA small camera you will tend to throw in a pocket, or keep on your belt, thus having a camera when you need it. I had to buy one just for that, since I had a big SLR that I was always leaving behind because it was too bulky. I call my little one  \nthe “I wish I had my camera” camera.\n\n"
    },
    {
      "time": " 4.Jun.2007 8.18am",
      "content": "You really don’t need a Mac interface or the software if you buy a card reader.\n\nAnd Linda - some of the Elphs now seem to have a viewfinder. It’s rare to find a camera with a 3” screen and a viewfinder tho.\n\n"
    },
    {
      "time": " 4.Jun.2007 8.24am",
      "content": "or have a compatible printer. I can plug my memory card straight into my Epson printer and crank out prints PDQ if I don’t mind not being able to play around with them....\n\n"
    },
    {
      "time": " 4.Jun.2007 8.25am",
      "content": "Another nice thing about the small camera is that you can usually get a photo where security will stop someone with a big SLR. If you look like a tourist you will get a lot more slack.\n\n"
    },
    {
      "time": " 4.Jun.2007 8.42am",
      "content": "\\>Another nice thing about the small camera is that you can usually get a photo where security will stop someone with a big SLR.\n\nThe Canon Elph, a terrorists best friend? Don’t tell Cheney, he’ll have them banned.\n\n"
    },
    {
      "time": " 4.Jun.2007 9.18am",
      "content": "\\> The Canon Elph, a terrorists best friend? Don’t tell Cheney, he’ll have them banned.\n\nThat dike has too many holes already. Add in the cellphone cameras and it is pretty much a free-flowing river. I went to a concert Sat. (Reventón Super Estrella) and it seemed like every seat in front of me had their cellphone screen visible as they pointed to the stage.\n\nAs an aside, they say “If the music’s too loud, you’re too old.” and I got that confirmation Sat. Even with earplugs, it was deafening. I could feel my clothes rattling on my body as I got a full body massage by the bass and drums.\n\nBtw, another nice thing about that Lumix is the 28-280 equivelant.\n\nCanon’s Powershot S3 IS has a 12X zoom but it starts at 35. To make up for this you can use their pictbridge software and combine a number of aligned photos. The camera helps you align them when using that mode. (This camera is big enough that you can’t stick it in a pocket)\n\n"
    },
    {
      "time": " 4.Jun.2007 10.24am",
      "content": "Another good site for reviews and actual pictures taken with any camera is\n\n[http://www.steves-digicams.com/hardware\\_reviews.html](http://web.archive.org/web/20080704154316/http:/www.steves-digicams.com/hardware_reviews.html \"http://www.steves-digicams.com/hardware\\_reviews.html\")\n\ngln\n\n"
    },
    {
      "time": " 4.Jun.2007 10.32am",
      "content": "I’m very happy with my Canon SD-630. I don’t need (or even like) a viewfinder — what sets the SD-630 apart is its huge screen, which makes it easy to frame the shot and more fun to pass around as a viewing device after you’ve taken a photo.\n\n[http://www.usa.canon.com/consumer/controller?act=ModelInfoAct&fcategoryi...](http://web.archive.org/web/20080704154316/http:/www.usa.canon.com/consumer/controller?act=ModelInfoAct&fcategoryid=145&modelid=12956 \"http://www.usa.canon.com/consumer/controller?act=ModelInfoAct&fcategoryid=145&modelid=12956\")\n\n"
    },
    {
      "time": " 4.Jun.2007 11.51am",
      "content": "i’m pretty set on the Canon Powershot G7 now ...seems like the closest thing to an slr - with the ability to manually adjust everthing, while still remaining compact, and robust (although a little bulky), and it can be used a as a mindless point & shoot too. does anyone own one/have experience of using one? thanks\n\n ![](http://web.archive.org/web/20080704154316im_/http:/www.typophile.com/files/g7_5915.jpg)\n\n"
    },
    {
      "time": " 4.Jun.2007 12.51pm",
      "content": "I have a Fuji FinePix s7000, and I really like it. Viewfinder (which I enjoy) and screen, 7.2 mp with interpolation (they say) up to 12.\n\n ![](http://web.archive.org/web/20080704154316im_/http:/www.typophile.com/files/fuji_finepixs7000_4025.gif)\n\n"
    },
    {
      "time": " 4.Jun.2007 12.52pm",
      "content": "Before you decide, take a look at this. The swivel screen is a lot more handy than you might suspect. Shooting over a crowd, framing a macro shot on the ground when you have bad knees, candid people shots so they don’t know you are taking a photo of them etc. (scroll all the way down on the page below) available 7/15\n\n[http://www.dpreview.com/news/0705/07050703canons5is.asp](http://web.archive.org/web/20080704154316/http:/www.dpreview.com/news/0705/07050703canons5is.asp \"http://www.dpreview.com/news/0705/07050703canons5is.asp\")\n\nIt isn’t much bigger than the G7\n\n"
    },
    {
      "time": " 4.Jun.2007 1.09pm",
      "content": "I have a friend who’s thrilled with the Canon G7. It is a little bulky.\n\nThe Panasonic 10 MP Lumix is also supposed to be great.\n\n"
    },
    {
      "time": " 4.Jun.2007 1.15pm",
      "content": "I think one very important consideration is what kind of battery it uses.\n\n"
    },
    {
      "time": " 4.Jun.2007 1.21pm",
      "content": "The Panasonic DMC-LX2 is the bomb. It’s compact enough to carry everywhere, all the time. It shoots in RAW format at 10 megapixels. The CCD is also 16:9 so it takes stunning landscape/architecture shots.\n\nFlickr LX2 Group/pool: [http://www.flickr.com/groups/lx2/](http://web.archive.org/web/20080704154316/http:/www.flickr.com/groups/lx2/ \"http://www.flickr.com/groups/lx2/\")\n\n"
    },
    {
      "time": " 5.Jun.2007 2.01am",
      "content": "I use a Casio Exilim EX-z750. It’s small, very fast and gets ridiculous battery life.\n\n[http://www.flickr.com/cameras/casio/ex-z750/](http://web.archive.org/web/20080704154316/http:/www.flickr.com/cameras/casio/ex-z750/ \"http://www.flickr.com/cameras/casio/ex-z750/\")  \n [http://www.flickr.com/photos/krautwald/tags/exz750/](http://web.archive.org/web/20080704154316/http:/www.flickr.com/photos/krautwald/tags/exz750/ \"http://www.flickr.com/photos/krautwald/tags/exz750/\")\n\n"
    },
    {
      "time": " 6.Jun.2007 7.14am",
      "content": "Basically accept that whichever camera you settle on, there will be something about it that annoys you to no end.\n\n"
    },
    {
      "time": " 6.Jun.2007 3.25pm",
      "content": "EOS 20D. . . standard issue. . . lenses are where it really counts these days.\n\n"
    },
    {
      "time": " 6.Jun.2007 3.48pm",
      "content": "I’m using an Olympus 410D and even though it’s just a point and shoot, it does a fine job. If I had the extra moolah, I’d probably get either a Nikon D50 or a Canon Elan series, because I really miss shooting SLR.\n\nMy Photo Gallery:  \n [http://sterlingstudiosinc.com/Gallery/v/GavinAnderson/](http://web.archive.org/web/20080704154316/http:/sterlingstudiosinc.com/Gallery/v/GavinAnderson/ \"http://sterlingstudiosinc.com/Gallery/v/GavinAnderson/\")\n\nClaidheamdanns  \n [http://sterlingstudiosinc.com](http://web.archive.org/web/20080704154316/http:/sterlingstudiosinc.com/ \"http://sterlingstudiosinc.com\")\n\n"
    },
    {
      "time": " 6.Jun.2007 5.44pm",
      "content": "\\> lenses are where it really counts these days.\n\nThe faster, the better! I hope to add a 50mm 1.4 by Christmas so I can try the boat parade again. I didn’t realize shooting at 4-5.6 would give me nothing but blurry photos from a tripod because of the 5 mph of the boats.\n\n"
    },
    {
      "time": " 7.Jun.2007 1.04am",
      "content": "I hope I am not too late to offer advice but I am a photographer and I manage a camera shop. So look into two cameras that sell really good for my shop: the Canon G7 and the Leica D-Lux 3. People need to be reminded that the glass is a major factor in purchasing a camera. You can get a big megapixel camera for pretty cheap but if the glass isn’t good why bother. If you want something affordable try the Sony’s which carry Zeiss optics or once again any of the low end Canons. And last but not least be careful when you order on the internet. You may save a bundle but will the store honor your camera when it’s on the brinks or when you need advice? Don’t you think a client will want to return to you after you spent honest time on their new logo or font? Go to TYPECON folks!\n\n"
    },
    {
      "time": " 7.Jun.2007 1.30am",
      "content": "I always check [http://www.resellerratings.com/](http://web.archive.org/web/20080704154316/http:/www.resellerratings.com/ \"http://www.resellerratings.com/\") . Great way to find out if a vendor is legit.\n\nSharon\n\n"
    },
    {
      "time": " 7.Jun.2007 6.14pm",
      "content": "I was super-surprised at the Lumix viewfinder. It is huge and bright, it almost sold me right there. I have worked with Canon & Nikon SLRs and the Lumix provided a BETTER view. I was shocked. Not the best reason to buy a camera, just an observation. I incedentally purchased the Sony Alpha recently, and I like it... much better than the smaller cameras for sure.\n\n"
    },
    {
      "time": " 7.Jun.2007 9.38pm",
      "content": "Canon 30D\n\npbc\n\n"
    },
    {
      "time": " 10.Jun.2007 7.45am",
      "content": "Yesterday at Costco I saw the Lumix TZ-3 you first mentioned, and for $319 it looks pretty good. I’d go as far as saying that for the features that appeal to me it is about as good as anything at the price. For a camera that will fit in a pocket, it rocks.\n\nAt maximum telephoto I took a clear photo of some text on a box a few aisles away (no flash). It was easy to use and the screen was very bright. 10X starting at 28 is a great feature for so small a camera.  \nIf I can find someone to take my A710 IS off my hands for a halfway decent price, I will replace my “I wish I had my camera” camera with that one.\n\n"
    },
    {
      "time": " 10.Jun.2007 11.08am",
      "content": "I just got a Rebel XTi 10 MP and it’s amazing. Light, even with the huge zoom lens attached and a joy to use. The quality of the black and white modes with colour filtering for contrast is really great.\n\nI know you said you’re not into SLR but it’s light enough that it isn’t like carrying a mammoth around and I got it for $650 with lens on eBay, refurb with warranty.\n\n[www.3eige.com](http://web.archive.org/web/20080704154316/http:/www.3eige.com/ \"www.3eige.com\") | [www.arstechnica.com](http://web.archive.org/web/20080704154316/http:/www.arstechnica.com/ \"www.arstechnica.com\")\n\n"
    },
    {
      "time": " 11.Jun.2007 1.05pm",
      "content": "After investigating the TZ3, I found another couple nice features: 3 shots per second at full resolution, and exposure bracketing.\n\nAnyway, when I saw this camera at Sam’s for $287 at lunch today, I called a friend, and sold him my A710 IS, and bought this camera. I thank you for bringing it to my attention. After I take some shots, I’ll post a link to some samples.\n\nAll-in-all, I think/hope it is just what I was wanting for my “always with me” camera.\n\n"
    },
    {
      "time": " 27.Jun.2007 1.55pm",
      "content": "Fujifinepix E900\n\n"
    },
    {
      "time": " 27.Jun.2007 5.04pm",
      "content": "And a fine pix that is Weeman\n\ncheers to ya’\n\n"
    },
    {
      "time": " 27.Jun.2007 9.46pm",
      "content": "I have 3 small digital cameras: Nikon Coolpix L4. Canon PowerShotA70 (dead now) and a wonderful FujiF20 that does everything from tabletop shooting to museum shots without a flash for $180. I can’t see lugging around a big SLR when traveling.\n\n"
    },
    {
      "time": " 27.Jun.2007 10.06pm",
      "content": "Here are a few photos taken yesterday, hand-held, no flash, with the Panasonic Lumix TZ3, without reading the manual (auto settings). I will add more to this set in the coming days, although I am trying to make my way through the manual today:\n\n[http://www.flickr.com/search/?w=7888217@N04&q=TZ3&m=tags](http://web.archive.org/web/20080704154316/http:/www.flickr.com/search/?w=7888217@N04&q=TZ3&m=tags \"http://www.flickr.com/search/?w=7888217@N04&q=TZ3&m=tags\")\n\n(last additions 6/27/07)\n\n"
    },
    {
      "time": " 27.Jun.2007 10.33pm",
      "content": "Looked through your flikr photos, Dennis, and was impressed with your work. You really nail your exposures.\n\nSharon\n\n"
    },
    {
      "time": " 28.Jun.2007 6.37am",
      "content": "\\> You really nail your exposures.\n\nPhotoshop deserves a lot of the credit.  \n: )\n\n"
    },
    {
      "time": " 28.Jun.2007 3.46pm",
      "content": "I have to agree with the Canon G7 Powershot. The Powershot series is brilliant and the lenses are the difference. I have also a Powershot G3, this gondola man was shot with a G3 at 4 pixels and I printed it larger than A4 and it’s one of the best shots I’ve done.  \n [http://www.flickr.com/photos/93279914@N00/63589153/in/set-72157594385549...](http://web.archive.org/web/20080704154316/http:/www.flickr.com/photos/93279914@N00/63589153/in/set-72157594385549410/ \"http://www.flickr.com/photos/93279914@N00/63589153/in/set-72157594385549410/\")\n\nThis one below was shot with a Nikon D2X at 12.4 mega pixel and the G3 at 4mpx is still a better shot.  \n [http://www.flickr.com/photos/93279914@N00/302653001/in/set-7215759438554...](http://web.archive.org/web/20080704154316/http:/www.flickr.com/photos/93279914@N00/302653001/in/set-72157594385549410/ \"http://www.flickr.com/photos/93279914@N00/302653001/in/set-72157594385549410/\")\n\nthe G7 has a couple fun things like colour accent [http://www.flickr.com/photos/93279914@N00/sets/72157594512003355/](http://web.archive.org/web/20080704154316/http:/www.flickr.com/photos/93279914@N00/sets/72157594512003355/ \"http://www.flickr.com/photos/93279914@N00/sets/72157594512003355/\")\n\nBut I would avoid the Canon IXUS or similar series of thin small cameras since the lens are bad and I’ve never taken a decent picture with a Canon IXUS 750, everything is either flat or you get camera shake very easily.  \n [http://www.flickr.com/photos/93279914@N00/157843578/in/set-7215759415185...](http://web.archive.org/web/20080704154316/http:/www.flickr.com/photos/93279914@N00/157843578/in/set-72157594151857227/ \"http://www.flickr.com/photos/93279914@N00/157843578/in/set-72157594151857227/\")\n\nonly problems in the G7 are there is no RAW setting any more and the ASA/ISO setting and other dials can easily get moved accidentally. Also 2 gb is the max and the card is an SD (I guess for compactness, but they were saying the G7 is good for Pros as an extra camera, but most high end cameras use a Compact Flash card and not an SD card)\n\n"
    }
  ]
}
