{
  "id": "34229",
  "title": "Font Request: Research Paper",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I won a few hundred in a tombola yesterday and I decided to treat myself to... a couple of typefaces! (pathetic)\n\nI'm a university student and I'm looking for a pair to work well with plain, black-and-white double spaced research papers written in Microsoft Word (I do apologize). I'm searching after:\n\nSans:\n\n- Boldyish face for headings\n- it's italic for book titles\n- possibly it's caps if not expensive\n\nSerif:\n\n- Good text at 12pt double spaced Word\n- it's italic\n- it's caps\n\nI'm looking for something slightly away from the standard Helvitica Bold and Times; something that still would look natural in such a setting, but yet also establish a personal, unique style and make an impression on the graders of the paper. Hopefully I can find this **under a couple hundred** (the more I can get for that amount the better however), but most preferably with typefaces that I could expand with other weights when I strike it rich. Perhaps you could make a few suggestions.\n\nmany thanks\n\nsean\n\n",
  "author": "seanmaverick",
  "time": "4 Jun 2007 — 8:28am",
  "uid": "18961",
  "comments": [
    {
      "time": "4 Jun 2007 — 8:35am",
      "content": "I'd also like old-style figures for numbers on both.\n\nmany thanks\n\nsean\n\n"
    },
    {
      "time": "4 Jun 2007 — 4:29pm",
      "content": "Perhaps [Brown Gothic](http://web.archive.org/web/20131017130735/http:/www.shinntype.com/) for your sans?\n\n"
    },
    {
      "time": "4 Jun 2007 — 5:09pm",
      "content": "When you say research, which fields? Assuming for the moment that the character compliment is of some importance -- one reason Times is prevalent.\n\nParenthetically, I would hope that the teachers would not let the grade be influenced by typeface selection (unless it is somehow relevant).\n\n"
    },
    {
      "time": "4 Jun 2007 — 5:47pm",
      "content": "How about some of the new Microsoft ClearType faces? They're free with some of the Office trials, I think -- I'm liking Constantia with Candara or Calibri myself...\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    }
  ]
}
