{
  "id": "34223",
  "title": "London 2012 Olympic Logo",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I live and work in London as a designer, and am appalled by the just revealed choice of logo design for the 2012 Olympics.\n\nI think it is a massive error of judgement by all concerned. It does not in the least reflect any design values that belong to London, and instead looks like the Olympic organisation is breaking up/smashed\n\nIt goes without saying that this is one of the premier commisions any designer could ever want, and is a travisty to the design talent that exists in the UK (london).\n\nCan anyone be positive about this?\n\n| Attachment | Size |\n| --- | --- |\n| [1542899.jpg](http://web.archive.org/web/20131012061739/http:/typophile.com/files/1542899_0.jpg) | 14.87 KB |\n\n",
  "author": "belleisle",
  "time": "4 Jun 2007 — 4:59am",
  "uid": "17602",
  "comments": [
    {
      "time": "4 Jun 2007 — 5:09am",
      "content": "Hmm, can't say I like it very much.\n\nOn their website the logo is explaned:  \n\"The new Olympic emblem is based on the number 2012 - the year the Games take place and includes the Olympic Rings and the word London.\" – I didn't see the numbers at first!  \nApparently there are four colour versions of the logo, pink, blue, green and orange.\n\nAnd more:  \n\"Launching the brand at the Roundhouse in North London, London 2012 Chair Seb Coe said: \"London 2012 will be 'Everyone's Games', everyone's 2012. This is the vision at the very heart of our brand.\"\n\n[http://main.london2012.com/en/news/archive/2007/June/2007-06-04-12-06.htm](http://web.archive.org/web/20131012061739/http:/main.london2012.com/en/news/archive/2007/June/2007-06-04-12-06.htm \"http://main.london2012.com/en/news/archive/2007/June/2007-06-04-12-06.htm\")\n\n"
    },
    {
      "time": "4 Jun 2007 — 6:01am",
      "content": "Working in the Branding industry I cannot help but feel that this logo is a real let down. Years are spent on the bidding process and pitching phases with regards to just hosting the games.\n\nI remember an article by Bruno Maag in creative review about the importance of the olympics and how it should be treated with more respect. The Olympic games is a worldwide event and is a chance for countries to basically tell the world a little about themselves, their attitudes, their beliefs, their tradition, in an exciting way.\n\nI can understand what the logo is trying to do, trying to appeal to the younger generation by using the graffitti look and the bright colours but further than this it really seems to miss the whole point.\n\nThe logo is just the tip of the ice berg, it is a mark that is used to farmiliarise people with the brand. Below this there is a need for marketing, advertising, print material, films and novelty items such as flags, leaflets etc. If this is the standard that will dictate the design of these elements then I can only hope they take into consideration and try to understand a little of where the rest of the british people are coming from.\n\n"
    },
    {
      "time": "4 Jun 2007 — 6:12am",
      "content": "You can view the film here and some of the people own designs are quite interesting.\n\n[http://www.london2012.com/](http://web.archive.org/web/20131012061739/http:/www.london2012.com/ \"http://www.london2012.com/\")\n\n"
    },
    {
      "time": "4 Jun 2007 — 6:20am",
      "content": "the mark itself is kind of an interesting 'tangram' play on the year, but it's so GENERIC... it seems like they were waiting to see what city would be awarded the games, and they would plug in the name in as non-descipt a manner as possible.\n\noh well. there's always 2016.\n\n"
    },
    {
      "time": "4 Jun 2007 — 6:33am",
      "content": "No the logo has beeen designed in the last year, to replace the bid logo.\n\nIn addition to my earlier rant, I understand the goals of the bid, 'everyones London' everybody getting off their backsides and getting motivated to become active and healthy.\n\nThe brand films are in fact quite good, its just the aesthetic of the logo is very very poor, and for that there is no excuse.\n\nPS. On other websites, people are saying it looks like Lisa Simpson perferming oral sex! - The '0' and second '2'\n\n"
    },
    {
      "time": "4 Jun 2007 — 6:59am",
      "content": "Maybe it's purely coincidental, but I immediately got a brit-punk vibe from it:\n\n[http://www.bside-rock.com/IMG/jpg/London-Calling.jpg](http://web.archive.org/web/20131012061739/http:/www.bside-rock.com/IMG/jpg/London-Calling.jpg \"http://www.bside-rock.com/IMG/jpg/London-Calling.jpg\")\n\nIs it appropriate? I dunno. But different. Sometimes different is good.\n\nEDIT: and now after watching the video, I get a brit-new-wave vibe.\n\nI thought the video was great. I'm liking the logo now. It's definitely different. I think that's a good thing. I think it definitely has a london vibe to it. Slightly retro, but updated.\n\n"
    },
    {
      "time": "4 Jun 2007 — 7:05am",
      "content": "Lisa Simpson? Omg! Well, I didn’t recognize the ciphers either—what I saw was rather some moustached villain in a trenchcoat wth turned-up collars, who sprang from the [Maus comic](http://web.archive.org/web/20131012061739/http:/en.wikipedia.org/wiki/Maus), with London on his mind.\n\n"
    },
    {
      "time": "4 Jun 2007 — 7:07am",
      "content": "@ aluminium: The colors say [Sex Pistols](http://web.archive.org/web/20131012061739/http:/www.abc.net.au/myfavouritealbum/albumart/img/bollocks.jpg), not The Clash. ;)\n\n"
    },
    {
      "time": "4 Jun 2007 — 7:08am",
      "content": "You've got to be kidding. It's amazing how much the logos change from the bid to the actual games logo. Why not keep the same identity?\n\n"
    },
    {
      "time": "4 Jun 2007 — 7:23am",
      "content": "Lot of very unhappy Londoners...\n\n[Online petition - Change The London 2012 Logo](http://web.archive.org/web/20131012061739/http:/www.gopetition.co.uk/petitions/change-the-london-2012-logo.html)\n\n"
    },
    {
      "time": "4 Jun 2007 — 8:06am",
      "content": "I heard the lisa simpson thing also.\n\nIts trying to be New-Rave, so some trendy young hoxtonite has jammed the current musical influences into the design. Don't hate it but doesn't say much about London, England, or the olympics, it just seems stylized towards a current musical scene which is particular to here (london).\n\n"
    },
    {
      "time": "4 Jun 2007 — 8:11am",
      "content": "It's bollocks.\n\n"
    },
    {
      "time": "4 Jun 2007 — 8:49am",
      "content": "Dire.\n\n"
    },
    {
      "time": "4 Jun 2007 — 8:55am",
      "content": "Number five is pretty good: [http://news.bbc.co.uk/2/hi/in\\_pictures/6719747.stm](http://web.archive.org/web/20131012061739/http:/news.bbc.co.uk/2/hi/in_pictures/6719747.stm \"http://news.bbc.co.uk/2/hi/in\\_pictures/6719747.stm\")\n\n"
    },
    {
      "time": "4 Jun 2007 — 9:21am",
      "content": "It's a stinker. It looks, well, 80s-looking; it's just naff. I bet the design brief said 'must look vibrant and appealing'. I have to admit that I thought the Thames 'ribbon' bid logo was as bad as it got. Ouch.\n\nWell, not everything can be a portfolio piece!\n\n"
    },
    {
      "time": "4 Jun 2007 — 10:21am",
      "content": "First thoughts - awful.  \nI kept looking at it and then saw the jagged 2012 numerals. A bit less awful.  \nIt seems to be breaking up. Fragmented, choppy, sharp, what's the point of the offset yellow drop shadow?\n\n"
    },
    {
      "time": "4 Jun 2007 — 10:26am",
      "content": "I loved the Evolution of Man graphic at the bottom of number 5!\n\n"
    },
    {
      "time": "4 Jun 2007 — 10:57am",
      "content": "Please tell me you're kidding ... the number \"five\" I see (pasted below) is positively hideous -- and insanely unusable as a logo.\n\n ![](http://web.archive.org/web/20131012061739im_/http:/typophile.com/files/lon1212_6359.JPG)\n\n"
    },
    {
      "time": "4 Jun 2007 — 11:15am",
      "content": "I think it looks like sh\\*t.. looks like a guy who´s just been shot in the stomach\n\n"
    },
    {
      "time": "4 Jun 2007 — 11:37am",
      "content": "The zero looks like Australia, no?\n\n\\>It’s bollocks.\n\nNevermind...\n\n"
    },
    {
      "time": "4 Jun 2007 — 12:23pm",
      "content": "whilst the logo should reflect contemporary London (which to some extent this does) it shouldn't lose sight of the city's heritage - and there is no trace of this in the logo. It smacks of '2007' NME culture - new rave, the Klaxons, glow sticks etc...\n\nalso has an unccany resemblance to the jagged interlocking shapes of the typeface used for the Arctic Monkeys recent 'Brianstorm' single:\n\n ![](http://web.archive.org/web/20131012061739im_/http:/typophile.com/files/Brianstorm_3447.jpg)\n  \n\n ![](http://web.archive.org/web/20131012061739im_/http:/typophile.com/files/1542899_0_4194.jpg)\n\n"
    },
    {
      "time": "4 Jun 2007 — 12:31pm",
      "content": "of course i was kidding. it's horrible! (and i was joking about the evolution graphic at the bottom, too)\n\n ![](http://web.archive.org/web/20131012061739im_/http:/typophile.com/files/lon1212_6359_5474.jpg)\n  \n\n ![](http://web.archive.org/web/20131012061739im_/http:/typophile.com/files/EvolutionOfMan_5293.jpg)\n\n"
    },
    {
      "time": "4 Jun 2007 — 12:35pm",
      "content": "Number 11 Rules! (Referring to the alternates in the BBC article.)\n\nThe final mark takes a lot of risks, that the otherwise safe (too conservative) execution does not support it or payoff the risks and the result is bad. The \"brand video\" they produced is the most interesting piece, but the logo itself doesn't live up to it. The site design as a component of the whole brand picture is also a let down. The Duplo color palette is carried through, but because of the lack of interesting composition there's no connection to the energy in the video.\n\nThe London Olympics, as established by the logo and the brand site, is now a low budget, kids television program.\n\n"
    },
    {
      "time": "4 Jun 2007 — 4:34pm",
      "content": "The brand video is at least a fine example of truth in advertising: in 2012 every aspect of London life is going to be frenetically invaded by the Olympics, and the logo is a good warning sign not to bother visiting London that year.\n\n"
    },
    {
      "time": "4 Jun 2007 — 4:52pm",
      "content": "Come on people. Same thing every time with a big sports event. I remember the discussion about the 2006 world cup logo (football/soccer) in Germany. OK, it sucked. But. 11 designers stated they could do better. Well, actually most of them couldn’t ImO. Come up with something better!\n\n"
    },
    {
      "time": "4 Jun 2007 — 5:13pm",
      "content": "<cite>Same thing every time with a big sports event.</cite>\n\nSure there are some bad tourney logos out there, but it's the Summer Olympics! Home of amazing posters (Montréal), beautiful ID systems (Los Angeles) and this great little piece of iconography from Moscow. It's in Russian and more readable to me than the London caveman mark.\n\n ![](http://web.archive.org/web/20131012061739im_/http:/typophile.com/files/moscow1980_6123.gif)\n\nHorton  \nFounder, [This Day in Type](http://web.archive.org/web/20131012061739/http:/www.thisdayintype.com/)\n\n"
    },
    {
      "time": "4 Jun 2007 — 5:22pm",
      "content": "Yeah. It looks Stalin OK. And if it hadn’t been the Soviet Union then there would have been the same discussion going on. Posters and ID systems aren’t Logos btw. Design a Logo for the London Olympics and post it!\n\n"
    },
    {
      "time": "4 Jun 2007 — 6:38pm",
      "content": "Role over Wolff Olins.  \nShame on you.\n\n'This is the vision at the very heart of our brand'\n\nPASS ME THE STAKE\n\n(I will not be revoking this comment)\n\n"
    },
    {
      "time": "4 Jun 2007 — 10:22pm",
      "content": "Oi, Jan. I have a solid rebuttal to everything you wrote, but it won't do either of us any good. The only thing I would like to point out for the record is that [ID systems include logos](http://web.archive.org/web/20131012061739/http:/en.wikipedia.org/wiki/Corporate_identity).\n\nHorton  \nFounder, [This Day in Type](http://web.archive.org/web/20131012061739/http:/www.thisdayintype.com/)\n\n"
    },
    {
      "time": "4 Jun 2007 — 10:43pm",
      "content": "From the press release: \"the new emblem is modern and will be dynamic, evolving in the years between now and 2012.\"\n\nThis makes me think there is more to the logo than we've seen. Could be interesting.\n\nI don't think it's too horrible, aside from the fact I originally thought it was the red maple from the Canadian flag. Most of the alternatives on the BBC site were much worse (#1 could be great with a few touch-ups - 11 is fantastic, of course). Probably a product of design by committee. I can see scores of Olympics organizers weighing in with what they think is good design, the designers being pressured to comply, and the end result being an unsatisfying compromise for everyone.\n\n"
    },
    {
      "time": "5 Jun 2007 — 12:03am",
      "content": "What is the purpose of a logo?\n\nTim\n\n"
    },
    {
      "time": "2 Aug 2012 — 1:40pm",
      "content": "[Edit]\n\n"
    },
    {
      "time": "5 Jun 2007 — 12:38am",
      "content": "\\>logo should be a dynamic, forward thinking summing up of London and its hosting of the Olympic games\n\n– is that possible?  \n– is that desirable?\n\nI am still on the fence about the logo, although it does make better sense having seen the motion graphics.\n\nTim\n\nBTW Darrel –&nbsp;you probably already knew this but  \n [http://www.loc.gov/exhibits/british/images/vc265.jpg](http://web.archive.org/web/20131012061739/http:/www.loc.gov/exhibits/british/images/vc265.jpg \"http://www.loc.gov/exhibits/british/images/vc265.jpg\")\n\n"
    },
    {
      "time": "5 Jun 2007 — 1:16am",
      "content": "Update for non-UK readers...\n\nBBC TV news ran a piece hinting that the organisers are looking at a few tweaks.  \nIn other words they are going to try and dig themselves out of a very large hole and change the thing?.\n\nSomeone mentioned Childrens TV. This was a logo for 'TISWAS' a Saturday morning kids TV show in the 70's.\n\n[http://news.bbc.co.uk/1/hi/magazine/6719805.stm](http://web.archive.org/web/20131012061739/http:/news.bbc.co.uk/1/hi/magazine/6719805.stm \"http://news.bbc.co.uk/1/hi/magazine/6719805.stm\")\n\n"
    },
    {
      "time": "5 Jun 2007 — 1:55am",
      "content": "gah! i say..who on earth designed it? and how in the name of heaven did they pass it off as a logo for the olympic games??!  \nThings like this cause a lot of disillusion in me.\n\n:(  \nshreyas\n\n"
    },
    {
      "time": "5 Jun 2007 — 2:27am",
      "content": "Wolff Olins produced the logo/brand.\n\n[http://www.wolff-olins.com/](http://web.archive.org/web/20131012061739/http:/www.wolff-olins.com/ \"http://www.wolff-olins.com/\")\n\n"
    },
    {
      "time": "5 Jun 2007 — 3:25am",
      "content": "So, what typeface is being used and what do we all know about it?\n\n"
    },
    {
      "time": "5 Jun 2007 — 5:29am",
      "content": "Well, I posted a comment that was pretty damning of the London 2012 logo - and, although I could edit it, I'm going to let it stand even though I think I've made a mistake. Having lastnight seen how it conveys a sense of energy, I'm growing to like it! My gut feelings (see post above) were negative, but I really don't think companies such as Wolff Ollins get it wrong. I'm still really unsure of the supporting elements (the animated visual style is very 80s dance graphics), but I think the logo is already doing its job. I think the organisers will be pleased about the press and news prominience this has got - which I don't think would happen with a 'safe' logo which would likely go unnoticed. It's really going to start mattering in a few years time so to judge it now is really premature. The one thing that this logo is, is different - and that's pretty important.\n\n"
    },
    {
      "time": "5 Jun 2007 — 6:40am",
      "content": "I'm surprised at the almost unanimous hatred towards this mark.\n\nAdmittedely, from a typography standpoint, it's lacking, but as an overal logo and part of the larger ID system (including the motion graphics) I can't really argue against it. It seems to work.\n\nThere are bad logos, and then there are controversial logos. I think this is the latter. Not necessarily bad, but those that find it bad, REALLY find it bad and are quite loud about it.\n\nA bland logo would have likely been a poorer solution, but ultimately would probably not have provoked that many folks to care as much about it.\n\n\"The one thing that this logo is, is different - and that’s pretty important.\"\n\nWell said.\n\n"
    },
    {
      "time": "5 Jun 2007 — 6:45am",
      "content": "This interesting [Washington Post article on the logo](http://web.archive.org/web/20131012061739/http:/www.washingtonpost.com/wp-dyn/content/article/2007/06/04/AR2007060401875.html) reports a huge negative reaction in Britain to the logo.\n\nDoes being polarizing help in some way? I don't really know. I just can't imagine that having a majority of people instantly hate it was a goal. In that respect, at least, it has fallen short.\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:00am",
      "content": "I actually really like the logo. It has an interesting energy. And I'm so glad it stayed away from cliché iconography like the Tube, Big Ben and the London Eye.\n\nI'm sceptical about all this logo-hating. I believe we have a case of group-think happening. It's popular to dislike the logo and nobody wants to be unpopular.\n\nAre there any blogs defending the logo?\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:03am",
      "content": "[Found one.](http://web.archive.org/web/20131012061739/http:/www.bbc.co.uk/blogs/sporteditors/2007/06/why_we_should_give_london_2012.html)\n\nBut the author admittedly doesn't like the logo.\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:12am",
      "content": "A local public access kids' show produced in Boston:\n\n ![](http://web.archive.org/web/20131012061739im_/http:/typophile.com/files/zoom_picture_3724.jpg)\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:21am",
      "content": "Good things about the logo:\n\nDynamic, energetic, upbeat, good balance--artistically very well executed.\n\nHarmonizes with appealing and successful motion graphics. (It works as part of these better than on its own.)\n\nBad things:\n\nSecond 2 illegible. Serious problem.\n\nToo self-conscious--draws attention to itself rather than the Olympic games.\n\nCut out + candy colors gives too child-like message for Olympic games (see Scott's post).\n\nTrying too hard to be 'trendy' and just missing.\n\n[edit:] In sum, for the purpose of promoting the Olympic Games, disconcertingly inappropriate, off-key, a sour note. Hence the reaction.\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:26am",
      "content": "Again, in the cold light of day I still find it utterly objectionable.\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:30am",
      "content": "I think it's hideous - I didn't read the 2012 at all. It looks like a sad older woman who's trying way too hard to look like she's still one of the kids.\n\nBut I don't think this is a case of logo-bashing. It's rare for these design-by-committee processes to actually yield anything with a lot of design integrity. There have been threads in praise of logos on this forum plenty of times, or threads where the opinion is more balanced.\n\nI can't get the Lisa Simpson visual out of my mind... ouch.\n\nIs the Moscow logo trying to imply that Muscovites have 5 testicles instead of the customary 2?\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:36am",
      "content": "Besides, you really can't top this for SUPERCOOL Olympic graphics\n\n[http://www.okscg.org.yu/i119e.htm](http://web.archive.org/web/20131012061739/http:/www.okscg.org.yu/i119e.htm \"http://www.okscg.org.yu/i119e.htm\")\n\nMy parents have an ashtray from that Olympics, and if they ever throw it away I will be forced to kill them.\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:37am",
      "content": "We've just released our opinion on our website, plus our visual take on it: [http://www.daltonmaag.com/news/61.html](http://web.archive.org/web/20131012061739/http:/www.daltonmaag.com/news/61.html \"http://www.daltonmaag.com/news/61.html\")\n\nBruno Maag\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:50am",
      "content": "Patty:  \nI am mostly referring to the masses. I'm not surprised to see typographers and graphic designers spouting harsh critiques. We're an opinionated bunch and the logo is at first jarring. I agree completely with your design-by-committee comment. Very true.\n\nI just believe there's an inherent danger in \"unveiling\" a new design. In doing so the logo is put on display, almost requesting a reaction. With this design being so unexpected, people will stick to their first impressions. I think that unveling the logo without the support of context and additional branding elements (motion graphics, systems, photogrpahy) makes it bound to not quite connect with people.\n\nAnd then there's the culture issue. Londoners are certianly arguing over what cultural element is missing from the logo. This is why committees often ruin the design process. \"We can't agree, so let's just use little abstract woodcut-style people holding hands in a circle.\"\n\n"
    },
    {
      "time": "5 Jun 2007 — 8:01am",
      "content": "Dalton Maag makes some very good points, and some very over the top ones.\n\nIn my opinion, the logo falls short because it doesn't communicate WELL, and it's unfortunate only because of the missed opportunity.\n\nD-M hit it when they said that by trying to be trendy, Wolff Ollins (and the committee) trapped themselves into being dated. And by 2012, well, I imagine the designers will be thinking, \"it SEEMED like a good idea...\"\n\nGoofy type treatments can be effective (Taco Bell got away with using Fajita for years), but they should be communicative.\n\nBut D-M's assertion that the Olympic logo will destroy British design credibility throughout the visually-literate world is a silly overstatement. And in the end, I think the public is going to worry a lot more about the 50-m sprint time than they will about four tangram shapes and some weak typography.\n\n"
    }
  ]
}
