{
  "id": "34233",
  "title": "Printing out type samples",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone,  \nI'm a graphic designer living in France, have been following the forum for a while and am finally making my first post!\n\nI need to put together a typeface catalogue for the agency I work for, and I'm wondering what type management software would be the best for this. I would like to print the font name, an alphabet in uppercase and lowercase, and a sample sentence for each font we have (keeping the different weights together, not on separate pages if possible).\n\nI have fontbook, Font Explorer and Suitcase available, and no budget to buy new software. What could you all suggest to make this task as easy as possible? I was thinking of creating PDFs with font explorer and printing them; but the problem is that only the sample sentence or alphabet is in these PDFs...\n\nThanks for your suggestions! :)\n\n",
  "author": "rpaulovich",
  "time": "4 Jun 2007 — 9:09am",
  "uid": "18941",
  "comments": [
    {
      "time": "4 Jun 2007 — 12:11pm",
      "content": "Bump, I’d like a suggestion for this too, I used to use Font Gander in OS9 (aah things were better in the old days).\n\nTim\n\n"
    },
    {
      "time": "4 Jun 2007 — 12:22pm",
      "content": "You could use a Word macro to produce these in the exact format you need, and then export to PDF. Do a Web search for Word font list macro to get a few samples.\n\n"
    },
    {
      "time": "4 Jun 2007 — 4:06pm",
      "content": "\\> _I need to put together a typeface catalogue for the agency I work for [...] I would like to print the font name, an alphabet in uppercase and lowercase, and a sample sentence for each font we have [...] I was thinking of creating PDFs_\n\nIf you have InDesign and know how to script it, this will be fairly easy to do.  \nOr you can try someone else's scripts:  \n-- [Font book, VCS](http://web.archive.org/web/20131020042251/http:/www.adobe.com/cfusion/exchange/index.cfm?event=extensionDetail&extid=1046520)  \n-- [ID Font Catalog, VCS](http://web.archive.org/web/20131020042251/http:/www.adobe.com/cfusion/exchange/index.cfm?event=extensionDetail&extid=1046567)  \n-- [Font View/Tester, V2.0](http://web.archive.org/web/20131020042251/http:/www.adobe.com/cfusion/exchange/index.cfm?event=extensionDetail&extid=1046401)\n\n"
    },
    {
      "time": "5 Jun 2007 — 7:38am",
      "content": "Thanks for your suggestions - I'm going to try the Fontbook Indesign script.\n\n"
    }
  ]
}
