{
  "id": "34263",
  "title": "Please Critique my font",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Hello Everyone,\n\nI have recently created a font for my typography class. This is the first attempt to design a font. Your feedback and critique will be mostly appreciated.\n\nAbout the font:\n\nI named it Reemenesque, which is a hybrid of my name and the word “Arabesque”, an intricate design style that incorporates geometrical, flowery patterns.\n\nThe font is actually a hybrid of the Arabic alphabet and the English alphabet. Which has a very calligraphic style to it. The weight of the strokes are varied and there are two types of serif-like elements (inspired from Arabic font serifs) which decorate the font. One which is sharp and pointy, usually used on straight stokes. The other is a more decorative which is usually applied to the more curved areas of the font.\n\n| Attachment | Size |\n| --- | --- |\n| [reemensque\\_font.pdf](http://web.archive.org/web/20070714142853/http:/typophile.com/files/reemensque_font.pdf) | 68.47 KB |\n\n [‹ Tschichold's Penguin Compostion Rules](http://web.archive.org/web/20070714142853/http:/typophile.com/node/34529 \"Go to previous forum topic\") [Handwritten font ›](http://web.archive.org/web/20070714142853/http:/typophile.com/node/34472 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070714142853/http://typophile.com/user/18767\" title=\"View user profile.\">Reem Seddiqi</a>",
  "time": "<br>",
  "uid": "18767",
  "comments": [
    {
      "time": " 5.Jun.2007 11.22pm",
      "content": "It’s a lovely idea - but I am not loving this execution. I don’t think it does justice to either that latin alphabet or the arabic. I am sorry if this sounds harsh. I don’t mean it to be. My suggestion is to look at the two traditions for longer and try again when you see them both more deeply.\n\n"
    },
    {
      "time": " 6.Jun.2007 12.09am",
      "content": "Some of the terminals are really great. They draw from arabic forms without looking like a fake arabic font. There could be more coherence or system in the stroke widths. Right now they feel random, but not on purpose. The other option would be to embrace the randomness and create two or three different designs for each character.\n\n"
    },
    {
      "time": " 6.Jun.2007 12.32am",
      "content": "I agree with Christian.\n\nThe font looks very “custom”. You should make more design variants of the same letters. You can see the problem already in the word “REEMENSQUE” put together with these letters. the first two “E”s are definitely problematic. Because they don’t add variety. They look made up and unserious.\n\n"
    },
    {
      "time": " 6.Jun.2007 4.21am",
      "content": "Look at the thickness of some of your letters - the E form is too thick, as is the B and Q. The flow of the letters should not be stopped by heavy or different forms.\n\n"
    },
    {
      "time": " 6.Jun.2007 6.19am",
      "content": "Congrats + Flowers!  \nCombination of Thorny Flowers and Flowery Thorns?!\n\n"
    },
    {
      "time": " 6.Jun.2007 6.28am",
      "content": "The idea is great, and some of the features are very promising, but yes this will need a great deal of change to end up “good”, especially if your intent is producing a polished headline font, as opposed to an artsy “grunge” font.\n\nThe “X” and the “R” seems like the two glyphs of yours that are most worth looking at for guidance/evolution: the former because it’s very close to a workable end-result; the latter because it contains (as it generally does actually) a large number of components that can be used in the font as a whole.\n\nIt seems like you’re basing this on the Kufi style - which is a great idea. In that light, the main thing I would recommend is making the whole design much more rigid, much more horizontal. In that way, I can visualize this becoming a quite valuable contribution to type.\n\nGood luck, and please show us your progress!\n\nhhp\n\n"
    },
    {
      "time": " 14.Jun.2007 9.00pm",
      "content": "I feel like the D is out of place. It just doesn’t quite read as a D or mesh with the rest of the letters. Nice start though!\n\n"
    },
    {
      "time": " 14.Jun.2007 9.00pm",
      "content": "I feel like the D is out of place. It just doesn’t quite read as a D or mesh with the rest of the letters. Nice start though!\n\n"
    }
  ]
}
