{
  "id": "34271",
  "title": "Photographing Work",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "im struggling to photograph our graphic work for our website, i have no access to a studio or lighting so have been relying on natural light and a Nikon D50 and its just not looking very good. Anybody got any tips on pulling off a professional job with limited equipment, im prepared to invest in a couple of photographic lights if really necessary, but would interested in any cheap alternatives.\n\nMany thanks\n\nEd\n\n [‹ Surreal in Chicago](http://web.archive.org/web/20081011053840/http:/www.typophile.com/node/34289 \"Go to previous forum topic\") [MT Grot - rounded ? ›](http://web.archive.org/web/20081011053840/http:/www.typophile.com/node/34281 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011053840/http://www.typophile.com/user/13432\" title=\"View user profile.\">edward maddison</a>",
  "time": "<br>",
  "uid": "13432",
  "comments": [
    {
      "time": " 6.Jun.2007 6.57am",
      "content": "A little more information would be helpful.  \nWhat size would your graphic work be?  \nIs this graphic work prior to digital artwork?\n\ngln\n\n"
    },
    {
      "time": " 6.Jun.2007 7.01am",
      "content": "apologies this is printed work ranging from posters to leaflets, stationary and books, so both large and small\n\n"
    },
    {
      "time": " 6.Jun.2007 7.03am",
      "content": "I bought a few lights, shot on white formica, and had pretty good results. You can also use white posterboard or foamboard to use as reflectors. You may be able to get away with reflectors if there’s enough natural light, but a few lights will make a big difference. Example below.\n\n ![](http://web.archive.org/web/20081011053840im_/http:/www.typophile.com/files/sample_4559.jpg)\n\n"
    },
    {
      "time": " 6.Jun.2007 7.08am",
      "content": "On the cheap lighting solutions are much more available now that CFLs are becoming common. Look for Daylight rated bulbs like the [GE Energy Smart CFL](http://web.archive.org/web/20081011053840/http:/genet.gelighting.com/LightProducts/images/t03/0000003/r03080v29.jpg) bulbs.\n\nYou can get a few of these, and some (2-3)utility spot lights (clamp style).\n\nIf you have a tripod, set up a blank location on a wall in a darkened room with a piece of Black or White mat board. Attach your work to the mat board and then set up your tripod about 3-6 feet away. using 2-3 spotlights with your daylight CFLs, aim them so that they’re roughly 30-60 degrees to the artwork and on each side (this will eliminate any glare or shine).\n\nDo a search on Google for Copy Photography. I’m sure there’s other useful tips, like manual settings.\n\nIf you live near a college/university, especially a liberal arts college, there’s always slide photographers available, you might even be able to talk your way into the lab to use the copy stand.\n\nGood Luck.\n\n"
    },
    {
      "time": " 6.Jun.2007 7.08am",
      "content": "Thanks for the tips Chris, looks good, can you let me know what kind of lights were used?\n\n"
    },
    {
      "time": " 6.Jun.2007 7.09am",
      "content": "You want to work outside on a bright overcast day, and with your flash turned off, for best results. Position yourself so that you are on the opposite side of the table (where the art is) from the sun (i.e. north in northern hemisphere, south in southern). I’ve been told you can also get OK shots if you are in full shade, but I’ve not had much luck.\n\nIf you are photographing small 3D things (boxes, etc.) you can build yourself a background out of a cardboard box (with two sides cut away, and line it with a dense white, non-reflective cloth or paper (I’ve got a little one made with Hammermill Color Cover stock).\n\nMy friend [Crys Harse](http://web.archive.org/web/20081011053840/http:/www.albertacraft.ab.ca/pages/exhibits/ab_washington/popwins/harse_01.htm) built herself a 3-foot cube of PVC pipe, some masonite, and white cloth, installed two good lights, and takes all of her pictures in that (including the one on the site). It’s a pretty reasonable solution pricewise, if you have a lot to do.\n\n"
    },
    {
      "time": " 6.Jun.2007 7.10am",
      "content": "Thank you Andrew thats great advice\n\n"
    },
    {
      "time": " 6.Jun.2007 7.32am",
      "content": "Thanks Linda that sounds very promising, im off to play in the garden\n\n"
    },
    {
      "time": " 6.Jun.2007 7.41am",
      "content": "One helpful trick is to set up a board on an easel, tape the work to the board, and photograph it. Then, take the work down, replace it with white paper or fabric, and photograph that. In photoshop invert (cmd-i) the colors in the white paper image, and then place it over the image of the work and set its blending mode to lighten. This will remove the highlights from the uneven lighting and you can then use adjustment layers for further tweaks.\n\n"
    },
    {
      "time": " 6.Jun.2007 7.52am",
      "content": "That’s a great tip, James, and one I’m going to file away for future use.\n\nThere are times, however, that touching-up isn’t allowed — I’ve had to take pix of some of my work for competitions where they will only accept original RAW files (or unaltered JPG or TIFFs) for jurying and will DQ anything else. Being able to get a good shot in those instances is invaluable.\n\n"
    },
    {
      "time": " 6.Jun.2007 8.44am",
      "content": "If you can, you might invest in an inexpensive prime lens like the Nikon 50mm f/1.8. They run around a hundred dollars, will give you some interesting depth of field and will help with low-light.\n\n"
    },
    {
      "time": " 6.Jun.2007 8.49am",
      "content": "I should add, I don’t know if this lens is compatible with your camera. I have used it on a D1x and a D70.\n\n"
    },
    {
      "time": " 6.Jun.2007 9.04am",
      "content": "Edward, I’m not sure what kind of lights they are (not even sure where they are at the moment), but they were a cheap set. Cost maybe $150 for 2 lights with stands and reflector/diffusor umbrellas. I’m a total noob at lights, and prefer natural light myself. They weren’t strobes, so they were on all the time (which got hot). They did make a big difference though.\n\n"
    },
    {
      "time": " 6.Jun.2007 9.13am",
      "content": "Chris, are you talking about the [Table Top Studio Lights](http://web.archive.org/web/20081011053840/http:/store.tabletopstudio-store.com/lightsets.html)?\n\n"
    },
    {
      "time": " 6.Jun.2007 9.13am",
      "content": "I shoot with a D50 also, and I own the f/1.8 50mm prime. It’s slightly longer than what people consider a “normal” lens, so it’s great for portrait photography. Not really applicable here... but it’s my favorite lens.\n\nCopy-stand work becomes more complex if you’re photographing three dimensional objects of design work that has texture. For example, a painting can look very different depending on the angle and quality of light applied to it, which is why good copy-stand work is it’s own peculiar specialty.\n\nI would take some of the previous advice and focus on applying diffused, even light. If you want everything in focus, secure the camera and shoot around f/8 or f/11. Most lenses are their sharpest in that range.\n\n"
    },
    {
      "time": " 6.Jun.2007 9.24am",
      "content": "I’ve used the 50mm in a pinch for product work. It does work, but probably not for the poster sizes.\n\n"
    },
    {
      "time": " 6.Jun.2007 10.02am",
      "content": "The set I bought is very similar to those. Probably not good for anything but the most basic lighting, but it worked for what I needed.\n\n"
    },
    {
      "time": " 6.Jun.2007 11.02am",
      "content": "“Anybody got any tips on pulling off a professional job with limited equipment”\n\nGo casual. Do the ’hold up Annual report with your hands while standing in front of your desk and take a snap shot’ look. Perhaps a bit trendy, but seems to work for a lot of folks.\n\n"
    },
    {
      "time": " 6.Jun.2007 11.16am",
      "content": "you can also make very simple vertical or seamless backdrops for photographing 3-d work out of white, black, or colored paper:\n\n ![](http://web.archive.org/web/20081011053840im_/http:/www.typophile.com/files/08-12_5175.JPG)\n\n"
    },
    {
      "time": " 6.Jun.2007 5.51pm",
      "content": "Another option that’s worked out for me is an off-camera flash with big reflectors. It’s cheaper than studio lights, and it’s nice to have a decent flash anyway. In my case I use a Nikon SB-600.\n\n"
    },
    {
      "time": " 7.Jun.2007 3.45am",
      "content": "Thanks for all the help, my pictures are already looking a lot better\n\n"
    },
    {
      "time": " 7.Jun.2007 5.35am",
      "content": "Also I recommend not setting the white balance to auto. If you’re outside set it to cloudy rather than sun for a slightly warmer tone.\n\n"
    }
  ]
}
