{
  "id": "34277",
  "title": "Design Advice on spot varnish/silver ink/quadtone, etc.",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m designing an 20’s style art deco-ish cd and I’m thinking about using either silver ink or spot varnishing, but I’ve never really done something like this so I come to you guys for advice.\n\nThe cd for a musical based on the life of Peter Lorre. The cover art concept I was given is a play on an old grayscale poster of one of his movies with a dash of red thrown in. Since this was all we had at the beginning, I’ve been thinking about printing it in Black, PMS135 & Silver ink and have done my design so far in a way that could be converted to that. I posted [a sample spread](http://web.archive.org/web/20080414165326/http:/farm2.static.flickr.com/1357/533386131_54a522a53a_o.png) (in progress! don’t critique too much!)\n\nI was inspired by the [The Spider & the Fly](http://web.archive.org/web/20080414165326/http:/www.amazon.com/Spider-Fly-Mary-Howitt/dp/0689852894/ref=pd_bbs_2/102-0806386-0929754?ie=UTF8&s=books&qid=1181143938&sr=8-2)) children’s book which states it was printed in a black & silver duotone, but I’m not sure quite what I’d want to do with it.\n\nWhen I went back to look at this book again, the effect wasn’t as impressive as I thought. This got me thinking about spot varnishes. The look we’re going for in the booklet is very rich black, lots of gradients multiplied over gradients, angular, art deco.\n\nSo it’s kind of just me doing this, at least on the art direction side and since I’ve never done “special inks” I’d like to get other ideas or experiences. If we go with silver, would it be worth it? How noticeable would it be? If I do spot varnishes, where would I do them? The song titles? The black boxes? In different boxes to add another layer of fun confusion? What sort of spot varnish treatments have you loved? I really want this to look great and not just like some black ink on paper and I’m really flying solo in all these ideas because none of the other people I’m talking to/working with can envision it...so thank you all in advance for at least letting me bounce ideas off of you.\n\n [‹ Edwardian Page Layout](http://web.archive.org/web/20080414165326/http:/www.typophile.com/node/34328 \"Go to previous forum topic\") [S&P/TSX spacing ›](http://web.archive.org/web/20080414165326/http:/www.typophile.com/node/34279 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080414165326/http://www.typophile.com/user/18038\" title=\"View user profile.\">Brian Carter</a>",
  "time": "<br>",
  "uid": "18038",
  "comments": [
    {
      "time": " 6.Jun.2007 10.51am",
      "content": "“Both” might be an option. I haven’t talked to the printing plant yet, I’m waiting on a contact info.\n\nI guess what’s really worrying me is the lack of a working preview. I want to play it safe, but also do something good.\n\n"
    },
    {
      "time": " 6.Jun.2007 12.39pm",
      "content": "Metallic inks don’t gradate well and, in the case of silver can appear grey without much persuasion. It might be worth looking at printing on a metallic stock with a spot UV on top of that, talking to the printer will save you headaches though.\n\nTim\n\n"
    },
    {
      "time": " 6.Jun.2007 2.30pm",
      "content": "timd, good idea. That’s what struck me when I went back to look at that spider book, it kind of just looked grey.\n\n"
    },
    {
      "time": " 6.Jun.2007 2.34pm",
      "content": "There was a discussion about using spot varnishes awhile ago that I was trying to find, but couldn’t, even going through Google. hrumph.\n\nI like using spot varnishes (semi-gloss, on matte paper) over B/W photos to give that almost-sepia look: it’s very effective when done properly (i.e., the varnish exactly matches the edges of the photo) and reasonably priced.\n\n"
    },
    {
      "time": " 6.Jun.2007 2.35pm",
      "content": "Silver will be quite silver if printed on glossy paper, something like chromalux. When printed on matte paper, it looks kind off dull. I don’t know if varnishing it helps. I guess if you want matte parts on glossy paper, you can print it with matte/satin varnish, but that I have never tried out.\n\n"
    },
    {
      "time": " 6.Jun.2007 2.43pm",
      "content": "I’ve always had printers express real concern when I start talking about putting ink over a metallic. But I’ve done it. Even did black + metallic duotones. (In each case, the printer wanted to do a presstest first, before the actual press run.)\n\nThe new Metal F/X proprietary software may be another answer, if your printer has a license. Though I think that may be only for four-color work. (I’ve only had occasion to use it once, and it was on a four-color piece.)\n\n"
    },
    {
      "time": " 6.Jun.2007 2.54pm",
      "content": "Another idea:\n\nThese two papers have a metallic silver sheen, and are available in text weights. You might want to print on one of them instead of putting metallic ink on a white paper.\n\nGilbert Esse Pearlized Silver 80 pound Text\n\nShine Pearl 80 pound Text\n\n"
    },
    {
      "time": " 6.Jun.2007 5.37pm",
      "content": "Okay, I was running late. I thought I should phone one of my favorite printers (one that has the Metal F/X license) to follow up on what I suggested in an earlier post. My printer’s rep confirmed that Metal F/X only works with 4-C process, so that won’t work, and then suggested printing on a silver paper. So we discussed silver papers and I got all excited and posted that. Then buggered off to my “previous commitment”, which incidentally was an Open House at a local paper merchant. Halfway to the warehouse I realized that Tim had already suggested the silver paper technique. And now I’m feeling particularly stoopid, ’cause I had read Tim’s post and thought he was offering good and sage advice, but in my excitement to report on what the printer’s rep said, I completely forgot Tim’s earlier post.\n\nHowever, while at the paper merchant’s Open House I found another stock that would work swimmingly for your project: Wausau Paper’s Chalice Silver 70 pound Text. As silvery as silver can be.\n\n"
    },
    {
      "time": " 6.Jun.2007 11.55pm",
      "content": "Ken, there is no problem on my part – your further research is admirable. I got a promotion pack from Metal F/X last year, but haven’t had the opportunity to use it, what are your opinions on the finished project?\n\nTim\n\n"
    },
    {
      "time": " 7.Jun.2007 12.12am",
      "content": "Kenny, you have to let me know about these sort of Open House thingies.\n\n- Lex\n\n"
    },
    {
      "time": " 7.Jun.2007 6.35am",
      "content": "Wow, I’m really appreciating all this advice.\n\nI’m not sure how much choice I have over the stock. I think we might be going with one of those “we do everything” CD manufacturers who have a standard stock (a “100lb gloss coated stock” according to their FAQ, and an “80lb uncoated text stock”. )\n\nKen or Tim, do you know if I would be able to get samples from the paper company? We’re actually running pretty tight on this (art is due next thursday, a week from today) so I’d need them very quickly and I wouldn’t want to do it sight unseen.\n\nHow would red print over silver?\n\nThanks Linda, that sort of example is very helpful. I’d be fine with doing 4c and just printing in a rich black but then I’d want to do spot varnishes...and I think I need more inspiration for using them in creative ways.\n\nHow would it look if every piece of text had a varnish over it? Would that be incredibly hard to read? Is it a bad idea?\n\n"
    },
    {
      "time": " 7.Jun.2007 7.30am",
      "content": "I don’t know the situation in the US, but samples could be posted to you (or delivered if a rep is in your area), they will probably have samples with print on them, get on the phone, the limiting factor (apart from budget) might be the printer. IMO the varnish on text, apart from the technical difficulty, would hugely reduce the legibility of the text.\n\nTim\n\n"
    },
    {
      "time": " 7.Jun.2007 7.43am",
      "content": "Brian, I agree with Tim about the varnish not being a great idea on text: if anything, I’d varnish the entire piece except the text, so that the contrast would make it stand out.\n\nAnd, of course, there are other places where it can be used effectively, such as instead of some sort of embosssing, a logo over an otherwise “plain” background, etc. As always in cases like this, talk to your printer rep, and they can provide excellent suggestions (well, mine always does!).\n\n"
    },
    {
      "time": " 7.Jun.2007 7.51am",
      "content": "I stay away from silver ink now unless it is a large swath - It just ends up looking white or gray. Silver foil, however, is wondeful. But I don’t white see how it applies to this design and foil is a lot more expensive.\n\nThe idea about printing on metallic stock seems like the best one here.\n\nI’ve seen text with spot varnish over it - it’s a nice effect but it definitely affects the legibility. In looking at this layout it doesn’t seem like legibility is your first concern (no offense intended). It will be tough to get perfect alignment on all this text, especially the thinner deco typeface.\n\nBest of Luck!\n\npiece\n\n"
    },
    {
      "time": " 7.Jun.2007 8.06am",
      "content": "Brian: to get paper samples fast, talk to your printer. They probably have a cabinet full of samples and swatchbooks. (Or check your local paper merchant.) They’ll also know if any of the papers are readily available. I don’t know why they wouldn’t be available to you. Shine is a product of Reich Paper, headquartered in Brooklyn. Wausau Paper is headquartered in Wisconsin. They both have websites (www. company name including the word “paper” as one word .com for both) but I find getting a feel for paper off a website is very difficult.\n\nTim: I used Metal F/X for the dust jacket of a photography book. Design was a very large photograph letterboxed with a fifth color (a warm grey) chosen to complement the palette of the photo. Client decided, at the last minute of course, to change the fifth color to their corporate color (basicly reflex blue with bit of magenta). I didn’t like the new color combination and was bitching to the printer, who suggested that Metal F/X would bring the tonal range of the photo and the corporate color closer. It worked great as a compromise. Photo-Boy was okay with metallic sheen and changed color palette of his photo. Client agreed the metallic sheen was pretty, even though it wasn’t his corporate color anymore.\n\nLex: Sorry, buddy. Didn’t realize you were into paper. I’ll let you know next time.\n\n"
    },
    {
      "time": " 7.Jun.2007 8.12am",
      "content": "As a point of interest, House Industries 10-year commemorative book uses spot metallic silver and spot varnish throughout. To good effect. Though not the same look as Brian is trying to achieve.\n\n"
    },
    {
      "time": " 7.Jun.2007 9.24am",
      "content": "Thanks guys, it probably would have made the smaller text hard to read. And Paul, you’re right. The band is all about making people work a bit...it’s part of the fun.\n\nIt’s really the creativity part I’m stuck on.\n\nHere’s some of my ideas.\n\n1. **Hide secret messages printed only in the varnish.**  \nHow much would this affect the legibility of what’s underneath? Would the secret text have to be really big to be readable?\n2. **Emphasize certain lyrics that stand out**  \nSame issue with legibility mentioned before.\n3. **Emphasize various rectangular divisions (black bars)and images**  \nThe most obvious answer, but also a bit...unsurprising? I don’t feel like it would add that much. Also, there aren’t too many images.\n\nAnyway, most of this stuff is just thinking aloud. Thanks so much you guys.\n\n"
    },
    {
      "time": " 7.Jun.2007 12.18pm",
      "content": "Autechre  \nPeel Sessions 2 CD  \nAll text: knocked out of clear varnish on white stock, 5 pt. Helvetica\n\n"
    },
    {
      "time": " 7.Jun.2007 1.05pm",
      "content": "Solid black background with text in spot varnish only. That should make them work.\n\nI have seen this done to great effect.\n\npeas\n\n"
    },
    {
      "time": " 7.Jun.2007 1.06pm",
      "content": "<cite>Hide secret messages printed only in the varnish.<br>\nHow much would this affect the legibility of what’s underneath? Would the secret text have to be really big to be readable?</cite>\n\nIt would certainly have to be larger than ordinary text, and heavier, but not too heavy. I woldn’t suggest going smaller than a 12pt medium weight. And there of course would have to be a significant step between the varnish gloss and the paper finish.\n\nYou could also add texture with thermographic embossing, using the clear varnish as glue for the powder (instead of ink as is usually done). I’ve seen this done on packaging before. It’s a pretty neat effect.\n\n"
    },
    {
      "time": " 7.Jun.2007 1.40pm",
      "content": "Paul, as good as that sounds, it’s a little too much, especially since we have to cram a lot on there so it’s gonna be tough to understand as it is.\n\nCuttle, For the secret messages, I was thinking really big, like 24pt or so. And by significant step, you mean in terms of brightness right? not like a production step of drying or sealing or something.\n\nSpoke with the printer, he said they have this new technology called “One Shot” that ends up being extremely similar to Spot UV but at a fraction of the cost. He’s UPSing me samples I’ll have tomorrow.\n\n"
    },
    {
      "time": " 7.Jun.2007 1.50pm",
      "content": "Oh yeah, 24pt should be no problem. By “significant step” I meant in terms of relative sheen between the paper surface and the varnish. It would be somewhat useless to print your secret messages in matte varnish on matte stock, or in gloss varnish on glossy coated stock. But that all depends on just how “secret” you want your messages to be.\n\n"
    }
  ]
}
