{
  "id": "34284",
  "title": "Typeface for web and print",
  "forum": "Design",
  "tags": [

  ],
  "content": "I was wondering if someone could suggest me a good typeface that does well in print and also in webdesign. I’m planning on using Sifr for webpage headings (flashfile that replaces fonts). I want the type to be as easy on the eyes as possible.\n\nFrom what I found on the net, webfaces should have lots of white in the characters. That’s why my first thought was the Nexus family. But I’m not sure yet.\n\nAnybody got some better suggestions plz?\n\nmany thnx\n\nYves Peeters\n\nps. I’m bored of seeing Din and Meta so they are no option ^\\_^\n\n [‹ Government and language/design frustrations](http://web.archive.org/web/20081025044312/http:/www.typophile.com/node/36456 \"Go to previous forum topic\") [Design Example Needed - School/Learning Related ›](http://web.archive.org/web/20081025044312/http:/www.typophile.com/node/36528 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025044312/http://www.typophile.com/user/19001\" title=\"View user profile.\">YvesPeeters</a>",
  "time": "<br>",
  "uid": "19001",
  "comments": [
    {
      "time": " 6.Jun.2007 2.49pm",
      "content": "Some more information might be helpful. What is the website? Who is the intended audience?\n\n- Lex\n\n"
    },
    {
      "time": " 6.Jun.2007 2.51pm",
      "content": "Yves Peeters? Sorry, I was confused for a second. Never mind.\n\n"
    },
    {
      "time": " 6.Jun.2007 2.58pm",
      "content": "I want to write about usability, webdesign,... also would like to use it on some of my blogs and printouts, maybe in autogenerated pdf files of my webpages.\n\nIf possible it should also have Serif, sans-serif, nice ligatures, medieval numbers.\n\nThe less the user notices that I’m using a special font the better.  \nSomething like a verdana, but one that would work well in webdesign and print.\n\nI also noticed that it’s rather hard to find a good guide on what webtype should look like. If anyone could point me to one, I would be really happy.\n\n"
    },
    {
      "time": " 6.Jun.2007 3.08pm",
      "content": "There are many Yves Peeters where I come from :)\n\n"
    },
    {
      "time": " 6.Jun.2007 4.35pm",
      "content": "right....\n\n"
    },
    {
      "time": " 6.Jun.2007 4.58pm",
      "content": "_I also noticed that it’s rather hard to find a good guide on what webtype should look like. If anyone could point me to one, I would be really happy._\n\n[The Elements of Typographic Style Applied to the Web](http://web.archive.org/web/20081025044312/http:/webtypography.net/)\n\nThis is more of a technical guide on how to make type look good with CSS, though.\n\n"
    },
    {
      "time": " 6.Jun.2007 5.10pm",
      "content": "Thnx Illicium.  \nCurrently thinking about FF quadraat (Fred Smeijers)  \nLike the italic and the Sans but I hate the “B” in the regular :)  \nImo it just looks odd. But then again, I’m not much of a designer.\n\n"
    },
    {
      "time": " 6.Jun.2007 6.28pm",
      "content": "From the archives of the inimitable Roy Preston:  \n [http://gmunch.home.pipeline.com/typo-L/cart/mini38b.gif](http://web.archive.org/web/20081025044312/http:/gmunch.home.pipeline.com/typo-L/cart/mini38b.gif \"http://gmunch.home.pipeline.com/typo-L/cart/mini38b.gif\")\n\nI love Quadraat, but I’d be shocked if it looks good onscreen.\n\nThere’s a little secret about Rotis: the Sans Bold looks  \namazingly clear at very small sizes (but track it looser).\n\nhhp\n\n"
    },
    {
      "time": " 7.Jun.2007 3.51am",
      "content": "I was thinking Quadraat Sans would be good bcuz:  \nI have the impression it has a high X-height, much white in the lower “a” and “e”. Please correct me if I look at it totally wrong\n\n"
    },
    {
      "time": " 7.Jun.2007 6.57am",
      "content": "But a big factor in screen rendering is “rigidity”:  \nfonts that have very “expressive” outlines tend to  \ncause too much blur. And Quadraat is like that.\n\nBTW, how could I forget! A really great font for screen use  \n(I used to rely on it heavily until I made Mana) is Laudatio.\n\nYou might also try Legato.\n\nhhp\n\n"
    },
    {
      "time": " 7.Jun.2007 7.37am",
      "content": "“I want to write about usability, webdesign”\n\nThen rethink using sIFR. ;o)\n\nAlso, use whatever typeface hrant suggests. I think his tolerance threshold for on-screen type is pegged extremely low, so if it pleases him, it should please the masses. ;o)\n\n"
    },
    {
      "time": " 7.Jun.2007 8.44am",
      "content": ":) what’s wrong with sIFR? it does degrade nicely. I was gonna use it for headlines, so I don’t see any harm done to usability/webdesign. ^\\_^\n\n"
    },
    {
      "time": " 7.Jun.2007 9.19am",
      "content": "Darrel, that’s the nicest thing anybody’s said about me in weeks! ;-)\n\nBTW, I wanted to make a small edit to my first  \npost but the “edit” is missing... Wassupwidat?\n\nhhp\n\n"
    },
    {
      "time": " 7.Jun.2007 11.56am",
      "content": "“what’s wrong with sIFR? it does degrade nicely.”\n\nWell for starters, it doesn’t work sometimes. Look at this site, for example...I can’t view most of the topic titles. Now, maybe that’s typophile’s fault and not sIFR’s. ;o)\n\nBut, that said, at home I use FlashBlock a lot. As I dislike most flash (or rather, the way most flash is implemented) so sIFR doesn’t work for me.\n\nIt’s not BAD, but it’s just yet-another-variable to go wrong in getting the information to your end users.\n\n"
    },
    {
      "time": " 7.Jun.2007 12.08pm",
      "content": "\\> at home I use FlashBlock a lot\n\nAnd some people don’t use computers - sIFR doesn’t work for them either.\n\nhhp\n\n"
    },
    {
      "time": " 7.Jun.2007 1.00pm",
      "content": "“And some people don’t use computers - sIFR doesn’t work for them either.”\n\nSlopes are slippery, aren’t they?\n\n"
    },
    {
      "time": " 7.Jun.2007 1.01pm",
      "content": "hehe. true it doenst work with flashblock but you can still read the content.(if no javascript or flash is found it uses the css) Same goes for sites that are made for IE6. If done right people with internet explorer 5 can still read the content.\n\nThat’s what internet is all about imo. People with a state of the art computer get the content they payed for + some extras. People with a lower system just get the content. That’s a nice way of designing imo ^\\_^\n\nps I dislike most use of flash also, since it’s in many designs not even needed and hides content from google. ( I wish macromedia director had won the plugin-wars )\n\n"
    },
    {
      "time": " 7.Jun.2007 2.10pm",
      "content": "“hehe. true it doenst work with flashblock but you can still read the content.(if no javascript or flash is found it uses the css)”\n\nActually, with flashblock, no, you can’t see either. Same with typophile. I don’t use flashblock here, but for some reason 9 out of 10 sIFR titles just don’t show up for me.\n\n“eople with a lower system just get the content. That’s a nice way of designing imo”\n\nI completely agree. Progressive enhancement is a great model for web design. And sIFR is a neat idea. Works most of the time but has a few major flaws for some folks.\n\n"
    },
    {
      "time": " 7.Jun.2007 2.38pm",
      "content": "Strange. This is what the sIFR site has to say about Flashblock:\n\nWe’ve worked with the developers of the Firefox FlashBlock extension to make sure sIFR text is automatically degraded to (X)HTML for users of recent versions of FlashBlock. When users install FlashBlock, they are demonstrating a bias against Flash (most likely because of the incredible amount of obnoxious and invasive advertising on the web these days) and we want to respect this bias.\n\n"
    },
    {
      "time": " 7.Jun.2007 10.55pm",
      "content": "I think, I am not sure, the swf extension stands for “Shockwave Flash” and you can export from Director to a flash file that is readable by the flash plugin. This does not include the fun 3d stuff, as for other things, I am not sure.\n\nBTW if you are only using it for headlines, then small readability will not be an issue... what body face(s) do you plan on specifing(respectively)?\n\n"
    },
    {
      "time": " 8.Jun.2007 1.25am",
      "content": "I’d go with one of these:  \n [http://www.adobe.com/type/browser/U/U\\_web-pages.html](http://web.archive.org/web/20081025044312/http:/www.adobe.com/type/browser/U/U_web-pages.html \"http://www.adobe.com/type/browser/U/U\\_web-pages.html\")\n\nSince you’ll be talking about usability I’d combine Minion and Myriad.\n\n"
    },
    {
      "time": " 8.Jun.2007 11.44am",
      "content": "Yves...good news from the sIFR folks...looks like I should upgrade my Flashblock plug-in.\n\n"
    },
    {
      "time": " 9.Jun.2007 3.29pm",
      "content": "I wonder if there any print differences in the Adobe Web Pro fonts and their regular cousins.\n\nDoes hinting affect printing? Or is it a combination of modified forms and hinting that make a “proper” screen type family?\n\nMike\n\n"
    },
    {
      "time": " 10.Jun.2007 3.32am",
      "content": "Sorry I am not so knowledgable as everyone on here but all I know is that usually the typefaces with less contrast of thin and thick strokes are used on web and TV etc due to the fact that they work on screen and do not lose their quality of their strokes etc.\n\n"
    },
    {
      "time": " 10.Jun.2007 9.44pm",
      "content": "Is nobody going to address Mike’s line of questioning?\n\nhhp\n\n"
    },
    {
      "time": " 11.Jun.2007 1.10am",
      "content": "Perhaps Mr. Phinney can chime in on my questions.\n\nAlso read this last sentence on this FontShop webpage:\n\n[http://www.fontshop.com/services/logo.php](http://web.archive.org/web/20081025044312/http:/www.fontshop.com/services/logo.php \"http://www.fontshop.com/services/logo.php\")\n\n_In addition, laser-printing a logo in font format at small sizes is generally superior to printing an EPS image due to the font’s hinting._\n\nMikey\n\n"
    },
    {
      "time": " 11.Jun.2007 9.10am",
      "content": "\\>Does hinting affect printing? Or is it a combination of modified forms and hinting that make a “proper” screen type family?\n\nHinting can affect higher resolution output, especially for controlling undershoots and overshoots for instance. The effects of hinting however, if done well should not be noticable on the printer, but will have a noticalbe effect when the font is displayed on lower resolution screens, to control consistency of x-heights, stem weights, Cap Heights, middle bars etc. As far as I know the fonts you are referring to are TrueType hinted fonts, and will be different from their Type 1 cousins on screen as well as in print, however subtely.\n\nMike\n\n"
    },
    {
      "time": " 28.Aug.2007 1.26pm",
      "content": "A list apart has an article about online type.  \n [http://www.alistapart.com/articles/cssatten](http://web.archive.org/web/20081025044312/http:/www.alistapart.com/articles/cssatten \"http://www.alistapart.com/articles/cssatten\")\n\n"
    }
  ]
}
