{
  "id": "34291",
  "title": "Ducks rule!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Although Ottawa Senators may have been anointed as “Canada’s Team,” it is true that the Anaheim Ducks (formerly The Mighty Ducks of Anaheim) have more Canadian players than the Sens.\n\nBut more important than that, the Ducks have Teemu Selanne, the pride of Helsinki, drafted by my Winnipeg Jets fifteen years ago, who finally gets to have his name engraved on Lord Stanley’s mighty cup.\n\nAs a proud Winnipegger, I am very pleased to acknowledge the superiority of the Ducks and Teemu over the Sens. Our dog, Spot, the miniature English Bull Terrier and serious Montreal Canadiens fan who has a sophomore card of Saku Koivu, also woofs her approval for all Suomi hockey players.\n\nOnly three months until training camp. ;-)\n\n(Let us now all stand and hum the [_Hockey Night in Canada_](http://web.archive.org/web/20071017053413/http:/www.hockeytheme.com/FrameRHistory.htm) theme.)\n\n [‹ 3D fonts-Fonts made from Objects](http://web.archive.org/web/20071017053413/http:/typophile.com/node/28738 \"Go to previous forum topic\") [[for sale] Reed/Mores reprint ›](http://web.archive.org/web/20071017053413/http:/typophile.com/node/34306 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071017053413/http://typophile.com/user/14015\" title=\"View user profile.\">Linda Cunningham</a>",
  "time": "<br>",
  "uid": "14015",
  "comments": [
    {
      "time": " 6.Jun.2007 9.16pm",
      "content": "I’m sure Lord Stanley’s Cup will look at its best in the southern cali sunlight. Congrats Ducks!\n\n"
    },
    {
      "time": " 6.Jun.2007 9.22pm",
      "content": "Wow, that was almost enough to make me like hockey.  \nThe Ducks. Go figure.  \n; )\n\n"
    },
    {
      "time": " 6.Jun.2007 9.23pm",
      "content": "As a die-hard Senators fan, it pains me to say this, but congratulations to the Ducks.\n\n"
    },
    {
      "time": " 6.Jun.2007 10.44pm",
      "content": "Teemu Selänne and the Stanley Cup are the main headline picture in the local papers this morning. He’s the sixth Finn to get the ring.  \n [http://www.hs.fi/](http://web.archive.org/web/20071017053413/http:/www.hs.fi/ \"http://www.hs.fi/\")\n\nThere was a bit of competition for a sporting headline, since Finland beat Belgium in football (soccer) last night. An unusual thing happened during that game when a huge owl stopped the game for six minutes, by landing on the goal to rest.\n\n"
    },
    {
      "time": " 7.Jun.2007 12.31am",
      "content": "It certainly was a big owl  \n [http://www.hs.fi/kuva/1135227822602?orientation=horizontal](http://web.archive.org/web/20071017053413/http:/www.hs.fi/kuva/1135227822602?orientation=horizontal \"http://www.hs.fi/kuva/1135227822602?orientation=horizontal\")\n\n_btw England defeated the mighty Estonians last night_\n\nTim\n\n"
    },
    {
      "time": " 7.Jun.2007 1.45am",
      "content": "I just heard that the owl actually lives at the Helsinki Olympic Stadium, has a nest there and all.\n\n"
    },
    {
      "time": " 7.Jun.2007 6.55am",
      "content": "Now \\*that\\* is an excellent owl!\n\n"
    },
    {
      "time": " 7.Jun.2007 7.08am",
      "content": "I love hockey...but I do wonder if a shorter playoff season might help the ratings a little. I gave up on following the playoffs weeks ago...and that was the halfway point!\n\n"
    },
    {
      "time": " 7.Jun.2007 7.25am",
      "content": "It’s been harder to care about the NHL since they went south of the Mason Dixon line. ;o)\n\n“I love hockey…but I do wonder if a shorter playoff season might help the ratings a little.”\n\nAbsolutely. With ALL the rule change craziness they’ve been doing, I think they’ve missed the obvious: a huge chunk of die-hard hockey fans don’t have any interest in hockey once the snow melts.\n\nThe NFL is always touted as the most succesful pro league out there money wise and I think it has a lot to do with the very compressed season they play.\n\n"
    },
    {
      "time": " 7.Jun.2007 8.01am",
      "content": "<cite>The NFL is always touted as the most succesful pro league out there money wise and I think it has a lot to do with the very compressed season they play.</cite>\n\nDefinately. My football friend fans (I get bored to tears trying to watch it) look forward to those sixteen games all year. In hocky the first sixteen games are a warmup to decide who goes back to the farm team for the first half of the season.\n\nAlthough only having two superstar players in the entire league, one of whom is not especially well-liked outside of Washington, isn’t helping.\n\n"
    },
    {
      "time": " 7.Jun.2007 8.10am",
      "content": "Nothing against the Ducks, but I had the misfortune last night to have to drive home down Katella Avenue past the Honda Pond, er, Center about a half hour before the game started. Traffic is bad enough here without a repeat of THAT. Sometimes I **really** need a roof-mounted Gatling. Although I do wonder who was in the limo with the “MVP2004” plates.\n\n"
    },
    {
      "time": " 7.Jun.2007 9.17am",
      "content": "First west coast victory in 82 years.\n\n"
    }
  ]
}
