{
  "id": "34292",
  "title": "print portfolio advice?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have a personal site online, but I have an interview coming up and think it might be nice to have a paper portfolio to present as well.\n\nThe interview is casual and I’m just looking to intern at a small company for no pay, but any advice?\n\nHow many pieces is a good number?\n\n [‹ [for sale] Reed/Mores reprint](http://web.archive.org/web/20080830095527/http:/www.typophile.com/node/34306 \"Go to previous forum topic\") [Quality of a free font ›](http://web.archive.org/web/20080830095527/http:/www.typophile.com/node/33530 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080830095527/http://www.typophile.com/user/17767\" title=\"View user profile.\">fredcastle</a>",
  "time": "<br>",
  "uid": "17767",
  "comments": [
    {
      "time": " 6.Jun.2007 10.35pm",
      "content": "Not only is it “nice” to have a paper portfolio as well, I wouldn’t expect anything less if you have print work (If you just have websites, that’s a slightly different story). You have to show them in the flesh; after all, it **is** print. Two classic approaches are to either get/make a nice container and use boards to show off your pieces, or use a book/binder format. I have found boards to be quite successful because you can control exactly what the interviewer is looking at, whereas if you have a book you will have to think about how the separate pieces will interact with each other when you put them on a spread and whether or not one is distracting the interviewer from what you’re saying. When it comes down to it, your physical portfolio should be “transparent” in that it allows your designs to be seen exactly for what they are with no distractions.\n\nAnd if you have logos, **don’t** try to save paper and put several on a single page. One logo, at size, on one page.\n\nAs far as number of pieces go, the more important principle to follow is to put in only your best work. Convince them that you do **great** work, not mediocre work. If you have 3 pieces that are awesome and 10 that just aren’t up to par, use the 3. If you have 8 that are phenomenal, good for you, but probably no more. I’ve seen too many student portfolios that are filled with junk. Quality, not quantity. As a maximum, I would say no more than 8.\n\nAnd try to tailor the pieces and your presentation to what the company does. Know who you’re talking to, and study up on what work they’ve done. You’ll be a much more legitimate prospect if you show them you actually give a crap about what they’ve done in the past.\n\nGood luck!\n\n"
    },
    {
      "time": " 7.Jun.2007 7.35am",
      "content": "Take as many pieces as you feel are of a quality worth showing. You don’t have to SHOW them all once there, but it’s good to have them ready.\n\nAnd rethink working for no-pay. ;o)\n\n"
    }
  ]
}
