{
  "id": "34304",
  "title": "Microsoft ClearType Font Collection now available for license from Ascender",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20070713145503/http:/typophile.com/user/108 \"View user profile.\") : 7.Jun.2007 7.43am \n\nAscender Corporation announced an agreement with Microsoft that allows it to  \ndistribute the new ClearType fonts featured in Windows Vista and Microsoft  \nOffice 2007. The ClearType fonts appeal to end users, graphic designers and  \nenterprises for use in earlier versions of Windows, non-Windows operating  \nsystems or in applications other than Microsoft Office. The Microsoft  \nClearType Font Collection can be downloaded from the  \n [http://www.ascendercorp.com](http://web.archive.org/web/20070713145503/http:/www.ascendercorp.com/) website.\n\n—\n\nELK GROVE VILLAGE, IL - June 7, 2007 - Ascender Corporation, a leading  \nprovider of advanced font products for hardware & software developers, today  \nannounced that they have entered into an agreement with Microsoft which  \nenables Ascender to distribute the Microsoft ClearType Font Collection  \ndirectly to end users.\n\nThe Microsoft ClearType Font Collection contains six new typeface families,  \neach with regular, italic, bold and bold italic styles. These fonts were  \ncarefully specified and cooperatively designed under the direction of  \nMicrosoft’s Advanced Reading Technologies team by leading type designers,  \nconsultants and font software engineers to significantly improve the  \non-screen reading experience through a combination of design iteration and  \nby leveraging Microsoft’s ClearType technology. Each of the 24 fonts  \ncontains extended multi-language support (including Latin, Greek and  \nCyrillic scripts), advanced OpenType typographic features and specialty  \ncharacter sets.\n\n“When our Advanced Reading Technologies team first approached me in 2003  \nwith the idea to develop a new collection of fonts I was intrigued. This  \ncollection could enable Microsoft to both leverage the great work done with  \nour ClearType technology and bring a fresh new set of high-quality fonts to  \nour environments. The ClearType Font Collection has surpassed my  \nexpectations in both respects and I am thrilled that we have been able to  \nmake such a significant contribution to both on-screen reading and  \ntypography in general.” said Bill Hill, Chief Reading Technology Researcher,  \nMicrosoft Corporation.\n\nThe 24 fonts in the collection are featured in Windows Vista and Microsoft  \nOffice 2007. This agreement makes these fonts more broadly available for  \nlicense in any operating system by individuals, graphic designers and  \nbusinesses.\n\n“We are proud that Microsoft has selected Ascender to offer their fonts.  \nMicrosoft has made a tremendous investment in their ClearType technology and  \nin these fonts. Their willingness to make these fonts available outside of  \ntheir new flagship products which incorporate these fonts is impressive,”  \nsaid Ira Mirochnick, President of Ascender Corporation. “The ClearType fonts  \nwill appeal to a wide spectrum of users, especially those users seeking  \nfresh, high-quality designs or document compatibility with Microsoft’s new  \nproducts.”\n\nEach typeface family in the Microsoft ClearType Font Collection has its own  \npersonality and flair that are the hallmark of their particular designer:\n\n- Calibri, designed by Luc(as) de Groot, is a sans serif design with a rich  \nsoft character that makes the font suitable for documents, email and Web  \ndesign. Calibri is the new default sans serif font in Microsoft Office 2007.\n\n- Cambria, designed by Jelle Bosma with Steve Matteson & Robin Nicholas, is  \na serif design suitable for business documents. Ross Mills designed Cambria  \nMath, featuring an extensive character set for mathematical, scientific and  \ntechnical publications. Cambria is the new default serif font in Microsoft  \nOffice 2007.\n\n- Candara, designed by Gary Munch, is lively but not intrusive sans serif  \ndesign suitable for email, Web design and informal settings.\n\n- Consolas, designed by Luc(as) de Groot, is a monospaced font (like an old  \ntypewriter) and good for programmers setting code (its core purpose).\n\n- Constantia, designed by John Hudson, is a modulated wedge-serif design  \nideal for e-book and journal publishing both online and in print.\n\n- Corbel, designed by Jeremy Tankard, was designed to give an uncluttered  \nand clean appearance on screen.\n\n- Cariadings, designed by Geraldine Wade, is a new symbol font featuring  \ntypographic ornaments that can be used as watermarks, border enhancements or  \nicons.\n\nThe Microsoft ClearType Font Collection is available now for purchase and  \ndownload from the [Ascendercorp](http://web.archive.org/web/20070713145503/http:/www.ascendercorp.com/) website.\n\nMore information on the Microsoft ClearType Font Collection, including an 18  \npage guide to the development and use of the typefaces can be found here:  \n [http://www.ascendercorp.com/ctfonts.html](http://web.archive.org/web/20070713145503/http:/www.ascendercorp.com/ctfonts.html)\n\nAbout Ascender Corporation\n\nAscender Corporation is a leading provider of advanced font products  \nspecializing in font design, development and licensing. Ascender’s founders  \nare font industry experts, and have been involved in developing some of the  \nmost important and influential fonts used in computers, phones and consumer  \ndevices. Ascender provides multilingual, custom font development for  \nenterprises and hardware & software developers. Ascender also provides high  \nquality fonts for immediate download from the Ascender Font Store website  \n( [www.ascenderfonts.com](http://web.archive.org/web/20070713145503/http:/www.ascenderfonts.com/)).\n\nContact:\n\nBill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 225  \nElk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730 ext. 10  \nFax: (847) 357 0731  \n [http://www.ascendercorp.com](http://web.archive.org/web/20070713145503/http:/www.ascendercorp.com/)\n\nTrademarks: Ascender is a trademark of Ascender Corporation. Microsoft,  \nCambria, Calibri, Candara, Consolas, Constantia, Corbel, ClearType, Windows  \nand OpenType are trademarks of Microsoft Corporation. All other trademarks  \nare property of their respective owners.\n\n￼\n\n",
  "author": "<a href=\"http://web.archive.org/web/20070713145503/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 7.Jun.2007 7.43am",
  "uid": "108",
  "comments": [

  ]
}
