{
  "id": "34310",
  "title": "Unprofessional Fonts from Professional Designers",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "At the risk of alienating at least some of the type designers and vendors at Typhophile, I’d like to start a discussion about “unprofessional” fonts from “professional” designers. In the last few years I’ve purchased at least 4 font families from well regarded designers and vendors, and paid no less than $125 for each of them that included from 4 to 20 fonts that I had to “fix” in order for the fonts to be useable. I don’t know why I want to protect the guilty, but I’d rather not name the fonts or the designers.\n\nWithout getting into a debate about Windows naming conventions (R/I/B/BI), two of the font families were not named as a family, e.g., their names were Fontname Regular, Fontname Italic, etc, so that you could not apply the I/B/BI attributes (in a word processing program, e.g.) to call up the appropriate font. There may be some reason for this for some people in special fields using special software, but for the rest of us, its a PITA.\n\nThe other two font families were internally mislabeled (I don’t remember exactly how, but something like) the family name was correct but the attributes were misapplied (i.e., the regular was labeled as italic).\n\nWhat’s with this? How may others have had similar problems? Why does this happen?\n\nIf this happens to you, and you can’t or don’t want to correct this on your own, what’s your recourse? If you’ve tried to deal with the designer or vendor about this kind of issue, have you had any luck?\n\n [‹ Instructions call for \"double spaced\" body text - What's that?](http://web.archive.org/web/20081207065724/http:/typophile.com/node/34324 \"Go to previous forum topic\") [Punchcut presents Typophile Film Fest 4, October 25, San Francisco ›](http://web.archive.org/web/20081207065724/http:/typophile.com/filmfest4 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081207065724/http://typophile.com/user/15371\" title=\"View user profile.\">Renaissance Man</a>",
  "time": "<br>",
  "uid": "15371",
  "comments": [
    {
      "time": " 7.Jun.2007 10.55am",
      "content": "I’ve been working on a commission to modify a Goudy  \nfont, and some of the stuff in there is just plain horrid.\n\nhhp\n\n"
    },
    {
      "time": " 7.Jun.2007 11.02am",
      "content": "_If this happens to you, and you can’t or don’t want to correct this on your own, what’s your recourse?_\n\ncontact the foundry directly. that seems like the most logical thing to do. i’ve personally done this on several occasions. some foundries will take heed and make changes, others will not acknowledge your complaint: at least that’s been my experience.\n\n"
    },
    {
      "time": " 7.Jun.2007 12.40pm",
      "content": "My experience is they are willing to fix things. One even volunteered to fill in the international characters. A lot of times when there is a mistake, they won’t know because no one says anything. Best to let them know.\n\n"
    },
    {
      "time": " 7.Jun.2007 1.47pm",
      "content": "At the design agency where I am interning I was given the fonts I would need for working on projects for the particular client I am assigned to. However, I was given the entire family in about 10 seperate files. Some include only bold all caps and regular, some just book and book italic. Not to mention the font name is so long with the addition of the type style tacked on that I have to blindly click through them in InDesign, because all I can read is MetaPlusB (which could be “bold all caps”, “black”, “bold italic” or one of 4 others).\n\nThank god they are changing their typeface after the re-arc.\n\n... \\_.\\_. ... .. ... \\_\\_.. ...\\_ ...\n\n"
    },
    {
      "time": " 7.Jun.2007 2.08pm",
      "content": "Shaun, you are truly a member of the OpenType Generation. Welcome to the past. ;-)\n\n"
    },
    {
      "time": " 7.Jun.2007 3.45pm",
      "content": "A disproportionate amount of font problems I encounter end up being from vendors in the “abandonware” category. Vendors that are currently shipping fonts typically work to protect their reputation, as does any other software vendor. Foundries like Adobe can dedicate resources for testing. However, smaller designers sometimes must rely more on feedback from customers. My experience is that most foundries are very interested in resolving these sorts of issues quickly, because they don’t want to deal with similar complaints from multiple customers. If they can get a problem fixed early it won’t come up again. Sometimes with legacy fonts, these problems can be remedied by a simple rebuild in FontLab. Another issue is font vendors with large varied legacy libraries. I’ve noticed that fonts.com will sometimes sell parts of a PostScript font that contain suitcase references to the other parts of a family—technically orphans. This really a junky way to do things. They’re probably not focused on expanding their sales of PostScript fonts at the moment though. So, I guess as a generalization, ownership and a vendor’s pride in a quality product are probably the most important factors. I would contact them directly.\n\n"
    }
  ]
}
