{
  "id": "3431",
  "title": "Bouma",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://www.typophile.com/forums/messages/72/2739.html](http://web.archive.org/web/20131107164327/http:/www.typophile.com/forums/messages/72/2739.html)   \n   \nFirst of all, I didn't really invent the term \"bouma\": it's adapted from the term \"Bouma-shape\" used by Saenger in his \"Space between words\"; he in turn claims to have taken it from the work of Taylor & Taylor (although I myself have yet to find any such term used by them), and is based on the Dutch psychologist Herman Bouma who formalized empirical research into word-shape-based reading. Professor Bouma himself had never heard of the term (a friend of mine asked him). The only things I can take credit for is making it convenient (a single lc word), and spreading it. BTW, there are a number of reasons I like \"bouma\": I think it's euphonic, hence memorable; it doesn't sound like a German lobotomy clinic; and we need a fresh start.   \n   \n(BTW, I definitely didn't invent \"bicameral\". I think I got it from some online discussion years ago. Maybe it's not good, but at least it doesn't sound provincial like \"two-storied\"...)   \n   \nAs for being ahead of its time, I think maybe it's just the opposite: the way in which the bouma concept can be most useful is in countering what I call the Familiarity Escape Clause, which has risen to prominence in the last 15 years, and which so many designers use to avoid \\*thinking\\*. It promotes the consideration of the \"subvisible\" issues in typography, which laymen cannot appreciate through conscious observation, but are significantly affected by nonetheless.   \n   \nIt can also be useful in two very tangible ways:   \n1. Refining conventional type design, specifically by making x-heights smaller, spacing tighter, etc.   \n2. Motivating alphabet reform, or at least some formal thinking about the alphabet, like in moving away from the cloying world of calligraphic type.   \n   \nThe first one is not at all \"revolutionary\", and the second one might be more \"evolutionary\": we should realize that we need to design words (or more accurately letter-strings) primarily, and individual letters only secondarily. Anyway, thanks Martin, and keep your eyes open for an upcoming article in tipoGraphica magazine (and its eventual online version in English).   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "25 Sep 2002 — 2:52pm",
  "uid": "1250",
  "comments": [
    {
      "time": "26 Sep 2002 — 5:29am",
      "content": "Hrant --   \n   \nThanks for the clarification on the origins of \"bouma.\" I didn't realize that \"Bouma-shape\" had been previously published. I don't necessarily think \"bouma\" and your use of it is bad. I just think it's useful to keep in mind that the term is newly coined and its use is strongly associated with you and your theories.   \n   \nAs for \"bicameral,\" I didn't mean to imply that you invented it; but the use of the word to describe the two-story form of 'g' is, I believe, unique to you. Is it possible that you misappropriated it from Bringhurst? He uses \"bicameral\" to describe the dual-case nature of the Latin alphabet. \"Bicameral\" means \"having two chambers\" and is used primarily to refer to governments comprised of two legislative chambers and it carries an implication of hierarchy -- think House of Lords and House of Commons. Thus Bringhurst uses it to describe an alphabet like Latin (with its majuscule and miniscule -- its upper and lower cases) or Greek or Cyrillic -- as opposed to Devanagari or Hangul, for instance, which have no capitals.   \n   \n-- K.\n\n"
    },
    {
      "time": "27 Sep 2002 — 5:13pm",
      "content": "\\> strongly associated with you and your theories.   \n   \nMy theories concerning readablity are only really mine to a small extent: they're mostly \"codifications\" -or at most direct interpretations- of generally accepted views in psychology. However, the way I apply them (like in Alphabet Reform) are decidedly mine - although those are still \"public domain\".   \n   \nI think \"my\" theories seem idiosyncratic largely because Theory in general (at least in the realm of type design functionality) has been completely shunned during the past couple of decades. I \\*wish\\* people would challenge my views with more than the classic \"nothing matters\" relativist fallback...   \n   \nExample:   \nA lc \"a\" without a strong terminal (on top) contributes more to readability than one with. Discuss.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Sep 2002 — 2:23pm",
      "content": "\\> the use of [\"bicameral\"] to describe the two-story form of 'g' is, I believe, unique to you.   \n   \nI swear, I got it from some online discussion a while back.   \n   \n\\> [Bringhurst] uses \"bicameral\" to describe the dual-case nature of the Latin alphabet.   \n   \nYes, I know. It seems clunky to me.   \n   \nhhp\n\n"
    },
    {
      "time": "29 Sep 2002 — 7:02am",
      "content": "I didn't mean that your theories are necessarily yours exclusively or entirely or originally. But you must admit that you have refined the ideas and applied them in your own ways, and you are the most visible and vocal exponent of them, so things like \"bouma\" are closely associated with you. That's all.   \n   \n_\\>I swear, I got it from some online discussion a while back._   \nHmmm. Okay, I believe you. But I'll bet it was originally a misappropriation of Bringhurst.   \n   \n_\\>Yes, I know. It seems clunky to me._   \nIt seems clunky to me, too, but at least it makes more sense. If you want latinate jargon, then an alternative description for the two-storied form of 'g' is \"binocular,\" since a counter is sometimes referred to as an eye. It has the disadvantage of other familiar associations, but it does conjure up Eric Gill's \"spectacles\" characterization. [cf. _An Essay on Typography_]   \n   \n_\\>A lc \"a\" without a strong terminal (on top) contributes more to readability than one with. Discuss._   \nYou know that I'm more than happy to debate you on such matters (as we have on various occasions) when I have the time. But, it would be easier to have a useful discussion with you if you would provide more substance than just a broad, blanket statement like this. Please elaborate: Why/how? Define \"strong terminal.\" Can you cite an example for us to examine where the lack of terminal improves legibility?   \n   \nThen we have something to discuss. Otherwise, the discussion tends to quickly deteriorate into \"No it doesn't\" \"Yes, it does\" \"So's your mother\" \"Nyaah\".   \n   \n-- K.\n\n"
    },
    {
      "time": "29 Sep 2002 — 3:17pm",
      "content": "\\> \"binocular\"   \n   \nLove it. I've now switched.   \n   \n\\> Please elaborate   \n   \nWith pleasure.   \nBasically, the essence of the \"a\" (what it contributes to readability) is in it's bottom bowl; a strong top makes it more of a nondescript blob, especially in blurry parafoveal vision (which makes up about 2/3rds of reading). An \"a\" with a weak top contributes some great divergence into boumas. What's a good finial for a (highly-readability) lc \"a\"? Anything with no flare, certainly no big lump at the end.   \n   \nThe lc \"a\" in Petr van Blokland's Proforma, your Whitman, and my Patria are good. The lc \"a\" in the Text cut of Smeijers's Arnhem\\* is bad (especially since the Display cut has a nice -if somewhat too old-school French- one with no terminal). But when I say \"good\"/\"bad\" here, I'm talking about \"raw\" functionality, and only for text work. There might still be an over-riding aesthetic reason to put a blub on the terminal - as long as you know the damage that's doing to reading. Example: in Patria the lc \"a\" has a fine terminal, but overall it's too wide; it would be more readable narrower. So why did I make it (as well as the lc \"e\", \"g\" and \"s\") too wide? Because it plays better with the character of the face.   \n   \n\\* [http://www.new-series.org/?arnhem](http://web.archive.org/web/20131107164327/http:/www.new-series.org/?arnhem)   \n   \nBTW, a few weeks ago I started preparing a short expose about how we read, parafoveal vision, boumas, etc. and will publish it on my site as soon as it's ready; it has some interesting pitchurz.   \n   \n\\> Otherwise, the discussion tends to quickly deteriorate into ....   \n   \nYes, that's the worst.   \nOn the other hand, in \\*starting\\* a discussion I've found that when I elaborate too soon and in too much detail, it tends to stifle further contribution from others. So a seemingly dogmatic intitial statement actually has its usefulness! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "30 Sep 2002 — 5:57am",
      "content": "Well, yes, I suppose those outrageous, dogmatic statements have sparked some spirited debates, but they always seem to start off polarized.   \n   \nHow can I argue with your 'a' declaration when you start right off praising my own design? ;-) But I will say this: I think it depends upon how you want to define \"strong terminal.\"   \n   \nI agree that some faces with very strong ball terminals -- many of the modern genre -- tend to be too dark in text sizes, and I can see your point about becoming nondescript at parafoveal distances.   \n   \nBut I think that your declaration terminal=bad / no terminal=good is an over-simplification. I don't think that the terminals on Jenson-inspired faces, for instance, detract from the divergence of the 'a'. I find most of the traditional book faces (the Aldines and Garaldes) completely acceptable in terms of divergence. I think it comes down to a balance of the weight and style of the terminal in relation to the weight and size and shape of the bowl. I don't think it's so much a matter of the terminal _per se_ as it is a matter of the curvature and closure of the upper counterspace.   \n   \nI think the no-terminal 'a' runs other risks, mostly the vulnerability to creating distracting gaps when paired with certain letters, like 'c k r s.' When designing a no-terminal 'a' for a text face, one has to pay special attention to the curvature and where the stroke does end.   \n   \nLet me ask you this: I seem to remember that one of the points to your alphabet reform analysis was that the traditional 'a' and 'e' are too similar in rotation. Doesn't the elimination of the top terminal of the 'a' deprive the shape of one of its important divergent characteristics?   \n   \n-- K.\n\n"
    },
    {
      "time": "30 Sep 2002 — 8:23am",
      "content": "\\> I think it comes down to a balance of the   \n\\> weight and style of the terminal in relation   \n\\> to the weight and size and shape of the bowl.   \n   \nOK, or more generally the relation of the terminal to the overall color of the face. But if you agree that a text face has to fall within a narrow range of color (or more accurately, a narrow range of balance between positive and negative space), then maybe any strong terminal \\*is\\* just bad after all.   \n   \nSure, \"strong terminal\" is relative, but basically I see the two requirements as:   \n1. Primarily: the shape should contribute divergence to boumas - like the lc \"a\" should contribute a hole towards the top of the x-region.   \n2. Secondarily: the shape should be pleasing during conscious evaluation, especially in the context of the entire glyph set - and I for one think the \"weak-top\" lc \"a\" can work beautifully in a font - look at Proforma.   \n   \n\\> When designing a no-terminal 'a' for a text   \n\\> face, one has to pay special attention to   \n\\> the curvature and where the stroke does end.   \n   \nOK, sure. Just like a lc \"r\" is harder to space/kern than an \"n\".   \n   \n\\> I seem to remember that one of the points   \n\\> to your alphabet reform analysis was that   \n\\> the traditional 'a' and 'e' are too similar   \n\\> in rotation. Doesn't the elimination of the   \n\\> top terminal of the 'a' deprive the shape of   \n\\> one of its important divergent characteristics?   \n   \n\"Hey, you're paying attention, doofus!\" -Butthead   \nWow, you're sharp. :-)   \n   \nIn the beginning of my \"research\" I put too much emphasis on letterwise conflict: it's instictive (since generally we can only appreciate individual shapes in consciousness), plus I was influenced by the bulk of legibility research which limits itself to the decipherment of individual glyphs. There \\*is\\* a relevance to the rotation deal, but it's nothing compared to what the glyphs -in their normal positions- contribute to boumas. For example, if the \"a\" in a font is made my taking an \"e\", rotating it 180 and adding a tail to its bottom-right, you will occasionally cause a \"fault\" in reading (basically when you're looking at a long and/or unfamiliar word in foveal vision). But since the \"a\" and \"e\" obviously only appear in their normal positions (in normal text), it's much more important to mind what they contribute to boumas. So in fact the funky \"a\" I describe above might actually be more \\*readable\\* than the conventional \"bulbed\" lc \"a\"!   \n   \nhhp\n\n"
    }
  ]
}
