{
  "id": "34324",
  "title": "Instructions call for \"double spaced\" body text - What's that?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’ve been reading about type size and leading, but now I am faced with an interesting puzzle. Instructions require for a document with body text in a roman typeface, 14 pt size, “double spaced.” What would you consider double-spaced? A couple of possibilities: 1) Line-spacing at exactly 28 pt because it’s twice the hieght of the 14 pt text? 2) Line spacing at 32 pt based on the theory that that single-spaced 14 pt type probably would be set 16 pt?\n\nNo, there is no opportunity to ask for further clarification.\n\nI know there’s not a rigid right answer, but I am interested in how typophiles would approach this issue.\n\n [‹ Gizmodo: iPhone Countdown Dartboard/Calendar](http://web.archive.org/web/20080515214908/http:/www.typophile.com/node/34314 \"Go to previous forum topic\") [Unprofessional Fonts from Professional Designers ›](http://web.archive.org/web/20080515214908/http:/www.typophile.com/node/34310 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080515214908/http://www.typophile.com/user/19025\" title=\"View user profile.\">DJBird</a>",
  "time": "<br>",
  "uid": "19025",
  "comments": [
    {
      "time": " 7.Jun.2007 4.30pm",
      "content": "It’s an archaic term from the days of typewriters, where a single push of the return lever would result in advancing the paper a single line space, appropriate for the font it was equipped with (this would frequently, but not always, be equivalent to 10-12pt monospaced type on 12pt lines). A second push would result in double spacing, and a control lever could be set to automate this or give one and a half line spaces.\n\nMost word processing software has a simple toolbar function to simulate this. It gets a little more (needlessly) complicated the more sophisticated the software you use and the more knowledgeable you are.\n\n"
    },
    {
      "time": " 7.Jun.2007 4.32pm",
      "content": "Short answer:\n\nUse a word processing program, set the font to Times New Roman, 14pt, and click the double-spacing icon on the toolbar. Let the software do the overthinking for you.\n\n"
    },
    {
      "time": " 7.Jun.2007 5.46pm",
      "content": "Is this a legal brief, by chance? I ask because you might as well be quoting from the Federal Rules of Appellate Procedure as to the requirements for briefs in the federal Courts of Appeals. In any case, if you’re using Microsoft Word, do NOT set “line spacing” to “double.” Use “Exactly 28.” In Word, “double” line spacing simply doubles the “single” line spacing, which builds in a small amount of leading. Court rules require “double spacing” as a holdover from the typewriter days—in these days of word processors, etc., it’s an ambiguous term. But “exactly 28” puts the lines too far apart as it is for good readability and aesthetics—setting “line spacing” at “double” just makes things worse.\n\nIf this is indeed a legal brief, or some other situation involving text on 6.5 inch lines and 8.5 X ll inch paper, I also recommend that you choose a font other than Times New Roman. It’s too condensed, even at 14 point. The best font on your computer, if it uses Windows XP or Vista, is probably Palatino Linotype. Dunno about Macs. Many local rules also let you use 13 point instead of 14. You should consider that if it’s an option.\n\n"
    }
  ]
}
