{
  "id": "34337",
  "title": "Looking for Font/Colour Suggestions",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey there, I am doing a new site called trini block.com (no spaces) and I am looking for a fun font. To give you an idea of content, check out trini scene.com, trini pulse.com and island vibes.com (again, no spaces in the names). I am looking for something nice, to put as the site logo, to make Tshirts and to use as a logo for watermarking images. We’re just stumped here and I understand this is an excellent community where typography is concerned, so any help would be much appreciated.\n\nP.S The reason I put the URLS with no spaces is because I don’t want anyone to happen to find this post, want to keep it secret ;)\n\n [‹ Helvetica Film at Silverdocs](http://web.archive.org/web/20080314003602/http:/typophile.com/node/34460 \"Go to previous forum topic\") [Hurry, time's a wastin! // TYPOPHILE FILM FEST CALL FOR ENTRIES ›](http://web.archive.org/web/20080314003602/http:/typophile.com/node/34320 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080314003602/http://typophile.com/user/18523\" title=\"View user profile.\">samureye</a>",
  "time": "<br>",
  "uid": "18523",
  "comments": [
    {
      "time": " 8.Jun.2007 1.24pm",
      "content": "We need a REPORT AS SPAM link on Typophile.\n\n"
    },
    {
      "time": " 8.Jun.2007 2.58pm",
      "content": "Why is this spam? I am asking for suggestions dude.\n\n"
    },
    {
      "time": " 8.Jun.2007 3.03pm",
      "content": "Looked at the posting guidelines, this should be in the Design forum, my apologies.\n\n"
    },
    {
      "time": " 11.Jun.2007 6.32am",
      "content": "Dude, you were linking to link-farm pages. Sure smelled like Spam. Aplogies if it wasn’t.\n\nIf it wasn’t then you’re gonna have to provide a bit more context for us to really be of much help. Target demographics, business goals, etc.\n\n"
    },
    {
      "time": " 14.Jun.2007 7.18am",
      "content": "I get what you are saying, but I can assure you that’s not the case, I just registered the block site.\n\nAs for demographics, we’re going for any age group, so something to go for younger people but won’t turn off older people. We have some mockups though, take a look.\n\n[http://www.divshare.com/download/939177-7ff](http://web.archive.org/web/20080314003602/http:/www.divshare.com/download/939177-7ff \"http://www.divshare.com/download/939177-7ff\")\n\nI like the very last one and and column 2, row 4. You can see the general idea though, to have the .com in a block with rounded edges. This logo we want to put for the site, business cards, t-shirts, so we want it to blend well. I gave other sites as examples of what we are going to do, the site is still being developed, so forgive me if i can’t really give you much more to work with.\n\n"
    }
  ]
}
