{
  "id": "34350",
  "title": "whats the less eye tiring font?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hello\n\nwhats the less eye tiring font?\n\nwhich for computer screen and which for printed media\n\nthanks\n\n",
  "author": "<a href=\"/web/20100130191342/http://www.typophile.com/user/19039\" title=\"View user profile.\">colore</a>",
  "time": "<br>",
  "uid": "19039",
  "comments": [
    {
      "time": "",
      "content": "Can you generalize more your question, it's too specific.\n\n"
    },
    {
      "time": "",
      "content": "\"whats the less eye tiring font?\"  \nI'll assume this means to read.\n\n\"which for computer screen and which for printed media\"  \nFor screens users prefer to ¡see! either b & w, grey scale or ClearType but usually San Serif types. There is debate, indicating to me a wide spectrum of user preference (as well as a loud club of \"invented HERE\" pushers-in-action), over these three rendering techniques, and which is best for any given combination of user, screen, environment and reading preferences. When seeing is not enough and ¡reading! is desired, \\*things\\* change, but it's difficult to know exactly how since no one has done comparative studies of the same fonts and readers and content.\n\nPrint is easy, people like to read serif fonts. Adobe Garamond, Poynter Old Style or Century Schoolbook are three good examples of widely used text faces for print that do not tire users out as much as others.\n\nGood luck!\n\n"
    },
    {
      "time": "",
      "content": "\\> a wide spectrum of user preference\n\nMore like a bipolar disorder. Mac-heads used to think b&w bitmaps were better than moderate anti-aliasing, now they think FullFuzz™ is best. Windozers mostly just take whatever you throw at them with a \"Huh?\" Actually the latter is a bit less bad, because you don't want religion interfering in the optimization of reading.\n\nMe, I invent what I push, not push what I invent:  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20100130191342/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Colore, I have suggested before in this forum a measure for reading fatigue. My thought is that it is not so much the eyes as the brain that is tired when type and typography is less than optimal. My suggestion was to measure how soon reading comprehension declines over time--from fatigue--under varying conditions.\n\nTo my knowledge, this kind of experiment has not been done yet.\n\n"
    },
    {
      "time": "",
      "content": "Bunches of things haven't yet been done, and  \nwon't be, as long as the bouma model is denied.\n\nAnd of course it's the brain that gets tired and not not the eyes.  \nOtherwise we couldn't keep looking at stuff all day without having to close them.\n\nHowever, measuring reading comprehension is unnecessarily complex and brittle.  \nComprehension is self-regulating - all you really need to measure is speed.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>all you really need to measure is speed.\n\nThat is already being done, as I understand from Kevin Larson's posts here.\n\nI think measuring decline of comprehension with time might better discriminate between better and worse type and typography.\n\nI don't know whether it will turn out to be a more sensitive measure, but it seems to me worth a try.\n\nOne might also measure decline of speed with time, which so far as I know has also not been tried.\n\nI would suggest trying both to see whether there is a difference. The key thing in either case is to give time for fatigue to set in. It may be that having demanding reading material will also help get more sharp discrimination to show up.\n\n"
    },
    {
      "time": "",
      "content": "\\> That is already being done\n\nNon-immersively. No good.\n\n\\> decline of speed with time\n\nNo, just speed to complete a long reading task.\n\n\\> having demanding reading material will also  \n\\> help get more sharp discrimination to show up.\n\nNo, that moves the measurement from perception to comprehension,  \nwith the latter being outside the scope of typography and type.\n\nThe content has to be \"normal\".\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>No, just speed to complete a long reading task.\n\nWhy not measure the decline with time? The profile may tell us something.\n\nThe main thing is to push the length of time to where fatigue sets in, and there is a decline in comprehension or speed or both to varying degrees.\n\n\\>No, that moves the measurement from perception to comprehension,  \nwith the former being outside the scope of typography and type.\n\nDid you mean instead 'the latter', that comprehension is outside the scope of typography? I don't agree, but surely perception is within the scope of typography.\n\n"
    },
    {
      "time": "",
      "content": "\\> Why not measure the decline with time?\n\nYou could. Like you say, you could measure many things,  \nand each will give some bit of insight. But as usual it's a  \nmatter of priorities.\n\n\\> The main thing is to push the length of time\n\nYes, but equally important is to foster deep immersion, via non-invasive  \ntesting and... good typography! We need to measure the difference between  \ngood and exceptional, not good and horrible, because in the latter boumas  \nnever have a chance anyway.\n\n\\> Did you mean instead ‘the latter’\n\nYes, sorry - I edited it, but apparently not fast enough.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think there’s a strong need to understand eye fatigue. When someone breaks a finger there is an understanding that the bone in the finger fractured and that it can be repaired by stabilizing it and giving it stress-free time to repair. With eye fatigue we don’t seem to agree even if the fatigue is in the eye or brain.\n\nI’ve been partnering with optometrist James Sheedy’s visual ergonomics lab to learn more about eye fatigue. I’m putting together a talk for ATypI to talk about some of the findings from his lab.\n\n"
    },
    {
      "time": "",
      "content": "Certainly saccading is fatiguing - and really that's the  \nwhole point. I guess that doesn't count as brain fatigue,  \nbut neither does it count as retina fatigue... However I  \ndo see that what I wrote above is misleading; possibly I  \nwas too eager to dampen William's contribution - sorry.\n\nAnyway to me it's moot what part is getting tired first.  \nInstinctively I simply work from the assumption that  \nfixation duration should decrease and saccade distance  \nshould increase, and the type can help, by making it  \neasier to map the shapes to words.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>I’ve been partnering with optometrist James Sheedy’s visual ergonomics lab to learn more about eye fatigue.\n\nThat's great. But if there is a real difference between legibility [ability to distinguish letters quickly and accurately when flashed at you] and readability [ease of absorbing meaning] then increased brain fatigue as opposed to eye fatigue must be involved in equally legible but less readable material.\n\nLooking only at eye strain would seem to prejudge the issue that there is no valid distinction. Why not look actively for this, and actually test it rather than prejudging it?\n\nAfter all, typographers for over fifty years have thought the distinction is valid. They may be wrong, but such a prevalent view is at least worth testing, it seems to me.\n\nAlso it seems to me that the mental fatigue factor should be pretty readily evident, as you can always lengthen reading time to where everybody gets fatigued and performance--either speed or comprehension or both--go down. Then you can see whether there is a difference between, eg, the same font with different leading and measure, or different fonts that test as equally legible.\n\n"
    },
    {
      "time": "",
      "content": "\\> increased brain fatigue as opposed to eye fatigue must be  \n\\> involved in equally legible but less readable material.\n\nSure, but how is that related to typography?\n\n\\> such a prevalent view is at least worth testing\n\nHere I totally agree.  \nAnd the same thing applies to the serif, concerning which I've tried to  \nconvince Kevin not to simply ignore the mountain of anecdotal evidence.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> After all, typographers for over fifty years have thought the distinction is valid. They may be wrong, but such a prevalent view is at least worth testing, it seems to me.\n\nI think mental fatigue is also an interesting area of investigation. For me it made sense to start with eye fatigue as people complain about eye fatigue from computer usage, and I’d like to do something to reduce that problem, and Sheedy is a top optometrist interested in solving user problems related to computer vision syndrome.\n\n"
    },
    {
      "time": "",
      "content": "\\> Certainly saccading is fatiguing\n\nHow do you know? What would you measure to detect fatigue? How to measure eye fatigue is one of our key questions.\n\nI actually wouldn’t have guessed that saccading is fatiguing as we our eyes constantly saccade when open (and sometimes when closed too). Is breathing fatiguing?\n\n"
    },
    {
      "time": "",
      "content": "\\>people complain about eye fatigue from computer usage\n\nAbsolutely this is an important area worthy of research, and am glad you are looking into--just as a suffering user!\n\nI look forward to research on the other issue of brain fatigue as well, because I think it will capture a lot of the issues that traditionally print typographers have been concerned with. For example the sans vs serif in extended text--which I think is mixed up with the % black and spacing issues--will I think more likely yield to the extended test looking into the fatigue factor.\n\nedit: Upon reflection, I think that the key thing in distinguishing legibility and readability is not whether the fatigue is due to eye fatigue or brain fatigue, but simply that fatigue is a variable somewhat independent from legibility.\n\n"
    },
    {
      "time": "",
      "content": "I love reading Minion!!! Very easy on the eyes!\n\n"
    },
    {
      "time": "",
      "content": "\\> people complain about eye fatigue from computer usage\n\nBut extrapolating that to print is dangerous.\n\n\\> How do you know?\n\nCommon sense.  \nA key to good design.\n\nBut, of course, I do not Know. I do however Think.\n\n\\> What would you measure to detect fatigue?\n\nSpeed. Just leave it all up to speed.  \nWith the right testing parameters, it's all you need.  \nHow do I \"know\"? Instinct.\n\n\\> Is breathing fatiguing?\n\nIf you do it fast enough for a long enough time, of course. Just like there's strolling to admire the scenery versus running to catch the bus, there's reading a magazine in a waiting room versus reading a research paper for tomorrow's meeting.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_And of course it’s the brain that gets tired and not not the eyes. Otherwise we couldn’t keep looking at stuff all day without having to close them._\n\nI'm sorry, Hrant, I can't tell whether you are being facetious or actually mean this. Maybe my brain is tired :)\n\nOf course, by this silly argument, we couldn't keep thinking stuff all day without having to shut down our brain from time to time. Hmm.\n\nEye strain is one of the easiest, least subjective aspects of reading to measure, because eye movement is controlled by muscles and we can compare how those muscles move when performing different tasks, including reading different typefaces. Obviously there is going to be greater variability in eye strain between larger factors, e.g. different sizes of type, quality of reproduction, etc.\n\nMuscles get tired, so eye-tiredness is, if you'll excuse the phrase, a no-brainer. The brain doesn't have moving parts, so in what sense does it get tired? Obviously not in the same sense that eyes get tired. What happens is that _we_ get tired -- get holistically tired, if you like --, and lack of rest starts to affect the brain's ability to function properly. Unlike muscle fatigue, which can be addressed by resting or refocusing the particular muscle groups -- e.g. closing your eyes, looking at more distant objects --, brain fatigue requires overall rest (during which the brain, ironically, may be quite active for long periods).\n\nSo long as I am well-rested, my brain doesn't get tired from reading, and if it does get tired -- i.e. my attention wanders, my content retention diminishes -- that is symptomatic of general exhaustion, not because I've overexhausted my synapses. My eyes always give out before my brain does.\n\n"
    },
    {
      "time": "",
      "content": "Link to blurb on Kevin's ATypI talk - love the title...\n\n[http://www.atypi.org/05\\_Brighton/20\\_main\\_program/view\\_presentation\\_html?...](http://web.archive.org/web/20100130191342/http:/www.atypi.org/05_Brighton/20_main_program/view_presentation_html?presentid=384 \"http://www.atypi.org/05\\_Brighton/20\\_main\\_program/view\\_presentation\\_html?presentid=384\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Si. Okay, so correct my previous statement that 'eye strain is one of the easiest, least subjective aspects of reading to measure'. It _should_ be one of the easier aspects to measure, but apparently researchers have only just started trying.\n\n"
    },
    {
      "time": "",
      "content": "\\>So long as I am well-rested, my brain doesn’t get tired from reading, and if it does get tired — i.e. my attention wanders, my content retention diminishes — that is symptomatic of general exhaustion, not because I’ve overexhausted my synapses.\n\nIn general, any repetitive task, mental or physical, I think tires one quickly. For example, if you do a series of sums non-stop I predict that in not such a long time you will start to make mistakes, and not because of general fatigue. --If you switch to push-ups, you won't do fewer than you would be able to at the beginning. I may be wrong, but that's the kind of thing I'm talking about.\n\nIf you don't experience this, you are blessed. I personally cannot keep at a single task non-stop without experiencing 'brain fry' at some point within an hour. So I stop, take a short break, read Typophile :), and then return to the work task.\n\nAccording to the book [Fatigue as a Window on the Brain](http://web.archive.org/web/20100130191342/http:/books.google.com/books?id=fVL5fFYYV5MC&pg=PA38&lpg=PA38&dq=cognitive+fatigue&source=web&ots=wlJ4NeYThd&sig=I88qvoXpECkzflqbBR67EQqikSA#PPA37,M1) \"cognitive fatigue\" is a reality, and I see from googling that there are scientific articles on cognitive fatigue in astronauts, soldiers, victims of multiple sclerosis, stroke and others. Some of this relates to the impact of physically induced fatigue on mental performance, but others seem to look at the impact of mental tasks.\n\nKevin Larson above seems to think this is a legitimate area of research also.\n\nI agree with you that eye fatigue is certainly real--I've had headaches from wrong lens prescriptions, for example--but so is cognitive fatigue, both in my experience and it seems from the scientific literature.\n\nedit: [This article](http://web.archive.org/web/20100130191342/http:/cat.inist.fr/?aModele=afficheN&cpsidt=17119944) reports a test of mental fatigue due to visual attention tasks.\n\n"
    },
    {
      "time": "",
      "content": "\\> I can’t tell whether you are being facetious\n\nI was just being wrong - see my post of noon.\n\n\\> Muscles get tired, so eye-tiredness is, if you’ll excuse the phrase, a no-brainer.\n\nYup. My \"common sense\".\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"How to measure eye fatigue is one of our key questions.\"  \nAnd I have no doubt you will find an answer without testing screen vs. print reading. ;)\n\n"
    },
    {
      "time": "",
      "content": "Bill: [perhaps] having demanding reading material will also help get more sharp discrimination to show up.\n\nHrant: No, that moves the measurement from perception to comprehension,  \nwith the latter being outside the scope of typography and type.\n\nLegibility I think is primarily a perception issue--distinguishing one letter form from another. But readability has to do with ease of comprehension. While it is difficult to draw the line between perception and cognition--there are layers of processing--poor typography I think is cognitively taxing. So with fatigue induced by long reading of demanding material, the differences between better and worse typography may be more evident as our 'elasticity,' our ability to put out more effort and compensate for the problems will pass its limit.\n\nActually, looking at some of the material on line about cognitive fatigue, the differences in better and worse typography may show up also in subjects who are physically fatigued. Just have the subjects run five miles (if they are not marathoners!) and have them read something demanding with varying typography, and the differences may show up clearly.\n\n"
    },
    {
      "time": "",
      "content": "\\> readability has to do with ease of comprehension.\n\nFor authors, editors, etc. But for type designers a different distinction between legibility and readability exists: the former concerns deliberative reading, the latter immersive. Terminology depends on scope and context.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"apparently researchers have only just started trying.\"  \nI think you'll find that many interests were involved before 1999 in the publishing world, and many more have sprung on this since 1999, and that x900 more will begin springing up since the beginning of the year 2007. What I learned about print, was that aside from abnormal behavioral or physical causes, most print reading fatigue is related to being generally fatigued, then comes lack of good physical reading posture for the given environment, and then quality of reading material. For screen, aside from abnormal behavioral or physical causes, it's reversed.\n\nThis reversal (and recent mushrooming) is, I believe caused by what causes all reading fatigue --additional interference in the reading path by unclear edges and adjacentcies in the material, and there is just a whole lot more of it on the screen. It'll be interesting to see what the pros come up with though.;)\n\n"
    },
    {
      "time": "",
      "content": "\\>for type designers\n\nHrant,I have used the distinction as it has been used for the past fifty years at least.\n\nLegibility is how quickly and accurately one can read a word or a few words flashed on a screen, or seen as one approaches a distant sign on the road. These are different conditions, but would fall under 'legibility'. Readability is the ease of reading extended text. That subjective experience of 'ease' I suspect can be tested by having subjects read to the point of fatigue.\n\nYour different distinction may be valid, but it is yours and not a generally used one. I personally don't understand it.\n\n"
    },
    {
      "time": "",
      "content": "\\> I have used the distinction as it has been  \n\\> used for the past fifty years at least.\n\nPfft. It's still misleading. \"Eat Moose. 50,000 wolves can't be wrong.\"  \nDon't worry, there are things in type that are 500 years old and even  \nmore misleading.\n\n\\> Legibility is how quickly and accurately one can  \n\\> read a word or a few words flashed on a screen\n\nThis is not a useful definition. For one thing, it leaves no term for the  \ndecipherment of individual letters, which is a critical building-block.\n\nBTW, this definition is not standard at all - in fact it's quite rare.\n\n\\> Readability is the ease of reading extended text.\n\nYes, but <cite>in the domain of type</cite>, nothing to do with content.\n\nMy definition-pair accomodates the evidence, not least the anecdotal,  \nfor example that people <cite>think</cite> they can read sans better but in fact  \nwouldn't manage a book in one.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, that was an illustration; here is a definition:\n\n\"'Legibility' is based on the ease with which one letter can be told from the other. 'Readability' is the ease with which the eye can absorb the message and move along the line.\"\n\nThat definition--which includes both speed and comprehension--is from 'Types of Typefaces', 1967, reflecting current usage. According to the acknowledgments those who read the MS of the book and presumably did not have an objection to the definition include W. Hunter Middleton, Ed Rondthaler and Beatrice Warde.\n\nIf you want to introduce a new distinction, that is fine, but you and I don't get to decide on the meaning of publicly used words; it is what it is. In this case the definition reflects the usage in the type community it seems since the 30's.\n\n"
    },
    {
      "time": "",
      "content": "You just spontaneously changed your definition of legibility!\n\nAnyway the big old names don't scare me. And Warde? The cheerleader?!  \nYour hyper-conservative attitude has no place in my world.\n\n\\> If you want to introduce a new distinction\n\nI did that over 8 years ago.\n\n\\> you and I don’t get to decide on the meaning of publicly used words\n\nOf course not. But you and I do get to tell each other what we like and don't like  \nabout our respective definitions. I think yours are almost entirely useless.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "This big old names cannot prevent me from thinking. From my Typo-13 article:  \n\"In questions of science, the authority of a thousand is not worth the humble  \nreasoning of a single individual.\" - Galileo Galilei\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, what nonsense are you writing? Nobody is trying to stop you from thinking, least of all me.\n\nAnd I didn't change the definition. I learned it from that book, and have cited it on Typophile repeatedly,and put it in the Typowiki.\n\nWhat exactly is your own distinction? As I said I don't understand it, and I'm sure others are in the same boat. Please define 'deliberative' and 'immersive', because I don't know what they mean, and I'm sure others are in the same boat.\n\n"
    },
    {
      "time": "",
      "content": "You wield precedent like a club.\n\nAnd if you haven't absorbed what I've written about this umpteen  \ntimes over many years, why would you bother absorbing it now?  \nAnyway, Google.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>You wield precedent like a club\n\nRubbish. I said you are free to bring a new distinction. If it is better, more power to you.\n\n\\>And if you haven’t absorbed what I’ve written about this umpteen  \ntimes over many years, why would you bother absorbing it now? Anyway, Google.\n\nI tried googling, but didn't find a definition.\n\nI find you talking about immersive reading plenty but I still don't know your definition and don't know what you mean.\n\nI am not the smartest guy in the world, but I am also not stupid. And if I'm confused by your terminology then so are others.\n\n"
    },
    {
      "time": "",
      "content": "It's not about intelligence, but objective diligence.  \nGoogle: \"site:typophile.com deliberative immersive hhp\"  \nBut anyway it's not like you just got here. This makes me  \nfeel a bit like a dunce for reading everything you write.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, I just googled with the key words you recommended, and got to this thread from 2004: [http://typophile.com/node/6174](http://web.archive.org/web/20100130191342/http:/typophile.com/node/6174 \"http://typophile.com/node/6174\")\n\nIn it, John Hudson says he doesn't know what you mean by deliberative, and Kevin Larson also says he doesn't know. You do make a claim about reading speed for 'immersion' that you then retract. So far as I know, that's where it rests, which is why I asked for something new. You just seem to take offense, so never mind.\n\n\\>additional interference in the reading path by unclear edges and adjacentcies in the material\n\nThat makes sense, but I wonder if there are also additional factors--factors like too tight leading or long measure, excessively light or dark type, irregular spacing, excessively high contrast between thick and thin, and so on.\n\n"
    },
    {
      "time": "",
      "content": "\\> [http://typophile.com/node/6174](http://web.archive.org/web/20100130191342/http:/typophile.com/node/6174 \"http://typophile.com/node/6174\")\n\nWhat an objective, diligent choice among the 58 hits!  \nAnd what astute comprehension skills! My last post in  \nthat thread is clearly all retraction...\n\n\\> that’s where it rests\n\nYeah, I've been quiet about all this since 2004.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Gentium is also great!\n\n"
    },
    {
      "time": "",
      "content": "Here we have it: David Berlow advertising Adobe Garamond as some kind of appropriate font.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20100130191342/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "",
      "content": "_To my knowledge, this kind of experiment has not been done yet._\n\nClaude Hopkins was working \"in the field\" along those lines in the 'teens and 'twenties:\n\n[_Scientific Advertising_](http://web.archive.org/web/20100130191342/http:/www.amazon.com/Life-Advertising-Scientific-Classics-Library/dp/0844231010/ref=pd_sim_b_4/102-2409949-6472113)\n\nIIRC, he used split runs of direct mail promotions to refine which advertising techniques worked best.  \nThe pieces were text heavy -- he was a copywriter. A great influence on another text-centric ad man, David Ogilvy.  \nIt's been a while since I read the book, and I don't recall whether he tested different type treatments, or just different copy.  \nI do remember that Ogilvy used the split-run technique to test two identical versions of a charity ad, one with positive type and one with reverse, and the positive type raised way more money, not just a percentage, but something like ten times.\n\n"
    },
    {
      "time": "",
      "content": "\" ...two identical versions of a charity ad...\"\n\n\"whats the less eye tiring font?\"\n\nI'm not sure how long winded your charities are up there, but I'd have trouble getting tired from just one.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "the way people experience fatigue from reading is by not bothering to finish something... In a magazine, which as I recall is where Ogilvy placed those ads, there's always something else to move onto - Even if it's the next ad or piece of junk mail.\n\nNobody reads a half page and goes, \"Man, I'm whacked!\" They just turn the page, without even knowing why.\n\nI think it would be next to impossible to pick one face as 'the least tiring'. But you could set some parameters that will tend to indicate if a font could be less tiring than some others. You could start with open shapes, large counters, Large(ish) x-height and tracking that isn't too tight and so on. In other words, almost any well designed typeface intended for imersive reading.\n\nNick, I was just involved in some 'legibility' testing for a signage typeface with a well know Canadian institute for the blind, here in Toronto... (round 2, if Joe is reading. I forced a second round of testing after pointing out some serious flaws in the first round). The trouble with this sort of testing so far as I have seen (with the notable exception of ClearviewHWY) is that nobody doing the testing knows anything about typography (\"X-height is how big the letters are, right? - And kerning is how far apart the are, and serifs are...\" \"UH, yeahwhatever\") and the discount the skill of the designer, and then make ridiculous comparisons of completely dissimilar typefaces the basis of their experiments.\n\nR\n\n"
    },
    {
      "time": "",
      "content": "The ad was for Save The Children, and the black type \"raised twice as much money\", according to _Ogilvy on Advertising_. He wrote that book in 1983, retired in his chateau in France.\n\n\"If you start your body copy with a drop initial, you increase readership by 13%\"  \n\"It is now known that widows (short lines) increase readership\".  \n\"This is 11-point, and about right\"\n\n-more gems from Ogilvy, the result of readership surveys. Note that the term emphasizes the reader (albeit as a marketing demographic), whereas our \"readability\" focuses on the text.\n\n"
    },
    {
      "time": "",
      "content": "I've read the book several times, but not lately.\n\nR\n\n"
    },
    {
      "time": "",
      "content": "\"...the[y] discount the skill of the designer, and then make ridiculous comparisons of completely dissimilar typefaces the basis of their experiments.\"  \nNow now. The designer is unimportant to these readability or legibility issues. The issues are engineering problems, not design problems.\n\n\"...with the notable exception of ClearviewHWY...\"  \nThough the face is a notable exception, the testing is hardly better than what anyone else with an agenda has done.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "That's interesting. I've read the Ogilvy twice -- once in the 90s and once this century -- and I'm still not clear in my own mind what I think of his conclusions.\n\n"
    },
    {
      "time": "",
      "content": "Well, dberlow, - hardly better is still better, isn't it? :)\n\nnow, I'm off to re-read Mr. Ogilvy.\n\n"
    },
    {
      "time": "",
      "content": "In his own time, with his copy-heavy ads, Ogilvy was against the grain of the \"word+image=big idea\" school of advertising which won all the awards and made the history books. But he was very successful and not alone in his method.\n\nNowadays, would anyone dream of putting so much text in an ad? Very rarely, but that's not to say that text-centric marketing has vanished, as there is a whole genre of advertorial newsletters in print and online, and often the editorial in periodicals is thinly disguised advertising. Just look at the massive auto and real estate sections in daily newspapers, hardly objective journalism.\n\n"
    },
    {
      "time": "",
      "content": "Berlow is quite wrong about that, in theory and in practice, but since he’s been around forever the kids are likely to believe him. As are the managers, who cannot differentiate one font from another unless it’s a true apples/oranges comparison (Univers vs. Arial, no; Times [“New”] Roman vs. Comic Sans, yes). We’re trying to get the discussion beyond “Let’s compare our new legibility font and Comic Sans” to “Let’s compare our new legibility font against plausible alternatives.”\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20100130191342/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "",
      "content": "_plausible alternatives_\n\nPlausible? Well, that's the \"agenda\" of which David speaks.\n\nDifferent stakeholders have different notions of what is plausible, different agendas (quite often, hyping their new \"readability\" design).  \nMe, I can't take the science seriously unless the starting point is testing the types that have become the norm -- and yes, that includes Adobe Garamond -- not because of prejudices that engineers, artists, designers, neurologists, typographers, capitalists, whoever, bring to the table about what is \"plausible\", but because those are the fonts that are used most.\n\n1. Test the most used fonts, both sans and serif  \n2. Test them in different settings: vary line length, leading, size  \n3. Test them against different demographic groups\n\nThat should keep someone busy for a while.\n\n"
    },
    {
      "time": "",
      "content": "\"- hardly better is still better, isn’t it? :)\"\n\nI s'pose. But in this case it's just a matter of using fewer words...when MS sets up tests, they use 100's sometimes 1000's of words. ClearView's testing is better — as fewer words are used, less needs to be made up as a result.;) On the other hand, there is nothing wrong with the fonts in the Clearview case, just the spin is a little wobbly.\n\n ![](http://web.archive.org/web/20100130191342im_/http:/typophile.com/files/12font190_5654.1.jpg)\n  \nHighway Gothic was a quirky icon of the \"American Road\", but it had a unit system for an interface and billboard proportions for its letter drawing. Clearview, might be miles of bad kerning. Hap'nin aleady, (in the hands of expert composers?) places like Hellertown and Bethlehem. Even though the old sign's been sprayed with acid for some number of years, the spacing is better for the task(s). \n\nIn short, one must be very careful in accepting agate proportions in type without giving such type proper composition, something that's impossible to spread out over a million uses without a unit system and firm guidance, isn't it?\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "I confess, I've been kind of shocked at the shoddiness of some 'science' I've seen in this area, so Id' have doubts in the results no matter how long the folk in lab coats were busy.\n\nI think that what should be possible is the definition of some basic parameters of what will work well under certain circumstances and what won't. Ultimately, the differences between two or more well designed typefaces used appropriately will be vanishingly small, and probably not worth the effort of testing.\n\nR\n\n"
    },
    {
      "time": "",
      "content": "David wrote:  \n\"But in this case it’s just a matter of using fewer words...when MS sets up tests, they use 100’s sometimes 1000’s of words. ClearView’s testing is better — as fewer words are used\"\n\nThe Clearview testing used fewer words only because of the impracticality of creating dozens of signs. I prefer to counterbalance and use 20 or more words per condition (never thousands) to reduce word effects. The word _table_ will always be recognized faster than the word _yacht_ no matter what conditions I compare. Making similar word lists and showing different word lists to each reader reduces these kind of effects. Fewer words are not better.\n\n"
    },
    {
      "time": "",
      "content": "Russellm wrote:  \n\"I was just involved in some ’legibility’ testing for a signage typeface with a well know Canadian institute for the blind, here in Toronto\"\n\nCould you tell us more about the mistakes they were making in round 1? There is an unfortunate lack of typographic knowledge among psychologists that needs to be corrected, but designing a good study can be difficult even with the help of typographic experts. I would be interested in hearing your thoughts about the best way to design this particular test.\n\nCheers, Kevin\n\n"
    },
    {
      "time": "",
      "content": "\\>Kevin wrote:  \n\"could you tell us more...\"  \nin an email.  \n [russ.mcg@gmail.com](mailto:russ.mcg@gmail.com)\n\nR\n\n"
    },
    {
      "time": "",
      "content": "Kev: \"...Clearview testing used fewer words only because of the impracticality of creating dozens of signs.\"  \nThey had better refine the definition of practical then, hu?\n\n\"Making similar word lists and showing different word lists to each reader reduces these kind of effects. Fewer words are not better.\" Make up your mind.\n\nI've made fonts for _Yachts_ and _Tables_ this month, so I'm aware of the need for design solutions to these problems of readability. It hardly matters. e.g. what one does or tests in this area if the problem is defined by the client as strictly an \"engineering problem\". Fortunately, I don't let clients stick to that broken philosophy for long, or they don't stay clients for long ;)\n\nRus: \" Ultimately, the differences between two or more well designed typefaces used appropriately will be vanishingly small, and probably not worth the effort of testing.\"\n\nI think what you mean to say is: the differences between two typefaces well designed for the same purpose and both used appropriately will be small, and not worth the effort of testing. That is not what we are looking at in Clearview though, where \"used appropriately\" is a huge issue, not so in the case of MS's tests which are laughably short of fonts \"well designed for the same purpose...\"\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "_the differences between two typefaces well designed for the same purpose and both used appropriately will be small, and not worth the effort of testing._\n\nThe fact that testing will not pick up the difference doesn't say much about that difference.  \nTwo performances of the same piece of music with all the notes played correctly, at the same tempo, yet one moves and the other bores. Isn't type like that? Isn't that why we agonize over different versions of Garamond, idolize Helvetica and scorn Arial?  \nWhy do we bother if it amounts to nothing? Is out sophistication so extremely redundant?\n\nYou have to decide what quality of difference you're trying to discern before you can test it.  \nAnd what if that concept only exists in the language of type so far, a pure visuality, not in words or numbers?\n\n"
    },
    {
      "time": "",
      "content": "\\>Nick,\n\nWell, yeah, of course...\n\nBut what if the question is only, \"which performance is louder?\"... That's my point. In the same analogy, two orchestras with the same number of horns, violins and kettle drums have the potential to be equally loud, but one orchestra could be the grade school orchestra I was in once upon a time and the other could be the Toronto Symphony Orchestra. Obviously equal only if you are very selective and not at all rational in how you evaluate them. One could just forget about legibility for a moment and take some time to think about the \"voice\" you want to communicate with. This is a concept that is quite foreign among people I've met who test fonts for legibility.\n\nR\n\n"
    },
    {
      "time": "",
      "content": "David wrote: \"Make up your mind.\"\n\nI'll try to be clearer. In the Clearview study they looked at 6 font conditions on 2 kinds of signage materials for a total of 12 conditions. They created a word list of 6 words and attempted to make the 6 words similar to each other. They created signs for each word they used for each condition - a total of 72 signs. Participants identified the same six words in each condition. I imagine that it's somewhat expensive to create each sign, and therefore impractical to create to use 20 words and 240 signs or 20 different counterbalanced words in each condition for 2880 signs. Since my testing is either of computer type or printed on regular paper, it is not much more expensive to use 20 or more counterbalanced words per condition.\n\nThe advantage of using more words per condition is that it's possible to be more confident in your result when you find that words from one condition consistently perform better than words from another condition no matter what the word used. When cost is not a concern there is an advantage for using more words; it is not advantageous to use fewer words.\n\n"
    },
    {
      "time": "",
      "content": "Wow. Has this developed into an abstract discussion or what? After scanning this thread, it looks like no one recommended a font! (Sorry if I missed any.) The following (for print) are not my suggestions, but at least they name names.\n\nTo B&A's list I would add Stone's Cycles family; I'm using Cycles Eleven and am stunned by its legibility and readability. Also for print, Freight Text is a worthy contender.\n\n==========\n\nFrom Before and After Magazine, “What’s the right typeface for text”, an excerpt from their book _Before and After Graphics for Business._\n\nWhile many typefaces meet the requirements of legibility, readability, and beauty, the following four are the ones we reach for most often:  \n•Adobe Caslon (most readable typeface);  \n•Adobe Garamond (easy to read and elegant, too);  \n•Stone Serif (boring to look at but buttery to read);  \n•Janson Text (middle ground between the earthy, workmanlike nature of Caslon and the high classiness of Garamond.)\n\n"
    },
    {
      "time": "",
      "content": "Steve... this happens all the time on Typophile.\n\n:-)\n\n"
    },
    {
      "time": "",
      "content": "What's the most nutritious food?  \nWhat's the most soothing music?  \nWhat's the most comfortable shoe?  \nWho's the sexiest actress (lab tests for that should be interesting).  \nIs there a pattern here?  \nMight it just be that there are no absolutes, and that people aren't all the same?  \nResults may vary.\n\n\\*\\*\\*\n\nFood. Hmmm.  \nThe stuff people like is bad for them.  \nSo, are the fonts we like bad for us?  \nWhat ARE the \"side effects\" of Comic Sans?  \nAnd more importantly:  \nDo fonts that read like butter cause hardening of the lenses?\n\n"
    },
    {
      "time": "",
      "content": "\\>Do fonts that read like butter cause hardening of the lenses?\n\nWhatever you do, when you turn 45 you get a card in the mail: \"Congratulations, welcome to middle age! As your first gift, you are awarded presbyopia for both eyes, fee of charge. More wonderful surprises to come!\"\n\nOr maybe that's just my memory playing tricks on me :)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100130191342im_/http:/typophile.com/files/readability_5654.png)\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Whoops - I forgot x in my equation. Here's the real graph:\n\n ![](http://web.archive.org/web/20100130191342im_/http:/typophile.com/files/readability_3890.png)\n\nSilly me. Without x, it doesn't even make sense!\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Kevlar: \"it is not advantageous to use fewer words.\" Ever? ;)\n\nRenMan:\"Has this developed into an abstract discussion or what?\"  \nWhat, I think. ;)\n\n\"After scanning this thread, it looks like no one recommended a font!\"  \nAnd it looks like, after your post, no one has yet. With the RFS we were given there is no answer.  \nAll we can assume is that the script in this request is Latin.\n\n\"the following four are the ones we reach for most often\"  \nWe being...?\n\nCheers!\n\n"
    }
  ]
}
