{
  "id": "34362",
  "title": "it's all about Georgia",
  "forum": "Design",
  "tags": [

  ],
  "content": "hi guys,  \nI’m a student of design at Politecnico di Milano.  \nI will make a video aboutGeorgia font, but I don’t have enough info about it.  \nI’m searching the web, but find more info about Carter and poor articles about Georgia, asking to teachers but they told me always the same short infos:\n\n“It’s one of the best serif screen type,designed by Mr. Matthew Carter for MS after long studies and experiments about screen res.”\n\nCan you help me with info and good links?\n\nthanks,\n\nAndrea\n\n [‹ type high logic](http://web.archive.org/web/20070908122618/http:/typophile.com/node/34391 \"Go to previous forum topic\") [guillemets in english texts ›](http://web.archive.org/web/20070908122618/http:/typophile.com/node/33045 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070908122618/http://typophile.com/user/17337\" title=\"View user profile.\">sans.otto</a>",
  "time": "<br>",
  "uid": "17337",
  "comments": [
    {
      "time": " 10.Jun.2007 3.48am",
      "content": "As far as I remember Carters ’Miller’ is very related to Georgia. I don’t know which came first, but I suspect that there is more info on Miller laying around.\n\n"
    },
    {
      "time": " 10.Jun.2007 3.54am",
      "content": "Have you seen this video about the Microsoft Typograhy team? Goes into detail about Cleartype and screen typography.  \n [http://channel9.msdn.com/showpost.aspx?postid=146749](http://web.archive.org/web/20070908122618/http:/channel9.msdn.com/showpost.aspx?postid=146749 \"http://channel9.msdn.com/showpost.aspx?postid=146749\")\n\n"
    },
    {
      "time": " 10.Jun.2007 7.02am",
      "content": "Great topic! Maybe one day you can make it into  \nsomething as famous as the Helvetica movie! :-)\n\nHere’s one thing - an interesting old interview:  \n [http://www.will-harris.com/verdana-georgia.htm](http://web.archive.org/web/20070908122618/http:/www.will-harris.com/verdana-georgia.htm \"http://www.will-harris.com/verdana-georgia.htm\")\n\nIn terms of history, like Claus says it’s related to Miller,  \nand they’re both what’s called “Scotch” type - you might  \nlike to read up on that in chapter 21 of A Lawson’s classic  \n“Anatomy of a Typeface”.\n\nAnd if you have the time/patience to sift through a great deal of  \nwriting you might find some interesting things here on Typophile,  \nbut use Google’s search, like this: “site:typophile.com georgia”\n\nLastly, a big part of Georgia’s essence is of course related to its  \non-screen quality, so you might do some research into bitmap  \nfonts, hinting, etc. not least by searching Typophile, but also  \nvia Microsoft’s superb type section:\n\n[http://www.microsoft.com/typography/default.mspx](http://web.archive.org/web/20070908122618/http:/www.microsoft.com/typography/default.mspx \"http://www.microsoft.com/typography/default.mspx\")\n\nhhp\n\n"
    },
    {
      "time": " 10.Jun.2007 7.22am",
      "content": "wow!  \nthanks so much for your speedy answers!:)  \nClauses thanks for the video! I never see it!  \nHrant, thanks for the links and the tips about search! The interview was my most interesting source:)\n\nIf you have more tips you’re welcomed!\n\nthanks again!\n\np.s.= A friend of mine has told me about a book called “A matter of type” but I’m unable to find it! I think to have the wrong title..anybody knows the right one?\n\nAndrea\n\n"
    },
    {
      "time": " 10.Jun.2007 7.30am",
      "content": "Andrea, I don’t know if you are referring to ’Typographically Speaking: The Art of Matthew Carter’ (Princeton Architectural Press 2003). It is a wonderful book, but has relatively little on Georgia.\n\n"
    },
    {
      "time": " 10.Jun.2007 7.37am",
      "content": "Caro Andrea, un consiglio se mi permetti, specialmente se è la priva volta che scrivi su questo forum, non presentarti con “hi guys” e in minuscolo. Poi controlla gli spazi (mi riferisco a “aboutGeorgia”, “type,designed”, “title..anybody”). Questo è importante anche per i tuoi studi di design.\n\nMicrosoft page, [about Georgia](http://web.archive.org/web/20070908122618/http:/www.microsoft.com/typography/fonts/font.aspx?FID=4&FNAME=Georgia).\n\n"
    },
    {
      "time": " 10.Jun.2007 7.56am",
      "content": "Hi William Berkson, it’s not “The art of Matthew Carter” book, thanks.\n\nAlessandro, sì hai pienamente ragione è la prima volta che scrivo e mi scuso per i refusi, gli errori e per il modo in cui mi sono presentato. Cercherò di fare più attenzione d’ora in avanti. Grazie anche per il link, ma anche la pagina sul Georgia della Microsoft l’avevo già letta.\n\n"
    },
    {
      "time": " 10.Jun.2007 10.39pm",
      "content": "In regard to Georgia/Miller.\n\nI think Georgia was commissioned by Microsoft in TrueType format in the early-1990s. I know Miller (which is somewhat identical, in regard to basic letterforms) was not available then. I think in 1995 or 1996, I had asked Matthew if he had a PS1 Mac/PC convertible roman with a companion Greek (there was nothing available at the time) and he said he had the beta Miller and Wilson Greek but they were not sized to each other and Miller did not have an italic at that point. What I needed was a full roman and italic (with all Latin forms and characters that had been used by the Aldines—including arcane incunabular) and a Greek. Carter bit the bullet and provided the needed typeface/s as Manutius, which was later commercially available as Miller and Wilson Greek (without all the alternate characters). Manutius was decommissioned with the completion of the project in 2000/01. As I recall Carter ran most of it through Font Bureau.\n\nI think Manutius is referenced in Typographically Speaking or some other recent issue devoted to Matthew but I have not otherwise seen mention of it.\n\nWith Matthew’s permission though, I wrote an article on it for Printing History (Journal of the American Printing History Association). Includes some typographic specimen showings of the book project, The Aldine Press.\n\nGerald\n\nThe Bieler Press  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20070908122618/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": " 11.Jun.2007 9.40am",
      "content": "You might want to look into this...\n\n[http://www.microsoft.com/typography/links/news.aspx?NID=5819](http://web.archive.org/web/20070908122618/http:/www.microsoft.com/typography/links/news.aspx?NID=5819 \"http://www.microsoft.com/typography/links/news.aspx?NID=5819\")\n\nSome chaps at a gallery/studio in Seattle, wanted to do some kind of font exhibit during TypeCon and I suggested that Matthew’s Microsoft work might make for a good subject. When I contacted Matthew he noted that there’s very little source material, drawings etc., for these fonts and that there’s a lot of misinformation about them floating around out there. He thought telling the story of these fonts might set the record straight, so a possible approach they’re looking at is interviews with the people involved, along with visuals of the fonts themselves. We’re also keeping John Berry in the loop, re. a possible book or article related to this.\n\n"
    }
  ]
}
