{
  "id": "34374",
  "title": "Adobe Type Motion Graphics",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Maybe this has been around and many have seen it already, but upon venturing to Adobe Type for the first time in a while I was enthralled by the demo videos (“type + motion”) on the main page demonstrating how After Effects works with good typography. Some really terrific work being exhibited in the five parts of the series. Now I’m officially inspired to learn After Effects after much procrastination.\n\n [‹ Are members here available for freelanding?](http://web.archive.org/web/20081102221902/http:/typophile.com/node/44151 \"Go to previous forum topic\") [A little bit of help please? ›](http://web.archive.org/web/20081102221902/http:/typophile.com/node/44129 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081102221902/http://typophile.com/user/11702\" title=\"View user profile.\">auricfuzz</a>",
  "time": "<br>",
  "uid": "11702",
  "comments": [
    {
      "time": " 11.Jun.2007 10.37am",
      "content": "Don’t spend too much time on After Effects if you want to duplicate that type of work. It was created with Flash. (Unless Flash is now one of the output formats that AE supports.)\n\n"
    },
    {
      "time": " 11.Jun.2007 2.14pm",
      "content": "Well, I knew that the whole setup was Flash, but I thought that the 5 individual movies were from After Effects. If they’re not, that’s some shady advertising. But on reflection I think the individual movies are; in each, they show very briefly how to create the effect in After Effects. Even if Flash were completely responsible, my previous statement still stands; I’ve been procrastinating about Flash, too.\n\n"
    },
    {
      "time": " 11.Jun.2007 3.55pm",
      "content": "I’m afraid Don McCahill has turned it around. :) The 5 individual movies were defenitely not created in Flash, but are prime examples of After Effects animation and composition. Also seen in the [Pulp Fiction quoting movie](http://web.archive.org/web/20081102221902/http:/4.upload.dailymotion.com/video/x1a6sk_intonation) and [The Lions Roar](http://web.archive.org/web/20081102221902/http:/www.youtube.com/watch?v=WXxouXt5dz4), amongst others. As far as I can tell both 100% AE as well.\n\nI’m learning After Effects at the moment, and the animated type and 3D-type on Adobe.com are both AE, and it’s not even so difficult to do (though those movies are of quite high level and quality). The 3D-imagery of course is material from other software (e.g. the buildings and such).\n\n"
    },
    {
      "time": " 11.Apr.2008 3.06pm",
      "content": "Hey, this presentation was just nominated for a Webby award! [http://blogs.adobe.com/typblography/2008/04/type\\_motion\\_webby.html](http://web.archive.org/web/20081102221902/http:/blogs.adobe.com/typblography/2008/04/type_motion_webby.html \"http://blogs.adobe.com/typblography/2008/04/type\\_motion\\_webby.html\")\n\n"
    },
    {
      "time": " 11.Apr.2008 6.13pm",
      "content": "Nice one! And justly so. They are very nice animations. :)\n\n"
    }
  ]
}
