{
  "id": "34386",
  "title": "Body Copy : Humanist Slab Serif",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm doing a small 2 page report with a lot of text and I wanted to use a Humanist Slab Serif. I've tried PMN Caecilia and ITC Officina Serif, Caecilia has a rather large x-height and loose tracking, where Officina has a smaller x-height and rather condensed feel. Is there a similar font that would fall somewhere in between these two?\n\nAny suggestions will do.\n\n",
  "author": "AndrewSipe",
  "time": "11 Jun 2007 — 10:33am",
  "uid": "6496",
  "comments": [
    {
      "time": "11 Jun 2007 — 10:45am",
      "content": "TheSerif? It's still got a large x-height. Slightly more condensed than Caecilia but not nearly as much as Officina.\n\n[](http://web.archive.org/) [http://www.identifont.com/find?font=theserif&q=Go](http://web.archive.org/web/20131013124110/http:/www.identifont.com/find?font=theserif&q=Go \"http://www.identifont.com/find?font=theserif&q=Go\")\n\n"
    },
    {
      "time": "11 Jun 2007 — 10:48am",
      "content": "The Serif might be too \"slab-serify\" but [The Mix](http://web.archive.org/web/20131013124110/http:/www.identifont.com/find?font=theMix&q=Go) looks better.\n\n"
    },
    {
      "time": "11 Jun 2007 — 10:50am",
      "content": "Then consider a wedge serif instead: it would give you the honest  \ncharm of the slab style without the brutishness. Plus it would be  \nslightly more readable.\n\nhhp\n\n"
    },
    {
      "time": "11 Jun 2007 — 10:53am",
      "content": "Any recommendations for a wedge serif?\n\n"
    },
    {
      "time": "11 Jun 2007 — 10:55am",
      "content": "I love TheMix. I've used it for bodycopy a lot and have always been pleased with the way it sets. (Some people don't like the Q.)\n\n"
    },
    {
      "time": "11 Jun 2007 — 10:57am",
      "content": "Back to slabs:\n\nSoho: New, more mechanical, available in lots of weights and several widths  \nChaparral: more organic, more readable, size and weight options, good contrast for reading  \nAmasis: somewhat organic, like Caecilia but softer, more contrast, some bracketing\n\n"
    },
    {
      "time": "11 Jun 2007 — 11:15am",
      "content": "(Heh, the trap worked like a charm! :-)  \nTMF Patria, Foundry Form, FF Page, Linotype Aptifer, FF Olsen ...\n\nBTW, terminology refinement: you want the sheared wedge style,  \nnot the pointy wedge one (AKA \"Latin\"), which looks too self-assured.\n\nhhp\n\n"
    },
    {
      "time": "11 Jun 2007 — 11:39am",
      "content": "I don't know Hrant, these seem pretty stiff. I do like FF Page Serif though it (as weird as this will sound) might be too elegant. If this document wasn't just a working data report and was geared as marketing, I'd definitely be buying Page Serif. I'm putting that one on my wish list though.\n\nI think I'm going to go with The Serif. I do appreciate all the suggestions. The collective brain trust definitely had some good ones.\n\nI'll even make a suggestion: [Placebo Serif](http://web.archive.org/web/20131013124110/http:/www.myfonts.com/fonts/presencetypo/placebo-serif/)\n\n"
    },
    {
      "time": "11 Jun 2007 — 11:45am",
      "content": "Page is by Albert Boton, and old-schooler,  \nso \"elegant\" is not a suprising observation!  \nIts x-height is quite large though, so you  \nwouldn't want to set it too large.\n\nPlacebo I hadn't seen - interesting!\n\nOh, and I just remembered Silica - very cool.\n\nhhp\n\n"
    },
    {
      "time": "11 Jun 2007 — 11:57am",
      "content": "Yeah, I stumbled past Placebo looking for similar slab serifs on Myfonts. It has a very charming quality too it. I don't know if that's a good thing, it might not be the body copy workhorse I'd need.\n\nAccording to Myfonts, Silica doesn't have any italics.\n\n"
    },
    {
      "time": "11 Jun 2007 — 12:02pm",
      "content": "\\> Silica doesn’t have any italics.\n\nNow you know a big reason for my liking it. :-)  \nIt does have a fine gradation of weights, which I actually think  \nis much more conducive to sensical emphasis in most types of text.\n\nhhp\n\n"
    },
    {
      "time": "11 Jun 2007 — 12:04pm",
      "content": "Just and observation, it's not much of an issue regarding these reports, no italics are used.\n\n"
    },
    {
      "time": "11 Jun 2007 — 12:34pm",
      "content": "Although you seem to have decided, I had to chime in with a wedge serif: [Kandal](http://web.archive.org/web/20131013124110/http:/www.myfonts.com/fonts/marksimonson/kandal).\n\n"
    },
    {
      "time": "11 Jun 2007 — 6:40pm",
      "content": "Kandal is sort of in the gray area between slab and wedge (which Chaparral is in too). \"Sheared Wedge\" suggests another list:\n\nSwift  \nOranda  \nCharter  \nFairplex  \nRePublic\n\nOnce you abandon conventional classification schemes, there are a lot of directions you could take this.\n\n"
    },
    {
      "time": "17 Jun 2007 — 6:50pm",
      "content": "Good ideas from Carl. Also [FF Avance](http://web.archive.org/web/20131013124110/http:/typophile.com/wiki/FF%20Avance).\n\n"
    },
    {
      "time": "22 Nov 2010 — 5:30am",
      "content": "In terms of tracking for Caecilia, what about just tightening it up in the layout software? I'm doing that in a test document and it looks OK (better than the default), but maybe I'm missing something?\n\n"
    }
  ]
}
