{
  "id": "34389",
  "title": "Setting up sizes and guides",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I am having problems with sizes when I am pasting into fontlab. I know there is a certain size you should set up your illustrator file, something to do with the em square? I couldn't find it in the wiki. Would that be in points? Death to inches.\n\nAlso, I was wondering what common ways of setting up guides were. Some people draw straight into fontlab, but I have a shit-ton of guides set up in my illustrator file, with layers and such. It doesn't seem to be very efficient, or accurate.\n\nThanks for your input and secret guide techniques.\n\nTerrance  \n [www.typeterrance.com](http://web.archive.org/web/20131013095903/http:/www.typeterrance.com/ \"www.typeterrance.com\")\n\n",
  "author": "weinziet",
  "time": "11 Jun 2007 — 11:51am",
  "uid": "7770",
  "comments": [
    {
      "time": "11 Jun 2007 — 12:21pm",
      "content": "Essentially, 1 point in Illustrator = 1 em unit in FontLab.\n\nNote: This is assuming that you leave \"Fit EPS files to (Ascender - Descender) height\" unchecked in the FontLab preferences.\n\n"
    },
    {
      "time": "11 Jun 2007 — 12:56pm",
      "content": "In FontLab, draw a line from the cap line to the zero point on the baseline. Paste it into Illustrator and it will give you the size you need for the caps. Seems like it's about 9.7 inches.\n\n"
    },
    {
      "time": "11 Jun 2007 — 1:34pm",
      "content": "Thanks guys. That will help.\n\nI'm working on small caps and alternate characters, so I have to look into OpenType stuff too.\n\nI was using fontographer last year, and it just wasn't working. It wouldn't publish my kerning pairs. Do you guys use fontographer too? I've heard of people starting there and importing it into fontlab.\n\nMark: Kinescope looks great. It reminds me of the Ray Ban lettering. I sent you some photos of Coquette on Target packaging a while back. I have to admit, I'm a fan. Matter of fact, I used to live in Minnesota. You wouldn't happen to need an intern? j/k\n\n"
    },
    {
      "time": "11 Jun 2007 — 2:16pm",
      "content": "I don't use Fontographer anymore, except when I need to open old .fog files.\n\n(Thanks also for sending the Coquette sighting and everything. For now, I don't really have any need for an intern, much less have room for one. :-)\n\n"
    },
    {
      "time": "15 Jun 2007 — 3:48pm",
      "content": "How large do you make your Illustrator drawings? As it is easier to adjust points when they are large. Currently, I am working with letters maybe an inch tall, which is probably WAY too small.\n\n"
    },
    {
      "time": "15 Jun 2007 — 11:31pm",
      "content": "I went back through my original working files for several of the fonts I've done. Each one started at a different size, from less than an inch to several inches high. I don't remember any of them giving me trouble as far as drawing accurately. Unless you use the arrow keys to nudge points alot, I can't see where it would matter in the drawing.\n\nOn the other hand, 700 UPM in FontLab = 700 points in Illustrator, or 9.722 inches. If you know your caps are going to be 700 UPM in FontLab, you could begin at that size in Illustrator. Then the glyphs paste perfectly into FontLab with no resizing required.\n\n"
    },
    {
      "time": "16 Jun 2007 — 8:16pm",
      "content": "Yeah, I did run into problems with the arrow keys, but I adjusted the preferences to a smaller increment, and that helped.\n\nI have been messing around with sizes, and I concluded on 700 points too.\n\nThank you for continuing to reply.  \nYou can check out a slab serif face I'm doing now @ [http://typophile.com/node/34427](http://web.archive.org/web/20131013095903/http:/typophile.com/node/34427 \"http://typophile.com/node/34427\")\n\n"
    }
  ]
}
