{
  "id": "34391",
  "title": "type high logic",
  "forum": "Design",
  "tags": [

  ],
  "content": "Does anyone know the reason when / why [type high](http://web.archive.org/web/20081204103510/http:/typophile.com/wiki/type_high) became .918 inches?  \nI’ve heard explanations that range from it being a totally arbitrary number (which I find hard to believe) to having it correspond to the length of someone’s thumb.  \nIs there a definitive answer to this that anyone knows of?\n\n [‹ San serif/serif fonts- how do you use them together effectively?](http://web.archive.org/web/20081204103510/http:/www.typophile.com/node/34364 \"Go to previous forum topic\") [it's all about Georgia ›](http://web.archive.org/web/20081204103510/http:/www.typophile.com/node/34362 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081204103510/http://www.typophile.com/user/15263\" title=\"View user profile.\">Nick Sherman</a>",
  "time": "<br>",
  "uid": "15263",
  "comments": [
    {
      "time": " 11.Jun.2007 1.57pm",
      "content": "The exact measurement was a metrical one, i.e. based on the meter, namely one fifteenth (i.e. 1/15) of 35 centimeters, so that the height of paper or height to paper or type height was exactly .9186 inches (instead of .918 inches). For details see Victor Strauss, The Printing Industry, Bowker 1967, page 60 and page 753.\n\n(The US typographical point size measurement was also a metrical one, namely eighty-three picas were set as equal to 35 centimeters, i.e. 83 x 12 = 996 points.)\n\n"
    },
    {
      "time": " 11.Jun.2007 2.03pm",
      "content": "I thought Type High was the buzz one gets from playing with lead type and mineral spirits.\n\n"
    },
    {
      "time": " 11.Jun.2007 2.49pm",
      "content": "[http://www.typecon.com/tc2004/index.html](http://web.archive.org/web/20081204103510/http:/www.typecon.com/tc2004/index.html \"http://www.typecon.com/tc2004/index.html\")\n\nI was there, but alcohol seemed to be the only intoxicant available.\n\n"
    },
    {
      "time": " 11.Jun.2007 4.31pm",
      "content": "Thanks, Uli. I’ll check the Strauss book you noted. In the mean time, do you know _when_ the switchover to .918” came about and what spurred it? Was it a sweeping conversion from old to new that many foundries agreed upon at once? Maybe something similar to the formation of ATF happened which forced a large group of foundries to standardize?\n\n"
    },
    {
      "time": " 11.Jun.2007 4.40pm",
      "content": "I think I may have found my answer [here](http://web.archive.org/web/20081204103510/http:/www.sizes.com/tools/type.htm#height):\n\n<cite>Until 1886, in North America the height of the type or plates, from the surface of the platen to the face of the type, was 11⁄12 inch = 0.9166…. In that year the U. S. Type Founders Assn. adopted a new type height when it adopted the point system. Having decided that the pica would be defined by 83 pica = 35 centimeters, it decided to let 15 type heights = 35 centimeters. So type height became 23.333… millimeters, approximately 0.918 inches. Although only 0.002 inches higher than the old standard, this difference is great enough that old and new type could not be mixed in the same line.</cite>\n\nDoes that sound about right, or are there other aspects that I’m missing still?\n\n"
    },
    {
      "time": " 11.Jun.2007 11.35pm",
      "content": "\\> Thanks, Uli. I’ll check the Strauss book you noted. In the mean time, do you know when the switchover to .918” came about and what spurred it?\n\nIf you have access to a large library and if you need a scholarly source for the when and why, you may wish to consult Philip Gaskell, A New Introduction to Bibliography, Oxford 1972, pages 283-284 (chapter “Type since 1875”).\n\n(The term “bibliography” does not have its usual meaning here. Instead it here has the special meaning of describing the criminalistic-like methods of identifying how a given old book was technically typeset and printed.)\n\n"
    },
    {
      "time": " 12.Jun.2007 1.07am",
      "content": "Thanks! I’ll keep the Gaskell book in mind for the next time I’m at the library.  \nAll the information is much appreciated!\n\n"
    }
  ]
}
