{
  "id": "34404",
  "title": "Internationalization",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "This is inspired by previous threads like [proper placement of exclamdown and questiondown](http://web.archive.org/web/20131016094334/http:/typophile.com/node/34363), especially Eben's recent remark, and [guillemets in English text](http://web.archive.org/web/20131016094334/http:/typophile.com/node/33045).\n\nOn the one hand there are recommendations for proper shapes of glyphs or accents <cite>rooted in language specific typography</cite>. On the other hand growing glyph sets of OpenType fonts and <cite>international use of fonts</cite> suggest that one better find shapes which please everybody, or at least, an imaginary majority.  \nIt is not that much of a contradiction as my words suggest -- one can still add alternate forms. Yet I think that these will only address specific languages (so fonts are just as suited for <cite>particular</cite> languages as the individual type designer's knowledge goes) and add complexity to fonts.  \n(My own current position is that one should go for internationalization of forms and give up certain national peculiarities.)\n\nI would like to hear your opinions on ...\n\n-- proper positioning of acute and grave: rather steep and start at the horizontal visual center on the base glyph? rather flat and lying on the base glyph?  \n-- vertical alignment of accents: vertically centered? their x-minimums aligned?  \n-- proper shape of the uppercase Aring: (traditional) connected form? unconnected since Uring joined the glyph set so that it makes sense to treat them similarly (rather than connecting one but not the other)?  \n-- ogoneks and cedillas: connected? unconnected?\n\n... and others!\n\n",
  "author": "k.l.",
  "time": "12 Jun 2007 — 6:28am",
  "uid": "8664",
  "comments": [
    {
      "time": "12 Jun 2007 — 12:32pm",
      "content": "I think you can do it many ways Karsten, but not in the same typeface.\n\nFor instance, a small x-height face may have steeper accents.\n\nAlso, the ogonek is nice extended to descender depth, but not in faces with long descenders, or heavy sans serifs -- it becomes too big.\n\nThen you have to decide how to relate the vertical position of the dot on the \"i\" with the dieresis.\n\nIf I see any principle, it's the old design one that if things are close to concurring, they should, otherwise they should obviously not. With a little \"cheating\" allowed.\n\nSo my principle is that the accents should look good for the typeface, not for a particular language.\n\nIt's up to the specific language users (typographers, editors, clients, readers) to decide whether the face is smooth or awkward in a specific setting.\n\n"
    },
    {
      "time": "12 Jun 2007 — 7:23pm",
      "content": "\\> if things are close to concurring, they should,  \n\\> otherwise they should obviously not.\n\nThis is a good rule for display design, but for text it's too Modernist.\n\nhhp\n\n"
    },
    {
      "time": "12 Jun 2007 — 9:19pm",
      "content": "_This is a good rule for display design, but for text it’s too Modernist._\n\nI think you have to do things the modern way if the face is modern, rather than old style. But you have a good point.\n\nAt the moment, my \"dasia and varia\" polytonic characters have the dasia the same size as when it's the only diacritic (centre, below). This is the common practice today.\n\n ![](http://web.archive.org/web/20131016094334im_/http:/typophile.com/files/dasia_5554.jpg)\n\nTop: Plain typeface (Monotype, early 20th century). The \"curly\" mark is a different size in all combinations.  \nCentre: My modern, with first two dasia \"curly\" marks the same height.  \nBottom: My modern, with the dasia in \"dasia and varia\" the same size as the psili in \"psili with perispomeni\".\n\nBut I'm now thinking that the bottom option is better. What do you think?\n\n"
    },
    {
      "time": "12 Jun 2007 — 9:50pm",
      "content": "\\> I think you have to do things the modern way if the face is modern\n\nAgreed. But I wouldn't use a Modern for text. :-)\n\n\\> What do you think?\n\nNot enough.  \nIt would mostly be a guess - I'd need to  \nlearn more about polytonic Greek first.\n\nhhp\n\n"
    }
  ]
}
