{
  "id": "3440",
  "title": "Celtic Knot based font",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "![](http://web.archive.org/web/20131024003749im_/http:/www.typophile.com/forums/messages/29/27853.jpg)   \nThis font is based off of the continuity and connectedness of Celtic knotwork. This is a rough draft, still in the works. I would like to recieve some feedback. I am trying to think up a name. Maybe interlacing? Any ideas?\n\n",
  "author": "lschickert",
  "time": "4 Mar 2004 — 2:50pm",
  "uid": "2984",
  "comments": [
    {
      "time": "4 Mar 2004 — 10:10pm",
      "content": "Here is a larger image. Thanks for the interest! ![](http://web.archive.org/web/20131024003749im_/http:/www.typophile.com/forums/messages/29/27946.jpg)\n\n"
    },
    {
      "time": "4 Mar 2004 — 10:13pm",
      "content": "Woops - when I was moving the letters around the decendor on the Q moved and is now on the L - sorry about that\n\n"
    },
    {
      "time": "5 Mar 2004 — 6:17pm",
      "content": "I really like this idea. It looks promising.   \n   \nHere is my crit- The base of your font's shape & our clue as to the identioty of a glyph is alluded to with the curves & then knot or celticness goes over that often ending in very modern square edges.( why monospaced?, why modern shapes as a base?) This technique adds a consistancy & tension to the font which is fun - but in some characters not enough consideration is given to the form to be evoked & the glyph gets bogged down by an extreme regularity. The K is like that. VW & X are not. The zero,Q and the '&' are like that. The H is not. Q is a great glyph to venture beyond basic rules. Really it's the charcters where you venture from your base idea & do something beyond it which work best to me.   \n   \nOne other idea - what about making the thread vary in width here & there to give emphasis? I have seen celtic art that used that to great effect.\n\n"
    },
    {
      "time": "5 Mar 2004 — 6:56pm",
      "content": "\\> This technique adds a consistancy & tension to the font which is fun   \n   \nLike Newlyn's Missionary. Did you guys know it's based on OCR-A? Amazing.   \n   \nBTW, I just remembered this, from the RIDT'98 conference:   \n [http://diwww.epfl.ch/w3lsp/conferences/ridt98/browne/](http://web.archive.org/web/20131024003749/http:/diwww.epfl.ch/w3lsp/conferences/ridt98/browne/)   \n [http://members.optusnet.com.au/cameronb/fonts-1.htm](http://web.archive.org/web/20131024003749/http:/members.optusnet.com.au/cameronb/fonts-1.htm)   \nAnd it's all automatic!   \n   \nhhp\n\n"
    },
    {
      "time": "17 Mar 2004 — 8:47pm",
      "content": "I created the monospaced letters because when I was creating it and putting the letters into sentences, I enjoyed the interweavings that were created not only in the letters, but also within the words. See the example below.   \n   \nI tried to keep the knotwork relatively true to traditional forms, specifically in the sharp edged corners where it applied to. This is also why the cord width in the letters is regular. I also wanted to create the letters forms out of the cord instead of using the cord to fill in the letter forms, although I do like the effect that it gives to letters when it is used.   \n   \nI am looking for new ways to try to do the &, with the letter having the over and under pattern to begin with, it is hard to work the over and under pattern of the celtic knotwork into the &. I am also looking into creating different forms for some of the other letters that are not as successful as others.   \n   \nThank you for the input, and keep it coming!   \n ![](http://web.archive.org/web/20131024003749im_/http:/www.typophile.com/forums/messages/29/28821.jpg)\n\n"
    },
    {
      "time": "18 Mar 2004 — 6:24am",
      "content": "Looks like a great opportunity for some decorate dropcaps and crazy ligatures! I'd like to see more complex and tightly-woven forms.\n\n"
    },
    {
      "time": "19 Mar 2004 — 10:21am",
      "content": "This is a very interesting concept, Lisa!   \n   \nOne thing I have trouble with is differentiating \"B\" and \"8\"... And also, I think that perhaps the crossbars in those two characters would benefit from intertwining on both ends instead of just one...   \n   \nI have a similar issue with the zero figure: perhaps the diagonal bar should be one long cord rather than two short ones that almost touch in the middle..., or, as an alternative, keep the two cords, but have them tightly intertwined, like in your \"H\" character's crossbar.   \n   \nLooking forward to seeing more of this,   \nRicardo\n\n"
    },
    {
      "time": "4 Mar 2004 — 3:23pm",
      "content": "I'd really love to see this larger before I make any suggestions.\n\n"
    }
  ]
}
