{
  "id": "34401",
  "title": "type taboo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What are your feelings on stretching type?  \n(realising I may be shot for saying it)  \nI've always been told by graphic design puritans, that it's a no-no, and tried to follow these rules in my own work. I see a lot of stretching, embossing, drop shadows various 'filter effects' in my neck of the woods, which makes me cringe, or am I being too harsh?\n\n",
  "author": "baker st",
  "time": "12 Jun 2007 — 2:11am",
  "uid": "19075",
  "comments": [
    {
      "time": "12 Jun 2007 — 2:40am",
      "content": "Big no-no!!!  \nI have seen my share of similar aggrevations over the year & I think the problem is that graphic design is probably the field where most amateurs work. Eg. my ex-boss ussed to do a lot of stretching as well, but I think that lied in his more technical oldschool handset \"cut & pasterie\" printing background. These people were taken by surprise by the digital era of graphic design & propably thrilled to be able to easily stretch of font to fit some space. The other problem is that too many people out there consider themselves lucky & make their own logo in Word using WordArt... I've actually seen logo's made in Exell, go figure.  \nFor people who grew up in the digital era it's probably a lot easier to take (dis\\*)advantage of the technology. For certain projects I was even professionally obliged to use as manyy filters, embosses, shadows & all that crap as possible, because the client wanted it to look \"classy\". People don't appreciate simplicity anymore. Too much choice leads to more bad decisions. That's the burden of consequence.  \nYou might want to read this thread: [http://typophile.com/node/32874](http://web.archive.org/web/20131018083311/http:/typophile.com/node/32874 \"http://typophile.com/node/32874\")\n\n\\* depending on who's doing what\n\n"
    },
    {
      "time": "12 Jun 2007 — 3:45am",
      "content": "Big go ahead (if you know what you are doing!)  \nSome faces can take the stretching and compressing better than others, see for instance here: [http://www.gerardunger.com/allmytypedesigns/allmytypedesigns20.html](http://web.archive.org/web/20131018083311/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns20.html \"http://www.gerardunger.com/allmytypedesigns/allmytypedesigns20.html\")  \nTo do stretching the face must be:\n\n—Sans serif  \n—Have a dynamic stroke  \n—Have a low contrast\n\n"
    },
    {
      "time": "12 Jun 2007 — 4:59am",
      "content": "Interesting to see the opposing responses. I have to say though, I'm deffinitley more inclined to lean towards the classic treatment of type. Not to say I'm incapable of pushing the boat out for a fresh modern solution; it's simply the fear of, if we have full digital control over typographic manipulation, where should we draw the line?  \n If a font has to be stretched in order to fit, was it the right choice in the first place? During my time in college, a visiting lecturer looked over my shoulder as I was stretching type vertically on screen to fit a poster; he's still alive, but I remember most of the blood leaving his face at the time. He deffinitley knew his stuff, so from that point on, I was more careful in my treatment.  \nTo Clauses, I don't profess to be a master typographer or anything so it's good to see your point of view\n\n"
    },
    {
      "time": "12 Jun 2007 — 5:25am",
      "content": "If you look in Bringhurst, _The Elements of Typographic Style_, you can read in the section on the methods of justification: \"In this book, for example, the justification engine has been permitted to [...] adjust the width of individual characters by [plus or minus] 2%.\" That is stretching.\n\n"
    },
    {
      "time": "12 Jun 2007 — 5:27am",
      "content": "Oh, and do you think it's a good/bad idea to a refer a client to a design archive site like AIGA; with the intention of demonstrating to them how the likes of visual hierarchy and appreciation for proper layout can lead to superior, award winning design?\n\n"
    },
    {
      "time": "12 Jun 2007 — 5:35am",
      "content": "Michel, that's new to me. So a very subtle stretching of the type is acceptable when justifing text? What is this method usually intended for?\n\n"
    },
    {
      "time": "12 Jun 2007 — 5:46am",
      "content": "<cite>I think the problem is that graphic design is probably the field where most amateurs work.</cite> - Hear Hear\n\nWorking in a small office, I see type butchered on a regular basis. It's difficult to watch and not say anything, but I don't have control over all the reports/presentations. My services are available, but I'm not always available. So, a lot of the amateurs designers are taking things into their own hands and doing what NEEDS to be done. Their tools are primitive and their knowledge about what's right and wrong is limited. They stretch and smush and cram and drag as needed. It's not because they think that's aesthetically pleasing, it's because that's what they need to do when using the software available.\n\nHave you ever tried to typeset in Word, it's not easy. You need to have an intimate knowledge of the program, knowing where all the little inputs to manipulate line spacing, letter spacing, tracking, kerning and even tabulation. It's not suited for the novice user and if you don't know what to look for, you're not going to look for it. So manipulating text to \"fit\" happens quite often here and I suspect in a lot of other arenas as well.\n\nMy beliefs are, as a true breed designer, you should never have to manipulate type beyond it's capabilities. You should know and understand if you do, and it should be a choice not a necessity to break these rules. We have superior tools that give us the ability to make this choice daily and as cliche as this sounds, with great power comes greater responsibility. David Carson didn't do what he did because he had too, he did it because he wanted to and he stood behind his choices.\n\nIn the meantime, if you need to stretch type, hold down that Shift key and stretch away.\n\n_sorry for the wall of text_\n\n"
    },
    {
      "time": "12 Jun 2007 — 5:49am",
      "content": "(@baker st) I am not competent to answer. The question of justification methods is \"low level\" (this is the word we use in computer science, where I belong). Design is \"high level\". What happens is that people that work at the \"high level\" don't realize that the tools they use sometimes do (at the \"low level\") things they are told not to do.\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:05am",
      "content": "<cite>What is this method usually intended for? [baker st]</cite>\n\nIt is used to avoid large interword blanks when the text is right adjusted. It is also possible to vary intercharacter spacing up to a fixed percentage chosen by the user.\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:15am",
      "content": "_I see a lot of stretching, embossing, drop shadows various ‘filter effects’ in my neck of the woods..._\n\nIt's one thing to stretch, i.e., expand or compress type, and another thing to emboss, use a drop shadow, or apply filters...\n\nThe main problem with expanding or compressing type in a page layout program is that it can distort \"the proportion of the letters, forcing heavy elements to become thin, and thin elements to become thick.\" (Ellen Lupton _dixit_, in _Thinking with Type_.) This is why it is always better to use an expanded, condensed or compressed version of a typeface, if it is available, because the type designer will redraw the shapes to keep proportions looking the way they should. (I remember one of my design professors grimacing at the idea that phototypesetting allowed you to compress a face like Garamond).\n\nAdding a drop shadow, on the other hand, does not deform a lettershape, and in some situations a drop shadow can be useful.\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:19am",
      "content": "_Have you ever tried to typeset in Word, it’s not easy._\n\nHear, hear, Asvetic! We could trade horror stories about that over drinks sometime. :-)\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:27am",
      "content": "my own experience leads me this way: learn the fundamentals first.\n\nfor instance, i do not allow my first and second semester students to distort type in any way. no stretching, no filters, etc. i make them study the hand drawings of designers such as goudy to really learn to appreciate the care and consideration that went into the formation of the relationships in a typeface. this always causes groans and complaints of \"stifling creativity.\" but i tell them, \"tough.\"\n\nin the third semester or higher, i open the doors, but i call them on type distortion every time i see it, and make them justify why they chose that direction. more often than not, when they try to explain the reasoning, they come to their own conclusion that the distortion was unnecessary and go back to revise the work. \"if you want your type to be wide like that, why didn't you choose an extended face? in a face _designed_ to be extended, the relationships of stroke, balance, etc. have been thoughtfully considered and factored into the face, whereas you throw all those relationships out the window by taking Impact and stretching in to 158%...\"\n\nin other words, until a designer understands the basics of typography, i don't believe they should mess with the cosmos. it just can't really be done intelligently without the understanding.\n\na good example would be picasso's work: his early drawing a painting was realistic, well proportioned and figurative. it wasn't until he understood the fundamentals of form, proportion, etc. that he was able to _intelligently_ abstract them.\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:35am",
      "content": "_If you look in Gringhurst,_\n\nMichael, is he any relation to Bringhurst, who wrote a book of the same title? Just curious....\n\n_a good example would be picasso’s work: his early drawing a painting was realistic, well proportioned and figurative. it wasn’t until he understood the fundamentals of form, proportion, etc. that he was able to intelligently abstract them._\n\nI think you are absolutely on the right track, Chuck: until you absorb the structures in whatever design medium you practice (from painting to writing), you rarely have a basis from which to depart from them.\n\nThat being said, I've seen exceptions -- it's always the exceptions that prove a rule, right? -- from people who haven't been beaten into creative submission with \"you can't do that\" from their alleged superiors.\n\nUnfortunately, many of today's students think they are the exceptions, when, in fact, they aren't.... :-(\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:40am",
      "content": "<cite>Hear, hear, Asvetic! We could trade horror stories about that over drinks sometime. :-)</cite>\n\nIt's enough to make a man drink, that's for damned sure!\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:42am",
      "content": "I have had lots of clients who have used Word as their page layout program -- it's one reason why they are ex-clients.... :-(\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:42am",
      "content": "i couldn't agree more. it's hard to imagine a novice saying, \"forget the lessons! i wanna parachute NOW!\" and it's exactly (or should be) the same with design students. unfortunately, DTP has put very powerful tools into the hands of people too soon in many cases.\n\ni have seen some beautiful examples of _thoughtful_ type distortion (see the Tate Gallery logo), but these almost invariably were executed by designers who learned their chops first.\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:45am",
      "content": "_If you look in Gringhurst._ &nbsp; Sorry, I misspelled; it is Bringhurst and I cannot edit to correct.\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:52am",
      "content": "I actually have to tell my fellow students stretching type is a no-no, and why. Unfortunately, I have to do that, because no-one else does. (Well, maybe one or two teachers do, but the rest...)\n\n"
    },
    {
      "time": "12 Jun 2007 — 7:38am",
      "content": "Really, the question (to me) is why distort an existing font by stretching or squooshing instead of choosing a font that is already compressed or extended? There is no shortage of good fonts to choose from in those categories.\n\n"
    },
    {
      "time": "12 Jun 2007 — 7:46am",
      "content": "Stretch away, as long as it looks good. Some rules of thumb: 1. Don't stretch too much. 2. On screen type can take a lot more stretching than off (low-rez + hinting makes it work.) 3. Extended types often feel more extended with a little stretch. 4. Some types stretch better than others. 5. 1-2% difference is totally acceptable. Use the InDesign paragraph composer, dial the word spacing way down, turn on the smallest amount of stretch (99-101%) and a little letter spacing (\\*gasp\\* variable letter spacing?). 6. Try not to look like you are designing a mortgage company flyer in Word. 7. Figure out how to draw an extended or condensed font to see how it's really done, and find out where stretching starts to break down. 8. Laugh at designers who get high and mighty about some rule that someone told them that they have never explored.\n\n"
    },
    {
      "time": "12 Jun 2007 — 8:04am",
      "content": "I'd like to see some examples of manipulated type that's been stretched and done well. Could anyone show a worthwhile example of what's been discussed?\n\n"
    },
    {
      "time": "12 Jun 2007 — 9:00am",
      "content": "OK, I've had a lot to catch up on here & have quite a few remarks to make, but I'll try to keep it to the minimum...\n\n\\> In this book, for example, the justification engine has been permitted to […] adjust the width of individual characters by [plus or minus] 2%.” That is stretching\n\nI've always been taught that it's exceptable to adjust your kerning between the parameters of -3/3 to get your font to fit. This is not stretching. Well, actually I haven't been taught since I've only taken a technical course to learn to work with the programs (on a selfstudying basis) & there was never any discussion over design rules. But this is what I've learned from my colleagues & books.\n\nMy answer to a font that doesn't fit some space is indeed like many people here suggested looking for a different font that does fit. There's enough variety in fonts & most commonly used fonts have an extended family of different size, thickness,...\n\n\\> Have you ever tried to typeset in Word, it’s not easy\n\nThat's exactly the problem. Too many people choose the wrong programs for their projects. Word is not the proper program for aesthetic executions. Unfortunately, this is a program that is widely used in àll offices & therefor takes the form of the Trojan horse when companies send their own \"designs\" to a graphic company. The same thing is happening with Photoshop BTW, too many inexperienced people have gotten their hands on it & (ab)using for homemade designs & logo's.\n\n\\> I have had lots of clients who have used Word as their page layout program — it’s one reason why they are ex-clients\n\nToo bad my boss is completely clueless when it comes to anything graphic. She bought her way into the company as a moneylusty opportunist & actually runs the entire office now. After over 10 years in this business however, she still doesn't even know how to change a colour in Illustrator.\n\n\\> Hear, hear, Asvetic! We could trade horror stories about that over drinks sometime. :-)\n\nHow about this for a horror story... My ex-boss -who had been in the printing business for over 30 years- actually once stretched a Helvetica Black Condensed to 200%... The horror!  \nAnd that's not all... We used to make a lot of schoolpapers & similar stuff in black & white with one supporting Pantone colour (we standardly used 072 regardless of in what colour it would be printed, but obviously paying attention to that when using percentages (when it would be printed in yellow eg., you can't really use 10% of the supporting colour)) & when he made a new logo for the company (we used to have a full colour one, a B/W one & one in B/W with 072 & used the one needed depending on how it was going to be printed), he accidently converted the 072 to CMYK which led to parts of the logo vanishing in print. It took them over six months to find out (we usually worked for other companies & rarely saw the printed versions). You can imagine the bittersweet hilarity amongst me & my colleagues when we heard this.\n\nI think that pretty much covers it (for now).\n\n"
    },
    {
      "time": "12 Jun 2007 — 9:26am",
      "content": "To me there's only one good use for stretching type:  \ngiving contrast to a monoline sans by squeezing it.  \nTry it with Futura!\\* But some shapes (like the \"s\")  \ndo end up needing plastic surgery.\n\n\\* [http://typophile.com/node/870](http://web.archive.org/web/20131018083311/http:/typophile.com/node/870 \"http://typophile.com/node/870\")\n\nhhp\n\n"
    },
    {
      "time": "12 Jun 2007 — 9:33am",
      "content": "BTW, Unger is known for making fonts that survive mechanical compression  \nas well as possible. I actually do that too a little bit - but not as expertly.\n\nhhp\n\n"
    },
    {
      "time": "12 Jun 2007 — 9:36am",
      "content": "\"Do what thou wilt shall be the whole of the law.\"  \nAleister Crowley (after the Greek philosopher \"Do what thou wilt.\")\n\n"
    },
    {
      "time": "12 Jun 2007 — 10:07am",
      "content": "Stretching type might be a very useful way to add contrast and proportion to a very low-contrast and badly proportioned typeface you are working on. That is exactly what happened to me when working in Obliqua: [http://www.typophile.com/node/12608](http://web.archive.org/web/20131018083311/http:/www.typophile.com/node/12608 \"http://www.typophile.com/node/12608\")\n\n"
    },
    {
      "time": "13 Jun 2007 — 11:18am",
      "content": "[http://www.lehni-trueb.ch/Schauspielhaus+Z%FCrich+-+Brochures+03+-+04/#](http://web.archive.org/web/20131018083311/http:/www.lehni-trueb.ch/Schauspielhaus+Z%FCrich+-+Brochures+03+-+04/# \"http://www.lehni-trueb.ch/Schauspielhaus+Z%FCrich+-+Brochures+03+-+04/#\")\n\nSeverely compressed Futura Extra-Bold. I think it looks great!\n\n"
    },
    {
      "time": "13 Jun 2007 — 5:08pm",
      "content": "\"Stifling creativity\". Ha Ha! So that's what they call typing 180% into the scale window, creativity? Gee, don't ask those kids to use a pencil or there will be a riot on cell block 8.\n\nOne simple rule you can follow if your eyes aren't a useful guide: Any typeface with a very clear vertical stress will withstand non-proportional scaling better than typefaces with diagonal stress. Garamond, Goudy, Minion, etc. are more delicately drawn, and even their curves look messed up when squished (they go kind of diamond-shaped). The best circumstance is if the design has some contrast, on a vertical axis, and the shapes are sort of squarish or mechanical. Given that, there aren't many typefaces that will withstand the distortion. Type is usually designed with pretty careful spacing between letters as well as within them. If I adapt a typeface to make a condensed version, generally each letter will get a different amount of compression, because of the internal proportions. In addition the space between letters is adjusted.\n\nThe general user of type is unaware of how delicate the balance of a well-made typeface is. It isn't something you can hammer on in Illustrator a bunch until it looks \"pretty good\". Most professional-grade typefaces are drawn (and spaced and kerned) so carefully that nobody thinks about it. But as anyone who has tried either customizing type, drawing a logo from scratch, or starting their first typeface has discovered, there's a lot more holding type together than it might seem.\n\nOne other way to look at non-proportional scaling: Just because you can, doesn't mean you should. Same with using guns.\n\n"
    },
    {
      "time": "13 Jun 2007 — 5:43pm",
      "content": "\\> anyone who has tried either customizing type, drawing a logo  \n\\> from scratch, or starting their first typeface has discovered,  \n\\> there’s a lot more holding type together than it might seem.\n\nYou're such an optimist! :-)\n\nhhp\n\n"
    },
    {
      "time": "14 Jun 2007 — 4:32pm",
      "content": "Make that \"should have discovered\".\n\n"
    },
    {
      "time": "15 Jun 2007 — 1:05am",
      "content": "Christian, I'm laughing about your #8 above. That \"puritanism\" happens when people follow a rule (and it's a good rule!) without really knowing why they're doing it.\n\n"
    },
    {
      "time": "15 Jun 2007 — 11:45am",
      "content": "This one is a very good interactive demonstration of the issues:  \n [http://www.artlebedev.com/mandership/134/](http://web.archive.org/web/20131018083311/http:/www.artlebedev.com/mandership/134/ \"http://www.artlebedev.com/mandership/134/\")\n\nHow much can you stretch Mona Lisa until it becomes apparent?\n\nEven better, art.lebedev suggest \"that designers (and customers) take their own photo and distort it along with the font. When the distortions become visible on the face, it’s time you stop disfiguring the font.\"\n\n"
    },
    {
      "time": "15 Jun 2007 — 11:54am",
      "content": "Tim, I've read that fashion photos are regularly squooshed by 5%.  \nAnd even though those ladies start out much thinner than Mona! :-)  \nBut we still think the photos are human. Humans are funny.\n\nhhp\n\n"
    },
    {
      "time": "22 Jun 2007 — 11:48am",
      "content": "[NEVER MIND - I tried to \"insert image\", but I guess that function isn't working either.]\n\n"
    },
    {
      "time": "26 Jun 2007 — 1:58pm",
      "content": "Okay, now it's letting me.\n\nI found this gem in a window:\n\n ![](http://web.archive.org/web/20131018083311im_/http:/typophile.com/files/PleaseNotNotsmall_5870.jpg)\n\nPlease Not Not Stretch\n\n"
    },
    {
      "time": "26 Jun 2007 — 2:35pm",
      "content": "You gotta love the \"not not\" though ;-) Somehow the scribbled through first \"not\" makes the stretching more acceptable... in a devil-may-care kind of way.\n\n"
    },
    {
      "time": "26 Jun 2007 — 2:42pm",
      "content": "One of the times when I stretch is when I wish to make pseudo small capitals. The pros do it about 5% and sometimes it takes  \n10%. The stretching makes the vertical strokes heavier in order to match the regular capital letter that is next to it.  \nFor example: 24 point caps with a 20 point caps. The weights are obviously different, but when you stretch the 20 point the weights tend to even out.\n\n"
    },
    {
      "time": "26 Jun 2007 — 4:07pm",
      "content": "sure. it's a wonderful tool. i don't feel bad going 2% in either direction for copyfitting, etc. or 5% for effect.  \nmy point, though, is that before a student of design really knows what they're doing, they can torture a poor typeface without even knowing why they're doing it or why they might be better off thinking again.\n\n"
    }
  ]
}
