{
  "id": "34400",
  "title": "Saint - \"St\" or \"St.\" ?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nWhat is the correct abbreviation of the English (UK) word \"saint\"? Different on-line dictionaries seem to give different results:\n\n[http://dictionary.reference.com/browse/saint](http://web.archive.org/web/20150312203904/http:/dictionary.reference.com/browse/saint \"http://dictionary.reference.com/browse/saint\")\n\n[http://dictionary.cambridge.org/define.asp?key=69492&dict=CALD](http://web.archive.org/web/20150312203904/http:/dictionary.cambridge.org/define.asp?key=69492&dict=CALD \"http://dictionary.cambridge.org/define.asp?key=69492&dict=CALD\")\n\nIsn't \"St\" for \"Saint\" and \"St.\" for \"Street\"?\n\nThanks for your help.  \nAleksander\n\n",
  "author": "fallenartist",
  "time": "12 Jun 2007 — 2:02am",
  "uid": "14482",
  "comments": [
    {
      "time": "12 Jun 2007 — 3:25am",
      "content": "The way it is (or should be): abbreviations that end with the last letter of the original word don't receive a stop (eg Saint \\> St or Doctor \\> Dr); ones that don't, do (eg Street \\>St. or etcetera \\> etc.).\n\n"
    },
    {
      "time": "12 Jun 2007 — 4:33am",
      "content": "<cite>The way it is (or should be)...</cite>\n\nThat is what Bringhurst, _The Elements of Typographic Style_, says and he refers to the Oxford house style. However, when I look at the ( [online](http://web.archive.org/web/20150312203904/http:/dictionary.oed.com/entrance.dtl)) Oxford dictionary, what I can see is that they themselves write \"St.\" with a period.\n\n"
    },
    {
      "time": "12 Jun 2007 — 5:19am",
      "content": "The description that Bert gives is how I've always heard it -- for UK English. Here in the States, we tend to always use periods. (If it's an abbreviation, it's an abbreviation; and therefore it gets a period, regardless of the letters.)\n\nHowever, there is an inconsistency in Bert's example: 'Saint' and 'Street' both end in the letter 't'. So you can use that UK rule to argue that both should be abbreviated without a stop.\n\n-- K.\n\n"
    },
    {
      "time": "12 Jun 2007 — 6:43am",
      "content": "the best place to look for this would be in  \nThe Chicago Manual of Style. Chapter 15. I've got one at home but I'm not there now.\n\nIf you have the book it contains invaluable information and usually has a note if the example is US English or English.\n\nrequires a subscription $25....  \n [http://www.chicagomanualofstyle.org/ch15/ch15\\_toc.html](http://web.archive.org/web/20150312203904/http:/www.chicagomanualofstyle.org/ch15/ch15_toc.html \"http://www.chicagomanualofstyle.org/ch15/ch15\\_toc.html\")\n\n"
    },
    {
      "time": "12 Jun 2007 — 7:18am",
      "content": "<cite>However, there is an inconsistency in Bert’s example: ‘Saint’ and ‘Street’ both end in the letter ‘t’.</cite>\n\nSorry about that, I had the dutch situation in mind, where 'straat' is street and it's abbrev'd to \"str.\". And I kinda remember seeing Str. used in the UK, so why not in the US?\n\n"
    },
    {
      "time": "12 Jun 2007 — 7:25am",
      "content": "I've also seen it used informally in Canada and the U.S., but that doesn't make it \"right\"....\n\nThere's also the situation where some uses of \"Saint\" vs \"St.\" (note the period) are specified: in Canada, for example, the capital of Newfoundland and Labrador is St. John's, whereas the city in New Brunswick is Saint John.\n\nAnd who can forget that on one side of the border, it's Sault Saint Marie, while on the other, it's Sault Ste. Marie....\n\n"
    },
    {
      "time": "12 Jun 2007 — 9:57am",
      "content": "Here is what I find in the [Oxford Refence Online Premium](http://web.archive.org/web/20150312203904/http:/www.oxfordreference.com/):\n\n<cite>Saint   when preceding a name, is spelt with a capital initial letter, and is shortened to St (no full stop in BrE though one is normal in AmE). The plural is SS or Sts , as in SS / Sts Peter and Paul .<br>\n(From Pocket Fowler's Modern English Usage in English Language Reference)<br>\n</cite>\n\n"
    },
    {
      "time": "13 Jun 2007 — 12:56am",
      "content": "Chicago Manual of Style 14th edition (current is 15th) say's:\n\n**14.16 Names with Saint**  \nSaint is often abbreviated (St. , pl. SS. ) before the name of a Christian saint, but many prefer to spell the word out in text, abbreviating only where space is at a premium.\n\netc.\n\n**14.22 Addresses** may be abbreviated in such closely set matter as lists or tables, especially state names and the words mentioned above as spelled out in text:  \n Ave., Blvd., Bldg., Ct., Dr., La., or Ln., Pkwy., Pl., Rd., Sq., St., Terr., N., S., E., W. (before street name).\n\n"
    },
    {
      "time": "13 Jun 2007 — 3:10am",
      "content": "Chicago 15th says much the same (i.e. advocates spell out or put 'St.') at §§ 15.27-28, 15.32 and 15.35, which confirms this as usual US style.\n\n(Oxford) Hart's Rules §6.1.6 says \"In English 'saint' is abbreviated as _St_ (_St._ for 'street' is conventionally distinguished by having a full point).\" Their \"Oxford Dictionary for Writers and Editors\" supports this.\n\nEvidence is stacking up for the \"dot in America, not in Britain\" concept. Working in UK academic journals publishing, I usually advocate the \"dot if the abbreviation doesn't end with the full word's last letter\" style mentioned above (and work on the assumption that the \"t\" in the abbreviation of \"Street\" is the first one and not the last one!)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "13 Jun 2007 — 3:56am",
      "content": "To quote the Chicago manual about how something is to be done in the UK isn't a very good idea. In case you didn't know it, hyphenation is different in the UK than in the states, too. As are dashes. As is the use of quote marks. etc. When you're in the UK, put the Chicago manual in the boot.\n\nBTW, the Typophile site doesn't follow Chicago with respect to ellipses . . .\n\n"
    },
    {
      "time": "15 Jun 2007 — 2:27am",
      "content": "Thank you all  \n\\_\\_\\_\\_\\_\\_\\_  \n AL  \n [lenart.pl](http://web.archive.org/web/20150312203904/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "15 Jun 2007 — 3:33am",
      "content": "Isn't this complicated by the fact that St. as an abbreviation of Street is pronounced Street, whereas St. as an abbreviation of Saint is often prounced Snt - i.e. it has become a different word.\n\nI'm in London and thinking \"St Johns\" vs \"All Saints\".\n\n"
    },
    {
      "time": "15 Jun 2007 — 10:43am",
      "content": "For some reason I recall seeing STREET abbreviated as STR ...\n\n"
    },
    {
      "time": "2 Apr 2014 — 3:05pm",
      "content": "There is no inconsistency in Bert's example: The t in St (for Saint) is at the end of the full word, therefore no full stop; the t in Street is the first (not the last) t, therefore the full stop appears in order to show that there are letters missing in its place.\n\nSaint: St  \nStreet: St.\n\nOne might say, \"well, then, saint should be S.t, to be consistent, showing that there are letters missing between the s and the t\", but I would argue that it's obvious that it's an abbreviation, and since it has no final period, the missing letters must be in-between.\n\nBesides, can't all you typographers see the difference between the two ts in Street?\n\n"
    }
  ]
}
