{
  "id": "34415",
  "title": "id request, sans serif sample from the 30's - similar to Gill Sans Schoolbook {Yves}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "hello\n\nanyone able to id this type? i've spotted this on several finnish architectural publications from around 1930-1950. (used in two different weights, haven't seen any italics.) i'd be surprised if it was of finnish origin. in that case there would be some secret typographic history i haven't been informed about.\n\n| Attachment | Size |\n| --- | --- |\n| [sans-sample.jpg](http://web.archive.org/web/20130820001526/http:/typophile.com/files/sans-sample.jpg) | 134.07 KB |\n\n",
  "author": "juhani",
  "time": "12 Jun 2007 — 1:35pm",
  "uid": "19089",
  "comments": [
    {
      "time": "12 Jun 2007 — 1:38pm",
      "content": "Isn't this [Gill Sans Schoolbook](http://web.archive.org/web/20130820001526/http:/www.fontshop.com/fonts/downloads/monotype/gill_sans_schoolbook/)?\n\n"
    },
    {
      "time": "12 Jun 2007 — 1:43pm",
      "content": "It also looks like Vista Sans, if memory serves. And Fiendstar as well.\n\n"
    },
    {
      "time": "12 Jun 2007 — 1:46pm",
      "content": "Except that Vista Sans was designed three years ago, not over half a century ago. ;^)\n\n"
    },
    {
      "time": "12 Jun 2007 — 1:48pm",
      "content": "Picky, picky. ;-)\n\n"
    },
    {
      "time": "12 Jun 2007 — 1:49pm",
      "content": "I said it \"looks like\" not \"it is.\" Man, tough crowd. ;-)\n\n"
    },
    {
      "time": "12 Jun 2007 — 1:50pm",
      "content": "Exactly. Both my thoughts are wrong. But check out that \"y.\" I don't recall Gill Sans Schoolbook having that straight descender.\n\n"
    },
    {
      "time": "12 Jun 2007 — 2:20pm",
      "content": "It could be Gill Sans Schoolbook with the 'y' from Gill Sans.\n\n- Lex\n\n"
    },
    {
      "time": "12 Jun 2007 — 2:25pm",
      "content": "_Man, tough crowd. ;-)_\n\nYeah, us type geeks, we even bite the heads off chickens too, just like Ozzy.\n\n;-)\n\n"
    },
    {
      "time": "12 Jun 2007 — 2:38pm",
      "content": "You have to realise this is a very competitive board, but I can assure you it is all in good humour. :^)\n\nI hope you didn't misread my remark as arrogance, Michael. ;^)\n\n"
    },
    {
      "time": "12 Jun 2007 — 4:58pm",
      "content": "thanks for all the answers.\n\ngill sans schoolbook looks very much like it to me. only differences seem to be the \"l\" which is a straight line, the \"4\" (doesn't show in the sample) which is closed and the \"y\" as mentioned, all pointing to the regular gill sans.\n\nthe \"M\" has slanted vertical lines and the center touches the baseline, which doesn't happen in any gill sans version i managed to find.\n\nlinotype's gill sans infant looks pretty much identical to the gill sans schoolbook...? both versions appear to have a thicker stroke than in this printed sample.\n\nis there a digital version of gill sans with a light cut with alternates for \"a\" and \"g\" as in schoolbook/infant? :)\n\nvista sans looks too condensed. fiendstar is pretty nice, the light version has the weight right. don't like the \"y\" though.\n\n"
    },
    {
      "time": "12 Jun 2007 — 7:00pm",
      "content": "Yves ... arrogance? No way!! I meant my retort in good humour too. No worries. ;-}\n\nI love this stuff. Trying to ID fonts continues to be a fantastic education for me. I greatly respect your knowledge, as well as those of numerous other members here. I'm not in the same league, but it sure is interesting and rewarding to try.\n\nCheers!\n\n"
    },
    {
      "time": "10 Dec 2009 — 8:59am",
      "content": "juhani...did you ever find out what this is? I would like to know too\n\n"
    }
  ]
}
