{
  "id": "34426",
  "title": "Looking for Professional Opinions",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "5ive by 5ive Design is a company that I recently created. I plan to cater primarily to military affiliated organizations and universities. Five by Five is military jargon (WW II) meaning “loud and clear”. My goal with the attached wordmark (logo) was to create something that is firm in tradition (balance and symmetry) but comes across as contemporary and modern.\n\nI am looking to get some professional feedback on this wordmark and any input or suggestions that anyone may have. Thank you for submitting any comments.\n\n| Attachment | Size |\n| --- | --- |\n| [Five by Five.jpg](http://web.archive.org/web/20071112201123/http:/typophile.com/files/Five%20by%20Five.jpg) | 42.06 KB |\n\n [‹ Rock & Roll logo](http://web.archive.org/web/20071112201123/http:/www.typophile.com/node/34463 \"Go to previous forum topic\") [Fun logo crit ›](http://web.archive.org/web/20071112201123/http:/www.typophile.com/node/34305 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071112201123/http://www.typophile.com/user/19096\" title=\"View user profile.\">Tkhines</a>",
  "time": "<br>",
  "uid": "19096",
  "comments": [
    {
      "time": " 12.Jun.2007 8.29pm",
      "content": "I feel most people will read, “SIVE BY SIVE.” Plus, this solution is not unique. We’ve all seen it before: 3hree, SE7EN, etc. Using numerals in place of the first letter of the word doesn’t necessarily say anything about your design company. At least nothing which I can discern.\n\nI also see your choice of typeface as somewhat tech-inspired. I don’t quite get “firm in tradition,” especially since the mark is less than perfectly readable. The weight of the face seems a bit weak to be considered firm in tradition.\n\nThis is only one opinion and I’m trying only to be helpful so please consider my remarks as food for thought. Somebody else may come along and say you’re spot-on.\n\n"
    },
    {
      "time": " 12.Jun.2007 11.51pm",
      "content": "I agree it reads “SIVE BY SIVE”... And font choice makes it look more like a design company for digital media. If the “design” would be green I would say: “ok this is air traffic control company.”\n\nJust an idea: why not play with type. If “five by five” is “loud and clear”, then make type say that. Emphasize LOUD and polish/sharpen the CLEAR. You can add design underneath or sideways as it’s now (great solution for different brands to change “design” to brand names, but you’re not having products to use that), because it’s just an addition to the primary jargon saying.\n\n"
    },
    {
      "time": " 13.Jun.2007 3.45am",
      "content": "Well it’s hardly ’loud’ or ’clear’. And it doesn’t really appear ’firm in tradition’ of any kind.\n\nThe vertical line has no connection to the matrix that forms the letters.\n\nMaybe add a corpse. The military like those :-/\n\n"
    },
    {
      "time": " 13.Jun.2007 6.24am",
      "content": "Hey Terrance,\n\nIf anything, the font choice reminds me of stitches on a cotton material, not very design or military in my opinion. Also, why don’t you explore the use of the numbers a little more? The 7-eleven logo and 24seven spring to mind. A mix of numerals and text...\n\n ![](http://web.archive.org/web/20071112201123im_/http:/www.typophile.com/files/Paletten_3793.jpg)\n\nGood luck and looking forward to any other ideas you come up with.\n\n"
    },
    {
      "time": " 13.Jun.2007 7.37am",
      "content": "What about a logotype that read...\n\n[5X5]\n\n...with or without the square brackets and possibly in a stencil font. The stencil font route may be too predictable though.\n\nThen back it up with the company name in full and set in a clear and simple font where necessary.\n\n"
    },
    {
      "time": " 13.Jun.2007 8.30am",
      "content": "What about a 5 by 5 Katyousha battery?  \nOooops, wrong army.\n\nhhp\n\n"
    },
    {
      "time": " 13.Jun.2007 8.31am",
      "content": "Thank You all for the feedback. I appreciate your advice and guidance. I’ll go back to the “drawing board”, and post my revisions.\n\n"
    },
    {
      "time": " 13.Jun.2007 8.31am",
      "content": "Thank You all for the feedback. I appreciate your advice and guidance. I’ll go back to the “drawing board”, and post my revisions.\n\n"
    },
    {
      "time": " 14.Jun.2007 6.43pm",
      "content": "cool. looking forward to it.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20071112201123/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
