{
  "id": "34430",
  "title": "Need RGB of Pant UNCOATED colour",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As colour on coated and uncoated paper appears different, so should be the RGB value to reflect this.\n\nCould someone in North America please do me a favour? I need the recommended RGB colour value for Pant 369 U and Pant 485 U. Could someone please look this up in the ColourBridge Uncoated?\n\nWe would have bought the Colour bridge uncoated, but there is NO EUROPEAN VERSION. For some reason only a coated version of ColorBridge exists in Europe. Who knows why, but there is really little point for is buying the North American version.\n\nMany thanks.\n\n",
  "author": "spirelli",
  "time": "13 Jun 2007 — 2:01am",
  "uid": "8202",
  "comments": [
    {
      "time": "13 Jun 2007 — 6:28am",
      "content": "Photoshop should translate it for you just fine. Find the Pantone uncoated color in the Color Picker, and translate it into your RGB or CMYK values. It's usually very close to if not exactly the same as the Color Bridge.\n\nTry it. You'll likely find that 369 is 94/160/69 and 485 is 228/91/80.\n\n"
    },
    {
      "time": "13 Jun 2007 — 6:59am",
      "content": "I've done so in Photoshop CS, and get:  \n369 U - 68/141/52  \n485 U - 216/65/62\n\nI'm a bit worried about these, as especially the red looks rather muted.\n\nThe values you've suggested are even paler (printed it looks like quite a solid colour).\n\nWhere do your values come from?\n\n"
    },
    {
      "time": "13 Jun 2007 — 7:22am",
      "content": "Interesting -- I used InDesignCS to do this, and got\n\n369U - 123/177/58  \n485U - 192/36/39\n\n"
    },
    {
      "time": "13 Jun 2007 — 7:44am",
      "content": "In Photoshop CS3 I get same as BradB. using Pantone Uncoated.\n\n"
    },
    {
      "time": "13 Jun 2007 — 7:53am",
      "content": "Because of all that mess I also wanted to find out what's written on the Pantone ColourBridge...\n\n"
    },
    {
      "time": "13 Jun 2007 — 7:54am",
      "content": "This is something I've never understood about RGB values for PMS colours.\n\nIn Photoshop's Color Settings I have the RGB Working Space set on Adobe RGB (1998) which it says is best for print work. On this setting it renders the colours with these values...\n\n369U - 112/156/079  \n485U - 196/083/080\n\nBut if I change the RGB Working Space to sRGB IEC61966-2.1, which Photoshop says is best for screen work, it gives these values...\n\n369U - 087/157/072  \n485U - 224/082/079\n\nI think I'm failing to understand something fundamental and probably important :-/\n\n"
    },
    {
      "time": "13 Jun 2007 — 7:59am",
      "content": "Well, certainly there's a big difference in printing if one goes with spot colours or just straight CMYK to \"create\" them, so I guess we all shouldn't be surprised if there is between spots and RGB.....\n\n"
    },
    {
      "time": "13 Jun 2007 — 8:29am",
      "content": "Linda, I accept that there will (almost) always be a difference between spots and RGB, often perhaps a big one -- one just cna't take a screen as a guide.\n\nBut I expect that a company like Pantone have done relative extensive research as to what RGB values to use so that that printing a colour on uncoated paper is, on average, adequately represented on most screens compared to representations of coated. That's why I wondered what their recommendations on RGB values are.\n\n"
    },
    {
      "time": "13 Jun 2007 — 8:30am",
      "content": "Colours printed on paper, and colours shown on monitors are created fundamentally differently (saturation vs spectrum). Never trust that the two representations are compatible.\n\n"
    },
    {
      "time": "13 Jun 2007 — 8:32am",
      "content": "I think Iv'e just realiesd how stupid I am. I'll get my coat.\n\nBut I still don't understand why my 2 sets of RGB values are completely different to everyone elses. Hmmm.\n\n"
    },
    {
      "time": "13 Jun 2007 — 9:01am",
      "content": "_That’s why I wondered what their recommendations on RGB values are._\n\nI sat in on a panel discussion about Pantone vs CMYK vs RGB many years ago when I was in Washington, DC, where someone asked the best way to \"convert\" spots to RGB and was basically told \"you're wasting your time. If you're designing something that will be seen on screen, your best bet is to go with hex definitions.\"\n\n"
    },
    {
      "time": "13 Jun 2007 — 10:39am",
      "content": "I agree with Linda. I would also note that Pantone color conversions tend to be more visually accurate (for print) in Illustrator and InDesign (which for me have always been identical). Photoshop almost always gives CMYK values different than both of those programs. Because of that, RGB values should also be off.\n\nI particularly have trouble converting blues from CMYK to RGB...which makes sense, given the different way print and screen see these colors. So your green might end up being off. Just go hex. Pick the closest match.\n\n"
    },
    {
      "time": "13 Jun 2007 — 10:46am",
      "content": "Hex? I can't find that colour model in Photoshop's Color Picker.\n\n(Terry, I didn't recognize you at first with that new sombre icon)\n\n"
    },
    {
      "time": "13 Jun 2007 — 11:14am",
      "content": "On the exceptionally rare occasions that I need to match things up, I use the page of hex colours on the inside back cover of a (pretty old and dogeared!) copy of Liz Castro's HTML for the World Wide Web. Close enough for government measure. ;-)\n\nBy that guide, I'd use #77B312 for the 369U and #C5121B for the 485U....\n\n"
    },
    {
      "time": "13 Jun 2007 — 11:22am",
      "content": "Hex isn't a color model, merely a way to write the RGB values using hexadecimal numbers.\n\nThere's really no point in trying to find some set-in-stone numerical conversion of Pantone to RGB for on-screen media. Just hold your swatch up to the monitor and take a best guess at it. Nearly all monitors are going to be different from each other, so you're really just aiming for a ballpark approximation anyways.\n\n"
    },
    {
      "time": "13 Jun 2007 — 11:35am",
      "content": "Since you are looking for RGB values of Pantone colours to print on uncoated stock, this will vary from machine to machine, for the best result specify a Pantone and let the printers sort out the best breakdown and get a proof.\n\nTim\n\n"
    },
    {
      "time": "13 Jun 2007 — 12:48pm",
      "content": "Doh! Of course, the big hexidecimal number at the bottom of PS's Color Picker. OK, just another way of defining an RGB value.\n\nThanks for the clarification everyone. Now, at least, I don't feel so alone in my PMS/RGB uncertainty.\n\nI just wish I could get clients to appreciate the vagaries when proofing spot colour jobs.\n\nIt doesn't help having typical male colour blindness. It would make life easier to be able to trust the software to work out the numbers.\n\n"
    },
    {
      "time": "13 Jun 2007 — 3:53pm",
      "content": "_(Terry, I didn’t recognize you at first with that new sombre icon)_\n\nJust redid my identity. I toned it down...well, a little. :)\n\n"
    },
    {
      "time": "16 Jun 2007 — 6:22am",
      "content": "There used to be a nifty little service to convert PMS-\\>RGB available at [http://www.warpgear.com/pantone/](http://web.archive.org/web/20150106225935/http:/www.warpgear.com/pantone/ \"http://www.warpgear.com/pantone/\") - unfortunately the Pantone legal eagles swooped on down and swallowed it up.\n\nWhilst I understand the reasoning behind it - surely they could have at least offered a solution of their own (or potentially purchased and rebadged the tool).\n\n"
    }
  ]
}
