{
  "id": "3444",
  "title": "Handscrift",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "this type is based on old manuscript writing and my own handwriting with pen and ink   \n   \n   \n   \n ![](http://web.archive.org/web/20131020194904im_/http:/www.typophile.com/forums/messages/29/27870.jpg)\n\n",
  "author": "austing",
  "time": "4 Mar 2004 — 2:58pm",
  "uid": "1693",
  "comments": [
    {
      "time": "4 Mar 2004 — 4:39pm",
      "content": "mostly reference a book called 'belles letteres\", a book full of reproductions of old french masters' manucripts   \n   \nthanks for the interest,\n\n"
    },
    {
      "time": "23 Mar 2004 — 3:28pm",
      "content": "![](http://web.archive.org/web/20131020194904im_/http:/www.typophile.com/forums/messages/29/27936.jpg)\n\n"
    },
    {
      "time": "23 Mar 2004 — 2:04pm",
      "content": "DUDE, tell everyone about your idea behind the typeface, it's probably the coolest idea i've heard in a long time.   \n   \n-Mitch of the laptop posse\n\n"
    },
    {
      "time": "23 Mar 2004 — 3:28pm",
      "content": "![set type](http://web.archive.org/web/20131020194904im_/http:/www.typophile.com/forums/messages/29/29127.jpg)   \n   \nso this is some of the type \"set\". i'm having trouble getting the kerning pairs i set in fontographer to work in illustrator or quark. they seem to reset themselves somewhat. does anyone know why this happens? any help would be most appreciated.   \n   \nthe main idea as far as promotional material will go is as follows. the type is in a ficticious journal that was found and was written by mary shelley's frankenstein while he was exiled in the mountains. each promotional piece (posters, mailings, web banners,etc.) will contain some of the writings from the journal but will not disclose who the person writing it is until the internet movie i create comes out and in it we finally discover the true identity of the author. any thoughts on this concept?   \nthanks,   \naustin\n\n"
    },
    {
      "time": "23 Mar 2004 — 4:01pm",
      "content": "I would scale down the t. A lot. It hits like a hammer every time it appears in the text, and destroys any illusion of real handwriting.\n\n"
    },
    {
      "time": "25 Mar 2004 — 7:08pm",
      "content": "The baseline is way to 'rigid' for something that is suppose to resemble hand writing.\n\n"
    },
    {
      "time": "4 Mar 2004 — 4:02pm",
      "content": "Austin, which manuscripts did you reference?\n\n"
    }
  ]
}
