{
  "id": "34452",
  "title": "Vegas \"Boneyard\"",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I just read about this in the LA Times:  \n [http://neonmuseum.org/boneyard.html](http://web.archive.org/web/20090918234822/http:/neonmuseum.org/boneyard.html \"http://neonmuseum.org/boneyard.html\") \\_  \nThe article actually mentions “people interested in typefaces”.\n\nhhp\n\n",
  "author": "<a href=\"/web/20090918234822/http://typophile.com/user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": " 13.Jun.2007 6.15pm",
      "content": "Looks great - there’s also a small neon museum in downtown LA - they have a few interesting pieces.\n\nOn Cahuenga there was a prop warehouse for the movies that had a ton of neon signs on one large wall - I walked by it one night and it was open and all the signs were lit up - I suppose someone was there to pick out some props.\n\nHeavenly.\n\n"
    },
    {
      "time": " 14.Jun.2007 4.26pm",
      "content": "I have been dying to see this for years. You can actually find it on Google Earth or Google Maps, where a gigantic skull sign, laid flat, stares up into space (and into the LandSat cameras) for your amazement. I need some other pretext to visit Vegas, however, I hate smoking and gambling and I like good food.\n\n"
    },
    {
      "time": " 14.Jun.2007 4.59pm",
      "content": "Cool - how do I find it on Google maps?\n\nBTW, Vegas does have good food now.  \nBut the good stuff ain’t cheap like them steak & shrimp deals.\n\nAlso, one day I’ll show you something about roulette that might  \nmake it highly enjoyable for you. But perhaps equally costly...\n\nhhp\n\n"
    },
    {
      "time": " 14.Jun.2007 6.13pm",
      "content": "The food is excellent now, the people watching unsurpassed and gambling is like becoming a Stepford Wife. I recently stopped in Henderson for the night and wished I would have known about the “boneyard”. I gambled and was winning but it can only hold my attention for about 30 minutes - I just don’t get it.\n\nDiscarded neon signs are right up my alley.\n\n"
    },
    {
      "time": " 14.Jun.2007 6.55pm",
      "content": "The last time I was in Vegas I spent 30 minutes just <cite>observing</cite> a roulette table...\n\nhhp\n\n"
    },
    {
      "time": " 14.Jun.2007 7.44pm",
      "content": "Small things amuse small minds....\n\n"
    },
    {
      "time": " 14.Jun.2007 7.56pm",
      "content": "Actually the level of quick, lucid evaluation and self-discipline required to beat roulette (because, unlike most any other form of gambling, it can be beat) is quite humbling. I’ve tried a few times, and always exhausted myself mentally (although one time the <cite>instant</cite> I quit my “magic number” came up!) It’s really quite refreshing in a strange way.\n\nThe thing is though self-discipline is not enough: you also need a good deal of money that you’re not too attached to - something I’ve never managed. But the romance of possibly beating a machine is worth a little bit of waste. However things like the lotto, slots, etc. are definitely not for me. That “Deal or No Deal” show makes me nauseous.\n\nhhp\n\n"
    },
    {
      "time": " 15.Jun.2007 10.45am",
      "content": "“how do I find it on Google maps?”\n\nGet the street address of the Boneyard.\n\nGlad to hear you can eat something decent in Vegas. Maybe I was thinking of Reno, which I quite realize is not the same thing.\n\nI’m waiting for a trade show of interest. So far TypeCon has not seen fit to meet in Vegas....\n\n"
    },
    {
      "time": " 11.Mar.2008 3.32pm",
      "content": "here are my photos from the tour today:\n\n[http://www.flickr.com/photos/pauldhunt/sets/72157604100507517/](http://web.archive.org/web/20090918234822/http:/www.flickr.com/photos/pauldhunt/sets/72157604100507517/ \"http://www.flickr.com/photos/pauldhunt/sets/72157604100507517/\")\n\n"
    },
    {
      "time": " 11.Mar.2008 3.46pm",
      "content": "Paul:\n\nI’ve heard about this a few times, but always forget to check it out when I visit. Is it run like a museum or is it more literally a dump? How’d you arrange to take the tour? Great shots, btw.\n\n"
    },
    {
      "time": " 11.Mar.2008 4.03pm",
      "content": "the website is:  \n [http://www.neonmuseum.org/](http://web.archive.org/web/20090918234822/http:/www.neonmuseum.org/ \"http://www.neonmuseum.org/\")\n\nthe museum is a work in progress. they’re actually quite ambitious with what they are trying to do in rescuing some of the old lighted signs that once lived on the vegas strip. Most of the stuff is just piled around and it’s hard to get good shots of some of the stuff, so you hafta be creative. i think it’s well worth a visit, but you have to try to schedule in advance as tour slots are extremely limited and fill up fast. you can schedule online or call, but you may need to follow up if you don’t hear back from them, as i almost didn’t get to go (again) because they didn’t call back after we registered online.\n\n"
    },
    {
      "time": " 11.Mar.2008 4.19pm",
      "content": "Oh thank you Paul for sharing your photos. So many people post shots of signs and neon on flickr and are apparently much more art-inclined, because they crop them to bits and skew the angles and all kinds of showy photo stuff that blows their value as documents of the letterforms. FInally a type nerd visits the boneyard! And there you are next to that giant pirate skull! Kudos. You even got some of the letterforms House used in their Vegas font set. I have to go now.\n\n"
    },
    {
      "time": " 11.Mar.2008 4.46pm",
      "content": "Paul, kudos and personal thanks for this great follow-up!\n\nhhp\n\n"
    },
    {
      "time": " 11.Mar.2008 4.50pm",
      "content": "my pleasure, and thank you for the tip on this. i’m hoping many more typophiles go and visit this place, i believe they’re trying to do a good work that could benefit from support of folks like us.\n\n"
    },
    {
      "time": " 11.Mar.2008 7.39pm",
      "content": "thanks Paul.\n\n... And nice to see your eye again Mr. Hrant.\n\n-=®=-\n\n"
    },
    {
      "time": " 7.Aug.2009 12.03am",
      "content": "One of my favorite tour is when i was in Las Vegas Nevada wherein a lot entertainment can be watch and beautiful hotels can see. Las Vegas is the best place ever, i enjoy the vacation with my family and friends. [hoover dam tours](http://web.archive.org/web/20090918234822/http:/www.explorenevadatours.com/hoover-dam.php)\n\n"
    }
  ]
}
