{
  "id": "34466",
  "title": "2 Helvetica based events from Candy...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "After the Helvetica sell-out screening in Copenhagen we’re back with 2 more Helvetica based outings. Hopefully we’ll see you at either or both of the events…\n\nHave a great day, Richard.\n\n-\n\nSweetTalk24 in Dublin.  \nIn association with Mickey Finn’s.\n\n‘Helvetica - The Documentary’ Irish premiere with director Gary Hustwit.  \n&  \nWim Crouwel presentation.\n\nFollowed by Q&A session chaired by Ciaran O’Gaora (Zero-G) with;  \nWim Crouwel, Gary Hustwit, Michael C. Place (Build, UK),  \nAiden Grennelle (Image Now, Irl) & Alastair Keady (Hexibit, Irl).\n\nThursday 28th June 2007. 7pm doors / 8pm show.\n\nThe Sugar Club, Leeson Street, Dublin.  \nMickey Finn’s reception and limited edition prints for the lucky few.  \nAdmission: 10e on door only.\n\n-\n\nBlanka and Candy present ‘50’, an exhibition celebrating 50 years of Helvetica.\n\nLaunching at Design Museum, London 19 July – 31 August\n\n2007 sees the fiftieth anniversary of Helvetica. Created in 1957 by Max Miedinger and Eduard Hoffmann at the Haas type foundry in Switzerland, the typeface was originally christened Neue Haas Grotesk. Its name changed to Helvetica in 1960 in an attempt to take the typeface to a wider international audience. Over the years the typeface has been celebrated widely and used in many renowned applications, implanting its own indelible place in design history. From the beautifully implemented New York Subway signage system by Vignelli to its usage on the lowly generic EXIT sign, the flexibility of the typeface seems to have no boundaries. 2007 even sees the typographic phenomenon celebrated on the big screen in, ‘Helvetica, a documentary film’ by Gary Hustwit. In its 50 year lifespan Helvetica has deservedly become the the most widely used and respected sans serif typeface on the planet.\n\nThe 50 exhibition imagines the world from the perspective of Helvetica itself, highlighting events and inspirational things it has seen- and been influenced by - during its lifetime, from the lunar moon landing to the first British nudist camp. For the exhibition, 50 leading designers and graphic artists from around the world have joined forces with Blanka and Candy to create a visual diary of 50 separate events from the last half century. The exhibition is a birthday party that pays homage to Helvetica’s massive influence on our visual culture. Long live Helvetica… Happy Birthday!\n\nBlanka and Candy have invited 50 leading designers and graphic artists to produce 50 images. Each artist has produced a 50cm x 50 cm print in an edition of 50, available online from blanka.co.uk for £50 each. Each print is produced using Epson Archival Giclee Inkjet technology. The exhibition launches in London at the Design Museum and also will appear at the Image Now Gallery in November for Design Week in Ireland.\n\nThe event is also currently set to visit Edinburgh, Leicester, Newcastle Paris and New York, with Sydney, Berlin and Copenhagen [TBC].\n\nBlanka.co.uk / Candyculture.net\n\nProduced in asssociation with Veer / Epson / GFSmith / Victionary / Design Museum / Build / Generation Press.\n\nContributors: 1957 Spin, 1958 Vince Frost, 1959 Bleed, 1960 Ros Shiers, 1961 The Designers Republic, 1962 Farrow, 1963 Antoine et Manuel, 1964 Ian Wright, 1965 Fabio Ongarato, 1966 Experimental Jetset, 1967 Parra, 1968 Kam Tang, 1969 Build, 1970 Hamish Muir, 1971 Fred Flade, 1972 Ben Drury, 1973 Darren Firth, 1974 James Jarvis, 1975 Rinzen, 1976 Airside, 1977 Niklaus Troxler, 1978 Jonathan Ellery, 1979 Oliver Jeffers, 1980 Glenn Leyburn, 1981 Barber Osgerby, 1982 Alan Kitching, 1983 Conor & David, 1984 Michael Gillette, 1985 NB Studio, 1986 North, 1987 Cartlidge Levene, 1988 Luca Ionescu, 1989 Jenny Mörtsell, 1990 Emmi, 1991 Marc Atlan, 1992 Alexander Gelman, 1993 Hellovon, 1994 Image Now, 1995 Lars Müller, 1996 Kiosk, 1997 Kim Hiorthøy, 1998 Genevieve Gauckler, 1999 Adrian Shaughnessy, 2000 Winkreative, 2001 Commonwealth, 2002 Angry/Aad, 2003 Phunkstudio, 2004 Luke Prowse, 2005 Vaughan Oliver, 2006 Rob Ryan, 2007 Exhibition overview\n\n| Attachment | Size |\n| --- | --- |\n| [ST\\_24.jpg](http://web.archive.org/web/20131019145808/http:/typophile.com/files/ST_24.jpg) | 371.83 KB |\n\n",
  "author": "CandyCulture",
  "time": "14 Jun 2007 — 10:35am",
  "uid": "17137",
  "comments": [
    {
      "time": "18 Jun 2007 — 1:15am",
      "content": "Article from Candy.\n\nLove it or hate it Helvetica, like Marmite, has always been a survivor. When Max Meidinger first concieved Neue Haas Grotesk he could not have envisaged the influence one font would have over the work of generations of designers.\n\nNow the subject of a film, Helvetica's hero or zero status (depending on which side of the picket fence you sit) is uncovered. With a keen eye for the details candy talks to Gary Hustwit, the man behind that 'Helvetica' movie.\n\nHelvetica persona sans non grata?\n\n-\n\nHello Gary. You mention in the notes on your website that the decision to make a film about Helvetica was based on the fact that it is so omnipresent in everyones daily life and that this in its very nature invites more investigation. When were you first aware of Helvetica as a typeface yourself?  \nI guess it was when I bought my first Macintosh, back in 1988. I wasn't an art student, in fact, I wasn't a student at all, I'd already been kicked out of university, twice. But all my friends were in bands at the time, and I started helping them to organize shows, release records, book tours. So of course I was using the Mac for all that, and that's probably when I first discovered there was a font called Helvetica.\n\nWere you always aware of its visual proliferation, or was that something that grew by careful observation and recognition over time?  \nAs I got more and more interested in graphic design and type, I started being more aware of the fonts in my environment. But It wasn't until I moved to New York in 1999 that I really started noticing Helvetica... New York is just infested with it.\n\nBut why choose Helvetica? Why not Futura, Frutiger, Avant Garde or Gill Sans and their respective designers all which would make equally interesting films?  \nWell, I think Eric Gill would be a juicy subject! Actually, there's a film about him in the works already. But if you're making a movie around one typeface, how could it be anything but Helvetica? Would people be lining up around the block to see a film about Times New Roman? Not a chance. There's just something about Helvetica that provokes such love and hate from designers, and it's also probably the one font name that people who don't know anything about graphic design still recognize. There's nothing else in our lives with the name \"Helvetica.\"\n\nOnce you had the idea for the film what were the key reference points that helped grow this project from idea to reality? How complex was it to plan for such a huge undertaking?  \nThe complex plan involved me coming up with the idea, then within 24 hours I was emailing famous designers who I'd never met, asking if they'd like to participate. And for some crazy reason, they all said yes. Then I had to figure out the hard stuff: funding, putting a crew together, planning the logistics, etc. I researched and prepared for about six months, shot film for six months, and then edited for six months.\n\nWhen you set first set about making the film were you aware of the little red book by Lars Muller in 2004 'Helvetica - Homage to a Typeface' which also documents the good, bad and ugly of Helvetica's influence?  \nYes, I'd seen Lars' book in 2004 and loved it. I liked how it showed the professional, designed uses of Helvetica right next to the untrained, vernacular uses. It was funny, because during the filming process, Luke Geissbuhler (cinematographer) and I intentionally did not look at the book, because we did want to just go out and film all the examples that Lars had found, we wanted to find our own examples. But of course, there are so many iconic uses, the New York subways, American Airlines, all the other corporate logos. I wanted get Lars involved in the film, but our schedules kept conflicting. Finally at the very end of the filming, I told him, \"We can't have a film about Helvetica without you in it!\" So he flew up to London for a day, and we spent the afternoon walking around east London and shot some hilarious footage of Lars pointing at all the Helvetica, just font spotting. It ended up being some of the best stuff in the film.\n\nCould you tell us something about the movie itself. Is the focus of the film really closely tied into a single typeface and its use, or moreover is it a an in-depth look at the world of design?  \nIt's an in-depth look at the typeface, but also a look at the people behind typefaces, and the designers who use them. Since Helvetica turns 50 this year, it also serves as a crash course on the past 50 years in graphic design. It also looks at advertising, the psychology behind type use, and how the technology used in design has changed so radically during that period.\n\nWas this a difficult subject to undertake or did you treat this project with the documentary resolve of your other films and just let the story unfold as you discovered more about the face, the faces and the places behind it?  \nThe \"story\" of the film very much arose from the conversations I had with the interviewees. I didn't set out to tell the story of Modernism versus Postmodernism, of order versus chaos, logic versus emotion. But that's something that came out in every interview, and it formed a narrative arc for the film. What's interesting is that everyone in the film is so good at what they do, and so convincing in their design philosophy, that I find myself agreeing with everyone. Yes, Wim Crouwel, grids are good! Yes, Paula Scher, it's all about expressiveness and subjectivity! In a way, the film is more about the designers in it, and their personalities and ideas, as it is about Helvetica.\n\nWhat did you discover about Max Meidinger the man behind the face? Does anyone reveal how he felt about its cultural growth and significance towards the end of his life?  \nI think everyone involved with the typeface was surprised by its success. When Miedinger and Eduard Hoffmann at Haas created it, they were simply wanted to compete with Berthold's Akzidenz Grotesk, an imported German typeface that was all the rage in the 50s and being used heavily by Swiss designers like Josef Müller-Brockmann. They just wanted something homegrown that could go up against Akzidenz. It wasn't until their parent companies, Stempel and Linotype, changed the name and started marketing Helvetica in Germany and abroad that the sales took off. Since Miedinger made the drawings for Helvetica as a work for hire, he didn't receive royalties on Helvetica's sales. And since Haas was owned by Linotype, I don't think they really profited from its success either. Though I know that Linotype did make some sort of compensation to Miedinger in the 70s before he died.\n\nI was once asked by a creative director to make a design more 'swiss' by using Helvetica (Helvetia is latin for Switzerland kids). Designers that I admire such as Angus Hyland, Mark Farrow and Vince Frost have all used Helvetica in striking ways. Do you think that when Helvetica is placed hands of different designers the font takes on a personality of its own or do you think it is still firmly rooted in all things Swiss?  \nI think that you can try to use Helvetica in different ways, but ultimately Helvetica forces you to use it the way it wants you to. Manuel Krebs makes a point of this in the film, that Helvetica somehow contains a design program that will lead you to a certain language. And what's interesting is, it's the same thing with a film about Helvetica... if you take a picture of a word set in Helvetica, you naturally want to frame it in a certain way, just as if it's on a page. So Helvetica even influenced the look of the film, and the music as well. The music had to be precise, slightly mechanized, but still human.\n\nDo you think Helvetica can be neutral given its visual and cultural dominance?  \nI don't think so, no. It's been used too many ways, in too many places, for too many reasons. And all those things affect our reaction to it. When I was growing up, my family always flew on American Airlines, which of curse used Helvetica for everything. So when I see Helvetica, I think part of me remembers going on holiday as a child, the travel, the excitement. I'm sure it's very subtle, but it's there. So nothing is neutral. As David Carson says in the film, you can't not communicate.\n\nWhat countries has the film been shown in and where will it take you to next?  \nSo far it's shown in the US, Canada, Switzerland, Germany, Turkey, the Czech Republic, Norway, Denmark, and France. Next up is the Netherlands, Greece, Australia, New Zealand, England, Japan, South Africa, Brazil, Cuba, and of course loads more screenings around North America and Europe.\n\nDo you think you captured everything you wanted in the film or were there situations that didn't make it to the final cut that you would have preferred to have left in?  \nWell, we shot 60 hours of footage... so there's plenty of great stuff that didn't make it in. I'll try to cram as much of that as possible onto the DVD (October).\n\nMany creatives will be clambering over each other to see this film. Do you think it will have a wider appeal outside of design circles or did you set out to create a instant 'cult' hit for the cultural elite?  \nI set out to make a film that I wanted to see, as a viewer. I think that films naturally find the audience that suits them, so I tend not to think about that stuff. That's generally how I work. If there's something that I really want to see, or buy, or an event to go to, but it doesn't exist, then I have to do it myself. And I discovered early on that if I like something, there are other people out there who will like it too. So that's all I focus on now. Helvetica is just a film that I wanted to see two years ago, but that didn't exist then, so I had to make it.\n\n-\n\n'Helvetica - The Documentary' has it's Irish premiere Thursday 28th June in The Sugar Club, Leeson Street with Wim Crouwel also giving a rare presentation.\n\nMore on the film at [http://www.helveticafilm.com](http://web.archive.org/web/20131019145808/http:/www.helveticafilm.com/ \"http://www.helveticafilm.com\")\n\n"
    },
    {
      "time": "19 Jun 2007 — 12:14pm",
      "content": "Presales are now open for the entire 50 show, images will follow once the show opens in London but this is for those of you who feel like taking a risk... I've seen all the work and it's not much of a bet to be honest, the standard overall is really high...\n\n[http://www.blanka.co.uk/Events/50\\_Ex...on/1957\\_-\\_1981](http://web.archive.org/web/20131019145808/http:/www.blanka.co.uk/Events/50_Ex...on/1957_-_1981 \"http://www.blanka.co.uk/Events/50\\_Ex...on/1957\\_-\\_1981\")  \n [http://www.blanka.co.uk/Events/50\\_Ex...on/1982\\_-\\_2007](http://web.archive.org/web/20131019145808/http:/www.blanka.co.uk/Events/50_Ex...on/1982_-_2007 \"http://www.blanka.co.uk/Events/50\\_Ex...on/1982\\_-\\_2007\")\n\nAlso, watch out for next month's Creative Review. We've got a 4 page feature inside for the show and 2 of the submissions, including one Irish, have got the front and back cover.\n\nHopefully see you in London for the launch July 18th.\n\nHave a great day. Richard.\n\n-\n\n"
    },
    {
      "time": "26 Jul 2007 — 4:21am",
      "content": "Just so you know, all the prints are now available and selling well from here... [http://blanka.co.uk/50\\_years\\_of\\_helvetica/](http://web.archive.org/web/20131019145808/http:/blanka.co.uk/50_years_of_helvetica/ \"http://blanka.co.uk/50\\_years\\_of\\_helvetica/\")\n\nTo see the entire show in better detail visit [http://www.candycollective.com/50](http://web.archive.org/web/20131019145808/http:/www.candycollective.com/50 \"http://www.candycollective.com/50\") Enjoy!\n\n"
    }
  ]
}
