{
  "id": "34467",
  "title": "On quitting internships and future employment",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Another summer has come, and I appear to have landed another not-so-hot internship. There’s been no new work at this firm for a month (for almost all the staff, not just me), and given how low the pay is, I would be better off just doing temp work or freelancing. The only reason I have not left already is that the firm has a semi-prestigious reputation and might look good on a resume.\n\nI am, however, concerned about what future employers will think about my record with internship work. I can’t get a good reference from my last internship because I quit when they really started taking advantage of me and it was not an amicable split. I also got no portfolio stuff from that job, because only two pieces I worked on were printed and they both looked like crap due to arguments between the marketing executives and the business executives over how things should look. If I quit this job I will probably have no good reference and again have nothing to show for it in my portfolio.\n\nAs employers, how harshly would you judge a new designer who had done two internships, neither of which worked out?\n\n",
  "author": "<a href=\"/web/20110815092431/http://typophile.com/user/14722\" title=\"View user profile.\">Dunwich Type</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": "",
      "content": "Well for starters you don't tell future employers that it didn't work out.\n\nI quit my first internship too with no ill effects on my future career. You'll still have the internships on your resume. If you're that miserable and bored, then quit and really focus on trying to find portfolio pieces. I don't think anybody expects you to come out of an internship with portfolio pieces anyway. The references... if your teachers give you good refs and you can get one perhaps from someone you temp with or freelance for, you should be fine.\n\nBut... and this is a big but... consider what your expectations are and have been from these internships. This could be important going forward. Nothing annoys an employer more than a fresh-faced design school graduate who expects to waltz in and be handed plum work. You have to start at the bottom, work hard, do the work you're given to do with enthusiasm and initiative, and hope that someone recognizes your individuality and discipline and gives you more interesting projects to do. It doesn't happen overnight and you have to make sure your attitude is commensurate with your position.\n\nMy first job was operating a photostat camera for $7/hour. I worked all day alone in the dark with smelly chemicals, and the only perk was that the designers would come into my \"office\" after 6 and cut lines on the stat camera glass. They shared it with me since it was, after all, my office (it was a darkroom - you had to knock before entering - which helped them conceal their activity). After a few months the art director took me under his wing and started letting me help him and he liked me, I got to skip the mechanical stage and start laying out books within a year. I think it was a combo of luck (he took an interest in me) and perhaps talent/enthusiasm (he saw something he liked).\n\n"
    },
    {
      "time": "",
      "content": "Are you concerned that future employers will think negatively of what you wrote about past employers in public forums?\n\nWhat are you using to gauge the success of an internship? If you're getting good real-world experience then it's a success. If you get hired that's just a bonus. Many interns come and go without getting hired and it's not seen as a \"failure\". It is true that the stellar interns do get hired.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Are you concerned that future employers will think negatively of what you wrote about past employers in public forums?</cite>\n\nThere’s a reason that I don’t name employers or post my resume online.\n\n<cite>What are you using to gauge the success of an internship? If you’re getting good real-world experience then it’s a success</cite>\n\nLearning. All I want is to work with experienced designers and learn from them. My concern with the present situation is that if this lull continues, I’ll just end learning how to fill an office chair, something I learned plenty of in my previous career.\n\n"
    },
    {
      "time": "",
      "content": "My concern or uncertainty if you wanted me to hire you would be the quality of your attitude.\n\nFor example, you say they were taking advantage of you in the first internship. But what reasonable steps did you take to resolve the situation before quitting? I would guess if one tried to resolve the situation professionally, one could at least achieve an amicable split if it came to that.\n\nFor another example, you say the firm you are at has had no new work. The firm's designers - including you - should be turning their attention toward winning new business - via good design. Congratulations, now you are learning about strategy, marketing, copywriting, networking... Welcome to the the real world of a designer.\n\njarrod\n\n"
    }
  ]
}
