{
  "id": "34464",
  "title": "Client request: \"eliminate all hyphens\" in newsletter",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi All --\n\nThe project is an 8-page corporate editorial-style newsletter. 8.5 x 11\" page, three-column grid, serif typeface (9.5 point Sabon on 13 points leading), ragged-right alignment.\n\nThe client has got some bug up her @$5 that \"hyphens are bad in all circumstances\" and has directed that no words shall ever be hyphenated. Ever.\n\nNow, I understand that it's bad form to allow hyphens in headlines. Subheads. Deckheads. Maybe even pull quotes. But... eliminate all hyphens from the body copy? This is going to make for a rather awkward rag (at the best) or a lot of time spent walking the lines trying to fix the rag.\n\nAnyone ever had this request? I'm sure there's gotta be some readability study out there that I can point to that proves hyphens -- when used sparingly in body copy -- actually help readability.\n\nThoughts?\n\n",
  "author": "mister_eaves",
  "time": "14 Jun 2007 — 9:38am",
  "uid": "12576",
  "comments": [
    {
      "time": "14 Jun 2007 — 10:03am",
      "content": "What is the measure? I prefer to avoid hyphens and consequently do spend a lot of time going over the rag at the end of a job. You are not the only one to have had the request.\n\nTim\n\n"
    },
    {
      "time": "14 Jun 2007 — 10:05am",
      "content": "Ask her what she'd do about a word such as \"shell-like\" ... surely she wouldn't want it written as \"shelllike\" ... would she?\n\n"
    },
    {
      "time": "14 Jun 2007 — 10:09am",
      "content": "_This is going to make for a rather awkward rag (at the best) or a lot of time spent walking the lines trying to fix the rag._\n\nDepending on your content and the size of your gutter, yes, it might be a problem, but it might not either. If you've got a narrower gutter and wider columns, and most words under 11 letters, it may well not be one.\n\nI set ragged-right text without hyphens very often, and no one has complained about readability, so you probably can't use that at a rationale....\n\n"
    },
    {
      "time": "14 Jun 2007 — 10:11am",
      "content": "\\>The client has got some bug up her @$5 that “hyphens are bad in all circumstances” and has directed that no words shall ever be hyphenated. Ever.\n\nEasy solution, have the piece translated into Japanese. Or read this similar thread... [http://typophile.com/node/30235](http://web.archive.org/web/20130216003337/http:/typophile.com/node/30235 \"http://typophile.com/node/30235\")\n\n"
    },
    {
      "time": "14 Jun 2007 — 10:13am",
      "content": "You can turn off hyphenation in Indesign. Under the paragraph palette. You may have to turn on the 'view options' to see it.\n\n"
    },
    {
      "time": "14 Jun 2007 — 10:13am",
      "content": "Elizabeth, proxy argumentation with nazis is hopeless. Especially in ASCII! :-/\n\n\"Richard\", I think the best you can do is follow orders but gently  \nhelp her realize through your results that she needs to loosen up.  \nIf the measure is long enough (I see your leading is huge, which is  \nencouraging - if only in a twisted way) you can <cite>reduce</cite> hyphens,  \nwhich I actually agree is beneficial, but an Absolute Ban is nuts.\n\nhhp\n\n"
    },
    {
      "time": "14 Jun 2007 — 10:19am",
      "content": "You could show her an assortment of publications which demonstrate the widespread acceptable use of hyphens with the hope she may change her mind.\n\nYou could conjure a fatal storm of lead hyphens to rain down upon her with the hope she is replaced with a more reasonable editor.\n\nOr you could say to her that it's an unusual request (which consumes column inches and can result in raggedy arsed columns which may compromise readablity) but that you would be more than happy to do all that extra work for an additional cost.\n\nIf it pays why argue with fools?\n\n"
    },
    {
      "time": "14 Jun 2007 — 10:40am",
      "content": "I agree with the client--no hyphenation! Sorry if that puts me in with the \"fools.\" I just think it's not needed, is less readable, and you may end up with some really wierd computer-generated hyphenation. By the way, I noticed that none of these posts are hyphenated.\n\n"
    },
    {
      "time": "14 Jun 2007 — 10:51am",
      "content": "That's nothing - you should see what they look like on Macs. :-\\>\n\nhhp\n\n"
    },
    {
      "time": "14 Jun 2007 — 11:12am",
      "content": "_By the way, I noticed that none of these posts are hyphenated._\n\nAnd do you consider all of them to be good typography?\n\n"
    },
    {
      "time": "14 Jun 2007 — 11:21am",
      "content": "I avoid hyphens in ragged text but there are occasions when it's essential to prevent a really weird shape in your rag. I'd say do your best not to use them (turn hyphenation off, as suggested) and then manually introduce them only if necessary. And then take it case by case with the boss. Odds are she won't even notice the odd hyphen. It is neither an unusual nor an unreasonable request but I tend to resist that sort of rigid attitude too in favor of a little more flexibility.\n\n"
    },
    {
      "time": "14 Jun 2007 — 11:29am",
      "content": "A client asking to eliminate hyphens in ragged settings is no big deal. Means the rag will be a little looser, and you'll have to massage it a little bit more to make it look good. But you should be doing that anyway. You are a typographer not a computer-monkey.\n\n"
    },
    {
      "time": "14 Jun 2007 — 11:37am",
      "content": "It might be unusual to get that kind of absolute directive, but it ain't unheard of, and I've heard some a lot more outlandish! In any case, at 9.5/13, with a column width of, say 12p2 to 13p6 (which you'll probably get w/3 legs on letter), I don't think it'll be a problem either. Like Ken said, it'll loosen up the rag, but you're leading it out nicely anyway, so it may just reinforce the air.\n\nThe problem I run into is long urls in running text. How do you hyphenate those without confusing the reader?\n\n"
    },
    {
      "time": "14 Jun 2007 — 11:50am",
      "content": "The problem is that removing hyphenation will generally make reading easier -- except that every so often it will create an oddity of adjacent line-lengths which draws attention to itself, looking like a word has been left out. So highlight those instances in fluourescent marker, and ask her if you can re-write the copy to get a smoother rag. And I say this only partially in jest. :-)/:-(\n\n(There is also a problem in rag copy where by chance several adjacent lines come out to the full measure, looking like some justification got mixed in by mistake. Another cause for intervention with the dreaded soft return.)\n\n"
    },
    {
      "time": "14 Jun 2007 — 12:09pm",
      "content": "What Nick said, except make her rewrite the stuff. Giving her more work to do might tame her pickiness.\n\n"
    },
    {
      "time": "14 Jun 2007 — 12:24pm",
      "content": "Hi,\n\nYou might want to read this...  \n [http://home.comcast.net/~garbl/stylemanual/h.htm](http://web.archive.org/web/20130216003337/http:/home.comcast.net/~garbl/stylemanual/h.htm \"http://home.comcast.net/~garbl/stylemanual/h.htm\")\n\n"
    },
    {
      "time": "14 Jun 2007 — 12:33pm",
      "content": "(i love it that the style page begins with \"hairbrained\" and ends with \"hypocrisy,\" with \"hyphen\" falling somewhere in between...)\n\n"
    },
    {
      "time": "14 Jun 2007 — 2:43pm",
      "content": "\\> The problem I run into is long urls in running text.  \n\\> How do you hyphenate those without confusing the reader?\n\nNot to start a Typo-L-style mess, but the least problematic  \nsolution I've heard of is to use the logical-not character.\n\nhhp\n\n"
    },
    {
      "time": "14 Jun 2007 — 4:01pm",
      "content": "That's interesting. I don't think I've ever heard that before. I had always thought the logical not was a mathematical symbol. You're saying it can indicate the hyphenated word does not contain a dash?\n\n"
    },
    {
      "time": "14 Jun 2007 — 4:52pm",
      "content": "I'm not sure if you're asking what I'm thinking. The logical-not at the end of an incomplete URL can indicate that it should be ignored and the rest of the URL from the following line should be appended. Sort of like a special hyphen for URLs. The reason this can work is that the hyphen is allowed in URLs but the logical-not... is not! :-) On the other hand, some people will tend to get confused. Natural selection, baby. ;-)\n\nhhp\n\n"
    },
    {
      "time": "14 Jun 2007 — 4:56pm",
      "content": "I have had this request many times over. My only solution was to do a flush left/rag right. When they come back and say, Justify\" - I say, \"Hyphens.\"\n\nThen of course I ask them to cut some copy, because let's face it, justified lines with hyphens takes up less room.\n\nGood luck - you can do it -- just takes more time per page to make it look right - beware of rivers....\n\n"
    },
    {
      "time": "14 Jun 2007 — 7:03pm",
      "content": "We get all sorts of requests regarding hyphenation -- usually from editors, sometimes from designers. With ragged setting, I've seen \"no hyphens,\" \"no more than two hyphens in a row\" (a usual hyphen block in justified copy is more than three), \"don't hyphenate after two only letters,\" and on & on. On the other hand, some specify \"tight ragg.\" A few want lines to have a pattern of \"long, short, long, short.\" Those are the only ones I tell to find another typesetter.\n\nPeople have all sorts of theories on what is easier to read. I use to have them, too. But I can read a book & enjoy it & forget my profession. So on a number of occasions, after finishing a book, I went back to look at the hyphenation that had been used. Most of them broke all sorts of my pet rules, & I finally had to admit most of these rules are a matter of what people (including me) used to feel more professional; they had nothing to do with <cite>reading.</cite>\n\nOne thing people often seem to forget is that all composition is compromise. Hyphenation aids even spacing -- between words in justified copy, at line ends in ragged copy. Unless you write & rewrite the copy to fit the space, limiting one increased the amount of the other.\n\nOne of my favorite PE's was \"PE, loose line; PE, hyphenated word.\" Both PE's referring to the same line. The hyphenated word was a long one, and all agreed it wasn't going to come up. So to banish the hyphen, the line perforce had to get even looser. Where do they think loose space space comes from?\n\nThere is also a fun situation with 18th century composition. Apparently, some felt the reader might get lost if a word hyphenated overleaf. So, if that happened, they would set the complete word on the line below that last line; the reader would then have the whole word. Next, someone got the idea that even if the word wasn't hyphenated, the reader might get lost, so they set the next word (that occurred overleaf) on the line below. Apparently someone finally figured out that the logical end to that was to set the whole rest of the chapter on the line(s) below, which wasn't going to work, so they stopped this nonsense. Today, with people reading while listening to music & maybe watching television simultaneously, this argument (\"the reader will get confused\") has little merit.\n\n"
    },
    {
      "time": "14 Jun 2007 — 7:27pm",
      "content": "Simple solution: using a thesaurus, a bottle of wine, and some trial and error, get the text to make an interesting symetrical shape.\n\n ![](http://web.archive.org/web/20130216003337im_/http:/typophile.com/files/steinemx_3628.jpg)\n\n"
    },
    {
      "time": "15 Jun 2007 — 5:31am",
      "content": "I don't think it's a big deal to be specified no hyphenation if your text is going to be set ragged-right. I normally set the text up with hyphenation and 'Paragraph Composer' turned off, and then go through it line by line manually adjusting the line breaks. And you've only got 8 pages of text so it's not a big deal to do this. If you do it well a deep-rag can look nice.\n\n"
    },
    {
      "time": "15 Jun 2007 — 5:34am",
      "content": "I turn off Adobe Paragraph Composer too. I'm too much of a control freak to let the program rag my text for me, and I don't think it does such a great job.\n\n"
    },
    {
      "time": "15 Jun 2007 — 8:10am",
      "content": "Hrant: I don't see why you would need any hyphenation character in a URL at all. Why not just break after a slash, or if necessary anywhere else? Given that URLs start with \"http://\" or \"www\" or similar it should be clear where the URL starts.\n\nI'm looking at a PHP manual where faint halftoned arrows are used \\*after\\* the line break to indicate run on lines. But then it's much more difficult to tell what's happening from context\n\n"
    },
    {
      "time": "15 Jun 2007 — 8:53am",
      "content": "hrant-  \nLike I said, it's an interesting solution for the url line. I'm going to play with it a bit and see how well it \"works\" aesthetically for me.\n\n"
    },
    {
      "time": "15 Jun 2007 — 9:15am",
      "content": "Credit goes to Jef Tombeur.\n\nhhp\n\n"
    },
    {
      "time": "15 Jun 2007 — 9:21am",
      "content": "Just finished a job with the same request. The client also requested that I not set the numerals as subscript, which translates to old style.\n\nMy initial read was that this person was used to fixing on the no-hyphens. I just worked with it and kicked it back for small re-writes to fix the worst problems. It still isn't as good as it could have been with a few selective hyphens, but as stated above, with the right measure you can work it out.\n\n"
    },
    {
      "time": "16 Jun 2007 — 1:08am",
      "content": "[removed]\n\n"
    },
    {
      "time": "16 Jun 2007 — 7:36am",
      "content": "Why did you remove that - it was brilliant! :-(\n\nhhp\n\n"
    },
    {
      "time": "16 Jun 2007 — 7:44am",
      "content": "and the rest of us who didn't see it feel cheated...\n\n"
    },
    {
      "time": "16 Jun 2007 — 11:12am",
      "content": "Yeah! Put it back please - you can write why you removed it or thought again.\n\n"
    },
    {
      "time": "16 Jun 2007 — 2:29pm",
      "content": "With apologies, I thought the comment—nay, essay— wasn't sufficiently typographic in nature. And what it lacked in concision it made up for with wildly inflated rhetoric. In lieu of a poorly rewritten version, the gist was, in short, that the client's rigid No Hyphen mandate is largely a declaration of status meant to shape the relationship. To absolutely assert an arbitrary rule concerning something so trifling is a sort of preemptive scolding, a very slight symbolic degredation of your social rank: \"Don't forget that there are limits to your ownership here. You will respect me and do as I say.\"\n\nIf you are not working inside an organization with a formalized system of rank, these sort of superior/subordinate negotiations go on all the time. The point of contention is always, necessarily, trivial. How adroitly you handle the process — the degree to which you push back, comply, or renegotiate — obviously has less to do with design strategy and more to do with a sensitivity to political pressure. But I would suggest that there are a number of creative solutions that will allow one to produce work of the highest quality and also let your client know that she is valued, heard and respected. And I think achieving those two things together is the real goal.\n\n"
    },
    {
      "time": "16 Jun 2007 — 5:38pm",
      "content": "_And what it lacked in concision it made up for with wildly inflated rhetoric._\n\nHaving seen the original, that comment is quite an understatement.\n\n"
    },
    {
      "time": "16 Jun 2007 — 5:58pm",
      "content": "Hmmm... I did several projects with a client that said, \"Our headline face is Torino.\"\n\nTo me, it sounds like much the same thing. I don't happen to have many relationships with clients that I would describe as adversarial, although I admit -- they do sometimes exist.\n\nIn the end, I think (and this is my personal take) that both designer _and_ client have a stake of ownership (for want of a better term) of a project, but perhaps the greater stake must belong to the client; it's to they that designers hope to give a voice, and it's also they who will either be served or not with the design.\n\nIf you work at an office where the boss says, \"No bolo ties,\" I think it's a losing position to declare that bolos, are, in fact, the accessory that asserts your freedom of expression. The boss has an overall image they are hoping to project, and if that one look doesn't fit into the definition, as they see it, them so be it.\n\nAnyway, I'm rambling.\n\nAny designer can work without hyphens, if they need to.\n\n"
    },
    {
      "time": "16 Jun 2007 — 11:59pm",
      "content": "Thanks Thomas.\n\n"
    },
    {
      "time": "19 Jun 2007 — 9:28am",
      "content": "<cite>With apologies, I thought the comment—nay, essay— wasn’t sufficiently typographic in nature. And what it lacked in concision it made up for with wildly inflated rhetoric. In lieu of a poorly rewritten version, the gist was, in short, that the client’s rigid No Hyphen mandate is largely a declaration of status meant to shape the relationship. To absolutely assert an arbitrary rule concerning something so trifling is a sort of preemptive scolding, a very slight symbolic degredation of your social rank: “Don’t forget that there are limits to your ownership here. You will respect me and do as I say.”<br>\nIf you are not working inside an organization with a formalized system of rank, these sort of superior/subordinate negotiations go on all the time. The point of contention is always, necessarily, trivial. How adroitly you handle the process — the degree to which you push back, comply, or renegotiate — obviously has less to do with design strategy and more to do with a sensitivity to political pressure. But I would suggest that there are a number of creative solutions that will allow one to produce work of the highest quality and also let your client know that she is valued, heard and respected. And I think achieving those two things together is the real goal.</cite>\n\nSry I missed the original. This is right on though. Most of human actions don't rise above the basic pissing and sniffing we are so fond of. To elevate the discussion to the betterment of the communication and function is limited by the lack of social intelligence.\n\nTo add a little more complexity, I believe the person I was working with was demonstrating to me her methods of dominating the in-house designer she was used to working with. My experience is that pressure to move in a better direction is best applied consistently over time. I'm sure my explanation of old style characters, which she had assumed were subscript?, did not sit well with her and only strengthened her resolve to not bend on other well established routines.\n\nPlease send me the original comment if it is still to be had.\n\n"
    },
    {
      "time": "19 Jun 2007 — 10:35am",
      "content": "Well part of being a designer is that you are also frequently dealing with people who have a little bit of knowledge about type and/or design, and want to make sure you know that. It is a power game - if they're the client they want to make sure they're getting what they pay for (and that you know you work for them). If they're the client's representative or liaison then they want to prove their importance to the client - make sure the clients believes they are instrumental to the design process.\n\nI've had all sorts of design rules spouted at me and most of the time, unless it's something I have a serious objection to, I roll with it. Being a difficult designer isn't gonna help you in the long run.\n\n"
    },
    {
      "time": "19 Jun 2007 — 10:58am",
      "content": "It's like going to the dentist and telling him what and how to do it. Seems realistic? Not really.\n\nBut unfortunately there are many people out there that they think they can outsmart the dentist. Of course they're the ones that end up with \"worst teeth\".\n\n"
    },
    {
      "time": "19 Jun 2007 — 11:28am",
      "content": "_It’s like going to the dentist and telling him what and how to do it. Seems realistic? Not really._\n\nNo, it's not like that at all. Everybody, every human being, has some sense of design. It's true that not everybody is a fashion designer, but everybody can put together an ensemble. It's true that not everybody is an interior designer, but everybody can paint four walls or hang posters.\n\nThe profession of dentistry has nothing to do with design. So it's more like going a hair stylist and telling him what to do and how to do it. And that happens all the time.\n\nDesign is subjective. (Tiffany that said that on another thread, and I agree wholeheartedly.)\n\n"
    },
    {
      "time": "19 Jun 2007 — 11:34am",
      "content": "_So it’s more like going a hair stylist and telling him what to do and how to do it. And that happens all the time._\n\nAnd that's why there are still people who have mullets.... ;-)\n\n_Design is subjective. (Tiffany that said that on another thread, and I agree wholeheartedly.)_\n\nI do too, although one could say the same thing about music, even for people who can't carry a tune in a bucket or have the sense of rhythm of a dead slug. Most (but not all) of them know their limitations.\n\n"
    },
    {
      "time": "19 Jun 2007 — 11:38am",
      "content": "Not all of Design is subjective - certainly not all of  \ntext typography. That would make it Art (god forbid).\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2007 — 11:45am",
      "content": "When I said that I'm sure I was generalizing. While anything with intrinsic aesthetic value is subjective, there are of course those who know and those who don't know. That sounds terribly arrogant, but it is the truth.\n\nI might create something which my client really likes, but that I will not put in my portfolio because I see many things which I wouldn't do given the option. Does that make more sense?\n\nI'll add that sometimes in life it isn't about the portfolio, but it is about getting that check.\n\n"
    },
    {
      "time": "19 Jun 2007 — 11:49am",
      "content": "_And that’s why there are still people who have mullets…. ;-)_\n\nYes, bad design exists.\n\n_Not all of Design is subjective - certainly not all of  \ntext typography. That would make it Art (god forbid)._\n\nOr Science (god forbid). But I would argue that text typography is subjective...individually, culturally, and historically.\n\n"
    },
    {
      "time": "19 Jun 2007 — 11:59am",
      "content": "\\> text typography is subjective\n\nParty, yes. Everything is (even Science).  \nBut for example ignoring that serifs help readability is... worse than a mullet!\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2007 — 1:01pm",
      "content": "\\> But for example ignoring that serifs help readability is… worse than a mullet!\n\nThat's quite a strong statement; seemingly hyperbole, and calls into question your fashion sense.  \n; )\n\nPS, can someone go back to Jupiterboy's post and add the /cite please?\n\n"
    },
    {
      "time": "19 Jun 2007 — 1:11pm",
      "content": "How is it now. I used that command in the original post and it was showing up as ital for me as usual. ?\n\n"
    },
    {
      "time": "19 Jun 2007 — 1:34pm",
      "content": "Fixed!\n\n"
    },
    {
      "time": "19 Jun 2007 — 6:40pm",
      "content": "_It’s like going to the dentist and telling him what and how to do it. Seems realistic? Not really._\n\nBut unfortunately there are many people out there that they think they can outsmart the dentist. Of course they’re the ones that end up with “worst teeth”.\n\nApologies to everyone for taking this Off-topic.\n\nLitera - I learnt from a wonderful GP in New York to question every doctor I go/speak to. I'm glad I do it -- sometimes without thinking. 30 years ago, I went to a dentist on an emergency. He said I needed 2 root canals (because he didn't know which tooth was bothering me, and it wasn't clear on the x-rays). I said thank you, but no thanks. Took something to deaden the pain -- and drove home. The next morning I saw my own dentist. Well, a small bit of food had gone below gumline and was irritating a tooth. He removed it with a good cleaning, and I've never needed the root canals.\n\nSo yes, some of us do speak to the dentist - and know to get a second opinion.\n\nNow you can go back on-topic. I am sorry, but I couldn't let that statement sit there like it's correct. All doctors are human beings - and they do make very human errors. There are no gods among MDs or DDSs -- and one needs to know, not just to ask questions - but which questions. Honestly, I didn't want to help put that other dentist's kids through college.\n\n"
    }
  ]
}
