{
  "id": "34463",
  "title": "Rock & Roll logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Just something I did out of boredom...  \nInspired by Joseph Yap who made a logo for his son ( [http://typophile.com/node/34024](http://web.archive.org/web/20100116165245/http:/typophile.com/node/34024 \"http://typophile.com/node/34024\")), I made a logo for myself. As you can (hopefully) see it's inspired by heavy metal logo's like Judas Priest & Iron Maiden. Not necessarely my kind of thing, but I've always liked the look of it, it's sòòò cheesy ;-)  \nJust so you know, I'm not actually planning on using this. At least not until I've grown a Hogan Hulk moustache, a David Bowie (Ziggy Stardust period) mullet, expanded my wardrobe with some bandana's & start using make-up to accentuate my eyes ;-p\n\n| Attachment | Size |\n| --- | --- |\n| [Rock&Roll.gif](http://web.archive.org/web/20100116165245/http:/typophile.com/files/Rock&Roll.gif) | 14.52 KB |\n| [RockRevival.gif](http://web.archive.org/web/20100116165245/http:/typophile.com/files/RockRevival.gif) | 12.92 KB |\n\n",
  "author": "<a href=\"/web/20100116165245/http://typophile.com/user/13099\" title=\"View user profile.\">ill sans</a>",
  "time": "<br>",
  "uid": "13099",
  "comments": [
    {
      "time": "",
      "content": "You might like this:  \n [http://www.myfonts.com/fonts/typeco/gothic-gothic/](http://web.archive.org/web/20100116165245/http:/www.myfonts.com/fonts/typeco/gothic-gothic/ \"http://www.myfonts.com/fonts/typeco/gothic-gothic/\")\n\n"
    },
    {
      "time": "",
      "content": "quite GLAMorous! Nice!\n\n"
    },
    {
      "time": "",
      "content": "I personally can't work out what it says.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20100116165245/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "",
      "content": "You can always check my profile for the answer, Ratbaggy ;-)  \nIs anyone else having any trouble reading it?\n\n\\> quite GLAMorous\n\nWell, I wàs listening to T.Rex half the time I was working on it ;-)\n\n"
    },
    {
      "time": "",
      "content": "Probably everybody has some problems reading it. It's not the top of the readable type anyway. :) Jokes aside. I can read it. Not as normal body text, but for logo it's fine. I was just struggling with the \"cs\" ending because to me that was a weird combination of letters. Checking your profile, I saw it is normal in your language.\n\nDid you try to make the ascender on \"k\" a bit higher to make the gap between \"t\" and \"k\" the same as it is with other letters?\n\nGradient is almost not visible. To me that means: discard or correct.\n\nBottom line: nice play on type.\n\n"
    },
    {
      "time": "",
      "content": "I did have some problems with the gap between the k & t, but they don't line up well to make the ascender of the k higher. I gave preference to aligning the rest of the letters (o with u, m with c & s). I did think about adding a \"dirty splatter/spot\" (or maybe a star for that glamorous look) in the corner of the t & k to camouflage the gap, but I haven't found the right \"splatter\" yet ;-)  \nThe gradient did look brighter in Illustrator, but I'm still playing with that for now. If I end up using it as a \"signature logo\", I'll probably adjust the colours to each design.  \nThe cs-ending is actually not usual... Trust me, I always have to spell out my name about 50 times before people get it right ;-)  \nThe name actually originates from Croatia, but has been \"butchered\" in the past (the rest of my family still spells it Lu'kac with a reversed ^ on the c).\n\n"
    },
    {
      "time": "",
      "content": "I've adjusted my k to \"fit\" into the t (and I made the stroke of the t a little longer to align with the ascender of the k again).. I'm not too sure whether the \"triangular gaps\" of the k are not too big now though. I kind of liked the smaller gaps, but I'll have to give myself a little time before I can compare the two results objectively (as far as that's possible ofcourse) ;-)  \nI've made the gradient a little lighter as well which -I think- is definitely an improvement.\n\n"
    },
    {
      "time": "",
      "content": "I actually preferred the more subtle gradient. Gave it a bit of a unique twist.\n\n"
    },
    {
      "time": "",
      "content": "Ok. Lukač then... :)  \nGradient is now VERY visible. As you have said before, you'll adjust the gradient probably for press not screen.\n\nI'd keep the descended \"a\" because the second line is now not as dynamic as it was before. And there was a line from t to a. The first solution with \"k\" is better. This one looks like the stem is thinner than other strokes. I know it's of the same width but...\n\nYou could also try repositioning the first word horizontally.\n\n"
    },
    {
      "time": "",
      "content": "I read Tom Lukaco - not too far off!.  \nThe logo is hot.\n\n"
    },
    {
      "time": "",
      "content": "\\> I'd keep the descended \"a\"\n\nI actually did keep it ;-)  \nBut since I added it to the first logo at the very end & have about 20 different versions in my Illustrator document for comparison (anyone recognize this chaotic way of working?), I made a .gif of the wrong logo. I'd like to upload the last logo WITH the descended a, but I can't. Seems like technology has caught up with me once more... I'm still working on -prepare to laugh at my misfortune & backwater system- OS 9.1 & now that Typophile has also upgraded I can't upload anything anymore. Funnily enough, just a couple of days ago I posted a thread that I wasn't going to be participating actively anymore in any threads (just be a passive spy for a while due to certain circumstances), but I did want to keep posting on a few recent threads I started myself... Be careful what you wish for, right? ;-p  \nAnyway, if anyone here wants to send me an email to [aspronaut@gmail.com](mailto:aspronaut@gmail.com) or [tom.lukacs@telenet.be](mailto:tom.lukacs@telenet.be), I'll be glad to send him/her over the finished logo (so far at least) & give him/her permission to post it here for further comment.  \nIf there's a real generous Samaritan here, he/she could also post a pdf on another thread of mine ( [http://typophile.com/node/34339](http://web.archive.org/web/20100116165245/http:/typophile.com/node/34339 \"http://typophile.com/node/34339\")). If I can get the pdf posted there, I can ask a friendly administor to delete all the other images in that thread.  \nSuch a shame about the upgrade :-(\n\n"
    },
    {
      "time": "",
      "content": "oh they're turning things on every day another. I personally don't like the too big fonts everywhere and strange choice of title fonts but this is it.\n\n"
    }
  ]
}
