{
  "id": "34474",
  "title": "Best way to place the points",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi experts,\n\nI have some problem deciding on how to approach a slightly italic stem.\n\nWith slightly, I mean its only slanted about 2 steps on the grid in FontLab.\n\nIs there any better way of solving these kind of stems, as seen on the image?\n\nBoth has the shape that I want, but I’m note sure what is best.\n\n ![](http://web.archive.org/web/20070911195302im_/http:/typophile.com/files/234pointhandling_4600.png)\n\n [‹ Creating pixel screen font](http://web.archive.org/web/20070911195302/http:/typophile.com/node/34555 \"Go to previous forum topic\") [Center shape in window ›](http://web.archive.org/web/20070911195302/http:/typophile.com/node/34540 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911195302/http://typophile.com/user/11526\" title=\"View user profile.\">Goran Soderstrom</a>",
  "time": "<br>",
  "uid": "11526",
  "comments": [
    {
      "time": " 14.Jun.2007 2.29pm",
      "content": "Are your two steps related to the x-height ?\n\n"
    },
    {
      "time": " 14.Jun.2007 3.20pm",
      "content": "How could they both have the shape you want  \nwhen one has a flat segment and the other doesn’t?\n\nBTW, an italic with such a minute slant cannot be a useful  \nitalic in the eyes of most users. Better to label it Cursive.\n\nhhp\n\n"
    },
    {
      "time": " 14.Jun.2007 4.00pm",
      "content": "I´m no expert for sure, but i will probably not insert any new points at all, insted i would try to use the bezier handles of the top and bottom points, if i want a continuous curve.\n\nSure it doesn´t look like a regular italic slant angle and the two shapes are diferent eachother like hrant pointed out.\n\nbut like i said... i´m just a bigginer\n\nbest regards\n\n"
    },
    {
      "time": " 14.Jun.2007 4.49pm",
      "content": "I’ve come to the conclusion that if font auditor doesn’t flag it as a potential problem, I can put the point wherever I choose. It may be a mistaken conclusion, but that is how I go about it. If either shape is acceptable, I would go with the one on the right. It has fewer points.\n\n"
    },
    {
      "time": " 14.Jun.2007 5.28pm",
      "content": "If you aren’t already aware, note that the lowest difference that you can visually detect in print traditionally—and this was letter press—is about 1/4 of a thousandth of an inch.\n\nSo when your em is one pica,each unit is 1/6th of a thousandth of an inch. So two units—1/3 of a thousandth of an inch is the lowest detectable slant, if it is indeed detectable in one 12 pt type. When you go down to 10 point, the slant of 2 units won’t be detectable at all, by this standard.\n\nIn display sizes, you will see it.\n\nI’m not saying don’t do it, but I thought it might be useful to you to know the limits, if you weren’t aware already.\n\n"
    },
    {
      "time": " 14.Jun.2007 5.55pm",
      "content": "\\> the lowest difference that you can visually detect in print  \n\\> traditionally—and this was letter press—is about 1/4 of a  \n\\> thousandth of an inch.\n\nWhere did you get that number? From what I know, it’s way too large.  \nNote for example that typical ink bleed is one mil (1/1000 inch) and  \nthat’s very easily visible. Furthermore you seem to be confusing micro  \ndifferentiation with something huge like slant.\n\nAlso, this type of “limit” doesn’t account for the  \nmass effect of tiny differences in overall texture.\n\nhhp\n\n"
    },
    {
      "time": " 14.Jun.2007 6.02pm",
      "content": "I just checked the degree in Photoshop, and it’s about 1.  \nA slant of 1 degree (like in Syntax) is known to be easily  \ndistinguishable from no slant even in text sizes. Maybe not  \nto a casual observer, but it’s clearly not below the limits  \nof human perception.\n\nhhp\n\n"
    },
    {
      "time": " 14.Jun.2007 6.05pm",
      "content": "\\>Where did you get that number?\n\nThis is what I saw in at the Museum of Printing in their Mergenthaler Linotype library. In their measured drawings they would go down to quarters of a thousandth, but not below that—IIRC that’s what Larry Oppenberg told me.\n\n\\>ink bleed one mil (1/1000 inch) and  \nthat’s very easily visible.\n\n1/4 of a thousandth is of course four times smaller, and that, they assume, is visible. It’s below that amount they didn’t bother with.\n\nNow that I think of it, that limit might have been their limit control over the pantographic punch cutter, and not the limit of what the eye can see.\n\nSo I may be wrong and you can go finer. I still suspect you are near the visible limit with two units in a 1000 unit em at 12 points—particularly when you are not talking about stem width but with a 2 unit slant over a distance of say 400 units.\n\nIf I’m doing my math right, then Goran’s slant—if this is at x-height—is about the same as Syntax’s, which is 1/2 of a degree. And that you can feel rather than see at text sizes, right? So I would think that’s about the detectable limit. If this is at cap height I think you might not see it at 12 point.\n\n"
    },
    {
      "time": " 14.Jun.2007 6.54pm",
      "content": "The pantograph angle would be interesting to pursue (although perhaps  \nelsewhere) since I’ve long been interested in its limits concerning the  \ncutting of sharp corners.\n\n\\> If I’m doing my math right ...\n\nI think you’re assuming a 2-unit difference along the entire 1000 Em height, while I suspect Goran is talking about that difference just along the height of that glyph, which I would guess is about half the Em height. Which adds up, since I got 1 degree (double yours) using a visual measurement.\n\n\\> that you can feel rather than see at text sizes, right?\n\nWell, Seria Italic has an -average- slant of 1/2 a degree, and I think Majoor would tell you it’s visible. But I’m not sure how to differentiate “feel” and “see” here... Certainly if you ask a person to estimate the slant he can’t do it; but if you set totally upright text next to 1/2-degree-slanted text and ask a person to concsiously choose which one is slanted I’m pretty sure he can, even at like 12 point. I <cite>am</cite> assuming extremely clean repro here though.\n\nhhp\n\n"
    },
    {
      "time": " 15.Jun.2007 12.13am",
      "content": "Wheather its visible or not is another discussion, my friends. But this is actually the regular version of the font, not the italic.\n\n<cite>Are your two steps related to the x-height ?</cite>\n\nNo - what I meant was that the slant is very, very small as seen on the picture. Two steps horizontal. And about one degree.\n\n<cite>How could they both have the shape you want when one has a flat segment and the other doesn’t?</cite>\n\nVisually they both represent the same stem-feeling I want. They look more different when you see the point placement here than they do when you look at the letter in the preview window or on print. Visually there is so small difference that I can be happy with either of them.\n\nI was thinking more in technical terms, if there is any advantages in using one or the other. Maybe because of hinting-issues, or other technical matters.\n\n"
    },
    {
      "time": " 15.Jun.2007 2.48am",
      "content": "Both are fine technically. The first one´s just flat in the middle...\n\n"
    },
    {
      "time": " 15.Jun.2007 4.51am",
      "content": "\\>technical matters\n\nThere may be issues as to what is easier to bold or thin in Multiple Master, but I am not experienced in using these. Perhaps someone knowledgeable on these will chime in.\n\n"
    },
    {
      "time": " 15.Jun.2007 4.51am",
      "content": "[Edit of double post]\n\nSorry to go into this Goran, but I want to get it straight (so to speak :)\n\nIf we are talking about an x-height character at say 400 units, then the ratio away from vertical (horizontal to vertical) is 2/400, which is .005.\n\nAn angle of .3 degrees has that tangent of .005.\n\nIf we are talking about a cap height character of, say 700 units, then 2/700 is .003.\n\nAn angle of .2 degrees has that tangent of .003\n\nUnless my math is wrong, either way you slice it, this is much less than 1 degree.\n\n"
    },
    {
      "time": " 15.Jun.2007 6.14am",
      "content": "William —\n\n.00025 inch was the finest machining tolerance that Mergenthaler Linotype Co. worked to. This was, of course, a very precise tolerance at that time. The company made a big deal about it. And I recall reading an article about MLCo. precision being touted in an engineering newsletter (<cite>The Scovill Standard</cite>).\n\nBut I don’t know if you can extrapolate from this tolerance anything about limits of human visual detection.\n\nI’m not sure if the pantographic cutter had anything to do with that lower limit. I believe the cutter was probably the primary device in the manufacturing and machining process. But I don’t know if it was the limiting factor. I suppose that .00025 may have been the diameter of the smallest cutter. But this would take research to confirm.\n\n— K.\n\n"
    },
    {
      "time": " 15.Jun.2007 6.46am",
      "content": "\\> this is actually the regular version of the font, not the italic.\n\nThat’s encouraging.\n\n\\> Visually they both represent the same stem-feeling I want.\n\nOK.  \nPersonally I would do the right one, but place the points at the maxima:  \nabout 3/4 of the way up on the left, and 3/4 of the way down on the right.\n\nBut I don’t think it’s a huge deal, and there might very well be other mechanical  \nor operational reasons (like William’s auto-Bold point) that push the decision in a different direction.\n\n\\> this is much less than 1 degree.\n\nTry estimating it via Photoshop.\n\n\\> I suppose that .00025 may have been the diameter of the smallest cutter.\n\nFrom what I remember it was one or two mil. Huge.  \nIt’s actually somewhere in a Giampa post on Typophile.\n\nhhp\n\n"
    },
    {
      "time": " 15.Jun.2007 6.47am",
      "content": "If I remember correctly Larry Oppenberg, who onced worked in the Mergenthaler Linotype drawing office, showed me drawings in which the ’f’ was slanted backward by only .00025 inches. The Linotype drawing office, he said, felt that sometimes the f looked falling forward if it was straight, and a slight back slant made it look more upright. (I have a photo of a drawing with the ’i’ slanted forward by .00075.)\n\nSo Goran’s practice here is close to that, though much less than a degree.\n\nedit:\n\n\\>try estimating it via photoshop\n\nThese are vectors, so the calculations are relevant to what you will get in print. The Photoshop rounding by pixel might be misleading.\n\nOh, and the diameter of the cutter it seems to me isn’t the only factor. It might be that though they couldn’t route out a very tight radius, they could control ’wobble’ of the cutting line down to .00025. That would be relevant to something like a back slant of that dimension.\n\n"
    },
    {
      "time": " 15.Jun.2007 7.37am",
      "content": "\\> the ‘f’ was slanted backward by only .00025 inches.\n\nDo you mean along the entire Em height, or its own height?\n\n\\> sometimes the f looked falling forward if it was straight ...\n\nThis is a pretty classic type of issue, and can  \noften be corrected by means other than slant.\n\n\\> much less than a degree.\n\nWill you please stop denying it’s ~1 degree?  \nGoran even said it’s “about one degree”.\n\n\\> they could control ‘wobble’ of the cutting line down to .00025\n\nI don’t know what this means.\n\nhhp\n\n"
    },
    {
      "time": " 15.Jun.2007 8.04am",
      "content": "\\>entire Em height, or its own height?\n\nThe indication of back slant was, IIRC, at the left most point of the stem, where the top of the f started to bend forward.\n\n\\>Will you please stop denying it’s ~1 degree?\n\nIf it’s less than 1/2 degree, and the math says .2- .3 degrees, one would normally not round up and call it one degree. If anything one would round down and call it 0. It is perfectly valid to go with it, but I thought Goran might want to know it was less than he seemed to think.\n\nBy ’wobble’ I mean eg that when drawing a straight vertical line, the cutter would not vary more than .00025 to the right or left.\n\n"
    },
    {
      "time": " 15.Jun.2007 9.15am",
      "content": "Do you think I’m trying to fool you or something?\n\n ![](http://web.archive.org/web/20070911195302im_/http:/typophile.com/files/angles_6613.gif)\n\nThe left line is 1 degree, the right line is 1/2.  \nGoran’s slant is friggin’ 1 degree, no rounding needed even.\n\nhhp\n\n"
    },
    {
      "time": " 15.Jun.2007 10.56am",
      "content": "<cite> &gt;&gt;KL: I suppose that .00025 may have been the diameter of the smallest cutter.<br>\n&gt;HHP: From what I remember it was one or two mil. Huge.</cite>\n\nThat makes more sense — .00025 would be pretty dang small for a cutter. Can you imagine?\n\nBTW, I dug up that article. The drawings were done to .00025, but it turns out the margin of error on machining was smaller. Here’s an excerpt from Griffith:\n\n“The matrix in its final form represents over sixty manufacturing operations alone. Each matrix must pass through more than half a hundred examinations and inspections before it goes out to the printer. A fifteenth part of a thousandth part of an inch is considered a factor of error. If it is not perfect it becomes scrap brass.”\n\n[“Pieces of Brass: A Story of Mergenthaler Linotype Matrices,” by C.H. Griffith, <cite>The Scovill Standard</cite>, Jan-Feb 1931]\n\n— K.\n\n"
    },
    {
      "time": " 15.Jun.2007 11.32am",
      "content": "\\>Do you think I’m trying to fool you or something?\n\nNo, I think you insist on measuring the wrong thing, or in the wrong way. What you should measure is the slant in FontLab, or in print, not in photoshop or a gif.\n\nOne of my whacky prejudices is that trigonometry is true.\n\nIf the difference is of 2 units over 400 then the tangent—the slope—in degrees is .3.  \nEven if the difference is 3 units over 400, then the slant in degrees is still less than .5 degrees.\n\nAnd FontLab reflects that in their not showing 1 degree in the measuring line, as you can see. The line below is 400 units high, and the top node is 2 units to the right of the bottom. Try it yourself.\n\n ![](http://web.archive.org/web/20070911195302im_/http:/typophile.com/files/two-unit-slant_5096.gif)\n\n"
    },
    {
      "time": " 15.Jun.2007 11.33am",
      "content": "\\>\\> “A fifteenth part of a thousandth part of  \n\\>\\> an inch is considered a factor of error.”\n\nThat’s pretty good! Damn shame about the inside corners though. :-/\n\nhhp\n\n"
    },
    {
      "time": " 15.Jun.2007 11.47am",
      "content": "\\> If the difference is of 2 units over 400\n\nWell then I guess it’s not over 400!\n\nBecause if it were, a visual check would not indicate a 1 degree slant.  \nLacking the actual vector data, the way I’m measuring it is the least  \nerror-prone. Your calculations are based on an unfounded assumption  \nabout the height.\n\nDo this: measure the X and Y distances between the leftmost points.\\* You get 8 and 439. The arc-tangent of 8/439 = ~1.04 degrees. Interestingly, the X pixel distance between the two tangent points is in fact 2! Maybe that’s the number Goran was providing. And their Y distance is 120. Not 400. With the arc-tangent of 2/120 being ~0.95 degrees.\n\n\\* Even though it’s not a straight line, that’s still what it translates to in slant.\n\nhhp\n\n"
    },
    {
      "time": " 15.Jun.2007 12.07pm",
      "content": "\\>Your calculations are based on an unfounded assumption  \nabout the height\n\nThat is a reasonable assumption, it seems to me. If this is the bottom of an i, it would be x height, and 400 is a small x-height. If it’s an upper case I or and l the height would be bigger still, and the slope less.\n\n\\>X pixel distance between the two tangent points is in fact 2! Maybe that’s the number Goran was providing\n\nYou don’t have to speculate. Goran said “about two steps on the grid in FontLab”. As I said even with three units it would be less than half a degree.\n\nYou persist in not measuring it in FontLab, which is the relevant measure.\n\nAnyway, this is a silly argument. Goran can tell us the grid numbers, and that’s all there is to know, basically.\n\n"
    },
    {
      "time": " 15.Jun.2007 12.34pm",
      "content": "\\> but I’m note sure what is best.\n\njust from one outline you can’t tell ’what is the best’. Maybe see/study Nueva (Carol Twombly) & Lydian\n\nNueva:  \n [http://www.adobe.com/type/browser/P/P\\_1107.html](http://web.archive.org/web/20070911195302/http:/www.adobe.com/type/browser/P/P_1107.html \"http://www.adobe.com/type/browser/P/P\\_1107.html\")\n\nLydian:  \n [http://www.myfonts.com/fonts/bitstream/lydian/](http://web.archive.org/web/20070911195302/http:/www.myfonts.com/fonts/bitstream/lydian/ \"http://www.myfonts.com/fonts/bitstream/lydian/\")\n\n"
    },
    {
      "time": " 15.Jun.2007 3.30pm",
      "content": "Lol! You guys really can talk ;-)\n\nThe question wasn‘t about which degree it has, because that‘s not relevant at all. I was just hoping that someone had any experience that perhaps could help me decide on how to approach the stems (strictly technical).\n\nThanks for enjoying posts, however :)\n\nDavid I will check these fonts out. The thing is that I havent really found a similar font yet, that has both a small slant and a “dynamic”  \n stem with thicker endings, but perhaps there are in these two fonts you are mentioning.\n\n"
    },
    {
      "time": " 16.Jun.2007 2.15am",
      "content": "And... for the record:\n\n ![](http://web.archive.org/web/20070911195302im_/http:/typophile.com/files/slantdegreeee_5579.png)\n\n"
    },
    {
      "time": " 16.Jun.2007 6.27am",
      "content": "Ah, now I see that you are talking only about the points in the mid section—not the whole stem.\n\nThose are closer together than the top and bottom points, which is what I mistakenly thought you were talking about, so the trigonometry and Hrant are both right, and I’m wrong.\n\n"
    },
    {
      "time": " 16.Jun.2007 7.49am",
      "content": "\\> now I see that you are talking only about the points in the mid section\n\nAs was I, in the second half of my previous paragraph.\n\nBut the other two points also form a slant of 1 degree.\n\nhhp\n\n"
    },
    {
      "time": " 16.Jun.2007 8.51am",
      "content": "Goran, I was looking forward to the responses to your actual question, but the slant seems to be a stronger point of interest. Perhaps you should take the slant off the letter, post a new picture, and ask the question again.\n\n"
    },
    {
      "time": " 16.Jun.2007 11.27am",
      "content": "For the record again;\n\n<cite>Ah, now I see that you are talking only about the points in the mid section—not the whole stem.</cite>\n\nNo I was talking about the whole stem (as a whole) – but then of course – the top of that stem (which was in fact only an example) was moving slowly to become thicker at the endings, so there the angle increases all the time the closer you get to the top ;-)\n\nRuss – Yeah, I should have done that, but the whole “problem” has to do with the appearence of the stems in smaller sizes, and how the hinting is working with the stems – which one is better at a small size, etc. So the angle is the key, but the number of the angle was not important.\n\nIf the letter was upright, I wouldnt have to post the question, because it’s so much easier with straight lines and how they appear on screen etc.  \n:)\n\n"
    },
    {
      "time": " 16.Jun.2007 1.01pm",
      "content": "I was wondering when Goran’s actual question would be addressed... :/ Nice swordfight though!\n\nGoran, you should probably read up on hinting to get a sense of how it works and what will happen in a case like yours. I hope you are solving this problem before drawing the whole character set; that is the wise thing to do. It’s difficult to predict results until you test things out; the only guess I have is that autohinted stems will appear thinner than they are at low res. Still, hinting tools will give you an opportunity to choose the preferred stem weights, so undesirable thinning would not have to occur. Are you interested in hinting (consistent stem weights at low res/small sizes)? If not, either method of construction you show should be fine, since they both give the shape you want.\n\nIf hinted performance is a major concern, I suggest you change the construction so that there are points on extrema. The simplest way to do that would be to add them to your simpler stem (shown on the right in your first image). Unfortunately FontLab is not good at doing this automatically; if you could use Fontographer to “add points to extrema” automatically, it would be quick and pretty accurate. Then you wouldn’t have to re-draw each stem.\n\nFor other examples of slightly angled stems see Eras, which has flared stems as well, and Syntax, whose stems are not flared.\n\nIt hasn’t been mentioned, and you seem certain of the need for this slight angle in the stems, but have you examined whether the angle is really necessary? Could you instead get a leaning effect by making the flares asymmetrical? You could also massage the shape slightly so that you don’t need any additional points; if the top left and bottom right corners had bezier handles that are perfectly vertical. This image shows that construction and its filled appearance.\n\n ![](http://web.archive.org/web/20070911195302im_/http:/typophile.com/files/tapers_4573.gif)\n\n"
    },
    {
      "time": " 16.Jun.2007 1.03pm",
      "content": "\\>the whole stem\n\nGoran, I took your ’about two steps in FontLab’ to be about the position of the topmost points in your glyph relative to the bottommost points. If that were so, then the slant of the glyph would be less than half a degree. But the points you are evidently referring to in the ’two steps’ are the upper and lower set of central points where the straight line is. If I get it right now, the top and bottom most points are clearly shifted further relative to each other, more than the two units of the middle set, in order to continue the same slope.\n\nAs to the straight lines, I don’t think there is any technical problem, which is why nobody has come forward. It may be that you will get ’kinks’ using Multiple Master or Superpolater in creating multiple weights, but I don’t really know.\n\nEdit: Just saw Carl’s post. Thanks, I was hoping you’d post because of your great experience doing the tapered stems of Beorcana! So hinting is the main question...\n\n\\>FontLab is not good at doing this automatically\n\nCarl, in FontLab, I use Font Audit to identify extrema, and click on ’fix’ where I want to have an extremum. Are you saying that Font Audit doesn’t identify and place extrema accurately?\n\n"
    },
    {
      "time": " 16.Jun.2007 2.13pm",
      "content": "Thanks Carl for such nice explanation. I have experimented with this all day now, and I think I will end up with the extrema points after all – and only them. It can produce the look I want, and it also makes the AFDK Autohinting results better. Btw, I am not a hinting expert, but slowly learning this (I think...).\n\nWhat I noticed, when having two tangents on each side of the stem, was that in some sizes on screen, it sort of flipped out. The letter looked like two straight stems that was shifted a little bit apart from each other. With this solution, it looks good both with or without hinting.\n\n ![](http://web.archive.org/web/20070911195302im_/http:/typophile.com/files/extremapoiiiiints_6584.png)\n\n"
    },
    {
      "time": " 16.Jun.2007 2.17pm",
      "content": "<cite>If that were so, then the slant of the glyph would be less than half a degree.</cite>\n\nYes, that should be a much smaller slant :)\n\n"
    },
    {
      "time": " 16.Jun.2007 2.20pm",
      "content": "<cite>It hasn’t been mentioned, and you seem certain of the need for this slight angle in the stems, but have you examined whether the angle is really necessary?</cite>\n\nIt is needed, I am doing a digitization (Hrm, is it called that?) of a hand drawn typeface done in 1987.\n\n"
    },
    {
      "time": " 16.Jun.2007 3.11pm",
      "content": "“Are you saying that Font Audit doesn’t identify and place extrema accurately?”\n\nFontLab also has the feature allowing you to select outlines, or bunches of characters, and apply the “add points to extrema” function. This is the function that seems petulant in that it simply won’t add a point if the extrema isn’t really obvious. A case like Goran’s is exactly what FL won’t reliably handle. Using the FontAudit function might be more accurate (if so, why?), but it would take a lot longer, since you have to step through the glyphs.\n\nFontographer had a magical ability to clean up points and add points to extrema without mangling the intended shape, and it does this operation on any number of outlines you want. Someday.... ;)\n\nGoran, I think you found the best solution. It allows you to apply hinting, which you can control somewhat, without changing the original design. I like this as an example of maintaining fidelity to a design; getting PS outlines to obey the drawings, not the reverse.\n\n"
    },
    {
      "time": " 16.Jun.2007 3.41pm",
      "content": "\\>add points to extrema without mangling the intended shape\n\nOh, I see what you mean. When I use the ’fix’ in fontaudit, it does often mangle the shape when when it adds the extremum,though my feeling is that it does get the extremum at the right place.\n\nWhen I do this I paste the glyph to mask first, and then correct the messed up shape back to the mask by hand; it would be great if it restored the original shape too. I also do it step by step instead of control-e, as that kind of gets out of hand, and sometimes I don’t want to do them all, and I have to correct anyway. It sounds like in Fontographer all that work around is not necessary.\n\n"
    },
    {
      "time": " 16.Jun.2007 8.31pm",
      "content": "\\> Could you instead get a leaning effect by making the flares asymmetrical?\n\nSee FF Avance for a great example of that.\n\n\\> I took your ‘about two steps in FontLab’ to be about the position of  \n\\> the topmost points in your glyph relative to the bottommost points.\n\nWhich it very well could be, if the height were about 110. Goran’s original screenshot shows a lateral separation of 8, which is what you would get at a zoom of 400%! But anyway in no case has any assumption about the <cite>height</cite> on our part been safe.\n\n\\> nobody has come forward\n\nIn my first post of June 15 I suggested what Carl later said about extrema:  \n“Personally I would do the right one, but place the points at the maxima:  \nabout 3/4 of the way up on the left, and 3/4 of the way down on the right.”\n\nThe froth must have impaired your reading ability.\n\nhhp\n\n"
    },
    {
      "time": " 16.Jun.2007 9.45pm",
      "content": "\\>nobody has come forward\n\nHrant you are reading stuff into my comment that isn’t there. I wasn’t discussing the suggestion of putting points at extrema.\n\nBecause Goran still expressed the desire for help on something ’technical’ \\*after\\* your post, I figured he had been looking for some kind of ’technical’ information that hadn’t been discussed yet. Since he responded to Carl’s post positively, I now think what he was looking for is the impact on hinting, which hadn’t been discussed before.\n\nCarl’s discussion of the various options was interesting also.\n\n"
    },
    {
      "time": " 17.Jun.2007 3.09am",
      "content": "A follow up;\n\nDo this value in anyway effect the font, visually, technical or in any other way? Or is it just a number, and a help when placing the diacritics? I always wondered about this, and since we are talking about angles here, maybe we can solve this too? :)\n\nThanks for all help, btw. All of you.\n\n ![](http://web.archive.org/web/20070911195302im_/http:/typophile.com/files/slantangle_6445.png)\n\n"
    },
    {
      "time": " 17.Jun.2007 6.17am",
      "content": "I thought you said this is the Roman style?\n\nhhp\n\n"
    },
    {
      "time": " 17.Jun.2007 7.44am",
      "content": "Yes, this is the Roman style, but it is slightly slanted in its appearance. I think we‘ve mentioned that a couple of times now.\n\nIt’s really nice, looks human and alive in a nice way.\n\nAny advanced info on this checkbox?\n\n"
    },
    {
      "time": " 17.Jun.2007 8.17am",
      "content": "My point is, if it’s the Roman, you leave it/them zero (I think).\n\nhhp\n\n"
    },
    {
      "time": " 17.Jun.2007 8.37am",
      "content": "<cite>...(I think).</cite>\n\nYes, but I want to know.\n\n"
    },
    {
      "time": " 18.Jun.2007 2.11pm",
      "content": "It can be used by FL scripts that will build composites for you; if the glyphs are all placed correctly, the script will use that italic angle to shift the accents. This is something I do a different way, so I’m not convinced it works right all the time. In any case you would have to adjust accents by hand anyway.\n\n"
    },
    {
      "time": " 19.Jun.2007 1.44pm",
      "content": "” ... slightly angled stems see Eras” which is like 5 degrees?\n\nI’ve never seen a 1. The issue I’m aware of with regards to this proposal is that a “lively humanist” face should have a variation of 2-3 degrees from say, the “b” which may lean more, to the “f” which may lean less, about a main angle, say, “l”.\n\nI’m not sure how I’d do that in a one degree sloped face... :-o\n\n"
    },
    {
      "time": " 19.Jun.2007 1.52pm",
      "content": "\\> I’ve never seen a 1.\n\nYou’ve seen Syntax. :-)\n\nhhp\n\n"
    },
    {
      "time": " 19.Jun.2007 2.47pm",
      "content": "David,\n\nSounds like Goran is digitizing original drawings. He hasn’t mentioned whether he will make changes to the original.\n\n"
    }
  ]
}
