{
  "id": "34498",
  "title": "Looking for the handwriting of a 12-year-old girl",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti"
  ],
  "content": "I'm working on a book project and the editor has asked to include a handwriting typeface for central character. I've searched most of the free sites and pay sites, but the scripts that are good enough (opentype with ligatures, etc.) tend to be a bit too refined for a pre-teen girl. I must admit I'm a bit stuck.\n\nHer handwriting will likely go up to 3 pages and we need to include \"reluctant readers,\" so legibility is important.\n\nI've managed to find two that come close to filling the job:  \n [Jennifer's Hand Writing](http://web.archive.org/web/20150419054051/http:/www.dafont.com/jennifer.font) (captures the age)  \nand [Lauren C. Brown](http://web.archive.org/web/20150419054051/http:/www.dafont.com/lauren-c-brown.font) (the legibility is decent)\n\nNeither have ligatures, so will require a lot of grooming that I'd love to avoid. I also don't mind paying for the font if it's the right one. I know that open type will be opening up doors, especially for script fonts, but I haven't seen anything that fits this niche.\n\nHelp?\n\n",
  "author": "Five",
  "time": "15 Jun 2007 — 4:45pm",
  "uid": "19136",
  "comments": [
    {
      "time": "15 Jun 2007 — 5:03pm",
      "content": "You want Amy Papaelias. She's not twelve, but:  \n [http://www.typetalkfonts.com/](http://web.archive.org/web/20150419054051/http:/www.typetalkfonts.com/ \"http://www.typetalkfonts.com/\")\n\nhhp\n\n"
    },
    {
      "time": "16 Jun 2007 — 2:00am",
      "content": "Have a look at [Olga](http://web.archive.org/web/20150419054051/http:/www.fonts.gr/tryfonts/index.asp?familyID=365) included in the Backpacker package from Cannibals (Greece)\n\nGeorge Triantafyllakos - backpacker.gr\n\n"
    },
    {
      "time": "17 Jun 2007 — 6:31am",
      "content": "If you're doing 3 pages and the readership is broad I would avoid a connected script. Print writing, like those you've mentioned, will be much more readable. Also [FF Providence](http://web.archive.org/web/20150419054051/http:/www.fontshop.com/fonts/downloads/fontfont/ff_providence_sans/), [Andy](http://web.archive.org/web/20150419054051/http:/www.fontshop.com/fonts/downloads/creative_alliance/andy/), [Felt Tip](http://web.archive.org/web/20150419054051/http:/www.fontshop.com/search/?q=felt%20tip) or [ITC Zemke Hand](http://web.archive.org/web/20150419054051/http:/www.fontshop.com/fonts/singles/itc/itc_zemke_hand/).\n\nTo avoid shape repetition you can move baselines a bit and flip symmetrical characters, but at 3 pages you're going to have a lot of the same letters regardless of how many alternates or ligatures you have. Readability is most important.\n\nAlternatively, you can pay a bit more and have your ideal [font created from scratch](http://web.archive.org/web/20150419054051/http:/www.fontshop.com/services/handfont.php).\n\n"
    },
    {
      "time": "18 Jun 2007 — 9:38am",
      "content": "The Amy Papaelias site is funny, but not quite what i was looking for :)\n\nAnd Olga has a bit too much variation in the x-height and character weight to sustain a few pages of text.\n\nStephen, I totally agree with an unconnected script and I took a look at some of the ones you pointed out. They're close but they look like boy's handwriting. I'm anticipating needing to make adjustments to a few words here and there to reduce the impact of repeated letters (doubled letters, character angle, baselines...).\n\nAs for getting a font made from scratch, I won't get any of the ligatures I'm hoping for. I suppose, in my dream world, I was hoping that a type designer who visits this site had one made of his/her daughters handwriting and went to the trouble of adding all the opentype features. Like I said, dream world.\n\n"
    },
    {
      "time": "18 Jun 2007 — 10:03am",
      "content": "You can request extra ligatures in your HandFont for a small additional fee. Contact FontShop and chat about it.\n\n"
    },
    {
      "time": "18 Jun 2007 — 10:06am",
      "content": "One more thing, [Handsome Pro](http://web.archive.org/web/20150419054051/http:/www.veer.com/products/typedetail.aspx?image=SHT0000030) has all the features, but it's a cursive font and thus no good.\n\n"
    },
    {
      "time": "18 Jun 2007 — 10:10am",
      "content": "Thanks Stephen, I may just do that. I'm giving myself til mid-week to exhaust other avenues. Felt Tip, btw, is pretty close. It's the lead contender thusfar. Thanks!\n\n"
    },
    {
      "time": "18 Jun 2007 — 11:10am",
      "content": "It's a bit mature but not impossibly so. I knew girls who wrote like that as a kid. They jhust put circles or hearts over their i's.  \nIf it were a printed character, I'd go with it. It's be nice to have a slightly combined handwriting font where 'ing' and 'th' (etc.) get close to a cursive without completely crossing over.\n\n"
    }
  ]
}
