{
  "id": "34490",
  "title": "thesnark.org",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20131012192203im_/http:/typophile.com/files/promo-circles75x400_5185.jpg)\n\n[http://thesnark.org](http://web.archive.org/web/20131012192203/http:/thesnark.org/ \"http://thesnark.org\")\n\nTaking it to the people.\n\n",
  "author": "Choz Cunningham",
  "time": "15 Jun 2007 — 9:33am",
  "uid": "13605",
  "comments": [
    {
      "time": "15 Jun 2007 — 10:08am",
      "content": "Very nice, good luck!  \nI just linked it to a Finnish forum, waiting for comments.\n\n"
    },
    {
      "time": "15 Jun 2007 — 10:42am",
      "content": "Thank you! I am not sure about how the snark should be received by other languages, but I'd love to hear the response.\n\n"
    },
    {
      "time": "15 Jun 2007 — 5:51pm",
      "content": "Nice.  \nThis seems to be quite popular at the moment. :)  \nUnderware was also busy making an [irony mark](http://web.archive.org/web/20131012192203/http:/www.underware.nl/site2/index.php3?id1=underware&id2=custom-type&id3=irony-mark&id4=&id5=&idpic=01).\n\n"
    },
    {
      "time": "16 Jun 2007 — 11:19am",
      "content": "Thanks! Spread the word, if you please. I will be adding material and links every night this week.\n\nI feel the way to really get this mark to endure is to make it as easy on everyone, from the laymen to the pros, to have it. Of course, full page ads are nice, too, but I'm not springing for them. Also, I don't think it should feel like it is coming from the top down.\n\n"
    },
    {
      "time": "20 Jun 2007 — 10:21am",
      "content": "A report from a lively Finnish forum, where there are several subjects on the go any given time. The irony mark didn't excite them half as much as I expected, response was somewhat cool or sarcastic (sic!)\n\nHere's some samples loosely translated:\n\nA: \" Can't see any use for it, the current smileys haven't reduced misunderstandings in the internet discussions ;)\"\n\nB: \"Of course it should be used, I've been told there's plenty of sarcasm in the internet. Attatched to the sign there should be an explanation of its meaning and whether it's there for sarcasm or irony + good reasons for choosing the mentioned style. After all, the limitations of the traditional glyphs are infuriatingly limited.\n\nStrongly in context, whatever happened to the Swatch internet time?\"\n\nC (to B): What about the cultural differences? The American word for sarcasm has a bit more sarcastic meaning than the Finnish one, how should that be marked?  \n.~ (us)  \n.~ (fi)\n\n.~ (:p)\"\n\nD: \"A brilliant idea .~\"\n\nE: (to D): \"Well put .~\"\n\n"
    },
    {
      "time": "27 Jun 2007 — 9:27am",
      "content": "The most logical thing I can imagine is that if the snark follows Finnish words, it portrays whatever tone of irony would be most natural to that language. Most of the classic English punctuation seems to have come about as intonation marks first, so I have been pursuing that approach in explaining \"the right time\" for using the snark: If the irony is \"silent\" the mark is not needed, but where one uses a dry monotone, a sneer, mock-officiousness, extended vowels or other audible devices to make it clear, the snark is the text proxy. Since I only speak English well enough to mention, I am making a lot of assumptions with this premise. Perhaps, there are different, but analogous cues in other languages.\n\nThe failure of Swatch Internet Time is interesting to consider, in context. I am suspect that not only was Swatch time not a useful-enough technology, when compared to existing solutions, such as UTC, but that people don't a \"brand\" of time, and the connotations that it implies. I am a devotee to the snark, but it is an amalgam of many people's ideas, and not owned or branded.\n\nD -E: I think that those comments are an inevitable side affect of public written discussion of a mark that can be used for sarcasm (amongst other things). I like to consider the posters \"early adopters\".\n\n"
    },
    {
      "time": "9 Jul 2007 — 12:54am",
      "content": "The primary reason why I don't anticipate the snark catching on is that sarcasm (in it's many lovely hues\\*) is something that only a small part of the world's population engage in regularly. I have read that it's strongest use is in the UK & Ireland for some reason. The only demographic that correlates with that oddly enough is a similarly higher rate of Schidzophrenia. Now I am not saying that the snark or sarcasm cause Schidzophrenia... But I am saying that for a mark to really catch on it has to be cool so that people go out of their way to use it - in which case you had better get on facebook or whatever is the trendy thing just now, or it has to be seen as really useful to not everybody; but a big enough group that the others cave in or become innured to the new thing. Another idea would be to focus on the UK & or Ireland. They are likelier to find a 'need' for it - and then maybe it will go on from there.\n\n\\* I mean that!\n\n"
    },
    {
      "time": "11 Jul 2007 — 2:24pm",
      "content": "\"...is something that only a small part of the world’s population engage in regularly.\"\n\nI have yet to find a good resource on global views on sarcasm. My anecdotal evidence suggests that figurative language that functions like verbal irony, is not a novel concept to English-as-a-second language speakers from a broad number of countries. Having formerly lived ion the California coast, my daily activities crossed paths with a much broader mix of national, educational and social class origins of non-native English speakers. Those with the most rudimentary English skills seem to readily understand intoned sarcasm or hyperbole instantly, often with more facility than the actual words. Sarcasm appeared to be used effortlessly and sometimes heavily by Russians, Indians, Pakistani, Czechs Latinos and others of moderate to medium mastery. This suggests to me that the art of meaning one thing with the words, and another with the way they are said, is a very pandemic habit.\n\nNevertheless, I understand the weakness of personal impressions, and would like to hear from anyone with figures and facts. For the most part, I offer little opinion on if it is appropriate or even sensible for other languages. I just know that it keeps getting brought up in English, and makes sense to me.\n\nEvidently Ethiopia has an established parallel mark already, and France occasionally flirts with one. Are the French more sarcastic than the British? And Ethiopians the zen masters of the witticism?\n\nI do not even know if a portion of the US is more sarcastic than another, or if anyone has even explored that previously. The cultural mores in my current home discourage progressive behavior and uncivil personal expression. This affects many things and it is likely we will never be known as the home of the snark. But is it the same culture in Boston? Compton? London? Perhaps a bloke out of Dublin will call tomorrow and pledge a million to fund snark awareness, but then - there might be an kid in Milan spraypainting snarks on security cameras today. Till then, just keep playing with it when brainstorming typefaces, if you like. If anything interesting develops, I will blog it you-know-where.\n\n"
    },
    {
      "time": "11 Jul 2007 — 4:58pm",
      "content": "<cite> Nevertheless, I understand the weakness of personal impressions, and would like to hear from anyone with figures and facts. </cite>\n\nLikewise. Even though The impression I have is as I have written above - this is just an impression. What we need is a linguist/anthropologist to sort us out.\n\nEven though I am a sort of doubter - I am fond of sarcasm in it's many forms/dilutions. And therefore fond of the snark if merely for association with sarcasm.\n\n"
    }
  ]
}
