{
  "id": "34526",
  "title": "Centaur fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi Centaur Fans!  \nIs anyone still interested in Centaur faces? I am a new member of typophile. The reason for me to finally enter was the discussion of Centaur typeface. Yet, some time has passed ;-) (it is dated 2004)  \nThank you Raph for the impressive good scans of the Bible. How did you get them? Great material!  \nI wanted to add that a beautiful Centaur (I believe) was done and hopefully still exists during the “Valdonega Aesthetic Line” project brought to live in the 90’s by the Stamperia Valdonega, Verona or better to say Martino Mardersteig son of the great printer Giovanni Mardersteig. We did (I was so happy to join this project those days) a version in several sizes (8, 12, 16) very very close to hotmetal Montotype version. I later on added some characters to achieve the first handprinted version (1913/14). I think the face is still available there if you want to print from it at the Stamperia because the type will not be available on the fontmarket and I think Mardersteig had his good reasons for so much work was needed.  \nI think he will allow me to show something for I done the digitalisation myself and I am quite proud of it, I have to admit. We used a very special design technique. I added also a text that explained a bit. I was very young yet at those times and I have to excuse for my very bad and somewhat striking English. But maybe it could be interesting to add something to current discussions if there are any now.  \nLast word to Jenson Adobe. I do believe Centaur in the original version ist more close to Jensons real style than the Adobe font which is to my eyes too round too soft and some letters aren’t very nice especiall ‘g’ and ‘a’. Although I do admire the abstract and nice modern serif treatment in enlargement.  \nThanks so far  \nhope someone will talk to me  \nPS couldn’t attach the text for he doesn’t allow me pdf. Or is there a way?  \nStefan\n\n ![](http://web.archive.org/web/20141015225126im_/http:/typophile.com/files/Letters_4651.jpg)\n\n",
  "author": "Stefan Seifert",
  "time": "17 Jun 2007 — 5:01am",
  "uid": "19151",
  "comments": [
    {
      "time": "17 Jun 2007 — 6:51am",
      "content": "Very nice to hear from somebody involved in the Valdonega designs!  \nThose fonts are like secret jewels, and I've long admired the early  \nadoption of optical scaling in digital type. And I think as long as  \nValdonega can maintain success as printers due (partly) to those  \nproprietary fonts, not releasing them retail makes perfect sense.\n\nI have a small specimen of the VAL fonts that I got from a conference some  \nyears ago, but of course anything more you can divulge would be great!\n\nhhp\n\n"
    },
    {
      "time": "17 Jun 2007 — 8:32am",
      "content": "Very interesting work. I'm about to go to breakfast and worship, so I don't have time right now for a detailed post, but please take a look at the [PDF](http://web.archive.org/web/20141015225126/http:/levien.com/type/myfonts/Centaur.pdf) of all the outlines I've drawn so far on this project. I will follow up later on the points you bring up.\n\n"
    },
    {
      "time": "17 Jun 2007 — 11:18pm",
      "content": "Great!\n\nI am going to work also now.  \nBut I couldn’t do without watching your Designs even though I will be late now ;-)  \nGreat! I saw that you also did the original foundry type. I am very impressed.  \nPlease go on. Lets talk more about it if you like.  \nVery nice your designs!\n\nStefan\n\n"
    },
    {
      "time": "17 Jun 2007 — 11:29pm",
      "content": "Those fonts are like secret jewels\n\nYes they are! Specially the last ones as Centaur and Garamond and also  \nthe improved Dante. Dante for example you cannot at all compare to the standard  \nversion on the market, this one really has some of the edgy and yet sensible feeling of its designer. Here comes Charles Malin into the discussion. And more oven their Griffo Design (that was never done)...\n\nIts a petty, I think it will be difficult to get more printed material in terms of specimen because in the later times of the project Mardersteig didn’t want to spend so much on these things for financial reasons. I could send you a folded paper (A4) of a Baskerville specimen but its not the very best probe of what was done.\n\nLets talk later if you want I have to go to work now..\n\nStefan\n\nGreat to hear from you\n\nthis is a page I once set from Centaur 16 pt copying a page set by  \nGiovanni Mardersteig I don’t remember the title of the book now (barbiere..?)  \nthis page was almost identic with its original hotmetal version.  \nIf you want I can tell you later some of its design secrets because I did strange  \nthings with bezier curves ;-)\n\n ![](http://web.archive.org/web/20141015225126im_/http:/typophile.com/files/Centaur_VAL_hotmetal_3728.jpg)\n\n"
    },
    {
      "time": "18 Jun 2007 — 2:32am",
      "content": "\\>If you want I can tell you later some of its design secrets because I did strange things with bezier curves ;-)\n\nI'd be very interested to see a few examples of your approach, with the nodes and handles of the bezier curves shown.\n\n"
    },
    {
      "time": "18 Jun 2007 — 6:24am",
      "content": "Yes, please - secrets are always welcome! :-)\n\nhhp\n\n"
    },
    {
      "time": "18 Jun 2007 — 11:06am",
      "content": "Hi William, hi Hrant,\n\nsecrets? ;-) Ok, maybe I exaggerated a little ;-)  \nSeriously, when we worked at the fonst for the VAL project the greatest problem seems to be the blackness of the characters printed by hotmetal press. (Please excuse my bad English when I try to explain - its the only one I have ;-) The guys at the Stamperia had tried a lot also before I entered the project. Seemed a problem without solution. Mardersteig never seemed quite content and neither we. Certainly we tried to blow up outlines but even when we arrived at typefaces that could be called bold we didn’t succeed in giving the feeling of blackness. I don’t know if I explain right. In part this defect obviously from the lacking of the pressure of the letters into the paper and the lack of colour in the offset-black which is a delusion after all. But when I made the experiment reproducing hotmetal pages and restamping them in offset they still look great in comparison. So I did experiment a lot with bezier curves because I believe in part it could be a problem of nature of form. This is quite daring I think because one could believe that basicly every form can be reporduced by bezier curves. But I still believe that they can’t. Its in first the line the problem of the places where two lets say more or less round forms link to each other. For example a letter stem when it becomes a serif. This zone is very difficult and if you wish to understand and reproduce forms spontanously its almost impossible to catch these zones in a good way. Or you do a thing to round too smooth or too much with an angle. And you cannot add points and points to define better. We all know that. So one day I found a special way to put curve points that form a stem slightly displaced with tangents remaining parallel and when this forms enter the serif I did it at 90 degrees. More or less like in the picture that I add.  \nMoreover the scan process seemed to wash out the letters like a stone from water. They lack determination somehow. Not easy to explain it. Maybe also that I am crazy. So this little trick seemed to force the computer while reinterpretating the characters when doing the films to fill the zones where one form goes into another with additional bit-points there where they have been swept away during the scanning. May sound funny but it worked!  \nThe Centaur page was made with characters like that. Obviously it is impossible to sell them because they work only in the very size from which they were scanned. If you enlarge them the outline errors reveal. But if you use the 16 point as 16 point it is impossible to see it and the character appears slightly more rough more organic somehow.  \nWell, at those times we worked in FontStudio and I would not repeat this method in FontLab now but I still believe it was a quite interesting method. And I am still convinced that the greatest problem of nearly all modern faces is that the lack vitality because they are somehow too smooth too round at least to represent originals from the past.\n\nStefan\n\n ![](http://web.archive.org/web/20141015225126im_/http:/typophile.com/files/Bild-1_4738.gif)\n\n ![](http://web.archive.org/web/20141015225126im_/http:/typophile.com/files/Bild-2_6705.gif)\n\n"
    },
    {
      "time": "19 Jun 2007 — 10:51am",
      "content": "Thanks, Stefan, that is fascinating.\n\nI see what you did is introduce a deliberate undulation in the line. The result is that the outlines don't look like you made a mistake and left a 'lump' in a bezier outline. Instead the outlines look more like they were chiseled out, as in the old days of punch cutting with a chisel.\n\nNice effect!\n\nI am working on a classic revival also. I probably won't do this as I want a more updated, modern look, but I will try on a few characters and see the effect. Thanks for sharing your ideas.\n\n"
    },
    {
      "time": "19 Jun 2007 — 12:06pm",
      "content": "This is indeed fascinating.  \nAnd I can even picture a way to automate this so that  \n\"plain\" bezier outlines are easily given the chisel effect...\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2007 — 12:07pm",
      "content": "_...as in the old days of punch cutting with a chisel._\n\nGraver.\n\n"
    },
    {
      "time": "19 Jun 2007 — 12:38pm",
      "content": "Burin?\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2007 — 3:16pm",
      "content": "Yes, burin is probably the correct term for the type of graver used in cutting type. Mine used to belong to Christian Paput at the Imprimerie nationale. The back of the blade has been ground in ways that I have not seen on typical engraver's burins, creating a sharper, narrower point. It is quite clever: there are two planes between the point and the back of the blade, which allow for a sharper point while maintaining strength.\n\n[Burin comes from the French word for cold chisel, which may confuse some people. An engraver's or punchcutter's burin is nothing like a cold chisel.]\n\n"
    },
    {
      "time": "19 Jun 2007 — 4:04pm",
      "content": "John, do you have any pictures?\n\n"
    },
    {
      "time": "19 Jun 2007 — 4:22pm",
      "content": "John can probably provide nice color photos, but otherwise you can see monochrome images of what might well be the very same burin in Paput's \"The Punchcutting\". I don't know what he's up to now, but when the IN was still in place he very graciously gave me a tour of that amazing institution, and some of the things I saw there are indelibly burned into my memory!\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2007 — 8:58pm",
      "content": "I'll try to take some photos tomorrow, if the light is better. It is a difficult oject to photograph.\n\n"
    },
    {
      "time": "19 Jun 2007 — 10:34pm",
      "content": "Thanks guys!\n\nYes I found also it could have something to do with the more spontaneous way of making forms like in a punchcut (although I never done that). The thing is that the kind of forms you need in a classic redesign come out more easily I found. But I probably will not do this again, too. Its hard to do it with FontLab for here everything is so damned clear ;-)  \nNot like in the old days of pixeled FontStudio working. I am not sure wether this is overall such a great advantage. Anyone there who works with Anti-Alias switched on?\n\nBy the way, Wow, there is someone who got to know Christian Paput?  \nWhen I was beginning typedesign I started (tried) with a wonderful Garamond (I draw only by hand producing later black letters putting them together later in darkroom work) They at the Imprimerie were so kind to send me a wonderful specimen of Garamont (with the t at the end) I heard of him wanted to see the Imprimerie but didn’t make it.\n\nI have great respect of the punchcuttes first of all I believe the work of Malin was extremely good, wasn’t it? I always had great admiration for the Griffo of Malin and Mardersteig.  \nOne of the rare cases I find that the recutting was more beautiful than its original for I found the types in Aldus always a little stiffy (the right word? I doubt so)\n\nThank your for your interest here!  \nIts great to hear that one is not alone with this kind of things in mind!\n\nSalute  \nStefan\n\nJenson detail\n\n ![](http://web.archive.org/web/20141015225126im_/http:/typophile.com/files/Jenson_g_detail_3465.gif)\n\n"
    },
    {
      "time": "27 Jan 2008 — 3:14am",
      "content": "Stefan\n\nI love what you have done with this font. Coincidentally I was looking a rather similar font that was used by Mondadori in Italy in the 1940s. Richard Beatty helped me identify the font as Monotype Pastonchi. Originally I had thought it was some variation of Centaur. It has a similar elegance and its richness on the printed page illustrates what you were speaking about — that deep black of letterpress which is so hard to reproduce digitally. The book here was a collection of poems by Salvatore Quasimodo.\n\n ![](http://web.archive.org/web/20141015225126im_/http:/typophile.com/files/Quasimodo002sm_5072.jpg)\n\n ![](http://web.archive.org/web/20141015225126im_/http:/typophile.com/files/Quasimodo001sm_5278.jpg)\n\n"
    },
    {
      "time": "27 Jan 2008 — 6:56am",
      "content": "Eluard, Pastonchi is indeed a fine typeface.\n\nIt was art directed by Francesco Pastonchi himself and designed by Eduardo Cotti of the Regia Scuola Tipografica in Torino. Pastonchi wanted to use it on the new series of books on the classics of Italian literature. Initially the Italian foundry Nebiolo was to cut the typeface but for economic reasons it became impossible. Coming full-circle from Stefan’s original post, it was through Giovanni Mardersteig that Mondadori and Pastonchi got in touch with Stanley Morison and had Monotype cut the type, both the final version and the many revisions and proofing versions that needed to be done to the original drawings.\n\nThere is [a digital version of Pastonchi on sale by Linotype](http://web.archive.org/web/20141015225126/http:/www.linotype.com/3305/francescopastonchi.html) but I don’t know if it’s any good.\n\n"
    },
    {
      "time": "27 Jan 2008 — 8:02am",
      "content": "<cite>There is a digital version of Pastonchi on sale by Linotype but I don’t know if it’s any good.</cite>\n\nSome of those alternates are worthy of a little hyperbole.\n\n"
    },
    {
      "time": "27 Jan 2008 — 3:31pm",
      "content": "verbosus — many thanks for that additional background information, this was exactly what I was after. In fact I bought the digital version from Linotype (in OpenType!) last night. So, with the acknowledgment that I've had very little time to work with it, it seems to be a remarkably faithful rendition of the metal type, much darker than Monotype's usual rather thin digitalisations. This one has real power and character.\n\nI am doing some translations of Quasimodo's poems and setting the above scan next to a translation set in digital Pastonchi makes me think that the latter is not embarrassed by the comparison. (Though I had to loosen up the digital version a little, both the letterpacing and the word spacing.)\n\nDo you happen to know what typeface was used by the publisher Giulio Einaudi, who published Eugenio Montale's first too books? (Montale's third was printed by Mardersteig himself, in Dante, I think.)\n\nThanks again\n\n"
    },
    {
      "time": "28 Jan 2008 — 1:20am",
      "content": "Eluard, I don’t know the specifics of the first two Montale books (if you want to send me an image, my contacts are on [my home page](http://web.archive.org/web/20141015225126/http:/cavedoni.com/)) but it’s possible that they have been set in Simoncini Garamond, as that typeface was custom-designed by Simoncini and Ludwig & Mayer specifically for Einaudi. In fact, Mondadori (with Pastonchi) and Einaudi (with Simoncini Garamond) are the first examples of custom type designs in the modern history of publishing in Italy.\n\n"
    },
    {
      "time": "28 Jan 2008 — 4:37am",
      "content": "Verbosus — many thanks again. I will send you a scan, but I suspect you are right. What struck me about the Einaudi face was just how rich it was in contextual alternatives — it's really beautifully done! Alas digital Simoncini, though very nice, has no such subtleties. Here's hoping for an open type version with some effort put into it!\n\nEinaudi and Mondadori books make me long for a time when care was taken in the production of poetry books. Even in the austerity of war they were wonderful objects.\n\n"
    },
    {
      "time": "28 Jan 2008 — 5:52am",
      "content": "Yes, [digital Simoncini Garamond as sold by Linotype](http://web.archive.org/web/20141015225126/http:/www.linotype.com/1476/simoncinigaramond-family.html) doesn’t have old style figures nor small caps. As far as I know, the rights to the typeface at the moment are held by Linotype (possibly through [Neufville](http://web.archive.org/web/20141015225126/http:/www.neufville.com/), which should have acquired the rights of the old foundry Ludwig & Mayer which in turn consulted on many Simoncini typefaces). I don’t think an OpenType version is in the works, but one never knows.\n\nIf you like Mondadori and Einaudi I think you’d love to see books published by either Alberto and [Enrico Tallone](http://web.archive.org/web/20141015225126/http:/www.talloneeditore.it/) or Giovanni and [Martino Mardersteig](http://web.archive.org/web/20141015225126/http:/www.stamperiavaldonega.it/).\n\n"
    },
    {
      "time": "29 Jan 2008 — 12:27am",
      "content": "Hi Eluard,\n\nbiefly (I am at work)  \nHave you seen the Valdonega Aesthethic Line typefaces?  \nTry to contact Mardersteig,  \nhe will be pleased.\n\nAt 13, march there will be a little exponation of his stuff.  \nI will make a little little speech ;-))\n\nYour pages you shown are beautiful indeed.  \nDon’t try to achieve this with the digital stuff in common use..\n\nLets speak more about these things  \nlooking forward to it\n\nStefan\n\n"
    },
    {
      "time": "29 Jan 2008 — 12:44am",
      "content": "Simoncini Garamond with small caps & OSF is available here: [http://www.myfonts.com/fonts/efscangraphic/garamond-simoncini-sb/roman-sc/](http://web.archive.org/web/20141015225126/http:/www.myfonts.com/fonts/efscangraphic/garamond-simoncini-sb/roman-sc/ \"http://www.myfonts.com/fonts/efscangraphic/garamond-simoncini-sb/roman-sc/\")\n\n"
    },
    {
      "time": "29 Jan 2008 — 2:03am",
      "content": "Stefan: can you provide more informations about this Mardersteig exposition? If it’s in Italy I’d love to attend.\n\n"
    },
    {
      "time": "29 Jan 2008 — 2:10am",
      "content": "Nevermind, I found some informations on the (new) Valdonega books Web site. The exhibition will open at the [Museum für Druckkunst, in Leipzig](http://web.archive.org/web/20141015225126/http:/www.valdonegabooks.it/en/node/114).\n\n"
    },
    {
      "time": "29 Jan 2008 — 2:14am",
      "content": "Thanks verbosus — I tried your web page but I only got the index of usage. I will post the Simoncini to this thread, below. It's worth a public display somewhere.\n\nStefan — many thanks, I will try to contact Martino.\n\nloremipsum — thanks for pointing me in that direction. And they are Open Type too!\n\n"
    },
    {
      "time": "29 Jan 2008 — 2:23am",
      "content": "Here is a page from the 1945 Einaudi edition of Montale's Le Occasioni, set, as noted by verbosus, in Simoncini Garamond.\n\nNote the alternative t's in the double t's The second is shorter in some words, giving a falling effect. In some it is the same height and in some (not shown) it is taller. In this way the typesetter has subtly enhanced and reinforced the mood of these sad love poems. The descenders of the font are completely unlike the Monotype digitalisation, which are far too short. Here is a supremely elegant typeface, set by someone sympathetic with the work. (I think there are also two c's but I can't be sure.)\n\nMontale's next book was set in Mardersteig's Dante.\n\n ![](http://web.archive.org/web/20141015225126im_/http:/typophile.com/files/Quasimodo004_5801.jpg)\n\n"
    },
    {
      "time": "29 Jan 2008 — 6:56am",
      "content": "Eluard, I don’t know what it is, but I don’t think what you have there is Simoncini Garamond. For one, Simoncini wasn’t making matrices in 1945 and Simoncini Garamond came much later, around the 60’s I think. If you want to send me a higher-resolution scan I fixed my home page now and you’ll find my contact details there.\n\n"
    },
    {
      "time": "29 Jan 2008 — 1:16pm",
      "content": "Thanks verbosus — I will. I'm very curious now as to what it is!\n\n"
    },
    {
      "time": "5 Feb 2008 — 8:40am",
      "content": "Hi Eluard, verbosus,\n\nvery nice that Garamond!\n\nIf you come to the exhibition at Leipzig, verbosus, we may meet us there!  \nAre you in Italy? (I loved to be, but I am not :-((((\n\nStefan\n\n"
    },
    {
      "time": "10 Feb 2008 — 3:54pm",
      "content": "Just to tie up a couple of loose ends. The typeface posted above by Eluard was [identified by Mike Yanega as being Estienne in another thread](http://web.archive.org/web/20141015225126/http:/typophile.com/node/41673). As for Leipzig, Stefan, I’m afraid I don’t think I’ll be able to attend – because yes, I am in Italy – but I do want to get in touch with Valdonega and see if there are any plans for the exhibition to move back here, eventually.\n\n"
    }
  ]
}
