{
  "id": "34535",
  "title": "Script font for large format posters.",
  "forum": "Design",
  "tags": [

  ],
  "content": "Here is a design I’ve begun for a few large format posters to be hung at a convention booth. As of now, the size of the posters is going to be three feet by six feet.\n\nI like the general design here so far, but I feel that the script font at the bottom is a bit illegible, and could do for a little bit of a change to something a bit more legible, but with a similar feel.\n\nIf anyone has any suggestions for a font, or anything on the design as a whole, feel free to comment away.\n\n ![](http://web.archive.org/web/20080410040758im_/http:/www.typophile.com/files/3x6BGsmall_6660.jpg)\n\nAlso. This is my first project of this.. magnitude as a freelance designer. Can anyone reference a good place to look to get an idea of where to start for pricing this project? There are several banners involved, as well as designing some images to be shown on a few televisions around the booth.\n\n| Attachment | Size |\n| --- | --- |\n| [3x6BGsmall.jpg](http://web.archive.org/web/20080410040758/http:/typophile.com/files/3x6BGsmall.jpg) | 202.06 KB |\n\n [‹ Combining type - inviolable rules? - contrast, angle of stress, proportions, terminals](http://web.archive.org/web/20080410040758/http:/www.typophile.com/node/34762 \"Go to previous forum topic\") [Round, but not too cute slab serif? ›](http://web.archive.org/web/20080410040758/http:/www.typophile.com/node/34750 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080410040758/http://www.typophile.com/user/18724\" title=\"View user profile.\">Jibran Kutik</a>",
  "time": "<br>",
  "uid": "18724",
  "comments": [
    {
      "time": " 17.Jun.2007 8.37pm",
      "content": "Try using Studio or Spring Light or if you want to get an outdoor look try Ovidus Demi-Bold\n\n"
    },
    {
      "time": " 17.Jun.2007 8.55pm",
      "content": "How about [Zapfino](http://web.archive.org/web/20080410040758/http:/www.fontshop.com/fonts/downloads/linotype/zapfino_extra_pro_ot_virtual/&sample_text=Window%20of%20Opportunity&sample_size=48)?\n\n"
    },
    {
      "time": " 18.Jun.2007 12.18am",
      "content": "Make the kerning a bit looser and consistent for both text blocks at the moment it is working against the character of Scriptina which in turn is affecting the legibility, the bar in the headline appears to be off centre because of the shape of the W and if you have genuine small caps it would help the weight differences in the title. If these are floor-length you might need to move everything up.\n\nTim\n\n"
    },
    {
      "time": " 18.Jun.2007 10.24am",
      "content": "[Ambiance](http://web.archive.org/web/20080410040758/http:/www.fontshop.com/fonts/downloads/bitstream/ambiance/&sample_text=Window%20of%20Opportunity&sample_size=48) is also a nice alternative.\n\n"
    },
    {
      "time": " 18.Jun.2007 11.00am",
      "content": "Also by [Rob Leuschke](http://web.archive.org/web/20080410040758/http:/www.typophile.com/wiki/Rob%252BLeuschke): [Corinthia](http://web.archive.org/web/20080410040758/http:/www.p22.com/ihof/corinthia.html)\n\n"
    },
    {
      "time": " 22.Jun.2007 6.43am",
      "content": "I also vote for the looser kerning suggested by Tim.\n\n"
    },
    {
      "time": " 27.Jun.2007 6.10am",
      "content": "i agree with stephen that ambiance could be a better choice for the script. to my mind, scriptina is pretty played at the moment — i might have to go a year or two without seeing it before i can appreciate it without rolling my eyes.\n\nin any case, all the type here — serif and script — is kerned a bit too tightly to be comfortable.\n\ni like the weathered nostalgia of the design. you might try making the lighter ’torn paperish’ edge on the left a little narrower; being both so light and so vertical, it will still have a lot of impact without dominating the design.\n\njust some thoughts.\n\n"
    }
  ]
}
