{
  "id": "3454",
  "title": "Drawing Typefaces",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am a graphic designer that has interest in designing a typeface, however I felt I should learn how to draw a typeface before going onto the computer. I have found drawing to be initially difficult..recently I have found that if i draw with a heavy hand, the contours are easier to control. Are there any suggestions on how to draw a typeface? any techiniques?\n\n",
  "author": "franklin_new",
  "time": "4 Mar 2004 — 7:54pm",
  "uid": "3164",
  "comments": [
    {
      "time": "5 Mar 2004 — 4:27am",
      "content": "Frank can you take a Calligraphy class where you live? It can really open your eyes to how many letter forms were created.\n\n"
    },
    {
      "time": "10 Mar 2004 — 4:44pm",
      "content": "Calligraphy class? I'll look into it, thanks for the suggestion Daniel...however in the meantime I am still interested in any outline drawing techniques..before the computer, commercial artists had to hand draw&paint letter forms...how did they do so with such accuracy?\n\n"
    },
    {
      "time": "10 Mar 2004 — 5:04pm",
      "content": "Frank -- there are dozens of lettering books that   \nshow you the ins and outs of drawing   \nand painting letters.   \n   \ngo to   \n [http://www.bookfinder.com/](http://web.archive.org/web/20140715052719/http:/www.bookfinder.com/)   \nor another book search engine   \nand type in Lettering   \n   \nhere is a nice list, too.   \n [http://www.letterhead.com/bookshop/amazon/lettering1.html](http://web.archive.org/web/20140715052719/http:/www.letterhead.com/bookshop/amazon/lettering1.html)   \n   \nTwo that I recently got on the cheap (~$4 each) and   \nwould recommend:   \n   \nLettering for Reproduction by David Gates   \nThe Art of Hand Lettering by Helm Wotzkow   \n   \n   \nbj\n\n"
    },
    {
      "time": "12 Mar 2004 — 9:27am",
      "content": "Frank   \n   \nThere are various methods of rendering finshed lettering.   \nCalligraphy is of course written spontaneously in a controlled manner, and the more innate talent and control a person has, the more beautiful the effect.   \n   \nLettering for things like type and logos etc. are done with the use of drafting tools, although some very talented people can completely freehand the work with pen and brush. Frederic Goudy notes in his writings that his work was all lettered freehand; even in his sparing use of straight lines. And keep in mind, that white paint is also for the little glitches.   \n   \nSince almost everything I do now is drawn for digital fonts, I need do only a pencil outline for hand digitizing.   \n   \nWhen I did all of my work on board, my method was to draw as perfect as possible a pencil drawing of the work, and then I inked it in with India.   \n   \nI have always needed to use drafting tools to get good work. For this I have a wide selection of plastic circle and oval templates from small to very large. Along with that I have a very old set of twenty or so gentle curves. I am told these are tailor's curves, and my set is made of about 1/16\" hardwood. I recall that I found them in their handsome wood box in \"Tiger Ted's Junk Store\" in a little town near my home. I have found these curves to be very useful in the rendering of long, slight curves, like the flair of stems in letters. This type of tool is still available in aluminum. I do have two or three sizes of French curve tools, but use them rarely. Small curves like serif brackets I have always freehanded.   \n   \nThis is just a bit of personal info from one who has done it for more than 40 years. But you are wise to get hold of all the books you can on the subject, and to get the advice of others who have done inked work.   \n   \nI agree that a calligraphy course is of great value to a type designer, even if you do not intend to do strictly calligraphic work. The practice of writing forms is a fine way of getting your head around how letters come about.   \n   \nThe tools I use are: technical pens, croquill pen, Winsor Newton Series 6 brushes (expensive, and are damaged by India ink, but you need to have good brushes) good quality India Ink, Opaque white designer's colour white or good white-out paint.   \n   \nSome prefer a perfectly smooth hot press board for a super clean line. I have always preferred a very slightly toothed board, because it gives me a little more control, and I like the feel of it.   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "12 Mar 2004 — 11:28am",
      "content": "Mr. Rimmer,   \n   \nWhat software and/or process do you use to digitize your pencil outlines? I've been interested in making better use of my drawings instead of beginning on the computer.   \n   \nThanks,   \nAddison\n\n"
    },
    {
      "time": "12 Mar 2004 — 11:47am",
      "content": "Addison   \n   \nI use IKARUS from URW. The system consists of a tablet, and a hand-piece, with which you hand digitize your outlines.   \n   \nI don't know how widespread is the popularity or use of this program, but I am hearing that other systems are much more in favour.   \n   \nWhatever program you intend to use, I believe that you can start at the drawing board rather than the computer and then scan and/or paste in your outlines.   \n   \nI am ignorant of the workings of other than IK, and have only a passing knowledge of Fontographer, and none at all of the other ones available.   \n   \nI would seek more info before you commit.   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "12 Mar 2004 — 11:55am",
      "content": "Thanks, Mr. Rimmer.\n\n"
    },
    {
      "time": "12 Mar 2004 — 12:33pm",
      "content": "I must put in a recommendation for \"Creative Lettering Today.\" Michael Harvey's book addresses lettering by hand, carved lettering, and digital type design.   \n   \nFor digitizing your letters, I would recommend the ScanFont + FontLab combination. It's not cheap, however. For a lesser investment, TypeTool is a good choice. Of course, given the hundreds of hours you have to put in to make a decent typeface, the cost of tools may seem less extreme.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "12 Mar 2004 — 1:33pm",
      "content": "Addison   \n   \nYour are welcome.   \n   \nName's Jim.\n\n"
    },
    {
      "time": "12 Mar 2004 — 6:51pm",
      "content": "Thomas,   \n   \nHow good is scanfont's autotrace? Does it attempt to put nodes in optimum locations, or does it fit the curve no matter what the beziers look like. (I looked at the videos on fontlab's site, but didn't see much about autotrace).   \n   \nThanks,   \nRandy\n\n"
    },
    {
      "time": "13 Mar 2004 — 12:07am",
      "content": "You can control quite a few variables of the ScanFont autotrace parameters, so you can make those decisions yourself to some degree.   \n   \nWhether or not you even use the autotracing, the main thing I always liked about it is that it has great features for taking in all the scans, slicing and dicing them and populating them in the glyph backgrounds for FontLab.   \n   \nI have not used the latest version of ScanFont, so I am not completely up to date. I haven't really needed it in a long time, so I don't have an excuse to buy it (or get Adobe to buy it for me). For previous versions, I found the autotracing a little frustrating for high-res scans, but I expect a lot depends on the quality of the original sketch or sample.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "13 Mar 2004 — 6:51am",
      "content": "The latest version of ScanFont's autotrace is quite sophisticated. But the real advantage to using ScanFont is its ability to place eps outlines directly into the proper glyph cells in FontLab in one operation.   \n   \nNo more cutting and pasting between Illustrator and font editor.\n\n"
    },
    {
      "time": "16 Mar 2004 — 6:01am",
      "content": "\"outline drawing techniques\", while at college, we were expected to hand render type and found the best way to to it was rather than draw an outline, to start with the interior and work outwards\n\n"
    },
    {
      "time": "18 Mar 2004 — 1:38am",
      "content": "Frank   \n   \ndrawing and writing; was it sayed that this will be important? \\*g\\*   \n   \nA key for me into Typedesign was also the history.   \nI'm not drawing many of my types. Almost a few letter exist on Paper. Im working directly on the computer. I prefer FontLab for this. So learn to handle the BezierCurves. Maybe this is a option for you.   \n   \nScanning and autotracing: YOu have tho clean many. If you have a grafic table than you can put your drawings on it setting the points with the pen. The scetch tool of FontLab could help you by this.   \n   \nGreetings Jens\n\n"
    }
  ]
}
