{
  "id": "34566",
  "title": "Typophile Maintenance Upgrade: Wednesday 20 June",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Jared Benson](http://web.archive.org/web/20080720062147/http:/www.typophile.com/user/3 \"View user profile.\") : 18.Jun.2007 10.09pm \n\nTypophile will be going down on Wednesday, 20 June at 4:00pm PST for a maintenance upgrade. If all goes well, the new Typophile will be back up and ready to go within 24 hours.\n\nThank you.\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080720062147/http:/www.typophile.com/user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": ": 18.Jun.2007 10.09pm",
  "uid": "3",
  "comments": [
    {
      "time": " 21.Jun.2007 10.26pm",
      "content": "Yay, the induced coma has been reversed! :-) Good job guys.\n\nIt’s looking good to me so far (Beorcana is a charmer), although it’s still way  \nslow... :-( My main question for now is: you’ve turned off the editing of posts.  \nWhat’s wrong, Luke?\n\nhhp\n\n"
    },
    {
      "time": " 22.Jun.2007 6.24am",
      "content": "The editing of posts and the IM feature. Was there a reason(s) for these changes in particular?  \nOtherwise, it looks pretty good.\n\n"
    },
    {
      "time": " 22.Jun.2007 6.42am",
      "content": "can we get a list of major changes made? i noticed that the aliases to the wiki articles are not working. were these reset?\n\n"
    },
    {
      "time": " 22.Jun.2007 7.04am",
      "content": "I like the thumbnail avatars at the bottom of the page.\n\nWill the Featured Face change from time to time?\n\n"
    },
    {
      "time": " 22.Jun.2007 8.04am",
      "content": "Like the avatars too.\n\nkeep ending up at the news page from the type designers listing wiki page.\n\n"
    },
    {
      "time": " 22.Jun.2007 8.42am",
      "content": "Why no IM’s?\n\nThe page is still excruciatingly slow to load.\n\nAnd I think the Beorcana on the main pages doesn’t have to SCREAM. It’s much nicer on the thread heads, although still a bit big. I hope the “featured face” will change.\n\nI’m getting used to the thumbnail avatars now that I can see the rollovers but it’s still a little laborious, and if you can’t IM then what’s the point? I really liked the IM feature.\n\n"
    },
    {
      "time": " 22.Jun.2007 8.42am",
      "content": "I’d rather have names than the parade of avatars at the bottom, but what I really miss is IM: not everyone has iChat or something comparable....\n\n"
    },
    {
      "time": " 22.Jun.2007 8.45am",
      "content": "Also, and this is a biggie, you can’t edit your posts anymore. Otherwise I’d have gone back in and added this to my earlier post rather than putting up a new one. I think the type IDers are gonna be pretty pissed at that one - we love going back in and adding links to the IDs.\n\n"
    },
    {
      "time": " 22.Jun.2007 8.50am",
      "content": "I liked the IM too. So much of what I have to say should not be preserved. :-)\n\nhhp\n\n"
    },
    {
      "time": " 22.Jun.2007 8.55am",
      "content": "is this the version of the bug thread for 2007? If so, i have to say that the wiki articles aren’t linking as they did in the previous iteration of typophile. i tried “fixing” the [Designers 2](http://web.archive.org/web/20080720062147/http:/www.typophile.com/wiki/Designers%252B2) page, but just made things worse, luckily i was able to revert everything to how things were, but the linking is still broken.\n\n"
    },
    {
      "time": " 22.Jun.2007 9.11am",
      "content": "i also miss the listing of recently edited wiki entries, i actually found that very useful, esp as someone trying to keep the wiki well-organized.\n\nis that image supposed to be attached to the main wiki page? it seems out of place.\n\nand for the positive: i like being able to jump to the last page of commenting from the first comment in a thread, very nice!\n\n"
    },
    {
      "time": " 22.Jun.2007 9.15am",
      "content": "I love the “featured face” feature.\n\nI agree, the edit post should come back.\n\n"
    },
    {
      "time": " 22.Jun.2007 9.32am",
      "content": "i’ve tried twice to post an article for [Bulgaria](http://web.archive.org/web/20080720062147/http:/www.typophile.com/wiki/Bulgaria), but my postings won’t take. no wiki for me. :(\n\n"
    },
    {
      "time": " 22.Jun.2007 10.03am",
      "content": "I do like the nav at the top for multi-page threads. Still that seems like the only feature that could reasonably be considered an upgrade. The icon parade is just bells and whistles.\n\n"
    },
    {
      "time": " 22.Jun.2007 10.17am",
      "content": "Where’s the RSS for the individual thread?\n\n"
    },
    {
      "time": " 22.Jun.2007 10.22am",
      "content": "The load time is painfully slow for me right now, on top of having slow internet access, so the avatars at the bottom make me sad. Also I noticed, for people like me who don’t use one, I won’t if they are online anymore or not.\n\nText text input resize is nifty however.\n\n"
    },
    {
      "time": " 22.Jun.2007 12.14pm",
      "content": "Thanks for the feedback, all. There are a number of reasons why the upgrade was made, but I’d just like to point out that the effort is on-going. We could have very well left Typophile offline for a few more days to work out the kinks, but we wouldn’t want anyone to miss out on opportunities to discuss various typographic issues :) I will let Christian or Jared speak to details regarding code related and server based problems we are currently facing, but I can assure you that everyone is working hard to fix the bugs and create a better experience for everyone. We recognize the prolems and it is very frustrating for all.\n\nThe slowness we are experiencing is related mostly to our server and again, we are exploring options for upgrading to a server package with enough muscle to support the thousands of users on the site, as well as the millions of pages that Typophile serves up. Here is a comment by Christian from a different, related thread:\n\n“During the upgrade millions of cached records were dumped from the database. It will take a little bit for these caches to be rebuilt. In the mean time the server is taking a beating.”\n\nThanks for your patience.\n\n"
    },
    {
      "time": " 22.Jun.2007 12.29pm",
      "content": "Hopefully not being able to edit posts is a ’bug’.\n\n:-/\n\n"
    },
    {
      "time": " 22.Jun.2007 1.55pm",
      "content": "Edit links are back ;)\n\n"
    },
    {
      "time": " 22.Jun.2007 2.39pm",
      "content": "Thank you!\n\nOK, this is going to sound WAY nitpicky, but on the home page where it shows the most recent post it displays my full name rather than my nickname. Can it be the other way around please? If not, I may delete my full name from my profile.\n\nThe scalable comment window is nice - but it’s also possible that feature existed before and I never noticed it.\n\n"
    }
  ]
}
