{
  "id": "34576",
  "title": "Slow Typophile web server",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Anyone else experiencing slow web server responses. I see that this server gets really slow at some points of day. Sometimes the client even throws a timeout.\n\nAny plans on server upgrades?\n\n [‹ What's your motivation to start designing a new typeface?](http://web.archive.org/web/20081011041734/http:/typophile.com/node/34373 \"Go to previous forum topic\") [Fonts that clip the tops off their a's ›](http://web.archive.org/web/20081011041734/http:/typophile.com/node/34546 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011041734/http://typophile.com/user/18888\" title=\"View user profile.\">litera</a>",
  "time": "<br>",
  "uid": "18888",
  "comments": [
    {
      "time": " 19.Jun.2007 6.36am",
      "content": "\\> Anyone else experiencing slow web server responses.\n\nYes.\n\n"
    },
    {
      "time": " 19.Jun.2007 7.41am",
      "content": "\\> Anyone else experiencing slow web server responses.\n\nYes. All the time.\n\n"
    },
    {
      "time": " 19.Jun.2007 9.43am",
      "content": "Yes, me too – all the time.\n\n"
    },
    {
      "time": " 19.Jun.2007 10.52am",
      "content": "Who is the administrator of this? AFAIK Typophile is taking donations, So I guess they could pay for better either server, either line or both. Depends what’s causing the problem.\n\nAdministrators? Anybody here?\n\nIn the end it may be on the user experience wether someone likes a site or not. It may be so distracting (especially when getting timeouts) to users that they may just surf somewhere else.\n\nI like this site A LOT and I don’t want it to reject members from participating because it’s slow.\n\n"
    },
    {
      "time": " 19.Jun.2007 12.05pm",
      "content": "Indeed, we are experiencing some server issues, and we are looking into coming up with a solution. We also have thousands of users on the site at any given moment, unfortunately causing a bit of a lag, especially during high traffic hours (early morning and late afternoon, PST).\n\nWe will make an official announcement today, but Typophile will be coming offline tomorrow afternoon to implement some much needed system upgrades.\n\n"
    },
    {
      "time": " 19.Jun.2007 12.44pm",
      "content": "We’ve had poor server performance as part of our “free” sponsored mediaTemple hosting service. Unfortunately, we’ve banged our collective head on the ceiling of server performance and storage space virtually since the beginning of our partnership arrangement. Requests to improve this have not yielded us an acceptable response, so we’re in process of moving over to a paid hosting package to give us better server muscle and lots of server space for some cool new features we’d like to roll out.\n\nPlease note that Wednesday’s maintenance upgrade will focus on Typophile’s codebase, not on server platform, so this problem may persist for another few weeks. We find it incredibly frustrating too (remember, we’re users too!) so please bear with us.\n\n"
    },
    {
      "time": " 19.Jun.2007 11.08pm",
      "content": "Thank you. At least we know something is going on in this area too. Great news actually.\n\n"
    },
    {
      "time": " 22.Jun.2007 3.10am",
      "content": "It’s now slower than ever. And BTW - where has ’next forum topic’ gone?\n\nNick Cooke\n\n"
    }
  ]
}
