{
  "id": "34571",
  "title": "Cyrillization of a typeface",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello everybody. I have a client (graphic designer) who is interested in the cyrillic version of one of Type-Ø-Tones typefaces.  \nWe proposed them to do custom work. As we are not russian or ukranians we will receive the help of a Russian type designer.  \nMy question has to do with licences. What exactly has to cover my proposal? Only the development costs for “Cyrillization”? or also the usage licences for their final client as well? If so, how many? If not, what would be the proportional costs for additional licensing of this font?\n\nI'd appreciate any help from you\n\nThanks!\n\nLaura\n\n",
  "author": "laura meseguer",
  "time": "19 Jun 2007 — 3:25am",
  "uid": "14267",
  "comments": [
    {
      "time": "19 Jun 2007 — 5:58am",
      "content": "Absolutely include the licenses, but then the question is whether the Cyrillic version will be exclusive for that client, or whether you are going to make it available for the general public via Type-Ø-Tones.\n\n"
    },
    {
      "time": "19 Jun 2007 — 12:03pm",
      "content": "I think the first thing you should do is contact Type-Ø-Tones and get permission to extend their design. They should be the ones offered the Cyrillization work first. If they are not interested in doing, at least they should give you their blessing.\n\nJames\n\n"
    },
    {
      "time": "19 Jun 2007 — 12:33pm",
      "content": "I would agree with James <cite>if the Cyrillic design will be heavily Latinized</cite>, which  \nactually happens to be something I wouldn't generally encourage. If it will  \ninstead be an authentic Cyrillic design, there are many good reasons to, at  \nmost, simply inform the original designer of what's happening. In this case  \nthough this is moot since Laura is part of Type-Ø-Tones. :-)\n\nThe enrichment of a writing system should not  \nbe held hostage, certainly not to somebody else's  \ngreed or to some Modernist illusion.\n\n--\n\nBTW, \"Cyrillization\" (\"Cyrillification\"?) is a misleading term here.\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2007 — 1:36pm",
      "content": "<cite>The enrichment of a writing system should not<br>\nbe held hostage, certainly not to somebody else’s<br>\ngreed or to some Modernist illusion.</cite>\n\nThat is the funniest thing I have heard this year!\n\n"
    },
    {
      "time": "19 Jun 2007 — 1:41pm",
      "content": "Statistically, my chances of amusing you to an even greater  \ndegree before the end of the year seem pretty decent. Yay.\n\nhhp\n\n"
    },
    {
      "time": "20 Jun 2007 — 12:45am",
      "content": "Actually, if you look at the Type-Ø-Tones website, you see that Laura is with them. That should have been made clearer in the original post.\n\n"
    },
    {
      "time": "20 Jun 2007 — 1:16am",
      "content": "Hello everybody, I'm a member of Type-Ø-Tones, sorry for not explaining this.\n\nLaura\n\n"
    }
  ]
}
