{
  "id": "34586",
  "title": "Can I replace one glyph in Meta Normal?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I am working with dynamic text in Flash, and I cannot size one text character differently than others of the same text string. There is literally no realistic workaround to reduce the size of the trademarks(TM), So...\n\nI want to crack open the font (Meta Normal), resize the \"TM\" glyph, and seal it back up to use.\n\nAssuming I have the tools with which to do this, would it violate the license?\n\nI would be using this font within an ad agency to create Flash banners for a client.\n\n",
  "author": "brain works",
  "time": "19 Jun 2007 — 10:35am",
  "uid": "19187",
  "comments": [
    {
      "time": "19 Jun 2007 — 11:16am",
      "content": "This is a phrase from the license of FontFonts (Meta is a FontFont):\n\n2.6. You may not modify, adapt, translate, reverse engineer, decompile, disassemble, alter, or attempt to discover the source code of the Font Software. If you want to make modifications to the Font Software, you must obtain the prior written consent of FSI.\n\n"
    },
    {
      "time": "19 Jun 2007 — 11:35am",
      "content": "How many pixels high are you working? You could use the TM from a system font, say Lucida Grande or Trebuchet. If it's small enough the design won't matter much on screen.\n\n"
    },
    {
      "time": "19 Jun 2007 — 12:49pm",
      "content": "Unfortunately when you embed a font in flash you are already modifying, translating, reverse engineering, decompiling, disassembling and altering the software. The same is true when you convert curves to outlines. I've never liked this kind of EULA.\n\n"
    },
    {
      "time": "19 Jun 2007 — 1:10pm",
      "content": "This kind of EULA should get a public flogging.  \nFLOG, FLOG, FLOG.\n\nHere's an idea, if you really want to respect the EULA: do a convert-to-oulines on the TM in illustrator and put the result in a new dummy font with just that glyph in it, enlarged. If they say a convert-to-outlines is illegal, then you know to really ignore them.\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2007 — 7:03pm",
      "content": "FontFont's EULA didn't always contain this clause, so the answer may depend on when you licensed the font. Do you have a record of the EULA that you agreed to?\n\n"
    },
    {
      "time": "22 Jun 2007 — 10:43am",
      "content": "Thanks for all your responses. I'm not the one who bought the font, so I don't have a copy of EULA.\n\nWith dynamic text fields in Flash, you can only specify one font and one size per text string. That's why those workarounds you mentioned won't work.\n\nI can't believe it violates the license to embed the font into Flash...? That's crazy, for what are we supposed to use these fonts? And to convert it to outlines violates it as well..? It sounds like they make everything against the rules to cover themselves.\n\n"
    },
    {
      "time": "22 Jun 2007 — 11:01am",
      "content": "\\> for what are we supposed to use these fonts?\n\nI would suggest to use other fonts! :-)  \nAnd let them know you did that.\n\n\\> to convert it to outlines violates it as well..?\n\nNot necessarily, and not realistically. Some EULAs, when read carefully,  \nseem to imply that, but it's hard to imagine anybody wanting to actually  \ndo anything to stop it.\n\nhhp\n\n"
    },
    {
      "time": "22 Jun 2007 — 3:45pm",
      "content": "\\> for what are we supposed to use these fonts?\n\nYou can use it in any Flash document as look as the text isn't editable.\n\n\\> to convert it to outlines violates it as well..?\n\nNot at all. Only if you generate a new font based on FF Meta.\n\n"
    },
    {
      "time": "22 Jun 2007 — 3:47pm",
      "content": "\\> Only if you generate a new font\n\nThe EULA says way more than that.  \nLike how would you interpret \"decompile\"?\n\nhhp\n\n"
    },
    {
      "time": "22 Jun 2007 — 3:48pm",
      "content": "\\> Only if you generate a new font\n\nThe EULA says way more than that.  \nLike how would you interpret \"decompile\"?\n\nhhp\n\n"
    },
    {
      "time": "22 Jun 2007 — 6:33pm",
      "content": "\\> Like how would you interpret \"decompile\"?\n\nIt certainly doesn't mean it can't be outlined. It's simply a protection against derivative fonts.\n\nBrian, feel free to [contact FontShop](http://web.archive.org/web/20131012192149/http:/www.fontshop.com/about/contact_us.php) about your specific needs to be sure the license affects your project.\n\n"
    },
    {
      "time": "22 Jun 2007 — 6:46pm",
      "content": "Stephen, think like a lawyer for a second (because that's who would be  \ngiving Brian a hard time, not you) and try to define \"decompile\" for me.\n\nCertain people are trying to scare users away from opening the  \nstuff in FontLab. Lawyers aren't about the law, they're about fear.\n\nhhp\n\n"
    }
  ]
}
