{
  "id": "3458",
  "title": "Eurostile goes along with?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I\n\n",
  "author": "peterc",
  "time": "5 Mar 2004 — 2:21am",
  "uid": "2496",
  "comments": [
    {
      "time": "7 Mar 2004 — 3:55am",
      "content": "no?\n\n"
    },
    {
      "time": "17 Mar 2004 — 3:17am",
      "content": "Really no suggestions or people just tired of damn Eurostile?;)\n\n"
    },
    {
      "time": "17 Mar 2004 — 3:43am",
      "content": "Peter is the text you are using going to be varible? If so, you answered your own questions because you need a font most people have on their browsers, like Verdana/Helvetica\n\n"
    },
    {
      "time": "17 Mar 2004 — 3:54am",
      "content": "Daniel I use Arial/Helvetica as body text. What I need is suggestions to the type to be used on images, grafics, quotes and so on. You follow?   \n   \nThis could offcourse be set in Eurostile as well, but I dont quite know......   \n   \nIdeas?;)\n\n"
    },
    {
      "time": "17 Mar 2004 — 8:49am",
      "content": "Peter look at using eurostyle extended but in all lowercase, I've seen it done before and it looks cool. It breaks up the very square look of eurostyle. If you want contrast in look you might look at Font Bureau's Agenda or Berthold's Imago\n\n"
    },
    {
      "time": "17 Mar 2004 — 4:46pm",
      "content": "Thanks Daniel. I do find the mix with Agenda a bit odd though, but it\n\n"
    },
    {
      "time": "18 Mar 2004 — 3:20am",
      "content": "Think contrast Peter like opposing orange and blue.\n\n"
    },
    {
      "time": "18 Mar 2004 — 6:53am",
      "content": "Frederik, I could imagine that both Zapf and Egytienne would match Eurostile, as body text on printet materiale. In my case though, I can\n\n"
    },
    {
      "time": "18 Mar 2004 — 9:34am",
      "content": "Peter, are you recommending Melior? Hey, that's a superb match - I'll have to remember that. And you've also made me think of Egyptian 505 (again).   \n   \nhhp\n\n"
    },
    {
      "time": "18 Mar 2004 — 1:02pm",
      "content": "A Garalde, such Adobe garamond, Sabon Next and others, or Adobe Caslon should contrast well. Or any Goudy faces.   \n   \nSomething not constructed in fact.\n\n"
    },
    {
      "time": "3 Apr 2004 — 2:24pm",
      "content": "Sorry for the delay, but thanks for your help.   \n   \nI\n\n"
    },
    {
      "time": "4 Apr 2004 — 5:17am",
      "content": "I'm doing work on the Spider-Man 2 marketing and Eurostile is one of their approved fonts, along with Mata by T26, Register by Device, Bauhaus, and one other that escapes me right now.\n\n"
    },
    {
      "time": "4 Apr 2004 — 1:26pm",
      "content": "Georgia ?\n\n"
    }
  ]
}
