{
  "id": "34601",
  "title": "Serif font with a small hyphen?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for a free serif font that has a short (low-profile) hyphen. I am creating an open source font for Gregorian chant ( [http://www.marello.org/projects/caeciliae](http://web.archive.org/web/20131022052741/http:/www.marello.org/projects/caeciliae \"http://www.marello.org/projects/caeciliae\")) and I am interested in recommending other free fonts that would work well for the accompanying text. Some very basic requirements:\n\n- short hyphen (these come up a lot in the chant text, and smaller = less obtrusive)\n- acute accented æ and œ if possible (in case those don't come out correctly, they're ae and oe ligatures)\n- other standard ligatures would be a great plus\n\nI like Cardo, but wow: it has a long hyphen.\n\nThanks for any thoughts or recommendations. -B. Matthew\n\n",
  "author": "phatmatt",
  "time": "19 Jun 2007 — 6:53pm",
  "uid": "18021",
  "comments": [
    {
      "time": "19 Jun 2007 — 7:22pm",
      "content": "Well, regarding the long hyphen in Cardo, you could horizontally compress its hyphen to the size you want (if that's possible in whatever program you're working in). Since it's just a straight horizontal line in Cardo, there shouldn't be any distortion as there normally is when compressing or expanding glyphs.\n\nA free font that I've heard good things about is [Gentium](http://web.archive.org/web/20131022052741/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=Gentium), but I don't know whether its hyphen is any shorter.\n\n"
    },
    {
      "time": "19 Jun 2007 — 9:16pm",
      "content": "Here is gentium (words copied from the link you gave)\n\n ![](http://web.archive.org/web/20131022052741im_/http:/typophile.com/files/gentium_6076.gif)\n  \nThe ae and oe ligatures are there as well as ae accented. \n"
    },
    {
      "time": "20 Jun 2007 — 7:17am",
      "content": "An additional remark: Gentium comes in roman and italics only . You can find (pdf) specimen and proofs at the bottom of this [link](http://web.archive.org/web/20131022052741/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=Gentium_download).\n\n[edit] I mean there is just one weight (there is no bold roman, no bold italics)\n\n"
    }
  ]
}
