{
  "id": "34610",
  "title": "Importing a custom Encoding/Character set (This a problably a dumb question, sorry)",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi!!\n\nIn FL5, when I open a font and select to show the full character set as NAMES \\> IMPORTED. How can I save that and create a new font based on that character set and arrangement of gliphs?\n\nthks in advance ;)\n\nFabio\n\n",
  "author": "haag",
  "time": "20 Jun 2007 — 9:07am",
  "uid": "2079",
  "comments": [
    {
      "time": "20 Jun 2007 — 10:10am",
      "content": "Menu: Glyph / Glyph Names / Save Encoding\n\n"
    },
    {
      "time": "20 Jun 2007 — 10:12am",
      "content": "Hmmmm.\n\nChrisL\n\n"
    },
    {
      "time": "20 Jun 2007 — 12:49pm",
      "content": "Mmm?\n\n"
    },
    {
      "time": "20 Jun 2007 — 1:00pm",
      "content": "John,  \nJust that I didn't realize that a custom encoding could be saved and I was just \"marking\" the page so it would end up on my list of threads. \"Hmmm\" was as brilliant as I could come up with at the moment :-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Jun 2007 — 12:09am",
      "content": "Mmm'kay.\n\n"
    },
    {
      "time": "22 Jun 2007 — 12:11am",
      "content": "Then it’s only saving the encoding of the yellow glyphs. Is there a way to save the entire encoding, so including the new, grey glpyhs?\n\nPieter\n\n"
    },
    {
      "time": "22 Jun 2007 — 3:48pm",
      "content": "If you switch the Font Window to Glyph mode, you should be able to save the whole set as an encoding, but that presumes that the glyph order in the font corresponds to the imported character set. I think it should, but if not you might need to drag the glyphs around in glyph mode to get them in the order you want.\n\n"
    },
    {
      "time": "23 Jun 2007 — 5:08am",
      "content": "Thanks John.\n\nPieter\n\n"
    },
    {
      "time": "23 Jun 2007 — 5:10am",
      "content": "It works, but I think you mean index mode.  \nThanks again!\n\nPieter\n\n"
    },
    {
      "time": "23 Jun 2007 — 2:24pm",
      "content": "Yes. It used to be called Glyph mode in earlier versions of FontLab, and is stuck in my brain as that. This mode exposes the raw Glyph Index order of the font, i.e. the actual order in which the glyphs are stored, independent of encoding.\n\n"
    }
  ]
}
