{
  "id": "34646",
  "title": "Does the headline font have to be so BIG and so BOLD????",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Beorcana is a lovely font, but my ears are ringing, proverbially speaking. Why not go for a lighter weight that doesn't scream so loud.\n\nAre you planning to rotate the featured font (lovely idea)?\n\n",
  "author": "<a href=\"/web/20100911090146/http://typophile.com/user/3275\" title=\"View user profile.\">pattyfab</a>",
  "time": "<br>",
  "uid": "3275",
  "comments": [
    {
      "time": "",
      "content": "And maybe it's me, but it really takes forever to load: I get a vanilla thread topic and then a long pause before it pops up as Beorcana.\n\n"
    },
    {
      "time": "",
      "content": "I gotta say the icon parade is kind of problematic too - especially when there are users who don't have icons and the grey T pops up. But really, do I have to remember which guy in the cowboy hat is which and whether hrant is the right eye or the left eye?\n\nBut since the IM feature seems to have disappeared I guess this isn't a problem.\n\n"
    },
    {
      "time": "",
      "content": "If you think you guys are having troubles, try using an old Mac with OS 9!!\n\nI can't get pages to open; I can't get an indication that my posts made it without getting a timeout or error message message(even though the post worked). The site is S-L-O-W-E-R than one of our Northwest slugs. Even when I retarted my computer into OS X with Mozilla everything seems so painfully slow. I had to Stop loading a page, just to try something else.\n\nI think the animated icons are killing the pages, as Patty's comment implies. What's wrong with using the names? Content is more important than showiness. Why did we lose IM's?\n\nYou know there is a time for Flash and there is a time for using 'K.I.S.S.' Don't you think a forum that deals with inanimate image posts, and wants as many contributors as possible (not just those with hot new computers) is the time to go for Simple?\n\nYou know, the last time we 'upgraded' some of us (like me) lost capabilities at this site. It seems that you have done it again, and I can't see anything that we have gained, except maybe the indication of how many posts are new.\n\nPlease try not to make this site a technology test site, OK? I'd like to keep participating without having to buy a new computer.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I also like the idea of the rotating font - it could be interesting, and the site will often have a fresh look.\n\nProblems, though:  \nThe icons instead of logged in user names. What will happen when there are 63 users (as there are sometimes)? I have to remember where I put my keys; keeping track of all those icons and who's who will paralyze my brain.\n\nAnd since there's no more IM or on-line users as a list, it seems it doesn't make any difference WHO is here at a particular time, so why not lose the icons altogether?\n\nI would also like to have the option of editing a post again. Was there a reason for that to disappear?\n\n"
    },
    {
      "time": "",
      "content": "I have a feeling it's not Flash that's making things slow. Any sort of web page with a lot of simultaneous hits is going to bog down unless the server (or multiple servers) can handle it. Perhaps it's time for Typophile to upgrade its hosting package.\n\n\\> I'd like to keep participating without having to buy a new computer.\n\nWhile I empathize with many of your points, Mike, you'll be saying this to more and more site admins with each day that passes. So few users are running OS9 that nearly _every_ site that upgrades will leave you behind. I feel like buying you that iMac again!\n\n"
    },
    {
      "time": "",
      "content": "Well, SOMEthing has changed. I've visited Typophile when there were many, many threads going on, posts coming in and lots of activity all at once, and it was never THIS slow before. I am hitting either \"post comment\" or even \"refresh\", and I am checking my email, reading scores on ESPN, etc. before the screen refreshes. It's just tedious.\n\nAnd I hate to complain; this has always been a terrific site, and I'm sure a thankless project to manage. But if it's going to be this slow, with fewer capabilities than before, it's just not going to be very enjoyable.\n\n"
    },
    {
      "time": "",
      "content": " **Feedback:**\n\n• I also like the idea of the site featuring revolving fonts.\n\n• Miss the IM.\n\n• It is slow.\n\n• Don't miss the editing feature. I always felt the ability to edit one's post after the fact caused confusion to other thread readers.\n\n• I like the added navigation to the original post when a thread goes to multi-pages.\n\n"
    },
    {
      "time": "",
      "content": "Hey folks: There's a thread specifically set up for these comments/complaints (Bug Report). The new version of Typophile is very advanced technically and took mountains of programming time. More fun content and functions already, and more coming, as I understand it. Did you look in the Resources area? They do need to move to a more robust hosting arrangement, but they know that.\n\n"
    },
    {
      "time": "",
      "content": "I notice the search function doesn't seem to be working anymore.\n\nAs for the icon list of active users, I like that. The user names show up when I hover the pointer over the icon, and in truth it is much more compact than a text list.\n\nDid the IM feature have to go though? I rarely used it, but only because the entry field was so small it was hard to recognize as a messaging tool. When I did use it it served quite handily, though.\n\nThe esit feature really needs to come back, at least to allow correction of typos. A lot of errors get through even with dilligent previewing before posting. Maybe some sort of time limit on edits would be an effective comprimise.\n\nI like the use of Beorcana in the headlines, but I agree in some places it looks too big.\n\n"
    },
    {
      "time": "",
      "content": "_The esit feature really needs to come back, at least to allow correction of typos._\n\nyou mean the _edit_ feature? (sorry, couldn't resist \\>^p )\n\n"
    },
    {
      "time": "",
      "content": "You see what I mean?\n\n"
    },
    {
      "time": "",
      "content": "<cite>The new version of Typophile is very advanced technically</cite>\n\nIt loads as well as an octogenarian camomile-drinking grandma would drive a Porsche _– Apologies to all octogenarian camomile-drinking typophilic grandmas._ Regardless of the many new flashy features, if it loads slowly, people will tire quickly.\n\nI’m also not fond of the disappearance of the “edit” feature.\n\nOn a positive note; I love the alternation of typefaces being used on the site. Hats off. I never really used the IM, so I don’t miss it. Some obviously do. As I explore the new features further I’m sure I’ll warm to them.\n\n"
    },
    {
      "time": "",
      "content": "\\> simultaneous hits\n\nExcept traffic has been very low since the re-launch...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "To answer pattyfab's original question, yes, the plan is to rotate the headline font on a regular basis, and hopefully provide great exposure to new font releases. Watch for news on this and other cool features once we've patched a few post-launch jitters.\n\n"
    },
    {
      "time": "",
      "content": "About the slow load times: pages should speed up considerably as things are cached. During the upgrade millions of cached records were dumped from the database. It will take a little bit for these caches to be rebuilt. In the mean time the server is taking a beating.\n\n"
    },
    {
      "time": "",
      "content": "\"What will happen when there are 63 users (as there are sometimes)?\"\n\nIMO, the more icons the better :) If it is critical to know exactly who is logged in at any given moment, you can roll over the icons for user names.\n\n"
    },
    {
      "time": "",
      "content": "<cite>The new version of Typophile is very advanced technically and took mountains of programming time. More fun content and functions already, and more coming, as I understand it.</cite>\n\nI'd like to know what these new advances are - maybe I'm missing something. To me the only significant advances are the nav at the top and the number of new posts. Both useful but not what I'd call a major upgrade. Yes, the icons and the \"featured font\". And the little link at the top to the most recent post. But the losses - IMs, editing, search - those are big. And the slow loading time, if it doesn't improve, is going to drive users away.\n\nDoes someone want to elaborate on some of the other new functions so we know to check them out?\n\n"
    },
    {
      "time": "",
      "content": "Yeah- like patty said.\n\nAnd I don't know why, but the scroll-over icon thing doesn't give me the user name. I just get a blue line beneath the icon.\n\nAnyway, like I said before, I don't want to keep complaining about it. It just doesn't seem as useful and friendly as it did before, so I'll just check in when I really want to ask a question.\n\n"
    },
    {
      "time": "",
      "content": "Dear All,\n\nWhat pathetic whining. How much do you pay for access to Typophile?\n\nIt is amusing that every time a newspaper launches with a set of new typefaces you all compliment the design while regular readers of the paper send hundreds of letters to the editor complaining about boldness of the new type. Pot, meet the kettle.\n\nI for one am thankful to the Typophile developers, administrators and sponsors. Long live Typophile! Down with the cry babies!\n\nI hope that I will be able to buy a round of beers for the Typophile development team at TypeCon to honor their efforts. Will you all be there? I haven't been to Seattle in years. Can anyone recommend a good sports bar?\n\nSincerely,  \nRandolph T. Burke\n\n"
    },
    {
      "time": "",
      "content": "Don't worry, we gripe at other designers too. Randolph I guess you missed the thread about the London 2012 Olympic logo.\n\n"
    },
    {
      "time": "",
      "content": "Funny, that dog is so cute.\n\nBTW: [http://typophile.com/membership](http://web.archive.org/web/20100911090146/http:/typophile.com/membership \"http://typophile.com/membership\")  \nYou may want to hold that beer money.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_If you think you guys are having troubles, try using an old Mac with OS 9!!_\n\nLoud and clear, bowfinpw! Are you having trouble loading the homepage? 'Cause I found that in OS 9, going straight to the Forums page is a lot quicker (albeit less fun):\n\n**http://www.typophile.com/cms/forums**\n\n"
    },
    {
      "time": "",
      "content": "Then again, OS9 is 8 years old!  \nIt's ancient. ;)\n\n"
    },
    {
      "time": "",
      "content": "Randolph, thanks for the nice words - the development and design team does work pretty hard and will continue to despite the negativity. :) The Typophile team will indeed be in Seattle, and I for one would gladly take you up on the offer.\n\nPatty, your troubles with the site are known issues and we are working to resolve them. We have one primary developer (genuis) who codes everything by hand (after work hours) and to my knowledge has spent the last two days solid rebuilding the database from scratch because of some incompatiblity issues with our server and the new version of Drupal. Little things may have been lost along the way and there are things that we intentionally changed about the design.\n\n"
    },
    {
      "time": "",
      "content": "_I hope that I will be able to buy a round of beers for the Typophile development team at TypeCon to honor their efforts._\n\nam i the only one that thinks that's funny?\n\n"
    },
    {
      "time": "",
      "content": "<cite>am i the only one that thinks that's funny?</cite>\n\nDon’t you dare mock beer, Paul. That’s just not cool.\n\nUnless it’s a product of Anheuser Busch or Coors. But those aren’t really beer to begin with.\n\n"
    },
    {
      "time": "",
      "content": "No.\n\n"
    },
    {
      "time": "",
      "content": "Featured Face:\n\nCarl, you missed a few kern pairs there, pal :-)\n\n"
    },
    {
      "time": "",
      "content": "To be fair, embedded flash fonts don't do kerning.\n\n"
    },
    {
      "time": "",
      "content": "I thought there was a way to do it.  \nI remember Ultrafonts doing it with Mana.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I wish there was a way to do it. Maybe the Typophile programmers will put it on their list....\n\n"
    },
    {
      "time": "",
      "content": "Perhaps only monowidth fonts should be eligible?\n\n"
    },
    {
      "time": "",
      "content": "Or only US designers.\n\n"
    },
    {
      "time": "",
      "content": "I like Beorcana as a headline type. It would be nice to see rotating fonts though, would give a little extra to the site.\n\nThe site is slower then other sites on my computer but it's always been a slow sites. Often it dosen't load at all just leaves a white screen. So I think that's a server/traffic problem.\n\nI agree that the Who's Online section with icons is unnecessary having just the names is enough. It's a small feature, not important and it should'nt have the attention that it has now.\n\nI have another small thing that really bothers me but it has nothing to do with the site update. It's been like this since i joined a few months ago. In the Forum the first section that I click on, if I've scrolled down the page jumps up to the top immediatley when I click, missing the topic I try to click on and I end up somewhere else. So I have to go back and click on the right one. This also happens the first time I try to click on a topic. I'm guessing it's either a Flash or CSS bug. Very annoying.\n\nOtherwise I like the site, it's fresh and easy to use. Excellent work.\n\nP.S.  \nThe little effect you got on the Comment field where you can resize the field, I LOVE IT.\n\n"
    },
    {
      "time": "",
      "content": "I like the iconic roster at the bottom. As to not being able to tell who is who by icon, a mouseover effect shows the name (in IE at least).\n\n"
    },
    {
      "time": "",
      "content": "@ Paul: No, that is very funny.\n\n"
    },
    {
      "time": "",
      "content": "_I hope that I will be able to buy a round of beers for the Typophile development team at TypeCon to honor their efforts._\n\ni thought this was funny because i doubt many of them drink... (i know one who would appreciate it tho)\n\nif anyone else has bugs/complaints/comments, please put them in the [Bug Thread](http://web.archive.org/web/20100911090146/http:/typophile.com/node/34693).\n\n"
    },
    {
      "time": "",
      "content": "The heads look SO much better in the lighter weight, THANKS!\n\n"
    },
    {
      "time": "",
      "content": "Hmm... Maybe I should slap together a really ugly, unbalanced font and offer it to the Typophile staff for headlines. Then that'd REALLY be worth complaining about!!! I'm quite enjoying Beorcana in this function. It is holding my interest until I can scrape together enough pennies to buy meself a license...\n\n"
    },
    {
      "time": "",
      "content": "Could the powers that be please create a new forum just for graphic designs and type based art? Just a place where we can dump our type wonderings...\n\n ![](http://web.archive.org/web/20100911090146im_/http:/typophile.com/files/StencilPunkFont_3599.jpg)\n  \n...like my bold new Stencil Graffiti font, and all other tuff to explain _stuff_.\n\nAnd yeah, I realize the pedestrian functionality of the exsisting forums can serve as a usefull dumping ground, but wouldn't it be great if it were all in one place.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "",
      "content": "There's an experimental section in the critiques. If you aren't interested in critiques but just want to share what you've been working on, you can post your work on your user blog. The blogs are a perfect place for the collective type stream of consciousness.\n\n"
    },
    {
      "time": "",
      "content": "Paul, It took me a minute ( okay a few days) but now I get it.\n\n"
    },
    {
      "time": "",
      "content": "Alex, you may not have to scrape any more; \"Std\" versions on the way very soon.\n\n"
    },
    {
      "time": "",
      "content": "So what's the difference between a Std and a normal version of a font? Reduced character set?\n\n"
    },
    {
      "time": "",
      "content": "OT Std is like PS or TT, just converted to OT format so it becomes cross-platform. So you could call Std \"normal\".\n\nOT Pro is cross-platform plus alternates, small caps, swash, oldstyle figs, aligned punctuation, possibly large, Central European language support, and any other bells and whistles the designer wants to add, plus the feature code to make it easy to use all those glyphs. So you could call Pro \"extra\" or \"expert\", but since mostly they're called Pro, I'm using that name in the new versions.\n\n"
    },
    {
      "time": "",
      "content": "_What pathetic whining. How much do you pay for access to Typophile?_\n\nWhat's that got to do with anything?\n\n_The new version of Typophile is very advanced technically and took mountains of programming time._\n\nWhat's that got to do with anything?\n\nWhy is every redesign NOT an improvement? This reminds me of what used to be called \"The Big Three\" automakers. Whining about \"legacy costs\" while still producing cars that are ugly, not as fuel efficient or as reliable, and don't handle as well as the competition. I'm sure it takes as much work to execute a poor design as well as a good one. Maybe the \"technically advanced programmers\" are in the wrong business. I guess in the end it's about having vision. Or not.\n\nWhen I couldn't buy a font at multiple locations, I was lambasted for having IE 5.5. Now it's Mike Yanega's turn to get dumped on because he's using OS9. Obviously it's too hard for the \"technically advanced programmers\" to make things backwards compatible. Even Blu-Ray and HD DVD players are backwards compatible. Well, I have my own opinion as to what (or who) is backwards.\n\n_Edit:_ I just found out that if I enlarge the font in my new Firefox browser (in the forum index) it can overrun the right-hand column (\"Support our sponsors\") and it looks just like IE 5.5. Was this done to ease my transition to Firefox? This does NOT happen within threads themselves.\n\n ![](http://web.archive.org/web/20100911090146im_/http:/typophile.com/files/Duh!_4146.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\\> OT Pro is...\n\nNot to derail this thread, but there are varying definitions of this label. Adobe and FontFont define \"Pro\" as a font with extended language support. Their basic OT fonts have the added glyphs and features. Other foundries use \"Pro\" to label their fonts with extra features.\n\n"
    },
    {
      "time": "",
      "content": "\\>Adobe and FontFont define “Pro” as a font with extended language support.\n\n… and Monotype, and Linotype, and…\n\n"
    },
    {
      "time": "",
      "content": "Beorcana, as perty as it may be, looks silly in this context. It seems shoehorned into position for its own sake, not for the sake of readability or whatever. It's understandable, on the other hand, if a rotation of sponsored fonts starts up, but I've yet to see it.\n\n"
    }
  ]
}
