{
  "id": "3470",
  "title": "Afton",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "This is a pixel font I have been working for a few weeks. I am part of the class of the class from UW-Stout placing their specimens over in the Display forum.   \n   \nThis typeface shows the truth of spoken word through voice stress recognition.   \n   \nThis is optimized for the screen because initially I wanted to use this as an option on a television that would listen to broadcast voices and determine the truth of the statements(ie State of the Union Address).   \n   \nIt is aesthetically influenced generally by Blackletter faces based on the decorative nature and its past use as the dominant typeface in one regime. ![afton](http://web.archive.org/web/20150317112130im_/http:/www.typophile.com/forums/messages/29/28009.jpg)   \n   \nAll comments are welcomed.   \n   \njp\n\n",
  "author": "blackbirdsings",
  "time": "5 Mar 2004 — 4:05pm",
  "uid": "3063",
  "comments": [
    {
      "time": "5 Mar 2004 — 7:14pm",
      "content": "Unless this will be set pretty large (which seems unlikely if it's supposed to transcribe a full speech and stuff), it's too light: TV fonts need to have much more body, especially in the horizontal (ie vertical stems).   \n   \nBut the idea itself is pretty cool, and I like the blackletter basis too.   \n   \nOne more thing: if you can make the two variants \"uniwidth\" (where a given character has the same set-width in either font), that'll help you dynamically swap in one of the font styles for a single word or something without affecting the rest of the setting: less movement, more readability.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Mar 2004 — 12:32pm",
      "content": "I agree the face does not have body enough to be displayed on television. This is my first pixel font and i can't say it has been hard getting this going, but adequately building this with another pixel in terms of thickness is something I have not gotten to understand.   \n   \nActually the nature of the \"false\" set is to change the legibility, to make it difficult to read. Lies are disguised and distorted versions of the truth. When I was building the alternate face I was trying to lose information and make it harder to read. It then turns out that the forms became related further to Blackletter and the underlying theme of Nazi \"truth\".   \n   \nYet, you do have a good point with the uniwidth. I don't know if it can be possible in contrast to my overall goal to show the lies in speech. I had an older version based off of Scala Sans where the forms were exploded, stems fell over, etc., but the overall width changed still.   \n   \nMaybe I could if they flatten out a little bit, with a little less pitch. I'll see if it is possible.   \n   \nthanks   \n   \njp\n\n"
    },
    {
      "time": "6 Mar 2004 — 12:47pm",
      "content": "\\> the nature of the \"false\" set is to change   \n\\> the legibility, to make it difficult to read.   \n   \nOr you could say that lies are meant to make us _more comfortable_! So maybe the honest font should be a bit harsh while the dishonest one should be all soft and flowery.   \n   \nBTW, be careful of associating blackletter with fascism - that itself perpetuates an untruth.   \n [http://www.typophile.com/forums/messages/4077/11682.html](http://web.archive.org/web/20150317112130/http:/www.typophile.com/forums/messages/4077/11682.html)   \n   \nhhp\n\n"
    },
    {
      "time": "6 Mar 2004 — 9:10pm",
      "content": "Yeah I have thought of that also. Turning it around and making lies look pretty as seen in our current communications. I look at both perspectives and don't see one more favoring than the other in terms of approach. It seems that lies that are soft and flowery people would understand and similarily vice versa.   \n   \nUpon further review I rescind my comment I made before about the use of blackletter type in Germany during WWII. My facts were not straight and for any inconveinences I apologize. I guess I should also round out my type history.   \n   \nWhat about the type forms as a whole? I don't want to get some big head because the type guys at Typophile didn't give me any comments about the letter forms.   \n   \n   \njp\n\n"
    },
    {
      "time": "6 Mar 2004 — 11:37pm",
      "content": "First thing is, have you ever seen a one pixel line in television? It doesnt work. (period). the scaning makes it jump around like a crack whore. (excuse the.. well)   \n   \nA face that works well for screen (TV is what I'm talking here) is one with some balls, one with open counters. It really needs to have a little substance to be halfway ledgible.\n\n"
    },
    {
      "time": "7 Mar 2004 — 2:17am",
      "content": "I think I would raise the crossbar of the true t one pixel.\n\n"
    },
    {
      "time": "15 Mar 2004 — 3:23pm",
      "content": "Well I have gone back to the drawing board of sorts and tried to thicken this up.   \n   \nI have so many questions about pixel fonts that I have I don't even know where to start. I am concerned that I need to stick to this screen-based font, otherwise it loses its meaning. Its like chocolate chip cookies without the chips.   \n   \n ![](http://web.archive.org/web/20150317112130im_/http:/www.typophile.com/forums/messages/29/28635.jpg)   \n   \nWhen I posted in the build forum about how to approach this I got a bunch of responses, but none that I could make any sense of. Sort of type geek talk with em units being thrown all around and debate between type designers, but not directed toward a \"beginning\" student in type design.   \n   \nSo I have some questions:   \n   \nHow does everyone else build their pixel type? Fontlab, Illustrator, other? Can I build a pixel font in Illustrator?   \n   \nWhat should I be using if I don't have Fontlab available and only Fontographer?   \n   \nIf I am building in a program like illustrator what is a general grid that I should set up to effectively make a readable pixel font?   \n   \nOther considerations I should take into mind? In simple terms if at all possible.   \n   \nAnd finally what is going on with this face. Ideas, critique, etc.   \n   \njp\n\n"
    },
    {
      "time": "16 Mar 2004 — 3:05pm",
      "content": "Hey, pixelfonts are a hack, so it's technical!   \nBut your Fontographer is plenty.   \n   \nVisualize the font's vertical space (\"EM\") spanning a number of pixels onscreen -depending on point size and dpi- and you can figure out how your font's \"space\" needs to be structured.   \n   \nFor example a font with an EM of 1000 (the norm) set at 8 points at 72 dpi will have a \"pixel block unit\" of 1000/8 = 125. In your case it looks like you have a vertical span of around 16 pixels\\*. That doesn't divide into 1000 roundly. What you can do is either go up to 20 (so have pixel blocks 50x50), or have some \"internal leading\": like have blocks of 60x60, which means you use 16 x 60 = 960 units of the EM for the letterforms, and that leaves 40\\*\\* units empty. Then when you go to use the font you use the point size you targeted (like 20, or 16).   \n   \n\\* I'm counting top-to-bottom of the lc, which is the most useful measure.   \n   \n\\*\\* It's best to distribute this blank space more to the top than the bottom, like 30/10 in this case.   \n   \nThere are also other issues though, like overlaps/touching between blocks, internal spaces coming out black instead of white, etc.   \n   \nAs for the font itself, allow me to leave that to others - I have my own bitmaps to finish! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "16 Mar 2004 — 8:33pm",
      "content": "Yeah so I finally figured it out. One's self is always the best teacher. I actually used the 20 pixel measurement you quoted above. I built the initial face and it looks great(clear and crisp) at 20 pixels, points, whatever.   \n   \nI hate math and wish to avoid aspects of it at all costs, but I got it and hopefull there will not be so many wasted entries next time. I appreciate all your help Hrant and you other folks.   \n   \n\\*\\* I was looking at Cranbrook's 2D department site and saw some pixel type inspiration along the lines of mine.   \n   \n [http://cranbrookart.edu/2d/](http://web.archive.org/web/20150317112130/http:/cranbrookart.edu/2d/)   \n   \njp\n\n"
    },
    {
      "time": "7 Apr 2004 — 4:52pm",
      "content": "Well I am getting closer to hopefully finshing this. Its new name is Insidior (latin for treacherous or I suppose insidious). Taking in all the considerations that have been suggested I presume this has a better chance of delivering my original intentions.   \n   \nIf you need to know what those were, you can look at the first post.   \n   \nPixelfonters unite and give me some advice.   \n   \njosh   \n   \n ![](http://web.archive.org/web/20150317112130im_/http:/www.typophile.com/forums/messages/29/32902.jpg)   \n   \n   \nSorry if it is a little blurry. Not much I can control from Illustrator.\n\n"
    }
  ]
}
