{
  "id": "34708",
  "title": "TypeCon2007 Early Registration Now Open",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": " **TypeCon2007: Letter Space**  \nAugust 1-5, 2007  \nCrowne Plaza Hotel  \nSeattle, Washington USA\n\n_presented by The Society of Typographic Aficionados (SOTA)  \nin partnership with Cornish College of the Arts, the School of Visual Concepts, and the University of Washington_\n\nNow’s the time to register for TypeCon2007! This exciting and affordable conference will be held August 1-5 at the Crowne Plaza Hotel in downtown Seattle. TypeCon2007 is a jam-packed week presentations, exhibitions, hands-on workshops, and special events.\n\nTypeCon2007 features more than 75 speakers, including Marian Bantjes, David Berlow, Roger Black, Robert Bringhurst, Veronika Burian, Leslie Cabarga, Matthew Carter, Art Chantry, Tim Girvin, Bruce Hale, Akira Kobayashi, Kevin Larson, Robynne Raye and Michael Strassburger, and Ilene Strizver. TypeCon2007 explores type for the screen, custom newspaper fonts, Mexican lettering, Arabic calligraphy, Czech type, design for the Northwest music scene, font format wars, dirty type, and more.\n\nSpecial events include a type and design education forum, the Typophile Film Festival, an international exhibition of type, design, and letterpress, and the Seattle premiere of Gary Hustwit’s indie documentary, “Helvetica.” TypeCon2007 attendees are guaranteed seats at the Helvetica screening, which has sold out in almost every city so far.\n\nSOTA is committed to bringing you a high-quality and affordable conference. Conference registration and workshop fees are the lowest you’ll find at an event of this quality in North America. Early-bird discounts are offered to all attendees registering by June 29. Join SOTA while you register for the conference, and receive an extra discount!\n\nTypeCon2007 will offer a variety of great presentations and panel discussions, focused hands-on workshops, tours, special events, an international exhibition of new type and design, and more.\n\nConference fees are as follows:\n\n**Early registration (through June 29)**  \nSOTA members: $215 professionals/$120 students  \nNon-members: $250 professionals/$140 students\n\n**Regular registration (June 30-July 20)**  \nSOTA members: $245 professionals/$140 students  \nNon-members: $285 pro/$160 students\n\n**Late/walk-up registration (after July 20)**  \nSOTA members: $300 professionals/$160 students  \nNon-members: $350 pro/$175 students\n\nOptional pre-conference workshops are $50 for each half-day session and $100 for each full-day session, plus materials/lab fees, if any. The Type and Design Education Forum is $50, which includes all general sessions and your choice of breakout.\n\nSecure registration is now available on the TypeCon2007 website. Seating is limited - register today to book your spot!\n\nDirect link to TypeCon2007 registration - [http://www.sotalink.com/registration](http://web.archive.org/web/20080408135514/http:/www.sotalink.com/registration \"http://www.sotalink.com/registration\")\n\nTypeCon2007 website - [http://www.typecon.com](http://web.archive.org/web/20080408135514/http:/www.typecon.com/ \"http://www.typecon.com\")\n\n [‹ Cyrillic questionary booth](http://web.archive.org/web/20080408135514/http:/www.typophile.com/node/34265 \"Go to previous forum topic\") [question on Bell gothic ›](http://web.archive.org/web/20080408135514/http:/www.typophile.com/node/34694 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080408135514/http://www.typophile.com/user/107\" title=\"View user profile.\">tamye</a>",
  "time": "<br>",
  "uid": "107",
  "comments": [

  ]
}
