{
  "id": "34714",
  "title": "new to cyrillic letters",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "hello,\n\nI just made cyrillic letters for my font. I wonder if some native \"cyrillic\" people could have a look at them.\n\n[http://www.schriftgestaltung.de/daten/OTFontTest\\_Graublau\\_Sans\\_Cyrill.pdf](http://web.archive.org/web/20131012055957/http:/www.schriftgestaltung.de/daten/OTFontTest_Graublau_Sans_Cyrill.pdf)\n\nmany thanks in advance,\n\nGeorg Seifert\n\n",
  "author": "schriftgestalt",
  "time": "25 Jun 2007 — 5:19am",
  "uid": "8183",
  "comments": [
    {
      "time": "25 Jun 2007 — 7:06am",
      "content": "i'm no expert in Cyrillic, but a few things i noticed:\n\nthe Д is completely wrong, it's missing the baseline and the descending strokes  \nit is very good that you didn't just double the К to make your Ж, but these two should share a similar structure. I might try adding the horizontal connecting stroke to your К.  \nThe descending stroke on Ц and Щ is too short, IMO, as is the flag on Ъ.  \nthe same comments apply to the lowercase and SC versions of these letters.  \nthe vertical stroke of the Ф could benefit from overshooting the capline/baseline, esp in the heaviest weights.\n\n"
    },
    {
      "time": "25 Jun 2007 — 8:44am",
      "content": "I'm neither a native nor an expert, but: I would  \nmake it more Cyrillic and less Swiss; like I would  \ngive a curl to one of the arms of the \"K\".\n\nhhp\n\n"
    },
    {
      "time": "23 Aug 2007 — 2:18am",
      "content": "hello Reetsde,\n\ni am native cyrillic reader, and generally i like your cyrillic. i disagree with Hrant about curved arms -- it is not any requirement at all.\n\nfirst of all, you need to draw a capital Д -- now you have Л on this place ))  \nyour black seems almost good, but i think you need to reduce blackness in small ovals in в, ь, з and similar letters. м also looks too dark, and л looks too light for me.  \ni think you need make similar forms for upper and small Лл Дд and i like less rectangular form (like your lc). small descenders in д, Цц, Щщ in light and normal is far away from letter body, and ш and щ is too wide themselves. i think you need to double left vertical stem of л in д and make its conjunction with lower horizontal so curved. i'd like to see narrowed ю (like a Ю), wider Жж, higher Ф, and better balanced Зз.  \ncan you try to add some upturn for acsender in б?\n\nsorry for my english, and good luck!\n\n"
    },
    {
      "time": "23 Aug 2007 — 8:17am",
      "content": "Who said anything about \"requirement\"?\n\nOften, making certain parts of Cyrillic forms straight and not curved is a symptom of the desire to be more Western and less Russian. Quite ironically -as John H once astutely noted- natives tend to suffer from this more than outsiders (speaking more broadly than only concerning Cyrillic).\n\nhhp\n\n"
    },
    {
      "time": "23 Aug 2007 — 2:23pm",
      "content": "dear Hrant,\n\nmy english is so bad and i am sorry for inaccuracy words, that i use here.  \ni think that all curved arms is gimmick of some russians (look ie. [this article](http://web.archive.org/web/20131012055957/http:/eldesign.ru/write/azbuka/letter_k) if you read russian) when they want to come far away from latin. curved arms has some historical roots in russian typographic tradition, but plain arms has historical roots too. and after all -- cyrillic is not means russian, you know ;))\n\n"
    }
  ]
}
