{
  "id": "34722",
  "title": "thoughts at the close of 3rd ICTVC, Thessaloniki",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In 2004 I was inspired enough to write [some kind of report](http://web.archive.org/web/20120612005009/http:/typographi.com/000867.php) for typographi.ca. This year, I have no organised notes, but it was important to me to put down something, as a way of expressing gratitude to everyone involved, and also to begin a thread where other attending typophiles can add their own remarks.\n\nThe single most powerful impression that the conference made on me was how much the discipline of typography is a \"distributed\" project - a worldwide collaboration of diverse individuals. (To veterans of the world type community this idea may seem obvious and banal, but since I am just an unknown provincial and don't belong to academia, it strikes me afresh. I am not even a practicing typographer at the moment, having decided to take a break from the mad, mad world of small studio design and advertising.)\n\nThe Thessaloniki conference thus brings a remarkably diverse group of individuals and interests together. Dr Klimis Mastoridis' opening remarks emphasised this point, that the event is of value to all community members: those in related industries, the artists, makers and users; the engineers and tool makers; and researchers, writers and students. The underlying idea, which came through strongly to me, is that together as a wide community we are making a distributed \"attack\" on a field which itself seems infinitely large.\n\nWhere else could you meet a wood type historian with particular interest in Extreme Reverse Shadeds (David Shields), one of the very few working punchcutters (Dan Carr), Karel van der Waarde who warned us of the communication catastrophe that is pharmaceutical packaging inserts (can they be modelled on aircraft safety cards, I wonder?), an OpenType geek hacking on the outer limits (Richard Kegler), Arafat al-Naim - an expert in Arabic logotypes, and Dan Reynolds who we'll remember as \"the Bank Gothic guy\". Who knew that the two world authorities on the Spanish tilde - Andreu Balius and José Scaglione - could make the topic so entertaining; as were Stiff's Notes on what people do when they need to hand-scrawl maps or directions; and dozens more lit up, one by one, small windows of a massive cathedral. The message is that everyone has something to contribute, somewhere.\n\nAn emphasis on history is hardly misplaced. David Shields mentioned, and I also feel, that young digital-era students and designers more than ever need access and encouragement to explore the history and traditions of the craft they employ every day. It may surprise some to learn that we are even now losing artefacts of _digital_ typographic history - but I think those who are older than I am will quickly agree, on reflection. This is the result of generations of rapid technological change... so there is a great need for preservation and intelligent study. Of course we heard at the conference about one great exception, the Plantin-Moretus museum, but elsewhere in the world it is almost impossible to keep the past from slipping through our fingers (as I've personally seen with letterpress, hotmetal and digital era artefacts). So the conference reinforces a vital reverence for this history, and gives us some access to it.\n\nIt was therefore very timely that Dr Karow's keynote recapitulated the stages of digital typographic development and, like most of the speakers, pointed towards \"what still needs to be done\". It's a pity that he did not use the stage to plug his books on the subject, which IMHO should be among the required reading for typographic students. As software incorporates each new layer of sophistication, the machanisms become invisible. What was once done manually becomes automated. Perhaps 2007 is a good moment to take stock and refresh ideas of what might constitute a thorough typographic education.\n\nA thought that occurred to me more than once during the lectures was a permanent online home for the presentations and related material.\n\nThe conference also makes sure that we feel the inclusiveness and tolerance of the international typo-visual world, where dilettantes like me can rub shoulders with the real architects and authorities. In this sense it is more than just a metaphorical 'typographic heaven'.\n\nPS. Please note there is a [Flickr group](http://web.archive.org/web/20120612005009/http:/www.flickr.com/groups/ictvc2007/) devoted to the conference.\n\n",
  "author": "qu1j0t3",
  "time": "25 Jun 2007 — 8:46am",
  "uid": "5052",
  "comments": [
    {
      "time": "26 Jun 2007 — 1:33am",
      "content": "I [enjoyed](http://web.archive.org/web/20120612005009/http:/www.typeoff.de/?p=173) the conference as well. It is too bad that more Typophiles weren't able to make the trip… it would have been nice to see Hrant in person at a Mediterranean conference again. Maybe some more attendees will chime in here?\n\n"
    },
    {
      "time": "26 Jun 2007 — 10:53am",
      "content": "_OpenType geek hacking on the outer limits_...hmmm. There could have been a less kind summary so I will take that as a positive review. Meanwhile I still haven't signed up for a flickr account so [here](http://web.archive.org/web/20120612005009/http:/www.p22.com/photoalbum/ictvc3/ictvc3.html) are some uncaptioned pictures from sweltering but amazing Thessaloniki.\n\n"
    },
    {
      "time": "26 Jun 2007 — 1:56pm",
      "content": "_...hacking on the outer limits...sweltering..._\n\nWith pith helmet and machete.\n\n"
    },
    {
      "time": "26 Jun 2007 — 2:40pm",
      "content": "Hi Richard, I actually tried several different wordings. \"Pushing the envelope\" was one that came to mind. \"Making experiments on the fringe\" was rejected. Outer Limits it is. (\"We control the horizontal. We control the vertical...\") But in any case, someone has to make the tech do things that were never thought of (a font that answers questions?! - I wonder what the metal type analogy is) which inevitably expands the space of things that can then be thought of.\n\n"
    },
    {
      "time": "27 Jun 2007 — 5:44am",
      "content": "The more I read it, the more I do like it!  \nHow did Nick know i was wearing a pith helmet? I thought all cameras were confiscated at the door?\n\n"
    },
    {
      "time": "27 Jun 2007 — 1:10pm",
      "content": "\\>I thought all cameras were confiscated at the door?\n\nOnly at the belly dancing bar ;-)\n\n"
    },
    {
      "time": "29 Jun 2007 — 3:05am",
      "content": "Simon means cameras SHOULD have been confiscated at the door...\n\n"
    }
  ]
}
