{
  "id": "34748",
  "title": "When does faux Chinese style lettering show up? 19th Century?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "When does faux Chinese style lettering show up? 19th Century?\n\n ![](http://web.archive.org/web/20100124082249im_/http:/typophile.com/files/stjamescc_5089.gif)\n\n",
  "author": "<a href=\"/web/20100124082249/http://typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": "",
      "content": "Too funny.\n\nI would say soon after the gold rush.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The gold rush is early 20th century I think.\n\nAnybody else?\n\n"
    },
    {
      "time": "",
      "content": "\\> The gold rush is early 20th century I think\n\nDepends which one you mean. Most people think of the gold rush that populated California ... which started with the discovery of Gold in 1848 and the big rush starting in 49. Which would be mid 19th.\n\n"
    },
    {
      "time": "",
      "content": "Alastair Johnston (Alphabets to Order) dates a Cleveland example to 1887, hot on the heels of Gilbert & Sullivan's _The Mikado._ Faux-Japanese; is there a distinction?\n\n"
    },
    {
      "time": "",
      "content": "Not really. Even in today's LA most people can't tell the difference.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I see.\n\nAnd now I have done some more research the Gold rush here in Alaska runs from the 19th to the early 20th.\n\nWhat I know is that a huge number of these display faces were invented in the 19th century. But I was not sure about the 1st use of this specific kind. It might come from the 1920's...\n\nWho is the typophile with the most history?\n\n"
    },
    {
      "time": "",
      "content": "hey Nick. I didn't see that!\n\nOf course there are differences. Many. But not such that they would show up in this kind of faux face. This kind of thing is too far removed from either tradition for the differences to be felt.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100124082249im_/http:/typophile.com/files/susan_6227.jpg)\n\nThis is the title page from a children's book of 1912 (yes, the colors are that subtle).  \nI'd say it shows the connection between the East, art-nouveau, and more general layout and letterforms of that era. Not to mention modernism, but surprinting letters over colored discs...  \nOr perhaps it's the other way around, and the author/illustrator just liked to mash things up.  \nBut really, after the wheel starts spinning, what's the diff?\n\n"
    },
    {
      "time": "",
      "content": "That example doesn't seem all that close to me.\n\nBut it's nice to see all the same. I can readily appreciate that the art nouveau folks would be interested in drawing on Japanese & chinese style.\n\nYou know if anything I think this most recent image draws on Japanese Hiragana for inspration rather than the Chinese Kanji. See especially the 'ji'\n\n ![](http://web.archive.org/web/20100124082249im_/http:/typophile.com/files/hiragana2_4546.gif)\n\n"
    },
    {
      "time": "",
      "content": "I just thought of a german book of display faces I have to consult. I'll let you know if I find something.\n\n"
    },
    {
      "time": "",
      "content": "\\>is there a distinction?\n\nThe Chinese characters used for print have no circular strokes, and differ in this way from the Japanese Hiragana that Eben shows. They are straight, cornered, and curved with various terminals, but never circular. Chinese cursive writing or 'grass script' does have circular strokes but it is not normally printed as text. Incidentally, Kanji is the Japanese translation of Hanzi, the Chinese word for their characters.\n\n"
    },
    {
      "time": "",
      "content": "Hopefully we're talking about \"orientalized\" Latin fonts,  \nwhere there really is no difference, certainly not among  \nthe \"users\" of such typography.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I particularly like the way she (Price Hacker) has aligned the I and A with left verticals, for a kind of \"flush left, angled right\" style.\n\n_doesn’t seem all that close to me._\n\nPerhaps, but an alternative version of fitting type to rigorous layout constraints would be more \"constructed\" -- the genre that connects Mackintosh's \"geometric\" Art Nouveau with Van Doesburg's de Stijl lettering. In relation to which, her lettering has a spare and deft gestural looseness that is more Eastern in feeling. Or you could say it was feminine, but that's a whole nother dimension of politicization...\n\n"
    },
    {
      "time": "",
      "content": "<cite>..where there really is no difference, certainly not among<br>\nthe “users” of such typography.</cite>\n\nYes, the user is unlikely to have an awareness of some kind of lingering miasmatic chineseness or japanesseness. I agree Absolutely.\n\nAs far as observable formal differences: they are still observable - linking them with formal traits in traditional writing is easy. Bill is off to a good start.\n\nNick: You can say 'femme' if you want - as far as I am concerned.\n\n"
    },
    {
      "time": "",
      "content": "Vincent Van Gogh used faux-Asian lettering in several of his Japonisme paintings in the late 1870s.\n\nHe was certainly aware of the difference between \"Chinese-ness\" and \"Japanese-ness\" although he combined faux-Japanese 'style' English lettering with nonsense Japanese(-ish)characters in a few drawings and paintings.\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20100124082249/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\")\n\n"
    },
    {
      "time": "",
      "content": "I'm pretty sure I've seen faux-Asian fonts in the ATF collection that date at least back to the 1890s.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Some old \"Oriental\" magician posters, around 1914, with faux Chinese style lettering\n\n[Old oriental magician poster](http://web.archive.org/web/20100124082249/http:/www.magicgallery.com/images/sooribbons.jpg)  \n [More magician posters](http://web.archive.org/web/20100124082249/http:/www.circusmuseum.nl/eng/) in the magician section\n\n"
    },
    {
      "time": "",
      "content": "Thomas, Excellent! Now were getting somewhere!\n\nThanks IIrène, JLTastic,\n\n"
    },
    {
      "time": "",
      "content": "My german book of types has no dates... I will have to keep looking.\n\n"
    },
    {
      "time": "",
      "content": "The 1925 BB&S catalog shows three faces called Japanet, Pekin, and Bamboo. None of them is truly oriental, but seem to evoke an Eastern exoticism. MacGrew reports that each was originally designed in the late 1800s -- 1893, 1888, & 1889, respectively. Each was also originally marketed under a different name, having nothing to do with the Orient -- Wedge Gothic, Dormer, & Freak, respectively.\n\nClearly, BB&S was trying to tap a trend. ATF later recast some of these in 1954.\n\n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Here are some informations and pictures of [japanese books](http://web.archive.org/web/20100124082249/http:/www.baxleystamps.com/litho/hasegawa.shtml#1st_ed_1-2printings) published in Japan for Westerners around 1890 and the [Tokyo Tsukiji Type Foundry](http://web.archive.org/web/20100124082249/http:/www.baxleystamps.com/litho/tsukiji_type.shtml) who made the fonts.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100124082249im_/http:/typophile.com/files/eq_1891_2ed_cvr_5912.jpg)\n\nOne of the Tsukiji books.  \nNice the way the typography reflects the subject matter.\n\n"
    },
    {
      "time": "",
      "content": "Nick: Nice one. The T & P seem to be prefiguring the model nicely.\n\nThis example maybe even more so:\n\n ![](http://web.archive.org/web/20100124082249im_/http:/typophile.com/files/ogawa_art_folio_5353.jpg)\n\nLook at the A and R. ( 1898 )\n\n"
    },
    {
      "time": "",
      "content": "Perhaps mentioned already, and I might paraphrase incorrectly, but there was a trade embargo at that time which was lifted making travel to the Far East much easier. I think this is where the onslaught began. The Aesthetic movement was deeply infatuated with it all.\n\n"
    },
    {
      "time": "",
      "content": "Tell us more Tiffany! In What year? CDid it have to do with the Russo-Japanese war?\n\n"
    },
    {
      "time": "",
      "content": "Ok, I'll say it: Chinoiserie.\n\n[http://en.wikipedia.org/wiki/Chinoiserie](http://web.archive.org/web/20100124082249/http:/en.wikipedia.org/wiki/Chinoiserie \"http://en.wikipedia.org/wiki/Chinoiserie\")\n\n"
    },
    {
      "time": "",
      "content": "Just an observation/question... When you see the examples posted so far, do you think they look at least vaguely Chinese/Japanese?\n\nBeing Korean, I am quite familiar with the Chinese and Japanese scripts, and can't force myself to look at them that way at all. From my cultural background, I honestly couldn't have guessed from appearances alone that the 'faux-Chinese/Japanese' lettering was meant to evoke the appearance of Chinese or Japanese scripts.\n\nThe only reason I even knew that this sort of lettering style was meant to be used in contexts that had to do with East Asia was by association; I saw it often used in conjunction with kungfu and samurai themes, Chinese/Japanese restaurants, etc. It took some reflection to even come up with the notion that the lettering was mimicking the East Asian scripts; 'Hmm, the strange modulated curves _could_ resemble the strokes of East Asian calligraphy to those who are not familiar with the scripts,' I thought, not entirely convinced of my own conclusion.\n\nThe thing is, there is some quite convincing faux-Japanese lettering out there, some of which at first glance might even fool me into thinking that I'm looking at some genuine Japanese kana. But none of the examples posted so far look really Chinese/Japanese to me. To my mind, this type of lettering really belongs to its own genre besides the more overtly faux-Japanese lettering style, which seems to have come in vogue more recently, possibly owing to anime culture.\n\n"
    },
    {
      "time": "",
      "content": "\\> do you think they look at least vaguely Chinese/Japanese?\n\nIn fact to an outsider\\* they look _literally_ oriental!  \nIt's like when I was called a \"damn Iranian\" one time,  \nand was surprised they couldn't tell the difference.\n\n\\* How do you say gai-jin in Korean?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think cultural background has a lot to do with it Brian, it looks more to me like taking a stroke of a chinese painting of a section of bamboo and using that stroke to create letterforms, however, being repetitively informed that this is what latin characters would look like if rendered by a chinese calligrapher it has become a shorthand, that designers reinforce by using it for anything that vaguely references the Orient. I would imagine that many europeans were exposed to chinese script in the 18th century (and before) from the trade with Portugal, Holland and Britain in tea and pottery (and opium).\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "I have a copy of 17th c. book by a missionary in China whose drawings of what he saw included drawings of Chinese characters, many but not all of which are actually identifiable. Oh look, it's available on line now...\n\n[http://shl.stanford.edu/Eyes/china/](http://web.archive.org/web/20100124082249/http:/shl.stanford.edu/Eyes/china/ \"http://shl.stanford.edu/Eyes/china/\")\n\nOk, it was worth downloading the djvu plugin. (This book even has a 'notes from the typographer' section). In the picture I am unable to insert, the characters at A, C, G, & I are 'drawn'; even our missionary's earnest efforts resemble the 'bamboo' fonts more than they resemble chinese writing.\n\n"
    },
    {
      "time": "",
      "content": "Ok, here is the image\n\n ![](http://web.archive.org/web/20100124082249im_/http:/typophile.com/files/kpic_3726.jpg)\n\nThe horizontal strokes in ACEGI should be much straighter, although at a slight angle, vertical lines in E, I should be very vertical.\n\n"
    },
    {
      "time": "",
      "content": "Jessica Helfland has a related article on Design Observer, called [**Why Is This Font Different from All Other Fonts?**](http://web.archive.org/web/20100124082249/http:/www.designobserver.com/archives/025809.html)\n\n"
    },
    {
      "time": "",
      "content": "Speaking of Chinoiserie, that suggests a good font name should I decide to create a faux Chinese font (although Shinn being such a good Korean name, it would be faux Korean :-)\n\n\\*\\*\\*\n\nAs an aside, certainly in the 18th century the influx into Europe of Calico fabric and Porcelain goods brought with it oriental graphics, which interacted as the Baroque became Rococo. Nothing faux about Fournier, of course, but I suppose it's like all \"influence\" in type design -- done poorly it's crass plagiarism, done well, respectful homage.\n\n"
    },
    {
      "time": "",
      "content": "What a load of bunk. Not only does Helfand imagine seeing the Hebrew script in a font that's decidedly nothing of the sort, but she spends too much energy condemning some playful Latin display fonts instead of worrying about the Latinization of Hebrew text. And Neuland was \"faux naif\"?! Complete ignorance about how Neuland was really made. And then there's the requisite Modernist codswallop about \"ethnic equivalence\", ohmmmmm. What a load of opportunistic, short-sighted crap that passes for critical thinking. Pisses me off.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I have a bunch of comments to make now but not much time. So I will limit myself to a single observation for now. The reason that this faux chinese style looks so faux to the insider is that it uses only one of the 8 classic stroke types used in Chinese. The one used for the down & left.\n\nHere is a link to see it & the others if you are keen.\n\n[http://www.chinavoc.com/arts/calligraphy/eightstroke.asp](http://web.archive.org/web/20100124082249/http:/www.chinavoc.com/arts/calligraphy/eightstroke.asp \"http://www.chinavoc.com/arts/calligraphy/eightstroke.asp\")\n\nI have seen the stuff Jongseong is talking about & the reason it works so well ( at hiding it's fauxness) is that\n\n- it uses all the stroke types/kinds  \n - it uses Chinese rules ( or nearly) for assembling the letters into radicals with which to make up the finished glyph.\n\nI will try to find a reference to it. It easier to see & understand than to read about & understand.\n\n"
    },
    {
      "time": "",
      "content": "What about Fusaka?\n\nBTW, my Chinese calligraphy book says there are 6 basic strokes.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Perhaps any type that looks \"brush drawn\" seems somewhat Oriental to Westerners.\n\nFor instance, Auriol, Hiroshige (of course), and perhaps flare-styles like Optima, Laudatio, and Beorcana.\n\nAuriol (c.1900), because of its Art Nouveau/Aesthetic era provenance, and the disconnected nature of the strokes, more so than the others.\n\n"
    },
    {
      "time": "",
      "content": "Here is a comparison of the characters drawn by the missionary with a modern font with brush-style appearance. You can get a good idea of how weak and floppy his drawings are. (Properly speaking, characters are written, not drawn.)\n\n ![](http://web.archive.org/web/20100124082249im_/http:/typophile.com/files/comparebamboo2_6535.png)\n\nHrant, 8 is a number I see more often. This is only relevant to brush method; components of the character are talked about in radicals, of which there are more than 300.\n\nOne of the biggest differences is that in Chinese calligraphy the brushes are very soft, so there is zero resistance as you are writing. But you do have to pay attention to how the brush tip flicks around. That's very different from using a calligraphic pen. This contributes to (but isn't the determining factor in) a very different esthetic.\n\n"
    },
    {
      "time": "",
      "content": "Hrant : What is Fusaka?\n\nRE: Strokes: Probably you go from 6 to eight by dividing off the strokes with a hook and the bend/twist stroke. Is that what's happening Hrant? Actually this kind of division is no more ( or less) useful than talking about Antiqua vs Geralde vs transitional. It isn't that the categories are without merit, it's that they can't do complete justice to the reality.\n\nBTW I can't quite support the idea of faux Chinese fonts being Chinoiserie. I don't think they contain enough intellectual room for all that baggage. They way they are used could make a piece Chinoiserie, or not. I admit this is a lot like my attitude about supposedly 'post modern' fonts which are also misnamed.\n\n<cite> Perhaps any type that looks “brush drawn” seems somewhat Oriental to Westerners. </cite>\n\nI think that's mostly correct.\n\nJongseong, how do you feel about the faux stuff? Does it offend you? I was going to relate how my Pal Jeff, who is a Chinese American feels but I am curious to hear from you.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.adobe.com/type/browser/P/P\\_1325.html](http://web.archive.org/web/20100124082249/http:/www.adobe.com/type/browser/P/P_1325.html \"http://www.adobe.com/type/browser/P/P\\_1325.html\") \\_  \n [http://www.myfonts.com/fonts/linotype/fusaka/](http://web.archive.org/web/20100124082249/http:/www.myfonts.com/fonts/linotype/fusaka/ \"http://www.myfonts.com/fonts/linotype/fusaka/\")\n\nBTW, it's the only Morisawa winner that Adobe actually picked up.  \nNot even Twombly's Mirarae had that privilege.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"BTW I can’t quite support the idea of faux Chinese fonts being Chinoiserie.\"\n\nI mentioned Chinoiserie as a probably historical starting point for the emergence of faux Chinese roman letterforms. Sorry for not clarifying. Chinoiserie's importance goes beyond its role as an artistic movement; in Enlightenment Europe, especially England and France, the Chinese imperial system was taken to be highly advanced politically. Rousseau thought that China's system of government most closely represented rule by a philosopher king. This valuation of China then had its influence on artistic and then popular spheres. I wouldn't completely equate Chinoiserie with orientalism, as the latter has a stronger ideological edge.\n\nFusaka, according to its own description, follows Chinese not with imitated brushstrokes, but by making each letter fit into a square. The extra lines and dots are based on portions of characters, as are many of the letters. The aesthetic of Chinese characters requires each character to be balanced in the context of a square. (Chinese fonts are of course monospaced.) And then in calligraphy, demands for overall page color will influence interaction between characters, especially in the highly cursive 'grassy' styles. In Fusaka the extra dots for example in the J and L make more sense in the context of a square.\n\n"
    },
    {
      "time": "",
      "content": "Fusaka certainly makes a great deal more sense as you explain it now. Thanks!\n\nRe: Chinoiserie, again you make a great deal of sense there. What I should clarify is that I do not reject the idea that a links can be made. Instead I am maintaining (until I hear a convincing arguement to the contrary) that a font cannot contain or represent anything that complex in itself. That it might show the impact of such a thing is on the other hand a completely acceptable idea to me. My quibble was about the nature of a font rather than about Chinoiserie per se - which I still know far to little about!\n\n"
    },
    {
      "time": "",
      "content": "Ooh, the thread (along with Typophile) is back.\n\nTimd : <cite>it looks more to me like taking a stroke of a chinese painting of a section of bamboo and using that stroke to create letterforms</cite>\n\nThis explanation makes the most sense to me. Reminds me, too, of a Chinese bamboo painting (attributed to Guan Yu, I think) which is in fact a poem/message in disguise: the characters are formed by bamboo leaves. I saw a stele in the 'Stele Forest' in Xian, China that replicated this painting, and I took a photo of the rubbing (apologies for the blurry shot):\n\n ![](http://web.archive.org/web/20100124082249im_/http:/typophile.com/files/bamboopoem_6092.jpg)\n\nClever piece of art, but not what Chinese writing usually looks like.\n\nSo I guess this is a case of taking a design element unrelated to script from a culture. A comparable hypothetical example would be if one took the Greek maeander and based a Latin typeface design on it to evoke Greekness.\n\nWhen I say faux-Japanese, [this](http://web.archive.org/web/20100124082249/http:/991.com/newGallery/Linkin-Park-In-The-End---Live-203058.jpg) is closer to what I'm talking about--lettering that actually imitates Japanese scripts.\n\nThe canonical model for basic strokes in Chinese calligraphy is based on the character 永. Depending on how you separate the strokes, you can get either eight or six, I think.\n\nEben: <cite>Jongseong, how do you feel about the faux stuff? Does it offend you? I was going to relate how my Pal Jeff, who is a Chinese American feels but I am curious to hear from you.</cite>\n\nI take it you mean culturally offended and not, you know, because of bad kerning or whatever. When I see the bamboo-stroke-type faux-Chinese lettering, I just think it's a bit kitsch, but not really offensive. I simply don't know enough about it to find anything offensive. As I said, I'm barely familiar enough with it to know that it's supposed to evoke East Asian culture in the first place.\n\nFrom my Korean/international background, my take on Chinese/Japanese culture will be very different both from those approaching from a Western cultural background and from Chinese/Japanese backgrounds. I am also curious what a Chinese-American take on faux-Chinese lettering would be like. Do Chinese-Americans embrace this style, or reject it because of whatever reason?\n\n"
    },
    {
      "time": "",
      "content": "From Sojin Kim & Somi Kim, \"Typecast: Meaning, Culture, and Identity in the Alphabet Omelet,\" _Lift and Separate_ (New York: 1993), 32. (Found mentioned in a comment attached to the _Design Observer_ article linked above.):\n\n\"In 1867 one of the earliest pseudo-Japanese fonts was patented in America. This alphabet, known as _Mikita_, consists of three-dimensional letterforms suggestive of wood or lacquer work. Rather than actual mimicry of other alphabets, the first fonts that drew on the Far East in their letter structure were more reflective of concurrent art/design movements (artistic printing, the aesthetic, arts and crafts, international symbolist, art nouveau). [fn: N. Gray, _History of Lettering_, 175] Informal writing styles and brush scripts, particularly Chinese and Japanese, also began to affect character shapes. Around 1885, a font called _Japanese_ appeared in England, perhaps the first font to allude directly to Japanese or other East Asian culture through the design of letters that evoke the calligraphic brushstrokes of Asian writing. [fn: N. Gray, _19c Ornamented Typefaces_, 101, 220] Despite the visual integrity and ingenuity of many of these alphabets, Western letterers' mimicry of calligraphic strokes used by other writing traditions inevitably fails to refer correctly to the \\*ductus\\*, or order and direction of strokes, of the different traditions.\"\n\n(And in the second footnote: \"_Mikita_ was produced by the type foundry D. & G. Bruce, New York, 1867, and offered as _Novel_ by the English type foundries Austin Wood, c. 1868, and Figgins, c. 1883. A face called _Chinese_ was offered in a supplement to the Bruce specimen book in 1879. _Japanese_ was produced by the English type founder Sir Charles Reed, c. 1885.\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks Craig!\n\nNow if We can find some samples....\n\n"
    }
  ]
}
