{
  "id": "34769",
  "title": "Greyscale serif",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": " ![](http://web.archive.org/web/20150414060951im_/http:/typophile.com/files/test_5292.gif)\n\nI would really like some feedback and suggestions for improvements. Never mind kerning /spacing, these are only sketches drawn in photoshop.\n\nThe font is a text font, and I am a newbie looking for hints, tips and clues.\n\nHrant: Two pixel stems! :)\n\n",
  "author": "Frode Bo Helland",
  "time": "26 Jun 2007 — 3:23pm",
  "uid": "17101",
  "comments": [
    {
      "time": "27 Jun 2007 — 8:30am",
      "content": "As Butthead would say: \"Hey, you're paying attention.\" :-)\n\nIt's nice to see an effort like this. But know that it's hard to pull off, not least in terms of getting it into an actual font as opposed to Photoshop images...\n\nTwo-pixel stems seem to make sense above 14-15 ppem. You're at 16, but your x-height is pretty small, so you're pushing it a little bit, and some people will think it's too dark. On the other hand, some people will object to somewhat dark fonts all the time, so... The good news is that at that ppem (and even with a smallish x-height) you want 2 pixels of interletter spacing\\* and that will open things up. You might end up making a one-pixel weight as a companion (and it could actually serve for emphasis the way an italic does in print) but don't easily give up the darkness.\n\n\\* BTW, in bitmap fonts the spacing is very deeply woven into the black forms, so you really have to mind both in parallel, perhaps even more so than in outline fonts. In that way (and maybe otherwise, such as freeing the mind as to what's possible) starting off in type design on the bitmap side might actually be beneficial...\n\nYour lc structures are sound (the \"y\" is quite nice) and your vertical proportions are very good for text. Try to make your \"v\" and \"w\" narrower - maybe by making their bases two pixels. Your caps and your application of grays I would work on though. Concerning the former, I would try making the caps wider; concerning the latter: avoid \"hanging\" light grays - they might seem clever, but mostly they just add blur; try to have a lighter touch in places, like the bottom of the \"g\"; and don't be afraid of using more shades - eight is a decent palette. I do see you're trying to lighten things up by making half of the stems a lighter black! I've experimented with that, and I do think it can work (although your lighter black is a bit too dark) but since you say you're just starting I'd be more conservative and just make things solid for now. In fact I can tell you're trying to apply every single idea you've had (I know because I suffer from the same temptation) but such a utopian approach always backfires in type design...\n\nBTW, some people will tell you (sometimes through their silence...) that you're wasting your time making something like this. But to me, especially since OSX has gone the What_ever_ route of font rendering something like this makes even more sense than before.\n\nhhp\n\n"
    },
    {
      "time": "27 Jun 2007 — 8:59am",
      "content": "<cite> BTW, some people will tell you (sometimes through their silence...) that you’re wasting your time making something like this.</cite>\n\nExactly. I don't see the point (probably not the only one). Unless it's something that's going to be used on some custom device burned inside an EPROM and used on matrix display.\n\nIt's not sensible these days (however you look at it) to do this kind of stuff for computers. But I may be just so way off everything that I don't really understand where OSX is going as hrant says... <cite>(since I'm a Windows user)</cite>\n\n"
    },
    {
      "time": "27 Jun 2007 — 9:12am",
      "content": "The point is the same as making any new font: improvement, in spite of  \nthe odds and the lack of rewards. BTW, OSX isn't going, it's already there.\n\nhhp\n\n"
    },
    {
      "time": "27 Jun 2007 — 12:12pm",
      "content": "Hrant: Thanks. Just the kind of feedback I was looking for.\n\n"
    },
    {
      "time": "28 Jun 2007 — 2:53am",
      "content": "but hrant... Sorry for not knowing this, but I assumed that OSX also uses some sort of ClearType font-rendering technology? Or are you maybe talking about MacOS that really still is here and probably does still have bitmap fonts?\n\n"
    },
    {
      "time": "28 Jun 2007 — 7:07am",
      "content": "Well, my gs pixelfonts look fine on OSX.  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20150414060951/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    }
  ]
}
