{
  "id": "34779",
  "title": "Spot/Process Question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Sometimes (actually, all the time) in InDesign when I’m working in two spot colors, and I have it generate the instructions, it lists four process inks too, even though, to the best of my knowledge, I haven’t used any. How can I prevent this from happening?\n\nThanks.\n\n [‹ What digital camera do you use?](http://web.archive.org/web/20081008040445/http:/www.typophile.com/node/34219 \"Go to previous forum topic\") [New York City trip, any tips? ›](http://web.archive.org/web/20081008040445/http:/www.typophile.com/node/34772 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081008040445/http://www.typophile.com/user/16884\" title=\"View user profile.\">Ehague</a>",
  "time": "<br>",
  "uid": "16884",
  "comments": [
    {
      "time": " 27.Jun.2007 6.47am",
      "content": "You can delete the colors you don’t use from your swatches palette, manually, or by pressing the little arrow and choose ’select all unused’ and delete.\n\nChances are that it still lists CMYK colors if you for example generate a PDF of it, but since you do not use those colors, that should not matter. You can always instruct your printer to ignore those plates, if they do not already, since there is nothing on them.\n\nAlso, the color ’Registration’ (for crop marks and such) is built up from CMYK (or maybe the colors that are present in your document, I’m not sure).\n\n"
    },
    {
      "time": " 27.Jun.2007 6.57am",
      "content": "Good call on deleting from the swatches palette—you can’t delete black, (for which reason I hadn’t tried the others), but they can apparently be axed. Thanks!\n\n"
    },
    {
      "time": " 27.Jun.2007 4.45pm",
      "content": "The registration marks basically defined in RGB thus present on all plates, but the registration swatch is a little bit special as it is also is on all spot colour plates.\n\n"
    },
    {
      "time": " 28.Jun.2007 5.51am",
      "content": "Ah yes, on all plates. Didn’t know for sure, but that was what I was aiming at with my _’or maybe the colors that are present in your document, I’m not sure’_ part.\n\n"
    }
  ]
}
