{
  "id": "34792",
  "title": "65 YEARS OF WORKING WITH TYPE",
  "forum": "Robert Trogman's blog",
  "tags": [

  ],
  "content": "My career began in 1942 as an apprentice in the composing room. Because of WWII I was able to get several jobs; working at the College Press under the tutiledge of Richard Hoffman and a night job at LA Type casting the first arrival of Times Roman.  \nBecause of the pursuit of the alphabet it led to working with some of the best in the busines: Saul Bass, Herb Rosenthal and Charles Eames. My commercial career began in the early 1960's with the revival of Jugenstill fonts and becoming an agent for Bertold.  \nI was able to bring on the photolettering market many original design under the name of Facsimile Fonts and later FotoStar International.  \nMy hobby is letterpress printing and I still cast type on the Linotype and Ludlow. I presently write under the name of Dr. Type in the magazine Recognition Revue. I am no longer working with type fonts because of the pirating.\n\n",
  "author": "Robert Trogman",
  "time": "27 Jun 2007 — 11:23am",
  "uid": "12824",
  "comments": [
    {
      "time": "27 Jun 2007 — 11:58am",
      "content": "I'm 100% against pirating fonts but I think that as for music and as for movies, the type designers has to find a way to sell their fonts. House Industries work out a fetish concept for their typefaces, I don't know if it will work but it has the advantage of being original. I think that time has changed and that the new generation of type designers has to deal with it. I'm really curious of how they will solve it and I don't think that stopping to work with type because of pirating is the solution.\n\n"
    },
    {
      "time": "27 Jun 2007 — 3:05pm",
      "content": "The thing with piracy Robert is that most people who don't pay for a font wouldn't pay for that font. If they can't get your font for free, they'll just get some other font for free; they generally wouldn't pay for your font anyway, because they don't think this stuff is worth money. So mainly all it does is increase the variety of the fonts we see used out there, without hurting designer profits much. It's unnerving, but we shouldn't let it rattle us.\n\nhhp\n\n"
    },
    {
      "time": "27 Jun 2007 — 3:23pm",
      "content": "I think Robert is also considering some foundries as pirates who have taken his designs, digitized them, and are now making money from them. But, Hrant you are right. Pirates wouldn't pay for he font to begin with ... BUT ... that is still generalizing. I've seen statements such as, \"I'm only using these to test the font then I'll license it if the design is improved.\" I'm all for a good test drive, but I think this is where the real problem comes from. Designers who aren't willing to go through the proper routes to test and license their fonts.\n\n"
    },
    {
      "time": "27 Jun 2007 — 3:37pm",
      "content": "\\> Robert is also considering some foundries  \n\\> as pirates who have taken his designs\n\nOh. That's better termed plagiarism. And it _used to be_ a big problem; it's notable that it happens very rarely these days, and when it does, or when it's perceived to have happened, like in Segoe, the outcry is palpable. Typophile actually serves as a great backlash mechanism in such cases, and the font houses do pay attention. So Robert, this might actually be a great time to resume your retail type design work!\n\n(I just hope Uli doesn't jump in though...)\n\n\\> Designers who aren’t willing to go through the  \n\\> proper routes to test and license their fonts.\n\nBut that's an education issue, not a \"prohibition\" issue.\n\nhhp\n\n"
    },
    {
      "time": "27 Jun 2007 — 3:39pm",
      "content": "Who pirated the work & where is it now?\n\n"
    },
    {
      "time": "28 Jun 2007 — 12:06am",
      "content": "I think that the main problem is not who is pirating what but how to make people want to buy fonts. This is the new challenge and we should think seriously about it.\n\n"
    },
    {
      "time": "12 Jul 2007 — 3:49am",
      "content": "Nice to read for you here.  \nIs there anyway I can find a copy of your Yagi Double font as I need it desperately!  \nit is not for sale on any website.\n\n"
    },
    {
      "time": "11 Sep 2008 — 3:20am",
      "content": "Hi,\n\nIs there any way to get in touch directly with Robert Trogman?\n\nI would like to ask a few questions regarding a digitised version of Yagi Link Double.\n\nWilliam\n\n"
    },
    {
      "time": "19 Jun 2013 — 3:35pm",
      "content": "you can find me on the web:  \n [www.dr-type.net](http://web.archive.org/web/20131016094908/http:/www.dr-type.net/ \"www.dr-type.net\")\n\nYouTube: Bob Trogman typography\n\ndrtype.wordpress.com\n\n"
    }
  ]
}
