{
  "id": "34809",
  "title": "1-0 : associated press",
  "forum": "vinceconnare's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20101204160628im_/http:/typophile.com/files/comics_AP_4836.jpg)\n\n[http://seattletimes.nwsource.com/html/living/2003765237\\_webcomicsans28.html](http://web.archive.org/web/20101204160628/http:/seattletimes.nwsource.com/html/living/2003765237_webcomicsans28.html \"http://seattletimes.nwsource.com/html/living/2003765237\\_webcomicsans28.html\")\n\n[http://www.theolympian.com/national/story/147226.html](http://web.archive.org/web/20101204160628/http:/www.theolympian.com/national/story/147226.html \"http://www.theolympian.com/national/story/147226.html\")\n\n",
  "author": "<a href=\"/web/20101204160628/http://typophile.com/user/7029\" title=\"View user profile.\">vinceconnare</a>",
  "time": "<br>",
  "uid": "7029",
  "comments": [
    {
      "time": "",
      "content": "LOL! all indications are that it is 2-0.\n\n"
    },
    {
      "time": "",
      "content": "Check out the Olympian and you'll get some new Midwest design ideas for decorating your office. Panelling is all the rage in wherever the hell Indiana is.\n\n"
    },
    {
      "time": "",
      "content": "We should all take them very seriously as designers, with ideas like this (yes, an actual quote):  \n\"You can't really go wrong with a Times New Roman,\" he advised.\n\nJason C\n\n"
    },
    {
      "time": "",
      "content": "Yes very good designers 'you can't go wrong with putting your favourite font all over your office and using another like Times New Roman and panelling your office with wood.\n\n"
    },
    {
      "time": "",
      "content": "Geez, what is up with her hair! I wonder if she did that on purpose or if it was a freak accident involving hair spray, a misplaced skateboard, a steep hill, lake and downed power lines...\n\n"
    },
    {
      "time": "",
      "content": "There are a lot of strange folks in the middle of America just look at the last two election results. All the smart people are along the coasts.\n\n"
    },
    {
      "time": "",
      "content": "And all the smart people _with a conscience_ didn't vote.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I voted and I think I have a conscience. I guess I failed on both accounts.\n\n"
    },
    {
      "time": "",
      "content": "It's hard to overcome so many decades of brainwashing.  \n(Maybe instead of smart I should have said... skeptical.)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "skeptical... that's definitely more appropriate. [http://www.backwardsbush.com/](http://web.archive.org/web/20101204160628/http:/www.backwardsbush.com/ \"http://www.backwardsbush.com/\") 2 years is going to feel like an eternity.\n\n"
    },
    {
      "time": "",
      "content": "Don't blame the puppet. They can always find  \nanother one. And \"they\" is not the Republicans.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "It's easier to blame the puppet. The political misdirection of the people, we're distracted by the seeming ignorance of the dancing clown while the real \"powers that be\" are pulling the wool over our eyes. All the news stations are on \"Terror watch\" scaring all the confused and ingorant trying to make us even more paranoid than we already were.\n\nI'm not a conspiracy theorist or anything, but I do have a weird feeling that things in America aren't going to be the same. Big Brother lost some of their power over the people ever since the end of the Cold War and their trying to get it back. Terror keeps people in line, compliant. If you think your freedom could be taken, it's going to shake you up, either you'll fight for it or ask someone to do it for you. The governments betting on the latter.\n\nIn about 2 years, everyone will be scared s4!tless and that's when the next \"presidential hopeful\" will come in and show that Bush was a baddie and we don't have to put up with feeling scared anymore. ~ just how the government planned it.\n\n(Okay rereading that just gave me weirdo chills.)\n\n"
    },
    {
      "time": "",
      "content": "that women is a [minger...](http://web.archive.org/web/20101204160628/http:/www.mingers.com/)\n\n"
    },
    {
      "time": "",
      "content": "I actually liked her no-nonsense look.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "[http://semissourian.com/](http://web.archive.org/web/20101204160628/http:/semissourian.com/ \"http://semissourian.com/\")\n\nwell here they are on the front page but I guess that is because there is nothing going on in the Midwest where they only have stories about shagging sheep.\n\nand big in the south\n\n[http://asap.ap.org/stories/1548521.s](http://web.archive.org/web/20101204160628/http:/asap.ap.org/stories/1548521.s \"http://asap.ap.org/stories/1548521.s\")\n\n"
    },
    {
      "time": "",
      "content": "Helvetica and Times New Roman is boring as hell.... Times Roman better... and Syntax go go go.\n\n"
    },
    {
      "time": "",
      "content": "Helvetica and Times New Roman are boring as hell.... Times Roman better... and Syntax go go go.\n\n"
    },
    {
      "time": "",
      "content": "\\> that women is a minger...\n\nWait, let me get this straight Vince. You're ripping on the Ban Comic Sans supporter because you don't like her _actual face_? Get a real argument.\n\n"
    }
  ]
}
