{
  "id": "34812",
  "title": "Bullet Points, Dashes, M Dashes... AH!",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Currently designing one in a series of brochures for a client.  \nI have come across (as happens many times) content that needs to be listed and bullet pointed/accentuated in some way.  \nWhat is the most elegant way of structuring this list? Should I use  \n• bullet points at constant type size  \n• bullet points slightly larger than type size  \n- dashes  \n- m dashes  \n\\* some bespoke icon  \n+ etc / other??\n\nAny advice welcome...  \nI guess all I want is something that will look elegant...and if there is any concensus on this.  \nFYI Type used in this exercise is Gill Sans\n\nAny help much appreciated  \ncheers  \nJavier\n\n",
  "author": "<a href=\"/web/20111231071128/http://typophile.com/user/7507\" title=\"View user profile.\">javi2307</a>",
  "time": "<br>",
  "uid": "7507",
  "comments": [
    {
      "time": "",
      "content": "Well, the amount of bullet points you have will be a determining factor. If you only have a few (say less than 5 or so), I'd recommend a more ornate bullet point icon; such as a custom mark, something indigenous to your select typeface, or even transplanted from a seperate typeface (Gill Sans's doesn't have any ornate bullet points that I'm aware of).\n\nIf it's a good bit more than 5 or so, you might want to stay with something less robust and more common, like the standard bullet point or dash.\n\nI've always set my bullet points a pt size smaller than the text size set with a .1378in tab, but that's me. You can set it anyway you like, I don't believe there's a standard form, set in stone when it comes to setting bullet points.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Asvetic, the list is 11 lines ling : ( I think your right something more common will have to do the job.\n\n"
    },
    {
      "time": "",
      "content": "11, that's not a huge list. Another thing to consider is how compressed your list is. Does it make up the majority of the text on the page? Is your page size large and would accommodate for more space between bullet points (leading vertically)?\n\nCan you post your current work for us to see what you're working with?\n\n"
    },
    {
      "time": "",
      "content": "I normally try a tab after a circular bullet which is set to half leading (so a 10 on 12pt bullet would be indented 6pts), if the first letter in each bullet is lowercase it is worth applying some baseline shift to centre it on the x-height, some typefaces can look good with a square bullet, in the 10/12 setting a 3.5pt square (n in Zapf Dingbats) with baseline shift up, an en-dash can work too but with a wider tab (12pt following the 10/12). I avoid the more ornate bullets, they seem to add more emphasis than necessary.\n\nTim\n\n"
    }
  ]
}
