{
  "id": "34817",
  "title": "Type & Design Education Forum at TypeCon",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Design educators in our midst are going to want to take note of the Type & Design Education Forum that SOTA is presenting at this year's TypeCon.\n\nMore information about the Education Forum is now posted at the TypeCon website: [http://www.typecon.com/education.html](http://web.archive.org/web/20120617082223/http:/www.typecon.com/education.html)\n\nThis should prove to be quite a unique opportunity for design educators to find inspiration and share information about teaching type and typography to the next generation of designers.\n\nThe forum topics will cover a broad range of subjects -- from overall curriculum development for different kinds of programs (2-yr vs. 4-yr, liberal arts institutions vs. art schools, etc.) to specific assignment presentations.\n\nThere will be break-out sessions for mixing it up with idea exchange, dialogue, and networking. And the final panel will focus on ideas and methods for instilling in students the kind of fascination and passion for typography that we know so well here at this site.\n\nThe Forum is being organized by SOTA board members Ilene Strizver and Mark Jamra, both of whom have spent many years in both the type industry and design education field.\n\nFellow Typophilers Will Powers and James Montalbano will be presenting. Perhaps next time they pop by, they can chime in with a preview of what they're planning to bring to the table.\n\n",
  "author": "kentlew",
  "time": "28 Jun 2007 — 6:39am",
  "uid": "1215",
  "comments": [
    {
      "time": "28 Jun 2007 — 7:29am",
      "content": "I am not really presenting anything. I will be acting as moderator for one of the panel discussions. What the panel brings to the discussion about creating a passion for type will dictate what role I play. Maybe referee, or maybe bouncer.\n\nJames\n\n"
    },
    {
      "time": "28 Jun 2007 — 8:02am",
      "content": "But James, you've been an educator for many years, right? Surely you're going to be able to contribute some of your experiences and insights, even while you're moderating, yes?\n\nDo you think you'll be sitting in on any break-outs?\n\n-- K.\n\n"
    }
  ]
}
