{
  "id": "34820",
  "title": "(x) Guggenheim Museum corporate sans - H&FJ Verlag {Patricia, Florian H}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "[http://www.guggenheim.com/new\\_york\\_index.shtml](http://web.archive.org/web/20120303125221/http:/www.guggenheim.com/new_york_index.shtml \"http://www.guggenheim.com/new\\_york\\_index.shtml\")\n\nthe guggenheim logo, font, so far ive figured its Futura, but it seems the lowercase g has been changed any ideas, its kind of urgent since its for a pitch and I dont have access atm to a bigger version than those found in webpages.\n\n",
  "author": "<a href=\"/web/20120303125221/http://typophile.com/user/7168\" title=\"View user profile.\">Makote</a>",
  "time": "<br>",
  "uid": "7168",
  "comments": [
    {
      "time": "",
      "content": "Look at Verlag. It was developed for the Guggenheim's identity and is now for sale.\n\n[http://www.typography.com/catalog/verlag/index.html](http://web.archive.org/web/20120303125221/http:/www.typography.com/catalog/verlag/index.html \"http://www.typography.com/catalog/verlag/index.html\")\n\nMy first ever visit to Typophile came as a result of looking for this font. I queried some of my designer friends and one of them sent me a link to this site and that thread (linked below) that dealt with the Gugg logo. At the time it was not available for purchase.\n\n"
    },
    {
      "time": "",
      "content": "[Search](http://web.archive.org/web/20120303125221/http:/typophile.com/search/node/guggenheim) and you’ll [find](http://web.archive.org/web/20120303125221/http:/typophile.com/node/2324). :)\n\nYes, it is Verlag; typographi.com has [some more facts and images](http://web.archive.org/web/20120303125221/http:/typographi.com/001063.php).\n\n"
    },
    {
      "time": "",
      "content": "Thank you, thank you, thank you...... ill post more on the project soon, this is for the actual guggenheim, well at least my city is competing so far for first Latin American guggenheim, I was invited to do the webpage but found a lot of image problems starting by the typography selection. The logo was rendered with verdana, and myriad in some cases, and then it was crucified with some arial for the second part. I kind of felt the Gs were too diferent, I did thought of neutra speccially for the New York one. Im sorry i didnt do a search in typophile. I googled for a while and I didnt find something relevant. Ill post mockups of the project on the project section soon.\n\nBTW this work is amazing the winning project for the building itself its amazing. Ill show pics soon.\n\n"
    },
    {
      "time": "",
      "content": "Hey, something's screwy with post times. It seems like now the time on your post is the last edit rather than the original post, which definitely affects those of us who add links in later. I know I had the original ID and then I added the link and then went back in and added the last paragraph, and now my time is much later.\n\n"
    },
    {
      "time": "",
      "content": "[http://typophile.com/node/34830](http://web.archive.org/web/20120303125221/http:/typophile.com/node/34830 \"http://typophile.com/node/34830\")\n\n"
    },
    {
      "time": "",
      "content": "@Patty: Yes, while you already were posting the right ID, I had merely found the old Guggenheim thread from 2003. Then I saw your post and edited mine to add the confirming link, so it got ranked earlier—higgledy-piggledy … However, all ID credits is yours, of course!\n\n"
    },
    {
      "time": "",
      "content": "Well like I said, that earlier thread was my portal into Typophile, otherwise I wouldn't care so much!\n\nI recently bought Verlag, it's so pretty.\n\n"
    }
  ]
}
