{
  "id": "34823",
  "title": "Type on the OLPC",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A highlight of the ICTVC conference (for me at least) was getting hands-on on the OLPC (One Laptop Per Child) [www.laptop.org](http://web.archive.org/web/20080623194047/http:/www.laptop.org/ \"www.laptop.org\"), a pic of Candara on the device...\n\n ![](http://web.archive.org/web/20080623194047im_/http:/www.typophile.com/files/OLPCa_5042.JPG)\n\nand many others uploaded by Alex... [http://photos.zvr.gr/main.php?g2\\_itemId=717&g2\\_page=1](http://web.archive.org/web/20080623194047/http:/photos.zvr.gr/main.php?g2_itemId=717&g2_page=1 \"http://photos.zvr.gr/main.php?g2\\_itemId=717&g2\\_page=1\")\n\n [‹ Client request: \"eliminate all hyphens\" in newsletter](http://web.archive.org/web/20080623194047/http:/www.typophile.com/node/34464 \"Go to previous forum topic\") [First US design patent (Printing Types) ›](http://web.archive.org/web/20080623194047/http:/www.typophile.com/node/34804 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080623194047/http://www.typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 28.Jun.2007 10.38am",
      "content": "The caption to these photos reads\n\n_Photos about typography on the 200dpi OLPC screen._\n\n**200dpi**\n\nThis was news to me, because I guess I hadn’t been paying much attention to the display side of the OLPC story. Oh, and apparently the subpixel stripes are diagonal. Very cool.\n\nThis rather supports the theory that the reason screen displays have not improved in resolution as anticipated ten years ago is that most commercial software doesn’t scale well, not because of inherent difficulty or cost in making higher resolution screens.\n\n"
    },
    {
      "time": " 28.Jun.2007 10.57am",
      "content": "The 200dpi may be a bit misleading as it includes subpixels (so I hear) so in color mode it may be a bit less. Anyway I think the type holds up pretty well even down to small sizes, as I think the screen shots seem to show.\n\n"
    },
    {
      "time": " 28.Jun.2007 11.06am",
      "content": "Nice.  \n200dpi? Wow. Can we get some really good macro shots?\n\nBut what’s cool about a diagonal subpixel stripe?  \nWho makes 45-degree Italics? :-) To me it seems  \nlike a concession to images (think of TVs).\n\n\\> This rather supports the theory that ...\n\nNah. The commercial software would have scaled well if there was a financial incentive. This instead is evidence that the reason we haven’t had hi-res screens is simply that there’s no money in it - people don’t want to pay for readability, because they don’t really grasp what readability is (since, unlike legibility\\*, it’s subconscious). The telling difference between OLPC and the commercial world is that the former has a philanthropic core...\n\n\\* Think 1-bit sans letterforms.\n\nhhp\n\n"
    },
    {
      "time": " 28.Jun.2007 11.09am",
      "content": "Huh? Exactly how does “200dpi” include subpixels?  \nYou mean it’s less than 70dpi?!  \nOr 200 / sqroot(3) = ~120 dpi?\n\nhhp\n\n"
    },
    {
      "time": " 28.Jun.2007 11.19am",
      "content": "_But what’s cool about a diagonal subpixel stripe?_\n\nUniform x and y direction resolution enhancement. It happens that Latin italics tend to have slant angles that benefit particularly from vertical subpixel stripes, but there are other aspects of Latin letterforms that do not benefit from that arrangement, and then of course there is the whole wide world of other writing systems in which there is a great diversity of strokes and bowls to be accomodated. Providing uniform x and y resolution enhancement accomodates more things better than x direction only. The rendering of Latin italics might not be as good — but at 200 dpi, who is going to notice? —, but many other things should be better (Arabic, for example, and other writing systems with strong horizontal features and shallow curves).\n\n"
    },
    {
      "time": " 28.Jun.2007 11.32am",
      "content": "_Exactly how does “200dpi” include subpixels?_\n\nI didn’t say it did. I don’t know what the native resolution is. As I said, this is news to me. Do a Google search on olpc 200dpi for more information.\n\n"
    },
    {
      "time": " 28.Jun.2007 11.35am",
      "content": "OLPC specs are here:\n\n[http://www.laptop.org/laptop/hardware/specs.shtml](http://web.archive.org/web/20080623194047/http:/www.laptop.org/laptop/hardware/specs.shtml \"http://www.laptop.org/laptop/hardware/specs.shtml\")\n\n"
    },
    {
      "time": " 28.Jun.2007 11.49am",
      "content": "\\> Providing uniform x and y resolution enhancement  \n\\> accomodates more things better than x direction only.\n\nI’m not sure.  \nDo note that most “writing” is horizontal (in more ways than one).\n\nMy gut feeling is that uniformity is a lost opportunity.  \nBut my gut has been wrong before.\n\n\\> I didn’t say it did.\n\nI didn’t say you did. :-) Simon did.\n\nBut especially since the subpixels are on a diagonal there’s no indication as to how it’s really being measured. Also, I’m confused about this monochrome/color difference, especially when it comes to factoring in the subpixeling...\n\nhhp\n\n"
    },
    {
      "time": " 28.Jun.2007 4.25pm",
      "content": "\\>I didn’t say you did. :-) Simon did.\n\nIt’s what I heard someone say so was clearly hear-say.\n\nAlso off-list I was asked what the MS fonts were doing on the Open Source device. Alex asked me if he could install them on there for his demo (as they have lovely Greeks) and I said okay.\n\nCheers, Si\n\n"
    },
    {
      "time": " 28.Jun.2007 5.00pm",
      "content": "Simon, wouldn’t this  \n [http://typophile.com/node/34304](http://web.archive.org/web/20080623194047/http:/typophile.com/node/34304 \"http://typophile.com/node/34304\") \\_  \nbe another route?\n\nhhp\n\n"
    },
    {
      "time": " 28.Jun.2007 6.01pm",
      "content": "$100 laptop, $300 fonts ;-) Having said that if NickNeg were to ask BillG then maybe they could cut a deal.\n\n"
    },
    {
      "time": " 28.Jun.2007 6.21pm",
      "content": "Hmmm, now I’m actually thinking they need special CT fonts that: work  \nwith the diagonal stripe; handle the writing systems of the poorer nations...\n\nhhp\n\n"
    }
  ]
}
