{
  "id": "34830",
  "title": "Moratorium on editing of posts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Would it be too presumptuous to ask for a moratorium on editing your posts until that feature is fixed? You see, when you edit your post it changes the time stamp causing the flow of the conversation to change quite a bit as well. I mean, a quick edit seconds after your initial post is one thing, but going back even 5 minutes later can cause a break in conversation and confusion for those who read the posts later.\n\nThank you for considering the proposal.\n\nI've posted this in the GENERAL DISCUSSIONS area instead of my BLOG because I know some of you do not use the tracker to follow Typophile.\n\n",
  "author": "Miss Tiffany",
  "time": "28 Jun 2007 — 2:00pm",
  "uid": "108",
  "comments": [
    {
      "time": "28 Jun 2007 — 3:37pm",
      "content": "There's no way people will listen. Most people won't even know that  \nyou want them to wait. Maybe turn editing back off until you fix it.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2007 — 4:12pm",
      "content": "I think it would be enough to put a warning after the edit link, something that looks like this (maybe with a better wording):\n\n ![](http://web.archive.org/web/20131019131635im_/http:/typophile.com/files/warning_5764.jpg)\n\nMichel\n\n"
    },
    {
      "time": "28 Jun 2007 — 4:58pm",
      "content": "Will do, Tiffany.\n\n"
    },
    {
      "time": "28 Jun 2007 — 5:15pm",
      "content": "I think for ID purposes we just need to add the link in a new post so that the original ID stands. It's more ungainly that way but at least it's fair. Gotta preserve bragging rights!\n\nHopefully they'll fix this bug before long.\n\n"
    },
    {
      "time": "28 Jun 2007 — 8:21pm",
      "content": "I kind of like the idea of unedited posts - warts and all…\n\n"
    },
    {
      "time": "28 Jun 2007 — 8:30pm",
      "content": "Which is fine in most fora, but when one is doing type IDs, the usual protocol is to post a message with \"this is zorfnorblegurp\" and then go off and search for the appropriate link to prove that, indeed, the type truly is zorfnorblegurp.\n\nAnd that's rather problematic when dealing with a turgid server that adjusts posting order based on time, particularly for the competitive Type IDers.\n\nNot that I would know any.\n\nOr recognize one in the mirror in the morning.\n\nEven if one lived near me.\n\n"
    },
    {
      "time": "28 Jun 2007 — 8:35pm",
      "content": "Or if it were truly sophisticated, it would show the edits as edits but not change the post time.\n\nzorfnorblegurp happens to be one of my favorite fonts but it is a little dated.\n\n"
    },
    {
      "time": "28 Jun 2007 — 8:38pm",
      "content": "Ah, but when you set it well, it's absolutely magic.... ;-)\n\n"
    },
    {
      "time": "28 Jun 2007 — 8:45pm",
      "content": "_ **zorfnorblegurp** _\n\nROTFLETILAIAAW\n\n(Rolling On The Floor Laughing Even Though It's Late And I Am At Work)\n\n"
    },
    {
      "time": "28 Jun 2007 — 8:46pm",
      "content": "Hmmm... I need to edit that... but... oh, never mind. ;-)\n\n"
    },
    {
      "time": "29 Jun 2007 — 12:13am",
      "content": "I would rather suggest this:\n\n**Get the last version's backup, downgrade the site, develop the new version until it's sufficiently stable and functionality rich, TEST and then upgrade back to new version**. If you move to faster server in between, even better. I'm starting to not like this site anymore because of all the bugs... I'm really sorry. It's almost more pain than pleasure.\n\n"
    },
    {
      "time": "29 Jun 2007 — 12:48am",
      "content": "I am a poor typist. I'm not necesarily a bad prson, or even bad at spelling. However, I often think that my keyboarding skills cause people to disregard my overall message. I hope thisis fixed soon, because I often need to edit posts. Hrant is right.I have no idea what is happneing. I hope that users are expected to make mistakes.\n\n"
    },
    {
      "time": "29 Jun 2007 — 5:25am",
      "content": "Litera,\n\nI agree completely, I'd be very happy to go back to the previous version too. I know I'm not alone in saying that. Even without the IM feature, there's been a lot of behind the scenes grumbling.\n\nA quote (anonymous) from another typophile:  \n\"it's not as much fun anymore. and i don't know why, exactly. i didn't use the IM all that much. i didn't even use the search extensively -- just when i was researching a particular topic. but still, it just FEELS different.\"\n\n"
    },
    {
      "time": "29 Jun 2007 — 6:03am",
      "content": "Exactly. It's slower, it's too buggy, it lacks previous functionality we used to have (even without the IM that I didn't use at all) and did I mention it's slower? ;)\n\nMy experience is like this: I used to have a tab with Typophile's site open all the time. Now I just close it when I get so ... you know what... And since I'm also a developer I know this is really bad. **REALLY BAD**.\n\n"
    },
    {
      "time": "29 Jun 2007 — 6:36am",
      "content": "I always thought Typophile had a bit of a lag to it, even the previous version. I would usually sign in, go to my account and check my contributed topics (this had the longest loading times) before going back to the front page to see what's new and hot.\n\nI still do this, but now I don't really feel like checking out the news/hot topics as much. I can't put my finger on it, but there's something overwhelming about that front page. The Flash seems intrusive compared to the previous version; which was just slightly intrusive. The animated logo is annoying (and if you go to any other page, it looks like a ? not a T), the topic headers are too bold and appear slightly blurry (I'm on a Windows machine with Cleartype turned on), not to mention the issue with the editing comments.\n\nI do like some of the changes though. I like the expanding comment box, the ticker on the front that lists the latest comments, the user icons at the bottom, the multiple page link in the original post, and the fact that the links at the very top are all available.\n\nI've been waiting for an update to this site for a while, and I'm glad it's finally arrived, I just think it might have been too much all at once. It's upset the natural order of things and the adjustments are a bit of a shock. Changes is good, I applaud the efforts. I just think it might have been to much in too little without a proper feedback period.\n\n"
    },
    {
      "time": "29 Jun 2007 — 6:47am",
      "content": "Well not to hammer the point home, but (to me) the improvements are not immediately obvious, not that significant, and way counterbalanced by the features lost and the slowness/bugginess.\n\nI realize the wiki improvements are important to a lot of people but as someone who mainly frequents the forums, I'd happily give up the icon parade and the expanding comment box to have a more user-friendly site back.\n\nI also NEVER go to the home page (I bookmark the Type ID forum), and don't like flash in general so that's all lost on me.\n\n"
    },
    {
      "time": "29 Jun 2007 — 10:07am",
      "content": "We are going to be moving to a new hosting package **soon** that can support the sheer size of the site, as I have mentioned before. The people who work behind the scenes on Typophile, contribute their spare, unbillable time, mostly in the wee hours of the night and early morning before office hours. Because of this, we aren't able to make changes as quickly as we'd like -- this upgrade is still a work in progress, so thanks for your patience.\n\nAsvetic, the logo morphs into a 7, to celebrate the 7th anniversary of Typophile.\n\n"
    },
    {
      "time": "29 Jun 2007 — 10:29am",
      "content": "<cite> Asvetic, the logo morphs into a 7, to celebrate the 7th anniversary of Typophile.</cite>\n\ndrp, my bad. It's weird when you're not looking for it, you don't see it.\n\n"
    },
    {
      "time": "29 Jun 2007 — 12:34pm",
      "content": "<cite>it looks like a ? not a T</cite>\n\nI thought it was a ? as well, I think the grid is a bit too coarse to render a successful 7.\n\n"
    },
    {
      "time": "3 Jul 2007 — 11:57pm",
      "content": "I believe the edit function is now fixed.\n\n"
    },
    {
      "time": "4 Jul 2007 — 6:34am",
      "content": "Stephen - no it hasn't. If you edit a post it still changes the time stamp. I did a test.\n\n"
    },
    {
      "time": "4 Jul 2007 — 9:33am",
      "content": "We want to keep these discussions and other bug issues out of the forums, it is difficult for us to keep track of all the issues when they are buried in various threads. Please use the feedback form:\n\n[http://www.typophile.com/feedback](http://web.archive.org/web/20131019131635/http:/www.typophile.com/feedback \"http://www.typophile.com/feedback\")\n\n"
    }
  ]
}
