{
  "id": "34845",
  "title": "(x) Classic capitals w/ raised small caps - ITC Galliard {loremipsum}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I have often seen this style used for medieval / folklore packaging.  \nDoes anyone know what era this style is from? I really like the use  \nof the superscript-ish use of type and would like to learn more.\n\n ![](http://web.archive.org/web/20150131143022im_/http:/typophile.com/files/nkag_3597.jpg)\n\n",
  "author": "CeNedra",
  "time": "29 Jun 2007 — 6:55am",
  "uid": "19380",
  "comments": [
    {
      "time": "29 Jun 2007 — 7:06am",
      "content": "The typefaces are [Matthew Carter](http://web.archive.org/web/20150131143022/http:/typophile.com/wiki/Matthew%20Carter)'s [Mantinia](http://web.archive.org/web/20150131143022/http:/www.fontshop.com/fonts/downloads/carter_cone/mantinia_cc/) and Futura Extrabold.\n\n"
    },
    {
      "time": "29 Jun 2007 — 7:09am",
      "content": "I think the superscript-ish use of type stems from architectural lettering, but I'm no expert in these matters. :)\n\nAnother typeface that uses this style is [Jonathan Barnbrook](http://web.archive.org/web/20150131143022/http:/typophile.com/wiki/Jonathan%20Barnbrook)s [Ma(n)son](http://web.archive.org/web/20150131143022/http:/www.fontshop.com/search/?q=mason).\n\n"
    },
    {
      "time": "29 Jun 2007 — 7:15am",
      "content": "The practice might've come from wanting to space the letters more efficiently, like in [this example](http://web.archive.org/web/20150131143022/http:/www.fontshop.com/fonts/singles/carter_cone/mantinia_cc/&sample_text=SQuARe&sample_size=60).\n\n"
    },
    {
      "time": "29 Jun 2007 — 9:05am",
      "content": "If you mean things like the raised \"O\"s, that comes from the practice of lettering (typically in stone) where funny things were done to letters in order to fit the lines well, or save space/effort, or get fancy. As for the bullets between letters, the Ancient Romans did that between words, instead of using a blank space. But here it seems to be motivated by a desire to fill out the line.\n\nhhp\n\n"
    },
    {
      "time": "29 Jun 2007 — 9:15am",
      "content": "The superscript lowercase \"o\" with either dot or underscore below were also part of special mercantile and accounting symbols and characters, like the @ and #.  \nTypically used to save space on tabular settings the word _Number_ was frequently abbreviated to \"No.\" and to save even more space the dot or underscore was placed under the raised \"o\".\n\nI might be able to find samples of old mercantile pi characters, but not quickly.\n\n"
    },
    {
      "time": "5 Jul 2007 — 12:34am",
      "content": "Does [Phil Grimshaw](http://web.archive.org/web/20150131143022/http:/www.itcfonts.com/Ulc/2721/PhilGrimshaw.htm)'s [**ITC Rennie Mackintosh**](http://web.archive.org/web/20150131143022/http:/www.myfonts.com/fonts/linotype/itc-rennie-mackintosh/rennie-mackintosh-itc-bold/charmap.html) count?\n\n_If you mean things like the raised “O”s, that comes from the practice of lettering (typically in stone) where funny things were done to letters in order to fit the lines well, or save space/effort, or get fancy._\n\nAnd medieval scribes also did these things, if I'm not mistaken. :-)\n\n"
    },
    {
      "time": "5 Jul 2007 — 5:10am",
      "content": "The use of dots as word separators can be dated back at least to the Mesha selle, about 842BC (written in Moabite, a language closely related to Phoenician and Hebrew). As for Mantinia, the [Font Bureau Mantinia link](http://web.archive.org/web/20150131143022/http:/www.fontbureau.com/fonts/Mantinia) clearly establishes that it was inspired by the monumental lettering of imperial Rome. However, when I look more closely at the letters K and N in the word \"Kingdom\" above, I seem to get a closer match with [Galliard](http://web.archive.org/web/20150131143022/http:/www.fontshop.com/fonts/singles/carter_cone/itc_galliard_roman_cc/&sample_text=KINGDoM&sample_size=60) than with [Mantinia](http://web.archive.org/web/20150131143022/http:/www.fontshop.com/search/?q=mantinia&x=0&y=0&sample_text=KINGDoM&sample_size=60). I feel there is still some unresolved mystery.\n\n"
    },
    {
      "time": "5 Jul 2007 — 6:00am",
      "content": "About the Mesha stelle, another reference (and I lost the author and booktitle\\*\\*) states: \"The inscription, in the early Hebrew script, was incised on a basalt stele [...]. The words are separated by dots and the sentences are set apart by small strokes\".\n\n\\*\\* [corrected] The title is \"Inscriptions Reveal\", Israel Museum, Jerusalem, Goldman-Schwartz Hall, Winter 1973, Cat. No. 100\n\n"
    },
    {
      "time": "5 Jul 2007 — 6:21am",
      "content": "On the dots as word separators.\n\nI believe the story is that in Semitic languages, which were the first to use the alphabet, they used dots and then spaces to separate words. In these, generally only the consonants were written. In Latin and Greek, which included symbols for vowel sounds, there were generally no word spaces. The word spaces were introduced into Latin and Greek by Irish scribes in the seventh century.\n\nMatthew Carter says that Mantinia is based on Andrea Mantegna's paintings and engravings of ancient Roman inscriptions. These evidently owe something to both the Roman stone carvers, and to Mantegna's own style. And then Carter is a third author.\n\n"
    },
    {
      "time": "5 Jul 2007 — 6:49am",
      "content": "Definitely Galliard, and not Mantinia.\n\n"
    },
    {
      "time": "5 Jul 2007 — 8:08am",
      "content": "\\> As for Mantinia, the Font Bureau Mantinia link clearly establishes  \n\\> that it was inspired by the monumental lettering of imperial Rome.\n\nLike William, from what I know it was based (at least in part) on the lettering of the Renaissance painter Mantegna. The Roman lettering connection can be said to be inherent in pretty much any Latin caps. :-)\n\n\\> The word spaces were introduced into Latin and  \n\\> Greek by Irish scribes in the seventh century.\n\nIn \"normal text\" yes\\*, but the Romans did use dots  \nbetween words, at least in monumental lettering.\n\n\\* See P Saenger's treatise.\n\nhhp\n\n"
    },
    {
      "time": "5 Jul 2007 — 8:42am",
      "content": "\\> Like William, from what I know it was based (at least in part) on the lettering of the Renaissance painter Mantegna.\n\nThis is what is said explicitly in the link I gave. More precisely, if I cut and paste the text in the Font bureau link, we can read:\n\n<cite>Mantinia, designed by Matthew Carter, is a titling face inspired by the letterforms painted and engraved by Andrea Mantegna, artist of the Italian Renaissance and one of the first to study and revive the monumental lettering of imperial Rome. Mantinia contains several distinctive ligatures more commonly found in stone than in type, a set of raised small capitals, and a few tall capitals that are also inscriptional in origin; C&amp;C 1993</cite>\n\nMichel\n\n"
    },
    {
      "time": "5 Jul 2007 — 8:44am",
      "content": "Oops, sorry.\n\nhhp\n\n"
    },
    {
      "time": "5 Jul 2007 — 11:06am",
      "content": "\\> _I really like the use of the superscript-ish use of type and would like to learn more._\n\n\\> _Mantinia contains several distinctive ligatures more commonly found in stone than in type, a set of raised small capitals..._\n\nThe origins of superscripts, abbreviations and \"notationesque\" forms do indeed go back to ancient stone cutting and manuscripts, but it would be interesting to peg-down the timeframe when certain characters were adapted and used in hot metal.\n\n"
    },
    {
      "time": "5 Jul 2007 — 10:43pm",
      "content": "all your comments have been quite helpful.\n\ncheers!\n\n"
    },
    {
      "time": "9 Jul 2007 — 6:15am",
      "content": "It is a bit late but I found something in another direction; here are the glyphs for the lowercase characters in [Epitaph](http://web.archive.org/web/20150131143022/http:/www.fontbureau.com/fonts/Epitaph) (Tobias Frere-Jones)\n\n ![](http://web.archive.org/web/20150131143022im_/http:/typophile.com/files/epitaph_lc_6634.gif)\n\nOnly \"o\" and \"c\" appear as raised smallcaps with a dot under. There is no lowercase \"c\" in \"Northeast Kingdom\" and only the \"o\" appears as a raised smallcap with a dot under.\n\n"
    },
    {
      "time": "9 Jul 2007 — 5:01pm",
      "content": "And, more in tune with artisanship, there is [P22 Arts and Crafts](http://web.archive.org/web/20150131143022/http:/www.p22.com/products/artsfamily.html) where only the \"o\" is singled out to figure as a subscribed raised smallcap.\n\n"
    },
    {
      "time": "9 Jul 2007 — 5:14pm",
      "content": "And don't forget the charming Govan!  \n [http://www.myfonts.com/fonts/fontfont/govan/](http://web.archive.org/web/20150131143022/http:/www.myfonts.com/fonts/fontfont/govan/ \"http://www.myfonts.com/fonts/fontfont/govan/\")\n\nhhp\n\n"
    }
  ]
}
