{
  "id": "34853",
  "title": "Section Sign",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I’m working on a project in Adobe Jenson, and I need to use the section sign in some citations. I’m not happy with the one in Adobe Jenson, though, and I was thinking of using the one from Centaur instead. I’m concerned it looks a bit too thin next to the Jenson numerals. (Then again, the picture below is obviously blown up quite a bit.) What do others think? (The example on top uses the Centaur section sign; the one on the bottom uses the Adobe Jenson section sign.)\n\n ![](http://web.archive.org/web/20081021101650im_/http:/www.typophile.com/files/Sections_4915.jpg)\n\nAlso, while we’re on the subject, should I use a full word space between the section sign and the numerals? It looks a bit too open to me, and I was thinking of using a thin space instead. Any thoughts?\n\nI’m just an amateur doing some work for a friend, which is why I’m looking for input from experts and professionals!\n\nThanks in advance.\n\n [‹ International folklore festival - Varna, Bulgaria](http://web.archive.org/web/20081021101650/http:/www.typophile.com/node/34842 \"Go to previous forum topic\") [Please critique my resume ›](http://web.archive.org/web/20081021101650/http:/www.typophile.com/node/34958 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081021101650/http://www.typophile.com/user/3772\" title=\"View user profile.\">msilverz</a>",
  "time": "<br>",
  "uid": "3772",
  "comments": [
    {
      "time": " 29.Jun.2007 10.43am",
      "content": "I’m not quite sure why you want to swap in the Centaur glyph: the Jenson is better balanced with the font (note its closer proportions to the ascender height of the “6” and the descender depth of the “9”, “3”, “5”). The Centaur may line up better with the parens, but its relationship is to the figures, not the parens. The Jenson glyph is also more balanced in terms of its curves, and, of course, its weight. Add all of this together and, as above, I don’t quite understand the desire to do the swap...\n\n"
    },
    {
      "time": " 29.Jun.2007 11.22am",
      "content": "If you are going to the trouble of inserting a character from another font, you can further nuance it.  \nFor instance, add a Stroke value of .075 pt to beef it up a bit, nudge the baseline shift up by half a point, increase the horizontal scaling by 10%, and reduce the point size by half a point. Something like that, anyway.\n\n"
    },
    {
      "time": " 29.Jun.2007 12.01pm",
      "content": "Jason, you’re right that the Centaur glyph does not match the height or depth of the Jenson numerals, but notice in the picture below that it doesn’t match the _Centaur_ numerals in that respect either. (This line is set entirely in Centaur.)\n\n ![](http://web.archive.org/web/20081021101650im_/http:/www.typophile.com/files/Centaur_4401.jpg)\n  \nAs to why I want to do the swap—frankly, I think the Jenson symbol sign is rather ugly. It doesn’t match the calligraphic beauty of the rest of the typeface (or something like that). The Centaur glyph seems much more elegant.\n"
    },
    {
      "time": " 29.Jun.2007 12.10pm",
      "content": "Nick, thanks for the suggestions. Below is a version adjusted largely according to your specifications. I think .075 pt was too much to add to the stroke value. What you see on the top line is .05 pt added stroke value, and I think that still might be a bit too much. (The bottom line remains unadulterated Adobe Jenson.)\n\n ![](http://web.archive.org/web/20081021101650im_/http:/www.typophile.com/files/Adjusted_5033.jpg)\n  \nAny thoughts on the space after the section sign? Word space or thin space?\n"
    },
    {
      "time": " 29.Jun.2007 12.26pm",
      "content": "Wonder what the Centaur bold section sign would look like, scaled down a couple of points? Probably clunky. I never installed Centaur bold when I bought Centaur way back when.\n\nPersonally, I’d close up the space a bit between the section sign and the numerals. Though I’d probably try to find a well-set book with this construction to use as an example first.\n\n"
    },
    {
      "time": " 29.Jun.2007 12.31pm",
      "content": "Gary, it might look something like this:\n\n ![](http://web.archive.org/web/20081021101650im_/http:/www.typophile.com/files/Bold_3874.jpg)\n  \nThis is Centaur Bold at 10pt next to Adobe Jenson at 12pt. (There is too much variation in stroke width on the Centaur Bold glyph here, I think.)\n"
    },
    {
      "time": " 29.Jun.2007 12.46pm",
      "content": "Note that adding a stroke to a glyph makes it more soft in the corners,  \nand that might only be visible in print, not onscreen - be careful!\n\nhhp\n\n"
    },
    {
      "time": " 29.Jun.2007 1.14pm",
      "content": "Are those actually page numbers, or section numbers? If page numbers I would think that ’pp’ would do.\n\n"
    },
    {
      "time": " 29.Jun.2007 2.01pm",
      "content": "They’re section numbers. Why would I use the section sign for page numbers? (Incidentally, when the citation includes only pages numbers, I don’t even bother with the ’pp’. Hence something like: (Oxford: Clarendon Press, 1969), 18-42.)\n\n"
    },
    {
      "time": " 7.Jul.2007 4.51am",
      "content": "Centaur’s § proportions won’t simultaneously work with the parentheses and numerals of Jenson even with horizontal scaling and increased weight, I can’t give an alternative but I imagine a further search is in order.  \nAs to the spacing I would keep the current space, I would also, primarily to assist the reader and for consistency, use ‘pp’ for pages, however is the comma between parentheses and § really necessary? That space might need to be a wide space if the comma wasn’t there.\n\nTim\n\n"
    },
    {
      "time": " 8.Jul.2007 6.03pm",
      "content": "Tim, I think I’ve already been convinced to stick with the Adobe Jenson section sign, inelegant though it seems. (In other words, that’s the direction in which I’m currently leaving.) I checked the Arno Pro section symbol, and it’s even clunkier.\n\nAs for ’pp.’, it is—at least in academic publishing—common to leave it out. (See, for instance, the Chicago Manual of Style.) There is no worry about consistency, since readers know that in the absence of some indication to contrary (§§, chap., vol.), the numbers refer to pages.\n\nAnd yes, in a full footnote citation (what I included was only the end of the citation), the comma between the facts of publication and the page number(s) is necessary (or at least standard).\n\n"
    },
    {
      "time": " 10.Jul.2007 6.34am",
      "content": "Just browsing the OED on another subject and noticed they use no space between section and numeral §0 (or if the original document uses it Sect. 0).\n\nTim\n\n"
    },
    {
      "time": " 11.Jul.2007 6.23pm",
      "content": "That’s good to know—thanks!\n\n"
    }
  ]
}
