{
  "id": "3492",
  "title": "How do you like it?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey you font-gurus...   \n   \nIm was just wondering what fonts you \"dig\" these days. I mean those really usefull ones. I'm tired of seeing DIN font everywhere I look, even thought its so beautiful. I would love to hear your idea for the next DIN font...?   \n   \nWhat do you think?\n\n",
  "author": "anonymous",
  "time": "8 Mar 2004 — 12:58am",
  "uid": "1203",
  "comments": [
    {
      "time": "10 Mar 2004 — 5:30pm",
      "content": "I've been drooling over Underware's Sauna and Dolly. They are so playful and well done, I love 'em. As for the next DIN, who knows, Amplitude by Mr. Schwartz?\n\n"
    },
    {
      "time": "11 Mar 2004 — 4:34am",
      "content": "Drooling over fonts is one thing, but have you bought licenses and started to use them?\n\n"
    },
    {
      "time": "12 Mar 2004 — 10:34pm",
      "content": "i dunno about you, james, but i'd be flat broke if i bought every font that i've drooled over the past year!\n\n"
    },
    {
      "time": "13 Mar 2004 — 7:22am",
      "content": "Since I'm not in the business of using other designers typefaces, I rarely look at, let alone drool over them.\n\n"
    },
    {
      "time": "13 Mar 2004 — 7:29am",
      "content": "isn't that hypocritcal, then, to encourage others to use yours? you should encourage them to build their own to drool over, doncha think?\n\n"
    },
    {
      "time": "13 Mar 2004 — 7:42am",
      "content": "By all means, build your own. If I can offer any advise on the matter please let me know. I just think there is an awful lot of \"talk\" about type on this forum, I just want everyone to not only talk about it, but license it, use it, and by all means create it yourself.   \n   \nIn fact if everyone was busy creating their own fonts, they would have scant time to spend discussing what to drool over.\n\n"
    },
    {
      "time": "13 Mar 2004 — 7:53am",
      "content": "I haven't bought them, no. That's only because I haven't had a job that could use them. I just enjoy studying type that has been designed well. It helps me further my type design skills in general.   \n   \nIf you go to my website, you'll see that I'm working on plenty of new fonts and have even more on my computer that may never see the light of day.   \n   \nI just enjoy talking type, that's all.\n\n"
    },
    {
      "time": "13 Mar 2004 — 7:58am",
      "content": "Same here - communication is human. And I don't think Typophile's content is just idle banter. Plus I start wondering why James is here. I hope he doesn't just leave one day, but if he sticks around I hope it will be mostly to communicate. Drool or dry.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Mar 2004 — 8:06am",
      "content": "i apologize for my previous rudeness, james. i just thought that the purpose of typophile was for fellow aficionado/as to come together and discuss whatever aspect of type is on his/her mind. personally, i wish i could get my corp to purchase Miller Daily for use in our news publication, but they're tight, so i hafta be content with drooling. i guess i COULD design my own newspaper face, but i doubt it'd be an improvement over times even. but it's good to know i can consider you as a resource, i'll keep that in mind if i ever turn the talk into action.\n\n"
    },
    {
      "time": "13 Mar 2004 — 8:35am",
      "content": "I see no rudeness. I was only trying to encourage you to act on your drooling and license the fonts you desired. I do understand the limitations of budgets, but font software is such a relatively inexpensive item in the scheme of business expenses... I guess its seeing too much of the same boring type around the city everyday that makes me a little cranky.\n\n"
    },
    {
      "time": "13 Mar 2004 — 9:41am",
      "content": "In Europe, perhaps Helvetica Ultra Ultra Ultra Light as in Orange ads. Like on some examples here: [http://www.orange.com/English/orangeinbusiness/campaigns.asp](http://web.archive.org/web/20131018213443/http:/www.orange.com/English/orangeinbusiness/campaigns.asp)   \n   \nMust be a typeface widely available.\n\n"
    },
    {
      "time": "8 Mar 2004 — 2:19am",
      "content": "I personally like it simple. DIN is okay, but it is enough of DIN on the streets here in Germany. My recent clients were happy enough with Stone Sans offered to be their corporate type. My favs are Stone, Legacy, Ocean, Scala, Seria and Thesis. And I hope these kind of typefaces will get there credit some time soon.   \n   \nAs for \"next DIN\" - and I might be too late for this - but Gill Sans is quite popular these days. Way too popular, I think. I've written about it in Russian @ [ru\\_typography](http://web.archive.org/web/20131018213443/http:/www.livejournal.com/community/ru_typography/152045.html), but there are links to scans, so you might see what I mean. Gill is really everywhere here. I've been reading an article right now, set in Gill. A german article. And there is a spare room to rent across the street and guess what\n\n"
    }
  ]
}
