{
  "id": "34924",
  "title": "Typographic Budapest?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I will be heading off to [Budapest](http://web.archive.org/web/20131014205157/http:/typophile.com/wiki/Budapest) for two weeks and I thought I would solicit some suggestions about typo-interesting places to see. Or any places, really, above and beyond the typical tourist hot-spots that people here have found interesting.\n\nThanks!\n\nK.\n\n",
  "author": "Kristina Drake",
  "time": "5 Jul 2007 — 4:32pm",
  "uid": "9151",
  "comments": [
    {
      "time": "5 Jul 2007 — 9:13pm",
      "content": "If you're there long enough take a side-trip to Prague.\n\nhhp\n\n"
    },
    {
      "time": "5 Jul 2007 — 11:55pm",
      "content": "This might be relevant:  \n [http://www.magtypo.cz/buxus/generate\\_page.php?page\\_id=413](http://web.archive.org/web/20131014205157/http:/www.magtypo.cz/buxus/generate_page.php?page_id=413 \"http://www.magtypo.cz/buxus/generate\\_page.php?page\\_id=413\")\n\nand as a tourist you will inevitably go to this market:  \n [http://www.budapest-tourist-guide.com/great-market-hall.html](http://web.archive.org/web/20131014205157/http:/www.budapest-tourist-guide.com/great-market-hall.html \"http://www.budapest-tourist-guide.com/great-market-hall.html\")\n\nAnd, it's pronounced \"Buda-pesht\"\n\n"
    },
    {
      "time": "6 Jul 2007 — 6:15am",
      "content": "Hi Kristina,\n\nI think probably its worth checking the Millenium Underground line (Nr.1, colour: yellow). The stations have got unique hand painted name shields. I see them everyday as i'm using this line day by day ;)\n\nIf anything more comes into my mind i'll let you know.\n\nCheers,  \nPéter\n\n"
    },
    {
      "time": "6 Jul 2007 — 4:32pm",
      "content": "Egan, szeretlek!\n\nThanks for the info. I will have a good tour guide (he grew up there) but much of the trip will be old friends and anything involving alcohol. So I thought I'd get some outside opinions about other things to do ;)\n\nHrant: Prague is out of the question. Me significant other is Hungarian, so I will be quite tied to Budapest, at least for this trip! Maybe the next time round.\n\nTypical: Thanks I'll take a closer look at those links.\n\nPeter: I'm wondering about the thermal baths. Are they worth a visit? Is Budapest rather uninteresting for typography, or just not a well-known destination?\n\nThanks!  \nK.\n\n"
    },
    {
      "time": "8 Jul 2007 — 7:16am",
      "content": "do the thermal baths.. they're a great experience.\n\nSzéchenyi baths are great:  \n [http://cityguide.budapestrooms.com/sights/sights5.htm](http://web.archive.org/web/20131014205157/http:/cityguide.budapestrooms.com/sights/sights5.htm \"http://cityguide.budapestrooms.com/sights/sights5.htm\")\n\n"
    },
    {
      "time": "8 Jul 2007 — 5:02pm",
      "content": "At the second-hand bookshops ask for the books designed by [Tibor Szántó](http://web.archive.org/web/20131014205157/http:/www.bestwebbuys.com/Tibor_Szanto-author.html?isrc=b-compare-author), the great Hungarian typographer--printed in the 1960s and 1970s; the better ones were published by Helikon Kiadó and Európa Könyvkiadó. Some of them are truly superb.\n\nTake a trip to Gyoma, the home of the [Kner family](http://web.archive.org/web/20131014205157/http:/www.gyomaikner.hu/eng/muzeum_2.html). The Kners owned a printshop there, and made themselves a name in the world of private press printing with their exquisite little books, very tastefully typeset, illustrated and decorated. The shop was still active in the 1970s; I remember how impressed I was by the quality of its presswork, binding, and the fact that some books manufactured at Kner Nyomda were printed on a special, watermarked stock, which used to be produced in small quantities for those limited editions.\n\n[Moholy-Nagy Művészeti Egyetem](http://web.archive.org/web/20131014205157/http:/w2.mome.hu/) (Moholy-Nagy University of Art and Design, formerly known as Magyar Iparművészeti Főiskola) could be worth a trip. It used to be a pretty good school for graphic and typographic design. Many excellent Hungarian design professionals are MIF graduates, and some teach there.\n\nFor additional information on Hungarian typography see a very good listing offered by [Luc Devroye](http://web.archive.org/web/20131014205157/http:/cg.scs.carleton.ca/~luc/hungary.html).\n\n"
    },
    {
      "time": "8 Jul 2007 — 5:07pm",
      "content": "Hello Maxim!\n\nHow are you?\n\nChrisL\n\n"
    },
    {
      "time": "8 Jul 2007 — 5:47pm",
      "content": "I am fine, thank you. It's just too darn hot and humid in NYC today. So it is in DC, I reckon. Hope it's better in [Budapest](http://web.archive.org/web/20131014205157/http:/www.weather.com/outlook/travel/businesstraveler/hourbyhour/HUXX0002?begHour=14&begDay=190#Tue,%20Jul%2010). Have you ever been there?\n\n"
    },
    {
      "time": "8 Jul 2007 — 6:34pm",
      "content": "No, Never been there, it has to be cooler than Viet Nam though, between the heat and humidity there, you can poach an egg in the air.\n\nWill you be at TypeCon Seattle?\n\nChrisL\n\n"
    },
    {
      "time": "8 Jul 2007 — 7:40pm",
      "content": "No, I won't. But I'll be at ATypI Brighton. Inshallah.\n\n"
    }
  ]
}
