{
  "id": "34920",
  "title": "Not another student post...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello all...\n\nI just joined Typophile today... I was bit of a lurker before. I have a few questions about student placement/internships (mainly in the NYC area).\n\nBasically, I want to know what companies and designers look for in a student's portfolio. And, what do you look for in a person? I know each place and person will be different, but what are key things that you look for in hiring someone for a short work placement? Also, any other advice would be great because I need it!\n\nthanks\n\n",
  "author": "kowchow",
  "time": "5 Jul 2007 — 3:02pm",
  "uid": "19431",
  "comments": [
    {
      "time": "5 Jul 2007 — 3:52pm",
      "content": "<cite>Basically, I want to know what companies and designers look for in a student’s portfolio. And, what do you look for in a person.</cite>\n\nFrom my experiences interviewing to be an intern employers want _relevant_ creativity and effort. By relevant creativity, I mean that they look for a portfolio of work in line with work they want their firm to produce. For example, when I took my retro-modernist stuff to a firm where everything is hip and current and wildly creative, I got some weird looks and no callback. When I took that portfolio to a firm that uses vast amounts of negative space and grotesque sans in much of their work, I got the job. If you have a big portfolio with a variety of work, you can show different stuff to different employers and leave out irrelevant work.\n\nMy advice is to either look for an internship in a field you care about or want to learn about or to look for something at a large multidisciplinary firm. Before you interview, be ready to explain to them why you want to work there as opposed to the thousands of other hot internships in New York.\n\nLast, ignore people who tell you to have a big box full of boards and stuff to show off at interviews. It will just get out of order or something will get damaged or you’ll have to hold up three boards with two hands and then need to point at something. I had some really disastrous interviews last semester when I had a big mixed portfolio, and next time it’s all going into a nice book format.\n\n"
    },
    {
      "time": "6 Jul 2007 — 12:35pm",
      "content": "kowchow,\n\nI use to be in New York and every summer I'd hire one intern. (Truth is, I would do it do discourage people from going into typography.) The portfolios they brought were never very memorable. Every now and then there would be one original piece, but mostly it was school projects and done by direction, not love.\n\nWhen interviewing each time for this one person, the personality and motivational force was what was so important. I didn't want one more person there because they needed an internship -- I wanted someone there that really loved what they were doing and had the desire to continue in that field - even though they were constantly reminded they were becoming dinosaurs.\n\nI've stayed in touch with a few of the interns - not many, since I've left the city. One thing, I did pick people that loved type. One of them is now a literary agent and another a designer for a book publisher.\n\nOf those I interviewed and didn't hire, I wonder if they stayed in this field... my mind says, \"NO WAY.\"\n\nGood luck, you are just starting out on your journey, and there are many difficult turns in the road ahead.\n\n"
    },
    {
      "time": "8 Jul 2007 — 11:04am",
      "content": "That helped so much. I actually just got an email back from a company I had an interview with and got the placement. I start Tuesday and I am so excited! Ah! Thanks a lot for advice!\n\n"
    },
    {
      "time": "17 Jul 2007 — 6:22am",
      "content": "Lowchow -\n\nHow is the apprenticeship going? Let us know...\n\n"
    }
  ]
}
