{
  "id": "34940",
  "title": "Historical Revival Research",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Where are good places to do research for a revival? The typographer biography? Press history? I can't find printed samples. I wonder how Carol at Adobe did Caslon, there are so many different cuts.\n\n",
  "author": "weinziet",
  "time": "6 Jul 2007 — 8:06am",
  "uid": "7770",
  "comments": [
    {
      "time": "6 Jul 2007 — 8:24am",
      "content": "Depends on the font. What do you have in mind?\n\nhhp\n\n"
    },
    {
      "time": "6 Jul 2007 — 9:41am",
      "content": "Well, I don't have a particular time period in mind yet.\n\nI am working on a slab serif [http://typophile.com/node/34427](http://web.archive.org/web/20131018222543/http:/typophile.com/node/34427 \"http://typophile.com/node/34427\")\n\n"
    },
    {
      "time": "6 Jul 2007 — 3:06pm",
      "content": "Try to collect a group of people who are into the  \ngenre in question, and pick their brains for leads.\n\nhhp\n\n"
    },
    {
      "time": "6 Jul 2007 — 3:31pm",
      "content": "If you want to find material on early slab serifs, there are two authors you should check out: [Nicolete Gray](http://web.archive.org/web/20131018222543/http:/typophile.com/wiki/Nicolete%20Gray) and [Rob Roy Kelly](http://web.archive.org/web/20131018222543/http:/www.rit.edu/~rkelly/html/05_obs/obs_wood1.html). You should be able to find their books through a public library.\n\n"
    },
    {
      "time": "9 Jul 2007 — 8:08am",
      "content": "OK, thanks.\n\n"
    },
    {
      "time": "9 Jul 2007 — 12:34pm",
      "content": "Slab serifs began in the 19th century under the category of \"Egyptian\"\n\n"
    },
    {
      "time": "10 Jul 2007 — 8:44am",
      "content": "Correct me if I'm wrong,  \nDidn't they call it Egyptian because it had a \"slab\" base to it, like a sculpture? I think it was first used for ads in Europe, and they could make the letter larger because they were made from wood instead of metal.\n\n"
    },
    {
      "time": "10 Jul 2007 — 8:54am",
      "content": "The term egyptian appears to have come about to describe the original grotesques, which appeared during a period known as “Egyptomania” when the British were obsessed with all things Egyptian. At some later point the term became associated with slab serifs that were also popular during that period. If you search around you’ll find a thread started by Missgiggles in which James Mosely kindly dropped by to straighten this out.\n\n"
    },
    {
      "time": "10 Jul 2007 — 8:58am",
      "content": "One theory is that the term Egyptian was adopted because Egyptology was so fashionable at that time. The monolithic connection is probably relevant, but then they could've called it Stonehenge too. :-)\n\nhhp\n\n"
    },
    {
      "time": "10 Jul 2007 — 9:03am",
      "content": "Here is the link to the James Mosley essay, which gives some of the history in depth:\n\n[http://typefoundry.blogspot.com/2007/01/nymph-and-grot-update.html](http://web.archive.org/web/20131018222543/http:/typefoundry.blogspot.com/2007/01/nymph-and-grot-update.html \"http://typefoundry.blogspot.com/2007/01/nymph-and-grot-update.html\")\n\n"
    },
    {
      "time": "13 Jul 2007 — 7:38am",
      "content": "Thanks, that helps. I'm going to have to read through those blogs, and check out my Bringhurst bible.\n\n"
    }
  ]
}
