{
  "id": "34967",
  "title": "Evolution of the Latin script",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This is a theory I developed in 2003 while designing Preface, but I thought I’d introduce it here in relation to several Typophile threads which have discussed the relationship and variability of letterforms in the Latin-Greek-Cyrillic script triad.\n\n ![](http://web.archive.org/web/20081120062253im_/http:/www.typophile.com/files/Evolution1_4556.png)\n\nI set out to introduce a selection of more recent letterforms into the Latin grotesque (19th century sans such as AG/Helvetica/Arial), and discovered that these forms came from non-print media, where the spacing is not as subtle. Typewriter, road signs, OCR, computer monitor, neon, and the Breuer chair.\n\nIt’s not a drastic change to the Latin script, which is so diverse anyway, but it’s notable that the use of serifed forms of I, i, j and l in sans faces for typewriter and www makes these forms extremely widespread.\n\nWith both Verdana and Comic Sans featuring a serifed “I”, that constitutes a 21st century default.\n\nGriffith/Bell Gothic also has this letterform; although designed for print, again crude, not subtle typography.\n\n\\*\\*\n\nGoing back a little further, somewhat more fundamental changes to the Latin script:  \n1. Abolishing the long s, early 19th century.  \n2. Establishing the single-storey g as a legitimate and widespread upright form (previously it had been used only for italics and scripts). AG (1890s) and Futura (1920s) were instrumental.  \n3. Conversely, the use of tail-less “f”, an upright convention, in italics.\n\n [‹ Matrix](http://web.archive.org/web/20081120062253/http:/www.typophile.com/node/34999 \"Go to previous forum topic\") [Font Suggestions ›](http://web.archive.org/web/20081120062253/http:/www.typophile.com/node/34993 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081120062253/http://www.typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": " 8.Jul.2007 12.41pm",
      "content": "This gives me something else to consider as part of my thesis. I’ve decided to do a comparison of significant grotesques and use the results to help me design a new one. This week I’ll be layout out the commentary over the entire regular weight alphabets of ten faces, I’ll post it once I have it ready.\n\n"
    },
    {
      "time": " 8.Jul.2007 2.05pm",
      "content": "Nick,  \nI would also be interested to see how you view serif faces evolving through the same time period.  \nThe linguistic changes (dropping long ess) are a different breed than what you show above. My guess would be that your Spiekermann affect is partially computer screen induced. Adding the hooks to i and l not only help distinguish them from I and 1 but space better on low rez pixel based type.  \nI don’t know what to make of Bayer in all this other than popularizing the sans and perhaps the simplification and regularization of forms. I think you have to mix in the ancient Greek and Phoenician into the soup to balance the modernist occurrences though.\n\nChrisL\n\n"
    },
    {
      "time": " 8.Jul.2007 3.07pm",
      "content": "_Adding the hooks to i and l not only help distinguish them from I and 1 but space better on low rez pixel based type._\n\nYes, that’s my theory — that non-serifed I, i, j and l are OK in sans print fonts, with subtlety of spacing, but problematic in other media, hence the appearance of serifed forms to better modulate spacing.\n\nBayer didn’t directly popularized the “bent tube” construction that characterizes his unicase alphabet, but the direct inspiration of the Breuer chair does, I think, highlight the origins of this letterform in other media. While it’s true that the round-nibbed “Speedball” pens could produce the effect in lettering, it was the stiffness of neon and metal tube which suggested a certain kind of geometric formality, without the humanist diagonal stroke which required acute angles that can’t be easily created by tube- bending.\n\n"
    },
    {
      "time": " 8.Jul.2007 3.41pm",
      "content": "Have you found evidence of a direct connection from Breuer’s tube furniture and the development of specific letter designs, or is that a theory?\n\n"
    },
    {
      "time": " 8.Jul.2007 5.11pm",
      "content": "It’s a theory.  \nBoth were at the Bauhaus.  \nBreuer’s combination of plumbing and bike-frame technology to make furniture was the “killer application” that iconized the industrial turn taken by the Bauhaus. Sure, there were other reductive geometric influences on Bayer — and his perspective drawings may well have influenced Breuer’s chair — but it’s hard to look at the bold sans Universal Alphabet and not see it justified by the Armchair. Other sans faces of the era don’t have have the same degree of tubularity. In chronological order:\n\n ![](http://web.archive.org/web/20081120062253im_/http:/www.typophile.com/files/one_5688.jpg)\n  \n\n ![](http://web.archive.org/web/20081120062253im_/http:/www.typophile.com/files/two_4943.jpg)\n  \n\n ![](http://web.archive.org/web/20081120062253im_/http:/www.typophile.com/files/three_4832.jpg)\n  \n\n ![](http://web.archive.org/web/20081120062253im_/http:/www.typophile.com/files/Four_4394.jpg)\n\n"
    },
    {
      "time": " 8.Jul.2007 8.27pm",
      "content": "Well, it’s definitely a great observation. I have a co-worker who has a PhD. in design history and an interest in Bayer, I’ll ask if she’s seen anything along these lines.\n\n"
    },
    {
      "time": " 9.Jul.2007 7.50am",
      "content": "I spoke with my co-worker about your theory. She agreed that it makes sense given the nature of inspiration and the general interest in geometry among designers at that time—especially at the Bauhaus. But she has not seen the idea posited elsewhere, nor seen evidence of it when she examined Bayer’s archives.\n\n"
    },
    {
      "time": " 9.Jul.2007 2.04pm",
      "content": "“Adding [...] to i and l not only help distinguish them from I and 1 but space better on low rez pixel based type.”\n\n“Yes, that’s my theory — that non-serifed I, i, j and l are OK [as] sans print fonts, with subtlety of spacing, ...”\n\nBecause resolution is available, i, j and l have another leg to stand on vs. f, t and sometimes r.\n\n”...but problematic in other media, hence the appearance of serifed forms to better modulate spacing.”\n\nAt distance perhaps, and at low resolution for sure, to push the three lone rangers i ,j, l toward the next simplest group f, t and sometimes r, is thought to help the reader.\n\nI don’t know anything about who knew or did what when.\n\nVery nice pictures, thank you.\n\n"
    }
  ]
}
