{
  "id": "34974",
  "title": "Three fonts for review",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "These are my three latest fonts, I didn't want to make three seperate posts so put them all here. Let me know what you think.\n\nA short description for each..\n\n[Seg Meg:](http://web.archive.org/web/20150317194236/http:/i6.photobucket.com/albums/y239/Jumpsuit/SegMeg.jpg)\n\nI really need a closer view to best view the detail on this. Anyway, this was a font that came to me from my sketch book. I like the way the two forms play off each other. I am anxious to use this somehow, but its going to be hard to find a good fit for it because it has such a different look to it.\n\n[Retron:](http://web.archive.org/web/20150317194236/http:/i6.photobucket.com/albums/y239/Jumpsuit/Retron.jpg)\n\nA short and squatty font.\n\n[Aeon:](http://web.archive.org/web/20150317194236/http:/i6.photobucket.com/albums/y239/Jumpsuit/aeon.jpg)\n\nI am happy how this came out. It has a strange style going for it. I know its not perfect, however I kind of like it like that. However, if you have any ideas I'd be happy to hear them.\n\nThere you go. Any comments or suggestion welcome\n\nThanks,\n\nAdam\n\n",
  "author": "A-type",
  "time": "8 Jul 2007 — 7:23pm",
  "uid": "19413",
  "comments": [
    {
      "time": "8 Jul 2007 — 7:59pm",
      "content": "Something seems to be wrong with the Aeon image. Firefox says:\n\n\"The image “http://i6.photobucket.com/albums/y239/Jumpsuit/aeon.jpg” cannot be displayed, because it contains errors.\"\n\n"
    },
    {
      "time": "8 Jul 2007 — 11:26pm",
      "content": "fyi. that aeon thing is really similar to some custom typography brody did for a cabaret voltaire album a hundred thousand years ago. can't remember which one, but i'd advise looking it up and studying his construction methods.\n\n"
    },
    {
      "time": "10 Jul 2007 — 1:47pm",
      "content": "glyphobet: I will check on reloading that image. I am not sure why firefox has a problem with that particular file since I uploaded them all the same and in Safari it works fine, but I will see what I can do about that.\n\npatricking: Could you get me an example of that font because I am really curious how that looks, I can't find anything that resembles my font by searching online.\n\n"
    },
    {
      "time": "10 Jul 2007 — 5:02pm",
      "content": "found it, sort of. see attached image (shot with my phone at a friend's house, sorry so blurry). the symbol was broken up to form the word code on the back cover of the vinyl.\n\n ![](http://web.archive.org/web/20150317194236im_/http:/typophile.com/files/code_4409.jpg)\n\n"
    },
    {
      "time": "11 Jul 2007 — 11:47pm",
      "content": "The firefox issue is most likely caused by a CMYK image instead of RGB.\n\n- Lex\n\n"
    },
    {
      "time": "19 Jul 2007 — 2:00pm",
      "content": "Patricking, Sorry for the late response. I kind of see what your saying with the aeon typeface resembling, but not really. Has Brody constructed other letters like that, or is that the only one?\n\nLex: I agree, however I am not at my computer right now to change, but thanks for the advice.\n\n"
    }
  ]
}
