{
  "id": "34979",
  "title": "How many typeface designers are there in the world?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,  \nI am working on my thesis project right now. So I came upon this question: How many serious type designers are there in the world right now? I know its kind of hard to say because there is so many people out there that make fonts for fun. But I kind of mean those that not necessarily live from creating type, but are very much devoted to type design. Those that have the knowledge to create typefaces that can stand out among all the junk. I am looking for the number of those people that would be able to develop a complex and satisfactory fontsystem. Not only from the technical and programming perspective but more important from the design side of things. I hope I have narrowed it down a bit. I am not expecting exact numbers (even though they would be nice), but if someone has researched this before I would be glad for some inside.  \nThanks  \nHenning\n\n",
  "author": "dehac",
  "time": "9 Jul 2007 — 5:13am",
  "uid": "15122",
  "comments": [
    {
      "time": "9 Jul 2007 — 5:37am",
      "content": "What is the title of your thesis ?\n\n"
    },
    {
      "time": "9 Jul 2007 — 5:42am",
      "content": "Henning, try searching the archives here, if you haven't already. I know this discussion has come up before, and it's a difficult one to know with any accuracy. Good luck.\n\n"
    },
    {
      "time": "9 Jul 2007 — 5:49am",
      "content": "No final title, yet. It's more or less on the future of typeface design. Compared to the vast number of people using type, there is only a small number of those that decide what type will look like in the future. So I am trying to get an idea how many are out there.\n\n"
    },
    {
      "time": "9 Jul 2007 — 6:26am",
      "content": "157\n\n"
    },
    {
      "time": "9 Jul 2007 — 6:58am",
      "content": "There was a discussion in another expert circle 6 month ago. The result was: ca. 300.\n\n"
    },
    {
      "time": "9 Jul 2007 — 7:06am",
      "content": "Purely a deep-gut guess: 100.\n\nhhp\n\n"
    },
    {
      "time": "9 Jul 2007 — 8:22am",
      "content": "When are you a typedesigner? When you designed a typeface once or when you design type for a living?\n\nPieter\n\n"
    },
    {
      "time": "9 Jul 2007 — 8:27am",
      "content": "Although Henning's criteria don't necessarily fit my own definition  \nof \"type designer\", he _was_ pretty specific, and apparently what he's  \nlooking into is neither one of those.\n\nhhp\n\n"
    },
    {
      "time": "9 Jul 2007 — 8:49am",
      "content": "Right.  \nIn The Netherlands there are a lot of typedesigners who fit the definition of Henning.  \nI think it’s at least 30.\n\nPieter\n\n"
    },
    {
      "time": "9 Jul 2007 — 8:51am",
      "content": "@ hrant: What is your definition of a “type designer”? I had a hard time putting some specific criteria to it.\n\n"
    },
    {
      "time": "9 Jul 2007 — 8:53am",
      "content": "Pieter, I guess it depends on how you define \"junk\"...  \nBut The Netherlands certainly has the highest number per capita.\n\nHenning, that question is too hard! :-)\n\nhhp\n\n"
    },
    {
      "time": "9 Jul 2007 — 9:26am",
      "content": "@ Chris Keegan: could you please give me a hint how to find that old thread you mentioned above? I have searched quite a bit but couldn't find it. Thanks.\n\n"
    },
    {
      "time": "11 Jul 2007 — 6:47am",
      "content": "{Edit caused a jump forward of many days. Annoying as h\\*ll.}\n\nThere was also a -long- thread some years ago that featured heated arguments between myself and one or more anonymous opponents, including one who I'm sure was the Mustang-driving werewolf of London.\n\n(I can't believe \"h\\*ll\" is censored. Danm religious puritans.}\n\nhhp\n\n"
    },
    {
      "time": "9 Jul 2007 — 10:42am",
      "content": "Doesn't the wiki have a listing?\n\nChrisL\n\n"
    },
    {
      "time": "9 Jul 2007 — 1:42pm",
      "content": "Right, but how many people fit Henning's definition of serious? I think the range of answers is about right, and I'd guess it's closer to 100 than 300 (by Henning's definition), working in Latin-based languages.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "9 Jul 2007 — 2:20pm",
      "content": "Henning, what is the common denominator of art and design, in your opinion ?\n\n"
    },
    {
      "time": "10 Jul 2007 — 12:53am",
      "content": "Based on the definition of \"serious\" provided, I think the total is much larger than people are suggesting. Certainly, I'd say 300 is the wrong order of magnitude entirely. Especially since one of the criteria offered is that the person may not make their living designing type.\n\nI think the number is measured in thousands. If you look beyond the \"A-level\" names Carter, Hoefler, Berlow, Kobayashi, Schwartz, (etc) you find a whole bastion of incredibly capable type designers. Chester, Crossgrove, Simonson, Darden, Ragan, Downer. Oops don't forget about the Thierry Puyfoulhoux's hiding out in the alps designing fonts to fuel their whitewater adventures. Duprés cranking out types. Pingerras. Porchez. Hughes. Tankards. The Meaves from Mexico, and the Alejandro Lo Celsos from Argentina. Looking through something like the FontShop catalogue, I find myself looking at many of the names attached to very polished, and extensive families and say to myself: \"where do all these people come from?\" Beyond that there is yet a deeper layer of excellent typophiles who labor in relative anonymity. I can think of many here on Typophile who would fit the criteria proposed, but would probably not make most people's list. Miguel Hernandez? Eduardo Omine? Christian Robertson? Chris Lozos? Kris Sowersby? How many Keith Tams are there who are capable of making great type, but are busy doing other things? Or working behind the scenes like Miguel Sousa, Paul Hunt, Andy Clymer, Jean-Baptiste Levée etc.\n\nNot to mention, non-latin type designers as Thomas mentions.\n\nOf course the trickiest criterion you propose is this: _Those that have the knowledge to create typefaces that can stand out among all the junk._ The quality of the type is only part of that equation.\n\nMy stratification of type names is mostly nonsense, but you get my point. I got past thirty without even thinking to include Slimbaugh, Speikerman, Stone, or Frutiger. This is a long list indeed, so I won't be accepting any challenges, but what kind of list wouldn't include Peter \"Mustardo\" Bruhn. Oh wait, he's not very serious.\n\n"
    },
    {
      "time": "10 Jul 2007 — 7:07am",
      "content": "The participants in Indie Fonts 3 give some idea of the diversity of backgrounds and intent against which any claim of 'serious\" must be judged. Given that there are different markets for fonts, there are different kinds of \"serious\"; and it does seem that \"serious\" means making the majority, or a significant amount, of one's income off type design -- although people who are headed in that direction may be quite dedicated.\n\nThe number of foundries represented by Myfonts (\"Welcomes 13 new foundries\" -- summer 07 newsletter) gives some idea of how many are doing business.\n\nAnd then there is the question of what constitutes \"type design\".  \nThe way it stands at the moment, that term casts a broad net, including everything from one-person outfits creating original fonts, to technical production work for software companies.\n\nIf as I agree there are thousands of us, perhaps we should have our own organization, as our interests are not fully served by trade organizations that lump individual designers together with software giants.\n\n"
    },
    {
      "time": "10 Jul 2007 — 7:12am",
      "content": "\\> I think the number is measured in thousands.\n\nAgain, it depends on what one means by \"can stand out among all the junk\". Many of the names you list have not done that in my view. In fact the way you're portraying things it's like the junk is in the minority!\n\n\\> perhaps we should have our own organization\n\nYes! And as I suggested years ago, it should be called \"TyD\".  \nYou know, an unstoppable flow. :-)\n\nhhp\n\n"
    },
    {
      "time": "10 Jul 2007 — 8:09am",
      "content": "Nick: to suggest that Miguel is not a typeface designer simply because he works for Adobe is unfair. It seems to me the size and nature your employer has little to do with whether or not you are a type designer. I agree that seriousness can be measured many ways. Earning a significant portion of your income from type design could be a useful distinction in some cases. I purposely cast a wide net, because I consider myself a typeface designer. I make the majority of my living as a graphic designer, but more than 10% is typeface design. Still, I humbly submit that my ability to draw and sell orginial typefaces from scratch, should justify the title regardless of income precentages.\n\nHrant: Every single person I mentioned has developed and is able to \"develop a complex and satisfactory fontsystem.\" You may not like their types, but these people make quality typefaces that are useful in the real world.\n\n"
    },
    {
      "time": "10 Jul 2007 — 8:42am",
      "content": "You're not following Henning's criteria. That said, every person necessarily defines anything (like \"can stand out among all the junk\") on a personal level. So maybe my issue is that you're being way too generous, in effect going against the venerable maxim that \"90% of anything is junk\". :-)\n\nhhp\n\n"
    },
    {
      "time": "10 Jul 2007 — 9:09am",
      "content": "_to suggest that Miguel is not a typeface designer simply because he works for Adobe is unfair._\n\nThat's your inference, not mine!  \nI was merely observing that in font production there may be division of labour, and it's all called type design.\n\n"
    },
    {
      "time": "10 Jul 2007 — 11:30am",
      "content": "He he. Another venerable maxim: don't try to read between the lines of a forum post. Appologies Nick. I agree, about division of labor all falling under the label type design. My point was: even if worker bees at the larger shops don't get their names on the final font, they are certainly capable of taking a design from concept to delivery and are type designers in their own right.\n\nHrant:\n\nI think I am following his criteria :-) I'd be curious if you'd call me a typeface designer? Or yourself?\n\nJunkiness is indeed personal and probably not the best criteria. I was just looking at the homepage at FontShop and saw this face I'd never seen before by a guy I'd never heard of: FF Speak designed by Jan Maack. Is it standout? I'd say probably not. Is it junk? I don't think so. Is it well done? Absolutely. To me, I'd have no trouble calling Jan Maack a Typeface Designer even though the world probably wont remember his typeface 50 years from now. It's less about the label, and more about the capability. Plus I think there's still more than enough junk left over after you make room for the Jan Maack's of the world to to warrant your 90% maxim.\n\n- - - - - -\n\nUltimately who cares? It's a good question for the breaks between sessions at typecon, but good for little else. Everything I've said, boils down to this:\n\nI'm constantly surprised by the number of quality typefaces that I would be happy to use, designed by people I've never heard of. I'd like to think that type design is a craft practiced by a fraternity of a few hundred, all of whom I've heard of, but then I discover somebody jumped the velvet rope when I wasn't looking.\n\n"
    },
    {
      "time": "10 Jul 2007 — 11:42am",
      "content": "The original question asked \"So I came upon this question: How many serious type designers are there in the world _right now_?\"\n\nSo in my carefully calculated answer I didn't include living designers who'd made a non-junk font a few years ago, but had moved on to different, more profitable things. I don’t know if Jan Maack qualifies under this definition, but there are many living type designers who are retired, resting, on sabbatical or between jobs \"right now\".\n\n"
    },
    {
      "time": "10 Jul 2007 — 1:20pm",
      "content": "Randy, I mostly agree with you. Except for the part that you're abiding by Henning’s criteria. :-) And if it matters: I think both you and I are on the border of his criteria, because we can make non-junk type (although you might be further ahead than me on the ground, especially in Latin) but neither one of us has really proved excellence. That said, I'm realizing that my own definition of \"junky\" would not exclude as many people as I might have thought; although 90% of people produce ho-hum ephemeral stuff, maybe \"junk\" is too unkind a label for all of them. OK then, I'm officially doubling my near-blind estimate to 200. :-)\n\nhhp\n\n"
    },
    {
      "time": "10 Jul 2007 — 2:28pm",
      "content": "In my way of using the term, a typeface designer does some things that are significantly different than the production work that occupies most of Christopher Slye or Miguel Sousa's time, designing glyph shapes and setting the overall \"feel\" of the typeface.\n\nNow, I consider both Miguel and Christopher to be typeface designers, but that's because they've each designed a typeface (Calouste, Elmhurst) in addition to doing extensive production work. There are lots of other people who have done font production work at Adobe at one time or another who I don't think of as type designers. Invaluable members of the team, but not type designers.\n\nI also have what some would consider a high bar for quality in my head. So by my understanding of the original request:\n\n<cite>Those that have the knowledge to create typefaces that can stand out among all the junk. I am looking for the number of those people that would be able to develop a complex and satisfactory fontsystem. Not only from the technical and programming perspective but more important from the design side of things.</cite>\n\n... I don't think there's any way in heck that there are a thousand type designers in the world, even across all languages. I'd be surprised if there were more than 500 globally.\n\nI'm assuming \"complex and satisfactory fontsystem\" implies a range of weights and perhaps other variables (width, style) in a comprehensive system, including typographic goodies whether in separate fonts in \"old formats\" or in the same font in OpenType.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "10 Jul 2007 — 4:16pm",
      "content": "I think the difference between our estimates is that I'm counting capability, whilst others are counting business cards. And so, the person who's designed one quality, mulitweight gets my vote, whilst others veto. I suppose there are many more people in the world who have rewired a house than there are electricians too, so I see your point.\n\nSo, I'll revise my estimate to the following:  \nThere are typeface designers in the world.\n\n"
    },
    {
      "time": "11 Jul 2007 — 2:05am",
      "content": "@ Randy: <cite>So, I’ll revise my estimate to the following: There are typeface designers in the world.</cite>\n\nSuperb answer! I love it.\n\n<cite>I’m assuming “complex and satisfactory fontsystem” implies a range of weights and perhaps other variables (width, style) in a comprehensive system, including typographic goodies whether in separate fonts in “old formats” or in the same font in OpenType.</cite>\n\nThats exactly what I meant. Thanks for clearifying and adding to the criteria.\n\n“right now” doesn't exclude those \"type designers who are retired, resting, on sabbatical or between jobs\". I rather mean those that have the knowledge to create type. no matter if they are drawing curves at the moment or not.\n\n"
    },
    {
      "time": "11 Jul 2007 — 6:21am",
      "content": "What might be a more managable figure is \"How many people are earning a full time living in type design.\" This will take the number to to low double digits, I would think.\n\nAnd even then, is Thomas Phinney counted? He has designed fonts, but that is not the key part of his job, yet all of it is related to type.\n\n"
    },
    {
      "time": "11 Jul 2007 — 6:45am",
      "content": "Don, that question was the one concerning the werewolf thread I mentioned.\n\nhhp\n\n"
    },
    {
      "time": "11 Jul 2007 — 7:59am",
      "content": "Hell isn't a swear word - what kind of \\*\\*\\*\\* bible bashers run this operation?\n\nNick Cooke\n\n"
    },
    {
      "time": "11 Jul 2007 — 8:00am",
      "content": "Ha ha - I just did that to see what would happen. Stupid bunts.\n\nNick Cooke\n\n"
    },
    {
      "time": "11 Jul 2007 — 8:02am",
      "content": "Oh, by the way I make a living as a full time type designer.\n\nNick Cooke\n\n"
    },
    {
      "time": "11 Jul 2007 — 8:05am",
      "content": "It might be less contentious and more informative, to more people, to sort of zoom out from asking who is important or full-time or professional, and looking at the entire type culture or industry. Then compare that conglomeration to other industries or occupations, in terms of overall size. For instance, the type-making world is much much much smaller than the world of say, paving contractors, research scientists, or violinists (there's a sticky one! How many violinists are \"pro\"?)\n\nI think this is more interesting to non-type people; you can say, \"The type world is about as big as the puppetry world or the harpsichord-making world, and much smaller than the soccer world or the hang-gliding world\".\n\n"
    },
    {
      "time": "11 Jul 2007 — 8:47am",
      "content": "Henning, you could put together a design brief and contact the 328 foundries represented by Myfonts, and see how many say it's within their capabilities. Many of these foundries have more than one type designer.  \nOr use the Myfonts list of 2214 people: [http://www.myfonts.com/person/index.html](http://web.archive.org/web/20131019150250/http:/www.myfonts.com/person/index.html \"http://www.myfonts.com/person/index.html\").  \nFor freelancers who haven't published independently, you could go through a FontFont catalog (or contact FSI) and develop a list of their designers. Same thing for Linotype.\n\nNeil Macmillan, author of the \"A-Z of Type Designers\" might have some insights.\n\n"
    },
    {
      "time": "11 Jul 2007 — 9:04am",
      "content": "\\>\\>The type world is about as big as the puppetry world or the harpsichord-making world\n\nI just checked the US Census site to see if maybe \"type designer\" was listed under the index of occupations. It wasn't. Even in the detailed [breakdown](http://web.archive.org/web/20131019150250/http:/www.census.gov/hhes/www/ioindex/cens_260_296.html) of \"Arts, Design, Entertainment\", where Millinery Designers and Sign Designers are referenced, it goes without mention. A look at the alphabetical [breakdown](http://web.archive.org/web/20131019150250/http:/www.census.gov/hhes/www/ioindex/occ_t.html) yielded some interesting type-related professions that managed to get listed: hand compositor, type cutter (they lump this in with a host of other machine operators), and typographer. I would guess that type designers would likely fall into one of these classifications: 27-021 (Commercial and industrial Designers), 27-024 (Graphic Designers), or 27-029(all other Designers).\n\nBut that's only for the US, and couldn't figure out how to pull numbers out of this website. Furthermore, I'm not sure what kind of maintenance is regularly performed on there classification scheme, so you couldn't find the most obscure profession listed and then infer \"there are at least fewer type designers than Klingon translators/Penny Farthing BMXers/Autogyro mechanics in the US.\"\n\nEdit: [The Bureau of Labor Statistics](http://web.archive.org/web/20131019150250/http:/www.bls.gov/) might have been a better place to look, but I don't have time to figure the site out.\n\n"
    },
    {
      "time": "11 Jul 2007 — 9:19am",
      "content": "\\> design brief\n\nYou want people to admit they can only make \"junky\" fonts?\n\nhhp\n\n"
    },
    {
      "time": "11 Jul 2007 — 9:41am",
      "content": "A lot of people ask for ready answers at Typophile.  \nI'm suggesting doing original research, and some methods.  \nAs part of that, the researcher would have to structure the questions (and/or adjust the results) to make allowance for deceptive response.  \nAs for \"junk\" -- it's a subjective concept -- and if some people don't subscribe to others' notion of utility, I doubt they would consider that an admission of junkufacture.\n\n"
    },
    {
      "time": "11 Jul 2007 — 9:45am",
      "content": "My point is that Henning's criteria seem to preclude first-person judgment.  \nAnd that's a good thing.\n\nhhp\n\n"
    },
    {
      "time": "11 Jul 2007 — 10:12am",
      "content": "Maybe starting from typefaces could be another way to make a list since it allows dehac to make his own judgment about \"serious\".  \nEvidently this would take some time but could be an interesting basis for later discussions.\n\n"
    },
    {
      "time": "11 Jul 2007 — 10:25am",
      "content": "_Henning’s criteria seem to preclude first-person judgment.  \nAnd that’s a good thing._\n\nAgreed. Which is why I suggest presenting foundries with a brief \"to develop a complex and satisfactory fontsystem\".  \nIt would presumably list production criteria such as styles, weights, encodings, features, as well as usage specifications -- a hypothetical publication might be a good \"client\".  \nThe researcher would assess whether the foundry is adequate to the task or just b\\*llsh\\*tting, as a client would have to.  \nHowever, that's not always easy, as many suppliers offer services they don't have in-house -- which is quite legitimate; so some kind of \"first person judgement\" would be required at some point, to assess the junkiness factor.\n\nRather than presenting the brief as a hypothetical exercise, it might be better to ask if the foundry/designer has done such a project in the past -- either as a commission, or as a retail product -- and what the resulting typeface is.\n\n"
    },
    {
      "time": "11 Jul 2007 — 10:43am",
      "content": "Among type designers listed at MyFonts who are known or are presumed to be alive, there approx. 680 people who have designed at least three typeface families, and among these, approx. 470 who have designed at least five families.\n\nNote that this only counts people whose fonts are listed at MyFonts (i.e. either on sale or listed for reference). Most notable font foundries are included, though some are not. The database is very incomplete. For example, John Hudson is only credited as having designed two families, which is obviously wrong, since only the old Tiro Typeworks-exclusive fonts are counted.\n\nMyFonts sells very few non-European fonts. There are probably at least as many people who design Chinese, Japanese, Arabic, Indic, Thai etc. fonts that are only distributed in local markets, or people who do European-language typefaces but are not included in the MyFonts count.\n\nI think it would be fair to say that there around 1,000 active type designers in the world.\n\nAdam\n\n"
    },
    {
      "time": "11 Jul 2007 — 11:08am",
      "content": "Maybe I misread this, but shouldn't the criteria include a person who pays their bills with the money made from type design? Crap or not (which in itself is highly subjective) they are paying their bills. That should count for more than other things.\n\n"
    },
    {
      "time": "11 Jul 2007 — 11:21am",
      "content": "\"But I kind of mean those that not necessarily live from creating type, but are very much devoted to type design.\"\n\nThere are lot of good designers that don't live from type design so i don't think it's a good criteria.\n\n"
    },
    {
      "time": "11 Jul 2007 — 12:04pm",
      "content": "\\> hand compositor, type cutter (they lump this in with a host of other machine operators), and typographer.\n\nType cutter is probably the closest to a type designer. I suspect that there are fewer full time hand compositors out there than type designers (unless you stretch hand composition to using the hand to compose on a keyboard).\n\n"
    },
    {
      "time": "11 Jul 2007 — 3:13pm",
      "content": "\"shouldn’t the criteria include a person who pays their bills with the money made...\"\n\nOr maybe pays their own bills, and one other person's bills, at least? (Otherwise you get a lot students. yaknow;)\n\n"
    },
    {
      "time": "11 Jul 2007 — 3:23pm",
      "content": "<cite>...shouldn’t the criteria include a person who pays their bills with the money made from type design?</cite>\n\n ![](http://web.archive.org/web/20131019150250im_/http:/typophile.com/files/itc_check_5595.gif)\n\n[Apologies to Prof. Spiekermann.](http://web.archive.org/web/20131019150250/http:/www.spiekermann.com/mten/2007/02/get_rich_through_typedesign.html)\n\n"
    },
    {
      "time": "11 Jul 2007 — 4:36pm",
      "content": "Profitable venture that must have been for Erik :-)\n\nChrisL\n\n"
    },
    {
      "time": "11 Jul 2007 — 4:40pm",
      "content": "_Or maybe pays their own bills, and one other person’s bills, at least? (Otherwise you get a lot students. yaknow;)_\n\nBut then we are in the territory of defining foundries and not type designers. No? ;^)\n\n"
    },
    {
      "time": "11 Jul 2007 — 6:48pm",
      "content": "_What might be a more manageable figure is “How many people are earning a full time living in type design.” This will take the number to to low double digits, I would think._\n\nBy this criteria many historical designers would not qualify starting with Garamond who died deeply in debt. Bodoni wouldn't qualify either, nor Baskerville, nor even Gutenberg himself who made his money as a printer. Excoffon made his living as an advertising art director, as did Dwiggins for many years. There are a great many serious designers who didn't make their living designing type, but still produced important typefaces. Let's see, Tschichold, Cassandre, Eicher, Abrams, et al. Victor Gualtney doesn't make his living through type design, but there's no way he could not be considered serious.\n\nI think any measure of who's a type designer has to be based on intent. In fact those who are _not_ making money at it might be considered to be more serious. Why else are they doing it?\n\nIt might be better to consider how many people in the world are serious about typography and the work back from there. Between memberships in various organizations there have to be several thousand with a large percentage of them type designers.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    }
  ]
}
