{
  "id": "34995",
  "title": "FontLab Type 1 hinting preview, \"Adobe\" preview unavailable?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hey all,\n\nI seem to have lost my ability to preview Type 1 hints within FontLab 5.0.2 on the Mac with the Adobe rasterizer and I'm wondering if this has happened to anyone else.\n\nIn the \"Type 1 Preview\" hinting panel (Tools -\\> Hints & Guides -\\> Type 1 Hinting), there's a small dropdown menu at the top right of the preview area that lets you pick the rasterizer (choices are Apple B&W, Adobe B&W, Adobe Grayscale, FreeType B&W and FreeType Grayscale), but both Adobe items give me a preview of \"Sample font is not installed\" instead of the waterfall.\n\nI can't seem to find any reference to this menu in the FL5 manual PDF (the screen captures of this dialog box do not even show this dropdown menu). Also, this feature is working properly on my colleagues machines who are using essentially the same software setup as I am.\n\nTrashing the preferences and Application Support folders as well as trying when logged in as a different user do not seem to bring this functionality back.\n\nHas anyone out there had this same problem?\n\nMany thanks,  \nAndy\n\n",
  "author": "andyclymer",
  "time": "9 Jul 2007 — 1:08pm",
  "uid": "537",
  "comments": [
    {
      "time": "9 Jul 2007 — 4:45pm",
      "content": "Andy,\n\nare you using a beta version or a release version? Which build number? Which system? Did you remove your CurrentWorkspace.rc file?\n\nA.\n\n"
    },
    {
      "time": "10 Jul 2007 — 7:30am",
      "content": "Adam, thanks for your help:\n\nI'm using 5.0.2 build 2298 which I believe is a release version and Mac OS 10.4.8. I've also tried it with all workspace files removed. Is there any one particular support file that would be related to hinting that I may want to try to copy from a colleague's computer? Or, is it trying to save a temporary file and this is a permissions problem?\n\nThank you,  \nAndy\n\n"
    },
    {
      "time": "10 Jul 2007 — 7:40am",
      "content": "I recommend updating to FontLab Studio 5.0.4 that was just released:\n\n[http://typophile.com/node/35006](http://web.archive.org/web/20150317221330/http:/typophile.com/node/35006 \"http://typophile.com/node/35006\")\n\nA.\n\n"
    },
    {
      "time": "17 Feb 2015 — 8:41am",
      "content": "Hello,\n\nNow I seem to have the same problem. I'm using Font Lab Studio version 5.2.1 on Winows 8 (Build 4868). When I try to do Type 1 hinting, there is a message \"sample font is not installed\" in the preview panel. There is no preview. There is also no raster preview in the background of the glyph. What is the problem?\n\n"
    },
    {
      "time": "19 Feb 2015 — 8:13am",
      "content": "I just had to run the FLS as administrator. That resolved my problem.\n\n"
    }
  ]
}
