{
  "id": "35021",
  "title": "Quadratta Serif V12.5 ( ITALICS ) - Eng & Spa",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "(( Updates are at the bottom comments of this page and in \"attachments\"))\n\nHola soy Fernando Díaz y esty estudiando Diseño Gráfico en Uruguay, estoy haciendo una tipografía romana de transición y me gustaría mucho que la vicharan y me dieran consejos... espero les guste, Ferch\n\n\\*Hello my name is Fernando Díaz im studing Graphyc Design and I need some help with my first typography, please look at it and comment, hope you like... Ferch  \n.  \n.\n\n¡GRACIAS DESDE YA!  \n\\*THANKS IN ADVANCED!  \n.  \n.  \nFerchules\n\n| Attachment | Size |\n| --- | --- |\n| [QuadrattaSerifV9.1.pdf](http://web.archive.org/web/20150420093335/http:/typophile.com/files/QuadrattaSerifV9.1.pdf) | 266.88 KB |\n| [QuadrattaSerif V10.1.pdf](http://web.archive.org/web/20150420093335/http:/typophile.com/files/QuadrattaSerif%20V10.1.pdf) | 282.18 KB |\n| [QuadrattaSerif V125.pdf](http://web.archive.org/web/20150420093335/http:/typophile.com/files/QuadrattaSerif%20V125.pdf) | 257.69 KB |\n\n",
  "author": "ferfolio",
  "time": "10 Jul 2007 — 3:45pm",
  "uid": "19457",
  "comments": [
    {
      "time": "10 Jul 2007 — 6:40pm",
      "content": "What kind of help do you need Ferchules?\n\n"
    },
    {
      "time": "10 Jul 2007 — 7:17pm",
      "content": "I'm pasting my critique below that I put on Ferch's blog before I saw this post.\n\nPorque quiero más práctica (no es mi lengua nativa), te ofrece algunas sugerencias en español. Primero, sugiero que pongas el PDF en el forum que se llama “Critique – Serif,” porque es el mejor lugar para recibir críticas de su trabajo.\n\nPrimero, dices que Quadratta es “una mezcla de romana de transición con egipcia” – creo que ya hay un término para el grupo en que cabe Quadratta: “wedge serif,” en lo cual el serif es ancho como en un “slab” pero sigue de la letra en un ángulo (vaya a [http://typophile.com/node/34386](http://web.archive.org/web/20150420093335/http:/typophile.com/node/34386 \"http://typophile.com/node/34386\") para algunos ejemplos). Aún si es, no hay muchos en esta categoría.\n\nParece muy bueno; sólo hay unos problemas posibles que veo. En la “B,” el “bowl” superior (el parte que encapsula el espacio blanco) parece un poco tan pequeño y entonces la letra no tiene balanza ideal. Con la “E”, el brazo superior debe de ser menos largo (pero no mucho) que el inferior para crear la balanza. La “K,” la “T”, y la “R” tienen el mismo problema de ser un poco irregular. El “S” es la única letra mayor que tiene problemas serios: no me gusta que la línea asciende en el medio (parece un “bump” extraño). Además, la “S” “cae” a la izquierda un poquito.\n\nLa “b” es tan plano al fondo; debe de ser más como el “d.” No me encanta de la “g”; la “oreja” crea un lugar demasiado negro a la derecha, y el “bowl” inferior no cabe con el resto de las letras: debe de tener o más contraste o algo para remover el sentido de ser demasiado construido. La curva en la parte de la “t” sobre el “crossbar” es tan extrema, y preferiría si la parte fuera vertical. La “s” tiene las mismas problemas que la “S.”Es una decisión válida, pero no me gusta el punto en el cero. Finalmente, me encanta de su ligadura de “ch”, sus “tittles” (los puntos sobre la “i” y la “j”), y su “$.” Creo que va a ser un tipo bueno cuando terminas.\n\nAlgo más: Ya hay un tipo que se llama “Quadraat” y uno que se llama “Friz Quadrata.” Aunque los nombres no son exactamente el tuyo, sugiero que cambies el título para evitar problemas.\n\nUsa la función “Contact” en mi “profile” si no entiendes algo que escribí.\n\n"
    },
    {
      "time": "11 Jul 2007 — 11:24am",
      "content": "ARTICFUZZ:\n\nTANKS A LOT!\n\nNice tips, Its defenitly a \"wedge serif\", but I dont know how to translate it in spanish XD\n\nThe corrections helped me very very much: im redoing the \"S\" and \"K\", the others im correcting them.\n\nAbout “Quadraat” and “Friz Quadrata” I dont know what im going to do, for now i'll keep the name.\n\nim doing new adjustments, next week i'll post the new version, clearer, with bolds.\n\n----\n\nNICHOLASGROSS:\n\nI need all the help I can get from people with more experience, Im doing this tipography not only for my class but for a contest in latin américa (bienal de letras latinas 2008)... I dont have a lot of experience, im just 19 years old, so hehe any opinion would come great!\n\n----\n\nNumber3Pencils:\n\nProbaré poner los puntos de diéresis mas cerca!  \nGracias\n\nthanks for all the comments\n\nFerch\n\n"
    },
    {
      "time": "10 Jul 2007 — 11:07pm",
      "content": "Pienso que los puntos de los diéresis podrían estar menos lejos el uno al otro.\n\n(El español no es mi lengua nativa tampoco; yo también necesito practicar)\n\n"
    },
    {
      "time": "12 Jul 2007 — 11:49am",
      "content": "I've done a lot of corrections  \nplease check it out:\n\n[www.strass.somee.com/Critiq-QuadrattaSerif.pdf](http://web.archive.org/web/20150420093335/http:/www.strass.somee.com/Critiq-QuadrattaSerif.pdf \"www.strass.somee.com/Critiq-QuadrattaSerif.pdf\")\n\nI i need help with fontlab:\n\n[http://typophile.com/node/35058](http://web.archive.org/web/20150420093335/http:/typophile.com/node/35058 \"http://typophile.com/node/35058\")\n\ni'm having problems with font lab  \nIf you have any suggestions it will be nice\n\nthanx Ferch\n\n"
    },
    {
      "time": "12 Jul 2007 — 12:08pm",
      "content": "Tipografía desde Montevideo\n\nQuerido strass, va muy bien la letra. Noto tres \"cositas\". Y una cosa.\n\ncositas:\n\n1. En el \"5\" tenés unas redondeces que no aparecen en ningún otro signo, salvo en los puntos o comas, pero no en letras ni números.\n\n2. En el \"3\" en su parte central veo un nodo que supongo pusiste para restar peso, pero... ¿no quedaría mejor modificar la curva globalmente para no caer en ese accidente?\n\n3. Fijate el ajuste óptico de las \"Xx\" en cuanto al cruzamiento...\n\nCOSA:\n\n1. Las \"Ss\" todavía no están. Acordate de la diagonalidad del trazo central en ambas.\n\n"
    },
    {
      "time": "12 Jul 2007 — 7:09pm",
      "content": "Since your English is obviously very good, I'll do my second suggestions in that (saves me time, too).\n\nCapital letters: The \"R\" still seems awkward; maybe moving the leg to the right and reducing its angle will help. The \"K\" is likewise a bit strange, although I'm not sure how to improve it -- there's something about the height of the point of where the legs intersect the stem and the weight of the top leg that strikes me as weird. The \"U,\" unlike the \"O\" and \"Q,\" doesn't seem to overshoot the baseline, so it seems to be floating off it.\n\nLowercase: I still don't like the flat bottom on the \"b.\" If you're committed to keeping it, you need to make the transition from horizontal line to curve at the bottom right of the bowl smoother. The top right of the bowl of the \"p\" also suffers from the same ugly transition. I'd prefer, as I said before, if the top of the \"t\" were perfectly vertical instead of being angled slightly to the right. The \"s\" still exhibits a bump in the center, which should really be flattened out. And the \"g\" is better, but the bottom bowl's curves need to be revised -- it's lumpy. Also, it still feels off, and I think that more contrast is needed -- take a look at some \"g\"s in other fonts to see where the thins and thicks should go.\n\nOther characters: The \"6\" and \"9\" are too open; try closing the aperture some more. The top of the \"5\" should maybe be extended a bit more to balance it out. The hyphen is interesting, but I'd suggest adding something on the right end to even it out; maybe add an upward or downward serif. And you might try making the right-facing serif on the upside-down exclamation point into a left-facing one.\n\nI think it's looking good, with some details like the \"x\" and the angled corners of the inside of the bowls making it interesting. I wouldn't mind, however, if it had a bit more personality, as long as it doesn't hurt its readability. Maybe just something that will liven the letterforms slightly more, although I'm not sure what that might be.\n\n¡Muy buen trabajo! ¡Tengo 18 años, y espero que cuando cumplo 19 como ti tendré un tipo original también!\n\n"
    },
    {
      "time": "12 Jul 2007 — 7:48pm",
      "content": "Thanks auricfuzz!\n\nI agree with a lot of comments, ill try to correct them, who knows what it may lead to!  \nWhen you have a type in process let me know, and I'll tell my opinion!\n\nthe \"g\" is not finished, but is improving..\n\nBut first things first, i have problems with the \"Ss\" \"Xx\" \"5\" \"3\" acording to my teacher... so, thats the main issue for now...\n\n\"HANDS A LA WORK\"\n\nTHANKS AGAIN\n\nFerch\n\n"
    },
    {
      "time": "14 Jul 2007 — 12:26pm",
      "content": "I corrected many errors now!  \ncheck it out... Its way better (I think)\n\n[www.strass.somee.com/Critiq-QuadrattaSerifV2.pdf](http://web.archive.org/web/20150420093335/http:/www.strass.somee.com/Critiq-QuadrattaSerifV2.pdf \"www.strass.somee.com/Critiq-QuadrattaSerifV2.pdf\")\n\nWhat do you think:  \n\"K\" weard?  \n\"X\" light?  \n\"g\" light?  \n\"S\" light?  \n\"7,4\" weard?\n\nThanks  \nagain!\n\nFerch\n\n"
    },
    {
      "time": "14 Jul 2007 — 12:59pm",
      "content": "You're right; it's much better. Most of my criticisms have been resolved (the \"g\" is now _much_ better). My last suggestions (if you're not sick of me): the connection between the curve and the horizontal on the bottom of the b and the top of the p and q is still awkward. The top of the \"s\" should be a bit longer and over to the right, as should the \"S.\" The \"S\" might also be a tad light. The \"y\" is a bit dark where the two strokes meet; maybe try angling the inner outlines so that the strokes narrow toward the bottom. The \"R\" and \"K\" still seem imbalanced, and the serifs on the \"Z\" should be more prominent. The \"O\" and \"U\" don't appear to overshoot the baseline enough; they float slightly. I like your numbers better, although the 6 and 9 are still too open, and the hyphen needs something to balance the right side. Looking at your f ligatures, you may want to make the stroke that connects the \"f\" to the \"i,\" and \"f\" perfectly straight, not tapered; don't be afraid to change the letterforms to make them work in the ligatures.\n\n"
    },
    {
      "time": "14 Jul 2007 — 3:46pm",
      "content": "Thanks auricfuzz!\n\nhaha im not sick of you!  \ni like when people give their opinion!\n\ni'll see what i can correct ;)\n\nthanks again!\n\nFerch\n\n"
    },
    {
      "time": "17 Jul 2007 — 4:40am",
      "content": "I think it's very nice in general - I'd love to use it. Are you planning to release it?\n\nAm I right in thinking that the second arch of the \"m\" is less wide than the first one? Is this deliberate? It makes it look a little bit deformed to me.\n\n"
    },
    {
      "time": "17 Jul 2007 — 10:21am",
      "content": "Hello domdib\n\nYes, it is deliberate, but i corrected it las week becouse it was too wide\n\ni corrected a lot of errors now, in a cuppple of days i'll upload a new pdf with the latest version...\n\nThanks for the complements!\n\nbut this font has a lot of corrections more to be made :)\n\nI think i'll release it the first months of 2008, but, dont worry, you will be hearing from me before!\n\nthanksss\n\nFerch\n\n"
    },
    {
      "time": "19 Jul 2007 — 6:33am",
      "content": "Here is the new version\n\nhope you like!\n\n[www.strass.somee.com/Critiq-QuadrattaSerifV4.pdf](http://web.archive.org/web/20150420093335/http:/www.strass.somee.com/Critiq-QuadrattaSerifV4.pdf \"www.strass.somee.com/Critiq-QuadrattaSerifV4.pdf\")\n\nbye!  \nFerch\n\n"
    },
    {
      "time": "21 Jul 2007 — 2:23pm",
      "content": "Yes, I think it's shaping up v nicely, and I'd love to see the bold & italic when they're ready. One minor problem - looking at the kerning on \"Pa\" and \"Te\", I'd say you need to close it up a little.\n\n"
    },
    {
      "time": "28 Jul 2007 — 12:51pm",
      "content": "The whole font is very nicely done, good proportions, great logic and fine shapes but the lowercase a is a little bit too expected, in my opinion it needs to be more personnal to give to this font a stronger identity.\n\n"
    },
    {
      "time": "30 Jul 2007 — 12:28am",
      "content": "Primero, me encanta que incluyes una _ch_. Debe ser más tipos con ella, facilita mucho el leer en español. Quizás puedes probarla con la curvainferior de la _c_ aún más inferior: en una línea de texto, parece que no toca la línea base. Pero creo que una _ll_ también será bien incluida, aunque desafortunadamente no hay una forma estándar de ella.\n\nLa tilde me parece al revés, horizontalmente. Has dicho es para una competencia latinoamericana (¿latino o sólo hispano?) y por eso creo que será buena idea seguir la tradición española de crearla. Normalmente, la tilde parece más pequeña y estrechada por la izquierda, y más grande y ampliada por la derecha; a veces también todo el tilde parecerá que levanta tras la vergulilla. Véase algunos facsimiles en la biblioteca virtual de Cervantes de libros como don Quijote u otros. Igual con las otras tildes (graves y acutas) que me parecen más orientales que occidentales. Los europeos centrales y los griegos las prefieren casi vertical como tienes tú, pero los francofonos, lusofonos, e hispanohablantes prefieren más horizontal. También es cuestión de gusto, pero lo menciono por la competencia y la tradición en la lengua castellana.\n\nY de mi gusto personal, me gustará ver la _w_ mayúscula un poco más estrecha. Parece ahora que sólo consta de dos _v_es mayúsculas con los remates medios juntados. Fíjate que es mucha más amplia que la _m_ mayúscula, las cuales normalmente son de anchuras parecidas.\n\nY de la ortografía... en tu muestra, en la oración para las tildes, tienes «Que sea la última vez, nada más servió huír del cadáver», pero _huir_ no lleva tilde :)\n\nBuen trabajo. Me gusta mucho. Y en cuanto a la competencia, como aludí antes, ¿está abierta sólo a ciudadanos de países hispanohablantes en Latinoamérica?, o ¿se permiten entradas de Brasil, España, y Portugal también?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "30 Jul 2007 — 5:21am",
      "content": "Holaaa\n\nTo domdib:\n\nThanxs! ill fix that, in a cupple of days you'll see the new version :)\n\nTo kuroneko:\n\nThanxs! i'll keep that in mind, i was thinking of adding \"ll\" and \"rr\" and fix letters like \"Jj\" \"Tt\" \"y\" \"Kk\" \"W\" so they can be more original. In a cupple of days you'll see the new version, hopfuly with some nice changes :)\n\nTo Guifa:\n\nPrimero que nada perdón por la falta de ortografía jeje, en la nueva versión ya lo corregiré... :)  \nLuego muchas gracias por los aportes, esta tipografía esta hecha para un ejercicio de clase la cual terminó hace unos días. Mi profesor me invitó a la bienal de letras latinas, que es un concurso en el cual participan países de latinoamérica y también méxico:\n\n[http://www.letraslatinas.com/](http://web.archive.org/web/20150420093335/http:/www.letraslatinas.com/ \"http://www.letraslatinas.com/\")\n\nAcerca de la \"ll\" estoy pensando en incluírla y también la \"rr\". Por un lado mejor que no haya una forma \"estandar\" de esas dos letras, eso abre paso a la invención y originalidad, que es una de las cosas que estoy buscando... con eso y un poco más de trabajo espero que mi trabajo siga mejorando.\n\nMuy interesante la información del tilde, aunque todavía no esta definido finalmente, le voy a mostrar a mi profesor el comentario para discutir un poco más.\n\nTHANKS AGAIN FOR THE COMMENTS!!!  \nIT HAS A LOT OF WORK TO BE DONE :D\n\nGreetings  \nFerch\n\nPS: If I can take a look to your work it would be nice! If you want you can leave the links of your work here, I dont mind. :)\n\n"
    },
    {
      "time": "30 Jul 2007 — 9:21am",
      "content": "En cuanto a la _r_ doble, creo que no es necesario incluirla, por la razón simple que esa de verdad es dos eres (es decir, la r doble es la pronunciación doble de la r simple). Yo tengo mi tipo, Coruña, también en este foro, aunque tengo muchas cosas nuevas para enseñar, no he tenido el tiempo para hacer una muestra y cargarla recienmente. Soy más conservador en mis ch y ll, eso para que no parezca tan raro con lectores quienes no esperan las formas diferentes:\n\n ![](http://web.archive.org/web/20150420093335im_/http:/typophile.com/files/coruna_ch_ll_lig_5334.png)\n\nPondré más ejemplos de Coruña cuando se acabe el curso vernal aquí.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "30 Jul 2007 — 12:07pm",
      "content": "He visto estas ligaduras esencialmente españoles de que hablan (ch, ll, rr) en algunos tipos. Entonces me interesa el origen de estas ligaduras – ¿Vienen de la escritura, de algunos tipos históricos y notables, o de otro lugar? Espero que esta pregunta no sea muy tangencial.\n\n"
    },
    {
      "time": "31 Jul 2007 — 10:22am",
      "content": "Auricfuzz, esas ligaduras vienen del idioma, antes (20 años o algo así calculo) para nosotros la \"ch\" la \"ll\" y la \"rr\" eran consideradas letras en sí mismas... es decir al aprender el alfabeto pronunciábamos \"a, be, ce, che, de.... ele, elle... ere, erre... zeta\".\n\nLa \"ch\" además de una cuestión de idioma castellano tiene una gran defensa en algunas regiones por la utilización de ese sonido por algunas culturas de Argentina y México (nombro solo estos dos países pues desconozco el resto, pero creo que los incas también lo usan bastante)... es casi tan defendida por nosotros como la \"ñ\", y es por ello que encontraremos mas \"ch\" que \"rr\" o \"ll\"... una cuestión de resistencia digamos.\n\nEn cuanto a los tildes de strass... ya te lo había dicho!!\n\nEn cuanto a Letras Latinas (que cambiará de nombre para su edición 2008)... México también es Latinoamérica querido Strass\n\n"
    },
    {
      "time": "30 Jul 2007 — 2:54pm",
      "content": "Gracias por tu explicación, Vicente. ¿Sabes si aparecen estas ligaduras españoles (con formas distintas que las letras que las componen) en la escritura tambien, o es un fenónemo sólo de los tipos?\n\n"
    },
    {
      "time": "30 Jul 2007 — 10:06pm",
      "content": "En el pasado, la elle tenía apariencia diferente. Si lo recuerdo correctamente, parecía como yo ahora escribo mi 4 (línea vertical desde arriba al medio, línea horizontal como guión, línea vertical desde arriba como así:\n\n ![](http://web.archive.org/web/20150420093335im_/http:/typophile.com/files/ejemplo_ligadura_ll_5718.png)\n\nLa erre nunca ha tenido representación propia (al menos en español), porque nunca se ha considerado como letra propia (fíjaos que según la RAE, la _ch_ y _ll_ son todavía letras en el abecedario, sólo es que no se utiliza en ordenar palabras alfabéticamente. Aunque muchos dicen «erre» por _rr_ y «ere» por _r_, oficialmente la _r_ es «erre» —al menos que quieras enfatizar la cualidad vibrante simple, cuando se puede usar «ere»— y la erre es «erre erre» o «erre doble».) Pero como este tipo aquí es parte de un concurso de letras latinas (o para cualquier tipo destinado al uso en Latinoamérica), y en idiomas como guaraní sí es letra propia, se puede incluir una forma propia. Pero en este caso, tened cuidado de que esas lenguas también tiene otras digrafas, _mb_, _nd_, _ng_, _nt_, _tz_, etcétera.\n\nLa che tampoco tiene forma escrita especial, pero ya dicho, tiene más apoyo que las otras letras propias al castellano para una forma específica.  \n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "30 Jul 2007 — 10:45pm",
      "content": "Muchas gracias, Matthew. Muy interesante.\n\n"
    },
    {
      "time": "31 Jul 2007 — 10:21am",
      "content": "Guifa, muy interesantes y acertadops tus comentarios. No conocía ese ductus para la \"ll\".\n\nCon respecto a las letras dígrafas \"ch\", \"ll\" y \"rr\" es verdad que todavía la RAE las mantiene, pero están en retroceso -lamentablemente- incluso ya se puede ver la siguiente aclaración en el diccionario de la RAE:\n\n-inicio de la cita-  \n3.1. Orden alfabético\n\nLas entradas están dispuestas de acuerdo con el orden latino internacional. Por acuerdo del X Congreso de la Asociación de Academias de la Lengua Española (Madrid, 1994), las voces que contienen las combinaciones ch y ll se sitúan en sus lugares correspondientes dentro de c y l respectivamente, con un encabezamiento (CH, LL) que recuerda su condición convencional de letras del alfabeto español.  \n-fin de la cita-\n\nEntonces, en rigor, siguen siendo letras como bien dice guifa... todavía.\n\nLo de la \"rr\" no lo encontré por ningún lado y solo tengo como prueba de ello mi memoria al cursar la escuela en México. Tal vez sea cosa solo de los mexicanos, pero en realidad lo dudo...\n\nauricfuzz: no conozco ductus diferenciados para esas letras, más que lo s generados por el recurso de escritura manual, pero eso son ligaduras simplemente.\n\nStrass: gracias por dejarnos usar tu sitio para estas \"curiosidades\".\n\nCreo que una forma de defensa del idioma es la inclusión de signos específicos para estos sonidos.\n\n[www.tipografa.blogspot.com](http://web.archive.org/web/20150420093335/http:/www.tipografa.blogspot.com/ \"www.tipografa.blogspot.com\")\n\n"
    },
    {
      "time": "31 Jul 2007 — 1:51pm",
      "content": "[http://typographica.org/](http://web.archive.org/web/20150420093335/http:/typographica.org/ \"http://typographica.org/\")\n\nen este sitio, justamente en el cabezal encontré  \n-casualmente- una \"ll\" como un solo signo en idioma inglés.\n\n"
    },
    {
      "time": "31 Jul 2007 — 3:28pm",
      "content": "Muy interesantes los comentarios...  \nVoy a intentar más adelante hacer \"ll\" \"LL\" \"rr\" \"RR\" \"CH\" y \"ch\"  \nCrear signos no tan convencionales me hace pensar un poco más e ir a las raíces de nuestro lenguaje.\n\nVicente me había pasado el link de una tipografía chilena hace tiempo en la cual aparecen la letra \"rr\", una lástima que no hayan resuelto la \"RR\"\n\n[http://www.tipografia.cl/sitioantiguo/catalogo/catalogo\\_muestra/elementa...](http://web.archive.org/web/20150420093335/http:/www.tipografia.cl/sitioantiguo/catalogo/catalogo_muestra/elementalserif_muestra.htm \"http://www.tipografia.cl/sitioantiguo/catalogo/catalogo\\_muestra/elementalserif\\_muestra.htm\")\n\nSaludos\n\nFerch\n\nPD: Para los que aún no se dieron cuenta \"vicentelamonaca\" es mi profesor, muy buen profesor by the way [espero apruebe mi tipografía] jaja\n\n"
    },
    {
      "time": "31 Jul 2007 — 3:42pm",
      "content": "Ya mencionado pero sin énfasis, un buen recurso de investigación por internet en la redacción e impresión de la lengua castellana es la biblioteca virtual de Cervantes, ubicado a [http://www.cervantesvirtual.com](http://web.archive.org/web/20150420093335/http:/www.cervantesvirtual.com/ \"http://www.cervantesvirtual.com\") . Algunos textos tiene ediciones facsimiles, que incluso el uso casi totalmente olvidado de la ß en español (debes ir a textos antes de los 1800s para verla, después de esa época, no había uso común de la ese doble por las reformas lingüísticas). También tiene libros y publicaciones en catalán, galego, y portugués tanto otros idiomas.\n\nAunque es más recurso para literarios como yo, creo que os funcionará bien para investigaciones de la tipografía latina (es decir, idiomas romances).\n\nA la vez, será bien interesange estas otras ligaduras de nt, nd, etcétera, del guaraní. ng es bastante obvia, usando la letra por el sonido en el API.  \n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "31 Jul 2007 — 4:03pm",
      "content": "Dos cosas más:\n\n1) Vicente, creo que la “ll” es una combinación de dos letras cursivas, no una ligadura. Si vas [aquí](http://web.archive.org/web/20150420093335/http:/www.typofonderie.com/alphabets/view/ParisineOffice), se puede ver que hay muchísimos grupos de letras comunes en francés como este. Sin embargo, es interesante.\n\n2) He tenido dificultades en encontrar [este “thread”](http://web.archive.org/web/20150420093335/http:/www.typophile.com/node/31238) en que puse el ejemplo de Origen por Cristian Gonzalez, lo cual fue el fuente que me interesa en las ligaduras españolas. Pero este es otro ejemplo semejante de ellas.\n\n"
    },
    {
      "time": "1 Aug 2007 — 6:45am",
      "content": "Strass Ten cuidado al pensar la RR y la LL como tu dices, ya que la grafía tradicional de estas letras es Ll y Rr cuando son mayúsculas de párrafo o sustantivo.\n\nDiferente es siquieres hacer los glifos para textos totalmente en mayúsculas.. aunque tu tipo sin duda es para textos.\n\nAL menos es un aspecto más a tener en cueta.\n\nEs verdad lo de la doble ese, es un signo muy bello, guifa, ¿tienes idea del sus de la s alta y baja en español? el signo que pones en tu post creo que se ajusta más a la conjunción de s alta con baja y no a una doble ese exactamente, pero desconozco y por eso te lo pregunyo ya que desmuestras conocimiento en la materia. Gracias.\n\nPropongo, si estan de acuerdo que abramos otro post para seguir estos temas así dejamos a strass y quadratta sin tanto peso ¿les parece?\n\nV\n\n"
    },
    {
      "time": "1 Aug 2007 — 10:09pm",
      "content": "[www.strass.somee.com/Critiq-QuadrattaSerifV5prueba.pdf](http://web.archive.org/web/20150420093335/http:/www.strass.somee.com/Critiq-QuadrattaSerifV5prueba.pdf \"www.strass.somee.com/Critiq-QuadrattaSerifV5prueba.pdf\")\n\nBueno  \nes una prueba corrigiendo ciertos errores como el tílde... ahora está más horizontal, pero me parece que esta muy largo y medio despegado de la letra, que les parece?\n\nArreglé la \"g\" que generaba mucho espacio en blanco, la \"U\" las \"Ss\" que todavía no estan terminadas.\n\nAgregue a prepo \"rr\" \"ll\" \"Ch\" \"Ll\", no estan trabajadas todavía, si leen el pdf tendrán más información\n\nabrazo y gracias por los aportes\n\nFerch\n\n"
    },
    {
      "time": "2 Aug 2007 — 7:51am",
      "content": "El tilde no me parece nada mal en cuanto a su tamaño y/o altura. SI me parece que está muy a la izquierda, no tengas miedo de que se prolongue por fuera de la letra a la derecha (un poco claro.\n\nEn cuanto a la \"rr\"... me parece que se genera un sigo bastante llamativo, lo que no es bueno en tipos para texto... no la veo bien. Ojo, ya en elemental o en otros casos que la tienen así, no es un problema tuyo, solo que creo que no soluciona nada y complica bastante.\n\nTienes un problema general con la sobredimensión de la línea de base (se llama así a la compensación que se les da a las redondas y triangulares: sobredimensión y puede ser de línea de base, de mayúsculas, etc) Tus redondas \"c\" \"e\" \"o\" \"s\" bajan demasiado.  \nPor ejemplo cuando tenés una palabra como \"principal\" los serifs inferiores de \"rin\" te marcan una línea muy fuerte que evidencia aun más esta baja en la \"c\" en este caso.\n\nAbrazos tipográficos y la seguimos\n\n"
    },
    {
      "time": "3 Aug 2007 — 12:43pm",
      "content": "[http://typophile.com/files/Critiq-QuadrattaSerifV6.pdf](http://web.archive.org/web/20150420093335/http:/typophile.com/files/Critiq-QuadrattaSerifV6.pdf \"http://typophile.com/files/Critiq-QuadrattaSerifV6.pdf\")\n\nAhora mis pdf's pesan menos y son de más hojas jeje XD\n\nespero guste...\n\n- Nueva \"W\"  \n- Nuevos \"´\" \"`\"  \n- Nueva \"Ch\"\n\nSaludos\n\nFerch\n\n"
    },
    {
      "time": "3 Aug 2007 — 1:38pm",
      "content": "This is really a great font! I'm so impatient to see the final version of it. I'm completely in love with your $. I'm just not sure about two things : Is the \"Ch\" ligature really useful ? Then I still think your lowercase a should be more \"stylish\" I've made a try that you can see below, I'm not too sure about this one but I think you can experiment something by moving the middle line.\n\n ![](http://web.archive.org/web/20150420093335im_/http:/typophile.com/files/a_5047.gif)\n\n"
    },
    {
      "time": "4 Aug 2007 — 12:26pm",
      "content": "Thanks for the advice!\n\nI know what you mean, but my idea is to make it kind of \"square\"... it's the main caracteristic of this type i think..\n\nthanks anyway!\n\nFerch\n\n"
    },
    {
      "time": "18 Aug 2007 — 4:19pm",
      "content": "Les dejo la nueva versión\n\n[http://typophile.com/files/Critiq-QuadrattaSerifV7.5.pdf](http://web.archive.org/web/20150420093335/http:/typophile.com/files/Critiq-QuadrattaSerifV7.5.pdf \"http://typophile.com/files/Critiq-QuadrattaSerifV7.5.pdf\")\n\nCuenta con todos los signos para el idioma Español, Guaraní y Portugués... la idea es tratar de hacer todos los signos de las lenguas y dialectos principales de América latina.\n\nCosas nuevas:  \n- Tildes  \n- &  \n- ÅåçÇ  \n- ffi ffl  \n- Æ Ǽ OE æ ǽ oe þ  \n- y más\n\nGracias desde ya por observar y criticar\n\nFerch\n\n"
    },
    {
      "time": "20 Aug 2007 — 3:52pm",
      "content": "Ferch,\n\nRe my last comment on the kerning of \"Te\" and \"Pa\" - this looks much better now: \"Pa\" could perhaps stand tightening a hair further, but \"Te\" looks good.\n\nI'm ashamed to admit it, but until now my comments have been based on examining the PDF onscreen. However, I printed pages from 7.5 out, and the thing that struck me immediately is that the lower case \"r\" is in serious need of treatment. It somehow appears bolder than every other lower case letter, so it really messes up the texture of the page. This is more noticeable in 12 pt. Perhaps the program you are using to create the PDF is introducing an error with this letter? Also, the kerning of this letter looks a bit off in a number of combinations - maybe the side-bearings need attention?\n\nOther comments: kerning of the apostrophe could be improved, as in \"world's\"; the \"ll\" ligature does not look v. good at the bottom - each of the serifs are bigger than for the single \"l\", so the two joined together produces an untidy dark blob; and in the \"ti\" ligature, the \"i\" strangely appears bolder than when it is a single letter.\n\nSorry if these comments seem rather negative - all in all I think it's a very promising font, and if you fix these points (please at least consider fixing the \"r\"), it should do very well.\n\nRegards,\n\ndomdib\n\n"
    },
    {
      "time": "20 Aug 2007 — 4:23pm",
      "content": "Domdib:\n\nthanks for the comment!  \ni dont mind if the comments are negative, as long as they are constructive critiques :)\n\nim printing it on a laser printer and the \"r\" looks good at most sizes, i should probably print it out in other machines to see if there's any difference!\n\nabout the \"Pa\" you are right, it needs a little bit of adjusment.  \nthe \"ll\" it was just a test, i dont know, im not convinced yet hehe  \nand about the \"ti\" i'll take a look, and try printing in different printers\n\nthanks for your time!! :)\n\nFerch\n\n"
    },
    {
      "time": "21 Aug 2007 — 3:25am",
      "content": "Maybe it's just my eyes, but the apparent boldness of the \"r\" really becomes noticeable in continuous text. My comment about the side-bearings is probably wrong, but there definitely seems to be a kerning issue in the \"rp\" pair - just look at the word \"Airport\". Another kern issue - \"Tr\" is too wide.\n\n"
    },
    {
      "time": "21 Aug 2007 — 6:13pm",
      "content": "Fer:\n\nSi vemos la palabra \"reconocimiento\" por ejemplo, aisladamente... los serifs gruesos de la \"n-i-m-n\" me pesan demasiado. Creo que debés concentrarte en este aspecto: tratar de reducir mínimamnte este grosor y/o aumentar el de las curvas abiertas \"e\" \"c\" y en menor medida el de la \"o\". Por lo demás tenés glifos muy buenos, pero esto que te marco me parece lo más global....\n\nAATT (sacás?)\n\n"
    },
    {
      "time": "22 Aug 2007 — 7:47am",
      "content": "Hola vic!\n\nbueno, mirando un poco mas global la letra, yo creo que sacrificando un poco los serifs no va a cambiar su esencia, y si esto la hace mas legible, entonces, mejor!\n\nY sobre lo segundo, el grosor de las curvas abiertas, creo que entiendo, decís que engrose la \"parte vertical\" de la \"e\" \"c\" y \"o\" para crear un poco mas de contraste?  \npuede ser, ahora viéndolo impreso la parte gruesa de estos 3 signos es algo liviana.\n\nComo siempre, gracias por tu tiempo\n\nCreo que saco  \nAbrazos Tipográficos?\n\nFerch\n\nPD: Mucha fuerza para Cármenes!\n\n"
    },
    {
      "time": "22 Aug 2007 — 7:49am",
      "content": "Domdib:\n\nYou are rigt about the kering, and te \"r\" is a little bit bold too  \nI have a lot of new kerning pairs to correct XD\n\nthanx very very much!\n\nFerch\n\n"
    },
    {
      "time": "28 Aug 2007 — 11:19am",
      "content": "ENGLISH:\n\nNew uppload\n\nV8.0  \n.  \n [http://typophile.com/files/QuadrattaSerifV8.0.pdf](http://web.archive.org/web/20150420093335/http:/typophile.com/files/QuadrattaSerifV8.0.pdf \"http://typophile.com/files/QuadrattaSerifV8.0.pdf\")  \n.  \nAvailable lenguages up to the moment: Spanish, Portugese, Guaraní, French, English and Italian.\n\nNEXT:\n\n+ New numbers  \n+ Small Caps  \n+ Bold, Italic, Bold-Italic.  \n+ Math signs\n\nThanks for all the comments\n\nFerch\n\n"
    },
    {
      "time": "28 Aug 2007 — 11:18am",
      "content": "ESPAÑOL:\n\nNueva versión\n\nV8.0  \n.  \n [http://typophile.com/files/QuadrattaSerifV8.0.pdf](http://web.archive.org/web/20150420093335/http:/typophile.com/files/QuadrattaSerifV8.0.pdf \"http://typophile.com/files/QuadrattaSerifV8.0.pdf\")  \n.\n\nLas lenguas disponibles hasta el momento son: Español, Portugués, Guaraní, Francés, Inglés, e Italiano.\n\nPROXIMAMENTE:\n\n+ Nuevos números  \n+ Versalitas  \n+ Signos matemáticos  \n+ Versiones: Bold, Italic, Bold-italic.\n\nGracias por los commentarios\n\nFerch\n\n"
    },
    {
      "time": "28 Aug 2007 — 11:25am",
      "content": "De ahora en adelante empiezo a hablar en español e ingles así más personas pueden entender y comentar mi proyecto. :) Y me sirve para practicar un poco el inglés\n\n\\* From now on, im speaking in english, and spanish so more people can understand and comment, :) And i get to practice English a bit\n\nSaludos  \n\\*Greetings\n\nFerch  \n\\*Ferch XD\n\n"
    },
    {
      "time": "28 Aug 2007 — 12:47pm",
      "content": "Thank you for the translations!\n\n"
    },
    {
      "time": "30 Aug 2007 — 2:59pm",
      "content": "Ferch,\n\nIt looks like you made a change to the \"r\". Looking at it now, I'm beginning to wonder if it's too thin (particularly noticeable at 10/12) :-( Maybe my suggestion was wrong after all. Since I'm not a type designer myself, I don't really know any tips or tricks for fixing a letter that appears over or under-bold relative to the rest of the glyphs. Maybe your teacher could take a look, to check I haven't misled you - I sure hope not.\n\nDomdib\n\n"
    },
    {
      "time": "3 Sep 2007 — 11:57am",
      "content": "ESPAÑOL:\n\nNueva versión\n\nV9.1  \n.  \n [http://typophile.com/files/QuadrattaSerifV9.1.pdf](http://web.archive.org/web/20150420093335/http:/typophile.com/files/QuadrattaSerifV9.1.pdf \"http://typophile.com/files/QuadrattaSerifV9.1.pdf\")  \n.\n\nENGLISH:\n\nNew uppload\n\nV9.1  \n.  \n [http://typophile.com/files/QuadrattaSerifV9.1.pdf](http://web.archive.org/web/20150420093335/http:/typophile.com/files/QuadrattaSerifV9.1.pdf \"http://typophile.com/files/QuadrattaSerifV9.1.pdf\")  \n.\n\n"
    },
    {
      "time": "3 Sep 2007 — 5:06am",
      "content": "Adobe Reader 8 reports that the latest PDF is damaged and can't be repaired :-(\n\n"
    },
    {
      "time": "3 Sep 2007 — 12:07pm",
      "content": "Perdón por la falla técnica jeje  \nSorry for the tecnic failure hehe\n\nSaludos  \nGreetings\n\nFerch\n\n"
    }
  ]
}
