{
  "id": "35062",
  "title": "III/iii in Script?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi. This is my first post, so hopefully I'm putting it in the right place. I'm working on some wedding invites for myself and I've come across a design/typography issue that I've never encountered or really even considered. The bulk of the invites are (currently) set in Centaur MT Small Caps & Oldstyle Figures, with accents in Miss Le Gatees. The names are set in the latter (script), and I am the third (legally Donald Studley, III). Obviously I don't want to put \"III\" in a script face, so does that mean proper typography calls for \"iii\" when abbreviating numerals in this way? Alternatively, since this is a wedding invite and formality generally rules over brevity (i.e. \"at half after six\"), am I to spell out \"the third\"?\n\nAny insight or feedback would be greatly appreciated. Thanks in advance!\n\n",
  "author": "studleytrey",
  "time": "11 Jul 2007 — 9:22pm",
  "uid": "19549",
  "comments": [
    {
      "time": "11 Jul 2007 — 10:34pm",
      "content": "Hi there, Trey... While I don't have an answer for you, I suggest you post some images of what you have right now, plus the alternate versions you have thought up.\n\n"
    },
    {
      "time": "11 Jul 2007 — 10:37pm",
      "content": "I'd do what seems most aesthetically pleasing. Looking at Miss Le Gatees on Veer, you're completely right -- the \"III\" doesn't look good at all. \"iii\" is a possibility, although I prefer your idea of spelling out \"the Third.\" Would \"Donald Studley, 3rd\" be acceptable? You can also see how using Centaur to write \"III\" looks. Centaur small caps \"III\" could work, but if you use Centaur and Miss Le Gatees in the same line as I've suggested, make sure that the color stays the same between words to ensure a professional look.\n\n"
    },
    {
      "time": "12 Jul 2007 — 6:29am",
      "content": "If you are accepting the ornateness of a script face, then I feel you should go all the way, and spell it out in fully, \"Donald Studley the Third\".\n\nOf course, if you don't want to seem pretentious, you may opt for another solution.\n\n:)\n\n"
    },
    {
      "time": "12 Jul 2007 — 1:12pm",
      "content": "Thank you for the feedback. I will post some images and see if that helps.  \nThe original:\n\n ![](http://web.archive.org/web/20150325071232im_/http:/typophile.com/files/invite1_4816.jpg)\n  \nHere is a glyph that is kind of faking a normal, non-script \"III\", which I didn't think of before:  \n\n ![](http://web.archive.org/web/20150325071232im_/http:/typophile.com/files/3rd_1_3774.gif)\n  \nthe third (capitalized \"Third\" seemed to give it too much importance):  \n\n ![](http://web.archive.org/web/20150325071232im_/http:/typophile.com/files/3rd_2_6697.gif)\n  \n3rd (should I drop the \"the\" in this case?):  \n\n ![](http://web.archive.org/web/20150325071232im_/http:/typophile.com/files/3rd_3_4400.gif)\n\nOpinions? Thanks again for chiming in on this :)\n\n"
    },
    {
      "time": "12 Jul 2007 — 1:36pm",
      "content": "When ATF designed script fonts for weddng and invitations they always inserted roman numerals in the font. If you look at some of the wedding catalogs you will see what I mean\n\n"
    },
    {
      "time": "12 Jul 2007 — 1:53pm",
      "content": "So something more along these lines...\n\n ![](http://web.archive.org/web/20150325071232im_/http:/typophile.com/files/3rd_4_5897.gif)\n\n"
    },
    {
      "time": "12 Jul 2007 — 3:21pm",
      "content": "P.S. \"half past six\" or \"six-thirty in the evening\" would be preferable to \"half after six.\"\n\n"
    },
    {
      "time": "12 Jul 2007 — 4:01pm",
      "content": "Thanks oldnick, I found that wording somewhere while researching \"proper\" wedding verbiage, but I much prefer your options. I'll definitely swap that.\n\n"
    },
    {
      "time": "12 Jul 2007 — 5:33pm",
      "content": "The other option might be to take your faked normal version, and find an appropriate swash to go above and beneath so it doesn't look too plain in comparison.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "12 Jul 2007 — 9:09pm",
      "content": "Is there something improper about simply omitting \"the third\"? I'd imagine you don't introduce yourself as \"the third,\" do you?\n\nJust wondering. I worked at William Arthur typesetting invitations (yawn) for a while, but I can't recall ever dealing with such numerals on invitations.\n\nLovely invite, btw, and congratulations!\n\n"
    },
    {
      "time": "14 Jul 2007 — 6:06pm",
      "content": "guifa, I like your thinking. I do like customizing letters to suit the situation (time/job permitting), and I think the y might be able to reach out and integrate with the \"III\"s nicely. Cheers!\n\nOn the other hand, Alaskan brings up a good point. Actually, when I introduce myself, it's Trey (nickname for third), but I was trying to do the proper formal, invitation thing. In fact, I'm sure there will be people that receive these that wouldn't even know me by my legal name, particularly some of her more distant family. So I guess that brings up another question: Is it wrong to put a nickname on something formal like a wedding invitation? We have already decided that \"Trey\" will be used in the ceremony and I also used it on the save the dates I made. Hmmn...I'll have to think that one over. Any further insight appreciated as well.\n\nOh, and thanks for the kind words, Alaskan.\n\n"
    },
    {
      "time": "13 Jul 2007 — 6:21am",
      "content": "Oh do use the half after six. It fits the archaic style you are aiming for.\n\n"
    }
  ]
}
