{
  "id": "35060",
  "title": "Trouble with Engravers Gothic!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi Everyone;  \nI am having a really hard time with a combination of typefaces.\n\nHere is the problem:\n\nI'm doing a website for a client (photographer).\n\nLogo for client is in Engravers gothic (similar to the Marc Jacobs logo) - it has a fairly strong presence on the page. The overall look for the site is clean and elegant. Lots of white space with some image-heavy sections.\n\nSo I need to lay out the navigation and text for the site - but I'm having a hard time figuring out what typeface will work on the page with the strong presence of Engravers Gothic. This is an impossible typefact to work around!\n\nDoes anyone have a suggestion for navigation and body copy text that won't clash with the somewhat extended look of the Engravers font - without actually setting the nav items and copy in an extended typeface? (I think a whole paragraph in an extended face - or all set in Engravers (which is all caps) would look awful.)\n\nI'm not adverse to using serif - just think a san serif look on the web is cleaner and more readable.\n\nI mean, can I use Helvetica? Will something like Helvetica completely wreck the elegance of Engravers Gothic?\n\nI'm confounded.\n\nThanks.\n\n",
  "author": "remy",
  "time": "11 Jul 2007 — 7:33pm",
  "uid": "16677",
  "comments": [
    {
      "time": "11 Jul 2007 — 11:37pm",
      "content": "Is it a flash website? Otherwise you haven't many options. IMHO Helvetica can do no harm\n\n"
    },
    {
      "time": "12 Jul 2007 — 6:34am",
      "content": "I would avoid the serif. They just don't work well on the web. Helvetica is also better in print than on the web, IMO. You could test with both Verdana and Trebuchet to see which of these designed for the web fonts work best. Manlio is correct in that you are limited in options ... many people will not have Helvetica on their system, and might get Times as a default on an HTML page. The two fonts I mention are options not for their beauty, but because they are on pretty much everyone's system.\n\n"
    },
    {
      "time": "12 Jul 2007 — 6:53am",
      "content": "sorry I should have mentioned - it's a Flash site.\n\nWhen I go to sites that use Engravers Gothic type fonts in their logos (ie: Aqua di Parma, Marc Jacobs) I notice they use the same font (EG) in their nav items as well. I'm hoping to avoid that all-caps look.\n\nSince it's a Flash I can use anything. Eventually I'll probably do new letterhead, business cards, etc. for the client so I'm hoping to find something that works well with Engravers in print as well. But finding a san serif that works well with this logo on the web is a first priority.\n\nThanks!\n\n"
    },
    {
      "time": "12 Jul 2007 — 9:55am",
      "content": "Can you contact me? -- I'm developing a Flash typetester for my site, and I'd be interested to know if it helps assess fonts for the purposes mentioned. (And I have a face that may work for you.)\n\n"
    },
    {
      "time": "12 Jul 2007 — 3:28pm",
      "content": "I WOULD USE ANY CONTRASTING SHAPED SERIF FONT THAT READS WELL. Engravers Gothic is a thing of the past when steel die engraving was a matter of elegance and later tried to be imitated in the letterrpress printing process. Also reversing type out of a dark background is the anthesis of legibility. Most offensive is blue reversing out of a black background.\n\n"
    },
    {
      "time": "15 Jul 2007 — 4:45am",
      "content": "It looks nice with a roman or something like Palace Script, but you end up with a very classy and old-fashioned look (like the invitation cards you see in the middle of the 1943 Powell & Pressburger film “The life and death of Colonel Blimp”). This might not be what your client is after, though.\n\n"
    },
    {
      "time": "15 Jul 2007 — 4:46am",
      "content": "“I mean, can I use Helvetica? Will something like Helvetica completely wreck the elegance of Engravers Gothic?”\n\nRolex watches combine it with Univers on their website (and print stuff).  \n [http://www.rolex.com/en/index](http://web.archive.org/web/20150227204246/http:/www.rolex.com/en/index \"http://www.rolex.com/en/index\")\n\n"
    },
    {
      "time": "15 Jul 2007 — 11:24pm",
      "content": "Go for contrast with a condensed sans that's not too clinical, like Monotype Grotesque, Bureau Grotesque, Titling Gothic...\n\nHeck, even a narrow sans like Trade Gothic or News Gothic would do.\n\n"
    },
    {
      "time": "16 Jul 2007 — 7:13am",
      "content": "Thank you so much - that Rolex website is so helpful to look at.\n\nI have to say, although I think they did it well, I'm not loving the Engravers at all. I think it somehow looks 'forced' on screen. The all caps I find hard to read - or at least not easy on the eyes. It's definitely a look. Thanks sihep for pointing that site out. It's great to see it in use. And it confirmed all my suspicions - I'll probably go back to the drawing board.\n\n"
    }
  ]
}
