{
  "id": "35077",
  "title": "sIFR 2",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.mikeindustries.com/sifr/](http://web.archive.org/web/20090819103301/http:/www.mikeindustries.com/sifr/ \"http://www.mikeindustries.com/sifr/\")\n\nanyone know how well this works? i guess it’s been around for a while but i really havent heard too much about it. anyone using it currently? any comments, good or bad?\n\n\\_will\n\n",
  "author": "<a href=\"/web/20090819103301/http://typophile.com/user/4552\" title=\"View user profile.\">Will Miller</a>",
  "time": "<br>",
  "uid": "4552",
  "comments": [
    {
      "time": " 12.Jul.2007 8.13am",
      "content": "Pro: It’s really the only way to switch html text to your own font on the fly.\n\nCons: Flash is based on quadratic curves, not bezier, so there is some distortion of the letterforms that savvy folks will notice. It can also be slow to load if you have a lot of sIFR or your server is weak.\n\nIt’s become more popular, with even some major corps employing it, but I don’t think it’s quite mainstream yet.\n\n"
    },
    {
      "time": " 12.Jul.2007 8.23am",
      "content": "i like that it’s not mainstream. our small firm is thinking about upgrading the ol’ site and i’m looking into some new technology solutions. i was surprised i’d never come across this before. as you said, it has some fall backs but when non-type savvy people are browsing your site it’s an excellent alternative. do you know what major corporations are implementing this currently?\n\nw|m\n\n"
    },
    {
      "time": " 12.Jul.2007 11.21am",
      "content": "Ech... It has the capability of doing horrendous things to the aliasing of type. My suggestion is to stay away from very subtle kinds of type and stick to the beefier, more blocky types. Clarendon vs Baskerville for instance.\n\nWhat’s very, very cool about this technique is that unlike an image, you can still select the type! 99% of end users won’t notice the difference, aside from the things mentioned by Stephen.\n\n"
    },
    {
      "time": " 12.Jul.2007 12.49pm",
      "content": "Typophile’s headings are currently created in a similar way, aren’t they?\n\n"
    },
    {
      "time": " 12.Jul.2007 2.17pm",
      "content": "Yep.\n\n"
    },
    {
      "time": " 12.Jul.2007 4.22pm",
      "content": "But there’s a lack of kerning in these headings. Flash supports\\* kern definitions for embedded font in dynamic text field but this requires “kerning” property set to “true” in StyleSheet or TextFormat, which is “false” by default. JavaScript file, which implements these “flashish” headings on Typophile does not define this property. This should be confronted with appropriate developer.\n\n\\* There’s one strange hack – reference says, that kerning in Flash is supported only in swfs created on Windows.\n\n"
    },
    {
      "time": " 12.Jul.2007 4.58pm",
      "content": "Text antialiasing improved a lot in version 8 of Flash Player.\n\nBut sIFR 2 is by default set to target FP version 6. Which means: even if a more recent version of the FP is installed, text is rendered like in version 6.\n\nTo get the better text rendering of FP8, it is necessary to change the Flash Version to 8 under Publish Settings, set the TextField antialiasing setting to “Anti-alias for readability”, and republish the SWF file.\n\nsIFR 3 beta is already available and targets FP8, but it seemed very buggy last time I tried it.\n\n— [omine.net](http://web.archive.org/web/20090819103301/http:/www.omine.net/)\n\n"
    },
    {
      "time": " 12.Jul.2007 5.30pm",
      "content": "It’s been a while since I’ve tried sIFR, but as I remember it’s kind of a pain. The solution we use here uses the flash extension for jQuery. It makes it really easy to write the substitution rules. [http://jquery.lukelutman.com/plugins/flash/](http://web.archive.org/web/20090819103301/http:/jquery.lukelutman.com/plugins/flash/)\n\n"
    },
    {
      "time": " 12.Jul.2007 10.40pm",
      "content": "Life promises to get interesting over the next year or so, because you can _also_ do sIFR-like stuff using Safari/Firefox Canvas (which implements cubic drawing natively), and of course the MS platform gives you a bunch of different ways of accomplishing more or less the same thing, as long as you’re willing to drink their kool-aid.\n\nIncidentally, the distortion in pre-8 Flash is not because it’s based on quadratics per se (remember, native TrueTypes are quads as well), but because that conversion is done crudely. I’d guess that they implemented conversion from Type1 a long time ago and never really had a chance to redo it right. That is, of course, until Flash 8, where they reimplemented the whole font stack from scratch. The free software communist in me doesn’t like it because it forces you to use proprietary tools, but that’s probably not as important a consideration for most of the people here.\n\nI think Adobe does a pretty good job of pushing new Flash versions. It’s probably reasonable to expect version 8 or better, especially if you can just fail to the wrong font, rather than to a totally broken page.\n\n"
    },
    {
      "time": " 12.Jul.2007 11.08pm",
      "content": "Thanks for the clarification, Raph. I’ve been shouting about the quadrats without the facts. I look forward to seeing an improvement in Flash 8 / sIFR 3.\n\n"
    },
    {
      "time": " 13.Jul.2007 5.54am",
      "content": "sIFR is useful if you MUST have custom typefaces for headlines and the like created dynamically from a database or CMS or the like.\n\nHowever, for relatively static sites, it’s still probably easier for both you the developer and the end-user to use good ol’ GIFs of your rendered headlines.\n\n"
    },
    {
      "time": " 13.Jul.2007 9.41am",
      "content": "gif’s are easy too, but it’s nice to keep that text selectable, searchable etc...makes finding your way around the page a tad easier. but i don’t know why, something just feels so satisfactory about being able to choose what font you want to use on headlines in a html page. it’s that impossible dream somewhat come true\n\nw|m\n\n"
    },
    {
      "time": " 13.Jul.2007 11.14am",
      "content": "Not to rain on anyone’s parade, but beware of the foundries EULA, many still do not allow embedding on the web.\n\n"
    },
    {
      "time": " 13.Jul.2007 11.43am",
      "content": "“gif’s are easy too, but it’s nice to keep that text selectable, searchable etc”\n\nGIFs can certainly be searchable (via googld and the like) via proper alt attributes.\n\nYes, if Selecting and Searching on-page are imortant, though, sIFR probably wins. But, you really shouldn’t be using sIFR for anything more than headlines, so perhaps that benefit isn’t as strong at that point.\n\n“but i don’t know why, something just feels so satisfactory about being able to choose what font you want to use on headlines in a html page.”\n\nTrue.\n\n"
    },
    {
      "time": " 13.Jul.2007 3.54pm",
      "content": "This is from the [License Myriad Pro in CS2 Package](http://web.archive.org/web/20090819103301/http:/www.typophile.com/node/35068) thread:\n\n**DanGayle** :  \nThe file that is used by sIFR is basically the digital font embedded in a .SWF Flash file. I’ve seen websites that clearly violate the spirit of the EULAs by distributing that .SWF across the internet for free, possibly just renaming the .SWF file.\n\nI know in my heart of hearts that that is wrong, but where does that stand legally?\n\n**sii**  \nIf you take the position that in this case the .SWF is a derivative font, then for sure this would break most font EULAs. Someone would need to go after one of these guys to prove that. Obviously that ’someone’ would not be Adobe. ;-)\n\nIn the past I don’t think type designers have shown any interest in testing the limits of Flash and font encapsulation. Turning a blind eye often comes back to bite you. This may be a case of that, and who wants to be bitten by a blind eye.\n\nI recall writing to the lead developer of Flash before it was even a Macromedia asset, regarding respect for embedding permissions. I don’t recall the exact answer but I don’t think it was positive. I have no idea what Flash does now.\n\nThis was a loooooooong time ago, and my employer at the time was probably a temp agency. In addition I think the type community’s lack of interest in Flash extended to MS as well as everyone else. It’s been a few years since the product was aquired by Adobe so they must be doing the right thing. Anyone tried embedding a no-embedding font using Flash?\n\n**Miss Tiffany**  \nUnless my most recent research has a major error — Thomas please correct me! — Fonts licensed from Adobe which are from Adobe Originals, Bauer, & other wholly-owned fonts by Adobe can be used embedded in things such as sIFR.\n\n"
    }
  ]
}
