{
  "id": "35097",
  "title": "Order of the Phoenix: Pleasant Surprise for Typos",
  "forum": "Design",
  "tags": [

  ],
  "content": "Wow. I just saw some fantastic typography all over the new Potter film. What a nice surprise to see such carefully chosen type, very much of it in the old style(s), in a movie. Newspapers, signs, closing credits - everything throughout the film - ughh. It was like porno for typos.\n\nFilm is a medium with which I have not seen type treated with this kind of attention (credits excluded - there are many wonderful examples of beautifully set credits!). Does anyone have any favorite type-showcasing films? Please share your experiences.\n\nFeel free to include any documentaries about type, too, I guess. Many of us are familiar with the the Helv documentary (maybe even seething to see it), but I suspect there may be more out there.\n\nBest,  \nRay\n\nP.S. By the way (and my intention is not to turn this into a HP thread), but even beyond the type treats, HP5 is a fantastic film...\n\n [‹ 'Spoken' looking typeface](http://web.archive.org/web/20080603175935/http:/www.typophile.com/node/36135 \"Go to previous forum topic\") [garamond anyone? ›](http://web.archive.org/web/20080603175935/http:/www.typophile.com/node/33124 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080603175935/http://www.typophile.com/user/14473\" title=\"View user profile.\">microspective</a>",
  "time": "<br>",
  "uid": "14473",
  "comments": [
    {
      "time": " 12.Jul.2007 10.40pm",
      "content": "Well, now I’m really psyched to see it. I can’t wait to see what you’re talking about.\n\n"
    },
    {
      "time": " 12.Jul.2007 10.57pm",
      "content": "The end credits for the first or second Harry Potter film, showing footsteps through a hand lettered map, were incredible.\n\n"
    },
    {
      "time": " 13.Jul.2007 12.21am",
      "content": "Se7en really opened my eyes to type as an aesthetic element in films; I was still at senior school at the time, 15 maybe.\n\nAnd I remember this story breaking about the use of historical type in period films, specifically helvetica in good night and good luck:\n\n[http://typophile.com/node/17039](http://web.archive.org/web/20080603175935/http:/typophile.com/node/17039 \"http://typophile.com/node/17039\")\n\nFinally... for now, at least... Tomato have done some excellent work in film, Trainspotting being the first that comes to mind.\n\nBut films and typography, my two all-consuming passions, rarely seem to cross paths...\n\nAnthony\n\n"
    },
    {
      "time": " 13.Jul.2007 12.25am",
      "content": "The Talented Mr. Simonson has a lot to say about type in movies:\n\n[http://www.ms-studio.com/typecasting.html](http://web.archive.org/web/20080603175935/http:/www.ms-studio.com/typecasting.html \"http://www.ms-studio.com/typecasting.html\")\n\n"
    },
    {
      "time": " 13.Jul.2007 7.41am",
      "content": "I was going to post about this after I caught OotP, but for some reason I didn’t.\n\nThe movie really did have a lot of sick type stuff to offer. Between the main transitions that were done in 3d animated, 2d pages from the Daily Prophet, to the typographic riot that were Umbridge’s decrees, someone was really earning their paycheck. Too bad I can’t find any screenshots of the Prophet’s sleek new redesign. In all the previous films, the main heads were done in wizard-anachronistic blackletter, but in the latest outing, most of it was done in a weathered, black, condensed sans (though the text still looked like a gnarly blackletter). It’s too bad they omitted all the stuff about the Quibbler – I’d have been interested to see how it would look compared to the Prophet.\n\nConcerning other films, for some reason the ubiquity of Gill Sans in near-future London in Children of Men struck me as a nice touch. The director, Alfonso Caurón, was also behind Azkaban, with it’s sweet Marauder’s Map, incidentally.\n\n"
    },
    {
      "time": " 13.Jul.2007 7.45am",
      "content": "i really wanted to get a glimpse of that crazy blackletter that was used for the newspaper text in the film, but those papers just flew by. one reason to buy the dvd...\n\n"
    },
    {
      "time": " 13.Jul.2007 7.49am",
      "content": "Found some images:\n\n[New](http://web.archive.org/web/20080603175935/http:/i.imdb.com/Photos/Ss/0373889/00163rv2.jpg)  \n [Old](http://web.archive.org/web/20080603175935/http:/www.hp-lexicon.org/images/film/pa/daily-prophet-pa350.jpg)\n\nDoesn’t show any of the sans stuff.\n\n"
    },
    {
      "time": " 13.Jul.2007 8.32am",
      "content": "I got to see it on one of the biggest non-imax screens around, and those newspapers were gorgeous when seen at the size of a large house. On a higher level, the film has a generally unifed aesthetic quality of a much higher caliber than the previous four, the amount of thought and effort that went into it must have been incredible. It was a pretty inspiring movie.\n\nNow if I could just get my hands on book seven...\n\n"
    },
    {
      "time": " 16.Jul.2007 3.47am",
      "content": "I am sure you already know it but there is an awesome sequence with a lot of diferent typefaces in the credits of “Thank you for smoking”. Typographica.org published a post about it some time ago.\n\n[http://www.youtube.com/watch?v=6yPmjuBR5Q4](http://web.archive.org/web/20080603175935/http:/www.youtube.com/watch?v=6yPmjuBR5Q4 \"http://www.youtube.com/watch?v=6yPmjuBR5Q4\")\n\n"
    },
    {
      "time": " 16.Jul.2007 8.37am",
      "content": "I gotta agree with Steven505 on Se7en making me aware of the subtle influences of typography. I think I was a freshman or so in HS when that came out.......still didn’t quite know what graphic design was at the time, but definitely made me aware of type treatments within film.\n\n”....just saying “Z-space” raises your IQ by at least 40 points.....”\n\n"
    },
    {
      "time": " 20.Aug.2007 8.00pm",
      "content": "Does anyone know who designed the Daily Prophet newspapers in the new HP movie?\n\n"
    }
  ]
}
