{
  "id": "35094",
  "title": "Help: Client asking for revisions and I have reached my creative limit",
  "forum": "Design",
  "tags": [

  ],
  "content": "I need advice: I am building a logotype/logomark for a new apparel company. I came up with a concept that basically uses the letters of the comapny name to build the shape of a womans torso [unfortunately my non-disclosure doesn’t allow me to post it here] The original rough nearly satisfied my creative and technical goals for the projects. The clients loved it, but after several revisions the clients still aren’t quite satisfied and continue to ask for changes that I believe stray from good design.  \nAny advice on steering them back to the side of sound design?\n\nThanks very much,  \ncd\n\n [‹ What Kind of Order Do Some of You Work in When Designing a Typeface Family?](http://web.archive.org/web/20071121102112/http:/typophile.com/node/37772 \"Go to previous forum topic\") [Relationship between Headers/Indent/body in a magazine ›](http://web.archive.org/web/20071121102112/http:/typophile.com/node/37741 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071121102112/http://typophile.com/user/15597\" title=\"View user profile.\">cynicdesign</a>",
  "time": "<br>",
  "uid": "15597",
  "comments": [
    {
      "time": " 12.Jul.2007 3.40pm",
      "content": "Hand them a pencil and tell them to show you exactly what they want. ;)\n\n"
    },
    {
      "time": " 12.Jul.2007 4.32pm",
      "content": "If you do design work for hire, your current situation is—unfortunately—one that you will encounter all too often. If your artistic integrity is more important than paying the rent, you can simply tell your clients that their ideas are total crap, thank them very much, and walk out the door. If, on the other hand, you’ve put a lot of effort into the project and feel that you ought to be compensated for it, you have to give the people who sign the checks what they want, even if you do, in fact, think it’s total crap.\n\nIn the former instance, you write off your losses and preserve your self-respect; in the latter instance, you collect your fee and leave that particular project out of your portfolio. Bummer...\n\n"
    },
    {
      "time": " 12.Jul.2007 5.37pm",
      "content": "Ahhh! Leave it out of the portfolio. pretend it never happened. That might be an acceptable solution. Though I still hate to put out something I wouldn’t be proud of. I suppose other designers will be able to see the concept through the execution.\n\nThanks.  \n-cd\n\n"
    },
    {
      "time": " 12.Jul.2007 5.42pm",
      "content": "If you go ahead and make the changes the client wants, you can always leave the rejected design in your portfolio — that is, the one YOU believe is well-done.\n\n"
    },
    {
      "time": " 12.Jul.2007 9.25pm",
      "content": "Ask for a development fee and hand them an invoice. Don’t lower your standards.\n\n"
    },
    {
      "time": " 12.Jul.2007 9.59pm",
      "content": "we stipulate in our contracts that the client gets 3 rounds of changes. After that, they are on the clock. Makes compromise a lot less painful when you know that for every time you lower your standard, you ring the cash register. Of course there’s always a chance you’ll end up with something you’re happy with after all those rounds. In that case, the extra $$ is the icing on the cake. Not to sound crass, but we put the brakes on unlimited changes years ago - after rounds and rounds of seemingly endless revisions. The idea of ’what is finished’ could be a dissertation in itself.\n\nIn terms of whether or not you can put it in your portfolio - we keep 2 portfolios like criminals keep 2 sets of books. You get the idea.\n\n"
    },
    {
      "time": " 13.Jul.2007 6.02am",
      "content": "“Ahhh! Leave it out of the portfolio. pretend it never happened.”\n\nWhile one should always be proud of their work regardless of the profession, one also has to be a bit pragmatic at times. It is a service industry after all.\n\nIf you have the status and clout as a fine French Chef, you can kick out that customer that insists on asking for Ketchup to go with their steak. Most places, however, will gladly hand the ketchup to the customer and drop of the bill when they’re finished.\n\nSo, if you hit the point where the client just has to have their way, finish it for them, get paid, and then put the version of the logo YOU liked in your portfolio. ;o)\n\nRemy also has sound advice...never leave the ’revision’ stage open ended.\n\n"
    },
    {
      "time": " 13.Jul.2007 7.41am",
      "content": "I’ve always found it useful to include options in any presentation.  \nClients will choose what is best for their business, not necessarily what is best for your portfolio, but at least progress is made towards a conclusion.\n\n"
    },
    {
      "time": " 13.Jul.2007 9.34am",
      "content": "I have certain “rules” too, like Remy I usually put up to 3 revisions in the contract, after that I bill hourly. But I can be flexible depending on the job - if it’s something I’m proud of and want to be associated with I’ll be more generous with my time and effort. But I’ll also be quite clear with the client if I feel it’s not moving in a good direction. And I have walked away from jobs where I have felt that either it’s being designed by committee (and the result is not good) or the client and I are not on the same page creatively and are not likely to agree on a solution. Or if the client just can’t articulate what he/she wants and I feel like we’re both spinning our wheels.\n\nNot everything I do ends up in my portfolio, but if it isn’t going to be a portfolio piece I better have gotten well compensated.\n\nI also look at the big picture - the easy, high-paying jobs help subsidize the more laborious ones. I’m way underpaid on a job I’m doing right now but it’s a real feather in my cap so I’m sucking up and putting in the extra hours (even cut my vacation short a day).\n\nI tend not to include work that wasn’t used in my portfolio. I don’t think unresolved jobs (which often require explanation) put your best foot forward. Ditto with spec work. But that’s just my opinion. As an art director, I was always interested in the portfolio pieces that were successful both from a design and a client point of view. Unless you’re a student of course.\n\n"
    },
    {
      "time": " 13.Jul.2007 9.08pm",
      "content": "Jason, you signed an NDA, did you also sign a work for hire contract? What does that say your obligations are?\n\nCheers, Si\n\n"
    },
    {
      "time": " 14.Jul.2007 7.57am",
      "content": "You could always just do what my bosses do when they get sick of a client—dump the jobs on an intern.\n\n"
    },
    {
      "time": " 14.Jul.2007 7.08pm",
      "content": "Well, my take on graphic design might be a little different. I happen to think that the logo you’re working on can not be a success if the client isn’t happy with it. Who are you working for? Yourself? Or are you trying to give a voice to the client’s vision?\n\n"
    },
    {
      "time": " 11.Oct.2007 8.41pm",
      "content": "Thank you all very much for your advice. The project is ongoing and I’ve fallen into a groove with the client, thanks in part, to this post.\n\nActually, as a newly independent designer, I have learned a lot on conducting business as a whole from the advice I’ve gotten here.\n\nThanks much,  \n- cynicdesign  \n Jason Wood  \n [jason@cynicdesign.com](mailto:jason@cynicdesign.com)\n\n"
    },
    {
      "time": " 12.Oct.2007 8.39am",
      "content": "Great that you and the client were able to work together on a successful solution, it’s best when everybody is happy. I’m having a similar issue right now - I know I’m giving my client good design options but for them nothing really “sings” and besides that there are three people I need to please, who don’t necessarily agree with each other. I have to find a solution this weekend that will “sing” for all three or else they have to move on and try someone else, which has rarely happened to me before. If that transpires, I will get paid for the work I put in, but I’m hoping to pull something out of my hat that will let me keep the job.\n\nI happen to agree with Chuck’s comment “the logo you’re working on can not be a success if the client isn’t happy with it.” which is why I never include uncompleted jobs in my portfolio.\n\n"
    }
  ]
}
