{
  "id": "35095",
  "title": "Tironian et and viz",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm mainly working on the et since I think it receives a little more work, but what style is the commonly used in Irish? Most of the examples I see all have a top that correspondes to a the top bar of a z, but from there there seems to be a range of finishing strokes:\n\n- diagonal descender, the \"lowered 7\"\n- diagonal finish at baseline, a \"stubby 7\"\n- a long descender finishing curved leftward, like a j\n- a normal stroke with or without serif, like an i\n- a normal stroke with a rightward curl, like a t\n- a diagonal finish at baseline plus rightward curl.\n\nWhich of these would be most common? The road sign examples I find on wikipedia are all sans serif, so while I like the appearance of the last one, I'm not sure how \"readable\" it would be, or weird-looking. A lot of the other examples I can find online are all from the middle ages, and so not too much help for my font.\n\nI've inluded a document with article one of the UDHR in Irish, replacing agus with ⁊, and repeating it for each of the above described variants. Any suggestions or other variants that y'all know of?\n\n| Attachment | Size |\n| --- | --- |\n| [tironianetcorunatest1.pdf](http://web.archive.org/web/20111012121619/http:/typophile.com/files/tironianetcorunatest1.pdf) | 15.64 KB |\n\n",
  "author": "<a href=\"/web/20111012121619/http://typophile.com/user/16708\" title=\"View user profile.\">guifa</a>",
  "time": "<br>",
  "uid": "16708",
  "comments": [
    {
      "time": "",
      "content": "It is normal for a diagonal or a perpendicular stroke to descend below the baseline. On the rare occasions when the vertical stroke doesn't descend below the baseline the entire character is reduced in size so that the horizontal element is proportionately smaller.\n\nConcerning the examples on the pdf:  \n1 is fine.  \n2 and 6 would be acceptable, but I'd shorten their horizontal strokes to maintain the overall proportions of the characters.  \n3 and 4 are unnatural. A short line is sometimes found at the bottom of the vertical stroke, but it doesn't take the form of a hook - rather it resembles a half serif.  \n5 is unrecognizable - if I had to guess I'd say it was a \"j\". Hooks are out, and left-facing hooks are completely out.\n\n"
    },
    {
      "time": "",
      "content": "I attach a gif showing the character in a range of Irish fonts (the first five are mine, Gadelica is by Séamas Ó Brógáin, and the last two are by Michael Everson).\n\n ![](http://web.archive.org/web/20111012121619im_/http:/typophile.com/files/et_5795.gif)\n\n"
    },
    {
      "time": "",
      "content": "Thanks. The description on Wiki was definitely more oriented for blacklettered ets than modern-day.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
