{
  "id": "35121",
  "title": "Colourizing Fonts",
  "forum": "Build",
  "tags": [

  ],
  "content": "I have created a True Type font from some bitmapped icons my client supplied. They need these icons in a font file to use in their GIS mapping application. If the icons were ONE colour, this excercise would be easy BUT... the icons they have are MULTIPLE colours. Does anyone know how to “Lock” colours right into a font character? For example, one icon is of a building. The building has a black outline, brown inside and yellow inside the windows. I don’t know how to save the true type character with these exact RGB colours. It only wants to save it as black. Does anyone know if this can be done? I would be thankful for any advice / tips that can be offered to me. thanks!\n\n [‹ Fontlab and Python versions](http://web.archive.org/web/20070911200428/http:/typophile.com/node/35164 \"Go to previous forum topic\") [Making OTF problem ›](http://web.archive.org/web/20070911200428/http:/typophile.com/node/35058 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911200428/http://typophile.com/user/19600\" title=\"View user profile.\">LauraB</a>",
  "time": "<br>",
  "uid": "19600",
  "comments": [
    {
      "time": " 13.Jul.2007 2.20pm",
      "content": "I haven’t heard of colors being “locked” to a TrueType font as you want. One possibility: You could look into photofonts, which are a relatively new phenomenon. Honestly, I’ve never used a photofont, so I can’t comment on their feasibility, but it could be what you’re looking for. There are some examples at photofont.com .\n\n"
    },
    {
      "time": " 13.Jul.2007 2.56pm",
      "content": "I don’t think the links at photofont.com are working. There’s also this thread, with a different technology that allows images in fonts:\n\n[http://typophile.com/node/34590](http://web.archive.org/web/20070911200428/http:/typophile.com/node/34590 \"http://typophile.com/node/34590\")\n\n"
    },
    {
      "time": " 14.Jul.2007 9.22am",
      "content": "I once have seen two-color company logo made as a single font. They just type two glyphs and color them differently. You may then include this combination as a standard sequence into document templates. This will not work that well with many colors or halftones, but still a possibility.\n\n"
    }
  ]
}
