{
  "id": "35134",
  "title": "Type Design tutorial anywhere? - How to create fonts?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m interested in attempting to make my own, based upon a few handwritten samples of very, very amateur calligraphy. Are there any tutorials out there that describe how to quickly design a font within any of the more popular font-creation tools?\n\nThese tutorials should be more detailed for newbies, as I have almost nothing in the way of schooling in graphic design (one year in high school, and most of that dealing with presses, cameras, and darkrooms, and I’m an expert, right?). Should cover hinting and best methods of copying paths so that letters are uniform in size and shape.\n\nWith luck, they should also provide suggestions on how to scale widths, to produce Bold and Narrow versions.\n\n",
  "author": "<a href=\"/web/20090912054603/http://www.typophile.com/user/19614\" title=\"View user profile.\">Digitalsabre</a>",
  "time": "<br>",
  "uid": "19614",
  "comments": [
    {
      "time": " 14.Jul.2007 1.03pm",
      "content": "I bought Learn FontLab Fast, but it’s now out of print, although the PDF ordering option sounds fine. I haven’t gotten a chance to put it to use yet, but it looks very good from my skimming.\n\n"
    },
    {
      "time": " 14.Jul.2007 3.23pm",
      "content": "[Designing Type by Karen Cheng](http://web.archive.org/web/20090912054603/http:/www.amazon.com/Designing-Type-Karen-Cheng/dp/0300111509) and [Logo, Font & Lettering Bible by Leslie Cabarga](http://web.archive.org/web/20090912054603/http:/www.amazon.com/Logo-Font-Lettering-Bible-Comprehensive/dp/1581804369) are good books about (designing) type.  \nThere is also the [Type, handwriting, and lettering](http://web.archive.org/web/20090912054603/http:/briem.ismennt.is/) website of Gunnlaugur SE Briem, which is also quite good. And of course Underware’s [Type Basics](http://web.archive.org/web/20090912054603/http:/www.typeworkshop.com/index.php?id1=type-basics) on their [Typeworkshop website](http://web.archive.org/web/20090912054603/http:/www.typeworkshop.com/).\n\n"
    },
    {
      "time": " 14.Jul.2007 3.57pm",
      "content": "It’s not what you’re looking for, but if you’re digitizing calligraphy, there’s nice article on [TypeCulture](http://web.archive.org/web/20090912054603/http:/www.typeculture.com/academic_resource/articles_essays/) treating about “Problems Relating to the Translation of a Drawn Letterform to a Digital Typeface” written by Eduardo Berliner. <cite>A dissertation that looks at the difficulties of translating by means of a tool or machine the human qualities of the hand-drawn letterform.</cite> It could be a nice prelude to all this strictly technical stuff.\n\n"
    },
    {
      "time": " 14.Jul.2007 4.48pm",
      "content": "Changed your title to reflect your request. Have a look at the differences between [typography](http://web.archive.org/web/20090912054603/http:/www.typophile.com/wiki/typography) and [type design](http://web.archive.org/web/20090912054603/http:/www.typophile.com/wiki/type%252Bdesign). Those wiki entries could use some refining, but the essential difference is there: creating new typefaces is not typography, but type design.\n\n"
    },
    {
      "time": " 17.Jul.2007 10.35am",
      "content": "Follow the link auricfuzz gave you to: Learn Fontlab Fast. You can purcashe the book from there. I bought it not long ago and it’s been a great resource. Also by Leslie Cabarga: Logo Font and Lettering Bible is another good book that may come in useful.\n\n"
    },
    {
      "time": " 17.Jul.2007 11.08am",
      "content": "If you want really quick-and-dirty, [www.myfirstfont.com](http://web.archive.org/web/20090912054603/http:/www.myfirstfont.com/ \"www.myfirstfont.com\") will help you create a font quickly and easily using Font Creator Program (a shareware font program that I use as one of my tools—I’m very much an amateur). Caveat, though, in that to make your font any good you need to spend a lot of extra time working on it.\n\nThe books the others are recommending are definitely better, though, if you’re serious about font-making.\n\n"
    },
    {
      "time": " 17.Jul.2007 1.00pm",
      "content": "Use also the [“How to” Section of the Typowiki](http://web.archive.org/web/20090912054603/http:/typophile.com/node/12369), which has good stuff and links.\n\n"
    }
  ]
}
