{
  "id": "3513",
  "title": "Small Design Build firm",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is for an architect turned contractor. I'm trying for contractor sturdiness with a dash of architect sensitivity. I also wanted to provide a recognizable mark that could evolve. He's very happy with this itteration, but I'm feeling a bit out of my element solely working with type so I thought I'd try some trained eyes. Thanks.   \n   \nThe logo will primarily be on white on black, (truck, signs). I'm struggling w/ forcing a black \"box\" for printing on white t-shirt.\n\n<!--attachment: typophile-28203.pdf*mime_pdf.gif*application/pdf*295.9*ai+obj+file*typophile%2eai --><!--attachment: typophile-28203.pdf*mime_pdf.gif*application/pdf*295.9*ai+obj+file*typophile%2eai -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131021001437im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">ai obj file<br><a href=\"http://web.archive.org/web/20131021001437/http:/www.typophile.com/forums/messages/29/typophile-28203.pdf\" target=\"_blank\"><b>typophile.ai</b></a> (295.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "devo",
  "time": "8 Mar 2004 — 9:38pm",
  "uid": "2939",
  "comments": [
    {
      "time": "8 Mar 2004 — 10:17pm",
      "content": "![gif-test](http://web.archive.org/web/20131021001437im_/http:/www.typophile.com/forums/messages/29/28206.gif)   \nfirst post, still gettin the hang of this.\n\n"
    },
    {
      "time": "9 Mar 2004 — 2:29am",
      "content": "The double R is not working like this, I read it RRhoads and the red R is kicking \"Design & Construction\". You also have RH and AD letters stick to each other.\n\n"
    },
    {
      "time": "9 Mar 2004 — 2:38am",
      "content": "Maybe placing the R within an element?   \n   \n ![](http://web.archive.org/web/20131021001437im_/http:/www.typophile.com/forums/messages/29/28209.gif)\n\n"
    },
    {
      "time": "9 Mar 2004 — 9:06am",
      "content": "Ah! you could have some fun with beams and braces to support your R.   \n   \nThe fact being that your unfinished R is a work in progress, and under construction. And if gravity were involved, it would fall on its butt.   \n   \nIn short, do what doozers do.\n\n"
    },
    {
      "time": "9 Mar 2004 — 10:46am",
      "content": "Crossing serifs are always a big no-no? I generally not a big serif fan.   \n   \nThe kick was my struggle to do something w/ nothing. I tried talking to him about naming his company w/ imagery that may make it memorable, but he really likes his name. It currently feels static, old and boring.   \n   \nHe likes the fonts, but to me it looks like I could have designed this thing in Word.   \n   \nI have tried a few shapes to integrate w/ the R and have come up short.   \n   \nI'm going to try to do what he dooz. This needs a little life kicked in it.\n\n"
    },
    {
      "time": "9 Mar 2004 — 5:06pm",
      "content": "The R seems too heavy, in particular, the leg of the R.   \n   \nA possibility would be a superscripted H and the leg of the R could cradle it? Just random thought.\n\n"
    },
    {
      "time": "9 Mar 2004 — 7:28pm",
      "content": "i like the top one but whit out secont R just start reading it whit Simbol of \"R\" and ceap it to whit becround but play whit Desagn & Construction too thight\n\n"
    },
    {
      "time": "9 Mar 2004 — 7:56pm",
      "content": "(wrong image)\n\n"
    },
    {
      "time": "9 Mar 2004 — 7:59pm",
      "content": "listening to the fraggle wisdom, I came with these. I havent thinned up the \"R\" yet (when its separate it really shows). I agree w/ Tiffany about the thickness of Design & Construction, but I've been over-ruled by the client on multiple occasions. I'll probably try sneaking in a medium version. I mainly like the top one, but I included a few along the way.   \n   \nIt's feeling healthier now, not so detached. I really appreciate the ideas.   \n ![newer versions](http://web.archive.org/web/20131021001437im_/http:/www.typophile.com/forums/messages/29/28268.gif)\n\n"
    },
    {
      "time": "10 Mar 2004 — 8:38am",
      "content": "I like the ornamentation of the number 2 H. Classical. I dont like the red roof though.   \n   \nWhat's an all white mark look like?   \n   \nKill 5 and 6. too busy.   \n   \nGood Work.   \n   \nAndrew\n\n"
    },
    {
      "time": "10 Mar 2004 — 1:21pm",
      "content": "yeah, 4,5,6 are dead. Today I'll put up a couple new adjustments. White looked ok, but I liked the red better, althought same color does look pretty good in a low contrast situation. (I'll put that up too.) Currently I am leaning slightly to red roof (less vs overt), but im going to simplify the ornementation on #2 to see if that changes my mind.   \n   \nAny kerners out there have an opinion on the HO? It seems to want to breathe, but any more space and the roofline doesnt drop into the O as smoothly\n\n"
    },
    {
      "time": "10 Mar 2004 — 1:43pm",
      "content": "Maybe have all the letters in 'rhoads' the same size in 1 and 2 - that way the roof might feel less out of place.   \n   \nAlso I prefer & to +..   \n+ seems too modern for the classical style you're using.. Hmm.. The plus in 2 is nice though. : )\n\n"
    },
    {
      "time": "10 Mar 2004 — 2:06pm",
      "content": "I'll try to put one of those up as well Jonathan, but I think the Larger \"R\" catches the roof nicely, and sets up the left triangle line off the top of the \"R\".\n\n"
    },
    {
      "time": "10 Mar 2004 — 2:15pm",
      "content": "The red roof is just not integrated yet. Its more of a hat for the H, weighing it down. And the spacing between roof and H is bothersome, especially on white.\n\n"
    },
    {
      "time": "10 Mar 2004 — 5:57pm",
      "content": "here's the latest:   \n   \n ![almost](http://web.archive.org/web/20131021001437im_/http:/www.typophile.com/forums/messages/29/28315.gif)\n\n"
    },
    {
      "time": "11 Mar 2004 — 8:41pm",
      "content": "Ampersand, no plus.   \n   \nYou really like to use red, huh?   \n   \nRHOADS in red? Design & Construction in black?   \nThe logo reads to me as ROADS with a gate in between.   \n   \nI like the gate in bottom left best. Top right too much detail.   \n   \nWork on the RHO spacing. OA.   \n   \nI like the progress.   \n   \nAndrew\n\n"
    },
    {
      "time": "16 Mar 2004 — 2:08pm",
      "content": "Plain text and ampersand ended up as the final. No roof, no hat, no gate. Thanks for all the help and ideas. Sometimes designs are just plain stubborn and never quite make it, but you guys helped me make the most of what I had.\n\n"
    },
    {
      "time": "22 Mar 2004 — 1:42pm",
      "content": "Bottom right is the best so far but why do you need the double red & and symbol of H. I personally feel like the logos are caught between being elegant and communicative. It's not there though, the best one though I think is the third one up on the right it's a little overdone but the hierarchy is better than the others. Gluck.\n\n"
    },
    {
      "time": "9 Mar 2004 — 12:58pm",
      "content": "I agree that the R needs to be anchored, somehow, visually. The weight of \"Design & Construction\" seems heavy. Call me boring, but I often consider the thinnest and thickest portions to find a middle ground. I wonder if that line should match the thinnest (or close to) part of the serif face?\n\n"
    },
    {
      "time": "11 Mar 2004 — 9:06am",
      "content": "Does the H need to be red in order to be read?\n\n"
    }
  ]
}
