{
  "id": "35167",
  "title": "Legau the Village next to Rotis",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Rotis, the village is about 15 miles away from where I live and was born. I never got to know Otl Aicher. He died before I heard of his work. The typeface Rotis was later always part of my typografic life, because I discussed it a lot. To be honest for a long time I hated it. But what I hated much more was the theory Otl Aicher built arround it.  \nI am still getting angry now, when I see so many designers and architects following him without much critique.  \nStill there is something about it that interestes me.  \nA few years ago I started to draw a new interpretation of the Rotis idea, because there was a potential client that wanted a headline face in this direction. It never happened, but I went on with it.  \nI started it from zero, never used any outline of the Rotis fonts.  \nThe first thing you can see is, that it is not condensed. That never really worked in Rotis.\n\nAt the end there are not many elements left that remind on Rotis, accept the often discussed e and c. The stroke is oldstyle while the rest of the forms are neoclassically upright. I kept it in my first version.  \nBecause it follow two different concepts in the stroke I made two alternate versions. One with an angled axis, called the oldstyle stroke version and one with an upright axis called the neoclassical stroke version.\n\nI want to ask you a two questions:  \n1. Do you think it has got enought character to live a life next to Rotis?  \n2. Would you do extra fonts, or Open Type styles for the alternate versions?\n\nI have never based my fonts as near to an existing design as in this case. So I am quite eager to hear what you think.\n\nHubert\n\n| Attachment | Size |\n| --- | --- |\n| [Legau2Font.pdf](http://web.archive.org/web/20141117015433/http:/typophile.com/files/Legau2Font.pdf) | 108.69 KB |\n| [Legau3Font.pdf](http://web.archive.org/web/20141117015433/http:/typophile.com/files/Legau3Font.pdf) | 56.23 KB |\n\n",
  "author": "hubertjocham",
  "time": "16 Jul 2007 — 8:34am",
  "uid": "6380",
  "comments": [
    {
      "time": "16 Jul 2007 — 11:04am",
      "content": "I don't have much insight into your 2 questions, but I will admit that I love the work you've done so far.\n\nIt feels like a more robust Rotis. The ampersand is back to normal; even sophisticated looking. I especially enjoy the @, registered and copyright symbols.\n\nI don't know if your tracking is quite right yet, especially the spacing between words, which feels too wide.\n\nthe lowercase a is very elegant. The lowercase f however doesn't seem dense enough, and I'd like to see the lowercase t with an angled top like in Rotis.\n\nThe uppercase Q and R are nice, but they don't share the same unique feel of Rotis's Q and R.\n\nThe one thing that sets your characters apart from Rotis, is that some of your strokes end outward, were Rotis's would end downward. Such as in a, c, y, 2, 3, 6, and 9. I don't know if this a true argument as much as it is an observation.\n\nVery nice work Hubert.\n\n"
    },
    {
      "time": "16 Jul 2007 — 12:48pm",
      "content": "\\> 1. Do you think it has got enought character to live a life next to Rotis?\n\nYes. There are still very few modern sans families with contrast. There is room for more.\n\n\\> 2. Would you do extra fonts, or Open Type styles for the alternate versions?\n\nI would definitely do OT for those who are using Adobe CS. But [Mark Simonson](http://web.archive.org/web/20141117015433/http:/typophile.com/wiki/Mark%20Simonson) has a nice solution for those customers who might not be using OT-savvy apps: bundle both options: a full featured OT with the alts, and separated OT fonts.\n\n"
    },
    {
      "time": "19 Jul 2007 — 2:39am",
      "content": "The next thing I started with Legau is a bit more extreme, but it also deals with angles of the stroke.  \nIn one of my serifs I flipped the angle of the stroke to the right in most of the round characters.  \n [http://www.hubertjocham.de/item.php/type/serif/Leaf/](http://web.archive.org/web/20141117015433/http:/www.hubertjocham.de/item.php/type/serif/Leaf/ \"http://www.hubertjocham.de/item.php/type/serif/Leaf/\")  \nthe same concept I now brought into Legau.  \nI will also upload another pdf to show you text as well\n\n ![](http://web.archive.org/web/20141117015433im_/http:/typophile.com/files/NextConcept2_4622.jpg)\n\n"
    },
    {
      "time": "16 Aug 2007 — 10:46am",
      "content": "Can you link to, or share, some information about Aicher's theories regarding Rotis? As a visual designer who is also studying architecture, your comment intrigued me.\n\n"
    },
    {
      "time": "16 Aug 2007 — 12:33pm",
      "content": "I will check if I can find something online. Most of it might be in german.  \nI don't know if his book TYPOGRAFIE was ever translated into english.\n\n"
    },
    {
      "time": "16 Aug 2007 — 1:18pm",
      "content": "The original printing of Otl Aicher's [**typographie**](http://web.archive.org/web/20141117015433/http:/www.baselinemagazine.com/mainframe/Products/associated%20books/typographie.html) ran German and English text as separate paragraphs on the same page.\n\nI am not sure of the more recent editions though.\n\nI worked with Otl Aicher for nearly two years, on the development, marketing and commercial release of Rotis type family. This was back in 1987-89 when I was a manager at Afga Typographic (previously Compugraphic, now Monotype Imaging).\n\nI spent time in his studio at Rotis in Leutkirch im Allgäu.\n\n"
    },
    {
      "time": "16 Aug 2007 — 1:22pm",
      "content": "FYI--\n\n[Is Rotis a typeface?](http://web.archive.org/web/20141117015433/http:/www.spiekermann.com/iblog/C1109747452/E1829097339/index.html) shootout with Kinross and Spiekermann.\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:30am",
      "content": "thanks to both of you for your comments. after reading \"Is Rotis a typeface?\" i can definitely see echoes of the same problem within the field of architecture - people espouse a theory, but what they produce using that theory is not what they say it is.\n\nthat said, i agree that Rotis is great for titles, headlines, and logos, but have never felt ok about using it to set large blocks of text. taken individually, i think that the letterforms are quite beautiful.\n\n"
    },
    {
      "time": "16 Sep 2007 — 11:33pm",
      "content": "oh, by the way I just published Legau:\n\n[http://www.hubertjocham.de/item.php/type/sans/LegauU/](http://web.archive.org/web/20141117015433/http:/www.hubertjocham.de/item.php/type/sans/LegauU/ \"http://www.hubertjocham.de/item.php/type/sans/LegauU/\")  \n [http://www.hubertjocham.de/item.php/type/sans/LegauA/](http://web.archive.org/web/20141117015433/http:/www.hubertjocham.de/item.php/type/sans/LegauA/ \"http://www.hubertjocham.de/item.php/type/sans/LegauA/\")  \n [http://www.hubertjocham.de/item.php/type/sans/LegauR/](http://web.archive.org/web/20141117015433/http:/www.hubertjocham.de/item.php/type/sans/LegauR/ \"http://www.hubertjocham.de/item.php/type/sans/LegauR/\")\n\n"
    },
    {
      "time": "30 Apr 2008 — 5:18am",
      "content": "(Hubert Jocham) Sorry to bother you on this thread. I am having great trouble in trying to purchase a font from your site, every time i got to check out it say's purchase denied. And your contact form wont let me send through mail either.\n\nCould we perhaps talk and resolve this? as i need the font as a matter of urgency.\n\nThe typface is Schwung Alternate.\n\nThank you  \nLuey\n\n"
    }
  ]
}
