{
  "id": "35166",
  "title": "BrowalliaUPC copyright?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Can someone tell me what the copyright restrictions with the BrowalliaUPC font are? It comes with Windows XP.  \nCan I use it in my commercially released publication?\n\nCheers\n\nStewart\n\n",
  "author": "<a href=\"/web/20101105065421/http://www.typophile.com/user/19645\" title=\"View user profile.\">Stu</a>",
  "time": "<br>",
  "uid": "19645",
  "comments": [
    {
      "time": "",
      "content": "This, like all the other UPC Thai fonts in Windows, was licensed from Unity Progress in Thailand. The company still exists (we extended our rights a while back) but is not in the fonts game. I don't think there are any commercial font efforts in Thailand which is a shame. Anyway as long as you don’t redistribute the file (or derivative font file) you can use it in your print or digital project.\n\nAlso: If you need to install the font on another platform or machine that doesn't have the font you can license it from Ascender Corp.\n\n"
    },
    {
      "time": "",
      "content": "I'm sure they will have it on their machine (will make sure they do before embedding) but I will need to embed the font within the PDF sent to the printers. Is this considered redistributing?\n\nStewart\n\n"
    },
    {
      "time": "",
      "content": "\\>but I will need to embed the font within the PDF sent to the printers.\n\nThe most recent Windows EULA specifically mentions embedding in accordance with the permissions in the fonts.\n\n"
    },
    {
      "time": "",
      "content": "Ok, so from what I understand is that it means I can temporarily download the font to the printers, but must delete them after the book has been printed?\n\nCheck out the top of page 2 [http://download.microsoft.com/documents/useterms/Windows%20Vista\\_Home%20...](http://web.archive.org/web/20101105065421/http:/download.microsoft.com/documents/useterms/Windows%20Vista_Home%20Basic_English_2cd69850-7680-4987-8b1e-59a3d405c074.pdf \"http://download.microsoft.com/documents/useterms/Windows%20Vista\\_Home%20Basic\\_English\\_2cd69850-7680-4987-8b1e-59a3d405c074.pdf\")\n\n"
    },
    {
      "time": "",
      "content": "Ha, not exactly. This is 'printer', as in laserjet, not as in Kinkos. The first point is the one that relates to PDF...\n\nb. Font Components. While the software is running, you may use its fonts to display and print content. You may only  \n· embed fonts in content as permitted by the embedding restrictions in the fonts; and  \n· temporarily download them to a printer or other output device to print content.\n\nI also have to ask, is there a big Thai community in your part of South Africa? What type of Thai content are you printing?\n\n"
    },
    {
      "time": "",
      "content": "Aah, I see.  \nNot sure about the Thai community. I was going to use the font for page numbers only :)  \nI'm doing a guide for bouldering (rock climbing) around Cape Town.\n\n"
    },
    {
      "time": "",
      "content": "Okay, the font is in Windows to support Thai, and I don't know if the font is any good for Latin body text, but for page numbers, how can you go wrong.\n\n"
    },
    {
      "time": "",
      "content": "Excellent, thanks for your help.\n\n"
    }
  ]
}
