{
  "id": "35184",
  "title": "Typography and architecture",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm currently redesigning a logo for a design company who's sister company deals with 3D design for architecture. Therefore the logo has to work for a design company AND a 3D/architecture company. So, I'm looking for any relationships between type and architecture. Anything will do: books, designers, movements web links etc. Anything to help me connect the two.  \nCheers!\n\n",
  "author": "<a href=\"/web/20111011142943/http://www.typophile.com/user/9776\" title=\"View user profile.\">WhitePepper</a>",
  "time": "<br>",
  "uid": "9776",
  "comments": [
    {
      "time": "",
      "content": "From reading [_Meggs' History of Graphic Design_](http://web.archive.org/web/20111011142943/http:/www.amazon.com/Meggs-History-Graphic-Design-Philip/dp/0471699020/ref=sr_1_1/102-7686315-2079332?ie=UTF8&s=books&qid=1184632072&sr=8-1), I recall that the De Stijl and Bauhaus movements/schools were concerned with design in all forms, from architecture to interior to graphic (and both innovated letterforms as well). Frank Lloyd Wright also did a good amount of graphic design, including desinging some typefaces (available from P22 [here](http://web.archive.org/web/20111011142943/http:/www.p22.com/products/flwfa.html) (look in the left column for the \"FLLW\" fonts). Any of those could make a good starting point, although all three have very distinctive styles that you may not (or may) want to embrace. I'm partial to De Stijl's asymmetrical balance myself.\n\n"
    },
    {
      "time": "",
      "content": "Neutra has a face named for him, but that's rather an obvious link. You might want to look at what Frank Gehry has used, or the faces with a connection to either Charles Rennie Macintosh or Frank Lloyd Wright.\n\nAnd don't forget that the handwriting of Frances Ching, author of _Building Design Illustrated,_ was used for Tekton....\n\n"
    },
    {
      "time": "",
      "content": "As for books, may I suggest [_ **Archigraphia** _](http://web.archive.org/web/20111011142943/http:/modernism101.com/herdeg_archigraphia.php)?\n\nAlso [_ **Signs: Lettering in the Environment** _](http://web.archive.org/web/20111011142943/http:/www.amazon.com/Signs-Lettering-Environment/dp/1856693376/ref=sr_1_3/002-4396058-7427212?ie=UTF8&s=books&qid=1184653887&sr=1-3), and [_ **A History of Lettering** _](http://web.archive.org/web/20111011142943/http:/www.amazon.com/Signs-Lettering-Environment/dp/1856693376/ref=sr_1_3/002-4396058-7427212?ie=UTF8&s=books&qid=1184653887&sr=1-3).\n\n"
    },
    {
      "time": "",
      "content": "Armando Petrucci's \"Public Lettering\" is another good book dealing with older architecture though.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"Roman\" inscriptional capitals in their original context, carved into architraves, walls and tympanae of buildings erected by the ancient Romans during classical antiquity, were explicity architectural in their construction.\n\nThe relationship to classical architecture goes beyond setting. The basic elements of circle, square, half-square, triangle and post (stem) making up roman inscriptional capitals occur as similar elements in Roman classical architecture, inhereted from the Greeks and elaborated upon by the Romans. Numerous theories have surfaced on the origin of serifs; regardless of their true origin(s), the resemblance of bracketed and wedge-shaped serifs on inscriptional capitals to the wedge-profile of the echinus element of doric columns probably helped secure their position in the grammar of classical lettering style.\n\nGoudy's Trajan typeface and the Trajan Inscription in Rome are the best-known examples, but there are of course many others.\n\nThe later dual case \"roman\" typefaces of Francesco Griffo and Nicolas Jenson emulated the style of Roman inscriptional capitals, yet their lower cases were specifically typographic creations of the Renaissance, owing more to their origins as calligraphic letters, which borrowed a bit of stylistic detail from Roman inscriptional capitals.\n\nThat's all very well for classical architecture and classical capitals---if your client fits that shoe. Contemporary architecture (I won't call it \"modern\") demands contemporary type, faces that retain the basic structural components but shed classical detail.\n\nA clean set of capitals like those of Neutraface or Futura.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "I don't know why, but perhaps the ancient cultures of Mesoamerica, in particular their method of presenting writing, could provide some inspiration.\n\n[http://www.famsi.org/index.html](http://web.archive.org/web/20111011142943/http:/www.famsi.org/index.html \"http://www.famsi.org/index.html\") ...scroll down 'Writing' in the upper nav bar.\n\n"
    },
    {
      "time": "",
      "content": "auricfuzz - I'm now working on some ideas with Bauhaus and De Stijl in mind.\n\nJames - That sounds really interesting and something I can definitely work with.\n\nHiroshige - Is there anything specific from he dropdown menu i should be looking for?\n\nDue to shortened timelines, it looks like I wont have time to read any books on the matter, so web links or names I can look up would now be ideal.\n\nThanks everyone for your help so far!\n\n"
    },
    {
      "time": "",
      "content": "_Hiroshige - Is there anything specific from he dropdown menu i should be looking for?_\n\nNo not really, it was just a general suggestion meant to bring your attention to the hieroglyphs of mesoamericans, such as the words and syllables of the Mayan... [http://research.famsi.org/mdp/mdp\\_index.php](http://web.archive.org/web/20111011142943/http:/research.famsi.org/mdp/mdp_index.php \"http://research.famsi.org/mdp/mdp\\_index.php\")\n\nAnd when their writting was carved of huge blocks of building stone, they became very 3d, which is quite a different method of communicating a written language (organically speaking of architecture) from the greeks and the romans (and their decendants too). With the mesoamericans, the medium was the message(?)\n\n ![](http://web.archive.org/web/20111011142943im_/http:/typophile.com/files/Yaxchilan-Lintel-24_4201.jpg)\n  \nFor a larger image click above link and then click on the image thumbnail.\n"
    },
    {
      "time": "",
      "content": "Is it just me?\n\n ![](http://web.archive.org/web/20111011142943im_/http:/typophile.com/files/Yaxchilan-Lintel-24_4201_3423.jpg)\n\n ![](http://web.archive.org/web/20111011142943im_/http:/typophile.com/files/24792_6179.gif)\n\n"
    },
    {
      "time": "",
      "content": "Follow this thread as well  \n [http://www.typophile.com/node/37424](http://web.archive.org/web/20111011142943/http:/www.typophile.com/node/37424 \"http://www.typophile.com/node/37424\")\n\n"
    }
  ]
}
