{
  "id": "3518",
  "title": "Avant Garde Alternates",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello, Hello!   \nI need to know where I can find the \"ITC Avant Garde\" the ALTERNATES version. If anyone got it or k now where to fin it please let me know! Thanks! /Jake\n\n",
  "author": "anonymous",
  "time": "2 Oct 2002 — 1:39am",
  "uid": "1203",
  "comments": [
    {
      "time": "11 May 2004 — 10:46am",
      "content": "\\>RE:Please do NOT use alt.binaries.fonts. Type designers   \n\\>are generally nice folks who work unusually hard and don't   \n\\>deserve to be ripped off. People's livelihoods are involved.   \n   \nIf a font is impossible to find in and of the legal channels then how is going to a.b.fonts going to hurt them? If something (anything) I had created had fallen out of publishing then I would want people to be able to get it somewhere.   \n   \nI managed to find an old song I had recorded and lost the demos of on an mp3 forum. I was eternally grateful.   \n   \nThose forums are as much a way to keep forgotten works alive as they are anything.\n\n"
    },
    {
      "time": "11 May 2004 — 11:09am",
      "content": "I've put up a gallery of Avant Garde ligatures and alternates on my site. Go to:   \n   \n [http://www.keithtam.net](http://web.archive.org/web/20150221015802/http:/www.keithtam.net/)   \n   \nEnjoy!   \n   \nK.\n\n"
    },
    {
      "time": "11 May 2004 — 1:50pm",
      "content": "_If something (anything) I had created had fallen out of publishing then I would want people to be able to get it somewhere.   \n   \nThose forums are as much a way to keep forgotten works alive as they are anything._   \n      \n   \nBut what if you preferred that something be forgotten? What if you decided to deliberately withdraw something from circulation because you were dissatisfied with it? Would you still be happy to see people trading it on newsgroup forums?   \n   \nThis is not a hypothetical question. The early Tiro Typeworks Type 1 retail fonts have all been withdrawn from circulation, a process that took some effort to cancel contracts etc. We did this because some of the types were going to be revised and rereleased in OpenType format, while others we were unhappy with and wanted to retire. The fact that trading those old fonts on newsgroups doesn't financially harm me is irrelevant: the fonts are my intellectual property and I have the right to say when, how and if they are distributed.\n\n"
    },
    {
      "time": "11 May 2004 — 1:54pm",
      "content": "\\> what if you preferred that something be forgotten?   \n   \nI would say one can't have everything one wants! :-/   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jul 2004 — 10:24am",
      "content": "Yeah, well if one can't have everything one wants, then Mason can't go on some pirate site and download bootleg fonts, can he ;)   \n   \nMason, I must admit that I adamently disagree with you. Especially in this case, when it is \\<I\\>clear\\</I\\> that Advant Garde's Alternates are still commercially available.   \n   \nMany designers search fonts.com and myfonts.com, and if they don't find their searched-for font (after a whole 10 minutes of research!) they assume that the font is dead, and that this legitimizes piracy. A little more research would prove that this font (AVG G Alt) is still commercially available, albeit through Scangraphic of FontShop Austrailia.\n\n"
    },
    {
      "time": "6 Aug 2004 — 8:49am",
      "content": "indeed.   \n   \nmmm...   \n [http://www.fontshop.com.au/fontdetailc.php3?ns=1&sns=2&ss=2&co=by+foundry&co2=byvendor&id=fp-2818](http://web.archive.org/web/20150221015802/http:/www.fontshop.com.au/fontdetailc.php3?ns=1&sns=2&ss=2&co=by%2Bfoundry&co2=byvendor&id=fp-2818)   \n   \net al\n\n"
    },
    {
      "time": "9 Aug 2004 — 11:14am",
      "content": "In February of this year, when I tried to buy Scangraphic Avant Garde Alts through Font Shop I had some \"problems\" to get it living in Europe.   \n   \nTo summarize, I could not get it through FontShop Europe neither Australia. In touch with FontShop USA/Canada, they had it but told me they could not sell fonts outside of North & South America. However, they kindly directed me to Type Sales (Swipe) where I finally got it.   \n   \nBy the way, a very complete and very well done font (Stephen's link about Scangraphic) with Bodytext and Headlines.\n\n"
    },
    {
      "time": "13 Dec 2004 — 9:16am",
      "content": "What is Type Sales (Swipe) ? I googled it but couldn't come up with anything.   \n   \nCheers,   \nChris\n\n"
    },
    {
      "time": "13 Dec 2004 — 10:46am",
      "content": "this is a quite interesting article about the history of avant garde.   \n [http://journal.aiga.org/content.cfm?ContentAlias=%5Fgetfullarticle&aid=537383](http://web.archive.org/web/20150221015802/http:/journal.aiga.org/content.cfm?ContentAlias=%5Fgetfullarticle&aid=537383)   \nsomeone at aiga journal is saying: \"It was once part of the many ligatures available on typositor. It may no longer be available. Lubalin was not happy about the way they were used.\"\n\n"
    },
    {
      "time": "14 Dec 2004 — 2:11am",
      "content": "Avant Garde is just waiting to be recreated in a richly featured Opentype format. Is there anyone working on it? Carnase has the right to do it. That would make for one hell of a revival.\n\n"
    },
    {
      "time": "14 Dec 2004 — 3:03am",
      "content": "I hope that he does do one. I don't know if anyone is working on the design. I guess that Monotype or ITC could do one without him, but I don't know what their OpenType plans are. Maybe someone should suggest the idea to him.\n\n"
    },
    {
      "time": "14 Dec 2004 — 3:39am",
      "content": "Based on the rumours I've heard, I'm quite sure that ITC among other foundries is moving to Open Type quite soon. That means bye bye to Freehand if Macromedia is going to react as keen as they've been this far.\n\n"
    },
    {
      "time": "14 Dec 2004 — 2:46pm",
      "content": "ITC has already released a few OpenType fonts, fwiw.   \n   \nT\n\n"
    },
    {
      "time": "17 Dec 2004 — 3:09am",
      "content": "A remastered edition of the Scangraphic font collection was recently added to MyFonts.com:   \n   \n [http://www.myfonts.com/foundry/efscangraphic/](http://web.archive.org/web/20150221015802/http:/www.myfonts.com/foundry/efscangraphic/)   \n   \nScangraphic collaborated with Elsner+Flake, among others adding Euro and @ characters.   \n   \nRegards,   \nAdam\n\n"
    },
    {
      "time": "23 Feb 2005 — 4:59pm",
      "content": "Stephen,   \n   \nany idea why FontShop.com does not display the foundry name on Font Package Detail or Font Detail pages (like the one you pointed to?)   \n   \nOn the search results page:   \n [http://www.fontshop.com/index.cfm?fuseaction=verity.search&font\\_categories=1&font\\_categories\\_search=font\\_name\\_search&searchstr=avant+garde](http://web.archive.org/web/20150221015802/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=avant+garde)   \nit is clearly indicated that the Avant Garde Alternates version is by Elsner+Flake, but this essential information is missing from the detail pages, which is a pity.   \n   \nTiffany,   \nSince Avant Garde Alternates is from Elsner+Flake, naturally, it goes best with EF's version of ITC Avant Garde.   \n   \nAll Elsner+Flake fonts can be purchased from:   \n [http://www.elsner-flake.com/](http://web.archive.org/web/20150221015802/http:/www.elsner-flake.com/)   \n   \nThese alternates are not \"new\" by any means. EF has had them for quite some time. But perhaps they're new at FontShop.com.   \n   \nBest,   \nAdam\n\n"
    },
    {
      "time": "24 Feb 2005 — 7:35am",
      "content": "Hangin'... by a thread! ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "24 Feb 2005 — 10:43am",
      "content": "Stephen,   \n   \nthanks for the pointer. For some reason, I recollect seeing \"Search Results\" on the top rather than \"Elsner & Flake\" there yesterday. Either today it's different or I was daydreaming yesterday. Anyhow, thanks for the fabulous animated sample ![:-)](http://web.archive.org/web/20150221015802im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nAdam\n\n"
    },
    {
      "time": "16 Oct 2002 — 7:34am",
      "content": "The foundry was Mannsman Scangraphics. They are now apparently out of business, and I don't know what has happened to their \"library.\"   \n   \nTry in \"The Pirate's Den\" ...\n\n"
    },
    {
      "time": "6 Aug 2004 — 10:49am",
      "content": "I've got some news.   \n   \nFontShop still has a connection with [Scangraphic](http://web.archive.org/web/20150221015802/http:/fontshop.com/index.cfm?fuseaction=catalog.fonts&searchID=22&searchby=manufacturer).   \nThough the Avant Garde Alts aren't online you can still   \npurchase by calling FS at 1-888-FF-FONTS.\n\n"
    },
    {
      "time": "18 Feb 2005 — 2:17pm",
      "content": "FontShop.com has the [Avant Garde Alternates](http://web.archive.org/web/20150221015802/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&displayfontid=EF.101895.0.0&searchby=searchresults) now.\n\n"
    },
    {
      "time": "23 Feb 2005 — 3:37pm",
      "content": "Stephen which standard version of Avant Garde does FontShop recommend to work best with these new alts?\n\n"
    },
    {
      "time": "23 Feb 2005 — 5:10pm",
      "content": "Yes, thank you, Adam. I'll have to go dig around at E+F ...   \n   \nI noticed they were E+F ... I suppose I'm just hoping for someone to sell a bundle with corresponding faces.\n\n"
    },
    {
      "time": "23 Feb 2005 — 5:55pm",
      "content": "Adam - You can find the foundry listed at the top in the breadcrumb.   \nThat said, we'd like to get the site to a point where that that info   \nis in the gray sidebar.   \n   \nTiff - I'll work up some comparisons for you soon.\n\n"
    },
    {
      "time": "24 Feb 2005 — 12:37am",
      "content": "As you might assume, the E+F Scangraphic AG Book matches   \nthe AG Book Alt just right, as demonstrated in this short film:   \n   \n [![wassup hrant](http://web.archive.org/web/20150221015802im_/http:/www.typophile.com/forums/messages/4100/65940.gif)](http://web.archive.org/web/20150221015802/http:/www.fontshop.com/virtual/newsletters/feb2005/)   \n   \nTomorrow I'll test the Monotype ITC and Linotype ITC versions for compatibility.\n\n"
    },
    {
      "time": "16 Oct 2002 — 7:26pm",
      "content": "Scangraphic out of business? Could have fooled me...   \n   \n [http://www.scangraphic.de/sc-about-fonts.htm](http://web.archive.org/web/20150221015802/http:/www.scangraphic.de/sc-about-fonts.htm)   \n   \nFontHaus also sells SG fonts:   \n [http://www.fonthaus.com/products/fonts/FontFind.cfm?Function=Supplier&Search=Scangraphic](http://web.archive.org/web/20150221015802/http:/www.fonthaus.com/products/fonts/FontFind.cfm?Function=Supplier&Search=Scangraphic)   \n   \nBut I can't find Avant Garde in there. :-( FontHaus does, however, have Elsner & Flake's strange monospaced version.   \n   \nThe Avant Garde alts were also part of Linotype's GX Font Collection, released back in the early 90s. It had such other oddities as \"schoolbook letters\" for Times, Helvetica, and New Century Schoolbook, all the swashes for Bookman, swash caps for Palatino (not the originals, but rather Ariadne, which has often been paired with Palatino's and others' lowercase italics) and the swash alternates for Zapf Chancery Medium Italic.   \n   \nYou might be able to call Linotype and see if they have any extras left that they would be willing to sell you. You can only get to the GX features through GX apps like UniQorn and LightningDraw, or one-by-one through the InDesign glyph palette. GX features do not work automatically in InDesign like OpenType features.   \n   \nGood luck in your quest,   \n--John   \n   \nP.S.   \nRSP99 wrote: _Try in \"The Pirate's Den\" ..._\n\n"
    }
  ]
}
