{
  "id": "35181",
  "title": "Kerning Music",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am in the midst of an extended kerning session (4 typefaces, 31 fonts) and listening to a lot of electronic-ish music, namely Two Lone Swordsmen, Junior Boys, Black Devil Disco Club, Chris Clark, Boards of Canada, Battles etc. I find the repetitious nature an excellent fit for kerning, it gets me into a rhythm, almost a trance.\n\nSo the question is, what do you all find good to listen to while kerning?\n\n—K\n\n [‹ Type in the sky](http://web.archive.org/web/20080706164629/http:/www.typophile.com/node/35487 \"Go to previous forum topic\") [Adobe FDK 2.x? ›](http://web.archive.org/web/20080706164629/http:/www.typophile.com/node/35481 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706164629/http://www.typophile.com/user/1519\" title=\"View user profile.\">kris</a>",
  "time": "<br>",
  "uid": "1519",
  "comments": [
    {
      "time": " 16.Jul.2007 2.28pm",
      "content": "There are some good suggestions among the comments to [this thread](http://web.archive.org/web/20080706164629/http:/zenhabits.net/2007/06/a-simple-playlist-for-tranquil-exercise-productivity-and-calm-living/) at zenhabits.\n\n"
    },
    {
      "time": " 16.Jul.2007 2.30pm",
      "content": "I can’t listen to anything while I work on type or design. It is okay if I am doing home maintenance stuff but I get too distracted for even things like kerning. When I listen to music, I really listen or watch. My favorite music is opera so it is not so repetitive as pop music. I also like blues and R&B when I am driving a distance.\n\nChrisL\n\n"
    },
    {
      "time": " 16.Jul.2007 2.35pm",
      "content": "“Golden Bowls” by Karma Moffett.\n\nIt keeps me calm.\n\npbc\n\n"
    },
    {
      "time": " 16.Jul.2007 2.49pm",
      "content": "My listening habits are listed at [Last.fm](http://web.archive.org/web/20080706164629/http:/www.last.fm/user/stewf). Join the [Typophile group](http://web.archive.org/web/20080706164629/http:/www.last.fm/group/Typophiles/).\n\n"
    },
    {
      "time": " 16.Jul.2007 2.54pm",
      "content": "Metal and Rock music mainly, but I’ll sample anything. I usually put a film on in the background instead of music, I find that relaxes me more.\n\n"
    },
    {
      "time": " 16.Jul.2007 2.59pm",
      "content": "Classical is playing at Peet’s right now. Would be great for that. On a side-note, I see it is in time with Eric West’s animated gif of the cat with the machine gun. What’s the word for that...something like oxymoronic...incongruent, I guess.\n\n"
    },
    {
      "time": " 16.Jul.2007 3.12pm",
      "content": "[http://www.dungen-music.com/](http://web.archive.org/web/20080706164629/http:/www.dungen-music.com/ \"http://www.dungen-music.com/\")\n\n[http://www.ufomammut.com/](http://web.archive.org/web/20080706164629/http:/www.ufomammut.com/ \"http://www.ufomammut.com/\")\n\n"
    },
    {
      "time": " 16.Jul.2007 3.37pm",
      "content": "LOL. I read this as a thread on using kerning when typesetting music, which is not the same. I could just see someone with an advertising background, kerning all the notes until they touched each other.\n\n(Apologies for being silly ... I am on holidays.)\n\n"
    },
    {
      "time": " 16.Jul.2007 4.14pm",
      "content": "No need to apologise, I did the same. I blame it on the kids I teach.\n\n"
    },
    {
      "time": " 16.Jul.2007 4.49pm",
      "content": "[strapping young lad](http://web.archive.org/web/20080706164629/http:/www.myspace.com/strappingyounglad) for compressed typefaces and [bohren und der club of gore](http://web.archive.org/web/20080706164629/http:/www.myspace.com/derclubofgore) for extended ones ;-)\n\n"
    },
    {
      "time": " 16.Jul.2007 5.05pm",
      "content": "i was up all last night listening to [Hearts of Space](http://web.archive.org/web/20080706164629/http:/www.hos.com/) while i was doing my own font crunching. That along with podcasts of “Wait, Wait, Don’t Tell Me,” “Mugglecast,” and “This American Life.”\n\n"
    },
    {
      "time": " 16.Jul.2007 5.51pm",
      "content": "Electronic, trip hop, down tempo, etc. All good for design needs. But, if you notice I listen to all kinds of music. :^\\> My listening habits are also listed at [Last.fm](http://web.archive.org/web/20080706164629/http:/www.last.fm/user/typegirl).\n\n"
    },
    {
      "time": " 16.Jul.2007 7.43pm",
      "content": "I must admit that when I first saw Kris’s post, I thought of seeing him with Finale open on his desktop trying to kern a run of 32nd notes into a measure to keep it the same width as the staff above :-)\n\nChrisL\n\n"
    },
    {
      "time": " 16.Jul.2007 8.10pm",
      "content": "Um, me too.\n\nWhat I listen to when I work depends on what the “work” is at the time. The music can range from bodhran-dominant Celtic and 70s rock, opera from _Carmen_ to _Nixon in China_, Palastrina to Philip Glass, and George Strait.\n\n"
    },
    {
      "time": " 17.Jul.2007 1.27am",
      "content": "I’ve never worked on kerning tables, but my job does involve lots of repetitive Illustrator work. I find Kraftwerk the perfect accompaniment, a particular favourite being Man Machine. It sounds like a well-running electronic machine, and makes me feel as if the computer and I are at one. It’s rarely the case in fact, but if I feel that way it helps.\n\n"
    },
    {
      "time": " 17.Jul.2007 1.50am",
      "content": "Too bad Chris doesn’t listen to music while he kerns, or else he would surely recommend Archie Bell & The Drells “Tighten It Up”.\n\n"
    },
    {
      "time": " 17.Jul.2007 7.29am",
      "content": "”... he would surely recommend Archie Bell & The Drells “Tighten It Up”.”\n\nSteve! the tune is called “Do The Tighten Up” :-)\n\nChrisL\n\n"
    },
    {
      "time": " 17.Jul.2007 7.55am",
      "content": "Anything by Beethoven. Or Dimmu Borgir. Blondie is kind of fun, too.\n\n"
    },
    {
      "time": " 17.Jul.2007 10.50am",
      "content": "Wait — are you supposed to kern your fonts?\n\n"
    },
    {
      "time": " 17.Jul.2007 11.45am",
      "content": "_the tune is called “Do The Tighten Up” :-)_\n\nHey, it’s not like I have my 8-tracks here in Moscow! :-)\n\n"
    },
    {
      "time": " 17.Jul.2007 1.33pm",
      "content": "I once did an ad that was a silly little piece of music I wrote (a brithday song for someone actually). I wrote it out in Illustrator (that was really fun). When I showed it they didn’t like where the words fell and asked me to just move a couple of things around. I had to explain that music doesn’t work that way - you can’t put 5 quarter notes in 4/4 time.\n\nSo I ended up rewritting the song a wee bit so we wouldn’t look like idiots.\n\nAnd needless to say I will never, ever try that again.\n\nThat is my tale of “kerning music”.\n\npbc\n\n"
    },
    {
      "time": " 17.Jul.2007 1.39pm",
      "content": "LOL, I can’t say I blame you Paul. Sounds too much like hard work. I have no musical ability whatsoever, so I give you credit. Now for something simpler, where was I up to with my serif font…\n\n"
    },
    {
      "time": " 17.Jul.2007 2.08pm",
      "content": "Weeman - great to see you around here. Get to work on that serif (sound of whips cracking and drums beating)… :)\n\npbc\n\n"
    },
    {
      "time": " 17.Jul.2007 2.15pm",
      "content": "Thanks Paul, I’m still learning to swim amongst the sharks around here. It’s been a while since I saw you on a “forum”, hope you’re well.\n\nahm a gettin! ahm a gettin! (runs off to work on font and throw drum away)\n\nTake Care\n\n"
    },
    {
      "time": " 18.Jul.2007 1.19am",
      "content": "Bach’s fugues in interpretation of Glenn Gould. Perfectly balanced, pure, precise, extremely rhythmical and architecturally structured. Anybody?\n\n"
    },
    {
      "time": " 18.Jul.2007 1.38am",
      "content": "[http://www.pandora.com/](http://web.archive.org/web/20080706164629/http:/www.pandora.com/)  \nThat has got me through a day of lightening Gohan.\n\n"
    },
    {
      "time": " 18.Jul.2007 10.33am",
      "content": "I don’t kern, but I do like to listen to music.\n\nStefan Bodzin; Ellen Allien; Monolake; [Wunderbarend](http://web.archive.org/web/20080706164629/http:/www.wunderbarend.nl/); James Holden; Steve Reich; Joris Voorn; Photek\n\nT.\n\n"
    },
    {
      "time": " 18.Jul.2007 9.11pm",
      "content": "How about Jerome Kern.\n\nMm, Mm, Mm, Mm,  \nJust the way you look to-night.\n\n"
    },
    {
      "time": " 18.Jul.2007 11.26pm",
      "content": "[The Buddha Machine](http://web.archive.org/web/20080706164629/http:/www.kk.org/cooltools/archives/001171.php)\n\n"
    },
    {
      "time": " 19.Jul.2007 8.04am",
      "content": "I’ve gotta vote for Pandora, too. I’ve already tailored it in my leisure time with my own impression of old-school Live 105. I try not to pick any channels where I’ll get distracted by anything new and interesting. Now, when I’ve got work to do, it just streams along, perfectly and transparently.\n\n(update: Kris- I just loaded all the bands you listed into a new channel. It sounds very promising for doing exactly this sort of work!)\n\n"
    },
    {
      "time": " 19.Jul.2007 8.06am",
      "content": "i agree totally with this music theme, it has usually a continuous rithm and it is easy to keep you in a good machine like movement situation, electro and trance for me.. also acid jazz can be interesting\n\n"
    },
    {
      "time": " 19.Jul.2007 10.39am",
      "content": " ![](http://web.archive.org/web/20080706164629im_/http:/www.typophile.com/files/37558516_b93a342308_m_4628.jpg)\n\n"
    },
    {
      "time": " 20.Jul.2007 4.19pm",
      "content": "Stephen,  \nI found that same album in a thrift store! Its my favorite! I don’t know what it sounds like though. I love the overprints too.\n\nOthers,  \nI listen to Electronica and Dance too. My favs being House and Trance. Kernkraft is sweet, Franz & Shape is fitting, The Orb, Underworld, Deep Dish, Crystal Method, Dabrye is great, and Felix da Housecat.\n\n"
    },
    {
      "time": " 21.Jul.2007 3.40pm",
      "content": "i’ve been working on kerning CLASSES for 2 days, listening to soundtracks (LOTR, the Illusionist) while doing so makes the work seem more dramatic and important. \\>^p\n\n"
    },
    {
      "time": " 27.Jul.2007 7.33am",
      "content": "Sold out limited edition.  \nFont: Italican by Graham Meade\n\n ![](http://web.archive.org/web/20080706164629im_/http:/www.typophile.com/files/italicanstjohn3_5705.jpg)\n\n"
    },
    {
      "time": " 27.Jul.2007 10.41am",
      "content": "<cite>... Last.fm. Join the Typophile group.</cite>\n\nI tried joining some time back, but I’m still in limbo. Is there a secret password to get approved?\n\n"
    },
    {
      "time": " 27.Jul.2007 10.44am",
      "content": "I think your password has to be kerned :-)\n\nChrisL\n\n"
    },
    {
      "time": " 27.Jul.2007 7.01pm",
      "content": "Whoops. It looks as the group’s “Owner” I was the only one who could accept members. I’ve accepted all pending members and made it so any member can accept new applicants.\n\n"
    }
  ]
}
