{
  "id": "35218",
  "title": "Sticking it to us",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Newsweek has an [interesting article](http://web.archive.org/web/20131101171403/http:/www.msnbc.msn.com/id/19762070/site/newsweek/) critiquing the bumper stickers of the U.S. Presidential campaign (or at least the main-stream ones).\n\nUnfortunately the online article doesn't show the graphics.\n\nSo, Optima, anyone? \\*grin\\*\n\n",
  "author": "lherrou",
  "time": "17 Jul 2007 — 6:36pm",
  "uid": "10127",
  "comments": [
    {
      "time": "17 Jul 2007 — 6:56pm",
      "content": "I have never heard of the font \"Ventura\". I think he means Gotham.\n\n"
    },
    {
      "time": "17 Jul 2007 — 7:07pm",
      "content": "Personally, I think all candidates should be required to use Comic Sans to signify what a joke our choices usually are.\n\n"
    },
    {
      "time": "17 Jul 2007 — 7:32pm",
      "content": "In this case 'Ventura' must be Futura. Damn reporters.\n\n"
    },
    {
      "time": "17 Jul 2007 — 7:38pm",
      "content": "Maybe the writer still has Ventura Publisher?\n\nChrisL\n\n"
    },
    {
      "time": "17 Jul 2007 — 8:52pm",
      "content": "<cite>Personally, I think all candidates should be required to use Comic Sans to signify what a joke our choices usually are.<br>\n</cite> fontplayer\n\nI beg to differ... And offer [Typewriter from Hell](http://web.archive.org/web/20131101171403/http:/www.1001fonts.com/font_details.html?font_id=764) or [Bloody-Shrapnel](http://web.archive.org/web/20131101171403/http:/www.fontstock.net/6169/Bloody-Shrapnel.html) instead :)\n\n"
    },
    {
      "time": "17 Jul 2007 — 9:44pm",
      "content": "All I'm hearing these days is Ron Paul, Ron Paul, but I can't vote republican no matter how good/interesting his ideas might be.\n\n[http://www.ronpaul2008.com/](http://web.archive.org/web/20131101171403/http:/www.ronpaul2008.com/ \"http://www.ronpaul2008.com/\")\n\nPalatino and Optima, yawn... hardly says progressive to me.\n\nPlus I don't think even the scribes of the Constitution would be strict constitutionalists in this day and age, surely not if that means toeing the Scalia/Alito/Roberts/Thomas line. Any more than Jesus or Mohammed would expect contemporary global citizens to adhere to some old book that was written in the desert two thousand years ago.\n\n"
    },
    {
      "time": "17 Jul 2007 — 9:54pm",
      "content": "Just popped into my inbox:\n\nA cannibal entered the meat market to buy something nice for dinner. The owner greeted him and told him to look around. The cannibal began to inspect the meat case and noticed the market specialized in brain.  \nUpon further inspection he noticed a marked disparity between the costs of brain meats. A carpenter's brain sells for $1.50 per pound. A plumber's brain sells for $2.25 per pound. He noticed with alarm that a politician's brain sells for $375.00 a pound. With not a little curiosity he asked the owner why the huge difference in price between the similar meats.  \nThe owner responded with a deadpan look on his face, \"Do you realize how many politicians it takes to get a pound of brain?\"\n\n"
    },
    {
      "time": "17 Jul 2007 — 11:55pm",
      "content": "It's Jesse Ventura, come on people! Um, nevermind. Wrong race.\n\n"
    },
    {
      "time": "18 Jul 2007 — 5:59am",
      "content": "Well, I'm just a distant observer of the presidential debates and this is no political forum, but from all I've heard and seen…\n\nMIKE GRAVEL FOR PRESIDENT!!! I don't care about his fonts. Which ones are [those](http://web.archive.org/) by the way? ;-)\n\nFor once there's a candidate that, at least to me, looks like a true alternative…\n\n"
    },
    {
      "time": "18 Jul 2007 — 8:12am",
      "content": "I’m sort of hoping that, seeing as how it was announced on CNN this morning that the most popular Republican candidate is “None of the above,” maybe we won’t see as many bumper-stickers this time around.\n\n"
    },
    {
      "time": "18 Jul 2007 — 8:28am",
      "content": "\"All I’m hearing these days is Ron Paul, Ron Paul, but I can’t vote republican\"\n\nWell, he's really a libertarian in republican clothing.\n\nNot that I'm too keen on voting for a libertarian, as fun as they may be.\n\nAt least he's mixing things up in the debates a bit.\n\nSeems as if roles have been reversed this year. Republicans have no single front runner this year, while the dems have narrowed it down to two already.\n\n"
    },
    {
      "time": "18 Jul 2007 — 8:56am",
      "content": "<cite>Not that I’m too keen on voting for a libertarian, as fun as they may be.</cite>\n\nRon Paul isn’t even fun libertarian, he’s just scary libertarian. I don’t want to even consider the possibility of another President who’s clearly detached from reality. The same goes for Guiliani, who actually seems to be buying into his own hype.\n\nI think I’ll be stuck bearing the Obama standard. He still freaks me out with his belief in fairness and his tendency to talk about religion more often than some of the crazy fundie candidates, but aside from that he seems to have his head pretty well screwed on in the Bill Clinton sort of way.\n\n"
    },
    {
      "time": "18 Jul 2007 — 12:08pm",
      "content": "It makes me crazy that they all feel like they need to profess their faith in order to be a viable candidate. I wish someone would have the guts to say that there is no place for religion in government.\n\nI'll vote for the dem, whoever it is. Dunno yet who I'll vote for in the primary. Al Gore???\n\n"
    },
    {
      "time": "18 Jul 2007 — 12:57pm",
      "content": "<cite>there is no place for religion in government</cite>\n\nIn one sense of the word I agree, although **if** there were an Entity that spoke everything into existence, and holds it all together by the power of His will, then I imagine that one day he will decide that if it's ever going to be done right, He'll just have to do it Himself.\n\nUntil then we have the blind leading the blind, regardless of party affiliation. It may be a moot point to try to figure out who is sold out to what, in order to get where they are.\n\nAmen.\n\n"
    },
    {
      "time": "18 Jul 2007 — 2:08pm",
      "content": "The hell with politics. I just wish the small business community could be convinced that, unless they're selling something specifically religious, there is no place for religion in advertising.\n\n(Personal rant apologies. Irrelevant Jesus fish just bug me.)\n\n"
    },
    {
      "time": "18 Jul 2007 — 2:21pm",
      "content": "\\> Irrelevant Jesus fish just bug me\n\nJudging by some of the people who use them, one could deduce that they can serve as a warning. The ones that bother me are the ones on cars zooming past me when I am (alledgedly) already over the speed limit.  \n: )\n\n"
    },
    {
      "time": "19 Jul 2007 — 5:02am",
      "content": "\\>\\>I just wish the small business community could be convinced that, unless they’re selling something specifically religious, there is no place for religion in advertising.\n\nAgreed. I just finished a website for someone who, in their \"About Us\" section, insisted in including that they were the regional director for an organization that encourages prayer in schools. In general, I believe there shouldn't BE an \"about us\" section, the home page should tell the visitor what they need to know (but in this case...).\n\n\\>\\>Judging by some of the people who use them, one could deduce that they can serve as a warning. The ones that bother me are the ones on cars zooming past me when I am (alledgedly) already over the speed limit.\n\nNot to mention the SUVs and Mercedes/BMWs/etc with \"Don't let the car fool you, my real treasure is in heaven\". In other words, \"I'm materialistic, vain, and judgmental, but still think I'm a good Christian\".\n\n"
    },
    {
      "time": "19 Jul 2007 — 6:35am",
      "content": "There's big money in religion. It's a valid marketing ploy...especially for a small business with a small market in a rather religious area.\n\nIn the end, religion \\*is\\* marketing/advertising. ;o)\n\n"
    },
    {
      "time": "19 Jul 2007 — 8:16am",
      "content": "<cite>In the end, religion *is* marketing/advertising.</cite>\n\nAlthough it should be noted: **that** is one of the only things that really got Jesus upset.\n\n\"Then Jesus went into the temple of God and drove out all those who bought and sold in the temple, and overturned the tables of the money changers and the seats of those who sold doves. 13 And He said to them, It is written, 'My house shall be called a house of prayer,' but you have made it a 'den of thieves.'\" - Matt 21:13 NKJV\n\n"
    }
  ]
}
