{
  "id": "35219",
  "title": "Research on Dutch type design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've finally relinquished the title of \"lurker\" and become an official poster. (Yes, you can hang me on the wall if you like)\n\nI'm approaching the final year of my BFA studies and am doing some study of Dutch type design, specifically the work of Jan van Krimpen. I plan on synthesizing the information I garner into a typeface, whose parameters have not totally been set yet. I'll make sure to keep things posted as the work progresses.\n\nSo, here's the question: What are the best resources for finding specimens (pdfs, scans, or whatever as long as my budget will allow) of Jan van Krimpen's work?\n\nI've ordered a copy of Dutch Type by Jan Middendorp and have a copy of Letters of Credit by Walter Tracy. Any other recommendations of books I should look into?\n\nI've also tried to search the Typophile forums to see if any other threads have come up about this specific topic to no avail. If there are any related posts, that would be helpful as well.\n\nThanks in advance for the help.\n\nArlo\n\n",
  "author": "Arlo Vance",
  "time": "17 Jul 2007 — 9:02pm",
  "uid": "13604",
  "comments": [
    {
      "time": "17 Jul 2007 — 10:04pm",
      "content": "Dear Lurker,  \nYou hit on my favorite subject. There are a few good books on the work of Jan van Krimpen. I had the priviledge of going to Johannes Enschede & Zon(s) in Haalem. I saw some of his original work with the firm. Sem Hartz was alive then and he worked with van Krimpen in the development of type that came out in Monotype form. His most grandeous project was the Cancellersca Bastarda with over 250 characters. I'm sorry that htis face was never digitized. I reproduced it in a photolettering font over 40 years ago. Van Krimpen was also a prolific writer on letter design.\n\n"
    },
    {
      "time": "17 Jul 2007 — 10:31pm",
      "content": "If you want to own a printed \"original\" Van Krimpen, his stamps are inexpensive:  \n [http://www.jaysmith.com/Specials/World/World-Europe-Netherlands-Stamps.html](http://web.archive.org/web/20131012141945/http:/www.jaysmith.com/Specials/World/World-Europe-Netherlands-Stamps.html \"http://www.jaysmith.com/Specials/World/World-Europe-Netherlands-Stamps.html\")  \nScroll down to the \"number plus calligraphic scroll-work knocked out of a bright solid colour\".\n\n"
    },
    {
      "time": "18 Jul 2007 — 2:33am",
      "content": "<cite>His most grandeous project was the Cancellersca Bastarda with over 250 characters. I’m sorry that htis face was never digitized.</cite>  \nYou will be pleased to hear that Cancelleresca Bastarda is actually in the process of being digitised for TEFF. I am a big admirer of Jan van Krimpen's work too, and CB is indeed one of his finest. I have examined the original drawings, type specimens and punches myself, only to find a world of differences (naturally). Paul Rädisch, the punchcutter who cut almost all of Van Krimpen's typefaces, was a very skilled man and I think he has been praised too little for this. It was him who actually made the typefaces work.\n\nBack to the subject, other notable books about Van Krimpen's work are:  \n- About Designing and Devising Type, written by JvK himself  \n- Adieu Esthetica, written by various authors for a JvK exhibition in The Hague\n\n"
    },
    {
      "time": "18 Jul 2007 — 5:00am",
      "content": "'The Work of Jan van Krimpen', by John Dreyfus is a must, as well as 'About Design and Devising Type,' mentioned above. If the second is the book I remember seeing, the two are among the most beautiful books I have ever seen. I think both are letter press, I suspect with a lot of foundry type, so you get to see the optical sizing accomplished by punch cutter Paul Rädisch.\n\nPaul are you doing the digital Cancelleresca Bastarda? I am also curious about the Romulus revival. There is an extensive PDF of it on the DTL site, but it still doesn't seem to be for sale. I still think that for Romulus to be practical, it needs to be mated to an appropriate JvK italic, weight adjusted. This would be in addition to, or maybe even replacing the not so successful sloped roman that DTL has digitized.\n\n"
    },
    {
      "time": "18 Jul 2007 — 6:58am",
      "content": "FWIW, [  \nDutch Type is free at Google](http://web.archive.org/).\n\n"
    },
    {
      "time": "18 Jul 2007 — 11:51am",
      "content": "How much is a live link?\n\nTim\n\n"
    },
    {
      "time": "18 Jul 2007 — 12:04pm",
      "content": "[Dutch Type](http://web.archive.org/web/20131012141945/http:/books.google.com/books?id=sR9g5xPPJVQC&pg=PP1&ots=V3t8cdxrFE&dq=Dutch+type&sig=jOMr_ykfibw5gR-nKGl7htz3p34)\n\n"
    },
    {
      "time": "20 Jul 2007 — 2:29am",
      "content": "William,\n\n<cite>Paul are you doing the digital Cancelleresca Bastarda?</cite>  \nYes, I do. Although I haven't been able to work much on it recently.\n\n"
    },
    {
      "time": "21 Jul 2007 — 10:09pm",
      "content": "Paul  \nDon't give up on CB. It took me 2 years to work on 3 versions before I made the film font. I was fortunate to have 3 sizes in my type cases as a reference.\n\n"
    }
  ]
}
