{
  "id": "35223",
  "title": "Publishing a magazine",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI am looking for any kind of information about equipment needed to set up a small team of art directors, authors and production designers to run a magazine. As silly/arogant/non-descriptive as it may sound, it is a question of resources I have to present to the investor, who is interested in starting a corporate publishing project. Should I ask it elsewhere, please let me know the resources (forums, articles, human contacts) where I could educate myself.\n\nBig thanks in advance.  \n-A\n\n",
  "author": "popovich",
  "time": "18 Jul 2007 — 3:33am",
  "uid": "1788",
  "comments": [
    {
      "time": "18 Jul 2007 — 4:11am",
      "content": "In my experience (and with my very little knowledge) the biggest problem is not production bust distribution. You can make the best content in the world, and print it up well, too. But without a distribution network, no one will ever know. The internet makes distribution easier than before, but the field is still difficult.\n\n"
    },
    {
      "time": "18 Jul 2007 — 4:40am",
      "content": "I own just such a magazine. Dan is right about distribution - but it works hand in hand with advertising - and becomes a true Catch-22.\n\nThere are professionals out there that know just how to write the kind of report you are speaking of. It also goes beyond what you pay for rent, utilities, salaries, expenses in general. It also is about each one's experiences professionally, and what they bring to the magazine. Also, your 5 year plan. Your hopes for the magazine -- where you see it in 10 years, etc. A spread sheet alone will not do for an investor.\n\nOur magazine started 4 years ago - on a shoe-string budget and printing 3,000 -- no subscribers and well, we called it the immaculate conception. Today, we have investors, we print 7.500 copies and distribute all of them. (I could have done with another 2,000 for the July/August issue) We have subscribers - set up a way through Paypal for potentials to subscribe on line. Our most important guy is our salesperson. Advertisers want more readers to spend their dollars -- and we need more dollars to produce the magazine.\n\nInteresting, I know a few that are in the magazine business. One told me not to consider selling till we reached a subscription base of 100.000 - because no one would look at the magazine seriously. Another made the magic number 20,000, Go figure.\n\nMeanwhile, it is fun to do the magazine - and ours has such a select audience, you have to love cars - and I'm not just talking new ones, but the old beauts... like Bugatis, Hispanas. And you really have to know your topic well. Oh, and get a good proofreader - they made me editor - and when I made a boo hoo -- it hurts!\n\nGood luck - and let us know how it turns out. If you'd like to email me, please do so through my website. Thanks.\n\n"
    },
    {
      "time": "18 Jul 2007 — 4:49am",
      "content": "Hi Dan,\n\ncertainly, the distribution issue is being worked out. But as the publication is not going to show up on the streets and is concepted as a direct-mailing, customer-oriented reading, we will have to deal with the distribution question a bit differently. What bothers me more is the whole set up of the team, the volume of the investment: nminimum team size, equipment, pre-production and production process. Should I go to a prepress studio and let them do the whole thing, or should I have someone in-house, who normalizes colors and makes print-ready pdfs? Should I print here in Germany, or somewhere localy? Do I need 15 people of staff from the start up or can we do a quarter-based publication with a much smaller team, relying on the freelances and project-based externs?...\n\nThanks for the insight, though. It is really important to pay attention to all details of the process.\n\n-A\n\n"
    },
    {
      "time": "18 Jul 2007 — 5:48am",
      "content": "Hi Jackie,\n\nthe investor is the owner of the company I work for and we are on a short leg, so to say. I've already presented the concept of the magazine and the presentation was welcomed. As for now, I am working on the 5-year plan, including inital assets, running expenses, revenue from advertising, issue schedule and volume for each issue and distribution policy and figures.\n\nThe magazine is based around a concept, which till today is not really explored much, though there are magazines, which claim they are the experts in the field. If we do it right, we will have no real competitor on the major distribution market (Eastern Europe), which adds to the stimulation to publish such a mag.\n\nBut to take out the concept part of the business, I ought to have some realistic figures, before I can try to calculate the business and persuade the investor. That's what I am after.\n\nDo I need Macs & Quark or will PCs and CS3 do? Are there some software except for DTP monsters I have to look for? Do I need Canon/HP/Epson proof-able printers or do I need a better scanner instead? Which one, then?...\n\nCheers,  \nA\n\n"
    },
    {
      "time": "18 Jul 2007 — 9:10am",
      "content": "\\> not to consider selling till we reached a subscription base of 100.000 - because no one would look at the magazine seriously. Another made the magic number 20,000,\n\nThe number will move around based on the target audience of the book. One aimed at a general market will need the six digit figure. But if your market is focussed enough, then a few thousand will attract people.\n\n\\> Do I need Macs & Quark or will PCs and CS3 do\n\nPlatforms are immaterial today. If you know your talent in advance, go with what they are comfortable with. Just don't scrimp and buy home machines ... DTP works best with large hard disks, large monitors (a minimum of two per computer) and as much memory (RAM) as you can get in them.\n\nI would have outside prepress, if you can find a company/freelancer that you can trust to do good work and meet the deadlines.\n\nFor staff, you can start off entirely with freelancers on the editorial side, although it might be smart to have the editor full time. Your advertising person should be full time ... a part timer is too quick to start selling for the clients that are easy to sell for, and ignoring the grunt work of developing an advertiser base. You also need at least one full time person to answer the phones ... it doesn't sound too professional when your call goes to an answering service.\n\nPrinting is definitely farmed out, you seem to know this. As for how far to send it, I would suggest you stick close to your base if you can while learning, and then move to a cheaper/more distant printer after you have your act together (unless you develop a loyalty to your original printer).\n\nFor software, you need the full CS3 print suite (InDesign, Photoshop, and Acrobat are mandatory and Illustrator is nice to have).\n\nAnd you will need to buy fonts. Lots of fonts. Tons and tons of fonts. Exclusively from the people who visit this forum. :)\n\n"
    },
    {
      "time": "18 Jul 2007 — 9:47am",
      "content": "There is an entire industry (of which I am a part) dedicated to helping companies like yours publish magazines for their customers and prospects. In the U.S., it's generally called \"custom publishing\"; in the UK and Europe, \"customer publishing.\"\n\nCustom Publishing Council (US)  \n [http://www.custompublishingcouncil.com/](http://web.archive.org/web/20131014075019/http:/www.custompublishingcouncil.com/ \"http://www.custompublishingcouncil.com/\")\n\nAssociation of Publishing Agencies (UK)  \n [http://www.apa.co.uk/](http://web.archive.org/web/20131014075019/http:/www.apa.co.uk/ \"http://www.apa.co.uk/\")\n\nWithin this group, there are as many publishing models as there are publishers. Some hire a custom publisher as a turnkey solution; the client acts as an editorial board/publisher to direct content, but the publishing company produces (i.e., writes, edits, photographs, designs, prints, distributes) the publication. Other companies just want help with a small part of the process.\n\nThere can be economies of scale when working with an outside firm. We print more than 60 million magazines, so our buying power can secure lower print costs for our clients.\n\nI don't know what the advertising world is like in your market, but in the U.S. it's very difficult to make a custom magazine self-sustaining strictly through advertising revenue. Large advertisers aren't generally interested in small niche audiences, and your business partners and vendors may resent paying to help you increase market share -- they're likely to want to trade/barter for ad space, for example.\n\nMost of our clients look at their magazines as a marketing expense; they're able to demonstrate return on investment by tracking the calls/orders generated by the magazine, by tallying press mentions and other PR benefits, and by surveying their readers and measuring how their attitudes and buying patterns have changed as a result of receiving the publication.\n\n"
    },
    {
      "time": "18 Jul 2007 — 11:56am",
      "content": "\\>Platforms are immaterial today.  \nThat's what I am hoping for. I am more proficient with InDesign than with Quark family, but I've heard (for the moment, only heard) about systems, like Quark Publishinig System, which supposedly streamlines the whole process. The question is — do I need it from the start up (probably, no), will I need it later, in 5 years, when the publication grows from a quartely issue to a monthly publication? If yes, should I start with Quark from day one? Is there a system like this, which can be incorporated into Creative Suite workflow?\n\nPrepress  \nTo put it straight — we are based in Frankfurt/Main, Germany. Our whole clientele is in Russia and neighboring countries. So obviously the publication is thought to be set in Russian language. I am not sure if it makes any difference for a german prepress house to set text in Russian or German, but I would consider having someone in-house, where I can look over the shoulder and help with the stuff. But then again, it's not only about setting type. Will I find someone that good in DTP here in Germany? Or should I split the work between typesetting in-house and everything else as an external job?\n\nStaff  \nI've thought about starting with a full-time editor, an art director/production director, a full-time sales manager and myself as a creative director and project manager. If everything goes fine, the staff should grow with couple of editors, couple of sales/ad people, designers (possibly to return preproduction back in-house). I will definitely need a freelance translators, writers and photographers. This too is a field which I have to learn yet (though, this one seems least alien to me of all other aspects of the job).\n\nSoftware  \nAs mentioned before, Adobe CS on a PC platform would be my obvious choice. At the moment we work on high-end Dell PCs (Core Duo + 4Gb Ram) and Eizo CE210 screens (hardware and software calibrated). I like the setup and do not know if an Apple with its Cinema displays would do better here. And I would be happy to spend some dough on new and custom type. :)\n\nAgencies  \nAs for the outsourcing the whole process completely — it is my intention to spring out from the company with this project and actually ground an agency, which would do corporate publishing (as it is named in Germany and Russia), advertising localization, graphic design, industrial design, architecture (I like mini-toys and would be proud to have time to design a good chair :) ). So I am not really interested in giving out 80% of job to an agency and later trying to convince everybody, that I can do it better or more effectively or for less money or whatever. But you do have a point - I have to better inform myself about the whole thing. Any resources are very valuable for me, so, hey, thanks for the links.\n\nP&L  \nIn my 5 years span, the publication will be profitable from year 3 if everything runs as I have it described in my plan. Taking into consideration that I am new to the business, I tip, that the actual proceedings will differ from the original figures. And this is where my anxiety lies. How do I convince my sole investor, that this whole thing might get profitable only if he invests enough and keeps supporting me for another couple of years? It is obviously marketing in the first place and to get profitable it should get authorative in its field = time, money, efforts. The reasons for this should be very good and certainly a chance of getting profitable should not be excluded completely.\n\nDon and marcox, thanks for the insight. I do appreciate it.\n\nCheers,  \nA\n\n"
    },
    {
      "time": "19 Jul 2007 — 12:16am",
      "content": "\\> Taking into consideration that I am new to the business\n\nThat is an important consideration. I would look into hiring an experienced consultant to draw up a plan and work with you. I hadn't realized you weren't experienced in the field. I started newspapers both when I was young and stupid, and later when I was not, and things went much better with the experience. I failed on a much larger scale.\n\n:)\n\nRe: Quark\n\nI wouldn't go to Quark for QPS. I think there is a movement over the past few years to Adobe, and they have a InCopy or something similar that gives similar functionality (I think).\n\n"
    },
    {
      "time": "19 Jul 2007 — 1:56am",
      "content": "I hope it doesn't come over as being too arogant, but Don, if my conclusions do not seem lacking so much experience before I explicitely mention it, maybe the whole thing is not so bad? I can send you my calculations, if you have an interest?...\n\nCheers,  \nA\n\n"
    },
    {
      "time": "19 Jul 2007 — 7:54am",
      "content": "I'm on h oliday for a few more days, and will look at your figures if you send them. (donald.mccahill(at-sign)lambton.on.ca).\n\nBut be warned that I am not a consultant, I have never done a magazine before, and I don't know your market or target audiences. Heck, I would even suggest that my newspaper skills are pretty diluted through 15 or more years out of that business. Basically it will be a casual look for anything I can point to as possible problem areas, but no guarantees that \"this will work\" or \"this can't work\".\n\n"
    },
    {
      "time": "19 Jul 2007 — 1:35pm",
      "content": "Don't use Quark.\n\nProfit from year three is too much time. I see magazines disspaear from the shelves after trhee numbers if they are unsuccesful. Why do you need so much time?\n\nHéctor\n\n"
    },
    {
      "time": "19 Jul 2007 — 2:50pm",
      "content": "\\>Don’t use Quark.  \nThat's a statement! Two posts ago I've discovered InCopy. I hope it helps.\n\nTaking into consideration the volume of resourced one has to invest in a Good Magazine, I think, it is OK to have it running in year three and to start earning with a definite progression. If I knew how much I should invest and what I should do to make it profitable from start up, I'd probably consider the option... :)\n\nCheers,  \nA\n\n"
    },
    {
      "time": "19 Jul 2007 — 4:03pm",
      "content": "What you need depends on the scale of your publication. On the Adobe side of the fence, InDesign plus InCopy might be fine for a small publication. With a high-end integrated publishing system based on InDesign, InCopy is just one component of the overall solution, which involves a third-party systems integrator. You'd be looking at something like SoftCare's K4. (There are several other such products, btw - I just don't recall all their names off the top of my head.) I gather K4 has a smaller sibling called K2, now, intended for smaller-scale publications.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "20 Jul 2007 — 1:49am",
      "content": "Thomas,\n\nhuge thanks for the tip. A very nice feature of this software is that these are ze Germans. Do you occasionally know what figures we are talking here? 10K? 50K? 100K?\n\nCheers,  \nA\n\n"
    },
    {
      "time": "20 Jul 2007 — 4:09am",
      "content": "I published a Custom Magazine several years ago. Initially, I started with two Macs, a scanner, a good color laser printer for my own proofs and a staff of one other 3/4 time editor and about five part-time writers/editors. Started showing a profit in three issues, and by the time I quit it (to dedicate myself to other interests) it had a national distribution through niche stores and subscriptions, reaching into 32 U.S. states and Canada.\n\nYou can produce the thing with the barest of resources, if you want. Advertising is, as stated above, very important. A good as salesman would be essential. I sold the ads myself, but that's mostly because I wanted that control and I had very specific content/ad ratios (70/30 editorial) I wanted to maintain and not exceed.\n\nFind a printer you're comfortable working with (and I chose one fairly close, because with the first year's issues, I was on press checks every run, catching mistakes (mine and the printer's), making changes, etc.).\n\n"
    },
    {
      "time": "20 Jul 2007 — 4:21am",
      "content": "Hey Chuck,\n\nyour initial setup seems very close to what I've thought it to be. Have you had an experience in publishing and/or managing a magazine before jumping in the business? The whole scheme seems really close to mine and I am eager to know more... if you have anything more to tell.\n\nCheers,  \nAlexey\n\n"
    },
    {
      "time": "20 Jul 2007 — 7:52am",
      "content": "well, i worked as a designer, illustrator and art director for several magazines and large newspapers before i went into my own publication, so i knew the ropes a little -- at least from one side -- beforehand. i had SOME experience with managing a creative staff, but not a lot. fortunately, if you're adaptable, you can pick it up on the fly, particularly if it IS a small startup, because you have so much more control.\n\nlike i said, i started very modestly. 2 macs -- so at any given time, we could be both writing/editing and doing production work.\n\ni could talk for days on the experience...\n\n"
    },
    {
      "time": "20 Jul 2007 — 8:29pm",
      "content": "if i knew more specifics about your project (and i know, you may be reluctant to broadcast them too soon and to strangers), i might be able to give you my feedback. i took a look at marcox's link (above) and it looked like it may be helpful as well, depending on your vision of the size of launch. myself -- i started small, with a first-issue printing of 5,000. a lot of the early distribution, i drove around delivering myself. but it grew and grew -- much by word of mouth, but also with some lucky (sometimes you make your own) exposure and notice.\n\n"
    },
    {
      "time": "21 Jul 2007 — 3:07am",
      "content": "chuck, I've dropped you an email. :)\n\n"
    },
    {
      "time": "23 Jul 2007 — 6:38am",
      "content": "Oh, by the way, can anyone recommend me some good books on magazine design? Has anyone read any of these titles?\n\n ![](http://web.archive.org/web/20131014075019im_/http:/typophile.com/files/thegrid_6187.jpg)\n [The Grid: A Modular System for the Design and Production of Newpapers, Magazines, and Books](http://web.archive.org/web/20131014075019/http:/www.amazon.com/gp/product/047128923X/)\n\n ![](http://web.archive.org/web/20131014075019im_/http:/typophile.com/files/editingby_5699.jpg)\n [Editing by Design: For Designers, Art Directors, and Editors](http://web.archive.org/web/20131014075019/http:/www.amazon.com/gp/product/1581153023/)\n\n ![](http://web.archive.org/web/20131014075019im_/http:/typophile.com/files/handbook_6021.jpg)\n [The Magazines Handbook (Media Practice)](http://web.archive.org/web/20131014075019/http:/www.amazon.com/gp/product/0415170346/)\n\n ![](http://web.archive.org/web/20131014075019im_/http:/typophile.com/files/magediting_5291.jpg)\n [Magazine Editing: How to Develop and Manage a Successful Publication](http://web.archive.org/web/20131014075019/http:/www.amazon.com/gp/product/0415303818/)\n"
    }
  ]
}
