{
  "id": "35239",
  "title": "Museum Fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi, very nice lift on the site by the way.\n\nWhat are some favorite museum fonts from independent foundries? Paradigm from Shinntype is a nice example. How about some others? Thanks...\n\n",
  "author": "Bobby H",
  "time": "18 Jul 2007 — 11:51am",
  "uid": "19715",
  "comments": [
    {
      "time": "18 Jul 2007 — 11:53am",
      "content": "Could you describe what you mean by \"museum fonts\"?\n\n"
    },
    {
      "time": "18 Jul 2007 — 12:01pm",
      "content": "Fonts that would be at home in a museum for exhibition use and other curatorial work. Also, fonts that would easily enable the branding of a special exhibit, be it for a classical orientation or a contemporary one, as examples.\n\n"
    },
    {
      "time": "18 Jul 2007 — 12:10pm",
      "content": "\\> _Museum Fonts_  \nI honestly thought you meant a font viewed in a museum...  \nlike I loved reviewing the original Giambattista Bodoni punches at the Plantin-Moretus Museum in Antwerp.\n\n"
    },
    {
      "time": "18 Jul 2007 — 12:16pm",
      "content": "Well, Whitney by H&FJ was designed for the Whitney Museum. It's a huge family.\n\n"
    },
    {
      "time": "18 Jul 2007 — 12:48pm",
      "content": "This is akin to asking \"what's a good company font\" before designing a logo.\n\nI think you should seek a typeface that fits the exhibit rather than one that fits museums in a broad sense.\n\n"
    },
    {
      "time": "18 Jul 2007 — 1:58pm",
      "content": "I think of museum fonts in terms of \"microsignage\". That is, the small labels and placards that accompany exhibits, along with the larger, text heavy posters explaining the exhibits. This is related to, but not the same as, the fonts on the wayfinding signs that direct you through and between exhibits, but those could be included in the superset of museum fonts as well.\n\nI can't help but keep thinking of how to redesign the signs in the Rosicrucian Egyptian Museum in San Jose. they have some labels on their exhibits that haven't been changed since they were typed in the '60s (like, on a typewriter, man).\n\n(not much of an answer, more of a comment)\n\n"
    },
    {
      "time": "18 Jul 2007 — 2:11pm",
      "content": "\\>I honestly thought you meant a font viewed in a museum...\n\nA related question, I'm helping with an exhibit of Matthew Carter's fonts for Microsoft during Typecon. Which font should we use on the captions for artifacts?\n\n"
    },
    {
      "time": "18 Jul 2007 — 2:46pm",
      "content": "Bruce Rogers' Centaur ( [Metropolitan](http://web.archive.org/web/20150218043029/http:/www.p22.com/lanston/products/metropolitan.html)) was originally made for the Metropolitan Museum of Art in 1914\n\n"
    },
    {
      "time": "18 Jul 2007 — 3:33pm",
      "content": "I think H&FJ also designed Guggenheim's house font for them (now commercially available as an expanded family called [Verlag](http://web.archive.org/web/20150218043029/http:/www.typography.com/catalog/verlag/index.html)). I'd love to hear more about fonts designed for museums or art galleries, as I work in-house at an art gallery. We are considering a re-design of our corporate style and this would be an excellent starting point for considering new house fonts.\n\n"
    },
    {
      "time": "18 Jul 2007 — 5:30pm",
      "content": "sii - Of the fonts he did for MS I think Georgia works best in print.\n\n"
    },
    {
      "time": "18 Jul 2007 — 6:38pm",
      "content": "CameronM - I already cited Paradigm. I also think FS Ingrid and Dalton Maag's Interface are wonderful families to consider for your project and a related project that I, too, have in mind. Also, I would think that FF Scala would be on anyone's shortlist for this type of application.\n\n"
    },
    {
      "time": "18 Jul 2007 — 8:54pm",
      "content": "\\>sii - Of the fonts he did for MS I think Georgia works best in print.\n\nThanks, you're probably right. I wonder if one of his retail fonts might work better?\n\n"
    },
    {
      "time": "18 Jul 2007 — 10:13pm",
      "content": "> _I’d love to hear more about fonts designed for museums or art galleries, as I work in-house at an art gallery. We are considering a re-design of our corporate style . . ._\n\nCameron, I would think that you would want to study the [Walker Art Center](http://web.archive.org/web/20150218043029/http:/walkerart.org/ \"Walker\")'s very ambitious [identity program](http://web.archive.org/web/20150218043029/http:/design.walkerart.org/detail.wac?id=2090&title=Projects).\n\n"
    },
    {
      "time": "19 Jul 2007 — 12:08am",
      "content": "\\> I honestly thought you meant a font viewed in a museum\n\n\\> Paradigm from Shinntype is a nice example.\n\nAre you saying Nick belongs in a museum?\n\n:)\n\n"
    },
    {
      "time": "19 Jul 2007 — 10:51am",
      "content": "Actually, I was wondering, \"If you had an art gallery, museum, or similar environment, which independent foundry faces would be in your top ten for this type of application? ... and also your three indy \"must haves.\"\n\n"
    },
    {
      "time": "19 Jul 2007 — 11:02am",
      "content": "_...Nick belongs in a museum_\n\nIn true Typophile style, I'll take that as a complement.\n\n"
    },
    {
      "time": "19 Jul 2007 — 11:23am",
      "content": "sii - you may also want to consider Gerard Unger's Capitolium. Mr. Carter seems to respect this typeface, calling it \"very Gerard Unger.\"\n\n"
    },
    {
      "time": "20 Jul 2007 — 9:57am",
      "content": "I love [Tate Gallery](http://web.archive.org/web/20150218043029/http:/www.tate.org.uk/)'s Typeface.\n\n"
    },
    {
      "time": "20 Jul 2007 — 10:31am",
      "content": "_I love Tate Gallery’s Typeface._\n\nWord.\n\n_In true Typophile style, I’ll take that as a complement._\n\nUnless they mean the natural history museum. Oh snap! ;)\n\n"
    },
    {
      "time": "20 Jul 2007 — 10:41am",
      "content": "St. Louis Art Museum uses Trajan for its signage, but not its 'microsignage.'\n\n ![](http://web.archive.org/web/20150218043029im_/http:/typophile.com/files/slam_5401.jpg)\n\n"
    }
  ]
}
