{
  "id": "35258",
  "title": "Kerning in real life?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I came across a strange thought of kerning in real life. I was thinking where else can we find kerning beside type? And saw we use kerning eveywhere. It's just called differently. One name for it in real life would be \"double measure\" when you apply different principals/acting/behaviour/etc. with different ethnicity/gender/etc.\n\nCan you come up with kerning in other areas of life? Mechanics perhaps? Other professions?\n\nSeeing that kerning exists eveywhere made me think why the \\*\\*\\*\\* did <cite>they</cite> name it \"kerning\" in type design?\n\n",
  "author": "litera",
  "time": "19 Jul 2007 — 3:41am",
  "uid": "18888",
  "comments": [
    {
      "time": "19 Jul 2007 — 4:06am",
      "content": "Well there was this guy named Kern. And one day... No. That's not true. ;-)\n\nActually I don't know either. Have you tried Wikipedia yet?\n\nAlso, I am not 100% on board with your kern analogy.\n\n"
    },
    {
      "time": "19 Jul 2007 — 5:11am",
      "content": "I think it refers to the need to physically remove a little bit of metal from a piece of type. Maybe related to kernel.\n\nWhen I was a welder we called this \"whacking it really hard with a 5Lb hammer until it fits\".\n\n"
    },
    {
      "time": "19 Jul 2007 — 5:07am",
      "content": "Molecular geometry? But it's Nature's built-in kerning.\n\n"
    },
    {
      "time": "19 Jul 2007 — 5:57am",
      "content": "Ok. Eben. Another analogy. Let's say a plane is trying to land on a track with wind pushing him, so the pilot will take a bit of the engine power to make a perfect landing... What do you think about this one?\n\nAnd yes. I did check Wikipedia on this. But to no avail.\n\n"
    },
    {
      "time": "19 Jul 2007 — 6:03am",
      "content": "Comfort zones are like human kerning. If someone is a close talker their kerning is too tight.\n\n"
    },
    {
      "time": "19 Jul 2007 — 6:36am",
      "content": "kern2 (kûrn) Printing.  \nn.  \nThe portion of a typeface that projects beyond the body or shank of a character.\n\n"
    },
    {
      "time": "19 Jul 2007 — 7:07am",
      "content": "OED\n\nVerb  \ntrans. To furnish (a type) with a kern; to make a kern on. Hence {sm}kerner, a workman who makes or adjusts kerned type.  \n1683 MOXON Mech. Exerc., Printing xix. {page}5 Amongst the Italick-Letters many are to be Kern'd, some only on one side, and some both sides. The Kern'd-Letters are such as have part of their Face hanging over one side or both sides of their Shanck. Ibid. xiii. {page}4 They..left the Letter-Kerner, after the Letter was Cast, to Kern away the Sholdering. 1824 J. JOHNSON Typogr. II. 23 Some founders have been more liberal than others in kerning letters. 1865 Standard, Police News (May) [A witness described himself as a kerner in Messrs..'s letter foundry].\n\nNoun  \n[For \\*carn, a. F. carne ‘projecting angle, nib of a quill pen’, a northern form (for \\*charne):{em}L. cardinem hinge.]\n\nA part of a metal type projecting beyond the body or shank, as the curled head of f and tail of j, as formerly made, and parts of some italic letters. (Cf. KERNED ppl. a.2)  \n1683 MOXON Mech. Exerc., Printing xix. {page} 7 Every next Letter is turned with its Nick downwards, that the Kern of each Letter may lie over the Beard of its next. 1824 J. JOHNSON Typogr. II. 655 Kern of a Letter, that part which hangs over the body or shank.\n\nThese are the meanings that apply to printing. Mechanics shim.\n\nTim\n\n{edit to put this post after Eric’s}\n\n"
    },
    {
      "time": "19 Jul 2007 — 7:06am",
      "content": "From Merriam-Webster's online:  \n<cite>Etymology:<br>\n    French carne corner, from French dialect, from Latin cardin-, cardo hinge<br>\nDate:<br>\n    1683</cite>\n\nAnyone have an unabridged OED or a subscription to the site? (Edit: See above.)\n\nRegarding analogous kerning-esque activities, is it accurate to say you're looking for examples of people moving things around with the aim of modulating space? Depending on how broad you want to take it, landscapers, plastic surgeons, and all manner of artists do this as a matter of routine. But then you could also say a pugilist kerns his/her fist to an opponent's face.\n\n"
    },
    {
      "time": "19 Jul 2007 — 7:11am",
      "content": "KFC's Kernal Sanders took a little transfat out of his formula for chicken frying and tightened up the diets of many finger-lickin' Americans :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Jul 2007 — 7:48am",
      "content": "littera: <cite>why the **** did they name it “kerning” in type design?</cite>\n\nWell, the question is really why do _we_ call it \"kerning.\" _They_ had something slightly different in mind when the term was coined.\n\n\"Kerning\" is one of those terms that has been leveraged from one technology to the next, to the point where it's evolved quite a bit from its origins, not unlike \"leading.\"\n\nHere's a relevant excerpt from Harry Carter's translation of <cite>Manuel Typographique,</cite> the 18th-century manual on typefounding by Fournier le Jeune.\n\n\"Another essential operation performed with the same knife is _kerning._ This is a matter of hollowing out beneath the little projecting strokes which overlap the shanks upon which the letters are cast. In the roman alphabet this occurs in the case of f, [long-s], ff, [double-long-s]. These characters have isolated beaks which are only supported by being joined on by the face to the rest of the letter. Kerning consists in hollowing out the under-sides of these beaks so that they may overhang the letter which adjoins them. When these little beaks are kerned, the edge of the knife is passed up and down the shank on the kerned side.\"  \n[from <cite>Fournier on Typefounding</cite> (1764), Harry Carter, trans., 1930]\n\nThe term in Fournier's original is _crénerie (n.)/créner (v.)_, from which, I believe, the English \"kern\" is derived. Moxon is earlier than Fournier. He would have gotten his information probably via the French, possibly the Dutch. I wonder if he coined the English term. I'm not sure why the dictionaries cite _carne_ as the French source. I'd be curious to see what they use to support this derivation.\n\nBecause of the tremendous work involved and the fragility of the results, few characters were designed to have kerns (i.e. overhanging parts) in metal.\n\nIt is only when you come to the photo and digital ages, with virtual sidebearings, that you begin to encounter the kind of widespread contextual repositioning that we think of as kerning today.\n\n-- K.\n\n"
    },
    {
      "time": "19 Jul 2007 — 9:56am",
      "content": "_One name for it in real life would be “double measure”_\n\nor \"double standard\"?\n\nI kern when I pack my suitcase. Sure, the folded t-shirts abut nicely, but fitting my boxers and socks requires a bit of adjustment.\n\n"
    },
    {
      "time": "19 Jul 2007 — 5:56pm",
      "content": "Nice thread!\n\nThanks for the info Dennis, Eric & Tim.\n\nI still think maybe some of these analogies I am reading are just a case over-kerning. ;-)\n\nBut carry on. Don't mind me!\n\n"
    },
    {
      "time": "19 Jul 2007 — 6:19pm",
      "content": "<cite>But then you could also say a pugilist kerns his/her fist to an opponent’s face.</cite>\n\nAnd when he does it just right, the opponent's baseline rotates 90 degrees.\n\n"
    },
    {
      "time": "19 Jul 2007 — 6:41pm",
      "content": "<cite>Comfort zones are like human kerning. If someone is a close talker their kerning is too tight.</cite>\n\nI thought of this too. And kerning (in this way) is somewhat regional - here in NY we get used to being jam packed up against strangers in the subway. But if someone were to stand that close to you in a shopping mall you'd call the police.\n\n\"Kern?!? When did I have kern?\"\n\n"
    },
    {
      "time": "19 Jul 2007 — 7:10pm",
      "content": "An interesting bit related to the definitions already posted above...\n\nThe [_ **Glossary of Typesetting Terms** _](http://web.archive.org/web/20150202015548/http:/www.amazon.com/Glossary-Typesetting-Chicago-Writing-Publishing/dp/0226183718/ref=sr_1_1/105-4304836-8465243?ie=UTF8&s=books&qid=1184896845&sr=1-1), after its definition of **kern** , refers the reader to the term\n\n**Mortise** : (1) In **handset type** , to \"pull\" letters closer together by cutting away metal. The term has been to some extent carried over into computer composition, in which **kern** is sometimes applied to either adding or reducing space between character pairs; mortise always means reducing space. (2) When **repro** paper is mounted on boards, to cut a hole in the repro paper so that another piece of repro paper with a correction fits snugly into it. It is wise to mortise corrections in repro paper when they are quite small (a letter, a word, etc.) so that they will stay in place. Also called _cutting in_.\n\n"
    },
    {
      "time": "23 Jul 2007 — 12:59pm",
      "content": "In related trivia, my colleague Ken Lunde at Adobe (our Japanese type expert, and expert on CJKV encodings and processing) has a brother named Kern. Really.\n\nPlus, there's my colleague Ole Kvern....\n\n"
    },
    {
      "time": "24 Jul 2007 — 2:58pm",
      "content": "Kudos to those who live in Kern County.\n\n"
    }
  ]
}
