{
  "id": "3527",
  "title": "(x) more typeface examples...",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I posted a request before and it was so sucessful that I decide to ask for another favor... Here is a list of fonts I need. It would be apprecated if anyone could help...   \nPalatino Regular   \nUnivers 57   \nFrutiger Black, Medium and Italic   \nOptima Regular and Bold   \n   \nSorry for th multiple threads.. but I need to identify 50 more fonts by next Friday\n\n",
  "author": "shyguy1",
  "time": "Wed, 2004-03-10 00:40",
  "uid": "2693",
  "comments": [
    {
      "time": " Wed, 2004-03-10 01:43",
      "content": "To help on one of your fonts to get you started is fine, I think, but really, this is your assignment, and I think you should do it yourself. I'm not going to be a completely wet blanket about it, though: I'll give you the link to [Brands of the World](http://web.archive.org/web/20050518124049/http:/www.brandsoftheworld.com/), a site with thousands of worldwide company logos. Spend some time sifting through there, and I'm sure you'll find examples of the fonts you're looking for.   \n   \nThis has been advice of the \"give Mikey a fish and he'll eat for a day, teach Mikey to fish and he'll eat for a lifetime\" variety. It's given with the utmost respect for the challenges you face as a student.   \n   \nGood luck!\n\n"
    },
    {
      "time": " Wed, 2004-03-10 02:03",
      "content": "Let me also add -- and I know this is totally unhelpful -- that I do sympathize with you, as I think it's an utterly ridiculous assignment. Better, I think, to have the assignment be more like what we do here everyday, i.e., taking a sample and identifying the type. Your assignment is the other way around, and I just don't see the value of it. It's kind of like a wild goose chase.   \n   \nThat said, it's your assignment, and therefore it's your responsibility. If you can, however, choose a different instructor next time.\n\n"
    },
    {
      "time": " Wed, 2004-03-10 02:10",
      "content": "I don't quite understand, do you mean you need examples of logos using the fonts that you listed?   \n   \nIf so, Optima is the face of Estee Lauder. Someone, I can't remember who, said that font looks like a 50-year-old with multiple facelifts.   \n   \nOr perhaps in today's less invasive context, too many Botox shots.   \n   \n:P\n\n"
    },
    {
      "time": " Wed, 2004-03-10 06:59",
      "content": "I strongly agree with Chesh that it's not our job to do your homework, primarily because you don't learn anything except how to ask for help (sometimes not a bad thing to do either).   \n   \nIf your assignment is to find logos (or advertisements?) that use a certain list of typefaces, that is a bogus way to do it, but I'm not your instructor.   \n   \nIf the assignment is to identify 50 different typefaces used in ads, then you need a decent set of font samples (i.e. a good font book would be nice), and then start flipping through lots of magazines with plenty of advertising, like Fashion and Travel magazines.   \n   \nIf you were a real font fanatic, like some of us, you would already have had a folder of ads ripped from magazines with font names written on them.   \n   \nWelcome to the wild world of Font Spotting!\n\n"
    },
    {
      "time": " Wed, 2004-03-10 09:17",
      "content": "Thanks for the link and the Estee Lauder tip, I'll have to rummage thru my mothers make-up bag when she goes in to work... I'll definatly take a look at the link, I just needed a good start is all...\n\n"
    }
  ]
}
