{
  "id": "35283",
  "title": "Help with Thai script problem ?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello  \nI’m a regular poster on another board where we study Thai language.  \nThere is a problem for new learners in being able to display the  \nThai script in a larger size.  \n [http://www.thailandqa.com/forum/showthread.php?t=15033](http://web.archive.org/web/20080827132041/http:/www.thailandqa.com/forum/showthread.php?t=15033 \"http://www.thailandqa.com/forum/showthread.php?t=15033\")  \nFirefox has a work around for this, but for whatever reasons not all posters  \nare or are willing to use Firefox.  \nThere are many options for adjusting the view both within windows and IE, but  \nnone of these including personalized CSS (tools/internet options/accesibility)  \nare quite whats needed.  \nPosters on the forum YES can choose to alter the size of the script posted.  \nBut not all learners are at the same level. And learners cetrainly don’t want to be  \nrestricted to posts made larger for them.  \nPosts allso often contain both English and Thai and only the Thai needs to be enlarged.\n\nSo I’m wondering... Is it possible within designing a font, to pre-determine it’s display size to be considerably larger? I’m wondering if that is even a value that can  \nbe controled by designing a custom font?\n\nYour insights appreciated.  \nRick\n\n [‹ Wanted to share a nice en-grave-d font](http://web.archive.org/web/20080827132041/http:/www.typophile.com/node/36300 \"Go to previous forum topic\") [The New Typography - this was revolutionary? ›](http://web.archive.org/web/20080827132041/http:/www.typophile.com/node/36098 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080827132041/http://www.typophile.com/user/19757\" title=\"View user profile.\">whateverworks</a>",
  "time": "<br>",
  "uid": "19757",
  "comments": [
    {
      "time": " 19.Jul.2007 7.29pm",
      "content": "_Is it possible within designing a font, to pre-determine it’s display size to be considerably larger? I’m wondering if that is even a value that can be controled by designing a custom font?_\n\nWell... I’m not sure it works exactly that way. In font creation programs, the letters are drawn within a grid that is 1000 x 1000 units, and when you are ready to output the font files you decide which point sizes you want. But you can still make the font any size you want once you have set some text in a graphics or layout program...\n\n"
    },
    {
      "time": " 19.Jul.2007 10.29pm",
      "content": "Mr. Cordoba, thank you for your reply.\n\nI’m honestly getting a little excited, hopefully I don’t  \nmisconstrue or jump to impossible conclusions.\n\nWhen you say “1000 x 1000 units” I’m guessing this is the way font smiths measure the number pixells within a standardized space.\n\nAnd when you are saying “decide which point sizes you want”  \nI will understand this to be the varying sizes of text that are displayed as I adjust my font size in a cocument or can see when I open TTF files in C:\\WINDOWS\\Fonts with their poit sizes listed beside them.\n\nAnd then you finally said “make the font any size you want once you have set some text in a graphics or layout program...” Which I appreciate and understand, but unfortunately is not usefull for my immediate needs.\n\nWhat I’m hoping might be possible, is that when you “output” the Font files, are there whithin the TTF file actually several copies of varying “Point sizes” ?  \nIs it somehow possible while outputting the “Point sizes” to rename/reconfigure the values of them ?  \nWhat I mean is, is it possible to corrupt the file (of a custom build) so that a 48 point letter is labeled, and read as being an 18 point ?  \nI still haven’t convinced myself that i’m coherent in my meaning..... I wan’t the Thai text to display larger than the English. If the software is displaying the page at a given point size, could the Thai text come out larger ?\n\n(I’ve had an after thought, would that mean that the space between the lines would be over-run? Could I then Build 2 sets of fonts, and English and a Thai, The English one having exagerated blank space above/bellow the letters to compensate ?)\n\nAgain any insight is appreciated.\n\n"
    },
    {
      "time": " 20.Jul.2007 4.19pm",
      "content": "Ok .....  \nWhat about creating a single LARGE point size whitin a custom font ?\n\n"
    },
    {
      "time": " 21.Jul.2007 9.56pm",
      "content": "_What I mean is, is it possible to corrupt the file (of a custom build) so that a 48 point letter is labeled, and read as being an 18 point ?_\n\nI’m afraid that is way beyond my poor knowledge!\n\n"
    },
    {
      "time": " 21.Jul.2007 10.11pm",
      "content": "Thanks Ricardo, I appreciate you taking the time to consider the question.\n\n"
    },
    {
      "time": " 22.Jul.2007 4.52pm",
      "content": "Sure, no problem. My initial impression was that you would be able to fix this problem with the code for the website, but you already mentioned that CSS and other methods weren’t working.\n\nMaybe I missed something, but it seems to me that you should be able to program one font (for English) to show up in a certain size, and program the Thai font for a larger size than that.\n\n"
    },
    {
      "time": " 23.Jul.2007 3.19am",
      "content": "Thank you again for your post.  \nNow at least I know my babling was understood.  \nThe people running the board say they have run the  \ngamut trying to resolve the problem from the weboards  \nsoftware side. They have recently done an upgrade so,  \nit’s unlikely that change will come again for a while.\n\nI will learn more about fonts for a while, maybe make a  \nset of my own to appreciate what’s involved (not artisticaly  \nI can see in “Typograpy 110” there is great deal more than simply understanding, and my artistic side is undevoloped)  \nIf there is nothing there I will study the software of the web board for myself.  \n Ultimately there is FireFox, but that won’t help others on the board. And though the internet is a small fragment of the media that typography/caligraphy expresses itself, your likely still aware that IE for better or worse commands the lions share of the market.\n\n"
    },
    {
      "time": " 23.Jul.2007 8.51am",
      "content": "The TTF does not contain multiple sizes. The “1000 x 1000” is not a number of pixels, but of “em units” which do not have a fixed size. When you produce text at a certain size, it resizes the letters in the font to be the right size.\n\nYou \\*could\\* make a font where the Roman and Thai appear at different sizes, but you would need permission from the designer/publisher of the font, and all your users would need to download and install the font.\n\n"
    },
    {
      "time": " 26.Jul.2007 4.39am",
      "content": "Thank you “mr”.  \nI did a wikipedia search on “em Units” I think I have the jist of the idea.\n\nIt is not my intention to illegitimately use or otherwise copy the work of any designer/publisher. I do have friends who are artists. Though they are musicians I appreciate how much hard work and time artists put into their work only to have them stolen without credit or apreciation shown for their work.\n\nPermision (at a price if affordable) would be fine. If not I would have to explore how difficult it would be to make my own (which would involve buying software).\n\nThe idea that “all your users would need to download and install the font.” is ’Exactly’ what I’m after, that would leave it open to the individual to choose whether it improved the readability for themselves.\n\nIf you have some time, can you give me a bit of an idea of how I could proceed ? How much would it cost to have someone make such a font for me ? Would I need to produce a font set for both English and Thai ? Whom could I approach ?\n\nI’d really like to know how I could move forward with this, so any offerings are appreciated.  \nThank you  \nRick\n\n"
    },
    {
      "time": " 26.Jul.2007 8.31pm",
      "content": "_The TTF does not contain multiple sizes. The “1000 x 1000” is not a number of pixels, but of “em units” which do not have a fixed size. When you produce text at a certain size, it resizes the letters in the font to be the right size._\n\nThanks for pointing out these issues, Max. I’ve been crazy busy these days and didn’t have time to elaborate on my earlier comments.\n\n"
    },
    {
      "time": " 28.Jul.2007 2.03pm",
      "content": "“You \\*could\\* make a font where the Roman and Thai appear at different sizes, but you would need permission from the designer/publisher of the font, and all your users would need to download and install the font.”\n\nStill hoping hoping hoping, someone will give me a hint on how I could pursue such a font ?\n\n"
    },
    {
      "time": " 16.Aug.2007 2.38am",
      "content": "I can see one more problem:  \nIf you increase the size of some glyphs (letters), then you will have to increase the size of the em, which increases the line-spacing. So lines without any Thai letters will look very widely separated.\n\nOtherwise, it should be pretty simple.\n\nOnce you have permission from the owner of the font (the designer or publisher) —- alternatively use an open-source font, get a font-editing program. I would suggest FontForge ( [http://fontforge.sf.net](http://web.archive.org/web/20080827132041/http:/fontforge.sf.net/ \"http://fontforge.sf.net\")) if you’re using Linux or Mac (some people here don’t like it, but this is an easy enough job, and I’m a FontForge fan anyway). Using FontForge on windows is a bit more difficult.\n\nIf you choose FontForge:\n\nStart FontForge. Open the font you want to edit. Select the glyphs you want to resize. Choose Element-\\>Transformations-\\>Transform... Set the origin to “Glyph Origin”. In the drop-down box, change “Move” to “Scale Uniformly”, and adjust the number to, say, 200%. Click OK.\n\nChoose Element-\\>Font Info-\\>General. Adjust the “Em Size” by the same factor as you scaled the glyphs (if you chose 200%, double the em size, etc.). Click OK.\n\nChoose Generate-\\>Generate Fonts, change things as you see fit, and click Save.\n\nI hope that helps.\n\n"
    },
    {
      "time": " 20.Aug.2007 6.36pm",
      "content": "Thanks so much for taking the time to make that post mr’ .  \nI have looked at the software and I don’t think installation should be a problem. I have custom built PC for video edit and theres lots of room on the drives for that software. As well your post seems to make the task sound simple enough the way you provided a walk-through for me.\n\nI have 2 more questions if anyone has the time?\n\nSomeone recently messaged me saying  \n “As all those Fonts are available for free Download I assume that it is allowed to use them, but I am not sure so.”  \nIs that assumption a fair one ? Does this free distribution simply limit me to using it as is or am I allso permited to alter the font as I intend to ?\n\nSecond question; The spcecial requirements for displaying Thai text, is this problem software side only ? Or does it complicate the way in which the fonts are made  \n [http://www.fedu.uec.ac.jp/ZzzThai/thailang/index.html#problems](http://web.archive.org/web/20080827132041/http:/www.fedu.uec.ac.jp/ZzzThai/thailang/index.html#problems \"http://www.fedu.uec.ac.jp/ZzzThai/thailang/index.html#problems\")  \n i.e. is there more to creating a Thai font than I am understanding at this point ? Or are Glyphs just glyphs no matter the character set ?\n\nThanks again  \nRick\n\n"
    },
    {
      "time": " 21.Aug.2007 4.49am",
      "content": "Being allowed to use the font (and even distribute it) does NOT necessarily mean you are allowed to edit it. When you got the font, you should have got a licence with it (if you didn’t, it’s probably pirated in the first place).\n\nBut there are open source Thai fonts. These allow you to use, distribute and modify freely (they may or may not require you to pass on these rights on to the people you give/sell the font to). The Thai Linux Working Group and NECTEC has made several fonts (apparently of good quality) under the GPL (open source; you have to distribute modifications under the same licence). You can get them at  \n [http://www.ctan.org/tex-archive/fonts/thai/thaifonts-scalable/nectec/](http://web.archive.org/web/20080827132041/http:/www.ctan.org/tex-archive/fonts/thai/thaifonts-scalable/nectec/ \"http://www.ctan.org/tex-archive/fonts/thai/thaifonts-scalable/nectec/\") and [http://www.ctan.org/tex-archive/fonts/thai/thaifonts-scalable/tlwg/](http://web.archive.org/web/20080827132041/http:/www.ctan.org/tex-archive/fonts/thai/thaifonts-scalable/tlwg/ \"http://www.ctan.org/tex-archive/fonts/thai/thaifonts-scalable/tlwg/\") (these sites offer “.sfd” files, which can only be opened in FontForge).\n\nYes, the difficulties of Thai fonts affect type designers too, albeit in a different way. However, you should not be affected, as the font you choose should already have this done (if it is of decent quality).\n\n"
    }
  ]
}
