{
  "id": "35294",
  "title": "Modern Logotype - Analog Roots",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello everyone. This is my first post so I thought I'd share a piece I am working on. It will eventually be incorporated into a poster design. Just wanted to get some feedback.\n\n ![](http://web.archive.org/web/20111229205459im_/http:/typophile.com/files/MI004_AnologRoots_C1_WEBsmall_5038.jpg)\n\nHere is a version with an alternate \"g\". Any preference?\n\n ![](http://web.archive.org/web/20111229205459im_/http:/typophile.com/files/MI004_AnologRoots_C2_WEBsmall_5273.jpg)\n\n",
  "author": "<a href=\"/web/20111229205459/http://typophile.com/user/19768\" title=\"View user profile.\">Comma</a>",
  "time": "<br>",
  "uid": "19768",
  "comments": [
    {
      "time": "",
      "content": "Both 'g's look backwards to me. Perhaps you could snake the tail back and turn clockwise once it exits the bowl (if that makes sense). The 'n' seems a bit wide too. Otherwise, it's nice.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Top one looks better to me. 'S' looks a bit ackward. The downward curve looks misaligned. I also agree with 'n' being a tad bit to wide. Noticed all but one of the 'o's is not altered. The extra little 'swoosh' on the 'g' seems like it's trying to hard. It's like you have a lower case g and upper case g all in one.\n\nmg\n\n[www.holadesignstudio.com](http://web.archive.org/web/20111229205459/http:/www.holadesignstudio.com/ \"www.holadesignstudio.com\")\n\n"
    },
    {
      "time": "",
      "content": "Lots of action there and how does it read when driving by at 50 miles an hour?\n\n"
    },
    {
      "time": "",
      "content": "Can't say I know much about type but that's what I thought, \"hard to read\". Depends what the poster is and where it's getting shown.\n\n"
    },
    {
      "time": "",
      "content": "This is indeed hard to read. What I'd suggest is: \"n\" is definitelly too wide, \"s\" is too closed on top, I don't like the bottom \"n\" extender. Version 1 \"g\" is better but the horizontal line on the descender is strange. Why is it there anyway?\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the response. I haven't had time to work on it again since posting but I agree about the N's width and the S being too closed. The G was kind of an experiment. It just came out in the process and I thought I'd see how others felt. The \"hard to read\" factor will be part of the type being discovered amongst tree roots made of analog audio cables. When it's all said and done, I'll repost and see how it goes. Thanks!\n\n"
    }
  ]
}
