{
  "id": "35296",
  "title": "white on black text.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Good day everybody,\n\nA friend of mine forwarded me something saying that a black screen saves more energy, and if google were to have their main page as white on black, it would save ’750 mega watts/hour per year’.\n\nsee here: [http://www.blackle.com/](http://web.archive.org/web/20080705154246/http:/www.blackle.com/ \"http://www.blackle.com/\")\n\nI was wondering if anyone knows of any research regarding it being easier to read text on screen in white-on-black rather than black-on-white?\n\nTa\n\nGraham\n\n [‹ \"humanist sans\" - 1st use of label?](http://web.archive.org/web/20080705154246/http:/www.typophile.com/node/35213 \"Go to previous forum topic\") [Museum Fonts ›](http://web.archive.org/web/20080705154246/http:/www.typophile.com/node/35239 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080705154246/http://www.typophile.com/user/11280\" title=\"View user profile.\">G T</a>",
  "time": "<br>",
  "uid": "11280",
  "comments": [
    {
      "time": " 20.Jul.2007 2.58am",
      "content": "The energy savings would only occur on cathode ray tube monitors, and possibly plasma panels. LCD monitors are illuminated behind their entire matrix of what are essentially tiny shutters. In that case a black screen would use more energy, as power is required for each pixel to darken.\n\nText on paper is generally much harder to read reversed out (white on black) even when special measures are taken to make it less difficult. On-screen, the letters are backlit, so some problems such as ink gain are not an issue.\n\n"
    },
    {
      "time": " 20.Jul.2007 7.05am",
      "content": "If you recall back in the day, most monitors were amber or green. One color, green or amber type on black.\n\nI’m not sure at which point we decided to reverse the whole thing and go with mainly black text on white...it was likely around the 1984, I’m guessing ;o)\n\nI think the argument is that a medium-intensity color like amber or green on black is a nice contrast without causing eye strain.\n\nIf you do reverse out your text, do not use 100% intensity colors on black. White on black on screen can be very hard on the eyes. Consider something like 70% grey on black.\n\n"
    },
    {
      "time": " 20.Jul.2007 8.27am",
      "content": "<cite>Consider something like 70% grey on black.</cite>\n\nThat actually makes reading very difficult due to the low contrast, especially on low point sizes.\n\nGraham, I researched into this a while back, and on screen, white on black is easier to read. This is largely due to the illumination of white on screen that causes eye strain. Sometimes, though, it may seem harder to read white on black because we’re all generally used to reading black on white in print.\n\n"
    },
    {
      "time": " 20.Jul.2007 9.53am",
      "content": "\\>I’m not sure at which point we decided to reverse the whole thing and go with mainly black text on white...it was likely around the 1984, I’m guessing ;o)\n\nMaybe that’s why Greepeace is going after our friends down in Cupertino? Having said nthat surely the Parc guys are to blame?\n\n"
    },
    {
      "time": " 20.Jul.2007 10.54am",
      "content": "“That actually makes reading very difficult due to the low contrast, especially on low point sizes.”\n\nCrap. I meant 30% grey. Had my numbers reversed. Yea, 70% grey on black would be a nightmare to read. ;o)\n\nThe problem with white on black is that the contrast is just to high. You need to tone down the white just a tad to make it comfortable for most folks.\n\n"
    },
    {
      "time": " 20.Jul.2007 1.46pm",
      "content": "<cite>The problem with white on black is that the contrast is just to high. You need to tone down the white just a tad to make it comfortable for most folks.</cite>\n\nForgot to mention that I agree that the white should be toned down just a bit :)\n\n"
    }
  ]
}
