{
  "id": "35315",
  "title": "Teuerdank (1517)",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello Typophiles,\n\nMaybe this will sound silly for those of you who had the opportunity to get in touch with metal typesetting but...\n\nWhile reading Meggs’ “A History of Graphic Design”, on page 81 (3rd ed.), he describes the book _Teuerdank,_ printed by Johann Schönsperger with type designed by Vincenz Rockner in 1517. According to Meggs:\n\n<cite>Rockner carried this design quality</cite> [the quality of Rockner’s fraktur compared to Gutenberg’s textura] <cite>even further in a heroic effort to duplicate the gestural freedom of the pen. As many as eight alternate characters were designed and cast for each letterform. These had sweeping calligraphic flourishes, some of which flowed deep into the surrounding space. Other printers insisted that these ornamental letterforms had to be printed from woodblocks, for they refused to believe that it was possible to achieve these effects with cast metal types. (An inverted <em>i</em> in the 1517 edition, however, conclusively proves that metal types were used to print Teuerdank.)</cite>\n\nAfter reading this paragraph two questions came to my mind:\n\n1. If it wasn’t for the inverted _i,_ telling the difference from a woodblock print or a typeset ornament wouldn’t be possible? Isn’t it possible to tell the difference between these two techniques of printing just by looking at the printed piece? The thickness of ink, the irregularity of the shapes or something like that?\n\n2. How was it possible to set those flourishes in metal type? Were they a whole piece of metal or maybe divided into several smaller parts put together?\n\nIf you don’t have Meggs’ book nearby you can read about _Teuerdank_ and take a look at some pictures here: [http://special.lib.gla.ac.uk/exhibns/month/feb2005.html](http://web.archive.org/web/20070908172951/http:/special.lib.gla.ac.uk/exhibns/month/feb2005.html \"http://special.lib.gla.ac.uk/exhibns/month/feb2005.html\")\n\nAnyway, it’s impressive...\n\n| Attachment | Size |\n| --- | --- |\n| [teuerdank.jpg](http://web.archive.org/web/20070908172951/http:/typophile.com/files/teuerdank.jpg) | 65.58 KB |\n\n [‹ serif which will work well with Helvetica](http://web.archive.org/web/20070908172951/http:/www.typophile.com/node/21184 \"Go to previous forum topic\") [Looking for a Chocolate Type Font ›](http://web.archive.org/web/20070908172951/http:/www.typophile.com/node/35408 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070908172951/http://www.typophile.com/user/5681\" title=\"View user profile.\">rafael_lueder</a>",
  "time": "<br>",
  "uid": "5681",
  "comments": [
    {
      "time": " 20.Jul.2007 9.31pm",
      "content": "Man, do I _love_ Meggs’ book. I’ve been devouring every word and image; right now I’m up to the third to last chapter. I’ll have to go back to the beginning once I’m done.\n\nGetting back to reality, yes, Rockner’s stuff is really great, although I don’t recall it as vividly as some other images I saw.\n\n"
    },
    {
      "time": " 21.Jul.2007 2.59pm",
      "content": "I have seen and heard about both special clever cuts that allow kerning-like overlaps and puzzle style letters that allow for contextual alteration. So the answer to your question is yes.\n\nI am really interested in this kind of thing. Do the images shown at your linked URL show any other these flourishes?\n\n"
    },
    {
      "time": " 21.Jul.2007 5.48pm",
      "content": "All images from the linked URL are from the _Teuerdank_ book. The image with the caption “title” is especially interesting as some flourishes do not connect to the letters below them...\n\n"
    },
    {
      "time": " 21.Jul.2007 9.55pm",
      "content": "It is possible to double print a page and add the flourishes. Some of that stuff was cut in wood and some matrices were engraved for hand casting.\n\n"
    },
    {
      "time": " 25.Jul.2007 12.11am",
      "content": "Ah, okay. I see now. Thanks!\n\n"
    },
    {
      "time": " 25.Jul.2007 9.32am",
      "content": "If I had been printing this book, I would have had the flourishes added by hand, outsourcing the work to hard-up scribes who were casualties of the new media.\n\n"
    }
  ]
}
