{
  "id": "35311",
  "title": "Futura Pronunciation?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "How do you properly pronounce Futura? Is it like saying future with an a, like \"FEW-tra\"? Or is it like \"foo-TUR-a\"?\n\n",
  "author": "cosmorphis",
  "time": "20 Jul 2007 — 5:07pm",
  "uid": "13767",
  "comments": [
    {
      "time": "20 Jul 2007 — 5:25pm",
      "content": "Some suggest that you pronounce a typeface's name according to the orthography of the Designer's prefered language (I think that's what's going on with [all these](http://web.archive.org/web/20150315014931/http:/typophile.com/node/28051).) Renner was German, so by those rules it's probably more like your second interpretation. Beware that some people might think you a pedant for speaking like this. FYOO-tyur-uh or fyoo-TYUR-uh are perhaps more 'Merkan alternatives.\n\nAlso, Kabel: Cobble or Cable?\n\n"
    },
    {
      "time": "20 Jul 2007 — 9:34pm",
      "content": "“few-TUR-a” aka \"future\"-a\n\n"
    },
    {
      "time": "20 Jul 2007 — 8:54pm",
      "content": "[FAQ Pronunciation](http://web.archive.org/web/20150315014931/http:/typophile.com/wiki/FAQ%20Pronunciation)\n\n"
    },
    {
      "time": "20 Jul 2007 — 10:48pm",
      "content": "foo-TOOR-ah is how most of the Adobe and Linotype folks seem to pronounce it - in the good German style.\n\n"
    },
    {
      "time": "21 Jul 2007 — 2:19am",
      "content": "My take: To pronounce it correctly in German you not only have to do as Thomas indicates, but also do a guttural or rolled 'r'. Doing the full German pronunciation when speaking English I think will sound forced, unless you are from a German speaking country.\n\nSo I think pronouncing it either a more English way, as evilfansanfan has it, or halfway German with both 'u's having an 'oo' sound, is fine.\n\n"
    },
    {
      "time": "21 Jul 2007 — 2:28am",
      "content": "So it's not \"fyoo-CHEW-ra\"?\n\n"
    },
    {
      "time": "21 Jul 2007 — 4:34am",
      "content": "Thomas+William=✓  \nThen, it’s latin anyway … the German word would be _Zukunft_. In French it’s l’ [avenir](http://web.archive.org/web/20150315014931/http:/typophile.com/wiki/avenir). (Is there a font called Zukunft? And what, in grammatical terms, is ‘Avenir Next’? The opposite of Past Perfect?) :°)\n\n"
    },
    {
      "time": "21 Jul 2007 — 5:11am",
      "content": "Constantly recurring discussion. Why don't we all just pronounce these exotic names in such a way that at least our compatriots understand what’s meant?  \nI don't pretend to know how Bejing sounds in Mandarin, so I don’t even try to do that.\n\n(But Futura is pronounced with shorter vowels than the ones in most of the suggestions above… ; ). Foot-tour-ah, with oo and ou compressed and the h halfswallowed. — Hey, German is my second language, having two german greatgrandparents.)\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "21 Jul 2007 — 5:24am",
      "content": "The exact pronunciation in unequivocal IPA symbols is show here:\n\n[http://www.sanskritweb.net/temporary/futura.gif](http://web.archive.org/web/20150315014931/http:/www.sanskritweb.net/temporary/futura.gif \"http://www.sanskritweb.net/temporary/futura.gif\")\n\nThe font name \"Futura\" is not of German origin, but is derived from the female-gender form \"futura\" of the Latin adjective \"futurus, futura, futurum\". This is because all Latin font names have female gender, i.e. \"futura\" is short for Latin \"littera futura\" or \"litera futura\" denoting \"the future letter, the coming type(face)\".\n\n"
    }
  ]
}
