{
  "id": "35328",
  "title": "New logo work (aviation)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm working on an aviation startup logo. The name is as it says. I had a nice idea and made some pretty sketch. Your opinions would be much appreciated.\n\n ![](http://web.archive.org/web/20130818063200im_/http:/typophile.com/files/sky1_5687.jpg)\n\nDon't forget to check the PDF too. :) Thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [SkyLark Logo.pdf](http://web.archive.org/web/20130818063200/http:/typophile.com/files/SkyLark%20Logo_0.pdf) | 613.58 KB |\n\n",
  "author": "litera",
  "time": "21 Jul 2007 — 12:25pm",
  "uid": "18888",
  "comments": [
    {
      "time": "21 Jul 2007 — 2:05pm",
      "content": "nice\n\nis it just me or could the 'S' be kerned more tightly?\n\n"
    },
    {
      "time": "21 Jul 2007 — 9:06pm",
      "content": "I agree -- nice job. Few things: 1) Trajan is a bit overused, although it works well enough here (unless this is a different Trajan than Adobe's). I don't have any suggestions for a particular reason, but it seems to me that something with tension in it's letterforms might be good: [FF Legato](http://web.archive.org/web/20130818063200/http:/www.myfonts.com/fonts/fontfont/ff-legato), [FF Avance](http://web.archive.org/web/20130818063200/http:/www.myfonts.com/fonts/fontfont/ff-avance), [Sebastian](http://web.archive.org/web/20130818063200/http:/www.myfonts.com/fonts/storm/sebastian), and [Prensa](http://web.archive.org/web/20130818063200/http:/www.myfonts.com/fonts/fontbureau/prensa). EDIT: [Shaker](http://web.archive.org/web/20130818063200/http:/www.typography.net/type/shaker.htm) and [Enigma](http://web.archive.org/web/20130818063200/http:/www.typography.net/type/enigma.htm) go here too.\n\n2) The S is too loose, and I'd kern a bit tighter between the Y and L.\n\n3) I like that you didn't track the \"aviation and training\" to the full width of \"SkyLark,\" but I find it distracting that it lines up so neatly to the end of the R. I'd either line it up with the end of \"SkyLark\" or make it end somewhere in the middle of a letter.\n\n"
    },
    {
      "time": "21 Jul 2007 — 9:29pm",
      "content": "I feel that the small cap height is to large. About 70% of cap height mike work better. Part of the retention process of which is the essence of a good logo, is the identity to shape. Logos that tend to be more of an illustration are more difficult to work with. Your design is appealing, but how does it work in b/w?\n\n"
    },
    {
      "time": "22 Jul 2007 — 12:32am",
      "content": "I told you all to check the PDF too, because there's also a BW and a small size BW version of a logo as well as a variation of it on the negative space. Please check that too.\n\nBut otherwise, thanks for all the opinions so far.\n\nOne more thing: I find this logo pretty much a great and straightforward idea with a bird casting plane shadow, but. I have to make it work applicable on plane's tail too... I know I can just use the lark for it, but what do you think?\n\n"
    },
    {
      "time": "22 Jul 2007 — 2:36am",
      "content": "There is some refinement required on the illustration, the wings appear a slightly different angle to the body and not symmetric. The reversed out version is a bit moth-like, it might be nice to continue the grad through the lettering. I would consider a different sans it seems a bit heavy next to Trajan. How are you applying the tailfin mark –&nbsp;vinyl, painted on –&nbsp;can it have halftone?\n\nTim\n\n"
    },
    {
      "time": "22 Jul 2007 — 3:02am",
      "content": "_the wings appear a slightly different angle to the body and not symmetric._\n\nThat doesn't bother me, because it reinforces the fact that the shadow is not the bird's per se. Larks don't have swept-back wings, but most modern airliners usually do (unless you want it to cast the shadow of a DC3).\n\n"
    },
    {
      "time": "22 Jul 2007 — 3:10am",
      "content": "Sorry I wasn’t clear, I meant the wings on the bird not a comparison between the two.\n\nTim\n\n"
    },
    {
      "time": "22 Jul 2007 — 3:35am",
      "content": "The lark itself has been stylized over a real life photo, so I wing angles and body symmetry should be second to perfect. Real life.\n\nI had the same problem when I first looked at it, but after looking at it for a while you get to feel it's natural...\n\n"
    },
    {
      "time": "22 Jul 2007 — 5:51am",
      "content": "In the process of stylising you have created an illustration, and you should be aware that I and any other audience will not have the benefit of a photograph, the left wing is clearly not a pair to the right wing and the wings are not at a right angle to the body. Unfortunately photographs are not real life, they suffer from all kinds of distortions and this is a further distortion – it is an accepted technique to work from photographs but there comes a time when you have to view it as a stylised illustration and as such it is no longer a genuine representation, it needn’t be a huge job to alter I would suggest you try it. By the way, skylark is one word and doesn’t need the L capitalised.\n\nTim\n\n"
    },
    {
      "time": "22 Jul 2007 — 8:45am",
      "content": "The top one in the PDF is very appealing but the bottom one in blue would be easier to manage. You mentioned it being applied to a plane...\n\n"
    },
    {
      "time": "22 Jul 2007 — 7:11pm",
      "content": "i agree with the bottom sans being a bit heavy for Trajan and also the uppercase 'L' should be lowercase.\n\n"
    },
    {
      "time": "23 Jul 2007 — 10:10am",
      "content": "Hey Litera, nice illustration. A few comments.\n\nColor version: I feel the plane shadow might be redundant and busy. 'S' needs to be tightened. 'aviation and training' looks pretty good to me. I might see what it looks like right justified.\n\nGradient Color version: I actually really like this approach. Very clean and great used of color and space. My favorite by far.\n\nBlack/White: Clean and simple. Illustration should reproduce nicely.\n\n[www.holadesignstudio.com](http://web.archive.org/web/20130818063200/http:/www.holadesignstudio.com/ \"www.holadesignstudio.com\")\n\n"
    },
    {
      "time": "23 Jul 2007 — 8:49pm",
      "content": "B/W version falls apart. Symbology and type should connect as a unit.\n\n"
    },
    {
      "time": "24 Jul 2007 — 12:45am",
      "content": "Hi everyone, I like very much your logo, but i would try using [Aviano](http://web.archive.org/web/20130818063200/http:/www.myfonts.com/fonts/dooleytype/aviano/) from Insigne for at least three reasons:  \n1 - as suggested at the bottom of the page \"Use Aviano as an alternative to Trajan\";  \n2 - it seems to be designed just for your logo;  \n3 - it's cheap.  \nBye...\n\n"
    },
    {
      "time": "24 Jul 2007 — 1:32am",
      "content": "Aviano is actually Italy's NATO air base... :) Not a coincidence... :) I guess that the wide letter shape makes it strong.\n\n"
    },
    {
      "time": "24 Jul 2007 — 1:34am",
      "content": "I think this design is too busy looking. The 4 elements don't tie together for me. And they compete for dominance to too great a degree. Something needs to be clearly primary.\n\nKeep working on it.\n\n"
    },
    {
      "time": "24 Jul 2007 — 3:48am",
      "content": "Nice work, if no one else said. I think the S needs more weight and I would lengthen it's serifs and widen it all, very slightly  \nCheers!\n\n"
    },
    {
      "time": "25 Jul 2007 — 9:42am",
      "content": "I'm with Eben on this. My eyes seem conflicted. I want to look at the word mark, but the bird is beautiful and pulls my eyes up away from the word mark. Then the shadow is clever, but ultimately is the biggest distraction because it's so out of focus and light, my eyes fight to focus on it more.  \nand the \"aviation and training feel tacked on, running into the shadow.\n\nThe elements of the logo are strong, you have a great stepping stone, but it's needs refined so the parts work in unison. You have a lot of artistic elements, which maybe be \"over flavoring\" the work.\n\nAlso, I tend to agree with Tim in the refinement of the stylized illustration. If your image was more \"realistic\" in nature, I wouldn't argue, but since the image has been striped down to the bare essentials to infer a skylark, precision takes precedence.\n\nYou're very close, it's an excellent design and you should strive to make it as perfect as possible.\n\n"
    },
    {
      "time": "25 Jul 2007 — 9:54am",
      "content": "Clever interpretation of an old idea.\n\n- I like the color variation, however the shadow isn't convincing for me yet. Also the shadow needs to be cooled down it is too warm.  \n- I really like the 1/2 color version the best.  \n- The word 'Skylark' holds together in the 2 black only version, but the SK pair is too loose in the other two.  \n- Maybe the shadow needs to either overlap the text more or not at all?\n\n"
    },
    {
      "time": "25 Jul 2007 — 12:16pm",
      "content": "\"I think this design is too busy looking.\"\n\nI agree. As I mentioned on logopond, while I think the shadow-as-a-plane is a good idea, it's not needed. The logo works just fine without it.\n\n"
    },
    {
      "time": "26 Jul 2007 — 2:21am",
      "content": "I like the lark. The wings do seem like they are not aligned right with eachother.\n\nI agree with the others that the shadow of a plane is not needed, works just fine without.\n\nNot entierly convinced about the type for Skylark but I like the type for aviation and training.\n\nOtherwise I think it's fantastic.\n\npeter\n\n"
    }
  ]
}
