{
  "id": "3532",
  "title": "(x) more Rolling Stone type - Rialto, FB Hightower {Mike Y, Eric}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "I was looking through an old RS from 2001 and came across these gorgeous fonts. I did a search on all the old \"Rolling Stone\" fonts so I don't think this was covered before. If it was forgive me. Here's a sample. The type in question is the calligraphically inspired typeface that's used in an italic (?) and in all caps. I've also included a sample of their text face. This looks like FB's Parkinson but I wanted to be sure. I sincerely hope this is not custom. They're gorgeous. Thanks for the help.   \n   \n ![](http://web.archive.org/web/20130722194033im_/http:/www.typophile.com/forums/messages/83/28295.jpg)\n\n",
  "author": "James Gareth",
  "time": "10 Mar 2004 — 9:35am",
  "uid": "1797",
  "comments": [
    {
      "time": "10 Mar 2004 — 9:40am",
      "content": "It's \"Rialto\" by Giovanni de Faccio & Lui Karner from dftype. Mark ID'd this not too long ago in another thread, and included links, I believe.\n\n"
    },
    {
      "time": "10 Mar 2004 — 10:42am",
      "content": "The text face is TFJ's FB Hightower\n\n"
    },
    {
      "time": "10 Mar 2004 — 11:12am",
      "content": "Thanks a great deal guys. I saw Mark ID Rialto a while back but didn't connect the two. (Shakes head). One thing's for sure, it's gorgeous. Now to try to find out how to buy it. ![:-)](http://web.archive.org/web/20130722194033im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "10 Mar 2004 — 10:09pm",
      "content": "I\n\n"
    },
    {
      "time": "11 Mar 2004 — 5:12am",
      "content": "[Here is a link](http://web.archive.org/web/20130722194033/http:/www.druckschriften.de/Druckschriften2/Typo-Top-100/Schriften/df-type/df-type.html) that includes an e-mail address for dfType, which is in Austria.   \n   \nIt turns out this is the same link Mark gave, although I didn't realize that until I hunted up the [previous thread about Rialto](http://web.archive.org/web/20130722194033/http:/www.typophile.com/forums/messages/83/26918.html).   \n   \nMark said he didn't think they have a web site. I couldn't find one either.\n\n"
    },
    {
      "time": "11 Mar 2004 — 8:57am",
      "content": "Has anyone purchased this? I've emailed them and heard nothing back. I've heard rumors, though, it costs as much as 580 Euros. This is a beautiful typeface but isn't that a bit much for 4 fonts?\n\n"
    },
    {
      "time": "18 Sep 2005 — 4:43pm",
      "content": "Just for the record, the Rialto everyone here is talking about is called (in the Type 1 file) RialtoDF?\n\nIs this the same font that James Gareth is referring to in the Rolling Stones article?\n\n"
    },
    {
      "time": "21 Sep 2005 — 6:59pm",
      "content": "Ja.\n\n"
    },
    {
      "time": "10 Mar 2004 — 4:16pm",
      "content": "Eric's right on the text. RS has always been fond of venetians,   \neven under different ADs. Woodward used a [Schneidler](http://web.archive.org/web/20130722194033/http:/www.myfonts.com/fonts/linotype/stempel-schneidler/medium/testdrive.html?s=Talking%20Heads%20are%20the%20greatest%20band%20ever.&p=24&refby=typographica) for most   \nof the '90s, I believe.\n\n"
    },
    {
      "time": "11 Mar 2004 — 1:23pm",
      "content": "That's A LOT for a family of 4 fonts...\n\n"
    }
  ]
}
