{
  "id": "35339",
  "title": "Alternative/different name for OPTIFonts 'Eton'?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hiya, long time no see.  \nI recently had a font identified for me at myfonts, and someone came to the conclusion that it would have to be Castcraft/OPTIFonts' Eton. Now, first of all, I've been doing some research on this OPTIFonts and people on forums like these doesn't hold them in such a high regard, eh? ;)\n\nWell, I'm with you. The website is just an outrage, because I can't reach their font catalogue and see if this Eton is the actual font I'm looking for. So now I turn to you guys & gals. Here's the text sample:  \n [http://wtf.myfonts.com/images/4b/4baaa9e85b5ddbeb9fedba44e12035d6.43347....](http://web.archive.org/web/20150321005236/http:/wtf.myfonts.com/images/4b/4baaa9e85b5ddbeb9fedba44e12035d6.43347.jpeg \"http://wtf.myfonts.com/images/4b/4baaa9e85b5ddbeb9fedba44e12035d6.43347.jpeg\")  \nBefore the OPTIFonts information someone mentioned it was originally issued by VGC (Visual Graphics Corporation, [http://cg.scs.carleton.ca/~luc/vgc-typefaces.html](http://web.archive.org/web/20150321005236/http:/cg.scs.carleton.ca/~luc/vgc-typefaces.html \"http://cg.scs.carleton.ca/~luc/vgc-typefaces.html\")) as Wexford Medium and later on digitalized by the dreaded OPTIFonts, if this is to any help.\n\nAny ideas? If you need more samples, I can get a hold of them for you, but they'll be relatively small. Thanks in advance!\n\n",
  "author": "Pico",
  "time": "22 Jul 2007 — 3:52am",
  "uid": "18136",
  "comments": [
    {
      "time": "22 Jul 2007 — 4:09am",
      "content": "Running a search for Wexford on typophile I got this: [‘Wexford - not available as digital font’](http://web.archive.org/web/20150321005236/http:/typophile.com/node/7199).\n\n"
    },
    {
      "time": "22 Jul 2007 — 4:27am",
      "content": "Alright, fair enough. Now all we need is a sample of Eton (not the 2001 Fontware Limited Futura ripoff, mind you) and this case is a-closed.\n\n"
    },
    {
      "time": "22 Jul 2007 — 7:51am",
      "content": "I can at least confirm the Wexford Medium ID for the original. There is a sample of it in the Phil's Photo 'Homage to the Alphabet' book of film types. There is a sample of the Extra Bold version, scanned from the same book, in my [Bauhaus-Style Font ID Guide](http://web.archive.org/web/20150321005236/http:/bowfinprintworks.com/BauhausFaces1.html), Part 1, on the left side, about the middle of the page.\n\nI have collected quite a bit of material about the Opti Fonts, including a list of fonts and their equivalents, but Opti Eton is not listed or shown in anything I have collected.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "22 Jul 2007 — 7:55am",
      "content": "I can at least confirm the Wexford Medium ID for the original. There is a sample of it in the Phil's Photo 'Homage to the Alphabet' book of film types. There is a sample of the Extra Bold version, scanned from the same book, in my [Bauhaus-Style Font ID Guide](http://web.archive.org/web/20150321005236/http:/bowfinprintworks.com/BauhausFaces1.html), Part 1, on the left side, about the middle of the page.\n\nI have collected quite a bit of material about the Opti Fonts, including a list of fonts and their equivalents, but Opti Eton is not listed or shown in anything I have collected.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "22 Jul 2007 — 4:34pm",
      "content": "Hm, looks like a losing game to me. Strange though, I see no reason why philippe2, a seemingly very active and helpful user, would either lie or mix the Fontware Limited up with OPTIFonts in some way.\n\nOh well, perhaps we'll see it in the future. Are there any fonts similiar to Wexford (Medium)? Like Banjoman, Blippo, Argentica or Bernhard Gothic from that page bowpinpw provided.\n\n"
    },
    {
      "time": "23 Jul 2007 — 8:42am",
      "content": "A number of those you mentioned from the Bauhaus guide are available in digital form, like [Banjoman](http://web.archive.org/web/20150321005236/http:/www.myfonts.com/fonts/linotype/banjoman/), [Blippo](http://web.archive.org/web/20150321005236/http:/www.myfonts.com/fonts/linotype/blippo-lt/), [Pump](http://web.archive.org/web/20150321005236/http:/www.myfonts.com/fonts/linotype/pump-lt/), [Bauhaus](http://web.archive.org/web/20150321005236/http:/www.myfonts.com/fonts/linotype/itc-bauhaus/) and [Ronda](http://web.archive.org/web/20150321005236/http:/www.myfonts.com/fonts/linotype/itc-ronda/), as well as [House Chalet](http://web.archive.org/web/20150321005236/http:/www.houseind.com/index.php?page=showfont&id=4&subpage=viewfonts), which is like a Bauhaus-style assortment.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "23 Jul 2007 — 8:45am",
      "content": "By the way, I wasn't saying that there isn't an Opti Eton, just that it's not one I have any information about, and have not seen listed before.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "29 Mar 2011 — 12:21pm",
      "content": "bowfinpw, If you are an expert in Opti fonts, then you may be able to help me.\n\nI'm looking for a font which I believe to be called Opti Schow Light. I have scoured the web though, and have had no luck in finding anything. Do you know of the existence of such a font? Do you have any idea where I may be able to obtain it? If not do you know of an equivalent?\n\nThanks so much in advance!\n\n"
    },
    {
      "time": "30 Mar 2011 — 6:14am",
      "content": "It would be easier to answer if you posted a sample image of the typeface you are looking for.\n\n"
    },
    {
      "time": "3 Apr 2011 — 5:55pm",
      "content": "OK, I found another forum online where someone else was looking for this same font, in that thread ( [http://new.myfonts.com/WhatTheFont/forum/case/27578/](http://web.archive.org/web/20150321005236/http:/new.myfonts.com/WhatTheFont/forum/case/27578/ \"http://new.myfonts.com/WhatTheFont/forum/case/27578/\")) they determined that the name of the font is in fact Schow Light by OPTIFonts.\n\nDoes anyone know where I might be able to find this font?\n\nI've searched all over for both OPTIFonts and CastCraft who I believe owned them at one point, but I have been unable to find a working website for either of them. It's almost as though both companies have disappeared. Any ideas???\n\nThanks\n\n"
    },
    {
      "time": "25 Apr 2011 — 6:59am",
      "content": "From what I understand Castcraft/Opti is defunct. I know from my past days IDing fonts at alt.binaries.fonts that there were copies of Opti fonts being circulated, but the RIGHT way to go about it is to find out the true identity for the font and find a legal version. Almost nothing offered by Opti was original, and most are available from other sources by other names.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "25 Apr 2011 — 7:12am",
      "content": "I just looked at the old WTF forum post, and that typeface was also available by the name of \"Shonnen\" in the Expresiv Ornate collection (which I have). See, it helps to have a picture.\n\nHere is a sample I just made with the font.\n\nBTW, the original post was about Wexford, and Harold Lohner has revived it as Wexley, I believe.\n\n- Mike Yanega\n\n ![](http://web.archive.org/web/20150321005236im_/http:/typophile.com/files/Shonnen_Schow_sample_4381.gif)\n\n"
    }
  ]
}
