{
  "id": "35343",
  "title": "Starting out - Freelance",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello,\n\nI am a graphic design college student, going into my senior year for my BFA in the fall. Just recently, I have started my first freelance job, but I feel like a lost puppy. I do not have a logo put together yet (it’s a work in progress), and I have several questions with not many people to help answer.\n\nMy question is - what are some good books out there (reasonably priced, no more than $40) that I can grab at a local bookstore that gives me tips and a guide on how to start out freelance graphic design? Certain topics that come to my mind that I would like answers for would be hourly rates, coming up with invoices, printing, etc.\n\nMuch help appreciated- thank you!  \n-Melissa\n\n [‹ Essential Typefaces](http://web.archive.org/web/20071214062019/http:/www.typophile.com/node/35173 \"Go to previous forum topic\") [The Real Thing finally getting real again. ›](http://web.archive.org/web/20071214062019/http:/www.typophile.com/node/35475 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071214062019/http://www.typophile.com/user/14887\" title=\"View user profile.\">blueanxiety</a>",
  "time": "<br>",
  "uid": "14887",
  "comments": [
    {
      "time": " 22.Jul.2007 10.04am",
      "content": "The best resource I can suggest for you is:  \n [http://gag.org/pegs/index.php](http://web.archive.org/web/20071214062019/http:/gag.org/pegs/index.php \"http://gag.org/pegs/index.php\")\n\n ![](http://web.archive.org/web/20071214062019im_/http:/www.typophile.com/files/pegs2001_5798.gif)\n\nThe Graphic Artist Guild’s Pricing and Ethical Guidelines.\n\nIt’s full of great advice, sample contracts, legal standards you need to be aware of... lots and lots of info.\n\nGood luck!\n\n"
    },
    {
      "time": " 22.Jul.2007 3.18pm",
      "content": "This one:  \n [http://www.amazon.com/Graphic-Designer-Without-Losing-Your/dp/1568985592](http://web.archive.org/web/20071214062019/http:/www.amazon.com/Graphic-Designer-Without-Losing-Your/dp/1568985592 \"http://www.amazon.com/Graphic-Designer-Without-Losing-Your/dp/1568985592\")  \nby Adrian Shaughnessy costs 14$ and is worth every cent spent on it. I engoyed reading mself when thinking about starting out as a freelancer. I’ve never gave up, just looking for a good chance. :)\n\nGood luck!\n\n"
    },
    {
      "time": " 22.Jul.2007 7.30pm",
      "content": "Melissa,\n\nBooks may help you in the short term. but freelance graphic design is no place for the inexperienced. Get a job somewhere and learn about the business. After a few years maybe freelance will be an option, but not right out of college.\n\n"
    },
    {
      "time": " 22.Jul.2007 8.39pm",
      "content": "Melissa, James makes a very good point. You will learn so much working for a studio, say, or an agency, or at a magazine (to name but three options).\n\nThat said, a logo is not something you absolutely must have when starting out... A well-designed typographic card and letterhead might be enough. But ultimately that is up to you.\n\nAs for books, beside the ones already mentioned, you might want to check out...\n\n[**_Starting Your Career as a Freelance Illustrator or Graphic Designer_**](http://web.archive.org/web/20071214062019/http:/www.amazon.com/Starting-Freelance-Illustrator-Graphic-Designer/dp/1581151993/ref=pd_bbs_sr_1/105-4304836-8465243?ie=UTF8&s=books&qid=1185161700&sr=1-1), by Michael Fleishman\n\n[**_Talent Is Not Enough: Business Secrets for Designers_**](http://web.archive.org/web/20071214062019/http:/www.amazon.com/Talent-Not-Enough-Business-Designers/dp/0321278798/ref=pd_bbs_1/105-4304836-8465243?ie=UTF8&s=books&sr=1-1), by Shel Perkins\n\n[**_Careers by Design: A Business Guide for Graphic Designers_**](http://web.archive.org/web/20071214062019/http:/www.amazon.com/Careers-Design-Business-Graphic-Designers/dp/1581152051/ref=sr_1_3/105-4304836-8465243?ie=UTF8&s=books&qid=1185161166&sr=1-3), by Roz Goldfarb\n\nLast but not least, don’t forget your local public library as a source of good design books. :-)\n\nBest of luck!\n\n"
    },
    {
      "time": " 23.Jul.2007 8.54pm",
      "content": "I second James’s advice. It’s going to be awfully hard to establish a successful freelance design business with no real work experience. I recommend you figure out what sort of design work interests you most and try to a job in that field for at least a few years before you strike out on your own. You can try to do some freelance work on the side both to broaden your portfolio and to try to line up some clients for when you’re ready to launch your own business.\n\n"
    },
    {
      "time": " 23.Jul.2007 9.31pm",
      "content": "i started out — fresh from school — as a freelancer. it was hard work, but i think you really have to have the temperment for it. one example: no matter how hard you’re working, and how much work is coming in, you never really feel like you’re off the clock. you’re watching a movie, and there’s a nagging feeling you should be making those calls or checking those invoices...\n\nanyway, i don’t think i would have made it if i had known any better. but i didn’t know anything, and i was able to pull it off. with any sense, i would have been scared witless.\n\nreminds me of an episode of “gilligan’s island”... gilligan made a pair of wings from some feathers, straps them on and starts flying over the huts. the skipper sees him and yells, “what’re you doing? you can’t fly!” “i can’t?” says gilligan, and he falls to the ground.\n\n"
    },
    {
      "time": " 24.Jul.2007 9.42am",
      "content": "Well, you can start out as a freelancer, of course. The point others are making (which I agree with) is that you are only partially baked when you come out of school, and you have to have a few years experience working to be fully done. Now you can get those years as a freelancer, but is it a service to your customers to pay you to learn?\n\nAnd when you work with someone with more experience, you don’t have to make the same expensive mistakes. Your cohort can explain why something won’t work, and save you the aggravation (and expense, if you are freelance) of making a major error.\n\nSo, while you can start as a freelancer, it makes a lot more sense to get a few years under your belt before you go on your own.\n\n"
    },
    {
      "time": " 24.Jul.2007 9.49am",
      "content": "_it makes a lot more sense to get a few years under your belt before you go on your own._ absolutely! it was incredibly hard and incredibly stressful!  \nbut it can be done.\n\n_is it a service to your customers to pay you to learn?_    \nwell, that’s happening in any case. actually, it’s probably happening in EVERY case.\n\nalso, i’m not sure that melissa was saying she just wants to freelance (as opposed to finding a staff position somewhere), just that she was doing her FIRST freelance assignment, and wanted some business advice. some of which, as others stated, might include “work for someone else for a while.”\n\n"
    },
    {
      "time": " 26.Jul.2007 4.23pm",
      "content": "Thank you all for your responses!\n\nI may have confused some people - I am NOT thinking about becoming a full time freelancer straight out of school, as some others have mentioned. As Chuck was saying, I am just doing this on the side. I am interning now at a newspaper company working on several advertisements - and it just so happened that a partner from the newspaper company decided asked me to work on an ad that would not be related to my newspaper ads.\n\nBut thinking that I will probably be doing more freelance jobs in the future, whether it be when I am still in school or working in the industry full-time, I’m just trying to get a head start to know the many aspects of freelancing.\n\nThe books are for short-term reading, and hopefully long-term reading. I’ve already picked up the Graphic Art’s Guild Pricing & Ehthical Guidelines book from my local library.\n\n"
    },
    {
      "time": " 26.Jul.2007 8.10pm",
      "content": "One more book, then (it hasn’t seen a new edition in a while, but it’s still useful): [**_The Designer’s Commonsense Business Book_**](http://web.archive.org/web/20071214062019/http:/www.amazon.com/Designers-Commonsense-Business-Book/dp/089134618X/ref=sr_1_5/104-9116841-9191967?ie=UTF8&s=books&qid=1185505573&sr=1-5), by Barbara Ganim. Lots of good tips, plus sample forms galore.\n\n"
    },
    {
      "time": " 27.Jul.2007 11.18am",
      "content": "melissa—  \nagain, good luck, and i hope the experience is wonderful.\n\n"
    },
    {
      "time": " 27.Jul.2007 12.47pm",
      "content": "Don’t _just_ get a job, make sure you get a job where they will involve you in the business side.\n\n"
    },
    {
      "time": " 27.Jul.2007 8.24pm",
      "content": "Can you elaborate on that, Tiffany? I am curious.\n\n"
    },
    {
      "time": " 29.Jul.2007 8.50pm",
      "content": "I’m just saying that there are many studios that won’t involve junior staff in the business side. Sure, you might attend some meetings, that is a plus, but you don’t see or get to understand the billing which really is just as important as creative if you want to make a living in design.\n\n"
    },
    {
      "time": " 29.Jul.2007 10.53pm",
      "content": "Okay, I getcha. Thanks.\n\n"
    },
    {
      "time": " 30.Jul.2007 6.56pm",
      "content": "<cite>the billing which really is just as important as creative if you want to make a living in design.</cite>\n\nI don’t agree, sorry. I think your priority should be learning skills at a studio or company that does work that you admire, and hopefully pick up some good portfolio pieces. Making good connections is also very important.\n\nThe business side is just not that hard to learn and if you put yourself in a good position, through your talent and your contacts, you’ll figure it out as you go along. It can also vary widely depending on what kind of design you want to do. More than billing, I’d say it’s important to learn what clients expect and how to deal with them.\n\nBut I’d make my first priority trying to get a foot in the door at a place you think you could do good work.\n\n"
    }
  ]
}
