{
  "id": "35340",
  "title": "khatt kufi & kaffiya",
  "forum": "huda.abifares's blog",
  "tags": [

  ],
  "content": " **The Khatt Foundation Symposium on Arabic Visual Culture**  \n**24 August 2007, Amsterdam**\n\n ![](http://web.archive.org/web/20110818115020im_/http:/typophile.com/files/khkuka-logo_6023.jpg)\n\nThe Khatt foundation in collaboration with Mediamatic will host a full day of lectures, presentations and celebration of new Arabic cultural expression.\n\nThe day events will include:  \n- [the one-day symposium](http://web.archive.org/web/20110818115020/http:/www.khtt.net/artefact-415-en.html)  \n- [the launch of 5 new Arabic typefaces](http://web.archive.org/web/20110818115020/http:/www.khtt.net/artefact-106-en.html)  \n- [the Typographic Matchmaking book](http://web.archive.org/web/20110818115020/http:/www.khtt.net/article-266-en.html)  \n- the international online community, [the Khatt Network for Arabic Typography](http://web.archive.org/web/20110818115020/http:/www.khtt.net/)  \n- [the El-Hema Exhibition](http://web.archive.org/web/20110818115020/http:/www.mediamatic.net/artefact-18263-en.html)  \n- workshops  \n- the El-Hema design competition\n\n**The aim of this symposium is to discuss the positive role of design and typography in Arabic youth culture, how it can generate positive perceptions and productive collaborations that bridge the gap between Eastern and Western cultures.**\n\n**Speakers**\n\nA selection of scholars and designers from the Middle East, the US and Europe will discuss the impact of historical and contemporary visual culture on Arabic identity. New forms of visual expression, such as new Arabic typefaces, and other cross-cultural design experiments will be the focus of the symposium. The symposium will introduce the Khatt Foundations’ collaborative pilot design project [Typographic Matchmaking](http://web.archive.org/web/20110818115020/http:/www.khtt.net/artefact-106-en.html). Among other topics the symposium will cover topics that vary from history of European printing of Arabic books, to expressive calligraphy, to the relation of typography and dance, to the relation between culture and technological advancement in the printing arts, to political activism through visual communication in the Middle East, to case studies of inter-cultural design project between Dutch designer and Arab institutions (or designers), and statistical information about the visual arts, design, new media and typographic expression in the Arab world.\n\nThe symposium’s speakers:  \n- Huda Smitshuijzen AbiFarès (Khatt Foundation, Dubai-Amsterdam)  \n- Willem Velthoven (Khatt Foundation / Stichting Mediamatic, Amsterdam)  \n- Dr. Goeffrey Roper (Institute for the Study of Muslim Civilisations, Aga Khan University, London)  \n- Jelle van der Toorn Vrijthoff (President of AGI & principal of QuinX bv. Amsterdam)  \n- J.R. Osborn (University of Callifornia, San Diego)  \n- Brody Neuenschwander (Artist/Calligrapher, Brugges)  \n- Jacques Koeweiden (Koeweiden Postma, Amsterdam)  \n- Zeina Maasri (American University of Beirut)  \n- Nadine Touma (Dar Onboz publishers, Beirut)  \n- Peter Bilak (Typotheque, Den Haag)  \n- Nadine Chahine (Linotype Library, Germany)  \n- Fawzi Rahal (Grey Worldwide, Dubai)  \n- Tarek Atrissi (Atrissi Design, Hilversum)  \n- Pascal Zoghbi (Notre Dame University, Lebanon)\n\n**Registration & Fees**\n\nThe cost of the symposium is 45 Euro (20 Euro for students with valid ID).  \nRegistration includes a free copy of the book Typographic Matchmaking and bonus CD (which has a retail price of 30 Euro), a lunch, and a reception.  \nRegistration will be available as of next week at [www.khtt.net](http://web.archive.org/web/20110818115020/http:/www.khtt.net/ \"www.khtt.net\").\n\n ![](http://web.archive.org/web/20110818115020im_/http:/typophile.com/files/KhattFonts-poster_4969.jpg)\n\n**El-Hema Exhibition**\n\nThe symposium will be followed by an exhibition entitled El-HEMA which will take place in Mediamatic’s gallery space (on the ground floor of the PostCS building). The exhibition will open on the night of the 24th of August and will go on until the 26th of October.\n\n_The symposium and related events, have been generously supported by the Fonds BKVB, the Khatt Foundation, Stichting Mediamatic, the Openbare Bibliotheek van Amsterdam, and BIS Publishers._\n\n",
  "author": "<a href=\"/web/20110818115020/http://typophile.com/user/18901\" title=\"View user profile.\">huda.abifares</a>",
  "time": "<br>",
  "uid": "18901",
  "comments": [
    {
      "time": "",
      "content": "Too bad Canada exists so far away from Amsterdam. There is someone in the forums that is visiting Amsterdam. I think I'll point them to this entry.\n\nA.Sagarwala  \n--  \nFocus beyond the dot of the i.\n\n"
    }
  ]
}
