{
  "id": "3535",
  "title": "Suitcase Vs Font Reserve - in Panther",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was using Font Reserve in OS 9. Does anyone have any opinions which is better in OSX?\n\n [‹ Seeking Imagery inspiration](http://web.archive.org/web/20080209110656/http:/www.typophile.com/node/3563 \"Go to previous forum topic\") [What happened to Lines &amp; Splines? ›](http://web.archive.org/web/20080209110656/http:/www.typophile.com/node/3560 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080209110656/http://www.typophile.com/user/2362\" title=\"View user profile.\">dbriens</a>",
  "time": "<br>",
  "uid": "2362",
  "comments": [
    {
      "time": " 10.Mar.2004 1.20pm",
      "content": "MasterJuggler!\n\n"
    },
    {
      "time": " 10.Mar.2004 1.53pm",
      "content": "FontAgent Pro!\n\n"
    },
    {
      "time": " 10.Mar.2004 4.26pm",
      "content": "You are the first MJ man I've heard from, James. I guess you don't   \nmind that it lacks auto-activation? I guess that's a dumb question.   \n   \n [Here is why I use FontAgent Pro.](http://web.archive.org/web/20080209110656/http:/typographi.ca/000767.php)\n\n"
    },
    {
      "time": " 10.Mar.2004 4.58pm",
      "content": "Tried FontReserve.   \nTried FontAgent Pro.   \nTried FontReserve, again.   \nTried FontAgent Pro, again.   \n   \nInstalled Suitcase.   \n   \nBut, being a bit of a control freak I do not allow it to auto-activate the fonts for me.\n\n"
    },
    {
      "time": " 10.Mar.2004 5.11pm",
      "content": "So, yeah i'd be interested in checking out Font Agent Pro,   \nYet i'd like to read through their manual before i install.   \n   \nI went to their site and couldn't find a manual to download.   \nDoes someone have a PDF they could post.\n\n"
    },
    {
      "time": " 10.Mar.2004 5.21pm",
      "content": "I'll add that I found FAP and FR to be slow, and I'll admit that Suitcase had some granny moments too. But, when they updated it for Panther it snapped out of it. IMO The one thing that might slow it down is too many fonts, but I think that is true for any font management app.\n\n"
    },
    {
      "time": " 10.Mar.2004 7.42pm",
      "content": "Stephen,   \n   \nI use to be a FontAgent pro kinda guy, until it stopped activating the roman style of a font suitcase, also all of this copying and moving started to piss me off. MasterJuggler works in much the same way as ATM Deluxe, only it is Unicode savvy.   \n   \nYou can activate fonts from anywhere, it does not copy fonts. After activation, you can QUIT the program, so it does not need to be constantly running in the background. Yes it does not have auto-activation, but I've never really needed it. When I did a lot of graphic design, I had very carefully organized font folders. Now that most of my time is in font development, I'm happy to have a very simple \"Temporary\" activation tool.   \n   \nI've sent e-mails to Alsoft to suggest that they make MJ available for a trial download, but they seem not to be interested. They say Auto-activation is coming in the next release.   \n   \nI still love the fact that they had me in their database at a different address with a different phone number from 10 years ago, and still gave me the upgrade price when I ordered over the phone.   \n   \nYou can't go wrong with that.\n\n"
    },
    {
      "time": " 11.Mar.2004 3.47am",
      "content": "FontAgent Pro 2.0 all the way here on Mac OS X Panther.   \n   \nThe whole copying the fonts to a universal FontAgent Pro database doesn't bother me because it leaves my originals untouched. I'm not quite sure what it's doing when it checks/optimises the fonts but it seems fine. They also need to badly address their manual for version 2.0 as it references version 1.0 in the screenshots which seems very unprofessional.   \n   \nI have to admit that I also have Font Doctor 6.0 just to double check my fonts before I send them to Font Agent Pro. Some Mac OS X applications, especially Illustrator CS seem to be ultra sensitive to bad fonts and quit and crash while they're active. For some very strange reason it's extra important to ensure you have a font library that's in good condition. One missing outline or something along those lines can cause havok!\n\n"
    },
    {
      "time": " 11.Mar.2004 4.43am",
      "content": "Font Reserve and Suitcase are now the same company and I would guess the best features from both products will be rolled into the next version of Suitcase.\n\n"
    },
    {
      "time": " 11.Mar.2004 8.46am",
      "content": "James - FAP 2 doesn't need to be running, even for auto-   \nactivation. I asked Alsoft about the demo too, but no reply. I   \nthink they are shooting themselves in the foot. They will never   \nbe a mainstream name like Suitcase if they don't wise up. Nice   \nto hear it runs well for you and they are adding the auto-. I like   \nthe thought of more than 2 competitors.   \n   \nDaniel - Agree.\n\n"
    },
    {
      "time": " 11.Mar.2004 9.18am",
      "content": "\"also all of this copying and moving started to piss me off. \"   \n   \nJames,   \nWhat is that? You are serious? Move the fonts to activate them? Not an funny option for type designers; :-(   \n   \nStephen? Could you confirm that \"feature\"?   \n   \nI was very close to bought FAP 2 the other day... I begin to wonder if its not my chance that their e-commerce was done at the time...   \n   \nStill with FR who run ok but bit not easy interface.   \n   \njfp (who never want to going back to Suitcases, after so bad years with it more that 10 years ago)\n\n"
    },
    {
      "time": " 11.Mar.2004 10.10am",
      "content": "FAP gives you the option to move _or_ copy fonts to import   \nthem into it's library. Naturally, I opt to copy. It's no biggie.   \nOnce they are imported you simply push a button to activate   \nthem, just like in ATM Deluxe or Suitcase.   \n   \nBTW JFP, even though I am not a Suitcase fan, be careful about   \njudging software based on experiences from years back.   \nRemember how bad InDesign 1.0 was? Now it kicks all fanny.\n\n"
    },
    {
      "time": " 11.Mar.2004 9.27pm",
      "content": "I\n\n"
    },
    {
      "time": " 11.Mar.2004 9.35pm",
      "content": "suitcase hands down.   \n   \non a side note font book is a joke.\n\n"
    },
    {
      "time": " 12.Mar.2004 9.31am",
      "content": "Bill --\\> I was fearful of allowing Suitcase to manage my system fonts at first, but decided I didn't want all of those fonts active at all times. I backed them up in tidy little (named with location) folders first, and then let Suitcase manage my system fonts, all of them, and haven't worried since.\n\n"
    }
  ]
}
