{
  "id": "35360",
  "title": "Redesign font ideas?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "We are looking for a new font for our consumer parenting magazine. We currently use Spira as our primary serif body font but dislike that it looks too hand-cut and has an overall folksy feeling. What we are looking for is a cleaner and more open font, but still based in classic typography. It is also important for it to have a fairly extensive family and includes beautiful ligatures.  \nWe love the look of Sterling, by Hoefler & Frere-Jones in the AIGA Design Archive, but it is unavailable for purchase. Could anyone suggest a similar font? The ones we have found and are considering thus far are Whitman, Miller, and Eason.  \nThanks so much in advance!\n\n| Attachment | Size |\n| --- | --- |\n| [sterling1.jpg](http://web.archive.org/web/20150303151614/http:/typophile.com/files/sterling1.jpg) | 49.16 KB |\n| [sterling2.jpg](http://web.archive.org/web/20150303151614/http:/typophile.com/files/sterling2.jpg) | 120.5 KB |\n| [sterling3.jpg](http://web.archive.org/web/20150303151614/http:/typophile.com/files/sterling3.jpg) | 89.06 KB |\n\n",
  "author": "LHait",
  "time": "23 Jul 2007 — 6:27am",
  "uid": "19761",
  "comments": [
    {
      "time": "23 Jul 2007 — 7:02am",
      "content": "[Perpetua](http://web.archive.org/web/20150303151614/http:/www.linotype.com/1334/perpetua-family.html) has certain similarities to Sterling. Indeed, Sterling may have used Perpetua as an inspiration. Sterling looks more 'refined' than Perpetua IMO. It is gorgeous.\n\nNick Cooke\n\n"
    },
    {
      "time": "23 Jul 2007 — 8:07am",
      "content": "Not sure if it's what you're looking for, but I thought of [Throhand](http://web.archive.org/web/20150303151614/http:/fontbureau.com/fonts/Throhand).\n\n"
    },
    {
      "time": "23 Jul 2007 — 9:40am",
      "content": "Kent Lew is working on display variants of Whitman, due out soon....\n\nSterling does look like it was influenced by Perpetua. Perpetua, while older and established, is not commonly used. It would be distinctive in a magazine, though probably a little light.\n\n"
    },
    {
      "time": "24 Jul 2007 — 7:21am",
      "content": "Liz --\n\nHey, are you working with _Family Fun_ and the Impress folks over in that round building in Northampton, by any chance? I'm just an hour west of you over here in Berkshire county.\n\nHere are a few Whitman settings for direct comparison with the Sterling jpgs. The display is set in the Regular weight, with one line of Light at the end for comparison. (There will be seven weights and three widths total in the family.) The retail release should be ready in the next couple weeks, I hope . . .\n\n ![](http://web.archive.org/web/20150303151614im_/http:/typophile.com/files/WhitmDisplay_5833.gif)\n\nThere are also a few additions to the text family that are being prepped for retail release. Bold Italic, Semibold and Semibold Italic fonts will soon be available.\n\nThis image shows the three weights.\n\n ![](http://web.archive.org/web/20150303151614im_/http:/typophile.com/files/WhitmText_6470.gif)\n\nI pulled these together pretty quickly, so the lo-res rasterization leaves a bit to be desired. If you want to see Whitman in a context more comparable to what you're doing, look for a copy of _Brides_ magazine. They use Whitman for feature text (granted, it can be a little tricky to find amid all the ads and all the Relay sans serif). They also have original versions of some of the Display weights that they use here and there.\n\nLet me know if I can answer any questions about Whitman to help in your consideration.\n\n-- K.\n\n"
    },
    {
      "time": "24 Jul 2007 — 9:19am",
      "content": "I love Perpetua but I have to caution you against it if you're using InDesign. The optical and metric kerning pairs are pretty dodgy, especially in the Italic. Since InD doesn't have the kerning tables option (grrrr!) you'd have to go in and tweak the font itself. I just used it for a book and had to do a lot of manual kerning, quite time consuming.\n\nI have the Adobe Perpetua from 1998 - it's possible the Linotype version is better - unless they're the same.\n\nSterling is pretty - it's reminding me of something else - tip of my tongue...  \nWhitman's great too.\n\n"
    },
    {
      "time": "24 Jul 2007 — 10:54am",
      "content": "Scaling is an issue for Perpetua.  \nIt gets a bit thin at small sizes.  \nSo it may be worthwhile, if you're after the effect of finesse, to opt for a typeface that has some size-specific variants.  \nThat gives you more flexibility in your layouts.\n\n"
    },
    {
      "time": "24 Jul 2007 — 10:58pm",
      "content": "Chronicle (H&FJ)  \n [http://www.typography.com/catalog/chronicle/index.html](http://web.archive.org/web/20150303151614/http:/www.typography.com/catalog/chronicle/index.html \"http://www.typography.com/catalog/chronicle/index.html\")  \nin use in Delta's Sky magazine: [http://www.typophile.com/node/32911](http://web.archive.org/web/20150303151614/http:/www.typophile.com/node/32911 \"http://www.typophile.com/node/32911\")\n\nLeitura (DSType)  \n [http://www.typetrust.com/fonts/font.php?id=MzYy](http://web.archive.org/web/20150303151614/http:/www.typetrust.com/fonts/font.php?id=MzYy \"http://www.typetrust.com/fonts/font.php?id=MzYy\")  \n [http://www.myfonts.com/fonts/dstype/leitura-display/](http://web.archive.org/web/20150303151614/http:/www.myfonts.com/fonts/dstype/leitura-display/ \"http://www.myfonts.com/fonts/dstype/leitura-display/\")\n\nPublico (Christian Schwartz)  \n [http://christianschwartz.com/publico.shtml](http://web.archive.org/web/20150303151614/http:/christianschwartz.com/publico.shtml \"http://christianschwartz.com/publico.shtml\")\n\n"
    },
    {
      "time": "7 Aug 2007 — 2:41pm",
      "content": "Thanks everyone for your excellent suggestions.\n\nKent, you hit the nail on the head with our identity although we're not in that great historic building anymore. Always glad to know local designers!\n\nAnd we will certainly look forward to seeing more of Whitman as well.\n\n"
    }
  ]
}
