{
  "id": "35366",
  "title": "Hebrew swash font",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I’m looking for a Hebrew font for use in a wedding invitation; preferably something more decorative than Davka’s Gonen (in the attached image or at `[Bad link]`). Is there anything that would match well with (say) Zapfino?\n\n++J\n\n| Attachment | Size |\n| --- | --- |\n| [invite.PNG](http://web.archive.org/web/20150428195240/http:/typophile.com/files/invite.PNG) | 15.76 KB |\n\n [‹ \"Voices\" logo for critique](http://web.archive.org/web/20150428195240/http:/typophile.com/node/35628 \"Go to previous forum topic\") [Designing a logo ›](http://web.archive.org/web/20150428195240/http:/typophile.com/node/35543 \"Go to next forum topic\")\n\n",
  "author": "JCSalomon",
  "time": "23 Jul 2007 — 11:27am",
  "uid": "19836",
  "comments": [
    {
      "time": "23 Jul 2007 — 12:11pm",
      "content": "Check out [Masterfont's selection.](http://web.archive.org/web/20150428195240/http:/www.myfonts.com/browse/foundry/masterfont/)\n\n- Lex\n\n"
    },
    {
      "time": "23 Jul 2007 — 1:13pm",
      "content": "Typophiler David Hamuel has a lovely calligraphic font, `[Bad link]`.\n\nMatching Hebrew and Roman fonts is always difficult. It may be that a font with the 'crowns' on the letters will better match a roman script font, because of the high contrast.\n\nThe best thing is probably to get a calligrapher with Hebrew expertise to do the invitation, and he or she will be able to match the Hebrew and English. I am talking about the calligrapher doing a model to photograph and print from, of course, not the addressing the envelopes etc.\n\nThere are a number of fine calligraphers who do this kind of thing--Hebrew and English--in the New York area, where you are. They also do Ketubbot, etc.\n\n"
    },
    {
      "time": "23 Jul 2007 — 1:32pm",
      "content": "How bout\n\n‏פךנקיהליה  \n(I hope i spelled that right!!!)\n\nfrom [Oded Ezer](http://web.archive.org/)\n\n"
    },
    {
      "time": "24 Jul 2007 — 2:27pm",
      "content": "This is quite tricky. Are you looking for formal or casual, old-fashioned or modern, religious or secular?\n\nFor example, Shira 25 could be appropriate for a traditional event. For a good selection of more casual fonts, see [http://www.masterfont.co.il](http://web.archive.org/web/20150428195240/http:/www.masterfont.co.il/ \"http://www.masterfont.co.il\")\n\n"
    },
    {
      "time": "24 Jul 2007 — 10:18pm",
      "content": "_It may be that a font with the 'crowns' on the letters will better match a roman script font, because of the high contrast._\n\nYou mean _tagin?_ These are specific to STA'M (Sifrei Torah, Tefillin and Mezuzot) lettering, so I'm not sure how appropriate they would be for other use, even if the wedding is taking place in a religious context.\n\n"
    },
    {
      "time": "25 Jul 2007 — 5:01am",
      "content": "Yes, I was referring to tagin. I think I remember 'stam' fonts being used on invitations, but they may have been Bar or Bat Mitzvah invitations. Because the Bar Mitzvah ceremony involves the first reading from the Torah for the child, it might be more appropriate there. I don't know of any prohibition on using this style, though.\n\nOverall, a copperplate latin script I think would be particularly hard to match, because Hebrew cursive script is not connected, and the normal square writing shapes are very different. I would think that a calligraphic roman, like Brioso or Diotima, would be easier to match with a calligraphic Hebrew.\n\nBut overall, it is very hard because Hebrew has thin verticals and thick horizontals, and Roman the opposite. If the invitation is done by a calligrapher he or she can keep the pen at a similar angle for both, and make them work together.\n\nI put together David and Friz Quadrata on a project, and they worked as the low contrast made the differences in stress stand out less. But they wouldn't work on an invitation...\n\n"
    },
    {
      "time": "25 Jul 2007 — 9:06am",
      "content": "Thanks all. I’m aware of the hassle involved in matching fonts across alphabets. Fortunately I don’t need to mix them on the same page (much) so the match needn’t be close; all I’m looking for is a similar level of “swash-ness”. OTOH, Zapfino is rather excessive in that regard, so I might be setting the bar too high….\n\nI’m looking for formal and decorative—the same situation that makes a swash script appropriate in Latin type. No _tagim_. Shira 25 is pleasant, if simple. Frankruhlya is horrific. (I was about to say “grotesque”, but apparently that’s a term of art in type design.)\n\nIs it completely crazy that I haven’t found anything that appeals to me as much as the fairly cheap Davka Gonen?\n\n"
    },
    {
      "time": "25 Jul 2007 — 9:35am",
      "content": "\\> fairly cheap Davka Gonen?\n\nKnown as Meiri. Gonen is really poor design.\n\n"
    },
    {
      "time": "25 Jul 2007 — 9:50am",
      "content": "Yeah, I finally noticed that Gonen:\n\n ![](http://web.archive.org/web/20150428195240im_/http:/typophile.com/files/gon_5297.jpg)\n—or rather, Meiri:\n ![](http://web.archive.org/web/20150428195240im_/http:/typophile.com/files/Meiri_4814.gif)\n is different from the text in the invitation:\n ![](http://web.archive.org/web/20150428195240im_/http:/typophile.com/files/invite_3555.png)\n\nI suppose the font used isn’t bad, but I’ll keep my eyes open for something with a bit more flair.\n\n--Joel\n\n"
    },
    {
      "time": "25 Jul 2007 — 9:54am",
      "content": "\\>Zapfino is rather excessive in that regard\n\nZapfino is fine, but I don't think there is any kind of Hebrew style that has that kind of loopy high contrast stroke.\n\nHere is a link for `[Bad link]`, which is the kind of thing I think will work more easily with a calligraphic Hebrew.\n\n"
    },
    {
      "time": "25 Jul 2007 — 10:23am",
      "content": "\\> is different from the text in the invitation:\n\nThe font is Yerushalmi (based on the lettering used in the Dead Sea Scrolls)\n\n"
    },
    {
      "time": "2 Aug 2007 — 2:37pm",
      "content": "Guttman Adii, Guttman Mantova, or Guttman-Aram might be some good choices. These all come with Microsoft Proofing Tools.\n\nGeorge\n\n"
    }
  ]
}
