{
  "id": "35374",
  "title": "howdy folks",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "My name is Luís Martins, I'm from Portugal and I study communication design. I've recently started trying to design a typeface. In my current college they don't push us to do typeface design so I've started to learn the basics by myself.  \nThis is my first go and I would like some C&C from all of you. I've ordered already some books to learn more about it.  \nI'm quite glad to join this community.\n\nCheers\n\n| Attachment | Size |\n| --- | --- |\n| [grelha1.jpg](http://web.archive.org/web/20150123171010/http:/typophile.com/files/grelha1.jpg) | 67.08 KB |\n\n",
  "author": "luismrmartins",
  "time": "23 Jul 2007 — 3:14pm",
  "uid": "19843",
  "comments": [
    {
      "time": "23 Jul 2007 — 3:46pm",
      "content": "Luís, get along with your font. Looks quite original. But try to keep those letters and ciphers in about the same width. Letter \"K\" and the cipher \"9\" are too narrow. The \"4\" looks a bit strange (but that's my personal opinion).  \nRalph\n\n"
    },
    {
      "time": "23 Jul 2007 — 3:54pm",
      "content": "a good concept piece from the bent-wire school of design. Some of the transitions from straights to curves seem a bit abrupt, and the K and X seem a bit bottom-heavy due to the reverse-bends inherent in the design concept.\n\nBut I like it overall. Sure, it needs tweaking, but I can see it serving well in display text for an electronics ad, or some such.\n\n"
    },
    {
      "time": "23 Jul 2007 — 3:59pm",
      "content": "Hey Ralph. Thanks for the input. The 4 was already redone and I've forgot to update it. You can see it in this post attachment. Other than that, the main thing is width right? I've tried to keep it unchangeable but in some letters I've had to change it :S\n\n ![](http://web.archive.org/web/20150123171010im_/http:/typophile.com/files/grelha1_6188.jpg)\n\n"
    },
    {
      "time": "23 Jul 2007 — 4:01pm",
      "content": "Ahahah...nice way to describe it cuttlefish. never thought about it as a bent wire kind of thing. but I guess it is :) Yeah the I have to tweak those characters with too much bending.\n\nCheers\n\n"
    },
    {
      "time": "24 Jul 2007 — 8:45pm",
      "content": "Looks like Paper Clip wide\n\n"
    },
    {
      "time": "25 Jul 2007 — 12:33pm",
      "content": "hey, update. don't know paper clip wide typeface so can't comment on that. if you can, post a link or something like that.\n\nhere's I've updated some of the letters. what do you think?\n\n ![](http://web.archive.org/web/20150123171010im_/http:/typophile.com/files/grelha1_5975.jpg)\n\n"
    },
    {
      "time": "25 Jul 2007 — 2:14pm",
      "content": "Well done overall, perhaps the B could be narrower and the bottom of the S bigger.\n\n"
    },
    {
      "time": "25 Jul 2007 — 2:25pm",
      "content": "yeah...the B might use a bit of trimming maybe. going to work on that\n\n"
    },
    {
      "time": "25 Jul 2007 — 4:24pm",
      "content": "diverged a bit from the original design...better? worse?\n\n ![](http://web.archive.org/web/20150123171010im_/http:/typophile.com/files/grelha1_6610.jpg)\n\n"
    },
    {
      "time": "25 Jul 2007 — 6:48pm",
      "content": "and the test\n\n ![](http://web.archive.org/web/20150123171010im_/http:/typophile.com/files/grelha11_4215.jpg)\n\n"
    },
    {
      "time": "26 Jul 2007 — 9:32am",
      "content": "\"S\" is too horizontal in the middle. I'd make it slightly downward-angled. It also looks too vertically mirrored/symmetric. Top of S is normally always a bit smaller depending on the typeface.\n\nW and K should be a bit wider, B, J and P a bit narrower.\n\nApply the same top/bottom principle as with the \"S\" to the \"3\" and \"8\". \"9\" and \"4\" should be wider.\n\n"
    },
    {
      "time": "26 Jul 2007 — 10:27am",
      "content": "thank you for your input. going to work on that right now :)\n\n"
    },
    {
      "time": "26 Jul 2007 — 10:58am",
      "content": "better or should I accentuate the changes?\n\n ![](http://web.archive.org/web/20150123171010im_/http:/typophile.com/files/grelha1_5453.jpg)\n\n"
    },
    {
      "time": "26 Jul 2007 — 11:06am",
      "content": "and a bolder version of it\n\n ![](http://web.archive.org/web/20150123171010im_/http:/typophile.com/files/grelha12_5722.jpg)\n\n"
    },
    {
      "time": "26 Jul 2007 — 2:39pm",
      "content": "Ok. About the regular version. the changes on letters are better. But. \"S\" is a bit too wide on the top curve. It's smaller when it comes to the height (compared to the bottom half) but still too wide.\n\n\"K\" much better. \"P\" should maybe be somewhere in between the original and this last version.\n\n\"3\" is better, but the top half goes too much to the right. \"8\" has to be corrected on the bottom curve because it has a bump.\n\n\"4\" and \"9\" are still too narrow. Try to narrow the \"R\" and \"5\" a bit.\n\nRegarding the bold version... It's not completely the same family. You joined many lines together that are separate in the regular weight. And some additional comments: \"2\" is too heavy on the top half (curve goes too down), \"4\", \"7\" and \"9\" are way too narrow in this weight,\n\n"
    },
    {
      "time": "26 Jul 2007 — 3:21pm",
      "content": "hey litera. thank you so much for the input. it's been quite valuable to have an extra set of eyes to comment and critique :)\n\nhere's new version with the changes you've mentioned. I just don't get the 8 comment.\n\noh, and let's forget the bold version for now :)\n\n ![](http://web.archive.org/web/20150123171010im_/http:/typophile.com/files/grelha1_6152.jpg)\n\n"
    },
    {
      "time": "27 Jul 2007 — 2:07am",
      "content": "\"8\": bottom bowl is not round on the right side.\n\nMaybe widen the \"7\" too... I'm still not too sure about \"0\" (zero)... Is it too wide or not. I know it's similar to \"O\" but... Maybe it should be a bit narrower. Try and see for yourself.\n\nAnd I suggest you start working with texts because you'll see the differences and contrast problems more quickly.\n\nAnd there are also some curve problems (not smooth curves) with some of your letters... There seems to be something going on with the top line (before it goes into a curve) with \"P\", \"R\" and \"5\" (middle line)\n\nTop arms of \"E\" and \"F\" are not horizontal. They are going a bit downwards.\n\nMinor minor changes.\n\nLet's see what others will say.\n\n"
    }
  ]
}
