{
  "id": "35373",
  "title": "When a client wants to register a trademark using one of your fonts",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello all. I have been contacted by a person who wishes to use a font of mine in the registered trademark/logo of her company. While on the one hand that sounds great, on the other I don't know if I need to issue some kind of very specific legal agreement protecting the font itself. There are any number of registered trademarks/logos that incorporate Helvetica, for example, and that doesn't prevent other people from using the font for other purposes. But do I need to issue her some kind of specific license specifying that? Should I be charging her some kind of extra license fee? I'd be grateful for any input.\n\nAndrew\n\n",
  "author": "ahleman",
  "time": "23 Jul 2007 — 3:10pm",
  "uid": "3267",
  "comments": [
    {
      "time": "2 Aug 2007 — 8:03pm",
      "content": "Many foundries' basic license includes the right to make this sort of derivative work, i.e., to make a graphic image that includes the shapes of some glyphs in the font. If the license you issued does not, then yes, I think you are within your rights to offer that customer special dispensation for an additional fee, but this is widely regarded as being within the fair and expected uses of a font.\n\nDingbat, symbol, and picture fonts are generally the only ones that specifically disallow this, since the charactters are already basically logos in and of themselves.\n\nOf course, I do defer to the opinions of those with more experience and expertise in this matter.\n\nIf this company is requesting exclusivity in the use of your font in logotypes, then this is indeed a very special case, which will require special licensing not only for this customer, but also denying this specific use for any other customers. It would be simpler to sell this client full corporate exclusivity (with the huge fee that should entail). But again, I'm not the expert here.\n\n"
    }
  ]
}
