{
  "id": "35389",
  "title": "Perhaps I should just do an MA in type design?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I studied a BA in graphic design, then an MA in communication design (typography). I have done really well in the graphic design profession, but I also want to design typefaces. I have always been obsessed with type design, but every time I become inspired to design a typeface, there are so many questions which get thrown up due to my not having actually studied in-depth character analysis, that I lose confidence. I know a lot about type/history of, but the actual act of drawing a glyph I think you need proper training in.\n\nYes, there are great type designers that never went to Reading for instance – Jeremy Tankard, Sebastian Lester, etc. But I feel like I need some formal training.\n\nWhat do people think?\n\nFeedback would be very welcome as I’m thinking of applying for an MA in type design.\n\n [‹ What do you know about Myriad?](http://web.archive.org/web/20080825145402/http:/www.typophile.com/node/35445 \"Go to previous forum topic\") [Helvetica film World Premiere ›](http://web.archive.org/web/20080825145402/http:/www.typophile.com/node/31228 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080825145402/http://www.typophile.com/user/4905\" title=\"View user profile.\">alphapeta</a>",
  "time": "<br>",
  "uid": "4905",
  "comments": [
    {
      "time": " 24.Jul.2007 6.51am",
      "content": "I think if you want to design type, you should begin designing type. Most type designers have not gone to Reading. Most type designers are self taught. You learn to draw glyphs, by drawing glyphs, so get to it.\n\nJames\n\n"
    },
    {
      "time": " 24.Jul.2007 7.09am",
      "content": "I sounds more like you just need to read more about type and lettering. If you really have the money to spend for another MA and feel like spending a year in school go for it, otherwise just pick up some new books and start drawing letters! Made With FontFont might be a good start—it has some pretty cool explanations of how and why some really great FontFont fonts came out the way that they did.\n\n"
    },
    {
      "time": " 24.Jul.2007 7.15am",
      "content": "That sounds like an awful lot of school to me - especially in a field where practical experience can teach you as much if not more than classes.\n\n"
    },
    {
      "time": " 24.Jul.2007 7.31am",
      "content": "Consider internship or partnership. You have design and marketing skills and experience which would be invaluable to a foundry: identity, specimens, promotions, etc.  \nOn the other hand, if formal education has worked well for you in the past...\n\n"
    },
    {
      "time": " 24.Jul.2007 7.39am",
      "content": "Just echoing what James said. I didn’t take classes to design type, the closest I got to education in type was typography, which is very useful and valuable, but it sounds like you’ve got that covered. So the only thing remaining is to get type design software, start sketching and digitizing, and keep refining your work. You don’t graduate from type school suddenly able to design large complex type systems anyway. Do a few manageable projects to get some experience. Start with a display face that you intend to use in layouts. And show your work here in the critique forums!\n\n"
    },
    {
      "time": " 24.Jul.2007 8.03am",
      "content": "That’s all great feedback – thanks very much to all.\n\nI realise most designers haven’t gone to Reading, but how much more information would I aquire on an MA course?!\n\nI just want to be confident in the marks that I’m making on the page. I am a stickler for tradition, and I don’t want  \nto start messing about with type for fun – or hobby like.\n\nWould anybody be able to recommend me any reading material with regards to drawing type?\n\nThanks again, an invaluable resource.\n\n"
    },
    {
      "time": " 24.Jul.2007 8.14am",
      "content": "[Designing Type](http://web.archive.org/web/20080825145402/http:/www.amazon.com/gp/product/0300111509?ie=UTF8&tag=onst-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=0300111509) by Karen Cheng  \n [The Logo, Font, and Lettering Bible](http://web.archive.org/web/20080825145402/http:/www.amazon.com/gp/product/1581804369?ie=UTF8&tag=onst-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1581804369) by Leslie Cabarga\n\n"
    },
    {
      "time": " 24.Jul.2007 8.17am",
      "content": "Hi — Yeah thanks, I have those. I’m thinking more advanced really …\n\n"
    },
    {
      "time": " 24.Jul.2007 8.45am",
      "content": "As far as books, I like most Bringhurst’s ’Elements of Typographic Style’, Walter Tracy’s ’Letters of Credit’ and Doyald Young’s ’Fonts and Logos’. The best single instructional manual is [Briem’s great site](http://web.archive.org/web/20080825145402/http:/briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm) on line.\n\nThese and other great links and resources you can find here in the [’How To’](http://web.archive.org/web/20080825145402/http:/typophile.com/node/12369) section of the typowiki.\n\nI came to type three years ago with no formal training in art or graphic design. I can report that it took me two years before my eyes would tell me not only that something was wrong, but how to correct it. This was by constant constant drawing and re-drawing, and in FontLab comparing to outlines of typefaces I admired.\n\nExisting typefaces are the one indispensable teacher, and the font programs that give you the outlines are like x-rays. And you can paste one outline over another to compare. There are no secrets, except those in plain sight—which do take a lot of looking and thinking to understand.\n\nIn a sense, all learning is self-instruction. The difference is whether you have guidance. I think guidance can save you a lot of work and grief, but it doesn’t have to come only from a formal program; there are other avenues.\n\nThat being said, the advantage of a formal program if it is good—and Reading and KABK seem to be good—I would think is that ideally you will get all sides of the type design: the technical, the artistic, the craft, the historical, the commercial. Most people I think will find one or another area more difficult to get by self-instruction than another.\n\n"
    },
    {
      "time": " 24.Jul.2007 8.49am",
      "content": "You might consider calligraphy as a way of improving your drawing skills.\n\n"
    },
    {
      "time": " 24.Jul.2007 8.55am",
      "content": "I am currently in the midst of my MA in typeface design at Reading so I can speak from firsthand experience about the program.\n\nIt’s really fantastic. But, learning is a highly individualized process and what works for one person might not be right for another. I’ve personally benefited from being able to focus on type design for a year and not have anything else pulling for my attention. I’ve also met and learned from countless amazing people who would not have otherwise had the time to take a role in my learning process. And, having the world’s greatest set of eye’s - Gerard Unger - review your typeface isn’t bad either.\n\n\\> That sounds like an awful lot of school to me\n\nAs a woman working on her 2nd masters... school doesn’t always have to be about what career path you end up on, it can also be about the journey and the knowledge. Sometimes, it’s nice to take that journey with 14 others (the current class at Reading) rather than go it alone. But, just depends on you.\n\n"
    },
    {
      "time": " 24.Jul.2007 9.01am",
      "content": "I think you have to just do it to see if is what you want to do. You say you are a stickler for tradition and don’t want to start messing with type as a hobby. To design type, you have to get your hands dirty. If you want to do it in a traditional way, fine. If you want to do it in a different way, fine as well. You won’t know what any of that means until you do it though. If after you bang your head at it in the solitude of your own home for a year or so, you decide to attend a very fine school like Reading, you will know what to expect and be better able to absorb what the school has to offer. You must bring something to the school before you can carry even more away as you leave it. Schools are not a magic wand, they will not inject you with knowledge and skill. They will take what you bring using the effort you expend to expand who you are.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Jul.2007 9.06am",
      "content": "Hi Nicole —\n\nGerard Unger – that does sound good!\n\nYes, I do think it’s highly personalised – agreed. It is absolutely a personal endeavour for me – I’m not really thinking of sole career path as I’m setting up my own graphic design studio with a fellow designer in London (but I would intend to filter it into every area of work possible!), it’s something I have always loved, and will always return to regardless of my frustrations with it.\n\n"
    },
    {
      "time": " 24.Jul.2007 9.16am",
      "content": "Hi — Yes, I realise schools are not a magic wand. I’m looking for guidance. I’m looking for a historical overview and a starting point. It is the comprehensive approach that I would learn through a school (ie like Reading) that I am interested in (bar everything else it has to offer).\n\nThis is not a whimsical idea I’ve been playing with for a week or so, this is something I’ve been thinking about for years.  \nI’m a graphic designer by trade, but I yearn for type design every day.\n\nWhen I say stickler for tradition, I just mean I don’t want to make naive decisions without a good historical context.\n\n"
    },
    {
      "time": " 24.Jul.2007 9.16am",
      "content": "\\>I just don’t feel well enough qualified to draw type.\n\nI think this is a bit misguided. As James— [who knows](http://web.archive.org/web/20080825145402/http:/terminaldesign.com/)—says, the only way you can become good is by doing it \\*a lot\\*—and there are no guarantees. Schooling, apprenticeship, getting guidance from Foundries, calligraphy, going to conferences—all can help—but the central process is hours, days, months and years of drawing type.\n\nBy way of illustration, Typophilers John Hudson and Eric Olson, both successful type designers, withdrew from sales their typefaces from their first seven years of work. They evidently felt that after seven years of drawing type their products were on a higher level.\n\nAnother Typophiler, Kris Sowersby had been posting stuff here for four years, and is now collaborating with some of the best in the business. If you are interested, you can search here in the critiques and see the evolution of the skills of a very talented guy.\n\n"
    },
    {
      "time": " 24.Jul.2007 9.19am",
      "content": "Hi thanks again – ’Elements of T.Style’ is probably the best typographic-related purchase I ever made – I know it very well, also ’Letters of Credit’, ’Tally of Types’ – Stanley Morrison/ more by Updike to name but a few. Typography I know very well.\n\nIt’s more so the techincals of type design I need.\n\nI dabbled with the idea of learning calligraphy a while back. I think this may be a good start – thanks Nick.\n\nI did start tracing and learning some Berthold classics a few years ago – (one of my favourite old foundries) – I can draw rough renaissance glyphs/classical styles/but I just don’t feel well enough qualified to draw type.\n\n"
    },
    {
      "time": " 24.Jul.2007 9.23am",
      "content": "\\>Yes, there are great type designers that never went to Reading for instance – Jeremy Tankard, Sebastian Lester, etc. But I feel like I need some formal training.\n\nYou need a bit of history here. Until Gerry set up the Type Design MA a few years back there was no formal type design program at Reading. For sure the odd undergrad would do type design as their personal project, and FOG was installed on many of the Macs. I recall, and others can correct me if I’m wrong, that Prof. Twyman and others on staff would warn students away from seeking careers in type design - probably wise advice in 1993, before the Web allowed people like Jeremy the opportunity to prove and promote themselves without being part of the foundry system.\n\nI think in five or ten years time when you look at active type designers, you’ll see that the Reading MA grads will make up a good portion of those at the top of the game.\n\n"
    },
    {
      "time": " 24.Jul.2007 9.30am",
      "content": "Yes, I knew that the course wasn’t set up for the likes of Mr Tankard to attend, it is moreso the reference to them not having taken a postgrad course in type design. (Although Jeremy studied at the RCA I know).\n\nI have seen a lot of good work from Reading lately. I just using Reading as a reference at this point. I’m sure it’s pretty competitive to get a place on the course.\n\n"
    },
    {
      "time": " 24.Jul.2007 9.31am",
      "content": "Yes, I knew that the course wasn’t set up in time for the likes of Mr Tankard to attend if he had wanted to, it is moreso the reference to them not having taken a postgrad course in type design – (Although Jeremy studied at the RCA I know).\n\nI have seen a lot of good work from Reading lately. I just using Reading as a reference at this point. I’m sure it’s pretty competitive to get a place on the course anyway.\n\n"
    },
    {
      "time": " 24.Jul.2007 10.45am",
      "content": "_I think in five or ten years time when you look at active type designers, you’ll see that the Reading MA grads will make up a good portion of those at the top of the game._\n\nSo you’re predicting an end to the popularity of script fonts, to be replaced by a large demand for “mature” multi-language text faces?\n\n"
    },
    {
      "time": " 24.Jul.2007 10.53am",
      "content": "I am certainly getting the message that you want some structured, authoritative guidance. I understand that desire. What may not be clear from Simon’s message is that previous to about 10 years ago, there simply was NO PLACE such as you imagine; which is to say that in the 20th century, ALL type designers were self-taught, more or less. Now, undoubtedly someone will come along to nit-pick about that statement, but as a generalization, I can safely say that most type designers were never trained; they used the momentum of their own interest, sustained over years, and a lot of time spent looking, drawing, looking, reading, looking, drawing, digitizing, etc to develop their skills.\n\nThere really is no magic bullet or neatly-encapsulated program in general; the possibility of a type design education is a very new thing. But people can get involved in type design from nearly any direction; there are mathematicians, calligraphers, architects, signpainters, dancers, advertisers, graphic designers, stonecutters, and programmers who have found their way successfully into type design.\n\nIt sounds like you intend to then use the skills in type design in your business. I think you are already positioned to do this better than almost anyone; you have clientele in graphic design, you have experience in that industry, you have a connection to trends and client taste, and you have proficiency with graphic design tools. There is really very little left for you to acquire or add to that mix to successfully build lettering, type design and custom type into your practice. It’s really true; as scary or unsupportive as it may sound, simply start doing it. There is no licensing board!\n\n"
    },
    {
      "time": " 24.Jul.2007 11.13am",
      "content": "Peter, I was at a similar stage before I looked into coming to Reading for the MA — a lot of experience with design and typography, and perhaps just enough knowledge to be intimidated by type design itself. For me, the decision to go back to school had a lot to do with wanting to focus on type design without the distraction of other work once and for all. It’s a luxury to turn one’s back on earning a living for a while and devote all your time and attention to something new. Hopefully, the investment will also have a good return. What we get at Reading is advice from smart and talented people (which you can get elsewhere) and access to some really fantastic collections of historical artifacts (which you can see your own of you wished to), but most importantly we get the time to pour all of our energy into learning and a lot of support for doing that as efficiently as we can.\n\nIt’s very, VERY self-directed here, which is important to consider. It’s not step-by-step instruction in calligraphy, using FontLab, or writing OpenType features. We get a lot of history, a lot of perspectives on how things have been done and how things are being done now, but it’s up to us to figure out what to do with all of that information. That’s great for some people, frustrating for others. (Well, it’s been frustrating for all of us at some point or another.) If we’re doing good work lately, it’s really because we’ve gotten the chance to keep at it, and we’ve gotten a lot of good feedback on the things we have tried.\n\n"
    },
    {
      "time": " 25.Jul.2007 2.26am",
      "content": "Just out of interest I was wondering where, other than Reading (and the ECAL in Lausanne and Rietveld Academy in Amsterdam, where I read that Akkurat was mostly done) can you study type design?\n\n"
    },
    {
      "time": " 25.Jul.2007 4.10am",
      "content": "\\> ... Eric Olson ... withdrew from sales their typefaces from their first seven years of work. They evidently felt that after seven years of drawing type their products were on a higher level.\n\nJust as a point of clarification, and since this serves as a sort of public record, I want to point out that this is not entirely accurate.\n\nEric did withdraw typefaces from the market, but not everything from his first seven years of designing type. If that were the case, most of our retail library wouldn’t exist.\n\nI don’t think he would argue, though, that seven years of drawing type everyday hasn’t made him a better type designer.\n\n"
    },
    {
      "time": " 25.Jul.2007 4.29am",
      "content": "Thanks for the correction.\n\n"
    },
    {
      "time": " 25.Jul.2007 4.51am",
      "content": "\\> Just out of interest I was wondering where, other than Reading  \n\\>(and the ECAL in Lausanne and Rietveld Academy in Amsterdam, where  \n\\> I read that Akkurat was mostly done) can you study type design?\n\nin Germany at the HGB Leipzig under Prof. Fred Smeijers  \n [http://www.hgb-leipzig.de/index.php?WWW\\_HGB=9b910f0ccb639fe1be435dfdb985...](http://web.archive.org/web/20080825145402/http:/www.hgb-leipzig.de/index.php?WWW_HGB=9b910f0ccb639fe1be435dfdb985a063&a=person&b=mitarb&id=131&js=2& \"http://www.hgb-leipzig.de/index.php?WWW\\_HGB=9b910f0ccb639fe1be435dfdb985a063&a=person&b=mitarb&id=131&js=2&\")\n\n"
    },
    {
      "time": " 25.Jul.2007 5.13am",
      "content": "An apprenticeship/internship is an good option, if you can find one. I went through the Reading MA years ago, and now occasionally lecture and give design crit there, but I’ve also taught a few apprentices. I personally prefer the long-term apprenticeship method. However, an apprenticeship tends to mold your knowledge around that of your ’master’. If the ’master’ is someone like Robert Slimbach or Matthew Carter that is a very very good thing. But it can be rather one-sided, and the expertise and tasks you may learn may only cover a portion of the knowledge needed for an independent type designer. It can also sometimes hold you back if your growing design sense differs from your master’s.\n\nThe big benefit of a place like Reading is the breadth of voices speaking into your learning and work. I vividly remember times when Gerry would suggest I make this or that change, then have Gerard say the opposite! It forced me to understand _why_ they suggested what they did - their experience, knowledge, personal taste, etc. - and come up with my own sense of design purpose. Now I find myself being a third or fourth voice, and helping the students in my particular strengths.\n\nI designed type for 9 years before going to Reading, and the main reason I went was my own dissatisfaction with my work. I needed a stronger theoretical and historical foundation, and regular, expert review of my stumbling efforts. That is very possible through an internship, but just be sure that you still have a variety of voices around you.\n\n"
    },
    {
      "time": " 25.Jul.2007 5.32am",
      "content": "So — The general feedback is much the same really. There is no definitive way of reaching my goal other than through my own hard graft and reading/sketching etc – I need to find the most suitable route for myself.\n\nA Reading/comparitive college course would probably speed up my route into designing type – (via the full time course [only because I am fully focused for 12 months/expertise at hand etc]), as opposed to on and off after work/spare time for the next few years!\n\nI will endeavour to carry on with my own studies/reading etc, and if I still feel that I would benefit from being on the course in a year or so, I’ll make another decision then.\n\nThank you for all your help – greatly appreciated.\n\n"
    },
    {
      "time": " 25.Jul.2007 6.52am",
      "content": "Peter, seeing as how you don’t actually live that far from Reading, it wouldn’t hurt to see if the school will let you take a class or two that might help you with your type, and with your eventual decision about whether or not to get the MFA.\n\n"
    },
    {
      "time": " 25.Jul.2007 6.58am",
      "content": "Hi — Thanks – Yes I will endeavour to visit the college and try and have a chat with some pathway leaders as it were.\n\n"
    },
    {
      "time": " 25.Jul.2007 9.56am",
      "content": "\\>So you’re predicting an end to the popularity of script fonts, to be replaced by a large demand for “mature” multi-language text faces?\n\nSure, why not. I think the extremely clever scripty OpenType-aware designers who are “at the top of the game” right now will be displaced with something new once the market becomes saturated and making clever script fonts becomes automated. Not so sure that mature multi-lingual text faces will be what displaces them, but whatever it is the Reading Mafia will be involved.\n\nNot so sure it’s such a bold prediction didn’t we see that with the Dutch Mafia a few years back?\n\n"
    },
    {
      "time": " 25.Jul.2007 10.05am",
      "content": "Maybe the Redmond Mafia might though, Si :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Jul.2007 10.24am",
      "content": "_I think in five or ten years time when you look at active type designers, you’ll see that the Reading MA grads will make up a good portion of those at the top of the game._\n\nSo you’re predicting an end to the popularity of script fonts, to be replaced by a large demand for “mature” multi-language text faces?\n\nSure, why not.\n\nAre these even mutually exclusive? Just like applications grow more feature rich based on consumer demand, the demands for font technology will only rise. Users will be interested in highly automated, open-type loaded, multilingual faces that are suitable for text, but workable into display proportions. Super-superfamilies that extend beyond latin-based glyphs, that you can dial from historic to pomo, come after that. There may be some major innovations in font management interfaces that is required to permit that demand to blossom, but it will happen.\n\nAnd the people at Reading now _may_ then be those most qualified to lead the teams needed to design and implement typefaces of that scope.\n\n"
    },
    {
      "time": " 25.Jul.2007 11.16am",
      "content": "I recommend the Reading programme pretty unreservedly to anyone who works well in a structured learning environment. I’ve spent some time running a workshop there, have visited several times, know several years-worth of graduates, and I’m very impressed with the programme.\n\nI’m self-taught in type design, learning from doing and from books and from colleagues, and I’m very much aware that this is not an efficient method to learn the stuff I have had to learn. If you work well in a structured learning environment, with a pretty heavy workload including not only design but a research and writing component, can handle British institutional lunches and English weather, I think Reading is an excellent opportunity.\n\nSome other people on this list have suggested that an internship might be better, but I don’t see a lot of internships in type design: what I see is companies hiring Reading graduates (Hoefler & Frere-Jones, Porchez Typofonderie, DaltonMaag, Monotype, Linotype...)\n\n"
    },
    {
      "time": " 26.Jul.2007 7.37am",
      "content": "I think I may be echoing a my fellow class mates here, as this was an opportunity to concentrate on learning how to do this, wonderfully mysterious thing called type design for only a year of my life. Of course, I won’t feel like a type designer until I’ve worked on a variety of different projects, but definitely feel like I have the skills to go off on my own and explore further, and I hope to get a job in this field. Personally self-taught wouldn’t work for me, even with the all the reading I’ve done this year, the most valuable feedback has been from Gerry, Gerard Unger, Victor Gaultney and other lecturers all giving their own unique perspectives. The very fact you’re doing it every day, tunes your eyes into the details. Despite my graphic design background, I felt I was starting afresh, which was terrifying, but inspiring at the same time.\n\nPlus don’t underestimate the opportunity to do a non-Latin! This year we had Greek, Cyrillic, Gujariti, Tamil and Devanagari, I really enjoyed tackling an unfamiliar script.\n\nIn the end, it comes down to self-discipline and access to willing and informed critics. Although the course requires mainly self-directed work, this would be easier to avoid in the real world with other projects on the go. Also having the receptive eyes and ears of the type designers we’ve had access to, may not be as easy as outside.\n\n"
    },
    {
      "time": " 26.Jul.2007 7.39am",
      "content": "Hey Alphapeta,\n\nIf you haven’t already, you should REALLY try to get to this years Typecon in Seattle because while thoughtful dialog on message boards is good, there is simply no substitute for the ’being there’ experience to get real input from many folks who share the same thoughts . . .\n\nStuart :D\n\n"
    },
    {
      "time": " 26.Jul.2007 9.30am",
      "content": "I think the [Atypi conference in Brighton](http://web.archive.org/web/20080825145402/http:/atypi.org/) is closer to Alphapeta, and he will probably see some Reading students and teachers there.\n\n"
    },
    {
      "time": " 26.Jul.2007 12.59pm",
      "content": "Spend a year working full time in a furniture warehouse. Be prepared for a lot of very heavy lifting. And even though you will get two breaks and a lunch, you will still be very tired at the end of the day. True, nobody will understand it as a sensible career move, but it will provide you with the confidence necessary to undertake type design.\n\n"
    },
    {
      "time": " 26.Jul.2007 1.28pm",
      "content": "My feelings about the Reading program are very much like John Hudson’s, stemming from a similar range of interactions as a guest speaker as well as encountering Reading folks during and after their program. It certainly isn’t the only way to learn type design, but if you do well in a structured learning environment, it is probably one of the best.\n\nIt is also great in that it gives you an opportunity to develop a broad range of skills, both aesthetic/design and more technical.\n\nAlso, you can add Adobe to the list of companies who have hired recent Reading grads. IIRC, three of the final five candidates for that position were Reading grads (and one went to KABK).\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 27.Jul.2007 4.34am",
      "content": "Hi, thanks for the feedback again – I have been to many type conferences in London, including many at St Brides, which were always great, (I will try and make it to the Atypi at Brighton). They are all very informative and very interesting, but I’m not sure how much it will aid me in the long run.\n\nWith regards to an internship – very difficult to get by on – therein make enough money to exist! I’ve been to see Sebastien Lester at Monotype, Dalton Maag, The Foundry, Jeremy Tankard, I got offered some work at Barnbrooks studio a couple of years back, but unfortunately they cannot usually afford to take on an intern inclusive of pay for much time because they are so busy themselves and don’t really have the time.\n\nOutside of this it is my own hard work and graft granted, but I think especially within the field of type design, where having to learn the technique of drawing letterforms is integral to the work (as opposed to Graphic Design and Typography which are more instinctive/personally expressive to an extent, regardless of ’rules’). I would relish the environment of somewhere like Reading, it’s not just the teaching at Reading, it’s the network of similar minded students which you are less likely to find on other graphic design/typography courses – (even within my own group at St Martins, there was only one other student with an interest in type design).\n\n"
    },
    {
      "time": " 28.Jul.2007 4.59am",
      "content": "\\> they cannot usually afford to take on an intern inclusive of pay for much time because they are so busy themselves and don’t really have the time.\n\nThat implies but doesn’t state what I think of as the “real problem” with internships, which is that the learning curve is so lengthy that we think a three to six-month period would be lucky to break even for Adobe - if we weren’t paying anything. Add a salary to the mix and it’s probably nine months to a year before the internship is a net benefit to us.\n\nAt least, that’s what I remember coming up with as rough estimates the last time David Lemon and I briefly kicked the idea around.\n\nNow, that’s assuming the person is not yet at the skill level where we’d hire them if we had an opening. If somebody wanted to intern who was coming in with Miguel’s level of skills, that might be different. But if they’re that good, they’ll probably be able to find a real job, and I’d feel bad about exploiting them as an intern....\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 28.Jul.2007 8.15am",
      "content": "Thomas hits the point squarely. A few years back, we used to hire interns from design schools. The problem was, by the time you had them trained well enough to help you, they were gone. The other end is, the time you spent training them was time you could not spend doing work so if you were in a crunch, they likely sat around bored until you met your deadline. It was tough meeting your mentoring obligation while making your deadlines. The interns that showed the most initiative and who were self-starters tended to get the most attention. Those who sat quietly, rarely got as much attention as the self-starters. The message is, if you are not given enough to do, do something on your own as a learning problem and ask for a quick crit. The other message is that design is a business that has to complete work to prosper. You have to be on the plus side, not the minus side, in your efforts as an intern. This is not easy and takes determination and team spirit.\n\nChrisL\n\n"
    }
  ]
}
