{
  "id": "35393",
  "title": "You design beautiful typefaces, and then this...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "De Standaard -- one of the quality newspapers here in Flanders/Belgium – unveiled its new design three months ago. The typefaces used all are The Font Bureau, Inc. fonts: Miller Daily, Benton Sans and Escrow. I already noticed it back when the new style premiered, but it recently struck me again how badly those otherwise perfectly fine faces are mistreated. Read the entry on [Unzipped](http://web.archive.org/web/20131108172640/http:/www.fontshop.be/details.php?entry=179) and feel free to comment (preferably in the blog itself).\n\n",
  "author": "Bald Condensed",
  "time": "24 Jul 2007 — 8:29am",
  "uid": "110",
  "comments": [
    {
      "time": "24 Jul 2007 — 9:08am",
      "content": "The best tools in the wrong hands are bound to fail.\n\nChrisL\n\n"
    },
    {
      "time": "24 Jul 2007 — 9:31am",
      "content": "i really enjoy your type analyses on your blog. this is a great one.  \ni also got a lot out of your look at music typography a while back.\n\n"
    },
    {
      "time": "24 Jul 2007 — 9:34am",
      "content": "Yves, I just posted there.\n\nIt looks like the designers are wrestling with the pagination system, so it would be unfair to blame them for circumstances which are beyond their control.\n\nFor instance, I suspect that the pagination system sets the word space value, which may account for the excessive word spacing in some heads, if their editor has asked for plenty of word space in the body text. Similarly, if the pagination system places restrictions on the number of kern pairs, then some will go missing.\n\nThese are issues for the paper's designers to sort out with their IT department, the editor, the publisher, and the pagination system supplier -- it may take a while. At least they have progressed to the next level by implementing fonts where these kinds of subtle typographic distinctions are relevant!\n\n"
    },
    {
      "time": "24 Jul 2007 — 9:40am",
      "content": "the papers at which i've designed used scitex and harris systems, and you're right -- they can be pretty funky at times.  \nbut i think that several months in, at least some of the glaring issues should have been addressed unless someone either _doesn't see it_ or, worse _doesn't think it matters._ both can sometimes be true at newspapers.\n\n"
    }
  ]
}
