{
  "id": "35406",
  "title": "What about this one from Harper's ?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "What about this one from Harper's\n\n\"The Numbing of the American Mind\"\n\n ![](http://web.archive.org/web/20131107234721im_/http:/typophile.com/files/P1000844_6566.JPG)\n\n",
  "author": "Mak",
  "time": "24 Jul 2007 — 3:44pm",
  "uid": "9805",
  "comments": [
    {
      "time": "24 Jul 2007 — 3:49pm",
      "content": "Can’t see an image.\n\n"
    },
    {
      "time": "24 Jul 2007 — 3:52pm",
      "content": "its up now  \nsorry\n\n"
    },
    {
      "time": "24 Jul 2007 — 4:09pm",
      "content": "Caslon.\n\n"
    },
    {
      "time": "24 Jul 2007 — 4:17pm",
      "content": "[Caslon Graphique](http://web.archive.org/web/20131107234721/http:/www.fontshop.com/fonts/singles/urw/caslon_graphique_ot_std/&sample_text=AMER&sample_size=96) perhaps.\n\n"
    },
    {
      "time": "24 Jul 2007 — 4:19pm",
      "content": "Hm.\n\nCaslon 224 is the closest I can think of.  \nBut it’s not quite it.\n\n"
    },
    {
      "time": "24 Jul 2007 — 4:26pm",
      "content": "[ITC Caslon 224](http://web.archive.org/web/20131107234721/http:/www.fontshop.com/fonts/singles/monotype/itc_caslon_no_224_std_black/&sample_text=AMER&sample_size=96) is slightly less contrasty than Graphique, so Graphique is still a better match.\n\n"
    },
    {
      "time": "24 Jul 2007 — 5:06pm",
      "content": "yeah it looks a lot closer to Graphique but slightly not as tall\n\n"
    },
    {
      "time": "24 Jul 2007 — 7:56pm",
      "content": "I don't see why it can't be ITC Caslon No. 224. The sample looks like that face to me, and there's a good circumstantial case for it, too.\n\nSam Antupit (1932-2003) redesigned Harper's in 1984, right after Lewis Lapham took over as editor. Lapham is still involved with the magazine, and they still follow Antupit's basic design. [At least as far as I can remember — I was a subscriber then and was very impressed with the new look.]\n\nWhat was available to Antupit then? Ed Benguiat designed ITC Caslon No. 224 in '83, so it was very current. It was also not designed as a digital typeface. We shouldn't assume that Harper's is using a later digital version, which is what the type foundry websites show. Couldn't they be using the original version of the ITC face, or even a customized display version that Benguiat did for them?\n\nI don't know enough about the magazine business to definitely answer these questions, but maybe they just held on to archaic production methods as well as the '83 redesign. Harper's almost went out of business in 1980 and was rescued by philanthropists who established a charitable foundation to operate the magazine. They just may not have the bucks to overhaul design and production. [Not that I think they need to.]\n\nO.K., it's late, and I still need to check out awfulplasticsurgery.com before I go to bed.\n\nTheir website lists Stacey D. Clarkson as the current AD, but I couldn't see a way to send her an e-mail. Coles, call her up!\n\n"
    }
  ]
}
