{
  "id": "3540",
  "title": "Limited-Edition Indie Fonts Book",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "F O R I M M E D I A T E R E L E A S E   \n   \nTypeco announces the limited-edition Indie Fonts book.   \n   \nTypeco is selling a special limited-edition of Indie Fonts (100 copies) signed by the designer and co-editor, James Grieshaber. If you would like a signed copy of this book send us a check for $39.95 + $5.00 S&H in the USA for each copy you want to: Typeco, PO Box 10661, Rochester, NY 14610. For shipping outside the USA, please request a price quote by e-mail at [work@typeco.com](mailto:work@typeco.com) before sending payment.   \n   \nIndie Fonts is designed and co-edited by James Grieshaber of Typeco. Indie Fonts brings together 18 independent font foundries from around the world creating an invaluable resource of over 2000 fonts for designers, art directors and typographers.   \n   \nThis hard-bound book is divided up by foundry so that the user can get a feel for the work produced by each group. This also makes it convenient to order fonts directly from their source. To make it easier for the user of this book, a visual font index is provided in the front for quick scanning. There is also a fully cross referenced index in the back of font names, designers, and original designers.   \n   \nContributing foundries include Altered Ego, Astigmatic, Carter & Cone, Chank, Font Diner, fontBoy, Fountain, GarageFonts, International House of Fonts, LettError, P22, Psy/Ops, SynFonts, Test Pilot Collective, Typebox, Typeco, Typodermic and Typotheque.   \n   \nAccompanying this book is a Bonus Fonts CD-ROM that contains 33 indie fonts on an unlocked disc located in a sealed package in the back of this book. The fonts are licensed from each contributing foundry for use solely by the owner of this book.   \n   \nContact info:   \nTypeco   \nPO Box 10661   \nRochester, NY 14610   \nPhone: 585.230.1674   \nEmail: [work@typeco.com](mailto:work@typeco.com)   \nWeb: [http://www.typeco.com](http://web.archive.org/web/20131020085527/http:/www.typeco.com/)\n\n",
  "author": "James Grieshaber",
  "time": "10 Oct 2002 — 1:02pm",
  "uid": "633",
  "comments": [
    {
      "time": "17 Dec 2002 — 7:47am",
      "content": "I've just posted [a review](http://web.archive.org/web/20131020085527/http:/typographi.ca/2002_12_17.php#000357) of Indie Fonts at Typographica.\n\n"
    }
  ]
}
