{
  "id": "35411",
  "title": "font management?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A friend told me that Font Book messes up your ram. Any recommendations for a good typeface management program?\n\n",
  "author": "evilfansanfran",
  "time": "25 Jul 2007 — 12:04am",
  "uid": "8034",
  "comments": [
    {
      "time": "25 Jul 2007 — 12:34am",
      "content": "FontExplorer from Linotype. It’s free.  \n [http://www.linotype.com/fontexplorerX](http://web.archive.org/web/20131010194947/http:/www.linotype.com/fontexplorerX \"http://www.linotype.com/fontexplorerX\")?\n\nPieter\n\n"
    },
    {
      "time": "26 Jul 2007 — 1:54pm",
      "content": "For Pc try font reserve\n\nHéctor\n\n"
    },
    {
      "time": "26 Jul 2007 — 7:03pm",
      "content": "Another vote for FontExplorer. Best thing since ATM Deluxe.\n\npbc\n\n"
    },
    {
      "time": "26 Jul 2007 — 7:35pm",
      "content": "I love FontExplorer too.\n\n"
    },
    {
      "time": "27 Jul 2007 — 9:17am",
      "content": "I'll chime in for Font Explorer as well -- and not just because the price is right. ;-)\n\n"
    },
    {
      "time": "27 Jul 2007 — 1:18pm",
      "content": "Please give reasons. I've been using Suitcase for years. I did stray when Adobe had ATM - which was great. But they never updated it for System 10.\n\nToday I tried FontExplorer - and I am so sad I did. I've lost several hours of work, while it had a font conflict between a job I did a month ago in Quark 7.02 and ITC Kabel and the system font Chicago. It took many, many hours -- starting, restarting, killing preferences, removing XTensions - till I could figure out the problem.\n\nAnd that I have not had before with Suitcase. But what ever the damage was -- Suitcase also felt the pain....\n\n"
    },
    {
      "time": "5 Aug 2007 — 4:27am",
      "content": "Please Help.\n\nI have the older Microsoft Office on my G5 and it use to work fine...\n\nI tried the Font Explorer (because of this thread) and several programs went nutsy on me. I finally have Suitcase back in play, but when I go to Microsoft Word - it quits out in seconds. The error report says Error Signature\n\nI have uninstalled - used \"Remove Office\" -- removed everything possible - and reinstalled. Powerpoint is fine. But not Word - and well, I hate to sound like a crybaby -- but I have a need for Word (right now) -- I'm about to edit the articles that have arrived for our Oct/Sep issue of the magazine...\n\nDoes anyone have any idea what I can do to get Word to work again?\n\nAnd I am writing it here - because it was fine till I installed and try to use Font Explorer....\n\n"
    },
    {
      "time": "7 Aug 2007 — 1:37am",
      "content": "Sounds like a system reinstall will be required, but have you tried some manual cleaning up of standard font folders like /library/fonts? It doesn't really sound like FontExplorer's fault ... I hope not, anyway!\n\n"
    },
    {
      "time": "7 Aug 2007 — 2:05am",
      "content": "Sounds like a system reinstall will be required, but have you tried some manual cleaning up of standard font folders like /library/fonts? It doesn't really sound like FontExplorer's fault ... I hope not, anyway! Does Word Mac have safe mode? I always run Win Mac in safe mode because it's otherwise too slow -- no idea why. Dreadful software!\n\n"
    },
    {
      "time": "7 Aug 2007 — 4:57am",
      "content": "Hi Bill,\n\nThank for trying I have removed many things from the folder - maybe system cleaning will do it. Thanks for the advice, when I have a free 5 hours - I'll get around to it. Meanwhile, I've re-fired up the G4 which has my Word 95 for Mac on it...I'm too scared to update it until my job is finished....\n\nIf anyone else has an idea to share, please let me know.\n\nThank you.\n\n"
    },
    {
      "time": "7 Aug 2007 — 12:12pm",
      "content": "Dear Bill Troop\n\nTHANK YOU. I am shouting it as loud as I can. It only took 40 minutes to reinstall \"clean\" and I can use my editing program once again. I just can't say thank you enough for calmly seeking the simple solution needed.\n\nTHANK YOU. I want the public to know....  \n:-)\n\nJackie\n\n"
    },
    {
      "time": "7 Aug 2007 — 12:32pm",
      "content": "I might have started smiling too soon.\n\nQuarkXPress won't open now......... boo hooooooooooo\n\n"
    },
    {
      "time": "8 Aug 2007 — 4:29am",
      "content": "Got Quark back. Seems it has for System =- QuarkXPress Components - just a click away from it re-installing all the stuff needed in the System folder - and Quark works fine.\n\nIf you are on Quark - there is a new one to be downloaded - Quark 7.3.\n\n"
    },
    {
      "time": "9 Aug 2007 — 12:53pm",
      "content": "After all that trouble - I just received this email from QuarkXPress\n\nDear Jackie,\n\nThank you for contacting Quark Crash Help Support.\n\nThe issue you are facing is seems to be arising due to a third party XTension named FontExplorer X for XPress 7.0.xnt.  \nPlease disable the same and then try to replicate the issue.  \nIf that resolves the issue I would request you to reinstall the XTension  \nI would also request you to share the document you are working on and also the corrupted XTension before you remove it, for the testing purpose\n\nWarm regards,\n\n\\*\\*\\*\\*\\*\\*\\*\n\nI wish I had known that extension was in there - I probably just needed to remove it and it would have saved me many a headache....\n\n"
    },
    {
      "time": "9 Aug 2007 — 1:04pm",
      "content": "Based on previous experience, I'd have to say that the blame lays with Quark rather than FontExplorer. That might not be the case, but when all else fails, blame Quark :)\n\nBy the way, FontExplorer is now freely available for PC as well.\n\n"
    },
    {
      "time": "10 Aug 2007 — 8:44am",
      "content": "\\>Based on previous experience\n\nThere speaks someone with less experience of pre-OSX macs, if you encountered a problem the first thing to do was restart with the extensions switched off. Oh how things have advanced :)\n\nTim\n\n"
    },
    {
      "time": "10 Aug 2007 — 10:11am",
      "content": "Yeah. Ehe. Restart, only after you tossed the system prefs. Upon restart don't forget to zap the pram and rebuild the desktop. I seriously do not miss those days.\n\n"
    },
    {
      "time": "12 Aug 2007 — 7:39pm",
      "content": "I tried FontExplorer on a PC, with default settings. It went through my font storage folder (not windows/fonts) and decompressed all of my zipped font files. I had to restore from cd. For my tastes it is overactive and uninstalling it does not undo the changes it makes to your files.\n\n"
    },
    {
      "time": "12 Aug 2007 — 8:39pm",
      "content": "Oh, FontExplorer for the PC deleted some of my system fonts so I had boxes where the type should be on everything. I had to do a system restore using my husband's computer as a reference to tell where the dialog boxes were. Fortunately, it worked.\n\nI'm sticking with Typograf!!\n\nSharon\n\n"
    }
  ]
}
