{
  "id": "35413",
  "title": "Which is the best font format to purchase?",
  "forum": "Type ID Board",
  "tags": [
    "General Discussions",
    "Type ID Board"
  ],
  "content": "Hi,  \nThis is my first post here so please excuse me if this question has been asked before. I have the job of purchasing a font library for our Repro. department, the question is \" Which is the best suited for a Repro department, Open Type or Postscript? \"\n\nThanks in advance.\n\n",
  "author": "chilky",
  "time": "25 Jul 2007 — 1:19am",
  "uid": "19890",
  "comments": [
    {
      "time": "25 Jul 2007 — 2:07am",
      "content": "I've been told that the days of RIPs that require PostScript are over and that most printers made in the last few years can handle other formats just fine. If that's the case, the only thing preventing you from using OpenType is if you're not using Adobe CS and you need to get to small caps and other extra glyphs.\n\nBy and large, if you want to avoid support headaches, OpenType is the cleanest way to go.\n\n"
    },
    {
      "time": "25 Jul 2007 — 4:04am",
      "content": "I agree with Stephen. OpenType is fully compatible with MAC/PC, it has a very extended charset and (in my epxerience) chars are rendered much better on PC's monitor. Therefore:\n\n1 OpenType (if it is available for the font/family);  \n2 PostScript;  \n3 TrueType.\n\n"
    },
    {
      "time": "25 Jul 2007 — 5:12am",
      "content": "Thanks for that,  \nThese fonts will be used in a mainly Mac environment with CS2, CS3 and Quark 6 & 7. The rips are reasonably up to date so hopefully there should be no problem there.  \nWe were looking at purchasing The Adobe Type Collection (Open Type Edition) and the Monotype Library, so as you can imagine it's a big investment to make when there are several choices available.\n\nRegards\n\n"
    },
    {
      "time": "25 Jul 2007 — 8:05am",
      "content": "OpenType is the only way to go and I highly recommend it. InD supports OpenType more and more as you get to the current CS3 revision. Quark 6 will allow use of OpenType fonts with the same functionality as the old Type 1 fonts but new OpenType features are not supported until you get to Quark 7 or later. Quark 7 does not support Stylistic Sets though. As an investment, buying Type 1 fonts are sort of like buying VHS instead of DVD movies. They will work as long as you have the equipment (as is certainly the case now) but are limited in features and an unknown for future systems and software. There certainly is no advantage in Type 1 fonts, that is for sure.  \nSoTA members and TypeCon attendees will receive a copy of the soon to be printed \"Interrobang\" journal with a lengthy article about OpenType fonts. If you are not already a member of SoTA, you might think about joining.\n\n[http://www.typesociety.org/](http://web.archive.org/web/20130327141348/http:/www.typesociety.org/ \"http://www.typesociety.org/\")\n\nChrisL\n\n"
    },
    {
      "time": "27 Jul 2007 — 7:48am",
      "content": "Thanks very much for your opinions. At least that puts my mind at rest before shelling out a few thousand pounds.\n\nRegards\n\n"
    },
    {
      "time": "27 Jul 2007 — 8:06am",
      "content": "When some users first encounter the more advanced features of OpenType, they sometimes worry that these are vendor-specific technologies or that these features could end up in an evolutionary cul-de-sac, like Multiple Masters. A great deal of this technology, however, was created by the major platform vendors to accommodate different languages. As such, these are core components that will be in use for the foreseeable future. Buying high-quality OpenType fonts now could be compared to buying a Type 1 font in 1990. It's going to be the format of choice for at least the next decade, and application support will only get better over time.\n\n"
    }
  ]
}
