{
  "id": "35436",
  "title": "MAQ",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello again,\n\nMAQ is a company that is going to start giving out certificates for nurses and other people in the medical field. The certificate is for treatment/handling of prescription drugs, dosage and things like that for patients.\n\nThey take a test and if they pass they get a certificate that shows they are capable of handling prescription drugs.\n\nAnyway, I sort of mentioned the first idea that popped into my head to the client. That perhaps some version of the round stamp/seal that you usually see on old certificates, could be a nice logo. She really liked it for some reason but I hadn’t really thought through how that would look exactly.\n\nSo the first versions I drew is suppose to remind one of the stamp.\n\nI would like to hear your opinions about the feather pen and the leaf. The pen would relate to the signing of the certificate making it official. The leaf would stand for growth and education. Is it to far of a reach or do you think this idea could work?\n\nThese sketches are pretty rough.\n\nPeter\n\n ![](http://web.archive.org/web/20081007161002im_/http:/www.typophile.com/files/maq_concepts_4928.jpg)\n\n [‹ Need some kerning assistance](http://web.archive.org/web/20081007161002/http:/www.typophile.com/node/36558 \"Go to previous forum topic\") [Logo Design for web publishing outfit. ›](http://web.archive.org/web/20081007161002/http:/www.typophile.com/node/36014 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007161002/http://www.typophile.com/user/17519\" title=\"View user profile.\">kattttor</a>",
  "time": "<br>",
  "uid": "17519",
  "comments": [
    {
      "time": " 25.Jul.2007 2.01pm",
      "content": "I know that number six looks like an alien with a cross on its forehead.\n\n"
    },
    {
      "time": " 25.Jul.2007 5.33pm",
      "content": "I think that of them, the leaf/feather is definitely the most beautiful... but of all of them it seems the least related to certificates + prescription drugs - but keep it for some sort of eco-minded literature company. :D\n\nUnfortunately I’m not familiar with the certificates that you’re referring to (and referencing here) - so I can’t say how much they would or wouldn’t remind me of those.\n\nAlso, it’s also not entirely clear to me why some of them (2,5) have the little green “collar” at the bottom of the ring.\n\nThe leaf/feather is great though. It just doesn’t seem to suggest medicine.\n\nC\n\n"
    },
    {
      "time": " 26.Jul.2007 1.55am",
      "content": "Thanks, the round ones have a tree in them so the green collar is the trunk (2 and 5), it shouldn’t be green though but I’m just testing.\n\nI’ll think that I will try to go more towards medicine and drugs. I still would like it to have a natural feel to it.\n\nI’ll be back.\n\npeter\n\n"
    },
    {
      "time": " 30.Jul.2007 8.23pm",
      "content": "I understand that the leaf and feather may not be right for this job, but I really like your drawing. It is very appealing.\n\nSharon\n\n"
    },
    {
      "time": " 31.Jul.2007 2.05pm",
      "content": "The feather/leaf icon is kinda interesting, not really for medicine. In addition I think you have to make the leaf a tad bit smaller. The size relation is off.\n\nAs for the rest of the stamp idea. I don’t think they read as certificate stamps. #4 looks like a cross/hill and sunrise. #2 could work, but I don’t understand the little green collar. #3 seems busy and to abstract. #5 I just don’t like. It looks heavy. #6 you said it...alien like. You gotta keep in mind how this will work in black/white. #2 works the best out of all them.\n\nThe visual I saw when you mentioned the stamp on an old certificate seemed more organic, not so polished. Just some thoughts.\n\n[www.holadesignstudio.com](http://web.archive.org/web/20081007161002/http:/www.holadesignstudio.com/ \"www.holadesignstudio.com\")\n\n"
    },
    {
      "time": " 1.Aug.2007 1.44pm",
      "content": "I’m scrapping the stamp/seal idea. I don’t think it’s going to work.\n\nA note on the name.\n\nMAQ is not going to be the name of the company. MAQ is the name of the research project that will set the base for the company. The real company name is still secret.\n\nIn this version I’ve replace the name with another word that has the right first and last letter of the real name.\n\nSo this is what I’m thinking now. The squares and the ball in the middle is supposed to symbolize the five Scandinavian countries that this company will cooperate with. The ball being Finland and the rest Sweden, Norway, Denmark and Iceland.\n\nFound a type that I think will work FF Sanuk.\n\nI want it to be a little stiff and not too organic like my first drafts. Also calculating drugs involves a lot of math and the test is basically a medical math test.\n\nHaven’t picked any colors yet or done nay kerning.\n\nThis is by far my most difficult logo work so far.\n\n ![](http://web.archive.org/web/20081007161002im_/http:/www.typophile.com/files/maq_logo_v1_3464.jpg)\n\nfeedback appreciated  \npeter\n\n"
    },
    {
      "time": " 3.Aug.2007 10.39am",
      "content": "Wow, out of those two, I like the first one better. I think that if you are trying to represent all the Scandinavian countries being in cooperation, they should definitely be connected. It also reminds me a little of all the plastic breakaway attachments and covers on medical sterile medical equipnemt.\n\nAs for the type, I’m having a problem with the “R”. All the other letters have straight lines in them, and the Rs are curved on the tail. I know you are keeping the company name secret, but if we saw what the word really looked like, I think we could judge better.\n\nAs for colors, I would recommend blue and white, definitely. Maybe with a tiny bit of red.\n\n-Andrew Welfle\n\n"
    },
    {
      "time": " 4.Aug.2007 7.44am",
      "content": "The people that I’m making this for is on vacation at the moment and won’t be back for another week. They can’t keep the name secret forever they have to register it eventually. The real name does contain two r’s though.\n\nAlso the real name is shorter and it looks better with the graphic then this does.\n\nI’m not sure if they will like this idea at all. They are highly educated people so don’t know how they will see this.\n\nRight now I don’t mind the R’s because I think they give something extra to the type and the graphic as a hole.\n\nGoing to try some color variations. Blue being on the Finnish flag might be a nice addition.\n\npeter\n\n"
    },
    {
      "time": " 9.Aug.2007 3.53pm",
      "content": "2-4 definitely has a more Scandinavian feel to them. In these versions I can’t use red because Norway, Denmark and Iceland uses red on their flags.\n\nStill trying to find something that would indicate certification, been unsuccessful so far.\n\nHaven’t done any kerning yet.\n\nfeedback welcome  \npeter\n\n ![](http://web.archive.org/web/20081007161002im_/http:/www.typophile.com/files/maq_logo_v2_4129.jpg)\n\n"
    },
    {
      "time": " 9.Aug.2007 4.36pm",
      "content": "Maybe a symbol that signifies completion, like a check mark or something similar.\n\nJust a thought,\n\nSharon\n\n"
    },
    {
      "time": " 10.Aug.2007 10.21am",
      "content": "Number four is the most polished. Though the blue outer ring is too heavy and the cross is too small. I think those adjustemtns would make the mark more dramatic.\n\n"
    },
    {
      "time": " 10.Aug.2007 11.50am",
      "content": "\\>Norway, Denmark and Iceland uses red on their flags\n\nIf you are concerned about that, surely the Swedish flag is a yellow cross on a blue field? I do get a nationalist feel from the symbol – not necessarily in a good way. I far preferred Sanuk as the typeface however I am not to keen on the larger P if they were all the same height the word could centre on the mark.\n\nTim\n\n"
    },
    {
      "time": " 10.Aug.2007 1.13pm",
      "content": "I’m not really convinced about any of these. I like the concept of the first one but I don’t like the versions I’ve done so far.\n\nYes the Swedish flag has yellow and blue but not white. If I put red and blue together it will come in such an order that it will directly look like a reference to the Norwegian, Danish or Icelandic flag.\n\nI don’t really get across with the medical theme in 2-4.\n\nThe real name is has two capitals in it. Like McDonald’s. The two capitals being P and C. That’s how they want it written.\n\nGonna try something else and see what I can come up with.\n\npeter\n\n"
    },
    {
      "time": " 10.Aug.2007 1.53pm",
      "content": "«They take a test and if they pass they get a certificate that shows they are capable of handling prescription drugs.»\n\nI tried to symbolize this sentence, and came up with that:\n\n ![](http://web.archive.org/web/20081007161002im_/http:/www.typophile.com/files/Logo_6318.jpg)\n\n"
    },
    {
      "time": " 10.Aug.2007 2.03pm",
      "content": "I have a problem with a cross and hands. Feels and looks too religious. Thanks for the suggestion though.\n\nNow I’m starting to see the nationalist part of my latest attempts. Getting some really bad white supremacy vibes. Put a circle around the first one and I almost got the Ku Klux Klan symbol.\n\npeter\n\n"
    },
    {
      "time": " 10.Aug.2007 2.36pm",
      "content": "For some reason I’m seeing more “battery” and less “help”. What if the cross was made to be visually the same weight as the hands?\n\n"
    },
    {
      "time": " 16.Aug.2007 1.14pm",
      "content": "this is my latest attempt.\n\nIn the middle there’s a reference to the Bowl Hygeia [http://en.wikipedia.org/wiki/Image:Bowl\\_hygeia.svg](http://web.archive.org/web/20081007161002/http:/en.wikipedia.org/wiki/Image:Bowl_hygeia.svg \"http://en.wikipedia.org/wiki/Image:Bowl\\_hygeia.svg\") which sometimes is used by pharmacy organizations. Then theres the five lines which is a reference to the five Scandinavian countries. Then some leaves to symbolize growth.\n\nI have a meeting tomorrow with the people I’m making this for. Think I’ll have to present this.\n\nThis is a pretty rough so far.\n\nFeedback greatly appreciated.\n\npeter\n\n ![](http://web.archive.org/web/20081007161002im_/http:/www.typophile.com/files/maq_logo_v3_3499.jpg)\n\n"
    },
    {
      "time": " 16.Aug.2007 3.52pm",
      "content": "Why did you get rid of the red cross?\n\n"
    },
    {
      "time": " 16.Aug.2007 4.25pm",
      "content": "Because I don’t think it will work.\n\n"
    },
    {
      "time": " 16.Aug.2007 4.45pm",
      "content": "The medical aspect is not clear... ... it has this rotary club feeling, which I like but with the red cross you could underline the medical help!\n\n"
    },
    {
      "time": " 16.Aug.2007 6.18pm",
      "content": "I noticed that the navy blue and gold doesn’t work for this graphic.\n\nAs for the cross I was the one pushing that idea to try and get the certificate seal idea out of the clients head. I shouldn’t have mentioned that to her. Every time I mention a cross they don’t sound very convinced. From the first meeting I got the feeling that they don’t want the logo to relate to anything medical, which is a little strange.\n\nI had the client on the phone the other day and I pitched this latest idea to her and I got nothing. I’m having some trouble getting an accurate idea of what they want. The only thing that she felt excited about was a certificate seal/stamp with tufts on it, feel like she was visualizing clip art and not a logo.\n\nSo now I’ve had my rant.\n\nTried replacing the ball with the cross and that works if I redo the leaves and maybe make some other changes but I don’t have time to do that before the meeting.\n\nAnyway I’m going in with this. It’s pretty far from finished but it will have to do. At least I’ll find out if I’m close or not.\n\npeter\n\n ![](http://web.archive.org/web/20081007161002im_/http:/www.typophile.com/files/maq_logo_v4_5101.jpg)\n\n"
    },
    {
      "time": " 17.Aug.2007 3.12am",
      "content": "They’re all very nice, I wish you good luck and let us know how it went.\n\n"
    },
    {
      "time": " 25.Aug.2007 12.03am",
      "content": "Well it did not go great.\n\nThey didn’t hate it but they didn’t like it either.\n\nThe Scandinavian countries idea is out the window. Their goal is to give certificates in the hole of Europe. Can’t really incorporate this into the logo either since it’s just a goal.\n\nI’m starting to think that they commissioned a logo too early. The name that is secret is not a future name like I was told in the beginning it’s just a unapproved proposition if it becomes a company which also is uncertain. They might also become an organization and then there will be some another name. The name MAQ will only stick as long as it’s a research project.\n\nThey don’t seem to want the symbol to relate to anything pharmaceutical. Right now I have no idea of what they want exactly. They said that they will show the logo to some people and get some feedback then get back to me in two weeks. I’ve made some written suggestion on where I would take the logo from now on.\n\nthanks for the feedback  \npeter\n\n"
    },
    {
      "time": " 25.Aug.2007 12.04am",
      "content": "Well this is back on now. I still don’t exactly know what they think of this idea. They’ve asked for a revised version and I have feedback from several people that they’ve asked including another graphic designer, which liked the basic idea of it.\n\nSo I’ll revise and see where I end up.\n\npeter\n\n"
    },
    {
      "time": " 26.Aug.2007 11.16am",
      "content": "This is where I’m at right now.\n\nI think it starts to feel more prescription drug like. IMO the bowl really stands well for that part. What do you think?\n\nTwo versions. One with a simple leaf and one with a striped leaf. The stripes would stand for EU or the countries they are going to cooperate with. The simple leaf would stand for professional growth.\n\nOne of the persons that gave feedback thought the earlier version was to ancient. He had an image of something more modern so I’m going that route at the moment.\n\nFeedback appreciated.  \npeter\n\n ![](http://web.archive.org/web/20081007161002im_/http:/www.typophile.com/files/maq_logo_v5_5405.jpg)\n\n"
    },
    {
      "time": " 26.Aug.2007 11.17am",
      "content": "no kerning done\n\n"
    },
    {
      "time": " 26.Aug.2007 11.26am",
      "content": "here’s another composition. Feels a little empty on the right side but I don’t know if another leaf would work.\n\n ![](http://web.archive.org/web/20081007161002im_/http:/www.typophile.com/files/maq_logo_v5_6185.1.jpg)\n\n"
    }
  ]
}
