{
  "id": "35445",
  "title": "What do you know about Myriad?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Ok, I'm looking forward learning about the characteristics of the Adobe Myriad® typeface, both looking at it as:\n\nI- A mutation in history of humanist typeface taking root in the work of Frutiger  \nII-Taking part in a turning point in typography by the use of a new technology  \n(Multiple Master)\n\nMyriad don't seems to be THE typeface of a revolution like Heletica or Univers were (let's not make a topic out of this) more the crossing of multiples events, creating let's say, a both generic but unique typeface.\n\nWhat I know about the Myriad Typeface is that it was created mostly by Robert Slimbach and Carol Twombly, that it was first release in 1992 under the Adobe Originals familly (in which the two designers have greatly contributed). I know also that it is a humanist sans serif font witch the fluidity reminded the human handscript. It's it organic structure that give the Myriad it's friendly look. Myriad as a humanist sans serif is based on the Adrian Frutiger eponymous font offert both a great lisibility in big and small scale as the Frutiger was created for signage purposes for the Charles de Gaulle Airport in France.\n\nOn the comparative image below, you can see a great similarity between the two typefaces. The first and second observation that I can do is that Myriad is a little bit more condensed that Frutiger and that some optical correction have been bringed to the letter legibility.\n\n ![](http://web.archive.org/web/20140424070635im_/http:/typophile.com/files/MyriadCompa_4182.jpg)\n\n ![](http://web.archive.org/web/20140424070635im_/http:/typophile.com/files/A_3574.jpg)\n\n ![](http://web.archive.org/web/20140424070635im_/http:/typophile.com/files/B_3795.jpg)\n\nI know that even it is not the first typeface generated in the multiple master technology (minion was?), it as been part of the first number of typefaces who where.\n\nBy structuring my research I thought that it should involve:\n\nI- A mutation in history of humanist typeface taking root in the work of Frutiger  \nI-a) The evolution of humanists fonts  \nI-b) The history of the Frutiger typeface  \nI-c) A logical evolution from the work of Robert Slimbach and Carol Twombly\n\nII- A turning point in typography by the use of new technology  \nII-a) The Multiple-Master technology  \nII-b) Turning point in typography\n\nWhat do you know about Myriad Typeface? do you know other aspect relevant to the typeface, or good books talking about it.\n\nWhich are the typeface or the topics, relevant to the study of Myriad?\n\nreferences:  \n [http://www.adobe.com/type/typedesign/slimbach.html](http://web.archive.org/web/20140424070635/http:/www.adobe.com/type/typedesign/slimbach.html \"http://www.adobe.com/type/typedesign/slimbach.html\")  \n [http://www.adobe.com/type/typedesign/twombly.html](http://web.archive.org/web/20140424070635/http:/www.adobe.com/type/typedesign/twombly.html \"http://www.adobe.com/type/typedesign/twombly.html\")  \n [http://www.adobe.com/type/opentype/T1\\_to\\_OTF\\_FAQ.htm](http://web.archive.org/web/20140424070635/http:/www.adobe.com/type/opentype/T1_to_OTF_FAQ.htm \"http://www.adobe.com/type/opentype/T1\\_to\\_OTF\\_FAQ.htm\")  \n [http://kb.adobe.com/selfservice/viewContent.do?externalId=328600&sliceId=1](http://web.archive.org/web/20140424070635/http:/kb.adobe.com/selfservice/viewContent.do?externalId=328600&sliceId=1 \"http://kb.adobe.com/selfservice/viewContent.do?externalId=328600&sliceId=1\")  \n [http://typophile.com/node/28658](http://web.archive.org/web/20140424070635/http:/typophile.com/node/28658 \"http://typophile.com/node/28658\")?  \n [http://www.adobe.com/type/adobe\\_originals.html](http://web.archive.org/web/20140424070635/http:/www.adobe.com/type/adobe_originals.html \"http://www.adobe.com/type/adobe\\_originals.html\")\n\n",
  "author": "mat.",
  "time": "26 Jul 2007 — 12:02am",
  "uid": "19859",
  "comments": [
    {
      "time": "26 Jul 2007 — 12:51am",
      "content": "Oh noes! You've got [Lucida Sans](http://web.archive.org/web/20140424070635/http:/www.fontshop.com/fonts/singles/monotype/lucida_sans_std_roman_ot/&sample_text=Myriad&sample_size=96) in your comparison illustrations, not [Myriad](http://web.archive.org/web/20140424070635/http:/www.fontshop.com/fonts/singles/monotype/myriad_pro_regular/&sample_text=Myriad&sample_size=96).\n\n"
    },
    {
      "time": "26 Jul 2007 — 1:44am",
      "content": "I CAN HAZ FONTZ LOLZ!!1!1!\n\nKTHX BYE!!\n\n"
    },
    {
      "time": "26 Jul 2007 — 6:12am",
      "content": "back to the drawing board... ;-)\n\n"
    },
    {
      "time": "26 Jul 2007 — 7:56am",
      "content": "Manipulation error...corrected. Thanks for the observation.  \nAny comments on the topic?\n\n"
    },
    {
      "time": "26 Jul 2007 — 7:58am",
      "content": "\\> You’ve got Lucida Sans in your comparison illustrations, not Myriad.\n\nEh, where? Are my eyes deceiving me?  \nThe images above do show Myriad and not Lucida Sans.\n\n"
    },
    {
      "time": "26 Jul 2007 — 8:18am",
      "content": "<cite>Any comments on the topic?</cite>\n\nI’m not sure what your topic is. You’ve posted a bunch of quasi-sentences that state the obvious, semi-randomly lumped into some semblance of paragraphs, followed by a few questions. Try writing an explanation of why you are doing this research (school, work, fun?), followed by what you are trying to learn or prove, and then run spellcheck and grammar check before posting it.\n\n"
    },
    {
      "time": "26 Jul 2007 — 8:28am",
      "content": "There's a dot-font article by John Berry called \"Neutral Type\" or similar that you should look up. Also a line of research might lead you to look at how naturally the Myriad forms render on screen at small sizes (in Adobe’s rasterizers), as opposed to Helvetica and similar grots that close up – largely unrelated to MM technology. The “a great signage font = great outlines for a screen font” link hasn’t had much comment (the small world of type criticism is still very much print-focused – note Arial and Comic Sans crits don’t mention on-screen qualities) but this would let you draw in other designs like Lucida ;-) and Verdana, and also look at Myriad’s (non)appearance on the iPod as Podium Sans.\n\n"
    },
    {
      "time": "26 Jul 2007 — 10:16am",
      "content": "_Eh, where? Are my eyes deceiving me?  \nThe images above do show Myriad and not Lucida Sans._\n\nMat edited his original post.\n\n"
    },
    {
      "time": "26 Jul 2007 — 11:03am",
      "content": "Hehe yes, just like I said earlier... 26.Jul.2007 7.56am\n\n--\n\nThanks for the insight Simon, the \"screen font\" in relation with \"a great signage font\"seems interesting.\n\nAs for the purpose of my research, my post lack an introduction part. I am preparing myself for a workshop in which we will be asked to make an alphabet. Myriad was presented as a good exemple of typeface. The objective will be to build letters by starting with calligraphy, which brings us to the humanists type approach. In a sentence: I wish to know better about the \"method of construction\" of the Myriad typeface. That's why I'm interested in both the historical part (where does the form come from) and the technological part (what's this type try to achieve, by which means)\n\nI'm sure my spelling isn't helping giving credibility to my subject \"jpad\"(let's just not make it a topic out of it), I assure you, this is also an issue to me. I'm sure we could have a great conversation in French. I hope theses clarifications will help you posting other relevant comment on the topic.\n\n"
    },
    {
      "time": "26 Jul 2007 — 11:37am",
      "content": "I think I remember reading that Slimbach originally did the condensed, Twombly the regular, and then they switched and revised one another's work, the goal being to make is more impersonal, less idiosyncratic. Personally, I like the condensed better...\n\n"
    },
    {
      "time": "26 Jul 2007 — 5:23pm",
      "content": "Matt, comment ça va?\n\nI don't think your preparation has much direct relevance to your task.  \nIf your alphabet will be a humanist sans, presumably you will be drawing it.  \nI doubt that Robert Slimbach traced Frutiger or Today when he made Myriad and Cronos, although those designs obviously inform his -- but he is an accomplished calligrapher and drafstman (Carol Twombly too.)  \nYou don't have the skills to design a typeface/alphabet by closely reinterpreting another -- Frutiger's Avenir (from Futura) is another example.  \nSo the only way you could get close to that kind of result would be tracing, which would be a bad idea, as, I believe, the whole point of the humanist approach is to work by hand and eye, rather than mechanically. (Man vs. Machine, rather than its original meaning, Man Vs. God.) It is the best way to avoid rote plagiarism, avoiding the trite veracity of the mechanical simulacrum.\n\nWhat you can do is to draw an original alphabet, without immediate reference to any other typeface, and then, when you have developed ideas on the kind of letter shapes and proportions your design will have, then and only then, refer to the font files of Myriad, Cronos, Auto, etc., to see how the glyphs have been refined with regards to parameters such as stem thickness, overshoot, sidebearing widths, terminal angles, etc.\n\nThe assumption is that you have absorbed and internalized enough typography to be able to \"work out\" (réalizer?) an original design, and squeezing it though your personal, hand-made process, will give it that originality and humanity.\n\nBit of a tangent: contestants in the Prix de Rome (French painting competition, late 18th century) were sequestered in a villa for a month, where they were required to paint a work in the history genre, with no reference material! Now there's a concept for reality TV.\n\n"
    },
    {
      "time": "26 Jul 2007 — 5:02pm",
      "content": "<cite>you can see a great similarity between the two typefaces</cite>\n\nSounds like a weasel word.\n\nMany people out there would also see a great similarity between Times and Garamond because they both have these spiky things at the ends.  \nOn the other hand, I assume most graphic designers could easily tell Frutiger and Myriad apart.\n\nYou should be more specific on that.\n\n"
    },
    {
      "time": "28 Jul 2007 — 10:27am",
      "content": "Thank you Nick,\n\nWe often see comparaison when it's time to analyse a typeface (the eye's article -n°63- about Helvetica is one exemple). Do you say it's a wrong reflex? or is it wrong, only in the case of humanists fonts? If it is soo, is there a way of learning something about theses typefaces or does it have to be a pure act of self-expression?\n\nIn architecture and in design in general, a research field look at the process of design. In an architecture contest this means looking less at the final object and more at the sketches and the notes and what surrounded the project. Would it be relevant to look at theses sketches in the case of typefaces. For what I know (and I could be wrong) there are no publication on the subject.\n\nI think your right about the preparation part, it's probably more important to practice the hand and the eye. Your exemple of Man vs. Machine represent perfectly the dichotomy here. Where a part of designer looked at the machine as the perfection needing the design to be aim at, humanists fonts look at differences and particularities as a good thing. In that sense, the subject could also be seen thought the lenses of the debate of general v.s. the particular.\n\nI still have to find information on the Myriad typeface but obviously will looking somewhere else. William Berkson (3 posts before), was writing about the process of designing Myriad by two persons (and the exchange during the process) resulting in a \"more impersonal, less idiosyncratic\" font. If it's true, it would probably be an interesting path as Myriad is seen as a more generic font even if it's a humanist one. Seeing also Myriad in relation with other humanistic typeface would probably inform us a little about the amount of the handmade, calligraphic original, wished to be kept in the process of «réaliser» a humanist typeface.\n\n"
    }
  ]
}
