{
  "id": "3545",
  "title": "Beer labels",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "OK let's talk about beer. What's your favorite beer label and why? select also some types or ornaments. How to make a beer has a visual better taste?   \nI think everyone has an opinion of beer right? So take a sip.   \nBest wishes.   \nHelder\n\n",
  "author": "helder araujo",
  "time": "11 Mar 2004 — 5:32am",
  "uid": "2740",
  "comments": [
    {
      "time": "11 Mar 2004 — 5:45am",
      "content": "[http://www.budvar.cz/index.html](http://web.archive.org/web/20131017020647/http:/www.budvar.cz/index.html) ![budvar](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28324.gif)\n\n"
    },
    {
      "time": "11 Mar 2004 — 5:47am",
      "content": "or even better   \n ![budvar](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28327.gif)\n\n"
    },
    {
      "time": "11 Mar 2004 — 6:00am",
      "content": "Perhaps [this](http://web.archive.org/web/20131017020647/http:/digilander.libero.it/eurobeerlc/) will refresh your memory. :-)\n\n"
    },
    {
      "time": "11 Mar 2004 — 6:21am",
      "content": "thanks ... my second favourite is Young's Waggledance since it uses Trebuchet.   \n   \n [http://www.youngs.co.uk/](http://web.archive.org/web/20131017020647/http:/www.youngs.co.uk/)   \n ![waggle](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28331.gif)\n\n"
    },
    {
      "time": "11 Mar 2004 — 6:32am",
      "content": "Isn't it sweet...   \n   \n ![tiger beer](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28335.jpg)\n\n"
    },
    {
      "time": "11 Mar 2004 — 6:56am",
      "content": "This isn't really beer per se, but their identity is awesome.   \n   \n ![](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28339.gif)\n\n"
    },
    {
      "time": "11 Mar 2004 — 7:04am",
      "content": "I fell in love with this one and felt compelled to take the empty home with me. The bottle shape and colour had an antiquated medicinal feel (not much unlike the contents) and the descreet label with that charming ligature finished the job.   \n   \nI know it's not beer, but the packaging for bombay saphire gin blows my tits off every time.   \n   \n   \n ![Winter Ale](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28342.jpg)\n\n"
    },
    {
      "time": "11 Mar 2004 — 8:19am",
      "content": "Now that's a topic I can contribute to. So this is my hometown beer label. The third one from top is also the actual label. I like the two older ones at the bottom best.   \n   \n [http://www.bierdeckelsammler.net/bier/buerghers.htm](http://web.archive.org/web/20131017020647/http:/www.bierdeckelsammler.net/bier/buerghers.htm)   \n   \nServus   \n   \nDominik   \n   \n ![](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28346.gif)\n\n"
    },
    {
      "time": "11 Mar 2004 — 8:42am",
      "content": "Here we go:   \n   \n ![](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28350.jpg)   \n   \n1. Anchor Steam. Reminds me of home. Tasty too.   \n2. Franziskaner. When in Munich, love the happy monk. (or when you have friends in Munich who visit).   \n3. And the grand prize in the bizarre category: Tilburgs Dutch Brown.   \n_Why yes, that is a perigrin falcon with a cauldron on his head, a manish insect body and a large pink   \ntongue between its legs, sitting in a chair while eating a naked person with crows flying out of   \ntheir butt. Dali's beer of choice I should think._      \n4. Not pictured. The designer in me likes the big Sapporo silver can. The beer drinker in me hates Sapporo.   \n   \nRandy\n\n"
    },
    {
      "time": "11 Mar 2004 — 8:56am",
      "content": "Thanks for the good thread Helder. Vincent, I've never heard of Waggledance. What's with the bees and the honey? [Boddingtons](http://web.archive.org/web/20131017020647/http:/www.nmk.co.za/products/beers/boddingtons.htm) (which we can get at our supermarket in Los Angeles) uses them as elements on their label too.\n\n"
    },
    {
      "time": "11 Mar 2004 — 9:13am",
      "content": "I didn't even know there was such a thing as Dutch brown ale, let alone with Bosch labels...where can I get that beer?\n\n"
    },
    {
      "time": "11 Mar 2004 — 9:15am",
      "content": "Possibly: \"Out of the strong came forth sweetness\" (from the Bible - was it about some bees who made their hive in the carcass of a dead lion?), an archetypal piece of irony which takes the rough edges off foodstuffs produced by men/industry.\n\n"
    },
    {
      "time": "11 Mar 2004 — 10:13am",
      "content": "Steve,   \n   \nIts in our local grocery. It looks like it may be an import to the US only. Its an ok beer. Nothing special about it other than the surreal label.   \n   \n [http://www.bavariahollandbeer.us/tilburgs.html](http://web.archive.org/web/20131017020647/http:/www.bavariahollandbeer.us/tilburgs.html)\n\n"
    },
    {
      "time": "11 Mar 2004 — 10:40am",
      "content": "Of course. Beer is what makes the posts really flow! :-)   \n   \n\\> your favorite beer label   \n   \nI think a beer label is one important thing, but its role in the bottle/can as a whole is an even more important thing. Take Suntory for example: not a remarkable label, but in the context of the can -an accurately modeled miniature keg- it's wonderful.   \n   \nOne of my most memorable labels was of a beer from Congo, called \"Ngok\". It has a nasty alligator on it - made me feel like I was lost in a jungle having my last beer (which made it taste much better than it really was). Another nice label was La Ballena (from Puerto Vallarta), where the label was shaped like a whale - and that beer only came in oversized bottles.   \n   \nBTW, there's a wonderful book you should get:   \n\"Labels of Distinction - Microbrewery Label Design\" by S Drate and T Olejar.   \nI bought it because one day I will redo my foundry identity based on inspiration from it.   \nHere's probably the most outlandish example (which will NOT be my inspiration :-).   \n   \n ![cochonne](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28355.jpg)   \n   \nAnd a classic lambic beer label:   \n   \n ![lambic](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28356.jpg)   \n   \nI love ovals, for some reason.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Mar 2004 — 1:15pm",
      "content": "Nick, I like the poetic reasoning better, but guess what? Honey is one of the ingredients:   \n   \n\"Waggledance\"   \n Named after a bee's motion to alert other bees to pollen.   \n A delicious golden ale with a superb honey aroma.   \n Maris Otter pale ale malt, torrefied barley, crystal malt and Fuggles and East Kent Goldings hops. Real Mexican honey and fermentation sugar - honey is added to the boil so there are no honey essences.\"   \n   \nIs there one of those face icon thingeys for a sheepish grin?\n\n"
    },
    {
      "time": "11 Mar 2004 — 8:48pm",
      "content": "Does this count?   \n   \n [http://www.atlanticbrewing.com/jpg/rtbeer2.jpg](http://web.archive.org/web/20131017020647/http:/www.atlanticbrewing.com/jpg/rtbeer2.jpg)   \n   \n:-)\n\n"
    },
    {
      "time": "11 Mar 2004 — 11:27pm",
      "content": "Hrant: do you like ovals even when they're a covered up scheme for making you drink cherry-flavoured beer?   \nI wants me a bacon-flavoured beer, everything a man could ask for in one smoky and salty and beery sip   \n   \nargh, I'm going away for a few days, I'd have loved this thread!   \n   \nHeineken and Becks are design classics, not necesarily for the graphics, but the feel of those bottles in you hand is excellent.\n\n"
    },
    {
      "time": "12 Mar 2004 — 3:18am",
      "content": "Which criteria do you have, when buying beer. The graphic design of the label, its typographic excellence or the taste of the beer itself?   \n   \nIn my (beer)conservative, bavarian attitude i'd say cherry flavoured beer is a \"no go\". It's about the same thing as using fake small caps or using the \"inch\"-sign instead of Guillemets. I'm pretty sure that we're taking this issue too serious where I live.   \n   \nServus   \n   \nDominik\n\n"
    },
    {
      "time": "12 Mar 2004 — 5:25am",
      "content": "The American Budweiser embosses its cans in the UK.. to make it seem up market. This is the same for Stella. Stella gives me a headache with our without the embossing. I never drink a beer more than once for its label. Back in the early ninties when Budweiser came to England they were charging\n\n"
    },
    {
      "time": "12 Mar 2004 — 6:02am",
      "content": "![beer](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28393.jpg)   \nThis is more a cultural icon than a great design - but that bottle is calling to me now.\n\n"
    },
    {
      "time": "12 Mar 2004 — 7:47am",
      "content": "Mmmm. Lambic.   \n   \nOh, one of my favorites: [Rogue Signature: Chef Morimoto's Hazelnut Ale](http://web.archive.org/web/20131017020647/http:/www.rogue.com/brews.html#MMh). Cool bottle (Iron Chef!), extremely good beer. It's got a lot of dark beer qualities, and a great, smooth chocolatey flavor. The bottles are silkscreened, and are 22 oz.   \n   \n(Sorry for the poor photo, they're hard to find! I'm not at home to snap a pic of the bottle we have.)\n\n"
    },
    {
      "time": "12 Mar 2004 — 7:50am",
      "content": "Here's a [link to the actual photo alone](http://web.archive.org/web/20131017020647/http:/www.rogue.com/images/MMHazelnut.jpg), which is much bigger.\n\n"
    },
    {
      "time": "12 Mar 2004 — 7:57am",
      "content": "Oh, one more: [this](http://web.archive.org/web/20131017020647/http:/www.stg.org/images/holiday_old/st.pats/guinness.gif) is 'total design' at its best.\n\n"
    },
    {
      "time": "12 Mar 2004 — 8:03am",
      "content": "Vincent, Your use of the word twee made me look to see where you are from. London, sure enough. When we occasionally buy beer, we buy Bellhaven or Boddingtons (mentioned earlier in this thread, first bought because I did like the label). A friend with dual citizenship who recently moved back to the states told us that the widgit\\* is laughed at there. Not being fortunate enough to have a \"Bunch of Grapes\" or \"Black Swan\" nearby we take what we can get.   \n   \n\\*Boddington's Draughtflow is a patentened in-can system consisting of\n\n"
    },
    {
      "time": "12 Mar 2004 — 8:27am",
      "content": "Mmmm, Guinness. Here's another one of my favs:   \n   \n ![](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28405.jpg)\n\n"
    },
    {
      "time": "12 Mar 2004 — 9:11am",
      "content": "Gotta roll with the hometown brew.   \n   \n ![](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28419.jpg)   \n   \n(not its current packaging!)   \n   \n ![](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28420.jpg)   \n   \nNote that (I believe) Chank has made the sign lettering into a typeface called Brain Gelt.\n\n"
    },
    {
      "time": "12 Mar 2004 — 9:29am",
      "content": "Kenn, Dominik: You really need to learn what lambic beer is about, guys.   \n   \nJohn, that font looks just like Downer's Brothers.   \n   \nTrivia question: what's Naomi Campbell's official beer?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Mar 2004 — 9:35am",
      "content": "John B, that beer can reminds me of an Ajax container. Either way, _I_ think it looks cool.\n\n"
    },
    {
      "time": "12 Mar 2004 — 9:46am",
      "content": "Daniel -- yeah, it's old school. These days there'd be a bevel at top and bottom.\n\n"
    },
    {
      "time": "12 Mar 2004 — 9:46am",
      "content": "M. Alice... I'm from Boston as in Massachusetts... I live in London... and Boddingtons is from Manchester (about 4.5 hour drive at ~90mph north of London) where my girl friend is going in a few hours to see her mum.   \n   \nI think Guinness invented the widget though.   \n   \nPyramid Apricot is always a summer favourite in Seattle but not available here down the old battlecruiser. Hoegaarden is available though.   \n   \nReal German beers are the best, especially when they shake the bottle and make them foam up the last bit.\n\n"
    },
    {
      "time": "12 Mar 2004 — 11:30am",
      "content": "Hrant, do they have breweries in Namibia?!   \nWhat about a transaction? You send me on of those lambic ones and I send you a good beer ;-).   \n   \nVincent, you're my man. Do you know of any beer labels using comic sans? BTW, you mean \"Weizen\" oder \"Wei\n\n"
    },
    {
      "time": "12 Mar 2004 — 1:39pm",
      "content": "Dominik, lambic beer only comes from Belgium (and only a certain valley in Belgium), so you're much closer to it than me! To be fair though lambic isn't really \"beer\" in the normal sense of the word - just like Westmalle Trippel (a regal brew if there ever was one) maybe isn't either.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Mar 2004 — 5:27pm",
      "content": "![](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28436.gif)   \n   \nI guess I shouldn't be lazy and do some research, but do the symbols on the staves serve any meaning on the hoegaarden label?   \n   \nI took a look at them the other day and was wondering...   \n   \nAndrew\n\n"
    },
    {
      "time": "12 Mar 2004 — 6:13pm",
      "content": "[SPORTZ BEER!](http://web.archive.org/web/20131017020647/http:/web.archive.org/web/20020605211405/http:/www.sportzhappens.com/)   \n   \n ![An American Classic](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28445.jpg)\n\n"
    },
    {
      "time": "12 Mar 2004 — 6:21pm",
      "content": "Another classic...   \n ![colt](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28449.gif) ![colt back](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28450.gif)\n\n"
    },
    {
      "time": "12 Mar 2004 — 6:31pm",
      "content": "\\> the symbols on the staves   \n   \nThe top-right one looks like a bishop's staff. The bottom-left looks exactly like what you use to beat the dust out of a carpet hanging over the balcony. Hmmm, maybe they mean god creates you out of dust and returns you to dust? ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "12 Mar 2004 — 7:59pm",
      "content": "Mates, there is some very good quality beer round these parts. Lots of microbreweries making some quality tipple. Monteiths is staple diet stuff, the golden is to die for. Their labels are great, unfortunately their site has poor quality images of them. The one s on the left are the 'core' beers, the ones on the right are the seasonals. I also think Sapporo has a wonderful design overall. It _feels good._   \n   \n ![](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28453.gif)\n\n"
    },
    {
      "time": "13 Mar 2004 — 10:01pm",
      "content": "A lot of nice Belgium examples at [http://www.ilmot.co.uk/Belgium.html](http://web.archive.org/web/20131017020647/http:/www.ilmot.co.uk/Belgium.html).   \n   \n(Belgium beer: yes!)   \n   \nFor example:   \n   \n ![cupido](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28503.jpg)\n\n"
    },
    {
      "time": "14 Mar 2004 — 9:18am",
      "content": "My favorite beer bottle label...   \n   \n ![](http://web.archive.org/web/20131017020647im_/http:/www.typophile.com/forums/messages/30/28535.jpg)   \n   \na blurry one...hic...\n\n"
    },
    {
      "time": "15 Mar 2004 — 10:29am",
      "content": "\\> Trivia question: what's Naomi Campbell's official beer?   \n   \nNo takers, eh? Negra Modelo.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Mar 2004 — 2:32pm",
      "content": "Hrant, I thougtht i'd have taken your question. Perhaps not in the sense you'd expected, but... .   \n   \nNever heard of \"Negra Modelo\" before, must be from the lambic-valley...   \n   \nServus   \n   \nDominik\n\n"
    },
    {
      "time": "15 Mar 2004 — 2:39pm",
      "content": "[http://www.gmodelo.com.mx/eng/marcas/negramodelo.html](http://web.archive.org/web/20131017020647/http:/www.gmodelo.com.mx/eng/marcas/negramodelo.html)   \nBut I prefer Bohemia - it's pretty unique.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Mar 2004 — 7:08pm",
      "content": "Both are delicious and creamy super beers. By the way, there is also the \"Caguama\" bottle in adittion to the Ballena one. Both contain a liter of beer.\n\n"
    }
  ]
}
