{
  "id": "35451",
  "title": "CS3 Indesign is the only logo in all caps. why???",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Why is it that, in the Adobe CS3 suite, indesign is the only logo in all caps? I know Indesign is one word and that if they did the letters for Adobe indesign there would be a conflict with illustrator. But still, why not just make it Id instead of ID?\n\n [‹ More type- and design-related t-shirts!](http://web.archive.org/web/20071109073944/http:/www.typophile.com/node/35514 \"Go to previous forum topic\") [Who pays for the font? And how to abide by license agreements. ›](http://web.archive.org/web/20071109073944/http:/www.typophile.com/node/35440 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071109073944/http://www.typophile.com/user/18759\" title=\"View user profile.\">zigavoo</a>",
  "time": "<br>",
  "uid": "18759",
  "comments": [
    {
      "time": " 26.Jul.2007 7.59am",
      "content": "The official spelling is “InDesign,” perhaps set with what Bringhurst calls “an extra helping of capitals” because indesign is a made-up word. Then again so is “Photoshop,” so who knows.\n\nEdit: also check out [InCopy](http://web.archive.org/web/20071109073944/http:/en.wikipedia.org/wiki/Adobe_incopy). whose icon also, arguably, contains a capital (albeit a small one, it’s hard to tell).\n\nDouble edit: Wait, you’re right. Shouldn’t the I in “Ai” be capped? And After Effects is “AE”...I can’t find the pattern either. Gah!\n\n"
    },
    {
      "time": " 26.Jul.2007 8.07am",
      "content": "It’s a brilliant marketing gimmick. Months after the release of the software, people are _still_ going on about the icons. Which is, somewhat surprisingly, more than I can say about the rest of CS3. I sort of assumed that the new Photoshop features and the new interface would at least be getting some nice attention, but maybe Adobe’s fast-paced release cycle is putting people off.\n\n"
    },
    {
      "time": " 26.Jul.2007 8.15am",
      "content": "The basic set of tools needed is so simple. I’m glad the apps are more stable now but I wish they had a lite suite with bare bones versions, something like Illustrator 3.X used to be.\n\n"
    },
    {
      "time": " 26.Jul.2007 8.22am",
      "content": "<cite>...I wish they had a lite suite with bare bones versions, something like Illustrator 3.X used to be.</cite>\n\nI still pine for my 386DX40mHz running Windows 3.x. Lately have been thinking about creating a parallels image of DOS 5 and Windows 3.11 with all the great old productivity apps of yesteryear.\n\n"
    },
    {
      "time": " 26.Jul.2007 8.26am",
      "content": "NOT all caps, but capital I and smallcap D. Don’t know why they did that, though… ; )\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 26.Jul.2007 9.02am",
      "content": "It took me a minute to see it, but I see it now. InDesign uses a small cap instead of lower-case. I’m guessing it’s because of the spelling.\n\n ![](http://web.archive.org/web/20071109073944im_/http:/www.typophile.com/files/cs3_in_dock_6222.png)\n\n"
    },
    {
      "time": " 26.Jul.2007 9.06am",
      "content": "If it is a word with a humpback it has a smallcap, if it is a single word it has a lowercase. Easy. I would guess for Illustrator they face readability issues and their test group didn’t like the idea of too vertical lines so they settled on the next best thing.\n\n"
    },
    {
      "time": " 26.Jul.2007 9.42am",
      "content": "Maybe they wanted us to think Eye Dee and not id.\n\nSharon\n\n"
    },
    {
      "time": " 26.Jul.2007 11.48am",
      "content": "Hey Brad, how come you don’t have those icons in alphabetic order? (I do.) ; )\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 26.Jul.2007 11.57pm",
      "content": "FWIW: Lightroom also uses SmallCaps:\n\n ![](http://web.archive.org/web/20071109073944im_/http:/www.typophile.com/files/adobe_5785.gif)\n\n"
    },
    {
      "time": " 27.Jul.2007 8.03am",
      "content": "overall i really really like the new icon suite. makes telling the files apart with small icons active really simple. but i wish they’d been more proactive about consistency.\n\npretty clear they didn’t use a smallcaps I because someone thought it’d look like a lowercase l, never mind that flash has an example of what one would look like.\n\nillustrator’s also the only one of the suite to use “adobe” in the abbreviation.\n\nwhy do device central, flash video encoder, and acrobat have actual icons?\n\nmakes no sense.\n\n"
    },
    {
      "time": " 27.Jul.2007 9.19am",
      "content": "@ Refusenik: Well sheesh. There goes everything. I might as well jump off of a roof somewhere. ;^)\n\nIsn’t there a blog entry somewhere, or something, which was written by the people who created the new system? Seems to me it is a little broken. No?\n\n"
    },
    {
      "time": " 28.Jul.2007 9.16pm",
      "content": "[This](http://web.archive.org/web/20071109073944/http:/blogs.adobe.com/jnack/2006/12/whats_up_with_the_icon.html) is where the icons were first introduced. John Nack says, quoting Ryan Hicks, that “The mnemonics use a custom cut of Gauge, a typeface Robert [Slimbach] has currently in development. It was his recommendation that the type work the way it does, mixing upper/lower and cap/small cap based on both phonetics and aesthetics. He breathed a bit of life into the system for sure.”\n\n"
    },
    {
      "time": " 29.Jul.2007 7.58am",
      "content": "sharon’s point is a good one. “Id” being a word, and “ID” being a term used often in design, the small cap choice works a lot better in this case.\n\n"
    }
  ]
}
