{
  "id": "35458",
  "title": "Exporting with Freehand",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’m rather green when it comes to using vector software.\n\nI’ve been using exporting my Freehand files instead of saving them, because I run into compatability issues between computers when I ’save as’. However, I cannot export over another file, instead I have to create a new file name each time. I’ve been doing this for months, but there has got to be a better way. What am I doing wrong?\n\n(I could use Illustraor, and save as a ’.ai’ file, but I’m not comfortable designing with Illustrator, particularly fonts)\n\n [‹ MAJOR Bug with kerning in FontLab 5.0.3](http://web.archive.org/web/20071102222311/http:/typophile.com/node/34558 \"Go to previous forum topic\") [where to begin creating ARABIC font? any suggestions? ›](http://web.archive.org/web/20071102222311/http:/typophile.com/node/16288 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071102222311/http://typophile.com/user/19524\" title=\"View user profile.\">popluhv</a>",
  "time": "<br>",
  "uid": "19524",
  "comments": [
    {
      "time": " 26.Jul.2007 11.54am",
      "content": "Get comforable with Illustrator because it work betters than Freehand for me. According to some of the pros Adobe is really not doing as much with Freehand.\n\n"
    },
    {
      "time": " 26.Jul.2007 12.26pm",
      "content": "If you’re making fonts, why not work in Fontographer?  \nIts vector tools are similar to Freehand — after all, Altsys’ Fontographer was the first DTP vector drawing program.\n\n"
    },
    {
      "time": " 27.Jul.2007 3.31am",
      "content": "If you’re making fonts, why bother exporting files at all? Just scale the vector outlines to the required size then copy and paste into FontLab.\n\nNick Cooke\n\n"
    },
    {
      "time": " 27.Jul.2007 8.08am",
      "content": "Exporting to what?\n\nFreehand is a great piece of software. Alas, it’s dead. Adobe is no longer going to be releasing any updates for it. Still, it’s usable software, but just a heads up on that.\n\nIf you are making fonts, then you don’t really need to export at all. Just cut-and-paste.\n\n"
    },
    {
      "time": " 27.Jul.2007 8.12am",
      "content": "Oh...FYI, if this is not a highly formatted Word file, TextEDIT will open the word file natively.\n\n"
    }
  ]
}
