{
  "id": "3546",
  "title": "Font doesn't preview in Suitcase in OS 10.3.2",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello,   \n   \nWe created a font in Fontographer and tested it on Suitcase 11 in OS10.3.2. The font does not appear in the preview pane of Suitcase 11 and the activation of the font is very slow (about 10 seconds rather than immediate loading).   \n   \nWe also tried Suitcase 10 in OS9.2 with the same results. The font views and prints fine in Quark.   \n   \nAnyone have similar problems or ideas for a fix?   \n   \nkristin\n\n",
  "author": "<a href=\"/web/20100316121302/http://typophile.com/user/1553\" title=\"View user profile.\">kristin</a>",
  "time": "<br>",
  "uid": "1553",
  "comments": [
    {
      "time": "",
      "content": "I have also some fonts with no previews in suitcase (these are no Fontographer fonts), but I can active them and they work. but I can't tell you any reasons of this behavior.\n\n"
    },
    {
      "time": "",
      "content": "Kristin,   \n   \nI have had a similiar problem. I am running Mac OS 10.3.3 Extensis Suitcase X1 and am creating fonts in Fontlab 4.6.   \n   \nMy problem has been specifically with creating OT fonts. I am not yet developing any OT features to these fonts, but just for the cross platform feature. Suitcase doesn't seem to acknowledge them when I try to add them to a set.   \n   \nThe OS, however does recognize them when I place them in the fonts folder in my library. I've just been confused up til now, thinking it was my rookie practice of namimg or generating my fonts wrong but it seems as though there must also being something quirky with Suitcase.\n\n"
    },
    {
      "time": "",
      "content": "I have run into similar issues with fonts that are named certain ways: eg: menu names that begin with a numeral, such as Fountain's [London](http://web.archive.org/web/20100316121302/http:/www.fountain.nu/catalogue/london.asp) family. Again, they can be activated and used, but the preview window in SuitCase cannot display the font.   \n   \nQuirky is an awfully kind word for SuitCase.\n\n"
    }
  ]
}
