{
  "id": "35481",
  "title": "Adobe FDK 2.x?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nBack in Dec. 05 Thomas Phinney said in [http://typophile.com/node/16942](http://web.archive.org/web/20130820070931/http:/typophile.com/node/16942 \"http://typophile.com/node/16942\")\n\n\"If things proceed on schedule, Adobe hopes to release AFDKO 2.0 around February, and then have an AFDKO 2.x release around the end of the summer. That latter release will support mark attachment (and all OpenType lookup types), at which point FontLab and FontMaster will have the source code to do the same.\"\n\nIs there any news on the 2.x front? In particular I'm interested in the currently unsupported features of the OpenType Feature File Specification such as those mentioned in the above quote.\n\nAny news will be greatly appreceiated!\n\nBest wishes  \nIdris\n\n",
  "author": "ishamid",
  "time": "27 Jul 2007 — 9:42am",
  "uid": "10590",
  "comments": [
    {
      "time": "27 Jul 2007 — 9:56am",
      "content": "Check this thread:\n\n[http://typophile.com/afdko2](http://web.archive.org/web/20130820070931/http:/typophile.com/afdko2 \"http://typophile.com/afdko2\")\n\nChrisL\n\n"
    },
    {
      "time": "27 Jul 2007 — 1:25pm",
      "content": "I don't think that answers the actual question, which is more about the 2.5 (or will it be 3.0?) release than the 2.0 release that already happened.\n\nThere are some real uncertainties right now in work that Read will be doing before the work on the next big FDK release. I would bet that it will not ship for at \\*least\\* three months, and quite possible a fair bit longer than that.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "27 Jul 2007 — 4:47pm",
      "content": "Thank you, Thomas!\n\nIf I don't hear anything by January, I'll bug you all again ;-)\n\n(Actually, I like programming my features using Adobe feature files and hope to one day be able to do everything for Arabic-script from the fea file, hence the impatience).\n\nBest wishes  \nI\n\n"
    }
  ]
}
