{
  "id": "35505",
  "title": "New Font - Martins Corner",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello\n\nThis is my first font design, called Martins Corner.\n\nLike a lot of other first timers, it was originally based on my handwriting, but has since moved away from being a script into a fun looking rounded monoline sans serif, while retaining many of the unique forms of my writing.\n\nSo, take a look and I look forward to hearing what you have to say.\n\nThanks...\n\n| Attachment | Size |\n| --- | --- |\n| [Untitled-3.pdf](http://web.archive.org/web/20150123192846/http:/typophile.com/files/Untitled-3.pdf) | 56.9 KB |\n\n",
  "author": "tomhowe",
  "time": "28 Jul 2007 — 7:08am",
  "uid": "14955",
  "comments": [
    {
      "time": "28 Jul 2007 — 7:26am",
      "content": "hey...my surname is martins :O  \nabout your typeface, I really don't like the skewed C's, the 0 and I don't think that the G works. other than that I like it very much.\n\n"
    },
    {
      "time": "28 Jul 2007 — 8:37am",
      "content": "I think that a heavier weight should be another consideration. For instance is you designed this face in 72 point art what happens to the characters at 24 point?\n\n"
    },
    {
      "time": "29 Jul 2007 — 3:28am",
      "content": "I think your dots can stand to be heavier overall (. : ; i j)  \nA problem inherent in monoline fonts is that these dots look much too light when they are circles of the same width as the general stroke weight. They need to be enlarged slightly and/or made not quite so circular.\n\n"
    },
    {
      "time": "30 Jul 2007 — 10:54am",
      "content": "The foot of the majiscule R could be pulled out a little into the bowl (away from the stem), which would allow it to be less limp looking.\n\n(Is Dagenham Dave from a Morrissey song?)\n\n"
    },
    {
      "time": "30 Jul 2007 — 10:56am",
      "content": "Oh, also a larger bowl for #9 might look good.\n\n"
    },
    {
      "time": "31 Jul 2007 — 7:58am",
      "content": "You have family problems here. Some of your letters are nice and geometric, while others are not.\n\nLetters I'd drastically change would be: C, c, K, @, and €.\n\nLetters I'd moderately change would be: G (too closed on the top or too open on the bottom), M/W (adjust one to another. I don't mean mirror them but adjust them to match), S, s (they are too big and too wide on the top half), Y (it's heavily falling right), 3 (too big top - adjust it to 8), 5 (ending should be more left or move the top left stem more to the right), 7 (unstable just as Y), 9 (too narrow).\n\nNice start.\n\n"
    }
  ]
}
