{
  "id": "35502",
  "title": "Fraktur Compliment to Coruña",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "So I got bored and decided to ttry my hand at making a fraktur face. However, I decided to see how well I could get it to \"match\" my antiqua font Coruña. Obviously I ran into a few issues when trying to juxtapose antiqua and fraktur. First, the fraktur is naturally a lot close of a font, with more thick lines than antiqua, as well as a lot \"busier\". I decided I wasn't going to remove the essence of the fraktur script, and insterad focus on designing one that works as a perfect compliment to Coruña — an interesting task given that Coruña has a very low x-height and very large descenders and ascenders, very uncommon for fraktur. So, rather than expand the fraktur to match the width and colour of the antiqua, I slightly reduced its weight. The long descenders have the same feel as the antiqua ones, so I think it was somewhat successfull, especially when I squint my eyes and I can't pick out a given word as being fraktur, so the colour is matched well.\n\nThe main thing I'm thinking is that I might not have the perceived x-height quite lined up, and that maybe my x's descender should be of the type that wraps back around under the x itself.. What do y'all think?\n\n| Attachment | Size |\n| --- | --- |\n| [coruna\\_fraktur\\_antiqua.pdf](http://web.archive.org/web/20150420012741/http:/typophile.com/files/coruna_fraktur_antiqua.pdf) | 18.71 KB |\n| [coruna\\_fraktur\\_spanisch.pdf](http://web.archive.org/web/20150420012741/http:/typophile.com/files/coruna_fraktur_spanisch.pdf) | 42.75 KB |\n\n",
  "author": "guifa",
  "time": "28 Jul 2007 — 12:03am",
  "uid": "16708",
  "comments": [
    {
      "time": "28 Jul 2007 — 3:28am",
      "content": "My first impression is that the combination looks kind of weird, because normally (i.e. in old books) it is exactly the other way around: few words in roman face turn up in the majority of the text being set in Fraktur.  \nx: try wrapping back the descender, I don't think that it is a problem when this descender is not as long as the other ones.  \ni: why no dot? This makes your face even harder to read. If you really need a \"dotless i\" glyph, put it in this position… ;-)  \ns: is there a long s variant planned? this would solve some of the s’s problem that appears to be too dark. Also, the whole glyph looks rotated left compared to the antiqua s. And try to improve the kerning (see the word \"test\" for what I mean).\n\n"
    },
    {
      "time": "4 Aug 2007 — 2:47am",
      "content": "Okay I uploaded a new sample file. This one is from the Wikipedia article for Spanish, with all text directly related to Spanish in Antiqua and the rest in Fraktur. Punctuation is also still the Antiqua version, but probably won't change too significantly. I gave the i and j their dots back and finished up the uppercases except for X. I used a rudimentary regex sequence to put in the long-s's so they might not be 100% accurate but I think it gets the majority of them, at least to preview the font.  \n`s/s/ſ/g\ns/ſ /s /g\ns/ſp/sp/g\ns/ſk/sk/g\ns/ſd/sd/g`\n\nThe spacing on the ſ when by itself is too much, although I think I might have all of the letters a little too closely spaced even for Fraktur.\n\nOther than a lot more work on kerning does anyone see anything major (or minor) to look at? I'm still trying to get a good wrap-around lowercase x, but no luck yet.\n\nOverall, is it working? Waste of time? Success?  \n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "10 Sep 2007 — 8:39pm",
      "content": "I cannot see a relationship between the two especially except for a certain romantic feeling. The 'Fraktur' seems like an 18th cent Romantic blackletter. I would not worry about the relationship of the two because realistically the two are unlikely to be used together. As to success of the black letter - i found it pretty easy to read. That's a good start to be sure. What do you want people to be able to do with it? Until you have a target you can't hit one.\n\n"
    },
    {
      "time": "10 Sep 2007 — 8:43pm",
      "content": "Man, you must really have been bored to try and link those two together.  \n; )\n\n"
    },
    {
      "time": "11 Sep 2007 — 2:42pm",
      "content": "You never know - he may have something in mind that we don't see.\n\n"
    },
    {
      "time": "11 Sep 2007 — 10:13pm",
      "content": "Dennis hit the nail on the head.\n\nI was quite bored, but, since my dad is a math professor, I figured I'd try to extend my font for math typesetting (although this down the road) which does require fraktur. And why do just the standard 5-6 letters for math when you can do all 53? :-) Actually it was kind of fun.\n\nSo part experiment, part boredom, and part practical. I figured I might go really out there and do a sütterlin to match the antiqua italic haha.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
