{
  "id": "35509",
  "title": "Works from Oliver Vaughan",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "hello friends,\n\ncan you help me to know which fonts were used here and tell me where I can find them ?\n\nlot of thanks in adavnce,\n\ndamasu\n\n ![](http://web.archive.org/web/20141021163949im_/http:/typophile.com/files/vaughan_oliver_gallery_72_5484.jpg)\n\n ![](http://web.archive.org/web/20141021163949im_/http:/typophile.com/files/vaughan_oliver_gallery_8_4080.jpg)\n\n ![](http://web.archive.org/web/20141021163949im_/http:/typophile.com/files/vaughan_oliver_gallery_4_4621.jpg)\n\n ![](http://web.archive.org/web/20141021163949im_/http:/typophile.com/files/vaughan_oliver_gallery_1_6091.jpg)\n\n",
  "author": "damasu",
  "time": "28 Jul 2007 — 12:55pm",
  "uid": "17257",
  "comments": [
    {
      "time": "28 Jul 2007 — 1:06pm",
      "content": "Too much in one go, dude!\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:15pm",
      "content": "\"Trophies\" and \"Secrets of the Beehive\" are Coronet, and \"Pixies\" is Ariston.\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:18pm",
      "content": "The serif faces are too small and pixelated to recognize. Let me get my Vaughan Oliver books…\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:20pm",
      "content": "The \"David Sylvian\" underneath \"Secrets of the Beehive\" is Bodoni.\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:43pm",
      "content": "Approaching Silence do look like [Boulevard](http://web.archive.org/web/20141021163949/http:/www.identifont.com/show?GR) by G. G. Lange and [Primrose](http://web.archive.org/web/20141021163949/http:/www.identifont.com/show?7IE) by Jason Walcott without being it.\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:44pm",
      "content": "Yeah, I'm looking for that one right now. I noticed the resemblance with the Boulevard capital A.\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:48pm",
      "content": "Gotcha! [Stradivarius a.k.a. Symphonie](http://web.archive.org/web/20141021163949/http:/bowfinprintworks.com/Script02Pg7.html).\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:50pm",
      "content": "[Available from GroupType.](http://web.archive.org/web/20141021163949/http:/www.myfonts.com/fonts/grouptype/stradivarius/)\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:53pm",
      "content": "I think that \"Here Comes Your Man\" might be Univers Condensed, one of Vaughan Oliver's mainstays.\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:55pm",
      "content": "The other Syvian serif faces aren't identifiable. Not at this size anyway. The posters are not in the book.\n\n"
    },
    {
      "time": "28 Jul 2007 — 1:56pm",
      "content": "Impressive as always.\n\n"
    },
    {
      "time": "28 Jul 2007 — 2:00pm",
      "content": "I really love Vaughan's work. Unfortunately I couldn't find the other monograph (the first one). Nona is sleeping in our room so I couldn't put on the light. If I find it tomorrow I'll have a look.\n\n"
    },
    {
      "time": "28 Jul 2007 — 2:10pm",
      "content": "Don't dare to wake her up. ;^D. My kids are at Grandma's tonight yeahyeahyeah. Party!  \nNaw. Good night everyone.\n\n"
    },
    {
      "time": "28 Jul 2007 — 5:00pm",
      "content": "I think Vaughan is overrated as a typographer. The photographs and moods are striking but I've seen a lot of stuff that looks pretty amateurish, such as that \"Secrets of the Beehive\" cover. Seriously, there is nothing remarkable about that typography and the technique smacks of a young art student's work.\n\nOk, Vaughan fans, you may now commence with the stoning.\n\n"
    },
    {
      "time": "28 Jul 2007 — 5:30pm",
      "content": "thanks so much friends !  \nI am always impressed by your so quick answers. Really thanks a lot, you were very helpful !!!  \nMy little Louise is sleeping too.... but for me, it's not party..... just working... pfffffff\n\n"
    },
    {
      "time": "28 Jul 2007 — 9:13pm",
      "content": "_I really love Vaughan’s work._\n\nSame here, Yves.\n\n"
    },
    {
      "time": "29 Jul 2007 — 10:16am",
      "content": "_Ok, Vaughn fans, you may now commence with the stoning._\n\nokay!\n\nthe constructions in which he placed his typography are really nice. i think of vaughan more of an illustrator than a designer, kinda like whatshisname, the guy who did all the factory stuff that everyone pees themselves over.\n\nuh.\n\nshit.\n\npeter saville! that's it.\n\nfor typography and calligraphy, i like chrs bigg's work better than oliver's. he is (was?) second in command at v23.\n\n"
    },
    {
      "time": "28 Jul 2007 — 10:19pm",
      "content": "Maybe true. I guess I just wish he had a typographer around to lend him a hand.\n\n"
    },
    {
      "time": "29 Jul 2007 — 2:27am",
      "content": "Pfff, I'm not even going to reply to that! :^P\n\n"
    },
    {
      "time": "29 Jul 2007 — 2:28am",
      "content": "Actually I must say I can't distinguish Bigg's work from Oliver's because I've always seen them as V23, so I wouldn't even know who did what exactly.\n\n"
    },
    {
      "time": "29 Jul 2007 — 2:32am",
      "content": "V23 had a knack for unearthing obscure scripts and serif faces and combining them in such a way that even letterspaced Univers Condensed looked gorgeous. The integration of type with image always was very clever and the overall images usually of a profound poetic beauty. I see them as illustrators who used type beautifully in their work, so I couldn't care less if they broke some rules against kerning or letterspacing or alignment or whatever -- you have to judge the work within its context.\n\n"
    },
    {
      "time": "29 Jul 2007 — 2:35am",
      "content": "For example I am a lot less forgiving for that guy who did all the minimalistic typographic covers for the Pet Shop Boys and whose work was often marred by typos, double spaces and whatnot. Because his work completely relies on type setting, _then_ I feel we are entitled to be extra critical about said typography.\n\n"
    },
    {
      "time": "29 Jul 2007 — 2:42am",
      "content": "Dave Farrow? Lemme double-check that.\n\n"
    },
    {
      "time": "29 Jul 2007 — 3:09am",
      "content": "It’s [Mike Farrow](http://web.archive.org/web/20141021163949/http:/www.farrowdesign.co.uk/).\n\n"
    },
    {
      "time": "29 Jul 2007 — 3:58am",
      "content": "Yup, that's the one. I somehow contaminated his name with [Dave Farey](http://web.archive.org/web/20141021163949/http:/typophile.com/wiki/Dave%20Farey), designer of the beautilicious [Cachet](http://web.archive.org/web/20141021163949/http:/www.fontshop.com/fonts/downloads/creative_alliance/cachet/) and its somewhat tamer counterpart [Zemestro](http://web.archive.org/web/20141021163949/http:/www.fontshop.com/fonts/downloads/monotype/zemestro/).\n\n"
    },
    {
      "time": "29 Jul 2007 — 8:24am",
      "content": "I always loved the album art for 4AD. Vaughn Oliver did, as Yves mentioned, unearth lots of great old typefaces and reinvent them. There are a few that are weak, but for me a lot of them conjure up strong memories and will never be anything but classics.\n\nStone you, indeed!\n\n"
    },
    {
      "time": "29 Jul 2007 — 8:34am",
      "content": "Let's collectively kick his scrawny butt next time we see him at a typography conference! :^P\n\n(Stewf, just joking -- you know I'd _never_ do that (unless you expressly asked me to of course) ;^).\n\n"
    },
    {
      "time": "29 Jul 2007 — 2:08pm",
      "content": "it's mark farrow, not mike farrow.\n\n"
    },
    {
      "time": "29 Jul 2007 — 2:26pm",
      "content": "Oh, botch job! X°p Sorry.  \nThanks for being vigilant, ak.\n\n"
    },
    {
      "time": "31 Jul 2007 — 1:30pm",
      "content": "what is V23?  \nany link to V23?\n\nand I agree with Tiff... the 4AD album art were often great... and also the music! I still play my old Cocteau Twins records!\n\nspeaking of them...  \n(a)  \nwho is going to nail the font Cocteau Twins used on some of their early records?  \n [http://www.cocteautwins.com/html/discography/discog\\_03.html](http://web.archive.org/web/20141021163949/http:/www.cocteautwins.com/html/discography/discog_03.html \"http://www.cocteautwins.com/html/discography/discog\\_03.html\")\n\n(b)  \nwho else knows why they chose the name Cocteau Twins\n\n"
    },
    {
      "time": "31 Jul 2007 — 5:16pm",
      "content": "<cite>what is V23?</cite>  \nVaughan Oliver’s company. v (Vaughan) 23 (his favourite number). Oliver worked in loose collaboration with photographer Nigel Grierson under the pseudonym **23 Envelope** for years. Later, when setting up his own studio he used **v23**.\n\n<cite>(a)<br>\nwho is going to nail the font Cocteau Twins used on some of their early records?</cite>  \nIt was hand-rendered by Oliver on the insistent request of the band. Earlier ones like [_Garlands_](http://web.archive.org/web/20141021163949/http:/eyesore.no/html/wrap/CocteauTwins.Garlands.cd.jpg.html) were hand-rendered by Nigel Grierson.\n\n<cite>(b)<br>\nwho else knows why they chose the name Cocteau Twins</cite>  \n…Simple Minds\n\n"
    },
    {
      "time": "1 Aug 2007 — 2:15am",
      "content": "<cite>any link to V23?</cite>  \n [**v23**](http://web.archive.org/web/20141021163949/http:/www.v23.biz/) – but no work on show.\n\n"
    },
    {
      "time": "1 Aug 2007 — 2:39am",
      "content": "Yes, I noticed that collected examples of V23's work are hard to find on the 'net. Somebody should set up an online gallery for them. Maybe even with type identifications to go with them.\n\n"
    },
    {
      "time": "1 Aug 2007 — 2:55am",
      "content": "A huge amount of their work can be seen on [4AD’s website](http://web.archive.org/web/20141021163949/http:/www.4ad.com/) along with plenty of information regarding designers, design methods and nerdy band trivia.\n\nOf course nothing beats walking into a used record store and finding old 4AD vinyl’s designed by Oliver and his collaborators. They are the only vinyl I own.\n\n"
    },
    {
      "time": "1 Aug 2007 — 6:00am",
      "content": "AHA..  \nso they were **23 envelope** Thanx for that info **Conor**\n\nI forget which song that has the line Cocteau twins... do you remember that as well?\n\n"
    },
    {
      "time": "1 Aug 2007 — 6:08am",
      "content": "\\> <cite>I forget which song that has the line Cocteau twins</cite>  \nIt was the song _Cocteau Twins_.\n\n"
    },
    {
      "time": "1 Aug 2007 — 11:34pm",
      "content": "this is by far the best collected site of 23 envelope work i've found:\n\n[http://www.fedge.net/~desiderata/4ad20.html](http://web.archive.org/web/20141021163949/http:/www.fedge.net/~desiderata/4ad20.html \"http://www.fedge.net/~desiderata/4ad20.html\")\n\n"
    },
    {
      "time": "4 Aug 2007 — 7:35pm",
      "content": "Wow, that's a beautifully done site, Patric -- thanks for the link!\n\n"
    },
    {
      "time": "7 Feb 2008 — 10:03am",
      "content": "[Something small but relevant to Vaughan Oliver (and his favourite font).](http://web.archive.org/web/20141021163949/http:/breedersdigest.net/2008/moutain-battles/5-questions-for-vaughan-oliver/)\n\n"
    },
    {
      "time": "7 Feb 2008 — 3:03pm",
      "content": "\"I think Vaughan is overrated as a typographer. The photographs and moods are striking but I’ve seen a lot of stuff that looks pretty amateurish\"\n\nI find this comment laughable... I respect the fact that everybody has the right to their own opinion but come on? How much of Vaughan Oliver's work have you actually seen?\n\nI recommend adding [Visceral Pleasures](http://web.archive.org/web/20141021163949/http:/www.amazon.co.uk/Vaughan-Oliver-Pleasures-Rick-Poynor/dp/1861540728) to your reading/viewing list.\n\nI had the honor of a 3 month internship working with Vaughan and Chris at V23 back in 2002. I can tell you now, I learnt more in that 3 months, than a whole 3 years at university.\n\nThe guy is a genius. End of.\n\n"
    },
    {
      "time": "7 Feb 2008 — 4:31pm",
      "content": "Thanks for that link, Conor!\n\n"
    },
    {
      "time": "7 Feb 2008 — 7:34pm",
      "content": "\\> How much of Vaughan Oliver’s work have you actually seen?\n\nCertainly not a big chunk, but everything in this thread is not impressive typographically. None of the decisions seem particularly interesting or original.\n\nGreat that you had personal experience with Vaughan. Please tell me more about what you learned from him regarding type use.\n\n"
    },
    {
      "time": "7 Feb 2008 — 7:51pm",
      "content": "Ok, after some more reading and consulting with those who were around for Oliver's peak, I think I'm gaining a better understanding of what makes him special. What I lacked was context. It sounds like his type certainly _was_ original at the time and has since been copied by many. Like Yves said, no one used the antique scripts and stuff (deemed by a friend \"granny type\") until he did. He was doing something new.\n\nSo I sheepishly retract my notion that his work wasn't original.\n\nBut I still feel the type is lacking. It conveys the mood of the music and complements the imagery well, but the setting feels like an afterthought. Unrefined. It's clear that his strengths are in art direction and illustration. The advice of an experienced typographer might have made the work even better.\n\nI'm reminded of my feelings for Peter Saville, another \"mood\" designer. But I feel like Saville's work has a complexity and wit that's missing in some of these Oliver pieces.\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:38pm",
      "content": "Part of the context he was working in was punk. 23v was a graphic reaction away from the rough of punk but it wasn't such a clean break that some of the DIY spirit wasn't still there lingering. So being less than completely fussy about the type may have been natural especially early on. And with music I think looking to the immediate impact may be the greater virtue.\n\nHaving grown up with it like Tiff I probably don't see it objectively though either. I did love all the variation and expressiveness in the type and in the use of it.\n\n"
    }
  ]
}
