{
  "id": "35547",
  "title": "Making hyperlinks work",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Please help. I am working in InDesign CS. I have set the destination and the hyperlink but when I go create pdf, it doesn’t work. What could I be doing wrong? I’ve read and re-read HOW TO in book and on-line format. Something isn’t right. Please help.\n\n [‹ A fun alphabet](http://web.archive.org/web/20071109063319/http:/typophile.com/node/35510 \"Go to previous forum topic\") [Researching 'Computer' Typefaces ›](http://web.archive.org/web/20071109063319/http:/typophile.com/node/35550 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071109063319/http://typophile.com/user/20060\" title=\"View user profile.\">Evuka</a>",
  "time": "<br>",
  "uid": "20060",
  "comments": [
    {
      "time": " 30.Jul.2007 8.27am",
      "content": "When you are making the pdf do you do it by “Export to”?\n\nI’m working in CS2, but when I do it, I get many options before saving. The bottom box gives me “Include” and among the choices is “hyperlinks”. Check off the box and give it a try.\n\n"
    },
    {
      "time": " 30.Jul.2007 8.42am",
      "content": "Thanks for responding Kristina. Yeah. I export to and have hyperlinks selected. I just don’t know why it isn’t working.\n\nEvuka\n\n"
    },
    {
      "time": " 30.Jul.2007 9.03am",
      "content": "Is it links within a document or from one PDF to another?\n\nI found that the links won’t work if the title of the PDF has non-ASCII characters. When I named the PDF märz.pdf the links didn’t work at all.\n\nRalf\n\n"
    },
    {
      "time": " 30.Jul.2007 9.08am",
      "content": "Besides that, when you export and make the pdf compatible for Adobe Reader \\< version 5(?), than hyperlinks will not work.\n\n"
    },
    {
      "time": " 31.Jul.2007 6.59am",
      "content": "Thanks, Ralf. Good points to remember for the future. Turns out that in my attempt to figure out why it wasn’t working I had layered invisible rectangle so it wouldn’t work on the current one. Good thing I am tenacious. Once I figured that out it was a piece of cake.\n\nEvuka\n\n"
    }
  ]
}
