{
  "id": "35546",
  "title": "corporate font for bank",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello!\n\nI wonder what the expertes suggestions might be:  \nLet’s say a bank gets a a new owner and plans to have a new corporate design: more friendly, more contemporary. They used a customized Futura so far and everything was quite the same for more than 15 years. As there will be a lot of different publications, a big Type-Family like Corpid or Corporate would propably be a good choice because of flexibility. But is there another suggestion? Especially concerning friendliness and contemporary feeling? Or maybe it is better to have a face that conveys those values for the display-sizes (headlines, advertisments, posters), and have a more neutral sans-companion for all the rest ...  \nAny suggestions /font-names are welcome.  \nThank you for your ideas, I really appreciate this forum.\n\nanton\n\n",
  "author": "Anton Badinger",
  "time": "30 Jul 2007 — 7:34am",
  "uid": "17071",
  "comments": [
    {
      "time": "30 Jul 2007 — 8:29am",
      "content": "Why not have a custom family drawn? The cost will likely come to about the same as licensing an existing family.\n\n"
    },
    {
      "time": "30 Jul 2007 — 8:34am",
      "content": "Speaking to whether to go with a friendly display face or friendlier display and body types, [here's](http://web.archive.org/web/20150409035321/http:/underware.nl/site2/index.php3?id1=underware&id2=case-studies&id3=01&idpic=05) an example of a bank choosing to use a typeface in every application -- and I think it was a fantastic solution. I believe that Citibank uses Interstate in this manner, too.\n\nOne wide-ranging type family I can think of is [Fedra](http://web.archive.org/web/20150409035321/http:/www.typotheque.com/fonts), which comes in sans, serif, and display varieties _and_ a monospaced version, which means that it could be used on automatically generated papers, too.\n\nAlso, take a look at the suggestions [here](http://web.archive.org/web/20150409035321/http:/www.typophile.com/node/17684).\n\n"
    },
    {
      "time": "5 Aug 2007 — 4:18am",
      "content": "Thank you for answering.\n\nclauses: I suppose the bank will customize the font any way, they did this with the old font, too.  \nauricfuzz: sauna is a clever choice and a good signal for easy and accessible online banking without the usual bank fuss. But didn’t JYSKE BANK go only half the way, as their logo is still very classical and serious? They are sending out two different signals, it seems to me.  \nThanks for the link, too.\n\nWhat do you think about any of the following:\n\nvista  \nversa  \nsansa  \nneue sans  \nleitura  \nabsara  \nlegato  \nklavika  \nkievit\n\n"
    },
    {
      "time": "5 Aug 2007 — 5:48am",
      "content": "A quick rundown:\n\nvista - maybe not so bad, but a little bit too display'y  \nversa - too old fashioned  \nsansa - too rough'n'tuff for a bank  \nneue sans - too generic for branding  \nleitura - again too generic  \nabsara - too bizarre for a bank  \nlegato - again too old fashioned  \nklavika - more contemporary and visible, but perhaps too cold  \nkievit - again too generic and old fashioned\n\nWhy not something whit a little more charcter (in general)? The face should be recognizable and unique to the bank. Also the friendly roundness is not really found in your examples, and Sauna is spoken for...\n\nHave a look at [http://www.fontpartners.com/](http://web.archive.org/web/20150409035321/http:/www.fontpartners.com/ \"http://www.fontpartners.com/\") FP Dancer might be what you're looking for.\n\n"
    },
    {
      "time": "6 Aug 2007 — 12:41am",
      "content": "Try Friz Quadrata Bold for the logo and the Regular for the headlines or secondary stuff, and Futiger for the copy. The logo and headlines will look modern, and the copy will be very up-to-date and easy to read.\n\n"
    },
    {
      "time": "6 Aug 2007 — 4:17am",
      "content": "<cite>Try Friz Quadrata Bold for the logo and the Regular for the headlines or secondary stuff, and Futiger for the copy. The logo and headlines will look modern, and the copy will be very up-to-date and easy to read.</cite>\n\nIs this sarcasm?\n\n"
    },
    {
      "time": "7 Aug 2007 — 1:43am",
      "content": "hello clauses,\n\nFP Dancer is a very good idea! One of the fonts I would have never found without this forums.  \nIf there was an alternative idea, just name it!\n\n\"Is this sarcasm?\"  \nmaybe Eyehawk’s agency is pitching, too.\n\n"
    },
    {
      "time": "7 Aug 2007 — 6:37pm",
      "content": "<cite>Try Comic Sans Bold Italic for the logo and Underlined for the headlines or secondary stuff, and Arial for the copy. The logo and headlines will look fun and friendly, and the copy will be very up-to-date and easy to read.</cite>\n\n- Lex\n\n"
    }
  ]
}
