{
  "id": "3555",
  "title": "Tribune de Lausanne",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I'm trying to identify the black serif type in a poster designed by Herbert Leupin in 1955.   \nIt appears he made a collage using a real newspaper from that year.   \n   \n ![trib](http://web.archive.org/web/20140830185113im_/http:/www.typophile.com/forums/messages/83/28386.jpg)   \n   \nThe newspaper \"Tribune de Lausanne\" ceased publication in the early eighties.   \nI have found no information as to when the TdL was first printed, as a clue to when   \nthe masthead was designed.   \nAny suggestions about Latin typefaces used in Europe before 1950, as well as   \nany leads on digital Latins which approximate this face would be appreciated.   \nThank you.\n\n",
  "author": "fabi",
  "time": "12 Mar 2004 — 12:10am",
  "uid": "2848",
  "comments": [
    {
      "time": "12 Mar 2004 — 5:59am",
      "content": "Hoefler Type Foundry's [\"Saracen\"](http://web.archive.org/web/20140830185113/http:/www.typography.com/catalog/saracen/) is a digital Latin headline font.   \n   \nI will look into Jaspert's \"Encyclopaedia of Type Faces\" to see what is shown about 50's-era Latins, and get back.\n\n"
    },
    {
      "time": "12 Mar 2004 — 6:44am",
      "content": "Other than Monotype's Latin Antiques and Latin Condensed; and Blake's Latin Wide, all I found in the Jaspert book was Chisel, an inline version of Latin Bold. Judging from that sample, Latin wasn't a very popular style.   \n   \nI also found a display Latin metal type called \"Primus\" in the A.T.A. Type Comparison Book, but it is like a wide Black or Ultra weight. (Not the same as Berthold Primus type from 1964).   \n   \nNot much help in those places. Sorry.   \n   \nYou can try typing 'Latin' at MyFonts and see what they show as current choices.\n\n"
    },
    {
      "time": "12 Mar 2004 — 12:11pm",
      "content": "Frutiger's [Versailles](http://web.archive.org/web/20140830185113/http:/www.myfonts.com/fonts/linotype/versailles/black/testdrive.html?s=TRIBUNE%a0DE%a0LAUSANNE&p=36) has some of the same flavor.\n\n"
    }
  ]
}
