{
  "id": "35550",
  "title": "Researching 'Computer' Typefaces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nI'm doing a little bit of research on the history of typefaces designed to reference computers or video games. Specifically, one thing I'm trying to figure out is the relationship between [Data 70](http://web.archive.org/web/20141224232539/http:/www.myfonts.com/fonts/letraset/data-seventy/) and this [Computer](http://web.archive.org/web/20141224232539/http:/www.myfonts.com/fonts/agfa/computer/). Data 70 is relatively easy to find out about, but \"Computer\" (probably because of its generic name) is much less so.\n\nOne thing I'm trying to determine, for example, is which came first. The Monotype \"Computer\" I linked to above seems to be mostly identical to \"Moore Computer\" which I found in an undated VGC catalog. According to [this](http://web.archive.org/web/20141224232539/http:/cg.scs.carleton.ca/~luc/vgc-typefaces.html), Moore computer dates to 1968, but I can't find a source to corroborate that. If that's true, it's significant since I've got a journal article claiming that Data 70 (designed in 1970 by Bob Newman) was the first typeface to base its design on MICR (E13B) characters, subsequently influencing 70s design, particularly in sci-fi contexts. I have found uses of 'Computer' as far back as 1972, but I had assumed it was based on Data 70, much like the dozens of examples of Data 70-like lettering (check out the [Magnavox Odyssey Logo](http://web.archive.org/web/20141224232539/http:/www.vidgame.net/PONG/magnavox/odyssey_logo.jpg) for example).\n\nAnyway, can anyone shed some light on this font? I'd be particularly grateful for any ideas on how I could confirm its date or figure out who designed it.\n\nThanks in advance.\n\n",
  "author": "zachwhalen",
  "time": "30 Jul 2007 — 8:39am",
  "uid": "20063",
  "comments": [
    {
      "time": "30 Jul 2007 — 11:12am",
      "content": "Maybe not helpful, but here are some [MICR-inspired typefaces](http://web.archive.org/web/20141224232539/http:/typographica.org/000539.php) that might lead you to some more info..\n\n"
    },
    {
      "time": "30 Jul 2007 — 11:29am",
      "content": "The 'digital tumor' typefaces we originally designed for OCR...mainly at banks. Not sure if that helps or not...\n\n"
    },
    {
      "time": "30 Jul 2007 — 6:19pm",
      "content": "More links that may or may not be useful...\n\nInfo on MICR [**here**](http://web.archive.org/web/20141224232539/http:/www.paratype.com/btstore/fonts/MICR.htm) and [**also here**](http://web.archive.org/web/20141224232539/http:/www.elfring.com/what.htm)...\n\nInfo on OCR-A and OCR-B [**here**](http://web.archive.org/web/20141224232539/http:/www.linotype.com/12819/ocrbregular-font.html?PHPSESSID=2a5b9ebfe3e3f7c2fcc077e3201be183) (you'll have to scroll down a bit) and [**also here**](http://web.archive.org/web/20141224232539/http:/www.paratype.com/btstore/fonts/OCR-B.htm).\n\n"
    },
    {
      "time": "30 Jul 2007 — 6:32pm",
      "content": "According to [**this Google cache**](http://web.archive.org/web/20141224232539/http:/64.233.169.104/search?q=cache:APGVcANpCR4J:www.myfonts.com/WhatTheFont/forum/viewthread.php%3Fthreadid%3D33868+%22Moore+Computer%22+typeface&hl=en&ct=clnk&cd=5&gl=us) of the What The Font forum (down for maintenance at the moment), Moore Computer \"was designed by David Moore as a VGC Original Designer typeface\". Unfortunately, no date is provided here.\n\n"
    },
    {
      "time": "30 Jul 2007 — 8:45pm",
      "content": "Wow, thanks for all the replies. I'm pretty familiar with the MICR / E13B origins of these typefaces, and in fact what I'm trying to do is track the influence through the correct lineage, so to speak. The one article I referred to in the post[1] is quite good in some regards, but I think the authors are incorrect on a few points and I want to make sure to get it right. For example, they discuss the proliferation of Data 70, but even some of the examples they show are definitely Moore Computer or Orbit-B. They do refer to Data 70 \"and its variants,\" but even that is incorrect if Moore Computer came first. At any rate, Amelia is arguably MICR-based, as is Countdown (kind of a stretch), both of which definitely pre-date Data 70. Incidentally, my goal isn't to prove these guys wrong, I just want to make sure I get the order right when I discuss the history.\n\nStephen: thanks for that link, one of the commenters mentioned Orbit-B, so now I finally have a name and a history for this other type I've been seeing but didn't have a name for. I think that actually may be the original font (seen on a U-Haul truck) that started me thinking about this to begin with.\n\naluminum: I've been trying to come up with a name (assuming there isn't already a standard one) for that blocky thing that characterizes these fonts (is it technically a gigantic serif?), and \"digital tumor\" is certainly in the running now. I've also been considering \"floating chad.\" Google didn't think that was a common term, so is that yours?\n\nRicardo: Too bad there's not much else in the WTF thread, but the first name of the designer is a huge clue. Thanks!\n\n[1] Owens, Mark, and David Reinfurt. \"Pure data: moments in a history of machine-readable type.\" <cite>Visual Communication</cite>. 4.2 (2005): 144 - 150.\n\n"
    },
    {
      "time": "31 Jul 2007 — 6:55am",
      "content": "\"Google didn’t think that was a common term, so is that yours?\"\n\nYea, 'digital tumor' is just what I call it. No idea if/what it's actual technical term would be.\n\nHmm...\"digital tumor\" would be a good name for a typeface...\n\n"
    },
    {
      "time": "10 Dec 2007 — 3:01pm",
      "content": "I found this post whilst searching for the origins of data 70 because I had a sneaky suspicion it may have been lost and the reality of where this futuristic computer font came from has always amused me.\n\nFrom this post I'm guessing it has, mostly because it's an origin in the hacker domain rather than design.\n\nYou see the way I understand it, these fonts are not based on that icky MICR mess at all, they are based on old printers and hacker ingenuity.\n\nOld printers, attached to mainframes, used to have no fonts, all they could do was print text in normal, bold or italic. Italic was pretty much the same as normal but the bottom half of the letters where all shifted one pixel/dot to the left. Naturally, for it is what they do best, the hackers of that time worked out a few tricks. One of these simple tricks was printing text in normal, then backspacing and printing the same text over the top of this again but in italic. Creating strange letters that were normal at the top but bold at the bottom.\n\nThus creating a new font, a new braver bolder font of the future... :)\n\nThis would I guess have been sometime in the 60s, possibly even earlier.\n\nThis simple trick of combining normal/italic to create a computer font, seems to have been lost as I've just been searching around for any reference to it and this post was actually the closest thing I could find.\n\nSo I thought you might be interested, the two fonts you are talking about could have been built independently referencing this same source.\n\nKriss\n\n"
    },
    {
      "time": "11 Dec 2007 — 11:44am",
      "content": "Kriss, this is an interesting hypothesis, and one well-worth thinking about. Among the various accounts of Data 70 one can find on the web, some of them at least seem to suggest this possibility. MyFonts, for example, says that Data 70 \"simulates output generated by computers,\" which is pretty ambiguous but could indeed include the kind of practice you're talking about.\n\nI'd love to see an example of what you're describing if you can find one. Still, intentionality is a tricky thing in type design, it seems. So whether Newman intended Data 70 to mimic these hacker tricks you describe, it would still be possible and valid for type consumers to take Data 70 as a reference to MICR and use it as such.\n\nThe journal article I mention in the first post here only mentions Data 70's origin in MICR, but the examples the authors provide of Data 70 allegedly in use are actually Moore Computer and Westminster -- two faces which bear a much closer resemblance to MICR (in my opinion) than Data 70. (FWIW, the earliest accounts I have of both Moore Computer and Westminster make it pretty clear that their designers each had MICR in mind). And while the article gets the identification wrong, I think it still makes a valid point about Data 70's association with futurism, anxiety about cybernetics, and (originally) dystopia.\n\nMy point is just that whatever inspired Data 70, it has been taken as a reference to MICR, which in my mind aligns it strongly with Moore Computer, Westminster, Orbit-B etc.\n\n"
    },
    {
      "time": "11 Dec 2007 — 3:55pm",
      "content": "The blobby \"tumor\" look may relate to printed circuit boards and metal solder tabs -- both quite graphic -- rather than the requirements of optical character recognition.\n\nHere is a layout from Avant Garde magazine c.1970, designed by Herb Lubalin. I can't remember the name of the face, which also has geometric and art deco qualities.  \nNote the way Lubalin uses the dot of i for the counter of g.\n\n ![](http://web.archive.org/web/20141224232539im_/http:/typophile.com/files/Fugs_5756.jpg)\n\n"
    },
    {
      "time": "11 Dec 2007 — 4:25pm",
      "content": "It was called Amelia. A similar typeface was used on the original paperback edition of Future Shock.\n\n"
    },
    {
      "time": "11 Dec 2007 — 4:42pm",
      "content": "Here it is:\n\n ![](http://web.archive.org/web/20141224232539im_/http:/typophile.com/files/future-shock_4047.jpg)\n\nI think it may have been hand-drawn and based on Amelia. I don't think I've ever seen a typeface that matches, if it exists.\n\n(Isn't it funny how old this looks? I'm so glad I read this back then. I don't know how I would have coped otherwise here in the future.)\n\n"
    },
    {
      "time": "11 Dec 2007 — 7:26pm",
      "content": "(Glad to have you here with us in the future, Mark.)\n\n"
    },
    {
      "time": "12 Dec 2007 — 9:45am",
      "content": "Luc Devroye has an interesting interview with Stan Davis, the creator of Amelia:  \n [http://cg.scs.carleton.ca/~luc/amelia.html](http://web.archive.org/web/20141224232539/http:/cg.scs.carleton.ca/~luc/amelia.html \"http://cg.scs.carleton.ca/~luc/amelia.html\")\n\nHe mentions several of its associations, but doesn't quite say what he intended for it. For my part, I'm unclear whether to put it in the same category as Moore Computer et al. Its features look more fluid and globular (perhaps like solder blobs) than the right-angle strictures of MICR. But its certainly possible that Amelia's ability to associate with sci fi stems from its broad resemblance to Data 70.\n\n"
    },
    {
      "time": "19 Jul 2010 — 4:13pm",
      "content": "@zachwhalen - <cite>I'd love to see an example of what you're describing if you can find one.</cite>\n\nfashionably late but here, nonetheless.\n\n[http://www.youtube.com/watch?v=rmH6uBCt4wI](http://web.archive.org/web/20141224232539/http:/www.youtube.com/watch?v=rmH6uBCt4wI)\n\ni have used the dot matrix font to recreate Data 70 via the hacker tricks method mentioned by Kriss.\n\n"
    },
    {
      "time": "19 Jul 2010 — 4:21pm",
      "content": "Re. the Fugs:\n\n[http://www.nytimes.com/2010/07/13/arts/music/13kupferberg.html](http://web.archive.org/web/20141224232539/http:/www.nytimes.com/2010/07/13/arts/music/13kupferberg.html \"http://www.nytimes.com/2010/07/13/arts/music/13kupferberg.html\")\n\n"
    }
  ]
}
