{
  "id": "35564",
  "title": "Personal Business Card Design",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have been putting together a personal identity for university applications for my portfolio, envelopes, business cards, and other things for meeting with admissions councilors and for submitting the actual applications and portfolio itself.\n\nSo far I have a general which uses an A mark I designed that bleeds off of the right hand side of page and Gotham Rounded for most text and probably Swift or Mercury for longer text applications ( primarily for my personal statement ), and a design for a business card.\n\nTell me what you think!\n\n| Attachment | Size |\n| --- | --- |\n| [Untitled-1.jpg](http://web.archive.org/web/20071229070428/http:/typophile.com/files/Untitled-1_25.jpg) | 152.83 KB |\n| [Untitled-2.jpg](http://web.archive.org/web/20071229070428/http:/typophile.com/files/Untitled-2_8.jpg) | 118.72 KB |\n\n [‹ New Art Gallery Needs Typeface](http://web.archive.org/web/20071229070428/http:/www.typophile.com/node/35576 \"Go to previous forum topic\") [Body type face for business ›](http://web.archive.org/web/20071229070428/http:/www.typophile.com/node/35588 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071229070428/http://www.typophile.com/user/7571\" title=\"View user profile.\">alexhb</a>",
  "time": "<br>",
  "uid": "7571",
  "comments": [
    {
      "time": " 30.Jul.2007 3.34pm",
      "content": "I prefer the red card vs the white. It feels very clean and strong. A few comments though:\n\nI like the large A, but the shadow is kind of weird. The lines on the bottom don’t seem evenly distributed, and in the middle of the A, the lines don’t match the angle of the cutoff.\n\nI don’t get the squiggly line. What’s the reasoning behind it? Watch where it intersects with your name—it causes visual tension with some letters.\n\nI think you can take your contact info down a few point sizes. Right now your name doesn’t stand out because it is the same size as the contact info.\n\nYou might want to make P and E italic as well, in order to help them not blend with the info that follows.\n\n"
    },
    {
      "time": " 30.Jul.2007 3.40pm",
      "content": "There’s something that feels a bit odd about the A, but I can’t quite put my finger on it. I might experiment with different widths between the hash lines on the A shadow. Right now the gaps between the white lines are almost equal to the line widths themselves and it’s creating an odd vibration. But maybe that’s intended.\n\n(there’s the gap width between the black A and the white outlines, and the gap width between the white hash marks, and the width of the white lines... and they’re all very close, but not identical)\n\n"
    },
    {
      "time": " 30.Jul.2007 4.08pm",
      "content": "I like the A, but the stroke on the right hand side is a bit too thick, creating a bit of awkwardness. Maybe you might want to try to space out the A a little more, maybe from the top margin? Personally, I’d prefer a heavier weight as opposed to italicizing your name. I like both colors; very bold and strong. Gotham is such a pretty font.\n\n"
    },
    {
      "time": " 31.Jul.2007 12.16am",
      "content": "Try drawing the A by hand.\n\nTim\n\n"
    },
    {
      "time": " 31.Jul.2007 5.34am",
      "content": "I don’t think you need the P or the E - those items are pretty self-evident.\n\nI prefer the red. I’m not sure I like your name in italic, though.\n\n"
    },
    {
      "time": " 31.Jul.2007 6.07am",
      "content": "I like the red card, and the squiggly line, except for where it intersects with the white shaded “shadow”, as it destroys the illusion of 3 dimensionality you’ve created. Unless there’s a subtle message there?\n\n"
    },
    {
      "time": " 31.Jul.2007 6.59am",
      "content": "I like the white card...maybe try swapping the black and red so that the A is the highlighted element in red. At the same time, maybe knock the shadow/3-D back to a 50% black tint.\n\nI agree that the dashed line just seems extraneous. I’d skip that.\n\nThe only other suggestion is that the A seems a bit in limbo stylistically. Is it meant to be a reminiscent of antique type? If so, maybe go with a more rustic aesthetic like this:\n\n[http://www.archivetype.com/content/view/40/30/](http://web.archive.org/web/20071229070428/http:/www.archivetype.com/content/view/40/30/ \"http://www.archivetype.com/content/view/40/30/\")\n\nOtherwise, if it’s meant to feel more linear and modern, perhaps push it a bit farther in that direction.\n\n"
    },
    {
      "time": " 31.Jul.2007 9.45am",
      "content": "\\> Try drawing the A by hand.\n\nOr leave the A mechanical and make the shadow look more hand-drawn.\n\n"
    },
    {
      "time": " 31.Jul.2007 10.25am",
      "content": "I prefer the white card. Also not a fan of the dashed scribbly line. One thing to note is that the white counter line formed between the ’A’ and the red lines is uneven. Possibly you were trying to create some dimension even with this, but I feel it should remain constant, because it is so close to appearing as if it is one thickness.\n\n"
    },
    {
      "time": " 31.Jul.2007 2.58pm",
      "content": "Thank you guys for your comments. I’ve been looking at that A for the last hour or so and I’m also starting to see that it’s just not so.  \nBecause the overall identity was supposed to be very simple and clean I was depending on that A to be just right so that I could differentiate myself without looking out of place.\n\nI wanted it to be unique but not overly ornate that it felt out of place against a solid or white background with Gotham Rounded, bt right now it sort of looks like a mess. Im going to work on this tonight after to work!\n\nFor now I have posted a very early concept sketch of the whole thing. (Where Are You Going/Where Have You Been was what I wanted to use for the theme of my portfolio and personal statement when I was first planning things out)\n\n"
    }
  ]
}
