{
  "id": "35560",
  "title": "Arrow Circle",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm stumped.\n\nI was passed a powerpoint document to spruce up and format for consistency.\n\nOn one of the slides was this image:\n\n ![](http://web.archive.org/web/20150315014539im_/http:/typophile.com/files/Arrow%20circle_6157.jpg)\n\nI'm not actually sure how to create one of these. I attempted to recreate it in Illustrator, but it didn't quite turn out so well. I need to change the colors and words used. Is there an easy way to replicate this look? Any suggestions will be helpful at this point.\n\n",
  "author": "AndrewSipe",
  "time": "30 Jul 2007 — 12:12pm",
  "uid": "6496",
  "comments": [
    {
      "time": "30 Jul 2007 — 1:06pm",
      "content": "Font is [Gill Sans Bold](http://web.archive.org/web/20150315014539/http:/www.myfonts.com/fonts/linotype/gill-sans/bold/testdrive.html).  \nI don't know if I mistake, but it's difficult to reproduce the true bevel effect in Illustrator because it is a typical Photoshop (bitmap) effect...\n\n"
    },
    {
      "time": "30 Jul 2007 — 1:07pm",
      "content": "To get the arrow shape with a gradation, you can create an art brush and apply it to segments of a circle. I suspect the bevel can be simply made from the 3d option in Illustrator. I can’t give you detailed information because I can’t access Illustrator at the moment.\n\nTim\n\n"
    },
    {
      "time": "30 Jul 2007 — 1:29pm",
      "content": "Thanks Guys. I ended up playing around with a bunch of circles. The real difficulty was figuring out how to make the arrow tips appear undistorted.\n\nI didn't apply any bevel effects (they're hideous anyways).\n\nIt turned out to be a lot easier than I thought, just time consuming.\n\n ![](http://web.archive.org/web/20150315014539im_/http:/typophile.com/files/Aarow%20Circle_5487.png)\n\n"
    },
    {
      "time": "31 Jul 2007 — 3:34am",
      "content": "Andrew, better than the original...\n\n"
    },
    {
      "time": "31 Jul 2007 — 6:17am",
      "content": "Thanks. If I wasn't rushed (I only had a few hours to tweak the report) I would have spent more time making sure the text was aligned around the circle better.\n\n"
    },
    {
      "time": "31 Jul 2007 — 6:49am",
      "content": "\\>(they’re hideous anyways)\n\nIt’s powerpoint, it’s supposed to be hideous :)\n\nTim\n\n"
    },
    {
      "time": "14 May 2008 — 7:09pm",
      "content": "I need to create this type of arrows in circle for a presentation tomorrow. The only software I have to do this are: PowerPoint, Word, Visio and Fireworks. I'm not a graphic artist either. Can someone guide me in how I could do this using one of the tools that are available to me.\n\nThank you for your help.\n\nDarquise\n\n"
    },
    {
      "time": "14 May 2008 — 7:48pm",
      "content": "I don't believe it's possible to do that in any of those programs. Fireworks is the most capable of the bunch, and unless they just added the feature, it doesn't let you do type around a curve like that. Just doing the circles and arrows would be a lot of work, although you could probably stack a bunch of circles of different sizes, using some the same color as the background to make it appear that there are curved lines, and then draw in the arrowheads manually. It's easy in Adobe Illustrator, but none of the programs you have are made to do things like that.\n\n"
    },
    {
      "time": "15 May 2008 — 8:37am",
      "content": "Word, PowerPoint etc. have now got \"Insert \\> Diagram\" by means of which you can produce a thing with arrows in a circle and text boxes _between_ the arrows, which is quite quick and easy, but not text curving round within the arrows. (Nor fancy bevel effects, obviously!)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "15 May 2008 — 8:58am",
      "content": "Visio has a circular arrow shape. Go to File \\> New \\> Charts and Graphs \\> Marketing Charts and Diagrams. If you just click on the shape to add text, Visio puts the text in the middle of the circle. To put text on each individual arrow, you have to ungroup the shape; the text then sorta-kinda curves inside the arrow.\n\n"
    },
    {
      "time": "19 May 2008 — 4:15pm",
      "content": "Thank you all for your help. I managed to do something acceptable using word art in Work but not with the arrows.\n\nWould anyone know of a low end version of Illustrator or another graphic software for people like me who work on these kind of projects occasionnaly.\n\n"
    },
    {
      "time": "22 May 2008 — 7:40am",
      "content": "If you're on a Mac, you could try [Intaglio](http://web.archive.org/web/20150315014539/http:/www.purgatorydesign.com/Intaglio/). On a Windows box, one possibility is [Xara Xtreme](http://web.archive.org/web/20150315014539/http:/www.xara.com/uk/products/xtreme/?v=pro&t=).\n\n"
    },
    {
      "time": "15 May 2009 — 8:19am",
      "content": "So can anyone help me in guiding me to how this is done - i have to create a 4, 5, and 6 arrow circle in the next three hours. any help woul dbe greatly apprecaited\n\ni'm on a mca pro cs3 and cs4 and also this will end up in PPT and brochures, etc...\n\n"
    },
    {
      "time": "15 May 2009 — 8:19am",
      "content": "Thanks!\n\n"
    },
    {
      "time": "15 May 2009 — 9:13am",
      "content": "1) Make a circle.  \n2) Cut the path of the circle into as many sections as you need arrows.  \n3) Set the appropriate stroke size  \n4) On each path section, use the \"Filter-\\> Stylize-\\> Add Arrowheads\" to add your arrow shapes  \n5) Optional: Use \"Expand Appearance\" to turn each section into it's own object.\n\nHope this helps.\n\n"
    },
    {
      "time": "19 Jan 2010 — 4:09pm",
      "content": "Thanks bemerx25 - helped me out..\n\n"
    },
    {
      "time": "21 Jan 2010 — 2:17pm",
      "content": "I'd also consider Inkscape as a nice free alternative to Intaglio and Xara.  \n [http://www.inkscape.org/](http://web.archive.org/web/20150315014539/http:/www.inkscape.org/ \"http://www.inkscape.org/\")\n\n"
    }
  ]
}
