{
  "id": "35598",
  "title": "TC07: TypeCon is underway!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just got back from the hotel, where I dropped off six participants from the first TypeCon workshop. The workshop, on Math fonts, took place on the Microsoft campus. In true TypeCon tradition we over-ran by an hour, but on the plus side the adjoining cafe was closing just as we came out, so we all got free BBQ!\n\nThe weather is beautiful and the mountain is out - made the commute over the 520 bridge more than bearable.\n\n",
  "author": "Si_Daniels",
  "time": "31 Jul 2007 — 5:50pm",
  "uid": "1049",
  "comments": [
    {
      "time": "31 Jul 2007 — 6:10pm",
      "content": "We also just finished the first day of volunteering. We stuffed the goody bags full to the brim with goodies like type specimens of Arno Pro and Beorcana. And then we stuffed them again, all 500+ bags, when we found an entire extra pallete of goodies we had missed.\n\nLots of free swag. You'll enjoy most of it.\n\nPeople are arriving every minute now, and you're bound to run into somebody in the lobby if you hang around enough.\n\n"
    },
    {
      "time": "31 Jul 2007 — 6:19pm",
      "content": "I think those of us stuck at home should be the ones getting the goody bag. After all, you are all getting to enjoy the conference!\n\nSharon\n\n"
    },
    {
      "time": "31 Jul 2007 — 6:58pm",
      "content": "Hey, Sharon, let's commiserate over some beers -- you in MA, me in NY. :-/\n\nThe TypeCon attendees deserve those goodie bags, and the t-shirts -- it's part of the TypeCon experience! But I feel just as bad as you do that I can't be there this time.\n\n"
    },
    {
      "time": "31 Jul 2007 — 7:01pm",
      "content": "Well, I'm just a Type groupie anyway, so most of the conference would be over my head, but Dan got me going when he mentioned free stuff!!!\n\nA beer sounds good, it's been muggy here. :-)\n\nSharon\n\n"
    },
    {
      "time": "31 Jul 2007 — 7:10pm",
      "content": "Same here -- cheers! :-)\n\n"
    },
    {
      "time": "31 Jul 2007 — 10:03pm",
      "content": "Hey Si,\n\nHow are you planning to hook up with the folks for the Friday night baseball game? You mentioned the Carter exhibit was near the stadium, but I didn't know if that was where we were meeting. Do you have a way to get tickets to anyone who may not be going to the Carter exhibit at that time?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "31 Jul 2007 — 10:26pm",
      "content": "Anyone up for some beers in the hotel bar? I just got back from Canada and there’s nothing on TV...\n\n"
    },
    {
      "time": "1 Aug 2007 — 12:09am",
      "content": "\\>How are you planning to hook up with the folks for the Friday night baseball game?\n\nIf people don't bump into me before Friday I'll have them at the MC show, and will pass them out there.\n\n"
    },
    {
      "time": "1 Aug 2007 — 2:10am",
      "content": "Just got back from a fabulous evening with many type geeks from all over the place. Our volunteers today were fabulous!!! Seattle rocks for TypeCon. The next five days are going to be fantastic...\n\n"
    },
    {
      "time": "1 Aug 2007 — 6:28am",
      "content": "I've just arrived at Seattle from Tokyo.  \nI'm really exciting because this is the first time to attend TypeCon,  \nand I'm looking forward to joining today's workshop and Helvetica movie.\n\n"
    },
    {
      "time": "2 Aug 2007 — 12:38am",
      "content": "Day 2 is complete!\n\nWhat you may have missed:  \nA ton of volunteers busting their butts to make sure that things flow as seamlessly as possible. I can't name everyone, but certainly Kent Lew and Michelle Hill deserve a round of applause for the hard work they've been doing in directing the various students and type refugees in making Typecon2007 the best ever!\n\nQuote(s) of day 1:  \nJeff Barlow of AIGA Seattle:  \n**\"We're volunteers; we don't have names.\"**\n\nor\n\n**\"Is there anyone at the table as smart as me?\"**\n\nQuote of day 2:  \nOtmar Hoefer, Director of Font Marketing at Linotype Library:  \nRegarding Helvetica set as text copy:  \n**\"You can read it if you want to.\"**\n\nI won't be there for most of day 3, so if you get a quote, post it!\n\n"
    },
    {
      "time": "2 Aug 2007 — 9:03am",
      "content": "Sitting in Miguel's hinting class waiting for it to start. The weathere here is fabulous. Don't believe all that rain stuff!!\n\nChrisL\n\n"
    },
    {
      "time": "2 Aug 2007 — 10:18am",
      "content": "Do you guys know how jealous this all is making me?\n\n"
    },
    {
      "time": "2 Aug 2007 — 10:36am",
      "content": "I'm missing out this year due to a scheduling overlap that I cannot break. I'm bummed that I won't get to see those of you I've been fortunate enough to meet and hang out with in the year(s) past. And I was really looking forward to Seattle and my annual dose of strong type mojo. Ah, well. Such is life. At least I've got Typophile to fill the void.\n\nHave a great time, everyone. See you in '08.\\*\n\n\\*I hope!\n\n"
    },
    {
      "time": "2 Aug 2007 — 11:41am",
      "content": "Mr. Lozos, save me a shirt. :)\n\n"
    },
    {
      "time": "2 Aug 2007 — 11:46am",
      "content": "Terry,\n\nSize?\n\nChrisL\n\n"
    },
    {
      "time": "2 Aug 2007 — 11:47am",
      "content": "X-tra large, sir.\n\n"
    },
    {
      "time": "2 Aug 2007 — 8:06pm",
      "content": "_directing the various students and type refugees_\n\ntype refugees -- great term! :-)\n\n"
    },
    {
      "time": "2 Aug 2007 — 11:09pm",
      "content": "<cite>Do you guys know how jealous this all is making me?</cite>\n\nNot as jealous as you would be if we were providing details...\n\n"
    },
    {
      "time": "3 Aug 2007 — 8:10am",
      "content": "Ok, so not kissing butt here...  \nStewf deserves a round of applause. Give it up for Mr. Coles himself. Working for Typecon AND Fontshop, he's been working round the clock to keep Typecon rolling and Fontshop selling. A one man army, this guy deserves his own assistant!\n\nEnter the butt kissing...  \nAnd Tamye, OMIGOD! Tamye Riggs and Shu have been kicking butt and taking names all week. As soon as the type gallery gets fixed, Shu will enter the Pantheon of Type Gods. All hail the Shu.\n\nQuote (Probably Apocryphal, and totally misquoted through drunken sources, but what the hey...):  \nAdam Twardoch in a thick Polish accent:  \n**\"Rubber mallet? That's good for back massages?\"**\n\n(By the way, Adam does not know what Tater Tots are, so if you get a chance, please enlighten him to the vagaries of the most requisite of American dishes...)\n\nEDIT:  \nNamespllng courtesy of Simon Daniels, boss of Arial.\n\n"
    },
    {
      "time": "3 Aug 2007 — 6:03am",
      "content": "That would be Shu ;-)\n\n"
    },
    {
      "time": "3 Aug 2007 — 8:49am",
      "content": "Minute by minute play: [http://typophile.com/blog/1160](http://web.archive.org/web/20150215061025/http:/typophile.com/blog/1160 \"http://typophile.com/blog/1160\")\n\n"
    },
    {
      "time": "4 Aug 2007 — 2:03am",
      "content": "Day 4:  \nQuote 1)  \nMy (non-designery) roomate's reaction at the Red Sox game concerning Si's Battlestar Helvetica t-shirt:  \n**\"Wow. It's like two giant nerd things all wrapped up into one!\"**\n\nQuote 2)  \nSame Red Sox game, this time Si's wife's response to the question if she was a type person also:  \n**\"No, I'm not. I guess you can say I'm a type widow.\"** Ha!\n\n"
    },
    {
      "time": "5 Aug 2007 — 5:13am",
      "content": "Um, wow. What a day/night. Started off with Bringhurst and Bantjes, and ended with a rocking party with tunes courtesy of Jared and Joe, our beloved Typophile founders... it was a magnificent day, fillled with inspiration and education and fun - thanks to all who are here and those we miss from afar.\n\n"
    },
    {
      "time": "5 Aug 2007 — 5:19am",
      "content": "\\> Si’s Battlestar Helvetica t-shirt\n\nI MUST see that shirt, and then I'll probably have to own one, too.\n\n"
    },
    {
      "time": "5 Aug 2007 — 9:16am",
      "content": "Day 5 Quote:  \nMike Parker (Actually, Mike Parker deserves every quote of the day.)  \nWhen given the option to wear my fake mustache/wig combo that would eventually go on to an award winning™ career in cheesy 80s attire, but passing on it:  \n**\"I chickened out.\"**\n\nWould Mike Parker have won if he had dressed up? Absolutely.\n\nHis loss, my free FontBook. Ha.\n\n"
    },
    {
      "time": "6 Aug 2007 — 8:19am",
      "content": "_Si's Battlestar Helvetica t-shirt_\n\nI'm with ultrasparky. I HAVE to see that, Si! Any photos? :-)\n\n"
    },
    {
      "time": "6 Aug 2007 — 11:06am",
      "content": "Day 6 Quote:  \nMike Parker, again, talking about J.P., the A/V wizard Minnesotean who ran the show:  \n**\"She's REALLY fun\"**\n\nAs to the Battlestar Helvetica shirts, they were on sale at the Typecon store, but I don't remember who put them together.\n\n"
    },
    {
      "time": "6 Aug 2007 — 11:20am",
      "content": "Microsoft's own (and our own) Si Daniels is responsible for the Battlestar Helvetica shirts. I told him we need girlie sizes for next year!\n\n"
    },
    {
      "time": "6 Aug 2007 — 11:49am",
      "content": "My (non-designer) boyfriend is getting Battlestar Helvetica for his birthday. Thanks to Gary even lawyers can be taught to appreciate fonts!\n\n"
    },
    {
      "time": "6 Aug 2007 — 8:34pm",
      "content": "What, this one? Not sure I know anything about it ;-)\n\n ![](http://web.archive.org/web/20150215061025im_/http:/typophile.com/files/June%20302_5474.jpg)\n\n"
    },
    {
      "time": "6 Aug 2007 — 9:40pm",
      "content": "That is so great, Si... Master of the (Typographic) Universe! :-D\n\n"
    },
    {
      "time": "7 Aug 2007 — 8:45am",
      "content": "Si,  \nIs it too late to buy one of those Battlestar beauties?\n\nChrisL\n\n"
    },
    {
      "time": "7 Aug 2007 — 9:23am",
      "content": "overheard:  \n\"man ... Matthew Carter is one classy dude\"\n\nalso memorable:  \n\"... she'll be a beautiful woman when she grows up.\"  \n- John Downer on Profeta Light\n\n"
    },
    {
      "time": "7 Aug 2007 — 10:50am",
      "content": "Chris, drop me a line simonda@ you know where and I'll get one out to you.\n\nWe may get another run of these done, for some reason they proved more popular than we expected. ;-)\n\nCheers, Si\n\n"
    },
    {
      "time": "7 Aug 2007 — 11:05am",
      "content": "Thanks Si!\n\nChrisL\n\n"
    }
  ]
}
