{
  "id": "35602",
  "title": "A teacher with dangerous advice!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am a recent grad and in my final class I had a teacher who I and many of the students butted heads. I don’t believe her to be a great designer and she consistently tried to force the students to produce work to her own taste as oppose to developing their own voice. This is all beside the point, I am posting here for she gave me and the students advice that I would think to be career ending. She said to find type faces by any means necessary and use them in our work, I think this is fine as long as it is just for student purposes and the work never goes to print. How ever she also stated that in all the years of her own career she has payed for only two or three fonts herself. When asked about the legal ramifications of this practice she simply stated “who is going to check.” I know this is absolutely wrong and would never do this myself not only because it is immoral but what would happen if someone did find out. What are the penalties for doing such a thing and how do people like her get away with it for so long?  \n-Thanks\n\n [‹ font management?](http://web.archive.org/web/20080612045100/http:/www.typophile.com/node/35411 \"Go to previous forum topic\") [License plate typography ›](http://web.archive.org/web/20080612045100/http:/www.typophile.com/node/27362 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080612045100/http://www.typophile.com/user/20124\" title=\"View user profile.\">Mark Typo</a>",
  "time": "<br>",
  "uid": "20124",
  "comments": [
    {
      "time": " 31.Jul.2007 10.33pm",
      "content": "Pro-piracy attitudes from design teachers are pretty common in my experience, albeit not this blatantly.\n\nAs for the penalties, well, a good IP litigator will run you at least $300 an hour, if he likes you. One who can deal with the law surrounding fonts is probably even more. And the bad press that comes from suing (perceived) customers can be really nasty, so going after individual fonts pirates is sort of a lost cause.\n\n"
    },
    {
      "time": " 31.Jul.2007 10.46pm",
      "content": "Font piracy aside, I question the ethics of a person who pursues a personal vendetta in a public forum. Posting her site was in very poor taste in my opinion.\n\n"
    },
    {
      "time": " 31.Jul.2007 11.28pm",
      "content": "I agree that was in poor taste and have remove the site. But certainly she should at least provide proper advice in the future.\n\n"
    },
    {
      "time": " 31.Jul.2007 11.32pm",
      "content": "Type design wouldn’t be a good career move even if the piracy situation weren’t as bad as it is. I can deal with designers who pirate for pre-publication use but who license the font for publication. I know pirates who make their clients buy a font each time they use it, which is good for the designers, since they are actually overpaying. People like [Edited by moderator] who allegedly steal as a way of life and encourage others to do so annoy me. But how annoyed can you get at someone who is such a bad artist? It’s painful to have to consider persons so poorly favoured. Leave the poor creature alone!\n\n"
    },
    {
      "time": " 1.Aug.2007 12.07am",
      "content": "billtroop,  \nplease remove her name from your post I agree that is was wrong of me to post the site. so I would appreciate it if you would not use her name. Though I do have my problems with this person a did graduate with a good portfolio. Posting her information was a mistake, one which I had not thought through.\n\n"
    },
    {
      "time": " 1.Aug.2007 12.39am",
      "content": "If push comes to shove, just report her to your school’s technology services. Those guys, in my experience, are just itching to bust people for piracy in any form on any school owned computers.\n\nIn fact, they tend to go way overboard, and force people to use only the fonts originally supplied by the system admin, which in a way could be a good thing.\n\nHaving a teacher emphasize the use of many typefaces indicates to me that she is covering up a general typographic weakness. A good designer/typographer should be able to “make do” with only a handful of fonts.\n\n"
    },
    {
      "time": " 1.Aug.2007 1.45am",
      "content": "[Edit]  \nI’m with Russ on this. Your embittered gripe and allegations should be addressed to your tutor and the educational establishment concerned first, not publicly vilify her on an web forum. You gave us her website and have in that way named her (which I think is really spiteful). At least let her know what you’ve done, so that she might have the opportunity to respond to your claims.\n\n"
    },
    {
      "time": " 1.Aug.2007 3.26am",
      "content": "MarkTypo—\n\nDan Gayle has an excellent suggestion for you and I would like to add one more thing. I neither know the people involved nor the school attended. My suggestion therefore is for you to write to the administration and let them know the information you’ve been taught, and what you should have been taught when it comes to legal matters. That way, they have the opportunity to address this situation with their entire faculty, and not misguide the students there.\n\nBTW - if you do, keep it upbeat. Thank them for the wonderful education, the fine teachers, etc. but let them know that the teachers are given poor advice to students and you would like them to address the matter. You are not asking for them to fire anyone, just educate them so they can educate the next generation of designers.\n\nGood luck out in the real world...\n\n"
    },
    {
      "time": " 1.Aug.2007 5.24am",
      "content": "\\>A good designer/typographer should be able to “make do” with only a handful of fonts.\n\nTruer words were never spoken — though why place make do in scare quotes?\n\nI think Mark’s original impulse was good. If you want to steal/not steal/delude yourself into thinking you’re the reincarnation of Robin Hood, that’s a personal decision, a very personal decision. When it becomes institutionalized, taught, it’s in a different category and I see no reason why this person shouldn’t be named and shamed by everyone who henceforth ever googles her. She, and nobody else, has chosen to make her behaviour public by teaching it. You don’t get more public than that. I don’t think she has any presumption of privacy on this issue. How sleazy it all is!\n\n"
    },
    {
      "time": " 1.Aug.2007 5.49am",
      "content": "As an educator, this just ticks me off (the teacher, not the student). My suggestion would be for Mark to publish online all the course outlines, lecture notes, tutorials, and any other work that the teacher had put together over the course, and then tell her that since she is in favor of sharing other peoples work without compensation, you felt it was fair to share her work.\n\nMany teachers I know feel no pang of guilt at using the work of others, but are adament that they will not share their work without compensation. I am constantly trying to convince teachers that the Internet is not a buffet placed for them to pick and choose illustrations for their lectures without asking permission.\n\n(And of course, after the point has been made to the teacher, Mark should then remove the materials, since two wrongs have never equalled a right ... although three lefts do.)\n\n"
    },
    {
      "time": " 1.Aug.2007 6.11am",
      "content": "Come on Bill, don’t turn typophile into a pillory. As far as I can tell, all we got is an unconfirmed accusal by an anonymous who just created an account to tell us this story.  \n(That doesn’t mean it has to be wrong, but, well you know … witch-hunt, anyone?)  \nI think this issue can be debated without the name.\n\n"
    },
    {
      "time": " 1.Aug.2007 6.43am",
      "content": "_A good designer/typographer should be able to “make do” with only a handful of fonts._\n\nYes, you can always cook with the ingredients at hand if needs be, but shopping around makes the meal more interesting.\n\n"
    },
    {
      "time": " 1.Aug.2007 7.04am",
      "content": "These days, copyright infringement is punishable by firing squad, I believe.\n\n"
    },
    {
      "time": " 1.Aug.2007 7.05am",
      "content": "\\>\\>I think this issue can be debated without the name.\n\nIt’s an issue I’ve always had with ratemyprofessors.com. Oftentimes people use the anonymity as a license to attack a professor’s reputation, and none of is necessarily qualified. It’s interesting that what gets shot down on Typophile, even in the context of what is perhaps Unforgivable Type Crime #1, flies like crazy elsewhere on the internet.\n\n"
    },
    {
      "time": " 1.Aug.2007 7.07am",
      "content": "_These days, copyright infringement is punishable by firing squad, I believe._\n\nI heard a rumor about this - but I just thought it was ’cause I’m now in the South...\n\nSo “it’s true... it’s true!” (—Madeleine Kahn)\n\n"
    },
    {
      "time": " 1.Aug.2007 9.31am",
      "content": "Mark Typo,\n\nAll of the name her/don’t name her stuff aside, the fact that her students marked her as a hack and a thief is a good indication that she’s reaping the rewards of her attitude already. There is very little penalty enacted for this behavior. Penalties do exist, but I have never been ticketed for jaywalking, in spite of the penalties for that, and it’s much the same with typeface piracy. It’s too hard for the people who have a stake in type to go hunting down the ’pedigree’ of every design piece out there, if not impossible. I’ve only ever heard of large companies being taken to task for being stupid (UPS with the Dax rip-off).\n\nI’m sure that Linotype or whoever could start auditing people, but that’s also a bit of PR nightmare, because there are few designers/firms without a few licensing skeletons in their closets, either by mistake or by design. Additionally, it can be due to the attitudes of higher-ups that lead to this sort of behavior: who’s going to risk their neck at work by threatening their boss with exposure to legal action? That would be suicide, frankly. And then there’s the flip side: the designers bring in their fonts and slip them into projects without proper licensing. When it’s 2 AM and the deadline’s tomorrow, who will scrutinize that stuff?\n\nThat being said, it’s not impossible. Sometimes simply taking responsibility for the often tiring and pedantic job of managing font licenses is enough to encourage compliance. I’ve seen instances where it is simply left undone becaues it can be a bit onerous. I’ve found success in taking this stance, as well as simply making it known that I don’t tolerate it.\n\nJust an FYI, [here’s Linotype’s offical word on penalties](http://web.archive.org/web/20080612045100/http:/www.linotype.com/1710/licenseagreement.html?PHPSESSID=3ecba013275ca7f2f8cc4e0b24caeb8e) from their License Agreement:\n\n———-  \nArticle 4  \nTermination of License Agreement\n\n4.1 The license and usage right guaranteed under subsection 1.2 shall become immediately null and void in the event of a breach of this contract.\n\n4.2 If the licensee or one of the licensee’s employees breaches the agreed-upon license and right of use and/or property rights of Linotype GmbH, Linotype GmbH has the right to terminate the license and right of use, with termination taking immediate effect. Linotype GmbH reserves the explicit right to assert any further claims (specifically information, compensation for damages, etc.).\n\n4.3 In the event of termination, the licensee is obligated to delete and return to Linotype GmbH the original Font Software affected by and pertaining to the termination, including documentation and all copies.  \nAt the request of Linotype GmbH, the licensee is obligated to provide written assurance that said deletion has occurred.  \n———\n\nI’m not sure how standard this is, but I’d bet most EULAs specify the right to pursue damages in court.\n\n"
    },
    {
      "time": " 1.Aug.2007 9.37am",
      "content": "I too have a problem with site such as ratemyprofessor for you can’t tell if a poster is being truthful or not, and realizing that I was doing something much like that I decided to remove her site. I am certainly telling the truth, but I have know way of proving it and perhaps she herself was exaggerating when she made the comments, though having gotten to know her a bit, I don’t think she was. As for a witch-hunt, I am very bitter. I work very hard for three years to become certified and the culmination of all my hard work was this class, where she was able to go though all of my past projects and put her grubby little prints all over them. She still gave me a good grade, though, and I will be able to fix the things she has changed. I was going to chalk it up to experience when I read another person on another board complaining about his type work being used without compensation. This reminded me of her advice and how mad it made me, for she wasn’t simply stating what her practices are but encouraging the students to do the same. I don’t care if she destroys her career but her advice could destroy the career’s of her students.\n\nAm I Bitter, Yes.  \nDo I really want to be the one to crucify her, not really.  \nWould I shed a tear if she lost her professorship, not at all.\n\n"
    },
    {
      "time": " 1.Aug.2007 10.07am",
      "content": "I think you have a right to complain but outing her here isn’t the proper way - I’d talk to her superior at the school. Before doing so you should know your school’s policy on fonts for students - do they have group licenses, etc. or do you each buy your own?\n\n"
    },
    {
      "time": " 1.Aug.2007 11.32am",
      "content": "\\> Penalties do exist, but I have never been ticketed for jaywalking, in spite of the penalties for that, and it’s much the same with typeface piracy.\n\nExcept that for jaywalking, you are not depriving someone of their livelihood.\n\n"
    },
    {
      "time": " 1.Aug.2007 11.34am",
      "content": "You should notify both her academic superior AND the school’s information technology department. Be clear that it’s not only that she pirates the fonts herself, but she \\*also\\* encourages her students to do so.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 1.Aug.2007 11.54am",
      "content": "_Penalties do exist, but I have never been ticketed for jaywalking, in spite of the penalties for that, and it’s much the same with typeface piracy._\n\nExcept that for jaywalking, you are not depriving someone of their livelihood\n\nAnd though my mother has been dead for 25 years, I can still remember the day she came home with a ticket for jaywalking. To add insult to injury - she was only one foot away from the crosswalk.\n\nPeople do get tickets - but a policeman has to be around to give it.\n\nOne problem manufacturers do have is the policing...it can get very expensive going after one person for one font - much better to go for a healthy company with lots of bucks...\n\n"
    },
    {
      "time": " 1.Aug.2007 11.56am",
      "content": "“Except that for jaywalking, you are not depriving someone of their livelihood.”\n\nOf course, you’re not usually depriving anyone of their livelihood when you infringe upon a copyright, either.\n\nAt worse, you’re depriving someone of a ’potential and theoretical unit sale’ but that’s typically just a small fraction of the total amount of infringement instances.\n\nI’m certainly not advocating copyright infringement...especially in the manner this professor is, but let’s not go spreading FUD about it either.\n\n"
    },
    {
      "time": " 1.Aug.2007 12.15pm",
      "content": "It’s the equivalent of your teacher walking into class and saying - hey, I shoplifted my entire outfit from Filene’s Basement. You kids should know that their security isn’t that good. Believe me if a prof was walking around saying that it would have made its way up the food chain by now. Part of a teacher’s job is to set an example.\n\n"
    },
    {
      "time": " 1.Aug.2007 12.16pm",
      "content": "_Part of a teacher’s job is to set an example._\n\nSo true Patty.\n\nIt is unfortunate that we are now living in an age of “without responsibility” to bartenders getting fined for getting you drunk, and the victim having to pay the robber till their death...\n\nReally, what has happened to society?\n\n"
    },
    {
      "time": " 1.Aug.2007 12.30pm",
      "content": "When the president is a war criminal, the attorney general lies under oath, POWs are being tortured, and anaesthetized Americans care more about what dog Paris Hilton just got, what do you expect?\n\n"
    },
    {
      "time": " 1.Aug.2007 1.54pm",
      "content": "Paris Hilton just got a new dog!?\n\n"
    },
    {
      "time": " 1.Aug.2007 3.52pm",
      "content": "If you are interested in protecting and advancing your career, at the very very very least you don’t make admissions against self-interest. Once you admit to knowingly breaking a rule or law, you are unprotected against the opportunists and enemies you may have in your classroom, workplace, family, etc. Maintaining the image of propriety is as basic as brushing your teeth.\n\nWhatever other errors in judgment this teacher may make in her life, she is certain to one day be fully hoisted on her own petard if she still has no mastery over this most basic rule. This student, however, has demonstrated an impatient willingness to exploit her admission, a noble inclination to hold other people accountable to the law, an indignant and surprised righteousness, a false modesty, and a knowledge that social orders can be realigned. He is sure to enjoy a nice career irrespective of his merits or abilities. I give him an A+. In fact, when I read the original post again—the badmouthing her talents, the supposed solidarity of opinion among the students, the handwringing over how her advise is putting others in danger, the professions of purity (I would never do this!)—it makes me pretty nauseated. A++\n\n"
    },
    {
      "time": " 2.Aug.2007 4.39am",
      "content": "“in all the years of her own career she has payed for only two or three fonts herself”\n\nThere is not enough information here to determine whether that is a good thing or a bad thing.\n\nBeside that, “All the years of her own career...” could be four, and her clients could have paid for all but 3 or 4 fonts, leaving enough for her own corporate identity and personal use forever. So, I wouldn’t call her boss.\n\nCheers!\n\n"
    },
    {
      "time": " 2.Aug.2007 5.49am",
      "content": "She’s a university professor, she has to have more experience than that.\n\nPoint is, she’s making the students feel like only suckers pay for fonts and that’s not cool. She can do whatever she wants and probably won’t get caught but she ought to keep her mouth shut.\n\n"
    },
    {
      "time": " 2.Aug.2007 10.33am",
      "content": "_Except that for jaywalking, you are not depriving someone of their livelihood_\n\nOh, absolutely. I was simply drawing an example based on what first came to mind. Of course, piracy is a crime that becomes truly problematic when its institutional or cultural, because it usually involves small bites by an individual (one album out of thousands sold, one font license out of hundreds) at which point combatting it becomes a nightmare. If I steal a font (I don’t, by the way), it’s dollars not making it to a designer and their distributor; if everyone in my office does, it’s paychecks. Digital distribution is a double-edged sword.\n\nAnd David makes a good point. The devil’s in the details. (Not that I need to tell a bunch of typophiles that, I suppose.)\n\n"
    },
    {
      "time": " 2.Aug.2007 11.09am",
      "content": "In this You Tube age, I think it is a bit disheartening that an individual can’t make a verbal mistake without being assaulted. This doesn’t mean that people don’t make terrible mistakes, but it also doesn’t mean that people should be ostracized for being human. We seem to expect people to be above human which is simply not fair.\n\nThis is not a put down of You Tube by the way. When issues like this come up I often think of Jeff Goldblum’s line in Jurassic Park: _“Just because you could, doesn’t mean you should.”_\n\n"
    },
    {
      "time": " 2.Aug.2007 11.22am",
      "content": "The professor has a large number of pieces in her portfolio dating back to 1997, most of which use a different font. You may consider her a kind of font glutton. Her comment in class was not an explanation of how to get other people to pay for your fonts or make do with the ones you have, but more, the fonts are out there, take them and no one will ever know.\n\n"
    },
    {
      "time": " 2.Aug.2007 12.01pm",
      "content": "“Come on Bill, don’t turn typophile into a pillory. As far as I can tell, all we got is an unconfirmed accusal by an anonymous who just created an account to tell us this story.  \n(That doesn’t mean it has to be wrong, but, well you know … witch-hunt, anyone?)  \nI think this issue can be debated without the name.”\n\nI agree with this. But I dislike the idea of editable posts; I dislike censorship in this kind of discussion, even self-censorship. Certainly what’s her name should have a chance to respond to this thread ... has anyone told her what’s going on?\n\nI agree with Thomas that “Be clear that it’s not only that she pirates the fonts herself, but she \\*also\\* encourages her students to do so” is a crucial distinguishing factor here.\n\nNobody would be debating this incredibly tiresome issue yet again if her name wasn’t there, or hadn’t been there. That provides the frisson which draws us. But it is surely dreadfully unfair to name and shame someone without letting them know or respond. That for me is the outstanding issue right now. As for my responsibility for deleting the name, all I can say is that of the thousands of dreadfully tactless posts I have made, I have never retracted a syllable even though I would be delighted to unsay a million things. But .... it just seems to pretend, so inauthentic, so unconvincing, so —- I just don’t know how to handle it.\n\n"
    },
    {
      "time": " 2.Aug.2007 2.02pm",
      "content": "A cautionary tale: I once posted on this forum a story about an unpleasant design experience I had a few years back. I used the name of the client because the name was germane to the story. Unfortunately, she googled her company name and found the link (even tho it was buried deep). The good news is that I had only nice things to say about her product; the bad news was I called her a “nightmare client” and “her own worst enemy” and “dreadful taste” and she read about it. OOPS! I’ll be more careful next time...\n\nSo this stuff does get back to you. Bill, you should really remove the name from your post as requested, even if it goes against your “anti-censorship” stance. [I edited my post here to add the ’r’ at the end of ’your’ for grammatical reasons]\n\nAnd IMHO Mark your prof should be teaching painting, not design. Her abstracts are lovely.\n\n"
    },
    {
      "time": " 2.Aug.2007 2.31pm",
      "content": "Bill,  \nI used poor judgment by posting her site and that is why I chose to censor myself. You on the other hand had to have made a conscious decision to uncensor me. For as soon as I made my edit, you posted her name in your remarks in a way that I believe not to be part of the natural flow of conversation, but forced. Much like a politician who talks about something egregious and inserts his targets identity. I do agree this would not have been discussed at such length if it were totally anonymous., but I would like you to remove your post anyway. To be perfectly honest and at risk of supporting Cooper’s opinion of me, I do not want her evolved for I am not as of yet out of the clutches of the School and hence her own as well. I realize that I am serving my own interests and perhaps I deserve it for letting my emotion (spite) to get the better of me, but I’d rather not have to fight her on another front right now.\n\n"
    },
    {
      "time": " 2.Aug.2007 2.36pm",
      "content": "Agreed,  \n Her paintings are nice but she should be a painter, not a teacher at all. Which I believe is the way she is heading anyway. By the way I edit my posts for spelling and grammar all the time, though not very well. The dang spell check can only do so much.\n\n"
    },
    {
      "time": " 2.Aug.2007 7.04pm",
      "content": "Her paintings are gorgeous—and it seems that Mr. Typo you have gotten your wish, courtesy of a moderator.\n\n"
    },
    {
      "time": " 3.Aug.2007 1.31am",
      "content": "This is so pathetic. You take away her name and then all you can do is talk about her paintings — to those of us who know her name. So now there’s the in-crowd — the moderators and the people who got here soon enough — and there’s the out-crowd — who don’t know whose ’gorgeous’ paintings are being discussed. (I must say I think they are amongst the most tiresome pieces of provincial dreck I have ever seen, moreover that they are perfectly consistent with the personality profile of someone who would want to teach her students to be digital pickpockets.)\n\nMark, you write,\n\n\\>I used poor judgment by posting her site and that is why I chose to censor myself. You on the other hand had to have made a conscious decision to uncensor me. For as soon as I made my edit, you posted her name in your remarks in a way that I believe not to be part of the natural flow of conversation, but forced.\\<\n\nMark, you are establishing for youself the profile of a rather overhasty overreacter. “As soon as I made my edit, you posted her name” you claim.\n\nWhat if I didn’t see your edit? What if I was responding from a refresh of a couple of hours before or even the day before? If this is your standard of trial and judgement, I think my sympathies may revert to old what’s her name with that Persian cat. As chronic ringworm is endemic in American Persian cats, there’s another reason to sympathize with Riva or Rita or whatever her ill-omened name was.\n\n“Much like a politician who talks about something egregious and inserts his targets identity.”\n\nMark, has anyone ever suggested you might be projecting?\n\n“To be perfectly honest and at risk of supporting Cooper’s opinion of me, I do not want her evolved for I am not as of yet out of the clutches of the School and hence her own as well.”\n\nFrom what I’ve heard off list you’ve made so many enemies over this that you might just as well pack up and start going to law school or something. But change your name first.\n\n“I realize that I am serving my own interests”\n\nNot until you stop posting.\n\n"
    },
    {
      "time": " 3.Aug.2007 1.50am",
      "content": "Bill writes:  \n\\>_From what I’ve heard off list you’ve made so many enemies over this that you  \n\\>might just as well pack up and start going to law school or something._\n\nHuh??? Can this readly happen to an anonymous poster writing (mostly) anonymously about a professor and her said school?\n\n"
    },
    {
      "time": " 3.Aug.2007 5.11am",
      "content": "Impossible to answer this as written: do you mean readily or really? What is ’mostly anonymously’? Is that like being ’mostly’ pregnant? And do you mean ’said’ school as in the quaint old legal usage (which implies that the school has been explicitly named in a previous clause) or do you mean ’sad’? Or do you mean something else quite different, Dan? In a way, it’s rather thrilling to see so much ambiguity in one simple sentence. Fond Greetings, Bill\n\nPS: Re the censorship thing, I don’t like this Puritanical way of doing things. I prefer the Wikipedia model, where you can’t actually erase anything — it’s all in the history where anyone with enough patience can find it. I really feel strongly about this.\n\n"
    },
    {
      "time": " 3.Aug.2007 6.07am",
      "content": "I really don’t understand why editing your own post is considered censorship.\n\nAnd Bill if you don’t like it, then goodbye and don’t let the door hit you on the way out.\n\n"
    },
    {
      "time": " 3.Aug.2007 6.29am",
      "content": "Well, the writer was anonymous, and he named the professor, but then cut that part out, anonymousing her in the process, which was for the best, in my opinion. But while it was still possible to know the professor’s name, I guess that it would have been possible to link her to the school, which wasn’t ever explicitly named in the discussion, as far as I know. Sorry for not being clearer, and for my obtuse run-on sentences. I have a tendency to do that. I just wanted to ask you to elaborate on your statement, the one I quoted in my post above. I find it difficult to believe that a thread without a lot of details or clear statements could make someone have a lot of new enemies :-(\n\n"
    },
    {
      "time": " 3.Aug.2007 7.12am",
      "content": "“I really don’t understand why editing your own post is considered censorship.”\n\nIt’s worse. It’s lying. It’s pretending you didn’t say something, in public, that you did say in public. It is totally, 100 percent, dishonest. It is a kind of mendacity which I find utterly despicable.\n\n“And Bill if you don’t like it, then goodbye and don’t let the door hit you on the way out.”\n\nSame to you but with fraises des bois and whipped cream on the side.\n\n“I find it difficult to believe that a thread without a lot of details or clear statements could make someone have a lot of new enemies :-(“\n\nWell I’ve just made at least one new enemy, Patty, without even trying. But as for what you were talking about, Dan, don’t you think there’s a small possibility I might have been pulling someone’s leg? Just a possibility, mind you.\n\nMark’s bound to have at least one new enemy when R-word finds out what he’s been posting about her. Plus, faculty will probably stand behind her, and administration, and if not, well, at least her cat will, so that’s two enemies, one of them with pretty sharp claws. Oh God, the things one will do not to work on a typeface!\n\n"
    },
    {
      "time": " 3.Aug.2007 7.16am",
      "content": "Ooh, now the enemies list is starting to build. (Oh no, am I going to be on it for posting this?)\n\nBill, Patti is a well respected member of the group, for longer than I have been here. I don’t think you are going to gain points with the rest of us by claiming she is your “enemy”.\n\n"
    },
    {
      "time": " 3.Aug.2007 8.03am",
      "content": "I basically agree with Bill on one subject - once a post is responded to it should become uneditable. That is the only reasonable way to have coherent threads.\n\npbc\n\n"
    },
    {
      "time": " 3.Aug.2007 8.08am",
      "content": "And you won’t gain any points with me if your sense of humour doesn’t improve. So this is the new aristocracy in type? Those who have been on typophile for x years? Patti sailed over on the Mayflower, as it were? An august founding mother of type? Defending the gates against the notorious Barbarian, Bill?\n\n"
    },
    {
      "time": " 3.Aug.2007 9.08am",
      "content": "It is impossible to tell what is really meant by any of the statements. As we read these post we assign an internal narrator that defines the tone of what we are reading. Bill maybe joking while writing his post but as we read we don’t have his voice to give us the cues we need to decipher his emotion, so we insert a substitute. Bill says that I am a “overhasty overreacter”, I believe myself to be an over analyzer, yes, but overreacter, I am probably the farthest from it. My previous comments to you Bill was my interpretation of the situation based on the fact that you have an apparent problem with censorship, and my Belief that the way you used the name of he professor in tour post not to be natural. I was not angry when writing the post nor did I mean to attack you. I read your comments as an attack on me however, though you your next post will probably be something to the sound of “I was just poking fun, toughen up kid, you need to have thick skin to work in this business.” I really don’t care either way. I am here for information, amusement and perhaps to make some friends. I don’t believe I am making a lot of enemies, sure some group members will probably always see me in poor light for my original lack of judgment, but I have done all that I can to remedy that. As for profiles I think your profile, Bill, may be suffering more then my own due to this thread.\n\n"
    },
    {
      "time": " 3.Aug.2007 9.41am",
      "content": "Taking Paul’s point: that’s absolutely true. There’s no chance of coherence if anyone can edit at will. I look at it from a different perspective. I’ve been on type listserves and newsgroups since the early 90s, when they were just coming out. There was no way to edit once you had said something. You had to take responsibility for saying whatever you said. Is there something wrong with that?\n\nOne difference with a listserve is that it \\_can\\_ be private, theoretically — if the list isn’t made public. This is what happened, for example, to the ATypI list, a few years ago. Hrant Papazian said some things about John Downer that his publisher Zuzana Licko didn’t like. She contacted Cynthia Hollandsworth and threatened to sue if the offensive posts were not removed. Instead, ATypI chose to take the list private.\n\nAt that time, both parties to the dispute decided \\_not\\_ to tell Hrant that it was his actions that led to the ATypI list being closed, on the sensible grounds that if he found out, he’d make a very great deal of noise about it. I’m being a little naughty, revealing it here for the first time .... so I might as well add the quaint detail that amused me the most, which was that Cynthia had no idea who Licko was or of the high esteem in which she then was held by some. She referred to her as ’some woman’.\n\nI know I’m going to regret posting this. It’s bound to make me new and influential enemies .... yet somehow, in spite of my dreadful history of 15 years of dreadful public indiscretions in type, the people who really matter still talk to me, perhaps because they know I love their work, and sometimes come close to understanding it.\n\nWhen I was first on the Type Design List and to a very limited extent Typo-L, they were not available to non-subscribers on the net but I think they now are. Very embarrassing in some cases.\n\nThe lists have largely been taken over by blogs such as typophile and typographica. I don’t think posts should be editable. You want to make a public pronouncement? Then take the responsibility for doing so.\n\nTaking it a level further, what about the case of the internet AA group where someone confessed to a murder? I know the girl who outed him to the police. Want to bet he wished he hadn’t posted? Yet that is a case where there was a far greater presumption of privacy ....\n\n"
    },
    {
      "time": " 3.Aug.2007 9.47am",
      "content": "I don’t think my profile — whatever that is — can get any worse. Such considerations have never moved me.\n\n"
    },
    {
      "time": " 3.Aug.2007 10.40am",
      "content": "\\>\\>I don’t think posts should be editable. You want to make a public pronouncement? Then take the responsibility for doing so.\n\nWhat if you tell someone something privately and they decide to pronounce it publicly?\n\n"
    },
    {
      "time": " 3.Aug.2007 10.43am",
      "content": "Digital liscensing is a mess. I sympathize with the creators, being one myself - however i think that fonts are ludicrisly expensive, as is most graphics software. The supply and demand market model doesn’t work when the supply (of digital liscences) is infinite and the overhead is virtually nil.\n\nFurthermore, I’ll never ever understand how anyone can say making an illicit copy of, say “gill sans” is stealing when Eric Gill died more than 60 years ago. i don’t think the repackaging of gill sans into a computer font is worth $156/liscence. Maybe $5. In fact i’d say selling it for $156, and claiming you have the fair “market-value” right to do so is more of a theft than making an illegal copy!\n\nUntil copyrights have sensible limits - I’d say somewhere in the 5 to 15 year range, i’d definetly consider “stealing” a typeface by a dead designer. Fortunately, my work is such that i’ve never needed to use a typeface i didn’t already own legitimately.\n\nAs a creator, i’d gladly reliquish copyright after a sensible time. in fact, even at this point i doubt i’d ever claim copyright to something i did 10 years ago as a matter of principle (unless maybe my work was used to advertise something i found repugnant.)\n\n"
    },
    {
      "time": " 3.Aug.2007 11.44am",
      "content": "Sam M:\n\n<cite>Furthermore, I’ll never ever understand how anyone can say making an illicit copy of, say “gill sans” is stealing when Eric Gill died more than 60 years ago. i don’t think the repackaging of gill sans into a computer font is worth $156/liscence. Maybe $5.</cite>\n\nIf you think that clones of the old Gill Sans are expensive, than look here:\n\nAt 3900 Euro (three-thousand nine-hundred) per one “single-user license”, the price of the clone of the old Fleischmann typeface is eligible for the Book of World Records.\n\n[http://www.dutchtypelibrary.nl/PDF/pricelists/singleuser/DTL%20Fleischma...](http://web.archive.org/web/20080612045100/http:/www.dutchtypelibrary.nl/PDF/pricelists/singleuser/DTL%20Fleischmann_prlst.pdf \"http://www.dutchtypelibrary.nl/PDF/pricelists/singleuser/DTL%20Fleischmann\\_prlst.pdf\")\n\n(3,900 Euro equal 5,331.81 US Dollar by today’s currency exchange rate.).\n\n"
    },
    {
      "time": " 3.Aug.2007 11.52am",
      "content": "\\>“Et semel emissum volat irrevocabile verbum” (Horace)\\<\n\nNisi avicaptor Uli adsit!\n\n"
    },
    {
      "time": " 3.Aug.2007 12.04pm",
      "content": "\\>Furthermore, I’ll never ever understand how anyone can say making an illicit copy of, say “gill sans” is stealing when Eric Gill died more than 60 years ago. i don’t think the repackaging of gill sans into a computer font is worth $156/liscence. Maybe $5. In fact i’d say selling it for $156, and claiming you have the fair “market-value” right to do so is more of a theft than making an illegal copy!\\<\n\nI could not disagree with this more. I first proposed reviving the Gill font Pilgrim to Linotype around 1995 and started desultory work on it around then. Then I got involved in other things ... Finally, Lino released a pre-existing and (in my opinion) very poor Linotron version, and agreed to do my version as ’Pilgrim Next’. We had the first critique last year, and ... work proceeds very slowly. Obviously, I have not been putting that many hours into it over these past 12 years, but I have been thinking about it and its problems for all this time, learning more about type all the time, learning more about the font all the time, and hey, I would be very annoyed if lots of people used it without paying and nobody actually bought a license — if, when, I ever finish it.\n\nAnybody who seriously thinks about the problems of reviving a design for any format must surely acknowledge that each revival for some new format, if it is seriously-intentioned, takes an enormous amount of time, perhaps more than the original design itself, even.\n\nIf you looked at material set in metal Gill and wanted to reproduce it exactly with the digital versions available today, you wouldn’t be able to. There’s plenty more work that could be done on Gill Sans. Why would that work be worthless just because the original design came out eighty (not sixty) years ago?\n\nAnybody got a really great idea for the dagger in Pilgrim? The reason I’ve been posting today is that I’m trying to avoid working on this problem! God, is that a pathetic thing to admit in public or what?\n\n"
    },
    {
      "time": " 3.Aug.2007 2.38pm",
      "content": "[Lineto](http://web.archive.org/web/20080612045100/http:/www.lineto.com/) wrote a good text about copyright :\n\n_“Rule Number One: Always license the fonts you are using, and do not share, trade or illegally download fonts. By pirating fonts or using pirated fonts you are not damaging some huge multinational company, but your fellow design colleagues who have put a lot of time, energy, and money into producing sophisticated software tools._\n\nUsing fonts illegally is not an irreverent statement about «Open Source» and does not make you a glamourous rebel of the internet age, but simply a digital pickpocket.”\n\nHowever if you have a typeface on your computer and you haven’t paid for it most of foundries consider it as piracy. I don’t agree with that, sure they are a lot of designers that will never pay for the fonts they are using but most of us will licence a font if they are using it for a commercial purpose. I think that you can “illegally download” a font to test it then if it’s matching with your project you buy it! Or foundries have to do a test version of the font (I’m not taliking about the useless web typewritters) containing just the upper and lowercases as some rare foundries are proposing.\n\n"
    },
    {
      "time": " 3.Aug.2007 2.38pm",
      "content": "Please pardon the interruption - Bill Troop, would you contact me by email? allen.br at gmail dot com Thanks. Brian Allen\n\n"
    },
    {
      "time": " 3.Aug.2007 7.53pm",
      "content": "Bill: you seem to be viewing the whole censorship issue from one side, in a “it’s your responsibility you posted it. take the responsibility and don’t censor yourself.” I agree with it in principle, but I think sitting on a high horse and chanting “no censorship” while someone is getting pilloried for your actions isn’t much better than the so-called censorship itself.\n\nWhat if you’d unintentionally deeply embarrassed someone? or given away something that could threaten someone’s life? or their career? You may argue that once one person’s seen it, it’s out, but that’s like not quarantining an infectious illness just because “someone else has probably already caught it.” There is a real benefit to limiting something’s spread, if it has the potential to harm. Damaging information tends to be one of those things, and that’s why people wanted to limit its spread. Sure, I saw the name and you did, and so did dozens of others, certainly, but seeing how big this thread has now become, the newcomers will not. Those searching for “typography teachers advice” (eventually) on google will not, and so on. People who are really curious might find it on some cache, if it managed to be picked up quickly enough, but it will have succeeded in limiting the spread. Sure, if someone goes and writes about it on their own blog or opens a wiki page on it, there’s no stopping them, but then that might be seen as libel, given the difficulty of verifying the original claims.\n\nSo yeah, I can see you’re angry, and can understand it, especially if a mod censored you and you feel strongly about censorship, but going all hot-headed and pissing more people off while also releasing more potentially damaging information isn’t hurting anyone. You said you’d probably regret posting it... why not just avoid doing so in the first place if you realized that when writing it, given your aversion to editing?\n\nDaniel\n\n"
    },
    {
      "time": " 4.Aug.2007 2.07am",
      "content": "Mr. Troop:\n\n\\> avicaptor\n\nIs that an attestable Latin word?\n\n\\> Anybody got a really great idea for the dagger in Pilgrim?\n\n[http://www.sanskritweb.org/letters/pi\\_asterisk\\_dagger.pdf](http://web.archive.org/web/20080612045100/http:/www.sanskritweb.org/letters/pi_asterisk_dagger.pdf \"http://www.sanskritweb.org/letters/pi\\_asterisk\\_dagger.pdf\")\n\n"
    },
    {
      "time": " 4.Aug.2007 2.15am",
      "content": "Daniel, your points are rational and logical, _but_ re limiting the spread of gossip, I don’t think it can be done. What did Churchill say about a slander travelling the world in five seconds, or something vaguely like that? And what’s the use of censoring her name when anyone who wants can get it by clicking on Uli’s link?\n\nSo: what’s the point of censoring something in a thread, and not censoring a link to the censored material in the same thread? Where do you stop? In my admittedly limited experience here and in photo science blogs, moderators who censor will stop short of censoring links known to be to the material they just censored. How daft is that?\n\nYet I do wonder one thing, the perpetually unanswered question in this thread: has R-word (name available by clicking on Uli’s link) been informed of her tarring and feathering? Are we ever going to hear her side of the story, or a defense by some supporter of hers? How can we deepen the original discussion until we hear from her?\n\n\\>You said you’d probably regret posting it... why not just avoid doing so in the first place if you realized that when writing it, given your aversion to editing?\\<\n\nBecause I think that would be a boring way to exist. As Lynn Fontanne said when MGM asked the Lunts to make a second film, ’Mr Mayer, we can be bought, but we cannot be bored’ —\n\nThere’s a kind of thrill in it. As a French friend wrote to me, in a phrase almost worthy of Balzac, “I always knew you liked gossip and limelight, but I really had no idea you were this suicidal.”\n\nBesides, in the history of litigation it is one of the craziest incidents: you have two organizations, Emigre and ATypI, at one another’s throats, over the behaviour of a perpetrator who, both agree, cannot be let know that the conflict exists. In effect, Hrant was sued, and a settlement was made, without him ever knowing about it. How delightful!\n\n"
    },
    {
      "time": " 4.Aug.2007 2.19am",
      "content": "re \\>but then that might be seen as libel\\<\n\nI may not be understanding what you are saying — surely a slander is a slander, no matter where it is uttered, so long as there is one person to hear it, and a libel is a libel, wherever published, publicly or privately? I am reasonably sure this is correct.\n\nThe surest defense to slander or libel is truth. If a statement is true, it cannot constitute slander or libel. “Mark” would only be slandering “R-Word” if he completely made the story up. Does anyone really think that probable? But it is possible, certainly if remotely. At the very least, I’d like to hear from the other side.\n\n"
    },
    {
      "time": " 4.Aug.2007 2.40am",
      "content": "Dagger – a dummy or chisel might be a nice tip of the hat to the stonecutting precedents?\n\n ![](http://web.archive.org/web/20080612045100im_/http:/www.typophile.com/files/dummy_5394.jpg)\n\nTim\n\n"
    },
    {
      "time": " 4.Aug.2007 4.03am",
      "content": "Tim, that is really nice!\n\n"
    },
    {
      "time": " 4.Aug.2007 4.21am",
      "content": "_I basically agree with Bill on one subject - once a post is responded to it should become uneditable. That is the only reasonable way to have coherent threads._\n\nDear Paul Cutler (and all else who are reading this thread)\n\n“Basically” most humans do get a second chance in almost every phase of their life - with the exception of death (and even there it has been noted a few have come back to gte it right.)\n\nIf you view the original post as from a child — and this board has been able to explain to him about his behaviour, then it has been a learning and growing experience. And a positive one, that hopefully, he will carry with him throughout his life.\n\nAnd you are never too old (or young) to learn something new...\n\n\\*\\*\\*\\*\\*\\*\\*\\*\n\nMeanwhile, as to editing your threads - we had one IDIOT here - who used the threads for bogus contests. Stealing design ideas with the pretense of a grand prize. I for one an ecstatic that his posting were erased (by him) and that we all had the pleasure of 1) letting him know he was a fraud and 2) never having to see his face here again.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nI have NEVER been one for censorship. What I am for is responsibility. Sometimes people confuse the two.\n\n"
    },
    {
      "time": " 4.Aug.2007 6.02am",
      "content": "\\>“Basically” most humans do get a second chance in almost every phase of their life - with the exception of death (and even there it has been noted a few have come back to gte it right.)\\<\n\nI’d like to think you were right, but ...\n\nThink of a radio or television broadcaster. Once the remark has been made, it’s been made. It can’t be taken back. This is true from Groucho Marx’s famous faux pas in the 1950s to Don Imus this year. When I write to a blog, how is that different from broadcasting?\n\nIn addition, what about the point that Uli and others have made? no matter how many times the remark is edited, someone has the original, and will make it available. So where’s the second chance? Mark’s marked!\n\n"
    },
    {
      "time": " 4.Aug.2007 7.50am",
      "content": "I swore I’d ignore this thread from now on, but I have to interject.\n\nFor those of us who frequent the Type ID forum, it’s a time honored tradition to leap in there with your ID as fast as you can, then go back in and add the link, as a courtesy to the original poster. I would hardly call this censorship. Before the upgrade the time stamp held even if you edited your post to add the link. It was an honor system, if your ID was wrong you didn’t go back in and change it after someone had correctly ID’d the sample later on. Now, with the edited posts jumping down it requires us to add a new post with the link. Whatever. I preferred the old system. I sometimes used to go back into my post to clarify something I thought was fuzzy, or to reword something. Now I don’t because it screws up the order of the thread - unless my post is still the last one.\n\nNow I am ignoring this thread and the pedantry contained herein.\n\n(and for the record my family came thru Ellis Island, not the Mayflower)\n\n"
    },
    {
      "time": " 4.Aug.2007 9.36am",
      "content": "Pedantic? _This_? But just for the record, when you write ’pedantry contained herein’ you mean the pedantry contained within your own message — not that there is any. If you want to refer to the alleged pedantry of the thread as a whole, you mean ’therein’. Then there’s the matter of ’thru’ — why would anyone want to write that? I know graphic designers, admittedly they’re usually over sixty — who think that taking language seriously is an important part of their job.\n\n"
    },
    {
      "time": " 4.Aug.2007 10.09am",
      "content": "I mispoke, apols to Patty (!!!!), I just saw this from Uli, so I guess it really is getting pedantic in here:\n\n\\>\\> avicaptor\n\nIs that an attestable Latin word?\\<\n\nI don’t know, Uli, to the best of my knowledge it was invented last night — in your honour as a matter of fact —, but it could perfectly well pre-exist. It’s meaning is clear, though: bird-catcher. You might also like aviraptor, a seizer of birds. One could imagine the great Hagen/Hogni as an aviraptor, no? ’Rache rieten sie mir!’ ’Ahhhhhhhh!!!!’\n\n"
    },
    {
      "time": " 4.Aug.2007 10.39am",
      "content": "I used to mod and administrate a board Jackie T. I censored and/or edited many posts but I was a moderator. I don’t think that posts should be editable by the person who posted it once they are replied to - I’m sticking to that.\n\nIf the moderators decide to edit a post - them I’m all for that too. The moderators set the tone of a board. If a moderator decided to edit Bill’s post they have my full support.\n\nAnd while I’m at it - thanks to all the moderators here - I know how hard it is to make all those decisions.\n\npbc\n\n"
    },
    {
      "time": " 4.Aug.2007 10.55am",
      "content": "\\> I preferred the old system.\n\nI do too, if for no other reason than I hate for a mispelling to taunt me. Or odd grammer caused by an unintended word accidently left in when I changed the direction of a sentence.\n\nI have a little bit of OCD. Every once in a while my wife says, “OK, Monk.”, and laughs. Then I laugh too and we all had a good time.\n\nAnother factor is sometimes when I am threatening to take the lead in the number of posts list, I’d rather tack something on. I feel **the leader position belongs to hrant.** (In his absence, I am comfortable with the knowledgeable Mr. Coles keeping the seat warm)\n\n"
    },
    {
      "time": " 4.Aug.2007 11.53am",
      "content": "<cite> avicaptor<br>\nIs that an attestable Latin word?&lt;<br>\nI don’t know, Uli, to the best of my knowledge it was invented last night</cite>\n\n“avicaptor” is a perfect Latin neologism. Horace would have used it :-)\n\n"
    },
    {
      "time": " 4.Aug.2007 11.58am",
      "content": "\\>If a moderator decided to edit Bill’s post they have my full support.\n\nFine with me too in this case. I kind of wanted the post edited, but I didn’t want to have the responsibility for editing it. It was nice to have the moderator take it out of my hands. BUT what does it achieve? Is it a moral action, a legal action, both, neither? How can it protect the board from potential legal action? And in other cases, I have resented moderators’ actions.\n\nWhat I have resented even more is the censoring of entire threads such as typographica’s censoring of the ’zweet dreams, Zuzana’ thread, a few years ago. It was one of the most entertaining threads on any blog, ever — or it seemed that way at the time. According to typographica, the thread exists but ’technical problems’ — lasting several years — prevent it from being accessible. — I don’t suppose anyone here saved it?\n\nOn the other hand, I wish photonet would delete the notorious thread in which Ron Mowrey and I met and battled in the most embarrassing manner imaginable. We became best friends after that, thanks to the diplomatic mediation of Ryuji Suzuki, but it was a bumpy start and its visibility serves no useful purpose.\n\n"
    },
    {
      "time": " 4.Aug.2007 2.05pm",
      "content": "\\>“avicaptor” is a perfect Latin neologism. Horace would have used it :-)\n\nThanks Uli!!!\n\nI am studying with great interest the extraordinary asterisk dagger pdf. Is there a key to the identifying numbers? Deeply, deeply fascinating — though very slow to display in Mac Preview — I’ll have to try Win Acrobat, but I expect it’s in the nature of the document.\n\n"
    },
    {
      "time": " 4.Aug.2007 2.07pm",
      "content": "Have you asked a moderator or adminitrator at photonet to help you? I was asked many times and usually had no problem complying with the persons wishes.\n\nTo me it’s pretty simple - this is not my board and if I post something that the people that run it deem offensive or inappropriate - they have every right in the world to censor/edit/delete my post. If they think I am a really bad member then they have the right to ban me.\n\npbc\n\n"
    },
    {
      "time": " 4.Aug.2007 2.58pm",
      "content": "_I used to mod and administrate a board Jackie T. I censored and/or edited many posts but I was a moderator. I don’t think that posts should be editable by the person who posted it once they are replied to - I’m sticking to that._\n\nPaul - I like this sideway conversation we have going.  \nJust to let you know — I too, am a moderator on several boards, one of them being myfonts.com — there the person who writes the thread has 15 minutes after they send it to alter it in anyway they want. Just 15 minutes! And I can tell you - many do after it comes up and they see what they wrote. I also remember a day I quickly edited some foul language out of one — and the person had come back to do the same and was in shock it was already taken care of. Such is the fun...\n\nYou are right the moderators set the tone, but around here, I figure it’s Hrant. Where is Hrant lately anyway? In a quirky way, I miss his sarcastic humor and his numerous threads, an opinion for everything. Uh-oh, am I suppose to edit that line out? Nah, what is typophile.com without Hrant...\n\n"
    },
    {
      "time": " 4.Aug.2007 3.07pm",
      "content": "<cite>Where is Hrant lately anyway? </cite>\n\nI think he said he was going to Cypress or something like that.\n\n"
    },
    {
      "time": " 4.Aug.2007 4.32pm",
      "content": "If people here are clamoring for the operators to fiddle with the editing system some more, then I must ask them not to. When a concept is important to a thread, no self-edit can delete the ripples in other posts, so there is nothing of essential value lost. Typos, run on sentences and a million other annoying trademarks of internet message boards are often (on Typophile) preened, cleaned and culled by the posters, leaving a more readable mass-memoir. Additionally, it is a useful tool when a project name changes, or a new sub-version is posted to the build boards (eg: Agamemnon #x).\n\nI felt the temptation to go see the “teacher”’s site. The reason I didn’t was out of respect to the original poster, who seems to genuinely regret including that detail. Editing himself and explaining it shows effort to fix a mistake that should be accepted.\n\nTo those who don’t want anyone else to edit their own posts; the moderators and funders of Typophile have done a great job of creating a diverse center by communicating instead of dictating, so go and not-edit your own posts.\n\n"
    },
    {
      "time": " 5.Aug.2007 6.31am",
      "content": "\\>I felt the temptation to go see the “teacher”’s site. The reason I didn’t was out of respect to the original poster, who seems to genuinely regret including that detail.\\<\n\nOh, please go! It will make you wince! Promise! And it will surely make you wonder why anyone would waste so much bandwidth on someone so mediocre, so doctrinaire. If there’s one thing I hope Mark takes away from this, it’s simply not to bother with such inglorious people.\n\n\\>the moderators and funders of Typophile have done a great job of creating a diverse center by communicating instead of dictating,\\<\n\nI do think they have dictated on occasion, at least I have been dictated to, but I agree they do a tremendously difficult job wonderfully well.\n\n"
    },
    {
      "time": " 12.Aug.2007 7.18pm",
      "content": "Hi Bill. On the Typographica post you mentioned: I know that for the sake of dramatics you’d love to believe it was censored, but our blog software truly was outdated and malfunctioning. The commentary has been live since we upgraded several weeks ago. So please dig a bit before posting assumptions.\n\nIn any case, I don’t think the thread was _that_ interesting to more than a handful of people. You can find soap opera and melodrama on TV. I’m interested in typography.\n\n"
    }
  ]
}
