{
  "id": "35628",
  "title": "\"Voices\" logo for critique",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "This is a logo design for a speech/writing contest at a university. The contest is for undergrads. The idea is to put a youthful/energetic face on a concept that might seem boring. The target media is print and the smallest size will be letterhead.\n\nThe client liked this font.\n\nI don't care if you think this looks like mindless trash from a 1990's clipart collection. :) I just want to know how the kerning looks on the main \"voices\" text.\n\n ![](http://web.archive.org/web/20131017172554im_/http:/typophile.com/files/voices2-first_4988.png)\n\nI'm trying to get better at manual kerning...\n\nThanks.\n\n",
  "author": "maruchan",
  "time": "1 Aug 2007 — 4:50pm",
  "uid": "20155",
  "comments": [
    {
      "time": "1 Aug 2007 — 8:45pm",
      "content": "The logo is more like an illustration than a logo. Lot's of action for a logo but the customer knows what he wants.\n\n"
    },
    {
      "time": "1 Aug 2007 — 10:20pm",
      "content": "Are we even supposed to comment stuff like this? Sorry to be rude, but ...\n\n"
    },
    {
      "time": "1 Aug 2007 — 11:38pm",
      "content": "OK, I get it...I edited my first post to be more clear ;) Also, I will try to post something more worthy of your mouse clicks next time (sheeeeesh).\n\nThanks for the tip, Robert.\n\n"
    },
    {
      "time": "2 Aug 2007 — 12:34am",
      "content": "Open up either side of the ‘I’, try flipping the V\\* and closing that slightly.  \nbtw. I think you really need to work on the strapline, positioning, typeface(s), alignment.\n\n\\* the drop shadow looks inconsistent with the other characters, the ‘I’ could do with more consistent shadows too\n\nTim\n\n"
    },
    {
      "time": "2 Aug 2007 — 3:42pm",
      "content": "Jesper, we'd like to see your stuff... We are not all at your level.\n\nI think it is too busy. Try removing some lines in motion. If that is the option the Client liked - roll with it.\n\nGabe\n\n"
    }
  ]
}
