{
  "id": "35640",
  "title": "First font, early stages",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Here's my current project, likely to be called Decoa. Trying to create a font suitable for headings and identities. Haven't got a full set as of yet, but working on it! Just wanna see if people think I'm in the right direction. All comments appreciated.\n\n[edit] Updated with more letters :)\n\n| Attachment | Size |\n| --- | --- |\n| [decoa2.gif](http://web.archive.org/web/20131012005021/http:/typophile.com/files/decoa2.gif) | 5.99 KB |\n| [font.gif](http://web.archive.org/web/20131012005021/http:/typophile.com/files/font_31.gif) | 7.78 KB |\n\n",
  "author": "larsism",
  "time": "2 Aug 2007 — 5:11am",
  "uid": "20166",
  "comments": [
    {
      "time": "2 Aug 2007 — 6:10am",
      "content": "once you have a standard build for every letter, the font will not be so hard for you to make, i like it and once its out, i will use it :)\n\n"
    },
    {
      "time": "2 Aug 2007 — 8:25am",
      "content": "I don't like the 'Q'. I'd suggest breaking the grid for that one.\n\n- Lex\n\n"
    },
    {
      "time": "3 Aug 2007 — 2:55am",
      "content": "Updated with a few more characters and new weight (forum image upload wouldn't work for me atm, so please use the url).\n\n[http://www.larsism.com/font2.gif](http://web.archive.org/web/20131012005021/http:/www.larsism.com/font2.gif)\n\n"
    },
    {
      "time": "5 Aug 2007 — 7:30pm",
      "content": "the q still needs help. maybe just a little bar going from the inside to the lower right corner? Or a verical line inside of the bowl?\n\n"
    },
    {
      "time": "7 Aug 2007 — 12:45am",
      "content": "thats some nice work there lars! is that digital font design with brad???\n\nbut i agree with the other posts... the Q is still need a bit more refinement...\n\n"
    },
    {
      "time": "7 Aug 2007 — 2:51am",
      "content": "Haha, hey Drew! It's font design, yeah, hah! It's quite enjoyable! Tho he said I should try to make it look a little more original cos it looks a bit like other fonts out there, suggesting a slab seriff. I mean, slab seriffs are nasty, I wanna do a font I can use later for headers, identity etc.\n\n"
    },
    {
      "time": "7 Aug 2007 — 6:06pm",
      "content": "BAH, im a fan of the slab serif... im using lubalin graphy for my headers in the stduio brief we got atm....\n\ni was gonna do font design, but i thought bugger it, i already got alot of type in my folio... so doing illustraion as design instead... you done it?\n\nyou could turn this into a serif without that to much hassel, the C would look ace as a serif... do you have to do a lower case as well? or are you just doing a uni case?\n\n"
    },
    {
      "time": "8 Aug 2007 — 6:30pm",
      "content": "Yep, I'm doing a full character set, woop!\n\nAh, yeah I did illustration last semester, I didn't like it too much, didn't feel like i got stuff i could use for my folio, might've changed for this semester tho. But I'm happy with my font design class, i wanna learn how to use the font software and stuff too so i can turn them into \\*actually\\* working fonts.\n\n"
    },
    {
      "time": "10 Aug 2007 — 8:46am",
      "content": "I recomend you design these in black on a white background, if you want these to be the most usable later on. Having different colored backgrounds can cause the letters to look slightly different, depending on the contrast.\n\n"
    },
    {
      "time": "13 Sep 2007 — 3:34am",
      "content": "Alright, updated with a full character set\n\n ![](http://web.archive.org/web/20131012005021im_/http:/typophile.com/files/font-set_6655.gif)\n\n"
    },
    {
      "time": "13 Sep 2007 — 7:18am",
      "content": "What about a PDF? :)  \nI think most of the lowercase letters are a bit too wide, they look stretched.:)  \nParticularly visible in the 'u' and 'y'. I see that a lot of them are just as wide as the UC, or mono-width. If that is what you intended to do, I do think most of the LC characters need some work. It doesn't look right at the moment.  \nThe UC chars look quite alright now.\n\n"
    },
    {
      "time": "29 Sep 2007 — 1:45am",
      "content": "Update! :)\n\n[Decoa](http://web.archive.org/web/20131012005021/http:/larsism.com/decoasample.pdf)\n\n"
    }
  ]
}
