{
  "id": "35647",
  "title": "!Exclamachine relaunched",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20150416222205im_/http:/typophile.com/files/!ETF2_5409.png)\n  \n&nbsp;  \n [http://www.exclamachine.com](http://web.archive.org/web/20150416222205/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")  \n&nbsp;  \nThe central feature is the typeface gallery- renovation was long overdue. Other highlights include background on the designers, a \"new releases\" news subscription option, and links to the projects we support.  \n&nbsp;  \nNext up, I finishing the shop. I plan to offer a few things I haven't seen anyone else do with digital type yet. Then, I will expand the specimens a bit. \n",
  "author": "Choz Cunningham",
  "time": "2 Aug 2007 — 9:53am",
  "uid": "13605",
  "comments": [
    {
      "time": "3 Sep 2007 — 12:49am",
      "content": "It seem no bad, good luck.\n\n--------------  \n [font software downloads](http://web.archive.org/web/20150416222205/http:/www.softsea.com/software/Font-Software.html)\n\n"
    },
    {
      "time": "7 Sep 2007 — 11:16pm",
      "content": "Thank you. It is a work in progress, and the feedback from viewers has been lead to some great improvements.\n\n"
    },
    {
      "time": "8 Sep 2007 — 2:24pm",
      "content": "This is amazing! I hadn't seen this before; it's really delightful! I wonder who had the time to put together such an incredible pastiche. It's like Ninja Burger, or the Yes Men, or Spinal Tap in the thoroughness of execution. I love all of the links to other pastiche sites, and the goth \"calligrapher\", and the custom type projects. (A logo for a local band. Brilliant.)\n\nI'm curious to know what the end game is for this project. Bravo!\n\nJN\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:53pm",
      "content": "捧杀\n\n"
    },
    {
      "time": "11 Sep 2007 — 8:41am",
      "content": "Nice work Choz.  \nWhat can I say, other than what I'd say about any foundry -- I like some of the faces!  \nWell, you do things differently, and I admire the breadth of your have-a-go-ness, such as Typosium and the Snark.  \nMore fonts, shop, and type tester. But so much work to do.  \nGood luck with it.\n\n"
    },
    {
      "time": "11 Sep 2007 — 2:25pm",
      "content": "Thank you for your constructive input in this thread NewGuy. This certainly is the kind of mentality that we need here.\n\nArtur\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:32pm",
      "content": "Mr. Schmal, thank you very much. I have enjoyed reading Typophile for a long time, and am happy that my comments are being well received.\n\nJN\n\nPS; Kudos to Mr. Shinn for playing along!\n\n"
    },
    {
      "time": "11 Sep 2007 — 9:10pm",
      "content": "Thank you, Nick. More fonts are coming, and that is what matters most. Yes, the site is in deep need of a type-tester, but I haven't determined the best approach to implementing that. Fortunately things are very modular. My interim device is a series of thumbnails for each face, hopefully online by next week.\n\n"
    }
  ]
}
