{
  "id": "3564",
  "title": "Photoshop paths into FontLab???",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "okay, so i guess it is possible to cut and paste outlines from illustrator to FontLab, but i'm just wondering can one somehow do the same thing with paths from photoshop? If so, how?\n\n",
  "author": "pablohoney77",
  "time": "12 Mar 2004 — 11:54pm",
  "uid": "2910",
  "comments": [
    {
      "time": "13 Mar 2004 — 6:11am",
      "content": "Here's how I get from photoshop to fontlab at the correct scale:   \n   \n1. Scan a fat wad of glyphs.   \n2. Fiddle with magic wand settings   \n3. Fiddle with make work path settings   \n4. Export paths to illustrator.   \n5. Open in illustrator.   \n6. Make a compound path   \n7. Fill black   \n8. Scale up (or down) until one glyph take up approx 2/3rds of a letter page   \n9. Save as EPS v.6   \n10. Open FLAB :-)   \n11. Go to your glyph.   \n12. Import glph from EPS (you can do about 15 or so at a time)   \n13. Once you have the right basline, and scale cut and paste to the right glyphs   \n\\*\\*\\*\\* Take a break for Lunch \\*\\*\\*\\*   \n14. Now that you know the exact scale for your em square, export one of the new glyphs to EPS.   \n15. Open that back in Illustrator.   \n16. Scale the remaining glyphs to match.   \n17. Repeat the import to FLAB with the remaining glyphs.   \n\\*\\*\\*\\* Have a break for Dinner \\*\\*\\*\\*   \n18. Buy [ScanFont](http://web.archive.org/web/20131106170422/http:/www.typophile.com/forums/messages/4100/27933.html?1079165244) (scroll down for Thomas' helpful info) for FontLab.   \n19. Reduce it one step :-)   \n   \nThere's probably a faster way, but I'd guess ScanFont is worth the 99 bucks if you do it a lot!   \n   \nRandy\n\n"
    },
    {
      "time": "13 Mar 2004 — 7:22am",
      "content": "and there goes the weekend huh? ;^)   \njust one problem... i don't have illustrator.   \ni was wondering if i could somehow copy my vector paths and paste them directly into FontLab, more out of curiosity than anything. very interesting to see someone else's method.   \nhere's my current method:   \n1 scan glyphs   \n2 run 'em through streamline   \n3 import em into the old demo verison of FLab (the eps won't work with the new version for some reason)   \n4 copy 'em from the old version and paste 'em into the new.   \nand all before lunch!   \nand then comes the cleanup process which for me has been taking several months! ha ha   \nmaybe i should look into what scanfont is all about, hmm?\n\n"
    },
    {
      "time": "15 Mar 2004 — 11:43am",
      "content": "If you have FreeHand 10 or 11 (MX) you can open the .ai file generated by Photoshop, with your vector data, scale it accordingly, and copy it direcly in FontLab cells using the \"paste special\" command of FreeHand with \"eps\" as the selected option. In FreeHand there's a nice \"simplify\" command to clean up paths, while Illustrator has another handy command to inversely \"add\" points for further vector manipulation.\n\n"
    }
  ]
}
