{
  "id": "3565",
  "title": "Lowercase",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Would like to know what you think of this stuff before I start making the uppercase.....\n\n<!--attachment: lowercase-28463.pdf*mime_pdf.gif*application/pdf*8.9*untitled+lowercase*lowercase%2epdf --><!--attachment: lowercase-28463.pdf*mime_pdf.gif*application/pdf*8.9*untitled+lowercase*lowercase%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131014030704im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">untitled lowercase<br><a href=\"http://web.archive.org/web/20131014030704/http:/www.typophile.com/forums/messages/29/lowercase-28463.pdf\" target=\"_blank\"><b>lowercase.pdf</b></a> (8.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "Toby",
  "time": "13 Mar 2004 — 4:15am",
  "uid": "3070",
  "comments": [
    {
      "time": "13 Mar 2004 — 7:38am",
      "content": "It's very clean. I only noticed a couple of things I would change.   \n   \n-The arm on the r needs a little more weight.   \n-You may want to make the bowl smaller on the g to give more room between it and the lower arm.   \n-The spine on the s could be smoother.   \n-On the base curve of the t and top curve of the f, I would make them a bit more subtle to work more with the rest of the font.   \n-Maybe try something different with the z.   \n   \nI think it has potential, it's very simple and neat. Bring on the uppercase.\n\n"
    },
    {
      "time": "13 Mar 2004 — 9:50am",
      "content": "Thanks Matt. What about the contrast - do you find it satisfying on all characters? I\n\n"
    },
    {
      "time": "13 Mar 2004 — 12:35pm",
      "content": "Here\n\n"
    },
    {
      "time": "13 Mar 2004 — 1:52pm",
      "content": "The contrast looks ok. You will probably have to increase the difference between the thicks and thins if you do bolder weights.   \n   \nThe contrast of the v, w, and x look ok. They look a bit weak where the strokes meet though. You may want to move the strokes in closer to each other before removing the overlap, if that makes sense.\n\n"
    },
    {
      "time": "14 Mar 2004 — 12:33am",
      "content": "I was thinking of making those letters (v, w, y, x) in almost symmetrical weight, as I\n\n"
    },
    {
      "time": "15 Mar 2004 — 12:15am",
      "content": "Tobias,   \n   \nI like it, really. But if you ask me personally, I think it's the kind of font that anyone can make. If you understand the basics it's kinda 'easy'. It still means that you did a great job and I think you should finish it. It's worth it.   \n   \nWhat do you 'want' with this font? Is it made for a client, as an experiment, or just for fun? I personally miss something exotic (if that's the right word), something that makes this font stand out from the rest. Maybe try to put something of your own personality in, make it yours. You've come this far, so it's perhaps not possible.   \n   \nI only speak for myself, don't see this as negative critics on your font, which is a good job.   \n   \nRegards,\n\n"
    },
    {
      "time": "15 Mar 2004 — 1:03am",
      "content": "Dear Tobias,   \nI am with Ren\n\n"
    },
    {
      "time": "15 Mar 2004 — 2:08am",
      "content": "Jaques and Ren\n\n"
    },
    {
      "time": "15 Mar 2004 — 2:47am",
      "content": "Like Jacques also said, you showed a lot of potential when it comes to handling curves (which is even for me very difficult). So don't be affraid to show who you are and start making great fonts.   \nDon't forget to finish this one.   \n   \nRock and roll.\n\n"
    }
  ]
}
