{
  "id": "35661",
  "title": "trapping colors manually",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am submitting a file to a printer who does not do trapping and I know very little about it. I’m wondering if I can get advice from anyone out there about how to manually set a trap. I’m using Adobe Illustrator. Basically, I’ve got a cmyk blue knock-out square adjacent to a 100% black knock-out square. There’s small reversed type in the black square, so I want to leave it 100% black. Is the solution simply putting a thin overprinting blue stroke (same cmyk values as the blue specified above) right where the colors touch? Any advice would be appreciated.\n\n [‹ how to turn on Gray scaling at a particular point size](http://web.archive.org/web/20080709012848/http:/www.typophile.com/node/35700 \"Go to previous forum topic\") [Nodes at extremes distortion ›](http://web.archive.org/web/20080709012848/http:/www.typophile.com/node/35617 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080709012848/http://www.typophile.com/user/20195\" title=\"View user profile.\">caj</a>",
  "time": "<br>",
  "uid": "20195",
  "comments": [
    {
      "time": " 2.Aug.2007 7.16pm",
      "content": "What kind of printing process is this going to be? Does the printer know how to trap but just not want to offer that service? You might want to shop around for a different printer.\n\nIf you are not experienced with trapping, I would leave it to someone more experienced.\n\nTry to find the book “Getting It Printed”.\n\n"
    },
    {
      "time": " 2.Aug.2007 7.29pm",
      "content": "It’s actually a magazine, so I don’t have the liberty of going elsewhere. I’m not sure why they don’t trap, but the specs specifically say they won’t. The budget was spent on art, so there’s nothing left for a service bureau....\n\nI’m attaching a gif of the situation.\n\n ![](http://web.archive.org/web/20080709012848im_/http:/www.typophile.com/files/trap_5579.gif)\n\n"
    },
    {
      "time": " 2.Aug.2007 8.31pm",
      "content": "Hi Caj,\n\nYou’re spot on with your proposed solution above. A small overprinting stroke in the blue will do the trick. Just apply it to which ever shape is on top in your artwork. Also make sure that your Black settings in Illustrator aren’t set to auto overprint, or auto generate rich blacks. (See preferences).\n\n"
    },
    {
      "time": " 3.Aug.2007 3.04pm",
      "content": "Thanks! Good to know.\n\nFYI, I noticed Illustrator CS has a trapping tool in the pathfinder palette that seems interesting...\n\nDidn’t see anything about auto generating rich black or auto overprinting in the preferences, though. Maybe that’s a different version of Illustrator.\n\n"
    },
    {
      "time": " 4.Aug.2007 8.14am",
      "content": "Forget the stroke, change the 100K to 100K 68C and 38M youll get a nice rich black and you can forget about trapping problems.\n\n"
    }
  ]
}
