{
  "id": "35700",
  "title": "how to turn on Gray scaling at a particular point size",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "HI,\n\nI have developed a font. When I tested it under MS Windows environment (MS office), I examined that most of the fonts get gray scaled at point size 12 but not the one that I developed. Is it possible to add information inside font to force it to be Gray scaled at a particular defined point size?\n\nNote: Standard option (not ClearType)is selected for smooth edge and screen fonts.\n\nBest regards,  \nAtif\n\n",
  "author": "Atif",
  "time": "3 Aug 2007 — 9:42pm",
  "uid": "16620",
  "comments": [
    {
      "time": "3 Aug 2007 — 10:57pm",
      "content": "By gray scaling do you mean antialiasing? Or the gray-bar that InDesign and Illustrator do? (I dunno if MS Office does that too). Or are you wanting it to be antialiased at a smaller point size?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "4 Aug 2007 — 4:35am",
      "content": "Yes, you are right, when I said gray scaling I mean antialiasing or smoothing. Would you please tell me; Is it possible to add information inside font to force it to be always antialiased at a particular defined point size? through hinting or by some other means.\n\nthanks and regards,  \nAtif\n\n"
    },
    {
      "time": "4 Aug 2007 — 2:18pm",
      "content": "check out the [hinting](http://web.archive.org/web/20150415104047/http:/en.wikipedia.org/wiki/Font_hinting) and [rasterization](http://web.archive.org/web/20150415104047/http:/en.wikipedia.org/wiki/Font_rasterization).\n\n"
    },
    {
      "time": "4 Aug 2007 — 10:55pm",
      "content": "But this does not answer my question.\n\n\"Is it possible to add information inside font to force it to be always antialiased at a particular defined point size?\"\n\nThanks and regards,  \nAtif\n\n"
    },
    {
      "time": "5 Aug 2007 — 12:45am",
      "content": "The PPM ranges at which a TrueType font is antialiased are located in the GASP table. In FontLab, you can set the ranges in the Font Info panel under TrueType Settings -\\> Font Smoothing. Fontographer should have something similar. There's also a Windows command line app called [TTFGASP](http://web.archive.org/web/20150415104047/http:/www.geocities.com/SiliconValley/Lakes/8162/) that will add a GASP table to a TrueType font.\n\n"
    }
  ]
}
