{
  "id": "35738",
  "title": "The TypeCon 2007 thanks thread.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The last professional conference I went to involved representatives from every US military service and intelligence agency sitting around giving each other the evil eye. Having survived that mess, I can really appreciate when a conference is great. So I just want to thank Tamye, everyone at S{o}TA, all the volunteers, the people from SVC and Cornish, the sponsors, and the speakers for making Typecon 2007 the best vacation I’ve had in years.\n\n [‹ Blog Directory](http://web.archive.org/web/20080828101305/http:/typophile.com/node/36422 \"Go to previous forum topic\") [Energetic font ›](http://web.archive.org/web/20080828101305/http:/typophile.com/node/36446 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080828101305/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 5.Aug.2007 11.02pm",
      "content": "That’s an amusing coincidence, military people ans SoTA mentioned in a same message. Sota in Finnish means war.\n\nI’m SO envious of all you who went to Typecon 2007. Glad to hear it was a success.\n\n"
    },
    {
      "time": " 6.Aug.2007 12.14am",
      "content": "It was! :-) Now I must sleep...\n\n"
    },
    {
      "time": " 6.Aug.2007 12.43am",
      "content": "It was excellent! Congratulations to everyone that made it happen.  \nI’m already looking forward to next year. (Even have a couple ideas for workshops already!)\n\n"
    },
    {
      "time": " 6.Aug.2007 8.09am",
      "content": "It was my first one and I didn’t miss a talk. For the most part, each talk offered something thought-provoking, stimulating, informative or funny (sometimes all of the above). Just two highlights for me were:1) Bill Hill’s (Microsoft) inspiring talk about the Digital Renaissance we’re all part of. If this is the guy Bill Gates wants to keep dreaming about the future of digital typography, then I may have to revise my feelings about that company. 2) The talk by Mexican Font designers Gabriel Martínez Meave and Leonardo Vázquez Conde was an informative and eye-opening look about the history and vitality of the Mexican type community. I want to learn a lot more about those designers.\n\nTamye and the gang, including ’Stewf’ Coles, did a great job of planning it and keeping it moving right along. The Typophile Film Festival 4 was sensational. ’Helvetica’, the movie, is a must see if you get the chance.\n\nIt was terrific to finally meet so many Typophiles I have only ’seen’ online before, but we really need a better way to spot each other. I have no idea how many of you I missed because I couldn’t read the last names on the badges unless you were inside someone’s personal space. That was really my only complaint.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 6.Aug.2007 10.34am",
      "content": "<cite>The talk by Mexican Font designers Gabriel Martínez Meave and Leonardo Vázquez Conde was an informative and eye-opening look about the history and vitality of the Mexican type community.</cite>\n\nI want those guys to write a book, and I want it to be the first in a series. That talk was my favorite!\n\n"
    },
    {
      "time": " 6.Aug.2007 11.38am",
      "content": "\\> _but we really need a better way to spot each other_\n\nPerhaps printing the Typophile avatar on the badge :)\n\n"
    },
    {
      "time": " 6.Aug.2007 12.13pm",
      "content": "Or at least the user name.\n\nWhat was surprising was the amount of people who have never even heard of Typophile. There were a couple of local AIGA guys here, pretty nice guys, who knew next to nothing about this forum.\n\nBut again, the amount of people who DO participate here was also surprising. Most of the type designers participate, exceptions being people like Matthew Carter and John Downer.\n\nThe other thing that was surprising was how familiar and friendly the entire type community is with each other. Competitors and rivals are friends and compatriots, all with the twofold goals of learning and having fun. Newcomers are treated as if old friends, and even the old-timers have time to sit and chat with students who haven’t even had a full year’s worth of design.\n\nBravo!\n\n"
    },
    {
      "time": " 6.Aug.2007 12.29pm",
      "content": "<cite>Newcomers are treated as if old friends, and even the old-timers have time to sit and chat with students who haven’t even had a full year’s worth of design.</cite>\n\nAgreed. Type designers are some of the friendliest and most humble folks I have ever come across.\n\n"
    },
    {
      "time": " 6.Aug.2007 12.34pm",
      "content": "My First TypeCon® was everything I hoped it would be. SOTA and the volunteers pulled off the very difficult job of making a complicated event appear to go off without a hitch. As Dan says (hi Dan!), the friendly vibe really was a highlight, along with finally putting a face to folks like Stewf, Tamye, Kent Lew, Mark Simonson, Nick Shinn, William Berkson and more.\n\nI’m looking forward to Buffalo next year!\n\n"
    },
    {
      "time": " 6.Aug.2007 1.04pm",
      "content": "I second the suggestion that Gabriel and Leonardo write a book. In fact, I told them that, and suggested they do one on the palaeography, one on the more recent history, and a new one (in a few years) about the current wave of digital type designers from Mexico. Their presentation was amazing.\n\nThanks to them and to everyone who traveled far (and endured tiresome travel delays) to participate, and especially to the SOTA board who all spent incredible energy and time to make things exciting and informative. This really was the best TypeCon I’ve been to.\n\n"
    },
    {
      "time": " 6.Aug.2007 1.13pm",
      "content": "I’m still amazed at the fact that a picture of a fish was shown by Gabriel to mean Cocoa. I mean, dammit, it’s a fish! But it phonetically spells out cocoa!\n\nThose guys must have been geniuses.\n\nHi Marc!\n\n"
    },
    {
      "time": " 6.Aug.2007 1.47pm",
      "content": "It is amazing how SOTA pulls off so much work with a volunteer army.\n\n"
    },
    {
      "time": " 6.Aug.2007 2.06pm",
      "content": "Not only a volunteer army, but a volunteer army that isn’t composed entirely of Type nerds. Most of the rest of the volunteers were university students with very little knowledge of type or type design, or of the major players involved.\n\n"
    },
    {
      "time": " 6.Aug.2007 5.33pm",
      "content": "Marc, I am sorry I missed meeting you. I especially wanted to meet to Type ID Board folks that were there.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 6.Aug.2007 9.44pm",
      "content": "Thanks TypeCon Seattle, thanks all exciting type guys, and thanks all volunteers.  \nI really enjoyed this conference. I was not good at English but all participants were really kind to me.  \nI’m gonna leave Seattle tomorrow but I’ll never forget this TypeCon.  \nI hope to go to Buffalo next year. I love TypeCon!\n\n"
    },
    {
      "time": " 6.Aug.2007 10.14pm",
      "content": "Thanks for coming, Kunihiko—I already downloaded your AXIS samples!\n\n"
    },
    {
      "time": " 6.Aug.2007 11.52pm",
      "content": "If you haven’t seen Kunihiko Okano’s work - you should.\n\nI echo Mike Yanega & Carl’s comments Re: Gabriel and Leonardo! Too right. If you have a chance to see them doing Calligraphy- DONT MISS IT!\n\n"
    },
    {
      "time": " 7.Aug.2007 7.09am",
      "content": "I always have a blast.  \nAnyone who’s even been on the board or organizing committee of a grassroots organization, you know how much time it takes to sort things out with people representing stakeholders from such a diversity of folk who make up the particular community.\n\n"
    },
    {
      "time": " 7.Aug.2007 7.52am",
      "content": "To further echo the sentiments expressed here, this year for me Typecon was really a pleasure . . .\n\nRunning smoother than I have ever seen it having been a former board member it was really a thrill to see how it has matured.\n\nIt was of course nice to meet many Typophiles and old friends and to reconnect with the typographic community ’analog style’\n\nAlready planning for Buffalo next year . . .\n\nStuart :D\n\n"
    },
    {
      "time": " 7.Aug.2007 7.57am",
      "content": "I’m so very glad I came back this year (after a half-decade break), and I can’t wait to make this a regular thing again.\n\nThanks everybody!\n\n"
    },
    {
      "time": " 7.Aug.2007 10.00am",
      "content": "Mike, sorry we didn’t connect. I’ll keep an eye out for you in Buffalo!\n\nMarc\n\n"
    },
    {
      "time": " 7.Aug.2007 4.32pm",
      "content": "In no particular order, thanks to: Stewf, Coltz, Tamye, Tiffany, Shu, Grieshaber, Kent, and all the volunteers and presenters. I know it was a lot of hard work and I really appreciate all you folks did. You have my gratitude for making TC07 a wonderful experience.\n\nAlso, it was great to meet so many people interested in the letter arts and to reconnect with my old friends and acquaintances in the type community.\n\n"
    },
    {
      "time": " 7.Aug.2007 5.41pm",
      "content": "A very special thanks from this SOTA Board Member to Kent “Linchpin” Lew. It may be clear to a few outsiders that Kent was a key factor in keeping this year’s ’Con running smooth, but it was _really_ obvious to those of us on the inside. His stamina and enthusiasm is remarkable.\n\n"
    },
    {
      "time": " 7.Aug.2007 5.48pm",
      "content": "Kent is da man Lew, thanks to him and the rest of the Board and those energetic smiling faced volunteers who were all top notch!\n\nChrisL\n\n"
    },
    {
      "time": " 7.Aug.2007 6.00pm",
      "content": "Adding my thanks to the list — not having been able to go to the last two, and not having stayed at the hotel for 2004’s in SF, I really got the full flavor this year. I left inspired to rededicate myself to focusing more on the type aspect of my design work, making it more the star than the supporting cast.\n\nIt’s interesting to me how many non-type-designers who were there. Not being a type designer myself, it’s nice to connect with people who are in the same boat as I am. (Don’t get me wrong, I love meeting and reconnecting with all the type designers as well!)\n\nHighlights: Gabriel and Leo (a really stellar presentation), Nick Shinn (the _Globe and Mail_ type & layout are so cool), the Film Fest (plus Joe & Jared’s excellent party DJ-ing), the eccentric genius Robert Bringhurst (he makes me want to be a linguist), and Marian Bantjes (I don’t care what Bringhurst says, that program was brilliant), among many others. Kudos as well to tech giant JP who kept so many things running smoothly.\n\nBiggest disappointment: Downer kept his shirt on the whole time during the party.\n\nI hope I can make it to Buffalo next year. But my biggest wish is that Tamye, Kent, Tiff, Stewf, Shu, Jon, et al, get to actually enjoy the fruits of their labors and see more of the presentations themselves.\n\n"
    },
    {
      "time": " 7.Aug.2007 7.35pm",
      "content": "Thanks to Tamye, the Board, volunteers and everybody who dug a little deeper to make it all happen.  \nSpecial thanks to Marian Bantjes for doing the conference identity; it was so very postmodern that, as a conference speaker, she presented her portfolio—with a step by step explanation of how the the conference ID came about.\n\n"
    },
    {
      "time": " 7.Aug.2007 8.38pm",
      "content": "Where are all the pictures? Did I miss some links?\n\nSharon\n\n"
    },
    {
      "time": " 7.Aug.2007 8.59pm",
      "content": "[http://www.flickr.com/search/?q=typecon&s=rec](http://web.archive.org/web/20080828101305/http:/www.flickr.com/search/?q=typecon&s=rec \"http://www.flickr.com/search/?q=typecon&s=rec\")\n\n"
    },
    {
      "time": " 7.Aug.2007 9.55pm",
      "content": "Pictures are going up all the time now - the ones I took included. Maybe I can figure out a way of getting the delay back to 24 hours again...\n\n"
    },
    {
      "time": " 7.Aug.2007 10.06pm",
      "content": "I’ve looked through quite a few, including yours, Eben. Looks like a great time. I love the calligraphy. Nice to see some or your faces and I appreciate those who put the names of the faces in the picture titles.\n\nSharon\n\n"
    },
    {
      "time": " 7.Aug.2007 11.52pm",
      "content": "[TypeCon Flickr Group](http://web.archive.org/web/20080828101305/http:/www.flickr.com/groups/85628044@N00/)\n\n"
    },
    {
      "time": " 8.Aug.2007 12.00am",
      "content": "TypeCon 07 was my first conference ever, and I had one hell of a good time. Thanks to all that organized it, and thanks to everyone I met in Seattle. I’ll be adding to the Flickr group as soon as I have a moment to stop spinning from all the catch-up work I have to do :(\n\n"
    },
    {
      "time": " 8.Aug.2007 6.51am",
      "content": "Dang, why did it have to be the first week of August? I missed being there and meeting some new faces. :^/\n\nI really hope I can fit Buffalo in my work schedule. Maybe next year…\n\n"
    },
    {
      "time": " 8.Aug.2007 8.01am",
      "content": "Yves, I was bummed that you weren’t there. I hope we can converge at a TypeCon in the future, so I can just shake your hand.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 8.Aug.2007 8.43am",
      "content": "Mike,  \nYou also want to see Yves dance!\n\nChrisL\n\n"
    },
    {
      "time": " 8.Aug.2007 10.22am",
      "content": "Well, I finally got back home yesterday midday. “Red-eye” flights are aptly named, and I was practically useless the rest of the day, barely managing to unpack and sort my mail. But I was able to get 12+ hours of sleep last night and feel nearly back to normal now (though I’m probably still running a sleep deficit).\n\nIt was great to connect with some new faces this year. Reading through the various follow-up threads, however, I realize that there are many Typophiles that I didn’t manage to meet, which is a bummer. I realize that when I’m very busy I can unintentionally put off a vibe of aloofness or unapproachability; I hope that next year, y’all will take a moment to grab me and introduce yourselves.\n\nI didn’t get to sit through any presentations in their entirety, but I did manage to catch decent snippets of a good many, and I have to say that I think this year’s program may have been among the best overall that I can recall. Tamye (with help from the local committee) did a stellar job putting it all together.\n\n<cite>Stephen: Kent “Linchpin” Lew.</cite>\n\n“Linchpin” . . . I like that. Thanks for the acknowledgment. It was a real pleasure getting to work closely together again with you.\n\nThe SoTA board is a volunteer, working board. We each invest a lot of personal time and energy to present a professional caliber conference every year. I may have been a bit more visible than many this year, but my colleagues all work hard throughout the conference, and I extend my personal thanks to all of them — Allan Haley, Jon Coltz, Tiffany Wardle de Sousa, Stephen “Stewf” Coles, Shu Yun Lai, James Grieshaber, Ilene Strizver, and Mark Jamra. Two of our number were conspicuously absent, for unavoidable personal reasons, but David Hollingsworth and Laurence Penney were supporting from afar, and I look forward to having them with us again in Buffalo.\n\nThere were two non-Board members who contributed greatly in managing important aspects of this year’s Con, and I want to make sure they get due recognition — Michelle Hill was our volunteer coordinator extraordinaire (as well as a great personal support to me throughout) and Deb Gonet managed the pre-conference workshops as well as a number of other important things throughout the weekend which would have otherwise fallen through the cracks.\n\nThe local volunteers were indeed top-notch. Most were students with little knowledge or even interest in type (although I’m certain that has changed now), but they were smart, enthusiastic, and hard-working. There were too many to thank individually here. But among the handful of non-students who lent a big volunteer hand, I want to personally thank Jane Jolkovski (from Monotype) and Jeff Barlow (typography chair from the Seattle AIGA chapter).\n\nTypeCon may only be one week out of the year, but it takes at least a year of nearly constant preparation to put together. The board members may work hard during the week of, but our extraordinary (and seemingly indefatigable) Executive Director Tamye Riggs works equally hard all year round. None of it would be remotely possible without all her amazing efforts. Major kudos once again to Tamye.\n\nWhen you’re working from the inside, it can be hard to maintain any real perspective, so I think I speak on behalf of all the organizers when I say that we take great satisfaction in hearing about the wonderful experiences of the attendees. So keep ’em coming.\n\n— Kent.\n\n"
    },
    {
      "time": " 8.Aug.2007 12.15pm",
      "content": "I’ve been to five of these now and this was one of the best, mainly because I was able to meet up with and talk to so many different people (including many I had not met before). I also finally arranged it so I wouldn’t have to duck out early on Sunday and miss the closing party. Thanks to Tamye, Kent, Stephen and everyone else who made it happen. Viva Buffalo!\n\n"
    },
    {
      "time": " 8.Aug.2007 1.06pm",
      "content": "Me and Gabriel are very happy of our experience at our first SOTA event. Thanks to you all guys. We realized that there’s a lot of work to do! and of course, there are many ideas for the next Typecon event.  \nApologies, I have been very busy trying to put online my site.... so for the moment you can write me to my email.... thanks for your patience\n\nL.\n\n"
    },
    {
      "time": " 8.Aug.2007 1.53pm",
      "content": "I’m starting a savings account so I can attend TypeCon in Buffalo next year. I can’t wait!\n\n"
    },
    {
      "time": " 8.Aug.2007 7.04pm",
      "content": "Big fun in Seattle! I haven’t been to TypeCon since Ess Eff a couple of years ago. It was great to see old friends and meet new ones. Kudos to SOTA and everyone else involved for putting on another great event!\n\n"
    },
    {
      "time": " 8.Aug.2007 10.06pm",
      "content": "I have been to a lot of type-related conferences over the past 13 years, and TypeCon Seattle was definitely one of the best. I can only think of a handful of other conferences that have been as good or better in some respects, and only one or two that were as consistently interesting or enjoyable.\n\n"
    },
    {
      "time": " 8.Aug.2007 10.13pm",
      "content": "Kudos to the committee members, to the volunteers, to the sponsors, and to all those who participated. Thank you for giving me something that I want to be part of...\n\n"
    },
    {
      "time": " 9.Aug.2007 3.43pm",
      "content": "I agree. This TypeCon Seattle was one of the best conferences I have assisted to. I enjoyed many presentations, specially the one by Gabriel and Leonardo. This is the first time I see Leonardo speaking, but I have seen Gabriel many times: I am not surprised, Gabriel always works hard to give the best of himself, and he has great ideas too. I really hope to see both in many future presentations.\n\nCongratulations and thanks to Tamye, the volunteers, sponsors, board, and every one who work hard to make this happen. See you in Buffalo.\n\nSaludos.\n\nJorge de Buen  \n [jorge.debuen@caliente.com.mx](mailto:jorge.debuen@caliente.com.mx)  \nTijuana (México)\n\n"
    },
    {
      "time": " 9.Aug.2007 9.51pm",
      "content": "This was my first TypeCon and I had such a wonderful time. I sometimes thought that my head would explode from all of the images and input, but I survived and look forward to my next experience.\n\n"
    },
    {
      "time": " 10.Aug.2007 12.22am",
      "content": "I had a great time, but I feel like I was so busy with conference stuff and shmoozing with the usual colleagues that I missed meeting a lot of Typophiles.\n\nPlease do feel free to introduce yourselves next time, okay? Just remind me what your Typophile name is, as I may not connect “James Puckett” with “jpad” and that sort of thing.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 10.Aug.2007 12.56am",
      "content": "Another reason we should go back to the days when there were no user names on Typophile, only full names.\n\n"
    },
    {
      "time": " 10.Aug.2007 1.51pm",
      "content": "I’ll second both of those statements!\n\n"
    },
    {
      "time": " 10.Aug.2007 1.53pm",
      "content": "If any of the mods feels like changing my user name to my real name, feel free. That’s what I get for not lurking longer before creating an account...\n\n"
    },
    {
      "time": " 10.Aug.2007 2.02pm",
      "content": "James, don’t you have the option to do it? If you can’t and really want it, I will change it for you.\n\n"
    },
    {
      "time": " 10.Aug.2007 2.20pm",
      "content": "Changing user names appears to be a moderator-only function, so please go for it.\n\n"
    },
    {
      "time": " 10.Aug.2007 2.34pm",
      "content": "There you go James. :^) I guess I should follow suit.\n\n"
    },
    {
      "time": " 10.Aug.2007 2.47pm",
      "content": "Thanks!\n\n"
    },
    {
      "time": " 10.Aug.2007 3.02pm",
      "content": "_I guess I should follow suit._\n\nOr at least _Ms_ Tiffany :-)\n\n"
    },
    {
      "time": " 10.Aug.2007 3.22pm",
      "content": "Ehehe. Fair enough.\n\n"
    },
    {
      "time": " 10.Aug.2007 3.22pm",
      "content": "Oh, will you change my user name, too? I would like that!\n\nSharon Van Lieu\n\n"
    },
    {
      "time": " 10.Aug.2007 3.24pm",
      "content": "Not a problem. Just don’t forget that you have to login with this changed ID next time. :^)\n\n"
    },
    {
      "time": " 10.Aug.2007 3.29pm",
      "content": "Thank you, that’s so nice.\n\nSharon\n\n"
    },
    {
      "time": " 10.Aug.2007 3.49pm",
      "content": "You’re welcome. :^)\n\n"
    },
    {
      "time": " 10.Aug.2007 7.25pm",
      "content": "Wow. Are we having a moment? That’s so sweet. I like the idea of making people use their full names. No more hiding behind some anonymous persona.\n\nAnd then it would be easier to recognize who we should avoid at typecon ;)\n\n"
    },
    {
      "time": " 11.Aug.2007 1.09am",
      "content": "I only wish Hrant “Scourge of the Anonyrat” Papazian was alive to see this... ;)\n\nWhere is he, anyway?\n\n"
    },
    {
      "time": " 11.Aug.2007 8.11pm",
      "content": "I’m late to the thread, sorry. I just wanted to say I had a great time at the conference and was thrilled to meet those of you I knew(-ish) and those of you I hadn’t known of before. The conference seemed to go off without a hitch from my perspective, and that’s no small feat, so kudos to the organizers and volunteers.\n\nI find the type community to be more egalitarian in general: humbler, in a way, than the design community. It seems to lack the strong cliques and hierarchies that become evident at design conferences.\n\nI liked the moments of heady technicality which get sprinkled throughout. It was an interesting mix of the handmade, the finely crafted and the truly geeky.\n\nA friend of mine remarked on the lack of type for motion or other non-print based media, and I think it’s a valid point. The design community is notorious for ignoring that which doesn’t appear in print, so maybe Typecon could keep a step ahead and keep that in mind for the future.\n\nSpeaking of which I wanted to thank the folks at Sansrival (I hope that’s right) for the terrific motion work on The Thing.\n\n-marian\n\n"
    },
    {
      "time": " 11.Aug.2007 9.33pm",
      "content": "<cite>I find the type community to be more egalitarian in general: humbler, in a way, than the design community. It seems to lack the strong cliques and hierarchies that become evident at design conferences.</cite>\n\nI agree completely. Even if I only get to attend one S{o}TA event a year, the membership is still a better investment than my AIGA membership was.\n\n"
    },
    {
      "time": " 12.Aug.2007 7.51am",
      "content": "_ignoring that which doesn’t appear in print,_\n\nMore web content would be good too.  \nProblem is, it’s always tougher to get type users to present — except for the music poster guys, off course :-)\n\nFor TypeCon 2002, I spent a lot of time courting various art directors — magazine designers, packaging designers, advertising art directors, without much success. No matter they may be great typographers, type is still not big enough on their radar (or I wasn’t) to warrant joining the speaker list.\n\n"
    },
    {
      "time": " 12.Aug.2007 5.41pm",
      "content": "I just arrived at home today after a few days in New York after Seattle. That was my first type conference and I really enjoyed to meet everybody there. All of you made me feel like a friend.\n\n"
    },
    {
      "time": " 13.Aug.2007 12.41pm",
      "content": "Well damn, Alejandro, you are a friend! :-)\n\nChrisL\n\n"
    },
    {
      "time": " 27.Aug.2007 6.27am",
      "content": "A very special thanks goes out to Eben Sorkin for being a one-man photo-documenter! Have you guys seen the number and quality of phots he did for TypeCon this yer? Check out his Flickr set or the TypeCon Flickr group.\n\n[http://flickr.com/groups/typecon/](http://web.archive.org/web/20080828101305/http:/flickr.com/groups/typecon/ \"http://flickr.com/groups/typecon/\")\n\nChrisL\n\n"
    },
    {
      "time": " 27.Aug.2007 7.11am",
      "content": "I’ll second that. Eben has become the [James Duncan Davidson](http://web.archive.org/web/20080828101305/http:/duncandavidson.com/) of TypeCon. (Davidson is famous for the [beautiful photos](http://web.archive.org/web/20080828101305/http:/flickr.com/photos/x180/354638930/in/photostream/) he shoots at tech conferences.)\n\n"
    },
    {
      "time": " 27.Aug.2007 9.00am",
      "content": "Thanks for your kind words!\n\nSpeaking of which, I would like to invite my fellow Typophiles to join myself & Checko on the photo team.\n\nAnd if you don’t want to shoot photos we could still use help processing & posting. I say this because my possibly deluded hope is that we can get a good hunk of the photos up in the same day/evening during TypeCon Buffalo.\n\nMark, thanks for the link. It will be a while before I am in that league.\n\n"
    },
    {
      "time": " 27.Aug.2007 1.15pm",
      "content": "I too had a wonderful time at the conference and really appreciate the efforts of all involved. Great job!  \nAfter I sent some of my photos to about half a dozen people, I got tired of it and just put a bunch up on my old, bloated website and thought some others might enjoy them too.  \n [http://www.art.net/Studios/Visual/Jillbell/typeconseattle.html](http://web.archive.org/web/20080828101305/http:/www.art.net/Studios/Visual/Jillbell/typeconseattle.html \"http://www.art.net/Studios/Visual/Jillbell/typeconseattle.html\")\n\n"
    },
    {
      "time": " 27.Aug.2007 6.09pm",
      "content": "Thanks for posting those, Jill! It looks like the Photoshop script can’t handle file names with ampersands. You should try [Flickr](http://web.archive.org/web/20080828101305/http:/flickr.com/). Once you get the hang of uploading, it’s really simple to share photos.\n\nThe “hottie” with you and Joshua, by the way, is [Zara Evens](http://web.archive.org/web/20080828101305/http:/typophile.com/wiki/Zara%252BEvens).\n\n"
    },
    {
      "time": " 27.Aug.2007 6.11pm",
      "content": "[Best pic of](http://web.archive.org/web/20080828101305/http:/www.art.net/Studios/Visual/Jillbell/TypeCon2007/Conference/images/Otmar%20on%20pig%201.jpg) [Otmar Hoefer](http://web.archive.org/web/20080828101305/http:/typophile.com/wiki/Otmar%252BHoefer) ever.\n\n"
    },
    {
      "time": " 27.Aug.2007 6.29pm",
      "content": "HA! I was waiting for someone to post that pic. I forgot who was there to take it. Thanks Jill!\n\nWe dared him to get up there. He was having so much fun. He had the glint of a mischievous little kid in his eyes.\n\nThe whole Linotype crew was a hoot to hang out with.\n\n"
    }
  ]
}
