{
  "id": "35742",
  "title": "Portfolio Website Feedback",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "My portfolio website is officially up and running! Take a looksy, tell me what you think! Feedback is much appreciated!\n\n[www.buddybogus.com](http://web.archive.org/web/20131012183340/http:/www.buddybogus.com/ \"www.buddybogus.com\")\n\nThanks!\n\n",
  "author": "shanejlong",
  "time": "5 Aug 2007 — 11:29pm",
  "uid": "15356",
  "comments": [
    {
      "time": "5 Aug 2007 — 11:41pm",
      "content": "Well done, but somewhat passe. I like it, but will the new generation like it? If you are making money, why ask? ;)\n\n"
    },
    {
      "time": "5 Aug 2007 — 11:58pm",
      "content": "Hello Shane,\n\nI like it. It's simple, easy to navigate and I get the idea of what you do very quickly, which I like.\n\nNot wild about humorous \"About\" pages, but that's just me. :-)\n\nNice work.\n\nSharon\n\n"
    },
    {
      "time": "6 Aug 2007 — 1:28am",
      "content": "Thanks guys. Eyehawk, in reference to your statement about it possibly appearing passe. My only response is that far too often I come across design and illustration sites that are difficult to navigate, graphically/aesthetically distracting, etc. I figured I would go in the complete opposite direction, strip it down as much as possible so that my work is all that is influencing the viewer, and that the user experience isn't aggravating or annoying. That said, I too feel its a tad on the boring side, and I've got about 12 other comps with some fancy elements. I may end up having to implement one of those if too many people are concentrating on the boring/plain-ness of the site and not my work.\n\nAgain, thanks for the feedback!\n\n"
    },
    {
      "time": "6 Aug 2007 — 6:34am",
      "content": "I'm sorry but I don't like the drop-down navigation, it takes too much work. I think those items should be active links on the left side of the page. It's also confusing to have WORK and INFO in the drop down navigations when they don't take you anywhere. I don't think you need \"About\" either. From a design standpoint it is pretty basic but it works.\n\n"
    },
    {
      "time": "6 Aug 2007 — 6:48am",
      "content": "Hey, Shane, I like a clean, basic website like yours, but I agree with Patty about the drop-down navigation. It's a bit confusing that the headers WORK and INFO look like separate menu items and then they don't bring anything up. If you keep the drop-down menu, maybe you could integrate the section names into the lists -- by removing the dotted lines beneath INFO and WORK, for instance.\n\nAlso... I'm not sure it's a good idea to have a practically empty page as the starting point... Think of that page as a cover for a book or printed portfolio of your work... You could use that space to say or show something about yourself -- it's the first impression you are making to a stranger visiting your site for the first time! Do you really want him or her to be greeted with a white page that says \"NAVIGATE!\"?\n\n"
    },
    {
      "time": "6 Aug 2007 — 9:50am",
      "content": "HI everyone, thank you for the feedback! I actually have another version of the site with a list-menu instead of a dropdown like you all suggested, and its been suggested ina few other places so I will be integrating that asap.\n\n\"Do you really want him or her to be greeted with a white page that says “NAVIGATE!”?\"\n\nActually, that would totally fit my personality, haha! But i see your point, I'll work on soemthing for the opening page.\n\nThanks again everyone!\n\n"
    }
  ]
}
