{
  "id": "3576",
  "title": "OpenType fonts",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Im dealing with an agency at the minute who are producing a custom font for a company I work for. As we are increasingly using fonts cross platform for director and powerpoint presentations I was wondering if I should get them to publish the final version in OpenType format. Which OSs / applications are supported at the minute? I dont need bells and whistles, just that the font will work.   \n   \nAlso is anybody here using OpenType fonts and found any advantages/disadvantages using them.   \n   \nCheers   \n   \nCraig\n\n",
  "author": "selfbuildtype",
  "time": "14 Oct 2002 — 7:07am",
  "uid": "863",
  "comments": [
    {
      "time": "3 Nov 2002 — 11:21pm",
      "content": "There's a lot of information on OS and app stuff in the OpenType User Guide from Adobe, and our readme. Both can be found at [http://www.adobe.com/type/opentype](http://web.archive.org/web/20131106080058/http:/www.adobe.com/type/opentype).   \n   \nAny other comments I make on the wonderfulness of OpenType are likely to be suspect, given my day job, but I can say that OpenType works on Windows 2000 and XP, and Mac OS X, natively. On Windows 95/98/ME and Mac OS 8.6-9.2, you need ATM Light or Deluxe. But of course, you'd need that for Type 1 fonts as well on those OSes.   \n   \nRegards,   \n   \nT   \n   \nThomas Phinney   \nProgram Mgr., Western Language Fonts   \nAdobe Systems\n\n"
    },
    {
      "time": "6 Mar 2003 — 9:33am",
      "content": "I'm having a lot of problems working with OT and can't seem to find anyone--Adobe, included--who can give me some answers.   \n   \nI'm using ATM Deluxe 4.6x and laying out collateral in Quark 4.x. My machine's performance is severly impaired using them (printing takes longer, page scrolling is a chore, etc.). Is there a reason for this?   \n   \nMy main problem is with the local service bureau not being able to handle the OT formats. I've checked with them to ensure they are up-to-date with software versions and all of that; they assure me that they are. They are unable to print to any printer, film output device, whatever.   \n   \nCan anyone here shed any light on this? I've read all of the readme's, pdfs, and official documenation at adobe.com, and looked everywhere else I can for more information. While everyone seems to speak highly of OT here, the design community still seem to be resonating with grumblings.   \n   \nThanks in advance.   \n   \ncp\n\n"
    },
    {
      "time": "6 Mar 2003 — 9:39am",
      "content": "Not sure if this is even the same issue, but with MM Fonts I found that I had to download the font to the RIP in order to get the file to print. Has your service provider tried this?\n\n"
    },
    {
      "time": "6 Mar 2003 — 10:09am",
      "content": "Don't know, but I'll ask them.   \n   \nAnd don't get me started on MM fonts. We learned our lesson there.   \n   \ncp\n\n"
    },
    {
      "time": "6 Mar 2003 — 1:22pm",
      "content": "For you info, I have done film output on my usual local printer shop from Indesign 1.5 and 2.0 on Mac 9 and Mac X in last september with OpenType fonts (my own OT done with FL 4.5 win version) -- with no problem at all. The film machine was an Agfa something... What is generally need is a rip with PS 3 (5 to 10 years old now I think... but many services bureaus in France still be on PS 2, hum).   \n   \nMiss to say, that I came with my Powerbook, mainly to avoid to give fonts and control everything, its for the Sabon Next brochure and the Charles Peignot book for ATypI.   \n [http://www.typofonderie.com/atypi/cpbook.html](http://web.archive.org/web/20131106080058/http:/www.typofonderie.com/atypi/cpbook.html)   \n   \nI never trust a printer when he say that he was up to date. Indeed some are up to date! Thanks for us.   \n   \nGood luck.\n\n"
    },
    {
      "time": "17 Mar 2003 — 7:57am",
      "content": "Hmmm... re your problem with OT-Fonts, the problem seems to be with the ouput bureau. The only thing about OT is that SOMETIMES they'll have to be installed locally, at the machine doing the actual output, not on some server location. But that's about it. When I bought my first OTs via Fontshop US from Adobe (couldn't buy them directly, as Adobe doesn't do business with Non-US-Customers on their homepage, alas, so Fontshop helped me for a small fee), I got MAC Fonts and even those installed perfectly on my XP-machine.   \n   \nOT, although a very problematic format for developer, as I hear, is wonderful from this users perspective. If you work with InDesign and -- as we do -- on Wintel workstations, youi'll not only be happy about the MASSIVE plus in typographic efficiency and freedom but\n\n"
    },
    {
      "time": "17 Mar 2003 — 8:55am",
      "content": "_OT, although a very problematic format for developer, as I hear, is wonderful from this users perspective._   \n   \nI've been making pretty much nothing but OT fonts (TT and CFF) for three years now, and find them much _less_ problematic than Type 1 fonts. Simply having a single binary file to maintain and ship (rather than multiple outline, bitmap, metrics files) makes OT development much easier and less time consuming. Even when I'm not making an extended character set or adding OT Layout features to a font, I'll still output a CFF-OT font in preference to a Type 1 because the file format is tidier, more compact and cross-platform.\n\n"
    },
    {
      "time": "17 Mar 2003 — 9:09am",
      "content": "That's great and all--and nice to hear from the others who have touted the alleged benefits and advantages of the OT format--but my dilemma still remains:   \n   \n1) Quark doesn't like (real time scrolling is an incredible bear and only has this problem when I have OT fonts installed and working) nor utilize the features of OT fonts (I can't use the hanging numerals or other parts of the face). Has anyone encountered/dealt with this?   \n   \n2) My service bureau still cannot work with the face as it currently stands. Is there something I can tell the SB other than \"Look, all these people on Typophile say it works and it's great so you must be idiots...\" (although that may be a good solution right there...)   \n   \nLess props, more application, si vous plais.   \n   \nThanks in advance.   \n   \ncp\n\n"
    }
  ]
}
