{
  "id": "3577",
  "title": "George W Bush",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "_Eliminate the Electoral College, and actually count write-in votes, and then we would have a democracy._   \n   \nActually, if we eliminated the electoral college, we still wouldn't have a democracy. We live under a Republic. Without the electoral college, our Republic would oly gain _the direct election_ of the president.\n\n",
  "author": "<a href=\"/web/20110509084708/http://typophile.com/user/1085\" title=\"View user profile.\">dan_reynolds</a>",
  "time": "<br>",
  "uid": "1085",
  "comments": [
    {
      "time": "",
      "content": "\\>This is the fine work of the World Bank   \n   \nHuh? The web site is of the International Textile, Garment & Leather Workers' Federation, and it doesn't mention the World Bank that I can see.   \n   \nBy the way, the mention of [Amartya Sen](http://web.archive.org/web/20110509084708/http:/www.guardian.co.uk/saturday_review/story/0%2C3605%2C465796%2C00.html) on your other link reminds me; he is known for pointing out that \"no famine has ever occurred in a country with a free press and regular elections\".   \n   \nAnother of the great blessings of democracy and a liberal state.\n\n"
    },
    {
      "time": "",
      "content": "Mr Technicality.   \n   \n [http://www.newint.org/issue214/simply.htm](http://web.archive.org/web/20110509084708/http:/www.newint.org/issue214/simply.htm)   \n   \n**WORLD BANK**   \n   \n_By 1990 SAPs were in place across much of the Third World. The result was a massive haemorrhage of wealth from the poor nations to the rich - an estimated $50 billion in 1985 alone. Co-operation between the IMF and the World Bank has meant that Third World nations continue to pay the interest on their debts even as they accumulate new ones. The social effects have been devastating: increased malnutrition, illiteracy, infant mortality and poverty. UNICEF estimates a half million children died in 1988 alone as a result of debt-induced austerity measures.   \n   \nWorld Bank and IMF staff now exert more power in some Third World countries than government ministers. There is little proof their policies do anything more than help bankers collect interest. In fact competition for scarce export markets holds down prices and depresses wages. The main winners have been Western consumers and multinational corporations who benefit from both low commodity prices and low Third World wages. Resentment is growing in the poor nations as World Bank/IMF policies increase the drain of wealth from South to North and reinforce the inequality of the global system._\n\n"
    },
    {
      "time": "",
      "content": "William, your intricate network of delusions would be cute, if they didn't make me sick to my stomach. But I want you to keep spewing the miasma, because it will remind people exactly what's wrong. In fact what makes your ilk hard to banish is that you're generally quiet, causing the misery form the background.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> And for our friend that is frightened by the great Cuban liberator, Fidel Castro. Worse \\>things have happened in Cuba by Americans torturing innocent youths. Human rights \\>dictatorship vs human rights democracy.   \n   \nGerald, maybe you should try to explain the difference to those incarcerated (77 persons in last month) for the decades (10-28 yrs) for a typewriter possession. Fidel Castro is plain dictator like Hitler, Stalin or Lenin. There is no excuse for the silly words you have written.   \n   \nPavel\n\n"
    },
    {
      "time": "",
      "content": "Gerald:   \n   \nIt's all very well to blame the loans, but would the Third World have really been better off without that money? What would have been the result of no loans?   \n   \nWilliam:   \n   \nIt might be true that no famine has ever occurred in a country with regular elections and a free press. But this raises a cause/effect question: isn't it quite possible that relative affluence is the root of regular elections and a free press, as well as of not having famines? It seems like this is a necessary pre-requisite for both.   \n   \nIt seems to me that even in a democracy with regular elections and a free press, if there are sufficient social divisions (perhaps ethnic or religious) which correspond with regional divisions, famine is still possible. Imagine if the great depression of the 1930s with the American \"dustbowl\" of former farmland had occurred in a country with the internal tensions of a Yugoslavia....   \n   \nMust get back to work!   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>We have one kind of democratic respresentation. The decision to include geographic weighting (as we do in the Senate of the US also) may be debatable or imperfect but it is still a democratic system.   \n   \n   \nThe decision to include geographic weighting can only be described as inhibiting democracy. What is debateable about a set of measures which make votes count for different weights without any conceivable advantage?   \nIn the UK, we have a 3 party system and we elect a parliament of local representatives, not a president, or even a government. It is these factors which allow opponents of democracy to cloud the issue of uneven weighting of votes. In the US there is no such excuse. The US will not be a democracy just by getting a democratic electoral system, but it can't be a democracy until it takes this first step.   \n   \n   \n   \n   \n\\>\\>Actually, if we eliminated the electoral college, we still wouldn't have a democracy. We live under a Republic. Without the electoral college, our Republic would oly gain the direct election of the president.   \n   \nThis is true, but you seem to be holding 'republic' and 'democracy' as mutually exclusive. Am I mistaken, or is that what you're saying?\n\n"
    },
    {
      "time": "",
      "content": "\\>isn't it quite possible that relative affluence is the root of regular elections and a free press, as well as of not having famines?   \n   \nI believe that Sen carefully tries to show that where India had more democracy and a free press, even with poverty, famine didn't result. If you read the link I gave earlier, you will get the flavor of Sen's argument, though it is based in both a study of the facts and in economic theory (which doesn't make it right of course). Famines usually happen with war and/or despotism, as in the recent war-related African famines or the famines in North Korea related to despotism. In neither case was there an lack of food, but rather of distribution to the people who needed it.   \n   \n\\>spewing the miasma   \n   \nSo Hrant, Sen's pro-liberal democratic views are 'miasma'? He grew up in Bengal, witnessed famine first hand, and went on to study it in great depth as an adult. For this and other work he got the Nobel Prize. So now that I suppose according to you he is a victim of 'psychological subjugation' by the Western media, right?   \n   \n\\>causing the misery form the background   \n   \nHrant, I have no position of power to cause misery to anyone, except to you by shaking your from your dogmatic anti-democratic views. I actually don't want to cause any pain to you, but I also don't want to let your pernicious anti-democratic views to go on unanswered, which is why I have posted on this topic today.\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>\"no famine has ever occurred in a country with a free press and regular elections\".   \n   \n\\>\\>isn't it quite possible that relative affluence is the root of regular elections and a free press, as well as of not having famines   \n   \nHey, Marx would be proud of you both!   \nOf course he would have taken 500 pages to have said the same thing, but the point is that from a Marxist point of view, regular elections and a famine free society are both achievements of capitalism.   \nPre-capitalist society is plagued by famine, and unemcumbered by elections.   \n   \nPersonally, I'm not so sure that its as clear cut as that. Officially there were no famines in 18th century England, but there definitely were very poor harvests and quite a lot of starvation. Of course, there were elections (in a 2 party system) but they were not democratic.   \n   \nOn another note...   \nRemember, just because Hrant says it, it doesn't mean its necessarily untrue. We have to keep in mind that elections are only about choosing the personnel, and the policies, not about choosing the system of government. (I know in theory an elected party could do this, but in practice the weight of vested interests prevents anything even close to that).\n\n"
    },
    {
      "time": "",
      "content": "\\>The decision to include geographic weighting can only be described as inhibiting democracy   \n   \nSteve, these issues are very complicated ones which political scientists have debated, but I don't see the point in going into them here are they are comparatively marginal to the issue - Hrant is arguing against democracy and for some kind of benevolent (he hopes) despot.   \n   \nI just wanted to separate the criticism of Bush, much of which is merited, from rejection of democracy - a terrible idea.\n\n"
    },
    {
      "time": "",
      "content": "I recommend you stop trying to invoke me.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>Steve, these issues are very complicated ones which political scientists have debated, but I don't see the point in going into them here are they are comparatively marginal to the issue...   \n   \nWilliam, these issues are marginal to Hrant's position, but more relevant to the earlier discussion about the virtues of the 2 party system. The volume of debate over electoral systems is massive (and I've read much too much of it), but geographical weighting in a 2-horse presedential race - can there be any defence?\n\n"
    },
    {
      "time": "",
      "content": "\\>Marx would be proud of you both   \n   \nNo, I think Sen is anti-Marx. Marx was contemptuous of democratic institutions, which he regarded I believe as quite ineffectual, and argued that the 'progressive emiseration of the working class' was inevitable. Dire proverty in the most developed countries was supposed to happen (I don't know whether with famine or not), followed by the seizing of power by the proletriat. Of course it didn't happen that way.\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>No, I think Sen is anti-Marx   \n   \nThat doesn't stop him (like many others) saying things which Marx has already said.   \nOne of the great problems with someone like Marx is that too many people (even those who make their living as political commentators) have enough of an idea of what Marx said to excuse them from ever having to find out what he did actually say.   \nMarx didn't see democratic instituions as innefectual, he saw them as ably doing what they were designed for - assisting the birth and growth of the capitalist economic structure.   \n   \nMarx didn't predict dire poverty under capitalism - he saw it as the most capable system for delivering a massive increase in material wellbeing and technological development.   \n   \nThis is why he predicted the failure of future revolutions in Russia (in the 1870s and 1880s) - because Russia had not experienced a developed capitalist economy, and so was short of material abundance - a pre-requisite of a successful socialist revolution.\n\n"
    },
    {
      "time": "",
      "content": "\\>geographical weighting in a 2-horse presedential race - can there be any defence?   \n   \nWell, most people in the US see it as a pointless relic, including me, but whenever people try to change it, they run into exactly the same problems that led to the geographic weighting in the first place. The less populous states feel that they will be ignored both in the election, and afterwards. As a result this antique the 'electoral college' has never gotten changed.   \n   \nI think the key problem in the last election was the politically influenced reasoning of the US Supreme Court.\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>I think the key problem in the last election was the politically influenced reasoning of the US Supreme Court.   \n   \nNot the fact that the candidate with the most votes lost?\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>The less populous states feel that they will be ignored both in the election, and afterwards   \n   \nWhat about the people who vote for the candidate who gets most votes, but loses the election? Don't they feel ignored?\n\n"
    },
    {
      "time": "",
      "content": "Tracy:   \n   \n_While I am positively seething to get this man out of office, I have to agree. The problem is, is his \"right thing\" good for our country and the rest of the world? Socially, economically, environmentally?_   \n   \nYes, that's really the crux of it. It's up to every voter to decide whether a particular canidate's convictions are good for the country and the world. That's why character is so important\n\n"
    },
    {
      "time": "",
      "content": "Daniel, you need to travel more.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>Marx didn't predict dire poverty under capitalism   \n   \nYes he did. After the initial increase in wealth, the 'inner contradictions' of capitalism would result in concentration of wealth for owners and lower and lower wages for workers, until the revolution would come. This is in Capital, and also in 'Wages Price and Profit', where he says \"The general tendency of capitalistic production is not to raise but to sink the average standard of wages, or to push the value of labor more or less to its minimum limit.\"   \n   \n\\>Marx didn't see democratic instituions as innefectual   \n   \nI meant ineffectual in the goals of helping the rights of the common man, as conceived of by democrats. Marx says in the Communist Manifesto that democratic institutions are \"merely a committee for managing the economic affairs of the whole bourgeoisie.\" The idea that they could protect the ordinary person from famine is alien to Marx, I believe.\n\n"
    },
    {
      "time": "",
      "content": "William, you knew Karl Popper? That's very cool.   \n   \nSteve, you replied while I was typing, so I should probably exapnd a bit more. The idea of geographically weighted voting is really based in the functional principle behind both democracy and capitalism, which is factionalism. Factionalism basically postulates that in any democratic system, balance can only be maintained by competing interests. That's the reasoning behind antitrust laws, as well basic separation of powers (same thing in the UK: Executive, Legislative, and Judicial branches).   \n   \nFactionalism means that you need to prevent any one interest from having all the power. Now, peoples' interests take a number of different forms\n\n"
    },
    {
      "time": "",
      "content": "\\> would result in concentration of wealth for owners and lower and   \n\\> lower wages for workers, until the revolution would come.   \n   \nClearly the opposite of what's actually been happening... :-/   \n   \nHopeless peons, borrowing, borrowing ideas (from those already in power, no less) until they can't tell right from wrong. Techinically I'm a peon too, but it's great to see my independenly-evolved ideas match those of an intellectual giant (as opposed to the psychological dwarfs trading technicalities) like Marx so closely.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "....and yet it's interesting how those independently developed ideas totally fail to take reality into account.   \n   \nSeriously, if the best you can do in defense of your theories is call us peons, save yourself the time and stop now.\n\n"
    },
    {
      "time": "",
      "content": "I've been reading the many digressions from the original post: \"George Bush\", and although I generally avoid discussing politics or religion, it is impossible not to make a comment, at least about the man in question if nothing else.   \n   \nIt is sad and incomprehensible that a man like Bush could have ever attained the position of leader of the land. Does this mean that he is considered by the electorate to be in the same intellectual company as Jefferson, Frankiln D. Roosevelt, Harry S. Truman?   \n   \nIf the answer is \"yes\", then I am utterly without hope. If the answer is \"no\", then what on earth is he doing in the Whitehouse?   \n   \nI have always heard that is is was possible for anyone born in the US to become president. Of that I now have little doubt.   \n   \nIt may seem boorish that a Canadian has the cheek to make an unkind comment on the leader of our nearest and long-time friend, the USA. My comment is a sincere one, spurred on by the fact that Bush's preciptous actions against Iraq have put Canada under threat of terrorist attack, if the news services are to be believed.   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "",
      "content": "Thomas,   \n   \n_It's all very well to blame the loans, but would the Third World have really been better off without that money? What would have been the result of no loans?_   \n   \nYes, they would have been better off without the loans. They would be better to simply default on the loans.   \n   \nYou want to know why?\n\n"
    },
    {
      "time": "",
      "content": "[http://edition.cnn.com/2004/ALLPOLITICS/03/16/bush.brain.ap/index.html](http://web.archive.org/web/20110509084708/http:/edition.cnn.com/2004/ALLPOLITICS/03/16/bush.brain.ap/index.html)\n\n"
    },
    {
      "time": "",
      "content": "William,   \n   \n\\>Marx didn't predict dire poverty under capitalism   \n   \n_Yes he did. After the initial increase in wealth, the 'inner contradictions' of capitalism would result in concentration of wealth for owners and lower and lower wages for workers, until the revolution would come. This is in Capital, and also in 'Wages Price and Profit', where he says \"The general tendency of capitalistic production is not to raise but to sink the average standard of wages, or to push the value of labor more or less to its minimum limit.\"_\n\n"
    },
    {
      "time": "",
      "content": "William,   \n   \nMarx's prediction of a decline in the average standard of wages doesn't include the prediction of 'dire poverty in the most advanced countries'.   \nFor one thing, as capitalism is becoming truly global, the average standard of wages would need to take account of those many millions of workers who do not live in capitalist societies themselves (and receive none of the freedoms and benefits which Marx says exist for workers under capitalism), but whose labour power is employed by capitalists, largely contributing to the material wellbeing of workers in the advanced capitalist economies.   \nAlso, the standard of wages is relative to the overall value of production.   \n   \nThe point I was trying to make is this: For Marx, famine (on the whole) is the product of a pre-capitalist economic structure. Agrarian revolution, leading to a massive increase in agricultural productivity and the stabilisation of agricultural output is a necessary pre-condition of the development of capitalism.   \nOnce capitalism begins to take hold, technological developments lead to material abundance, in the most advanced countries at least.   \n   \n==========================   \n   \n\\>\\>lower and lower wages for workers, until the revolution would come   \n   \nHistorical materialism doesn't depend on the dire poverty of workers to push them into revolutionary action. For Marx, the revolution which removes capitalism doesn't have to mean 'manning the barricades' or storming the Winter Palace. The \"era of social revolution\" is essentially characterised by the displacement of one dominant production relation by another. It is possible that this revolution could consist entirely of processes of 'adaptive metamorphosis' or revolution from above. Marx's description of the emergence of capitalism in England includes elements of both of these processes. He saw the bourgeois revolution in England as involving a variety of forms of revolutionary action, and a broad range of 'revolutionaries', including feudal landowners.   \n   \n==========================   \n   \n\\>\\> Marx says in the Communist Manifesto that democratic institutions are \"merely a committee for managing the economic affairs of the whole bourgeoisie.\" The idea that they could protect the ordinary person from famine is alien to Marx, I believe.   \n   \nActually, it is the 'executive of the modern state' which he sees in that way. (Or, in Terrell Carver's 1998 translation, 'the power of the modern state'). This is a judgement on the non-democratic states of mid-19th century Europe, rather than upon the concept of democratic institutions. Marx sees the then existing states, and even the further development of representative democracy, as only possible under capitalist (and ultimately post-capitalist) economic forms, and therefore historically incompatible with famine.   \n   \nI suppose the summary of all that is this:   \nDemocracy can only come into being with capitalism, though it doesn't have to go when capitalism does.   \nThe technological advances that enable the emergence of capitalism, and those much more spectacular advances which it facilitates, render famine, largely, a thing of the past.\n\n"
    },
    {
      "time": "",
      "content": "Pavel   \n   \n_\\> And for our friend that is frightened by the great Cuban liberator, Fidel Castro. Worse \\>things have happened in Cuba by Americans torturing innocent youths. Human rights \\>dictatorship vs human rights democracy.   \n   \nGerald, maybe you should try to explain the difference to those incarcerated (77 persons in last month) for the decades (10-28 yrs) for a typewriter possession. Fidel Castro is plain dictator like Hitler, Stalin or Lenin. There is no excuse for the silly words you have written._   \n      \n   \nOwning typewriters is a moral sin that will be addressed, I trust, in the after world.   \n   \nThere are some things that are morally demonic, typewriters are one of them. Fidel Castro is obviously greatly enlightened and I appreciate this nugget of information you have given me. Those mono unit typewriter faces ruined my mommies vision hence the bad taste decorating in the family home.   \n   \nTurquoise! What a disgrace! You better watch out this could happen to you. Oh, and liver shaped coffee tables, these visual travesties were unleashed all throughout the America's by that hideous contraption \"the typewriter\",   \n   \nCastro rightly calls them the \"devils horns\", at least that is what Captain Juan Valdez told me aboard this very ship. [http://lanstontype.com/FinnishCargoShip.html](http://web.archive.org/web/20110509084708/http:/lanstontype.com/FinnishCargoShip.html)   \nHe said, and I pass this wisdom on to all. \"Wake up and smell the coffee!\"   \n   \nIf my mother drank coffee instead of that dastardly tea she may have had the brains to get rid of that ungodly home wrecking invention.   \n   \nI was so disgraced I ran away from home when I was thirteen and never got an education. Would you want that to happen to your children? That they should wind up like me? Go ahead, say it, you don't do you.   \n   \nLet me make it easier for you.   \n   \n [http://lanstontype.com/GiampaGoesToSea.html](http://web.archive.org/web/20110509084708/http:/lanstontype.com/GiampaGoesToSea.html)   \n   \nYes, Castro believes in the family unit. He has his priorities correct. Make cigars not typewriters.   \n   \nAnd I say, \"good for him\".   \n   \nYou know some people think I look like Castro.   \n [http://lanstontype.com/GiampaHat.html](http://web.archive.org/web/20110509084708/http:/lanstontype.com/GiampaHat.html)   \n   \nThe other contraption that should be banished is bikes. Those snarky little double cheeked bums wagging insult after insult in your eyeballs as they peddle, pump. peddle, pump, peddle, pump down the street \"burning up gallon after gallon of gasoline as it there were no tomorrow.\"   \n   \nI say drive the suckers over. Don't they have any respect for the environment. All those danged gas guzzling bikes. What a bunch of inconsiderate morons.   \n   \nJust think about? Those slimy sweaty cabbage patch misfits peddling away thinking they are doing \"just the right thing\". Meanwhile every car has to slow down in order to pass them. Slow down, then the poor motorist has to \"step on the gas\". You got it folks, \"lots and lots and lots of gas. Every car must do the same thing. One car after another.   \n   \nThose granola eaters are responsible for the war in Iraq. Don't get me started.   \n   \nGallon upon gallon spewing to the hemispheres.   \n   \nThen these Nimrods dare lecture me about how eco friendly they are. I would like them to\n\n"
    },
    {
      "time": "",
      "content": "Gerald, I don't appreciate your humor when it comes to bikes. I ride about 12,000 miles a year and I have more than one road raging motorest threaten me or worse try to run me over, why, because I exist. Cell phones have only made it worse I was almost run over two years ago by a cell phone talking motorist who was paying no attention to what she was doing (driving the car), bikes are not toys, the average racing bike now costs well over $2000 american and a really good one is in the $5000 range. Threatening life is not humor, at least not to me.\n\n"
    },
    {
      "time": "",
      "content": "\\> Just what I hate, typewriters, bikes and nimrods.   \n   \nOkay Gerald, you got me! Because all typewriter owners are imprisoned already I am gonna liquidate all bikers I meet today in yours favour. Hope it helps.   \n   \nPavel\n\n"
    },
    {
      "time": "",
      "content": "Pavel,   \n   \nThat calls for a Cuban cigar!\n\n"
    },
    {
      "time": "",
      "content": "Steve, I think you are reading apologists who want to cover up what Marx and Engles actually said - for they were quite wrong in their historical prophesies.   \n   \nThe 'executive of the state' includes democratic institutions in Marxism. Here is Engels: \"In reality the state is nothing more than a machine for the oppression of one class by another and this holds for a democratic republic no less than for a monarchy.\" (Introduction to 'The Civil War In France')   \n   \nI can tell you that in England in the late '60s, when I was there at the LSE, and Marxism was riding high in certain circles, the Marxists were constantly ridiculing the emptiness of democratic institutions as nothing but the tool of the boureoisie for oppression of the working class.   \n   \nAnd the collapse of capitalism is supposed to come from increasingly severe depressions which are cataclysmic. Here is Marx on these economic crises (from the Manifesto): \"It appears as if a famine, a universal war of devastation had cut off the supply of every means of subsistence; industry and commerce seem to be destroyed...\"   \n   \nThe idea that elections could protect against famine is, I think, totally alien to Marx's thinking. As to the internationalization of the work force, as I said Lenin tried to give this as an explanation for the failure of Marx's predictions of the collapse of capitalism. The problem is that the wages in poor countries like China, where production is done for rich countries, are rising, not falling, in spite of a huge reservoir of poor rural people wanting industrial work.   \n   \nIn spite of brilliant insights, Marx's analysis is wrong in so many ways that it is just antiquated. People like Amartya Sen are going to give you an incredibly more advanced understanding of the current economic system than did the Marx and Engels of over a hundred years ago.   \n   \nBy the way, the edition of 'Capital' I have, published in Moscow in 1968, is set in 10 point Bodoni with no leading - practically unreadable. Now that's backward for you!\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>Steve, I think you are reading apologists who want to cover up what Marx and Engles actually said   \n   \nWilliam, I think you're being patronising.   \nNothing I have said here has been taken from any Marxist's work (except Marx himself - or Marx and Engels)   \n   \n   \n   \n\\>\\>for they were quite wrong in their historical prophesies   \n   \nWell, I think _predictions_ would be the word, rather than _prophesies_.   \nOK, I'm not suggesting everything Marx said was correct, or that everything he predicted has happened, but Marx and Engels were not as wrong as you clearly think they were, and their analytical framework provides a much more perceptive vision of the modern world than anything I've seen people like Sen or Popper come up with.   \n   \n   \n   \n\\>\\>The 'executive of the state' includes democratic institutions in Marxism. Here is Engels: \"In reality the state is nothing more than a machine for the oppression of one class by another and this holds for a democratic republic no less than for a monarchy.\" (Introduction to 'The Civil War In France')   \n   \nWilliam, you don't seem to be able to appreciate context at all. From Marx and Engels perspective democracy is something to be criticised, not because its wrong or evil, but because it doesn't go far enough. Too often, their contemporaries saw democracy as the goal, whereas Marx and Engels were arguing that its the economic form which has to be changed. Do you think that they envisaged the post-capitalist state as a tool of class oppression?   \n   \n   \n\\>\\>I can tell you that in England in the late '60s, when I was there at the LSE, and Marxism was riding high in certain circles, the Marxists were constantly ridiculing the emptiness of democratic institutions as nothing but the tool of the boureoisie for oppression of the working class.   \n   \nWell, that's Marxists for you. Is that anything to do with me?   \n(Oh, by the way, they may have assumed that they didn't have to spell it out to you that they were referring to democratic institutions UNDER CAPITALISM. In such circumstances the state does indeed have the role of assisting the bourgeoisie in exploiting the working class. On the other hand they may not have understood the distinction themselves).   \n   \n\\>\\>And the collapse of capitalism is supposed to come from increasingly severe depressions which are cataclysmic. Here is Marx on these economic crises (from the Manifesto): \"It appears as if a famine, a universal war of devastation had cut off the supply of every means of subsistence; industry and commerce seem to be destroyed...\"   \n   \nOohhh, very cataclismic, but..errr...you forgot to quote the rest of the paragraph. The bit where Marx notes that these crises aren't so cataclismic that the bourgeoisie can't find a way around them - by finding new markets to exploit, and further exploiting the existing ones. So all the drama and devastation and destruction is really a bit of dramatic licence in what was, after all, a call to action, rather than the rigourous analytical work that was more typical of Marx. Marx and Engels did admit later in life that they had made a mistake in viewing the crisis of 1848 as the death-agony of capitalism. Quite soon afterwards the awful truth dawned on them that 1848 had merely been part of the birth-pangs.   \n   \n   \n   \n\\>\\>The idea that elections could protect against famine is, I think, totally alien to Marx's thinking.   \n   \nAnd mine too. I think I've already said this in a few different ways, but maybe another way will allow it to sink in (if I simplify it enough), here goes...   \n   \nElections and stable agricultural output are both absent in the pre-capitalist epoch.   \n   \n   \n   \n\\>\\>As to the internationalization of the work force, as I said Lenin tried to give this as an explanation for the failure of Marx's predictions of the collapse of capitalism. The problem is that the wages in poor countries like China, where production is done for rich countries, are rising, not falling, in spite of a huge reservoir of poor rural people wanting industrial work.   \n   \nOK, but are the wages of those in, say, the shoe industry, in say, China (a poor example, if I may say so, but we can run with it), higher than those of the workers in, say, the shoe industry, in say, Northamptonshire, in say, the 1970s? That is to say, taking the shoe industry as an example, are the wages of those on the production line rising, or falling?   \n   \n   \n\\>\\>By the way, the edition of 'Capital' I have, published in Moscow in 1968, is set in 10 point Bodoni with no leading - practically unreadable. Now that's backward for you!   \n   \nYou seem to say this with the kind of misplaced triumphalism that characterises the work of the thick witted Fukuyama. This makes me think (and I hope I'm wrong) that you think that the industrial backwardness of the Soviet Union in 1968 supports your argument, and mitigates against mine.\n\n"
    },
    {
      "time": "",
      "content": "Hrant,   \n   \nI sure do need to travel more, but that's not really good grounds to dismiss my statements. I've lived in several different countries and spent time dozens of them. What all this amounts to is a simple appeal to belief. Just because a lot of people believe something does not necessarily make it true.\n\n"
    },
    {
      "time": "",
      "content": "Thomas,   \n   \n_It's all very well to blame the loans, but would the Third World have really been better off without that money? What would have been the result of no loans?_  \n   \nThe answer is clearly yes. The third world would be much better off without those loans. Better to simply default.   \n   \n [http://sept.globalizethis.org/article.php?list=type&type=7](http://web.archive.org/web/20110509084708/http:/sept.globalizethis.org/article.php?list=type&type=7)\n\n"
    },
    {
      "time": "",
      "content": "10 pt Bodoni with no leading in 1968?   \nThat's Madison Ave. (eg Carl Ally for Hertz.)\n\n"
    },
    {
      "time": "",
      "content": "\\>their analytical framework provides a much more perceptive vision of the modern world   \n   \nI'm not being patronizing; I just think you are wrong.   \n   \nThe twentieth century was one massive testing and refutation of Marx's views, as extreme socialist (Communist) states collapsed or changed, and mild socialist states, like the European ones, only kept the welfare state, which had been introduced by Bismark, not Marx. The extreme socialist states were huge economic and moral failures. Socialist agriculture, in particular, proved to be an oxymoron, like 'round square'. It never worked, anywhere, anytime.   \n   \nNow I know that Marx had his loony anarchist vision - unrelated to his critique of capitalism - of 'whithering away' of the state, but I think his ideas need to be judged by the reality of those who have earnestly tried to put them into practice.   \n   \nTo maintain that Marx is so much more perceptive than liberals like Popper or Sen is, in light of repeated failures of socialism, and repeated successes of liberal states with mixed economies (capitalism, welfare state) to me flies in the face of experience. There are plenty of problems with modern Captitalism and democratic states, but to look to Marx for solutions is, in my opinion, bizarre.   \n   \n\\>That is to say, taking the shoe industry as an example, are the wages of those on the production line rising, or falling?   \n   \nSo you want to maintain Marx's theory of steadily falling wages for workers, in spite of a hundred and fifty years of refutation? The comparison is not with English shoe workers today, because English workers are in different vocations, but they are working. I believe that the wages of English workers are higher in real terms now than in 1970.\n\n"
    },
    {
      "time": "",
      "content": "William, If I remember correctly Ronald Regan (who I didn't vote for) had a pissing match with the USSR on who could spend more money on arms, knowing it would bankrupt them and it did. If you look carefully at Russia today its new Tsar (oops president) Putin uses all the terms of democracy and basicly runs a closed political system. Every country has gotten the idea of a spin doctor and will make even the most horrible government sound like a free institution. I don't judge a country on its retoric, but on its actions. President Bush in his want to erraticate world wide terrorism has invaded two countries and has no exit policy, and every day another American or ally dies for lack of an exit strategy.\n\n"
    },
    {
      "time": "",
      "content": "\\> democracy is something to be criticised, not because   \n\\> its wrong or evil, but because it doesn't go far enough.   \n   \nExactly.   \n   \n\\> Just because a lot of people believe something does not necessarily make it true.   \n   \nExactly.   \n   \n--   \n   \nAnd long live Tsar Putin. (Hey, that sounds like \"Rasputin\".)   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>I'm not being patronizing; I just think you are wrong   \n   \nPlease by all means, think I'm wrong, its up to you.   \nHowever, the statement of yours which was patronising was 'I think you are reading apologists who want to cover up what Marx and Engles actually said'.   \n   \nI've read enough Marx first hand to find that statement patronising. From the look of the rest of your post, you haven't read nearly as much.   \n   \nYou say that 'The extreme socialist states were huge economic and moral failures' and present this as a refutation of Marx.   \n   \nOh dear, now I feel like I need to bemoan the commentators you've been reading.   \n(I'll try to be brief as everyone else must be bored by now)   \nFor Marx, there were certain pre-conditions which had to be fulfilled before any given economic form could develop. Capitalism, for example, cannot arise while the mass of the population are tied to the land, either by laws of settlement or by ownership rights. A mass of landless labourers is a pre-requisite for capitalist development.   \nSocialism, or communism, if you like, also has certain pre-requisites. One of these is that capitalism has developed and created massive productive capabilities and material abundance.   \nIn The German Ideology (1845-47) Marx and Engels predicted failure for attempts to establish socialism before this material requirement had been met:\n\n"
    },
    {
      "time": "",
      "content": "\\>one massive testing and refutation of Marx's views   \n   \nWilliam, communist states were isolated and crushed by the West. That's not a refutation of Marx's views.\n\n"
    },
    {
      "time": "",
      "content": "I just re-read that post.   \n   \nOh Sh1t, if that's my attempt to be brief, I'd better go and drink more beer.\n\n"
    },
    {
      "time": "",
      "content": "Steve, I'm impressed by your grasp of this.   \n   \nLet me ask you a hypothetical version of a very real question you've asked me:   \nIf one wanted to replace a democracy with a benign monarchy, what is a practical scheme? Would it make sense to allow a really really long campaign and then have the people choose a monarch, who subsequently would choose a successor, maybe somebody not related by family?   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant,   \nI know you're being hypothetical here, but I can't imagine wanting to replace a democracy with a monarchy. Its a step backwards. And part of the problem is that I can't imagine a practical scheme for giving someone absolute power.   \nAside from all the usual problems, what if they go insane? Can they still rule, or does someone have the power to remove them? Who decides if they are insane? What if they turn out to be really unpopular after a few years, or become obsessed with a particular idea or person, or experience a life changing event and develop a completely different character, or just slowly transform from a vibrant young go-getting type into a grumpy old man?   \nAnd what about the succession? What if they sell the succession to the highest bidder, or give it to the highest briber, or just choose the girl with the nicest nose? What if they leave it to a cats home?   \n   \nSorry to sound negative hhp, but I can't make my head see monarchies as anything other than a really silly, and dangerous, way to govern a country.   \n   \n(Most modern European monarchies are actually harmless enough, but they're still a waste of money and that hereditary thing really sticks in my throat).\n\n"
    },
    {
      "time": "",
      "content": "Steve, this isn't at all the right place to put you on the spot about the merits of democracy versus monarchy, but I would like to ask you this: If you're not interested in the hypothetical angle (it's not like any of us have any real power anyway), then why did you once ask me to elaborate on this myself? Should I unflag that post of yours? Or were your questions just now not [all] rhetorical after all? If not, then I guess the main answer is: \"shite happens\".   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>If you're not interested in the hypothetical angle (it's not like any of us have any real power anyway), then why did you once ask me to elaborate on this myself?   \n   \nIts not that I object to the hypothetical angle.   \nBut its you that recommends a monarchy, so its up to you to answer potential problems with that solution, hypothetical or otherwise. (Of course, there's no obligation to address such questions, but if you suggest a solution without addressing people's concerns, then its hard for people to take your suggestion seriously).   \nTo be honest, I can't get into the whole monarchy thing - for the reasons given above, and for the want of answers to the questions I put to you before, among other things - but if you can provide satisfactory answers to my doubts, maybe I'll be persuaded.   \nMaybe its also because I'm intrigued. Usually, when I meet a monarchist its an old lady with a blue rinse who thinks the queen does ever so well to put up with what she has to put up with (\"and you never hear her complain\"). Asking for a practical or ideological justification of the monarchy from those people is like asking monkeys to argue the case for bananas. I'm interested in what a travelled & cosmopolitan person of my generation sees in the idea. (I hope I'm not making you out to be older than you are).   \nI can't see myself being persuaded, but without some answers, I'll never know!\n\n"
    },
    {
      "time": "",
      "content": "\\>William, communist states were isolated and crushed by the West. That's not a refutation of Marx's views.   \n   \nWell, they were incredibly stagnant and unproductive economically, while the West was going from strength to strength. They were also horribly oppressive and corrupt. And they really didn't have any excuse. The old Soviet empire had plenty of raw materials, population, land and education. The West had a lot to do with limiting the spread of their power, but they fell of their own internal stagnation, decay, and in lack of belief in their own system. In my opinion, Ronald Reagan had very little to do with it, in spite of what US right wingers like to claim.   \n   \n   \nSteve, the reason I thought you must be reading someone else's version of Marx is a.) you didn't quote Marx and b.) you seemed to claim stuff that is contrary to what I heard Marxists say for years, and that I read myself.   \n   \nFor example, you said \"This [view of government as purely a tool of the bourgeoisie] is a judgment on the non-democratic states of mid-19th century Europe, rather than upon the concept of democratic institutions.\" But Engels, as I quoted above, flatly contradicts your statement.   \n  \nFurthermore, Marx's claim I quoted is that \"The general tendency of capitalistic production is not to raise but to sink the average standard of wages, or to push the value of labor more or less to its minimum limit.\" You can compare shoe workers in England and China, but that is not the test of Marx's claim. The relevant comparison is of the change in average wages in a country, or in the world at large, and in both cases the average standard has raised, not lowered, thus contradicting Marx.   \n   \nAs to the relevance of the twentieth century Communism and Socialism to Marx, it is necessary to separate two things. First is Marx's critique of capitalism and second is his ideas about the socialist state. His critique is insightful but fundamentally flawed. His views of the socialist state are practically non-existent, as he basically relied on his loony idea that once the state owned the means of production, it would wither away. Lenin had to develop a theory of a socialist state, in which the Communist party was somehow able to speak for the proletariat. This was rubbish, but it was an excuse to rule and oppress others. And of course the state did anything but wither away.   \n   \nIn moderate socialist experiments of Western Europe, nationalized industries just didn't work very well. The experience of socialist experiments of the 20th century give us a lot of basis to judge Marx's dreams by, and they look pretty miserable.   \n   \nFrankly, Marxism is not high on my list of stuff to engage again intellectually, as it is in my opinion one of the deadest philosophies out there. Therefore I will not add further to the case I have made up to now concerning Marxism. Popper made a much more powerful case in 'The Open Society and Its Enemies', if anyone is interested.\n\n"
    },
    {
      "time": "",
      "content": "_Frankly, Marxism is not high on my list of stuff to engage again intellectually, as it is in my opinion one of the deadest philosophies out there._   \n   \nI find it ironic anyone would consider the problems of intenstinal consumption a philosophy. Wouldn't that be a _medical problem?_   \n   \nCapitalists, and slugs are all one and the same, they love to consume, and both leave tracks.   \n   \nPlumbers know what should run downhill. Trouble with captitalists is it runs uphill. You know \"you\" need a plumber, something is backed up. It smells bad.   \n   \nYou can always do it in the \"Bush\" at election time.\n\n"
    },
    {
      "time": "",
      "content": "Look, how do you figure the world average income is up. If so, do your really have any reason to believe it has anything to do with capitalism vs communism?   \n   \nWhat is all of this based on? I can't seem to find any source that is worthy of repeating.   \n   \nSome how, the poor, look, just poor. And the rich look like they don't deserve to be. Well, except obese.\n\n"
    },
    {
      "time": "",
      "content": "William,   \n   \nI don't think there's much point in taking this any further. You are still blaming the Soviet Union on Marx despite the fact that he specifically said that such a revolution would fail to bring about socialism, and would result in the restoration of 'all the old filthy business'. Have a look out east.   \n   \nWhat Lenin did or said is not relevant to a discussion of Marx. Same goes for Stalin, Gorby and anyone at the LSE in the 1960s.   \nI'm not saying that no-one has anything relevant to say about Marx, but pointing out errors in the arguments of those who claim to be Marxists is not relevant to a discussion of Marx's ideas.   \nYour failure to be able to look past this is what handicaps your ability to understand the discussion.\n\n"
    },
    {
      "time": "",
      "content": "OK Steve, so the Soviet Union doesn't count. How about the late great German \"Democratic Republic?\" Why did they all choose to abandon Communism? Or if it wasn't communism, what was it?   \n   \nI think these mid-1800s theories had more relevance in the economic conditions of the time. Industrial labor has since given way to more and more technology, and more and more people in both the First and Third World are engaged in less physical labor and more symbolic analysis. Would you disagree?   \n   \nNot a day goes by when I don't hear some arse-clown complaining about losing his $80K I.T. job to someone who can read and write perfect English in India. Actually having worked under such arse-clowns myself, I don't lose too much sleep over the recent \"dot com bust\" which more than anything else was a culling of overpaid middle management in exchange for more productive bottom-level workers with enough of their own initiative to do their jobs well without middle managers.\n\n"
    },
    {
      "time": "",
      "content": "Steve, for a nearly a century all who professed to be devoted followers of Marx defended the Communist states or the nationalized industries of democratic states as leading the world to a better day in conformity to Marx's analysis and ideas.   \n   \nNow you airily wave away all those millions as not worth even addressing. At the same time you don't either address the contradictions of Marx with reality, which I have pointed out, nor your mistaken interpretations of Marx and Engels, which are flatly contradicted by my quotations from them.   \n   \nNor do you acknowledge that Marx had little to say about how a socialist state might work. The only experience we have of socialism is of the communist and socialist countries of the twentieth century. Anyone actually interested in improving society will try to learn by the failures in these societies, as well as by the failures of capitalist societies. To wave the socialist failures aside as irrelevant and to simply re-assert Marx is to take Marx on faith, as a dogmatic religion. This had some excuse in those states where Marxism was the state religion and you could be imprisoned or shot for criticising Marxism. Today such a devotional attitude to Marx is just ridiculous.\n\n"
    },
    {
      "time": "",
      "content": "William   \n   \n\"The only experience we have of socialism is of the communist and **socialist countries** of the twentieth century. Anyone actually interested in improving society will try to **learn by the failures in these societies,** as well as by the failures of capitalist societies.\"   \n   \nIs there reason not to learn from success?   \n   \n\"Finland is socialist to the extreme.\" Are they doing well? YOU BET THEY ARE!\n\n"
    },
    {
      "time": "",
      "content": "\\>Is there reason not to learn from success?   \n   \nAbsolutely, we should learn from the successes also, both of capitalist and socialist efforts. So far as I can see the great success of socialist reforms has been in the creation of the welfare state. That is, to mitigate the evils of capitalism by unemployment and old age insurance, child welfare, state subsidy of health care, etc. This was I think inspired by socialist thinkers, though was in fact first instituted by Bismark, who was anti-socialist. The key innovative idea of Marx, that government ownership of the means of production was the key to a better world, seems to have flopped completely. I don't know about Finland, but I believe that even Sweden has abandoned some of its nationalized industries.   \n   \nThe great success of capitalism has been economic growth and prosperity to an extent unprecedented in world history, and now spreading - with tragic unevenness - throughout the world.   \n   \nThe states with liberal democracies and mixed economies (large govt sector, capitalism and welfare state) have also been less oppressive and unjust than most of societies in the past, and certainly less cruel and oppressive than either Communist or most 3rd world governments.\n\n"
    },
    {
      "time": "",
      "content": "William,   \n   \nIs debt success? Or postponed pain.   \n   \n _[http://news.bbc.co.uk/2/hi/business/3377795.stm](http://web.archive.org/web/20110509084708/http:/news.bbc.co.uk/2/hi/business/3377795.stm)_\n\n"
    },
    {
      "time": "",
      "content": "Or is this success?   \n   \n [http://news.bbc.co.uk/2/low/business/2332053.stm](http://web.archive.org/web/20110509084708/http:/news.bbc.co.uk/2/low/business/2332053.stm)   \n   \nOr this.   \n   \n [http://www.imf.org/external/np/apd/seminars/2003/newdelhi/lardy.pdf](http://web.archive.org/web/20110509084708/http:/www.imf.org/external/np/apd/seminars/2003/newdelhi/lardy.pdf)   \n   \nBy the way isn't India a democracy?   \n   \nChina is growing quicker than the Americans or the Japanese, or the Europeans. My Chinese friend reports they are still communist. What's up with that?\n\n"
    },
    {
      "time": "",
      "content": "\\> they fell of their own internal stagnation   \n   \nNo, they fell to Western greed. They were corrupt to begin with, and they realized there was more cash to be milked in Capitalism. But now the Russian oligarchs are being taught a good lesson. It makes me very happy to see them going to jail, and apparently the Russian people feel the same way. It would be so nice to see Cheney in an orange jumpsuit.   \n   \nWealth is not being spread unevenly. More misery is being created by increased affluence in the West. Globalization is simply a means the make the rich richer, and the earth (which is much more than the humans who live on it) poorer. Material wealth doesn't fall from the sky.   \n   \n--   \n   \nSteve, I've decided to address your challenge after all. Some time today.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "OK Steve, here it goes.   \n   \n--   \n   \nFirst things first: Society = Injustice. Anarchy is the only Fair system - let Nature decide. But humans are social animals (in fact it seems that animals are social animals too). So you could say we _have_ to have something.   \n   \nWe can debate the relative merits of various systems (for example that Communism sucks but it's still much better than Capitalism), but let's start by first getting rid of the illusion that Democracy is good.   \n   \nThere are two key things that need to be admitted:   \n1) The current system is not working. It is causing increasing misery, and it's not sustainable anyway.   \n2) Most people are not trained to decide matters of state. They're not even trained to choose somebody who can handle matters of state. People are trained to cook, clean, program, etc. And this is necessary for society to function and thrive efficiently. There is very much such a thing as freedom \\*from\\* choice. People just want things they can't handle to work in the background, so they can get along with their lives.   \n   \nI thereby state that democracy is not working, and can never really work. So why does it exist, and spread? Because it's much easier to control people when you give them the illusion of power (as well as things like free speech). Give them bread and the circus (as well as at least two parties to choose from, controlled media to tell them everything is going fine, forced public education to start the brainwashing as early as possible and free the moms to slave away), and there you have it.   \n   \nWhat needs to happen?   \nFirst, people need to realize: the system isn't working; and they're not qualified to fix it. Then, they have to stop voting. There's no other way to stop the juggernaut. Eventually (whether elections are cancelled, or a president is chosen by 200 people and then riots break out) there will be a state of emergency. Then people will start thinking: how do we get a least-unfair system, that's efficient, and not corrupt? There really is only one answer: one person with authority, intelligence and a good heart. No single person can be perfect, but more than one cook causes grief.   \n   \nThere will be a group of people called the Presentation Committee, with members culled from the current political elite, as well as people who come out of the grassroots movement. Yes, many of them will be corrupt. But they will start nominating monarchs (they're not exluded), and presenting the pros and cons of the nominee, and spending money on campaigns will be disallowed. Media will provide free airtime to any nominee, funded by taxpayer money (you might have to stop imperialism for a while to pay for this). This will last four years. During those four years either the former president or the one who got elected with 200 votes will serve. At the end of those four years, the constitution will be abolished. The people will vote for a monarch. There will be one rule only: the monarch cannot designate a blood relation as a successor. The monarch is of course free to implement a parliament, get advisors, or anything he/she wants.   \n   \nGetting rid of a bad monarch: you do it the old-fashioned way. Physically depose him. I maintain that this is will cause less bloodshed than is being spilled now in the name of democracy. It will be swift and overt, unlike the illusionary, Gameboy killing of entire peoples and cultures that's going on now.   \n   \nTerrorism will die down, because there is no vote to influence. I told you guys democracy encourages terrorism, you didn't believe me, now look what happened.   \n   \n--   \n   \nThis is a rough framework. There are certainly tweaks to it that would avoid both the idiocy of democracy and the danger of despotism. But most of all, letting the people choose a monarch after long, relatively impartial debate is the best hope. A cabal of capitalists isn't working, and never could.   \n   \n--   \n   \nIf this is not enough to convince you, then let me ask you a question in turn:   \n   \nWhen you have a system that can't be changed (because it owns the airwaves hence the minds of the voters), with a different puppet changing every 4/8 years, and it's a system destroying the world, how the hell do you get rid of it?   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>Steve, for a nearly a century all who professed to be devoted followers of Marx defended the Communist states or the nationalized industries of democratic states as leading the world to a better day in conformity to Marx's analysis and ideas.   \n   \nSo, that would be all except G.A. Cohen, John Roemer, E.O. Wright, Michael Levin, Terrell Carver, John Hofffman, Mark Cowling, Jules Townsend...shall I go on naming Marxist academics who don't fit into the stereotype you have constructed to keep you safe from the real world?   \n   \nOh yes, and you forgot Trotsky! I have a sneaky feeling he didn't think the 'communist states' were very communist either. (And for the avoidance of doubt, and before you go down that route, I'm not a Trotskyite either).   \n  \nI would add myself to that list, but I'm not a devoted follower of Marx.   \n   \n   \n   \n\\>\\>Now you airily wave away all those millions as not worth even addressing.   \n   \nHang on a minute. You airily wave them away as being wrong about the validity of communism, but I can't airily wave them away as being wrong about the point of Marxism. That doesn't seem fair.   \n   \nAnyway, I like airily waving away the professed beliefs of millions, if those millions are wrong.   \nI've got some great ones up my sleeve, but I'm reluctant to open any more cans of worms just now.   \n   \n   \n\\>\\>At the same time you don't either address the contradictions of Marx with reality, which I have pointed out, nor your mistaken interpretations of Marx and Engels, which are flatly contradicted by my quotations from them.   \n   \nI've addressed your arguments and quotations, I won't do it again here. If you want to see further details of my 'mistaken' interpretations of Marx, I suggest you look [here](http://web.archive.org/web/20110509084708/http:/www.netforge.co.uk/HM/)   \n   \n\\>\\>Nor do you acknowledge that Marx had little to say about how a socialist state might work.   \n   \nWell I haven't explicitly acknowledged that, because I've been too busy with the rest of what you've said, but yes, you're right on that one. However, he did have much to say on what the ABSOLUTELY NECESSARY PRACTICAL PRECONDITIONS for socialism were. And they were not met in Russia in 1917. (If you follow the above link, you'll find that that's covered there too).   \n   \n   \n\\>\\>The only experience we have of socialism is of the communist and socialist countries of the twentieth century.   \n   \nWe don't have any experience of socialism, in the sense in which it would be relevant to this discussion.   \n(That is, as a socialist economic form existing outside of and after capitalism. Socialist measures inside a capitalist economy are not the issue).   \n   \n   \n\\>\\>Anyone actually interested in improving society will try to learn by the failures in these societies, as well as by the failures of capitalist societies. To wave the socialist failures aside as irrelevant and to simply re-assert Marx is to take Marx on faith, as a dogmatic religion. This had some excuse in those states where Marxism was the state religion and you could be imprisoned or shot for criticising Marxism. Today such a devotional attitude to Marx is just ridiculous.   \n   \nWhen did I say they were irrelevant? The failures of the so-called communist states is not irrelevant to an understanding of how to improve society. I never said it was. Its a central part of my doctoral thesis. I certainly wouldn't have spent several years working on something I thought was irrelevant.   \nBut their collapse adds weight to Marx's point of view - if anything it supports his theory of history. If you read Marx, not just the bits that Popper quotes, you might understand that.   \n   \nThen again, you might not.\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>OK Steve, so the Soviet Union doesn't count. How about the late great German \"Democratic Republic?\" Why did they all choose to abandon Communism? Or if it wasn't communism, what was it?   \n   \nWell, its difficult to categorise, or give a quick description of somewhere like East Germany. It was pretty much a product of its time, so influenced by external factors that you couldn't really generalise about it as a model of any kind of political ideal. I think we can safely say it was unpleasant and inneficient, and also that it certainly has no bearing on marxist theory.   \n   \n   \n\\>\\>I think these mid-1800s theories had more relevance in the economic conditions of the time. Industrial labor has since given way to more and more technology, and more and more people in both the First and Third World are engaged in less physical labor and more symbolic analysis. Would you disagree?   \n   \nWell, that's probably true.   \nI certainly recognise that Marx was a man of his time, and that the world has changed since then.   \nIt doesn't mean that his analytical framework is no longer of value though.   \n(I don't notice anyone rushing to throw Darwin out with the bathwater).\n\n"
    },
    {
      "time": "",
      "content": "\\> the world has changed since then.   \n   \nOne thing to consider (although it's difficult to gauge the real full effects) is the degree to which people know what's going on in the rest of the world, so quickly, in so much detail: this is hugely significant. I think it causes a lot of trouble (like people who see America on TV and don't realize what it really is) as well as the tolerance it teaches (by showing that people everywhere are really the same).   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_It doesn't mean that his analytical framework is no longer of value though. (I don't notice anyone rushing to throw Darwin out with the bathwater)._   \n   \nHeh, funny, living in Georgia I see lots of such people, including a state school superintendent who wants to replace all instances of \"evolution\" in the curriculum with \"biological changes over time.\"   \n   \nBut for Marx I would think a more fitting comparison would be, and I'm being generous here, Isaac Newton. Newton's model works inside some increasingly tightly defined constraints. The computer you're reading this on, for example, relies on some very un-Newtonian phenomena.   \n   \nAnd Hrant, I'm glad to hear your distaste for public education. When I have kids they'll either be home-schooled or go to a private school, and before that happens I intend to move to a state or nation with education vouchers.\n\n"
    },
    {
      "time": "",
      "content": "Hrant,   \nI started writing an answer, and it ended up really long. I think this thread has probably had enough of my long winded ramblings, so I cut it down to this:   \n(I saved the long version so I can send it to you if you like)   \n   \nWell, OK, people aren't trained in politics, and sometimes just wish it would work without them having to think about it, BUT   \n- Some people really do think about politics, and really do value their vote.   \nThe vote isn't something to be sniffed at either. I know that we only get to choose the personnel, that we aren't voting on which political system we're   \n   \ngoing to have, just who is going to run it, but, in the absence of anything better being just around the corner, its still worth being able to choose the personnel.   \n   \nEven though we can't change the system, we can't vote capitalism out, we can still make a difference that isn't trivial.   \n   \n   \n   \n   \n\\>\\>I thereby state that democracy is not working, and can never really work.   \n   \nThere are so many ways in which democracy doesn't work.   \nBut I think its another thing to say it couldn't work.   \n   \n   \n   \nAlso, what you're suggesting is a vote for a president, who gets absolute power.   \nWhy not just tell Bush he keep the job until he finds someone equally vile?   \nAnd if people aren't qualified to elect a leader for 4 years, how come they're qualified to elect the start of a (non-hereditary) dynasty?   \nAnd if people are oppressed by their lack of freedom from choice, what is the pressure of this decision going to do to them? They have to make decisions which could have an irreversible impact on the lives of future generations. (OK, that's always true, but not so starkly as under your system).   \n   \n   \n\\>\\>Getting rid of a bad monarch: you do it the old-fashioned way. Physically depose him.   \n   \nBut if you give someone absolute power, but under threat of physical overthrow, you're asking for tyrannical paranoid leaders.   \n   \n   \n\\>\\>When you have a system that can't be changed (because it owns the airwaves hence the minds of the voters), with a different puppet changing every 4/8 years, and it's a system destroying the world, how the hell do you get rid of it?   \n   \nIf I knew that, do you think I'd be wasting my time here?\n\n"
    },
    {
      "time": "",
      "content": "\\> its still worth being able to choose the personnel.   \n   \nNot when doing so perpetuates an increasingly vile system. Not voting makes me less responsible for the rape and pillaging. Not voting is the least I can do in this fight.   \n   \n\\> Why not just tell Bush he keep the job until he finds someone equally vile?   \n   \nBecause given an open field he would be way down the list of who people would vote for. Providing only two de facto candidates (one Republican and one Democrat) gives the ultimate balance of control and subversion. And the fact that last time the vote was so close is an indication that the individuals running had no real bearing on what people were actually voting for.   \n   \n\\> how come they're qualified to elect the start of a (non-hereditary) dynasty?   \n   \n1) That's a practical issue. How else are you going to do it?   \n2) Given four years of minimally biased analysis, I think people could very much find somebody sufficiently capable. People aren't dumb, they know what they like - they act dumb when manipulated. Bush is an honest person, and people are attracted to that. But he's also unintelligent, bigoted and too religious (not the same thing as being spiritual). You need a well-rounded person, an exceptional person in many ways. They exist.   \n   \n\\> you're asking for tyrannical paranoid leaders.   \n   \nNo, I'm asking for a person who serves his people\\*, and would step down if needed. Like Shevardnadze.   \n   \n\\* Being a good monarch is an extremely difficult, thankless job. Being the president of the US is fairly easy, you just have to please the plutocracy.   \n   \n\\> what is the pressure of this decision going to do to them?   \n   \nMake them take their country seriously?   \n   \n\\> If I knew that, do you think I'd be wasting my time here?   \n   \nBeing impotent towards affecting monumental change doesn't prevent one from thinking about it.   \n   \nWhat is your answer to this mess?   \n   \n--   \n   \nWe have to stop voting.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_I think we can safely say it was unpleasant and inneficient,_[sic]   \n   \nYes.   \n   \n _and also that it certainly has no bearing on marxist theory._   \n   \nSo from this I must conclude that the attempted application of Marxist theory will inevitably result in something that certainly has no bearing on Marxist theory.   \n   \nWhat a useful theory!\n\n"
    },
    {
      "time": "",
      "content": "[http://www.theonion.com/news/index.php?i=1&n=1](http://web.archive.org/web/20110509084708/http:/www.theonion.com/news/index.php?i=1&n=1)   \n   \nhhp\n\n"
    }
  ]
}
