{
  "id": "35887",
  "title": "(x) Grafik Magazine geometric sans - ITC Avant Garde Gothic {Jamesy Love}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Can anyone tell me what font this is?\n\n ![](http://web.archive.org/web/20141031101347im_/http:/typophile.com/files/grafik150_01_3478.jpg)\n\n",
  "author": "deviant_artiste",
  "time": "7 Aug 2007 — 8:35am",
  "uid": "20310",
  "comments": [
    {
      "time": "7 Aug 2007 — 8:41am",
      "content": "Its ITC Avant Garde supplied by yellowblack.com\n\n"
    },
    {
      "time": "7 Aug 2007 — 10:18am",
      "content": "can we just start saying, \"it's avant garde. AGAIN.\" because, i mean, god.\n\n"
    },
    {
      "time": "7 Aug 2007 — 2:35pm",
      "content": "Try to read the magazine -- I dare you. _All text_ in Grafik is set in ITC Avant Garde Gothic. I wanted to read my own article (\"Anatomy of a typeface: Odile\" of almost a year ago) and couldn't. I tried, I swear, but honest to God, it's unbearable.\n\n"
    },
    {
      "time": "7 Aug 2007 — 2:39pm",
      "content": "… but I do like the URL: yellowblack.com. It's so … ahm … redirecting in a refreshing style. ;^D\n\n"
    },
    {
      "time": "8 Aug 2007 — 12:54am",
      "content": "Thanks Rez Oo - I guess some of us are more helpful than others, after all this is a Type ID forum!\n\n"
    },
    {
      "time": "8 Aug 2007 — 1:27am",
      "content": "\\> _I guess some of us are more helpful than others, after all this is a Type ID forum!_\n\nDo I discern a tinge of rebuke in that observation? Please elaborate. (You can tell I've been watching a lot of [Deadwood](http://web.archive.org/web/20141031101347/http:/www.hbo.com/deadwood/) lately ;^) :^P\n\n"
    },
    {
      "time": "8 Aug 2007 — 5:14am",
      "content": "some of us are perfectly helpful; we're just tired of avant garde and the kneejerk irony applied to it these days.\n\n"
    },
    {
      "time": "4 Nov 2007 — 5:19pm",
      "content": "I agree it's not easy to read, but it doesn't help the letter-spacing and leading are unnecessarily tight.\n\nJust thought I would also mention it's different from the Adobe Std, the captial R changes between book and bold, not so in the Adobe Std release.\n\n"
    }
  ]
}
