{
  "id": "35884",
  "title": "Logo Competition",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Not sure if anyone is interested, but I just heard that Ford is having a logo competition for a new program they’re going to start. I don’t know much abowt it but all I know is you can win an Adobe CS3 Suite. That’s it. I think the website is [www.fordscholars.com.....or](http://web.archive.org/web/20081210105050/http:/www.fordscholars.com.....or \"www.fordscholars.com.....or\") it could be www.fordscholars.org...I’m drawing a blank right now...sorry...\n\nThat’s it...\n\n [‹ epixs logotype](http://web.archive.org/web/20081210105050/http:/typophile.com/node/48297 \"Go to previous forum topic\") [Radio Station Logo Critique ›](http://web.archive.org/web/20081210105050/http:/typophile.com/node/48350 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081210105050/http://typophile.com/user/20465\" title=\"View user profile.\">johnfitz</a>",
  "time": "<br>",
  "uid": "20465",
  "comments": [
    {
      "time": " 7.Aug.2007 8.03am",
      "content": "I’m not sure if it’s open to non US residents, so you may want to check before you do any work...if you’re a non-US resident.\n\n"
    },
    {
      "time": " 7.Aug.2007 8.35am",
      "content": "You would think a big company like Ford could pay more for a logo!\n\nSharon\n\n"
    },
    {
      "time": " 7.Aug.2007 8.46am",
      "content": "Funny. The rules \\*say\\* fordscholars.com, but the text links to [http://www.fordscholars.org/](http://web.archive.org/web/20081210105050/http:/www.fordscholars.org/).\n\n“This United States based logo competition is open to all legal residents of the fifty (50) United States (including District of Columbia). Competition is open to amateur and professional designers. Ford Motor Company Fund and Ford Motor Company Fund employees or retirees, or immediate family members of a Ford Motor Company Fund or Ford Motor Company Fund employee or retiree are not eligible to participate. Participation can only take place in a private personal capacity.”\n\nI always have mixed feelings about corporate logo/design contests. They’re usually just a way to get good work with no budget. On the flip side, some contests–this one included–open up a fairly high profile project to students and young designers.\n\nI agree with Sharon that FMC ought to be able to come up with more dough. However, this is probably a project within the company that wasn’t budgeted much by the higher ups.\n\n"
    },
    {
      "time": " 7.Aug.2007 10.15am",
      "content": "Shame on Ford for exploiting graphic designers. Would they hold a contest for engineers to design a new suspension system? Would they hold a contest for lawyers to come up with new wording for their warranty? For-profit companies should hire professionals and pay market rates for whatever they need.\n\n"
    },
    {
      "time": " 7.Aug.2007 11.43am",
      "content": "They have an age limit as well...lame. But a good opportunity for a student or pro looking to land a high profile company.\n\n[www.holadesignstudio.com](http://web.archive.org/web/20081210105050/http:/www.holadesignstudio.com/ \"www.holadesignstudio.com\")\n\n"
    },
    {
      "time": " 7.Aug.2007 11.57am",
      "content": "“You would think a big company like Ford could pay more for a logo!”\n\nI’m pretty sure Ford is having a tough time paying its employees these days...\n\nFord really should just fess up and call it ’plea for a logo donation...’\n\n"
    },
    {
      "time": " 10.Aug.2007 9.44pm",
      "content": "So the contest is for a logo for “Ford Blue Oval Scholars”?\n\nI could understand if it was a design competition to redesign the Ford logo. A company as big as Ford would want new ideas from outside an agency. Agencies can be such a pain to deal with sometimes.\n\nBut, this seems like an insignificant logo and Ford is just looking for design on the cheap. Shame on you Ford. We have to make a living too. They should have just posted the logo design on elance.com for a russian or indian to make one for $5 (kidding)\n\nHEY FORD! Visit here:  \n [http://www.no-spec.com/](http://web.archive.org/web/20081210105050/http:/www.no-spec.com/ \"http://www.no-spec.com/\")\n\n"
    },
    {
      "time": " 17.Aug.2007 7.32am",
      "content": "yeah, i understand the “over 18” age requirement, but what’s up with the “under 29”? that just seems weird...\n\n"
    },
    {
      "time": " 17.Aug.2007 7.37am",
      "content": "on the broader subject, this is not a major corporate logo; it’s for a small side project. i don’t think it’s particularly bad for ford to open the logo up to designers (especially those in their specific desired demographic)... it gives the promotion a lot more exposure (would we even be talking about here otherwise, or would we have to just react to the studio-designed logo after it was unveiled?) AND could potentially give some great-idea but under exposed designer good ink.\n\n"
    },
    {
      "time": " 16.Aug.2008 2.54pm",
      "content": "The winning logo. Hehe, no wonder ford is in trouble. Not sour grapes or anything but my submission was way better than this one. I’m sure many more were too.\n\n[http://i38.tinypic.com/atwzro.png](http://web.archive.org/web/20081210105050/http:/i38.tinypic.com/atwzro.png \"http://i38.tinypic.com/atwzro.png\")\n\n"
    },
    {
      "time": " 18.Aug.2008 7.57am",
      "content": "Matt9302323...that’s how all logo contests work. The best work never wins. If you must enter design contests, be sure to submit only half-assed work, as that’s the only ones that ever win. ;o)\n\n"
    }
  ]
}
