{
  "id": "35907",
  "title": "A little help pleeeese",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone,\n\nthis is my first time posting a thread but I have been keeping an eye on this site for a while now and I love it!!\n\nI am just looking for some advice really. I am about to go into 4th year of my Visual Communications degree and have been driving myself mad trying to think of a thesis topic that will both hold my attention (as I’m not a natural writer) and will be interesting for the reader.\n\nI found this quote which I liked and found interesting and thought that I could use it as a starting point for my thesis\n\n“It is no exaggeration to say that designers are engaged in nothing less than the manufacture of contemporary reality”\n\nI’m thinking of exploring the boundaries between promoting and selling, i.e. advertising and graphic design, I would also like to look at the promotion of lifestyle through the selling of a particular product or service and the branding of the product as a whole (do we buy Coke because it tastes better or because we are conditioned to do so?)\n\nI suppose I’m just looking for a few starting points to get my ideas together and a little feed back on the idea, is the subject to big? should I think about exploring just one company and its use of branding? (Mac could be interesting?)\n\nAny ideas or suggestions will be greatly appreciated! And thank you in advance for your help!\n\n [‹ don't know much about italics](http://web.archive.org/web/20080706083554/http:/www.typophile.com/node/35423 \"Go to previous forum topic\") [David Berlow receives SOTA Typography Award for 2007 ›](http://web.archive.org/web/20080706083554/http:/www.typophile.com/node/35725 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706083554/http://www.typophile.com/user/20476\" title=\"View user profile.\">emma54</a>",
  "time": "<br>",
  "uid": "20476",
  "comments": [
    {
      "time": " 7.Aug.2007 6.29pm",
      "content": "Your proposed topic won’t be hard, dozens to students bring it up every year. This is a topic that has been explored ad infinitum; _Adbusters_ magazine has managed to hack away on the topic for years, twice in the last fifty years liberal designers have put out a short manifesto on the subject, and just about every left-wing publication brings up the subject on a pretty regular basis. So if you want your thesis to tread new ground, come up with something else. But if you want to retread this unending, pompous, callow critique of marketing you’ll have no trouble dredging up piles of fodder in _Adbusters_, _Mother Jones_, _Utne Reader_, _Metropolitan_, and so on.\n\n"
    },
    {
      "time": " 7.Aug.2007 8.10pm",
      "content": "In the paper today I saw the reporting of a study where researchers tested and found that packaging alone can control tastes. It had kids eat foods packaged with the McDonalds logo, and they found a significant preference for the taste of food so packaged. This was not based on taste ... even when carrots (not sold at McDonalds) were so packaged, the kids preferred the taste to carrots packaged other ways.\n\nThis is significant scientific proof that taste is effected by advertising/promotion, at least with kids. (I haven’t read the study, only the report, which as you know generally falls short of complete reporting of the results.)\n\nIt is something I would look into, if that was to be your topic.\n\n"
    },
    {
      "time": " 7.Aug.2007 8.21pm",
      "content": "Don, I didn’t read that study, but I would bet the preference had more to do with social positioning and a sense that the packaged carrot conveyed more status. I bet the kids just said it tasted better.\n\nEmma, someone posts almost weekly looking for help with a thesis. I wouldn’t take any hostility personally.\n\nTry and read all you can find that has been published on the subject and then decide it you can actually add anything. People pull a full bucket out of a dry well all the time.\n\n"
    },
    {
      "time": " 7.Aug.2007 10.00pm",
      "content": "Hey, Emma, here are a couple of books that might give you food for thought on this topic.\n\nOne is [**_Chasing the Perfect_**](http://web.archive.org/web/20080706083554/http:/www.amazon.com/Chasing-Perfect-Thoughts-Modernist-Design/dp/1933045213/ref=pd_bbs_sr_1/104-4503287-1653503?ie=UTF8&s=books&qid=1186548013&sr=1-1), by Natalia Ilyin. (Also, you will find a discussion of said book on Speak Up: parts [**1**](http://web.archive.org/web/20080706083554/http:/www.underconsideration.com/speakup/archives/002757.html) and [**2**](http://web.archive.org/web/20080706083554/http:/www.underconsideration.com/speakup/archives/002767.html). And an [**author interview**](http://web.archive.org/web/20080706083554/http:/www.underconsideration.com/speakup/archives/002281.html) as well.)\n\nThe other book is a bit older, but gets reprinted now and then: [**_Decoding Advertisements_**](http://web.archive.org/web/20080706083554/http:/www.amazon.com/Decoding-Advertisements-Progress-Judith-Williamson/dp/0714526150), by Judith Williamson (which, I must confess, I have not read yet.) (A somewhat differing view is offered [**here**](http://web.archive.org/web/20080706083554/http:/www.mindhacks.com/blog/2006/02/decoding_advertiseme.html).)\n\n"
    },
    {
      "time": " 7.Aug.2007 10.53pm",
      "content": "I understand it could be frustrating for you guys answering the same questions over and over! So I won’t take it personal!  \nI don’t start my final year till the end of September so I have given myself a little time to explore a few subject without any pressure from lectures looking for a proposal - and looks like its back to the drawing board for now!\n\nI really want to find a subject that will engage the reader but as I said before I’m not a natural writer so I’m a little worried about how this will affect my over all grade! The only thing is I love design so I’m looking forward to the research end of it!\n\nAgain thank you all for your helpful comments\n\n"
    },
    {
      "time": " 8.Aug.2007 4.46am",
      "content": "Emma,\n\nOne of my favorite advertising topics was UPTOWN cigarettes in the late 1980s/early 1990s. The cigarette was advertised and marketed to inner cities - using New York’s Harlem and Philadelphia’s South side (end?). It was a fancy box - black, highly glossed, with gold lettering on a angle.\n\nThe black community stood up and asked the manufacturer to remove it.\n\nWhat made me really think about this — was their advertiser admitted publicly (probably the very first time) that they had always marketed their cigarettes towards low income blacks and females. (Needless to say, I gave up cigarettes less than a year later.)\n\nBut I always found it an interesting topic and one I always hoped someone would develop further, as the newspapers didn’t really seem to care what the agency was telling us with the power the wield.\n\nI don’t know if that helps - but I thought it might fall into line with some of the comments here.\n\n"
    }
  ]
}
