{
  "id": "35920",
  "title": "What rights does Dan Solo hold?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Over the years I've spent many hours reviewing the contents of [Dan Solo](http://web.archive.org/web/20150123050241/http:/typophile.com/wiki/Dan%20X.%20Solo)'s font catalog, as well as some of the alphabet books he published through Dover. As I've surfed the net to find out more about his fabulous collection of typefaces, it seems that people sometimes refer to the typefaces as \"his\". This has spawned some questions in my mind about what rights, if any, has he acquired along with his collection of 4000+ typefaces.\n\nThe Dover books contain several typefaces I'd like to use. Some of them are available as fonts, but some are not. Perhaps I just don't know how to find them. Anyway, according to the back covers of the alphabet books, the alphabets are copyright-free. What is the accepted practice when it comes to digitizing the alphabets in those books, using them as fonts, and perhaps selling them?\n\n",
  "author": "russ_mcmullin",
  "time": "7 Aug 2007 — 11:02pm",
  "uid": "18019",
  "comments": [
    {
      "time": "7 Aug 2007 — 11:36pm",
      "content": "I know Dan X. Solo personally. He ran a typographic studio in Berkeley for over 30 years. He had a large collection of film fonts, including some of my own. He created thousands of fonts and is now retired and is an avocational prestigitator. Copyrights have run out on most of his fonts. He also protected himself by creating pseudonyms on the questionable font names.\n\n"
    },
    {
      "time": "8 Aug 2007 — 7:05am",
      "content": "Thanks for the response Robert. Your post tends to illustrate my observation: that there is no clear distinction between the fonts he originated, and those he acquired. When he acquired new material, did he rename them to make them \"his\"?\n\n"
    },
    {
      "time": "10 Aug 2007 — 7:09am",
      "content": "Dan Solo (photo)Shopped First!\n\nMeh...I got nuthin...\n\n"
    },
    {
      "time": "13 Aug 2007 — 1:51pm",
      "content": "Hi Russ,\n\nIt was by the request of a client that led me to contact Dan Solo as to the origins of a particular font he featured in one of his Dover books called Kingston Script which he revealed to me it was in fact an original design of the Filmotype company.\n\nAfter learning of this, I spent many years researching the company, its legal status, and any living heirs to the collection to determing if there was a proper manner to acquire rights and redigitize this library of amazing fonts. I was successful in my endeavor and have been busy working on a digital revival of the library.\n\nMost of the 'gems' of his collection IMHO are in fact Filmotype fonts and I intend to get a larger showing of them available to share with the group for ID purposes.\n\nBest,  \nStuart :D\n\n"
    },
    {
      "time": "31 Aug 2007 — 8:12pm",
      "content": "the rest of Dan solo's collection consists of sources such as Castcraft, Facsimile Fonts and Visual Graphic fonts. He also had as his source the 2 versions of Hoffman's Schrift Atlas for reviving art nouveau types.\n\n"
    },
    {
      "time": "5 May 2008 — 1:19pm",
      "content": "I've been searching for this topic... I have questions about Dan Solo's copyrights as well. I guess I am a tad late to the game.\n\nI found a font in one of his books that I want to use, but there isn't a digital equivalent available. Knowing that he \"found\" the fonts from various sources throughout the world\\*, I wonder about the copyright issues with the typefaces in his books - can I recreate a font from these books? Most of the fonts have no know provenance nor does Dan Solo give any credit to any of the fonts. I know some of the fonts are in fact reproductions of other differently named fonts but there are a few that I cannot find information on anywhere.\n\nWhat are the legal issues involved with recreating/reviving fonts in the Dan Solo Dover books? I plan on digitizing a font and tweaking/adding other missing characters once I can figure out the copyright issues.\n\nThanks!  \nDalton\n\n\\*not discounting his hard work at creating a library of fonts, but his books seem to come across as a inspiration for making fonts and the whole copyright issue seem hazy if he didn't create these fonts.\n\n"
    }
  ]
}
