{
  "id": "35938",
  "title": "Found something interesting in a museum in NL",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Today is was at a museum in Terschuur: [http://www.ambachtenmuseum.nl/](http://web.archive.org/web/20150414003343/http:/www.ambachtenmuseum.nl/ \"http://www.ambachtenmuseum.nl/\")  \nThe owner collects a huge variety of old tools, etc and puts everything in the museum. It is pretty messy, but one is allowed to touch things (gently) and that makes a visit worthwhile.  \nI found something in \"the printing corner\" which seemed pretty interesting for anyone here, but I'm not sure what it is and where it came from, but it says 'Lettergieterij Enschedé'. Some kind of frontpage for a typespecimen? Any other ideas?\n\nEdit: I reduced size of the pictures and added another:\n\n ![](http://web.archive.org/web/20150414003343im_/http:/typophile.com/files/TEFF_01_4102.jpg)\n  \n\n ![](http://web.archive.org/web/20150414003343im_/http:/typophile.com/files/TEFF_02_6369.jpg)\n\n",
  "author": "typovar",
  "time": "8 Aug 2007 — 11:21am",
  "uid": "14112",
  "comments": [
    {
      "time": "8 Aug 2007 — 4:31pm",
      "content": "It appears to be a stereotype mat, probably for a printing firm since it seems to be a listing of type specimens.\n\nEdit: I just realized it is only a listing of faces but not in the type itself. Anyone who speaks Dutch might be able to figure out what kind of firm used it.\n\n"
    },
    {
      "time": "9 Aug 2007 — 12:44am",
      "content": "The Enschedé Font Foundry. More like the back cover of something maybe: you wouldn't put your phone number in the middle of a front cover, would you? Still, funny idea, printing the names of all those faces in Spectrum. (The bottom line means \"Set in Jan van Krimpen's Spectrum\".) Reminds me of the thread with the poster for the Helvetica film set in Trajan:)\n\n"
    },
    {
      "time": "9 Aug 2007 — 6:37am",
      "content": "I agree that the item on the left is a matt, and the casting made from it is on the right (unused, or cleaned exceptionally well).\n\nPerhaps this was a printshop advertising it's catalog of available faces. The limited number (to our eyes) is probably about right when one had to buy lead type, or lino matricies.\n\n"
    },
    {
      "time": "9 Aug 2007 — 12:33pm",
      "content": "In fact there are two parts: positive and negative.  \nOn the left is a made of plastic and there were other examples, but in worse state.  \nOn the right is made of lead. The was another piece there, but it was broken.\n\nTEFF is one of Hollands \"top\" font foundries. Their quality has always been high and still is. The museum is more like a secondhand-shop... Strange...\n\nDoes anyone know the book? Could it have to do with 'embossing'?\n\nI only found some names via Google, no images (bookcovers):  \n_Spectrum Romulus Lutetia Romanee Open Kapitalen. Lettergieterij Joh. Enschede en Zonen. Haarlem, Holland. z.j. or.omsl. Rijk geillustreerd._\n\n"
    },
    {
      "time": "9 Aug 2007 — 2:25pm",
      "content": "Here is another edition, from the 70s. So it seems this one should also be from a font specimen. BTW, I believe the historical Enschedé Foundry is now defunct. The name was resurrected by the new, up-upmarket, digital foundry (and the quality, but with new fonts).\n\n ![](http://web.archive.org/web/20150414003343im_/http:/typophile.com/files/new5_4552.jpg)\n\n"
    },
    {
      "time": "22 Aug 2007 — 6:15am",
      "content": "Today I got a response from Museum Enschedé in Dutch though:\n\n_Geachte heer,  \nHet linker deel is een zogenoemde \"afpersing\" van los zetsel in een speciaal soort hard papier, een soort \"Prespan\" en dient om daaruit een cliché te gieten. Het cliché, rechts, wordt dan gebruikt voor de druk, in dit geval vermoedelijk voor een advertentie.  \nHopend u hiermee iets verder geholpen te hebben,  \nMet vriendelijke groet,_\n\n[removed name]  \nConservator Museum Enschedé\n\n"
    }
  ]
}
