{
  "id": "35947",
  "title": "Label copy with rivers",
  "forum": "Design",
  "tags": [

  ],
  "content": "I thought I would just throw this basic question out to see what kind of feedback I get. I’m currently working on a vitamin label and the client requests that the small product description copy be justified. When the column is justified there are a lot of rivers and funny spacing issues. What I typically will do with a line or lines with large gaps is just highlight that specific line in play with the tracking. I’ve always wondered if this is the correct thing to do. What would you suggest? I need to be enlightened.\n\nThanks.\n\n [‹ (x) F.U.N.4 Dogs website navigation - Ondine {Lex}](http://web.archive.org/web/20080314221434/http:/www.typophile.com/node/35856 \"Go to previous forum topic\") [Heavy Metal Typography ›](http://web.archive.org/web/20080314221434/http:/www.typophile.com/node/1332 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080314221434/http://www.typophile.com/user/14203\" title=\"View user profile.\">baskervillebold</a>",
  "time": "<br>",
  "uid": "14203",
  "comments": [
    {
      "time": " 8.Aug.2007 2.28pm",
      "content": "Are you allowed to use word breaks? If so, that could help you to eliminate some of those rivers.\n\n"
    },
    {
      "time": " 8.Aug.2007 4.22pm",
      "content": "Hyphenate carefully, if you can, but for small print like a description, and this sounds like a very narrow column, I’d be leery of doing so.\n\nAnd tracking small print can get very ugly as well.\n\nIf I were you, I’d do up two — one justified, and one ragged, and let the client decide which one looks “better”: my guess is that they’d pick the ragged one....\n\n"
    },
    {
      "time": " 8.Aug.2007 4.31pm",
      "content": "Can you change the pt size or use something more condensed?\n\n"
    },
    {
      "time": " 8.Aug.2007 9.09pm",
      "content": "Thanks for the comments. I decided to do what Linda said about showing the client the two versions. I think I can persuade them into the ragged version. It’s much more comfortable to read.\n\nBut I still don’t want to give up on learning to create nice fully justified columns. I’ve never really learned how to fine tune them. That’s always bugged me. Could it have something to do with the justification settings (word spacing, letter spacing)?\n\n"
    },
    {
      "time": " 9.Aug.2007 6.53am",
      "content": "\\> But I still don’t want to give up on learning to create nice fully justified columns\n\nHyphenation is the first trick. Then rewriting the copy to avoid rivers. Normally this is an editors’ perogative but some will allow you to make a suggestion. Just make sure they explicitly approve it.\n\n(And thinking about it ... for drug information copy, I probably wouldn’t dare making text changes. More likely than not, it was written by lawyers.)\n\n"
    },
    {
      "time": " 9.Aug.2007 8.00am",
      "content": "_It’s much more comfortable to read._\n\nEspecially at small sizes (both font and column width), it makes a huge difference, doesn’t it?\n\n_But I still don’t want to give up on learning to create nice fully justified columns._\n\nDepending on the text, hyphenation is usually the first resort, particularly if you’re able to keep it to a minimum, but there’s a really fine line to draw between too many hyphens (particularly in a row) and the academic level of the text you’re working on. You don’t want to end up hyphenating long words all the time, because that’s hard on your reader, and if it’s a more accessible text, hyphenating short words is distracting as well.\n\nThat being said, and depending on the font/size/column you’re using, you don’t want to mess around extensively with word and letter spacing that much either. I am reminded of the comment quoted in _The Joy of Cooking_ that is attributed to Lao Tsu: _Ruling a large kingdom is like cooking a small fish. Both need to be treated gently and not overdone.”_ ;-)\n\n"
    },
    {
      "time": " 9.Aug.2007 5.49pm",
      "content": "Text with a lot of long words can be a problem to justify in any setting, but generally if you have lines more than about two alphabets (i.e. 56 characters) wide, they will justify nicely in InDesign with paragraph composer turned on, hyphenation set to maximum two in a row (three in a pinch), minimum three letters before and after hyphen, hyphenate capitalized words, and word spacing set to 85% min., 100% normal, and 130% max. (no letter spacing allowed). You still have to do some manual tweaking, but this gives decent results. As your column of text narrows, you have to allow more leeway on the parameters and accept that it won’t be quite as attractive. Below about one and a half alphabets (42 characters per line), I set it ragged right unless it’s very short and I have carte blanche to rewrite the text.\n\n"
    }
  ]
}
