{
  "id": "35962",
  "title": "Hand lettered logos",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am kinda having a hard time trying to post this so I hope this works. This post is for anyone who loves hand lettering as much as I do. These are some recent and not so recent projects that I have done. The \"Glad I did logo\" was for a lady who is writing a book about caring for an elderly lady with special needs. The script is in my own style. Eliza Schulte thought the D looked like an O. I can see where it does. Moes wanted his logo to have a vintage feel to it. I think I nailed it while still being somewhat contemporary. I plan on making the word \"Truck Repair\" into a font someday. I plan on calling it Moes Thick and Thin. The Prince logo got rejected. They thought it looked like a book cover. I have to agree with them on that one, but it was a lot of fun to design. :)\n\nThanks for looking!\n\n-Charles Borges de Oliveira\n\n ![](http://web.archive.org/web/20101218191937im_/http:/typophile.com/files/cbdo%20recent%20lettering_6608.jpg)\n\n",
  "author": "<a href=\"/web/20101218191937/http://www.typophile.com/user/1657\" title=\"View user profile.\">Charles_Borges_...</a>",
  "time": "<br>",
  "uid": "1657",
  "comments": [
    {
      "time": "",
      "content": "\\> I plan on making the word “Truck Repair” into a font someday.\n\nGood. There aren't a lot of these, especially in heavy weights. Those that do exist [haven't aged well](http://web.archive.org/web/20101218191937/http:/www.fontshop.com/fonts/singles/scangraphic/globe_sb_ultra/). [Magnesium](http://web.archive.org/web/20101218191937/http:/www.fontshop.com/fonts/downloads/mvb_fonts/mvb_magnesium/) is one of the only heavy sans serifs with contrast that really work in a contemporary design.\n\n"
    },
    {
      "time": "",
      "content": "Moe's Truck Repair is great. I like the whole presentation.\n\nSharon\n\n"
    },
    {
      "time": "",
      "content": "Nice stuff!\n\n"
    },
    {
      "time": "",
      "content": "The Truck Repair one looks similar to Boca Raton [http://www.myfonts.com/fonts/imageclub/boca-raton/](http://web.archive.org/web/20101218191937/http:/www.myfonts.com/fonts/imageclub/boca-raton/ \"http://www.myfonts.com/fonts/imageclub/boca-raton/\") with some improvements. For example, the \"A\" goes the right direction in yours!\n\n"
    },
    {
      "time": "",
      "content": "I've seen your work before here on Typophile. I still remember it. Gorgeous.\n\n"
    },
    {
      "time": "",
      "content": "Very nice work.\n\n"
    },
    {
      "time": "",
      "content": "Thanks!\n\n"
    }
  ]
}
