{
  "id": "35970",
  "title": "Typesetting question - beyond the ellipsis",
  "forum": "Design",
  "tags": [

  ],
  "content": "Greetings typophiles.\n\nI need to work with some text for an anthology which has had certain passages excised by its editor. Its important to denote where the removed passages occur. Normally I would use the ellipsis character (…) but in this case the ellipsis already occurs frequently in the original text. So the problem is how to typographically mark the distinction in the text between the “voice” of the editor and that of its original author.\n\nIs there a convention for handling this? I'm considering using an ellipsis wrapped in square brackets([…]) for the editor's deletions, which seems – to my eyes at least – to do the job, but it is an intuitive rather than an informed choice. I would be grateful for any suggestions or guidance you might have.\n\nMany thanks!  \nJohn F\n\n",
  "author": "<a href=\"/web/20101219203400/http://www.typophile.com/user/13750\" title=\"View user profile.\">woof</a>",
  "time": "<br>",
  "uid": "13750",
  "comments": [
    {
      "time": "",
      "content": "Most of my publishing clients eschew the ellipsis character in favor of period, space, period, space, period, space.\n\nI don't know why. But that could be a way to distinguish it.\n\n"
    },
    {
      "time": "",
      "content": "Brackets are a typical visual cue for an editorial aside. I think the reader will easily make the connection and appreciate that a distinction has been made.\n\nEdit: Also, it'd just be a legitimate excuse to use brackets, which in some faces is a real blessing.\n\n"
    },
    {
      "time": "",
      "content": "As far as the ellipsis points themselves go, there are a variety of styles -- AP (Associated Press), for example, sets three closed-up periods in a row -- no spaces in between. I forget MLA style, but as I remember, it has more to do with how many periods are used when a comma is also in play, and where the comma goes (e.g., play . . . ,) when a final period is in play (aka four-dot ellipses) e.g., play. . . .) Much of this depended on the sentence structure before the material was elided.\n\nChicago, at least at one time, recommended a fixed space between the periods in the ellipsis, I believe a three-to-em space, which is more than a word space in most modern settings. There are pluses and minuses to each style. By in large, we prefer a justifying word space between the periods, the minus here being that the space will vary a bit between the various ellipsis on a page, depending on the space used in individual lines.\n\nNow you <cite>could</cite> use closed-up periods (i.e.,\"AP style\") for material elided by the editor, and spaced periods for material the author had elided. But on balance, I prefer what you propose - using brackets around whatever you use for standard ellipsis. Any method you pick should have a note about the style used to distinguish material elided by the author as opposed to the editor.\n\nFWIW\n\n"
    },
    {
      "time": "",
      "content": "i like the brackets idea... will use it myself!\n\n"
    },
    {
      "time": "",
      "content": "Also italicising the brackets to further set it apart from the text. I see things that way a decent bit.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "I don't get the brackets. Any pics?\n\nAlso, I think what we need is a chacter for the elipse, elipse followed by period, etc.\n\nBut then there's probably no slot in the Unicode/OpenType bible for that.\n\n"
    },
    {
      "time": "",
      "content": "The brackets are encouraged by both MLA and MHRA, and verily helpful when the source text contains lots of ellipses (somewhat common in literature). So for instance to take out a random chunk of my signature line, “El futuro es una línea […]&nbsp;nosotros mismos”. However, they're also discouraged in APA, Chicago, and Bluebook, so, take that as you will.\n\nAs to jupiterboy's comment, there is a Unicode slot for ellipsis, U+2026, but not for the others because they carry two separate semantic meanings. With OpenType you could set up a ligature for the sequence U+2026, U+002E (period), that would be a correctly spaced four-period sequence. But I Just went ahead and spaced my elipsis so that adding another punctuation mark would be properly spaced.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "That's great. That's where editors get hung up, needing to follow Chicago and have the equal spaces between the ellipse dots and the punctuation. It's a shame because you don't get to use the designed ellipse mark.\n\nI'll look at MLA. I'm missing the distinction between the bracketed elipse and the normal use of the ellipse.\n\n"
    },
    {
      "time": "",
      "content": "A normal ellipse would be like trailing off something, or a longer pause.\n\nFor example, \"It's just… I want to do the right thing\". It's not too highly used in academic writing, but in literary writing, it's a good bit more so, and so having something to distinguish between the two is very useful.\n\n_It's just…he called out for help: “help me… I'm […]&nbsp;dying.”_\n\nSo here you have normal ellipses in and out of the quote, with my shortening the quote (which might have been, who knows, \"help me… I'm hurt and I'm dying.\"\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "Ellipsis, ellipses. God save me. I should have a dictionary attached to my arm.\n\nThanks for the reply. Looks like you are using the brackets with missing quoted material, and the plain ellipsis for the pause. What I'm more familiar with is the Chicago style usage where the ellipsis is for either situation, and how you snug it up to the letters tells the reader where the missing information was. I'll be on the lookout for this now. I glanced through the Chicago ellipsis and bracket section and didn't notice any bracketed ellipsis. This is has been a hot topic in my home for several years. Sad.\n\n"
    }
  ]
}
