{
  "id": "35972",
  "title": "Clearview in the NY Times Sunday magazine",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "MAGAZINE | August 12, 2007  \nThe Road to Clarity  \nBy JOSHUA YAFFA  \nHow a graphic designer and a typographer and their obsession with fonts and legibility led to a painstaking effort to clean up America’s road signs, one letter at a time.\n\n[http://select.nytimes.com/preview/2007/08/12/magazine/1154684598978.html...](http://web.archive.org/web/20131010190811/http:/select.nytimes.com/preview/2007/08/12/magazine/1154684598978.html?ex=1186804800&en=a8c0a86a18d2357c&ei=5121&emc=eta1 \"http://select.nytimes.com/preview/2007/08/12/magazine/1154684598978.html?ex=1186804800&en=a8c0a86a18d2357c&ei=5121&emc=eta1\")\n\nJust found out that this is coming out this Sunday.\n\nJames\n\n",
  "author": ".00",
  "time": "9 Aug 2007 — 8:17am",
  "uid": "1947",
  "comments": [
    {
      "time": "9 Aug 2007 — 8:26am",
      "content": "Congratulations, James. Not only is the signage in the picture clearer, but you've managed to halve the distance to the exit!\n\n"
    },
    {
      "time": "9 Aug 2007 — 9:33am",
      "content": "Great article -- tremendously significant too, because it is probably the most detailed account of a single typeface that has ever been published in a general interest magazine. The writer did an exceptional job too, I thought, especially considering he's a recent J-school grad. Many far more experienced journalists have been hopelessly flummoxed by type and its arcana. Altogether most impressive, including, James, especially, the font - - very happy for you.\n\n"
    },
    {
      "time": "9 Aug 2007 — 10:31am",
      "content": "Right, brilliant job.  \nGreat title, too.\n\n"
    },
    {
      "time": "9 Aug 2007 — 11:13am",
      "content": "James, I wasn't able to be at TypeCon this year, but a colleague of mine brought back a copy of your new \"specimen book,\" the one with the business card primer for designers. I love this catalogue, and think it is the most refreshing idea for a catalog that I have seen in years!\n\n"
    },
    {
      "time": "9 Aug 2007 — 11:26am",
      "content": "Thanks Dan,\n\nAll the credit for that catalog goes to Charles Nix who designed it. A brilliant graphic designer and a very good friend (and a pretty good type designer as well). We have another one in the works, sort of a design encyclopedia sort of thing.\n\n"
    },
    {
      "time": "12 Aug 2007 — 4:33pm",
      "content": "very nice article. i really liked this little snippet:\n\n\"Now, as the idea of branding has claimed a central role in American life, so, too, has the importance and understanding of type. Fonts are image, and image is modern America.\"\n\n"
    },
    {
      "time": "13 Aug 2007 — 11:18am",
      "content": "that was one of my favorite quotes too!\n\ngreat article. i agree with bill also, as far as i can tell it was the biggest and best article about type in a mainstream magazine. (the only other comparable one, sort of, was in the new yorker about matthew carter).\n\ncongratulations james!!! and congratulations to all of us who are becoming more significant in popular culture : )\n\n"
    },
    {
      "time": "13 Aug 2007 — 7:10pm",
      "content": "Well put Paul, Alex!\n\n"
    },
    {
      "time": "13 Aug 2007 — 7:35pm",
      "content": "Way to go, James! I read the article on Sunday morning... I liked Meeker's comments on design as a form of social activism -- they reminded me of some talks [**Jorge Frascara**](http://web.archive.org/web/20131010190811/http:/www.amazon.com/User-Centred-Graphic-Design-Jorge-Frascara/dp/0748406727) gave at the University of Buenos Aires, when I was studying there.\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:00am",
      "content": "BRAVO James! Keep kickin' butt 'nd takin' names;-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:27am",
      "content": "D'OH! I accidentally posted this [here](http://web.archive.org/web/20131010190811/http:/typophile.com/node/36091#new). I wonder why this thread didn't come up in the search? Anyway...congratulations!\n\nSo far probably the most comprehensive, and surprisingly enlightened article on type I've ever seen in a mainstream publication. I might make people look at this article, to ahem...get points across. :)\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:29am",
      "content": "Clearview is also part of a feature on design solutions in the first anniversary issue of [**GOOD magazine**](http://web.archive.org/web/20131010190811/http:/www.goodmagazine.com/), on newsstands now (the content of this issue is not online yet). See \"How do we stay safe?,\" on pages 84-85.\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:31am",
      "content": "We have the digital age to thank for the fact that the average citizen even knows what the word \"font\" means.\n\nCongratulations, James.\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:33am",
      "content": "_So far probably the most comprehensive, and surprisingly enlightened article on type I’ve ever seen in a mainstream publication._\n\nAgreed, Biddy. The writer did a great job AND never forgot that we has addressing a mostly lay audience.\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:52am",
      "content": "\"...get points across. :)\"\n\nTwelve at a time, Terry?\n\nChrisL\n\n"
    },
    {
      "time": "14 Aug 2007 — 11:21am",
      "content": "I'm not sure whether this is a pun or not? Sure. :)\n\n"
    },
    {
      "time": "14 Aug 2007 — 2:01pm",
      "content": "Useful: If anyone ever asks you again \"Do we really need any more fonts?\" you can point them here! There's also the coverage of the new approach to typography on prescription bottles as another example.\n\nHey James, do you happen to know if Puerto Rico has its own highway department? They don't need better signs, they just need signs. I think the hurricanes blow them down. Trying to find your way on the main highways is an exercise in futility.\n\n"
    },
    {
      "time": "14 Aug 2007 — 5:46pm",
      "content": "\"I’m not sure whether this is a pun or not?\"\n\nConsider the source :-)\n\nChrisL\n\nPS: There are 12 points to a pica\n\n"
    },
    {
      "time": "17 Aug 2007 — 10:00am",
      "content": "_PS: There are 12 points to a pica_\n\nPerhaps a little to esoteric? ;)\n\n"
    }
  ]
}
