{
  "id": "35978",
  "title": "Epic... All",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Epochal.\n\nThis is a word I randomly ran into today while looking for synonyms to the word periodic. I was extremely intrigued by it and decided to play around. At first I felt like I was heading in a direction I liked... a lot. I started with some Saul Bass and Simplicissimus images for inspiration and went from there.\n\nI want something bold and a little bit retro... but I also want something original. I am going to try and base a web project on this word now and really want it perfected before I move on. I am pretty happy with where the logo itself is right now, but not at all happy with the color combinations. I like red, yellow, and black... but I feel like that is nothing new.\n\nAny comments or suggestions would be greatly appreciated.\n\nAlso: def - extremely important, significant, or influential. [ep-uh-kuhl\n\n| Attachment | Size |\n| --- | --- |\n| [epictest.jpg](http://web.archive.org/web/20131014021327/http:/typophile.com/files/epictest.jpg) | 42.82 KB |\n\n",
  "author": "RyanL",
  "time": "9 Aug 2007 — 11:57am",
  "uid": "19448",
  "comments": [
    {
      "time": "9 Aug 2007 — 10:30pm",
      "content": "I'm seeing two words - \"EPO CHAL\" - which makes me want to pronounce the \"CH\" how it shouldn't be pronounced. Maybe put the split between 'H' and 'A'.\n\n- Lex\n\n"
    },
    {
      "time": "10 Aug 2007 — 8:24am",
      "content": "How about a fuschia/pink and black. I also agree it reads 'epo chal'. I think you might run into this issue no matter how you address it. But dividing it like Lex said might improve readability or at least draw emphasis. It's an interesting word though and like the design approach.\n\n"
    },
    {
      "time": "10 Aug 2007 — 10:47am",
      "content": "Thanks a lot for the comments guys. Lex, I misread your post and put the space between the C and the H... and kind of liked it. Hola, I was thinking that too, but yesterday when I was playing around with it I felt that it gave it a completely different attitude (one that I didn't want.) But after reading your post today and playing with it, I do kind of like it. Thanks.\n\nAnyways, here are a few more editions:  \n1. Original in pink.  \n2. Using same spacing but trying to make it a little more readable.  \n3. A try at Lex's suggestion.  \n4. A try at what I thought was Lex's suggestion. heh\n\n ![](http://web.archive.org/web/20131014021327im_/http:/typophile.com/files/epictest2_5711.jpg)\n\n"
    }
  ]
}
