{
  "id": "3598",
  "title": "Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Considering the professionalism of the people in here, I suppose I will be shred to parts. However, I would like to collect some opinions as well as ideas for improvements.   \n   \nThe company main object is blank CD-R, CD-RW & DVDR discs, and this is a trade company, eg they don't manufacture the CD's, they just sell them. I wanted to stay away from the \"euro stars\" cliche. Thank you, folks.   \n   \n ![Euro Optical Disc](http://web.archive.org/web/20131023204510im_/http:/www.typophile.com/forums/messages/29/28592.gif)\n\n",
  "author": "neuroman",
  "time": "15 Mar 2004 — 6:09am",
  "uid": "3193",
  "comments": [
    {
      "time": "15 Mar 2004 — 10:13am",
      "content": "What about a disk that looks like an \"E\"?   \nOr since \"optical\" is in the name, what about making the disk hole an eye?   \n   \nhhp\n\n"
    },
    {
      "time": "16 Mar 2004 — 12:08am",
      "content": "I think the lower two signs are not bad, although they could maybe be a little more abstract if you ask me. Although I like the font you've choosen, I don't think it really fits to the sign.   \nTry to fiddle a bit with the sign. Use, like hhp also said, the 'optical' angle. Have a look here for what they've done with their logo:   \n [http://www.nob.nl/](http://web.archive.org/web/20131023204510/http:/www.nob.nl/)   \n   \nTry some more. You're on the right track.\n\n"
    },
    {
      "time": "16 Mar 2004 — 4:17am",
      "content": "Yes, probably Ren\n\n"
    },
    {
      "time": "16 Mar 2004 — 9:43am",
      "content": "I actually think the squarish font is a nice fit.   \nWhat if you make the \"O\" in \"OPTICAL\" a disk a leave it at that?   \n   \n(And \"Hrant\" is fine.)   \n   \nhhp\n\n"
    },
    {
      "time": "18 Mar 2004 — 6:59pm",
      "content": "_(And \"Hrant\" is fine.)_   \n   \nBig Papa is better.\n\n"
    },
    {
      "time": "18 Mar 2004 — 7:02pm",
      "content": "That makes me sound like an African warlord. Cool.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Mar 2004 — 1:05pm",
      "content": "just a tidbit: the fifth - (bottom right corner) is almost excatly the same as a curling association logo (forget the name sorry) but they have the circles coloured 1 red and 1 blue - otherwise same shape and detail\n\n"
    },
    {
      "time": "22 Mar 2004 — 6:18am",
      "content": "Thank you all, guys, for you rpositive responce. I gave the 4 finalists to the client, so now I'm waiting for him to decide. And meanwhile let me show you something I think the client would probably approve (sadly, but true)   \n   \n ![Yet another logo](http://web.archive.org/web/20131023204510im_/http:/www.typophile.com/forums/messages/29/29025.gif)\n\n"
    },
    {
      "time": "22 Mar 2004 — 10:43am",
      "content": "The ED treatment reminds me of the IMSFA ED logo posted by Cristian G in Feb.   \n   \nAndrew\n\n"
    },
    {
      "time": "23 Mar 2004 — 1:59am",
      "content": "Could you be more specific, I would like an URL...and honestly, I haven't seen IMSFA ED logo. But I'm sure that this certain combination of E & D is a bit overused, maybe because it is too obvious ![:-)](http://web.archive.org/web/20131023204510im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "23 Mar 2004 — 7:30am",
      "content": "Sorry. Here it is.   \n   \n [http://www.typophile.com/forums/messages/29/26754.html?1077302617](http://web.archive.org/web/20131023204510/http:/www.typophile.com/forums/messages/29/26754.html?1077302617)\n\n"
    },
    {
      "time": "19 Mar 2004 — 12:31pm",
      "content": "My first reaction: \"Hmmm. I like the top version.\"   \n   \nMy second reaction: \"What if the line which indicated the center piece of the cds (in the bottom right version) was the same weight as that pseudo-connecting line?\"   \n   \nI prefer the squat-square typeface too.\n\n"
    }
  ]
}
