{
  "id": "35988",
  "title": "What needs changing on this logo (2nd Revision)",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have been trying to come up with ideas for this logo and was wondering if I have chosen the right concept for a company that wants to be a full line sporting goods store that provides a broad assortment of brand name sporting goods equipment, apparel, and footwear. I was trying to make it look corporate and sporty at the same time. Any suggestions as to what I should change?\n\n ![](http://web.archive.org/web/20081028173040im_/http:/www.typophile.com/files/revision_3454.png)\n\n [‹ best designed online stores....](http://web.archive.org/web/20081028173040/http:/www.typophile.com/node/36279 \"Go to previous forum topic\") [The Porsche Design Font ›](http://web.archive.org/web/20081028173040/http:/www.typophile.com/node/36267 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081028173040/http://www.typophile.com/user/19888\" title=\"View user profile.\">Capnhud</a>",
  "time": "<br>",
  "uid": "19888",
  "comments": [
    {
      "time": " 10.Aug.2007 5.20am",
      "content": "The leading on “Sporting Goods”  \nif it wasnt for the cap G i would think its one word.  \nSo i kinda read “Sportinggoods”  \nGood luck!\n\n"
    },
    {
      "time": " 10.Aug.2007 5.41am",
      "content": "Here’s a list of changes.\n\n1. Kern the D and the Y tighter, the T and Y a little more loosely.  \n2. Add more spacing between the Y and S (the words bleed together way too much).\\  \n3. Sporting Goods is tracked out way to much (I agree with Maxwell’s reply.)  \n4. More contrast between font choices. Maybe select a serif for Sporting Goods.  \n5. The 2 lines are too thick, set them at half the stroke weight used.\n\nAll in all, this would be a great logo if this was a line of apparel, but I don’t really see it working as well as logo for store. Considering the logo would have to work at sizes and in wide variety of applications. It’s almost too clean, and equally lifeless.\n\nGet more clever, it’s called Dynasty Sport, create a Crown logo with various sporting goods. Make a mark that would be easily remembered and recognized (think the bent staple in Staples.)\n\n"
    },
    {
      "time": " 10.Aug.2007 6.02am",
      "content": "<cite><br>\n3. Sporting Goods is tracked out way to much (I agree with Maxwell’s reply.)<br>\n4. More contrast between font choices. Maybe select a serif for Sporting Goods.<br>\n</cite>\n\nWhat serif would be an excellent choice? Also incorportating a crown where do you think that would best fit in this? Thank you guys for all the suggestions and I appreciate this so very much.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 10.Aug.2007 6.50am",
      "content": "This makes me think of two other brands: Paul Mitchell for the design & typeface and Nautica for the color.\n\nI’d modify something, even the Paul Mitchell logo is a modified version of Eurostile. It’s almost a stencil font now, and the “A” is actually built from an upside-down “U.”\n\n ![](http://web.archive.org/web/20081028173040im_/http:/www.typophile.com/files/pm_logo_5707.png)\n\nDo something to make it unique and stand out from everything else, some kind of distinguishing mark. The Microsoft logo isn’t all that amazing but it does have that little wedge taken out of the “o,” and that’s something you remember.\n\n“Sporting Goods” does need to be a different font... it needs to be either the same face (or at least the same family) as “DynastySports” or a serif face.  \nYou’ve got a good foundation; you just need to tweak it further. Have fun!\n\n"
    },
    {
      "time": " 10.Aug.2007 8.32am",
      "content": "Is there a nice serif that would complement eurostile extended?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 10.Aug.2007 9.24am",
      "content": "Did you try using Eurostile for “Sporting Goods” as well? I’m not a big fan of mixing two sans serif fonts, and the simplest solution seems to me to use the same font for both lines.\n\n"
    },
    {
      "time": " 10.Aug.2007 10.41am",
      "content": "I used Eurostile, but then went with a suggestion of using a complimentary font of Frutiger, but I can see from my rough draft that was a mistake. I was contemplating using ITC Slimbach. Is that a better choice to make.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 10.Aug.2007 11.54am",
      "content": "Try it and see how it looks. Only way to tell. I think Slimbach might have a little too much personality but the squarishness might work.\n\n"
    },
    {
      "time": " 10.Aug.2007 7.51pm",
      "content": "I agree with Patty. Try Eurostile/Microgamma for Dynasty Sport and regular Eurostile for Sporting Goods. An other good idea I’ve found to work a lot of time is to use two typefaces by the same designer. Because they’re designed by the the same person the sensibilities of the faces are usually very close. Take a look at some Novarese’s serif faces.\n\n"
    },
    {
      "time": " 11.Aug.2007 1.06pm",
      "content": "Like Brad said, it’s all Nautica and Mitchell right now. Get some motion into it; it feels awfully static for a sporting goods identity. I think you might even try something as subtle as a playful baseline for the DYNASTYSPORT, and then go serif for the second line.\n\nOne more thing: the super-tracked U&lc looks amateurish. A different face, an all-cap setting — maybe even a hand-script if you want the extra width — would work better.\n\n"
    },
    {
      "time": " 12.Aug.2007 6.48am",
      "content": "@ChuckGroth\n\n<cite>One more thing: the super-tracked U&amp;lc looks amateurish. A different face, an all-cap setting — maybe even a hand-script if you want the extra width — would work better.</cite>\n\nAre you referring to the part that says Sporting Goods?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 13.Aug.2007 6.34am",
      "content": "I appreciate all of the suggestions that have submitted to this topic and continue to welcome any suggestions for improvement. I was wondering does my choice of text appear much better than the initial roughdraft?\n\n ![](http://web.archive.org/web/20081028173040im_/http:/www.typophile.com/files/revision2_5882.png)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here.\n\n"
    },
    {
      "time": " 13.Aug.2007 7.42pm",
      "content": "Hmm. I’m not loving the cap/small cap look - even tho I realize they aren’t exactly the same (the “small caps” being extended). The caps look squooshed and the weights don’t match. You also have a problem with those two G’s and the awkward space under the cap S. I think a rule between the two lines might help. Something just looks off-balance here. Your kerning/tracking on the second line isn’t good either, especially in “goods”. Maybe there’s some sort of symbol you can use between the G’s that will relate somehow to the S above them? I’d also suggest not tracking the second line to the width of the top line, let it be shorter and centered.\n\nI like your first logo better, even tho it does remind me of other existing logos.\n\n"
    },
    {
      "time": " 14.Aug.2007 5.12am",
      "content": "Curious what program are you using to design this in?\n\n"
    },
    {
      "time": " 19.Aug.2007 1.12pm",
      "content": " ![](http://web.archive.org/web/20081028173040im_/http:/www.typophile.com/files/revision2a_4103.png)\n\nI am not quite sure if this if this is an improvement but maybe it is headed in a better direction that the first. Critiques are very much welcomed.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 20.Aug.2007 1.33pm",
      "content": "Your latest version is not nearly as strong as the last one (posted 8/13). It looks like some sort of poorly painted antique wood shelf I’d put 4th place trophies on. I would go back to black and white, track down ’sporting goods’ and give it a bit of breathing room off the ’d..sports’ baseline. Never let meaningless embellishments, which are confusing, steer your design.\n\nACK\n\n"
    },
    {
      "time": " 20.Aug.2007 4.31pm",
      "content": "I know you have only shown us 3 examples, but it seems like you don’t have a concept. It seems like you are just trying to decide on a typeface. I would suggest stepping away from the computer and doing a lot of sketches with a pencil and paper. Also, do a lot of research of competitor’s logos.\n\nA resource is the Logo Design Workbook.\n\nBe aware of the image the company wants to portray—energetic, fun, sophisticated, expensive, discount. Also be aware that the logo will be used on exterior signage on the side of the building and in newspaper ads. Right now your concepts would not work effectively as signage.\n\n"
    }
  ]
}
