{
  "id": "35990",
  "title": "Which sans-serif font would complement MinionPro ?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello. I need your advice because I am an amateur involved in an open- and self-publishing project. The final product will be an e-book, or simply a pdf file. The topic is environmental law, policy and activism, and the audience is very diverse. The language is (modern) Greek, but some quotes and bibliography might be in English or French, and a bi-lingual edition would also be desirable in the future (hence, we need essentially a bi-lingual typeface). I have chosen MinionPro for the text - partly because it is available, partly for readability and elegance (with Sabon a close second). I am looking for a sans-serif font for headlines and titles...I have considered Memorandum and Veto (but they do not offer Greek), as well as Myriad Pro (which is still an option), but I suspect there are other choices ....Please consider also cost (no more than 30-40 euros, so it has to be a bold typeface that is sold separately), and feel free to suggest other font combinations. Thanks.\n\nP.S. On second thought, do I need a separate font for headlines?\n\n",
  "author": "Blackbird",
  "time": "10 Aug 2007 — 5:42am",
  "uid": "20585",
  "comments": [
    {
      "time": "10 Aug 2007 — 7:32am",
      "content": "Check this link...\n\n[http://www.myfonts.com/search?search%5Btext%5D=greek+sans-serif](http://web.archive.org/web/20141027074004/http:/www.myfonts.com/search?search%5Btext%5D=greek+sans-serif \"http://www.myfonts.com/search?search%5Btext%5D=greek+sans-serif\")\n\n... it might be helpful to find something in your criteria range. I would use Minion Pro for everything. Use italic for headlines or the small caps. If I'm right, you even have swashes to use for a more decorative feeling.\n\nCheers!\n\n"
    },
    {
      "time": "10 Aug 2007 — 12:26pm",
      "content": "As you suggested in your post, I'm a big fan of partnering Minion Pro and Myriad Pro together.\n\n"
    },
    {
      "time": "10 Aug 2007 — 1:58pm",
      "content": "I'd agree with using Minion Pro for everything, esp. since there is a titling (aka \"Display\") version, along with a \"Subhead\" version. Combining Minion & Myriad is \"quite common\" in several senses of the term.\n\nBut if you must have a sans, some of the fonts at\n\n[http://www.greekfontsociety.org/pages/en\\_typefaces1.html](http://web.archive.org/web/20141027074004/http:/www.greekfontsociety.org/pages/en_typefaces1.html \"http://www.greekfontsociety.org/pages/en\\_typefaces1.html\")\n\nhave a Latin character set as well as Greek, and there are one or two in a Sans style.\n\nFWIW\n\n"
    },
    {
      "time": "10 Aug 2007 — 2:09pm",
      "content": "Minion and Myriad are like Peanut Butter and Jelly.\n\n"
    },
    {
      "time": "10 Aug 2007 — 2:41pm",
      "content": "If you go with a sans, choose something with a humanist feel and not too extreme in design. Syntax, ITC Stone Sans, Lucida Sans, are among the more \"traditional\" possibilities.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "10 Aug 2007 — 2:48pm",
      "content": "I would even try Chaparral.\n\nMikey :-)\n\n"
    }
  ]
}
