{
  "id": "3599",
  "title": "(x) BBC - Box Of Delights - Neo Belwe {Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi, im doing a job for the beeb for one of their old childrens classics 'box of delights' any ideas what the logo type font is???   \n   \nthanks in advance ![](http://web.archive.org/web/20071118040626im_/http:/www.typophile.com/forums/messages/83/28596.jpg)\n\n [‹ &#40;x&#41; Cafepress.com - Myriad, ITC Officina Sans {Franz, Yves, Adriano S}](http://web.archive.org/web/20071118040626/http:/www.typophile.com/node/3616 \"Go to previous forum topic\") [&#40;x&#41; NYC Subway font - Helvetica {Karl} ›](http://web.archive.org/web/20071118040626/http:/www.typophile.com/node/3610 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071118040626/http://www.typophile.com/user/2466\" title=\"View user profile.\">the_body</a>",
  "time": "<br>",
  "uid": "2466",
  "comments": [
    {
      "time": " 15.Mar.2004 7.11am",
      "content": "That's Belwe, innit?\n\n"
    },
    {
      "time": " 15.Mar.2004 7.13am",
      "content": "No it's [not](http://web.archive.org/web/20071118040626/http:/www.myfonts.com/fonts/bitstream/belwe/condensed/testdrive.html?s=Box%20of%20Delights&p=48). ![:-(](http://web.archive.org/web/20071118040626im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": " 15.Mar.2004 7.41am",
      "content": "How old is 'old'? Are we talking 1930's? Pre-digital? Pre-film type? Can you give us some placement in time for the sample?\n\n"
    },
    {
      "time": " 15.Mar.2004 7.46am",
      "content": "from bbc.co.uk   \n   \nMade in 1984, the production was a daring mixture of live action and animation, and included a large number of complicated visual effects. Unusually, a lot of them still look impressive today.\n\n"
    },
    {
      "time": " 15.Mar.2004 9.23am",
      "content": "I think it could be the old Headliners version called neo-Belwe. The one at MyFonts is the Letraset version from the late '70s, but it's not the only attempt to revive the 1926 original. Here's a scan from a Headliners one-line specimen book:   \n   \n ![neobelwe](http://web.archive.org/web/20071118040626im_/http:/www.typophile.com/forums/messages/83/28601.gif)   \n   \nI've condensed the B weight to approximate the title sample. The details seem to match where they don't in the Letraset version. Notice, for example, the bracket in the bottom counter of the B and the treatment of the ascender on the lowercase l. The lowercase e may be tilted clockwise slightly.   \n   \nUnfortunately, this is the only sample of it I have. Headliners never showed complete alphabets in their samples.\n\n"
    },
    {
      "time": " 15.Mar.2004 9.33am",
      "content": "Incidently, [Joe Treacy](http://web.archive.org/web/20071118040626/http:/www.treacyfaces.com/) picked up the Headliners library in the early days of the digital font era and currently sells some of it. I wonder if he would be able to confirm this.\n\n"
    },
    {
      "time": " 15.Mar.2004 9.39am",
      "content": "I've written to Joe a few times in the past and he has helped by providing samples of some of his fonts for my Guides. I can write and see what he can add on this.\n\n"
    },
    {
      "time": " 15.Mar.2004 9.47am",
      "content": "Im just glad Ive managed to provide some sort of challenge (rather than the usual whats this font?... oh its comic sans)   \n   \ncheers Guys\n\n"
    },
    {
      "time": " 15.Mar.2004 2.44pm",
      "content": "Well [Chalkboard](http://web.archive.org/web/20071118040626/http:/www.typophile.com/forums/messages/30/20611.html) _does_ make our life a teensy wee   \nbit harder nowadays... ![:-)](http://web.archive.org/web/20071118040626im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 15.Mar.2004 2.56pm",
      "content": "Hello, all -   \n   \nGood eye, Mark! You're right; it was originally created using Headliners' neo-Belwe B weight. The actual typeface is sharper than this sample, by the way. Here's where the confusion sets in: The tail of g is actually cut and pasted from a different Headliners typeface. My guess, without actually trying it, is Headliners' neo-French Oldstyle (for which there was only one weight). The D looks like it may have not come from Headliners' neo-Belwe, but instead from another Headliners series called neo-Pageantry. Very similar D. I looked in a number of specimen books before replying, and have found no other typefaces that do this combination of things, all in one design.   \n   \nTo Jess Gorick: We have not yet digitized these faces, but if you just need the letters as shown above, we can do that for you rapidly.   \n   \nFeel free to e-mail me directly if you are interested.   \n   \nThanks.   \n   \nJoe\n\n"
    },
    {
      "time": " 15.Mar.2004 3.24pm",
      "content": "Also, it was condensed, as Mark intimates.   \n   \nRoughly speaking, to about 78% of its normal width, based on the sample originally shown.   \n   \nJoe\n\n"
    },
    {
      "time": " 16.Mar.2004 4.26am",
      "content": "Joseph, your right on the money! as the original jpg I posted is a digitised still from a 14:9 aspect ratio, that I forgot to re-stretch from 4:3   \n   \nso long story short, it was about 78%.   \nUnfortunately the bbc have decided their original font isn't 'magical' enough so Ive got to change direction.   \n   \nthanks for all your help   \n   \nJess\n\n"
    },
    {
      "time": " 16.Mar.2004 4.40am",
      "content": "You're very welcome.   \n   \nJoe\n\n"
    }
  ]
}
