{
  "id": "35996",
  "title": "Mulberry Bush",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "My brother and his wife are starting up a children's clothing shop. Here are some of the logo ideas. Looking for some feedback, Thanks.\n\n ![](http://web.archive.org/web/20120913060533im_/http:/typophile.com/files/the%20mulberry%20bush_4459.jpg)\n\n",
  "author": "mikerich",
  "time": "10 Aug 2007 — 9:06am",
  "uid": "12790",
  "comments": [
    {
      "time": "10 Aug 2007 — 9:29am",
      "content": "I like the direction your going in with the silhouettes of children. I also like the font used. Just an idea, but what if the children made up tree branches and leaves or the children playing around/on the tree or maybe a kid(s) on a tire swing? A graphic approach, not as animated as clothes hanging on the three. I would also narrow down your color seletion on this logo and include the 'children's boutique' tag.\n\nhola!\n\n"
    },
    {
      "time": "10 Aug 2007 — 9:56am",
      "content": "I think you need a typeface more reminiscent of children's books. I would probably find something used widely the 19th Century, like Baskerville for example. This, I think, would make for a softer, more sentimental mark. I've always found design related to children to be most lasting when it emphasizes charm and sweetness rather than fun and playfulness. Fun and playful graphics and type tend to have a very short shelf-life and that doesn't make for good brand-building.\n\nHere I used Baskerville 10 along with some included ornaments, though if I were designing this logo, I would probably draw some ornaments of my own that are a little less formal.\n\n ![](http://web.archive.org/web/20120913060533im_/http:/typophile.com/files/Mulberry_3619.gif)\n\n"
    },
    {
      "time": "10 Aug 2007 — 10:04am",
      "content": "My favourite is by far the one written in blue with the tree. On the other hand, I am not certain for the long string of children with lots of colors. I would not put them. Otherwise, I would go simpler with less colors and less children.\n\nFor the others, the mixture of two types sans serif is not happy. You should remain with the same one but in another grease or choose another type with serif which mixes well. The stroke of the bunch of berries is also too much black and bold. It clashes much as a whole.\n\nPersonally, I would not use the clothesline. That recalls too much at laundry days, which is not especially an exciting activity.\n\nHowever, they are very good ideas and a very interesting project. I hope to see the final result.\n\n- - -\n\nalainch\n\n"
    },
    {
      "time": "10 Aug 2007 — 11:15am",
      "content": "What kind of demographic you aiming for?\n\nOf what you've drawn, the tree logos are less logos and more illustrations. That's not necessarily bad, but does greatly restrict how/where they can be used. I'm with alainch and I think the blue-type option is the best of the lot. I'd suggest not even having the children to simplify the mark.\n\nFisheye's suggestion definitely takes the vibe into a more upscale target. Perhaps something like that combined with an etching-type illustration of an actual mulberry bush might be something worth trying.\n\n"
    },
    {
      "time": "10 Aug 2007 — 11:29am",
      "content": "<cite>I’ve always found design related to children to be most lasting when it emphasizes charm and sweetness rather than fun and playfulness. Fun and playful graphics and type tend to have a very short shelf-life and that doesn’t make for good brand-building.</cite>\n\nExcellent input. If I take nothing more away from this topic, I'll be completely content in learning this.\n\n"
    },
    {
      "time": "10 Aug 2007 — 11:32am",
      "content": "It's rather hard to make an opinion on the upper logos, because they are too close to each other and without any order.\n\nBut on my second look I wouldn't go with any. Maybe the one with kids, but it should be heavily changed. The one with circles/bubbles/mulberries(?) doesn't imply on anything.\n\nI like fisheye's idea but it may be a bit too adult. If the demographics are rich people, than even this could work.\n\nBut be very careful about the logo detail. Remember that this logo will probably have to be stitched on clothing etc. and you have to keep that in mind too.\n\nThe tree on the logo with kids is the only mark that could possibly be used as a logo in the forms you've presented.\n\n"
    },
    {
      "time": "10 Aug 2007 — 2:37pm",
      "content": "Yes, I was definitely operating under the assumption that it's an upscale children's store.\n\nI think if the shop is not upscale, you might reconsider using the word \"boutique.\"\n\n"
    },
    {
      "time": "11 Aug 2007 — 2:21am",
      "content": "I think the sihouette of the tree / bush in a mulberry colour would work well. Try centering the type under the tree. I would also avoid that blue in the type. Fisheye's solution is quite elegant and current.\n\nLuke.\n\n"
    }
  ]
}
