{
  "id": "36005",
  "title": "Helvetica Research Project",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all,\n\nI am a new comer to this forum... I have noticed your many blogs about Helvetica and would love some help with my latest uni assignment please...\n\nI am working on a research paper about Max Miedinger (life, influences etc) and the design of Helvetica.\n\nDoes anyone know of any good reference links they could direct me to?\n\nAlso do you know when the movie may be coming down under to Sydney?\n\nMany thanks,\n\nBec\n\n [‹ License plate typography](http://web.archive.org/web/20080612044156/http:/www.typophile.com/node/27362 \"Go to previous forum topic\") [{ What's the correct way to use fractions like 1/2 } ›](http://web.archive.org/web/20080612044156/http:/www.typophile.com/node/36010 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080612044156/http://www.typophile.com/user/20613\" title=\"View user profile.\">Webby</a>",
  "time": "<br>",
  "uid": "20613",
  "comments": [
    {
      "time": " 11.Aug.2007 7.50am",
      "content": "A Sydney screening “is coming” soon apparently - [http://www.helveticafilm.com/screenings.html](http://web.archive.org/web/20080612044156/http:/www.helveticafilm.com/screenings.html \"http://www.helveticafilm.com/screenings.html\")\n\nWill it come soon enough?\n\n"
    },
    {
      "time": " 11.Aug.2007 8.03am",
      "content": "Just to inject more interest into the supposed Sydney screening, some info on the success of the Melbourne screening [here](http://web.archive.org/web/20080612044156/http:/www.letterbox.net.au/about/abt_lau_character4.html), [here](http://web.archive.org/web/20080612044156/http:/www.oneplusoneequalsthree.com/2007/07/helvetica-a-pre.html) and [here](http://web.archive.org/web/20080612044156/http:/www.helveticafilm.com/blog/2007/07/26/getting-into-character/).\n\n"
    },
    {
      "time": " 11.Aug.2007 8.14am",
      "content": "It is my understanding that not a lot is known about the development of Helvetica’s design other than what Gary tracked down for the film. Until the film came out there was even still some debate as to whether or not or not Helvetica was based on Akzidenz-Grotesk (it was). Also in the film, Matthew Carter—who knew Miedinger—states that not much is really known about what was going on while Helvetica was being designed. It might be a good idea for you to write about a typeface that has a better-known history than Helvetica.\n\n"
    },
    {
      "time": " 11.Aug.2007 8.40am",
      "content": "Talk to Robin Nicholas or Patricia Saunders about Arial, perhaps.  \nArial, celebrating its 25th anniversary, is every bit as original a design as Helvetica, and more up-to-date, so perhaps more relevant to the 21st century.  \nUnless your course is design history, why not investigate a contemporary typeface?\n\n"
    },
    {
      "time": " 11.Aug.2007 2.55pm",
      "content": "What a shame there is no set date for the movie in Sydney yet... I will keep looking our for it.\n\nI was considering researching Arial. Good idea Nick, I maybe able to find more on a more contemporary typeface.\n\nThanks\n\n"
    },
    {
      "time": " 12.Aug.2007 7.51am",
      "content": "We’re working with the AGDA to set up several screenings in Australian cities, these will happen in October and November.\n\nAnd there’s plenty of information about Helvetica’s development, some of which is featured in the film, but a lot more of which had to be left out if the film due to editing constraints. And Alfred Hoffmann of Haas is compiling a new book with Lars Müller about the Helvetica story, utilizing all the archival material Hoffmann has. No word on when that book will be published, but I’m assuming 2008.\n\n[http://www.lars-mueller-publishers.com/e/publishers/programm.php](http://web.archive.org/web/20080612044156/http:/www.lars-mueller-publishers.com/e/publishers/programm.php \"http://www.lars-mueller-publishers.com/e/publishers/programm.php\")\n\n"
    }
  ]
}
