{
  "id": "36029",
  "title": "What is your typical first glyph?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I would like to know which glyph you start with when embarking on a new design. Do you always start with the same one? Why? Also, does one glyph set the tone for the rest of a face for you and why?\n\nI am finally taking a stab at my first face after years of wanting to, but would benefit from learning how you tackle a project and some of the rationale behind your approach. I think once I get rolling it will come easier, but I am not sure where to start.\n\nThanks!\n\nMike\n\n [‹ Font catalogue](http://web.archive.org/web/20080209232318/http:/www.typophile.com/node/35973 \"Go to previous forum topic\") [Font for newspaper ad? ›](http://web.archive.org/web/20080209232318/http:/www.typophile.com/node/36018 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080209232318/http://www.typophile.com/user/1689\" title=\"View user profile.\">mike gastin</a>",
  "time": "<br>",
  "uid": "1689",
  "comments": [
    {
      "time": " 12.Aug.2007 6.43am",
      "content": "Know what? I just found info on this in the typowiki. Still welcome any thoughts, though.\n\n—  \nMike\n\n"
    },
    {
      "time": " 12.Aug.2007 8.25am",
      "content": "It depends on how I am feeling but for the ’sense’ of the design when I am sketching I will often go with a lower case a. Just for flavor. And then I go with o, then n. Then g. Not always. Sometimes a different glyph is what inspired me so I will push from there.\n\nWhen I digitize I go with o.\n\n"
    },
    {
      "time": " 12.Aug.2007 9.34am",
      "content": "In most cases I start of with an n and after that the o. It helps me to roughly determine the rythm and widths of the characters.\n\n"
    },
    {
      "time": " 12.Aug.2007 5.21pm",
      "content": "Artur’s method is the orthodox one I think.\n\n"
    },
    {
      "time": " 12.Aug.2007 5.58pm",
      "content": "I usually start with an ’a’ or an ’n’. The ’a’ has round and straight shapes, and a terminal (two even), which I find usefull for determining the general feel of the face. The ’n’ I use for the style of shoulder and connection to the stem(s).  \nBut sometimes when I’m doodling without any real purpose I might be drawing a different character, and if it’s something worthwile, I will go from that.\n\n"
    },
    {
      "time": " 13.Aug.2007 8.00am",
      "content": "These are helpful!\n\nI spent the better part of the day yesterday sketching a’s and n’s with the odd o thrown in for good measure. Lots of fun! I am having trouble getting consistency, but I am certain that will come with time and as my pencil skills improve through use.\n\n—  \nMike\n\n"
    }
  ]
}
