{
  "id": "36032",
  "title": "Feijoa gives error in EPS",
  "forum": "Build",
  "tags": [

  ],
  "content": "Recently I've bought Feijoa. With this font I'm creating sheet music using Finale (the most common software for that) in Windows. Than the result is exported to an EPS file. This EPS cannot be opened in Paint Shop Pro or Photoshop because an unclear error is given.\n\nDoes anyone know what to do? FontLab doesn't seem to find anything weird to the font. Font Creator though is giving some error. But even after the glyphs are validated the EPS error remains.\n\nCan anyone help?\n\nYours sincerely,\n\nTijs Krammer\n\n",
  "author": "<a href=\"/web/20101219203406/http://www.typophile.com/user/14182\" title=\"View user profile.\">Tijs Krammer</a>",
  "time": "<br>",
  "uid": "14182",
  "comments": [
    {
      "time": "",
      "content": "Maybe you should convert everything to outlines before you export? I don't know if that is an option in Finale.\n\nIf the problem persists, you should contact Chester at Village directly. He is a tech-wiz, and should be able to help you.\n\n[http://www.vllg.com](http://web.archive.org/web/20101219203406/http:/www.vllg.com/ \"http://www.vllg.com\")\n\n"
    },
    {
      "time": "",
      "content": "I'm afraid Finale doesn't give any options in exporting to EPS.\n\n"
    },
    {
      "time": "",
      "content": "Try doing a direct export to pdf. There are tools for Windows to facilitate that, if I'm not mistaken (I'm on Apple).\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Can you tell us the exact text of the \"unclear error\"? Do you get the same error if you substitute a different font?\n\n"
    },
    {
      "time": "",
      "content": "Pain Shop Pro gives this message: The following error has occurred while trying to read the PostScript file: invalidfont in --FindResource--.\n\nYesterday I contacted Chester and he sent me the Type 1 version of Feijoa. And with this font the problem still persists.\n\n"
    },
    {
      "time": "",
      "content": "Does Finale have its own PostScript interpreter? Do you have this issue with any other fonts with large character sets?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Can you give some examples of fonts with large character sets? How can I know whether a font has a large character set?\n\nTijs\n\n"
    },
    {
      "time": "",
      "content": "Adobe Garamond Premier Pro and Arno Pro.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I'm afraid I can't find those two. Any other examples?\n\nHow can one tell that a font has a large character set?\n\nTijs\n\n"
    },
    {
      "time": "",
      "content": "\\> How can one tell that a font has a large character set?\n\nVery simple. Windows: Start -\\> All Programs -\\> Accessories -\\> System Tools -\\> Character Map.\n\nYou didn't answer the most important question:\n\n\\> Thomas Phinney: Do you get the same error if you substitute a different font?\n\n"
    },
    {
      "time": "",
      "content": "Yeah, does the problem replicate with a different font?\n\n"
    },
    {
      "time": "",
      "content": "I did some custom work a few years back for a client using Finale and we had to use TTs to get everything working. Have you tried TT fonts? Will it export as intended?\n\n"
    },
    {
      "time": "",
      "content": "I tried making the EPS before with some other fonts, both OpenType and TrueType and the EPS-files created turned out fine.\n\nBut now I chose the font with the most glyphs I could find: Segou with 2200 glyphs. And indeed a problem occurs!\n\nNow to test, how can I create a version of Feijoa without so many characters? Can I just delete the glyphs in FontLab, or should this be done more carefully?\n\nTijs\n\n"
    },
    {
      "time": "",
      "content": "I've looked at all the characters in Feijoa. Indeed there are a lot of Eastern Europe characters and such. How do I know which characters to delete and which to preserve?\n\nTijs\n\n"
    },
    {
      "time": "",
      "content": "You should also report the bug to the folks who make Finale. It sounds like the problem is in their software, not in the font (though you may be able to work around the bug).\n\nT\n\n"
    },
    {
      "time": "",
      "content": "I doubt if the Finale developers ever thought much about complex fonts. I would sure ask the Makemisic folks to take a look at it.\n\nAlso, ask Kris before you edit his font.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chester Jenkins from Village has made a version with a smaller character set. This indeed seems to have been the problem. The EPS now turn out fine.\n\nThank you all very much for your answers and you sharing your expertise! You're great!\n\nTijs\n\n"
    },
    {
      "time": "",
      "content": "Tijs,\n\ndid you, still, report the problem to the Finale developers?\n\nA.\n\n"
    }
  ]
}
