{
  "id": "36045",
  "title": "Celtic/Roman typeface - critique!",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "A new typeface of mine (in development).  \nCritiques about this face and sugestions to amplify the family are very welcome in this moment!\n\nThanks,\n\nRicardo Esteves Gomes  \n [http://www.outrasfontes.com](http://web.archive.org/web/20150417083447/http:/www.outrasfontes.com/ \"http://www.outrasfontes.com\")\n\n| Attachment | Size |\n| --- | --- |\n| [janathork-test02.gif](http://web.archive.org/web/20150417083447/http:/typophile.com/files/janathork-test02_0.gif) | 30.34 KB |\n| [janathork-test02.pdf](http://web.archive.org/web/20150417083447/http:/typophile.com/files/janathork-test02_0.pdf) | 14.52 KB |\n\n",
  "author": "outrasfontes",
  "time": "12 Aug 2007 — 10:41pm",
  "uid": "16162",
  "comments": [
    {
      "time": "12 Aug 2007 — 11:25pm",
      "content": "I like it, it's a nice synthesis of uncial and roman styles. I would, however, re-do the 'a' as it looks more like a lowercase lambda than an 'a.' The current shape would make a great lambda, btw.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:03am",
      "content": "Nice work!! I like the 'a'… it's different but readable\n\n"
    },
    {
      "time": "13 Aug 2007 — 8:05am",
      "content": "Thank you guys! The \"a\" is really close to \"lambda\" and I did not realize that before. But I'm not sure about the real size of this problem. Maybe it can make an interesting relation to greek culture also that I was not expecting for. I'm sending an image with some calligraphic styles that I was based when I designed letter \"a\".\n\n ![](http://web.archive.org/web/20150417083447im_/http:/typophile.com/files/references-for-a_4560.gif)\n\n"
    },
    {
      "time": "16 Aug 2007 — 9:51am",
      "content": "In the first two examples, the left-hand diagonal joins the right-hand one near the top. In the third example, the left diagonal is two strokes, almost like in a 'k', and in the fourth, it's a very reduced bowl. To my eye, these details distinguish these four 'a' styles from a lambda.\n\nThe fundamental characteristic of lambda is the two diagonal strokes, the left one meeting the right at about its halfway point. This is what makes your 'a' look like lambda, and it doesn't have any other details that make it look less like lambda.\n\nOf course, do what you like. I still think the font looks great. :)\n\n"
    },
    {
      "time": "18 Aug 2007 — 5:39pm",
      "content": "Thank you very much, Matt.\n\nI just made a small research for greek types and what I saw is that minuscule 'lambda' always have an accender. Something like a rotated 'y'. So, in the situation when we isolate my latter 'a' I agree with you that it looks like a lambda, but when we see it in a text (context), I think it is difficult not to read it as an 'a'. I was really thinking about that, so I made what could be a minuscule lambda in this typographic style. Please, tell me what you think about it.\n\n ![](http://web.archive.org/web/20150417083447im_/http:/typophile.com/files/roman-greek_4781.gif)\n\n"
    },
    {
      "time": "15 Sep 2007 — 12:20am",
      "content": "I would still move the join a bit more to the top of the letter. And have no confusion afterwards.\n\nAnd btw: you've made very nice design so far.\n\n"
    }
  ]
}
