{
  "id": "36051",
  "title": "Helvetica: the DVD",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello all, just a note to let you know that the Helvetica film DVD is now available for pre-order. More info here: [http://www.helveticafilm.com/shop.html](http://web.archive.org/web/20120322022835/http:/www.helveticafilm.com/shop.html \"http://www.helveticafilm.com/shop.html\")\n\nThe DVD includes 95 minutes of bonus material... we basically edited 41 short interview segments, each around two to five minutes long. If you've seen the film, you'll have an idea of the format of these.\n\nWe'll definitely post Quicktimes of several of them in the next few weeks... any requests?\n\nCheers,\n\n-Gary\n\n**Helvetica DVD Bonus Features:**\n\nMassimo Vignelli:  \nOn his introduction to graphic design  \nThe 1972 New York Subway map  \nPost-modernists and the “flower children”\n\nWim Crouwel:  \nHis “Proposal for a New Alphabet”  \nPencil vs. Mouse  \nThe audience for good design\n\nMatthew Carter:  \nHow technology has affected type design  \nThe Neue Haas Grotesk specimen book  \nOn the reader’s awareness of typefaces\n\nMike Parker:  \nOn Helvetica and Jackson Burke\n\nOtmar Hoefer and Bruno Steinert on how they got involved in type\n\nBruno Steinert on Helvetica and the Macintosh\n\nHermann Zapf:  \nOn his career  \nThoughts on Helvetica\n\nHoefler and Frere-Jones:  \nFont stories  \nTheir specimen book collection  \nThe Gotham project\n\nErik Spiekermann:  \nTypomaniac  \nMy favorite letter is…  \nHis approach to design  \nOn Arial…\n\nNeville Brody:  \nThe Face and Arena  \nThe role of typography in advertising\n\nMichael Bierut:  \nOn Helvetica and branding\n\nPaula Scher:  \nThe “mean” Modernists  \nTechnology and her design process  \nOn record cover design\n\nStefan Sagmeister:  \nOn music packaging  \nOne typeface is not enough  \nOn designing for an audience\n\nDavid Carson:  \nHis approach to design  \nThoughts on Helvetica\n\nDanny van den Dungen:  \nThe origin of the name Experimental Jetset  \nThe relationship between designer and subject matter  \nOn punk rock and Modernism\n\nMichael C. Place:  \nThe value of good design  \nOn the public’s awareness of graphic design  \nBrockmann gets in the picture\n\nNorm:  \nThe Simple typeface  \nFavorite letters\n\nRick Poynor:  \nThe future...\n\n",
  "author": "swiss dots",
  "time": "13 Aug 2007 — 8:18am",
  "uid": "11572",
  "comments": [
    {
      "time": "13 Aug 2007 — 8:29am",
      "content": "Great news! Just one question though.\n\n<cite>\"English and German language subtitles\"<cite></cite></cite>\n\nIs that English captions?\n\n"
    },
    {
      "time": "13 Aug 2007 — 8:50am",
      "content": "<cite>Is that English captions?</cite>\n\nYep.\n\n"
    },
    {
      "time": "13 Aug 2007 — 9:04am",
      "content": "I could do without Spiekermann's \"Typomaniac\" nonsense, but more of Stefan Sagmeister and David Carson would be interesting.\n\n"
    },
    {
      "time": "13 Aug 2007 — 9:13am",
      "content": "<cite>Erik Spiekermann:<br>\nOn Arial…</cite>\n\nWhy do I get the feeling that part had to be cut to keep the movie from ending up PG-13?\n\n"
    },
    {
      "time": "13 Aug 2007 — 9:21am",
      "content": "When will this all be available?\n\n"
    },
    {
      "time": "13 Aug 2007 — 9:43am",
      "content": "_When will this all be available?_\n\nThe above linked page says the release date is November 6.\n\n"
    },
    {
      "time": "13 Aug 2007 — 9:44am",
      "content": "Nov 6, according to Gary's link.\n\nI dunno if I want to fork over $75 for the collectors edition. I'm a type nerd ... but maybe not that much.\n\nFor $20 I will definitely buy the regular version. It would have cost me that much to get to Toronto to see if shown there, if I had known it was coming.\n\n"
    },
    {
      "time": "13 Aug 2007 — 9:46am",
      "content": "_Erik Spiekermann:  \nOn Arial…_\n\n\"Why do I get the feeling that part had to be cut to keep the movie from ending up PG-13?\"\n\nROFL! Well, one quick f-word made it into the final cut: when I worked at CBC, you were allowed one a year without any sort of retribution, but it had to be in context. :-)\n\nPerhaps the Helvetica extras with Herr Spiekermann are rated R!\n\n(And how soon will someone come up with a YouTube video of him rapping it? Inquiring minds....)\n\n"
    },
    {
      "time": "13 Aug 2007 — 10:07am",
      "content": "The official street date is November 6th. But folks who order from the film website will get theirs shipped a week early.\n\n"
    },
    {
      "time": "13 Aug 2007 — 10:38am",
      "content": "HD DVD or Bluray?\n\nOne of the interesting features of HD DVD is that extra sets of subtitles can be downloaded, and that actual OpenType weights of the font could be included on the disc for the menus.\n\nCheers, Si\n\n"
    },
    {
      "time": "13 Aug 2007 — 10:44am",
      "content": "\\> I could do without Spiekermann’s “Typomaniac” nonsense, but more of Stefan Sagmeister and David Carson would be interesting.\n\nHmm, I beg to differ. Carson's was the only segment that could have been left out of an otherwise perfect set of interviews.\n\n"
    },
    {
      "time": "13 Aug 2007 — 10:49am",
      "content": "\\>and that actual OpenType weights of the font could be included on the disc for the menus.\n\nShould add \"if properly licensed from Linotype\"\n\n"
    },
    {
      "time": "13 Aug 2007 — 10:51am",
      "content": "Given how well our dollar is doing these days, I figured I better order now. :-)\n\nI'm sure if it shows up here at the specialty vid order store, it's going to be a lot more than $32.46 Canadian.....\n\n"
    },
    {
      "time": "13 Aug 2007 — 11:13am",
      "content": "I can't find the bug thread, but I wish that a bad /cite wouldn't have to carry over to all successive posts. (hint: Geoff)\n\n"
    },
    {
      "time": "13 Aug 2007 — 11:18am",
      "content": "Since the film was shot in hi-def, I'd love to do a Bluray or HD DVD edition... it will definitely happen at some point down the line, but probably not till summer 2008 at the earliest...\n\n"
    },
    {
      "time": "13 Aug 2007 — 11:26am",
      "content": "You could always try finding a direct download distributor for an HD version. I can’t speak for other type designers, but I have no problems playing HD content on my HDTV via my laptop, but I don’t plan on owning an HD-DVD or Blu-Ray player any time soon.\n\n"
    },
    {
      "time": "13 Aug 2007 — 11:33am",
      "content": "I'd forwarded this [http://www.createspace.com/hddvdindie](http://web.archive.org/web/20120322022835/http:/www.createspace.com/hddvdindie \"http://www.createspace.com/hddvdindie\") a while back, but can certainly understand not wanting to go down this route (ie. mainting control, etc.,) esp as it will become increasingly easy to own the means of production in the future.\n\n"
    },
    {
      "time": "13 Aug 2007 — 12:18pm",
      "content": "Very excited about this... I pre-ordered my copy this morning. The geek in me would have splurged on the 'deluxe edition' but $20 USD for shipping to Canada (over 25% of the cost of the item) is a bit too much.\n\nGary -- if you have a spare moment before the end of the year, care to tally up the audiences and give us an idea of how many people saw Helvetica?\n\n"
    },
    {
      "time": "13 Aug 2007 — 12:36pm",
      "content": "I'm particularly interested on Carter, Spiekermann and Norm first for the quicktimes... november is not that soon!  \nThanks\n\n"
    },
    {
      "time": "13 Aug 2007 — 1:07pm",
      "content": "The So. Cal. beaches are **very nice** this time of year, if you'd like a tax write-off reason for coming back with the expanded version.\n\n"
    },
    {
      "time": "13 Aug 2007 — 1:25pm",
      "content": "Aah, good news! Pre-odered mine already (the cheapo one, though, not sure how the local customs will like it, had some bad experiences when buying products from the US).  \nOh, I hope the DVD coding is international, so that one doesn't have to change the DVD player's country code.\n\n"
    },
    {
      "time": "13 Aug 2007 — 1:40pm",
      "content": "@Stewf:  \n\"Hmm, I beg to differ. Carson’s was the only segment that could have been left out of an otherwise perfect set of interviews.\"\n\nCarson looking at that set of index cards with words on them was very good, I thought. It really showed the opposite end of the spectrum advocated by Wim Crouwel or Vignelli, as represented by Helvetica. It was a nice way to show that, yes, Helvetica does have it's purpose, but no, it's not for every purpose.\n\nRemembering the post-movie questions at Typecon, it's good to remember that not everyone who is going to see the movie is in Spiekermann-lingo a \"Typomaniac\". At least Carson wouldn't put the audience to sleep.\n\nBut that's why the DVD extras will be nice, for those of us who actually _want_ to hear the Moderns rambling on about the virtues of Helvetica.\n\nI only wish that there were some mention about Univers, which should possibly make it into the extras?\n\n"
    },
    {
      "time": "13 Aug 2007 — 2:02pm",
      "content": "\\>I only wish that there were some mention about Univers, which should possibly make it into the extras?\n\nYes about that, why isn't there an interview of Frutiger also?\n\n"
    },
    {
      "time": "13 Aug 2007 — 2:19pm",
      "content": "\\>why isn’t there an interview of Frutiger also?\n\nThe original \"you should have...\" thread\n\n[http://typophile.com/node/27479](http://web.archive.org/web/20120322022835/http:/typophile.com/node/27479 \"http://typophile.com/node/27479\")\n\n"
    },
    {
      "time": "13 Aug 2007 — 2:41pm",
      "content": "There is some dispute at present over whether or not what you will get in English will be captions, and of what quality, or “subtitles” in Arial Narrow.\n\n--  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20120322022835/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "13 Aug 2007 — 3:29pm",
      "content": "\\>Only time will tell if it’s better than “Cooper Black, behind the typeface” or that Frutiger movie. But it looks promising.\n\nThanks, i didn't read that post. Still, it doesn't explain why he is not in the movie.. Maybe they didn't wanted to make something too much \"swiss\", more international?\n\n"
    },
    {
      "time": "13 Aug 2007 — 3:34pm",
      "content": "I understand that  \n\"The History of the No 2 Pencil\" will be coming out next month.\n\n"
    },
    {
      "time": "13 Aug 2007 — 3:50pm",
      "content": "\\>Maybe they didn’t wanted to make something too much “swiss”, more international?\n\nI think the key section from the old thread is this one...\n\n\"One of the challenges putting this film together was my desire not to make it a standard talking-head film, where dozens of people chime in with one quote about the subject...\"\n\n"
    },
    {
      "time": "13 Aug 2007 — 3:57pm",
      "content": "Also, while we all have our pet type topics we would like to see addressed on Film the topic was Helvetica not Frutiger or to my disapointment Haas Unica - much less Modernist Typography. Gary's suggestion ( as I recall it ) is a good one: Make your own type Movie!\n\nI just ordered my copy. Oh the glee!\n\n"
    },
    {
      "time": "13 Aug 2007 — 3:59pm",
      "content": "Oooh, I never new that someone did a movie about Frutiger. Now I just have to figure out how to get a copy of it. Too bad Amazon.de won’t ship to the USA.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:07pm",
      "content": "@ joe -\n\nIt's not like the audience, made up almost entirly of designers is blind, Joe.  \n;P\n\n@ zzi -  \n [The Pencil: A History of Design and Circumstance](http://web.archive.org/web/20120322022835/http:/www.amazon.com/gp/reader/0679734155/ref=sib_dp_pt/002-3591388-0866446#reader-link)\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:13pm",
      "content": "\\>“One of the challenges putting this film together was my desire not to make it a standard talking-head film, where dozens of people chime in with one quote about the subject...”\n\nI can imagine there was a lot of people Gary had to put off the list because of that reason but as a great type designer, as the designer of univers and frutiger and also as a swiss type designer who's work is making the link beetween the swiss modernism (represented by helvetica) and the more \"traditional\" approach of typography, i'm pretty sure Frutiger's views would have been more than one quotes among others.\n\nAnyway i'm sure the movie is interesting and i'll get the dvd :)\n\nps: sorry, my english isn't perfect, i hope it doesn't sound too bad.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:17pm",
      "content": "russellm At least someone has a sense of humor.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:18pm",
      "content": "“One of the challenges putting this film together was my desire not to make it a standard talking-head film, where dozens of people chime in with one quote about the subject...”\n\nBut that's just it. Univers is NOT Helvetica. But it came out at the same time, had a similar purpose, was revolutionary in the amount of original weights, is arguably subtler, and...\n\nIs not as popular as Helvetica and wasn't even mentioned in the film.\n\nThe Modernist stuff that was discussed in the film used Univers as much as or more than Univers.\n\nIt deserved at least a passing mention, and only Carter in the Q&A briefly hinted at it when he referred to the \"distribution\" of Helvetica, as opposed to Univers', as being responsible for its success.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:21pm",
      "content": "@ zzi -  \nyeah - But that all I got.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:26pm",
      "content": "@ zzi -  \nyeah - But that all I got.\n\n@ Gary  \nThanks for the notice.  \nI was hoping to see the DVD released soon.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:36pm",
      "content": "Maybe someone can speak to this further, but I got the sense when I was originally contacting people about the film that Frutiger wasn't doing interviews anymore, for health reasons... or maybe he's just plain reclusive now. And his nephew did do that piece for German television about him a few years back.\n\nI'll have to go back through the extras and check on Univers shout outs. Crouwel discussed it, and of course there were mentions of Univers during the other interviews we did, but getting into Univers in any sort of in-depth way in the film required a lot more back-story, showing examples, how it differs from Helvetica, who Frutiger was. There's only so much you can do in 80 minutes, and in order to try to keep things focused on Helvetica, we decided not to go down that route. Ditto with Arial.\n\nBut I'm sure there are several examples of Univers in the film anyway, on street signs, etc... a few had to have slipped in. So get the pause button on your remotes ready...\n\nCheers,\n\n-Gary\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:47pm",
      "content": "Thanks Gary! A reasonable answer, certainly. I'm looking forward to the Director's Cut!\n\n"
    },
    {
      "time": "13 Aug 2007 — 5:08pm",
      "content": "I often read people that don't like helvetica and oppose univers to it, just saying it's so much better. For me, this is the result of a misunderstood of modernism and what swiss designers where trying to achieve at this time, and still. There has already been a long talk here about helvetica and i don't want to start the fight again :)\n\nWhat is really really interesting about a Frutiger interview is that he could help people to understand what modernism was looking for. For me, one of the most interesting thing (i think it's in the movie his son made) is the comparison with water. The look for the purity of the form is an essential idea in modernism. With helvetica this purity has been sold as neutrality, meaning you can use it for anything what, i agree, is wrong. But helvetica and univers (and most of frutiger faces) achieve to reach this purity, this \"universality\" of the shape, each by different ways. I like both.\n\nEdit: okay Gary, thanks for the explanation. My point was absolutely not to say something was missing or incorrect in your movie and i hope you did not feel it this way.\n\n"
    },
    {
      "time": "13 Aug 2007 — 5:02pm",
      "content": "RussellM, a name and initial that seems vaguely familiar in some hard-to-define way, blind people don't watch captioning. The question of audio description is a different one and I can assure you that visual artworks are described all the time (check many U.S. museums). If we can [describe <cite>Solaris</cite>](http://web.archive.org/web/20120322022835/http:/joeclark.org/access/cinema/reviews/solaris.html) we can describe anything.\n\n--  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20120322022835/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "13 Aug 2007 — 6:04pm",
      "content": "joeclark: <cite>There is some dispute at present over whether or not what you will get in English will be captions, and of what quality, or “subtitles” in Arial Narrow.</cite>\n\nHmm, I asked whether it was English captions just to make sure it wasn't English language with German subtitles, i.e. subitles only when German is spoken but no captions for English dialogue. This happens often on foreign films, \"Japanese and English subtitles\" displays only Japanese subtitles. Frustrating for those who are deaf or hard of hearing.\n\nrussellim: <cite>It’s not like the audience, made up almost entirly of designers is blind, Joe.</cite>\n\nThere are 2 million Australians who are either deaf or hard of hearing out of a population of 21 million, we're not exactly a minority market-wise.\n\n"
    },
    {
      "time": "13 Aug 2007 — 7:23pm",
      "content": "@ Joe + Geoff Riding\n\nyes, of course.\n\n:P I really didn't imagine anyone would take that comment seriously enough to offer a thought-out reply.\n\nI was plainly referring to what one might imagine is the demographic for this film. I do believe it's most obvious appeal is to people with an active interest in visual design, which kind implies a certain lack of serious visual impairment - Granted, exceptions exist, but I just went ahead and made a vast over-reaching generalization anyhow. And, yes, attention should be paid to the design of captioning and subtitles. I thought that here, that would be obvious.\n\n"
    },
    {
      "time": "13 Aug 2007 — 8:10pm",
      "content": "\\> _Oh, I hope the DVD coding is international, so that one doesn’t have to change the DVD player’s country code._\n\nOn the site it says 'NTSC Region 0', which is International. :)\n\n"
    },
    {
      "time": "13 Aug 2007 — 11:53pm",
      "content": "Thanks Quincunx, for clearing it for me. I'm not that clever with the tech text, so I missed that :^P\n\n"
    },
    {
      "time": "14 Aug 2007 — 10:09am",
      "content": "Since the accessibility issue has taken a life of its own even without me, I thought I’d write a [<cite>Helvetica</cite> accessibility manifesto](http://web.archive.org/web/20120322022835/http:/blog.fawny.org/2007/08/14/helvetifesto/), though I wonder why I had to.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20120322022835/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "14 Aug 2007 — 12:23pm",
      "content": "Wow... Joe, I truly appreciate your opinions on this, but the tone of your manifesto is really disappointing. You're basically venting on the entire home video industry's approach (or lack thereof) to accessibility, and focusing it on me and this film. When I said I'd discuss DVD accessibility with you when I met you at the Toronto screening, I meant excactly that, that we'd discuss it, that I wanted your input. But I refuse to feel that if I can't incorporate every single one of your \"suggestions,\" then I'm irresponsible and uncaring.\n\nIn the manifesto you've woven in comments and attitudes from other people, not me, including some quotes from others in this thread. Again, you're venting on others here, but blurring it and transferring it to me. Every time you use the term \"you,\" you're accusing <cite>me</cite> of something... like I've been oppressing deaf and blind people for decades??? Jesus, I just made a little film about Helvetica. C'mon, Joe. I know your heart is in the place on these issues, but I don't like getting publicly attacked for things I haven't done, and for opinions that aren't mine.\n\nThe plan has <cite>always</cite> been to have subtitles on the disc, and I'll do the best I can to take your suggestions into account regarding their quality and legibility. And I guess I forgot to mention in the email I sent you that I personally transcribed the film for the subtitles, so there won't be any spelling errors. I'll make the DVD as accessible as I can, given the budget and time constraints that any independent film producer is always under. And on that front, are there any documentaries on DVD, self-released by independent producers, that have adhered to every one of the requirements of the Clark Manifesto?\n\nAgain, I think your heart's in the right place here, Joe. But blaming me publicly, with the tone you've taken, for all the frustrations of disabled people when it comes to enjoying films is misplaced.\n\nCheers,\n\n-Gary\n\n"
    },
    {
      "time": "14 Aug 2007 — 5:08pm",
      "content": "DanGayle wrote  \n\"At least Carson wouldn’t put the audience to sleep.\"\n\nThe last thing Spiekermann could ever be accused of is putting people to sleep!\n\n"
    },
    {
      "time": "14 Aug 2007 — 5:40pm",
      "content": "I should have separated my comment about Carson from my comment about Spiekermann. I noticed it afterward, but I was hoping that no one would notice ;)\n\nSo yeah, you're right. Spiekermann's interview was thoroughly entertaining in its irreverence for the subject matter. Audiences should certainly like him, as well as Carson, if only because they don't represent that cool, detached modernism of most of the rest of the flic.\n\n"
    },
    {
      "time": "15 Aug 2007 — 3:51am",
      "content": "_Wow... Joe, I truly appreciate your opinions on this, but the tone of your manifesto is really disappointing_\n\nDanger. Do not feed or starve Joe Troll. Danger. Do not crit his content. Danger. Your web site could be attacked if you engage. Danger. Do not discuss typography. Danger.\n\nChores!\n\n"
    },
    {
      "time": "15 Aug 2007 — 3:10pm",
      "content": "David- Too right.\n\n"
    }
  ]
}
