{
  "id": "36058",
  "title": "Black Eagle : Worth pursuing?",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I'm a wanna-be type designer living vicariously through the typophile forums.\n\nMy 5 year old is having a birthday soon and has been talking about starting a rock band called Black Eagle. I have no idea where he came up with this, but, being a dad, and a graphic designer, I obviously had to take the opportunity to make some T-shirts for him.\n\nThis is the logo I came up with.\n\nI was originally trying to come up with some funky blackletter, which I failed at, but accidentally ended up with this somewhat funky type solution. Thoughts? It's cheesy in a Spinal-Tap way, hopefully. Worth making it into a font?\n\n ![](http://web.archive.org/web/20150417042047im_/http:/typophile.com/files/blackeagle_3695.gif)\n\n",
  "author": "aluminum",
  "time": "13 Aug 2007 — 10:27am",
  "uid": "1461",
  "comments": [
    {
      "time": "13 Aug 2007 — 11:55am",
      "content": "I don't know if it's subliminal thing (the name, and the image), but this type gives me a native american feel.\n\nI don't see a possible lower case version, but that doesn't mean you can't expand to create an all caps display version.\n\nYou found an application for it, who's to say others wouldn't.\n\nPlus, afterwards you wouldn't be a wanna-be type designer, you will be a type designer.\n\nEdit: I like that logo by the way.\n\n"
    },
    {
      "time": "13 Aug 2007 — 1:34pm",
      "content": "Hmm...it does have a Native American feel. I suppose it's an eagle logo and the type does have a feathery feel to it. Another nice accident. ;O)\n\nGood points, asvetic. IT's not like this is a complex face so it won't be that much work to get it into font format. I'll give it a shot. Good excuse to crack open FontForge.\n\n"
    },
    {
      "time": "13 Aug 2007 — 3:07pm",
      "content": "Your font is really cool, Darrel. I like the layout possibilities. The logo is great!\n\nSharon\n\n"
    },
    {
      "time": "15 Aug 2007 — 3:31pm",
      "content": "I could definitely see some uses for this. I like that the 'E' is really lower case if you look at it, maybe you could mix that idea into the rest of the letters as well. Looking forward to seeing more of the alphabet when you complete it.\n\n"
    },
    {
      "time": "18 Aug 2007 — 11:25am",
      "content": "If you do turn this into a font, make a \"fill\" variant (or even up to four) to allow for some cool chromatic effects.\n\n- Lex\n\n"
    },
    {
      "time": "20 Aug 2007 — 7:24am",
      "content": "Lex:\n\nYes, that was my intention. I'd probably have 3 variants. One would be a 'hollow' version, and then the other two would be a solid version of the white area (outline) and then an overprint able version of the black area (the fill).\n\nOK, next challenge: Find some time to do this. ;o)\n\n"
    },
    {
      "time": "20 Aug 2007 — 8:23am",
      "content": "Set aside 30 minutes a day and translate a single letter, you'll have the entire alphabet done in a month.\n\n"
    }
  ]
}
