{
  "id": "36062",
  "title": "Favorite Geometric Sans like Futura/Avenir",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In the [As complete and \"safe\" as Helvetica](http://web.archive.org/web/20150201230727/http:/www.typophile.com/node/36001) thread, we're discussing [Futura](http://web.archive.org/web/20150201230727/http:/www.typophile.com/wiki/Futura) and its use/misuse and the possibility of using [Adrian Frutiger](http://web.archive.org/web/20150201230727/http:/www.typophile.com/wiki/Adrian%20Frutiger)'s [Avenir](http://web.archive.org/web/20150201230727/http:/www.typophile.com/wiki/Avenir) as a replacement.\n\nWhat other geometric sans would fit into the Futura/Avenir geometric sans category, and what do you see at the pros/cons in their usage?\n\n",
  "author": "Dan Gayle",
  "time": "13 Aug 2007 — 1:29pm",
  "uid": "12948",
  "comments": [
    {
      "time": "13 Aug 2007 — 1:39pm",
      "content": "Hypatia; it's new, it's proportions are more like Futura's but it has more warmth, and it has a large character set and range of weights. No cons as yet.\n\n"
    },
    {
      "time": "13 Aug 2007 — 1:44pm",
      "content": "Most folks overlook [FF Super Grotesk](http://web.archive.org/web/20150201230727/http:/www.fontshop.com/search/?q=FF%20Super%20Grotesk) assuming it's another Futura, but closer inspection reveals a few grotesque hints, including the alternate 'a' and 'g' found in [FF Super Grotesk B](http://web.archive.org/web/20150201230727/http:/www.fontshop.com/search/?q=FF+Super+Grotesk+B+purchase). The family can be seen in use at [Born Magazine](http://web.archive.org/web/20150201230727/http:/www.bornmagazine.org/mother.html).\n\n"
    },
    {
      "time": "13 Aug 2007 — 1:44pm",
      "content": "I like Hypatia, but would prefer to see the variants as different fonts altogether rather than as Stylistic Sets because I rather prefer the variants over the default.\n\n"
    },
    {
      "time": "13 Aug 2007 — 2:02pm",
      "content": "You don't use Adobe CS, Dan?\n\n"
    },
    {
      "time": "13 Aug 2007 — 2:45pm",
      "content": "I do, but I also use Textedit a lot for random junk.\n\n"
    },
    {
      "time": "13 Aug 2007 — 3:33pm",
      "content": "Stephen, you're so right. I use and adore Super Grotesk for the cover of a fashion magazine. But it has some limitations, and for the inside of the book, I found I needed to substitute the beautiful Verlag by H&F-J (check its 2 Gs and Ms)!\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:14pm",
      "content": "Dan - TextEdit can handle Stylistic Sets just fine.\n\nmr smith - Show me!\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:26pm",
      "content": "@Stewf  \nHoly crap, you're right. Cool. Dammit, I gotta repeat that TextEdit is the most useful program on a Mac. Period.\n\n@Original Question  \nCentury Gothic and Avant Garde have some of the outward trappings of Futura, but something is really missing. Anyone know what it is? Particularly Century Gothic. Something just seems, I dunno, cheap about it.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:34pm",
      "content": "Century Gothic is to Avant Garde as Arial is to Helvetica.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:49pm",
      "content": "Aha! That's it. For such a widely distributed typeface, you'd think you'd see it in more places.\n\n"
    },
    {
      "time": "13 Aug 2007 — 4:50pm",
      "content": "Too ugly. Unfortunately, it did turn up in [Casino Royale](http://web.archive.org/web/20150201230727/http:/currentconfig.com/archives/000229.html).\n\n"
    },
    {
      "time": "13 Aug 2007 — 5:30pm",
      "content": "[Nobel](http://web.archive.org/web/20150201230727/http:/www.fontbureau.com/fonts/Nobel) from Font Bureau is nice.\n\n"
    },
    {
      "time": "13 Aug 2007 — 7:05pm",
      "content": "[Tangent](http://web.archive.org/web/20150201230727/http:/www.terminaldesign.com/fonts/sets/?CID=10)\n\n"
    },
    {
      "time": "13 Aug 2007 — 7:25pm",
      "content": "Verlag, Gotham, Geometric 415 (aka Metro Black)\n\nThat Tangent is pretty.\n\n"
    },
    {
      "time": "13 Aug 2007 — 7:29pm",
      "content": "<cite>Century Gothic and Avant Garde have some of the outward trappings of Futura, but something is really missing. Anyone know what it is? Particularly Century Gothic. Something just seems, I dunno, cheap about it.</cite>\n\nI just stay away from Century Gothic. As for Avant Garde, it would have been just fine as a one weight display face, as a text face it’s right up there with Helvetica.\n\n"
    },
    {
      "time": "13 Aug 2007 — 7:44pm",
      "content": "@terminaldesign\n\nDid you redesign your website? Very nice. And Tangent looks nice. Care to elaborate on some of the details and/or relationships to other geometrics?\n\n@James\n\nIt seems like a cheap knock-off that you could download from 2002 Free Fonts.\n\n"
    },
    {
      "time": "14 Aug 2007 — 2:48am",
      "content": "FF Super Grotesk in _The Weekend Australian Magazine_:\n\n ![](http://web.archive.org/web/20150201230727im_/http:/typophile.com/files/super1_5296.jpg)\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:46am",
      "content": "DanGayle,\n\nYes our website has been redesigned. Our good friends at adcStudio did it. They also did our ClearviewHwy site. As to details and relationships, hard to say really. I just drew a geometric sans that I liked. Charles Nix, the book/graphic/type designer, uses it a lot and he describes it as \"taut\".\n\nJames\n\n"
    },
    {
      "time": "14 Aug 2007 — 9:03am",
      "content": "_I just drew a geometric sans that I liked._  \nI wish more type designers would do that. I think it would add more life to their designs. Rather than trying to knock off someone else's design, ALA Century Gothic.\n\n@Stewf  \nI like the look of FF Super Grotesk. Someday if I need a really fatty geometric, I'll probably go that way.\n\n"
    },
    {
      "time": "14 Aug 2007 — 10:18am",
      "content": "Ooh, the g in Super Grotesk is super nice. Give me something with flavor. There's always [Gotham](http://web.archive.org/web/20150201230727/http:/www.typography.com/catalog/gotham/index.html) (same designer as Nobel with more polish). Gotham is in danger of becoming like water... (which tends to happen when people like Yahoo! adopt it). It's everywhere. Then again, if you're looking at geometric sans that just might be your aim...\n\n"
    },
    {
      "time": "15 Aug 2007 — 12:57pm",
      "content": "Century Gothic has an interesting history. Originally, there was Futura (1927). Then there was Twentieth Century (1937-47), which was Lanston Monotype's knockoff of Futura.\n\nFast-forward to the early 1990s, and Monotype was trying to provide widths-identical and design-similar versions of the PostScript \"base 35 fonts\" including Avant Garde. So they refit and redesigned Twentieth Century to more closely match the Avant Garde widths and general look, and got Century Gothic.\n\nSo you've got a clone of one thing turned into an imitation of something else. Now \\*that's\\* derivative!\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:04pm",
      "content": "My fave geometric sans these days is Mark Simonson's Proxima Nova, which I'm about to deploy in a magazine redesign.\n\n[http://www.fontshop.com/fonts/downloads/mark\\_simonson/proxima\\_nova\\_ot/](http://web.archive.org/web/20150201230727/http:/www.fontshop.com/fonts/downloads/mark_simonson/proxima_nova_ot/ \"http://www.fontshop.com/fonts/downloads/mark\\_simonson/proxima\\_nova\\_ot/\")\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:27pm",
      "content": "Depending upon how far I need the knob turned up I like:  \nGotham  \nNeutraface  \nHypatia Sans Pro  \nP22 Underground (Although I haven't used it myself)  \nAgenda (Although almost Humanist)  \nAvenir  \nFutura Maxi (Although a little childlike)  \nChalet  \nLocator (Although I haven't used it myself)\n\nJames: Tangent looks very nice and I can see why Charles Nix would like it so much. He's a Dwiggins nut (like myself) and has some of the same nuances that Metro has.\n\nEdit: For a new typeface, I've used Hypatia in a small travel pamphlet and really liked how it worked, but I did use some of the stylistic sets.\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:38pm",
      "content": "But Tiff, you're cheating. A lot of those aren't geometric at all!\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:39pm",
      "content": "Ok, maybe just Agenda and Locator, which are indeed humanist.\n\n"
    },
    {
      "time": "15 Aug 2007 — 7:06pm",
      "content": "P22 Underground is geometric? I thought that was the definition of an English humanist face? Can you have a geometric humanist face?\n\n"
    },
    {
      "time": "15 Aug 2007 — 8:15pm",
      "content": "_Can you have a geometric humanist face?_\n\nI thought that's what Mark Simonson was trying to do with Proxima Nova, but i could be misinformed.... Mark?\n\nfrom Mark's site: \"Proxima Nova straddles the gap between typefaces like Futura and Akzidenz Grotesk. The result is a hybrid combining humanistic proportions with a somewhat geometric appearance.\"\n\ni've been looking at the London Underground face a lot recently and although it may be considered the grandfather of humanistic sanserifs, there is quite a bit of geometry involved, especially in the caps, but it's also evident in the the lowercase as well.\n\n"
    },
    {
      "time": "15 Aug 2007 — 9:41pm",
      "content": "So this style would include humanist proportions of width and x-height to cap height, but with a geometric constuction? I guess that makes sense, since a lot of those old typefaces were geometrically constructed.\n\n@Paul  \nCan you comment at all about LTC Twentieth Century Medium? The [LTC website](http://web.archive.org/web/20150201230727/http:/www.p22.com/lanston/products/twentiethcen.html) says this:\n\n\"Saul Hess’ redrawing of Futura is so close that this new digital revival includes alternates of the long lost original letterforms\"\n\nIs there anything more to it, and could you add a little to what Thomas said about Century Gothic? Were there any quirks added that might be of interest?\n\n"
    },
    {
      "time": "16 Aug 2007 — 1:05am",
      "content": "Regarding Underground…\n\nit, Gill Sans, and even Metro are often grouped into the humanist sans serif category. For me, they stradle the humanist and geometric divide, although at that time there was no such divide. Humanist sans serifs really come about much later, in the post-war period… maybe really only in the 1970s. I think that Underground, Gill Sans, and Metro can easily be classified as geometric. Sure, they aren't Futura, but it really depends which letters you use for comparison. As Paul noted, the caps are very geometric, or at least similar to Futura. And then remember that Gill Sans lowercase g!\n\nWhat these sans serif type have in common is they are not grotesks (or grotesques, or gothics, or whatever name you prefer).\n\n"
    },
    {
      "time": "16 Aug 2007 — 2:33am",
      "content": "If you don't mind sleeping in your car for a month...\n\nDTL Nobel\n\nIt's beautiful and I'm pretty sure it was used as the headline sans in the \"French Women Don't Get Fat\" book (which is wonderfully set)\n\nBut most humanoids can't afford it.\n\nMikey :o)\n\n"
    },
    {
      "time": "16 Aug 2007 — 6:02am",
      "content": "I love DTL Nobel.\n\nI also love Jaguars and caviar and Comme des Garcons clothing and would love to fly first class every time and live in a loft in Tribeca.\n\nFont Bureau's Nobel is also beautiful but just as pricey.\n\n"
    },
    {
      "time": "16 Aug 2007 — 7:33am",
      "content": "<cite>\"Font Bureau’s Nobel is also beautiful but just as pricey.\"</cite>\n\nWait a minute. FB's fonts are admittedly a bit more than some of today's common fare, but they are not \"just as pricey\" as DTL.\n\nUnless I'm reading the DTL website wrong (it's awfully hard to navigate), the full offering of DTL Nobel is $939.19 USD (700 Euro) for 7 fonts.\n\nThe same complement of 7 fonts of FB's Nobel would be $210 ($30 per font).\n\nGranted, by some standards, I suppose that might be considered \"pricey.\" But DTL is in a whole 'nother league.\n\nSome may call me an FB apologist, but I thought we should set the record straight.\n\n-- K.\n\n"
    },
    {
      "time": "16 Aug 2007 — 7:49am",
      "content": "You're right, sorry Kent. I should have said \"also pricey\".\n\nI bought Verlag (10 weights for $200) instead because it's quite similar but better value.\n\n"
    },
    {
      "time": "16 Aug 2007 — 7:55am",
      "content": "\"_As Paul noted, the caps are very geometric, or at least similar to Futura._\"\n\nAll those geometric and geometric-ish sans look virtually identical in all caps. Less room for variation, I suppose? The LC is where the personality really shines.\n\nI just brought Gotham into my life in a big way, so I have to like it (and I do, fortunately). I have a [public fondness](http://web.archive.org/web/20150201230727/http:/typographica.org/000969.php) for Avenir that has yet to fade. I tend to like my geometric sans less funky and more 'period', which I realize is a fuzzy (and perhaps erroneous) distinction. Some faces, like [Phinney's Hypatia](http://web.archive.org/web/20150201230727/http:/www.adobe.com/type/browser/landing/hypatia/hypatia.html) and [Barnbrook's Priori](http://web.archive.org/web/20150201230727/http:/emigre.com/EF.php?fid=197) are less to my taste (though I appreciate their quality), whereas Neutraface, Gotham, and Verlag are more my thing. I'd come up with more examples, but I've got to get back to my work. :)\n\n"
    },
    {
      "time": "16 Aug 2007 — 8:42am",
      "content": "_I thought that’s what Mark Simonson was trying to do with Proxima Nova, but i could be misinformed.... Mark?_\n\nfrom Mark’s site: “Proxima Nova straddles the gap between typefaces like Futura and Akzidenz Grotesk. The result is a hybrid combining humanistic proportions with a somewhat geometric appearance.”\n\nMy use of the term \"humanistic proportions\" is probably a bit dated. It comes from the book \"Type\" by David Gates wherein he describes two different approaches to determining the proportions of a typeface: Humanistic, based on a tall oval/rectangle, in which the letters have the appearance of having similar widths; and Old Style, based on the circle and square, in which the letters may have very different widths, depending on whether they are constructed from two small circles/squares stacked vertically or one large circle/square. Akzidenz Grotesk and Futura are good sans serif examples of each of these two approaches respectively.\n\nWith Proxima Sans (and Nova), I tried to use \"humanist\" proportions as much as possible, except for the really round letters, such as the O, C, o, e, etc., and even these are slightly narrowed.\n\nNowadays, the term \"humanist\" is usually used a bit differently than the way Gates used it and carries more baggage than just proportion. \"Modern\" might have been a better choice of a word, though that also has other connotations.\n\n"
    },
    {
      "time": "16 Aug 2007 — 9:10am",
      "content": "Monotype once made a few sorts for Gill that mimicked the more geometric forms of Futura. When the 3-5 lc letters and 2-4 caps were substituted (precursor to stylistic sets!), it did give a much more geometric feel. A lot of that, in Gill, is the caps. O, G, C, etc. aren't that different from Futura. The design is pretty geometric and monoline for a humanist sans.\n\nOne other way to see this is that the proportions of Futura do actually follow the Renaissance model; long ascenders, small x-height, generous and proportional caps. In that sense, Futura is the most humanistic \"geometric\" sans.\n\nMetro straddles that line even more; it has some flexion and taper, sheared terminals etc. but a lot of that low-contrast roundness. It can also be disguised with a couple alternates as \"geometric,\" and I think it was.\n\n"
    },
    {
      "time": "16 Aug 2007 — 9:12am",
      "content": "_Can you comment at all about LTC Twentieth Century Medium?_  \nI think the page you linked to says it all.\n\n_Is there anything more to it, and could you add a little to what Thomas said about Century Gothic?_\n\nHere's the description directly from the font file:\n\nA design based on Monotype 20th Century, which was drawn by Sol Hess between 1936 and 1947. Century Gothic maintains the basic design of 20th Century but has an enlarged 'x' height and has been modified to ensure satisfactory output from modern digital systems. The design is influenced by the geometric style sans serif faces which were popular during the 1920's and 30's. Useful for headlines and general display work and for small quantities of text, particularly in advertising.\n\nSee also: [http://en.wikipedia.org/wiki/Century\\_Gothic](http://web.archive.org/web/20150201230727/http:/en.wikipedia.org/wiki/Century_Gothic \"http://en.wikipedia.org/wiki/Century\\_Gothic\")\n\nalso, i should have said that any sanserif with linear strokes (simple lines) is bound to follow a geometric construction to some extent.\n\n"
    },
    {
      "time": "16 Aug 2007 — 10:06am",
      "content": "_I think the page you linked to says it all._  \nThat's funny, because there was a guy here on Typophile who said who couldn't stand Futura, but loved 20th Cent. I haven't compared the faces directly myself, but if what is said about Hess' drawings is correct... :)\n\n_Here’s the description directly from the font file:_  \nNo mention of Avant Garde at all, eh?\n\n"
    },
    {
      "time": "16 Aug 2007 — 10:24am",
      "content": "@Crossgrove  \nDo you happen to know if any of those sorts are available as alternates in digital form? Because that would be super cool.\n\nAnother typeface that might fit the bill is Stempels' Neuzit S. It has that outward \"Geometric\" look, but according to Adobe:\n\n\"Neuzeit S is a geometric-grotesque hybrid design, unusual in that round shapes are wide and circular, while other characters appear slightly condensed. Also note the unusual J: this particular letter’s design is versal in origin.\"\n\nThat sounds like it was written by Thomas Phinney. I can totally imagine him saying that.\n\n"
    },
    {
      "time": "16 Aug 2007 — 12:38pm",
      "content": "I am a big fan of [Neuzeit S](http://web.archive.org/web/20150201230727/http:/www.fontshop.com/fontfeed/archives/helvetica-and-alternatives-to-helvetica/). Sadly, only two weights. Someone should revive that puppy and expand the fam.\n\n"
    },
    {
      "time": "16 Aug 2007 — 1:26pm",
      "content": "Dan: Nope, that was written and on our web site long before I started at Adobe in 1997. I think E.M. Ginger did those original font blurbs, if I remember what David Lemon has said correctly.\n\nMark S: \"My use of the term “humanistic proportions” is probably a bit dated. It comes from the book “Type” by David Gates wherein he describes two different approaches to determining the proportions of a typeface: Humanistic, based on a tall oval/rectangle, in which the letters have the appearance of having similar widths; and Old Style, based on the circle and square, in which the letters may have very different widths, depending on whether they are constructed from two small circles/squares stacked vertically or one large circle/square.\"\n\nReally? That's weird to me - Gates considers oldstyle to \\*not\\* be humanist, and thinks Helvetica \\*is\\* humanist? To me \"humanist\" proportions are a synonym for what Gates calls \"oldstyle.\" Other sources I've seen dealing with proportion such as the PANOSE system call the proportions based on a tall oval/rectangle \"modern\" rather than \"humanist,\" and that is the lingo I've adopted as well.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:37am",
      "content": "Recently I've quite liked Jigsaw by Johanna Biľak, a friend of mine has been using it here and there to great effect.\n\n( [http://www.typotheque.com/jigsaw/](http://web.archive.org/web/20150201230727/http:/www.typotheque.com/jigsaw/ \"http://www.typotheque.com/jigsaw/\") )\n\n"
    },
    {
      "time": "17 Aug 2007 — 1:32pm",
      "content": "Eurostyle is quite nice.\n\n"
    },
    {
      "time": "22 Aug 2007 — 9:17am",
      "content": "_Really? That’s weird to me - Gates considers oldstyle to \\*not\\* be humanist, and thinks Helvetica \\*is\\* humanist? To me “humanist” proportions are a synonym for what Gates calls “oldstyle.” Other sources I’ve seen dealing with proportion such as the PANOSE system call the proportions based on a tall oval/rectangle “modern” rather than “humanist,” and that is the lingo I’ve adopted as well._\n\nGood grief. Now that I check the Gates book, I see that I remembered it wrong. He doesn't mention \"humanist\" at all in the way I had remembered. He just uses the terms \"even width\" or \"modern.\" I have no idea where I picked that up now. It was what I was thinking when creating Proxima Sans/Nova, but the correct term describing the proportions should be \"modern\" or \"even width.\" I'll fix that in my marketing materials to avoid further confusion. Funny how you get a certain \"fact\" fixed in your head and don't realize it's incorrect until years later, when on hindsight it's so clearly wrong.\n\n"
    },
    {
      "time": "9 Jun 2009 — 3:02pm",
      "content": "Although an old thread, Graphik should be mentioned.\n\n"
    },
    {
      "time": "10 Jun 2009 — 12:40pm",
      "content": "Prelude  \n [http://www.fontbureau.com/news/2009-06-10](http://web.archive.org/web/20150201230727/http:/www.fontbureau.com/news/2009-06-10 \"http://www.fontbureau.com/news/2009-06-10\")\n\n"
    },
    {
      "time": "14 Aug 2009 — 3:04pm",
      "content": "Effra: [http://www.daltonmaag.com/browse/fonts/dama/effra](http://web.archive.org/web/20150201230727/http:/www.daltonmaag.com/browse/fonts/dama/effra \"http://www.daltonmaag.com/browse/fonts/dama/effra\")\n\n"
    }
  ]
}
