{
  "id": "36085",
  "title": "How to construct a monoline font with selectable thickness?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi, I was wondering if it is possible to fashion a monoline font that does NOT scale in thickness when you change its size. Eg the line thickness of a 24 pt glyph would be the same in 35 or 67 or 128 (etc.). Or, to state it differently: I would like to set the stroke for a whole block of text, independent from the glyph sizes…  \nAnd then some more: I would like to be able to set the stroke in my design applications.  \nAnd to make it even more complicated: how about being able to change the line ends (rounded, square, etc.) as one can in Illustrator, FreeHand, cum suis?\n\nMy reasoning: when mixing type sizes in headlines and subs (using a monoline) the effect (and the ’colour’) would be a lot better if the stroke thicknesses did not scale.\n\n [‹ Feijoa gives error in EPS](http://web.archive.org/web/20080104160736/http:/www.typophile.com/node/36032 \"Go to previous forum topic\") [FontLab \"Expand Strokes\": parameter missing ›](http://web.archive.org/web/20080104160736/http:/www.typophile.com/node/29008 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080104160736/http://www.typophile.com/user/3972\" title=\"View user profile.\">bert_vanderveen</a>",
  "time": "<br>",
  "uid": "3972",
  "comments": [
    {
      "time": " 14.Aug.2007 2.36am",
      "content": "Sideline: Funny how the full latin for the abbreviation cs is displayed by this sites engine.\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 14.Aug.2007 6.33am",
      "content": "hello,\n\nI would draw a font as this as possible and then give it a outline in the layout app.\n\nGeorg\n\n"
    },
    {
      "time": " 18.Aug.2007 9.29am",
      "content": "_“I was wondering if it is possible to fashion a monoline font that does NOT scale in thickness when you change its size”_  \nIt is possible several ways. One would need to know if the font was going to appear as a mathematical monoline or an apparent monoline, an optically scaling mathematical or apparent monoline, and the precise sizes and resolutions required. With this, the best way could be specified.\n\nCheers!\n\n"
    },
    {
      "time": " 19.Aug.2007 4.16pm",
      "content": "Lucas de Groot’s Taz has something of this effect.\n\n"
    },
    {
      "time": " 19.Aug.2007 4.17pm",
      "content": "But it’s not automatic, requiring the use of a table, which he provides, giving the stroke thickness at various point sizes, for the different fonts.\n\n"
    },
    {
      "time": " 20.Aug.2007 5.34am",
      "content": "Thanks, David and Nick,  \nI’ll look into Taz.\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    }
  ]
}
