{
  "id": "36098",
  "title": "The New Typography - this was revolutionary?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have been reading Tschichold’s _The New Typography_ and am I bit surprised by it. When the book is written about in historical contexts, it tends to be described as a radical manifesto about design that changed everything with which it came into contact. But to me it just seems like a practical guide to designing legible printed work, preferably according to the new DIN standards. After one gets through the beginning of the introduction Tschichold mellows out, explains everything pretty clearly, and it seems like the only time he gets a little too pedantic it’s because he is trying to force the notion that sanserif type is “objective” or “neutral” simply because technical characteristics make it more appropriate for the time. Everything else is handled with terse matter-of-fact explanations from both business and technical perspectives that make perfect sense.\n\nSo now I am left wondering—did the lack of an English translation prior to 1998 lead American design historians to overstate the importance, or at least the nature, of this book? Or am I just underestimating how horrible design was at the time, so that even a simple little guide like _The New Typography_ really was a radical work?\n\n",
  "author": "<a href=\"/web/20111020223509/http://www.typophile.com/user/14722\" title=\"View user profile.\">Dunwich Type</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": "",
      "content": "It was radical in comparison to what had been going on at the time. There was quite a bit of centered Roman and traditional book typography. This was the new face of modernism pushing up from the earth's crust and crying out for a spot in the sun.  \nToday, after many years of modernism, it seems quite tame. Early on, Elvis could not be shown from the waist down on TV because it was too provacative. Today, that seems like nothing compared to current music.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Not enough designers read that book. To paraphrase it, simplicity and order is best, and fancy effects are unnecessary clutter. Many designers today get caught up in Creative Suite updates, and are innocently convinced that the more they know about CS3, the better designers they become. Trying to employ the available effects can get in the way of developing an understanding of fundamental design rules. I can imagine that the flood of new type and technology in the early 20th century was causing similar problems, and Tschichold was mostly just saying, \"Hey, wait a minute, folks...forget about the bells and whistles for a minute.\" It's a good reminder for all of us today, because our flood of new type and technology is much deeper than it was circa 1925.\n\nBesides that, I don't know if works for everyone, but Tschichold's persnickity nature and blunt matter-of-factness always makes me smile. Maybe it's because he speaks objectively about a topic that lots of people see as subjective, and I find it refreshing.\n\n"
    },
    {
      "time": "",
      "content": "Was is Matthew Carter that said that Helvetica was also considered radical at the time? Or was that in the Helvetica movie?\n\nI have a feeling that our age is finally wanting to revert to pre-modernism in a lot of aspects, just because modernism has been the old boy for quite a while now. Maybe not to something as gaudy as Victorian England, but maybe more toward Gaudy, as in Frederick.\n\nA handmade, letterpress, almost Arts & Crafts-y movement. We're inundated with computers and modern accoutrements everywhere we turn, so it's no wonder.\n\nOn the other hand, technology never moves backwards and men like William Morris are gone, so who will write the next Tschichold-like manifesto that 60 years from now will be taken as matter of fact?\n\n"
    },
    {
      "time": "",
      "content": "There was a guy or two who wrote\" The End of Print\" who may have thought he did write your book.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "<cite>Early on, Elvis could not be shown from the waist down on TV because it was too provacative.</cite>\n\nWhen I went to high school, girls would have been sent to the electric chair for some of what they are wearing to school lately.\n\nIt seems silly, but they couldn't wear pants at all, and their skirts had to touch the ground when they were kneeling. Failing this test meant suspension.\n\nI got kicked out of HS for having hair too long because it was touching my ears (this when the Beatles were in full swing, and I was a musician).\n\nNow anything goes, anywhere, any time, it seems.\n\n"
    },
    {
      "time": "",
      "content": "<cite>...60 years from now will be taken as matter of fact?<br>\n</cite>\n\nWhen we hit chaos, the only revolution will be to order...or am I being short-sighted about the versatility of chaos?  \n; )\n\n"
    },
    {
      "time": "",
      "content": "James, you need to place this book in its historical and social context... It was first published in Germany, at a time when most German books were typeset in blackletter faces, and when the idea of standardization was still new... Some of the Bauhaus principles were revolutionary for the same reason. Herbert Bayer wrote about using only lowercase letters in German, a language in which every single noun is capitalized. Other contemporary movements, such as Constructivism and De Stijl, were also giving shape to modernist design ideas, but it was all pretty new back then. Notice that Tschichold provides an address list of \"New Typographers\" at the end of the book!\n\n(If you haven't, go back and read Robin Kinross's introduction, which covers many of these points.)\n\nTo give you a similar example from the movies... Perhaps you've heard or read about people jumping out of their seats when they saw an approaching train in one of the Lumiere brothers' first films... or about women fainting in the aisles when the original \"King Kong\" was shown in theaters... No one would jump out of their seats today -- we take films for granted.\n\n"
    },
    {
      "time": "",
      "content": "_the only revolution will be to order_  \nThat's the dilemma. The last of the Modernists are still alive and kicking. Modernism=Order. And I fail to see us reverting to Modernism as it has been practiced all these years.\n\nSo what do we have?  \nModernism or \"New Typography\" and Order  \n\"Old Typography\" and Ornament  \nArt Nouveau and Nature  \nArt Deco and the Future  \n\"Grunge\" typography and Chaos\n\nI think that the next wave must ride somewhere in-between the extremes of Rational and Sentimental.\n\nI think the answer lies partly in fontplayer's assessment of modernism and why it was so revolutionary:  \n_\"the idea of standardization was still new\"_\n\nToday, everything is standardized. We have specifications for Opentype and Unicode that will categorize and standardize even the most distressed or grungy of typefaces or scripts that only a master calligrapher could even dream of creating. We have standardized revivals of typefaces that were never standard to begin with, such as Akzidenz Grotesque into Helvetica into whatever.\n\nLayouts now come cut and paste. Design is now a pastiche of standardized \"styles\" of yesteryear.\n\nIf anything, the reason why so many people are looking at letterpress/hand-lettering/etc., is because it is a reaction against the blandness that comes with standardization.\n\n"
    },
    {
      "time": "",
      "content": "Good comments Dan, but I don't agree that standardization necessarily means bland designs. You can still have a bold layout on a magazine or book spread that has an underlying grid in place. And standardized paper sizes, not to mention point systems for measuring type, or font files that work on more than one computer platform, are quite beneficial.\n\nBut in addition to standardization, there has been the democratization of type and design tools, and that has had effects both good and bad.\n\n"
    },
    {
      "time": "",
      "content": "_how horrible design was_\n\nJames, Historicism was the norm in commercial culture, in Western Europe and America, from 1900-1930.  \nIt was a reaction to the messiness of the emergent mass media and its new technologies, a serious, progressive, force. It was in no way traditional, as the very idea, for instance, of reviving centuries old typefaces, and Jenson in particular, was unprecedented, and quite literally radical.\n\nHowever, Historicism was so pervasive and entrenched that its graphic style must indeed have horrified the young and rebellious, so they created its mirror image; out went illustration, symmetry, decoration and serifed types, in came photography, asymmetry, plainness and sans faces. And the myth of Modernism.\n\n"
    },
    {
      "time": "",
      "content": "On a related note, does anyone know where the theory that sans type is objective or neutral originated? From my research it appears to have picked up popularity when it was espoused by Itten and Bayer in the early years at the Weimar Bauhaus, but given their backgrounds and the timing it seems likely that they picked up the idea from the futurists or constructivists.\n\n"
    },
    {
      "time": "",
      "content": "James, this is discussed at some length in the very interesting biography of [Paul Renner](http://web.archive.org/web/20111020223509/http:/www.amazon.com/Paul-Renner-Typography-Christopher-Burke/dp/1568981589/ref=pd_bbs_sr_1/102-9247567-6612147?ie=UTF8&s=books&qid=1187204716&sr=8-1) by Chrisopher Burke. There is an apparently rather untranslatable German word 'sachlich', which they all used, including the Wiener Werkstette. It can mean 'objective' 'relevant' and other things. Burke probably explains who first used it, but I forget.\n\n"
    },
    {
      "time": "",
      "content": "Maybe the later 'Typografische Gestaltung' (published as 'Asymetric Typography') is more of a ‘manifesto’ with emotional language and less of a manual or practical guide: “The period after Didot ended in chaos – complete absence of rules – a mass of types that had outlived their fashion and become valueless – and a generation of compositors who had lost their integrity as craftsmen and degenerated into […] mere apes of artists”.\n\nHe is also important (along with Herbert Bayer) for moving away from centred layouts and opening the door to grid-based design/‘international style’: “[…] it was not so much the part (the type itself) but the whole (the arrangement of the types) that needed reorganizing”. For this he gets a mention in 'Grid Systems in Graphic Design' by Joseph Müller-Brockman (the Ayatollah of functionalism) which opens with praise for Tschichold and his “[…] first steps in the effort to achieve the greatest possible order and economy in the use of typographic resources” even though by this time he had famously changed his mind and gone back to doing vase-symetric page layouts and measuring the page proportions of medieval manuscripts (and would have surprisingly violent arguments with people like Max Bill who he felt had taken his ‘New Typography’ to extremes).\n\n“On a related note, does anyone know where the theory that sans type is objective or neutral originated?”  \nNot an origin, obviously, but there’s an interesting chapter ‘Sans Serif as the expression of our age’ on the subject in ‘The Graphic designer and his Design Problems’ by Joseph M-B (another manifesto). “Lettering should be regarded primarily as a vehicle for ideas, only secondarily as a form of art. Only an unpretentious lettering can perform its function as a medium for lucid expression”…etc\n\n"
    },
    {
      "time": "",
      "content": "Dan\n\nI find your remarks interesting, especially in regard to some recent predictions about where we are. Terms like \"romantic nostalgia\" and \"future shock,\" seem interestingly appropriate, especially when we compare our turn of the century with the previous.\n\nWhere is the twenty-first dictate? I think it is quite clearly here. Social and political awareness, less self-indulgence. One word. Green.\n\nGerald\n\n"
    },
    {
      "time": "",
      "content": "<cite>...did the lack of an English translation prior to 1998 lead American design historians to overstate the importance, or at least the nature, of this book? </cite> I don't think so since by 1959 Tschichold had already given his speech (the famous Gleichschaltung comparison in which he changes his mind, as Simon points out) during the Typography U.S.A seminar promoted by the Type Directors Club in New York. Die Neue Typographie came out in 1928 but in 1923 Moholy-Nagy, (who was deeply influenced by the Constructivists) had already published the article Die Neue Typographie from within the Bauhaus. Tschichold codified the principles but the idea was already there and maybe the first rupture (or revolution as you call it) came with Marinetti's \"Mots en Liberté\".\n\n"
    },
    {
      "time": "",
      "content": "\\> Social and political awareness, less self-indulgence. One word. Green.\n\nBring it on! Now...green can be loosely interpreted as organic, and that's related to this comment from earlier...\n\n\\> the reason why so many people are looking at letterpress/hand-lettering/etc., is because it is a reaction against the blandness that comes with standardization\n\n...which is all fine and dandy, and I suppose I should take this as positive, being that these are my main interests...unfortunately I couldn't figure out how to support my family with those skills and now I sit in front of this blasted puter eight hours a day. Mine eyes are suffering...this type is much too small, I don't care how well it's designed!\n\nAnd going back to Tschichold...perhaps a good goal is trying to marry the clean order of The New Typogrpahy with the Green \"organic-ish\" movement. Is this possible? Let's see some examples if you have 'em, 'eh?\n\n"
    },
    {
      "time": "",
      "content": "_a good goal is trying to marry the clean order of The New Typography with the Green “organic-ish” movement_\n\n1 part Modernist simplicity + 1 part Art Nouveau/Arts&Crafts humanism = ?\n\n"
    },
    {
      "time": "",
      "content": "Well, I sure don't see any flood of entries. Dead topic?\n\nHow about [this](http://web.archive.org/web/20111020223509/http:/www.heavydutypress.com/services/KCF)?\n\nCritique welcome.\n\n"
    },
    {
      "time": "",
      "content": "Even using language used here in this forum (by me!). Right on.\n\n"
    },
    {
      "time": "",
      "content": "I had an intern this Summer and she had never heard of Jan! I had to fix that quick smart - because so very very much of what we take for granted in graphic design came about through his vision & sensibilities. The more you look at his work; and not just in this book, but in general, the more you see his hand in graphic design. It goes on & on. You just have to dig.\n\n"
    },
    {
      "time": "",
      "content": "That was kind of my reaction to _Die neue typographie._ And then I got over the fact that I was reading it in 2007, and that the \"first translation\" I was reading was done sometime in the 1980s. I considered that Tschichold wrote the book in 1938; and that it was, at least partly, a reaction to the overdone ornamentalism--form over substance, it seems to me--of the time. (I mean, just get a load of that Fraktur typeface that was in use back then, prior to the movement Tschichold was part of.)\n\nThat said--and I'm no fan of mindless ornamentalism--the layout of the translation that I read tried hard to be true to Tschichold's principles. Robin Kinross said so in the book's Intro. It was tough reading. A bookful of sanserif text just isn't easy on the eyes. Even Tschichold had second thoughts about some of it, as he famously renounced some of his new typography in later years.\n\nStill, I've been wondering what regard he's held in these days and this thread begins to tll me.\n\nOh, I'm a new subscriber. I've been wondering some about what one goes thru to wake up one morning and say, \"By gum, I want to design a new font.\" So I subscribed to see if anyone will reveal that.\n\nStephen Tiano, Book Designer, Page Compositor & Layout Artist  \ntel. & fax: 631/284/3842  \ncell: 631/764/2487  \nemail: [steve@tianodesign.com](mailto:steve@tianodesign.com)  \niChat screen name: [stephentiano@mac.com](mailto:stephentiano@mac.com)  \nwebsite: [http://www.tianodesign.com](http://web.archive.org/web/20111020223509/http:/www.tianodesign.com/ \"http://www.tianodesign.com\")  \nblog: [http://www.tianodesign.com/blog](http://web.archive.org/web/20111020223509/http:/www.tianodesign.com/blog \"http://www.tianodesign.com/blog\")\n\n"
    },
    {
      "time": "",
      "content": "Welcome Steve!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "“The Form of the Book – Essays on the morality of good design” (with an introduction by Bringhurst) is a great way to get a complete view of Tschichold not just the young radical. The writing is brilliant, but definitely what Michael calls ‘blunt and matter-of-fact’, as though the author is saying “This is the way things are, and I wouldn’t bother arguing because I’m Jan Tschichold”. In it you can see that there might not be quite so much of a contradiction between the Tschichold of “The New Typography”/”Asymmetric Typography” and the Tschichold of later years.\n\n“Typography is a servant, not a master; the right gesture is invariably defined by expediency. […] there is no real disparity between apparently symmetrical typography and the uncentered kind. These arrangements and all their varieties may be suitable for the job at hand, or they may be not. We can only hope that the results in each case are beautiful”.  \n(1965)\n\n"
    },
    {
      "time": "",
      "content": "_if anyone will reveal that._\n\nMany people have found the Critique section helpful in developing their fonts, for instance Randy Jones and his Eason.  \nI've been making fonts for years but still frequently ask questions in the Build section, and try to help there when I can.\n\n"
    },
    {
      "time": "",
      "content": "I read the book a few years ago (the original German version typeset by the author himself, which functions as an example of what the book teaches) after I'd read quite a lot about Jan Tschichold and this book of his. I was very troubled by the fact that I instantly disagreed with many principles Tschichold was trying to preach -- my enormous respect for its author (and thus a certain bias in his favor) none withstanding. To my relief, I eventually learned that Tschichold himself, in his later years, renounced a large portion of the book.\n\nWhat I'm trying to say is, the content of the book really appeared extremely radical to me (perhaps because I've always been a fan of the Classics and disliked the Modern). But we are surrounded by modern design nowadays -- it has gained an overwhelmingly dominant presence over the classic styles in our daily live. So if people like me, who are used to the Modern, still consider The New Typography radical, is it hard to imagine how radical it looked to people of that time?\n\nNow, years after reading the book, my opinion about it has actually improved -- I no longer oppose some of the content as strongly as I did. I think this book was really \\*way\\* ahead of its time. Consider this: Less than ten years ago, the majority of magazines were still set in serifs, today at least every second one has switched to sans serif. So it wouldn't surprise me if the a new pilgrimage towards The New Typography would develop within the typography community in the close future -- almost a century after the publication of the book.\n\n"
    },
    {
      "time": "",
      "content": "@Steve Tiano  \n_just get a load of that Fraktur typeface that was in use back then_  \nI totally forgot the context in which a German would have been writing! He wasn't in America with Goudy typefaces or Jenson revivals.\n\nTHAT makes much more sense.\n\n@henrypijames  \n_a new pilgrimage towards The New Typography_  \nWere there aspects of the New Typography that weren't ever really in use? I understand that in the days of metal type-setting, you HAD to do things certain ways. But now with digital, it is possible to do whatever we want.\n\nIf things start returning toward a Tschicholdian manner, hopefully it is in his SPIRIT and not in the outward trappings of Modernism.\n\n"
    },
    {
      "time": "",
      "content": "Well, I'm certainly disgusted by the overly use of sans serifs nowadays. So it's not that I \\*wish\\* for a new pilgrimage towards The New Typography (I'd rather not use the term \"Tschicholdian\" as the man has stood for quite different -- contradicting -- design principles during his lifetime), it's that I'm afraid (a bit terrified even) it will come, to make The New Typography -- radical as it is -- finally mainstream.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the welcome, Chris.\n\nYes, Dan, Tschichold _really_ was making a run at readability. It does, tho', crack me up a little how damned earnest he sounded in the book. No wonder they considered him kind of a cultural Bolshevist. Then, too, what a blow it must have been to the left-wingers when he circled back a little and later renounced a bit of the new typography. I just can't get with how in tune typography could have seemed to the political scene. Then again, what a life-and-death climate there was in Germany back then!\n\nI'm not at all thrilled with sans serif in long stretches of text—certainly not as a main body text. But short of that, I like the look of many san serif fonts themselves. (I still never get tired of the opportunity to use Futura.) I think what Tschichold was advocating has, for the most part, been mainstreaam--maybe even back and forth already a number of times—for years. If you're waiting to be terrified, don't sneeze. Else you'll blink your eyes and miss it again.\n\nGranted, I'm not a type designer. But as a book and page designer, I just can't see any way but that form must follow function. A _close_ second place, to be sure; but still second. I see my calling as displaying the author's \"wine,\" if you will in Beatrice Warde's crystal goblet. I've been writing about that since long before I had the Warde essay brought to my attention yesterday or the day before (and long before I started blogging on design, freelancing, and yadda yadda). And I also see myself having an obligation to make the reader's experience—their physical act of reading—an easy, pleasurable one, to the extent that I can.\n\nIt is—despite whatever \"adjustments\" the man made to some of his earlier holdings—I think, only fair to credit Tschichold for that. It seems like common sense to me that I feel responsible to those two entities: author _and_ reader. But I think \"Tschicholdian\" is not a knuckleheaded tribute to someone who was in the vanguard on that account before I was even born.\n\n"
    },
    {
      "time": "",
      "content": "Now that this this thread is really hotting up - I want to ask about an impression I have vis a vis Jan.\n\nI have the definite impression that the whole modern 'juxtaposing text-on-Image visual trope' comes directly from him. Anybody disagree? Can you back it up? Note: the 1st historical example I know of was 1938! If this is right, to me that is HUGE. Because I would say easily 50% of modern design descends from that model. Maybe I am just in a hyperbolic mood but thats how it looks to me just now. What do you think?\n\n"
    },
    {
      "time": "",
      "content": "Take a look at Rodchenko, Eben. The Russiansseem to be the first to super type on image. I have 1923 exmples in a book somewhere.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Eben,  \nHere is a scan of two pages from 1922 and 1919 respectively. There are hundreds more in any book on Rodchenko.\n\n ![](http://web.archive.org/web/20111020223509im_/http:/typophile.com/files/Rodchenko2Pages_5369.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "_Were there aspects of the New Typography that weren’t ever really in use?_\n\nA lot of the rhetoric of the time was future-oriented, talking about NT as the place where typography was GOING, not where it was. For example, doesn't Tschichold say that the sans-serif IDEA is most suited for the NT, but the currently existing sans-serif designs weren't quite there yet?\n\n"
    },
    {
      "time": "",
      "content": "\"For example, doesn’t Tschichold say that the sans-serif IDEA is most suited for the NT, but the currently existing sans-serif designs weren’t quite there yet?\"\n\nTrue—Much of the dogmatic side of NT, particularly regarding sanserif type, was focused on the future. This was because the grotesks were still too human (one could see Tschichold as wanting Helvetica/Univers thirty years early) and because many printers still had no sanserif type in text sizes, and if they did, it was awful stuff.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Chris! Rodchenko is almost doing the thing I have in mind so it's a great example, but that isn't quite the same.\n\nI will see if I can find the image that convinced me that a this certain Archetype had in fact been coined by Jan. I think the image is back at the library though.\n\nIf somebody own the book & can scan it - it is a street scene with 'knock out' white text.\n\nAnyway, I am still interested to see if you all agree or not & why.\n\n"
    },
    {
      "time": "",
      "content": "_I have the definite impression that the whole modern ’juxtaposing text-on-Image visual trope’ comes directly from him. Anybody disagree? Can you back it up?_\n\nEben, I believe Laszlo Moholy-Nagy was [**writing about this**](http://web.archive.org/web/20111020223509/http:/modernism101.com/moholy_malerei_foto_film.php) during the early years of the Bauhaus (1927).\n\n"
    },
    {
      "time": "",
      "content": "Dan said...\n\n_\"@Steve Tiano_  \njust get a load of that Fraktur typeface that was in use back then\n\n_\"I totally forgot the context in which a German would have been writing! He wasn’t in America with Goudy typefaces or Jenson revivals._\n\n_\"THAT makes much more sense.\"_\n\nDan, I said pretty much the same thing in the 7th response to this thread!: **\"It was first published in Germany, at a time when most German books were typeset in blackletter faces...\"**\n\n"
    },
    {
      "time": "",
      "content": "_\"I have the definite impression that the whole modern ’juxtaposing text-on-Image visual trope’ comes directly from him. Anybody disagree? \"_\n\nYep.\n\nJan's graphic comment was late buy about 300 hundred years or so, give or take a decade. And one of many well known expression of text-on-image is the, \"...famous anthology combines some of the finest calligraphy of Hon'ami Koetsu with the brilliant painting of Tawaraya Sotatsu (active from 1602 to 1635).\"\n\n[http://www.kyohaku.go.jp/eng/syuzou/meihin/kaiga/kinsei/item02.html](http://web.archive.org/web/20111020223509/http:/www.kyohaku.go.jp/eng/syuzou/meihin/kaiga/kinsei/item02.html \"http://www.kyohaku.go.jp/eng/syuzou/meihin/kaiga/kinsei/item02.html\")\n\nThese guys - the western designers and painters - didn't live in a vacuum, which was clearly stated by some Dutch painters Van Gogh amongst them. Japanese arts and crafts had a huge impact on the western world, especially on guys like Gropius (who wrote extensively on Japanese art and architecture and on the impact thereof) & co. Trade with Japan, especially by the Dutch, had been bringing back Japanese arts and crafts for hundreds of years before any Euro -ism was ever conceived.\n\nFor the western world, it's was a small step to go from calligraphy-on-image \\>\\>\\> text-on-image.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for that link, Hiroshige!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "<cite>“It was first published in Germany, at a time when most German books were typeset in blackletter faces...”</cite>  \nRicardo covers it very well. In fact James' questions have been already answered.\n\nJapanese were a huge influence also in the States in Frank Lloyd Wright's work.\n\nAlso check out Marinetti's work. This is 1918-1919!  \n [http://www.colophon.com/gallery/futurism/7.html](http://web.archive.org/web/20111020223509/http:/www.colophon.com/gallery/futurism/7.html \"http://www.colophon.com/gallery/futurism/7.html\")\n\n"
    },
    {
      "time": "",
      "content": "You can find examples of text and image combined, and of collage, in many cultures in many times.  \nPhoto-process as part of the print production process preceded halftones, so when halftones came into use in magazines around 1885, one would expect to find examples of type knocked out.\n\nHalftones were not preferred to illustrations until later in the 1920s, for various reasons.\n\nYou have to have another reason to do something like that, and suitable type. So I think that this example, from 1905, is interesting. Firstly, Cheltenham is a sturdy typestyle with no hairlines, so it's suitable to the task. Secondly, this was the era when movies became a craze -- the Nickelodeons -- and there is something of the white-on-black lettering of the intertitle in this ad.\n\n ![](http://web.archive.org/web/20111020223509im_/http:/typophile.com/files/pearline_4650.jpg)\n\n"
    },
    {
      "time": "",
      "content": "@Ricardo  \nOh man, do I ever feel foolish. You're totally right. I must not have been paying attention as well as I should. I apologize.\n\n"
    },
    {
      "time": "",
      "content": "The Chinese have been hand-drawing and printing simple (or sometimes not so simple) motifs on their expensive letter sheets (mainly rice paper or silk) for one and a half \\*millennium\\* now. Called \"flower sheets\", they originated in the 5th century and become widespread in the 6th. When you write on such a sheet, you got text on top of graphics.\n\nBelow is an antique flower sheet featuring birds, here one is supposed to write around the motif:  \n ![]()http://www.cnartw.com/cweb/history/2001-06/hj2.jpg  \nI myself designed a set of flower sheets for members of my family a few years ago, using \"split corner motifs\" -- motifs that occupied the top right and bottom left corners, while both parts maintained a relation to each other. The series of motifs were all traditional Chinese inkbrush landscape, drawn by my farther specially for that purpose. I scanned the drawings, composited the pages in InDesign and printed them with BW laser printer on high-quality (commercial) watermarked sheets, which were then used for handwritten letters. I'd love to show one here, but I just can't find those files in my archive right now.\n\nHere is another exquisite antique example -- a rather excessive one (yes, that's really a \"blank sheet\"):  \n ![]()http://www.cnartw.com/cweb/history/2001-06/hj1.jpg  \nOne couldn't avoid writing over the drawing in this case now as it covers the whole sheet.\n\nNow, the kind of flower sheet that's commonly available nowadays:  \n ![]()http://www.ywsl.com/bookpic/upfile/20062173254292509.JPG  \nThis is a \"stamp booklet\", so the red stamps aren't an original part of the sheet, and the right-hand page has been left blank. Orchid and bamboo -- two of the most basic motifs of traditional Chinese drawing -- have long become the most common background themes for flower sheets.\n\nIn related matter, when did the Europeans start using graphically watermarked letter sheets? Were there ever watermark graphics that were somewhat complex and covered a significant portion of the sheet?\n\n"
    },
    {
      "time": "",
      "content": "It was a big jump from the hand-lettered posters of the Asian-influenced Lautrec and others like him to the posters and other information graphics that required a grid ALA Tschichold.\n\nFor the first, it's pretty much however you wanted it to go since everything was custom. But you could never do a complex information system in that way.\n\nAnother thing we need to keep in mind was that information graphics previous to this time were all over the place.\n\n"
    },
    {
      "time": "",
      "content": "Dan: _Oh man, do I ever feel foolish. You’re totally right._\n\nNo worries, Dan. Thanks. :-)\n\n_It was a big jump from the hand-lettered posters of the Asian-influenced Lautrec and others like him to the posters and other information graphics that required a grid ALA Tschichold._\n\nIndeed, and I think that Eben was asking about the first time this was done in print, not in a painting -- Nick and Lore have addressed this aspect.\n\n"
    },
    {
      "time": "",
      "content": "<cite> Yep. </cite>\n\n<cite> done in print, not in a painting </cite>\n\nNeil, I can see that I am going to have to get the example to make the point I am trying to make. Of course you have had words & images in various ways in various cultures. Your points are good ones too. However, even beyond the media I am thinking of a very specific way of doing this ( I think so anyway ) which has stuck around & become the default mode in graphic design. So much so that when I do finally get this image I suspect 99% of us would say - 'so what?' that is until you see the date next to it. Anyway. ASAP I will post an image.\n\nBut in support of Neil's point, and to prefigure what I hope to show - I would have to say that the thoughtful and sensitive and resonant positioning of text in image that we see with Neil's image isn't standard in western layout until after Jan T.\n\nNick's example is great I think because it shows that the positioning is getting careful/deliberate at this point but it's also a bit forced compositionally speaking. What Dan is saying about grids may be going on too. I have to admit I am not 100% sure about that though.\n\n"
    },
    {
      "time": "",
      "content": "Eben, the western world's lust for the machine, (especially from the mid-nineteenth century to the mid-twentieth century) has produced its fair share of signatures. Composing with 3d and 2d elements (text and image, but to be simplistic - line and gradient) is old story with an ever fresh face. I look forward to seeing your examples.\n\nChris, glad you liked the link! Japan's Momoyama and Edo periods seemed to be a very exciting times.\n\nLore, thank's for the link. Marinetti's futurist work is interesting stuff. Especially his Zang Tumb! And I could talk about FLlW for days on end.\n\nHenry, great stuff!\n\n"
    },
    {
      "time": "",
      "content": "_the first time this was done in print, not in a painting_  \nThat's my point, actually. All of that Asian influence was on the painters of the era, to the woodblock printers, and slowly down the chain to the commercial graphic design.\n\nIt's the commercial graphic design and information systems that had the most profound changes, but the division between them and any Asian influence is vast.\n\nPerhaps the Asian influence did affect the Germans and Swiss, but I was under the impression that the Japanese and Chinese influence was primarily on the coastal countries.\n\n"
    }
  ]
}
