{
  "id": "36095",
  "title": "Type Designer Interviews",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi All,\n\nI started a series of short interviews with type designers on my design studio's website.\n\nWe're based in Tokyo, and the primary goal of the articles is to introduce some contemporary western typefaces and designers to Japanese designers who may have a hard time finding information about these typefaces in their language. All interviews are available in Japanese and English.\n\nHere are the first four in the series:\n\n[Chester Jenkins on Galaxie Polaris](http://web.archive.org/web/20150418125723/http:/www.aqworks.com/2007/08/14/facetime-4-type-designer-chester-jenkins-on-galaxie-polaris/)  \n [Jarno Lukkarila on Xtra Sans](http://web.archive.org/web/20150418125723/http:/www.aqworks.com/2007/07/31/facetime-3-type-designer-jarno-lukkarila-on-xtra-sans/)  \n [Jeremy Tankard on Bliss](http://web.archive.org/web/20150418125723/http:/www.aqworks.com/2007/07/28/facetime-2-type-designer-jeremy-tankard-on-bliss/)  \n [Eric Olson on Klavika](http://web.archive.org/web/20150418125723/http:/www.aqworks.com/2007/07/23/facetime-1-type-designer-eric-olson-on-klavika/)\n\nWe have two more interviews on deck for this month, so enjoy, and please send me any feedback you may have.\n\nChris\n\n",
  "author": "cpalmieri",
  "time": "14 Aug 2007 — 9:20am",
  "uid": "1956",
  "comments": [
    {
      "time": "14 Aug 2007 — 10:07am",
      "content": "Thanks for letting us know about these.\n\n"
    },
    {
      "time": "14 Aug 2007 — 10:34am",
      "content": "The interviews are good reads, but honestly, some of them are a little lightweight. Chester's interview has some really good parts (Galaxie Polaris as a 21st century typeface, how it compares to other grotesques), but, being a huge fan of Jeremy Tankard, I wish that the questions went beyond just Bliss to his other projects. Nevertheless, I'm adding the blog to my feedreader.\n\n"
    },
    {
      "time": "14 Aug 2007 — 11:50am",
      "content": "The interviews are pretty short, i would have loved to go deeper in the designer's process but it's still cool to read some words especially from relatively young designers. Didn't even knew Jarno Lukkarila. Btw, the link [http://www.jarnolukkarila.com/](http://web.archive.org/web/20150418125723/http:/www.jarnolukkarila.com/ \"http://www.jarnolukkarila.com/\") is wrong on the website.  \nThanks\n\n"
    },
    {
      "time": "14 Aug 2007 — 12:16pm",
      "content": "I agree iwth XY ( Yassin Baggar I presume? ) a longer interview would be great for the future.\n\n"
    },
    {
      "time": "14 Aug 2007 — 1:31pm",
      "content": "Right!\n\n"
    },
    {
      "time": "14 Aug 2007 — 1:44pm",
      "content": "Actually, and \\*if\\* you want suggestions for questions to ask I am sure Typophile readers would have some.\n\n"
    },
    {
      "time": "14 Aug 2007 — 1:55pm",
      "content": "I really like this paragraph from the Tankard interview:  \n\\> **How important is it for designers to understand typographic history when choosing to use Bliss? If it “just works” for a project, is that also OK?**\n\n\\>The history element is the way I work. I, like many designers, can not design in a vacuum. I believe that we learn from the past in order to design for the future whilst working in the present. The history of type is fascinating and is constantly evolving. This is all wrapped up in my appreciation of type and my day to day work with type. It doesn’t necessarily matter that a designer using Bliss (or another other type) should know its history, but as it is part of its design, it’s story may as well be passed on. Sometimes the history of a type (its heritage if you like) can be of great benefit in convincing a client that it is the right type for them to invest in and use.\n\nI like that line of reasoning.\n\n"
    },
    {
      "time": "14 Aug 2007 — 5:43pm",
      "content": "Thanks everyone for the feedback, especially the broken link tip.\n\nAbout the 'lightweight' or short length of the interviews. There are two reasons for this.\n\n1. My target audience for these is the average Japanese graphic designer, who is coming to the site with a lot less knowledge of the history, terminology, and state of the art of western typeface design.\n\nThe shorter length and mostly simple questions allows these readers to pick up a few points of interest about each face, learn a few things about type design in general, before moving on to other sites to find out more about both.\n\n2. My experience interviewing designers for magazines has been that they are often very busy people with erratic schedules. I wanted the interviews to be something that they could complete in half an hour, perhaps instead of reading RSS with their morning coffee.\n\nThe result, many were very busy with the rest of their job, but almost everyone I contacted answered my questions thoughtfully within a week or so. A few generous designers (like Chester) invited follow-ups, which is why some are longer than others.\n\nOur website is not exactly the New York Times, so I appreciate that they took the time they did.\n\n---\n\nOn another note, since you graciously offered, I'd like to ask a bit of advice:\n\n1. I'm going to stop this series at six designers. But if I did it again in 3 months, who else would you like to see interviewed?\n\n2. I'm thinking of doing a similar series on Japanese contemporary typefaces and designers. Would this interest you? What types of things would you want to know about them?\n\n"
    },
    {
      "time": "14 Aug 2007 — 9:29pm",
      "content": "Thanks for the insight.\n\nQ1: Many many of them but off the top of my head: Frantisek Storm, Martin Majoor, Fred Smeijers, Kris Sowersby\n\nQ2: Yes I would be interested. I wish I had better insight into the issues in their work - and clearly your interview structure isn't the place to find out. I would be interested in How they see western Glyphs and what they like making best - and why. For subjects : How about Kunihiko Okano?\n\n"
    },
    {
      "time": "14 Aug 2007 — 10:28pm",
      "content": "Thanks Eben,\n\nI think I'll change my interview structure for the Japanese designer version. Some of my questions from this series just wouldn't make sense.\n\nDo you have a link for Kunihiko Okano? Google isn't finding much. . .\n\n"
    },
    {
      "time": "15 Aug 2007 — 12:38pm",
      "content": "I met him at Typecon in Seattle. He worked on the Axis font family.\n\nI got to talk with him quite quickly. I would like to know more.\n\n[https://www.axisfont.com/index.php](http://web.archive.org/web/20150418125723/https:/www.axisfont.com/index.php \"https://www.axisfont.com/index.php\")  \n [https://www.axisfont.com/qa.php](http://web.archive.org/web/20150418125723/https:/www.axisfont.com/qa.php \"https://www.axisfont.com/qa.php\")\n\nThis is the company that makes it\n\n[http://www.typeproject.com/index.html](http://web.archive.org/web/20150418125723/http:/www.typeproject.com/index.html \"http://www.typeproject.com/index.html\")\n\nThis is not it\n\n[http://www.myfonts.com/fonts/t26/axis/](http://web.archive.org/web/20150418125723/http:/www.myfonts.com/fonts/t26/axis/ \"http://www.myfonts.com/fonts/t26/axis/\")\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:45pm",
      "content": "I talked with Kunihiko Okano for a good half an hour at TypeCon, looking at his work a fair bit. He's talented and enthusiastic. Plus, he said nice things about Hypatia, so he must be okay. :)\n\nContact me by email if you want his email address.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "15 Aug 2007 — 2:39pm",
      "content": "BTW - I really like the favorite glyph question. I hope you keep that.\n\n"
    },
    {
      "time": "15 Aug 2007 — 4:16pm",
      "content": "Oh cool, I know AXIS, though I didn't know the person behind it. He's definitely going on the short list.\n\np.s. the favorite glyph question will probably be even harder for Japanese designer, but it's not going anywhere : )\n\n"
    },
    {
      "time": "16 Aug 2007 — 8:38am",
      "content": "Sorry if my comment came off a bit harsh, Chris -- I had thought of the reasons you mentioned as to the length of the interviews as I posted, but forgot to mention that I had considered them. Any interview is better than no interview, and these are very interesting interviews at that.\n\nI'd love to see Christian Schwartz answer a few questions, maybe Joshua Darden, Xavier Dupre, and Jean-Francois Porchez, too. I'd be very much in favor of Eben's suggestions also. And Akira Kobayashi could be a good \"in-between\" interview for the site.\n\n"
    },
    {
      "time": "16 Aug 2007 — 9:43am",
      "content": "Interview Joachim Muller-Lance, who designs typefaces in Latin and Japanese character sets from the beginning. He would probably have interesting insights, in the same way Akira would.\n\n"
    },
    {
      "time": "19 Aug 2007 — 5:36pm",
      "content": "Thanks everyone for the designer suggestions, I'm vigorously taking notes.\n\nAuricfuzz, your comments weren't harsh at all, no worries.\n\n"
    }
  ]
}
