{
  "id": "361",
  "title": "Logo/type style guide",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hi! does anyone know of any online examples of style guides for logos? I need to do quite a comprehensive one for a client.   \nI'm also wondering about the legalities of using a designer font in a logo, does the client also need to own the font?\n\n",
  "author": "natalija",
  "time": "16 Jun 2003 — 7:58pm",
  "uid": "1750",
  "comments": [
    {
      "time": "16 Jun 2003 — 10:14pm",
      "content": "Try this site. You can download standards manuals of large corporations here. Very useful: [http://www.identityworks.com/tools/manuals.html](http://web.archive.org/web/20131018231116/http:/www.identityworks.com/tools/manuals.html)   \n   \nAnd this... [http://www.mdnstudio.com/t36/writing-index.html](http://web.archive.org/web/20131018231116/http:/www.mdnstudio.com/t36/writing-index.html) (I haven't read it yet...)   \n   \nK.\n\n"
    },
    {
      "time": "17 Jun 2003 — 8:38am",
      "content": "awesome keith! thanks x.\n\n"
    },
    {
      "time": "17 Jun 2003 — 2:29pm",
      "content": "This \\*is\\* a great resource Keith. Thank you!\n\n"
    },
    {
      "time": "18 Jun 2003 — 10:58pm",
      "content": "\\>I'm also wondering about the legalities of using a designer font in a logo, does the client also need to own the font?   \n   \nno. but you should almost never use an existing typeface for a piece of display type, such as a trademark. the client is paying you to produce a piece of unique and ownable type, not trade gothic. it's harder for a company to really own something that 5000 other companies own as well.\n\n"
    },
    {
      "time": "18 Jun 2003 — 11:04pm",
      "content": "Agreed for the most part. But, sometimes is about how you use the type that counts. Hand- or computer-lettering is a diminishing skill. Do they even teach it at colleges any more? A lot of graphic designers don't have the eye or the skills for drawing new letterforms. I think basic calligraphy and lettering skills should still be taught at design schools. Graphic designers simply take ready-made type for granted these days with the computer.\n\n"
    },
    {
      "time": "18 Jun 2003 — 11:16pm",
      "content": "i agree one hundred percent keith and yes some schools do still teach hand lettering. it was a mandatory part of the curriculum at (dare i say it) art center. it also happens to be the course i teach up here.\n\n"
    },
    {
      "time": "18 Jun 2003 — 11:31pm",
      "content": "That's great, Jay. How do you teach it? Do you start with a broad-edge pen? What books do you use? My guess is you use Doyald Young's books. Do you think calligraphy is important to the understanding of letterforms? Do you always start with pencil and paper then digitize with beziers? Do you use historical sources? I'm interested to know as much as possible, as I'm really eager to incorporate it into my type course in September.\n\n"
    },
    {
      "time": "18 Jun 2003 — 11:31pm",
      "content": "I have to add my 2 cents on this one.   \nI agree that it isn't ideal if designing a very type based logo to just choose a font. I wish I had the ability (and time) to design type for clients. and then there is the issue of a client having enough money to have a custom designed font!   \nInstead I focus mostly on symbols which leads to font choices - not a quick decision by any means...   \n   \nAs a graphic designer not a type designer - I feel my role is to look through the foundaries and pick the most appropriate font - and to make it quite unlike 5000 other logos that may use that font? which if true, means I probably would not have chosen it...   \nI do wish I could do it all...\n\n"
    },
    {
      "time": "19 Jun 2003 — 9:03am",
      "content": "natalija, there was a day when the only efficient way a graphic designer could produce trademark designs was to hand draw them. this was an important skill that designers needed to have. i don't feel it is impossible to be a designer and produce unique display types. i can attest to this in my class as well. each semester i have a random grouping of lower term students who have little or no experience with this stuff. i am always amazed that when shown a few simple procedures their world of typography and their skill in seeing type harmony blossom. through their diligent work i have seen some amazing success stories.\n\n"
    },
    {
      "time": "19 Jun 2003 — 9:58am",
      "content": "keith, that's great that you are looking into teaching hand lettering. i think it's an important element to a designers career. it has been a subject that i devote a full term of study to. i can't imagine trying to fit it into a class as a single small project. i've noticed that students don't fully get most of the major principles until about there third project. i'll give you an ultra quick run down of how i teach the subject.   \n   \n1-i present the major differences between display types and text types. i then lay out the playing field, getting into typeface classifications and text types. my hope is to let them see that by drawing display types they are only working on a small section of the subject of type. each project runs for about three class periods. each class is a crit.   \n2-we start breaking right into it. no time to waste the term is fairly short the class is usually full and the subject is large. i give them there first assignment which is to do a set of initials. i start small.   \n3-next assignment is to letter a proper name. this gives them more letterforms they need to deal with.   \n4-last project is to do a made up name of there choosing. this is meant to let them have fun and pursue their own interests. this project also runs parallel with a business papers project utilizing one of the marks they done during the class.   \n   \nall assignments are done on tracing paper at larger size. they do 15-20 comps each time until they narrow in on something successful. finals are either rendered on velum with ink or can be moved on to the computer if their skills are competent enough. it's hard but i have little time to help students by teaching a class on illustrator as well.   \n   \ni don't introduce students to the art of calligraphy or the use of broad nib pens unless their specific project requires it. i love this area of study but feel that one would have to devote a whole term at least to it.   \n   \nas far as books are concerned, i use elements from both \"trademarks of excellence\" and \"fonts and logos\". doyald young was an instructor of mine back in school and my class follows his teachings on many levels.\n\n"
    },
    {
      "time": "19 Jun 2003 — 10:12am",
      "content": "\\> present the major differences between display types and text types.   \n   \nEven more important: the difference between lettering and type. It's essential.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jun 2003 — 10:28am",
      "content": "you are correct. they are both covered and fall into similar categories as far as i'm concerned. display type with a heavy emphasis on hand lettering.\n\n"
    },
    {
      "time": "17 Jun 2003 — 4:14pm",
      "content": "Natalie wrote:   \n_I'm also wondering about the legalities of using a   \ndesigner font in a logo, does the client also need to   \nown the font?_      \n   \nNo.\n\n"
    }
  ]
}
