{
  "id": "36108",
  "title": "ewedding logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I've been asked to redesign the logo for [ewedding.com](http://web.archive.org/web/20131019185030/http:/www.ewedding.com/) to make it a bit more elegant, refined, and \"Martha Stewart-esque\". Every icon I came up with came across as a little bit trite or cheesy (rings, flowers, birds, etc), so instead, I've tried to come up with a solution that just type based.\n\nThe custom W is an attempt to portray togetherness, closeness, and maybe even a stylized knot.\n\nI'm not sure if Clarendon is the right typeface to be using, and was hoping for some suggestions on other fonts that already have a loop in the W. Or even other fonts that might work for this.\n\nSo... does it work? If so, any ideas on how to refine it even more?\n\nThanks!  \nJesse\n\n| Attachment | Size |\n| --- | --- |\n| [ewedding - Clarendon](http://web.archive.org/web/20131019185030/http:/typophile.com/files/Picture%202_44.png) | 7.46 KB |\n| [ewedding - Rockwell](http://web.archive.org/web/20131019185030/http:/typophile.com/files/Picture%204_13.png) | 5.56 KB |\n| [ewedding - Clarendon (revised)](http://web.archive.org/web/20131019185030/http:/typophile.com/files/Picture%205_6.png) | 4.73 KB |\n| [ewedding - Clarendon w/colour & tagline](http://web.archive.org/web/20131019185030/http:/typophile.com/files/Picture%2014_2.png) | 12.61 KB |\n\n",
  "author": "Jesse Bennett-C...",
  "time": "14 Aug 2007 — 1:07pm",
  "uid": "2331",
  "comments": [
    {
      "time": "14 Aug 2007 — 1:52pm",
      "content": "I like it a lot, though the loop is used so much today by dozens of 'ribbon awareness' programs that it might be a bit overused.\n\n"
    },
    {
      "time": "14 Aug 2007 — 2:31pm",
      "content": "Thanks for the feedback auminum...\n\nI've attached a Rockwell version, and I've added a revised Clarendon one as well.\n\nJesse\n\n"
    },
    {
      "time": "14 Aug 2007 — 3:43pm",
      "content": "I prefer the way the Rockwell version overlaps - it's more consistent with how you'd draw it by hand.\n\n- Lex\n\n"
    },
    {
      "time": "15 Aug 2007 — 12:27am",
      "content": "[Sauna](http://web.archive.org/web/20131019185030/http:/www.myfonts.com/fonts/underware/sauna/) might be an option. [Leitura Display Swash](http://web.archive.org/web/20131019185030/http:/www.myfonts.com/fonts/dstype/leitura-display/swashes/) has the looped W you are looking for.\n\nSharon\n\nHmmm...leitura looks a bit much in this context.\n\n"
    },
    {
      "time": "15 Aug 2007 — 12:46pm",
      "content": "I like it a lot too. I prefer Claredon over Rockwell. Claredon has a much softer feel then Rockwell. The loop reads better and is more distinguished in Claredon then Rockwell. The Rockwell version feels like the loop gets lost. The weight in Claredon works nicely. The symbolic meaning comes across pretty clear. Having the word 'wedding' in the logo really drive the message home.\n\nmg\n\n"
    },
    {
      "time": "15 Aug 2007 — 2:38pm",
      "content": "Thanks for the feedback. I've been wrestling with it all day, and hola's comments just brought me around full circle. I think in the context of a wedding site, and with the word \"wedding\" right there, it just might work.\n\nI've attached another version with a tagline and some colour.\n\nI'd appreciate any additional thoughts..\n\n"
    },
    {
      "time": "15 Aug 2007 — 3:03pm",
      "content": "okay. 2 things.\n\n1. The tinting of letters is not really working for me. They kinda look like a mistake. I do like the softer color you used. Did you not like it as solid color?  \n2. Adding a second graphic to the logo type kinda cheapens the logo. You might not need the sale tag graphic.\n\nmg\n\n"
    },
    {
      "time": "15 Aug 2007 — 11:03pm",
      "content": "I really like the last one, but wish there wasn't so much variation of the peach. It's really good though. Be proud!\n\n"
    },
    {
      "time": "17 Aug 2007 — 5:52pm",
      "content": "I think the \"W\" could be more swashy -- it would add a lot of elegance to the whole logo.\n\n"
    }
  ]
}
