{
  "id": "36100",
  "title": "Font Licensing for Interactive Kiosk?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I'm currently working on a project for an interactive kiosk that is intended to be in shopping malls, airports, etc. The project uses the Emigre Cholla Slab Bold font to display dynamic text in some of the fields. My client just sent me a super panicky email that we shouldn't use the font due to Emigre charging a licensing fee for every computer kiosk it's on and it would drastically blow up the price of the project and we should go with a freebee font like Georgia instead. I've been working with fonts for decades and have never heard of this and while there is licensing info on Emigre's site, I wonder how serious this is and much it is enforced? While I've never done a kiosk before, I've done a bunch of Flash projects using embedded fonts to display dynamic text fields and I've never had the font police come out to get me.\n\nSo has anyone had experience like this? And if we do have to switch fonts does anyone know of a font like Cholla I can use without these licensing issues?\n\n",
  "author": "datatv",
  "time": "14 Aug 2007 — 10:41am",
  "uid": "20725",
  "comments": [
    {
      "time": "14 Aug 2007 — 11:25am",
      "content": "I can't comment on the licensing issues, but as far as alternatives goes, perhaps [Neutraliser Serif Bold](http://web.archive.org/web/20131012141713/http:/www.myfonts.com/fonts/hamburger/neutraliser-serif/) (Stuart Brown) shares similar qualities, though it has a higher x-height\n\n"
    },
    {
      "time": "14 Aug 2007 — 11:27am",
      "content": "If Emigre says that's the licensing terms, then that's the licensing terms. However, I'd like to think they'd consider some sort of site/bulk licensing for a project like this. You might want to call them and ask.\n\nIf you're are willing to stay within the ballpark style-wise, there is a great free typeface called Kontrapunkt (named after the firm that designed it) though, of course, it isn't nearly as large of a family as Cholla is.\n\n[http://www.kontrapunkt.dk/news/ddprize\\_typeface\\_of\\_the\\_year\\_2004](http://web.archive.org/web/20131012141713/http:/www.kontrapunkt.dk/news/ddprize_typeface_of_the_year_2004 \"http://www.kontrapunkt.dk/news/ddprize\\_typeface\\_of\\_the\\_year\\_2004\")\n\n"
    },
    {
      "time": "14 Aug 2007 — 12:18pm",
      "content": "Hey, thanks for the info on Kontrapunkt! That's a lot like what I'm looking for if we do go the replacement route.\n\n--  \nAdam Bell  \ndataTV  \n [http://datatv.com/](http://web.archive.org/web/20131012141713/http:/datatv.com/ \"http://datatv.com/\")  \ndzign AT datatv DOT com  \n--\n\n"
    },
    {
      "time": "14 Aug 2007 — 1:41pm",
      "content": "There’s a big difference between a Flash file (where font embedding is generally accepted even if it often goes beyond many font EULAs or the embedding permissions encoded within the fonts) and installing the font on a bunch of kiosks. Would you consider it acceptable to stick unlicensed OS’s, music, video and images on the kiosk? Why is installing unlicensed fonts okay?\n\nAs for Georgia, that would need to be licensed as well, unless each kiosk had a licensed copy of Windows or Mac OS.\n\n"
    },
    {
      "time": "20 Sep 2007 — 1:03pm",
      "content": "I assume a kiosk would still use some sort of embedding - maybe. Depends what they're building it in.\n\nCheck Emigre's site. They have a licensing portion that deals with embedding fonts. At the moment, it's $150 extra to license up to 30 fonts for embedding in flash + the cost of the standard font license.\n\nAs far as I can tell the rules and fees vary a lot! You may need to call the font company to talk them through what you want to do.\n\nI would think the Adobe font library would be a very good choice if you need to worry about cost and legal issues. I'm sure they're very sympathetic to embedding their fonts in their own products! As far as I can tell they don't require any special licensing - though I may be wrong. I just haven't seen anything on their site about it.\n\n"
    },
    {
      "time": "20 Sep 2007 — 7:34pm",
      "content": "Adam implies that this was not a Flash based project...\n\n\\>While I’ve never done a kiosk before, I’ve done a bunch of Flash projects using embedded fonts to display dynamic text fields\n\nCheers, Si\n\n"
    }
  ]
}
