{
  "id": "36117",
  "title": "Canceling my Typophile acct",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi. I can't seem to find a spot in my settings where I can cancel my acct! Any suggestions?\n\nThanks,\n\nW/\n\n",
  "author": "<li class=\"taxonomy_term_4 first last\"><a href=\"/web/20130214021611/http://typophile.com/forum/4\" rel=\"tag\" title=\"Anything goes.\">General Discussions</a></li>",
  "time": "14 Aug 2007 — 3:50pm",
  "uid": null,
  "comments": [
    {
      "time": "14 Aug 2007 — 6:01pm",
      "content": "If you stop posting, your account just fades into oblivion--that is, you can revive it at any time as well :-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Aug 2007 — 6:49pm",
      "content": "thanks Chris.. but I actually want to cancel it. :)\n\nany ideas?\n\nThanks again :)\n\nW/\n\n"
    },
    {
      "time": "14 Aug 2007 — 8:47pm",
      "content": "Click on the \"Feedback\" link at the bottom right of any page and it will go to the Admin folks.\n\nChrisL\n\n"
    },
    {
      "time": "15 Aug 2007 — 12:41am",
      "content": "Ya. Gave that a shot before posting - No luck so far - but hopefully.. Thanks for your help :)\n\nBest,\n\nW/\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:25am",
      "content": "Warren, your account has been deleted as requested.\n\n"
    },
    {
      "time": "21 Aug 2012 — 8:31am",
      "content": "My very slow speed is not open, but also to do other business, never to do design\n\nThank you very much!\n\n"
    },
    {
      "time": "1 Oct 2012 — 12:09pm",
      "content": "Can you DELETE my account too? Thanks.\n\nMF\n\n"
    },
    {
      "time": "1 Oct 2012 — 6:37pm",
      "content": "Like walking across the muddy flats of a flood plane, you may wish you hadn't gone there but only time can erase your tracks... Even that doesn't always work as we know from the fossilized foot prints of dinosaurs. One thing guaranteed not to work is to keep returning to make more tracks - The other is expecting the admins to come to your rescue.\n\n"
    },
    {
      "time": "3 Oct 2012 — 3:27am",
      "content": "I also requested to be deleted the account with the username \"sendoushi\" and email \"joel@sendoushi.com\". I want this account (with the username \"joelsantos\") to have the username \"sendoushi\" so... since I don't use the other account and this one has all my historic on typophile...\n\n"
    },
    {
      "time": "3 Oct 2012 — 5:51am",
      "content": "Hey,  \nI am getting an internal service error 500, if i am trying to post a question and hence not able to post a single question actually. But i am able to comment on posts. I have tried it using different browsers, emptied the cache and also from a different computer. Any ideas?  \nCheers  \nCG\n\n"
    },
    {
      "time": "3 Oct 2012 — 5:56am",
      "content": "Send an email. The contact link is at the bottom of the page.\n\n"
    },
    {
      "time": "3 Oct 2012 — 8:36am",
      "content": "> I am getting an internal service error 500, if i am trying to post a question and hence not able to post a single question actually.\n\nTypogruffer — Your threads are probably getting flagged by the Antispam checker and sent to a queue for moderation. That’s the usual cause. One of the current admins will have to review and clear your post. But I’m not sure if anyone is performing this task regularly any more these days. I would recommend sending a message through the Contact link that Russell pointed out to see if there’s anyone on duty who can moderate those for you (and whitelist your account).\n\n"
    },
    {
      "time": "3 Oct 2012 — 8:44am",
      "content": "I already tried to send an email and no reply\n\n"
    },
    {
      "time": "3 Oct 2012 — 1:46pm",
      "content": "\\> and whitelist your account\n\nI doubt if there is a whitelist. The main purpose of a whitelist is to distinguish between posts that should appear immediately and posts that need to be reviewed first by a moderator before appearing (like a post from a brand new account that might be spam). Since we see blatant spam sometimes, it's clear that first-time posts are not being reviewed, so this method isn't being used.\n\n"
    },
    {
      "time": "3 Oct 2012 — 3:17pm",
      "content": "It’s not specifically a “whitelist” per se — I used the term generically. An admin can assign a special role that we use to let certain accounts that are constantly flagged for no good reason to bypass the antispam checker when they post.\n\nWe see blatant spam because the antispam module is not perfect and leaves much to be desired — i.e., it gives periodic false negatives. And it also gives occasional false positives.\n\n"
    },
    {
      "time": "4 Oct 2012 — 6:55am",
      "content": "Is anyone actually moderating these forums or they are just too complacent to do anything? I am not able to post anything and i have contacted them but there is no response.  \nIs there a good forum(which i think is highly unlikely) like this anywhere else?  \nHope i can get back to posting soon..\n\n"
    },
    {
      "time": "4 Oct 2012 — 9:00am",
      "content": "You're right, there's nothing comparable to Typophile.\n\nhhp\n\n"
    },
    {
      "time": "4 Oct 2012 — 9:20am",
      "content": "> Is there a good forum(which i think is highly unlikely) like this anywhere else?\n\n[http://typedrawers.com/](http://web.archive.org/web/20130214021611/http:/typedrawers.com/ \"http://typedrawers.com/\")\n\n"
    },
    {
      "time": "4 Oct 2012 — 10:58am",
      "content": "> I am not able to post anything and i have contacted them but there is no response.\n\n\\*Sigh\\* I’m very dismayed to hear that. But not surprised. Okay, let me come out of retirement temporarily and see what I can do for you.\n\n"
    },
    {
      "time": "4 Oct 2012 — 11:00am",
      "content": "Thank you Kent!\n\nhhp\n\n"
    },
    {
      "time": "4 Oct 2012 — 7:19pm",
      "content": "Thanks a lot Kent, for being such a sweet guy and helping me out.\n\n"
    }
  ]
}
