{
  "id": "36132",
  "title": "American Graphic Design Trends",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello All,\n\nI am currently working on a project targeting Americans, in particular New Yorkers. Now, I know its hard to generalise, but working in England, its hard to gain a thorough understanding of design in the US.\n\nI would appreciate if you guys could help me out with some stuff. I am focusing on publication design (books/magazines/catalogues). Obviously you could advise me on typography but also size, format, colour trends, overall style (like minimalist for example), image usage and anything else you can think off.\n\nI look forward to hearing what you have to say.\n\nThank you\n\n",
  "author": "<a href=\"/web/20101121045325/http://www.typophile.com/user/14955\" title=\"View user profile.\">tomhowe</a>",
  "time": "<br>",
  "uid": "14955",
  "comments": [
    {
      "time": "",
      "content": "The Color Association of the United States' Fashion Projections for Fall-Winter 2007-2008 predicts following colors:\n\n ![](http://web.archive.org/web/20101121045325im_/http:/typophile.com/files/caus-menswear-07-08_3714.jpg)\n  \n\n ![](http://web.archive.org/web/20101121045325im_/http:/typophile.com/files/caus-womenswear-07-08_6352.jpg)\n\nI would recommend you to break the rules and set up your own trend, the fine english way. ;)\n\n"
    },
    {
      "time": "",
      "content": "Sting's song goes pretty well with this project (kidding).\n\nI'm an alien, I'm a little alien, like an englishman in new york.\n\n"
    },
    {
      "time": "",
      "content": "Yeh good joke! Good song too!  \nCheers for the colour recemmendations!  \nDoes anybody else have any opinions on the subject  \n(not the song)\n\n"
    },
    {
      "time": "",
      "content": "Anybody? Please!\n\n"
    },
    {
      "time": "",
      "content": "Are graphic design trends really that regional anymore what with the internet and globalization and all that?\n\nThe only thing I can suggest is maybe pick up Print's regional design annual and see if any specific trends pop up there.\n\n"
    },
    {
      "time": "",
      "content": "And surf on some portfolios... It's probably the best way to see the trends.  \nEven with internet, styles are pretty different from place to place. Switzerland and Netherland have a very distinctive graphic design for example. Doesn't mean people from elsewhere are not looking at it and inspiring, as well as swiss will get inspired by other countries and tendencies.\n\n"
    },
    {
      "time": "",
      "content": "As for books, I'll hazard my sense of what's common now. Yes, I'm American and living in a suburb of the State of New York—I was even born and raised in NYC.\n\nI see one from column A and one from column B, if you will: what's popular and, therefore, utilitarian; and what's (I don't mean this derogatorily, tho' there was certainly a time and place when it would have been) artsy.\n\nI don't think there's any new trend with the popular. It's pretty much for the usual suspects in the way of page size and font choices. For instance, 6\" x 9\" pages of, say, 10/12 New Baskerville or Adobe Garamond is not an unlikely combo.\n\nBut I take it that what I lump in as \"artsy\" is what's of more interest. And there I'd say that I see more sans serif than ever in books' body text. Especially in books where the body text is blocky: in short paragraphs with display heads occurring often and lots of surrounding white space.\n\nI guess it's a modernist trend that started some time ago and hasn't really abated—perhaps it's a reaction to what's _au courant_ in the first column and so won't change much till the popular/utilitarian stuff starts to change.\n\nOr else some of the folks here could jump-start a brand new direction and others could be engaged to make it a trend. Then, who knows, we might forestall the predicted demise of the printed book as we know it.\n\n"
    }
  ]
}
