{
  "id": "36138",
  "title": "FF Dax - What are people's general opinion?",
  "forum": "Jeremy Green's blog",
  "tags": [

  ],
  "content": "I've spent the last three weeks trying to stumble across a typeface of which i didn't know the name - i found out today that the typeface in question is FF Dax and has a similar cousin under the name of FF Sari.\n\nJust wondering if anyone has any ideas as to the best place to buy this font family\n\nAlso, what is the general consensus? Is it already over-used, or is it a viable option for the right project? I think it would work well in a professional context maybe with another, subtle sans-serif based font...\n\nAny ideas would be appreciated!!  \nThanks,  \nJeremy Green\n\n",
  "author": "Jeremy Green",
  "time": "15 Aug 2007 — 8:23am",
  "uid": "20758",
  "comments": [
    {
      "time": "15 Aug 2007 — 9:15am",
      "content": "FF Dax – the typeface is generally overused and often misused (it's a normal thing, because it is nearly a classic …). But that does not mean, there isn't a new sight on it possible.\n\nYou can buy Dax, Sari at [www.fontshop.com](http://web.archive.org/web/20150414233310/http:/www.fontshop.com/ \"www.fontshop.com\")\n\nPS Do you know Daxline, a face from the same typedesigner?\n\n"
    },
    {
      "time": "15 Aug 2007 — 9:30am",
      "content": "Hi there poms,\n\nThanks for that - Daxline seems very similar to Dax & Sari - i think it's wider is it?\n\nStill quite dear to buy... i'll have to keep looking.\n\nSo many companies are using it now - but half the time, it seems to be used very poorly.\n\n"
    },
    {
      "time": "15 Aug 2007 — 11:07am",
      "content": "Hey Jeremy,\n\nThe typographer.org posted a review about Daxline some time ago - I just stumbled across it today because we are in the super preliminary stages of a corporate redesign. The other designers and I are nearly in open revolt against FF Meta - bless Spiekermann, but I never want to see this face again - and were considering Daxline. Daxline was intended for text use, but we liked the proportions so much, I think we may try it out at display size a few times to see if we need to purchase Dax.\n\nVinney  \n [http://www.typographer.org/archive-condensed-2005november.html](http://web.archive.org/web/20150414233310/http:/www.typographer.org/archive-condensed-2005november.html \"http://www.typographer.org/archive-condensed-2005november.html\")\n\n"
    },
    {
      "time": "15 Aug 2007 — 11:26am",
      "content": "The one thing missing from Yves' review is that [FF Daxline](http://web.archive.org/web/20150414233310/http:/typophile.com/wiki/FF%20Daxline) is more monolinear than [FF Dax](http://web.archive.org/web/20150414233310/http:/typophile.com/wiki/FF%20Dax), less contrast. This makes makes it much more relevant to today's design I think. The proportions are generally improved as well.\n\n ![](http://web.archive.org/web/20150414233310im_/http:/typophile.com/files/font_rend-1_5043.png)\n  \n\n ![](http://web.archive.org/web/20150414233310im_/http:/typophile.com/files/font_rend-2_5424.png)\n\n[FF Dax](http://web.archive.org/web/20150414233310/http:/typophile.com/wiki/FF%20Dax)\n\n ![](http://web.archive.org/web/20150414233310im_/http:/typophile.com/files/font_rend_6551.png)\n  \n\n ![](http://web.archive.org/web/20150414233310im_/http:/typophile.com/files/font_rend-3_4193.png)\n\n[FF Daxline](http://web.archive.org/web/20150414233310/http:/typophile.com/wiki/FF%20Daxline)\n\n"
    },
    {
      "time": "15 Aug 2007 — 11:55am",
      "content": "I'm not that fond of the stemless look, which always strikes me as a little self-conscious and awkward. On the other hand, the original Dax makes something of the stemless look: a strong individuality and a certain sweetness.\n\nDaxline seems to loose some of the merits of the original Dax--the individuality and sweetness--though you might not get tired of it as soon. If you wanted a more usual look, I'd think maybe a different face altogether might work better, as you would't have the distraction of the stemless n m etc.\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:13pm",
      "content": "Bill, do you reckon it would be 'stemless' or 'spurless'? I mean, the stems are still there, just not the spurs?\n\nJeremy, I am not a huge fan of Dax. It is a great idea, just a little clunky. I wish I would hurry up & finish Karbon:\n\n ![](http://web.archive.org/web/20150414233310im_/http:/typophile.com/files/karbon_3808.gif)\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:19pm",
      "content": "Looks alright as a hairline as well…\n\n ![](http://web.archive.org/web/20150414233310im_/http:/typophile.com/files/karbon-hair_6733.gif)\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:36pm",
      "content": "Kris - I think Karbon's looking lovely.\n\nIt isn't really related to Dax beyond being spurless. Seems to come from a very different category of humanist sans.\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:48pm",
      "content": "Cheers Stephen! So you reckon 'spurless' is a more correct term than 'stemless'?\n\n"
    },
    {
      "time": "15 Aug 2007 — 1:54pm",
      "content": "Technically \"stemless\" is surely incorrect, but those unfamiliar with proper words for type parts might not understand that a stem is the main vertical stroke. Spur is ok, but maybe there's something better. I've been wondering about this too.\n\n"
    },
    {
      "time": "15 Aug 2007 — 2:46pm",
      "content": "I don't know what to call it, but I look forward to being converted by Karbon. Everything Kris draws is so damn pretty. However, I must admit I like the heaviest weight of Karbon best, where the cutting of the stems or spurs--or whatever the heck they are--seems to have more visual reason to it.\n\nThat whacky alternate a I must admit pulls the face together as far as visual logic, but maybe is too far out for a lot of use...\n\nps. Kris, have pity on us and on your site give us non-Maori speakers--almost everybody--some samples in English, French, or German. It is very hard for me at least to really judge a typeface if I can't read it, instead of just looking at it.\n\n"
    },
    {
      "time": "15 Aug 2007 — 11:19pm",
      "content": "@karbon sans  \nIn my opinion, as a not-typedesigner, it breathes the spirit of prokyon somehow.  \n [http://www.dutchtypelibrary.nl/Prokyon\\_rdrct.html](http://web.archive.org/web/20150414233310/http:/www.dutchtypelibrary.nl/Prokyon_rdrct.html \"http://www.dutchtypelibrary.nl/Prokyon\\_rdrct.html\")\n\n@kris  \nWill there be a karbon serif? I hope so!\n\n"
    },
    {
      "time": "16 Aug 2007 — 1:12am",
      "content": "Poms: It does have a similar feel, somewhat unavoidable given the theme methinks. I have not looked at it since I began drawing Karbon to avoid outright mimicry! There will be a slab & serif I think. But first I need to finish the sans! This is a quick sketch of the slab.\n\n ![](http://web.archive.org/web/20150414233310im_/http:/typophile.com/files/karbonslab_5139.gif)\n\n"
    },
    {
      "time": "16 Aug 2007 — 3:21am",
      "content": "Guys, thanks so much for all your interest in my original posting - i'm new here, so all these posts are such an encouragement for continuing to use typophile..\n\nKris - I'm quite fond of your karbon type and would be interested to see the finished product! As well, while we're dishing out compliments, your feijoa type really is very pretty - keep up the good work\n\nI'm still quite a fan of the Dax family - the hairline and light would probably work well for displays.\n\nI really like the FF Sari cousin - any thoughts?\n\n"
    },
    {
      "time": "16 Aug 2007 — 5:01am",
      "content": "As I remember, Kris started Karbon before Prokyon came out--you can find it on the critique here somewhere. In any case, Karbon is much warmer. Prokyon really has that cold sleek northern European wind blowing through it.\n\n"
    },
    {
      "time": "16 Aug 2007 — 10:27am",
      "content": "Jeremy - I hadn't seen FF Sari as text until Conor Mangat used it on [Font magazine last month](http://web.archive.org/web/20150414233310/http:/www.fontshop.com/features/fontmag/006/). It's full of personality, but works really nicely.\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:32am",
      "content": "I'm a big fan of FF Dax. I've found it to be extremely versatile.\n\n"
    },
    {
      "time": "18 Aug 2007 — 2:22pm",
      "content": "_I’m not that fond of the stemless look, which always strikes me as a little self-conscious and awkward. On the other hand, the original Dax makes something of the stemless look: a strong individuality and a certain sweetness._\n\nI see Dax in a similar light. It is a bit self-conscious and \"high-concept\" (borrowing a term from the film indistry) but it holds up nonetheless. My main complaint is about Dax's reductive design qualities. Simple is good, but the omission of spurs make Dax a champion of reductive modernism. The face's popularity makes it influential for other typeface designs. That bugs me because I'd rather live in a world unaffected by reductive modernism and \"the failure of modernism\".\n\nj a m e s\n\n"
    },
    {
      "time": "18 Aug 2007 — 5:22pm",
      "content": "<cite>That bugs me because I’d rather live in a world unaffected by reductive modernism and “the failure of modernism”.</cite>\n\nWhat a curious statement, considering your own offerings:\n\n ![](http://web.archive.org/web/20150414233310im_/http:/typophile.com/files/reductive_3876.gif)\n  \n\n ![](http://web.archive.org/web/20150414233310im_/http:/typophile.com/files/reductive2_4748.gif)\n\n"
    },
    {
      "time": "25 Aug 2007 — 10:55pm",
      "content": "Kris, I'm glad this peaks your curiosity. That's a good sign. Ganymede and Primex two of my early type designs from a time when I didn't know better. Making them taught me _why_ reductive design is a dead end : )\n\nIn that sense, having made them qualifies me to recant and be critical of reductive design years later. I've been there and done it, and recoiled.\n\nPrimex suffers less from reductive properties than Ganymede does. Primex is benefits from its simplicity, whereas Ganymede seeks to disappear up its own arse. Its capitals have uses but its lower case is apparently pointless.\n\nBy the way, the terms of use for the Myfonts site prohibits distribution and external use of font samples generated by its test-drive feature. Please read the Myfonts site terms of use and abide by it.\n\nThankyou. Peace.\n\nj a m e s\n\n"
    },
    {
      "time": "26 Aug 2007 — 1:01am",
      "content": "_the terms of use for the Myfonts site prohibits distribution and external use of font samples generated by its test-drive feature._\n\nOh, James. That's silly. If you sell fonts at a site that has online previews, occassional cut-and-pasting is something you should be able to live with. Especially in this context of discussion and commentary.\n\n"
    },
    {
      "time": "26 Aug 2007 — 5:24am",
      "content": "Kris, FYI, Dutch Type Library has come out with Anteres, which seems to be a serif version of Prokyon. It has some features similar to the slab you show above, but is quite different in look.\n\n"
    },
    {
      "time": "28 Aug 2007 — 3:21am",
      "content": "_Oh, James. That’s silly. If you sell fonts at a site that has online previews, occassional cut-and-pasting is something you should be able to live with. Especially in this context of discussion and commentary._\n\nI can live with it, especially because having these samples posted helps illustrate my philosophy. I don't mind Kris posting them. I don't mean to be snarky either. I guess I'm just too principled---hung up on the distibution issue.\n\nI'll try to be more accomodating in future.\n\nj a m e s\n\n"
    },
    {
      "time": "17 May 2009 — 12:09pm",
      "content": "Update: I'm collecting a list of [spurless/stemless sans serif fonts](http://web.archive.org/web/20150414233310/http:/www.fontshop.com/fontcase/genres/stemless_sans_serif/) for future reference.\n\n"
    }
  ]
}
