{
  "id": "36157",
  "title": "Questions about Linotype 'logotypes'",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have been looking at a book of Linotype type samples that Jim Rimmer Gave me. ( Thanks Jim!)\n\nIt has a section it it explaining & extolling the virtues of the f ’logotypes’ they made available in some fonts: ff fi ffl ffy ffs ffe and so on. There are also Diagonal and other difficult letters combinations in Italic such as TA FA VA WA; & Va Pa Wa Yo etc.\n\nQuestions:\n\nIf I wanted to study this further it seems like the type Museum in Boston would be the best place - do you agree?\n\nHave any of you spent time looking at these things? Obviously their main point is to allow for kerning in the most difficult combinations - but have you ever noticed anything else? In addition to the 2nd f getting anew height/shape, in some cases I think I see subtle shifts in shape in the new letters - mostly it’s the crossbar of the f getting shorter in some cases.\n\nWho might remember what the decision making process was like & what combinations may have been considered and ultimately rejected?\n\nThanks!\n\n [‹ Cheap T-26 Fonts?!](http://web.archive.org/web/20080204005443/http:/www.typophile.com/node/37036 \"Go to previous forum topic\") [Something new! ›](http://web.archive.org/web/20080204005443/http:/www.typophile.com/node/37145 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080204005443/http://www.typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 16.Aug.2007 6.30am",
      "content": "Eben —\n\nYou should have grabbed Mike Parker while he was at TypeCon. He probably could have given you insight into the Linotype ligatures/logotypes. (Though you might have gotten a lot more tangents than you bargained for.)\n\nA more practical contact for you might be Larry Oppenberg. He’s head of Galápagos Design, and on the board of the Printing History Museum (which is in North Andover, not Boston, btw), and worked in the drawing office at Mergenthaler Linotype toward the end. You can still find drawings in the museum with Larry’s name on them, I think.\n\nIIRC, these logotypes were only made for a handful of fonts, and you would have had to insert them manually, since there wasn’t a place for them in the magazine.\n\nI’m not sure I’m understanding your first questions about the shapes. As far as which combinations, I’d be willing to bet that this would have been decided on a font-by-font basis. And the decision would likely have fallen to the head of typographic development — which would have been C.H. Griffith (until 1949), then Jackson Burke (until sometime in the 60s), then Mike Parker (until the early 80s).\n\nFor the ligatures, obviously there will be separate drawings. The telling thing would be whether there were separate drawings for the logotypes or whether there were just alternate spacing specs and directions for cutting the logotype matrices from the constituent parts.\n\nI hope to be making a research trip to the museum within the next few months. If I still remember this question then, I’ll try to see if I can dig up any more concrete information for you.\n\n— K.\n\n"
    },
    {
      "time": " 16.Aug.2007 11.21am",
      "content": "<cite> The telling thing would be whether there were separate drawings</cite> Exactly!\n\n<cite> If I still remember this question </cite> Thank you very much! Actually I will be in Boston in Sept and I had an idea that I should maybe go & search too. This is a bit far fetched, but maybe we could go at the same time... :-)\n\nI will contact Larry Oppenburg as well.\n\nI should also note that according to the Linotype book I have the logotypes were keyable from an ’Auxilary Magazine’ - or insertable by hand. When keyed in the ’fr’ was on the the ’S’. The ’ff’ was on the ’V’ and so on.\n\nThis is exactly what I wanted to know. Thanks very much - as usual!\n\n"
    },
    {
      "time": " 19.Aug.2007 7.29am",
      "content": "Eben —\n\nI don’t know if all models would have accommodated an auxiliary magazine, but yes, on Linotypes that could handle multiple mags, I could see substituting one with logotypes. In this way, I suppose the logotypes were basically like precursors to the Adobe expert set. Gardner will know more about the logistics of their actual use. Maybe this time, he’ll have the Linotype machine up and running for you.\n\nLet me know if/when you’re coming out to Boston. It’s a long shot that I could actually meet up with you, since it’s a bit of a trek (~ 3 hours) for me to get out to that side of the state. But hey, you never know.\n\n— K.\n\nP.S. Note that it’s Oppenberg with an e.\n\n"
    },
    {
      "time": " 19.Aug.2007 8.43am",
      "content": "Linotype’s 1923 Caslon Old Face did have a whole series of f ligatures, at least in some sizes. And I’m sure the drawings are there in the Museum of Printing. The idea was, I think, that people could use these ligatures for book work and get the effect of the original hand set type.\n\nLarry Oppenberg was wonderfully helpful to me as well; he’s invaluable for helping you interpret the measured drawings. If anybody would know about whether there were general rules concerning the formation of ligatures, it’s probably Larry, who remembers the practices there at Merganthaler Lino. Matthew Carter and David Berlow also worked there drawing type back in the day, and several of Larry Oppenberg’s colleagues at Galapagos Design.\n\n"
    },
    {
      "time": " 19.Aug.2007 11.37am",
      "content": "Thanks for the correction Lew. I will write to you about my schedule etc.\n\nBill, that’s great to hear! Thanks to you as well.\n\n"
    },
    {
      "time": " 19.Aug.2007 11.58am",
      "content": "Eben, just to clarify: since Linotype matrices do not allow kerning, to get not only fi, fl etc., but also fa, fo, fe, fu, with a traditional Caslon full f, they would have to do logotypes for these that would fit on a single matrix. These were done for Caslon Old Face, probably to compete with Monotype for book work. I don’t know how often they were actually used, but they are in the old specimen book I have. I kind of doubt that this was done much for other Linotype faces, but you could ask Larry Oppenberg.\n\n"
    },
    {
      "time": " 19.Aug.2007 1.46pm",
      "content": "I know that several faces ( but not all ) had optional logotypes available. What’s interesting is that some of them were just for the roman and some of them had italics as well. The combinations chosen for production varied in interesting ways as well. I am also not sure that all sizes had logotype available either. But I will take your suggestions and follow this up with he folks who will know.\n\nBill, is it your impression that Caslon had the most special logotypes?\n\n"
    },
    {
      "time": " 19.Aug.2007 3.22pm",
      "content": "I don’t know about metal Linotype’s other faces—a large specimen book would give you a pretty good answer. I suspect that in the new faces designed for Linotype there would have been less motivation to do f ligatures, because there was no need to give the feeling of an old classic, which was the goal with Caslon. My impression is that for new stuff they tried to design to the limitations of the Lino machine, and tried to make a virtue of the limitations—the necessity of short tops on the f’s, the need for wide italics.\n\n"
    },
    {
      "time": " 19.Aug.2007 4.51pm",
      "content": "The specimen book That Jim Rimmer Gave me shows that it was something they did with at least 4 or 5 typefaces or more - all text/roman in style. The book itself is not complete and it looks like they designed it so that you could ad pages to it. Quite clever really. If anybody is interested I can give a full accounting of what it shows. So my impression is that while they may have taken Caslon as a special case ( or possibly not! ) it is certainly true that they gave a lot of logotypes to for instance the Garamond too.\n\n"
    },
    {
      "time": " 20.Aug.2007 6.34am",
      "content": "Eben —\n\nI believe, as Bill says, that the full logotype treatment was typically done with faces that were targeted for bookwork. Further, the extensive f ligatures/logotypes would have been applied primarily to faces that were adaptations of older or competing typefaces, where the overhanging f was an integral part of the design (and a customer’s expectations).\n\nFor original designs, you usually find that the f has been crafted to disguise the Linotype’s mechanical limitations, and so, extensive f-combo logotypes were not necessary to achieve the proper effect.\n\n— K.\n\n"
    },
    {
      "time": " 20.Aug.2007 7.38pm",
      "content": "These glyphs were called typographic refinements. The punches in combination (double hit) were used in order to make one matrix.  \nBoth Linotype and Intertype manufactured these matrices. Because there were no overhangs allowed in linecastng machines special “true cut” matrices were made but the tracking was not esthetically pleasing. Of course Monotype composition never had these problems.  \nYes, it is true that most of the type families that contained the typographic refinements were for book composition. Ludlow display mats were also punched with overlapping characters.\n\n"
    },
    {
      "time": " 20.Aug.2007 10.10pm",
      "content": "Thanks Robert.\n\nI think I am also seeing some cutting of the cross bar where an f would collide with a 2nd letter. Maybe more contextual alteration too. But too be sure I will have to look at the drawings.\n\n"
    },
    {
      "time": " 15.Sep.2007 9.47pm",
      "content": "I have looked at the Linotype drawings at the Museum of printing now. And what I found was that 98% of the time what looks a little like variation is in fact differences in inking, pressure & so on. So Bill, you were bang on in general as I think we all knew you were.\n\nHowever! I did find some nice examples of honest to goodness for sure, no doubt, contextual alteration. Part of what ’s fun with the drawings is seeing the original line erased.\n\nMind you - there might be more - but I only had a day. I wouldn’t expect to see very many more if there are any at all. What I wish I had time to do is to compare across pt sizes. This might not be possible in some cases because the special logotypes were not always available in all pt sizes. It is even possible that thye only exist in the point size in which I found them.\n\nSo, here is what I found.\n\nJanson 8pt. The far right serif of the W is wider on the Wa logotype than on the W.\n\nBaskerville. 10pt - rf vs sf - the rf combo forces the crossbar to be shorter on the left side ( next to the r ). The sf logotype uses a consistant s & the basic special f found it in the logotypes.\n\nCaslon italic 10pt - fs vs fr ( also ffr & ffs) - the fr combo requires a shorter bar again but this time on the right of the f not the left.\n\nGaramond no.3 10pt. fa vs fy ( also ffy) - slightly shorter bar on the fy similar to the example above. ’fa’ has a normal crossbar.\n\nAs I said in my blog; Larry Oppenberg’s help in understanding the organization of the papers and how to efficiently use the resource was invaluable. Thank you Larry! And of course Gardner’s giving me the chance to do the research was likewise. Thanks Gardner!\n\n"
    }
  ]
}
