{
  "id": "36153",
  "title": "(x) Frog Design logo - custom designed, based on Frutiger {Jan E}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Please help with this nice face.\n\n ![](http://web.archive.org/web/20120109081653im_/http:/typophile.com/files/frogdesign_3719.gif)\n\n",
  "author": "<a href=\"/web/20120109081653/http://typophile.com/user/15245\" title=\"View user profile.\">jdslav</a>",
  "time": "<br>",
  "uid": "15245",
  "comments": [
    {
      "time": "",
      "content": "hmmm... not The Sans, Kievit, Freight Sans, Syntax\n\n"
    },
    {
      "time": "",
      "content": "That’s custom. Based on Frutiger.\n\n"
    },
    {
      "time": "",
      "content": "I always thought it was Meta but it's clearly not. Still think it's some Spiekermann creation. possibly custom.\n\n"
    },
    {
      "time": "",
      "content": "I'd say Freight Sans.\n\n"
    },
    {
      "time": "",
      "content": "I'm passing this link on to the horse's mouth - my brother is the creative director there.\n\n"
    },
    {
      "time": "",
      "content": "\\> Still think it’s some Spiekermann creation.\n\nThey did it themselves.\n\n"
    },
    {
      "time": "",
      "content": "Certainly not Spiekermann -- that's not his signature style, which is very recognisable.\n\n"
    },
    {
      "time": "",
      "content": "I’ve got a book here that features this identity design as a case study for flexible identities. It says there that frog design’s own graphic design team created this. And it says that the type is custom designed and based on Frutiger (which is recognizable).\n\n"
    },
    {
      "time": "",
      "content": "\\> Certainly not Spiekermann — that’s not his signature style\n\nHey Yves, not to hijack this thread, but I'm curious what you consider Spiekermann's signature style? To me Meta, Info and Officina all feel similar to the frog design logo. Am I being naive?\n\n"
    },
    {
      "time": "",
      "content": "I wouldn't exactly call you naive ;^P but personally I think the Frog Design characters look more like [Luc(as) de Groot](http://web.archive.org/web/20120109081653/http:/typophile.com/wiki/Luc%28as%29%20de%20Groot)'s or [Michael Abbink](http://web.archive.org/web/20120109081653/http:/typophile.com/wiki/Michael%20Abbink)'s style. It's all about basic shapes, curve structures and overall proportions. It's quite difficult to put into words, and at the end of the day it often is nothing more than a buzzing feeling in the back of the head that tells me what it is.\n\n"
    },
    {
      "time": "",
      "content": "For example Erik’s designs have rectangular proportions, while this one is more square. Check the quite wide counters on the \"g\" -- if this were a Spiekermann design they'd be narrower. Luc(as) and Michael have the same wide counters (see TheSans and FF Kievit).\n\n"
    },
    {
      "time": "",
      "content": "I don't really care who did, but that g is too wide.\n\n"
    },
    {
      "time": "",
      "content": "Sez who? :^P\n\n"
    },
    {
      "time": "",
      "content": "Well, compared to the other character widths. I say so. :^P\n\n"
    },
    {
      "time": "",
      "content": "Man, Frog design--I know just the typeface for that group :-P\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I'm with Tiff. The individual shapes are nice, but as a whole, this looks like a rounded, Hollandized Myriad/Frutiger with a mismatched, widebody 'g' slapped in.\n\nAnd Yves is right. These shapes are more Abbink or Dutch than Spiekermann.\n\n"
    },
    {
      "time": "",
      "content": "Hey! The bold 'g' is almost straight out of [TheSans](http://web.archive.org/web/20120109081653/http:/www.fontshop.com/fonts/singles/lucasfonts/thesans_basic_bold/?sample_text=frog&sample_size=96).\n\n"
    },
    {
      "time": "",
      "content": "It sounds like y'all are slaves to too much knowledge.  \n: )\n\n"
    },
    {
      "time": "",
      "content": "I know, Stewf -- we've got a magazine whose name includes a 'g' and whose logo is set in The Sans, so I thought this was going to be an easy one...\n\n"
    },
    {
      "time": "",
      "content": "Seems close to a condensed version of Gill Sans? But the lowercase 'r' is all wrong.\n\n"
    },
    {
      "time": "",
      "content": "Not much Gill Sans in this, I'm afraid.\n\n"
    },
    {
      "time": "",
      "content": "I'm not sure, but I know the logo predates Freight by several years.\n\nPatty, which creative director at frog? We may have crossed paths once or twice. =)\n\n"
    },
    {
      "time": "",
      "content": "My brother is Robert Fabricant who is the creative director of the NY office. He confirms that it was a custom job but hasn't gotten back to me on what font it's based on.\n\n"
    }
  ]
}
