{
  "id": "36152",
  "title": "Avatars...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Where does everyone get their awesome avatars?!? I love them, where did you all find them?\n\nXOXOX Christine\n\n",
  "author": "<a href=\"/web/20111225223526/http://typophile.com/user/17085\" title=\"View user profile.\">caslonista</a>",
  "time": "<br>",
  "uid": "17085",
  "comments": [
    {
      "time": "",
      "content": "In most cases, we didn't find them, we designed them.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "i found mine [on some restaurant signage](http://web.archive.org/web/20111225223526/http:/www.flickr.com/photos/13806879@N00/276996828/) not far from my home in AZ.\n\n"
    },
    {
      "time": "",
      "content": "Chris’ avatar beats all others by far.\n\n"
    },
    {
      "time": "",
      "content": "Have I got something you're going to love :)\n\n"
    },
    {
      "time": "",
      "content": "Machine-gun kitty is still my favorite.\n\n"
    },
    {
      "time": "",
      "content": "<cite>i found mine on some restaurant signage not far from my home in AZ.</cite>\n\nReminds me of Palladin (Richard Boone) of \"Have Gun, Will Travel\" fame.\n\n"
    },
    {
      "time": "",
      "content": "I got mine by 40 years of life on the edge, living in africa, three kids and running a business.\n\n;)\n\n--  \nMike\n\n"
    },
    {
      "time": "",
      "content": "Mine is a train spotting marker.\n\nThe sign is mounted on two long extesions from a light pole between two sets of train tracks, originaly with the letter 'L' on it, to indecate where the engineer driving a commuter train is to stop the locomotive, so that the cars line up where they are supposed to.\n\n"
    },
    {
      "time": "",
      "content": "LOL!!! That is a scream, Mike! :-)\n\nAnd thanks, Jan!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Thanks Chris - I knew it was juvenile, but could not resist.\n\n--  \nMike\n\n"
    },
    {
      "time": "",
      "content": "Not sure mine qualifies as awesome, but anyway it's from a 16th century manuscript.\n\nAs to style matching content, I always find Hrant's eye rather impressive, if I may say so while he is away. Wonder if it's his own?\n\nAnd I also go off in silly giggles each time I see Machine-Gun Kitty.\n\n"
    },
    {
      "time": "",
      "content": "Mine is a shot of an Etro shirt I wore on a Polish wedding.  \n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "I wouldn't call mine awesome, but I'm not ashamed of it either.  \nI have a kind of obsession of gekkos (besides type), I like them as creatures, would buy jewellery or t-shirts with gekko pattern etc., so I drew one.\n\n"
    },
    {
      "time": "",
      "content": "Hrant’s eye makes me think «Photoshop» everytime I see it, unless I get bashed by him, then I think of [«The Lord of the Rings»](http://web.archive.org/web/20111225223526/http:/en.wikipedia.org/wiki/Image:Eyeofsauron.jpg).\n\n"
    },
    {
      "time": "",
      "content": "Hi there:\n\nMy icon is inspired of kawaii (cute) japanese graphics which I really love. 'Hello, I'm nice.' goes right along with that cute warm fuzzy feeling. But I have since discovered that Hello needs to be kerned. It kinda looks like 'H ello' right now. Typophile has taught me many new things about type which I'm happy to learn and apply (or in my case- yet to apply.)\n\nI plan on replacing my little icon soon though. Less cute more classic. This time with a new font that is TOTALLY off the commercial radar.\n\nMike Diaz ;O)\n\n"
    },
    {
      "time": "",
      "content": "Mili,  \nYour gekko is so beautifully drawn! I wish I had a T-shirt with that drawing crawling on it!  \nWhat do the kids think of your gekko?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Mine is a bit an \"a\", a bit a \"L\", a part of my astro sign and kinda my personality ;)\n\n\\_\\_\\_\\_\\_\\_\\_  \n AL  \n [lenart.pl](http://web.archive.org/web/20111225223526/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "",
      "content": "Mine's a screenshot of an icon I got from IconFactory, which is of Mike Mignola's [Lobster Johnson](http://web.archive.org/web/20111225223526/http:/en.wikipedia.org/wiki/Lobster_Johnson).\n\n_\"Come and taste the Lobster's claw!\"_\n\n"
    },
    {
      "time": "",
      "content": "Thank you all! :D\n\nXOXOX Christine\n\n"
    },
    {
      "time": "",
      "content": "[My current one](http://web.archive.org/web/20111225223526/http:/cavedoni.com/2007/08/gg) is a couple of metal _g_’s from Nebiolo’s Semplicità, designed by Alessandro Butti in the 30’s. I recently went and visited the Tipoteca in Cornuda, Treviso, with the guys from my studio, and I hand set a page of type in it. We have [published more pictures from that visit](http://web.archive.org/web/20111225223526/http:/bnkr.it/misc/tipoteca/) that will surely appeal to the typo-crowds.\n\n"
    },
    {
      "time": "",
      "content": "Mine is my logo. Haven't seen fit to change it.\n\n"
    },
    {
      "time": "",
      "content": "Mine was handed down from my great great great grandfather. He used to carry his california job case door to door.\n\nNo he didn't. ^^\n\n"
    },
    {
      "time": "",
      "content": "Mine has nothing to do with type, my head or my pet cat (with or without machine gun). So it'll have to change. Just you wait...\n\n"
    },
    {
      "time": "",
      "content": "And mine is my handwriting, as a lefthanded child.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Chris!  \nThe kids like it,. My daughter drew a very nice salamander for me, it's now stuck on the wall next to my computer.  \nI can send you an original illustration of the avatar, if you wish to make a t-shirt out of it ;^)  \nThe Dezcom face would make a nice t-shirt, too. Actually, didn't you have one of those already?\n\n"
    },
    {
      "time": "",
      "content": "Mili,  \nThank you! Please do send me the illustration!  \nMy kids' artwork is my most prized possesion.\n\nHere is a pix of me in my avatar T from Boston last year (standing with Bill Berkson):\n\n ![](http://web.archive.org/web/20111225223526im_/http:/typophile.com/files/dezcom-T_4605.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the (link\\*) Antonio!\n\nMili I agree, I really like your geko too.\n\n\\* edited for clarity - that was a funny response Antonio. :-)\n\n"
    },
    {
      "time": "",
      "content": "You’re welcome for the Eben!\n\n(Edit: sorry, I couldn’t resist with the pun.)\n\n"
    },
    {
      "time": "",
      "content": "What surprised me at TypeCon was meeting Chris Lozos in person and realizing that I recognized him from his illustration.\n\nAnd I hate mine. I'm changing it back.\n\n"
    },
    {
      "time": "",
      "content": "Mine is me, with a lot of contrast.\n\n"
    },
    {
      "time": "",
      "content": "I'm with Patty -- mine's my logo. Figured I don't want to break anyone's monitor with a picture of me on it. ;-)\n\n"
    },
    {
      "time": "",
      "content": "Mine is a scene from a favorite Hal Hartley film, \"Trust\".\n\n ![](http://web.archive.org/web/20111225223526im_/http:/typophile.com/files/arts_shelly2_4799.jpg)\n\nBy the way, I love your screen name, caslonista!\n\n"
    },
    {
      "time": "",
      "content": "Chris... WHAT A TALL DRINK OF MAN YOU ARE!\n\nSeriously tho'... very cool t-shirt and icon!!!\n\nMikey ;0)\n\n"
    },
    {
      "time": "",
      "content": "it's cool to see everyone's stories.\n\n"
    },
    {
      "time": "",
      "content": "Mine is just a quirky play with the Q of my screen name, but it needs a little work still, as I made this in 2 minutes or so...  \nNice to get a little glimpse behind the scenes of the avatar!\n\n"
    },
    {
      "time": "",
      "content": "I like caslonista too... reminds me of sexy Linda Evangelista... :o)\n\n"
    },
    {
      "time": "",
      "content": "A rather unnecessary mash-up of Gill Sans and Perpetua.\n\nI think it's about time for something better.\n\n"
    },
    {
      "time": "",
      "content": "Mine is based on the old typographic lesson I used to teach. That being, it is easier to recognize words when you see the top half of letters, than when you see the bottom half.\n\n"
    },
    {
      "time": "",
      "content": "take deafult avatar, add a few cliché photoshop effects.\n\n"
    },
    {
      "time": "",
      "content": "Don, my husband walked by my computer one day and commented on how cool your avatar was.\n\nSharon\n\n"
    },
    {
      "time": "",
      "content": "That's me as a snotty second grader, making my parents proud in the class picture.\n\n"
    },
    {
      "time": "",
      "content": "Caslonista, your avatar reminds me of the Saks Fifth Avenue redesign.\n\n"
    },
    {
      "time": "",
      "content": "\"WHAT A TALL DRINK OF MAN YOU ARE!\"\n\nAt a towering 5'8'', tall has never been used in the same sentance as my name :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chris, so I lied. But hey, I made you feel good. ~~~~ aheheheh\n\nMikey ;-P\n\n"
    },
    {
      "time": "",
      "content": "@ ChrisL\n\nFor the longest time I thought your signature was Christ.\n\nI wear my glasses more regualarly now :o)\n\n"
    },
    {
      "time": "",
      "content": "Caramba, Chris! You mean I tower over you? ;-)\n\n"
    },
    {
      "time": "",
      "content": "\"For the longest time I thought your signature was Christ\"\n\nLOL! More like antichrist :-)\n\nLinda, everyone towers over me but jockeys and that guy from the old \"Fantasy Island\" show who had a thing for airplanes.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Herve Villachaize? Um, he was like under 4 feet, wasn't he? ;-)\n\n"
    },
    {
      "time": "",
      "content": "Rich, your avatar is one of my favorites.\n\nI don't like to spend too much time on avatars, so I am using the letter Z, an obvious favorite, from Ale's lovely script, [Affair](http://web.archive.org/web/20111225223526/http:/www.veer.com/partner/link.aspx?i=1050&p=products/typedetail.aspx?image=UMT0000181).\n\n"
    },
    {
      "time": "",
      "content": "Evolution of my typophile avatar --\n\n ![](http://web.archive.org/web/20111225223526im_/http:/typophile.com/files/nf_face_avatar_4893.png)\n\n ![](http://web.archive.org/web/20111225223526im_/http:/typophile.com/files/nf_grafit_avatar_4701.png)\n\n ![](http://web.archive.org/web/20111225223526im_/http:/typophile.com/files/NF_typeID_5353.gif)\n\n ![](http://web.archive.org/web/20111225223526im_/http:/typophile.com/files/Avatar-StayPuff_6549.png)\n\n ![](http://web.archive.org/web/20111225223526im_/http:/typophile.com/files/avatar_noel1_5464.png)\n\n ![](http://web.archive.org/web/20111225223526im_/http:/typophile.com/files/avatar-noface_3799.png)\n\n"
    }
  ]
}
