{
  "id": "3615",
  "title": "Is it just me?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "What's up with this? This site crashes my computer. Finally I found a place where it tells me to download Flash. I did, it said I already had that version of flash installed.   \n   \nWhat gives? Is it just me? Am I having a bad hair day?   \n   \n [www.fontpool.com/foundries/redrooster/](http://web.archive.org/web/20131020061417/http:/www.fontpool.com/foundries/redrooster/)   \n   \nI am trying to go is Red Rooster. Who is font pool?   \n   \nErrk!   \n   \nAlso does anybody know anything about this foundry? Are they big time operators or what?   \n   \nMaybe Nick knows something?\n\n",
  "author": "gerald_giampa",
  "time": "16 Mar 2004 — 12:08am",
  "uid": "2094",
  "comments": [
    {
      "time": "16 Mar 2004 — 2:37am",
      "content": "Stephen,   \n   \nTell me what you think about 25% royalties from distributors in this day and age?\n\n"
    },
    {
      "time": "16 Mar 2004 — 4:00am",
      "content": "Stephen,   \n   \n25% to the designer/foundry and 75% to the   \nreseller?\n\n"
    },
    {
      "time": "16 Mar 2004 — 4:59am",
      "content": "I was offered that. They want an exclusive. In other words they did not want me to sell to anyone else, including end users. Sound bad?   \n   \nNo \"minimum royalty stream guarantee\".\n\n"
    },
    {
      "time": "16 Mar 2004 — 5:20am",
      "content": "Hypothetically speaking, any royalty arrangement that gives the author of the work a minority share is still based in an antiquated manufacturing model.   \n   \nIf the reseller took a design from an author and had to invest time and money to manufacture the product, well, they are the ones taking the calculated risk, and are entitled to the majoirity of the income.   \n   \nSince most authors of digital fonts not only have designed the work, but has also produced it, they are entitled to a majority of the income. What risk does the reseller assume in this model? One can argue that the author is taking a bigger risk by entering into the agreement. How much promotion is worth giving away 35, 45, or 50 percent? Or more. And will your fonts get lost in the mass promotion of a typical reseller?\n\n"
    },
    {
      "time": "16 Mar 2004 — 7:24am",
      "content": "All of these are good points. Early offers paid smaller percentages, ITC for instance, but in that case we got a \"most favourable up front signing fee\", they did all the work. ITC made a big event of a new releases. This was not exclusive. We released our own version of the same title, same artwork.   \n   \nThe other option would have been to sub-license the font back.   \n   \nAnother company paid $5000.00 up front. Another $20,000 but they only paid a \"dime\" (their verbiage) per font. However they guaranteed 200,000 fonts would be sold. Add that up, pretty good deal.   \n   \nThese were strictly signing fees and were never subtracted from royalties. Only one of them was exclusive.   \n   \nMy thoughts are that resellers are a \"thing\" soon to be of the past. Either that, or the type designers. How can a type designer make a living from 25%, giving an exclusive, with no guarantee?   \n   \nRisky business, no stupid.\n\n"
    },
    {
      "time": "16 Mar 2004 — 7:38am",
      "content": "James,   \n   \n_Since most authors of digital fonts not only have designed the work, but has also produced it, they are entitled to a majority of the income. What risk does the reseller assume in this model? One can argue that the author is taking a bigger risk by entering into the agreement._   \n   \nThis is good point, also in our case we have a proven product. Well advertised by ourselves. Some of which have been common currency in North American trade markets for 100 years. We are speaking of market proven products. People buy them. Believe me.   \n   \nI suppose the only thing that might be said about our fonts in their present state is they are preparing themselves for OpenType. In addition I more aware of the subtle aspects of European accents. Especially Scandinavian accents. So some of these issues are getting addressed. These are improvements under way. That said, the accent issue is nothing many American foundries should be proud of.   \n   \nAnd please, remember I am against OpenType so don't tell anyone what we are doing. OK.\n\n"
    },
    {
      "time": "16 Mar 2004 — 7:50am",
      "content": "Why are you against OpenType?\n\n"
    },
    {
      "time": "16 Mar 2004 — 9:39am",
      "content": "More work, no money in it.\n\n"
    },
    {
      "time": "16 Mar 2004 — 12:07pm",
      "content": "I've just started to develop Typefaces, and I've never used OpenType (I'm still in the Fontographer stage).   \n   \nBut, since I haven't developed oodles of old faces that would have to be updated for the new technology, I'm impressed with the new possibilities that are seemingly available with OpenType. I'd like to work with it.   \n   \nHow is this technological advance different from previous ones? Does everyone hate change (and the reworking it requires) once they reach a certain stage of comfort/success?\n\n"
    },
    {
      "time": "16 Mar 2004 — 12:23pm",
      "content": "You know, I just finished combining a postscript italic with a swash italic to make a new Opentype font with Fontlab. I added swash, ligature, discretionary ligs and alt forms features.   \n   \nI hadn't done this before, I'm not a type designer or a programmer - I'm a puppeteer for goodness sake - and, from start to finish it took me about 8 hours. Now that I've flatten that learning curve a bit, I figure I could do another one in less than four hours.   \n   \nGiven all the time that goes into a typeface, the extra time seems minimal.\n\n"
    },
    {
      "time": "17 Mar 2004 — 3:46am",
      "content": "John,   \n   \nLook I agree, eight hours is not long. But when you spend eight hours for 90 days re-working your library you would be inclined to think otherwise.   \n   \nWhy bother propping up the underpinnings of monolithic corporations and their crippled applications that can't handle the real basics of type in the first place. For instance, rubber type, what's that all about? These programs were planned by strippers and photo comp folk, not by people that really knew anything about type.   \n   \nBesides, how long do your think the customer will say, gee look at this, I have magic ligatures? Not long. They will just take it all for granted. For that matter, these trained fonts, with their nifty gimmicks will make redundant highly skilled typesetters. Now, wait just a minute, where have they gone now?   \n   \nIt further erodes the already over stressed economics of type design by increasing their work load without compensation. In the end type designers will all be eating out of dumpsters.   \n   \nYou hear people saying, \"save the farmers,\" \"save the fisherman\". When do you expect a public outcry of \"save the type designer\". Never, that's when, never.   \n   \nWhat happened to photographers after all those \"stock art photographs\" drove them into poverty. Next time you walk down the street and tell me what you see, bums, winos, your future before you if you make OpenType fonts.   \n   \nDon't you care about your children. Your self respect?   \n   \nYour wine decisions will be made by how many beer bottles you find.   \n   \nHere we are all busy working ourselves out of employment, already the children of photographers and typesetters are suffering from malnutrition, teeth rotting, living with street rats. Think about it.   \n   \nBut, oh no, we are going to work even harder to reduce the already few jobs to be found for our fellow workers.   \n   \nThat's it, lets unionize.   \n   \nBy the way, can I stay at your house tonight?\n\n"
    },
    {
      "time": "16 Mar 2004 — 1:46am",
      "content": "Hi Gerald. The Font Pool is an independent compendium of   \nfonts and foundries, cashing in on web search results.   \n   \nRed Rooster is a digital foundry known for their revivals.   \nI'd advise viewing their stuff at their [official site](http://web.archive.org/web/20131020061417/http:/www.roostertypes.com/) or [MyFonts](http://web.archive.org/web/20131020061417/http:/www.myfonts.com/foundry/redrooster/)  \nrather than The Font Pool.\n\n"
    },
    {
      "time": "16 Mar 2004 — 2:56am",
      "content": "Do you mean 25% to the designer/foundry and 75% to the   \nreseller or the other way around?\n\n"
    },
    {
      "time": "16 Mar 2004 — 4:47am",
      "content": "The only resellers that could justify taking that large a cut are   \nthose that promote with quality and quantity. [Veer](http://web.archive.org/web/20131020061417/http:/www.veer.com/products/type/) comes to mind.   \n [FontShop](http://web.archive.org/web/20131020061417/http:/fontshop.com/) is another with their FontBook and upcoming website.   \nNo other large distributor really does a decent job of promotion.   \n   \nBut 25% seems low - even for those two. Did someone   \nactually offer you this, or are we speaking hypothetically?\n\n"
    },
    {
      "time": "16 Mar 2004 — 5:06am",
      "content": "I should qualify my post a bit.   \n   \n1. I don't know what either of those resellers offer.   \n2. Resellers and foundries are potentially very different entities.   \nI would call Red Rooster a foundry and Veer a reseller.   \n3. Public discussion on royalty agreements is a touchy issue. I'll   \nassume now that we are speaking hypothetically as most contracts   \nare private information.\n\n"
    },
    {
      "time": "16 Mar 2004 — 5:15am",
      "content": "Things to consider:   \n   \n**Promotion**   \nHow are they going to spend your money? Do they have a   \nprinted catalog? Does it suck? Do they have a decent website   \nthat offers respectful showings of your types? How much traffic   \ndoes the site see?   \n   \n**Saturation**   \nHow large is the vendor? Do they already have a huge library   \nin which your stuff could get buried? Will they guarantee that   \nyour fonts will get representative play in their promotions?   \n   \n**Sublicencing**   \nI would ask which resellers, if any, also sell their fonts.   \n   \n [Something to read.](http://web.archive.org/web/20131020061417/http:/typographi.ca/000787.php#000787)\n\n"
    },
    {
      "time": "16 Mar 2004 — 5:45am",
      "content": "James brings up a good point and another category I should   \nadd to that list of things to consider:   \n   \n**Production**   \nDoes the vendor offer font development assistance or do they   \njust take the files you give and plop them in their collection?\n\n"
    },
    {
      "time": "16 Mar 2004 — 10:46am",
      "content": "Nice quote, Gerald. That is the general essence of type design today, not just OpenType.\n\n"
    },
    {
      "time": "16 Mar 2004 — 12:29pm",
      "content": "Dan,   \n   \nFor me, the benefits of OpenType are obvious and substantial.   \nThe trouble is convincing joe customer of those benefits. It's still   \na fairly new technology and the masses aren't out looking for   \nOpenType fonts, so they generally aren't willing to pay more   \nfor the work that is invested in them.   \n   \nOn the other hand, I do know of a couple foundries who don't   \nadvertise OT fonts on their website but get quite a few requests   \nfor them.   \n   \nAs far as change is concerned, remember that you're talking to   \nGerald Giampa who is an old salt and a master of metal. He's   \nprobably still weary from the change to digital typography and I   \ndon't blame him. Fortunately, like John just said, the OT shift is   \nmany times simpler and I think Gerald would be pleased with   \nwhat it can do for his typefaces.\n\n"
    },
    {
      "time": "16 Mar 2004 — 1:39pm",
      "content": "Don't forget **Reputation.** It's part of the equation that sits   \nsomewhere between Promotion and Saturation, but it shouldn't   \nbe underestimated.\n\n"
    }
  ]
}
