{
  "id": "36161",
  "title": "Featured Typeface just changed",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Wow. I’d really like to see the latest posts on the home page to be diplayed in that face ;-)\n\n",
  "author": "<a href=\"/web/20100103152904/http://typophile.com/user/17243\" title=\"View user profile.\">Jan</a>",
  "time": "<br>",
  "uid": "17243",
  "comments": [
    {
      "time": " 15.Aug.2007 4.52pm",
      "content": "refresh your browser, and you will!\n\nbtw, it looks great james!\n\n"
    },
    {
      "time": " 15.Aug.2007 5.03pm",
      "content": "Before everyone gets their panties in a bunch… :)\n\nThe Featured Face on Typophile is a very unique way for designers to showcase their work in a dynamic environment, very different from your standard specimen. The typeface will be changing on a regular basis, so get used to it :) This feature has always been part of the design (since the redesign of 2005), but we are now taking it by the horns and have placed a selection of fonts into rotation.\n\nWe are really excited to bring a fresh face to Typophile every so often, and hopefully you will enjoy seeing some new favorites splashed all over your screen. If anyone has interest in taking advantage of this feature, let us know!\n\n[typophile@punchcut.com](mailto:typophile@punchcut.com)\n\n"
    },
    {
      "time": " 15.Aug.2007 5.27pm",
      "content": "Posts are still in Beorcana. But anyway - I like this feature. I kinda loved to stay on the homepage when Mercury Display was the featured face. Keep up and thanks to punchcut.\n\n"
    },
    {
      "time": " 15.Aug.2007 5.33pm",
      "content": "<cite>Before everyone gets their panties in a bunch… :)</cite>\n\nI think it is a great feature. Go for it! The panties-in-a-bunch crowd need to be tweaked now and then.  \n; )\n\n"
    },
    {
      "time": " 15.Aug.2007 6.14pm",
      "content": "Does the Font display engine support Kerning? I had been meaning to ask for while. Maybe now is a good time. Nice lookin’ font there James! That was a heck of a good looking ad in the Typecon schedule as well!\n\n"
    },
    {
      "time": " 15.Aug.2007 6.18pm",
      "content": "Just out of curiosity how do you render the bitmaps?\n\n"
    },
    {
      "time": " 15.Aug.2007 6.40pm",
      "content": "I don’t think they’re bitmaps, it looks to be a [sIFR](http://web.archive.org/web/20100103152904/http:/www.mikeindustries.com/sifr/)-like solution.\n\n"
    },
    {
      "time": " 15.Aug.2007 7.42pm",
      "content": "_Posts are still in Beorcana_\n\nClearing your browser cache should fix it; that’s what I had to do.\n\n"
    },
    {
      "time": " 15.Aug.2007 9.34pm",
      "content": "Hi there:\n\nNot loving this new font at all :-/\n\nIt would have been smarter to use the non-stencil style of the face to enhance legibility. Or better yet- another font altogether.\n\nMike Diaz\n\n"
    },
    {
      "time": " 15.Aug.2007 9.42pm",
      "content": "Yes, the home page and global header navigation and page titles are all Flash, so the text renders on the fly.\n\nThe headers look good in Super Duty. [Typeco](http://web.archive.org/web/20100103152904/http:/typophile.com/files/Featured_Face_SuperDuty.jpg) is in the house.\n\n"
    },
    {
      "time": " 15.Aug.2007 9.57pm",
      "content": "Super Duty looks great. I only wish we could set the entire site in it :)\n\n"
    },
    {
      "time": " 15.Aug.2007 11.00pm",
      "content": "If the whole site was set in it I think my eyes would start to bleed.\n\nI like the change, but I also don’t like the stencil.\n\n"
    },
    {
      "time": " 16.Aug.2007 2.10am",
      "content": "Love it, I think it’s a creative and immersive way of promoting new faces, keep ’em coming.\n\n"
    },
    {
      "time": " 16.Aug.2007 2.15am",
      "content": "My first inclination not to be negative was the right one. Please excuse the edit.\n\nSharon\n\n"
    },
    {
      "time": " 16.Aug.2007 7.03am",
      "content": "I love the idea of the featured face (even tho this one isn’t my cup of tea) but had hoped it would rotate more often than it has. We had Beorcana for a long time. Is it a lot of work to change it - I’m not a programmer - or is it simple code?\n\n"
    },
    {
      "time": " 16.Aug.2007 8.01am",
      "content": "No, boxer bunching here—This is a perfect place to push the envelope! Great work Punchcut folks! That is one sweet stencil, dudes and dudettes :-)\n\nChrisL\n\n"
    },
    {
      "time": " 16.Aug.2007 10.18am",
      "content": "\\> Not loving this new font at all\n\nLive a little. I think it is a great way to feature fonts that some of the members have created.\n\nHow often is the face going to rotate? If there are enough entries, then I’d suggest one month between changes.\n\nThis is a good way to expose members to new faces. (Is someone going to keep a record, perhaps in the wiki, of featured faces? That would be useful in the future when you remember a font from a few years back, but can’t remember the name.)\n\n"
    },
    {
      "time": " 16.Aug.2007 12.19pm",
      "content": "Just to prove that this system works, I just bought Super Duty! Great stuff!\n\nChrisL\n\n"
    },
    {
      "time": " 16.Aug.2007 12.24pm",
      "content": "Nice going, Punchcut folks, and hurray James G. for the exposure. I am a Typeco fan. :-)\n\n"
    },
    {
      "time": " 16.Aug.2007 1.11pm",
      "content": " ![](http://web.archive.org/web/20100103152904im_/http:/typophile.com/files/superduty_6659.png)\n\nChrisL\n\n"
    },
    {
      "time": " 16.Aug.2007 1.40pm",
      "content": "The fonts being displayed are from type designers and foundries that are directly (financially) supporting Typophile in exchange for what we think is some nice, blanketed exposure throughout Typophile. So, we owe a thanks in a more explicit way to [Carl Crossgrove](http://web.archive.org/web/20100103152904/http:/typophile.com/wiki/Carl%252BCrossgrove) and [Typeco](http://web.archive.org/web/20100103152904/http:/typophile.com/wiki/Typeco) for helping out in that fashion (ahem, buy their fonts). Our aim is to have the sponsored face rotate on a very regular (monthly) basis.\n\nSo, just when you’ll be getting used to reading Super Duty, you can expect us to change it.\n\nPlease email typophile [at] punchcut [dot] com if you’d like to receive an advertising/sponsorship rate sheet.\n\n"
    },
    {
      "time": " 16.Aug.2007 2.55pm",
      "content": "Chris, you are a poster-making machine [this week](http://web.archive.org/web/20100103152904/http:/typophile.com/node/36120)! :-) Nice going!\n\n"
    },
    {
      "time": " 16.Aug.2007 3.53pm",
      "content": "I like it.\n\n"
    },
    {
      "time": " 16.Aug.2007 4.11pm",
      "content": "<cite>Our aim is to have the sponsored face rotate on a very regular (monthly) basis.</cite>\n\nI like that. I get tired of things after a while. It would be fun to see a few more fonts come out and play.\n\n"
    }
  ]
}
