{
  "id": "36175",
  "title": "A six year-old designer",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I thought I’d post this here and see if I can’t get a few reactions.\n\n ![](http://web.archive.org/web/20080106234453im_/http:/typophile.com/files/CP_ltd_vertical_Pos_3443.jpg)\n\nPart of it was designed by the company’s CEO’s six year-old daughter. (I’m guessing she did the computer).\n\nIt was submitted as the worst logo ever and featured on the front page of Digg ( [http://www.digg.com/design/The\\_Worst\\_Logo\\_EVER](http://web.archive.org/web/20080106234453/http:/www.digg.com/design/The_Worst_Logo_EVER \"http://www.digg.com/design/The\\_Worst\\_Logo\\_EVER\")) today.\n\nI actually don’t mind it; it’s nice to see a more artistic approach to the static and cold designs of computer based logos. (I might have used a yellow background instead of a pink one though.) At least it’s not a web 2.0 style!\n\n [‹ Favicon for Typophile](http://web.archive.org/web/20080106234453/http:/typophile.com/node/36164 \"Go to previous forum topic\") [The strength and clarity of Comic Sans ›](http://web.archive.org/web/20080106234453/http:/typophile.com/node/36191 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080106234453/http://typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 16.Aug.2007 7.26am",
      "content": "I like the 6-year-old’s computer rendering a LOT better than the snooze of a font.\n\n"
    },
    {
      "time": " 16.Aug.2007 8.02am",
      "content": "and how about “no” background —\n\nand in full agreement with Patty - change that type please - the computer is kind of refreshing - way different than the average clip art computer companies have been getting away with for years....\n\nP.S. How could the owner turn down their 6-year old? Also — it may be considered the worst logo by some - but look at all the attention it is getting!\n\n"
    },
    {
      "time": " 16.Aug.2007 8.09am",
      "content": "<cite>How could the owner turn down their 6-year old?</cite> ~you can’t!\n\nI’m not familiar with the company itself, but have heard good things about their products.\n\nI think the logo’s better than most, and it does symbolize the company (they’re a software solutions company.) well.\n\n"
    },
    {
      "time": " 16.Aug.2007 8.10am",
      "content": "Heh. What a story. This logo is not the worst ever. Not by a long shot.\n\nThe image is too complex and the colors are questionable at best, particularly in the screen, but the computer is not bad; very distinct. I agree with Patty 100% about the font and Jackie about the background.\n\nThis reminds me of a documentary coming out that I’m eager to see. It’s called _[My Kid Could Paint That](http://web.archive.org/web/20080106234453/http:/www.apple.com/trailers/sony/mykidcouldpaintthat/)_.\n\n"
    },
    {
      "time": " 16.Aug.2007 9.19am",
      "content": "I’m sorry but that computer could have been drawn by a five year old!\n\n"
    },
    {
      "time": " 16.Aug.2007 9.32am",
      "content": "It appears that it was a great logo until someone other than the 6-year old began messing with it.\n\n"
    },
    {
      "time": " 16.Aug.2007 11.56am",
      "content": "That satement could be applied to so many things . . .\n\n“It appears that it was a great \\_\\_\\_\\_\\_\\_\\_\\_\\_ until someone older than a 6-year old began messing with it.”\n\n"
    }
  ]
}
