{
  "id": "36195",
  "title": "what's wrong with Tiresias",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is there any research / critical thought, etc that questions or examines the claims made in favour of Tiresias Signfont’s superior legibility that isn’t attributable to Joe Clark.\n\nAll I’ve found is the Tiresias material and Joe Clark’s anti-Tiresias stuff.\n\nthanks.\n\n [‹ International Typographic Style](http://web.archive.org/web/20080519014904/http:/www.typophile.com/node/8002 \"Go to previous forum topic\") [Ampersands ›](http://web.archive.org/web/20080519014904/http:/www.typophile.com/node/39812 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080519014904/http://www.typophile.com/user/13076\" title=\"View user profile.\">russellm</a>",
  "time": "<br>",
  "uid": "13076",
  "comments": [
    {
      "time": " 16.Aug.2007 12.36pm",
      "content": "One angle might be to examine implementations of Tiresias that weren’t due to the font being mandated by standards bodies.\n\nJoe has also criticized the alternative “compatible” fonts produced by Monotype and Ascender - but maybe talking to the designers responsible for these might identify issues they looked to address in making these alternates (beyond simply providing a cheaper alternative).\n\n"
    },
    {
      "time": " 16.Aug.2007 1.52pm",
      "content": "Having a background in cognitive psych and test theory, I have looked closely at the “research” for Tiresias, and found it to be as flawed as Joe Clark says it is. Truly laughable, in fact. I look forward to seeing Joe’s talk on the subject at ATypI.\n\nI seem to recall having a conversation with Kevin Larson about it, in which he too concurred.\n\nJoe may state his case in a somewhat overblown fashion, and maybe just one or two of the things he crtiques are not such a big deal, but by and large he is dead on. Take time to think about his critique, and read the original research yourself.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 16.Aug.2007 2.43pm",
      "content": "Thanks.\n\n.\n\n"
    },
    {
      "time": " 16.Aug.2007 3.23pm",
      "content": "I did a fair bit of work with Tiresias when I was working on my Masters thesis — it’s got some good points about it, despite Thomas’s pronouncement.\n\nPart of all the negative stuff (including Joe’s) that’s out there is that none of it has any scientific basis, while at least the pro stuff has some academic support. Caveat emptor.\n\n"
    },
    {
      "time": " 16.Aug.2007 3.54pm",
      "content": "My esteemed colleague will be aware that what I wrote concerned Tiresias Screenfont. The Signfont is way too dark and sets far too wide, but I haven’t written much about it. I included some PC(F)ont weights on the CD-ROM with my first book. I’m not anti-everything-Tiresias.\n\nBut no, nobody else has called bullshit. Everyone seems willing not only to believe the marketing, but to write cheques of up to $15K to Bitstream.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20080519014904/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 16.Aug.2007 4.14pm",
      "content": "The story of Clearview might be instructive here. In fact, Clearview might serve your purposes, having been developed for road signage. There are several widths available as well, answering your need for economy.\n\nThe designers of the initial versions of Clearview were graphic designers, which Tiresias never benefitted from, and the further development was handled by an experienced type designer (fontographer is the name of a product, btw). Clearview is interesting here because the designer was consulted during the process of typeface development, and test results were available to the type designer, making further modification and improvement organic and meaningful. That involvement isn’t an ego stroke to type designers, it’s essential expertise required to deliver meaningful results; the brief with Clearview was to improve recognition of words on highway signage, and they clearly achieved that in a quantifiable way. One of the major reasons for this success is that the original US Highway signage typeface was designed by engineers..... See the connection?\n\nIt’s not entirely true what Elaine Kitchel told you in her reply; they did not have to make the typeface themselves. Any number of experienced and knowledgeable type designers would have been willing to give advice, critique, and possibly work for free to such a project, had they heard about it in advance.\n\nShe also wants to discount the opinions of those with normal vision, but the intended users of APHont are “readers who use large print.” Fonts that work well for those with low vision are the same ones everyone uses. They are just set larger. Different factors than mere letterform design affect reading ability.\n\nI’ve looked at APHont. It has some useful properties and also some major flaws. It misses opportunities to further differentiate letters and ignores some basic concepts of type design, specifically concepts that would be useful in tailoring a typeface to low-vision readers. It also appears to be a rough modification of Verdana.\n\nI’ve also looked at Tiresias. It’s ok, but not at all unique in offering superior performance. I could thumb through a type catalog and point out several other typefaces that would perform better in the intended setting for Tiresias (television screen captions, a narrow and specialized application). But it, too fails in several critical areas. Screen captioning fonts, and any type intended for reverse display, need unusually wide spacing and careful attention to joins and interior angles. This is clearly not part of Tiresias’ development. It would have improved the resulting typeface immensely had a qualified type designer been involved. And when you propose to assist those with a disability, it seems to me you don’t skimp on the expertise.\n\nThe design schools are lousy with kids eager to invent a cruelty-free defibrillator or ergonomic hammer, and while the impulse is admirable, in the case of type design it’s misguided. There is a tendency to ascribe some magical healing or reparative abilities to typefaces. They want to design a special typeface for a specific disabled group, but without the benefit of any experience in type design. The possible benefits here are very slim.\n\nThere actually are skills and perceptive abilities that type designers have that can’t be approximated by scientists with no design training or experience. Any research that ignores that is flawed and impoverished. Type design is a very delicate operation, and the results achievable by an expert are very delicately balanced. Lots of people, even those with design backgrounds, have discovered how easily well-designed typefaces can be mangled in a drawing program by pulling and stretching on parts of the letters.\n\nMy standard metaphor is: It’s like asking a car mechanic to improve a flower.\n\nShort answer: Joe may be abrasive, but he’s right.\n\n"
    },
    {
      "time": " 19.Aug.2007 7.40pm",
      "content": "@ Crossgrove, “Short answer: Joe may be abrasive, but he’s right.”\n\nyeah, I know, & he’s really not all that abrasive.\n\nI really thank you all for your comments.\n\n"
    },
    {
      "time": " 11.Dec.2007 2.23am",
      "content": "Sorry to bump this but...\n\nI’m a computer programmer who has recently become visually impaired. I suffer from severe diplopia, effectively meaning I see 2 GUI’s which can be anything from 1 cm to 10 cm apart.\n\nI’ve read a bit about the Tiresias font, and currently have this installed and in use as my default windows font, which, personally, makes menu’s easier for me to use. However, after reading Joe Clark’s criticism, I was wondering what font is actually suggested for use on a PC to improve legibility without massively altering the GUI.\n\nI’m also after a highly legible fixed width font to use in my programming environment.\n\nAdam\n\n"
    },
    {
      "time": " 11.Dec.2007 6.34pm",
      "content": "BlindGeek, I’d assume you are speaking about Tiresias PC Font?\n\n-=®=-\n\n"
    },
    {
      "time": " 11.Dec.2007 11.46pm",
      "content": "Yep, the PC font\n\n"
    },
    {
      "time": " 12.Dec.2007 2.21pm",
      "content": "Well, BlindGeek, are you happy with what you’ve got now? There’s a chance we won’t be able to find an alternate font that’s earth-shakingly better for you.\n\nThere are so many Web pages and blog posts on monospaced fonts for programming. Have you looked at Thesis Mono and its later descendant, Consolas?\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20080519014904/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 12.Dec.2007 8.29pm",
      "content": "_what’s wrong with Tiresias?_\n\nWell, he’s blind, but that’s nothing compared to what’s wrong with Oedipus.\n\n"
    },
    {
      "time": " 12.Dec.2007 8.36pm",
      "content": "bud-ump-bump!\n\n-=®=-\n\n"
    },
    {
      "time": " 12.Dec.2007 9.07pm",
      "content": "As I’ve pointed out repeated, both publicly and privately, there is **no scientific evidence that Tiresias is “bad”** , and **significant (including my own) research shows that it is useful in practice by those who use it.**\n\nWhile others (Joe, Carl, et al) may protest excessively, **there is no concrete proof that Tiresias is not useful to people with diminished vision.**\n\nThat we keep having this discussion (and no, Carl, saying that anyone other than a certified type designer who isn’t worshipped here on Typophile can’t design a typeface), is testament to the fact that science can actually design a working typeface.\n\n"
    },
    {
      "time": " 12.Dec.2007 9.35pm",
      "content": " ![](http://web.archive.org/web/20080519014904im_/http:/www.typophile.com/files/TxLinda_4667.jpg)\n\n"
    },
    {
      "time": " 12.Dec.2007 11.52pm",
      "content": "My experience of the Tiresias PC font so far, is that it is very good for menu’s, buttons etc. For most of Windows though, software is hard coded to use MS Sans Serif or Tahoma, so it’s of limited use. IE 7 is a classic example. The menus and tabs are Tiresias, the address bar and tool bars are not.\n\nFor web pages which haven’t been specifically coded for a font in CSS, it comes out very large compared to leaving Windows in its default state. Where the CSS has been coded well and IE switches over to Tiresias it is easier for me to read. The web system I use to monitors my clients applications was written about 10 years ago and thus doesn’t do anything fancy with fonts. Tiresias on that is very readable.\n\nAnd thanks Joe for the suggestions about monospaced fonts. My searches have tended to be for ’monospaced font legible’ or ’monospaced font partially sighted’.\n\n"
    },
    {
      "time": " 13.Dec.2007 1.34am",
      "content": "<cite>My experience of the Tiresias PC font so far, is that it is very good for menu’s, buttons etc. For most of Windows though, software is hard coded to use MS Sans Serif or Tahoma, so it’s of limited use.</cite>\n\nYou can override that.\n\nFirst, make sure that you’ve gone into the Display properties in the Control Panel and used the Advanced settings to customize every single item to use Tiresias PCfont.\n\nNow, copy the following text (six lines, including the blank second line):\n\n`Windows Registry Editor Version 5.00`  \n``  \n`[HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\FontSubstitutes]`  \n`\"MS Shell Dlg\"=\"Tiresias PCfont\"`  \n`\"MS Shell Dlg 2\"=\"Tiresias PCfont\"`  \n`\"MS Sans Serif\"=\"Tiresias PCfont\"`\n\nPaste the copied text into Notepad and save the file as `\"Tiresias.reg\"` — _including_ the double quotation marks (this is important!).\n\nDouble-click the file you just saved to import it into the registry. When asked, confirm the operation.\n\nRestart Windows, and you should start seeing Tiresias PCfont everywhere.\n\n"
    },
    {
      "time": " 13.Dec.2007 8.25am",
      "content": "Linda,\n\nI think you keep having a discussion with yourself. What I am saying sounds uncannily like what you are saying, except in reverse: There is no scientific evidence (as has been claimed) that Tiresias provides any benefit over a variety of other typefaces for the same exact purposes. What Joe has been saying is that the alleged science that supposedly established the superiority of Tiresias for these special purposes, is bunk. I have to agree; the documented tests fall far short of anything one would have to do to make a claim such as has been made. It’s smoke and mirrors. It’s insufficient, unscientific, specious nonsense. Defending it is not wise.\n\nHaving decided that the use of Tiresias has helped people does not prove that it is superior or even proficient at providing benefits. That is also bad science.\n\nAll Crows are Birds. Are all Birds Crows? You can decide what you want to see, and then see it. That doesn’t make it empirically true. You could also use logic to reach a very different conclusion.\n\nI am also saying that Tiresias is not well-designed, and that with the help of someone with experience in type design, Tiresias itself would be much better, and could actually confer the benefits that are claimed for it. This can be said for several other typefaces which can obviously be considered “working” to use your word. Is that the standard we should adopt if we want to assist people? A go-kart will roll down the road. But are you willing to drive one from LA to NYC in wintertime?\n\n”...certified type designer who isn’t worshipped here on Typophile can’t design a typeface”\n\nSnotty remarks like this indicate that you are missing the point. It has nothing to do with any particular designer and everything to do with good science. Please go back and look carefully at what has been claimed, and what I am saying. The ’science’ is bad. You have failed, in the same way, to use rigorous deductive reasoning in your remarks.\n\n"
    },
    {
      "time": " 13.Dec.2007 11.15am",
      "content": "_There is no scientific evidence (as has been claimed) that Tiresias provides any benefit over a variety of other typefaces for the same exact purposes._\n\nAye, there’s the rub. It isn’t that Tiresias is not useful for people with impaired vision, but that the ’science’ claiming that it is significantly _more_ useful than other typefaces is unsound. For all we know, what makes Tiresias useful might be what it has in common with dozens of other sans serif typefaces, rather than its very few distinctive features.\n\nIs it better for people with impaired vision than Helvetica? Well, we don’t probably don’t need science to accurately predict the answer to that question, but we would need good science to _know_ with any certainty what the answer is.\n\nIs it better for people with impaired vision than, say, TheSans? I wouldn’t want to make a prediction on that, nor for a great many other typefaces. And whether one wants to make a prediction or not, one still needs good science to find out.\n\nYou can’t just make a typeface based on your ideas (your hypothesis) about what will be most helpful to people with impaired vision, and then declare that you have succeeded in making the best typeface for the purpose without testing that hypothesis.\n\n"
    },
    {
      "time": " 14.Dec.2007 10.31am",
      "content": "\\> _As I’ve pointed out repeated, both publicly and privately, there is no scientific evidence that Tiresias is “bad”, and significant (including my own) research shows that it is useful in practice by those who use it._\n\nUseful compared to what? The published research am aware of compares apples to oranges to bananas - Tiresias is more legible than a dot matrix teletype font when viewed on a television screen... Good to know.\n\n(Edited severely in a fit of anti-ranting)\n\n-=®=-\n\n"
    },
    {
      "time": " 14.Dec.2007 10.44am",
      "content": "“Well, he’s blind, but that’s nothing compared to what’s wrong with Oedipus.”\n\nAh, thanks, John! I needed a bit of a snicker just now :-)\n\nChrisL\n\n"
    }
  ]
}
