{
  "id": "36198",
  "title": "The design of punctuation",
  "forum": "Design",
  "tags": [

  ],
  "content": "When I showed my monospace at the Typecon typecrit one of the items that was brought up was the punctuation. The suggestion was made that I more fully tune the shapes to the letterforms. I am realizing Now I am starting to reconsider it’s design and I am interested in:\n\n- which fonts’ punctuation you admire and why  \n- things you may have noticed or learned about the relationship between the design of letters and of punctuation  \n- the way in which a font being a monospace impacts the design punctuation - things like the need for a mono’s punctuation to fill a little bit more space than normal and the need for it to be a bit heavier than normal as well.\n\n [‹ Pair for Officina Serif](http://web.archive.org/web/20081120063839/http:/www.typophile.com/node/36466 \"Go to previous forum topic\") [what is this font? ›](http://web.archive.org/web/20081120063839/http:/www.typophile.com/node/35822 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081120063839/http://www.typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 16.Aug.2007 2.10pm",
      "content": "I did find these links as well\n\n[http://www.typophile.com/node/35639](http://web.archive.org/web/20081120063839/http:/www.typophile.com/node/35639 \"http://www.typophile.com/node/35639\")\n\n[http://www.microsoft.com/typography/developers/fdsspec/punc.htm](http://web.archive.org/web/20081120063839/http:/www.microsoft.com/typography/developers/fdsspec/punc.htm \"http://www.microsoft.com/typography/developers/fdsspec/punc.htm\")  \n [http://www.microsoft.com/typography/developers/fdsspec/punc2.htm](http://web.archive.org/web/20081120063839/http:/www.microsoft.com/typography/developers/fdsspec/punc2.htm \"http://www.microsoft.com/typography/developers/fdsspec/punc2.htm\")\n\n"
    },
    {
      "time": " 16.Aug.2007 4.51pm",
      "content": "I don’t know what your intention for the font is, but as a programmer, who uses monospaced fonts daily, I’ll put my two cents in. I feel most monospaced fonts fail bacause of their punctuation. One of the reasons I think Monaco works so well is it’s punctuation is clear but not overpowering, it’s well balanced with the alphanumeric characters. ProFont’s punctuation is too dark, it overpowers the characters, although it does have a large following. I would like the new Microsoft programming font by Luc(us) de Groot except for the double bowl “g” which bothers me. The punctuation marks have a nice balance but I feel they need a bit more height.\n\nChuck\n\n"
    },
    {
      "time": " 16.Aug.2007 7.38pm",
      "content": "I will have to look at Monaco punctuation again.\n\n<cite> ProFont’s punctuation is too dark </cite>  \nAgreed.\n\nI have some questions if you don’t mind:\n\n<cite> the double bowl “g” </cite>  \nAre you against them in general, or just in mono’s? Also, can you imagine one that you could like or not really? Why?\n\nWhat size do you use your mono at & at what screen rez? What OS? With or without smoothing?\n\nDo you care about print at all?\n\nCarl Crossgrove gave me some great tips today and pointed me at the punctuation in the Adobe Pro sets. Very Useful!\n\nI am still interested in hearing more.\n\n"
    },
    {
      "time": " 16.Aug.2007 10.33pm",
      "content": "Again, this coming a programmers perspective.\n\nI’m not against the double bowl “g,” there are some beautiful double bowled “g”s, but in a font for programming, at least in my opinion, it’s a little distracting. Just as in reading a book you want the type to be pleasing, even interesting, but not distracting.\n\nMonaco is a Mac font, it was one of the original set of “city fonts.” I usually use it at 9pt (not smoothed), sometimes at 12pt (smoothed).\n\nPrinting is not a big concern for me. That said, Consolas looks better in print then Monaco.\n\n"
    },
    {
      "time": " 17.Aug.2007 5.56am",
      "content": "Interesting that two programmers posted here. I’m not a programmer by trade, but have hacked away at more than a few manuals, and have to agree that the use of monospace to represent code is an important application. (When you have monospaced code, then the characters line up correctly in columns ... assuming a monospaced editor font ... this allows easier checking for typos ... if the columns aren’t correct, you have missed a character earlier in a line.)\n\nFor programming it is important that characters don’t look the same. One and ell, zero an letter Oh, period and comma, colon and semi colon, all should be distinct from one another at small sizes. The damned code won’t run if you switch the characters.\n\n"
    },
    {
      "time": " 17.Aug.2007 11.29am",
      "content": "<cite> at least in my opinion, it’s a little distracting. </cite>\n\nThat’s very interesting. With the ’g’ the tension I feel is between distraction which I agree the double bowl can create, and distinctiveness which the the double bowl has more of. My goal is make a double bowl that retains the former without too much of the the first. I find that reading with double bowl ’g’s works better for me but I don’t know if it’s better in coding or not.\n\nThe one thing I have noticed is that programmers feel very strongly about these things. But they don’t all agree at all. The one thing I would really like to have - serious survey of preferences doesn’t seem to exist. Perhaps I can get slahdot or somebody to make a survey. Maybe we could host it ( we have the ability here) & get publicity for it in the relevant places. I’d better see how they feel at Punchcut first though. If they agree my question would be - who would you ask to publicize the survey? Digg?\n\nPerhaps Microsoft has good data on this already & would be willing to share.\n\n<cite> two programmers</cite>\n\nOne actually! I design fonts.\n\n"
    },
    {
      "time": " 18.Aug.2007 5.24pm",
      "content": "I’m not a programmer or anything, but taking a survey about that sounds quite interesting. You should defenitely see into that. :)\n\n"
    },
    {
      "time": " 19.Aug.2007 4.54pm",
      "content": "I have made a request to Typophile to let me make a survey now. Perhaps it will work out. :-)\n\nHere are my proposed questions. Feel free to suggest others or to crit these:\n\n............\n\n[Programmers and Monospace Users: Tell us about your Font preferences]\n\nAre you a programmer?  \n Yes; No\n\nAre your font options for programming?  \n Very good; Okay; Not something I think about; Poor; Horrible\n\nDo you prefer Plain pixels or Aliasing/Smoothing?  \n Plain pixels; Microsoft Cleartype; Microsoft Smoothing; Apple Smoothing\n\nWhat rez screen do you use?  \nUse the closest value if you don’t see your exact size.  \n 800x600; 1024x768; 1280x800; 1680x1050; 1680x1050; 1920x1200; 2048x1280; 2560x1600\n\nWhat pt size do you use?  \nUse the closest value if you don’t see your exact size.  \n 7; 8; 9; 10; 11; 12; 13; 14; 15; 16; 17; 18; 19; 20; 21; 22\n\nAt what size would you prefer your fonts stems to go to two pixels? A Stem is the vertical part of a letter The letter H has two of them.  \n13; 14; 15; 16; 17; 18; 19; 20; 21; 22\n\nWhat weight do you like punctuation to be as compared to the weight of the font?  \nJust the same; slightly darker; darker; much darker\n\nWhat kind of zero do you prefer?  \nPlain; Slashed; Reverse Slashed; Dotted\n\nColor: Do you color-code your code?  \nYes; No\n\nWhich do you prefer?  \nLight text on a dark background; Dark text on a light background\n\n............\n\nAlso, where would you suggest we let people know there is a poll so we get a programmer’s perspective?\n\n"
    },
    {
      "time": " 19.Aug.2007 6.23pm",
      "content": "I think the original question about the ’g’ should also be in it?\n\n"
    },
    {
      "time": " 20.Aug.2007 12.39am",
      "content": "Good point. And I would add one about the ’a’ - that can be two or one story too.\n\nI plan to show examples to make sure the ideas are clear as well.\n\n"
    },
    {
      "time": " 25.Aug.2007 9.51pm",
      "content": "Sorry I’m late to the party here.\n\nI’m a programmer, mostly of Objective-C and Ruby. I’m a member of a few other programmer-related forums (mailing lists, actually) and would be happy to post a link to a survey, once you get it up and working.\n\nYou might want to add to the survey a question about use of _specific_ punctuation. As you probably know, different languages use different amounts of punctuation. If you’re a Perl programmer, your curly-braces, dollar-signs, and at-signs will be very important. A Ruby programmer will have a somewhat different set of important characters, a C programmer different still. LISP programmers will care mostly about their parentheses... ;)\n\nAlso, I suggest adding a question inquiring of the programmer’s _current_ favorite programming font(s).\n\n—John\n\n"
    },
    {
      "time": " 26.Aug.2007 3.05am",
      "content": "John, this is great stuff.\n\nWould you be willing to list the ruby glyphs of choice? & C?\n\nIf I get the okay to run the poll I will contact you via the typophile contact form.\n\n"
    }
  ]
}
