{
  "id": "36193",
  "title": "short stop",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This logo is for short stop food mart, which is in gas stations. The customer wants to use this font (Chervonek BT) and I have to make everything around it. He wants a type only solution with maybe some lines.\n\nIf anyone as any suggestions off of what I have posted I would appreciate it.\n\n [‹ Volunteer Services Logo](http://web.archive.org/web/20080618160636/http:/www.typophile.com/node/37202 \"Go to previous forum topic\") [Logo redesign for packaging company ›](http://web.archive.org/web/20080618160636/http:/www.typophile.com/node/36331 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080618160636/http://www.typophile.com/user/2214\" title=\"View user profile.\">signs79</a>",
  "time": "<br>",
  "uid": "2214",
  "comments": [
    {
      "time": " 16.Aug.2007 11.56am",
      "content": " ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP4_4134.jpg)\n\n"
    },
    {
      "time": " 16.Aug.2007 12.13pm",
      "content": " ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP5_4240.jpg)\n\n"
    },
    {
      "time": " 16.Aug.2007 1.01pm",
      "content": " ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP6_5781.jpg)\n\n"
    },
    {
      "time": " 16.Aug.2007 2.08pm",
      "content": "I prefer the oval in the first batch. I like how you incorporated the line and the ’p’.\n\n"
    },
    {
      "time": " 17.Aug.2007 7.30am",
      "content": "You seem to have hit the requested nail on the head with these.\n\nThe oval is certainly viable, though I kind of like the more unique shapes on the bottom two.\n\n"
    },
    {
      "time": " 17.Aug.2007 5.02pm",
      "content": "I prefer the first group, too, because the horizontal line joined with the “p” resembles a tire mark — as if the word “Short Stop” has been moving on high speed and just come to a stop with squeaking tires.\n\nOn the negative side, “FOOD MART” is in disharmony with “Short Stop”, because the two fonts are too similar to each other. There is a typography principle saying, “don’t put similar typefaces together — use either the same one or distinctly different ones.” In this case, the letters of “FOOD MART” appear too wide and too thin — because they are, in comparison to the letters of the dominant “Short Stop”. My recommendation: Try change the font of “FOOD MART” to the same as “Short Stop”, and if “FOOD MART” as a whole come out too narrow, try increase its letter spacing.\n\n"
    },
    {
      "time": " 20.Aug.2007 1.08pm",
      "content": "I have tweeked the logo. I changed the food marts to not be italicized, which may be different enough from the display type. I feel like I have to use a sans serif, but the display font doesn’t work well at a small size as “food marts”.\n\nThe customer wants all letters to be lower case so I have made that change.\n\nI really like this shape for the logo. It is more unique (although there are similar shapes used for other logos) than the other shapes such as the oval, square.\n\n ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP8_5974.jpg)\n\n"
    },
    {
      "time": " 20.Aug.2007 2.09pm",
      "content": "Just gut reaction: I’d go with #1 or #3 minus the line extending from the p\n\n"
    },
    {
      "time": " 20.Aug.2007 4.03pm",
      "content": "First impression is to with #3. Either go with the line extending off the ’p’ or black shape enclosing ’food mart’, but not both.\n\n"
    },
    {
      "time": " 20.Aug.2007 5.33pm",
      "content": "I definitely prefer #2, and would suggest once again increasing the letter spacing of “FOOD MART”.\n\n"
    },
    {
      "time": " 20.Aug.2007 11.40pm",
      "content": "I would go with #3 also without the line. I think the black portion really makes it pop more.\n\n"
    },
    {
      "time": " 21.Aug.2007 8.35am",
      "content": "I think the line is a good idea. why don’t use the line to seperate the black and the red shape, without the thin red line between?\n\n"
    },
    {
      "time": " 21.Aug.2007 10.26am",
      "content": "Progress...\n\n ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP_4382.gif)\n\n"
    },
    {
      "time": " 21.Aug.2007 11.04am",
      "content": "I prefer the bottom of the last two posted. I think the line which only goes to the p is too gimicky and will be difficult to tie in elsewhere when used in different ways. I really liked the surf shop version that had the shape warped a bit. But I wonder if you can have any shape at all as you said you need a type only solution?\n\n"
    },
    {
      "time": " 21.Aug.2007 11.39am",
      "content": "The line bothers me also. I can’t seem to get happy with it. I agree that if I go 2-tones (which really makes it pop) it needs to be one or the other. If anyone has typography tweeks I would appreciate any suggestions. I am trying to get this wrapped up for production.\n\nThis is what the signage will look like in different situations:\n\n ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP_3847.gif)\n\n"
    },
    {
      "time": " 21.Aug.2007 11.42am",
      "content": "Here is another version with a line going all the way accross:\n\n ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP2_4936.gif)\n\n"
    },
    {
      "time": " 21.Aug.2007 11.51am",
      "content": "I like white lines that separate red and black boxes. ;o)\n\n"
    },
    {
      "time": " 21.Aug.2007 12.09pm",
      "content": "It definitely works for you :)\n\n"
    },
    {
      "time": " 22.Aug.2007 8.33am",
      "content": " ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP2_4073.gif)\n\n"
    },
    {
      "time": " 22.Aug.2007 8.47am",
      "content": "You’ve improved it by more than quite a lot. The only thing I might have suggested differently is the shadow stop at the line and not overlap it.\n\n"
    },
    {
      "time": " 22.Aug.2007 9.13am",
      "content": "You might be right about the shadow. It almost looks out of registration. Here is a version without shadow.\n\n ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP_6349.gif)\n\n"
    },
    {
      "time": " 22.Aug.2007 9.24am",
      "content": "Don’t laugh at me. But I think I like the shadow on top of the line. :^P\n\n"
    },
    {
      "time": " 22.Aug.2007 9.33am",
      "content": "I have changed the type on the “food mart” to something more solid. I am still not set on it, but I think it has to be more squarish.\n\n ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP_6371.gif)\n\n"
    },
    {
      "time": " 22.Aug.2007 9.40am",
      "content": "I may incorporate lines from my earlier drafts.\n\n ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP_4461.gif)\n\n"
    },
    {
      "time": " 22.Aug.2007 9.42am",
      "content": ""
    },
    {
      "time": " 22.Aug.2007 9.42am",
      "content": "Yes I liked those lines. Maybe a little thinner. Try matching the width of the stroke. Oh, and the weight of the new typeface below seems too thin. The previous weight stands better with that of short stop.\n\n"
    },
    {
      "time": " 22.Aug.2007 9.45am",
      "content": "I think FOOD MART should have less letterspace if you using this type. I like the other more, but maybe I got use to it now.\n\nBTW I would go with the first, as you mentioned before, the line stops and has a purpose.\n\n"
    },
    {
      "time": " 22.Aug.2007 10.22am",
      "content": " ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/SHORTSTOP_6030.gif)\n\n"
    },
    {
      "time": " 22.Aug.2007 11.57am",
      "content": "#2 of the last batch is my pick. I think you could find a more interesting face for the ’food mart’...not that that is a huge deal, though.\n\n"
    },
    {
      "time": " 22.Aug.2007 1.00pm",
      "content": "Shadow on top of the line looks \\*way\\* better to me. Otherwise it’d be very wired, as the descender of the “p” would appear shortened.\n\nThe new typeface for “FOOD MART” looks great, and I agree that the letter spacing needs to be reduced as a result (as in #2 from your latest batch).\n\nThe lines at the sides of “short stop” aren’t much of a improvement to the logo, but they don’t hurt either. If you do want to include them, I’d definitely go with #2 from your latest batch, and I’d further decreased the thickness of the lines — to equal that of the base line (separating “short stop” from “FOOD MART”). I’d even consider giving them shadows, too, for consistency with “short stop”.\n\n"
    },
    {
      "time": " 22.Aug.2007 2.30pm",
      "content": "I think for «FOOD MART», something like Neutra Face from House Industires would look suitable.\n\nHere is a link:  \n [http://www.houseind.com/index.php?page=showfont&subpage=lettersetter](http://web.archive.org/web/20080618160636/http:/www.houseind.com/index.php?page=showfont&subpage=lettersetter \"http://www.houseind.com/index.php?page=showfont&subpage=lettersetter\")\n\n"
    },
    {
      "time": " 22.Aug.2007 2.37pm",
      "content": "The link doesn’t work properly. I mean the Neutraface Display light or medium\n\n"
    },
    {
      "time": " 22.Aug.2007 2.54pm",
      "content": "“Neutraface” looks too extravagant for my taste. It would possibly steal the attention away from the main title (“short stop”).\n\n"
    },
    {
      "time": " 22.Aug.2007 2.55pm",
      "content": "Is there any thing else wich doesn’t look that extravagant but looks similar?\n\n"
    },
    {
      "time": " 22.Aug.2007 2.58pm",
      "content": "I think it’s the right choice to use a wide font because of the given space. I don’t know many wide sans font to begin with — let alone non-extravagant ones.\n\n"
    },
    {
      "time": " 23.Aug.2007 7.34am",
      "content": "Here is the final version that will be send to Texaco to be put in their gas stations. The customer wanted the lines slightly thicker, which doesn’t look bad. I used Trade Gothic for the secondary font, which I think works well. We will use that on other print material.\n\n ![](http://web.archive.org/web/20080618160636im_/http:/www.typophile.com/files/ss_5673.gif)\n\n"
    },
    {
      "time": " 23.Aug.2007 8.01am",
      "content": "Well done, I like it!\n\nCheers  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nFischers Fritz fischt frische Fische, frische Fische fischt Fischers Fritz.\n\n"
    },
    {
      "time": " 23.Aug.2007 3.20pm",
      "content": "A very professional work.\n\n"
    },
    {
      "time": " 23.Aug.2007 3.46pm",
      "content": "Sorry. I still prefer the simplified versions before all the strokes, dropshadows, and angled lines. Don’t get me wrong it’s 100% better then the original, but it just got to gimmicky for my test. Either way, if the client and you are happy then that’s all that matters. Good job!\n\n"
    },
    {
      "time": " 23.Aug.2007 5.19pm",
      "content": "For this particular project the more lines the better because of the way it will be used. I did research on gas stations and food marts and the want to portray speed and have more of a 3d feel. The client the first day I spoke with him said he wanted “lines”. There is a time and a place for clean logos, but this wasn’t one of them.\n\nI appreciate all of the feedback and I am happy with the logo. My client said it was exactly what he had in mind.\n\n"
    },
    {
      "time": " 17.Sep.2007 2.56pm",
      "content": "Just for the record? Love it! Striking without being garish the way a lot of gas station signage is.\n\n——======\\*======——  \n“If someone’s ’been around the block a few times,’ it might mean he didn’t have the good sense to give up and park in the lot.” ~ Mike Nelson ’Mind Over Matters’\n\n"
    },
    {
      "time": " 21.Sep.2007 9.50am",
      "content": "Krispy Kream anyone. \\*smiles\\* This logo makes me think of them. Ummmm good stuff. Red and Black are always the Impact colors when it comes to the Franchise look. Not sure of your choice for the food mart bit. Or maybe you should add a little more thinkness to that part of the font.\n\nDavid Daigle, Canada\n\n"
    },
    {
      "time": " 22.Sep.2007 9.45am",
      "content": "What about within a circle? Just a thought. It could signify a stop as in ’full stop’, this is the place to be. End of.\n\n"
    }
  ]
}
