{
  "id": "362",
  "title": "Foundry Sterling",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So, I just got my Eye 43. What of The Foundry's new   \nSterling? True to their ritual of catching trends a year or   \ntwo late, Quay and Sack now mimic Takard's Bliss.   \nFunny to see a Tankard ad just 2 pages later. A pity   \nit's for the new Shaker weights or one could have in   \ntheir lap a handy printed comparison of Bliss/Sterling.   \n   \nFirst note: The Foundry's brit face is missing that   \nadorable tailed lc 'l'.   \n   \nSterling: [http://www.thefoundrystudio.co.uk/sterlingpreview.html](http://web.archive.org/web/20131022124613/http:/www.thefoundrystudio.co.uk/sterlingpreview.html)   \n   \nBliss: [http://www.typography.net/type/bliss.htm](http://web.archive.org/web/20131022124613/http:/www.typography.net/type/bliss.htm)   \n   \nStephen\n\n",
  "author": "Stephen Coles",
  "time": "17 Apr 2002 — 12:58pm",
  "uid": "103",
  "comments": [
    {
      "time": "17 Apr 2002 — 3:05pm",
      "content": "It's a Foundry thing, it seems.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Apr 2002 — 5:13pm",
      "content": "Fine point, marcox. Their retakes on existing   \ndesigns aren't always a step down. Monoline is   \na great example.   \n   \nStephen\n\n"
    },
    {
      "time": "17 Apr 2002 — 5:41pm",
      "content": "In fact I'd say they're usually a step up!   \nIt's just that revivals (especially of stuff that just got made...) turn me off.   \n   \nWhich might explain why favorite Foundry font is Form. Forsooth.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Apr 2002 — 1:57pm",
      "content": "So did Quay get sacked, or did Sack get thrown off the quay? ;-)   \n   \nAnyway, that's news to me too. I knew about the geography difference, but thought they just had a long-distance thing going on. \"My cable modem saved my marriage!\"   \n   \nhhp\n\n"
    },
    {
      "time": "30 Apr 2002 — 11:51pm",
      "content": "Heh. Thanks for the correction, anon.   \nWho's responsible for all the new designs   \nthen, just Freda?   \n   \nStephen\n\n"
    },
    {
      "time": "17 Apr 2002 — 4:47pm",
      "content": "I wouldn't say The Foundry is always behind the times. Didn't Foundry Monoline help revive interest in the super ellipse? Surely it's a good thing to see a little less of Eurostile...\n\n"
    },
    {
      "time": "30 Apr 2002 — 1:48pm",
      "content": "Speaking of catching trends a year or two late scoles, there has not been any Quay and Sack since their split at least that far back. He's now in NYC, she's got the studio in London.\n\n"
    },
    {
      "time": "2 May 2002 — 2:24pm",
      "content": "David is still a \"consultant\" to The Foundry. Last I heard he was living in Amsterdam, rather than New Amsterdam.\n\n"
    }
  ]
}
