{
  "id": "36209",
  "title": "bloody rip off artists!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "SO what do you fullas think about this? I know there ar eheaps of con artists ripoffs but this is so blatant that it is shocking!\n\norignal: [http://vllg.com/Thirstype/Infinity/mudTyper+Weights/](http://web.archive.org/web/20150123134304/http:/vllg.com/Thirstype/Infinity/mudTyper+Weights/ \"http://vllg.com/Thirstype/Infinity/mudTyper+Weights/\")\n\nripoff: [http://www.myfonts.com/fonts/t26/aeon/](http://web.archive.org/web/20150123134304/http:/www.myfonts.com/fonts/t26/aeon/ \"http://www.myfonts.com/fonts/t26/aeon/\")\n\nis this typical for t26?? I know they were really hot about 10 years ago, but who is really into this??\n\nMuzz\n\n",
  "author": "muzzer",
  "time": "16 Aug 2007 — 7:33pm",
  "uid": "15119",
  "comments": [
    {
      "time": "16 Aug 2007 — 8:23pm",
      "content": "This is not a typical T26 borrowing of concept. I think Thirstype definitely has a legitimate cause for complaint.\n\n"
    },
    {
      "time": "16 Aug 2007 — 8:29pm",
      "content": "Well maybe they thought chester was some old guy like adrian frutiger, so it was OK to make like microsoft (segoe) or adobe (myriad).\n\n"
    },
    {
      "time": "16 Aug 2007 — 8:34pm",
      "content": "A little closer than those, Nick.\n\n ![](http://web.archive.org/web/20150123134304im_/http:/typophile.com/files/f03e1da41c595844cd2411b2c87f8e3b_3941.png)\n  \n\n ![](http://web.archive.org/web/20150123134304im_/http:/typophile.com/files/69b649c0b6c980509032b6b30e05714a_5291.png)\n\n"
    },
    {
      "time": "16 Aug 2007 — 8:37pm",
      "content": "wow. that's bad.\n\n"
    },
    {
      "time": "16 Aug 2007 — 8:39pm",
      "content": "is there any recourse for something like this? i always remember hearing that you \"can't copyright an alphabet\" which allowed for all kinds of helvetica and frutiger knockoffs. so the question is: what can 3st do other than shame T26 into voluntarily removing the font from their collection?\n\n"
    },
    {
      "time": "16 Aug 2007 — 8:45pm",
      "content": "Perhaps T26 is unaware of Infinity, and just accepted it on its merits. Hard to imagine, but possible. Either way, they should be more careful.\n\nWhat Mr. [Paul Nojima](http://web.archive.org/web/20150123134304/http:/www.paulnojima.com/) was thinking, I can't imagine.\n\n"
    },
    {
      "time": "16 Aug 2007 — 9:19pm",
      "content": "This happens all the time. The only thing you can protect is the name.\n\n"
    },
    {
      "time": "16 Aug 2007 — 9:23pm",
      "content": "Robert - I understand your experience is from the film type era when copying was common, but this level of plagiarism of an existing digital typeface is actually pretty rare today.\n\n"
    },
    {
      "time": "16 Aug 2007 — 9:27pm",
      "content": "Of course, what's truly unforgivable is that the T26 ripoff is of inferior quality. When H&FJ rework the already excellent Avenir into the transcendently good Gotham, that's called \"standing on the shoulders of giants.\" But this is just trying to make a dishonest buck off the backs of others.\n\nIn other countries than the US, there may be legal recourse. In the meantime, Mr. Nojima and T26 have created an entry onto their permanent Internet records that will be very hard to erase. I certainly can't imagine legitimate font people or designers working with either one now. For shame.\n\n"
    },
    {
      "time": "16 Aug 2007 — 11:16pm",
      "content": "I've emailed them to see if we can't get a response. Until then I think it is best to not jump the gun. T26 is a nice group of people who do not condone piracy so I will give them the benefit of the doubt as I hope we would all do.\n\n"
    },
    {
      "time": "17 Aug 2007 — 12:02am",
      "content": "\\> you “can’t copyright an alphabet”\n\nBut in some countries, you may register new and original letter designs.\n\n\\> bloody con artist ripoff\n\nIn my terminology, it is not a \"ripoff\", but rather a forgery by the Monotype method, because, while most lowercase and uppercase letters and most tabular figures are identical in design, there are a few exceptions, e.g. capital \"K\", German \"ß\", the \"@\" sign and a few other characters:\n\n[http://www.sanskritweb.net/temporary/infinity-aeon.jpg](http://web.archive.org/web/20150123134304/http:/www.sanskritweb.net/temporary/infinity-aeon.jpg \"http://www.sanskritweb.net/temporary/infinity-aeon.jpg\")\n\nYet, another question is, whether \"Infinity\" is an original font at all.\n\nMore research would be required to decide this question.\n\n"
    },
    {
      "time": "17 Aug 2007 — 12:22am",
      "content": "I've done the research. Infinity is original. Aeon is not.\n\n"
    },
    {
      "time": "17 Aug 2007 — 1:39am",
      "content": "Paul Nojima about Aeon: \"I created this typeface to be used for my own personnal identity system. I wanted something UNIQUE to represent myself.\"\n\nWow!\n\n"
    },
    {
      "time": "17 Aug 2007 — 2:40am",
      "content": "It's too close to be unintentional. Not one person has the same exact idea for 97% of the alphabet.\n\nAlthough it is not discussed very often, designers do compete with each other. New genres enter the market (or re-enter) and then in two to three years time you have many types that are competitive with each other. And it makes sense too. If there is a [historic] model- there's always room a new spin- even if it's not old. Its also good for consumers too.\n\nIf I like Bureau Grotesque but not the price (700 smackers) or its serious demeanor  \nthen  \nProcess Type's Maple- but it doesn't have old style figures and maybe too much personality  \nthen  \nParry from OurType which is super clean maybe a little too sanitized  \nthen  \nI have to wait for National Grotesque from KLIM which has a little Akzidenz in it but if want more Swiss  \nthen  \nEndurance Pro from Ascender Corp which is super affordable and reminds me of...\n\nI think you get the idea! Inspired- but not a copy nor a forgery. So since this is an obvious copy I wonder if he just customized Infinity to his liking and mistakingly reasoned he could sell his modified copy. And just for arguments sake- What inspired Infinity? Is Infinity based on a type that has a structure/skeleton just so that we could say two people looking at the same source could get 'inspired' to created a techie sans with a similar look much in same way my examples above seem to?\n\nI hope all is worked out soon,\n\nMike Diaz\n\n"
    },
    {
      "time": "17 Aug 2007 — 3:11am",
      "content": "Muzz, curious as to what your connection is to the typeface and why you're interested in stirring this pot so publicly...\n\n"
    },
    {
      "time": "17 Aug 2007 — 3:20am",
      "content": "Off Topic\\>\\>\\> Nicole I love your Elena!!! I hope to see it published soon!!! Congrats... Mike Diaz :o)\n\n"
    },
    {
      "time": "17 Aug 2007 — 6:39am",
      "content": "That's just a bit too close.\n\n"
    },
    {
      "time": "17 Aug 2007 — 6:58am",
      "content": "_is there any recourse for something like this?_\n\nYes. The affected parties could work it out amicably or it could get messy. Too close for coincidence and T.26 likely was unaware or would not have released it. Perhaps the type world could use an arbitrator for such issues.\n\n"
    },
    {
      "time": "17 Aug 2007 — 8:27am",
      "content": "I was only playing list-mom again. Sorry to those who think I was out of line. When I come across things that are too close for comfort I email the foundries.\n\n"
    },
    {
      "time": "17 Aug 2007 — 8:29am",
      "content": "Raph, a note: Frutiger referred to Futura when designing Avenir (hence the name). Gotham is derived directly from building signage in New York City, hence its name. It shares some traits with Avenir, but I doubt H+F-J even referred to Avenir in the development of Gotham. The major difference is the x-height.\n\n"
    },
    {
      "time": "17 Aug 2007 — 8:31am",
      "content": "Aeon isn't available on the T.26 site.\n\n"
    },
    {
      "time": "17 Aug 2007 — 8:40am",
      "content": "Tiff why are you apologizing? You stated that you asked both foundries for their comments and asked us not to speculate until we hear their positions. Truly commendable.\n\nBut also, thanks to muzzer for drawing our attention to this. Now we, as a group, are aware of the situation. But we need details from Village and T26.\n\n"
    },
    {
      "time": "17 Aug 2007 — 8:41am",
      "content": "Hello all. It has been interesting to read the lively discussion here.\n\nMurray is a long-standing and repeat customer of Village, and previously Thirstype. He has licensed several of our faces, and has provided valuable feedback and insights. Yes, he has a gruff manner and an... \"unedited\" prose style, but he's a good guy. He emailed me yesterday to point out the similarities of Aeon to Infinity, and asked if I thought it was appropriate for him to post on this site. I didn't see why not, and told him I had no objections.\n\nI immediately leapt into action myself, contacting both MyFonts and T-26, and receiving quick replies from each concerning the matter. In fact, the Aeon typeface has already been removed from the T-26 site, and should hopefully be wiped from the MyFonts database shortly.\n\nTo address Uli's question about the originality of Infinity. The face was originally designed at Thirst as part of a new identity for the modem manufacturer USRobotics in late 2000. The process is documented in the book \"Emotion As Promotion\": [http://www.amazon.com/exec/obidos/tg/detail/-/1580930972/qid=1108143698/...](http://web.archive.org/web/20150123134304/http:/www.amazon.com/exec/obidos/tg/detail/-/1580930972/qid=1108143698/sr=8-1/ref=sr_8_xs_ap_i1_xgl14/102-1457986-3499327?v=glance&s=books&n=507846 \"http://www.amazon.com/exec/obidos/tg/detail/-/1580930972/qid=1108143698/sr=8-1/ref=sr\\_8\\_xs\\_ap\\_i1\\_xgl14/102-1457986-3499327?v=glance&s=books&n=507846\")\n\nWith best regards to the Typophiliacs,  \nchester  \nVillage\n\n"
    },
    {
      "time": "17 Aug 2007 — 8:48am",
      "content": "Thank you for filling in the blanks, Chester.\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:00am",
      "content": "Tiffany, First of all... Thank you for having our back. And, thanks for sending this to me. How very unfortunate that folks are so quick to chop anyone down without the facts.\n\nI have been discussing this with Chester in a very friendly way since we learned of it. We have had a good relationship with Chester for many years (as we try with all others) and plan to keep it that way.\n\nWe had no idea that this font was a rip-off. It is practically impossible to know of every situation, or to know, or control what designers do.\n\nWe can only react responsibly as soon as we can, as we did here, and, of course, have already removed it from our offering. I hope this lowers the temperature here. It is really not necessary to start off on a negative. Best to all.\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:05am",
      "content": "Glad to see that talking the the right folks does the trick. Hats off to all of you for quickly doing the right thing.\n\nChrisL\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:08am",
      "content": "Thank Dexcom.\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:24am",
      "content": "<cite>Yes, he has a gruff manner and an... “unedited” prose style, but he’s a good guy.</cite>\n\nI agree with Carlos that there was no need for such a harsh tone right off the bat. It's important to point these things out, but to leap to insults is unnecessary. It reminds me of the guy I kinda know who was running around yelling \"someone stole my cell phone\" when it was in his bag and he just couldn't find it.\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:28am",
      "content": "If only every outfit operated with the integrity and sense of responsiblity as these two. I respect them even more than I did before, and that's saying a lot.\n\nBravo.\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:31am",
      "content": "Again, thanks to Pattyfab & Malbright. :-)\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:58am",
      "content": "My apologies, Carlos.\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:56am",
      "content": "Great to have you here, Carlos. Thanks for fixing the issue so quickly and protecting the original design.\n\n"
    },
    {
      "time": "17 Aug 2007 — 10:58am",
      "content": "Apology accepted Nick. :-))\n\n"
    },
    {
      "time": "17 Aug 2007 — 11:03am",
      "content": "<cite>I respect them even more than I did before, and that’s saying a lot.</cite>\n\nWell put.\n\nCheers Carlos!\n\n"
    },
    {
      "time": "17 Aug 2007 — 11:10am",
      "content": "Glad to see all has been worked out in a timely manner. And Tiff, you did the right thing :-) I hope Mr. Nojima will learn a valuable lesson here... BE ORIGINAL! Perhaps he will design something fabulous one day and we'll be speaking of him in a more positive light.\n\nMikey :-)\n\nPS... if not he can work for this company:  \n [http://www.macxware.com/candypress/Scripts/prodView.asp?idproduct=67](http://web.archive.org/web/20150123134304/http:/www.macxware.com/candypress/Scripts/prodView.asp?idproduct=67 \"http://www.macxware.com/candypress/Scripts/prodView.asp?idproduct=67\")\n\n"
    },
    {
      "time": "17 Aug 2007 — 11:12am",
      "content": "While I'm at it!!!\n\nI think everyone should have a look this. Both in Germany. The original- Ingrid Liche, this other one- Joachim Frank.  \nIs this what I think it is ??????\n\n[http://www.fontshop.com/fonts/downloads/fontfont/ff\\_liant/](http://web.archive.org/web/20150123134304/http:/www.fontshop.com/fonts/downloads/fontfont/ff_liant/ \"http://www.fontshop.com/fonts/downloads/fontfont/ff\\_liant/\")\n\n[http://www.myfonts.com/fonts/joachim-frank/waldorf/](http://web.archive.org/web/20150123134304/http:/www.myfonts.com/fonts/joachim-frank/waldorf/ \"http://www.myfonts.com/fonts/joachim-frank/waldorf/\")\n\n[http://www.waldorfschrift.de/index.html](http://web.archive.org/web/20150123134304/http:/www.waldorfschrift.de/index.html \"http://www.waldorfschrift.de/index.html\")\n\nHere we go again :-/\n\nMike Diaz\n\n"
    },
    {
      "time": "17 Aug 2007 — 12:28pm",
      "content": "I'm always impressed with the lack of creativity even with the name changes:\n\nMistral to Mystic  \nAlgerian to Tangiers  \nTekton to Techno\n\nStupefying.\n\n"
    },
    {
      "time": "17 Aug 2007 — 4:29pm",
      "content": "My hats off to you to Tiff!  \nI wish I had your calm and correct approach in some of my prior client meetings;-)\n\n"
    },
    {
      "time": "17 Aug 2007 — 4:30pm",
      "content": "Hmm... I don't know if I would call that lack of creativity, Ken; I think it's more of a wink-wink thing... You know, they give it a similar name, or one that references similar sounds or names, so that you recognize what face is being ripped off...\n\n"
    },
    {
      "time": "17 Aug 2007 — 6:27pm",
      "content": "Yes, I'm impressed with T26's professional handling of this, and even more so with our fabulous moderators. As for Mr. Nojima, I hope he learns his lesson.\n\nThe discussion about Futura/Avenir/Gotham is another interesting one to have, but maybe we won't go into it in depth here. To me, it is self-evident that Gotham references Avenir. The \"G\" alone has that distinctive Adrian Frutiger form, and if you look at the lowercase you'll find that the only letter that's structurally different is the 'k' (Avenir has a symmetrical right part, like Univers, while Gotham's bottom leg meets the top leg partway). Futura is significantly different from both others: single story 'a', tail of 'g' curves up, tails of 'j' and 'y' are straight, top of 'r' curls to 1:30 (it's noon on both Gotham and Avenir), top bowl of 's' is much smaller than bottom, bottom of 't' is straight, 'u' has no right stem, and apexes of 'v' and 'w' are pointy.\n\nBut I'm not saying that's a bad thing, quite the contrary. H&FJ have created something that's a little bit new and different, and (by taking the challenge of increasing the x-height) definitely a lot better for some uses. That is a fine standard for type designers to aspire toward.\n\n"
    },
    {
      "time": "17 Aug 2007 — 7:20pm",
      "content": "Non-gender-specific attaboys to the parties that worked out the facts. One can always get plenty of exercise jumping to conclusions.\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:35pm",
      "content": "Nick, would you care to elaborate on your insinutation about Myriad? Did you skip my presentation at TypeCon, or do you have a counterpoint?\n\n"
    },
    {
      "time": "18 Aug 2007 — 3:52am",
      "content": "\\> like microsoft (segoe) or adobe (myriad)\n\n\\> Nick, would you care to elaborate on your insinutation about Myriad?\n\nI think that everyone knows (including Mr. Phinney) what is meant by \"like microsoft (segoe) or adobe (myriad)\", because Myriad (vs. Frutiger)\n\nsee [http://www.sanskritweb.net/forgers/ssi.pdf](http://web.archive.org/web/20150123134304/http:/www.sanskritweb.net/forgers/ssi.pdf \"http://www.sanskritweb.net/forgers/ssi.pdf\")\n\nis in the same category as\n\nSegoe (vs. Frutiger)  \nVeracity (vs. Utopia),  \nAeon (vs. Infinity),  \nWaldorfschrift (vs. FF-Liant)\n\netc. etc. etc.\n\nWhile Mr. Segura frankly admits that Aeon is a \"rip-off\" (and without delay removes this forgery from his website), Mr. Phinney would never have the courage to admit that Myriad is a \"rip-off\", nor would Mr. Gates ever have the courage to admit that Segoe is a \"rip-off\" of Frutiger, despite the incontestable and non-appealable decision, that Segoe and Frutiger are \"considered identical\" (denoting in legalese that Segoe is a rip-off).\n\nsee [http://www.sanskritweb.net/forgers/segoe.pdf](http://web.archive.org/web/20150123134304/http:/www.sanskritweb.net/forgers/segoe.pdf \"http://www.sanskritweb.net/forgers/segoe.pdf\")\n\n"
    },
    {
      "time": "18 Aug 2007 — 7:45am",
      "content": "Mike Diaz: <cite>I think everyone should have a look this. Both in Germany. The original [FF Liant] -- Ingrid Liche, this other one [Waldorf] -- Joachim Frank.</cite>\n\nI think that's a typefaces from the twenties or thirties. In this respect, FF Liant is as 'original' as 'this other one'. In the FontFont 2004/05 catalog it's in the 'historic' section, by the way. So nothing to worry about.&nbsp;&nbsp;;-)\n\n"
    },
    {
      "time": "18 Aug 2007 — 11:19am",
      "content": "Here are samples of Myriad (top) and Frutiger (bottom). I think type designers should be able to judge for themselves, but they sure look significantly different to me.\n\n ![](http://web.archive.org/web/20150123134304im_/http:/typophile.com/files/Myriad%20vs%20Frutiger_3851.png)\n\n"
    },
    {
      "time": "18 Aug 2007 — 11:36am",
      "content": "Thanks Thomas!\n\n"
    },
    {
      "time": "18 Aug 2007 — 12:14pm",
      "content": " **OH SNAP!**\n\n"
    },
    {
      "time": "18 Aug 2007 — 1:59pm",
      "content": "<cite> ... they sure look significantly different to me</cite>\n\nSince the legal notion of <cite>\"considered identical\"</cite> (as used in the Segoe decision) ignores minutiae, it is useless, from the legal point of view, to point to such details as e.g. that the Myriad-i has a round dot and that the Frutiger-i has as square dot.\n\nThe only legally relevant criterion is the \"show-through effect\".\n\nTypophilers are so very much specialized and so very much devoted to minutiae that they are usually not able to experience the show-through effect. Therefore it is necessary to explain the show-through effect to typophilers with reference to other intellectual works, for instance with reference to poetical works.\n\nHave a look at the following poem:\n\n**Lion Lion, burning bright,  \nIn the deserts of the night;  \nWhat immortal arm or eye,  \nCould make thy dreadful symmetry?**\n\nIf you are familiar with English poetry, you will almost instantaneously experience the show-through effect while you are reading the above poem. What does this effect mean?\n\nOf course the words \"Lion Lion\" not only \"look significantly different\", but ARE \"significantly different\" as compared with the two words in the original poem, and the words \"deserts\", \"arm\", \"make\", and \"dreadful\" are also \"significantly different\".\n\nNevertheless, the original poem shows through, when you read the above forgery. Therefore it is not necessary that I quote the original poem for comparison, because you instantaneously know the original poem which shows through here. This is called the show-through effect.\n\nExactly the same show-through effect is experienced by non-typophilers, if they are accustomed to read texts typeset in Frutiger and suddenly see a text typeset in Myriad. Of course, non-typophilers do not know the name Frutiger and do not know the name Myriad, but if they have read many texts typeset in Frutiger, they will spontaneously think that it is the same Frutiger typeface, if they are presented with a text typeset in Myriad. This means that Frutiger shows through in texts typeset in Myriad, and hence Myriad from the legal point of view is \"considered identical\" with Frutiger, even though several letters of the alphabet are not fully identical in design.\n\n(Note: The term \"show-through\" is also used in the paper industry denoting that a text shows through from the reverse side of thin printing papers.)\n\n"
    },
    {
      "time": "18 Aug 2007 — 2:19pm",
      "content": "I call bullshit.\n\n"
    },
    {
      "time": "18 Aug 2007 — 2:23pm",
      "content": "Ms. Uli,  \nyou seem like a passionate woman, but I'm a little confused. The \"show-through effect\" that you are talking about — or maybe are making up? — is called the latin alphabet. The comparison that Thomas Phinney posted shows the differences between Myriad and Frutiger which are to my eyes, just as clear as the differences between Univers and Helvetica.\n\nJN\n\n"
    }
  ]
}
