{
  "id": "36247",
  "title": "Import ATM Deluxe sets to other font managers (Windows)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've got a new laptop running XP, and am considering using a new font manager rather than ATM Deluxe. I figure that as ATM Deluxe isn't compatible with Vista I might as well make the break now, and surely the new stuff has some features I'll like. My initial looks haven't impressed me a lot, but I'm hoping one will grow on me?\n\nDo the latest Windows versions of either FontExplorer or Suitcase (or both) import ATM Deluxe font sets?\n\nCheers,\n\nT\n\n",
  "author": "Thomas Phinney",
  "time": "17 Aug 2007 — 5:06pm",
  "uid": "909",
  "comments": [
    {
      "time": "17 Aug 2007 — 5:21pm",
      "content": "Don't know about FontExplorer but Suitcase only imports sets from previously installed versions of Suitcase.\n\n"
    },
    {
      "time": "17 Aug 2007 — 6:05pm",
      "content": "Font Explorer changed my system fonts so that I only had squares showing, no words. I don't know the correct terminology, but I think you'll know what I'm saying. It was a big mess. I don't recommend that at all.\n\nI'm using a program called Typograf that manages according to folders you create so if you pointed it to your ATM folders, it should work. It doesn't have the most elegant interface in the world but it works very well. I like that I can put shortcuts to font groups on my desktop.\n\n[http://www.neuber.com/typograph](http://web.archive.org/web/20121102151733/http:/www.neuber.com/typograph \"http://www.neuber.com/typograph\")\n\nSharon\n\n"
    },
    {
      "time": "17 Aug 2007 — 6:11pm",
      "content": "I always assume everyone can read my mind. I'm on an XP machine.\n\nSharon\n\n"
    },
    {
      "time": "17 Aug 2007 — 9:42pm",
      "content": "Sharon: ATM and most higher end font managers have sets that do not necessarily correspond to physical folders. So I need to have something read the set info, not just look at folders. At least, that's my hope. :)\n\nBut thanks for the suggestion.\n\nI seem to recall that I looked at Typograf a while back, and I really didn't like the UI at all. But at least it handles all the font formats I care about, which is more than one can say for most of the less-well-known competitors to Suitcase and FontExplorer.\n\nT\n\n"
    },
    {
      "time": "18 Aug 2007 — 11:01am",
      "content": "The UI is strange at first. I had used Suitcase for years so it looked primitive in comparison. But it is far more flexible than Suitcase and has more features.\n\nI looked at a lot so I hope you find one that suits you. It isn't easy to do on a Windows machine.\n\nSharon\n\n"
    },
    {
      "time": "18 Aug 2007 — 6:22pm",
      "content": "Thomas, I've said it around here before but a new thread, so, I've been really quite pleased with High-Logic's [MainType](http://web.archive.org/web/20121102151733/http:/www.high-logic.com/maintype.html). For more on what I had to say about it, try [this thread](http://web.archive.org/web/20121102151733/http:/typophile.com/node/32985).\n\n"
    },
    {
      "time": "22 Aug 2007 — 4:51pm",
      "content": "When Suitcase X1 for Mac OS was released there were many Mac users left behind by the lack of ATM on OS X. Extensis did actually create a utility to import this data for Mac users because there was significant demand. It only really worked for people upgrading from System 9 to system 10, not a clean install.\n\nCurrently, I'm not aware of any other customers asking for this functionality on Windows, although there must be some. My guess is that it is partly due to slow Vista adoption in professional publishing environments. In addition, it probably wouldn't be practical for people migrating from one PC to another.\n\nFor things like this to happen, my guess is that there would need to be a lot of demand, or it would need to be easy to implement. For example, if ATM's database structure was clearly documented, a hobbyist my step up to the plate. Currently Suitcase for Windows is not scriptable, which means that a Suitcase import couldn't be fully automated. However, Suitcase for Windows does use Font Sense to identify fonts clearly. So, if a user exports sets into folders from another font manager, they can import them into Suitcase without generating dupes. This means basically dragging folders of fonts into the sets pane to create sets. If the same exact font is in multiple folders only one copy of the font will go into the Vault. I haven't used ATM in a while, so I'm don't recall how easy it is to collect fonts into folders.\n\nIn future font management products, I'd really like to have a clean reliable way to import/export data. With Font Sense IDs, this would open up a lot of opportunities because each font can be globally identified.\n\n"
    },
    {
      "time": "22 Aug 2007 — 5:10pm",
      "content": "Forcing the folder structure to match a sets structure is not an option. Among other things, the same font can be (often/usually is) in multiple sets. Copying all the fonts to a vault is an option, but not an option I like. I want to maintain my own organization of physical fonts, and have them independent of the sets.\n\nATM Deluxe has a feature to \"export sets\" to a plain text file. This enables one to simply recreate the same sets on another computer. It is AFAIK quite independent of the physical locations of the fonts. The format probably isn't documented, but it's pretty darn obvious and doesn't really need documentation.\n\nI'm just not getting why a modern font manager would even care about the physical location of the fonts, except for them being in a system fonts locaiton. Font Reserve created the \"vault\" idea back in Mac OS 7 days, mostly because font corruption was a big problem on classic Macs. It's not much of an issue today.\n\nFont Sense or other reliable font ID systems are a great idea, but for my purposes just using the PostScript FontName is good enough as far as reconstructing my sets. That and the Windows menu names are in the exported ATM font set file.\n\nAnyway, I'm starting to feel like I'm ranting, which is not a good sign. I appreciate that folks have been willing to share their info and thoughts.\n\nRegards,\n\nT\n\n"
    }
  ]
}
