{
  "id": "36254",
  "title": "I saw my font on TV!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I saw one of my fonts on TV last night on Comedy Central. That was pretty cool.\n\n:)\n\n [‹ Bickham Script, kind of...](http://web.archive.org/web/20081202193450/http:/www.typophile.com/node/36221 \"Go to previous forum topic\") [Favorite Geometric Sans like Futura/Avenir ›](http://web.archive.org/web/20081202193450/http:/www.typophile.com/node/36062 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202193450/http://www.typophile.com/user/1657\" title=\"View user profile.\">Charles_Borges_...</a>",
  "time": "<br>",
  "uid": "1657",
  "comments": [
    {
      "time": " 18.Aug.2007 12.59am",
      "content": "Congratulations!  \nIt must feel good.\n\n"
    },
    {
      "time": " 18.Aug.2007 1.04am",
      "content": "Which one?\n\nAnd, very cool!\n\n"
    },
    {
      "time": " 19.Aug.2007 8.05am",
      "content": "Thanks! It was Sarah Script.\n\n:)\n\n"
    },
    {
      "time": " 19.Aug.2007 9.59am",
      "content": "Congrats!!!\n\n"
    },
    {
      "time": " 19.Aug.2007 12.41pm",
      "content": "Your website is gorgeous, Charles. I’m so forgetful, I might have told you that before. :-)\n\nSharon\n\n"
    },
    {
      "time": " 19.Aug.2007 6.18pm",
      "content": "Thanks Sharon and Strass. I appreciate the compliment! I need to revise my website. It was hastly thrown together.\n\n:)\n\n"
    },
    {
      "time": " 20.Aug.2007 3.21am",
      "content": "Charles,\n\nThank you for Sarah Script - it quickly became one of my favorites....\n\nMust be nice seeing it there - hope you got paid for it!\n\n"
    },
    {
      "time": " 20.Aug.2007 4.49am",
      "content": "Congrats, Sarah Script is a great looking font.\n\n"
    },
    {
      "time": " 20.Aug.2007 12.41pm",
      "content": "Thanks Jackie and Andehlu,  \nI am glad you like it. It was my first font, and of course I chose a hard font to be my first :)\n\n"
    },
    {
      "time": " 21.Aug.2007 5.51am",
      "content": "I think Chuck Davis enjoys it too! Sarah Script is a font that makes every Sign Painter happy to use! And for me, when I have one of those customer’s that need a “feminine touch” as DOW — well, Sarah Script comes through every time!\n\nThank you.\n\nI’m curious - it was a great job for a first time font, what was your inspiration?\n\n"
    },
    {
      "time": " 21.Aug.2007 8.59am",
      "content": "I am glad you like it Jackie. I made Sarah Script for my wife, Sarah, when our second child was born. I thought it would be fun to make a font for her that could generate some income so she could be a stay home Mom. So far so good. :) All of my love for her went into that font, I guess you could say. I was orginally going to have three versions. The original, a version without connectors, and a version that had all flourishes. I never got the chance to do it. Maybe someday. I am currently working on a period style script that has alot of alternate chars. Should be fun to finally get it done.\n\nHave a great day,  \n-Charles\n\n"
    },
    {
      "time": " 21.Aug.2007 9.08am",
      "content": "I just checked out your other fonts. I love Bounce too. That one looks like fun.\n\n"
    },
    {
      "time": " 21.Aug.2007 10.38am",
      "content": "I just have to ask... Did Comedy Central pay for it?\n\n"
    },
    {
      "time": " 21.Aug.2007 11.24am",
      "content": "To be honest I am not sure if they bought the font or not.\n\n"
    },
    {
      "time": " 22.Aug.2007 9.53am",
      "content": "Isn’t it exciting to see your font out there, doing it’s own thing in a high-profile way?\n\n"
    }
  ]
}
