{
  "id": "3626",
  "title": "Cape Donkey needs the critiquing",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi everybody, here is my typeface: Cape Donkey. The context is To create a display typeface for a potential cartoon designed around the aesthetic of cartoon architecture and citizens of the   \nficticious big city of Cape Donkey. I look forward to hearing all your praises.......and I suppose criticisms.   \n   \n ![Cape Donkey](http://web.archive.org/web/20131015092812im_/http:/www.typophile.com/forums/messages/29/28699.jpg)\n\n",
  "author": "mitchgerads",
  "time": "16 Mar 2004 — 2:23pm",
  "uid": "3082",
  "comments": [
    {
      "time": "16 Mar 2004 — 2:55pm",
      "content": "very cool! i love it!   \nthis face fits very well with the retro style illustrations. i wish you'd give us a bit more info about the premise and setting of the cartoon (is it mexico in the mid 50s? cuz that's what it feels like to me but then again maybe that's just the name giving me that vibe).   \nPersonally i wouldn't set the leaning figure in the middle of the word cape, i'd put him before the C. but overall this is very fresh & inventive. good job!   \noh, btw, if you need any inspiration for comic book fonts it'd be worth yer while to head over to blambot.com (but i'm sure yer probably quite familiar with that site as well as comicraft).\n\n"
    },
    {
      "time": "18 Mar 2004 — 12:34pm",
      "content": "Hey Paul,   \n This is one of those cases where the potential cartoon was sort of being written as the typeface was being created. I like your assumption of 1950's Mexico though, though I don't think I could write that as I do not want to assume I know the people and culture of 1950's Mexico. Right now my only description is that it's about a group of \"hip cats\" and their unusual personalities in the big inner city of Cape Donkey. I'm just as confused and that's half of the fun!   \n   \n-Mitch\n\n"
    },
    {
      "time": "18 Mar 2004 — 2:27pm",
      "content": "Hello \"Mitch\"   \nI think your figures are very original and fun. However, I don't think that the \"girl\" icon at the end of the digbat line doesn't go with the line weight of the other dingbats. Also, the numbers, \"4, 5, 6, & 9\" don't have the thin strokes like all the other characters....maybe you should go for consitency on these. Finally, I think the \"zero, 8, I, & A\" don't quite fit in the typeface. Great start.\n\n"
    },
    {
      "time": "18 Mar 2004 — 2:34pm",
      "content": "Hi,   \n   \nIt appears that you have quite a few overlapping paths (I can't tell if they are intentional or not). Make sure you get rid of those or your font will have issues with printing etc.\n\n"
    },
    {
      "time": "18 Mar 2004 — 2:51pm",
      "content": "Hey Matthew,   \n The overlapping path look was indeed intentional, inspired by a mistake early on in the design process. It sort of follows a design element I want to use in the backgrounds of the city etc.   \n   \n-Mitch\n\n"
    },
    {
      "time": "18 Mar 2004 — 4:25pm",
      "content": "hey mitch, definately keep the fractured letters as a design element. but it think what matt is meaning is that they technically shouldn't be overlapping. (but i'm sure you knew that already) I believe you can fix this if you use the \"merge contours\" feature in FontLab, but then again, I don't really know what yer building this in!   \nOne last note, i know that you're pushing the boundaries of traditional letterforms in this one, but to my eyes the 3 and 4 are almost unrecognizable (without the greater context) perhaps think about reworking those?\n\n"
    }
  ]
}
