{
  "id": "36268",
  "title": "advice for a beginner",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello,\n\nIve been spending the past few weeks peeking in on the forums here and have to say I am very impressed by all of you and your knowledge.\n\nI have just saw a few clips on Youtube for the Helvetica documentary and I loved many points that were made in the interviews. The one that stuck with me most was, the choice not to choose (other faces). They chose Helvetica. I thought that was very smart and started me thinking about my own situation. I am an Art Director in London for a major client. Most of my work is done online but if I sell well I sometimes get to push the above line stuff. What I have been thinking about doing for a long time now is, to design a font for my client that would hopefully become synonymous with its brand. The brand is worked on by many designers globally I would like to take away the choice like the designers in the Helvetica documentary. I hope this doesnt make me sound like the asshole I think it does ;)\n\nMy question to everyone here is... where do I begin? I havent designed a fontface since art school in Toronto 12 yrs ago and that was on paper. Is there standard software for this? Is there any popular freeware I could begin with?\n\n [‹ Guideline for decorative lettering embellishments?](http://web.archive.org/web/20080830000219/http:/typophile.com/node/36285 \"Go to previous forum topic\") [For your viewing pleasure...(calligraphy attached) ›](http://web.archive.org/web/20080830000219/http:/typophile.com/node/36275 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080830000219/http://typophile.com/user/20872\" title=\"View user profile.\">andehlu</a>",
  "time": "<br>",
  "uid": "20872",
  "comments": [
    {
      "time": " 19.Aug.2007 7.33am",
      "content": "Widely used software is [FontLab](http://web.archive.org/web/20080830000219/http:/www.fontlab.com/), but that is not freeware.  \nI believe that [FontForge](http://web.archive.org/web/20080830000219/http:/fontforge.sourceforge.net/) is freeware (or opensource), but I don’t know if it’s any good. Others might comment on that.\n\n"
    },
    {
      "time": " 19.Aug.2007 8.08am",
      "content": "FontForge is open source (which technically isn’t freeware - it’s better). You can get it at [fontforge.sf.net](http://web.archive.org/web/20080830000219/http:/fontforge.sf.net/). Some in this forum don’t like it, but it has improved a lot recently, and is always improving. I’ve never really used anything else (besides a brief and not particularly fruitful encounter with Font Creator, which isn’t free), but I like FontForge a lot.\n\n"
    },
    {
      "time": " 19.Aug.2007 8.58am",
      "content": "It seems that almost all Pros use either Fontographer or FontLab Studio.\n\n"
    },
    {
      "time": " 19.Aug.2007 9.20am",
      "content": "I use Fontlab, and it’s great! :)  \nWhen you need advice ore comments, upload it to typophile and we’ll give our humild opinion.\n\nGood luck,\n\nPS: can you tell me the link to this Helvetica documentary?\n\nThanx\n\nFerch\n\n"
    },
    {
      "time": " 19.Aug.2007 9.25am",
      "content": "I am an aspiring software, and after trying to get by with less able Font Software for a while, I’ve decided to move to Fontlab. Fontlab really gives a designer just about everything he needs to draw and output a great font, with lesser tools I was spending a lot of time jumping into Illustrator to try and get things done. Fontographer has most of the great drawing tools, but it also has a lot of nasty old bugs that won’t be fixed until Fontlab has managed to finished Fontographer 5, so I end up going to Fontlab just to stay away from those issues.\n\n"
    },
    {
      "time": " 19.Aug.2007 9.45am",
      "content": "Hey Barry. The same company that produces FontLab (which is what I use) also has a $99 product called [TypeTool](http://web.archive.org/web/20080830000219/http:/www.fontlab.com/font-editor/typetool/) which is an introductory version of FontLab Studio. Assuming that the alternatives don’t suit you, you could get started with that and then move on to FontLab Studio once you feel you’ve reached its limitations.\n\n"
    },
    {
      "time": " 19.Aug.2007 9.50am",
      "content": "Fernando, here are some pointers:\n\n- here is [the website of the movie <cite>Helvetica</cite>](http://web.archive.org/web/20080830000219/http:/www.helveticafilm.com/);\n- here are [the search results for “helvetica” on YouTube](http://web.archive.org/web/20080830000219/http:/www.youtube.com/results?search_query=Helvetica), possibly referring to the clips mentioned earlier in the thread;\n- here are some [past threads](http://web.archive.org/web/20080830000219/http:/www.google.com/search?q=helvetica+movie+site:typophile.com) on Typophile that talk about the movie;\n\nCheers.\n\n"
    },
    {
      "time": " 19.Aug.2007 9.53am",
      "content": "Thanx verbosus :)\n\n"
    },
    {
      "time": " 19.Aug.2007 9.59am",
      "content": "I think it was probably 1993 when I first dabbled in font creation with Fontographer. For whatever reason my enthusiasm waned after a few years, and it wasn’t until November of 2006 that I took it up again. I initially bought the Fontographer upgrade. Later I upgraded to FontLab Studio to get support for OpenType. So far it’s been an enjoyable experience. Leslie Cabarga’s book “Learn FontLab Fast” was a big help in getting up to speed. I don’t consider myself to be in the same league with the gurus here, but I hope someday to sell some of the work I’m doing. My abilities are much improved over what they were in the 90s. I still do most of my work in Illustrator and then bring it into FontLab Studio for tweaking.\n\nI wouldn’t worry too much about the software. It’s not that hard to learn. Coming up with the font is going to be the difficult part, but I’m guessing you already have a concept drawn up that you are happy with. Otherwise you wouldn’t be so confident about forcing other people to use it. :-)\n\n"
    },
    {
      "time": " 19.Aug.2007 10.10am",
      "content": "\\>I am an Art Director in London for a major client.\n\n\\>What I have been thinking about doing for a long time now is, to design a font for my client that would hopefully become synonymous with its brand.\n\n\\>The brand is worked on by many designers globally\n\nI saw a t-shirt one that read “Who died and made you Matthew Carter” ;-)\n\nNo disrespect here but you plan to design a new multi-lingual branding typeface for a “major client”, using free or cheap software and your only type design expereince was 12 years ago in school in Canada?\n\nIf making a branding typeface for this or any other client really is your life’s ambition my feeling here is that you don’t need software, you need training. Maybe the MA course at Reading? But if I were in your shoes I’d look for a local, professional, established type designer who could transform your ideas (maybe sketched in Illustrator or on paper) into a high-quality typeface.\n\nCheers, Si\n\n"
    },
    {
      "time": " 19.Aug.2007 12.01pm",
      "content": "Si, absolutely. I mean no disrespect to the people who dedicate themselves to font design by implying I can just pick up any tool and throw out a face, especially with my knowledge of face design. But it has always been something Ive been quite interested in my whole career and I continuously am looking at the work of my team and peers to assess face choices, typography etc. My idea was to simply begin teaching myself font design and tie in my client as a motivator.\n\nAs for all the suggestions, thanks a ton. I downloaded the fontlab demo and it seems pretty slick. I have already kicked out a spastic altered version of garamond and installed it successfully. I guess a question I should be asking is, what is a good resource on the basics of face design?\n\n"
    },
    {
      "time": " 19.Aug.2007 3.23pm",
      "content": "The best single thing is [Briem’s Site](http://web.archive.org/web/20080830000219/http:/briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm). Then there are books, such as Tracy’s superb ’Letters of Credit’ and many others...\n\nCabarga’s book [Learn FontLab Fast](http://web.archive.org/web/20080830000219/http:/www.logofontandlettering.com/) is essential if you are using FontLab.\n\n"
    },
    {
      "time": " 19.Aug.2007 3.42pm",
      "content": "[Designing Type](http://web.archive.org/web/20080830000219/http:/www.amazon.com/Designing-Type-Karen-Cheng/dp/0300111509) by Karen Cheng is a nice book in my opinion.  \nAs William already pointed out, Briem’s site is excellent as wel.  \n [Underware’s](http://web.archive.org/web/20080830000219/http:/www.underware.nl/) [Type Basics](http://web.archive.org/web/20080830000219/http:/www.typeworkshop.com/index.php?id1=type-basics) cover the _very_ basic aspects of type.  \nThe [Character Design Standards](http://web.archive.org/web/20080830000219/http:/www.microsoft.com/typography/developers/fdsspec/overview.aspx) on Microsoft.com are also usefull, be sure to check it out.\n\nThere’s more, but I can’t find my bookmarks at the moment. :)\n\n"
    },
    {
      "time": " 19.Aug.2007 4.02pm",
      "content": "Jelmar, if <cite>Designing Type</cite> had another title it would be all right, yes, but since it deals more with single letterforms than with typefaces as a whole I share [Peter Biľak](http://web.archive.org/web/20080830000219/http:/www.typotheque.com/articles/designing_type_/)’s disappointment with it. <cite>Designing Letters</cite>, maybe?\n\nEarl’s <cite>Designing Typefaces</cite> is nice as well, but I was expecting a bit more than “just” interviews with type designers of note. Of course it was my fault for buying the book without reading more about it in advance.\n\nAs for other titles: Tiffany and Eben are mantaining a nice list of [books about type design](http://web.archive.org/) for us Typophiles.\n\n"
    },
    {
      "time": " 19.Aug.2007 4.03pm",
      "content": "[faq design](http://web.archive.org/web/20080830000219/http:/typophile.com/wiki/faq%252Bdesign)\n\nif you’re interested in learning how to design type, also check out the [how-to](http://web.archive.org/web/20080830000219/http:/typophile.com/wiki/how-to) section of the [typowiki](http://web.archive.org/web/20080830000219/http:/typophile.com/wiki/typowiki).\n\n"
    },
    {
      "time": " 19.Aug.2007 6.30pm",
      "content": "Antonio, you’re right that it mostly is about individual letterforms, and I agree with Bil’ak as well, but I found it pretty interesting nonetheless. For example, it shows a lot of insight in how certain problems (like optical corrections and such) have been adressed through the ages.\n\nI also liked Leslie Cabarga’s [Logo, Font & Lettering Bible](http://web.archive.org/web/20080830000219/http:/www.amazon.com/Logo-Font-Lettering-Bible-Comprehensive/dp/1581804369), although it’s a bit too humoristic for my taste. But the content itself is quite good.\n\n"
    },
    {
      "time": " 20.Aug.2007 1.22am",
      "content": "Not to forget Jonathan Hoefler’s type design 101 in the Resource section:  \n [http://typophile.com/courses/type101](http://web.archive.org/web/20080830000219/http:/typophile.com/courses/type101 \"http://typophile.com/courses/type101\")\n\n"
    },
    {
      "time": " 20.Aug.2007 2.28am",
      "content": "Again thanks to all. These resources look perfect. I guess I shouldve checked out Typowiki before opening my mouth. I think I have put together my first idea for a font (thats outside of mu client) just to get familiar with the concepting, designing and building of a face. I can see this getting very addictive. Thanks again. I have so many questions though that I dont want to spam in the forums as they may seem to be common sensed to many of you. Is there anyone out there that is willing to answer a bunch of questions I have via email?\n\n"
    },
    {
      "time": " 20.Aug.2007 2.46am",
      "content": "I think many of would be willing but I think it is to your benefit to get multiple points of view - so I suggest that you post individual questions and see what response you get to them.\n\nI also want to echo Si’s sentiments that if you want to make a custom face for a client soon ( Say in less than 2 years or more ) you might be better off partnering with an individual or a type group. There are many options and a great deal of skill to lean into. Doing that could be a great education in itself.\n\nI also want to caution you against altering a face to create a new one. They almost never feel right or add value - pretty much the reverse. Drawing from scratch is the way to go.\n\nYou are right. This is addictive stuff.\n\n"
    }
  ]
}
