{
  "id": "36282",
  "title": "Problem - Adobe Creative Suite bundled fonts can't be used in other apps",
  "forum": "Build",
  "tags": [

  ],
  "content": "Can anyone help?\n\nI’m using CS2 on both Windows 2000 and Windows XP.\n\nThe fonts bundled with Adobe apps are installed into \\Program Files\\Common Files\\Adobe\\Fonts rather than \\WINNT\\Fonts. This appears to make them available only to Adobe apps (and not MS Office or Quark).\n\nI can work around this by copying shortcuts to the required fonts into \\WINNT\\Fonts, but given I can only seem to find oblique references to this, I’m starting to wonder whether this is a bug or intended operation. Any advice?\n\n [‹ CS hinting in OS X -- what's going on?](http://web.archive.org/web/20071104014644/http:/www.typophile.com/node/36019 \"Go to previous forum topic\") [OpenType, Bengali and reph/vattu ›](http://web.archive.org/web/20071104014644/http:/www.typophile.com/node/35416 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071104014644/http://www.typophile.com/user/7181\" title=\"View user profile.\">elliot100</a>",
  "time": "<br>",
  "uid": "7181",
  "comments": [
    {
      "time": " 20.Aug.2007 7.27am",
      "content": "I’m on a Mac, but the general setup is similar: the bundled fonts are automatically installed in an Adobe folder; to use them in other applications, I believe that moving the font files to the folder where you usually have active fonts installed would do the trick. They would still be accessible to the Adobe apps.\n\n"
    },
    {
      "time": " 20.Aug.2007 7.36am",
      "content": "Thanks - not just me then.\n\nYes, either copying the fonts themselves or shortcuts to them to the normal font folder works fine, but I wonder if there are licence considerations?\n\n"
    },
    {
      "time": " 20.Aug.2007 2.19pm",
      "content": "\\> _but I wonder if there are licence considerations?_\n\nIt’s OK to move the fonts to another folder and use them with non-Adobe apps (assuming that you have a legit CS2 license to start with). BTW, starting from CS3 the fonts are installed in a system-level fonts’ folder.\n\n"
    },
    {
      "time": " 21.Aug.2007 1.58am",
      "content": "Cheers Miguel. Yes, I have Photoshop and/or Illustrator licences for each machine.\n\nIs that your understanding from the EULA or do you have a definitive answer from Adobe?\n\nInteresting point on CS3.\n\n"
    },
    {
      "time": " 21.Aug.2007 2.40am",
      "content": "Miguel works for Adobe.\n\n"
    },
    {
      "time": " 21.Aug.2007 4.38am",
      "content": "Aha! Sorry Miguel and many thanks.\n\n"
    }
  ]
}
