{
  "id": "36288",
  "title": "2001 a space odyssey-HAL screens typeface, and Bladerunner vehicle screens typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nA very obscure topic I know...  \nBut It's a question that I've wondered ever since I saw Bladerunner, the R.Scott sci fi movie  \nHas anyone noticed that Bladerunner uses a similar 3 character screen motif in some gui mock-ups very similar to the HAL 9000 screens in 2001?\n\nI'd always thought that Eurostyle would be a good approximation for the HAL typeface in bold (possibly extended? - I'm not that familiar with eurostyle)  \ndoes anyone know what the actual typeface used was?\n\n ![](http://web.archive.org/web/20150331000755im_/http:/typophile.com/files/HAL_6499.gif)\n\nshould I post this to font ident forum?  \nI hesitate, because I have such a poor screenshot.\n\n",
  "author": "withlouis",
  "time": "20 Aug 2007 — 6:52am",
  "uid": "19913",
  "comments": [
    {
      "time": "20 Aug 2007 — 7:21am",
      "content": "Hmm, looks like [Microgramma](http://web.archive.org/web/20150331000755/http:/www.myfonts.com/fonts/ef/microgramma/) (1952) by Aldo Novarese who later designed the <cite>improved</cite> Eurostile.\n\n"
    },
    {
      "time": "20 Aug 2007 — 8:20am",
      "content": "Yes. I think you are right.  \nlooking again at some youtube extracts that show different characters I'd say it looks like microgramma.  \n(even though eurostile is similar, microgramma has a more rounded junction within its joins, which are evident.)\n\nthanks Geoff.\n\n"
    },
    {
      "time": "20 Aug 2007 — 8:57am",
      "content": "Well, Microgramma/Eurostile and its sibling Handel Gothic seem to be the favorite fonts of sci-fi filmmakers. Although it takes quite a leap of faith to believe that the other 12 human tribes developed the same alphabet and typefaces as we did during the eons we were divided & yet — managed to get the form factor of books, paper and screens completely wrong, with these cut-off corners… ; )\n\nI refer to Battlestar Galactica, of course.\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "20 Aug 2007 — 10:35am",
      "content": "[Kubrick](http://web.archive.org/web/20150331000755/http:/film.guardian.co.uk/features/featurepages/0%2C4120%2C1177734%2C00.html) was a Futura fan.\n\nTim\n\n"
    }
  ]
}
