{
  "id": "36307",
  "title": "Choose Five Typefaces to use for a Year",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A while ago me & Kris were nerding out and talking about the Vignelli thing, which led to\n\n“what if you could only use five typefaces for a year” (Say If money was not an option).\n\nI think I said:\n\nTrinite  \nArnhem  \nGalaxie Polaris  \nNational\n\nannd.... hmmm, maybe Serapion (I can’t remember my 5th one).\n\nGo on try it.\n\n [‹ No posts allowed](http://web.archive.org/web/20080906154337/http:/typophile.com/node/36430 \"Go to previous forum topic\") [Where to start? ›](http://web.archive.org/web/20080906154337/http:/typophile.com/node/36403 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906154337/http://typophile.com/user/12186\" title=\"View user profile.\">Duncan Forbes</a>",
  "time": "<br>",
  "uid": "12186",
  "comments": [
    {
      "time": " 20.Aug.2007 2.50pm",
      "content": "if you like serapion, check out the recently released [Anselm type system](http://web.archive.org/web/20080906154337/http:/www.stormtype.com/typefaces-fonts-shop/collections-14-anselm-complete), it’s Serapion/Sebastion reigned in a bit for text work. This would be one of my choices, but does it count as 1 or 2 selections? or am i completely over the limit of 5? :P\n\n"
    },
    {
      "time": " 20.Aug.2007 2.50pm",
      "content": "— Arnhem  \n— Quadraat  \n— Legato  \n— Fedra Serif  \n— Akzidenz\n\n— Monotype Grotesque (I’ll take your spare 5th place)\n\n"
    },
    {
      "time": " 20.Aug.2007 2.53pm",
      "content": "<cite>if you like serapion, check out the recently released Anselm type system</cite>\n\nYeah I saw these yesterday.. not sure what to make of them yet...\n\n"
    },
    {
      "time": " 20.Aug.2007 2.58pm",
      "content": "_not sure what to make of them yet..._  \ni’ve been drooling over it, as i’ve been drooling over national grotesque as well. can’t wait to see that one come out!\n\n"
    },
    {
      "time": " 20.Aug.2007 3.15pm",
      "content": "<cite>i’ve been drooling over it, as i’ve been drooling over national grotesque as well. </cite>\n\nHaha, yeah National is nice to set, I use it heaps. Anselm will be great of course, storm is a great designer, and I really like Sebastian and Serapion (which I have been using in the last few days). I need to read about Anselm more I reckon.\n\n"
    },
    {
      "time": " 20.Aug.2007 3.58pm",
      "content": "<cite>can’t wait to see that one come out!</cite>\n\nSoon, bro! I had to do a whole lot of work on it, Victoria University (in Wellington) commissioned custom weights of National, National Compressed, Newzald & Newzald display. I was also working on Meta Serif at the same time, so ended up kerning a billion styles and I’m kinda over them at the mo. I need to let National & Newzald rest a while before I can get back to them and kern the SC with fresh eyes.\n\nNow, my list. Hard, but I reckon, in no particular order:\n\nLexicon  \nMiller  \nMeta  \nMeta Serif  \nNational\n\nThat would be enough for a year I think. I am a bit hesitant about National, but have been using it a bit and quite like it. Most of the time I get so sick of seeing/designing my own faces that I can’t stand to use them! (As Meta S was shared, that’s a bit different).\n\nHas anyone limited themselves to 5 faces for a year?\n\n"
    },
    {
      "time": " 20.Aug.2007 4.19pm",
      "content": "“Has anyone limited themselves to 5 faces for a year?”\n\nThat would be more like a few years, working as an inhouse designer, hence, why I recently stumbled on this site for inspiration. Mmm, National, Meta nice.\n\nTwo that I know I could enjoy for a year: DTL Nobel and Tribute. I don’t know how practical Nobel is for everyday use, but I really think Tribute is beautifully done. The other three I would want to use seem to be impractical choices of historical script/handwriting, that have been overused anyway.\n\n"
    },
    {
      "time": " 20.Aug.2007 4.33pm",
      "content": "Eureka  \nMyriad  \nSabon  \nMT Grot  \nFF DIN\n\n"
    },
    {
      "time": " 20.Aug.2007 4.58pm",
      "content": "Eureka, Myriad and DIN,\n\nYour keen!\n\nPaul, I reckon you can have sans and serif Anselm as two choices... so one family equals one!\n\nPretty hard to choose\n\n"
    },
    {
      "time": " 20.Aug.2007 5.38pm",
      "content": "If money wasn’t an option, I’d say:\n\nVerlag  \nGreta  \nKlavika  \nMiller  \nBello\n\n"
    },
    {
      "time": " 20.Aug.2007 5.54pm",
      "content": "the Money typeface.... hmmmm\n\n\\>^p\n\ni think i’d need some kind of over-the-top script face. maybe i can get together with Ale and he could help me come up with something. heh\n\n"
    },
    {
      "time": " 20.Aug.2007 5.55pm",
      "content": "I think these are five I would enjoy for a year.\n\nDolly, which I am using now on a site. Love the small caps.  \nSauna  \nFB Hermes (Don’t have it, but something about it grabs me.)  \nTitling Gothic  \nApex\n\nSharon\n\n"
    },
    {
      "time": " 20.Aug.2007 5.55pm",
      "content": "Hmm, I don’t think I’d cope with only five but if I had to and if money were of no object...\n\nLexicon, it’s like a Ferrari, I have a copy of the NRC Handelsblad and gorgeous print outs from TEFF but it’s only a dream.  \nQuadraat  \nQuadraat Sans  \nMiller  \nMaple, although could’ve been National if I could get my hands on it.\n\n"
    },
    {
      "time": " 20.Aug.2007 7.26pm",
      "content": "Okay, so I’ll take a piece of this. Mine are prob’ly fairly mundane compared to some of the choices I see here, many of which I must admit to hearing of for the first time. (Okay, so I’m a mere drudge.)\n\nSabon  \nBauhaus  \nPalatino  \nAdobe Futura 1  \nMath-Pi (lumping the whole family of 1-6 together as one)\n\n"
    },
    {
      "time": " 20.Aug.2007 8.29pm",
      "content": "I’d have to have one quirky/playful font. Preferably one with versatility, a hand font would be nice bonus too.\n\nSo for this I’d be happy with the **[Panoptica family](http://web.archive.org/web/20080906154337/http:/www.shinntype.com/)** (lumping families is allowed, I believe). It has a serif, 3 weights of sans, script (shown below), egyptienne, and whatnot...\n\n ![](http://web.archive.org/web/20080906154337im_/http:/typophile.com/files/pano_5602.gif)\n\nFor the other four, I’d be happy with many of everyone else’s choices, I imagine.\n\n"
    },
    {
      "time": " 20.Aug.2007 8.31pm",
      "content": "<cite>i think i’d need some kind of over-the-top script face.</cite>\n\nI’d think if anyone could do that, you could. And I mean that in a good way.  \n; )\n\n"
    },
    {
      "time": " 20.Aug.2007 9.14pm",
      "content": "Garamond Premiere Pro  \nProxima Nova - Mark, I’m saving up for it...  \nsome nice big Egyptian family, maybe Giza?  \nHelvetica Neue  \nQuadraat\n\n—-\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20080906154337/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\")\n\n"
    },
    {
      "time": " 20.Aug.2007 9.34pm",
      "content": "i think i’d want Beorcana on my list... i got 1 more.\n\n"
    },
    {
      "time": " 20.Aug.2007 11.43pm",
      "content": "Stone Cycles  \nDTL Elzevir  \nFF SuperGrotesk  \nH&FJ Verlag  \nVillage Apex New\n\n"
    },
    {
      "time": " 20.Aug.2007 11.59pm",
      "content": "Akkurat  \nRhode  \nFabiol  \nProxima Nova  \nShire Types\n\nThis is enough to explode my yearly font budget.\n\n"
    },
    {
      "time": " 21.Aug.2007 6.49am",
      "content": "Having this discussion in the studio the other designers and a web monkey.  \nHe likes...\n\nHelvetica.  \nUnivers  \nBaskerville  \nAkzidenz  \nThe Serif\n\n"
    },
    {
      "time": " 21.Aug.2007 9.07am",
      "content": "Myriad Pro  \nHelvetica  \nAdobe Garamond Pro  \nBodoni  \nBaskerville\n\n"
    },
    {
      "time": " 21.Aug.2007 9.07am",
      "content": "Myriad Pro  \nHelvetica  \nAdobe Garamond Pro  \nBodoni  \nBaskerville\n\n"
    },
    {
      "time": " 21.Aug.2007 9.09am",
      "content": "Crikey! You seem to have a knack for that double post.\n\n"
    },
    {
      "time": " 21.Aug.2007 10.03am",
      "content": "Greta Text  \nMeta  \nFedra Serif  \nFedra Sans Alt  \nFresco (+Sans)\n\nsomething like that...\n\n"
    },
    {
      "time": " 21.Aug.2007 10.39am",
      "content": "Greta is surprisingly popular. Can anyone explain? (Not that I don’t like it, cause I do)\n\n"
    },
    {
      "time": " 21.Aug.2007 11.02am",
      "content": "It is a beautiful family of fonts. But I think one reason it is so popular right now is that it is newly released an many people might be admiring the equally beautiful specimen. (I got mine at TypeCon this year.)\n\n"
    },
    {
      "time": " 21.Aug.2007 11.44am",
      "content": "All the typotheque families seem to very popular at the minute to be honest...\n\n"
    },
    {
      "time": " 21.Aug.2007 2.40pm",
      "content": "I first saw Greta Text when it was on the [TDC’07 site.](http://web.archive.org/web/20080906154337/http:/www.tdc.org/news/2007Results/GretaText.html) I immediately liked it, even before I got the specimen by mail. I don’t really know why. I think it just looks very, very balanced in design. Good proportions. Somewhat classic, but very modern in execution. Something like that. :)\n\n"
    },
    {
      "time": " 21.Aug.2007 2.45pm",
      "content": "Ah I’ll let that stand as a correction. Maybe it was the award from TDC. Either way I’m not arguing that Peter’s work isn’t popular. His work has been popular for a while now. I was just pointing out why Greta might be on the tip of everyone’s tongue.\n\n"
    },
    {
      "time": " 21.Aug.2007 2.55pm",
      "content": "Courier  \nCourier New  \nHelvetica  \nTimes  \nTimes New Roman\n\n"
    },
    {
      "time": " 21.Aug.2007 6.33pm",
      "content": "Univers - My workman font  \nITC Bodoni - My classy font  \nMrs. Eaves - My funky font  \nAdobe Jenson Pro - My gritty, human font  \nAvenir - My clean font\n\nActually, these I could live with forever as far as I’m concerned. (Although, I would consider Stone’s newer Swash Bodoni in the same category as ITC Bodoni...)\n\n"
    },
    {
      "time": " 21.Aug.2007 9.22pm",
      "content": "I worked from 1964 until 1976 using a single typeface. Books, wedding invites, business cards, major advertising launches with a single typeface. Caslon Oldstyle.\n\nThe typeface does not make the “designer”. With a single disclaimer, “Pick a face you can live with”.\n\n"
    },
    {
      "time": " 22.Aug.2007 6.51am",
      "content": "Interesting. I would have to stick close to David Hamuel’s choices:  \nLucida Grande, my OS font.  \nConcert 10, my email font.  \nTimes and Arial, the defaults that are hard to escape.  \nPoynter 16, my escape from the defaults.  \nand then I would have to use Helvetica, and Highway Gothic if went outside to any great distance...  \nOtherwise, i.e. if I didn’t use these six, I’d be unable to even get here to discuss the next 6. :-)  \n(I’m not sure of the default fonts for FontLaff, but those’d have to be included too...Maybe I don’t need Arial...)  \nCheers!\n\n"
    },
    {
      "time": " 22.Aug.2007 7.04am",
      "content": "Perpetua  \nITC Officina  \nBaskerville Small Caps  \nUnivers  \nZapfino\n\n"
    },
    {
      "time": " 22.Aug.2007 9.10am",
      "content": "I didn’t count all those interface/OS fonts. I don’t use them, my computer does. :-)\n\nSharon\n\n"
    },
    {
      "time": " 22.Aug.2007 9.25am",
      "content": "Helvetica Neue  \nAG  \nUnivers  \nFrutiger  \nand myriad of course! aha  \nAnd i request Times New Roman as bonus\n\n"
    },
    {
      "time": " 22.Aug.2007 10.11am",
      "content": "Too hard.  \nBut i do use these too much:\n\nVerdana  \nRockwell  \nGill Sans (a filthy habit, but i love it!)  \nThesis  \nUnivers\n\n"
    },
    {
      "time": " 22.Aug.2007 11.43am",
      "content": "Helvetica Neue  \nFournier  \nGotham  \nOptima  \nBodoni\n\n"
    },
    {
      "time": " 22.Aug.2007 12.23pm",
      "content": "Oh... this is fun... I haven’t given it enough thought, but:\n\nHelvetica Neue  \nFutura (a bad habit, maybe, but it never lets me down)  \nAdobe Garamond Pro  \nKontrapunkt\n\nAnd I feel like I need a script... what is life without swashes?\n\nBickham Script Pro?  \nCezanne Pro?\n\nI’ve run out of steam...\n\n"
    },
    {
      "time": " 22.Aug.2007 1.52pm",
      "content": "The thing is if you are a web designer you would be stuck with only 5 (or less) typefaces you would use. ;)\n\n"
    },
    {
      "time": " 22.Aug.2007 9.34pm",
      "content": "There is definitely not enough linking going on in this thread.\n\n"
    },
    {
      "time": " 23.Aug.2007 6.13am",
      "content": "[Scala](http://web.archive.org/web/20080906154337/http:/www.myfonts.com/fonts/fontfont/ff-scala/) and [Scala Sans](http://web.archive.org/web/20080906154337/http:/www.myfonts.com/fonts/fontfont/ff-scala-sans/)\n\nHmmm. . . . [Golden](http://web.archive.org/web/20080906154337/http:/www.myfonts.com/fonts/linotype/itc-golden-type/)? Something like that, useable for body text, but especially well suited to titling, display, or shorter units.\n\nAnd if I go that way, I’ll need something modern (but versatile) for my fourth — perhaps one of Font Bureau’s rich sans families. I love Porchez’s typefaces; maybe [Anisette](http://web.archive.org/web/20080906154337/http:/www.myfonts.com/fonts/fontbureau/anisette/) would do for this slot.\n\nAnd then a face that draws on the ancient and modern, but with curves and drama (one of the modern uncials, or perhaps Stone [Munc](http://web.archive.org/web/20080906154337/http:/www.myfonts.com/fonts/stone/munc/)?). A calligraphic face, but not a script (don’t like script faces); [Cataneo](http://web.archive.org/web/20080906154337/http:/www.myfonts.com/fonts/bitstream/cataneo/)? [Scrivano](http://web.archive.org/web/20080906154337/http:/www.myfonts.com/fonts/outras/scrivano/)? I’d choose from among those, or page through Font Bureau’s catalogue till I fell in love.\n\n"
    },
    {
      "time": " 23.Aug.2007 10.25am",
      "content": "I would like to add the links to my post, however, my post would then be kicked to the bottom. Stupid bug.\n\n"
    }
  ]
}
