{
  "id": "36301",
  "title": "The 'edge effect,' 'notan,' and 'even color' in type design",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In his book ’While You’re Reading,’ just out in an English edition, Gerard Unger discusses the ’ [edge effect](http://web.archive.org/web/20081202203919/http:/www.typophile.com/wiki/edge%252Beffect)’, whereby the eye increases the apparent contrast at edges between black and white.\n\nThe edge effect is, I now learn by googling, an instance of a well confirmed phenomenon of perception known as lateral inhibition. [Here](http://web.archive.org/web/20081202203919/http:/en.wikipedia.org/wiki/Lateral_inhibition) is a brief explanation of it on the Wikipedia. And [here](http://web.archive.org/web/20081202203919/http:/serendip.brynmawr.edu/bb/latinhib.html) is a longer introduction to the science, with links and bibliography.\n\nThe idea is that the brain wants to pick out edges in the visual field, and our neural networks make the black apparently blacker and the white apparently whiter at an edge in order to facilitate this. In other words, the visual network exaggerates contrast so that the brain can identify edges more easily.\n\nGerrit Noordzij has also noted this effect and its relevance to type design, though I don’t remember him using this label of ’edge effect’.\n\nThis phenomenon I think sheds light on the issues of ’ [notan](http://web.archive.org/web/20081202203919/http:/www.typophile.com/wiki/notan)’ we have been discussing on Typophile. In particular, Frutiger is reported on the Linotype site as having the goal of ’activating the whites’ in his design of letters and inter-letter spaces.\n\nMy feeling is that this ’activating the whites’ is largely a matter of shrewd exploitation of the edge effect.\n\nHere for illustration is the ’e’ from Frutiger vs the ’e’ from Myriad—a subject in the ’rip off artists’ thread.\n\n ![](http://web.archive.org/web/20081202203919im_/http:/www.typophile.com/files/Frutiger%20vs%20Myriad%20e_4786.gif)\n\nNote how the Frutiger ’e’ uses the edge effect to ’activate the whites’ more than Slimbach and Twombly’s Myriad.\n\nFirst the top of the e and the bar are thicker than Myriad, and the eye narrower. I am guessing that a thick black will have more ’edge effect’ than a thin one, and that seems to be the case here. These decisions together make the ’edge effect’ ’light up’ the eye of the Frutiger e more than the Myriad e.\n\nIn addition, Frutiger cuts the terminal vertically, and flares the terminal upward. This increases the ’edge effect’ also for the terminal, so it is more vibrant, and it probably combines with the edge effect on the bottom of the bar, so creating a white spot between the terminal and the bar. By contrast, Myriad slims down the terminal, and cuts it at a diagonal, probably both reducing the edge effect.\n\nI don’t think the question here is one of better or worse, but of different design decisions. Frutiger wanted a vibrant face for signage. Twombly and Slimbach I think were going for a more calm text face. Myriad is also a bit narrower, more traditional ’humanist’ proportions.\n\nmore to come...\n\n [‹ Great site with tons of old posters](http://web.archive.org/web/20081202203919/http:/www.typophile.com/node/36444 \"Go to previous forum topic\") [Antikva Margaret ›](http://web.archive.org/web/20081202203919/http:/www.typophile.com/node/16680 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202203919/http://www.typophile.com/user/1551\" title=\"View user profile.\">William Berkson</a>",
  "time": "<br>",
  "uid": "1551",
  "comments": [
    {
      "time": " 20.Aug.2007 11.03am",
      "content": "\\> different design decisions. Frutiger wanted a vibrant face for signage. Twombly and Slimbach I think were going for a more calm text face.\n\nInteresting, as I was reading the first part of the post, I was wondering if this edge effect thing (I have not read Unger, yet) applied to all type, or only to display sizes. It just seems to me that an effect of this kind cannot be processed on text sized type.\n\nAm I on target there?\n\n"
    },
    {
      "time": " 20.Aug.2007 2.02pm",
      "content": "I would have thought it was the other way round. I think that the edge effect only affects a narrow band around the edge; at display sizes, you mostly see what’s there, but at text sizes, the edge is relatively larger, and it’s small enough for your eyes (really your brain) to deceive you.\n\nI hope that makes sense.\n\n"
    },
    {
      "time": " 20.Aug.2007 3.14pm",
      "content": "I think the edge effect takes place at every size, though there may be some scale effect. I haven’t yet read the literature. It is also interesting that more is going on in the interaction of black and white than the edge effect alone—or at least the edge effect is complex.\n\nThere is an illusion known as the Hermann grid illusion, which you can see here:\n\n ![](http://web.archive.org/web/20081202203919im_/http:/www.typophile.com/files/Hermann_grid_illusion_3451.svg.png)\n\nThis was explained by the ’lateral inhibition’ and the edge effect, but that explanation as the whole story has been refuted by a [version with wavy lines](http://web.archive.org/web/20081202203919/http:/www.michaelbach.de/ot/lum_herGridCurved/index.html), in which the phantom grays at the intersections disappear.\n\nEvidently, it makes a difference whether lines are straight, and whether they are horizontal and vertical etc.\n\nThough it works at text and display sizes, the question is where it is appropriate. In another discussion, I questioned whether the ’picket fence’ effect was something always to be avoided in type design. Nick Shinn rightly pointed out that in display type particularly you might want ’dazzle’. He designed [Eunoia](http://web.archive.org/web/20081202203919/http:/shinntype.com/) specifically to have that dazzle.\n\nI think in the lower case of text types it should really be avoided and counteracted.\n\n"
    },
    {
      "time": " 20.Aug.2007 6.05pm",
      "content": "I put ’even color’ also in the title of this thread also, so here are my ruminations after reading about the ’edge effect’.\n\nThere are three different aspects of the relationship between black and white involved in a good roman text face.\n\n1. Use or avoidance of the edge effect to enhance ’activate’ the whites possibly even having ’dazzle’, as discussed above.\n\n2. A degree of regular rhythm or periodicity of the black verticals. This has been shown by Fourier transforms, and provides a regularity or grid against which the varying shapes of the letters are detected or ’read’ by the eye and brain.\n\n3. Evenness of color. The density of the blacks in each letter, within the x-height particularly, is similar, and distributed in as balanced as way as the letter permits. This avoids distraction from the distinctive letter shape as the only different thing to be detected or read by the eye.\n\nOne more thought:\n\nCould the edge effect or ’lateral interference’ be a reason why screen type is hard to read? Does low resolution and lit-from-behind type cause the neural network to be taxed?\n\n"
    },
    {
      "time": " 21.Aug.2007 2.07am",
      "content": "This is an interesting summation. Thanks for doing the work to build it up!\n\n1. I think that the ’edge effect’ is a hardwired optical illusion or that is of course part of the basic reality of whatever visual stimulus is being considered. In a way Notan is an acknowledgment that while we have ways of cutting up & interpreting and labeling things especially in terms of light & dark; there is ’a priori’ to any of that; a sensory reality which is a totality not a duality. So yes indeed; the edge effect can help to explain some phenomena within a person’s pre-analytic (Notanic) visual experience.\n\nSo I agree that the ’edge effect’ can be considered syththeticly with Notan. One way of synthesizing the two might be to say that while a machine, let’s say a scanner may detect the actual or measurable values of - let’s say of a page of text - it’s the human sensing of that page including many factors/illusions such as the ’edge effect’ but before conceptualization occurs that is the Notan of that page.\n\n2. I think that while you can find rhythm or periodicity in some latin text forms, and the latin text may benefit from it to some minor degree I am having trouble making a meaningful connection of Notan or the ’edge effect’ to it. To my way of thinking the edge effect would of course be present it because edges are involved but that seems to be the end of it. Maybe I am missing something.\n\n3. <cite> This avoids distraction from the distinctive letter shape as the only different thing to be detected or read by the eye. </cite> You put this well. Of course I prefer to think of Notanic balance because ’evenness’ sounds a little too mechanical, programatic or even literal (50/50) to me. Nonetheless I agree that whatever you call it - the goal should be to support rapid accurate recognition/processing of the forms by minimizing tonal distractions.\n\nWould you expand on your ideas about the screen?\n\nI have been hearing about how low rez sound taxes the brain to fill-in the missing music which leaves the brain less receptive to emotional content in the music. Do you have something like that in mind?\n\n"
    },
    {
      "time": " 21.Aug.2007 9.17am",
      "content": "Eben, after reading about the edge effect, I am thinking that it is more useful to think of specific aspects of the black-white relationship in type, rather than talking about ’notan’ generally. For it seems that they are different variables as far as perception.\n\nThe stuff about ’activating the whites’ or ’designing the whites’ I am thinking is mainly about using the edge effect to make letters more vibrant, though Frutiger may have had more in mind.\n\nYes, I think a periodicity is quite a different variable from the edge effect. It does concern the distribution of black and white, though, especially through spacing. I think that it is a major, not minor matter in text. This is reinforced by an illustration in Unger’s book, where he has excessively tight, loose, and irregular spacing. The irregular spacing is strikingly the most disruptive to reading.\n\n\\>I prefer to think of Notanic balance\n\nAs I said, I think using this one term is misleading because it puts these different phenomena—edge effect, periodicity, and even color, all in one basket. There are several balances going on, not just one. They are different and may be at odds with one another.\n\nAbout the screen, I don’t have any definite theory about it. It just seems to me that if the edge effect is so fundamental a part of our perceptual apparatus—and it seems to be—it may be that the screen is disrupting its normal functioning. This may either be because of ’jaggies’ that interfere with edge perception, or because the lighting of the whites makes contrast too strong. I don’t know what is going on, but it seems to me likely that the screen is playing havoc with some fundamental processes.\n\n"
    },
    {
      "time": " 21.Aug.2007 10.39am",
      "content": "Edges are fundamental to human vision. It starts in the retina with the ganglion cells. These cells become activated when a there is a difference between the light in the center of its response field and the surround of its response field (a local edge). The visual cortex then looks for patterns in the ganglion cells that make up lines and arcs in different orientations (longer edges). These lines and arcs are the beginning steps of all object recognition, including reading.\n\n"
    },
    {
      "time": " 21.Aug.2007 12.38pm",
      "content": "Nice post Kevin! What do you think Frutiger had in mind when he was talking about ’activating the whites’? My sense has always been that he meant that you have to make the white a deliberate/conscious part of your design rather than as Bill would have had it previously - that it has to do with creating extra edge effect or creating ’sparkle’. In other words I think of ’activating the whites’ as a global value rather than a discreet value.\n\nIn contrast I think of ’edge effect’ as something to be modulated in discreet areas of the design. So like Bill seems to be suggesting I do think that there is something to the idea of deliberately introducing sparkle especially where you are working with what Peter Enneson the salient feature - the part of the glyph that most helps you to recognize it.\n\n"
    },
    {
      "time": " 22.Aug.2007 5.59am",
      "content": "Great thread, William!\n\nChrisL\n\n"
    },
    {
      "time": " 22.Aug.2007 10.25am",
      "content": "I don’t know what Frutiger meant by activating the whites, nor do I understand how to leverage the edge effect. Mach bands show that our vision system enhances edges, even when the edges already have sharp boundaries between black and white. When the edges are less sharp, such as with newspaper print or on-screen type, our vision system helps us by sharpening these edges too. [http://en.wikipedia.org/wiki/Mach\\_bands](http://web.archive.org/web/20081202203919/http:/en.wikipedia.org/wiki/Mach_bands \"http://en.wikipedia.org/wiki/Mach\\_bands\")\n\nThere is a lot of work being done in visual psychophysics on spatial frequencies. It’s believed that the vision system is spatial frequency tuned. The stimuli tend to be fields sinusoidal gradients (smooth alternating gradients of black and white). It’s not clear how these simple stimuli apply to more complex stimuli like letters.\n\n"
    },
    {
      "time": " 22.Aug.2007 10.42am",
      "content": "Thanks, Chris.\n\nEben, I think that the general idea of making white shapes a conscious part of the design process is, as you say, meant by Frutiger in his comments about ’designing the whites’. And this comment is a direct influence of the Chinese and Japanese ideas about dark-light balance as a part of good painting and calligraphy.\n\nBut I do think that the idea of ’activating the whites’—the phrase of a teacher of Frutiger—does have to do with making the whites more vibrant by exploiting the edge effect. At least that is what I see when I look at Frutiger’s self-named typeface, as I explained above.\n\nIn the Helvetica film Mike Parker glowingly describes the “Swiss” specialty of getting the whites and blacks to “lock together” (if I remember correctly), and how well it is accomplished in Helvetica.\n\n ![](http://web.archive.org/web/20081202203919im_/http:/www.typophile.com/files/Helvetica%20doe_4145.gif)\n\nHere also I think you see the edge effect to ’light up’ the whites, both within and between the letters, in Helvetica bold. In particular, characteristic closed form of the ’e’, with the horizontal terminal, makes the two ’edge effects’ of the terminal and the bar join to light up the gap, making the whole key-shaped counter light up, with the relatively heavy blacks all around. In addition, I think the strictly horizontal-vertical right angle join of the bar and top arch also has some punch.\n\nThe tight spacing with the bold letters also gives the inter-letter spaces more vibrancy. By contrast, Frutiger’s own Univers is less good at lighting up the whites. Here is Universe 65 bold:\n\n ![](http://web.archive.org/web/20081202203919im_/http:/www.typophile.com/files/Univers%20doe%20copy_6214.gif)\n\nNotice how the ’e’ thins at the top and bottom, making eye of the e bigger, and reducing (I think) the edge effect at the top. The overall effect is not to ’light up’ as much both the eye at the top and the key at the bottom. The handling of the counters is also different. Checking on the outlines in FontLab, Helvetica’s top is symmetrical, perhaps adding to the force of it. Univers is actually assymetrical both top and bottom. The shapes are also slightly squarer, and narrower. This enables Univers also to be more widely spaced. Helvetica, as Erik Spiekermann says in the film, is rather “fat in the middle” (Meta is not) and the circular outline calls for tighter spacing. If you space Helvetica more widely I suspect words will start to ’fall apart’.\n\nThese differences again make Univers more suitable for text, but not have quite the punch of Helvetica as a display face. Particularly, the tight spacing of Helvetica makes it work in display, and rotten in text—Paul Rand said it looked like “dog shit” in text.\n\n"
    },
    {
      "time": " 22.Aug.2007 11.33am",
      "content": "Thanks for the reference and link to the Mach bands, Kevin. Peter Enneson had sent to me some illustrations of this by G. Noordzij, but I couldn’t lay my hands on them, and I don’t think Noordzij used the term ’Mach Bands’, so I didn’t know where else to look.\n\nI am guessing that a designer can ’leverage’ the edge effect by 1. heightening it by larger black and smaller white areas, and 2. Having the counters a more simple or eye-catching shape. The idea is that, eg in the counter of the Helvetica ’e’ our visual apparatus puts a brighter white line around the inside of the ’eye’ of the ’e’. And this is bright enough that our eyes also reads it as a shape, a kind of white echo shape of the black. This ’lights up’ the inside.\n\nI think I can see this leveraging of the edge effect, but I may have just gone batty from looking at type all day :)\n\nI will get around to doing an illustration, but I’ve spent too much time today on this already.\n\nHowever, I should say that I don’t think that only the edge effect is involved, in the ’lighting up’ of counters. In this respect, I think Eben is right that more is involved. But I still think that periodicity and even color are different variables from this ’lighting up’ stuff.\n\nHere is another diagram from Noordzij, on the figure-ground effect, which is another thing at work here.\n\n ![](http://web.archive.org/web/20081202203919im_/http:/www.typophile.com/files/NoorddzijIllustration_3753.gif)\n\nI’m not sure if this will work right because the background on Typophile is gray instead of white, but the idea is that this will oscillate as to whether you see white squares on a black backgound, or a black frame window with white background.\n\nThis kind of oscillation is involved I think in the ’picket fence’ effect also, with black and white bands.\n\nIt also seems to be a situation in which the term ’notan’ is often used—where the white becomes foreground.\n\nAt any rate, the bolder horizontals and smaller eye of Helvetica vs Univers may be using this foreground-background illusion to ’active the white’.\n\nIn addition, the Hermann illusion, above, and the versions with wavy lines that defeat it, show that still more effects are at work changing darks and lights in visual processing.\n\n"
    },
    {
      "time": " 22.Aug.2007 12.45pm",
      "content": "Thanks Kevin!\n\n<cite> And this comment is a direct influence of the Chinese and Japanese ideas </cite>  \nWhat (if any) evidence do we have that Frutiger was influenced in this way? If I have forgotten, please remind me.\n\n<cite> —the phrase of a teacher of Frutiger— </cite>  \nI though it was Fruiger’s phrase. Interesting.\n\n<cite> Frutiger’s own Univers is less good at lighting up the whites. </cite>  \nI think that Helvetica sparkles more than Univers - and that Univers’ white & black shapes are more balanced. Your relating this to Display vs Text face use makes me think we basically agree about that.\n\n<cite> It also seems to be a situation in which the term ’notan’ is often used—where the white becomes foreground. </cite>  \nI am not getting you here. Can you explain? My sense of Notan is that foreground & background are not issues in Notan because Notan isn’t about structure/interpretation.\n\nKevin, is there any research that would suggest if the mach effect is stronger Horizontally or Vertically? What about Curves? Is it something that happens mostly with straight lines vs. Curves? What about diagonals?\n\n"
    },
    {
      "time": " 22.Aug.2007 12.49pm",
      "content": "The Swiss notion of “locking up the whites” is a long thought concept from graphic design there. Armin Hoffman, renouned Basle educator and graphic designer (and teacher of my college design professor) stressed “activating the whites” in his work and teaching.\n\nThe thing that helps reduce the effect in Univers is the looser character spacing. The thing that most current type folks rag on Helvetica about is its tight spacing. It increases the bounding effect on the negative space, yes, but clogs at text sizes. Univers works much better in text sizes than Helvetica.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Aug.2007 3.00pm",
      "content": "Yeah, thanks!\n\nBut wait: What is an edge? What is a “difference”? What is a pattern? What is “longer”? and, what about rhythm? In another words, I bet I can make a font with no edges that still works because of something utterly undefined in the world of reading research, not to mention “untapped” by the looks of MS typography. ;)\n\nCheers!\n\n"
    },
    {
      "time": " 22.Aug.2007 4.02pm",
      "content": "<cite>, I bet I can make a font with no edges that still works</cite>  \nThis seems hopelessly vague. Not because the font described has no ’edges’ but rather because I can’t tell what you mean by ’works’.\n\nMoreover while I agree with what I think is your general thrust - that you can make very good type indeed without getting into this kind of theoretical fiddle faddle - I am not yet convinced that awareness of various kinds of optical illusions, Notan, etc can’t be leveraged in the service of type that works better. I suspect that you believe in using illusions too, but not in this perhaps overly-theoretically oriented manner. Is that right?\n\nBut most of all - would you please tell us about what you believe that ’something’ is?\n\n"
    },
    {
      "time": " 22.Aug.2007 4.15pm",
      "content": "Eben, I believe we are more sensitive to horizontal (0 degrees) and vertical (90 degrees) edges than to diagonally oriented edges. I’m not aware of research on curves. There may be research on this topic, but I don’t know this research as well as I would like.\n\nDavid, you don’t know what “edge” or “longer” mean? A single stroke, such as the letter l, has an edge on the left where the color changes from the background color of white to the foreground color of black, and another edge on the right where the color changes from the foreground color of black to the background color of white. I know several spam sites that can help you with “longer”.\n\n"
    },
    {
      "time": " 22.Aug.2007 4.48pm",
      "content": "Eben, [here is the link](http://web.archive.org/web/20081202203919/http:/www.linotype.com/793-12657/black-and-white.html) to the discussion with Frutiger on the Linotype site. He quotes his teacher, it seems, and he also refers to the Taoist yin-yang symbol. Also explicit discussion of ’notan’ was introduced in a book around the end of the 19th century. So it’s pretty clear that this awareness of the influence of white shapes is an influence of East Asian ideas about painting and calligraphy.\n\nAs to the idea of using white as foreground being discussed in connection with ’notan’, if you do a google search on ’notan’ you will find East Asian painting examples like this, where the white—snow on a mountain—becomes part of the foreground. Also when we were discussing notan here on Typophile, Hrant mentioned a typeface that used notan well in his view, and it was a display face that cleverly used white as foreground parts of the letter. The designer came on the thread and discussed it, but I can’t find the thread.\n\n"
    },
    {
      "time": " 22.Aug.2007 5.27pm",
      "content": "<cite> I believe we are more sensitive to horizontal (0 degrees) and vertical (90 degrees) edges than to diagonally oriented edges. </cite>\n\nThanks Kevin! Right. That’s what I thought. And I bet we are more sensitive to horizontals than verticals. Do you know if that is correct?\n\n"
    },
    {
      "time": " 23.Aug.2007 7.41am",
      "content": "Kevin, thanks for the edge. But, what are “black” and “white”? Spam? I remember something about from... 5 or 6 years ago, but that was back in the “renaissance”, “age of reason” users don’t get spam!\n\nIn any case we’re back at what’s what...before “advanced writing” is solved; There, proper “locking up of the whites” can only be accomplished in the majority of people’s reading environments, by first “freeing the blacks”.\n\nWilliam: “Here also I think you see...”  \nWhat I see is a display face and then a text face, both with text spacing, shown at a display size, not to “light up the whites” in either case? I guess another way of putting it is that typography creates type’s 3rd dimension.\n\nEben: “This seems hopelessly vague.”  \nWhat do you mean by “hopelessly”? If it was hopelessly vague it could not be a font.\n\n“And I bet we are more sensitive to horizontals than verticals.”  \nDiagonals, verticals horizontals and curves don’t mean (a gross natural product), unless correctly integrated all the way to typography, do they now? Has that changed of a sudden?\n\nCheers!\n\n"
    },
    {
      "time": " 23.Aug.2007 8.40am",
      "content": "\\>typography creates type’s 3rd dimension\n\nGranted that good typography is essential. But both a good typeface, suited to the usage, and good typography are needed for a great result, no? And surely a good typeface is the sum of its details, such as verticals, proportions, curves, etc.\n\nYou seem to accept that ’locking up of the whites’ is a meaningful term. How would you characterize that, in different terms from the ’lighting up the whites’ that I was struggling to understand above?\n\n\\>What I see is a display face and then a text face, both with text spacing.\n\nI am interested: what features, or combination of features, lead you characterize Univers 65 as a text face, and Helvetica bold as display?\n\n"
    },
    {
      "time": " 23.Aug.2007 12.52pm",
      "content": "<cite> What do you mean by “hopelessly”? If it was hopelessly vague it could not be a font. </cite>\n\nNot the font silly! The vague part was the phrase “I bet I can make a font with no edges that still works because of something utterly undefined in the world of reading research” - So made hopefully more clear: What is the undefined by reading research ’thing’? I am sure the font with ’no edges’ would be able to be read. That much was clear to me already. Thanks!\n\n"
    },
    {
      "time": " 23.Aug.2007 3.12pm",
      "content": "I think the visual concept was described after the fact. Someone (perhaps in Japan) did it then it was talked about and later taught. The theoretical description came much later. I think it is a HUGE jump between physiology of body entwined with perceptual psychology and actually knowing what steps to take to reproduce an effect.\n\nChrisL\n\n"
    },
    {
      "time": " 23.Aug.2007 3.35pm",
      "content": "<cite> I think it is a HUGE jump between physiology of body entwined with perceptual psychology and actually knowing what steps to take to reproduce an effect. </cite>\n\nQuite true!\n\n"
    },
    {
      "time": " 23.Aug.2007 8.23pm",
      "content": "\\>I think the visual concept was described after the fact. Someone (perhaps in Japan) did it then it was talked about and later taught.\n\nThe idea of dark-light balance seems to be very old in China, and I am guessing was imported into Japan along with Chinese characters. China it seems there had an ancient theory, couched in the Taoist terms, of good painting and calligraphy as a balance of opposites, including thick-thin, dark-light, rough-smooth, and so on. They were very literate (poetry went together with painting) and my impression is that they also loved to yak about theory—like some of us here—so there was an interaction between theory and practice.\n\nThe Europeans saw Japanese wood block prints, and then some learned the theory from Japanese and reported it in the West. My guess would be that those later to do type design post WW II picked it up the theory in art schools, and then consciously applied it to type design.\n\n"
    },
    {
      "time": " 23.Aug.2007 8.34pm",
      "content": "You might be right about that, Bill. I think it ether came to or was reinvented in Europe earlier than WWII though.\n\nThere are plenty of stark scandinavian wood cuts that predate that. Some South American Indian culture also did a good job of it.\n\nChrisL\n\n"
    },
    {
      "time": " 23.Aug.2007 9.34pm",
      "content": "The first book in English seems to be by Arthur Wesley Dow, 1899. I don’t know if there was earlier stuff in French or German. I am just guessing that it took until after WWII to get through to type design as a conscious theory, because that’s when you hear of Frutiger talking about it.\n\n"
    },
    {
      "time": " 23.Aug.2007 10.42pm",
      "content": "<cite> You might be right about that, Bill. </cite>\n\nOr maybe not too of course. We can’t know without somebody to connect the dots although it is certainly possible. The thing that strikes me is that without meaning to it’s easy to smudge formerly distinct exotic ideas together. And I think that artists love to do that. That is one reason why the idea that Notan as an intellectual meme made it to 1950s Europe intact seems somewhat far fetched even if some part of it’s echo may have. Moreover, actually applying Notan ( as opposed to using it as an exotic explanation ) would be tough I think. So even though I can’t disprove the idea - and to be honest; don’t want to - I also can’t quite bring myself to buy in yet either. The final reason for my enduring skepticism is that Frutiger’s explanation ( the one that Bill kindly pointed me to ) is that the way of looking says he used was native to his own place of birth through their culture of cutting shapes from black paper. He even goes so far - and I think quite unwisely - to suggest that maybe there is something genetic about it. Boy did I roll my eye then!\n\nBill, what is in the Arthur Wesley Dow book?\n\n"
    },
    {
      "time": " 24.Aug.2007 7.21am",
      "content": "Eben, I haven’t looked at the A.W. Dow book, but just seen references to it. It is still in print over a century later, though, and the blurbs say that it is regarded as a breakthrough book, giving for the first time a comprehensive theory of composition. And it seems that at least in English it introduced ’notan’ to the West as a part of the theory of composition.\n\nThe Chinese yin-yang theory is very vague and elastic—both its strength and weakness. And, as Chris says, a lot of people have discovered the influence of the whites by trial and error anyway, without any theory. That may have included the Bernaise paper cutters that Frutiger is so fond of. But I think important advance is just to direct people: “look at the white shapes, they are crucial even when in background.” Then artists and designers will do something systematically what they might have either not done or done unconsciously or only occasionally. And that idea of attending to the light shapes clearly comes from Chinese and Japanese art and theory.\n\nThe content to the vague idea of dark-light balance is given by the actual examples of Chinese and Japanese art, with their use of dynamic, asymmetric balances, large blank spaces, white sometimes pushed to the foreground, and so on.\n\nThe point of this thread was to try to raise the question of the basis in perception and perception theory for the affects of white shapes—something that G. Noordzij and G. Unger have already worked on, but clearly has a long way to go.\n\n"
    },
    {
      "time": " 24.Aug.2007 9.24am",
      "content": "Thanks for the additional info on the Dow book. Maybe I can get it via Interlibrary loan. Cool!\n\nYou know there was at least one painter who seems to have been thinking in these terms - at least to my eye - before Dow.\n\nVermeer. Take this painting done in 1670.\n\n[http://en.wikipedia.org/wiki/Image:DublinVermeer.jpg](http://web.archive.org/web/20081202203919/http:/en.wikipedia.org/wiki/Image:DublinVermeer.jpg \"http://en.wikipedia.org/wiki/Image:DublinVermeer.jpg\")\n\nThis looks like a sophisticated working of value/brightness without favoring one or the other to me.\n\nActually I am sure there were others before that - I just give Vermeer as an example. And doing something & having a theory about it are different things as well.\n\nI also think Chris’ point about an approach being invented independently in multiple places is certainly good one.\n\nAnd your idea about the possibility of transmission through Dow may be a good one as well. I am not interested in ’downing’ your idea. I just think it needs research/undergirding. That is why the statement that ’attending to the light shapes clearly comes from Chinese and Japanese art and theory’ seems therefore just a bit too strong to me. So I would say ’clearly can be found in’ & ’may have been transmitted’ instead.\n\nIn any event, how it got to us may not be utterly resolved - ever. And if it is, it won’t be by us; unless we become Art historians. That’s something I don’t plan to do. But working on using it better and understanding it better definitely is.\n\n"
    }
  ]
}
