{
  "id": "36305",
  "title": "(x) \"Seriously stylish\" script - Scriptina {Paul H}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I really recoqnize this type but I can’t seem to find it any way in my stuff so if any of you Rain Man like genius’ (genii??? what is the collective term for genius like people, a gaggle of genius, a flock of genius, an Einstein of genius?)... please help me ID this because my sister is driving me mad to get it for her wedding.\n\nRegards,\n\nDean.\n\n ![](http://web.archive.org/web/20071214062035im_/http:/www.typophile.com/files/stylish_6039.gif)\n\n [‹ (x) \"Fast\" eroded font - Amoebia Rain {Angel}](http://web.archive.org/web/20071214062035/http:/www.typophile.com/node/36401 \"Go to previous forum topic\") [(x) Condensed sans, commonly used on T-shirts - Franklin Gothic (customised) {Lari} ›](http://web.archive.org/web/20071214062035/http:/www.typophile.com/node/36398 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071214062035/http://www.typophile.com/user/1805\" title=\"View user profile.\">deano</a>",
  "time": "<br>",
  "uid": "1805",
  "comments": [
    {
      "time": " 20.Aug.2007 1.44pm",
      "content": "ick, it’s scriptina\n\n"
    },
    {
      "time": " 20.Aug.2007 1.51pm",
      "content": "For a wedding? Please tell me you’re joking.\n\nMy suggestion: if you like this style, go with the infinitely more versatile [Ministry Script.](http://web.archive.org/web/20071214062035/http:/www.veer.com/products/typedetail.aspx?image=UMT0000149)\n\n- Lex\n\n"
    },
    {
      "time": " 20.Aug.2007 1.53pm",
      "content": "Ick is not a bad description and even more so when I’m not a huge fan of script type anyway. Anyone suggest a good script option please?\n\nDeano.\n\n"
    },
    {
      "time": " 20.Aug.2007 2.14pm",
      "content": "good alternatives:  \nanything by  \n [Alejandro Paul](http://web.archive.org/web/20071214062035/http:/www.typophile.com/wiki/Alejandro%252BPaul)  \n [Richard Lipton](http://web.archive.org/web/20071214062035/http:/www.typophile.com/wiki/Richard%252BLipton)  \n [Rob Leuschke](http://web.archive.org/web/20071214062035/http:/www.typophile.com/wiki/Rob%252BLeuschke)\n\nokay... maybe not _anything_, but Burgues, Affair, Ministry, Avalon, Sloop, Corinthia, &c. come to mind.\n\ncheck this stuff out:  \n [http://www.myfonts.com/browse/person/leuschke/rob/](http://web.archive.org/web/20071214062035/http:/www.myfonts.com/browse/person/leuschke/rob/ \"http://www.myfonts.com/browse/person/leuschke/rob/\")\n\n"
    },
    {
      "time": " 20.Aug.2007 2.28pm",
      "content": "Bickham Script, perhaps. I don’t consider myself a “professional” at recommending fonts, but I used that font for the company’s (where I work) 50th anniversary holiday party last year. The invite was designed like a wedding invitation — mostly white, a touch of “gold” and black type. It worked really well for that in combo with Copperplate Gothic (33bc, I think it was) that I used for most of the copy “meant to be read.” (It’s not an ambitious combo for fonts — I don’t get much free rein with fonts here.) That font above seems to be a little on the casual and froofy side, for lack of better term. But maybe that’s what she wants. It could work in the right proportions. Good luck.\n\n"
    },
    {
      "time": " 20.Aug.2007 2.45pm",
      "content": "i actually kind of like the idea of scriptina, but the spacing is terrible, the letters are poorly drawn, and i hate the colliding loops in double character such as dd, &c. i think scriptina would be okay with (quite) a bit of attention. Does anyone know where to find more info about scriptina? Who is it designed by? is it really legit? is there a EULA for it anywhere. Dennis, maybe you can help me out?\n\n"
    },
    {
      "time": " 20.Aug.2007 3.10pm",
      "content": "I was just looking at Bickley as an option as I already have it and I agree with PD Hunt about Scriptina but I’ve seen it too many times before like Zapfino and was looking for something that gave me an edge? I’m hoping to use the script oversized as a clear spot varnish on a white card so it’s not to in ya face with a mocca shade type over the top of that?\n\nScripts are soooo difficult to get right in my opinion, with other types you can usually say yep I love it or noooooo that font is making my eyes bleed, but script....???\n\nDeano.\n\n"
    },
    {
      "time": " 20.Aug.2007 3.20pm",
      "content": "Leuschke is a good suggestion for this style, particularly [Ambiance](http://web.archive.org/web/20071214062035/http:/www.fontshop.com/fonts/singles/bitstream/ambiance_regular_ot/?acs=1).\n\n"
    },
    {
      "time": " 20.Aug.2007 3.44pm",
      "content": "Paul, there was a … hmmm discussion … not long ago, … about the origins of Scriptina here in this theatre, but beware, some hard words were used [here](http://web.archive.org/web/20071214062035/http:/www.typophile.com/node/34004) which made me lose the thread. Maybe someone else wants to read it again and tell who’s the founder of Scriptina.\n\n"
    },
    {
      "time": " 20.Aug.2007 4.20pm",
      "content": "<cite>Dennis, maybe you can help me out?</cite>\n\nIn another thread someone offered to fix it up a bit, but didn’t want to do it without the author’s (Apostrophe, A.K.A. Fred Nader) permission. After some digging I found out he is off saving the world in a remote place (without internet), with a big non-profit organization. Conjecture is that he will be in touch maybe in November. I imagine he will give the go-ahead to any improvements.\n\nI will let people know when I hear from him.\n\n"
    },
    {
      "time": " 21.Aug.2007 11.52am",
      "content": "Not sure about Ambiance style but the previous thread regarding Scriptina is very lively, I just hope I haven’t just poked a stick at the hornets nest mentioning it again?\n\nDeano.\n\n"
    },
    {
      "time": " 23.Aug.2007 4.58am",
      "content": "I would go for Zapfino, ’cause it has lots of alternate characters, ligatures etc.\n\ncheers Queneau\n\n"
    }
  ]
}
