{
  "id": "36310",
  "title": "Akzidenz Grotesk",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey guys howzit.\n\nIm just starting a Typography assignment and I will be focusing on Akzidenz Grotesk.\n\nIm having trouble finding background information.\n\nDoes anyone know any interesting story's about the making of this font and/or the type designer?\n\nCheers\n\n",
  "author": "adzz",
  "time": "20 Aug 2007 — 2:51pm",
  "uid": "20920",
  "comments": [
    {
      "time": "20 Aug 2007 — 3:20pm",
      "content": "[http://typophile.com/node/17655?](http://web.archive.org/web/20131018071535/http:/typophile.com/node/17655)\n\n[http://typophile.com/node/16184](http://web.archive.org/web/20131018071535/http:/typophile.com/node/16184)\n\n[http://www.typophile.com/node/9579/61260](http://web.archive.org/web/20131018071535/http:/www.typophile.com/node/9579/61260)\n\n"
    },
    {
      "time": "20 Aug 2007 — 3:26pm",
      "content": "Akzidenz Grotesk originated from the H. Berthold AG type foundry in the late 19th and early 20th century. Newer versions were produced for the phototypesetting industry and the computer age. The new Akzidenz Grotesk version were designed under the direction of Gunther Gerhard Lange. The type face was released in in America under the name of Standard. Mainly the features were copied for the Helvetica halbfett grotesk was pattern after Akzidenz Grotesk.\n\nI was fortunate enough to have worked with the Berthold Fotoype group in Berlin while all this was going on.\n\n"
    },
    {
      "time": "20 Aug 2007 — 3:26pm",
      "content": "Akzidenz Grotesk originated from the H. Berthold AG type foundry in the late 19th and early 20th century. Newer versions were produced for the phototypesetting industry and the computer age. The new Akzidenz Grotesk version were designed under the direction of Gunther Gerhard Lange. The type face was released in in America under the name of Standard. Mainly the features were copied for the Helvetica halbfett grotesk was pattern after Akzidenz Grotesk.\n\nI was fortunate enough to have worked with the Berthold Fotoype group in Berlin while all this was going on.\n\n"
    },
    {
      "time": "20 Aug 2007 — 3:37pm",
      "content": "yo.. x-y thanks for the links. turns out there is quite a bit in this site about this font.\n\nand cheers Robert, that was helpful too. That wuda been interesting working there too yeah?\n\nSo basically this typeface was designed by a group of people who kinda remain anonymous??\n\nThey were all situated at the H. Berthold AG type foundry, but there is no real story behind the actual people tho ay?\n\nI reckon this font is like one of the Gods of Sans Serif's no doubt.\n\n"
    },
    {
      "time": "20 Aug 2007 — 4:03pm",
      "content": "This is probably the best Thread ive read on Akzidenz\n\n[http://typophile.com/node/17643](http://web.archive.org/web/20131018071535/http:/typophile.com/node/17643 \"http://typophile.com/node/17643\")\n\nErik Spiekermann has a lot of knowledge (among the others).\n\n<cite>I reckon this font is like one of the Gods of Sans Serif’s no doubt.</cite>\n\nYeah its ok\n\n"
    },
    {
      "time": "20 Aug 2007 — 4:14pm",
      "content": "yeah reading that now.. its quite good but like \"eriks\" said, i too need to know research the Akzidenz story.\n\neg: like the word \"Grotesque\"? when it was first released people saw it as a grotesque font.. quite ironic dont you think? As it is quite beautiful.\n\n"
    },
    {
      "time": "20 Aug 2007 — 4:24pm",
      "content": "I did a paper on Akzidenz last year and came to the conclusion that unless one knows German, and feels like spending a lot of time in central Europe digging through old books, the Typophile threads on Akzidenz are really the only in-depth examination of the history of the face. Erik Spiekermann confirmed that for me. If you want to look over my paper [email me](mailto:james.puckett@gmail.com).\n\n"
    },
    {
      "time": "20 Aug 2007 — 4:33pm",
      "content": "Interesting\n\nI'll email you now, thanks.\n\n"
    },
    {
      "time": "21 Aug 2007 — 10:47am",
      "content": "[http://www.eyemagazine.com/print/feature.php?id=143&fid=613](http://web.archive.org/web/20131018071535/http:/www.eyemagazine.com/print/feature.php?id=143&fid=613)\n\n"
    },
    {
      "time": "23 Aug 2007 — 12:53pm",
      "content": "Martin Majoor’s article in eye magazine no 63 is undoubtedly fresh and interesting, but it definitely should not be used as the only resource for research. Some of his assumptions are just that – assumptions – and there are some actual flaws in it.\n\nIn this article he writes:  \n\\> As there was no other sans serif design available at that time, any model would have been a serif typeface, but which?  \n(and he is suggesting that Walbaum might have been a major influence on the design on Akzidenz Grotesk by showing the lowercase a of both typefaces in comparison)\n\nFirst:  \nHis assumption that there weren't any other sans serif typefaces around when Royal Grotesque and Breite Grotesk (which later became part and/or predecessors of the Akzidenz Grotesk family) were designed is simply wrong. There were already some other sans serif typefaces available.  \n(And: why should the sans serif have been necessarily modelled after a serif typeface? Reading Nicolette Gray's 'Nineteenth Century Ornamented Types and Title Pages' one could also come to the conclusion that there was some connection between early sans serif typefaces and ornamented 19th century typefaces. I know that for us nowadays this may sound surprising, as we tend to see a sans serif typeface as something without any ornaments, but contemporary reactions to the first sans serif typefaces seem to indicate that people with taste and distinction saw both ornamented typefaces and early sans serif typefaces as something crude and quite uncivilized – and they said so. The connection between moderist thinking and sans serif is a phenomenon of the 20th century, not of the 19th century)\n\nSecondly:  \nThe caption for the illustration of the lowercase a of both typefaces (Walbaum and Akzidenz Grotesk) in comparison says:  \n\\> A comparison between the basic character shapes of Walbaum (1800) and Akzidenz Gotesk (1898)\n\n(Now you would have to pick up eye magazine no 63, p 32, because the online version doesn't show any illustrations)  \nThe shape of the a is indeed quite similar in both typefaces, but the thing is that what we are seeing is not the original 'a' of the metal version of these two typefaces, but the digital versions (which were actually re-creations, done much later). In the design of both these versions, Guenter Gerhard Lange was quite involved (he was artistic director of the type design unit at Berthold at this time). So, what Majoor is actually comparing in this illustration is not (original) Walbaum and (original) Akzidenz Grotesk, but Lange's redesign of Walbaum with Lange's redesign of Akzidenz Grotesk – and suprise, surpise, there are similarities!\n\nThe article in eye continues:  \n\\> If Helvetica was regrettable, then there is a whole range of typefaces that were designed in the 1950s that deserve the same criticism. Again, as in the 1900s, all the type foundries followed one another, afraid as they were of losing market share. The result was a range of neutral typefaces such as Folio, Venus and Mercator\n\nWell, Venus was around about 4 decades earlier. Already the guys at the Bauhaus used it sometimes.\n\nMartin Majoor's article is a fresh polemic against Helvetica, but for serious histoical research you have to find some other resources as well and draw your own conclusions. (If you find anything new, please let us know.)\n\n"
    }
  ]
}
