{
  "id": "36319",
  "title": "What to quote?: exclusive, corporate text family for another overseas client",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I just got an email from someone in Australia requesting a quote for a custom font family in two weights plus italics and \"reasonable\" extended characters. Says \"I have a specific design in mind\". This would be for exclusive corporate use. What is an appropriate range to charge for this sort of project? Since I'm based in the USA, what special considerations might be necessary for dealing with an Australian client?\n\n",
  "author": "cuttlefish",
  "time": "20 Aug 2007 — 11:41pm",
  "uid": "14556",
  "comments": [
    {
      "time": "21 Aug 2007 — 4:46am",
      "content": "well, for one thing, the typeface will need to be able to be read upside-down\n\n"
    },
    {
      "time": "21 Aug 2007 — 5:02am",
      "content": "hyuk hyuk hyuk\n\n"
    },
    {
      "time": "21 Aug 2007 — 5:16am",
      "content": "i actually just did this for someone in california. based on time, id' charge at the very least 15K. the project was about six months of daily back'n'forth on an altered version of an existing typeface. not fun.\n\n"
    },
    {
      "time": "21 Aug 2007 — 8:35am",
      "content": "“I have a specific design in mind”\n\nThat means trouble. Double your hourly rate.\n\n"
    },
    {
      "time": "21 Aug 2007 — 9:27am",
      "content": "I wonder why he's come to you and not say a local Australian type designer? Is he a fan of your work, or maybe he's just spamming a whole bunch of freeware designers that he thinks may work for less money than established vendors who do corporate work. Is the \"specific design\" he has in mind one of yours? If not I assume he's going to want you to do something that's similar to an existing font and indeed that seems like trouble. The way you describe it the whole thing does seem a bit fishy.\n\nAnyway re. pricing treat it like any other work for hire, ie. your hourly rate x expected number of hours plus additional fees / mark-up for changes.\n\nCheers, Si\n\n"
    },
    {
      "time": "21 Aug 2007 — 12:33pm",
      "content": "Si- I suspect that is exactly what is going on. The actual email I got was just as vague as I described, and I have not yet replied. My only released fonts (learning projects made years ago) have been distributed at free font sites like [http://1001fonts.com](http://web.archive.org/web/20131013161951/http:/1001fonts.com/) and [http://dafont.com](http://web.archive.org/web/20131013161951/http:/dafont.com/) so, while he might think my fonts have some merit, it is likely he has contacted other free-fonters out there too.\n\n"
    },
    {
      "time": "21 Aug 2007 — 1:59pm",
      "content": "I suppose going through the exercise of quoting on the job might be worth-while in itself. But I'd tread carefully, do some research on the guy and his firm, ask for references and get some money up-front. ;-)\n\nCheers, Si\n\n"
    },
    {
      "time": "21 Aug 2007 — 5:52pm",
      "content": "I have received the same email...\n\n"
    },
    {
      "time": "21 Aug 2007 — 6:43pm",
      "content": "Me, too.\n\n"
    },
    {
      "time": "22 Aug 2007 — 6:08am",
      "content": "he's clearly shopping on price. this will be a difficult sales cycle at best, and the design process will more than likely not be productive. i would not consider this a serious sales prospect.\n\n"
    },
    {
      "time": "22 Aug 2007 — 9:26am",
      "content": "I got it too. I would rather be dipped in acid than have to do a custom font.  \nJess Latham  \n [www.bvfonts.com](http://web.archive.org/web/20131013161951/http:/www.bvfonts.com/ \"www.bvfonts.com\")\n\n"
    },
    {
      "time": "22 Aug 2007 — 11:36am",
      "content": "\\>I would rather be dipped in acid than have to do a custom font.\n\nThat's why David Berlow drives a 2006 575M Ferrari Maranello, with the license plate CU$TOM, and you drive a... :-)\n\n"
    },
    {
      "time": "22 Aug 2007 — 10:13pm",
      "content": "Oh, SNAP!\n\n"
    },
    {
      "time": "23 Aug 2007 — 1:12am",
      "content": "Simon had a sassy sandwich this morning... hehehehe :-)\n\n"
    },
    {
      "time": "23 Aug 2007 — 8:41am",
      "content": "Hahaha\n\nHigh Fives all around!\n\n"
    },
    {
      "time": "23 Aug 2007 — 9:28am",
      "content": "LOL! Waaaaaa.  \nJess Latham  \n [www.bvfonts.com](http://web.archive.org/web/20131013161951/http:/www.bvfonts.com/ \"www.bvfonts.com\")\n\n"
    },
    {
      "time": "23 Aug 2007 — 11:10am",
      "content": "\\>\\>\\>I would rather be dipped in acid than have to do a custom font.\n\n\\>\\>That’s why David Berlow drives a 2006 575M Ferrari Maranello, with the license plate CU$TOM, and you drive a... :-)\n\n\\>LOL! Waaaaaa.\n\nThe punchline... \"a car that looks like it dipped in acid?\"\n\n;-)\n\n"
    },
    {
      "time": "23 Aug 2007 — 7:21pm",
      "content": "I'd be happy to make a custom font. And not too 'spensive. \"For exclusive corporate use\"? Ooh, now, that's going to cost.\n\n"
    },
    {
      "time": "30 Nov 2007 — 9:07am",
      "content": "I got another message in the email again, requesting a modified version of an existing font he'd seen on dafont.com of my design for exclusive use plus condensed and bold versions, though not specifying which font.\n\nThis guy seems more legit than the last one: has phone numbers and links to a German design studio web site on which his name appears with an email address from the same domain. Still smells a bit fishy, based on the similarity to the last one, but not as much so. What do y'all think about this? Anybody else getting a letter like this lately?\n\n"
    },
    {
      "time": "3 Dec 2007 — 5:32pm",
      "content": "Anyone?\n\nAnyone?\n\n"
    },
    {
      "time": "9 Dec 2007 — 12:50pm",
      "content": "I replied a week ago, but the Germans have yet to get back to me. Oh well...\n\n"
    }
  ]
}
