{
  "id": "36321",
  "title": "Font for legal contract?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am designing a standard legal contract to give to my freelance clients. Should I set the contract in cold, serious font or set all the business documents in the same font for consistency?\n\n",
  "author": "cloud11",
  "time": "21 Aug 2007 — 2:42am",
  "uid": "20934",
  "comments": [
    {
      "time": "21 Aug 2007 — 2:50am",
      "content": "I recommend Comic Sans.\n\n"
    },
    {
      "time": "21 Aug 2007 — 3:31am",
      "content": " ![](http://web.archive.org/web/20150214133913im_/http:/typophile.com/files/Untitled-1_3651.gif)\n\nIs it usual to do all business documents in the same font or to have a friendly tone for marketing letters and more serious tone for things like contracts?\n\nI have got the contract in Charter at the moment, but for a general business font I like Bembo.\n\n"
    },
    {
      "time": "21 Aug 2007 — 3:41am",
      "content": "Sorry for the joke :(\n\nYes, in my experience, companies tend to set all correspondence in the same typeface; there is only one company image. Some companies have also \"correspondence\" cuts of their corporate typefaces, i.e., a version of their typeface that looks more like a typewriter, to make the secretaries feel more comfortable (this is not a joke). At a Berlin Typostammtisch, Ole Schäfer from PrimeType said that they still make these for some of their clients.\n\nI don't see what benefit you'd have from setting some documents in Charter and others in Bembo. Both typefaces are just fine. Depending on what laser printers you use in house, one may look more readable on your company stationary than the other, but that is about it. As far as I am concerned, it would be better to use either one of the faces, and just stick with that. It helps build up brand consistency a little bit.\n\nOn the other hand, what really matters in your contracts is what they say, not in what typeface they are set in. I know that this sounds a little blasthemous, butreally, as long as you are using a nice legible and readable typeface (consitenctly?), the rest really does not matter all that much. Document layout matters a little, too, as do fine typesetting aids, like perhaps small caps, old style figures, ligatures, etc.\n\n"
    },
    {
      "time": "21 Aug 2007 — 5:51am",
      "content": "Thanks. I will go for one font across all the documents. Any suggestions for a refreshing take on body text for business documents? I sort of like\n\nSerifa  \nCandida  \nStone Serif\n\n"
    },
    {
      "time": "21 Aug 2007 — 6:11am",
      "content": "I have through the years put my contracts in ITC Usherwood. Easy to read - and it's not Times Roman...\n\n"
    },
    {
      "time": "21 Aug 2007 — 6:24am",
      "content": "oh dear, sarcasm is sometimes lost on teh interweb\n\nbody text for business documents suggestion = Chapparal Pro\n\n"
    },
    {
      "time": "21 Aug 2007 — 9:35am",
      "content": "Remember that ultimately your contract is for the court. So anything that puts you in a less than serious light with the court will probably be a bad idea.\n\n"
    },
    {
      "time": "22 Aug 2007 — 5:25pm",
      "content": "I use Minion Pro for my own contracts and legal documents. With the right layout and setting it looks darned authoritative---solid and serious with just enough underlying elegance to give it some class. Be sure to use the ligs, small caps and OSFigs too and it'll blow any opposing lawyer right out of the water.\n\n"
    },
    {
      "time": "22 Aug 2007 — 5:49pm",
      "content": "How about the [Printed Word](http://web.archive.org/web/20150214133913/http:/www.letterror.com/foundry/goodies/index.html)? I used the Written Word for a whole lot of Xmas cards one year. Saved me from writing!\n\n"
    }
  ]
}
