{
  "id": "36331",
  "title": "Logo redesign for packaging company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello All,\n\nThis is my first post here. I am redesigning  \na logo for a packaging company. They are married to the panther in the logo and do not want to omit it. I have included the original logo I have to work from and two of my proposed designs.\n\nPlease let me know what you think.\n\nOriginal Logo\n\n ![](http://web.archive.org/web/20081202181700im_/http:/www.typophile.com/files/PkgAll-logo-2-1_6710.gif)\n\nMy designs:\n\n ![](http://web.archive.org/web/20081202181700im_/http:/www.typophile.com/files/PackAll_Amanda1_3599.gif)\n\n ![](http://web.archive.org/web/20081202181700im_/http:/www.typophile.com/files/PackAll_Amanda2_6454.gif)\n\n [‹ short stop](http://web.archive.org/web/20081202181700/http:/www.typophile.com/node/36193 \"Go to previous forum topic\") [Sexy? logo ›](http://web.archive.org/web/20081202181700/http:/www.typophile.com/node/37108 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202181700/http://www.typophile.com/user/20942\" title=\"View user profile.\">kailasmommy</a>",
  "time": "<br>",
  "uid": "20942",
  "comments": [
    {
      "time": " 21.Aug.2007 10.36am",
      "content": "I like the first set of revisions over the second set, even though the tag line seems lonely.\n\nYou’re revision of the panther head is abit Thundercats-esque. Not to mention, unfriendly.  \n[Thundercats Logo: [http://www.stickergirl.com/images/Thundercats.jpg](http://web.archive.org/web/20081202181700/http:/www.stickergirl.com/images/Thundercats.jpg)]\n\nYou might want to consider bringing the entire body back to illustrate the agility of Package All.\n\n"
    },
    {
      "time": " 21.Aug.2007 1.58pm",
      "content": "Explore. Explore. Explore. I can see a several adaptations that would probably work much more effectively. There is a larger question with your ’concepts’. What is the tone of messaging, and how does that influence the style of visuals your using in the design of the mark/logo? The original logo, although lacking, has a softer feel and an approachable sense to it. What you’ve created is bold, harsh, and very masculine. Consider what has been created in the past with this company, and use a more subtle transition.\n\n"
    },
    {
      "time": " 21.Aug.2007 2.22pm",
      "content": "I totally agree that the new panther looks “unfriendly”, and that without the body, it’s lost its dynamic.\n\nI like that you’ve tweak down the size of “P” and “A” in the second group. However, I think you overdid it — the “ll” being taller than the “A” looks rather irritating and makes the whole logo unbalanced.\n\nThe “w” in “we go the distance.” should be capital, otherwise it’s pseudo-modern hip-hop — frivolous and unfit for a business. Alternatively, you could loose the period (“we go the distance”) — not capticalizing the first letter is more excusable if the line isn’t a complete sentence.\n\n"
    },
    {
      "time": " 17.Sep.2007 2.57pm",
      "content": "On a slightly geekier note (and one which may not matter so long after the original posting), the lower panther also strongly reminds me of Voltron... which may not be the vibe they’re looking for ;)\n\n——======\\*======——  \n“If someone’s ’been around the block a few times,’ it might mean he didn’t have the good sense to give up and park in the lot.” ~ Mike Nelson ’Mind Over Matters’\n\n"
    },
    {
      "time": " 21.Sep.2007 9.46am",
      "content": "I like option 2. But the slogan is probably misplaced and too small if the logo is decreased to certain formats. The Serif compliments the icon. Good choice.\n\nDavid Daigle, Canada\n\n"
    },
    {
      "time": " 22.Sep.2007 9.39am",
      "content": "The original one is quite flowing and friendly, where as the new version is very bold and dramatic.\n\n"
    }
  ]
}
