{
  "id": "36340",
  "title": "Commisioning a screen version of a corporate face",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m interested in working with a client to commission a screen version of their corporate face. The current versions aren’t holding up well on devices and on the web.\n\nAnyone have experience with this? Are there any good case studies out there? I’m just really looking for a bit of background—I’ll need to do some convincing in house first before going to a foundry. Thanks!\n\n [‹ Claude Garamond Typography](http://web.archive.org/web/20081202194553/http:/www.typophile.com/node/38739 \"Go to previous forum topic\") [Leopard? ›](http://web.archive.org/web/20081202194553/http:/www.typophile.com/node/38497 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202194553/http://www.typophile.com/user/10846\" title=\"View user profile.\">shl</a>",
  "time": "<br>",
  "uid": "10846",
  "comments": [
    {
      "time": " 21.Aug.2007 1.47pm",
      "content": "Apart from the obvious question, is the corporate font theirs (ie. they own it outright) or is there a font foundry or designer who can claim ownership over it? The first thing to determine is what ’screen’ or ’screens’ they want to target. Windows, Mac OS, Flash etc., as the approach to tuning will vary depending on the output device/s. Next up would be to ask if the screen tuned version needs to be metrically compatible with their existing fonts. It would also be worth analyzing the quality and hinting-suitability of their existing outlines, as clean-up prior to hinting may be needed. With this information you can determine the scope of any re-drawing and hinting.\n\nAs for case studies there have been various workshops and talks at TypeCon and ATypI on this. Might be worth trying to dig up the presentations related to this.\n\n"
    },
    {
      "time": " 22.Aug.2007 11.43am",
      "content": "They do own it outright, but I imagine we would go back to the designer and the foundry that developed it. I didn’t think about having to target a specific application/OS—good to know. I will look into digging up those presentations. Thanks for the help.\n\nSean\n\n"
    },
    {
      "time": " 22.Aug.2007 1.48pm",
      "content": "I would be inclined to do some independent research on the original vendor - do they have a track record of producing screen-hinted designs? If not they’ll likely sub-contract out to someone (individual or company) that does hinting, so you might be better to go direct and cut out the middle-man - not for purely financial reasons, but also to have direct contact with the people doing the work.\n\n"
    },
    {
      "time": " 2.Nov.2007 9.14am",
      "content": "Sean\n\n"
    },
    {
      "time": " 2.Nov.2007 9.51am",
      "content": "\\>Sean\n\nConnery, I presume?\n\n"
    }
  ]
}
