{
  "id": "36352",
  "title": "What ONE typeface would you have rather not exist?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I asked this question to [James Grieshaber](http://web.archive.org/web/20080705154015/http:/www.typophile.com/wiki/James%252BGrieshaber), [Kent Lew](http://web.archive.org/web/20080705154015/http:/www.typophile.com/wiki/Kent%252BLew), and [Stephen Coles](http://web.archive.org/web/20080705154015/http:/www.typophile.com/wiki/Stephen%252BColes) with various results, but if there were ONE typeface on the face of the earth that you’d rather never see again, what would it be, and why?\n\n(If you list P\\*pyr\\*s, C\\*mic S\\*ns, or any other typeface that could be found on 2002 Free Fonts, you’re not trying hard enough.)\n\nSo here’s mine:\n\n**ITC [Souvenir](http://web.archive.org/web/20080705154015/http:/www.typophile.com/wiki/Souvenir)** (Particularly the bastard mono.)\n\nThis typeface is so ugly, yet it’s everywhere. The roundness doesn’t come across as round, it comes across as soft. And in that not-good soft way. Although designed by Morris Fuller Benton in the 10s, it’s too 70s, in the bad feathered hair and brown tinted eyeglasses way. I would rather live in a world where Souvenir does not exist.\n\nYour turn.\n\n [‹ Blanka & Candy, in association with Veer, present '50' in NYC.](http://web.archive.org/web/20080705154015/http:/www.typophile.com/node/36904 \"Go to previous forum topic\") [Puchasing old Corel Draw to get the fonts. ›](http://web.archive.org/web/20080705154015/http:/www.typophile.com/node/36922 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080705154015/http://www.typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": " 21.Aug.2007 7.00pm",
      "content": "Oh stop it. This is the biggest waste of band width in the world.\n\nGet over it.\n\n"
    },
    {
      "time": " 21.Aug.2007 7.04pm",
      "content": "Hey, I’m at work and I am bored. So talk to someone who cares.\n\n"
    },
    {
      "time": " 21.Aug.2007 7.15pm",
      "content": "Because it was abused so much in my workplace, I have to go with Algerian. It was bad enough seeing the all caps font used in all the signs around the building, like: YOUR MOTHER DOESN’T WORK HERE, SO CLEAN UP AFTER YOURSELF.”\n\nBut then I had to sit through an hour-long technical presentation, with all the titles set in Algerian. And the worst part was they has set the tracking so that all the letters overlapped, and were on the verge of unintelligibility. AAARRGGH! (the horror!)\n\n"
    },
    {
      "time": " 21.Aug.2007 7.40pm",
      "content": "Benguiat, with Algerian a very close second. Here, they suffer from as much inappropriate use as Comic Sans and Papyrus.\n\nBlech.\n\n"
    },
    {
      "time": " 21.Aug.2007 7.42pm",
      "content": "I would tend to agree with James about this topic, and I have a soft spot for “bad” typefaces like Souvenir, but there is one popular free font that never fails to make me a bit nauseous when I see it: [Black Chancery](http://web.archive.org/web/20080705154015/http:/www.dafont.com/black-chancery.font).\n\n"
    },
    {
      "time": " 21.Aug.2007 7.45pm",
      "content": "Avenir (long story)\n\n"
    },
    {
      "time": " 21.Aug.2007 9.01pm",
      "content": "Arial. Not because I dislike it, but because I’m sick of hearing type nerds complain about it. It’s been sucking for twenty-five years folks, get over it!\n\n"
    },
    {
      "time": " 21.Aug.2007 9.10pm",
      "content": "Superultra, that’s not Souvenir, but some bizzare thing called ’Souvenir Mono.’ Souvenir is well drawn, and that’s not.\n\n"
    },
    {
      "time": " 21.Aug.2007 9.19pm",
      "content": "Hi William... You are right. Dan hates the mono version of the typeface. I posted it just for him loathe.\n\n"
    },
    {
      "time": " 21.Aug.2007 9.21pm",
      "content": "Dan, Just One???\n\nSorry, I’m filled with too much hate to be limited by just one. Here’s to streetwalkers and health code violations:\n\nCulrz- This preferred choice of the American dingbat pre-adolescent peroxide blonde gloss junkie is imprinted all over pink homework folders and sparkly snug-fitting phase tees- “I’m in love with what’s his face”.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Picture1_6430.png)\n\nHorriable Harrington- this barber will cut your hair for $5.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Picture3_3524.png)\n\nRunning that late night pizza joint with floors stickier than a booger in a jar of honey?- This ones for you.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Picture4_5975.png)\n\nMistral- The ’fluid’ script gracing the worlds adult entertainment products.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Picture5_3744.png)\n\nDan’s favorite beeocth\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Picture6_5716.png)\n\nNasty Nasty Abadai- ugly on all counts!!!\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Picture7_6418.png)\n\n"
    },
    {
      "time": " 21.Aug.2007 9.30pm",
      "content": "Hi there:\n\nThank for giving me the correct spelling. The edit changed the order of the my post- weird. Mr. Crossgrove is not my dear friend but I’m sure he’s a fabulous loving man and should be beatified on the double but Culrz = Hulrz.\n\nMikey :o)\n\n"
    },
    {
      "time": " 21.Aug.2007 9.50pm",
      "content": "Ravie\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/sonotravie_4435.jpg)\n\n"
    },
    {
      "time": " 21.Aug.2007 9.55pm",
      "content": "[www.dafont.com](http://web.archive.org/web/20080705154015/http:/www.dafont.com/ \"www.dafont.com\")\n\n"
    },
    {
      "time": " 21.Aug.2007 10.08pm",
      "content": "Ravie... but its so cute... :-(\n\nSince I’m so equal opportunity:  \n [http://www.fountain.nu/catalogue/pizzicato.asp](http://web.archive.org/web/20080705154015/http:/www.fountain.nu/catalogue/pizzicato.asp \"http://www.fountain.nu/catalogue/pizzicato.asp\")\n\nMikey :-)\n\n"
    },
    {
      "time": " 21.Aug.2007 10.13pm",
      "content": "Yeah, the Mono Souvenir-like _thing_ is horrendously bad, but I hate even the regular face. It’s just so weak and flaccid.\n\n"
    },
    {
      "time": " 22.Aug.2007 12.44am",
      "content": "Comic sans and Brush Script is too obvious to hate on… can’t stand Mistral.\n\nI’ve been very guilty of using Benguiat and Curlz in a professional application. Although I can say I wanted to use Benguiat for an Art Nouveau poster so it was sort of the correct application, I guess the same can be said about Harrington. There was no excuse for using Curlz though.\n\n"
    },
    {
      "time": " 22.Aug.2007 6.55am",
      "content": "Futura\n\nMainly because it’d force me to at least TRY and use a different typeface once in a while (Damn you handy Futura!)\n\n"
    },
    {
      "time": " 22.Aug.2007 7.01am",
      "content": "<cite>Comic sans and Brush Script is too obvious to hate on… can’t stand Mistral.</cite>\n\nI second that. Times New Roman is a font that bugs me quite a bit. I think it’s because of how often it is the default. I guess it’s just played out.  \n—  \nFocus beyond the dot of the i.\n\n"
    },
    {
      "time": " 22.Aug.2007 7.21am",
      "content": "<cite>www.dafont.com</cite>\n\nI guess you are saying you’d like to ban all poorly made fonts with this odd blanket statement? Or is it the free part that bothers you?\n\nThey are certainly better than many of the alternatives. That they are often recommended here says a lot. Some freeware sites are often understandably deleted by the moderators because they have commercial fonts.\n\nIf you look, you can also find some fun nuggets there.\n\n"
    },
    {
      "time": " 22.Aug.2007 7.33am",
      "content": "_”...if there were ONE typeface on the face of the earth that you’d rather never see again...”_  \nThat would have to be the ONE I’m finishing up, at any given moment. ;-)\n\n"
    },
    {
      "time": " 22.Aug.2007 7.45am",
      "content": "fontplayer, re. dafont.com, that was a ??bad?? joke, but frankly I think 99.9% of fonts on the site are either poorly executed or knock offs. I am all for <cite>quality</cite> free fonts but I barely use them at all. 99.9% of the typefaces I use for work are licenced fonts.\n\nMy <cite>real</cite> response to the question asked in this thread is akin to James’ and Mark’s.\n\n"
    },
    {
      "time": " 22.Aug.2007 7.55am",
      "content": "<cite>I am all for quality free fonts but I barely use them at all. 99.9% of the typefaces I use for work are licenced fonts.</cite>\n\nThat is understandable if you are “in the biz”. For those of us not charging their purchases off to a customer, Dafont kinda rocks.\n\nAnd they are pretty good about protecting you guys.\n\nAs an aside, the whole knock-off argument seems pretty well shot down by companies like Adobe and Microsoft, I am am following the common reasoning in another thread (something about “Bloody rip-offs”)\n\n"
    },
    {
      "time": " 22.Aug.2007 8.15am",
      "content": "Now, now boys. Focus! I’m talking real commercial fonts that some foundry like ITC has the gall to spread around the world like a plague.\n\nIf you ignore the free junk and anything bundled with an OS, what are you left with?\n\n"
    },
    {
      "time": " 22.Aug.2007 8.26am",
      "content": "<cite>http://www.fountain.nu/catalogue/pizzicato.asp</cite>\n\nI guess I should be embarrassed to say that when I saw that for the first time, I thought it was the coolest font ever.  \n; )\n\nAnother nominee might be Hobo.\n\n"
    },
    {
      "time": " 22.Aug.2007 8.27am",
      "content": "Bad type ain’t the problem. People who use type badly is the problem.\n\nIt’s like fashion. I don’t blame bell bottoms for the sixties. And I don’t blame Souvenir for the seventies. But somebody wearing bell bottoms in 2007, or using Souvenir in 2007, had better be going to a retro party!\n\nAdmittedly some fonts have a quality that makes them appropriate over a large spectrum of projects. And some fonts are so well crafted that a person has got to be inept to set them badly. But most fonts suffer because of lazy or indifferent type specification.\n\n"
    },
    {
      "time": " 22.Aug.2007 8.33am",
      "content": "Once upon a time, about 8 years ago I had the pleasure of hearing a lecture given by Gerard Unger on the mid-century (last) typefaces from France. Before this lecture I hated Mistral (and many fonts from the late, great Excoffon). This hate was tied to a having to do DTP (as it was then called) with so few fonts available to me in the late 80s and early 90s. Silly and childish. Gerard’s rich and detailed stories of driving through the French country side and visiting towns with traces of the old signage and even stories from his own youth mesmerized me.\n\nAs it happened I was going to France for the first time only a short while later. I never thought I’d visit France, Paris seemed but a dream. I was in a frenzy of anticipation. He had opened my eyes to why the designs were originally created and I wanted to see them for myself.\n\nNow one of my favorite time periods in the history of the poster is Mid-century France. (Well, in fact, I have a huge bias now toward anything French.)\n\nThe lesson to be learned: Before you go hating a typeface learn the history and the context.\n\nThere are no bad typefaces, only poorly used typefaces.\n\n"
    },
    {
      "time": " 22.Aug.2007 8.33am",
      "content": "Well, I just think this question is absurd if you’re taking it seriously. If you’re just asking it for a bit of fun, fair enough.\n\nLike all design, typefaces is a creative byproduct of <cite>time</cite>, coming into fashion and out into oblivion and, often, return with a vengeance. Helvetica was all the rage, so was Avant Garde and it’s over abused alternates, guilty here, Souvenir not quite but who knows in 2030. <cite>Exist</cite> is a strong word to use (taken seriously), you might have asked which typeface one wished weren’t so ubiquitous <cite>today</cite>? Oops, guess we all know that one, Helvetica, oops maybe Arial.\n\nCheers!\n\n"
    },
    {
      "time": " 22.Aug.2007 8.36am",
      "content": "Oh, beaten! Tiffany communicates across the point I was trying to make far more eloquently. :^)\n\n"
    },
    {
      "time": " 22.Aug.2007 8.36am",
      "content": "But there are some fonts for which there is simply no excuse. Even tho I agree that threads like this are a waste of time, I’ve obviously read this one.\n\nA restaurant in my neighborhood is using Mistral (which I hate) letterspaced to within an inch of its life. I have to shield my eyes every time I pass the sign.\n\nI’m gonna make you all suffer with me... here’s my recreation of the sign (couldn’t fit in the ’t’). I think the actual sign is even more tracked out than my sample. Looks like little poops all spread out in a row.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/malaysian_4913.jpg)\n\n"
    },
    {
      "time": " 22.Aug.2007 8.40am",
      "content": "I just took a look at Souvenir, and have to say I’d take it (especially the light & light italic versions) over Hobo, Mistral, Algerian, & Ravie any day.\n\n[http://www.myfonts.com/fonts/linotype/itc-souvenir/light-italic/](http://web.archive.org/web/20080705154015/http:/www.myfonts.com/fonts/linotype/itc-souvenir/light-italic/ \"http://www.myfonts.com/fonts/linotype/itc-souvenir/light-italic/\")\n\n"
    },
    {
      "time": " 22.Aug.2007 8.50am",
      "content": "Patty, you can’t blame Mistral for that. You gotta blame the goofball that decided to use Mistral for the restaurant and then tracked it out to incomprehension. Don’t blame the typeface for bad design.\n\n"
    },
    {
      "time": " 22.Aug.2007 8.53am",
      "content": "I should edit my post but don’t want the entry time to change:\n\nI meant to add something about history of French graphic design and not only the poster, but it just so happens that I particularly love signage and poster art from France from the time period.\n\n"
    },
    {
      "time": " 22.Aug.2007 8.54am",
      "content": "Agreed, Ken. But I’ve never liked Mistral even when used properly.\n\nIt doesn’t help that - as pointed out above - it’s been co-opted by the “gentleman’s” club industry.\n\n"
    },
    {
      "time": " 22.Aug.2007 8.59am",
      "content": "Nobody’s mentioned University Roman? Used for supposedly ’classy’ jobs.\n\nNick Cooke\n\n"
    },
    {
      "time": " 22.Aug.2007 9.06am",
      "content": "In general I can ignore - or even laugh at - a poorly-designed ugly weirdo font that you only encounter occasionally.\n\nI’d rather never see Dax again but then my UPS packages wouldn’t get to me.\n\nAnd Nick - YES, I thought of University Roman too! Meant to mention it, actually, but got side-tracked.\n\nIn the 90s I’d have liked to have done away with Matrix but it seems to have crawled back under its rock.\n\n"
    },
    {
      "time": " 22.Aug.2007 9.38am",
      "content": "Urgh... University Roman. The funny thing is, I’ve been seeing this everywhere recently, and thinking how horrible it is, but I didn’t know what it was called until I was prompted by this thread to take a look at it.\n\n"
    },
    {
      "time": " 22.Aug.2007 9.55am",
      "content": "I think Bank Gothic is one that I could do without. Its one of those fonts that is pretty neat by itself, but looks really silly in almost any application.\n\n"
    },
    {
      "time": " 22.Aug.2007 10.00am",
      "content": "Name a bad knock-off of Helvetica - Sorry, Akzidenz Grotesk and let that be it.\n\noh yeah... And Tiresias. (combined they’d just barely count as one, right?)  \n \\>;¬)\n\n"
    },
    {
      "time": " 22.Aug.2007 10.04am",
      "content": "Yeah University Roman is so horrible.\n\nAnd (even though it’s a well designed font) I think the world could do without Mason, the official font of teenage goth myspace users.\n\n"
    },
    {
      "time": " 22.Aug.2007 10.06am",
      "content": "Ah, University Roman! Didn’t actually identify it when taking this photo. The reason for taking the photo was the strange mixture of the type of business (grills and such out of wire) and font.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/bethel2_6396.jpg)\n\n"
    },
    {
      "time": " 22.Aug.2007 10.16am",
      "content": "<cite>I think the world could do without Mason, the official font of teenage goth myspace users.</cite>\n\n: )  \nAt least that is easily avoided.\n\n"
    },
    {
      "time": " 22.Aug.2007 10.39am",
      "content": "I agree with Tiffany comments, context redeems what may seem ugly to the uneducated eye. That is not to say one has to like a particular font or that it is even appropriate to use today.\n\n“There are no bad typefaces, only poorly used typefaces.”\n\nAgreed, for the most part... but there is still Black Chancery, which I thought was horrible when I first saw it as a student in the late ’80s.\n\nAre you happy now, Dan? You made me say it... my vote is for Black Chancery.\n\n"
    },
    {
      "time": " 22.Aug.2007 11.39am",
      "content": "I did a little digging... Black Chancery was based on an older bitmap font and was digitized in 1991 by none other than Earl Allen, one of the programmers responsible for Fontographer. Now that I think of it, I believe it may have been one of the sample fonts included with Fontographer.\n\n"
    },
    {
      "time": " 22.Aug.2007 11.45am",
      "content": "I’d have to say Rotis. Wouldn’t miss it one bit...\n\n"
    },
    {
      "time": " 22.Aug.2007 12.06pm",
      "content": "I’m with ya there, not a fan of Rotis. The Met is using it for their adverts for a show on Egyptian art. Go figure.\n\n"
    },
    {
      "time": " 22.Aug.2007 12.06pm",
      "content": "I ignored this thread because I wasn’t bored enough. If I had to reply, my answer would be the same as Mark Simonsons! That “font” is so execrable It makes me angry. It’s obviously free; who would buy such a thing?\n\nRecently I saw a headline in Souvenir caps and had to remark sadly that it was well-drawn. Compared to a lot of the homemade stuff on myfonts, etc. now, Souvenir is actually well-crafted. Isn’t that sad?\n\nJLT: Thanks so much, PAL, for harping on my marginal involvement with Curlz. Let’s get the record straight: When I was still working in print production, just out of school, Steve Matteson would give me small custom type jobs for Monotype. One of them was finishing the character set of Curlz. I probably actually drew 11 of the alphabetic characters and filled out the punctuation. In other words, Steve Matteson is the designer of Curlz. I was a production monkey who finished it, much like my role with Woodtype 3. Not the originator, the slavey.\n\nOne way for type designers to get experience is to finish the work others start. Matching someone else’s style is good exercise. In fact, that’s how new designs come about like Leslie Cabarga’s new Casey, and Mark’s new Kinescope. They start with example art and fill out the missing pieces. Great skill to have. In the case of Curlz, I never thought it would haunt me all my damn days. What did I do, God? Why am I being punished?...\n\nI’ll get you Josh, when you least expect it. \\>:(\n\n"
    },
    {
      "time": " 22.Aug.2007 12.07pm",
      "content": "Mikey,\n\nYou appear to have found a unique sample of Souvenir Monospaced. Weird! It does look worse than the original.\n\n"
    },
    {
      "time": " 22.Aug.2007 12.12pm",
      "content": "there’s nothing wrong with da-font, it’s a good place to start and for random inspiration it has sorted me out in the past nicely, just to take this in a different direction: i’d love to see a world without helvetica... now that would be interesting...\n\n(it’s nice enough but a bit... meh!)\n\n"
    },
    {
      "time": " 22.Aug.2007 12.51pm",
      "content": "<cite>Oh stop it. This is the biggest waste of band width in the world. Get over it. </cite>\n\nThough I agree this topic isn’t as exhilarating as other threads, it is exactly this kind of remark that scares people away from participating in potentially interesting conversations. Obviously, plenty of people are partaking and enjoying themselves.\n\nPlease be nice.\n\n"
    },
    {
      "time": " 22.Aug.2007 1.01pm",
      "content": "\\> I guess I should be embarrassed to say that when I saw that for the first time ...\n\nHey, I liked Souvenir when it came out in the 70s. It dated kind of quickly, though.\n\n"
    },
    {
      "time": " 22.Aug.2007 1.49pm",
      "content": "\\>Avenir (long story)\n\n???  \nThe story must have little to do with the typeface.\n\nMaybe an obvious pick, maybe not, but I would love to see Serpentine erased from existence.\n\n"
    },
    {
      "time": " 22.Aug.2007 4.30pm",
      "content": "Although spotting Papyrus has become a family joke when we are out and about, I also can’t stand Matisse. No, in fact, I hate it - especially when I see it used in signage.\n\nGregory Gray, if you read this thread, please don’t take it personally. I am sure you are a fine person.\n\n;)\n\n—  \nMike\n\n"
    },
    {
      "time": " 22.Aug.2007 4.54pm",
      "content": "Even badly designed or terribly overused typefaces have their place. For instance, if I had to typeset something that needed to mimic office correspondence produced in MS Word, what would I do without Times NR, Arial, and Comic Sans (a municipality my wife worked for one time used Comic Sans as the text face in official correspondence—-which actually was appropriate in a way, as the town was a bit of a joke).\n\nI know of a small magazine that uses Souvenir as its text face, and a bad knock-off of Univers as the sans for titles. Bizzarely, it kinda works. It’s a folksy-country magazine.\n\n"
    },
    {
      "time": " 22.Aug.2007 5.45pm",
      "content": "Already mentioned, but I could do without Bank Gothic. It’s not ugly, actually pretty nice looking. But somehow when it’s used, 9 out of 10 times it just looks wrong.\n\n"
    },
    {
      "time": " 22.Aug.2007 6.00pm",
      "content": " ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Rem_4133.gif)\n\n"
    },
    {
      "time": " 22.Aug.2007 6.13pm",
      "content": "In seeing it plastered around a new mall today, it occurred to me I wouldn’t miss ITC Anna if I never saw it again.\n\n"
    },
    {
      "time": " 22.Aug.2007 6.26pm",
      "content": "My vote is for Century Gothic.\n\nIt’s used in the logo where I work, and grow to hate it more each and every day.\n\n"
    },
    {
      "time": " 22.Aug.2007 7.11pm",
      "content": "I was just flipping through a local photo school course catalog, and encountered a featured class called Creative Encounters. The titles were set in Hobo. The irony was breath-taking.\n\n"
    },
    {
      "time": " 22.Aug.2007 8.21pm",
      "content": "_I wouldn’t miss ITC Anna if I never saw it again._  \nTHAT’s the spirit that I’m trying to convey. It’s not that certain typefaces are poorly designed, or whatever, it’ personal preference.\n\n"
    },
    {
      "time": " 22.Aug.2007 8.42pm",
      "content": "@ garyw\n\nHmmm. That and Jokerman\n\n[http://www.myfonts.com/fonts/linotype/jokerman/jokerman/](http://web.archive.org/web/20080705154015/http:/www.myfonts.com/fonts/linotype/jokerman/jokerman/ \"http://www.myfonts.com/fonts/linotype/jokerman/jokerman/\")\n\n"
    },
    {
      "time": " 22.Aug.2007 11.01pm",
      "content": "Curlz and Papyrus.\n\nPapyrus is something I hate with a passion. Mostly because of its all too frequent misuse.\n\n"
    },
    {
      "time": " 22.Aug.2007 11.25pm",
      "content": "\\>\\>Papyrus is something I hate with a passion. Mostly because of its all too frequent misuse.\n\nThat is actually something another designer and I have been talking about for a while. Is there _ever_ an appropriate use for Papyrus? Especially now, since it has been used and overused and misused and used some more? I honestly cannot think of any situation where I would feel comfortable (and sane) using that typeface.\n\n"
    },
    {
      "time": " 23.Aug.2007 6.04am",
      "content": "worth checking out\n\nTypes Best Remembered/Types Best Forgotten: A Collection of Observations on Types Best Remembered/Forgotten (Paperback)  \nby Robert Norton (Editor)\n\n"
    },
    {
      "time": " 23.Aug.2007 6.16am",
      "content": "<cite>Is there ever an appropriate use for Papyrus?</cite>\n\nIn 2050, when you’re art directing a movie set in 2007 and you need to design the logo for a spa. You’ll get a lot of aging typophiles in the audience slapping their heads and going “Omigod, Papyrus. Haven’t seen that font in decades. Brilliant.”\n\n"
    },
    {
      "time": " 23.Aug.2007 6.41am",
      "content": "For me, it would be a weight of a font, not the font itself, but Gill Sans bold/extra bold has always bugged me.\n\nPixelfonts also, from around 2000-2001 when everyone was using them. Are you really THAT short of space that you have to rely on typefaces that are barely legible?\n\n"
    },
    {
      "time": " 23.Aug.2007 7.29am",
      "content": "ARGH! Leave Papyrus alone. You don’t have enough imagination if you can’t find something more worthy of loathing. That’s like picking on your younger cousin with Downs syndrome.\n\nAs I recall, most of the original questionees had a major dislike for Rotis, which to the unaided eye should be just a normal typeface.\n\nBut the Devil is in the details...\n\n"
    },
    {
      "time": " 23.Aug.2007 7.29am",
      "content": "Mine would be VAG Rounded, an agency I used to work for used it for its housestyle, and would never use it again unless being forced to... I’ve seen enough of it for the rest of my lifetime!\n\ncheers Queneau\n\n"
    },
    {
      "time": " 23.Aug.2007 7.43am",
      "content": "I’m intensely relieved to see Mark and others cite Black Chancery. More than once, I’ve had to explain through clenched teeth why it bothers me so much, and been met with uncomprehending shrugs.\n\nI don’t recall specifics right now — but aren’t the horizontal/vertical stroke widths all wrong? To make a pen achieve those letterforms, the nib would have to be pivoting and expanding and contracting capriciously all the time. The type seems to have been designed by someone who wanted to make something look calligraphic, without even the faint grasp of calligraphic mechanics that I’ve attained (and believe me, that’s faint). Likewise, people use it instead of a better-designed script. Ugh.\n\nNo fondness for Rotis, tired of Times Roman and the faces proscribed at the outset, but Black Chancery actually makes me feel queasy to look at it.\n\nAs an aside, one of my least favorite faces in general is Antique Olive — which a publisher chose to set the titling for a recent book of mine. That would just be bad kluck, but one of the points of the book involves the relevance of page design to communication and meaning. . . .\n\n"
    },
    {
      "time": " 23.Aug.2007 9.14am",
      "content": "I’ll stay away from the obvious choices (Papyrus, Comic Sans MS, Mistral, Black Chancery, et al.), and I’ll go with Times in all its forms.\n\nFor doing its part to get rid of Times New Roman (and Arial), I’d like to give a sincere thank-you to Microsoft Office 2007.\n\n(I just hope that I won’t someday be saying the same thing about Calibri!)\n\n"
    },
    {
      "time": " 23.Aug.2007 10.19am",
      "content": "@JLT - How about just writing a new post? ;)\n\n"
    },
    {
      "time": " 23.Aug.2007 10.37am",
      "content": "Duckworth, I have to agree with Gill Sans Bold and Extra Bold. I would add the condensed weights as well. I can’t hate on anything done by FastSigns, but I see pro designers using these weights of Gill Sans all the time, trying to make it look all serious when these weights seem really cartoony to me.\n\nTypefaces like Mistral, Hobo, and University Roman have a different context for me, since I’m too young to remember the overuse in their prime. I assume my equivalent would be Bank Gothic, RotisSans, and Matrix, which the condo industry still seems to think works for identities.\n\nMyriad is a face which I think is great in and of itself, but due to the unfortunate fact that it’s the default in Illustrator, I’ve begun to associate it with really cheap and shoddy work.\n\n"
    },
    {
      "time": " 23.Aug.2007 10.55am",
      "content": "On the topic of Rotis, Matthew Carter made a funny comment during the Helvetica Q&A in Seattle. He was asked, “Which typeface would you take with you to a deserted island?” He said something along the lines of, “It would have to be Rotis, so that I could take it apart and use it to build a raft to get off the island.”\n\n:)\n\n"
    },
    {
      "time": " 23.Aug.2007 11.20am",
      "content": "@Zara  \nI thought he said that his desert island font was Rotis because if it were his only typeface he wouldn’t be able to stand it so he would be FORCED to build a boat to get off the island.\n\nI think this is someday gonna be like Gaudy’s sheep stealing quote...\n\n"
    },
    {
      "time": " 23.Aug.2007 11.20am",
      "content": "David, if you are bored, then don’t read this thread. And please leave your spam elsewhere, thanks.\n\n"
    },
    {
      "time": " 23.Aug.2007 11.21am",
      "content": "@Dan: Sorry I could not remember it word for word, thanks for the correction.\n\n"
    },
    {
      "time": " 23.Aug.2007 11.31am",
      "content": ".\n\n"
    },
    {
      "time": " 23.Aug.2007 11.40am",
      "content": "@David: Without context, how am I to know what you are referring to?\n\nAnyway, my response is the same.\n\n"
    },
    {
      "time": " 23.Aug.2007 11.43am",
      "content": ".\n\n"
    },
    {
      "time": " 23.Aug.2007 4.26pm",
      "content": "On the subject of University Roman. About 40 years ago I took an alphabet fom a Speedball lettering book and made a photolettering font and called it Celtic. About 10 years later the Celtic poppped up as University Roman in the Linotype collection.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/CELTIC041_4482.jpg)\n\n"
    },
    {
      "time": " 23.Aug.2007 6.50pm",
      "content": "So! It’s all your fault! ;-)\n\nIt’s interesting to see the differences between Celtic and University Roman. Celtic is much closer in flavor to the Speedball style (“Stunt Roman”). I remember seeing it years ago in the Formatt (cut-out lettering) catalog. I figured it to be a copy of University Roman, until I noticed the differences. I like the “upside-down” S in the original, but nobody ever seems to include it in any font based on it.\n\n"
    },
    {
      "time": " 23.Aug.2007 7.25pm",
      "content": "Celtic: A (little bit) better scan.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/celtic_6502.jpg)\n\n"
    },
    {
      "time": " 23.Aug.2007 7.38pm",
      "content": "I can picture Bruno shaking with rage...\n\n"
    },
    {
      "time": " 23.Aug.2007 7.38pm",
      "content": "One more vote for University New Roman\n\n"
    },
    {
      "time": " 23.Aug.2007 8.06pm",
      "content": "That example of Celtic from David almost makes it look kind of nice.\n\nI gotta add: Kino MT. Has anyone seen this font used appropriately?\n\n"
    },
    {
      "time": " 23.Aug.2007 10.49pm",
      "content": "SuperUltraFabulous, that’s not “Cultz,” but rather Curlz, by our dear friend Carl Crossgrove.\n\nedited 08.23.07: I see you’ve altered the spelling of the type in order to correct it, but it’s still not right. It’s not “Culrz,” but “Curlz.”\n\nRelatedly - a “feature” of the current Typophile that I HATEHATEHATE:\n\nOriginally, SUF’s post preceded mine, and ostensibly mine was a response to his. But because he later edited his post, it was pushed down below mine. This kind of thing really screws up the chronology of a discussion. I can see adding an “edited xx.xx.xx xx:xx” notation, but changing the original date and time of the post when edits are often very small? That’s not helpful.\n\n—later—\n\nZara: good idea - I’ll start after this one.\n\nCarl: I’m sorry. I’ll buy you a drink. But you’ve done such a good job that it more than makes up for Curlz - whether you built 11 glyphs or the whole thing.\n\n—-\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20080705154015/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\")\n\n"
    },
    {
      "time": " 24.Aug.2007 8.43am",
      "content": "As a web designer. . . .\n\ndefo comic sans. . . nuff said.\n\n"
    },
    {
      "time": " 25.Aug.2007 5.26am",
      "content": "_Linda Cunningham: Benguiat_\n\nDanGayle: Yeah, the Mono Souvenir-like thing is horrendously bad, but I hate even the regular face. It’s just so weak and flaccid.\n\nDon McCahill: Hey, I liked Souvenir when it came out in the 70s. It dated kind of quickly, though.\n\nOkay, let’s really bash Souvenir. First off, it was around since the beginning of the last century. When Fisher Price came to be, they commissioned Morton Sol (or was that Solomon) for a look. He took the old drawings he had (from 1913 and 1928) are redrew them calling them Solomon’s (or Sol’s) Souvenir. And that becameFisher-Price’s logo. (And yes, he was paid well for his efforts.)\n\nNext, it was redrawn by Ed Benguiat and licensed for sale by ITC. Linda, you might hate Benguiat because of Souvenir. One night in the backroom of Photolettering, Ed Benguiat with Herb Lubalin had a conversation about Souvenir. The drawings were pulled out, and given to Vladimir Remington along with suggestions (I guess we call this art direction) on how to redraw the face into a new face, which when finished Ed Benguiat named it after himself.\n\nBoth Souvenir and Benguiat had a major role in Science Fiction paperback books. 1970s for Souvenir, and 1980s for Benguiat. Our trouble with it - they were so overused, that most of us in the industry wanted to puke.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\n\n**James R. Harris** is no longer with us, but if he were, he’d be telling you right now the worse face EVER - was ITC Eras. He would ask you outright - “What is this? It’s not roman, it’s not italic. It just leans there — quick someone offer it a crutch to help it stand up already.”\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nThe font I could have lived with without ever seeing or using — that’s very hard to say. Yes, there are many I dislike, and so many more that are poorly used. People selecting typefaces that just don’t marry the artwork anymore. As a former typographer, I was taught not to single out typefaces — that somewhere there is a perfect place to use - yes, even that one.\n\nWhat I can’t stand though is poor typesetting. I cringe when I see Fette Fraktur used as all caps - or for that matter, and script used in all caps - and worse - letterspaced out...\n\nThank you for my sanity moment.\n\n"
    },
    {
      "time": " 25.Aug.2007 8.38am",
      "content": "I was just thinking of Eras as a possible candidate. I had to see a lot of it when doing paste-ups for a department store daily advertising at the early days of my designing career, and never liked it since (or even then).\n\n"
    },
    {
      "time": " 25.Aug.2007 11.00am",
      "content": "Too many obvious like Papyrus, and Rotis for signage and all of that…\n\nSo i step in with  \n-Versailles. Da Hero went nuts over the years or i don’t really get it … ;)  \n-Cronos! A big question mark.  \n-Chapparal. Ok, you beat me up for this one\n\nPS  \nI’m very interested in “your Avenir Story”, please tell me/us.  \nOr was it a “Avenir Next Story”?\n\nLast calling:  \nI adore Mistral ;), really!\n\n"
    },
    {
      "time": " 25.Aug.2007 11.25am",
      "content": "@Poms  \nCalling out Mr. Slimbach? Heresy!\n\n"
    },
    {
      "time": " 25.Aug.2007 1.16pm",
      "content": "Jackie, I’m no big fan of Souvenir either (or Korinna, or University Roman, for that matter), but shame on you and Mili for dissing Eras! ;-) What next — you gonna give Friz Quadrata the boot too?\n\nAnd yes, I like Mistral — I used a sheet of it as press-on type to design my first letterhead back in the early 80’s when I lived in NYC.\n\nBut as Patty mentioned, if it’s poorly letterspaced, it’ll make you nauseous — wish I had my camera with me while running errands — I spotted some great bad signage. Another Benguiat for my collection, a sign for _SPECIAL PIZZA_ in Algerian, and an art supply store that used Mistral, Hobo, and Squire. They had repeated the word in Mistral on the building but had letterspaced it at around 400%! argh....\n\nI’m also becoming rapidly intolerant of Tempus Sans: the Comic Sans of the 21st century....\n\n"
    },
    {
      "time": " 25.Aug.2007 2.01pm",
      "content": "David Berlow: _That would have to be the ONE I’m finishing up, at any given moment._\n\nYup. That’s the one.\n\n"
    },
    {
      "time": " 25.Aug.2007 2.28pm",
      "content": " **Linda** : _Jackie, I’m no big fan of Souvenir either (or Korinna, or University Roman, for that matter), but shame on you and Mili for dissing Eras! ;-) What next — you gonna give Friz Quadrata the boot too?_\n\nFirst, I like Friz - I just wish it came in more weights than just Regular and Bold - I’d have loved to own a Demibold/Semibold...\n\nSecond - It was James. R. Harris, “Jimmy” to his friends (along with some other names) so for him - I’d romanize ITC Eras... backslant it - I think it was 8 or 9 degrees. I actually used it for MPMS’ corporate logo... years and years ago.\n\n"
    },
    {
      "time": " 25.Aug.2007 4.08pm",
      "content": "Jackie, your wishes are answered! (Well, at least so far as getting an italic and OSF is concerned.)\n\nCheck out [http://www.linotype.com/468/frizquadratabyitc-family.html](http://web.archive.org/web/20080705154015/http:/www.linotype.com/468/frizquadratabyitc-family.html \"http://www.linotype.com/468/frizquadratabyitc-family.html\")\n\n"
    },
    {
      "time": " 25.Aug.2007 8.38pm",
      "content": "Aww... I liked Eras as the titling font used in Popular Science during the 1980s.  \nPerhaps it should stay there and not go anywhere else.\n\n"
    },
    {
      "time": " 26.Aug.2007 4.44am",
      "content": " **Linda Cunningham** _Jackie, your wishes are answered! (Well, at least so far as getting an italic and OSF is concerned.) Check out http://www.linotype.com/468/frizquadratabyitc-family.html_\n\nLinda - look again - it’s still only two weights... their Regular and Bold... I’m into having that third or even fourth weight available — sometimes Bold is just too Bold for me! Thanks for trying - it is appreciated.\n\n"
    },
    {
      "time": " 26.Aug.2007 10.19am",
      "content": "Yeah, I realize that — but at least the italic, small caps, and OSF can’t hurt.\n\nI’ve gently tinkered with line weight with it for small passages in the past, but I don’t think I’ve improved it much. :-(\n\n"
    },
    {
      "time": " 27.Aug.2007 1.33pm",
      "content": "It is not us that can live without these faces - we know we can. But here is a direct “cut and paste” from my client’s word document;\n\n_All Text in Comic Sans or Tempus Sans_\n\nNo I am not making this up - it’s for their business cards — oh my!\n\n"
    },
    {
      "time": " 27.Aug.2007 6.03pm",
      "content": "If you’d like, we can probably arrange an online intervention.\n\nOr you could just show them this topic node.  \n; )\n\n"
    },
    {
      "time": " 27.Aug.2007 7.50pm",
      "content": "Dennis,\n\nA few years ago, I redid their menus. The graphic artist they had put the whole menu in 10 pt. Tempus - did all the typesetting in Photoshop - it’s a restaurant, with normal menu changes (items dropping out, new ones added and prices going up - and sometimes, even down...) it was a mess. To top it off, their average crowd are bluehairs and the lighting is, well there isn’t any, it is a very dark setting.\n\nI removed the graphics from behind and just left a beige background (they had postage stamp-type decorations under the Tempus). They wanted to see a Tempus Bold (I know, it doesn’t exist - but can be stroked...) and I finally redid the menu in ITC Giovanni for easy readability - increasing the point size and still having room.\n\nWhen I got the business card in - I knew we’d be back in Tempus — hey, at least it’s not Comic Sans.\n\nSo, thank you for listening — and I’ll probably reset it in Giovanni....\n\n"
    },
    {
      "time": " 27.Aug.2007 8.22pm",
      "content": "<cite> did all the typesetting in Photoshop</cite>\n\nI’ve heard that is frowned upon, but since it is all I’ve ever known, I have no point of reference. My main gripe is PS won’t allow you to put punctuation outside the justification, which I’m told is the way to go. I usually indent all the other lines.\n\nI guess what you are saying is it wasn’t professionally done by a real professional. Kind of like me doing it. But at least I wouldn’t choose any of the aforementioned fonts. Although I did use Comic Sans at **[dopeyhead.com](http://web.archive.org/web/20080705154015/http:/www.dopeyhead.com/)** but that was sort of a no-brainer.  \n; )\n\n"
    },
    {
      "time": " 27.Aug.2007 8.50pm",
      "content": "Hi everyone,\n\nA lot of the obvious candidates have already been nominated, but here goes...\n\n—Klang At the printing company I work for, we used to have a client who loved using this font, especially kerned/letterspaced to a ridiculous degree, and it always made me cringe.\n\n—The Peignot Family Yes, I know it’s a classic, and the titles to “The Mary Tyler Moore Show” just wouldn’t be the same without it, but like University Roman, it’s been overused and MISUSED to a degree that just makes me want to shriek.\n\n—Lubalin Graph Sorry if I offend anyone by taking Lubalin’s name in vain, but as someone born in 1970, all I can associate this font with is bad memories of elementary school, because it was ubiquitous. And just because you can add slab serifs to Avant Garde, doesn’t necessarily mean you should... ;-)\n\nCheers,  \nJohn the Fontaholic\n\n"
    },
    {
      "time": " 28.Aug.2007 1.55am",
      "content": "Latin Wide. It’s an abomination.\n\n"
    },
    {
      "time": " 28.Aug.2007 6.48am",
      "content": "Oh yes, going back to someone’s comment about setting type in Photoshop...\n\nI always, ALWAYS advise people not to do this, and it amazes me how many people don’t get it! I tell them that because Photoshop is pixel-based, the fonts are going to look crappy even if you set them at 1200 dpi resolution in bitmap (not grayscale) mode.\n\nAll you end up with is a huge file that looks lousy, IMHO.\n\nCheers,  \nJohn the Fontaholic\n\n"
    },
    {
      "time": " 28.Aug.2007 6.56am",
      "content": "<cite> because Photoshop is pixel-based, the fonts are going to look crappy</cite>\n\nFor a 500-600 pixel wide image like I use at my site, can the difference you are talking about be seen? Id so, could I lay things out in PS, then open the .psd in Illustrator and save as a .jpg there?\n\n"
    },
    {
      "time": " 28.Aug.2007 7.13am",
      "content": "Hi Fontplayer,\n\nYou had written:  \n\\>\\>For a 500-600 pixel wide image like I use at my site,  \n\\>\\>can the difference you are talking about be seen?  \n\\>\\>If so, could I lay things out in PS, then open  \n\\>\\>the .psd in Illustrator and save as a .jpg there?\n\nI’ll have to defer this question to someone with more extensive knowledge/experience of web-only/computer-screen-only typesetting. I know that “screen only” stuff is a lot more forgiving, because computer screens only have a maximum display of 100 dpi, as far as I know.\n\nI work for a commercial printing company, so my reference point is from that perspective, dealing with things that are printed on a printing press after being run to film on an imagesetter and then burned onto a metal plate...\n\nCheers,  \nJohnH\n\n"
    },
    {
      "time": " 28.Aug.2007 11.48am",
      "content": "\\>\\>For a 500-600 pixel wide image like I use at my site,  \n\\>\\>can the difference you are talking about be seen?  \n\\>\\>If so, could I lay things out in PS, then open  \n\\>\\>the .psd in Illustrator and save as a .jpg there?\n\nJohnH is talking about text that is going to be sent to a RIP for offset printing, i.e., vector graphics. Keeping the text vector based, which it is natively, allows the Raster Image Processor to print it at the maximum native resolution of the image setter, which is super high in most cases. Thus, the file stays small and manageable until the end and becomes gigantic only at the very end of the line, at maximum resolution, when it needs to be.\n\nFor screen rendering, however, you can just use Photoshop since the final output is intended to be a raster, or pixel, image. Photoshop CAN handle pixels very well, since that’s what it is intended for.\n\nBut that’s the subject for another thread.\n\n"
    },
    {
      "time": " 28.Aug.2007 5.34pm",
      "content": "Thanks for explaining that. I was worried I had to learn something new, which takes away from play time.  \n; )\n\n"
    },
    {
      "time": " 29.Aug.2007 2.40pm",
      "content": "Here’s one I’ve not seen mentioned: Adobe Serif MM. There are unfortunately certain programs that generate PDFs without embedding outlines — old versions of StarOffice come to mind. If the original fonts aren’t available when the PDF is opened, Acrobat Reader will substitute Adobe Serif MM (or Adobe Sans MM as appropriate). There’s nothing worse than reading an entire document set in Adobe Serif. Ugh!\n\n"
    },
    {
      "time": " 29.Aug.2007 2.55pm",
      "content": "But that isn’t Adobe Serif’s fault. Don’t hate. ;^)\n\n"
    },
    {
      "time": " 30.Aug.2007 6.20am",
      "content": " **John** _...always, ALWAYS advise people not to do this, and it amazes me how many people don’t get it! I tell them that because Photoshop is pixel-based..._\n\nJohn,\n\nIt isn’t because it is a pixel-base that I too, ALWAYS tell folks (stronger than “advise” and uh hum, not as polite) to use a page layout program. Yes, you can save your type in a layer - but when the revises come - and whole lines get moved around - nothing beats word processing... With Photoshop you might as well take your time to reset your type because it’s faster than cut/paste/repaste/recut/move this/ move that....\n\n"
    },
    {
      "time": " 31.Aug.2007 8.52am",
      "content": "Funny idea to ask.\n\nOk, lets say Rotis without thinking a lot.  \nHate it.  \nReason: its so German. ;-)\n\nStefan\n\n"
    },
    {
      "time": " 31.Aug.2007 8.56am",
      "content": "And PS\n\nmaybe it’s provocative  \nbut wouldn’t it be a nicer and more charming world without the creations of Frutiger?  \nJust asking.\n\nStefan ;-.\n\n"
    },
    {
      "time": " 31.Aug.2007 9.18am",
      "content": "Oh Stefan - please don’t banish Frutiger - I love that font.  \nIt is a great text font when looking for a sans serif font that’s not Helvetica...\n\nI’m in the middle of a job right now and Frutiger is wonderful.\n\nLooks like we are back to personal selections. I am reminded of a person named Emil who was looking at the head of a deer on a wall. He asked me what I thought of it - I thought it was horrible. He asked me about putting it on a scale of 1 to 10 — 10 the best. I gave him a 1. He then told me he was a hunter, it was a beautiful speciman, it made him happy that someone mounted it and gave it a 10.\n\nAnd so a 10 to Frutiger.\n\n"
    },
    {
      "time": " 31.Aug.2007 11.25am",
      "content": "You are certainly right,  \nit works so well. But sometimes (I do work also with Frutiger for job reasons) I wish it would be a little, just a little, a tiny little bit less perfect. More human.\n\nStefan\n\nI give it a 5 actually fot this defect.  \nBut please don’t say you love Rotis ;-)\n\n"
    },
    {
      "time": " 31.Aug.2007 6.14pm",
      "content": "[Whitney](http://web.archive.org/web/20080705154015/http:/www.typography.com/catalog/whitney/index.html), as I’m sick of having to look at it at work every day.\n\n"
    },
    {
      "time": " 1.Sep.2007 12.45am",
      "content": "Stefan - I have NEVER loved Rotis... Now Wunderlich was a different story...\n\n"
    },
    {
      "time": " 1.Sep.2007 6.02am",
      "content": "Hi Jackie!\n\nWho is Wunderlich?\n\nStefan\n\n"
    },
    {
      "time": " 1.Sep.2007 9.19am",
      "content": "It was a favorite san serif font of James R. Harris for a while. I paid a fortune for it and he only used three words worth. A few years later I made him use it for a book from Peregee — it never caught on - but you know, as I relook at it — it was nice.  \nYep - even the “g”  \n [http://www.fontshop.com/search/?q=wunderlich&site=d](http://web.archive.org/web/20080705154015/http:/www.fontshop.com/search/?q=wunderlich&site=d \"http://www.fontshop.com/search/?q=wunderlich&site=d\")\n\n"
    },
    {
      "time": " 5.Sep.2007 5.16pm",
      "content": "Dan!\n\nDuring my second job in 1988 I spec’d enough Souvenir to choke a horse wearing bell-bottomed pants! It was dated even then. I so agree with you. Other FONTS THAT MUST DIE:\n\nHobo (unless you are actually hopping a freight)  \nArial (a cheap imposter commissioned by Bill Gates)  \nVerdana and Georgia (great on screen, terrible in print. Sorry Mr. Carter...)  \n... and the easy two that you mentioned.\n\nMy favorite ugly font:  \nBrush Script ( I know, I know, but I can’t help it)\n\nH. Todd Duren,  \ndesigner. educator. yada yada\n\nmyopendoor.net\n\n"
    },
    {
      "time": " 7.Sep.2007 1.50am",
      "content": "What about Times New Roman?\n\n"
    },
    {
      "time": " 7.Sep.2007 2.44am",
      "content": "Agree Times in postscript is horrible but find it looks surprisingly nice (and totally different) done with letterpress.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/metaltimes_5475.jpg)\n\n"
    },
    {
      "time": " 7.Sep.2007 7.36am",
      "content": "That’s indeed looking quite nice.\n\n"
    },
    {
      "time": " 7.Sep.2007 8.01am",
      "content": "Yes Fontplayer! HOBO! If we could just remove it from the hands of all those sign shops we would be progressing.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/acs_rend_5659.php.png)\n\n"
    },
    {
      "time": " 9.Sep.2007 11.41am",
      "content": "Hey Simon!\n\nYes its much nicer in letterpress indeed!  \nA fumdamental probelm of Times (though it works quite well in text one has to admit)  \nis that it looks so sharp edged and stiff.\n\nStefan\n\n"
    },
    {
      "time": " 9.Sep.2007 6.52pm",
      "content": "Hey Simon!\n\nHow’d you know that’s my name done in Times on the letterpress?? :-D\n\nI agree that it looks much better done that way, more “real” somehow, if you know what I mean.\n\nThe print shop that I work for, still has a Heidelberg letter press which almost never gets used for print work anymore; mostly it’s pressed into service for numbering or crash-imprinting pre-printed NCR forms. But it’s always nice to see people using it for letterpress work, especially if the stock being used is a really thick one. But these days, most people don’t want to spring for the additional money and time of having an actual die made...\n\nCheers,  \nJohn the Fontaholic\n\n"
    },
    {
      "time": " 9.Sep.2007 7.16pm",
      "content": "I generally avoid posts about “worst,” “hate” or “nuke it” since I’ve seen some brilliant pieces using what some think are terrible faces.\n\nBut I do have to say I have great distaste for designs that _emulate_ other writing systems. For some reason it bothers me as much as ethnic jokes.\n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Mandarin_6085.png)\n  \n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Faux_Arabic_5605.png)\n  \n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Kajur_6571.png)\n  \n\n ![](http://web.archive.org/web/20080705154015im_/http:/www.typophile.com/files/Hebrew_Latino_3824.png)\n\n"
    }
  ]
}
