{
  "id": "36414",
  "title": "Typecon 2008 Buffalo",
  "forum": "SoTA & TypeCon",
  "tags": [
    "SoTA & TypeCon"
  ],
  "content": "Feel free to post ideas, proposals, wish lists, cranky complaints or anything related to next years typecon. The gears are in motion.\n\n",
  "author": "kegler",
  "time": "23 Aug 2007 — 9:58am",
  "uid": "1334",
  "comments": [
    {
      "time": "30 Aug 2007 — 4:56pm",
      "content": "Live webcam broadcasts of the conference?\n\n"
    },
    {
      "time": "4 Sep 2007 — 7:04am",
      "content": "From [another thread](http://web.archive.org/web/20150317143012/http:/typophile.com/node/36729):\n\nJames Puckett, quoting James Montalbano:\n\n\\>There is money to be made in type...Take yourselves seriously for crying out loud!\n\nJames, that would be a great topic for Typecon 2008 :)\n\nJames Montalbano:\n\n\\>James, that would be a great topic for Typecon 2008 :)\n\nIts my feeling that the majority of TypeCon should address this issue. The business side of type always gets short-changed at TypeCon. 4 hours of Dwiggins vs 45 minutes of Q&A with Frank Martinez.\n\n"
    },
    {
      "time": "26 Sep 2007 — 6:53am",
      "content": "I personally like talking to Frank Martinez about Dwiggins, so either way is fine by me.\n\nAdditional suggestions and proposals are more than welcome.\n\nAs an aside, we have set up a flickr group for found lettering around the Buffalo area [http://flickr.com/groups/buffalotype/pool/](http://web.archive.org/web/20150317143012/http:/flickr.com/groups/buffalotype/pool/ \"http://flickr.com/groups/buffalotype/pool/\")\n\nMore soon\n\n"
    },
    {
      "time": "26 Sep 2007 — 7:29am",
      "content": "Will my photo of a Buffalo nichol do? :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2007 — 7:56am",
      "content": "Two suggestions:\n\n1. Audio record the talks and workshops. The recordings, combined in a package with slides from the speakers could be sold afterwards, or given to attendees and sold to others. I think that particularly technical workshops would sell, as people on Typophile who couldn't get to conferences has said so.\n\nThe speakers would need to number slides and identify them as they talk. This approach might be easier to pull off and cheaper than trying to film the presentations, which would cost more. Often speakers are in the dark anyway.\n\n2. Have a panel to discuss optical size and type design. How do different designers treat problems of optical size--x height, contrast, spacing etc.? Does it vary with the intended use: Does what is desirable hange with newspapers, magazines, books, the web? What is the recent history of this--Adobe, FontBureau, H&FJ, etc.? Are there trends?\n\n"
    },
    {
      "time": "14 Dec 2007 — 7:12pm",
      "content": "How about OpenType support? How far has it come and what still needs to happen?\n\nChrisL\n\n"
    },
    {
      "time": "13 May 2008 — 3:08am",
      "content": "So we have a few days left for early registration, but I’m not finding a place to register.\n\n"
    }
  ]
}
