{
  "id": "3642",
  "title": "Untitled Serif",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "This is my first post, and first typeface.   \n   \nI'm still mid-process, but see the design fracturing into a few different directions and was hoping I could get some feedback about which characters are the most successful at this point, so I can use those as models to finish out the face.   \n   \nThanks in advance for your advice.   \n   \n [Sample here](http://web.archive.org/web/20150317160946/http:/www.iixii.net/type/)\n\n",
  "author": "cpalmieri",
  "time": "17 Mar 2004 — 8:31am",
  "uid": "1956",
  "comments": [
    {
      "time": "17 Mar 2004 — 5:52pm",
      "content": "Could you maybe post a jpeg here in black and white. I could give you more feedback if i can see how it looks in the nude.   \n   \njp\n\n"
    },
    {
      "time": "17 Mar 2004 — 6:58pm",
      "content": "Sure, does this work?   \n   \nThanks for taking a look.   \n   \n ![type sample](http://web.archive.org/web/20150317160946im_/http:/www.typophile.com/forums/messages/29/28812.gif)\n\n"
    },
    {
      "time": "18 Mar 2004 — 1:23pm",
      "content": "I think that some of the ligatures you are creating are interesting. I like the \"AN\" at the top. The second \"N\" is my favorite. This looks like it would be used to reference art deco.   \n   \nGenerally I prefer the versions with a wider character width. In specific the 2nd \"N\" and \"R\", the first \"K\" and \"J\". Within it as a whole I think you need to decide on a set of characters that all go together(26 letters, etc.) and post that so we can all see if they are all working together. It is harder to tell when you have a few variations of each.   \n   \nIm undecided about the outline around each. What are your influences for this typeface?   \n   \njp\n\n"
    },
    {
      "time": "18 Mar 2004 — 8:38pm",
      "content": "Thank you for your thoughts.   \n   \nI guess I was leaning in the opposite direction that you are suggesting, I've personally been leaning towards the narrow width forms (first \"R\" second \"V\" 5th \"2\").   \n   \nI haven't hammered out a concrete list of influences, but there seems to be this art deco influence, a cheesy romance or whodunnit novel influence, with a dash of disco, and a dash of football jersey. All of these are kind of imagined though, I have not done any formal research.   \n   \nOf course I want this thing to be well crafted, but I'm not looking to build a \"workhorse\". I would rather err on the side of quirky and lowbrow.   \n   \nAlso, I realize that at this point I'm giving you too many options, but in the end I was expecting to offer the typeface with many alternates, so that users have a lot of flexibility in creating unique word shapes.   \n   \nBelow I've greyed out letters that are either unresolved, or which I can't choose which one I like. The dark black ones, are more or less the foundations of the face.   \n   \n ![second version](http://web.archive.org/web/20150317160946im_/http:/www.typophile.com/forums/messages/29/28873.gif)\n\n"
    },
    {
      "time": "22 Mar 2004 — 9:23am",
      "content": "I was going to say it has vague resemblances to City, in relation to your football comment. Whichever way you choose the letterform are all crafted fairly well. I guess I would just throw a dart(while peeking through)and use the results to map out the rest.   \n   \nAs a pixel font, I think it is fairy strong. Unique and just another face created in light of our growing reliance on the web.   \n   \njp\n\n"
    },
    {
      "time": "29 Mar 2004 — 4:12am",
      "content": "Thanks for the praise, after a week away from it I'm starting to see a clearer conclusion to this one.   \n   \nAnyway, assuming that I am able to successfully finish it as a PSD, do you know of any foundries that work with pixel fonts that are semi-anti-aliased such as this one?\n\n"
    }
  ]
}
