{
  "id": "36428",
  "title": "You are not authorized to post comments!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Anyone else getting this? Bizarre.\n\n ![](http://web.archive.org/web/20130820160705im_/http:/typophile.com/files/noaccess_6346.jpg)\n\nI’m getting it in the Type ID quiz thread.\n\n",
  "author": "Conor",
  "time": "23 Aug 2007 — 2:04pm",
  "uid": "12639",
  "comments": [
    {
      "time": "23 Aug 2007 — 2:22pm",
      "content": "fixed\n\n"
    },
    {
      "time": "23 Aug 2007 — 2:23pm",
      "content": "Goodo!\n\n"
    },
    {
      "time": "23 Aug 2007 — 3:50pm",
      "content": "Mr. Berkson noticed this as well: [http://typophile.com/node/36430](http://web.archive.org/web/20130820160705/http:/typophile.com/node/36430 \"http://typophile.com/node/36430\")\n\n"
    },
    {
      "time": "5 Jun 2013 — 1:04am",
      "content": "JNike, is considered to be all the time, all on behalf of the brand sports shoes, [Cheap Air Jordans For Sale](http://web.archive.org/web/20130820160705/http:/cheapjordans11online.webs.com/)\"Air Force One\" in 1982, released a sneaker variety. Still shines with its seductive charm in the industry since its launch dated nearly 25 years. Interestingly, this shoe was named after the plane, carrying U.S. President's Air Force One.\n\nFortunately, in this year's hip-hop culture is very popular and enhance these shoes because of the popularity of these shoes are mostly preferred by the hippies. [Jordans 11 Online For Sale](http://web.archive.org/web/20130820160705/http:/cheapjordans11online.webs.com/) Because of this people of New York hip-hop culture and people usually associated with sports basketball so popular Air Force, in all people.\n\nHistory tells us that the popularity spawned Nike Air Force, they will owe the popular name of the famous basketball player Michael Jordan although Michael Jordan never liked the brand, but he gave Nike introduced a new idea in 1985 by another variety is called Jordan series shoes, the rest is history. [Jordan 11 Space Jam For Sale](http://web.archive.org/web/20130820160705/http:/cheapjordans11online.webs.com/) Was replaced with bold red and black colors of the shoes, shoes look bold and beautiful white traditional trend. Nike launched a number of versions, including celebrity exclusive, special holiday shoes and limited colors. A broad range from the mid top and high top low top shoes is present in the variety of Nike shoes. Nike has created a version of each, and the most surprising is that in his own style and unique features, different from previous versions.\n\nThat this is starting to close and basketball shoes, and later endorsed in many other products as well, like sports shoes, casual shoes, exclusive clothing, women's, men's, children's clothing, bags, accessories and many such things is none other than Michael Jordan. The growing popularity of the two brands of Nike, [Cheap Air Jordans 11 Online](http://web.archive.org/web/20130820160705/http:/cheapjordans11online.webs.com/) you can clearly see that by looking at the crowd anxiously awaiting the new breed, sell, auction, you can make your inside from different online stores selling the new purchase, rare , and many other varieties of these shoes, you have a great choice, not only fit your tastes, but your pocket. You can on these sites, all varieties, which will help you make a wise choice, if you have done so, the difficulty encountered a real review. If you have not tried Jordan single time, and then try and feel the difference...123\n\n"
    },
    {
      "time": "5 Jun 2013 — 2:13am",
      "content": "Is the above comment ironic or just coincidental?\n\n"
    }
  ]
}
