{
  "id": "36422",
  "title": "Blog Directory",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey powers that be, is there a Typophile Blog Directory which lists those that blog here at Typophile? And if there isn’t one - could you please create one and perhaps add it to the Forums directory?\n\nTanks\n\n [‹ Helvetica, 1953 or 1957?](http://web.archive.org/web/20081202191052/http:/www.typophile.com/node/36476 \"Go to previous forum topic\") [The TypeCon 2007 thanks thread. ›](http://web.archive.org/web/20081202191052/http:/www.typophile.com/node/35738 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202191052/http://www.typophile.com/user/9690\" title=\"View user profile.\">Hiroshige</a>",
  "time": "<br>",
  "uid": "9690",
  "comments": [
    {
      "time": " 23.Aug.2007 12.08pm",
      "content": "This is the closest we have, which lists the most recent blog entries from all users:\n\n[http://www.typophile.com/blog](http://web.archive.org/web/20081202191052/http:/www.typophile.com/blog \"http://www.typophile.com/blog\")\n\n"
    },
    {
      "time": " 25.Aug.2007 11.02pm",
      "content": "That’s too bad - it’s lame.\n\n"
    },
    {
      "time": " 26.Aug.2007 9.57pm",
      "content": "Well, it must have sounded like a good idea when first proposed. But then, blogs (like anyone other web-based personal showplace, u, u, u/me, me, me) do tend to be lame.\n\nGerald\n\n"
    },
    {
      "time": " 26.Aug.2007 10.06pm",
      "content": "The best way to follow the blogs is either to follow the tracker which will show you all new threads (blog or otherwise) and all new action on the threads. Another option is to subscribe to the blogs using a reader such as Google’s.\n\n"
    },
    {
      "time": " 27.Aug.2007 7.45am",
      "content": "Hiroshige...if you have the ambition, you could start a Typophile Blog directory at a place like [http://www.bloglines.com/](http://web.archive.org/web/20081202191052/http:/www.bloglines.com/ \"http://www.bloglines.com/\") or just maintain one in the wiki here.\n\nThe /blog page is just for folks using the blog tool here, right?\n\n"
    },
    {
      "time": " 27.Aug.2007 12.37pm",
      "content": "Yes.\n\nAll I use mine here for is to post up notices that my Flickr page and/or my “real” blog has been updated — never have figured out why this is the sort of “feature” anyone would ever use for much else here, given the preponderance of free blogs (Blogger, WordPress, etc.) out there that are infinitely more customizable....\n\nWould someone please address why the blog seems to be “better” than the late and lamented IM?\n\n"
    },
    {
      "time": " 27.Aug.2007 1.28pm",
      "content": "@Hiroshige: Sorry the lack of a blog directory is lame to you, but in the future perhaps it will be more valuable. For the time being, forum directories are our priority.\n\nWe have noticed a huge increase of interest in the blog feature (totally optional) since we opened it up to all users (understandably so). Most importantly, the blog feature has allowed a lot of new users to have a venue for their thoughts and comments, when sometimes they may feel intimidated by the big boys in the forums — a common issue.\n\nThe Typophile blogs are in no way intended to be a replacement to WordPress or Blogger. I’d imagine there are a lot of people here who would simply like a place to vent typographic frustrations to a specific audience, when maybe their other blog about knitting sweaters for kittens isn’t exactly the place to do so.\n\nThe IM feature was really kind of lame and doesn’t benefit as many people nor add anything very unique or valuable to the site. A small handful of people used it, it was terribly buggy and a little annoying, IMHO.\n\n"
    },
    {
      "time": " 27.Aug.2007 6.47pm",
      "content": "No need to apologise to me Zara, I didn’t mean to sound harsh.\n\n"
    }
  ]
}
