{
  "id": "36443",
  "title": "Font Portfolios",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello everyone!\n\nFirst post here at this forum filled with talent! Since this is the \"release\" forum, please list some of your portfolios, or fonts you've made. I only ask this because I'm launching a new site called Fawnt.com and I want to find the BEST fonts. I've been searching the web for days looking for the best fonts for designers, developers, and people that like pretty fonts. The site doesn't have a ton of fonts right now because I only added a few dozen. I've collected a lot of fonts, but I'm looking for more!\n\nI'm only looking for free fonts really, and if yours gets on the site, it will be nothing but a ton of exposure!\n\nFeel free to post fonts you've made, and any thoughts!\n\nP.S. The site hasn't officially launched yet :P\n\n",
  "author": "marcom10",
  "time": "24 Aug 2007 — 12:09am",
  "uid": "21060",
  "comments": [
    {
      "time": "24 Aug 2007 — 12:58am",
      "content": "How will fawnt.com offer something different from the 200 free font sites already in existence?\n\n"
    },
    {
      "time": "24 Aug 2007 — 6:52am",
      "content": "\\>I’m only looking for free fonts really, and if yours gets on the site, it will be nothing but a ton of exposure!\n\nThe type designers who's work you exploit get 'exposure' and you get **cash** in the form of ad revenue. Have you considered paying the designers that money? Think of the great PR such a move would create?\n\n"
    },
    {
      "time": "24 Aug 2007 — 7:03am",
      "content": "What Stephen said.\n\n"
    },
    {
      "time": "24 Aug 2007 — 8:29am",
      "content": "There are hundreds of free font sites, that's right. But they just have thousands of mediocre fonts. With Fawnt, we look minimize the ugly fonts, and link to only the most appealing.\n\nI don't understand how I am \"exploiting\" a designers work. First of all if the fonts are free, their is no \"exploiting\". Anyone can link to free fonts, I wouldn't see any harm in it if proper credit is given.\n\n"
    },
    {
      "time": "24 Aug 2007 — 8:37am",
      "content": "I applaud the desire to have a free font site with only \"pretty\" fonts, but I see a problem. In general, most free fonts sites do not know the origin of the designs. This finds them actually sharing pirated fonts and other's intellectual property. How do you plan to make sure you aren't doing that?\n\n"
    },
    {
      "time": "24 Aug 2007 — 8:45am",
      "content": "Most of the fonts I've collected (not on the site yet) are free fonts from designers around the world. I've also found some fonts from deviantart and other design resources. That being said, the chances of a designer with a nifty portfolio showcasing pirated fonts is very slim. The possibility of it on deviantart and other resources is greater, but by reading the comments and other notes it gives you reassurance that the original poster is the creator. (people will call you out in the comments if it's pirated)\n\nI also hope that if the site gets off on a good foot the community will be able to help spot any \"foes\" in the listings.\n\nThanks for your comments....\n\n"
    },
    {
      "time": "24 Aug 2007 — 8:49am",
      "content": "<cite>With Fawnt, we look minimize the ugly fonts, and link to only the most appealing.</cite>\n\nAnd your definition of an ugly font is?\n\n"
    },
    {
      "time": "24 Aug 2007 — 8:55am",
      "content": "My definition of an ugly font is one that is of mediocre quality and is not appealing. When you visit sites like Dafont, sure they have some nice fonts, but most of them are either too jagged, destroyed, script, or overdone that they lose the appeal of the viewer.\n\nIn finding \"appealing\" fonts, I tend to look for clean fonts with an easy to read typeface that would be good to use for design, web, print, etc.\n\nNot sure if I got it all out, but I hope that helps :)\n\n"
    },
    {
      "time": "24 Aug 2007 — 9:49am",
      "content": "Well, you certainly have a decent idea. As a .gov worker with zero budget for fonts, I've been slowly compiling a list of the good freeware/opensource ones that are out there.\n\nAlas, there just isn't that many. Maybe 2 dozen at most.\n\nFYI, fontleech was started with the same goal, but they ended up running out of fonts to talk about:\n\n[http://fontleech.com/](http://web.archive.org/web/20131012142012/http:/fontleech.com/ \"http://fontleech.com/\")\n\nSo, your intentions seem to be good, just a heads up on the reality of what's out there. ;o)\n\n"
    },
    {
      "time": "24 Aug 2007 — 10:14am",
      "content": "\\> _[...] I want to find the BEST fonts. I’ve been searching the web for days looking for the best fonts for designers, developers, and people that like pretty fonts. [...] I’m only looking for free fonts really_\n\nLooks like you haven't been searching hard enough...  \nWhy building a new site when we already have the real thing? [http://typophile.com/node/14652](http://web.archive.org/web/20131012142012/http:/typophile.com/node/14652 \"http://typophile.com/node/14652\")\n\n"
    },
    {
      "time": "24 Aug 2007 — 10:42am",
      "content": "Because, typophile isn't there to provide the best free fonts. It's goal is to provide a community where designers alike can share, converse, and learn about typography. When creating this site their main goals wasn't to \"provide the community with beautiful free fonts\".\n\n"
    },
    {
      "time": "24 Aug 2007 — 10:42am",
      "content": "I don't think you can say there are 2 dozen fonts. I have found well over 2 dozen, you just have to digg deep.\n\n"
    },
    {
      "time": "24 Aug 2007 — 12:13pm",
      "content": "I think Miguel's point is that according to your criteria (and also minimizing the hassle of piracy issues), the work of compiling a list of \"best free\" fonts has already been done.\n\nBut you could make your selection of what you think is best from this \"author-ized\" list, and show them on your site in specimen form. That would give your site a lot of cred with the design community -- where a lot of people think that the best fonts don't just look pretty, but are pretty ethical as well.\n\n"
    },
    {
      "time": "24 Aug 2007 — 12:22pm",
      "content": "Points taken.\n\n"
    },
    {
      "time": "24 Aug 2007 — 1:02pm",
      "content": "Not to add more issues to the list, but if this is really going to work I hope you are getting permission from the foundries. Many foundries include a EULA, or have one posted, that goes along with the free downloaded font. For instance, OurType has a free font, but the EULA clearly stipulates, among other things, that you can't share it from any other sites or in any other way.\n\n"
    },
    {
      "time": "24 Aug 2007 — 1:43pm",
      "content": "\"I don’t think you can say there are 2 dozen fonts. I have found well over 2 dozen, you just have to dig deep.\"\n\nI have. I can say that there are only about 2 dozen decent free fonts out there of a caliber worth recommending to anyone that wants a professional level typeface for no cost.\n\nYou are free to disagree, of course. ;o)\n\nAnyways, Miguel Sousa's link will pretty much sum up any suggestions you're going to get from this particular community.\n\nRegarding downloading...I have been assuming that you are merely talking about the faces and not actually hosting the files. Is that correct? If not, do note that most of the decent free typefaces out there clearly state that you may not redistribute them in any fashion. (and, now that I see Tiffany's response, I see has already been mentioned).\n\n"
    },
    {
      "time": "24 Aug 2007 — 1:53pm",
      "content": "I have been nothing but bashed in here. Of course for all the other fonts sites it's fine for them to list fonts right guys?\n\nPlease lock this thread.\n\n"
    },
    {
      "time": "24 Aug 2007 — 2:13pm",
      "content": "marcom10, I don't think you should take it personally: the people in this forum have nothing against you. Sure, there are people here who don't think your idea can work. Maybe they're wrong, but they have their opinions, and they would be doing you a disservice if they encouraged you to put money into a venture they thought would fail.\n\nAlso remember that we are craftsmen and artists, and more than that, we are in an industry rife with piracy; we sometimes can be defensive of our work, and that of our fellows.\n\nI for one, like your idea, but as has been pointed out above, others have tried and failed. If you think you can do it successfully and ethically, I would personally love you to succeed.\n\n"
    },
    {
      "time": "24 Aug 2007 — 2:18pm",
      "content": "Marco, the folks here have been very helpful and not dissed your intentions at all. I've seen a lot worse.  \nFree fonts is a touchy subject as many of us make our living from fonts, and can't even agree amongst ourselves what is the acceptable way to deal with the issue.  \nYou've got some valuable feedback, information, opinions and ideas.  \nGood luck with your site!\n\n"
    },
    {
      "time": "24 Aug 2007 — 2:38pm",
      "content": "Marco, I apologize if you feel bashed. I was interested to watch FontLeech and I'd be equally interested to watch yours. The issue is, as other have hinted, that there just aren't that many high quality (book text quality?) free fonts available without distribution issues. That's all. Don't let us stop you. Please do it and prove us wrong. I am interested to see what you come up with.\n\n"
    },
    {
      "time": "24 Aug 2007 — 2:46pm",
      "content": "\"I have been nothing but bashed in here.\"\n\nWrong. read the thread again slowly. The thread is filled with very useful suggestions.\n\n\"Of course for all the other fonts sites it’s fine for them to list fonts right guys?\"\n\nWhat did you say above? This:\n\n\"There are hundreds of free font sites, that’s right. But they just have thousands of mediocre fonts. With Fawnt, we look minimize the ugly fonts, and link to only the most appealing.\"\n\nSo you don't want to model your site on the 200 others anyway. Differentiate it. To do that, don't ignore the suggestions made here.\n\nIt's for your own protection, and to increase the value of your site, that people are cautioning you about re-distribution. A simple solution is to provide links from your site to the legitimate source, rather than offer the fonts themselves.\n\n"
    },
    {
      "time": "24 Aug 2007 — 2:48pm",
      "content": "\"I have been nothing but bashed in here.\"\n\nNo one has bashed you. We've given advice and a list of compiled free fonts that folks in here found worthy.\n\n"
    },
    {
      "time": "24 Aug 2007 — 3:24pm",
      "content": "\\>I don’t understand how I am “exploiting” a designers work.\n\nYou attract traffic based on work that someone else has done and take ad revenue for doing so. Exploit doesn't have to be bad - but if the designers get exposure and you get money that doesn’t seem to be a good deal for the designers?\n\nAnyway why fawnt? that doesn't evoke pretty fonts in my opinion, more like brown fonts ;-)\n\n"
    },
    {
      "time": "26 Aug 2007 — 5:02pm",
      "content": "When many free fonts are released, the license agreement allows for distribution on free font web sites. So you're not doing anything wrong if you abide by the rules. When I made my freeware fonts, I did so with full knowledge that they would be used for commercial purposes and would be distributed on free font websites. I don't know why anyone would have a problem with that. Free fonts are released. Free font sites are a legitimate method of distribution. It's nice when font site owners give back to the designers. In over a decade at this, Jason Nolan at 1001freefonts.com is the only free font website owner who actually gives something back. Payment for distribution on a free font site is not required for any free fonts as far as I know.\n\nHere's a freeware site with a similar aim which I made a couple of months ago.  \n [http://www.fontsugar.com/](http://web.archive.org/web/20131012142012/http:/www.fontsugar.com/ \"http://www.fontsugar.com/\")\n\nResearching the origins of free fonts and sending a few hundred email for fonts which require permission is the hardest part. I had some help and it took a solid month to put together. Most freeware font designers are hard/impossible to track down. There are very few actual free fonts, most are shareware or have complex licensing restrictions.\n\nFeel free to use any freeware fonts from Larabie Fonts. If you get rich, send me a free t-shirt. If you download them using the shopping cart feature on MyFonts, you'll be informed of updates . . . so you can keep the versions on your site fresh. I hate getting tech support email about buggy versions of fonts I made in 1996.\n\nThere are a few free fonts on Typodermic.com - you can use those as well.\n\n"
    },
    {
      "time": "27 Aug 2007 — 7:57am",
      "content": "\"I don’t know why anyone would have a problem with that.\"\n\nI can see two problems (some) folks might have:\n\n1) free (anything) is often used as a promotion. It's specifically done to drive traffic to their web site.\n\n2) quality control. Many folks, I imagine, want to retain a certain trade dress for their offerings.\n\nBut, yea, the key is to just be aware of the license and abide by it.\n\n"
    },
    {
      "time": "27 Aug 2007 — 8:08am",
      "content": "Ray, one question, knowing what you know now, and after dealing with people like Mike (marco) over the years, would you have put your fonts out into the public domain, or would you have held back some rights?\n\nCheers, Si\n\n"
    },
    {
      "time": "27 Aug 2007 — 8:12am",
      "content": "I don't usually visit this forum, so I've been missing all the fun. The tracker link got my attention.\n\nMarco, this site is mainly attended by people making a living with fonts. Many have stories of abuse of commercial fonts by 'free' sites. And free is in competition with their ultimate goal of selling fonts to make a living.\n\nPeople looking for free aren't usually the ones willing to spend $20-$40 or more for a font.\n\nAnd most of the rest (I'm in this category) are probably too jaded to share the beauty of your vision, much of which might involve a matter of personal taste. So it is reasonable that no one will be excited by your idea. But good luck with it.\n\n"
    },
    {
      "time": "27 Aug 2007 — 9:21am",
      "content": "One other question for Ray. What's your feelings regarding ad revenue? I note that neither fontsugar or fontlover have Google or similar ads.\n\n"
    },
    {
      "time": "27 Aug 2007 — 10:13am",
      "content": "Knowing what I do now, I wouldn't have made free fonts. Customer support for fonts I made a decade ago is expensive. Even though people aren't paying, they're still customers so I have to deal with that. It's ended up being a huge burden. But, a few generous people who've donated along the way make it all worth it.\n\n"
    },
    {
      "time": "27 Aug 2007 — 10:19am",
      "content": "Makes sense. Interesting that in the open source world providing support is where they make all the money.\n\n"
    },
    {
      "time": "27 Aug 2007 — 10:25am",
      "content": "Fontsugar and Larabie Fonts have Google ads but they don't even cover the bandwidth. Fontlover is Jess Latham's site. The Larabie Fonts site is mainly about directing people to Typodermic and introducing people to MyFonts. Even though they're free fonts, it's all about gettign people to use the MyFonts shopping cart. Let's say someone who has never considered buying fonts before is looking for some freebies for a project. If they end up at Larabie fonts, tossing freebies in the shopping cart, they may end up getting hooked on a pay font that's too good to pass up. The perfect font for their project. So, the freebie customer is now a first time font buyer. Perhaps they'll discover the advantages of pay fonts (no weird license restrictions, better quality and support). A lot of freeware sites I've seen attempt to trick people into visiting pay sites. I didn't want to do that so I put all free fonts on MyFonts. That way customers get version updates too and I can sell OpenType/PS versions. Font Sugar is even more straightforward: here are free fonts, here are pay fonts.\n\n"
    },
    {
      "time": "27 Aug 2007 — 12:18pm",
      "content": "Well, I do make a bit off support, sort of. I do a lot of business with customization and custom contracts for those old fonts, so it's not a total loss. But most of the customization work is for Typodermic fonts.\n\n"
    },
    {
      "time": "27 Aug 2007 — 1:25pm",
      "content": "Thanks for the insights.\n\nCheers, Si\n\n"
    },
    {
      "time": "27 Aug 2007 — 4:45pm",
      "content": "I tried google ads once at fontlover.com but they didn't do that great. I have a link to myfonts but that's hasn't done anything for me either. I have a banner for my latest font but I'm not sure if that's sending anyone to bv. Mostly fontlover is for myself 'cause I like seeing what's new, hee.\n\n"
    },
    {
      "time": "27 Aug 2007 — 5:59pm",
      "content": "Funny thing about the google ads, I started out averaging over $4 a day, so said to myself, I wonder what would happen if I worked at it. So I started processing and posting more photos, adding scans of various things, and watched it drop to $2 a day.\n\nSo, I stopped working harder at it. Math isn't my strong suit, but more work for half the money struck me as a de-incentive. So I'm just sitting back and raking in my $2 a day. Eat your heart out.  \n; )\n\n"
    }
  ]
}
