{
  "id": "36445",
  "title": "women and typography",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hey\n\nim currently researching into the relationship between women and typography/type design, and im looking at the implications of gender in industry.\n\nIm hoping to use a base of primary research, so Id like to see if any of you guys have experiences or opinions on the subject. Reading a thread on Carol Twombly, there seems to be rumors of discrimination (but nothing so factual.. infact ill look for her biography) Id like to see how things have changed since then. Im interested in whats going on currently - Im sure everyone would like to think equality is here, and im not trying to point some feminist finger. Im interested because I have found hardly any literature on the subject, and believe its not fully explored territory.\n\nareas of interest:\n\n-Is gender an issue that has affected you as a designer?  \n-Do you think you have had to work harder for the recognition you have achieved because you are a woman?  \n-Has your gender affected the course of your career in terms of your decisions and the options open to you?  \n-Do you think it would be beneficial for there to be more support for women within typography and type design?  \n-Have you found that women are hidden away in production, or cluster in behind-the-scenes jobs?  \n-Do in-built female traits make women unsuitable for dominant, leading positions?  \n-Does a combination of male and female typographers form a stronger force, balancing skills from each side?  \n-Is there a difference in the way each gender uses typography? Are skills in using type gender specific?  \n-Are female typographers (and designers) forced to masculinize themselves to 'fit in' to male organisations/earn male respect?  \n-Is gender no longer an issue, and we should be concentrating more on the individual instead of grouping them?\n\nIm very interested in your responses, please refer me to an older thread if youve done this all before\n\nthanks\n\nLindsay\n\n",
  "author": "lindsay noble",
  "time": "24 Aug 2007 — 3:23am",
  "uid": "17501",
  "comments": [
    {
      "time": "24 Aug 2007 — 8:37am",
      "content": "This might not amount to much, but Zuzana Licko is responsible for many of Emigre's releases, if not the majority of them, and I don't think of them as either masculine or feminine.\n\n"
    },
    {
      "time": "24 Aug 2007 — 8:57am",
      "content": "Not being a woman I can’t provide much insight into most of your questions...\n\nMilton Glaser wrote a piece for Design Observer last year about the relative lack of women in the upper echelons of design, which was quite striking given that in the lower and middle ranks of the industry, as well as in design school, women outnumber men. It generated a very heated discussion, and is worth reading.\n\nIt would be worthwhile to see if relevant professional organizations can provide you with information about the gender breakdown of their membership, especially over time. Government Education agencies could probably provide information about the number of women enrolled in design programs, and possibly the number of women teaching in design programs.\n\n"
    },
    {
      "time": "24 Aug 2007 — 12:00pm",
      "content": "Sibylle Hagmann (Cholla, etc.) article, “Non-existent design: women and the creation of type”  \nYou’ll need a subscription to Visual Communication Online to read it.  \n [http://vcj.sagepub.com/cgi/reprint/4/2/186?maxtoshow=&HITS=10&hits=10&RE](http://web.archive.org/web/20150417080326/http:/vcj.sagepub.com/cgi/reprint/4/2/186?maxtoshow=&HITS=10&hits=10&RE \"http://vcj.sagepub.com/cgi/reprint/4/2/186?maxtoshow=&HITS=10&hits=10&RE\")...\n\n"
    },
    {
      "time": "25 Aug 2007 — 10:19pm",
      "content": "It is a shame that there are not more women in type design. However, when one looks at the incoming MA Typeface Design students at Reading, the percentages are much closer to 50/50 than the industry in general.\n\nIn July I interviewed Carol Twombly for a presentation I was doing. I specifically asked her if she had encountered any gender bias while at Adobe, and she said that she certainly hadn't encountered any at all within the type group (and IIRC not much outside it).\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "26 Aug 2007 — 2:32am",
      "content": "Have you read Linda Nochlin's essay \"Why Have There Been No Great Women Artists?\" (I am sure it's on the interwebs...)\n\nIt is from the 70s, and in that sense is dated, but examines all the ingrained assumptions located in the question itself - why are there no great women artists - and posits that the wrong question is being asked.\n\nThe fact that Thomas is still asking Carol about her experiences as a women is a clue that we're not quite past it all (it happens frequently elsewhere, too). Is the real issue women in type design, or the overall lack of diversity in the field? Even this is problematic because the field is everyday growing more and more diverse as others have noted... there are more women in type design than ever before. Something to be excited about - but it seems to get lost in everyone moaning about the lack of women in type.\n\nLocating the question is both a part of the problem and the solution.\n\n(BTW, I am not trying to suggest you've come up with 'bad' questions, rather just thinking in general about how the subject of women in type design is too often approached in ways that reinforce rather than challenge dominant attitudes.)\n\n"
    },
    {
      "time": "26 Aug 2007 — 9:47am",
      "content": "_Milton Glaser wrote a piece for Design Observer last year about the relative lack of women in the upper echelons of design, which was quite striking given that in the lower and middle ranks of the industry, as well as in design school, women outnumber men._\n\nwhile milton might have observed the inbalance, it really shouldn't be all that surprising to him.\n\nwhen i was in design school in the early eighties, probably 70% of the students in graphic arts were male. by the time i graduated in 84, it seemed like the incoming classes were closer to 60-40.\n\nnow, as a professor myself, i think the break is more like 60-70% female to 40-30% male.\n\n"
    },
    {
      "time": "26 Aug 2007 — 10:29pm",
      "content": "I can speak up as a woman in design. In New York I owned my own typeshop. Very few women worked in typeshops, nevertheless own one.\n\nIt was always explained to me that because of \"hot metal\" days, galleys were just too heavy for women to pick up and move around the shop, and therefore were discouraged from working in typeshops.\n\nBut if you are speaking of design, woman have always been there. I think it just depends on which commercial entity for design we are talking about. Woman have been art directors in all the major publishing houses - some have even been presidents and ceos. BTW, who do you think design greeting cards?\n\nMaybe it is the same double standard, women do the work and want to be paid. They just don't go tooting their horns about it. They are there, but you have to find them -- they are the ones buried at the workplace, because, well, as every man knows, you want the job done, give it to the busy person - and yes, it's that poor, overworked woman.\n\n"
    },
    {
      "time": "26 Aug 2007 — 11:01pm",
      "content": "_now, as a professor myself, i think the break is more like 60-70% female to 40-30% male._\n\nAre the boys going into game design?\n\n"
    },
    {
      "time": "26 Aug 2007 — 11:03pm",
      "content": "I just attended TYPECON Seattle. I asked myself the same question when I attended the one critique session that happened there. There were 8 conference attendees signed up for it. They were all men with the exception of the last one, which was a woman, but who sent her work to be presented by a man because she couldn't attend the conference herself. She lives in Holland and was just starting to design typefaces. The 3 big-time-type-design professionals on the critique panel were also men.\n\nI was pretty surprised that there was not woman bringing some work of her own to show. It was great to see all the critiques, but it would be nice to have somebody of the same gender going up the podium to show some work. I could have been even more inspiring to me.\n\n"
    },
    {
      "time": "26 Aug 2007 — 11:29pm",
      "content": "<cite>while milton might have observed the inbalance, it really shouldn’t be all that surprising to him.</cite>\n\nI got the impression that he was not surprised at the imbalance so much as surprised that it has not changed much in the last few decades.\n\nI think that Ellen Lupton brought up some important gender-related stuff in her Typeradio interview when they were talking about her kids. It wasn’t so much a discussion of discrimination as it was about work/life balance, but it’s might be relevant to your research.\n\n"
    },
    {
      "time": "27 Aug 2007 — 1:39am",
      "content": "\"-Have you found that women are hidden away in production, or cluster in behind-the-scenes jobs?\"\n\nIt's a shame that there's not more documentation about the behind-the-scenes work that used to go on in the larger foundries, because certain areas of activity appear to have been completely dominated by women, even when men got the credit or managed the activity.\n\nI've been reading about the development of Times New Roman, for example, where credit generally goes to Stanley Morison for the idea and the art direction, and a production artist named Victor Lardent for the initial drawings. Different sources appear to agree that once the basic principles were established that all the real work of expanding the drawings into full fonts with different sizes and complete character sets were done by the drawing office. Every photo I've seen of the drawing office — including ones published at the time by Monotype — shows women doing the work. The little bit that I've looked at Linotype seems to show the same situation.\n\nI'm not surprised that people at the production level never get to share in the credit, but it's astounding that areas of the industry could be so dominated by women with so few — if any — of them going on to larger, more influential positions. It makes me wonder if overall diversity in the field has improved as the parts of the overall development process have become less segmented.\n\n"
    },
    {
      "time": "27 Aug 2007 — 11:07am",
      "content": "_Are the boys going into game design?_\n\nmaybe they're just playing video games...\n\n"
    },
    {
      "time": "27 Aug 2007 — 11:13am",
      "content": "_It makes me wonder if overall diversity in the field has improved as the parts of the overall development process have become less segmented._\n\nLindsay, the base of primary data on this doesn't exist, so to avoid the fate of \"pointing a feminist finger\" you will have to do your own research: survey all the foundries and get some statisitics. Otherwise, you're just going on guesswork, opinions and preconceptions. While you're at it, you could also gather information on age, ethnicity, religion, education, income, health, and sexual orientation, which would be useful to other researchers.\n\n"
    },
    {
      "time": "27 Aug 2007 — 12:16pm",
      "content": "in my own experience, i know many women who are art directors, vice-presidents and presidents and partners of large and small studios and firms.\n\n"
    },
    {
      "time": "28 Aug 2007 — 1:37am",
      "content": "Lindsay, you say you'll look for a biography of Carol Twombly. There isn't one. Very few type designers rate biographies and Carol isn't anywhere near getting one, though it would be interesting. I'd like to comment on Thomas's statement that he interviewed CT and she stated she had never suffered discrimination at the type group.\n\nCarol Twombly would sooner die than say she was discriminated against.\n\nNow read the recent thread, a few days ago, on design piracy when I reposted some interesting recollections of John Downer's about Carol Twombly and her role in the design of Trajan.\n\nShe's portrayed by Downer as a non-entity, a servant at the command of her art director. No male type designer would \\_ever\\_ be portrayed this way. Downer perfectly captures who Twombly was seen at Adobe, and it isn't a pretty picture. But nobody will directly utter the statement 'she/I was discriminated against on the basis of gender.\n\nCarol is the ideal victim for gender discrimination, because she is absolutely incapable of acknowledging it directly. She truly is the 'good girl of type', a role she played to perfection.\n\nYou'll learn about her not by asking questions like 'did you suffer gender discrimination' -- but by finding out what actually happened day by day in her career. Use what Strachey called the 'indirect approach' to biography and you could discover a lot of interesting things. If you can find out what people actually did, you'll get the picture.\n\nI talked to Carol on the phone almost every day from roughly 1997 to 1999 and there was hardly a day when there wasn't a struggle with Robert Slimbach and Fred Brady. Guess who always lost? I suspect some of those conversations were taped, a potential trove for a researcher. During the time that Carol was my art director, she was incapable of making a single decision for herself. She always had to bow to the opinions of Fred and Robert, or life would have been even more unbearable than it was. She was not allowed to do her job. It was inconceivable.\n\nYou could also learn a lot about gender discrimination at Adobe from E.M. Ginger in Oakland -- if she were willing to talk. Nobody is going to tell you the truth, however, if they still have any financial dependency on Adobe or any related company. That makes your work difficult but not impossible.\n\nTalk to the guys at Adobe. None of them will ever say they discriminated against Carol -- not in a million years. Then have them talk about her years there in detail, get the stories. You'll find she was treated like a gastropod, time after time after time. The discrimination is unconscious on the guys' parts, it seems to me -- automatic. I'd like to say it's Carol's fault, for never once protesting, never once losing her cool -- and it is. But that would just be blaming the victim.\n\nThere's a former PR employee who knows a lot of the narrative and who could tell it from a woman's point of view. I don't remember her name; I'll try to find it if you're interested.\n\nCarol's own impeccable demeanour is what makes her story interesting. She wears an armour of dignity that is impenetrable. No French nobleman ever went to the guillotine with a more authentic smile. It's difficult to think of anyone else who was as bland as she was heroic. I say this even though her invariable and gracious acceptance of the fate meted out to her cost me much.\n\n"
    },
    {
      "time": "28 Aug 2007 — 2:36am",
      "content": "Bill, I truly admire your loyalty to Carol and your impulse to tell 'her side of the story'. But, unless she has authorized you to speak for her, it's not yours to tell and has little meaning coming from you - it's just hearsay.\n\n"
    },
    {
      "time": "28 Aug 2007 — 5:50am",
      "content": "You're quite right, Nicole, to sense as I think you do that Carol would wince if she knew she was being discussed or should I say dissected in this way. Perhaps it is quite wrong of me to do it. But the party line makes my blood boil. When I hear the same old mendacious platitudes, I have to speak. She left Adobe, and type, because it was made unbearable and hateful for her, and I sometimes wish I had the courage to follow her example.\n\nDrama aside, the way in which the founding post on this thread was framed raises an interesting question: to what extent did CT suffer from gender discrimination, to what extent did she suffer because her male colleagues were dreadful people? What is the line that separates personal cussedness from plausible discrimination?\n\nI would suggest that Carol was a product of generation. If anything, she had the mindset of the generation before. It's difficult to imagine a 25 year old woman today accepting or even being offered the same kind of treatment.\n\nAvital Ronell suggests that we may finally have entered a time when we are 'Jenseits von Gut und Böse/Jenseits von Mann and Frau' -- that is, Nietzsche was worried about being beyond good and evil, Ronell is worried about being beyond man and woman, and suggests that the time may already have arrived. Gender politics moves quickly! At least I hope it does.\n\n"
    },
    {
      "time": "28 Aug 2007 — 1:02pm",
      "content": "An earlier poster mentioned that the famed 'drawing room girls' were all women. There being no verifiable author of Monotype Bembo (which really is as much an independent typeface of its time as it is an adaptation of Griffo's punches), I had what I thought was the shrewed suspicion that the girls had done it and nobody wanted to admit it. I haven't been able to find any real support for this. But David Saunders told me that if it was any one of them that he knew of, then it would be Dora \\_\\_\\_\\_ (I'm blanking out on her surname though I have notes of our conversations.) It would be very difficult to learn anything more, and it's probably just a feminist pipedream, but it did seem to me worth pursuing.\n\nOne thing to consider about Carol and type design: there are exceptionally few corporate type design jobs available. Carol wasn't replaced when she left. She must be one of the very few women in recent years who had the experience of being a typeface designer for a large corporation.\n\nCynthia Hollandsworth would be a great person to interview for experiences of a slightly earlier period. Doesn't Arthur Baker insist that all her ideas came from him? Typical!\n\nFor someone like Licko with her own company, one would assume that gender was as little of an issue as it could be.\n\nAnd what of Gudrun ZvH ? ? ? ? Such things one hears! Ma sotto voce!\n\n"
    },
    {
      "time": "28 Aug 2007 — 1:19pm",
      "content": "OK, here's another conspiracy theory, engendered by Sparky's remarks about Times. We all know how there is no theory of the authorship of Times that will hold water. This was true long before the outrageous fictions of the irrepressible Giampa. Suppose that ... it was the girls who did it? Who accomplished the miracle of transforming Lardent's interesting drawings into a very different, but real, type. (Lardent's font has been privately digitized by Matthew Carter; Jeff Level gave me a dinner invitation printed in it.) Suppose that nobody could bear to give the girls credit? Suppose there were a couple of them who really knew what they were doing, whose advice was taken by the boys? But it's just as possible they were obedient robots. If anyone could \\_possibly\\_ find out more about them, track down their spouses, their children, grandchildren, get hold of their correspondence -- then maybe we might just finally learn what really did happen. I was wrong to focus on Bembo. Times, as suggested, is a much better candidate.\n\nAnd by the way, how serious is this inquiry anyway? Serious enough to bother putting apostrophes into contractions where they are almost universally agreed to belong?\n\n"
    },
    {
      "time": "28 Aug 2007 — 3:44pm",
      "content": "Actually, everything I've been reading about the Monotype drawing office at the time makes me suspect it was \"the girls\" who did the bulk of the job of getting Times New Roman — and everything else that came out of the drawing office — to work. I think \"conspiracy\" is a strong word for it, and probably inaccurate. In fact, no one in the production chain ever seems to get mentioned, just the fact that every character's matrix went through about 80 stages of development and refinement. (One of the reasons Lardent got a nod even at the time was probably due in part to the fact that he worked for _The Times_, and was outside the Monotype pipeline.) Morison art directed, Lardent developed a set of drawings based on that direction, and an anonymous team over the course of a few decades developed that basic alphabet into a type family with thousands and thousands of characters. Judging from what I've seen and heard so far, most of those people were women, but it would probably take a close look at old Monotype payroll records to say for sure. And I bet it was the same at Linotype, and ATF, and other places.\n\nIt seems like it was the contribution of the production teams that was glossed over, more than the contribution of women as opposed to men. The better question may be why certain positions were traditionally women's work, and if there were any chances for any of those skilled women to move into other roles.\n\nIt's a thorny issue: at what point does someone in that industry stop being a production person and start being a designer? Are we quicker to consider someone a designer now that the process is less industrialized — less about the physical stuff and more about the intellectual property? There are so many layers to peel on this particular onion, and any institutionalized sexism is only one of them. As Nicole said earlier (and she and I have often discussed this year), it's hard to even figure out what the most useful questions are. It makes my head hurt.\n\n"
    },
    {
      "time": "28 Aug 2007 — 7:27pm",
      "content": "_Morison art directed,_\n\nOr, as he put it, \"excogitated\".\n\nBTW, two good books on commercial design history with chapters on the role of women:\n\nThe Origins of Graphic Design in America, Ellen Mazur Thomson  \nArtists, Advertising and the Borders of Art, Michele Bogart\n\n"
    },
    {
      "time": "29 Aug 2007 — 11:59am",
      "content": "Sparky, without knowing much more about it, I get the feeling that Benton did most of the work at ATF, and at Lino, you kind of get the feeling that G. Jones, Griffith, etc. were more in control than Morison ever was. Remember the story about Fournier going into production while 'the typographical advisor was absent' or something like that, and they didn't even use the right model. (You could read that two ways: the whole factory was hopeless without Morison's guidance; or that the factory didn't need Morison, since Fournier is incredibly well-implemented. The implication, to me, is that Morison could show the drawing office an historical print, and they could come up with a great, modern type, without him. (Fournier really, really, really is great in metal, just beautifully done, especially the gem-like smaller sizes; don't judge it by the pathetic digitization, but by old Penguins which use the smallest sizes.) The picture that's getting drawn here is that Morison was an incredible idea-man but that the actual work was done by either Pierpont or by the girls.\n\nI think Nick is extremely on target to focus on that word excogitate. It has always struck me as a weird usage, concealing something. It rankles. It's almost as if he's announcing, 'I'm going to tell a lie.' because there is no way that it can literally be true.\n\nLots of interesting inferences. How to prove them? If only a single one of the girls left behind a document ... is it even faintly possible that the MT archives might contain some sort of memo of working procedure that might reveal more?\n\nSpeaking of the archives, David Saunders noted that the drawings always were signed with the initials of the girl who drew them. He suggested that if Dora \\_\\_\\_'s initials were on the principal Bembo drawings, it would be an inference in favour of my theory, though not more.\n\nBy contrast, looking at the article on the making of Juliana at Linotype in the 1950s, the implication is that primarily Hartz and Tracy are concerned, nobody else seems to matter. Yet what if the better sizes (better, according to Hartz, perhaps because he had least to do with them) were primarily so because of the girls?\n\n"
    },
    {
      "time": "29 Aug 2007 — 12:08pm",
      "content": "One other thing re Times. Let's suppose that there were master drawings for it. But the different sizes in Times vary more widely from (let's say) the 12 point than any other 20th century typeface I can think of. Who did that?\n\nFinally: this is grim. I can't recall exactly how the conversation went, but I asked D. Saunders if the girls ever actually saw the type in use. He said (speaking of course from a later period -- did he start there in the mid-1950s?) that he didn't think it likely.\n\n"
    },
    {
      "time": "29 Aug 2007 — 1:09pm",
      "content": "And all of this corroborates my theorem that women could and should rule. If only they were as ruthless as men…\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "29 Aug 2007 — 1:20pm",
      "content": "Trust me, I'm not trying to defend Morison. Everything I've been reading seems to make it more and more obvious that he happily accepted a lot of credit for being the idea man, leaving the real work of figuring out the type to the Monotype staff. In this case, \"art director\" is at best a polite way of saying he didn't do the heavy lifting. But who were all those folks that did? That's what I wish I had more time to figure out.\n\nAs for Linotype, from what I've heard from Tracy's successor — a women, at least in the non-Latin office — it was ALL about the girls — no, the women — and their skill. I've been seeing those drawings all Summer, and they're breathtaking.\n\n"
    },
    {
      "time": "29 Aug 2007 — 1:58pm",
      "content": "In the interests of getting back to Lindsay's research and hopefully gathering together a little evidence to back up all the anecdotal stuff, I set up a Flickr pool about [Women in Type Design](http://web.archive.org/web/20150417080326/http:/www.flickr.com/groups/516762@N22/) to help make things a bit less abstract.\n\n"
    },
    {
      "time": "29 Aug 2007 — 4:26pm",
      "content": "<cite>I’ve been seeing those drawings all Summer, and they’re breathtaking.</cite>\n\nAre there attributions, signatures, or notes to go along with those drawings—or your photos—that shed more light on the women behind the fonts? And thanks for posting those photos, those are the first good visual evidence I’ve seen to support the notion of women doing so much and not getting the credit (at least in this field, anyway).\n\n"
    },
    {
      "time": "29 Aug 2007 — 4:59pm",
      "content": "I can't really give away anything about the non-Latin drawings right now. The Typography Department at Reading and the St. Bride Library are each mounting exhibitions of drawings and working documents, beginning during the [non-latin typeface design conference](http://web.archive.org/web/20150417080326/http:/stbride.org/events_education/events/non-latintypefacedesign) in September. I think there will be some sort of a catalogue put together of what's on display, hopefully in enough detail to see (or with accompanying info to explain) the assorted initials and signatures.\n\nI'm going to look at some old drawings of Times New Roman math stuff at Monotype soon, though, and it will be interesting to see what notation is on those.\n\n"
    },
    {
      "time": "30 Aug 2007 — 9:06am",
      "content": "\"Is gender no longer an issue, and we should be concentrating more on the individual instead of grouping them?\"\n\nI think this may be coming true today. There was a much more male dominated typography era when type was hot metal and set in an industrial environment. Today, It seems women can choose typography or type design as a field if they want to. There may not be a high number of women type designers out there yet but the high quality work that they produce easily makes up for the quantity.\n\nI should clarify that I am an oldfart 63 year-old white male (and one of those 8 guys who took part in the TypeCon Crit session). I have been a graphic designer for 45 years but only in the last 3 have I started designing type. There is no one to stop you from designing type in this internet world, buyers of type rarely check to see the gender of the designer or even care :-)\n\nChrisL\n\n"
    },
    {
      "time": "31 Aug 2007 — 8:16am",
      "content": "I'm reserving my comments on the rest of this discussion. But will say that my favorite type designed by a woman comes from Jill Bell. No one has mentioned Margo Chase either.\n\n"
    },
    {
      "time": "31 Aug 2007 — 10:13am",
      "content": "<cite>The Typography Department at Reading and the St. Bride Library are each mounting exhibitions of drawings and working documents, beginning during the non-latin typeface design conference in September.</cite>\n\nI so wish I had the connections to bring that exhibition over here.\n\n"
    },
    {
      "time": "1 Sep 2007 — 6:31am",
      "content": "Ilene Strizver was the Type Director at ITC for many years, and directed the development of a good portion of that library.\n\nJames\n\n"
    },
    {
      "time": "1 Sep 2007 — 11:37pm",
      "content": "I'm doing my MA Thesis (in Literature though) and currently writing a section that treats a very similar topic.\n\nTo a large extent, the questions asked can reveal your own intentions or presuppositions, and as many have noted, the answers might not always be honest for myriad (hrm, bad pun given the thread content so far) reasons.\n\nFor me, when I hear your questions, I think of early feminist literary theorists. Such critics aimed to identify female authors who were not in the canon and compile their works, etc, and look for the feminity within the works. At least within the case of the author I'm working with, many of these critics lost credibility when they began to assume that her works were left out of the canon because she was a woman, when a more likely (given the greater wealth of evidence) is that she was simply too vulgar for the Victorian age, which was the case for many other male authors as well.\n\nProbably one of the most helpful approaches I've found when I'm forced to ask questions like \"Is the female designer hidden away?\" is to reverse the gender, or even androgynise it: \"Is the male designer hidden away?\" or \"Is the designer hidden away?\"\n\nAnother question brought up by others is why the number of males in typography is / seems to be greater, or perhaps why there are now more women in such programmes than before? Is it because males have dropped out of the programmes, such as the trend seems to be in most liberal arts fields, or is it because of surge in interest by women, as the case would be within the sciences.\n\nUpon rereading what I've written it sounds almost like I'm discouraging your research, which I should make clear I'm not. If the questions haven't been asked, or there is still considerable disagreement as to some of the answers (as already seen in this thread), then the value of the research should be there. The most important thing is — and you already recognise it based on your first post —&nbsp;is to avoid coming off as a feminist or worse a feminazi. There are some critics (\\*coughVollendorfcough\\*) who I absolutely can't read because they're so slanted it's unbelievable that they're published. I actually have the opposite problem you do, I have to avoid sounding like a chauvinist masculinist in my analyses.\n\nAlthough primarily based for literature people, given the general confluence these days of all arts (textual, plastic, musical, graphic, etc.), a book that might be of good assistance is _Beginning Theory: An Introduction to Literary and Cultural Theory_ by Peter Barry. Google Books has a preview of it.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "2 Sep 2007 — 12:26am",
      "content": "\\> The most important thing is [...] to avoid coming off as a feminist or worse a feminazi.\n\nSo true, you wouldn't want her to sound as though she advocates women's rights on the grounds of political, social and economic equality to men (the definition of a feminist). That would be terrible.\n\n"
    },
    {
      "time": "2 Sep 2007 — 6:52am",
      "content": "\\> So true, you wouldn’t want her to sound as though she advocates women’s rights...\n\nThat's up to Lindsay. Does she want to be an advocate/feminist, or make objective observations?\n\n"
    },
    {
      "time": "2 Sep 2007 — 7:01am",
      "content": "The self fulfilling prophesy can be a tricky thing to deal with. Research should be as objective as possible. Let's let Lindsay have her chance at it.\n\nChrisL\n\n"
    },
    {
      "time": "2 Sep 2007 — 7:33am",
      "content": "You can be both an advocate and a good researcher, but it takes conscious effort.\n\nAll researchers have goals and biases. If they are good good researchers they are aware of their biases, and make and effort to prevent them from distorting their search for the facts, and their interpretation of their findings.\n\n"
    },
    {
      "time": "2 Sep 2007 — 8:41am",
      "content": "\\>\\> The most important thing is [...] to avoid coming off as a feminist or worse a feminazi.\n\nSo true, you wouldn’t want her to sound as though she advocates women’s rights on the grounds of political, social and economic equality to men (the definition of a feminist). That would be terrible.\\<\n\nThank you both for this gem. Matthew -- perfectly unconsciously I am sure -- says the most condescending thing I have heard all year; Nicole, in a gesture worthy of Carol, pins his ears back but in such a way that whoever wishes to mistake her meaning can joyfully do so. Was there ever a more exquisite illustration of the intractable problems that now exist between reasonably well-bred men and women?\n\n"
    },
    {
      "time": "2 Sep 2007 — 9:32pm",
      "content": "Billtroop, as Lindsay said, she does not want to point a feminist finger. It is extremely difficult to be both advocate and objective. In the interest of scholarly work, sometimes it is better to err on the side of cautious objectivity, because, unrestrained advocacy can at times outright offend a reader. It's incredibly difficult to read an article blaming men for all of the world's trouble that calls them all evil and holds women on a holy umblemished pedestal. Unfortunately, I have to read a lot of articles like that in my research, and admittingly, it is hard then for me to stay objective (it's an ugly cycle). It is far easier to read articles that describe clear and distinct evidence, even more so when evidence to the contrary is presented and synthesised well with the rest, and then give the reader the opportunity to fully evaluate it in light of the evidence. That is not to say that the author can not take a stand — quite the opposite, it is nearly impossible to publish with a \"well it could be this, or it could be that\" conclusion.\n\nThere is no problem with being an honest, grounded (post)feminist. However, the number of self-termed feminists that truly advocate equal treatment, rights, and responsabilities is small indeed (for example, I've never heard of any women advocating requiring women to sign up for \"selective\" service). Also, the views and approaches of feminists throughout the feminist movement, from protofeminism to early modern feminism to postfeminism, and from British to American to French feminism, have changed greatly. Most readers won't take the time (and I fully admit to being part of this group at times) to fine differentiate once they notice certain traits.\n\nThat said, I'm not sure Lindsay needs to take an advocate's stand. Between Chuck and Nick, it's been pretty well said already:  \n<cite>when i was in design school in the early eighties, probably 70% of the students in graphic arts were male. by the time i graduated in 84, it seemed like the incoming classes were closer to 60-40. now, as a professor myself, i think the break is more like 60-70% female to 40-30% male.</cite> (Chuck)  \n<cite>to avoid the fate of “pointing a feminist finger” you will have to do your own research: survey all the foundries and get some statisitics. Otherwise, you’re just going on guesswork, opinions and preconceptions. </cite> (Nick)\n\nThere is work that can be done, and if change has come or is already on its way, advocacy is not as needed. Linsday indicates she's a student, and if she can find and document information in an objective manner that would be of worth to future researchers, then she will undoubtedly produce an article (or monograph? Not sure how detailed she plans on going) that will be cited for years, which depending on her future aspirations, could be of immense usefullness to her personally.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "3 Sep 2007 — 5:39am",
      "content": "thank you all for the debate so far, if anything i feel encouraged that people at least want to talk about the subject\n\nWhen i undertook this subject - i was already grimacing at the fact i was another women researching into the discrimination of women. Therefore i am very wary of how i approach research. running alongside that i know that the subject of women is always going to be more interesting to a woman. Part of the reason i chose this was because i am a woman, embarking on a career in graphic design, weighted toward typography. and i want to see what im getting myself into...\n\n\\>(or monograph? Not sure how detailed she plans on going) \\<\n\nThis is my 3rd year dissertation (which on a design course means 6000 words...not much room for manouvre) and therefore it might be that i only scratch the surface and begin an argument that can be carried forth by others. At present with the mixed information and experience, i may not even be able to conclude my research.but i shall continue.\n\nsome other points ive been thinking about recently are as follows:\n\n- Is the design process asexual? is there a female way to design and a male way. could the wiring of a 'gendered' brain lead to a different methodology. what consequence could this have on the work produced? if different systems lead to the same quality and standard of work, does it matter?\n\n-what is the consequence of so few female role models? in the past obveously there were few - perhaps now there are more female designers but they shy away from publicity, keeping the amount of role models small. should women make more effort to stand out to encourage students and women considering the career? would this make an impact? and why would women shy away from publicity/media attention. is this inn there nature? or there bad experience of it..\n\ni have bought my ticket for the brighton ATYPI conference in september, and am looking foward to bringing up the subject in conversations. im hoping to get some more info on peoples experience. and start asking questions within institutions like ATYPI to see what they have to say. might even see some of you there!\n\nI also am hoping to talk to an old psychology lecturer of mine. By finding out some science about the differences between men and women, i can compare the hype and sterotypes. perhaps stereotypes had been created to keep ladies in their place, and have just lingered on. perhaps scientific results need to be openly discussed more to finish potential discrimination between men and women, and let everyone get on with making the best work they can.\n\nlindsayy\n\n"
    },
    {
      "time": "4 Sep 2007 — 2:58pm",
      "content": "Somewhat related - the original Mac manual made it clear that the Mac was for preppy white-guys. Was Apple following the typography stereotype or setting it?\n\n[http://www.peterme.com//?p=583](http://web.archive.org/web/20150417080326/http:/www.peterme.com/?p=583 \"http://www.peterme.com//?p=583\")\n\n"
    },
    {
      "time": "4 Sep 2007 — 9:47pm",
      "content": "lindsay-  \nwell, it sounds like you're hearing some feedback on your inquiry and getting some leads you might explore. while i'm an absolute fiend for type history -- and the 'backstory' here is really intriguing -- i'm wincing myself, just a bit.  \nyour own questions _(Is the design process asexual? is there a female way to design and a male way. could the wiring of a ’gendered’ brain lead to a different methodology...)_ are more interesting to me than a lot of the other information or reflection found in this thread.\n\n"
    },
    {
      "time": "5 Sep 2007 — 3:39am",
      "content": " **Guifa** : _is to avoid coming off as a feminist or worse a feminazi._\n\nA very funny line - but in typesetting there is no middle ground for females. When pushed into tight deadlines and very stressful situations you do what you can to get it done. When a man does this - it's good business. Yet, when a woman doing the same exact thing does this she is a \\*itch.\n\nTake it from one who had to take and give \\*itch lessons in Manhattan....\n\n"
    },
    {
      "time": "5 Sep 2007 — 10:41am",
      "content": "Jackie your comment is about as sexist as it gets. There is no sacred middle ground for men. Just like a woman could be considered a \"\\*itch,\" men are considered to be a \"\\*rick.\" Your comment makes it sound as though women are genetically incapable of ever acting like a \"\\*rick.\" I'll take a sexist direction to counter your claim. Men get called \"\\*\\*\\*hole\" to their face, yet women never get this for fear of hurting their feelings.\n\n"
    },
    {
      "time": "6 Sep 2007 — 3:36am",
      "content": "i am loving that manual. thanks for the link! and it does raise an interesting point. I wonder if there is a comparible 2007 version. maybe with a black woman in it?\n\nlindsayy\n\n"
    },
    {
      "time": "6 Sep 2007 — 8:23am",
      "content": "Jackie, my comment may have come across as rude but it wasn't meant to. All I can say is that I'm genetically predisposed to being a \\*rick.\n\nLindsay, I've held back on commenting in depth on the essence of your post because I don't want to divulge a lot of personal information. And I have so much personal experience on both sides of the argument that I didn't know where to start. Here goes a long comment anyway. (Why can't I focus on billable hours?)\n\nBecause there are always exceptions to nature, this is a generalization. Women and men are very different and have a very different approach to the same situations.\n\nMy experience started with a mom who got her Masters degree in the early '70s. She quickly became the boss of many men. By the time I was in high school she was the boss of dozens of men and women. She's not a tough woman — she's a tough person and mentally perhaps the strongest person I've ever known.\n\nThen I met my wife of 19 years. Saying she is a genius and the smartest person I've ever met is an understatement. It took me seven wonderful years of work, party and school to get a BFA. My wife graduated Summa Cum Laude with two science degrees in four years. She went on to absolutely ace her post-graduate degree. When it came time to put career paths on the shelf to focus on our children, we both did.\n\nMy wife convinced me that the assumed differences between men and women were bogus. Then we had twin girls. We decided that to avoid having them endure sexist discrimination we would give them gender neutral names. We did this and consciously avoided giving them any gender specific directions from the day they were born. There would be no pink stuff, no Barbie dolls, no fluffy girly things. We would let them gravitate toward their own natural path.\n\nThey are now ten years old. And those past ten years have been very educational about the true nature of girls and boys. It started soon. It became overt in the first days of kindergarten when they weren't really talking much, just slobbering and drooling on everything. One family didn't want their boy child to have gun toys. The first thing the boy did at kindergarten was assemble Legos into a gun and start shooting the other kids. That's just one example of hundreds. With deliberate effort by the adults to not shoe them into predisposed gender paths, they did it anyway.\n\nSo we now have one girl that will only wear skirts and prefers pink to any other color on the planet. And we know, accept and love the fact that girls and boys have wonderful differences — the yin for the yang. Stereotyping and systemic discrimination still occur, and will probably always occur, in both directions. But there are real and specific reasons men go into orthopedic surgery and women go into pediatrics. And in typography women and men will typically have different sensitivities to the same situations — of course that's a generalization though. I hope you keep plugging at documenting a worthy topic.\n\n"
    },
    {
      "time": "6 Sep 2007 — 9:27am",
      "content": "thank you for your post blue streak. I am incredibly interested in the forming of gender (unfortunetly the word count of my dissertation wont allow me to go into more depth on the subject).\n\nI read a recent article on house work, and the statistics still show that most chores around the house are done by women, even if both partners are in full time employment. This wasnt because cleaning and cooking were deemed as 'womens work' but more that women re-affirmed their femininity and therefore their own identity with such activity.\n\nto feel 'whole' lets say, people re-affirm their identity (including gender identity), and perceptions of what a woman is and should be largely come from the society we are brought up in. It seems to me that even if parents refrained from girl colours or girl toys, messages from other kids at school, tv, adult role models, are going to completely envelope a 'neutral' child.\n\nThat saying, psychological research into the differences between genders have suggested only a handful of actual differences, and insignificant ones at that. There is more indicative research to show that such a stereotype that men are better at driving - because they have better spacial awareness skills - is due to boys being encouraged to play with toy cars and building blocks - developing those spacial awareness skills whilst girls brush the hair of their dolls.\n\nIve spurted a lot there - and skated over detail. back to work\n\nLindsayy\n\n"
    },
    {
      "time": "6 Sep 2007 — 11:19am",
      "content": "_They are now ten years old._\n\nI wouldn't write off your experiment just yet.\n\n"
    },
    {
      "time": "6 Sep 2007 — 12:09pm",
      "content": "\\>insignificant ones at that\n\nI seriously doubt that. My children are 32, 30, and 25. --Boy, Girl, Girl.\n\nI have heard many parents comment on their surprise at how much of the child's personality is there from the beginning, and how the gender differences are also there and unmistakable. Neither of these facts is politically correct, but both are facts.\n\nMy impression is that differences between men's and women's ways of thinking are perhaps not so many, and in many areas where they are different, the differences may be profound but are subtle and hard to pin down. In some areas, such as the qualities they look for in a mate, the differences are more obvious. Also the differences are partly a matter of averages, similar to secondary physical differences such as height. Many women are taller than many men, but on average women are shorter than men.\n\nThat being said, I personally don't think the innate differences have much to do with type design. There are excellent women type designers, and I expect there will be more in the future.\n\n"
    },
    {
      "time": "6 Sep 2007 — 12:23pm",
      "content": "<cite>That saying, psychological research into the differences between genders have suggested only a handful of actual differences, and insignificant ones at that</cite>\n\nAn extremely important point. Part of the controversy of gender-innate-differences research comes in not so much the studies themselves, but the analysis thereof (generally by pop-science writers) who for example, might find that girls are on average scoring 10% higher on a Spanish exam, and interpreting it to mean that girls are that much smarter than men. Look at the results though and it might be that the guys scored 30, 40, 50, 60, 70, 80, and 90, and the girls got 40, 50, 60, 70, 80, 90, 100. The overlap of scores is so high that it makes the difference interesting, certainly, but not something to base, say, Spanish pedagogy techniques off of. (the study I'm thinking of in particular relates to hearing differences, but represents somewhat standard results)\n\nMark Liberman has compiled a large number of posts on The Language Log (a blog run by some of the top linguists in the US and abroad) on the topic, which may be of some use, [http://itre.cis.upenn.edu/~myl/languagelog/archives/003586.html](http://web.archive.org/web/20150417080326/http:/itre.cis.upenn.edu/~myl/languagelog/archives/003586.html \"http://itre.cis.upenn.edu/~myl/languagelog/archives/003586.html\")\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
