{
  "id": "36460",
  "title": "Lower case numbers in san serif anyone?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Do they exist?\n\n",
  "author": "<a href=\"/web/20100516055552/http://typophile.com/user/18759\" title=\"View user profile.\">zigavoo</a>",
  "time": "<br>",
  "uid": "18759",
  "comments": [
    {
      "time": "",
      "content": "See references to \"old-style figures\" in [this thread](http://web.archive.org/web/20100516055552/http:/www.typophile.com/node/653).\n\n"
    },
    {
      "time": "",
      "content": "At least Freight sans and Letter Gothic sans have them.\n\n"
    },
    {
      "time": "",
      "content": "[[text figures]]\n\n[What Sans Serifs Have Old Style Figures?](http://web.archive.org/web/20100516055552/http:/www.typophile.com/node/7718)\n\n"
    },
    {
      "time": "",
      "content": "Nearly every sans serif text typeface in the [FontFont](http://web.archive.org/web/20100516055552/http:/typophile.com/wiki/FontFont) library has lining and text figures included, with text figs as the default style. Many of these FontFonts are listed in the thread Paul linked, but [here's a handy search of FontShop.com with the figures from all the sans FFs displayed](http://web.archive.org/web/20100516055552/http:/www.fontshop.com/search/?q=FontFont+sans+-ot+-purchase&site=d&start=0&num=100&sample_text=0123456789&sample_size=48).\n\n"
    },
    {
      "time": "",
      "content": "To the best of my knowledge, the first sans with lower case numbers was Futura.\n\nThe first digitization was by Sacks and Quay, The Foundry Architype Renner.\n\nThe first modern sans serif superfamily was the seminal Today Sans Serif, Volker Küster for Scangraphic, 1987, with OSF, small caps, all f-ligs, all weights, two optical sizes, etc., and available from a number of distributors.\n\nMany poorly known but excellently implemented (by among others A-J Pool) URW sans serif families come with OSF and SC -- including News Gothic if memory serves. These are, again if memory serves, in the URW 'Design Collection', a relatively inexpensive collection of competent goodies.\n\nI imagine Font Bureau is a good source for sans serifs with osf.\n\n"
    }
  ]
}
