{
  "id": "36477",
  "title": "Do u Know a good Design/Art school???",
  "forum": "Design",
  "tags": [

  ],
  "content": "hey there,  \nso i’m putting this here(under design) thinking it’d get a more serious response.....\n\nim a graphic design student at National institute of design, Ahmedabad, India....desperately looking for exchange programs/ anything like them, to give me a few months’ experience, in design and art schools abroad...  \ncan’t have the medium of education anything other than english either....\n\nhelp..!...any information would be helpful...\n\nthx  \nvidit\n\n [‹ Underlining ordinals](http://web.archive.org/web/20081202201206/http:/www.typophile.com/node/36551 \"Go to previous forum topic\") [Jugendstil type ›](http://web.archive.org/web/20081202201206/http:/www.typophile.com/node/36450 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202201206/http://www.typophile.com/user/17333\" title=\"View user profile.\">vidi0t</a>",
  "time": "<br>",
  "uid": "17333",
  "comments": [
    {
      "time": " 25.Aug.2007 3.42am",
      "content": "Does NID have established, official exchange programs with any schools in English-speaking countries (they must have some already, right?)?\n\nFor all practical purposes, students are usually limited to exchange programs with official exchange partners. Otherwise, you have to convince a school in a foreign country to take you on for a semester or year on your own merits, and you may have to pay their full tuition fees as well, which (in the UK and especially in the US) can quickly become extraordinary expensive.\n\nPresuming that NID already has established partners, why don’t you post the names of those partners here? Mostly, someone on Typophile will have direct (or at least second-hand) experience with the school(s), and can offer you specific feedback.\n\n"
    },
    {
      "time": " 25.Aug.2007 3.53am",
      "content": "Even though I had never seen or heard anything about it prior to this past school year, SVA always has third year exchange students. I don’t know that they’re actually exchanged, but we certainly take a lot of foreigners for a semester at a time. In the past year I’ve seen Israelis, Norwegians and French exchange students, for whatever it’s worth I don’t see why India would be excluded, although dan\\_reynolds is right. It may require a little investigation...\n\n"
    },
    {
      "time": " 25.Aug.2007 4.16am",
      "content": "Julia, I don’t mean to imply that SVA (or any other school) would exclude students from India (or any other country…). What I mean that, especially in the US, most design schools have an “official list” of schools that they partner with. If you aren’t in one of those schools, you can petition both schools to start a new exchange program, or you can try to go as not part of any program at all. Both options are hard.\n\nTo date, I’ve studied at three design schools in two countries… one of those experiences was as a “semester abroad.” All three schools only really took students from official partner schools. At least, unless you wanted to pay full price…\n\n"
    },
    {
      "time": " 25.Aug.2007 4.46am",
      "content": "Yeah, I think Dan is right. At least my school has such a partner list.\n\n"
    },
    {
      "time": " 25.Aug.2007 7.47am",
      "content": "I’m located in Finland and all schools here have these lists as well. If the school you’re applying to don’t have an agreement with your school you’ll most likely have to pay tuition fees (and they can be VERY high, specially in the UK).\n\n"
    },
    {
      "time": " 25.Aug.2007 8.56am",
      "content": "dan, I wasn’t disagreeing with you, I was just saying that SVA seems to be on multiple lists, and possibly one of NID’s...\n\n"
    },
    {
      "time": " 26.Aug.2007 5.55am",
      "content": "yeah.....  \ncolleges like ENSAD(paris) have these exchange programs with our college but since that would secure 2 odd students, the rest go about looking for other colleges.....  \nofficial exchange programs have an MOU signed with NID so only the cream of the lot is sent.....(which does not include me)\n\ni had a senior spend a semester at MICA, Baltimore....from what she told me, if you request them, your tuition fee is waived...\n\nso right now i wanted to figure what colleges would be willing to do such a thing....\n\nand thanks a lot everyone for these inputs.....keep them coming!\n\n"
    },
    {
      "time": " 26.Aug.2007 11.48pm",
      "content": "I’m from Baltimore originally. The graphic design program at MICA seems to be coming along, from what I hear. When I started studying, I did not go to MICA because they didn’t have a graphic design major there yet. MICA is a real art school, i.e., most of the students stidy various fine art disciplines, not things like graphic design. This has its ups and downs. But if you can get to MICA easily, I say go for it.\n\n"
    },
    {
      "time": " 27.Aug.2007 5.59am",
      "content": "Have you looked at SCAD lately?  \nSavannah College of Art & Design\n\nThey have in the past worked with exchange students. The college is excellent, the teachers enthusiastic, the student body - great. They live what they teach, and that is to recycle and grow. They own more buildings than any other art college in the U.S.A. It is an “urban” school - but what an adorable community...  \n [http://www.scad.edu/](http://web.archive.org/web/20081202201206/http:/www.scad.edu/ \"http://www.scad.edu/\")\n\n\\*\\*\\*\\*\\*\\*\\*\n\nBut first choice for me would have been RISD (if I were still young and could take the winter months) [http://www.risd.edu/](http://web.archive.org/web/20081202201206/http:/www.risd.edu/ \"http://www.risd.edu/\")\n\n\\*\\*\\*\\*\\*\\*\\*\n\nWhy not buy a book on the different Universities and see which one is up to your standards and can meet your goals. Then report back and see what the folks who attended them say. They may offer new insight to you.\n\nWas there any one in particular you were interested in?\n\n"
    },
    {
      "time": " 27.Aug.2007 6.05am",
      "content": "I went to RISD, and I loved it.\n\nAfterwards, when I was studying further in Germany, a friend of mine from Germany wanted to study abraod at RISD for a year. But they turned him down, because our German school was not one of RISD’s official partner schools. They said he could come as a guest student, and pay full tuition.\n\nInstead, he went to MassArt, which was a partner school of the German school in question, and even he got a full Fullbright Scholarship to pay for all living expenses! He had a great year, of course.\n\n"
    },
    {
      "time": " 27.Aug.2007 7.49am",
      "content": "Were you aiming for a specific region? Most parts of the country have a handful of quality art/design schools/programs (along with a whole heap of really bad ones).\n\nIf you’re aiming for a specific area, let us know and we can help narrow it down for you.\n\n"
    }
  ]
}
