{
  "id": "36478",
  "title": "La historia de la tipografía es la historia del fraude",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "For those, who can read Spanish, here is a website from Spain called \"cuatrotipos.wordpress\"\n\n[http://cuatrotipos.wordpress.com/2007/08/21/de-century-a-valencia-una-pe...](http://web.archive.org/web/20150123082433/http:/cuatrotipos.wordpress.com/2007/08/21/de-century-a-valencia-una-pequena-historia-sobre-el-fraude-tipografico/ \"http://cuatrotipos.wordpress.com/2007/08/21/de-century-a-valencia-una-pequena-historia-sobre-el-fraude-tipografico/\")\n\ndiscussing forgeries and drawing heavily from my own site. Even the slogan\n\n<cite>La historia de la tipografía es la historia del fraude</cite>  \n(The history of typography is the history of fraud)\n\nwas drawn from my site by replacing a word in my slogan.  \n(I said: <cite>\"The history of typefaces is the history of forgeries\"</cite>)\n\n",
  "author": "Uli",
  "time": "25 Aug 2007 — 4:02am",
  "uid": "11274",
  "comments": [
    {
      "time": "25 Aug 2007 — 2:35pm",
      "content": "The history of websites about the history of types is the history of forgeries.\n\n"
    },
    {
      "time": "26 Aug 2007 — 4:09am",
      "content": "<cite>The history of websites about the history of types is the history of forgeries</cite>\n\nThere is a grain of truth is your ironical statement:\n\nHerminio Javier Fernández, a professor of design at the university of Valencia, who wrote the above-mentioned \"cuatrotipos\" article, made a mistake by not digging deep enough:\n\nOn comparing \"Century Expanded\" (1900) and \"Amts-Antiqua\" (1909), Prof. Fernández came to the correct conclusion:\n\n<cite>\"... pero la realidad está ahí: Century y Amts Antiqua eran al 99% iguales\"<br>\n(\"but the reality is: Century and Amts-Antiqua are 99% per cent identical\")</cite>.\n\nBut thereafter, due the fact that \"Century Expanded\" is older by 9 years, Prof. Fernández came to the logical, but in fact incorrect conclusion that \"Century Expanded\" is the \"original\" font.\n\nRecently, my sister gave me as a gift a very old book on Latin Synonymics, which was published in 1840 in Leipzig. While leafing through this old book printed on deckle-edge paper, it suddenly struck me, and after systematic checking of all roman and italic letters, I was convinced that this 1840 book was typeset using a foundry type, which was (using the words of Prof. Fernández) <cite>\"99% per cent identical\"</cite> with \"Century Expanded\" (attributed to Benton) alias \"Amts-Antiqua\" (attributed to Hoffmeister and later renamed by Stempel to \"Madison\") alias \"Century 725\" (Bitstream forgery) alias \"Madame\" (Scangraphic forgery) alias \"Valencia\" (Brendel forgery), etc. etc. etc.\n\nAfter checking the birth dates\n\n- Linn Boyd Benton, born 1844  \n- Morris Fuller Benton, born 1872  \n- Heinrich Hoffmeister, born 1857\n\nis was evident that none of these persons could have made a foundry type which was used in 1840 for typesetting the old book mentioned above. Therefore \"Century Expanded\" and \"Amts-Antiqua\" are forgeries too. Before the year 1840 (terminus ante quem), an anonymous punch cutter made regular, italic and bold cuts of a hand-composition typeface, which decades later was cloned by Benton and Hoffmeister.\n\nA major obstacle in discovering \"who forged what?\" is wrong information supplied by font forging outfits. For instance, the old Stempel font books do not disclose that \"Amts-Antiqua\" is a non-original font. And modern font books, e.g. the Font Books published by Font Shop, also conceal this fact.\n\nIn the 1998 Font Book, at least the name \"Hoffmeister\" was mentioned in connection with \"Madison\":\n\n[http://www.sanskritweb.net/temporary/fontbook1998.gif](http://web.archive.org/web/20150123082433/http:/www.sanskritweb.net/temporary/fontbook1998.gif \"http://www.sanskritweb.net/temporary/fontbook1998.gif\")\n\nBut in the 2006 Font Book, Stephen Coles, responsible for \"cross references\", removed the font \"Madison\" and replaced it by the Scangraphic forgery \"Madame\" and removed the reference to \"Hoffmeister\" so that dim-witted font buyers are at a loss to recognize that \"Madame\" is a forgery:\n\n[http://www.sanskritweb.net/temporary/fontbook2006.gif](http://web.archive.org/web/20150123082433/http:/www.sanskritweb.net/temporary/fontbook2006.gif \"http://www.sanskritweb.net/temporary/fontbook2006.gif\")\n\nOf course, Font Shop desiring to make money by selling such forgeries has to conceal such information, or else even dim-wits would begin to think twice before they would buy a font labeled as a forgery in the Font Book.\n\n"
    },
    {
      "time": "26 Aug 2007 — 7:03am",
      "content": "Uli, you are using the incorrect term \"forgery\" instead of \"plagiarism\".\n\nPlagiarism: I steal someone else's type design and claim it as my own work.  \nForgery: I design a typeface and claim that it is someone else's work.\n\nThe only digital-era font forgery I am aware of was a (tongue-in-cheek) hoax: House Industry's \"Chalet\".\n\nWith regards to plagiarism, the norm in type design is a variant of this concept --redesign.\n\nRedesign: I take someone else's typeface, modify it, claim at least that much as my own work, AND credit the original designer.\n\nThis kind of \"revival\" is considered homage not plagiarism, because the source is acknowledged, and, although copyright doesn't exist on typeface designs, nonetheless enough time has passed\\* that were the type design a painting or a novel, it would be in the public domain.\n\nThe real bone of contention is, as it should be, redesigns of recent typefaces, i.e. rip-offs.\n\n(Piracy is generally understood to mean illegal copying of software files.)\n\n\\*St Clair, in \"The Reading Public in the Romantic Period\" notes the effect of different lengths of copyright protection on literary production, and comes to the conclusion that there is an optimum duration (around 25 years), which protects the author's investment in a work, while thereafter allowing accessiblility to copyright-expired works to stimulate the culture and the economy.\n\n"
    },
    {
      "time": "26 Aug 2007 — 9:16am",
      "content": "Nick, since laws are different in different countries, it is almost impossible to coin a term that might fit for most countries. At the Typophile website, besides undefined colloquial words such as \"rip-off, knock-off, clone, etc.\", I often see that words are used which directly denote criminal acts in many countries, e.g. \"theft\" (He has \"stolen\" my font), \"fraud\", \"piracy\", etc.\n\nWhile \"theft\" and \"fraud\" are crimes, the word I selected, namely \"font forgery\", is NOT a crime AS SUCH in the countries, whose laws are known to me. Hence, the term \"font forgery\" is a much milder term than such criminal law terms as e.g. \"font theft\", \"font fraud\", \"font piracy\", etc.\n\nWhile the forgery of banknotes and of deeds and similar documents are crimes, the forgery of fonts and of paintings etc. AS SUCH are no crimes, because the criminal codes (of the countries which I know) do NOT define \"font forgery\", \"painting forgery\", etc. as crimes (\"Nullum crimen sine lege\").\n\nBut of course, a font forgery may be instrumental of a crime, for instance if a fraud is committed concerning a font forgery. But the font forgery as such is not a fraud.\n\nI avoid the terms \"piracy\" and \"plagiarism\", because they are (in most countries) related to the copyright law. Since in most countries fonts are not copyrightable, the terms \"piracy\" and \"plagiarism\" are nonsensical in such countries.\n\nBill Troop said that my term font forgery is \"loaded\", but in fact, my term is less \"loaded\" than the criminal law terms \"theft\", \"fraud\", \"piracy\" etc., which are used so often here at Typophile.\n\nProf. Fernández used the term \"fraude tipográfico\" (= typographical fraud), as if he were speaking of criminal acts. But a font forgery AS SUCH is not a crime in Spain, as far as I know.\n\n\\> Forgery: I design a typeface and claim that it is someone else’s work.\n\nI do not know, where you got this definition from.\n\n"
    },
    {
      "time": "26 Aug 2007 — 9:53am",
      "content": "Concise Oxford Dictionary:\n\n\"Forge. 1. a. make (money etc.) in fraudulent imitation. b. write (a document or signature) in order to pass it off as written by another.\"\n\n"
    },
    {
      "time": "26 Aug 2007 — 10:32am",
      "content": "My own definition of \"font forgery\" is given in my 3-year-old very first document, which started my series of documentations about this industry:\n\n[http://www.sanskritweb.net/forgers/forgers.pdf](http://web.archive.org/web/20150123082433/http:/www.sanskritweb.net/forgers/forgers.pdf \"http://www.sanskritweb.net/forgers/forgers.pdf\")\n\nThe fictitious \"Shakespeare\" forgery example on page 8 of this document may also elucidate my definition.\n\nThe test purchase of \"Basic Commercial\" 3 years ago was my first and my last. When I opened the font file with a font editor, I read this notice:\n\n<cite>\"This typeface is original artwork of Morris Fuller Benton. The design may be protected in certain jurisdictions.\"</cite>\n\nWow, I thought, this bizarre and presumably mentally deranged font forger must be a really funny guy. Hence I called this industry the \"funny\" font forging industry.\n\n"
    },
    {
      "time": "26 Aug 2007 — 11:04am",
      "content": "Messers. Shinn and Berkson, my proverbial hat is off to both of you for trying to set Ulrich straight. I almost posted the Merriam-Webster definition of the verb \"forge\" last night, but then thought better of it -- it is very hard to have an exchange of opinions with a brick wall.\n\n"
    },
    {
      "time": "26 Aug 2007 — 12:49pm",
      "content": "Uli, you may find the \"font forging industry\" funny, but very few people in it take you seriously, because of your nonsensical use of the word \"forgery\", which undermines the arguments you are making.\n\n\"Plagiarization\" is a perfectly good word to describe what you are talking about. You could even consider introducing the word \"plagiat\" into English usage.\n\n"
    },
    {
      "time": "26 Aug 2007 — 1:20pm",
      "content": "\\> “Plagiarization” is a perfectly good word\n\nNick, a short question: In which American law are the words \"plagiarization\", \"plagiarism\" or similar used?\n\n"
    },
    {
      "time": "26 Aug 2007 — 6:42pm",
      "content": "What has the law got to do with it?  \nPlagiarization (or, as you term it \"font forgery\") of type designs is legal, because they don't have copyright protection.\n\nThe only protection type designers have is the court of professional opinion.\n\n"
    },
    {
      "time": "26 Aug 2007 — 11:26pm",
      "content": "<cite><strong>Plagiarism</strong>: I <strong>steal</strong> someone else’s type design and claim it as my own work.</cite>\n\n<cite>What has the <strong>law</strong> got to do with it? <strong>Plagiarization</strong> (or, as you term it “font forgery”) of type designs is <strong>legal</strong>, because they don’t have copyright protection.</cite>\n\nNick, when you want to say that something has got to do or has not got to do with the law or when you want to say that something is legal or not legal, you have to use the legal notions (words, terms, expressions) used in the law, not non-legal notions. The non-legal notions \"plagiarism\" and \"plagiarization\" are not known in the US Copyright Act nor in the UK Copyright Act, nor as \"Plagiat\" in the German laws. Hence I cannot use these **non-legal notions** , when writing documentations for legal authorities, as it is done at my website.\n\nOn the other hand, you must not use **legal notions** of crimes, unless you are speaking of crimes. For instance, you are speaking of the crime of \"stealing\" (= theft) in connection with plagiarism (<cite>\"I steal someone else's type design...\"</cite>), but a few sentences later, you declare that plagiarization is legal. This is both illogical and not permitted by law. You cannot accuse someone of having committed the crime of theft, if you think that what he did was legal.\n\nThe Typophile website often uses the notions \"steal\" and \"theft\", see e.g.:\n\n[http://dev.typophile.com/node/33080](http://web.archive.org/web/20150123082433/http:/dev.typophile.com/node/33080 \"http://dev.typophile.com/node/33080\")  \n(\"The best way to design - steal\")\n\n[http://www.typophile.com/node/15351](http://web.archive.org/web/20150123082433/http:/www.typophile.com/node/15351 \"http://www.typophile.com/node/15351\")  \n(\"Site design by theft\")\n\nIf \"plagiarism\" were a legal notion, I could use it at my website, but since it is not a legal notion, I have to avoid to use this non-legal notion.\n\n"
    },
    {
      "time": "27 Aug 2007 — 12:19am",
      "content": "Mr. Berkson:\n\n<cite>“Forge. 1. a. make (money etc.) in fraudulent imitation.\"</cite>\n\nMy own definition differs only slightly from the above definition. I would define: \"to forge fonts = to copy fonts with intent to deceive\". I prefer the notion of deception to the notion of fraud, because a font forgery and a deception AS SUCH (Latin: per se) is not (or not yet) a fraud. However, it may easily happen that the crime of fraud is committed in this connection.\n\nExample: During the years 2003 through late 2004 (until Bruno Steinert read my document forgers.pdf), Linotype offered the font forgery \"Basic Commercial\" at its website with the false statement that this font was designed by Morris Fuller Benton. For those non-dimwitted non-font-buyers who know that Linotype is telling lies at its website, no fraud could happen, but for those dimwitted font buyers, who bought this font forgery believing in the above false statement, the legal situation was different.\n\n"
    },
    {
      "time": "27 Aug 2007 — 5:03am",
      "content": "Hello Uli:\n\nI see that the conversation has derived in an interesting terminological discussion.\n\nI don't want to interrupt it. But I just wanted to make three precisions, since my post in Cuatrotipos.com was the one that triggered this release:\n\n1) My English is not very fluid,(as you can read :-)), but I understand that when you say “discussing forgeries and drawing heavily from my own site.” You are giving to understand, that I take control of your knowledge to do it mine.\n\nNevertheless, in my post I recognize clearly your contribution, I mention your complete name and I link your Web two times. And not secretly, but in a quite extensive paragraph:\n\n“Ulrich Stiehl, maintains an controversial page Web, almost everything written in German, but that accumulates an abundant documentation on the industry of the fraud in the typography, mainly of these omnipresent collections of CDs with thousands of typographies with ridiculous prices. Also he gathers some recent issues like the one of the company of transport UPS that created UPS Sans like corporative typography in 2006, to save itself to pay the license by the massive use of FF Dax, designed in 1995 by Hans Reichel.”\n\nAnd I finished the articles mentioning two “preferential sources” in order to the readers link for further own investigation. The first, obviously, it is your web.\n\nCuatrotipos is a little blog on journalistic design, in which we tried to discover to the friends interesting anecdotes and resources on design. I like to write clearly from where my information come direct or indirectly. Really I didn't do the post for “adapting to me” your work, but to present it to the Spanish-speaking readers, and I tried to leave it at any moment well clear.\n\nIn that post I \"draw heavily\" in several web pages, and of course, I \"link heavily\" to the originals. As a journalist I understand that the value of my affirmations is in the value of my sources.\n\n2) It seems that you have understood that there was also an intentional appropiation of your “slogan\". I have put your name alongside to him, and I link to your web by third time in the post.\n\n(The title of the post does not have that meaning: Is \"From Century to Valencia: a little tale about typographic fraud” Because we use the same word \"Historia\" in Spanish for History and Story or Tale)\n\n3) As the title of post says, my only intention is to write the anecdote of how the city where I live, Valencia, has a typeface with its name. But unfortunately it isn't original, and it had not any reference to the town: in fact it is the changed name that Brendel emploied for avoiding to pay the license for a type that belonged legally to Stempel (and whose name Stempel had previously changed three times before, but the reference to its original author,Hoffmeister, was not lost with it).  \nAfter that, to find the similarities between Amts Antiqua and Century is not complicated, although at no moment I describe it as “forgery”, but as “excess of fervor in the inspiration”.\n\nI do not have as much typographic knowledge like the other members of this discussion.  \nI am just newspaper designer and professor of newspaper design. So I had not any reference about tha Linn Boyd Benton's Century (whose first version starts in 1894), were a copy of another previous typography. Obviously, it's not an isolated creation: it is a evolution of the modern Romans and with clear references to the Scotch Types of 1830s, but its x-height and his little modulation, are understood generally (between the non expert ones like me), as original contributions for legibility that created a trend.\n\nI suppose that I would have to create a new conversation on the matter, but I would like to see examples of those types of 1840 with as much similarity (99%!) with Century, tha deserve to be described as a \"copy\" . It is the first news that I have about that and it seems to me a very interesting reference.\n\n"
    },
    {
      "time": "27 Aug 2007 — 8:08am",
      "content": "I am pleased, Prof. Fernández, that you contribute to the discussion here.\n\nYou should not have written your lenghtly explanation, why you have \"drawn heavily\" on my site, because this did not annoy me at all. I was only surprised that you translated my expression \"forgery\" by the Spanish word \"fraude\". Since I did not learn Spanish, I contacted an email correspondent of mine from Spain, who is a linguist and who was kind enough to make for me a translation of your complete text at your website. She told me that \"fraude\" is \"a very strong word\" used in Spanish in conjunction with business crimes, e.g. in the stock market, similar to English \"fraud and embezzlement\".\n\nAs regards the old synonymics book, which I mentioned, it is difficult to make scans, and moreover, I do not think that anyone wants to make researches in this direction. Nevertheless, if someone wants to make studies concerning the typeface used in this old book of 1940, I herewith reference to the complete bibliographical data, so that the book may be bought or borrowed from a library:\n\n[http://www.bookshopinc.com/cgi-bin/bsp455/165734.html](http://web.archive.org/web/20150123082433/http:/www.bookshopinc.com/cgi-bin/bsp455/165734.html \"http://www.bookshopinc.com/cgi-bin/bsp455/165734.html\")\n\nAs your intention was to write an anecdote about how your hometown Valencia has a typeface with its name, which is a \"fraude tipográfico\", it will be of interest for you to learn that \"Valencia\" was not the only font forgery sold under the name \"Valencia\". The American font forging outfit Atech published a font forgery of the font \"Barcelona\" (by Ed Benguiat in 1981) under the name \"Valencia TA\". The suffix \"TA\" was an abbreviation for \"Type-O-Thek Allfonts\".\n\n"
    },
    {
      "time": "27 Aug 2007 — 11:39am",
      "content": "_Hence I cannot use these non-legal notions, when writing documentations for legal authorities, as it is done at my website._\n\nBut if you have to modify the meaning of the word \"forgery\" for these brilliant legal minds, so that for application to the matter of fonts it differs from the dictionary definition and the common understanding, what's the difference? Why not modify the meaning of the word \"plagiarism\" to have a special font-centric meaning?\n\nAnd why bother posting to Typophile, where most of the readers are non-legal and therefore dim-witted enough to expect the meaning of words to correspond to general usage, and the dictionary?\n\n"
    },
    {
      "time": "27 Aug 2007 — 1:04pm",
      "content": "\\> word “plagiarism”\n\nIf my own website were designed for Americans only, I should use the word \"plagiarism\". But a quick check reveals that this word is not most common at Typophile. In search mode ( [http://typophile.com/search/node](http://web.archive.org/web/20150123082433/http:/typophile.com/search/node \"http://typophile.com/search/node\")) I count:\n\nplagiarism: 12 threads (wherein this word occurs at least once)\n\n(Note: The verb plagiarize, in all forms, is not used at all.)\n\nknockoff: 28 threads (various spellings: \"knock off\", \"knock-off\", etc.)\n\nripoff: 24 threads (various spellings)\n\ntheft: 16 threads (+ thief: 6 threads)  \nsteal: 29 threads (+ steals: 2 threads)  \nstolen: 16 threads (+ stole: 17 threads)  \nstealing: 34 threads\n\nSo, theft/steal is most common at Typophile, followed by knockoff and ripoff.\n\n"
    },
    {
      "time": "27 Aug 2007 — 3:33pm",
      "content": "_And why bother posting to Typophile, where most of the readers are non-legal and therefore dim-witted enough to expect the meaning of words to correspond to general usage, and the dictionary?_\n\nNick, I love your reasoning and arguments! [Comment deleted by author.]\n\n"
    },
    {
      "time": "27 Aug 2007 — 1:50pm",
      "content": "Uli, it's not about \"Americans\" -- the salient point is that Typophile is in English, and most people post in English, including you and I, neither of whom are Americans. (Admitted, I do spell plagiarize with a \"z\" not an \"s\", a deviation from my British roots.)\n\nAlthough \"plagiarism\" is less used here than \"knock-off,\" it's slightly less inflamatory, which is why I prefer it.  \nThe use of knockoff and ripoff imply intent, but the lack of acknowledgment inherent in the meaning of \"plagiarism\" may also apply to the plagiarizer, who may simply be unaware of originality problems, and thinks the degree of derivation is acceptable.\n\nFor instance, there is a big difference between tracing over someone else's design, and creating a design from nothing which ends up looking a bit like someone else's. But this subtle distinction, which is very important to type design, is not captured in any word, or phrase, even \"unintentional plagiarism\". What we need to be aware of, as type design professionals, is that even with the best intentions, one of our designs may resemble a recent and well-known effort of someone else's, and that is not acceptable unless the face in question is an old classic such as Century.\n\n"
    },
    {
      "time": "27 Aug 2007 — 2:09pm",
      "content": "Uli, you will note also that nobody except you uses the word 'forgery' for improper copying of type designs. That is because,as Nick pointed out, the term is almost always used in the context of a criminal act of fraudulently creating a fake--painting, signature, etc.--to pass off as genuine.\n\nThe question of whether one design is too close to another--like whether one tune is too close to another--has a gray area, where it is often difficult to determine. The existence of a large gray area may be why there is no one really good term for improper copying vs appropriate influence.\n\nHere on Typophile you have been treating the issue of inappropriate copying as a completely black-and-white issue, which to me, and it seems a lot of others, indicates that you fundamentally misunderstand it.\n\nThe history of type is full of copying of all sorts, so if you want to get it right you need to be clear that some is clearly OK, some is clearly not, and there is a lot where it is difficult to say.\n\n"
    },
    {
      "time": "27 Aug 2007 — 2:26pm",
      "content": "Uli, I hope you accept my criticism as constructive, and keep banging away.  \nIn my opinion there is not enough originality in the type design industry, and derivative work gets way too much respect.  \nHelvetica, a plagiarization, is the best-selling, best-known, most used typeface. Sad.\n\n"
    },
    {
      "time": "27 Aug 2007 — 3:05pm",
      "content": "\\>Helvetica, a plagiarization\n\nHelvetica was a modernization of typefaces from 60 years earlier, Akzidenz Grotesk, Breite Grotesk no? And being called initially Neue Haas Grotesk, it clearly referenced earlier typefaces. And it changed the old faces carrying through a consistent new design idea. I can't see anything improper in that.\n\nIf you don't like faces that openly adapt earlier work, you are entitled to your tastes. But to call them plagiarism seems to me quite inappropriate. Would you call your own revivals plagiarism? I wouldn't. How are their relations to past type faces different from Helvetica?\n\n"
    },
    {
      "time": "27 Aug 2007 — 3:15pm",
      "content": "1)  \n\\> Uli, I hope you accept my criticism as constructive\n\nI do, Nick.\n\n2)  \n\\> Uli, you will note also that nobody except you uses the word ’forgery’\n\nMr. Bergson, it might be helpful to consider, how the word is used in other languages, e.g. when German laws are translated into English.\n\nLook, for example, at the Joyce Hatto case:\n\nIn the **USA** , it is called a **\"plagiarism case\"** , see e.g. here\n\n[http://www.boston.com/news/globe/living/articles/2007/02/23/alleged\\_hatt...](http://web.archive.org/web/20150123082433/http:/www.boston.com/news/globe/living/articles/2007/02/23/alleged_hatto_plagiarism_shakes_music_world \"http://www.boston.com/news/globe/living/articles/2007/02/23/alleged\\_hatto\\_plagiarism\\_shakes\\_music\\_world\")\n\nIn **Germany** , it is called a **\"forgery case\"** (Fälschung), see. e.g. here\n\n[http://www.spiegel.de/kultur/musik/0,1518,468799,00.html](http://web.archive.org/web/20150123082433/http:/www.spiegel.de/kultur/musik/0,1518,468799,00.html \"http://www.spiegel.de/kultur/musik/0,1518,468799,00.html\")\n\nIn my fifty/fifty German/English website, I use \"Fälschung\" = \"forgery\", which is exactly what you find in a German-English dictionary.\n\n"
    },
    {
      "time": "27 Aug 2007 — 4:57pm",
      "content": "_But to call them plagiarism seems to me quite inappropriate._\n\nCheck Linotype's site. There is no mention of the derivation of Helvetica from AG, which was shown in the Helvetica documentary (so I've heard -- I haven't seen the film). So by adapting AG, and not acknowledging it, that's plagiarization.\n\nHelvetica is a revival, but Max Miedinger's bio at Linotype mentions that he was \"commissioned to design a new sans serif typeface\". You state that his refinement of AG is a \"consistent new design idea\". Sorry, but I don't think a makeover or restyling is really the same thing as a new design idea!\n\n_How are their_ [my revivals] _relations to past type faces different from Helvetica?_\n\nBecause I 'fess up.  \nStated on my website, in PDF specimens -  \nWorldwide: \"A revival in the Century genre\"  \nGoodchild/Nicholas; \"Jenson revival\"  \nBodoni Egyptian: not really a revival, but the derivation stated in the name.  \nWalburn: \"Walburn is an adaptation of a typeface by Eric Walbaum\" (actually that's from my old website, I must reinstate that reference on the new site).\n\nI should also point out that none of my revivals has yet achieved the ubiquity of Helvetica, and I've published many more original designs than revivals. I find it a sad reflection of type culture that so many of the best known and most used faces are derivative. It's not that I'm against the past, and in fact I've succumbed to revivalism for the past three years, working on the Modern Suite (if you can't beat 'em...). As I said, I just find it sad that the best-selling, best-known, most used typeface is a 50-year old revival -- compare typography with other fields of art and design.\n\nActually, I'm very optimistic about the future of typography, so many great new typefaces have been designed in the last few years.\n\n"
    },
    {
      "time": "27 Aug 2007 — 6:57pm",
      "content": "Mr Shinn, you seem to have a bone to pick with Helvetica! Did it do something mean to you when you were both children? And are you sure that Helvetica isn't actually a rip-off of Frutiger, like Myriad? Or maybe Frutiger is a forgery of Akzidenz-Grotesk? They look the same at 16 point, when viewed from across the street.\n\nI'm just really confused by all of this Helvetica-hating, which seems like so much glasshouse stone-throwing. Mr Shinn, you have admitted above that you have plagiarized from the historical types of Jenson, Walbaum, and Benton. How are your plagiarized works any less scorn-worthy than Helvetica? (I don't like Helvetica either, but I can tell that it doesn't look like Akzidenz-Grotesk.)\n\nUli, I find it wonderful that you have talked about \"your own definition\" of words. You could take Alberto Gonzales's place as U.S. Attorney General: the job involves creating one's own definitions of words.\n\nJN\n\n"
    },
    {
      "time": "27 Aug 2007 — 7:07pm",
      "content": "As I remember from discussions of the origins of Helvetica here on Typophile, there was no single coherent Akzidenz Grotesk--that was a post-Helvetica creation by G.G. Lange--but a series of German sans fonts with different treatments. Akzidenz simply meant 'jobbing'--for advertising--but different sizes had different designs, and sometimes even different names.\n\nAs type goes, the creation of Helvetica, inspired by a diverse but related group of faces, seems to me pretty original. According to the story in the film, it evidently struck people as fresh at the time is came out--1957--helping its rapid rise to popularity.\n\nAs to acknowledgments, this complicated history, with no one source of inspiration, seems to me to let Linotype off the hook as far as acknowledgments in this case.\n\nYours is certainly an expert opinion, but I would be very surprised if many other experienced type designers would agree with you that Helvetica is an example of improper copying.\n\nIncidentally I don't have any pro-Helvetica bias. I think it is rotten in text, stale as display, and sub-par in signage.\n\n"
    },
    {
      "time": "27 Aug 2007 — 7:14pm",
      "content": "James, why don't you read what I wrote and make an attempt to understand it, before asking questions that I've already answered?\n\n"
    },
    {
      "time": "27 Aug 2007 — 7:32pm",
      "content": "Nick Shinn wrote:  \n\"There is no mention of the derivation of Helvetica from AG, which was shown in the Helvetica documentary (so I’ve heard — I haven’t seen the film).\"\n\nYou're like one of those lunatic Christians who picketed theatres showing \"The Last Temptation of Christ\" without ever seeing the film.\n\nNick Shinn also wrote:  \n\"Helvetica is a revival.\"\n\nPlease let me know the source of this information. Because being \"commissioned to design a new sans serif typeface\" does not seem synonymous with \"reviving\" to me.\n\nI read (and understood) what you wrote, which is why I asked the questions I did. Or did you answer questions under other Typophile topics. (I have been reading this site for several months, but maybe I missed it.)\n\n"
    },
    {
      "time": "27 Aug 2007 — 7:35pm",
      "content": "_I would be very surprised if many other experienced type designers would agree with you that Helvetica is an example of improper copying._\n\nBill, does nobody read what I write? Why do people insist on attributing opinions to me that I don't have?\n\nI don't \"hate\" Helvetica, for goodness sake, I think it's overused.  \nAnd I never said it's an example of improper copying. It's only a restyling, a revival. Besides, everything's legal and proper except point piracy.  \nWe're discussing plagiarism, and I pointed out that if you don't acknowledge your sources, that's what plagiarism is.  \nHelvetica is closely based on AG, that isn't mentioned at Linotype's website, although it as at the Helvetica Wiki page, among other sources.  \nMost people think Max Miedinger designed it, but others, such as Gary Hustwit, are more careful, and use the word \"developed\".  \nMany type designers other than myself, such as Martin Majoor in his Eye article, recognize it as a close copy of AG.\n\n"
    },
    {
      "time": "27 Aug 2007 — 7:40pm",
      "content": "_without ever seeing the film._\n\nIt was a still from the film that I saw, which showed rough drafts of Helvetica being compared to AG. I wish I could find it to post here.\n\n_being “commissioned to design a new sans serif typeface” does not seem synonymous with “reviving” to me._\n\nI'm sure he did the best he could with the commission.\n\n"
    },
    {
      "time": "27 Aug 2007 — 7:57pm",
      "content": "Nick Shinn wrote:  \n\"I’m sure he did the best he could with the commission.\"\n\nMr Shinn, From browsing your site, I saw that you were commissioned to design types for a newspaper up there in Canada. Were your designs revivals? Because it you seem to be saying that any commission is necessarily a revival. I'm sure that some commissions are revivals, but surely some are for original work?\n\nAnd I'm sorry, but a still from a film \"which showed rough drafts of Helvetica being compared to AG\" does not sound like conclusive proof of plagiarism to me.\n\nMr Berkson, thanks for your historical perspective on the many types known as Akzidenz-Grotesk, and the G. G. Lange \"revival\" of the style under the name \"Akzidenz-Grotesk\".\n\n"
    },
    {
      "time": "27 Aug 2007 — 8:14pm",
      "content": "_does not sound like conclusive proof of plagiarism to me._\n\nOne more time:  \nCopying and plagiarism are different things.\n\n_you seem to be saying that any commission is necessarily a revival_\n\nThen you misunderstood me. I said Max Miedinger was asked to design a new sans typeface (according to Linotype.com), and he did the best he could, with some success. But it was a revival of AG. As far as I am aware, he was not a designer of original typefaces. Two other designs by him are mentioned at Linotype, but they are no longer published, despite his fame as Helvetica's designer, and I have never seen them.\n\n"
    },
    {
      "time": "27 Aug 2007 — 8:33pm",
      "content": "Nick, Linotype acquired Helvetica when it took over Haas in 1989, according to the history on its web site. Haas and Meidinger could be praised or blamed for whatever they said then--and I don't know what it was. But to call Linotype plagiarists for not going into the history of a fifty year old font that they got 18 years ago seems to me weird.\n\nIf they went into Akzidenz Grotesk, they would have to mention name of a rival product, and explain that Berthold's font of that name isn't really the same as the original varied metal fonts, but also a modern synthesis, of several faces etc., etc. I can understand their not wanting to open that can of worms.\n\nAlso 'plagiarism' implies a close or identical copying of material. It goes beyond a lack of graciousness in acknowledging inspirations for your work. And I think Helvetica is significantly different in its thoroughgoing modernism.\n\nHere is what Majoor says: \"Compared to Akzidenz Grotesk, Helvetica has hardly any new features. Though claimed to be an improvement on Akzidenz Grotesk, it lacks all the character and charming clumsiness of Akzidenz Grotesk. Helvetica is blunt and colourless...\"\n\nBut that effort to cut out the clumsiness and be colorless and consistent was a new look, and it, along with Univers, which had a similar goal and appeared at the same time, were seen as path breaking as part of a new aesthetic of modern 'swiss design' or the 'international style.'\n\nAlso Helvetica did a lot of things to 'lock in the whites' or 'activate the whites', which the Swiss were talking about at the time. (See my illustrations and comments about halfway down [this thread](http://web.archive.org/web/20150123082433/http:/typophile.com/node/36301).)\n\nHere on Typophile quite a few people say they love the current AG, but hate Helvetica. Not an AG admirer, but it shows that many people find a significant difference.\n\n"
    },
    {
      "time": "27 Aug 2007 — 8:39pm",
      "content": "Mr Shinn, I really don't think I'm stupid, but I'm totally lost by your train of thought.\n\nTo rephrase my statement... And I’m sorry, but a still from a film “which showed rough drafts of Helvetica being compared to AG” does not sound like conclusive proof of copying to me.\n\nI think I'm starting to get what you're saying with this:  \n\"I said Max Miedinger was asked to design a new sans typeface (according to Linotype.com), and he did the best he could, with some success.\"\n\nYou, Nick Shinn, as the best type designer in the history of time, are in the unique position to be able to judge the success or failure of all other type designers.\n\nTo put Max Miedinger's body of work in context...\n\nJohann Pachelbel was a prolific composer of sacred and secular music during the Baroque era. He is known almost exclusively for the first movement of his Canon and gigue in D major. Of the approximately 530 compositions attributable to Pachelbel, it is one half of one piece which has stayed with us for 300 years.\n\nThe Czeck type designer Peter Bilak spent several years making variants of his magnus opus, Fedra. A list of types on his website reveals one early display type (Champollion), Greta, and 12 different Fedra families in all possible variants, sans and serif, condensed, display, arabic, mono...\n\nMax Miedinger was fortunate to leave behind a piece of classic design. (Note that I do not say \"arguably\". It is a design classic, whether anyone deems it otherwise.)\n\n"
    },
    {
      "time": "27 Aug 2007 — 9:42pm",
      "content": "_I think Helvetica is significantly different in its thoroughgoing modernism._\n\nAs Martin Majoor says, \"Helvetica has hardly any new features.\" Surely a new design needs new features, you can't just do some renovation and call it a new building. Futura, is a genuine example of 20th century modernism, built from the ground up, not a reprise of 19th century modernism.\n\n_You, Nick Shinn, as the best type designer in the history of time_\n\nSteady on. Even Hrant only said I was better than Zuzana Licko :-)\n\n"
    },
    {
      "time": "28 Aug 2007 — 12:43am",
      "content": "On account of its great importance for the history of typefaces, I think that it is imperative that the discussion about Helvetica should be raised to a more scholarly level. A \"summary judgment\" in the form of \" **The** Helvetica is a \"plagiarism\" of **the** Akzidenz Grotesk\" is unscholarly.\n\nI have many old and oldest printed samples of numerous foundry type cuts of Akzidenz Grotesk, some of which are downloadable here\n\n[http://www.sanskritweb.net/fontdocs/index.html#AKZIDENZ](http://web.archive.org/web/20150123082433/http:/www.sanskritweb.net/fontdocs/index.html#AKZIDENZ \"http://www.sanskritweb.net/fontdocs/index.html#AKZIDENZ\")\n\nbut I have none of the oldest printed samples of \"Haas'sche Grotesk\" and \"Neue Haas'sche Grotesk\". As far as I know, when Miedinger started the \"Neue Haas'sche Grotesk\" (neue = new), the Haas'sche foundry already sold the \"Alte Haas'sche Grotesk\" (alte = old) dating back to the 1940s, which at that time was simply called \"Haas'sche Grotesk\" (without \"old\").\n\nFor a scholarly discussion of plagiarism, you cannot draw on a promotional Helvetica movie, but you have to compare the oldest printed alphabet samples of the old Haas'sche Grotesk with the very first cuts made by Max Miedinger (i.e. not with the Helvetica cuts published years later) and with the old cuts of AG available at the time, when Miedinger started his work. But for doing this scholarly comparison you have to supply scans of the oldest alphabet samples from the oldest type specimen books available.\n\nIt's funny, but in this year 2007, a Frenchman issued \"Alte Haas Grotesk\", but due to lack of old Haas samples, I cannot decide, whether this is a facsimile font of the \"real\" \"Alte Haas'sche Grotesk\":\n\n[http://www.dafont.com/fr/alte-haas-grotesk.font](http://web.archive.org/web/20150123082433/http:/www.dafont.com/fr/alte-haas-grotesk.font \"http://www.dafont.com/fr/alte-haas-grotesk.font\")\n\n"
    },
    {
      "time": "28 Aug 2007 — 4:43am",
      "content": "Uli, you say that you are writing \"documentations for legal authorities\" and \"for prosecutors and criminal courts.\"\n\nI am not a law expert but it is my understanding that\n\n1. Prosecutors never take action in intellectual property issues. If I am wrong please correct me by providing a counter-example.\n\n2. Judges do not consider any external sources, only the legislation and the evidence provided by both parties. If I am wrong please correct me by providing a counter-example.\n\n3. If someone sues someone else they would not need your documentation because they have much more information and insight in their particular case anyway.\n\nSorry, I believe what you are doing (not the subject) is simply completely irrelevant and will never have any effect on a law suit.\n\n"
    },
    {
      "time": "28 Aug 2007 — 5:33am",
      "content": "Uli wrote:  \n\"It’s funny, but in this year 2007, a Frenchman issued 'Alte Haas Grotesk', but due to lack of old Haas samples, I cannot decide, whether this is a facsimile font of the 'real' 'Alte Haas’sche Grotesk':  \n\"http://www.dafont.com/fr/alte-haas-grotesk.font\"\n\nThis is amazing! A free font which states itself to be \"A typeface that looks like printed in an old Josef Muller-Brockmann Book.\" It's an auto-traced font, with round corners and rough edges.\n\nUli, you seem to be a serious researcher, so it is extraordinary that you would cite this source. This would be better: a friend of a friend's neighbour's brother-in-law's colleague.\n\nThanks to Tim Ahrens for providing the right word to end this statement:  \nThe history of websites about the history of types is the history of irrelevance.\n\nJN\n\n"
    },
    {
      "time": "28 Aug 2007 — 5:46am",
      "content": "<cite>Prosecutors never take action in <strong>intellectual property</strong> issues. If I am wrong please correct me</cite>\n\nHerr Ahrens, I already wasted too much time trying to explain why I use the term \"font forgery\". And now you come along and want to make me or other believe that I use the term \"intellectual property\". I don't care to correct you. Believe whatever you want to believe!\n\n"
    },
    {
      "time": "28 Aug 2007 — 5:56am",
      "content": "OK, if my terminology is the problem, let me formulate my first point as:\n\n1. Prosecutors never take action in font forgery issues. If I am wrong please correct me by providing a counter-example.\n\n"
    },
    {
      "time": "28 Aug 2007 — 6:16am",
      "content": "<cite>Prosecutors never take action in <strong>font forgery</strong> issues</cite>\n\nPlease read my above entry of 26.Aug.2007 9.16am.  \nWhy should I repeat what I have already explained?\n\nShould you happen to have further legal questions, I suggest that you consult a lawyer. In Germany, there are more than 100,000 lawyers always eager to consult against payment.\n\n"
    },
    {
      "time": "28 Aug 2007 — 7:05am",
      "content": "Nick, [this thread](http://web.archive.org/web/20150123082433/http:/typophile.com/node/28845) I think sheds light on the issue of how new Helvetica is. Half way down the first page you can see the Breite Grotesk that was one of the influences on Helvetica. And to me it looks significantly different. In fact, as the poster mentions, FF Bau is an effort to revive Breite Grotesk that is has more of the original flavor.\n\nAlso in that thread Erik Spiekermann says that the current AG is based on Helvetica, with relatively few changes, such as diagonal terminals. I wonder if Martin Majoor was mistakenly comparing Helvetica and the current AG, rather than Helvetica and the original German Grotesks that inspired Helvetica.\n\n\\>Surely a new design needs new features, you can’t just do some renovation and call it a new building. Futura, is a genuine example of 20th century modernism, built from the ground up, not a reprise of 19th century modernism.\n\nI'm not sure what you'd call 'features'. If you mean structural features such as whether the W has crossed middle strokes or not, I would disagree. I think you can have all such features the same and have radically different faces. If you've ever used Identifont you'd agree: with the same features, it comes up with matches that have radically different styles.\n\nThe handling of contrast, terminals, relative widths, proportions are as important as these structural features, and as much a source of originality in type, such as it is.\n\nI think Futura is a much greater typeface than Helvetica, but it is a different kind of modernism than Helvetica. According to the very interesting book on Renner, he was trying to be classic as much as modern, and it shows--for the better in my opinion. He was not trying for the bland-with-sparkle look that is the defining characteristic of Helvetica, and of which it is the prime exemplar.\n\nWhen even Uli, who is always the first to cry 'forgery', questions you on whether Helvetica is improper copying, I think you are on thin ice on this one.\n\n"
    },
    {
      "time": "28 Aug 2007 — 9:24am",
      "content": "This is a very strange semantic conversation and just goes to show that intellectual property arguments and liscencing agreements are built on very logically shaky grounds. Lawyer jargon and litigation-culture will destroy us all!\n\n"
    },
    {
      "time": "28 Aug 2007 — 10:31am",
      "content": " ![](http://web.archive.org/web/20150123082433im_/http:/typophile.com/files/berthold_accidenz_4420.jpg)\n\nHere is Berthold's 1954 specimen of Accidenz Grotesk.  \nMiedinger traced the lower case of one size, and the upper case of another (or a photostat), then nuanced his drawings.\n\nI have no evidence that's the way he worked, but why wouldn't he?  \nThat's how people do revivals, by tracing.\n\n"
    },
    {
      "time": "28 Aug 2007 — 10:56am",
      "content": "Nick, you've got a point. That looks way more like Helvetica than the Breite Grotesk in the other thread.\n\nI'd be curious to see what other German Grotesks were floating around--like the original Haas Grotesk--to see how derivative Helvetica was from AG specifically, and how much it was a refinement of German Grotesk style generally.\n\n"
    },
    {
      "time": "28 Aug 2007 — 12:55pm",
      "content": "Mr Shinn, as the pre-eminent type designer in the universe, I will believe you when you say that all revivals are made by directly tracing existing sources. That's what you did with your revival typefaces, I'm guessing.\n\nRe: the image you posted. To my eyes, this is completely different from Helvetica. Completely. Which is evident even at this small size.\n\nUli, I think that Mr Ahrens makes the valid point that Prosecutors do not bring forgery/IP/whatever cases. In the United States, they work for the city, state, or nation, and they bring cases for crimes like theft and murder. Cases concerning forgery/IP are the province of civil law, where one person sues another, with lawyers representing each side to a court. No Prosecutors anywhere, just lawyers.\n\nMaybe it's different in Germany, in which case you should go and post all of your stuff on typophile.de.\n\n"
    },
    {
      "time": "28 Aug 2007 — 1:41pm",
      "content": "James, may we continue without the sarcasm?  \nAt Typophile, we try to keep a lid on ad hominem remarks:  \n [http://typophile.com/node/36566](http://web.archive.org/web/20150123082433/http:/typophile.com/node/36566 \"http://typophile.com/node/36566\")\n\nHow do you suppose Max Miedinger created the artwork for Helvetica?  \nDo you not think it likely that he would have proceeded from tracings of the 1954 Berthold face?\n\n ![](http://web.archive.org/web/20150123082433im_/http:/typophile.com/files/berthold_accidenz2_5097.jpg)\n\n"
    },
    {
      "time": "28 Aug 2007 — 2:22pm",
      "content": "\\>That’s how people do revivals, by tracing.\n\nI don't know what Max Miedinger did, but I know what I am doing with my revival of Caslon, and it is not following tracing.\n\nI have indeed done scans of the three best text sizes--all significantly different from one another. But I have drawn everything from scratch, except the initial i and o of the basic size--and I changed these two letters numerous times. I compared with a magnifying glass my drawings to the original printing of Caslon, to revivals of Caslon, both metal and digital, as well as other old faces. I have adopted what I like in Caslon, rejected what I don't, and added my own inventions.\n\nMatthew Carter compared a revival with a new performance of an old score. For my effort, I feel like it even more for me and Caslon it has been like taking an old theme from a symphony, and writing a new symphony with the same theme.\n\nIt isn't a matter of cleaning up traces, or altering them here and there. It is a matter of finding a new vision of an old style--and it is in fact a Dutch style that went through many hands--and carrying that through systematically.\n\nCaslon did his interpretation of his Dutch predecessors, and I am doing my interpretation of his work. I feel like I'm in good company, and it is a company not of pirates, but of craftsman and artists.\n\n"
    },
    {
      "time": "28 Aug 2007 — 7:17pm",
      "content": "Of course, that was a generalization Bill.  \nThere's no survey of redesigners' work that reveals their methods.  \nNonetheless, the signs of autotracing (an important feature of Illustrator, Fontographer and FontLab) are apparent in the outline paths of many retro fonts, and faces such as Adobe Garamond were made with tracing, as shown in the Adobe Garamond specimen booklet.  \nI've used a variety of techniques, including the magnifying glass.  \nHowever, the similarities between Accidenz Grotesk and Helvetica are too great for me to reconcile with any technique other than tracing.\n\n\\*\\*\n\nThere's an important consideration that sets revivals of older letterpress text types apart, and that is the adjustment made from impressions with substantial gain, to present day offset reproduction (or display usage), which requires imagination and interpretation on the part of the redesigner. That forces a certain amount of originality upon the project, which you don't see in revivals that are made, for instance, from display sizes in early 20th century specimen books, or from phototypositor era specimens -- such as a recent post in this forum, Rustikalis.\n\n"
    },
    {
      "time": "29 Aug 2007 — 3:05am",
      "content": "<cite>Nonetheless, the signs of autotracing (an important feature of Illustrator, Fontographer and FontLab) are apparent</cite>\n\nIf I renamed my website from\n\n\"The Funny Font Forging Industry\" to  \n\"The Funny Font Tracing Industry\"\n\nthen the font tracer alias font forger Tim Ahrens would be more pleased.\n\nWhile it is known that font tracer alias font forger Tim Ahrens traced Albert Kapr's \"Leipziger Antiqua\", the interesting question remains:\n\nDid font tracer Tim Ahrens trace Typoart's photocomposition tracings,\n\nsee here [http://justanotherfoundry.com/Lapture/index.htm](http://web.archive.org/web/20150123082433/http:/justanotherfoundry.com/Lapture/index.htm \"http://justanotherfoundry.com/Lapture/index.htm\")\n\nor did font tracer Tim Ahrens trace the tracings made by URW,\n\nsee here [http://www.myfonts.com/fonts/urw/leipziger-antiqua/](http://web.archive.org/web/20150123082433/http:/www.myfonts.com/fonts/urw/leipziger-antiqua/ \"http://www.myfonts.com/fonts/urw/leipziger-antiqua/\")\n\nAbove in this thread, font forger alias font tracer Tim Ahrens remarks:\n\n<cite>Judges do not consider any external sources, only the legislation and the evidence provided by both parties</cite>\n\nIf the lid on Albert Kapr's coffin was solidly nailed and his coffin deeply buried, I wonder how Albert Kapr could provide evidence to judges.\n\nChase said ( [http://www.sanskritweb.net/chase](http://web.archive.org/web/20150123082433/http:/www.sanskritweb.net/chase \"http://www.sanskritweb.net/chase\"))\n\n\"The dead stay dumb\"  \n\"Here's your wreath\"  \n\"This way for a shroud\"\n\nBut Chase also said:\n\n\"A coffin from Hongkong\"  \n\"Make the corpse walk\"  \n\"We'll share a double funeral\"\n\nSo, in the end, is font forger alias font tracer Tim Ahrens right in saying that Albert Kapr could supply evidence to judges? If this were true, it would explain, why Chase said:\n\n\"Knock, knock! Who's there?\"  \n\"My laugh comes last\"  \n\"I'll get you for this\"\n\nPS: I have just seen: The American \"Red Rooster\" font forging outfit also made a forgery (sorry, a \"tracing\") of Kapr's Leipziger Antiqua:\n\nsee [http://www.veer.com/products/typedetail.aspx?image=RRT0011540](http://web.archive.org/web/20150123082433/http:/www.veer.com/products/typedetail.aspx?image=RRT0011540 \"http://www.veer.com/products/typedetail.aspx?image=RRT0011540\")\n\n"
    },
    {
      "time": "29 Aug 2007 — 3:20am",
      "content": "For more information on the making of Lapture see the following articles:\n\nTypographica  \n [http://typographica.org/001041.php](http://web.archive.org/web/20150123082433/http:/typographica.org/001041.php \"http://typographica.org/001041.php\")\n\nDT&G  \n [http://www.graphic-design.com/Type/lapture/index.html](http://web.archive.org/web/20150123082433/http:/www.graphic-design.com/Type/lapture/index.html \"http://www.graphic-design.com/Type/lapture/index.html\")\n\nPAGE 09/2005 (unfotunaley only available for a fee)  \n [http://www.page-online.de/page/pdf/daten/C142/](http://web.archive.org/web/20150123082433/http:/www.page-online.de/page/pdf/daten/C142/ \"http://www.page-online.de/page/pdf/daten/C142/\")\n\n"
    }
  ]
}
