{
  "id": "36483",
  "title": "Where do I find free nuggets ?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I know, a whole lot of designers prefer the  \nfonts which are \"sold\". Unfortunately at times  \npeople cant afford even the cheapest of the  \nfonts which are sold, primarily because they  \nare sold in dollars or euro, converting it  \nat times into any other country's money means  \nmultiplying it by a factor of 50, or 10 atleast.\n\nAt times, when you are designing for NGO's or  \nvolunteer organizations, they really do not  \nhave the budget to buy fonts.\n\nIn such a situation, which are the \"good\" fonts  \nthat are available for free ? I know sites like  \nDafont have many fonts, but I'd like to know  \nthe ones which are good and usable, mainly for  \nthings like body text, headlines etc. not just  \nfor display or decorative purposes.\n\nIf you have found such free nuggets please  \nshare them with us.\n\n",
  "author": "<a href=\"/web/20101018054434/http://www.typophile.com/user/21094\" title=\"View user profile.\">richard_a</a>",
  "time": "<br>",
  "uid": "21094",
  "comments": [
    {
      "time": "",
      "content": "The best nuggets usually come bundled with software you have bought. I have bought some things just for the fonts that come on the CDs. Browse through the CD of any graphic programs you have and you could turn up something.\n\n"
    },
    {
      "time": "",
      "content": "The TypoWiki contains an entry on [free fonts](http://web.archive.org/web/20101018054434/http:/typophile.com/node/14652).\n\n"
    },
    {
      "time": "",
      "content": "Could you please give me an example of the fonts  \nthat come along with graphic softwares ?\n\nWe use gimp and inkscape.\n\n"
    },
    {
      "time": "",
      "content": "Thank you Bart De Ruyck,\n\nI think, I should have looked around  \nbefore posting. :p\n\n"
    },
    {
      "time": "",
      "content": "Indeed, free software rarely comes bundled with free fonts.  \nBut just about any commercial application that handles text, from Corel Draw to Microsoft Word, generally includes a bundle of fonts that are licensed with purchase of said software. Not really free, but you don't have to pay more for them once you have bought the program.\n\n"
    },
    {
      "time": "",
      "content": "If you can use .ttf on PC, just a $5 old version of Print Artist 4 will have over a thousand AGFA fonts.\n\n[Here are a few real nice fonts I came across recently](http://web.archive.org/web/20101018054434/http:/www.josbuivenga.demon.nl/index.html)\n\n"
    },
    {
      "time": "",
      "content": "Buy an old version of Canvas from Deneba, 2400 URW fonts you can find it on ebay regularly for very reasonable prices, and the fonts are pretty interesting, but not cutting edge.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "The [DejaVu](http://web.archive.org/web/20101018054434/http:/dejavu.sourceforge.net/wiki/index.php/Main_Page) fonts are not only free to use, but open-source as well. One of the project's primary goals is to have a very full character set:\n\n<dl>\n<dt>\n</dt>\n<dd><em>Most DejaVu fonts are suitable for Latin (Western and Central European, African Latin and International Phonetic alphabets), Cyrillic (European) and Greek (Modern and Polytonic). Arabic, Armenian, Hebrew, Lao, Canadian Aboriginal Syllabics and Georgian are currently in development and included in DejaVu Sans.</em></dd>\n</dl>\n\nSo, not only are these not sold in $ or €, their character sets may be even more appropriate for your projects.\n\nGranted, they aren't the most interesting of designs -- just a sans, serif, and mono.\n\n--John\n\n"
    },
    {
      "time": "",
      "content": "Have a look through the pages at [this](http://web.archive.org/web/20101018054434/http:/www.yayhooray.com/thread/79356/the-hott-freee-fontss-nnoww!?page=1) site. Not all of them are of any use of course, but some of them are surprisingly nice.\n\n"
    },
    {
      "time": "",
      "content": "There is also [**Fontleech**](http://web.archive.org/web/20101018054434/http:/fontleech.com/), a discriminating online compendium of free font links, which has received [favorable comments from Stephen Coles](http://web.archive.org/web/20101018054434/http:/www.typophile.com/node/9380).\n\n"
    },
    {
      "time": "",
      "content": "Thanks John, John and Ricardo. Got a few nice things to play with I hadn't seen before.\n\n"
    },
    {
      "time": "",
      "content": "Thank you all.\n\nYou have been very kind.\n\n"
    },
    {
      "time": "",
      "content": "A couple of blog posts from people who went out looking for fairly decent free fonts, [here](http://web.archive.org/web/20101018054434/http:/www.alvit.de/blog/article/20-best-license-free-official-fonts) and [here](http://web.archive.org/web/20101018054434/http:/www.smashingmagazine.com/2006/10/11/17-more-free-quality-fonts/). They are from a while ago, so I don't know if all the links still work. You'll have to try.  \nAnd [Jos Buivenga](http://web.archive.org/web/20101018054434/http:/www.josbuivenga.demon.nl/) has made some pretty nice free stuff.\n\n"
    },
    {
      "time": "",
      "content": "[[http://www.fontplay.com/images3/sukplena.jpg|I just used one]] that I picked up at one of those sites.\n\nBtw, I took that photo at Big Lots. It is a closeup of a sort of non-liquid lava lamp, with a green 'color' layer that took out the blue swirls.\n\n"
    },
    {
      "time": "",
      "content": "I would like a free car. One that drives as good as a Mercedes, but BMW grade OK. I don't want to pay for it but I will drive people around and charge them for it.\n\n"
    },
    {
      "time": "",
      "content": "Terry, I suppose that your remark refers to the ease with which one can make copies in the digital realm, which can create an attitude that things like software programs, music, movies, etc., should be free.\n\n[EDIT] And richard\\_a does mention that he needs the fonts for clients that are non-profit groups. It doesn't sound like he will making tons of cash off of the work he creates with these free fonts.\n\n"
    },
    {
      "time": "",
      "content": "Funny. Do the non-profit orgs also only get printing when it is free?\n\nI know a lot of non-profits will pay big bucks for quality printing, quality design, and quality fonts ... particularly when the end purpose is to produce direct mail pieces that are intended to solicit donations. That business is based on appealing to the heart strings of potential donors, and I can think of no way of destroying the mood better than through poor design.\n\nSpending $500 for fonts is a good investment if it will result in $100,000 more in donations from a mailing.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Spending $500 for fonts is a good investment if it will result in $100,000 more in donations from a mailing.</cite>\n\nThere are different level of non-profit. Some are pretty slick at raising money. Some are mainly concerned with helping people, and don't have a lot of resources. And you seem to assume it is a money-raising mailing that is being worked on. Could just be a dance for blind autistic people.\n\nBut we get your point. There are instances where it doesn't hold much water. I have worked in such a situation.\n\nStill, there are so many inexpensive resources available there isn't anything that should stop anyone from designing quality output, except maybe being talent-handicapped. Which reminds me, your donation, sent to fontplay.com will help victims of this terrible disease.\n\n"
    },
    {
      "time": "",
      "content": "I see your point, Don, and it makes a lot of sense.\n\n"
    },
    {
      "time": "",
      "content": "If you click on Richard's name, you'll find that he's in Eritrea.  \nHence his \"50 times\" the price comment.  \nRegular font prices are an affordable bargain in the West, but a luxury in many African countries.\n\n"
    },
    {
      "time": "",
      "content": "<cite>If you click on Richard’s name, you’ll find that he’s in Eritrea.</cite>\n\nWhen you have a chip on your shoulder, the facts usually are not important. Not all non-profits have the budget of Red Cross or World Vision, and the snide comments make me a little sad.\n\n"
    },
    {
      "time": "",
      "content": "Nonetheless, the double standards that exist in non-profits and NGOs can be galling for those who volunteer, seeing that some products and services (and employees) get paid for their work.\n\n"
    },
    {
      "time": "",
      "content": "<cite>the double standards that exist in non-profits and NGOs can be galling</cite>\n\nFor some, there is never enough money to do the job.\n\nOther are just slick fund-raising fronts. One I checked out, only 5% went to what the organization said they existed to do. The rest were salary and fund-raising. Some of which was sub-divided in the statement as 'education', but was what they called it when someone physically went out to do a presention.\n\nHere in the US they have to give you a statement of how money is spent, if you request it. I have found it is worthwhile if you are thinking of donating.\n\n"
    },
    {
      "time": "",
      "content": "Double standards are a necessary evil, as many different kinds of work need to be done, but not all suppliers and contractors are prepared to do it for free.\n\nIMO the saddest situation in when volunteers start up an organization which becomes successful, and then must become self-sufficient and professionally run to survive past their initial enthusiasm -- however, they are not professionally qualified to run it (especially relevant if a third party, e.g. governement, is providing funding) so can't even apply for the job they created and do. There is also the stigma of self-interest that prevents one from capitalizing on a pro bono initiative. It's an ethical conundrum. However, I don't mind donating fonts to any organization that asks me (as long as it's suitably radical and the kind of outfit I'd be inclined to donate to anyway), after all, it takes little effort to copy a piece of software.\n\n"
    },
    {
      "time": "",
      "content": "<cite>However, I don’t mind donating fonts to any organization that asks me (as long as it’s suitably radical and the kind of outfit I’d be inclined to donate to anyway), after all, it takes little effort to copy a piece of software.</cite>\n\nThat is good to hear, and what I'd hope from most good people. I just got home, and when I get settled, I'll present an organization I've been involved with, as an example of how a tremendous amount of good can be done, mainly with donations of goods and time, and most of all, caring.\n\n"
    },
    {
      "time": "",
      "content": "Maybe 18-20 years ago I got involved in going down to an orphanage with 23 kids between Ensenada and Tecate in Baja. When I first started going down, there were no toilets or running water. The kids used an outhouse with a rotting floor, with a big hole in it that allowed you to see the refuse and maggots, if you had a mind to focus in that direction.\n\nThere was no washing machine for clothes, as we know it. Just a tub with a wringer. Doing laundrey this way for 23 kids was a workout. everything was very primitive.\n\nThrough the years, materials were geneously donated that allowed us to put in showers, toilets, laundry room, build more rooms and bunk beds, study room with books. Now over 90 kids are housed at that orphanage. A few years ago a computer room was built.\n\nMoney donated has been used for extended education. Beauty school for some. Trade school for others. We have put in a water tank on top of the main house, and arranged for drinking water to be trucked in to fill the tank on a regular basis.\n\nSometimes we help with gas and electric bills. But we don't naively give away money. Fortunately, there is an upright person in charge of this particular orphange, which is one reason we have focused our work there.\n\nI was able to get 5 spanish comic books for $1 in Tijuana and bring 50-60 each time I go down to encourage them to read. And some of the little kids who used to sit in my lap and read the comic books, now have successful careers, and families. Some are now coming back to help at the orphange.\n\nWe haven't been able to tap many of the common sources for funding because we don't want to have to kiss too many behinds, and have people tell us what we can and can't do.\n\nSo with whatever money that comes in, there is always a something we can do for the next generation of kids. There is no 'advertising budget', and there are no salaries, and we are very used to asking for donations before buying something.\n\nOne school district who found out what we were doing, recently donated two hardly used school buses. They figured for as much as they were using them, they could charter and save overall on insurance and upkeep.\n\nI suppose I should mention that orphanages in Mexico, most of the kids have at least one parent, but that person is a drug addict, drunk, prostitute, child beater or child molester, and the state has taken the kid away. An occasional success story has the father sobering up and staightening up his life, and coming and getting his kids, but that isn't too common.\n\nAnyway, we wouldn't think of asking for a free font, but more practical things are always needed. Most people who come down and see what a difference we can make in someone's life are happy to help in one way or another.  \n; )  \nIf you have the opportunity to get involved with a group that goes down to Mexico, or some other underdeveloped location, it is a wonderful experience with various rewards. Not the least of which is an appreciation for many things you have taken for granted.\n\n"
    },
    {
      "time": "",
      "content": "I think it would be very hard to argue that $500 in fonts would directly increase a compaign's effectiveness. I'm not saying that good design and copywriting don't make a difference, of course, just that there are numerous free fonts out there they would do the job just as well.\n\nI regularly receive mailers from and contribute to organizations such as the ASPCA, Habitat for Humanity, The Red Cross and others, and their font usage is pretty horrendous. Nevertheless, they are highly successful at obtaining donations, because their work is important and their message resonates.\n\nAs much as I live for fonts and design, I'd much rather see that $500 go towards buying kid's shoes so they can go to school, rather than using a stunning HFJ font on their brochure.\n\n"
    },
    {
      "time": "",
      "content": "<cite>As much as I live for fonts and design, I’d much rather see that $500 go towards buying kid’s shoes so they can go to school...</cite>\n\nExactly!\n\n"
    },
    {
      "time": "",
      "content": "_As much as I live for fonts and design, I’d much rather see that $500 go towards buying kid’s shoes so they can go to school..._\n\nExactly!\n\nsometimes both can happen [http://www.buildingletters.org/](http://web.archive.org/web/20101018054434/http:/www.buildingletters.org/ \"http://www.buildingletters.org/\") & [http://www.myfonts.com/foundry/fontaid/](http://web.archive.org/web/20101018054434/http:/www.myfonts.com/foundry/fontaid/ \"http://www.myfonts.com/foundry/fontaid/\")\n\n"
    },
    {
      "time": "",
      "content": "Sometimes a free font and someone who doesn't know what they are doing can make a difference.\n\n[http://moorstation.org/typoasis/designers/klein04/kl1mono\\_fundraiser.htm](http://web.archive.org/web/20101018054434/http:/moorstation.org/typoasis/designers/klein04/kl1mono_fundraiser.htm \"http://moorstation.org/typoasis/designers/klein04/kl1mono\\_fundraiser.htm\")\n\n"
    },
    {
      "time": "",
      "content": "_someone who doesn’t know what they are doing_\n\nthis may sound harsh, but i must ask  \nwhy not learn what you are doing rather than boast you do not know?\n\na very noble and very worthy cause, but is not getting the name of the syndrome wrong a very unfortunate typo that could potentially have a negative rather than positive effect?\n\nit seems a bit disingenuous to claim a free font used in a table centerpiece was responsible for the amount raised at this fundraiser. fonts are fonts in the end. do good things for humanity. do good typography. we can all aspire for greater things.\n\n"
    },
    {
      "time": "",
      "content": "I do feel graphics skills are one way to contribute, if you feel the world desperately needs some changes. I volunteer for a number of local nonprofit causes. My husbands asks: Are you ever going to get paid? (I am occasionally...)\n\nI do all the graphics & web for Washington Public Campaigns (that's Washington State). I was enthused about this cause from the first meeting, where I volunteered graphic design.\n\nThey were operating on a shoestring: not even enough funds to pay one part-time staffer. I had noticed all their graphics SUCKED, from the website to the logo and brochure. They were done by whoever volunteered to do them: young techies or sweet old ladies.\n\nA year later the organzation's membership has grown 10 times larger. So much praise and appreciation is heaped on me (and all the volunteers) it's almost embarrassing at times (well, not really, I like it).\n\n"
    },
    {
      "time": "",
      "content": "<cite>why not learn what you are doing rather than boast you do not know?</cite>\n\nI cannot afford to go to design school. I am trying to learn on the go, which is one reason I am here. But I fear I will attain the level of work I admire. I just can't visualize at that level.\n\n<cite>it seems a bit disingenuous to claim a free font used in a table centerpiece was responsible for the amount raised</cite>\n\nAnd I only claimed my FPs were used centerpieces. But it was helping in my way.\n\n<cite>but is not getting the name of the syndrome wrong a very unfortunate typo</cite>\n\nI had no idea what you were talking about, and after checking, I can't believe no one involved with the organization caught that error. I could swear I have heard it called that. My bad. The world is full of dummies, and I am a card-carrying member.  \n; )\n\n"
    },
    {
      "time": "",
      "content": "I understand the sentiments of designers who, earn  \ntheir living by using fonts ( as graphic designers )  \nand by making fonts (as type designers). However,  \ndear friends please do have a look at the context  \nand claims one is faced with.\n\nI know by using \"free\" fonts, I might not come out  \nwith an exceptional design concept. My main motive  \nhere is to do the best I can in the given constrains.\n\nIn the Book by Erik S. he ends it beautifully by saying  \nthere is no bad type. In this respect, I think a free  \nfont would be \"good\" for me. I guess one just has to learn  \nto work with the so called \"bad\" type.\n\nThank you all for your inputs.\n\n"
    },
    {
      "time": "",
      "content": "Hi Fontplayer,\n\nIf you feel you need some commercial type to further the cause, please contact me thru my profile. I’ll buy them for you.\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "<cite>I guess one just has to learn<br>\nto work with the so called “bad” type.</cite>\n\nIt would be nice to see/know what font(s) you did choose for your design(s).\n\n"
    },
    {
      "time": "",
      "content": "I might as well use this wasted double post to wish that edited posts would stay in order. Or that someone would state a good reason why it can't be so.\n\n"
    },
    {
      "time": "",
      "content": "Bert, That is very kind of you to offer. However my level of talent will be served with the thousands of commerical fonts I've already legally obtained. Some bought individually back when I had 'extra' money have never been used for anything.\n\nWhen I originally make the 'fontplays' used for the fund-raiser, it was just for my own enjoyment using free fonts and some photos my friend came back from Africa with. They liked them and asked to use them. Another used one of Ray Larabie's fonts. (Ray would be in my Hall of Fame if not for an ill-considered comment he made once upon a time. In any case, he has made some of my favorite free fonts)\n\nHere's the Africa one using his Engebrechtre:\n\n ![](http://web.archive.org/web/20101018054434im_/http:/typophile.com/files/engebrechtre_6150.jpg)\n\n[The rest of the RL FPs are here](http://web.archive.org/web/20101018054434/http:/www.fontplay.com/ray.htm)\n\nThanks again for your offer. It is very kind of you. I'm sure your generous nature will be rewarded when all is tallied up.\n\n"
    },
    {
      "time": "",
      "content": "Getting back to the subject of whether free fonts are \"good\" or \"bad,\" I just discovered the [**Free Font Manifesto**](http://web.archive.org/web/20101018054434/http:/www.designwritingresearch.org/free_fonts.html) on Ellen Lupton's website -- an interesting, thoughtful read.\n\n"
    }
  ]
}
