{
  "id": "36522",
  "title": "Generating Type 1 in Fontlab",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi,\n\nit’s my first post here and I’m sure that every body here will help me.\n\nHere’s the problem:\n\nI’ve created a symbol font for a contract (it’s a programmation). The purpose of it his to ad scribbles in the text in an efficient way. But, even after thousands of tries, FontLab refuse obstinately to generate a type 1 font with bitmap preview, wich is exactly what I need to use in Quark (There’s still people in the studio who do not know InDesign). The only way I can get out of that is by putting a bitmap size of 36, wich is not helpful.\n\nI join some screenshots to let you see the details and the result.\n\nThe document will be printed next week, so I began to freak out a bit.\n\nIf any one can help me, it will be very appreciated…\n\n [‹ Gutenprint hp drivers for Tiger--DPI limits](http://web.archive.org/web/20080706223710/http:/www.typophile.com/node/36524 \"Go to previous forum topic\") [Flowing text across Indesign pages ›](http://web.archive.org/web/20080706223710/http:/www.typophile.com/node/36508 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706223710/http://www.typophile.com/user/21135\" title=\"View user profile.\">Alexandre Bélanger</a>",
  "time": "<br>",
  "uid": "21135",
  "comments": [
    {
      "time": " 27.Aug.2007 9.57am",
      "content": " ![](http://web.archive.org/web/20080706223710im_/http:/www.typophile.com/files/Image-1_4829.jpg)\n\n ![](http://web.archive.org/web/20080706223710im_/http:/www.typophile.com/files/Image-4_5768.jpg)\n\n ![](http://web.archive.org/web/20080706223710im_/http:/www.typophile.com/files/Image-6_6400.jpg)\n\n ![](http://web.archive.org/web/20080706223710im_/http:/www.typophile.com/files/Image-7_4131.jpg)\n\n"
    },
    {
      "time": " 27.Aug.2007 11.17am",
      "content": "I’d start by filling all the empty character slots with a generic icon of some kind.\n\n"
    },
    {
      "time": " 27.Aug.2007 1.25pm",
      "content": "Thanks for the idea, Nick, but after two tries, the software is still crashing…\n\nHave you any other idea???\n\nBy the way, I found your conference at Grafika 2006 about Opentype and softmachine quite interesting!\n\n"
    },
    {
      "time": " 27.Aug.2007 1.57pm",
      "content": "Thanks Alex.\n\nTry generating it as a Type 1 .otf font — Quark 7 supports those.\n\nGo through all the “Font Info” panels and compare what you’ve entered to a standard commercial font.  \nThat might address font naming as the source of your problem.\n\nHowever, there may be a problem with your outlines — especially as your are making graphics, not single characters.\n\nCan you post one of your larger and more gnarly glyphs, so we can see the outlines?\n\n"
    },
    {
      "time": " 27.Aug.2007 3.11pm",
      "content": "Nick,\n\nI cannot generate a Type 1 OTf because I’m using Quark 6.5.\n\nHere’s some screenshots of the more complex glyphs and from the Info panel.  \nBasicly, the glyphs are from an autotrace in Illustrator (I just discover that ther’s one in FontLab).  \nI already check with a commercial font but maybe you’ll find something that I didn’t see…\n\n ![](http://web.archive.org/web/20080706223710im_/http:/www.typophile.com/files/Image-9_3516.jpg)\n\n ![](http://web.archive.org/web/20080706223710im_/http:/www.typophile.com/files/Image-11_5861.jpg)\n\n ![](http://web.archive.org/web/20080706223710im_/http:/www.typophile.com/files/Image-10_5386.jpg)\n\n"
    },
    {
      "time": " 27.Aug.2007 5.09pm",
      "content": "Doesn’t look good, there could well be bad paths lurking in there.  \nYou might see better if you turned off the background and just looked at the paths.\n\nContour \\> paths \\> simplify paths might be worthwhile.\n\nAlso you could try successively pasting groups of characters from this font into a new font, and seeing when the font ceases to compile. Trial and error: to isolate the potential bad characters.\n\nSometimes just copying the characters to a fresh font does the trick.\n\n"
    }
  ]
}
