{
  "id": "36535",
  "title": "Thoughts about logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,\n\nI would like to know what you think about this logo.  \nAt first I liked it, but now I looked at it for so much time that I don’t know anymore...\n\nThanks for your help.\n\n| Attachment | Size |\n| --- | --- |\n| [mycorp-logo.jpg](http://web.archive.org/web/20080111001338/http:/typophile.com/files/mycorp-logo.jpg) | 63.73 KB |\n\n [‹ Poco](http://web.archive.org/web/20080111001338/http:/typophile.com/node/35205 \"Go to previous forum topic\") [Art Advisory Logo modification ›](http://web.archive.org/web/20080111001338/http:/typophile.com/node/36647 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080111001338/http://typophile.com/user/21150\" title=\"View user profile.\">mycorp</a>",
  "time": "<br>",
  "uid": "21150",
  "comments": [
    {
      "time": " 27.Aug.2007 2.43pm",
      "content": "well, it feels very corporate, so I’d say it’s a success in that sense.\n\n"
    },
    {
      "time": " 27.Aug.2007 10.05pm",
      "content": "A bit of an aside, but did you actually get that name registered? I would be amazed if they let you have that being that there is a really larger “MyCorporation” company already existing.\n\nJust curious.\n\n"
    },
    {
      "time": " 28.Aug.2007 3.14am",
      "content": "Yes, I got it registered, but not to an international level. Since it’s not a company name, it was the only way I could register the domain mycorp.pt.\n\n"
    },
    {
      "time": " 28.Aug.2007 2.51pm",
      "content": "I feel there’s a total disconnection between “my” and “CORP”. Contrast is good, but there should be something connecting, too. Right now it doesn’t look one logo, but two logos that happen to stand besides each other.\n\nAlso, I’d try avoiding dark grey and go for black directly.\n\n"
    },
    {
      "time": " 28.Aug.2007 3.56pm",
      "content": "The dark grey of the “CORP” tries to show a “grey” corporation, which corporate identity isn’t appealing, while the red suggests the life that can be given to that corporate identity. I’ll give it a try though.\n\nDo you have any suggestions about the way the “my” and the “CORP” could be connected?  \nThanks a lot.\n\nI’ll be posting the red-black version in the next 24 hours.\n\n"
    },
    {
      "time": " 28.Aug.2007 6.32pm",
      "content": "a simple couple of changes might make this come together better...\n\n ![](http://web.archive.org/web/20080111001338im_/http:/typophile.com/files/mycorplogo_4373.jpg)\n\n"
    },
    {
      "time": " 28.Aug.2007 7.18pm",
      "content": "The overlapping idea is quite good. Keep trying though.\n\nAvoiding dark grey has two reasons: First, it looks “dirty” and therefore unpleasant; second, dark grey is often hard to process — for instance, it tends to blur or get messy when down-sampled. Instead of symbolizing a “grey” corporation, I’d suggest an “empty” one instead — by using outline letters (white body with black outline).\n\nIn any case, there’s no reason why the “corporate design agency” line should be grey as well — especially considering its small size and reduced readability.\n\n"
    },
    {
      "time": " 29.Aug.2007 2.39am",
      "content": "Thank you all for your help.\n\nHere is a new try, with the CORP in outline, bigger “corporate design agency” and the “my” overlapping.\n\nAll ears for new comments :)\n\n ![](http://web.archive.org/web/20080111001338im_/http:/typophile.com/files/mycorp-logo-v2_4506.jpg)\n\n"
    },
    {
      "time": " 29.Aug.2007 4.11am",
      "content": "The “my” seems too small in comparison to the “CORP”. The proportion in Chuck’s version above looks clearly better to me.\n\nI’d also move the (R) sign to the left and reduce its size. It stands out to much.\n\n"
    },
    {
      "time": " 29.Aug.2007 5.12am",
      "content": "I thought about those sizes, because the “CORP” is in caps, while the “my” is not, and this seemed the right size to me.  \nI’ll give it a try.\n\nThanks a lot.\n\n"
    },
    {
      "time": " 29.Aug.2007 5.47am",
      "content": "New one. I reduced the (R) a little bit, and made it thiner.  \nI made the “my” a little bigger too.\n\n ![](http://web.archive.org/web/20080111001338im_/http:/typophile.com/files/mycorp-logo-v2_6011.jpg)\n\n"
    },
    {
      "time": " 29.Aug.2007 6.30am",
      "content": "Does the red have to be red? I read strong “bloody” associations in it (particularly in the y’s tail).\n\n"
    },
    {
      "time": " 29.Aug.2007 7.17am",
      "content": "The red was chosen as a simbolization for the life we could give to some corporation’s identity. It’s indirectly associated to blood’s color, as blood can mean life (at least to me).\n\nIt started as green, but I quickly got bored of it.\n\n"
    },
    {
      "time": " 29.Aug.2007 1.23pm",
      "content": "No, I really think “my” needs to larger still — so that it’s highest point is higher than “CORP”. There’s no reason why non-cap letter can’t be larger than cap letters when they’re using different typefaces anyway.\n\n"
    },
    {
      "time": " 29.Aug.2007 1.41pm",
      "content": "Maybe try taking the outline off of the “my” or use the same red for an outline if you want to increase the size a little. I would also try rotating the my a little and move it up on the “CORP” so it looks like the “my” is filling in the outlined “CORP”.\n\n"
    },
    {
      "time": " 30.Aug.2007 8.00pm",
      "content": "i agree here. something seems out of proportion. but also, the small type at the bottom seems second thought-like. it bothers me. those letters are kerned way too close but not close enough. (i’m looking at the rp and ra). what would happen if the MY was stacked. try using the space differently. i don’t think designing within narrow guide rails is going to get you a fresh solution here.\n\ni think the word my is annoying as it’s very thing to begin and then becomes so thin at the ends of the strokes but neither letters ever touch. i think it could go thicker. does it need to be a script? how about an italic? that’s saying something about the human factor as long as you use an appropriate italic..\n\nw|m\n\n"
    },
    {
      "time": " 31.Aug.2007 1.59am",
      "content": "The ideia behind the script in “my” was a simbolization of a personal touch in the design, as every person has its own calligraphy. In fact, I drew those two letters according to my own calligraphy.\n\nI also thought about an italic here, but this is not a possible solution for this logo (for several reasons, one being that the logo would have similarities to another existing logo).\n\nYou’re right about the kerning of the small letters, I hadn’t even thought about it yet.\n\nI’m still trying to get something different with the ’my’, but there are no solutions I really like until now.\n\n"
    },
    {
      "time": " 31.Aug.2007 3.18am",
      "content": "I would splash out a tiny little more space between the R and the P, compared with C and O they’re looking too swatted.  \nAnd I think I would prefer less than 3 different looking typeface styles in 3 blocks of words.\n\n"
    }
  ]
}
