{
  "id": "36539",
  "title": "When does Hrant get back?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is it just me, or is the place a little quieter around here without Hrant making all sorts of noise? I know some people have, lets just say, “different” opinions him, but he does have a knack for stirring up conversation.\n\nMaybe we should post our favorite Hrant moment in reflection?\n\n [‹ NEW font engine](http://web.archive.org/web/20080111001348/http:/typophile.com/node/34590 \"Go to previous forum topic\") [3 words and 3 typefaces - a challenge! ›](http://web.archive.org/web/20080111001348/http:/typophile.com/node/36230 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080111001348/http://typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": " 27.Aug.2007 9.57pm",
      "content": "From [one of the greatest free-form discussions](http://web.archive.org/web/20080111001348/http:/www.typophile.com/node/20337) I’ve ever participated in:\n\n“THE LITTLE PEOPLE always think what they’ve seen in their own lifetimes is what counts.” —Hrant\n\nI’m very short, and I was offended! Hrant is elfophobic! And we should do something about it! —ER  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nOne thing I’d say about hrant is I never got the feeling he was beating around the bush. I appreciate that.\n\nHe also never misinterpreted/misrepresented/blew out of proportion anything I said.\n\nI miss him.\n\n“BTW, my best line, when seeing them use three patrol cars and a helicopter to book a poor drunk sap: “Do you \\*\\*\\*\\* think you have enough people here?” Result: they followed me and gave me a ticket for a defective brake light (serves me right for exercising my free speech, gol’dangit\\*), but it was so worth it: you can’t BUY that kind of story.” —hrant\n\n"
    },
    {
      "time": " 27.Aug.2007 10.01pm",
      "content": "Where i he anyway?\n\n"
    },
    {
      "time": " 27.Aug.2007 10.02pm",
      "content": "“After all, all genocides are equally bad, but  \nsome genocides are more equal than others, eh?” —hrant\n\n"
    },
    {
      "time": " 27.Aug.2007 10.11pm",
      "content": "I believe he went to Cyprus for a while. I’m not sure why that prevents him from logging on, but if he’s taking a vacation, maybe he’s taking a vacation from the internets as well.\n\n"
    },
    {
      "time": " 27.Aug.2007 10.17pm",
      "content": "\\> I have a problem with hypocrisy.\n\n“Well, make sure not to really open your eyes then, since  \nthe fact that you’re engulfed in it would drive you nuts.” —hrant  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\\> I do not comment on things I don’t have a firm grasp of.\n\n“That’s certainly the best way to avoid encountering uncomfortable questions. The only thing I consider myself an expert on is being Hrant; and part of that involves exposing myself to dissent. Yes, it’s a lot more work.” —hrant\n\n"
    },
    {
      "time": " 27.Aug.2007 10.20pm",
      "content": "Here is to nice long uninterrupted vacations!\n\n"
    },
    {
      "time": " 28.Aug.2007 12.42am",
      "content": "A truly useless thread.\n\n"
    },
    {
      "time": " 28.Aug.2007 1.54am",
      "content": "Now be nice. How many are actually that useful?\n\nThis is a moment to reflect upon, good-naturedly, Typophile sans-Hrant. That’s all.\n\nNot every thread has to be spent upon declaring the wonders of the perfect notan of the counter on Hermann Slimbach-Renner’s futuristic, yet humane and chirographic, bold-italic small caps G.\n\n"
    },
    {
      "time": " 28.Aug.2007 2.20am",
      "content": "Discussing individual members on this (and others for that matter) forum while they’re away is in poor taste. You gotta problem with that?\n\n"
    },
    {
      "time": " 28.Aug.2007 8.34am",
      "content": "I look on it as a tribute to let him know he was missed. A t-shirt he ispired me to make:\n\n ![](http://web.archive.org/web/20080111001348im_/http:/typophile.com/files/hrantshirt2_5135.jpg)\n\n"
    },
    {
      "time": " 28.Aug.2007 8.38am",
      "content": "Dan, I agree with Frederik’s sentiment in the sense that talking about a person in a personal way on Typophile rather than about their work or their ideas or their comments can quickly become questionable. This thread does look a bit like an invitation to ’stir the pot’ rather than an opportunity to further anybody’s understanding. Do you disagree?\n\nOn the other hand Fredrik, you could of course not contribute to the thread. I should note that it is not always possible to know who is around & who is not \\*for sure\\*. So intensive checking every time somebody has a comment isn’t actually practical or reasonable.\n\nSo what I am saying is ’it’s the content’. And ’please keep it civil dudes’.\n\nThanks.\n\n"
    },
    {
      "time": " 28.Aug.2007 9.46am",
      "content": "Ditto to what Eben said. Let Hrant have a vacation.\n\n"
    },
    {
      "time": " 28.Aug.2007 12.04pm",
      "content": "\\>their work or their ideas or their comments\\<\n\nHere’s my thoughts on this:  \nImagine Hrant coming back, logging into Typophile, and finding a nice thread that has an interesting collection of his sayings or ideas assembled into one nice little package. In a sense, the history of Hrant IS the history of Typophile (along side others as well.)\n\nAnd I don’t know why I care, since I don’t, but doesn’t anyone else feel that a mature discussion can be had without people stepping in and saying “Hey, you guys can’t do that! You’re gonna flame someone!” or even worse, actually flaming someone? Now THAT is out of line.\n\nNo flamers allowed. Except James. But that’s another topic altogether :)\n\n"
    },
    {
      "time": " 28.Aug.2007 12.30pm",
      "content": "\\>\\> <cite>Imagine Hrant coming back, logging into Typophile, and finding a nice thread that has an interesting collection of his sayings or ideas assembled into one nice little package.</cite>\n\nYou are more than welcome to add it to the [TypoWiki](http://web.archive.org/web/20080111001348/http:/typophile.com/wiki/TypoWiki).\n\n\\>\\> <cite>the history of Hrant IS the history of Typophile</cite>\n\nThis being said, if you know the history of Typophile, you know exacty where this discussion will inevitably go.\n\n"
    },
    {
      "time": " 28.Aug.2007 12.54pm",
      "content": ":)\n\n"
    },
    {
      "time": " 28.Aug.2007 1.16pm",
      "content": "<cite>No flamers allowed. Except James. But that’s another topic altogether :)</cite>\n\nNo way dude! I just bought _Levis_ today.\n\n"
    },
    {
      "time": " 29.Aug.2007 4.59pm",
      "content": "Fontplayer: LOL. Way too funny.\n\nLighten up people.\n\nIt’s all harmless. I sense no ill intention. What has been said is more positive than anything. Hrant would appreciate it.\n\n"
    },
    {
      "time": " 29.Aug.2007 5.21pm",
      "content": "<cite>Fontplayer: LOL. Way too funny.</cite>\n\nI’m glad you can laugh. Sometimes I wonder if I am entertaining anyone besides myself. But I’m usually having so much fun that myself is enough.  \n; )\n\n"
    },
    {
      "time": " 29.Aug.2007 5.44pm",
      "content": "Didn’t Hrant post just the other day?\n\n"
    },
    {
      "time": " 29.Aug.2007 5.50pm",
      "content": "<cite>Didn’t Hrant post just the other day?</cite>\n\nI guess it is hard to slip one past you.  \n [http://www.typophile.com/node/34714](http://web.archive.org/web/20080111001348/http:/www.typophile.com/node/34714 \"http://www.typophile.com/node/34714\")\n\n"
    },
    {
      "time": " 29.Aug.2007 5.52pm",
      "content": "Like a hawk, man, like a hawk.\n\n"
    },
    {
      "time": " 29.Aug.2007 10.19pm",
      "content": "I got three emails from Hrant today. What the hell are you complaining about?\n\nGerald\n\n"
    },
    {
      "time": " 29.Aug.2007 10.27pm",
      "content": "Did any of them say why he is renouncing the posting leader throne to a series of usurpers?\n\n"
    },
    {
      "time": " 29.Aug.2007 10.45pm",
      "content": "The King is dead! Long live the Series of Usurpers!\n\n"
    },
    {
      "time": " 30.Aug.2007 12.31am",
      "content": "Call Stewf an usurper again and I’ll break yo’ kneecaps! :^P ;^) :^D\n\n"
    },
    {
      "time": " 30.Aug.2007 12.42am",
      "content": "Far be it for moi, Stewf’s Dingbat, to question the rightful heir to the throne. After all, did not Mr. Coles in fact post the very first, er... post?\n\n"
    },
    {
      "time": " 30.Aug.2007 2.23am",
      "content": "Funny thing - I have been away from Typophile for quite a while. I just got back on about a few weeks ago and the fist thing I noticed was the absence of Hrant. Glad to hear he is just ’out for a while’ as opposed to gone.\n\n—  \nMike\n\n"
    },
    {
      "time": " 30.Aug.2007 9.20am",
      "content": "<cite>Call Stewf an usurper again and I’ll break yo’ kneecaps!</cite>\n\nSurely you must admit that when it comes to a gamut-encompassing passion, Stewf is no hrant. I think you need Armenian blood for that.  \n; )  \nBecause of that passion, hrant would be near the top of Typophilers I’d like to spend a day with. It would have to be interesting. Especially since he seems to take as good as he gives. Encountering an opposing viewpoint on a controversial subject doesn’t trigger hysteria in him, as is apparently the case with some people.\n\n"
    },
    {
      "time": " 30.Aug.2007 11.28am",
      "content": "Hi all,\n\n\\>Is it just me,..\n\nNo, its not you.  \nWhen I entered typophile two months or so ago, I needed a few days to realize the presence of two charismatic personalities.  \nThe one is Raph through his silent, modest but very beautiful character designs and the other was Hrant throughout his dramatic good knowledge about the world of typefaces.  \nSo lets look forward what they will have to say in the future..;-)  \nSeriously, thanks for all the good knowledge everyone round here is willing to share.  \nGreat! Never expected this.\n\nStefan\n\n"
    },
    {
      "time": " 30.Aug.2007 2.22pm",
      "content": "\\> _The King is dead! Long live the Series of Usurpers!_  \nDuh! I did it the hard way while Hrant was still in top form.\n\nI miss Hrant. I’m also glad/sad not to see many posts from Miss Giggles lately. I think she raised more rants than Hrant.\n\n"
    },
    {
      "time": " 31.Aug.2007 1.26am",
      "content": "\\> The King is dead! Long live the Series of Usurpers!\n\nHas this something to do with Fry who is getting sucked by the next king of the planet of water beings? (from a painting frame opening at his back)  \n:-)\n\n"
    },
    {
      "time": " 31.Aug.2007 2.09am",
      "content": "Hrant on 29th August 2007 posted here:\n\n[http://typographica.org/001109.php#comments](http://web.archive.org/web/20080111001348/http:/typographica.org/001109.php#comments \"http://typographica.org/001109.php#comments\")\n\nand here:\n\n[http://typographica.org/001108.php#comments](http://web.archive.org/web/20080111001348/http:/typographica.org/001108.php#comments \"http://typographica.org/001108.php#comments\")\n\nDoes he now prefer to post at other sites?\n\n"
    },
    {
      "time": " 31.Aug.2007 5.45pm",
      "content": "<cite>“Encountering an opposing viewpoint on a controversial subject doesn’t trigger hysteria in him, as is apparently the case with some people.”</cite>\n\nI couldn’t agree more with this statement.\n\n"
    },
    {
      "time": " 2.Sep.2007 2.46am",
      "content": "“the history of Hrant IS the history of Typophile”\n\nIf this ís true, I’ld stop reading (and sometimes posting) here at once.  \nI wish Hrant a good - and a long - time on Zyprus or wherever he is.\n\nGeorg\n\n"
    },
    {
      "time": " 3.Sep.2007 11.12am",
      "content": "What I appreciate about Hrant is all the time & energy he has given to explaining his understanding, point of view, and ultimately knowledge of type to me. I am deeply appreciative. What I was trying to say before was that I want to encourage people on Typophile to continue to do that for each other rather than spending time variously praising or criticizing an individual or each other. I can’t make you do this of course, and moreover I doubt that Hrant would agree with me. Still, that’s what I think.\n\n"
    },
    {
      "time": " 3.Sep.2007 6.03pm",
      "content": "Eben,\n\nAgreed. There are many great people here who spend countless hours helping/contributing to this community. Hrant is just one of those people. So, kudos to you all.\n\n"
    }
  ]
}
