{
  "id": "36534",
  "title": "Have you ever bought a font you ended up detesting?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Please excuse any ignorance on my part, cause I’m fairly new to the study of typography and new to Typophile.\n\nOnly a year ago I started purchasing commercial fonts - to augment the usual collection available bundled with programs or shareware/freeware. Now I’m hooked...but I don’t have much $$ to invest in fonts and don’t have many clients yet, so I have to restrain myself!\n\nI was recently seeking a heavy, clean-looking, modern italic sans, and found Leitura Sans [http://www.myfonts.com/fonts/dstype/leitura-sans/italic-4/](http://web.archive.org/web/20081202191021/http:/www.myfonts.com/fonts/dstype/leitura-sans/italic-4/) on MyFonts - that worked well for my purpose. All the DS fonts were half-price that month, so I helped myself to some of the Leitura Roman text fonts too.\n\nNow I don’t like Leitura Roman text font at all, and asked myself why I bought it! [http://www.myfonts.com/fonts/dstype/leitura/](http://web.archive.org/web/20081202191021/http:/www.myfonts.com/fonts/dstype/leitura/) The PDF advert was so beautifully designed it deceived me...\n\nMostly, I detest the lower case “g” - it has little flag sticking up on the upper right like a cowlick. Rather than gracefully leading the eye to the next letter, it sticks out most unpleasantly. I can’t seem to get past that. Did you ever decide not to use a font because of a single letter?\n\nLast week a page on this site pointed me to a modern text font bundled with Powerpoint that I like better - Cambria.\n\nI know that someone is likely to tell me that Cambria sucks or is already becoming overused, but my question is this:  \nHave you ever made a misjudgement choosing type? and why?\n\n [‹ Kinetic Typography](http://web.archive.org/web/20081202191021/http:/www.typophile.com/node/36484 \"Go to previous forum topic\") [Zune ›](http://web.archive.org/web/20081202191021/http:/www.typophile.com/node/36561 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202191021/http://www.typophile.com/user/21120\" title=\"View user profile.\">dinazina</a>",
  "time": "<br>",
  "uid": "21120",
  "comments": [
    {
      "time": " 27.Aug.2007 2.42pm",
      "content": "Throwing a way a typeface because of one letter is like trashing your kitchen because you don’t like the drawer pulls. ;o)\n\nI will say DSType definitely has strong personalities, so you either get along with them or you don’t. That said, if it’s just the g that’s not doing it for you, modify it (provided the EULA allows it, of course).\n\n"
    },
    {
      "time": " 27.Aug.2007 3.07pm",
      "content": "Ha! If only, aluminum. I don’t have font-modifying software (yet...) All I can do is outline in Illustrator. Not too practical for that purpose.\n\nBut you didn’t answer my question!\n\n"
    },
    {
      "time": " 27.Aug.2007 3.20pm",
      "content": "I can’t think of something off the top of my head for myself, but I am sure everyone to some extent or another might have had a similar experience.\n\nThe strongest tools foundries have to sell their typefaces are the specimens. If they are well designed I will raise my hand with guilt that I find myself wanting to license the fonts.\n\nDino’s specimen demonstrates clearly how the g from the Leitura News was changed or designed to contrast with Leitura. Did you like you not notice it in the specimen? (Maybe I’m looking at a different specimen.) I actually think it is quite cute, but can imagine that once you’ve locked onto something you don’t like it won’t disappear. I have a few typefaces that I won’t license because of quirks I’ve noticed.\n\n"
    },
    {
      "time": " 27.Aug.2007 3.42pm",
      "content": "You’re right, the weird “g” clearly shows in the diagram.\n\nAt the time, I admired the chiseled, angular outline of the Leitura letterforms and preferred them over the rounded edges and curved brackets of the Leitura News.\n\nThe “g” flag bothered me only when I saw how it annoying looked with the other letters in a line of text...after I had bought it and started experimenting with it, of course.\n\nI’ve bought a number of fonts on impulse, but believed I had made a studied decision with Leitura, damn it.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nSpeaking of impulse, I have a weakness for juicy, beautiful retro designs like Nick’s Fonts. I have all of his older free ones and bought 5 or 6 of his commercial fonts. Not once have I used one for a job - it just gives me pleasure to play with them like a pair of frivolous shoes. Every time I tell myself: Okay, no more Nick’s Fonts, Dina, until you get a paying job using one of these...\n\nAt least with Nick’s I’ve never stop liking any, though I knew each was an unecessary purchase.\n\n"
    },
    {
      "time": " 27.Aug.2007 9.27pm",
      "content": "As a typesetter in New York - and can guarantee you I bought many fonts that I just didn’t like.\n\nBut you learn - that one day, a job will come along that will be perfect for that font...\n\nYes, even Comic Sans....\n\n"
    },
    {
      "time": " 28.Aug.2007 5.33am",
      "content": "<cite>But you learn - that one day, a job will come along that will be perfect for that font...</cite>\n\nJust the other day I was able to use Ecliptica italic in a poster headline. I’ve got loads of other fonts which I’ve yet to use, just waiting for the right project. Priori Sans is a good example, I almost used that recently but changed my mind at the last minute. And I bought Amplitude three and a half years ago, when it was really fashionable, and couldn’t find the right project for it! I’ve used it a couple of times, but not enough to do it justice. And now it isn’t so trendy anymore so I’ve effectively shelved it.\n\nOne of the funny things about big font collections, like the Bitstream Type Odyssey, is that you don’t really know what you’ve got for the first few years. Even now, I’m still feeling my way around. But I still want to buy more type!\n\n"
    },
    {
      "time": " 28.Aug.2007 8.37am",
      "content": "Thanks for the feedback, everyone; it’s very helpful.\n\nI would never have guessed that Amplitude is no longer trendy. It looks trendy to me, but of course a working design professional in the industry is much more conscious of trends. My customers would never know the difference. Frutinger and Amplitude would look the same to them. They would even be surprised that “trends” aand “fashions” in type exist.\n\nYou might guess they are not magazine publishers and high-end boutiques.\n\n"
    },
    {
      "time": " 28.Aug.2007 3.46pm",
      "content": "<cite>I would never have guessed that Amplitude is no longer trendy</cite>\n\nDon’t take my word for it, I just have a low boredom threshold!\n\n"
    }
  ]
}
