{
  "id": "36570",
  "title": "Manupulating existing font",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hi Everyone,\n\nI'm in the process of designing a logo for a client.  \nI've spent hours (actually days) trying to design my own letter system, but that seems to be taking too long. This is to be used for commericial pruposes, so ideally I'd be designing each letter from scratch.\n\nThis is my first job for a large client so I'm taking this seriously. I want to make sure I'm doing it right.  \nI found a gorgeous font that is so well suited for the logo. I've been manipulating the letters to personalize it for the company.\n\nI'm not sure whether I can actually do this.  \nWhat are the laws pertaining to font manipulation? Is there a percentage that needs to be altered?\n\nIf anyone knows a little bit about this, I'd greatly appreciate your advice.\n\nThank You.\n\n",
  "author": "Grabby",
  "time": "28 Aug 2007 — 2:58pm",
  "uid": "21194",
  "comments": [
    {
      "time": "28 Aug 2007 — 3:07pm",
      "content": "What is the font? Can't really answer your question without knowing the font. All foundries have different EULAs.\n\n"
    },
    {
      "time": "28 Aug 2007 — 3:16pm",
      "content": "Are you actually going to release this font—to the client or otherwise—or are you just altering the letters for use in the logo?\n\n"
    },
    {
      "time": "28 Aug 2007 — 3:18pm",
      "content": "Most logos are conceived from manipulated fonts and there isn't any restriction on the altering or usage. Once you puchase a font for repoduction you have the rights to create any shape or form from it. An example is the horizontal or vertical modification that is allowed in page making or graphic programs.\n\n"
    },
    {
      "time": "28 Aug 2007 — 3:42pm",
      "content": "Most EULAs allow (or at least don't disallow) the creation of logotypes as static images or even static outlines. What most (but not all) EULAs don't allow is the creation of a derivative font. I think we all assume or at least hope that you're considering the former option. No one at AT&T types A, T, &, T, death star to form the logo, they place an eps, bitmap, or use a logofont where the complete lockup is assigned to one key.\n\n"
    },
    {
      "time": "28 Aug 2007 — 3:42pm",
      "content": "I won't be releasing a new font.  \nI'll only be altering the letters for the logo.  \nThis happened to be a really well-designed Free font I found. I didn't purchase it.  \nI just went to the designer's website, where he has his free fonts posted. The download included only the font, no legal info attached. This font is posted on a few font sites, but there is no additional info. Only \"download here\" under the font name.\n\nThanks again for your help.\n\n"
    },
    {
      "time": "28 Aug 2007 — 3:46pm",
      "content": "I wonder if the source of the font might make things more tricky. My advice related to commercial fonts. In your case there could be issues. Is the font legitimate freeware, did the guy who posted it make it, is there a type designer lurking somewhere with a freaky license that prohibits commercial exploitation?\n\n"
    },
    {
      "time": "28 Aug 2007 — 3:57pm",
      "content": "I would really contact the foundry or let us know the foundry. We might be able to say for sure. Otherwise you are swimming in vaguely warm waters.\n\n"
    },
    {
      "time": "28 Aug 2007 — 8:16pm",
      "content": "it turns out this font did have a Read Me file attached, (just not posted on the source I originally got it from). So the Read Me says that I may use the Typeface for every kind of publication.\n\nI guess I'm safe then.\n\nsii -- I'm not sure I understand what you mean by \"derivitive font\"- I would like to alter existing letters from a font. I definitely don't plan on creating a new font derived from the original... only 10 letters (eesh, what a loooong logo!!! that's a whole other concern for another forum!)\n\n"
    }
  ]
}
