{
  "id": "36571",
  "title": "Emigre News [Matrix II OpenType Font Release]",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20070922195449/http:/typophile.com/user/7006 \"View user profile.\") : 28.Aug.2007 3.17pm \n\n ![](http://web.archive.org/web/20070922195449im_/http:/typophile.com/files/EmigreNews_6036.gif)\n  \n\n ![](http://web.archive.org/web/20070922195449im_/http:/typophile.com/files/MatrixIIEmail_6579.gif)\n\nMatrix II  \nA redesign by Zuzana Licko\n\nMatrix II is a complete reworking of the Matrix type family which was originally designed by Zuzana Licko in 1985. The redesign, which started in January 2007, was initiated by the need to create an OpenType version of Matrix. With the hood open, so to speak, Licko used the opportunity to make subtle changes and to fine tune many of the existing characters which were designed some 20 years ago. The contrast between thick and thin strokes was decreased in some instances, and overshoots were corrected. The width of various characters was adjusted and regularized. The cross stroke on the f was simplified on most weights. The design of the lower case g was revisited and an alternate single story version was designed and added to the OpenType version. Seven new fonts were also added to the family: a Semi Narrow, Semi Wide, Semi Tall, Inline Italic, and 3 weights of Italic - a less flamboyant version of Matrix Script. To clearly set this version apart from the original Matrix, and to avoid conflict with previous versions, its name was amended to Matrix II.\n\nTo read the full story behind the design and redesign of Matrix, please visit our website:  \n [http://www.emigre.com/EFfeature.php?di=105](http://web.archive.org/web/20070922195449/http:/www.emigre.com/EFfeature.php?di=105 \"http://www.emigre.com/EFfeature.php?di=105\")\n\nView and order all Matrix II fonts here:  \n [http://www.emigre.com/MatrixII](http://web.archive.org/web/20070922195449/http:/www.emigre.com/MatrixII \"http://www.emigre.com/MatrixII\")\n\nAvailable in Macintosh, Windows or OpenType formats.  \nRegistered customers may upgrade their Matrix fonts to the corresponding Matrix II or OpenType format for 50% of the Matrix II or OpenType price. To order an upgrade, please complete this [form](http://web.archive.org/web/20070922195449/http:/www.emigre.com/UpgradeForm.php).\n\nThe Matrix II OpenType fonts include the following features:  \nSmall Caps, All Small Caps, Proportional Old Style Numbers, Proportional Lining Numbers, Tabular Old Style Numbers, Tabular Lining Numbers, Superior Numbers and Scientific Inferior Numbers, Numerator and Denominator, Fractions and Arbitrary Fractions, Ornaments.\n\nHow to Order  \nTo order any items announced in this email click on the links in the text above or go to: [http://www.emigre.com](http://web.archive.org/web/20070922195449/http:/www.emigre.com/ \"http://www.emigre.com\")\n\nTo order via fax; print out the [fax form](http://web.archive.org/web/20070922195449/http:/www.emigre.com/EFax.php).\n\nContact Emigre  \nEmigre, Inc.  \n1700 Shattuck Ave., #307  \nBerkeley, CA 94709, U.S.A.\n\nEmail: sales(a)emigre.com  \nFax: (530) 756 1300\n\n",
  "author": "<a href=\"http://web.archive.org/web/20070922195449/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 28.Aug.2007 3.17pm",
  "uid": "7006",
  "comments": [

  ]
}
