{
  "id": "3657",
  "title": "Typography books for newbies",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I want to learn about good type design, elegant type layout and a small amount of history. What books would you recommend? I live in London, England so have a wide access to various design bookshops.   \n   \nPlease... I need inspiration!   \n   \nMatthew\n\n",
  "author": "matthew_dob",
  "time": "18 Oct 2002 — 10:15am",
  "uid": "600",
  "comments": [
    {
      "time": "21 Oct 2002 — 5:53am",
      "content": "Ruari McLean's Manual of Typography gives a good history of typography and design and is a very practical book. The only caveat is that it only goes up to the 80s so the digital side of typography is not addressed.   \nI also like Stop Stealing Sheep by Erik Spiekermann, it is a nicely illustrated introductory text.\n\n"
    },
    {
      "time": "11 Jan 2003 — 11:54am",
      "content": "Every one talks about 'The Elements of Typographic Style' by Robert Bringhurst [http://www.amazon.co.uk/exec/obidos/ASIN/0881791326/qid=1042314873/sr=1-1/ref=sr\\_1\\_2\\_1/026-8626606-6990000](http://web.archive.org/web/20131011034246/http:/www.amazon.co.uk/exec/obidos/ASIN/0881791326/qid=1042314873/sr=1-1/ref=sr_1_2_1/026-8626606-6990000)\n\n"
    },
    {
      "time": "12 Jan 2003 — 1:58pm",
      "content": "Yup, I read Stop Stealing Sheep. Good it was, too. I would recommend it to people who are interested in letters, whether or not they are typophiles.\n\n"
    },
    {
      "time": "13 Jan 2003 — 1:20pm",
      "content": "I don't know this book you mention, _Detailtypografie,_   \nbut I recommend the similarly titled _Detail in Typography_,   \nby Jost Hochuli (Compugraphic, 1987). It's instructive to   \nthe newbie and a pleasure to the veteran. It's out of   \nprint, but it does turn up now and then on the used-book   \nservices. I've recently bought a copy in English (the   \noriginal is in German, of course).   \n   \nR\n\n"
    },
    {
      "time": "14 Jan 2003 — 1:55am",
      "content": "you can find detailtypografie at amazon:   \n   \n [http://www.amazon.de/exec/obidos/ASIN/3874395685/qid=1042538030/sr=2-1/ref=sr\\_aps\\_prod\\_1\\_1/302-1473027-7508846](http://web.archive.org/web/20131011034246/http:/www.amazon.de/exec/obidos/ASIN/3874395685/qid=1042538030/sr=2-1/ref=sr_aps_prod_1_1/302-1473027-7508846)   \n   \ni read it too and its recommendable.\n\n"
    },
    {
      "time": "26 Apr 2003 — 8:45am",
      "content": "Yes, definitely Bringhurst!\n\n"
    },
    {
      "time": "15 May 2003 — 9:50am",
      "content": "Don't forget to visit our Books List: [http://typophile.com/books](http://web.archive.org/web/20131011034246/http:/typophile.com/books)\n\n"
    },
    {
      "time": "18 May 2003 — 7:02pm",
      "content": " **The non-designer's design book - Design and typographic principles for the visual novice** by Robin Williams; a very nice and informal way to look at Typography and start using it correctly.   \n   \nIn [http://www.typebooks.org/](http://web.archive.org/web/20131011034246/http:/www.typebooks.org/) you'll find a complete typographic bibliography.   \n   \n ![book cover](http://web.archive.org/web/20131011034246im_/http:/www.typophile.com/forums/messages/4100/10907.jpg)\n\n"
    },
    {
      "time": "9 Jun 2003 — 4:48pm",
      "content": "out of the five or so books on the subject \\<joke\\> bringhurst's book is good. i think stop stealing sheep is kind of weak. as far as books on letterforms my old teacher from art center has a book out called font's and logos which is very comprehensive. the authors name is doyald young.\n\n"
    },
    {
      "time": "16 Jun 2003 — 7:01am",
      "content": "To me Gill's little book is very serious. It puts type in the context of society, exposing some deeply-rooted problems. The fact that many people today might think it's \"strange\" is simply that we've been brainwashed into loving industrialization over the past 100 years. I think when Gill's book came out, there were a lot more people who \"got it\".   \n   \nAccording to the colophon\\*, \"Essay\" was in fact the first use of Joanna. And the later 1936 edition was set in foundry, not Monotype.   \n   \n\\* It has two: one on page 4 and one at the end. I'm not sure the first one can be called a \"colophon\".   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jul 2003 — 2:15pm",
      "content": "i really love emil ruder's _Typography_ you can get it on [amazon](http://web.archive.org/web/20131011034246/http:/www.amazon.com/exec/obidos/tg/detail/-/3721200438/qid=1059167528/sr=1-1/ref=sr_1_1/002-9289298-5240862?v=glance&s=books) but it's cheaper on [YWFT](http://web.archive.org/web/20131011034246/http:/youworkforthem.com/product.php?sku=P0005)... those are the nice hardcover versions... mine is older and paperback, but i love it. (did i mention i love it?)\n\n"
    },
    {
      "time": "25 Jul 2003 — 2:27pm",
      "content": "\\> i really love emil ruder's Typography   \n   \nReally?   \nThe way it treats the three languages identically bothers me a lot, not least functionally: there are spots (like in some illustration captions) where you have to make an extra effort to know where to start reading.   \nWay too much Modernism.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jul 2003 — 2:35pm",
      "content": "_Type & typography_ by Phil Baines and Andrew Haslem is a great book for beginners as well as those with more experience. It approaches type first and foremost from the linguistic point of view in a section called 'function', then move onto 'form', where history and classification are discussed in great details. The third section is about the designing and manufacturing of type. The next section is titled 'Structure', where hierarchy, grid, and the fine points about setting type are covered. The last section is 'Conventions', the 'rules' of setting text type, if you will. The whole book is illustrated throughout with relevant and engaging examples, The main running text set in Swift in a large point size and 'sidebars' set in a smaller Meta that goes into more depth about each issue discussed. I highly recommend this book. I think it's one of the best, most comprehensive and least biased I've seen so far. It is quite a brilliant achievement: it has a lot of depth and students are going to _like_ reading it because it actually _looks_ so interesting. Along with Bringhurst, it's going to be required reading for my type class.\n\n"
    },
    {
      "time": "25 Jul 2003 — 2:35pm",
      "content": "\\> Really?   \n   \nreally. i wasn't bothered by the extra languages... but then again i wasn't bothered by the german in the weingart book either. then again, i'm one of those people who aren't bothered by subtitles in films. (did i mention i wasn't bothered?)   \n   \ni'm getting out of hand ;)   \n   \ni found it very informative; it made sense to me. and i still go back to it every so often, as reference.\n\n"
    },
    {
      "time": "25 Jul 2003 — 2:37pm",
      "content": "Hrant, you're going to like this book. It's so post-modern :-P   \n   \nI love Phil Baines's work!\n\n"
    },
    {
      "time": "25 Jul 2003 — 2:45pm",
      "content": "I must say, I quite like Ruder myself. But more as an artifact really - not as a current resource or how-to book or entry point for someone. I'm not one to say modernism didn't (doesn't) have its fair share of problems...\n\n"
    },
    {
      "time": "25 Jul 2003 — 2:55pm",
      "content": "\\> Type & typography ... is quite a brilliant achievement   \n   \nI agree. Maybe the best single \"textbook\" out there.   \n   \nThe only thing that bugs me is that they go to all that wonderful trouble of setting up typography with speech, writing and all, but... did you notice... _nothing_ about how we actually _read_! :-/ The whole point, really.   \n   \n--   \n   \n\\> i'm one of those people who aren't bothered by subtitles in films.   \n   \nI'm envious. I have a lot of trouble watching a foreign movie in a language I know because I can't help reading the subtitles. Same thing with the opera these days - those stinky surtitles - guys, you're supposed to know the story before you get there anyway, you know?! The point in opera is the delivery. And to me the only really good thing about DVDs is that you can turn the subtitles off. I even like watching foreign movies that I _can't_ understand - they often make more sense that way. Like before I knew Spanish I enjoyed Mexican TV much more. And one time I was watching Ran, and I called the station yelling at them to turn of the subtitles...   \n   \nNow _I'm_ getting out of hand...   \n   \nOne thing I found definitely kind of innovative in Ruder's book is that page where they compare regular and irregular spacing of letters of different structures, with carefully selected words set large. That was sharp.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jul 2003 — 2:59pm",
      "content": "\\> And one time I was watching Ran, and I called the station yelling at them to turn of the subtitles...   \n   \nhahahaha! fantastic.\n\n"
    },
    {
      "time": "25 Jul 2003 — 3:09pm",
      "content": "Hrant, you're right, nothing on the reading process. :-(\n\n"
    },
    {
      "time": "25 Jul 2003 — 3:12pm",
      "content": "Ovink would be a good supplement to Baines.\n\n"
    },
    {
      "time": "25 Jul 2003 — 3:17pm",
      "content": "\\> nothing on the reading process.   \n   \nProbably because that's a book by itself. But still, some stuff about saccades and such would've been nice. Ovink might be too heavy.   \n   \nBTW, speaking of video titling, I've always loved the Chinese tradition of freezing the action and showing a person's name in huge vertical letters, with a gong. To me that beautifully leverages the surreal nature of video.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jul 2012 — 5:59pm",
      "content": "...\n\n"
    },
    {
      "time": "25 Jul 2003 — 4:08pm",
      "content": "That's definitely a great one. And fortunately bookfinder.com seems to show two copies currently available (for $50). Just be careful, Frutiger has at least one other book (also a good one, but not as good for type design) with a very similar title (and that one I think is still in print).   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jul 2003 — 4:54pm",
      "content": "Jan Tschichold - The New Typography   \n   \nEric Kindel - Typeform Dialogues   \n   \nThe typography of William Caxton ( well. this one is $$$$$ - first edition 1861-1863).   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": "25 Jul 2003 — 5:38pm",
      "content": "Kindel & Dixon's book/CD-ROM isn't out yet. Well, I assume it isn't since I've been on the waiting list for ages! It promises to be a real gem.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jul 2003 — 1:19pm",
      "content": "can't you veterans suggest a couple must-have books on the basics of typography? from what everyone has posted so far, I should have been born a millionaire in order to just start learning about it.(any explanatory websites would be great too)\n\n"
    },
    {
      "time": "26 Jul 2003 — 7:35pm",
      "content": "Tiffany,   \n   \nyes i do. but - about Reading - doing what?   \n   \nthis paper or academic paper is pure knowledge. it is about history. culture.   \n   \nthis kind of paper - MUST!!!   \n   \ni think the problem with young people, students (and part of this problem is because of the school/university) - that they are looking for shortcuts. they are looking for \"how to\" books.   \n   \ne.g. a post by a guy(not here). he wrote, more or less, : i am new to fonts. i am looking for a book about metrics.   \n   \nthe problem: he wants to create a typeface. but he does not know what is a typeface. just to buy FontLab or Fog....you can't create a typeface.   \n   \nSteven Heller, the Great Heller wrote ( about illustration - but i think you can say type design/ graphic design etc., etc., ) :   \n   \n\"...At most art schools, despite the requisite nod to the liberal arts, the student is not exposed to or encouraged to take part in classes about literature, sociology, psychology, or history...   \n   \n\"Having a liberal education will not necessarily guarantee a rosy illustration career, BUT neither will an art school education. What liberal arts WILL facilitate is a better understanding of subjects and themes that an illustrator will encounter in a majority of assignments.....   \n   \n\"......Without THESE TOOLS AN ARTIST CAN MAKE AESTHETICALLY PLEASING PICTURES.....BUT BEING VISUALLY LITERATE IS NOT SIMPLY A MATTER OF TURNNING A CIRCLE, SQUARE AND CONE INTO A CAT OR DOG, BUT ASSIMILATING, SYNTHESIZING AND TRANSLATING HUMAN KNOWLEDGE AND EXPERIENCE INTO VISUAL TERMS.\"   \n   \nthat is why this paper is must. and not just this paper.   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": "26 Jul 2003 — 8:23pm",
      "content": "I think part of being a typographer/type designer is having a large library, and spending a fortune on books :-P   \n   \nIf _Typeform dialogue_ is out, I want to buy it right now! I, too, have seen a demo of it (in 2001) and was throughly impressed. Definitely a great tool for learning.   \n   \nI agree, Tiffany. _The Nymph and the Grot_ is great and it offers quite a unique pespective on the early developments of sanserif letterforms.   \n   \nRobin Kinross's _Modern typography_ is a great book on the historical developements in the twentieth century. But, imho, the typographic design itself makes for a rather uncomfortable reading experience.   \n   \nThere are so many books that I want to recommend. Here are a few that I think are great (sans comments or details, sorry):   \n   \n_Writing, lettering, & illuminating_   \nEdward Johnston   \n   \n_A book of scripts_   \nAlfred Fairbank   \n   \n_An essay on typography_   \nEric Gill   \n   \n_Letterletter_   \nGerrit Noordzij   \n   \n_Elements of typographic style_   \nRobert Bringhurst   \n   \n_Graphic design & reading: explorations of an uneasy relationship_   \nGunnar Swanson, ed.   \n   \n_Twentieth century type designers_   \nSebastian Carter   \n   \n_Letters of credit_   \nWalter Tracy   \n   \n_Type, sign, symbol_   \nAdrian Frutiger   \n   \n_The visible word_   \nHerbert Spencer   \n   \n_Texts on type: critical writings on typography_   \nSteven Heller and Philip Meggs, eds.\n\n"
    },
    {
      "time": "26 Jul 2003 — 10:12pm",
      "content": "\\> spending a fortune on books   \n   \nOr have access to a [really] good library. I worked for UCLA for a couple of years, and I still get to use their stellar library resources, including doing ILLs of just about anything ever printed! Like I certainly couldn't afford Enschede's glorious 1908 specimen book (~$1200 market value, and worth the quadruple price of the 1978) but I recently got to scan it up the wazoo.   \n   \nBTW, don't forget Alexander Lawson's \"Anatomy of a Typeface\". It's way up there.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jul 2003 — 10:27pm",
      "content": "\\> \\> _Or have access to a [really] good library._   \n   \nSure. The library at Emily Carr here in Vancouver is not the best, but it does have quite a well-stocked typography section, as well as a number of books on calligraphy and lettering.   \n   \n\\> _BTW, don't forget Alexander Lawson's \"Anatomy of a Typeface\". It's \\> way \\> up there._   \n   \nYes, Hrant, you're right. Lawson is a good read. But I remember the copy at Reading University's library has been scribbled all over with comments that challenge the historical accuracy of a particular chapter (I forgot which one it was). I also remember someone from Reading saying that it is a bit iffy on historical facts. Don't quote me on that.\n\n"
    },
    {
      "time": "27 Jul 2003 — 1:58am",
      "content": "I'm quite fond of Bringhurst myself. It was the first book on type that I read.   \nIt's a great introduction to the world of type.\n\n"
    },
    {
      "time": "21 Oct 2002 — 2:25pm",
      "content": "_Stop Stealing Sheep_ is in its second edition   \nas of this past summer. (It is available in the US,   \nbut I'm not sure about the UK.)\n\n"
    },
    {
      "time": "13 Jan 2003 — 3:48am",
      "content": "Bringhurst is (very) good. For advanced reading & typography I recommend **\"Detailtypografie\"** from Forssman and de Jong, (you can find it [here,](http://web.archive.org/web/20131011034246/http:/www.amazon.de/exec/obidos/ASIN/3874395685/302-5165728-4145668) the german Amazon). It's in german, but it's got everything in there. There's also a book by Adobe Press that got some good reviews: **The complete manual of typography,** by Jim Felici. see it at [amazon.](http://web.archive.org/web/20131011034246/http:/www.amazon.com/exec/obidos/tg/detail/-/0321127307/qid=1042458374/sr=1-6/ref=sr_1_6/102-8600257-8794548?v=glance&s=books) I like Detailtypografie more tough...\n\n"
    },
    {
      "time": "25 Jul 2003 — 4:46pm",
      "content": "Historically narrow, but very interesting, is James Mosley's \"the Nymph and the Grot\".\n\n"
    },
    {
      "time": "25 Jul 2003 — 5:02pm",
      "content": "Type & Typography. Just released by Mark Batty Publishers. (Look in the books section, first page) Great book for those that want an introduction from several authors. Articles are all compiled from past Matrix printings.\n\n"
    },
    {
      "time": "25 Jul 2003 — 5:09pm",
      "content": "David -- have you actually seen Eric's book? I saw a preview of it in '99 (maybe '00) when I was at Reading. What do you think of it? I'd love to hear a review from someone that has used it. At the time it looked very interesting, as well as something an educator could really use.\n\n"
    }
  ]
}
