{
  "id": "36580",
  "title": "(x) Battlestar Galactica science fiction sans - Handel Gothic {Geoff Riding}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi I am new to this site, its really useful to have a forum like this if we ever need to identify a type face isn’t it?!\n\nAnyway, I am looking for a particular typeface. I’m sure you’ve all seen it, it is used in a lot of science fiction contexts (it is the typeface used on the battle star galactica dvd boxes underneath the title) and I think the commonly found Terminator 2 font is a mod of it, however the the “A”’s are most definitely very different. I’ll post an image of it too just to clear up any doubts.\n\nThanks in advance!\n\n ![](http://web.archive.org/web/20081025103739im_/http:/typophile.com/files/fontExample_5401.jpg)\n\n [‹ (x) Blocky condensed serif, a little western - Neo Contact {Yves}](http://web.archive.org/web/20081025103739/http:/typophile.com/node/36732 \"Go to previous forum topic\") [(x) Geometric sans on Hospitality flyer - Futura {Florian} ›](http://web.archive.org/web/20081025103739/http:/typophile.com/node/36686 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025103739/http://typophile.com/user/21212\" title=\"View user profile.\">viceversarohan</a>",
  "time": "<br>",
  "uid": "21212",
  "comments": [
    {
      "time": " 28.Aug.2007 11.36pm",
      "content": "[Handel Gothic](http://web.archive.org/web/20081025103739/http:/www.myfonts.com/fonts/bitstream/handel-gothic/)\n\n"
    },
    {
      "time": " 3.Sep.2007 1.30am",
      "content": "Thanks so much!\n\n"
    },
    {
      "time": " 3.Sep.2007 6.57am",
      "content": "No worries, always a pleasure to help out.\n\n+ and Battlestar Galatica is one kickarse show.\n\n"
    },
    {
      "time": " 3.Sep.2007 7.06am",
      "content": "Damn straight. Last night was the Season 1 finale here in Belgium, and _what_ a finale it was! =^O\n\n"
    },
    {
      "time": " 3.Sep.2007 7.09am",
      "content": "Dude, you Belgians are way behind. Even in Germany we’ve gotten through season 2 already.\n\nI watched Season 1 through 3 via the iTunes Music Store. But I guess that won’t be an option for the tv-movie in November or the fourth season, if Univesal really does pull all of its tv shows from iTunes :(\n\nMaybe I’ll be able to see Galactica on UK television while I’m living there…\n\n"
    },
    {
      "time": " 3.Sep.2007 7.09am",
      "content": "You’re late in Belgium ;-)\n\n"
    },
    {
      "time": " 3.Sep.2007 7.10am",
      "content": "Oh, just wait till the start of season two, bloody awesome, on-the-edge-of-your-seat stuff! :^)\n\n"
    },
    {
      "time": " 3.Sep.2007 7.14am",
      "content": "_Last night was the Season 1 finale here in Belgium, and what a finale it was!_\n\nYves, I recently started watching the show on rented DVDs, and saw the Season 1 finale a couple of nights ago. :-)\n\nKick-arse show is right! So many good things about it. And it really draws you in.\n\n"
    },
    {
      "time": " 3.Sep.2007 8.24am",
      "content": "\\> _Dude, you Belgians are way behind._\n\n\\> _You’re late in Belgium ;-)_\n\nYeah, it sucks to live in a developing country. :^P\n\n"
    }
  ]
}
