{
  "id": "36582",
  "title": "Critique of magazine logo design",
  "forum": "Design",
  "tags": [

  ],
  "content": "A group of my friends, writers, are wanting to start a small magazine called Elementes. I was tapped to do the design, starting with the masthead. (EDIT: Logo) (Actually, does anyone have any advice for the steps in designing an entire magazine from scratch?)\n\nSo anyway, here’s the proposed masthead (EDIT: Logo) that I’m working with:\n\n ![](http://web.archive.org/web/20090608103009im_/http:/typophile.com/files/elementes_4139.png)\n\nAny comments or critique?\n\n",
  "author": "<a href=\"/web/20090608103009/http://typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": " 29.Aug.2007 4.44am",
      "content": "I feel there’s something not quite kosher about the connections. El looks strange & the ‘elastic’ connection between m and n has no logic at all.\n\nWhy not try to work with ‘elements’ in a typographic way.\n\n(BTW: A masthead can not be seen separate from the rest of the cover(art) — you should take that into account.)\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 29.Aug.2007 6.29am",
      "content": "What kind of magazine will it?\n\n"
    },
    {
      "time": " 29.Aug.2007 11.51am",
      "content": "Just random elements of stuff mostly. An art and literary rag. The cover is supposedly going to have a “designed” cover rather than a photograph, and it should look different each time except the masthead.\n\n"
    },
    {
      "time": " 29.Aug.2007 1.22pm",
      "content": "\\> BTW: A masthead can not be seen separate from the rest of the cover(art) — you should take that into account\n\nReally? Every issue would use a different picture with a different color scheme, but generally the logo (it isn’t a masthead) should appear the same. Or do you mean meta elements like story callouts and such?\n\n"
    },
    {
      "time": " 29.Aug.2007 2.03pm",
      "content": "Hi there,\n\nSeeing the logo, i dont realise what the magazine is about...\n\nIf you are going to make a logo with typography, I’d recomend you to use it as an image, like a metaphor. For instance:\n\nHerb Lubalin was very good at this, here are some EXELLENT examples:\n\n ![](http://web.archive.org/web/20090608103009im_/http:/typophile.com/files/families_4086.jpg)\n  \n\n ![](http://web.archive.org/web/20090608103009im_/http:/typophile.com/files/mother_4591.jpg)\n\n[Mother & Child was a logo for a magazine that has never been published. It was designed by Herb Lubalin and Tom Carnase in 1965. Families logo was designed in 1980 and Marriage in 1965, by Lubalin.]\n\n{These logos are different combinations and manipulation of letters and they show the power of ideas in the hands of a master.}\n\nSo, i’d investigate the profile of the magazine, intrests, topics, public, etc...  \nthen the name: why do you think they choose that name?\n\nAfter that, you could think how to represent the magazine ideas in one logo, with typography, sounds easy, right? haha :P\n\nHope that my point of view helps\n\nFerch\n\nPS: My native thongue is spanish, sorry for the miss spels and hope you understand\n\n"
    },
    {
      "time": " 30.Aug.2007 12.45am",
      "content": "\\>Every issue would use a different picture with a different color scheme, but generally the logo (it isn’t a masthead) should appear the same.\n\nThe compostion of the masthead\\* on the page is important in the case of magazines, are the black bars part of the masthead, what are the dimensions of the magazine? Since the group behind it are writers I suppose you should start your design with the proportions and then work on a grid that favours type over image (I assume there will be more type than you might budget for in a ‘normal’ magazine).\n\nTim\n\n\\*I don’t disagree with Don, let’s call it that for clarity\n\n"
    },
    {
      "time": " 30.Aug.2007 4.28am",
      "content": "\\> are the black bars part of the masthead\n\nGawd, I hope not.\n\n"
    },
    {
      "time": " 30.Aug.2007 11.27am",
      "content": "The black bars aren’t part of the logo.\n\nIn any case, the magazine will be heavily text based, ALA the New Yorker or something, but much more artsy. And the design will be much more varied.\n\nSince I made the goof, I should know better really, of calling the logo a masthead, is there any resources that you know of that list all of the different elements of a magazine? I’d like to really get inside of what makes a magazine tick. Guess I should do a Typophile search...\n\n"
    },
    {
      "time": " 30.Aug.2007 8.37pm",
      "content": "Dan, before delving into designing a magazine from SCRATCH, I recommend getting some books on [magazine design](http://web.archive.org/web/20090608103009/http:/www.amazon.com/s/ref=nb_ss_gw/103-0346915-5618242?initialSearch=1&url=search-alias%3Dstripbooks&field-keywords=magazine+design&Go.x=11&Go.y=9&Go=Go) or [publication design](http://web.archive.org/web/20090608103009/http:/www.amazon.com/s/ref=nb_ss_b/102-0505973-3098567?initialSearch=1&url=search-alias%3Dstripbooks&field-keywords=publication+design&Go.x=11&Go.y=13&Go=Go).\n\nA magazine should have a distinctive look and feel that, ideally, will set it apart from the competition... You might want to start by having a flexible underlying page grid that allows you to set up the different sections (features, fiction, interviews, letters, editorial, etc.)...\n\nGo to your local magazine stand and look at the competition... See what you like and also what you don’t like... Check out what works and what doesn’t.\n\nAlso, speaking from personal experience doing a magazine for a group of writers, know what YOU want for the design of the magazine, and be prepared to defend it!\n\n"
    },
    {
      "time": " 1.Sep.2007 6.36am",
      "content": "The 13 column page grid pioneered by Willie Kunz is a good place to start. Will Hopkins of Hopkins/Baumann worked with Kunz early in his career, and H/B’s work is heavily influenced by that very flexible grid.\n\nJames\n\n"
    },
    {
      "time": " 1.Sep.2007 6.39am",
      "content": "Also, regarding the logo: What is the significance of the lowercase e being cradled by the m and n?\n\nJames\n\n"
    },
    {
      "time": " 1.Sep.2007 7.22am",
      "content": "The first issue was to have a central theme of ’water’, so the idea was thrown around that it would be something like a water droplet. Perhaps squeezing them together more at the top an pushing the e down will accomplish this effect more?\n\n"
    },
    {
      "time": " 1.Sep.2007 7.37am",
      "content": "_The first issue was to have a central theme of ’water’, so the idea was thrown around that it would be something like a water droplet._\n\nOK, but then will the logo remain this way throughout the life of the publication? Or will it change with every issue, reflecting the central theme of each one? You can have it either way, but be sure to think all of the possibilities through. For example, if you keep this logo the way it is for subsequent issues where the central theme is not water, what will readers make of the cradled **e**?\n\n"
    },
    {
      "time": " 1.Sep.2007 11.48pm",
      "content": "It IS Helvetica after all, so I guess adding a little bit of a different character to it each time might be interesting. We’re only planning on having six issues a year, so pre-planning the themes might allow for some interesting dialog with the logo as the year rolls on.\n\n"
    },
    {
      "time": " 2.Sep.2007 3.03am",
      "content": "The concept is not clear. I don’t understand why the “e” is being cradled. Can you explain—or is it simply for difference sake?\n\n"
    },
    {
      "time": " 2.Sep.2007 10.50am",
      "content": "Dan, I think that what Ferch, James, Hildebrant and I are talking about is not whether the logo is well-executed or not... It is about what the logo is communicating about the magazine to the reader.\n\nTo put it another way: does the current logo tell Joe Bookfiend, who is casually perusing magazines at the bookstore, anything about the content or mission of **Elementes** magazine? Because to me, it is not transmitting the idea that this is “[a]n art and literary rag”. Compare that to the logos that Ferch posted... they cleverly pun on the name and content of the magazines. The reader gets what each magazine is about without ever having to look at any headlines. While you don’t _always_ have to arrive at that kind of solution (a visual pun), these logos show that the designer put some thought into what he was trying to communicate. And that is what design is all about — thinking ahead, planning, looking at things from every possible angle with a critical eye... knowing what you want to say, before you take pen to paper and start sketching.\n\nMaybe what I said before about the cradled **e** needs to be re-stated: you say that the central theme of the first issue was to be “water” — if that were the theme of every issue, or the reason for the magazine, then sure, make part of the logo look like a water droplet. But if water is (or was) only the theme of the first issue, what will happen with the second issue? What will readers make of a logo that simulates a water droplet in an issue whose main theme is something completely different from water? And if the theme of the first issue is no longer water, as your comment seems to imply, then there is even less reason for keeping the cradled **e**. Don’t hold on to an idea just because you’ve grown fond of it. Make sure it says something.\n\nSo I think it’s a good idea to go back and come up with more logo ideas, or different ones. Or think through your logo strategy — because there is no one “right” way to do this, no single “correct” solution. You could have the logo change with every issue, as we’ve both mentioned, always reflecting the theme of that issue and establishing a connection with the readers that way. Or you could come up with an entirely different concept that never changes. But this current logo idea, the cradled **e** , might seem anecdotal after a couple of issues, not to mention perplexing. You shouldn’t make your readers guess at what they’re looking at — they might move on to the next magazine on the stand and not bother to pick this one up.\n\nSpeaking of guessing, I suppose the name of the magazine has something to do with the natural elements — is that correct? Is there any special reason that the name of the magazine seems to be spelled in a foreign language? Those are also considerations if you are designing the magazine and the logo.\n\n"
    },
    {
      "time": " 2.Sep.2007 12.40pm",
      "content": "My first reaction was that it could be a logo for a skateboard company/magazine (and since there is a company called Element this could have been their mag). A ramp with a guy riding it.  \nWhen it comes to designing a magazine from scratch it is as already stated a good start to check out other publications that is in the same field. You should check out Monocle, it’s awesome. Then sit down with the writers/staff, decide what exactly the magazine will be made of, and start doing a page or two, and keep adding and removing stuff as you go along.\n\n"
    },
    {
      "time": " 2.Sep.2007 2.44pm",
      "content": "i’ve always described the process in terms of “architecture” and “furniture” (not my words). the architecture refers to the structural design elements, obviously, and the furniture those elements that can be easily rearranged, moved, omitted, inserted...\n\n"
    },
    {
      "time": " 2.Sep.2007 2.49pm",
      "content": "frankly, i’m not crazy about the ’cradled drop of water’ deal, or the alteration of the logo to suit the content of the issue. first of all, your name is elementes, and while water is an element(e), unless your next issues are earth, wind and fire, your visual joke won’t make much sense. additionally, taking that poor helvetica and manipulating it EVERY isssue is going to be a problem; sometimes you’ll be able to pull it off, but just as often, i’m afraid it will look forced. the water tie-in already looks forced, and it’s the first one!\n\n"
    },
    {
      "time": " 2.Sep.2007 6.20pm",
      "content": "The way you are spelling Elementes is not a standard spelling in English, so mucking around on an issue-by-issue basis with the logo seems like a long row to hoe.\n\nPerhps it would be better to come up with some stunning word mark and leave it at that. That whole visual pun thing that Lubalin was so good at is really rather difficult to pull off. Most of his logos never really saw the light of day anyway.\n\n"
    },
    {
      "time": " 6.Sep.2007 8.26am",
      "content": "I can see that this design is leading towards the destijl look... the bars are too heavy with the type. I like the san serif ... I am agreeing that the “u” is redundant unless there is a reason for it. What kind of magazine is elements anyway? Who are the target audience? The elements could be in blocks to make up the words? Maybe something could be 3D?\n\nIf there are any doubts.. lets fall back to our basic design principles... are there contrast in shapes, size, space, texture, weight?\n\nThink with the whole body and soul. — AD Shamiko\n\n"
    },
    {
      "time": " 6.Sep.2007 8.36am",
      "content": "I agree with James. A magazine’s logo isn’t the place to be different every month. You’ll lose readers or they just will get annoyed by having to find it all over again the next month.\n\n"
    }
  ]
}
