{
  "id": "36591",
  "title": "Remarkable ‘value’ for money",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In a discount multimedia store I just bought a font collection of 5000 Macintosh typefaces for 25 eurocent (that’s 34.1 dollarcent by today’s exchange rate). Who can better that? ; )\n\n(It’s a Fantazia collection from 1994. A book with a cd-rom and all rubbish, of course)\n\n [‹ A moment of kindness to Typophile and friends...](http://web.archive.org/web/20081202195033/http:/www.typophile.com/node/36566 \"Go to previous forum topic\") [Gutenprint hp drivers for Tiger--DPI limits ›](http://web.archive.org/web/20081202195033/http:/www.typophile.com/node/36524 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202195033/http://www.typophile.com/user/3972\" title=\"View user profile.\">bert_vanderveen</a>",
  "time": "<br>",
  "uid": "3972",
  "comments": [
    {
      "time": " 29.Aug.2007 6.44am",
      "content": "Wow, that should be the record! € 0,00005 a font …\n\n"
    },
    {
      "time": " 29.Aug.2007 7.15am",
      "content": "Did you actually check all 5000 typefaces? I bet there were good ones among them, i.e. the ripoffs.\n\n"
    },
    {
      "time": " 29.Aug.2007 8.34am",
      "content": "Nah, 99% trash — fonts slanted, slanted more, slanted left, right, extended, extended more, shadowed, doubleshadowed, outlined, inlined, distorted, roughened, striped, warped, mangled, outlined/shadowed, spotted, hollowed, shadowed/slanted, and all variants possible of these atrocities. Hah!\n\nThe PC-version comprises 6000 Fonts, with possibly even more ‘work’ done to these poor fonts.\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 29.Aug.2007 2.54pm",
      "content": "Wow, I once paid $10 for one of those things. All junk. I feel ripped off now. (But probably not as much ripped off as designers whose designs were ripped off.)\n\n"
    },
    {
      "time": " 29.Aug.2007 4.28pm",
      "content": "$10 is nothing. I once fell for the $14.95 [6,000 fonts download](http://web.archive.org/web/20081202195033/http:/www.1001freefonts.com/ultimatedownload.htm).\n\n"
    },
    {
      "time": " 29.Aug.2007 4.52pm",
      "content": "<cite>I feel ripped off now.</cite>\n\nI feel sorry for the poor people who don’t know any better than to think it is a great buy.\n\nThen again, I have found a really creative person can take junk and make magic out of it.I bet if we had a contest to see who could make something cool out of an inlined, outlined, spotted, mangled, back-slanted font, someone would knock it out of the park.\n\nOh well, life goes on...\n\n(edit)\n\n"
    },
    {
      "time": " 29.Aug.2007 9.36pm",
      "content": "It’s not too different from getting thousands of clip art images for a ridiculous price, is it? Someone had to _draw_ (or at least trace) all of those images... Yes, life goes on... and it gets cheapened, too. :-/\n\n"
    },
    {
      "time": " 29.Aug.2007 9.43pm",
      "content": "<cite>It’s not too different from getting thousands of clip art images for a ridiculous price, is it?</cite>\n\nThat’s different. Everybody expects clip art to suck, when it doesn’t people assume it’s a commissioned illustration (at least I do). I think that there’s an innate expectation, or even assumption, of legibility and thus quality when it comes to letters.\n\n"
    },
    {
      "time": " 29.Aug.2007 9.56pm",
      "content": "You could be right about that, James... Another area in which work is cheapened is stock photography... Do people expect _that_ to suck? I know of good photographers who have to make a living and end up submitting their work to stock houses...\n\n"
    }
  ]
}
