{
  "id": "36619",
  "title": "OS limitations lead to separate OT-fonts?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "On [P22's blog](http://web.archive.org/web/20131024021343/http:/www.p22.com/blog/2007/08/rider-alert-coming-soon.html) it is said\n\n_Due to some OS limitations, the Pro fonts will be available separately as Latin, Cyrillic and Greek_\n\nWhat could that mean?\n\n",
  "author": "Christoph",
  "time": "30 Aug 2007 — 3:09am",
  "uid": "19831",
  "comments": [
    {
      "time": "30 Aug 2007 — 3:36am",
      "content": "Given the nature of that font, I can't imagine that there's anything OpenType-related difference in operating systems that could cause a problem. Especially since it would really be the font renderer, not the OS, that would have problems with OpenType-ness, right? Unless maybe there's something odd about the font file that causes the default font managers to have some trouble, but that sounds a bit fishy.\n\nI vote for they just want three times the money. It makes sense though, as they say it's their largest font by glyph count, and the average Western European will just be using the Latin script. While he might only use that, he'd still be getting three times more than he'll use, and so if they didn't split the font into three version, they'd rightfully charge two or three times more for their font. So, perhaps it's being nice to those users who only need one of the three.\n\nThat's just a guess though. I do call BS it being an OS limitation.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "30 Aug 2007 — 8:13am",
      "content": "I'd say it's probably a mental slip, and they meant \"application limitations\".  \nFor instance, Quark 6.5 or earlier.  \nThat app no longer works on OS X since Mac switched to Intel and there's no \"Classic mode\".  \nAnd in Quark 6.5, although OpenType fonts do work, there is no feature support, which is what the \"Pro\" designation is all about.  \nSo in a sense it's an OS limitation, in that OS X doesn't support older Quark.\n\n"
    },
    {
      "time": "30 Aug 2007 — 9:48am",
      "content": "\\> _Given the nature of that font, I can’t imagine that there’s anything OpenType-related difference in operating systems that could cause a problem. [...] I vote for they just want three times the money. [...] That’s just a guess though. I do call BS it being an OS limitation._\n\n\\> _I’d say it’s probably a mental slip, and they meant “application limitations”. So in a sense it’s an OS limitation, in that OS X doesn’t support older Quark._\n\nAnd I say, you two DON'T KNOW anything about what you're talking about!! (I hate when this happens!!) Has it occurred to you to do some research, including e-mailing the foundry, before jumping into conclusions?\n\nThe P22 London Underground font triggers the same OSX bug that was found when Arno Pro was being developed:  \n [http://docs.info.apple.com/article.html?artnum=304821](http://web.archive.org/web/20131024021343/http:/docs.info.apple.com/article.html?artnum=304821 \"http://docs.info.apple.com/article.html?artnum=304821\")\n\nAlthough huge, Arno's glyphset is dozens of glyphs smaller than P22 London Underground, which made it possible to find a workaround for the above OSX bug. Unfortunately, the same was not possible to do with P22's font, despite Paul Hunt's efforts.\n\n"
    },
    {
      "time": "30 Aug 2007 — 9:56am",
      "content": "Before we go and have another ugly thread I think it is important when you have a question like this you email the foundry. Not everyone is looking for more money.\n\n"
    },
    {
      "time": "30 Aug 2007 — 11:13am",
      "content": "_I vote for they just want three times the money...I do call BS it being an OS limitation._\n\nNo, actually it is three times the work to separate them out since all of the fonts are available as sub-families. The end price of the full font system is the same as originally planned. If someone wants just one script, they will actually be paying LESS. Because of stylistic variants increasing the glyph count to over 5000, there are problems with earlier OS behavior. This is not a marketing scheme or gimmick. Unless we demand all of customers have the latest OS, there are some issues. It has nothing to do with application support of OT features. The fairest workaround for the widest customer usage ended up being splitting each script up. If anyone has made 5000+ glyph fonts and has a better solution, please let us know. And if there are further question, please do email us directly.\n\nThe P22 blog post was an honest explanation without going into excruciatingly boring detail.\n\nThank you Miguel for not sugar coating it :)\n\n"
    },
    {
      "time": "30 Aug 2007 — 1:49pm",
      "content": "Well pardon me for sending you into DOUBLEBANG CAPITALS MODE, Miguel!!  \nIt's true I couldn't be bothered to check with the foundry, but it was an instantaneous post on my part, to demonstrate that a guess could just as easily be sympathetic to the foundry as cynically accusatory.\n\n"
    },
    {
      "time": "30 Aug 2007 — 2:43pm",
      "content": "That's the only way I have to react to uninformed people and comments based on assumptions. I use Typophile as a vehicle to share (give and receive) information, not gossip. People that want to output their BS are better served by itubemyconspiracytheories.com\n\n"
    },
    {
      "time": "30 Aug 2007 — 2:43pm",
      "content": "I've had to troubleshoot a lot of font related computer problems, and I can say that platform level bugs are the worst. This is because one by necessity must assume that the probability of their existence is small or everyone would know about it. In the case of the premier foundries, the actual specifications and feature support are being tested at the OS level. I sometimes define whether a font is \"good\" or \"functional\" based on whether it works in basic applications like Notepad.exe or TextEdit.app. So, it's not insane to be skeptical about OS bug complaints. It's also possible that the \"bug\" lies in some nebulous region that is better described as \"compatibility\". If only a couple fonts fail, the platform vendor could simply describe the problem as a lack of support for a particular feature. BTW, P22 London Underground, Arno Pro, and Mac OS are all things I would like to use if possible.\n\n"
    },
    {
      "time": "30 Aug 2007 — 3:43pm",
      "content": "<cite>The end price of the full font system is the same as originally planned. If someone wants just one script, they will actually be paying LESS</cite>  \nI did mention this, that this _does_ benefit a user who would only use one of the three scripts, because otherwise, he would be paying for 200% extra glyphs that he would never use.\n\nIf I'm understanding the bug though, is it so much an OS X bug or Fontbook? Do third party font managers handle it okay?\n\nNow if Apple would just hurry and CoreText to us...  \n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "30 Aug 2007 — 4:48pm",
      "content": "It is an OS X bug. When Arno was being beta tested the computers were different and that included different font management. The bug was acknowledged by Apple.\n\n"
    },
    {
      "time": "31 Aug 2007 — 12:42am",
      "content": "Thank you guys, that's pretty interesting.  \nI could not imagine why P22 spends much time into dividing the font, but I did not work with fonts that big yet. OpenType is such a nice thing in theory! ;)\n\n"
    },
    {
      "time": "31 Aug 2007 — 5:37am",
      "content": "_I could not imagine why P22 spends much time into dividing the font_\n\nNot for shits and giggles, that's for sure.\n\n"
    },
    {
      "time": "31 Aug 2007 — 5:46am",
      "content": "That's why I asked.\n\n"
    },
    {
      "time": "31 Aug 2007 — 9:11am",
      "content": "Would a 1500-glyph font encounter problems?\n\n"
    },
    {
      "time": "31 Aug 2007 — 9:17am",
      "content": "_Would a 1500-glyph font encounter problems?_\n\nit all has to do with a portion of the font file that lists all the glyph names, if this list is over a certain size, Mac OS will encounter problems including crashing of the system. The only way to test to see if you're in the safe range (that i know of) is to build (or test building) your font with the AFDKO tools.  \nUnless you're using really wacky long names, i think 1500 _should_ be safe.\n\n"
    },
    {
      "time": "31 Aug 2007 — 3:42pm",
      "content": "If I recall correctly, this bug only affects name-keyed OpenType CFF fonts in Mac OSX 10.4.8 and earlier. (CID-keyed OT CFF fonts go through a different \"pipeline\", I think)\n\nBoth MakeOTF and CompareFamily — available in the [AFDKO](http://web.archive.org/web/20131024021343/http:/www.typophile.com/wiki/AFDKO) — have a test to assess the fonts and will output an error/warning.\n\nTo calculate it \"by hand\", do the following:\n\n1. Open _Terminal_ (Mac) or _Command Prompt_ (Windows), and type  \n`tx -dcf –1 My_Font.otf > output.txt`  \n**tx** is also available in the AFDKO. The kit contains the document **CommandLineHowTo.pdf** as well.\n\n2. Open \"output.txt\" in a text editor and search for \"### String INDEX\". You should find something like this  \n`### String INDEX (000012b3-000074f2)\ncount =2823`\n\n3. Startup Python and type (Use your own values; I'm using the values above)  \n`2*2823 + (0x74f2 - 0x12b3)`\n\n4. A number will be output — in the case above is 30797. If this number is equal or greater than 32768 (32K), then the font will trigger the bug.\n\nIn sum, the problem happens if  \n`(2*count + String Index table size) >= 32768`  \nOne way of reducing the number is by shortening the glyph names\\*. Other strings such as the font's Full Name and the Copyright may also contribute to the size of this number.\n\n\\*Keep in mind that glyph naming rules still apply. In Arno Pro, we managed to get away from the problem by using **uniXXXX** names for most base glyphs, and **uXXXX.x** for most alternate glyphs.\n\n"
    },
    {
      "time": "1 Sep 2007 — 1:11am",
      "content": "Miguel is correct that CID-keyed fonts avoid the problem. Specifically, because they have no glyph names (they are \"CID-keyed\" rather than \"name-keyed\").\n\nIn our fonts, we ran into the problem for the first time right around 3000 glyphs. It would be an odd font with 2000 or fewer glyphs that would trigger the problem.\n\nInterestingly, it turned out we'd come \\*really\\* close several times before, and just hadn't quite gone over the OS X string limit prior to Arno. It was really hard to debug, too, because there was nothing wrong with the font and the trigger was not at all obvious. We did eventually figure out it was at the OS level and Apple helped sort out the exact issue.\n\nCheers,\n\nT\n\n"
    }
  ]
}
