{
  "id": "36616",
  "title": "(x) Alvin Toffler \"Future Shock\" book cover - Embrionic {Mark S}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Morning all...\n\nI have a old copy of Alvin Toffler's book 'Future Shock', and would love to find out what typeface is used for the title block... very seventies, and rather beautiful...\n\nthanks for any assistance!\n\nMatt Appleton\n\n ![](http://web.archive.org/web/20150317205249im_/http:/typophile.com/files/futureshock_001lo_4744.jpg)\n\n",
  "author": "modernactivity",
  "time": "30 Aug 2007 — 2:22am",
  "uid": "21252",
  "comments": [
    {
      "time": "30 Aug 2007 — 7:21am",
      "content": "It's a very rarely used face (at least I've rarely seen it) from the Seventies called Embrionic. As far as I know, there were only two weights--this one (Embrionic 55) and an extra bold weight (Embrionic 85). I've only ever seen a complete showing of the bolder weight. According to an old Zipatone rub-down lettering catalog, it was designed by Graphic Systems. Minor detail: The lowercase \"c\" has been opened up. In the stock version, the opening is about as wide as the one in the \"e\". Finally, as strange as it may seem, this face had a complete set of swash caps.\n\n"
    },
    {
      "time": "30 Aug 2007 — 7:41am",
      "content": "Embrionic [Flair](http://web.archive.org/web/20150317205249/http:/www.typophile.com/node/2833) as it were? ;^)\n\n"
    },
    {
      "time": "30 Aug 2007 — 8:27am",
      "content": "See for yourself:\n\n ![](http://web.archive.org/web/20150317205249im_/http:/typophile.com/files/Embrionic85_3883.gif)\n\nI like the swash \"Z\" and a few others, but the rest of the swash caps are a bit clumsy. Feels a bit like [Octopuss](http://web.archive.org/web/20150317205249/http:/www.myfonts.com/fonts/linotype/octopuss/).\n\n"
    },
    {
      "time": "30 Aug 2007 — 8:43am",
      "content": "What can I say?\n\nOnce again, the typophilia of typohile.com blows me away - thanks very much for the time and info!\n\nI would love to know if anyone has an image of the '55 weight... or better still a source for a digital cut. This book cover just got me looking at my 'Phil's Photos' Sourcebook again, and there are some great seventies sans fonts in there - Wexford and Harry to name a few... but no Embrionic.\n\n"
    },
    {
      "time": "30 Aug 2007 — 9:06am",
      "content": "Like I said, it's a rare one. I have only seen it in two places: The Zipatone catalog from the late Seventies (sample shown above) and a one-line listing of both fonts in the Solotype Catalog, showing only the names in their respective fonts. I'm sure there exist film font catalogs which include full samples, but none in my collection.\n\nI would be very surprised if either font has been digitized. There were a ton of typefaces (especially film fonts and rub-down alphabets) made in the Seventies that never became popular and faded into obscurity.\n\n"
    },
    {
      "time": "30 Aug 2007 — 11:26am",
      "content": "Well, if you consider the incredible amount of time and effort needed to produce a good quality font it hardly isn't surprising that a lot of those fonts never made it to digital.\n\n"
    },
    {
      "time": "16 Sep 2007 — 1:17pm",
      "content": "I saw this (incl. the swash characters) as vinyl lettering on a shop window in the south of Sweden today - ha, what are the odds and where was my camera... But this should mean it i somehow digitally available?\n\n"
    },
    {
      "time": "17 Sep 2007 — 3:42am",
      "content": "Not sure -- could be.\n\n"
    },
    {
      "time": "2 Oct 2007 — 2:31am",
      "content": "so where do I find this font?\n\n"
    },
    {
      "time": "2 Oct 2007 — 2:47am",
      "content": "\\> so where do I find this font?\n\nLike Mark said, it probably hasn’t been digitized, yet.\n\n"
    },
    {
      "time": "2 Oct 2007 — 1:25pm",
      "content": "I just found another example of it in use. This is a detail from a photo I took in Seattle a few years ago:\n\n ![](http://web.archive.org/web/20150317205249im_/http:/typophile.com/files/embrionic-sign_4580.jpg)\n\nIt looks like they altered the A and I a bit.\n\n"
    },
    {
      "time": "2 Oct 2007 — 1:37pm",
      "content": "Clueless on Typefaces. But, that's an Awesome Book.\n\n"
    },
    {
      "time": "24 Jul 2014 — 3:18pm",
      "content": "I've compiled some more information about [Embrionic on Fonts In Use](http://web.archive.org/web/20150317205249/http:/fontsinuse.com/typefaces/32165/embrionic).\n\n"
    },
    {
      "time": "1 Mar 2015 — 8:40am",
      "content": "Sorry to bump this.\n\nIf anyone still looking for the full specimen of Embrionic 55 and 85 family, I recently acquired a specimen book which shows the full alphabets of each + 2 more styles not available in anywhere else.\n\n[https://www.flickr.com/photos/21842651@N00/16481953310/](http://web.archive.org/web/20150317205249/https:/www.flickr.com/photos/21842651@N00/16481953310/ \"https://www.flickr.com/photos/21842651@N00/16481953310/\")  \n [https://www.flickr.com/photos/21842651@N00/16481796988/](http://web.archive.org/web/20150317205249/https:/www.flickr.com/photos/21842651@N00/16481796988/ \"https://www.flickr.com/photos/21842651@N00/16481796988/\")\n\nThe swash Q is rather different, it may be Qu ligature...\n\n"
    },
    {
      "time": "1 Mar 2015 — 5:55pm",
      "content": "Nice find! And, yes, I think that’s a /Qu/ ligature.\n\n"
    }
  ]
}
