{
  "id": "36610",
  "title": "Pack my box with five dozen liquor jugs",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Pack my box with five dozen liquor jugs\n\nThat sentence uses every letter in the English alphabet. Is that cool, or what? Now I have an alternative to Zwei Boxmampfer whatever or the hamburger whatsits that I typically use for my preview in FontExplorer.\n\n",
  "author": "Dan Gayle",
  "time": "29 Aug 2007 — 7:07pm",
  "uid": "12948",
  "comments": [
    {
      "time": "29 Aug 2007 — 7:26pm",
      "content": "That is too cool. :-)\n\n"
    },
    {
      "time": "29 Aug 2007 — 7:29pm",
      "content": "It's called a [pangram](http://web.archive.org/web/20150305002720/http:/www.typophile.com/wiki/pangram).\n\n"
    },
    {
      "time": "29 Aug 2007 — 7:33pm",
      "content": "It's called genius. Don't water it down with your fancy words.\n\n"
    },
    {
      "time": "29 Aug 2007 — 7:34pm",
      "content": "But I guess it _should_ make it into the wiki.\n\n"
    },
    {
      "time": "29 Aug 2007 — 7:39pm",
      "content": "Hate to burst your bubble, but \"liquor jugs\" is one of the more commonly used pangrams. Not as common as \"quick brown fox\", but a distant second.\n\n"
    },
    {
      "time": "29 Aug 2007 — 7:53pm",
      "content": "But _five dozen_ liquor jugs? And if it's so common, why come it's not in the Wiki already?\n\nBy the way, the wiki links to an extinct page. Perhaps the missing liquor jugs were in that thread?\n\nEDIT:  \nNow wait a second. That link was just there a second ago. Did someone change it, or am I just crazy?\n\n"
    },
    {
      "time": "29 Aug 2007 — 7:48pm",
      "content": "There was a Typophile thread with hundreds of pangrams. MyFonts uses them in rotation for display, but the thread now seems to be AWOL. Does anyone know what happened to it?\n\n"
    },
    {
      "time": "29 Aug 2007 — 7:51pm",
      "content": "I've updated the wiki with working links, but yeah, couldn't find the grand thread which was once here:\n\n[http://www.typophile.com/forums/messages/73/697.html](http://web.archive.org/web/20150305002720/http:/www.typophile.com/forums/messages/73/697.html \"http://www.typophile.com/forums/messages/73/697.html\")\n\nChristian!\n\n"
    },
    {
      "time": "29 Aug 2007 — 7:53pm",
      "content": "Dang. You guys are fast!\n\n"
    },
    {
      "time": "29 Aug 2007 — 7:56pm",
      "content": "William - Our avatar colors are so close I imagine we might sometimes be mistaken for each other, especially when we post in succession. I certainly don't mind being mistaken for you, but if you want I'll switch my color. I'm due for a change.\n\n"
    },
    {
      "time": "29 Aug 2007 — 8:09pm",
      "content": "Um, stumbled onto a txt file on my HD full of pangrams, I think I must have found it on Typophile?\n\nQuartz glyph job vexed cwm finks.  \nBrick quiz whangs jumpy veldt fox.  \nNymphs vex, beg quick fjord waltz.  \nQuick wafting zephyrs vex bold Jim.  \nBlowzy frights vex, and jump quick.  \nFoxy nymphs grab quick-lived waltz.  \nSphinx of black quartz judge my vow.  \nQuick zephyrs blow, vexing daft Jim.  \nHow quickly daft jumping zebras vex.  \nWaltz, nymph, for quick jigs vex Bud!  \nThe five boxing wizards jump quickly.  \nJudges vomit; few quiz pharynx block.  \nJackdaws love my big sphinx of quartz.  \nQuick waxy bugs jump the frozen veldt.  \nMr. Jock, TV quiz Ph.D., bags few lynx.  \n**Pack my box with five dozen liquor jugs.**  \nCozy sphinx waves quart jug of bad milk.  \nThief, give back my prized wax jonquils!  \nBlowzy red vixens fight for a quick jump.  \nSympathizing would fix Quaker objectives.  \nFive big quacking zephyrs jolt my wax bed.  \nBig quilted Nike jump shoes vex crazy few. (0)  \nThe quick brown fox jumps over the lazy dog.  \nJail zesty vixen who grabbed pay from quack!  \nMany-wived Jack laughs at probes of sex quiz.  \nMix Zapf with Veljovic and get quirky Beziers. (1)  \nDumpy kibitzer jingles as exchequer overflows.  \nPuzzled women bequeath jerks very exotic gifts.  \nTurgid saxophones blew over Mick's jazzy quiff.  \nBrawny gods just flocked up to quiz and vex him.  \nAdjusting quiver and bow, Zompyc killed the fox.  \nThe wizard jumped quickly over five green boxes.  \nZany eskimo craves fixed job with quilting party.  \nViewing quizzical abstracts mixed up hefty jocks.  \nPlaying jazz vibe chords quickly excites my wife.  \nJim just quit and packed extra bags for Liz Owen.  \nFive wine experts jokingly quizzed sample chablis.  \nWilliam Jex quickly caught five dozen Republicans.  \nPack my box with five dozen jugs of liquid veneer.  \nMartin J. Hixeypozer quickly began his first word.  \nMany big jackdaws quickly zipped over the fox pen.  \nA large fawn jumped quickly over white zinc boxes.  \nMeghan deftly picks valuable jewels--onyx, quartz.  \nBig July earthquakes confound zany experimental vow.  \nZany Jacques' French pub mixed watery vodka gimlets.  \nExquisite farm wench gives body jolt to prize stinker.  \nSix big devils from Japan quickly forgot how to waltz.  \nThe vixen jumped quickly on her foe barking with zeal.  \nBack home after jiving, she expired with quizzicality.  \nMad Brother Jarvis was quickly axed for crazy praying.  \nJack quietly gave dog owners most of his prize boxers.  \nThe fox, jaw bleeding, moved quickly, dazing his prey.  \nFive or six big jet planes zoomed quickly by the tower.  \nHis graceful bisque vase whizzed past my taxi--no joke!  \nCrazy Fredericka bought many very exquisite opal jewels.  \nMy grandfather picks up quartz and valuable onyx jewels.  \nQuixotic Republicans vet first key zero-growth jeremiad.  \nJack typed requistions for long size white moving boxes.  \nSix crazy kings vowed to abolish my quite pitiful jousts.  \nHow razorback-jumping frogs can level six piqued gymnasts!  \nSixty zippers were quickly picked from the woven jute bag.  \nThe job of waxing linoleum frequently peeves chintzy kids.  \nJack amazed a few girls by dropping the antique onyx vase!  \nThe very bent, jacknifed forms were quizically perplexing.  \nWe have just quoted on nine dozen boxes of gray lamp wicks.  \nMay Jo equal the fine record by solving six puzzles a week?  \nWest quickly gave Bert handsome prizes for six juicy plums.  \nFred specialized in the job of making very quaint wax toys.  \nJust keep examining every low bid quoted for zinc etchings.  \nFreight to me sixty dozen quart jars and twelve black pans.  \nVerily the dark ex-Jew quit Zionism, preferring the cabala.  \nJay visited back home and gazed upon a brown fox and quail.  \nA quick movement of the enemy will jeopardize six gunboats.  \nJeb quickly drove a few extra miles on the glazed pavement.  \nAll questions asked by five watch experts amazed the judge.  \nGrumpy wizards make toxic brew for the evil Queen and Jack.  \nThe exodus of jazzy pigeons is craved by squeamish walkers.  \nBrown jars prevented the mixture from freezing too quickly.  \nJack Farmer realized that big yellow quilts were expensive.  \nJack's man found exactly a quarter in the woven zipper bag.  \nJacqueline was vexed by the folks who got the money prizes.  \nJames Boxell, the banquet speaker, analyzed a few carvings.  \nJeb quickly drove a few extra miles on the glazed pavement.  \nMy folks proved his expert eloquence was just a big hazard.  \nJeff had his size to help him win quickly over Gene Baxter.  \nThe vexing party became dazzling with fishy aquarium jokes.  \nWe could jeopardize six of the gunboats by two quick moves.  \nWeekly magazines request help for and by junior executives.  \nWhy did Max become eloquent over a zany gift like jodhpurs?  \nDavid, Jewish ex-monarch, kept big vineyard, quizzical wife.  \nMaizie quickly paid Jones for the five new taxis she bought.  \nThe lazy judge was very quick to pay tax money for the barn.  \nThe quick jumpy fox is tired and vicious brown dog was lazy.  \nWe promptly judged antique ivory buckles for the next prize.  \nBack in June we delivered oxygen equipment of the same size.  \nLazy movers quit hard-packing of papier-mache jewelry boxes.  \nThe Basque M.P. loved his wife's onyx jar and zinc-lined keg.  \nI have quickly spotted the four women dozing in the jury box.  \nJudge power quickly gave the six embezzelers stiff sentences.  \nMay brought back five or six dozen pieces of queer jewellery.  \nThe Basque M.P. loved his wife's onyx jar and zinc-lined keg.  \nHow vexing a fumble to drop a jolly zucchini in the quicksand!  \nWhile waxing parquet decks, Suez sailors vomit jaunitly abaft.  \nNow is the time for all brown dogs to jump over the lazy lynx.  \nSweet marjoram grew in profusion around the quaint Aztec city.  \nI endeavoured to puzzle the ex-spy by quickly jumping backwards.  \nAstronaut Quincy B. Zack defies gravity with six jet fuel pumps.  \nMy help squeezed back in again and joined the weavers after six.  \nNew farm hand (picking just six quinces) proves strong but lazy.  \nAlfredo just must bring very exciting news to the plaza quickly.  \nSix of the frivolous women quietly gave back prizes to the judge.  \nWho will favor extemporizations being resolved quickly by jingle?  \nBack in my quaint garden jaunty zinnias vie with flaunting phlox.  \nJaded zombies acted quaintly but kept driving their oxen forward.  \nHark! Toxic jungle water vipers quietly drop on zebras for meals!  \nThe king's amazing poised, query advanced with big javelins fixed.  \nDance experts would be amazed by his feverish jerking and quaking.  \nHe jokingly removed porcupine quills from a zebra's back with wax.  \nThe judo expert grappled quickly, but with zeal, felling seven men.  \nAnxious Paul waved back to his Pa from the zinc quarry just sighted.  \nJoe was pleased with our gift of quail, mink, zebra and clever oryx.  \nWolfing kumquats, jovial Charon poled his boat lazily along the Styx.  \nUsing axes, lumberjacks very quickly felled the wizard's pine forest.  \nIf I gave you cloth with quartz beads, onyx, jade, amethyst; keep it.  \nSix big juicy steaks sizzled in a pan as five workmen left the quarry.  \nWill Major Douglas be expected to take this true-false quiz very soon?  \nThe juke box music puzzled a gentle visitor from a quaint valley town.  \nJust work for improved basic techniques to maximize your typing skill.  \nA mad boxer shot a quick, gloved jab to the jaw of his dizzy opponent.  \nVerbatim reports were quickly given by Jim Fox to his amazed audience.  \nWhen we go back to Juarez, Mexico, do we fly over picturesque Arizona?  \nFour or five puzzle-box locks can be opened quickly with just magnets.  \nMake a vow to learn the technique of playing saxophone in a jazz band.  \nThe jovial yokel found six zealots praying and backed qualmishly away.  \nThe queen was perplexed by the lazy calm of the king's jovial advisor.  \nXenophobes know unequivocally that magnetization jeopardizes folklore.  \nQuestions of a zealous nature have become by degrees petty waxen jokes.  \nAbout sixty codfish eggs will make a quarter pound of very fizzy jelly.  \nMurky haze enveloped a city as jarring quakes broke fourty-six windows.  \nThe brazen jackal querulously attacked a ferral vixen, maiming her paw.  \nKarate experts bring down victims with just a few amazingly quick chops.  \nThe fabled quetzal roosted on a mulberry twig, vexing the peevish jockey.  \nKing Alexander was just partly overcome after quizzing Diogenes in his tub.  \nThe exiled queen justly moved, celebrated with a dazzling fireworks display.  \nThe July sun caused a fragment of black pine wax to ooze on the velvet quilt.  \nVenerable Will played jazz sax 'till 3 o'clock in the morning before he quit.  \nThe knowledgeable superintendent amazed us by quickly fixing five pipe joints.  \nTwo hardy boxing kangaroos jet from Sydney to Zanzibar on quicksilver pinions.  \nPerhaps President Clinton's amazing sax skills will be judged quite favorably.  \nWas there a quorum of able whizzkids gravely exciting the jaded fish at ATypI? (2)  \nDespite being haunted by the wizard's jinx, the quartet performed very slickly.  \nTroubled by the voodoo hex, the jazzmen packed their gears and went off quickly.  \nMy exquisite painting was ruined by the flavorous, sticky juice known as benzoin.  \nSomeone just asking was quite pleased with our gifts of a zebra and a clever oryx.  \nEbenezer unexpectedly bagged two tranquil aardvarks with his jiffy vacuum cleaner!  \nFabled reader with jaded, roving eye seized by quickened impulse to expand budget.  \nAs we explored the Gulf of Zanzibar, we quickly moved closer to the jutting rocks.  \nCalligraphic wizardry expounds a quiet, but rythmic flow eschewing jerky movements.  \nFor civilization, Marx thought justice must be replaced quickly by ways of freedom.  \nTravelling beneath the azure sky in our jolly ox-cart, we often hit bumps quite hard.  \nFor only $49, jolly housewives made \"inexpensive\" meals using quick-frozen vegetables.  \nFive jolly men, using penknives, would cut sixty quills needed by the zany calligraphers.  \nOur sixth earthquake just spilled five city buildings, leaving hazard in its stormy wake.  \nThe sex life of the woodchuck is a provocative question for most vertebrate zoology majors.  \nBreezily jangling $3,416,857,209 wise advertiser ambles to the bank, his exchequer amplified.  \nJimmy and Zack, the police explained, were last seen diving into a field of buttered quahogs.  \nCalligraphy requires just a few very basic needs: pen, ink, dexeterity and most of all, zeal.  \nCurious and wily journalists braved the fury of the six brazen knaves picketing the mad queen.  \nJustly vexed, the queen exiled the calligrapher who spattered black sumi ink on her fuzzy dog.  \nTypography is known for two-dimensional architecture and requires extra zeal within every job. (3)  \nTheir very kind aunt was subject to frequent dizzy spells, thus causing much anxiety and worry.  \nThe daredevils quivered, knowing that Rob would commit the faux pas of dozing when they jumped.  \nWilliam said that everything about his jacket was in quite good condition except for the zipper.  \nThe junior office clerks were quite amazed at the extra reward given by their generous employer.  \nHe wrote deftly and quickly, just amazing us with his expertise and his unabashed love of letters.  \nThe jittery killer immobilized his victim with a wax-filled hypodermic syringe, then drove off quickly.  \nSix calligraphers, justly amazed, watched children busily cutting quills with their favourite penknives.  \nThe vegetarian menu included gazpacho, piquant julienne beets, rusk rounds with yogurt and excellent flan.  \nA foxy, quick, clever cat in Switzerland was hit by a fancy sports job with bumpy seats and a grumpy driver.  \nJelly-like above the high wire, six quaking pachyderms kept the climax of the extravaganza in a dazzling state of flux.  \nNo kidding, Lorenzo called off his trip to visit Mexico City just because they told him the conquistadores were extinct.  \nForsaking monastic tradition, twelve jovial friars gave up their vocation for a questionable existence on the flying trapeze.  \nAn inspired calligrapher can create pages of beauty using stick ink, quill, brush, pick-axe, buzz saw, or even strawberry jam.\n\nNon-English:  \nPortez ce vieux whisky au juge blond qui fume.  \n (French: Take this old whiskey to the blond judge who smokes.)  \nMoi, je veux quinze clubs a golf et du whisky pur.  \n (French: Me, I want five golf clubs and some straight whiskey.)  \nZweedse ex-VIP, behoorlijk gek op quantumfysica.  \n (Dutch: Swedish ex-VIP, pretty crazy about quantum physics.)  \nSexy qua lijf, doch bang voor het zwempak.  \n (Dutch, includes ij ligature: A sexy body, but afraid of swimsuits.)  \nZwei boxka:mpfer jagen Eva quer durch Sylt.  \n (German: Two boxers hunt Eva every which way through Sylt.)  \nMylord Schwejk quizt Express ab Ravigsfen.  \n (German: ??; Express uses szed)  \nTypographie ist zweidimensionale Architektur und bedingt extra Qualita:t in jeder vollkommenen Ausfu:hrung. (3)  \n (German: Typography is known for two-dimensional architecture and requires extra zeal within every job.)\n\nLatin  \nFerunt Ophyr convexa kumba per liquida gaza. {7th C}  \n (They bear from Ophyr in hollow boats, treasures over clear water.)  \nGrex Zephyri flabat quodam kanna sonabant. {9th C}  \n (The flock, of Zepher (westwind) blew once when the white waves sounded.)  \nQuam pulchre ymnizat fondens vox Belgika cantum. {9 & 10th C}  \n (How beautiful does Belgium voices makes hymns, pouring forth song.)  \nGrando quatit zelum pax kirri fabricet hymnos. {12th C}  \n (Let the peace of the Lord compose hymns.)  \nTe kanit adcelebratque polus, rex gazier, hymnis. {12/14th C}  \n (The heavens sing and celebrate thee, Oh treasure-bearing king with hymns.)  \nGAZA FREQUENS LIBYCUM DUXIT KARTHAGO TRIUMPHUM {modern}\n\n0 Peter Bielecki (check sp)  \n1 Jonathon Hoefler  \n2 Peter Zelchenko  \n3 Hermann Zapf\n\n"
    },
    {
      "time": "29 Aug 2007 — 8:21pm",
      "content": "Holy crap.\n\n"
    },
    {
      "time": "29 Aug 2007 — 8:22pm",
      "content": "Stephen, I'll be happy to change the red ...I wanted it darker. Let's not both change them the same way!\n\n"
    },
    {
      "time": "29 Aug 2007 — 8:27pm",
      "content": "Eric Spiekermann had a good explaination of Zwei Boxkämpfer jagen Eva quer durch Sylt [here](http://web.archive.org/web/20150305002720/http:/www.typophile.com/node/29694).\n\n"
    },
    {
      "time": "29 Aug 2007 — 8:31pm",
      "content": "The above list doesn't contain one of my r-rated favorites:\n\nQuick, jab my fading pink zit, evil sex whore!\n\n"
    },
    {
      "time": "29 Aug 2007 — 8:39pm",
      "content": "Google brings up:\n\n[The Pangram page](http://web.archive.org/web/20150305002720/http:/www.tardis.ed.ac.uk/~ajcd/type/pangram.html)\n\n[Fun with Words \\> Pangrams](http://web.archive.org/web/20150305002720/http:/www.rinkworks.com/words/pangrams.shtml)\n\n[fun-with-words \\> pangrams](http://web.archive.org/web/20150305002720/http:/www.fun-with-words.com/pangrams.html)\n\n[Pangram page](http://web.archive.org/web/20150305002720/http:/homepage.ntlworld.com/alan.pipes/pangram.html)\n\n[P22 Pangram Contest](http://web.archive.org/web/20150305002720/http:/www.p22.com/products/pangramcontest.html)\n\n[Mark Simonson \\> Pangrammer Helper](http://web.archive.org/web/20150305002720/http:/www.ms-studio.com/Animation/pangrammerhelper.html)\n\n"
    },
    {
      "time": "29 Aug 2007 — 8:39pm",
      "content": "Who [Spiekermann](http://web.archive.org/web/20150305002720/http:/www.typophile.com/wiki/Erik%20Spiekermann)?\n\n"
    },
    {
      "time": "29 Aug 2007 — 8:40pm",
      "content": "Font Player, thanks for bringing R-rated pangrams into the mix -- that is hilarious. :-)\n\n"
    },
    {
      "time": "29 Aug 2007 — 8:40pm",
      "content": "<cite>Quick, jab my fading pink zit, evil sex whore!</cite>\n\nThat reminds me of a joke I would get banned for retelling here.\n\n"
    },
    {
      "time": "29 Aug 2007 — 9:21pm",
      "content": "Aw, come on James... What's the fun in just hinting? (pun intended... heh-heh)\n\n"
    },
    {
      "time": "30 Aug 2007 — 4:05am",
      "content": "I'm looking for, but not finding a pangram. supposedly written by Lawrence (of Arabia) as a message during wartime. It cheats, by using H.Q., B.V.D. and I know Fez is in it too, but I cant't find any ref. to it anywhere...hmmm.\n\nCheers!\n\n"
    },
    {
      "time": "30 Aug 2007 — 4:43am",
      "content": "DanGayle you're a funny guy with obviously too much free time.\n\nI love the pangram and it is crazy genius. It's also very easy for me to remember. We were just in the Virgin Islands where liquor cost about a fourth of what it cost here. So we did pack our bags with five dozen liquor jugs. They actually even have special boxes for the tourists to load 'em up.\n\n"
    },
    {
      "time": "30 Aug 2007 — 4:48am",
      "content": "\"I’m looking for, but not finding a pangram. supposedly written by Lawrence (of Arabia) as a message during wartime...\"\n\nI did a google and found a book reference to Robin Oxman. It said this message was sent by D.H. Lawrence during WWI about a \"screw up soldier who had fallen in a river.\" \"Warm plucky GHQ jinx, fez to B.V.D's.\"\n\n"
    },
    {
      "time": "30 Aug 2007 — 6:43am",
      "content": "D. H. Lawrence – writer of Lady Chatterley’s Lover, among others  \nT. E. Lawrence –&nbsp;writer of Seven Pillars of Wisdom, translator of Homer’s Odyssey, rider of Boanerges and ‘of Arabia’\n\n[http://telawrence.net/telawrencenet/search.htm](http://web.archive.org/web/20150305002720/http:/telawrence.net/telawrencenet/search.htm \"http://telawrence.net/telawrencenet/search.htm\")\n\nReveals no pangram though, would he have known BVDs?\n\nTim\n\n"
    },
    {
      "time": "30 Aug 2007 — 7:44am",
      "content": "I was going to post a link to where I found that on Google Books. But the link is way too long to place here. You are correct — the reference to D.H. Lawrence seems to be an error. The statement, and reference to D.H. Lawrence as \"Lawrence of Arabia,\" is on page 66 of Robin Oxman's _One Liners: Random Thoughts, Observations and Facts Abouth the Human Condition_.\n\n"
    },
    {
      "time": "30 Aug 2007 — 8:44am",
      "content": "Where did I get \"New job: fix Mr Gluck's hazy TV, PDQ\" from? A David Crystal book, I suspect. Although it uses abbreviations, for a 26-letters-only pangram (ie all used only once) it makes a decent amount of sense...\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "30 Aug 2007 — 9:22am",
      "content": "[Here's another version](http://web.archive.org/web/20150305002720/http:/books.google.com/books?id=pzj90slTTEIC&pg=PA75&lpg=PA75&dq=warm+plucky+ghq+jinx+fez+to+bvd+s&source=web&ots=jqLS3b_GeF&sig=mm8HXKzEZb7YUwXr9q5Ea7LuEPg#PPA74,M1) of the T.E. Lawrence story and the pangram.\n\nPS Apparently [BVDs were around](http://web.archive.org/web/20150305002720/http:/en.wikipedia.org/wiki/BVD) in WW I.\n\n"
    },
    {
      "time": "30 Aug 2007 — 11:54am",
      "content": " ![](http://web.archive.org/web/20150305002720im_/http:/typophile.com/files/TEPANGRAM_4205.png)\n\nTHaNkS T'you! ...\n\nNow, even with cheating, (T.E.'s or anyway), are there any other 26 glyphers?\n\nCheers,\n\nP.S. Please don't mention the kerning.\n\n"
    },
    {
      "time": "30 Aug 2007 — 11:58am",
      "content": "You post this and ask us not to point out the kerning!? ;^P\n\n"
    },
    {
      "time": "30 Aug 2007 — 12:05pm",
      "content": "Thanks William, I originally looked at that wikipedia entry for BVDs to find out what they were, I am wondering if T. E. Lawrence would have known them as that as it seems to be an American usage, although if any Brit knew it it would be a soldier or a biker.\n\nTim\n\nKerning ouch :)\n\n"
    },
    {
      "time": "30 Aug 2007 — 12:28pm",
      "content": "the Q-j pair creates some issues and no lowercase 'g' makes it less useful for type testing, but it's fun.\n\n"
    },
    {
      "time": "30 Aug 2007 — 1:35pm",
      "content": "Hopefully this makes up for a lack of brevity by its typographic skew. I wrote it for my specimens in Indie Fonts 3:\n\n_The formal qualities of a typeface energize, facilitate and inform the typographic layout. Skilled typographers will leverage the attributes of judiciously chosen fonts to maximize the personality of the page, thereby standing out from the crowd._\n\nAll 26 are covered up to the \"x\" in maximize, but I needed a few more letters for condensed and italics, and being an ad man from way back, had to close with a benefit (if not a call to action).\n\n"
    },
    {
      "time": "30 Aug 2007 — 2:25pm",
      "content": "My friend Mr. Google identified some [more pangrams here](http://web.archive.org/web/20150305002720/http:/brainyplanet.com/index.php/Pangram?PHPSESSID=c7fcde128920d0c8d0cce362ef6849d3), including this impressive 27 letter one, with no proper names or abbreviations:\n\nBrick quiz whangs jumpy veldt fox.\n\nHe also turned up what is probably the source of the supposed T.E. Lawrence pangram, or at least the definitive word on it: [An article by Bob Franks](http://web.archive.org/web/20150305002720/http:/tenotes.org/tenotes/previous_issues.htm#1992) in the Dec. 1992 issue of T.E. Notes--A T.E. Lawrence Newsletter.\n\nHere are some called 'exceptional' at the 'Brainy Planet' link:\n\nThe quick brown fox jumps over the lazy dog. (9 words, 35 letters)  \n Sympathizing would fix Quaker objectives. (5 words, 36 letters)  \n Quick fawns jumped over the big lazy ox. (8 words, 32 letters, Parade 6/30/02)  \n Pack my box with five dozen liquor jugs. (8 words, 32 letters)  \n Jackdaws love my big sphinx of quartz. (7 words, 31 letters, Marvin Moore)  \n Quick waxy bugs jump the frozen veldt. (7 words, 31 letters)  \n The five boxing wizards jump quickly. (6 words, 31 letters)  \n Victors flank gyp who mixed job quiz. (7 words, 30 letters)  \n Judges vomit; few quiz pharynx block. (6 words, 30 letters)  \n How quickly daft jumping zebras vex. (6 words, 30 letters)  \n Foxy nymphs grab quick-lived waltz. (5 words, 29 letters)  \n Dub waltz, nymph, for quick jigs vex. (7 words, 28 letters, Stephen Smith)  \n Blowzy frights vex, and jump quick. (6 words, 28 letters, magazine contest 1964)  \n Why jab, vex quartz-damping flocks? (5 words, 28 letters, David J. Porter)  \n Bawds jog, flick quartz, vex nymph. (6 words, 27 letters, Sir Jeremy Morse)  \n Brick quiz whangs jumpy veldt fox. (6 words, 27 letters)  \n Nth balks gyp, vex cwm fjord quiz. (7 words, 26 letters, Verbatim II-4)  \n Quartz glyph job vex'd cwm finks. (6 words?, 26 letters)  \n Cwm, fjord-bank glyphs vext quiz. (6 words, 26 letters, Dmitri Borgmann)  \n Jumbling vext frowzy hacks PDQ. (5 words, 26 letters, Chris Cole)\n\n"
    },
    {
      "time": "30 Aug 2007 — 3:03pm",
      "content": "Fontbureau sample PDFs usually include paras with a range of pangrams.\n\n"
    },
    {
      "time": "30 Aug 2007 — 9:06pm",
      "content": "It has come to my attention that the source for my r-rated pangram is Keith Schneider, a contest winner at P22. I didn't remember where I had picked that up, but credit where credit is due.\n\nSomeone wrote me saying Evil Sex Whores are not R-rated. I'll leave that to your own judgement.\n\n\"Come on kids, were going to see a matinee of \"Evil Sex Whores Run Amok\".\n\n"
    },
    {
      "time": "30 Aug 2007 — 10:47pm",
      "content": "_“Come on kids, were going to see a matinee of “Evil Sex Whores Run Amok”._\n\nYou talking about the movie \"Bratz\"? ;-)\n\nCome on, fontplayer, you know it's the fading pink zit that is the cause for controversy here. ;-D\n\n"
    },
    {
      "time": "31 Aug 2007 — 3:46am",
      "content": "\"You post this and ask us not to point out the kerning!? ;^P\"\n\nSeemed in the spriit, Lawrence not actually having any kerning with him at the time.\n\n"
    },
    {
      "time": "31 Aug 2007 — 6:40am",
      "content": "<cite>Come on, fontplayer, you know it’s the fading pink zit that is the cause for controversy here.</cite>\n\nI guess I had blinders on, what with the sex and all.\n\nThe point was made that sex, whores, and evil are all mentioned in the Bible. I think if people knew this, more of them would read the Bible.\n\n"
    },
    {
      "time": "31 Aug 2007 — 6:57am",
      "content": "Sounds like what we need is a double pangram, with all 26 lower case letters, and all 26 uppercase.\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:24am",
      "content": "Just in time for the new school year, I've come up with a new personalized pangram.\n\nProfessor Craig Eliason quizzes a bawdy mix of jokers and thieves.\n\n(Mark's [helper](http://web.archive.org/web/20150305002720/http:/www.ms-studio.com/Animation/pangrammerhelper.html) is great fun!)\n\n"
    },
    {
      "time": "31 Aug 2007 — 10:10am",
      "content": "Dude, zits also mentioned in the Bible. Leviticus baby!\n\n"
    },
    {
      "time": "14 Feb 2008 — 8:05am",
      "content": "Thanks to Mark's invaluable helper, I devised personalized pangrams for my wife and me:\n\nQueer jowly AKMA dupes zaftig beach vixen.\n\nand\n\nMargaret quickly zips jinxed whiff above.\n\nThe caps of \"AKMA\" make it less useful for examining type, but it's nonetheless fun to have showings with your name built in.\n\n"
    },
    {
      "time": "2 Sep 2007 — 11:06am",
      "content": "I'm using \"Ebenezer unexpectedly bagged two tranquil aardvarks with his jiffy vacuum cleaner!\" from now on. That's amazing.\n\n"
    },
    {
      "time": "25 Jul 2008 — 10:52pm",
      "content": "Weak-ass non-sequential pangrams...\n\nAbacist's deaf dog hijacked luminous parquetry studio, avows ex-yakuza.\n\nIt even contains an homage to the venerable \"quick brown fox\".\n\nhhp\n\n"
    },
    {
      "time": "22 Sep 2009 — 7:42am",
      "content": "I prefer \"The five boxing wizards jump quickly.\"\n\n"
    }
  ]
}
