{
  "id": "36624",
  "title": "Tech suggestions requested, old app running in Classic",
  "forum": "Design",
  "tags": [

  ],
  "content": "All:\n\nI need to arrange a sizeable number of ornaments and would like to use BorderMaker.\n\nI am away from home base — where I have a G3 Mac running System 9.2 and System 8.6 — and with me at the moment I have only my aluminum PowerBook, which runs Sys 10.3.9 and Classic.\n\nI have the BorderMaker folder on a b/u CD from my G3, so I drag-copied it onto the PowerBook, initiated the app by double-clicking it, Classic started up, and the splash screen appeared for BorderMaker. But now the app hangs and will not present a menu.\n\nI started by posting a note asking if anyone is still using BorderMaker. Now I am broadening this to ask help from anyone who can suggest how to troubleshoot the running of a Pre-Cambrian application on Classic.\n\nAny tips very gratefully received! I can do this in Quark but it sure would be nice to use Bordermaker.\n\nBruce\n\n [‹ Font for the small print](http://web.archive.org/web/20080208043006/http:/www.typophile.com/node/36897 \"Go to previous forum topic\") [Adobe Font Folio 11 ›](http://web.archive.org/web/20080208043006/http:/www.typophile.com/node/36865 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080208043006/http://www.typophile.com/user/15637\" title=\"View user profile.\">Bruce</a>",
  "time": "<br>",
  "uid": "15637",
  "comments": [
    {
      "time": " 30.Aug.2007 7.07am",
      "content": "68K vs. PowerMac?\n\nI kept my Quadra 800 (68K processor) until around 2001, when it finally gave up the ghost. And the last time I used BorderMaker was probably before 2001. Maybe whatever work I did in BorderMaker was done on \\*that\\* computer, and therefore the application is not PowerMac friendly?\n\nOther apps in the Sys 9 folder seem to boot up just fine under Classic.\n\nThe creation date on the BorderMaker app is November 1994.\n\nBruce\n\n"
    },
    {
      "time": " 7.Sep.2007 5.27pm",
      "content": "I used to do this when I had a problem. I would shut off all but basic fonts and see if that works. If so find which font is crashing. 2nd I would take half the extensions out of the extension folder. If it works I would put half of the extensions that I removed back if it crashes I know its in that group etc. Most of the time it was a font sometimes it was an extension. Sometimes it’s a conflict with another app running.\n\n"
    },
    {
      "time": " 8.Sep.2007 6.34am",
      "content": "I didn’t see this until WLD posted. You need to restart under System 9, then install BorderMaker. You should then be able to restart under OS X and run BM using Classic mode. If you haven’t done that before, go to System Preferences and click on Start Up Disk and select OS 9, then restart and install BorderMaker. To switch back to OS X while using OS 9, go to Control Panels. From there you can select OS X from the Start Up Disk preferences.\n\nThe problem is that BorderMaker is looking for system preferences and extensions that weren’t install. And you can’t install them while running in Classic mode. At least that’s been my experience.\n\nI hope that works for you.\n\n"
    }
  ]
}
