{
  "id": "36625",
  "title": "Type-Pet Peeves",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "We have one discussion going on right now about the lower case a in Kabel Book.\n\nThat got me thinking about things in fonts that really disturb me. I LOVE the family - Today…but…I cannot stand the ampersand that was designed for it.\n\nAny one else have any grips over letters, punctuation, etc. in any font that you fancy?\n\n [‹ Vogue, Metro](http://web.archive.org/web/20080906115327/http:/typophile.com/node/36632 \"Go to previous forum topic\") [Jenson from Updikes book ›](http://web.archive.org/web/20080906115327/http:/typophile.com/node/36661 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906115327/http://typophile.com/user/6012\" title=\"View user profile.\">Jackie T</a>",
  "time": "<br>",
  "uid": "6012",
  "comments": [
    {
      "time": " 30.Aug.2007 7.03am",
      "content": "I’m going to do this off the top of my head, rather than consulting the actual fonts first, so I may be inserting foot in mouth, but . . .\n\nI dislike the “zero” characters in Sabon and Stempel Garamond that are (respectively) a perfect circle, unstressed, and a character with equal weight on both sides and vertivcal rather than oblique stress. Both of these seem sharply arresting to my eye rather than flowing, because their personalities look (to my eye at least) so different from all their sibling glyphs. Do others find this charming in these two cases? Or are you also bothered by this? The Sabon 0 actually looks like a wrong font to me when combined with the other o.s. figs.\n\nBruce\n\n"
    },
    {
      "time": " 30.Aug.2007 7.11am",
      "content": "I hate the ampersand in Rotis Sans. I also hate MS Trebuchet but especially the lowercase g.\n\n"
    },
    {
      "time": " 30.Aug.2007 8.01am",
      "content": "I despise the italic h where the leg curls back towards the stem. It comes from setting maths, and using 4 point sub-subscripts. Editors continually marking my work asking me to change the character to an h when it already was one. (at that size, especially on photocopies, it looks like a b.)\n\n"
    },
    {
      "time": " 30.Aug.2007 8.18am",
      "content": "Bruce, surely if those zero characters you dislike harmonized more with the rest of the alphabet, there would be a greater opportunity for confusing them with the letter “o”? Which typefaces have, in your opinion, zeroes that both harmonize and disambiguate?\n\n"
    },
    {
      "time": " 30.Aug.2007 9.13am",
      "content": "I dislike the question marks in Schneidler and Futura. Oh, and the apostrophes in lots of typefaces are WAY too bold in the heavier weights.\n\n"
    },
    {
      "time": " 30.Aug.2007 2.45pm",
      "content": "The zero characters mentioned are this way out of historical reasons, so they’re quite accurate this way ...\n\nI cringe each time I see the lowercase italic g of Galliard, which otherwise is such a lovely typeface, sigh ..\n\n"
    },
    {
      "time": " 30.Aug.2007 6.09pm",
      "content": "Nick,\n\nI see your point about ambiguity, but wouldn’t the context of most encounters tell me if I am looking at a lower-case oh or a zero? The reason I mentioned these two instances is that in both cases I find the characters to be jarring in their dissimilarity to all the other characters in the two fonts.\n\nI am only a user of types and not a designer, so I am well aware of all that I do not know. But Jackie asked the question, “What are your peeves?” and this was what first came to my mind.\n\nI don’t have Stempel Garamond so cannot speak to that particular zero. but in the example I’ve furnished, I feel that the zeros blend more harmoniously with the rest of the characters in all the fonts shown, except Galliard and the two Sabons. Even though Adobe Garamond has a round zero similar to Sabon’s, it manages to provide enough weight that it fits in. Both Dante and Bembo manage to give the zero less width, and less variation in stroke weight, than the oh, while still keeping the color of the characters similar. To my eye Galliard and Sabon have zeros that seem “other,” even if there is historical precedent for them to be that way (and I certainly do not deny this). It simply means that I am less attracted to using them because of these zeros.\n\nI am away from home so do not have my reference books, but did Tschichold make the zero this way right from the start in all three versions (lino, mono, foundry) and it never changed?\n\n ![](http://web.archive.org/web/20080906115327im_/http:/typophile.com/files/zeros_4066.jpg)\n\n"
    },
    {
      "time": " 30.Aug.2007 9.27pm",
      "content": "Coming from the free font world: I hate fonts with no punctuation. You made a font, and couldn’t even put a **freakin’ period in it????**\n\nI know it’s free, but come on...  \n; )\n\n"
    },
    {
      "time": " 30.Aug.2007 11.18pm",
      "content": "Here are a few of mine, the ones that rankle the most and keep me from deploying a typeface for as many uses as I might otherwise prefer:\n\n ![](http://web.archive.org/web/20080906115327im_/http:/typophile.com/files/funky%20glyphs_4103.jpg)\n\n"
    },
    {
      "time": " 31.Aug.2007 4.27am",
      "content": "When a 2 makes a nearly closed circle, such as in Kabel and Bauhaus, it looks too much like a 9, it looks stupid, and it always used to bother me. But it’s been a few decades since I’ve found any reason to use those faces regardless.\n\n"
    },
    {
      "time": " 31.Aug.2007 4.50am",
      "content": "The upside-down curved stroke of the question mark in Stempel Schneidler. It calls way too much attention to itself and detracts from smooth reading.\n\n"
    },
    {
      "time": " 31.Aug.2007 5.08am",
      "content": "Tina,  \nI suggest You try the alternate lowercase italic g.\n\n ![](http://web.archive.org/web/20080906115327im_/http:/typophile.com/files/galli_3678.jpg)\n\n"
    },
    {
      "time": " 31.Aug.2007 5.26am",
      "content": "There’s a similar thread [here](http://web.archive.org/web/20080906115327/http:/www.typophile.com/node/30598).\n\n"
    },
    {
      "time": " 31.Aug.2007 5.28am",
      "content": "Um, the galliard g is in the Carter & Cone version, and unfortunately I can’t find it right now on the net. Must be somewhere.\n\n"
    },
    {
      "time": " 31.Aug.2007 9.26am",
      "content": "\\> _Here are a few of mine, the ones that rankle the most and keep me from deploying a typeface for as many uses as I might otherwise prefer:_\n\nHaha, that is interesting, because the characters you mention; the ’g’ of Auto and the ’g’ and ’y’ of Dolly, are in fact amongst my favorite characters of those typefaces.\n\n"
    },
    {
      "time": " 31.Aug.2007 10.28am",
      "content": "Fontplayer, as a Finnish designer I can’t cope with fonts without ä, å and ö. It always depresses me to find a lovely font, and then to find out it’s only meant for English typesetting, so that if I was to use it, I would have to build the umlauts myself (not a good idea). I’m sure other Europeans (not to mention non-latin letter users) have even more problems with the more unusual glyphs.\n\nI have a few fonts in my collection with just the basic English alphabet, and sometimes, if I’m lucky, I can use them for a headline or a short text, if there are no “strange” letters in the text. Rest of the time they’re just gathering dust.\n\n"
    },
    {
      "time": " 31.Aug.2007 10.43am",
      "content": "Bruce, I see what you mean — it is not the monoline, circular form of the zero _per se_ that bothers you, but its self-conscious deployment.\n\n"
    }
  ]
}
