{
  "id": "36632",
  "title": "Vogue, Metro",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello typophiles,  \nAmongst other things, I was recently passing through this small vacated town of Saguache, Colorado, and stumbled across one of four Linotype Newspaper printers in the USofA, and the only legit business operating out of the small ’downtown’ stretch of this small valley town. I was able to have a few words with the sole proprietor, Mr. Dean Coombs, who is keeping the family business alive and true to form. We chatted about the equipment, type addiction, the great depression, trees and the circus. It was a very pleasant and unexpected stop on a trip through the valley.\n\nAnyhow, he gifted me a stapled print-out which pretty much represented his type library of Linotype typefaces. I noticed a couple that I haven’t seen or heard of, and some once popular but now lost ones as well. I can write out a list of what he has on hand if anybody’s interested. The ones I’m particularly interested are Vogue and all the varieties of Metro.\n\nI’ve seen that there was some discussion on Vogue and a little bit of history, but really, when is there going to be a digital release of this? I cannot be the only one who would love to have it. As a Chicagoan, I identify this face with many of the 60’s and 70’s soul and funk 45s coming out of the city, and it’s something I would love to be able to use (it’s all in the lowercase a). Is there anything close?\n\nAs for Metro—Metromedium, Metrolight, Metroblack, I see that there is a [digital version](http://web.archive.org/web/20081123060214/http:/www.fontshop.com/fonts/singles/linotype/metrolite_no_2/) available, but it doesn’t look the same as in the sample I have here. I’d like to know more about this typeface in general, and where it stands with Vogue, Futura and all the geometric sans faces being produced.\n\nAnyhow, if you’re ever in the area, I would highly recommend paying this place in Saguache a visit. Very friendly and informative gentleman with quite an interesting shop.\n\nCheers,  \nDavid\n\n [‹ Avatars...](http://web.archive.org/web/20081123060214/http:/www.typophile.com/node/36152 \"Go to previous forum topic\") [Type-Pet Peeves ›](http://web.archive.org/web/20081123060214/http:/www.typophile.com/node/36625 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081123060214/http://www.typophile.com/user/7765\" title=\"View user profile.\">dcastillo</a>",
  "time": "<br>",
  "uid": "7765",
  "comments": [
    {
      "time": " 30.Aug.2007 10.16am",
      "content": "I’d love to see a heart-breakingly honest revival of Metro myself, but a true Metro revival will never happen so long as Linotype own’s the rights. (I’m not rabble-rousing. Just fact stating.) They have release a new version of Metro which has some of the old details back, but the blood of Akira is running through it as well. (Again a good thing.)\n\n"
    },
    {
      "time": " 30.Aug.2007 1.47pm",
      "content": "Just for the sake of completeness, there are four digital versions of Metro:\n\n- Linotype’s [Metrolite](http://web.archive.org/web/20081123060214/http:/www.fontshop.com/fonts/downloads/linotype/metrolite_no_2_virtual/), [Metromedium](http://web.archive.org/web/20081123060214/http:/www.fontshop.com/fonts/downloads/linotype/metromedium_no_2_virtual/), [Metroblack](http://web.archive.org/web/20081123060214/http:/www.fontshop.com/fonts/downloads/linotype/metroblack_no_2_virtual/)\n- Bitstream’s [Geometric 415](http://web.archive.org/web/20081123060214/http:/www.myfonts.com/fonts/bitstream/geometric-415/?refby=typographica), which varies slightly from Linotype’s digitization, and includes italics\n- Linotype’s [Metro Office](http://web.archive.org/web/20081123060214/http:/www.linotype.com/135960/metrooffice-family.html), Akira Kobayashi’s liberal interpretation made to fit the widths of their [Office Alliance](http://web.archive.org/web/20081123060214/http:/www.linotype.com/186374/officealliance-clan.html) set\n- FontHaus’s [DH Sans](http://web.archive.org/web/20081123060214/http:/www.myfonts.com/fonts/dsgnhaus/dhsans/?refby=typographica) with questionable obliques\n\n"
    },
    {
      "time": " 30.Aug.2007 2.10pm",
      "content": "_I’d love to see a heart-breakingly honest revival of Metro myself, but a true Metro revival will never happen so long as Linotype own’s the rights_\n\nThere’s nothing to stop anyone doing a revival, although they would not be able to name it Metro.  \nIf the design (1930) were literature or music, it would be public domain by now, so even though there is no legal copyright on type designs, there would be nothing unethical (in the informal understanding of those in the type business who care about such things) in copying Dwiggins’ design.  \nYou beg the question of what a “true” revival would be, as there is so much room for interpretation between letterpress and offset (and screen) typography. Would “honesty” include a trace of the letterpress process?\n\n"
    },
    {
      "time": " 30.Aug.2007 2.24pm",
      "content": "No, I don’t think so. Because to be that honest it would have to follow Dwiggins’s love of the crisp. Perhaps it would have ever so tiny roundings on the corners, but that would be it. I’d want to see the sparkle just as he would.\n\n"
    },
    {
      "time": " 31.Aug.2007 5.43am",
      "content": "David —\n\nI suspect (without seeing samples) that if the Metro you’re looking at differs markedly from the digital versions, then it is probably because Mr. Coombs has matrices of the original Metro fonts, as opposed to Metro No. 2 fonts.\n\nAfter the initial release of the Metro family (which took place over several years, starting in 1929 with Metroblack), a decision was made to change several characters and re-release the fonts with the suffix “No. 2”. These became more popular and are the forms that have made it into the digital versions, and the originals are now rarely seen.\n\nIf I’m correct, then you’ll notice dramatic differences in a few key characters: a and g will be most obvious — they will be 2-story forms.\n\nOther characters that changed between the original and the No. 2 are:\n\nA M N V W v w — all vertices were given sharp points; G — spur was raised and given a cross-bar; J — was raised to rest on baseline and given more curve; and comma & quotes were given a more simplified, flatter form.\n\nAll of these adjustments give Metro No. 2 a more geometric flavor than the original design. I think these changes may have preceded the release of Futura. But they may have been a response to Futura. I’d have to confirm dates, which I don’t have at hand right now.\n\n— K.\n\n"
    },
    {
      "time": " 31.Aug.2007 9.38am",
      "content": " ![](http://web.archive.org/web/20081123060214im_/http:/www.typophile.com/files/metro8_5515.jpg)\n  \n6, 8, 10, 12, 14, 18, 24 pt. size, Metrolite No. 2, from the 1958 Linotype catalog.  \n(18 and 24 pt. are Two-letter display; the One letter-display for 24 pt. has the different “a” also).\n\nThree authorship issues to consider in a revival:  \n1. Variance of size specific masters  \n2. Effect of press gain at different sizes (traces of the letterpress process)  \n3. Alternates: this catalog shows the original non-sharp-pointed capitals Kent mentions available as alternates, along with two-storey “a”, two-storey “g”, and Kabelized “e” (diagonal crossbar) and W (overlapping Vs). In fact, a choice of three forms for cap W!\n\nSo, a redesigner could make a character true to:  \nThe designer’s authorship: original drawing.  \nThe printer’s authorship: a revival from a choice of different quality printed samples: eg on different paper stocks, and also a choice of different size-specific masters.  \nThe foundry’s authorship: the original foundry’s specification of which alternate form is the default.\n\nA redesign resolves the many often conflicting shapes and processes involved in the various originals. For instance, Linotype’s Metro Office adopts the alternate forms of (3) above as default.\n\n"
    },
    {
      "time": " 31.Aug.2007 11.51am",
      "content": "Thanks for the info + history. I hope that someday I could provide something to the depths that many of you continue to do.\n\nFrom this printout the Metro samples do contain 2-storey lowercase a’s but are still labeled as No. 2, so I’m assuming this has to do with the alternate characters provided? I notice that Mr. Coombs has both Metrolite and Metrolight printed on this sheet. I wonder if this is merely a typo or not.\n\nIn any regard, a really nice typeface. I like the soft-tailed lowercase t’s as opposed to the coldness of Futura’s (which both certainly have their place). The nice little bits of humanistic traits seem to be executed in good taste. My only question would be which digital version do people prefer? Do any of them come with the alternate characters?\n\n"
    }
  ]
}
