{
  "id": "36631",
  "title": "School yearbook fonts",
  "forum": "Design",
  "tags": [

  ],
  "content": "I hope this is in the right forum, apologies if it’s not. Anyways:  \nI’m in my final year in school and starting work on the school yearbook. I’ve been somewhat involved with various school magazines/newsletters etcetera over the past few years, and one thing which has always seemed lacking is the choice of typeface. Does anyone have any suggestions for what typeface to use, for articles, headlines, captions and so on? I (as you’ve probably all guessed) have little experience in typography beyond picking from the drop-down list in MSWord, so this whole typography community is all a bit intimidating at the moment. How many different fonts should be used in any one publication? Should you use the same font for headings as in an article, or are there guidelines on which fonts work together well? Any suggestions (or links to “beginners guide to typography” or similar) would be much appreciated.\n\nThanks,\n\nmuirgheasa\n\n [‹ Akzidenz Grotesk](http://web.archive.org/web/20081202192217/http:/www.typophile.com/node/37304 \"Go to previous forum topic\") [Hinting problem ›](http://web.archive.org/web/20081202192217/http:/www.typophile.com/node/37340 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202192217/http://www.typophile.com/user/21263\" title=\"View user profile.\">muirgheasa</a>",
  "time": "<br>",
  "uid": "21263",
  "comments": [
    {
      "time": " 30.Aug.2007 11.54am",
      "content": "I’m afraid that you’re asking for a magic wand; a well-developed typesense is usually the product of years or school, or professional experience, or both.\n\nNonetheless, a few handy tips:\n\n1. Don’t use Comic Sans.\n2. Don’t use scripts in ALL CAPS.\n3. Don’t use Old English-stype fonts in ALL CAPS.\n4. Match the typeface to the message..\n\n"
    },
    {
      "time": " 31.Aug.2007 7.50pm",
      "content": "Go to the library and lookup yearbook design.\n\n"
    },
    {
      "time": " 2.Sep.2007 6.45pm",
      "content": "I hope you’re not trying to do the yearbook in MS Word.\n\n"
    },
    {
      "time": " 2.Sep.2007 7.00pm",
      "content": "Printers that have specialized yearbook divisions can offer a lot of advice and even training in yearbook design and production. For example, Friesens, [http://www.friesens.com/yearbook/ct/fladefault1.aspx?bhcp=1](http://web.archive.org/web/20081202192217/http:/www.friesens.com/yearbook/ct/fladefault1.aspx?bhcp=1 \"http://www.friesens.com/yearbook/ct/fladefault1.aspx?bhcp=1\") , and there are no doubt many others if you Google (I happen to have used Friesens for printing regular trade books).\n\n"
    },
    {
      "time": " 2.Sep.2007 9.59pm",
      "content": "I’ve been thinking more about yearbooks. I was a writer on one many years ago, but have never designed one. Yearbooks tend to have a diverse array of content, so I would look at the typography as a way of helping to unify the whole thing. So, not too many typefaces: a sans serif for captions and sidebar material, a serif for longer text, and perhaps a display face for major section titles if the serif or sans was not suitable for that purpose. You can set subheads in the sans when using the serif for text, or use the serif in a larger size, a semi-bold, or italic. Be consistent throughout whatever you do.\n\nAs to specific typefaces, that depends on the desired tone of the publication—-is it to be serious, casual, artsy, funky ... Perhaps if you tell us a bit more about your yearbook, we can suggest some possible typefaces and combinations.\n\n"
    },
    {
      "time": " 9.Sep.2007 5.59am",
      "content": "Thanks for the replies. I realise that I’m not going to develop a well developed typesense in between final year studying and actually designing this thing, but nonetheless I’m hoping that I can, with a bit of help, come up with a small selection of fonts to use which are aesthetically better than Times New Roman, but which are equally legible and, hopefully, can help tie the whole thing together.\n\nWe’re using a program called Scribus for the design, which is another issue I hadn’t previously even considered; scribus is appareantly quite fussy about using low quality fonts, and won’t approximate Italics, Bold etc. I don’t know how much experience anyone on here has working with scribus (or if you’ve even heard of it), but as I say it’s appareantly quite fussy with what fonts will work with it.\n\nAs for the look of the book, we’re going after a light, informal design, with a lot of photos and (relatively speaking) not a huge amount of text (although there will be things like the principal’s foreword and maybe one or two articles on other things as well). So I suppose a fairly major issue is what type of font to use for captions. Is it generally advisable to use the same font as you use for body text, or are there any rules of thumb for that sort of thing at all?\n\nThanks again,\n\nmuirgheasa\n\n"
    },
    {
      "time": " 21.Sep.2007 6.50am",
      "content": "\\*Bump\\*\n\nAny more suggestions, anyone?\n\n"
    },
    {
      "time": " 22.Sep.2007 12.47pm",
      "content": "Hi there, back when I was in High School I was the editor the our yearbook 2 years in a row. The company we dealt with had a restriction on the fonts we could use (no idea of the reason now) so you should look into that just in case.\n\nMinion is a good alternative to Times New Roman. But you know there’s no rule you -have- to use a serif for the body copy. Esp if it’s shorter. Since you have limited experience and the will make everything look good (which is awesome. We cared more about putting more pictures of the grads in the yearbook as opposed to good design) I would try and stick with as few fonts as possible. Why don’t you use News Gothic predominately and then some display faces for headlines. Maybe Rockwell or something.\n\nGood luck!\n\n"
    }
  ]
}
