{
  "id": "36654",
  "title": "Multiple Master Font disaster",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I just went through a horrendous experience -- I was trying to make a pdf of one of the magazine pages -- and it kept bombing out QuarkXPress (yep the latest 7.3) two hours of hair pulling.\n\nI finallly went into the ads on the page and found one that had used NuevaMM -- and there was the culprit.\n\nSo I figure I'd write to you and maybe save you some bald spots -- and let you know that -- it isn't nice to give a busy person an ad with an MM font in it... LOL\n\nHappy to say, Photoshop has flattened the PDF - no one but you guys will know - and now I can get the work out to the printer. You think I'm a little late? My September/October issue - which should be in folks hands right now -- will be uploaded to the printer...\n\nWhew and Good-night Grace.\n\n",
  "author": "Jackie Frant",
  "time": "30 Aug 2007 — 6:18pm",
  "uid": "6012",
  "comments": [
    {
      "time": "31 Aug 2007 — 6:35am",
      "content": "You didn't say what platform on which you work, but Adobe's Thomas Phinney recently posted that Adobe Multiple Master fonts will not work on Vista.\n\n[http://www.adobeforums.com/cgi-bin/webx?14@@.3bc3d9b2/26](http://web.archive.org/web/20130222063044/http:/www.adobeforums.com/cgi-bin/webx?14@@.3bc3d9b2/26 \"http://www.adobeforums.com/cgi-bin/webx?14@@.3bc3d9b2/26\")\n\nAlso: \"Our testing also shows some significant problems with ATM (Light or Deluxe) on Vista; it's not just that we don't support it, but we actively recommend you not try running it on Vista. \"\n\n\"That being said, we realize that people have different expectations for fonts than other software, and we've made an effort to help with the migration from MM fonts (and Type 1 fonts in general) to OpenType. However, the writing is on the wall for all Type 1 fonts in Windows....\"\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:04am",
      "content": "Has Adobe ever offered to provide people who purchased MM fonts with a free OT replacement?\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:31am",
      "content": "From the same posting as the link I posted:\n\n\"Years ago, after Adobe discontinued sales of MM fonts, and before we discontinued support, we made a special heavy-discount offer for registered owners of those MM fonts for equivalent OpenType fonts. I think it was 50% off. However, this was back in 2003 or 2004, IIRC. There is no current free upgrade path, and the OpenType versions have considerable extra capabilities compared to the original versions.\"\n\n"
    },
    {
      "time": "31 Aug 2007 — 8:29am",
      "content": "Keep in mind that there were less than 50 commercial MM fonts released. Of these, a good number are things like Minion, Myriad, Nueva, etc., which are provided in OTF format with the Creative Suite. So, I think Adobe's position has been pretty reasonable.\n\n"
    },
    {
      "time": "31 Aug 2007 — 9:01am",
      "content": "I must agree. I think that Mr Phinney is a great asset to the world of typography and have always found his positions to be quite reasonable.\n\nAlso, I met him once and he was remarkably polite to me! May not mean much to you...\n\nD\n\n"
    },
    {
      "time": "31 Aug 2007 — 9:09am",
      "content": "BTW, FYI and all those other initials\n\nI use a Mac G5  \nSystem 10.4.9\n\nI keep forgetting that some folks stick to IBM... rofl\n\nAnd I remember replacing my own MM fonts - but I can now see from my wasted time and hair pulling, some folks didn't. The font they used was Nueva -- The art department that submitted the ad should be aware of it....\n\nThanks for the comments.\n\n"
    },
    {
      "time": "31 Aug 2007 — 10:19am",
      "content": "\". . . and the OpenType versions have considerable extra capabilities compared to the original versions.”\n\nThe only Adobe MM font I ever had was Myriad. Now I have the Myriad Pro that came with CS. For my purposes it doesn't offer anything extra that the MM version did; in fact, I find it less capable because I liked to fine-tune weights and widths. I wouldn't have wanted to buy it even at 50% discount. I suupose I could generate MM instances I liked and generate them as separate fonts to use in OpenType format.\n\n"
    },
    {
      "time": "31 Aug 2007 — 11:11am",
      "content": "\\> _For my purposes it doesn’t offer anything extra that the MM version did_\n\nYes, if you don't need Extended Latin, Greek, Cyrillic and OpenType capabilities, Myriad MM is probably enough.\n\n"
    },
    {
      "time": "31 Aug 2007 — 11:34am",
      "content": "MM Nueva has caused a lot of trouble at an agency I freelance for occasionally. Their solution is to outline the font before printing (they usually work with Freehand and a non-intel mac).\n\n"
    },
    {
      "time": "1 Sep 2007 — 11:52am",
      "content": "mili - Adobe Illustrator wouldn't use the Nueva MM when I dropped the pdf into it. But... fortunately, Photoshop was able to open the pdf and well, saved as an .eps no problem. Just irks me how much time it took...\n\nAlso. that same exact ad worked well for the past few issues, it was just all of a sudden with this one - and the only changes - 7.1 to 7.3 in Quark and 10.4.9 System going to 10.4.10 -- so go figure!\n\n"
    },
    {
      "time": "1 Sep 2007 — 5:55pm",
      "content": "If I remember correctly Illustrator CS1 still had MM support with the palette that allowed you to alter them.\n\nAnd once it was altered those instances were available in the other Adobe CS1 programs.\n\nAt the same time they included Myriad Pro, Nueva Pro and Minion Pro (perhaps others) in the CS1 release to ease the pain of MM dying. Myriad Pro does it pretty proficiently but certainly Nueva Pro was a less substantial release.\n\nAt the time I was involved in a multi-year project that had Myriad MM specified for the identity. I was able to transition to Myriad Pro thanks to the free release of Myriad Pro with CS1. So thanks Adobe.\n\nAlthough I do miss MM - it seemed like a very good idea at the time…\n\npbc\n\n"
    },
    {
      "time": "5 Sep 2007 — 3:41am",
      "content": "I just got the proof back from the printer -- and before sending it back, was fortunate to receive \"one more ad\" for placement. This one too, contained an MM font. But within 30 seconds I had an Adobe Photoshop .eps file - and no problems.\n\nThis thread was started to help people through what might be a horrendous experience, like the one I had with the first pdf that was sent in by the other advertiser.\n\nThank you all for your responses.\n\n"
    },
    {
      "time": "5 Sep 2007 — 11:06pm",
      "content": "I keep a G3 around with OS 9.2.2 to make MM instances, and actually, to do most of my modification work in Fontographer and FontLab. The trick I've learned to port them over to anything that works on OS X is to compress them with Stuffit. If not, OS X rips out the resource forks. If so, when opened up in OS X, oh looky here, a PS1 font, how quaint.\n\nTypographically though, doesn't matter the format, good type is good type, doesn't matter if it originated in 1452 or 2007.\n\nGerald\n\n"
    }
  ]
}
