{
  "id": "36658",
  "title": "Advice please: Recent Type Design and the Screen",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi there,\n\nI am writing my first article in a monthly column for a popular Japanese design portal/blog called CBC-NET.\n\nMy article is basically a call for Japanese designers to consider contemporary typefaces for their designs, basically a continuation of the theme for my interview series on [my own site](http://web.archive.org/web/20150424142014/http:/www.aqworks.com/blog).\n\nOne of my arguments is that recent typefaces are more likely to work better on the screen, thanks to lower-contrast strokes, larger x-heights, more open forms. I know this isn't always the case, there is plenty of old type that is suitable for the screen and plenty of new type that isn't, but I suppose that typography for the web has become a consideration for many type designers during the design process.\n\nSo my question:\n\nCan you recommend some typefaces that I can introduce in my article where screen use was a consideration? I'm not really looking for OS system fonts, pixel fonts or anything that specific designed for the screen, but something that was designed for general use, but for which screen use was \\*one\\* consideration.\n\nI'm hoping to introduce a few serifs and a maybe one sans, the serifs because they traditionally have more trouble on the screen. Some low-contrast serif faces I was considering: Dolly, Fedra, Jenny.\n\nthanks for your help!\n\n",
  "author": "cpalmieri",
  "time": "30 Aug 2007 — 9:13pm",
  "uid": "1956",
  "comments": [
    {
      "time": "30 Aug 2007 — 9:21pm",
      "content": "You could look at signage fonts, which tend to work well on screen.\n\n"
    },
    {
      "time": "30 Aug 2007 — 10:10pm",
      "content": "Nice idea, Si.\n\nAlso [ITC Charter](http://web.archive.org/web/20150424142014/http:/www.fontshop.com/fonts/downloads/paratype/itc_charter_ot/), which was designed back in the early digital days for low-res printers.\n\n"
    },
    {
      "time": "30 Aug 2007 — 10:23pm",
      "content": "As for sans, anything square and wide does better on screen, due to the pixel grid. Although this may be changing now due to modern antialiasing technologies like Cleartype.\n\nI use [Amplitude Wide](http://web.archive.org/web/20150424142014/http:/www.fontshop.com/fonts/downloads/font_bureau/amplitude_1_wide/) as my email, iChat, and browser default and it works beautifully at [11 pts](http://web.archive.org/web/20150424142014/http:/www.fontshop.com/fonts/singles/font_bureau/amplitude_wide_regular/?sample_text=Date%20Received%3A%20Aug%2020%2C%202007%20%20%20From%3A%20Gob%20Bluth%20%20%20Subject%3A%20I'm%20Your%20Boss%20Now&sample_size=11).\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:11am",
      "content": "Weren't most of the new MS typefaces in Vista designed with that in mind?\n\n"
    },
    {
      "time": "31 Aug 2007 — 8:25am",
      "content": "Yes. But with only Windows Vista users in mind.\n\n"
    },
    {
      "time": "4 Sep 2007 — 6:50am",
      "content": "Thanks for the tips. I ended up throwing Amplitude into the article because of the way it notches out the corners. Should be online in a few days, but unfortunately, Japanese only.\n\nChris\n\n"
    },
    {
      "time": "4 Sep 2007 — 1:22pm",
      "content": "\\>Yes. But with only Windows Vista users in mind.\n\nActually, no. They were designed with ClearType in mind. ClearType is not a Vista-only rendering technology.\n\n"
    },
    {
      "time": "4 Sep 2007 — 3:04pm",
      "content": "I'm sorry. Vista and XP?\n\n"
    },
    {
      "time": "4 Sep 2007 — 3:35pm",
      "content": "A ClearType licensing program was announced in 2003, it's offered as part of iType, Monotype Imaging's rasterizer. But I was specifically thinking of WPF which is going cross-platform (at least when I last saw a blog entry on it). Also Windows Mobile, Windows CE, and Windows embedded on various devices. And there are also other implementations - such as Freetype... [http://david.freetype.org/cleartype-patents.html](http://web.archive.org/web/20150424142014/http:/david.freetype.org/cleartype-patents.html \"http://david.freetype.org/cleartype-patents.html\")\n\n"
    }
  ]
}
