{
  "id": "3665",
  "title": "(x) Plastic Fantastique - (similar to) Estro {Mike Y}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Anyone?   \n   \n ![Whatthefont?](http://web.archive.org/web/20131020233329im_/http:/www.typophile.com/forums/messages/83/28826.jpg)\n\n",
  "author": "brennan",
  "time": "18 Mar 2004 — 2:54am",
  "uid": "641",
  "comments": [
    {
      "time": "18 Mar 2004 — 5:42am",
      "content": "The font is [Estro](http://web.archive.org/web/20131020233329/http:/www.fonts.com/findfonts/detail.asp?pid=206446). Image Club had it in their collection, but this is the Mecanorma version at Agfa that I have linked. URW also has a version at MyFonts.   \n   \nUnfortunately T-26 also has a font with this name, but it is quite different.\n\n"
    },
    {
      "time": "18 Mar 2004 — 6:11am",
      "content": "Thanks Mike.   \nFantastique work! ;)\n\n"
    },
    {
      "time": "18 Mar 2004 — 8:31am",
      "content": "Mike, I think the above sample is similar to Estro, but it's not the same face. Specifically, the serifs and the consistency of the stroke weights are quite different. I'm thinking this is a freeware Estro-inspired knockoff.   \n   \n ![Image Club Estro](http://web.archive.org/web/20131020233329im_/http:/www.typophile.com/forums/messages/83/28838.gif)\n\n"
    },
    {
      "time": "18 Mar 2004 — 9:03am",
      "content": "My thought was that it had possibly been outlined in the same color as the background, making it look 'slimmer'. Did you see if the Mecanorma Estro is identical to the one from Image Club? (I have them both, but I don't have time right now.)\n\n"
    },
    {
      "time": "18 Mar 2004 — 12:26pm",
      "content": "\\> _My thought was that it had possibly been outlined in the_   \n\\> _same color as the background, making it look 'slimmer'._   \n   \nThat's a possibility, but it looks to me that many of the characters are simply a different shape. Compare the bowls and curves of the lowercase 'a' and 'e'.   \n   \n\\> _Did you see if the Mecanorma Estro is identical to the one from Image Club?_   \n   \nI don't have the Mecanorma version, so a close compare isn't possible. Other than perhaps the extent of the character set (there weren't any ligatures in the Image Club version, for example...) the two faces are nearly identical.\n\n"
    }
  ]
}
