{
  "id": "36663",
  "title": "Dalton Maag call for EULA opinions",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "We've started to look at our EULA and feel it is necessary to have something better in place.\n\nHave a say what you would like to see: [http://www.daltonmaag.com/news/64.html?lang=en](http://web.archive.org/web/20131026183029/http:/www.daltonmaag.com/news/64.html?lang=en \"http://www.daltonmaag.com/news/64.html?lang=en\")\n\nBruno Maag  \nDalton Maag Ltd\n\n",
  "author": "bruno_maag",
  "time": "31 Aug 2007 — 2:57am",
  "uid": "3194",
  "comments": [
    {
      "time": "31 Aug 2007 — 3:12am",
      "content": "Is this the current EULA?  \n [http://www.daltonmaag.com/info/dama/EULA.pdf](http://web.archive.org/web/20131026183029/http:/www.daltonmaag.com/info/dama/EULA.pdf \"http://www.daltonmaag.com/info/dama/EULA.pdf\")\n\n"
    },
    {
      "time": "31 Aug 2007 — 3:27am",
      "content": "Yes.\n\nBruno  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "31 Aug 2007 — 5:22am",
      "content": "Hi Bruno:\n\nAllow a designer/user to take a PDF with your fonts embedded to a service bureau without requiring that bureau to have purchased a license- great for corporations but bad small guys... who actually follows that- Vodacom?\n\nLifetime version upgrades make consumers feel good too- add that.\n\nAnd generally the Eula is very clear but its too long. Simplify.\n\nI'm a huge fan of your company's work- I'm totally jealous of your loaded clients that get to commission exquisite custom type from you guys\n\nAll my best,\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "31 Aug 2007 — 6:04am",
      "content": "Mike, thanks for your compliment. Trust me though - the clients may be loaded but it's easier to get blood from a stone than money from them. This is particularly true when you need to sell the idea of a font to them when they simply can use one of the increasingly high quality system fonts.\n\nBruno  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:08am",
      "content": "My ideal EULA:\n\nThis font is for your use.\n\nYou may install it on X (at least 2) machines.\n\nYou may purchase site licenses for your office.\n\nYou may embed it media files (PDF, Flash).\n\nDo not give or distribute the font to others.\n\nYou may (or may not) modify the font for your own use.\n\nYou may (or may not) modify the font for your client's use (provided they also purchase a license).\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:12am",
      "content": "I would never even consider buying a font that requires the printer to also purchase said font.\n\nAllow embedding. At the very least allow non-editable PDF embedding, and if you aren’t going to allow web (Flash) embedding, make it easy for customers to purchase a license for web embedding without having to negotiate terms. This will be good for your business as SIFR catches on, and especially good when the W3C and Microsoft get web embedded fonts worked out and cross-browser web embedding is a reality.\n\nAllow alterations for internal use, provided that the font is not embedded.\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:43am",
      "content": "Bruno, I've not read your EULA recently. I'll have another read later. But, you should consider Adobe's EULA as something to follow.\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:44am",
      "content": "Like most people, I warrant, my eyes glaze over when faced with a page of bulleted legalese. A EULA free of whereases, wherefores, hereins, and herebys would be really nice. And don't change the rules: \"this agreement is subject to change without notice\" is frankly bullsheisse. Make it easy and painless for me to adhere to the terms of your EULA, and you've got me as a customer.\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:50am",
      "content": "PS; I applaud your asking the question of your customer base. Some of the language in your webpage might be nice as an intro to your EULA:\n\nFonts are a valuable asset in the toolbox of every designer and form an integral part of publishing, design and branding. It takes great design skill, experience and technical expertise to design and engineer a font which will perform across different environments. At Dalton Maag we carefully consider every curve, every serif; we consider the positioning of accents and superior numerals. But designing a font is an ongoing process; once a standard character set is published, we begin to plan expansion to other languages, or possibly more styles. We know the same is true for many of our colleagues in the font industry. This effort needs to be financed and protected to avoid unwitting or unscrupulous font piracy. It is why each commercial font has a legal contract, called an End User Licence Agreement (EULA), attached.\n\nA little education goes a long way.\n\nJN\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:50am",
      "content": "EULA can change without notice. But the EULA which is in effect when you license your font software is the EULA that stays with out. You cannot be retroactively dinged. Also, the EULA has to be full of legalese it is the language of lawyers.\n\nBut, that does remind me, Bruno you could have a EULA FAQ on your site. P22, House, and Adobe have something like this.\n\n"
    },
    {
      "time": "31 Aug 2007 — 8:14am",
      "content": "Miss Tiffany, I apologize for my lack of clarity. You are completely right that a foundry should change their EULA, but retroactivity is really really crappy. The EULA one agreed to at the time of licensing should be the one adhered to, not some possible future EULA.\n\nBut does the EULA REALLY need to be in legalese? Will courts not uphold contracts if they are written in plain language? (And don't ask our friend Uli...)\n\n"
    },
    {
      "time": "31 Aug 2007 — 8:25am",
      "content": "<cite>But does the EULA REALLY need to be in legalese?</cite>\n\nThat’s like asking if a Greek font really needs to be in the Latin alphabet, or if it can all just be replaced with Cyrillic glyphs. A EULA is—theoretically—a legally binding agreement and thus should be written in the style of a legal document.\n\n"
    },
    {
      "time": "31 Aug 2007 — 8:55am",
      "content": "Mr Puckett, I don't think I'm being an idiot in asking this question, and your analogy is not analogous. I'm simply asking if a legally binding agreement needs to be mired in legal mumbo-jumbo. I recently licensed a font, and remember the EULA being written in plain English. I forget who it was, but someone biggish. And I can't believe that a lawyer didn't approve it.\n\nJN\n\n"
    },
    {
      "time": "31 Aug 2007 — 8:58am",
      "content": "HA! Yes, Uli you aren't invited to this thread.\n\nNo, it is a fair question. But, the truth is it has to be in the language of the courts. I think it might, as you guessed, have to be in order to be \"respected\".\n\n"
    },
    {
      "time": "31 Aug 2007 — 9:28am",
      "content": "The legalese language EULAs are written is in fact one of my concerns. I don't understand half of it either.\n\nIt is my aim to have the EULA worded as simply as possible. If we can't do that - because of the legality of it - we intend to have a translation set up. However, this, again, needs to be approved by a lawyer and could (probably) not be considered legally binding so as not to contradict the EULA in the first place.\n\nThe process of buying a font is intrinsically linked with the EULA. It's always stumped me why font buying, particularly in the domain of multiuser licenses and corporate environements has to be such an aruous process. With the EULA we also aim to hopefully achieve very simple proceedures for multi users and all sorts of other things. We have written up a list of what we feel we need to cover. I am not going to publish this list here, though, since I do not want to prejudice your thoughts.\n\nTiffany, did not Adobe recently update its EULAs? From what I understand they have now stopped allowing people making modifications to fonts. I will have to read through it, though.\n\nBruno\n\n"
    },
    {
      "time": "31 Aug 2007 — 10:02am",
      "content": "I don't believe there is any actual requirement that a legal contract be in \"legalese\" so long as everything is absolutely clear. But lawyers and judges understand legalese and it probably makes them wary or uncomfortable when something is in plain [your language of choice]. That said, there is mumbo-jumbo legalese than only a lawyer can understand, and concise legalese that someone of average intelligence but lacking legal training can more or less figure out. It's the latter that would be preferred in an EULA.\n\nAn EULA needs to take into account the reality of the publishing world, otherwise it will simply be ignored. These days a font is fairly useless if it can't be embedded in a pdf, and of course one-time users such as a service bureau or printer should not be expected to have a licence for a font unless they are actually using it in-house for purposes other than simply outputting a client's file. And of course the holder of an EULA should have the right to sell or give away a font licence they have purchased, provide they don't keep a copy and the recipient agrees to abide by the EULA.\n\n"
    },
    {
      "time": "31 Aug 2007 — 10:47am",
      "content": "The problem is that EULAs are written for lawyers and courts. That makes it almost impossible for them to make sense to real people. I wish there would be a \"Clif Notes\" version also written in actual human language for the poor customers and type designers who are just trying to make sense of it all. This version would accompany the other and serve as an interpreter.\n\nChrisL\n\n"
    },
    {
      "time": "31 Aug 2007 — 10:49am",
      "content": "\"A EULA is—theoretically—a legally binding agreement and thus should be written in the style of a legal document.\"\n\nAn IOU on a cocktail napkin can be a legally binding agreement.\n\nThere is no rule that says 'it's a legal document, therefor, obfuscate it as much as you can with inane legal jargon'.\n\nBut, if one must, at least include the 'plain english bullet-point' summary with it.\n\nThe reason most software licenses ARE written in legalese is that they don't actually want you to READ it. ;o)\n\n"
    },
    {
      "time": "31 Aug 2007 — 11:10am",
      "content": "Our EULA\\* is written in English, and was approved by an attorney. His only addition to it was a \"limit of liability\" statement: \"If, after we have worked to resolve any technical issues, you are still not satisfied with our product, we will be pleased to refund your money, which shall be the limit of our liability in this transaction.\"\n\nThe EULA is as clear as day, and as binding as rope. As the majority of our sales are outside of North America, we feel it is very important that our EULA be comprehensible to those for whom English is a second, third, fourth, or twentieth language.\n\nTiffany is an authority on, and collector of, EULAs, and her thoughts on this matter are always insightful.\n\n\\*The EULA was originally written for Thirstype circa 2001, and was later implemented for Village, and several of our member foundries. Of our 11 members, 7 of them use our plain English EULA: KLIM, Kontour, Lux Typographics, Schwartzco, Thirstype, Type Initiative, and Village. Other foundries have asked us if they may use our EULA as a template for their own, and the answer is always a resounding \"yes!\" Unlike other EULAs, ours is not protected by copyright.\n\n"
    },
    {
      "time": "31 Aug 2007 — 11:23am",
      "content": "Thanks for chiming in Chester.\n\nChester's EULA, which I forgot to mention, really is one of the best out there because of the fact that it is understandable without a dictionary. If you, Bruno, can get your lawyer to look over Village's that would be good as well.\n\n"
    },
    {
      "time": "31 Aug 2007 — 1:19pm",
      "content": "\\>it is very important that our EULA be comprehensible to those for whom English is a second, third, fourth, or twentieth language.\n\nAs one of those(these?), i really appreciate, as well as i appreciate this initiative from daltonmaag!\n\n"
    },
    {
      "time": "31 Aug 2007 — 2:12pm",
      "content": "A few thoughts and pet peeves about EULAs:\n\nRestricting the number of backups is nutty, and benefits no one.\n\nI think allowing embedding is essential, and allowing modification is very nearly essential.\n\nI'm not as concerned with the language of the EULA, although plain language is always preferred.\n\nChester's EULA is great, just great.\n\nConcerning Adobe's EULA, there's been much discussion around here about what sort of mods it allows, but Adobe's font FAQ is pretty clear (I quote from [this pdf](http://web.archive.org/web/20131026183029/http:/www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf), which I found on their site today, so I'd say it's current:\n\n\"11. Can I customize a font using font manipulation software?  \nYou are allowed to use font manipulation software to modify the font software to produce “derivatives” of fonts licensed from Adobe, as long as you use the derivatives in accordance with the same licensing terms that accompany the original fonts. For example, you can use Macromedia Fontographer or Pyrus FontLab to customize an Adobe Font for individual usage, but you are not permitted to distribute, sell, or give away, the derivative work, and the derivative work counts as one of the permitted number of uses.\"\n\nAs I recall, Thomas Phinney says that the FAQ was written by the same team that wrote the EULA.\n\n"
    },
    {
      "time": "31 Aug 2007 — 2:59pm",
      "content": "That's who it was: Thirstype. But even though I remembered that the EULA was easy to understand, I didn't remember who it was, or its terms. I just remembered that I found it easy to read, and all of the terms completely reasonable.\n\nOh, and:  \n\"For example, you can use Macromedia Fontographer or Pyrus FontLab to customize an Adobe Font for individual usage...\"  \nSurely this whole EULA is now null and void since there is no such thing as Macromedia Fontographer? (I jest.)\n\nJN\n\n"
    },
    {
      "time": "31 Aug 2007 — 3:15pm",
      "content": "_you can use Macromedia Fontographer or Pyrus FontLab to customize an Adobe Font for individual usage, but you are not permitted to distribute, sell, or give away, the derivative work,_\n\nThat would appear to rule out corporate modifications, as only individual usage may be customized. Or does \"individual\" mean an individual licencee, e.g. the corporation? It would also appear to rule out hiring a third party to do modifications, as they would be selling derivative work -- unless they did the work on their client's premises. Not quite as clear as Thirstype:\n\n_You may not commission a third party to modify the fonts without first gaining permission from the designer through Thirstype._\n\nor Shinntype:\n\n_...you may not distribute, or transfer your adaptations without written permission from the Shinn Type Foundry; this means (a) you may not make customized versions of the Fonts for use by your clients..._\n\nThe similar passage in Bruno's EULA:\n\n_You are permitted to produce a Derivative Work of this Font Software solely for your own use..._\n\nThat seems to be like Adobe's, in that there is some \"wiggle room\" for a corporation to interpret that they can hire a third party to do a modification for them.\n\n"
    },
    {
      "time": "31 Aug 2007 — 4:14pm",
      "content": "Mr Shinn, you're wrong about Helvetica, but you're right about this. ;-)\n\nJN\n\n"
    },
    {
      "time": "31 Aug 2007 — 4:18pm",
      "content": "If you read Adobe's entire EULA you would get a better grasp of it all. Only one part was quoted. Stop looking for opportunities to pick on Adobe. ;^P\n\n"
    },
    {
      "time": "31 Aug 2007 — 6:08pm",
      "content": "_Stop looking for opportunities to pick on Adobe._\n\nOh, was that Adobe again?  \nThey're everywhere, aren't they!\n\n"
    },
    {
      "time": "31 Aug 2007 — 8:31pm",
      "content": "Yes, the next point in the Adobe FAQ addresses third party mods:\n\n\"12. What is the accepted scope of modification and use of independent consultants, hired by companies, to localize or customize font software?  \nA consultant may solicit their services to companies who have legitimately licensed copies of Adobe font software. The work product of the consultant must remain with the company. The consultant cannot (i) take or keep a copy of the company’s original, localized, or customized version of the font software, or (ii) distribute any original, localized or customized versions of the font software.\"\n\n"
    },
    {
      "time": "1 Sep 2007 — 7:55am",
      "content": "\\>If you read Adobe’s entire EULA you would get a better grasp of it all.\n\nYou know I have to disagree, a sensible person would read the FAQ and ignore the EULA - the two documents contradict each other on modification. The FAQ is definitely more liberal. By the way I’m not a lawyer so do not take this as legal advice :-)\n\nOn the subject of the DM EULA - the 5 devices + one printer restriction (drawn from the Adobe EULA of yester-year), is so far removed from today's world of laptops, networks, wireless, printers (surely by connecting to the internet you're conected to millions of printers?), devices, PDAs, flash memory, smartphones, virtualization, backups, time-machine, server based font management etc., that it should be thrown out and replaced with a per-user/server model (IMHO).\n\n"
    },
    {
      "time": "2 Sep 2007 — 3:29am",
      "content": "Sii, our present EULA is based on Monotype's from about 6 years ago. As I said, it is hopelessly outdated.\n\nI must admit that Village's EULA is refreshingly simple, but I am not sure if it's maybe almost too simplistic and too open for interpretation. It very much depends on the good nature and trusing the users. I am considering it, however, as a template for our discussions here.\n\nTiffany, I read through Adobe's EULA and found it hard work. There is so much about all the other software products in this EULA that as a user I would lose the will to live too quickly before reaching any font relevant part. What bits there are about fonts are in fact not too different from Village's. Interestingly enough, Adobe does make provisions for local legislature, such as Germany and Austria, regarding warranty and liability.\n\nThe longer I think about this, the more I believe that a EULA could act as an educational tool (as a previous commentator suggested). Maybe Village have gauged it right trusting their user base.\n\nBruno  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "2 Sep 2007 — 3:30am",
      "content": "Sii, our present EULA is based on Monotype's from about 6 years ago. As I said, it is hopelessly outdated.\n\nI must admit that Village's EULA is refreshingly simple, but I am not sure if it's maybe almost too simplistic and too open for interpretation. It very much depends on the good nature and trusing the users. I am considering it, however, as a template for our discussions at Dalton Maag.\n\nTiffany, I read through Adobe's EULA and found it hard work. There is so much about all the other software products in this EULA that as a user I would lose the will to live too quickly before reaching any font relevant part. What bits there are about fonts are in fact not too different from Village's. Interestingly enough, Adobe does make provisions for local legislature, such as Germany and Austria, regarding warranty and liability.\n\nThe longer I think about this, the more I believe that a EULA could act as an educational tool (as a previous commentator suggested). Maybe Village have gauged it right trusting their user base.\n\nBruno  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "2 Sep 2007 — 7:05am",
      "content": "\"...as a user I would lose the will to live too quickly before reaching any font relevant part. \"\n\nMy feelings as well :-)\n\nChrisL\n\n"
    },
    {
      "time": "2 Sep 2007 — 7:39am",
      "content": "Our EULA does not allow modifications. This has been done more as a protection for us than trying to be a pain in the butt to our users. Many of our clients are engineering firms, architectural firms and DOTs working with our fonts in signage and regulated applications. We have chosen to forbid modfications to protect ourselves from some user mucking with our fonts, implementing them and then something going wrong.\n\nWe are considering changing the EULA to allow for modifications by first obtaining our permission. Does this float anyone's boat?\n\nJames\n\n"
    },
    {
      "time": "2 Sep 2007 — 8:00am",
      "content": "I like the idea of getting permission. It requires that the person be on record with the foundry so the foundry has some idea of how many mods are out there. I would assume you would approve any reasonable request by a client.\n\nChrisL\n\n"
    },
    {
      "time": "2 Sep 2007 — 8:08am",
      "content": "I think most smaller vendors which prohibit mods have an open-door policy. Who’s going to turn down a mod request if there might be some additional licenses in it? I think what tends to be missing is good customer-facing content related to this, perhaps in the form of an FAQ. Perhaps linking this to a \"modification approval request form\" that a customer could fill out – would give the vendor enough detail to say yes or no, without a whole bunch of to-and-fro email.\n\n"
    },
    {
      "time": "2 Sep 2007 — 10:01am",
      "content": "I, too, am inclined to live by the Adobe FAQ (as opposed to trying to make sense of the actual EULA). But there are problems with that approach. What if Adobe suddenly changes the FAQ, saying that no modifications are allowed?\n\nOlli\n\n"
    },
    {
      "time": "2 Sep 2007 — 11:03am",
      "content": "Without anything formally in place, we have, on occasion, been approached by our clients for permission to do modifications. I can't remember any request that was not granted.\n\nJames\n\n"
    },
    {
      "time": "2 Sep 2007 — 12:39pm",
      "content": "Well, James, you may grant most requests, but I was turned down by FontShop when I asked for permission to add the f ligs from the \"expert set\" into the regular font.\n\nTheir EULA says, \"If you want to make modifications to the Font Software, you must obtain the prior written consent of FSI.\"\n\nI found that, in my case at least, \"must obtain\" meant \"won't obtain\", so I'm leery of EULAs like theirs!\n\n"
    },
    {
      "time": "2 Sep 2007 — 1:32pm",
      "content": "\\> But there are problems with that approach. What if Adobe suddenly changes the FAQ, saying that no modifications are allowed?\n\nThe Web Archive Project should retain the current FAQ.\n\n"
    },
    {
      "time": "2 Sep 2007 — 11:29pm",
      "content": "\\>The Web Archive Project should retain the current FAQ.\n\nBut in court, I'd hate to have to resort to citing the FAQ that was current when I did the modifications, or bought the licence for the font.\n\nEDIT: My point is simply that Adobe's way of doing things isn't very satisfactory _in principle_ – though in practice, it might be the best that a big, corporate foundry can do. I do appreciate the fact they at least don't clearly prohibit modifications.\n\nThe problem with having to ask for a permission to do modifications is precisely that it entails the possibility of being turned down. John's experience confirms my fears, showing that being knowledgeable about type won't guarantee you getting a permission, nor will even wanting to do just practical changes intended to simplify your work (as opposed to changing outlines, though I'd like to be able to do that too).\n\nI find that every font needs modifications, and I guess I'd have to ask for a permission _before_ even buying a licence if the EULA says – or seems to say – \"no modifications\".\n\nOlli\n\n"
    },
    {
      "time": "3 Sep 2007 — 2:36am",
      "content": "The modification part is certainly something that we have found a great interest for in the design community. I think the reality is that tools are available to do this work and that users have a desire to tweak a font to better fit their requirements.\n\nThe problem is not the user who swaps numeral sets around in the font for their personal usage (the fonts never leaving his desktop) but where modifications are applied and the fonts become part of a grander print job, or even corporate project. At this point I would like to have control over what is being done.\n\nI am thinking that Dalton Maag will allow modifications in principle. However, we would like to be notified of such an intent and have first refusal to do the work. Where it is a simple job that is solely for the purpose of personal use, we probably would not want to be involved as we could not justify the cost of doing this. However, where the project is more of a commercial nature, where the fonts are being distributed afterwards we probably would want to do the work ourselves for the following reasons:\n\n- Quality control: As the copyright notice and parts of the font name may remain as per original, it is possible that we may be called to provide tech support for a product we have not created. By insisting of either doing the work in-house, or at least have a quality testing, we can help with support queries and ensure that the client receives a product that matches our standards.\n\n- Distribution control and license fees: as the modification will be a derivative product, the copyright remains with us and we're entitled to license fees. Being informed and having participated in the work will allow us to negotiate licensing and distribution.\n\n- Recommercialisation: some modifications, such as language extensions or typographic features may be of interest to us. We would potentially want to integrate these into our own library and recommercialise them.\n\nThis is not to make the process more complicated but to ensure that everyone is compensated fairly and that the client receives the best possible quality.\n\nBruno  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "4 Sep 2007 — 8:01am",
      "content": "Bruno: _\"The longer I think about this, the more I believe that a EULA could act as an educational tool...\"_\n\nI fully agree with you. My continuing education on the subject cements my belief that \"the EULA\" actually represents a spectrum of EULAs over time, and a rank of EULAs for the customer base at any given time. The overriding goal of course, being to provide with the software, an agreement that is understandable and workable for the legal user of any language. So, in order to do this, a bidirectional education, like this thread, or any one of the hundreds of conversations we have with clients, is part of that tool.\n\nCheers!\n\n"
    },
    {
      "time": "5 Sep 2007 — 4:46am",
      "content": "@ John Nolan: We can’t recall neither at FontShop International in Berlin nor in San Francisco that we have turned down such a request like yours. We want to be asked for permission of modifications, mainly to respect our designers and to keep track of modified FontFont versions. Dependent on the character and purpose of the requested modification we decide individually whether we or the type designer or our font technicians do the modification or if we just allow the customer to do it. It’s also a support problem – we can only give technial support for fonts we have produced.\n\n"
    },
    {
      "time": "5 Sep 2007 — 6:28am",
      "content": "I should have been more specific:\n\nI was not granted permission to modify the font \\_myself\\_.\n\nI did not pursue to its conclusion the option of having FontShop do the work, because I felt the cost would be too high, and the process too time consuming...I never got a real quote, but I vaguely remember getting the impression it would be about $25 per character.\n\nFurther, I was asked which character slot I would like the f ligs placed in, in spite of the fact that I had stated that the modication I wanted to make was in order to have the ligs available to InDesign. This indicated that the particular need I was hoping to address was not understood by the questioner, so I didn't have confidence that the work would be done correctly. I could have done it myself in 20 minutes, including adding new kerns. Life's too short.\n\nMy initial request for permission was dated July 14, 2005.\n\nHere are some excepts from \\_some\\_ of the emails I got from Danny Dawson in 2005:\n\nAug. 5, 05:  \n\"This all means that you are effectively prohibited from making the changes yourself. There may be situations I am not aware of where you would be granted permission to make the changes yourself, but those situations are not mentioned in the packet I was given.\"\n\nIn August 9, 05 Danny said:  \n\"I don't quite have answers for you yet, but I am still looking into (1) costs for the modifications you've inquired about and (2) further EULA language clarification. Unfortunately, international communication moves at its own pace, and this is further complicated by the legal complexities of the subject matter, so I do apologize that my responses aren't more prompt.\"\n\nAug. 23, 05:  \n\"As for clarifying our current EULA, I am \\*still\\* waiting for an enumerated list of things you are allowed to do on your own without paying FontShop for customizations. I'll let you know when I hear more.\"\n\n...the thread ends here, probably because I told Danny I was no longer interested. I also spoke to Danny on the phone about all this. I don't remember exactly when I told Danny \"I give up.\"\n\n"
    },
    {
      "time": "5 Sep 2007 — 6:58am",
      "content": "Thanks for the recap, John – with this info I was able to find emails regarding this particular issue after all and see that communication within our company was lacking. A rather unfortunate instance which I think/hope is rare. In Summer 2005, we had just changed our EULA to make it more userfriendly in general (eg use of laptops, embedding, service bureaus) though we did make a point about not allowing modification per se, for the reasons I gave above. As I said, in general we try to meet our customers’ needs, and in a timely manner. So do not give up on us ;-)\n\n"
    },
    {
      "time": "5 Sep 2007 — 8:01am",
      "content": "@ Simon\n\n_You know I have to disagree, a sensible person would read the FAQ and ignore the EULA_\n\nI don't think I was saying that. I was simply saying if someone really wanted to know the information is there. Trust me, I've read that EULA a few times now and it still takes patience. In fact, ALL EULAs written by a lawyer for other lawyers take time to read. I think the FAQ is a good way to cut to the chase, but in a court of law the EULA would be what is referred to and not the FAQ.\n\n"
    },
    {
      "time": "5 Sep 2007 — 8:04am",
      "content": "@ Otto\n\n_What if Adobe suddenly changes the FAQ, saying that no modifications are allowed?_\n\nIt is illegal to do that. The fonts you licensed remain powered by the EULA under which you licensed them.\n\nAlthough this is a conundrum because some EULAs, as DAMA's, are being improved. Do those who licensed before need to contact the foundries to upgrade their EULAs?\n\nEdit: I see that you said basically what I was saying. A court of law would use the FAQ as part of the case, but don't you think the EULA would bind? I suppose it depends upon what is being tried.\n\n"
    },
    {
      "time": "5 Sep 2007 — 8:50am",
      "content": "<cite>It is illegal to do that. The fonts you licensed remain powered by the EULA under which you licensed them.</cite>\n\nActually Tiffany I don't think this is true. I believe there is something in contract law that allows the changing of the EULA to affect previous licensing that occurred under different EULA terms. But I am not a lawyer so don't quote me.\n\n"
    },
    {
      "time": "5 Sep 2007 — 9:37am",
      "content": "<cite>- Miss Tiffany: \"It is illegal to do that.\"<br>\n- Mr. Montalbano: \"Actually Tiffany I don’t think this is true.\"</cite>\n\nSuch \"I don't think so\" arguments are not of much use.\n\nI repeat here what I said in another thread:\n\n**My recommendation for the American Typophile website is that they badly need an independent American design law and copyright law expert, who is not affiliated with a certain font company, for answering legal questions, because there seems to be much need among Typophilers for reliable legal information in these matters.**\n\nExperts such as Mr. Frank Martinez will not do, for he is affiliated with certain font companies and hence will only supply biased information in favor of his clients. What is needed is an independent expert, who also takes care of the \"end users\".\n\nI think, in a country of the size of the USA, it should be possible to find an independant professor of law who is willing to supply independent answers on questions like those discussed in this thread.\n\n"
    },
    {
      "time": "5 Sep 2007 — 10:43am",
      "content": "I'm editing this thread - so it will fall out of order (grrrr) and make Tiffany's comment seem strange.\n\nA few EULA requests:\n\n1. Allow embedding.\n\n2. Allow transferring. If I have no use for a font after a job is done I'd be happy to turn the license over to the client along with the font.\n\n3. Allow the font to accompany the job to the printer without requiring the printer to purchase an additional license.\n\n4. Allow making a backup copy for archiving purposes.\n\n5. Make the license per user, not per machine.\n\nIt is my belief (as stated in other threads) that absent any ability to effectively police users, overly restrictive and/or wordy EULAs encourage violation, or encourage designers not to buy fonts. I don't read most EULAs word for word, but I don't resell or give away fonts either. I just use them to get my work done. It ought to be that simple.\n\n"
    }
  ]
}
