{
  "id": "36679",
  "title": "Using Text wrap with a Numbered List",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello,\n\nI would appreciate any ideas on how to use text wrap with a numbered list. I am working on a book with numbered lists, using a preset style sheet that uses tabs that align to the period on the numbered list (the numbers need to be aligned at the period). When I need to use text wrap for illustrations that sit halfway in and halfway out of the column, all the indents get weird. I found an old post on this forum that exactly describes what I need to do, although it doesn’t say if there is a way to do it. Let me copy and paste a link to this old post below, posted by Pica Pusher Feb. 08, 2006:\n\n[http://www.typophile.com/node/17478](http://web.archive.org/web/20081202184532/http:/www.typophile.com/node/17478 \"http://www.typophile.com/node/17478\")  \n“Obviously, the tab gives you more control over the amount of space between bullet and text. And at this point, you’ve made the compositors’ job very simple—all they have to do is put a tab between the bullet and the text, and they don’t have to worry about any finnicky hidden characters. Unfortunately, look what happens when some nutcase gets ahold of it and starts using text wrapping:”\n\nApparently I am that nutcase that needs to use text wrapping! Any help would be greatly appreciated. FYI I am using CS2.\n\n [‹ OS limitations lead to separate OT-fonts?](http://web.archive.org/web/20081202184532/http:/www.typophile.com/node/36619 \"Go to previous forum topic\") [Object Styles ›](http://web.archive.org/web/20081202184532/http:/www.typophile.com/node/36536 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202184532/http://www.typophile.com/user/21314\" title=\"View user profile.\">crdesign</a>",
  "time": "<br>",
  "uid": "21314",
  "comments": [
    {
      "time": " 1.Sep.2007 12.21am",
      "content": "Can you make a screenshot of you “indents get weird” and tell is which way you wan’t it to look. Otherwise it’s hard to tell where your problem is.\n\nTo see how the Indent to Here works, take a look at this:  \n [http://www.creativetechs.com/tips/tip\\_movies/ID-IndentToHere.mov](http://web.archive.org/web/20081202184532/http:/www.creativetechs.com/tips/tip_movies/ID-IndentToHere.mov \"http://www.creativetechs.com/tips/tip\\_movies/ID-IndentToHere.mov\")\n\nRalf\n\n"
    }
  ]
}
