{
  "id": "36683",
  "title": "Something Awful Type Joke",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This is from Something Awful (The fine proprietors of [2002 Honest Fonts](http://web.archive.org/web/20081202183226/http:/web.archive.org/web/20050923173751/http:/www.somethingawful.com/fake/fontsite/index.htm)) and their [Photoshop Phriday](http://web.archive.org/web/20081202183226/http:/www.somethingawful.com/d/photoshop-phriday/boring-games.php?page=4) topic of this week: Boring Video Games.\n\n ![](http://web.archive.org/web/20081202183226im_/http:/www.typophile.com/files/Boogaloo-Shrimp_5161.jpg)\n\nName that typeface, and more importantly, what program do you believe they used to get a screenshot of all of those typefaces?\n\n [‹ Give me a good, short list of fonts diverse enough to meet advertising needs at a magazine.](http://web.archive.org/web/20081202183226/http:/www.typophile.com/node/36719 \"Go to previous forum topic\") [asciicircum, what is it? ›](http://web.archive.org/web/20081202183226/http:/www.typophile.com/node/36674 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202183226/http://www.typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": " 1.Sep.2007 12.49am",
      "content": "The font would be Times New Roman.\n\n"
    },
    {
      "time": " 1.Sep.2007 8.07am",
      "content": "That would be the perfect complement to the NY Times crossword puzzle game for the DS. Seriously, tho, I wonder if I could get some basic font creation software running on some open-source OS that’s been ported to the DS. Fontforge isn’t gonna happen, but I bet I get some simple bitmap font software running on there.\n\n"
    },
    {
      "time": " 1.Sep.2007 9.44pm",
      "content": "That would be totally sweet. With a drawing stylus and everything.\n\n"
    },
    {
      "time": " 1.Sep.2007 10.47pm",
      "content": "I got a sneak peak at some of the questions ahead of time (included at end of post). I’m told that the drawing mode has several levels. First you have to draw basic handwriting-like glyphs to make sure you know how to use the stylus . Then the second level is drawing sans serifs, third level humanists, forth didots, fifth angle-weighted serifs, and the bonus round is fraktur.\n\nIt also has training modes for teaching sutterlin and charlamagne handwriting. They plan on coming out with more editions for teaching other scripts, although when they do the Ge’ez version, they use a terrible font that looks like a Times being shoe-horned into it (or maybe it’s the other way around) that’s unreadable to everyone in Ethiopia.\n\n ![](http://web.archive.org/web/20081202183226im_/http:/www.typophile.com/files/fonts_typographic_minigames_4474.png)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
