{
  "id": "3668",
  "title": "Jackson (no relation)",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "would anyone know who designed the \"jackson\" typeface, and anything about the history of this pretty unique and excentric design?   \n ![jackson](http://web.archive.org/web/20110703012748im_/http:/www.typophile.com/forums/messages/83/28835.gif)\n\n",
  "author": "<a href=\"/web/20110703012748/http://www.typophile.com/user/1203\" title=\"View user profile.\">anonymous</a>",
  "time": "<br>",
  "uid": "1203",
  "comments": [
    {
      "time": "",
      "content": "I think Agfa still has some of their fonts, but if I recall, they were acquired about 4 years ago and are no longer producing/selling fonts.\n\n"
    },
    {
      "time": "",
      "content": "See the [writeup about Mecanorma at MyFonts](http://web.archive.org/web/20110703012748/http:/www.myfonts.com/foundry/mecanorma/). The only site that lists many of their fonts is Atomic Type (UK). Judging from some of the other font offerings there, I question whether this is a quality font source. Does anyone know more about them?\n\n"
    },
    {
      "time": "",
      "content": "BTW, [MN Jackson](http://web.archive.org/web/20110703012748/http:/www.fonts.com/findfonts/detail.asp?pid=206450) is still sold by Agfa, and I think that's where Jack Jackson's image originated.\n\n"
    },
    {
      "time": "",
      "content": "My FontBook tells me it's a 1971 design by B. Jacquet.\n\n"
    },
    {
      "time": "",
      "content": "Me neither: Google finds zip. It's a Mecanorma release.   \nWho distributes them these days?\n\n"
    },
    {
      "time": "",
      "content": "OK, thanks for the input. I had been told that it was out on the Mecanorma label, i.e. whatever there is left of it. but, - what about this B. Jacquet - who is he, has he (or she) done anything else? How on earth does one come up with anything as great and ugly as that? Surely must have been french?\n\n"
    },
    {
      "time": "",
      "content": "According to the FontShop \"FontBook\", Jackson was designed in 1971 by B. Jacquet. I could not find any other information about the designer or the typeface.\n\n"
    }
  ]
}
