{
  "id": "36701",
  "title": "Rubber Ducky for President",
  "forum": "fontplayer's blog",
  "tags": [

  ],
  "content": "Font: [http://www.hvdfonts.de/HVD Comic Serif](http://web.archive.org/web/20081007162259/http:/www.hvdfonts.de/HVD%20Comic%20Serif)  \nGet the wolves out of politics; Vote for Rubber Ducky!\n\n ![](http://web.archive.org/web/20081007162259im_/http:/www.typophile.com/files/hvdcomicserif_5623.jpg)\n\nArt Director: James Arboghast\n\n",
  "author": "<a href=\"/web/20081007162259/http://www.typophile.com/user/12014\" title=\"View user profile.\">fontplayer</a>",
  "time": "<br>",
  "uid": "12014",
  "comments": [
    {
      "time": " 2.Sep.2007 1.13am",
      "content": "Rubber Ducky has my vote!\n\n"
    },
    {
      "time": " 2.Sep.2007 3.02am",
      "content": "Oh hey, Rubby Ducky looks like a bright little fella with who’s on the ball. He’s cute. He can stay.\n\nI vote for Rubber Ducky!\n\nNice piece by the way. White type on a plain colored background is a good formula. Could use a bit more space between “rubber” and “duck”.\n\nj a m e s\n\n"
    },
    {
      "time": " 2.Sep.2007 3.05am",
      "content": "Would it be alright if I post a revision? This isn’t the critique or design forum, but I don’t think that matters.\n\nj a m e s\n\n"
    },
    {
      "time": " 2.Sep.2007 3.22am",
      "content": "Yes please. I’d be interested to see what you’d consider a proper amount of space. I saw a couple kerning tweaks I’d like to make so I’ll incorporate them when I see your revision.\n\n"
    },
    {
      "time": " 2.Sep.2007 3.55am",
      "content": "Okay. Here it is.\n\nThe increase in leading is only by a small amount. I went for equal space above “rubber”, between “rubber & “ducky”, and below “ducky”—-to even things out and make it consistent. That was without measuring anything tho, to keep it human.\n\n ![](http://web.archive.org/web/20081007162259im_/http:/www.typophile.com/files/rubberduk_4190.png)\n\nUsing a larger size for “ducky” is one way to fill the line width. Sticking with the same size and tracking it out as you did is another way. Neither way is “right”, but the technique I used gives more even tone. Some spectators will like your approach, others will prefer mine. In the end it’s all just different ;^)\n\nThe hue of blue; I’m not aware of an official hue for the stars and stripes, but a lot of illustrations of the American flag use blue hues closer to cyan, and sometimes pure cyan, as distinct from actual flags (I see them in photos) which tend to use a blue closer to midnight, so the cyan-shifted hue seems to be a convention in illustration, possibly as a way of exaggerating things, altho I’m not sure why.\n\nYeah, the K and Y could be closer together.\n\nj a m e s\n\n"
    },
    {
      "time": " 2.Sep.2007 4.34am",
      "content": "I brought the spacing on DUCKY closer and made the size bigger; Sort of half of each. And took it a little closer to the cyan side, but not as far as your sample. It doesn’t strike the patriotic chord with me when it goes that far. We don’t want to alienate the patriots. We’ll need all the votes we can get.\n\nAs far as kerning goes, it may be a fool’s errand to over-kern a font like this. So I’m stopping here.\n\n"
    },
    {
      "time": " 2.Sep.2007 5.37am",
      "content": "_We don’t want to alienate the patriots._\n\nSorry, I didn’t realize it was that sensitive a thing.\n\nIs this better?\n\n ![](http://web.archive.org/web/20081007162259im_/http:/www.typophile.com/files/rubbaduck_4388.png)\n\nThe top arm of K in this font creates letter fit problems with Y; I changed the serif on both K and Y to make them fit better. The space character in this font is a bit wide too. The white dividing lines create the impression of stripes, like the flag, but some people might think it’s too busy.\n\nAdding “Vote #1!” where it is—-on top of the photo—-draws your eye into the image.\n\nj a m e s\n\n"
    },
    {
      "time": " 2.Sep.2007 9.00am",
      "content": "That is great. I have incorporated your suggestions, and took the liberty of adding some stars. And bumped the contrast a tad. Subtlety never was my forte.  \n; )\n\n"
    },
    {
      "time": " 2.Sep.2007 9.43am",
      "content": "Great! That was the next idea that popped into my head, adding stars to forge a closer link with the flag. Graphic design and typographic design often work on suggestion. You have a subject that needs depiction, but drawing it literally poses practical problems, so you suggest the subject instead with key details—-like stars and stripes for example.\n\nEmbellishments are an aspect, or technique, in graphic design you could use to enliven fontplays. Assuming you have a good collection of dingbat fonts, don’t hold back, let fly with ’em. You’re adept at coming up with a theme for each piece; look in your ding fonts for dings that match key words in the text (this can be time-consuming), and include a few to compliment the type. Use them sparingly for an understated effect, unless the piece warrants using a heap, like this one does.\n\nYou see now that fitting the K and Y was worth the effort.\n\nj a m e s\n\n"
    },
    {
      "time": " 2.Sep.2007 11.32am",
      "content": "Thanks for your help. I really appreciate it. I feel this is a much stronger piece with the changes. Now we stand a chance in ’08.  \n; )\n\n"
    },
    {
      "time": " 2.Sep.2007 12.19pm",
      "content": "Hillary’s counter ad. Font Magical Mystery Tour by Keith Bates.\n\n ![](http://web.archive.org/web/20081007162259im_/http:/www.typophile.com/files/magicalmysteryduck_5454.jpg)\n\n"
    }
  ]
}
