{
  "id": "36714",
  "title": "Logo for winery",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This is the first time I am posting something for critique. Hope you can handle my poor English…\n\nI designed a logo for a winery. In the briefing fell words like _clear_, _clean_, _modern_, _not forgetting tradition_, _reserved_. The heraldic figure of the winery has to be given up. They would like to see the color blue - which rather unusual for a german winery. I used the logo sign to smuggle in some black letters (black letter still has a hard life here in Germany, in a knee-jerky manner people see it connected to national socialism, despite any historic evidence). Tried to create a ligature for K and L with a dipping pen, when I found that in some black letter fonts the K is a ligature of L and K in itself. The sign has been mirrored to form a reminiscence to the old heraldic figure. The three dots are symbolizing the three generations of the family working in the winery. Looking at it, I see a kind of proliferating foliage similar to the real grapevine, with the dots as grapes. The colors I used are Pantone 5435 U and Warm Gray 8 U, so the blue isn’t too luscious and the overall appearance is rather silent.\n\nSince I am an electrical engineer and not a graphic designer, the logo is heavily constructed (like almost everything I do), with the golden section as the most important proportion - there are pentagons all over the place. The unserifed font I would like to use would be something not seen here in Germany everyday, classic and classy - like Gotham, Sackers Gothic or Blair. Since I don’t have one of these, I used Johnston for the first approach.\n\nSo, enough babbling - any comments or critique?\n\n ![](http://web.archive.org/web/20081210105114im_/http:/typophile.com/files/srob41_knebel_lehnigk_logo_4960.gif)\n\n ![](http://web.archive.org/web/20081210105114im_/http:/typophile.com/files/srob41_knebel_lehnigk_blackletter_4944.gif)\n\n ![](http://web.archive.org/web/20081210105114im_/http:/typophile.com/files/srob41_knebel_construction_5317.gif)\n\n [‹ Logo Design for Salon - Panache](http://web.archive.org/web/20081210105114/http:/typophile.com/node/39282 \"Go to previous forum topic\") [Logo for Freelance Light Engineer ›](http://web.archive.org/web/20081210105114/http:/typophile.com/node/39170 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081210105114/http://typophile.com/user/13531\" title=\"View user profile.\">srob41</a>",
  "time": "<br>",
  "uid": "13531",
  "comments": [
    {
      "time": " 4.Sep.2007 6.10am",
      "content": "Robert,\n\nno deep critique, just some thoughts.  \nFirst of, I reckon this is very well executed (one can certainly see your technical abilities). But more importantly, the logo ’feels’ right too. I love the reference to the heraldic sign you created by mirroring the KL - very subtle. Overall very nice balance in the design.  \nAs you say, the color choices are untraditional, so I guess this wine will be marketed to a slightly ’hipper’ crowd?  \nWell done!\n\nGrüsse aus Stockholm,\n\nSeb\n\nBTW, don’t mind the sans you used at all. although the U should probably move slightly to the left.\n\n"
    },
    {
      "time": " 4.Sep.2007 6.16am",
      "content": "I think this is a really nice job. My only comment would be that it might blend in to the crowd of other wine bottles out there. The design is classy. The only thing i think might not fit in is the dash as it could reflect the lettering more.\n\nCheers\n\nDan\n\n"
    },
    {
      "time": " 4.Sep.2007 7.28am",
      "content": "If this is a typical example of your graphic design skills, I imagine your electrical engineering skills must be superb. This is really nice. The key will be to convince the powers-that-be that this logo needs a lot of white space to breath.\n\n"
    },
    {
      "time": " 5.Sep.2007 1.34am",
      "content": "Thanks to all three of you for the kind words!\n\n@Seb: Yes, should have seen the kerning problem—-guess I didn’t take care because I considered the Sans to be a placeholder.\n\n@Dan: _QUOTE: [...] it might blend in to the crowd of other wine bottles out there._ Almost all of their wine is sold directly to oenophiles and restaurants, so the wine label doesn’t have to campaign against other labels in a shelf battle. On the other hand I can imagine the label—-bright and low in contrast—-to be optically competitive against a crowd of colorful labels demanding for attention on the shelf of the liqour store. I would love to see the label with a strict typographic layout, maybe the lower part of the label completely covered with justified text, set in very light gray, important wine data popping out with a contrasting color (the blue of the label). So the blue color could be used for the wineries main grape variety, the Riesling, and alternative colors (similarly bright and desaturated) for other grape varieties. Regrettably, this concept is hardly ever feasible. Due to the absurd typgraphic specifications of the German wine law, almost every word on the label has to have a differing size.  \nI tried a lot of things to work around the balance problem of the dash, like using the dipping pen dot of the logo sign, equals sign, colon divided by dash etc. I found the orignal dash of the Jenson to be the best solution. Robert Slimbach really did a great job!\n\n@aluminum: White space will be no problem with the client, we talked about that. Certainly white space won’t be available on the wine label, which has to be cramped with a whole lot of information. Above all, the label needs have a small height, because the shape of the local wine bottles—-in German called “Schlegelflasche”—-provides a rather small cylindrical part and a very long tapered neck. This is going to be a typgraphic nightmare! What a wonderful life I could have being a wine label designer in Bordeaux or Tuscany...\n\nRobert\n\n"
    },
    {
      "time": " 5.Sep.2007 1.53pm",
      "content": "Aluminum,\n\nYou have given the perfect analogy for white space. . .like any great wine, type must breathe. . .\n\nTag srob41 -\n\nACHTUNG! Das ist gut! I don’t know what to say exactly, but very well done. The symbolism with the herhaldic figure, the grape vine/grapes and the three generations, superb!\n\n"
    },
    {
      "time": " 5.Sep.2007 2.23pm",
      "content": "This is handsome, though I do have to admit that the mirrored calligraphy bothers me a bit. On the left side of the “mirror,” of course, the stress in the strokes reverses from the expected NE/SW thins and NW/SE thicks. That may feel “wrong” to those who read it as calligraphy. I do like the “shield” shape that results, though.\n\n"
    },
    {
      "time": " 5.Sep.2007 2.49pm",
      "content": "I actually like that the symbol becomes a symbol. It separates itself from its origins and becomes something different. A symbol doesn’t have to follow the rules.\n\n"
    },
    {
      "time": " 5.Sep.2007 10.16pm",
      "content": "@eliason: I understand your doubts about the callygraphical correctness. I think Tiffany found the perfect answer for that. In addition, it leads away from the blackletters as typographic elements. That’s why I talked about smuggling blackletter into the project in my first posting. Anyway, it wouldn’t have been possible to bring symetry into the symbol with correct strokes.  \nBy the way, while scribbling around with the dipping pen I got an idea, why left-handed children were (and sometimes still are) reeducated to be right handed—-often by the use of birching, as my grandpa experienced. With a broad nib it is just impossible to write correct blackletter forms left-handed. So that might be the root of this otherwise rather strange educational facet.\n\n@umlautthoni: JAWOLL! Instantaneously my heels clicked as I read your attention command. After all, I had to serve my time at the Bundeswehr. The rest of your order is by far too kind to qualify for drill sergeant. Failed;)\n\n"
    },
    {
      "time": " 13.Sep.2007 2.36pm",
      "content": "First, I agree with everyone that the overall design is really well done. That said, I do have some points of critique:\n\n1. The kerning (individual letter spacing) needs a lot of fine-tuning. For instance, in “WEINGUT”, “GU” are too far and “UT” are too close. I supposed you’ve relied on automatically metric kerning, which isn’t good enough for logos.\n\n2. The tracking (general letter spacing) of the tag line (“RIESLING [...]”) is too wide. You’ve pre-defined the width of the whole line \\*and\\* the font size, which is always a bad idea, because it makes the tracking arbitrary. Also I think the line could work better in normal case (as opposed to all-caps).\n\n3. A hyphen is used in the tag line though it should be an en-dash (“Halbgeviertstrich” in German). The slash is totally wrong and should be replaced by a comma — or much better, “Winningen a. d. Mosel”.\n\nGiven 2 and 3, I’d consider splitting the tag line in two lines, i. e.:\n\n<cite>Rieslinge aus Steillagen</cite>  \n<cite>Winngen a. d. Mosel</cite>\n\n"
    },
    {
      "time": " 13.Sep.2007 10.33pm",
      "content": "Henry,\n\nthank you for your critique! The GIF showing my logo design above is nothing more than some kind of digital scribbel.\n\n1. As I said in my first posting, “WEINGUT” is a placeholder for something set in a font that I do not own yet. I just typed it in using Johnston due to its similar “feeling”—-at least for these uppercase letters and in favour to anything else in my font folder—-to Gotham. No fine-tuning was done, you’re right. Due to seb’s comment I corrected that.\n\n2. & 3. The claim is also a placeholder. Here it is not the font, but the content which doesn’t exist yet. The line of text is just showing the right place to be for the tag line. Its content is a shot from the hip. That will be discussed when the customer is going to see the sketch sometime next week. You’re right that I was a slave to my construction measures. Though I would use a similar tracking and small case for the final claim to reduce its color in relation to the logo. I would like to give it a more graphic character, building the logo’s base, making it graphically less instable.  \nUsing Illustrator to draw the logo, I tried to type in ALT+- to get an en-dash like I do in InDesign a dozen times a day, but it rather opened a window related context menu than producing a “Halbgeviertstrich”. I even opened the glyphs window to get the en-dash, but obviously double-clicked the wrong glyph (due to its perishable appearance I didn’t care anymore). If I had typed a hyphen, for Jenson Pro it would look like the sloped wedge shaped hyphen in the name of the winery. Hopefully, there will be no dash at all in the final claim, as well as no slash. Though I am not sure wether the slash is “totally wrong”. A comma stabbing out of the optically closed small caps tag line would disturb my feeling for symmetry and balance—-which does the slash as well, but at least maintains some of the horizontal symmetry. Using “A.D.” instead of the slash, that would be ok within Germany, but I can imagine that the rest of the world—-a great part of the winery’s production is exported—-would rather read “anno domini”.  \nAnyway, most likely the content of that line will be something else. If that lines width isn’t roughly in the area of the circles diameter I constructed, I will not force it to this size. Then it will be either shorter or split into two lines. And of course, before I present it to my customer, it will be typographically as good as I am able to do.\n\nRobert\n\n"
    },
    {
      "time": " 14.Sep.2007 10.08am",
      "content": "First, you can get an en-dash in InDesign using the context menu: right-click, insert special character, en-dash (the details vary depending on your InDesign version).\n\nSecond, what I was trying to say about the tag line tracking is that you can’t pre-determine both the font size and the width of a line ever, because they are interdependent to each other.\n\nThird, I \\*am\\* sure that the slash is “totally wrong” — in German as well as in English (not that English matters in this case). People who can’t read German may not know what “a. d.” means, but absolutely nobody is going to mistake it for “anno domini”, as that can only follow a number.\n\nI do understand your discomfort with the optics of the comma or slash, which will be non-existent if you decide to go lowercase with the tag line. But if you must use all-caps and don’t want to use “a. d.” (which I frankly don’t understand), the most acceptable alternative would be the middle dot, i. e.:\n\n<cite>Rieslinge aus Steillagen</cite>  \n<cite>Winningen (middot) Mosel</cite>\n\nOr:\n\n<cite>Rieslinge aus Steillagen (middot) Winningen (middot) Mosel</cite>\n\nDo not use both en-dash \\*and\\* middle dot because that’d be confusing and look funny.\n\n"
    },
    {
      "time": " 16.Sep.2007 8.16am",
      "content": "I like idea of the middot. It’s not only typographically okay, but it also sounds good from a graphic design standpoint.\n\n"
    },
    {
      "time": " 16.Sep.2007 11.16pm",
      "content": "@Henry:\n\nas I said before, I know how to get the en-dash in InDesign. And for sure I would never use the mouse for that. There is not enough time in my life to do something with the mouse that could be done with the keyboard. My problem was to produce an en-dash within Illustrator, there the keyboard shortcut from InDesign didn’t work. In the meantime I tried to look it up and didn’t find any predefined shortcut for dashes in Illustrator. But one could use the standard keyboard shortcuts:  \n`\n  en-dash -- ALT+0150 (PC) -- Option+Hyphen (Mac)\n  em-dash -- ALT+0151 (PC) -- Option+Shift+Hyphen (Mac)\n`  \nUsing the middot is a good idea!\n\nRobert\n\n"
    },
    {
      "time": " 19.Nov.2007 2.52am",
      "content": "To give some feedback what happened to the logo:\n\n- customer loved the design  \n- the subline was changed to its final form, which now slightly exceeds my geometric contruction; in it I used the middot and the italic ampersand of Jenson;  \n- I bought Gotham for the project and found it to be too narrow for the word “WEINGUT” in the logo, so I drew an extended version of it.\n\n ![](http://web.archive.org/web/20081210105114im_/http:/typophile.com/files/srob41_knebel_lehnigk_logofinis_4150.png)\n\nLast week we got the stationary from my printer. Initially I had planned to use a cotton paper similar to Strathmore, the logo printed with a steel engraving. For reasons of economy, this had to be reduced to a cheaper paper with an embossed logo. To give the very clear and rather cool look of the stationary a bit more softness, I rounded the corners of the paper and printed some gradient shades into the corners. The wine labels will be printed next spring, the work on the website is in progress. I put some pictures onto our website: [http://www.aperion.de/portfolio.php?pid=25](http://web.archive.org/web/20081210105114/http:/www.aperion.de/portfolio.php?pid=25).\n\nRobert\n\n"
    },
    {
      "time": " 20.Nov.2007 7.58am",
      "content": "Robert:\n\nThanks alot for the follow-up. It’s always nice to see how things ended up. Great project, BTW. The stationery looks great.\n\n“Since I am an electrical engineer and not a graphic designer”\n\nI think you can safely say you’re a graphic designer now. Good work.\n\n"
    },
    {
      "time": " 20.Nov.2007 1.44pm",
      "content": "It ended up great, imo. I agree that it’s nice that you posted a follow-up, something that doesn’t happen very often on the forum unfortunately. :)\n\n"
    }
  ]
}
