{
  "id": "36719",
  "title": "Give me a good, short list of fonts diverse enough to meet advertising needs at a magazine.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Wasn’t sure where to put this - because it’s both a technical and an aesthetic question.\n\nI’m cleaning up workflow at a magazine that’s small but growing very, very quickly, and the staff before me just went crazy designing thousands of ads for clients over the course of 3 years because there wasn’t a standard list for them to choose from. This has resulted in a multitude of costly problems for production. We’re in a process of synchronization right now.\n\nSo, I need a couple of common serif fonts, a couple of sans serif, and whatever comes in between that’s diverse enough to meet the advertising needs of hundreds of clients that aren’t creating ads themselves. This is NOT for our house identity - they’re just for Regular Joe Restaurant, etc., who call us up and want to pay for an ad and need us to design it quickly.\n\nSo, I need a list sort of like:\n\nAvantGardeITC  \nBaskervilleMT  \nBauerBodoni  \nFranklinGothic  \nFrutiger  \nGillSans  \nMyriad  \nOfficinaSans  \nOfficinaSerif\n\nBut I don’t want ad designers flipping out because the list isn’t diverse enough to do what they need. You know? Help.\n\n [‹ 9/11 Memorial Typeface](http://web.archive.org/web/20080907160535/http:/www.typophile.com/node/36712 \"Go to previous forum topic\") [Something Awful Type Joke ›](http://web.archive.org/web/20080907160535/http:/www.typophile.com/node/36683 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907160535/http://www.typophile.com/user/13881\" title=\"View user profile.\">vectorgirl</a>",
  "time": "<br>",
  "uid": "13881",
  "comments": [
    {
      "time": " 2.Sep.2007 3.12pm",
      "content": "Hi vectorgirl - looks OK to me except that you have Frutiger, Myriad, Gill, Officina ie 4 (perfectly decent) humanist Sans faces, but just Franklin for the Gothics. I’d say drop Frutiger or Gill and get Univers instead. Also Bembo or something similar would come in handy for some elegance and class...\n\n"
    },
    {
      "time": " 2.Sep.2007 4.38pm",
      "content": "hope these links are enlightening:\n\n[http://typophile.com/node/30047](http://web.archive.org/web/20080907160535/http:/typophile.com/node/30047 \"http://typophile.com/node/30047\")\n\n[http://www.typophile.com/node/29208](http://web.archive.org/web/20080907160535/http:/www.typophile.com/node/29208 \"http://www.typophile.com/node/29208\")\n\n"
    },
    {
      "time": " 2.Sep.2007 6.00pm",
      "content": "Thank you!! This is exactly the direction I needed. :)\n\n"
    },
    {
      "time": " 2.Sep.2007 6.03pm",
      "content": "i’m sure there are more threads here on typophile. i just don’t have the time to google them for you today (any other sunday i would!)\n\n"
    }
  ]
}
