{
  "id": "36729",
  "title": "Salary of a font company's manager",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "If you want to know the salary of a font company's manager, then look here:\n\n[http://sec.edgar-online.com/2007/04/13/0001193125-07-080890/Section72.asp](http://web.archive.org/web/20150417030952/http:/sec.edgar-online.com/2007/04/13/0001193125-07-080890/Section72.asp \"http://sec.edgar-online.com/2007/04/13/0001193125-07-080890/Section72.asp\")\n\n",
  "author": "Uli",
  "time": "3 Sep 2007 — 12:28am",
  "uid": "11274",
  "comments": [
    {
      "time": "3 Sep 2007 — 12:44am",
      "content": "He makes good money and nice perks too like an luxury car lease allotment and bonus. Almost 200 grand here in the states with the bonuses.\n\n"
    },
    {
      "time": "3 Sep 2007 — 1:49am",
      "content": "Geesh. That's a whole bunch of fonts.\n\n"
    },
    {
      "time": "3 Sep 2007 — 6:32pm",
      "content": "You guys have to snap out of it! There is money to be made in type if you manage your IP correctly and don't give it all away to a foundry or reseller. Take yourselves seriously for crying out loud!\n\nJames\n\n"
    },
    {
      "time": "3 Sep 2007 — 7:56pm",
      "content": "<cite>There is money to be made in type...Take yourselves seriously for crying out loud!</cite>\n\nJames, that would be a great topic for Typecon 2008 :)\n\n"
    },
    {
      "time": "3 Sep 2007 — 8:30pm",
      "content": "Hi Uli. Thanks for this informative post. (Perhaps you can check out an old thread to answer a couple of questions I posed: [http://typophile.com/node/36478?page=1](http://web.archive.org/web/20150417030952/http:/typophile.com/node/36478?page=1 \"http://typophile.com/node/36478?page=1\") )\n\nAs for James Montalbano's statement: From what I can tell, most of the people making fonts are \"garagistes\" - passionate amateurs - and the likelihood that they will ever produce anything of great value is small. Just look at the flood of dross which is MyFonts and I think you'll agree that while there is money to be made in typography, that's not the place to do it. Unless you are the director of MyFonts, in which case you probably do very well on the basis of economies of scale.\n\nDoesn't mean that people shouldn't keep doing it. It's like being in a bar band; you can make pocket money doing it and have a lot of fun, but most bar bands are simply not interesting enough for \"the big time\".\n\nJN\n\n"
    },
    {
      "time": "3 Sep 2007 — 9:32pm",
      "content": "<cite>You guys have to snap out of it!</cite>\n\nI don't know if you care, but the link to Terminal Design on your user info page is messed up a bit, it seems. It links to:\n\n[http://typophile.com/user/www.terminaldesign.com](http://web.archive.org/web/20150417030952/http:/typophile.com/user/www.terminaldesign.com \"http://typophile.com/user/www.terminaldesign.com\")\n\nAs an aside, I love Tangent. Although the kerning on the sample page seems to be turned off. See 'ly' in sample below.\n\n ![](http://web.archive.org/web/20150417030952im_/http:/typophile.com/files/melancholy_6559.gif)\n\n"
    },
    {
      "time": "4 Sep 2007 — 3:21am",
      "content": "Dennis, the missing http:// appears to be an issue with many profiles on Typophile.com: my guess is that it’s an artifact from the migration from the old forum system to the current one since you see it mostly on old profiles (James has been a member for 4 years 11 weeks at the moment).\n\n"
    },
    {
      "time": "4 Sep 2007 — 6:37am",
      "content": "<cite>James, that would be a great topic for Typecon 2008 :)</cite>\n\nIts my feeling that the majority of TypeCon should address this issue. The business side of type always gets short-changed at TypeCon. 4 hours of Dwiggins vs 45 minutes of Q&A with Frank Martinez.\n\n"
    },
    {
      "time": "4 Sep 2007 — 7:09am",
      "content": "James M., I took the liberty of posting your comments to [the thread asking for suggestions about TypeCon 2008](http://web.archive.org/web/20150417030952/http:/typophile.com/node/36414).\n\n"
    },
    {
      "time": "4 Sep 2007 — 7:58am",
      "content": "<cite>As an aside, I love Tangent. Although the kerning on the sample page seems to be turned off. See ’ly’ in sample below.</cite>\n\nThere is no kerning in that previewer, that ly anomaly seems due to a rendering issue.\n\n"
    },
    {
      "time": "4 Sep 2007 — 8:23am",
      "content": "_if you manage your IP correctly and don’t give it all away to a foundry or reseller_\n\nJames, pardon my ignorance, but what does \"IP\" stand for?\n\nThanks in advance,  \nRicardo\n\n"
    },
    {
      "time": "4 Sep 2007 — 8:35am",
      "content": "IP= Intellectual Property\n\n"
    },
    {
      "time": "4 Sep 2007 — 12:25pm",
      "content": "Thank you, sir.\n\n"
    },
    {
      "time": "5 Sep 2007 — 2:54am",
      "content": "I thought IP was this computer address number. I couldn't figure out how that would make me rich. THank you for enlightening me.\n\nalex  \n.........................................................  \n [Bison Design](http://web.archive.org/web/20150417030952/http:/www.bisondesign.no/)  \n [Spön](http://web.archive.org/web/20150417030952/http:/www.myspace.com/sponnorway)\n\n"
    },
    {
      "time": "12 Sep 2007 — 3:44am",
      "content": "Thank you TerminalDesign for saying that there is money in this business...The last person I asked told me that this only makes pocket change and beer money which really discouraged me from getting into it the way I should have...You all may know him...I won't say names...lets just say his outfit is out of the upper Midwest...The others I asked didn't even respond...Bigtime East coast foundries (One in the Empire State and the other in the Diamond State). But I must say it is refreshing to hear someone acknowledge the power that type design has even when it is taken for granted so much...Once again thank you...\n\nK.  \nAKOFAType  \n [http://type.akofa.com](http://web.archive.org/web/20150417030952/http:/type.akofa.com/)  \n...The Impossible is only the unthought of...\n\n"
    },
    {
      "time": "22 Sep 2007 — 3:14pm",
      "content": "There is money to be made, but it is a tiny minority of interested people who make a decent living at it. Kind of like going to Hollywood because you want to be an actor.\n\nT\n\n"
    },
    {
      "time": "22 Sep 2007 — 3:42pm",
      "content": "Any other dreams you care to squash, Thomas? Next you'll tell me that I'll never be a rock star nor win the lottery!\n\n"
    },
    {
      "time": "24 Sep 2007 — 2:00am",
      "content": "Here's a question on my mind: On average, how much time on the market does it take for a font to bring back six hundred dollars?\n\n"
    },
    {
      "time": "24 Sep 2007 — 8:08am",
      "content": "Kevin, wouldn't that in large part be a function of the pricing?\n\n"
    },
    {
      "time": "24 Sep 2007 — 10:15am",
      "content": "I'm sure there are many, many fonts on say, MyFonts that will never 'bring back' $600, and others may take between four and twenty years, so to be conservative I would say the average is forty-two years.\n\nCheers, Si\n\n"
    },
    {
      "time": "25 Sep 2007 — 12:39am",
      "content": "That's about what I expected, but it seems strange to me that everybody else is using Fontlab as if they got it for free. Is type design really just a luxury hobby?\n\n"
    },
    {
      "time": "25 Sep 2007 — 7:33am",
      "content": "I'm going to state something very obvious here, although I'm not a type designer, but a type user, and enthusiast... the amount of money you make is dependent upon the typefaces you offer. The independent foundries and designers that do well, are doing well because they are producing something that people want. You can make money doing almost anything if you do it well. Look at LucasFonts. How much do you think he has banked off his Thesis family? I remember getting a specimen back in '95 and thinking it was an awesome achievement, and it is. It is still going strong. Look at H&FJ, their typefaces are solid designs that are seen everywhere.\n\n"
    },
    {
      "time": "26 Sep 2007 — 6:47am",
      "content": "_On average, how much time on the market does it take for a font to bring back six hundred dollars?_\n\nThere are so many variables (IE a single sloppy font that took a day to make or a complex family that took years) The time spent often shows in the design. Also the end price, if the font is $600, then one sale does it)\n\nBottom line is, some fonts sell and some do not. There is only so much market research and weighing investment on return that can go into it. Most people make fonts to fill a perceived void (in the type world in general or personal achievement). Going into it for financial gain is a very risky proposition but not unattainable.\n\nI am curious how the seemingly arbitrary figure of $600 came up?\n\n"
    },
    {
      "time": "26 Sep 2007 — 6:57am",
      "content": "Rich,  \nI think the $600 was his estimate based on the cost of buying FontLab?\n\n\"...it seems strange to me that everybody else is using Fontlab as if they got it for free.\"\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2007 — 7:15am",
      "content": "ah,  \nIf that is the measure, make two fonts and double up yer odds.\n\n"
    },
    {
      "time": "26 Sep 2007 — 7:28am",
      "content": "Or just make one and sell it to all your relatives :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2007 — 11:21am",
      "content": "_and don’t give it all away to a foundry or reseller._\n\nI agree with the foundry part, although it might not be a bad way for some to start out in the business.\n\nHowever, I don't see what's wrong with having distributors. Typically they take 50%, but they provide access to markets a foundry will not find otherwise.  \nAlso consider the increasing (and long overdue) sophistication of online retailers, driving traffic to their sites. It takes a heck of a lot of effort to generate traffic to one's own site for direct sales, and to provide constantly refreshing content.\n\nI'd say that in future things will go well for foundries that are able to co-ordinate font development, direct retail sales, and integrate marketing across the board with a variety of distributors -- which is a pretty straightforward business model going way back in time.\n\nI have a number of distributors. I do find it difficult to produce a campaign they all can use. Everyone has their own standards for things like the size of banner ads, and most do not even use co-op (supplier-generated) marketing material, which seems to me a missed oportunity, because everyone benefits from synergy.\n\n"
    },
    {
      "time": "26 Sep 2007 — 11:25am",
      "content": "\\>Or just make one and sell it to all your relatives :-)\n\nOr have the relatives buy you FontLab and make the fonts for fun ;-)\n\n"
    }
  ]
}
