{
  "id": "36720",
  "title": "Layout for legal documents",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,  \nI’m redesigning our company’s corporate manual which includes a few quite lengthy documents, regarding brand licensing and the company profile etc. I am very new to this and don’t know the ’rules’ regarding layout of these kinds of documents. The original is absolutely hideous an terribly difficult to read. There are a lot of very small (1–2 sentences) clauses, each with its own subheading and I’m just having a bit of trouble with it all. Does anyone have any advice, or can link somewhere with standard legal document layouts etc?  \nThanks\n\n [‹ High School Newspaper critique](http://web.archive.org/web/20080614063911/http:/www.typophile.com/node/36765 \"Go to previous forum topic\") [Font for Business Name ›](http://web.archive.org/web/20080614063911/http:/www.typophile.com/node/36764 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080614063911/http://www.typophile.com/user/20579\" title=\"View user profile.\">Lou</a>",
  "time": "<br>",
  "uid": "20579",
  "comments": [
    {
      "time": " 2.Sep.2007 6.32pm",
      "content": "What specifically makes it difficult to read? Type too small/too tightly leaded/lines too long/bad choice of typeface/page layout too broken up?. If the subheading are on their own lines, one way of making the document less choppy would be to have the subheads run in on the first line of each clause itself—-set them in semi-bold or bold (depending on the typeface).\n\nI don’t know that there are specific “rules” for this kind of document. Regular graphic design principles should apply to make the page inviting, easy to read, and easy to comprehend the hierarchy of topics.\n\n"
    },
    {
      "time": " 4.Sep.2007 12.31pm",
      "content": "It’s a corporate manual, not a document to be handled by lawyers, so it’s okay to make it pretty. :-)\n\nHumor aside, I think Gary’s got the right idea.\n\n"
    },
    {
      "time": " 4.Sep.2007 5.45pm",
      "content": "Unless you’re reproducing actual legal papers—i.e., motions, writs, court orders, etc.—in their actual format, I would lay them out as separate docs within your manual, organized in a logical way, maybe an outline format. The idea would be to simply make the material readable by your audience. So, again, if you’re not reproducing actual papers, I’d bump up the typeface size if it’s too small, make sure the leading helps readability, and otherwise make it something that will be easy on your audience’s eyes. The idea is to encourage them to read from beginning to end, as well as promote decent comprehension.\n\nIf you think the project can benefit from a professional’s touch, contact me.\n\nStephen Tiano, Book Designer, Page Compositor & Layout Artist  \ntel. & fax: 631/284/3842  \ncell: 631/764/2487  \nemail: [steve@tianodesign.com](mailto:steve@tianodesign.com)  \niChat screen name: [stephentiano@mac.com](mailto:stephentiano@mac.com)  \nwebsite: [http://www.tianodesign.com](http://web.archive.org/web/20080614063911/http:/www.tianodesign.com/ \"http://www.tianodesign.com\")  \nblog: [http://www.tianodesign.com/blog](http://web.archive.org/web/20080614063911/http:/www.tianodesign.com/blog \"http://www.tianodesign.com/blog\")\n\n"
    }
  ]
}
