{
  "id": "36735",
  "title": "Top 5 corporate design agencies in the world",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "- How would you rank them? Who would be at the top of your list?  \nJust curious;-)\n\n",
  "author": "<a href=\"/web/20090725091334/http://typophile.com/user/16177\" title=\"View user profile.\">Endre Berentzen</a>",
  "time": "<br>",
  "uid": "16177",
  "comments": [
    {
      "time": " 3.Sep.2007 10.51am",
      "content": "What qualifies as top? Best Work? Highest Revenue?\n\n"
    },
    {
      "time": " 3.Sep.2007 11.25am",
      "content": "These factories stop doing interesting work at least when they grow over a critical size. Typically over five employees I would say. The whole system of getting new large business to keep the employees busy kills any form of design. It turns into lowest common denominator: charts, charts, and more charts, a dull new logo, an unexciting new colour palette, a generic corporate stock-photo library and so on.\n\nThese big corporate entities do not have the guts to rise out of mediocrity, and the design factories are certainly not going to rock the boat they are in. It’s design by committee, so bland it disappears in background radiation.\n\nIn my list the usual suspects at the ’top’ are the really the bottom. I don’t even think they should be allowed to be called design agencies.\n\n"
    },
    {
      "time": " 3.Sep.2007 11.38am",
      "content": "Clauses, you need to stop holding back so much. Please tell us how you really feel. ;)\n\n"
    },
    {
      "time": " 3.Sep.2007 1.53pm",
      "content": "Once a firm gets beyond a certain size, it’s all about making a buck, not about making a difference. So, the only logical ranking would be by revenue, but who needs another wealth list?\n\n"
    },
    {
      "time": " 3.Sep.2007 2.39pm",
      "content": "I don’t know a lot about corporate agencies, and i’m not really interested in it, but lately i saw nice works on [http://spiekermannpartners.com](http://web.archive.org/web/20090725091334/http:/spiekermannpartners.com/ \"http://spiekermannpartners.com\") like the redesign of “le monde diplomatique” or “pc professionell”.\n\n"
    },
    {
      "time": " 3.Sep.2007 3.25pm",
      "content": "Mr. Berentzen was quite clear in posing his question that he was, “just curious.” It seems very odd that this ridiculous question would draw forth such negative blanket statements from Clauses and Gary Long.\n\nNow, the question itself is ridiculous, and was obviously just lobbed out there to spark some conversation. You may as well ask who the best classical violinist is, or the best chef. At a certain level, any rankings will be subjective. (Yes, Joshua Bell is a better classical violinist than my niece Joanie, but is he better than Gidon Kremer? Depends who you like better.)\n\nAnd Mr. Sørensen’s statement that any design firm larger than 5 people doesn’t do interesting work is patently ridiculous. His further statements just increase the idiocy of his original statement. Mr. Long chimes in with stupid statement about big design firms not “making a difference,” what ever that is supposed to mean.\n\nIs it the duty of design firms to serve their clients? Yes, of course. Is it their duty to do so in a way that brings interesting conceptual and formal solutions into the world? No, but it’s probably what most designers are striving to do, wherever they work, and whatever their level of talent. Is it the duty of design firms to “make a difference”? If they want to do that, they should open soup kitchens.\n\nThere are PLENTY of corporate design agencies making good work AND doing good works. And there are plenty filled with money-grubbing hacks. Like any profession, there are those who are in it for the love of the pursuit, and those who just want to get paid. If you are hoping to make a big pile of cash in graphic design, then corporate identity is probably the way to go.\n\nHere are questions for Mr Sørensen and Mr Long: Have you risen out of mediocrity? Are you making a difference?\n\nMr. Sørensen, you are a student - or maybe a recent graduate - so your idealism is the arrogance and ignorance of youth. What work have you done in the profession which raises you out of mediocrity?\n\nMr. Long, according to your Typophile profile, you work at a vanity publisher: [http://www.foxmeadowbooks.com/production.html](http://web.archive.org/web/20090725091334/http:/www.foxmeadowbooks.com/production.html \"http://www.foxmeadowbooks.com/production.html\") I’m sorry to say that this activity doesn’t seem to be terribly difference-making.\n\nJN\n\n"
    },
    {
      "time": " 3.Sep.2007 3.43pm",
      "content": "New Guy -\n\nThat was strong. Thanks for posting. The idea that you can’t make a difference if you are making money is just plain stupid. Great post.\n\n—  \nMike\n\n"
    },
    {
      "time": " 3.Sep.2007 4.41pm",
      "content": "I think we should really think twice before making these type of silly blanket statements. There are a lot of firms out there “doing great work”, “making a difference” and “making a living” at the same time.\n\nIf your boss came to you next week and said: “Well, we are going to change the direction of this firm. We are now doing only pro bono work. We want to start ’really making a difference’. What that means is that you won’t be getting a check anymore because we simply can’t afford to pay you”.\n\nIf you desire to be involved in strictly non-profit work, then start a non-profit company. But don’t chastise the rest of us you are trying to make a living and support our families while doing what we love—and hopefully whenever possible, “making a difference”.\n\nThe notion that you (or big firms) can’t produce good work while making a profit is just preposterous.\n\nEnough on that, back to the original subject.\n\nPentagram, Duffy & Partners, FITCH and Sandstrom Design are just a few that pop into mind.\n\n"
    },
    {
      "time": " 3.Sep.2007 8.00pm",
      "content": "hildebrant’s right. it seems pretty arbitrary to condemn a firm once they’ve passed the ’5 designer’ limit. pentagram, duffy, and sandstrom are all terrific. i might add willoughby design group [http://www.willoughbydesign.com/](http://web.archive.org/web/20090725091334/http:/www.willoughbydesign.com/ \"http://www.willoughbydesign.com/\") for some of their branding work.\n\n"
    },
    {
      "time": " 4.Sep.2007 5.19am",
      "content": "I did not expect this to become as heated as it actually did;-)\n\nHaving said that I have to agree with much of what both New guy and Hildebrant says. I don’t think it is impossible to combine great work with making a buck while sticking to a budget and a time constraint. I’m not saying it is easy but deffinetly possible.\n\nA lot of designers today come up with great ideas even in a corporate setting however many ideas gets discarded by the client due to poor knowledge, from the team, of the clients standing. If we all got better at wearing the clients shoes, understood their challenges and used this as a basis for the design it wouldn’t be as hard a sell. Form should always follow function. We as designers have a lot to learn from the industrial design scene.\n\nSo what is good design? In my world something that is solved under a time constraint, within a budget with the user in focus, addressing the correct social group and is visually stunning within this market section (and allows me and my familly to eat at night). It doesn’t mean I don’t love what I do!\n\nTo answer Hildebrant’s first question “What qualifies as top? Best Work? Highest Revenue?” I would say the combination of these 2 pluss trying to make a difference;-)\n\nSome of my favourites;  \n [http://frostdesign.com.au](http://web.archive.org/web/20090725091334/http:/frostdesign.com.au/ \"http://frostdesign.com.au\")  \n [http://pentagram.com](http://web.archive.org/web/20090725091334/http:/pentagram.com/ \"http://pentagram.com\")  \n [http://spiekermannpartners.com](http://web.archive.org/web/20090725091334/http:/spiekermannpartners.com/ \"http://spiekermannpartners.com\")\n\nThen again most of my favs are crossovers or within the industrial design field: Ideo is one example.\n\n"
    },
    {
      "time": " 4.Sep.2007 6.36am",
      "content": "It’s absurd to lambaste agencies that make money as their primary goal. This \\*is\\* a business an done that happens to be about \\*commercial\\* art.\n\n’Doing good’ really has nothing to do with it. It’s about selling stuff to the masses, pure and simple.\n\n"
    },
    {
      "time": " 4.Sep.2007 8.10am",
      "content": "Ok. Here’s a straight answer. Here are five big worldwide branding and corporate design agencies. To me they are relevant because of their size and history. All of them have done great work and also some crappy, but mostly good.\n\nInterbrand  \nLandor  \nWolff Olins  \nMeta Design/Spiekermann Partners  \nPentagram\n\nIn latin america I know Ideograma.\n\nSorry but you can hardly be relevant in a global context with five people in your firm.\n\nHéctor\n\n"
    },
    {
      "time": " 4.Sep.2007 9.19am",
      "content": "Endre,\n\nIf you like crossovers, FITCH is a good example.\n\n"
    },
    {
      "time": " 4.Sep.2007 9.41am",
      "content": "Mr. Muñoz Huerta, you are making the same mistake as Mr. Sørensen and Mr. Long, except in reverse, when you state that, “you can hardly be relevant in a global context with five people in your firm.”\n\nStefan Sagmeister is one example of a designer with a very small office making “globally relevant” work. Paul Rand was another. (As an aside, many of type’s great innovators worked alone, or with one or two assistants, including Eric Gill, Frederic Goudy, and W.A. Dwiggins.)\n\nThe only rule is that there are no rules. A single person or a team of 100 can make something extraordinary. A single person or a team of 100 can make something terrible.\n\nJN\n\n"
    },
    {
      "time": " 4.Sep.2007 9.52am",
      "content": "Very nicely put NewGuy!\n\nHildebrant: Thanks I’ll have a proper look at FITCH later.\n\n"
    },
    {
      "time": " 4.Sep.2007 12.37pm",
      "content": "Well, Sagmeister is popular amongst designers but not relevant in a global business scenario. Paul Rand was globally relevant but he was also backed up by IBM. It’s not impossible but really hard.\n\nPlease don’t call me mister, I’m 25.\n\nHéctor\n\n"
    },
    {
      "time": " 4.Sep.2007 12.38pm",
      "content": "\\> Once a firm gets beyond a certain size, it’s all about making a buck, not about making a difference.\n\nI dunno, when I was a struggling freelancer in a one-man shop, it was all about making a buck. To h\\*\\*k with making a difference. I wanted food at least once a week.\n\n"
    },
    {
      "time": " 4.Sep.2007 12.56pm",
      "content": "I would imagine it is like a lot of other businesses; Is the person with the vision able to find talented people and channel their efforts? Some companies are very successful at staying relevant with over five people because of their HR strategies.\n\nOne company I deal with has a practice that once HR has approved someone, they then have to be approved by \\*everyone\\* in the department they will be working in. The reason I know this is that it seemed odd they had so many very nice people who get along so well, and asked who did their hiring.\n\nI guess if someone is “full of it” this gives more of a chance to sniff them out.\n\n"
    },
    {
      "time": " 5.Sep.2007 7.01pm",
      "content": "i’ve actually had the opportunity and good fortune to work for TWO of the firms cited in the forum.\n\nif i could go anywhere at this point, these are the firms that interest me the most:  \n2x4 ( [www.2x4.org](http://web.archive.org/web/20090725091334/http:/www.2x4.org/ \"www.2x4.org\"))  \nPentagram  \nIndustrial Facility ( [www.industrialfacility.co.uk](http://web.archive.org/web/20090725091334/http:/www.industrialfacility.co.uk/ \"www.industrialfacility.co.uk\"))\n\n"
    },
    {
      "time": " 5.Sep.2007 7.25pm",
      "content": "“Mr” Héctor,  \n25 is quite an old man, after all. :-)\n\nChrisL\n\n"
    },
    {
      "time": " 6.Sep.2007 1.34pm",
      "content": "Can’t come up with five, but two spring to mind:\n\nPentagram  \nKesselsKramer (Though you’re thrown dead with them in The Netherlands, they still do very interesting stuff)\n\n\\> also check their website ( [www.kesselskramer.com](http://web.archive.org/web/20090725091334/http:/www.kesselskramer.com/ \"www.kesselskramer.com\")) and refresh the page a couple of times... Funny stuff!\n\ncheerio Queneau\n\n"
    }
  ]
}
