{
  "id": "3673",
  "title": "(x) 1960s newspaper headline font - Tempo {anonymous}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I would like to know the name of the headline font used in my hometown newspaper (and many other papers) in the 1950s and 1960s. I am asking about the larger headlines in the image which (I hope) appers below. Thank you.   \nGIF / JPG:   \n ![Text Description](http://web.archive.org/web/20150410014626im_/http:/www.typophile.com/forums/messages/83/2886.jpg)\n\n",
  "author": "jeff560",
  "time": "19 Oct 2002 — 4:59pm",
  "uid": "579",
  "comments": [
    {
      "time": "19 Oct 2002 — 8:27pm",
      "content": "Probably a sort of [Metro](http://web.archive.org/web/20150410014626/http:/www.myfonts.com/FontFamily126.html).\n\n"
    },
    {
      "time": "19 Oct 2002 — 9:03pm",
      "content": "The lowercase italic does have some semblance, the uppercase however reminds me more of Nobel. Although even that isn't the same. But the feel is much closer in Nobel than it is in Metro, especially the condensed face 'Actual Killer' above. WAD never designed an italic for Metro either, so what you are seeing above, if it is Metro is more of an oblique than it is an italic.\n\n"
    },
    {
      "time": "20 Oct 2002 — 7:32am",
      "content": "I believe that most newspapers from this era were still using the Linotype for their composition, though possibly not for headlines, which may have been handset or Monotype.   \n   \nAlthough WAD never designed italics for the Metro series, Linotype did release some. Undoubtedly these were developed by the drawing office, possibly by mechanical means -- i.e., obliqued. The italic headlines above bear some resemblance to the Metro italics, but there are some distinct differences that I notice, particularly in the width and aperture of the 'C' and 'G'.   \n   \nThe roman, all-caps headline is not Metro, although it, too, bears similarities. The crossbar of the 'A' is too low. The crossbar on the 'T' is too narrow. The angled terminals of the 'S' are not Metro. A Metro 'N' and 'A' would have pointed vertices.   \n   \nI can't say what it is, however.   \n   \nThere were no condensed versions of Metro. The smaller, condensed headlines look like Erbar to me, though it's hard to tell at this resolution. Although originally designed for Ludwig & Mayer in Germany, the Erbar faces did make it to these shores and were copied by Linotype. They were very popular for newspaper headlines.   \n   \n-- K.\n\n"
    },
    {
      "time": "20 Oct 2002 — 6:40pm",
      "content": "It's definitely Tempo. I've got an old Ludlow specimen book and it's a perfect match for Tempo Heavy, Heavy Italic, and Heavy Condensed.   \n   \nLudlow machines were similar to Linotype machines in that they produced a whole line of type in one piece and were also popular at newspapers.\n\n"
    },
    {
      "time": "20 Oct 2002 — 7:19pm",
      "content": "Mark is right. I made a rush judgement because I   \nremember our student paper from that era was set   \nin Metro. Strike two for me this week.\n\n"
    },
    {
      "time": "20 Oct 2002 — 8:48pm",
      "content": "I wasn't sure myself until I checked the specimen book.   \n   \nTempo is one of those lost type treasures. It never really made it to phototype or digital, except for Heavy Condensed. Although there is a new incarnation of Ludlow in the UK which has release Tempo Medium Condensed. (See [http://www.myfonts.com/Search?searchtext=tempo](http://web.archive.org/web/20150410014626/http:/www.myfonts.com/Search?searchtext=tempo))\n\n"
    },
    {
      "time": "21 Oct 2002 — 4:39am",
      "content": "Good call on that Tempo. I'm looking at McGrew's _Metal Typefaces_ and the all-caps and italics are dead ringers.   \n   \nBut there's something nagging me about that condensed.The Tempo Condensed specimens that I'm looking at show a 't' with a typical curved tail at the baseline. But the scan above seems to have a straight, abrupt 't' (\"Ac **t** ual Killer To Take S **t** and Agains **t** Lawyer).   \n   \nMark, can you check the Ludlow book to see if an alternate was provided? McGrew doesn't show one.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "21 Oct 2002 — 7:50am",
      "content": "You're right. The condensed font isn't Tempo Heavy Condensed, it's (Linotype) Erbar Bold Condensed.   \n   \nOnly a few Linotype fonts were available over 36 point, and all of those were condensed. Erbar Condensed was one of the few available up to 60 point. It's quite likely that they used a Ludlow machine for headlines and the Linotype for smaller settings.   \n   \nI mentioned above that Ludlow machines were similar to Linotypes, but they were very different in one important way: Linotype was automated and had a keyboard. On the Ludlow, the operator would handset the matrices (molds) for a line of type and the line would be cast as one piece.   \n   \nLudlow offered fonts from 4 point up to 144 point, but nobody in their right mind would set a whole newspaper with one. They were mainly used for display type. I imagine they were popular at newspapers as an economical alternative to foundry type for headlines.   \n   \nObviously, Linotype could be used for smaller display type as well, and this appears to be what's going on in the sample page.\n\n"
    },
    {
      "time": "21 Oct 2002 — 10:27am",
      "content": "And to think that some people claim font-ID threads are useful only to pirates.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Oct 2002 — 10:33am",
      "content": "I'm in awe of the breadth and depth of knowledge you all have.\n\n"
    },
    {
      "time": "21 Oct 2002 — 3:11pm",
      "content": "Actually, some of this I was unsure of until I started digging. I've got old Linotype and Ludlow catalogs which I referred to when identifying the fonts, but the details about the two machines--especially the Ludlow--I was a bit vague on until I checked \"Production for the Graphic Designer\" by James Craig (1974) in which he describes all the different typesetting machines in use at that time. I believe the second edition (1990) has all that stuff too and it's still in print.\n\n"
    },
    {
      "time": "21 Oct 2002 — 4:47pm",
      "content": "I am the person who originally asked about this font. It is not Ludlow Tempo, at least as I can view it on the Internet. Note for example that the edges (ends) of S in PRESIDENT are lines at 45-degree angles to the horizontal, whereas in Tempo the edges of the S are horizontal. However, I appreciate everyone's efforts.\n\n"
    },
    {
      "time": "21 Oct 2002 — 4:51pm",
      "content": "Oops, I should have said that the line segments at the ends of S in Tempo are vertical (not horizontal) line segments.\n\n"
    },
    {
      "time": "21 Oct 2002 — 8:05pm",
      "content": "The only versions of Tempo I know of that are available digitally are Tempo Heavy Condensed, Tempo Heavy Condensed Italic, Tempo Medium Condensed, and that grungy Red Rooster version of Tempo Medium. The typefaces used in the newspaper headline (the larger ones) are Tempo Heavy and Tempo Heavy Italic, neither of which I've seen in anything but metal.   \n   \nA few samples of Tempo Heavy and Tempo Heavy Italic from \"Some Ludlow Typefaces\" (undated, c. 1956):   \n   \n ![tempo0](http://web.archive.org/web/20150410014626im_/http:/www.typophile.com/forums/messages/83/2896.gif)   \n   \n ![tempo1](http://web.archive.org/web/20150410014626im_/http:/www.typophile.com/forums/messages/83/2897.gif)   \n   \n ![tempo2](http://web.archive.org/web/20150410014626im_/http:/www.typophile.com/forums/messages/83/2898.gif)   \n   \n ![tempo3](http://web.archive.org/web/20150410014626im_/http:/www.typophile.com/forums/messages/83/2899.gif)\n\n"
    },
    {
      "time": "22 Oct 2002 — 2:11am",
      "content": "Yes, that is definitely the font. Thank you.\n\n"
    },
    {
      "time": "31 Oct 2002 — 11:21am",
      "content": "Yogi - see [http://www.myfonts.com/FontStyle575.html](http://web.archive.org/web/20150410014626/http:/www.myfonts.com/FontStyle575.html) or watch the Royal Tennenbaums.   \n   \nthe differences appear mostly in the lowercase letters.   \n   \nIf Yogi B. was a type designer, he'd say:   \n   \n\"Nobody uses that font anymore. I see it everywhere.\"\n\n"
    },
    {
      "time": "31 Oct 2002 — 11:29am",
      "content": "To be picky, I've always understood that the font   \nused in The Royal Tenenbaums was [Renner Architype](http://web.archive.org/web/20150410014626/http:/www.flashbook.ch/foundry/foundry_architype_2/renner_bold.html),   \nby The Foundry.\n\n"
    },
    {
      "time": "31 Oct 2002 — 11:52am",
      "content": "I remember reading about Wes Anderson and his recurrent use of Futura, but a quick search sees that there is a mention of Renner Architype, too. Whomever is responsible for the titling in the movies...do you think they'd find The Foundry and actually buy Renner Architype?   \n   \n I'll believe you Stephen if you can source it. Or rent it and point out which glyphs give it away. I don't want to rent it again. I liked Bottle Rocket and Rushmore better. And the Alec Baldwin voiceovers kept returning me to Thomas the Tank and the Magic Railroad.   \n   \n   \n ![:)](http://web.archive.org/web/20150410014626im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nbj\n\n"
    },
    {
      "time": "31 Oct 2002 — 12:12pm",
      "content": "Tempo was modeled after Futura and similar typefaces. Ludlow didn't own Futura, so they had Robert Hunt Middleton do their own version. It's quite a bit different in the details, escpecially in the italics, but the overall impression is similar. Most noticeably, it has a two-story \"a.\" It's less geometric than Futura. In the lightest weights (Light and Medium), the italics have slight curves to some of the strokes and even sport alternate swash caps, and tails on some of the lowercase characters.   \n   \n(I would love to do a revival of this face, but perhaps Ludlow UK is already on the case?)\n\n"
    },
    {
      "time": "31 Oct 2002 — 12:54pm",
      "content": "or how about the futuraized gill, its a total bastard, but kind of fun.\n\n"
    },
    {
      "time": "31 Oct 2002 — 1:00pm",
      "content": "Here is Tempo light. Very elegant.   \n   \n ![tempolight.jpg](http://web.archive.org/web/20150410014626im_/http:/www.typophile.com/forums/messages/83/2953.jpg)   \n   \n   \nthis scan is from the Encylopaedia of Typefaces by Cassell Paperbacks.   \n   \nbj   \n   \nYogi or Boo-boo or whoever you are, if you \\*really\\* want to see A-Z differences in the two faces, then this reference book will work for you.\n\n"
    },
    {
      "time": "31 Oct 2002 — 1:10pm",
      "content": "Ludlow also had alternate characters for Tempo to make it look like Kabel, Erbar, or Gill, depending on which ones you used.\n\n"
    },
    {
      "time": "20 Oct 2002 — 5:02pm",
      "content": "What about Tempo?\n\n"
    },
    {
      "time": "20 Oct 2002 — 5:06pm",
      "content": "Also it seems like it would be unlikely for a regional American newspaper in the '50s or '60s to have purchased Nobel. Wouldn't they have had to go directly to Amsterdam for it, since Continental must have stopped importation by that time (did they even import Nobel?)?\n\n"
    },
    {
      "time": "25 Oct 2002 — 7:20pm",
      "content": "what seperate tempo from futura?\n\n"
    },
    {
      "time": "2 Nov 2002 — 11:55am",
      "content": "Mark Simpson wrote:   \n\"Ludlow offered fonts from 4 point up to 144 point, but nobody in their right mind would set a whole newspaper with one. They were mainly used for display type. I imagine they were popular at newspapers as an economical alternative to foundry type for headlines.\"   \n   \nYep. Newspapers used Linotype for setting the body copy and Ludlow for headlines. There is an old printer here in Houston still using a Ludlow. It is amazing to watch.\n\n"
    },
    {
      "time": "1 Dec 2007 — 8:48pm",
      "content": "Yes, Tempo is one font family that I would someday love to see make a full comeback in all its glory.\n\nFor years, many people dismissed Tempo as being \"just another Futura knockoff.\" But there are plenty of noticeable differences:\n\n\\*on Futura, the capital **G** has a full round body, with a relatively long spur; on Tempo the spur is quite short, and connected to the curve by a vertical line\n\n\\*Futura's lowercase **u** has an unusual \"upper-case\" construction; Tempo's is more traditional\n\n\\*In most (but not all) weights of Tempo, the lowercase **a** has two-storied construction.\n\nTempo is also noticeable in that it is one of the very few sans-serif fonts in which the italic completely differs from the regular.\n\n"
    },
    {
      "time": "27 Feb 2011 — 1:55pm",
      "content": "Hello,\n\nI'm so happy I found this discussion-- albeit four years later. I am currently assembling a book for publication, and I am indeed trying to format the titles of each chapter to resemble headlines from the 1950s/1960s. Not being a typographer, this is all very new to me, but I do have a firm idea of what I am seeking.\n\nSo what I can glean from this conversation is that what was mostly used was a font called \"Tempo\" in heavy and heavy italic...? However, this is not currently available in a digital form-- only a condensed version in...?\n\nAdditionally, I am curious as to what the bylines, photo captions and main body of text used for a font or fonts...?\n\nI'd appreciate any assistance I could receive.\n\nCheers,  \nRyan\n\n"
    },
    {
      "time": "27 Feb 2011 — 4:03pm",
      "content": "From what I've been able to research briefly, it seems that Corona, Excelsior, News Gothic and Franklin Gothic are all possibilities for newspaper body text. Can anyone confirm this? I'm concerned with placing this within the late 1950s-early 1960s, so authenticity is important. It seems these typefaces were used with Linotype...\n\nAgain, I'd appreciate any help/suggestions with this.\n\nThank you.\n\n"
    },
    {
      "time": "27 Feb 2011 — 4:08pm",
      "content": "I suggest you to start a new thread in the Design or General Discussion sections.\n\n"
    },
    {
      "time": "27 Feb 2011 — 4:20pm",
      "content": "Thanks. Just posted something in the \"design\" section.\n\n"
    }
  ]
}
