{
  "id": "36747",
  "title": "Gourmet Magazine nameplate connected script",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Would one of you tyophiliacs be able to ID the type used for the Masthead in Gourmet Magazine?\n\n[http://www.epicurious.com/gourmet/](http://web.archive.org/web/20131010224530/http:/www.epicurious.com/gourmet/ \"http://www.epicurious.com/gourmet/\")\n\n| Attachment | Size |\n| --- | --- |\n| [GourmetMagazineMasthead.jpg](http://web.archive.org/web/20131010224530/http:/typophile.com/files/GourmetMagazineMasthead.jpg) | 30.01 KB |\n\n",
  "author": "Hildebrant",
  "time": "3 Sep 2007 — 8:42pm",
  "uid": "1286",
  "comments": [
    {
      "time": "3 Sep 2007 — 11:32pm",
      "content": "Have you tried the [Script Font Identification Guide](http://web.archive.org/web/20131010224530/http:/www.bowfinprintworks.com/ScriptIDGuide.html) by Mike Yanega?\n\n"
    },
    {
      "time": "4 Sep 2007 — 12:32am",
      "content": "I have, actually. It's a great tool (thanks to Mike)--but some of the samples are so low resolution its hard to really tell.\n\n"
    },
    {
      "time": "4 Sep 2007 — 1:28am",
      "content": "I think it could be a custom work. There are some strange overlaps at the m...\n\n ![](http://web.archive.org/web/20131010224530im_/http:/typophile.com/files/gourmet_m_4167.jpg)\n\n"
    },
    {
      "time": "4 Sep 2007 — 5:37am",
      "content": "Marten,  \nYour effort and diagram really impresses me (as does your icon)!\n\nI was wondering, for the benefit of those of us ignorant in such matters, but who are very eager to learn, would you mind elaborating on your finding? What exactly do you mean, and how did you figure it out?\n\nIf it's too time-consuming, no worries. It's just a skill that I for one would like to start developing.\n\nCheers.\n\n"
    },
    {
      "time": "4 Sep 2007 — 6:39am",
      "content": "I'm really no expert, Malbright! I'm just very much in love with type and are trying to learn more about it every day and must say that this site is one of the best places to do that...\n\nI'll let you in on a little font-ID secret: One way to find out what fonts are in use is to find a PDF containing it, or information about it. In this case I found a PDF on the [Gourmet-Works site](http://web.archive.org/web/20131010224530/http:/www.gourmet-works.com/) containing the logo. After opening it in Acrobat and realizing that the logo was outlined and there were no font information to be found I opened it in Illustrator to study the curves. There I saw the strange overlap in the the lc m. I don't really know for sure that this is custom but based my guess on this little detail. I haven't seen this kind of curve joint in a character before...\n\n"
    },
    {
      "time": "4 Sep 2007 — 9:09am",
      "content": "There is no doubt that is has been customized. What I would like to know, is if anyone knows what it was based on or modified from.\n\n"
    }
  ]
}
