{
  "id": "36759",
  "title": "\"Coffee Is Culinary\" 40s style thin condensed sans on Starbucks recipe card",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hey this is my first time posting anything here and i hope i did everything right. Not much of a forum user normally.\n\nAnyway, can anyone help me with this? I was looking for something very similar to this last week, and came across this the other day on a recipe card at Starbucks. I scanned it in and searched WhatTheFont, the closest thing it came up with was Wingate JL, but with my limited knowledge of type, the only thing that i notice to be different immediately was the leg of the R. Any help would be greatly appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [coffeetext.jpg](http://web.archive.org/web/20071017181518/http:/typophile.com/files/coffeetext.jpg) | 32.11 KB |\n\n [‹ Mountain Mike's - ID ME](http://web.archive.org/web/20071017181518/http:/typophile.com/node/36975 \"Go to previous forum topic\") [adidas ad font ›](http://web.archive.org/web/20071017181518/http:/typophile.com/node/36984 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071017181518/http://typophile.com/user/21395\" title=\"View user profile.\">RobotsRockTheParty</a>",
  "time": "<br>",
  "uid": "21395",
  "comments": [
    {
      "time": " 4.Sep.2007 9.54am",
      "content": "The kerning looks freefont.\n\n"
    },
    {
      "time": " 4.Sep.2007 10.45am",
      "content": "Not sure if i follow Jan, what do you mean by freefont?\n\n"
    },
    {
      "time": " 4.Sep.2007 11.41am",
      "content": "Hi there:\n\nJan means that the spacing looks a little out of whack to him hence, not programed well- like most free fonts that have poor kerning.\n\nI love the R too. I have a feeling its a customized by the in-house Starbucks art group. But what the original typeface I do not know.\n\nMikey :-)\n\n"
    },
    {
      "time": " 10.Sep.2007 9.04am",
      "content": "Thank you both for your help. In case you were curious, I think I found it. I realized that I had recognized this font from a piece that came across my desk the other day. It was a proof that I received from another designer asking what I thought. I was able to open it up in Illustrator and find out the fonts I didn’t have on my system. If I’m right, it looks to be a combination of Chalet Comprime 1960 and Chalet Comprime 1970 from House Industries. Thank god for the Lettersetter and other designers not outlining their fonts. Now I can rest. Thanks again for your help.\n\nSeth\n\n"
    },
    {
      "time": " 10.Sep.2007 9.12am",
      "content": "Never mind, i looked at it a little further. I’m wrong. thought i was pretty smart for a second.\n\n"
    },
    {
      "time": " 11.Sep.2007 4.17am",
      "content": "\\> _thought i was pretty smart for a second._\n\nActually, we all do. Don’t let our grandstanding trick you into believing we know what we’re doing here. ;^)\n\n"
    }
  ]
}
