{
  "id": "36751",
  "title": "New design logo/ freelance designer",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI wondered if you might have some ideas on this rough BW logo design i've done. I need to align and tidy up, but wanted to find out what you all thought. I work in print mainly these days, however when I registered the name I was doing more new media.\n\nI wanted to reflect the following key words:\n\nprofessional  \nforward moving  \nClean  \nWorks black and white and colour  \nfluid  \ntimeless  \nfresh  \nsolid  \nprint and new media\n\nI've keep the play symbol small as I don't want to reflect new media too much more a balance. Although the font is 1970's est I think it does give a modern feel. Do you think there is a better way to go, more symbolistic way, using more of the play button logo.\n\nCheers for your thoughts\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/logoMPD_6538.jpg)\n\n",
  "author": "chiefdzp",
  "time": "4 Sep 2007 — 6:10am",
  "uid": "21388",
  "comments": [
    {
      "time": "4 Sep 2007 — 6:17am",
      "content": "I like the fact that it has an idea behind it. Honestly, I've seen controls such as play, pause, ff, etc., used many, many times, but the fact your logo is something more than just a typeface counts for a lot in my book.\n\nPersonally, and this is totally subjective, I think the font looks dated and sorta stale. But that's just me. What matters most is if you like it and can live with it.\n\nI am assuming you will tidy up the kerning, expecially that l/a combination.\n\nFinally, the small strapline is going to get lost when the logo comes down to a smaller size. I think this small tagline is important because without it your name strikes me as more of a technology than a service provider.\n\nNice idea.\n\n"
    },
    {
      "time": "4 Sep 2007 — 6:21am",
      "content": "Hi,\n\nThanks for your comments, true and very useful. Could you suggest a font that might work which would reflect a more up to timeless feel.\n\nCheers\n\nDan\n\n"
    },
    {
      "time": "4 Sep 2007 — 8:14am",
      "content": "Wow. That's a big question. I think that the search is one of the big joys of typographic design!\n\nHere's what I suggest. Visit some of the foundries and see what YOU think.\n\nGo to:\n\nSudtipos  \nFoundrytypes  \nVeer  \nFontShop  \nMyFonts  \nDie-Gestalten  \netc.\n\nThen, start poking around Typophile and look at the font IDs. There are lots of treasures to be found and the beauty is you get to see them in use. Tip: Search Typophile using Google as opposed to the built-in search function. You'll get more results. Instructions on how to google site specifically lie elsewhere on the site.\n\nMake printouts of all the fonts you like. Put them on the wall. Then, walk away for a few days and see how you feel when you get back.\n\nWe expect a full report!\n\n"
    },
    {
      "time": "4 Sep 2007 — 8:28am",
      "content": "Thanks, I just went through font shop had about 30 faces, this gives me lots more fun. I'll see if I can find something that feels more in tune with what i'm looking for and post the results!\n\n"
    },
    {
      "time": "4 Sep 2007 — 9:18am",
      "content": "Good luck, and have fun!\n\n"
    },
    {
      "time": "6 Sep 2007 — 3:25am",
      "content": "Just another point. Do you really need the 'ltd' in your stapline? As far as I'm aware, at least in New Zealand, you don't need to have the 'ltd' in your branding – it's just part of your trading name. Just having 'mediaplay design' will look much nicer, and you'll avoid readability issues mallbright mentioned when scaled down. If you stick with that composition, you can make 'design' larger, with the extra room and I'd suggest trying setting 'design' in all caps to make it more snug in there and get rid of any awkward spaces you're generating in there with the ascenders of the lower case.\n\n"
    },
    {
      "time": "13 Sep 2007 — 5:58am",
      "content": "I've been working away, looking through loads of fonts and have come up with a list to go on my wall to look at. The resources here are fantastic, apart from reading elements of typography and general looking at fonts in sample books and books I really haven't had a clue about what fonts to use and how to go about them best. I feel looking through the site I made a little process in visually understanding it all a bit more. I worked out that I wanted to go with a more fluid, open and clean font rather than the constricted one I was looking at. I went with fonts with short accenders and decenders as there are quite a few, and this makes it more neat and compact. It gave it a dial like feel which worked well with the play element. I ended up not liking my previous effort. I thought my efforts were amateurish.\n\nthe contenders (again drawn to the 1970s)\n\nchalet tokyo  \nNew york and paris 1970\n\n[http://www.houseind.com/index.php?page=showfont&id=4&subpage=viewfonts](http://web.archive.org/web/20131020063159/http:/www.houseind.com/index.php?page=showfont&id=4&subpage=viewfonts \"http://www.houseind.com/index.php?page=showfont&id=4&subpage=viewfonts\")\n\nlogosman  \n [http://www.die-gestalten.de/fonts/detail/?id=be0db8100b6598b2010bf2f39a9...](http://web.archive.org/web/20131020063159/http:/www.die-gestalten.de/fonts/detail/?id=be0db8100b6598b2010bf2f39a980049 \"http://www.die-gestalten.de/fonts/detail/?id=be0db8100b6598b2010bf2f39a980049\")\n\ninsignia  \n [http://www.linotype.com/872/insignia-family.html](http://web.archive.org/web/20131020063159/http:/www.linotype.com/872/insignia-family.html \"http://www.linotype.com/872/insignia-family.html\")\n\nff super grotesk  \n [http://www.fontshop.com/fonts/downloads/fontfont/ff\\_super\\_grotesk/](http://web.archive.org/web/20131020063159/http:/www.fontshop.com/fonts/downloads/fontfont/ff_super_grotesk/ \"http://www.fontshop.com/fonts/downloads/fontfont/ff\\_super\\_grotesk/\")\n\npl futura maxi font  \n [http://www.linotype.com/157446/plfuturamaxi-family.html](http://web.archive.org/web/20131020063159/http:/www.linotype.com/157446/plfuturamaxi-family.html \"http://www.linotype.com/157446/plfuturamaxi-family.html\")\n\nI also really loved foundry context but more for type  \n [http://www.foundrytypes.co.uk/foundry\\_context/context.html](http://web.archive.org/web/20131020063159/http:/www.foundrytypes.co.uk/foundry_context/context.html \"http://www.foundrytypes.co.uk/foundry\\_context/context.html\")\n\nOnce i've made up my mind, its to the drawing board to work on the logo.  \nI want to incorporate a play symbol in a circle somewhere as a graphic. My tagline will be something like switched on design or forward thinking\n\nAny thoughts on these fonts above would be gratefully received\n\n"
    },
    {
      "time": "13 Sep 2007 — 1:26pm",
      "content": "There is this other topic in the forum: [wordmark for visual artist](http://web.archive.org/web/20131020063159/http:/typophile.com/node/36338)\n\nThe designer wrote:\n\n<cite>Key words are, empowerement, luxury, contemporary, approachability and possibly subtly suggest her asian influence (specifically japanese).</cite>\n\nAnd my reply was:\n\n<cite>Anyway, I think you’re aiming *way* too high — five “keywords” which appear to be contradictory with each other to the common sense. I wouldn’t even know how to unify “empowerment” with “luxury”, or “luxury” with “approachability” — I’d say “luxury” pretty much negates the other two.</cite>\n\n<cite>If anyone actually pulls it off to deliver something that echoes all your five “keywords” to the majority of the audience, I’d call him a grandmaster of design without any hesitance.</cite>\n\nWhat you're trying to do reminds me strongly of that -- particularly your reaching for \"fluid\" and \"solid\" at the same time.\n\n"
    },
    {
      "time": "13 Sep 2007 — 2:12pm",
      "content": "thanks that makes sense, I have an idea of what I want to do now. Simplicity is the one key word I think ;)\n\n"
    },
    {
      "time": "16 Sep 2007 — 9:06am",
      "content": "Latest rough logos, that are going on the wall Any comments you have good or bad or any favourites please say. Colours, kerning and fonts to decide on an clean up\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/new-logos-copy_5167.gif)\n\n"
    },
    {
      "time": "16 Sep 2007 — 9:14am",
      "content": "I like the \"forward thinking\" scheme a lot. However, I strongly dislike the font you picked.\n\n"
    },
    {
      "time": "16 Sep 2007 — 9:18am",
      "content": "Hi Henry can you be a little for specific, is it personal dislike or functional dislike  \nThanks for your comment, its much appreciated :)\n\n"
    },
    {
      "time": "16 Sep 2007 — 11:11am",
      "content": "It's personal, I guess. But I also think that font is overused, which would be an objective negative. I feel you'd be much better off with something like [VAG Rounded Light](http://web.archive.org/web/20131020063159/http:/www.myfonts.com/fonts/adobe/vag-rounded/vagrounded-light/).\n\n"
    },
    {
      "time": "16 Sep 2007 — 11:57am",
      "content": "Thanks Henry for the suggestion i'll look into it.\n\n"
    },
    {
      "time": "16 Sep 2007 — 5:04pm",
      "content": "The concern I have with most of the last roughs you posted, is that they look very crammed (like the 2nd from the left in the middle row). As in; there is, in my opinion, too much going on. There are the graphic images, the wordmark, and then you incorporated some of the parts of the images into the wordmark as well. _And_ then there is also the tagline.  \nI would stick with a wordmark plus the image, and don't put any more doodles around it.  \nYou might find a solution for the tagline, but check if you really need it. You can always put that tagline in another way on your stationary (or whatever you will put it on).\n\n"
    },
    {
      "time": "17 Sep 2007 — 12:23pm",
      "content": "I'm most drawn to the pink and green circular logos, though the lower loop on the P seems like it should be/suggest something and it doesn't. Hve you tried the same look without it?\n\n----======\\*======----  \n\"If someone's 'been around the block a few times,' it might mean he didn't have the good sense to give up and park in the lot.\" ~ Mike Nelson 'Mind Over Matters'\n\n"
    },
    {
      "time": "24 Sep 2007 — 12:41am",
      "content": "I've been through researching and come up with this design any thoughts on the design colours, kerning layout would be great. My tagline is forward thinking design. One thing i'm worried about is the balance at the top, the thought bubbles come from the I. I've tried it elsewhere, but it didn't make so much sense. Would you drop the thought bubbles or fill them in with colour or have them in a device that balances it all?\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/new-logo_3855.jpg)\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/1_3529.jpg)\n\n"
    },
    {
      "time": "24 Sep 2007 — 1:51am",
      "content": "ps. Thanks Robert for your earlier comments :)\n\n"
    },
    {
      "time": "24 Sep 2007 — 2:40am",
      "content": "WOW. That's fast. I didn't mean to be rude even though looking at last night I could sound that way. It's just that I get annoyed by same problem split into different posts. So thank you very much. You just made our life easier. :)\n\n"
    },
    {
      "time": "24 Sep 2007 — 2:43am",
      "content": "BTW: Did you try to put that rounded rectangle (the play usual icon) instead of letter P. I think it would still read \"mediaplay\". But no circles, just this plain triangle shape. Probably in violet. :)\n\n"
    },
    {
      "time": "24 Sep 2007 — 2:48am",
      "content": "I'll give it a go tonight, thanks\n\n"
    },
    {
      "time": "24 Sep 2007 — 3:07pm",
      "content": "some attempts here, I like the idea. But people may get the wrong idea about my services and my wife would not be to happy. When I do what you suggested I read media lay :0) or a flag which i'm not keen on. Thanks for the idea a few others to ponder.\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/adjustment_4075.jpg)\n\n"
    },
    {
      "time": "24 Sep 2007 — 3:54pm",
      "content": "I like where you're going in concept 3 -- it has the potential to be a very strong mark. Have you tried playing with adding the missing descender to the triangle somehow? Or putting the triangle inside the counter of the p? Perhaps it needs a different font to make it _really_ work?\n\n[Eileen Burke Graphic Design](http://web.archive.org/web/20131020063159/http:/www.eileenburke.org/)\n\n"
    },
    {
      "time": "25 Sep 2007 — 12:37am",
      "content": "hi,\n\nThis would be no.6, but I really don't like it any ideas on improving it?\n\n"
    },
    {
      "time": "25 Sep 2007 — 5:53am",
      "content": "I'm wondering about the font, too. Do you really love the current one so much you're simply unwilling to try out others?\n\nI have to say, with the current font, there is simply no way the logo can work for me -- at all. To me, the ugliness of the font will just overshadow everything.\n\n"
    },
    {
      "time": "25 Sep 2007 — 6:35am",
      "content": "hi i'll try some new fonts tonight out, having t buy the fonts each time is a costly exercise, I look at vag rounded again which one would you work with from the above henry?\n\n"
    },
    {
      "time": "25 Sep 2007 — 10:21am",
      "content": "I usually just work with a preview of the font from FontShop or wherever to see how it'll look before actually buying it. It won't be a vector, but it'll give you a good sense of how the design will work.\n\n- Lex\n\n"
    },
    {
      "time": "25 Sep 2007 — 10:41am",
      "content": "Ditto. Veer has a font preview tool as well as a full character map for that sort of on the fly testing.\n\n"
    },
    {
      "time": "25 Sep 2007 — 1:31pm",
      "content": "Plus, Veer lets you preview ligatures (not sure if FontShop does).\n\n- Lex\n\n"
    },
    {
      "time": "25 Sep 2007 — 2:22pm",
      "content": "thanks for the posts, didn't know that about veer :), I knew about the previews but I thought posting a copy of something I didn't own was illegal\n\ncould you have a look at these and give an opinion\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/adjustment2_5224.jpg)\n\n"
    },
    {
      "time": "25 Sep 2007 — 2:37pm",
      "content": "You've decided to drop the \"forward thinking\" scheme (I don't mean the tagline, but the \"think bubble\")? I don't like any of the latest batch.\n\n"
    },
    {
      "time": "25 Sep 2007 — 3:21pm",
      "content": "but you like the font Henry, would that be a positive? ;) I got the feeling no one like the forward thinking idea and that it was confusing to the initial design. Seperate almost to the key of the design. Thanks for the post though! I see if any other comments and maybe go back to the drawing board or to a previous design. I do like this font too, it has a bit more playfulness to it\n\n"
    },
    {
      "time": "25 Sep 2007 — 4:16pm",
      "content": "Why did you feel \"no one like the forward thinking idea\"? I clearly said in my second comment, \"I like the 'forward thinking' scheme a lot.\" Did you not see that?\n\n"
    },
    {
      "time": "25 Sep 2007 — 11:34pm",
      "content": "your right henry apologies. I'm going to give it a rest for a while maybe. Its all just not been right :(\n\n"
    },
    {
      "time": "26 Sep 2007 — 1:40pm",
      "content": "Hi although as rough as you can get do you think this has some legs in it. A previous thought\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/logo-copy_4075.jpg)\n\n"
    },
    {
      "time": "26 Sep 2007 — 1:45pm",
      "content": "This latest one is very interesting. You might want to round the three corners of the triangle. It would be interesting to see it in conjunction with a wordmark using the same typeface as the 'm'.\n\n- Lex\n\n"
    },
    {
      "time": "26 Sep 2007 — 1:56pm",
      "content": "Thanks lex for the comment, I butchered another font to get this. I wanted to create good positive and negative space. Maybe if I post it in whats this font I might get some suggestions to the nearest type of font that could work with this.\n\n"
    },
    {
      "time": "26 Sep 2007 — 2:29pm",
      "content": "FYI, mediaplay is (er...was? Are they still in business?) a chain of somewhat cheesy strip mall music retail stores here in the US. Might want to take that into consideration depending on your locale.\n\n"
    },
    {
      "time": "26 Sep 2007 — 3:04pm",
      "content": "they went bust, bought out and then disovled I think. i'm in the uk and had the name for 15 years. Thanks for the note though. Any comments on the comp?\n\n"
    },
    {
      "time": "27 Sep 2007 — 10:17am",
      "content": "Make absolutely sure the \"m\" is distinctly different to that of McDonald's.\n\n"
    },
    {
      "time": "27 Sep 2007 — 12:18pm",
      "content": "I can't think of anything I would less like to be associated with. I'm bit of a food lover and work a lot with food so that association would be a killer\n\n"
    },
    {
      "time": "27 Sep 2007 — 1:04pm",
      "content": "How about using a version of \"m\" that doesn't have a \"double swing\"? That would instantly seperate it from the \"Big Mac\".\n\nA few examples:  \n [Magistral](http://web.archive.org/web/20131020063159/http:/www.myfonts.com/fonts/paratype/magistral/)  \n [Biortec](http://web.archive.org/web/20131020063159/http:/www.myfonts.com/fonts/dooleytype/biortec/)  \n [Industria](http://web.archive.org/web/20131020063159/http:/www.myfonts.com/fonts/linotype/industria/)  \n [Equaliser](http://web.archive.org/web/20131020063159/http:/www.myfonts.com/fonts/phatphonts/equaliser/)  \n [Mercado](http://web.archive.org/web/20131020063159/http:/www.myfonts.com/fonts/madtype/mercado/)\n\nAll those fonts have a lower case \"m\" without a double swing.\n\n"
    },
    {
      "time": "27 Sep 2007 — 1:12pm",
      "content": "BTW, I agree with Lex that the corners of the rectangle should be rounded.\n\n"
    },
    {
      "time": "27 Sep 2007 — 2:13pm",
      "content": "how do you feel about these combos? Thank you for the suggestions. I think the first logo M will need work, kaufmann bold is the font with it\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/ROUNDED_4776.jpg)\n\n"
    },
    {
      "time": "27 Sep 2007 — 2:45pm",
      "content": "When I mentioned resemblance to the Big Mac, I actually meant the \"m\" you had there. Obviously I didn't communicate that clearly enough, since you're still keeping it.\n\nAlso, the rounded corners of the triangle should be much more visible -- with significantly larger rounding radius.\n\nNow, allow me to suggest the following concept:\n\n1. Create a rectangle with rounded corners -- thick white outline, no fill;  \n2. Add a vertical stroke in the middle and erase the bottom side -- now you have a \"m\" which is symmetrical and without double swing;  \n3. Put a triangle with rounded corners around the \"m\" -- black fill, one angle pointing downwards;  \n4. Rotate the whole thing, which should still be left-right-symmetrical until this point, 30 degree clockwise.\n\n"
    },
    {
      "time": "27 Sep 2007 — 11:58pm",
      "content": "thanks henry sounds good, i'll give it a go and see\n\n"
    },
    {
      "time": "29 Sep 2007 — 3:43am",
      "content": "just quickly done some, I'm not sure a completly on the money but the concept works\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/logo13_3795.jpg)\n\n"
    },
    {
      "time": "29 Sep 2007 — 3:48am",
      "content": "Could you make the \"m\" slimmer? And maybe increasing the rounding radius of the corners somewhat.\n\n"
    },
    {
      "time": "29 Sep 2007 — 3:53am",
      "content": "do you mean narrower?\n\n"
    },
    {
      "time": "29 Sep 2007 — 7:34am",
      "content": "How about this:\n\n ![](http://web.archive.org/web/20131020063159im_/http:/typophile.com/files/mediaplay_4943.png)\n\nIt seems to be easier just showing you what I meant than explaining it...\n\nEDIT: Tweaked a bit.\n\n"
    }
  ]
}
