{
  "id": "36764",
  "title": "Font for Business Name",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,\n\nI have been browsing the forums for a few months in an effort to become acquainted with fonts for a business name. For a numbers person I have realized the uses, types, and presentations are larger than I realized.\n\nI have a small business that specializes in backoffice work or data tracking in the oil and gas industry. Trusts, individuals, and attorneys are areas I have gained work. My business name is “Oildat”. I have browsed the Parsine and Daxline fonts yet I am unsure how the short name presents. Assurance, trust, yet modern or upbeat is a few meaning I would like to convey in the font and name.\n\nAny ideas, suggestions or a direction you could point me would be appreciated.\n\nThank you again for providing a great atmosphere for learning.  \nMichael\n\n",
  "author": "<a href=\"/web/20111228165121/http://typophile.com/user/21402\" title=\"View user profile.\">Michaelk</a>",
  "time": "<br>",
  "uid": "21402",
  "comments": [
    {
      "time": "",
      "content": "Go to MyFonts.com or Veer.com and try browsing their libraries... both sites will let you \"preview\" short text passages (a word or two) in any font(s) you find, giving you a better idea of what your logotype would look like.\n\n"
    },
    {
      "time": "",
      "content": "Don't miss [www.vllg.com](http://web.archive.org/web/20111228165121/http:/www.vllg.com/ \"www.vllg.com\"), they also let you write phrases. Have you thougth of hiring someone to it for you?\n\n"
    },
    {
      "time": "",
      "content": "<cite>fonts for a business name</cite>\n\nDo you mean for a logo? If so, I'd suggest a designer. Many will give you \"unlimited revisions\", so your satisfaction is practically guaranteed.\n\nSeriously though, they can make some subtle tweaks, even to simple words that make it work better. Some portfolios could probably be suggested to find someone whose work you admire.\n\n"
    },
    {
      "time": "",
      "content": "Thank you for your suggestions. Yes, in particular the font was for a business name logo. Previewing the name on MyFonts has made it easier to visualize.  \nI had narrowed the search to fonts for the company name. Was it lack of creativity or remembrance of font type logos that leave impressions?\n\nYes, threads on designers and websites I have tended to follow as I feel I'm out of my field.\n\nThank again!\n\n"
    }
  ]
}
