{
  "id": "36768",
  "title": "Just an idle query I didn't want to muck up the boards with.",
  "forum": "metalfoot's blog",
  "tags": [

  ],
  "content": "[Blather on]\n\nAt what point should the amateur designer, that is, me, start to display his work for critique? I’ve got very rudimentary outlines going and a usable, if not pretty, font started.\n\nHow much self-woodshedding should I undertake before allowing my precious creation into the realm of critique?\n\n(Or am I just overanalyzing this and should get over it already and post the blasted thing...)\n\n[Blather off]\n\n",
  "author": "<a href=\"/web/20080905133602/http://www.typophile.com/user/16041\" title=\"View user profile.\">metalfoot</a>",
  "time": "<br>",
  "uid": "16041",
  "comments": [
    {
      "time": " 4.Sep.2007 2.46pm",
      "content": "metalfoot, I think that if you feel something is ready for a critique, then go for it. I tend to overthink things, too! :-)\n\n"
    },
    {
      "time": " 4.Sep.2007 2.49pm",
      "content": "Some people don’t take criticism well, so it depends on your attutude. Sometimes it helps to have thick skin.\n\n"
    },
    {
      "time": " 4.Sep.2007 2.52pm",
      "content": "I’m just wondering if it’s better to let fly with the incompetence early on and get it cleared up or wait till later and then suffer more, I suppose...!\n\n"
    },
    {
      "time": " 4.Sep.2007 3.06pm",
      "content": "I’ve always been a ’let ’er rip’ kind of person. Sometimes this works. Other times the results are not what I expected. Your mileage may vary.\n\n"
    },
    {
      "time": " 4.Sep.2007 3.53pm",
      "content": "Sometimes I’m hestitant to put my work up for genuine critique as well. I do it all the time of course , because critique is too valuable to ignore. (Although I haven’t posted much on Typophile directly too often, my work is available on my website/flickr page and so on).\n\nBut I overthink it too, most of the times...\n\n"
    },
    {
      "time": " 5.Sep.2007 6.29am",
      "content": "Critiques are part of the design process. The best design (IMHO) is usually accomplished when you can get feedback from other fellow graphic designers.\n\nSo, as soon as you are ready to accept critiques, post’em!\n\n"
    }
  ]
}
