{
  "id": "36765",
  "title": "High School Newspaper critique",
  "forum": "Design",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20080628175045im_/http:/www.typophile.com/files/FreeStatePg1Iss8_4616.jpg)\n\nI’m the new editor of my high school (free state high)newspaper, and I wanted some feedback on the cover I’ve been designing. Normally its an 8 page tabloid style, but our first issue is only going to be 4 pages. We come out every three weeks, our readership is somewhere around 1000 students with some parents. Our school colors are green and silver (hence the green “FREE”). Just in case you don’t know, the boxes are going to be pictures.\n\nFonts I’ve been using:  \nMasthead/misc design elements: Franklin Gothic(Heavy,Book, etc.)  \nNews Headline: Myriad  \nFeature Headline: Caslon  \nBody Copy: Goudy Old style\n\n [‹ Condensed Deco Fonts](http://web.archive.org/web/20080628175045/http:/www.typophile.com/node/36678 \"Go to previous forum topic\") [Layout for legal documents ›](http://web.archive.org/web/20080628175045/http:/www.typophile.com/node/36720 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080628175045/http://www.typophile.com/user/21033\" title=\"View user profile.\">Streblo</a>",
  "time": "<br>",
  "uid": "21033",
  "comments": [
    {
      "time": " 4.Sep.2007 1.53pm",
      "content": "I like it. I might tone down the grey semi circles a bit lighter and bring in the font selection a bit. At most I would use 3. Maybe merge featured headline and newsheadline and pick one font for both. Then I might even consider merging that with the headline. If you pick 2 fonts with a decent selection of weights, you will only improve it. Or so i think...\n\n"
    },
    {
      "time": " 4.Sep.2007 2.13pm",
      "content": "Don’t vcnter the headlines. But if your headlines are going to be centered, center the title?\n\nWhy are you mixing two similar serifs instead of using different weights of one? And why are the feature headlines in a font used nowhere else instead of a lighter and smaller version of the headline font? You can clean things up a lot by using one font for the masthead and headlines, and a second font for the body copy.\n\nAlso, are there going to be margins on this thing? I know that this is a school newspaper and budgets are tight, but you should really give it more air on the sides.\n\n"
    },
    {
      "time": " 4.Sep.2007 2.17pm",
      "content": "I agree that it looks good.  \nSome tips: I would keep the references to the pages limited to one sidebar. That way you gain some space for a slightly longer main article, or some other small news pieces, bulletin board or an editorial.  \nAs for the typography: I like your use of a sans-serif font, which gives the paper a good contemporary feel. I think it might be a good idea to use a slighly less bold font for the header, make the line under the header a bit thinner and increase the space between header and headline. This gives the layout a bit more room to breathe.  \nAnd you might want to consider making the layout a bit more assymetrical, for example by introducing some (horizontal) elements to break the now pretty dominant vertical columns. This might spice up the layout a bit more.\n\nKeep it up!  \nQueneau\n\n"
    },
    {
      "time": " 4.Sep.2007 2.24pm",
      "content": "You should stick to one sans family (Myriad or Franklin are both good, but use just one), and one serif. Both Goudy and Caslon are relatively wide, though I’m not sure which version of Caslon you have. Something like Minion Pro is more economical of space and has more weight variants than Goudy (and Caslon, depending on your version). I wouldn’t use Caslon for headlines, but that’s just my opinion.\n\nI’m not sure about those large white spaces in the left and right columns. I’m assuming they would ordinarily be filled with more inside features (i.e. for the intended 8-page version). If not, I would distribute the white space through the design. The masthead, headline seem crunched.\n\n"
    },
    {
      "time": " 4.Sep.2007 6.52pm",
      "content": "My first reaction: What’s with the green, is this a Berkeley high school paper? (Okay, now I get the colors.) Ooh, Franklin is nicer than I remembered at that large size.\n\nMy second thought: Beware of white (empty) space here. For any other design job use white space liberally, and then some. But, here lots of groups (faculty, students and their dogs) will fight to get their thing on the front page since there’s room. (I’ve witnessed [one too many home pages](http://web.archive.org/web/20080628175045/http:/www.dwell.com/) follow the same downward spiral.) It is better if you prepare for the space to fill in (design for it!) than to let that happen later by people who will inherit your design and inevitably lack the design sensibility to do it right.\n\nRandom thoughts:  \n- You could be more innovative with some things. The header area could present interesting, relevant, tidbits of news. Or you could go full width on THEFREEPRESS but only show the bottom 2/3rds of the words. How about a double S ligature, or something to add some surprise/customization to the masthead. Just don’t get too tricky and you’ll be fine.  \n- Don’t rely too heavily on actual lines when an implied line will do.\n\n"
    }
  ]
}
