{
  "id": "36789",
  "title": "Adobe Delivers Font Folio 11",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20080102042506/http:/www.typophile.com/user/108 \"View user profile.\") : 5.Sep.2007 12.18am \n\n**Adobe Delivers Font Folio 11**\n\nComplete OpenType Solution For Any Medium Now Available\n\n**SAN JOSE, Calif. — Sept. 5, 2007 —** Adobe Systems Incorporated (Nasdaq:ADBE) today announced Adobe® Font Folio® 11 software, the industry’s most comprehensive type solution for print, the Web, digital video and electronic documents. With more than 2,300 fonts from the Adobe Type Library in OpenType® format Font Folio 11 provides enhanced linguistic support, advanced typographic features, and true cross-platform compatibility, providing access to thousands of font options for designers, printers and advertisers in search of original and classic typefaces.\n\nNatively supported across Mac OS X, Microsoft® Windows Vista®, and Windows XP and based on the recent revision and update of the Adobe Type Library, Font Folio 11 includes 176 new fonts from world-renowned foundries and cutting-edge designers. The package also includes award-winning Adobe Originals typefaces — one-of-a-kind designs and classic revivals created by expert type designers at Adobe.\n\n“With Font Folio 11, we have taken our world-class standard library of OpenType fonts and added exciting new typefaces, including Arno Pro and Garamond Premier Pro,” said Don Walker, senior director, Print and Classic Publishing Solutions at Adobe. “We’ve also further refined our implementation of OpenType, continuing our 25-year tradition of making the world’s highest-quality digital fonts.”\n\n**Design with Superior Typefaces**\n\nAdobe fonts offer reliable quality whether output to inkjet printers, laser printers, imagesetters, or platesetters. Advertisers can enhance marketing materials by creating animated GIFs and other typographically rich elements for Web pages or by adding high-impact title effects to digital video and multimedia projects.\n\nFont Folio 11 offers special Opticals packages that provide four or more separate designs for each font, each optimized for a different range of point sizes, from tiny text for footnotes to large type for headlines. Many of the OpenType fonts in Adobe Font Folio 11 contain an expanded glyph set and advanced typographic features, providing designers with the ability to enhance their compositions with typographic extras such as swashes, small caps, and old-style figures.\n\n**Create with OpenType Flexibility**\n\nThe OpenType format displays and prints fonts seamlessly on Macs and PCs and can be used alongside existing font formats in all documents. The OpenType features of Adobe InDesign® CS3 also take advantage of extended features of many of the fonts in Font Folio 11. In addition, printers can easily publish multilingual documents with Font Folio 11 Unicode support, including Central and Eastern European languages, as well as Japanese, Greek, and Cyrillic. Pricing and Availability\n\nThe Adobe Font Folio product is available starting September 6, 2007 and will be sold primarily through Adobe.com, Adobe retail and licensing channels, and includes a standard 20-computer license for US$8,999. Upgrade pricing, from Font Folio versions 8 or 9 or Font Folio OpenType Edition, is available starting at US$1,599. Adobe is also releasing a special 5-computer license of Font Folio OpenType Edition for smaller design workplaces that is available for US$2,599. International English versions are available where localized versions are not sold. For more information please visit [www.adobe.com/products/fontfolio](http://web.archive.org/web/20080102042506/http:/www.adobe.com/products/fontfolio \"www.adobe.com/products/fontfolio\").\n\n**About Adobe Systems Incorporated**\n\nAdobe revolutionizes how the world engages with ideas and information – anytime, anywhere and through any medium. For more information, visit [www.adobe.com](http://web.archive.org/web/20080102042506/http:/www.adobe.com/ \"www.adobe.com\").\n\n###\n\n© 2007 Adobe Systems Incorporated. All rights reserved. Adobe, the Adobe logo, Font Folio and InDesign are either registered trademarks or trademarks of Adobe Systems Incorporated in the United States and/or other countries. Mac OS is a trademark of Apple Inc., registered in the U.S. and other countries. Microsoft OpenType, Windows, and Windows Vista are either registered trademarks or trademarks of Microsoft Corporation in the United States and/or other countries. All other trademarks are the property of their respective owners.\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080102042506/http:/www.typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 5.Sep.2007 12.18am",
  "uid": "108",
  "comments": [

  ]
}
