{
  "id": "36785",
  "title": "Typography for Tarot Deck",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm working on illustrating and designing a Tarot deck.\n\n[http://rondomingue.com/2007/09/04/temperance/](http://web.archive.org/web/20141018173239/http:/rondomingue.com/2007/09/04/temperance/ \"http://rondomingue.com/2007/09/04/temperance/\")\n\nI want to add the title of the card at bottom. However, Its debatable since some decks don't have them. The Tarot of Marseilles does have titles and my set is loosely patterned after it. I like the French decks so I like the typography to match the style. I chose Baskerville initially but I'm not certain of it. Can anyone offer some insight or suggestions what I should do typographically?\n\n ![](http://web.archive.org/web/20141018173239im_/http:/typophile.com/files/temperance_4891.jpg)\n\n",
  "author": "rondomingue",
  "time": "4 Sep 2007 — 9:25pm",
  "uid": "17836",
  "comments": [
    {
      "time": "4 Sep 2007 — 9:51pm",
      "content": "Excellllent. Some suggestions:\n\n[Storm Jannon](http://web.archive.org/web/20141018173239/http:/www.myfonts.com/fonts/storm/jannon/). Based on an antique French model, excellent update by Frantisek Storm.\n\n[Christian Gothic](http://web.archive.org/web/20141018173239/http:/www.typophile.com/node/9245). No, it's not released, but I'd be happy to let you work with a beta version if you felt it was right.\n\n[Della Robbia](http://web.archive.org/web/20141018173239/http:/www.myfonts.com/fonts/bitstream/della-robbia/). It's based on an Italian model rather than French, but has the right flavor of antiquity and matches the low stroke contrast but sharp features of the card you showed.\n\n[Beaufort](http://web.archive.org/web/20141018173239/http:/www.myfonts.com/fonts/shinn/beaufort/) by Nick Shinn. A beautiful modern update to the same genre as Della Robbia, and by a designer who's still breathing.\n\nMost of all, have fun! Go with whatever works best visually with your artwork.\n\n"
    },
    {
      "time": "4 Sep 2007 — 10:44pm",
      "content": "i was thinking Storm too, but more along the lines of\n\n"
    },
    {
      "time": "5 Sep 2007 — 1:51am",
      "content": "Oddly, tho' not really authentic for a French deck (perhaps one based on the Swiss, however), I like the suggestion of the Della Robbia. Look, carefully whether you'll want a boldface to make an impression with the illustrations on the Major Arcana. Brings up a good question: Are you fully illustrating the minor Arcana--i.e, the Ace of Cups, Nine of Pentacles, etc.--as many decks do? If you've thought of just using the number and suit for the Minor, I'd suggest having a look at the Crowley deck.\n\nGood luck with this. There are many, many variations. It takes a stout heart, I think, to wade in to a design with such a long history of different versions going back so many years.\n\n"
    },
    {
      "time": "5 Sep 2007 — 6:14am",
      "content": "Right now I'm just going to work with the Major Arcana (21 cards). Its too daunting to conceive of the others. I'm just focusing on one at a time. Although the minor cards could be just variations of one design or illustration.\n\nI'm not too big on Della Robbia I have to admit. Its difficult to convey the look I'm intending. I may be a hypocrite for saying this but maybe a serif that looks handwritten? I like to hear more suggestions though the feedback does help.\n\n"
    },
    {
      "time": "5 Sep 2007 — 7:29am",
      "content": "nice illustration! I would love to see a finished deck. One suggestion, try not to cut corners by just duplicating and flipping the wing.\n\nare you looking for these kind of fonts?  \n [image1](http://web.archive.org/web/20141018173239/http:/www.eosdev.com/Illustrations_Quotes/Cyndi/temperance.jpg) and [image2](http://web.archive.org/web/20141018173239/http:/www.tarot.org.il/Payen/14%20Temperance.png)?\n\n"
    },
    {
      "time": "5 Sep 2007 — 11:15am",
      "content": "Yeah the more I look at it the more I may actually illustrate the wings. I was thinking of using Mrs. Eaves as the typeface, however it may be a little too hackneyed. Any opinions on this?\n\n"
    },
    {
      "time": "5 Sep 2007 — 11:20am",
      "content": "How stereotypical do you want to be? I mean do you want \"historically cloying\" or something that might fit but have more of a twist? I think Mrs. Eaves would be a fine alternative, what about Dalliance?\n\n"
    },
    {
      "time": "5 Sep 2007 — 11:43am",
      "content": "This might be a nice place to use something with some menace or wildness. See ITC Golden Cockerel, or Storm's Aichel, Amor serif or Libcziowes, depending on the degree of menace desired.\n\n"
    },
    {
      "time": "5 Sep 2007 — 12:23pm",
      "content": "I want the cards to feel somewhat traditional but graphically contemporary. I obviously have darker sensibilities but I don't think it has to be menacing. I saw H.R. Giger's interpretation and its a bit too futurist for me.\n\nITC Golden Cockerel looks great but I think I sold myself on Mrs Eaves. I'm not sure I'm using the T and E ligature correctly.\n\n ![](http://web.archive.org/web/20141018173239im_/http:/typophile.com/files/temperance_3684.png)\n\n"
    },
    {
      "time": "5 Sep 2007 — 1:29pm",
      "content": "I wouldn't suggest using the TE ligature in that way. Readability is incredibly limited. I'd even avoid using that ligature unless all caps are being used and it is in the middle of a word where context would help.\n\n"
    },
    {
      "time": "5 Sep 2007 — 3:30pm",
      "content": "There, now there's no reason to use Mrs. Eaves. ;) Honestly I find Mrs. Eaves very trendy. There seem to be plenty of typefaces that will give the flavor you seek. Many from Storm.\n\n"
    },
    {
      "time": "5 Sep 2007 — 3:53pm",
      "content": "i agree with Carl, i don't think Mrs. Eaves is a good fit for the feeling of your illustrations. I think Storms work is more in line with the essence you have captured in your drawings (judging only from the one you have posted). Storms faces have subtlety and depth and a bit of piquancy, Mrs Eaves is too cute for this. But that could just be my opinion.\n\n"
    },
    {
      "time": "5 Sep 2007 — 4:04pm",
      "content": "Democratica. Looked mighty fine on the [Carnivale titles and Tarot deck](http://web.archive.org/web/20141018173239/http:/www.fontshop.be/details.php?entry=23).\n\n"
    },
    {
      "time": "5 Sep 2007 — 9:51pm",
      "content": " ![](http://web.archive.org/web/20141018173239im_/http:/typophile.com/files/temperance2_5749.jpg)\n\nI might be over-thinking it but I like Historical Allsorts – Fell Type Roman from Hoefler & Frere-Jones. Ok I agree Mrs. Eaves is a bit trendy but I liked the versatility of the face. I don't have any of the Storms so I can't test drive it.\n\nI love Democratica but I'm not sure I want to rip it. Yeah the Carnivalé intro was one of the inspirations.\n\nThe wings are just compiled in—I'll illustrate them shortly.\n\nThanks for all the comments its been extremely helpful. Anyone know where I can find a a good weathered background?\n\n"
    },
    {
      "time": "5 Sep 2007 — 4:18pm",
      "content": "Oh ok ok. I guess Mrs. Eaves might be a little bit \"been there, done that\". I just think someone has to be a champion for that poor typeface that really does get stick quite often. I think it is a pretty typeface that was just overused and now everyone now hates it.\n\nDemocratica looks very nice.\n\n"
    },
    {
      "time": "6 Sep 2007 — 9:08am",
      "content": "Try [Machine Washining'](http://web.archive.org/web/20141018173239/http:/www.misterretro.com/image_filters.html) em!\n\n"
    },
    {
      "time": "6 Sep 2007 — 12:14pm",
      "content": "Yeah, those are some nice filters! I have to remember that site. Unfortunately I'm on CS3 so I have to wait until they update before I can use them.\n\n"
    },
    {
      "time": "6 Sep 2007 — 5:00pm",
      "content": "If you're still looking, maybe try a more calligraphic face. Take a look at [PSY/OPS](http://web.archive.org/web/20141018173239/http:/www.psyops.com/html/specimens.html) fonts, especially Lars Bergquist's stuff. And also try Jos Buivenga's donationware fonts at [exljbris](http://web.archive.org/web/20141018173239/http:/www.josbuivenga.demon.nl/index.html).\n\n"
    }
  ]
}
