{
  "id": "36799",
  "title": "buying fonts to embed to templates for distribution",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I want to sell stationary templates which will have fonts embedded, but am struggling to find a font that allows this, as I will not be able to control the end number of users. Does anyone have a suggestion as to where I could buy a font for this use? Its only a small personal project of mine, so there is a very limited budget.\n\nThanking you in advance for any assistance offered.\n\n",
  "author": "mariebutson",
  "time": "5 Sep 2007 — 8:46am",
  "uid": "21426",
  "comments": [
    {
      "time": "5 Sep 2007 — 9:31am",
      "content": "(Limited Budget + Unlimited Number of Users) = Not gonna happen with any commercial font/foundry.\n\nAbout the only way you could pull this off is to commission a custom face/faces of your own, but that's gonna put you way over budget too.\n\nTry sticking to \"core\" fonts that ship with most/all computers these days (Times Roman, for example). Heck, even Apple only uses a dozen or so faces in their Keynote templates, and they've got deeper pockets than most.\n\n"
    },
    {
      "time": "7 Sep 2007 — 7:14am",
      "content": "Font embedding as defined in the OpenType and TrueType specs relates to embedding fonts in 'documents', I think font vendors might take the position that \"templates\" are not documents in this sense.\n\nIf you (or your attorney) can successfully argue that templates are 'documents' then you might look to 'editable' embedding fonts. Two big gotchas here, the only people who regularly set their fonts to editable are Microsoft and Adobe, second gotcha would be that most font EULAs wouldn't allow commercial redistribution.\n\nSo in my opinion embedding is a dead-end here, especially if it's a way to avoid paying licensing fees.\n\nYou might want to look at what Ascender did with their Creativity Font Pack where the fonts are bundled with templates.\n\n"
    }
  ]
}
