{
  "id": "36790",
  "title": "Advice on a lower case",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all. As I mentioned in a post in the General Discussions section, I've designed an upper case typeface as the first project of Kris Sowersby's pilot Typeface Design paper at Massey University. This was a 5 week project so it's not perfect, and we were required to only design glyphs A though Z and concern ourselves only with metrics to space the letters between HHxHHOOxOO, no kerning (big can of worms apparently!).\n\nThe second project is to design a lower case typeface, either based on our upper case or something entirely different. I want to base mine on my upper case, and am keen for some ideas from you guys on where I could go with it, example typefaces and the like. Any feedback on my upper case would be great too – I'm all for making more improvements.\n\nFor context: I really love Futura, but lately I have been getting used to softer typefaces with a similar feel like Myriad and even Avenir. So, with this project my aim was to create a 'softer Futura' in a way. I decided to create a heavy/bold weight with tight spacing to be used for headlines/display.\n\nThanks in advance!\n\n| Attachment | Size |\n| --- | --- |\n| [hand\\_in\\_specimen.pdf](http://web.archive.org/web/20150417042314/http:/typophile.com/files/hand_in_specimen.pdf) | 32.79 KB |\n\n",
  "author": "accidental",
  "time": "5 Sep 2007 — 12:24am",
  "uid": "21374",
  "comments": [
    {
      "time": "5 Sep 2007 — 9:27am",
      "content": "Well, the curves in the UC chars are quite humanistic I think, so something in the line of Myriad (or Frutiger) would probably be appropriate. A 'softer' Futura? A humanistic futura? :)\n\n"
    },
    {
      "time": "5 Sep 2007 — 2:53pm",
      "content": "Thanks Quincunx, Myriad and Frutiger are what I've been looking at basing it on – looks like I'm on the right track :) I'd like to see how well it goes with a little less stroke variation more like Futura, and perhaps implementing some of the character of Myriad's italic forms which I had very subtly put into my upper case (top of the B, P, R, D).\n\nAny other ideas? More obscure fonts that I could look at?\n\n"
    },
    {
      "time": "9 Sep 2007 — 7:30pm",
      "content": "Looks like you're on the right track.\n\n"
    },
    {
      "time": "9 Sep 2007 — 7:57pm",
      "content": "Cheers Robert. I'll be starting the lower case this Wednesday and get I hope to get some feedback from you guys along the way.\n\n"
    },
    {
      "time": "11 Sep 2007 — 5:51pm",
      "content": "I would love to see one with the x height of Avenir or even better Gotham. I'm not a big fan of the long ascenders and descenders in Avenir. Also I would love for someone to go out of the box on some of the characters like the lowercase a and g. Go in the direction of Avenir or Gotham rather than Univers on the lowercase u and I tend to prefer squares rather than dots on the i and j (see Gotham)\n\nI'm just talking about what I would like to see in a typeface like this and merely making suggestions;o)\n\nOn the Uppercase: This sort of Q tends to become really heavy at the bottom optically and could possibly be solved better. Again try something original after all you are competing with the likes of Adrian Frutiger and Tobias Frere Jones here;o) Make sure you have something different to offer.\n\nBest of luck and great job so far!\n\n"
    },
    {
      "time": "11 Sep 2007 — 6:26pm",
      "content": "Thanks Endre. I've just been looking around for some typefaces that match my intentions and did spot Gotham which I really like, so it's interesting that you also mentioned it. I'm looking forward to the LC, as Kris said it's tougher than UC but much more fun. I hope to inject a bit of character into it, especially looking at the 'a' and 'g' but I don't want to bite off more than I can chew for this 6 week, very part-time, project!\n\nRegarding the upper case, I just got my mark back from Kris. A+. I'm stoked!  \nHe's never mentioned the Q, but that I should slightly broaden the joins on the V, W, N & M.\n\n"
    },
    {
      "time": "11 Sep 2007 — 6:33pm",
      "content": "Congrats on your marks. Kris would not mark you down on the Q because there is nothing wrong with it. This is the way they were drawn back in the days. I'm purely talking about the next step in evolution if you know what I mean;-)\n\nI'm with Chris on his comments about the other characters though!\n\nYou should really not leave it as a part time project but continue on your own and develop this into a full face. If you make the changes before mentioned and ads some flare to it the face has great potential and I'm sure there are several designers out there who would love to see such a face.\n\n"
    },
    {
      "time": "22 Oct 2007 — 8:57pm",
      "content": "I've finished and handed in the lower-case part of the project. Here's a PDF for your interest:  \nI really like how it's shaped up.\n\n[http://www.accidentaldesign.co.nz/LC-Template.pdf](http://web.archive.org/web/20150417042314/http:/www.accidentaldesign.co.nz/LC-Template.pdf \"http://www.accidentaldesign.co.nz/LC-Template.pdf\")\n\n ![](http://web.archive.org/web/20150417042314im_/http:/typophile.com/files/LC-eg1_4163.jpg)\n\n"
    },
    {
      "time": "25 Oct 2007 — 10:14am",
      "content": "I like what you've done with your typeface. To my point of view there is one thing to fix is the tail or the end of those four letters : f, t, j an l. They seem to be not on the same typeface. I'd suggest to start with the f to adapt the curve to other three letters. Also, the S don't really match the lc s. Keep going your good work.\n\n"
    }
  ]
}
