{
  "id": "36802",
  "title": "calligraphy for left-handed",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi, I have a question..did anyone try to learn calligraphy using left hand?\n\n",
  "author": "martina",
  "time": "5 Sep 2007 — 9:27am",
  "uid": "21431",
  "comments": [
    {
      "time": "5 Sep 2007 — 9:45am",
      "content": "It it possible. You just need to (re-)learn writing with the paper in a different angle.  \nSee this movie: [http://youtube.com/watch?v=ga3u9XvCLJc](http://web.archive.org/web/20131011165822/http:/youtube.com/watch?v=ga3u9XvCLJc \"http://youtube.com/watch?v=ga3u9XvCLJc\")\n\nWhen I was in a calligraphy workshop I simply made all the strokes from the end to the beginning, for example the i from the bottom to the top.\n\nRalf\n\n"
    },
    {
      "time": "5 Sep 2007 — 6:56pm",
      "content": "You can also get a special oblique nib which is supposed to ease left-handed calligraphy.\n\nNever tried it myself, though.\n\n"
    },
    {
      "time": "6 Sep 2007 — 11:58am",
      "content": "I did, but it was 'grade school calligraphy' for what it's worth. Which is basically simple black lettering. The only difference to me was not resting my hand on the page.\n\n"
    },
    {
      "time": "6 Sep 2007 — 2:41pm",
      "content": "I was going to link to the same video as Ralf did. That one shows a very good left-handed calligrapher.\n\n"
    },
    {
      "time": "7 Sep 2007 — 2:12am",
      "content": "Wow. I'm left-handed and my attempts at calligraphy were always pretty atrocious, even with the oblique nib. Seems like John DeCollibus in that video has an extra attachment to hold the nib at a different angle, as well as the rotated page. Oh, and ability, too. LOL.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "7 Sep 2007 — 8:50am",
      "content": "Learn Arabic and show up all of us right-handed folk? (I wonder though, are Arabic/Hebrew-script users majority left-handed?)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
