{
  "id": "36807",
  "title": "\"Fatty\" Nano iPod goes to Helv, too?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Out with the Myriad/Podium Sans UI font and in with the Helvetica? Just like the iPhone...\n\n[http://www.engadget.com/2007/09/05/steve-jobs-live-apples-the-beat-goes-...](http://web.archive.org/web/20131021234746/http:/www.engadget.com/2007/09/05/steve-jobs-live-apples-the-beat-goes-on-special-event/ \"http://www.engadget.com/2007/09/05/steve-jobs-live-apples-the-beat-goes-on-special-event/\")\n\n",
  "author": "Si_Daniels",
  "time": "5 Sep 2007 — 10:29am",
  "uid": "1049",
  "comments": [
    {
      "time": "5 Sep 2007 — 11:33am",
      "content": "Nano 911 :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Sep 2007 — 12:11pm",
      "content": "I don't understand why they spend so much time developing the ipod into a teeny tiny TV.\n\n"
    },
    {
      "time": "5 Sep 2007 — 1:30pm",
      "content": "Because someone will buy it.\n\n"
    },
    {
      "time": "5 Sep 2007 — 2:01pm",
      "content": "I would guess that most current iPod purchasers are not first time iPod customers, or switchers from other MP3 players, but are upgrading their second or third iPod. Apple has to re-invent the platform to entice upgraders by adding features people will find compelling - “people like TV, Web Browsing and paying $5 for a coffee so let’s add those features to the new devices.” ;-)\n\n"
    },
    {
      "time": "5 Sep 2007 — 2:45pm",
      "content": "I like Helvetica! but it would have been cool in Akzidenz, which has awesome [figures](http://web.archive.org/web/20131021234746/http:/www.spiekermann.com/mt/images/iphone_braun.jpg)\n\n"
    },
    {
      "time": "5 Sep 2007 — 2:46pm",
      "content": "<cite>I don’t understand why they spend so much time developing the ipod into a teeny tiny TV.</cite>\n\nIt’s also a tiny digital video player that can output to a big TV. Comes in handy when vacationing in places that the TV sucks.\n\n"
    },
    {
      "time": "5 Sep 2007 — 3:42pm",
      "content": "\\>I like Helvetica! but it would have been cool in Akzidenz, which has awesome figures\n\nI'm kind of assuming that the new iPod UI uses TrueType like the iPhone and the Zune, so maybe the iTunes store will provide fonts as well as ring-tones and episodes of Lost? If not I'm sure the font hacks will be on their way soon.\n\n"
    },
    {
      "time": "5 Sep 2007 — 8:33pm",
      "content": "Maybe this time they'll include an Arabic font so I don't have to browse a few albums worth of song titles that are just a bunch of spaces =\\\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "5 Sep 2007 — 10:21pm",
      "content": "_Just like the iPhone..._\n\nA co-worker says that the new touch iPod is an iPhone without the phone... I think that's pretty accurate!\n\n"
    },
    {
      "time": "6 Sep 2007 — 6:29am",
      "content": "\"It’s also a tiny digital video player that can output to a big TV.\"\n\nNot to mention games! ;o)\n\nIf only I had a long enough bus commute to warrant getting one of these...\n\n\"A co-worker says that the new touch iPod is an iPhone without the phone... I think that’s pretty accurate!\"\n\nYea. I'm bummed that they put that interface on the 160gb iPod rather than the 160gb one.\n\n"
    },
    {
      "time": "6 Sep 2007 — 2:14pm",
      "content": "_the new touch iPod is an iPhone without the phone_\n\nAnd without a camera, Bluetooth, local clientside email functions, and special map functions. But even a sans-a-Phone iPod looks pretty snazzy, even with Helvetica.\n\n"
    },
    {
      "time": "6 Sep 2007 — 2:39pm",
      "content": "I think that new Nano looks stupid.\n\n"
    },
    {
      "time": "6 Sep 2007 — 10:19pm",
      "content": "<cite>And without a camera, Bluetooth, local clientside email functions, and special map functions.</cite>  \n...and without AT&T :-)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "7 Sep 2007 — 3:17am",
      "content": "The new nano looks like a klondike bar and those colors are absolutely awful. The people at Pantone are probably rolling their eyes. They should have put that 160gb hard drive inside the Touch so there would be a reason to buy it. You can only access the internet when you're near a computer or a wifi network. But what about when I look up stuff when I'm driving? Can't. That's for the iphone. Poor execution on Steve's part. As it stands, I'm waiting for the iphone to have bluetooth, real GPS, 3g, tmobile, take video, and be about $200. In the mean time I'll wait.\n\n"
    },
    {
      "time": "7 Sep 2007 — 3:20am",
      "content": "and another thing they need to make their screens 16:9 compatible. HD is the future. Square is, well.... square.\n\nMike Diaz\n\n"
    },
    {
      "time": "7 Sep 2007 — 5:29am",
      "content": "I want an iThing with 5 Terrabytes and worldwide wireless reception underwater and a microwave oven with color that adapts to what I'm thinking and every song ever recorded built in and I won't pay over $50. How dare Apple not offer this!\n\n"
    },
    {
      "time": "7 Sep 2007 — 6:36am",
      "content": "\\>But what about when I look up stuff when I’m driving? Can’t.\n\nProbably a good thing.\n\nTim\n\n"
    },
    {
      "time": "7 Sep 2007 — 7:32am",
      "content": "Rich,  \nI have one of those, it is over rated. The microwave only works on vitamin pills :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2007 — 7:35am",
      "content": "<cite>...and without AT&amp;T :-)</cite>\n\nExactly! I want one of those new iPod Touch things and bad! Gotta start saving the pennies.\n\nAgree the new Nano is kind of ugly.\n\n"
    },
    {
      "time": "7 Sep 2007 — 9:48am",
      "content": "_only works on vitamin pills :-)_\n\nIn the future when we all drive hover cars and dress in matching silver jump suits, Soylent based vitamins will be all the sustenance we need...mmm Soylent\n\n"
    },
    {
      "time": "7 Sep 2007 — 10:23am",
      "content": "Soylent Green, Dude!\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2007 — 10:36am",
      "content": "I must say that I have definately had enough of this glossy, transparant Web 2.0 styling... Windows Vista would be a nice moment for Apple or anyone else to introduce Web 3.0... Away with the kitsch fake transparency! Enter the classical serif typeface in high resoltution! Enter a wide variety of webfonts! Enter golden section layouts and non techno colours!  \nNo iPhone for me I guess... :\\>P\n\ncheerio Queneau\n\n"
    },
    {
      "time": "7 Sep 2007 — 11:02am",
      "content": "Here's something to really bash, typographers. Has anyone seen the giant posters for the new Sony Reader? Times New Roman circa 1986, inkjet-style and horribly spaced. Nice blue-gray background. Yeah, I want to read books on that thing.\n\n"
    },
    {
      "time": "7 Sep 2007 — 11:13am",
      "content": "Type on the Sony Reader... [http://typophile.com/node/29470](http://web.archive.org/web/20131021234746/http:/typophile.com/node/29470 \"http://typophile.com/node/29470\")\n\nI've not seen the posters, but maybe in advertising they have to use type that matches the device, in exactly the same was Apple didn't with Myriad and the iPod.\n\n"
    },
    {
      "time": "7 Sep 2007 — 11:42am",
      "content": "Thanks, Si, that's the thread I should be on with my comments about the reader. Barf.\n\nHowever, it provides a useful comparison with the iPod text. We may bitch about the presence of Helvetica, but the quality of text on this high-res monitor is much more acceptable.\n\nAt some point, probably within 2 years, Apple will offer a larger device that's more of a reader/PDA/touchscreen multi-purpose device. That's what the iPhone is a prototype for. At that point, they'll offer books for download. And I imagine they'll look quite good on a 200-ppi display.\n\n"
    },
    {
      "time": "7 Sep 2007 — 12:07pm",
      "content": "It would be interesting if Apple were to get into eBooks using this type of device and the iTunes store to deliver the DRM'd content. I'd love to agree with you that they'll go that way, but I'm not convinced books are considered cool enough. I wonder if they are looking beyond the browser with its PDF style pan, scan and zoom interface to a page based interface, like the NYT Reader. Also although it’s great to see all those Microsoft, Linotype and Monotype fonts on the iPhone I would have thought if eBooks were on their radar they’d be investing in screen type, and revisiting their rendering philosophy – I suppose they still have time to go there, but my magic 8-ball says ‘signs point to no.’ I guess we'll have to wait and see.\n\n"
    },
    {
      "time": "7 Sep 2007 — 12:04pm",
      "content": "I meant to say I can't look up stuff while I'm on the go... yes driving and iPhoning is an accident waiting to happen.\n\nMikey :-)\n\n"
    },
    {
      "time": "7 Sep 2007 — 12:12pm",
      "content": "Books are kinda perfect as they are. They fit in your bag, are easy on your eyes, and no biggie if you spill a little water or coffee on them. I don't think they need much improving.\n\nI get the argument that a device that weighs less than a book can hold a whole bunch of books and it will certainly save some trees, but do you really want to bring it to the beach? Or give it to a friend when you're done.\n\nThis is of course from a gal who makes her living in publishing...\n\nand who has no desire to watch a movie on something smaller than a pack of cigarettes...\n\nbut would love to check her email on the fly without spending $20/month on a blackberry (hence my lust for the iPod touch).\n\n"
    },
    {
      "time": "7 Sep 2007 — 12:18pm",
      "content": "But their screen rendering philosophy is changing in a couple months with the next OS release: resolution-independent type. That alone calms most of the complaints about Apple's \"blurry\" type. Apple's type is only blurry when it's scaled outside of native resolution. Then add more than double the current standard resolution, plus their propensity for highly esthetic templates (Pages, Keynote).... There is more than one way to solve the problem you are describing.\n\n"
    },
    {
      "time": "7 Sep 2007 — 12:23pm",
      "content": "I wonder if books fit with the iTunes model - 99 cents a chapter anyone? ;-)\n\nSure the tecnhincal issues can all be solved, but the 'problem' is that books are dull, and movies and music are cool. If anyone can make books cool, it's Apple, I guess.\n\n"
    },
    {
      "time": "7 Sep 2007 — 12:54pm",
      "content": "Books are PLENTY cool as is. I never had to reboot one yet :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2007 — 3:48pm",
      "content": "\\> _Books are kinda perfect as they are. They fit in your bag, are easy on your eyes, and no biggie if you spill a little water or coffee on them. I don’t think they need much improving._\n\nAgreed. Books are fine. They also don't need batteries.\n\n"
    },
    {
      "time": "7 Sep 2007 — 6:04pm",
      "content": "_But their screen rendering philosophy is changing in a couple months with the next OS release: resolution-independent type._\n\nActually, in this respect, Tiger already has it. You can turn on resolution independence in Tiger but type is about the only thing that scales cleanly. This picture shows Safari running at 144, with the UI Rez window running at 72. [http://media.arstechnica.com/images/tiger/safari-scaled-2x-big.jpg](http://web.archive.org/web/20131021234746/http:/media.arstechnica.com/images/tiger/safari-scaled-2x-big.jpg \"http://media.arstechnica.com/images/tiger/safari-scaled-2x-big.jpg\")\n\nApple DOES have a new type technology, although in part it could just be a rebranding of existing technology. However, I don't have a beta of Leopard, and so beyond knowing of CoreText via random clues on Apple's site, I don't have a clue exactly what it is (I joined the Apple mailing list for it, but there haven't been any posts at all). Maybe they'll be supporting more OT features, but until it's released I'd imagine only the Adobe folks on the forum here would know, and they can't say anything about it. Given what CoreAnimation, CoreImage, CoreAudio, etc, brought to earlier versions, decent speculation could be made.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "7 Sep 2007 — 8:55pm",
      "content": "<cite>the ’problem’ is that books are dull, and movies and music are cool.</cite>\n\nI so hope you're joking.\n\n"
    },
    {
      "time": "8 Sep 2007 — 12:12am",
      "content": "Matthew thank for the info!!!\n\n"
    },
    {
      "time": "8 Sep 2007 — 5:04am",
      "content": "_Books are PLENTY cool as is. I never had to reboot one yet :-)_\n\nThey are, can be a bit bulky though - and of course we should consider the trees.\n\n"
    },
    {
      "time": "8 Sep 2007 — 6:27am",
      "content": "Books are not as bulky as computers and there is a fair amount of resources going into making them and all their periferal stuff :-)\n\nChrisL\n\n"
    },
    {
      "time": "8 Sep 2007 — 8:50am",
      "content": "_They are, can be a bit bulky though - and of course we should consider the trees._\n\nWe should also consider all of the electricity (i.e., in many cases generated by carbon) that computers use, all of the growing piles of non-biodegradable obsolete gadgets, all of the discarded old computers and printers, all of the used toner cartridges, all of the dumped, non-rechargable batteries, all of the non-recyclable plastic used for those gadgets.\n\n"
    },
    {
      "time": "8 Sep 2007 — 8:52am",
      "content": "\"goes to Helv\"\n\ncan i get that on a tshirt?  \ngo to Helv!\n\n"
    },
    {
      "time": "8 Sep 2007 — 8:53am",
      "content": "In that case, I want a t-shirt that says \"FONT YOU!,\" as someone said in another post. :-)\n\n"
    },
    {
      "time": "8 Sep 2007 — 8:57am",
      "content": "For sure, here's a t-shirt idea for when Helvetica drops off of Linotype's best seller list...\n\n\"Helv freezes over\"\n\nI doubt it will ever be made though. And one for the press release announcing a Helvetica line of picnic ware...\n\n\"Linotype, Going to Helv in a hand basket\"\n\nCheers, Si\n\n"
    },
    {
      "time": "8 Sep 2007 — 11:07am",
      "content": "Ricardo: You are so right about those computers and parts. I think the software developers also need to think about this, since they are the biggest reason for everyone throwing out 2 year old computers. No new software that requires new faster computers, no need to buy new computers either.\n\nI'd like a shirt with helvsinki, I'm so bored with all the hellsinki shirts...\n\n"
    },
    {
      "time": "8 Sep 2007 — 1:23pm",
      "content": "Copper, I agree, the Hellsinki joke's gone too far. Give me Helsinski (with Russian flavor) or Helvsinki t-shirt any day.\n\n"
    },
    {
      "time": "8 Sep 2007 — 1:29pm",
      "content": "_Ricardo: You are so right about those computers and parts._\n\nThanks, copper.\n\n_I think the software developers also need to think about this, since they are the biggest reason for everyone throwing out 2 year old computers._\n\nWhen you start to look at the big picture -- the consequences that our way of life, work, production, etc., have on the planet -- it's a little daunting. But if we don't look at the big picture and take some serious steps to reverse the damage we have been inflicting on natural resources, wildlife, forests, etc., then we stand a good chance of causing our own extinction, and taking a lot of plant and animal species out with us. So much for our supposed intelligence.\n\n"
    }
  ]
}
