{
  "id": "36815",
  "title": "ATypI 2007 Brighton Tribe Gathering",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "As I announced in the [“OK. TypeCon’s over for now. Who’s going to ATypI?”](http://web.archive.org/web/20081202183536/http:/typophile.com/node/36064) thread, I (we?) will be organizing a Typophile Meet’n’Greet in Brighton. This as a reaction to the recurring complaints after every conference that fellow Typophiles didn’t get the chance to meet, often because they even didn’t know they were there.\n\nI propose that the gathering takes place on Friday night after the ATypI Auction which starts at 18h45. I don’t know yet where we’ll have it, especially since I haven’t got a clue how many will want to join us. Maybe it would be an idea to have some registration. What does everyone think?\n\n [‹ If I dood it...](http://web.archive.org/web/20081202183536/http:/www.typophile.com/node/37234 \"Go to previous forum topic\") [WHAT THE FONT??? ›](http://web.archive.org/web/20081202183536/http:/www.typophile.com/node/37227 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202183536/http://www.typophile.com/user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": "<br>",
  "uid": "110",
  "comments": [
    {
      "time": " 5.Sep.2007 3.11pm",
      "content": "Sounds about right. I’m just a [newbie](http://web.archive.org/web/20081202183536/http:/typophile.com/user/8976) on Typophile but I’ll try to be there.\n\n"
    },
    {
      "time": " 5.Sep.2007 5.53pm",
      "content": "Sounds good to me. I intend to be there!\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 5.Sep.2007 6.11pm",
      "content": "Me too!!\n\n"
    },
    {
      "time": " 5.Sep.2007 7.02pm",
      "content": "And I’ll add it should be at the official Typophile house!\n\n"
    },
    {
      "time": " 6.Sep.2007 12.54am",
      "content": "Great! I’d love to meet you people … :°)\n\n"
    },
    {
      "time": " 6.Sep.2007 1.39am",
      "content": "Wherever it is, I’m game!\n\nOfficial Typophile house? What is that?\n\n"
    },
    {
      "time": " 6.Sep.2007 1.46am",
      "content": "I would gladly join, but House o’Type is in the ’burbs, no? Please tell me it’s not too far away.\n\n"
    },
    {
      "time": " 6.Sep.2007 2.23am",
      "content": "Count me in.\n\nAnd Angel71, if you’re there be careful you don’t have a nasty accident on the way back to your digs :^}\n\nNick Cooke\n\n"
    },
    {
      "time": " 6.Sep.2007 4.29am",
      "content": "Oh yes, great, 2 more people (me and probably my fellow typophile colleague) looking forward to meeting you all :-)\n\n"
    },
    {
      "time": " 6.Sep.2007 5.45am",
      "content": "If I can, I will. I am driving home each evening to be with my new twin sons!  \nBut will no doubt bump into some of you throughout the conference.\n\n"
    },
    {
      "time": " 6.Sep.2007 7.22am",
      "content": "I’ll be coming to ATypI... haven’t been on here for awhile now but would love to meet up with you guys!\n\n"
    },
    {
      "time": " 6.Sep.2007 10.27am",
      "content": "Hey, Keith, long time no see indeed! Great to hear you’ll be joining us. :^)\n\nFredrik, you are correct. The official Typophile House is in the ’burbs — that’s why i was hesitant to offer holding the meeting there. Maybe it’s better to pick some pub. Maybe we can even arrange something with some local venue. What does everybody think?\n\n"
    },
    {
      "time": " 6.Sep.2007 10.47am",
      "content": "No bike, no car, no skaters with me … so, anything nearby highly appreciated. :°)\n\n"
    },
    {
      "time": " 6.Sep.2007 10.47am",
      "content": "Hm, just read this in the description: “Parking for up to four cars. The house is used regularly for large house-parties.”\n\n"
    },
    {
      "time": " 6.Sep.2007 12.22pm",
      "content": "Wish I could join you all there. Make sure to take some good pics.\n\n"
    },
    {
      "time": " 6.Sep.2007 1.57pm",
      "content": "The SOTA/Typophile house is on the busline and there is an undercliff walk between there and Brighton that looks amazing from pictures. There are also cabs o’plenty. Once we all get to Brighton, we’ll sort out the best place to have the Typophile gathering. I’m hoping there will be a central place at ATypI where people can post notices, but that’s not always the case. We’ll post details here once we know them. We can also put up a flyer and sign-up list in the SOTA TypeGallery for those who might not have net access in Brighton.\n\n"
    },
    {
      "time": " 6.Sep.2007 1.58pm",
      "content": "My bad all. We really need to have this party in town, so-to-speak, where we can all meet-up. There must be something in town that we can just take over after the auction.\n\n"
    },
    {
      "time": " 6.Sep.2007 2.38pm",
      "content": "Lissenup, I’m going to talk ATypI into allowing us to have a sign-up list at the registration desk. That way we’ll be able to predict the number of people a little beforehand, so we can adequately chose where to go. I’ll try to whup up some posters.\n\n"
    },
    {
      "time": " 6.Sep.2007 2.41pm",
      "content": "\\> _Great! I’d love to meet you people …_ :°)\n\nBrace yourself — we’re all gonna look and sound a lot different than you imagined, and that goes for everyone. ;^)\n\n"
    },
    {
      "time": " 6.Sep.2007 5.53pm",
      "content": "Are we allowed to vote someone off the island?\n\n"
    },
    {
      "time": " 9.Sep.2007 7.44pm",
      "content": "Of course! Anyone who is excessively (fill in nasty descriptive here).....\n\n;-)\n\n"
    },
    {
      "time": " 12.Sep.2007 1.57pm",
      "content": "I can’t get to the conference, but I’ll get to this.\n\n"
    },
    {
      "time": " 14.Sep.2007 2.15am",
      "content": "Remember everyone it’s tonight! For those not attending the conference, maybe try to be at the main entrance of the University of Brighton, Faculty of Arts & Architecture somewhere between 8 pm and 8:30 pm. I hope the auction will be over by then.\n\nAs there is no formal organization for this gathering, we’ll need to find a place. Any and all suggestions are welcome.\n\n"
    },
    {
      "time": " 14.Sep.2007 8.21am",
      "content": "I’ve heard Saltdean tavern is a good spot ;-)\n\n"
    },
    {
      "time": " 14.Sep.2007 9.49am",
      "content": "The auction has been cancelled due to lack of items. We’re trying to work out a system to let any stragglers know where we’ll be. Look for a notice at the main entrance of the University of Brighton (alternatively I’ll just be waiting for any stragglers at the door).\n\n"
    },
    {
      "time": " 15.Sep.2007 4.46am",
      "content": " ![](http://web.archive.org/web/20081202183536im_/http:/www.typophile.com/files/DSC00041_6573.jpg)\n\nFirst Pic from the meet-up\n\n"
    },
    {
      "time": " 15.Sep.2007 4.48am",
      "content": " ![](http://web.archive.org/web/20081202183536im_/http:/www.typophile.com/files/DSC00042_3415.jpg)\n\nAnd another\n\n"
    },
    {
      "time": " 15.Sep.2007 5.00am",
      "content": "And the rest... [http://www.flickr.com/groups/35518853@N00/](http://web.archive.org/web/20081202183536/http:/www.flickr.com/groups/35518853@N00/ \"http://www.flickr.com/groups/35518853@N00/\")\n\n"
    },
    {
      "time": " 18.Sep.2007 3.10pm",
      "content": "Can the peeps at the meeting ID themselves?\n\n[http://www.flickr.com/photos/9495853@N08/1385557283/in/set-7215760202843...](http://web.archive.org/web/20081202183536/http:/www.flickr.com/photos/9495853@N08/1385557283/in/set-72157602028435379/ \"http://www.flickr.com/photos/9495853@N08/1385557283/in/set-72157602028435379/\")\n\nCheers, Si\n\n"
    }
  ]
}
