{
  "id": "36822",
  "title": "Golden Section and page layout",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "G'day peeps,\n\nI'm new to page design and layout and I'm looking for a few pointers on laying out the grid (especially for books). When I read advice on page layout, the golden section is frequently mentioned in reference to the size of the text block on the page; but I've just tried this and there seems like a lot of space around the text (as in too much, especially the bottom margin) and I'm concious that I don't come across many books which reflect this process; does anyone actually use the golden section for book design? Are people using a tweaked version based on similar principles?\n\nI feel like the GS would work well for art books and books with lots of marginal notes but it seems very excessive for a paperback or a cheap short-run A5 lecture series (just ... you know, like for example :) So what do you use? Also, do you have systems for deciding where to put the page numbers/running heads?  \nthanks for any trouble\n\nNick\n\n",
  "author": "nicholasgross",
  "time": "5 Sep 2007 — 8:01pm",
  "uid": "9500",
  "comments": [
    {
      "time": "5 Sep 2007 — 9:52pm",
      "content": "Do whatever looks best. This topic comes up here at Typophile from time to time, but I've been designing art books for over 20 years and have never (consciously) used the GS or any tweaked version, nor was I ever taught to.\n\n"
    },
    {
      "time": "5 Sep 2007 — 10:20pm",
      "content": "Think with the whole body and soul.\n\nHi Nicholas  \nForget about grids first... design the layout first add the grids and alter it when you have the best design down.  \nThe best way of designing is taking 3 spreads of the book. eg: title spread/content, 2 typical spread. Try different layouts and type treatmetns. Be creative and yet functional expecially the polios. But before you start, look at other best design samples and see that you are most imspired, be influence and then create your own layout... the best design is when you create you know in your heart you have a winner! Good Luck!\n\nAD Shamiko\n\n"
    },
    {
      "time": "5 Sep 2007 — 10:39pm",
      "content": "Ah, I was hoping for a bit of Patty! thanks. I did look for stuff on the GS on the forums as related to page layout, but perhaps I wasn't looking hard enough.\n\nYes, as you (and Shamiko, thanks) can probably guess, I've been doing what I think/feel looks OK and that seems to go OK, but I do feel from time to time a bit like I'm designing in a bubble so I'm interested in finding out any systems people had for resolving this and especially theory as it relates to the GS. It seems so intersting and how cool is it to say you design using a secret formula but in practice it's a bit hard to see how it could be applied usefully.\n\n--N\n\n"
    },
    {
      "time": "6 Sep 2007 — 12:25am",
      "content": "If you can get familiar enough with the information the content will lend itself to a grid automatically.\n\n"
    },
    {
      "time": "6 Sep 2007 — 6:38am",
      "content": "Here is a nice example of a mathematically perfect type area according to the golden section as used in old books:\n\n[http://www.sanskritweb.net/temporary/golden.jpg](http://web.archive.org/web/20130102012133/http:/www.sanskritweb.net/temporary/golden.jpg \"http://www.sanskritweb.net/temporary/golden.jpg\")\n\nExample: If the vertical height (or depth) of the type area on the right-hand page is measured from the first top-right word \"autem\" to the bottom-right catchword \"mente\", and if the resulting measured height is divided by 1.618, you will get the mathematically exact line width. Contrariwise, if you measure the line-width of e.g. the first line on the left-hand type-area (i.e. \"ptis ... iudica-\") and multiply the resulting measured width by 1.618, you will get the mathematically exact height (or depth) of type-area (from top-right \"iudica-\" down to bottom-right catchword \"In-\"). Note that the catchword is included into the type-area of old books.\n\n"
    },
    {
      "time": "6 Sep 2007 — 8:32am",
      "content": "Keep in mind that if you're designing a book that will be perfect bound and won't open flat, you'll lose quite a bit of page space in the gutter. That has to be taken into account in designing a layout and grid. Also, in a book with a reasonable page count, the pages \"feather\" on the outside, making it look as though the outside margins are wider.\n\n"
    },
    {
      "time": "6 Sep 2007 — 9:27am",
      "content": "I was lucky enough to learn how to design books before the computer (and equally lucky to have the computer come along when it did!) and back in the day we actually drew up the grid and moved the elements around by hand before we settled on a look we liked. I learned to try to \"see\" the page before I started.\n\nFor text-only books it's often driven in part by the cast-off. Once I choose my font and leading, then I do a cast-off (number of words in the document divided by page count) to determine how many words per page. Then I set up my margins in order to achieve that. Whether you give it more space on the top or on the sides is a matter of choice.\n\nArt/illustrated books present more of a challenge. Some books call for (or have room for) a more open design, some call for a flexible design where you can accommodate lots of different page-layout options. I'm working right now on a photography book where the pictures are very formal and have a strong horizon (landscape photos). I chose to lay out the text pages with a low sink so that the page has a \"horizon\" as well. I want the text design to take a back seat to the pix so I'm keeping it really clean.\n\nSometimes you want a varied, dynamic, asymmetrical page. I've done cookbooks and interior design books that have sidebars, notes, different types of text, large and small pix where I would do a two or three column design that can work these various elements in.\n\nBut again, it helps to try to visualize the look of the book before you start or your head can start to spin with all the different options. I have never even considered the \"golden section\" in any of my book designs.\n\n"
    },
    {
      "time": "6 Sep 2007 — 10:36am",
      "content": "As Patty and others have indicated, the Golden Section is not always that useful for today's books. I've never found the oft-cited formula, à la Tschichold et al., applicable. Publishers find those margins excessive and wasteful these days. Plus, there are too many other parameters either predetermined or otherwise constrained.\n\nThat said, I have on occasion made use of the 1.618 proportion. It's pleasing, and when it works, great.\n\nMore important is the concept of Proportion in general (of which the Tschichold diagram is but one example). Deliberate and pleasing relationships between trim size, margins & text block, type size & leading, location of running heads & folios, etc. These are all important and work together to create a whole.\n\nOne important thing that you need to keep in mind is that a book is a three-dimensional thing. Gary mentions one aspect, which is that there is a very real consideration for the inside gutter depending upon binding method (and even different binderies). Whenever possible, take your sample pages, trim them up and stick them inside a dummy book. If you can't get a blank bound dummy with the same dimensions, page length, and stock as your final will be, then try to find a published book with specs as close as you can, and stick your pages in that.\n\nSomething unique happens to a design when it curves into a binding and you perceive it in the context of a book's dimensional form in space with thickness and volume. I frequently mock up several pages and put them into a dummy in sequence, so I can get a proper perception of pacing. This is particularly useful with the front matter, since pacing is most evident in the beginning sequence.\n\nHope this is useful.\n\n-- K.\n\n"
    },
    {
      "time": "6 Sep 2007 — 10:43am",
      "content": "Kent speaks the truth - you really won't know how your book will look when you just see it on the screen. And beware the gutter. One of the first books I ever designed was on the making of Gone with the Wind, and I had a lovely double-page spread of Rhett and Scarlett kissing - right in the gutter. It also drives me crazy if I have to crack the binding in order to read all the text easily.\n\n"
    },
    {
      "time": "6 Sep 2007 — 11:29am",
      "content": "When photos or maps span a spread in a perfect bound book, layout can be particularly tricky to avoid having part of the graphic hidden in the gutter. What I do in cases like this is create left and right \"halves\" of the graphic, actually more than halves, because I make some overlap in the middle, sufficient that when the book is bound, the graphic seems visually complete. It's not a perfect adjustment, but if you get it right, it comes close to appearing a single uninterrupted image. As Kent mentions, nothing beats experimenting with a bound book (dummy or real), taking into account the location in the book (front, middle, end).\n\n"
    },
    {
      "time": "6 Sep 2007 — 5:04pm",
      "content": "hey thanks guys, this is really useful stuff \\*makes mental note to start compiling an advice text-file\\*.\n\n<cite> If you can get familiar enough with the information the content will lend itself to a grid automatically. </cite> good point, totally agree, but the spectre of budget is always hanging over my head in this small pub. company, I would love to let content determine layout but often it's a cost thing. for example I would love to employ generous margins on more text-booky works to use it for photos and call-outs but while it obviously looks better and works better it does feel a bit luxurious -- that said I haven't ever tried it on to see how it goes down...\n\nGenerally I do allow for a generous gutter and have never had problems but I've never tried a double-page photo spread, so Gary, your trick is worth remembering. I've read that your outside margin should be the same size as your gutter\n\nInteresting Patty, that you know your page count before you begin laying up the text, who decides this? Wouldn't this force your hand in terms of deciding your margins? Oh BTW I dream of laying out a cookbook :) I love a well-designed cookbook\n\nHey Uli, that's really cool stuff! I like that the golden section is used but in an internal way, it really is pleasant to look at and the margins here do not seem excessive. On a side point, interesting to note as many as four hyphens in a row and that the show through is inconsistent (unless that's a printing rather than a setting issue)\n\nI prob. would use the dummy on more complicated layouts, I think fairly simple book settings of one text block per page are probably OK to be resolved on screen or with print-outs. On another side point, as horribly ugly as it would be, as a reader I would love to see spiral bound bindings for everything, my kingdom for books that lie flat and don't need hands or mobile phones or shoes to keep them open...\n\nthanks everybody again so much for the advice\n\n"
    },
    {
      "time": "6 Sep 2007 — 5:07pm",
      "content": "\\*As I re-read my post\\* Apologies for my regular abbreviations and lack of capitalisation ... I know that really annoys some folks.\n\n"
    },
    {
      "time": "6 Sep 2007 — 8:35pm",
      "content": "I'm usually given a page count by the publisher.\n\n"
    },
    {
      "time": "7 Sep 2007 — 7:36am",
      "content": "\\> Also, in a book with a reasonable page count, the pages “feather” on the outside, making it look as though the outside margins are wider.\n\nIf they do, then a prepress person should be fired. On a sewn book, this is not a problem, as the folios are usually 16 or 32 pages and very little creep will happen. On a saddle stitched book of 120 or so pages, then this is a major issue, as the outside pages will have to wrap around the thickness of the spine, while the inside ones will not. But this is usually compensated for in prepress.\n\n"
    },
    {
      "time": "7 Sep 2007 — 7:45am",
      "content": "<cite> But this is usually compensated for in prepress. </cite>\n\nBe interested to know how the 'creep' is accounted for. I remember a few journals I've got back where some coloured tabs I'd put bleeding on the outside margin were different sizes. I assume you enter the weight of the paper, paper size and page number and the pre-press program adjusts the placement automatically, perhaps it's very difficult to get this right.\n\n"
    }
  ]
}
