{
  "id": "36826",
  "title": "How do I make Illustrator CS3 outline stroke not suck?",
  "forum": "Build",
  "tags": [

  ],
  "content": "When I outline a stroke in Illustrator CS3, it creates two stacked points for every one it should create, one controlled by the incoming handle and one controlled by the outgoing handle. This make editing the curves a nightmare. Does anyone know of a workaround?\n\n",
  "author": "<a href=\"/web/20120312002058/http://typophile.com/user/14722\" title=\"View user profile.\">---</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": "",
      "content": "Late reply, but I have this same problem. Have you already found a sulution? Because this way it is impossible to draw in Illustrator,  \nit becomes totally useless.\n\n"
    },
    {
      "time": "",
      "content": "Don't know if this works but it's worth a shot. So here is the idea though it may take a little time for each point.\n\nMove one of the points up by the arrow key. Delete the path in between. Move the path down by the arrow key again. Select the two points and choose join path.\n\n"
    },
    {
      "time": "",
      "content": "Yes, but that is redicoulously complicated. It just looks like Adobe has destroyed the 'Outline stroke' option, it is borked. In CS2 it worked perfectly, placing only one node everywhere, instead of two stacked on top of each other.\n\nIf I have a drawing with hundreds of points, of which I want to move say 50, your method would be a lot of work. ;) Needless to say that 'Outline stroke' is totally unusable at the moment.\n\n"
    },
    {
      "time": "",
      "content": "Right now my workaround is to do a lot of drawing in Fontlab and paste it into Illustrator, and eventually switch to use inkscape.\n\n"
    },
    {
      "time": "",
      "content": "That probably works, but it still is not a solution. ;)  \nI think it's just a thick fat bug in Illustrator CS3?\n\n"
    },
    {
      "time": "",
      "content": "I poked around the Adobe forums and this is a known bug—no idea when there will be a fix. Of course, I can’t get any Illustrator CS3 patches to install anyway, because the patcher insists that I have a file with a bad checksum...I don’t have time for this BS right now...\n\n"
    },
    {
      "time": "",
      "content": "Here's a simple workaround:\n\n1. Select the path in question (the one with the doubled points).\n\n2. Option-click (or on Windows, Alt-click) on the top-left button on the Pathfinder palette (the one that merges shapes).\n\n"
    },
    {
      "time": "",
      "content": "Oh well, James, you at least saved me the trouble of digging through the Adobe forums myself. I'll give Mark's suggestion a try until some sort of patch arrives.\n\n"
    },
    {
      "time": "",
      "content": "If anyone figures out this issue PLEASE post it. My illustration time almost doubles because of this.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the tip Mark.\n\nIllustrator CS3 has me considering using Cider to port Corel Draw to my Mac. I just got Corel Draw 12 on eBay for $50 because I wanted the fonts, maybe I’ll end up using the software, too.\n\n"
    },
    {
      "time": "",
      "content": "Wow. This has me spooked on upgrading to CS3. I use this feature virtually every time I use Illustrator, that would really mess up my workflow.\n\n"
    },
    {
      "time": "",
      "content": "Yeah, it's hilarious. :D\n\n"
    },
    {
      "time": "",
      "content": "And if that’s not bad enough, Adobe’s patch utility for Illustrator doesn’t work very well, and the workaround is to keep uninstalling, reinstalling, and attempting to patch until it does. I guess that’s better than the CS1/CS2 days when bugs just didn’t get fixed, but it’s not something I have time to deal with right now.\n\n"
    },
    {
      "time": "",
      "content": "To overcome the idiot factor of the programmers, I select the hollow arrow tool, click and drag to select the points that are stacked on top of one another. Then (still using the hollow arrow tool) I can click selected points and drag to make adjustments.\n\n"
    },
    {
      "time": "",
      "content": "I'm so happy that other people have found this problem too. I was beginning to question my sanity as no one I asked about it hadn't noticed anything strange. This totally ruins the workflow when designing logos and custom letterforms. I hope this gets fixed soon. Has Adobe been bombarded with notifications about this? They should be.\n\n"
    },
    {
      "time": "",
      "content": "It had been discussed in the official forum last time I checked.\n\n"
    }
  ]
}
