{
  "id": "36834",
  "title": "Harold's Fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I never really see anyone here mention Harold Lohner. He has offered many free and $5 fonts which, some are quite nice. Besides my love for Sarah Script from Charles Borges de Oliveira, I have also been infatuated with Imitation from Harold. I just enjoy the face. If I ever did a poster about Paris in the early 1900s - that font would be perfect.\n\nI received an email about Harold Lohner's art show, _Wheel of Life_- and I thought I'd share it with you. (You've probably received it as well, and if not - here goes.)\n\nSubject: September News from Harold’s Fonts + Art Opening\n\nSeptember News from Harold’s Fonts + Art Opening\n\n[http://www.haroldsfonts.com](http://web.archive.org/web/20140729143115/http:/www.haroldsfonts.com/ \"http://www.haroldsfonts.com\")\n\nBack to school, back to font-making...\n\nBut first I wanted to tell you about an opening this Friday. I’m doing a outdoor projection piece on the Opalka Gallery at Sage College of Albany, where I teach. “Wheel of Life” is a cycle of portrait drawings I made using a scanner. Here’s the invitation; please check it out. [http://www.haroldsfonts.com/wheeloflife.pdf](http://web.archive.org/web/20140729143115/http:/www.haroldsfonts.com/wheeloflife.pdf \"http://www.haroldsfonts.com/wheeloflife.pdf\")\n\nThe new font this month is SWEET SPIRIT, an intricate design that’s a cousin to my popular Graceful Ghost. Drawn with long flowing lines and adapted from a historical source, perfect for suggesting embroidery or engraving. Now available from Font Bros.\n\nAnd thank you for the positive response to my new arrangement with Font Bros. It’s getting me a wider audience for my work. I appreciate those who’ve followed and supported my work for almost 10 years now. So many have asked that I provide easier shopping or encouraged me to charge more for commercial fonts. And I’m happy to be able to continue to offer free and $5 fonts as well.\n\nThanks again,  \nHarold Lohner  \n [http://www.haroldsfonts.com](http://web.archive.org/web/20140729143115/http:/www.haroldsfonts.com/ \"http://www.haroldsfonts.com\")\n\n",
  "author": "Jackie Frant",
  "time": "6 Sep 2007 — 4:33am",
  "uid": "6012",
  "comments": [
    {
      "time": "6 Sep 2007 — 5:56am",
      "content": "I agree that Harold's work is under-appreciated. I knew Harold when I lived and worked in Troy, New York. He's a wonderful person, a fantastic printmaker, and an excellent curator as well.\n\n"
    },
    {
      "time": "6 Sep 2007 — 8:15am",
      "content": "You can also view his fonts at [Font Bros](http://web.archive.org/web/20140729143115/http:/www.fontbros.com/cgi-bin/commerce.cgi?search=action&category=1210&keywords=all). He does have some fun display typefaces, that is for sure. I think my favorite is Ben's Gothic, with Graceful Ghost following.\n\n"
    },
    {
      "time": "6 Sep 2007 — 8:25am",
      "content": "Sorry to be completely OT, but for how long has that been **Wardle de Sousa** , Mrs Tiffany?  \nSurely this cannot be considered a non-typographical event? Or have I missed out completely (most likely...)?\n\n"
    },
    {
      "time": "6 Sep 2007 — 8:26am",
      "content": "Hehe. Umm, yeah it happened in June. I didn't want to make a big deal of it.\n\n"
    },
    {
      "time": "6 Sep 2007 — 8:31am",
      "content": "OK, Congratulations anyway!\n\n"
    },
    {
      "time": "6 Sep 2007 — 8:33am",
      "content": "Thanks, Fredrik. :) See you next week.\n\n"
    },
    {
      "time": "20 Oct 2007 — 8:17pm",
      "content": "Thanks for sharing Jackie. I love Harold's work too; I've enjoyed a friendship with him by correspondence since 2003. Some time in the first half of 2008 I plan to publish an interview with Harold about his font work, since he is so underappreciated. Hoping to reverse that I will post a news release here at Typophile and on Fontlover.com when the interview goes online. It will be the third installment in my \"A conversation with...\" series.\n\nCheers.\n\nj a m e s\n\n"
    },
    {
      "time": "21 Oct 2007 — 5:08am",
      "content": "Thanks James.\n\nI look forward to the interview -- if you need a proofreader/editor - holler :-)\n\n"
    }
  ]
}
