{
  "id": "36858",
  "title": "[CRITIQUE]: Transition from graphically-heavy to clean & crisp",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "After utilising a graphically-intensive (and indeed slightly overwhelming) style for my [portfolio](http://web.archive.org/web/20131021002735/http:/www.paulwilsdon.com/), I've decided to go with something in line with [ALA](http://web.archive.org/web/20131021002735/http:/www.alistapart.com/) or [Mark Boulton](http://web.archive.org/web/20131021002735/http:/www.markboulton.co.uk/) for my latest version.\n\nI've asked around, and some have compared it to a letter rather than a website, but I think it'll make a nice and refreshing change for the layout.\n\nThe content requirement of the site is as any other portfolio: Bio, Work, Blog and Contact - however - there is a 52-week _daily_ entry to be filled for my industrial placement for University, and I'm attempting to make it as legible as possible (something which definately does **not** happen with the current style).\n\nAny comments or suggestions would be greatly appreciated, and with that I'd like to introduce myself as one of the latest additions to this fantastic resource's arsenal of designers!\n\nIt seems the file could not upload using T's submission tool - the image is hosted at [Imageshack](http://web.archive.org/web/20131021002735/http:/img178.imageshack.us/my.php?image=picture1sy7.png)\n\nRegards,\n\nPaul.\n\n",
  "author": "paul.w",
  "time": "6 Sep 2007 — 3:12pm",
  "uid": "21493",
  "comments": [
    {
      "time": "6 Sep 2007 — 5:23pm",
      "content": "So is this the updated site we are looking at? I'm very inexperienced at web design, but from a general design perspective, you need to establish a grid and some better hierarchy.\n\nYour text flows across the entire page, making it difficult to read. That would be the first thing I would address.\n\nDavid\n\n"
    },
    {
      "time": "6 Sep 2007 — 11:16pm",
      "content": "Helv. Neue Thin is mostly to thin for your sizes and on black (that makes it even thinner) background. You need a lot more black-(uhm, white)space.  \nThe texttype is to small and the lines are much toooo long.  \nAnd i don't get why you format the navigation like this.\n\n"
    },
    {
      "time": "7 Sep 2007 — 2:22am",
      "content": "Apologies, I must not have been clear.\n\nThe Black/Green/Pink layout is indeed the old version.\n\nI've established a grid and used less neon-esque colour for the [latest](http://web.archive.org/web/20131021002735/http:/img178.imageshack.us/my.php?image=picture1sy7.png) version.\n\nRegards,\n\nPaul\n\n"
    }
  ]
}
