{
  "id": "36855",
  "title": "COFFEE What Type of Coffee Machine do you have?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What type of coffee machine do you have in your office? Like it? How’s the coffee taste? We’ve got a Bunn Auto Drip one and no matter what we put through it it taste less than desirable.\n\n [‹ Type Design For Corporate Companys](http://web.archive.org/web/20080322020934/http:/www.typophile.com/node/36995 \"Go to previous forum topic\") [Reading makes you cross-eyed... ›](http://web.archive.org/web/20080322020934/http:/www.typophile.com/node/36952 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080322020934/http://www.typophile.com/user/16146\" title=\"View user profile.\">dohdoh</a>",
  "time": "<br>",
  "uid": "16146",
  "comments": [
    {
      "time": " 6.Sep.2007 1.41pm",
      "content": "I love coffee. That’s why I don’t use a machine to make it.\n\n"
    },
    {
      "time": " 6.Sep.2007 1.58pm",
      "content": "I use a French press with fresh ground coffee when I can, but I’m not disciplined enough to have perfected a system for optimal coffee brew-age. The amount of coffee I use, brewed for about the time I usually brew it for, produces pretty good coffee, usually.\n\n"
    },
    {
      "time": " 6.Sep.2007 2.11pm",
      "content": "Hrant would say: <cite>Where’s the type?</cite> ;°)\n\n"
    },
    {
      "time": " 6.Sep.2007 2.27pm",
      "content": "\\> Hrant would say: Where’s the type? ;°)\n\nThat was actually my first thought when read the topic title.\n\n"
    },
    {
      "time": " 6.Sep.2007 2.33pm",
      "content": "quote: “... How do you maintain this spirit ...”  \n(...) “... provide the best espresso machine in the street ...”  \n(see: [http://www.spiekermann.com/mten/2007/06/](http://web.archive.org/web/20080322020934/http:/www.spiekermann.com/mten/2007/06/ \"http://www.spiekermann.com/mten/2007/06/\"))\n\n;o)\n\nIt’s funny, I researched a lot some time ago, so I can provide the common recommendations of the espresso forums in D for perfect italian moments (best in combination with a really good coffee mill):\n\n- Oscar Nuova Simonelli (robust and good coffee)  \n- a little more expensive: Bezzera BZ 99 (more shiny, also good coffee)  \n- much more expensive: La Cimbali junior (... sigh ...)\n\n"
    },
    {
      "time": " 6.Sep.2007 2.34pm",
      "content": "I use a [Philips Coffee Gourmet](http://web.archive.org/web/20080322020934/http:/www.aktie-online.nl/images/843410.jpg) machine, because it actually boils the water before it touches the coffee grind. A lot of coffee machines don’t do that, they just make it warm-ish. This is for very good coffee. If I want a quick, but still fairly good coffee, I use a [Philips Senseo](http://web.archive.org/web/20080322020934/http:/www.dejuistekeus.nl/images/philips_hdsenseotitanium.jpg) machine with coffee-pads.  \nBut as long as the machine boils the water, the beans or grind are important as well.\n\n"
    },
    {
      "time": " 6.Sep.2007 2.35pm",
      "content": "OK — [Kenyan Coffee](http://web.archive.org/web/20080322020934/http:/www.myfonts.com/fonts/larabie/kenyan-coffee/)? [Eight O’Clock Coffee](http://web.archive.org/web/20080322020934/http:/www.haroldsfonts.com/redcircle.html)?\n\n"
    },
    {
      "time": " 6.Sep.2007 2.40pm",
      "content": "Here’s the type! I’ve got a tamper with a modified Rancilio logo. My initals are MR so it was an obvious (and i guess a very nerdy thing to do). For me there is no type design without a few double shots. My machine is a Rancilio Silvia and the grinder is a Rancilio Rocky.\n\n ![](http://web.archive.org/web/20080322020934im_/http:/www.typophile.com/files/magnus_espresso_4653.jpg)\n\n"
    },
    {
      "time": " 6.Sep.2007 2.47pm",
      "content": "We have a Gaggia Classic at our office. I’ll buy the coffee fresh every week from our local espresso bar nearby, Salinos (yes I’ve made there logo). They have a wonderful brand by the name of Zicaffé... one of the best i’ve tried, from sicily of course.\n\n/Barista brutto!\n\n"
    },
    {
      "time": " 6.Sep.2007 3.04pm",
      "content": "I knew Stefan would chime in. He is ritualistic about his espresso. Being raised in Utah I wasn’t exposed to much coffee. Stefan introduced me to espresso when I worked in his office a few years ago, and now that our office has an espresso machine I don’t ever drink drip coffee. We got this [Gaggia](http://web.archive.org/web/20080322020934/http:/www.coffeegeek.com/reviews/consumer/gaggia_espresso) and have been happy with it. It’s rated at CoffeeGeek as the best espresso maker under $300.\n\n"
    },
    {
      "time": " 6.Sep.2007 3.23pm",
      "content": "Surprisingly not bad either although it’s no “real espresso” (but there is “crema”, produced by a special valve):\n\n ![](http://web.archive.org/web/20080322020934im_/http:/www.typophile.com/files/bialetti_brikka_3668.jpg)\n\nBut the coffee grinder is really essential. And of course the coffee, which I think has to be tested with the machine. There are huge differences how the same coffee tastes when brewed with a different machine. With Bialetti Brikka e.g. 100% Arabica coffee is too subtle. And the coffee shouldn’t be too old. At the moment I use an indonesian mixture called “sulawesi kalossi”, freshly roasted by the coffee bar in town, mhm ...\n\n"
    },
    {
      "time": " 6.Sep.2007 3.35pm",
      "content": "I think those Bialetti things do make ’real espresso’?  \nI have used those every now and then as well, nice coffee.\n\n"
    },
    {
      "time": " 6.Sep.2007 4.15pm",
      "content": "It’s only from a purist’s view and it’s based on the steam developed while brewing coffee:  \n“Common” Bialettis produce a beverage called “mokka”, with Brikka it’s a bit different because of the special valve. Here the steam is accumulating until the vapor pressure has reached 6 bar. Big espresso machines generally reach more (ca. 10) bar, which results in a better “crema”.  \nTo complicate things even more: oriental coffee brewed in a little pitcher (boiled up 3 times, with lots of sugar and a little cardamom, no accumulating of steam) is also called mokka.\n\n"
    },
    {
      "time": " 6.Sep.2007 4.15pm",
      "content": "I keep it as simple as possible and use a Melitta one-cup drip cone. It does nothing special and doesn’t make the best coffee around, but it takes about a second to empty and I can run it through the dishwasher.\n\nFWIW, Keuring machines may be quick and easy office coffee makers, but they produce some of the most pathetic coffee I have ever tasted.\n\n"
    },
    {
      "time": " 6.Sep.2007 4.49pm",
      "content": "This is a very interesting subject. At my desk I have a Senseo coffee pod machine. Not bad, not great.\n\nIn the studio we have the Keurig k-cup system. Better, but still not great. I have chosen to use the Keurig system because I have found a distributor that sells a 25-serving box of Jet Fuel by Coffee People $10.95. Keeps me from spending $$$$ at the local coffee shop (It’s a Grind).\n\nHowever, I spoke with a kind gentleman at Peet’s Coffee. I wanted to intall the Miele espresso machine with warming drawer in my home. I love the beautiful lines and would hate to have yet another appliance sitting on my countertop. He informed me to stay away from the Swiss and German espresso machines. (Breaks my heart as I am of 100% German/Swiss descent) He gave me this list of names for great coffee makers:  \nGaggia  \nLa Marzocco  \nLivia  \nLa Pavoni  \n(all Italian brands)\n\nIf you’re really a coffee snob, you would do the French press route with extremely cold filtered water, freshly ground beans, heat the water to the precise temp, brew the coffee for the required time period, plunge enjoy. Then there are some that would say the remaining coffee is too bitter because it is still technically brewing and won’t be the same as the first cup.\n\n"
    },
    {
      "time": " 6.Sep.2007 5.42pm",
      "content": "To avoid drinking too much coffee, and to make a bit of a ritual of each cup, I use a manual one-cup drip cone, pouring the boiling water into it very slowly making sure to keep all the grounds constantly submerged. The coffee itself is Nabob Full City Dark Roast. No doubt not the best brew in the world, but I like it and it’s better than Tim Hortons any day. Being a one-man office, this system works fine.\n\n"
    },
    {
      "time": " 6.Sep.2007 5.51pm",
      "content": "At home - Robert Norton’s old Gaggia and a basic no-name filter machine  \nAt work - Starbucks iCup\n\n"
    },
    {
      "time": " 6.Sep.2007 7.19pm",
      "content": "[http://www.merchantsofgreencoffee.com/](http://web.archive.org/web/20080322020934/http:/www.merchantsofgreencoffee.com/ \"http://www.merchantsofgreencoffee.com/\")  \nMy favourite so far is Yemen Matari.\n\nI roast it, grind it up, pour boiling water on it and filter it.\n\nAt my office? They took the machine (which actually grinds the coffee on the spot and makes a decent cup)out ’cuase of renovations, so it’s Tim Hortons, since there’s no decent coffee shops where my office is.\n\n"
    },
    {
      "time": " 6.Sep.2007 8.29pm",
      "content": "Cheap coffee machine + burr grinder + various fair trade coffees for extra smugness. I avoid buying the same coffee twice because I heard somewhere that life is short.\n\nCan anyone recommend a kick-ass burr grinder? Mine is getting close to retirement.\n\n"
    },
    {
      "time": " 6.Sep.2007 8.46pm",
      "content": "I have a special self modified Bialetti Brikka which I nickel electro-plated. Feel free to contact me offline for instructions on how to make the best Bialetti Coffee. I did many experiments... BTW the lettering for brikka logo is pretty bad. There is the type.\n\n"
    },
    {
      "time": " 6.Sep.2007 9.07pm",
      "content": "Tina,  \nYou are making me crave a cup of your coffee!That sounds delicious from 5000 miles away :-)\n\nChrisL\n\n"
    },
    {
      "time": " 6.Sep.2007 9.16pm",
      "content": "You guys make me feel bad for getting my coffee at Trader Joes instead of the awesome, dozens-of-varieties place around the corner.\n\n"
    },
    {
      "time": " 6.Sep.2007 9.31pm",
      "content": "\\>You guys make me feel bad for getting my coffee at Trader Joes instead of the awesome, dozens-of-varieties place around the corner.\n\nDon’t feel bad - there are people out there who just use one font. ;-)\n\n"
    },
    {
      "time": " 7.Sep.2007 5.10am",
      "content": "Funny - maybe people involved in good type - must enjoy good coffee....\n\nI use to be a real coffee drinker - but not anymore. My stepson uses a machine and coffee by Gevalia. Anyone here use it to? He swears by it. [http://www.gevalia.com/Gevalia/](http://web.archive.org/web/20080322020934/http:/www.gevalia.com/Gevalia/ \"http://www.gevalia.com/Gevalia/\")\n\nI remember steamed coffee, sock coffee, perculator coffee, the coffee that you boil the water in the lower pot, it rises and when you gave the color you want, turn the gas off and let it drip back down coffee, oh let’s not forget drip coffee - where would we have been without our Melitas? and then in the early 1980s I discovered the press - and kept using that. If it was good enough for Hemingway - the it is good enough for me!\n\n"
    },
    {
      "time": " 7.Sep.2007 6.19am",
      "content": "I’m now an iced-coffee addict. I use the toddy:\n\n[http://www.amazon.com/s/002-3285529-0773647?ie=UTF8&tag=mozilla-20&index...](http://web.archive.org/web/20080322020934/http:/www.amazon.com/s/002-3285529-0773647?ie=UTF8&tag=mozilla-20&index=blended&link%5Fcode=qs&field-keywords=toddy&sourceid=Mozilla-search \"http://www.amazon.com/s/002-3285529-0773647?ie=UTF8&tag=mozilla-20&index=blended&link%5Fcode=qs&field-keywords=toddy&sourceid=Mozilla-search\")\n\n"
    },
    {
      "time": " 7.Sep.2007 6.30am",
      "content": "\\>\\>My coffee guru (who works at the hippest coffee shop in Copenhagen, Denmark) is trying to make me drink only Jamaican Blue Mountain\\<\\<\n\nYour guru is right!  \nBut I could never afford to drink only Blue Mountain, so I have to limit myself to once in a while.\n\nJason C\n\n"
    },
    {
      "time": " 7.Sep.2007 7.19am",
      "content": "I use the Melitta one-cup drip cone too, like James. I work at home and have a tiny kitchen. If I had more counter space I’d get an espresso machine - there’s a Krups a friend has that I like. I hate old coffee so whatever I use it has to be made fresh. Don’t like the french press because it gets grainy.\n\nFor coffee I use a dark roast, Italian or French. I make it super strong and while the water is boiling for the coffee I warm up some milk, so it’s almost a latte. I get my beans at Fairway or at Gorilla Coffee in Brooklyn which gives you a free cup of coffee if you buy a pound of beans. I grind them myself using a little Krups grinder.\n\n"
    },
    {
      "time": " 7.Sep.2007 7.25am",
      "content": "Nespresso, What else?\n\n ![](http://web.archive.org/web/20080322020934im_/http:/www.typophile.com/files/s320x240_3816.jpg)\n\nThis reminds me of bill murray in lost in translation during the whiskey ad.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nFischers Fritz fischt frische Fische, frische Fische fischt Fischers Fritz\n\n"
    },
    {
      "time": " 7.Sep.2007 7.29am",
      "content": "[Nantucket Coffee](http://web.archive.org/web/20080322020934/http:/www.nantucketcoffee.com/) ground fresh. I use bottled water as our tap water doesn’t make a good cup.\n\n"
    },
    {
      "time": " 7.Sep.2007 7.29am",
      "content": "I use a French press... which is acceptable, as long as you drink the coffee right away. The quality of the beans is essential. My coffee guru (who works at the hippest coffee shop in Copenhagen, Denmark) is trying to make me drink only Jamaican Blue Mountain or Papua New Guinea. Ethiopian Mocca is just passable.\n\n"
    },
    {
      "time": " 7.Sep.2007 7.34am",
      "content": "No one drinking the $160 per pound Kopi Luwak coffee? ;)\n\n"
    },
    {
      "time": " 7.Sep.2007 7.44am",
      "content": "The best coffee I ever had, was in milan at the train station in the morning at 9 when I arrived there. It made my day. It’s a pitty I didn’t write the name down.\n\nItalian coffee makers rule!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nFischers Fritz fischt frische Fische, frische Fische fischt Fischers Fritz.\n\n"
    },
    {
      "time": " 7.Sep.2007 8.32am",
      "content": "for tina and all the Bialetti moka lovers out there:\n\n[http://it.youtube.com/watch?v=jomcKBngTyY](http://web.archive.org/web/20080322020934/http:/it.youtube.com/watch?v=jomcKBngTyY \"http://it.youtube.com/watch?v=jomcKBngTyY\")\n\nOmino Bialetti, typographically speaking :)\n\n"
    },
    {
      "time": " 7.Sep.2007 8.33am",
      "content": "Cuppa, cuppa, cuppa...:-)\n\nChrisL\n\n"
    },
    {
      "time": " 7.Sep.2007 8.38am",
      "content": "I’ve got two old reliables . . .\n\n1) Jura-Capresso Z6 Super Automatic (got a nice license deal and decided to treat myself) - Loaded with Starbucks Espresso blend of half regular and half decaf - Tip: Buy Starbucks beans only from Starbucks free standing stores, not in Target Starbucks, the beans are drownding in oils to further preserve shelf life at retail chains.\n\nMachine is mostly used for Cappucinos and Americanos (and Frothed Milk + NesQuick for Hot Cocoa for the Kiddos)\n\n2) Starbucks Barista Thermal Mug Machine - When I’m in the mood for good old fashioned drip, this machine honestly makes better coffee than my Krups and keeps it hot right in the mug it drips in for like half the day. Also, Starbucks House Blend or Breakfast Blend.\n\nIt should be noted we have acquired a near collection of coffee machines ranging from 1950s percolators to vacuum pots to Senseo and so fourth . . . I worked at Gloria Jeans during my college years and became a coffee snob once I knew better . . . BTW, there is no finer coffee on a week long fishing trip in Canada than propane fired perk with the grounds sunk at the bottom . . . It’s horrible and I love it!\n\nOf course my reply is going on but there is something so very simple and complex about coffee machines that is just appealing to me in a gadgety way. It’s just steeping near boiling water over ground beans but like toasters or mouse traps, there are like a billion ways to do it . . . I’m always pleased with new ideas on a very old process . . .\n\nStuart :D\n\n"
    },
    {
      "time": " 7.Sep.2007 8.53am",
      "content": "Stuart\n\nI have always been leery of Starbucks. When I was last living in NYC (up to 1999) there were several lawsuits against Starbucks. I don’t know how they fanned out - but...\n\n1. One of the early 1990s years - they sold more Hawaaian Kona Beans then Hawaai produced that year;\n\nand\n\n2. All those lovely sacks of 100% Columbian - weren’t.\n\n"
    },
    {
      "time": " 7.Sep.2007 8.59am",
      "content": "As with any coffee, it always comes down to personal preference of taste which is my judge of coffee I favor . . .\n\nI’ve spent big bucks on Intelligencia and enjoyed many pots ’o Eight O Clock but at the end of the day, I have no problem patronozing Starbucks since my latte factor has dropped at least 400% from buying $4 crappucinos from poorly trained baristas to about .25¢ per cappucino making it at home of course with their beans . . .\n\n:D\n\n"
    },
    {
      "time": " 7.Sep.2007 9.02am",
      "content": "Usually I buy my coffee grind/beans or take away coffee at [Simon Lévelt](http://web.archive.org/web/20080322020934/http:/www.simonlevelt.nl/),  \na Dutch coffee company which has been roasting and selling coffee for over 200 years. Tea as well. A lot of know-how, honesty and very good quality coffee. But most of it is quite expensive as well.\n\n"
    },
    {
      "time": " 7.Sep.2007 9.13am",
      "content": "<cite>As with any coffee, it always comes down to personal preference of taste which is my judge of coffee I favor . . .</cite>\n\nToo true. I share a beach house with a finicky couple who have polar opposite taste in coffee. She likes hers dark and strong and he likes his to taste like it came from a diner (ick). So we need two machines, two different coffees. Her coffee is understandably more popular although at times it tastes like it can take the paint off your car. Then there’s a third guy in the house who inexplicably likes his coffee made in a percolator. This ups the ante to three machines. It’s absurd. If we had to license our coffee per machine like fonts we’d be paying thru the nose ;-)\n\n"
    },
    {
      "time": " 7.Sep.2007 11.23am",
      "content": "I don’t have an espresso machine at home (where I work), yet. But I’m getting tired of training every new barista at the local café how to pull a proper ristretto shot, so it is only a matter of time.\n\nMornings start with a French press of freshly ground fair-trade Sumatran dark.\n\nIn the afternoon I’ll either pop out for an espresso or make Turkish coffee. If I have twenty minutes free (ha!) I’ll hand-grind the beans for the latter, but otherwise I use the very excellent coffee from Kurukahveci Mehmet Effendi & Sons in Istanbul.\n\nMeanwhile, Ross has gone hardcore and is roasting his own beans.\n\n"
    },
    {
      "time": " 7.Sep.2007 11.51am",
      "content": "Tungsteno, thank for the link! I don’t think I’ve seen cartoon figures speak with letter shaped mouths before.\n\nAs for coffee, I only drink it in Italian restaurants and cafes (in Italy, if possible). Elsewhere it’s tea, please, but not with the tea bag, if possible.\n\n"
    },
    {
      "time": " 7.Sep.2007 12.08pm",
      "content": "I use the simpler predecessor to [this Krups combo machine.](http://web.archive.org/web/20080322020934/http:/www.krupsusa.com/All+Products/Coffee+Machines/Espresso+coffee+machines/Products/XP1500/XP1500.htm) Mine is called “Caffe Duomo”, implying that you’ll have everything you need. Drinks from this machine really remind me of the flavor of the espressos and cappucinos in Rome. Mine has the fatal design flaw of a rocker switch down low, easily turned on by accident. I think appliance makers are learning not to do this anymore.\n\n"
    },
    {
      "time": " 7.Sep.2007 1.00pm",
      "content": "Mine has the “built in obsolescence” very thin glass carafe that you need to replace annually.\n\nChrisL\n\n"
    },
    {
      "time": " 7.Sep.2007 1.31pm",
      "content": "I download my coffee from TypoPhile; it comes dripping down my USB-slot. I’d rather get some Wifi-blend, it’s faster and doesn’t taste like copper.\n\n"
    },
    {
      "time": " 7.Sep.2007 2.14pm",
      "content": "Amazing; we have a non-type question as the hottest topic on typophile. It must be the lack of sleep wondering which typeface to use in that new ID job that makes type enthusiasts so consumed with their coffee;-)\n\n"
    },
    {
      "time": " 7.Sep.2007 3.09pm",
      "content": "Coffee is oh so most definitely a type related question! Some of us type freaks depend on it as much as FontLab to design type :-)\n\nChrisL\n\n"
    },
    {
      "time": " 7.Sep.2007 3.30pm",
      "content": "What do you French Press users do about the “silt” that is left in the coffee? I personally don’t like it, have tried pouring it through a filter, which takes way too much time.\n\nI would like to consider roasting beans after finding out from quite a few sources that roasted beans start to lose their flavor after about a week. Check out this site:\n\n[Storyville Coffee Co.](http://web.archive.org/web/20080322020934/http:/www.storyville.com/)\n\nNo, I don’t work for them, just thought their info was interesting...\n\n"
    },
    {
      "time": " 7.Sep.2007 4.07pm",
      "content": "Hey Chris,\n\nThere are easier methods of [roasting your own coffee beans](http://web.archive.org/web/20080322020934/http:/www.makezine.com/blog/archive/2006/03/how_to_make_a_popcorn_popper_c.html)\n\n:D\n\n"
    },
    {
      "time": " 7.Sep.2007 5.15pm",
      "content": "Coffee stays fresh a lot longer if you get beans in cans that have been pumped full of nitrogen.\n\n"
    },
    {
      "time": " 7.Sep.2007 5.28pm",
      "content": "Chris: _What do you French Press users do about the “silt” that is left in the coffee? I personally don’t like it, have tried pouring it through a filter, which takes way too much time._\n\nFor French press coffee, you want a very coarse grind to prevent small bits of coffee grounds getting through the press filter. Blade grinders are ideal for this (in fact, it’s the only thing they’re good for: they don’t grind nearly fine enough for espresso or moka (e.g. Turkish coffee)). I give one short burst on a blade grinder for each spoonful of coffee beans (usually five for a full-size pot): that breaks the coffee up enough to release the flavour, but not enough to produce much ’silt’. There will always be a small amount of powder, no matter how coarse the grind, but that shouldn’t bother you.\n\nMind you, I like Turkish coffee, so finding a small mudslide in the bottom of my cup isn’t an issue.\n\n"
    },
    {
      "time": " 7.Sep.2007 6.03pm",
      "content": "My grandmother required that mudslide to tell my fortune :-)\n\nChrisL\n\n"
    },
    {
      "time": " 7.Sep.2007 8.57pm",
      "content": "I just bought a pound of Ethiopian Yergacheffe at Gorilla Coffee in Park Slope. Can’t wait for my morning pick-me-up.\n\nI can’t stand the silt at the bottom of french presses. That’s why I swear by my little plastic drip cone.\n\n"
    },
    {
      "time": " 7.Sep.2007 9.03pm",
      "content": "<cite>Mind you, I like Turkish coffee, so finding a small mudslide in the bottom of my cup isn’t an issue.</cite>\n\nFor people who don’t have the courage to mainline caffeine directly into a vein.\n\n"
    },
    {
      "time": " 7.Sep.2007 9.12pm",
      "content": "I’m happy to hear that other people still use the plastic drip cones. My mom also still uses one, and thought she was a freak for buying a bunch of them in case Melitta stocpa making them :)\n\nAnd yeah, the silt (not to mention the messy press) is why I gave up on the french press. Was it in a William Gibson novel that a Columbian character pointed out that the French know nothing about coffee? Anyway, whoever wrote it was right—they can cook a mean duck over there, but the French really need to just replace their entire coffee infrastructure with stuff from Lavazza.\n\n"
    },
    {
      "time": " 7.Sep.2007 9.58pm",
      "content": "Anyone else tried coffee from one of the new Clover machines? It’s fascinating to watch the coffee being made: like a French press process on steroids and amphetamines, and I like the way the grounds are pressed out of the top of the machine to be scraped off. I’ve only bothered with it once, though, because there always seems to be a much more attractive espresso machine standing nearby...\n\n"
    },
    {
      "time": " 7.Sep.2007 10.12pm",
      "content": "If money was no object I’d get one of those all-in-one capuccino machines that grind and brew it for you. I stayed in a fancy hotel once that had them in the rooms, you sleepily pushed a button et voila, you had espresso, fresh ground and all. But they are even more expensive than the iPhone (at its original price).\n\n"
    },
    {
      "time": " 8.Sep.2007 2.28am",
      "content": "Oh, the espresso scented cloud lingering over typophile has grown considerably!  \nAnd thanks a lot for the link to the little film!\n\nI think that the price is one of the reasons why the nuova simonelli oscar (smallest dual circuit, i.e. separate circuits for coffee and steam) is so popular in the forums in this country: it’s available for approximately the same (original) amount as the iPhone - only that it’s not that good looking ... ;o)\n\nMeanwhile I found out that brewing good espresso in the home/office has pleasantly reduced the amount of money I tended to carry to my favorite coffee spot in town — I had a small swiss machine which gave up after 3 years and then, after some hints and experiments, found out how to get good stuff out of the Brikka. But I have to admit, that in future planning there is one of these chrome machines twinkling at me, with lots of coffee capacity for visiting friends, colleagues, clients, ... :-)\n\n"
    },
    {
      "time": " 8.Sep.2007 2.52am",
      "content": "Used for my (one or two) morning cappuccino(’s): a (now discontinued semi-pro model of) La Spaziale  \n [http://www.laspaziale.com/english/macchine\\_en.html](http://web.archive.org/web/20080322020934/http:/www.laspaziale.com/english/macchine_en.html \"http://www.laspaziale.com/english/macchine\\_en.html\")  \nwih Lavazza 100% arabica coffee (the pregrinded kind in a can, stored in either fridge or freezer).  \nMilkfoam handmade from demi-fat sterilized Dutch milk.\n\nMy girlfriend prefers coffee from those Italian household espressomakers you put on the range. Way too low-tech for me ; ).\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 8.Sep.2007 4.48am",
      "content": "Wow! I never considered it but this explains plenty. Can we start a list for clear-headed users?\n\nCheers!\n\n"
    },
    {
      "time": " 8.Sep.2007 7.55am",
      "content": "Stuart, have you tried that modded popcorn roaster? I was looking at a few home roasters online, and they’re still expensive. John, maybe the grind was too fine for the French press the few times I tried it. Maybe I’ll give it another shot. But, a barista at Intelligentsia in Chicago told me that it’s inherent to the French press.\n\n"
    },
    {
      "time": " 8.Sep.2007 8.28am",
      "content": "Has anyone tried the [aeropress](http://web.archive.org/web/20080322020934/http:/www.thinkgeek.com/caffeine/accessories/8e3a/)?\n\nAnd on a related note, has anyone else spent a whole morning on calligraphy only to realize that the coffee made the letters look like seismic activity readings?\n\n"
    },
    {
      "time": " 8.Sep.2007 9.54am",
      "content": "Ahhh, that grunge caligraphy effect :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Sep.2007 11.03am",
      "content": "for the true connoi-sewer\n\n[http://www.latimes.com/news/nationworld/world/la-fg-coffee13jul13,0,6810...](http://web.archive.org/web/20080322020934/http:/www.latimes.com/news/nationworld/world/la-fg-coffee13jul13,0,681015,full.story?coll=la-default-underdog \"http://www.latimes.com/news/nationworld/world/la-fg-coffee13jul13,0,681015,full.story?coll=la-default-underdog\")\n\n"
    },
    {
      "time": " 8.Sep.2007 1.20pm",
      "content": "<cite>My machine is a Rancilio Silvia and the grinder is a Rancilio Rocky.</cite>\n\nMagnus, we have the same machine and grinder — _and tamper!_ (Reg Barber, yes?)\n\nIt’s at home, not in my office, but sometimes I work at home. :)\n\n"
    },
    {
      "time": " 8.Sep.2007 1.30pm",
      "content": "Chris: _My grandmother required that mudslide to tell my fortune_\n\nDid she also interpret the lamb’s jawbone at Easter?\n\n"
    },
    {
      "time": " 8.Sep.2007 1.46pm",
      "content": "If you want the ultimate cup of coffee then forget the French Press and go with a vacuum pot - Yamma makes a cheap one. Smooth, subtle and the perfect cup every time - assuming you are using good coffee.\n\nI used to roast my own and all that. Now I do not typically have the time to roast, but the coffee from my local roaster is good enough - not perfect, but solid.\n\n—  \nMike\n\n"
    },
    {
      "time": " 8.Sep.2007 2.49pm",
      "content": "“Did she also interpret the lamb’s jawbone at Easter?”\n\nNo, John. She did enough jawboning to my grandfather, though :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Sep.2007 3.21pm",
      "content": "Christopher, yes it’s a Reg Barber. My Rancilio is at home as well. At the office we have an Isomac Giada. I like them both, but my favourite is the Rancilio.\n\n"
    },
    {
      "time": " 8.Sep.2007 8.20pm",
      "content": "At home I have a pretty crappy drip machine with a hotplate that will burn the coffee if you leave it in the pot for too long. But then, I also use Maxwell House in it, so it doesn’t much matter.\n\nMy other coffee-makers are: one of those tiny stove top things — but now that I no longer have a gas stove it’s not so great — and a Bodum French press which I really like, but am terribly lazy about cleaning out afterwards. In the Bodum I use good coffee. My more recent forays have been “Kick Ass” made by Kicking Horse, which is fair trade.\n\nI like my coffee overly strong, and I have no problem with the silt. If it’s not there I sorta think something’s missing. My inlaws make incredibly weak (coloured water) coffee. Something like half a spoon of coffee for every two cups. Ew. I always have to remember when they visit to make it “their way”. When they’re over I make two pots — the maxwell house crap and my bodum.\n\nAt work, I have no desk space, but I tried one of those one cup drip machines. Problem was it splattered, and made such a mess. Communal coffee pots just don’t work in our office — I even have problems even keeping a small carton of cream in the fridge. It either spoils or gets finished by other people (thieves!). So it’s downstairs to Timmy’s Ho for me, twice a day. I’ve actually grown to like it. Somehow it fits the work environment just so well. Every once in a while I get a paper cup that is leaking at the seam, and it makes the morning all the more enjoyable. ;)\n\n"
    },
    {
      "time": " 8.Sep.2007 11.31pm",
      "content": "Regarding the aeropress—yes, I have one and it’s excellent. I’d highly recommend it, though it takes some calibration before you get the timing and proportions right. But once you get your routine, it makes great Moka-type espresso. I sometimes dilute it to make Americano.\n\nI used to use a [Chemex manual drip coffeemaker](http://web.archive.org/web/20080322020934/http:/chemexcoffeemaker.com/). Now I just use the Aeropress (and a French press when I’m in the mood for unfiltered coffee). Although the Chemex makes better drip coffee than any automatic drip machine I’ve had, it’s still drip coffee. I prefer a small, strong cup of coffee (or espresso) to a weak pitcher of drip coffee.\n\nFresh-roasted beans make a huge difference, as long as you grind them just before you make the coffee. There’s no comparison between beans roasted yesterday and beans roasted 6 months ago (that “expire” in another year). Check with a local independent coffee shop: they probably buy their beans from someone local.\n\n"
    },
    {
      "time": " 9.Sep.2007 11.27am",
      "content": "_Mind you, I like Turkish coffee, so finding a small mudslide in the bottom of my cup isn’t an issue._\n\nIndeed, just as with Greek coffee, it’s a requirement. The variety with cardomom is also a refreshing change of pace...\n\n"
    },
    {
      "time": " 9.Sep.2007 7.58pm",
      "content": "I’ve had a Melita one-serve drip for years, which my sweetie uses — I gave up coffee years ago.\n\nTea is my non-alco bev of choice: preferably minty.\n\n"
    },
    {
      "time": " 9.Sep.2007 9.16pm",
      "content": "Oldnick: _Indeed, just as with Greek coffee, it’s a requirement._\n\nAs I understand (from Greek friends), prior to the Turkish invasion of Cyprus in the 1970s  \neven the Greek called this drink ’Turkish coffee’.\n\nThe addition of cardomom is typically Arabic: you can buy Arabic blends with the cardomom already added. I’ve noticed that the Arabic, Bosnian and Romanian varieties tend to be a darker roast. I prefer the Turkish and Greek brands, which are a medium roast and don’t require as much sugar.\n\n"
    },
    {
      "time": " 9.Sep.2007 9.43pm",
      "content": "<cite>But then, I also use Maxwell House in it...</cite>\n\nI once worked in an office with dozens of people from the deep south, where everyone drinks Maxwell House like water. The smell was unbearable—a friend and I had to stash our own coffee maker in her cubicle and stay out of the kitchen.\n\n"
    },
    {
      "time": " 10.Sep.2007 12.23am",
      "content": "My grandmother was from Greece and came to this country in about 1916. She called it Turkish coffee.\n\nChrisL\n\n"
    },
    {
      "time": " 10.Sep.2007 6.09am",
      "content": "This is quite a refreshing topic.\n\nAt home: a Rancilio Silvia with a Gaggia grinder; beans by [http://www.hasbean.com](http://web.archive.org/web/20080322020934/http:/www.hasbean.com/ \"http://www.hasbean.com\") (no, really).  \nAt work: a trusty biggish old Krupps that will do the requisite 15 bar; OTC ground Lavazza.  \nIn the garage: a La Pavoni Europiccola, disused after it blew the 1500W toroidal transformer that was powering it.  \nIn my ears: she-of-impeccable-nutrition reminding me I’ll do my ticker in.\n\n"
    },
    {
      "time": " 10.Sep.2007 8.19am",
      "content": " ![](http://web.archive.org/web/20080322020934im_/http:/www.typophile.com/files/krups__4959.jpg)\n\nAt Dalton Maag we use my old Krups, and at home I have another similar to this but at home I use a single cup gold filtered thing like a Melita. Continentals use the espresso with no milk, I use it like a very large 3-4 cup cappuccino.\n\n"
    },
    {
      "time": " 10.Sep.2007 9.10am",
      "content": "I use a French press too, you don’t get the bitter taste from the oil buildup.\n\n"
    },
    {
      "time": " 10.Sep.2007 9.49am",
      "content": "I used to love the French Roast (and other beans) I got at a place called Freed, Teller, & Freed on Polk St. in SF. I see they are still kicking:\n\n[http://www.freedscoffeetea.com/indexjava.html](http://web.archive.org/web/20080322020934/http:/www.freedscoffeetea.com/indexjava.html \"http://www.freedscoffeetea.com/indexjava.html\")\n\nThey used to have good Kona too, although that seems to have become a bit of an oxymoron since the hurricane destroyed the crop some 15 years ago.\n\n"
    },
    {
      "time": " 10.Sep.2007 9.57am",
      "content": "Turkish coffee (Elite)\n\n"
    },
    {
      "time": " 10.Sep.2007 2.19pm",
      "content": "I am a devotee of San Francisco’s finest, one cup at a time, [Philz Coffee](http://web.archive.org/web/20080322020934/http:/www.philzcoffee.com/index.html). It is kind of like drinking crack, really, with a dash of cardamom.\n\nWhen the rare occassion presents itself that I actually make coffee at home, I use the ole French Press, with Philz Tantalizing Turkish blend.\n\n"
    },
    {
      "time": " 11.Sep.2007 5.44am",
      "content": "Braun Coffeemaker  \n(I have the Aromaster KF420 which they don’t make any more. It brews great coffee and is an ergonomic marvel.) Get an inexpensive 10 cup: it’s better to brew fresh coffee more often than to drink old muddy coffee. As with any coffeemaker, turn it off after it finishes brewing, unless you want your coffee cooked and bitter. Reheat leftover cups in a microwave. New Braun 10 cup model KF510 in white or black, $30 at [Amazon (White only)](http://web.archive.org/web/20080322020934/http:/www.typophile.com/wiki/%252Bhttp%25253A%25252F%25252Fwww.amazon.com%25252FBraun-KF510-WH-AromaDeluxe-10-Cup-Coffeemaker%25252Fdp%25252FB00006JL0A)with free shipping. ($35-50 elsewhere)\n\nKrups 203 Coffee Grinder (in white or black); about $20  \nWorks great; other grinders make a mess.\n\nTry Kenya AA (“excellent body, heady aroma, very little bitterness”) or Ethiopian Yirgacheffe (“distinctive floral bouquet, rich body, a pleasingly fragrant aroma, with a smooth mellowness”) if you haven’t already. Best coffee prices online are at [California Coffee Roasters.](http://web.archive.org/web/20080322020934/http:/www.freshcoffee.net/) A five pound bag is $30 + shipping.\n\n"
    },
    {
      "time": " 11.Sep.2007 8.20am",
      "content": "<cite>I once worked in an office with dozens of people from the deep south, where everyone drinks Maxwell House like water. The smell was unbearable—a friend and I had to stash our own coffee maker in her cubicle and stay out of the kitchen.</cite>\n\nI worked with someone who actually drank Sanka because she liked the taste. Imagine! That’s like eating Chicken of the Sea and thinking you’ve just had a tuna steak.\n\n"
    },
    {
      "time": " 11.Sep.2007 10.30am",
      "content": "Chicken of the Sea is WAY better than Sanka! Sanka is toxic waste crystals.\n\nChrisL\n\n"
    }
  ]
}
