{
  "id": "36878",
  "title": "'Progress means simplifying, not complicating' Bruno Munari",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anyone know the exact context of this quote? (Other than the stairwell of the the Design Museum, London!)  \nSorry it's not strictly type related.\n\nThanks guys\n\n",
  "author": "<a href=\"/web/20100905062019/http://typophile.com/user/16140\" title=\"View user profile.\">1985</a>",
  "time": "<br>",
  "uid": "16140",
  "comments": [
    {
      "time": "",
      "content": "I don't know, but it's a great quote. I'm going to put it somewhere. Thanks!\n\n"
    },
    {
      "time": "",
      "content": "I'm not quite sure – you can try to find in this book:\n\nBright minds, beautiful ideas  \nEditor: Annink, Ed/Munari, Bruno  \nContent: parallel thoughts in different times ; Bruno Munari,  \nCharles & Ray Eames, Martí Guixé and Jurgen Bey  \nAmsterdam, BIS Publishers, 2003, ISBN90-6369-06-22\n\n"
    },
    {
      "time": "",
      "content": "Thanks nora g, sorry I'm late replying, I will have a look for the book now.\n\nThe quote is interesting, but I'm not sure I agree with it!\n\n"
    },
    {
      "time": "",
      "content": "_The quote is interesting, but I’m not sure I agree with it!_\n\nReally? It's hard to judge the phrase completely out of context, but I think it can apply to a lot of industrial design, or to modernist ideas about design in general -- uncluttering rather than cluttering, making things easier to use rather than harder. Good design usually has these objectives.\n\nI had to read a couple of Munari's books in my first year of design school, but that was a long time ago (the mid-1980s), and I can't recall if this phrase was in them. :-)\n\n"
    },
    {
      "time": "",
      "content": "That quote seems simplistic, sweeping. What about this one:\n\n\"Progress is the exchange of one problem for another.\"\n\nI don't know who that is attributed to, if anyone. It may be so old it's a genuine proverb in the public domain. It only gets one hit on Google, so it may be so old practically everyone has forgotten it.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "_That quote seems simplistic, sweeping._\n\nWell, yeah, it does oversimplify -- I don't think you can always apply it, or that it applies to everything. It's like saying that all you ever need are 5 or 6 typefaces. ;-)\n\n_\"Progress is the exchange of one problem for another.\"_\n\nHeh-heh, I'm sometimes inclined to believe in that one! :-D\n\n"
    },
    {
      "time": "",
      "content": "I'm glad to see this post get going. I think it is simplistic, but there is some strange inclination on my behalf to believe it.\n\nPerhaps the quote itself is a simplification of the issue!\n\nAgainst aesthetics it holds quite true but against technology I have less faith in it. I think technological progress is often an illusion of simplicity. The designer's task is often made more compex in the pursuit of simplicity!\n\n"
    },
    {
      "time": "",
      "content": "p.s. I forgot to say thanks!\n\n"
    },
    {
      "time": "",
      "content": "Perhaps when we look at this work of Munari of 1939, we could guess, what he wants to say with his quote ;-)\n\n ![](http://web.archive.org/web/20100905062019im_/http:/typophile.com/files/munari_5034.jpg)\n\n"
    },
    {
      "time": "",
      "content": "_I think technological progress is often an illusion of simplicity. The designer’s task is often made more compex in the pursuit of simplicity!_\n\nYes, no doubt about that.\n\n_Perhaps the quote itself is a simplification of the issue!_\n\nThe implication of progress is improvement over what existed before. But progress is more complex and involved than that.\n\n_Against aesthetics it holds quite true..._\n\nPart of me wants to believe it, but history shows progress in art and design to be cyclic. What starts off simple (artefacting of the medium and tools notwithstanding) is made more complex and elaborate by the addition of \"new\" ideas and philosophies; sometimes these additions are called \"refinement\", and conceived of as progress, a \"progression\" over what came before them. Complexity accumulates until the state of the art is incapacitated by excessive detail and protuberances. At this point a backlash usually occurs and art is returned to a simpler state.\n\nAfter a while we become bored by simplicity, and the process begins again. Complexity builds and builds until we can stand it no more. The cycle of progress goes on, like a tide. Simplicity and complexity fall in and out of fashion.\n\nMunari's conception of progress appears typical of the early 20th century modernist backlash against the decorative excesses of late 19th century art and design. Tschichold prescribed simple sans serif typefaces and simple compositions as the ideal for the 20th century---to begin with---but later recanted in favor of more sophisticated classical design from the 16th and 15th centuries.\n\nIn essence, progress, or progression, is change, a move towards something either less complex of more complex. The definition given for progress depends on what part of the cycle we're in.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Try finding a cell phone that is just a phone and doesn't do anything that isn't obvious from just looking at it and you'll see the connection between progress and simplicity :_)_\n\n"
    },
    {
      "time": "",
      "content": "_Try finding a cell phone that is just a phone and doesn’t do anything that isn’t obvious from just looking at it and you’ll see the connection between progress and simplicity_\n\nFor technology simpler does seem to be better. I can see the connection very clearly, but can you see the cycle I've outlined?\n\nI'm talking about art and design, not technology. For aesthetics progress is not neccessarily improvement, but change.\n\nI don't have a cell phone---it makes my life simpler :^)\n\nEdit of previous post: \"...a move towards something either less complex **or** more complex.\"\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Current examples of \"progress\" not answering to simplification.\n\n**Design & Aesthetics**  \nThe leading edge in linear or sans serif typeface design is moving away from the simple models of the 19th & 20th centuries towards models of increased complexity, borrowing from seriffed type designs. The trend began with fonts like Rotis sans and its jarred rounds, designed by Otl Aicher. According to Identifont.com, \"With Rotis, Aicher was searching for the clearest legibility by combining elements of serif and sans serif.\" The Rotis series (superfamily) also introduced the semi-sans (designed 1989), using a stressed stroke in an otherwise linear type design.\n\nMore complexity came with FF Legato, designed by Evert Bloemsma 2004, and is continuing with Microsoft Candara, designed by Gary Munch. According to Ascender Corporation, \"Candara is a casual humanist sans with verticals showing a graceful entasis on stems, high-branching arcades in the lowercase, large apertures in all open forms, and unique ogee curves on diagonals. The resultant texture is lively but not intrusive, and makes for a friendly and readable text.\" According to Wikipedia, \"Candara is featured in the Microsoft ClearType Font Collection, a set of fonts developed to take advantage of ClearType to improve the reading experience in Windows Vista and Office 2007.\"\n\nITC Officina, designed by Erik Spiekermann and Ole Schäfer 1990 - 1998, promoted serifs on i & j, curled stem tips and bent entry & exit strokes for a condensed information sans with enhanced text performance.\n\nNick Shinn's Preface (2003), \"...switches the emphasis, driving out diagonals to create a dominant harmony of curves and perpendiculars, matched with a greater variety of inter-character space shapes. [Nick describes the design and its principles.](http://web.archive.org/web/20100905062019/http:/www.myfonts.com/fonts/shinn/preface/)\n\nThen there is [Frantisek Storm's Sebastian](http://web.archive.org/web/20100905062019/http:/www.myfonts.com/fonts/storm/sebastian/) (2003). According to the blurb, \"Sebastian Sans-serif typefaces compensate for their basic handicap – an absence of serifs – with a softening modulation typical of roman typefaces.\"\n\nFormata (1984), designed by Bernd Möllenstädt, \"Instead of linear severity common to many sans serifs, Formata offers curved strokes and interesting details that are subtle in smaller sizes but distinguishable in larger sizes, thus, appropriate for both text and display.\"\n\nSurely these developments are considered progress? Sans serif typeface design is not becoming simpler, it is moving away from reductive modernism by growing in richness and complexity.\n\n**Technology**  \nFont technology has grown from the simple Type 1 format of yesteryear to the increasingly complex monster called OpenType. A feature-laden OT font simplifies typesetting matters for the user, but for typeface designers and developers the job is becoming more and more complex. Try developing a text font with built-in smallcaps and trying to make the kerning values for the lowercase work with those smallcaps.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Thanks James, it's been a while since I checked this thread, but I made similar conclusions myself. I will make a complete reply when I have a spare minute. Thanks to all replies.\n\n"
    }
  ]
}
