{
  "id": "36879",
  "title": "Straightjacket urgently needed!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am an absolute dilettante (and that translates “I love typography”) and that is why I have just devoured the forums without being able to contribute. But after some very interesting threads\n\ne.g.  \n [http://www.typophile.com/node/17260](http://web.archive.org/web/20131014142940/http:/www.typophile.com/node/17260 \"http://www.typophile.com/node/17260\")  \n [http://www.typophile.com/node/36423](http://web.archive.org/web/20131014142940/http:/www.typophile.com/node/36423 \"http://www.typophile.com/node/36423\")\n\nI guess it’s time someone wrapped me in a straightjacket for otherwise I will strangle the next person who tongue-in-cheek asks for “a free font very similar to that famous …”.\n\nOf course I always realized that it is hard work to create a typeface, but the amount of individual and collective theory development, historical research and meticulous craftsmanship involved makes me feel grateful that as a single non-commercial user I spend only 20 to 50 Euro for a good font.\n\nThanks to all you professionals!\n\n",
  "author": "Katharina",
  "time": "7 Sep 2007 — 7:59am",
  "uid": "20933",
  "comments": [
    {
      "time": "7 Sep 2007 — 8:52am",
      "content": "I’ve learned to spot such threads from the titles and ignore them.\n\n"
    },
    {
      "time": "7 Sep 2007 — 8:59am",
      "content": "I’m always searching for a car that looks a lot like a Porsche because I don’t want to pay for a real one.\n\nPieter\n\n"
    },
    {
      "time": "7 Sep 2007 — 9:02am",
      "content": "You're being sarcastic, right James? I mean you didn't ignore the thread. :^P\n\nWelcome to Typophile, Katharina. Why don't you have a seat next to James.\n\n"
    },
    {
      "time": "7 Sep 2007 — 9:03am",
      "content": "... and yet another one where I mis-read. D'ah! Yes. You have to learn to ignore the free font threads because those people need to do more lurking.\n\n"
    },
    {
      "time": "7 Sep 2007 — 9:26am",
      "content": "I'm not sure, ignoring those threads without educating \"those people\" will just make them look somewhere else (like some russian forum) and end with some pirated font. If they are on typophile they may be cheap but they are at least trying to do the right thing.\n\n"
    },
    {
      "time": "7 Sep 2007 — 9:41am",
      "content": "That's a _very_ good point.\n\n"
    }
  ]
}
