{
  "id": "36876",
  "title": "OpenType, TrueType, Type One PostScript",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nI always buy type one fonts when I can. Maybe things have changed but printers prefered type 1 and maybe still do. I thought open type was a passing thing. Is it here to stay? How do printers like it? What type of font format should I buy?\n\n",
  "author": "Wine Label Designer",
  "time": "7 Sep 2007 — 7:03am",
  "uid": "21242",
  "comments": [
    {
      "time": "7 Sep 2007 — 7:35am",
      "content": "There's a few good reasons to buy OpenType, but it always depends on what you really need and what applications you use.  \nBut one thing you should know is that OpenType CFF fonts contain Type1-outlines, which printers should like at least as much as the old stuff!\n\n"
    },
    {
      "time": "7 Sep 2007 — 7:50am",
      "content": "I usually buy OpenType if I can.\n\n"
    },
    {
      "time": "7 Sep 2007 — 8:38am",
      "content": "One thing to keep in mind ... eventually support for Type 1 fonts will go the way of the dodo bird. I already know of a few foundries who no longer offer support for their Type 1 fonts.\n\n"
    },
    {
      "time": "7 Sep 2007 — 8:41am",
      "content": "It's a long story but the end of it is: don't buy Type 1 if you have an option, buy Open Type instead.\n\n[Here](http://web.archive.org/web/20131101000106/http:/blogs.adobe.com/typblography/2005/10/phasing_out_typ.html) Thomas Phinney explains that Adobe is phasing out Type 1, and Type 1 doesn't work any longer on some Windows programs. There are links to the full story.\n\n"
    },
    {
      "time": "7 Sep 2007 — 11:39am",
      "content": "<cite>I usually buy OpenType if I can.</cite>  \nI do so, too.  \nHowever, sometimes I just don’t have a use for any of the advantages an OpenType version would bring; e.g. when licensing a one-weight font to meet a customer request and simply get the job done.  \nConcerning those situations—where I really have no need for cross-platform performance or single-file fonts, or where the font’s nature doesn’t demand neither 64K glyphs nor Unicode encoding  \noptions for advanced typographic features—what format would you advice to license?\n\nI’m on Mac OSX, and I’ve noticed that a lot of its system fonts actually are TrueType.  \nIs that preferable over Type 1? Most often, foundries offer a pricey OT along with more economic TrueType and PS Type 1. What confuses me: the former typically are advertised as being made ‘for Windows’ and the latter ‘for Mac’. Does this (still) refer to Mac OS ≤9? Are there any drawbacks with TrueType?  \nThanks, F.\n\n"
    },
    {
      "time": "7 Sep 2007 — 2:16pm",
      "content": "OS X will ‘eat’ any fontformat…\n\nA major difference between TrueType and Type1 is that TT has (in principle) better hinting than T1. TT is a format that combines font-outlines, screenfont and font-data. T1 has separate files for fontoutline (aka printerfront) and screenfont. Some programs depend on an extra file (FontMetrics) for the correct use of T1.\n\nNote that there are (at least) two flavours of OpenType. The typeoutlines may be based upon PostScript (T1) or TrueType (TT). OpenType is a new kind of container for all of the data needed to put a font on paper, film or a screen.\n\nApple‘s dfont format is a superset of TrueType with an extended characterset.\n\n(Please correct me if I’ve made mistakes here…)  \n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "7 Sep 2007 — 2:27pm",
      "content": "Is it still true that the extra math involved in rendering Truetype fonts at high resolutions causes major slowdowns in RIPs, or do newer RIPs handle Truetype at the same pace they handle Postscript fonts? Some printers I hear from, even really high-end shops, don’t want anything to do with Truetype fonts, and I still see production checklists from design firms that have “Make sure not Truetype fonts were used” as a step in preparing jobs for press.\n\n"
    },
    {
      "time": "7 Sep 2007 — 2:46pm",
      "content": "<cite>Some printers I hear from, even really high-end shops, don’t want anything to do with Truetype fonts, and I still see production checklists from design firms that have “Make sure not Truetype fonts were used” as a step in preparing jobs for press.</cite>\n\nI think this is a myth that has almost outlived it's usefulness. However, if you look at a lot of the \"free font\" websites and \"10,000 font\" CDs floating around, Windows TT is a dominant format. One reason for this is that low-end, junk font creation tools can often only output this format. Note that it's not the format itself that's flawed, it's the tools and those that work with them. Often, these greymarket fonts have substantial technical flaws, and if they are abandonware, there is no vendor to get them fixed. So, a prepress person may not dislike TT for the right reason, but they may still be getting the right results.\n\nSimilarly Adobe, in my option, produces some of the highest quality fonts available. They favor Postscript-flavored OpenType, which means that there are a lot of wonderful, technically superb OpenType fonts floating around. To ship these fonts, one either needs to use Adobe's Font Development tools or FontLab, both of which are actively maintained and of high quality.\n\nA few vendors, such as Microsoft, do ship high quality, heavily tested Windows TrueType fonts. In those cases, I think there is no reason to fear them. The new Vista fonts starting with \"c\", Calibri, Cambria, Candara, etc. are all beautiful fonts created by top designers.\n\nYou might want to read up a bit on OpenType, because as Berkson said, it's a long story.\n\n"
    },
    {
      "time": "7 Sep 2007 — 2:55pm",
      "content": "Thank you for this insight!\n\n￼<cite>Is it still true that the extra math involved in rendering Truetype fonts at high resolutions causes major slowdowns in RIPs, or do newer RIPs handle Truetype at the same pace they handle Postscript fonts?</cite>\n\nI guess I’m too young for having heard of such annoyances. Printers get PDFs with fonts included, no matter whether those are TT, OT or whatever. Never had any complaints. Lucky me. :°)\n\n"
    },
    {
      "time": "7 Sep 2007 — 3:43pm",
      "content": "\\> _However, sometimes I just don’t have a use for any of the advantages an OpenType version would bring;[...]_\n\nWell, if that is the case I buy a 'std' OpenType version, if available. Usually those have both LF and OSF figures in it, which us always positive. And sometimes a couple of alternates or something like that, which can be useful. And of course the ease of use in InDesign and such.\n\n"
    },
    {
      "time": "7 Sep 2007 — 4:57pm",
      "content": "Open type works cross platform correct? Is there more than one type of Open type?\n\n"
    },
    {
      "time": "7 Sep 2007 — 5:28pm",
      "content": "_Open type works cross platform correct?_\n\nPlease see my response to [your other query](http://web.archive.org/web/20131101000106/http:/typophile.com/node/36864).\n\n_Is there more than one type of Open type?_\n\nNope. Just one -- OpenType. The same OpenType file will work on a Mac _and_ on a PC. It's a beautiful thing.\n\n"
    },
    {
      "time": "7 Sep 2007 — 5:35pm",
      "content": "postscript : type :: casettes : music\n\n(sorry just a bit frustrated at the moment)\n\n"
    },
    {
      "time": "7 Sep 2007 — 5:35pm",
      "content": "_Open type works cross platform correct? Is there more than one type of Open type?_\n\nyes, it's a cross-platform format, which comes in two [flavors](http://web.archive.org/web/20131101000106/http:/www.typophile.com/wiki/flavor).\n\n"
    },
    {
      "time": "7 Sep 2007 — 5:55pm",
      "content": "[Here is a nice primer.](http://web.archive.org/web/20131101000106/http:/www.typography.com/ask/recentTopic.php?rtID=86)\n\n"
    },
    {
      "time": "7 Sep 2007 — 9:22pm",
      "content": "Thanks for posting that link. This is really Wiki-type information, but H&FG have a solid take on it.\n\nI like statements like: <cite>OpenType is the best choice for graphic designers working in modern applications.</cite>\n\nAs mentioned, Quark did not support Unicode and advanced OpenType features until version 7. There have been a couple rounds of bugfixes too, so Quark support for OpenType is firmly established. This is really a time when everyone should be looking to OpenType for new font acquisitions.\n\n"
    },
    {
      "time": "7 Sep 2007 — 9:50pm",
      "content": "_it’s a cross-platform format, which comes in two flavors_\n\n_Here is a nice primer._\n\nThanks for posting those links, Paul and William -- I was not aware of those differences. My apologies to Patricia for my earlier answer -- I stand corrected.\n\n"
    },
    {
      "time": "8 Sep 2007 — 10:46am",
      "content": "Foundries often charge more, sometimes quite a lot more, for a font in Opentype format than the old Type 1 variety. Now I can understand this from the fact that you get cross-platform performance and may get enhanced character sets and extended language support. I'm balking at upgrading some of my licences to Opentype, however, because of the cost: I don't need cross-platform support or extended language support. I really just like it for the extra functionality and efficiency for typesetting plain old Canadian English on my Mac. So perhaps foundries should consider offering subsets of Opentype fonts that have large international character sets, and give a discount to those willing to restrict themselves to one platform.\n\n"
    },
    {
      "time": "9 Sep 2007 — 12:06am",
      "content": "\\> _I don’t need cross-platform support or extended language support._\n\nWhat about small caps, old style figures, ligatures and other typographic niceties all in the same font? Do you need those?\n\n"
    },
    {
      "time": "9 Sep 2007 — 3:43am",
      "content": "Hi there:\n\nAnd a side point: Don't buy opentype where the designer/foundry has not integrated/automated the small caps, old-style figures, quaint ligs, or other features. You have to pay more than Type 1 but it will behave just the same and do nothing to ease your work flow. From my point of view its way to extract your dollars. If you type waffle and ffl does not switch in automatically- you need ask for your money back.\n\nHere is an example:  \n [http://www.fontshop.com/fonts/downloads/psyops/aquamarine\\_superset\\_ot/](http://web.archive.org/web/20131101000106/http:/www.fontshop.com/fonts/downloads/psyops/aquamarine_superset_ot/ \"http://www.fontshop.com/fonts/downloads/psyops/aquamarine\\_superset\\_ot/\")\n\nBut don't be confused a list like this:  \n [http://www.linotype.com/1313/pmncaecilia-family.html](http://web.archive.org/web/20131101000106/http:/www.linotype.com/1313/pmncaecilia-family.html \"http://www.linotype.com/1313/pmncaecilia-family.html\")  \nThis font has everything integrated into the font but you have to sort through a messy list and pay special attention to the feature key telling you what's inside the font.\n\nMost of the hinted opentype fonts use Truetype outlines so don't be against truetype flavored opentype if you see it. But this does not mean that all TrueType flavored opentype fonts are hinted either.\n\nMy opinion: There are others too but Adobe and FontShop are excellent opentype programmers :-)\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "9 Sep 2007 — 9:49am",
      "content": "_And a side point: Don’t buy opentype where the designer/foundry has not integrated/automated the small caps, old-style figures, quaint ligs, or other features. You have to pay more than Type 1 but it will behave just the same and do nothing to ease your work flow._\n\nthere seems to be a lot of misunderstanding about what OpenType (OT) is. OT is just a more modern type technology. In short, it's a more robust, cross-platform font format than the legacy formats. Not all OT fonts are \"Pro\" fonts with addeded features and not all OT fonts are more expensive than their legacy format counterparts.\n\n"
    },
    {
      "time": "9 Sep 2007 — 2:29pm",
      "content": "Paul\\> Thank you for your point. I was referring to type 1 fonts that have expert sets and then someone might think that these features will be integrated/automated into the opentype release of that same font. There are many opentype releases that are just as plain jane their type 1 friends- these I see no point to buying unless you need to switch back and forth between windoze and mac... EULA permitting of course.\n\n"
    },
    {
      "time": "9 Sep 2007 — 2:33pm",
      "content": "even if it is only a format conversion, the OTF format is better supported by today's OSes and Applications than PS (in my experience). The only reason i would see to prefer type 1 over the exact same fotns in OT format is if you are using an old OS with old applications that just can't handle OT for some reason (but even most older OS+application schemes should work with OT Std fonts if you have ATM installed). OT is just a more robust format.\n\n"
    },
    {
      "time": "9 Sep 2007 — 6:45pm",
      "content": "\\> I thought open type was a passing thing. Is it here to stay?\n\nIt's actually the opposite of what you thought. All other formats are a passing thing. OpenType is the future. If you want to buy new type, OT is the best investment. Nearly any printer can use OT fonts just fine. The era of PostScript-only RIPs has passed.\n\nRegarding the cost difference between OT and TT/PS: usually it is quite small or zero if no new features are added. You do get the benefit of cross-platformability, which is a nice bonus in the long term.\n\nWhen there is a larger difference in price, such as in [FontFonts](http://web.archive.org/web/20131101000106/http:/www.typophile.com/wiki/FontFont) it's because, as was mentioned, the OpenType version is more than a straight conversion. Features were added to help you save time and set better type. FontShop.com now let's you see exactly which OT features are included -- see any [Font Detail page](http://web.archive.org/web/20131101000106/http:/www.fontshop.com/fonts/singles/fontfont/ff_nexus_serif_ot_italic/?acs=1).\n\n"
    },
    {
      "time": "9 Sep 2007 — 6:48pm",
      "content": "To further illustrate how OpenType can simplify your life:\n\n[\n ![](http://web.archive.org/web/20131101000106im_/http:/typophile.com/files/482118456_ac06537871_3498.jpg)\n](http://web.archive.org/web/20131101000106/http:/www.flickr.com/photos/stewf/482118456)\n\n[\n ![](http://web.archive.org/web/20131101000106im_/http:/typophile.com/files/482127951_0555f8005d_3577.jpg)\n](http://web.archive.org/web/20131101000106/http:/www.flickr.com/photos/stewf/482127951)\n\n"
    },
    {
      "time": "9 Sep 2007 — 7:29pm",
      "content": "Nice illustration, Stephen!\n\n"
    },
    {
      "time": "9 Sep 2007 — 8:14pm",
      "content": "\\> OpenType is a new kind of container\n\n'Old'. The name was TrueType Open, and introduced in 1996 (the Arabic version of Windows 95)\n\nThat said, TTF = OpenType = cross-platform\n\n"
    },
    {
      "time": "9 Sep 2007 — 11:39pm",
      "content": "￼<cite>even if it is only a format conversion, the OTF format is better supported by today’s OSes and Applications than PS (in my experience).</cite>\n\nI’d like to hear more about that experience, if you don’t mind sharing.  \nIs it better supported than _TT_, too? I consider OS X(.4) and Vista ￼<cite>today’s OSes</cite> …\n\n"
    },
    {
      "time": "9 Sep 2007 — 11:40pm",
      "content": "Hi Paul:\n\nAre you on the Windows side? If you are using Vista then I would agree with the OpenType being better supported. Doesn't Vista Avalon system supports OpenType better than OSX- right? Type 1 on Windows has always been kinda funky.\n\nRegarding a font conversion: If your idea of robustness is portability and easy file management- then yes. All other areas- no. Not unless there is something else I don't know. Type 1 support is not evaporating anytime soon in OS X.\n\nI use Apple Pages (a modern app) which taps into Apple's AAT system that handles OpenType. I still cannot access all of the alternates, in lets say, Adobe Poetica or FF Meta, by grabbing them from the character palette or configuring the typography panel. But if it's characters I can type on my keyboard like ffl or fi for waffle or fig, then I can access it that way and it switches. But if its not something I can type, like a ding or alt small cap, attempting to pull it from the character palette will result in an error message and its a no go:\n\n ![](http://web.archive.org/web/20131101000106im_/http:/typophile.com/files/Picture19_5599.png)\n\nThis is an OS problem. I hope they fix it in Leopard. I wish it was a panacea but its not. When you mean modern applications are you just speaking of Adobe? Adobe uses their own rendering system which has the best support of OpenType. The app I use depends on OSX.\n\nIf I have said thing that's incorrect please correct me,\n\nMike Diaz :-)\n\nPS... Just curious, have any non-Adobe apps for general use (like Wordpad) been written to use the Avalon type system? Is there a Windows equivalent of the Typography Panel to help?\n\nPS part deux... Poetica used to cost big bucks ($100+) prior to opentype now its only $29. So I agree if there is a well done opentype version- buy it and it might be cheaper. But do your homework first.\n\nPS part trois... Coles: I really love the new Complete View feature. Its shows all the actually glyphs included in the font. Very unlike the tedious MyFonts or Linotype sites that make you browse through blank Unicode pages just so you can see all the small caps that you know are there, FontShop is downright breezy!\n\nPS part zillion... I thought Pro means greek and cyrillic support.\n\n"
    },
    {
      "time": "9 Sep 2007 — 11:58pm",
      "content": "<cite>I thought Pro means greek and cyrillic support</cite>\n\nDepends on the foundry – and the font. Can stand for any form of enhancement, e.g. added swash alternates and special ligatures.\n\n"
    },
    {
      "time": "10 Sep 2007 — 12:43am",
      "content": "The basic level of OpenType, as defined by [Adobe](http://web.archive.org/web/20131101000106/http:/www.typophile.com/wiki/Adobe), is called “Std”. OT Std fonts are not necessarily a straight conversion of fonts from TrueType or PostScript format. They can include some features not included in legacy formats, such as built-in small caps, alternate figure styles, swashes, case-sensitive punctuation and so on.\n\nAn OpenType “Pro” font is [defined by Adobe as a font with additional language support](http://web.archive.org/web/20131101000106/http:/www.adobe.com/type/opentype/index.html#lang). It adds at least an Central European character set, but may also include Turkish, Baltic, Greek and Cyrillic. [Linotype](http://web.archive.org/web/20131101000106/http:/www.typophile.com/wiki/Linotype), [Monotype](http://web.archive.org/web/20131101000106/http:/www.typophile.com/wiki/Monotype), [FontFont](http://web.archive.org/web/20131101000106/http:/www.typophile.com/wiki/FontFont) and others have adopted this definition of \"OpenType Pro\".\n\nSome smaller foundries, on the other hand, have declined this language support definition and instead label any OT font with extra _features_ as a “Pro” font. This causes some confusion when shopping for OT fonts from various sources. It's always best to examine a [detailed specimen](http://web.archive.org/web/20131101000106/http:/www.fontshop.com/fonts/singles/fontfont/ff_nexus_serif_ot_italic/?acs=1) before making a purchase. Don't rely on the font name alone.\n\nBelow is an illustration of the differences between OpenType Std and Pro fonts, as defined by those larger foundries I mentioned.\n\n[\n ![](http://web.archive.org/web/20131101000106im_/http:/typophile.com/files/1353564979_21a696f0af_3602.jpg)\n](http://web.archive.org/web/20131101000106/http:/www.flickr.com/photos/stewf/1353564979/)\n\n"
    },
    {
      "time": "10 Sep 2007 — 12:58am",
      "content": "Bickham Script **Pro** is an OpenType font by Adobe that has no language support for Turkish, Greek or Cyrillic.\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:01am",
      "content": "Yes, but it does include an CE character set. I guess I should have clarified in my graphic that at least one of those extra languages are supported, but not necessarily all.\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:10am",
      "content": "_bert\\_vanderveen: A major difference between TrueType and Type1 is that TT has (in principle) better hinting than T1._\n\nYou have to say: \"TT has better hinting **possibilities** than T1\".  \nIf you don't spend a lot of time into hinting TrueType-fonts, they might look much worse than T1-fonts hinted in the same time.\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:17am",
      "content": "Unlike Adobe Pro, FontFont Pros at least contain CE, Turkish, Baltic and ISO Latin 3.\n\n"
    },
    {
      "time": "10 Sep 2007 — 8:31am",
      "content": "I think it is still not quite clear that '.ttf' files \\*are\\* OpenType. The OT font format is based on the TTF file structure. As an earlier poster pointed out, TrueType Open, has been around for more than ten years supporting the Arabic and Indic markets with features that are now marketed under the name OpenType.\n\nAlso note that you can label any TTF font as .otf and they will function fine under OSX and Win 2000 (with ATM support), XP and Vista. Microsoft decided to stick with TTF to provide legacy compatibility. A TTF font will also work in Win 95 and NT. This is important as many corporates still work with NT. Unicode support is maintained in all older versions of Windows, although typo feature support will get lost.\n\nAdobe's CFF fonts (otf) are still based on the old PS technology. It is in essence a PS font with a pretty TTF wrapper around it. It's also important to understand that whilt in a TTF glyphs are accessed directly via Unicode, in a OTF font, glyphs are accessed via Unicode - PS name conversion. This is why glyphs can go missing, particularly with typo features and languages, if you do not stick religiously to Adobes PS glyph name list. No such problem with TTF.\n\nI once heard that Linotype did some performance tests with TTF and PostScript fonts and found that TTF always won the race. TTF is good. All TTF \\*are\\* OpenType. What gives it the little 'O' icon is the digital signature.\n\nBruno Maag\n\n"
    },
    {
      "time": "10 Sep 2007 — 9:13am",
      "content": "OK now we are getting advanced! My head is swimming!\n\nSo will OTF work Windows XP Professional 2002?\n\n"
    },
    {
      "time": "10 Sep 2007 — 10:07am",
      "content": "\\> So will OTF work Windows XP Professional 2002?\n\nYes.\n\n"
    },
    {
      "time": "10 Sep 2007 — 11:28am",
      "content": "\\> To further illustrate how OpenType can simplify your life:\n\nThe first image isn't correct :)\n\n"
    },
    {
      "time": "10 Sep 2007 — 11:36am",
      "content": "Explain.\n\n"
    },
    {
      "time": "10 Sep 2007 — 11:55am",
      "content": "TT/TTF = OpenType (even without the OT/'O' icon; see the post by Bruno)\n\n"
    },
    {
      "time": "10 Sep 2007 — 12:52pm",
      "content": "By convention, foundries have used TTF for fonts with TrueType outlines and OTF for fonts with CFF (PostScript) outlines. It's unfortunate that this isn't a formal requirement, because the distinction can be useful for troubleshooting. While both flavors may be generally supported by current software, differences arise for legacy software users.\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:19pm",
      "content": "Thanks Bruno, that was very illuminative!\n\n"
    },
    {
      "time": "10 Sep 2007 — 2:08pm",
      "content": "But isn't there a difference in the resource fork of mac and pc truetype that make them not portable like opentype?\n\nMikey :-)\n\n"
    },
    {
      "time": "10 Sep 2007 — 3:40pm",
      "content": "I'll re-ask these:\n\nJust curious, have any non-Adobe apps for general use (like Wordpad) been written to use the Avalon type system? Is there a Windows equivalent of the Typography Panel to help?\n\nMikey :-)\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:55am",
      "content": "If you're talking about resource forks you are still pre OSX. Only the old Mac OSs needed resources. On OSX there are a few apps, Quark 6/6.5 and Freehand notably that appear to have issues with flat font files as they expect some resources to float about. Other than that I am not aware of programs having problems with flat fonts.\n\nUnder the old Mac OS you did need Mac and PC specific fonts as you rightly pointed out, Mikey.\n\nUnfortunately, Apple has decided to go it alone again, with the dfont format. This format supports Apple's own AAT system, their way of doing OT. But they also support OT, so no-one I know really cares about dfonts (they are, of course, not cross platform).\n\nOT is the way forward, and as far as I am concerned it's TTF based. These fonts are reliable, perform well and when hinted look good on the screen. Although that also depends on OS and the way apps render the type. My other standard mantra is Unicode, Unicode, Unicode...\n\nBruno Maag\n\n"
    },
    {
      "time": "11 Sep 2007 — 12:38pm",
      "content": "<cite>Just curious, have any non-Adobe apps for general use (like Wordpad) been written to use the Avalon type system? Is there a Windows equivalent of the Typography Panel to help?</cite>\n\nAvalon is now referred to as the Windows Presentation Foundation. Adobe applications handle their own font rendering--they don't use WPF for layout currently and are unlikely to do so in the future. Similarly on the Macintosh, Adobe handles text layout themselves, rather than using the features provided by the Cocoa programming interface. I'm not sure how the advanced OpenType features will be accessed, but it will make it much easier for developers to add them.\n\n"
    },
    {
      "time": "12 Sep 2007 — 4:19pm",
      "content": "\\> _I think it is still not quite clear that ’.ttf’ files \\*are\\* OpenType. [...] All TTF \\*are\\* OpenType._\n\nAlthough there's some underlying truth to these statements, they are over-simplistic and generate confusion in non-savy users' minds — in the same way that, on Windows, font files with a .ttf extension may either be displayed with a 'TT' icon or a 'O' icon. None of this helps the user understand the OpenType format any better, IMO.\n\nBack to the point. Correct is to say that the OpenType format is an extension of the (TrueType) [SFNT format](http://web.archive.org/web/20131101000106/http:/developer.apple.com/textfonts/Tools/tooldir/TrueEdit/Documentation/TE/TE1sfnt.html) (, which means the TrueType format is effectively a subset of the OpenType format). The SFNT file format is based on tables. Depending on the font format (e.g. TrueType, TrueType GX, OpenType TT, OpenType CFF), [some of these tables are required, and some are optional](http://web.archive.org/web/20131101000106/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=IWS-AppendixC).\n\nThe Windows system switches the icon of a .ttf file (to 'O') if that file contains a ' [DSIG](http://web.archive.org/web/20131101000106/http:/www.microsoft.com/typography/otspec/dsig.htm)' table, but this table is actually optional in the OpenType format. This means, an OpenType will still work properly even if it doesn't contain a DSIG table. Conversely, just because a given font file is assigned an 'O' icon (or has a DSIG table) doesn't necessarily mean that it contains any OpenType functionality; OT functionality is better accessed if the font file contains GPOS and/or GSUB tables, for example.\n\nBy the way, some type foundries even add custom tables to their fonts. This won't necessarily break the core functionality or usability of the font as the system accessing the font data simply ignores the tables that it doesn't understand.\n\n\\> _It’s also important to understand that whilt in a TTF glyphs are accessed directly via Unicode, in a OTF font, glyphs are accessed via Unicode - PS name conversion. This is why glyphs can go missing, particularly with typo features and languages, if you do not stick religiously to Adobes PS glyph name list._\n\nAgain, there's some underlying truth here, but this definitely deserves clarification. What happens is that some systems — namely Mac OS X — rely on the glyphs' names to get their encodings, instead of using the 'cmap' table. This happens to affect only OpenType CFF fonts.\n\n\\> _I once heard that Linotype did some performance tests with TTF and PostScript fonts and found that TTF always won the race._\n\nCan you give any significance to this statement by providing examples or some kind of substantive information? Thanks.\n\n"
    },
    {
      "time": "12 Sep 2007 — 4:46pm",
      "content": "<cite> This is an OS problem. I hope they fix it in Leopard. I wish it was a panacea but its not</cite>  \nNo, this is working as expected. If you export that document to a flat Unicode text file, there is no way\\* to store the alternate selections, or stylistic sets, or other such features. For this reason, OS X simply points out that you can't expect any export to be able to handle the alternates properly. OS X has a long way to go on fully supporting OpenType, but this isn't an area I can fault them at. Exporting from InDesign using an alternate character you'll have the same problem.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n\\* Unicode codes include 16 alternate selectors, but as to how those are to be interpreted is undefinied afaik in the standard.\n\n"
    },
    {
      "time": "13 Sep 2007 — 2:05am",
      "content": "Miguel, it was Bruno Steinert who mentioned this once at some Linotype Typo Technica, if I am not very much mistaken. They did some tests using different high res output devices. I don't think that there is written information but Dan Reynolds from LT might be able to shed some light on this.\n\nI don't think my simple statement - TTF are OT - is oversimplistic. What you provided is an elaborate explanation, which, of course, is quite correct. But that does not change the fact that TTF, whatever their contents, are OT. That Microsoft decided to keep naming them TTF simply maintains their strategy to provide as much backward compatibility as possible. I am making this statement because I am fighting a daily support battle for designers and (pre)press houses to understand that OTF (CFF) is not the all and only regarding OT. That Adobe managed to make OTF synonimous with OT is a marketing ploy of pure genius!\n\nAgain, my second statement is not necessarily simplistic. And again, you simply elaborate on the workings. However, it is as simple as that. CFF is PostScript by another name. It still lives in the world of glyph names as opposed to pure Unicode. IMO, that is not really great.\n\nBruno Maag\n\n"
    }
  ]
}
