{
  "id": "36894",
  "title": "Petition to make Veer merch available to people outside the US",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Veer has some really nice merch like their Kern zip up which I'd love to purchase. However Veer's merch products cannot be shipped outside of North America.\n\nAnyone else feel the same way?\n\nPlease sign the petition then maybe Veer will do something about it;-)\n\n",
  "author": "Endre Berentzen",
  "time": "7 Sep 2007 — 2:23pm",
  "uid": "16177",
  "comments": [
    {
      "time": "7 Sep 2007 — 2:38pm",
      "content": "Count me in! :^)\n\n"
    },
    {
      "time": "7 Sep 2007 — 2:54pm",
      "content": "Not to deflect your petition, but your heading disregards Canada (which is outside the US).\n\nVeer's corporate head office is in Calgary. I'm quite willing to march up and down in front of their building. Just tell me what message you want on the placard :-)\n\n"
    },
    {
      "time": "7 Sep 2007 — 2:54pm",
      "content": "I vote no - Veer merch is one of the few benefits of living in the US or Canada.\n\n"
    },
    {
      "time": "7 Sep 2007 — 2:55pm",
      "content": "\\>Just tell me what message you want on the placard :-)\n\nDon't forget it needs to be in English and French.\n\n"
    },
    {
      "time": "7 Sep 2007 — 3:03pm",
      "content": "\\>Just tell me what message you want on the placard :-)\n\nWhat with all this global warming, I'm petitioning that Canada's only official language be Inuktitut.\n\n"
    },
    {
      "time": "7 Sep 2007 — 3:11pm",
      "content": "Another vote for 'yes please, please, pretty please with knobs on'\n\n"
    },
    {
      "time": "7 Sep 2007 — 3:21pm",
      "content": "let's just petition to get TypeCon in Calgary and then you can all come and pick up all the Veer merch you want. :P\n\n"
    },
    {
      "time": "7 Sep 2007 — 3:23pm",
      "content": "\\>\\>Just tell me what message you want on the placard :-)\n\n\\>Don’t forget it needs to be in English and French.\n\nUh - Huh... That'll go down well in Calgary. :p\n\n"
    },
    {
      "time": "7 Sep 2007 — 5:17pm",
      "content": "I do feel the same way.\n\n"
    },
    {
      "time": "7 Sep 2007 — 5:35pm",
      "content": "name added to petition\n\n"
    },
    {
      "time": "7 Sep 2007 — 7:44pm",
      "content": "Hey KenBessie, my bad! make that North America not US;-)\n\n"
    },
    {
      "time": "7 Sep 2007 — 9:25pm",
      "content": "Endre: cheers! And good luck with your petition.\n\nBTW: I seem to recall Grant Hutchinson addressing this question in a previous thread. I'll search the archives.\n\n"
    },
    {
      "time": "7 Sep 2007 — 10:10pm",
      "content": "This from Grant in 2006, regarding the lack of Veer promo pieces in Europe:\n\n_...it’s a question of resources, but we are working on getting a more substantial marketing presence across the pond. Once we get a better grasp on how to get printed pieces into Europe efficiently, you’ll have many more lovely bits of paper in your mailboxes, I promise._\n\nDoesn't address Veer-merch, though.\n\n"
    },
    {
      "time": "8 Sep 2007 — 2:01pm",
      "content": "I'd love to oder some Veer stuff, so I'm in!\n\n"
    },
    {
      "time": "9 Sep 2007 — 9:56pm",
      "content": "Having made the decision to ship Typophile gear outside the US (since 40% of users are not in the US) I can understand Veer's decision. It is a) very expensive and b) hard to automate. When we ship gear it means somebody actually has to wait in line at a Post Office to fill out a customs claim form.\n\nSo, ahem, buy some [Typophile gear](http://web.archive.org/web/20131018144303/http:/typophile.bigcartel.com/) and we'll ship it to you no matter where you are... just don't be shocked if a $22 shirt costs $13+ USD to ship.\n\n"
    },
    {
      "time": "9 Sep 2007 — 11:14pm",
      "content": "My vote - Yes!!  \nBecause I would love to wear that \"TYGR TYPOGRAPHY\" jacket.\n\n--\n\n"
    },
    {
      "time": "9 Sep 2007 — 11:42pm",
      "content": "Joe; I'd gladly pay an extra 20 to get the stuff shipped and I think a lot of people are with me on this. How about I order Veer stuff with my Typophile order;-)lol\n\n"
    },
    {
      "time": "9 Sep 2007 — 11:57pm",
      "content": "Not to disrespect Veer, because their stuff is so worth the money, but I made my own KERN sweatshirt for $4.00 ... a dollar a letter, ironed on to my favorite zipper hoodie.\n\nSomebody asked me where Kern was just last week. :)\n\n"
    },
    {
      "time": "10 Sep 2007 — 5:37am",
      "content": "Making your own is all well and good but I think it's a matter of respect for the creator to buy the original;-)\n\nKern isn't that a city in Germany;-) lol\n\n"
    },
    {
      "time": "10 Sep 2007 — 10:22am",
      "content": "\\>I made my own KERN sweatshirt for $4.00 ...\n\nwe need to see a picture ;-)\n\n"
    },
    {
      "time": "10 Sep 2007 — 10:54am",
      "content": "Hey, why not. Everyone knows that businesses will do anything that is requested in a web petition.\n\n\\</sarcasm off\\>\n\n"
    },
    {
      "time": "11 Sep 2007 — 1:01pm",
      "content": "\\> When we ship gear it means somebody actually has to wait in line at a Post Office to fill out a customs claim form.\n\nYour shipping agent (Fedex, UPS, DHL, whomever) can handle customs clearances at both ends. Might cost a little extra, but it's worth it not to have the hassle. You (the shipper) still have to do any commercial invoices, export declarations, and certificates of origin, though. And don't forget those ITAR and USML forms and statements for the really good stuff.\n\n[Fedex ancillary clearance services](http://web.archive.org/web/20131018144303/http:/www.fedex.com/ancillary/go/service?pt=cl&lc=en_US&wcc=US&dc=us)\n\n"
    },
    {
      "time": "11 Sep 2007 — 1:11pm",
      "content": "\\> let’s just petition to get TypeCon in Calgary\n\nBest idea I've heard today!\n\nFor those wishing to have a KERN zip-up, I'll warn you that they're a snug fit. I love it though.\n\n"
    },
    {
      "time": "11 Sep 2007 — 1:38pm",
      "content": "Kern zip up a snug fit?!?  \nMaybe I shouldn't get it then! I would look like a can of sardines;o)\n\n"
    },
    {
      "time": "11 Sep 2007 — 2:00pm",
      "content": "Well, I have a mens large, and it's fits like a glove but I'm fairly tall and slender.\n\n"
    },
    {
      "time": "11 Sep 2007 — 2:03pm",
      "content": "I'm short and compact if that's an expression in english? ;o)\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:01pm",
      "content": "For those wishing to have a KERN zip-up, I’ll warn you that they’re a snug fit. I love it though.\n\nNo adjustable tracking, eh?\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:12pm",
      "content": "haha\n\nSomeone made a typographic joke;o) lol\n\n"
    }
  ]
}
