{
  "id": "369",
  "title": "Archive through June 01, 2003",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is there a true (or closer) version of Caslon available that is closer to the original Letterpress version? I am looking for something closer than Adobe's revival.   \n   \nI am still learning of the history behind these fonts I have been using for years. I am hoping that if there is a truer version of Letterpress Caslon that it may have more of an aged look to it.   \n   \nIf there is anyone who could shed some light on this it would be greatly appreciated.\n\n",
  "author": "kojo",
  "time": "25 Apr 2003 — 8:37am",
  "uid": "1683",
  "comments": [
    {
      "time": "25 Apr 2003 — 8:40am",
      "content": "Bigtime.   \n [http://www.hwcaslon.com/](http://web.archive.org/web/20131023140326/http:/www.hwcaslon.com/)   \n   \nhhp\n\n"
    },
    {
      "time": "25 Apr 2003 — 11:03am",
      "content": "ThanX! That is exactly what I was hoping for!   \n   \nAre there any other Foundries doing this kind of work you could suggest?\n\n"
    },
    {
      "time": "25 Apr 2003 — 11:13am",
      "content": "Nothing else close to that that I can think of.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Apr 2003 — 12:18pm",
      "content": "The Historical Fell Types from Hoefler are in much the same vein. From scans of the original specimens of the Fell Types, nubbly bits and all. The Fell Types Roman is one of my very favorite \"classical\" fonts.\n\n"
    },
    {
      "time": "25 May 2003 — 2:03am",
      "content": "If you are still looking for a good Caslon based on the original, less difficult to use then so far recommended, I suggest our own. This is based on a text size, approximately 11 on 12 pt. It won the pick in Publish Magazine when it came out. Beating Adobe Caslon.   \n   \n [http://www.lanstontype.com/CaslonFountEight.html](http://web.archive.org/web/20131023140326/http:/www.lanstontype.com/CaslonFountEight.html)\n\n"
    },
    {
      "time": "25 May 2003 — 12:00pm",
      "content": "I'd second this. Lanston's Caslon Oldstyle No. 337 is an exceptional face for use in letterpress printing. Very near an exact replication of the original Lanston Monotype at small text size.   \n   \nHowever, if one is looking for that faux \"letterpress look,\" ink-spread and all, this will prove a bit too refined. In this regard, Justin Howe's Founders Caslon would work better as it is based on specimen sheets and/or direct proofs, ink aberration and all.\n\n"
    },
    {
      "time": "27 May 2003 — 11:18am",
      "content": "I agree with what Gerald Lange is saying but I do not recommend that direction.   \n   \nAt least not without reading this page first.   \n   \n [http://www.lanstontype.com/CaslonATF.html](http://web.archive.org/web/20131023140326/http:/www.lanstontype.com/CaslonATF.html)   \n   \nThat page is my view on the much to often spoken of merits of ink smear.   \n   \nI worked in the letterpress industry for forty years. My work was fine book work and advertising productions. Few have actually worked with Caslon Oldstyle more than myself.   \n   \nI have never met Justin and believe me I am very impressed at the amount of work he must have put into Foundry Caslon.   \n   \nAlso I am aware that he commands great respect in this industry and I believe that it is deserved. And I wish I had a copy of Foundry Caslon myself.   \n   \nBut I do not believe type should be designed by an can of ink.   \n   \nI printed 33,000 copies of The Fount. This issue was dedicated to the production of Lanston's digital Caslon 337.   \n   \nThe text was set in the digital Caslon. Mixed in at random were seven lines set in the original hot metal Caslon Oldstyle.   \n   \nThe Caslon challenge was to identify which lines were genuine. I even wrote clues as to how to find them. No one did. And remember the lines of original Caslon should have had the mysterious\"ink smear\".   \n   \nWhich is merely bad presswork.   \n   \nA technique I did not use.\n\n"
    },
    {
      "time": "27 May 2003 — 2:27pm",
      "content": "Will you please clarify something for me, Gerald?   \nFor your issue of _The Fount_ with the Caslon challenge --   \nare you saying that you printed the issue by offset   \nlithography with the digital fonts and then ran the   \nsheets through letterpress for the intermixed lines of   \noriginal metal Caslon Oldstyle?   \n   \nOr was the whole issue printed letterpress, with the   \ndigital fonts plated to photopolymer and locked up with   \nlines of metal?   \n   \n-- Kent.\n\n"
    },
    {
      "time": "27 May 2003 — 3:23pm",
      "content": "Gerald   \n   \nI've read the discussion at your site with interest. One point of confusion about ink spread is that it is largely a twentieth century phenomenon. By this I mean it was rarely a concern before the revival period. Good printing was just good printing and poor printing was just poor printing. Moxon called heavy inking, \"fat.\" To reinforce your point about the aims of the punchcutter a blast from the past: Fournier suggested \"it is not right to blame the letter for the fault of the ink.\"   \n   \nOne of the problems in the ongoing current discussion is the thinking that early punchcutters must have worked with master drawings. There is no evidence of this to my knowledge. As foundries began to copy the work of other foundries, perhaps, but prior to the mid-eighteenth century I'd agree with your accessment about the intuitive organic quality of the work.   \n   \nAnother problem is that folks ignore the technology associated with the early revivals, that of the photograph. Prior to Wm Morris replications were direct from specimens, cut by hand. Morris was the first to use the photograph, and what he saw was ink-spread (unfortunately, he kind of liked it). All subsequent revivals using the photograph had to deal with the same problem.   \n   \nBut you mention Poliphilus. Later information on this is that it is not an exact replication with bumps and all but a \"flavored\" interpretation. Morison, once again, was lying. Beatrice Warde corrects this misconception in an article in the 1950s.\n\n"
    },
    {
      "time": "27 May 2003 — 10:29pm",
      "content": "Gerald,   \n   \nFounier is right on many things.   \n   \nI am sure if you read my murmerings, sorry for the length and tedium, you would suspect that I would not have worked from drawings, or if I did I would \"not\" have made them particularly accurate.   \n   \nIn other words I would not have paid them much mind. I am speaking of cutting by hand directly on metal. With a pantograph drawings and patterns are part of the system.   \n   \nExceptions. Louis reported that he was trained by a pantograph operator, I believe a woman, at English Monotype who demonstrated her particular skills at working with neither a drawing or a pattern.   \n   \nI distinguish remarkable from desirable.   \n   \nBut when I design I never work with layouts, so that is just my own method. Jim Rimmer on the other hand does exact layouts. I always wondered why the did not just shoot his layouts and run with them.   \n   \nIn both cases I still distinguish remarkable from desirable.   \n   \nYou would not want to do that with mine.   \n   \nIn the trade I was called, \"a designer in the stick\".   \n   \nYour comments on Morison lying is of interest, I have read an essay by my friend John Dreyfus about Polyphilus so you have me confused. Could you tell me more more about what Beatrice Warde's corrections.   \n   \nI would like to correct my writings.\n\n"
    },
    {
      "time": "27 May 2003 — 10:43pm",
      "content": "Gerald,   \n   \nFounier is right on many things.   \n   \nI am sure if you read my murmurings, sorry for the length and tedium, you would suspect that I would not have worked from drawings, or if I did, I would \"not\" have made them particularly accurate.   \n   \nIn other words, I would not have paid them much mind. I am speaking of cutting by hand directly on metal. With a pantograph drawings and patterns are part of the system.   \n   \nExceptions. Louis reported that he was trained by a pantograph operator, I believe a woman, at English Monotype who demonstrated her particular skills at working with neither a drawing or a pattern.   \n   \nI distinguish remarkable from desirable.   \n   \nBut when I design I never work with layouts, so that is just my own method. Jim Rimmer on the other hand does exact layouts. I always wondered why the did not just shoot his layouts and run with them.   \n   \nYou would not want to do that with mine.   \n   \nIn the trade I was called, \"a designer in the stick\".   \n   \nThe intent of my thoughts are that people find their own ways of working. So I suspect that both methods were used, some punchcutter designers probably found comfort in precise drawings as a guide, others worked in a more sculptural fashion. I know I would have worked in the latter. Some hand punch cutters in later periods used camera's to reduce the letterforms. Some developed methods to transfer photo images onto steel bars. My personal exposure to this was by method of acid etched image.   \n   \nCould you tell me more about what Beatrice Warde's corrections.   \n   \nI would like to correct my writings.\n\n"
    },
    {
      "time": "27 May 2003 — 10:50pm",
      "content": "Gerald,   \n   \nFounier is right on many things.   \n   \nI am sure if you read my murmurings, sorry for the length and tedium, you would suspect that I would not have worked from drawings, or if I did, I would \"not\" have made them particularly accurate.   \n   \nIn other words, I would not have paid them much mind. I am speaking of cutting by hand directly on metal. With a pantograph drawings and patterns are part of the system.   \n   \nExceptions. Louis reported that he was trained by a pantograph operator, I believe a woman, at English Monotype who demonstrated her particular skills at working with neither a drawing or a pattern.   \n   \nI distinguish remarkable from desirable.   \n   \nBut when I design I never work with layouts, so that is just my own method. Jim Rimmer on the other hand does exact layouts. I always wondered why the did not just shoot his layouts and run with them.   \n   \nYou would not want to do that with mine.   \n   \nIn the trade I was called, \"a designer in the stick\".   \n   \nThe intent of my thoughts are that people find their own ways of working. So I suspect that both methods were used, some punchcutter designers probably found comfort in precise drawings as a guide, others worked in a more sculptural fashion. I know I would have worked in the latter. Some hand punch cutters in later periods used camera's to reduce the letterforms. Some developed methods to transfer photo images onto steel bars. My personal exposure to this was by method of acid etched image.   \n   \nTo avoid confusion I am not saying \"the punch was cut by acid\", I am saying that is how \"the image was transferred\".   \n   \nCould you tell me more about what Beatrice Warde's corrections.   \n   \nI would like to correct my writings.\n\n"
    },
    {
      "time": "27 May 2003 — 10:58pm",
      "content": "Hermann Zapf recalls that the drawings he prepared for designs cut by hand August Rosenberger were generally much rougher than needed for machine cutting. He could rely on Rosenberger to accurately interpret his designs in metal. Industrial production required discreet design and manufacturing stages: division of labour. I believe the process of cutting type by hand was more holistic as is, in a very different way, the designing of digital type directly on the computer rather than on paper first.\n\n"
    },
    {
      "time": "27 May 2003 — 11:07pm",
      "content": "Kent, and Gerald,   \n   \nSorry, I am having problems with my server. Apparantly the electric fence is interfering. I don't know if I believe that or not.   \n   \nI see my posting have been repeated, disregard the first, the last is most up to date. I may not have the hang of this system of posting, as I am new to it. So it may even be my fault. Ludites.   \n   \nSorry in any event. The last is most accurate.   \n   \nBut Kent has asked a question.   \n   \nThe hot metal type was set, inked and printed on White Curtis Tweedweave Text.   \n   \nThe digital was set and \"output positive\", \"not negative\". The original lines were pasted in, the layout was shot on a camera. Plates were then burned. The press was run.   \n   \nSorry for the confusion.\n\n"
    },
    {
      "time": "27 May 2003 — 11:31pm",
      "content": "John,   \n   \nWell, yes, division of labour is certainly a factor.   \n   \nIn addition to the other aspects. Each mechanical typesetting machine required matrices, Linotype and Ludlow multiple matrices for each character. Monotypes only one.   \n   \nMore strikes, more breakage. Believe me, broken punches does not make for a happy schedule.   \n   \nGreat preparation and care was taken, precise drawings, solid patterns, punch cutting cards, skilled workers is what was required.   \n   \nProducing new matrices indistinguishable from the old required a method of reproducing exact punches.   \n   \nQuality drawings with fit and unit row considerations were included. Often the artwork was redrawn by the punchcutting department with close consultation of the originator.\n\n"
    },
    {
      "time": "28 May 2003 — 4:55am",
      "content": "Gerald -- Thank you for your explanation of the printing of the Caslon challenge. This is very instructive. Tell me, are there still any copies of this issue of _The Fount_ available?   \n   \n-- K.\n\n"
    },
    {
      "time": "28 May 2003 — 6:04am",
      "content": "Kent   \n   \nI am not sure you are aware, after my yacht and home sank in Seattle I moved to Finland with nothing except a Macintosh and cloths. The rest is stored in various places. I will ask my son to take a look at his place, my sister at hers. They live in British Columbia. If they remain in PEI that is a long term problem.   \n   \nI have the text in digital form in Finland. But the \"Caslon Challenge\" with the original Caslon is not included, naturally.   \n   \nWish I could be of more help.\n\n"
    },
    {
      "time": "28 May 2003 — 6:47am",
      "content": "Gerald and Kent   \n   \nKent I have answered above. I have since wondered if anyone would loan you a copy.   \n   \nGerald, I have made note of your comments about Beatrice Warde on my site.   \n   \n [http://www.lanstontype.com/CaslonATF.html](http://web.archive.org/web/20131023140326/http:/www.lanstontype.com/CaslonATF.html)   \n   \nThe text is long so I have isolated it, your quote is in orange. Perhaps you could see if this meets with your approval. It rankles me how comments by icons such as Morison gets horse-shoed into fact.   \n   \nI was a gullible 20 year old when I read that.\n\n"
    },
    {
      "time": "29 May 2003 — 12:59am",
      "content": "Gerald   \n   \nApologies. I've torn the library apart looking for the reference. No luck. This was a Bowater report I believe. The first use of microphotography in examining typefaces and the effect of different printing processes and different substrates.   \n   \nQuestion: Did not the master pattern effectively replace the punch? This would be crucial to an understanding of the discussion would it not?\n\n"
    },
    {
      "time": "29 May 2003 — 4:01am",
      "content": "Gerald   \n   \nPerhaps I will leave the text as it is now and add the possible reference.   \n   \nThe master pattern was the father of the cutting. All decisions were fossilized in the metal. That and the punch cutting cards.   \n   \nAmerican Type Founders sold the drawings, not all but most of them to Marder for $1000. ATF considered the drawings to be a storage problem. Not important to the maintenance of the library.   \n   \nThis is true. That is why we were satisfied digitizing using master patterns as source. Had we had the drawings we still would have used the master patterns.   \n   \nWith the master pattern and the punchcutting card nothing was missing in specifications to reproduce a new punch. Punches came and went at Lanston. Even more so at Linotype.   \n   \nThere is many interesting things to be found in those punchcutting cards. Dating typefaces for instance is a question, reminding me of ships. When is the boat built, when the keel is laid or when the vessel is launched? Sometimes there is decades of difference, in both boats and typefaces.   \n   \nSome very substantial questions about the history of type is in that single question. Which reminds me, did you look at?   \n   \n [http://www.lanstontype.com/BurgessSetting.html](http://web.archive.org/web/20131023140326/http:/www.lanstontype.com/BurgessSetting.html)\n\n"
    },
    {
      "time": "29 May 2003 — 10:05am",
      "content": "I am puzzled by the lack of agreement on the significance of ink spread or gain in properly inked letter press vs offset printing. And I am particularly interested in Caslon.   \n   \nLong a go when as a kid I did printing as a hobby on a letter press with foundry type, I was warned that overinking was more of a danger than underinking. But I have read that in any case the offset process inherently has less ink spread.   \n   \nI have an example of Caslon that I assume is originally letter press: a copy of Albert Einstein: Philosopher-Scientist. I love the 'color' and look of it. It is a '59 reprint of a '51 book. None of the digital Caslons that I have seen in print have the same look as this. It is as if the digital Caslons aren't the same typeface.   \n   \nI have looked at the Founders Caslon on line, and it looks a bit more crude in the small sizes than in the Einstein book. I haven't seen Founders Caslon in print or PDFs of it. Adobe Caslon, which I have, definitely looks very different. I don't know about Langston's Caslon 337; I didn't see an alphabet on your site. Can you display more, and are there books that you could refer us to?   \n   \nAnd what is fair to say about ink gain? That it exists but won't cause bumps with proper inking?\n\n"
    },
    {
      "time": "29 May 2003 — 12:14pm",
      "content": "William   \n   \nCaslon has historically baffled typefounders.   \n   \nThere were lively \"letterpress discussions\" on this very type face in the \"turn of the last century\". Founders were trying to figure out why their customers did not take to their cuttings. The customers wanted the \"real thing\".   \n   \nLanston made several other attempts to cut Caslon, 37, 127, (447 display cutting for Caslon 337). And we cut others. One of them we offer in our catalogue. Listen to this. In the hot metal days we were trying to put the ink on!   \n   \nWant to buy it? We sell it as Caslon Bold!   \n   \nI can assure you if you like Caslon it is not because of bumps.   \n   \nYou won't like our bold either.   \n   \nHave you guys ever thought about Letterpress? It does look mighty good. But not because of the bumps.   \n   \nSpeaking of Einstein, have you heard of wavicles? It goes something like this. If you look for a wave you find particles, if you look for a particle you find waves.   \n   \nHave you ever wondered why you like letterpress Caslon best? Then you try to find out why and all of a sudden it looks faulty, all bumpy, ink spreading all over the place. Then, someone thinks they have found the mystery and imitates all the bad things and wonders why it looks terrible.   \n   \nIf you look for the good you find the bad.   \n   \nOK, had to get the dig in. Letterpress rocks.   \n   \nI am moving so I will not be on line for a day or two. I will try to be more helpful.\n\n"
    },
    {
      "time": "1 Jun 2003 — 11:42am",
      "content": "\\> \"ink smear\" ... is merely bad presswork.   \n   \nIt's not so simple.   \n   \nSince letterform fidelity is only one factor in printing (along with paper stock, output technology, and a bunch of other things) gain is above all else a _reality_. Although it's easy to make it minimal in offset work, it requires exceptional circumstances to avoid it in letterpress - generally only type designers will care enough to preseve the letter shapes. And _that's_ only if they haven't already included gain compensation into the design!   \n   \nFurthermore, at smaller sizes gain isn't just mechanical, it's also optical: the lc \"r\" for example benefits notably from an unusally deep cut between the arch and the stem, in smaller sizes.   \n   \nSo designing for gain is generally smart, and sometimes indispensable.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Jun 2003 — 12:35pm",
      "content": "\\>It's not so simple.   \n   \nHrant's summary seems to be similar to what emerged in the earlier thread discussing metal vs digital Electra.   \n   \nHowever, there has been a century of reworking Caslon, and, I believe, been only one digital shot at Electra. [Incidentally, I am just finishing reading a book in digital Electra - a pale and pathetic look compared to the book I have printed from metal Electra, which is beautiful.]   \n   \nSomething besides letterpress vs digital is going on. I looked in my old type books and found that the Einstein book in metal Caslon that I like [above] is Mergenthaler Linotype Caslon Old Face. \"Types of Typefaces\" by my late Uncle J. Ben Lieberman has Mononotype's metal Caslon 337 in a text block set 10/11. It is lighter than the Linotype Caslon, and to me a little too light (as John Hudson said of the Langston digital, to Giampa's protestation). 337 does have a lot of the Caslon magic, though. Ludlow True-Cut Caslon, which \"Types of Typefaces\" shows a larger size partial alphabet of, has even more.   \n   \nI am convinced that a lot of the magic has to do with deliberate 'irregularity' that the remakes iron out. I guess nobody has yet figured it out, as Giampa says. Adobe Caslon is a good typeface, but doesn't have 'it'.   \n   \nI'd be interested in people's speculation on the source of the Caslon magic.\n\n"
    },
    {
      "time": "1 Jun 2003 — 12:48pm",
      "content": "\"I am convinced that a lot of the magic has to do with deliberate 'irregularity' that the remakes iron out. I guess nobody has yet figured it out, as Giampa says. Adobe Caslon is a good typeface, but doesn't have 'it'.   \n   \nI'd be interested in people's speculation on the source of the Caslon magic.\"   \n   \nI believe that the concern may have been less a focus on the integrity of individual letterforms than they way the letterforms would function in text setting. I recall reading about an attempt to create a woven pattern to the text. Caslon certainly does have a more \"valid\" look in text setting than in display where it more singularly reveals its \"old style\" design characteristics.\n\n"
    },
    {
      "time": "1 Jun 2003 — 12:52pm",
      "content": "Some people say the \"magic\" is the actual physical impression: the so-called \"tactile\" feeling missing in offset. Others say it's the irregularity - which makes me note that there are two kinds of that: true instance randomness, versus the \"rough\" look that digital fonts like Founder's Caslon use.   \n   \nI think that -just maybe- the truth is somewhat of a combination of such things: that the magic is due to a \"softer\" border between foreground and background - contemporary offset might very well be simply too sharp for human preference. Which is why I've proposed a few times before that somebody unfocus the laser in an imagesetter (by a subvisible amount), and see what happens...   \n   \nhhp\n\n"
    },
    {
      "time": "1 Jun 2003 — 1:10pm",
      "content": "Hrant   \n   \nBut this would hold true for all letterpress printed faces then would it not? not just Caslon.   \n   \n   \nWilliam   \n   \nIn regard to my previous comment, I think it should be remembered that in Caslon's time there was very little, if any, consideration for display.   \n   \nTypefaces were used primarily in bookwork and the idea of typography as we think of it today simply wasn't in place. Generally all the Dutch style faces from this period of time, and the later Scotch, even as used today, are considered more as \"work horses\" than pretty letterforms.\n\n"
    },
    {
      "time": "1 Jun 2003 — 1:18pm",
      "content": "Yeah, and not just letterpress either, but phone books and even newspapers, etc.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Jun 2003 — 4:05pm",
      "content": "\\>\"softer\" border   \nI read your theory in other threads. 'Soft focus' in photography definitely has a pronounced effect, so there may be something in it. But I don't think this is the main thing about Caslon in particular.   \n   \n\\>a woven pattern ...a more \"valid\" look in text setting than in display ...more as \"work horses\" than pretty letterforms.   \n   \nVery interesting. I think you definitely have something. What I love about the example of Caslon in the Einstein book is precisely the pattern or texture of the type.   \n   \nMy next question would be what did the Dutch and then Caslon - Caslon perhaps has it more - do to sacrifice elegance of letter form to get greater readiblity or friendliness of the text setting? Bringhust mentions that the \"Baroque\" types have an irregular stress. For example the o is vertical, but the b angled old style. And of course there is greater thick thin contrast than in the older Garamond.   \n   \nI am wondering whether part of this might be because it is more forgiving to irregular inking, pressure, wear and tear, etc. - following up on your 'workhorse' idea.\n\n"
    }
  ]
}
