{
  "id": "36906",
  "title": "Can technical advances open up for a proper dyslexia typeface?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Several designers have tried in the past, myself being one of them; to create a typeface which would aid people with dyslexia (see for instance [www.readregular.com](http://web.archive.org/web/20080907153004/http:/www.readregular.com/ \"www.readregular.com\") ). However no one typeface has been able to address the problems. Why? Because Dyslexia is a term for a number of different reading disabilities and combinations of these. There are thousands.\n\nMy questions are many:  \n(knowing too little of the possibilities of Open type and what the next step in evolution is)  \nHow many alternates can we have to each character in the alphabet in Open type and what limits it to this number? How can we get beyond this? Could a typeface be preference based with individual settings for each user or is the best way to go about this creating a programme which renders each character in the alphabet based on a set of questions for the user? (Programs rendering type without the skilled eye of a type designer is a terrible thought but I’m here just trying to find possible ways to combat the problem - then after we’ve found a solution that actually works we can work on the aesthetics,-)\n\nAny ideas you guys?\n\n [‹ minor a](http://web.archive.org/web/20080907153004/http:/www.typophile.com/node/37067 \"Go to previous forum topic\") [Type exhibition - looking for lenders ›](http://web.archive.org/web/20080907153004/http:/www.typophile.com/node/36998 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907153004/http://www.typophile.com/user/16177\" title=\"View user profile.\">Endre Berentzen</a>",
  "time": "<br>",
  "uid": "16177",
  "comments": [
    {
      "time": " 8.Sep.2007 9.14am",
      "content": "_How many alternates can we have to each character in the alphabet in Open type and what limits it to this number?_\n\nThe format allows tens of thousands of glyphs in a font, so there are potentially more than enough for every character of the alphabet.\n\nHowever, the choice of stylistic sets occurs as a typesetting choice — it’s not in the document “reader” available to the end user.  \nTherefore, a practical system would have a variety of different fonts, for different kinds of dyslexia, which the reader could choose from in the Preferences menu of, for instance, Safari. So this would work better in a dynamic online environment, rather than with PDF documents.\n\nBut, if end users download a text file into a program such as Word, then they can set and print it in \\*their\\* optimal font.\n\n_Could a typeface be preference based with individual settings for each user or is the best way to go about this creating a programme which renders each character in the alphabet based on a set of questions for the user?_\n\nThe foundry could provide a series of fonts geared to different kinds of dyslexia.\n\nBut doesn’t this situation exist already?  \nAren’t there a kazillion fonts available, and can’t readers simply choose the one that works best for them?  \nWhy do advocates try to start from scratch rather than analyzing and exploring the typefaces that already exist?  \nWhy not do research that categorizes different forms of dyslexia, and find the typefaces that works best for each?  \nAnd only then attempt to refine those “best practice” solutions.\n\n"
    },
    {
      "time": " 8.Sep.2007 12.11pm",
      "content": "It seems to me that technology could probably help here, not so much by creating fonts with letters that remain recognizable when altered, but by altering the entire display to compensate for the common problems faced by dyslexic readers. 3D acceleration could dynamically distort the screen in a way that compensates for a reading disability. Users could even dynamically alter their distortion method on the fly, and save profiles for a methodology that works best for them.\n\n"
    },
    {
      "time": " 8.Sep.2007 9.56pm",
      "content": "Granted some fonts are more difficult to read. Because any visual difficulties are in fine detail the size of the font can be more important. Most dyslexics really have no visual problems as far as reading print. Most problems are in fact word processing problems unrelated to vision.\n\nI sell See Right Dyslexia Glasses that are able to remove all visual distortions that make reading diffficult for visual dyslexics. More info at dyslexiaglasses.com.\n\nWhen doing my research I found that the majority of dyslexics will respond that they see a page of print in a clear, stable, focused and uniform manner.\n\nThe idea that there are problems that are common to all dyslexics doesn’t seem to fit the current data. Reading is a complex process that needs to have many different factors all work properly. Failure of any factor can result in reading difficulties that can be classified as dyslexia. Visual problems are only one factor in dyslexia and affects a minority of dyslexics.\n\nA major problem for dyslexics is trying to determine what will help them read better when almost all treatments claim to help all dyslexics. I limit my claim so that it is always true. I claim that for the dyslexic that can describe a visual problem that makes reading difficult the See Right Dyslexia Glasses will remove that problem.\n\nThe reason some visual dyslexics are not identified until the third grade is that is when the print size is reduced.  \nDyslexics who find they do not have problems reading billboards are more likely to be visual dyslexics. Dyslexics that have their normal reading problems reading billboards are more likely to have language processing problems.\n\n"
    },
    {
      "time": " 9.Sep.2007 2.26am",
      "content": "Endre,  \nI’m just curious: Can you give an example how a letter should be designed for two different types of reading disabilities?  \nI always like to believe that legibility/readability affects everybody the same. I find it hard to believe, that a special typeface for dyslexics is helpful, when every other typeface they see in their environment is designed differently. But I have no experience in this field whatsoever.\n\n"
    },
    {
      "time": " 9.Sep.2007 5.53am",
      "content": "[A possible lead](http://web.archive.org/web/20080907153004/http:/www.robsfonts.com/fonts.html)\n\n"
    },
    {
      "time": " 9.Sep.2007 5.57am",
      "content": "Sorry guys, I’m a bit on- and offline at the moment (problems with my broadband)\n\nNick: There are a kazillion fonts available but I still think you’ll be lucky to find one that addresses all the issues for a dyslexic individual.\n\nOne solution could be choosing characters from different typefaces for reading purposes but this would totally ignore the aesthetics of the copy. Would it not be an advantage to make this look like one cut? (Kids are brutal and will bully the ones that stand out - with one software which rendered the best font individually (on their OLPC) for (all) the kids in the classroom bullying would not be a problem;-) Also one could adjust contrast in the type, colour of type and background and all the other aspects which are important for the legibility.\n\nTo take you all back a step one needs to look at the dyslexic brain: In the dyslexic brain there are more connections (hence shorter distance for a thought) between the literal and lateral side of the brain. The reading difficulties are indeed like Hayes says in the word processing. It is whether the brain understands the word as a word (literal) or a shape (lateral). Whether the word is understood as a word/shape or just individual characters/shapes. The main problem for dyslexics is that they use both sides of the brain and while one day the word dog can be read as dog (literal) the next it might be god (letter reversal - litteral meets lateral - read as a word but confused with the shapes of d and the g which unfortunately in that alphabet was the exact same shape only flipped). The third time the dyslexic reads the word it is confused as cat (read as dog from the literal side moved to the lateral and comes out as dig - dogs dig for bones). The potential to make unusual connections is why we find a large number of dyslexics in the creative fields 15-20% unlike 10% in the rest of the workforce.\n\nRalf: The strokewidth might vary from one reading disability to the other depending on how much contrast between the white and black spaces that reader needs. That comes down to whether the brain in question reads the letter by the outside shape or the spaces in between. This is just one of many examples - to many;-)\n\nThe glasses Haynes are talking about work for some of the problems related to reading like jumping back and forth between words and lines by stopping the flickering of the page. My brother used similar technology with a coloured sheet of transparent plastic placed over the text he was to read. The colour was determined by a specialist through trial and error.\n\n“The idea that there are problems that are common to all dyslexics doesn’t seem to fit the current data. Reading is a complex process that needs to have many different factors all work properly. Failure of any factor can result in reading difficulties that can be classified as dyslexia. Visual problems are only one factor in dyslexia and affects a minority of dyslexics.” Absolutely right. I never said otherwise. That’s why a software which had to be individually set up could be one solution. I think James might be on to something.\n\n"
    },
    {
      "time": " 9.Sep.2007 6.01am",
      "content": "This was me being dyslexic; “The third time the dyslexic reads the word it is confused as CAT (read as dog from the literal side moved to the lateral and comes out as DIG - dogs dig for bones)”. Where the h@\\*l did CAT come from;-)\n\n"
    },
    {
      "time": " 9.Sep.2007 6.06am",
      "content": "Nick: “Why not do research that categorizes different forms of dyslexia, and find the typefaces that works best for each?”\n\nThere are simply to many combinations possible (dyslexia being a combination of different reading disabilities). We are talking almost infinite possibilities here.\n\n"
    },
    {
      "time": " 9.Sep.2007 10.27am",
      "content": "Endre, I’m talking about methodology.\n\nIt seems to me that it is somewhat unscientific of dyslexic-typeface designers to start from scratch designing _their_ typeface solution from _their_ theory of what the letter shapes should be in order to address _their_ understanding of what constitute the functional abnormalities of those with reading difficulties.\n\nOf course, there is nothing wrong with publishing one’s own design to address particular design criteria, but surely science calls for a more systematic and objective approach.\n\nI don’t recall ever seeing a variety of alternates being performance-tested as part of such a typeface development.  \nAnd where are the stats comparing preferences and performance between dyslexic-typefaces and normal ones?  \nGoodwill is no substitute for a rigorous design process.\n\nIt has become axiomatic, if not a cliche, that dyslexic typefaces have non-symmetrical b and d, and a single-storey a and g.  \nThat seems odd, as Futura is not known as a legibility face. OK, maybe it needs to be run through the Comic Sans filter ;-)\n\nComparing Lexia with Read Regular, both presented as dyslexic faces, there is a huge difference.  \nRead Regular conforms to the theory that dyslexic readers have trouble with serifs, so keep it clean.  \nYet Lexia adds all kinds of gimmicks to maximize differentiation of letterforms, a different theoretical requirement.\n\nIf dyslexic-reading theory holds any water (i.e. is any different from the discussions typophiles have about typeface Legibility and Readability for normal readers), they can’t both be correct!\n\n"
    },
    {
      "time": " 9.Sep.2007 10.58am",
      "content": "Nick, I’m absolutely with you that ones own theory is not sufficient for creating a typeface. We need hard facts from scientific studies to even see if it is plausible to find a solution. Nevrologists, psychologists, opticians etc pluss a huge focus group needs to come onboard for this to have any relevance in the big picture. Anything else becomes naive and was the reason why I discarded this project for my thesis.\n\nI’m speaking about a possible future here where software and typedesign meets and generates the optimal typeface for the users readability (after the proper research has been done - if it ever will) (dyslexia harms 10-12% of the worlds population and one typeface will probably never fix this problem - even if everyone read the same language - with similar combinations of letters would one typeface probably not be able to solve the question)\n\nI see my topic was way of here. Something like this would probably be better: Do you believe technical advances in software and potential automatic font generation can solve the problem with reading for people with dyslexia?\n\n"
    },
    {
      "time": " 9.Sep.2007 10.59am",
      "content": "Nick, I’m absolutely with you that ones own theory is not sufficient for creating a typeface. We need hard facts from scientific studies to even see if it is plausible to find a solution. Nevrologists, psychologists, opticians etc pluss a huge focus group needs to come onboard for this to have any relevance in the big picture. Anything else becomes naive and was the reason why I discarded this project for my thesis.\n\nI’m speaking about a possible future here where software and typedesign meets and generates the optimal typeface for the users readability (after the proper research has been done - if it ever will) (dyslexia harms 10-12% of the worlds population and one typeface will probably never fix this problem - even if everyone read the same language - with similar combinations of letters would one typeface probably not be able to solve the question)\n\nI see my topic was way of here. Something like this would probably be better: Do you believe technical advances in software and potential automatic font generation can solve the problem with reading for people with dyslexia?\n\n"
    },
    {
      "time": " 9.Sep.2007 10.59am",
      "content": "Nick, I’m absolutely with you that ones own theory is not sufficient for creating a typeface. We need hard facts from scientific studies to even see if it is plausible to find a solution. Nevrologists, psychologists, opticians etc pluss a huge focus group needs to come onboard for this to have any relevance in the big picture. Anything else becomes naive and was the reason why I discarded this project for my thesis.\n\nI’m speaking about a possible future here where software and typedesign meets and generates the optimal typeface for the users readability (after the proper research has been done - if it ever will) (dyslexia harms 10-12% of the worlds population and one typeface will probably never fix this problem - even if everyone read the same language - with similar combinations of letters would one typeface probably not be able to solve the question)\n\nI see my topic was way of here. Something like this would probably be better: Do you believe technical advances in software and potential automatic font generation can solve the problem with reading for people with dyslexia?\n\n"
    },
    {
      "time": " 9.Sep.2007 11.02am",
      "content": "Sorry.. the page froze and when it got back I had three copies of my last reply. Anyway I can delete them?\n\n"
    },
    {
      "time": " 9.Sep.2007 11.47am",
      "content": "_Do you believe technical advances in software and potential automatic font generation can solve the problem with reading for people with dyslexia?_\n\nIronically, that technology is obsolete — multiple master.  \nIt is possible to design a metafont (eg multiple master), which users can “tune” to their liking by adjusting sliders that control various design axes, eg:  \n-extender length  \n-x-height  \n-contrast  \n-serif size  \n-and even things like p/d/q/b divergence.\n\nBut is that really much different than finding a typeface that already has the combination of these “settings” that one finds most readable?\n\nThe practical problem is implementing that at the user/reader level, rather than at the expert-typographer level.\n\n"
    },
    {
      "time": " 9.Sep.2007 12.38pm",
      "content": "I think you are thinking to lateral here Nick;-) You’re not a dyslexic I guess;-)lol\n\nIndeed MM fonts allows you to adjust settings within a typeface. But a dyslexic person might need some characters from several families, a serif, some from a sans, some uppercase and some lowercase. A combination of fonts and families rather than adjusting an existing typeface with possibilities still within a specific range.\n\nI agree that the practical problem is implementing at the user/reader level rather than at the expert-typographer level. Do you know of any research here or is it non-existing?\n\n"
    },
    {
      "time": " 9.Sep.2007 12.43pm",
      "content": "I meant literal of course! Damn those letters/words;-) lol\n\n"
    },
    {
      "time": " 10.Sep.2007 10.23am",
      "content": "I designed a dyslexic-targeted typeface as my undergraduate thesis, and came to the conclusion that it’s not too likely that the type and/or design industry, as it’s currently set up, can solve this problem. To really test it in a scientific way, you would need to fully develop maybe a dozen full typefaces that addressed various aspects of dyslexia, and then test them on a sampling of thousands. This would also need to be done in conjunction with neurologists, psychologists, reading experts, etc. Otherwise, I don’t know how meaningful the results would be.\n\nThe way I look at it, all the typefaces designed for dyslexia are a good start, and have at least started a dialogue about how type designers can be involved in the solution. I think the key word there is “involved” — we may be problem solvers, but we’re not scientists. If there ever is any real typographic solution to this problem, which I think there very well could be in the future, it will be the result of a team of experts, mostly in the field of psychology, and the type designer(s) will play a very partial role.\n\nAs far as my particular take on addressing dyslexia with a typeface:\n\nMy project addressed the orthography of English, rather than just the letter forms. A number of studies have shown that dyslexia is a genetic condition, and is fairly constant through most populations of the world, but various languages are associated with higher degrees of problems related to dyslexia. Spanish and Italian, for instance, have a very regular orthography, at least in comparison to say English or French, so dyslexia tends to be less of a problem, and children have actually been shown to attain reading skills faster. My solution was to take some of the most troublesome letter pairs in English (double vowels and consonants, for example) and create contextual alternates in OpenType for these pairs. Rather than trying to reinvent the wheel like ITA, these letter pairs were just slightly differentiated. Aesthetically, I synthesized features of Sassoon, Read Regular, and the wideness of Avenir.\n\n"
    },
    {
      "time": " 10.Sep.2007 10.26am",
      "content": "One more note on this:\n\nI think it will be a while before there’s a real typeface developed that actually substantially helps dyslexic readers. If someone was a brilliant marketer, however, they could probably make a killing in the educational software world, even if they had little or no research to support their claim.\n\n"
    },
    {
      "time": " 10.Sep.2007 5.21pm",
      "content": "Josh: I agree with what you are saying. It seems our findings at undergrad level and thoughts about the future are pretty similar. It’s interesting what you are stating about different languages. On a personal level I can support this claim. My brother and I, both Norwegians, read and write english a lot better than Norwegian (even considering my brother has never lived in an english speaking country and I only 5 years out of 32).  \nI’m learning turkish at the moment, I’ll let you know how that is in comparison later on;-)\n\n"
    },
    {
      "time": " 11.Sep.2007 12.18pm",
      "content": "One idea that struck me while reading this is the possibility of highlighting words, perhaps by using a light background color.\n\nIn current technology it could be done by switching words with the left/right keys.  \nIn the future, a camera with the ability to see the point on the screen a reader is looking at might do the same.\n\n"
    },
    {
      "time": " 11.Sep.2007 1.42pm",
      "content": "Interesting idea Frode Frank! I’m not sure it would solve something or further confuse the dyslexic reader though. I would have to see some research done into the subject matter first. Interesting idea none the less!\n\n"
    },
    {
      "time": " 11.Sep.2007 3.10pm",
      "content": "Interesting link posted by Nick that touches on some research linked to reading:  \n [http://typophile.com/node/36952](http://web.archive.org/web/20080907153004/http:/typophile.com/node/36952 \"http://typophile.com/node/36952\")\n\n"
    },
    {
      "time": " 13.Sep.2007 12.15pm",
      "content": "I think there is an opportunity here for a test of dyslexia typefaces and the theories behind them using multiple style sheets and a technology like [sIFR](http://web.archive.org/web/20080907153004/http:/www.mikeindustries.com/sifr). Using the interweb and some good networking you could truly test a very large group of people crossing numerous types of dyslexia and dyscalculia, as well as societal and geographic boundaries.\n\nUsing this technology is also a potential solution to your original question. But I do agree with Nick that the theories behind the current typeface selections seem to be closer to suppositions, and not truly tested (at least not very widely).\n\nCombining the test with an online community might be a good “open source” approach to the problem, with the ability to involve all the various experts that would be needed.\n\nLet me know what you think, I’d love to help.\n\n"
    },
    {
      "time": " 13.Sep.2007 12.38pm",
      "content": "Definetly interesting Arthur! I don’t know if I’d know where to start getting a hold of all the people needed to do such a study. I just know they are not in my network at the moment;o) You are speeaking way over my knowledge level but seem to know what you are talking about. I’m not a technology wiz which is why we’ll need somone like you in the team. One things for sure neurology and psychology would have to be a part of the focus group/forum participants.\n\nLet’s stay in touch. Now I gotta get back to this design;o)\n\n"
    }
  ]
}
