{
  "id": "36911",
  "title": "atrocious abc subway ads",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "alright, i need to vent.\n\nawful advertisements are not new to new york. but i just can’t imagine the a-hole exec that said “yeah, it’s fine and everything, but we really want those special g’s, you know, the ones with the two circles? yeah, make them like that.”\n\nhere’s an example of one (someone else’s flickr): [http://www.flickr.com/photos/rhcooper/1342938354/](http://web.archive.org/web/20081202033613/http:/www.flickr.com/photos/rhcooper/1342938354/ \"http://www.flickr.com/photos/rhcooper/1342938354/\")\n\nif i’m not mistaken, that’s a Trebuchet two-storey g f-ing pasted right into Conduit.\n\nIT’S TWO DIFFERENT oh my god. you don’t need to know anything about weight and proportion to see that this is a monstrously awful idea. what self-respecting typographer could allow this to happen.... not to mention that it’s AWFULLY similar to Interstate, which cbs has been using for quite some time now....\n\nthis brings me to my point: i’m new to the field, and haven’t had much experience. i’m sure abc has different tiers of in-house designers who assign effort based on the importance of the work... i guess. but this is their branding typeface, we’re supposed to understand it as abc’s voice when we see it, no?\n\nmy question: has this kind of crap ever happened to you? what kind of people are responsible for saying “No, I want THIS” and completely farting everything up in this fashion?\n\ni have to prepare myself to meet this head-on, because this isn’t the FIRST time i’ve thought to myself “um, what were they thinking...” when I looked at a corporate ad....\n\n [‹ Faithful revivals from early printed pages](http://web.archive.org/web/20081202033613/http:/www.typophile.com/node/17260 \"Go to previous forum topic\") [TypeCon2008 Buffalo Town Hall Meeting, Tues., Aug. 21 ›](http://web.archive.org/web/20081202033613/http:/www.typophile.com/node/36129 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202033613/http://www.typophile.com/user/21546\" title=\"View user profile.\">nkwiatek</a>",
  "time": "<br>",
  "uid": "21546",
  "comments": [
    {
      "time": " 8.Sep.2007 12.17pm",
      "content": "_if i’m not mistaken_\n\nIt happens to the best of us.\n\n"
    },
    {
      "time": " 8.Sep.2007 12.21pm",
      "content": "The type in the sample isn’t Conduit (which DOES have a two-storey g, so who would want to REPLACE that) and the g isn’t from Trebuchet. I think this IS ONE typeface and you’re hallucinating.  \nApart from that you’re right about the quality of typography or design in general in advertising. Most of the time it isn’t all that great.\n\n"
    },
    {
      "time": " 8.Sep.2007 12.29pm",
      "content": "ouch. you’re right about conduit, i didn’t look hard enough. maybe it’s some kinda DIN — or i guess it’s gotta be one typeface then?\n\nbut i could have sworn while staring at these things in the subway that the g was of a different face; it’s hard to tell from the sample but it looks SO out of place.\n\nany ideas on what that main typeface could be?\n\n"
    },
    {
      "time": " 8.Sep.2007 12.39pm",
      "content": "The “g” looks odd to me too.\n\n"
    },
    {
      "time": " 8.Sep.2007 1.03pm",
      "content": "what else? trajan.\n\n[http://www.veer.com/ideas/etched/](http://web.archive.org/web/20081202033613/http:/www.veer.com/ideas/etched/ \"http://www.veer.com/ideas/etched/\")\n\n"
    },
    {
      "time": " 8.Sep.2007 2.16pm",
      "content": "This is actually a completely atrocious typeface named “Aaux”  \n [http://www.typetrust.com/fonts/font.php?id=MzE5&fontview=charset&stylewt...](http://web.archive.org/web/20081202033613/http:/www.typetrust.com/fonts/font.php?id=MzE5&fontview=charset&stylewt=MzUw \"http://www.typetrust.com/fonts/font.php?id=MzE5&fontview=charset&stylewt=MzUw\")\n\nJN\n\n"
    },
    {
      "time": " 8.Sep.2007 2.28pm",
      "content": "i was talking about the main head type.  \n but you’re right, i think on the sans serif being aaux instead of a mixture of faces.\n\n"
    },
    {
      "time": " 8.Sep.2007 3.18pm",
      "content": "Mr. Groth, you should probably read the original post, which says, “if i’m not mistaken, that’s a Trebuchet two-storey g f-ing pasted right into Conduit.”\n\nActually, Mr. Kwiatek was not not mistaken, and Conduit/Trebuchet typeface is actually a single typeface, in this case “Aaux”.\n\nThe other typeface is Trajan, as you say.\n\nJN\n\n"
    },
    {
      "time": " 9.Sep.2007 2.20am",
      "content": "I have a mental picture of Aaux’s creator thinking ’I really like Din/Conduit, but I’m also a big fan of the Trebuchet lower case g...’\n\n"
    },
    {
      "time": " 9.Sep.2007 9.31am",
      "content": "_’I_\n\nUse double quotes (U.S. English style) — Smarty Pants is set up to use quoteleft for apostrophes.\n\n"
    }
  ]
}
