{
  "id": "3691",
  "title": "Rockoil Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi Everybody,   \n   \nThis is a logo I'm working on for a technology company which primary focus was the oil industry, hence the name Rockoil (petroleum). Now they don't want to be exclusively associated with the oil industry anymore, as the technological solutions they provide can serve to many other clients.   \n   \nThe company actually represents 2 other big international companies, which fields are satellite-positioning systems, and \"clean\" technologies for industrial cycles (water purifying systems, etc.)   \n   \nComments would be much appreciated! :-)   \nThanks,   \n   \nRafael Iskin ![rockoil logo](http://web.archive.org/web/20131023204354im_/http:/www.typophile.com/forums/messages/29/28913.gif)\n\n",
  "author": "iskin",
  "time": "19 Mar 2004 — 10:55am",
  "uid": "3251",
  "comments": [
    {
      "time": "19 Mar 2004 — 11:41am",
      "content": "Aloha Rafael!   \n   \nIf they want to downplay the oil association, I would decrease the size of the type in relation to the mark and reposition the mark to the left so it is the first read.   \n   \nThe mark has a fresh, clean look that goes well with \"clean\" technologies, and the blue/green color scheme seems to make an association for GPS. Well done.   \n   \nI may catch some flack for this here, but I think a dark gray would go better with the mark than the black type.\n\n"
    },
    {
      "time": "19 Mar 2004 — 1:22pm",
      "content": "Hello Scott and Tiffany, thanks for the comments! :-)   \n   \nI do have an horizontal version of the logo, and I'm using it in some applications (see the business card).   \nMaybe the horizontal is really better, but I still tend to keep the vertical for some instances.   \n   \nI chose the proportion of the mark/logotype based on the horizontal version, see that the horizontal \"arrows\" match the caps height of the logotype (and they in fact refers to the \"K\").   \n   \nI liked the suggestion of using gray in the logotype, but I am still not sure, doesn't it makes the logo too bright?   \nI like the contrast of the black, but also, if I print the business card in serigraphy I would have to set the type in gray as well to avoid one more printing color, and I'm not so sure it will work.   \n   \nWell, what do you think? ![horizonral-rockoil](http://web.archive.org/web/20131023204354im_/http:/www.typophile.com/forums/messages/29/28935.gif)\n\n"
    },
    {
      "time": "19 Mar 2004 — 1:27pm",
      "content": "Can you make a cross between a diamond and a black drop? Or what about a bitmappy drop (implying digital), or a drop with crosshairs (as in satellite positioning)? Although that last one might be too evocative of US foreign policy...   \n   \nhhp\n\n"
    },
    {
      "time": "19 Mar 2004 — 1:42pm",
      "content": "Hi Hrant,   \n   \nYour comment has worth it for the last joke! :-D   \nBut as I said, the idea is to de-emphasize the oil thing...\n\n"
    },
    {
      "time": "19 Mar 2004 — 8:26pm",
      "content": "I definitely like the horizontal orientation better. Have you tried a darker gray? Maybe a gray that is as dark as the blue.   \n   \nThe type on the bizcard looks a little tight to the bottom edge of the card. I guess it'll be OK if you are confident in the trimming accuracy of your vendor.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "19 Mar 2004 — 9:17pm",
      "content": "I like the horizontal version, maybe with a darker gray.   \nI still see \"oil\" in the name though. The second \"O\" is maybe too visible. What about enlarging the first letter? It would read more like one word.\n\n"
    },
    {
      "time": "21 Mar 2004 — 10:51am",
      "content": "Here goes the dark gray version, I really like it.   \n   \nAnd you are right about the card Scott, I posted an old (and wrong) version of it, despite the trimming problem the type on the bottom is disturbing.   \n   \nAs to the \"Oil\" problem Bernard, well, if they didn't want \\*any\\* association with it they would have to change the company's name. That's not really the case.   \n   \nI have tried a larger first letter but I don't think it worked. The concept of the logotype is based in the repetition of forms, and I prefer the way it is now because the \"R\" relates more to the \"K\" and to the mark.   \n   \nActually, when I posted I was wiling to hear more thoughts about the type.   \nWell, I guess that in a \"crystal-goblet\" way, no news is good news no? ;^)   \n(oh, why did I mentioned it now?)   \n   \nThanks everybody, that was my first post here in typophile!   \nYou will be seeing me around from now on!\n\n"
    },
    {
      "time": "21 Mar 2004 — 12:04pm",
      "content": "I definitely like that gray better than the black or the lighter gray. It's still strong enough for a corporate logo, but doesn't produce such a stark contrast as the black.   \n   \nAloha!\n\n"
    },
    {
      "time": "21 Mar 2004 — 12:16pm",
      "content": "I don't like the R. Maybe just because it reminds of the cheap Bitstream-Revue-typeface.   \nThe circle in the logo also strikes me as odd, mimicking the O-form, not really a circle at all, and the O has nothing to do with their name or anything else, so that confuses me quite a bit. Also, the logo in itself looks a bit generic, I more or less associate it with a crosshair of a weapon system, and that, indeed, is not a good ind of visual metaphor for a company. And in some weird way it also reminds me of the (otherwise quite nice) newish BP-sun (maybe due to the green), which doesn't help establish an individual identiy at all. I don't see oil, I don't see water, I don't see information in all of this. And if you cannot see it... why opt for a ideographic trademark at all? I the and \\<\\> 's don't make any sense and are just visual special effects, just leave them away and concentrate on the word rockoil itself.   \n   \nOn the technical side, the logo probably won't work in black and white and even in colour, it will take three, probably even four colours to print/plot that artwork, which is not quite the most economic solution available.\n\n"
    },
    {
      "time": "22 Mar 2004 — 7:24am",
      "content": "I don't believe you HD!!! :-)   \n   \nSeriously, I believe you. People have different tastes, and as you are not criticizing the construction or anything objective about the letter there is nothing I can say except \"I like it\". I have found a Linotype-Revue, I don't like it too, but I don't see any resemblance.   \n   \nYes, the mark \\*is\\* a bit generic, and the main reason is because the company acts in many different fields (I don't want to say water, or oil) it is an abstract concept, and BTW I don't see \\*any\\* trouble in using purely abstract ideograms.   \n   \nIf you don't see any association in the mark, I think you are not even trying to put yourself in the position of the target public of the logo. The crosshairs are not exclusively used in weapon systems, but in \\*any\\* positioning system, as they denote direction.   \n   \nFor example: in the controls that position oil platforms above the hole they want to drill.   \n   \nAlso, to me the mark have a positive association in the other field the company operates; as it can be read as a \"green\" focus over a industrial cycle. Have you ever noticed that the pictogram for \"cycle\" often is not a perfect circle, but a more squashed one? look at some washing machines for example)   \n   \nAs to the technical side, it has been considered, and there is no problem in using 4 colors.   \nOf course, when you design something is crucial to take in account the uses it will have, but that's exactly why it is nonsense to limit yourself to constraints that don't apply to you.   \n   \nIn any case I'm posting different versions of the logo, one for good quality 1 color printing, and the other to coarse low quality 1 color printing (like old fax machines).   \n   \nWell, that's it.   \nLucky me you are not my client HD :-)\n\n"
    },
    {
      "time": "22 Mar 2004 — 7:52pm",
      "content": "It looks a little like the new BP logo, but that might just be the oil connection thing. Which you are trying to avoid. BTW, what is a \"technological solution\"?   \n   \nkris.\n\n"
    },
    {
      "time": "23 Mar 2004 — 2:06am",
      "content": "I should disagree with HD - the font is pretty good for that type of logo. And I should agree with HD on another point - 4 colours are too much for a logo. And I doubt that you will be able to reproduce this via the standard CMYK process - you will surely need a Pantone solution. And on the other hand - the colours resemble way too much the corporate colors of OMV - another gas & oil company - see [http://www.omv.com](http://web.archive.org/web/20131023204354/http:/www.omv.com/)\n\n"
    },
    {
      "time": "23 Mar 2004 — 9:14am",
      "content": "Hi Kris and Ivan, thanks for the feedback.   \n   \nI'm really surprised with this resemblance you guys see with the BP logo, the only connection I can see is the use of green and a certain \"concentric\" construction. Could you possibly elaborate a bit more about this? I would be really interested.   \n   \nFrankly, there aren't so many different color schemes as there are companies (in any field), and I'm sure I can find a logo already using any (good) color combination. If I had used the colors of a competitor I would have committed a major flaw, but that's not really the case. (I will explain a bit more about the nature of the company at the end)   \n   \nPlease have in mind that I've never heard of those companies before (BP or OMV) as we don't have them around here; but I'm actually glad to see they use a similar color scheme as mine; because I'm sure they have used (expensive) research to determine their colors, while I had to just trust my guts.   \n   \nAbout \"technological solution\"\n\n"
    },
    {
      "time": "19 Mar 2004 — 11:47am",
      "content": "Nah. I agree with all of your comments Scott. A cool gray though not a warm gray.\n\n"
    }
  ]
}
