{
  "id": "36929",
  "title": "Last-minute presentation at ATypI Brighton",
  "forum": "Bald Condensed's blog",
  "tags": [

  ],
  "content": "Last Tuesday I was asked to replace a speaker who has to drop out of the conference at the last minute. I won't be in the printed programme, but I suppose my presentation details will soon be included in the online [programme presentations timetable](http://web.archive.org/web/20131018114742/http:/atypi.org/05_Brighton/20_main_program).\n\nUntil this is arranged, below are the details of my presentation in case anyone's interested in showing up.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Oversampled**  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n_Yves Peters_\n\n**_Friday 14 September_ | 10:45 – 11:15  \nLocation: Seminar Room 202**    \nPresentation | Theme: _Hand made_ | Duration: 30 minutes\n\nFor as long as type has existed, successful designs have been copied by competing foundries. More recently, the grunge boom in the nineties saw the birth of a new, punk-influenced design aesthetic. Aspiring type designers with no formal training adopted the DIY attitude, disassembling the outlines of existing typefaces and reconstructing them into bastard hybrids. This approach is similar to sampling in hip hop, where rhythm tracks are assembled by rearranging snippets of existing songs. But whereas the music business provides a legal framework for sampling, the type industry has yet to formally address this phenomenon.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Speaker details**\n\nYves Peters is a [typo]graphic designer, writer about type, rock drummer and father of three. After a three-year stint as type expert/technical advisor at the Belgian FontShop franchise, he was hired by communication agency Making Magazines, now Magelaan.\n\nYves joined the Typophile community in 2002, where he currently is head moderator of the Type Identification Board. Besides reviewing typefaces for David John Earls’ Typographer.org, Yves edits Unzipped – his blog for FontShop Benelux – and makes occasional contributions to Typographica and The FontFeed. Together with Stephen Coles, he is responsible for cross-referencing the current edition of FontBook.\n\nHis talent for being able to identify most typefaces on sight is utterly useless in daily life.\n\n",
  "author": "Bald Condensed",
  "time": "9 Sep 2007 — 5:45am",
  "uid": "110",
  "comments": [

  ]
}
