{
  "id": "36920",
  "title": "A new proposal for student font licensing: single-use font licenses.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I’ve previously brought up a need—at least one that I perceive—for simple, inexpensive student font licensing. I have been thinking about it again, and something that always sticks out is that students who license a font are often only going to use the font once. Sometimes this is because the student does not even want to use the font and is only doing so at the insistence of a professor. Students at some schools may be pushed to use new fonts for every project. Or a project may just be a wild one-off that demands a font that is not inexpensive, even at student prices, but will not be useful again while the student is in school. Whatever the reason, it can be hard for students, especially students on a tight budget, to justify buying a discounted but still expensive font that will only be used once—especially in design schools where pirate fonts are everywhere.\n\nWhat I propose is very low-cost single use font licenses for students. Under this system, a student would be able to license individual fonts—even out of families that are not sold individually—at a tiny fraction, say five to ten percent, of the regular price, but these fonts will only be used in one student project. The fonts on offer would not be limited to display fonts, which are already inexpensive, and can often be substituted by a free derivative/knockoff appropriate for student work. These would be the same expensive, high-quality text, signage, and information fonts that sell for a lot more than students might be able to afford.\n\nWhile such a system is unlikely to make much money for anyone, it would get students used to paying for high-quality fonts. I don’t know what that’s worth to designers, but it seems like a better option than negotiating discounts on an individual basis, not offering a discount, or just expecting students to resort to piracy.\n\n",
  "author": "blank",
  "time": "8 Sep 2007 — 8:41pm",
  "uid": "14722",
  "comments": [
    {
      "time": "8 Sep 2007 — 10:05pm",
      "content": "What's to prevent a student from using it more than the alloted amount? Most design students hardly even know where fonts come from, let alone recognize the EULA.\n\n(Granted, a student that is likely to buy a font is also likely to be the student to read the EULA, but there is no guarantee.)\n\nThe only benefit I see from this plan is creating brand recognition and good will with the (hopefully) future purchaser of typefaces.\n\nAnd I have never heard of a design instructor requiring the use of a specific display font. Aside from scenario, if they were to require the use of a standard sans or serif, it is a purchase that should benefit the student far beyond the current project, even if they don't know it at the time.\n\n"
    },
    {
      "time": "8 Sep 2007 — 10:06pm",
      "content": "How would this system be policed?\n\nHow would the system prevent abuse from commercial users buying the tiny fraction priced versions? Fonts cannot be crippled. Purchasing and verification systems cost money, which organisations do not provide at charity. If implemented, organisations would raise general prices to subsidise.\n\nSoftware is a fundamental backbone, and thus charging is highly 'expected'. Typography choices are often the springboard which helps attain higher marks. Why encourage discrimination against poor students? Why should only rich students deserve higher marks?\n\nThe benefits are minimal. The few extra dollars going into the pockets of corporations does not justify the trouble it causes everyone else.\n\nThe better 'psyche' that a student has after buying a font, does not encourage them to buy fonts in the future. It only rubs further salt into the wound when they make the choice between spending $499 or obtaining illegally.\n\nIt suddenly sounds like I may or may not be helping answer your college essay.[/end cynicism]\n\n"
    },
    {
      "time": "8 Sep 2007 — 10:21pm",
      "content": "Dan, I have had three design teachers pass out CDs if fonts in class, two of whom made it quite clear that those fonts were to be used for the classes. And I have witnessed students be given explicit instruction in exactly what font should replace a font already being used in a piece.\n\n<cite>What’s to prevent a student from using it more than the alloted amount?</cite>  \n<cite>How would this system be policed?</cite>\n\nI don’t think that the system can be policed, it would have to be an honor system. The idea behind it is that students who don’t necessarily want to pirate a font would license the font. Those who would abuse the system would likely just pirate the font, in most cases doing so would require less time and effort than actually buying the font.\n\n<cite>Typography choices are often the springboard which helps attain higher marks.</cite>\n\nYes, they are. But a professional designer is able to use a font repeatedly to earn money, whereas a student may only be in a position to use a font once, and if he is not a freelance designer and will not become one in the future, will not be making _any_ money from said font. For this reason the real value of a font can be much lower to a student than to a professional, but current academic font discounts do not, IMHO, reflect this.\n\n<cite>It suddenly sounds like I may or may not be helping answer your college essay.</cite>\n\nOh please. None of my professors would accept writing on such a tedious subject, and I would not even consider boring them with it.\n\n"
    },
    {
      "time": "8 Sep 2007 — 10:39pm",
      "content": "@James  \nAchtung! Why do teachers gotta suck so bad? Wouldn't having a student make the decision on which fonts to use be better over the long run? Let them fully understand exactly why a certain font is/is not appropriate for a certain use by experience. You're supposed to make mistakes in college...\n\nI can understand making an \"All Helvetica All the Time\" rule, but directing the use of display fonts? Stupid.\n\nAnd why a teacher would spec anything expensive is beyond me anyways. I would say \"no\" and tell the teacher to go to hell, but that's just me.\n\n<cite>I don’t think that the system can be policed, it would have to be an honor system. </cite>\n\nHow is that different than the current method of negotiating with the foundries? Negotiating does two things: 1) It gets a student a better price and 2)creates that brand loyalty that is essential to all small businesses.\n\n"
    },
    {
      "time": "8 Sep 2007 — 10:52pm",
      "content": "<cite>And why a teacher would spec anything expensive is beyond me anyways. I would say “no” and tell the teacher to go to hell, but that’s just me.</cite>\n\nSome professors can get really full of themselves at times. For students who rely on financial aid determined by academic success, arguing with such professors is not always an option. And I think that a lot of design professors have become so used to academic font piracy that they just assume students have no qualms about it.\n\n<cite>How is that different than the current method of negotiating with the foundries?</cite>\n\nThe difference is that in a single-use system the foundries make so little money that negotiating would be a waste of time. But if such a system were set in place by a large online font vendor, multiple font purchases _might_ pay the cost of the system, especially if larger schools submitted lists of eligible students to save the vendor from checking faxes of IDs and tuition bills. And if the system actually took off, who knows, maybe the money could add up to something for the foundries and designers.\n\n"
    },
    {
      "time": "9 Sep 2007 — 2:25am",
      "content": "I'm not convinced massive discounts would work for typefaces, especially for students. The very first typeface I purchased, (oh, the thrill!) I have never used. Big lesson there—get to know more about the type I am using & what is available before splashing cash on what I thought would be useful.\n\nThe university that I teach at has an excellent, albeit smallish collection of typefaces. The students have never been introduced properly to the good types in the collection, which is hardly their fault. I understand that because these types are default/standard that they must seem dull to the students, it was certainly how I thought once. But I have made many a recommendation to students about typefaces that are right there for them to use, and I always see the \"aha!\" look on their face.\n\nI guess what I am trying to say is that student typographers really need to get their \"eye in\" by using what is available, explore the provided typefaces, become critically aware of what is good & bad about a typeface before spending hard cash on new type.\n\n—K\n\n"
    },
    {
      "time": "9 Sep 2007 — 3:57am",
      "content": "I don't think policing is entirely necessary. Obviously, for (most) fonts, once you have the file, it's an honour system that you're using it as licensed. I know my university didn't have a font library for us to use, and I could have greatly benefited from using different faces from some projects, but ended up reverted to something more standard for lack of funds. I barely had money for the main design software after all the rest of my art supplies, and even a twenty dollar typeface would have broken my account.\n\nI remember back when Apple first announced the multiuser license (the \"family pack\") and people wondered if anyone would ever buy it, and sure enough quite a few people have partly because of the \"I'm doing the right thing\" feeling, but also a lot of people don't know the difference. Offering a font very cheaply to students for one-time uses would introduce them to the idea of paying for fonts while still allowing them to do lots of experimenting with different ones. What's the right price point? I don't know, but $2-5 would be a pretty good spot.\n\nYou could do a pretty accurate system to verify people are education simply by requiring an e-mail address from a school. It'd still be possible to cheat the system, but let's face it, people already do, and if they'll pay 5 bucks to get a font as opposed to downloading it for free illicitely, I'd prefer the former.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "9 Sep 2007 — 12:45pm",
      "content": "<cite>It’d still be possible to cheat the system, but let’s face it, people already do, and if they’ll pay 5 bucks to get a font as opposed to downloading it for free illicitely, I’d prefer the former.</cite>\n\nOut of interest, which typefaces do you think would be fairly priced at $5?\n\n—K\n\n"
    },
    {
      "time": "9 Sep 2007 — 3:29pm",
      "content": "The number of typefaces worth $5 for a single-time use in an academic assignment that has little to no commercial worth outside of being a portfolio piece to me is quite numerous indeed. 99¢ for a song on iTunes is a decent price. But if you were only allowed to listen to it once, I doubt many people would pay more than a few pennies for it.\n\nA perpetual license of course would be worth more, and a perpetual commercial-use license at the even higher standard prices. But I think with a low-cost single-use non-commercial-license, students might could start getting used to buying fonts, which I think would ultimately be any of us's goal.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "9 Sep 2007 — 5:37pm",
      "content": "The iTunes option is interesting. Linotype has FontExplorer, which is an iTunes clone. Here's the scenario: Distribute a one time use font through FontExplorer, that has to be activated IN FontExplorer. After a set period of time, say two weeks or one month, the font becomes inactive and cannot be used again without paying the full purchase price. Less, of course, the amount you already paid.\n\nI can see this not only benefiting students, but everyone. Like people who are interested in a font, but need to have a working copy in order to evaluate it.\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:20am",
      "content": "As a student, I would absolutely love some option like this. I am currently working on a type specimen book (just for my own personal study / exploration, I'll be looking for some feedback in a bit!), and there are several fonts that I would like to include but cannot afford. Personally, I have respect for fonts and EULAs, which is why I would like the opportunity to buy the fonts. But, as mentioned above, I not only don't have the budget, but I may not even use these fonts again (unless I freelance down the line). Is there currently any sort of student licensing available? I know Veer and Stormtype (I think) offer a discount, but I haven't seen any other student rates ...\n\n"
    },
    {
      "time": "10 Sep 2007 — 6:24am",
      "content": "Schools purchase equipment for students. They should offer at least a base set of site-licensed type to work with.\n\nGranted, that made more sense in the day when you spent your hours in the computer lab rather than at the coffee shop with your own laptop.\n\nI like the 'honor system' idea, though. Perhaps some foundries would be willing to try that. For $x a year any student enrolled in this program and school may use any of the typefaces available from said foundry for student work only. Perhaps part of the deal is a one-hour session on the ethics and legalities of software licensing. ;o)\n\n"
    },
    {
      "time": "10 Sep 2007 — 7:28am",
      "content": "\\> Why do teachers gotta suck so bad? Wouldn’t having a student make the decision on which fonts to use be better over the long run?\n\nWhile I never have specified a single face for a job, I can understand why a professor might. Education is a progression, and forcing students to use certain faces early in their education will expose them to more type. And making the student use a wrong face might help teach the student why such a face is wrong, and that can result in major learning.\n\nThat said, something like this would only be a first term philosophy, and in later terms, as the students begin to be more comfortable with type, the choice of a proper face would have to be the decision of the student.\n\nIt is a sort of walking before you learn to run thing.\n\n"
    },
    {
      "time": "10 Sep 2007 — 7:28am",
      "content": "<cite>Distribute a one time use font through FontExplorer, that has to be activated IN FontExplorer. After a set period of time...the font becomes inactive</cite>\n\nYikes! No font DRM! And given the size of MonoLinoType, and the firm’s portfolio, implementing any sort of DRM system would be asking for some kind of antitrust smackdown from EU regulators.\n\n<cite>Is there currently any sort of student licensing available?</cite>\n\nMany type foundries will give students a discount, but don’t advertise it, at least not obviously. Contacting the foundry is usually the best way to find out.\n\n"
    },
    {
      "time": "10 Sep 2007 — 4:10pm",
      "content": "<cite>Education is a progression, and forcing students to use certain faces early in their education will expose them to more type. And making the student use a wrong face might help teach the student why such a face is wrong, and that can result in major learning</cite>\n\nI know this one well. In my colour theory class, we had to choose our ten favourite colours out of thousands upon thousands of colour chips. Then we arranged them to be aesthetically pleasing. Next step choose our five least favourite, then arrange them to be not so bad, then mix the two groups and rearrange again. Then write our name on the back of our favourite and least favourite colour, and identify it as such. Prof took them up, threw out all of the favourites, and handed them back, telling us our next project was to be based around it. I had a putrid Tennessee orange.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "11 Sep 2007 — 10:56am",
      "content": "James, your idea has potential and variations are already being trialed by commercial type foundries.\n\nRebecca Alaccari, proprietor of Canada Type, recently introduced a type of dual licensing scheme wherein fonts can be purchased (licensed) for commercial use at full catalog price, and purchased (licensed) for personal or non-profit use \"at considerable discount prices\".\n\nCanada Type's personal use license can be viewed here: [http://www.myfonts.com/viewlicense?id=598](http://web.archive.org/web/20131022131255/http:/www.myfonts.com/viewlicense?id=598 \"http://www.myfonts.com/viewlicense?id=598\")\n\nIn 2003 I introduced a dual licensing scheme for selected fonts in the [Sentinel Type catalog](http://web.archive.org/web/20131022131255/http:/www.myfonts.com/browse/foundry/sentinel/). Selected fonts are downloadable (ie: can be licensed) from Myfonts.com for personal or non-profit use at zero cost, and the same fonts can be purchased (licensed) for commercial use at their full catalog prices. I had students and non-profit users in mind, figuring that those types of users shouldn't have to pay anything. I know many who download the zero cost license versions are students because some have written to me to confirm my definition of non-profit use(s), citing student projects, resumes and the like.\n\nI'm constantly surprised at the number of commercial use licenses I sell for Midnight Kernboy, DeLouisville, Maus and Ganymede 3D, all of which commercial users can download for free and use on paying jobs. Many such users no doubt do so in contravention of the EULA they agree to online when obtaining those fonts. That part doesn't bother me. It's a calculated risk I took when making the commitment to a \"try before you buy\" policy four years ago. I expect it to happen.\n\nWhat impresses me is how many honest users there are. When the font in question is a personal interpretation of the Latin alphabet that flies in the face of established convention---Midnight Kernboy---or a unicase Tuscan that takes serious risks with integration and asks the user to flirt with those risks too---DeLouisville---it seems only fair to offer such faces at no charge to allow potential customers to assess their merits first, in their own time, without obligation, before paying the usual fee for commercial use.\n\nDan, the benefits include more than brand recognition and good will with future purchasers. The main point is students and non-profit users get to use decent fonts for low fees or zero outlay. It's about trusting those users and having faith in people.\n\nNathan, there is no way of preventing commercial users from taking advantage of such a scheme. The revenue distributor Myfonts.com and I make from selling commercial licenses for some of my fonts covers the cost of making the same faces available for free for those who can't afford to pay for them. Abuse of the system does not cost me or Myfonts anything. We're only talking about potential revenue not gained. Nothing is lost per se, and enough commercial users are honest enough to make the whole thing whorthwhile.\n\n_Why encourage discrimination against poor students? Why should only rich students deserve higher marks?_\n\nThat doesn't neccessarily follow. Cheap or free fonts of decent quality can be had by affluent and impoverished students alike---if type makers and vendors extent a little faith. If rich students attain higher marks by buying expensive fonts for their work, that is a function of their affluence.\n\n_The benefits are minimal. The few extra dollars going into the pockets of corporations does not justify the trouble it causes everyone else._\n\nThe benefits are potentially great. So far neither Myfonts or myself have experienced any trouble.\n\nCassie, many of the participating foundries at Myfonts.com offer discounts on commercial licenses to students and non-profit users.\n\n_...the real value of a font can be much lower to a student than to a professional, but current academic font discounts do not, IMHO, reflect this._\n\nI agree, but determining the value of a font to an academic user involves time-consuming negotiation which no vendor can afford. It works out cheaper and more efficient for everyone if some fonts are offered to academic users at no charge.\n\nWhy, then, do I not offer a dual license arrangement for every font in my catalog? That would be commercial suicide, as it would be for other foundries. What I'm suggesting is that other foundries should offer **some** fonts in their commercial catalog, but not all, either very cheap or at zero cost to whoever wants them, to give all potential users an alternative to piracy, with the option to purchase a full commercial use license for those fonts if and when their use warrants it. Fonts so offered need not be unconventional faces like mine, but could be slow-sellers or anything else that looks like the font next door but a little off center. If that prevents those particular fonts from being pirated it's worthwhile, and if it saves other fonts (not dual-licensed) from the same foundries being pirated, even better.\n\n**\"It's just amazing how fair people can be\"** --- Randy Newman, from his song Simon Smith and the Amazing Dancing Bear.\n\nj a m e s\n\n"
    },
    {
      "time": "12 Sep 2007 — 10:41am",
      "content": "<cite>would be asking for some kind of antitrust smackdown from EU regulators.</cite>  \nAh, baloney. EU regulators can't even tell the difference between Times and Helvetica, meaning that the perception of the fontworld is very narrow. Monotype could make the same arguments that Apple makes for their exclusivity.\n\nBut think about it, DRM is only crappy when it either invades your privacy or limits your ability to use the end software in a reasonable way. Apple's DRM prevents you from using an .mp3 on unauthorized devices, which sucks. But when you purchase a font license, the EULA's clearly state that you shouldn't be using the font on another system anyway.\n\nPlus, Apple's new tiered system could work equally well, as long as the DRM doesn't get in the way of actually using the font.\n\n"
    },
    {
      "time": "12 Sep 2007 — 11:25am",
      "content": "<cite>as long as the DRM doesn’t get in the way of actually using the font.</cite>\n\nBut since it is the purpose of every DRM system to limit the use, there will always be trouble.  \nWhat if you have a deadline and your computer crashes? You switch to another computer and cannot use the font because of the DRM. Nightmare!  \nThe users who have bought a font will have more problems using it and the cracked fonts would be around like always before. So nothing to win.\n\n"
    }
  ]
}
