{
  "id": "36928",
  "title": "Hoefler Text in books...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anyone know of any books that use Hoefler Text for text? I've seen Hoefler Titling all over the place in magazines but never the text counterpart.\n\nThanks,\n\nMikey :-)\n\nPS... I probably need to read more :-p\n\n",
  "author": "<a href=\"/web/20111214100103/http://typophile.com/user/12479\" title=\"View user profile.\">SuperUltraFabulous</a>",
  "time": "<br>",
  "uid": "12479",
  "comments": [
    {
      "time": "",
      "content": "I've been wondering the same thing.\n\n"
    },
    {
      "time": "",
      "content": "Thank you! I thought I was the only one.\n\n"
    },
    {
      "time": "",
      "content": "I believe \"O\" magazine, the American magazine identifiable by the presence of Ms. Winfrey on every cover, uses Hoefler Text.\n\n"
    },
    {
      "time": "",
      "content": "Actually, the magazine is identifiable with a rich fat cow on the cover. I guess I'll have to check out her magazine... darn!\n\nSeriously tho, Thanks marcox :o)\n\n"
    },
    {
      "time": "",
      "content": "I can't recall seeing Hoefler Text in any books. But <cite>Smithsonian</cite> magazine has been using Hoefler Text as its text face for a while now. (Also Hoefler Titling in heads.) I'm sure I've seen it in other magazines, but can't think of them off hand.\n\n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Also, <cite>Yoga Journal</cite> uses Hoefler Text for body copy. Or at least, they used to — haven't looked at a recent copy, so I couldn't swear to it.\n\n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Have you thought about checking with the Hoefler foundry and asking them? Perhaps designers have sent them copies of books set in Hoefler Text. They could tell you ISBNs and you could get the books through a library.\n\nDesigners should send samples of their design work with new types to those who design those types. Typeface designers appreciate seeing their work in use. This can also set up rewarding dialogue between the maker of a face and the user of the face. That has been my experience the past few years.\n\nHmmm . . . . that reminds me: I have not yet sent Hoefler a copy of a poetry anthology I set recently in Requiem. Thanks for the nudge.\n\npowers\n\n"
    },
    {
      "time": "",
      "content": "Will --\n\nNow that you mention it, I never managed to get a copy of <cite>Summer of Ordinary Ways</cite> with Whitman. Every time we've spoken of it, it's been out of stock at the warehouse or something. I still haven't seen a copy. Any extras lying around?\n\n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Spoon magazine used it for one issue before they folded! And I think pol oxygen (australia) still use it.\n\n"
    },
    {
      "time": "",
      "content": "Ah, Kent. You sure know how to make a guy feel ashamed early in the morning. What with the curious publishing history of this book, I sure did forget to follow my own dictum. A copy goes in the mail to you today. We've sold over 20,000 copies of this book [not bad for a first book from a small publisher], so lots of readers have seen Whitman.\n\npowers\n\n"
    },
    {
      "time": "",
      "content": "Will -- Sorry for the public exposure, but I figured that'd catch your attention ;-). Thanks for packing one up. Those sales are impressive for your arena. Good for you and MNHS. It's always nice to have one or two in the list that take off, eh?\n\nI'll be watching the mail.\n\n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Hello again:\n\nI checked with the foundry a few days back regarding Hoefler Text _and Requiem Text_ for books. The representative did not know of any instance off hand. However, I did receive and examine the new Hoefler & Frere Jones type catalog.\n\nIsn't it funny how we form opinions (sometimes damning opinions) about type we see as online samples of repertoires or comprehensive pdf's we downloaded from foundries, then to have that opinion totally change once we see it in print?\n\nFor instance, Verlag- not very pretty to me on screen (perhaps even ugly), looks much better in print. I'll still take Neutraface tho :-)  \nWe see things much differently don't we?\n\nWith regards to Hoefler Text (the swashy italics excepted), I see it as a face that is so neutral that you only focus on the meaning of the words, not their shapes (much in the same fashion as Minion). It also feels \"literary\" but I wonder: is it \"literary\" for magazines or \"literary\" for books? H&FJ catalog is printed on coated stock (kromecote?) - perhaps this has something to do with it.\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "",
      "content": "I just set a book in Hoefler Text (and Titling). It worked great; the letters look \"black\" and strong, and the page has a nice, old typographic feel, more \"letter press\" than digital, in some way. Besides the obviuos resemblance to Linotype Janson Text (Hoefler's main influence), to my eye Hoefler Text has some kind of similitude to ITC New Baskerville - not the type design, but the way it looks, the way the letters and the ink fit the paper. Very different from Adobe Garamond, to say. What doesn't seem to work, at least to my eye, is Italic in long reading: there's a sequence of 4 pages set entirely in Italic and it looks too heavy to me. And an alternate Q cap Italic would be helpful - the default one is elegant but perhaps too baroque to some contemporary reader's eye (by the way, I disagree with Mike: this font isn't \"neutral\" at all; it's very personal. Times New Roman in a book looks neutral :-)\n\nAnyway, it would be interesting to see how Hoefler Titling, which is a much \"finer\" typeface, would work in small size. It looks nice even in 13 points, but I'm not sure how it would work in 11, or 8 points.\n\n"
    }
  ]
}
