{
  "id": "36930",
  "title": "(x) sans in infographic - custom font by Juan Pablo de Gregorio for University of Chile {Jelmar Geertsma (self)}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I was wondering if anyone has a clue to what this typeface could be.\n\n ![](http://web.archive.org/web/20150324161230im_/http:/typophile.com/files/fontjes_3969.jpg)\n\nIt's from a infographic I saw on a designer's flickr-photostream, [here](http://web.archive.org/web/20150324161230/http:/www.flickr.com/photo_zoom.gne?id=853650392&size=o).\n\n",
  "author": "Quincunx",
  "time": "9 Sep 2007 — 6:04am",
  "uid": "14604",
  "comments": [
    {
      "time": "9 Sep 2007 — 9:03am",
      "content": "That's beautiful. Someone please let us know! Look at that A and R.\n\n"
    },
    {
      "time": "9 Sep 2007 — 9:43am",
      "content": "Exactly! Those characters made me wonder what it is, that R is excellent.  \nI will post a question to the flickr-page as well, I don't know why I didn't do that before.\n\n"
    },
    {
      "time": "9 Sep 2007 — 11:43am",
      "content": "Having recently been in the market for an [R like this](http://web.archive.org/web/20150324161230/http:/typophile.com/node/36386), I can say with confidence that this isn't...\n\nFF Milo  \nFF Sanuk  \nVista Sans Alt  \nPriori  \nTarzana Wide  \nAspect  \nPTF Parisine Plus  \nPTF Costa\n\n...but I'd love to know what it is, too.\n\n"
    },
    {
      "time": "9 Sep 2007 — 12:16pm",
      "content": "LOL Marc I checked out that old thread too.\n\n"
    },
    {
      "time": "9 Sep 2007 — 2:57pm",
      "content": "Well, after I got the obvious idea to ask the guy himself on flickr, he replied that he designed it himself. I don't know if he designed it from cratch, or if he edited a couple of characters though. It could very well be some kind of DIN-like face, with a couple of custom glyphs.\n\n"
    },
    {
      "time": "9 Sep 2007 — 3:12pm",
      "content": "Jelmar: Juan Pablo de Gregorio is [on Typophile](http://web.archive.org/web/20150324161230/http:/www.typophile.com/user/619) too. That typeface is a custom work he did for the University of Santiago in Chile, drawn from scratch, not modified from other outlines as far as I know. I alerted him of this thread, he’ll probably chime in later on.\n\n"
    },
    {
      "time": "9 Sep 2007 — 3:20pm",
      "content": "I'm not sure the cap M works (I'd be curious how a Gotham/Din-like treatment would look), but otherwise I like this a lot. I love how the stylish treatment of a couple of key characters can give a face a fresh look, even one that's in familiar territory.\n\n"
    },
    {
      "time": "9 Sep 2007 — 3:37pm",
      "content": "Antonio: I didn't know that he was on here as well!\n\nI hope I didn't offend Juan Pablo with thinking it might be edited, I didn't want to. :)\n\nI absolutely love the infographic and typework. I think it's looking very impressive. The face just has this DIN-like character, only with this very cool 'R', and a couple of other key elements that give this a very new look. This is information-design which also looks good.\n\n"
    },
    {
      "time": "9 Sep 2007 — 4:09pm",
      "content": "To bad this is not up for licensing. I really like it. I'm with Marcox on the M though. Would be interesting to see it with a different twist.\n\n"
    },
    {
      "time": "9 Sep 2007 — 9:39pm",
      "content": "I'm crying of happines. I am the typographer who design this font...  \nIt's true... \"M\" can have some problems, but this is not a final version. I designed this font at the time I was designing the infography. And I think this is not the final version. I remember I fixed the \"M\" when I change the numbers from oldstyle to caps.  \nMany books are working with \"ugly\" typefaces, but too cools and with a fresh look. And I wanted to design an special font, because a great designer in Chile give me the great oportunity to work with him...\n\nI thinked that nobody will like to my font. I designed 3 weights in about 2 weeks... I will have to end it, and talk with some foundry that want to sell it. (I have about 150 characters by weight)\n\nThank you\n\nDon't forget to read [\"letritas\"](http://web.archive.org/web/20150324161230/http:/letritas.blogspot.com/)\n\n"
    },
    {
      "time": "10 Sep 2007 — 4:09am",
      "content": "Well, obviously there's people who like your font.  \nAnd I would read \"letritas\", if I understood Spanish. :)\n\n"
    },
    {
      "time": "10 Sep 2007 — 5:35am",
      "content": "You can read [http://www.typies.blogspot.com/](http://web.archive.org/web/20150324161230/http:/www.typies.blogspot.com/ \"http://www.typies.blogspot.com/\") which is also made by Juan Pablo but in English;-)\n\n"
    },
    {
      "time": "10 Sep 2007 — 8:56am",
      "content": "Ah yes, I thought I saw that blogheader before when I opened the \"letritas\" blog. I have read the \"typies\" version.\n\n"
    },
    {
      "time": "11 Sep 2007 — 11:52am",
      "content": "He he he  \nSoon you can get this typeface for extreme and cool headers...  \nAnd I will comment the monography in letritas as soon as I can get the print.\n\nThanckx\n\n"
    },
    {
      "time": "11 Sep 2007 — 2:25pm",
      "content": "Yihaaa. Looking forward to it! Think you can have it done by friday? Lol kidding (I just possibly have the perfect job for it). Maybe next time;o)\n\n"
    },
    {
      "time": "11 Sep 2007 — 7:29pm",
      "content": "thank you,  \nand Antonio... the font is not for university od santiago. Is for university of chile...\n\nSound similar but both are differents universities\n\n ![](http://web.archive.org/web/20150324161230im_/http:/typophile.com/files/111_3651.jpg)\n\n"
    },
    {
      "time": "11 Sep 2007 — 9:45pm",
      "content": "Hi Juan Pablo. I just realised you where talking about the headline font on the blog and not the infographic. My mistake. I'm a good beta tester for any font though so if you need testers just let me know.\n\n"
    },
    {
      "time": "12 Sep 2007 — 8:24am",
      "content": "degregorio I really like your typies blog. found the stuff about vector drawing really good. you should definitely release that infographic typeface its lush.\n\n"
    },
    {
      "time": "12 Sep 2007 — 9:26pm",
      "content": "Thank you cuttin.  \nI really appreciate it. I am working in this font. I hope you like it.\n\n"
    },
    {
      "time": "29 Nov 2007 — 12:30pm",
      "content": "You Can Enjoy an article in [Letritas](http://web.archive.org/web/20150324161230/http:/www.letritas.blogspot.com/) about this font.\n\nThank you\n\n[www.letritas.blogspot.com](http://web.archive.org/web/20150324161230/http:/www.letritas.blogspot.com/ \"www.letritas.blogspot.com\")\n\n ![](http://web.archive.org/web/20150324161230im_/http:/typophile.com/files/set_4203.gif)\n\n"
    },
    {
      "time": "29 Nov 2007 — 3:11pm",
      "content": "Great work, Juan. :)\n\n"
    },
    {
      "time": "25 Dec 2007 — 8:02am",
      "content": "Thank you!\n\n"
    },
    {
      "time": "25 Dec 2007 — 9:20am",
      "content": "It's a nice design indeed, but I think it still needs some work on optical corrections and such.\n\n"
    },
    {
      "time": "25 Aug 2009 — 2:04pm",
      "content": "Juan Pablo's typeface has been released by Veer as [Beauchef](http://web.archive.org/web/20150324161230/http:/www.veer.com/products/typedetail.aspx?image=CTT0000250#specimen).\n\n_Beauchef is a grotesque sans serif in the DIN tradition. Designed originally to support the typographic needs of an advanced mathematical thesis paper, Beauchef knows how to let the information take the spotlight, but still retains enough attitude to convey energy and zeitgeist. Beauchef is readable and clear, with a crisp accuracy you and balanced geometry based on tabular numerals. Humble, yet expressive. Simple, yet avant-garde._\n\nBeauchef has a personality perfectly suited for authoritative short paragraphs, headlines, chapter headings, and declarations of principles, rich computer graphics and the like. But it can also speak clearly in long text passages.\n\nThe font family features small caps, fractions, superior, inferior and lining numerals, plus full Western European language support.\n\n ![](http://web.archive.org/web/20150324161230im_/http:/typophile.com/files/CTT0000250_P_6135.GIF)\n\n"
    },
    {
      "time": "25 Aug 2009 — 3:40pm",
      "content": "Wonderful!!!!\n\n"
    },
    {
      "time": "26 Aug 2009 — 3:14pm",
      "content": "Congrats, Juan Pablo.\n\n"
    },
    {
      "time": "18 Sep 2009 — 10:37pm",
      "content": "Thank you very much.\n\nHere is a specimen that you can to see.  \n [http://jpdegregorio.googlepages.com/beauchefespecimen.pdf](http://web.archive.org/web/20150324161230/http:/jpdegregorio.googlepages.com/beauchefespecimen.pdf \"http://jpdegregorio.googlepages.com/beauchefespecimen.pdf\")\n\nAnd you can read a little more about this project at [http://letritas.blogspot.com/](http://web.archive.org/web/20150324161230/http:/letritas.blogspot.com/ \"http://letritas.blogspot.com/\")\n\nThank you\n\n"
    }
  ]
}
