{
  "id": "3695",
  "title": "Personal logo/printers mark",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello Typophiles -   \nI am new to this board, so let me introduce myself before I ask for your help. I am attending college at Kansas State University in....Kansas (go figure). Graduation is scheduled for the fall of '05, although I am considering pursuing Graduate school. I am an avid mountain biker and soccer player.   \n   \nFor the last few days I have been pondering about creating a logo to use for promoting and identifying myself. I work on a medium amount of freelance projects, and I thought it would be nice to have something to put on a business card when I am networking with people (i.e. drunken shmoozing)   \n   \nIn the back of my head I would like to steer this towards being a pretty strong graphic symbol, that I could then apply variations to in the form of ornamentation/texture. The thing that really got this all started was a discussion about printers marks -   \nhere is a link to some... [printers marks](http://web.archive.org/web/20050526121529/http:/www.lib.iastate.edu/art/printmk.html). I think I would like to base it around my intitials in some form, but you have any other suggestion let me know. Here is one that I have come up with, its rough....HAVE AT ME!   \n   \n ![:-)](http://web.archive.org/web/20050526121529im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n ![Initial Mark](http://web.archive.org/web/20050526121529im_/http:/www.typophile.com/forums/messages/29/28927.gif)\n\n",
  "author": "shwaxinator",
  "time": "Fri, 2004-03-19 13:28",
  "uid": "3255",
  "comments": [
    {
      "time": " Fri, 2004-03-19 13:37",
      "content": "I guess in some ways it represents the \"flow of ideas\" through a plane, that plane being things created in the physical world. I seem to have double posted...im such a rookie ![:-(](http://web.archive.org/web/20050526121529im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": " Fri, 2004-03-19 13:49",
      "content": "I like it. Maybe because it's open to interpretation, but there's clearly some mutual movement (communication) going on.   \n   \nI might make it more compact though, and add some irragularity, like in that St Albans Mark - or like the Koch symbols: flares at the ends of strokes and somewhat \"off\" arrowheads, although it's not easy to make that look intentional and not like a mistake.   \n   \nhhp\n\n"
    },
    {
      "time": " Fri, 2004-03-19 14:29",
      "content": "- on your point tiffany i can see where you say that it doesnt correlate with design directly or even obviously. But to be honest I find that many time artists logos or designers logos are fairly obvious, i.e. a paintbrush. While I think that this is excellent if done well, many times it is not. I also tend to be more of an abstract thinker. So it fits my personality...   \n   \n- hrant, i agree with what you say about adding irregularity. I also think it is tough to make it seem intentional. I am going to try a variation with more of a \"serifed\" feel to it. By compact do you mean more of a even height and width?   \n   \nthanks for the suggestions guys.\n\n"
    },
    {
      "time": " Fri, 2004-03-19 14:36",
      "content": "Compact: yeah, the arrows are too tall (but also a bit too close).   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-03-20 10:29",
      "content": "The connotations of \"up and down\" are very strong and have a lot of baggage. People seeing the abstract motion of ideas are likely to vaguely think \"there's a good one and a bad one.\" What if you rotate it?\n\n"
    },
    {
      "time": " Sat, 2004-03-20 11:49",
      "content": "Turmoil, as in the road you travel is full of ups and downs which are cnstantly pulling your path..   \n   \n _I think I would like to base it around my initials in some form_   \n   \nThats a \"busy\" H.\n\n"
    },
    {
      "time": " Sat, 2004-03-20 21:57",
      "content": "\"The connotations of \"up and down\" -- what if you rotate it?\"   \n   \n- great idea I am officially on spring break, and I am going to be doing some sketches and reworking over the next couple days..thanks for all the ideas...i will post more soon..   \n   \n\"Thats a \"busy\" H.\"   \n   \n-yes it is. ![:-)](http://web.archive.org/web/20050526121529im_/http:/www.typophile.com/forums/clipart/happy.gif) I think you might be on to something...\n\n"
    }
  ]
}
