{
  "id": "36966",
  "title": "Advice needed - Nazi typography dissertation research",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi everybody, i'm new to this forum; this is my first post.\n\nI was wondering if anyone would be able to give me some advice on the dissertation i'm writing in my final year at university. The focus of my dissertation is the role of typography in 2nd World War Nazi propaganda (havn't finalised the title yet). This subject is something I have always been interested in.\n\nHere are a few key areas that i want to look into:\n\nCan a typeface have a psychological or subliminal effect on the viewer ( for example, the ability of Fraktur to intimidate / persuade the public and communicate power, etc) ?\n\nDid Nazi typography frequently feature blackletter typefaces because of its German heritage, or was it perceived to have communicative qualities that were appropriate for the Third Reich?\n\nWere the skills of well-known and respected typographers harvested specifically for the creation of successful posters? Who were the main players in German typographic design / design in general?\n\nTo what extent did the technology available at the time of creation limit or shape the physical typography and as a result the message the designers were trying to communicate?\n\nIs a typeface's ability to communicate something specific related directly to the physical letterforms, colour and composition, or does it have more to do with the viewer's associations with the typeface, which relate to it's previous use? For example, many people who see blackletter typography today may instantly draw associations of violence and Nazism - is this due to inherent qualities of the typeface, or simply due to the fact that the viewer has seen this sort of typography used in a violent context before?\n\nPhew! Hope that all made sense. If anyone could offer some advice as to where would be a good place to look to go about answering some of these questions, or any general information about design and Nazi Germany, I would be eternally grateful.\n\nThanks for your time, and thanks in advance for any help you might be able to offer!\n\nJack\n\n",
  "author": "Deadbolt",
  "time": "10 Sep 2007 — 9:22am",
  "uid": "21605",
  "comments": [
    {
      "time": "10 Sep 2007 — 9:34am",
      "content": "This is a very interesting topic, I should love to purchase your thesis when it is published.\n\nI suppose you know that the Nazi government at a certain point prohibited Blackletter typefaces claiming they were jewish (\"Judenlettern\")? This was when they found out that some of their favourite typefaces were designed by jewish typographers.\n\n\"Can a typeface have a psychological or subliminal effect on the viewer ( for example, the ability of Fraktur to intimidate / persuade the public and communicate power, etc) ?\"\n\nThere are so many different types of \"Fraktur\", for instance Fette Fraktur is not associated with power but with beer and old fashioned restaurants. There has been a long thread about the different ways of using Blackletters with very different associations on the german [http://www.typografie.info/typoforum/](http://web.archive.org/web/20150414213822/http:/www.typografie.info/typoforum/ \"http://www.typografie.info/typoforum/\") and there is even a german forum that deals exclusively with Blackletter. But maybe you do not speak german?\n\n"
    },
    {
      "time": "10 Sep 2007 — 9:34am",
      "content": "In case you can read German, this is by far the most exhaustive and accurately researched source I know:  \n [http://www.peterrueck.ch/pdf/sprache%20der%20schrift.pdf](http://web.archive.org/web/20150414213822/http:/www.peterrueck.ch/pdf/sprache%20der%20schrift.pdf \"http://www.peterrueck.ch/pdf/sprache%20der%20schrift.pdf\")\n\n"
    },
    {
      "time": "10 Sep 2007 — 10:03am",
      "content": "I would ask me this questions first …  \nDoes an dark, edged typeface based on form elements of Fraktur, Textur and Sans-Serif (!) like one of the \"Neu-Gotische Schriften\"\\* implicates s.th. like totalitarian aggression? Or was it just the (logical) further stage of creating time-referenced typefaces with blackletter influences?\n\n\\*The new blackletter typeface-styles of the early 1930s like Tannenberg, Potsdam, National, etc.\n\n"
    },
    {
      "time": "10 Sep 2007 — 10:16am",
      "content": "I don’t think that there’s anything about Blackletter/Fraktur/Textura/etc. that is especially powerful or commanding, if there were the non-German leaders of Europe would never have ditched it in favor of Roman letters. The Nazis standardized on, and later banned, blackletter for the same reason they did everything: it was politically expedient to do so because it worked well within their ultra-nationalist propaganda machine. But, being anti-idealogical opportunists, they also used other typefaces when they felt like it, even before the 1941 ban on blackletter.\n\nA few things: Pick up Chris Burke’s biography of Paul Renner (amazon sells it), it contains great information on this subject. Watch the Helvetica film when it comes out on DVD, it contains some interesting discussion about the inherent commanding power of some typefaces. Hitler’s propaganda/design guru wrote a memoir, Albert Speer, any decent library probably has a copy.\n\n"
    },
    {
      "time": "10 Sep 2007 — 11:28am",
      "content": "Here are some designs by John Heartfield, a staunch communist in Weimar around 1930.\n\nThe first is the 1928 poster which made his reputation.  \nHe plays on the number \"5\", which is the list number of the communist candidate in the election ballot, using blackletter in a direct manner.\n\nThe second is a 1929 book cover, where he associates nationalism, blackletter, and capitalism.\n\nThe third is a 1930 communist election poster.\n\nIn later anti-Nazi satirical works, he mainly used Futura and Kabel.\n\nSo it seems that his early use of blackletter was an anomaly. The modernists at the Bauhaus, and the soviet constructivists, and Heartfield, took the lead in effectively associating communism with the modern style of art and design which emerged during the 1920s, so the Nazi adoption of blackletter may have been a reactive brand position.\n\n ![](http://web.archive.org/web/20150414213822im_/http:/typophile.com/files/5_3496.jpg)\n  \n.  \n\n ![](http://web.archive.org/web/20150414213822im_/http:/typophile.com/files/Tuch_4490.jpg)\n  \n.  \n\n ![](http://web.archive.org/web/20150414213822im_/http:/typophile.com/files/4_5564.jpg)\n\n"
    },
    {
      "time": "10 Sep 2007 — 11:52am",
      "content": "As for the book cover, the name of the independent left-wing author Kurt Tucholksy is set in blackletter, too - maybe for typographical reasons.\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:44pm",
      "content": "_I suppose you know that the Nazi government at a certain point prohibited Blackletter typefaces claiming they were jewish (“Judenlettern”)? This was when they found out that some of their favourite typefaces were designed by jewish typographers._\n\nKatharina, I believe that is just the excuse that they gave -- I've read somewhere that the actual reason for prohibiting blackletter was more practical, something to do with printing things in typefaces that would be legible outside of Germany. I'll have to look it up when I get home; don't remember where I read it.\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:53pm",
      "content": "Deadbolt, here are some books to check out:\n\n[_Blackletter: Type and National Identity_](http://web.archive.org/web/20150414213822/http:/www.amazon.com/Blackletter-National-Identity-Peter-Bain/dp/1568981252/ref=sr_1_6/102-9738191-2107322?ie=UTF8&s=books&qid=1189457097&sr=1-6)\n\n(There is also the exhibition website: [http://www.cooper.edu/art/lubalin/bletter.html](http://web.archive.org/web/20150414213822/http:/www.cooper.edu/art/lubalin/bletter.html \"http://www.cooper.edu/art/lubalin/bletter.html\"))\n\n[_The Swastika: Symbol Beyond Redemption?_](http://web.archive.org/web/20150414213822/http:/www.amazon.com/Swastika-Symbol-Beyond-Redemption/dp/1581150415/ref=sr_1_1/102-9738191-2107322?ie=UTF8&s=books&qid=1189457261&sr=1-1)\n\n[_Modern typography: an essay in critical history, 2nd edition_](http://web.archive.org/web/20150414213822/http:/www.amazon.com/Modern-Typography-2nd-Robin-Kinross/dp/0907259189/ref=pd_sim_b_4/102-9738191-2107322?ie=UTF8&qid=1189457097&sr=1-6)\n\n[_Unjustified texts: perspectives on typography_](http://web.archive.org/web/20150414213822/http:/www.amazon.com/Unjustified-Texts-Perspectives-Robin-Kinross/dp/0907259170/ref=pd_sim_b_1/102-9738191-2107322?ie=UTF8&qid=1189457097&sr=1-6)\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:58pm",
      "content": "<cite>I’ve read somewhere that the actual reason for prohibiting blackletter was more practical, something to do with printing things in typefaces that would be legible outside of Germany.</cite>\n\nI believe it was because people in conquered nations were having trouble reading the new road signs. I think that the Burke book has the details.\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:58pm",
      "content": "Also, there are previous threads here on Typophile about this topic:\n\n[http://www.typophile.com/node/28919](http://web.archive.org/web/20150414213822/http:/www.typophile.com/node/28919 \"http://www.typophile.com/node/28919\")\n\n[http://typophile.com/node/32720](http://web.archive.org/web/20150414213822/http:/typophile.com/node/32720 \"http://typophile.com/node/32720\")\n\n[http://typophile.com/node/19613](http://web.archive.org/web/20150414213822/http:/typophile.com/node/19613 \"http://typophile.com/node/19613\")\n\n[http://typophile.com/node/18519](http://web.archive.org/web/20150414213822/http:/typophile.com/node/18519 \"http://typophile.com/node/18519\")\n\n[http://typophile.com/node/18227](http://web.archive.org/web/20150414213822/http:/typophile.com/node/18227 \"http://typophile.com/node/18227\")\n\n[http://typophile.com/node/18165](http://web.archive.org/web/20150414213822/http:/typophile.com/node/18165 \"http://typophile.com/node/18165\")\n\nThere are more... these are the first few that I found...\n\n"
    },
    {
      "time": "10 Sep 2007 — 1:59pm",
      "content": "Thanks, James; I'm sure that's it. :-)\n\n"
    },
    {
      "time": "10 Sep 2007 — 2:03pm",
      "content": "\"I’ve read somewhere that the actual reason for prohibiting blackletter was more practical, something to do with printing things in typefaces that would be legible outside of Germany\"\n\nYes, Ricardo, I read that as well. In the occupied territories nobody could read blackletter, and so they decided to switch to good old antiqua. They needed the people to read their proclamations. I hope this is explained better in the link Tim Ahrens mentioned, I must read it. - Anyway the dumb Nazis did not even know the difference between Schwabacher and Fraktur.\n\n"
    },
    {
      "time": "13 Sep 2007 — 7:19am",
      "content": "Katharina is right with the statement of unredability in the occupied territories. Ricardo, you have to read: Alfred Kapr – Fraktur, the history of a typeface. It's in german language, but perhaps you have the possibility to get it translated ... The Fraktur is no german typeface ... in the development of typefaces you can see, that the French and Italian tended to the Antiqua forms and the people above this geographical line tended to use the broken types. It depends also on the book of books ... the Gutenberg Bible which was available and wide spread among the people. They has been used to read this kind of type and went familiar with it.\n\n"
    },
    {
      "time": "13 Sep 2007 — 8:04am",
      "content": "_unredability in the occupied territories_\n\nThat sounds too simple.\n\n"
    },
    {
      "time": "13 Sep 2007 — 8:11am",
      "content": "<cite>That sounds too simple.</cite>\n\nNot really. Once the Nazis aggression began most of Germany shifted to war production, and having huge numbers of men fighting abroad limited production further. To feed the war machine—and the soldiers—it was essential to keep conquering people whose resources could be appropriated and moved rapidly. Communications problems between the Germans and newly conquered nations could have caused the entire German military to break down, so ditching Blackletter was essential.\n\n"
    },
    {
      "time": "13 Sep 2007 — 8:13am",
      "content": "Nick: Yes, thats true that it sounds too simple ... I have to look after the original source, perhaps then i can tell more. I think it has been in the book of Alfred Kapr. It will take a little time for i have to work now ...\n\n"
    },
    {
      "time": "13 Sep 2007 — 10:52am",
      "content": "_Katharina is right with the statement of unredability in the occupied territories._\n\nThanks, Nora, but I was not contradicting Katharina -- she did not mention the unreadability factor in her first comment; she just repeated the excuse the Nazis gave for doing away with blackletter (\"claiming they were jewish\"). I alluded to the legibility factor, and James made the first mention of road signs. Go back and read the comments in order.\n\n_Ricardo, you have to read: Alfred Kapr – Fraktur, the history of a typeface._\n\nThanks for the tip. I only know a few words of German, so I cannot read this book, or Tim's link, in the original language -- but I will try to get ahold of translated versions!\n\n"
    },
    {
      "time": "13 Sep 2007 — 11:47am",
      "content": "Exactly James.  \nBut what has logic got to do with it?  \nAll the tailors were in concentration camps and the soldiers' uniforms were falling to pieces.\n\nBut enough of this blackletter/nazi nonsense.  \nJack, wouldn't an analysis of the role of typography in present day recruitment advertising be more relevant?\n\n[http://www.armyjobs.mod.uk/Army+Life/home.htm](http://web.archive.org/web/20150414213822/http:/www.armyjobs.mod.uk/Army+Life/home.htm \"http://www.armyjobs.mod.uk/Army+Life/home.htm\")\n\n"
    },
    {
      "time": "13 Sep 2007 — 1:29pm",
      "content": "Ricardo: Sorry, this was no answer to you, and therefore I didn't accuse you ... – I wanted to tell Deadbolt the booktitle, but wrote instead – Ricardo. And I seemed to be a bit confused in my first entry here. The title of the book: Fraktur – Form und Geschichte der gebrochenen Schriften (Fraktur – Form and History of broken typefaces), by Albert Kapr (not Alfred!), ISBN:3874392600, Editor: Hermann Schmidt Verlag, Mainz.\n\nNow I' m too tired too translate the really interesting quotes of the book, but here are a few:\n\n... It has a been a long type-struggle in germany – for what font is the right \"german font\". With Luther and the printing of the Bible by Gutenberg, the Fraktur was \"the protestant visible voice\" against the roman catholics and \"their\" roman type. ... Italians and French didn't like the gothic forms in type and turned to use more Antiqua forms ... Roman type and broken type has been existing in germany near by near until the beginning of the 20 th century, but there has always been \"national\" tendencies to prefer one .... 1870: more than 50% of all printed matter in Germany is printed in Antiqua ... Antiqua was the \"globalized world-wide typeform\" and the open-minded preferred the use of Antiqua. ... in 1933 there was edict of the Nazis to use the \"good german type\", to demonstrate the german culture and to empower the self-confidence of the nation ... in 1941 there has been a lot of communication problems in the occupied territories because the people there insisted in not being able to read these kind of letterform – but Kapr mention another reason for changing their mind and now forced to use the Antiqua and to free the lie of the Jewish letterforms: They wanted to demonstrate their connection to the occident (western world) particularly in view to England and the USA but also the friendly-mights \"Mussolini/Italy and Franco/Spain\".\n\nHope its not too confusing now ... and sorry about my english.\n\n"
    },
    {
      "time": "13 Sep 2007 — 2:05pm",
      "content": "Thanks for that translation, Nora. This topic comes up often, it’s good to have an (apparently) knowledgeable German view on the subject.\n\n"
    },
    {
      "time": "13 Sep 2007 — 7:19pm",
      "content": "Yes, danke, Nora! :-) Thanks for taking the trouble to do some on-the-fly translating.\n\nFor my part, I found the book I was looking for: [_Blackletter: Type and National Identity_](http://web.archive.org/web/20150414213822/http:/www.amazon.com/Blackletter-National-Identity-Peter-Bain/dp/1568981252/ref=sr_1_1/104-0871536-9538369?ie=UTF8&s=books&qid=1189735672&sr=1-1). It has an essay called \"Fraktur and Nationalism,\" by Hans Peter Willberg. There is a part where he writes,\n\n\"The real reason for the abolition of fraktur was power politics. In 1941, Hitler's armies were victorious on every front. The future world power had to adapt to the 'world type' (roman) in order to exercise its power.\"\n\n\"The result of this action, however, contradicted the intention: fraktur is now perceived worldwide as Nazi script, even after its interdiction by the Nazis themselves. In France, the Netherlands, Belgium, Czechoslovakia, Denmark (...), and Poland -- in short, in every neighboring country that had been occupied -- fraktur was viewed as the writing of the occupier. Above all, it was the writing of the oppressor for those who had been arrested, with or without trial, and deported to concentration camps. This association has remained unchanged, even with regard to the most beautiful, innocent forms of blackletter types.\"\n\n"
    },
    {
      "time": "13 Sep 2007 — 7:57pm",
      "content": "Nora, I guess this is Kapr's book:\n\n[http://www.typografie.de/verlagsverzeichnis/typografie/260-0.html](http://web.archive.org/web/20150414213822/http:/www.typografie.de/verlagsverzeichnis/typografie/260-0.html \"http://www.typografie.de/verlagsverzeichnis/typografie/260-0.html\")\n\nLast year I saw a presentation, by [Karin and Bertram Schmidt-Friderichs](http://web.archive.org/web/20150414213822/http:/www.tdc.org/events/2006events/2006tdcsalonkarinbertram.html), of Hermann Schmidt Verlag books at the Type Directors Club, and their books are just beautiful. You want to get your hands on them even if you don't know any German!\n\nI have no doubt Kapr's book will someday be available in an English translation, just as his book on [Gutenberg](http://web.archive.org/web/20150414213822/http:/www.amazon.com/Johann-Gutenberg-Man-His-Invention/dp/1859281141/ref=sr_1_4/104-0871536-9538369?ie=UTF8&s=books&qid=1189737185&sr=1-4) is. I am looking forward to it!\n\n"
    },
    {
      "time": "14 Sep 2007 — 7:03am",
      "content": "Thanks to all for your response. To Schmidt Verlag: Yes, Ricardo, you're right. You can feel Karin and Bertrams passion for book-making, typography and design in almost all published books of the Schmidt Verlag. In content and form.\n\nI found two pictures referring to blackletter: One is an embroiderie of my grandmother. She had to stich it, at the age of seven, at school in 1905. They had to learn three letterforms to write: Antiqua, Fraktur and Suetterlin. The other is a german banknote of 1923 – there you can see the use of broken forms, roman, and sans-serif type.\n\n ![](http://web.archive.org/web/20150414213822im_/http:/typophile.com/files/bl01_6500.jpg)\n\n ![](http://web.archive.org/web/20150414213822im_/http:/typophile.com/files/bl02_5484.jpg)\n\n"
    },
    {
      "time": "14 Sep 2007 — 2:31pm",
      "content": "Thanks to everyone for all your help! Some really interesting points have been raised. I've ordered a bunch of books, many of which are the ones recommended here, so I should be able to get the ball rolling pretty soon.\n\n\"But enough of this blackletter/nazi nonsense.  \nJack, wouldn’t an analysis of the role of typography in present day recruitment advertising be more relevant?\"\n\nYes, that too would be an interesting study, but my original interest lies in the role of typography in Nazi Germany - to discover why specific typefaces were used, if for any reason at all, who the typographers were, what they were trying to achieve, whether the work was successful, etc. Perhaps it would be worthwhile to look into typography in today's recruitment advertising as part of my study to see if any parallels can be drawn?\n\n"
    },
    {
      "time": "14 Sep 2007 — 2:53pm",
      "content": "<cite>Perhaps it would be worthwhile to look into typography in today’s recruitment advertising as part of my study to see if any parallels can be drawn?</cite>\n\nDrawing parallels between the Nazis and just about anything else is a pretty bad idea. First, no matter how you do it people will think that you’re calling someone else a Nazi. Second, it’s like shooting fish in a barrel—the Nazis were amoral opportunists led by a madman hell-bent on world domination, so there aren’t many things that they didn’t try in their time on Earth.\n\nI think what Nick is getting at is that your thesis has been done before. Writing about Nazi design is like writing about deconstruction or social responsibility—it’s a horse has been poisoned, stabbed, shot, beaten, whipped, kicked, and so on. He made a similar point to me this summer when we were discussing my desire to do my dissertation about grotesques, including developing a new one. I have since moved on to more contemporary, relevant type to study, and it’s a lot cooler.\n\n"
    },
    {
      "time": "14 Sep 2007 — 3:01pm",
      "content": "If you really wish to pursue the subject, you might try to get hold of Franz-Josef Heyen's book on <cite>Parole der Woche</cite> (Munich 1983). This was a weekly propaganda poster issued by the Nazi party for public display from 1936 to 1943 when, ironically, it fell victim to the war effort. If I remember correctly, the examples in the book show a clear change of paradigm. The early posters take traditional German newspapers as their model, with long columns of Fraktur and nothing but a bit of red colour for visual relief. The later, wartime ones seem to copy commercial advertising in order to attract the attention of passers-by. [Randall Bytwerk's excellent German Propaganda Archive at the Calvin College website](http://web.archive.org/web/20150414213822/http:/www.calvin.edu/academic/cas/gpa/parole.htm) has a few examples of an alternative, miniature version of <cite>Parole der Woche</cite>; this only had the size of a playing card but you still get a good impression of the general approach. Notice in particular the use of sans serif typefaces, for example the slanted version of Futura, which must have been intended to create a modern impression at the time.\n\nIn general, I doubt if there is any such thing as a genuinly Nazi typography. The Nazis used all kinds of typography for functional purposes, to appeal to their various audiences. For example, take a look at this, the title page of the last issue of the weekly newspaper <cite>Das Reich</cite>, dated 22 April 1945\n\n ![](http://web.archive.org/web/20150414213822im_/http:/typophile.com/files/Das%20Reich1_4768.JPG)\n (well, the upper half of the title page, anyway). \n\nIf you ignore the people in the photo and just consider the typography, this might be a perfectly sensible, serious, liberal or conservative bourgeouis quality newspaper which would not have looked amiss amongst the newspapers at any newsstand in Germany in the 1970s or 1980s. Yet in a sense, of course, this is \"Nazi typography\" too, because the Nazis used it to convey their propaganda (there is a rabid article by Goebbels in the rightmost column) to certain audiences which they knew could be impressed by that kind of thing.\n\nSimilarly, if you look at [another part of Mr Bytwerk's site with a different series of posters,](http://web.archive.org/web/20150414213822/http:/www.calvin.edu/academic/cas/gpa/ws.htm) what is Nazi about their visual design? For a particularly nasty but instructive example, scroll down to where it says \"This quotation from Hitler's 30 January 1939 speech promises the destruction of the Jews\", then click on the thumbnail. If you subtract the swastika, the by-line, and perhaps the oak leaves, this might be a quotation from the Bible, or from some great thinker. In fact, however, it is Hitler's declaration that the result of any world war would be the annihilation of the Jews in Europe. The only thing about it that seems genuinly Nazi is that a certain form is borrowed from elsewhere to vest Hitler's words with some sort of quasi-religious authority -- which, of course, chimes in with Hitler's term \"prophesy\", which he used to describe his statement.\n\nI think the same applies to the Nazis' appropriation of blackletter. Sure enough, in the 1920s and 1930s blackletter was to some extent tied to German nationalism. But more simply, it also conveyed ideas of down-to-earth, homely ordinariness -- the typeface of the prayer book, the income-tax form, the beer mat and the local newspaper. I suspect it was precisely this type of connotation which made John Heartfield use blackletter in the 1928 Communist poster -- to suggest that the Communists were not some alien, elitist element, but practical people the working class could trust. (The Tucholsky book, on the other hand, is a sarcastic swipe at German nationalism, which explains the cover design.) To a limited extent, this appeal of blackletter persists to this day -- even in Germany, it is still OK to use blackletter for beer labels and pub signs, although people usually get tripped up over their long and short s these days.\n\nIn fact, I also suspect that it was precisely this type of connotation which made Hitler drop blackletter in 1941 when he thought that the German people were destined for higher things. (The decision to do so was pretty much taken by Hitler on his own, and it was one which created a great deal of consternation amongst his followers.) After all, the architectural model he preferred was not Gothic or Baroque but some sort of blown-up classicism - which, in fact, fits rather well with typography like that of <cite>Das Reich</cite>.\n\nChristoph Coen\n\n"
    },
    {
      "time": "14 Sep 2007 — 3:25pm",
      "content": "Nora, thanks for sharing those wonderful pictures!\n\n"
    },
    {
      "time": "14 Sep 2007 — 3:55pm",
      "content": "Futura too was used in Nazi Germany, and not just by communists!  \nAn all-cap setting of Futura Light, with its proportions from Ancient Rome, goes very well with the neoclassical style that was also favored by the Nazis, along with their use of völkish.\n\nIn German consumer magazines of the 1920s, Antiqua and Blackletter were often mixed -- especially as Blackletter has no italic and bold variants. So the editorial designer would set the body text in blackletter (the most traditional and therefore the most legible no doubt, the same reason 100% of newspapers still use serifed body text today), and captions, sidebars and bylines in Antiqua, with the heads lettered in whatever. Not much ideology there.\n\nI don't think the split typographic personality, referenced in the famous blackletter flip-flop, is particularly Nazi. Consider Koch's Antiqua and Kabel typefaces. They have a lot in common structurally, yet the first is expressionist, and the second modernist. And in as much as expressionism is a 20th century phenomenon, they were both modern.\n\nAs Nora says, there was a division in the German attitude towards blackletter vs. antiqua, and as this thread has revealed, many reasons that one group of people or another may have formed preferences -- so choices were complex and based on many contingencies, not necessarily ideological. For an image and text as stripped down as this 1932 Hohlwein poster, blackletter would have been too fussy.\n\n ![](http://web.archive.org/web/20150414213822im_/http:/typophile.com/files/Unddu_4059.jpg)\n  \nBut not for this 1916 Fritz Erler poster:  \n\n ![](http://web.archive.org/web/20150414213822im_/http:/typophile.com/files/HelftunsBig_6276.jpeg)\n\n"
    },
    {
      "time": "14 Sep 2007 — 11:13pm",
      "content": "“I’ve read somewhere that the actual reason for prohibiting blackletter was more practical, something to do with printing things in typefaces that would be legible outside of Germany”  \nNot just outside Germany, but even inside..the functionality of fraktur was being questioned.  \nApparently, the pilots in the army had too much of a difficulty because all the letterting inside the cockpit was fraktur.  \nIts hard to imagine instructional graphics in fraktur!! eeek!\n\nshreyas\n\n"
    },
    {
      "time": "15 Sep 2007 — 12:56am",
      "content": "Not that Erik Spiekermann has pointed out in an old thread here on typophile that he does not believe in this \"legibility in the occupied territories\" theory, if I recall correctly. Rather, it has to do with what type foundries and printers had left on hand at the time. No new type could be cast by the time of the decree…all metal had to go to the production of armaments. Very interesting theory! I recommend using google to try and find that thread.\n\n"
    },
    {
      "time": "25 Sep 2007 — 12:15pm",
      "content": "\\>No new type could be cast by the time of the decree  \n…all metal had to go to the production of armaments. Very interesting theory!\n\nI think it is just an interesting theory. Because in January 1941 the german army was on the height of its military success and strength.  \nIf the \"Schriftenerlass\" would have been dated later , 1943-44 in the times of what Goebbels had called the \"total war\", maybe that could have been an argument.\n\n"
    },
    {
      "time": "25 Sep 2007 — 12:16pm",
      "content": "\\>Apparently, the pilots in the army had too much of a difficulty because all the letterting inside the cockpit was fraktur.  \nIts hard to imagine instructional graphics in fraktur!! eeek!\n\nThats why they lost the air battle over England, hehe …\n\nHmm, the instructional graphics were not set in Walbaum Fraktur, they were set in highly modernised Bauhaus-influenced Tannenberg or Element and such, or in a Grotesque. Don't forget the people read and identified Fraktur, Neu-Gotische Schriften, Sütterlin, Antiqua, Grotesque, Slab-Serif at the same time – WOW, how dumb we are nowadays ;)\n\nBTW  \nDin (Din Mittelschrift, etc.) was designed in 1937, as far as i remember.\n\n"
    },
    {
      "time": "25 Sep 2007 — 1:16pm",
      "content": "Design on the various DIN faces began in 1917, the first release was in 1919 and they continued into the 1930s. The preliminary design of Mittelschrift was published in 1926, I don’t know when the final version was released. A lot of the DIN history is covered in Albert-Jan Pool’s essay _The History of a Contemporary Typeface_, which can be found in _Made with FontFont_.\n\n"
    },
    {
      "time": "25 Sep 2007 — 1:59pm",
      "content": "Thanks for help, James. :)\n\n"
    },
    {
      "time": "21 Mar 2008 — 11:48am",
      "content": "hey, have u completed ur dissertation? Id love to read it, even buy it off u.  \nLet me know :)\n\n"
    },
    {
      "time": "22 Mar 2008 — 8:02pm",
      "content": "The typography that I most associate with the Nazis is not represented in the references above. I have seen it in movies and in photographs from the period but it is not blackletter and not Futura. I associate it most with stationery from the time and it might have been used in passports and transportation documents. I can best describe it as a Nazified version of Art Deco. A heavy stroke shadowed by a second lighter stroke. I have never seen this digitalised. Anyone have any ideas?\n\nI have done a google search on 'Nazi stationery' and all it turns up is Fraktur or a simple san serif. Couldn't find any examples of what I am thinking of.\n\n"
    }
  ]
}
