{
  "id": "36991",
  "title": "Fontshop website - Problematic or perfect the way it is?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Not wanting to step on anyones toes (Stephen;-) I pose the question. Is the fontshop website hard to use or perfect the way it is? Is it only me who find it slightly incomprehensive? Is this from the sheare number of fonts in their selection or has it something to do with the information architecture of the website? You tell me cause I’m not sure myself;-)\n\n [‹ Logos for Terrorist Organizations](http://web.archive.org/web/20081202181624/http:/www.typophile.com/node/36990 \"Go to previous forum topic\") [Could someone identify this font, please? (Likely trivial) ›](http://web.archive.org/web/20081202181624/http:/www.typophile.com/node/36997 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202181624/http://www.typophile.com/user/16177\" title=\"View user profile.\">Endre Berentzen</a>",
  "time": "<br>",
  "uid": "16177",
  "comments": [
    {
      "time": " 11.Sep.2007 7.11am",
      "content": "It is so much improved - faster and now has keyword search too but the yellow has always given me a bit of a headache. I just don’t like looking at it.\n\n"
    },
    {
      "time": " 11.Sep.2007 7.18am",
      "content": "I find it pretty irritating to browse; if I don’t know the name of the font that I’m looking up I just go elsewhere.\n\n"
    },
    {
      "time": " 11.Sep.2007 8.12am",
      "content": "But yellow is such a pretty colour;o)\n\nI’m with James. Also I think the typenavigator is not optimal - I never quite find what I am after.\n\nBut as Pattyfab says it has improved.\n\n"
    },
    {
      "time": " 11.Sep.2007 12.13pm",
      "content": "Hi Endre. You’re in Norway, but I assume you’re referring to [fontshop.com](http://web.archive.org/web/20081202181624/http:/fontshop.com/), correct?\n\nThere are so many different ways to shop for fonts that no single site can perfectly meet all needs. To answer your questions, it will help to understand how you, Endre, look for fonts. Give me a typical scenario. Maybe I can guide you through the best way to navigate fontshop.com or maybe there’s a better way to approach your search.\n\n"
    },
    {
      "time": " 11.Sep.2007 2.19pm",
      "content": "Yes Stephen, I read your thread on how to bypass the regional website, so I am referring to fontshop.com\n\nI will definetely get back to you on my search patterns but it’ll have to wait a day: Someone got sick and all of a sudden I have got a hefty deadline to reach. That combined with that my search patterns might take some time to explain;o)\n\nThanks for dropping in on the thread though Stephen\n\nGotta run!!\n\n"
    }
  ]
}
