{
  "id": "36997",
  "title": "Could someone identify this font, please? (Likely trivial)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Greetings. It's been a while since my last visit, but this is one of my favorite forums and I think I'll stay awhile this time.\n\nMy college has a logo that was once official (it's been demoted, but is still very popular). It was designed back before EPS stood for anything, so there's no vector of it online (which is not a big deal, it's pretty easy to trace it). I doubt the college would offer up a vector either, considering its unofficial status.\n\nWhat I'd like to know is, what exactly is this font?\n\n ![](http://web.archive.org/web/20131108190159im_/http:/typophile.com/files/bullet_logo_6644.gif)\n\nHere's what I've managed to glean off of it, beginning with the obvious:  \n- Sans serif  \n- No bars on the I (and presumably the J)  \n- Bowls are closed  \n- Verticals are all equally long and wide  \n- Stroke in R is wider than vertical  \n- Bowls in R and P have entirely different proportions- R's is shorter, P's is thinner\n\nI presume that this font is the kind that tries to keep its capital characters in line- what I mean is, there is probably no capital letter taller than any other- and that most characters are boxy and symmetrical- no spurs or complicated stems or what have you.\n\nHas anyone got any ideas?\n\n",
  "author": "rezmason",
  "time": "11 Sep 2007 — 7:14am",
  "uid": "6265",
  "comments": [
    {
      "time": "11 Sep 2007 — 7:41am",
      "content": "Try Interstate.\n\n"
    },
    {
      "time": "11 Sep 2007 — 8:09am",
      "content": "And try the Type ID Board next time.\n\n[http://typophile.com/forum/29](http://web.archive.org/web/20131108190159/http:/typophile.com/forum/29 \"http://typophile.com/forum/29\")\n\n"
    },
    {
      "time": "11 Sep 2007 — 11:14am",
      "content": "Sorry, PF. This forum's gone through some changes since I last visited.\n\n"
    },
    {
      "time": "11 Sep 2007 — 2:18pm",
      "content": " ![](http://web.archive.org/web/20131108190159im_/http:/typophile.com/files/puckman_5353.png)\n\n"
    }
  ]
}
