{
  "id": "36998",
  "title": "Type exhibition - looking for lenders",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As I mentioned in [this thread](http://web.archive.org/web/20131019013317/http:/typophile.com/node/19244), I have begun planning an exhibition on the theme of type design and national identity, 1900-1960. I am pleased to report that we have a venue: the exhibition, \"Face the Nation: How National Identity Shaped Modern Typeface Design,\" will take place beginning next summer at the [Minnesota Center for Book Arts](http://web.archive.org/web/20131019013317/http:/mnbookarts.org/index.html).\n\nI am now trying to round up objects to display that will convey the case studies I plan on having as parts of the show. Can you help? I am looking for offers to lend objects (specimens, other printed examples, type, matrices, etc.) related to:\n\n- GENERAL: typecasting and -setting technology 1900-1960\n- NORWAY: Gerhard Munthe, medieval letterform revivals\n- GERMANY: Koch, new blackletter designs\n- GERMANY: 20s sans-serifs: Futura, Erbar, Kabel\n- ENGLAND: Gill Sans\n- FRANCE: Deberny & Peignot sans, e.g. Bifur\n- SWITZERLAND: Helvetica, Univers\n- USA: Goudy\n- CZECHOSLOVAKIA: Vojtech Preissig\n- IRELAND: Colm O Lochlainn, new Irish/Gaelic script types\n- JEWISH DIASPORA: Hugh Schonfield, \"New Hebrew Typography\"\n\nI can give assurances about security, insurance, climate control, etc. All loans will, of course, be gratefully acknowledged on exhibition labels and the checklist.\n\nThanks in advance for any offers or leads you can provide. I appreciate the help, and I invite you all to come to Minneapolis next year to see the show.\n\n",
  "author": "eliason",
  "time": "11 Sep 2007 — 7:55am",
  "uid": "3254",
  "comments": [
    {
      "time": "11 Sep 2007 — 12:00pm",
      "content": "Try to contact the Type Museum  \n [http://www.typemuseum.org/contact.htm](http://web.archive.org/web/20131019013317/http:/www.typemuseum.org/contact.htm \"http://www.typemuseum.org/contact.htm\")\n\nThey are currently closed down, so their exhibits (not that they ever managed to get much exhibited) are sitting around gathering dust but they do have a wealth of specimens, type and matrices, including a monowidth Gill Sans developed for timetables.\n\nTim\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:03pm",
      "content": "I think you'll be tough to get samples of Munthe. To my knowledge this type was never digitised and destroyed in a bombing during world war 2. I have never seen an actual sample but only reproductions. They would have to come from somewhere though. Let us know how you go. I would love it if you found some actual samples.  \nAny found samples should really be placed in a museum here in Norway afterwards.\n\n"
    },
    {
      "time": "12 Sep 2007 — 1:02pm",
      "content": "@Tim: Thanks for the tip.\n\n@Endre: Yes, my best hope for telling Munthe's story, I imagine, is displaying some of his earlier book designs that, though not made with type, document his interest in older regional letterforms.\n\n"
    },
    {
      "time": "13 Sep 2007 — 12:25pm",
      "content": "Re Gill - just saw the movie \"Looking For Mr Gill\" here at ATypI - the director Luke Holland is looking for screening oportunities in the states - you can contact him at [zef@mistral.co.uk](mailto:zef@mistral.co.uk)\n\n"
    }
  ]
}
