{
  "id": "37009",
  "title": "(x) \"Anatane et Les Enfants d'Okura\" heavy sans - similar to Harry Obese {Stephen}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Hello,  \ni'm writing this topic on Heron2001's advice  \ni need to know the **exact name** of the font used on this image\n\n[http://wtf2.myfonts.com/uploads/images/70/703aa3f13428a6b328a1d1319569a4cd.36731.jpeg](http://web.archive.org/web/20130807074107/http:/wtf2.myfonts.com/uploads/images/70/703aa3f13428a6b328a1d1319569a4cd.36731.jpeg)\n\nit's for a job.  \nThe original designer is out of reach, of course,  \nand we need to know if we can use the font commercially.\n\nTopic also opened on MyFonts  \n [http://www.myfonts.com/WhatTheFont/forum/viewthread.php?threadid=91775](http://web.archive.org/web/20130807074107/http:/www.myfonts.com/WhatTheFont/forum/viewthread.php?threadid=91775 \"http://www.myfonts.com/WhatTheFont/forum/viewthread.php?threadid=91775\")  \nbut no match, yet.\n\nThanks a lot\n\n(how do you show/link an image on this board ?)\n\n",
  "author": "tophy52",
  "time": "11 Sep 2007 — 12:48pm",
  "uid": "5168",
  "comments": [
    {
      "time": "11 Sep 2007 — 1:31pm",
      "content": "\\> how do you show/link an image on this board ?\n\nMy recommendation would be to read the following:  \n [!!! PLEASE READ THIS FIRST !!! How to post a sample or image](http://web.archive.org/web/20130807074107/http:/typophile.com/node/18067)\n\n"
    },
    {
      "time": "11 Sep 2007 — 2:29pm",
      "content": "I believe this is Harry Obese with a modified 'S' and 'N'. Red Rooster has digitized [Harry Obese Squeezed](http://web.archive.org/web/20130807074107/http:/www.fontshop.com/fonts/singles/red_rooster/harry_obese_squeezed/).\n\n ![](http://web.archive.org/web/20130807074107im_/http:/typophile.com/files/harry_3785.gif)\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:34pm",
      "content": "Jan, Tophy's native tongue is French - and I think he did great in trying to express what he is after. He may not have posted a picture the regular way -- but has posted to where you can see the sample. This is a person who sincerely is asking for help. By the way, I've tried to put his image up -- and though it is a 600 pixel wide .jpg in RGB - and it says it's uploaded - it just isn't previewing...\n\nAnd Steve - thank you for trying. The \"S\" is not the same. The closest any of us at WTF came was Imago (from dafont.com) who thought Magistral was close. I wonder if the original typositor for Harry had alternatives - I'll have to check... probably did! In my old book Harry was called Blotto Black, a main S and two alternatives, but none of them looked like the sample... shucks.\n\nHopefully someone will find it for Tophy. Coup dedans là (Hang in there) Tophy\n\nJackie T aka Heron2001\n\nP.S. Trying to upload sample again - it had a .jpeg instead of a .jpg\n\n ![](http://web.archive.org/web/20130807074107im_/http:/typophile.com/files/Anatane_4142.jpg)\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:33pm",
      "content": "Jackie. All I did was answering the question. My native tongue is German. So what?\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:39pm",
      "content": "I didn't know that Jan - Your English has always been, well, English. I think I just read it in the wrong fashion. My apologies. I can remember one Type site - that if you didn't do it exact, you were bombasted -- I think I'm just playing a left over tape... sorry if I offended you in any way.\n\nBTW, it's just my protective nature I guess, I am glad that Tophy came here for help on my suggestion. As much as I do love WTF, there are some IDs I find (when Philippe2 isn't around) that get ID'd quicker here.\n\nI am surprised, I got the sample to upload to here, but in doing so, it put my response below yours... go figure. I didn't know that by editing, it moved the response to the last one...\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:42pm",
      "content": "\\>\\>\\> _how do you show/link an image on this board ?_\n\n\\>\\> _My recommendation would be to read the following:  \n!!! PLEASE READ THIS FIRST !!! How to post a sample or image_\n\n\\> _Jan, Tophy’s native tongue is French_\n\n??? All Jan did was giving a straight answer to a straight question. What was wrong with that?\n\n\\> _Coup dedans là (Hang in there)_\n\nThese words are French, but that's not French. ;^)\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:49pm",
      "content": ":-)\n\nP.S. Bald - the only French slang I have learned over the years is not fit for a public board :-) -- so it's easier for me to use the English slang like hang in there - and translate word for word...\n\n"
    },
    {
      "time": "12 Sep 2007 — 1:52am",
      "content": "Wow, thanks to all, and to Stephen Coles.  \nI wasn't sure that the original designer of the title ANATANE simply used a font  \nor if he mixed a few and redesigned some letters, now it shows.\n\nI guess it's a mix of Harry Obese and some very heavy sans serif (Futura XBlack, Antique Olive North redesigned... ?) for the N, D and K,  \nthe S comes from another thing...  \nOK, at least, we know where to start from, and that all letters are from the same font.\n\nThanks again.\n\nTo Jan,  \ni know how to post an image, no problem, but i'm new on this forum, and i just couldn't find the way to visualize an image coming from a MyFonts page,  \nas we usually write the tags [img].... [/img] to show an image coming from another web page.  \nPlus, my home computer is a MacOs 9.2, Mozilla 1.31, which doesn't support the Attach image button, and decided to quit when i touched it ! That's why i wrote the link.\n\n;)\n\n[Tophy52](http://web.archive.org/web/20130807074107/http:/tophy52.free.fr/)\n\n"
    },
    {
      "time": "12 Sep 2007 — 4:16am",
      "content": " ![](http://web.archive.org/web/20130807074107im_/http:/typophile.com/files/anatane_4949.png)\n\nAlthough not the full 100% match it is closer than Harry Obese. Note the A, K, N and R.  \nS is still a bit of a trouble maker. Slightly modified S from Revue might do the job.  \nMore [here](http://web.archive.org/web/20130807074107/http:/www.abstractfonts.com/forum/thread/33775#post).\n\nEdit kk:  \nThe font used in this pict is the Governor Expanded of Iconian Fonts.\n\n"
    },
    {
      "time": "12 Sep 2007 — 7:14am",
      "content": "\\> _i know how to post an image, no problem, but i’m new on this forum, and i just couldn’t find the way to visualize an image coming from a MyFonts page, as we usually write the tags [img].... [/img] to show an image coming from another web page._\n\nAha, that explains everything. Linking/showing images from other websites doesn't work on Typophile. You need to actually upload the image on the Typophile server.\n\n"
    },
    {
      "time": "12 Sep 2007 — 8:14am",
      "content": "Yves, didn't the URL of the pict already explain that?\n\n"
    },
    {
      "time": "12 Sep 2007 — 8:54am",
      "content": "Nope. I'm stoopid that way. :^P\n\n"
    },
    {
      "time": "12 Sep 2007 — 10:46am",
      "content": " ![](http://web.archive.org/web/20130807074107im_/http:/typophile.com/files/leesbrilletje_5592.jpg)\n\n"
    },
    {
      "time": "12 Sep 2007 — 11:32am",
      "content": "Wow this became enjoyable and very international\n\nFrance: Tophy  \nGermany: Jan  \nUSA: West Coast: Steve; East Coast: me  \nBelguim: Bald Eagle  \nNetherlands: Koeiekat\n\nAnd who said people don't get along?\n\n"
    }
  ]
}
