{
  "id": "37007",
  "title": "Printing resolution worry",
  "forum": "Design",
  "tags": [

  ],
  "content": "Tomorow I plan to print 3 A2 posters. All 3 posters are made up photos I took on my digital camera. I have printed photos taken on my digital camera at A3 before and they have been fine, but never A2. So Im worried the images would come out all pixalted.\n\nThe dpi of the photos is 180, and I will crop them all down to A3.\n\nDo you think it will be okay to print A2?\n\nThanks salot\n\np.s What do you think of the poster? There are going to be 2 more in similar vain.\n\n ![](http://web.archive.org/web/20081104035554im_/http:/www.typophile.com/files/IMG_4618_6096.jpg)\n\n [‹ Anyone familar with cyrillic letters](http://web.archive.org/web/20081104035554/http:/www.typophile.com/node/37602 \"Go to previous forum topic\") [typeface for jewish cultural institution in norway ›](http://web.archive.org/web/20081104035554/http:/www.typophile.com/node/37440 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081104035554/http://www.typophile.com/user/20557\" title=\"View user profile.\">tomlobo</a>",
  "time": "<br>",
  "uid": "20557",
  "comments": [
    {
      "time": " 11.Sep.2007 11.59am",
      "content": "What is the output device?\n\n"
    },
    {
      "time": " 11.Sep.2007 12.05pm",
      "content": "for printing? sorry, Im confused by ’out put device’\n\n"
    },
    {
      "time": " 11.Sep.2007 12.10pm",
      "content": "LEGIBILITY IS ONLY IN THE MIND OF THE CREATOR\n\n"
    },
    {
      "time": " 11.Sep.2007 12.12pm",
      "content": "that is a damn good saying/quote\n\n"
    },
    {
      "time": " 11.Sep.2007 12.59pm",
      "content": "For posters 150 dpi (at 100%) is usually sufficient, so you should be fine at 180.\n\nAs for the design, I love the images, but I’ve been seeing an awful lot of that type style lately...\n\n"
    },
    {
      "time": " 11.Sep.2007 1.13pm",
      "content": "Resolution is in the eye of the beholder.\n\nMost people can’t really distinguish detail under 150th — 200th of an inch or so... unless they’re dealing with A) really small things, like 9 pt type, or B) aggregate details, like smooth gradients and the like.\n\nAnd kepp in mind that distance plays a factor... nobody’s gonna see 1 inch details on a Billboard, but they’ll notice a 1/200th dot on a business card.\n\nI doubt you’ll have any trouble printing a poster at 180 ppi, unless it’s going to be on display and highly scrutinized.\n\n"
    },
    {
      "time": " 11.Sep.2007 1.16pm",
      "content": "thanks alot tdf\n\nhaha, yeah i know, but i couldnt find anyother typefaces i like (plus i left doing it to the last minute) so i just quickly made that one as im quite fond of it for headings etc. Plus i didnt want to use Akzidenz Grotesk for this, as i allways use it, i wanted something the complete opposite.\n\ni wanted to go for a hand drawn effect but i dont have a tablet or enough time to trace in illustrator. if anyone has recomendations for typefaces they think could work that would be fantastic, thanks.\n\n"
    },
    {
      "time": " 11.Sep.2007 1.19pm",
      "content": "scott leyes, thats really helpful info, thanks:) thats the thing, its for a exhibition im part of so it might be! invited my tutors too! i just would rather print A2 then A3, but if i have to ill print A3 as i know it will be fine.\n\n"
    },
    {
      "time": " 11.Sep.2007 1.31pm",
      "content": "Just make sure your work gets printed at 80 or 90 lines per inch. If it’s printed at 150, 175 or 200 lpi, the pixels may be notticeable.\n\nHéctor\n\n"
    },
    {
      "time": " 11.Sep.2007 7.52pm",
      "content": "“Beauty is in the behind of the beholder”—Dr. Irwin Corey\n\n"
    },
    {
      "time": " 12.Sep.2007 2.35pm",
      "content": "Resolution in printing industry is expressed in lines per inch (lpi). Resolution in the digital world is expressed in dots per inch (dpi). As a rule of thumb, dpi should be twice the desired lpi, at 100% size.\n\nSo, to print your A2 posters (with image covering entire poster) using a 150lpi screen (a typical screen for today’s printer), you’ll need the digital image to be 300dpi at 420mm x 594mm.\n\n"
    },
    {
      "time": " 28.Sep.2007 7.46am",
      "content": "Remember, most posters are viewed from a distance, so resolution isn’t as much of a factor as something that would be scrutinized more closely, like a book or magazine.\n\n"
    }
  ]
}
