{
  "id": "37011",
  "title": "Dealing with long brand names",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello Typophiles,\n\nI'm new to this site and even a bit new to typography in general. I do want to learn about it though. I'm an intern-student at a regional studio and I've really been having a frustratingly hard time designing with simple shapes and typography, while I'm quite good at illustration.\n\nLately, I've been banging my head about a new corporate identity that features quite a lot of text. It consists of a name (3 words) and a subtitle (2 words, describing it's services and joined by an & character). I'm not going to bother you with any details about the identity itself and have you guys indirectly designing it for me, I'd rather like to learn how to get there.\n\nCould anyone share any useful tips or resources with me when designing a logo/typographic logo with a long names? Are there elements there should be payed specific attention to?\n\nFinally I would like to know if there are any articles out there about choosing typography in general, since I often seem to choose wrong or unfitting typography. Actually, anything on the web a student should read about typography and logo design would be helpful.\n\nCheers,  \nHessel.\n\n",
  "author": "hezz",
  "time": "11 Sep 2007 — 1:23pm",
  "uid": "21660",
  "comments": [
    {
      "time": "11 Sep 2007 — 1:37pm",
      "content": "Books. Lots and lots of Books. Enter \"Typography\" on Amazon and see what comes up. Or just google \"typography\".\n\nAs for logos with lots o' type, you can really go two ways:\n\n1) Use fantastic typography to make those words sing. Sometimes you can interconnect letters, words, etc. to achieve an interesting logotype. Play with negative space between the words.\n\n2) Design a fabulous Icon or illustrative Mark, and shrink the text down to be a sub-unit of the whole Logo... that is, the mark stands out on it's own, but appears with the words for \"official\" uses. Sometimes this will work with initials, too. I often take proper names and create a symbol from their initials, like \"NL&A\" instead of \"November Lazar & Associates.\"\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:39pm",
      "content": "For books check out the [Typophile books](http://web.archive.org/web/20150218042724/http:/typophile.com/books) section. There is an Essentials section that is a good place to start.\n\n"
    },
    {
      "time": "11 Sep 2007 — 8:08pm",
      "content": "I've found out that when I have hired illustrators and tried to teach them typographic design, it was difficult for them to think in solid shapes such as bodies of type.\n\n"
    },
    {
      "time": "12 Sep 2007 — 5:35am",
      "content": "Thanks for the tips, I see that the book thinking with type is a good essential read and I'll see to it that I atleast order that.\n\n<cite>I’ve found out that when I have hired illustrators and tried to teach them typographic design, it was difficult for them to think in solid shapes such as bodies of type.</cite>\n\nWhat did you do to help them on their way?\n\n"
    }
  ]
}
