{
  "id": "37019",
  "title": "Pairing for Frutiger?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m working on a technical proposal, and planning on setting the body in Frutiger, and was wondering if anyone might recommend a complimentary typeface for headers, etc.\n\nThanks,  \nAndrew\n\n [‹ Dealing with long brand names](http://web.archive.org/web/20071031064225/http:/www.typophile.com/node/37011 \"Go to previous forum topic\") [Should I or Should I not? ›](http://web.archive.org/web/20071031064225/http:/www.typophile.com/node/36833 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071031064225/http://www.typophile.com/user/17638\" title=\"View user profile.\">abpend</a>",
  "time": "<br>",
  "uid": "17638",
  "comments": [
    {
      "time": " 11.Sep.2007 6.00pm",
      "content": "Frutiger would work well with so many typefaces. Tell us more about the client and their audience to help us narrow it down.\n\n"
    },
    {
      "time": " 11.Sep.2007 6.17pm",
      "content": "I’m not a designer or anything, and I’m the one writing the proposal. I do web development work, some corporate, and some non-profit, and I’m looking for something that looks clean and modern, but not distracting. This proposal, in particular, is for a web 2.0-ish application for a professional organization. The proposal probably won’t be read by more than three or four people (a mix of technical staff and non-technical stakeholders - lawyers, mostly), but I’d like to make a good impression.\n\n"
    },
    {
      "time": " 11.Sep.2007 8.04pm",
      "content": "There is a lot of mileage in the Fruitiger family. Because it is a family with versions that provide the necessary contrast for heads and subheads. Stay with Frutiger if possible.\n\n"
    },
    {
      "time": " 11.Sep.2007 8.29pm",
      "content": "Me thinks keep it simple and use a different width/weight of Frutiger; like if your body is condensed/light then go for extended/bold with a swatch compliment too...\n\n"
    },
    {
      "time": " 11.Sep.2007 11.25pm",
      "content": "Okay, that’s easy enough. Thanks!\n\n"
    }
  ]
}
