{
  "id": "37038",
  "title": "Computer to Plate Letterpress",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "When I was in college, I remember using a shop in Atlanta that would take Illustrator files and, for around twelve bucks, would make a perfect 9x12\" letterpress printing block of your design.\n\nDoes anyone know of a similar service that might still be around anywhere?\n\nThanks.\n\n",
  "author": "<a href=\"/web/20120121081607/http://typophile.com/user/10323\" title=\"View user profile.\">Fisheye</a>",
  "time": "<br>",
  "uid": "10323",
  "comments": [
    {
      "time": "",
      "content": "I know of a few in New York including SoHo Letterpress but beware, customer service isn't their priority.\n\n"
    },
    {
      "time": "",
      "content": "Yeah, that tends to be common with these sorts of things. Still, I wouldn't mind you referring them to me. Thanks.\n\n"
    },
    {
      "time": "",
      "content": "Photopolymer plates are pretty standard for commercial letterpress. Here in Portland, it's the standard technique for things like wedding invitations. Like any kind of printing, I think good results often depends upon developing a relationship with the service provider. For example, if you're careful, you can fit several jobs onto one plate and then separate them for printing.\n\n"
    },
    {
      "time": "",
      "content": "Thanks guys. And for the record, I found the place I used to use back in the day. They're still around and very good: [Owosso Graphic Arts](http://web.archive.org/web/20120121081607/http:/www.owossographic.com/).\n\n"
    },
    {
      "time": "",
      "content": "[http://www.insiderpages.com/b/3718981279](http://web.archive.org/web/20120121081607/http:/www.insiderpages.com/b/3718981279 \"http://www.insiderpages.com/b/3718981279\")\n\nI can't remember the name of the woman who runs it. Just be prepared, they take forever. But they do a nice job and will work with you to get it right. Altho it sounds like you might only want the plate, not the job printed, should be simpler.\n\n"
    },
    {
      "time": "",
      "content": "Some letterpress studios have their own polymer plate-makers, like [http://www.peterkrutyeditions.com](http://web.archive.org/web/20120121081607/http:/www.peterkrutyeditions.com/ \"http://www.peterkrutyeditions.com\")\n\nR\n\n"
    }
  ]
}
