{
  "id": "37045",
  "title": "Futura T?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all, I'm looking for a typeface called Futura T. We have it in our office type library and are using it in a project for a client, but need to hand it off now and just cannot find it anywhere. We looked at URW but they don't offer the specific face we need, Futura T Light Re 1?\n\n ![](http://web.archive.org/web/20130103011036im_/http:/typophile.com/files/futurat_5320.jpg)\n\non the left. The right is Futura T Light Shaded 1, from the same family we have. We've had no luck finding anything on these shaded faces, only regular book ones. Does anyone know anything about them, or if we could purchase them anywhere? Thanks\n\n",
  "author": "sskdg",
  "time": "12 Sep 2007 — 11:33am",
  "uid": "21704",
  "comments": [
    {
      "time": "12 Sep 2007 — 12:53pm",
      "content": "Futura T is a URW face. The T stands for Text (as opposed to D for display). Those shaded fonts you show were part of a URW CD collection called \"Design Collection\"\n\nUnfortunately I think a lot of those URW faces are now unavailable. Did you look on FONTS.COM? I remember looking through their library a few months ago, looking in vain for a particular URW font, and noticed that they did have some of them.\n\nJames\n\n"
    },
    {
      "time": "12 Sep 2007 — 1:12pm",
      "content": "James is right about the \"T\". I looked on fonts.com, but didn't see it.\n\n"
    },
    {
      "time": "12 Sep 2007 — 1:28pm",
      "content": "Maybe ParaType's [Futuris Shadow](http://web.archive.org/web/20130103011036/http:/www.fontshop.com/fonts/singles/paratype/futura_futuris_shadow_light_ot/) can substitute.\n\n"
    },
    {
      "time": "12 Sep 2007 — 1:38pm",
      "content": "I think I can help you.\n\n"
    },
    {
      "time": "12 Sep 2007 — 1:59pm",
      "content": "Sorry if this isn't much help, but it's an observation.  \nThose fonts look like pretty straightforward mechanical modifications.  \nAnother face in the genre is Gill Sans Shadowed, which is slightly more interesting--note that the shapes have been nuanced on a per-letter basis. All four angles here are different:\n\n ![](http://web.archive.org/web/20130103011036im_/http:/typophile.com/files/Nangle2_3883.jpg)\n\n"
    }
  ]
}
