{
  "id": "37049",
  "title": "Embossing",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I just had a disaster with an embossing project that was supposed to be and ode to nothing...well it was nothing! No ink was to be used. However the shadows of the font were to be cast onto the paper creating an architectural 3 dimensional structural look.\n\nAnyone have any experience with this who could explain to me the mathematics of what font size and weight is needed to pull off the nothing...but something look?\n\n [‹ Am I an idiot? A typophile search function question](http://web.archive.org/web/20080704154944/http:/www.typophile.com/node/37117 \"Go to previous forum topic\") [Cheap T-26 Fonts?! ›](http://web.archive.org/web/20080704154944/http:/www.typophile.com/node/37036 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080704154944/http://www.typophile.com/user/21712\" title=\"View user profile.\">mgistrand</a>",
  "time": "<br>",
  "uid": "21712",
  "comments": [
    {
      "time": " 12.Sep.2007 2.00pm",
      "content": "As a letterpres printer I will tell you that a male and female die must be created to give you the sculptured look. The 3 dimensional effect is done by altering the depth of the female die. This is a hand engraving for the die maker similar to the die and punch maker for minting coins. Sometimes the male die is created by making an impression on the tympan of the press that has a layer of soft material the will harden after the impression is made from the female. Am I getting too technical?  \nTry taking a coin or key and pressing it into soft putty and you will see what I mean about a female die.\n\nNo math involved!\n\n"
    },
    {
      "time": " 12.Sep.2007 2.17pm",
      "content": "I think Robert’s nailed it here. The nice, hard edged effect it sounds like you’re after would be best when created with a male and female set up. What stock were you using for the job? This plays a huge part as well.\n\n"
    },
    {
      "time": " 13.Sep.2007 5.12pm",
      "content": "This is one of those things everyone seems to learn the hard way. Everyone seems to.  \nRobert nailed it. Next time do some research with other designers here or elsewhere which provider should be used for this type of job. It is a craft that though many may offer the service not many knows excactly how to do it right. We are talking the right paperstock, humidity, male and female die, amount of pressure etc etc. Make sure you find the ones who do it right. Myself: I’ll send that kind of job to a specialist in the other end of my country or overseas just to make sure it’s handled right.\n\n"
    },
    {
      "time": " 16.Sep.2007 2.29am",
      "content": "Moved this thread to General Discussions — this doesn’t belong in the Type ID Board.\n\n"
    },
    {
      "time": " 16.Sep.2007 7.56am",
      "content": "The stock is indeed very important. When I embossed something myself on a letterpress, I didn’t have access to a male-female die, I went with just a photopolymer plate, and raised it quite alot on the press so that it would emboss. I didn’t have to do anything fancy for it to work, only sturdy enough stock and enough raise on the press / pressure. This way an impression is made only on one side of the stock. [See the result here](http://web.archive.org/web/20080704154944/http:/www.flickr.com/photos/11494488@N05/1324516028/).  \nI did use a _very_ slight drip of clear ink or satin varnish.  \nWith thinner stock you probably would have to use a male-female die.\n\n"
    }
  ]
}
