{
  "id": "37068",
  "title": "Logo Ideas - thoughts",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi, I run a small, but growing, music company, and I am trying to come up with a more modern logo for use on some guitar products we have coming out in the fall. Any thoughts, likes or dislikes - here’s a few ideas:\n\n ![](http://web.archive.org/web/20080906164625im_/http:/www.typophile.com/files/logofarm3_4801.gif)\n\nThe font is Fontin Sans with a 4 degree shear applied in Illustrator\n\nThanks in advance!\n\n [‹ Approaching a handmade book](http://web.archive.org/web/20080906164625/http:/www.typophile.com/node/38889 \"Go to previous forum topic\") [Best looking exclamation mark ›](http://web.archive.org/web/20080906164625/http:/www.typophile.com/node/38703 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906164625/http://www.typophile.com/user/21703\" title=\"View user profile.\">AndrewC</a>",
  "time": "<br>",
  "uid": "21703",
  "comments": [
    {
      "time": " 13.Sep.2007 2.25am",
      "content": "Hello Andrew,\n\nNice. I like the first one a lot, but i think the weight of the name is a little to heavy.\n\nPieter\n\n"
    },
    {
      "time": " 13.Sep.2007 2.26am",
      "content": "The colors of the first logo are nice, but i think you have to change the color of the name to the dark color in the logo.\n\nPieter\n\n"
    },
    {
      "time": " 13.Sep.2007 2.34am",
      "content": "Thanks Pieter...here’s a few changes after your advice...\n\n ![](http://web.archive.org/web/20080906164625im_/http:/www.typophile.com/files/logofarm4_5048.gif)\n\n"
    },
    {
      "time": " 13.Sep.2007 3.23am",
      "content": "What happened to dot on the ’i’!  \nI definitely like that revised one better. I’m thinking perhaps the typeface isn’t quite the right fit. You’ve got a lovely vintage feel with the graphic and I’d love to see a typeface with even a slight retro/vintage feel to it.\n\nWhen I think of guitar I think of script-like typefaces but either modified or custom-made logotype.\n\nI believe you need to find a way to get the graphic to fit with the type, at the moment it they feel separate—and they definitely are, looking at your original concepts.\n\n"
    },
    {
      "time": " 13.Sep.2007 5.26am",
      "content": "The i’s took a leap into the unknown...This should be better...\n\n ![](http://web.archive.org/web/20080906164625im_/http:/www.typophile.com/files/logofarm5_5123.gif)\n\nI designed our current Script font logo a couple of years ago and I am starting to dislike it, first because it is very reminiscent of one of our main competitors, but most importantly because it covers a large amount of vertical room, making it hard to fit on some of our newer products, like 7mm diamater cabling and stratocaster pickups (check out [www.tonerider.com](http://web.archive.org/web/20080906164625/http:/www.tonerider.com/ \"www.tonerider.com\") if you have no idea what they are). Here’s the script logo we currently use on packaging but not on products.\n\n ![](http://web.archive.org/web/20080906164625im_/http:/www.typophile.com/files/logoblack150_5734.gif)\n\nAlso some of the letter forms are just plain ugly, like the “e’s.\n\n"
    },
    {
      "time": " 13.Sep.2007 5.53am",
      "content": "The thinner text looks better. Perhaps you can sland the graphic the same angle as the name is.  \nI like the current logo, but you are right about all the guitar brands who also have a script logo. It’s good to seperate from them.\n\nPieter\n\n"
    },
    {
      "time": " 13.Sep.2007 6.44am",
      "content": "I wonder why isn’t this post in the Logo critique forum?\n\n"
    },
    {
      "time": " 13.Sep.2007 7.36am",
      "content": "I like the thinner, and would even farther in that direction, but I’m not sold on the font, or the shear, which I find disconcerting. Fontin has an Italic you might consider.\n\n ![](http://web.archive.org/web/20080906164625im_/http:/www.typophile.com/files/tonerider_4302.gif)\n or smallcaps. \n ![](http://web.archive.org/web/20080906164625im_/http:/www.typophile.com/files/toneridersm_3819.gif)\n\n"
    },
    {
      "time": " 13.Sep.2007 7.39am",
      "content": "Speaking as a musician, I am wondering if your product’s signature sounds is clean? If so the thinner weights would convey that better than the heavy, imo. But if the word you’d use is fat, then never mind.  \n; )\n\n"
    },
    {
      "time": " 13.Sep.2007 7.49am",
      "content": "litera - the logo critique forum? ouch, didn’t know there was one. should I move it, or repost?\n\nThe shear reminds of the Eras family, which is a good thing for me, although they were hopelessly overused a few years ago.\n\nAs for the sound, we do everything from vintage “clean” products to some fairly high output stuff - for example a new British-style distortion box is in the works that can really scream. Describing tone in words is hard, but in a font. I suppose that’s why I am posting here!\n\n"
    },
    {
      "time": " 13.Sep.2007 8.15am",
      "content": "One other idea that came to me that fits in with the name and product is to have a little occilating soundwave form trailing off the end of the ’r’. Like the name is sustaining. It would take someone with more drawing ability than me to pull it off.\n\n"
    },
    {
      "time": " 13.Sep.2007 2.46pm",
      "content": "Hi Andrew.\n\nCan’t you adjust the existing logo rather than create a new. Don’t know if the type is appropriate (i would have to know more about the product) but it is so much nicer than your new options. The T could be reduced (it is slightly thicker which will make it fit better if you reduce it (some space saved already) then you could decrease the angle slightly and get rid of pickup (some more space saved). Definetly get rid of the shear. Applying stuff like forced italics and shears is just a big no-no.\n\n"
    },
    {
      "time": " 6.Nov.2007 8.40am",
      "content": "Hi Guys,\n\nWell, a new logo it was...and Fontin Sans saved the day. I love this Font, a great mix of the suprising and the familar.\n\nI mixed it with Gill Sans (can’t remember which weight of the top of my head) to create one of our new products - a compressor effects pedal. The prototypes are all done and we are working on the production tooling. Here’s a view - what do you think, font friends?\n\n ![](http://web.archive.org/web/20080906164625im_/http:/www.typophile.com/files/CP-1small_3956.jpg)\n\nBTW this is a real photo of a real screenprinted prototype, not a rendering, before you ask. I can’t render 3D knobs that look this good.\n\n"
    },
    {
      "time": " 10.Nov.2007 10.26am",
      "content": "It looks good to me. Fontin made it on this list:  \n [http://www.smashingmagazine.com/2007/11/08/40-excellent-freefonts-for-pr...](http://web.archive.org/web/20080906164625/http:/www.smashingmagazine.com/2007/11/08/40-excellent-freefonts-for-professional-design/ \"http://www.smashingmagazine.com/2007/11/08/40-excellent-freefonts-for-professional-design/\")\n\nAre you going to have an analog delay? I prefer that to digital because the decay is a nice ethereal effect for flute. Right now I am using an old pink Boss that I’m told is a collector’s item now (I think I bought it in ’80). Someday it will probably die.\n\n"
    }
  ]
}
