{
  "id": "37064",
  "title": "Flowing multiple text files in parallel throughout a document",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I want to format a document such that the top portion of the page contains the primary text, the lower portion a \"sub\" text running in parallel throughout (the lower portion to be set in a slightly different but clearly related font). Is there a word-processing application that will allow me to work on what are essentially two different documents, on one and the same screen/page? Ditto for DTP software: is there an easy way to flow two separate text files in parallel across an identical page range?\n\n",
  "author": "ffetish",
  "time": "13 Sep 2007 — 12:15am",
  "uid": "16361",
  "comments": [
    {
      "time": "13 Sep 2007 — 12:31am",
      "content": "Any DTP app will be able to do this without problem. Trying to do it in a word processor will be agony. [Scribus](http://web.archive.org/web/20131020154909/http:/www.scribus.net/) is a free open source DTP application that will perform somewhat like QuarkXPress.\n\n"
    },
    {
      "time": "13 Sep 2007 — 6:55pm",
      "content": "I've never had to do a layout like that. Both Quark and InDesign will allow it easily enough. I don't think the app I use (InDesign CS) would let me create two separate master text frames on the master page, so I'd probably make a master text frame for one of the parallel text flows, and flow that one automatically. For the other I'd create an ordinary master page text box and flow the text manually.\n\n"
    },
    {
      "time": "14 Sep 2007 — 12:31am",
      "content": "PageMaker is the Best.  \n [http://typophile.com/node/33157](http://web.archive.org/web/20131020154909/http:/typophile.com/node/33157 \"http://typophile.com/node/33157\")  \nRegards + Flowers\n\n"
    },
    {
      "time": "14 Sep 2007 — 12:39am",
      "content": "Here is more-or-less how  \n [http://typophile.com/node/33132](http://web.archive.org/web/20131020154909/http:/typophile.com/node/33132 \"http://typophile.com/node/33132\")  \nAll the Best with Flowers\n\n"
    }
  ]
}
