{
  "id": "37076",
  "title": "Helvetica",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m bored today.\n\n [‹ My FontLab Shortcuts](http://web.archive.org/web/20071109100034/http:/www.typophile.com/node/37262 \"Go to previous forum topic\") [The best typeface you can think of... ›](http://web.archive.org/web/20071109100034/http:/www.typophile.com/node/37169 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071109100034/http://www.typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": " 13.Sep.2007 8.05am",
      "content": "Dan was right, we need Hrant around.\n\n"
    },
    {
      "time": " 13.Sep.2007 8.27am",
      "content": "Go see the movie.\n\n"
    },
    {
      "time": " 13.Sep.2007 8.33am",
      "content": "I have some work you can do if you are bored Nick. My son needs some help with his Manadarin Chinese homework.\n\n"
    },
    {
      "time": " 13.Sep.2007 9.04am",
      "content": "Franklin Gothic.\n\n"
    },
    {
      "time": " 13.Sep.2007 9.36am",
      "content": "\\>Go see the movie.\n\nIs it as good as the book?\n\n"
    },
    {
      "time": " 13.Sep.2007 9.59am",
      "content": "Better than the book - less comprehensive visually but the interviews are priceless.\n\nMight be worth waiting for the DVD because it will have interview outtakes - especially Herr Spiekermann.\n\n"
    },
    {
      "time": " 13.Sep.2007 10.58am",
      "content": "_I’m bored today._\n\nSo, you’re using the H word as an epithet, eh? ;-)\n\n"
    },
    {
      "time": " 13.Sep.2007 11.23am",
      "content": " ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/Daphne_6537.jpg)\n\n"
    },
    {
      "time": " 13.Sep.2007 11.39am",
      "content": "Delphian\n\n"
    },
    {
      "time": " 13.Sep.2007 11.54am",
      "content": "Sometimes when I am bored, I go outside. ;)\n\nBut only sometimes.\n\n"
    },
    {
      "time": " 13.Sep.2007 12.04pm",
      "content": "Nothing boring here - unless you count the ATypI cheap wine!\n\n"
    },
    {
      "time": " 13.Sep.2007 12.57pm",
      "content": "That’s Ringo Starr’s wife.\n\n"
    },
    {
      "time": " 13.Sep.2007 9.05pm",
      "content": "I found this video of baby ducks leaping from a tree.\n\n[http://www.youtube.com/watch?v=TIwK7feiBSA](http://web.archive.org/web/20071109100034/http:/www.youtube.com/watch?v=TIwK7feiBSA \"http://www.youtube.com/watch?v=TIwK7feiBSA\")\n\nIt has nothing to do with type... but it is narrated by david attenborough.\n\n"
    },
    {
      "time": " 13.Sep.2007 10.34pm",
      "content": "_Ringo Starr’s wife_\n\n...as in Barbara Bach?\n\n"
    },
    {
      "time": " 14.Sep.2007 5.57am",
      "content": "”..baby ducks leaping from a tree...” Tree holes, on the other hand, have everything to do with Helvetica counters.\n\n"
    },
    {
      "time": " 14.Sep.2007 6.22am",
      "content": "Daphne is mad at the world because she’s overdressed for Coney Island and her spike heels keep getting caught in the boardwalk. Besides that, somebody spilled mustard on her frock. And her date keeps staring at the chick in the mermaid costume with the clamshells painted on her boobs.\n\nI’m mad at the world because Coney Island closed last weekend.\n\n"
    },
    {
      "time": " 14.Sep.2007 8.21am",
      "content": "It did!?\n\n[EDIT] Oh, you mean Astroland?\n\n[http://www.nytimes.com/2007/09/10/nyregion/10coney.html?ref=nyregion](http://web.archive.org/web/20071109100034/http:/www.nytimes.com/2007/09/10/nyregion/10coney.html?ref=nyregion \"http://www.nytimes.com/2007/09/10/nyregion/10coney.html?ref=nyregion\")\n\n"
    },
    {
      "time": " 14.Sep.2007 4.12pm",
      "content": "I’m pissed, all the special Helvetica packages from Veer are sold out. I haven’t seen it yet, which interview is the best?\n\n"
    },
    {
      "time": " 14.Sep.2007 4.26pm",
      "content": "_Barbara Bach?_\n\nGood eye David. The ad is from 1965, and she was a model then.\n\nI like the way the stripes in the typeface go with the stripes in the fabric print and the planks and the girders in the tower.  \nIt was a stripey time.\n\nI’m not bored any more.\n\n"
    },
    {
      "time": " 15.Sep.2007 3.27am",
      "content": "“I’m not bored any more.”  \nWhew, that was close. I thought I was about to start working on an OT version of Delphian with mustardish accents.\n\n"
    },
    {
      "time": " 15.Sep.2007 4.26am",
      "content": "Coney Island’s pretty much closed for the season now, yes? And on top of that Astroland and a good chunk is going permanently, right? The way I hear, out east a ways, is that only the Ferris Wheel and he Cyclone will survive. As Landmarks. Oh, yeah, and the parachute skeleton. The boardwalk has to also, yes? Or is whatever developing there will to be going to make the boardwalk off-limits somehow? Damn! There goes the old haunts. Once and for all.\n\nA buddy of mine, my now-82-year old dad, and I make a pilgrimage there and to the old neighborhood once a year. Usually right after Labor Day. it’s delayed this year, maybe a week or two more, because my buddy’s ill—but we’re going to have to do it soon, because I figure the face of it starts to change again any second.\n\nI’m reminded, however—because of where this has come up, on this forum—that for years and year and to this day, there’s something about getting to where I can finally see certain distinctive types—the ones that spell out “Wonder Wheel,” “Nathan’s,” “Cyclone,” “Shoot the Geek” (not one that was there when I was a kid, but that always sadly cracks me up now).\n\nThanks for reminding me. Got to make some phone calls today and get this year’s little expedition scheduled.\n\n"
    },
    {
      "time": " 15.Sep.2007 7.08am",
      "content": "_Coney Island’s pretty much closed for the season now, yes? And on top of that Astroland and a good chunk is going permanently, right?_\n\nSteve, I think that some of your questions are answered in the _Times_ article I linked to, but then again a lot of it is up in the air right now.\n\n"
    },
    {
      "time": " 15.Sep.2007 7.57am",
      "content": "I hope the Helvetica film comes out on DVD, means I’ll get to see it, as there’s little chance of a theatrical release in Australia.\n\nj a m e s\n\n"
    },
    {
      "time": " 15.Sep.2007 8.38am",
      "content": "\\>I hope the Helvetica film comes out on DVD\n\nYou can [order the DVD](http://web.archive.org/web/20071109100034/http:/helveticafilm.com/shop.html) now.\n\n"
    },
    {
      "time": " 15.Sep.2007 11.25am",
      "content": "That image of the girl on the board walk reminds me of Van Gogh’s La Mousme. Not so much because of the obvious elements, but because of the expression on the models face in relation to the time in her life and in her circumstance. A time when a girl becomes a women.\n\n[http://www.vggallery.com/painting/p\\_0431.htm](http://web.archive.org/web/20071109100034/http:/www.vggallery.com/painting/p_0431.htm \"http://www.vggallery.com/painting/p\\_0431.htm\")\n\nI love that word ’Youthquake’!\n\n"
    },
    {
      "time": " 15.Sep.2007 12.20pm",
      "content": "Helvetica is the best typeface ever made. Any questions? No. I was delusional before; and now I have seen the light.\n\n"
    },
    {
      "time": " 15.Sep.2007 12.30pm",
      "content": "Hey! I went to get some drinks, and now [she’s doing it _again!?_](http://web.archive.org/web/20071109100034/http:/typophile.com/node/37139) She stole my computer and now she’s impersonating me! Do not listen to her, she’s stark raving mad!\n\n"
    },
    {
      "time": " 15.Sep.2007 12.32pm",
      "content": "What in the world is happening. I went to help some poor soul with an InDesign problem, and I come back and my Typophile account has been hijacked. But for the record, I do love Helvetica. Honest.\n\n"
    },
    {
      "time": " 15.Sep.2007 1.45pm",
      "content": "Thanks for the tip William :^)\n\nYves, you’re right. Cringe-inducing Helvetica’s curves may be, but nobody can deny the success of its design. I can’t be the only person with good taste who thinks Helvetica in bold weight looks decent.\n\nWhatever happened to the mega bold weight?\n\nj a m e s\n\n"
    },
    {
      "time": " 15.Sep.2007 3.56pm",
      "content": "_She stole my computer and now she’s impersonating me!_\n\nAre you Yves, or Tamye? Speak up, or forever hold your Helvetica! ;-D\n\n_I was delusional before; and now I have seen the light._\n\nWow, that sounds almost Tschichold-like. Will you change your name to [Max](http://web.archive.org/web/20071109100034/http:/www.linotype.com/522/maxmiedinger.html), in allegiance to your new-found faith? ;-)\n\n"
    },
    {
      "time": " 15.Sep.2007 3.58pm",
      "content": "_I can’t be the only person with good taste who thinks Helvetica in bold weight looks decent..._\n\nJames, I don’t know about my own taste, but I happen to really, really like Helvetica Black. :-)\n\n"
    },
    {
      "time": " 15.Sep.2007 4.06pm",
      "content": "I like _Helvetica_ as a synonym for _being bored_.\n\n“How are you?”\n\n“Helvetica”\n\nGreat.\n\n"
    },
    {
      "time": " 15.Sep.2007 4.16pm",
      "content": "lol.\n\n"
    },
    {
      "time": " 15.Sep.2007 4.33pm",
      "content": "I click every topic that mentions Helvetica just to see _what else_ could be said about it. So I clicked this one, just to read that Nick Shinn wanted to state that he’s bored. I immediately loved the topic title Nick chose.\n\n"
    },
    {
      "time": " 15.Sep.2007 4.43pm",
      "content": "Yes, it’s very appropriate.\n\n"
    },
    {
      "time": " 15.Sep.2007 5.44pm",
      "content": "Coney Island can still be fun after labor day. The signs are all still there.  \nThe hot dogs too.\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/DSCN1194_6530.JPG)\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/DSCN1215_4248.JPG)\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/DSCN1186_4304.JPG)\n\n"
    },
    {
      "time": " 15.Sep.2007 9.24pm",
      "content": "Hell...vetica, this is one wacky thread! ;-)\n\n"
    },
    {
      "time": " 15.Sep.2007 9.48pm",
      "content": "I have a little over a week to put together a 20-30 minute presentation. Unfortunately I chose something along the lines of good fonts as my subject, and was later told that I can’t dwell on esoterica or other such boring stuff. So I’m going to pad it out with clips from Helvetica.\n\nAnd taking photos at Coney Island after Labor Day is a great idea. I wish our mayor had built one of those, instead of a new ballpark for a sucky team that chargers too much for tickets.\n\nYep, hockey season can’t start soon enough. It’s funny, I’ve become a Caps fan, and now I know how Cubs fans feel.\n\n"
    },
    {
      "time": " 16.Sep.2007 12.31am",
      "content": "Ricardo you’ve got good taste, I assure you sir. Helv black has got serious heft and thunk-pounding value. Page-shuddering wallop.\n\nWhat I want is a Helvetica with nice fat stroke _and_ tiny counters—-a mega-bold variant. Imagine it. Mega-bold Helv would compete with Gill Sans mega for movie title logos, posters and such.\n\nj a m e s\n\n"
    },
    {
      "time": " 16.Sep.2007 9.15am",
      "content": "_What I want is a Helvetica with nice fat stroke_ and _tiny counters—-a mega-bold variant._\n\nSounds like a cool idea. Maybe it’s time to do some drawings! :-)\n\n"
    },
    {
      "time": " 17.Sep.2007 6.53am",
      "content": "Are you bored\\_??  \n [http://www.i-am-bored.com/bored\\_link.cfm?link\\_id=17575](http://web.archive.org/web/20071109100034/http:/www.i-am-bored.com/bored_link.cfm?link_id=17575)\n\n"
    },
    {
      "time": " 17.Sep.2007 7.19am",
      "content": "My dog just died. I’m not sure how connect that to type, but maybe I’ll just use a lot of black weights for a while.\n\n"
    },
    {
      "time": " 17.Sep.2007 7.20am",
      "content": "I guess if Coney Island is closed, you can be bored but not board walked :-)\n\nChrisL\n\n"
    },
    {
      "time": " 17.Sep.2007 7.29am",
      "content": "Chris, my dog has been dead for thirty minutes and you’ve already made me laugh.\n\n"
    },
    {
      "time": " 17.Sep.2007 11.56am",
      "content": "I hope you were joking about your dog, James.\n\nChrisL\n\n"
    },
    {
      "time": " 17.Sep.2007 4.49pm",
      "content": "Coney Island in the off-season is fantastic. Don’t forget to grab a drink at Ruby’s. It’s great on a foggy fall day. But I think it’s a very sad sign of the direction NYC is headed that Astroland is closing for good to be replaced by condos, a hotel, and a Disnified, Vegasized version of the old Coney. Problem with Coney is that tourists don’t go there much. Which is of course why we locals love it. Where else can you ride the teacups with your kids right next to a junkie and her kids? It’s the real deal, honky tonk and all. They even had a real freak show (not a side show) until recently, which cured me of any interest in freak shows.\n\nBut all that means it has no value for Mayor Dollarsign.\n\nFirst sign of trouble was when they tore down the Thunderbolt coaster (featured in Annie Hall) followed by shutting down the flea market - which was really a junk sale. And now Astroland. The city no longer has a soul.\n\nJames, I am so sorry about your dog.\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/mermaid1_5659.jpg)\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/mermaid2_5201.jpg)\n\nNone of those women are me. That’s the mermaid parade for those who don’t know.\n\n"
    },
    {
      "time": " 18.Sep.2007 11.09am",
      "content": "Wacky is good. I like those photos Patty.\n\nI think this has already been done. I’ve found what looks like Helv megabold on at least one LIFE magazine cover from the 1960’s.\n\nI drew face below from scratch in about four hours. E and F are too narrow, and the weight distribution is patchy, but you get the idea.\n\n(James P. Crow has nothing to do with James Puckett. Sorry to hear about your dog James)\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/goatmen_5198.jpg)\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/liveonmoon_4518.gif)\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/lunarfashions_3941.png)\n\n;^)\n\nj a m e s\n\n"
    },
    {
      "time": " 18.Sep.2007 11.55am",
      "content": " ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/Miles_3964.jpg)\n  \nI listened to this the other day (Joe Zawinul wrote the tune), and noticed the Helvetica.  \n1969. Designer: anon.  \n(Sorry for the crop, my scanner won’t take 12x12.)\n\n.\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/Stevie_6372.jpg)\n  \nContinuing with retro Helvetica at the record shelf, this time with a little bit of modding.  \n1972. Design: Graphic Projects Inc., NY.  \n.  \n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/SMB_6374.jpg)\n  \nThis time with a lot of modding.  \n1969. Design: Lockart  \n.  \n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/SMB2_5123.jpg)\n  \nA close up.\n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/Neiler_5965.jpg)\n  \nNice and tight, and dig that photoshop filter...  \n1969. AD: Ed Thrasher  \n.  \n\n ![](http://web.archive.org/web/20071109100034im_/http:/www.typophile.com/files/Wes_5600.jpg)\n  \n1966. Design: Acy R. Lehman — resisting the temptation to dress the guys in tights and Batmasks.\n"
    },
    {
      "time": " 18.Sep.2007 12.28pm",
      "content": "Miles: Too bad they couldn’t get a decent guitar player for that session.\n\nStevie: My favorite one-man band album. The drumming on Keep on Runnin’ is delightfully quirky. Kind of like this Helvetica topic node.\n\nJimmy: Most of the time he was also playing the bass line with his feet. A freak.\n\n"
    },
    {
      "time": " 18.Sep.2007 12.35pm",
      "content": "\\> and dig that photoshop filter\n\nThat effect was HARD to get in the old days. I wonder if it was planned, or an accident. I remember getting something like that when I processed negatives in water that was too hot. I can’t imagine the effort it would take to get the effect deliberately.\n\n"
    }
  ]
}
