{
  "id": "37075",
  "title": "Rough-cut sans, up for crits.",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This is a design I've been working on for the last two weeks. I think it's my third more serious attempt at designing a typeface. It's still in the early stages. I have drawn first versions of the lowercase characters. There is no kerning yet, I kerned some pairs a bit by hand when I set the specimen.\n\nI would like to have some crits at this point. The 's', 'v', 'w', 'y' and 'z' are the characters that trouble me the most, I have difficulties with getting those to fit well with the style of the design. But all tips are welcome. :)\n\nCheck the PDF for larger size.\n\n ![](http://web.archive.org/web/20150124022430im_/http:/typophile.com/files/preview-typoph_6648.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [rough-cut-jelmargeertsma.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/rough-cut-jelmargeertsma.pdf) | 521.59 KB |\n| [rough-cut-2.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/rough-cut-2.pdf) | 538.07 KB |\n| [rough-cut-3.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/rough-cut-3.pdf) | 237.78 KB |\n| [rough-cut-4.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/rough-cut-4.pdf) | 431.3 KB |\n| [proof-b-g.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/proof-b-g.pdf) | 36.76 KB |\n| [rough-cut-5.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/rough-cut-5.pdf) | 46.11 KB |\n| [rough-cut-6.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/rough-cut-6.pdf) | 45.96 KB |\n| [rough-cut-7.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/rough-cut-7.pdf) | 42.72 KB |\n| [rough-cut-8.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/rough-cut-8.pdf) | 42.32 KB |\n| [ultrablack.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/ultrablack.pdf) | 259.63 KB |\n| [weights.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/weights_0.pdf) | 70.02 KB |\n| [weights2.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/weights2.pdf) | 73.05 KB |\n| [regular-spacing.pdf](http://web.archive.org/web/20150124022430/http:/typophile.com/files/regular-spacing.pdf) | 49.69 KB |\n\n",
  "author": "Quincunx",
  "time": "13 Sep 2007 — 7:42am",
  "uid": "14604",
  "comments": [
    {
      "time": "13 Sep 2007 — 7:45am",
      "content": "I'll go on record as saying I like it. Not much I don't like about it.\n\n"
    },
    {
      "time": "13 Sep 2007 — 9:11am",
      "content": "What're you gonna do with the other weights? I like it a lot.\n\n"
    },
    {
      "time": "13 Sep 2007 — 11:43am",
      "content": "Thanks. As for weights, well, I might do at least a lighter weight. I don't know if I can use intrapolating... I would probably have to draw it more or less from scratch?\n\nAn italic would be nice too, although I have never drawn a serious italic to fit a roman before. I will give it a try. And of course caps.\n\n"
    },
    {
      "time": "13 Sep 2007 — 12:29pm",
      "content": "Hi Jelmar\n\nI can't make up my mind if I like it the way it is or if the eyes/bowls are bothering me in some of the glyphs (especially e and o). The curve (little break) just before the angle shift inside the u (left side) I think is worth looking at again (it looks like it's a mistake rather than intentional - either emphasize it or make a smoother curve). The problems with the v and w the way I see it is that you have shaved the corners. Apart from that they work fine the way they are.\n\nI'm looking forward to see this finished though. It's looking really nice which is a great starting point;o)\n\n"
    },
    {
      "time": "13 Sep 2007 — 12:54pm",
      "content": "Hey Endre, thanks for your reply.\n\nThe eyes/bowls are more or less as I wanted them. Although the corners are the most emphazised in the 'e' and 'o'. Maybe I can make those more subtle (although I actually like the 'o' very much).  \nThe little curve inside the 'u' was intentional. It's also in the 'n' (obviously, because the one is an edited version of the other). I will check what I can do with it. When it was completely straight before the angle shift the letter looked too much like two vertical lines with a horizontal line attached to it.  \nWith 'shaved' corners you mean the little cut-offs I did on the endings on the 'v' and 'w'? I wasn't sure about that too, but the really sharp corners didn't look right either, it looked too 'ridgid', so to speak. But if you think it looks wrong, I will look into it. :)\n\n"
    },
    {
      "time": "15 Sep 2007 — 6:05pm",
      "content": "I'm trying to add an updated PDF, but it is not really working.  \nIt's uploading, says it's finished, it's in the little list, listingbox is checked, but when I submit it's not there. Any tips? :)\n\n"
    },
    {
      "time": "16 Sep 2007 — 3:51am",
      "content": "Yes just select the file and press submit without actually adding the file before submitting.\n\n"
    },
    {
      "time": "16 Sep 2007 — 5:19am",
      "content": "Hi Jelmar,\n\nLooks nice. I love that 'k', but the 's' looks a bit 'italic' :-/ Oh, and I think those curves inside the 'u', 'n', ... could be a bit softer... By the way, I like a lot all those details you put in the glyphs. A small cut here, a curve there... Very nice job!\n\n"
    },
    {
      "time": "16 Sep 2007 — 7:05am",
      "content": "Robert: Thanks, that worked! New file is up (rough-cut2.pdf)\n\nAnderson: Thanks. The 's' indeed looks a bit italic. It just sucks in my opinion. ;) I havent changed it yet in the new PDF, neither the 'u' and 'n'. But I've added some first drafts of numbers and diacritics. I have never drawn numbers for a typeface before, let alone oldstyle figures. Lots of fun to do, but there are probably a lot of problems with them. I do agree with the 'u' and 'n', although I think the problem is more apparent in the 'u'. And about the details, I tried to add a lot of those small details, without them taking over completely. I think that worked out pretty well. :)\n\n"
    },
    {
      "time": "20 Sep 2007 — 10:23am",
      "content": "The lack of crits is astonishing! ;)  \nAnyway, for the people that might be interested, I've uploaded a new PDF (rough-cut3.pdf). It has some very first drafts of a couple of caps, and edited numbers.\n\n"
    },
    {
      "time": "20 Sep 2007 — 2:50pm",
      "content": "Looks nice.\n\nI like the ink traps.\n\nThe lower lobe of the B looks a little dodgy to me. The corner seems to strong.\n\n"
    },
    {
      "time": "20 Sep 2007 — 2:59pm",
      "content": "Nice work. Some places to look at:\n\nk : leg  \nR : leg  \ng : descender a little wobbly, too light?  \ny : the notch isn't working\n\n"
    },
    {
      "time": "20 Sep 2007 — 3:07pm",
      "content": "Mark: Thanks. I agree on the B part, it is very dodgy. I think I might just remove the corner.\n\ntest (whoever you are ;)): k leg and R leg, could you elaborate please? :) Because a lot of people are very positive about the legs of those characters.\n\n'g' descender, I think the negative space might get too small if I thicken it, but I will look at it. About the 'y', I'm not sure about that whole glyph to start with. I might redraw it completely.\n\n"
    },
    {
      "time": "20 Sep 2007 — 4:07pm",
      "content": "overall quite nice. just a few things that might just be personal preferences to me. you decide.\n\nmainly i find the tails on some of the characters a bit distracting: a, d, u and a bit too much swoosh on the leg of the k. i think the tails work for i and l.  \nlikewise, i find the analogous entry stroke on m, n, p distracting.  \ni like the kinks in your strokes, but they seem a bit wonky in places, particularly the eye of the e, in the u, the bottom bowl of the B, and the bottom portions of 3 and 5.  \nthe negative space in the top hook of the f feels a bit tight. not sure what you can do to remedy that.  \nthe r makes my stomach churn a bit.  \ni haven't seen your spacing yet, but the ligs seem a bit wide.\n\n"
    },
    {
      "time": "20 Sep 2007 — 5:29pm",
      "content": " ![](http://web.archive.org/web/20150124022430im_/http:/typophile.com/files/comm_4214.gif)\n\nLooks very nice. I've always wanted to combine these edgy and fluent shapes like you did:)  \nA few little remarks in addition to other comments (e.g. what I would do)\n\n1) Where 'b' and 'h' the bowls connect the stem it seems just a little bit to thick for me. (Compare with 'n')  \n2) I would make these point(s) a bit more smooth  \n3) Think this should be a bit heavier  \n4) Should be higher\n\n"
    },
    {
      "time": "21 Sep 2007 — 5:30am",
      "content": "It's really nice.  \nI would like to see the lighter versions as well.\n\n"
    },
    {
      "time": "21 Sep 2007 — 6:21am",
      "content": "Hi Jelmar. What you've got here is a nice appealing lineale (Italian term for \"sans serif\") that needs refinement and conceptual definition to make it more specific, and, by extension, more useful.\n\nConceptual definition:\n\n\\* what kind of uses do you have in mind for the type? Be as specific as you can.\n\n\\* will it be a display type or a text type, or capable of straddling both display and text work?\n\n\\* are the curls (tails) functional or stylistic, or a combination of both?\n\nRefinement:\n\nIt could benefit from more rigor / tension / stressing. This can be achieved by increasing the difference between inside and outside profiles. Results will be more apparent if you draw the characters at a lighter weight. What rigor it has now is hard to appreciate because the weight is fairly bold. It looks soft, lacks hardness---surface tension.\n\nIf its main use will be a display type the inside kinks in the counters will be distracting, drawing attention to themselves; in that case I would make them smoother.\n\nIf its main use will be for text the inside kinks won't stand out so much and it may be possible to retain them much as they are now.\n\nOne way to find out is to build a thinner weight suitable for text setting, complete the rest of the capitals, then make a PDF with sustained text setting---around 300 words at 10 - 12 points size. Read it. Don't look at the character design(s). Read it at the speed you normally would read. It reads okay? Then the kinks aren't a problem, they can stay. It doesn't read smoothly? It may be those kinks holding back the flow of readability.\n\n\\* tighten up the branching points, where strokes branch from stems make them thinner.\n\n\\* r needs more weight at end of stroke.\n\n\\* curl on lower leg of k is too much, rein him back in, make it more subtle.\n\n\\* consider replacing the diagonal roman style w with a cursive structure---two u's joined together. IMHO roman style w's stand out in every font they are a part of, compromising integration of forms. Only a suggestion. If you really like w as is by all means keep it.\n\n\\* keep up the battle for the s. Keep working on it. Walk away from it and work on something else for a while, then come back to the s and try again. Keep at it, work on that little mother and it will eventually submit to your will.\n\nOtherwise it's excellent.\n\nj a m e s\n\n"
    },
    {
      "time": "21 Sep 2007 — 6:52am",
      "content": "I should add that increasing the rigor is optional, up to you if you want to do it, if you think it's appropriate. My advice on rigor, contrast and stressing are based on the experience of having built several text-worthy sans serif types. Most people have never seen them because they are proprietry commission jobs.\n\nTo show you the kind of thing I mean:\n\n ![](http://web.archive.org/web/20150124022430im_/http:/typophile.com/files/gofergirl_3625.gif)\n\nThe s is a bit overweight but that's because it isn't finished yet.\n\nj a m e s\n\n"
    },
    {
      "time": "21 Sep 2007 — 8:16am",
      "content": " **@ paul:**  \n_mainly i find the tails on some of the characters a bit distracting: a, d, u and a bit too much swoosh on the leg of the k. i think the tails work for i and l.  \nlikewise, i find the analogous entry stroke on m, n, p distracting._\n\nI agree that they may be a bit distracting, although mostly the entry strokes you mention. The tails to a lesser extend, maybe I could make them more subtle (e.g. shorter/lighter).\n\n_i like the kinks in your strokes, but they seem a bit wonky in places, particularly the eye of the e, in the u, the bottom bowl of the B, and the bottom portions of 3 and 5._\n\nGood to hear some bottlenecks about the kinks. I've never made such kinks before, so any tips on that are welcome. I will try to improve at least the ones you mentioned.\n\n_the negative space in the top hook of the f feels a bit tight. not sure what you can do to remedy that._\n\nI thought that too, the only thing I came up with at the moment is that the right side of the f tapers a bit, so that the stem is less thick at the top hook.\n\n_the r makes my stomach churn a bit._\n\nYeah, it's pretty badly drawn! ;) I find the 'r' difficult to get right.\n\n**@Jos:**  \nThanks for the visual aid, I will see if I can improve those points. I didn't see it before, but the join of the 'k' is probably too low indeed.\n\n**@satya (or whoever can enlighten me on this point)**,  \nI would like to do lighter weight(s) as well. This is so bold because I started this only to make certain words, but I extended it to a whole alphabet. Is there any relatively easy way to intrapolate this weight? Is there a trick for it? I understand that any intrapolated shapes need a lot of 'repairing' afterwards.\n\n**@James:**  \n_\\* what kind of uses do you have in mind for the type? Be as specific as you can._\n\n\\* will it be a display type or a text type, or capable of straddling both display and text work?\n\nThis was mainly started as exersize for myself. And I see it as a display type. Although I don't know what will happen if I make a lighter/text weight, it may very well work for smaller sizes with some refinement. I think a lot of the problems will be more apparent when I make a lighter weight. It may be good to make this lighter weight, and then extrapolate it to get a new, better bolder weight.\n\n_\\* are the curls (tails) functional or stylistic, or a combination of both?_\n\nPurely stylistic. I just liked the look of it basically. ;)\n\nAbout your 'Refinement' points (too much to quote all now), they are noted and I will check 'em out. The battle for the 's' continues. Although making it less 'italic-looking' might already improve it drastically.  \nI agree on the 'w' part, they always seem to stand out a bit. I am starting to like it the way I have them (with some added improvements). A cursive-style 'w' sounds nice. I will try that as well. With rigor you mean something like contrast?\n\nI like the image you posted a lot. Where you have experience building text-sans serifs, I have none at all. :)\n\n"
    },
    {
      "time": "21 Sep 2007 — 8:27am",
      "content": "Okay, when you've developed it enough you'll have a better impression of its potential.\n\n_Purely stylistic. I just liked the look of it basically_\n\nCool :^) Curls are very trendy at the moment as a stylistic device, but there is a practical side to putting them on 'a d i l u' in a sans serif. They function as semi-serifs, helping to make up for the absence of serifs, making sans serif fonts more readable.\n\n_The battle for the ’s’ continues. Although making it less ’italic-looking’ might already improve it drastically._\n\nSame thing. The italic look will go away when you've mastered the s structure.\n\nOne way of determining where to place the join on k is to try integrating it with x. Overlay x on top of k and adjust k until they match, or as close as is practical to make them.\n\nTo make the lighter weight: run a bold filter with negative parameters on a and e. You'll need to experiment with different values until it looks like the weight you want. Test render those letters at large and small sizes to make sure of the weight. Then run the whole font thru the bold filter with the negative params established by testing a and e. Finally, restore the stressing and lost detail. It means adjusting all the characters, but this method is still quicker than building the whole thing again from scratch.\n\nj a m e s\n\n"
    },
    {
      "time": "21 Sep 2007 — 9:06am",
      "content": "Thanks for the reply. I was at the very moment you were posting experimenting with the negative Bold filter. It works quite well, and I like the results so far. I'll put up an image later.\n\n"
    },
    {
      "time": "21 Sep 2007 — 9:06am",
      "content": "Preview. I haven't changed anything after intrapolation, so most of it looks stupid. But I think it can work after adjustments.\n\n ![](http://web.archive.org/web/20150124022430im_/http:/typophile.com/files/light-test_3584.png)\n\n"
    },
    {
      "time": "21 Sep 2007 — 10:37am",
      "content": "For a better interpolation you need atleast two extreme weights. i.e one light and one Black. With only one weight you cant get other weights easily. I love interpolation but never used Bold command in Fontlab. Though it can be useful sometime.\n\n"
    },
    {
      "time": "21 Sep 2007 — 10:49am",
      "content": "Yeah, I understand two weights would be better. But I think I can manage making a lighter weight with the Bold filter. What I will do with any additional weights, I don't know yet.\n\nsatya, what do you normally use then, to make other weights?\n\n"
    },
    {
      "time": "21 Sep 2007 — 3:02pm",
      "content": "I was just going through some revisions, mainly the ones suggested here, when I thought I'd try another version of the 'g'. It's a more 'regular g'  \nWhich one would be better? I like the left (original one) better, because it has more character. However, the right one may be more balanced and may also be more recognizable/legible? The top-right corner might be too pointy?\n\n ![](http://web.archive.org/web/20150124022430im_/http:/typophile.com/files/gg_6346.png)\n\np.s. It is a very quick edit.\n\n"
    },
    {
      "time": "21 Sep 2007 — 3:30pm",
      "content": "Jelmar,  \nI really like the kinks. Don't be afraid of them. They may be a bit too timid. Look at thje left of the \"g\". Where the vertical curve meets the top horizontal curve on the inside.\n\nGood gutsy work!\n\nChrisL\n\n"
    },
    {
      "time": "21 Sep 2007 — 3:56pm",
      "content": "With too timid, you think I should actually make them more distinct, as in the 'g'?\n\nThanks for the reply. When I started this face, the kinks weren't there. At one point I thought, 'let's take large chunks out of those letters'. I wanted to do something like it for a while now.\n\n"
    },
    {
      "time": "21 Sep 2007 — 7:59pm",
      "content": "Yes, more distinct, even more than the g,\n\nChrisL\n\n"
    },
    {
      "time": "22 Sep 2007 — 2:47am",
      "content": "_...I thought, ’let’s take large chunks out of those letters’. I wanted to do something like it for a while now._\n\nThis is good. Anything different is good.\n\nChris, I love that you encourage designers to pursue their instincts like this, and give voice to their individuality. That's what's beautiful about people---that we are all different and unique. Type design is beautiful too in that there are so many different types.\n\nLike baseball, it doesn't have to mean anything, but can be just beautiful to contemplate.\n\n:^)\n\nJelmar, if it turns out to be a display type the kinks can certainly be retained with refinement and systemetization.\n\nj a m e s\n\n"
    },
    {
      "time": "22 Sep 2007 — 5:25am",
      "content": "I'll see how the kinks turn out. I'm going to try to incorporate the changes suggested so far that I like into the face first. Then do a intrapolation, and see how it looks. The test I did with a quick lighter version, shows that it actually might work for smaller sizes, if I loosen up the spacing.\n\nWhat about italics? (not that I'm going to make them now, but I was just wondering). Draw from scratch, or slant characters and alter them to their italic shapes? Some of my characters already have a italic shape, like the 'g' (and I also have a 'y' with a g-like shape).\n\n"
    },
    {
      "time": "22 Sep 2007 — 7:26am",
      "content": "Making an italic. First off, to save yourself extra work later, perfect the regular upright font. Make sure the side bearings and any kerning are well-sorted---test it thoroughly to be certain.\n\nThen use the upright font as the basis for the italic. Apply a slant filter with a value between 5 and 10 degrees. Experiment with different slant angles until it looks right to you. Post the results and get feedback.\n\nOnce the ideal slant angle is established, start converting key characters to their cursive forms. How far your go with this depends on the final look you're aiming for. Typically:\n\nFirst narrow every glyph by about 15 to 25 %. Slanted uprights that haven't been narrowed just don't look right (like an italic font) unless the upright originals were condensed forms to begin with.\n\na \\> monocular a  \nb \\> curl ascender tip backwards slightly, remove baseline spur and smooth bottom left corner, like b in Minion italic  \nd \\> curl ascender tip backwards slightly, point baseline curl upwards  \ne \\> make it cursive, eg: Minion italic  \nf \\> drop stem below baseline and add back-facing curl  \ng \\> already done  \nh \\> curl ascender tip backwards slightly, add curl to right stroke, pointing upwards  \ni \\> add curl to bottom of stem, pointing upwards  \nk \\> curl ascender tip backwards slightly, make straight upper arm curved, or alternatively convert to a loop k  \nl \\> curl ascender tip backwards slightly, point baseline curl upwards  \nm, n \\> add curl to right stroke, pointing upwards  \np \\> curl descender tip backwards slightly  \nq \\> replace with italic b rotated 180 degrees, curl descender tip forwards slightly  \nr \\> curl baseline stem tip backwards slightly  \ns \\> adjust curves and stressing for cursive flow; alternatively convert to cursive handwriting structure (see Bickham script and French script for example)  \nt \\> point baseline curl upwards  \nu \\> point baseline curl upwards  \nv, w \\> convert to cursive forms, study several good italic fonts, either seriffed or sans, for examples  \nx \\> study Minion italic x, convert, convert!  \ny \\> match to italic v form  \nz \\> study italic z in Minion and Charter for 'standard' italic form; alternatively give it a cursive descender tail---see French script)\n\nc and o you may want to adjust the curves and stressing for a flowing cursive look. Severity of this depends how much angle you use. The gentler the angle, the less need to adjust. Same applies to curved parts of h, n, m, u, and the bowl letter pairs b-q, p-d.\n\nCapitals: caps with curved elements will need adjusting too, but otherwise most italic fonts make do with the same capital structures as their matching uprights. If you want to add a bit of flair to the caps; replace E with a curved structure (examples: Liberty script, Phyllis italic, Piranesi italic); give V W X and Z the same treatment as their lowercase italic forms.\n\nj a m e s\n\n"
    },
    {
      "time": "22 Sep 2007 — 7:33am",
      "content": "Jelmar,  \nRegarding italics. You might start out by slanting your upright regular and test the slant angle. Some people like different degrees and it can vary with the nature of the family. My current preference for a sans is 11 degrees but that is NOT a rule.  \nAfter you make your slant, copy the whole font to the mask layer and use it only as a reference. Then, draw your italics as they should look in the glyph layer. I personally find drawing italics to be much more work than I expected so don't become frustrated if it takes a while. Italics are a different world and need care and feeding :-) Spacing them is another adventure.\n\nChrisL\n\n"
    },
    {
      "time": "22 Sep 2007 — 7:38am",
      "content": "\"...encourage designers to pursue their instincts\"\n\nJames, I hope designers would pursue their individuality and not be locked in by what has already been done. It can be very difficult to be on unchartered ground but you can learn more by treading beyond the 22 mile limit of nautical vision :-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Sep 2007 — 8:10am",
      "content": ":^) Yep-yep-yep! Uncharted/unchartered ground is where I've always tried to be. It's fun. There can be no art without taking risks.\n\nj a m e s\n\n"
    },
    {
      "time": "22 Sep 2007 — 8:59am",
      "content": "Chris, is the advice I've given on making an italic okay? The last thing I want to do is give Jelmar bad advice. I documented the method I know. Yours sounds good too; using a slanted version of the regular glyphs as a mask layer for reference.\n\nj a m e s\n\n"
    },
    {
      "time": "22 Sep 2007 — 10:17am",
      "content": "James,  \nThere is nothing wrong with your advice. Most people would like very specific directions as you have given. I prefer to allow the person some time to play without specific guidelines at first. This allows them the freedom to explore without a model to measure against. After they get beyond this open and exciting time and are looking for fine tuning is when I would give more specific suggestions. This is just my way and my hope that people will not trap themselves in to convention before they take a good, healthy naive swing at it without preconceived notions to hamper them. There is always time to dial back afterwards if things have gone too out of hand.\n\nChrisL\n\n"
    },
    {
      "time": "22 Sep 2007 — 1:01pm",
      "content": "Thanks for the replies. I think I will just go ahead with that 'naive swing' Chris mentions, and then use James' descriptions to fine tune the results afterwards.\n\nI've been studying several italis of sans serifs to see how italic shapes work. I don't like slanted romans, so I want to try to make a proper italic.  \nBut I will first finish the roman font, with all it's diacritics and such. But I was just curious about the italic.\n\nUnfortunately the coming week will be quite busy with other work, but if or when I have something new to show, I will post it. :)\n\n"
    },
    {
      "time": "22 Sep 2007 — 2:43pm",
      "content": "Chris,  \nThanks for the feedback, you've confirmed what I was thinking. The changes I recommended are specific to a sans italic I made based on the cancellaresca italic model from 15th century Rome and Venice, so it's fairly standard stuff.\n\nBut I agree Jelmar should explore without preconceptions first, and discover what happens with his own instincts. This is very good, I like the way it's going.\n\nJelmar,  \nTake as much time as you need.\n\nj a m e s\n\n"
    },
    {
      "time": "22 Sep 2007 — 2:48pm",
      "content": "James,  \nHistoric models are very valuable and should be studied. I would hope a student would first make an effort to do some designing without them at first so that they have a healthy respect for the historic and a chance to fly a bit first :-) Again, this is not dogma, just my opinion and probably minority opinion at that.\n\nChrisL\n\n"
    },
    {
      "time": "22 Sep 2007 — 3:19pm",
      "content": "Not at all Chris---I don't think it's dogmatic or a minority opinion. There's at least three of us thinking this way.\n\nj a m e s\n\n"
    },
    {
      "time": "22 Sep 2007 — 8:15pm",
      "content": "for more tips on italics, see:  \n [obliques how-to](http://web.archive.org/web/20150124022430/http:/typophile.com/wiki/obliques%20how-to)\n\n"
    },
    {
      "time": "27 Sep 2007 — 7:46pm",
      "content": "Really nice work.\n\nThe 'i' looks a little odd to me with the curling tail. Suit's the 'l' though.\n\n"
    },
    {
      "time": "28 Sep 2007 — 5:24am",
      "content": "Thanks.\n\nYeah, in my opinion the lowercase 'l' needs something to differentiate it from the capital 'I'. Not so much if it's a sans serif with slabs on the cap 'I', but otherwise... So consequentially I put it on the 'i' as well. Without the tail I think the 'i' will look too harsh and square compared to the general feel of the face.  \nBut thanks for your reply, all thoughts are welcome. :)\n\n"
    },
    {
      "time": "28 Sep 2007 — 6:32am",
      "content": "Check this out: [Nomad](http://web.archive.org/web/20150124022430/http:/www.derfaber.ch/BILDER/PROJEKTE/NEU/Nomad.pdf)\n\n"
    },
    {
      "time": "28 Sep 2007 — 7:44am",
      "content": "That's nice. I had been searching for typefaces with kinks in it, but no luck.\n\n"
    },
    {
      "time": "30 Sep 2007 — 10:59am",
      "content": "I added a new PDF (rough-cut-4.pdf). A couple of pangrams, and a longer text setting. Changed all kinds of details and added characters. Crits and tips would be welcome.\n\nI think I'm slowly winning the 'battle for the s'. I have shortened some of the curly end strokes, but I'm not sure I like them now. Need to draw them again. And I'm really looking forward to making an italic version, and lighter weights. But I want to finish this one first of course.\n\nI don't know if I have incorporated all the previous critique already, but all in due time. :)\n\n"
    },
    {
      "time": "30 Sep 2007 — 1:20pm",
      "content": "both k's are too narrow (K and k). So is E a little bit.  \nAnd I think your letter spacing is too tight to make it decent for text setting.\n\n"
    },
    {
      "time": "30 Sep 2007 — 3:01pm",
      "content": "Thanks for your reply.\n\nReally? The lowercase 'k' is too small as well? I hope someone else can also give their opinion about that, before I change it. I agree that the 'K' and 'E' are too narrow though.\n\nAbout the letterspacing, yes, it's too tight. It's a remnant of when I was designing this purely as a display face. At this point I'm planning to make a lighter weight as well, which should be more fit for text setting. Somewhere in the process of doing so, I will also loosen the spacing. I didn't want to put time in to loosening it right now, but I might sometimes in the coming week. :)\n\n"
    },
    {
      "time": "2 Oct 2007 — 9:51am",
      "content": "Here is a (hopefully) helpful hint about the g:\n\nYou can (and should) cheat the bowl at the baseline a little higher. Instead of making it overshoot as far as the rest of the round glyphs, have the bowl just touch the baseline, or even a little above. It makes the letter balance better between the bowl counter and the space between the tail. Especially when you have short decenders. Right now it's a little top heavy.\n\nYou'd think moving it up would make it stand out, but it's the opposite.\n\nR\n\n"
    },
    {
      "time": "2 Oct 2007 — 11:06am",
      "content": "Alright, I checked that out in a couple of sans serif fonts (like Fedra), and you seem to be right. The 'g' (and 'b', same shape) often have smaller overshoots than the 'n' and 'o' etc.\n\nGood tip, didn't know that. I will try it out. :)\n\n"
    }
  ]
}
