{
  "id": "3708",
  "title": "Breccia, Stencil",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "![Breccia, Stencil](http://web.archive.org/web/20131017043157im_/http:/www.typophile.com/forums/messages/29/28964.gif)   \n   \nI've been sketching typefaces on paper for a long time, but this is the first time I created a complete true type font. Since it is my first attempt I wanted to start with something easier, hence a stencil typeface. I've been on the look-out for a great stencil font for a long time, so this is something that I will use myself, at least.   \n   \nI wanted the font to look like it had been hand cut, so I introduced some irregularities to it. I also wanted each face to be different and have a look of its own, so the font does not follow strict set of rules. The letters I like the most are A, B, and R. And so far I only have A-Z, and some punctuation marks.   \n   \nAny comments would be greatly appreciated. Please tell me how to improve this typeface so that I can make it better.   \n   \nI imagine that this font would be useful for bands (punk rock, etc), industrial, and futuristic applications.\n\n",
  "author": "antiphrasis",
  "time": "20 Mar 2004 — 6:45pm",
  "uid": "3247",
  "comments": [
    {
      "time": "21 Mar 2004 — 8:12am",
      "content": "Lately for me, stencils have been a practical, industrial solution, rather than an aesthetic trick.   \n   \nIt's up to you which tactic you want to take -- purely utilitarian, and yet possessing a \"vernacular\" appeal like your Y and N, or else more decorative. For instance, the location of the stent in the L is pointless except for looks. If you choose the latter approach, I suggest you go all out and push the outside of the envelope. Good luck!\n\n"
    },
    {
      "time": "21 Mar 2004 — 12:25pm",
      "content": "John,   \n   \nThank you for your comment. Since there are plenty of utilatarian stencil typefaces out there, I think I'm going to choose the latter approach and try for a more decorative and creative approach.   \n   \nHow do you feel about the weight? Is it good as it is? Or should I go thicker or thinner?   \n   \nAlso when it comes to the naming of the font, it's called Breccia and the style is Stencil. If I had different versions of the typeface, should I just have different style name like: Stencil, Stencil Bold, Stencil Italic, Stencil Bold Italic, and Distressed, Distressed Bold, etc. Or should I introduce the Stencil and Distressed to the typeface name instead of style? I hope you understood that. =)   \n   \nThanks again!\n\n"
    },
    {
      "time": "21 Mar 2004 — 9:08pm",
      "content": "The naming question is an interesting one. I started to think about it & it seems like calling it 'breccia' without the word stencil would make sense unless there is going to be a non-stencil version. In which case the reverse.   \n   \nI think some of the breaks are more successful than others. The R for instance is pretty artrful & feels almost like a folded piece of ribbon. I was looking at the W for example & thought why not break witha diagonal right after the peak in the w instead of with two straight vertical breaks.   \n   \nFor the breaks to feel right I think They need to help accentuate the shape of the letter rather than hiding it. Thats my diagnosis for the W. I like the E. The G is a mess.   \n   \nI would do your C & F I like the E. I like the K & O alot.   \n   \nIn terms of weight - it depends on what kind of impression you want to make. It feels very home-made & so very punk at the moment. It also feels kind of european tro me. Very regular at heart.\n\n"
    },
    {
      "time": "22 Mar 2004 — 2:55am",
      "content": "Eben,   \n   \nThank you for your insightful comments. Yeah, I'm not really sure yet if I will have more versions than the stencil one. So I guess I'll just call this Breccia (regular as the style).   \n   \nI will try to do more of the letters like the E... I guess I should stick to one style. I agree with you on the G. You've got some good suggestions there.   \n   \nYeah, I was going for a home-made feeling, hence the softened-straight lines and some degree of imprecision. Maybe I should have two versions: Precise and Home-made?   \n   \nI'm European, maybe that's where the European feeling comes from; I live in the US, though.   \n   \nHere's where I got the name for the typeface:   \n   \n [http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=breccia](http://web.archive.org/web/20131017043157/http:/www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=breccia)   \n   \nIt seemed fitting, somehow.   \n   \nThanks!\n\n"
    },
    {
      "time": "23 Mar 2004 — 5:21pm",
      "content": "![Breccia v 2.0](http://web.archive.org/web/20131017043157im_/http:/www.typophile.com/forums/messages/29/29137.gif)   \n   \nHere's a reincarnation of Breccia. It doesn't look much like the old one.   \n   \nIt's clean, precise, and rule-based...not organic like the one I worked on earlier.   \n   \nDo you guys see any use for a face like this? Should I continue working on it? And of course I'd be very greatful for c & c.   \n   \nBy the way, where's Hrant at? ;)\n\n"
    },
    {
      "time": "23 Mar 2004 — 11:50pm",
      "content": "I don't know if I like this new one better. It isn't worse - it's different. I would keep at it.   \n   \nI grabbed your image & mucked about with the forms to try to see an even more ribbon-y effect. Some of them seem better to me like the G & Q. The N isn't working in this altered version... Anyway - If you like the dirrection feel free to use it.   \n   \n ![](http://web.archive.org/web/20131017043157im_/http:/www.typophile.com/forums/messages/29/29149.gif)\n\n"
    },
    {
      "time": "24 Mar 2004 — 12:25am",
      "content": "Eben,   \n   \nI totally agree with you... I don't like my new version any more either. Looking at it now, after creating the typeface, it doesn't feel that much like a stencil, it's almost like a pseudo LCD typeface.   \n   \nI love your idea with the ribbon. It'd be really cool to take a long strip of paper (or ribbon, of course) and bend the different letterforms, see what kind of angles you'd use, and if you had to cut the strip in several pieces.   \n   \nThanks for the help. The G and Q looks great.   \n   \nIt's pretty hard, sometimes, to find unity when you work with constraints, but that's where creativity comes in... so I need to work on this font some more. I'll post more versions of this font as I work on it.   \n   \nOh, I just noticed, I like what you did to the K, it's cute.\n\n"
    },
    {
      "time": "24 Mar 2004 — 12:58pm",
      "content": "Thanks - Just trying to be ribbony. Yeah, it's too LCD-ish. Too rule bound.   \n   \nI looked at the old face you posted again today & I have to say I still think it's a direction worth working away at. I really like the old R.   \n   \nBTW- have you tried cutting the stencil out? Some of the breaks in the first set of letters seem like they would not support the cardboard around them that well - they seem like they would be weak connections...   \n   \nThat's why I was thinking about actualy cutting it out - it would be a way of seeing if the design is practical ( or not) .   \n   \nAlso it's a a different creative process. Like stone chiseling - or writing with a quill.   \n   \nYour original R & E are where I started thinking about ribbon - but I'm not sure a litteral adherence to the idea of ribbon is key ( like I did in my example). The old R doesn't stick to the ribbon idea completely & yet it's a really nice charcter.   \n   \n-e.\n\n"
    },
    {
      "time": "24 Mar 2004 — 6:53pm",
      "content": "Thanks to whoever removed my double-post.   \n   \nYeah, they're really rule-bound... Kind of begs the question if someone has done it before, with similar letterforms, and in some cases the exact same ones? (has to be someone)   \n   \nIt does have a clean \"digital\" quality to it, though. So I'll save that font for later.   \n   \nBut it feels like I took one step forward and two steps backward. Instead of doing something new, I got locked into a set of rules that I created for this project.   \n   \nYeah, I was thinking of printing out the typeface on paper or cardboard and cutting them out, but I don't have an exacto knife. I will do more work on the font this weekend when I have more time, and maybe try cutting them out.   \n   \nThanks again for all your help. I'll post new versions of Breccia as soon as they become available.\n\n"
    },
    {
      "time": "26 Mar 2004 — 6:05pm",
      "content": "Not exactly the same thing but check this out -   \n   \n [http://www.optimo.ch/pages/departement/index.php?id\\_categorie=2&id\\_font=1](http://web.archive.org/web/20131017043157/http:/www.optimo.ch/pages/departement/index.php?id_categorie=2&id_font=1)   \n   \n-e.\n\n"
    }
  ]
}
