{
  "id": "37103",
  "title": "newbie question: FontCreator via VOLT to .otf",
  "forum": "Build",
  "tags": [

  ],
  "content": "i’ve made some .ttf fonts with the excellent FontCreator, on a PC, and i think i’ve got the measure of VOLT, but a friend trying to install the resulting files on his shiny new Mac is getting an ’opentype data missing’ warning, whether they’re .ttf, or saved-as .otf ... Something’s evidently gone wrong (whether or not the warning indicates a genuine serious problem)\n\ni’m strongly fearing that i should have bought FontLab... evidently VOLT doesn’t restructure .ttf files (???). I tried Crossfont on them, but it produced a .dfont file..... that didn’t work either.\n\nam i missing one link here or a whole chain of them? i peeked at the adobe font kit, but i’m no way clever enough to grapple with it.... i can’t stretch to another font-making product... can anyone advise? is there any lightweight hand coding that i could do to complete the files?\n\nmy website ( in disguise ) : [www.jelly\\_](http://web.archive.org/web/20080706171605/http:/www.jelly_/ \"www.jelly\\_\") \\_ \\_ \\_hedge.com\n\n [‹ Sigmaker 3 issues...what am I doing wrong?](http://web.archive.org/web/20080706171605/http:/www.typophile.com/node/37300 \"Go to previous forum topic\") [Copy kerning from glyph to glyph ›](http://web.archive.org/web/20080706171605/http:/www.typophile.com/node/37252 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706171605/http://www.typophile.com/user/21769\" title=\"View user profile.\">sherman zipf</a>",
  "time": "<br>",
  "uid": "21769",
  "comments": [
    {
      "time": " 17.Sep.2007 3.27am",
      "content": "some body should really answer this boy’s question, although its ever such an old one. he sounds so unhappy about it! i’m _dying_ to know what he ought to do!\n\nI had a cat called TTF, and _he_ went missing one day. though maybe that’s a little off-topic ;-)\n\n"
    },
    {
      "time": " 17.Sep.2007 12.20pm",
      "content": "I am not sure what would cause the ’Missing OpenType data’ for an OTF, but I know that TrueType fonts which lack a ’fpgm’, ’cvt ’, or ’prep’ table will generate that in Font Book under OS X 10.4. This has been confirmed as being a bogus error; as this condition is common in unhinted TrueType fonts. You can avoid the error by generating TTF with hints; or just ignore the error and install the font anyway.\n\nIt would not surprise me if there’s something similar going on for OTFs (i.e. a table that Font Book is assuming should be there but isn’t generated by default).\n\n"
    },
    {
      "time": " 19.Sep.2007 8.41am",
      "content": "ok, thank you ..  \nthe font **is** unhinted: but it is smoothed...  \nis it possible dyou think to open the font in notepad - lets say - and paste minimal versions of the appropriate tables in? just to say “no hinting required” ... or is that a ridiculous idea and beneath contempt...  \n?  \nhinting is supposed to be horribly complex.. and in any case the programme i have doesnt help achieving it.\n\n"
    },
    {
      "time": " 19.Sep.2007 10.48am",
      "content": "Hinting and smoothing are not the same thing.\n\nUnless you had some extremely advanced version of Notepad, there is no way you could effectively edit the font data there.\n\nThere should be some kind of option in Font Creator to export hinted TrueType.\n\n"
    },
    {
      "time": " 20.Sep.2007 7.23am",
      "content": "no, i know that much, at least, about hinting.\n\nFontCreator calls it gridfitting, and smoothing ’greyscale rendering’ . i checked the combined ’gridfitting and greyscale’ for the font at all sizes. gridfitting does occur on my PC if i ask for it, despite there being no hinting procedure. ... _very confusing_.\n\nbut i don’t want to malign FontCreator, which is an ace programme. i just don’t know what i’m doing with it.\n\n"
    },
    {
      "time": " 20.Sep.2007 9.46am",
      "content": "It sounds like you’re talking about the ’gasp’ table settings. The ’gasp’ table controls sizes at which the rasterizer will apply gridfitting, _if the font contains hints_, and greyscaling (antialiasing) under Windows (no effect under Mac OS as far as I know). If the font does not contain hints, then the gridfitting setting will have no effect (there are no hints to apply). But this setting does not control whether the font contains hints to begin with.\n\nBack to the issue of the Font Book validation error, you can safely ignore that if the font is otherwise okay (check out Microsoft’s Font Validator if you haven’t already); it’s a bogus error. But if you want to eliminate the error from appearing, you’ll need to get hints into the font somehow (specifically, the ’fpgm’, ’prep’, and ’cvt ’ tables). I don’t know whether FontCreator is capable of generating new hints (autohinting); you may need some other tool if not.\n\n"
    },
    {
      "time": " 21.Sep.2007 11.43am",
      "content": "i’m all at sea here. i tried the fonts again with greyscale for all the available ranges 1 to 65000 or so... i’m sat in front of a very tiny/expensive mac which has just recovered from a lengthy fit after trying to install one of them. OpenTypeData missing was the only red cross... but the pre-VOLT .ttf version was OK... i think. my destiny lies elsewhere, evidently. but thanks for lifting the curtain on the hinting landscape, gaunt and strange though it is.\n\n"
    }
  ]
}
