{
  "id": "37107",
  "title": "1950s text face",
  "forum": "Design",
  "tags": [
    "General Discussions",
    "Design"
  ],
  "content": "Hello all. Any suggestions for a good text face, for a book, that has a 1950's resonance?\n\nThanks,\n\nRK\n\n",
  "author": "robkimmel",
  "time": "14 Sep 2007 — 6:32am",
  "uid": "21773",
  "comments": [
    {
      "time": "14 Sep 2007 — 8:18am",
      "content": "Are you talking about American or European Fifties ?\n\n"
    },
    {
      "time": "14 Sep 2007 — 8:51am",
      "content": "Good question. New York, literary Fifties. White writers, jacket-and-tie poets, jazz-listening Village set (not folkies/Beats/African Americans).\n\nThanks.\n\n"
    },
    {
      "time": "14 Sep 2007 — 4:40pm",
      "content": "Too specific? Just New York fifties, then?\n\nThx\n\nR\n\n"
    },
    {
      "time": "14 Sep 2007 — 5:13pm",
      "content": "One thing to try is get images of 50s jazz album covers:\n\n'57  \n [http://www.amazon.com/gp/product/images/B000000YGU/ref=dp\\_image\\_text\\_0/1...](http://web.archive.org/web/20131015132503/http:/www.amazon.com/gp/product/images/B000000YGU/ref=dp_image_text_0/102-2061420-9562522?ie=UTF8&n=5174&s=music \"http://www.amazon.com/gp/product/images/B000000YGU/ref=dp\\_image\\_text\\_0/102-2061420-9562522?ie=UTF8&n=5174&s=music\")\n\n'53  \n [http://www.amazon.com/Portraits-Standards-Stan-Kenton/dp/B00005JGRG/ref=...](http://web.archive.org/web/20131015132503/http:/www.amazon.com/Portraits-Standards-Stan-Kenton/dp/B00005JGRG/ref=sr_1_8/102-2061420-9562522?ie=UTF8&s=music&qid=1189814416&sr=1-8 \"http://www.amazon.com/Portraits-Standards-Stan-Kenton/dp/B00005JGRG/ref=sr\\_1\\_8/102-2061420-9562522?ie=UTF8&s=music&qid=1189814416&sr=1-8\")\n\netc.\n\nA trip to your local Vintage LP shop would probably be interesting. Check Dizzy, Charlie Parker, Sonny Rollins, Ella, and the rest who were going strong in the '50s\n\n"
    },
    {
      "time": "14 Sep 2007 — 5:47pm",
      "content": "Oops I just saw you said text face. In which case, check the liner notes of the album covers I guess.  \n; )\n\n"
    },
    {
      "time": "14 Sep 2007 — 7:17pm",
      "content": "Electra, Caledonia, or Baskerville would be good -- in metal.  \nBut digitally, they are too dry.  \nSo how about a Highsmith face like Prensa or Quiosco?\n\n"
    },
    {
      "time": "14 Sep 2007 — 8:29pm",
      "content": "Old vinyl for display type, sure. And right, not just the great Reid Miles' Blue Note stuff.\n\nNick, Prensa looks interesting....\n\nR\n\n"
    },
    {
      "time": "15 Sep 2007 — 6:25am",
      "content": "For text you might also want to consider  \nVendome  \n [http://www.myfonts.com/fonts/efscangraphic/vendome-sb/](http://web.archive.org/web/20131015132503/http:/www.myfonts.com/fonts/efscangraphic/vendome-sb/ \"http://www.myfonts.com/fonts/efscangraphic/vendome-sb/\")\n\nor URW Antiqua  \n [http://www.myfonts.com/fonts/urw/antiqua/](http://web.archive.org/web/20131015132503/http:/www.myfonts.com/fonts/urw/antiqua/ \"http://www.myfonts.com/fonts/urw/antiqua/\")\n\n"
    },
    {
      "time": "15 Sep 2007 — 7:06am",
      "content": "I vote Electra -- always says mid-twentieth century to me.\n\n"
    },
    {
      "time": "15 Sep 2007 — 7:09am",
      "content": "Many of the most popular typefaces used for books in American publishing in the 1950s were Linotype.\n\nIn his column, \"The Pi Channel,\" in the January 6, 1958 issue of <cite>Publishers' Weekly,</cite> Paul Bennett (who, it should be noted, was on the marketing staff with Mergenthaler Linotype) touted the presence of Linotype faces in the AIGA Fifty: \"The total score for Linotype in the Fifty since 1946 is, in fact, a whopping two-thirds of the exhibit -- 394 of the 600 honored selections.\"\n\nSome of the stats Bennett cites:\n\n\"By far the most popular were two fine transitional types: the contemporary Caledonia, designed by Dwiggins, and the classic Baskerville. It's interesting to note that though Linotype Baskerville has been available ten years longer than Caledonia, the latter was used for seven more books: 72 to 65.\n\n\"Among the preferred old styles, the ranking is Janson, Granjon and Times Roman. TR is the youngster here, being available just ten years -- yet it was used for nineteen books. The others: historic and classic Janson for 57 books; and the compact, space-thrifty Granjon, 35.\n\n\"Seemingly, there are but two moderns that are really accepted by our better bookmakers: the Dwiggins-designed Electra, and the lighter rendering of Bodoni's historic letter, Bodoni Book. Electra, though available eighteen years later than Bodoni Book, outscored the latter, 33 to 25.\"\n\nAs Nick cautions, however, the current digital versions of Caledonia and Electra are sadly lacking in the vitality of the originals and no longer well-suited for book text work, in my opinion.\n\nIf you're trying for 1950s facsimile, I'd probably try a Baskerville or Linotype Janson Text.\n\n-- Kent.\n\n"
    },
    {
      "time": "15 Sep 2007 — 9:35am",
      "content": "Thank you all. I'm curious about the dislike for the digital versions of Electra. This is a 300+ page book, so I'm not about to set it in lead (that would be a hell of a way to improve my meager letterpress skills, but this isn't the job). It seems pretty lively to me...what do you think it's lacking?\n\nR\n\n"
    },
    {
      "time": "15 Sep 2007 — 10:05am",
      "content": "Rob --\n\nThere was a lengthy discussion about Electra, digital vs. original, (among other things) many years back. Try this archive:\n\n[http://www.typophile.com/node/10675](http://web.archive.org/web/20131015132503/http:/www.typophile.com/node/10675 \"http://www.typophile.com/node/10675\")  \n [http://www.typophile.com/node/10685](http://web.archive.org/web/20131015132503/http:/www.typophile.com/node/10685 \"http://www.typophile.com/node/10685\")  \n [http://www.typophile.com/node/10725](http://web.archive.org/web/20131015132503/http:/www.typophile.com/node/10725 \"http://www.typophile.com/node/10725\")  \n [http://www.typophile.com/node/10747](http://web.archive.org/web/20131015132503/http:/www.typophile.com/node/10747 \"http://www.typophile.com/node/10747\")\n\nI didn't re-read the whole thing, but there are probably some statements I made which are out-of-date now, since I've done additional research and thinking since then.\n\nBut this should give you plenty to chew on.\n\n-- K.\n\n"
    },
    {
      "time": "15 Sep 2007 — 10:43am",
      "content": "Wow, I think I had never seen Dwiggins Uncial before. That's, ummm, quite some design.\n\n"
    },
    {
      "time": "15 Sep 2007 — 12:28pm",
      "content": "_what do you think it’s lacking?_\n\nThe irregularities and artefacts of the letterpress process, which in my opinion are a necessary part of historical ambience. Electra was an elegant face, but it nonetheless had a robust quality when set -- particularly apparent at this large (12pt) size, on uncoated stock with a bit of texture and some ink spread.  \nThe digital version is fine and slick, which is a different effect, and may be useful today -- but I don't think it captures the old mood.\n\n ![](http://web.archive.org/web/20131015132503im_/http:/typophile.com/files/WarholPage_4994.jpg)\n  \n.  \n\n ![](http://web.archive.org/web/20131015132503im_/http:/typophile.com/files/Warhol2_6044.jpg)\n  \nIn this enlargement, the scan from the 1957 book is on the left, and my facsimile using digital Electra is on the right. \n"
    },
    {
      "time": "16 Sep 2007 — 3:15am",
      "content": "deleted by popular demand…\n\npbc\n\n"
    },
    {
      "time": "16 Sep 2007 — 8:46am",
      "content": "Aside from any difference in contrast (which was debated at length in that other thread), another thing that strikes me about the comparison of digital Electra with the original is the difference in some character widths. Granted, these are pretty subtle; but the cumulative effect is noticeable.\n\nMetal Linotype had no unitized width constraints (just the duplexing constraint on paired roman and italic, or roman and bold). However, the earliest Linofilm photocomposition machines adopted an 18-unit system. This was partly a mechanical requirement, due to a constant drive motor. I believe the decision to divide the em into 18 units was influenced by the Monotype's 18-unit system. Later, with the advent of the Linotype V-I-P, a stepping motor allowed a more refined system and the constraint was changed to a 54-unit system for advance widths.\n\nI contend that, in the evolution from metal to photocomposition, designs like Electra and Caledonia were adapted to the unitized systems, and that these versions were then the sources for the digitizations now available. If one examines the l.c. character widths in digital Electra, for instance, it can be seen that they correspond neatly to 54-unit increments:\n\nf i j l t = 278 (15 units)  \nr s = 333 (18)  \nv x y = 426 (23)  \na = 444 (24)  \nc e g k = 463 (25)  \no = 500 (27)  \nb d p q = 519 (28)  \nh n u = 556 (30)  \nw = 667 (36)  \nm = 833 (45)\n\nI did not analyze the capitals, but I'm sure you'd find more of the same. This unitization would account for the difference in rhythm between texts set in digital Electra compared to the original.\n\nOf course, this subtle difference in character widths is not what leads me to assert that the face is no longer suited to book text -- that would come primarily from the spindly contrast (and the fact that a relatively large master was probably used). But this difference in rhythm is part of my disappointment in digital Electra compared with the original design.\n\n-- K.\n\n"
    },
    {
      "time": "16 Sep 2007 — 1:39pm",
      "content": "Thank you, Kentlew and Nick, for some tremendously thorough answers.\n\nR\n\n"
    },
    {
      "time": "17 Sep 2007 — 5:25pm",
      "content": "You might consider [Linotype's Fairfield Medium](http://web.archive.org/web/20131015132503/http:/www.myfonts.com/fonts/linotype/fairfield/) and [Storm's Walbaum Text](http://web.archive.org/web/20131015132503/http:/www.myfonts.com/fonts/storm/walbaum-text/) or [Berthold's Walbaum Standard BQ](http://web.archive.org/web/20131015132503/http:/www.myfonts.com/fonts/berthold/walbaum-standard-bq/) as well.\n\nDavid Thometz\n\n"
    }
  ]
}
