{
  "id": "37111",
  "title": "dialogue revised - new weights",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "posted this a couple of weeks ago had some really could help off people. started work on light and bold weights need people view whether I should go heavy or lighter.\n\nthe new weights letterforms need some fine tuning. cheers.\n\n| Attachment | Size |\n| --- | --- |\n| [weights.pdf](http://web.archive.org/web/20150123131316/http:/typophile.com/files/weights.pdf) | 40.81 KB |\n\n",
  "author": "cuttin shapes",
  "time": "14 Sep 2007 — 8:18am",
  "uid": "16450",
  "comments": [
    {
      "time": "14 Sep 2007 — 3:18pm",
      "content": "light is ok, but bold could be a bit bolder from my perspective. But you probably realize you have weight variation within each font? \"n\"s are all to heavy for each and so are \"f\"s, \"a\"s and \"t\"s.\n\n"
    },
    {
      "time": "15 Sep 2007 — 8:27am",
      "content": "Look at the variations in vertical and horisontal strokes. Especially the g in light is evidence of the problem with visual variation: here the horisontals are to light compared to the verticals.\n\n"
    },
    {
      "time": "17 Sep 2007 — 2:16am",
      "content": "cheers guys. i think i might make the bold more bold.\n\n"
    },
    {
      "time": "17 Sep 2007 — 6:29am",
      "content": "I like the direction you've given to this typeface. However, I've noticed some irregular junction or non linear line in some glyph, but may be it's the way you want your design. If not, I think you'll have to correct it. See the red line around what I think the problem are.\n\n ![](http://web.archive.org/web/20150123131316im_/http:/typophile.com/files/Test_4414.png)\n\n"
    },
    {
      "time": "17 Sep 2007 — 7:23am",
      "content": "thanks sim. I gotta sort that g out its dodgy. cheers.\n\n"
    },
    {
      "time": "17 Sep 2007 — 9:48am",
      "content": "Se also the bottom of the O. The inner vector seems to have a glitch.\n\n"
    },
    {
      "time": "17 Sep 2007 — 9:54am",
      "content": "I think you should visit all vectors, because most of them look a bit bumpy. None of the curves are really smooth. But ok, that is something you can practice. :)\n\n"
    },
    {
      "time": "17 Sep 2007 — 2:17pm",
      "content": "yeah I've found that taking the drawing illustrator to fontlab really shows up any faults. Fontlab is much more accurate tool but i'm no used to using yet. cheers for the help guys.\n\n"
    },
    {
      "time": "17 Sep 2007 — 3:09pm",
      "content": "Yeah, FontLab is definitely a very good help to smoothen out the vectors. :)  \nAs long as you use the béziers right, it should be fine (points in extrema, letting handles do the same amount of work, etc.). :)\n\n"
    }
  ]
}
