{
  "id": "37131",
  "title": "Are Most of You Skilled at Calligraphy?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I have FontForge and potrace up and running; and I’ve begun a tutorial to get my feet wet with FontForge. I also feel as if my reading is beginning to pay off. That is, I'm starting to notice some things I like he looks of in types. The fact remains, however, that I am not a drawer per se. And I have never done calligraphy. Do you folks think that particularly hampers me in my plan to create a type face family—even simply as a long-term exercise, not necessarily with any commercial aspirations?\n\nThank you.\n\nStephen Tiano  \nBook Designer, Page Compositor and Layout Artist\n\n",
  "author": "Steve Tiano",
  "time": "14 Sep 2007 — 6:04pm",
  "uid": "20846",
  "comments": [
    {
      "time": "14 Sep 2007 — 8:44pm",
      "content": "I stink at calligraphy, but learning what I have about it has dramatically increased my understanding of letters at a microcosmic level. Even if you never plan on hand-lettering anything that anyone else will see (most of my stuff goes straight to the recycling bin) it’s worth it just for the experience.\n\n"
    },
    {
      "time": "14 Sep 2007 — 10:01pm",
      "content": "I hate doing handwriting. I find it tedious and painful. That certainly stymied my attempts at calligraphy, but it is what led me to type design. One of my first fonts was based on ly own handwriting, which I made just so I wouldn't have to write so much anymore. Of course it has all the tells of a primitive handwriting font without any contextual substitutions and the like but nobody has complained about that.\n\nI have some old Speedball text books that I've learned a lot from though.\n\n"
    },
    {
      "time": "15 Sep 2007 — 12:51am",
      "content": "Most type designers are not calligraphers anymore, and most young designers I know cannot really write well, either. However, I find that \"calligraphy\" (by which I mean here writing with either a broad or a pointed pen) is a useful exercise for trying to understand why our letters and our alphabets look the way they do. I write letters to understand them, to try things out, and to try to get a little better at writing them and to control my hands and eyes. But not for anybody else to look at!\n\n"
    },
    {
      "time": "15 Sep 2007 — 2:47am",
      "content": "Some food for thought  \n [http://www.typophile.com/node/19878](http://web.archive.org/web/20150417104248/http:/www.typophile.com/node/19878 \"http://www.typophile.com/node/19878\")\n\nand google “chirography” in typophile, be prepared for a long read, a sample  \n [http://www.typophile.com/node/20100](http://web.archive.org/web/20150417104248/http:/www.typophile.com/node/20100 \"http://www.typophile.com/node/20100\")\n\n[http://www.typophile.com/node/7740](http://web.archive.org/web/20150417104248/http:/www.typophile.com/node/7740 \"http://www.typophile.com/node/7740\")\n\nTim\n\n"
    },
    {
      "time": "15 Sep 2007 — 5:13am",
      "content": "I think calligraphy can give you a better understanding as to why our (roman) letters look the way they do. I have never had formal training in calligraphy, but I have got a couple of pens, broad-nibs and such, with which I practiced calligraphy every now and then. I wanted to know more about contrast/thick-thin, and things like that.  \nBut I do not think you _need_ to know how to do calligraphy to design good typefaces. But it can certainly help.\n\n"
    },
    {
      "time": "15 Sep 2007 — 5:50am",
      "content": "Thanks to everyone for their input. Tim, thanks very much for those links. Informative reading. Although I can see where the discussions got a shade heated, you folks really do keep things pretty much to the matters at hand. Myself, I think I’m beginning to see that my inability to draw is not a good thing. But neither should it prove fatal if I apply myself seriously.\n\nThe discussion on handwriting was pretty interesting to me, as I really don’t even have that going for me. Sometime in high school, I gave up the ghost with script. I often had trouble making out my own handwriting afterwards. I took all my notes by printing, caps and small caps. To this day, I generally only use script for my signature. On rare occasions, when I don’t want someone looking over my shoulder, I’ll write in script. So I guess this will be as big a project as I’ve taken on, when I begin to make letterforms.\n\n"
    },
    {
      "time": "15 Sep 2007 — 7:34am",
      "content": "The good news is that drawing can be improved with practice, whether it is important is another matter\\*, since you will have to vectorise your sketches for a typeface they needn’t be highly polished. Basic calligraphic exercises – pages of o’s, c’s & m’s and short vertical, horizontal and diagonal strokes, using tramlines, are a great starting point for calligraphy – it is difficult to pick up a broad nibbed pen and write with it, which discourages some people – doing the exercises gets you to a position where you are happy making the base strokes with fluid movements, I find the best results are from pieces that are done reasonably quickly rather than painstakingly.\n\nThere are more heated threads on chirography (try a search for notan as well) but at bottom there are interesting opinions under the bickering.\n\nTim\n\n\\*personally I find it hugely helpful in nearly all areas of my work\n\n"
    },
    {
      "time": "15 Sep 2007 — 7:46am",
      "content": "To paraphrase a line from \"Treasure of the Sierra Madre\"... \"Calligraphy? We don't need no stinking calligraphy\"\n\nThat said, I did study it, and it is useful to a certain degree. I would say that understanding tool logic as it relates to letterform construction is more important than actually practicing calligraphy.\n\nnel mio parere\n\n"
    },
    {
      "time": "15 Sep 2007 — 8:09am",
      "content": "I think that to know calligraphy could probably give you an edge in understanding how to build and weight strokes. Personally I did just a little bit of calligraphy some 15-20 years ago and has not touched it since. I don't have the surgical calmness/precission in my hands to be really good at it which makes computer based drawing much better for me. The thing I'm trying to say is; You can still be good at form weighting of elements and generall composition even if you are not good at the rendering of hand drawn calligraphy.\n\n"
    },
    {
      "time": "15 Sep 2007 — 9:46am",
      "content": "I've studied and practised calligraphy, and would like to think it informs some of my designs -- but I have to agree with James that it's not essential to \"understanding tool logic\" -- after all, the discipline has split design from production for a long long time, with few designers actually being punch-cutters.\n\n"
    },
    {
      "time": "15 Sep 2007 — 9:57am",
      "content": "\\>understanding tool logic as it relates to letterform construction is more important than actually practicing calligraphy.\n\nThat's reassuring to those of us who haven't learned calligraphy. I did find that when working on an italic I had to pick up a broad-tipped marker and write letters to understand the entry and exit strokes better, and to get them to look right to my eyes.\n\n"
    },
    {
      "time": "15 Sep 2007 — 10:10am",
      "content": "Calligraphy, per se, is not important. That is, you don't need to be able to produce beautiful works of calligraphy in order to design typefaces. They are, ultimately, two different products.\n\nThere is a connection between the handwritten and the typographic, but it is at a level above type design: the level of 'text manufacture', where letters are put together and arranged for reading. In this, there is really very little difference between manuscript and typography, and all the canons of typographic text are derived from the manuscript tradition. But that tradition is not 'calligraphy', which is a kind of art made with letters and words; it is just text, written by scribes to be read by readers. I think this is important to understand, especially if one is going to design text typefaces. Not in a superficial way, e.g. making scribally-inspired typefaces, but in terms of relating what you do to something very much larger and more ancient than last week's graphic design fads. Typography is manufacturing texts with prefabricated letters, and the type designer is the person who makes those letters. But the text is what matters.\n\nMaking use of traditional scribal tools -- broad nib pens, reed pens, flexible split nib pens -- to explore the stroke relationships that are possible with these tools is a very useful exercise for any type designer. It can inspire new ideas and it also provides a lot of insight into why the normative forms of our letters are the way they are (and why the normative forms of letters in other scripts, traditionally written with different implements on different surfaces, are not like our letters). The scribes weren't stupid: they chose (or made) their implements with care, prepared their surfaces, invented or selected appropriate styles for different sizes of text, and all the while were conscious that they were producing something to be read by other people. So yes, there are things to be learned from understanding the dynamics of the tools that they used and the way in which they used them.\n\n"
    },
    {
      "time": "15 Sep 2007 — 11:40am",
      "content": "I think there is no doubt that training in calligraphy is a significant help to one's typographical skills. But the most important thing calligraphy teaches -- in regards to typography -- is artistic taste and judgment, which doesn't \\*have\\* to be learned through calligraphy.\n\nThere is a significant difference between calligraphy and typography: Calligraphy is final -- once you finish a stroke, you can't change it any more, or at least shouldn't; typography on the other hand, especially in the age of computers, allows unlimited possibility to tweaking and editing.\n\nI need ten to twenty tries to pen a word to my satisfaction. So if the job is to pen a few lines on a card, the chance of getting it perfectly (at least to my own judgment) is practically zero. But if I'm doing it on computer, I could just undo everything I don't like, and it's easily done all in all.\n\nIn other words, both calligraphy and typography require good eyes. In addition to that, calligraphy requires good eye-hand coordination. That requirement is dramatically reduced -- though not totally dropped -- with computer typography.\n\n"
    },
    {
      "time": "15 Sep 2007 — 11:49am",
      "content": "Henry said what I tried to say but the way it should be said;-)\n\n"
    },
    {
      "time": "15 Sep 2007 — 3:44pm",
      "content": "I agree with what Henry wrote except... the original question was about calligraphy and type design, not calligraphy and typography. Henry's comments echo what I wrote about parallel ways of creating text -- chirographic and typographic -- with essentially similar perceptual skill sets and decisions, but with different manual skills. But the question of how this relates to type design, i.e. to the manufacture of prefabricated letters for the typographic creation of text, is less obvious because the parallel is once-removed.\n\n"
    },
    {
      "time": "15 Sep 2007 — 5:01pm",
      "content": "I am not a type designer but have directed the development of at least four to perhaps five-hundred individual weights of typefaces. I am a designer, typographer and calligrapher, and must say that my foundation courses in calligraphy and typography helped me to understand many essential aspects of typefaces.\n\nOddly enough, I still don't know enough to actually design a face on my own, but can make most any typeface work (within an appropriate application) through typographic skills.\n\nIn short (and as stated previously above), being a calligrapher has little direct correlation to becoming a type designer. They are, in fact, quite different, requiring different skill sets and sensitivities.\n\nNot only are penned forms and typefaces different in execution, but the reader (layman) even perceives them differently. Did you ever wonder why most people can immediately appreciate a calligraphic work (\"My, I wish I could write like that.\") but on viewing an exquisitely composed page, can only appreciate the words themselves, not the _type_. It's not easy to make your work so good that it becomes invisible.\n\n"
    },
    {
      "time": "15 Sep 2007 — 5:52pm",
      "content": "Okay, then ... maybe I asked the question incorrectly, considering what I wanted to get at. Maybe not, tho', considering some of the answers so far.\n\nSo for the physical act of making letterforms that will be imported into either FontForge or FontLab, what skill set—i.e., the ability to draw, paint, or do calligraphy—is the most useful and should be developed by the fledgling designer of types? Or is some other skill altogether the one a beginner would do well to develop?\n\n"
    },
    {
      "time": "15 Sep 2007 — 6:11pm",
      "content": "I think just go ahead and draw some letters would be a good place to start. ;)\n\n"
    },
    {
      "time": "15 Sep 2007 — 8:14pm",
      "content": "_So for the physical act of making letterforms that will be imported into either FontForge or FontLab, what skill set—i.e., the ability to draw, paint, or do calligraphy—is the most useful and should be developed by the fledgling designer of types?_\n\nI think the most important skills to develop as a type designer are perceptual skills, rather than manual skills. The tools of modern computer font development are sufficiently flexible to not impose many limits on one's freedom to revise, revise, revise. It's not like cutting away at a piece of steel, where if you take too much off you're fuсked. You can fiddle endlessly with bezier curves. So the important things to learn are a) how to represent the shape in your mind and b) when to stop fiddling. That means you need to develop the skills that will enable you to make judgments about shapes and their relationships. This is where an understanding of the dynamics of mark making tools is useful, because it informs judgments about shapes and frees you from arbitrariness. It is particularly useful in comparing the treatments of different letters in a typeface and determining whether they are harmonious and, of not, in what ways.\n\n"
    },
    {
      "time": "16 Sep 2007 — 6:30am",
      "content": "I do think what I wrote applies to font design -- which is a part of typography. If you replace the word \"typography\" with \"font design\" in my comment, it'd still be totally valid.\n\n"
    },
    {
      "time": "16 Sep 2007 — 7:16am",
      "content": "I agree with John on the ability to judge shapes. I can't begin to tell you how many aspiring graphic designers and artists I know at my art and design school that don't have that judgement. They do not see when something they have created just doesn't look right, aesthetically speaking. They are usually all pleased with it, while it just sucks (on another level than opinion). I've not 'mastered' this judgement yet myself, but at least I acknowledge that it exists, so to speak. I know what I want something to look like. (I don't know if I explain it right, since English is not my native tongue).\n\n"
    },
    {
      "time": "17 Sep 2007 — 2:16pm",
      "content": "Related to the \"I hate computers\" discussion...\n\nI started drawing letters when I was about 10 years old. And then I taught myself how to make \"those cool gothic letters on the NY Times\" when I was 13. Not with a calligraphy pen, but by actually drawing them. Then I learned about calligraphy pens. I love the alphabet, and I like to draw, and I like to draw letters, and I like calligraphy, and I don't design type faces on the computer. So I guess that makes the two things completely unrelated, as far as I'm concerned.\n\n"
    },
    {
      "time": "17 Sep 2007 — 3:25pm",
      "content": "I have also studied calligraphy. CMU Graphic Design majors were required 2 years of it when I was in design school in the early 60s. I am glad I had it. It helped me learn to see and space letters. It helps in feeling the difference between positive and negative forms and understanding relationships between logical groups of letterforms.  \nAs for pen logic, this is the least useful aspect for type design unless you are interested in historic forms and wish to reflect a calligraphic basis.  \nI am by no means saying that calligraphy is essential to type design. I only say that it has taught me valuable lessons which I might otherwise have had to learn in a more time consuming way. We should not be so hasty as t either cast out or profusely bless any technique for learning about letter forms. Drink from the cup long enough to know how it tastes before you pass judgement.  \nI also feel brush lettering or more importantly brush calligraphy as done in Asian scripts to be a great teacher of what happens with form and counter-form.\n\nChrisL\n\n"
    },
    {
      "time": "17 Sep 2007 — 9:34pm",
      "content": "I am a sophomore design student currently taking both a calligraphy course and typography 1. Though I am only maybe.. 3 weeks into the both of these courses, I have noticed that what I'm learning in one class can be applied to or at least strengthen a concept for the other class. I realize that you are talking about type design, but I think that you're fine without any background in calligraphy. While actually writing the letters has allowed me to get to know each letter (much) better, I'm sure one could benefit in the same way just by looking at and studying all kinds of letters. You say you're starting to notice some things that you like. Do those same things keep catching your attention, and if so, why?\n\n"
    },
    {
      "time": "18 Sep 2007 — 6:20pm",
      "content": "As a leftie I really never got comfortable with a calligrapher's pen, but I have studied oddles of examples of good calligraphy to understand what was going on, and this is definitely helpful in designing type. By kind of imaging what the pen would be doing, I can make my Bezier curves to reproduce the effect, if that's what I want.\n\n"
    },
    {
      "time": "20 Sep 2007 — 2:53am",
      "content": "Excellent question I think.\n\nI also do not like calligrapy particularly but I always thought that it would have been very helpful to know something about it before designing my first typeface. It took me quite a while to understand logic of penstroke that is necessary even in modern typefaces (in my believe) while designing with the pencil.\n\nI think it is a good recommendation (spelling right?) to do some calligraphy before starting to design typefaces.\n\nStefan\n\n"
    }
  ]
}
