{
  "id": "37141",
  "title": "AskTypophile: Best practices for a dissertation?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello everyone, nice to meet you all, first time poster here and all that :-)\n\nI'll try to keep this trim. I'm a student in a Belgian school of translators, starting my final year. The \"master's thesis\" (or \"dissertation\"? Not sure about the English term. Whatever) I'm supposed to do will consist mainly in a translation (English to French) of a short book, or of selected chapters from a longer book. And as I recently found out typography is a subject I really dig, I've decided to work on a book about just that. Still choosing between \"Stop Stealing Sheep\" and \"Type and Typography\", but this isn't the point.\n\nNow to the question. When it comes to producing text content, which is what I'm doing, I'm fairly sure there are much better pieces of software than the usual OOo or MS Word. I dunno, maybe allowing better control of text formatting, more features, whatever. I'm a newbie to this, but I s'pose there's GOT to be something better than the word processors I've been using so far. And since my translation is about typography, I figure using the best tools available would be a valuable addition to the final work.\n\nAny ideas? Or should I just stick to Open Office? Here my requirements:  \n1) Free or cheap. I'm a poor student.  \n2) Windows or Linux. I don't own a mac.  \n3) Possibility to save or convert my work in Microsoft Word format without too much hassle. I know, I know, it sucks, but it's officially required by the school. However, having a more \"professional\" file included as an annex would kick ass. Perhaps I'd even use that one to print, and the .doc to give to the school as requested.\n\nVoilà. Sorry for not having searched much on the Web, I've always found community answers were much more useful than search engine answers. However, don't hesitate to just post a link and tell me to figure it out from there. Your help would be very appreciated.\n\n",
  "author": "Simon K",
  "time": "15 Sep 2007 — 6:33am",
  "uid": "21797",
  "comments": [
    {
      "time": "15 Sep 2007 — 8:36am",
      "content": "Nice to have you posting here, Simon. That's pretty cool that you're able to integrate an interest in typography into your dissertation.\n\nFor professional layout, the standard is [Adobe InDesign](http://web.archive.org/web/20150303172217/http:/www.adobe.com/products/indesign/) (now in version CS3), which gives you far more flexibility than MS Word ever could. [Here's](http://web.archive.org/web/20150303172217/http:/www.indesignsecrets.com/why-use-indesign-instead-of-ms-word.php) a short post that goes over a few reasons why InDesign's better. After you learn it, I doubt you'll be able to even imagine laying out something like a dissertation in Word, especially when it comes to typographic refinement. Plus, InDesign comes with a bevy of high-quality fonts perfect for a dissertation without having to spring for those, too.\n\nPeople also use [Quark](http://web.archive.org/web/20150303172217/http:/www.quark.com/products/xpress/), although the numbers are, as far as I know, going down each year. I haven't used it so I can't really comment, but most people I know choose InDesign when they can.\n\nThe bad news -- both of these are quite expensive. Two pieces of good news, however: 1) You're a student, which means you may be eligible for student discounts on software and other goodies. As a student myself, I use studica.com, where I could get InDesign CS3 for $200 (U.S.) instead of $699 from Adobe. It looks like they sell in Europe as well, but you should check -- there are several of these academic resellers around, so choose whichever seems best to you. 2) You can download the InDesign CS3 trial to use free in all its glory for 30 days [here](http://web.archive.org/web/20150303172217/http:/www.adobe.com/downloads/). If after experimenting you think it's worth it (and you should if you pick up a book from the library or buy one about how to use it), then you can buy the program.\n\nAddressing your other two requirements, InDesign is available for Windows and can export its files to RTF (under File\\>Export...), which Word can read and print. You can also easily import Word files (File\\>Place), if that makes a difference.\n\n"
    },
    {
      "time": "15 Sep 2007 — 6:05pm",
      "content": "Welcome, Simon. I’m something of a newcomer here myself, tho’ I’ve been quickly giving the place a workout and I can tell you, hands down, that this may be very nearly the most helpful group of people I’ve ever encountered on a forum.\n\nOkay, that said, get away from MS Word and Open Office—perfectly good tools for what their purpose is, but not page layout software. (I often liken doing book design and layout in Word to whacking a nail into a wall with the flat side of a heavy wrench. Eventually you will pound that nail in, I suppose, but it’s not the tool made for the job and you might have unintended results along the way that cost you more time and money overall.)\n\nAlthough I keep hearing how InDesign is rapidly replacing Quark, the lion’s share of the books I get from publishers and book packagers are to be done in Quark, now up to version 7.3, I believe. But I am also beginning to get requests for InDesign. I’m still a little more used to Quark, but InDesign—although CS3 is available, I’ve yet to make the move from CS2, which suits me fine yet—is a great program, easy to learn (if you apply yourself and put in the time), and seems particularly familiar to anyone who used PageMaker previously.\n\nI second the notion that it’s a good deal to have the opportunity to indulge an interest in typography into the work of getting out your dissertaion.\n\nGood luck with it.\n\nStephen Tiano  \nBook Designer, Page Compositor & Layout Artist\n\n"
    },
    {
      "time": "16 Sep 2007 — 3:31am",
      "content": "Besides kick-ass commercial tools mentioned above there's a cheap one called [Scribus](http://web.archive.org/web/20150303172217/http:/www.scribus.net/), which I think should be fine for you and won't cost a penny.\n\n"
    },
    {
      "time": "17 Sep 2007 — 1:51am",
      "content": "Thank you all for your input. So I've learnt newbie lesson #1: word processing and layout/design are two different things. Since I won't be using any fancy layout functions (saying my school is conservative in its requirements would be an understatement), I guess I'll stick to word processors, and perhaps deal with another piece of software when it comes to printing the physical copies... if I'm not in a rush to meet deadlines.\n\nWhat actually had me wondering about the adequacy of word processors was their incomplete support of, for instance, small caps or non-lining numerals. But spending days or weeks learning a whole new program, for a result probably too small to even be noticed by the professors? Nah.\n\nStill, I've bookmarked Scribus and will remember InDesign as the way to go once I'm rolling in dough... 200 dollars is about what I spend in food every month, so buying even a discount copy of a professional application isn't an option. And stealing is, well, wrong. Thanks again!\n\n"
    },
    {
      "time": "17 Sep 2007 — 3:20pm",
      "content": "And of course, if you have loads of time and like tweaking everything yourself, there's always LaTEX.\n\n"
    },
    {
      "time": "18 Sep 2007 — 8:57am",
      "content": "You might want to consider XeLaTeX from SIL, which has OpenType support.\n\n"
    },
    {
      "time": "20 Sep 2007 — 2:29pm",
      "content": "Isn't XeTeX built upon Mac OS X's built-in OT support and in consequence isn't it Mac only?\n\n"
    },
    {
      "time": "23 Sep 2007 — 2:48am",
      "content": "Not anymore. You can also get it for Linux and Windows. Windows binaries are available through the latest Miktex beta ( [http://miktex.org/2.7/Setup.aspx](http://web.archive.org/web/20150303172217/http:/miktex.org/2.7/Setup.aspx \"http://miktex.org/2.7/Setup.aspx\")) or through the W32TeX distribution ( [http://www.fsci.\\*\\*\\*\\*.kindai.ac.jp/kakuto/win32-ptex/web2c75-e.html](http://web.archive.org/web/20150303172217/http:/www.fsci. ****.kindai.ac.jp/kakuto/win32-ptex/web2c75-e.html \"http://www.fsci.\\*\\*\\*\\*.kindai.ac.jp/kakuto/win32-ptex/web2c75-e.html\")).\n\nFrom reading this page ( [http://wiki.contextgarden.net/Mark\\_IV](http://web.archive.org/web/20150303172217/http:/wiki.contextgarden.net/Mark_IV \"http://wiki.contextgarden.net/Mark\\_IV\")) it sounds like ConTeXt with Mark IV may be an alternative OpenType-aware TeX derivative.\n\n"
    }
  ]
}
