{
  "id": "37156",
  "title": "I hate computers",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "They suck. They are life sucking soul sucking pieces of garbage.\n\nI am sick of them. They kill humanity.\n\npbc\n\n [‹ Vista, CS3, suitcase and T1 Woes](http://web.archive.org/web/20080706084709/http:/www.typophile.com/node/37318 \"Go to previous forum topic\") [Workstation vs. laptop ›](http://web.archive.org/web/20080706084709/http:/www.typophile.com/node/37097 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706084709/http://www.typophile.com/user/7347\" title=\"View user profile.\">Paul Cutler</a>",
  "time": "<br>",
  "uid": "7347",
  "comments": [
    {
      "time": " 16.Sep.2007 4.15am",
      "content": "You can give me your computers if you want. I’ll take them.\n\n"
    },
    {
      "time": " 16.Sep.2007 4.36am",
      "content": "I like computers. I find them very useful.\n\n"
    },
    {
      "time": " 16.Sep.2007 6.34am",
      "content": "Hi Paul, which computers do you hate (read want to get rid of). Hears rubbing of hands and evil laugh.\n\n"
    },
    {
      "time": " 16.Sep.2007 7.03am",
      "content": "Come now Paul, how can you say that, without them you’d never have known me and I know that must be a distressing thought LOL.\n\n"
    },
    {
      "time": " 16.Sep.2007 7.27am",
      "content": "Photoshop Rocks. But you can only play it on a computer. And Google is about the greatest invention of my time. Now you no longer have to wonder why something is, or who did what. You can know in seconds.\n\nBut if computers didn’t exist, I bet we’d all get out more. Of course that would lead to more driving, depleting our natural resources, _and_ contributing to more poorly researched films by Al Gore.\n\n"
    },
    {
      "time": " 16.Sep.2007 7.58am",
      "content": "Computers are the most loyal, devoted pieces of machinery ever invented. They only do exactly what they are instructed to do. The programmers that gave crappy instructions are where to place the blame. AT&T just took over Bellsouth, the company that provides my service. Somehow, without letting anyone know, they switched email servers. That wasted a few dozen hours of my time troubleshooting what was wrong with my machine before I found out, thanks to the internet, that it wasn’t my machine. It was them. The hilarious part is that after a few weeks of asking them what they did that caused the problem, they sent back a response with very basic instructions for how to send an email — something I have been doing quite successfully for a couple of decades before they came along. The problem still isn’t fixed. But at least I can send an email with an attachment again.\n\nPaul if you really want to give it up though, I think I have some rubylith somewhere around here I’ll give you a deal on — xactos, triangles, blue leads, and some other dust collectors too.\n\n"
    },
    {
      "time": " 16.Sep.2007 7.59am",
      "content": "Computers are good.\n\nThe Adobe Illustrator team’s last four releases, on the other hand...\n\n"
    },
    {
      "time": " 16.Sep.2007 8.18am",
      "content": "Well, essentially, I really like computers, too—all the Macintoshes I’ve had, particularly, as they’ve enabled me to make a whole slew of books. But ... at various times I’ve learned to hate and despise software, tho’ not in a long time.\n\nI once worked all night on a single-article issue of a science journal in order to FedEx it to the publisher for a rush get-out issue. Somewhere right around daybreak I did my last Save and PageMaker, bless its pointed little head, sent me a Bad Record Index error, would not save, wiped the article from my hard drive, and rendered my copies of the article useless the same way.\n\nI was about to put my fist thru the computer’s screen—this was in the CRT monitor days until I thought better of it.\n\n"
    },
    {
      "time": " 16.Sep.2007 8.44am",
      "content": "I’ve had moments like that also, where I just want to take the thing and crush it to dust, but then, I’ve broken pencils and torn and crumpled up pieces of paper too. These moments pass. Just take a deep breath & count to ten before giving yours away. :-)\n\n"
    },
    {
      "time": " 16.Sep.2007 8.59am",
      "content": "I’ve felt this way, too, Paul. Russell’s got the right idea, though — go take a walk around the block, or better yet, in a park, where you can look at some grass and maybe even trees... It works for me, at least.\n\n"
    },
    {
      "time": " 16.Sep.2007 12.27pm",
      "content": "Computers are tools.\n\nI am also a tool, so computers suit me fine.\n\n"
    },
    {
      "time": " 16.Sep.2007 1.27pm",
      "content": "Paul\n\nThe computer is only as good as the person operating it...\n\n"
    },
    {
      "time": " 16.Sep.2007 3.13pm",
      "content": "Have you ever heard of computer people refer to a problem, not as a software problem, but as a “wetware” problem, referring to the operator?\n\nPretty funny.\n\n"
    },
    {
      "time": " 16.Sep.2007 3.42pm",
      "content": "Keith Moon or a drum machine. Which do you prefer?\n\npbc\n\n"
    },
    {
      "time": " 16.Sep.2007 3.57pm",
      "content": "<cite>Keith Moon or a drum machine. Which do you prefer?</cite>\n\nErnesto Simpson.\n\nI might as well say I hate electronic drum sets with a passion. I will never play again with anyone using that kind of set up. It’s worse than playing with someone who only knows how to play rock, imo.\n\nI don’t have any experience with drum machines, but I can only imagine.\n\n"
    },
    {
      "time": " 16.Sep.2007 3.59pm",
      "content": "I have a drum machine. But I don’t know how it works. ;)\n\n"
    },
    {
      "time": " 16.Sep.2007 6.10pm",
      "content": "Yes it is - and I’ve never heard the term before - but ah, so true. Thank you for sharing. Hard to find new lingo when you are an office of one!\n\n"
    },
    {
      "time": " 16.Sep.2007 10.10pm",
      "content": "“The computer is only as good as the person operating it...”\n\nOh that’s such nonsense. Companies like Apple trading quality control for bigger profits from fast turn arounds has nothing to do with my skill level.\n\n"
    },
    {
      "time": " 16.Sep.2007 11.02pm",
      "content": "_Keith Moon or a drum machine. Which do you prefer?  \npbc_\n\nHmm... let me think about that one Paul. Keith Moon - a rotting putrid corpse long buried beneath the soil, along with it’s hopes and dreams - OR - a drum machine.\n\nI’ll take the drum machine ;)\n\nIn any given week I’ll go through at least one sketch book (100 pages). And on the ’puter in the same week, I’ll throw down about 10-15 pdfs. I’ll also pull in about 30-50 scans into my ’work’, and about same amount (or more) source material from the www. My brain is one long friggin jam session of impluse/action/reaction.\n\n"
    },
    {
      "time": " 17.Sep.2007 2.13am",
      "content": "Haley — it isn’t nonsense. From teletype operators (to me the original computer) to mag cards — and everything there after. What ever the machine - i could probably show you the person who mastered it and the one that never will.\n\n"
    },
    {
      "time": " 17.Sep.2007 6.31am",
      "content": "It’s usually the software that sucks.\n\n"
    },
    {
      "time": " 17.Sep.2007 6.39am",
      "content": "Computer is just like a hammer. You should know when and where to hit.\n\nI love my tools.\n\n"
    },
    {
      "time": " 17.Sep.2007 7.36am",
      "content": "I don’t love my tools. I used to work a pc and switched to mac. I find them both annoying, but the mac a little less so. I wish I could do without it. With it, there is som much i think i can do, but i never find the time to do it.\n\nOnly 37 more years untilo I’m retired!!! I can hardly wait.  \n.........................................................  \n [Bison Design](http://web.archive.org/web/20080706084709/http:/www.bisondesign.no/)  \n [Spön](http://web.archive.org/web/20080706084709/http:/www.myspace.com/sponnorway)\n\n"
    },
    {
      "time": " 17.Sep.2007 7.41am",
      "content": "If I had the patience I would never sit down in front of these things, I’d just paint all damned day. But I don’t, and the machines facilitate my wacky brain, so I embrace them.\n\n"
    },
    {
      "time": " 17.Sep.2007 9.36am",
      "content": "I am primarily speaking of the level of micro-management that computers allow. Perfection is the opposite of perfection.\n\npbc\n\n"
    },
    {
      "time": " 17.Sep.2007 10.49am",
      "content": "Remember Two Things:  \nComputers are never sorry  \nand if you only have a hammer everything starts to look like a nail!\n\n"
    },
    {
      "time": " 17.Sep.2007 11.04am",
      "content": "\\>Perfection is the opposite of perfection.\n\nDoes that mean this is as good as it gets?\n\n"
    },
    {
      "time": " 17.Sep.2007 2.10pm",
      "content": "\\> They are life sucking soul sucking pieces of garbage...They kill humanity.\n\nI’m with you. Just last night, as I sat in front of the damn thing updating my web site (oooooooh...I have a web site!) for three flippin hours (again) unable to stop myself from trudging along, I thought to myself, “Self, why are you doing this? Why aren’t you downstairs making something with your hands? That’s what you like you to do, remember? This is getting you absolutely nowhere.”\n\nThey suck like tobacco sucks. And now I’m going to go have a smoke.\n\nWeak, I am. Damn it.\n\n"
    },
    {
      "time": " 17.Sep.2007 3.17pm",
      "content": "Frankly, I sick and tired of all this easy access to porn!\n\nKidding... gosh.\n\nMikey ;op\n\n"
    },
    {
      "time": " 17.Sep.2007 3.58pm",
      "content": "My computer enables me to make money. Making money doesn’t suck. I’m good wit dat.\n\n"
    },
    {
      "time": " 17.Sep.2007 4.47pm",
      "content": "<cite>Computer is just like a hammer. You should know when and where to hit.</cite>\n\nIf the only tool you have is a hammer, everything starts to look like a nail.\n\nI love computers but they are killing my eyes.\n\n"
    },
    {
      "time": " 17.Sep.2007 5.13pm",
      "content": "I am suffering from arthritic reactions to all the pointing options I had been using. So I went and got Wacom tablet, to see if that helps, and I have found if I put the pen between my first and second finger, it puts my thumb in a very comfortable position. Once I get used to doing my right clicks with my second finger, I think we have a winner.\n\nI think I can say that I hate slow computers. If I am on one that can do things as fast as I want to, I am a very happy camper.\n\n"
    },
    {
      "time": " 17.Sep.2007 6.29pm",
      "content": "<cite>I think I can say that I hate slow computers. If I am on one that can do things as fast as I want to, I am a very happy camper.</cite>\n\nBra-VO! It amazes me how much I can get done, and how fast I can do it, on a Macbook Pro. Core Duo at a time when RAM prices are amazingly low is an awesome thing, and most apps barely use it. But watching Photoshop max out box cores makes me just for the day when I have a quad-core laptop and just about everything is multi-threaded.\n\n"
    },
    {
      "time": " 17.Sep.2007 11.57pm",
      "content": "I remember when my parents got their first computer in 1988. It had a 8mb harddisk, the first ever windows version, and a button that would change the processor speed from 8 to 12 mHz. I usually kept it on 8mHz, because at 12 mHz, it was impossible to play Hard Hat Mac, Space Invaders and Hard Hat Mac. And it had a really noisy printer.  \n.........................................................  \n [Bison Design](http://web.archive.org/web/20080706084709/http:/www.bisondesign.no/)  \n [Spön](http://web.archive.org/web/20080706084709/http:/www.myspace.com/sponnorway)\n\n"
    },
    {
      "time": " 18.Sep.2007 12.01am",
      "content": "My first computer was an 8 mHz IBM with 640K RAM and a massive 20Mb hard drive. I learned how to program on that machine, I wrote some very screwy code but - it was the solidest computer I have ever owned - it never crashed - probably because the OS was the simplest. It lasted me 8 years.\n\nTry that today.\n\npbc\n\n"
    },
    {
      "time": " 18.Sep.2007 4.39am",
      "content": "”... It lasted me 8 years. Try that today. “\n\nI’m sure I can make my computer last through the day. It’s the keyboard I’m always scared of.\n\n"
    },
    {
      "time": " 18.Sep.2007 5.01am",
      "content": "im just scared of computers...seem too complex.  \nBut then I’m curious, what prompted this thread??\n\nshreyas\n\n"
    },
    {
      "time": " 18.Sep.2007 6.01am",
      "content": "\\> Frankly, I sick and tired of all this easy access to porn!\n\nThey say that too much porn can result in missing verbs.\n\n"
    },
    {
      "time": " 18.Sep.2007 7.02am",
      "content": "My first computer was a MacII CI which was an awesome machine for its time and state of the art for something like 2 years, unheard of now. It had 8MB of RAM and a hard drive of 100MB. Of course in those days RAM was like $100/MB (after the japanese earthquake). I had that baby for 10 years, altho by the end all it was good for was email.\n\n"
    },
    {
      "time": " 18.Sep.2007 7.19am",
      "content": "<cite>Try that today.</cite>\n\nToday we have a lot more reasons to upgrade. There was a time when most upgrades were driven by video games because the machines were so slow that performance increases were barely relevant to running anything else. Now performance increases can be pretty astounding, and having enough cheap RAM to keep all of one’s pertinent applications running in concert makes extra CPU cycles a lot more useful.\n\n"
    },
    {
      "time": " 18.Sep.2007 8.12am",
      "content": "I like computers.\n\n"
    },
    {
      "time": " 18.Sep.2007 8.42am",
      "content": "Sometimes I feel like David Copperfield, and sometimes it is like doing hard time in prison. “Love, Hate, Everything In-between”.\n\n"
    },
    {
      "time": " 18.Sep.2007 9.59am",
      "content": "We have more reason to upgrade because marketing departments have seized control of development - opting for whiz bang features instead of things that could actually help us, like getting the mess called color management straightened out, or font management on OSX for example.\n\nOr instead of slowing down for a few moments and actually making sure software is bug free before it’s released, instead of always playing catch up, and never quite getting there.\n\npbc\n\n"
    },
    {
      "time": " 18.Sep.2007 7.54pm",
      "content": "How is the forgery business these days Gary (“my computer enables me to MAKE money”)?\n\nMy first machine was an Amiga running Deluxe Paint. I remember reproducing pictures like the first Batman poster pixel by pixel (actually individually rendering each). I was around 12-14 and had already built a name for myself internationally as a Deluxe Paint pro-user (my learning curve was steeper and competition was only a few guys Germany and the UK). Aaahhh, the love of running home to your computer after school and staying until your mum told you to go to bed, then sneak up and play some more with pixels and hues.\n\nI’m not to sure I hate computers. They are a great tool. Email on the other hand is what’s killing our industry. It’s so easy for that marketing exec to send out on his way from the office: I need this on my desk tomorrow morning. Leaving you to work through the night. If you only had a phone they would actually have to talk to you and you could decide to pick up or not if the time was 5 min. to 4 and you had plans for the night. These days everyone expects you to read their email even if it’s after hours. Not to mention all the time spent on reading and writing them. Instead of collating information and provide a proper written brief things comes in pieces often several times only slightly adjusted each time just enough so you have to read it again. AAAaaaarrrrggghhh.  \nBloody emails and mobile phones. Give me back the days prior to speed dial!\n\n"
    },
    {
      "time": " 18.Sep.2007 8.08pm",
      "content": "<cite>Give me back the days prior to speed dial!</cite>\n\nAs a salesman, I hate voice-mail. Give me the days when you could get the key someone who made the decisions _when_ you were actually trying to fill in your calendar.\n\n"
    },
    {
      "time": " 18.Sep.2007 9.33pm",
      "content": "<cite>These days everyone expects you to read their email even if it’s after hours.</cite>\n\nI still don’t understand why so many people put up with that attitude. I can understand why all my lawyer friends put up with it—they get paid hundreds of thousands of dollars a year and everything from individual freedom to massive corporations depends on their work. But for a design salary (and rates) people should be happy that anyone reads their email at all, much less after five PM. Try getting a plumber to do any work after hours for what a designer gets paid and one will likely learn what a wrench tastes like.\n\n"
    },
    {
      "time": " 18.Sep.2007 11.22pm",
      "content": "I love computers.\n\nI remember going to a friend’s house in (probably) 1978 and seeing an Apple II for the first time. It was an amazing thing. I remember writing BASIC programs on TRS-80s in the computer lab in junior high. (Ugh, I was a computer geek!)\n\nThen my mom, great mother that she is, bought us our own Apple II and we spent a couple years playing Castle Wolfenstein, and Zork, and The Wizard And The Princess, and Star Maze, and Choplifter...\n\nBut I do feel sorry for new computer users these days, because they are complicated — and if you ask me, it was more fun learning with those early ones.\n\n"
    },
    {
      "time": " 19.Sep.2007 12.10am",
      "content": "Someone in oslo dislikes a certain brand of computers. I found this sticker on a lamp post.\n\n ![](http://web.archive.org/web/20080706084709im_/http:/www.typophile.com/files/badreligion_3921.jpg)\n\n.........................................................  \n [Bison Design](http://web.archive.org/web/20080706084709/http:/www.bisondesign.no/)  \n [Spön](http://web.archive.org/web/20080706084709/http:/www.myspace.com/sponnorway)\n\n"
    },
    {
      "time": " 20.Sep.2007 8.20am",
      "content": "[Classic!](http://web.archive.org/web/20080706084709/http:/www.youtube.com/watch?v=HtTUsOKjWyQ)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nFischers Fritz fischt frische Fische, frische Fische fischt Fischers Fritz.\n\n"
    },
    {
      "time": " 20.Sep.2007 8.56am",
      "content": " ![](http://web.archive.org/web/20080706084709im_/http:/www.typophile.com/files/happy_mac_2x_4692.gif)\n\n"
    },
    {
      "time": " 20.Sep.2007 3.27pm",
      "content": "I remember all of these old guys working at the sign shops that could take “One Shot” paint and paint the most fantastic letters. Those vinyl plotters put them out of business.\n\nI also remember the first demonstration I saw of digital photography around 1989. The camera was a huge video camera. It was plugged into a big computer and monitor. The photo took about five minutes as the red, green and blue channels each panned through their individual scans. Then it took another five minutes or so for the CPU to process the image. Needless to say still shots were all that could be taken. I think that camera cost something like $30,000. The little pocket cameras you can buy for a couple of hundred dollars today take a picture ten times better and a thousand times faster.\n\nI won’t forget the reaction when I told the photo labs that they’d better start establishing a digital base. They completely discounted it saying, “there is no way a digital image can ever compete against continuous tone film photography.”\n\n"
    },
    {
      "time": " 21.Sep.2007 8.35am",
      "content": "speaking of “the old days”...\n\nI was hand cutting vynil and Rubylith films for a screen printing company in about ’82 or ’83, when I saw the first digital plotter for cutting vynil and Rubylith. It was so slow and could only cut arcs in something like 3.6 degree increments... I thought - “These things will NEVER replace a skilled guy like myself” :-)\n\n"
    }
  ]
}
