{
  "id": "37168",
  "title": "Letragraphica",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi, were Letragraphica catalogues produced annually?\n\n",
  "author": "<a href=\"/web/20090725091339/http://typophile.com/user/9690\" title=\"View user profile.\">Hiroshige</a>",
  "time": "<br>",
  "uid": "9690",
  "comments": [
    {
      "time": " 16.Sep.2007 3.56pm",
      "content": "Letragraphica was a subset of Letraset, and I seem to remember waiting every six months of so for each new catalog.\n\n"
    },
    {
      "time": " 16.Sep.2007 4.42pm",
      "content": "Thanks oldnick. I have a chance to pick up a copy of Letragraphica, Characteres Letraset D’Avant Garde 1977 and I was wondering if there were other catalogues I can also look for.\n\nThe content is inspirational stuff - well to me it is anyways. After some digging I found that volume featured on - [http://acejet170.typepad.com/foundthings/2007/06/index.html](http://web.archive.org/web/20090725091339/http:/acejet170.typepad.com/foundthings/2007/06/index.html \"http://acejet170.typepad.com/foundthings/2007/06/index.html\") (shown down at the bottom of the page).\n\n"
    },
    {
      "time": " 17.Sep.2007 6.43am",
      "content": "I have an incomplete set of Letraset supplementary catalogs from the Seventies and Eighties. Only a few are what you could call Letragraphica catalogs, but most of them have Letragraphica faces in them:\n\n18 New Type Faces / Letragraphica / Featuring Letraset International Typeface Competition Winners 1973 (1973)\n\nRange Extension 1974\n\nLetragraphica 16, 17, and 18 (1974)\n\nLetragraphix Number Two (features Ray Cruz; no date, probably 1975)\n\nNew Typefaces 1976\n\nLetragraphix Number Three (designed by Kit Hinrichs, 1976)\n\nCatalog Supplement ’77 (1977)\n\nLetragraphix Volume Four (designed by SVA students, 1977)\n\nThe Letragraphica Gallery (purple, orange and red cover; no date, but probably 1977 or 1978)\n\nThe Letragraphica Gallery (black and brown cover; no date, but probably 1979)\n\nLetragraphix Volume 6 (no date, probably 1979)\n\nSweet Treats (1980)\n\nLetragraphix Volume 7 (1980)\n\nGraphic Treasures (1981)\n\nLetragraphix Volume 8 (1981)\n\nArt-I-Facts (1982)\n\nCelebrate New Letraset Products (1984)\n\nLetraGazette Issue No. 1 (1984)\n\nLetraGazette Issue No. 3 (1985)\n\nLetraGazette Issue No. 5 (1986)\n\n(The ones where I have guessed at the dates are based on what typefaces were announced in the catalog.)\n\nOne other thing: These were all U.S. editions.\n\n"
    },
    {
      "time": " 18.Sep.2007 9.07am",
      "content": "Mark, nice looking stack you got there! LetraGazette sounds interesting and I see a few others I’m going to hunt down too.\n\nThanks for mentioning Kit Hinrichs, I hadn’t heard his name before. I took a look at some of his stuff online and read a few articles/interviews, he seems well grounded.\n\n"
    },
    {
      "time": " 18.Sep.2007 9.36am",
      "content": "The Letragraphix editions featured well known designers and illustrators. The early ones look more like brochures, the later ones look more like newsletters (more text). A bit of trivia: Letragraphix Volume 6 features the winners of the “Liberated Letter” contest, and one of the winning entries is by Rick Tharp. The “Art-I-Fact” editions are not as nice-looking.\n\n"
    }
  ]
}
