{
  "id": "372",
  "title": "Television Type Legibility",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi, I am new to these forums. I am about to attempt to design a new font for television closed captioning. I plan on experimenting with a bitmap font due to the low resolution (~560x420) of a standard television screen. Anyway, I have never designed for a tv screen and am wondering what fonts read well on tv (for long periods of reading of course, not a display face). I would like to look at them for inspiration in designing an extremely legible television font. Thanks in advance.\n\n",
  "author": "vwcruisn",
  "time": "17 Jun 2003 — 11:06pm",
  "uid": "1938",
  "comments": [
    {
      "time": "18 Jun 2003 — 4:19am",
      "content": "ARD (german tv) uses luc de groots thesis and it works very well.   \n   \n [http://www.ard.de](http://web.archive.org/web/20150302160534/http:/www.ard.de/)\n\n"
    },
    {
      "time": "18 Jun 2003 — 4:28am",
      "content": "The ITC Tabula was originally designed for screen subtitles.   \n [http://www.typophile.com/forums/messages/30/3123.html?1025629182](http://web.archive.org/web/20150302160534/http:/www.typophile.com/forums/messages/30/3123.html?1025629182)   \nIf you prefer the bitmap way than the vector one, please don't use single pixel strokes or details, they can disapear: test directly on a standard TV screen.   \n   \nFor my part I'm waiting for Photoshop 8 who is supposed to dsupport round pixels for Pal/Ntsc format.\n\n"
    },
    {
      "time": "18 Jun 2003 — 7:47am",
      "content": "Huge x-height, loose letterspacing, darkish color, notable stroke contrast, open forms.   \n   \nFor bitmap fonts, look at Verdana Bold; for outline fonts check out Poppl-Laudatio Medium.   \n   \nAlso see Tiresias.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jun 2003 — 10:27am",
      "content": "Hrant, you keep saying Poppl-Laudation is good for the TV screen. I can see how it might work well. But surely the default spacing is too tight? Just wondering, do you have an example of it in use on TV?\n\n"
    },
    {
      "time": "18 Jun 2003 — 10:30am",
      "content": "Does Verdana really work so well 'antialised' on the TV? Is it even called antialising in TV terms? Do we even use 'bitmap' fonts on TV? (Well, not like teletext in the UK, which really still use really coarse original BBC bitmap fonts!)\n\n"
    },
    {
      "time": "18 Jun 2003 — 11:01am",
      "content": "You're right, Laudatio is too tight for smaller sizes, especially on-screen - you should track it looser. The great thing about it though is that it works well small or large: high legibility in the former, visual interest in the latter. And for large sizes you'd leave the spacing as-is. It's better to have a font that's too tight than too loose.   \n   \nAs for terminology, I don't see a problem using \"anti-aliased\" and \"bitmap\" for TV use - although the lower the fidelity the less relevant bitmaps are.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jun 2003 — 5:13pm",
      "content": "i agree with hrant's post that tiresias is a good face for broadcast legibility. though i disagree with the suggestion of poppl-laudatio medium. though both these faces have large x-heights which help with legibility in general. the later has a half serif detailing, which are hard to make out on screen. it is a good rule of thumb to not use serifed typography on screen unless at much larger sizes.\n\n"
    },
    {
      "time": "18 Jun 2003 — 5:29pm",
      "content": "I won't even call those things on Poppl-Laudatio 'half serifs'... they are simply flares. They are going to disappear at small sizes on the TV screen, for sure. The whole point of having these flares is to ensure the corners are sharp and not eaten away by phosphorous. They will show at large sizes though.   \n   \n\"it is a good rule of thumb to not use serifed typography on screen unless at much larger sizes\"   \n   \nThis is a myth. It can't be more untrue. Early captioning at BBC used a slab-serif, which improves letter definition by reinforcing corners, much like what I said about flare serifs, so the strokes don't break up.\n\n"
    },
    {
      "time": "18 Jun 2003 — 5:53pm",
      "content": "Yes, those are best called flare serifs, and the way they render out in low-fidelity (like at smaller sizes on TV) is pretty interesting: they seem to make things blurrier, but since the curved parts of letters are unavoidably blurry anyway, they end up making for a harmonious whole. Plus they can break the monotony (like in the word \"million\").   \n   \nAs for \"full\" serifs, I agree that it's a matter of using them carefully, not avoiding them.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jun 2003 — 10:44pm",
      "content": "i think myth is the wrong word. the fact that you lose serifs at a small size means you lose the initial integrity and styling of the face. the logic could be used that if you lose them, then why use them. the fact of the matter is that though older forms of typography may be beautiful in their original context they don't always translate well to new contexts (like broadcast). the common rule for broadcast legibility is; you should not use a serif for anything below 14pt.\n\n"
    },
    {
      "time": "18 Jun 2003 — 11:01pm",
      "content": "awesome.. thanks for the help everyone.. i picked up the fonts that were mentioned and I will begin my initial typeface next week\n\n"
    },
    {
      "time": "18 Jun 2003 — 11:03pm",
      "content": "\"the logic could be used that if you lose them, then why use them.\"   \n   \nI think you've mistaken. If there are no \"flares\", the actual stems would be eaten away, so you'll end up having sans-sanserif! The 'spikes' help maintain the integrity of the essential forms of the letters themselves. So what you'll end up is a razor sharp sanserif. Matthew Carter's Bell Centennial was designed like that to withstand the poor quality typesetting and printing of phone books. It's the same idea with actual serifed type, only that you won't lose the entire serif. So things would still be razor sharp. Of course, by serif I mean slab-serif, not delicate typefaces like Garamond or Baskerville.   \n   \nMy Arrival typeface has flares too because the same happens when you view type from great distances. That's why sign painters used to add 'flicks' at ends of their sanserif letterforms.\n\n"
    },
    {
      "time": "18 Jun 2003 — 11:10pm",
      "content": "kieth, i'm talking mostly about more delicate serifs (humanist, garalde or transitional). i agree with you on slab serif legibility. i also agree with you on the flare issue but one mans flair can be another mans serif.\n\n"
    },
    {
      "time": "25 Jul 2003 — 9:27am",
      "content": "\\> Is it even called antialising in TV terms?   \n   \nI did fonts for the original MS Web TV in Europe and the term for filters or anti-aliasing in TVs was commonly referred to as an 'anti-flicker filter'. In our set-top box there was a Windows CE based OS using anti-aliasing and an added filter to control 'white' which is technically illegal since it causes many problems. Ever notice on US TV a sports score in the corner with Black text on a white background. It will jump around and even sometimes make audible noise.   \n   \nother things about TVs are: single pixels and fine things get lost in the scan lines and the fuzz of the filters and screen. You need at least two pixels of anything, stems, counters and inter-character spacing for it to be represented correctly. This is also why text is usually large. The filters are there to keep the guns in the TV from going completely ON to completely OFF, this causes noise and jumping of the image. Also in the fonts I created 'ink traps' and used TrueType hinting to open up counters so that when the filters blurred everything up the counters wouldn't completely collapse. Same principle as Carter's Bell and older newspaper fonts where the ink would spread with the porous paper.\n\n"
    },
    {
      "time": "25 Jul 2003 — 10:54am",
      "content": "\\> 'anti-flicker filter'   \n   \nAre you sure that's the same thing? TV displays are interlaced (even/odd raster lines are displayed alternatively) and this causes very thin horizontal lines to flicker.   \n   \n\\> I created 'ink traps'   \n   \nCool.   \nAny close-ups available?   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jul 2003 — 3:14am",
      "content": "there was a simple picture and code for conditional hinting in the RIDT article I wrote for St. Malo in 1998. If I can find it I'll post it but this is my fifth or so computer since then so it isn't here.\n\n"
    },
    {
      "time": "26 Jul 2003 — 12:28pm",
      "content": "You mean this?   \n   \n ![connare.gif](http://web.archive.org/web/20150302160534im_/http:/www.typophile.com/forums/messages/4100/13354.gif)   \n   \nBTW, I thought there'd be on-line PDFs of the RIDT98 stuff, but their site seems mostly broken.   \n   \n--   \n   \nAnd there's the trapping in figure 6! Cool.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jul 2003 — 12:44pm",
      "content": "Hey, wait a second. Are you saying hinting can be used to vary trap size depending on point size? Can selective hints like that be applied for very large PPEMs, I mean for print, not screen? That would be huge, man.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jul 2003 — 9:03am",
      "content": "Anyone knows if Plasma tv screens works with pixels?   \n   \nM.\n\n"
    },
    {
      "time": "27 Jul 2003 — 11:02am",
      "content": "Vincent, this is starting to make me giddy...   \nDo you think TT hinting can take the place of the MM optical axis?   \n   \nDoes the TT engine have access to the output resolution being used (not just the PPEM)?   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jul 2003 — 1:57pm",
      "content": "Plasma screens are measured in Pixels.   \n   \nThere is no industry standard resolution however, the most I could find is that they vary from around 1365x768 to 852x480.   \n   \nIf you're designing for a specific model, the company would give you the specs I'm sure.\n\n"
    },
    {
      "time": "28 Jul 2003 — 2:20am",
      "content": "PPEM covers every output resolution.   \n(Pt size \\* resolution)/72 = PPEM   \n   \nThere are two instruction MPPEM[] and MPS[]   \nMeasure PPEM is better since you are dealing with the specific image. With Pt size the images will rary and the instruction isn't useful for conditional hinting.   \n   \nYou can't trust hinting to be used all the time. PostScript devices sometimes throw away hints.   \n   \nThe fonts I hinted for TV checked if they were in grey scale and then thickened up the stems to be two pixels, one black one grey, the grey on the left I believe since it was sharper on the TV, on the Right it was lighter.   \n   \nExtra points were added to the crotch of the A, K, V, W, Y and those points were pulled out at small sizes.   \n   \nI believe image of the V is in the RIDT98 document at the end.\n\n"
    },
    {
      "time": "29 Jul 2003 — 1:34pm",
      "content": "\\> you are dealing with the specific image   \n   \nYes, but an image that can appear 1 inch high or 3 inches high depending if the resolution is 3000 or 1000 dpi for example. So I guess what I'm really asking is if the TT engine has access to the point size being used. :-/ Dumb question, right?   \n   \n\\> You can't trust hinting to be used all the time. PostScript devices sometimes throw away hints.   \n   \nIs there any nice documentation on this? Like what kinds of hints get thrown away, and on what proportion/kinds of RIPs?   \n   \nPlus, even if the \"hint trapping\" gets thrown out, that just means your default outlines need to work well - like they could have small or large traps depending on the intended size usage, and hint towards larger/smaller traps if the hinting is enabled. That's still better than being stuck with one static outline set like we are now.   \n   \n\\> The fonts I hinted for TV   \n   \nVery interesting. Are these available for observation?   \n   \n--   \n   \nMy thing about an optical axis goes like this: instead of the user having to choose an optically correct version of the font, the TT hinting does it for him, by dynamically and automatically modifying everything: width (moderately hard), letterspacing (easy), trapping (not too hard), color (hard), maybe even vertical proprtions (very hard)!   \n   \nAm I the only one who thinks this is huge?   \n   \nhhp\n\n"
    },
    {
      "time": "3 Aug 2003 — 12:07pm",
      "content": "No hrant, it think its huge too ![:-)](http://web.archive.org/web/20150302160534im_/http:/www.typophile.com/forums/clipart/happy.gif) im waiting for more info, then ill start jumping up and down in my seat..\n\n"
    }
  ]
}
