{
  "id": "37262",
  "title": "My FontLab Shortcuts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello Typophiles.\n\nWe all have our own ways of working on the [fontlab](http://web.archive.org/web/20150323000459/http:/typophile.com/wiki/fontlab) and we all use lots of shortcuts as well. Some of them are universal but, there are some shortcuts which are not their in the list of \"Fontlab official shortcuts\" and we discover them while working.\n\nI would like you guys to share those secret shortcuts which you think others might don't know.\n\nJust one shortcut per Typophile would be enough.\n\n:)\n\nThank you so much,  \nSatya\n\n",
  "author": "satya",
  "time": "19 Sep 2007 — 7:27am",
  "uid": "14032",
  "comments": [
    {
      "time": "19 Sep 2007 — 7:38am",
      "content": "On a Mac keyboard in the character window: grave (next to z)= fill outline black z=enlarge x=decrease.\n\nThis would be better in the 'Build' section.\n\nNick Cooke\n\n"
    },
    {
      "time": "19 Sep 2007 — 8:00am",
      "content": "Here are mine,\n\nTo break a countour, without affecting anything.  \nPress Ctrl+Alt and hit the node you want to split.  \n--\n\nFor temporary Meter tool.  \nJust hold Ctrl+Alt+Shift  \n--\n\nA quick swap between all the open files.  \nCtrl+Tab  \n--\n\n"
    },
    {
      "time": "20 Sep 2007 — 1:00pm",
      "content": "Sigh. All shortcuts should be documented in the manual or in the 'help' section, or both.\n\nOne I use constantly is holding down + which changes the tool to a magnifier in the glyph window. Then dragging the mouse, button down, you can zoom in on one part of the character. If you let go of the + first, before the mouse button, the tool goes back to the arrow. If you let up the mouse first, then it stays on magnification. This is not documented anywhere.\n\nControl-0 restores the glyph to 'fit' in the window, when you want to look at the whole glyph.\n\n"
    },
    {
      "time": "20 Sep 2007 — 2:21am",
      "content": "I thought this thread would be helpful for a FontLab newbie like me. :(\n\n"
    },
    {
      "time": "20 Sep 2007 — 8:13am",
      "content": "Here are some I use a lot (I use the Mac version, so for Windows opt = alt; command = ctrl):\n\nDouble-click on a node to change it from smooth to sharp or sharp to smooth.\n\nHold down the shift key while moving anything with the arrow keys to move 10 em units at a time (you can change the amount in Preferences). This works in the metrics window, too, with kerning.\n\nRight-click on a \"neighbor\" to choose a different \"neighbor\".\n\nHit the 1, 3, 5, or 6 keys to switch to the arrow, knife, corner point, or curve point tools respectively. (There are others, too, but these I use most often.) Opt-4 selects the measurement tool. (I think I am going to change this.)\n\nSpeaking of changing short cuts (which you can easily do)... I often switch to 100% zoom in the glyph window, but I didn't like the short cut (command-5) so I changed it to command-1, which is the same as a lot of other programs I use.\n\nIt's been mentioned, but I also really like using the tilde key to get a quick preview of the glyph I'm working on.\n\nDouble-clicking on a glyph in the metrics or preview window will open the glyph window for that glyph.\n\nIf you've got a lot of windows open, the Fonts palette gives you a handy list of all windows in outline form, and you can jump to a specific window by double-clicking on it in the list.\n\nI think this is Mac-only: In the font window, you can command-click on the the little icon next to the window title to see the path to the current open font file as a pop-up menu. If you select one of the locations in the menu, it will appear in the Finder. (This works with most other programs, too, not just FontLab, but I use it fairly often in FontLab, usually after opening a font from the recent files listed in its File menu.)\n\n"
    },
    {
      "time": "20 Sep 2007 — 10:02am",
      "content": "I'm on a Mac to...\n\nCtrl-arrow (in Glyph window with a node selected): selects other node.  \nCommand-arrow (in Glyph window): moves selection 100 em units.  \nCommand (in Glyph window): switches between arrow (selection tool) and previous tool.\n\n"
    },
    {
      "time": "20 Sep 2007 — 12:30pm",
      "content": "Ben Kiel compiled a ton of shortcuts for Fontlab 4.x on the Mac ( [http://benkiel.com/typeDesign/](http://web.archive.org/web/20150323000459/http:/benkiel.com/typeDesign/ \"http://benkiel.com/typeDesign/\") at the bottom of the page). Some have changed with FLS 5, but most are still relevant.\n\n"
    }
  ]
}
