{
  "id": "37263",
  "title": "[CRITIQUE]: Too blasphemous for print?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "So I've been commissioned to do an ad for a local restaurant promoting their good-old Northern-Irish Sunday Lunch menu - the proprietor wants a quirky message which will entice the customer to dine in their place instead of opting to do it at home, hence the tagline.\n\nI'm trying to convey the idea that Sunday is indeed a day of rest, and they should let the business do the cooking for them, but I'm unsure whether it could be conveyed as blasphemous as it's bastardising the Bible.. kinda.\n\nAnyway I'd like your oppinions - note - this is NOT anywhere near the final design, rather just an initial concept.\n\n[http://img210.imageshack.us/img210/1773/picture2dh4.png](http://web.archive.org/web/20131014213746/http:/img210.imageshack.us/img210/1773/picture2dh4.png \"http://img210.imageshack.us/img210/1773/picture2dh4.png\")\n\nRegards,\n\nPaul\n\n",
  "author": "paul.w",
  "time": "19 Sep 2007 — 8:24am",
  "uid": "21493",
  "comments": [
    {
      "time": "19 Sep 2007 — 8:48am",
      "content": "\\>Colors are dull,  \n\\>Starting text right from the border makes reading harder.\n\n"
    },
    {
      "time": "19 Sep 2007 — 9:01am",
      "content": "The food image looks kinda orphaned at the bottom like that... perhaps bring the second line down into the space next to it (lower left), perhaps break it to 2 lines or make it smaller.\n\nIf you're worried about Biblical connotations, try something like \"You work hard all week -- let us work do the work on Sunday\"\n\nor\n\n\"On the seventh day, they rest-auranted\" (ooooh, that hurt as I typed it).\n\n"
    },
    {
      "time": "19 Sep 2007 — 9:13am",
      "content": "It'd have to be a pretty prudish puritanical neighbourhood for anybody to be offended.\n\nBut then again, people are so easily 'offended' these days.\n\nNick Cooke\n\n"
    },
    {
      "time": "19 Sep 2007 — 9:34am",
      "content": "blasphemous? does it matter? if it is, that just means more publicity. ;o)\n\nAs for critique...the type seems a bit crowded against the edges of the billboard. Maybe give it a bit of breathing room?\n\n"
    },
    {
      "time": "19 Sep 2007 — 1:28pm",
      "content": "One of two things will happen: People will like the concept, or people will be offended. If you believe more positive comments will arise in that neighbourhood, then take the risk. Personally, I like the message.\n\nAs for the design, there's a bit of spacing and size issues, but I like the color and type choice.\n\n"
    },
    {
      "time": "19 Sep 2007 — 4:16pm",
      "content": "It's purely conceptual - just something to show how useful the space could be to the client if it were utilised well enough. As I'm from Northern Ireland, both Protestants & Catholics hold their religion quite dearly, but it's not exactly poking fun at scripture, is it?\n\nI'm honestly at a loss to think of a better strapline concerning Sunday lunch - it fits the tone perfectly, and if I can convince my bosses (I'm currently on work experience) and both partners of the client business, I'll be pleased!\n\nI appreciate the input, Typophiles, always a pleasure!\n\n"
    },
    {
      "time": "19 Sep 2007 — 4:56pm",
      "content": "I'd like to find a setup like that to take a photo of. That would make great fontplay material.\n\nBtw, if there was a reason to be offended, more Christians would be better off using the opportunity to dialogue in a brotherly way, than getting into a finger-pointing, judgemental mode.\n\nPersonally about the only time I do go out to eat (except for taking customers to lunch) is after church on Sunday. My current favorite is Panera. The bread is so good I can't seem to wolf my sandwich down fast enough. Actually, it is too good. For at least another day I am thinking about how good it was, and am calculating how I can go back again.  \n; )\n\n"
    },
    {
      "time": "19 Sep 2007 — 5:36pm",
      "content": "I don't know about how Christians will react. But I do know that Hermann Zapf said: most commercial signs are too big. Your mock-up for sure blasphemes against Zapf.\n\nAlso this probably applies to only a few type freaks, but Helvetica makes me lose my appetite :)\n\n"
    },
    {
      "time": "19 Sep 2007 — 10:06pm",
      "content": "More white space around the edges and more blasphemy in the center; that's the ticket.\n\n"
    },
    {
      "time": "20 Sep 2007 — 3:29am",
      "content": "Heh, too many typophiles are losing sight of the topic at hand (perhaps removing 'critique' in the title might help this).\n\nThe signage design hasn't started, nevermind finished - it's purely an idea which I'm considering as I'm unable to think of a better strapline.\n\nThanks for the comments though as always, it's definately something I'll be discussing in my [University Blog](http://web.archive.org/web/20131014213746/http:/www.paulwilsdon.com/blog.html).\n\n"
    }
  ]
}
