{
  "id": "37290",
  "title": "FontStudio",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi there!\n\nJust curious.  \nNow I am working with FontLab and I like it.\n\nBut is there anyone outside there who loved FontStudio as I always did before?\n\nStefan\n\n",
  "author": "<a href=\"/web/20090523163235/http://typophile.com/user/19151\" title=\"View user profile.\">Stefan Seifert</a>",
  "time": "<br>",
  "uid": "19151",
  "comments": [
    {
      "time": " 20.Sep.2007 9.21am",
      "content": "As a font editor nothing can touch it. Even now FontLab still lacks much of it’s functionality and intuitiveness (imo). I wonder what kind of tool it would be now if it’s development had continued.\n\nMalcolm\n\n"
    },
    {
      "time": " 20.Sep.2007 9.41am",
      "content": "It would be a buggy tool full of memory leaks causing random crashes. It had a great UI and some nice features, but the actual code was... not the most stable or well-commented. That’s why Adobe didn’t just sell it off to somebody else when we acquired Ares (to whom the FontStudio rights had reverted).\n\nSeriously, if you liked FontStudio, you should spell out what exactly you liked about it and bug the FontLab folks to add that to FontLab Studio or Fontographer or something.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 20.Sep.2007 11.18am",
      "content": "I was a hardcore FontStudio user. However I think most of what made it special is now incorporated into FontLab Studio. The actual pen tool drawing interface in FLS could use a bit of the FontStudio touch, but the metrics editing that made FontStudio so powerful is available in spades in FontLab.\n\nJames\n\n"
    },
    {
      "time": " 21.Sep.2007 1.28am",
      "content": "I agree that some of the intuitiveness indeed I find in FontLab, too (otherwise I wouldn’t work with it).  \nAnd I am happy about it. Yes, FontStudio was very very intuitive and for some type of work as for example spontaneous experimental type designs I still am afraid of changing. FontLab is great for real text designs and added some great features!! But some little things still I find too complicated as for example cutting out entire curve segments. I find it a bit complicated to have to cut some points with that knife tool to do so, because otherwise he only cancels points instead of the whole segments. Painstaking thing when wanting to work very fast with copied segments. (Would be happy if someone teaches me right!) But nevertheless..\n\n\\>I wonder what kind of tool it would be now if it’s development had continued.\n\nI wonder, too, and most of all I always wondered about how anyone could to font designs with Fontographer in the past. Horrible program;-)\n\nSalute to all FontStudio lovers!  \nStefan\n\n"
    },
    {
      "time": " 21.Sep.2007 1.30am",
      "content": "\\>but the metrics editing that made FontStudio so powerful is available in spades in FontLab.\n\nYes, great the metrics window!! I control even my designs there more than in the glyph window ;-)\n\n"
    },
    {
      "time": " 21.Sep.2007 2.18am",
      "content": "\\>It would be a buggy tool full of memory leaks causing random crashes. It had a great UI and some nice features, but the actual code was... not the most stable or well-commented. That’s why Adobe didn’t just sell it off to somebody else when we acquired Ares (to whom the FontStudio rights had reverted).\n\nYes I remember the crashes (do a save everytime you make a change and keep a backup handy!) I would have to assume that these bugs would have been removed by now if development had continued. :-)\n\n\\>Seriously, if you liked FontStudio, you should spell out what exactly you liked about it and bug the FontLab folks to add that to FontLab Studio or Fontographer or something.\n\nThe great thing I found when working with FontStudio was to be able to drop a scanned image into a character cell knowing that the program had not distorted or rescaled the image. I have made the request to the FontLab developers for a more informative properties box for controlling imported images from way back to version 3. Still waiting.\n\n"
    },
    {
      "time": " 22.Sep.2007 11.29pm",
      "content": "And on the 8th day..created a G4 able to run with both OsX and Classic system..  \nso I did an entire font yesterday in 20 minutes (!!) in FontStudio and elaborate it in FontLab now  \n;-)\n\nStefan\n\n"
    },
    {
      "time": " 22.Sep.2007 11.29pm",
      "content": "PS  \nFontStudio still is a hammer!\n\n"
    }
  ]
}
