{
  "id": "37293",
  "title": "CV and Portfolio - for entry level designer",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey Guys & Girls, at the end of this year I will have finished my Bachelor of Design and will be looking for placement within an agency as an entry level designer.\n\nCV questions\n\nI have no previous full-time/part-time employment in the design industry should I put down freelance works I have done?\n\nShould I display my past employment if its not design relevant?\n\nPortfolio questions\n\nMy best work has always been done at university, so should I only use my university work or is it best to show some freelance work I’ve done so that they can see what I do for actual clients?\n\nShould I display a variety of work, or try and limit it to the scope of the agency I am applying for?\n\nAny advice would be really appreciated\n\nCheers\n\n [‹ Seeking decorative vectors](http://web.archive.org/web/20080105062552/http:/www.typophile.com/node/37296 \"Go to previous forum topic\") [[CRITIQUE]: Poster gift for a newborn child ›](http://web.archive.org/web/20080105062552/http:/www.typophile.com/node/37319 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080105062552/http://www.typophile.com/user/21733\" title=\"View user profile.\">Miguelzinho</a>",
  "time": "<br>",
  "uid": "21733",
  "comments": [
    {
      "time": " 20.Sep.2007 4.39am",
      "content": "I’m currently into my eighteenth week in placement, so I’ve had some experience in obtaining the position.\n\nMy advice is to include everything you’ve ever done to show advancement, and having your own URL (not university-provided space) is good to have onsite.\n\nI have a blog of my time so far [here](http://web.archive.org/web/20080105062552/http:/www.paulwilsdon.com/) if you want a heads up of what to expect(ish).\n\nEvery piece of freelance is good stock, but University work is also good to have (especially if your personal work is lacking in amount).\n\nAbove all, wear a suit to every interview - it’ll help make that essential first impression, and show how serious & dedicated you are to your craft.\n\nBest of luck!\n\nPaul\n\n"
    },
    {
      "time": " 20.Sep.2007 4.56am",
      "content": "“Above all, wear a suit to every interview - it’ll help make that essential first impression, and show how serious & dedicated you are to your craft.”\n\nYou are being sarcastic now? Right?\n\n"
    },
    {
      "time": " 20.Sep.2007 5.15am",
      "content": "\\> You are being sarcastic now? Right?\n\nOF COURSE I WAS.\n\nOh wait. I was being sarcastic there now.\n\n"
    },
    {
      "time": " 20.Sep.2007 5.15am",
      "content": "— Double post —\n\n"
    },
    {
      "time": " 20.Sep.2007 5.34am",
      "content": "Right, cheers mate. Please I need lots of opinions so don’t be shy...\n\n"
    },
    {
      "time": " 20.Sep.2007 6.30am",
      "content": "“Should I display my past employment if its not design relevant?”\n\nI wouldn’t list “flipped burgers for a semester at BK” but if the job is interesting, absolutely. Work experience is work experience. And definitely list your freelance works/talents.\n\n“Above all, wear a suit to every interview”\n\nI don’t know if I’d agree with that. Scout out the firm first. If the principals are wearing t-shirts and flip-flops, a suit might be a bit overkill. Design firm dress code can run the gamut.\n\n"
    },
    {
      "time": " 20.Sep.2007 6.32am",
      "content": "So double negatives... lets see: You would advise to dress in a suit for an interview in a design agency for the position of junior designer? That would really <cite>show how serious &amp; dedicated you are to your craft</cite> - as an undertaker, accountant or TV news anchor yes, but junior designer no. In fact I don’t think I have ever seen a junior designer in a suit.\n\n"
    },
    {
      "time": " 20.Sep.2007 6.48am",
      "content": "If you have past employment that is not directly design-related, but you learned or demonstrated transferable skills, I would include it: No need to detail your job duties, but do talk about the skills you used to perform the duties.\n\nSo, for example, I worked for a few years as a sales person in a dressmaking supply shop. It was far from the work I do producing publications, but I was using and developing problem solving skills in a way which does relate to design — finding a solution within the customer’s budget and which would complement the look of whatever they were making/repairing/sewing.\n\nSkills are transferable. For example, timeliness, attention to detail, accuracy... You can list the skills a particular position required of you.\n\nAlso, any accomplishments — like improving a work process or signage or reorganizing something, increasing sales, developing a loyal clientele ... in other words, a contribution other than your basic duties.\n\nGood luck!\n\n"
    },
    {
      "time": " 20.Sep.2007 7.11am",
      "content": "I’m going on the advice of a friend of mine, creative director of [OutsideLine](http://web.archive.org/web/20080105062552/http:/www.outsideline.co.uk/), a very highly respected agency in the UK. I got successfully placed with a fantastic studio, and I’m simply relaying how I managed it.\n\nAbove all, a suit asserts sensibility, style and a commitment which a hoodie & pair of trainers cannot.\n\nLet us know how you get on Miguel!\n\n"
    },
    {
      "time": " 20.Sep.2007 7.25am",
      "content": "If you have just finished your university degree, most employers are not going to be expecting a long list of fabulous jobs. I’d advise summarizing your work experience briefly, as it’s not design-related. You do want to show you’ve had some work experience but you don’t need to go into overkill explaining how skillfully you stocked those grocery shelves. In general I think descriptions of your jobs should be brief and to the point.\n\nYes, show both your school work and your completed jobs. Again, nobody is expecting you to have designed the iPhone interface.\n\nBut please please avoid the common student mistake of too many words on the CV. I can’t stand lengthy “objectives” (your objective is to get a f\\*\\*king job, innit?). Someone on this site posted a 6 page CV for critique where we had to page thru 5 pages of words words words before we even got to the actual resume. Something elegant and concise is vastly preferable. It should fit on a page. I have 20+ years work experience and my resume fits on a page.\n\nAs to wearing a suit? Seems a little much to me, but don’t show up in jeans either. Black or grey pants, a simple button down (no tie) and a jacket should do the trick.\n\n"
    },
    {
      "time": " 20.Sep.2007 9.26am",
      "content": "Miguel, I second what Kristina has said.\n\nAs for the portfolio, show only your best work — do not put anything in there that you will be apologizing for. It’s better to have 3 or 4 very good samples than 8 or 10 that vary in quality or execution.\n\nAlso, do your homework about the firms you will be applying to, and if possible, tailor the contents of your portfolio to a particular studio’s work.\n\n(And if you can get it, I recommend the book [_How to be a graphic designer without losing your soul_](http://web.archive.org/web/20080105062552/http:/www.amazon.com/Graphic-Designer-Without-Losing-Your/dp/1568985592/ref=pd_lpo_k2_dp_k2a_2_txt/102-9738191-2107322?pf_rd_m=ATVPDKIKX0DER&pf_rd_s=lpo-top-stripe-2&pf_rd_r=1RR799MZJ7X2QNPPYXVZ&pf_rd_t=201&pf_rd_p=304485601&pf_rd_i=B000SKUI6S) — it has plenty of good pointers for job hunters.\n\nGood luck!\n\n"
    },
    {
      "time": " 20.Sep.2007 4.07pm",
      "content": "Massive, Thanks guys. I’ll take your advice, Ill post you my CV soon for typographic crit\n\n"
    },
    {
      "time": " 20.Sep.2007 10.02pm",
      "content": "Posted my CV here : [http://typophile.com/node/37327](http://web.archive.org/web/20080105062552/http:/typophile.com/node/37327 \"http://typophile.com/node/37327\")\n\n"
    },
    {
      "time": " 21.Sep.2007 6.09am",
      "content": "someone once told me if you’re wondering what to wear for an interview, just call the receptionist - who sees everyone coming in - and ask them!\n\n"
    },
    {
      "time": " 21.Sep.2007 10.23am",
      "content": "\\> Above all, wear a suit to every interview\n\nMy rule is to always go a step above what the office is. If it is t-s and torn jeans, then a tie is overkill. But if it is dress shirts and slacks, then throw on a tie. And if they have on a tie, go up to a full suit. (The rule breaks down here ... if they are in suits, a tux is a bit too much).\n\nJust don’t scope out the place on a Friday to see what the normal dress is ... many places dress down that day.\n\n"
    },
    {
      "time": " 21.Sep.2007 10.25am",
      "content": "\\> I wouldn’t list “flipped burgers for a semester at BK”\n\nI would, if ther is absolutely no other work experience. It tells at least that you were able to get to work on time, work with others, and haven’t been living off Daddy’s largesse all your life. It doesn’t mean much, and I would drop it as soon as you get relevent experience, but it does mean something.\n\n"
    }
  ]
}
