{
  "id": "37300",
  "title": "Sigmaker 3 issues...what am I doing wrong?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’ve already put in a help ticket, but essentially I am trying to turn our logo into a single glyph for automation purposes on our magazine’s InDesign templates.\n\nI’ve saved the logo in every different format I can imagine and it just looks bizarre. The logo is a word mark that uses one case of Univers and a simple geometric shape. But no matter how I save it when I open it in Sig Maker the letters look like the outline is jacked up - like when you set Flash to trace something and set it to be way too smooth - you know how the letters have parts that are missing and they look all weird and triangular? Not pixelated, just distorted?\n\nWhat am I doing wrong? I’ve got the full-blown version and just installed it yesterday and reinstalled it. I test drove other files using different fonts and they all look the same.\n\n [‹ AskTypophile: Best practices for a dissertation?](http://web.archive.org/web/20080907002235/http:/www.typophile.com/node/37141 \"Go to previous forum topic\") [newbie question: FontCreator via VOLT to .otf ›](http://web.archive.org/web/20080907002235/http:/www.typophile.com/node/37103 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907002235/http://www.typophile.com/user/13881\" title=\"View user profile.\">vectorgirl</a>",
  "time": "<br>",
  "uid": "13881",
  "comments": [
    {
      "time": " 20.Sep.2007 3.12pm",
      "content": "I tried even just straight up drawing simple shapes and then trying to “open” image and it seems to read circles and squares ok, but anything drawn with the pen tool, even with no curves, seems to throw it off. It’s like it’s trying to hyper-smooth everything, and I can’t find a setting to turn it off.\n\n"
    },
    {
      "time": " 22.Sep.2007 1.31am",
      "content": "You may try to change size of the logo. SigMaker automatically calculates tracing parameters using source image size as source of information.\n\n"
    }
  ]
}
