{
  "id": "37315",
  "title": "Native languages are dying out",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[National Geographic News:](http://web.archive.org/web/20110501102837/http:/news.nationalgeographic.com/news/2007/09/070918-languages-extinct.html)\n\n\"Languages are undergoing a global extinction crisis\"\n\n",
  "author": "<a href=\"/web/20110501102837/http://www.typophile.com/user/8867\" title=\"View user profile.\">david hamuel</a>",
  "time": "<br>",
  "uid": "8867",
  "comments": [
    {
      "time": "",
      "content": "I going to hop on the unpopular soapbox and say <cite>good</cite>. That old languages die off and are replaced by new ones is a sign that everything is continuing as normal, the expanded pace means that people will be able to communicate more easily across cultures, share ideas faster, and those things will allow the scientific advances of the Twenty-first century to outclass all that has come before in ways that we will likely find mindblowing at times.\n\nTo quote Octavia Butler, “God is change.” To try and stand in the way of such an inevitable, ineffable, and damn-near omnipotent force is no more sensible than to deny the most basic laws of science.\n\n"
    },
    {
      "time": "",
      "content": "here in wales they passed a welsh language act meaning everything gotta be in English and welsh and companies need a certain percentage of welsh speakers. design wise its a pain in the arse getting a circumflex w and y.\n\n"
    },
    {
      "time": "",
      "content": "\\> people will be able to communicate more easily across cultures\n\nCertainly so true today… :)\n\npbc\n\n"
    },
    {
      "time": "",
      "content": "\\> old languages die off and are replaced by new ones\n\nI didn’t read the article but I’d guess that old languages aren’t replaced but just vanish.\n\nLanguage = culture. Less languages = less culture.  \npeople will be able to communicate more easily across cultures = good  \nLoosing variety of cultures = bad\n\n"
    },
    {
      "time": "",
      "content": "I remember an old piece in The Sciences. The numbers then were going from something like 9,000 languages down to 600. At that time they were having to decide which ones would be preserved and documented.\n\nI'm not a moralist so I won't say it is good or bad. Aesthetically I'm not so interested in a future where everyone is fat, uneducated and speaks English.\n\n"
    },
    {
      "time": "",
      "content": "There is far more at stake than just losing native languages. Words are often the gateway to thought, and diversity of language often allows for expanded collective consciousness.\n\nConsider how the English language itself is eroding and average vocabulary diminishing. The current operative mode is _reduction_, using fewer words in simplistic structure to convey broader meaning, often leading to ambiguity, not clarity.\n\nIt's not that _many_ languages are good, but that some languages (some verbal, some written) offer lexicons that inherently carry perceptions not found in any other language. The need to create words is based on the need to express ideas, emotions, descriptions or phenomena.\n\nWhen a culture becomes dominant over another, one of the most common actions historically is to ban the language. Not because the intent is to harmonize and improve communication, but chiefly to strip ideology and culture from a people. This would not have historically happened if it wasn't for the inherent power of a people's language.\n\nTo be clear -- I am not in favor of many languages just for pure numbers, but I am in favor of diversity of thought and expression.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Language = culture. Less languages = less culture.</cite>\n\nCulture is not be dependent on language. Malevich and the thousands of artist he inspired figured that out ages ago. Having fewer languages to speak will not prevent the creative minds of the world from contributing to their respective cultures. But it will make it easier for them to be understood by others, at least when the work is rooted in language to begin with.\n\n<cite>Consider how the English language itself is eroding and average vocabulary diminishing.</cite>\n\nEroding? Dictionaries still add many new words every year—mcjob (noun) and google (verb) are great examples that have even lead to legal action. Vocabularies are not diminishing, they are changing. Readers in Milton’s time probably had as much trouble with Chaucer as readers now do Milton or Chaucer, and so on. This is not because vocabularies have diminished, it is because civilization has changed and language has changed to reflect that.\n\n<cite>Loosing variety of cultures = bad</cite>  \n<cite>I am in favor of diversity of thought and expression.</cite>\n\nDiversity and variety are not spices that can just be tossed around to enliven and enlighten. If they can not remain relevant on their own, they are of little use to almost everyone. I do agree that diverse ideas are important, but not that said ideas are dependent on language or culture. There will still be an unending supply of new ideas, no matter how few languages we have.\n\n"
    },
    {
      "time": "",
      "content": "_It’s not that_ many _languages are good, but that some languages (some verbal, some written) offer lexicons that inherently carry perceptions not found in any other language._\n\nWell put, Norbert -- couldn't agree with you more. And as a speaker of two languages, I believe that certain languages lend themselves to certain thought structures better than others. Variety is the spice of life, as they say -- it's a shame when languages, and therefore cultures, die a lonely death.\n\nBy the way, there is a book called [_Spoken Here_](http://web.archive.org/web/20110501102837/http:/www.amazon.com/Spoken-Here-Travels-Threatened-Languages/dp/0618565833/ref=pd_bbs_sr_1/103-2191335-9013416?ie=UTF8&s=books&qid=1190344772&sr=1-1), published a few years ago, that covers this topic.\n\n"
    },
    {
      "time": "",
      "content": "The Welsh philosopher Rush Rhees referred to languages as 'records of ways of living that have meant something'. Languages come out of meaning, out of the significance that people have found worth giving name and structure, and when they die we lose the record of that meaning. Sometimes, it seems there is a temptation to thrust language loss into a kind of crude dialectic, in which the cultural loss is set against the positive material gains associated with speaking major regional and trade languages instead of minority local languages. This seems to me very unfortunate, because we should be able to appreciate those positive gains while also understanding the nature of the loss. There seems very little that can be done to prevent the death of most languages. A few, like Welsh might struggle back from the brink on account of particular regional legislative advantages; certainly, a lot more Welsh seems to be spoken in Wales today than was when I was growing up there. There are indications that local effort can preserve and renew languages when people care sufficiently about their heritage, as seems to be happening with Cornish. And there is always the spectacular example of modern Hebrew: the resurrection and reformation of a language that had no native speakers for the better part of two thousand years.\n\nBut for thousands of languages that will pass out of existence, there is little anyone can do but try to make some record of them, which is the job of linguists, and to bear witness to their loss, which is the job of poets:\n\n**The Last Man to Speak Ubykh**  \nby John Burnside\n\n_The linguist Ole Stig Andersen was keen to seek out the remaining traces of a West Caucasian language called Ubykh. Having heard that there was one remaining speaker he set out to find the man and arrived at his village on 8 October 1992. The man had died a few hours earlier._\n\nAt times, in those last few months,  \nhe would think of a word  \nand he had to remember the tree, or species of frog,\n\nthe sound denoted:  \nthe tree itself, or the frog, or the state of mind  \nand not the equivalent word in another language,\n\nthe speech that had taken his sons  \nand the mountain light;  \nthe graves he swept and raked; the wedding songs.\n\nWhile years of silence gathered in the heat,  \nhe stood in his yard and whispered the name of a bird  \nin his mother tongue,\n\nwhile memories of snow and market days,  \nhis father’s hands, the smell of tamarind,  \ninklings of milk and blood on a sunlit floor\n\nreceded in the names no longer used:  \nthe blue of childhood folded like a sheet  \nand tucked away.\n\nNothing he said was remembered; nothing he did  \nwas fact or legend  \nin the village square,\n\nyet later they would memorise the word  \nhe spoke that morning, just before he died;  \nthe word for death, perhaps, or meadow grass,\n\nor swimming to the surface of his mind,  \nthat other word they used, when he was young,  \nfor all they knew that nobody remembered.\n\n"
    },
    {
      "time": "",
      "content": "James Puckett's \"unpopular soap box\" is more popular than he imagines. It's an honest opinion, held without malice by millions of good people around the world. As a linguist, I want to explain why I hold a different opinion.\n\nWhen languages die, and especially when they die having never been described in any detail, linguists feel a real sense of irretrievable loss. We care so much because our understanding of language is limited to the languages we can study, and it never fails that when new languages are studied, noteworthy observations emerge. Some languages are so different from what we are used to that they violate some of our most basic linguistic or cognitive hypotheses. Indigenous languages are often this way.\n\nThe language faculty is one of the defining attributes of our species. A language is the product of complex cognition and social interaction over the course of long periods of time. Virtually every member of society contributes. When a language is lost, along with it are lost the unique system of mechanisms that made it function, mechanisms that hold important clues to who we are, how we are \"wired\", and what our cognitive limits are; mechanisms that were centuries, even millenia, in the making. You can't reproduce these things in a lab. It's true that language will continue to evolve, and perhaps similar linguistic systems will reappear at some point in the future. But even in the unlikely even that such a time comes, you and I and untold future generations will have already passed on.\n\nWhat is alarming about current trends in language endangerment is not the fact that it happens but the rate at which languages are disappearing. It's true that throughout history languages have died out (as, for example, Etruscan), but most languages have just evolved into other languages (as, for example, Latin, which survives today as French, Italian, Spanish, Portuguese, Romanian, and others). Until recent times it hasn't been the case that such a large percentage of the world's languages were destined to be superceded--by a handful of replacement languages which, in large part, happen to be related to each other. In many parts of the world, the past few decades have seen a political climate change toward social justice for indigenous groups (a very recent example is a declaration on indigenous rights passed last week by the United Nations). But these conciliatory actions are rarely able to repair the damage of decades or centuries of linguistic repression. You can't bludgeon someone to the point of death, then apologize and expect them to recover.\n\nThe price we pay for our predecessors' shortsightedness is the loss of some of the most beautiful things mankind ever produced, and along with them, the lost chance for a much more complete understanding of one of our most human dimensions.\n\nThe least we can do is mourn the loss.\n\n"
    },
    {
      "time": "",
      "content": "This is for Mr. Puckett.\n\n\"Don't you see that the whole aim of Newspeak is to narrow the range of thought?… Has it ever occurred to your, Winston, that by the year 2050, at the very latest, not a single human being will be alive who could understand such a conversation as we are having now?…The whole climate of thought will be different. In fact, there will be no thought, as we understand it now. Orthodoxy means not thinking—not needing to think. Orthodoxy is unconsciousness.\" —Syme, pp 46-47, from 1984 by George Orwell.\n\n"
    },
    {
      "time": "",
      "content": "It's hard for me to understand where you're coming from James, a spiritual desire to deconstruct the Tower of Babel, a philosophical agenda to make order in the world, or perhaps something else.\n\nIs it possible to explain a little further?\n\nLanguages are indeed malleable.\n\n\"Things were better before\".\n\npbc\n\n"
    },
    {
      "time": "",
      "content": "Kris... thanks for that quote from _1984_.\n\n"
    },
    {
      "time": "",
      "content": "<cite>...a spiritual desire to deconstruct the Tower of Babel...</cite>\n\nAfter a fashion. While there is a tremendous promise in the individual mind, some of which is doubtlessly lost as languages wither, I see greater promise in the rapid communication offered by a world with fewer barriers to it. I once heard an anecdote about an old Frank Herbert story concerning a group of astronauts who were packed into a special craft in which they were to travel to the end of space and turn on a machine. Upon arriving at the end of space the astronauts activated the machine, it turned out to be a self aware super computer, carrying with it the entirety of human knowledge. With an ability to rapidly process said knowledge in parallel, the computer near-immediately elevated to godhood.\n\nI see mankind as living on the edge of something similar. Nanotechnology is a reality, genetic engineering is a reality, fusion research is making (slow) progress, and access to and sharing of information now exist on an awesome scale. The developments laying before us are going to reshape human existence in ways we cannot begin to fathom. Humans are on the path to an amazing future, with billions of new years of evolutions in front of us. In some short span most of what got us to that point will likely be irrelevant, superseded, and made to appear hopelessly tiny and homogeneous in the face of whatever appears next.\n\nTo me that promise smells like a big tasty omelette. If some cultural eggs must be cracked to get it, I say go for it. Weep for them if you must, but realize that standing in the way of change is standing in the path of a tornado.\n\n"
    },
    {
      "time": "",
      "content": "_Humans are on the path to an amazing future, with billions of new years of evolutions in front of us._\n\nMaybe. But not if we destroy ourselves, and the conditions for life on this planet. Billions of years? I seriously doubt it. In a way, I envy your optimism.\n\n_Nanotechnology is a reality, genetic engineering is a reality..._\n\nThese realities, as you call them, are in their infancy. And with these scary technologies comes great responsibility, which I doubt humanity can handle. See above.\n\n_Upon arriving at the end of space the astronauts activated the machine, it turned out to be a self aware super computer, carrying with it the entirety of human knowledge._\n\nI bet it was all in English.\n\n"
    },
    {
      "time": "",
      "content": "\"These realities, (g.e. and nanotech), as you call them, are in their infancy.\"  \nWell, not all of them. The genetic engineering of Maize e.g. happened in languages that have since disappeared so we don't understand it anymore, but it's hardly in its infancy no matter what monsanto says. :-o\n\n\"...most languages have just evolved into other languages (as, for example, Latin...\" I think this is not true. Some die and leave a few words and others feed into another, but most of the languages no longer spoken here did in fact die without a trace, either written or spoken.\n\nAnd then there is the fact that Khipu couldn't be much more dead but you can still find over 100,000 link's to the Inkas.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "James.\n\nYou’ve watched way too much Star Trek.\n\nAnd Malewich should be understood in his (long gone) historical context, I think.\n\n"
    },
    {
      "time": "",
      "content": "_The genetic engineering of Maize e.g. happened in languages that have since disappeared so we don’t understand it anymore, but it’s hardly in its infancy no matter what monsanto says._\n\nGood point, David. I guess I was thinking more in terms of humans genetically modifying, or creating genetically engineered, humans -- that one is still certainly in its early stages, barring any secret experiments now taking place in an underground lab somewhere.\n\n"
    },
    {
      "time": "",
      "content": "_Weep for them if you must_\n\n\"Engineered\" by communities in a way that linguists, working to construct artificial languages, would find impossible, those languages arose over millennia in unique social circumstances that can never be fully understood or duplicated. That program would be impossible to run. If not for any intrinsic valuable, they are human resources that hold value for the future--in the way that species of plants which are becoming extinct may contain medicinal value. New languages take a long time to create, and those evolving in a connected world are unlikely to have as much special value as the languages being lost.\n\nSure, we have an ever-expanding vocabulary, but that's not the same thing as language.\n\nOf course, it is not possible to preserve all the past. As with buildings, new uses must be found to keep them alive.\n\nYes, diverse peoples can communicate with shared language, but it's also important for diversity to be able to tell your own stories in your own language, or else we become Borg. \"When I went to school in Olympia...\n\n"
    },
    {
      "time": "",
      "content": "James: _To me that promise smells like a big tasty omelette. If some cultural eggs must be cracked to get it, I say go for it. Weep for them if you must, but realize that standing in the way of change is standing in the path of a tornado._\n\n\"A Klee painting named ‘Angelus Novus’ shows an angel looking as though he is about to move away from something he is fixedly contemplating. His eyes are staring, his mouth is open, his wings are spread. This is how one pictures the angel of history. His face is turned toward the past. Where we perceive a chain of events, he sees one single catastrophe which keeps piling wreckage and hurls it in front of his feet. The angel would like to stay, awaken the dead, and make whole what has been smashed. But a storm is blowing in from Paradise; it has got caught in his wings with such a violence that the angel can no longer close them. The storm irresistibly propels him into the future to which his back is turned, while the pile of debris before him grows skyward. This storm is what we call progress.\" -- Walter Benjamin\n\n"
    },
    {
      "time": "",
      "content": "Nick: _New languages take a long time to create, and those evolving in a connected world are unlikely to have as much special value as the languages being lost._\n\nActually, new languages don't take very long to create in the right environment, which is usually one in which people from different linguistic groups are thrown together by material necessity and have to find a way to communicate. If there is already a dominant regional or trade language, they will usually adopt that, but may bring to it vocabulary from their own language. But more remarkable is the phenomenon by which a pidgin, i.e. a crude collection of mutually understood words from different languages with minimal grammar, becomes a creole, i.e. a fully functional, grammatically sophisticated language, within a single generation of native speakers. It is generally thought that this process occurs when the children of speakers of a pidgin start to speak to each other: they instinctively develop a grammatical structure. Which is pretty remarkable when you think about it.\n\nWhat does take a long time is for a language to develop a richness of expression: the ability to say something in multiple ways with different nuances, or to say one thing and to suggest multiple meanings.\n\n"
    },
    {
      "time": "",
      "content": "If the idea is for everyone to end up speaking English, we're in deep doo-doo. For evidence of same, you need look no further than a brief review of _Buttering Turnips, Twocking Chavs_, which appeared in the Times Literary Supplement a month or so ago.\n\nAmong the many vagaries of English, the book in question points out several words in English which have contradictory meanings, e.g.,...\n\n- when you say **cleave** , do you mean \"stick together\" or \"break apart\"?\n- when you say **clip** , do you mean \"cut\" or \"fasten\"?\n- when you say **fast** , do you mean \"fixed\" or \"moving\"?\n- when you say **left** , do you mean \"gone\" or \"remaining\"?\n- when you say **sanction** , do you mean \"approve\" or \"ban\"?\n- when you say **screen** , you you mean \"show\" or \"conceal\"?\n- when you say **weather** , do you mean \"withstand\" or \"wear away\"?\n\nNuance is one thing; confusion is quite another. Before we embark on a campaign of linguistic imperialism, we need to get our own house in order first...\n\n"
    },
    {
      "time": "",
      "content": "<cite>If the idea is for everyone to end up speaking English, we’re in deep doo-doo.</cite>\n\nI doubt it would ever come to that. I am sure that there will be some point where almost everyone speaks one common language, and plenty of local languages abound, but there are just too many people in too many places for one language to take over _and_ wipe out the others.\n\nAnd for the record, if we do all end up speaking one language, I would hope people would pick one that makes sense and avoid English.\n\n"
    },
    {
      "time": "",
      "content": "Better start studying Chinese then. That should make for a nice Open Type project.\n\npbc\n\n"
    },
    {
      "time": "",
      "content": "<cite>most of the languages no longer spoken here did in fact die without a trace, either written or spoken.<cite></cite></cite>\n\nI suppose it's impossible to quantify dead languages, especially ones we are totally unaware of. When you start to say that Latin is a \"language no longer spoken here\" but that, for example, 15th century English is a \"language still spoken here,\" you begin to draw boundaries that make such numbers lose all meaning anyway.\n\nThe more relevant point for this discussion is that the 21st century will witness language death on an unprecedented scale. The Summer Institute of Linguistics' Ethnologue estimates that there were about 6900 living languages as of 2005 (during the 1990's Michael Krauss stated the number as roughly 6000, plus or minus maybe 10% depending on how you distinguish \"languages\" from \"dialects\"). The UNESCO Ad Hoc Expert Group on Endangered Languages in 2003 provided the following statistics:\n\n\\* about 97% of the world's population speak about 4% of the world's languages  \n\\* about 3% of the world's population speak about 96% of the world's languages  \n\\* at least 50% of the world's languages are losing speakers  \n\\* by their estimate, 90% of the world's languages may be replaced by dominant languages by the end of the 21st century.\n\n(See [http://portal.unesco.org/culture/en/ev.php-URL\\_ID=9105&URL\\_DO=DO\\_TOPIC&U...](http://web.archive.org/web/20110501102837/http:/portal.unesco.org/culture/en/ev.php-URL_ID=9105&URL_DO=DO_TOPIC&URL_SECTION=201.html \"http://portal.unesco.org/culture/en/ev.php-URL\\_ID=9105&URL\\_DO=DO\\_TOPIC&URL\\_SECTION=201.html\"))\n\nI'll admit I'm dubious about that last estimate; surely it's a near worst-case scenario--although you can imagine that the best realistic case will still be quite grim. It's also true that, as John mentioned, new languages (specifically, creoles) can crop up relatively quickly due to contact phenomena; and it's also likely that today's dominant languages will continue to evolve and eventually diversify into varieties so different that we would classify them as separate languages. These languages which do not yet exist will also give us valuable insights. But (and I don't mean to suggest that John or anyone else suggests otherwise) they are highly unlikely to represent the full range of typological features (the grammatical and phonetic attributes we use for structural [as opposed to historical] comparison and classification of languages) which will be lost as today's endangered languages disappear.\n\n"
    },
    {
      "time": "",
      "content": "Today's _New York Times_ expands on the National Geographic post:\n\n[Vigil for the Vanishing Tongue](http://web.archive.org/web/20110501102837/http:/www.nytimes.com/2007/09/23/weekinreview/23word.html?_r=1&ref=weekinreview&oref=slogin)\n\n"
    },
    {
      "time": "",
      "content": "I think it's a slight bit of travesty in the least that we're losing languages at such an alarming rate. But to be honest, it's not that unbelievable.I also disagree with the motion that the death of a language won't mean the death of a culture, or part of it. For a lot of these smaller languages, everything is an oral tradition. Who is going to translate that and pass it on, and in a new language that will certainly not capture the details as well.\n\nGrowing up in the DRC, I spoke a tribal dialect, it's roots are in a larger language, so it will probably not die out too fast, but in the Congo alone there were more than 250 tribal languages. I spoke briefly with a masters student that was studying tribal dialects in the sub Sahara at Harvard and she'd never heard of the dialect however.\n\nI also spent a month working in the Bolivian highlands where Spanish is the 3rd language in the pecking order. It's interesting, because the older generations are not interested in learning Spanish, and there's a lot of lingering resentment that as festered for generations towards Spanish and everything that came with it. However, their kids, and the kids themselves see Spanish as a way for them to get jobs and move of of the small villages in the mountains. It creates a language gap where Quechua and Aymara, even as the competing official languages, will be weeded out in the outskirts… all for the sake of progress, and tradition will lose out.\n\nWorking in Canada's North right now, there's a real sense of traditional values and languages, and the clash with the modern living styles and English. Illiteracy is very high here, and even working on documents for native governments, English is the first language, and then the native languages, and not everything will be translated over. So even if you can read your own tongue, you won't be able to read the entire document.\n\nMy wife is Metis and grew up speaking French and English, and as trilingual speaker now, she still has trouble finding the right English words at times. I have the same problem coming back to Canada from the Congo – English is not as wonderful and expressive as people would like to make it out to be. Sure it has a lot of words, but it doesn't mean you're saying a lot.\n\nDictionaries are subject to those that edit them and the beginning of the Webster dictionary is a great example of aiming to push 'simple english', as some would call it, with the eventual inclusion on words like \"ain't\". I hardly see them as the definitive rule of language to which we should hold standards to.\n\n"
    },
    {
      "time": "",
      "content": "It's been a few years since I read up on this topic. But I seem to recall a demonstrable connection between linguistic diversity (that is, indeed, cultural diversity) and biological diversity (biodiversity). In other words: modern, western, scientific systems for categorizing (describing, classifying, labelling) natural phenomena are essentially reductive, with profound (and yes, dire) extra-linguistic (and extra-human) consequences. Or so the argument - a good one, as far as I can recall - goes. Like all utopias, the fantasy world of pure communication envisioned by James Puckett is, I fear, one that would be purchased at too high a price - biologically, culturally, psychologically, &c.\n\nI couldn't agree more with the comments above regarding \"linguistic imperialism\" and the myriad varieties of English experience. Only, in my opinion, puns, metaphors, and other tokens of linguistic ambiguity are to be cherished, nourished, preserved for their own sake, but also because of the reasons hinted at in the preceding paragraph. I gather that Puckett, on the contrary, would - sooner or later - have us burn our Joyce and our Pynchon, ad infinitum. And read & write exclusively Esperanto.\n\nNow, what would the design equivalent of that be?\n\n"
    },
    {
      "time": "",
      "content": "^that's a good point.\n\nBringing Change into the discussion makes a mess of it. Preserving language can be viewed as changing the natural course of things.\n\nClearly we have an anthropocentric bias, save a few misanthropes that would argue that the elimination of the species would be a welcom change.\n\nIf a group in South America knows the forrest and what plants are worth looking at we might do well to record what they know, which would probably involve learning their language.\n\n"
    },
    {
      "time": "",
      "content": "_Now, what would the design equivalent of that be?_\n\nHelvetica everywhere you turn? ;-D\n\n"
    },
    {
      "time": "",
      "content": "We are getting there Ricardo. Stephen Banham of the Letterbox in Australia did some research on that in the central business district and the numbers are shocking: Over 50% of the typefaces used on signage and logos were Helvetica (That's besides all the arial instances;-)\n\n"
    },
    {
      "time": "",
      "content": "<cite>I gather that Puckett, on the contrary, would - sooner or later - have us burn our Joyce and our Pynchon, ad infinitum. And read &amp; write exclusively Esperanto.</cite>\n\nI never wrote anything _remotely_ of that sort. I stated that I believe scientific progress is likely to be sped up by a world with fewer communication barriers, to the benefit of all people. I never stated that anyone should be forced to stop speaking anything, or that a monoglot civilization is a utopia to strive for.\n\nTo reiterate my previous point: change is good, change is normal, and the death of languages is a good sign that things are proceeding along exactly as they have been and should be. That we may reap some extra benefits from this is an especially nice side effect.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Actually, new languages don’t take very long to create in the right environment, which is usually one in which people from different linguistic groups are thrown together by material necessity and have to find a way to communicate.</cite>\n\nThis seems to be true of [Indian English](http://web.archive.org/web/20110501102837/http:/www.telegraph.co.uk/news/main.jhtml?xml=/news/2007/09/16/wenglish116.xml). The [Wikipedia article](http://web.archive.org/web/20110501102837/http:/en.wikipedia.org/wiki/Indian_English) is also pretty interesting. They adopt English to standardize and immediately start messing with it. My head is paining at the thought of trying to carry a conversation.\n\n"
    },
    {
      "time": "",
      "content": "<cite>To reiterate my previous point: change is good, change is normal, and the death of languages is a good sign that things are proceeding along exactly as they have been and should be. That we may reap some extra benefits from this is an especially nice side effect.<cite></cite></cite>\n\nMaybe what you are missing is that information goes away with the languages. Scientists can always find a way to publish and translate, but when the last remaining members of a culture go away and take the language with them all the cultural information of that society is lost. We won't even have the chance to evaluate whether we think it has value or not—scientific or otherwise.\n\n"
    },
    {
      "time": "",
      "content": "<cite>...information goes away with the languages...We won’t even have the chance to evaluate whether we think it has value or not—scientific or otherwise.</cite>\n\nAgreed. But given the amount of information mankind discovers and stores, and that there is always a limit to our capacity to preserve it, especially as said information becomes esoteric or simply hard to gather from those who hold it, such a loss is an inevitable part of the passage of time. For mankind to preserve all these things that are being lost would require us to direct a great deal of resources away from all of the new stuff going on, and that would break the circle of life and whatnot.\n\nInterestingly, I am seeing a parallel between this and [some interesting research about slowing aging via drugs](http://web.archive.org/web/20110501102837/http:/www.bestlifeonline.com/cms/publish/health-fitness/Could_He_Live_to_2150.shtml). Some scientists believe that the lifespans of animals are related to the predators in their environments, and that animals more likely to be eaten devote far more energy to reproducing quickly than to repairing their own cells, and thus age much faster. Conversely, those animals that have few or no natural predators have much more time to spew their seed into the local gene pool, and thus devote more energy to self-preservation and live longer lives. Perhaps we will one day reach such a point as a society, when so many of the menial tasks of life have been automated and resources have been made so plentiful that we can devote all the time we want to preserving, examining, and learning from the past.\n\n"
    },
    {
      "time": "",
      "content": "Try it this way—preserving languages and cultural knowledge IS the new stuff going on. We may be pissing away a cure for cancer or else while making a cool new video game controller. Capitalism doesn't always direct the funding where it should, and we shouldn't misunderestimate the work scientists are doing to document and understand what other people on the planet have already discovered.\n\nApply your logic to global warming for me. Your ideas about change presume a state of rest or nonaction that is nothing more than an idea—it doesn't really exist.\n\n"
    },
    {
      "time": "",
      "content": "<cite>We may be pissing away a cure for cancer or else while making a cool new video game controller.</cite>\n\nC'est la vie.\n\n<cite>Capitalism doesn’t always direct the funding where it should...</cite>\n\nActually it does, at least from the viewpoint of a capitalist.\n\n<cite>Apply your logic to global warming for me.</cite>\n\nIt happens, but may not currently be inevitable. Halting it would be nice, although it seems highly unlikely to happen given that the majority of mankind lives in poverty and has other things to worry about.\n\n<cite>Your ideas about change presume a state of rest or nonaction</cite>\n\nQuite the opposite. My ideas about change presume that there is _no such thing_, at least not above zero degrees kelvin.\n\n"
    },
    {
      "time": "",
      "content": "_change is good, change is normal, and the death of languages is a good sign that things are proceeding along exactly as they have been and should be._\n\nI can agree that good things come from language change and that there is such a thing as natural language change. But language death is rarely a natural consequence of linguistic evolution, and it really is not the case that any and all change is good.\n\nThe decline of Alaska's native languages has not been natural in any sense of the word. It has come about as generations of children received corporal punishment for speaking their native languages and were repeatedly told that their languages were worthless and inferior to English. A common misconception is that indigenous people weigh the pros and cons of abandoning their languages and pick the language of wider communication of their own free will. The truth is that they \"choose\" to switch under great duress from oppressive (post-)colonial societies. Language death usually follows repressive practices by the group whose language is ultimately adopted. I can't view the end result of egregious human rights violations as evidence that things are proceeding as they should be.\n\n_scientific progress is likely to be sped up by a world with fewer communication barriers, to the benefit of all people._\n\nScience rarely benefits all people equally. Technology has done a great deal throughout history to increase the discrepancy between the \"haves\" and the \"have nots\". I doubt that the indigenous peoples whose languages are lost will be among the primary beneficiaries of whatever future scientific advancement could be attributed to the loss of their languages.\n\nI'd like to know specifically how the mass death of minority languages is supposed to lead to scientific progress. Most members of the dominant American society don't give Native Americans the time of day, let alone take the necessary steps to give them a seat at the table where they could contribute to scientific progress. The ability to communicate more widely within the United States is already a reality, but it hasn't led to the kind of dialogue that will move anyone or anything forward.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I can agree that good things come from language change and that there is such a thing as natural language change.<br>\n*snip*<br>\nI can’t view the end result of egregious human rights violations as evidence that things are proceeding as they should be.</cite>\n\nI’m not passing judgment in favor of what got people to this point. You are right—a lot of horrible things happened—and are still happening—that created the situations that wiped out a lot of cultures. But for some reason, and perhaps I’m just delusional, when I look at the big wheel churning, I sometimes see the good things that arise from it all instead of dwelling on all the nightmares that pop up every time it rolls around. It seems that the volume of atrocity rises every generation, but somehow, good things come up along the way too, and I want to believe that eventually the volume on the good side will hit 11 and finally drown out the bad side.\n\n"
    },
    {
      "time": "",
      "content": "_Perhaps we will one day reach such a point as a society, when so many of the menial tasks of life have been automated..._\n\nOh, you mean menial tasks like work? ;-)\n\n_...and resources have been made so plentiful..._\n\nYeah, like that'll ever happen. Look at the history of our species: we piss away natural resources to make money, the ecology be damned! We have the capacity to transform nature to create tools and technology, but we're too dumb to think about the long-term consequences of depeleting our limited natural resources.\n\n_Halting it [global warming] would be nice, although it seems highly unlikely to happen given that the majority of mankind lives in poverty and has other things to worry about_\n\nIt would be more than \"nice,\" James -- it's imperative, and probably too late to be completely averted. Read _Field Notes from a Catastrophe_. Global warming won't be halted by poor people, or even you and me. It has to be a political decision made by those in power -- i.e., businesses, and the governments they support.\n\n"
    },
    {
      "time": "",
      "content": "James, I hope you are right. There's little we can do about the past, so here's to a more enlightened future.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Oh, you mean menial tasks like work?</cite>\n\nNot all work is menial. It’s been a long time since I did work that I would ever toss into that category.\n\n<cite>...but we’re too dumb to think about the long-term consequences of depeleting our limited natural resources...</cite>\n\nBut that’s changing, albeit slowly. And our resources aren’t as limited as most people think, it’s just our tendency to not re-use most of them that’s stupid.\n\n<cite>It would be more than “nice,” James...</cite>\n\nI know that, but I don’t want to get emphatic about it and send things off-topic into a thread about environmentalism and regulation.\n\n"
    },
    {
      "time": "",
      "content": "James: _scientific progress is likely to be sped up by a world with fewer communication barriers, to the benefit of all people._\n\nMost of the world's scientists already speak a common language (English), so the 'communication barriers' they face tend to be political, technological, financial, etc., not due to an inability to understand each other.\n\n"
    },
    {
      "time": "",
      "content": "_Not all work is menial._\n\nI was being sarcastic, James, hence the ;-) after my remark. I was talking about the tendency of new technologies to replace old jobs. I was thinking, \"How will we all make a living, feed and clothe ourselves, etc., when all the jobs are gone?\" The banks and phone companies and subway systems are automating and going online to get rid of their workers and pay less money, after all.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Most of the world’s scientists already speak a common language (English)</cite>\n\nGood point.\n\n"
    },
    {
      "time": "",
      "content": "\\> the death of languages is a good sign\n\nI guess you didn't see that:\n\n[Microsoft Speaks Romansch to Boost Dying Swiss Tongue](http://web.archive.org/web/20110501102837/http:/www.bloomberg.com/apps/news?pid=email_en&refer=exclusive&sid=aMIDIGeScPZg)\n\n"
    },
    {
      "time": "",
      "content": "James, another stick to give your idea the beats.  \nThe premise that a commonality of media is inherently efficient seems to be flawed -- at some point the returns dimish to the extent that communication is too dull to bother with. It is the stimulus of difference that creates interest and meaning.\n\nFor an example in the most hard-nosed of arenas -- finance -- consider European Monetary Union. This was touted as a great stimulus to increased economic activity, due to less red tape and overheads. But that dividend hasn't arrived, and the Euro has had little effect in juicing Europe's economy.\n\n"
    }
  ]
}
