{
  "id": "37311",
  "title": "The Intertype Machine",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI am currently researching the Monotype and Linotype typesetting machines. I came across an 'Intertype Parts and Accessories' book from 1957 which I bought. However, I can find very little information relating to these [Intertype](http://web.archive.org/web/20150123044210/http:/www.typophile.com/wiki/Intertype) machines. The title page says 'Intertype Company — A division of Harris-Intertype Corporation, Brooklyn, New York.' I believe Linotype was founded in New York which me think that the two were somehow related.\n\nWas Intertype a subsidiary of either Monotype or Linotype? If not did it have much commercial success, and what were the reasons for introducing this new machine when Linotype and Monotype were already so dominant? Did it offer any benefits or technical progressions over the Linotype/Monotype machines?\n\nAny information you can offer would be greatly appreciated.\n\n—Phil\n\n",
  "author": "pbaber",
  "time": "20 Sep 2007 — 1:48pm",
  "uid": "18149",
  "comments": [
    {
      "time": "20 Sep 2007 — 6:50pm",
      "content": "Hi Phil,\n\nThe Harris-Intertype Fotosetter was the first photo typesetting machine invented. It marks the beginning of the Cold Type era and is the machine responsible for it . . . Incidentally this is the machine that inspired the creation of the Filmotype by its inventor Allan Friedman when he saw it unveiled to US audiences in 1948.\n\nInstead of lead slugs, the Intertype which was a Linotype machine had replaced them with small film negatives and proceeded to set type as you would imagine the bastardization of a lead type and photo type machine only could.\n\nThere are several great articles about the Fotosetter and some Googling is well advised but to help round out the picture for you, imagine the benefit a typesetter or printer gained when going from lugging around cases of lead slugs weighing many pounds to an entire alphabet that could be held in hand.\n\nThere are many reasons Cold Type caught on and it became the standard some time after that period till digital typesetting machines like the Alphatype came into their own. It wasn't until the release of the first MacIntosh in 1984 when Cold Type was eclipsed by desktop publishing . . .\n\nLet me know if you dig up some nice images of the Fotosetter!\n\nBest,  \nStuart :D\n\n"
    },
    {
      "time": "20 Sep 2007 — 7:46pm",
      "content": "[Here's some history](http://web.archive.org/web/20150123044210/http:/www.linotype.org/OnLineDocs/Miscellaneous/differences.html) of the Intertype machine, which before the photo era was a hot metal line caster, a rival to Linotype.\n\n"
    },
    {
      "time": "20 Sep 2007 — 8:11pm",
      "content": "Here's an article by Peter Bain that may be of interest to you:\n\n[Display phototype in New York: folks, firms and fonts](http://web.archive.org/web/20150123044210/http:/stbride.org/friends/conference/hiddentypography/phototype.html)\n\n"
    },
    {
      "time": "21 Sep 2007 — 5:31am",
      "content": "Intertype was a rival to Linotype and competed in the same markets. A number of popular newspaper text faces were developed by Intertype, including Imperial and Ideal.\n\n"
    },
    {
      "time": "21 Sep 2007 — 6:59am",
      "content": "For what it is worth, there was also a machine called a Linograph [I think]. This was cheaper than Linotype or Intertype machines and could run mats from both those machines. I only know of this because it was invented and developed here in the upper Midwest. I have not had time to look into it more deeply.\n\nThis might be an interesting topic for someone delving into the history of hot-metal machine composition.\n\npowers\n\n"
    },
    {
      "time": "24 Sep 2007 — 3:17pm",
      "content": "Thanks for your information — it is all really useful.\n\nStuart, I have some really nice illustrations of the Intertype machines, and some amusing adverts which attempt to convince printers of the supposed benefits of  \nthe Intertype without much subtlety. When I get some time I will post them up here.\n\n—Phil\n\n"
    },
    {
      "time": "5 May 2011 — 11:04pm",
      "content": "Hi, Phil. Wish I'd seen your post four years ago. Have you completed your research? Here is a link to photos of the tour I took of the Intertype Corporation factory back in the sixties. I was an Intertype machine operator (typesetter, \"comp,\" etc.) for fifteen years.\n\n[http://www.coutant.org/intertype/](http://web.archive.org/web/20150123044210/http:/www.coutant.org/intertype/ \"http://www.coutant.org/intertype/\")\n\nThose are my photos; I took them. As far as I am concerned, you are free to use them in any not-for-profit publication.\n\nBest success in your endeavors.\n\nStan Coutant\n\n"
    },
    {
      "time": "6 May 2011 — 6:49am",
      "content": "Very much thanks for sharing such great pictures Stan. Really capture an era.\n\n"
    },
    {
      "time": "6 May 2011 — 6:57am",
      "content": "Great pics!\n\n"
    }
  ]
}
