{
  "id": "37318",
  "title": "Vista, CS3, suitcase and T1 Woes",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I apologize for posting this here, but i’m wondering if anyone can point me towards some worthwhile discussion on the interplay between these bits of software.\n\nI’ve just recently upgraded to both windows vista and adobe cs3, and have found that suitcase no longer plays nicely with T1 fonts in that environment. I’m not exactly sure where the problem is, just that the T1 fonts no longer activate. It seems that several people have had this problem, but i can only find scraps of information about it or a solution.\n\nThanks in advance for any help.\n\n [‹ Typophile tshirts in the wild](http://web.archive.org/web/20080905134737/http:/www.typophile.com/node/9270 \"Go to previous forum topic\") [I hate computers ›](http://web.archive.org/web/20080905134737/http:/www.typophile.com/node/37156 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905134737/http://www.typophile.com/user/7535\" title=\"View user profile.\">ben millen</a>",
  "time": "<br>",
  "uid": "7535",
  "comments": [
    {
      "time": " 20.Sep.2007 5.36pm",
      "content": "There’s a number of recent Suitcase Fusion updates to CS3/OS issues on the [Extensis updates page](http://web.archive.org/web/20080905134737/http:/www.extensis.com/en/downloads/index.jsp;jsessionid=QRNSAIVV0SP51LAQAAUARSQ), but since I actually use CS2 and on a Mac, haven’t been needing them. Might have missed an update?\n\n"
    },
    {
      "time": " 20.Sep.2007 6.35pm",
      "content": "<cite>I’ve just recently upgraded to both windows vista and adobe cs3...</cite>\n\nAre you running Suitcase 9.x or Suitcase 11? Suitcase 9.x has not been updated for Vista compatibility, although I can’t recall exactly how it fails. When Suitcase 11 for Windows was released, there were a few isolated cases where users had registry permissions set that prevented certain font types from activating. It wasn’t a problem with default installs of Vista, and I don’t know what caused it. I think that attempting to install any variation of ATM can also cause problems, and could potentially result in the behavior you’re seeing.\n\n"
    },
    {
      "time": " 20.Sep.2007 8.04pm",
      "content": "Well I feel silly. Turns out the updates fixed the problem. Thanks for the help!\n\n"
    }
  ]
}
