{
  "id": "37323",
  "title": "Help me name it, too!",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "So I started playing around with some letterforms I drew. Initially, my idea was to make a unicase typeface; but since everyone would just point out that there's little need for unicase fonts, I decided to draw both alphabets (that's not the only reason, of course...). However, I did start out with this.\n\nI have lots of problems with many of the characters, most of them I can't quite see how I can solve, so what I'm looking for is anything AT ALL that you'd like to share with me about this (if you like it, if it's any good, if the world needs it – you know what I mean –, if the stroke thickness is all wrong – where and why would be nice... how to solve it would be excellent –, if some character seems out of place, if it reminds you of something, etc.). I mean really anything.\n\nSome things I'd like to add... I drew everything directly on the computer. I know, I know... I shouldn't have and that's probably where most of my mistakes come from, but I'm going all the way with this and you can't stop me! :P  \nDon't mind the O, I drew that just because I thought the O was too bare in comparison with the other characters. It would be an alternate, as would the R, probably. And I will do the other alphabet, but am planning to maintain the uppercase at the same height as the lowercase, because I really just wanted a way of combining lowercase and uppercase letterforms to make separate words look good... you know... I'd use this typeface to easily create simple logos (or the starting point for logos), for example, or to use as a display face on posters. I kind of always imagine using it on a poster for a music festival, with all the separate names of the bands and stuff, although I can't quite imagine which kind of music festival would look good in this... :P It's just an example.\n\nThat said, here's the image. There's a lot more to say (mainly because I'm all over the place with it), but I guess we'll keep in touch. :)\n\n ![](http://web.archive.org/web/20150416140338im_/http:/typophile.com/files/Sample_3960.png)\n\nrubenD\n\n",
  "author": "rubenDmarkes",
  "time": "20 Sep 2007 — 8:36pm",
  "uid": "12632",
  "comments": [
    {
      "time": "20 Sep 2007 — 11:51pm",
      "content": "I love unicase fonts. This is cool. You might look at the gothic alphabet and uncial faces for some inspiration.\n\nI like the K, Z, T, and H best.\n\nKeep the flair inside the O, just make it a bit smaller, and make it not touch the right side of the bowl.\n\nThe X is falling over to the right.\n\nThe tail on the Q and R are too different. Pick angular or curved, and run with it. Same with the Y.\n\nThe F looks like something mashed it down on the top left.\n\nHope this helps. Keep going with this.\n\n"
    },
    {
      "time": "21 Sep 2007 — 1:04am",
      "content": "I like this very much. I think your D, N, and M are a bit lacking in contrast, though.\n\n"
    },
    {
      "time": "21 Sep 2007 — 5:28am",
      "content": "Thank you very much!\n\nI know I have to alter most of the characters, so it really helps that you singled some out, glyphobet. That way I can tell what's more important and noticeable and what's not.  \nI had kind of thought about the tails on Q and R, but I thought they should be different, since I was aiming to create a uniqueness on all (or most) of the characters... and also, I really like the angular tail on the Q, but think it wouldn't work on the R. Also, this R will probably be an alternate, so that wouldn't be that big of a deal... but I will think about that (and the Y). Thank you for pointing that out!  \nYou're right about the X and the F – though I was fond of that top left of the F – and I will think about that idea about the O, too.  \nI'm really glad you liked those characters... the T, for instance, was really great, in my head, but when I drew it it kind of looked strange and out of balance... I also thought maybe the H should be a tad wider and I should do something about the top leg on the K (though I still don't know what, exactly); what do you think?\n\nNow about mr: I'm glad you like it!  \nI did run into a lot of trouble with the N and the M... I was thinking the contrast is there on all the characters, but it is a bit discreet, so when I thought about the contrast on these letters I didn't want to overdo it, because it would be too noticeable... you really think I should give them more contrast? Should I focus on making the thin strokes thinner, the thick thicker or both?  \nAbout the D, I'm thinking I should probably make it a bit wider, because it's hard to add contrast when the thin part of the stroke isn't long enough. Originally it was wider, but the counter looked too open when compared with the others...\n\nThanks again and please, keep'em comin'. :)  \nrubenD\n\n"
    },
    {
      "time": "21 Sep 2007 — 7:08am",
      "content": "I think the top arm of the 'k' in your image might be a bit too light.\n\n"
    },
    {
      "time": "21 Sep 2007 — 8:12am",
      "content": "Yes, I thought so too, but when I tried to make it darker it didn't look that good, either... I'll play around with it a bit more. Thanks!\n\nrubenD\n\n"
    },
    {
      "time": "21 Sep 2007 — 9:09am",
      "content": "If you thicken it just a bit, it would help. Probably add something like 1/4th of the thickness it is now.\n\n"
    },
    {
      "time": "22 Sep 2007 — 3:27pm",
      "content": "The top of the lc 'f' seems to straighten out and get thing right before it hooks. Stands out when I look at the entire image.\n\nAnd I like the 'O'\n\n"
    },
    {
      "time": "26 Sep 2007 — 3:20pm",
      "content": "I'll try that, Quincunx. I've been on a break, but I'll get back on it soon.\n\nytknows, I didn't quite understand what you were trying to say... do you mean you think the F should have a rounder top, like glyphobet?\n\nThanks :)  \nrubenD\n\n"
    },
    {
      "time": "26 Sep 2007 — 3:45pm",
      "content": "Yeah Ruben, I meant exactly what glyphobet said; the problem was I added a 'g' to the word 'thin', producing 'thing'\n\nBut back to the F, it just appears to get a little too straight, it seems to need a little more rounding than it currently has, a little more like the top of the S (on a larger scale, of course).\n\n"
    },
    {
      "time": "27 Sep 2007 — 7:47pm",
      "content": "Will do! Thank you, yt (and glyphobet, again). :)\n\nrubenD\n\n"
    }
  ]
}
