{
  "id": "37327",
  "title": "CV to critique",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Hey people, after this year finishes, (in about 30 days) I will begin feverishly looking for a Job in design. so please critique my CV not only for composition but content. Any help would be really appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [CV.pdf](http://web.archive.org/web/20080106172819/http:/typophile.com/files/CV.pdf) | 41.05 KB |\n\n [‹ Books on information design](http://web.archive.org/web/20080106172819/http:/typophile.com/node/36008 \"Go to previous forum topic\") [Looking for a Jazz age look Font ›](http://web.archive.org/web/20080106172819/http:/typophile.com/node/33904 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080106172819/http://typophile.com/user/21733\" title=\"View user profile.\">Miguelzinho</a>",
  "time": "<br>",
  "uid": "21733",
  "comments": [
    {
      "time": " 21.Sep.2007 3.07am",
      "content": "Overall, I think it looks excellent. Concise, to the point and refreshingly original. One thing that I picked out was the ’papers of interest’ section. Are these titles of papers which you have written, or titles of a publication? It would be a good idea to reference them (year written, name of publisher etc...).\n\nApart from that, bravo. Good luck with the job search (I’d invite you for an interview).\n\nMike\n\n"
    },
    {
      "time": " 21.Sep.2007 3.10am",
      "content": "Very good content and composition.  \nOnly one thing I don’t like: the ligature of the lowercase ’i’ with the next letter.\n\nA.\n\n"
    },
    {
      "time": " 21.Sep.2007 4.39am",
      "content": "Cheers, thanks a lot. Yeah I might have gone a bit OTT with the ligatures just purchased the typeface and I’m still kinda taking it for a spin.\n\nPapers of interest refers to the subjects I have taken at University. Maybe I should make that subheading – subjects of interest – to save confusion.\n\n"
    },
    {
      "time": " 21.Sep.2007 6.07am",
      "content": "In career statement:  \n“I am is passionate about graphic design”\n\nand I agree with abaldoni about the ligatures.\n\n"
    },
    {
      "time": " 21.Sep.2007 6.45am",
      "content": "I think INTERESTS should be aligned with FREELANCE JOBS\n\nReferees? Is that an aussie term? Here we’d say REFERENCES instead.\n\nI like the look a lot. Once you have more experience I’d take out some of the padding - I was never impressed by Career Statements, or Objectives on a resume. I also think you could combine Design Skills and Software.\n\n"
    },
    {
      "time": " 21.Sep.2007 11.15am",
      "content": "Prolly the best way I can help is to edit some of the content:\n\nPerhaps “Career statement” isn’t quite the right header. Maybe “Profile” would be better? I don’t think what that section says is concise enough to call a statement.\n\n“I researched into branding” — What you want to say is “I researched branding”.\n\n“Whilst at university” — “While at university” is fine. “Whilst” sounds very old.\n\n“Identities by of design” — not sure, but you need to pick one. “by of” doesn’t work.\n\n“Referees” — you mean “references” But I wouldn’t bother including a section for references just to say they are supplied upon request. No need to have it. If they want references, they’ll ask.\n\nUnder “Design Skills” — you might want to use caps or small caps on Branding and visual ID. Otherwise id reads as a word.\n\nUnder “Freelance Jobs” — “Designed of event logo” ... you mean either “designed event logo” or “design of event logo”. Also, these are not complete sentences. Don’t put a period after the bulletted points. And they should be parallel in structure — so use either a verb or noun construction for each one.\n\nI can’t find your name. I see that it’s in your email address, but I think it should be big enough that it hits the reader immediately. Your names is important.\n\nK.\n\n"
    },
    {
      "time": " 21.Sep.2007 12.11pm",
      "content": "Also, Macromedia no longer exists as a company, all of their software is part of Adobe’s CS3 suite now.\n\n"
    },
    {
      "time": " 21.Sep.2007 4.42pm",
      "content": "Great, thanks guys just what I needed. So I’ve fixed some of my typo’s, renamed a few things, and corrected some alignment. Yes Referees is a common New Zealand term for what you call references.\n\n’Visual id’ lol that would be interesting : [http://en.wikipedia.org/wiki/Id%2C\\_ego%2C\\_and\\_super-ego#The\\_id](http://web.archive.org/web/20080106172819/http:/en.wikipedia.org/wiki/Id%2C_ego%2C_and_super-ego#The_id \"http://en.wikipedia.org/wiki/Id%2C\\_ego%2C\\_and\\_super-ego#The\\_id\")\n\nhere is the updated version of the CV : [http://www.mhdesign.net.nz/CV2.pdf](http://web.archive.org/web/20080106172819/http:/www.mhdesign.net.nz/CV2.pdf \"http://www.mhdesign.net.nz/CV2.pdf\")\n\n"
    },
    {
      "time": " 22.Sep.2007 2.03am",
      "content": "Under **CAREER STATEMENT** you write:\n\n“In the last year in particular I have taken great interest into branding and visual identity...”\n\nThis should read:\n\n”...I have taken great interest in branding and visual identity...”\n\n"
    },
    {
      "time": " 22.Sep.2007 9.17am",
      "content": "I agree with Kristina: your name should be bigger, or at least more noticeable.\n\n“Whilst at University I have also gained experience in helping a number of local businesses with their visual identities by designing logos, poster and other basic graphic design. This has allowed me to use my range of skills in graphic design and typography.”\n\nI’m no english professor, but perhaps you could consider these alterations:\n\n“Whilst” is best changed to “while.”\n\nGet rid of the have/has. For example, “While at University, I also gained experience...”\n\n“logos, poster, and other basic graphic design” is not parallel, and needs to be. You can do this by making poster plural. I’m a bit confused as to what to do with “basic graphic design,” however. It shouldn’t be listed, anyway, because without the other parts of the sentence, it would read “by designing basic graphic design.”\n\nIt’s good to add some some sort of reference after “this” so that the reader knows what you’re referring to. What is it that has allowed you to use your range of skills in graphic design and typography?\n\nHope I’ve helped a little!\n\n"
    },
    {
      "time": " 22.Sep.2007 9.26am",
      "content": "<cite>“I am <strong>is</strong> passionate about graphic design,”</cite>\n\n- Lex\n\n"
    },
    {
      "time": " 22.Sep.2007 11.08am",
      "content": "_“Whilst” is best changed to “while.”_\n\nJohanna and Kristina, the man lives in New Zealand, not the U.S. Correct me if I’m wrong, but I understand that “whilst” is still quite common in British English. :-)\n\n"
    },
    {
      "time": " 22.Sep.2007 12.44pm",
      "content": "Ah, oops!\n\n"
    },
    {
      "time": " 22.Sep.2007 3.16pm",
      "content": "That’s fine, and he’ll know to ignore our inappropriate corrections. I’m in Canada, and I wouldn’t use “whilst”.\n\nI have no idea what is or isn’t current in edit: New Zealand since I don’t live there. Just like I would never have guessed referees would be equivalent to our references. From the other grammar problems I was thinking English was possibly his second language.\n\n"
    },
    {
      "time": " 22.Sep.2007 4.38pm",
      "content": "\\> From the other grammar problems I was thinking English was possibly his second language.\n\nOw burn. No actually I quickly re-wrote this. My brothers GF wrote it for me but she wrote it in the third person, so I went back and changed it to first person.\n\nthus  \n“I am is passionate about graphic design,”\n\nOriginally it was: Michael is passionate.  \nNow it is : I am passionate.\n\nwhich kinda explains my other grammatic errors apart from not having full sentences in my freelance jobs section. For that I was trying to keep it brief.\n\n"
    },
    {
      "time": " 22.Sep.2007 6.05pm",
      "content": "My apologies! I didn’t mean to “ow burn”. It’s the “researched into” which seems like something a non-native English speaker might say, of which there are many on Typophile. No criticism intended! I apologize if I hurt your feelings. :(\n\nAnd I didn’t go and look at your profile to see where in fact you were located.\n\nSince I felt unable to critique the layout (as a relative beginner in design) I went to work on what I could do...\n\nOh, and the sentence fragments are fine — just don’t put a period at the end of them.  \nI don’t think I have \\*any\\* complete sentences in my CV...\n\nBah. Sorry.  \nopen mouth, insert foot.\n\n"
    },
    {
      "time": " 22.Sep.2007 7.48pm",
      "content": "_I’m in Canada, and I wouldn’t use “whilst”._\n\n:-)\n\nTo be honest, Kristina, it sounds a bit archaic to my American-trained ears, but I come across it a lot when reading books or articles by British writers. :-)\n\nIt’s like coming across the word font in a British book — it’s spelled “fount” but pronounced “font” in the UK (or so I’ve been told), but when I come across this British spelling it always stops me in my tracks — just seems anachronistic to my eyes.\n\n"
    },
    {
      "time": " 22.Sep.2007 9.27pm",
      "content": "Haha no worries Kristina. Thanks for helping me to sort out a few of the problems in my CV:) When I go to North America I’ll be sure to edit “whilst” out and replace with while.\n\n"
    },
    {
      "time": " 23.Sep.2007 1.33pm",
      "content": "I like your resume, it’s really nicely designed.  \nI have pretty limited experience job hunting, I graduate like 6 months ago, and I just got a job (yay!) but I think my advice for what to wear and what to show is just be yourself! If you have to go out of your way completely for an interview to impress then you probably won’t fit in or enjoy working in the agency anyway.\n\n"
    },
    {
      "time": " 23.Sep.2007 2.51pm",
      "content": "clean concise and simple really liking it, not sure about the yellow, but thats personal\n\n"
    }
  ]
}
