{
  "id": "37329",
  "title": "Anyone going to ABQ???",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "for the AIGA House thing? Do we have any ’philes from NM up in here? i just might go if i can break away...\n\n [‹ Advice about magazines to buy](http://web.archive.org/web/20080422033358/http:/typophile.com/node/37519 \"Go to previous forum topic\") [making inch marks ›](http://web.archive.org/web/20080422033358/http:/typophile.com/node/37582 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080422033358/http://typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": "<br>",
  "uid": "7006",
  "comments": [
    {
      "time": " 21.Sep.2007 2.27am",
      "content": "I have family in NM and I’m going there on vacay soon but probably not this soon. Bummer. :-(\n\nMikey :-)\n\n"
    },
    {
      "time": " 27.Sep.2007 12.29pm",
      "content": "it was a great presentation. a lot of the ususal House history lesson, but i really enjoyed what they showed about their involvement with Eames and the new Girard fonts. Rich said a couple of interesting things:  \n1) he made the claim that noone else does the OT thing quite as well as House. i agree that they do it very well, but are they THE best? i’m not sure...  \n2) he said that they now try to include some fonts suitable for text with each release. i thought this was quite an interesting approach, and looking back at their last few releases, you can see that this is the case. it was one of those things that i kind of knew in my mind, but didn’t fully realize until Rich said it. I really this approach: marketing a set of related typefaces that include both text and display faces with a similar flavor. i hope this kind of thing catches on more.\n\n"
    },
    {
      "time": " 27.Sep.2007 12.29pm",
      "content": "p.s. they also had catalogs for their house33 swag. great stuff!\n\n"
    },
    {
      "time": " 27.Sep.2007 3.23pm",
      "content": "I’m glad (or bitter) that you got to go to the House AIGA presentation. :-)\n\nMy train leaves to Albuquerque this Saturday. I’ll be there for 2 weeks. I wonder if any House stuff will still be there on display.\n\nI have noticed the a “textual” trend at House too. Display faces are one trick ponies and go out of fashion much faster than a text face. Their new text systems are fabulous. Paperback, Neutraface, and Luxury all seem like the forerunners of this new trend and look like they have lots of longevity to their design.\n\nMikey :-)\n\n"
    },
    {
      "time": " 27.Sep.2007 3.47pm",
      "content": "So Paul, is this your visit home before departing for Reading?\n\nChrisL\n\n"
    },
    {
      "time": " 27.Sep.2007 8.09pm",
      "content": "it is, last night ABQ tonight LV.  \nabout LV: if you want to visit the neon boneyard, be sure to book your tour weeks in advance. apparently it’s quite popular!\n\n"
    },
    {
      "time": " 27.Sep.2007 10.45pm",
      "content": "Hi there:\n\nPaul you need to update your wiki to reflect your recent Underground Pro release.\n\nMikey :-)\n\n"
    }
  ]
}
