{
  "id": "37369",
  "title": "website name",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all\n\nhey m going to build my own personal website cud u guys help me n suggest a good name for its domain. m nt able to judge a good name for it plz help me out i have to register the domain in a day or two my name is Gaurav n it will be my personal website or u cn say as my homepage...\n\nthnx u all\n\n [‹ document management software for windows?](http://web.archive.org/web/20071222214608/http:/www.typophile.com/node/37838 \"Go to previous forum topic\") [Bureaucrats reprimanded for posts about typography ›](http://web.archive.org/web/20071222214608/http:/www.typophile.com/node/37895 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071222214608/http://www.typophile.com/user/22029\" title=\"View user profile.\">ggaurav84</a>",
  "time": "<br>",
  "uid": "22029",
  "comments": [
    {
      "time": " 22.Sep.2007 11.56am",
      "content": "[www.theveryverypersonalwebsiteofgaurav.com](http://web.archive.org/web/20071222214608/http:/www.theveryverypersonalwebsiteofgaurav.com/ \"www.theveryverypersonalwebsiteofgaurav.com\")\n\n..  \nHey, tell us your profession atleast, and what you gonna put there on the website.  \nmay be then we can suggest a good name. Otherwise its a nice name what i have just suggested ,)\n\n"
    },
    {
      "time": " 22.Sep.2007 2.17pm",
      "content": "i hv cmpltd my graduation in computer applications n the content of website will be abt me , my lifestyle , my frnds, my pics, my hobbies, my inteests, n all tht kinna stuff...\n\n"
    },
    {
      "time": " 22.Sep.2007 2.36pm",
      "content": "are you dyslexic?\n\n"
    },
    {
      "time": " 22.Sep.2007 3.16pm",
      "content": "Tell us what you, your lifestyle, friends, pics, hobbies and interests are about. You have to be specific.\n\nAre you typing in on a mobile phone?\n\nj a m e s\n\n"
    },
    {
      "time": " 22.Sep.2007 3.19pm",
      "content": "cantspel.com?  \nlaZguy.com?  \nintoIM&cantgetout.com?\n\n"
    },
    {
      "time": " 22.Sep.2007 3.21pm",
      "content": "LOL\n\nj a m e s\n\n"
    },
    {
      "time": " 22.Sep.2007 9.50pm",
      "content": "well sorry guys but i can spell the words... & i am not even using any mobile phone.... well according to me i am like an open book, i usualy dont make friends but if made they become a strong part of my life, i love my relations n afraid too of loosing them... i have enjoyed last 3 yrs of my life a lot with my college friends, i love music specially slow n harmonic, instrumental, n sometimes rock, jazz, pop, i love photography its 1 of my passions, also my hobbies are playing chess, billiards, writing articles n poems (well they are not for publications)... so these were some of my interests... basically i am interested to launch a personal website which will contain my intro, my life experience till now, information about my academics, my snaps, my achievemets, something like from which my friends n people can easily know me what am i\n\n"
    },
    {
      "time": " 22.Sep.2007 9.59pm",
      "content": "i thnk u shud nm it whada?.com\n\n"
    },
    {
      "time": " 22.Sep.2007 10.00pm",
      "content": "anyway... what are your feelings about caramel? because i like chocolate, but sometimes, i don’t know... caramel...\n\n"
    },
    {
      "time": " 22.Sep.2007 10.05pm",
      "content": "n see? ths is case whr no IM iz klln me...\n\n"
    },
    {
      "time": " 22.Sep.2007 11.03pm",
      "content": "Wow, now I know what you’d do if you had IM back... =)\n\n"
    },
    {
      "time": " 22.Sep.2007 11.59pm",
      "content": "Vanna, can I buy a vowel?\n\n"
    },
    {
      "time": " 25.Sep.2007 11.25am",
      "content": "Awwww, c’mon, it’s not his fault; the only font installed on his computer is [FF Mt](http://web.archive.org/web/20071222214608/http:/www.fontfont.com/downloads/).\n\n"
    },
    {
      "time": " 25.Sep.2007 11.40am",
      "content": "How about gauravian.com?\n\nGau.rav.i.an [gau- **reyv** -eee-uhn] (adj.)\n\n1. Of or pertaining to Gaurav: _a Gauravian website._  \n2. Without vowels: _He abbreviated his text messages with Gauravian syntax._\n\n"
    },
    {
      "time": " 25.Sep.2007 1.30pm",
      "content": "grvgpt.in is still available, and so is grvgpt.com.  \nHell, even grv.in seems to be on-hand.\n\nWhat is wrong with gaurav.com? Would be my first choice …\n\n"
    },
    {
      "time": " 25.Sep.2007 2.34pm",
      "content": "it’s taken\n\n"
    },
    {
      "time": " 25.Sep.2007 3.23pm",
      "content": "The internet is such a useful tool... Ahhh, technology.\n\n"
    },
    {
      "time": " 25.Sep.2007 10.33pm",
      "content": "plz suggest some more name\n\n"
    },
    {
      "time": " 26.Sep.2007 6.13am",
      "content": "“plz suggest some more name”\n\nplease use full words.\n\n"
    },
    {
      "time": " 26.Sep.2007 6.15am",
      "content": "You know the next time you call up your computer company for a service call, and that call is picked up in India, Gupta just might be the person who will try to give you your info!\n\nGuptaGuarav.com\n\n"
    },
    {
      "time": " 26.Sep.2007 6.33am",
      "content": "tonicandg.in\n\ng’sblg.com\n\nsnsvwl.in\n\ng’slifefriendsrelationsacademicachievement.com\n\nTim\n\n"
    },
    {
      "time": " 26.Sep.2007 9.26am",
      "content": "I think the g’man is a domain harvester.\n\nHere you go, this one is available...\n\nwastduth.com\n\n"
    },
    {
      "time": " 26.Sep.2007 11.48am",
      "content": "<cite>...the next time you call up your computer company for a service call, and that call is picked up in India, Gupta just might be the person..<cite></cite></cite>\n\nYour computer company, along with nearly everybody else’s, seems to be making a fairly decent go of it out here in India. So it probably won’t be so bad after all.\n\nSorry for sounding tetchy, but this whole thing had to with a guy who put up a post which one may approve of, or more likely, not. Why bring up India at all?\n\n"
    },
    {
      "time": " 26.Sep.2007 4.48pm",
      "content": "writingdesigning - the original poster is from India. That is why India has been brought up. Also, if you read he just graducated recently with a degree in computer applications. What we are not enjoying is the original posters lack of the English language. It is also very reminiscent of every call I’ve made to Apple after 5pm PST —\n\n"
    },
    {
      "time": " 26.Sep.2007 6.58pm",
      "content": "Jackie - Now, that’s unexpected. I thought the problem was a lack of imagination or effort rather than ’a lack of English language.’\n\nApple, by the way, is a rather notable exception among the bigger IT companies in not having an offshore centre in India.\n\n"
    },
    {
      "time": " 26.Sep.2007 8.00pm",
      "content": "For the price of a new Mac, you can have **[Dopeyhead.com](http://web.archive.org/web/20071222214608/http:/www.dopeyhead.com/)**\n\n"
    },
    {
      "time": " 26.Sep.2007 11.44pm",
      "content": "\\>we are not enjoying is the original posters lack of the English language\n\nNot at all, Arun’s assessment is correct.\n\nTim\n\n"
    },
    {
      "time": " 27.Sep.2007 4.45am",
      "content": "writingdesign - during the daytime hours you get Apple folks around the US - but have you tried in the nighttime hours? I’ll never call at night again - vowed not too - they read from a manual and are not helpful with questions that the answers are not found in the manual.\n\nI remember one night when I first got the G5. I was put through a rigamarole - and the person on the other end would say in the poorest English I’ve ever heard, something about two arrows on the screen. Well, there weren’t two arrows on the screen and I could hear her brain fizz out. The next day I called back and had a very helpful customer service person who understood that there was a defect in the computer.\n\nAnd I’m sorry timd - who is Arun? I don’t see Arun’s assessment. I can’t find Arun’s name here - even when I use the Search. Only place I can find it is in your statement. But then again, at 9am I’ll see my eye doctor...\n\n"
    },
    {
      "time": " 27.Sep.2007 6.00am",
      "content": "writingdesign is Arun.\n\n"
    },
    {
      "time": " 27.Sep.2007 6.20am",
      "content": "And Arun’s assessment…  \n‘I thought the problem was a lack of imagination or effort rather than “a lack of English language”.’\n\nTim\n\n"
    },
    {
      "time": " 27.Sep.2007 6.30am",
      "content": "For the record, from my experience (DAMN YOU MICROSOFT!) most Indian tech support folks can speak and type perfect English. This particular person is just abusing his keyboard.\n\n"
    },
    {
      "time": " 27.Sep.2007 7.40am",
      "content": "Jackie, I’m sure that sort of thing must have been quite frustrating.\n\nThanks Tim, Darrel for putting things in perspective, and Satya for letting out my dark secret;)\n\n"
    },
    {
      "time": " 27.Sep.2007 8.10am",
      "content": "Hi Arun — yes, especially after dealing with a company in India for keystrokes... another story - probably good for an I/M — oh, but we don’t have those anymore... LOL\n\nAluminum, I am glad you’ve had good experiences with customer service departments — I tend to get the person with a very thick accent...\n\nBTW - my distance sight has improved ... the reading part not so... boo hooo  \nNew glasses in two weeks.\n\n(Toto — I don’t think we’re in New York anymore...)\n\n"
    },
    {
      "time": " 27.Sep.2007 10.16am",
      "content": "“Aluminum, I am glad you’ve had good experiences with customer service departments — I tend to get the person with a very thick accent...”\n\nWhoa...hold on...I never said I’ve have good experiences with tech support...just that I seem to have been lucky enough to understand what they said. ;o)\n\n"
    },
    {
      "time": " 27.Sep.2007 10.58am",
      "content": "then yes, lol, aluminum - very lucky...\n\nGee this would have been a good I/M too!!!\n\n"
    },
    {
      "time": " 2.Oct.2007 6.11am",
      "content": "hey guys thanks for ur suggestions but i do need more names so i cn try 1 of the best from them. so please....\n\n"
    },
    {
      "time": " 2.Oct.2007 6.41am",
      "content": "cn u go away plz\n\n"
    },
    {
      "time": " 2.Oct.2007 7.27am",
      "content": "rukidding.com and urcrzy.com are taken. but as of right now these are available...\n\nrutrippen.com  \nurtrippen.com  \nurnadaze.com  \ng3t2wrk.com\n\ni’m digging it g’man. breaks the boredom. tell yer mom’n’em i sed hey.\n\n"
    },
    {
      "time": " 2.Oct.2007 7.47am",
      "content": "[http://www.ru4real.com/](http://web.archive.org/web/20071222214608/http:/www.ru4real.com/ \"http://www.ru4real.com/\") was just snapped up by someone. U snooz u looz.\n\n"
    },
    {
      "time": " 3.Oct.2007 3.52am",
      "content": "ggaurav84\n\nThe majority of people who respond to threads on this website are professionals. We deal in designing type, setting type, living type, eating type, being around type - oh and even when we retire, we still stay actively involved in the world of type.\n\nThe website you describe is a “personal” one and I don’t think any of us are qualified to help you. You are the next generation, and one that just doesn’t take advantage of every letter you could. We do not relate to someone who writes things like ” m nt able...or u cn...”\n\nPerhaps this just isn’t the site for you to ask us about you personal webpage. There are “younger” types of forums out there and they would be happy for a chance to help.\n\nMeanwhile, if you have a discussion about a typeface you love, you need a design critiqued or a font identified, please come back — that’s our forte and we help many.\n\n"
    },
    {
      "time": " 3.Oct.2007 2.06pm",
      "content": "_The website you describe is a “personal” one and I don’t think any of us are qualified to help you. (...) We deal in designing type, setting type, living type, eating type, being around type..._\n\nHear, hear, Jackie. I was hoping someone would mention the lack of connection between the request and this forum.\n\n"
    },
    {
      "time": " 8.Oct.2007 6.01pm",
      "content": "ggaurav84:\n\nMight I suggest you invest the time in a couple English classes.\n\n"
    }
  ]
}
