{
  "id": "37376",
  "title": "Exceptional printer? Submit your best printers; environmental / green printers, letterpress, offset, digital printing, etc.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In light of these two recent threads:\n\n[http://typophile.com/node/36940](http://web.archive.org/web/20071108215513/http:/typophile.com/node/36940 \"http://typophile.com/node/36940\")  \n [http://typophile.com/node/37356](http://web.archive.org/web/20071108215513/http:/typophile.com/node/37356 \"http://typophile.com/node/37356\")\n\nI think it would be enormously helpful to have an open thread where experienced typographers and graphic designers list their best printers. Personally, I need more environmentally friendly printing resources, but even more, I want to support small artisan printers, true craftsmen, that do great work (William Morris would be proud, huh?) I don’t have a big, slick printer I \\*love\\* in my virtual roledex, either.\n\nI, for one, would like to give a shout out to [Black Pearl Press.](http://web.archive.org/)\n\nAnyone else have a printer they count on to do extraordinary work? Links would be great ... locations can be anywhere.\n\nThanks,  \nEileen  \n [Eileen Burke Graphic Design](http://web.archive.org/web/20071108215513/http:/www.eileenburke.org/)\n\n [‹ Major Leopard Bug](http://web.archive.org/web/20071108215513/http:/www.typophile.com/node/38891 \"Go to previous forum topic\") [FONTS THAT LACK KEYBOARD LINKS ›](http://web.archive.org/web/20071108215513/http:/www.typophile.com/node/38914 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071108215513/http://www.typophile.com/user/21709\" title=\"View user profile.\">EileenB</a>",
  "time": "<br>",
  "uid": "21709",
  "comments": [
    {
      "time": " 22.Sep.2007 2.11pm",
      "content": "A popular topic as of late...\n\n[Pinball Publishing](http://web.archive.org/web/20071108215513/http:/www.pinballpublishing.com/) in Portland, OR is awesome. They work with soy inks and have lots of recycled paper options. Their work is really, really good and their prices even better.\n\n"
    },
    {
      "time": " 6.Nov.2007 5.26pm",
      "content": "[Best green (environmental) printer I’ve ever used. Awesome with color and unique papers or unusual materials.](http://web.archive.org/web/20071108215513/http:/www.lightworksvt.com/green) It’s in Vermont, but they ship anywhere.\n\n"
    },
    {
      "time": " 7.Nov.2007 1.50am",
      "content": "Realistically, green advertising/promotion is just hype. And converting to green is all about money. Corporations that have been raping the plantet for years are paying services to make them appear as if they are green. Seen a car commercial on TV lately?\n\nPrinting is not green; it is one of the most wasteful industrial processes there is. Soy!!! They are cutting down the Amazon Rain Forest (the lungs of the planet) to grow soy. Soy inks are “aggressive” to ink rollers, resulting in their early replacement. Come on folks. Care about the Earth, not about what it is hip to care about. Do some research before jumping on the band wagon.\n\nGerald\n\n"
    },
    {
      "time": " 7.Nov.2007 7.13am",
      "content": "Hi Gerald, interesting comment. What in your opinion actually makes a difference when it comes to green printing? Does paper choice matter? Or anything else?\n\nMany thanks!\n\nmax\n\n"
    },
    {
      "time": " 7.Nov.2007 5.01pm",
      "content": "I’ve done a great deal of research on the topic. While Gerald makes a valid point about many, many corporations, I know there are truly green options available for printing.\n\nUV Curable Inks are the most environmental option, soy clearly isn’t a sustainable choice. Water based UV curable inks produce no VOC’s (which about 99% of all other inks produce) which have been proven to accelerate climate change AND bring harm to human health.\n\nUV Curable inks are widely available in Europe, but harder to find in the US. (BTW, the link that Alaskan posted above is a printer that offers them.)\n\nThe best paper option is TCF (Totally Chlorine Free) but it’s real hard to find in the US. Dioxin is a by-product of chlorine bleaching, and it’s an evil toxin that kills flora, fauna and humans. (It’s the chemical that almost killed President Viktor Yushchenko during an assassination attempt.) Chlorine bleaching also uses copious amounts of water.\n\nAs far as other substrates, stay away from PVC. When PVC is discarded, burning it produces nasty chemicals into the environment.\n\nEileen\n\n"
    },
    {
      "time": " 7.Nov.2007 8.24pm",
      "content": "max\n\nInteresting question. Paper has been fairly okay for quite some long time, ever since the paper mills discovered that acid-free papers were cheaper to produce in the long run. Acid ate the pipes. The ink manufacturers comply with federal guidelines and respond to consumer demand (not always so good, re: soy). Solvent manufacturers are really on top of it and have discontinued useful products and substituted green crap that actually destroys rollers and presses. So, basically, you get what you want and are willing to pay for, for better or worse.\n\nWhat about the printer? Hey, folks who claim they are green just to get your green, come on. What ever happened to folks who would guarantee you quality printing?\n\nGerald\n\nThe Bieler Press  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20071108215513/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": " 7.Nov.2007 9.19pm",
      "content": "I am not prepared or willing to recommend any printer because of how “green” they are. I share Gerald’s skepticism about the current bandwagon everyone seems mad to jump on; I’m sure you’ve heard the term “greenwashing”.... I’m past the idealistic stage (my 20’s) where everything had to be ideologically pure. Give me real green solutions, like riding a bicycle, or not printing anything in the first place.... ;)\n\nHowever I have a local printer who has a fantastic range of processes he offers. From Intaglio etching to letterpress (large old cast-iron standing press), to offset, puff ink, screen print, vinyl plotting, he’s very interested and capable. Very pleasant to work with and his dogs are adorable to boot. But Eileen, you give absolutely no clue where you are, so I’m not sure if this printer is for you.... Why do you ask? In any case, it’s John Sullivan at Logos Graphics in San Francisco. To locals, I recommend him heartily; he likes working with artists and designers.\n\n"
    },
    {
      "time": " 7.Nov.2007 10.10pm",
      "content": "Eileen, thanks for the informative post. While I’m sure Gerald is right about the impure motives of many businesses, I still see wisdom in researching the most ecologically friendly approaches to printing and supporting them.\n\n"
    },
    {
      "time": " 7.Nov.2007 11.49pm",
      "content": "I’ve not met John Sullivan but I do know somewhat of his efforts and activities and would back that recommendation.\n\nGerald\n\n"
    },
    {
      "time": " 8.Nov.2007 3.57am",
      "content": "Thanks for the insights, Gerald. Will think about this before the next print job and also tell my students about it.\n\nMax\n\n"
    }
  ]
}
