{
  "id": "37441",
  "title": "Another new font | Otra nueva fuente",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "¿Cómo andan?  \nAcá dejo una imagen de una nueva fuente en la que empezaría a trabajar. Antes de empezar me gustaría saber su opinión. ¿Creen que podría estar buena? ¿Piensan que tiene futuro?. Lo que sea que opinen me gustaría escuchar. Mil gracias a todos\n\nJuan Pablo del Peral\n\n\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*\n\nHow is it going guys?  \nHere I post a image of a new font (in the future). I prefer to hear your opinion before keep working. Do you think that it's good, that it has future?. Whatever you think let me know. Thanks again!\n\nJuan Pablo del Peral\n\n ![](http://web.archive.org/web/20150125063710im_/http:/typophile.com/files/prueba-espacio-eme2_6416.gif)\n\n",
  "author": "juandelperal",
  "time": "24 Sep 2007 — 11:21am",
  "uid": "14370",
  "comments": [
    {
      "time": "24 Sep 2007 — 11:49am",
      "content": "very fun!\n\n"
    },
    {
      "time": "24 Sep 2007 — 11:54am",
      "content": "ping!! great!\n\n"
    },
    {
      "time": "24 Sep 2007 — 1:02pm",
      "content": "Thanks Guys!\n\n"
    },
    {
      "time": "24 Sep 2007 — 2:38pm",
      "content": "Hola Juan Pablo,\n\nTu fuente me gusta mucho. Se ve súper interesante. Por alguna razón la asocio con las letras que salían en las comiquitas de la pantera rosa. ¿Podrías publicar más ejemplos de frases con los caracteres que llevas hechos hasta ahora?. Si me permites, a continuación mi opinión: Tengo la impresión que la \"e\" empuja demasiado hacia a la derecha. Aunque se me hace que podrías dejarla así como está si tuerces un poquito los ascendentes de \"b\" \"b\" \"d\" \"l\" \"h\". Las descentes de \"p\" y \"q\" también las veo muy rígidas. Creo que si logras la soltura que tiene “a” podrías reafirmar esa intención de espontaneidad que estás buscando.\n\nSaludos desde Bogotá, Colombia.\n\n—  \nCarlos Fabián Camargo G.\n\n"
    },
    {
      "time": "24 Sep 2007 — 4:35pm",
      "content": "This font is definitely a GO... I normally don't like playful fonts, but this one looks really good. Cartoonish. It reminds me of my youth when I was watching cartoons and type in those was obviously very playful like this one is. But still non-intrusive... like some are... Like Comic sans perhaps... ;)\n\nSo. All I can say is: DO IT. Not plenty of these around. And of this quality. And I also suggest you make an even more playful version of it with less baseline bound letters. And some slant/rotation variation.\n\n"
    },
    {
      "time": "25 Sep 2007 — 12:13pm",
      "content": "[I'll write this post mixing spanish & English. Sorry for the mix, and for this poor english.]\n\nCarlos, muchas gracias por tu ayuda. Estoy de acuerdo con tus comentarios. Pienso que hilando fino se pueden encontrar esos problemas y otros muchos más. Pienso que voy a hacer esta tipografía en esta versión (medio «Cartoonish», me gustó el calificativo) y otra más orientada a texto, probablemente serif o al menos con remates sugeridos (similar a Pascal u Óptima).\n\n\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*-\\*\n\nLitera, Thanks a lot for your help. I hope to make this font in the future, but first I have to finish my first typeface: kalidoscopio, maybe I'll do a text version of this. Regards!\n\n"
    },
    {
      "time": "6 Mar 2008 — 10:47pm",
      "content": "Hola Juan, Tiempo sin pasar por aquí. ¿Cómo va tu fuente?.\n\nSaludos,\n\n—  \nCarlos Fabián Camargo G.\n\n"
    },
    {
      "time": "17 Mar 2008 — 5:50am",
      "content": "Fabián. La verdad que me enfoqué demasiado en terminar mi primera fuente. En cuanto tenga noticias subo algo para que me den una mano. Seguimos en contacto\n\n"
    },
    {
      "time": "23 Mar 2008 — 4:40pm",
      "content": "love it. let me know when it's ready!\n\n"
    }
  ]
}
