{
  "id": "37442",
  "title": "What shouldn't be missed in NY?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'll have a couple of days in NY next month - what should I make sure I don't miss typewise, or designwise?\n\nAlso, where will be the best place to see the Rugby World Cup final - an Aussie bar maybe?  \n(Will have the family with me, so somewhere not too rough!)\n\nThanks\n\n",
  "author": "steve_p",
  "time": "24 Sep 2007 — 11:28am",
  "uid": "1717",
  "comments": [
    {
      "time": "24 Sep 2007 — 11:36am",
      "content": "MoMA is a must see. The NYC Library has a fabulous rare books collection.\n\nChrisL\n\n"
    },
    {
      "time": "24 Sep 2007 — 1:18pm",
      "content": "_Also, where will be the best place to see the Rugby World Cup final - an Aussie bar maybe?_\n\nThere's a place called [Nevada Smith's](http://web.archive.org/web/20131108192401/http:/grahamecurtis.com/nevadasmiths/main.html) near NYU that might be showing the game. They're more of a soccer (football) place, but give them a call and check.\n\nAs far as type and design wise...there are some great rare graphic design and type specimen bookstores in the design area of Manhattan. There's one I went to recently that is appointment only, I'll post the info as soon as I can find the business card.\n\nI abhor this place because I used to work there (and the people who run the place are scumbags, but that's a whole 'nother story) but it is a great bookstore where you can find some gems. It's almost mandatory that you stop by [Strand Books](http://web.archive.org/web/20131108192401/http:/www.strandbooks.com/). They have a rare book floor you can check out there too.\n\nYou can find all kinds of design and type goodies in Manhattan from 14th Street to around 32nd from 5th Ave to 10th Ave (I know that's a large radius). [Center for Book Arts](http://web.archive.org/web/20131108192401/http:/www.centerforbookarts.org/) has some good info from time to time...give them a call and see if there are any type related workshops going on. I got to handset Univers one day during a workshop, which was pretty cool.\n\n"
    }
  ]
}
