{
  "id": "37459",
  "title": "Thoughts on Teimer?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Not to start another Best Legible Didone thread, but:\n\nLooking for a substitute for Bodoni MT Book in a 170-year-old scholarly journal. As you know Bodoni (even MT Book) is not ideally legible in small print on white and slightly glossy paper. I was wondering about [Teimer Antiqua](http://web.archive.org/web/20131017110726/http:/www.suitcasetype.com/page.php?lmut=en&section=font&font=teimer%20Std%20OT). Only thing that worries me is that it would have to be set even smaller, at least nominally (9?) if it isn't to take up too much space compared with MT Bodoni 10/12, on 12 cm lines. And wide letterforms might otherwise produce awkward spacing or word division, and so on.\n\nI have also toyed with the usual distinguished substitutes, Storm's Walbaum, Hoefler's Didot, Licko's Filosofia, even Paperback from House Industries, which is actually an excellent didone, despite its understated name. Love them all but in each one my editorial board finds something just too special for academic work (especially in the figures), or just too different from the usual face. Kepler, conversely, is certainly well crafted and well behaved but what's the use of having a didone if it looks so dull? (I admit I haven't actually seen a good print-out of it).\n\nOther tempting possibilities, with somewhat similar proportions and none of the offending peculiarities, but further removed : FB Whitman, FF Scala, Utopia.\n\nTeimer could make everyone happy, since it's actually even closer than Bodoni to the Didot we started off with in 1839. So does anyone here have any experience setting text in Teimer, or any further suggestions? Thanks in advance.\n\n",
  "author": "MHSmith",
  "time": "24 Sep 2007 — 1:57pm",
  "uid": "14427",
  "comments": [
    {
      "time": "24 Sep 2007 — 2:21pm",
      "content": "Don't forget about ITC Bodoni, the most comprehensive digitization of Bodoni with [6](http://web.archive.org/web/20131017110726/http:/www.fontshop.com/fonts/downloads/itc/itc_bodoni_six/), [12](http://web.archive.org/web/20131017110726/http:/www.fontshop.com/fonts/downloads/itc/itc_bodoni_twelve/), and [72](http://web.archive.org/web/20131017110726/http:/www.fontshop.com/fonts/downloads/itc/itc_bodoni_seventy_two/) pt. cuts.\n\n"
    },
    {
      "time": "24 Sep 2007 — 2:23pm",
      "content": "Dude, I can understand something goes wrong, but 15 posts!? We really don't need the extra work. Please be a little more careful next time. :^/\n\n"
    },
    {
      "time": "24 Sep 2007 — 2:40pm",
      "content": "Excuse me for my reply sounding more annoyed than I actually was. I should've known better. Please accept my apologies.\n\n"
    },
    {
      "time": "24 Sep 2007 — 3:45pm",
      "content": "Yes, ITC is another one I tried: a serious possibility, but in 10 points, compared with MT book I find the 6 pt cut too wide and thick (fine for footnotes though), and the 12 pt a wee bit too narrow and contrasted...\n\nP.S. I should have mentioned my current favourite is Teimer's Antiqua **Light** (lower contrast than Regular).\n\nSorry again, Yves, and thanks for cleaning up the mess. (But editing does have one or two strange side-effects.) And as long as your photo keeps smiling, you can't sound too cross.\n\n"
    },
    {
      "time": "26 Sep 2007 — 8:30am",
      "content": "There's also Frutiger's Iridium. A didone built for photocomp (so it can handle digital).\n\nAny modern face is going to become unreadable below a certain pointsize. Is it necessary to have a modern, just because it's an old journal? Couldn't you switch to something more Scotch, which still looks \"olde fashioned\" but isn't so harsh? Look at some of the faces FontBureau have for newspaper setting.\n\n"
    },
    {
      "time": "27 Sep 2007 — 12:40pm",
      "content": "Carl, many thanks for Iridium, I had never looked at it closely, it really is interesting. Pity it lacks proper small caps, but very tempting all the same.\n\nActually I would like to find something reasonably close to a didone BUT more contemporary and legible, so as to lure the more traditional members of the board away from ye anciente looke without their even noticing. As you know, legibility/readability is difficult to explain, as soon as you mention it people start looking hard at the letters instead of just reading them. If I could choose off my own head, I would just as well go for something completely different, like say... Beorcana. Cheers!\n\nMarc\n\n"
    },
    {
      "time": "27 Sep 2007 — 1:01pm",
      "content": "Storm Walbaum. It has the small caps you desire and is a text cut.\n\n"
    },
    {
      "time": "28 Sep 2007 — 10:36am",
      "content": "A few other options that are more removed would be Mercury or Chronicle from [Hoefler & Frere-Jones](http://web.archive.org/web/20131017110726/http:/www.typography.com/).\n\n"
    },
    {
      "time": "2 Oct 2007 — 2:16am",
      "content": "Thanks for all your suggestions (Chronicle also looks good). So it seems Teimer isn't in the top ten yet... maybe a further reason to try it out. Cheers.\n\n"
    }
  ]
}
