{
  "id": "37485",
  "title": "(x) Italy, early 1900 serif face - Ronaldson Oldstyle {Akira}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Good morning fellows, I come from the Dingbatdepot Forum after suggestion by other members, as my question seems to be a pretty hard one to answer to (even though I figured it was very easy, unlucky me!).\n\nI would like to find a font file similar to the one shown in picture. It was a font type WIDELY used in Italy (and elsewhere) in technical and scientific books preminently, but in other literature as well, from late 1800 to 1930 approximately. Oddly enough, nobody seem to remember the name.\n\nPlease note the aspect of capital letters, L, E and C in particular, with that kind of nice diagonal “arrows” as serifs. The look of lowercase letters is less important.\n\n[http://img146.imageshack.us/img146/3928/fonthoepliyk3.jpg](http://web.archive.org/web/20080821133802/http:/img146.imageshack.us/img146/3928/fonthoepliyk3.jpg \"http://img146.imageshack.us/img146/3928/fonthoepliyk3.jpg\")\n\nMany thanks for your help, I really appreciate it.\n\n [‹ It must be Indiana Jones](http://web.archive.org/web/20080821133802/http:/www.typophile.com/node/42254 \"Go to previous forum topic\") [(x) Grotesque on Joy Division \"Unknown Pleasures\" back cover - Univers/Helvetica {Lex, Charles Grant} ›](http://web.archive.org/web/20080821133802/http:/www.typophile.com/node/42233 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821133802/http://www.typophile.com/user/22127\" title=\"View user profile.\">highinfidelity</a>",
  "time": "<br>",
  "uid": "22127",
  "comments": [
    {
      "time": " 25.Sep.2007 3.18am",
      "content": "Probably it’s Ronaldson Oldstyle.\n\nRebecca from Canada Type is digitizing it now and Patrick from Canda Type said to me, “ Ronaldson will be ready some time this autumn, hopefully”.\n\n"
    },
    {
      "time": " 25.Sep.2007 3.36am",
      "content": "Ah yes, you got it at first shot! I have found this other thread by performing a free search after your post, and the font shown there looks pretty much the same (if not identical):\n\n[http://www.typophile.com/node/19769](http://web.archive.org/web/20080821133802/http:/www.typophile.com/node/19769 \"http://www.typophile.com/node/19769\")\n\nI wonder how they are progressing with their work... Do they read this Forum on a regular basis, or would it be recommendable for me to write to them and let them know that I am interested as well?\n\n"
    },
    {
      "time": " 25.Sep.2007 3.47am",
      "content": "I think they don’t read this forum on a regular basis.\n\nSo I suppose you should try to write them if you like.\n\n"
    },
    {
      "time": " 25.Sep.2007 5.29am",
      "content": "Quite OT, but your sample is from the Artusi kitched book!!  \nFor the non-Italian, it’s a milestone of the Italian cooking style and very useful still today (it’s from the early 1900s).\n\n"
    },
    {
      "time": " 25.Sep.2007 5.59am",
      "content": "Not exactly, it’s from “Il pasticcere e confettiere moderno”, Ciocca A., Hoepli, Milano 1921.\n\nBut browsing here and elsewhere now that I know the exact name, I’ve seen that the font has been actually used throughout western Europe in the twenties, and that it even went more far later. Seemingly, it was still in use quite recently (the seventies) in eastern countries like Romania.\n\nI must agree with other posters in parallel topics, that this is truly a magnificent font face, both elegant and formal, easily readable, but indeed with a spice of “deco” and a slight touch of Futurism given by those sort of arrow-shaped serifs.\n\n"
    },
    {
      "time": " 25.Sep.2007 6.16am",
      "content": "ITC Tiffany (by Ed Benguiat) was based on Ronaldson Oldstyle. One noticeable difference is that the lowercase “e” in ITC Tiffany is tilted, but there was an alternate horizontal version. The italic is quite different, too.\n\nIt’s cool that somebody is finally doing a digital version of Ronaldson Oldstyle. I think perhaps the existence of ITC Tiffany kept that from happening for a long time.\n\n"
    },
    {
      "time": " 25.Sep.2007 6.17am",
      "content": "Oh, Hello Mark, it’s a pleasure hearing from you again. If you recall (most probably not...) I purchased your “Mostra Bold” a pair of years ago. A superb font, I’m incredibly happy with it, and I’m actually planning to purchase your Mostra Heavy as well in the near future.\n\nYou’re right, ITC Tiffany looks very similar, but somewhat looses that nice “deco” touch and gets more geometrical. I will perhaps wait for Rebecca and Patrick to finish their work, and then see which of the two fits best my needs. I’m not hurrying, after all. Thank you very much for your hint, and keep up your good work!\n\n"
    },
    {
      "time": " 19.Feb.2008 7.37pm",
      "content": "Finally, a digitized version of Ronaldson Oldstyle has been released.  \n [http://www.myfonts.com/fonts/canadatype/ronaldson/](http://web.archive.org/web/20080821133802/http:/www.myfonts.com/fonts/canadatype/ronaldson/ \"http://www.myfonts.com/fonts/canadatype/ronaldson/\")\n\n"
    },
    {
      "time": " 20.Feb.2008 1.36am",
      "content": "Wow — this probably deserves an announcement on the General board. Fantastic collection of ligatures!\n\n"
    }
  ]
}
