{
  "id": "37489",
  "title": "I really need to finish this font",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello everyone,\n\nI posted some samples of \"Tramway\" a loooong time ago (at one point I even considered to stop working on it altogether), but now I really need to finish it. Soon.\n\nIt is, although not finished, already being used in a german magazine, but there's (obviously) still a lot to do. So now I'm reworking some stuff, adding some accents, I have totally messed up the spacing (I'll get to that soon), and I started with some new styles (book, black and ultra). I'm also thinking about old style and tabular figures.\n\nRight now nothing's really finished (well, at least not in detail – the overall design will, of course, stay like it is), but I thought I'd post some samples anyway. Any suggestions are, as always, highly appreciated.\n\nThanks a lot,  \nHanno\n\n| Attachment | Size |\n| --- | --- |\n| [tramway\\_new\\_01b.pdf](http://web.archive.org/web/20140713194728/http:/typophile.com/files/tramway_new_01b.pdf) | 94.22 KB |\n| [tramway\\_text.pdf](http://web.archive.org/web/20140713194728/http:/typophile.com/files/tramway_text.pdf) | 47.86 KB |\n| [tw\\_diacritics.pdf](http://web.archive.org/web/20140713194728/http:/typophile.com/files/tw_diacritics.pdf) | 126.38 KB |\n\n",
  "author": "hn2o",
  "time": "25 Sep 2007 — 4:47am",
  "uid": "4781",
  "comments": [
    {
      "time": "25 Sep 2007 — 5:14am",
      "content": "Can you please link your old thread\\_?\n\n"
    },
    {
      "time": "25 Sep 2007 — 6:01am",
      "content": "hmm, i seem to have trouble attaching the pdf…\n\nthe old thread is [here](http://web.archive.org/web/20140713194728/http:/typophile.com/node/15965)\n\nuntil i can upload the full pdf, here's an first glimpse…\n\n ![](http://web.archive.org/web/20140713194728im_/http:/typophile.com/files/tramway_new_01a_4053.jpg)\n\n"
    },
    {
      "time": "25 Sep 2007 — 7:32am",
      "content": "It looks pretty nice. Although I've seen a lot of these square sans serifs, lately. But the execution seems quite good.\n\nI don't like the lc 'y' too much (seeing it like this, I will wait for longer passages of text to judge it better), but somehow I think it will stand out a lot. Also it seems like your 's' is leaning to the left (lengthen the lower left terminal).\n\nFor more crits I will wait for a PDF. :)\n\n"
    },
    {
      "time": "25 Sep 2007 — 7:39am",
      "content": "Looks great. I think it's different enough from some of the other squarish sans that I happen to like. I agree on the lc \"y\" based on the old .pdf it stands out too much. Love the Ultra weight.\n\n"
    },
    {
      "time": "25 Sep 2007 — 8:16am",
      "content": "I agree with the bold \"y\" issue, and add the regular \"p\" to it. Those two oblique cuts seem unnecessary, or worse : accidental.\n\n"
    },
    {
      "time": "25 Sep 2007 — 8:19am",
      "content": "Since I somehow can't attach the pdf, I uploaded it [HERE](http://web.archive.org/web/20140713194728/http:/www.hn2o.de/tramway_new_01.pdf). You'll see, there's still a lot of work ahead. I didn't include all styles in the pdf, but will add them as soon as possible…\n\nThanks for your comments. I know, there's a LOT of squarish sans out there. I don't think it was quite like that, when I started drawing this one. It's good to hear that you think it's different enough, that's what I hoped for. I was trying to retain a certain \"sturdiness\" that, I think, sets it apart from other squarish fonts, which, for my taste, are often too clean and quiet. I think I wanted a small hint of early grotesks, not in style, but in spirit ;-)\n\nConcerning the lc \"y\": There will definitely be two versions, one will be \"normal\" and should be used in text setting. The magazine I mentioned doesn't use the straight \"y\" at all, but I still like it and want to keep it as an option.  \nI'll see what I can do about the \"s\", it's been bugging me for some time now.\n\nI hope you'll be able to see the pdf now…\n\n"
    },
    {
      "time": "25 Sep 2007 — 8:57am",
      "content": "Ah, I wasn't paying attention before, I overlooked the 'regular' 'y'. That one looks fine. The only realy problematic character I see now, is the 's'.  \nI think it could be a little bit smaller (_really little_ bit), and the lower terminal should probably be extended by a couple of units. Or the upper left 'shoulder' could be shifted to the right a bit.\n\nAnd I agree that it is different enough, I was just observing the fact that squarish sans serifs are quite popular at the moment. :)\n\nP.s. about inserting the PDF in your first post, what does not work? Doesn't it upload, or doesn't it show? If it doesn't show, try browsing for the file, and submit instead of add. I guess it would be best for clarity if the PDF is in the first post (I always want to anyway). :)\n\n"
    },
    {
      "time": "25 Sep 2007 — 10:16am",
      "content": "I'm not really sure what the problem with the upload was… it said \"uploading\" for half an hour. But I'll try again.\n\n"
    },
    {
      "time": "27 Sep 2007 — 12:10am",
      "content": "this time it worked… a first pdf is available above. i'll post more as soon s possible.\n\n"
    },
    {
      "time": "8 Oct 2007 — 6:23am",
      "content": "I did some work on the lc s. Is it still leaning to the left…?\n\n ![](http://web.archive.org/web/20140713194728im_/http:/typophile.com/files/tw_new_s_4354.jpg)\n\n"
    },
    {
      "time": "8 Oct 2007 — 8:09am",
      "content": "Only very little.\n\n"
    },
    {
      "time": "9 Oct 2007 — 5:24am",
      "content": "Nice work. I think the upper part of lower case g could use a little push to the right, it´s now leaning slightly. And maybe I´d make the ear just a little bigger in the Light to Regular. Also, the contrast on N is reversed\n\n"
    },
    {
      "time": "10 Oct 2007 — 7:55am",
      "content": "I did some more work on the lc s and g. and here's also some lc letters from the ultra style. I'll post more when I finally figure out why I can't upload pdfs (except one time)…\n\nThanks a lot for all your comments…\n\n ![](http://web.archive.org/web/20140713194728im_/http:/typophile.com/files/tw_r_gssample_4403.jpg)\n\n ![](http://web.archive.org/web/20140713194728im_/http:/typophile.com/files/tw_u_lc_5656.jpg)\n\n"
    },
    {
      "time": "10 Oct 2007 — 9:51am",
      "content": "I think the 's' still leans to the left, slightly. Even less than last time, but still... :)\n\nEither shift the top-left 'shoulder' to the right a little, or make the lower-left terminal extend to the left further.\n\n"
    },
    {
      "time": "11 Oct 2007 — 4:20pm",
      "content": "Well. To my point of view the \"s\" is almost a bit italicised to the right. I'd keep it the way it is at this moment, because I guess it's fine. If we'd see some smaller text block it'd be easier to spot those differences. In a PDF of course so anyone can make things bigger if needed.\n\nRegardin the \"g\": In the regular/lighter version the top bowl could go a bit more to the right. In the heavy/ultra weight it's perfect. But the whole font looses much of its original character.\n\n"
    },
    {
      "time": "11 Oct 2007 — 4:22pm",
      "content": "\\> _Well. To my point of view the “s” is almost a bit italicised to the right._\n\nReally? That's interesting.  \nOptical illusions are weird.\n\n"
    },
    {
      "time": "30 Oct 2007 — 1:11pm",
      "content": "Hi everybody,\n\ni did some refinements and started working on the spacing again, and this time i managed to upload a pdf with running text… (i had to use opera, in safari and firefox the pdf didn't show – i have no idea why)\n\nwell, any comments?\n\nthanks,  \nhanno\n\n"
    },
    {
      "time": "30 Oct 2007 — 6:31pm",
      "content": "I like it. Really consistent looking. The 's' is still a bit out of style.  \nI will try to make a more constructive post later. :)\n\n"
    },
    {
      "time": "31 Oct 2007 — 11:33am",
      "content": "I like your typeface. Following the Quincunx comments about the s, here the mine. After a closer look of the s and the a, did you try to use the same angle of the top of your a bowl? I think this way could be a solution for that s. It spin seems too horizontal compare to the top bowl of the a. Good work.\n\nAndré\n\n"
    },
    {
      "time": "15 Nov 2007 — 7:17am",
      "content": "Hanno,\n\nI think this face is looking really great. It has a very even color on the page. There aren't any characters that really jump out at me. I think you have a very solid design here. By the way, I liked your other typeface you did, was that a school project, or an actual job?\n\nBest regards,\n\n- Chris\n\n"
    },
    {
      "time": "2 Dec 2007 — 5:02pm",
      "content": "hey everybody,\n\nI did some work on the diacritics and posted a new pdf. Sadly, I have to finish quite a lot of them really soon, so any suggestions are highly appreciated. Thanks in advance.\n\nChris, if you're talking about the \"Subtil\"-typeface, that, fortunately, was a real job. I'm glad you like it. It is a logotype for the public services of the City of Dortmund. If you're interested, there are some pictures on my homepage. I#ll try to take some better photographs in the future, but you can get a little impression of how it's used.\n\nHanno\n\n"
    },
    {
      "time": "6 Dec 2007 — 7:01pm",
      "content": "Hanno,\n\nYes, I was referring to the \"Subtil\" typeface. Nice work.\n\nBack to Tramway - I am not qualified to comment on your diatrics, but again, the face seems very solid. The only character that bothers me is the \"j\" glyph. The descender seems so sharp, to a point of distraction, but maybe it's just me. I would love to see it rounded out along the bottom.\n\nAre you planning on releasing this for public licensing or is this a comissioned typeface?\n\nBest of luck,\n\n- Chris\n\n"
    },
    {
      "time": "7 Dec 2007 — 8:13am",
      "content": "I was just checking the last PDF, and I like it a lot overall. But when I look at the page and not focus my attention on any particular part, I think there are some minor issues with weight distribution here and there.\n\nFor example, the bowls of 'd p b' seem a bit heavy, in comparison to other letters. It's only small differences, but to me they stand out. The weight in the 'y' is also a bit off, I think. The right stroke should be a wee bit thinner than the left stroke. Also, but I'm not sure, the horizontal bar in the 'k' could be a couple of units thinner? And I agree with Chris about the 'j'. Maybe a terminal similar to that of the 'y' might work.\n\nWell just a global observation. It's coming together nicely. :)\n\n"
    },
    {
      "time": "31 Oct 2008 — 7:01am",
      "content": "Hanno, how is this project coming? It truly is a nice typeface, would love to see it released into the wild. Best of luck.\n\n"
    },
    {
      "time": "31 Oct 2008 — 7:25am",
      "content": "It's looking clean and indeed great. But, it is **very** close to a lot of other typefaces of \"today\". This squarish style has really made an impact on people, both designers, and type designers :)\n\n"
    },
    {
      "time": "31 Oct 2008 — 11:14am",
      "content": "This is really neat. Somehow the medium weight has echoes of other fonts (Meta and/or Miles Newlyn's Modena) but probably better for text than either.\n\nIt is very current with other fonts but I don't know anything with quite the same appeal.\n\n"
    },
    {
      "time": "17 Nov 2008 — 1:32pm",
      "content": "Hi everybody,\n\nit's great that you're all still interested. It looks like Tramway is going to be released in the near future, if all goes well by a foundry I respect tremendously. Therefore I've been working hard to get rid of minor flaws and, most of all, expand the character set, you can see the preliminary results in the attached picture.\n\nI'm aware that there are many fonts in the same area, but when I started this about five years ago, I don't think it was quite like it is today. I thought about giving up several times, but people kept asking for Tramway, so I thankfully kept going. I still think there's something unique about it (I don't even like many current squarish sans serifs - maybe that helps :-)).\n\nSome selected clients are alreday using Tramway, I put together some examples…\n\n ![](http://web.archive.org/web/20140713194728im_/http:/typophile.com/files/TW_Character_Set_Nov08_5477.jpg)\n  \n\n ![](http://web.archive.org/web/20140713194728im_/http:/typophile.com/files/tw1_6288.jpg)\n\n ![](http://web.archive.org/web/20140713194728im_/http:/typophile.com/files/tw2_4155.jpg)\n\n ![](http://web.archive.org/web/20140713194728im_/http:/typophile.com/files/tw3_6665.jpg)\n\n"
    },
    {
      "time": "22 Nov 2008 — 2:30pm",
      "content": "Those are some really good looking applications, hn2o. Kudos on finally getting it released!\n\n- — - — - — - — - — - — - — -  \nWill food for type.\n\n"
    },
    {
      "time": "28 Nov 2008 — 10:22am",
      "content": "Congratulations Hanno. Looking forward to seeing this available to the public. I love this \"genre\" of type, and this is a very solid addition to that group. I have to say though, the ONLY glyph that bothers me is the \"Q\" the tail is distracting in my opinion. Any reason you've chosen the vertical treatment?\n\n"
    },
    {
      "time": "12 Mar 2009 — 6:43am",
      "content": "Wow! When are you starting your own type foundry?\n\n"
    },
    {
      "time": "16 Mar 2009 — 6:19am",
      "content": "I'm currently working on a website to present all my typedesigns, even if most of them are still unfinished. Concerning this typeface, I think I've found a great place to publish it (as soon as possible) as well as [Rekord](http://web.archive.org/web/20140713194728/http:/www.typophile.com/node/40757).\n\nI'm working hard and will post updates on the development soon.\n\nCheers,  \nHanno\n\n"
    }
  ]
}
