{
  "id": "37529",
  "title": "Another logo disaster - Wolff Olins on a roll with Wacom!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "First the London 2012 logo and now this!\n\n ![](http://web.archive.org/web/20090802163738im_/http:/typophile.com/files/wacom_logo_3499.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [wacom\\_logo.gif](http://web.archive.org/web/20090802163738/http:/typophile.com/files/wacom_logo.gif) | 9.69 KB |\n\n",
  "author": "<a href=\"/web/20090802163738/http://typophile.com/user/17602\" title=\"View user profile.\">belleisle</a>",
  "time": "<br>",
  "uid": "17602",
  "comments": [
    {
      "time": " 26.Sep.2007 6.33am",
      "content": "omg.\n\n"
    },
    {
      "time": " 26.Sep.2007 7.06am",
      "content": "Take 2 tablets and call me in the mourning.\n\nChrisL\n\n"
    },
    {
      "time": " 26.Sep.2007 7.19am",
      "content": "I predicted it in 1992 - Corel Draw would rule the world!\n\n"
    },
    {
      "time": " 26.Sep.2007 7.26am",
      "content": "Corel-a DeVille :-)\n\nChrisL\n\n"
    },
    {
      "time": " 26.Sep.2007 7.29am",
      "content": "there is very little about that logo that isn’t ghastly, you’d have thought that a company like wacom would have more stylus\n\n"
    },
    {
      "time": " 26.Sep.2007 7.31am",
      "content": "Or at least a pendant for style.\n\nChrisL\n\n"
    },
    {
      "time": " 26.Sep.2007 7.49am",
      "content": "This was on Design Observer yesterday. I think the type is ok but that “Color Thing” is nuts. Is it a bunch of styli coming together?\n\n"
    },
    {
      "time": " 26.Sep.2007 10.27am",
      "content": "I’ve been using a Wacom stylus for almost 20 years, and upgrade when necessary. That is, when the old one which was functioning perfectly well with all the functionality I needed is rendered obsolete by operating system changes; it’s part of the feature bloat “conspiracy” to keep milking purchasers by turning them into perpetual clients.\n\nWhen I had to get the “Intuous” version, it came with a big fat “kiddy” stylus, so I sensed that I was no longer part of the company’s main market. Not really a big piss-off now, just a minor inconvenience, as I move up the demographic age categories and become less and less relevant to this kind of product developer.\n\nSo yeah, it’s a pseudo-60s kitsch kiddy popcult kind of logo, so what.\n\n"
    },
    {
      "time": " 26.Sep.2007 11.22am",
      "content": "Nah, it’s just ugly?\n\n"
    },
    {
      "time": " 26.Sep.2007 11.25am",
      "content": "also discussed over at brandnew:\n\n[http://www.underconsideration.com/brandnew/archives/that\\_wacky\\_wacom.php](http://web.archive.org/web/20090802163738/http:/www.underconsideration.com/brandnew/archives/that_wacky_wacom.php \"http://www.underconsideration.com/brandnew/archives/that\\_wacky\\_wacom.php\")\n\n"
    },
    {
      "time": " 26.Sep.2007 11.31am",
      "content": "The “Color Thing” looks like an ad for a brushed metal wart remover that comes in “designer” colors. How can a client go for such a thing? I’ve seen better looking nose hair.\n\nChrisL\n\nPS: the type thing is fine though\n\n"
    },
    {
      "time": " 26.Sep.2007 12.23pm",
      "content": "Nick, I would’nt mind also if it was any of the 60s kitsch etc kind of logo you describe.  \nI do mind however, that like the 2012 logo, yet again, WO have fallen considerably short of basic design standards.\n\nA well constructed ’popcult kind of logo’ would have been great.  \nAs ’brandnew’ says, they might even have constructed a logo that demonstrates the unique qualities of the product itself.\n\nBut instead they design this.\n\nPity the poor designer who has to incorporate this logo into their next project.\n\n"
    },
    {
      "time": " 26.Sep.2007 2.16pm",
      "content": "is this a bit like odvertising. It got people talking, upping the company profile in no time. So maybe not such a bad logo in the mean timeI guess the product is all about fun. The designers are tripping on something. They can remove a few elements and the logo might be kind of normal. Clever or just bad design\n\n"
    },
    {
      "time": " 26.Sep.2007 2.23pm",
      "content": "_odvertising_\n\nIs this a new meme?\n\n"
    },
    {
      "time": " 26.Sep.2007 2.49pm",
      "content": "Oddvertising.\n\n"
    },
    {
      "time": " 26.Sep.2007 3.11pm",
      "content": "or oddvertising, bizarre adverts in the 80’s that got people talking. Do you remember and ad by outpost.com firing gerbals out of cannons.  \n [http://www.youtube.com/watch?v=4hny1JSsZII](http://web.archive.org/web/20090802163738/http:/www.youtube.com/watch?v=4hny1JSsZII \"http://www.youtube.com/watch?v=4hny1JSsZII\")\n\nmore ones in advertising\n\n[http://www.ciadvertising.org/student\\_account/fall\\_00/adv382j/christiana/...](http://web.archive.org/web/20090802163738/http:/www.ciadvertising.org/student_account/fall_00/adv382j/christiana/theory/page/oddvertizing.html \"http://www.ciadvertising.org/student\\_account/fall\\_00/adv382j/christiana/theory/page/oddvertizing.html\")\n\n"
    },
    {
      "time": " 26.Sep.2007 6.17pm",
      "content": "... _Corel Draw would rule the world!_\n\nand what does Corel have to do with it? CorelDraw doesn’t kill good taste - People do.\n\n:-)\n\n"
    },
    {
      "time": " 26.Sep.2007 6.45pm",
      "content": "Glad you took a shot at that one, Russ. :-)\n\nChrisL\n\n"
    },
    {
      "time": " 26.Sep.2007 8.15pm",
      "content": "hee hee\n\nif one of my students had turned that logo in, they’d... never mind. one of my students would never have turned in a logo like that!\n\n"
    },
    {
      "time": " 27.Sep.2007 12.07am",
      "content": "It’s...a Spathi Eluder.\n\n ![](http://web.archive.org/web/20090802163738im_/http:/typophile.com/files/spathiship_4390.png)\n\n"
    },
    {
      "time": " 27.Sep.2007 12.25am",
      "content": "Wolff Olins, please take me in. I can design 50 logos per day.\n\n"
    },
    {
      "time": " 27.Sep.2007 2.35am",
      "content": "I just visited Wacom.com, lets just say, the logo bouncing around really doesn’t help. I also found it way more difficult, even than before, to find their product list.\n\n"
    },
    {
      "time": " 27.Sep.2007 3.10am",
      "content": "You had me for a minute there, chiefdzp.  \nMaybe I had missed it, it is a great post-2012, double bluff.  \nBad logo = free publicity etc etc etc...\n\n...but no they seem serious. see for yourself at [www.wacom.com](http://web.archive.org/web/20090802163738/http:/www.wacom.com/ \"www.wacom.com\")\n\nbut wait, maybe this awful logo gets ’repaired and retouched’ by the wonderful product that is a Wacom tablet, over the coming weeks.\n\nSomeone let me know I was to bored to get to end to end web animation find out.\n\n"
    },
    {
      "time": " 27.Sep.2007 3.26am",
      "content": "think vector purple people eater... yukie\n\n"
    },
    {
      "time": " 27.Sep.2007 5.42am",
      "content": "As David (Nickel) says, [the logo bouncing around](http://web.archive.org/web/20090802163738/http:/global.wacom.com/) doesn’t help at all. I don’t think it is a logo but more of a mascot (Wolff Olins will have given ’it’ a name of some sort). It seems to appears on every page of the website but isn’t anywhere near the logo.\n\nAnyway, looks like WO have been smart enough to be able to ditch the thing when everyone is sick of it (which shouldn’t be too long now).\n\nThe new brand appears to incorprate sound too. Listen to the website for a bit and the four notes/chords cast an Oriental spell that will gently send you off to sleep which is fine unless you have a deadline, in which case why are you reading this?\n\n"
    },
    {
      "time": " 27.Sep.2007 6.31am",
      "content": "so, anyways...anyone have one of the new Bamboo tablets? They appear to be selling for $80. Sounds like a great price.\n\n"
    },
    {
      "time": " 27.Sep.2007 7.20am",
      "content": "Another Wacom, sockum logo, it just doesn’t git eeny bitter thin that!\n\nChrisL\n\n"
    },
    {
      "time": " 27.Sep.2007 7.31am",
      "content": "Let’s stop talking about it.\n\n"
    },
    {
      "time": " 27.Sep.2007 8.11am",
      "content": "It reminds me of that muppet with the honking nose...\n\n"
    },
    {
      "time": " 27.Sep.2007 8.15am",
      "content": "or a 3-headed zit\n\nChrisL\n\n"
    },
    {
      "time": " 27.Sep.2007 8.28am",
      "content": "Air raid sirens.\n\n[Example 1](http://web.archive.org/web/20090802163738/http:/www1.istockphoto.com/file_thumbview_approve/970911/2/istockphoto_970911_air_raid_sirens.jpg)  \n [Example 2](http://web.archive.org/web/20090802163738/http:/www.isledegrande.com/giimages6/delherb54.jpg)  \n [Example 3](http://web.archive.org/web/20090802163738/http:/upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Nice_air-raid_siren.jpg/800px-Nice_air-raid_siren.jpg)  \n [Example 4](http://web.archive.org/web/20090802163738/http:/www.kcoem.org/Warning/FedSiren2.jpg)\n\n"
    },
    {
      "time": " 27.Sep.2007 9.10am",
      "content": "Perfect, Gus!\n\nChrisL\n\n"
    },
    {
      "time": " 27.Sep.2007 9.36am",
      "content": "Yeah, but don’t we all really wish that we got sent the check?\n\n"
    },
    {
      "time": " 27.Sep.2007 10.26am",
      "content": "SPATHI ELUDER!!!!!!!!!!!!!! heheheheh I love this logo suddenly.\n\nBTW, there is a port called Ur Quan Masters for OSX. In case you need to waste some time piloting a Mycon Podship, Thraddash Torch or Orz Nemesis. Go, go, go, intruder, bah, intruder, intruder, bah! or the mighty Pkunk Fury. Worm, idiot, loser...\n\nI digress\n\n"
    },
    {
      "time": " 27.Sep.2007 10.52am",
      "content": "Oh, that’s a sin-tique!\n\n"
    },
    {
      "time": " 27.Sep.2007 2.54pm",
      "content": "I’ve seen so much worse.\n\nOne thing about graphic design, as I often encounter here at work, EVERYONE is a designer, and EVERYONE is a critic. No matter what you do, some people will love it and some will hate it, and the ones who hate it are usually intensely righteous about thier opinion.\n\n"
    },
    {
      "time": " 27.Sep.2007 3.13pm",
      "content": "Probably another case of money talking the truth… WO must be doing something ok, reaping it in with s\\*\\*t like this.\n\nOr maybe we are all out of the loop and this is the way things are going to be from now on…\n\n\\_\\_\\_  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 27.Sep.2007 3.42pm",
      "content": "Oh, please let me stay out of THAT loop forever.\n\nChrisL\n\n"
    },
    {
      "time": " 27.Sep.2007 3.54pm",
      "content": "Or this could be a completely different company run by Bud Wolff and Billy Olins that just sounds a lot like the famous one.\n\n"
    },
    {
      "time": " 27.Sep.2007 3.57pm",
      "content": "you mean, from an evil, parallel universe?\n\n"
    },
    {
      "time": " 27.Sep.2007 4.12pm",
      "content": "Yes, from... The Twilight Zone.\n\n"
    },
    {
      "time": " 27.Sep.2007 4.53pm",
      "content": "you know, that’s what i thought, too. like the episode of Star Trek when the graphic designer gets caught in a “beam up” glitch, and is separated into TWO designers: one who uses only black and white, and the other who’s hooked on magenta.\n\n"
    },
    {
      "time": " 27.Sep.2007 5.12pm",
      "content": "We had a conversation about this one in class the other day. Even design students think that it’s a disaster.\n\n"
    },
    {
      "time": " 27.Sep.2007 6.17pm",
      "content": "Sweet mother of.... What the hell was that? I don’t normally slaughter logos before I know more about the background. Here I don’t need to. No matter the background. This is just bad design!\n\n"
    },
    {
      "time": " 27.Sep.2007 8.59pm",
      "content": "The signature is nice, appropriate and an obvious evolution from the previous wordmark. The symbol lacks most everything, but it’s actually difficult to find an application (on the website and packaging at least) that actually uses the symbol locked up with the signature.\n\nIt’s easy to blame Wolif Ollins, but few of us actually know what happened behind closed doors. I have been a part of bad client-driven design one too many times. It’s just a fact of life.\n\nEveryone is so quick to through stones.\n\n"
    },
    {
      "time": " 27.Sep.2007 9.07pm",
      "content": "\\>Everyone is so quick to through stones.\n\n\\>I just visited Wacom.com, lets just say, the logo bouncing around really doesn’t help.\n\nA moving target is harder to hit. ;-)\n\n"
    },
    {
      "time": " 27.Sep.2007 10.00pm",
      "content": "C’mon... a firm with the prestige of W-O isn’t going to be bullied into a logo like this. This was their solution to the assignment. Do you really think Wacom would call a board meeting and announce, “Okay, we found a design firm that will implement our own idea for $XX,XXX. All agreed?”\n\n"
    },
    {
      "time": " 27.Sep.2007 10.26pm",
      "content": "_I just visited Wacom.com, lets just say, the logo bouncing around really doesn’t help._\n\nIt makes me wonder if Wolff-Olins might not be a front organisation for an epilepsy research institute. I seem to recall that the first Olympics TV spot triggered a number of epileptic siezures, and the way the Wacom logo moves in and out of focus as it bounces around the screen might be a new trigger test.\n\n"
    },
    {
      "time": " 27.Sep.2007 11.04pm",
      "content": " ![](http://web.archive.org/web/20090802163738im_/http:/typophile.com/files/Honkers_4677.jpg)\n\n"
    },
    {
      "time": " 28.Sep.2007 5.21am",
      "content": "\\*lol\\*\n\n"
    },
    {
      "time": " 28.Sep.2007 5.59am",
      "content": "Just a simple reminder.\n\nSometimes the designer really has no choice.  \nThey have listened to the customer - and have given the customer what they want/expect. Even if the designer has a clearer understanding of customer from a graphics point of view - bottom line is, you give the customer what they want, you get your check, you let it clear the bank - and then you laugh. For there really isn’t anything else you can do.\n\nSorry — that’s the real world.\n\n"
    },
    {
      "time": " 28.Sep.2007 6.09am",
      "content": "Honkers, Haley, I think you’ve got it!\n\nChrisL\n\n"
    },
    {
      "time": " 28.Sep.2007 6.36am",
      "content": "_Sometimes the designer really has no choice._\n\nI don’t believe that is as true at this level of corporate identity — designer prestige and corporation prestige — as it may be on other levels. Few companies the size of Wacom would hire a firm the size of W-O and say, “We already know what we want. Just do it for us.” It’s antithetical to the process.\n\n"
    },
    {
      "time": " 28.Sep.2007 7.12am",
      "content": "Chuck - it happens almost everyday. I’m not saying in all cases. Many times a CEO has in their mind exactly what they want — and there just isn’t anyway to change that mind - know what I mean...\n\nWe come from the school of 3 choices. We design and turn over the 3 thumbprints. The one they asked for, the throwaway one and the one we are proud we created.\n\nMany of us try to believe it isn’t so... but it is. Especially when the graphic met their expectations. So sorry.\n\n(Pssst, I am speaking mostly of the NYC market - things may be different in nice hometown markets...)\n\n"
    },
    {
      "time": " 28.Sep.2007 8.02am",
      "content": "A couple people commented that the type is ok. No, it’s not. It’s predictable, typical graphic designer crap.\n\nAlthough it’s difficult to judge from the gif, I’d hazard to say that the execution is pretty amateurish. Probably no-one bothered to visually correct the thickness of the horizontal/vertical lines. The curves don’t seem to be particularly considered either, actually appearing to break. And it is certainly inspired to turn the ’w’ to make an ’m’ - not!\n\nAnd if you look closely, the ’w’ optically feels wider than the ’m’. That sort of stuff happens when you pay no attention to detail.\n\nBruno\n\n"
    },
    {
      "time": " 28.Sep.2007 8.09am",
      "content": "Jackie, I know where you are coming from, but I’m with Chuck on this one.  \nWO see themselves as the cutting edge of the London branding/rebranding scene.  \nThey don’t listen to anybody. The appalling 2012 logo proves this...\n\n"
    },
    {
      "time": " 28.Sep.2007 8.15am",
      "content": "<cite>Let’s stop talking about it.</cite>\n\nI’m with ya. We’re beating a dead horse.\n\n"
    },
    {
      "time": " 28.Sep.2007 8.17am",
      "content": "People, get with the tour.  \nThis is next-level wack-its-ill.  \nGenius.\n\n_...this is the way things are going to be from now on…_\n\n"
    },
    {
      "time": " 28.Sep.2007 8.21am",
      "content": "If it was an animated .gif, with the those protrusions pulsating and undulating, then it would go far enough over the top to be cool, I think. At least to anyone from the hippy generation. Not that I know anything about drug use in my youth; I’m just guessing.\n\n"
    },
    {
      "time": " 28.Sep.2007 8.56am",
      "content": "too bad!\n\n"
    },
    {
      "time": " 28.Sep.2007 9.06am",
      "content": "_One thing about graphic design, as I often encounter here at work, EVERYONE is a designer, and EVERYONE is a critic._\n\nEveryone is so quick to through stones.\n\nI wholeheartedly agree with these comments, as well as Jackie’s statements. I get a bit disappointed with how quick people seem to tear something to shreds. If you’ve ever had your heart ripped out when a great idea gets killed by a client, you might not be so quick to judge. There’s no arguing with the multi-millionaire, billionaire or CEO who’s fronting the bill when they want a last minute change. I know many of you know EXACTLY what I’m talking about.\n\n"
    },
    {
      "time": " 28.Sep.2007 9.28am",
      "content": "But that doesn’t make it good design? ;)\n\n"
    },
    {
      "time": " 28.Sep.2007 9.38am",
      "content": "_I know many of you know EXACTLY what I’m talking about._\n\nIn my experience, clients are usually right, and push creative to do more interesting work than standard “good design”.\n\n_good design_\n\nIs that award-winning good design, or sales-enhancing good design?  \nEither is difficult to create, both more so.  \nNon-award-winning “good design” is pretty-boring, and easily trumped by “bad design” in the sales-enhancing department.  \nFor an example close to us all:\n\n ![](http://web.archive.org/web/20090802163738im_/http:/typophile.com/files/New_6337.jpg)\n\n"
    },
    {
      "time": " 28.Sep.2007 9.54am",
      "content": "stop the bouncing\n\n"
    },
    {
      "time": " 28.Sep.2007 10.20am",
      "content": "Well, if this is the result of being pushed to do more interesting work...... ;)\n\n"
    },
    {
      "time": " 28.Sep.2007 10.30am",
      "content": "_For an example close to us all:_\n\nAhhhh, yes. A very good point. :)\n\n"
    },
    {
      "time": " 28.Sep.2007 11.10am",
      "content": "[Wolff Olins](http://web.archive.org/web/20090802163738/http:/typophile.com/wiki/Wolff%252BOlins) has let their Pantone books expire?\n\n"
    },
    {
      "time": " 28.Sep.2007 12.13pm",
      "content": " **Biddy:** _If you’ve ever had your heart ripped out when a great idea gets killed by a client, you might not be so quick to judge._\n\nJust a quick story for you Biddy - one I think you can empathize with. A dear, departed friend of mine was the art director for trade books at a very well known publishing house - long before there were computers in the bullpen. It was the days when you received lettering from the typographer, that you put together to create a logo type, you sent that off to the photo house for some transfer type of it and demand a C-print. You went out on a photo shoot and spent the wee hours of the morning going through contact sheets before the 9 a.m. publisher’s meeting — having it altogether - as a comp, so the non-design functioning minds could see what the cover of a book may possibly look like.\n\nWell, it had been just such a night, and the next morning, Madame President was having PMS. She was not happy with the design work she saw, and I guess was having a hard time verbalizing it - so she picked up her pen and stabbed his work - not just one time - but 8 holes worth. We had a very long lunch that day — and soon after he left his place of employment.\n\nAgain, real world stories for the folks that just haven’t been there - or done that! But Biddy - I know you know that I know that you know exactly what goes on... Nice meeting you fellow graphic arts survivor.\n\nP.S. I would have put this in an I/M to you - but, oops we don’t have that anymore. So I guess others can read this too!\n\n"
    },
    {
      "time": " 28.Sep.2007 12.30pm",
      "content": "Wow. Now that ripped my heart out. :(\n\nUnfortunately, freak outs of this magnitude still exist today. My main point and (I think it has been others)...you can’t look at a piece of design and EVER know the blood, sweat and tears that went into the design.\n\nIts very easy to judge from the comfort of a chair and after the work has been done. “Blood, sweat and tears” sounds like a cliché...but for those who haven’t done a lot of comps...that term can be quite literal.\n\n"
    },
    {
      "time": " 28.Sep.2007 1.17pm",
      "content": "Are you against any critique? I’m curious to know if this applies to literature, art, cooking, etc.\n\nI’m just asking. No criticism from me is to be implied. :-)\n\nSharon\n\n"
    },
    {
      "time": " 28.Sep.2007 1.19pm",
      "content": "On seeing the end result, I hope they didn’t put too much blood, sweat and tears into the project.\n\n"
    },
    {
      "time": " 28.Sep.2007 1.32pm",
      "content": "wow.\n\nI don’t know if I would ever even think to play the PMS card to describe a difficult client.\n\n"
    },
    {
      "time": " 28.Sep.2007 1.34pm",
      "content": "I think we are getting comfused about the difference in concept and the design.  \nAs is the case with the 2012 logo, I don’t think peple are critising the concept here.\n\nI’m certainly not. If WO have done their brand marketing and decided that the best way to represent a graphical hardware company is the sound coming from the trumpet like logo they have designed, who am I/we to argue (you have to visit the wacom website). In fact I think its quite interesting.\n\nWhat I don’t understand is why, like the 2012 logo, basic design skills are’nt being applied to the creation of the logo.  \nWould it be that difficult for WO to use skilled type people, as Bruno Maag has outlined above, to create some typography that does’nt already look if it is out of date, yet alone something which will prevail into the next decade. WO, is a company that prides itself on thinking differently, I’m not seeing much difference in the just launched compaq logo - So much for forward thinking ’next level’ typography.\n\nOn the same basis would it have been that difficult, if they positively must have a 3d logo, to have drawn it without using basic level illustrator filters. At least think for one moment the uses of the product we are talking about here, if nothing else.\n\nIt is will some hesitation that I have posted the 21year old Chermeyeff and Geismar NBC logo, I’m bound to have opened a can of worms. However, if only because of the colourful nature of both logos, I thought about this as being a logo that has stood the test of time. C&G would never have known what the future held in terms of digital broadcasting and yet here it is today, still every bit as relevent and stylish as when it was designed in 1986. Not bad for a simple bit of well crafted 2d artwork.\n\nAs a design industry are we creating these 3d logos because that is the best solution or simply because technology allows us to do it?\n\n ![](http://web.archive.org/web/20090802163738im_/http:/typophile.com/files/compaq_3907.gif)\n\n ![](http://web.archive.org/web/20090802163738im_/http:/typophile.com/files/NBC_6712.jpg)\n\n"
    },
    {
      "time": " 28.Sep.2007 2.12pm",
      "content": "_are we creating these 3d logos because that is the best solution_\n\n3d, color, moving.  \nEverything else is flat, dull, and static, literally and metaphorically.  \nI love this:  \n [http://www.marksimonson.com/](http://web.archive.org/web/20090802163738/http:/www.marksimonson.com/ \"http://www.marksimonson.com/\")\n\n"
    },
    {
      "time": " 28.Sep.2007 3.21pm",
      "content": "It’s just that everyone wants a fancy shiny ’web-too-point-oo’ logo these days.\n\n"
    },
    {
      "time": " 28.Sep.2007 4.38pm",
      "content": "Nick— you don’t believe that, do you?\n\n"
    },
    {
      "time": " 28.Sep.2007 7.19pm",
      "content": "The only thing different between having a static piece of puke and a moving piece of puke is that you have a greater chance of being hit by the stuff if it is moving.\n\nChrisL\n\n"
    },
    {
      "time": " 28.Sep.2007 10.07pm",
      "content": "as opposed to just stepping in it.\n\n"
    },
    {
      "time": " 29.Sep.2007 12.54am",
      "content": "I don’t get to see the NBC logo that often in London, but that flat dull and static logo seems to do OK when it is 3d’ed up and zapped accross the screen. It works because good design has been applied to the logo in its most basic form.\n\nI’m just not seeing that in the Wacom logo.\n\n"
    },
    {
      "time": " 29.Sep.2007 5.41am",
      "content": "In a way, I’m happy to hear the NBC logo being dragged into this. I don’t know the names or places - and it was so long ago. NBC had a wonderful peacock from the beginning. Then (it was the 70s or 80s - it’s a blur now) then changed it to the giant N. They spent a fortune marketing the giant N. They wanted you to recognize it from another planet.\n\nLong story short - it didn’t go over well - and the peacock, modernized, was brought back.\n\nI do wonder who sat around those creative meetings....\n\nBiddy - Blood, Sweat and Tears was a good group - and brings back good memories... :-) Thank you for being here an understanding — my friend NEVER got over that experience, and now - it’s too late for him. It did teach him not to be abused...  \n_What goes up... must come down... spinning wheel got to go round...._\n\nAnd uh-hum, PMS colors - good ones — also kept many artist up at night trying to pick out the right one — and then wonder why the printer could never match the color... LOL\n\n"
    },
    {
      "time": " 29.Sep.2007 7.21am",
      "content": "Jackie T, that NBC “N” logo is a good example for this thread relating to the adoration of the “genius” work that the big identity firms can receive without merit.\n\nIt’s an infamous story. NBC paid $600,000 for the highly heralded identity. They got hammered with a cease and desist order, plus had to make a $800,000 equipment donation to the Nebraska public TV station who had already developed the exact same mark — for a whopping fee of $100.\n\nI was going to say that Wolff Olins is safe from this comical mark already being in use. But then again, it may turn out that some six year old kid already holds a claim to it.\n\n"
    },
    {
      "time": " 29.Sep.2007 8.58am",
      "content": "_Nick— you don’t believe that, do you?_\n\nYes.  \nThe best example of the “new effects trump old quality” principle I’ve come across was a quote from Harold Lloyd, the movie comedian. Sound had just been introduced into movies, and his latest silent masterpiece was being ignored at the box office. His comment was along the lines of, “We spent ages making this film, with well thought-out gags, it’s one of the best things I’ve ever done, but people would rather watch a movie of an egg frying in a pan if they can hear it sizzling”.\n\n"
    },
    {
      "time": " 29.Sep.2007 9.51am",
      "content": "I agree with Nick, it makes sense. People like new things. Just like fonts they great one day, overdone and overused another. It doesn’t mean there bad they just don’t stand out anymore. Like it or not it stands out from the crowd\n\n"
    },
    {
      "time": " 29.Sep.2007 10.18am",
      "content": "I’d rather look at the lasceaux paintings than view an active, rythmic, hdtv kanye west video. new effects do not trump old quality in my experience. novelty is always attention-grabbing, but that speaks more to our ADD culture than to quality, or flatness, or dullness, or stasis.\n\n"
    },
    {
      "time": " 29.Sep.2007 10.25am",
      "content": "when charles marsh said “stasis in the arts is tantamount to death,” he meant intellectual immobility. he didn’t mean that a calder sculpture was inherently superior to a rodin.\n\n"
    },
    {
      "time": " 29.Sep.2007 11.09am",
      "content": "Chuck, music videos are old hat—on TV.  \nBut in iTunes or iPod, not so much.  \nIt’s the novelty factor that counts, not whether one thing is newer than another.\n\n"
    },
    {
      "time": " 29.Sep.2007 3.10pm",
      "content": "I’m not arguing, but trying to understand the implications of your point.  \nSo, the hotmetal type is superior to the handwritten, and the digital type is superior to the metal, and the halographic projection of type will be better than the digital print... each new form rendering its ancestor obsolete (flat, dull, and static).  \nAn interesting conundrum though: torch becomes candle becomes electric light becomes hand cranked flashlight becomes battery flashlight becomes... you know? But what happens when the fad becomes retro, as in the resurgent return of “novel” hand-cranked flashlights, such as are in every store I visit these days? Does the “new” old trump the the “older” new, because of its novelty? I maintain that novelty and quality are vey different things, and further, that quality will survive the battle.\n\n"
    },
    {
      "time": " 29.Sep.2007 5.47pm",
      "content": "I should say that quality SHOULD survive the battle, or even that quality HOPEFULLY will survive the battle. I’m realistic enough to know that bad things happen to good designs (sometimes).\n\n"
    },
    {
      "time": " 30.Sep.2007 1.09am",
      "content": "The instant I saw that logotype, I _thought_ it was in the vein of that 2012 thing. Perhaps the lesson here is that you can’t make every design an instant classic, no matter who you are? Are there any great or profound designs from the same team released between these two logos?\n\n"
    },
    {
      "time": " 30.Sep.2007 3.53am",
      "content": "Hideous and amateurish.\n\n“Ill-advised” is a term that comes strongly to mind.\n\nI can only imagine, with no small degree of scorn and horror, what the Wolff Olins marks that were rejected looked like. But I’m sure they were colorful and “forward-thinking”.\n\n"
    }
  ]
}
