{
  "id": "37532",
  "title": "Initial Caps For Small Words",
  "forum": "Design",
  "tags": [

  ],
  "content": "There was a client change suggested to a logo I'm working on for the phrase \"Memories are made of...\" Now since this is a company name, they want it to say \"Memories Are Made Of...\" Setting it that way seems a little off since half those words usually don't take initial caps. Is there any standard regarding this? Should I push to keep them lower? or maybe compromise with \"Memories are Made of...\"?\n\n",
  "author": "<a href=\"/web/20101112040813/http://www.typophile.com/user/4186\" title=\"View user profile.\">kosal</a>",
  "time": "<br>",
  "uid": "4186",
  "comments": [
    {
      "time": "",
      "content": "Usually just conjuctions and articles (in, of, to, the, this, that etc) take lower case (ie not verbs). A common mistake is to capitalise based on the size of the word rather than the part of speech (eg verbs, adjectives, adverbs and nouns would usually be capitalised in Title case). The temptation in this case is to put 'Memories are Made of...' but I think that's poor. I thinnk it should really be 'Memories Are Made of...\" but that looks weird. Since it is the theoretical start of a longer sentence (hence the ellipsis) I would push for all lower case with an initial cap M.\n\nNo doubt some will disagree with me and want to drop the caps for some verbs which are short.\n\n"
    },
    {
      "time": "",
      "content": "The grammatical rules are good if you're in automatic mode for a repetitive situation like headlines, but for a one-off title or name you have to use some aesthetic discretion and take into account things like word length and the size of initials as well. So really -- whatever looks best, and damn the rules. If you flout convention, this will really only be offputting to a very small percentage of literary editors.\n\n"
    },
    {
      "time": "",
      "content": "\"a very small percentage of literary editors.\"\n\nwho will only mutter into their sherry when they see the logo and that's as far as it'll go.\n\nSo put some thought into it and make it look really nice. But for gosh sakes, treat the ellipsis right also: not 3 dots crammed together; let 'em breathe a bit.\n\npowers\n\n"
    },
    {
      "time": "",
      "content": "My original approach was to damn the rules and do what felt right. Thanks for the tips. Anyway, they decided to go with a totally different logo. Memories in script and ARE MADE OF, without ellipses.\n\n ![](http://web.archive.org/web/20101112040813im_/http:/typophile.com/files/memoriesfinal_3892.gif)\n\n"
    },
    {
      "time": "",
      "content": "I think they should have kept the ellipsis. Looks like there's another section missing below, like a bottom part of a sign blown off in the wind.\n\n"
    }
  ]
}
