{
  "id": "37541",
  "title": "Advice for legal pleadings",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Help! I'm going to go nuts if I need to create another document with TNR. I do some web design, but I'm a definite tyro when it comes to type.\n\nI need a serif font face to replace TNR in legal pleadings filed in federal court. Requirements are: screen (adobe PDF, embedded fonts) and print on standard copy paper using modern monochrome laser printers. We are on Windows using Corel WordPerfect X3 (if that matters). We need to use 13, maybe 14 point. We don't need sans.\n\nWhat I'm looking for is a font that is conservative yet elegant, if modern not edgy, and very legible. Shouldn't be too antique or call undue attention to itself if you are a judge used to looking at TNR. We use italics a lot for case cites, and they shouldn't be too florid.\n\nWhat I'm aiming for is something that just gives a slightly fresher, more refined look. Something that you wouldn't immediately notice but somehow are pleased to see. Perhaps the reader wouldn't even register if they're not into such things, but would just feel the document has a fresher look.\n\nSome things I came across during reading and searches: ITC Stone Serif, Adobe Caslon, Minion, Whitman, Augereau, MVB Verdigris, Albertina.\n\nMaybe I'm way off base with these, and can't afford to buy them all to give them a go!\n\nThanks so much for any suggestions or advice. Let me know if I can provide any other info. Save me from the sameness of TNR!\n\n",
  "author": "gtcaz",
  "time": "26 Sep 2007 — 10:45am",
  "uid": "22189",
  "comments": [
    {
      "time": "26 Sep 2007 — 11:09am",
      "content": "I would have said Whitman.\n\n"
    },
    {
      "time": "2 Oct 2007 — 6:28am",
      "content": "I would go with Minion. You already have it installed if you have Adobe reader, and OpenType lets you choose the type of numerals (if you do not want to call attention to the font, you should not use oldstyle numerals). Minion is also compact.\n\nAnother choice, in Georgia, which is very handsome on the screen.\n\nMake sure you comply with the technical requirements of the court.\n\n"
    },
    {
      "time": "26 Sep 2007 — 4:01pm",
      "content": "I'd use Minion.\n\n"
    },
    {
      "time": "26 Sep 2007 — 4:10pm",
      "content": "Eran is right on the money with the minion suggestion.\n\n"
    },
    {
      "time": "26 Sep 2007 — 4:35pm",
      "content": "Thanks for the Minion suggestions. I'll give that a try for a while and see how it settles in.\n\nFor sure the oldstyle numerals look out of place, and set the wrong tone entirely.\n\n"
    },
    {
      "time": "27 Sep 2007 — 6:59pm",
      "content": "\\>I need a serif font face to replace TNR in legal pleadings filed in federal court.\n\nAren't there rules about what you are allowed to use, to avoid hated fonts like, er Trajan, from appearing in these docs?\n\n"
    },
    {
      "time": "27 Sep 2007 — 7:43pm",
      "content": "Si, you mean like \"if Times Roman not available, Courier may be used\"?\n\n"
    },
    {
      "time": "28 Sep 2007 — 6:05am",
      "content": "If you think TNR/Courier rules are nasty, some courts still require titling to be done in blackletter. Now and then I spot briefs laying around the house with the first page set in Wittenberger.\n\n"
    },
    {
      "time": "30 Sep 2007 — 12:47pm",
      "content": "Many very beautiful fonts really aren't suitable for workhorse legal work, but sometimes you don't find that out until you've spent money for them (I've learned that lesson the hard way). Since you're using WordPerfect, you need a font whose default figures are lining figures, rather than old style (the same would be true if you used Microsoft Word, which likewise doesn't really support OpenType features), because legal citations in old style figures look weird, and shout \"I'm using a different font.\" That leaves out Georgia and Verdigris, and other fonts I like that others haven't mentioned (e.g., Kingfisher, Berling Nova and Dolly). I think you'll find that Whitman has too small an x-height; that problem also disqualifies a host of other fonts (e.g., Bembo Book, Mrs. Eaves). Porchez Le Monde Livre is really good, but has a killer flaw: the godawful pilcrow (paragraph mark). One of the problems with Times New Roman is that it's too condensed to work well in the 6.5 inch double-spaced lines lawyers have to use, so Minion, which is just as condensed as Times New Roman, is not a good choice, either.\n\nSabon LT is decent, arguably your best choice. Sabon Next is even better, but it isn't worth the exorbitant cost. Both Sabons may be half a tad too condensed. I really like Meridien, but its \"french style\" ampersand may stand out too much. I use it anyway. Also, I find that Meridien Regular is a tad too light, and Meridien Medium two tads too dark. But if you can stand that ampersand, it would be my personal recommendation. I was working with a Chicago lawyer on a federal appellate brief once, and he was so impressed with my draft in Meridien that he had his secretary buy its Bitstream clone, Latin 725, on Ebay to use in his own briefs (he wasn't willing to spring the extra cost for real Meridien, which you can get from both Adobe and Linotype). Another decent choice (really!), if you aren't plagued with negative memories of childhood adventures with Dick and Jane, is Century Schoolbook (or one of the innumerable other variants of Century). The U.S. Supreme Court uses Century and Century Schoolbook, and so those fonts may have a subliminal \"authoritativeness\" that helps. 7th Circuit Judge Frank Easterbrook, who wrote the typeface rules in FRAP 32, tends in the direction of being a typeface junkie, and he recommends Century/Century Schoolbook (and also specifically recommends that you not use TNR). And Palatino Linotype is probably the best choice among the fonts that came with your PC, although I find it a tad too dark. (One odd thing--Century Schoolbook is darker than Palatino, as you can see if you place samples side-by-side, but by itself Palatino can look too dark, whereas CS usually doesn't. I have no idea why that is the case, but that's my experience). Georgia would be really good, too, but for the expletive deleted OSF default.\n\nIncidentally, the extra-cost Windows screen font for Meridien is well worth it. It's an outstanding screen font. Many nice fonts are somewhat sucky on screen in WordPerfect or Word, and that can be grating if you have to use one all the time, even if the printed result is just fine. For example, Kingfisher (which is not for you, since its default figures are OSF, and it's also exorbitantly expensive) looks way better printed than it does on screen.\n\n"
    },
    {
      "time": "1 Oct 2007 — 8:34pm",
      "content": "\\>Georgia would be really good, too, but for the expletive deleted OSF default.\n\nYou could ask Ascender to re-issue a version with lining numerals. Part of a a \"legal font pack\" maybe? ;-)\n\n"
    },
    {
      "time": "2 Oct 2007 — 6:31am",
      "content": "What about Dante, say at 12pt?  \nIt has a nice italic.  \nHow would you feel about its \"lining\" figures?\n\n"
    },
    {
      "time": "2 Oct 2007 — 8:46pm",
      "content": "I have admired books set in Dante, and speculated that it might be good for legal use. Indeed, I originally turned to Meridien because it looked so good in my copy of the Illiad and happened to be identified in the fine print on the copyright page (I wish more publishers did that). Dante may be just great, but I've never bought it, and I know from experience that a font that at first or even second glance seems like it would work well in legal usage sometimes just doesn't. I spent a bundle on Bembo Book, and a bigger bundle on Le Monde Livre, only to find out that they just don't work for federal appellate briefs (or at least, in the case of Le Monde, don't work in briefs that use the pilcrow character).\n\nBut Dante may well be a contender. I've also suspected that House's Paperback might be good, but it's rather pricey, and so I've never bought it.\n\nI continue to insist that Minion's too condensed, just as Times New Roman is. But you could use WordPerfect's letterspacing function to stretch it out, I suppose. Actually, that is what the Tenth Circuit does with Times New Roman in its slip opinions. It still doesn't look good, but it does look better.\n\n"
    },
    {
      "time": "2 Oct 2007 — 9:33pm",
      "content": "Oops. Paperback's default figures are old style, so cross it off your list (it's too expensive, anyway).\n\nYou could always spring for InDesign, so you could get at the non-default lining figures in some OpenType fonts. But you could buy several normally-priced fonts for the same price. And InDesign is a bitch for a neophyte to learn to use. Worse, your chances of finding a legal secretary who knows how to use it are slim to none--most of 'em can't make full use of Word or WordPerfect.\n\n"
    },
    {
      "time": "3 Oct 2007 — 10:49am",
      "content": "Aren't Minion's default figs OS too? Either way, however, be aware of the EULA. You need to be able to (a) embed and (b) send out ...\n\n"
    },
    {
      "time": "3 Oct 2007 — 10:51am",
      "content": "I meant to add that the Adobe EULA allows you to modify the fonts. This means that, in theory, you can have someone change the default figs for you. Depending on the foundry you might also just ask them if they could change the default for you. Note that Adobe doesn't do alterations, but you can hire someone else to do it for you and you are within your rights.\n\n"
    },
    {
      "time": "3 Oct 2007 — 7:25pm",
      "content": "My copy of Minion Pro has lining figures as the default. I just ran a side-by-side comparison with TNR, and not only is Minion's horizontal compression almost identical to TNR, but the x-height is considerably smaller.\n\nLegal briefs typically need relatively spread-out fonts with fairly large x-heights, because with few exceptions (the U.S. Supreme Court being the only one that comes to mind), under most Court rules small format pages are no longer permitted (8.5 X 11 is required), and \"double spacing\" is mandated. In most courts the rules have developed from rules aimed at briefs produced by typewriters. And many courts require 1 inch margins. So, the way that Microsft Word works, most legal secretaries preparing briefs pick \"double spacing\" and end end up with, say, lines of 13 pt. type, 85 or 90 characters per line, spaced vertically at maybe 29 pt intervals. (Actually, if the Court rules permit it, they're likely to pick 12 point TNR, as a leftover from when the rules required use of \"Pica\" typewriting). This produces a page with way, way too much white space, and way too many characters per line. Picking a compressed font, or one with a small x-height, just makes things worse.\n\nWorse, in many courts (not the federal appellate courts, thank God!), there are length limitations expressed in pages, rather than in characters, so there's an incentive to go with a compressed font to squeeze more into a brief that would otherwise go over the page limit.\n\nAnd, believe it or not, there are still a handful of states in which court rules make Courier mandatory!\n\nSo it's hardly surprising that the overwhelming majority of legal briefs are typographically awful. I doubt that Century Schoolbook is on the list of personal faves of most of this forum's members, but, really and truly, when the rules permit it, it's one of the best choices.\n\nIn the U.S. Supreme Court, the rules are quite a bit different, and left over from the days of hot metal. As you might suspect, this makes Supreme Court briefs aesthetically vastly superior. The format is small--the pages are 6.125 x 9.25 inches, type size must be 11 point or larger, with leading of 2 points or more, and margins of at least .75 inches. The Supreme Court rules say that \"the typeface used should be similar to that used in current volumes of the United States Reports (that is, Century). Few law firms do these briefs in house any more, and I'd guess that 95% of the briefs filed in that court are done by just three or four printing firms. I'd guess that maybe 65% of 'em use Century, 30% use Palatino, and 5% something else. The front cover often has the \"Supreme Court of the United States\" in Blackletter, although that's not required.\n\nSo when gtcaz asks for help with federal court briefs, you have to understand that the best anyone can recommend will still break many of the rule of good design that you learned at design school or read in Bringhurst. It's really a question of making a \"normal\" brief look less bad, rather than making it look good.\n\n"
    },
    {
      "time": "3 Oct 2007 — 11:02pm",
      "content": "Here's an example:  \n [http://www.law.yale.edu/documents/pdf/Public\\_Affairs/Hamdanbrief\\_Ackerma...](http://web.archive.org/web/20131017043541/http:/www.law.yale.edu/documents/pdf/Public_Affairs/Hamdanbrief_Ackerman.pdf \"http://www.law.yale.edu/documents/pdf/Public\\_Affairs/Hamdanbrief\\_Ackerman.pdf\")\n\n"
    },
    {
      "time": "4 Oct 2007 — 4:53am",
      "content": "If you want to try Dante, Ascender is selling a [very cheap package](http://web.archive.org/web/20131017043541/http:/www.fontmarketplace.com/productinfo.aspx?ProductID=DAN01-70-01-01&CategoryID=53) on their new \"Font Marketplace.\"\n\n"
    },
    {
      "time": "4 Oct 2007 — 5:35am",
      "content": "It should be noted that the figures in Dante, while lining, are not full cap height. They are more like three-quarter lining figs.\n\nI'm not advocating one way or the other. I just wanted to point that out, since figures seem to be a key issue here.\n\n-- K.\n\n"
    },
    {
      "time": "4 Oct 2007 — 12:38pm",
      "content": "<cite> If you want to try Dante, Ascender is selling a very cheap package on their new “Font Marketplace.” <cite></cite></cite>\n\nI have to say that 22.49 for regular and bold including italics, plus 4.99 for small caps (including osf) is quite a deal. If you'll be sticking to a word processor then you shouldn't mind truetype.\n\n"
    }
  ]
}
