{
  "id": "3754",
  "title": "Newbies second post",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "hello everybody!   \n   \nshame, shame, shame! no replies yet to my first post. gimme a blanket to dry my tears ;-)   \n   \nnevertheless i keep on working on my latest baby and it looks really nice and crazy as you can see [here](http://web.archive.org/web/20131018052716/http:/www.matthiasnicolai.com/betabender.html)   \n   \ncheerio!\n\n",
  "author": "fraternemo",
  "time": "23 Mar 2004 — 3:09pm",
  "uid": "3265",
  "comments": [
    {
      "time": "23 Mar 2004 — 3:48pm",
      "content": "Matthias, on the one hand I don't want to discourage you. On the other hand I'd like to somehow help you to focus on what kinds of type designs might be appreciated by many users (if I can).   \n   \nIt feels like this stuff is too 90s. Any instance of type design is good \"training\", but if you want to produce something other people will enjoy I don't think this will prove fruitful. If you decide to continue in this direction anyway, then I hope I'm wrong! If you instead decide to use this just as practice, that's great. And if you totally abandon it, then you might find it hard to focus on something better, but I think it's worth the effort. Anyway, don't just give up - good luck!   \n   \nhhp\n\n"
    },
    {
      "time": "23 Mar 2004 — 3:59pm",
      "content": "Matthias -- I see this for short heds and titling   \n(like a bjork vespertine CD titling face kinda)   \nand I'm guessing that you are setting text in   \nthis face only to show how it works, more or less.   \nHowever, like plenty of other one-off display faces,   \nit should be used in moderation, otherwise   \nthe mass of glyphs is difficult to read and/or look at.   \nMaybe if you set some words or short phrases in it,   \nor did an a-z, then it might be easier to critique.   \n   \nbj\n\n"
    },
    {
      "time": "24 Mar 2004 — 1:40am",
      "content": "Good Morning (here in Germany...)!   \n   \nThanks Tiffany, thanks Hrant, thanks bj (beautiful portrait, very encouraging) for your useful hints. All of them will be considered with a grateful heart.   \n   \nOf course this is a display font, otherwise I would have posted it somewhere else and I apologize 1.) not having sent a nice A-Z yet and 2.) not in a usual .gif or .jpg format (I\n\n"
    },
    {
      "time": "23 Mar 2004 — 3:21pm",
      "content": "Matthias -- I will assume that this typeface shouldn't be used for text settings, right? I don't see a \\_v\\_ anywhere, but the \\_u\\_ looks more like a \\_v\\_. I don't think you need the downstroke on the a to complete itself at the baseline, I think it should just be rounded. While your \\_m\\_ is clever, next to an \\_e\\_ it looks too small, or maybe the \\_e\\_ is too large? The \\_w\\_ seems a little narrow. The \\_r\\_ might need work in regards to combinations such as \\_ri\\_ where it disappears. Your \\_ff\\_ ligature is too wide as well. You might consider just posting a JPG of the characters.\n\n"
    }
  ]
}
