{
  "id": "37566",
  "title": "Please Critique a Book Spread",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hello!\n\nI found myself visit this forum very often lately and found your advices really helpful. So I decided to sign in and ask for your help on such a matter:\n\nI'm working on a book that will be sent free to subscribers of a biz mag. Size 240x260mm (56p8x61p5) means that no one would take the book to his/hers business trip and likely it would spend its time on the shelf of some young executive after a brief flick through.\n\nThe Book consists of several articles from the mag. Each article starts with a title spread with two color illustration (Black + Pantone). Typefaces used in the book are LeMondeJurnal for the body (set 9/12) and PrivaPro used for titles, subtitles, subheads, quotes, pagination and sidebar text.\n\nThe main reason of this post are my concerns about the ligatures at titles and quotes. I can't make up my mind if they harmonize with illustrations well or are signs of over abundance?\n\nAny opinions on that matter, or any, concerning typography or composition in attached pdf file would be much appreciated.\n\nPS. Is it me or the \"w\" and \"y\" in PrivaPro are tad darker than other glyphs?\n\n| Attachment | Size |\n| --- | --- |\n| [089\\_Ksiazka\\_HBRP\\_b.pdf](http://web.archive.org/web/20130310021913/http:/typophile.com/files/089_Ksiazka_HBRP_b.pdf) | 169.89 KB |\n| [089\\_Ksiazka\\_HBRP.pdf](http://web.archive.org/web/20130310021913/http:/typophile.com/files/089_Ksiazka_HBRP.pdf) | 284.9 KB |\n\n",
  "author": "Urquell",
  "time": "27 Sep 2007 — 1:46am",
  "uid": "22209",
  "comments": [
    {
      "time": "27 Sep 2007 — 2:24am",
      "content": "I like the ligatures. As a rational maximalist minimal maoist once said: \\*\\*\\*\\* it, they're pretty. Ligs in sans always look odd anyway. That's their charm.\n\nOne thing that caught my eye on a quick glance was the elementalism of the ogonoek a -- the ligatures are so fluid that this now looks just bizarre.\n\n"
    },
    {
      "time": "27 Sep 2007 — 2:47am",
      "content": "I don't think Priva is a good choice here, at least not the way you are using it. Does this kind of ogonek look good for a polish reader?  \nThe ligatures are too much in my opinion, and even less understandable is the unconsistent use of them.  \ng\\_i looks really strange to me, in \"strategie\" there is an \"a\" without tail and in \"wschodzących\" you do not use the c\\_h-ligature from \"lokalnych\".\n\n"
    },
    {
      "time": "27 Sep 2007 — 2:50am",
      "content": "Thank you for your comment, dux.  \nI tend to like the ligatures in this book as well, but my co-workers opinions are mixed.\n\nI forgot to mention the book is typeset in Polish - we got plenty diacritical marks most of English based typographical world would call bizarre - a ogonek, e ogonek, l slashed, z dot and many others. They're just normal common letters for Polish readers, so they don't compete for attention with ligatures.\n\n"
    },
    {
      "time": "27 Sep 2007 — 3:26am",
      "content": "Christoph,  \nyou touched the point that concerns me most. Inconsistency in using ligatures is intended. In Polish words combination of letters \"ch\" \"gi\" \"st\" are quite common, text set using ligatures in consistent way looks ridiculous. Do you think inconsistency is the enough reason not to use them at all? Just added a pdf version without ligatures. Would you please clarify why in your opinion Priva is not a good choice?\n\nThank you\n\n"
    },
    {
      "time": "27 Sep 2007 — 5:13am",
      "content": "I like Piva, but I did not think Polish like this strange ogonek and I do not understand the second \"a\".  \nAlso I like clarity and I think all this disturbance by  \n- unfamiliar looking ligatures (g\\_i does not really fit to the rest for me)  \n- inconsistency (\"a\" and ligatures) and  \n- strange looking diacritics  \ndoes not serve the reader.  \nBest,\n\nChristoph\n\n"
    },
    {
      "time": "28 Sep 2007 — 12:33am",
      "content": "Christoph,  \nI can see your point of view now, thanx for sharing it.\n\n[OT] a ogonek is not a ligature, it's a standalone letter, and its use belongs to gramma, not design i.e. as \"wären das\" is not inconsistecy in using \"a\" in German I belive [end of OT]\n\n"
    },
    {
      "time": "28 Sep 2007 — 2:04am",
      "content": "Antoni,  \nof course aogonek is not an inconsistency. I meant the single \"a\" without tail together with all the others that have one.  \n[compare the a from \"strategie\" with the one in \"dla\", and also compare the \"l\" in \"dla\" with the ones in \"lokalnych\". These are the inconsistencies I don't like]  \nUsually the ogonek is smoothly connected with the letter, but here it is barely not touching it, which looks kind of strange to me. But I am not from Poland, so this is an issue you must know better.  \nBest,\n\nChristoph\n\n"
    },
    {
      "time": "28 Sep 2007 — 4:46am",
      "content": "Take this as a \"reader\" comment, not a designer one.  \nPersonally I find the ligatures of a \"small\" letter (say, s or g) with a tall one (t or i) a bit odd, while i like the ch one (in the word \"lokalnych\").  \nI agree with your comment on the w and the y in Priva, but only because you made me notice it!\n\n"
    },
    {
      "time": "1 Oct 2007 — 2:26am",
      "content": "Christof, you wrote:\n\n<cite>[compare the a from “strategie” with the one in “dla”, and also compare the “l” in “dla” with the ones in “lokalnych”. These are the inconsistencies I don’t like]</cite>\n\nsilly me - I misuderstood you (language issues) - I would call different glyphs of the letter alternates - and these I didn't intend to differ. I was just playing with new typeface and forgot clean it up before posting. I updated pdf how should I've done it before. Sorry for unnecessary confusing you with these - and thanx for pointing them out.\n\n<cite>Usually the ogonek is smoothly connected with the letter, but here it is barely not touching it, which looks kind of strange to me.</cite>\n\nAgain I didn't get what you thought before. You're right about ogonek - it usually is connected with a letter. In Priva in small sizes (up to cir. 10pt) it looks as connected in print-copy, so I'm not sure if it was intended as an ink trap - but I changed it because in larger sizes looked not so good - although I don't think it would confuse Polish reader.\n\nabaldoni, thanks for your opinion\n\nregards,  \nAntoni\n\n"
    },
    {
      "time": "7 Oct 2007 — 2:30pm",
      "content": "I would definitely get rid of the ligatures. They are frisky and distracting.\n\n"
    },
    {
      "time": "23 Nov 2007 — 11:16pm",
      "content": "hey\n\ni would like a book spread critique.\n\n"
    },
    {
      "time": "23 Nov 2007 — 11:33pm",
      "content": "hey\n\n"
    }
  ]
}
