{
  "id": "37572",
  "title": "Terminology Question",
  "forum": "Design",
  "tags": [

  ],
  "content": "Is there a term for where a horizonal and vertical stem, meet? Particularly where the bowl meets the vertical stem in letters like p,q,a,d,b.\n\nPablo\n\n [‹ Dots Font Similar to Helvetica Extended](http://web.archive.org/web/20081009203115/http:/typophile.com/node/37641 \"Go to previous forum topic\") [Font for Fashion Dictionary...? ›](http://web.archive.org/web/20081009203115/http:/typophile.com/node/28843 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081009203115/http://typophile.com/user/4202\" title=\"View user profile.\">cubanica</a>",
  "time": "<br>",
  "uid": "4202",
  "comments": [
    {
      "time": " 27.Sep.2007 9.29am",
      "content": " ![](http://web.archive.org/web/20081009203115im_/http:/typophile.com/files/p_5792.jpg)\n\n"
    },
    {
      "time": " 27.Sep.2007 9.56am",
      "content": "Borrowing from calligraphy, this is simply referred to as a “join” or “joint,” no? I am not aware of any more specific terms.\n\n"
    },
    {
      "time": " 27.Sep.2007 10.24am",
      "content": "The typographic term is “branching”.\n\nj a m e s\n\n"
    },
    {
      "time": " 27.Sep.2007 10.25am",
      "content": "I call it join.  \nAlso common: junction and juncture\n\n"
    },
    {
      "time": " 27.Sep.2007 10.42am",
      "content": "Funny, I have been calling it a joint for lack of a better word. Without knowing that that IS the word. Cool.\n\n"
    },
    {
      "time": " 27.Sep.2007 6.20pm",
      "content": "Two whole people agree with you so that settles it and you must be right? (much laughter) You guys need to read a lot more type history.\n\n“Joint” has the problem of being applicable to several different areas of typeface anatomy. It could be applied to the area where the bar of an e joins the stroke, and where the bar of a t crosses the stem, as well as the junction of the stroke and stem of h, n, m, b, d, p, q, u.\n\n“Branching” is analogous to the trunk (stem) and branches of a tree. It’s an intuitive, literate term, much narrower in scope than “joint” and specific to letters with stems.\n\n ![](http://web.archive.org/web/20081009203115im_/http:/typophile.com/files/branch_joint_4394.gif)\n\nA star denotes topology answering to a “joint”. A dot denotes topology resembling the branching of a tree.\n\n ![](http://web.archive.org/web/20081009203115im_/http:/typophile.com/files/brancho_rancho_6099.gif)\n\nTellingly, in faces with geometric topology eg: Futura and Bodoni, h, n, m, b, d, p, q, u are more branch-like than joint-like. Fonts styled after handwriting, eg: Pristina, are markedly branch-like in structure. You could call the junction of the stroke and stem on Pristina’s h a “joint” _if you really want to_, but to my mind “branch” describes that one with far more relevance.\n\nYou wouldn’t call the crossover point of an x “branching” because the topology is a four way intersection, and because there’s no stem on an x, so “joint” is more appropriate.\n\nj a m e s\n\n"
    },
    {
      "time": " 27.Sep.2007 7.47pm",
      "content": "_and where the bar of a t crosses the stem,_\n\nBut surely if it crosses, it doesn’t join.\n\n"
    },
    {
      "time": " 27.Sep.2007 11.30pm",
      "content": "Nick,  \nquite right, so for t and f it should be called a “junction”?\n\nj a m e s\n\n"
    },
    {
      "time": " 28.Sep.2007 12.31am",
      "content": "[http://typophile.com/node/20274](http://web.archive.org/web/20081009203115/http:/typophile.com/node/20274 \"http://typophile.com/node/20274\")?\n\nTim\n\n"
    },
    {
      "time": " 28.Sep.2007 2.18am",
      "content": "<cite>The typographic term is “branching”.<br>\n(...)<br>\nYou guys need to read a lot more type history.</cite>\n\nJames, since you seem to be so knowledgeable and have read so much more than us, could you please provide some references on the use you suggest, so we can read it? Where are the images from you are showing? Or did you make the terms up yourself?\n\n<cite><br>\n“Joint” (...) could be applied to the area where the bar of an e joins the stroke</cite>\n\nCan you provide any reference for that? Has any renowned typographer ever used the term in this way? Or did you make that up?\n\n<cite>so for t and f it should be called</cite>\n\nThe question is not what they <cite>should be called</cite> but what they <cite>are called</cite>. I do not think you are in a position to define the terminology, James.\n\n"
    },
    {
      "time": " 28.Sep.2007 4.19am",
      "content": "Using quasi-botanical and quasi-anatomical similes lead to confusion, I would imagine that there are various overlapping terms that could be applied to many typographic terms; join (rather than joint) has the benefit of not falling in either camp. To my mind branch refers to the stroke including the join but more to the stroke, the join itself could be (and is) referred to as a bowl join, neither is wrong.\n\nTim\n\n"
    },
    {
      "time": " 28.Sep.2007 8.05am",
      "content": "Doesn’t the branching idea come from Owen Jones? (_The Grammar of Ornament,_ 1856)\n\nI use the term “joint” for both tangential and angular connections.\n\n"
    },
    {
      "time": " 29.Sep.2007 12.48am",
      "content": "_I am not aware of any more specific terms._\n\nThat was true until now.\n\n_Where are the images from you are showing? Or did you make the terms up yourself?_\n\nI did not make up the terms “branch” and “branching” myself. See below. The images I’m showing are samples I put together using common typefaces to illustrate what I’m talking about. Is there some kind of problem with that?\n\n_Can you provide any reference for that? Has any renowned typographer ever used the term in this way? Or did you make that up?_\n\nI improvised. I did say “could be applied”, rather than stipulating it as standard terminology.\n\n_The question is not what they should be called but what they are called._\n\nSee below.\n\nWhy am I supposedly “in no position to define terminology”? Because I live in Australia, have only produced a few good typefaces, and lack formal studies? None of that counts because my specialty is philology and lexicography. Australia is certainly a cultural backwater, but I am as far from the average Australian as you can get in terms of culture, reading, intellect and erudition.\n\nTimD,  \nif “branch” and “branching” are so confusing because of their quasi-botanical, quasi-anatomical nature, why is “stem” a widely-accepted typographic term? Few people if any complain about “type_face_” either. What about “arm”, “beak”, “body”, “ding_bat_”, “ear”, “eye”, “_hair_line”, “leg”, “occulus”, “spine”, “tail”, and “teardrop terminal”? All of these except “leg”, “occulus” and “spine” appear in the glossary of Indie Fonts 1 as well as other type glossaries, and are routinely pressed into service in discussions at Typophile. “Leg”, “occulus” and “spine” show up on threads here too.\n\nAre you going to opine that these terms are quasi-anatomical?\n\n“Beard” as an alternative to “spur” on a capital G does not appear in the Indie Fonts gloassary either, but some type designers I correspond call it a “beard”.\n\n“Bar” is an abbreviated form of “crossbar”. It shows up as “bar” in the [Microsoft glossary](http://web.archive.org/web/20081009203115/http:/www.microsoft.com/typography/glossary/ch2.htm).\n\nQuote: “BARS  \nare where you go to drown your sorrows. They are also the horizontal strokes that run into verticals in H and A.\n\ne also has a bar, even if it is oblique, sloping slightly upwards, as in Venetian faces like Centaur. In that case you might call this a cross stroke, because people would know what you mean, but you shouldn’t, because a\n\nCROSS STROKE  \nis really open on at least one end as on t and f and Ð.”\n\nEnd quote.\n\nIf you think the Microsoft glossary lacks credence, what makes you think your opinions are any more credible? Typophile’s typowiki gloassary is quite good but omits “spine” and “occulus”.  \n/TimD\n\nWhy do we speak of typeface structure and topology as “anatomy”? Because it makes sense and is useful in analogy. It’s figurative use of language. If you don’t understand the philiogical meaning of “figurative”, please look it up in a good dictionary. Typographers, type designers and type historians aren’t the only people who borrow and adapt terminology from human anatomy and other disciplines. Architects and industrial designers do it too.\n\nIf you find “branch” and “branching” objectionable terms it may be because you’re encountering them for the first time now. Owen Jones uses the term in The Grammar of Ornament, and Alexander Nesbitt uses it in The History and Technique of Lettering. I can’t recall if Bringhurst uses it. If not that’s a disappointing omission.\n\nI don’t have time to locate specific instances in the printed books referred to above because I’m very busy.\n\n[Google search for **calligraphy +branching**](http://web.archive.org/web/20081009203115/http:/www.google.com/search?hl=en&q=calligraphy+%2Bbranching&btnG=Search&meta=):\n\nFrom The Calligraphy Glossary at [www.callig.ru/misc/glossary.pdf:](http://web.archive.org/web/20081009203115/http:/www.callig.ru/misc/glossary.pdf: \"www.callig.ru/misc/glossary.pdf:\") “Branching stroke: The stroke which connects an arch to the downstroke of a letter.”\n\nFrom [www.sharonzeugin.com/pdf/Coursedescriptions2.pdf:](http://web.archive.org/web/20081009203115/http:/www.sharonzeugin.com/pdf/Coursedescriptions2.pdf: \"www.sharonzeugin.com/pdf/Coursedescriptions2.pdf:\") “We will then modify Italic characteristics such as x-height, slope, arches and branching in creating our own personalized variations of the lettering.”\n\nBranching is in widespread use by calligraphers:  \n [http://www.roehampton.ac.uk/pdp/cc/cc.html](http://web.archive.org/web/20081009203115/http:/www.roehampton.ac.uk/pdp/cc/cc.html \"http://www.roehampton.ac.uk/pdp/cc/cc.html\")  \n [http://www.reuels.com/reuels/Calligraphy\\_Glossary.html](http://web.archive.org/web/20081009203115/http:/www.reuels.com/reuels/Calligraphy_Glossary.html \"http://www.reuels.com/reuels/Calligraphy\\_Glossary.html\")  \n [http://www.letteringdesign.com/debbyclasses.html](http://web.archive.org/web/20081009203115/http:/www.letteringdesign.com/debbyclasses.html \"http://www.letteringdesign.com/debbyclasses.html\")  \n [http://www.scarletstarstudios.com/blog/archives/calligraphy/](http://web.archive.org/web/20081009203115/http:/www.scarletstarstudios.com/blog/archives/calligraphy/ \"http://www.scarletstarstudios.com/blog/archives/calligraphy/\")  \n [http://www.designingletters.com/html/arrghi/struggling.html](http://web.archive.org/web/20081009203115/http:/www.designingletters.com/html/arrghi/struggling.html \"http://www.designingletters.com/html/arrghi/struggling.html\")\n\nThat has to give the term some credence. Tim Ahrens suggests borrowing “join” or “joint” from calligraphy. I must have erred by not suggesting you guys needs to read more calligraphy manuals as well.\n\nWhat I am trying to do here is raise the bar. “Join” or “joint” seem inadequate. “branch” and “branching” are more specific, and linguistically richer, just like “ear”, “beak” and “leg”. But apparently typographers here aren’t hip to it, so bugger it, let’s just call it a “joint”.\n\n“Branching” may not be the accepted typographic term (I concede happily), but typography is an evolving art subject to additions, change and development.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2007 1.25am",
      "content": "P.S: If you don’t understand what I mean now, maybe you will some day.\n\nPeace. Sending you all good vibes.\n\nThanks & bye.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2007 3.44am",
      "content": "Consider how these terms came about, are they specific to language, to nation, to area, to foundry, to typographer, to college, are they from the same source or several, which is correct?\n\n\\>why is “stem”…on threads here too.\n\nEssentially what I wrote was that borrowing terms from other areas of classification could be confusing, I didn’t write that it was wrong or rare (I wrote that “branch” wasn’t wrong). Yes, I am going to opine that some of the terms are quasi-anatomical – where else do you think they come from?\n\n\\>…what makes you think your opinions are any more credible?\n\nI don’t, it’s not a question of credence but of description, if referring to a crossbar helps a correspondent identify a part of a character, then, as the glossary suggests, it has achieved its purpose, the fact that there are alternative descriptions, some that are clearer or more defined, doesn’t mean one is _correct_ and others _wrong_. Microsoft’s glossary describes the leg of a K as a tail; is that more accurate or clearer than leg (especially when the top diagonal stroke is described as an arm)?\n\nIf any Typophile members think a typowiki’s entries are inaccurate or insufficient they have the opportunity to amend, add or create.\n\n\\>Why do we speak of typeface structure and topology as “anatomy”? Because it makes sense and is useful in analogy.\n\nYes, it does. Why have you assumed I disagree? I am open to other descriptions though.\n\n\\>If you don’t understand the philiogical meaning of “figurative”, please look it up in a good dictionary\n\nDo you mean philological? Or is that insulting?\n\n\\>If you find “branch”…objectionable terms it may be because you’re encountering them for the first time now.\n\nI don’t and it isn’t, otherwise I wouldn’t have been able to partially define what I understand by the term, branching is an acceptable extension too – but they aren’t the only terms.\n\n\\>Tim Ahrens suggests borrowing “join” or “joint” from calligraphy. I must have erred by not suggesting you guys needs to read more calligraphy manuals as well.\n\nDid he suggest that or would it be impolite to suggest you read the posts? Join, while not so linguistically rich, does describe the area that Pablo asked about, so does bowl join and so does branch (although I am confused why the Futura h has ‘topology answering to a “joint”’ but the area in Pablo’s post is ‘branching’).\n\nBye,  \nTim\n\n"
    },
    {
      "time": " 29.Sep.2007 4.18am",
      "content": "Now just a cotton pickin’ second, the “interwebs” thingy tells us “branching” is in use by various commentators, from Aiga to Gary Munch.\n\n[http://www.google.com/search?hl=en&q=typeface+%2Bbranching&meta=](http://web.archive.org/web/20081009203115/http:/www.google.com/search?hl=en&q=typeface+%2Bbranching&meta= \"http://www.google.com/search?hl=en&q=typeface+%2Bbranching&meta=\")\n\n[http://www.linotype.com/38/newsletter.html](http://web.archive.org/web/20081009203115/http:/www.linotype.com/38/newsletter.html \"http://www.linotype.com/38/newsletter.html\") “The deep **branching** of curves from main strokes helps this humanist sans to be very readable at smaller sizes.\n\n[http://www.paratype.com/fstore/fonts/Linotype-Ergo\\_CE.htm](http://web.archive.org/web/20081009203115/http:/www.paratype.com/fstore/fonts/Linotype-Ergo_CE.htm \"http://www.paratype.com/fstore/fonts/Linotype-Ergo\\_CE.htm\") “The deep **branching** of curves from main strokes helps this humanist sans to be very readable at smaller sizes.”\n\n[http://www.stonetypefoundry.com/Resources/ITC%20Stone%20Specimen%20Book....](http://web.archive.org/web/20081009203115/http:/www.stonetypefoundry.com/Resources/ITC%20Stone%20Specimen%20Book.pdf \"http://www.stonetypefoundry.com/Resources/ITC%20Stone%20Specimen%20Book.pdf\") “The **branching** in the lowercase letters abdgpqhmn is one such cursive characteristic.”\n\n[http://www.aiga.org/content.cfm/the-digital-past-when-typefaces-were-exp...](http://web.archive.org/web/20081009203115/http:/www.aiga.org/content.cfm/the-digital-past-when-typefaces-were-experimental \"http://www.aiga.org/content.cfm/the-digital-past-when-typefaces-were-experimental\") “ITC Charter...in its wedge-like serifs and abrupt **branching**...”\n\n[http://blogs.msdn.com/jensenh/rss\\_tag\\_Fonts.xml](http://web.archive.org/web/20081009203115/http:/blogs.msdn.com/jensenh/rss_tag_Fonts.xml \"http://blogs.msdn.com/jensenh/rss\\_tag\\_Fonts.xml\") “Candara is a casual humanist sans with verticals showing a graceful entasis on stems, high- **branching** arcades in the lowercase...”\n\n[http://typographica.org/001105.php](http://web.archive.org/web/20081009203115/http:/typographica.org/001105.php \"http://typographica.org/001105.php\") “...the bowl shapes, stressing, **branching** from stems, serif design and serif mating...”\n\n[http://en.wikipedia.org/wiki/History\\_of\\_western\\_typography](http://web.archive.org/web/20081009203115/http:/en.wikipedia.org/wiki/History_of_western_typography \"http://en.wikipedia.org/wiki/History\\_of\\_western\\_typography\") “...Fell italic types were distinguished by high contrast matching the Fell romans; wider ovals; a **split-branching** stroke from the stems of m n r and u...”\n\n[http://www.magtypo.cz/buxus/generate\\_page.php?page\\_id=393&buxus\\_typo=5ea...](http://web.archive.org/web/20081009203115/http:/www.magtypo.cz/buxus/generate_page.php?page_id=393&buxus_typo=5ea8e53c4a67bae215f0a61478dd685e \"http://www.magtypo.cz/buxus/generate\\_page.php?page\\_id=393&buxus\\_typo=5ea8e53c4a67bae215f0a61478dd685e\") “A humanist sans with verticals showing a graceful entasis on stems, high- **branching** arcades in the lowercase.” —- Gary Munch\n\n[http://www.myfonts.com/fonts/linotype/syntax-letter/familytree.html](http://web.archive.org/web/20081009203115/http:/www.myfonts.com/fonts/linotype/syntax-letter/familytree.html \"http://www.myfonts.com/fonts/linotype/syntax-letter/familytree.html\") “Linotype Syntax Letter...lead-in and exiting terminals, and the organic **branching** of round strokes from main stems.”\n\n[http://www.digital-web.com/articles/elements\\_of\\_design/](http://web.archive.org/web/20081009203115/http:/www.digital-web.com/articles/elements_of_design/ \"http://www.digital-web.com/articles/elements\\_of\\_design/\") “Typography...Branching: A **branching** pattern is the repetition of forking lines, or patterns of deviation.”\n\nIt’s hard to glean from the interwebs how widespread the term is. If it is not widepsread then that is a pity.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2007 4.53am",
      "content": "_...branching is an acceptable extension too – but they aren’t the only terms._\n\nI’m not saying they are the only terms, but that “branching” has desirable qualities over “join” or “joint”.\n\n_Did he suggest that or would it be impolite to suggest you read the posts?_\n\nMitchell Bills borrowed “join” from calligraphy. I read the posts but misremembered who said it. I don’t think you’re being impolite. Gee whiz.\n\n_...I am confused why the Futura h has ‘topology answering to a “joint”’ but the area in Pablo’s post is ‘branching’_\n\nI wrote: “...in faces with geometric topology eg: Futura and Bodoni, h, n, m, b, d, p, q, u **are more branch-like than joint-like.** ”\n\nI also made a mistake: “A star denotes topology answering to a “joint”. A dot denotes topology resembling the branching of a tree.”\n\nStrike that, reverse it. Other way around. A star denotes topology resembling the branching of a tree, and a dot denotes topology answering to a joint.\n\nSorry about that. I had a double brain anyeurism at the end of January this year which nearly killed me, and my logic functions are not as agile as they used to be due to the brain trauma caused by bleeding and fluid pressure during the sub arachnoid haemorrhage part. I can still think very clearly but am prone to making clerical errors.\n\nIn my first post I offered “branching” as the general term for the joining of stroke to stem. Pablo’s example is more like a join than a branch. If he wants to call it a join that’s fine with me. I’m suggesting “branching” as an umbrella or meta term.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2007 5.01am",
      "content": "_Do you mean philological? Or is that insulting?_\n\nYes, I meant “philological”. It was a simple typo and suggesting you look up “figurative” in the dictionary was not meant to be insulting.\n\n_—-Why do we speak of typeface structure and topology as “anatomy”? Because it makes sense and is useful in analogy._\n\nYes, it does. Why have you assumed I disagree? I am open to other descriptions though\n\nI did not assume you disagree. I offered rationale to back up the use of the term “branching”. That’s all.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2007 5.15am",
      "content": "_Consider how these terms came about, are they specific to language, to nation, to area, to foundry, to typographer, to college, are they from the same source or several, which is correct?_\n\nThey’re from numerous sources. None are neccessarily correct.\n\n_Yes, I am going to opine that some of the terms are quasi-anatomical – where else do you think they come from?_\n\nI gather they come from anatomy, and do not see quasi-anatomical terminology as a problem.\n\n_...the fact that there are alternative descriptions, some that are clearer or more defined, doesn’t mean one is correct and others wrong._\n\nI’m not suggesting that some terms are wrong and others correct. Only that some strike me, and other writers, as preferable.\n\n_Microsoft’s glossary describes the leg of a K as a tail; is that more accurate or clearer than leg (especially when the top diagonal stroke is described as an arm)?_\n\nTail in that instance is not clearer than leg. Perhaps they should change it. It’s a “disagreeably facetious” type glossary.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2007 6.25am",
      "content": "“Is there a term for where a horizontal and vertical stem, meet? Particularly where the bowl meets the vertical stem in letters like p,q,a,d,b.” (asked while pointing to the...crotch of a...p).\n\nAs far as I know, the whole thing (in the direction of the arrow to the next white space, in the pit of the counter), is a join of the branching type, you’d reach just before the round head or reaching the shoulder further on the right-hand branch, as opposed to the square head you’d reach if you took a left at the branch instead. It’s all clear if you start with the roots at the feet and follow the trunk up the body through the legs, past tails and arms, bowls and ears. Gill probably had other ideas.\n\nCheers!\n\n"
    },
    {
      "time": " 29.Sep.2007 6.45am",
      "content": "_the...crotch of a...p_\n\nLOL. :^) You’ve got a great sense of humour David.\n\n_It’s all clear if you start with the roots at the feet and follow the trunk up the body through the legs, past tails and arms, bowls and ears._\n\nSounds like a painting by Rene Magritte :^)\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2007 6.51am",
      "content": "The pros of analogous terminology seem to be that they promote some comprehension among both the design and non-design communities and have a certain elegance.\n\nThe cons seem to be that they are not always precise or are ambivalent.\n\nI am sure there are other entries in both columns.\n\nWhat do other languages use?\n\nCrotch works in the tree analogy, bit out of place in anatomy though.\n\nWish you a speedy and full recovery.\n\nTim\n\n"
    },
    {
      "time": " 29.Sep.2007 6.56am",
      "content": "Tim,  \nI suppose I prefer elegance to precision, but I do like precision a great deal.\n\nWe agree to disagree, so to speak.\n\n_Wish you a speedy and full recovery._\n\nCheers mate :^) Sending you more good vibes.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2007 7.42am",
      "content": "There is very little in type where there is a broad consensus and even when there is there are holdouts and even legitimate exceptions. It’s not a matter of getting to know & memorize a cannon so much as it is a matter of learning multiple ways of doing & describing. That’s why something that really does seem universal or to have a consensus is such a big deal. Terms for ’type anatomy’ are often multiple in English - partly because we have a lot of terms to play with. Think of bowl, aperture, opening, hole. I bet there are a few more. I don’t have a problem with avoiding a state of ’orthodoxy’ in this case. I even think it’s healthy.\n\n"
    },
    {
      "time": " 29.Sep.2007 8.21am",
      "content": "All the old typographers I learned from called it either the “crotch” or a “notch”. Some of the more modest ones would refer to it as the “v notch”. I use the term crotch in my classes.\n\n"
    },
    {
      "time": " 29.Sep.2007 10.11am",
      "content": "That refers more to the negative space, though. The notch is on the outside, the counter is on the inside, and the join is a stroke between them.\n\n"
    },
    {
      "time": " 30.Sep.2007 4.02pm",
      "content": "So the negative space has a name, two names at that(notch/crotch and counter). Why do we need to name the positive space? Or do you think positive space is more important than negative space?\n\n"
    }
  ]
}
