{
  "id": "37575",
  "title": "Looking for a specific motif/ornament swash",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Any suggestion of the font that contain this exact motif (also shown below my username) will be greatly appreciated. Thought it was a Bickham but can't seems to find it there either...Hope to hear back from you soon! THANKS!\n\n ![](http://web.archive.org/web/20141117105909im_/http:/typophile.com/files/Motif_5236.jpg)\n\n",
  "author": "joshua4u2",
  "time": "27 Sep 2007 — 11:45am",
  "uid": "20198",
  "comments": [
    {
      "time": "4 Oct 2007 — 11:07am",
      "content": "You might want to try Poetica Ornaments, though it isn't exact...\n\n\"Thought is a thread and the raconteur is a spinner of yarns, but the poet is a weaver.\"\n\n"
    },
    {
      "time": "5 Oct 2007 — 11:45pm",
      "content": "you can try to reproduce with adobe illustrator. I try today and then I tell you if is ok\n\n"
    },
    {
      "time": "26 Oct 2007 — 11:45am",
      "content": "Anybody still up for this particular motif/font hunt challenge?  \nI even contacted veer.com but nobody...NOBODY seems to be able to locate this motif! Isn't that bizzare? Seriously, whoever can locate this hard to find motif is the real Motif GURU, period! ,-)\n\n"
    },
    {
      "time": "14 May 2009 — 2:59pm",
      "content": "why is it so much harder to locate an ornament vs a type font?\n\n"
    },
    {
      "time": "14 May 2009 — 6:00pm",
      "content": "Because there's not much evidence to work with - basically you posted a shape and it's pretty hard to figure out an entire typeface based on just one shape and even more so when the shape isn't even a letter! Why not just recreate the shape by hand?\n\n"
    },
    {
      "time": "15 May 2009 — 7:52am",
      "content": "It looks like some of the ornaments from Bickham Script, but I didn't see this exact one. Another reason ornaments are so hard to ID is that they may not be shown in the font samples in font books, and some web sites don't show all embedded glyphs in a single Character Map.\n\nThe other problem is that there is not much way to know whether the particular ornament is hand-drawn or not. When there is only one of something shown, you have no way to know.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "15 May 2009 — 11:01am",
      "content": "It reminds me of the ASType Ornaments, but I can't seem to find this exact glyph.\n\n"
    },
    {
      "time": "16 May 2009 — 11:30am",
      "content": "Not an exact match, but [this link](http://web.archive.org/web/20141117105909/http:/moorstation.org/typoasis/ornaments/index.htm) might help in case you settle for something similar (second item: Civilite Tails by Moye & Beatty, 1993).\n\n"
    }
  ]
}
