{
  "id": "37639",
  "title": "Eternal: more angled stress",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Please see my last post for current thoughts...thank you :)\n\n| Attachment | Size |\n| --- | --- |\n| [eternal regular oct08.pdf](http://web.archive.org/web/20150417204817/http:/typophile.com/files/eternal%20regular%20oct08.pdf) | 26.81 KB |\n\n",
  "author": "Bendy",
  "time": "29 Sep 2007 — 6:29pm",
  "uid": "20652",
  "comments": [
    {
      "time": "29 Sep 2007 — 9:20pm",
      "content": "It's pretty obvious that you've assembled these letters from components. They are very good looking components, and this is a great way to start, but now the letters need some individual personality.\n\nThe un-connected horizontal in the A is great. a, c, e could be mistaken for glyphs in a sans-serif font. The tops of the D and R (and q) look really weird to me. I'd straighten out the part where the bowl meets the counter. The curves in the f and j are too straight, bend them more. The g is great, keep it, it fits, and maybe add some serif-ness. The tops of the verticals in the H should match the uppercase I, not the lowercase l. The r has some outline problem -- very faint white space between the vertical and the ear. The S and s are falling over to the right (a common problem). The shaved-off bit on the t is just the kind of personality I think you should add elsewhere. The flair at the end of the z is good, keep it. The & is too wide or bulging -- make the backwards moving part of the curve less horizontal.\n\n"
    },
    {
      "time": "30 Sep 2007 — 2:57am",
      "content": "Thank you for this. Components: yes. That was the only way I could imagine. I have much to learn. I was concerned the letters looked slightly disparate, as though from different fonts. Perhaps that's because they were made from bits. Yes they definitely need more work.  \nThe a,c, and e wanted to stay nice and open and I couldn't see how to fit serifs into them. I quite like the straightish ends.  \nYes, the D and R and q looked funny to me...didn't know I was allowed to straighten that part! I don't like the & at all.  \nWell I'll play with it some more. Thanks for the tips.\n\n"
    },
    {
      "time": "30 Sep 2007 — 6:39am",
      "content": "I like that 'A' as well, although I think the left stroke is probably a bit too thin. Some of your other caps have the same problem.  \n As for the sans-serifness of the 'a' and 'c', try incorporating subtle vertical spurs on the top terminals (and maybe on the 'r' as well), look at your question mark! That is what I mean, basically.\n\nThe 'b' looks fine. As Matt already pointed out, the tops of the 'D', 'R' and 'q' aren't working. I think the 'q' should resemble the 'b' more. Somehow I think the crossbar of the 'f' should be flipped on a horizontal axis, as in that the shaved off slope is going downwards, instead of upwards. The serif on the 'G' looks a bit attached. The top serifs on the 'H' don't look right, I think they should be more like the bottom serifs.\n\nI like where you are going with the 'k', though it could use a bit of character. The 'o' has very bumpy curves, as does the bottom of the bowl of the 'q'. Apart from the 's' leaning to the right, I think it is too light, the spine can use some more weight. I like the 'v' and the 'w'. Last, look at the stress of your contrast, I don't think it is completely vertical. If not, the counter of your 'o' is vertical, it should probably be rotated a bit, to echo the stress of the rest.\n\nI think all in all it could become a very nice typeface. :)\n\n"
    },
    {
      "time": "30 Sep 2007 — 1:33pm",
      "content": "I think your overshoot at the baseline is too big. Take \"n\" for instance. The right stroke goes too low.\n\nLetters have different weight. \"a\" is heavier than \"c\" for instance.\n\nYour S, s and & are falling right.\n\nI like what you did with \"z\" on the bottom, but you'll have to balance it. It looks like the bottom is going too far to the right.\n\n\"g\" looks smaller than other letters (compared perhaps to p and q) because you tried to box it to the descender. Bowls are normally smaller with this style but this one definitely looks smaller than other letters.\n\nIs this font supposed to be a mixture between serif and sans serif? If not, you're going to have to do something about completely sans serif letters (e and c).\n\n"
    },
    {
      "time": "30 Sep 2007 — 2:41pm",
      "content": "It is very nice to have honest and constructive advice where to take this! Thank you. I will iron out the bumps and see where other letters want to go. Await next instalment! Cheers,\n\n"
    },
    {
      "time": "30 Sep 2007 — 10:18pm",
      "content": "There are a few colour issues as well. Look how heavy the 't' appears compared to how light the 'E' is, for example. I think this has a lot of potential, and I love the 'k'.  \n - Lex\n\n"
    },
    {
      "time": "1 Oct 2007 — 3:52pm",
      "content": "This is all very encouraging. The stems on the capitals want to be thicker than on the lowercase. Is that normal? And the curves want to be thicker than the straights? As I said, no technical knowledge, just experimenting and finding what looks right. This is quite possibly far too ambitious. But I guess I won't find out unless I play. Thanks so much!\n\n"
    },
    {
      "time": "1 Oct 2007 — 6:39pm",
      "content": "Yeah, it's quite normal for capitals to look thicker then lowercase. And curves/diagonals to look thicker then straights. You have to optically correct these illusions.  \nBut usually it only takes a couple of units thinner to fix it.\n\n"
    },
    {
      "time": "2 Oct 2007 — 9:16am",
      "content": "Yes, that seems to do it. Busy on the ampersand, colour, wobbly curves and those letters which didn't work yet. Still have most of the uppercase to try too. It gets quite addictive, no? ;)\n\n"
    },
    {
      "time": "2 Oct 2007 — 11:10pm",
      "content": "Just to clarify; there's absolutely nothing wrong with starting a font from component parts. Don't feel bad about that. I just meant that it should be a first step. :)\n\n-matt\n\n"
    },
    {
      "time": "3 Oct 2007 — 5:38am",
      "content": "Thanks :) It was very definitely just a first step!\n\n"
    },
    {
      "time": "3 Oct 2007 — 8:44pm",
      "content": "It's noyce! (very nice)\n\nThere are loads and loads of successful seriffed fonts with a **g** of these \"small\" proportions. It's not so abnormal.\n\n**t** only looks heavy compared to **E** when they're next to each other, mainly because E contains a lot of white space. **t** looks fine in other combinations. The point: typeface design involves compromise. Certain combinations are always going to look awkward. Some type designs manage to minimize awkward combinations, but this one has design parameters that do not allow that degree of optimization. Awkward combinations are something you'll have to live with.\n\n**c** and **a** need serifs. **e** rarely, if ever, has a serif in seriffed fonts. Look at Charter for example.\n\n**r** could benefit from more weight at the end of the stroke---a serif might do the trick.\n\nThe established convention for stroke width is that capitals have a slightly heavier stroke than lowercase letters, because they are larger and appear more natural this way. I don't make this stuff up. Other type designers do.\n\nj a m e s\n\n"
    },
    {
      "time": "4 Oct 2007 — 8:18am",
      "content": "thanks. i can still fatten the E and slim down the t as long as they fit with the other characters, right?\n\nYes, i am beginning to think the a and c need serifs. i wonder if it will begin to look like the Guardian typeface. i hope not.\n\nthe thing with the g was that i didn't actually like it very much and thought it looked out of character somehow. I'm still playing with ideas at this stage. :)\n\n"
    },
    {
      "time": "4 Oct 2007 — 10:00am",
      "content": "_...i can still fatten the E and slim down the t as long as they fit with the other characters, right?_\n\nIf you really weant to do it that way. I wouldn't. Leave **t** and **E** as they are and test them with other characters to see how they look. **t** only looks heavy compared to **E** when they’re next to each other. Certain combinations will look awkward. Test **t** with other characters, test **E** with other characters. If **t** looks okay with other characters there's no reason to change it. Same goes for **E**.\n\nj a m e s\n\n"
    },
    {
      "time": "9 Nov 2007 — 3:23am",
      "content": "See the Draft 2 version. Comments/tips/criticism needed please! :)\n\n"
    },
    {
      "time": "11 Nov 2007 — 1:16pm",
      "content": "Just looking at Eternal Draft 2. The \"e\" somehow bothers me---seems top heavy. The \"s\" and \"S\" I think need to be stronger at the lower terminal. Overall I like where this typeface is going.\n\n"
    },
    {
      "time": "20 Nov 2007 — 12:28pm",
      "content": "i think i'm going ahead with the semiserif idea, for now...perhaps a full serif sibling later. (maybe a sans if i really get into this!)  \nNow putting a spur on the U and wondering about that e. it was the starting point for the whole font and i liked it but perhaps the tail can be longer or something.  \ni can't seem to get the numbers right.  \n:(\n\n"
    },
    {
      "time": "11 Dec 2007 — 10:08am",
      "content": "Hi Ben. The spacing works for display sizes, but the paragraphs of text look a bit tight.\n\n**e** looks okay to me. Take a holiday from your concern with it and deal with it later if it's still bothering you then.\n\nNew binocular g looks fine.\n\nLower case **s** is more problematic. Make a replacement s with serif on bottom arm and post a revised PDF for feedback.\n\nThe thick strokes on lower case **w** , **v** and **y** need to go on a weight loss program ;^)\n\nj a m e s\n\n"
    },
    {
      "time": "11 Dec 2007 — 11:36am",
      "content": "thanks james for that. i tried using the font in word and suddenly realised the M, N, W, w and v both uc and lc are really too narrow. metrics still difficult and i'm trying thicker bottom of s perhaps will add serif there too... can't get my 2,3, and 4 to look right...will post new version when have a moment soon hopefully. i rather like the e. what about the ear of the g? maybe needs to be straight? Italic is looking nice i think so i'll add that in the next pdf. thanks :) for all the ideas.\n\n"
    },
    {
      "time": "11 Dec 2007 — 11:41am",
      "content": "do you think this generally works better as a display font than a text one? i know that's not what you said with reference to the spacing but perhaps that is what it should be. but then perhaps the contrast should be higher?\n\n"
    },
    {
      "time": "11 Dec 2007 — 12:49pm",
      "content": "Yes v could be wider. w and y look okay---they're functional in the text run.\n\nEar of g -- make it larger at the free end tip, and bring it up further above x-line for collision avoidance.\n\n_do you think this generally works better as a display font than a text one?_\n\nThe design and detailing make it shine the most in display applications, altho it's surprising how capable it is at text. Before you go widening sidebearings try the text setting with some positive tracking. If it works reasonably well then you may be able to leave the sidebearings alone for a while. Hope I'm not too late on that.\n\nj a m e s\n\n"
    },
    {
      "time": "12 Dec 2007 — 1:38pm",
      "content": "i'm also fixing some of the serifs as they were all the same size and so slightly unbalanced on some shapes. I'm suddenly not too sure about the capital M. Here anyway is the latest version to have a look at.  \nThank you for your very nice encouragement James :)\n\n"
    },
    {
      "time": "14 Dec 2007 — 6:09am",
      "content": "The latest iteration looks great. I'll get to it in the next few days and try to post something...it's a pretty full stove this weekend.\n\nj a m e s\n\n"
    },
    {
      "time": "14 Dec 2007 — 7:52am",
      "content": "i need to spend time on it as well, so no rush for feedback :)  \nI appreciate your help so far. This is the first font i'm seriously trying to make so it means a lot to hear positive opinions. Thanks,\n\n"
    },
    {
      "time": "16 Dec 2007 — 5:34pm",
      "content": "Well I couldn't look any longer at those particular shapes so had a twiddle and came up with the start of the black weight...if I ever manage to finish the Regular. Or should that be Medium?\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/Eternal-Black_6316.gif)\n  \nPlease ignore the spacing for now!  \nHow can I get around that odd-looking k?  \nJames, is the s working better with that serif on the bottom? \n"
    },
    {
      "time": "16 Dec 2007 — 9:59pm",
      "content": "The black looks very good, and importantly it's got spunk now! Jimmy Cat like very much.\n\nI would keep developing it as the black weight and make an additional font with a big increase in stroke width (but not so much horizontally) and counterspaces almost as large as these.\n\nBug Blatter Megagrotesk has a very fat stroke in all directions and very small counters. Very small counters would ruin your tasteful spunky design.\n\nThe k can be remedied by bringing the arm & leg in so it touches the stem.\n\nAdding the serif to s helps balance it. Extent the bottom arm to the left a bit.\n\nj a m e s\n\n"
    },
    {
      "time": "17 Dec 2007 — 4:25am",
      "content": "Eternal 3\n\na -- add a small amount more rigor to the bowl\n\nd -- south eastern corner looks undecided\n\ne -- this is very good. neat detailing. thin the bar a bit, just a bit.\n\nf -- neat chiselled detailing like the e\n\ng -- test tail gap performance at small sizes in print. This may work better with a wider gap and rounded-off stroke end.\n\nh -- excellent. a nice simple h\n\nk -- gap visible from low earth orbit. your serif design and detailing are very good.\n\nm -- asymmetric serifs and body. asymmetry is good.\n\nn - ain't broke don't fix it\n\no -- reduce horizontals a small amount to match line contrast to stick-and-ball letters.\n\np -- could be drawn narrower, or left as is.\n\nq -- aha...mhm...yep...I see.\n\nr -- detailing and visual interest here is fullsome.\n\ns -- this is being redesigned.\n\nt -- standard t structures have the curl project level with the bar.\n\nu -- narrow it for more \"u-ness\".\n\nv and w -- missing soft detail at baseline vertices.\n\nx -- wonderful x. don't change a thing.\n\nNumberals:\n\n1 -- would be more legible if it was wider. see example\n\n2 -- see example.\n\n3 -- try it with the lower bowl stress reversed---like b. see example.\n\n5 -- if you change the curve body on 3 you'll want to do the 5 as well\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/nummers_4565.gif)\n\nCan we have a PDF with letterspaced text set in columns please. 10pt on generous leading, at least 14pt -- 16pt lead. Ten words per line, play with the tracking until it reads properly.\n\nj a m e s\n\n"
    },
    {
      "time": "17 Dec 2007 — 4:33am",
      "content": "I think the ear of the **r** needs to have some more weight. It has to fit with the other characters. The **s** leans to the left. Try extending the lower left stroke. The **1, 3** and **4** are too light. The **8** leans to the left. Have you tried to make the hook of the **f** a tad longer? (a bit like you have in the **fi** -lig). I think it might define the shape better. The same goes for the **t**.  \nI think the waist of the **k** should be lowered a little bit. It seems to me the lower leg is too long, and the top one too short. Somehow, the **o** doesn't look right. Compare it to your capital **O**. The same goes for your **c** , **e** and the top of the **g**. I think it is the contrast (weight) that needs some work on those characters. The same problem exists in the italic.  \nHow about oldstyle figures? You can make more creative shapes with those, so to decide what kind of numerals you want (and then extend that to the lining figures). I like your questionmark, but the one in the italics seems to be too small?\n\nOverall I think it is definitely coming together pretty nicely. If you loosen up the spacing a bit, you can probably judge longer text settings better. Keep it up. :)\n\n"
    },
    {
      "time": "17 Dec 2007 — 11:45am",
      "content": "Thanks guys :) That's very useful. I'm playing with some of those ideas. The o is looking better i think. The s looks better with the bottom taken left more. In fact all of those comments have helped with the shapes. However, i don't understand some of the phrases...  \n_an additional font with a big increase in stroke width_ | Do you mean like an extended version? Or just as fat as possible?  \n_a — add a small amount more rigor to the bowl_ | Do you mean to take the curve higher on the left side and make the shape rounder on the middle branch?  \n_k — gap visible from low earth orbit._ | Is that a good thing or a bad thing?  \n_q_ | not so great??  \n_t — standard t structures have the curl project level with the bar._ | the 'foot' part? Longer? Not like the other curly feet?  \n_v and w — missing soft detail at baseline vertices._ | Should I round off the flat bits or try slicing angles in there somewhere?  \n_x — wonderful x. don’t change a thing._ | Oops. I think I changed it. Thinner arms and legs...weight loss programme?  \nNumberals...yes...tricky. Am playing with oldstyle but there need to be tall ones too.\n\nHi Jelmar; yes, my biggest difficulty is the contrast and getting the curves smooth and the angle of stress right, as you have noticed...it's very fiddly. I've amended the o and e and about to try the g. The italic so far is just a skeleton and i have not spent much time yet on it. That italic o is horrid. I changed that nice question mark too, i'm afraid.\n\nHere's the changes,  \nI'll post a pdf soon. Then you can find more problems for me to fix ;)  \nThanks for the tips guys, really appreciate it.\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/Revised-letters_4344.gif)\n\n"
    },
    {
      "time": "17 Dec 2007 — 4:27pm",
      "content": "2 and s are much improved. Try growing the oldstyle 2 to caps-height lining size.\n\n\\> an additional font with a big increase in stroke width | Do you mean like an extended version? Or just as fat as possible?\n\nYes. \"Morbidly-obese\".\n\n\\> a — add a small amount more rigor to the bowl | Do you mean to take the curve higher on the left side and make the shape rounder on the middle branch?\n\nSee picture:\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/otaku_3962.gif)\n\n\\> k — gap visible from low earth orbit. | Is that a good thing or a bad thing?\n\nBig gaps can and often do pose problems for reading text. If you halve the width of your isthmus (gap) everything should be fine---it should work at small sizes for text and at display sizes as well.\n\nq is fine. Yep. Yeah buddaye!\n\n\\> t — standard t structures have the curl project level with the bar. | the ’foot’ part? Longer? Not like the other curly feet?\n\nBring the curl out right as far out as the bar end.\n\n\\> v and w — missing soft detail at baseline vertices. | Should I round off the flat bits or try slicing angles in there somewhere?\n\nI'm hoping for one rounded corner versus one sharp, a dialog of soft and sharp.\n\nx — wonderful x. don’t change a thing. | Oops. I think I changed it. Thinner arms and legs...weight loss programme?\n\nNo problem-o.\n\nBen, this is going very well. Pardon my attempts at satire.\n\nj a m e s\n\n"
    },
    {
      "time": "18 Dec 2007 — 5:01pm",
      "content": "Here's that pdf in columns. I have widened the sidebearings so the body text appears as it would with no extra tracking, only justified. Left column is 10/14pt and right is 9/12pt.  \nTo my eye, the spacing is too wide...but perhaps that's because I've got used to narrow spacing.  \nSmall caps are not finished; I still have T through to Y to fix.  \nThe numbers are still fighting me. The 2 is too short and dumpy and the 3 is too heavy. Its bottom hangs out looking bulbous.  \nI got some nice results interpolating the black and the regular to make a bold. The extra fat idea is great...really fudgey, and will probably need a lot of restyling, so that'll wait for now.  \nI lengthened the curly toes of the t and f, pulled up that bowl on the a slightly as you suggested; also, the k has a thinner knee.  \nI shaved off some of the eyelid of the e and likewise on the c. There wasn't enough contrast. Perhaps the G needs to be a smidge wider. I squashed the p in slightly. And that ampersand needs a tweak.  \nI haven't done anything to the italic. But i'm glad you liked the black spunky one :) It's funny how the regular one somehow contained the recipe for the black weight. The e there needs its curves to be a bit tauter, I think.  \nIt's very encouraging to hear positive opinions. I'm sure I would have lost interest without your feedback, so thank you all! And, please, any comments again :)  \nCheers,\n\n"
    },
    {
      "time": "18 Dec 2007 — 5:45pm",
      "content": "The spacing is definitely not too wide. (Dare I say it could even be a tad wider?) I would keep it like this for now.\n\n"
    },
    {
      "time": "18 Dec 2007 — 8:46pm",
      "content": "Yep-yep-yep. The spacing is just right in the columns PDF. You have a good eye for these things Jelmar. It could easily go wider and still be functional, but it will be safer to keep the sidebearings as they are and leave it up to users to add extra tracking.\n\nLooking good Ben :^)\n\nj a m e s\n\n"
    },
    {
      "time": "18 Dec 2007 — 11:51pm",
      "content": "Ben are you going to make alternates for this font? An x-height small capital Q would fit right into the lower case.\n\nj a m e s\n\n"
    },
    {
      "time": "21 Dec 2007 — 2:33am",
      "content": "Hi James,  \nThanks for your idea about the super fat weight...i am starting on that. I found some hints on your Bugblatter page about how to add on weight (bigger overshoots, larger x-height, superelliptical beziers) and it's going to look really super. Definitely obese. Perhaps even callipygian [adj. =\"having beautifully proportioned buttocks\"]\n\nNo sample now, sorry! Later...  \nAlternates, probably...with closed off counters on the B and g and R? Those gaps slightly annoy me. I'd like to add some nice twirly swashes too. I had noticed that the small caps were almost fitting into the lowercase...but there is much else to do first...gosh! the possibilities!  \nDoes the lowercase o need to be wider/rounder? It now begins to look hexagonal :[  \nHappy holidays!\n\n"
    },
    {
      "time": "21 Dec 2007 — 7:11am",
      "content": "That Bug Blatter thing was a quickie done for the fun of it, but if there are things there you can use for your fatboy Eternal, by all means adopt, adapt. \"Callipgyian\" I didn't know that word.\n\nJelmar is right about the ear of **r**. It would benefit from more mass.\n\nThe lowercase **o** looks okay but will probably gain functionality with extra width.\n\nFor the moment concentrate on perfecting the regular.\n\nj a m e s\n\n"
    },
    {
      "time": "21 Dec 2007 — 8:51am",
      "content": "Yah, the regular still needs smoothing and checking each letter in detail. I haven't measured anything yet; it's all done by eyes only, and i now notice i've trimmed too much off the thins (like on V and v). Will concentrate on the details i suppose. Let's hope my eyes do not pop out.  \n:)\n\n"
    },
    {
      "time": "21 Dec 2007 — 10:49am",
      "content": "Take a break. Give your loved one a big hug. Pat the cat (Put the cat out dear. \"I didn't know he was on fire!\")\n\nIt sounds like you may be a little too close to it after much intense effort. I would take a break and give the font to a colleague you trust, ask that person to play with it for a few days, to live with it by doing some comps with it. Then a few days or a week later when you look at the comps you'll have a fresh perspective on the type design---at that point I find my feelings and reaction to it are different.\n\nSeason's greetings.\n\nj a m e s\n\n"
    },
    {
      "time": "21 Dec 2007 — 4:46pm",
      "content": "Absoultely right. I'm stopping for a week! Have fun! :)\n\n"
    },
    {
      "time": "2 Jan 2008 — 5:42pm",
      "content": "Well i came back to this :)  \nI've posted the latest alterations. I've made some of the serifs weightier on the regular, widened the M, looked at the stroke terminals, curly toes and reshaped them. I think the tail of the g and the o still need the contrast to be better. I've given the r a heavier ear.  \nI have still not finished the small caps. I want the tall caps to be right first. Oh, and the numbers are still giving me grief. :)  \nThe italic caps are just sloped for now. All those serifs need reworking and some of the lc shapes, but the bones are there already. I read somewhere that italics are generally narrower than uprights, but mine aren't. Is that a mistake?  \nI like the way extrabold came out, though there were a few odd difficulties such as the northwest corner of the uc N and the shape of the lc w. The crossbars on the E F and H need to be thicker I think.  \nAs for the ultrablack experiment...well!  \nc needs widening. d needs rounding. e was ok until i made it too wide. g is tricky. where to put the weight without the contours crashing into each other? Smaller head? Is it called the head? the circular part. The curly k is not really there yet, but it had to curve like that to stop that leg spreading out to the right and leaving a big white space at the knee. I haven't tried any uc yet.  \nPlease have a look and tell me your ideas. Next i want to focus on getting all the regular shapes in line.  \nThanks for your opinions!\n\n"
    },
    {
      "time": "2 Jan 2008 — 7:50pm",
      "content": "I'm on it. Wat 'til I have my coffee. Mmm! This coffee tastes good. It's fullsome and able-bodied. I'm sure I could use the ultrablack and regular to advertise coffee.\n\nCheck back later Ben. Yes, get the main caps sorted before working on the smallcaps.\n\nj a m e s\n\n"
    },
    {
      "time": "3 Jan 2008 — 5:17am",
      "content": "I'm looking at Eternal 2 Jan. Prepared animations show recommended changes for **g** and **a**. Do something similar to g to the counter of **o**. The change for the hood of **a** is optional. I'm looking for a way to reduce the horizontal thickness of that top part and still make it asymmetric. The modified drawing in the anim isn't successful as far as the shape goes (asymmetry disappearing!), but shows the change in thickness that would complete the **a** , matching the rigor of the hood to that of the bowl, which came up very nicely.\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/eternal_a_anim_6382.gif)\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/eternal_g_anim_6526.gif)\n\n**a** much improved  \n**r** much improved.\n\nWhat's up wth the numbers? Describe the problem(s) in detail.\n\nFor the Extra bold, the crossbars on the E F and H can go thicker, no problem.\n\nFrom what I can see of the ultrablack, **c** looks okay (not too narrow). If you can post a pic of the ultrablack **g** at a decent size I will happily show how to solve its problems. Reducing the size of the upper bowl would be a good start. The upper portion of a binocular g is the body (proper), a.k.a upper occulus, but you can call it the head if you want. **k** is well solved, keep going with that. For the ultrablack generally, your overshoot appears excessive.\n\nItalics are generally narrower than their regular cousins, yep. At this stage of development the regular still has some basic problems that need attention first. Put the italic aside for the time being. When the time comes to build it, yes, narrow those guys by character width and stroke width. Not narrowing your italics isn't so much a mistake as a defiance of convention. We can be philospohical about this; pretend nobody has ever seen the regular font, an italic version with forms not narrowed they would be none the wiser about. Depends who's looking at it. Some designers insist that italics have to be narrow or they're not true italics. Others will accept it on face value.\n\nI need to see a PDF with full character sets (everything drawn so far) of each weight before advising any further.\n\nj a m e s\n\n"
    },
    {
      "time": "3 Jan 2008 — 11:28am",
      "content": "Thanks very much James. i like what you've done with the curvy tip on the g, but that would be the only place such a shape appeared. As for that a, hummmm...I'll experiment.  \nI'm into the regular for now, but here is the g of the ultra bold if you want to see how it can be figured out...i wanted the upper slope of the tail to be nice and thick without squashing the bottom loop, so reducing the height of the body is probably the best way, though with the fatness required, it is in danger of ending up very flat looking, no?\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/fgi_3966.gif)\n\nThe overshoot is sizeable; is it better to reduce that or increase the x-height of the flat letters nearer the size of the round ones?\n\nYour comments are very useful, thank you :)\n\n"
    },
    {
      "time": "5 Jan 2008 — 8:04pm",
      "content": "I've been working on the regular weight. Smoothing and checking the colour and details. I think the uc and lc are looking good now. It's all unkerned so I can see the sidebearings and if anything needs to be adjusted. Does anything need to be adjusted?  \nPlease check the letterforms in case i've missed anything though!  \nJames, i didn't yet try the a and g you suggested but will look at that later.  \nThings i'm not happy with yet: b, o and p are not smooth and it's hard to get the stroke contrast right.  \nNumbers 3 6 and 9 are not quite there and i need to look at them all more closely. The 3 i find too dark on top. The 6 and 9 are just difficult shapes for me. That octothorp is not going to stay so ugly. What should i do with the % sign? Is my comma too odd? £ sign is too light bottom left.\n\nWith the non-English characters, I have not been familiar with some of the shapes and I know some of those diacritics are running wild. Are the accents at the right kind of angle? Is the ogonek nice? Should the breve be rounder? Which way does the µ want to go? I think the ð is too light on the stem.  \nI think my small caps are slightly too dark, but like them with big sidebearings.\n\nI have not done anything with the italics and they are just there for comparison.\n\nHope you like it :)\n\n"
    },
    {
      "time": "5 Jan 2008 — 11:04pm",
      "content": "Hey Ben,\n\n\\* **f** -- You probably drew the bar shorter than the hood to avoid collisions on the x-line. It can stay that way if you want it to. A lot of fonts are designed that way. The alternative is to have the bar project as far right as the tip of the hood---like the t but upside down. The f-bar will then tend to crash into x-line serifs (or come very close), but will fit better with rounds.\n\n\\* **f-ligs:** compare the whitespace inside those ligatures with the whitespace between their individual component letters when typed in the same combinations. Space the ligature stems for consistent color and encapsulated whitespace. The standard form for an **f i** ligature is to bring the finial (beak) out to the position the dot of the i would otherwise occupy. The finial on your **f-i** lig could be a bigger lump to emulate the presence of the i dot. **f-l** is okay. **f-f** -- try dropping the hood of the first f about half the distance between x-line and ascender line, then extending the hood it until it mates with the back of second f, and make the bar between them a bit thinner.\n\n\\* **h** looks a bit wide in the body. Recommend narrowing it some to even up the color. Same could be done for **n**.\n\n\\* **m** might integrate better and improve overall color if the arches were narrowed, but subtly. Try it and see how it looks.\n\n\\* **b o p** A whop bop-a-loo-bop, a-whop bam-boo! It is entirely possible you are over-critical of these fellas. Only **o** is in serious need of adjustment. Make the counter taller then recenter it. Test, test, test. Put it all aside and go for a walk. While out walking think about your loved ones, or interest yourself in the street life and details of houses and cars. It's a woopy raggy world we live in. I always get a clearer perspective if I go for a walk when I'm too close to the thing I'm working on.\n\n\\* Capital **J** is dropped design. Will work in some combos but look funny with others. Recommend making alternate lining J, to give users a choice. We live in a world partly driven by consumer choice.\n\n\\* Gap on **k** is about right now. Try narrowing gap on **K** to match. Test it, see how you like it. If the wider gapped K makes more sense to you then keep it.\n\n\\* Numerals: 6 and 9 take some effort to master. Study the 6 and 9 in other people's fonts (OPFs), look closely at the way the bowls join onto the stems. Learn the form. Try to emulate it. Have patience. 3 is basically okay. Angled left stroke of 4 can angle in to the right more (harmonize with 7), as you have plenty of gap next to the vertical stem. Biggest concern here is top bowl and diagonal stroke of 8. Top bowl is small, not a serious fault but a stylistic concern. Diagonal stroke needs to be thinner\n\n\\* comma tail, make it shorter.\n\n\\* Euro symbol incorrect form according to industry spec. The right tips of the bars should be staggered to form a diagonal alignment, like they've been cut by a slash. Bars will also benefit from more space between them. See example:\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/euroslash_5280.gif)\n\n\\* angled bottom of exclamation stroke is a nice touch :^)\n\n\\* mu symbol is fine, no need to adjust except maybe make the descender serif asymmetric or a curl if you want. Your choice.\n\n\\* Yen symbol -- give the bars more air, and extend them as far left and right as tips of upper v structure. See example:\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/yenbars_5035.gif)\n\n\\* Bar and Brokenbar -- to distinguish Bar from similar characters like **l** and **I** , I draw Bar about fifty to a hundred units higher than the ascender line as well as the descender line. Amount of extension depends on the font. You've got the width right. Set the bearings nice and wide. Bar attains some of its functionality from the whitespace either side of it. Set up Brokenbar the same way as Bar.\n\n\\* Asterisk is very cool by way of its impression of motion. Looks like it's spinning. Some designers insist it should appear static, but spectators seldom notice small details like that. Five prongs the way to go.\n\n\\* Percent sign -- thin the connecting bar until it looks elegant (not pedestrian). Move the zeros away from the slash. Aw man they need air. Check it at small sizes to guage how much. Looks like you adapted the 7 for the slash. Hee-hee! Make the slash thinner too. Having a curved slash is another nice touch.\n\n\\* Accents -- angles are all fine. Ogonek is noyce, oye loyke it. Breve curve is fine but make the whole breve narrower. Lower case thorn ð stem is fine, but thin the bar down and reposition for less eccentric symmetry.\n\nMost of the sidebearings look okay except for a few:\n\n\\* right sidebearing of **b** may be too short. Study combinations b-e, b-o. Compare the right side bearing of **b** with that of o, e. If they are the same then the bad combos I'm seeing in the PDF may be due to errors by InD CS2.\n\n\\* right bearing of **g** looks too short. Adjust, check in combination with everything else in the lower case. Adjust until it works with the most probable combinations.\n\n\\* **l** , right bearing and possibly left one. Set the bearings by measuring from the stem. Ignore the curl tip. The basic formula for a lower case is to set the sidebearings for the stem letters -- b, d, f, h, i, j, k, l, p, q, t -- all more or less the same. They don't have to be exactly the same, but that often works well. For the bowl pairs b-q d-p, this only applies to the stem side of them, not the bowl side.\n\n\\* How short are the bearings on **t**? The right side looks a bit wide. A formula for designing lower case **t** is to set the sidebearings so they are the same distance from the stem as l and i. Then bring the tips of the bar on **t** out (or bring them in) until they are at zero with the sidebearings, or very close to zero. You can make them negative if need be.\n\n\\* Set up **f** the same way as **t**.\n\n\\* **v V y Y** --- usually the bearings on these are zero or close to zero. For a seriffed font it's not unusual to set the bearings negative.\n\n_Hope you like it :)_\n\nI love it :^)\n\nj a m e s\n\n"
    },
    {
      "time": "6 Jan 2008 — 5:29am",
      "content": "The purple flag indicates harmony,  \nthe best I could do copying and  \npasting the tail of **5**.  \nTry _something_ like that.\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/eternal35anim_5842.gif)\n\nj a m e s  \n\"bleeple bleeple\"\n\n"
    },
    {
      "time": "6 Jan 2008 — 7:10am",
      "content": "Hi James  \nThere's a lot of good stuff here. Thank you.  \nIt's funny how sometimes what I expect to work actually looks wrong, and good-looking shapes just happen by lucky accident.  \nWe did have a walk yesterday...a peace walk in central London to protest against the Burmese junta, with monks and nuns and gentle folk. It was quite meditative and a good break from work and beziers :) but I think I am addicted to type design, which may indicate I am in the wrong job (marketing coordinator!)...  \nThanks for all your recommendations. I'll go carefully through them next time I open the font file.\n\n"
    },
    {
      "time": "12 Jan 2008 — 7:29pm",
      "content": "_It’s funny how sometimes what I expect to work actually looks wrong, and good-looking shapes just happen by lucky accident._\n\nYep. That's generally the way. Allow for some fudging to be part of the final forms. A certain percentage of what you're drawing has been predetermined by 500 years of type design history, and the 3000 years of letter history before that.\n\n_...I think I am addicted to type design, which may indicate I am in the wrong job..._\n\nYou too! Type has done a job on me, I know that much.\n\nj a m e s\n\n"
    },
    {
      "time": "15 Jan 2008 — 3:49pm",
      "content": "Diddle di dee.  \nIt's fiddly work. I'm repairing the 8, thinning the h, m, n, grappling with the 3, 5 and o, bending the % in all directions, getting the bearings of the t all up around my ears and redrawing the M and W like this...is there a way to describe those shapes...more modern?\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/Eternal6_5777.jpg)\n\nAnd I had a go at interpolating:\n\n ![](http://web.archive.org/web/20150417204817im_/http:/typophile.com/files/Eternal-Weights_4339.gif)\n\nSlowly slowly...still fiddling :)  \nthanks,\n\n"
    },
    {
      "time": "15 Jan 2008 — 4:44pm",
      "content": "Compare the 'e' in your Extra Bold weight with that of the Regular. The one in the Regular needs more contrast (thick/thin), just like you did in the Extra Bold. It probably doesn't only apply to the 'e', but possibly every character with a similar contrast in it (well, maybe not all, because I can't see all of them in the image). The contrast of the 'a' in the Regular is much better than that of the 'e', for example.\n\n(By the way, it would be convenient if you could upload a new PDF every now and then for viewing it up close).\n\n"
    }
  ]
}
