{
  "id": "37652",
  "title": "My new logo",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m not a designer but have been asked to come up with a logotype for a friend’s blog.\n\nHer blog is called ’fartings’. Apart from insisting on lowercase, all ideas have been left to myself, including font and colour choice. Point size is 52 (Blue Highway) and 20 for the script (Dali), and is for Web only. I have not done any alternatives (yet!)\n\nThe blog is personal, with a fairly direct slant, without, hopefully, being offensive.\n\nI haven’t shown her the results yet and would be very grateful if I could have the benefit of some critique.\n\n ![](http://web.archive.org/web/20081009203119im_/http:/typophile.com/files/fartings_6158.gif)\n\n [‹ Illustration forums/websites?](http://web.archive.org/web/20081009203119/http:/typophile.com/node/37427 \"Go to previous forum topic\") [Dots Font Similar to Helvetica Extended ›](http://web.archive.org/web/20081009203119/http:/typophile.com/node/37641 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081009203119/http://typophile.com/user/22303\" title=\"View user profile.\">Tommy32</a>",
  "time": "<br>",
  "uid": "22303",
  "comments": [
    {
      "time": " 1.Oct.2007 1.14am",
      "content": "Hi There.  \nI like the contrast between the typefaces but I find the “just read it” hard to read. I am not sure how big it will be on the blog, but the thin parts of the letters seem to be getting lost. Could another hand-written like font be substituted, perhaps one that might perform on the screen a bit better?\n\n"
    },
    {
      "time": " 1.Oct.2007 3.46am",
      "content": "I chose Dali script for the ’just read it’ subtitle because, to me, it suggests a quick, almost knee-jerk outpouring of thoughts and ideas, and supports the self deprecating blog-site title. I felt it important to use a script which most closely mimics handwriting, rather than a script with separate characters and that the thin strokes in the text support the desired effect. It’s quite possible I may be completely wrong. The size of the graphic will be the same size as is shown here.\n\nI have tried other, more legible script fonts such as Ginette or Georges, but they don’t appear to match the ’take it or leave it’ attitude the owner wishes to impart on the site, while, of course, ensuring the whole is constructed with the greatest care and belies the thoughtful, carefully-constructed writing in posts.\n\n"
    }
  ]
}
