{
  "id": "37656",
  "title": "'Difference'",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi, I'm a university student and have been recently been given this typographic project to do titled 'Difference'. I felt the subject was ideal for a forum discussion and figured posting it would generate good views on the subject from others.\n\nProject Brief:  \nProduce a logo, 8 page exhibition brouchure and three panels for an exhibition in the Campus foyer which looks at the conflicting views of designers reguarding the use of personal style in the generation of communication design work. The debte was very much in evidence in the early 1980's with the increasing use of technology in creative production but it has been an underlying issue in the way designers have always worked. Your approach should be objective in illustrating the philosophies of both camps but stimulating enough to interest those who may not be aware of the difference in approach. As a major element of the exhibition is concerned with the role of type in design the final pieces should focus upon the application of type as an expressive medium with imagery forming an effective complement.\n\nI'm not so much looking for ideas for my outcome but was more interested in others views on the debate topic. If your not too aware of the debate here's a link to an article about it, though its from more of a web design point of view but the idea is still there [www.adobe.com/designcenter/dialogbox/stylevsdesign](http://web.archive.org/web/20131018102536/http:/www.adobe.com/designcenter/dialogbox/stylevsdesign \"www.adobe.com/designcenter/dialogbox/stylevsdesign\") . I was hoping by posting on this forum I would be able to get perspectives from more of a typography stand point (I figured this forum would be a good source of views of typographers with much better experience/knowledge than myself). I look forward to any replies. Thanks\n\n",
  "author": "jarbinson",
  "time": "30 Sep 2007 — 11:11am",
  "uid": "22306",
  "comments": [
    {
      "time": "30 Sep 2007 — 4:25pm",
      "content": "_the increasing use of technology in creative production_\n\nA myth.  \nNew technology replaces old, that's all.\n\n"
    },
    {
      "time": "30 Sep 2007 — 8:26pm",
      "content": "Oy, that’s one pretentious design assignment.\n\n"
    },
    {
      "time": "1 Oct 2007 — 5:19am",
      "content": "I don't really see it as pretentious. The purpose of the project is to put forward the views of two sides of a debate. The idea is not to say that one side is correct over another - or to demean the way any designer operates. Its more about stimulating a healthy discussion about a topic within the design community.  \nAlso to your point Nick - the sentence reads:  \n\"The debate was very much in evidence in the early 1980’s with _the increasing use of technology in creative production_ **but it has been an underlying issue in the way designers have always worked.**  \nThe point about technology is only an aspect of it - a catalyst within the issue.  \nAnyway, here is another article which I thought was an interesting read... see what ya think. [www.alistapart.com/articles/bathingape/](http://web.archive.org/web/20131018102536/http:/www.alistapart.com/articles/bathingape/ \"www.alistapart.com/articles/bathingape/\")\n\n"
    },
    {
      "time": "1 Oct 2007 — 7:52am",
      "content": "What, exactly, is the debate? Style vs. Design? What's to debate?\n\n"
    },
    {
      "time": "1 Oct 2007 — 12:27pm",
      "content": "I think the two links I posted are a good read to get a better idea of the debate. I'm new to the issue myself and thats why I initially posted, to see others opinions so I'm not completely knowledgeable on the subject myself yet. In summary though, the issue is about designers using popular style in their designs or aesthetic appeal over the fundamental teachings of communication design. By fundamental teachings I mean proper font choice and usage, grid systems and hierarchies. A good example would be Josef Muller-Brockmann’s seminal book “Grid Systems In Graphic Design,”. It speaks about the mathematical aspects of good communication design - how grid systems are essential in visual communication. Are designers forgetting about these aspects of design? - Its all well and good to create a piece that looks great, but if the message is lost then surely it makes it bad design.  \nOn the other side of the coin you can argue that the designers style and aesthetic appeal is more important. If the design uses devices that relate to popular culture is that more important? An good example of this would be to look at raygun magazine. Its a magazine from the 80's 90's and had a different look for every spread - an interview was even printed in dingbats in one issue - obviously totally unreadable but in keeping with the style of the magazine.  \nI don't know if this helps, maybe I'm not communicating the issue correctly. If anyone has any views on this though Id love to hear them.\n\n"
    },
    {
      "time": "1 Oct 2007 — 6:09pm",
      "content": "This is good discussion fodder.  \nI think it is important to have both, and that is not to say that they are mutually exclusive. Systems can be expanded upon, new systems can be created and they can be purposely ignored/abandoned.\n\nFoundations and general laws of what works or what has worked are important, as design is about connecting and communicating to a wider audience, but one shouldn't be suffocated by rules, and usually new ideas are introduced from those who aren't classically versed / haven't had their minds polluted with what is 'right' or 'wrong'. Knowing the rules has value so long as personal intuition isn't lost.\n\nA lot of design application comes down to what needs to be said and who it's being said to.\n\n"
    },
    {
      "time": "1 Oct 2007 — 6:21pm",
      "content": "_an interview was even printed in dingbats in one issue - obviously totally unreadable but in keeping with the style of the magazine_\n\nIt was an interview with Bryan Ferry who Carson didn’t like, so he set the text in Zapf Dingbats. That wasn’t style but content related.\n\n"
    },
    {
      "time": "2 Oct 2007 — 6:48am",
      "content": "\"I think the two links I posted are a good read to get a better idea of the debate.\"\n\nI'm going to be the cynical troll in this thread so... ;o)\n\nAgain, what's the debate? Design is design, style is style. They're pretty well defined terms in the world of design.\n\nBoth of those articles aren't debating anything...they're just defining, yet again, the two terms.\n\n\"I don’t know if this helps, maybe I’m not communicating the issue correctly.\"\n\nI think you are...just that it's a rather vapid assignment, IMHO. Not your fault, of course. It seems more akin to pundit fodder than any sort of meaningful debate.\n\nAnyways, I always like architecture analogies:\n\ndesign = space planning, the studs, the foundation, pipes, wiring, etc.\n\nstyle = aesthetic decisions for the walls, floors, fixtures, paints, art, furniture\n\nBoth are important for the success of the project. When one should have more emphasis than the other is entirely Dependant on the particular project/client goals/needs.\n\n"
    },
    {
      "time": "3 Oct 2007 — 9:33am",
      "content": "I'm surprised by the resistance I'm reading in this thread. I don't know if it's a good thing or a bad thing. I'd expect more people to jump in.\n\nFirst, I agree that the \"project brief\" is badly written. I don't know how it was decided that there were exactly two opposing camps on the subject (and it doesn't even clearly state what the two camps believe, although I can guess).\n\nBut anyway, I do think this is a subject that can be, and has been, discussed. Personally, I don't think the discussion has much real-world value. One can worry about the correct amount of \"style\" to apply to one's design, but in the real world, it seems to me, there is a client, and audience, money, deadlines, ego, and all of that, which completely overrule any idea of what might be purely correct or proper. Design in the real world is part of a very complicated system, which in turn determines what is right and wrong.\n\nI mean, if one is a designer with a distinctive style, one will find that style is either a success or failure in the real world. The client/customer will like it or not. They will be willing to pay for it or not. It will be seen -- or not. It might successfully communicate (something), but if nobody ever sees it, then who cares?\n\nA designer can attempt to strip all distinctive style from their design, but it still has to get through that client firewall. It might communicate, but it might be dull.\n\nNow, as far as the purely academic question goes -- does a preponderance of style help or hinder effective communication? -- it depends, doesn't it? To some extent, the brain will respond to something it finds appealing, whether or not it is pure information or some stylistic artifice. Again, it's complicated. The real world decides.\n\n"
    },
    {
      "time": "3 Oct 2007 — 10:19am",
      "content": "Hopefully this doesn't derail things, but here's a thought:\n\nShould Graphic Design be taught in the Art College, or the Business College.\n\nI, like most (all?) graphic designers went to art school. But isn't Graphic Design really more about business communication?\n\nPerhaps that's the crux of the perceived debate...is graphic design 'art' or 'design'? It is, of course, both, but that's hardly a debate.\n\nI've always liked the term 'commercial artist'. Perhaps it's nostalgia, but it seems to better define what most of us do day-in/day-out to make a living.\n\n"
    },
    {
      "time": "3 Oct 2007 — 10:26am",
      "content": "I've always hated the term \"commercial artist\". And \"production artist\", for that matter. I'm not an artist; I am a designer.\n\n"
    },
    {
      "time": "3 Oct 2007 — 10:34am",
      "content": "NOW we have a debate! ;o)\n\nOr maybe not...as I actually agree with Ken.\n\nI suppose it's the same debate interior designers have with interior decorators who call themselves designers.\n\nIn the end, it's really just a semantics debate.\n\n"
    },
    {
      "time": "3 Oct 2007 — 7:57pm",
      "content": "_In the end, it’s really just a semantics debate._\n\nThat could be said about numerous threads at Typophile ;^)\n\nj a m e s\n\n"
    },
    {
      "time": "5 Oct 2007 — 11:12am",
      "content": "Thanks for all the feedback from the post, keep it coming if you have any more thoughts. Good valid points made - the ideas behind the debate mentioned in the brief has been a stumbling block for me, it would have been nice if the debate was clarified in the brief. Last week I found it hard to start my design work as I didn't have a good idea of the information that I was supposed to be communicating (got slated by the tutor too about it). It still seems a bit of a grey subject area - not as black and white as the brief made out.  \nI did read another article since the initial post that I found helpful - rather insightful and an interesting read. It focuses around the points made in the last few posts of art vs design. Here's the URL if you fancy a read - [www.aiga.org/content.cfm/art-vs-design](http://web.archive.org/web/20131018102536/http:/www.aiga.org/content.cfm/art-vs-design \"www.aiga.org/content.cfm/art-vs-design\") - It has a forum after the article too but I'd love to hear any thoughts about it in this forum. I was also wondering if anybody had any typographic views around the issue - Its a typographic project so I have to use type to try to convey the two sides of the debate - maybe there aren't any real typographic issues around the idea of style vs design but I thought I'd ask in case, and typophile seems to be the best place to do it.\n\n"
    },
    {
      "time": "6 Oct 2007 — 1:49am",
      "content": "Searching for “form follows function” and “Ornament and Crime“ may yield more (one-sided) opinions. It seems to me that briefs like this are intended to propel your investigation and conclusion as much as they are to produce a piece of design work, not entirely unreasonable as it can help form a method you might employ in professional life, relating that experience through the design helps potential clients/employers.\n\nTim\n\n"
    },
    {
      "time": "7 Oct 2007 — 10:54am",
      "content": "Ornament and Crime has recently come to my attention but I have not found a copy of it yet, only references to it. Any ideas timd?\n\n"
    },
    {
      "time": "7 Oct 2007 — 11:17am",
      "content": "[http://www.bookprice24.co.uk/isbn/9780920397770](http://web.archive.org/web/20131018102536/http:/www.bookprice24.co.uk/isbn/9780920397770 \"http://www.bookprice24.co.uk/isbn/9780920397770\")\n\nOr a library should be able to locate a copy, and this might be of interest, I believe it is available in more than one anthology  \n [http://www.studio-international.co.uk/archive/loos\\_1973\\_186\\_957.asp](http://web.archive.org/web/20131018102536/http:/www.studio-international.co.uk/archive/loos_1973_186_957.asp \"http://www.studio-international.co.uk/archive/loos\\_1973\\_186\\_957.asp\")\n\nTim\n\n"
    }
  ]
}
