{
  "id": "37680",
  "title": "(x) Text face used by Foreign Languages Publishing House, Moscow - Literaturnaya (Latinskaya) {Andrij}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I have an old novel by Dostoyevsky - The Insulted and Humiliated - printed by Foreign Languages Publishing House, Moscow. No date of publication is given. The impress of the letters is such that they can be felt with one's hand on the page - like braille? - and the type often shows through from the reverse side of the page. Thin vertical bars occasionally appear between characters. It's an otherwise handsome, and dare I say lavish, volume. I'd like to know (a) what typeface this is, and (b) has anyone attempted to simulate these printing effects in a digital medium?\n\n",
  "author": "ffetish",
  "time": "1 Oct 2007 — 2:59am",
  "uid": "16361",
  "comments": [
    {
      "time": "1 Oct 2007 — 3:01am",
      "content": " ![](http://web.archive.org/web/20130820090923im_/http:/typophile.com/files/insulted2_5198.jpg)\n\n ![](http://web.archive.org/web/20130820090923im_/http:/typophile.com/files/insulted_4774.jpg)\n\n"
    },
    {
      "time": "1 Oct 2007 — 3:04am",
      "content": "EDIT: Nevermind\n\n"
    },
    {
      "time": "1 Oct 2007 — 5:05am",
      "content": "isn't [Literaturnaya](http://web.archive.org/web/20130820090923/http:/paratype.com/pstore/default.asp?fcode=PT_LIT&letter=L), almost only soviet typeface ;))\n\n"
    },
    {
      "time": "1 Oct 2007 — 4:40pm",
      "content": "Yes, Literaturnaya looks to be the one ... I had a feeling Paratype might hold the answer. From their website:\n\nDesigned at NII OGIZ type design bureau circa 1940. Based on Latinskaya of the Berthold foundry (St.-Petersburg, 1901), Cyrillic version of Lateinische of H.Berthold (Berlin, 1899). The digital version was developed at ParaType (ParaGraph) in 1996 by Lyubov Kuznetsova. The favorite text typeface of Soviet typography.\n\nThanks for the I.D.\n\n"
    }
  ]
}
