{
  "id": "37704",
  "title": "Typeface design considerations for specific language",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello all,  \nLong time lurker, first time writer here.\n\nI am a graphic design student and I’m starting my thesis work on typeface design. My intention is to design a typeface specially for setting finnish language texts. My only problem thus far is, that I’m not sure what I should take in consideration when designing the typeface specifically for a single language. I know about fixing kerning and such, but I have no idea what else there is. If there even is anything more.\n\nSo, I’m hoping someone here could point me to some direction, on where to find some information on this. Books, essays or webresources that I can actually quote on my thesis would be wonderful, but any kind of comments on the matter are appreciated.\n\nThank you,  \nKai Talonpoika\n\n [‹ Apostrophe For InDesign](http://web.archive.org/web/20071121084417/http:/typophile.com/node/37830 \"Go to previous forum topic\") [Logotype vs. Logomark ›](http://web.archive.org/web/20071121084417/http:/typophile.com/node/37607 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071121084417/http://typophile.com/user/22356\" title=\"View user profile.\">kai.talonpoika</a>",
  "time": "<br>",
  "uid": "22356",
  "comments": [
    {
      "time": " 2.Oct.2007 4.04am",
      "content": "Viileä, check the first book (from the top) of this [list](http://web.archive.org/web/20071121084417/http:/www.as8.it/edu/bibliography-TD.html).  \nMoiks.\n\n"
    },
    {
      "time": " 2.Oct.2007 4.08am",
      "content": "Hello Kai, fellow countryman, and welcome!\n\nThere has been some discussions on umlauts especially  \n [http://www.typophile.com/node/28078?page=1](http://web.archive.org/web/20071121084417/http:/www.typophile.com/node/28078?page=1 \"http://www.typophile.com/node/28078?page=1\")\n\nAnd another thread about the location of umlauts  \n [http://typophile.com/node/31042](http://web.archive.org/web/20071121084417/http:/typophile.com/node/31042 \"http://typophile.com/node/31042\")\n\n"
    },
    {
      "time": " 2.Oct.2007 4.45am",
      "content": "One thing to consider, is whether the language contains unusual lettercombinations that can cause problems. In norwegian, for instance, the combination _gj_ is quite common (_Gjengen gjekk gjenom gjerdet_), and in many otherwise great typefaces this combination causes the letters to collide in a terribly unaesthetic way.\n\nAnother thing to check, is the frequency of different types of letters. If a language contains a lot of uppercase letters, like german, it is often wise to make the uppercase letters look less dominant. The same goes for letters with ascenders, descenders or umlauts.\n\n"
    },
    {
      "time": " 2.Oct.2007 7.32am",
      "content": "Many vowels, many umlauts, long words. Hypenation issues with long words, ascender height for numerous diacritics, kerning diacritics to each other.\n\nChrisL\n\n"
    },
    {
      "time": " 2.Oct.2007 7.37am",
      "content": "Here is a quote from Mili in a prior thread:\n\n“A nice Finnish word to keep you going:  \nlentokonesuihkuturbiinimoottoriapumekaanikkoaliupseerioppilas  \nunfortunately it doesn’t have any of our umlauts, like this charming word: töölöläinen”\n\nChrisL\n\n"
    },
    {
      "time": " 2.Oct.2007 10.27am",
      "content": "“lentokonesuihkuturbiinimoottoriapumekaanikkoaliupseerioppilas”  \nGrowing up as I did, surrounded by Finnish-Americans, I had to spell this in a bee once! So I know that it translates (roughly) to: “hold on a minute, while I ask you to hold on a minute.”\n\nCheers!\n\n"
    },
    {
      "time": " 2.Oct.2007 11.00am",
      "content": "So David, how did you finnish up in that spelling bee? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 3.Oct.2007 12.29am",
      "content": "Thank you all on your insights. Can I assume that there aren’t ’proper’ resources on this subject? Book that Alessandro mentioned seems interesting, but based on Amazon’s blurb on it, it might be bit off topic. I’ll be checking it out though.\n\nArild mentioned checking letter frequencies, and I’ll be doing. Friend of my did a small programme for me, that I can feed text in to and it counts frequencies of letters, letter pairings and letter triplets too. That ought to prove sufficient, I hope.\n\nThanks all.\n\n"
    },
    {
      "time": " 3.Oct.2007 9.15pm",
      "content": "kai, check out typotheque’s letter frequency metter:\n\n[http://www.typotheque.com/type\\_utilities/lettermeter/](http://web.archive.org/web/20071121084417/http:/www.typotheque.com/type_utilities/lettermeter/ \"http://www.typotheque.com/type\\_utilities/lettermeter/\")\n\n"
    },
    {
      "time": " 7.Oct.2007 6.42am",
      "content": "Oh, that looks very interesting. Will have to play around with it more. Thanks.\n\n"
    },
    {
      "time": " 7.Oct.2007 1.42pm",
      "content": "I don’t think language is the primary factor to consider, but code pages.  \nIf your typeface supports a particular code page, then ALL the glyphs you create for its characters should fit nicely with one another—because it’s not just frequent combinations you want to look good, but every combination, and just about every combination will show up in text eventually, somewhere or other, and your typeface should be prepared to deal with them all.\n\nFrequency combination charts are useful in reducing the number of kern pairs for non-class-kerned fonts, but well-designed fonts don’t have a lot of kern pairs anyway.  \nKai, this business of letter frequencies is a red herring (a falsity, an irrelevance, a distraction).\n\nWhen languages non-native to the designer have special characters, such as, for me, the Slovak “lcaron” and “dcaron”, then it helps to see how the character works in setting. That’s an interesting example—because for a long time Slovaks have been making do with foreign fonts that treat the accent more like an apostrophe, inserting a gap into the accented word. Now Peter Biľak (Typotheque) is saying, “Wait a minute, a gap in a word, caused by a mere accent, is silly,” and designing types which minimize the width of that accent.\n\nCorrect me if I’m wrong, but I don’t think there is any special concern for Finnish, typographically speaking, other than frequent diereses. So you should pay special attention to getting the dieresis right; in particular the distance between the dots, their size and vertical position relative to the dot on “i”, and, as Chris says, how it may kern, with T,V,W,Y and f.\n\nHaving said that, there are letter combinations that occur in Finnish that are unlikely in English, such as aa. If you look to older typefaces from English-language designers as your model, it may well be that the aa combination is not anticipated in their design.  \nBut I think such errors are less likely in newer typefaces, as type designers are better informed on such matter now.  \nAnyway, if you are proceding from scratch—which is the best way to go— rather than “reviving” or modifying other designs, you won’t have to worry about that kind of thing.\n\nFor a “pan-latin” perspective, these are excellent resources:\n\n[www.diacritics.typo.cz](http://web.archive.org/web/20071121084417/http:/www.diacritics.typo.cz/ \"www.diacritics.typo.cz\")  \n [www.microsoft.com/typography/developers/fdsspec/lowercase.aspx](http://web.archive.org/web/20071121084417/http:/www.microsoft.com/typography/developers/fdsspec/lowercase.aspx \"www.microsoft.com/typography/developers/fdsspec/lowercase.aspx\")  \n [www.microsoft.com/typography/developers/fdsspec/diacritics.aspx](http://web.archive.org/web/20071121084417/http:/www.microsoft.com/typography/developers/fdsspec/diacritics.aspx \"www.microsoft.com/typography/developers/fdsspec/diacritics.aspx\")\n\n"
    }
  ]
}
