{
  "id": "37705",
  "title": "Logotype for Event agency",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi all.\n\nWhat do you think about this logotype for an event agency? I like the simple symbol (G). Please explain how I could improve it.\n\nThanks.\n\n| Attachment | Size |\n| --- | --- |\n| [Gutierrez.pdf](http://web.archive.org/web/20080706164127/http:/typophile.com/files/Gutierrez.pdf) | 53.75 KB |\n\n [‹ Hit Radio N1 / New Logo - What do you think](http://web.archive.org/web/20080706164127/http:/www.typophile.com/node/38085 \"Go to previous forum topic\") [CASINI (Household brand) ›](http://web.archive.org/web/20080706164127/http:/www.typophile.com/node/37796 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706164127/http://www.typophile.com/user/22360\" title=\"View user profile.\">Fernando_Gutierrez</a>",
  "time": "<br>",
  "uid": "22360",
  "comments": [
    {
      "time": " 2.Oct.2007 6.32am",
      "content": "Nice, but I find that something isn’t in place.  \nIMO, you have two options:  \n1. make the “pixel” G (nice) more like the one from the font you used (by “condensing” it, so to speak)  \n2. use a font with a G more like the pixel one you made (you used Helvetica Neue Condensed, but the pixel G does not look like a condensed font).\n\nBye  \nA.\n\n"
    },
    {
      "time": " 2.Oct.2007 8.28am",
      "content": "The text should line up with the ’G’ inside the box. Also, I wouldn’t recommend combining raster graphics with vector graphics unless you need to incorporate a photo. It’s easy enough to redraw your ’G’ logo as a vector graphic, which will help eliminate the anti-aliasing around the edges.\n\n- Lex\n\n"
    },
    {
      "time": " 2.Oct.2007 4.05pm",
      "content": "First of all. Your symbol and text in the logo don’t align with each other.\n\nANd I guess the rasterized G is to closed. The serif on top shouldn’t go that deep. Get one pixel out. Or even half a pixel. Who’s gonna know...\n\nOr maybe to make things a bot sophisticated. Take your rasterized G and use it as basis for a more smart sign. Cut some sides at different tha 90 deg angles etc. Don’t overdo, so it should still look like that base was raster letter.\n\nOh yes. And definitelly vectorize the G as Lex suggested. It should be very easy.\n\n"
    },
    {
      "time": " 3.Oct.2007 8.48am",
      "content": "Thanks for all comments. I’ve made the symbol into vector now. I will probably leave the symbol as it is.\n\nThough, you have all right that the font to the text (brand name) isn’t fitting. I tried to experiment with “orphan” and “bandwith” (pixel fonts) together. But I didn’t get satisfied.\n\nDo you have any ideas on a font I could use? When I used Courier New (which is a bit pixly), I got the objective impression that the company was a news database.\n\n"
    },
    {
      "time": " 3.Oct.2007 11.27am",
      "content": "Here’s something I worked on today:\n\nQuite better if you ask me (click)\n\n"
    },
    {
      "time": " 8.Oct.2007 2.12pm",
      "content": "I’m going to print that logotype tomorrow morning. If you have any comments, please write them down.\n\nThanks again.\n\n"
    },
    {
      "time": " 8.Oct.2007 5.42pm",
      "content": "I thing the first version was better. Font choice was going better with the symbol. So was its size. I don’t see any bigger difference in the symbol though...\n\nI suggest you don’t rush into print just yet.\n\n"
    },
    {
      "time": " 9.Oct.2007 7.52am",
      "content": "I like this one. Comments?\n\n[http://aycu31.webshots.com/image/29710/2005289795627205620\\_rs.jpg](http://web.archive.org/web/20080706164127/http:/aycu31.webshots.com/image/29710/2005289795627205620_rs.jpg \"http://aycu31.webshots.com/image/29710/2005289795627205620\\_rs.jpg\")\n\n"
    },
    {
      "time": " 10.Oct.2007 1.15pm",
      "content": "I never liked double symbols. One is on the left an another on the letter “i”. Why is always my reason... Do they complement each other? I don’t see the connection.\n\nI liked the original more than any subsequent solution.\n\n"
    },
    {
      "time": " 11.Oct.2007 6.44pm",
      "content": "I don’t like they way there is a ’g’ followed by another ’g’. It reads badly.\n\nI find that the ’g’ in the box is erroneous. Try to tell a story about the service through the logotype.\n\n"
    },
    {
      "time": " 12.Oct.2007 5.32pm",
      "content": "Pixelated fonts represent a lack of resolution, and to me it seems rude to flaunt that as a virtue. Especially a design virtue.\n\nMerely a reminder of crummy technology. (I wish I had been allowed to smash my first computer to pieces with a sledge hammer)\n\n"
    }
  ]
}
