{
  "id": "37723",
  "title": "(x) Someecards website light sans - Gill Sans {Jan E}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hey, Newb here. I acquired limited experience in printmaking when I was in school, but I’m far from a typophile. I was hoping someone here would quickly be able to tell me what font the website someecards is using for their greeting cards, since it would probably take me a year of browsing typefaces to figure it out. I checked it against some of the fonts I know are trendy (i.e. helvetica) but, nothing.\n\n[http://www.someecards.com/](http://web.archive.org/web/20071214062100/http:/www.someecards.com/)\n\n [‹ (x) Exact version of Garamond? - Adobe Garamond {Lex}](http://web.archive.org/web/20071214062100/http:/typophile.com/node/37738 \"Go to previous forum topic\") [Diesel Fall/Winter 2007 logo ›](http://web.archive.org/web/20071214062100/http:/typophile.com/node/37730 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071214062100/http://typophile.com/user/22379\" title=\"View user profile.\">nave</a>",
  "time": "<br>",
  "uid": "22379",
  "comments": [
    {
      "time": " 2.Oct.2007 1.41pm",
      "content": "That’s Gill Sans.\n\n"
    },
    {
      "time": " 2.Oct.2007 1.44pm",
      "content": "It’s Gill Sans Light to be precise: [link](http://web.archive.org/web/20071214062100/http:/www.myfonts.com/fonts/agfa/gill-sans/familytree.html)\n\n"
    },
    {
      "time": " 2.Oct.2007 1.56pm",
      "content": "Jan - very swift, thank you. I see that’s the same typeface the BBC uses. I also see its status is still only commercially available, albeit fairly cheaply in comparison to another I was looking at (i.e. Lisboa Sans @ $300). How does that work, anyway. I would have figured that after nearly 80 years a typeface family would be noncommercial.\n\n"
    },
    {
      "time": " 2.Oct.2007 1.57pm",
      "content": "Right, Light. I actually picked that part up myself. :)\n\n"
    },
    {
      "time": " 2.Oct.2007 2.07pm",
      "content": "\\> How does that work, anyway. I would have figured that after nearly 80 years a typeface family would be noncommercial.\n\nThe Gill Sans trademark is owned by Monotype, an existing company and the originating foundry.\n\n"
    },
    {
      "time": " 2.Oct.2007 2.07pm",
      "content": "_I would have figured that after nearly 80 years a typeface family would be noncommercial._\n\nThe typeface design may be old, but don’t forget that it had to be digitized and what you have to pay for is the license to use it as software (fonts are software).\n\n"
    },
    {
      "time": " 2.Oct.2007 3.03pm",
      "content": "\\>but don’t forget that it had to be digitized\n\nIt’s easy to take that tedious task for granted I guess. Thanks for the reminder.\n\n"
    },
    {
      "time": " 2.Oct.2007 7.37pm",
      "content": "Charles Gibson! Gawd I finally got past all the crap in my brain to pull the iconic illustrations of Gibson, and his Gibson girls, from the memory banks.\n\nCurse of a eidetic memory ...sigh.\n\n"
    }
  ]
}
