{
  "id": "37720",
  "title": "Typeface for personal letters and correspondence",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What face(s) do you use for personal letters and correspondence? For health reasons I am having to drastically scale back a serious handwriting habit-- I write many personal letters each week and journal constantly. I'm not looking for a face that replicates handwriting (though if any exist that don't get annoying after more than a paragraph or so, I'd be glad to know).\n\n",
  "author": "fncll",
  "time": "2 Oct 2007 — 12:04pm",
  "uid": "4313",
  "comments": [
    {
      "time": "2 Oct 2007 — 1:00pm",
      "content": "Tell us more about your personality.\n\n"
    },
    {
      "time": "2 Oct 2007 — 1:59pm",
      "content": "Handwriting fonts say more about the creator's personality and tend to wear out their welcome in long correspondence. The italic versions of some of the regular text fonts are extremely readable and would give a more informal feel if that's what you're after (e.g Goudy Oldstyle italic). But Stephen is right: you need a font to match your personality, or at least the tone you prefer to convey.\n\n"
    },
    {
      "time": "2 Oct 2007 — 2:32pm",
      "content": "Thanks... so, my personality: technology educator by day, poet by night. I love letterpress objects and fine books, though I can't afford too much of either. When I read, I tend to read with a pen in hand and mark liberally (I love marginalia and notes by others), so I don't revere every printed book as sacred. My taste is eclectic in just about everything (modern pop to classic jazz, prose poetry to classical forms) but if push comes to shove I'll take the old school over the new school. My own writing consists primarily of short poems, prose poems, and lyric personal essays.\n\nMoving to typing letters is painful for me because I have a real crazy fetish for fountain pens (I have scads) and fine cotton papers. Very close to that is my penchant for buying every kind of notebook/blank book/journal I find, which I fill with a lot of journalling, drafting of creative pieces, commonplace books of quotations, etc. For all of that, my handwriting is atrocious and I have not one whit of artistic talent, though I've tried calligraphy and sumi-e and even type design.\n\nIn person I'm the introvert in the crowd until the switch is flipped and then I'm the class clown, the one with the quick joke and I always have a sarcastic and/or ironic addition... I like making people laugh, particularly the ones with the secret, radiant smile. I teach, and my teaching includes some elements of stand-up comedy, performance art and monologue :)\n\nMy letters tend to be long, philosophical, include quotes and assemblages of words that have caught my fancy, and often don't include any of the typical \"news\" (the weather is fine, the kids are good, etc) or even a well-defined beginning or end. They stop and start and the assumption is the reader knows who I am and that I will likely write again to add more.\n\nHandwriting and comic faces aren't my thing... I want something that has a touch of formality but isn't all play... and not all work (I love TEFF Trinite and Lexicon, Storm Jannon and Regent but they seem more suited to a memoir than a letter) either.\n\nThat probably doesn't help a bit :)\n\n"
    },
    {
      "time": "2 Oct 2007 — 3:35pm",
      "content": "If you like the TEFF fonts you mention but find them _too_ formal (and the price is quite up there), you might have a look at a typeface like [Dolly](http://web.archive.org/web/20150102203704/http:/www.underware.nl/site2/index.php3?id1=dolly&id2=roman). It somewhat has the Lexicon-look, but less serious looking, yet not too playful either. :)\n\n"
    },
    {
      "time": "2 Oct 2007 — 4:45pm",
      "content": "Dolly is a great suggestion. Other original and organic text faces with a nod to traditional type and calligraphy: [Relato](http://web.archive.org/web/20150102203704/http:/www.fontshop.com/fonts/downloads/emtype/relato_family/), [FF Maiola](http://web.archive.org/web/20150102203704/http:/www.fontshop.com/fonts/downloads/fontfont/ff_maiola_ot/), [FF Quadraat](http://web.archive.org/web/20150102203704/http:/www.fontshop.com/fonts/downloads/fontfont/ff_quadraat_ot/).\n\n"
    },
    {
      "time": "2 Oct 2007 — 5:51pm",
      "content": "Thanks for the suggestions... I am checking them out now!\n\n"
    },
    {
      "time": "2 Oct 2007 — 5:53pm",
      "content": "I find [Elysium](http://web.archive.org/web/20150102203704/http:/www.itcfonts.com/fonts/font/pid/243015/Elysium+Complete+Family+Pack/detail&grab_id=0&page_id=50305&query=Elysium&SCOPE=ITCFonts) works well where you have crafted your narrative and want the reader to savour and think about what you've written. A distinctive typeface with a bit more weight than typical text faces. Has an attractive, legible italic, old style figures and small caps, and you can get it in a reasonably priced OpenType package.\n\n"
    },
    {
      "time": "9 Oct 2007 — 2:59am",
      "content": "As you are a poet, you might like Kent Lew's [Whitman Italic](http://web.archive.org/web/20150102203704/http:/www.kentlew.com/WhitmanCharSet2.html), a font which he has previously suggested might be useful for setting poetry. In my experience, it certainly looks very good in pull quotes. And a range of Display weights have now been added and will soon be available from Font Bureau.\n\n"
    },
    {
      "time": "10 Oct 2007 — 2:41am",
      "content": "[http://www.veer.com/download/pdf/olicana\\_specimen.pdf](http://web.archive.org/web/20150102203704/http:/www.veer.com/download/pdf/olicana_specimen.pdf \"http://www.veer.com/download/pdf/olicana\\_specimen.pdf\") is based on my handwrititng. It is an informal script with many OT features for a convincing appearance. There are both Rough and Smooth styles.\n\nNick Cooke\n\n"
    }
  ]
}
