{
  "id": "37749",
  "title": "(x) Metropolis magazine nameplate - Champion Gothic Bantamweight {Michael A}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "anyone know what font they use in the logo? and who designed it and when, if possible?\n\n ![](http://web.archive.org/web/20130406025501im_/http:/typophile.com/files/metropolisflag_6330.jpg)\n\n",
  "author": "devika257",
  "time": "3 Oct 2007 — 7:52am",
  "uid": "22091",
  "comments": [
    {
      "time": "3 Oct 2007 — 8:09am",
      "content": "Would that be HFJ Champion?\n\n"
    },
    {
      "time": "3 Oct 2007 — 8:10am",
      "content": "If memory serves it would be Champion Bantomweight.\n\n"
    },
    {
      "time": "3 Oct 2007 — 10:23am",
      "content": "Looking at the counter on the R, I would say this is Knockout No. 66 'Full Flyweight', according the Hoefler catalog I have here.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "5 Oct 2007 — 3:30am",
      "content": "hmm... very hard to tell... need a vote! thank you... it seems closer to champion though...\n\n"
    },
    {
      "time": "5 Oct 2007 — 3:31am",
      "content": "yes. definitely champion... i'm going with Champion Bantomweight.\n\n"
    },
    {
      "time": "6 Oct 2007 — 12:43pm",
      "content": "I think it is hard to tell, and I'm not sure who picked my answer as the correct ID. Here are both samples from the HFJ site.\n\n- Mike Yanega\n\n ![](http://web.archive.org/web/20130406025501im_/http:/typophile.com/files/METROPOLISsamples_5306.gif)\n\n"
    },
    {
      "time": "6 Oct 2007 — 3:46pm",
      "content": "I did, because I run this place. :^P ;^) :^D\n\n"
    },
    {
      "time": "6 Oct 2007 — 6:38pm",
      "content": "It's entirely possible that the two fonts in question are the same outlines with different names, since Knockout is H&FJ's expansion of Champion.\n\n"
    },
    {
      "time": "7 Oct 2007 — 1:08pm",
      "content": "Aha! I'll ask Jonathan next time he pops up on iChat.\n\n"
    },
    {
      "time": "7 Oct 2007 — 1:21pm",
      "content": "I fired up iChat and there he was. ;^)\n\nJonathan thinks it's Champion, though it's pretty hard to tell for sure, also because he thinks -- whatever it is -- it's been messed with. The outlines of H&FJ Knockout and Champion are not the same, but they're very close in the capitals at the thin end of the spectrum. Most of the juju happens in the lowercase, and in the proportions in general plus various things in the terminal strokes of the C, G, and S.\n\nSee below for a comparison of Champion above, & Knockout below.\n\n ![](http://web.archive.org/web/20130406025501im_/http:/typophile.com/files/Metropolis_4516.jpg)\n\n"
    },
    {
      "time": "8 Oct 2007 — 1:56am",
      "content": "thank you! i think i agree with jonathan... it seems to be closer to champion, and has definitely been altered... like the T.\n\n"
    },
    {
      "time": "8 Oct 2007 — 12:13pm",
      "content": "Well, I'm happy if everyone else is. I think this one would have fit the \"Gudonov Rule\", i.e. If the choices are so close that you'd have to see the original sample side-by-side with the choice to tell them apart, then the choice is 'Gudonov' to use. (I know this is bad, but the Rule is a good one, whatever you call it.)\n\n- Mike Yanega\n\n"
    },
    {
      "time": "8 Oct 2007 — 2:40pm",
      "content": "\\> _(...) then the choice is ’Gudonov’ to use._\n\n:^D\n\n"
    }
  ]
}
