{
  "id": "37741",
  "title": "Relationship between Headers/Indent/body in a magazine",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all\n\nThis is my first post.  \nHope that will be a learning place for me.  \nMy first chalenge is to build a page layout for a magazine.  \nI want to create a Relationship between Headers/Indent/body.  \nI want inicialy start with free fonts (but we could use commercial also- I like minion for the Body by the way).  \nModern/Serious/Traditional/Formal  \nIts a magazine for medical articles that will be mostly text with small illustration or photos.\n\nThanks in advance  \nAntónio\n\nPS- Any links for articles/tutorial of this subject please let me know.\n\n [‹ Help: Client asking for revisions and I have reached my creative limit](http://web.archive.org/web/20080324121438/http:/typophile.com/node/35094 \"Go to previous forum topic\") [Photography Forums ›](http://web.archive.org/web/20080324121438/http:/typophile.com/node/37998 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080324121438/http://typophile.com/user/22399\" title=\"View user profile.\">afonseca1974</a>",
  "time": "<br>",
  "uid": "22399",
  "comments": [
    {
      "time": " 3.Oct.2007 8.09am",
      "content": "Can you explain with other words what you mean with “Headers/Indent/body” ?\n\n"
    },
    {
      "time": " 3.Oct.2007 9.48am",
      "content": "Sorry...  \nHere is an image to better visualize my terms.  \nPlease feel free to correct me.\n\nAntónio\n\n ![](http://web.archive.org/web/20080324121438im_/http:/typophile.com/files/img1_5008.jpg)\n\n"
    },
    {
      "time": " 4.Oct.2007 2.16am",
      "content": "Now its my turn to ask you what do you mean by “has to be automatic”?  \nI now this is a very subjective issue, but I want some opinions about fonts.  \nWhat I used here, what I saw there. The body in minion will be fine with the header in Arial and you could try to place the indent in italic helvetica, etc.  \nSince this is a medical magazine with articles I need some Modern/Serious/Traditional/Formal fonts.\n\nThanks in advaced  \nAntónio\n\n"
    },
    {
      "time": " 4.Oct.2007 7.59am",
      "content": "Sorry, I meant automatized, does the “Relationship” has to be automatized ?\n\n"
    },
    {
      "time": " 4.Oct.2007 2.21pm",
      "content": "No, the “Relationship” don’t has to be automatized.\n\nAntónio\n\n"
    },
    {
      "time": " 5.Oct.2007 6.21am",
      "content": "“The body in minion will be fine with the header in Arial and you could try to place the indent in italic helvetica, etc”\n\nI think if you are doing the body in Minion, then you should choose either Helvetica or Arial for heads and indents. Use the regular italic and/or bold for the heads, contrasting or matching the indent depending on the tone you need for the content. E.G. if it’s a softer story, use Helvetica regular heads and regular or italic for the indent, or when you’ve got something harder, use the Helvetica bold for heads and sightly condensed italic for indents. If you want, you can also get a Minion Bold Condensed of some sort for heads. If you get enough Minion, you could easily do the whole thing in Minion for a Modern/Serious/Traditional/Formal magazine for medical articles.\n\nCheers!\n\n"
    },
    {
      "time": " 6.Oct.2007 6.54pm",
      "content": "What you are calling an “indent” is more commonly known as a “deck” in American magazine design lingo, or as a “standfirst” by the Brits.\n\n"
    },
    {
      "time": " 8.Oct.2007 6.10am",
      "content": "Technical journals often use Times for body and Helvetica for heads and subheads. Particularly if they haven’t been redesigned in the past 20 years.\n\nYour choice of Minion and Helvetica would be a definite improvement, and would still maintain the comfortable look to your medical readership.\n\n"
    },
    {
      "time": " 8.Oct.2007 5.13pm",
      "content": "Thanks all for the input.\n\nAntónio\n\n"
    },
    {
      "time": " 9.Oct.2007 4.02pm",
      "content": "New chalenge!  \nNow that I choose the type all minion, or minion + helvetica what about the best size and number of colums for cientific articles?  \nFrom my early studies  \nA4- 1,5cm from the border (all 4 sides), 2 colums with 8,5cm each (1cm in the middle).  \nOpinions?\n\nI’m also considering to add a picture (or illustration) for each article in order to have a more “colored” magazine. Not sure what to do in terms of sizes and place to put. Of course I can move them throw out the magzine but any suggestions are welcome (read someplace that they should not be placed in the middle (?!)).\n\nAntónio\n\n"
    },
    {
      "time": " 9.Oct.2007 4.02pm",
      "content": "New chalenge!  \nNow that I choose the type all minion, or minion + helvetica what about the best size and number of colums for cientific articles?  \nFrom my early studies  \nA4- 1,5cm from the border (all 4 sides), 2 colums with 8,5cm each (1cm in the middle).  \nOpinions?\n\nI’m also considering to add a picture (or illustration) for each article in order to have a more “colored” magazine. Not sure what to do in terms of sizes and place to put. Of course I can move them in the magzine (one here other there, etc) but any suggestions are welcome (read someplace that they should not be placed in the middle (?!)).\n\nAntónio\n\n"
    },
    {
      "time": " 10.Oct.2007 7.22am",
      "content": "Two columns sounds right for the line width you describe. You might find 1 cm gutter between to be a bit much. 1 pica is traditional and I think 1 cm is over 2 picas. Do a test and see, you might want to cut the gutter to 0.5 or 0.75 cm.\n\nMany articles in scientific works start with an abstract, and this is traditionally set in a single column. Use a larger type size and an indent so that the line measure does not get to be too long.\n\nIllustrations can be either one or two columns wide, as appropriate. A 1 column illustration in the middle of a two column layout can be problematic, as you have been told, because the word spacing around then (where the type goes to a half column) can be too loose.\n\nWhat you really need to do is to build a dummy page now, to see how things look. Post the PDF and we will be better able to comment on it.\n\n"
    },
    {
      "time": " 11.Oct.2007 7.52am",
      "content": "Here they are my first tests!  \nOnly text/with one image in 2 columns and other in one column!  \nComments please!  \nThanks.\n\nAntónio\n\n ![](http://web.archive.org/web/20080324121438im_/http:/typophile.com/files/pagina1_5445.jpg)\n\n ![](http://web.archive.org/web/20080324121438im_/http:/typophile.com/files/pagina2_4406.jpg)\n\n ![](http://web.archive.org/web/20080324121438im_/http:/typophile.com/files/pagina3_5420.jpg)\n\n"
    },
    {
      "time": " 11.Oct.2007 10.58am",
      "content": "I think you will have to employ hyphenation, especially with scientific vocabulary, watch the indents too – you seem to have varying amounts and don’t need them after subheads necessarily. You should also keep in mind that scientific articles will often include footnotes.\n\nTim\n\n"
    },
    {
      "time": " 11.Oct.2007 11.07am",
      "content": "Is that set solid? I think Minion, being pretty dark, will look better with some leading. Also the abstract all in italics is too much for me as a reader. The more usual would be to have it in a smaller size, indented on both sides. Minion has optical sizes, so you could take advantage of that.\n\n"
    },
    {
      "time": " 12.Oct.2007 2.23am",
      "content": "Thanks for the comments. New test:  \n- Use of hyphenation.  \n- Leading to 108%.  \n- Remove the italics in abstract, indented on both sides.  \n- Place title of article in header (number of pages of the article to).  \n- Number of page and date of magine on footer.\n\nLooks better to me now :)\n\nAntónio\n\n ![](http://web.archive.org/web/20080324121438im_/http:/typophile.com/files/pag2_5400.jpg)\n\n"
    },
    {
      "time": " 12.Oct.2007 2.25am",
      "content": "oops...not sure is image is to big for good visualization.\n\nAntónio\n\n"
    },
    {
      "time": " 12.Oct.2007 5.52am",
      "content": "After seeing the first example, I was going to suggest the indenting of the abstract, which you have done on the second example. I suggest trying it at double the amount ... it may not look better, but it is worth a try (your goal is to keep that line of text in the 60-90 characters per line range, to improve readability).\n\nAlso, some publications will use italics for the abstract to signify it is not a part of the article itself. I’m ambivalent on that one myself. Blocks of italic can be harder to read, but a visual signal of uniquness is useful.\n\n"
    },
    {
      "time": " 12.Oct.2007 6.12am",
      "content": "Watch out for the curse of the Helvetica r when it is followed by t, f or n especially in headlines.\n\nTim\n\n"
    }
  ]
}
