{
  "id": "37753",
  "title": "Equivalence between In Design tracking and FontLab?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi there,\n\nI am tweaking the spacing in one font and I would like to know how the values in InDesign tracking and the FL’s ’Adjust metrics’ are related.\n\nAre InDesign values (5, 10, 25, 50...) percents? If I increase spacing in FL by percent will I get similar results?\n\nThanks in advace.\n\nR.\n\n [‹ Free Family Naming Software?](http://web.archive.org/web/20081204123718/http:/www.typophile.com/node/37769 \"Go to previous forum topic\") [apple, pages and justification bug ›](http://web.archive.org/web/20081204123718/http:/www.typophile.com/node/37760 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081204123718/http://www.typophile.com/user/1137\" title=\"View user profile.\">RamiroE</a>",
  "time": "<br>",
  "uid": "1137",
  "comments": [
    {
      "time": " 3.Oct.2007 8.46am",
      "content": "Yes, you will get the same results. Both applications work in 1/1000 of an em (not percent).  \nRemember that in FL you need exactly half the value since you typically change both sidebearings.\n\n"
    },
    {
      "time": " 3.Oct.2007 1.16pm",
      "content": "Tim, that’s not completely accurate: FontLan works in whatever the UPM of the individual font is, which is 1000 in most PostScript fonts, but may be any value in TTF or OpenType (including PS OpenType). 2048 is used in many TT fonts, because it is a power of 2 and thise provides very slightly faster processing times during scaling. Some companies settle on a standard UPM to use in all their fonts, many opting for 1000 since it gives them easy compatibility if they are making both Type 1 and TTF. But since I don’t make Type 1 any more, and I tend to tailor the UPM to the particular typeface or the writing system I’m working with. Some styles of lettering and some scripts benefit from a higher UPM, which can express greater detail.\n\nInDesign’s tracking units are, as you say 1/1000th of an em.\n\nFontLab’s units are 1/UPM. So if the UPM of the font is not 1000, you need to adjust your FontLab units accordingly to match the InDesign tracking.\n\n"
    },
    {
      "time": " 3.Oct.2007 2.41pm",
      "content": "Oops, should have thought of that. Thanks for the correction.\n\n"
    },
    {
      "time": " 4.Oct.2007 11.13am",
      "content": "Thanks John and Tim. Now is very clear.\n\n"
    }
  ]
}
