{
  "id": "3778",
  "title": "Akzidenz Grotesk",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Just wondering which foundry's digitisation of Akzidenz Grotesk you consider to be the best.   \n   \nLinotype or Berthold?\n\n",
  "author": "iota",
  "time": "24 Mar 2004 — 7:06pm",
  "uid": "1111",
  "comments": [
    {
      "time": "1 Apr 2004 — 12:59pm",
      "content": "In the US, it doesn't matter. If you're rich, you can afford a lawyer-army, and you get your way. I wouldn't mind so much, if I didn't keep hearing American tourists complaining about \"the bribery problem in the 3rd world\". Akhoulsharmoota.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Apr 2004 — 8:25am",
      "content": "Think that's ridiculous? Check [this case](http://web.archive.org/web/20141109082920/http:/laniels.org/weblog/tech/microsoft/jurisdition_shopping.html) out.   \n   \nWindows vs. Lindows becomes Windows vs. Lin\n\n"
    },
    {
      "time": "2 Apr 2004 — 8:32am",
      "content": "\\> [Money is] an international legal language.   \n   \nCertainly. The problem is that while the rest of the world realizes is wallowing in mud (and has lousy leaders), the US thinks it's doing great! This has the result that social improvement becomes even more difficult. The formalization of bribery (political lobbying, PACs, etc.) is much worse than bribery itself.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Apr 2004 — 11:22am",
      "content": "That part of it seems semi-reasonable, but the part that I find ridiculous is Microsoft's arguement that Lin\n\n"
    },
    {
      "time": "7 Apr 2004 — 1:28pm",
      "content": "But people can still express their displeasure in whatever way works for them, including not buying stuff from a company they feel is behaving unethically. We live on a small world, and bad behavior is contagious.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 2:43pm",
      "content": "Nigel, where do you live?   \nIt seems you have no idea how the US really works. But maybe ignorance is bliss!   \n   \n\\> what is \"unethical\" or \"bad behavior\" about protecting valuable intellectual property?   \n   \nAs always, it's not what you do, but how you do it.   \n   \n\\> \"prior art for Delta\" is irrelevant regarding trademarks.   \n   \nIrrelevant to whom? To the abusive corporation who has the desire and ability to launch a frivolous lawsuit that it knows can't be challenged by the poor slob individual because you have to be rich to go to court to begin with? In the states, the only really good strategy for financial stability is this: don't attract the gaze of the cyclopses. And the cyclopses know this - heck, they set up this decrepit system!   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 3:04pm",
      "content": "Nigel, you simply don't know Berthold's history. And the fact that nobody with half a brain will reveal it in public is telling.   \n   \n\\> Irrelevant to whether it qualifies to be registered as a trademark.   \n   \nWho cares. Humans come first.   \n   \n\\> perhaps you might be happier living somewhere else.   \n   \nNot \"perhaps\", most definitely. But I'm not about to explain my life to you and your ilk.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 3:35pm",
      "content": "So I guess you think I have less than half a brain?   \nThat says more about you than me.   \n   \nBTW, I would learn to clean sewage before learning about IP.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 8:00am",
      "content": "\\> it is essential to protecting intellectual property.   \n   \nIn the same way that cluster bombs are essential to imperialism?   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 10:29am",
      "content": "\\>it is essential to protecting intellectual property   \n   \nLeaving aside Hrant's raving, my impression that many on these boards do not understand the legal situation with intellectual property rights, which are important to the type business.   \n   \nAs Nigel says, my understanding is that the owner of a trademark is required to sue or risk losing ownership of the trademark. This is perhaps a bad law, but that is the box that it puts the trademark owner in. If all that Berthold is doing is protecting its trademarks, I do not think they can be faulted for that, and people should not boycott them for that reason.   \n   \nIn the US, my understanding is that only the name can be trademarked, and that in general design itself is not protected. The laws do seem to need changing, but Berthold should not be blamed for the box that the law puts them in.   \n   \nI am not a lawyer, and I do not know about Berthold's business practices generally, but there needs to be some understanding of the problem any digital foundry faces.   \n   \nPerhaps other owners of digital foundries can comment.\n\n"
    },
    {
      "time": "8 Apr 2004 — 10:37am",
      "content": "\\> many on these boards do not understand the   \n\\> legal situation with intellectual property rights   \n   \nThat's secondary. Most people on these boards understand something much more important than the technicalities of IP law - they understand what it is to be decent, and why decency is the central pillar of a healthy society.   \n   \nYour society favors bastards over decent people. So of course your laws are crappy. Dismiss it as \"ranting\" if you like, and it might take decades, but the revolution is coming, and heads will roll. If you care about your grandchildren, you will repent as soon as possible.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 2:22pm",
      "content": "Nigel, you wrote that Linotype no longer delivers the Akzidenz Grotesk. That's right. But nowadays Linotype delivers 4 weights and 4 italics of the Basic Commercial typeface. If you look at [www.linotype.com](http://web.archive.org/web/20141109082920/http:/www.linotype.com/) you will be able to read the following sentence: \"Basic Commercial font is based on the design for Akzidenz Grotesk, which appeared with Berthold in 1900, designed by type setters whose names have not been recorded, but whose skill cannot be overlooked. This typeface has been popular among groups and movements so diverse as the Bauhaus, Dadaism, and the masters of Swiss typography. It served as an influence for a variety of newer, more anonymous grotesque fonts as well as Helvetica. Basic Commerical font is a clear and objective font whose forms exhibit almost nothing unusual, but which remains both lively and legible\".   \nBasic Commercial is available in OpenType with the better hinting, But also in PS and TT for non-InDesign users.\n\n<!--attachment: 14056BasicCommBold-32980.pdf*mime_pdf.gif*application/pdf*16.0*BasicCommercialBold*14056BasicCommBold%2epdf --><!--attachment: 14056BasicCommBold-32980.pdf*mime_pdf.gif*application/pdf*16.0*BasicCommercialBold*14056BasicCommBold%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20141109082920im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">BasicCommercialBold<br><a href=\"http://web.archive.org/web/20141109082920/http:/www.typophile.com/forums/messages/4100/14056BasicCommBold-32980.pdf\" target=\"_blank\"><b>14056BasicCommBold.pdf</b></a> (16.0 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "8 Apr 2004 — 2:58pm",
      "content": "Nigel,   \n   \nThere is a lot more to the Berthold story than has been discussed here. In my opinion, none of the big stories have been brought up so far. I wish I could talk about it, but even this message is probably more than I ought to say.   \n   \nI can note that Berthold fonts were formerly available from Adobe, Agfa Monotype and Linotype, and that all of these companies are no longer resellers of Berthold designs.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "8 Apr 2004 — 4:33pm",
      "content": "Wow, you're right. I should have checked on that. I guess AMT had a better ending to the story than the rest of us. So it's just Adobe and Linotype that no longer sell Berthold fonts.   \n   \nT\n\n"
    },
    {
      "time": "8 Apr 2004 — 5:30pm",
      "content": "Thomas Phinney wrote to Nigel:\n\n"
    },
    {
      "time": "8 Apr 2004 — 5:35pm",
      "content": "Wow, it sounds like Berthold are really bad actors. Is there anywhere on the internet that the 'big stories' are told?\n\n"
    },
    {
      "time": "8 Apr 2004 — 6:01pm",
      "content": "Ice-T: \"Freedom of speech - just watch what you say.\"   \n   \nWilliam: well of course not - and that's exactly the point. And the problem of course isn't a single company, it's the system which allows and even encourages companies to behave in this way.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2004 — 1:05am",
      "content": "jumping in late here with a few points   \n   \nPrior Art, while mostly cited in patent and copyright cases,   \ncan also apply to trademarks.   \n   \nYou can file a trademark as   \n   \na) the word   \nb) the design alone   \nc) word + design   \n   \nthe patent examiner will check active trademarks   \nfor possible conflicts, thus checking for Prior Art.   \n   \nIn the Berthold/Delta situation specifically, Prior Art, taken literally, is   \nindeed irrelevant but Prior Use is not.   \n   \nWilliam wrote \"my understanding is that the owner of a trademark   \nis required to sue or risk losing ownership of the trademark.\"   \n   \nNot quite right. It will help you if you can   \nshow a track record of protecting your mark.   \nBut there is not requirement to sue.   \nIt's not about that.   \nBut if you have a trademark that is in jeopardy,   \nnowadays, you probably are spending your money elsewhere.   \nOn advertising.   \nThat's how you keep from 'losing' a mark from   \nit becoming genericized.   \n   \n   \nTake Xerox, Wite-Out, Band-Aid, Velcro and some   \nothers. The owners of these marks take out ads every month in various magazines   \n(usually Writer-oriented publications) that spell   \nout proper usage of their marks in print.   \n   \nKleenex (TM) brand disposable tissues, etc.   \n   \nthe older brands did not do that ... if I'm not mistaken.   \nSo these brands today can point to a pile of money   \nspent educating others on proper usage   \nif the generic nature of their mark becomes an issue.   \n   \nAs far as Berthold, it's interesting to look specifically at the Delta mark's history.   \n   \n   \n   \n2004-02-17 - Registered - Principal Register   \n   \n2003-11-25 - Published for opposition   \n   \n2003-11-05 - Notice of publication   \n   \n2003-09-22 - Approved for Pub - Principal Register (Initial exam)   \n   \n2003-08-07 - Communication received from applicant   \n   \n2003-08-27 - Case File in TICRS   \n   \n2003-08-07 - PAPER RECEIVED   \n   \n2003-04-11 - Letter of suspension mailed   \n   \n2003-03-27 - PAPER RECEIVED   \n   \n2003-02-03 - Letter of suspension mailed   \n   \n2002-11-14 - Communication received from applicant   \n   \n2002-11-14 - PAPER RECEIVED   \n   \n2002-11-05 - Case file assigned to examining attorney   \n   \n2002-06-21 - Case file assigned to examining attorney   \n   \n2001-04-18 - Letter of suspension mailed   \n   \n2001-02-09 - Communication received from applicant   \n   \n2000-08-18 - Non-final action mailed   \n   \n2000-07-18 - Case file assigned to examining attorney   \n   \nI don't know if this TM just got forgotten when a   \nsale of the business was happening? I know   \nnothing about the Hunts, but become more and   \nmore curious to hear the truth.   \n   \nAnd I'm not saying that Berthold taking four years to get this   \ntrademark is relevant, just interesting.   \n   \n ![:-)](http://web.archive.org/web/20141109082920im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n   \nbj\n\n"
    },
    {
      "time": "9 Apr 2004 — 1:25am",
      "content": "Also interesting ...   \n   \nFebruary 04, 2003   \n   \nThe Schoolyard Bullies   \nNever Go Away   \n   \nIn the typographica entry, linked above,   \nJamie Nazaroff says he received the letter from   \nBerthold's attorney Jan. 27, 2003. Delta was not even close to   \nbeing a registered mark at that time, according   \nto the info cut-and-pasted from the USPTO site.   \n   \nSo I really would like to see the actual email   \nto see whether Berthold misrepresented this fact.   \n   \n   \n   \nbj\n\n"
    },
    {
      "time": "9 Apr 2004 — 9:53am",
      "content": "certainly. but with respect to commencing   \ntrademark litigation it does.   \n   \nYou can send out letters and threaten but   \nyou can't file a suit until you have a   \nregistered mark in hand. That's my understanding.   \n   \nWhich means nothing here anyway as long as Berthold   \nisn't missrepresenting its marks.... big company vs. an   \nindividual, some threatening letters,   \nends things pretty quickly without litigation.   \n   \nbut if Berthold had wanted to sue Jamie, it would have had to wait until   \n'Delta' became registered   \nor sue for infringement on the 'Delta Jaeger'   \nmark only, not the 'Delta' mark.   \n   \nblah, blah, of course this is boring.   \nMore interesting ... luc's summary, below.   \n   \n   \n [http://cgm.cs.mcgill.ca/~luc/hunt-nazaroff.html](http://web.archive.org/web/20141109082920/http:/cgm.cs.mcgill.ca/~luc/hunt-nazaroff.html)   \n [http://cgm.cs.mcgill.ca/~luc/berthold.html](http://web.archive.org/web/20141109082920/http:/cgm.cs.mcgill.ca/~luc/berthold.html)   \n [http://www.bertholdtypes.com/bq\\_library/90069.html](http://web.archive.org/web/20141109082920/http:/www.bertholdtypes.com/bq_library/90069.html)   \n   \nNigel, do you have some association with Berthold?   \n   \nAnd how would you assess the way Berthold is being run, if you know or care to share ...   \n   \n   \nbj\n\n"
    },
    {
      "time": "9 Apr 2004 — 11:17am",
      "content": "fair enough Nigel ... I was told that that was the case for   \na copyright, so I assumed that trademarks would be the same. hmmm.   \n  \n\\> You can sue without a trademark being registered.   \n   \n   \nOf course anyone can sue anyone over anything.   \nBut I don't think that's what you are saying.   \nYou're saying that a judge would actually hear a TM case   \n(and not throw it out) where the plaintiff only has a common   \nlaw trademark but not a pending or registered mark.   \n   \nyeah?   \n   \nI would like to learn more if you happen to have a link.   \n   \nthanks,   \n   \nbj\n\n"
    },
    {
      "time": "9 Apr 2004 — 11:34am",
      "content": "Nigel   \n   \nOn the Luc site, a lot of Berthold's actions seem to be silly and pointless.   \n   \nThe issue with Baremo and FF Sari, though, seems to me quite reasonable. Sari is in fact a 'new Baremo'and 'New Barem' would be exploiting the reputation of the old which is still evidently owned by Berthold - so it would cut into their mark.   \n   \nIn fairness, you should answer the question about whether you are associated with Berthold.   \n   \nI agree that people are way too ready to attack anyone trying to protect their IP rights. But Berthold does look silly in some of the warning letters. Do you think I wrong about this?\n\n"
    },
    {
      "time": "9 Apr 2004 — 11:39am",
      "content": "It would be handy if one could rely on stuff on Luc's site, but I don't feel I can trust even the stuff that seems plausible. In some areas that I do know plenty about, like OpenType, his writing has a lot of material that is simply false, as well as a lot that is misleading or devoid of content (but always full of inflammatory rhetoric). We're talking a major axe to grind.   \n   \nOf course, if you believe that all corporations are evil, and that there are conspiracies everywhere, then you'll probably find Luc's world view quite complementary to your own.   \n   \nT\n\n"
    },
    {
      "time": "9 Apr 2004 — 11:51am",
      "content": "Nigel -- The link goes 1000 different directions, but I am   \naware of the USPTO site, treble damages, etc.   \n If you could point to something specific, I'd be grateful.   \n   \nI'm on a 4-day weekend and need to get   \naway from the computer, so for now, I'll take your word for it.   \nAnyhow, clearly, I was mistaken and should learn   \nmore before I make pronouncements. ![:-)](http://web.archive.org/web/20141109082920im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nthanks,   \n   \nbj\n\n"
    },
    {
      "time": "9 Apr 2004 — 12:24pm",
      "content": "\\> the burden of proof is on the person suing.   \n   \nThat's generally inconsequential, because the bureaucratic weight -that's fostered by the system- causes the case to be resolved in favor of the bastard way before any actual judge\\* gets involved.   \n   \n\\* And where does the judge's paycheck come from, I wonder?   \n   \nThomas, don't bundle valid complaints about wanton capitalism with conspiracy theorists and provincial concepts like \"Evil\". You're playing into the hands of the usurpers.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2004 — 2:00pm",
      "content": "BJ: You can sue for \"false designation of origin\" in (US) federal court without having registered the mark: [http://www4.law.cornell.edu/uscode/15/1125.html](http://web.archive.org/web/20141109082920/http:/www4.law.cornell.edu/uscode/15/1125.html). Alternatively, you can sue in state court.   \n   \nAnother advantage of federal registration is that you can opt for \"statutory damages\" of US$500-100000 instead of actual damages.\n\n"
    },
    {
      "time": "20 May 2004 — 5:19pm",
      "content": "\\>I think Agfa Monotype, Berthold, and Linotype are doing things the right way. Controlling their product\\<   \n   \nI've kept quiet for a long time, but now i have to clear up a few facts.   \n   \n1. Berthold Types in chicago is not the legal successor to H. Berthold AG   \n   \n2. Berthold Types has registered most of H. Berthold's trademarks and thus has every right to defend them   \n   \n3. Berthold Types has no contracts with any of the original designers whose fonts are being sold today; thus effectively stealing from designers like Hans Reichel, who designed Barmeno but doesn't receive license payments for his design. Nor was he allowed to re-issue his own face as New Barmeno. So he had to call it Sari and redraw it extensively, just to be able to publish a typeface he licensed to H. Berthold AG, not Berthold Types (see 1).   \n   \n4. Berthold Types sues everybody who only gets into the vicinity of one of their trademarks or even imagined marks, for example \"super\" or even \"grotesk\". In these cases they just lost, finally. It is absurd to want to claim a trademark for a generic term like Grotesk, just because it occurs in one of their trademarks (Akzidenz Grotesk). Defending this not only cost countless hours but also tens of thousands of dollars in attorneys' fees.   \n   \n5. They have been sueing dozens of people with frivolous cases. Failing to answer brings about a judgement in their favour; answering cost more money than all these small designers and foundries have. They win not by being right, but by default.   \n   \n6. They are bullies; it is not about trademarks but about deleting the competition.   \n   \n7. I could cite many more (and worse) cases which have cost me and other designers and foundries millions of dollars (and i am not exaggerating), but this will probably already make me the target of the next attack.   \n   \n8. This list doesn't discuss legal matters for their own sake. This list is not called legaphile; it is run by and for people who care for and live by typography.\n\n"
    },
    {
      "time": "20 May 2004 — 5:24pm",
      "content": "Right on. Bravo.   \nRenewed respect.   \n   \n\\> Berthold Types has no contracts with any of the original designers   \n   \nNot even GGL though?   \n   \nhhp\n\n"
    },
    {
      "time": "23 May 2004 — 10:33am",
      "content": "\\>\\>\\>Do you think the following names infringe?   \n\\>\\>\\>Rocktus as opposed to Rockwell   \n\\>\\>\\>Bemtus as opposed to Bembo   \n   \n   \nHow about Universal\\* versus Univers?   \n   \n   \n\\*ie the Bayer face (which I think hasn't been digitised)   \n [http://www.type.nu/bayer/univer.html](http://web.archive.org/web/20141109082920/http:/www.type.nu/bayer/univer.html)\n\n"
    },
    {
      "time": "23 May 2004 — 11:56am",
      "content": "I guess I will never purchase another font from Berthold. The Naziesque law suits and poor treatment of outstanding type designers have soured the brand for me.   \n   \nChrisL   \n   \nBTW: nice logo Iota\n\n"
    },
    {
      "time": "23 May 2004 — 11:59am",
      "content": "It's a damn shame they have Poppl's stuff.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Jun 2004 — 3:41pm",
      "content": "I wonder, which comes first: being famous, or hiding?   \n   \nhhp\n\n"
    },
    {
      "time": "4 Jun 2004 — 3:11am",
      "content": "\\> It's a damn shame they have Poppl's stuff. \\<   \n   \nYou should ask Poppl's widow why she never signed a contract for her late husbands faces and subsequently doesn't get any royalties. It is one thing offering a contract, but quite another what you write in it. It certainly wasn't acceptable for her.\n\n"
    },
    {
      "time": "29 Mar 2004 — 3:06pm",
      "content": "There are various [reasons](http://web.archive.org/web/20141109082920/http:/www.google.com/search?num=100&hl=en&lr=&ie=UTF-8&oe=UTF-8&safe=off&q=berthold%2Bfont%2Blawsuit&btnG=Search) to avoid the Berthold version, even though it's a solid cut.\n\n"
    },
    {
      "time": "29 Mar 2004 — 3:07pm",
      "content": "[http://typographi.ca/000500.php](http://web.archive.org/web/20141109082920/http:/typographi.ca/000500.php)\n\n"
    },
    {
      "time": "1 Apr 2004 — 12:52pm",
      "content": "What has Delta faucets and Delta Airlines got to do with Delta the typeface family. Absolutely nothing. They are all in different goods and servies for trademark purposes.   \n   \nI would imagine if Jamie had named his typeface Omicron Univers, Omicron Gill, or Omicron Utopia that he would have encountered problems with their respective TM owners.   \n   \nThis kind of misinformation only makes it confusing for designers looking for new names for typefaces.   \n   \nNigel\n\n"
    },
    {
      "time": "2 Apr 2004 — 5:48am",
      "content": "In the U.S. the issue is who has senior rights in a trademark.   \n   \nA person has common law rights even if the trademark is not registered In the U.S.   \n   \nIn Europe it is more about who has first registered the trademark and not who used it first.   \n   \nNigel\n\n"
    },
    {
      "time": "2 Apr 2004 — 9:49am",
      "content": "In the Microsoft case the Lindows attack on Microsoft is that \"Windows\" is \"generic\" and therefore not registerable as a trademark.   \n   \nNigel\n\n"
    },
    {
      "time": "7 Apr 2004 — 1:08pm",
      "content": "In response to the original question regarding which cut of Akzidenz Grotesk is the best.   \n   \nLinotype originally only released four weights in normal width (in a cross license agreement with Berthold per Erik Spiekermann's old post). They are no longer available.   \n   \nThe original Berthold versions have normal, condensed, and extended widths. The choice is obvious.   \n   \nJoseph Pemberton's comment regarding avoiding Berthold because he does not agree with how a company protects its intellectual property (most of the posts simply do not understand trademark law and why it is essential to protect a trademark) is irrelevant for judging typeface quality.   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "7 Apr 2004 — 2:23pm",
      "content": "Of course people can express their own views but what is \"unethical\" or \"bad behavior\" about protecting valuable intellectual property?   \n   \nHrant, your comment about \"prior art for Delta\" is irrelevant regarding trademarks. That is why you have Delta Airlines, Delta faucets, Delta typeface etc. All different classes of goods.   \n   \nJoe's comment about \"nobody believes Berthold will suffer a loss in the marketplace\" is not the point. If a company lets one person do it, then another will follow and so on until it falls into the public domain.   \n   \nEscalator, Band-Aid, Asprin, Shredded-Wheat, and Kerosene\" were once trademarks. Those trademarks became generic because the corporations that originally owned them did not properly use them, and they allowed anyone to use them improperly.   \n   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "7 Apr 2004 — 2:57pm",
      "content": "\\>As always, it's not what you do, but how you do it.   \nYes, but according to the posts they sent \"cease and desist\" letters so at least they didn't just file a lawsuit without giving notice first. What are they supposed to do if the response is f--- off?   \n   \n\\>Irrelevant to whom?   \nIrrelevant to whether it qualifies to be registered as a trademark.   \n   \n\\>To the abusive corporation who has the desire and ability to launch a frivolous lawsuit.   \nYou obviously do not know how the process works. Did you know that \"Frivolous\" lawsuits are sanctionable. No law firm in their right mind would risk being sanctioned by a Federal judge.   \n   \n\\>It seems you have no idea how the US really works.   \nIf you really have such disdain for the U.S. perhaps you might be happier living somewhere else.   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "7 Apr 2004 — 3:24pm",
      "content": "\\>Nigel, you simply don't know Berthold's history. And the fact that nobody with half a brain will reveal it in public is telling.   \n   \nThere was plenty in the previous posts but most of that was simply ignorance of how trademark law works.   \n   \nApart from trademark issues has Berthold done anything personal to any of the people in the posts including you?   \n   \n\\> Irrelevant to whether it qualifies to be registered as a trademark.   \n\\>Who cares. Humans come first.   \n   \nThen join the Peace Corps. Why are you in this industry?   \n   \n\\>But I'm not about to explain my life to you and your ilk.   \n   \nI wouldn't trust personal things to you either.   \n   \nHrant, you certainly have the gift of the gab but you lack substance with respect to intellectual property matters.   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "7 Apr 2004 — 3:42pm",
      "content": "\\>So I guess you think I have less than half a brain?   \n   \nOn the contrary, I just said that you do not understand intellectual property.   \n   \n\\>BTW, I would learn to clean sewage before learning about IP.   \n   \nAnd they say educated people in the U.S. refuse to do these types of jobs. Bravo Hrant!   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "7 Apr 2004 — 4:57pm",
      "content": "You two lost me back there...   \n   \nBut Nigel, you're totally right when it comes to purchasing Akzidenz Grotesk the clear choice is the Berthold version. (And Akzidenz Grotesk is a great face, without question.)   \n   \nThe folks who bought the Berthold library made an excellent business decision. I just think their practices since then don't make great business sense. Maybe they're protecting their font names, but they're dragging the Berthold name through the mud with their hyper-litigiousness.   \n   \nI haven't heard of Windows verses Lindows, but I did laugh about the Microsoft verses Mike Rowe (who holds [MikeRoweSoft.com](http://web.archive.org/web/20141109082920/http:/www.mikerowesoft.com/)). Does MS really think that MikeRowe and his site are going to cause confusion? (Or is it that over time a bunch of Mike Rowe's could take MS' name into the public domain.) If they had a sense of humor they could laugh with the rest of us.\n\n"
    },
    {
      "time": "8 Apr 2004 — 7:55am",
      "content": "\\>I just think their practices since then don't make great business sense. Maybe they're protecting their font names, but they're dragging the Berthold name through the mud with their hyper-litigiousness.   \n   \nJoe if Berthold sent Nick Curtis a cease and desist letter and he responded no or simply ignored it is Berthold supposed to leave him alone just because he is a nice guy who looks at things differently?   \n   \nFrom the posts Berthold then sued Nick Curtis and he changed the names, This is not bad business sense it is essential to protecting intellectual property.   \n   \nIf you look at Berthold, Linotype and Monotype all the equipment is gone and the only item of value remaining is the intellectual property (trademarks, outlines and copyright). I think you will find that all three companies vigourously protect their trademarks and copyright.   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "8 Apr 2004 — 8:57am",
      "content": "Hrant   \n   \nComparing intellectual property with cluster bombs!   \n   \nYou would be perfect for \"Speakers Corner\" in Hyde Park, London.   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "8 Apr 2004 — 2:37pm",
      "content": "Henk   \n   \nIt is still only four weights and the italics were created only recently so call me a purist but give me the original versions from Berthold.   \n   \nAnd is Hrant campaigning for the Rush Limbaugh prodigy award? Can't you find a more appropriate website to express your views on repenting and revolution?   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "8 Apr 2004 — 3:14pm",
      "content": "Thomas   \n   \nAgfa Monotype sells Berthold fonts including the Adobe versions of them.   \n   \n [http://www.agfamonotype.co.uk/Foundry/FoundryProfiles.asp?show=berthold](http://web.archive.org/web/20141109082920/http:/www.agfamonotype.co.uk/Foundry/FoundryProfiles.asp?show=berthold)   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "9 Apr 2004 — 4:04am",
      "content": "A trademark does not have to be registered with respect to trademark infringement. And since Berthold released Jaeger's Delta I think in the 80s they more than have senior rights over Jamie.   \n   \nNigel Hamilton\n\n"
    },
    {
      "time": "9 Apr 2004 — 10:57am",
      "content": "BJ   \n\\>but if Berthold had wanted to sue Jamie, it would have had to wait until 'Delta' became registered   \n   \nYou are wrong on this. You can sue without a trademark being registered.   \n   \n\\>More interesting ... luc's summary, below   \n   \nLuc's article is full of incorrect statements and conclusions it belongs in the Star or National Enquirer.   \n   \nHe also references comments by Fred Nader which speaks for itself.   \n   \nAs far as how I feel that Berthold is being run I think that the type industry is going back to the days when foundries exclusively distribute their own product.   \n   \nFor example only Linotype markets Linotype Univers, Optima Nova, Linotype Syntax etc.   \n   \nYou don't see any of Agfa Monotype's new product (including ITC) in the Adobe Library or through Linotype.   \n   \nIn fact in a recent Adobe's SEC filing there is a lawsuit between Agfa Monotype and Adobe which Adobe claims would have an adverse effect if they lost.   \n   \nBerthold controls its product although it apears that Agfa Monotype distributes Berthold rather than licensing it as they did in the past.   \n   \nI think Agfa Monotype, Berthold, and Linotype are doing things the right way. Controlling their product.   \n   \nAnd the only reason that I entered this thread is that I keep seeing so much misinformation about trademarks that no wonder the independent type designer gets into trouble if he doesn't know right from wrong. Especially if he follows Luc's positions.   \n   \nNigel Hamilton\n\n"
    }
  ]
}
