{
  "id": "37793",
  "title": "Downloadable fonts thru Safari",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "According to a post from developers yesterday, Apple's Safari browser will now support \"downloadable\" fonts -- meaning that users can specify a font of choice on a web page and deliver it to someone viewing a web page.\n\nNot sure how this will change the font landscape, but you can read all the details here:\n\n[http://webkit.org/blog/124/downloadable-fonts/](http://web.archive.org/web/20150329110226/http:/webkit.org/blog/124/downloadable-fonts/ \"http://webkit.org/blog/124/downloadable-fonts/\")\n\nand here:\n\n[http://www.alistapart.com/articles/cssatten](http://web.archive.org/web/20150329110226/http:/www.alistapart.com/articles/cssatten \"http://www.alistapart.com/articles/cssatten\")\n\n",
  "author": "basicframework",
  "time": "4 Oct 2007 — 10:11am",
  "uid": "8807",
  "comments": [
    {
      "time": "4 Oct 2007 — 10:51am",
      "content": "\\>Not sure how this will change the font landscape\n\nUntil/unless mainstream browsers other than Safari (and Opera) support downloading (I’m thinking IE & Firefox) then I doubt much will change.\n\nOnce everyone supports it you can expect to see a growing number of Web pages rendered in [freeware fonts](http://web.archive.org/web/20150329110226/http:/www.ascendercorp.com/webfontstudy.html) (buy stock in dafont and Larabie fonts now!) and also commercial fonts (posted through ignorance or in disregard for font licenses) and of course expect renamed commercial fonts (stripped of (c) and TM strings) too.\n\nCheers, Si\n\n"
    },
    {
      "time": "4 Oct 2007 — 11:29am",
      "content": "Simon, is there any chance of IE implementing @fontface Or is Microsoft likely to keep pushing its own font embedding technology?\n\n"
    },
    {
      "time": "4 Oct 2007 — 11:36am",
      "content": "By the way, how is the custom font here on Typophile implemented (or has this been discussed before)?\n\n"
    },
    {
      "time": "4 Oct 2007 — 11:53am",
      "content": "No discussion enumerating free fonts is complete without at least a mention of the excellent work going on in the free software font community. There are a number of very high quality fonts available under such licensing terms, and they will be a welcome addition to the \"core web fonts\" that designers are forced to rely upon.\n\nI've long felt that these fonts are particularly important to increase international coverage. The Greek Font Society fonts are among the best available for Greek, and for many minority langauges, good fonts are simply not widely available at all.\n\nI'm very happy to work with Web designers to make my OFL licensed fonts work well in these kinds of settings. Clearly the license _allows_ that kind of use, but it's always nicer when it's explicitly encouraged by the designer as well.\n\nNow if only this initiative reaches other popular browsers besides Safari.\n\n"
    },
    {
      "time": "4 Oct 2007 — 11:59am",
      "content": "sii summed it up well.\n\nI think this is mainly for Apple to appease 'iphone application developers' who want more control of their interface...which ultimately is just a web page. It seems that Apple hates the fact that developers are figuring out ways to put applications actually on the iPhone when apple really just wants to keep pushing the 'it's a web page...just a web page' mantra.\n\nJP...I may be wrong, but I think Microsoft gave up on font embedding in IE, didn't that? And I don't think Mozilla has much interest in it. Font embedding was one of those things that came and went. Maybe it was before its time, or maybe people just didn't care.\n\nCluases...they're using flash for the custom type here on typophile.\n\nGiven that the web is democratic and 'for the masses' I'd really rather keep font embedding off of it. Yes it'd be great to spec the latest Underware face on the web site of the corporation you just rebranded, but for everyone one of those 'good' uses, there'll be 100 'scrapbooker' web sites that insist on embedding 40 freeware monstrosities on each page.\n\nWithin days, I bet people will quickly be turning OFF this feature in their browser ;o)\n\n"
    },
    {
      "time": "4 Oct 2007 — 12:07pm",
      "content": "Raph makes a good point regarding the fact that there are some reasonable quality fonts for non-Latin usage, and in fact that's where existing font embedding technologies (like EOT) are most commonly used today. However as noted even in the Open Source and freeware space, licenses need to be amended to allow fonts to be subsetted and redistributed without the readme attached.\n\n\\>Simon, is there any chance of IE implementing @fontface Or is Microsoft likely to keep pushing its own font embedding technology?\n\nThose who were at ATypI this year or TypeCon last year may recall the discussions on this subject. MS is still looking at opening up EOT as a standard to the W3C (specs are complete but we're still going through the internal approval process). We think EOT (if supported broadly) will offer web designers access to at least some commercial fonts where EULAs allow web embedding. As for IE ever supporting raw or zipped TTF’s – can’t rule that out. I think the policy is likely wait and see.\n\n"
    },
    {
      "time": "4 Oct 2007 — 12:17pm",
      "content": "sii: While some licenses may be murky, I believe the current version of the OFL makes it crystal clear that embedding is allowed and encouraged. From a [linux.com article](http://web.archive.org/web/20150329110226/http:/www.linux.com/articles/60919) about the 1.1 revision:\n\n<cite><br>\nThe question of whether licenses permit embedding has come up frequently, and Spalinger and Gaultney wanted to make clear that the OFL permitted it. \"This was always the case,\" Gaultney says, \"but we made it clearer because there was some confusion.\" The prohibition against releasing OFL fonts under another license now adds the sentence, \"The requirement for fonts to remain under this license does not apply to any document created using the fonts or their derivatives\" in order to clarify the status of embedded fonts. In addition, version 1.1 specifies that embedding is not incompatible with selling the font.<br>\n</cite>\n\nIf there are real concerns, I of course want to see those addressed. But as far as whether license issues are a barrier to the use of OFL fonts in Web pages, I think the main barriers are demand and the political will of Microsoft to support the @font-face Web standard.\n\n"
    },
    {
      "time": "4 Oct 2007 — 12:42pm",
      "content": "[My reaction.](http://web.archive.org/web/20150329110226/http:/typographica.org/001112.php) If only the type industry had prepared for this by addressing embedding more completely in their EULAs. There is still time, but not much.\n\n"
    },
    {
      "time": "4 Oct 2007 — 1:42pm",
      "content": "Raph, the OFL may allow embedding, but this isn't embedding in the way the term is commonly understood. Unlike the established forms of font embedding nothing here ties the font to the document - it's not embedded in the document, neither is a URL binding system used to lock the font to the document.\n\nThat’s not to say the OFL might not allow other forms of distribution compatible with this scheme.\n\n\\>main barriers are demand and the political will of Microsoft to support the @font-face Web standard.\n\nThis seems rather disengenious - MS has supported @font-face for over ten years. No one else seemed interested until Hakon started his crusade.\n\n"
    },
    {
      "time": "4 Oct 2007 — 1:52pm",
      "content": "sii: I'm not trying to provoke a flamewar here - we talked about this issue extensively in person about a year and a half ago, and I think we share a real concern for quality and doing the Right Thing. And I certainly agree that this feature will be misused and we'll see lots of poor typography that wouldn't have otherwise been possible.\n\nBut on the specific question of whether there is a legal issue with using downloadable OFL fonts as part of Web pages, I think you're raising fear, uncertainty and doubts where there is no cause. From the [OFL FAQ](http://web.archive.org/web/20150329110226/http:/scripts.sil.org/OFL-FAQ_web):\n\nQuestion: 1.2 Can I make web pages using these fonts?\n\nAnswer: Yes! Go ahead! Using CSS (Cascading Style Sheets) is recommended.\n\nSimon, are you making the claim that there's language in the actual license which is at odds with the clearly expressed intent of the license's creators? That the drafting and review of the license was somehow sloppy? The fact that people have crafted, reviewed and revised the license specifically for the needs of font creators is the main reason I've chosen the OFL, as opposed to for example adapting an existing free software license.\n\n\\>This seems rather disengenious - MS has supported @font-face for over ten years. No one else has seemed interested until Hakon started his crusade.\n\nYou're right here, which is why I cited \"demand\" as the first barrier to adoption. And just because it's a Web standard doesn't mean that it's necessarily a good idea to support it. But now that WebKit is shipping it, Microsoft is arguably very much now on the critical path.\n\n"
    },
    {
      "time": "4 Oct 2007 — 2:00pm",
      "content": "\\>I’m not trying to provoke a flamewar here -\n\nSame here, my original comment was not aimed at OFL, but the fonts that make up the majority of free fonts on the web (most are not OFL). I didn't know enough about OFL to know if it allowed this. Thanks for clarifying that it probably does.\n\n"
    },
    {
      "time": "4 Oct 2007 — 3:05pm",
      "content": "Thanks Simon. I did not realize that IE and EOT use @fontface—I thought things were a little more complicated.\n\n"
    },
    {
      "time": "5 Oct 2007 — 8:38am",
      "content": "I agree with Sii, it's not embedding it is linking. But this makes it even worse!  \nWeb designers could then use ANY font they will find on ANY server. If they find a FF Meta on a Russian server they can use it in their website and no one can prevent this from happening. The List Apart article already shows how you can import external CSS files which may contain links to hundrets of fonts. I guess these files will become very popular.  \nAnd since the links are all in plain text in the code, everyone can easily download the fonts or someone could write a Firefox Plugin that will download all fonts linked in the CSS.\n\nI think the font industry should take action against this use of the font-face command. At least limit the use of the font-face links to the domain of the website. So you could still easily use any freeware fonts by uploading them to the webspace, but you could not link to commercial fonts on other servers.\n\n"
    },
    {
      "time": "5 Oct 2007 — 9:03am",
      "content": "Wouldn't it be easy for a foundry to search and find unlicensed users?  \nThen send them an invoice.  \nIt would be more difficult for foundries that sell through distributors who don't return information on who purchase/licenses their fonts.\n\n"
    },
    {
      "time": "5 Oct 2007 — 9:15am",
      "content": "\\>\\>\\>Wouldn’t it be easy for a foundry to search and find unlicensed users?\n\nYes, but what do you do, when you find your font on [http://178.124.65.21/pub/fonts/fontname.ttf](http://web.archive.org/web/20150329110226/http:/178.124.65.21/pub/fonts/fontname.ttf \"http://178.124.65.21/pub/fonts/fontname.ttf\") ?  \nYou would have to have a lawyer in place in every country just to let them force someone to remove one font.\n\n"
    },
    {
      "time": "5 Oct 2007 — 9:26am",
      "content": "\\>Then send them an invoice.\n\nWhat's the fee for providing unlimited use by three billion Internet users?\n\n"
    },
    {
      "time": "5 Oct 2007 — 9:44am",
      "content": "Well, Ralf, perhaps you'd like to start an RIAA-style campaign of suing people who link to online fonts. The scenario you describe is in no way different from linking to video, audio, or images via URLs in HTML or CSS. Type designs are in no way special in this regard, except that type _designs_ aren't even copyrighted in many places while video, audio, and images almost always are.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20150329110226/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "5 Oct 2007 — 10:14am",
      "content": "\\>\\>\\>Well, Ralf, perhaps you’d like to start an RIAA-style campaign of suing people who link to online fonts.\n\nNo, I don't want that. But that's the point. It shouldn't be possible to use external font links in the first place. This can easily be implemented in the Render Engine.\n\n\\>\\>\\>The scenario you describe is in no way different from linking to video, audio, or images via URLs in HTML or CSS.\n\nI see a slight difference: MP3s and movies are mostly for personal entertainment, font files however are used to make commercial products. Of course people are already sharing fonts in Newsgroups and P2P networks, but bringing this to the browser isn't something I am happy about.\n\n"
    },
    {
      "time": "5 Oct 2007 — 1:05pm",
      "content": "Obviously if handled the wrong way this could disembowel the font industry ( except maybe those folks who do custom stuff), but it could also be an opportunity. How the opportunity could be made I am less sure about both from a technical perspective, and from a marketing perspective. But I think the itunes model might be a clue - Linotype is closest to that with Font explorer X.\n\n"
    },
    {
      "time": "5 Oct 2007 — 1:10pm",
      "content": "\"What’s the fee for providing unlimited use by three billion Internet users?\"\n\nIsn't that already covered in the standard EULA? I use a font, print a billion brochures, and now a billion people are 'using' said font, right? ;o)\n\n"
    },
    {
      "time": "5 Oct 2007 — 1:46pm",
      "content": "“Isn’t that already covered in the standard EULA?”\n\nGood laughs - The difference here is that most EULAs define \"use\" as allowing the user to install the font software on an allowed number of computers, with some provisions to allow or not allow for embedding.\n\nThe traditional definition of \"font embedding\" covers the use of a font incorporated into an electronic document. So the font travels with the document.\n\nThere are \"DRM\" provisions already available in TrueType and OpenType technologies. Yes, the famed embedding bits. Software developers today can look a the embedding bit to check the embedding permission and decide if its OK to use a particular font, or not.\n\nIf Microsoft opens up EOT, and the W3C approves it as a standard, then that would be a very good thing. EOT provides many benefits as a mechanism for all of us to protect our font IP.\n\nAllowing raw fonts or zipped fonts to be linked/downloaded to web pages WITHOUT any kind of methodology of checking font embedding permissions, copyrights, etc. is a disaster waiting to happen for all of us the type design community.\n\nCall me Chicken Little if you must, but I believe this is a serious issue and as the thread above illustrates there is a lot of confusion, concern and misunderstanding.\n\n"
    },
    {
      "time": "5 Oct 2007 — 10:28pm",
      "content": "<cite>Allowing raw fonts or zipped fonts to be linked/downloaded to web pages WITHOUT any kind of methodology of checking font embedding permissions, copyrights, etc. is a disaster waiting to happen for all of us the type design community.</cite>\n\nI think that the predictions of doom being made in this thread are quite unlikely to come true. Font piracy is already pretty easy; the most popular warez tracking sites are no longer shady corners of EFnet, now they’re semi-famous Swedish guys. Finding pirate fonts is already simple, trying to collect them from web sites, even with the help of search engines and similar tools, is unlikely to be easier than searching a big torrent tracker. Designers who buy fonts now aren’t doing it because the fonts are hard to pirate, they do it because they want to compensate the designers.\n\n"
    },
    {
      "time": "6 Oct 2007 — 7:15am",
      "content": "The font biz has been amazingly resilient over the years, and I doubt even in the worst case this will sink the industry and put dozens of type designers out of work.\n\nWhat irritates me about this (apart from the obvious fact that it does so little to provide Web page designers with quality fonts to improve their web sites, ie. commercial ones) is that it will divert yet more limited resources to the lawyers and companies doing enforcement work, and many independent type designers will end up spending more time policing and less time designing type. :-(\n\n"
    },
    {
      "time": "6 Oct 2007 — 8:19am",
      "content": "<cite>...independent type designers will end up spending more time policing and less time designing type.</cite>\n\nI doubt it. Independent font designers lack the resources to prosecute their patents and copyrights now, dramatically increasing the number of offenders seems unlikely to change that. But it would be easy to develop tools that would spider the web for fonts, check to see if the user had paid for them, and alert a law firm which could then demand payment on behalf of designer clients. In a roundabout way, this could actually allow designers to make a lot more money from pirates than they do now. It reminds me of a story I heard about a photographer who realized that he could make money by tracking down and threatening to sue design people for using his images than he could by just selling stock.\n\n"
    },
    {
      "time": "6 Oct 2007 — 9:26am",
      "content": "Back to the earlier question - how much to charge a Web site for placing an unprotected font online accessible to everyone on the Internet? You should think of every Web site that adopts this technology as a mini dafont (minus the readme’s and designer attribution) - enforcement is certainly possible, but it will be take-down notices, not just invoices to cover your losses, that your well-paid law firm will be sending out.\n\n"
    },
    {
      "time": "6 Oct 2007 — 9:33am",
      "content": "<cite>...how much to charge a Web site for placing an unprotected font online accessible to everyone on the Internet?</cite>\n\nWhatever it would cost anyway, along with a mention of how much less expensive it is than the thousands of dollars per font from a typeface that were made available. No need to go all RIAA and start demanding settlements of the offender’s life savings. If an attorney is involved, asking that the offender cover attorney’s fees seems reasonable.\n\n"
    },
    {
      "time": "6 Oct 2007 — 9:51am",
      "content": "Yikes! So you think if I were to post say Avenir on my site in a form that anyone could download Linotype should invoice me $30 for the infinite-users license? Sign me up!\n\nEdited so out of sync - sorry.\n\n"
    },
    {
      "time": "6 Oct 2007 — 9:49am",
      "content": "Sure. After all, you knowingly posted someone else’s copyrighted material, so you’re liable for the costs. $30 is many times less than what you would pay if Linotype won a judgement against you.\n\n"
    },
    {
      "time": "6 Oct 2007 — 12:10pm",
      "content": "I would prefer a system in which I don't have to get the lawyers involved (Sorry Frank M). -:)\n\nOK, maybe I fanned the flames a bit with my previous comments - but my point was how important this technological improvement will be to the web. And how important it is for the type design community to become active stakeholders in this process. Only time will tell how it plays out with the W3C, and what browsers end up supporting font linking.\n\nIMHO stopping piracy comes down to a) education and b) putting processes & systems in place to encourage more users to be honest.\n\nOne of the problems with the font linking methodology in Safari is there are no checks & balances - no easy way for users to know whether it is OK to embed/link the font on a web page or not. I would prefer to see something that would tell web page designers what the font embedding permissions are for their fonts, and further protect the font from being misused (such as downloaded permanently or used in an editable manner if not permitted by the EULA).\n\n"
    },
    {
      "time": "6 Oct 2007 — 1:03pm",
      "content": "_Designers who buy fonts now aren’t doing it because the fonts are hard to pirate, they do it because they want to compensate the designers._\n\nI've no doubt that may be true, but I don't think it's main factor.  \nPeople have a moral compass with regards to theft, that gets set at an early age.  \nIt's our education from parents, teachers and other authorities, of what is socially unacceptable.  \nConsequently shame, fear and guilt are more the inhibitors to piracy, rather than paying for your fonts being a positive act of goodwill. Pardon my cynicism of human nature, but in this case negative reinforcement plays a stronger role than positive.  \nIn adults, there is a spectrum of inclination to cheat or steal.  \nIn that situtation, it makes sense for a society to reduce the opportunity to steal, rather than make it easy, because making it easier has a corrupting effect on those who might consider an itsy-bitsy little cheat, that snowballs en masse, as what were once deemed vices become widespread habits, a form of consensus-building. As we've seen post-Napster.\n\n"
    },
    {
      "time": "6 Oct 2007 — 9:09pm",
      "content": "Bleah. Well, at least this forces me to dust off my blog again. :/\n\nT\n\n"
    },
    {
      "time": "6 Oct 2007 — 9:36pm",
      "content": "Better late than never... send it up!\n\n ![](http://web.archive.org/web/20150329110226im_/http:/typophile.com/files/ouronlyhope_4757.jpg)\n\n:-)\n\n"
    },
    {
      "time": "6 Oct 2007 — 10:23pm",
      "content": "_Consequently shame, fear and guilt are more the inhibitors to piracy, rather than paying for your fonts being a positive act of goodwill._\n\nI don't think these considerations of piracy or goodwill come into play in most purchases. People generally buy fonts because that's they way to get them.\n\n"
    },
    {
      "time": "7 Oct 2007 — 9:30am",
      "content": "Years ago we used Java applets for stuff like scrolling news articles on websites. You could download these applets for free from the developer, but to make them fully functional at your website you had to buy a license. You then got a license key which you would have to put as a parameter in you HTML source code. Of course, everyone could see this license key but since it was linked to the domain, no one could steal it.  \nThe same system would work for fonts. We would just need a converter (like WEFT) to make these fonts, and the browser would have to check the license key.  \n`\n@font-face {\n  font-family: \"MyFontName\";\n  src: url(fonts/myfontname.eot) format(\"truetype\");\n  license-key: \"1234567890ABCDEFGHIJKLM\";\n}\n`\n\nFor the font industry this could be a really good market, and as a web designer I would love the opportunity to license good fonts for my client's websites.\n\n"
    },
    {
      "time": "7 Oct 2007 — 10:44pm",
      "content": "Ralph, that's the the sort of thing I was thinking of!\n\n"
    },
    {
      "time": "8 Oct 2007 — 4:40am",
      "content": "Millions of PDFs that are downloadable on the web right now contain embedded fonts of all kinds. Is this different? Are there any pending lawsuits for fonts embedded in PDFs on websites?\n\n"
    },
    {
      "time": "8 Oct 2007 — 6:51am",
      "content": "\\>Is this different?\n\nYes, the fonts are embedded _inside_ the PDF and therefore follow the OpenType spec definition of document embedding, only get inside the PDF if the font vendor has set the embedding permissions to allow this, and in general font EULAs are in line with the embedding permissions in the font. Extracting a reusable font from a PDF requires hoops to be jumped through and malicious intent.\n\nContrast this with the raw font support where a font is simply linked to a web site in exactly the same way as other assets are (eg. Images). No hoops to jump through, just click on the link and permanently save the linked fonts to your local machine.\n\n"
    },
    {
      "time": "8 Oct 2007 — 7:04am",
      "content": "While I certainly appreciate the concerns of the font industry, I certainly hope they don't go down the path of the RIAA screaming that the sky is falling and being totally oblivious to the reality of the situation.\n\nWho buys fonts these days? Does Mary purchase a font to design her garage sale signs? Does Bob in accounting purchase a font to format his quarterly reports to the CEO? Does Sarah who's in the 7th grade purchase an extensive font family to type up her book report?\n\nOr is it mainly graphics professionals?\n\nIf it's the latter, I really don't see how (even though I'm not necessarily advocating it) embedded licenses would really hurt the 'real' sales numbers. One could argue that they'd perhaps go up as graphics professionals purchase more typefaces for web sites. Yes, the drawback is that Mary COULD--if she was skilled and cared enough--grab that font off of your web site for her garage sale posters. But is that REALLY a lost sale?\n\n(And to be clear, I'm not necessarily advocating a completely 'open' download license on every font for every web site...just tossing out some ideas for discussion...)\n\n"
    },
    {
      "time": "8 Oct 2007 — 11:22am",
      "content": "I don't think anyone can blame the font industry for being cynical of this situation. Until it is proven safe according to _their_ expectations why should they participate? Just as each EULA is different, each foundries' expectations for security are different. Further if it is proven safe, or if any given foundry decides to trust it, it is also up to them how they charge for it, right? Extended licenses anyone?\n\nIn regards to all of those PDFs floating around. Some might be in violation if the given foundry's EULA doesn't allow for public sharing.\n\nA little off topic: It shouldn't surprise anyone that there are still designers out there that expect full payment for their work but don't mind stealing someone else's. And again the word \"steal\" is defined by the foundries. Some foundries might turn a blind eye if the user eventually licenses the font, even if the designer originally found the font on a shareware site to _test it out_. Other foundries, most foundries think that is stealing. Who can blame them? Do we let people test the logos and brochures to see if they do their work first?\n\n"
    },
    {
      "time": "8 Oct 2007 — 11:35am",
      "content": "\"Do we let people test the logos and brochures to see if they do their work first?\"\n\nMany designers do dabble in spec work. ;0)\n\nI agree, in the end, it really is a personal choice by each foundry.\n\nGoing back to the music issue, the RIAA still thinks this is a huge issue. Radiohead, on the other hand, thinks the complete opposite.\n\nIn the end, it's probably best kept to the individual foundries. Maybe some foundries won't care and gladly issues 'web licenses' as is with todays technologies. Others probably won't.\n\n"
    },
    {
      "time": "8 Oct 2007 — 1:46pm",
      "content": "Posting fonts in a form that allows open access and use and relies on the honor system for compensation isn't new. Some of you may remember it as \"shareware\". Maybe it would be unfair to call this model a fad, but it isn't very common any more especially with respect to fonts. But even then shareware fonts (and many freeware fonts) have to be redistributed with their 'readme' files, something missing in this technology, but possible if the fonts are .zipped.\n\n"
    },
    {
      "time": "8 Oct 2007 — 2:44pm",
      "content": "Here's a SWAHBI: Perhaps the fonts could be hosted on the foundry's website and served up on demand. Instead of downloading the whole font as a TTF or OTF file to everybody and anybody, something like a font tester could create the text on the fly and deliver only the specific characters as (for instance) an SVG graphic or something else that the browser could render but wouldn't be a font file. The foundry would be able to track who was using their fonts and charge them for it, or cut off access if the user didn't pay up. This would work for both static and dynamic pages.\n\nMore broadly, I guess what I'm suggesting is middleware that font owners would use to convert the font to something a browser could interpret but isn't a TTF, OTF, or PS file, and couldn't be converted back to a usable font file -- the typographical equivalent of the trapdoor functions used in cryptography.\n\nLater edit: Of course this is useless for those fonts already loose on the web, but it might be better than doing nothing.\n\n"
    },
    {
      "time": "9 Oct 2007 — 1:14am",
      "content": "\"how much to charge a Web site for placing an unprotected font online accessible to everyone on the Internet?\"\n\nMaybe someone should ask Ascender. They've had a [server font](http://web.archive.org/web/20150329110226/http:/www.ascendercorp.com/fontlicensing.html) license available since June 2007. The license \"allows the fonts to be installed onto a server for use with an application that is accessed by an unlimited number of users.\"\n\nWhile I agree that being able to openly link to fonts on public servers is a worry for type publishers, now's the time to accept that @font-face is something that designers really need to do - and have wanted to do for the last 9 years. Sticking heads in sand is not going to make it go away, so start talking to browser manufacturers - work out a solution that gives designers and their customers what they need, while still protecting the intellectual property of the font houses. And I don't mean DRM.\n\n"
    },
    {
      "time": "14 Oct 2007 — 6:22pm",
      "content": "ty for the referral ralf. i just registered last week and opened a blog question about the status of @font-face and was referred here ...\n\ni was excited to see it in the css spec a year or two ago to use on our intranet domain and reference our corporate typeface (eurostile) for certain h# tags and an occasional announcement. i published it on our internal development wiki only to find it was not receiving the support i had hoped.\n\ni agree with several above suggestions to restrict use to the site's domain server only; however, i see many difficulties in securing this type of use. perhaps if the feature only worked with relative uri addressing, i.e. the use of \"http://\" in the src reference would nullify the object. the license key idea above looks interesting, as well.\n\nand on the topic of license purchasing versus pirating, you would think most \"professionals\" would know better and support proper licensing; however, when i arrived at the company and discovered eurostile had been chosen as the corporate typeface and in our company logo, i asked corporate communications if they realized this was not a standard (installed with windows typeface). the response was something like, \"yes, and your point is?\". after i let them know it would require licenses for anyone developing web applications, not just print media, they were actually surprised?!?\n\nbottom line is they received an invoice for about three dozen licenses from veer the following month ... ;)\n\nWynne Hunkler  \nPrincipal | [Wynnefields Creative](http://web.archive.org/web/20150329110226/http:/www.wynnefields.com/)  \nWeb Design & Visual Communications\n\n"
    },
    {
      "time": "15 Oct 2007 — 4:56pm",
      "content": "\\> Who buys fonts these days? Does Mary purchase a font to design  \n\\> her garage sale signs? Does Bob in accounting purchase a font  \n\\> to format his quarterly reports to the CEO? Does Sarah who’s  \n\\> in the 7th grade purchase an extensive font family to type up  \n\\> her book report?\n\nFrom my experience of working for MyFonts for the last six years: totally. This makes a considerable number of people who buy fonts.\n\nA.\n\n"
    },
    {
      "time": "15 Oct 2007 — 6:02pm",
      "content": "<cite>From my experience of working for MyFonts for the last six years: totally. This makes a considerable number of people who buy fonts.</cite>\n\nI am so waiting to see an ad for “the perfect font to make your research paper fill up an extra page” show up in _Rolling Stone_, or calligraphic fonts advertised in _Modern Bride_.\n\n"
    },
    {
      "time": "16 Oct 2007 — 6:54am",
      "content": "\"From my experience of working for MyFonts for the last six years: totally.\"\n\nWow. That's interesting. And good!\n\n"
    },
    {
      "time": "17 Oct 2007 — 4:08pm",
      "content": "The news is spreading quickly. I received an article today in my Sitepoint newsletter referencing more on this topic at [Typographica](http://web.archive.org/web/20150329110226/http:/typographica.org/001112.php).\n\nWF\n\n"
    },
    {
      "time": "18 Oct 2007 — 8:07am",
      "content": "We'll have this same discussion all over again if [electronic paper](http://web.archive.org/web/20150329110226/http:/en.wikipedia.org/wiki/Electronic_paper) ever goes mainstream.\n\n"
    },
    {
      "time": "18 Oct 2007 — 9:39am",
      "content": "\\>We’ll have this same discussion all over again if electronic paper ever goes mainstream.\n\nI don't think we will, as the medium here is so closely related to PDF and eBooks and font-makers made up their minds and adjusted their EULAs in response to the eBook hype of a few years back.\n\nIn general most EULAs allow document embedding, the TrueType and OpenType specs have defined document embedding permissions for about 15+ years, and some vendors (Monotype I think led the trend) charge extra for document embedding rights if the document is being sold (like an eBook or eMagazine subscription).\n\nBack to the original point, linking a raw font to a web page is not embedding, it's redistribution - disallowed by font EULAs.\n\n"
    }
  ]
}
