{
  "id": "37814",
  "title": "Havok - Homebrew Label Critique",
  "forum": "sublevelbus's blog",
  "tags": [

  ],
  "content": "Just new to the site,\n\nI will be brewing up a batch of homebrew in the back yard this weekend. I started tinkering with a label recently. Any feedback, positive & negative welcome:\n\nThanks!\n\nAndy\n\nClean version:\n\n ![](http://web.archive.org/web/20071208124138im_/http:/www.typophile.com/files/havok2_5631.jpg)\n\nAnd the ever so cliché distressed look:\n\n ![](http://web.archive.org/web/20071208124138im_/http:/www.typophile.com/files/havok1_6361.jpg)\n\nSo please Jump in!\n\n",
  "author": "<a href=\"/web/20071208124138/http://www.typophile.com/user/22469\" title=\"View user profile.\">sublevelbus</a>",
  "time": "<br>",
  "uid": "22469",
  "comments": [
    {
      "time": " 4.Oct.2007 10.36pm",
      "content": "Andy - I would probably drink bottle number one. I like what you are doing so far. My only suggestion would be to fill the surrounding white space with some chunks of khaki and maybe bring up the 12 fl oz to the red area. Have you thought about giving the rectangular box a subtle curve on the top and bottom to mimick the shape of the red badge? The inside elements will make a great bottle neck label. I like the distressed outline in version 2. Bullet holes?\n\n ![](http://web.archive.org/web/20071208124138im_/http:/www.typophile.com/files/havok2_5631curve_5471.jpg)\n\n"
    },
    {
      "time": " 4.Oct.2007 10.37pm",
      "content": "Great suggestions. I will contine working the label with these aspects in mind...i really enjoy the subtle curve you gave to the label shape. thanks a ton for the feedback!  \nAndy\n\n"
    },
    {
      "time": " 4.Oct.2007 11.44pm",
      "content": "I think a white star under the extra pale ale would be cool. And or something - a rosette? - in the four corners of the red box. I think the lines in the background might be bent into a waist centered on the word havok. This is very cool already. But I want to encourage you to keep going.\n\n"
    },
    {
      "time": " 5.Oct.2007 7.05am",
      "content": "great start. I myself am in favor of the white + pinstriped background, but I’d like to see it brought in vertically to make the red badge more dominant. Possibly to the point where the red badge runs to its outer edge. As for the distress: let the condensation from the bottle have its toll on your design.\n\n"
    },
    {
      "time": " 5.Oct.2007 10.33pm",
      "content": "Label 1 here too.\n\nR\n\n"
    },
    {
      "time": " 10.Oct.2007 10.18am",
      "content": "How did it turn out?\n\n"
    },
    {
      "time": " 12.Oct.2007 12.06pm",
      "content": "The beer itself has started to ferment. another week and we can bottle it. another two weeks in the bottle to condition, and we shall find out if it was worth the toil. As for the label, i will be posting some changes shortly-Thanks again for everyone’s input!  \nCheers!\n\n"
    },
    {
      "time": " 23.Oct.2007 7.24pm",
      "content": "Nice overall. The lugers are cool, but I’m not sure how they relate? Is this a retro German thing? Somehow the scale of all the elements doesn’t mesh all that well... you’ve got jumbo accoutrements above the type, small lugers flanking it, and then off to the sides you’ve got dainty foliage.\n\nI’m all for keeping those fine details as it adds to the overall complexity to provide character. I just think right now it’s going in a couple too many directions.\n\nAlso, your condensed gothic sans (Trade? News?) is not my favorite. It feels like you left a default font there (but had the sense to not to use Helvetica). Consider something wide and heavy at a very small scale, and still in caps. I think that would blend well with the red slab serif and yet not leave it so generic.\n\n"
    },
    {
      "time": " 24.Oct.2007 6.11am",
      "content": "I think, agreeing mostly with Joe, that if you took the “Extra Pale Ale” out, I would have no idea what this was labeling.\n\nCheers!\n\n"
    },
    {
      "time": " 24.Oct.2007 2.30pm",
      "content": "I think the red “shield” area and the background ornaments seem disconnected. They seem like two unrelated elements to me. I would beef up the “Extra Pale Ale” type, and as Joe said, maybe look at a different typeface for that. Overall, I like the feel. And the ornament above “Havok” seems a little arbitrary.\n\n"
    },
    {
      "time": " 25.Oct.2007 10.05am",
      "content": "It seems like a beer named HAVOK, should not be contained in nice little square labels with aligned type. One thought was to look at a bandana and carve out an irregular shape from the paisly and really give the type treatment the energy it deserves. Kindof a grunge paisley explosion.\n\nIf you didn’t want the western look, maybe go urban havok with it and make a stencil (or stencils) and spray the bottles.\n\nAnyhow, some fine looking homebrew. Hopefully it will taste better than some of the homebrew I’ve tried :-)\n\nR\n\n"
    }
  ]
}
