{
  "id": "37823",
  "title": "St Bride Lecture Series: A talk about book design to be given by Andrew Haslam, 31 October 2007",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20071213234659/http:/typophile.com/user/108 \"View user profile.\") : 5.Oct.2007 6.28am \n\n============  \nBook design: talk by Andrew Haslam at St Bride Library,31 October 2007  \n============\n\nA talk and exhibition marking the launch of Andrew Haslam’s  \nindispensable guide to the subject.  \nWednesday 31 October 2007\n\nDrinks and viewing of the exhibition in the Farringdon Room, 6.00 pm  \nTalk in the Bridewell Hall, 7.00 pm\n\n\\* Admission: £5 (concessions £3)  \n\\* Venue: St Bride Foundation  \n\\* A small exhibition of books designed by students and alumni from  \nthe MA Communication Design at Central Saint Martins College of Art  \n– some of which feature in the book – accompanies the talk.\n\nBook design is a comprehensive and practical guide for students and  \nexperienced designers alike. The illustrated text takes the reader  \nthrough every aspect of the subject, from the components that make up  \na book, to the intricacies of grid construction and typeface  \nselection. The role of the designer is discussed, with advice on how  \nto interpret a design brief, guidance on the use of type, images and  \ninformation graphics. A range of approaches to layout are discussed  \nand the production process is explained, including information on  \nreproduction, printing and binding. Andrew will talk about the broad  \nrange of approaches covered in Book design and show examples of the  \nwork that features in the book.  \nBook design is published by Laurence King. Signed copies will be for  \nsale at a special reduced price before and after the talk.\n\nAndrew Haslam graduated from the Royal College of Art in 1987. Since  \nthen he has run his own studio in London creating science, history  \nand geography books for children. He has published 28 children’s  \nbooks. Recognition for his work includes the American Institute of  \nPhysics Award for Science writing, the Geographic Association Gold  \nmedal for most significant contribution to geography and the American  \nReaders’ Digest Creative Children’s Media Award for best series.  \nFor 12 years he has combined his studio work with teaching graphic  \ndesign and typography, first at the University of Brighton and then  \nat Central Saint Martins. He was Head of Typography at the London  \nCollege of Printing before becoming Course Director of MA  \nCommunication Design at Central Saint Martins and is currently Head  \nof Graphic Design.\n\n============\n\n",
  "author": "<a href=\"http://web.archive.org/web/20071213234659/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 5.Oct.2007 6.28am",
  "uid": "108",
  "comments": [

  ]
}
