{
  "id": "37822",
  "title": "FontMarketPlace.com",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "At [FontMarketPlace](http://web.archive.org/web/20081025042940/http:/fontmarketplace.com/), a new web storefront of Ascender Corporation, there are lots of fonts which say that the names are copyright Monotype, but they are priced at a fraction of the price they are on the Monotype storefront, Fonts.com. Why would Monotype compete with itself in this way? Can anybody explain what is going on here?\n\n [‹ Comic Sans T-Shirt](http://web.archive.org/web/20081025042940/http:/typophile.com/node/37589 \"Go to previous forum topic\") [Need Help! Trajan ›](http://web.archive.org/web/20081025042940/http:/typophile.com/node/37834 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025042940/http://typophile.com/user/1551\" title=\"View user profile.\">William Berkson</a>",
  "time": "<br>",
  "uid": "1551",
  "comments": [
    {
      "time": " 5.Oct.2007 7.23am",
      "content": "I have no information at all, but that doesn’t stop me from offering an opinion!\n\nI think it’s just a different market segment: the fonts are all offered with a single user EULA\\*, in TrueType only, and most (but not all) don’t include the small caps and osfs.\n\nThere are also some fonts that I suspect were never big sellers for Montotype, like [Pastonchi.](http://web.archive.org/web/20081025042940/http:/fontmarketplace.com/productinfo.aspx?ProductID=PAS01-70-01-01&CategoryID=41)\n\nIt is interesting to note that clause 10 of the [EULA](http://web.archive.org/web/20081025042940/http:/fontmarketplace.com/custom.aspx?ID=18) offers \\_editable\\_ embedding if used “in a “Personal or Internal Business Use” document (that is, a document other than a “Commercial Product” as defined herein)”.\n\n"
    },
    {
      "time": " 5.Oct.2007 7.32am",
      "content": "The EULA also says:\n\n<cite>8. You are hereby granted a […] license to access the Font Software […] <strong>only for your Personal or Internal Business Use</strong> […] You may not embed Font Software in a Commercial Product without a separate written license from Ascender, for an additional fee.</cite>\n\nSo, who has a need for _that_?\n\n"
    },
    {
      "time": " 5.Oct.2007 8.01am",
      "content": "Well, read the definition of Commercial Product in clause 7\\*, and then note that a “Personal or Internal Business Use” document” is qualified in clause 10: “(that is: a document other than a “Commercial Product” as defined herein)”.\n\n\\*”7. “Commercial Product” as used herein shall mean an electronic document or data file created by Use of the Font Software which is offered for distribution as a commercial product in exchange for a separate fee or other consideration. By way of illustration and not by way of limitation, an electronic book or magazine distributed for a fee shall be considered a Commercial Product; a document distributed in connection with a commercial transaction in which the consideration is unrelated to such document (for example, a business letter, a ticket for an event, or a receipt for purchase of tangible goods such as clothing) shall not be considered a Commercial Product.”\n\nSo....\n\n"
    },
    {
      "time": " 5.Oct.2007 8.30am",
      "content": "Yes John, I read that, but I must admit it doesn’t enlighten me.  \nLet’s say, I design an event invitation for a client: I’ll charge them for my work, but the invitation flyer itself won’t be “distributed for a fee”, of course. Is that not a Commercial Product, then?\n\nAnd when the same invitation (with the same fonts) is included in a magazine, as an ad, then it suddenly becomes a Commercial Product, because you have to pay for the magazine?\n\nEULA language is difficult … maybe I missed the point, not being a native English speaker.\n\n"
    },
    {
      "time": " 5.Oct.2007 8.45am",
      "content": "Well, I’m not a lawyer, but I am a native English speaker, so I’ll offer my opinion. Of course, I could be wrong, but to me this seems a reasonable interpretation of the EULA:\n\nFirst of all, we’re not discussing a print product, but rather “an electronic document or data file” offered for “for a separate fee”, so you needn’t worry about about the flyer or the print magazine.\n\nI interpret the EULA to mean that I can’t embed the font in a ebook I intend to sell, but I can embed it in a informational PDF that I put on my web site and allow the public to download free of charge.\n\n"
    },
    {
      "time": " 5.Oct.2007 9.02am",
      "content": "Look at the categories: CV, (personal) Business Cards, Baby, Birthday ...  \nThis is all for home users, who wan’t to print stuff for their personal use. “I design an event invitation for a client. I’ll charge them for my work“ is clearly not covered here. You would have to buy this font with the regular license from Ascender.\n\n"
    },
    {
      "time": " 5.Oct.2007 9.09am",
      "content": "John’s interpretation of the EULA for all of our fonts on the fontmarketplace site is correct.\n\nWe designed the website to appeal to home & office computer users who have never purchased or downloaded a font before. That’s why we start with a one user license and let them select the number of computers the font will be installed on.\n\nThe FontMarketplace.com website was formally announced on October 3rd - the press release can be read here: [http://www.ascendercorp.com/pr/pr2007\\_10\\_03.html](http://web.archive.org/web/20081025042940/http:/www.ascendercorp.com/pr/pr2007_10_03.html)\n\n"
    },
    {
      "time": " 5.Oct.2007 9.29am",
      "content": "Thanks folks, that’s what I expected.\n\n"
    },
    {
      "time": " 5.Oct.2007 9.37am",
      "content": "Typophile’s wiki recommends the Ascender Creativity Font Pack as one of a few [Font Starter Packs](http://web.archive.org/web/20081025042940/http:/typophile.com/node/30047), being <cite>of interest to students and designers looking to begin building a professional typeface collection</cite>.\n\nAs the ACFP ships with the same EULA mentioned above, I think that it is not recommendable for professionals, given that the fonts are <cite>only for […] Personal or Internal Business Use</cite>.\n\n"
    },
    {
      "time": " 5.Oct.2007 2.22pm",
      "content": "But, Florian and Ralf, read Bill’s response -“office computer users” - and the EULA itself:\n\n“a document distributed in connection with a commercial transaction... a business letter, a ticket for an event, or a receipt for purchase of tangible goods such as clothing...” I don’t think the EULA mandates home use only!\n\nIn many cases the single user EULA might be too restrictive, but I think it’s clear that professional use, per se, is within the terms of the EULA.\n\n"
    },
    {
      "time": " 5.Oct.2007 2.45pm",
      "content": "I gather that the goal here is to segment the market and expand one part of it for quality fonts. Fonts intended for publishing would be left to the full open type version of a font with multiple weights and styles. And these more restricted sets would be sold to those not involved in professional design and publication.\n\nWhat is not clear to me is whether this will just expand the market for fonts, or will undercut the profits for the full versions—or actually enhance them by fostering appreciation of quality fonts? To what extent do the two markets overlap, and in what way? I guess we will find out.\n\n"
    },
    {
      "time": " 6.Oct.2007 12.52am",
      "content": "John, so did it get this right?  \nAs an inhouse (salaried) designer, I can use those font licenses, e.g. to create business letters, business cards, graphics for the company’s website, whatever.  \nBut when I do the same job as a hired (contract) designer, I would need another, regular license?  \nThanks, F\n\n"
    },
    {
      "time": " 6.Oct.2007 3.30am",
      "content": "I guess you should ask Bill, not me.\n\nI see nothing in the EULA that would prevent you from using the fonts as a hired designer, provided you didn’t need to share them with anyone.\n\n"
    },
    {
      "time": " 6.Oct.2007 3.44am",
      "content": "In a EULA Internal and Business use, usually refers the the normal print work that fonts are used for in the corporate, design, advertising, and branding worlds. It would also allow graphics to be created for use on a web site. Commercial Product usually means something like a piece of software, a web book, or magazine distributed via pdf. That is created as a product for sale. Use of a font in tis realm would require a different license. Actually most EULAs contain this sort of language or something similar. (standard caveat, I am not a lawyer)\n\nTo me Font Market Place is aimed at MS Word Users who want a few new fonts to spice up their documents. Not really a high-end designer market.\n\n"
    },
    {
      "time": " 6.Oct.2007 11.50am",
      "content": "Florian wrote: “But when I do the same job as a hired (contract) designer, I would need another, regular license?”\n\nWith respect to FontMarketplace, the answer is no. The EULA language “personal and internal business use” describes how the font can be used (installed on personal computers, and not on web servers).\n\nThere is nothing to stop creative professionals from using the site, and if they increase the workstation license quantity to 5 then the price comes is similar to what they are paying today on our AscenderFonts.com site and many other creative professional font websites.\n\nAs others have described above, and as we have stated in our press release, our intent is to appeal to Microsoft Word users (and all the other software applications used at the home and office) by presenting fonts in a consumer-friendly manner, around themes and occasions, and to make them affordable with a single user license. Our believe is that there is a chasm between free font websites and creative professional font websites, and that’s where FontMarketplace is focused.\n\nAnd if we can entice people to move from Comic Sans to one of the many other FontMarketplace fonts, then I think many of you will believe that we’ve done our part to make the world a more beautiful place :)\n\n(note: of course we offer Comic Sans on the site for those who misplaced it and can’t live without it!)\n\n"
    },
    {
      "time": " 6.Oct.2007 3.10pm",
      "content": "Here’s the deal:\n\nThe license to the Font Marketplace fonts are almost identical to Ascender- the difference is the amount of machines the software can be installed on; in this case, one user.\n\nYou can use the fonts for “for-profit” graphic designs just like “any other font”. The commercial license only applies to the digital software embedded in a product for sale.\n\nAlso if the PDFs you designed that are edited by a client/associate/ Ascender/FontMarketplace would like that user to purchase his or her own license (which happens to be very affordable).\n\nPersonally I think Ascender has done a fabulous job of bringing low cost quality fonts to all users. The Ascender Originals are particularly excellent.\n\nMike Diaz :-)\n\n"
    },
    {
      "time": " 6.Oct.2007 3.15pm",
      "content": "Did anyone catch the Tahoma small caps? Heck! perhaps we’ll see Lucida with ranging figures!\n\nMikey :-)\n\nPS... I called Ascender and the they were polite and professional with my tedious bout of questions A+++\n\n"
    }
  ]
}
