{
  "id": "37843",
  "title": "Font problems between two computers. . .",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Working with ID CS3.0.1 -- job made up on one computer, move to another for final touches and printing -(both PC's...) the Times Roman font is not found, first computer a year or so older, font file looks identical... Older computer Has Times roman PS MT, newer just Times Roman. Havn't noticed another font doing anything like this. Can I ever get them to agree on Times Roman? And how\\>..? Million Thanks...\n\n",
  "author": "L Welch",
  "time": "6 Oct 2007 — 6:26am",
  "uid": "22504",
  "comments": [
    {
      "time": "6 Oct 2007 — 6:32am",
      "content": "can you embed the fonts in the file on the first PC? Or install the Times Roman version you want on the second PC?  \nR\n\n"
    },
    {
      "time": "6 Oct 2007 — 7:19am",
      "content": "From what I see, the fonts are identical, everything I can find is exactly the same, size of file, name, file dates, attributes... why should I have to do this, with same OS, same ID version, same everything... we're just getting ID going (from Pagemaker...) and this is a set-back!  \nWhen you embed, (would have to learn how to...) can you make changes etc. without the hassle of the font name difference?  \nThanks\n\n"
    },
    {
      "time": "6 Oct 2007 — 9:18am",
      "content": "[Times New Roman PS MT](http://web.archive.org/web/20131019005050/http:/www.myfonts.com/fonts/agfa/times-new-roman/) is Monotype's version of TNR... The other one isn't -- _i.e._, it's from another manufacturer. I agree with Russell that you should just install both versions of the font on each of your PCs.\n\n"
    },
    {
      "time": "7 Oct 2007 — 4:48am",
      "content": "I'd like to add to the suggestion made. Yes, put the other Times Roman on the other computer - but the addition is please remove the Times Roman that is residing there. You don't need any conflicts within the Times Roman family.\n\nP.S. I'm on a MAC - and I have to live with a .Times Roman dfont in my system. I always kept my \"families\" of fonts in one suitcase, but thank's the the new system, can't do that. I must now how individual suitcases, and remove the conflicts. And FYI - there have been tons of conflicts with the Times New Roman!\n\n"
    }
  ]
}
