{
  "id": "37849",
  "title": "(x) Garamond-like serif face - Adobe Serif substitution font {Lex}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I know there are more than one flavour of Garamond. I found a PDF with an embedded Garamond (or at least that what Illustrator told me it was looking for when I opened it) in it. I dont think this is Garamond at all, but am still wondering what it is.\n\nCan anyone identify this one?\n\nThanks\n\n| Attachment | Size |\n| --- | --- |\n| [annual.jpg](http://web.archive.org/web/20090822073930/http:/typophile.com/files/annual.jpg) | 13.86 KB |\n\n",
  "author": "<a href=\"/web/20090822073930/http://typophile.com/user/17410\" title=\"View user profile.\">buddhaboy</a>",
  "time": "<br>",
  "uid": "17410",
  "comments": [
    {
      "time": " 6.Oct.2007 3.13pm",
      "content": "That doesn’t look like Garamond. But in your PDF in Acrobat, if you go to File -\\> Document Properties (or I think it was something like that, you’ll find it), then theres a tab with ’Fonts’. If the font is embedded, it should be listed there.\n\n"
    },
    {
      "time": " 6.Oct.2007 3.26pm",
      "content": "That’s the odd thing... it’s just listed as Garamond-Book.... the document only contains this face and Frutiger... I don’t know why Acrobat is identifying it as Garamond... really confusing... but I agree, it isn’t Garamond, but I cant find what it is... it’s quite nice... Myfonts.com what the font thingy can’t recognise it either...\n\n"
    },
    {
      "time": " 6.Oct.2007 3.28pm",
      "content": "I think it’s Adobe Serif, probably standing in for Garamond.\n\n- Lex\n\n"
    },
    {
      "time": " 6.Oct.2007 3.29pm",
      "content": "Oh well, maybe it is some kind of odd Garamond then. It does look weird. Maybe someone else can give a more definitive answer. :)\n\n"
    },
    {
      "time": " 6.Oct.2007 3.41pm",
      "content": "I have found that PDF’s substitute something called Adobe Serif MM when a font is not embedded correctly... so presumably I must have this Adobe Serif MM on my system somewhere... but it’s not available through suitcase or anywhere else...\n\n"
    },
    {
      "time": " 6.Oct.2007 3.45pm",
      "content": "OK, so after more digging, it turns out this is a substitute font that is a hidden part of the PDF system, and is used when the original font is not embedded. However...\n\nIs there a font that is similar to it? It’s not too bad, and I quite like the forms! (there, I admit it!)\n\n"
    },
    {
      "time": " 6.Oct.2007 3.49pm",
      "content": "ITC Bookman is sort of similar to Adobe Serif, though the widths won’t match this, because Adobe Serif is automatically scaled to fit the widths of the missing font.\n\n- Lex\n\n"
    },
    {
      "time": " 6.Oct.2007 7.40pm",
      "content": "The latin characters of Kozuka Mincho from Adobe are based on Adobe Serif. But I don’t recommend it.\n\n"
    },
    {
      "time": " 8.Oct.2007 12.45pm",
      "content": "It’s kind of perverse that this typeface isn’t readily available... I quite like the uppercase C, and the height of the slabs is quite pleasing... Just goes to show how unique fonts are when you look closely enough :)\n\nBookman is the closest I can find too... Mincho is close in some respects but just doesn’t look right to me. Ah well...\n\nI wonder if anyone else likes the characteristics of the substitute font!\n\n"
    },
    {
      "time": " 9.Oct.2007 8.19am",
      "content": "\\>Adobe Serif is automatically scaled to fit the widths of the missing font.  \nJust out of curiosity, how does that work? Will it be just distorted to fit, for example, a width, or will it be –the vector curves– “calculated” every time new and rendered then …\n\n"
    }
  ]
}
