{
  "id": "37868",
  "title": "Overlapping components in fontlab",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi folks,\n\nI’m doing this typeface in fonlab build from components. I’m having 2 components which are overlapping eachother. I have a question cause when I do the fill out (presing “\\<” button) I can se som lines which looks “smoothered” - Tjek out img’s - marked with a red circle.\n\nMy q’tion goes like this: Is the smootheredness a problem when I generate the typeface?\n\n ![](http://web.archive.org/web/20071016080312im_/http:/typophile.com/files/fontlab01_4665.gif)\n\n ![](http://web.archive.org/web/20071016080312im_/http:/typophile.com/files/fontlab02_5812.gif)\n\n [‹ OpenType features/lookups](http://web.archive.org/web/20071016080312/http:/typophile.com/node/37969 \"Go to previous forum topic\") [CS2 font substitution ›](http://web.archive.org/web/20071016080312/http:/typophile.com/node/36529 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071016080312/http://typophile.com/user/12425\" title=\"View user profile.\">monefeldt</a>",
  "time": "<br>",
  "uid": "12425",
  "comments": [
    {
      "time": " 7.Oct.2007 4.06pm",
      "content": "From my experience, you need to decompose any overlapping components before generating. You’ll also need to ’Merge Contours’ (ctrl + F10 on PC)\n\nGood luck!\n\n- David\n\n"
    },
    {
      "time": " 8.Oct.2007 7.57am",
      "content": "I also always merge contours. You can then remove any points that might have been left by such inaccuracies as in your images.\n\n"
    },
    {
      "time": " 8.Oct.2007 9.24am",
      "content": "The little bumps you are seeing are the result of the way FontLab previews outlines when paths overlap.\n\nYou _can_ generate a font like that, and it will work with some programs (InDesign, for one), but other programs (Illustrator, for example) will refuse to print a document containing such fonts. Even when they work, they sometimes look weird on screen (InDesign makes holes appear at the overlaps at some zoom levels). In any case, overlapping paths are not allowed in the PostScript Type 1 spec, so you don’t want them in your finished fonts.\n\nHowever, it’s okay to have overlaps while you’re working on a font. It’s hard to make some kinds of letter shapes to look right (scripts, for instance) without overlapping paths. And if the design is still in flux, it makes it easier to play with the design.\n\nIn the end, before you generate a font, you will need to remove the overlaps. Be sure to check the results when removing the overlaps. Because the resolution of the em square is limited, you may get a little distortion due to the fact that the new control points that are created where lines intersect have to fall on a whole-unit coordinates.\n\n"
    },
    {
      "time": " 10.Oct.2007 6.04am",
      "content": "Even in InDesign, on some non-PostScript printers such fonts will print reversed on the overlaps.\n\nA.\n\n"
    },
    {
      "time": " 10.Oct.2007 12.10pm",
      "content": "Overlapping contours are clearly a problem for the buggy end of PostScript, but overlapping composites should always work (i.e. fill as you expect), because of another “bug”.\n\nCheers!\n\n"
    }
  ]
}
