{
  "id": "37861",
  "title": "Italic accent placement.",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi all,\n\nI’m curious if my workflow/method for constructing accent italic characters is the correct method.\n\nI have the glyphs in there correct places and the use Glyphs \\> Create Glyghs to create the accented glyphs, which will be a composite of the two seperate glyphs. This works fine but the accent is always far over on the left. I then go through all the accent glyphs and move the accents over to the right.\n\nIs there a way to create the accent glyphs so the accents will be placed in the correct position, or somewhere close.\n\n| Attachment | Size |\n| --- | --- |\n| [accent.jpg](http://web.archive.org/web/20071016080307/http:/typophile.com/files/accent.jpg) | 37.18 KB |\n\n [‹ indesign \"BLENDING HELP\"](http://web.archive.org/web/20071016080307/http:/typophile.com/node/37870 \"Go to previous forum topic\") [A replacement of my old ATM after Vista upgrade? ›](http://web.archive.org/web/20071016080307/http:/typophile.com/node/37850 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071016080307/http://typophile.com/user/16986\" title=\"View user profile.\">RachelR</a>",
  "time": "<br>",
  "uid": "16986",
  "comments": [
    {
      "time": " 7.Oct.2007 9.31am",
      "content": "There may be a more effective way, but I do think you will _always_ need to manually optically place it in the right spot. Especially since the optical middle of characters differ.\n\n"
    },
    {
      "time": " 7.Oct.2007 9.49am",
      "content": "ctrl clicking on the compentent in the glyph window and choosing center is a good start, but I was wondering is there a macro I could use to do this action on a group of glyph windows selected.\n\nI realize I will need to optically place the accents but I just wanted something I could quickly use to get a general idea so I could text the accents.\n\nRr\n\n"
    },
    {
      "time": " 7.Oct.2007 9.54am",
      "content": "I think the ’anchors’ in FontLab enable you to solve this problem.\n\n"
    },
    {
      "time": " 7.Oct.2007 9.59am",
      "content": "Could you give me any pointers how I might go about this with anchors\n\n"
    },
    {
      "time": " 7.Oct.2007 11.02am",
      "content": "The concept on anchors is that you define one ’center’ above (or below) the letters, and one in each accent, and then FontLab will generate the composites so the anchors coincide.\n\n"
    }
  ]
}
