{
  "id": "37862",
  "title": "Bodoni Museum - Worth it?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My wife and I are planning our belated honeymoon, and the current plan is for Florence, via Rome, in early January. Ideally I’d like to drag her to as many typographic points of interest as possible during this trip.\n\nThere’s already a lot of info here on what’s available in Rome and Florence, but I’ve also got my eye on the Bodoni Museum in Parma. Looking at the maps, it would seem possible to get to Parma from Florence by rail, but I’m going to assume it will take a bunch of money and time. My question is, to any who have visited this museum, is it worth the trip? Thanks-\n\n [‹ QUICK SIMPLE ANIMATION WITH MUSIC? HOW?](http://web.archive.org/web/20071010065546/http:/typophile.com/node/37901 \"Go to previous forum topic\") [Bottle-arsed type? ›](http://web.archive.org/web/20071010065546/http:/typophile.com/node/37899 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071010065546/http://typophile.com/user/16884\" title=\"View user profile.\">Ehague</a>",
  "time": "<br>",
  "uid": "16884",
  "comments": [
    {
      "time": " 7.Oct.2007 9.39am",
      "content": "Italian railway tickets aren’t that expensive, but be prepared for delays.  \n38 euros for two in 2nd class  \n [http://www.trenitalia.com/en/index.html](http://web.archive.org/web/20071010065546/http:/www.trenitalia.com/en/index.html \"http://www.trenitalia.com/en/index.html\")\n\nNever been to Parma or the museum, though.\n\n"
    },
    {
      "time": " 7.Oct.2007 9.54am",
      "content": "Set an [appointment](http://web.archive.org/web/20071010065546/http:/www.mb-museobodoniano.it/informazioni.htm) if you want to visit the Museo Bodoniano.  \nAn alternative could be a cozy room in one of the [Five Lands](http://web.archive.org/web/20071010065546/http:/www.cinqueterre.it/en/ct1.html).\n\n"
    },
    {
      "time": " 7.Oct.2007 3.07pm",
      "content": "I’d say it is worth a detour. Parma is a small city, it is not too touristic and very beautiful–like most of the medieval north italian cities.\n\nThe museum is situated in the ducal palace which is dominating the center. You can still feel the atmosphere of the times when Bodoni was working there as the king of typographers. Bodoni’s elegant books, his tools, punches and characters together with the exhibition regarding the history of the book is worth a visit.\n\nThe museum is open in the morning from 9 am to 1 pm, but you should make an appointment!!!! Tel. 00390521/220411, Fax 00390521/235662, E-mail:mubodoni@unipr.it Maybe someone who speaks english can show you around (some of the students who are working at the library in the palace?\n\n"
    },
    {
      "time": " 7.Oct.2007 4.06pm",
      "content": "Thanks so much for the information—I’m glad I asked.\n\nAlessandro, a friend of mine was telling me about a hiking trip he took that sounds a lot like the Five Lands. I don’t know how long we’ll be in Italy yet, but we’ll consider anything at this point.\n\n"
    },
    {
      "time": " 8.Oct.2007 10.44am",
      "content": "It is definitely worth it, Eric!\n\nI have been there twice. And I will make visits again.  \nBesides, every detour in this country is worth it!  \nEvery ;-)\n\nStefan(o)\n\nPS  \nYou have to visit Verona as well. You have to!\n\n"
    },
    {
      "time": " 8.Oct.2007 10.47am",
      "content": "PS\n\nIf you want to do good lettering and inspired typefaces, stay as long as possible.\n\n"
    },
    {
      "time": " 8.Oct.2007 11.34am",
      "content": "Make sure not to say, “honey I want to _drag_ you to all of these typographic locations...” and “honeymoon” too closely. Unless, of course, she is a type geek, then it might actually enhance the honeymoon. ;^)\n\n"
    },
    {
      "time": " 8.Oct.2007 11.52pm",
      "content": "Guess it is in remember of your own honeymoon? ;-)  \nNice post, I had to laugh.\n\nStefan\n\n"
    }
  ]
}
