{
  "id": "37876",
  "title": "critique my cv plz.",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi all,\n\nI've just graduated from graphic design at teesside uni (in lovely middlesbrough uk). =)\n\nI have now (finally) found a studio apartment in London, Harringey (in case anyone is moving to london don't hesitate to mail me with questions...it took me nearly 2 months to find something not too expensive and still in a nice area..so I might have some tips in case you need them).\n\nAnyway, I'm going to start looking for a graphic job asap but would like some feedback on my cv first.\n\nAlso if anyone can be bothered I would greatly appreciate it if you could look at my portfolio as well for some feedback. It's a bit of a download but with the speeds nowadays I'm sure it won't really be a problem.  \nYou can find it [here](http://web.archive.org/web/20131017123409/http:/davdesign.net/work.html).\n\nThank you so much for your time and help!  \ndav2.\n\np.s. I have looked at other cv's on the typophile forums (and elsewhere) and there might be parts of text that are similar to others. I used these for the feedback that was given to them, but everything in the cv is definitely related to what I do/want to be doing and I have adapted everything to how I would say it. Thought I'd just let you know. English is also not my first language so that's why I had to do some research into writing an english cv.\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 11\\_1.png](http://web.archive.org/web/20131017123409/http:/typophile.com/files/Picture%2011_1.png) | 113.48 KB |\n| [Picture 11\\_3.png](http://web.archive.org/web/20131017123409/http:/typophile.com/files/Picture%2011_3.png) | 113.03 KB |\n\n",
  "author": "skeetone",
  "time": "8 Oct 2007 — 5:16am",
  "uid": "11657",
  "comments": [
    {
      "time": "8 Oct 2007 — 6:05am",
      "content": "Cool. What's wrong with the width of the box \"I am passionate about design.\"\n\n"
    },
    {
      "time": "8 Oct 2007 — 6:28am",
      "content": "I was doubting to keep both the top texts in the same style. wait I'll upload a screenshot of what I mean...\n\ntnx for liking it though (I guess that is what you mean with cool) =)\n\nas you can see I also broke the top line left to make it the same shape as on the top right....do you think that's a bit over the top and just a bit weird looking?\n\n"
    },
    {
      "time": "8 Oct 2007 — 6:51am",
      "content": "Hi David, firstly, I really like your branding work. I especially like your use of strong colours throughout your portfolio.\n\nAs for critique, I think your typography could be cleaned up slightly. Here are a few thoughts that I had looking at your CV.\n\nFirstly, I would say there are too many different typefaces there. I would suggest using 2 at the most, but using 1 would be even better. To create hierarchy, use different colours (which you have) and weights within the typeface.\n\nSecondly, I would say the leading is slightly too loose and gappy. As a general rule, or starting point at least, I usually add 2pts to the font size for my leading. I.e. if my font size is 9ot, my leading will be around 11pts, but then play around with it until you are happy.\n\nThirdly, I would say that in your bulleted lists, you should use \"space before\" and \"space after\" each point to create space instead of increasing the leading. This helps to keep each point together and easier to read.\n\nAlso, in your contact details, the \"p\" is capitalised, and the rest aren't.\n\nIn your portfolio, I would say that the reflections can be a little too strong in some of them and can distract from the work, which should be the main focus.\n\nAlso, (and this is my last point, I promise), the text at the end of the sections is quite large and quite blocky. Maybe try to reduce the type size and maybe just have the headings in red and the body copy in black or a dark grey? I think the line width is perfect though.\n\nI think your work is great and you shouldn't have any problems finding work. A last little bit of advice, and this is speaking from personal experience, is to not take the first job that comes along. You have good skills and a hell of a lot of potential, so think about what job you want and chase that be patient, and the right job will come along.\n\nHope this has helped?\n\nGood luck,\n\nJem\n\n"
    },
    {
      "time": "8 Oct 2007 — 6:57am",
      "content": "I like it!  \nBtw. you could try bright colors. I think they work generally better with underware typefaces. Especially i'm talking about the text in grey. Hehe, instead of buying Sauna, you go with a similar ITC font, i've never seen before. Thanks for that.\n\n"
    },
    {
      "time": "8 Oct 2007 — 6:57am",
      "content": "Having to say you are passionate about design seems a little redundant. Isn't that implied? Would you expect resumes from people that were 'eh...I'm so-so about design'? ;0)\n\nAs such, I'd suggest maybe omitting the upper two right paragraphs.\n\nOverall, I like the layout a lot. Some suggestions:\n\nYour red heads are 'floated' to the left, but the grey ones float above the items. Seems a little inconsistent.\n\nWhile I like the typefaces, the grey headings are a bit too decorative IMHO. I'd use the body text face for those.\n\nI'd also right-align the 'pmew' for your connect info.\n\nSpell QuarkXPress correctly (99% of students can't seem to spell that one ;o)\n\nI'm also not sure how important it is to list specific software. I know folks have differing opinions on that.\n\n"
    },
    {
      "time": "8 Oct 2007 — 7:10am",
      "content": "thank you so much for your detailed feedback Jem! Very much appreciated!\n\nI'll play around with what you said.\n\nFor the leading I just used the standard baseline grid in indesign for everything but the top text. That way it all lined up nicely, but I did feel like the text in the top could use a bit more. I'll play around with the leading in the whole document now though.\n\nThe bullets I just used a tab for everything behind the bullets. So everything starts with a tab of 0.2 cm. Thanks for explaining to me how to make the bullets look a bit more integrated in the whole and keeping it all more readable.\n\nThanks for the P...how stupid can I be!! I think I've looked at it for too long...thanks so much!\n\nI'll see how the reflections look if a bit dimmed.\n\nThe portfolio itself is at the moment set on A5 high res print pdf. That might be why it's a bit blocky. The type I used is Dolly Roman (underware) in 8pt. I didn't think I could really go much smaller then that...then again the Dolly is very readable in small sizes. I also have the portfolio in A4 (that I will be printing as seperate sheets laminated that fit perfectly in a small plastic little suitcase I bought at the design museum (london)...which happens to be white and gray as well and I'll put a sticker of my logo on it as well).\n\nThank you also for giving me some more confidence in my work, I'll need that when the interviews start! =))\n\nin all thanks so much!\n\n"
    },
    {
      "time": "8 Oct 2007 — 7:54am",
      "content": "aluminum: Thanks for the reply!\n\nThe reason the grey ones are above the items is that Responsibilities, Visual Identities and Promotional Items are all a bit too long to do the same thing... But I thought that as long as I do it with all of them the same it will regain its consistency again =))\n\nThe grey headings have now been replaced by the same typeface as the red headers.  \nI don't generally like right-aligning things...do you think it would really look that much better (I will give it a try ofcourse!!).\n\nThanks for the quark =))\n\nvery much appreciated Aluminum.\n\nPoms: Thank you for your reply!!  \nI know what you mean about the bright colours, but in this case I didn't want it to be too bright. I think I like the colours like this, they are friendly on the eyes =))\n\nThe type used for the red headings is the Tyke (although the logo type is the cooper...sorry about that). I've been looking into slab serif typefaces and I found the Tyke quite a nice one. For a while now I've been stuck doing loads of stuff with the Bello Pro and the Sauna (I really love them!) but I just wanted to move on to something else for a change.  \nThank you so much for your feedback!!!\n\nThanks all!!!  \ndav2.\n\n"
    },
    {
      "time": "8 Oct 2007 — 7:56am",
      "content": "BTW, I really like your logo.\n\n"
    },
    {
      "time": "8 Oct 2007 — 8:07am",
      "content": "cheers aluminum!  \nI'm gonna have a few stickers printed, just let me know if you want one! =)))\n\nJust uploaded a new screenshot.\n\nChanged bullets as Jem said. Changed the P...but now it looks in capital still..but it's not! =)  \nChanged grey headers (tyke, 9pt).  \nAll text is now 9pt with 11pt leading...ow damn..forgot the top text..that's on 16pt leading still....  \nFixing QuarkXpress now.\n\npicture 5 has the QuarkXPress fixed and the top text on 11pt leading at 9pt text.\n\n"
    },
    {
      "time": "8 Oct 2007 — 9:16am",
      "content": "Looking really good mate, I think losing the grey scripty font has made a big difference and helped it to look a lot cleaner. Looking at it, it would work well as a tri fold. The left panel almost looks like it could be a front cover.\n\nBest of luck with the job search, let us know how it goes.\n\nJem\n\n"
    },
    {
      "time": "8 Oct 2007 — 9:20am",
      "content": "funny you'd say that =)\n\nI am planning on folding it just like you said. The middle and right facing eachother the and left one folded the other way around so it's the front of it (it's just a bit smaller though the the other 2, but I'm thinking of writing just a small catch phrase on the back of the middle part that would vertically align just left of the front then...if you know what I mean =)\n\nThanks Jem, will keep you posted!  \n(also working on the portfolio tips you gave me now) =)\n\n"
    },
    {
      "time": "8 Oct 2007 — 11:36am",
      "content": "Have you got the dieresis in \"Ideeen\" right? I don't speak Dutch (is it Dutch?) but, assuming it's pronounced as it would be in Afrikaans (Idee-en), then I would think it should be on the third \"e\", \\*after\\* the syllable break.\n\nSo does Dutch put the dieresis before the syllable break, or have I guessed the pronunciation wrong?\n\n"
    },
    {
      "time": "8 Oct 2007 — 11:41am",
      "content": "I'd still like to see one with the PMEW aligned right. As it is now, they're sort of floating off in space and I want to read it as a word 'pmew!'\n\nBut, really, overall, this is looking great!\n\n"
    },
    {
      "time": "8 Oct 2007 — 12:07pm",
      "content": "sorry..forgot about that one!!\n\npicture 6 has the pmew aligned right.  \nMaybe it can go a little bit more to the left though...not sure.\n\n"
    },
    {
      "time": "8 Oct 2007 — 12:10pm",
      "content": "I'm not sure why, but for some reason it looks less confident as a block with the details behind it...perhaps sounds a bit weird... =))\n\ncurious what you think of it!\n\nthanks for giving me the advice aluminum.\n\n"
    },
    {
      "time": "8 Oct 2007 — 12:24pm",
      "content": "mr...you are right. It should be on the last e! thank you so much!!\n\nlike you said...it is idee-en.\n\nhmz...my dutch is really getting worse and worse! (so ashamed).\n\n"
    },
    {
      "time": "9 Oct 2007 — 8:01am",
      "content": "It's probably just me who feels this way, as no one has mentioned it so far, but the line down the center of the bulk of your information seems to imply some sort of symmetry. The symmetry is there for the most part treatment of text but not contact. Instead of reading from top to bottom on the left and and then top to bottom on the right, my eye has the tendency to want to compare things, such as education vs experience, software vs freelance. Have you tried looking at it without the line? I suppose the same goes for the text at the top--I don't really see a reason for the different colored grays. The four pieces of text at the top seem to be related and proving the same point more or less, and I wonder if they could be moved closer together, though I am not sure what effect that would have on the rest of the layout.\n\n"
    },
    {
      "time": "9 Oct 2007 — 8:48am",
      "content": "Under Resposibilities, the point on 'Maintaining & updating printed material....' could probably be tweaked a bit.\n\nFrom the description it could well sound as if your responsibility was to maintain inventory of printed material. Was that what you meant?\n\nPersonally I'd be more comfortable if the ampersand were sustituted with an 'and'\n\nAlso, I feel it should be just 'great attention to detail', and not 'a great attention to detail'\n\nThe immediate next point could also do with more clarity. 'Interacting' may be better than 'consulting.'\n\nFinally under interests, do you need to mention '...my friends', wouldn't it mean the same thing even if you knock off 'my'?\n\nAnd the logo in slightly smaller size?.... you wouldn't get to do that a lot once you get in to that job ;)\n\n"
    },
    {
      "time": "9 Oct 2007 — 9:14am",
      "content": "Thank you for your feedback JABZOOG.  \nI understand what you mean and now that you said that...I think it would be better to keep the top all the same colour.  \nAs far as the line is concerned I'll have to give that a try. I also think that the horizontal line can move up a bit to give a bit more space to the copy under it and balance it a bit more with the white space above it.\n\nthanks again!\n\n"
    },
    {
      "time": "9 Oct 2007 — 9:36am",
      "content": "Thanks writingdesigning! I think you were quite right with most of these comments.  \nFor the maintaining part I basically worked on exsisting grids, formats, typography, etc of financial reports, in-house magazines for companies and those kind of things. So everything was already designed, it just needed new text, new photos, colours, navigation styles etc. But it was all already pretty much set on how it should look. If you know what I mean.\n\nI have now also moved the logo a bit to the left so that when the whole is folded in 3 it will be more in the middle of the front.\n\npictures coming up =)\n\nthanks!!\n\n"
    },
    {
      "time": "9 Oct 2007 — 9:57am",
      "content": "\"For the maintaining part....\"\n\nThen you might want to say something like: 'designed revisions of print applications within the parameters of the brand guidelines.'\n\nIn spite of the limits set by the guidelines, I'm sure there were quite a lot of smaller design decisions involved. I wouldn't worry about using the word design.\n\n"
    },
    {
      "time": "10 Oct 2007 — 12:24pm",
      "content": "Looks great! Good luck with your job search. It was said earlier, but I think it rings true, don't settle for the first opportunity that comes your way. :]\n\n"
    },
    {
      "time": "11 Oct 2007 — 9:03am",
      "content": "It would be an idea to run a spell-check before you send it out.\n\nGood luck finding a place!\n\n"
    },
    {
      "time": "13 Oct 2007 — 2:00am",
      "content": "thank you all so much for you help!  \nGotta love this forum!!\n\nAs soon as I got some money again I will preparing my cv and portfolio (printing, laminating and all that) I hope I can post some pics of it all soon. I'll keep you all posted on my job-hunting as well =)\n\nThanks again!  \ndav2.\n\n"
    }
  ]
}
