{
  "id": "37889",
  "title": "Talent vs. Skill",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey all. I have a philosophical question about design. Apologies in advance if it’s not typographical enough, but I’ve always like the discussions you get into and appreciate your opinions.\n\nAs a bit of background, I’m a designer who got to be a designer after several years as a newspaper copy editor. Once I moved to newspaper design, I freaking loved it. I moved cities this year and when I got a new job, I shifted from newspapers to a small company that does marketing-ish design work (brochures, letterhead, business cards, logos).\n\nI’ve always set my sights on improvement and pushing myself, no matter what I’m doing. Recently, I’ve felt frustrated that my design work hasn’t skyrocketed; that my creativity doesn’t poor out of me.\n\nThen I realized why, maybe, that is:\n\nI’m not a design talent. I’m skilled at design. I know how to make things work and look good, but I’m not highly original.\n\nSo the question is, though talent can’t be taught, can skill be tweaked to a level of excellence? If I wanted to, say, strike out on my own to do work similar to what I do now, is my skill enough to make it last?\n\n [‹ Modern + Different Serif](http://web.archive.org/web/20081201170242/http:/www.typophile.com/node/37801 \"Go to previous forum topic\") [something similar to continuum ›](http://web.archive.org/web/20081201170242/http:/www.typophile.com/node/38029 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201170242/http://www.typophile.com/user/18714\" title=\"View user profile.\">lindsaydurango</a>",
  "time": "<br>",
  "uid": "18714",
  "comments": [
    {
      "time": " 8.Oct.2007 11.25am",
      "content": "I’d say part of it depends on the types of clients and industries with which you seek to work. Don’t be intimidated by rock star talent. What matters is developing visual sophistication. To me this includes watching and understanding a variety cultural shifts and movements as well as delving into other areas of visual arts and design—architecture, illustration, photography, film, animation, typography and on.... And of course it helps to read books.\n\n(I don’t do nearly enough of any of this)\n\n"
    },
    {
      "time": " 8.Oct.2007 11.26am",
      "content": "Lindsay: Speaking from experience.... There is a school of thought in personnel/HR that people have innate “aptitudes”—for example, an aptitude for abstract thought & facility with words, an aptitude for flat (2-dimensional) design, an aptitude for 3-dimensional design, good hand-eye coordination. The Johnson O’Connor Foundation, in particular, has designed tests for evaluating these aptitudes—from assembling a “wiggly block” puzzle [3-dimensional problem solving], to picking up steel pegs with a tweezer [manual dexterity], to drawing some x,y, z coordinates that have been flashed briefly on a screen. They created these tests originally to find the best people to work in factory positions, and then expanded the tests to determine better fits in offices and such. (It’s very much of a time when people joined a multinational corporation and moved around within divisions.) JOF is now independent of any particular company, and their findings are not accepted in some HR circles, but I personally have found them helpful. In NYC, a lot of rich kids are sent to JOF for their battery of tests.\n\nThis testing is quite distinct from the widely administered Meyers-Briggs personality tests. The overlap might be: what is easier for you to do and is more fulfilling tends to be what you have an aptitude for.\n\nI know that I’m not answering your question as posed, but there you go. I suspect the real question is whether you can run your own business: i.e., run your own office and accounting, meet with clients, manage expectations, meet deadlines without excuses, and write a coherent business plan.\n\n-Paul\n\n"
    },
    {
      "time": " 8.Oct.2007 11.43am",
      "content": "Talent is largely a myth applied to people who are skilled, fortunate, and persistent. People have aptitudes, but anyone can learn to do something if they really want to devote the time and effort to it. The trouble is that we all have only so much time and effort to give.\n\nI think the distinction you really mean to make when you speak of “talent and skill” is between art and craft, concept and execution. Creativity is a skill also, and you can be taught to be creative if you want to learn. But you’ll have to decide if it’s worth it to you, because technical skill is far more valuable and you can get by quite easily with it alone. A lot of people wait until their other skills have made them extremely successful and _then_ learn to have original ideas because they have more freedom to do so.\n\n"
    },
    {
      "time": " 8.Oct.2007 11.59am",
      "content": "<cite>Talent is largely a myth applied to people who are skilled, fortunate, and persistent.</cite>\n\nI think there is a proclivity for certain abilities that is related to how the brain is wired. I can’t even conceive of things that certain people do. Whether it be dance, music, art, or even things like mathematics, some people just have a genius for it that others couldn’t attain to even if they were able to devote their lives to it.\n\n"
    },
    {
      "time": " 8.Oct.2007 12.21pm",
      "content": "I know, it’s a bit of a casted type but check out Mat 25:14-30.\n\n"
    },
    {
      "time": " 8.Oct.2007 12.58pm",
      "content": "I’m loving this; let’s get psycho-social on this mess (one of my “talents” is [over]analysis of data that are seemingly subjective facets of life).\n\nI will definitely have to pursue the aptitudes, if only to feed my overanalytical side.\n\nAnd I feel that, with proper research, paul\\_romaine, I could be really good on the business side. Because that’s just numbers, right?\n\nAnd what I mean to say by that is, I feel perfectly good at my ability to absorb any number of facts on the number/business side of things. But absorbing the more artful side? I get sensitive, overwhelmed, concerned.\n\nWhich pushes the question of what makes someone feel confident in one area over another. I can’t touch artiness. But reading about practice, observation, precision over years of doing those artful things makes it much more approachable. And I actually feel like, OK, I’ll be just fine.\n\nSo thanks. And I’d be interested to hear more opinions on this if they’re out there.\n\n(I’ll try not to get too philosophical on y’all. I feel it coming, though :)\n\n"
    },
    {
      "time": " 8.Oct.2007 1.06pm",
      "content": "I think that it was Mies Van Der Rohe who said “I don’t believe in talent, I believe in work.”\n\nVery few individuals have talent that just pours out; it seems to me that those who do are usually at least a little crazy and burn out on drugs, booze, and other such nonsense. Successful creative types churn out a whole lot of mediocre stuff that either gets forgotten about or thrown away. Or maybe they’re at a big firm where a dozen designers and a small host of production staff attack problems in teams, tweaking every weak spot over a period of months. But it’s rare to pull off amazing stuff consistently on your own.\n\nMaybe your work is just stagnating and you need to make a change in your life. Creativity is largely the directed output of all the stuff that goes into ones subconscious mind and gets churned around, it could be that you just need to start putting different stuff in. This could be as small as going to the movies more often or as big as moving to another country. But it’s worth a shot.\n\n"
    },
    {
      "time": " 8.Oct.2007 2.47pm",
      "content": "[http://www.cs.cmu.edu/~pausch/](http://web.archive.org/web/20081201170242/http:/www.cs.cmu.edu/~pausch/ \"http://www.cs.cmu.edu/~pausch/\")\n\n"
    },
    {
      "time": " 8.Oct.2007 3.12pm",
      "content": "“I don’t believe in talent, I believe in work.”  \nThat only can say a person, who is talented. ;)\n\nBtw. in german “Talent” (talent) is used the same way as “Neigung/Begabung” (aptitude)\n\n"
    },
    {
      "time": " 8.Oct.2007 3.40pm",
      "content": "@poms  \nThat means I’m talented as heck, ’cause I’m silly with aptitude :) (Not short on humility, either).\n\n@alessandro  \nI’m 15 minutes into the video of Pausch’s lecture and, after my dinner, will be scrambling to finish it. Inspiring stuff.\n\n@James  \nI think change could be a key. My new job isn’t what I was expecting. The people I work with are very nice, but our tastes don’t mesh. I guess what I’m saying is I don’t feel particularly inspired or challenged by the design atmosphere I’m in (I’m learning a lot of very valuable information about production, though).\n\nI can’t quite change my environment, but I can change which environment I look to for inspiration. I’ve tended to put more stock in the learning I get from structured environments, like class or the workplace; I just need to get over it and open magazines, go to web sites and suck everything up.\n\nThings are bubbling ...\n\n"
    },
    {
      "time": " 9.Oct.2007 2.31am",
      "content": "Lindsay,\n\nIn New York in the old days, we would say you went through an apprentice program. You learned how to place the graphics and type on a page layout - so it is readable - not cluttered or distracting to the eye. Your apprenticeship ended when you were moved into the new position.\n\nWhat they also taught you was how to design in a production manner. Though not exciting to a designer - very competent and appreciated by the printer.\n\nPlease remember that even the best art directors in New York, still took their time to look at “greeting cards” to get inspiration for their upcoming projects...\n\nCongratulations on your new job and home. Hope you are happy and well.\n\n"
    },
    {
      "time": " 9.Oct.2007 6.15am",
      "content": "I know several successful designers (including a creative director of a major publisher) who got where they are through diligent effort, not through innate gifts.\n\n"
    },
    {
      "time": " 9.Oct.2007 7.25am",
      "content": "I tend to agree with most of the posters but want to take it a step further to try to consolidate these thoughts . . .\n\nTalent is an editorial on skill and it is never self realized but rather assigned by a 3rd party . . .\n\nTake it with a grain of salt . . . It’s like being told you have amazing earlobes . . . The truth is you have nothing but genetics to thank for your great earlobes and no talent was required to make them great but if a third party says it’s so, does that give the claim more credibility?\n\nAt the end of the day, study, practice, willingness to be open to learn, and dilligence to any craft will yield unparalleled skill which may result in accolades of talent but striving for talent itself is self-indulgent by these standards . . .\n\nStuart :D\n\n"
    },
    {
      "time": " 9.Oct.2007 8.15am",
      "content": "Lindsay: Well, speaking as someone who is NOT in design but works as independent contractor, there’s a lot more to business than numbers. I’d say psychology, project management, communication skills, and integrity all apply. It took me a few years to realize that.\n\n"
    },
    {
      "time": " 9.Oct.2007 9.26am",
      "content": "@ Stuart  \nNo, no, no (hehe)  \nFirst is the so called “talent”, then the “trail and error” social thingi and the true work. Happy Neo Darwinism :) Btw. I’m a big fan of the propagandist qualities of Richard Dawkins.  \nIf Mies van der Rohe said this\\* sentence; then it was a polemic statement against the “genius artist thing” which the media was on heavily at that time.  \nEngineering, industrial rationalism were the real hip and sexy things in Europe, until the dark elements won that war for nearly 12 years …\n\n“Kunst ist schön und macht viel Arbeit” said Karl Valentin  \n“Art is beautiful and prepares a lot of work” is my poor translation of this kind of dadaesk truth. Which is much better communicated than (\\*)\n\n\\* “I don’t believe in talent, I believe in work.”\n\n"
    },
    {
      "time": " 9.Oct.2007 9.35am",
      "content": "When reporters/photographers/designers retired from the newspaper, we gave them really great send-offs. Among all the stories told about that journalist, the jokes about where they were going and well-wishes, there was inevitably a timeline of that journalist’s career.\n\nAnd you know what? I always, always forget just how many hard jobs each of those people had; and how long they’d spent in the beginning of their careers doing gritty work, building up to the fine job everyone was gathered to honor.\n\nI guess a lot of my frustration is really just impatience (now that I’m getting a pretty good sense that I can build my skills into something like talent).\n\nAnd Paul, thanks for the insight into business. I hadn’t given it as much thought as I should. Glad you caught me before I shot out of the gate.\n\n"
    },
    {
      "time": " 9.Oct.2007 11.37am",
      "content": "I believe a good memory can be quite useful.\n\n"
    },
    {
      "time": " 9.Oct.2007 11.43am",
      "content": "Care to elaborate? Or shall I just start memorizing everything, simple as that? :)\n\n"
    },
    {
      "time": " 9.Oct.2007 5.19pm",
      "content": "<cite> I believe a good memory can be quite useful. </cite>\n\nI’m totally with you on this and I’ve suspected as much for a little while. I’m a youngish guy but for whatever reason; bad work habits, lack of good systems, whatever I’m finding my memory is getting really bad generally and I feel like it affects my ability to design well. Often I’ll sit down to brainstorm and I feel like I’m starting, not just the current project, but everything from a blank slate.\n\nSurely great design is an ability to apply the theory you’ve gathered about how to communicate visually. This includes an incredible amount of detail, stylistic and technical. I guess you could say skill = good tools and memory = raw resource, without memory you’re sunk, with a bad memory you’re struggling. I realise this is a potential hijack, but if people have tips for how they go about retaining information, at least I would be grateful.\n\n—N\n\n"
    },
    {
      "time": " 9.Oct.2007 8.37pm",
      "content": "If you’re blessed with a good memory, it can make life a lot easier.  \nIt’s a talent, like having an eye for colour or an ear for pitch.  \nIt’s not like being smart, but it helps, and can create that illusion.  \nYou can train it, but another approach is to create a memory-friendly working environment. (On the principle that mind is ecologically immanent.) For me, that’s rather messy, but how can you find things when they’re tidied away?\n\nOswald Cooper used to read the paper every morning in his studio, then lay it down on top of yesterday’s paper—with all correspondence and documents for that day sandwiched between. A filing system.\n\n"
    },
    {
      "time": " 9.Oct.2007 10.28pm",
      "content": "_So the question is, though talent can’t be taught, can skill be tweaked to a level of excellence?_\n\nSure, why not? But what is ’excellence’ anyways? Do you mean to ’excel’ - as in, to go beyond mediocrity?\n\n_If I wanted to, say, strike out on my own to do work similar to what I do now, is my skill enough to make it last?_\n\nCan’t answer that one - don’t know where you’re at.\n\nlindsaydurango, there’s no timeline for talent. It shows - when it shows. Talent is not the domain of youth. And creativity does not = talent. Creativity is an innate force, which manifests itself as ideas. Talent forms/shapes those ideas into/with a clear vernacular - a well articulated voice. Each element well pronounced and in harmony with the whole. Ha, including ’the details’. God is in the details - isn’t he/it?\n\nI’m beginning to babble.\n\n"
    },
    {
      "time": " 10.Oct.2007 5.20am",
      "content": "@Nick S.  \nThat rings true. I’ve started to tape good pieces on the wall opposite me with this idea that they will seep deep enough into my subconscious to come of something later.\n\n@Nicholas and Hiroshige  \nPlease babble and hijack. The best ideas I’ve had, whether for work or to feed my general philosophical theorizing, have come through wondering thoughts and bouncing off of other people’s ideas.\n\nHiroshige, on top of my impatience, I think I want so badly to apply timelines (same reason I collect philosophical theories); I just need some quantifiable, pick-apartable explanation for how things do and will work. (There was a while I was thinking about studying psychology, probably because I thought I could find an answer for everything).\n\nTime to let go. Good lesson, in general. And to bring it back around to talent/skill/creativity, I have a feeling this need for a timeline (and similar things) is tying me down. How, exactly, are you supposed to be fully creative if you’re not letting the moment reveal itself?\n\n(Who’s babbling now?)\n\n"
    },
    {
      "time": " 10.Oct.2007 9.30am",
      "content": "John Maeda:  \n“What are the fundamental skills of a designer?”\n\nPaul Rand:  \n“The fundamental skill is talent. Talent is a rare commodity. It’s all intuition. And you can’t teach intuition.”\n\n[http://acg.media.mit.edu/events/rand/ideamag.html](http://web.archive.org/web/20081201170242/http:/acg.media.mit.edu/events/rand/ideamag.html \"http://acg.media.mit.edu/events/rand/ideamag.html\")\n\nMore on intuition and talent:  \n [http://icsid.org/education/education/main/articles183.htm](http://web.archive.org/web/20081201170242/http:/icsid.org/education/education/main/articles183.htm \"http://icsid.org/education/education/main/articles183.htm\")\n\n"
    },
    {
      "time": " 10.Oct.2007 10.31am",
      "content": "All well and good if you’re Paul Rand.\n\nBut for the rest of us... no, we can’t all be Sagmeisters and Schers. But you can learn how to design well, and not every job calls for groundbreaking design skills.\n\nAnother major asset is to bone up on your typesetting/editorial skills. Everyone values a designer who has a very good handle on type.\n\n"
    },
    {
      "time": " 10.Oct.2007 10.44am",
      "content": "I think groundbreaking is generally subjective anyway. It is great to please your peers and be acknowledged in that way, but even more satisfying, for me anyway, to excite a client with an execution.\n\n"
    },
    {
      "time": " 10.Oct.2007 11.21am",
      "content": "_“The fundamental skill is talent. Talent is a rare commodity. It’s all intuition. And you can’t teach intuition.”_\n\nIt may be that intuition cannot be taught (at least not directly), but I’m certain it can be learned, or at least acquired. Intuition is an epiphenomenon of [the right kind of] experience, and _anybody_ can gain experience. The more you master the tools of your trade, the more you analyze and respond to the work of others, the more you practice applying your skills and creativity in interesting new ways, the more you engage in honest self-critique and accept feedback from trusted sources, the more you hone your intuition. It appears to be the case that in any given domain some people hone their intuition more efficiently than others, and for some people the effort required to achieve some desired result may be so monumental that it’s either not possible or not practical. But it would be a mistake to abandon an endeavor just because intuition is required and can’t be taught. Just because it can’t be diagrammed on a chalk board or explained in a lecture doesn’t mean it can’t be obtained.\n\n"
    },
    {
      "time": " 10.Oct.2007 11.41am",
      "content": "_It is great to please your peers and be acknowledged in that way, but even more satisfying, for me anyway, to excite a client with an execution._\n\n[http://www.istockphoto.com/file\\_closeup/?id=2806911&refnum=1431945](http://web.archive.org/web/20081201170242/http:/www.istockphoto.com/file_closeup/?id=2806911&refnum=1431945 \"http://www.istockphoto.com/file\\_closeup/?id=2806911&refnum=1431945\")\n\n(apologies to Miss Tiffany)\n\n"
    },
    {
      "time": " 10.Oct.2007 12.17pm",
      "content": "I’m not sure I get the reference. Are you saying that a designer is going to be hanging themselves if they don’t try to please their peers?\n\n"
    },
    {
      "time": " 10.Oct.2007 1.39pm",
      "content": "_...to excite a client with an execution...  \n...a designer is going to be hanging themselves..._\n\n"
    },
    {
      "time": " 10.Oct.2007 2.16pm",
      "content": "No, it wasn’t meant to say anything about pleasing peers. The photo approximates the mental image that popped into my head as I read the phrase “to excite a client with an execution”. It represents one sort of execution a designer might present to a client :) Not meant to be a reflection on you, just the imagery of a misread phrase.\n\n"
    },
    {
      "time": " 10.Oct.2007 3.14pm",
      "content": "Pfft. Thanks, Nick. ;^D\n\n"
    },
    {
      "time": " 11.Oct.2007 10.57pm",
      "content": "_How, exactly, are you supposed to be fully creative if you’re not letting the moment reveal itself?_\n\nFocus on what is being said. And then strip that down to it’s bare essence. Some call it ’truth’ [Whatever]. Play it from there.\n\nTalent can tell a client to f\\*ck off and Live another day. Skill must kiss ass. That’s the main difference between Talent vs Skill. Skill knows well the art of compromise. Talent can’t even spell compormize.\n\n"
    },
    {
      "time": " 12.Oct.2007 8.37am",
      "content": "<cite>Skill knows well the art of compromise. Talent can’t even spell compormize.</cite>\n\nvery well put.\n\n"
    },
    {
      "time": " 12.Oct.2007 9.51am",
      "content": "I think that is a dangerous way to put it. It is insulting to the skilled and it sheds very negative light on the talented. AND it separates them making it seem as if the talented can’t possess skill and the skilled can’t possess talent. Black and white definitions like that don’t help anyone in life.\n\n"
    },
    {
      "time": " 12.Oct.2007 9.55am",
      "content": "Well, what if it’s true, simply within the context of a sliding scale?\n\nTwo ends of most any scale are opposite, but the elements measured by those scales fall somewhere between the two ends points.\n\nSo, talent isolates itself? But if it’s tempered with skill, it’ll all be good.\n\nNo?\n\n"
    },
    {
      "time": " 12.Oct.2007 10.33am",
      "content": "I’ve worked with some extremely talented designers (and photographers, illustrators, etc) who I will NEVER work with again because they had a “my way or the highway” approach to design. They forget that they are serving a client. I had a designer who refused to take the running head off a chapter opener - which is editorially incorrect as it repeats the chapter title already on the page - because it would have compromised her design. We went back and forth, back and forth, until I finally got her to come up with a different design element to replace it. I never hired her again. She completely wasted my time - and was ironically sharing a studio with another very famous pain-in-the-a\\*\\* designer who I would love to out here but discretion forbids it.\n\nThere is no shortage of talent out there, but if said talent doesn’t come along with skill and resourcefulness - and cooperativeness - then it’s wasted in this field.\n\n"
    },
    {
      "time": " 12.Oct.2007 10.44am",
      "content": "So talent and skill have to be on opposing ends? I guess I could see that but I’ve never thought of them as opposing. I’ve always seen them as two things which can be a part of a great whole.\n\nI think you need to add humility to your list Patty.\n\n"
    },
    {
      "time": " 12.Oct.2007 11.26am",
      "content": "Let’s bring some physics in. Let’s forget about two-dimensional sliding scales. Instead of Point A and Point B creating a straight line, what if it is two ends of a curving path? Maybe spiral shaped; or a parabola; or twisted and crossed like those awareness ribbons.\n\nSo no, not opposite, and elements that exist on that scale are consequently more complex than being defined as “more skilled, less talented” or “more talented, less skilled.”\n\n\\*\\*\\*\n\nBut honestly, I think that the talent/skill/compromise discussion is bringing up interesting points about talent and skill, but perhaps is clinging too tightly to the vocabulary.\n\nThe observation at its root is that creative people who are better in business environments are able to compromise and work well with others.\n\nMaybe people silly with skill are used to finding solutions to problems (myself as an example: one of the things I really like about my job is finding the best and fastest way to format pages. Doesn’t take much talent, but it’s certainly a skill. And it makes me question every step I take. “Is my approach the best approach, or is there one that’s better?”)\n\nAnd now let’s look at pure talent: I always think of it as an outpouring. “Just get it on the page.” The talent itself is not necessarily about process; more about the idea itself. And that’s when you get a running head on a chapter opener that shouldn’t be there.\n\n\\*\\*\n\nI still argue for that 3-dimensional sliding scale.\n\n"
    },
    {
      "time": " 12.Oct.2007 11.42am",
      "content": "Tiff - I guess I’d have included humility as part of cooperativeness, or at least the willingness to work together towards a solution without your ego overwhelming the process. Or without getting way too attached to your initial ideas.\n\nYou can’t be a successful designer without your ego absorbing some major blows.\n\nSo I guess having a thick skin is a valuable asset too.\n\n"
    },
    {
      "time": " 12.Oct.2007 11.49am",
      "content": "Lindsay, I’d say being able to solve a problem quickly is a talent.\n\nPatty, yeah I can see that and agree. Cooperativeness does include humility.\n\nA question to those of you in school still or those who are teaching: Do you feel a good balance of skills being taught or is the focus on a great portfolio to the detriment of those not “naturally” talented?\n\n"
    }
  ]
}
