{
  "id": "37911",
  "title": "please critique my homework. ;)",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I’m new to this graphic design game but not new to type or art. I have switched my major to graphic design from humanities. I have always been fascinated with type and letters (i used to be a graffiti artist) I am trying to built a portfolio so i can transfer to Art Center College of Design.\n\nAnyways this is my first graphic design project. It’s a poster, the subject Orphans.\n\nPlease critique away.. i wont get offended... your observations on my kerning will be definitively appreciated. i don’t know if i messed up on the kerning since Gill Sans has a big range in between letters and i’ve done the opposite.\n\n[http://img507.imageshack.us/img507/3701/picture1go3.png](http://web.archive.org/web/20071016210638/http:/img507.imageshack.us/img507/3701/picture1go3.png \"http://img507.imageshack.us/img507/3701/picture1go3.png\")\n\n [‹ critique my cv plz.](http://web.archive.org/web/20071016210638/http:/typophile.com/node/37876 \"Go to previous forum topic\") [critique my flyer ›](http://web.archive.org/web/20071016210638/http:/typophile.com/node/37938 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071016210638/http://typophile.com/user/22418\" title=\"View user profile.\">mandatorycannibalism</a>",
  "time": "<br>",
  "uid": "22418",
  "comments": [
    {
      "time": " 8.Oct.2007 11.53pm",
      "content": "hmmm...Since there is nothing much you have done in the layout other that just a statement, one can only look at the text kerning which is not kerned or spaced properly.  \nAnd I think kerning like in ’WA’ looks good only with Avant Garde.\n\nWhy don’t you simply use Helvetica\\_?\n\n ![](http://web.archive.org/web/20071016210638im_/http:/typophile.com/files/xa_5174.jpg)\n\n"
    },
    {
      "time": " 9.Oct.2007 12.40am",
      "content": "I think choosing the mines sign confuses the message (or the message confuses the image), I would have thought that a line like ‘Orphans are created long after the war is over’ might work for this image or an alternative image might support your image better. As it stands you are right to be concerned about the kerning the point of kerning is not to create a mathematically equal space between characters rather to create an equal _visual_ space. One method is to print out your type (in black on white so there is no interference from the image) and view it upsidedown and squint at it –&nbsp;this should reveal where there are darker or lighter areas which you can adjust indivdually until there are fewer obvious areas, however the point is not to upset the readability of the pairs of characters so one has to accept that some characters are not going to accept this treatment, the position of the comma is much too tight to N once you have amended this you should look at aligning the other characters on the right of the N (again visually rather than mathematically) so curved letters (S,D,R) will slightly extend beyond the line created by the more vertical characters.\n\nTim\n\n"
    },
    {
      "time": " 9.Oct.2007 1.39pm",
      "content": "thank you so much.. you guys have been alot of help. noticed alot that i didnt notice by myself.  \nhow about on the layout..\n\nyou cant see it in the picture but the picture will be centered with a big bold margin (2 inches) around it\n\nthank you so much.\n\n"
    },
    {
      "time": " 11.Oct.2007 12.52am",
      "content": "Are you using optical alignment? It looks you are, but with the wrong text size specification.\n\nAnd you should seriously consider adding a discreet drop shadow to the text.\n\n"
    }
  ]
}
