{
  "id": "37920",
  "title": "Intensely bored with my job",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So, some advice here from all you lovely people, please?\n\nI work for an American company, in an overseas office (Israel).\n\nThis is important because:  \n\\* I’m really only fluent enough for professional work in English (I’m American).  \n\\* Salaries here tend to be extremely low, unless you work remotely for a foreign company (which I am already doing).\n\nThe company I work for is a commercial furniture seller, and I do the most basic work for their website graphics. I was working on some more fun design projects for their website redesign but then they got annoyed that I wouldn’t move to NJ, where they’re based, and told me I could only do the boring stuff.\n\nHow can I find a really enjoyable and challenging job that will let me telecommute, and which will pay a reasonable rate ($25 per hour or more)?\n\nI’m quite a decent designer although I haven’t worked for any really large companies. I have a BA in graphic design and would love to continue my education (when I can afford it!). I have been working in graphic design on and off for about ten years, and working for my current company for a little over 1 year. I would like to be doing illustration, original logo design, advertising work, or anything that’s a LITTLE more interesting than cropping pictures of office chairs (augh). I’m proficient in Adobe Illustrator, Photoshop, InDesign, Quark and several other programs.\n\nAny ideas, folks? I haven’t been able to find anything in the papers or on websites for this area, but maybe I haven’t been looking in the right places.\n\nThanks!!! :)\n\n [‹ Alphabelt by chance](http://web.archive.org/web/20071121013733/http:/www.typophile.com/node/37840 \"Go to previous forum topic\") [HELP Comic Sans Crisis ›](http://web.archive.org/web/20071121013733/http:/www.typophile.com/node/37791 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071121013733/http://www.typophile.com/user/22592\" title=\"View user profile.\">wild_kerning</a>",
  "time": "<br>",
  "uid": "22592",
  "comments": [
    {
      "time": " 9.Oct.2007 7.32am",
      "content": "Anywhere is everywhere. \\<3\n\n"
    },
    {
      "time": " 9.Oct.2007 9.14am",
      "content": "Well, _sometimes_ you can find telecommuting opportunities on [craigslist](http://web.archive.org/web/20071121013733/http:/www.craigslist.org/), and it even lets you search for those exclusively, but do be careful of potential scams, frauds, etc.\n\nSurely there is an American expatriate community in the city where you live... That might be a good place to look for work opportunities. (And don’t just stick to Americans... Any English-speaking expats will do!)\n\n"
    },
    {
      "time": " 9.Oct.2007 9.19am",
      "content": "You’re in the middle east already...if money is an issue, send your resume over to BlackWater and Haliburton. ;0)\n\nOtherwise, check out the 27sig job boards. Mostly web related, but there’s often grpahic design gigs as well.\n\nA lot of the companies that post seem quite fine with telecommuting:\n\n[http://jobs.37signals.com/jobs/](http://web.archive.org/web/20071121013733/http:/jobs.37signals.com/jobs/ \"http://jobs.37signals.com/jobs/\")  \n [http://gigs.37signals.com/](http://web.archive.org/web/20071121013733/http:/gigs.37signals.com/ \"http://gigs.37signals.com/\")\n\n"
    }
  ]
}
