{
  "id": "3794",
  "title": "Fadher Sans",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello, I am sending you a typeface (unnamed so far) that I have designed. It is the first time I undergo a project such as this and I am overall quite inexperienced in the field of typeface design. Because of this, I would greatly appreciate any comments you may have; from the simplest details to the most advanced observations - all will be of great value to me at this point.   \n  \nMy intention is for this to be a modern style font, corresponding to a Demi version. I am not sure I will ever create it\n\n",
  "author": "mnieva",
  "time": "25 Mar 2004 — 10:33am",
  "uid": "3242",
  "comments": [
    {
      "time": "25 Mar 2004 — 11:42am",
      "content": "I think this is pretty charming - it would be a bit clich\n\n"
    },
    {
      "time": "25 Mar 2004 — 6:48pm",
      "content": "This is lovely. One thing: Your X and x have the top-heavy illusion. Move the two strokes so that they cross at the visual center which is slightly above center, making the top ends somewhat closer than the bottom ends. You may be able to leave the capital X as it is, but for the lowercase x it needs doing.\n\n"
    },
    {
      "time": "29 Mar 2004 — 6:34am",
      "content": "Thanks to both of you for your comments.   \n  \nHHP, I still can\n\n"
    },
    {
      "time": "29 Mar 2004 — 9:16am",
      "content": "Set the word \"CANOE\" for example and see how the \"A\" will jump out (it's too dark).   \n   \nhhp\n\n"
    },
    {
      "time": "31 Mar 2004 — 7:30am",
      "content": "Ok, here is a new version based on HHP\n\n"
    },
    {
      "time": "25 Mar 2005 — 11:32am",
      "content": "See the little wiggle in the top of the a & the bottom of the e & g? What about putting that on the top of the s, the & z, 2 & 4? Also the crossbar of the E. I would like to see the 3 with a curve on the bottom - it might look sweeter. The cap J really bugs me. It looks comic book like where the rest of the glyphs are maybe a combination of routed-out desk nameplate & something arts & crafts... What about making the bottom of the 3 end abruptly?\n\n"
    }
  ]
}
