{
  "id": "37944",
  "title": "Allow a non-breaking space to stretched in justified paragraph",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anyone knows if there is a way to allow a non-breaking space to stretch, so it fit the width of a normal space that is on the same line in a justified paragraph in InDesign?\n\n [‹ garment, shoemaking & knitting software](http://web.archive.org/web/20081023162043/http:/typophile.com/node/38468 \"Go to previous forum topic\") [Display, Caption & Subheading Explanation? ›](http://web.archive.org/web/20081023162043/http:/typophile.com/node/38440 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081023162043/http://typophile.com/user/16659\" title=\"View user profile.\">Raphael Daudelin</a>",
  "time": "<br>",
  "uid": "16659",
  "comments": [
    {
      "time": " 10.Oct.2007 5.32am",
      "content": "Instead of using the Type \\> Insert White Space \\> Nonbreaking Space character, highlight a regular space and apply “No Break” from the flyout menu of the Character palette (or flyout menu from Control panel when in Character mode).\n\n— K.\n\n"
    },
    {
      "time": " 10.Oct.2007 11.01am",
      "content": "In InDesign CS 3 we added support for a character to represent non-stretching non-breaking spaces because the original implementation (non-breaking spaces don’t stretch) was incorrect. The option is in the same Type \\> menu:  \n \\* Non-breaking space - u00A0 (NO-BREAK SPACE)  \n \\* Non-breaking, non-stretching space - u202F (NARROW NO-BREAK SPACE)  \nWe didn’t strecth u00A0 in the beginning because the work-around that Kent describes was considered workable. However, especially in the Czech & Polish market, this method of applying the no-break attribute didn’t fit well into the workflow of importing external documents because around 10-20% of the spaces needed to be this type. The CE version of InDesign had changed the non-breaking space (u00A0) behavior for these languages.  \nWhen converting an earlier document we replace u00A0 with u202F to preserve the original behavior.\n\n"
    },
    {
      "time": " 10.Oct.2007 3.36pm",
      "content": "Great news!\n\n"
    },
    {
      "time": " 25.Oct.2007 9.26pm",
      "content": "Thanks a lot\n\n"
    }
  ]
}
