{
  "id": "37945",
  "title": "Customized versions of famous fonts",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I'm working on a thing for IBM right now, and I just started thinking about their fonts. They have customized Helvetica Neue fonts, like \"IBM Helvetica Neue Black\". How does that work license-wise? I doubt they just made a rip-off and renamed it, to avoid licensing fees.\n\nDo any of you experts here know anything about this kind of stuff? I'm interested because I myself might someday like to do somehing similar.\n\n",
  "author": "Raumschiff",
  "time": "10 Oct 2007 — 12:23am",
  "uid": "22633",
  "comments": [
    {
      "time": "10 Oct 2007 — 6:01am",
      "content": "Well, I'm no expert, but my assumption is that they had to talk to Linotype (whom I believe owns the rights to Helvetica Neue) to get permission to customize and modify the typeface. Most standard [EULA](http://web.archive.org/web/20131013115239/http:/typophile.com/wiki/EULA)s have a clause prohibiting modifying, renaming, etc., unless express permission is given, so they probably had to work out some deal (which I'm sure wasn't a big deal money-wise for a company like IBM).\n\nUnfortunately, though, renaming/modifying type without permission is not as uncommon as you'd like to think, even for big companies. I've seen a few such cases here on Typophile if memory serves, with the most famous recent case being the one [here](http://web.archive.org/web/20131013115239/http:/www.typophile.com/node/17362) and [here](http://web.archive.org/web/20131013115239/http:/www.typophile.com/node/14517).\n\n"
    },
    {
      "time": "10 Oct 2007 — 8:43am",
      "content": "I've seen a few fonts modified for educational publishers to include D'Nealian letterforms. The new characters in some were quite ghastly.\n\n"
    },
    {
      "time": "10 Oct 2007 — 11:32am",
      "content": "If the derivative font contains the trademarked name of the original, in this case Helvetica, you can be pretty confident that it's licensed, especially when someone like IBM is involved. Check the (c) and TM strings in the font for confirmation. Another similar examples would be Apple Myriad, used under license from Adobe. However in some cases lack of the original TM name may not mean it's a knock off - for example FF Transit is derived from Frutiger under license.\n\n"
    },
    {
      "time": "11 Oct 2007 — 12:46am",
      "content": "Thanks a billion auricfuzz and Ehague.\n\n"
    },
    {
      "time": "11 Oct 2007 — 12:46am",
      "content": "Oh, and of course sii.\n\n"
    }
  ]
}
