{
  "id": "37977",
  "title": "Be Gentle: Brutale",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is my first attempt at anything resembling a typeface / font. This is a result of a few (5-6) hours work over the weekend in an attempt to kill some down time.\n\nThis is still in the very early stages, and I am annoyed by all the details I am seeing that I failed to address before posting this image.However, I thought this would be a good time to get some feedback and advice on what to avoid going forward from this point, as well as what you feel works well in the current image.\n\nThe featured Super Duty typeface was my inspiration to really start playing around with a bold and heavy display face. My concept is a symmetrical and powerful type, built around a single squared form. Ideally, each of these letters would use only those few simple shapes, and all would contain the same amount of area... optically at least.\n\nEnough of that. Here is what you see below:\n\nFirst Line: My initial hashing out of the concept\n\nSecond + partial third line: I revisited this a day later, and decided that I wanted a lot more weight and emphasis, thus the much heavier treatment. Also, I set the name of the type in cyan: BRUTALE\n\nFourth Line: My last name (maurer) set and scaled up just to see how it went...\n\nThat is about it, let me know what you think.\n\n",
  "author": "bamaurer",
  "time": "10 Oct 2007 — 7:21pm",
  "uid": "13776",
  "comments": [
    {
      "time": "10 Oct 2007 — 8:37pm",
      "content": "p.s. don't knock the letterspacing, it is all on a grid right now, i suppose i should have addressed that before throwing this up,but truly infant stages, just hoping for some initial responses\"\n\n"
    },
    {
      "time": "10 Oct 2007 — 7:40pm",
      "content": " ![](http://web.archive.org/web/20150417044821im_/http:/typophile.com/files/brutale_3752.gif)\n\n"
    },
    {
      "time": "10 Oct 2007 — 8:43pm",
      "content": "This is really excellent. It's very modern and flowing and at the same time heavy and reminiscent of fonts from the '30s.\n\nI prefer the f,g,h, and m from the lighter, first version. The descender on the f and g convey a lot of personality, as do the chopped stems on h and m. I also prefer the a & c in the heavier, second version. I think the heavier weight works much better, so I'd say take the f,g,h, and m from the light version and make heavy variants of them.\n\nThe k is fantastic, but it might be too radical to be readable. I'd like to see some text to see how distinguishable the k is from h, in context.\n\nThe s doesn't work, it's too curvy and the separated top makes it look like it's been misplaced from a disco typeface from the '70s.\n\nThe x is going to be hard... take a cue from your k. And you should think about the s and the z at the same time.\n\nYou may have two faces here; a more-readable text face and a more-radical headline or alternates face. And whatever you do, it should be available in both weights.\n\nKeep working on this. I look forward to seeing a more complete version. :)\n\n"
    },
    {
      "time": "10 Oct 2007 — 9:08pm",
      "content": "To quote a friend who isn't overly effusive, \"It doesn't suck\". Keep up the good work!  \n; )\n\n"
    },
    {
      "time": "10 Oct 2007 — 10:54pm",
      "content": "Great feedback glyphabet, I am defintely planning on developing a few alternate characters for situations like the \"k\" in this image. I too, fear the \"X.\"\n\nYou gave some very good feedback and insights, and I will definitely try to take your comments into account and be sure to consider each of them as I move forward with this pile.\n\nFontplaya, what can I say? I am glad it doesn't suck.\n\n"
    },
    {
      "time": "11 Oct 2007 — 4:54am",
      "content": "i like the notion. these chunky monostrokes are a fun reductive process, and this paticualr shape vocabulary has a real \"means business\" tone to it. reminds me of some early eighties faces.\n\nwatch your horizontal strokes. they look markedly thicker than the verticals at the moment. nature of the beast; you'll have to actually make them thinner when you get a little further from your grid. when i'm doing faces like this, my general process is to do a first version which is strictly on the grid, then a second which \"warms up\" the forms with some optical correction -- things like narrowed horizontal strokes, narrowing of spaces where corners and diagonals meet.\n\nso, i think your s as it stands now is out of line with the rest of the face. it's the one piece which has any indication of a calligraphic strike -- i'm talking about the rounded terminals which indicate stroke direction. you should probably either do another version which carries that idea forward, but it'll probably be a challenge to do so without looking like something from the nineties.\n\n"
    },
    {
      "time": "11 Oct 2007 — 5:55am",
      "content": "I noticed that too Patricking (about the horizontals vs verticals), and am looking forward to getting to that point when I can make the transition from working out the basic structure to adding a bit more style / balance to the set on a whole.\n\nI fear the X since I have not looked at it yet, and fear the S because I have! I need to spend a lot of time on that one yet and agree it is wholly out of place.\n\n"
    },
    {
      "time": "11 Oct 2007 — 7:48am",
      "content": "that S is a really good idea. i do think you have two faces here.\n\n"
    },
    {
      "time": "11 Oct 2007 — 8:20am",
      "content": "My creative director had the same thoughts actually: he recommending pursuing the \"S\" style as it was a bit more unique, and perhaps a bit less dated than the rest of the play here.\n\n"
    },
    {
      "time": "11 Oct 2007 — 12:54pm",
      "content": "i think you should do both of them. the S is actually the more played out of the two gestures at the moment; the nineties had half-lozenge caps all over the place. i am now peering down my nose at your CD's notions of contemporary.\n\n"
    },
    {
      "time": "11 Oct 2007 — 2:20pm",
      "content": "I agree with the others -- a lot of interesting things going on in here. I can easily see this being used on CD covers and concert posters. It's very 2000's. The \"s\" seems very 90s to me, and doesn't fit with the rest. The K, while interesting, I think is just so unusual you're going to lose everyone trying to read it.\n\nI do prefer the bolder version since it has the extra shapes that make it dramatically more readable (the \"e\" has the clearest difference for such a minor change in shape) but of course the lighter one seems to be more the \"seed\" of the idea.\n\n"
    },
    {
      "time": "11 Oct 2007 — 2:45pm",
      "content": "The S style is probably my least favorite of the two, although I think it is pretty interesting, I feel like it is a bit too floral for my tastes, and also that it's possible usages would be far more limited that the main focus in this image.\n\nMerriam, I hear you on the \"k,\" I think I would like to keep it and make it an alternate though, it is one of those things like the Conduit Bold Italic E, that just screams look at me and proves to be distracting, but that I still really dig.\n\nAll your input has been great, I am looking forward to refinining this further and seeing if you guys think took it right or wrong.\n\n"
    },
    {
      "time": "11 Oct 2007 — 4:05pm",
      "content": "yeah, i was going to say as well, i think the S is more nineties than naughties (and by extension, i am suspicious of your CD's taste level). i don't think it's bad, but i swear to god, we had truncated lozenges EVERYWHERE from 1992 to 1998. it was the ravers' faults. i like the chunky forms better.\n\n"
    },
    {
      "time": "11 Oct 2007 — 4:54pm",
      "content": "Ha, Patrick, I should defend the CD here. I don't think that his sentiments were quite as strong as you think. I think what he actually expressed was that it did seem like something from the eighties and nineties... which is not necessarily a bad thing. He thought the s may be able to lead to a type that was a bit more unique.\n\nI would not question his taste, it is quite good, and usually better than mine – otherwise, I would not dream of working under him. It was definitely some pretty rapid fire feedback, and those sentiments were in the midst of congratulating me on my ambition to pursue anything of this nature – although, I did let him know that it was done more out of boredom over the weekend than ambition!\n\nYa... those damn ravers ruined everything.\n\n"
    },
    {
      "time": "12 Oct 2007 — 4:27am",
      "content": "i stand corrected, then.\n\n"
    },
    {
      "time": "12 Oct 2007 — 6:41am",
      "content": "perhaps, your criticisms + post are much appreciated though! I was afraid I would get no responses – 14 ain't bad, some of which was good solid feedback. I will be in back with something better I hope.\n\n"
    },
    {
      "time": "12 Oct 2007 — 10:00am",
      "content": "Just some ideas\n\n- What if the right side of the m wasn't rounded? It might fit with the others better.  \n- What if the down turned line at the top of the e turned again to the inside slightly. I know it breaks an implicet rule but maybe it would read better.  \n- I think some judicious use of diagolals could enliven the face and help to solve for y z & x.  \n- What about crossing the t on only the right side & extending the lines further to make the glyph match the others a bit more closely?  \n- What about curving the upper right corner of the q?  \n- What about a hard corner in the w?\n\n"
    },
    {
      "time": "12 Oct 2007 — 10:19am",
      "content": "Hey Eben,\n\nYup, I had thought about that on the M and W as well, it would make much more sense. In the same vein, I thought flipping the c or g so that they rounded on alternate edges and carrying that throughout would make this more consistent as well.\n\nWe will see on the diagonal, I would prefer not to, but if it is necessary may be a way to go. I definitely need to refine most of my horizontals vs verticals right now, and actually the T as it is now sticks in my craw so to speak.\n\nAll good comments, and all definitely tie in to the style more than the set right now. I think you will see that some of those decisions were played iwth in the light form above. (i.e. the C vs the G, as well as the M) I will be going back to the proper reasoning, think i was rushing the bolder because I was digging it, and did not apply as much reason as I should of.\n\nThanks for the thoughts though, definitely in line with the face on most your points i think.\n\n"
    },
    {
      "time": "12 Oct 2007 — 10:56am",
      "content": "I am glad the ideas seem helpful to you for the most part.\n\nThe other thing that occurs to me is that you may want to offer alternative forms. The basic set might be more radical. And the alternatives could be a way of making a word more readable. Or the reverse.\n\nIf you have just two versions you might put one kind in the lowercase & the other in the upper. Or if you can make Opentype you could have 3 or more alternative forms that are selectable by the user.\n\nThe other thing is that if you start to feel beaten on the z for instance don't forget that this is really really well trodden territory design-wise. Many many people have made faces like this! So you may want to go look at Bauhaus stuff, Weiner Werkstatte, and the various forms invented by designers and ravers from the 80's forward.\n\nsee also\n\n[http://www.t26.com/fonts/style/Techno?page=4](http://web.archive.org/web/20150417044821/http:/www.t26.com/fonts/style/Techno?page=4 \"http://www.t26.com/fonts/style/Techno?page=4\")  \n [http://www.youworkforthem.com/list.php?cat=46](http://web.archive.org/web/20150417044821/http:/www.youworkforthem.com/list.php?cat=46 \"http://www.youworkforthem.com/list.php?cat=46\")\n\nThere is is something I like here so please take all this background as encouragement.\n\n"
    },
    {
      "time": "12 Oct 2007 — 11:32am",
      "content": "The k is fascinating, because I find it fully legible, but when I actually examine it I can't figure out why. Your q, however, can be mistaken for a g, so that needs to change somehow.\n\nFor z, I suggest the descending form; you won't need a diagonal for that. For x, well, I don't know.\n\n"
    },
    {
      "time": "12 Oct 2007 — 12:12pm",
      "content": "Kevin is that a black letter form on the z? Will you post an image?\n\nAlso you may be able to suggest a diagonal with a curve maybe.\n\nAn o with a line pulled staright down could be a q as well.\n\n"
    },
    {
      "time": "12 Oct 2007 — 2:08pm",
      "content": "the k trips me out as well, i was like... no, could this work? I think it does in this context, however I think if it was not set in the middle of an alphabet, it would be lost completely. Planning this letterform to be an alt for another type of k if possible.\n\nZ... X... Y... sigh, well, it is the weekend, so game on, I am hoping to post a revised type –&nbsp;both thin and bold, and perhaps soemthing built around that S by the end of the weekend, so all of you please stay tuned, I love the feedback from this forum.\n\n"
    },
    {
      "time": "13 Oct 2007 — 7:57am",
      "content": "I really enjoy it. I definitely agree that the 's' is out of place. Perhaps you can further develop all of the glyphs to move into something that ends up being a happy in-between. More specifically, something that is still chunky but also has a little bit of the elegance of that 's'.\n\n"
    }
  ]
}
