{
  "id": "3797",
  "title": "Janiszewski Disqualified",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I was surprised to see [this notice](http://web.archive.org/web/20131013030635/http:/www.textmatters.com/cgi-bin/atypi/news/newsindex.pl?id=159) from the bukva:raz! chairman. Particularly because [Janiszewski](http://web.archive.org/web/20131013030635/http:/lalaiterie.free.fr/) seems to be an experienced designer with pretty good work at T26, Bitstream, PsyOps and ITC. Why enter a design derivative of Stone Sans to the competition? Are we missing some of the story?\n\n",
  "author": "Stephen Coles",
  "time": "28 Oct 2002 — 1:09am",
  "uid": "103",
  "comments": [
    {
      "time": "28 Oct 2002 — 5:26am",
      "content": "Does anybody has a picture of Frothy?   \nI am interested in comparing both designs.\n\n"
    },
    {
      "time": "28 Oct 2002 — 8:04am",
      "content": "Here's a scan from the LCT book:   \n [http://www.themicrofoundry.com/other/frothy.gif](http://web.archive.org/web/20131013030635/http:/www.themicrofoundry.com/other/frothy.gif)   \n   \nI have no comment on either the fact that it initially won an award nor that it was subsequently disqualified...   \n   \nBut what I think would be interesting to learn is \\*how\\* it was disqualified, I mean the mechanics of it. I think somebody (Devroye?) should do some investigation, not least by getting Janiszewski's side of the story. I'll refrain from speculating on what actually happened here.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Oct 2002 — 12:40pm",
      "content": "\\> Since these last six years I have tried to develop my own\n\n"
    },
    {
      "time": "22 Nov 2002 — 10:19am",
      "content": "I'm going to make a lot of people angry here. I've raised this point in other forums, and caused feeding frenzies among typographic moralists.   \n   \nWhat is so bad about working from someone elses' work? Why are we so protective of our territory? Why is it OK to work from dead people's work?   \n   \nType design is an iterative process that builds on and interperets other peoples' work. Why slow the iterations to a minimum of 70 years? I have often modified other people's fonts for various projects. What is so villianous about making it into a font? The new font could be iterated in the same way, and the community would be enriched.   \n   \nIn reality I know what the answer is. There are two motivations that are almost universal. Money and recognition. I am questioning the value of those motivations.   \n   \nI am proposing that the value of the aestetics, diversity and flavor in the community are more valuable. Why shouldn't there be 5000 variations of Helvetica, some wonderful and some awful? Why shouldn't type have individual flavor?   \n   \nI have been a fan folk music for a long time. The value of folk music (real folk music, the stuff done by people the don't own copyrights) is that it is shared. No one person is responsible for the flavor and the beauty. The songs are passed around, and everyone takes them and makes them their own.   \n   \nWhat if students everywhere were encouraged to take the oulines of type faces and modify them? It's true that the font landfills would pile up, but typographic flowers would rise from the compost and work their way into common usage, to then be recycled and grow new faces.   \n   \nObviously, some faces have more value than others. Cheap copies are not valuable. Inteligent iteration is. The conversation here should be whether frothy has value, not whether it was derived from a living designers' font.\n\n"
    },
    {
      "time": "22 Nov 2002 — 10:36am",
      "content": "Nice post, Christian. I've asked many of the same   \nquestions - and received very few answers...   \n   \nSee the topic at the [AIGA forum](http://web.archive.org/web/20131013030635/http:/designforum.aiga.org/content.cfm?ContentAlias=%5FMessageView%5F&mid=%23%2DC6T%0A).\n\n"
    },
    {
      "time": "22 Nov 2002 — 10:38am",
      "content": "For those who missed it, the third installment of the Parkinson/Downer interview at Phil's Fonts lends insight into the Janiszewski disqualification.   \n   \nDowner:   \n\\> I actually take enormous pride in tracking down offenders. Theft is unacceptable. I am firm in this belief. Yet, as unacceptable as font theft is, it is doubly unacceptable when it's committed by a person who knows better. Type designers know that font theft is reprehensible, so any type designer who steals from another stoops as low as a type designer can stoop. There is simply nobody lower to be found in the craft of type design.   \n   \n\\>I don't know of a case in which a highly accomplished and widely-respected type designer has stolen a digital font from a colleague, but I know of several cases in which an inferior type designer, whose faces are only second-rate at best, has been in possession of fonts that were obtained illicitly.   \n   \n\\>I do not regard type thieves as colleagues or brethren. They are not peers. They are parasites.   \n   \nthe other parts of the interview are fascinating, too, with bonus insight into the world of water polo.   \n   \nbj :]\n\n"
    },
    {
      "time": "23 Nov 2002 — 10:00am",
      "content": "Christian --   \n   \nFor me there is a moral difference between work that is based on or inspired by another's and work which is built directly upon another's.   \n   \nIt's one thing to get a bunch of friends together and jam out a Pete Seeger tune, but it's another thing altogether to take a recording of Pete Seeger's, scrub out the vocal track, and lay your own over the accompaniment. And I don't just mean legally, copyright-wise. I mean creatively -- and perhaps even morally (depending upon what you do with the subsequent recording).   \n   \nIn the same way, it's one thing to create an alphabet design which is inspired by, or even based on, the general shapes of Stone Sans, for instance. But it's another thing altogether to open up the outlines and crank them through a filter or two, move a couple of points, or whatever.   \n   \n(Don't get me wrong, I bear no ill-will toward Janiszewski; I accept his explanation and respect his apology. I still don't understand what the Bukva:raz jury was thinking, however, regardless of whether they recognized the origins or not.)   \n   \nThere are a lot of things that are shared in type design -- there are at least 26 of them, plus numerals, punctuation, etc. There's no copyright on the way letters are stressed, on how serifs are formed, on a single-story 'g' or a two-story 'g'. Those are the melodies -- now go play them your own way. Claude Garamond sang 'em one way, Baskerville sang 'em another, Matthew Carter sings 'em his own way.   \n   \nIf you want to play a Pete Seeger tune, you look at the notes and you play them your way. Maybe you aspire to play like Pete Seeger so you listen real close to his recording, over and over, and you pick out the banjo solo for yourself until you feel like you got it -- fine. But Pete Seeger is Pete Seeger; who are you? Put yourself back into it. Make it your own.   \n   \nDon't take the Seeger recording, pass it through a midi converter, load it into your computer, and start tweaking it digitally, and then use the output to control your midi banjo or whatever. What's the point of that?   \n   \nSo, if you're inspired by Carter's Miller, for instance, and you want to create your own Miller-inspired alphabet, then sit down and draw your own. Sure, look at Miller real close, over and over, until you think you got Miller in your blood. But then draw your own interpretation of the tune, put your whole self into it, make it your very own. What are your own thoughts about Scotch moderns? What do _you_ think about how an 'a' should look, how it should work? How do _you_ think the leg of a modern 'R' should be formed?   \n   \nDon't just scan in a specimen and autotrace it. Don't just open the font in Fog and start pushing points around. Where's that going to get you?   \n   \nAgain, I'm not really talking about mere legality, I'm talking about true creativity.   \n   \nThere's a moral and creative difference between Copying and Interpreting. Sometimes the line between the two may seem hard to distinguish, but it's there; and you've got to find it. True progress in any craft comes through reinterpreting, not copying. You've got to modify the _idea_ behind the thing, not the thing itself.   \n   \n-- K.   \n   \nP.S. When I say \"you,\" I don't necessarily mean you specifically, of course; I mean all of us in general.\n\n"
    },
    {
      "time": "23 Nov 2002 — 7:36pm",
      "content": "\\>Cheap copies are not valuable. Inteligent iteration is.   \n   \nthat's the essence of what christian is saying. i think. the difference between drawing replicas of an existing font with a pencil and drawing them with a computer are merely technological. one person's recreation or reinterpretation of a font can be as valuable and individual as the original. if carol twombly can \"revive\" an old face, why can't i \"revive\" hers without getting sued? i think people should get credit, money, and whatever else from the work they do, no matter what it is, but i also think some information should remain free. that little opinion still needs to be fleshed out, so don't ask me what it means. anyway, i think i understand what christian is saying, and i agree. i don't think he's talking about theft, like those guys who make those discount font discs for 12 dollars. i think he's talking about legit creativity and new ideas coming from old ones. remember that song that came out in 98 or 99... symphony of life or something. anyway, they had sampled the rolling stones' ruby tuesday for the song. you could have fooled me. it sounded like a new song to me. on the other hand, puff daddy, or pee diddy or whatever, took a led zeppelin song and just went \"uh, uh\" over the top of it. the idea behind both songs is essentialy the same: take part of an old song and make a new one. the difference is that the good song made the element it's own, and the bad song's element happened to be the entire song (man, puff daddy sucks). so while i agree that type designers have the right to profit from their work (zuzana licko would be a billionaire if everyone came clean), i think the line that divides inspiration from imitation is too fine too draw. isn't mrs. eaves based on something? isn't helvetica?\n\n"
    },
    {
      "time": "23 Nov 2002 — 7:38pm",
      "content": "and if i remember correctly, the stones made a ton of money from that song, the band that used the sample didn't. take that for what it's worth. (what was that band? the verve or something like that?)\n\n"
    },
    {
      "time": "24 Nov 2002 — 7:03am",
      "content": "_\\>difference between drawing replicas of an existing font with a pencil and drawing them with a computer are merely technological._   \n   \nYes, it is. The point is to not make replicas. Make something original. Maybe it's based on something that went before (honestly, what isn't?) but the goal is to make something new and different, not a replica.   \n   \n_\\>if carol twombly can \"revive\" an old face, why can't i \"revive\" hers without getting sued?_   \n   \nTwombly could revive the capitals from the Trajan column because they were essentially dead and didn't exist in any useable form. The typeface Trajan isn't the same thing as the stonecut letters from the column; they're _based_ on those letterforms. Look closely: they're really not the same. They're her interpretation of those letterforms in a modern, digital idiom. You can't revive her typeface because it isn't dead. But you can make your own interpretation of the classic roman capitals. Designers have been interpreting those forms forever. Go ahead, look at the original inscriptional letters, look at Twombly's interpretation, look at Goudy's, look at Catich's. Then draw your own. You can't be sued for that.   \n   \nJust don't open up the Trajan font in Fog and start from there. Because you can get sued for that.   \n   \n_\\>i think people should get credit, money, and whatever else from the work they do, no matter what it is, but i also think some information should remain free._   \n   \nThat is precisely the intention behind the idea of copyright. (The implementation into laws is not always perfect, but the intention is sound.) The point is to secure to a creator for a limited time the rights and opportunities to benefit from their hard work and creativity. And a key concept of copyright is that **ideas cannot be owned** , just the actual manifestation of ideas as things. **Ideas are free.** But creations aren't. At least not for a while. The duration is finite, though (despite how Disney would like it otherwise). After a while even the thing becomes public domain -- the invention, the poem, the artwork, whatever. After the creator has had the opportunity to benefit from his creativity (usually after he's dead and his kids are grown up -- that's where the 75 years comes from) then we can do what we want with it, basically.   \n   \n_\\>i think he's talking about legit creativity and new ideas coming from old ones._   \n   \nHey, I'm right with you guys on this. The problem with the current litigious climate is that everyone has become confused about what's okay and what isn't. There's nothing wrong with creating new ideas out of old ones (or even yesterday's leftover ones). Just make sure you're building on ideas, not things.   \n   \nWe all stand on the shoulders of giants; just don't cut them off at the knees to do it.   \n   \n_\\>i think the line that divides inspiration from imitation is too fine too draw._   \n   \nIt may be a fine line, it may even be a sketchy line, but it's a sad day when we don't bother to draw it. You have to keep looking for it. A lot of times, the difference is like that definition of pornography -- you know it when you see it. You've got to be able to feel the difference between inspiration and imitation in your gut. And to do that, you have to keep recalibrating your moral compass. That's why I appreciate this conversation and the questioning. That's how we discover where the line is.   \n   \n_\\>isn't mrs. eaves based on something? isn't helvetica?_   \n   \nMrs. Eaves is based on the idea of Baskerville. If you compare the two, the debt of inspiration is obvious. But it's equally obvious that Zuzana didn't copy or imitate Baskerville. She internalized the idea of Baskerville, she added her own ideas, she even contradicted Baskerville, and she came up with something that was rather unique -- despite the fact that she calls it a \"revival.\" And actually, she's right: a true revival isn't a copy, or even a translation (which is what some so-called revivals are). A good _revival_ actually breathes new life into an idea, brings something new to the table.   \n   \nSo, if you find an idea that you like and you think you might be able to build on it, then go for it. But you should be sure to bring something new to the table. Otherwise you're not building, you're just rehashing.   \n   \n(BTW, Helvetica was based on Akzidenz Grotesque. But I have no idea \\*what\\* Meidinger could have been thinking. ;-)   \n   \n-- K.\n\n"
    },
    {
      "time": "24 Nov 2002 — 8:15am",
      "content": "\\>isn't mrs. eaves based on something? isn't helvetica?   \n   \nrhetorical question.   \n   \ni think we're all in basic agreement. straight up copying is for chickens. maybe the key thing is who profits from what. for example, if someone does some wacky thing with helvetica, maybe it should be given away rather than sold. that way no one is making money from another's work.   \n   \ni agree that we should draw the line, i just don't know who should be drawing it.   \n   \ndidn't twombly also do a baskerville or caslon? i think it was caslon. trajan was definitely dead, but caslon? i'm sure her caslon wasn't exactly the same as the original she worked from, but how original can it be and still be caslon? it seems like i'm picking on her, but i'm not. where did she draw the line? ms. twombly, if you're out there, clue me in.\n\n"
    },
    {
      "time": "24 Nov 2002 — 12:18pm",
      "content": "\\> zuzana licko would be a billionaire if everyone came clean   \n   \nAlthough I think Licko deserves a lot more cash then she's getting, this is a myth: if you were somehow able to prevent people from using illegal fonts, your sales would go up only modestly; most people would simply not use the stuff.   \n   \n\\> You can't revive her typeface because it isn't dead.   \n   \nBut isn't the requirement of death too limiting? I mean, is it healthy to encourage people to circle around their pray like vultures, waiting for them to keel over?   \n   \n\\> A good revival actually breathes new life into an idea   \n   \nWhat a wonderful expression!   \nBut revivals on the high creative level of Mrs Eaves are extremely rare.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Nov 2002 — 4:56am",
      "content": "_\\>But isn't the requirement of death too limiting?_   \n   \nI was being literal: you can't \\*revive\\* something that's not \\*dead.\\* That doesn't mean you can't develop an idea. And you don't have to wait for an idea to be dead to build on it. Just be sure to evolve it and don't just copy it or rehash it. If you're inspired by Trajan to take classic roman capitals to a whole new level, then great, go for it. But don't just redraw Trajan with a few superficial tweaks here or there and call it a \"revival.\"   \n   \n_\\>But revivals on the high creative level of Mrs Eaves are extremely rare._   \n   \nAgreed. But there's nothing wrong with rarity. It keeps the bar set high.   \n   \n-- K.\n\n"
    },
    {
      "time": "25 Nov 2002 — 7:55am",
      "content": "Here are a few good links I found recently   \nrelating to copyright which fit into this discussion   \nrather well..   \n [Copyrights and Copywrongs](http://web.archive.org/web/20131013030635/http:/stacks.msnbc.com/news/594462.asp)   \n   \n..which was found on this site..   \n [Illegal Art](http://web.archive.org/web/20131013030635/http:/www.illegal-art.org/)   \n an interesting exhibition that I would encourage   \neveryone to look through.\n\n"
    },
    {
      "time": "26 Nov 2002 — 2:25pm",
      "content": "Illegal Art is nice. Especially the MP3s by Negativland and The Evolution Control Committee. Plunderphonics kick !\n\n"
    },
    {
      "time": "15 Dec 2002 — 9:36am",
      "content": "Yes, anything relating to ethics (more than legality) in type design garners a lot of accusation/self-defence, direct or via innuendo. Maybe that's because there isn't enough money in the field, and leveraging ethics would supposedly increase revenue? Not enough to justify the resultant ill feelings, I'd say.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Oct 2002 — 10:06am",
      "content": "Hello,   \n   \nI heard about the whole story of frothy a couple of weeks ago. I was really astonished and really really didn\n\n"
    },
    {
      "time": "23 Nov 2002 — 12:53pm",
      "content": "Christian, the altruism you suggest is worth further consideration but I don't think it pans out in a marketplace.   \n   \nIf you strip away copyright protection or 'ownability' you strip away the ability of a professional to make a living at the craft. And by taking away that ability you cut off the talent pool at the knees. I think that would be a drastic setback to the body of work available, much more than everybody guarding their work.   \n   \n(Take that Karl Marx. Or take that Linux?)   \n   \nI'm not going to suggest you're off base Christian and don't let this detract from our friendship. I like that you're asking some of these questions. Indeed some of that altruism is the reason we pursue Typophile. I highly   \nrespect your work as very original and fresh. Much of your stuff has the stroke of classicism and even better, utility. Would you give it away freely in hopes that it would come back to you better than you left it? If so, try that experiment yourself, with your own work.   \n   \nBut all the type designers I know who are making a living at it (and, please, I'm not one of them) have a difficult enough time earning a living with the current meager protections in place.   \n   \n(Finally, please don't misunderstand me. I'm not suggesting type designers are solely motivated by money. If so, they wouldn't be in this field.)\n\n"
    },
    {
      "time": "15 Dec 2002 — 4:20am",
      "content": "damn ! this little font experience from the time where computers were something to ban in the student life (back to the 90' !) makes people talk !!!\n\n"
    }
  ]
}
