{
  "id": "37973",
  "title": "Making stem width appear consistent",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have been reading the Logo, Font and Lettering Bible and was wondering how do font designers make stem widths appear consistent. For example a vertical stem that is 4px wide 20px high may look okay but if you rotate it so that it is horizontal the stem appears optically thicker, but in reality it is not. How do some of you correct for this?\n\n [‹ Garamond typeface](http://web.archive.org/web/20071223225459/http:/www.typophile.com/node/38101 \"Go to previous forum topic\") [urls and line breaks ›](http://web.archive.org/web/20071223225459/http:/www.typophile.com/node/37994 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071223225459/http://www.typophile.com/user/19888\" title=\"View user profile.\">Capnhud</a>",
  "time": "<br>",
  "uid": "19888",
  "comments": [
    {
      "time": " 10.Oct.2007 4.52pm",
      "content": "The simple answer is, make the horizontal version thinner. There’s probably a formula for this, but I just eyeball it. Typefaces are full of optical corrections like this, and a good lettering artist will make them almost unconciously when drawing letters manually.\n\n"
    },
    {
      "time": " 10.Oct.2007 5.14pm",
      "content": "I was hoping there was some rule that is used, but I guess not.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 12.Oct.2007 6.32pm",
      "content": "I think it’s always going to be a bit subjective, depending on the sharpness of your own (bi-focal) vision and how near or far it is to be viewed from and so on and so forth.\n\nThat said, I’ve had (what looked to me like :) ) success with between 1% and 2% difference.\n\nR\n\n"
    },
    {
      "time": " 13.Oct.2007 6.56am",
      "content": "And a horizontal stroke at the bottom of a glyph will look heavier than the same dimensioned stroke at the to of a glyph. Forget the formulas and just draw the damn thing.\n\nIf it looks good it is good. (apologies to Duke Ellington)\n\n"
    },
    {
      "time": " 13.Oct.2007 10.39am",
      "content": "I think type designers can sometimes exaggerate the amount of difference needed to counteract the optical illusion.  \nThis is because we spend so much time looking at perpendicular strokes that are unequal, and imagining them as equal, that when we look at perpendicualr strokes that ARE equal, we imagine them as being unequal in the opposite manner to our habit.\n\n"
    },
    {
      "time": " 13.Oct.2007 12.06pm",
      "content": "It varies with the typeface: Here’s how much wider the vertical in the plus sign is than the horizontal,in a sample of typefaces: Gill 1.1%, Georgia 1.6 %, Californian FB 1.6%, ACaslon 6%, Franklin Gothic Book 8.6%, AGaramond Semi-Bold 19%.\n\nAs you can see there is no hard and fast rule. Because roman faces generally have heavy verticals and lighter horizontals, this also affects what looks ’right’, as well as the optical illusion. And then the style of the typeface also affects it. And different glyphs will be different. So as James says it’s your design and your eye in the end.\n\nA way to get a feel for it is to look at other designs in a font editor, and compare them, as well as drawing your own.\n\n"
    },
    {
      "time": " 13.Oct.2007 12.12pm",
      "content": "You KNOW I chime in just to show off how willing I am to share the little I know. :)\n\nR\n\n"
    },
    {
      "time": " 13.Oct.2007 12.12pm",
      "content": "R\n\n"
    },
    {
      "time": " 15.Oct.2007 3.52am",
      "content": "Thanks for all the suggestions. I guess the best method is to examine other fonts in a font editor and then come up with a reasonable estimate as to what could be construed a “standard”.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 15.Oct.2007 1.06pm",
      "content": "\\> I guess the best method is to examine other fonts in a font editor and then come up with a reasonable estimate as to what could be construed a “standard”.\n\nOr you might just want to experiment, and use whichever option looks the best to you.\n\nThank goodness, there are no standards in typography.\n\n"
    }
  ]
}
