{
  "id": "3798",
  "title": "Help please - \"Kanda Tso\" rounded geometric sans",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "![kanda](http://web.archive.org/web/20051122154949im_/http:/www.typophile.com/forums/messages/83/29272.jpg)   \n   \nthanks in advance\n\n",
  "author": "garyw",
  "time": "25 March, 2004 - 1:52pm",
  "uid": "807",
  "comments": [
    {
      "time": " 25 March, 2004 - 2:34pm",
      "content": "Similar but not quite Frankfurter Medium.\n\n"
    },
    {
      "time": " 25 March, 2004 - 2:43pm",
      "content": "not VAG Rounded either...\n\n"
    },
    {
      "time": " 25 March, 2004 - 4:23pm",
      "content": "Looks a bit like an old Letraset dry-transfer face called Cut In (at least I think that's what I remember it as) - I'll have to check out my old catalog for it. Mark Simonson would be able to verify this one.\n\n"
    },
    {
      "time": " 25 March, 2004 - 7:38pm",
      "content": "Good hunch Grant, but that's not it. Cut In is more mannered in a '70s art deco kind of way, but the stroke treatment is the same.   \n   \nThis does look awfully familiar...\n\n"
    },
    {
      "time": " 26 March, 2004 - 7:55pm",
      "content": "Of course you're correct Mark. Once I had my Letraset book in front of me, I was obviously wrong. I agree with you that it is very familiar - many it's because it's such a simple monoline face...\n\n"
    },
    {
      "time": " 26 March, 2004 - 8:19pm",
      "content": "It looks like a sort of template lettering I have a vague recollection of. Like the kind they use for those router lettering systems for making nameplates and door signs.\n\n"
    },
    {
      "time": " 26 March, 2004 - 8:34pm",
      "content": "I bet someone created this themselves in Illustrator.\n\n"
    },
    {
      "time": " 26 March, 2004 - 9:18pm",
      "content": "I think it looks exactly like the kind of lettering that you got with a Leroy Lettering set. It uses an alphabet template and a pantograph-style pen that draws on the paper. Here's an [article about it](http://web.archive.org/web/20051122154949/http:/www.tpub.com/engbas/3-35.htm). I used one once in drafting class -- pretty tedious compared to a Mac, but that was about 40 years ago.\n\n"
    }
  ]
}
