{
  "id": "38022",
  "title": "Wallpaper Magazine Redesign...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi there:\n\n[www.wallpaper.com](http://web.archive.org/web/20090810001906/http:/www.wallpaper.com/ \"www.wallpaper.com\")\n\nThe recent redesigned issues of Wallpaper have just about removed all vesitages of Matthew Carter’s Big Caslon (italic swash, sparingly- bold and bold italic); and Charter. I even think they used Alisal too. Amplitude is also gone.\n\nFor text there is a very literary face by Enschede (Trinite or Lexicon???). The workhorse sans, a warmer Univers-like-grot is elegantly neutral. There is also a new titling face in the vein of Profile.\n\nWhile the new look is certainly fresh it doesn’t not come off with same perfect glove and hand combination of types as the previous editions of the magazine. I particularly do not enjoy seeing the Enschede type there- seems out of place to me- looks better in a books if you ask me. Perhaps the new look is a soft beauty as oppose to harsh one- something I’m not quite used to yet in bleeding edge fashion and design.\n\nDoes anyone have the scoop on the new fonts and who led the redesign?\n\nThanks,\n\nMike Diaz :-)\n\n",
  "author": "<a href=\"/web/20090810001906/http://www.typophile.com/user/12479\" title=\"View user profile.\">SuperUltraFabulous</a>",
  "time": "<br>",
  "uid": "12479",
  "comments": [
    {
      "time": " 11.Oct.2007 11.13pm",
      "content": "David McKendrick was once the AD of Wallpaper, though I think he is at Esquire now.\n\nWould love to see some scans or photos when you get a chance, Mike.\n\n"
    },
    {
      "time": " 12.Oct.2007 3.55am",
      "content": "Tony Chambers recently changed from creative director to editor of wallpaper. So I’m assuming he probably did a lot of the re-design.\n\n"
    },
    {
      "time": " 12.Oct.2007 1.57pm",
      "content": "I’ve been told the grot is Christian Schwartz’s revival of Plakat.\n\n"
    },
    {
      "time": " 12.Oct.2007 2.01pm",
      "content": "Hi Mike,\n\nThanks for your compliments on the sans. It’s called Plakat (at least for now), and was first seen in <cite>Condé Nast Portfolio</cite>, a business magazine that launched earlier this year. I had originally intended just to use it for my own corporate identity, but it seemed to be the right fit for these two magazines when they were looking for warm but relatively character-less sans serifs. <cite>Wallpaper*</cite> uses a custom Narrow width, which allows them to pack more copy in without taking any space away from the photography.\n\nThe new text face is indeed Lexicon, which I think plays well with Plakat - they’re polar opposites. It definitely sets a different mood from Charter, but I like its quieter tone of voice.\n\nThe redesign was done in-house by Meirion Pritchard, who took over as art director when his boss, Tony Chambers, became editor-in-chief. Paul Barnes consulted on the typography and drew the fantastic shaded Antique that mainly shows up in the front section.\n\n"
    },
    {
      "time": " 12.Oct.2007 2.22pm",
      "content": "Stephen,\n\nYou could say that Plakat is a revival, but it’s not entirely based on one specific face. I wrote this bit for Wallpaper\\* when they were about to launch, but they didn’t end up using it (because really, who wants to talk about type when there’s beautiful photography of glamorous interiors and furniture to look at?):\n\n“Plakat is based in part on Paul Renner’s Plak, a relatively obscure display typeface cut only in large sizes of woodtype, that is related to the boldest weights of his Futura but has rounder, friendlier, fatter proportions. For the lighter weights, I was also influenced by the ’me too’ sans serifs that many, often smaller European foundries released to compete with the juggernauts that were Futura, Helvetica and Univers, such as Neuzeit Grotesk, Folio, Recta, and Maxima. None of these families were groundbreaking, exactly, but they certainly have their charms. In the narrower styles, I was influenced by mid-20th century Swiss poster typography. In fact, the name ’Plakat’ is German for ’poster’.”\n\nEdit: I should mention that Big Caslon is still around and used for most headlines, but with much less emphasis on the swashes and ligatures in the italic.\n\n"
    },
    {
      "time": " 16.Oct.2007 12.28pm",
      "content": "Hi Christian, I liked Plakat very much, it’s got a lot of virtues and certainly it is a very good improvement over the regular grotesque.\n\nWhen will you make it available?\n\nHéctor\n\n"
    },
    {
      "time": " 16.Oct.2007 4.43pm",
      "content": "Hi Hector,\n\nI’m really happy to hear how much you like Plakat. I hate to make promises I can’t keep, and I’m still working on some of the styles, so I’m afraid the best estimate I can give you for when this family will be available is “sometime next year”. <cite>Condé Nast Portfolio</cite> has an exclusive on the family in North America until April, so it certainly won’t be anytime before then. Sorry I can’t be more specific.\n\n"
    },
    {
      "time": " 17.Oct.2007 7.57am",
      "content": "Well, at least it’s good to know this family won’t be held exclusive for ages.\n\nHéctor\n\n"
    },
    {
      "time": " 7.Mar.2008 4.03pm",
      "content": "[Graphik](http://web.archive.org/web/20090810001906/http:/typographica.org/001138.php) was selected for Typographica’s Type of 2007.\n\n"
    },
    {
      "time": " 7.Mar.2008 11.21pm",
      "content": "It’s gonna be a craze when this face gets released... I wish I could afford exclusive rights to it for lets say... four years?\n\nHéctor\n\n"
    },
    {
      "time": " 25.Jun.2008 8.20am",
      "content": "since it’s looking like this won’t be available anytime soon ... can anyone recommend something very similar? i’m looking for something that resembles the bold header font and the narrow body font.\n\n"
    },
    {
      "time": " 25.Jun.2008 10.25am",
      "content": "I need a sample to be sure we’re looking at the same thing, Sally. Can you take a photo or paste a web link?\n\n"
    },
    {
      "time": " 25.Jun.2008 4.35pm",
      "content": "here it is ...\n\n[http://typographica.org/001138.php](http://web.archive.org/web/20090810001906/http:/typographica.org/001138.php \"http://typographica.org/001138.php\")\n\n"
    },
    {
      "time": " 25.Jun.2008 4.54pm",
      "content": "By “narrow” do you mean light or thin? Try these:\n\n[Folio](http://web.archive.org/web/20090810001906/http:/www.fontshop.com/fonts/downloads/elsner_flake/folio_ot/)  \n [Neuzeit Office](http://web.archive.org/web/20090810001906/http:/www.fontshop.com/fonts/downloads/linotype/neuzeit_office_com_virtual/)  \n [Neuzeit Grotesk](http://web.archive.org/web/20090810001906/http:/www.fontshop.com/search/?q=neuzeit+grotesk+ot)  \n [Neutraface 2](http://web.archive.org/web/20090810001906/http:/www.houseind.com/index.php?page=showfont&id=615&subpage=neutra_no2_view_fonts)  \n [FF Super Grotesk](http://web.archive.org/web/20090810001906/http:/www.fontshop.com/fonts/downloads/fontfont/ff_super_grotesk_ot/) - note alternate [a](http://web.archive.org/web/20090810001906/http:/www.fontshop.com/fonts/singles/fontfont/ff_super_grotesk_ot_regular/?acs=1&acs_pt=48&acs_ss=17) and [g](http://web.archive.org/web/20090810001906/http:/www.fontshop.com/fonts/singles/fontfont/ff_super_grotesk_ot_regular/?acs=1&acs_pt=48&acs_ss=18)\n\n"
    },
    {
      "time": " 26.Jun.2008 2.48pm",
      "content": "An actual usage of what could be the most recherché typeface of the 20th century, Lexicon, in the wild? Honest to blog?\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20090810001906/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 27.Jun.2008 11.44am",
      "content": "FF Kievit has some very very thin weights along with the ultra bolds but it is humanist, not grotesque. Also Gotham does but it’s geometric.\n\nHéctor\n\n"
    },
    {
      "time": " 27.Jun.2008 1.46pm",
      "content": "Also [Proxima Nova](http://web.archive.org/web/20090810001906/http:/www.fontshop.com/fonts/downloads/mark_simonson/proxima_nova_complete/).\n\n"
    }
  ]
}
