{
  "id": "38036",
  "title": "Polish Book",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am designing a short book telling the story of my grandmother’s journey from Poland to Canada during WWII. I am looking for some advice on what to use for the typeface throughout the book. The chapter headings will all be hand-lettered. The dimensions of the book are 10.5x9. I’m still debating whether or not to do it double column or not. Does anyone have any thoughts on what to do about margins on a book of these dimensions? Thanks for the help, guys.\n\n [‹ Id this type in Luottokuntas logo](http://web.archive.org/web/20071116161817/http:/typophile.com/node/38129 \"Go to previous forum topic\") [Because of a EULA, I need something similar. ›](http://web.archive.org/web/20071116161817/http:/typophile.com/node/19378 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071116161817/http://typophile.com/user/11894\" title=\"View user profile.\">dpiechnik</a>",
  "time": "<br>",
  "uid": "11894",
  "comments": [
    {
      "time": " 12.Oct.2007 12.52pm",
      "content": "Oh yeah, another thing I forgot. I would like the book to have the feel of a book from the era. I was thinking of using a typeface that wasn’t quite perfect. Something that might have a slightly damaged look to it but not in the grunge vein. It also needs to have a large enough character base so as to be able to work with some Polish words.\n\n"
    },
    {
      "time": " 12.Oct.2007 3.07pm",
      "content": "How about [Locano (Veer)](http://web.archive.org/web/20071116161817/http:/www.veer.com/products/typedetail.aspx?image=LFT1127000)?\n\n"
    },
    {
      "time": " 12.Oct.2007 3.08pm",
      "content": "It looks as though it would be rather difficult to read in large quantities and at small sizes. Nice lookin’ typeface though.\n\n"
    },
    {
      "time": " 12.Oct.2007 3.21pm",
      "content": "Yep, I guess those serifs are a little tough at small sizes... Sounds like a great endeavor though, good luck!\n\n"
    },
    {
      "time": " 13.Oct.2007 12.04am",
      "content": "david,  \nhow are your pages set up? its hard to say if you should go double column or not without knowing how much of the page youre planning to fill with text.  \nmaking assumptions from what youve said above, 10.5 inches is really wide not to go double column with type set at small sizes. then again, it may be elegant to have the text set in a single column, leaving a lot of white space on the page.  \nare there other elements that will occupy space on the page such as sidenotes, sidebars, captions, photographs, or illustrations?\n\n[im writing this reply with the intent of it helping me to remember to reply again when i am on my own computer, as i have a typeface that has a five letter name that may fit your description perfectly. i cannot remember the name right now though... im trying to look at my font list in my mind and it is not working]\n\nin the meantime, here are a few thoughts:  \nRegula: [http://stormtype.com/typefaces-fonts-shop/families-65-regula](http://web.archive.org/web/20071116161817/http:/stormtype.com/typefaces-fonts-shop/families-65-regula \"http://stormtype.com/typefaces-fonts-shop/families-65-regula\")  \n - probably too distressed  \nRegent: [http://stormtype.com/typefaces-fonts-shop/families-40-regent](http://web.archive.org/web/20071116161817/http:/stormtype.com/typefaces-fonts-shop/families-40-regent \"http://stormtype.com/typefaces-fonts-shop/families-40-regent\")  \n - similar feel minus the distressed aspect  \nBiblon Pro: [http://stormtype.com/typefaces-fonts-shop/families-78-biblon-pro](http://web.archive.org/web/20071116161817/http:/stormtype.com/typefaces-fonts-shop/families-78-biblon-pro \"http://stormtype.com/typefaces-fonts-shop/families-78-biblon-pro\")\n\ni dunno if the baroque connotations in the above three are undesirable... but they all have central european diacritics. if they dont work, maybe youll see something else storm that fits better, i think all of his typefaces have ce diacritics.  \ni cant think of anything else right now, sorry my suggestions are so diverse. haaah...\n\n"
    },
    {
      "time": " 13.Oct.2007 12.14am",
      "content": "Thanks for the help, critter. The project is actual joint with my sister who is compiling the text and doing the majority of the editing work on it. The book is really her brain-child. We had a talk this morning about the book and decided to design it with a double column. The margins we are thinking of using are:\n\ntop - 1.5”  \nbottom - 1”  \ninside - 1.25”  \noutside - 1”\n\nThe columns will have a .375” gutter between them. This should provide us with enough space above the text to place photo captions, notes, pronunciation keys, etc. Photos will span either one or both columns.\n\nThe fonts you provided are quite nice. Regula is a little too distressed as you side and Biblon doesn’t quite suit the look we’re going for. Regent is really good though and I’m going to talk to my sister about getting it. I’d still really like to know the name of the other font you were thinking of.\n\nIf anyone else has thoughts I’d love to hear them as well. Thanks guys.\n\n"
    },
    {
      "time": " 13.Oct.2007 3.41am",
      "content": "Depending on the number of pages and the binding method you might want to consider an inner margin that is approximately 2/3rds the outer margin, think of a spread rather than a single page. I would avoid a too-characterful typeface.\n\nTim\n\n"
    },
    {
      "time": " 13.Oct.2007 4.51pm",
      "content": "david,  \ni couldnt find what i had imagined apparently. sorry!  \ni hope other people offer suggestions also.  \nannnd i hope the project goes well!\n\n"
    },
    {
      "time": " 13.Oct.2007 7.15pm",
      "content": "timd: this is actually my first book project so your help with the margins is perfect. Would you recommend altering the inner or outer margin? Are these decent margins for the book or should I change something about them? Any help I can get on this would be great. Thanks.\n\ncritter: no problem. the other typefaces were of great help and I just need to see if I can get the money from someone now.\n\n"
    },
    {
      "time": " 14.Oct.2007 3.12am",
      "content": "The problem with selecting margins and text measures is they need to be considered with the typeface, the point size(s), leading, together with the binding (perfect binding generally uses more of the inner margin than stitched). Bringhurst gives good advice on the average number of characters per line and book design. Generally you should aim for an average of between 50-66 characters per line – start with that and work out how much space you have left. For more specific advice try out some settings and post them in the Critique forum. Just for clarity – is the 10.5x9 format landscape or portrait?\n\nTim\n\n"
    },
    {
      "time": " 14.Oct.2007 4.53am",
      "content": "dpiechnik,\n\nnie chce Pan użyć do łamania wlaściwe polskej czcionki? coś ksztaltu Antykwy Półtawskiego?  \n\\*  \nwould you like to use for text an original polish typeface like this?  \n [http://www.janusz.nowacki.strefa.pl/poltawski-e.html](http://web.archive.org/web/20071116161817/http:/www.janusz.nowacki.strefa.pl/poltawski-e.html)\n\n"
    },
    {
      "time": " 14.Oct.2007 6.30am",
      "content": "Another Polish font is Antykwa Toruńska, available from CTAN (Comprehensive TeX Archive Network). The 37 page pdf documentation which is [**here**](http://web.archive.org/web/20071116161817/http:/www.ctan.org/tex-archive/fonts/antt/doc/fonts/antt/AntykwaTorunska-doc-en-2_03.pdf), says “The font is mainly used for typesetting of small prints.” The font comes in light, medium, regular and bold, with italics and smallcaps; it also contains Greek and cyrillic characters; 16 files containing the opentype version (otf) can be downloaded from [**here**](http://web.archive.org/web/20071116161817/http:/www.ctan.org/tex-archive/fonts/antt/fonts/opentype/public/antt/).\n\nMichel\n\n"
    },
    {
      "time": " 14.Oct.2007 6.51am",
      "content": "Note: Antykwa Toruńska comes installed (for use with TeX and LaTeX) with [**TeX live**](http://web.archive.org/web/20071116161817/http:/www.tug.org/texlive/) (distributed as [**MacTeX**](http://web.archive.org/web/20071116161817/http:/www.tug.org/mactex/) on the Macintosh).\n\nMichel\n\n"
    },
    {
      "time": " 14.Oct.2007 10.28am",
      "content": "I realized last night that I never actually explained the book very well. By writing “polish book” as the topic I insinuated that the book was actually written in polish. Sorry about this. I don’t actually speak a word of polish so I haven’t a clue what you said andrijko. Wish I could read it though. Maybe some day I’ll take the time to learn Polish. I’ve taken a look at those typefaces the two of you posted and will download them to see how they work. I love some of the characters in the Antykwa Półtawskiego typeface. Those Gs are pretty sweet, although I fear they may be difficult to read for some.\n\nWhat exactly is TeX live for? I couldn’t quite figure out what its use is.\n\nThanks for your help guys. I love this forum.\n\n"
    },
    {
      "time": " 14.Oct.2007 2.16pm",
      "content": "\\> <cite>What exactly is TeX live for? </cite>\n\nTeX live is an implementation of TeX (and LaTeX), which is used in the scientific community to typeset texts containing lots of formulas, diagrams and the like, but there are also packages for linguistics, critical text edition, etc. A tex or latex input file contains commands to tell how the text or the formula should be typeset (it is not “what you see is what you get”). Many scientific journals expect articles to be submitted in latex and provide packages for those wanting to submit, so that they get on their laser printer something resembling the final published text (and comply with the journal editing requirements)\n\nMichel\n\n"
    },
    {
      "time": " 14.Oct.2007 2.59pm",
      "content": "Ah, ok. So this wouldn’t actually have any use for this kind of book then.\n\n"
    },
    {
      "time": " 14.Oct.2007 3.31pm",
      "content": "\\> <cite>So this wouldn’t actually have any use for this kind of book then.</cite>\n\nIf you are used with TeX or LaTeX, and in particular if you can write yourself macros (commands), then you are able to typeset books and get quite beautiful results. I edited with LaTeX my (private) mother’s memoirs, and she was quite satisfied with the result, but I have been using LaTeX for years now.\n\n"
    },
    {
      "time": " 14.Oct.2007 7.51pm",
      "content": "Yeah, I don’t know if I’d recommend learning TeX for a project like this, but TeX is ridiculously powerful.\n\n"
    },
    {
      "time": " 15.Oct.2007 12.05pm",
      "content": "I’m going to download it and take a look to see what it’s like. Based on what you have said I’m not sure it will be the best tool for the job as there are a lot of images to be laid out in the book and it sounds like this is more of a text application. Any other thoughts on fonts or book layout?\n\n"
    },
    {
      "time": " 15.Oct.2007 12.39pm",
      "content": "Hi,\n\nI am new to these fora and love what I am reading here. I take the liberty of chiming in as I have finished a similar project using Adobe InDesign. The rule of thumb for columns is 1½ lowercase alphabets in whatever font you decide to use, i.e.,\n\n1 column width = abcdefghijklmnopqrstuvwxyzabcdefghijklm\n\nThis is a font dependent calculation and if using a very narrow font might even yield three columns, or conversely a single column with wide margins for very wide fonts.\n\nI apologize if this is already assumed and I am merely pointing the blatantly obvious.\n\nI would add that I use InDesign for any publication longer than one page, i.e, books, Quarterly Reports, MMPs\\* MOPs\\*, and presentations.\n\n\\*Procedure books for manufacturing.\n\nalaric\n\n"
    },
    {
      "time": " 15.Oct.2007 1.14pm",
      "content": "Some thoughts. It now is apparent that there will be a lot of images in the book, so you might want to go back to someone else’s early suggestion of a single column of text with larger images that break into the white space. (I assume one or more pictures on most pages, and these are to be played up ... that is, made relatively large.)\n\nI would suggest going to the library or a bookstore and browsing through similar types of books, and getting a feel for what you think works best. Sometimes you can see it and know it is perfect, while someone might have given you the specs and that did nothing.\n\n"
    },
    {
      "time": " 15.Oct.2007 3.18pm",
      "content": "I’ve actually grabbed a few books from the library for research. I preferred a biography of Charlie Chaplin which uses a two column design. The photos span either one or both columns and if you use a large photo you can remove one of the columns and replace it with the photo. I had a scan of it that I wanted to post so you could see what I was talking about but whenever I try posting it firefox locks up on me. Kinda weird.\n\n"
    },
    {
      "time": " 15.Oct.2007 10.12pm",
      "content": "You might want to use a classic type that has survived the transition to digital. Or if it was me I would pick a font ( brand new or old ) that held some subtle emotional quality that I thought resonated with my project. ’Rational’ choices of type are okay, but I don’t find them satisfying as a designer or as a reader.\n\n"
    },
    {
      "time": " 15.Oct.2007 10.49pm",
      "content": "I agree with you, Eben. The main reason for that was to get an idea for the look of a typeface from the period. Another issue is that it’s a bit of a personal project and we don’t have much money to spend, especially on typefaces. I’m going to keep browsing around looking for a typeface to use in the hopes that something stands out strong.\n\n"
    },
    {
      "time": " 16.Oct.2007 7.55am",
      "content": "How will you be producing the book? The way it’s printed could be a factor as well.\n\n"
    },
    {
      "time": " 16.Oct.2007 9.41am",
      "content": "That is yet to be decided. This is partly a personal project and partly a school project. I’m going to be discussing it with my teacher who has done a fair number of large-scale book projects himself. I’m going to need to price out the difference between hard and soft cover as well as the different pricing between the paper stocks we can use. Budget is a huge factor in this. Because there will be photos throughout we will not be going with the standard crappy paperback book paper stock. I’m really not a book designer (yet. i hope to get into it more) so all of this is very new to me. I want to learn as much as I can.\n\n"
    }
  ]
}
