{
  "id": "38043",
  "title": "Do designers use left or right brain?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm fascinated by professions that rely on both mathematical, technological skill (like Bézier curves) plus creativity and imagination.\n\nThis test proved interesting to me, and I'm curious what other typophiles see? (I'll post my results later, I don't want to skew your impressions.)\n\nThe Right Brain vs Left Brain Test  \nDo you see the dancer turning clockwise or counter-clockwise?\n\n ![](http://web.archive.org/web/20120104164001im_/http:/typophile.com/files/dancer_4783.gif)\n\nIf clockwise, then you use more right side of the brain.  \nIf counter-clockwise, then you use more left side of the brain.  \n [More details about the right and left brain activities can be found here.](http://web.archive.org/web/20120104164001/http:/www.news.com.au/dailytelegraph/story/0,22049,22535838-5012895,00.html)\n\n",
  "author": "<a href=\"/web/20120104164001/http://typophile.com/user/21709\" title=\"View user profile.\">EileenB</a>",
  "time": "<br>",
  "uid": "21709",
  "comments": [
    {
      "time": "",
      "content": "I see it going both ways. hmmm\n\n"
    },
    {
      "time": "",
      "content": "I can only get her to go counter-clockwise by flipping my laptop on it’s side.\n\n"
    },
    {
      "time": "",
      "content": "Oh yes that's it... it's just some weird optical effect!\n\n"
    },
    {
      "time": "",
      "content": "At first all I saw was counter-clockwise. Now all I see is clock-wise.\n\n"
    },
    {
      "time": "",
      "content": "That thing is hypnotising. Maybe someone could explain how it works?\n\n"
    },
    {
      "time": "",
      "content": "I _cannot_ see her move counter-clockwise, no matter how I try.\n\nBut please clarify: by \"clockwise\", do you mean spinning to her right? A clock is on a vertical plane, this plane is horizontal.\n\n"
    },
    {
      "time": "",
      "content": "I see a rather poor knockoff of a James Bond movie intro.\n\n"
    },
    {
      "time": "",
      "content": "This is all very interesting to me, thanks so much for your replies. Now, I've got some kool-aid for everyone to enjoy while I rummage through your wallets. :)\n\nOk, I see both directions -- most of the time clockwise, if I'm reading the text, she switches directions (to counter-clockwise) in the corner of my eye. If I look back, and stare for a moment, she switches back. It seems my left and right brain are arguing (I just wish the yelling would stop.)\n\nI have no idea how or why it works. It does seem to accurately describe me, though, because I love mechanical work and creative work equally -- I want to build the logo AND the dishwasher. Anyone else feel like it's an accurate description of your brain?\n\n"
    },
    {
      "time": "",
      "content": "Stephen: If you take your clock off the wall and put it on the table, does it change direction? :)\n\n"
    },
    {
      "time": "",
      "content": "Only clockwise for me.\n\n"
    },
    {
      "time": "",
      "content": "Nope. But only if you're looking at it from overhead. If you look at it straight on, level with the table, then it doesn't move at all.\n\n"
    },
    {
      "time": "",
      "content": "Right Brain |||||||||||||| 51.6%  \nLeft Brain |||||||||||| 48.4%\n\n[http://similarminds.com/left-right-brain-test.html](http://web.archive.org/web/20120104164001/http:/similarminds.com/left-right-brain-test.html \"http://similarminds.com/left-right-brain-test.html\")\n\n"
    },
    {
      "time": "",
      "content": "This must be crap; I asked a lawyer and he sees her going clockwise.\n\n"
    },
    {
      "time": "",
      "content": "\\*yanks at Stephen's clock with fishing line\\*\n\n"
    },
    {
      "time": "",
      "content": "Well, the ambiguity is akin to the Necker Cube illusion: A silhouette with no depth cues makes front and back indistinguishable.\n\nI am highly skeptical of the claim that it tests left- or right-brained thinking, because the whole idea of left-brained or right-brained people comes from a gross oversimplification of neuroscience.\n\nI had to struggle for several minutes to see counterclockwise motion, because there are a number of depth cues present that favor clockwise: the circles that the figure's hand and foot trace in the air are seen from slightly above, and she spends more time facing toward you than away from you, just as a real dancer usually would when pirouetting for an audience. So clockwise is more aesthetic, but also more logical. Interpreted as counterclockwise, the spinning figure is seen from slightly below, and therefore does not appear to be perpendicular to the floor (which we are certainly seeing from above or there would be no reflection), but tilting backwards, and so the motion does not look as much like natural human motion following the laws of physics as the clockwise view does.\n\n"
    },
    {
      "time": "",
      "content": "she goes clockwise. And winks every time she goes 'round.  \nR\n\n"
    },
    {
      "time": "",
      "content": "Aha, I no longer feel like a dunce. By using [Kottke's technique](http://web.archive.org/web/20120104164001/http:/www.kottke.org/remainder/07/10/14270.html) of focusing a few pixels below the image, I was able to make her spin to the left.\n\n"
    },
    {
      "time": "",
      "content": "Stephen,  \nWhat happens if you focus a few inches below your clock on the table?\n\n"
    },
    {
      "time": "",
      "content": "I can only see a clockwise motion in spite of trying these other techniques.\n\n"
    },
    {
      "time": "",
      "content": "I must be front and back brained. I see it equally well either direction.\n\n"
    },
    {
      "time": "",
      "content": "its going clockwise.\n\n"
    },
    {
      "time": "",
      "content": "_I’m curious what other typophiles see?_\n\nGratuitous sex.\n\n"
    },
    {
      "time": "",
      "content": "Clockwise, totally. I can't see anything else.\n\n"
    },
    {
      "time": "",
      "content": "Very funny, Nick.  \nSomebody on another forum said they saw:\n\n_nipple..nipple.....nipple..nipple....nipple_\n\n"
    },
    {
      "time": "",
      "content": "Counter for me first.  \nFocusing on the bouncing foot makes it go clockwise.  \nThe only way to get it back to counter was to focus on the shadow, then move to the rotating foot.\n\n"
    },
    {
      "time": "",
      "content": "Regarding the brain; answer: yes\n\n"
    },
    {
      "time": "",
      "content": "\\>_nipple..nipple.....nipple..nipple....nipple_\n\nturned out to be dust on the screen :o(  \nR\n\n"
    },
    {
      "time": "",
      "content": "_Very funny, Nick._\n\nNo, that was Si. I'm serious.  \nYou asked what I see.  \nI see parlour-room science spiced up for teenage boys.  \nThat's why she's a babe, isn't wearing any clothes, and has a perky nipple.\n\n"
    },
    {
      "time": "",
      "content": "OMG! This thing is now floating around the internet like »Aoccdrnig to a rscheearch at Cmabrigde Uinervtisy« years ago.  \nBut there was no such research and this animation has nothing to do with brain sides.\n\n"
    },
    {
      "time": "",
      "content": "Ralf,\n\nI found it on [News.com](http://web.archive.org/web/20120104164001/http:/www.news.com.au/dailytelegraph/story/0,22049,22535838-5012895,00.html) and I was curious about it's origins, but google revealed nothing other than the test itself. Do you know more about it?\n\nYour new Motor City book looks astoundingly gorgeous, Ralf. Have you found a publisher yet? I want to buy one!\n\nEileen\n\n"
    },
    {
      "time": "",
      "content": "I agree with Ralf, but the optical ambiguity _is_ interesting.\n\n[http://en.wikipedia.org/wiki/Brain\\_lateralization](http://web.archive.org/web/20120104164001/http:/en.wikipedia.org/wiki/Brain_lateralization \"http://en.wikipedia.org/wiki/Brain\\_lateralization\")\n\n"
    },
    {
      "time": "",
      "content": "I see it going clockwise.\n\n"
    },
    {
      "time": "",
      "content": "I see it going clockwise, but when I was reading the text next to it ( at the linked page), she turned anti-clockwise. And now my eyes hurt.\n\nand\n\nRight Brain |||||||||||| 44.4%  \nLeft Brain |||||||||||||| 55.6%\n\n"
    },
    {
      "time": "",
      "content": "Looking at the text above it, it goes counterclockwise (same as looking at it).  \nLooking at the text under it, it goes clockwise.\n\nWorks every time I do it.\n\n"
    },
    {
      "time": "",
      "content": "What if your brain can also see the stripper pole?\n\nI'm sooo lost... in a good way.\n\n"
    },
    {
      "time": "",
      "content": "I see it going clockwise. When I read the text below it, it went counter clockwise for a moment, but I tried reproducing that, but it only worked once for me.\n\nOh and this is nice:  \nRight Brain |||||||||||| 50%  \nLeft Brain |||||||||||| 50%\n\n"
    },
    {
      "time": "",
      "content": "\"At first all I saw was counter-clockwise. Now all I see is clock-wise.\"  \nSame here. The fact that the plant foot does not flex is making my calves hurt. These people need variations.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "I definitely saw it going clockwise at first, which makes sense because I definitely use the right side of my brain more than the left. But I am just left-brained enough that I can get it to switch rotation. It's a fun test... thanks for posting!\n\n"
    },
    {
      "time": "",
      "content": "Right Brain |||||||||||||||||| 74%  \nLeft Brain |||||| 26%\n\nIt's not much of a shock to me.\n\n"
    },
    {
      "time": "",
      "content": "Today I see her going counterclockwise. Hmmm.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20120104164001im_/http:/typophile.com/files/Bild1_3786.png)\n\nIf you look at a single frame of the animation you can easily see her turned away or looking towards you. Whatever you choose to see. Since every frame can be viewed in two ways it's up to you.  \nBut within the animation the brain has to decide for one direction. Otherwise the change of the black figure would make no sense. It is a known fact that the brain, presented with a decision with two equal choices, will rather \"invent\" slight differences than make no decision at all. It's part of human's survival strategy.  \nThe decision making in this case is somewhat \"chaotic\", this is why the results may be different each time you try. But when the brain has decided for one direction it usually sticks to that direction. Again: this is the only logical way to make sense of the animation.  \nThe connection to brain sides makes a nice headline, but is not very plausible.\n\n"
    },
    {
      "time": "",
      "content": "I went gallery hopping one afternoon with a friend and after awhile he asked me if I was left-handed. He had noticed that we tended to go in different directions around the room and wondererd if it had something to do with handed-ness. We were both righties so that didn't hold water in that case. But maybe he was on to something.\n\nBTW in the still above I saw her facing away from me. It took some effort to turn her around towards me.\n\n"
    },
    {
      "time": "",
      "content": "I saw both, and every time I look back it seems to flip directions at some point.\n\nI know that it's not flipping, but maybe my brain has trouble making decisions...\n\n"
    },
    {
      "time": "",
      "content": "Now I can get it to flip back and forth without turning.\n\n"
    },
    {
      "time": "",
      "content": "Actually the appearance of the reflection (not a shadow as it's heading away from the subject) of the spinning foot only appears when the foot is traveling from right to left, and as the angle of viewing would mean the reflection would appear when the foot is furthest from th viewer, this seems to help the viewer perceive an anti-clockwise spin.\n\nDoes that make sense? It would be better if there were no reflections shown on the floor.\n\n"
    },
    {
      "time": "",
      "content": "The clockwise movement implies we're looking down at her a bit; counterclockwise implies looking up. I wonder if there's any correlation between the viewer's height (or time spent sitting vs. standing, etc.) and the way he or she sees it!\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20120104164001im_/http:/typophile.com/files/left-brain-right-brain-conflict_5816.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\\> _BTW in the still above I saw her facing away from me. It took some effort to turn her around towards me._\n\nI think she IS facing away, actually. That, or she has her standing foot in a very awkward upward position.\n\n"
    },
    {
      "time": "",
      "content": "first i saw it clockwise and after a while, counterclockwise, its as the test said, in 53 %\n\n"
    },
    {
      "time": "",
      "content": "only clockwise.\n\nand now i'm [insert synonymn for feeling sexually aroused. heavens to mergatroid. bloody censorship]\n\n"
    }
  ]
}
