{
  "id": "38047",
  "title": "Do designers use left or right hand (and to what extent)?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This thread was inspired by the discussion on [brain hemisphere dominance](http://web.archive.org/web/20131019050406/http:/typophile.com/wiki/Do%20designers%20use%20left%20or%20right%20brain%3F). Diagnosing brain hemisphere dominance is rather tricky, and society has associated some mythical properties with hemisphere dominance that have not been supported by science. But one trait that's somewhat related to hemisphere dominance, and much easier to diagnose, is handedness.\n\nFor present purposes, I suggest we discuss handedness in terms of the Edinburgh Handedness Inventory. It's not a perfect instrument (there isn't one for assessing handedness)--it has a bias toward mixed handedness. But it's more widely available than any other common handedness diagnostic. So if you're game, spend a moment at [http://airto.bmap.ucla.edu/BMCweb/Consent/edinburgh.html](http://web.archive.org/web/20131019050406/http:/airto.bmap.ucla.edu/BMCweb/Consent/edinburgh.html \"http://airto.bmap.ucla.edu/BMCweb/Consent/edinburgh.html\") and report your score. And feel free to share thoughts, anecdotes, etc. about handedness.\n\nMy laterality quotient is -50.0. I'm primarily a lefty, but there are some things I prefer to do with my right hand, especially throwing and tooth-brushing. And most of the things on the Edinburgh list other than writing or drawing I generally (but not exclusively) do left-handed.\n\nLeft-handedness is in my genes. My father is much more left-handed than me, my mother about as much. I have two left-handed siblings; one is very left-handed and the other more like mom and me. And I have five right-handed siblings who are all very right-handed as far as I know. With five lefties and five righties, handedness was an important consideration, especially around the dinner table.\n\n",
  "author": "aric",
  "time": "13 Oct 2007 — 4:19am",
  "uid": "21991",
  "comments": [
    {
      "time": "13 Oct 2007 — 4:47am",
      "content": "What a grat topic in its own way. In New York in the mid-1980s I started noticing that many of the designers I were left handed, including my dear departed friend, James R. Harris. I, like you, started wondering if the more creative people in the field were left handed - because they certainly were surfacing as such.\n\nI hope others contribute to this. I'd love to read more. Thank you.\n\n"
    },
    {
      "time": "13 Oct 2007 — 5:35am",
      "content": "My laterality quotient is 100, according to that test. Yet I do certain things with my left hand, like for example, I usually drink with my left hand. But thats mainly for practical reasons, when I sit somewhere where the table is on my left, I pick and use things sitting on it with my left hand. Also behind the computer, when my right hand is occupied with the mouse, I do other things with left (obviously). So I guess that test is a bit too limited.\n\nEveryone of my close family (parents/brother) is right handed. One friend of mine is a lefty, which is probably the only left handed person I know.  \nI think.\n\n"
    },
    {
      "time": "13 Oct 2007 — 8:38am",
      "content": "I'm right-handed but I hold my hand in a kind of a \"hook\" position when I write, which implies some effect of the right brain. My mother is a righty but both my father and brother are lefties which meant that as a kid I thought all boys were lefties.\n\nBut I used my left eye when I look through the camera back in the day when one actually looked through a viewfinder.\n\nThat test told me I'm 100% right handed but I already knew that. I did have a long-term boyfriend who was an extremely talented left-handed designer/artist.\n\nInterestingly because of an elbow injury I've had to force myself to do more things with my left hand - turning doorknobs, picking things up. It felt strange at first but it's pretty comfortable now.\n\n"
    },
    {
      "time": "13 Oct 2007 — 8:23am",
      "content": "From the test, I'm 100% left-handed. But I already thought this was the case...my right-handed writing looks like chicken scratch, and often if I need something from my right pocket, I'll use my left hand.\n\nThanks for this article and the links.\n\n"
    },
    {
      "time": "13 Oct 2007 — 9:19am",
      "content": "I think handedness is very overrated and I even doubt that it lies in our genes.  \nPrefering one hand is just easier, because you have to train just one hand instead of two. If someone thinks to be \"very right-handed\" or \"very left-handed\" in my opinion this just means he/she hasn't tried very much to use the other.\n\nTake a piano player: To become a virtuosic player you need to train both your hand equally. The moves of your fingers are extremly subtle and difficult and require a lot of power and fine coordination of the muscles.  \nBut if any piano player can use both his hands in such an elaborate way, this also means that everybody can use their \"weak\" hand for simple usage of household tools or a computer mouse. You just need to take the time to train your hand.\n\nI usually use my left hand, when it doesn't matter (spoon, tooth brush and so on), but whenever the right hand is more appropriate I use it, for example with the computer mouse. I think it is a very bad idea that left-handed people try to turn everything upside down. It's inevitable to use different scissors for the left hand, but it is stupid to ask for keyboards with a flipped layout or to play a guitar with the strings mounted in the wrong order. It makes everything even worse.\n\n"
    },
    {
      "time": "13 Oct 2007 — 9:24am",
      "content": "-This subject's laterality quotient is: 66.7  \nPlacing this subject in the 2d right decile.-\n\nI personally have a lot of trouble remembering which friends are lefties and which aren't since I graduated high school because my only way of knowing is being around them while they're actually writing something.\n\naric- in regards to the the genetic left/right split: I've always thought that it is genetic, but kids are also so absorbent while growing up that I've also wondered whether or not they were lefties based on observation. Although I do have a lefty friend who was forced into being a righty in a private elementary school [not in the US], and he draws 90x better with his left hand than his right.\n\npatty- hand/elbow injuries really make you realize how important is to have control over both hands. I recently got attacked by a dog and I had damage to my middle nerve in my left hand, I couldn't use it for anything for 2 months and in that time my elbows aided me in doing A LOT of things, and I saw for the first time how dependent I was on my left hand even though I am a righty. Imagine xactoing with an elbow as your support... I looked pretty ridiculous.\n\n"
    },
    {
      "time": "13 Oct 2007 — 9:31am",
      "content": "<cite>I think handedness is very overrated and I even doubt that it lies in our genes. Prefering one hand is just easier, because you have to train just one hand instead of two. If someone thinks to be “very right-handed” or “very left-handed” in my opinion this just means he/she hasn’t tried very much to use the other.</cite>\n\nSure, you can learn to write with your \"wrong\" hand as injured people often do, but to say that we become right- or left-handed because it's \"just easier\" is ridiculous. Why, then, are there left-handed people at all? Have you ever watched a small child learn to throw a ball or start to draw? They always use the same hand.\n\nMy father, who is 76, is left handed. He does everything with his left hand, sports, etc. But when he was a child, the left-handedness was seen as wrong, evil (the Italian word for left is sinistra; you throw spilled salt over your left shoulder to ward off the devil, etc; and by contrast right=right) so he was forced to learn to write with his right hand. As soon as he was old enough he switched back to his left hand but his writing, on both sides, is atrocious. Now, I'm not sure he would have won awards for penmanship either way, but he would probably have legible handwriting now if he'd been allowed to learn to write with the hand that was natural for him.\n\n"
    },
    {
      "time": "13 Oct 2007 — 9:38am",
      "content": "[Article from the New York Times on the subject.](http://web.archive.org/web/20131019050406/http:/query.nytimes.com/gst/fullpage.html?res=9A01E1D6103BF935A25756C0A9669C8B63)\n\nSome factoids:\n\n\\*About 90 percent of people are right-handed. Most of the rest are distinctly left-handed, though some are ambidextrous to one degree or another.\n\n\\*When both parents are right-handed, 92 percent of their children are. When one parent is left-handed, about 80 percent of the children are right-handed. When both parents are left-handed, about half their children are right-handed.\n\n\\*Left-handedness runs in families. In the British royal family, for example, the Queen Mother, Queen Elizabeth II, Prince Charles and Prince William are all left-handed.\n\n\\*Males are somewhat more likely than females to be left-handed. There is some evidence that the children of left-handed mothers and right-handed fathers are more likely to be left-handed than are the children of right-handed mothers and left-handed fathers.\n\n\\*In a striking 18 percent of identical twins, products of the same egg with exactly the same genetic makeup, one twin is right-handed and the other left-handed. There also seems to be a higher proportion of fraternal twins with different handedness than is the case with other siblings.\n\n\\*The left hemisphere of the brain controls the motor coordination of right-handed people, and the right hemisphere controls it in lefties. In almost all instances, the speech and language of right-handed people are controlled by the left side of their brain. But in left-handed people, the right hemisphere controls speech and language in at least 30 percent of the cases.\n\n\\*A much larger percentage of young people than old people are left-handed. This may be, as one researcher suggests, because lefties die earlier. Or it may be because in an earlier time, natural lefties were taught to write and perform other tasks with their right hands and now think of themselves as right-handed.\n\n\\*A disproportionate number of lefties seem to be geniuses (Einstein), artists (Leonardo, Michelangelo, Picasso) and athletes (Babe Ruth). A disproportionate number also seem to be criminals (Jack the Ripper, Billy the Kid).\n\n\\*Except for Jimmy Carter, every president for the last quarter-century has been left-handed. There is no question about Gerald R. Ford, George Bush or Bill Clinton. Ronald Reagan writes and eats with his right hand. But Edmund Morris, the Reagan biographer, has little doubt that Mr. Reagan is a natural lefty who is one of those who were trained to use their right hands. In the movies, Mr. Morris says, Mr. Reagan always twirled and shot pistols with his left hand, and as president, he always waved with his left hand. The presidential string is about to be broken. Vice President Al Gore and Gov. George W. Bush are both right-handed.\n\n"
    },
    {
      "time": "13 Oct 2007 — 9:46am",
      "content": "Theres a test for ambidexterity- very few people are truly capable of it. I can't remember but it had something to do with clasping your hands and rotating them. I can't find anything to back it, but I also know that the hands can sort of mirror each other while drawing, etc.\n\nRalf- most instruments require both hands... and I know lefty guitar players who can play a mean righty guitar by turning it upside down and playing it that way.\n\n"
    },
    {
      "time": "13 Oct 2007 — 10:12am",
      "content": "I've alway considered myself a lefty because I write with my left hand and draw or paint with it when I'm using a real pencil or brush. But I do a lot of things with my right hand---such as throwing a ball--and many things I do with either hand, depending on which is physically more practical in the circumstances. My score on the Edinburgh test was +33.\n\nInterestingly, I usually use my right hand to control the computer mouse, for routine clicking as well as for drawing and tracing. I think this is because I've used so many computers that weren't my setup that I simply kept the mouse where it had been placed on the right rather than switching it over. I can also use my left hand just as well though, and sometimes switch back and forth in long computer sessions.\n\nBeing of somewhat ambiguous handedness can cause trouble. Playing baseball, for instance, I have to throw with my right hand because I'm totally inept with my left for that purpose. But I also prefer to catch with my right hand! It being impractical to take a glove on and off my right hand, I do use use my left hand, but it feels darned awkward and probably helps explain why I'm always one of the last picked when choosing teams. No problem in hockey, though, where I used to play goal and held the catching mitt in my right and felt totally comfortable with the stick in my left.\n\nPeople I don't even know who are lefties often comment when they see me write with my left--e.g. a store clerk when I'm signing a credit card slip. Being part of a \"lefty minority\" seems to create a brief little bond.\n\n"
    },
    {
      "time": "13 Oct 2007 — 10:17am",
      "content": "<cite>Sure, you can learn to write with your “wrong” hand as injured people often do, but to say that we become right- or left-handed because it’s “just easier” is ridiculous. </cite>\n\nWell, I think it is a ridiculous idea, that a person who is born with identical arms and hands should be imprinted with a strange gene (no scientist has found yet) that tells them to just use one hand and not the other.\n\nOf course I know all the \"facts\" you listed but you know what they say about statistics ...  \nFor example: Right-handed parents having a right-handed child does't prove a handedness gene. It can also just mean that the child successfully imitated their parents behaviour.\n\nOr as your linked article pointed out:  \n\"But the truth is, the question of what causes people to be right-handed or left-handed is nearly as much of a mystery today as it was when Carlyle addressed it in 1871.\"\n\n"
    },
    {
      "time": "13 Oct 2007 — 10:45am",
      "content": "Ralf - just because they don't know WHY people are left- or right-handed, or that it isn't genetic, isn't reason to dismiss the phenomena. Our arms may be identical but our brains are not symmetrical. Before a certain age (like 7 or something) there is far more adaptibility between sides of the brain, as proven by kids with injuries to one half of the brain being able to use the other half for some of the tasks it's not normally programmed for.\n\n10% of the population is gay, they don't know why, they don't think it's genetic, surely you're not suggesting that's a choice too.\n\n<cite>Right-handed parents having a right-handed child does’t prove a handedness gene. It can also just mean that the child successfully imitated their parents behaviour.</cite>\n\nI have one parent of each, and I'm right-handed. Like I said, a very small child will automatically gravitate to one or the other hand for most tasks. True ambidextrousness is rare, but more common among the left-handed, perhaps because they are trying to adapt to a largely right-handed world. Like I said, if it's a matter of choice, then why are 10% of the population left-handed when it's not clearly evolutionarily advantageous?\n\nI wonder, are there more car accidents in Britain, where the stick shift is on the left?\n\n"
    },
    {
      "time": "13 Oct 2007 — 10:54am",
      "content": "Interesting point Patty... The only time I drove a left hand drive car with manual gearbox I found it quite awkward to begin with, and without thinking about it I sometimes tried to chnge gear in a way that mirrored the way I would change gear with my left hand.... resulting in some interesting noises from the mechanicals :O\n\nTherefore I think a great deal of handedness is self taught. The case of pianists is also a good one for dispelling people's inability to use either hand...\n\nBut, do people have a genetic predisposition to use one hand or the other? perhaps.\n\nOh, I'm right handed.\n\n"
    },
    {
      "time": "13 Oct 2007 — 11:21am",
      "content": "<cite><br>\nRalf - just because they don’t know WHY people are left- or right-handed, or that it isn’t genetic, isn’t reason to dismiss the phenomena. </cite>\n\nI don't dismiss the phenomena, I just have a different opinion how the phenomena is triggered.\n\n<cite> True ambidextrousness is rare, but more common among the left-handed, perhaps because they are trying to adapt to a largely right-handed world. </cite>\n\nExactly! A right-handed has usually no reason whatsoever to train his left hand. The world just fits to his behaviour.  \nBut the left-handed my be tempted to use the mouse on the right side of the keyboard and so on. So he trains both his hands. So this can be easily explained without the need for magical genes for handedness or ambidextrousness.\n\nWhen people see me writing with the left hand they often say: This looks so strange! I could never write like that! (And sometimes they try and of course it looks terrible). But that's a common misunderstanding: Of course they can't write with the left hand. At first they couln't write with the right hand either. It took them years to learn to write with the right hand. And because of the way our brain works, this motor coordination can't be passed on to the other hand. But if they would take the time, they could do it.\n\n<cite><br>\nI wonder, are there more car accidents in Britain, where the stick shift is on the left?<br>\n</cite>\n\nOf course not! Like a said, everyone can learn any course of movement with both hands. The same amount of training assumed, there is no difference whatsoever. (see my piano player example)\n\n"
    },
    {
      "time": "13 Oct 2007 — 11:35am",
      "content": "But the phenomena I refer to is my belief that people are born with a predilection to favor one hand over the other. I think it can be influenced by your upbringing, or by effort, but not triggered by it. I repeat my question, why would anybody be left-handed otherwise? There is nothing to be gained from \"training\" yourself that way. And given the extensive efforts of previous generations to \"train\" lefties to use their right hands (to wit: my father) why wouldn't left-handedness just have died out?\n\nThis, to me, is the salient quote in the Times article:\n\n''Handedness is a complex behavior,'' Dr. Geschwind said, ''and no complex behavior has ever been shown to be due to only a single gene without any environmental influence.''\n\n"
    },
    {
      "time": "13 Oct 2007 — 12:03pm",
      "content": "Patty,\n\nYour comments make me think of my right-handed father. He has horrible penmanship, and he uses his left hand for everything _except_ writing. My mother is an kindergarten teacher, and believes my father is \"really a lefty.\"\n\nDad went to catholic school, and remembers vividly being smacked with a ruler for holding his pencil with the \"wrong hand.\" At 72, he's still right handed. I suspect there are many stories like this, where kids try and emulate their parents' right-handedness, but it proves only moderately successful.\n\nBTW, I'm 100% righty. My left hand is basically a headrest.\n\nEileen\n\n"
    },
    {
      "time": "13 Oct 2007 — 12:09pm",
      "content": "Furthermore, regarding the piano player example, the right hand usually gets the task of playing the more complex melodies, while the left hand plays the chords. The piano is in fact set up to favor righties this way. Obviously lefties learn to play beautifully without needing a reverse piano built for them.\n\nI had a lefty boyfriend who tried to learn guitar and it was a struggle for him. He either had to train the wrong hand to pick and strum, get a special lefty guitar, or play upside down. Righties don't have this problem. The left hand is of course used in guitar playing too, but its job is simpler, holding down the strings.\n\nI don't think you can't be trained to use your \"wrong\" hand. But it takes extensive training, far more than using your natural hand would.\n\n"
    },
    {
      "time": "13 Oct 2007 — 12:41pm",
      "content": "<cite>&gt;&gt;&gt;the right hand usually gets the task of playing the more complex melodies</cite>\n\nNo, that's only true for special arrangements for beginners. In \"real\" piano scores the melody often moves seamlessly from one hand to the other and the chords are arranged as complex or even more complex as the melody. (The melody is usually just one or two notes, but the chords are 3 to 5 notes at the same time, which is far more difficult to play.)\n\n<cite> &gt;&gt;&gt;The left hand is of course used in guitar playing too, but its job is simpler, holding down the strings.</cite>\n\nNo, with the usual guitar the right hand has just to learn to the position of the six strings, but the left hand has to perform a huge number of complicated patterns of chords pressed down over six strings and up to 4 or 5 frets.  \n(That's why I said it's stupid that left-handed players change their guitar position. They miss their advantage.)\n\n<cite>&gt;&gt;&gt;I don’t think you can’t be trained to use your “wrong” hand. But it takes extensive training, far more than using your natural hand would.</cite>\n\nBut why is that? There's again an easy answer.  \nEven if there would be a gene to become left-handed or right-handed, there is no such thing as an imprinted knowledge how to press guitar strings or how to learn to write with the right hand. Like I said: It's all just training. And the training of fine motor skills works equally with both hands. What should cause this to be not equal? I can't think of any plausible reason.  \nOf course people \"think\" that they can learn something more easily with one hand. But why? Because they have already trained it more, so they just have to go the extra mile and don't have to start over with their \"weak\" hand.\n\n"
    },
    {
      "time": "13 Oct 2007 — 2:02pm",
      "content": "\\>it’s stupid that left-handed players change their guitar position. They miss their advantage.\n\nToo bad about Jimi Hendrix and Paul McCartney. And to think, they coulda been great :)\n\n"
    },
    {
      "time": "13 Oct 2007 — 4:40pm",
      "content": "On that note, Jerry Garcia lost the middle finger off his right hand when he was five. If people could train their bonus hand just as well, why didn't Jerry? He played guitar right-handed all his life. Hmmmm.\n\n"
    },
    {
      "time": "13 Oct 2007 — 6:27pm",
      "content": "<cite>And the training of fine motor skills works equally with both hands.</cite>\n\n[Sigh...] one of the things I both love and hate about this forum is that no matter how thumpingly obvious something is (some people are born righties, some lefties) somebody here will ALWAYS take the contrary position.\n\n"
    },
    {
      "time": "13 Oct 2007 — 6:42pm",
      "content": "I'm with you on that point. It's thumpingly obvious to me you have a great deal of uncommon sense, Pattyfab.\n\nEileen\n\n"
    },
    {
      "time": "13 Oct 2007 — 7:10pm",
      "content": "It's interesting to read everyone's comments. Rather that saying that left-handedness was in my genes, I should have said that it runs in my family. I agree that handedness is probably the result of a combination of genetics, environmental factors, and individual learning, which really muddies the waters when one tries to discuss it. Still, it fascinates me that the vast majority of the human population ends up strongly right handed. There must be something to that.\n\nI agree with Ralf that most of us can learn to do a variety of things with either hand. I use a right-handed computer mouse, prefer [right-handed desks](http://web.archive.org/web/20131019050406/http:/www.handedness.org/action/fairdesks.html) (although I carry a clipboard to compensate for the odd shape and small writing area), play right-handed musical instruments without complaint (but also without much skill), and so on. I use right-handed scissors with my left hand, but some scissors are so right-handed (sharp contours for right hand fingers and thumb) that I can't use them.\n\nMy right handed father-in-law practices forcing himself to do things with his left hand--he's a neurophysicist and believes that such exercises may help him retain normal functioning in the event of brain damage. There's a wonderful book by Jeffrey Schwartz called _The Mind and the Brain: Neuroplasticity and the Power of Mental Force_. The author, a neuropsychiatrist, doesn't address handedness specifically, but he does talk about the brain's ability to adapt as a result of conscious training, as when stroke victims teach themselves to use limbs they can no longer feel. I have no problem believing that any of us could strengthen the neural pathways related to our non-dominant hands, if we invested enough time and effort.\n\nWhile there's no hard proof that genetics plays a role in predisposing people toward a certain dominance pattern, there is considerable evidence suggesting as much. Left-handed parents are significantly more likely to have left-handed children than right-handed parents are, and this effect holds up even among adopted children. And, for the first time ever, scientists earlier this year identified a specific gene that may influence handedness: [LRRTM1](http://web.archive.org/web/20131019050406/http:/www.nature.com/mp/journal/vaop/ncurrent/abs/4002053a.html). But handedness is complex, and no one is near figuring it all out.\n\nI'd be interested to know whether the distribution of handedness among the Typophiles differs significantly from that of the general population, although such a study is probably not feasable. I was once in a French class where almost half the class was left-handed. I don't know what that means, if anything, but the probability of it occurring by chance must be relatively low.\n\nPatty,\n\nThanks for all the interesting information. It's interesting to hear of a righty who writes with a hooked hand. Are there any advantages to that approach?\n\nGary,\n\nI have the same problem with baseball (maybe because I've never tried to work on my catching). I wonder how common it is for people to write with the left hand but throw with the right?\n\nThanks everybody for the interesting discussion.\n\n"
    },
    {
      "time": "13 Oct 2007 — 7:48pm",
      "content": "Aric,\n\nI can't think of any advantages to the way I hold a pen, it's just what feels natural to me. But I read somewhere that a hooked grip reflects the influence of the other side of the brain. I can't remember where I read it tho.\n\nAnother interesting question - writing from left to right, as most western cultures do, probably stems from right-handedness - your hand doesn't smudge the ink that way. But I wonder why some languages, such as Hebrew, developed writing the other way around. Were there more lefties in ancient Israel?\n\n"
    },
    {
      "time": "13 Oct 2007 — 9:19pm",
      "content": "Hebrew was originally chiseled in stone. Holding a chisel with the left hand and hammering with the right lent itself to ergonomically writing right to left.\n\nSo, interestingly, it would seem that Hebrew also stemmed from right-handedness.\n\n"
    },
    {
      "time": "14 Oct 2007 — 12:57am",
      "content": "<cite>somebody here will ALWAYS take the contrary position.</cite>\n\nIt's not like I am trying to come up with an opposite position. I just play the piano and the guitar and know how this works. And my thoughs about using both hands equally come from my life-long experience of excercising this idea. I didn't made this up yesterday. I gave this a lot of thought.  \nI don't expect anyone who uses mainly one hand to believe my theory just be reading this discussion. But I would suggest everyone to try their \"wrong\" hand once in a while. Maybe then they will realize there is some truth in that.\n\n"
    },
    {
      "time": "14 Oct 2007 — 5:27am",
      "content": "well, guys, nice article, i can write and draw with both hands, mostly i use my right hand, in the test i got \"53.8 Placing this subject in the 1st right decile.\" well i also agree with Herrmann it is clearly how often you exersice you \"wrong\" hands \"precision movement\"\n\n"
    },
    {
      "time": "14 Oct 2007 — 8:07am",
      "content": "And I'm not disputing that you can train your \"wrong\" hand to perform at a pretty high level. After all, I'm touch-typing as I write this and most of the more commonly used keys are on the left side of the keyboard. But I maintain that we are born with a preference and yes, \"because it's easier\" most people just use that same hand both for fine motor stuff and strength.\n\nWhen I was a kid I tried to teach my self to write left-handed. I got so it was legible but never very fluid. It is nice to have activities such as guitar or even yoga that force you to use both.\n\nIt would be interesting to know how handedness works in other animals - how it evolved and why.\n\n"
    },
    {
      "time": "14 Oct 2007 — 4:32pm",
      "content": "Well, I took the test, and according to the test I'm 100% right-handed ... but I use the mouse with my left hand. I step with the left foot first, and always use the left ear when talking on the phone. My father, sister, and daughter are left-handed.\n\n"
    },
    {
      "time": "15 Oct 2007 — 2:51am",
      "content": "elizabeth\\_355 and Quincunx and others point out some of the shortcomings of the Edinburgh inventory; there are so many things that we could do with one hand that it would be impossible to list them all (and the survey would quickly become boring). With the exception of writing, the list of items seems somewhat arbitrary. I haven't read up on the inventory enough to know how the particular items were chosen, or how well they predict lateralization of language functions. It's possible that a different set of questions might yield quite different scores, especially for people who are mixed-handed to some extent.\n\nOne of the uses for the Edinburgh survey in neuroscience is to weed out potential research subjects whose brains may be organized in a non-standard way. In the vast majority of right-handed people, key language centers are located in the left hemisphere; a larger percentage of lefties (but still a minority) have these language centers in the right hemisphere, or in both hemisperes. FMRI research involves looking in certain places in the brain for neural activity in response to stimuli, and usually the assumption is made that all subjects' brains are organized in roughly the same way. The only sure way to validate this assumption would be to actually examine each subject's lateralization, via a [Wada test](http://web.archive.org/web/20131019050406/http:/en.wikipedia.org/wiki/Wada_test) or something similar. But that would be expensive and time-consuming and expose subjects to unnecessary risks and discomfort, and in the end the researchers would find out that almost all right-handed subjects had the same lateralization (while a minority of the left-handed ones showed other patterns). So whaddaya do? Administer a handedness inventory and only accept participants with a score close to +100. For this particular job, the imperfections of the Edinburgh inventory aren't terribly problematic.\n\n"
    },
    {
      "time": "15 Oct 2007 — 3:22am",
      "content": "Patty,\n\nThe question about Hebrew and Arabic is interesting, and I don't have a really good answer. Both derive from the Phoenician script, which was also written right to left. The Phoenicians had access to clay tablets (a la cuneiform), papyrus, metal plates, and animal skins, as well as stone, as Eileen mentioned. I imagine the early Hebrews had access to the same implements; seems like they wrote on a lot of scrolls. If the tools most frequently used for writing worked better by being pushed than by being pulled, as perhaps with a chisel, that might incent a right-handed populace to write from right to left.\n\n"
    },
    {
      "time": "15 Oct 2007 — 2:25pm",
      "content": "Interesting discussion, Ralf's contrariness aside. Just because there has yet to be found a specific gene for left-handedness doesn't mean it's not there -- there are lots of other genetic predispositions that can't be nailed to one place on one gene. Yet. There are lots of other more pressing genetic issues to explore at the moment.\n\nI wrote better with my left than my right as a kid, and as others have noted, there was a time when lefties were punished for being sinister, although I wasn't -- I think I just got tired of smearing the ink in my copybook. ;-)\n\nBut I still do a lot of things lefty: sure makes being a two-handed beverage consumer more efficient, for example....\n\n"
    },
    {
      "time": "15 Oct 2007 — 6:04pm",
      "content": "I've been right-handed since I can remember, but I use my left foot to kick, I used my left-eye in the viewfinder (used because now I don't use the viewfinder), and I'm pretty sure I prefer starting out on my bike with my left foot too. I think it is about what works.\n\n"
    },
    {
      "time": "15 Oct 2007 — 10:30pm",
      "content": "According to the test I am 100% left-handed, no surprise there. When I started to write as a child, my writing was mirrorlike, from right to left, inversing all the letters. In first grade at school, the teachers tried to train me to use my right hand, mostly by giving me very low grades each time they caught me using the left hand, but they also gave me low grades when I wrote with my right hand, because my writing was considered too clumsy. So I went on using my left hand and finally they gave in.\n\n"
    },
    {
      "time": "16 Oct 2007 — 10:36am",
      "content": "Score 60.0.\n\nI consider myself as left-handed, although the only things I do with my left hand is writing, drawing and sometimes eating. Basically, the more \"precise\" the task is the more I use my left hand. If there is more strenght needed (throwing etc.), I use my right hand.\n\nAs for the Patty-Ralph debate I'm on Patty's side. I was born \"lefty\" as my mom told me I always preferred to use my left hand. At some point I was \"forced\" to use my right hand for writing as I was smearing ink but nature was stronger :) My parents are both right-handed...\n\n\\_\\_  \n [AL](http://web.archive.org/web/20131019050406/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "17 Oct 2007 — 5:17am",
      "content": "\"Hebrew was originally chiseled in stone.\"  \nI learn something every day.\n\nCheers!\n\n"
    },
    {
      "time": "17 Oct 2007 — 6:53am",
      "content": "<cite>Hebrew was originally chiseled in stone.</cite>\n\nDo we actually know this? Or is it merely that the oldest surviving examples of Hebrew are stone tablets? Paper was invented centuries or millennia before any of the existing Hebrew samples, is it not possible they wrote on paper too and it didn't survive?\n\nI don't know, just wondering. And did the Egyptians write from left to right or the other way round?\n\n"
    },
    {
      "time": "17 Oct 2007 — 11:06am",
      "content": "I have to echo Patty's question. Not necessarily because I'm a doubting Thomas, or Tiffany, but that when a statement like this is made it should be, in the very least, backed up by a link or two directing us to reputable sites. This kind of information would be great to add to the wiki, but without a good bibliography I don't know if it should be.\n\n"
    },
    {
      "time": "17 Oct 2007 — 12:16pm",
      "content": "Here's a test...do you use your left or right brain.\n\n[http://www.news.com.au/heraldsun/story/0,21985,22556281-661,00.html](http://web.archive.org/web/20131019050406/http:/www.news.com.au/heraldsun/story/0,21985,22556281-661,00.html \"http://www.news.com.au/heraldsun/story/0,21985,22556281-661,00.html\")\n\n"
    },
    {
      "time": "17 Oct 2007 — 12:29pm",
      "content": "There is a common misunderstanding with chiseled type: The stonecutters didn't made the shapes, they just chiseled along a preparatory drawing. The same is true for the Roman Capitals. The shapes (for example the serifs) have their origin in brush writings not in the chiseling itself. Looking at the shapes in the Hebrew alphabet, I would guess the same is true here.\n\nAncient Egypt had different writing systems. Which is not surprising, because we speak of several thousand(!) years. Egyptian hieroglyphs were set left to right, right to left and top to bottom. There were also cursive hieroglyphs and later the right to left scripts Hieratic and Demotic.\n\nThe Greeks wrote left to right, right to left and very often »boustrophedon«, where the direction changed in every line. That's why several of our letters got a symmetrical shape, like M which looked very differently in the Phoenician Alphabet.\n\n"
    },
    {
      "time": "17 Oct 2007 — 12:44pm",
      "content": "\\>Hebrew was originally chiseled in stone.\n\nThe original Hebrew script has straight lines, but in those ancient days, according to what I read, they had both clay and waxed tablets that they wrote in with a stylus. I seriously doubt that they normally wrote whacking away with a chisel and stone, even though they did that for monuments. The current alphabet is a pen-based script which they picked up during the exile in Babylonia (6th century BCE), and switched to. The current letters are written left to right, even though they are laid down right to left.\n\n"
    },
    {
      "time": "17 Oct 2007 — 2:26pm",
      "content": "<cite>I seriously doubt that they normally wrote whacking away with a chisel and stone, even though they did that for monuments.</cite>\n\nI can't help picturing Fred Flintsone at this point.\n\nDid they not use paper)? We know they did eventually with the Dead Sea Scrolls but isn't it possible, given the proximity to Egypt, that papyrus or some equivalent was in use earlier?\n\nOf course since most of the population was probably illiterate there may not have been huge demand for written material outside of monuments or official documents which may have been those clay and waxed tablets.\n\n"
    },
    {
      "time": "17 Oct 2007 — 2:54pm",
      "content": "The development of the Hebrew script. From [Early History of the Alphabet: An Introduction to West Semitic Epigraphy and Paleography](http://web.archive.org/web/20131019050406/http:/www.magnespress.co.il/website_en/index.asp?category=179&id=1102) Joseph Naveh (1987, Magnes Press / The Hebrew University of Jerusalem):\n\n1. Gezer Calender ( limestone). 2. Mesha stele (Moabite Stone). 3. Siloam inscription. 4 7th century BC seals. 5. Early 6th century ostracon from Arad. 6. 2nd centurey BC Leviticus fragment. 7. Medieval Samaritan bookhand\n\n ![](http://web.archive.org/web/20131019050406im_/http:/typophile.com/files/hebrew-script_5538.jpg)\n\n"
    },
    {
      "time": "17 Oct 2007 — 3:22pm",
      "content": "A Jeremiah (Yirmeyahu) text — Qumran (cave # 4):\n\n ![](http://web.archive.org/web/20131019050406im_/http:/typophile.com/files/bible-j_5034.jpg)\n\n"
    },
    {
      "time": "18 Oct 2007 — 6:28am",
      "content": "David, does that book address the question of writing media? My guess is that the switch to Aramaic script coincided with a switch from stylus on clay and wax to pen and paper. But I don't know.\n\n"
    },
    {
      "time": "24 Oct 2007 — 3:21am",
      "content": "Here is very interesting talk by Jeff Hawkins about how the brain works:  \n [http://www.ted.com/index.php/talks/view/id/125](http://web.archive.org/web/20131019050406/http:/www.ted.com/index.php/talks/view/id/125 \"http://www.ted.com/index.php/talks/view/id/125\")\n\nWhat reminded me of this discussion of handedness were Hawkins examples of facts that are \"thumpingly obvious\" to everybody but still were wrong, because they were so obvious that nobody was able to step back and see the bigger picture. One of his examples was the Heliocentric Solar System. Back then it was very obvious that the sun goes around the earth, because no one felt the earth moving at incredible speed thru the universe, but they saw the sun going up and down on the sky every day. The ones who studied the paths of the planets and stars found very confusing data. They couln't understand it, because they tried to fit it in the wrong theory. But once the framework was understood all the confusing data was suddenly easy to explain.\n\nIn my humble opinion the same is true for the discussion of handedness. It seems obvious that we are born with a preference for one hand, but there is already enough data to have at least doubts in this theory. Just consider the fact that a very high rate of identical twins don't have the same handedness. To me, this makes it obvious that there must be something wrong with the theory, but some scientist even try desperately to squish those facts in their old theories instead of coming up with a new one.  \nOnce they would embrace the fact that handedness \"develops\", suddenly all the data would become easliy explainable. You could explain the handedness of identical twins; you could explain why people like me or skilled musicans or surgeons have no problem at all training both hands equally; why there are more young lefties than old lefties; why crabs become left- and right-handed with a rate of 50:50; and so on and so forth. It could be so simple …\n\n"
    },
    {
      "time": "24 Oct 2007 — 5:46am",
      "content": "<cite>It could be so simple …</cite>\n\nYeah but it's not. You still have not explained why, in your magical world where our hands are equally adaptable, anybody at all would \"choose\" to be left-handed. Are you saying that 10% or whatever of infants decide to be rebellious straight out of the womb? And why would my father would persist in using his left hand when his teachers etc tried to \"train\" him out of it?\n\nThe point I have been _trying_ to make is that handedness may not be specifically genetic, or attributable to just one gene. But that doesn't mean it doesn't exist. It could have to do with brain development in the womb or something.\n\n[http://www.drspock.com/article/0,1510,5817,00.html](http://web.archive.org/web/20131019050406/http:/www.drspock.com/article/0,1510,5817,00.html \"http://www.drspock.com/article/0,1510,5817,00.html\")\n\n"
    },
    {
      "time": "24 Oct 2007 — 6:59am",
      "content": "<cite>You still have not explained why, in your magical world where our hands are equally adaptable, anybody at all would “choose” to be left-handed.</cite>\n\nI think that's the wrong question. It rather should be: When it's not genetic and we could use both of our hands equally, why aren't their 50 % lefties? In my theory the handedness develops in in the first years after a child is born. And obviously a child doesn't make this choice intentionally in terms of how appropriate this might be for a mostly right-handed society. They start to explore the world with their hands. And once they gained some fine motor skills with one hand, there is no need to train the other hand equally, because they already know to handle their toys or whatever. (I already explained this at the beginning of this discussion.)  \nMy non-scientific belief is, that if we would remove all outside or parental influence on children, we would end up with 50 % lefties and 50 % righties. That's exactly what happens with some animals like crabs. They need to learn motor skills and they develop a handedness. But since they are not tought how to do it, and they don't learn it by adapting their parents behaviour, they choice can go both ways. And so the rate is always 50:50.\n\n<cite><br>\nAnd why would my father would persist in using his left hand when his teachers etc tried to “train” him out of it?<br>\n</cite>\n\nIn my opinion that's a different story. We have to be careful not to mix up the REASONS that cause handedness with the EFFECTS it has on our brains. You already mentioned brain lateralization. I don't deny all those effects, but I believe they are effects, not causes.\n\n<cite><br>\nIt could have to do with brain development in the womb or something.<br>\n</cite>\n\nPossible. But isn't it much more likely that it happens in the moment we start to use (-\\>train) our hands?\n\n"
    },
    {
      "time": "24 Oct 2007 — 7:40am",
      "content": "We obviously won't agree on this and I'm not going to pursue it further however obvious it seems to me.\n\nI just want to raise again the comparison of homosexuality - which also seems to involve about 10% of the population (except of course Iran, according to it's loony prez). Some argue it's genetic, others insist it's a choice. Nothing is proven. We are obviously born capable of being either homo- or hetero-. In many societies homosexuality is considered a sin, or even a punishable crime. And yet there are homosexuals. In previous generations (and probably still today if you consider Senator Larry Craig) people would try to \"train\" themselves to be straight, even marrying and having kids. And yet...\n\nSo there are obviously behaviors or whatever you'd call them that are too complex to be attributed to simple nature or nurture. I'm going to repeat the quote that - to me - sums up this debate:\n\n”Handedness is a complex behavior,” Dr. Geschwind said, ”and no complex behavior has ever been shown to be due to only a single gene without any environmental influence.”\n\n"
    },
    {
      "time": "24 Oct 2007 — 9:02am",
      "content": "\"Hebrew was originally chiseled in stone.\"  \n\"Do we actually know this?\"  \nI was kidding. This was so obviously a faulted statement, I didn't bother to respond.\n\n”Handedness is a complex behavior,” Dr. Geschwind said, ”and no complex behavior has ever been shown to be due to only a single gene without any environmental influence.”\n\nand if the above is true, then: \"I refer to is my belief that people are born with a predilection to favor one hand over the other.\"  \n...must be a faulted belief.\n\nCheers!\n\n"
    }
  ]
}
