{
  "id": "38051",
  "title": "First Font - Meridian",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi!\n\nThis is my first post on this Forum and more importantly my first ever attempt at designing a font.\n\nI've only been working in Illustrator at this point because I don't have any Font software yet (Are there any advantages to working in a specialist font application at this early stage of the design process?).\n\nI would appreciate it if you would be willing to have a look at my attached document and give me some critique. I'd also like to know if there are any similar fonts to this already - if there are then I don't really want to waste anybody's time.\n\nI'm hoping to use the font for Logos and possibly some document headings.\n\nLooking forward to your critique so that I can improve this.\n\nThanks in advance!\n\nSam\n\n| Attachment | Size |\n| --- | --- |\n| [Meridian-Font-1.0.pdf](http://web.archive.org/web/20150123124820/http:/typophile.com/files/Meridian-Font-1.0.pdf) | 21 KB |\n\n",
  "author": "shorecreative",
  "time": "13 Oct 2007 — 9:21am",
  "uid": "22747",
  "comments": [
    {
      "time": "13 Oct 2007 — 10:23am",
      "content": "Hi Sam  \nYou should think about the pen-metaphor used in the construction of the characters. Take for instance K and compare it to the other charaters - it's upside down. In general you should be more consequent with the stem- and stroke widths. Compare eg. M with V. The S is really out of character with the rest, and I think it's because you try to force the squarish concept. Other characters that suffer somewhat from this are BCG.\n\n"
    },
    {
      "time": "13 Oct 2007 — 10:23am",
      "content": "Hi Sam, as a first attempt your Meridian is very promising. I do think you might want to have a look at the upper-right corners of letters such as BCDEGOPQR, to me the curve looks too steep. Same thing with the upper-left corners of HIJKLMNUVWXY.\n\nAlso, I know it’s hard to come up with font names but if you intend to put out Meridian on the retail market I think you’d be better off renaming it to something else to avoid confusion with Adrian Frutiger’s own [Meridien](http://web.archive.org/web/20150123124820/http:/www.myfonts.com/fonts/linotype/meridien/).\n\n(BTW: I’ve been in Liverpool for a couple of days last month, nice city!)\n\n"
    },
    {
      "time": "13 Oct 2007 — 11:33am",
      "content": "Thanks to you both for your comments. It sounds like I have a lot of work to do.\n\nClauses - I'm obviously a real novice at this as I can't even understand/see what you mean when you say the \"K\" is upside down?  \nI understand the problem with the Stem and Stroke widths so I'll start working on that first.\n\nVerbosus - When you say \"the curve looks too steep\" do you mean that the radius should be tighter (smaller/more square) or bigger (more round)?  \nI'm not thinking of this becoming commercial at this stage but thanks for letting me know about the other font name. And if you're ever in Liverpool again, you're welcome to visit my studio.\n\nSam\n\n"
    },
    {
      "time": "13 Oct 2007 — 11:48am",
      "content": "Hi Sam. In the K the arm should be thin and the leg should be thick, not the other way around. That would be the logical outcome of using a broadnip pen to draw the letterforms – think calligraphy.\n\nThere is a very good website about typedesign by Briem here: [http://briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm](http://web.archive.org/web/20150123124820/http:/briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm \"http://briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm\")\n\nand a good guide on handwriting/calligraphy here: [http://briem.ismennt.is/4/4.1.1a/4.1.1.1.quick.htm](http://web.archive.org/web/20150123124820/http:/briem.ismennt.is/4/4.1.1a/4.1.1.1.quick.htm \"http://briem.ismennt.is/4/4.1.1a/4.1.1.1.quick.htm\")\n\nHope it helps...\n\n"
    },
    {
      "time": "13 Oct 2007 — 11:55am",
      "content": "Claus,  \nI will read the link - it looks just what I need.  \nThanks for clarifying the K issue.  \nSam\n\n"
    },
    {
      "time": "23 Oct 2007 — 3:55am",
      "content": "Hi Sam.\n\nSome of your curves (let's take for instance G top right) are not italicised. They are just round. And they clash with italic form of your characters.\n\nSome of the letters are nice like: A,D,E,F,H,I,J,L,M,N,W,X,Y and Z. Others need more work to complement the later.\n\n"
    },
    {
      "time": "24 Oct 2007 — 6:54am",
      "content": "Thanks Litera, I'll take that on board in the next revision.  \nSam\n\n"
    },
    {
      "time": "25 Oct 2007 — 8:31am",
      "content": "\\>I’ve only been working in Illustrator at this point because I don’t have any Font software yet (Are there any advantages to working in a specialist font application at this early stage of the design process?).\n\nI'm not a pro of drawing letters, lots of typophile members are great one, but at my point of view, That depends on your objective. If it is to draw a complete typeface family I' strongly suggest to use a drawing typeface software, you'll take advantage of it's special feature. If it's to draw some letter for a logo, without any objective of getting a typeface you could continue with Illustrator. I've made the switch from Illustrator to Fontlab, two years ago and I never regret my choice. I continue to work with Illustrator for some specific needs in illustration, but for the typeface I work on, my typeface drawing software is really suit for. For instance, with FL, you'll be able to fix the kerning, the spacing or hinting, some action that Illustrator can not do. Hoping that will help you. Good luck.\n\n"
    },
    {
      "time": "25 Oct 2007 — 1:32pm",
      "content": "Thanks Sim, I'll check out the software.\n\n"
    },
    {
      "time": "1 Nov 2007 — 8:37pm",
      "content": "Regarding your concern that this design might already exist, I am not sure it pays to worry overly about that. Just learn how to see the forms and get them working together - that's a big enough challenge. And in the case of fonts with this style generally it's a standard that is rarely met. Quality always wins.\n\n"
    }
  ]
}
