{
  "id": "38061",
  "title": "Roman fonts on Chinese packaging",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20080208031410im_/http:/typophile.com/files/cordyceps_4127.jpg)\n\n ![](http://web.archive.org/web/20080208031410im_/http:/typophile.com/files/fritillary_3433.jpg)\n\nI’ve become fascinated with the odd fonts you see on Chinese packaging, particularly in herbal medicine shops. Some of the designs use stock western fonts, but there are fonts I’ve never seen anywhere else, and some have a delightful slightly off-kilter spidery look that probably comes from being designed by someone whose natural idiom is not the Roman alphabet.\n\nHas anyone seen any articles about these fonts, or websites or listings?\n\n [‹ NYC Bookstores](http://web.archive.org/web/20080208031410/http:/typophile.com/node/38042 \"Go to previous forum topic\") [Elsner + Flake Family Variants Explanation ›](http://web.archive.org/web/20080208031410/http:/typophile.com/node/38053 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080208031410/http://typophile.com/user/13035\" title=\"View user profile.\">elzadra</a>",
  "time": "<br>",
  "uid": "13035",
  "comments": [
    {
      "time": " 14.Oct.2007 8.13am",
      "content": "Well, eventhough if focuses only on the hilarious English spelling errors made in Eastern Asian countries, I wanted to mention [Engrish.com](http://web.archive.org/web/20080208031410/http:/www.engrish.com/). :)\n\n"
    },
    {
      "time": " 14.Oct.2007 8.23am",
      "content": "Reminds me of the slowly disappearing Chinese grill bars in Denmark. A lot of them used these d.i.y. boards – fantastic stuff, I love it.\n\n ![](http://web.archive.org/web/20080208031410im_/http:/typophile.com/files/kinagrill_3994.jpg)\n\n"
    },
    {
      "time": " 14.Oct.2007 11.50am",
      "content": "[Chinese Rocks](http://web.archive.org/web/20080208031410/http:/www.typodermic.com/10.html) was based on hand cut lettering from Chinese wholesale containers. From the looks of the original lettering I’d say it was made using hand-cut rubber - similar to the rubber in a rubber stamp. I think they used a tampo machine but only Chinese factory workers know for sure.\n\nI’ve seen the same lettering recently on a box of machine dies (make your own bolts, threaded rods etc.) in an antique shop. Check out the numeral 2 - I’ve seen a similar style of 2 stamped on Chinese bike wheel rims.\n\nAnother common feature of Chinese roman lettering is chopping or raising letters with descenders. Descender chopping isn’t restricted to China as anyone who’s played Japanese RPG games can attest.\n\n"
    }
  ]
}
