{
  "id": "38069",
  "title": "Deva Ideal",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150323154156im_/http:/typophile.com/files/deva_ideal_580x85_4534.gif)\n\nHello.  \nI know that this is maybe forum for the developing the typefaces. But I´ve just finished her after more than 2 and half year.  \nDeva Ideal is also greeting and sending type kisses to Typophile!\n\nJán Filípek\n\nI was not able to attach pdf, so here is only external link  \n [http://dizajndesign.sk/subory/fonts/deva\\_ideal/Deva\\_Ideal\\_specimen.pdf](http://web.archive.org/web/20150323154156/http:/dizajndesign.sk/subory/fonts/deva_ideal/Deva_Ideal_specimen.pdf)\n\n",
  "author": "DizajnDesign",
  "time": "14 Oct 2007 — 2:24pm",
  "uid": "22763",
  "comments": [
    {
      "time": "14 Oct 2007 — 2:29pm",
      "content": "i saw this up on storm's site just a few minutes ago: i was going to wait until i got an announcement and then post it to the News section, but this is good of you to post. I think it's a beautiful type family! congratulations!\n\n"
    },
    {
      "time": "14 Oct 2007 — 3:18pm",
      "content": "Ján that is quite inspirational. Congratulations. Can you write a little bit about your process perhaps? What was the most difficult aspects of your design for instance? With such a large character set in that many cuts, some things must have been difficult to squeeze in there, yet it look so effortless.\n\n"
    },
    {
      "time": "14 Oct 2007 — 3:39pm",
      "content": "Very nice, good work. I love it. :)\n\n"
    },
    {
      "time": "18 Oct 2007 — 5:38am",
      "content": "The most difficult was to create the aesthetic of the typeface. It should be legible, but also unique. To choose, how these \"bent strokes\" should looks like. If they should be more visible, how they should bent. And also create the proportions of typeface (now i don´t mean the ideal proportion i used for metrics, but the harmony of characters) that will be unique.\n\nFor these two things, according to other readable sans serif, the feeling from typesetting is very soft. I thing this is more possible to see when you print her.\n\nTo expand character set, or create more styles was to invest a really much into creating them. I spend a lot of time on every character. And be very patient.\n\n"
    }
  ]
}
