{
  "id": "38071",
  "title": "Church identity and font licensing",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi.\n\nI’m creating the visual identity for a newly founded church. The main group is about 18-35 years old, mostly students and young families. We strive to not grow old (Don’t we all?), so I’ll probably aim the identity at 18-20 year olds. Everything needs to be kept as cheap as possible since we don’t have much money, but I really want to create something unique. Church design is, in general, terrible.\n\nAnyways, here’s my issue: We use type in many areas: Music lyrics for projector, Powerpoint presentations (yeah!) for projector, our website, interactive cd-roms and a lot of printed material. I intend to use Dolly as one of our base typefaces, but we can’t afford to buy a lot of licenses.  \nEx.: Everyone speaking in church is responsible for creating their own Powerpoint presentation, with the obvious dreadful result.  \nI’m going to set specific rules for typography and composition, but I can’t just e-mail everyone a commercial font like Dolly.\n\nAny suggestions? Should I use a “web safe” font like Georgia, since everyone probably have it, or should I look for a free font? (I know this probably isn’t a good place to ask for suggestions.) I read some place about creating styles in MS Word with specific names, and when you imported the documents into InDesign you could define different specifications for those styles. Is there something similar in Powerpoint?\n\n- Frode\n\n [‹ lowercase a tail](http://web.archive.org/web/20071121094232/http:/www.typophile.com/node/38284 \"Go to previous forum topic\") [Brochure point size puzzle ›](http://web.archive.org/web/20071121094232/http:/www.typophile.com/node/38212 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071121094232/http://www.typophile.com/user/17101\" title=\"View user profile.\">frode frank</a>",
  "time": "<br>",
  "uid": "17101",
  "comments": [
    {
      "time": " 14.Oct.2007 6.26pm",
      "content": "Remember the alphabet is a skeleton and the type style is a costume. Make the costume fit the occasion. Consider the backgrounds for type and work for contrast and legibility.\n\n"
    },
    {
      "time": " 14.Oct.2007 11.31pm",
      "content": "Thank you for the advice. I just spotted a horrible techno sans for music lyrics this sunday. I’ve really got some work to do:)\n\n"
    },
    {
      "time": " 15.Oct.2007 7.59am",
      "content": "I’m afraid I posted this to late last night. It never showed up on the frontpage during the day. If you can provide some help or suggestions, please post!\n\nCheers.\n\n"
    },
    {
      "time": " 16.Oct.2007 8.30pm",
      "content": "Often when a corporate identity package is created, one set of rules for designers and another for everyday use is specified. For instance, you might say that Dolly should be used on all events posters, committee logos, pamphlets, etc. and Georgia should be used for daily memos, correspondence, PowerPoint presentations, etc.\n\n- Lex\n\n"
    },
    {
      "time": " 18.Oct.2007 6.41pm",
      "content": "with all of the many ministries in a church, good luck getting everyone to abide by set standards. website, identity, and other more permanent things to be designed wont be a problem, but unless youre one of the only people designing in the church, i can see your rules being overlooked. i hope things work out though. its painful seeing such bad design in churches and on church material.\n\n"
    },
    {
      "time": " 21.Oct.2007 6.10am",
      "content": "Thanks. I know it’s a pain :)\n\n"
    }
  ]
}
