{
  "id": "38088",
  "title": "Fuss over cyrillic version of the EURO",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Bulgaria recently claimed that the proper Cyrillic spelling EBPO is to be adopted by the European Union. The argument is about the European Central Bank’s preference for EYPO in Cyrillic, which does not match the Cyrillic spelling of “Europe” in Bulgarian and Russian either. – Bulgaria is the only state within the EU which uses Cyrillic. (See more about [in this article](http://web.archive.org/web/20090809180313/http:/www.signographie.de/cms/front_content.php?idcat=1&idart=135) )\n\n",
  "author": "<a href=\"/web/20090809180313/http://typophile.com/user/17347\" title=\"View user profile.\">Andreas Stötzner</a>",
  "time": "<br>",
  "uid": "17347",
  "comments": [
    {
      "time": " 15.Oct.2007 8.26am",
      "content": "they’re going to be the ones actually using it, why not spell it the way they prefer?\n\n"
    },
    {
      "time": " 15.Oct.2007 9.12am",
      "content": "<cite>they’re going to be the ones actually using it</cite>  \nActually, the current [banknotes](http://web.archive.org/web/20090809180313/http:/www.ecb.int/bc/euro/banknotes/html/index.en.html) feature the Latin ‘Euro’ and the Greek ‘Ευρώ’. Maybe a Cyrillic version will be added in a future edition.\n\n"
    },
    {
      "time": " 15.Oct.2007 9.44pm",
      "content": "\\>they’re going to be the ones actually using it, why not spell it the way they prefer?\n\nBulgaria is the first “Cyrillic country” to join the EU. If others join should the Bulgarian spelling be the only one used on the bank notes? Or should additional spellings be used too?\n\nCyrillic is a bit dull - I’m waiting to see Arabic be required to support “European” languages.\n\n"
    },
    {
      "time": " 15.Oct.2007 9.55pm",
      "content": "_should additional spellings be used too?_\n\nSurely the language of a document determines its spelling.  \nSo if you’re writing about the Euro in Bulgarian, or printing a Bulgarian banknote, you would use the Bulgarian spelling.\n\n"
    },
    {
      "time": " 16.Oct.2007 1.57am",
      "content": "Nick you’ve seen the notes, right? They’re not specific to a country but are EU-wide. Currently EURO is written in both the Latin alphabet and the Greek.\n\n[http://www.euro-all.de/image/notes/euro500v.jpg](http://web.archive.org/web/20090809180313/http:/www.euro-all.de/image/notes/euro500v.jpg \"http://www.euro-all.de/image/notes/euro500v.jpg\")\n\nTo follow this convention for Cyrillic you really have to come down on one spelling.\n\n"
    },
    {
      "time": " 16.Oct.2007 7.34am",
      "content": "_Nick you’ve seen the notes, right?_\n\nI’ve seen earlier ones that were printed by country.  \nI didn’t realize they had gone international.\n\nBut why spell it out when there is already a perfectly good Euro symbol?  \nWhere is the Euro symbol on the banknote?  \nAfter they made us go to all the trouble of including it in our fonts, and they don;t even put it on their money!\n\n"
    },
    {
      "time": " 16.Oct.2007 8.01am",
      "content": "<cite>I’ve seen earlier ones that were printed by country.<br>\nI didn’t realize they had gone international.</cite>\n\nNick, I guess you’re mixing up notes and coins. The coins share a [common front (or ‘obverse’)](http://web.archive.org/web/20090809180313/http:/www.ecb.int/bc/euro/coins/common/html/index.en.html), but have [different designs](http://web.archive.org/web/20090809180313/http:/www.ecb.int/bc/euro/coins/2euro/html/index.en.html) for the back (or ‘reverse’).  \nThere haven’t been national Euro notes ever.\n\n<cite>Where is the Euro symbol on the banknote?</cite>\n\nIt’s in the [security features](http://web.archive.org/web/20090809180313/http:/www.ecb.int/bc/euro/banknotes/look/html/index.en.html). There are no coins showing the €, afaik.\n\n"
    },
    {
      "time": " 16.Oct.2007 8.32am",
      "content": "_There haven’t been national Euro notes ever._\n\nI wonder where I got that idea.  \nPerhaps I recall seeing submissions for a Euro banknote design competition, from designers in different countries.\n\n"
    },
    {
      "time": " 16.Oct.2007 10.21am",
      "content": "I think the notes are printed in different countries. It’s indicated in the serial number.\n\nSee Wiki:  \n [http://en.wikipedia.org/wiki/Euro\\_banknotes](http://web.archive.org/web/20090809180313/http:/en.wikipedia.org/wiki/Euro_banknotes \"http://en.wikipedia.org/wiki/Euro\\_banknotes\")\n\n"
    },
    {
      "time": " 16.Oct.2007 2.33pm",
      "content": "If they use EYPO, they don’t need any new glyphs (they can reuse the EYP from Greek and the O from Latin), saving Europe a couple of Euro-cents.\n\n"
    },
    {
      "time": " 28.Mar.2008 3.20am",
      "content": "\\> “should additional spellings be used too?”  \n\\>  \n\\> Surely the language of a document determines its spelling.  \n\\> So if you’re writing about the Euro in Bulgarian, or printing a Bulgarian banknote, you \\> would use the Bulgarian spelling.\n\nI’m playing the grave-digger here with this old thread. (I came across it google investigating a matter).\n\nBut Banknotes are uniform, and in the Latin script a unification of spelling has been adopted on the banknotes as well. While in documents the Euro is referred to as euro, euras, euró depending on language (and some others), on the banknotes it only appears in the “euro” spelling.\n\nSo a unification within the cyrillic has a precedent. What should not happen, however, is, if all cyrillic countries were to use ЕВРО, ЕУРО (a mere transliteration of EURO) should not be considered.\n\n"
    },
    {
      "time": " 28.Mar.2008 4.31am",
      "content": "The names used for the euro in various European languages using cyrillic, at least according to [Wikipedia](http://web.archive.org/web/20090809180313/http:/en.wikipedia.org/wiki/Linguistic_issues_concerning_the_euro):\n\nBelarusian: ЕЎРА  \nBulgarian: ЕВРО  \nMacedonian: ЕВРО  \nRussian: ЕВРО  \nSerbian: ЕВРО  \nUkrainian: ЄВРО, ЕВРО\n\nFrom the article: “In standard literary Ukrainian ’euro’ is spelt евро (’evro’), although Russian-influenced євро (pronounced ’yevro’) is also possible and more common in large cities across the country, South-Eastern areas, and among Russophones.”\n\nBelarusian is the odd one out, it seems. I think the Belarusian pronunciation is basically the same as the pronunciation used by at least some Russian speakers, but the difference is that Belarusian uses phonetic spelling. It’s as if some hypothetical quasi-anglophone language with phonetic spelling used “yooro” for euro.\n\n"
    },
    {
      "time": " 28.Mar.2008 6.34am",
      "content": "Your “quasi-anglophone” analogy about Belarusian is not quite correct.  \nRussian pronunciation is ca. yévro/yévra, sometimes (seldom) yivró.  \nBelarusian is yewra.\n\nNote the difference V vs. W. Also that’s the one which is reflected in Belarusian orthography.\n\n"
    },
    {
      "time": " 28.Mar.2008 6.36am",
      "content": "Anyway, based on your evidence as well the form ЕВРО is mostly supportable (“majority spelling” cf. the “majority spelling” EURO variant for Latin script) vs a nonexistent ЕУРО.\n\n"
    },
    {
      "time": " 29.Mar.2008 12.33am",
      "content": "Szabolcs: You’re right, of course, if we’re talking about Standard Russian. I lazily glossed over what I meant, thinking [v] and [w] were similar enough for non-specialist purposes, but of course English speakers distinguish them very clearly.\n\nWhat I had in mind is the fact that some Russian dialects used the pronunciation [w] for в in certain positions instead of the more standard [v]. Refer to [this page](http://web.archive.org/web/20090809180313/http:/www.gramota.ru/book/village/map15.html) if you’re interested. It’s only in Russian, though.\n\nI was also trying to find if there was any justification at all for using the spelling ЕУРО, but it seems to have been dreamt up by Eurocrats.\n\n"
    }
  ]
}
