{
  "id": "38090",
  "title": "Calgary Typos: October Meeting",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Our monthly meet/greet/eat/show-and-tell happens this Wednesday from 6-9 p.m. at Kensington Pub.\n\nDetails @ [http://www.facebook.com/event.php?eid=7333385699](http://web.archive.org/web/20071017062614/http:/www.facebook.com/event.php?eid=7333385699 \"http://www.facebook.com/event.php?eid=7333385699\")\n\n [‹ Fuss over cyrillic version of the EURO](http://web.archive.org/web/20071017062614/http:/typophile.com/node/38088 \"Go to previous forum topic\") [Wood Floor Coverings ›](http://web.archive.org/web/20071017062614/http:/typophile.com/node/37960 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071017062614/http://typophile.com/user/14015\" title=\"View user profile.\">Linda Cunningham</a>",
  "time": "<br>",
  "uid": "14015",
  "comments": [
    {
      "time": " 15.Oct.2007 1.44pm",
      "content": "Is this open to anyone who wants to drop by?\n\n"
    },
    {
      "time": " 15.Oct.2007 1.48pm",
      "content": "I’d be interested to know just how many Calgary Typophiliacs there are... Chime in on this thread and/or list your compadres, please.\n\n"
    },
    {
      "time": " 15.Oct.2007 2.05pm",
      "content": "Hmmm... I know there were a few Calgary typophiles that I saw down in Seattle this summer. There must be a few Veer people kicking around here. I wouldn’t really know as I don’t really know a lot of people yet here in Calgary.\n\n"
    },
    {
      "time": " 15.Oct.2007 2.07pm",
      "content": "The more the merrier, Steve — last meeting, we ended up taking over half of that side of the bar. ;-) So long as you pick up your own tab (or, even better, pick up mine too!), we’d love to have you.\n\nWe had 10 last time, Tamye: it’s my understanding that one of our gang, who teaches at the local art college, is going to promote this to his students, so all bets are off as to how many will show up on Wednesday.\n\n"
    },
    {
      "time": " 16.Oct.2007 10.53am",
      "content": " ![](http://web.archive.org/web/20071017062614im_/http:/typophile.com/files/4CalTypos4_6723.gif)\n\nI’ve been away from Calgary, so I’m late posting the announcement. Thanks, Linda, for starting the thread.\n\nAnybody with an interest in type or typography is welcome. Our meetings aren’t very structured. Mostly just like-minded folk enjoying a beverage, some food, and type-geek conversation (wherever that leads).\n\nThere is a potential to make the meetings more structured and promote the type community in Calgary, but I don’t think we’re at that point yet. We only started these things this summer so we’ve got some growing to do.\n\nCheers, Ken\n\n"
    },
    {
      "time": " 16.Oct.2007 10.58am",
      "content": "Tamye, I’d be interested in knowing the number of typoholics we’ve got in Calgary as well.\n\nSteve, please do show up. Tell us about your impressions of TypeCon. Or of Seattle. Or of Helvetica.\n\nLinda, I throw a sheep at you :-)\n\n"
    },
    {
      "time": " 16.Oct.2007 1.55pm",
      "content": "I hate to do this to you guys again, but it looks like I’m doing some pickups on Wednesday. If we get done early, I might drop by.\n\n- Lex\n\n"
    },
    {
      "time": " 16.Oct.2007 2.09pm",
      "content": "you guys have all the fun.\n\n"
    },
    {
      "time": " 16.Oct.2007 2.26pm",
      "content": "Chuck, you’ve still most of tomorrow to arrange the flight. Bring your students. I’ll rent a mini-van :-)\n\n"
    }
  ]
}
