{
  "id": "3813",
  "title": "Veer Announces Exclusive Agreement with fStop Images",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "[Veer](http://web.archive.org/web/20131020085707/http:/www.veer.com/) Announces Exclusive Agreement with [fStop Images](http://web.archive.org/web/20131020085707/http:/www.fstopimages.com/)   \n   \nVeer becomes sole North American reseller to distribute noted collection that captures thirteen influential designers' visions of royalty-free   \n   \nCalgary, Alberta, October 28, 2002 - Veer, a provider of unique visual elements and design-related products, today announced that the company has signed an exclusive agreement to deliver the first collection of royalty-free images \"By designers for designers,\" fStop. Through this partnership, Veer brings creatives a diverse selection of imagery from the personal collections of 13 influential graphic designers, including David Carson, Jake Tilson and Rian Hughes.   \n   \nUnder the direction of Erik Spiekermann of FSI FontShop International, fStop was born out of a call to designers in the FSI network to submit images from their viewpoints. Characterized by bold compositions and typographical flair, titles in the fStop collection reveal unique, personal approaches to subject matter and photographic techniques. The images express the contributing designers' interests and influences - from genres such as film, music, and comic books - for an eclectic mix of imagery that   \noffers creatives much flexibility.   \n   \nVeer is highly attuned to creatives' needs for quality, innovative visual elements and continues to respond to their demand for new and exclusive products. The addition of the fStop library complements other exclusive offerings from Veer, including CSA Images and such world-premiere releases as the new minimalist typeface, Sylvia, by the Alias foundry.   \n   \n\"Veer is focused on bringing a discriminating selection of high-quality visual elements that resonates with those creating visual communications,\" said Drina Lazar, one of the founding partners of Veer. \"This agreement furthers Veer's mandate to deliver exclusive products from leading and emerging brands that help professional creatives push established limits and generate original concepts.\"   \n   \n\"Millions of photographic images are available. Too many of them are simply cliche and fail to appeal to designers. fStop is the first collection of pictures by designers for designers, organized as personal collections, rather than contrived themes,\" said Erik Spiekermann of FSI FontShop International. \"We are delighted to partner with Veer, a company that shares this same design-driven approach and upholds the creative values held by professional graphic designers.\"   \n   \nVeer offers 15 CD collections of royalty-free fStop Images, priced at US$499, which include super-high resolution files. Single images are available from the Veer web site, veer.com, and range in price from US$149 - $179. Veer also sells the fStop photography book at a price of US$15.\n\n",
  "author": "Joe Pemberton",
  "time": "29 Oct 2002 — 10:24pm",
  "uid": "1160",
  "comments": [

  ]
}
