{
  "id": "38167",
  "title": "Headline/Display versions of Univers?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "My first post...:-) I am not a design professional, but I’m certainly a type slut, so maybe I qualify as a typo-PHILE.\n\nI am looking for a pre-kerned headline/display version of Univers, is anyone aware of a possible solution? Something akin to the Nimbus Sans Novus Display versions of Neue Helvetica, or Scangraphics SH versions of many popular Grotesks. Yes, I could simply manually kern and range track my Univers 75 in a DTP program, but often in my work I can only use MS Word, so I find headline versions of many sans serifs very helpful to have handy.\n\nPurpose: I am constructing a template that will use a Univers/Glypha combination for the style. Old school.\n\n [‹ Is there a font like this striped X?](http://web.archive.org/web/20071219010115/http:/www.typophile.com/node/38050 \"Go to previous forum topic\") [Hamm's Beer logo brush style script ›](http://web.archive.org/web/20071219010115/http:/www.typophile.com/node/38234 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071219010115/http://www.typophile.com/user/22894\" title=\"View user profile.\">ryanholmes</a>",
  "time": "<br>",
  "uid": "22894",
  "comments": [
    {
      "time": " 20.Oct.2007 6.38pm",
      "content": "One problem I see is that you are working in MS Word. Not exactly known for it’s Kerning/Letterspacing efforts.\n\nIf you want a Univers (and I don’t remember any old Display Univers in the type shop...) I suggest you go to a Berthold version, if you can find one — though I don’t know if Berthold ever produced it for our computers (they had a version of it in good ’old typesetting days).\n\nAlso, URW had made one from their drawings and named it Unitus. It was very close to the same Univers that Cardinal Typesetters in NY use to use. (When they had, I think, Harris Typesetting equipment — after they got rid of their Alphatype equipment). Unitus is nicely drawn, works well, was digitized using their Ikarus program - and what more can I say.\n\n“Adobe’s” version seems to be the same as the later released Linotype version - so, no comment.\n\nBut do yourself a favor - get a real page layout program - and then you too can handle difficult kerning situations as they arise - just like the professionals.\n\n"
    }
  ]
}
