{
  "id": "38174",
  "title": "Splendid Grotesk",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi.  \nI'm planning to digitize this typeface, I was wondering if you have ever heard of, seen, or know any existing digital versions of it?  \nMy quick searches have only found talk of a script called Splendid, so I assume that if this grotesk design has already been converted it might be under a different name.\n\n ![](http://web.archive.org/web/20130206102319im_/http:/typophile.com/files/PICT0005_5318.jpg)\n\nIn the old type sample book I found, 'Splendid Grotesk' exists only in this \"extended\" form and in three different boldnesses. In the book there is separately another grotesk called 'Accidens' [sic] so I don't think it actually is from the same family.\n\nThis thin extended Akzidenz grotesk [Here](http://web.archive.org/web/20130206102319/http:/www.bleisetzer.de/cms/front_content.php?idcat=57&idart=665) seems to come very close to 'Splendid', but is given away by the lower case 'e'.  \nAlso, the bolder Splendids unfortunately not pictured here are even more distinctive from Akzidenz.  \nThe Akzidenz also lacks this special retro grotesk vibe I find exciting and rare in digital fonts nowadays...which can also be a regional thing and common to unique finnish grotesks designed for an occasion in 1920-1950 or something.\n\n",
  "author": "Erkki",
  "time": "17 Oct 2007 — 9:34am",
  "uid": "22220",
  "comments": [
    {
      "time": "17 Oct 2007 — 4:39pm",
      "content": "It looks similar to [Adrianna](http://web.archive.org/web/20130206102319/http:/www.myfonts.com/fonts/chank/adrianna/extended-light), but the proportions look a little better. It's sort of like an Engravers Gothic that's been Gothamized.\n\n"
    },
    {
      "time": "18 Oct 2007 — 4:19am",
      "content": "I'd say [Titling Gothic](http://web.archive.org/web/20130206102319/http:/www.fontbureau.com/fonts/TitlingGothicFB/styles) was closest...\n\nCheers.\n\n"
    },
    {
      "time": "18 Oct 2007 — 4:21am",
      "content": "Hi Erkki,\n\nThis looks like a typeface often found around 1900 under various names and from different foundries. They all got the \"pre-fab\" matrizes from Wagner & Schmidt, Leipzig (maybe they even made it to finland).  \nSeemann's Handbuch der Schriften (handbook of typefaces) lists Splendid-Grotesk on p. 203 as a face by the typefoundry W. Woellmer, Berlin. It is nearly identical with f.e. Breite halbfette Favourit-Grotesk (bold extended) by Weisert, Aurora-Grotesk by Weber, Edel-Grotesk by Wagner, Klassische Grotesk by Trennert, Elite-Grotesk by Poppelbaum Vienna, Viktoria-Grotesk by John, Merkur-Grotesk by Butter and Akzidenz-Grotesk by Haas, Switzerland. This last one should not be confused with Bertholds AG.\n\nThat is at least, what I can guess from the Word \"Hamburg\".\n\n"
    },
    {
      "time": "18 Oct 2007 — 6:00am",
      "content": "You can [check all of those online](http://web.archive.org/web/20130206102319/http:/www.global-type.org/Searching.743.0.html) at ‘Der digitale Seemann’, as this reference book is a part of Lars Kähler’s Global Type project.\n\n"
    },
    {
      "time": "18 Oct 2007 — 6:37am",
      "content": "Nebiolo, the biggest and most famous (defunct) Italian type foundry of the XX century used to have a version of the typeface you’re looking for, it was called Narciso. There’s a [picture](http://web.archive.org/web/20130206102319/http:/www.typophile.com/forums/messages/30/11608.jpg) of a specimen in [this past typophile thread](http://web.archive.org/web/20130206102319/http:/www.typophile.com/node/209).\n\n"
    },
    {
      "time": "18 Oct 2007 — 9:00am",
      "content": "Thank you all very much, Splendid does seem to be from Wilhelm Woellmer Foundry (marked \"W.W.\" in my type specimen book, and precisely credited in another). Narciso looks pretty much identical, plus the sample image Verbosus posted includes some lower case glyphs that my sample book didn't have.\n\nThis all has been very helpful. further comments are still appreciated of course!\n\n"
    },
    {
      "time": "18 Oct 2007 — 4:01pm",
      "content": "Good luck with your revival!\n\n"
    },
    {
      "time": "23 Oct 2007 — 2:49am",
      "content": "Have a look at the AT Gothic Extended:  \n [http://www.myfonts.com/fonts/agfa/atgothic-extended/](http://web.archive.org/web/20130206102319/http:/www.myfonts.com/fonts/agfa/atgothic-extended/ \"http://www.myfonts.com/fonts/agfa/atgothic-extended/\")\n\nIt comes close...\n\n"
    },
    {
      "time": "23 Oct 2007 — 8:47am",
      "content": "Hi All.  \nI’m planning to digitize this 2 typefaces that I found in old correspondance.  \nI was wondering if you have ever seen anything similar ou identical?\n\nThanks in advanced  \nAntónio\n\n ![](http://web.archive.org/web/20130206102319im_/http:/typophile.com/files/tipo_6514.jpg)\n\n"
    },
    {
      "time": "23 Oct 2007 — 8:49am",
      "content": "I'm sorry to post this here!  \nIt was a mistake...I really wanted to open a new forum topic...sorry!\n\nAntónio\n\n"
    }
  ]
}
