{
  "id": "38189",
  "title": "Taking illustrator file into indesign",
  "forum": "Build",
  "tags": [

  ],
  "content": "I want to take a illustrator file into indesign.\n\nBut when i do the text isnt a text box and each line is in its own box.\n\nIs it possible for each box of text to stay of box of text when taking a illustrator file into indesign?\n\nThanks alot\n\nTom\n\n [‹ OpenType features on by default](http://web.archive.org/web/20080422033419/http:/www.typophile.com/node/38209 \"Go to previous forum topic\") [Converting CMYK swatches to PMS spot colors ›](http://web.archive.org/web/20080422033419/http:/www.typophile.com/node/38205 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080422033419/http://www.typophile.com/user/20557\" title=\"View user profile.\">tomlobo</a>",
  "time": "<br>",
  "uid": "20557",
  "comments": [
    {
      "time": " 17.Oct.2007 4.54pm",
      "content": "Hi Tom\n\nIf you highlight the text with the type tool in Illustrator and then paste it into InDesign using the type tool it will remain as text.\n\nYou will loose all text formatting applied in Illustrator, however if you set up a character style in InDesign with the formatting that you want and select it before you paste, the pasted text will appear in that style. Alternatively paste the text and then apply the style.\n\nHope this helps\n\n"
    },
    {
      "time": " 17.Oct.2007 5.03pm",
      "content": "excellent, thanks alot!\n\n"
    },
    {
      "time": " 18.Oct.2007 3.03am",
      "content": "I was trying to do the same thing yesterday. I was quite surprised that you can’t just drag and drop, as both are Adobe programs.\n\nIt would be quite handy if one could drag and drop a few differently styled text blacks from Ai to Id without the need for reformatting wouldn’t it? - huh Adobe?\n\nBoth are very advanced programs, but I would have thought that this is rather a basic function.\n\nCan this be implemented in the next CS? Please?\n\nNick Cooke\n\n"
    },
    {
      "time": " 18.Oct.2007 8.27am",
      "content": "huh. that’s odd. i wonder why it would lose text formatting en route from AI to INDD, but not AI to PSD.\n\n"
    },
    {
      "time": " 18.Oct.2007 2.06pm",
      "content": "The reason that it works well between AI & PS, but not ID is that Illustrator & Photoshop share the same underlying text engine. InDesign has its own, which was tuned for much longer documents and more complex text flows.\n\n"
    }
  ]
}
