{
  "id": "38187",
  "title": "Dumb question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Okay, this is probably some really simple problem that I can’t figure out. See the attachment for what I am trying to achieve.\n\nHow do I make the logo, or any vector for that matter, do this positive/negative thing when placed over images?\n\nI placed the vector on a separate layer in InDesign, colored it white, and set the transparency to Difference or Exclusion. The vector appears black over the light colored background, but over the dark background it appears a gray.\n\n| Attachment | Size |\n| --- | --- |\n| [ea.jpg](http://web.archive.org/web/20071121093416/http:/typophile.com/files/ea.jpg) | 197.74 KB |\n\n [‹ typographic illustrator](http://web.archive.org/web/20071121093416/http:/typophile.com/node/38228 \"Go to previous forum topic\") [When you make an Ohorn ( U+01A1, U+01A0 ) ›](http://web.archive.org/web/20071121093416/http:/typophile.com/node/38218 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071121093416/http://typophile.com/user/5455\" title=\"View user profile.\">adnix</a>",
  "time": "<br>",
  "uid": "5455",
  "comments": [
    {
      "time": " 17.Oct.2007 4.33pm",
      "content": "I think InDesign is the wrong tool for the job. My pick would be Photoshop.\n\n"
    },
    {
      "time": " 17.Oct.2007 4.37pm",
      "content": "From looking at the image I’d say they didn’t use a filter. I think they did use something like Illustrator and cut the letters to match the shapes.\n\n"
    },
    {
      "time": " 17.Oct.2007 5.40pm",
      "content": "Difference blending mode, simply creates the inverse value, if the underlying image isn’t truly black or white the result will look gray.\n\nYou can achieve the effect in photoshop.\n\nCreate text on a new layer above the photo or image.  \nSet the text layer mode to ’difference’.  \nRasterize your text layer and and create a selection from that layer.  \nSelect the photographic layer with the selection still active, increase the contrast of the photographic layer ( will only affect the area beneath the text).\n\nThat should do it.\n\nIf you’re not familiar with photoshop, these instructions may seem a bit cryptic, be warned.\n\n"
    },
    {
      "time": " 18.Oct.2007 10.46pm",
      "content": "_I think they did use something like Illustrator and cut the letters to match the shapes._\n\nI agree... You can use the Pathfinder tools in Illustrator to divide an outlined shape (read: logo), apply colors, then bring it into Photoshop or InDesign.\n\n"
    }
  ]
}
