{
  "id": "38194",
  "title": "Helvetica Movie Messenger Bags",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I recently was able to see Helvetica at an AIGA event here in Salt Lake City. In the film there is some footage of the manufacturing of messenger bags made from vinyl signs. I can't remember the brand attached to them. Does anyone know where I might find out who manufactures them? Thanks in advance.\n\n",
  "author": "Arlo Vance",
  "time": "17 Oct 2007 — 11:53pm",
  "uid": "13604",
  "comments": [
    {
      "time": "18 Oct 2007 — 12:41am",
      "content": "[Freitag](http://web.archive.org/web/20141230010927/http:/www.freitag.ch/) is what you're after.\n\n"
    },
    {
      "time": "18 Oct 2007 — 5:04am",
      "content": "Speaking of Helvetica the Movie (in a roundabout no-one was sort of way) - I never did get to catch it at the cinema, but have had it pre ordered on DVD for a month or so which is allegedly due for release here in the UK on Nov 5th. Fireworks \\*and\\* a DVD! :)\n\nWhat's the general opinion of the piece from anyone who's seen it? Is it worth my camping underneath the letterbox with Pot Noodles and Kendall mint cake?\n\nsimon\n\n"
    },
    {
      "time": "18 Oct 2007 — 6:10am",
      "content": "Simon:  \nThe film was really nicely done, and entertaining to be sure. I thought there was a great amount of diversity among those who chose to speak about Helvetica. At the October 16th screening here in Toronto we were treated to a fresh-off-the-plane Stefan Sagmeister in the Q&A. The DVD is supposed to have an extra 90 minutes of material or something, so you get the coupon clippers award (a great award to receive!) for not spending money on an overpriced ticket and getting a great doc.\n\n"
    },
    {
      "time": "18 Oct 2007 — 6:32am",
      "content": "\\>What’s the general opinion of the piece from anyone who’s seen it?\n\nThere are plenty of reviews on typophile and elsewhere. As for the DVD I'm looking forward to seeing how well it transfers to the small screen. Helvetica really only works as a display face at large sizes, so it will be interesting to see it on TV. A movie about Verdana, which was designed for the screen at small sizes, may work better on TV. ;-)\n\nCheers, Si\n\n"
    },
    {
      "time": "18 Oct 2007 — 7:02am",
      "content": "The director said, at the Q&A, that the DVD contains more Erik Spiekerman. That alone makes it worth buying.\n\n"
    },
    {
      "time": "18 Oct 2007 — 7:12am",
      "content": "Amen. Although if I had waited an extra month instead of ordering it as soon as I got the email notification, I could have saved some money -- the Canuck dollar skyrocketed after I ordered. ;-)\n\nThe world needs more Spiekermann....\n\n"
    },
    {
      "time": "18 Oct 2007 — 10:23am",
      "content": "I know those bags are sold at [Flight 001](http://web.archive.org/web/20141230010927/http:/www.flight001.com/).\n\nIf you are in the bay area, we will be showing clips from the Helvetica extras at the Typophile FIlm Fest next Friday, the 25th in San Francisco. I have seen them all and it will be well worth the DVD purchase :)\n\n"
    },
    {
      "time": "18 Oct 2007 — 10:32am",
      "content": "There is also Vaho Trashion bags from Barcelona. I have one. It has Helvetica on it.\n\n[http://www.vaho.ws/eng/home.html](http://web.archive.org/web/20141230010927/http:/www.vaho.ws/eng/home.html \"http://www.vaho.ws/eng/home.html\")\n\nAnd look! An article about these things:\n\n[http://www.treehugger.com/files/2005/06/vaho\\_is\\_trashio.php](http://web.archive.org/web/20141230010927/http:/www.treehugger.com/files/2005/06/vaho_is_trashio.php \"http://www.treehugger.com/files/2005/06/vaho\\_is\\_trashio.php\")\n\n"
    }
  ]
}
