{
  "id": "3820",
  "title": "Default character set / text file",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I need a text file of all the characters in a generic 256 character typeface.   \n   \nsomething to the likes of this:   \n [http://www.adobe.com/type/browser/gifs/HLNQ/C\\_HLNQ-10055000.GIF](http://web.archive.org/web/20131107164427/http:/www.adobe.com/type/browser/gifs/HLNQ/C_HLNQ-10055000.GIF)   \n   \nI'm not even sure how to get some characters with my keyboard. i actually had such a text file at one point before i had a massive hard drive problem. anyway, something like this would be greatly appreciated.\n\n",
  "author": "anonymous",
  "time": "30 Oct 2002 — 10:10pm",
  "uid": "1203",
  "comments": [
    {
      "time": "3 Nov 2002 — 11:50pm",
      "content": "Matt, you don't say what kind of computer you're using. The standard encoding of text is different between Mac and Windows, so a text file is platform-specific (unless it's a Unicode text file, in which case, only a few applications can use it).   \n   \nAlso, the standard character set included in a font is different between Mac and Windows, and depends on what language you're using.   \n   \nThe character set above is missing some floating accents (common to both MacRoman and WinANSI), as well as some mac-specific and Windows-specific characters. Or maybe some of them just aren't displaying on my computer....   \n   \nIncidentally, Adobe's new ISO-Adobe2 character set is a superset of the standard MacRoman and WinANSI character sets, plus the litre and estimated signs.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "31 Oct 2002 — 11:05am",
      "content": "Matt O - here's somethin'. Perhaps somebody could put this in the downloads section as a text file.... all the characters might not display...depends on your default font...   \n   \nbj   \n   \n   \n!\"#$%&'()\\*+,./0123456789:;?@   \nABCDEFGHIJKLMNOPQRSTUVWXYZ   \n[]^`abcdefghijklmnopqrstuvwxyz   \n{}ÄÅÇÉÑÖÜáàâäãåçéèêëíìîïóòôöõúùûü\n\n"
    }
  ]
}
