{
  "id": "38200",
  "title": "how to make a good diagonal?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I having alot of problems in trying to makes a diagonal that have the same thinkness as verticals and horizontals... sofar I found out that if a vertical has 50 point thickness the diagonal has to been 57 or sow ... Then I’m i doubt...\n\ncould anyone sum up a good reciepie on doing a good diagonal that has the same thinkness as a ver. and hori.\n\nthx.\n\n [‹ Converting CMYK swatches to PMS spot colors](http://web.archive.org/web/20080422033424/http:/www.typophile.com/node/38205 \"Go to previous forum topic\") [creating from components ›](http://web.archive.org/web/20080422033424/http:/www.typophile.com/node/38199 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080422033424/http://www.typophile.com/user/12425\" title=\"View user profile.\">monefeldt</a>",
  "time": "<br>",
  "uid": "12425",
  "comments": [
    {
      "time": " 18.Oct.2007 5.36am",
      "content": "I don’t know if there’s a recipe, but I do know that diagonals generally have to be heavier than verticals to make them look the same weight (as you did here). I’d do whatever looks right to you — that’s what most of these optical correction “rules” are there for.\n\n"
    },
    {
      "time": " 18.Oct.2007 6.18am",
      "content": "\\>diagonals generally have to be heavier than verticals to make them look the same weight\n\nAre you measuring the width at right angles to the stroke, or along the horizontal axis? In Adobe Garamond Pro, for example, the width of the thick stroke of the X at right angles to the stroke is about 77, narrower than the stems of the H, at 82. If you measure the breadth of that same heavy diagonal of the X horizontally, that measurement is bigger than the stem, at 96.\n\nEspecially because diagonals are often tapered, there is no simple rule on this that I know of.\n\n"
    },
    {
      "time": " 18.Oct.2007 7.02am",
      "content": "If you’re measuring the diagonals in the horizontal direction (parallel to the baseline), then there can’t be a rule to follow.  \nThat distance would change depending on the angle of the stroke: the more upright the diagonal, the closer the distance would be to a vertical stem width, the less upright the diagonal, the wider that distance would be.\n\nFor instance, the angles of diagonals are usually different in K, k, w, v, etc. Even if each of those strokes had exactly the same weight (measuring at a right angle to the stroke), each would measure differently in a purely horizontal measurement.\n\nJason C\n\n"
    },
    {
      "time": " 18.Oct.2007 8.04am",
      "content": "You have to measure the thickness of a diagonal stroke at right angles to the angle of the stroke. As the eye perceives a horizontal line to be thicker than a vertical one of the same actual thickness, horizontals have to be made a bit thinner to appear optically the same. A diagonal being somewhere in between horizontal and vertical, it will generally also need to be slightly thinner than a vertical to match the optical thickness of the vertical. The eye is the best judge of how much in any particular circumstance.\n\n"
    }
  ]
}
