{
  "id": "38212",
  "title": "Brochure point size puzzle",
  "forum": "Design",
  "tags": [

  ],
  "content": "Erm...I don’t have much to contribute here and pop in occasionally to ask a question; I hope that’s okay...\n\nI have to reproduce a brochure in another language; the english brochure has been supplied, and I’m puzzled over the choice of point sizes throughout. Would be grateful to know if someone here can detect any logic to this:\n\nType Point size/leading are as indicated across a six-panel brochure:\n\nPanel 1:  \nSubhead 9.65/11  \nBody: 9/11  \nBody: 7.5/10\n\nPanel 2:  \nHead: 23.152/15  \nBody: 9/10  \nSubhead: 13.891/15.569  \nBody: 8.489/10.804  \nBody: 8/9.5  \nBody: 7.5/9\n\nPanel 3:  \nSame as panel 2.\n\nPanel 4:  \nSame as panels 2 and 3, with a little 9.65/11 and 9/11 thrown in.\n\nPanel 5:  \nHead: 17 pt.  \nSubhead: 14/auto  \nBody: 9.25/auto\n\nPanel 6:  \nHead: 43.996/46.853\n\nOtherwise it’s a well-designed brochure; am I just looking at sloppy typesetting?\n\n [‹ Church identity and font licensing](http://web.archive.org/web/20071222214616/http:/typophile.com/node/38071 \"Go to previous forum topic\") [What is a better alternative tihs this? ›](http://web.archive.org/web/20071222214616/http:/typophile.com/node/31189 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071222214616/http://typophile.com/user/14558\" title=\"View user profile.\">NeueB</a>",
  "time": "<br>",
  "uid": "14558",
  "comments": [
    {
      "time": " 18.Oct.2007 2.45pm",
      "content": "Is the brochure for a circus?\n\nCheers!\n\n"
    },
    {
      "time": " 18.Oct.2007 3.12pm",
      "content": "Some of the odd sizes could come down to the fact that they designed it for a different size, were given new dimensions, and just shrunk the text to fit. But the randomness has no rhymne or reason. Is this for David Carson?\n\n"
    },
    {
      "time": " 18.Oct.2007 4.25pm",
      "content": "Well designed? Maybe the general layout, but it must be a bit weird to read with that bizarre typesetting. I can’t think of any logical, or even illogical, reason for the type sizes being all over the map either; just don’t do that when you re-set it in the new language.\n\n"
    },
    {
      "time": " 18.Oct.2007 4.36pm",
      "content": "Heh. Sadly, no, it’s not for a circus. And I don’t know who David Carson is. But I suspect that MissTiffany is probably right about globally adjusting the type to accomodate a changed format or size. Yikes.\n\nThanks all for taking the time to respond. And yeah, I’ll be standardizing the sizes in the next language version.\n\n"
    },
    {
      "time": " 19.Oct.2007 6.38am",
      "content": "I remember Frank Romano bemoaning the flexibility of type sizes at a type conference in the 90s. He was thinking of spec’ing type from printed copies, and how difficult it would be to determine the size, if designers use tenths of a point sizes. And here you have 23.152 ... thousandths.\n\nI can just imagine trying to figure that one out with a type gauge.\n\n"
    },
    {
      "time": " 19.Oct.2007 7.22am",
      "content": "[http://en.wikipedia.org/wiki/David\\_Carson\\_(graphic\\_designer)](http://web.archive.org/web/20071222214616/http:/en.wikipedia.org/wiki/David_Carson_(graphic_designer))\n\n"
    },
    {
      "time": " 19.Oct.2007 12.16pm",
      "content": "Okay, I think I’ve figured it out:\n\nFibonacci’s brain:  \n6, 8, 10, 13, 16, 21, 26, 34, 42, 55, 68\n\nFibonacci’s brain on drugs:  \n7.5, 8, 8.489, 9, 9.25, 9.65, 13.891, 17, 23.152, 43.996\n\nAnd thanks for the wiki link, BradB.\n\n"
    },
    {
      "time": " 19.Oct.2007 2.25pm",
      "content": "I suspect that what they did was set everything at some size and leading, and then scale things by percentage—maybe one item at a time, but maybe the whole piece, one “page” at a time.\n\n"
    }
  ]
}
