{
  "id": "38213",
  "title": "Who are some people that are know for their study of layout and/or have created great layouts?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m a student and I’m doing some research on Grids and Layouts. I would like to know about what people and what works i should get to know.\n\n [‹ { What does this error mean? }](http://web.archive.org/web/20081204124812/http:/www.typophile.com/node/38182 \"Go to previous forum topic\") [Vanna Likes Arial and Helvetica ›](http://web.archive.org/web/20081204124812/http:/www.typophile.com/node/37934 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081204124812/http://www.typophile.com/user/22418\" title=\"View user profile.\">mandatorycannibalism</a>",
  "time": "<br>",
  "uid": "22418",
  "comments": [
    {
      "time": " 18.Oct.2007 2.20pm",
      "content": " ![](http://web.archive.org/web/20081204124812im_/http:/www.typophile.com/files/tschichold1_5413.jpg)\n [Jan Tschichold](http://web.archive.org/web/20081204124812/http:/en.wikipedia.org/wiki/Jan_Tschichold)\n"
    },
    {
      "time": " 18.Oct.2007 3.53pm",
      "content": "Josef Müller Brockman and Willi Kunz are both known for their work with grids, as well as for their books on the subject. Wim Crouwell is known for doing awesome stuff with grids, including grid based lettering, and there are some great interviews with him on YouTube, as well as in Helvetica: The Film.\n\n"
    },
    {
      "time": " 18.Oct.2007 7.54pm",
      "content": "Koppa’s reply is the best answer (and a wonderfully bizarre photo of Tschichold). I would add Jost Hochuli.\n\n“Layout” is such a broad term – do you mean books? magazines? web pages? Even if you’re talking about books, there’s huge variety, from a well-made novel (the sort of page that makes you want to read the text, and gets out of your way while you do so) to an art book or a complex integration of visuals and text.\n\nOne of the finest practitioners of page design working today is Jack Stauffacher. His sense of the relationships between elements, and how they’ll be perceived by the reader, is very highly developed. The results are subtle, not obvious.\n\nJohn Berry\n\n"
    }
  ]
}
