{
  "id": "38241",
  "title": "Ocean Child - Clothing/Fashion brand",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello everyone,\n\nI’d like to hear some comments about an brand I have been working on.\n\nHere is some info about the client, the type of business and the work done so far.\n\nThe brand is new. It is founded by a few young designers that want to have their own label.  \nThe name was given by the clients.  \nThey are not going to make “haute couture”, but they are not SEARS eather... They are aiming for a young audience, with relatively high visual culture, that is also willing to pay for the craftsmanship they (Ocean child) provide.  \nThey wanted something that was both young, smooth and free, but a bit corporate and official too...\n\nWell, I’d be glad to answer any questions and to read some comments.  \nThanks in advance for your time :)\n\n| Attachment | Size |\n| --- | --- |\n| [logo.JPG](http://web.archive.org/web/20071202182202/http:/typophile.com/files/bcard.JPG) | 57.95 KB |\n| [bcard.jpg](http://web.archive.org/web/20071202182202/http:/typophile.com/files/logo_23.jpg) | 52.52 KB |\n\n [‹ Web design agency icon Logo Type design](http://web.archive.org/web/20071202182202/http:/www.typophile.com/node/27573 \"Go to previous forum topic\") [Logo for marketing events company ›](http://web.archive.org/web/20071202182202/http:/www.typophile.com/node/38077 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071202182202/http://www.typophile.com/user/21973\" title=\"View user profile.\">Nintie</a>",
  "time": "<br>",
  "uid": "21973",
  "comments": [
    {
      "time": " 21.Oct.2007 4.58am",
      "content": "Sorry this is doing nothing for me, it doesn’t relate the qualities your clients are looking for.\n\nFrom a practical point of view while the business card layout works for a relatively short name what happens when a longer name comes along or if e-mail addresses are required?\n\nTim\n\n"
    },
    {
      "time": " 21.Oct.2007 3.24pm",
      "content": "The logo itself feels very youthful and free to me and is still credible in a corporate sense. I might try scaling “Child” down a bit to create a bit more contrast between it and “Ocean” to see what happens.\n\nAlso I am not sure why there’s so much black being shown with the name of the logo- a name like that begs for color (if that’s a production concern or budget limitation then I would reverse black/white on the logo and card).\n\nNice work.\n\n"
    },
    {
      "time": " 22.Oct.2007 1.49am",
      "content": "Thank you both for your comments! :)\n\ntimd, would you suggest a different global approach to the logo? Any examples may be..?  \nYou are right about the business card, I believe I will have to kill some of the space between the logo and the info in order to forecast a longer namer...\n\nmjpatrick, I was actually thinking of doing the “child” with a very black type, that would fill up the whole circle of each letter. So we’d get something like a “circular-punch-out” in a way :)  \nColor has not been discussed yet, however we have agreed that we’ll be looking at complex colors (pastel, colors you can find in nature’s ecosystems etc)...  \nI will post any changes and fixes made!\n\n"
    },
    {
      "time": " 23.Oct.2007 8.46am",
      "content": "The “N” breaks the harmonious shape of the other letters — and not in a good way, I think. I would recommend trying out a lowercase “n”.\n\n"
    }
  ]
}
