{
  "id": "3825",
  "title": "Underthebed",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi Guys and Gals,   \nhere is my first attempt at making a font, I'm using fontographer 3.5 I had no idea how it worked when I started (although I do use llustrator and photoshop everyday), and I have only a little more now.   \n   \nI am completely new to the world of typography and font creation and this font has been created as a titling font for my boyfriends new comic (published late november).   \n   \nAll comments welcome, it is meant to be quite quirky, but any technical criticisms may need to be explained as I haven't got all the terminology down pat yet.   \n   \nAnyway that's enough rambling let's get on with it.   \nbe gentle.   \nJen   \n ![under](http://web.archive.org/web/20131015182230im_/http:/www.typophile.com/forums/messages/29/2956.jpg)\n\n",
  "author": "jenhook",
  "time": "1 Nov 2002 — 2:01am",
  "uid": "942",
  "comments": [
    {
      "time": "1 Nov 2002 — 4:45am",
      "content": "Looks good to me. Can you explain more about your boyfriend comic's? Who's the target? Well here is my comment:   \n1. Looks good as far as I see, but the lc 's' seem a little bit thin than the other lc. Maybe you need to make it more fat.   \n2. I don't understand why the 3,4,5 looks narrower than the other.   \n3. I like the way you treat the curve on lc 'g'.   \n4. The uc looks fine.   \n   \nI guess that's all from me. Guys any comment?   \nSorry about my bad English.   \n   \n+ep+\n\n"
    },
    {
      "time": "1 Nov 2002 — 12:35pm",
      "content": "Jen, please set a sentence in your font so we can see the letters in context. It might help us appreciate its \"quirkiness\"   \n   \nMy initial impression is that the varying weight and character widths could be better unified. Right now they seem all over the board.   \n   \nDon't think of the \"R\" as a \"P\" with another leg. It's its own animal.   \n   \njb\n\n"
    },
    {
      "time": "1 Nov 2002 — 1:07pm",
      "content": "Eka-   \nThanks so much for replying!   \nI will fix the 's' and the numbers, you are so right!   \nhere is the first mock up of the cover so you can see what it would look at in contxt - obviousley the masthead letters have been modified but I wanted to leave the font useable as well as use it's basic form for the masthead.   \n   \n   \nJared-   \nThank you too!   \nI've posted a quick brown fox below, as i've said I'm using fg 3.5 and I'm having a lot of trouble understanding the way it works and the whole kerning thing.   \nI had stacks of problems with some of the letters, I think I may need to do some hand lettering practise (something i haven't done since my calligraphy phase in high school!)   \n   \nThanks   \njen\n\n"
    },
    {
      "time": "1 Nov 2002 — 1:10pm",
      "content": "bah!   \n ![cover-t](http://web.archive.org/web/20131015182230im_/http:/www.typophile.com/forums/messages/29/2964.jpg)   \n ![quick](http://web.archive.org/web/20131015182230im_/http:/www.typophile.com/forums/messages/29/2965.jpg)\n\n"
    },
    {
      "time": "1 Nov 2002 — 6:05pm",
      "content": "Mmmm nice...   \n   \n+ep+\n\n"
    },
    {
      "time": "1 Nov 2002 — 7:49pm",
      "content": "I would reduce the word spaces down to at least half what they are now.   \n   \nAlso, I think the baseline is unnaturally even for a style like this. I would let it vary about the same amount as the x-height. A good way to think about it is to imagine an invisible line about halfway up the x-height. The lowercase letters should appear to be bouncing slightly up and down from this line. Right now, it looks like they are all sitting solidly on the baseline which fights against the lively, unhinged quality of the font.\n\n"
    },
    {
      "time": "1 Nov 2002 — 9:37pm",
      "content": "Okee I've made those changes...   \nI've had a fiddle with the baseline like you said Mark, gosh it was hard to force myself to do this, I probably haven't taken it as far as I could really. ( I actually didn't realise you could change the space! but I found it)   \nfor anyone interested you can download a desktop i made of doug's cover image here -   \nhttp://www.f1-comics.com/gallery/Tales\\_desktop.jpg   \n   \n ![change](http://web.archive.org/web/20131015182230im_/http:/www.typophile.com/forums/messages/29/2969.jpg)\n\n"
    },
    {
      "time": "1 Nov 2002 — 9:53pm",
      "content": "I like the crazyness of the uppercase the fact that it is all over the board, weight wise and such, yet managing the same relative proportion, height, character balance, there's nice bows, like the T, which is going to start off many a \"The\" sentences. the X and Y could use a thicker variation somewhere\n\n"
    },
    {
      "time": "1 Nov 2002 — 10:43pm",
      "content": "Thanks for that Tanya, as I said, it's my first font so it's all a learning process ![:)](http://web.archive.org/web/20131015182230im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nI'll fixt those letters zstratight away!   \njen\n\n"
    },
    {
      "time": "2 Nov 2002 — 12:47am",
      "content": "![xyz](http://web.archive.org/web/20131015182230im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "2 Nov 2002 — 1:03am",
      "content": "![xyz](http://web.archive.org/web/20131015182230im_/http:/www.typophile.com/forums/messages/29/2970.jpg)   \nand the phone rings, you walk away and boom! five minutes have passed and you missed the upload window\n\n"
    },
    {
      "time": "2 Nov 2002 — 7:00am",
      "content": "I think you went a bit too far on the bouncing effect, but the word spacing looks much better. I would tend not to bump letters up that are already tall (those with ascenders) or down for those that have descenders. You don't want to be too obvious about it either. Set lots of different words and adjust anything that calls too much attention.\n\n"
    },
    {
      "time": "2 Nov 2002 — 8:29am",
      "content": "The more irregularity in a font, the more you have to pay attention to linguistics. In deciding what to move up/down etc. it helps a lot to look at the more frequent letter combinations in actual language.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Nov 2002 — 11:16am",
      "content": "Thanks mike 0 I think I'll move it back to around baseline.   \n   \nMr Hrant,   \nThanks for replying! Can you suggest any resources (online or off) where I might find this sort of information. I've heard a lot about kerning pairs without actually know what the pairs are, is this what you are talking about in relation to which letters i bump?   \njen\n\n"
    },
    {
      "time": "2 Nov 2002 — 12:46pm",
      "content": "Kerning pairs are meant to fix horizontal spacing anomalies (too much/little space between glyphs, like between the \"Ty\" pair), so they benefit from linguistics too (although arguably less); but kerning pairs are not inherently related to the \"bumping\" as far as I can think.   \n   \nA good source? Cryptanalisis/cryptography. I use some books I have, but here's the top Google hit for \"cryptanalysis digraphs\":   \n   \n [http://www.umich.edu/~umich/fm-34-40-2/](http://web.archive.org/web/20131015182230/http:/www.umich.edu/~umich/fm-34-40-2/)   \n(Appendix A and on.)   \n   \nBTW, you can/should also look at the most frequent \\*words\\* (which will quickly show you the most serious problematic situations), and for the top 100 in English you can look at the far right of:   \n [http://www.themicrofoundry.com/s\\_quality.html](http://web.archive.org/web/20131015182230/http:/www.themicrofoundry.com/s_quality.html)   \n   \nBut frequency is only part of the picture. There are very many words that are not common but do cause unfortunate spacing - \"spikes\" in language; which is why most type designers use long premade/canned lists of pairs/words to check their work. I wouldn't worry about those for your \"bumpiness\" (since things have to average out anyway), but for the \"higher reaches\" of spacing (where adding a kerning pair doesn't hurt anything else) you need that too.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Nov 2002 — 4:06pm",
      "content": "Thank you! I'll do some research!\n\n"
    },
    {
      "time": "2 Nov 2002 — 5:33pm",
      "content": "What a fun project. I love what the word 'bed'   \ndoes on the cover. That's a great illustration too.   \n   \nIt's cool to see the progression...\n\n"
    },
    {
      "time": "2 Nov 2002 — 6:05pm",
      "content": "Thanks Joe ![:)](http://web.archive.org/web/20131015182230im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nwell it's up for download at my website now and the book will be available in a few weeks I'll keep y'all posted.   \nJen   \n [http://jen.f1-comics.com](http://web.archive.org/web/20131015182230/http:/jen.f1-comics.com/)\n\n"
    }
  ]
}
