{
  "id": "38265",
  "title": "Resume Critique!",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I’ve tried to give my critique on a couple of critiques and now I need advice for mine! This is my first real resume. I am not yet using it to search for a full-time job, but will use it pretty soon to send off as a plea for an internship position this summer.\n\nI’m especially concerned about, well, the typographical aspect of the resume, as I’ve only had about 6 weeks so far of formal education in the subject. That said, any constructive criticism would be greatly appreciated.\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [Resume1007.pdf](http://web.archive.org/web/20071229231020/http:/typophile.com/files/Resume1007.pdf) | 29.51 KB |\n| [Resume1007v2.pdf](http://web.archive.org/web/20071229231020/http:/typophile.com/files/Resume1007v2.pdf) | 29.87 KB |\n\n [‹ critique this page out of a booklet](http://web.archive.org/web/20071229231020/http:/www.typophile.com/node/38431 \"Go to previous forum topic\") [critique my flyer ›](http://web.archive.org/web/20071229231020/http:/www.typophile.com/node/37938 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071229231020/http://www.typophile.com/user/13430\" title=\"View user profile.\">JABZOOG</a>",
  "time": "<br>",
  "uid": "13430",
  "comments": [
    {
      "time": " 20.Oct.2007 12.03am",
      "content": "The red line is not precisely connected to the ear of the ’g.  \nThe alignment of the website is “not cold not hot,” I also would suggest to letterspace both the website address and the email adress, and maybe reduce a wee bit the size of ’@’ with some positive kerning on its sides.  \nThe titles aligned right could be all caps in smaller size and with more letterspace.\n\n"
    },
    {
      "time": " 20.Oct.2007 7.29am",
      "content": "Alessandro, thank you for your suggestions. The red line lines up in inDesign and when the PDF is viewed at 300%.. I tried tweaking them a bit more and it looks better this time, I think.\n\nI have added a 2nd version to the first post.\n\n"
    },
    {
      "time": " 21.Oct.2007 3.54am",
      "content": "The red line still isn’t lining up, since you can’t dictate the viewer’s preferences, perhaps it would be simpler to outline the characters and pull the serif of the g out. I would look for some kind of alignment/relationship between header and copy, first I would re-position the copy slightly to the left and move it slightly down and then experiment with the positioning of your name and address details. Bearing in mind this could be printed out, the light grey used for the text might be too light/halftoned. At a closer view maybe you can work on the kerning of dashes, virgules and hyphens. Content-wise should the pre-College courses be included in education? I would remove the comma after Illustrator.\n\nGood luck with the hunt.\n\nTim\n\n"
    },
    {
      "time": " 24.Oct.2007 4.01pm",
      "content": " The baseline of the faked–small-caps section headings is inconsistently aligned with the text to its left; ‘EXPERIENCE’ shares the baseline while the others float a bit. The fontshop.com entry for Rockwell Std Light suggests the font “may include small caps, extra glyphs, and other features”, so the ‘real’ small caps might be worth hunting for. (_E.T.A: According to MyFonts.com, Rockwell does_ not _have a small-caps version, so ignore that last bit._)\n\n I know Bringhurst doesn’t like it, but in text with many capitalized words a wider space between sentences might look better, _e.g._:  \n   Projected graduation in May 2010 with a Bachelor of Fine Arts  \n   in Graphic Design. Currently taking Graphic Design I,  \n   in Graphic Design. Currently taking Graphic Design I,  \n   in Graphic Design.&nbsp; Currently taking Graphic Design I,  \n   Typography I, Calligraphy, and Photography I.  \nwhere I’ve shown the middle line with one space, an en space, and two spaces.\n\n Tim: When you suggest removing the comma, do you mean to use the “a, b and c” convention (rather than “a, b, and c”) or are you simply noting that it looks awkward in this context? I’d suggest keeping the comma and using an ampersand.\n\n Finally, I’m not sure what the standard camera naming convention is, but you might want to identify the camera as a 4×5 rather than 4x5—or even 4\"×5\". (Rockwell doesn’t have the true prime glyphs to properly display 4ʺ×5ʺ)\n\n—Joel (Cooper Union Engineering student)\n\n"
    },
    {
      "time": " 24.Oct.2007 10.09pm",
      "content": "Hi, thanks Tim and Joel for your comments. They will be helpful, but I haven’t had time yet to update.\n\nTim, thanks for the comments especially re: positioning. As far as pre-college’s placement in education or experience.. I think one could argue that education is experience or that experience is education. They could be placed in either category, I think, but to keep with an easier timeline I chose to put the pre-college stuff under experience.\n\nJoel, my section headings are not fake small caps! But yeah, I’ve been having a hard time aligning those things. I will play around with the word spacing as you suggested. And I’ll see what works with the 4x5. Thank you! And.. small small world!\n\n"
    }
  ]
}
