{
  "id": "38263",
  "title": "The Buzz on the street",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "When Adobe announced the acquisition of Buzzword, the Flash based word processor, I couldn’t wait to check it out especially with a quote like this...\n\n“Because it was built with Adobe Flex™ software and runs in the Adobe Flash™ Player, Buzzword enables greater document quality, _outstanding typography_, page layout controls, and robust support for integrated graphics, regardless of the browser or device.”\n\nIt’s pretty cool, but I’m going to have to fire up the Phinnsignal on the outstanding typography claim ;-)\n\nHere’s what they present when you launch it up...\n\n ![](http://web.archive.org/web/20071106161637im_/http:/typophile.com/files/dashing_4466.JPG)\n\n ![](http://web.archive.org/web/20071106161637im_/http:/typophile.com/files/fakequotes_6145.JPG)\n\nwhole screen...\n\n ![](http://web.archive.org/web/20071106161637im_/http:/typophile.com/files/wholescreen_4752.JPG)\n\nAnd the font list\n\n ![](http://web.archive.org/web/20071106161637im_/http:/typophile.com/files/BuzzOnTheStreet_6278.JPG)\n\nI know it’s a beta – and Tom will I’m sure be helping them out, but let’s save the “outstanding” til they beat WP 5.1 ;-)\n\nCheers, Si\n\n [‹ Is Avenir an appropriate typeface for wayshowing signage?](http://web.archive.org/web/20071106161637/http:/typophile.com/node/32176 \"Go to previous forum topic\") [Web typography: auto leading adjustments according to line length ›](http://web.archive.org/web/20071106161637/http:/typophile.com/node/38344 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071106161637/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 19.Oct.2007 4.46pm",
      "content": "Looks like they are now Buzzted, Si :-)\n\nChrisL\n\n"
    },
    {
      "time": " 19.Oct.2007 5.08pm",
      "content": "How’s the OT support?\n\n"
    },
    {
      "time": " 19.Oct.2007 5.25pm",
      "content": "None that I could see - wasn’t really expecting any as it’s Flash based. I searched the help to make sure I didn’t miss anything [http://preview.getbuzzword.com/help/index.html](http://web.archive.org/web/20071106161637/http:/preview.getbuzzword.com/help/index.html \"http://preview.getbuzzword.com/help/index.html\")\n\n"
    },
    {
      "time": " 19.Oct.2007 6.18pm",
      "content": "Interesting—especially considering today’s announcement that Adobe is planning a shift to subscription based web software. Which means that I’m going to start holding yearly fund-raisers for the OSS alternatives...\n\n"
    },
    {
      "time": " 19.Oct.2007 6.59pm",
      "content": "James, where did you read that Adobe announcement?\n\n"
    },
    {
      "time": " 19.Oct.2007 7.51pm",
      "content": "[http://www.google.com/news?hl=en&ned=us&ie=UTF-8&scoring=d&q=adobe+subsc...](http://web.archive.org/web/20071106161637/http:/www.google.com/news?hl=en&ned=us&ie=UTF-8&scoring=d&q=adobe+subscription \"http://www.google.com/news?hl=en&ned=us&ie=UTF-8&scoring=d&q=adobe+subscription\")\n\n"
    },
    {
      "time": " 19.Oct.2007 9.46pm",
      "content": "It may not be typographically impressive as a word processor compared to current desktop apps, but it’s pretty amazing as a web-based application.\n\nAlso, it’s always been a mistake in typesetting tech to discount version 1.0 of stuff. A lot of people dismissed the first printed books, phototypesetting, and desktop publishing, when they were first introduced. They couldn’t see beyond the limitations of version 1.0....\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 19.Oct.2007 10.24pm",
      "content": "Wow. I can’t wait to edit a half gig (or more) photo with web based software. Ouch. It’s already ouch. I hope the bandwidth in ten years is faster than my current IDE bus.\n\npbc\n\n"
    },
    {
      "time": " 20.Oct.2007 12.31pm",
      "content": "Thanks for the link, Sii. It makes me want to hold on to my XP machine with CS3 installed. Or whatever I have before that happens. Trying to use Photoshop on the internet sounds hideous, to say the least, unless Adobe installs an incredibly fast cable connection to my modem.\n\n"
    },
    {
      "time": " 20.Oct.2007 9.00pm",
      "content": "Thomas, the limitations of the platform are not what I don’t like. It’s the idea of having a career that could become somewhat dependent on software controlled entirely by someone far away that freaks me out.\n\nOn the upside, maybe this means that we’ll be seeing better text rendering in Flash, and eventually Indesign.\n\n"
    },
    {
      "time": " 22.Oct.2007 4.53am",
      "content": "” let’s save the “outstanding” til they beat WP 5.1”\n\nSorry, what is WP 5.1?\n\n"
    },
    {
      "time": " 22.Oct.2007 6.16am",
      "content": "WP 5.1 would be Word Perfect 5.1, which was state of the art ... 15 years ago.\n\n"
    },
    {
      "time": " 22.Oct.2007 6.17am",
      "content": "WordPerfect 5.1, David.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Oct.2007 6.19am",
      "content": "<cite>WP 5.1 would be Word Perfect 5.1, which was state of the art ... 15 years ago.</cite>\n\nFifteen years ago state of the art was still more than most people really need a word processor to do now. If I could get WP 5.1 for OS X I might actually stop using textedit for everything I write.\n\n"
    },
    {
      "time": " 22.Oct.2007 6.29am",
      "content": "“Also, it’s always been a mistake in typesetting tech to discount version 1.0 of stuff.”\n\nThere used to be a time when ’version 1’ meant ’this is our product, what do you think?’\n\nThese days, companies like Microsoft and Adobe have taught us that it’s technically still ’beta’ until at least version 4. ;o)\n\n"
    },
    {
      "time": " 22.Oct.2007 7.19am",
      "content": "Not just Adobe and Microsoft ... I remember Pagemaker 1.0 (it was Aldus then). It was a bit of a joke, especially when presented as a professional typsetting tool at Print 85 in Chicago.\n\n"
    },
    {
      "time": " 22.Oct.2007 8.53am",
      "content": "Pagemaker was ALWAYS a joke.\n\n"
    },
    {
      "time": " 22.Oct.2007 9.22am",
      "content": "<cite> Pagemaker was ALWAYS a joke. </cite>\n\nMaybe. But according to Guy Kawasaki it saved Apple’s Bacon when they brought out the Mac. Both of them were deeply flawed but together they became important. My point is just that it is smart to build it & bang on it til it works if you have deep enough pockets to get it right eventually. And Adobe, Google & MS all theoretically do. And think of all the cruft that Adobe must be side stepping!\n\n"
    },
    {
      "time": " 22.Oct.2007 11.00am",
      "content": "PageMaker vs. xacto knife and waxer. That was no joke. Quark was much better, true, but the world of publishing took a giant spin with the advent of those programs and postscript. We had to start somewhere to have something to improve. The process was quite fast in improvement, too.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Oct.2007 11.28am",
      "content": "Mac+PM started the desktop publishing revolution - end of story - next question :-)\n\n"
    },
    {
      "time": " 22.Oct.2007 11.30am",
      "content": "sorry, that should be Mac+Pm+Laserwriter\n\n"
    },
    {
      "time": " 22.Oct.2007 12.17pm",
      "content": "“WP 5.1 would be Word Perfect 5.1, which was state of the art ... 15 years ago.”\n\nWhy would anybody compare a 15 yr. old WP app to a modern cross platform, browser indy app?\n\nScratch ’n sniff. :)\n\nCheers!\n\n"
    },
    {
      "time": " 22.Oct.2007 3.25pm",
      "content": "The relevant question that with a word processor be it an app or an online app is ’does it do what I need it to do?’. It’s the same question. It’s a human question. It will vary with the person.\n\nSo the tech is not important except in as much as it impacts the actual usefulness of the app to real people.\n\nConsider, web based email is both far better & far worse than app based email. I think we can all describe the virtues & deficits already because of our experience with each. I am really glad we have both. I can imagine being glad to have both for Word processing too - and deciding to use them differently just like I do email apps.\n\n"
    },
    {
      "time": " 22.Oct.2007 5.41pm",
      "content": "Ahh Pagemaker. My local service bureau at that time had a secret policy of adding a “RageMaker” markup to all Pagemaker files they received for output.\n\n"
    },
    {
      "time": " 22.Oct.2007 9.28pm",
      "content": "Secret policies are always the most interesting. Was Pagemaker really all \\*that\\* bad or was it a technophobic business?\n\n"
    },
    {
      "time": " 23.Oct.2007 12.28am",
      "content": "Hi guys:\n\nThe thing that irritated me about Pagemaker was the text handles- sometimes difficult to adjust shape because you had to target the the little square at the end of each text box precisely or you selected something you did not want.\n\nMikey :-)\n\n"
    },
    {
      "time": " 23.Oct.2007 6.08am",
      "content": "As I understand it, Pagemaker had a feature that would save all your work whenever you moved to a new page. This made horrendously huge files unless you renamed the file every now and then, which eliminated all the intermediate saves.\n\nI guess this was because the program was so prone to crashing that this provided better backup. And I guess the crashes were understandable when the OS, the program, and your data files were all fighting to live on 512K of RAM and 400K on the single disk drive that was then standard.\n\n"
    },
    {
      "time": " 23.Oct.2007 6.21am",
      "content": "You guys have to remember the times. There was NOTHING, them there was something that seemed amazing compared to nothing. Early PageMaker compared to today’s software pales in comparison but compared to nothing, it was a giant leap.\n\nChrisL\n\n"
    },
    {
      "time": " 23.Oct.2007 7.52am",
      "content": "Not that this is a Pagemaker thread, but we used to give an old boss of mine a hard time, saying he was the only reason they still made Pagemaker. I think we were onto Indesign 2 and we still had copies of Pagemaker being used for a client. Talk about a pain the rear.\n\n"
    },
    {
      "time": " 23.Oct.2007 11.28am",
      "content": "There was “nothing” for the masses, but the people who built type for a living had several options, like Quadex, Compugraphic, AM, Penta and others. The quality of PM 1.0 was a joke compared to them (although also costing about 1% of what they did).\n\n"
    }
  ]
}
