{
  "id": "38272",
  "title": "Downloading and Using Vista Web Fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Here’s something interesting:\n\n[Downloading and Using Vista Web Fonts](http://web.archive.org/web/20071217131143/http:/www.hunlock.com/blogs/Downloading_and_Using_Vista_Web_Fonts)\n\n [‹ Fraktur Wortmarke](http://web.archive.org/web/20071217131143/http:/www.typophile.com/node/38195 \"Go to previous forum topic\") [What OS or Low Cost DTP apps support Open Type? ›](http://web.archive.org/web/20071217131143/http:/www.typophile.com/node/38204 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071217131143/http://www.typophile.com/user/18547\" title=\"View user profile.\">henrypijames</a>",
  "time": "<br>",
  "uid": "18547",
  "comments": [
    {
      "time": " 20.Oct.2007 1.53am",
      "content": "I’ve been totally unaware of the new fonts in Windows Vista since I’m still using XP, and I have to say I’m really surprised I haven’t read anything about them until now.\n\nAnd now I look at those fonts, they’re really pretty good. I’m seriously considering changing the default fonts in my browser from Georgia/Tahoma to Cambria/Candara now.\n\n"
    },
    {
      "time": " 20.Oct.2007 2.41am",
      "content": "Interesting? Yeah, if you are on Windows … :°(\n\n<cite>You may use the fonts that accompany the PowerPoint Viewer only to display and print content from a device running a Microsoft Windows operating system. Additionally, you may do the following:<br>\nEmbed fonts in content as permitted by the embedding restrictions in the fonts<br>\nWhen printing content, temporarily download the fonts to a printer or other output device<br>\nYou may not copy, install or use the fonts on other devices.</cite>  \n[[Source](http://web.archive.org/web/20071217131143/http:/www.microsoft.com/downloads/details.aspx?familyid=048DC840-14E1-467D-8DCA-19D2A8FD7485&displaylang=en)]\n\nSee also this [older thread](http://web.archive.org/web/20071217131143/http:/www.typophile.com/node/31268).\n\n"
    },
    {
      "time": " 20.Oct.2007 9.03pm",
      "content": "Lately I’ve been wondering if I can use Wine or Crossover Office to install the Powerpoint Viewer on my Mac and use the Vista fonts legally without having to run Windows.\n\nI’m guessing that the license prohibits that, tho.\n\n"
    },
    {
      "time": " 20.Oct.2007 10.49pm",
      "content": "I’m sure if you look hard enough you’ll be able to find some loophole to avoid paying for the fonts, but is it really worth the effort?\n\nI think people point to the PPT viewer, rather than the Office 2007 Compatibility pack which also includes the fonts, so they can claim getting one over on MS. Fact is that these fonts are available to Windows customers in various forms, and anyone who needs them on Linux, Mac, or their Symbian smartphone can license them like any other font.\n\n"
    },
    {
      "time": " 22.Oct.2007 6.32am",
      "content": "I imagine running Windows in Parallels counts, then. Cool!\n\n"
    },
    {
      "time": " 22.Oct.2007 12.25pm",
      "content": "” they’ve got terrible kerning in the hinted version...”  \nWelcome to Saccadehiccups, population 30 million;) You sould be able to find some sizes nicer than what you were using before though, no?\n\nCheers!\n\n"
    },
    {
      "time": " 22.Oct.2007 12.35pm",
      "content": "I did not realize that the Vista fonts were already being sold by Ascender. I’ll have to keep that in mind...\n\n"
    },
    {
      "time": " 22.Oct.2007 12.39pm",
      "content": "After trying out Cambria/Candara as my standard web fonts for two days, I’ve switched back to Georgia/Tahoma. The major problem with Cambria/Candara is that they’ve got terrible kerning in the hinted version — it’s so bad that some letter spacing are indistinguishable with real spaces. Plus, both appear too thick — almost bold — in the hinted version. I don’t know how they look in ClearType, but at least on old fashioned CRT monitors those fonts are definitely unusable as web fonts. Actually, I’d even go so far as to say they look like fonts designed by amateurs:\n\n ![](http://web.archive.org/web/20071217131143im_/http:/www.typophile.com/files/cambria_4462.png)\n\n ![](http://web.archive.org/web/20071217131143im_/http:/www.typophile.com/files/candara_4364.png)\n\nWhat’s also quite obvious is that the x-height of Candara is very small (significantly so in comparison to Tahoma, for instance) — also a property unsuitable for web viewing, this one regardless of ClearType or not.\n\nSo I guess my question is, are those fonts actually intended to be “web fonts”? If so, how can those obvious mistakes go undetected, and if not, why are people saying they are?\n\n"
    },
    {
      "time": " 22.Oct.2007 9.02pm",
      "content": "Bad, bad Microsoft, going and promoting these as Web fonts! Oops, they didn’t.\n\nYou would have thought Microsoft would have done something like labeled the fonts “the ClearType collection” to, you know, warn people about the grayscale issue.\n\n;-)\n\nCheers, Si\n\n"
    }
  ]
}
