{
  "id": "38270",
  "title": "(x) SuperBrugsen corporate sans - custom face by Jonas Hecksher (e-Types AS) {Asparouh Kalyandjiev}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "What typeface is this?? Does anyone know? Thanks in advance!\n\nBest regards,  \nMorten\n\n ![](http://web.archive.org/web/20140807062855im_/http:/typophile.com/files/Picture!_3882.gif)\n\n",
  "author": "morten",
  "time": "20 Oct 2007 — 1:30am",
  "uid": "2642",
  "comments": [
    {
      "time": "20 Oct 2007 — 2:32pm",
      "content": "Interesting. Reminds me of [your work](http://web.archive.org/web/20140807062855/http:/www.fontshop.com/fonts/singles/fontfont/ff_max_ot_semi_bold/)!\n\n"
    },
    {
      "time": "20 Oct 2007 — 11:44pm",
      "content": "Yes, maybe a few things around :-)  \nBut I don't know this designer – this face contents several typefaces and curves in one face; a strange on, I don't like it...\n\n"
    },
    {
      "time": "21 Oct 2007 — 7:00am",
      "content": "\\> _I don’t like it..._\n\nSorry to contradict you, Morten, but I agree with Stephen -- this one is really intriguing. Of course it's not easy to judge it properly without seeing it up close and in different settings.\n\n"
    },
    {
      "time": "22 Oct 2007 — 2:19am",
      "content": "It's a specific corporate font made by [Kontrapunkt](http://web.archive.org/web/20140807062855/http:/www.kontrapunkt.dk/), as part of their revamp of [SuperBrugsen's](http://web.archive.org/web/20140807062855/http:/superbrugsen.dk/) identity. It comes in 3 weights; light, medium and bold, and is also used in the new logo and most of their other material. Oh, and as far as I know it's simply referred to as \"SuperBrugsen Font\".\n\n"
    },
    {
      "time": "1 Nov 2007 — 8:23am",
      "content": "eh, that's just plain wrong.. I don't know who really did it, but Kontrapunkt certainly has nothing to do with either the typeface or the rest of the new identity.  \nNext time, check your sources a little better and save the pseudo-knowledge (\"It comes in 3 weights; light, medium and bold [...] simply referred to as 'SuperBrugsen Font'\"), Daniel.\n\n"
    },
    {
      "time": "1 Nov 2007 — 8:44am",
      "content": "Claas, I see you’re Danish … maybe you can translate for us? Here is a ‘pressemeddelelser fra SuperBrugsen’ with something about ‘ [SuperBrugsen - Danmarks største supermarkedskæde - skifter stil. Nyt logo, nye reklamefilm på TV, nyt slogan](http://web.archive.org/web/20140807062855/http:/superbrugsen.dk/includefiles/moduler/ccms/show_page.asp?iMappeID=384&sSideNavn=Pressemeddelelser&intNyhedId=10612&strNyhedSoegeord=) …’\n\nThe [campaign website](http://web.archive.org/web/20140807062855/http:/www.xn--reddinesmagslg-2qb.dk/) that is mentioned there was made by [NöRD ApS](http://web.archive.org/web/20140807062855/http:/www.noerd.dk/).\n\nBut I don’t know if they are talking about the font and its creators, too … probably not.\n\n"
    },
    {
      "time": "1 Nov 2007 — 9:31am",
      "content": "The font is made by Jonas Hecksher from [e-Types AS](http://web.archive.org/web/20140807062855/http:/http/www.e-types.dk/).\n\n"
    },
    {
      "time": "1 Nov 2007 — 10:22am",
      "content": "Florian,  \nyou're right, the press release doen't say anything about the design at all.. they're just talking about their company values and ecologic meat and such...\n\nhowever, downloading this weeks special-offers pdf revealed that Daniel was right about the font names: superbrugsen regular and bold. sorry for the rough tone\n\n"
    },
    {
      "time": "5 Nov 2007 — 2:42am",
      "content": "Their new design-manual doesn't say who made the new identity or the font (strange really), so I just asked our account manager for SuperBrugsen who made it, and was told it was Kontrapunkt - and I simply assumed that was correct - sorry about the mix-up, if the credit goes to e-Types...\n\n- Class, woah, nice attitude there, really makes people want to share next time...\n\n"
    },
    {
      "time": "5 Nov 2007 — 2:51am",
      "content": "\\> _however, downloading this weeks special-offers pdf revealed that Daniel was right about the font names: superbrugsen regular and bold. sorry for the rough tone_\n\nYou are right about the reaction to your post, but I think Claas wanted to apologize.\n\n"
    },
    {
      "time": "5 Nov 2007 — 3:09am",
      "content": "Well I really didn't get that... maybe it's a bit to pseudo for me? ;)\n\nAnyways, I just joined here specifically to try to give a little bit of insight, since I've been working on most of the stuff listed above (website, tvc, some of the print...), and I just think it's a bit weird to go off on somebody trying to help out a little bit... Guess that's the good old internets for you. - Meh, maybe it's just to monday-ish :)\n\n"
    },
    {
      "time": "5 Nov 2007 — 3:14am",
      "content": "Nah, we usually are a _very_ civilized bunch compared to other internet fora. Little slips like this one are very rare. I'm supposed to keep things in check, but I've had loads of work lately, and as I do this on voluntary basis…\n\nI hope this little altercation didn't put you off too much. Welcome to Typophile, and I hope you'll enjoy your visits. And thanks for chipping in on this thread, much appreciated.\n\n"
    },
    {
      "time": "5 Nov 2007 — 3:55am",
      "content": "Nah, it's fine... Like I said, maybe it's just Monday getting to me - and thanks ;)\n\n"
    }
  ]
}
