{
  "id": "38277",
  "title": "Typefaces designed or released in 1949?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "For the life of me I can't find any. We're putting together an identity for a public figure, and he was born in 1949, and it would be a nice touch. I was hoping one of Zapfs faces would have come out then, or at least been started during '49, but it looks like a dead period between palatinio and optima.\n\nPreferably a sans, but I'll take a look at anything right now..\n\n",
  "author": "Jim Stafford",
  "time": "20 Oct 2007 — 7:51am",
  "uid": "18363",
  "comments": [
    {
      "time": "20 Oct 2007 — 8:24am",
      "content": "If you search the Global-Type database ( [http://www.global-type.org/Searching.743.0.html](http://web.archive.org/web/20140719124010/http:/www.global-type.org/Searching.743.0.html \"http://www.global-type.org/Searching.743.0.html\")), you'll find that 15 weights of various typefaces were released in 1949. Not sure which of these you can get in digital, though…\n\n"
    },
    {
      "time": "20 Oct 2007 — 9:55am",
      "content": "Are you looking for something related to the Beat culture and jazz era ?\n\n"
    },
    {
      "time": "20 Oct 2007 — 10:31am",
      "content": "Not especially -- client has stipulated all caps, sans and bold. Which doesn't leave a lot of wiggle room, so we were looking for more ways to tie the choice in.\n\nThanks for the GT-d link - didn't know it existed. I'll have a squizz.\n\n"
    },
    {
      "time": "20 Oct 2007 — 2:23pm",
      "content": "That's a seriously way kewl website, Dan: thanks for posting the link!\n\n"
    },
    {
      "time": "21 Oct 2007 — 10:33pm",
      "content": "Any edition of _An A-Z of Type Designers_ is a good resource for this... Following the name of each type designer is a list of his or her typefaces, followed by the year(s) of development or release.\n\nOn page 58 of the latest edition: Trade Gothic, 1948-60 (Jackson Burke)  \nOn page 59: Normandia, 1946-9 (Alessandro Butti, with Aldo Novarese)  \nOn page 74: Diethelm-Antiqua, 1948-50 (Walter J. Diethelm)  \nOn page 76: Electra, 1935-49 (William Addison Dwiggins)  \nOn page 101: Emergo, 1948-53 (Sem L. Hartz)\n\nAh, check this out, on page 111: Savoie, 1949 (Marcel Jacno)\n\nThe book has 200 pages, I'm sure there's some more typefaces to be found! :-)\n\nAnother good resource might be Sebastian Carter's _Twentieth Century Type Designers_.\n\n"
    },
    {
      "time": "24 Oct 2007 — 12:40pm",
      "content": "Wasn't there that WWII thing a few years prior to 49? Do you think that might have something to do with a scarcity of types released in 49?\n\n"
    },
    {
      "time": "24 Oct 2007 — 1:20pm",
      "content": "What would type designers have done during the war. I suppose a few would have served, but I can't think of a \"war effort\" field they could have entered en masse.\n\nUnless they were the ones writing \"Kilroy was here\" on everything that moved.\n\n"
    },
    {
      "time": "24 Oct 2007 — 2:08pm",
      "content": "The foundries that manufactured their designs would have certainly been preoccupied with casting all sorts of war material. And in that era type design was one aspect of a complex manufacturing process, I would think that the war would have curtailed or slowed down many types being released in the few years after it ended.\n\n"
    },
    {
      "time": "24 Oct 2007 — 2:09pm",
      "content": "Many factories (Monotype UK, D. Stempel AG Germany, etc.) were converted over to war industry production for a time. Many older type designers stayed in their posts during the war. Younger ones, like Zapf, were drafted, although his lettering skills lead to his being assigned to a cartography office in occupied France. Some other designers were not as lucky; Klingspor's Rudo Spemann died in action. And Vojtěch Preissig was interned in the concentration camp at Dachau, where he died.\n\nBy 1949, many English and German foundries (select foundries in both countries were bombed) seem to have back in business, at least that is what their period promotional materials seem to suggest.\n\n"
    },
    {
      "time": "24 Oct 2007 — 7:03pm",
      "content": "_And in that era type design was one aspect of a complex manufacturing process, I would think that the war would have curtailed or slowed down many types being released in the few years after it ended._\n\nI'm sure the war effort required rounding up every scrap of metal that could be put to use.\n\n"
    }
  ]
}
