{
  "id": "3830",
  "title": "Yo!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hey all. I'm new here, and so far, I really like everything you guys have going on this site. Lemme tell you a bit about myself. I am currently 17 years old (turn 18 next March (yay!)), and am an aspiring graphic designer. I am enrolled in the second, and final, year of a Visual Communications course at my county's vocational school, after which I plan on going to Mohawk Valley Community College in Utica, NY to get my 2-yr. degree in, obviously, graphic design. Other than graphic design, I play a Peavey Patriot 4-string bass for my really cool band (no demo tapes yet), and I am addicted to the strategy game \"StarCraft: Brood War\". I enjoy taking long strolls on the beach, and I consider myself a hopeless romantic ![:)](http://web.archive.org/web/20080312190309im_/http:/www.typophile.com/forums/clipart/happy.gif) lol sorry, got a little carried away with myself. Anyhue (little graphic designer joke), thanks for reading my excruciatingly long self-description, and I hope to meet you all here in the forums.   \n   \n -Cliffy   \n   \nP.S.-My name is Cliff ![:)](http://web.archive.org/web/20080312190309im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n [‹ Archive through January 18, 2003](http://web.archive.org/web/20080312190309/http:/www.typophile.com/node/6240 \"Go to previous forum topic\") [What makes a typeface unique to a nation or culture? ›](http://web.archive.org/web/20080312190309/http:/www.typophile.com/node/5768 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080312190309/http://www.typophile.com/user/776\" title=\"View user profile.\">smeagol</a>",
  "time": "<br>",
  "uid": "776",
  "comments": [
    {
      "time": " 1.Nov.2002 12.20pm",
      "content": "Cliff,   \n   \nI'm sure I speak for everyone here when I say \"Welcome\". We'll look forward to seeing your work up on the block for public flogging. er... critique. Consider it your initiation.   \n   \njared\n\n"
    },
    {
      "time": " 13.Jan.2003 2.56am",
      "content": "Hi Cliff,   \n   \nNice to see another person from Upstate NY. I grew up in Schenectady, but I live out in San Francisco these days (for the moment, anyway).   \n   \nIf you haven't already, you ought look into a summer program run out of Ithaca for high school students that dealt with graphic design, especially video and interactive (albeit when interactive meant \"flashy read-only 'multimedia'\") design. A friend of mine went through such a program and really enjoyed it. I don't remember much about it, but I'll see if I can get you more details if you're interested.\n\n"
    },
    {
      "time": " 13.Jan.2003 2.58am",
      "content": "Jared,   \n   \nI thought the first rule of Font Club was \"Don't Type About Font Club.\"\n\n"
    },
    {
      "time": " 13.Jan.2003 6.30am",
      "content": "And the second rule of Font Club is \"Don't Type About Font Club.\"\n\n"
    },
    {
      "time": " 18.Jan.2003 5.38pm",
      "content": "but Brad Pitt is just a figment of our imagination, so we can type what we want.\n\n"
    }
  ]
}
