{
  "id": "38312",
  "title": "Type Classifications",
  "forum": "Build",
  "tags": [

  ],
  "content": "Does anybody know of a decent tool to edit how fonts are labeled (and consequently displayed in a program like Illustrator)?\n\nI am interested in reclassifying some fonts, so that (a) they show up under one family in a piece of software and (b) don’t conflict with each other thus preventing a font manager like Suitcase Fusion from activating several weights at once.\n\nI apologize for posting this [again](http://web.archive.org/web/20081023162058/http:/typophile.com/node/35230), but I haven’t received any answers yet.\n\n [‹ VOLT Help.](http://web.archive.org/web/20081023162058/http:/typophile.com/node/38349 \"Go to previous forum topic\") [Publishing from Word ›](http://web.archive.org/web/20081023162058/http:/typophile.com/node/38214 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081023162058/http://typophile.com/user/5914\" title=\"View user profile.\">Sam Serif</a>",
  "time": "<br>",
  "uid": "5914",
  "comments": [
    {
      "time": " 22.Oct.2007 5.14am",
      "content": "“I am interested in reclassifying some fonts, so that (a) they show up under one family in a piece of software and (b) don’t conflict with each other thus preventing a font manager like Suitcase Fusion from activating several weights at once.”\n\nSorry no one’s taken this on. Please be specific: OSx?, what app?, what fonts?\n\nCheers!\n\n"
    },
    {
      "time": " 22.Oct.2007 6.29pm",
      "content": "This is a technical question. I’ll move it to the BUILD area.\n\nYou should be aware that some foundries would consider this modifying the font. Those same foundries do now allow for it. Your best bet might be to contact the foundry from whom you licensed the type and ask if they can supply you with split families. I know Linotype offers this for one.\n\n"
    },
    {
      "time": " 22.Oct.2007 8.12pm",
      "content": "This happens on Windows XP and (currently) on my laptop running OS X v10.4 ... I’m having particular problems with a broken family of Scala used by any major application: specifically Illustrator, Photoshop and InDesign CS3. Is that specific enough?\n\n"
    },
    {
      "time": " 23.Oct.2007 4.11am",
      "content": "“Is that specific enough?”  \nYes. Thank you for your response. My advice is to contact the vendor from whom you purchased the broken family of Scala and have them replace it with a product that works for you.\n\nCheers!\n\n"
    }
  ]
}
