{
  "id": "38328",
  "title": "Pattern Building in Illustrator",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was wondering if any of you have a fool proof method of making a seamless pattern within Illustrator? Any tips/tricks/voodoo you may pass on is greatly appreciated. I'm about ready to give up and start selling coffee.\n\n",
  "author": "<a href=\"/web/20101022163959/http://typophile.com/user/15022\" title=\"View user profile.\">umlautthoni</a>",
  "time": "<br>",
  "uid": "15022",
  "comments": [
    {
      "time": "",
      "content": "I’ve always wondered about this, too. When I follow the instructions something always ends up shifting over a little after the first few rows.\n\n"
    },
    {
      "time": "",
      "content": "I turn the grid lines on & turn on snap to grid. Make sure each seam point falls directly on a grid intersection. Keep an eye on the X & Y coordinates in the transform palette so you know it's snapping to the grid like it should (you should have values such as 14 or -6, not something like 14.002 or -6.175).\n\nTo me it's easiest to check how it will tile by duplicating your working copy, dragging it down and aligning it where it will tile. It sometimes takes a few times to get it right.\n\nI have noticed some patterns will still show tiny hairlines, even after I go through and inspect the seam points and everything checks out. They print fine though.\n\nWhen adding a pattern to a shape you may find that you want to move the fill itself without moving the shape. Make sure nothing is selected, then hold down the tilde (~) key, then click on the pattern within the shape to move it.\n\nI hope this helps. I must apologize if any of this is difficult to follow, I didn't get much sleep last night to make a deadline so I'm going through the motions today. :-)\n\n"
    },
    {
      "time": "",
      "content": "Step 1: Define the rough pattern in a square\n\nStep 2: Make a copy of the square, aligning it with the first; this will show any weird overlaps (see red arrows)\n\nStep 3: Select any element you want to move AND it's \"clone\", and move it til it's in a better position.\n\nStep 4: Keep doing this until your \"original\" square is completely surrounded by copies. If you need to tweak an element, make sure all its copies are selected at the same time (so any changes \"update\" in all nine squares).\n\nStep 5: Select EVERYTHING that overlaps your original square (any object going over the \"edge\" will be repeated on an opposite side, and anything on a \"corner\" will be on all four corners) and copy it to a new area/file/whatever. I find this easier to do in outline view. Select it all and define a pattern (rect should be in BACK, and probably not stroked).\n\nStep 6: test it and go!\n\n ![](http://web.archive.org/web/20101022163959im_/http:/typophile.com/files/patterns_3964.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I joined today primarily to thank mjpatrick for this:\n\n\"...you may find that you want to move the fill itself without moving the shape. Make sure nothing is selected, then hold down the tilde (~) key, then click on the pattern within the shape to move it.\"\n\nI was pulling out hairs trying to find out how to get my watercolor swatches created in Painter to stop tiling. I had resorted to making them huge, and I even read the manual, sort of. Finally I googled my question, was sent here and all my planets are lined up again. Thank you MJ! And I look forward to reading more on this site.\n\nRobin in Oregon\n\n"
    },
    {
      "time": "",
      "content": "This almost slipped by me. You're welcome, although I think it was kinda luck this carried over to Painter. Nonetheless I'm glad it was able to help you out. This is a great site with many talented people, welcome aboard!\n\n"
    },
    {
      "time": "",
      "content": "Thanks again! To clarify, I created the swatches in Painter but was building the illustration in AI, using my watercolor fills instead of flat color. Even my editor is impressed with the new look and that = a very good thing.\n\n"
    }
  ]
}
