{
  "id": "38336",
  "title": "Are forum postings unusually low?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just curious---on the forum page there's that list of top ten posters. Typically you'd need to be averaging close to 5 posts a day, sometimes more, to crack the list. Earlier today I noticed number 10 had just 23 posts in the last 10 days---lowest I've ever seen it since I began hanging around these forums a few months ago. At this rate, I'll eventually crack the top ten by virtue of the list sliding down until it hits me (I think I average maybe one post a day).\n\nAre a lot of typophiles on holidays, are just too busy with projects that they don't have time to post?\n\n",
  "author": "Gary Long",
  "time": "22 Oct 2007 — 5:09pm",
  "uid": "19337",
  "comments": [
    {
      "time": "22 Oct 2007 — 5:29pm",
      "content": "I guess the people in the list aren't posting a lot. But if there are 100 people who post once each, that would equal in lots of posts. ;)\n\nNaw... I guess it also depends on what kind of threads are active; what kind of discussions and subjects, etc.\n\n"
    },
    {
      "time": "22 Oct 2007 — 6:58pm",
      "content": "I guess you could start up provocative threads to induce posts, things like \"Helvetica sucks\" or \"My Baskerville is better than your Baskerville\".... ;-)\n\n"
    },
    {
      "time": "22 Oct 2007 — 7:05pm",
      "content": "100 X 1/day = lots.\n\n... and who's the math wiz today? :o) (Not me I assure you - Just trying to get my numbers up)\n\nR\n\n"
    },
    {
      "time": "22 Oct 2007 — 9:04pm",
      "content": "\\>Are a lot of typophiles on holidays, are just too busy with projects that they don’t have time to post?\n\nLots of Red Sox fans? That's my guess.\n\n"
    },
    {
      "time": "22 Oct 2007 — 10:17pm",
      "content": "_...just too busy with projects that they don’t have time to post?_\n\nThat damned thing called work keeps getting in the way of posting on Typophile. ;-D\n\n"
    },
    {
      "time": "23 Oct 2007 — 12:09am",
      "content": "provocative threads?\\>\n\nWell if it makes anyone feel better I had makeup sex with Neue Helvetica Ultra Light this past weekend.\n\n:-) Mikey\n\n"
    },
    {
      "time": "23 Oct 2007 — 6:10am",
      "content": "Hey, if the prolific posters are taking a break, it is a chance for the rest of us to get on the list. I haven't been listed for months.\n\nPost away, mateys.\n\n"
    },
    {
      "time": "23 Oct 2007 — 12:31pm",
      "content": "Too busy at the moment with writing and design projects. Some more discussionworthy threads would boost the numbers. I don't go in much for discussions of software.\n\nProvocative topics:  \nHow to Remove Font Caught in Pants?  \nNeue Helvetica's Bedroom Secrets  \nThe Diary of Anne Font  \nDon't Raise the Crossbar---Lower the Hyphen  \nDon't Tell Mom the Typesetter's Dead  \nPostscript Always Renders Twice  \nRomancing Sumner Stone  \nA Victim of Circumflex\n\nWould there be any interest in a thread on fonty-flavoured film titles? I have a list of them all ready to go ;^)\n\nj a m e s\n\n"
    },
    {
      "time": "23 Oct 2007 — 1:50pm",
      "content": "[http://typophile.com/node/38372](http://web.archive.org/web/20121028214126/http:/typophile.com/node/38372 \"http://typophile.com/node/38372\")\n\nChrisL\n\n"
    },
    {
      "time": "23 Oct 2007 — 3:08pm",
      "content": "<cite> I haven’t been listed for months.</cite>\n\nI've never been listed. Every time I come close to getting on the list, something comes up and I can't post for several days.\n\n"
    },
    {
      "time": "23 Oct 2007 — 3:31pm",
      "content": "I have felt that posting is actually low and topics are getting less interesting on the last month as well.\n\nFor the last year I have been too busy at work to post on typophile (no internet at home).\n\nThe absense of Hrant may be part of the cause, but there are many acknowledged people who have not been posting lately.\n\nHéctor\n\n"
    },
    {
      "time": "23 Oct 2007 — 3:40pm",
      "content": "The reason? Hrant has been missing, lately… He used to be good for half of the postings here. ; )\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "23 Oct 2007 — 3:43pm",
      "content": "Dan Reynolds and Paul Hunt are now in Reading working hard, cutting in to their posts.\n\nChrisL\n\n"
    },
    {
      "time": "23 Oct 2007 — 4:06pm",
      "content": "<cite>Dan Reynolds and Paul Hunt are now in Reading working hard, cutting in to their posts.</cite>\n\nI would totally give up Typophile for Reading.\n\n"
    },
    {
      "time": "23 Oct 2007 — 6:34pm",
      "content": "\\>I would totally give up Typophile for Reading.\n\nI'm still catching up on back issues here.\n\nR\n\n"
    },
    {
      "time": "24 Oct 2007 — 12:40am",
      "content": "I'm still trying to post :(  \nI've only had an internet connection in flat flat since yesterday. But this is the first time I've had internet at home since April. Wonders never cease…\n\n"
    },
    {
      "time": "24 Oct 2007 — 12:47am",
      "content": "Nice to see your post Dan. Happy Posting!\n\n"
    },
    {
      "time": "24 Oct 2007 — 11:16am",
      "content": "Where is Hrant? It HAS been quiet around here lately...\n\n"
    },
    {
      "time": "24 Oct 2007 — 11:40am",
      "content": "Wheeze...hack...cough...need air...what was the question?  \nOh yeah, real life keeps getting in the way of goofing off. I hate it when that happens.\n\n"
    }
  ]
}
