{
  "id": "38330",
  "title": "What's on your word processor for everyday use?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I don’t know much about typography, and I certainly wouldn’t begin to try and work out a font on my own. But I do know that I really don’t like the fonts that get pushed on me from corporate America. At least not for my printed, personal correspondence.\n\nI don’t like Arial, I don’t like its successor, Calibri; and I hate using both in my personal correspondence. I understand they look good on a myriad of computer screens, and thus will be the standard for e-mail for years and years to come. I can live with that. But I actually still have people that I post written letters to, and am wondering if there are any really great alternatives.\n\nMy handwriting is atrocious, which makes reading letters from me more of a chore than a pleasure. The reason I send certain things via snail mail has mostly do with the audience. Most are old enough to remember when choosing Courier, Elite, or Pica was a revolution in convenience. These are also people that I like to make a connection with, and would actually take the time to sit down and hand-write a letter if the result ever turned out legible.\n\nI guess I’m looking for a font that somehow conveys a certain warmth, familiarity, and homeyness. Something that feels friendly. Is that possible?\n\nI’ve played around with some scripts and handwriting fonts, but these seem either faked, forced, or are just hard to read. I’ve looked at some fonts that remind me of newspaper and book type, and like these better - I guess because I am a reader and these feel comfortable - but they also don’t seem very personal or personable.\n\nSo, for all of the people here who obviously embrace typography as either a vocation or avocation, what do you use in your everyday correspondence, assuming you haven’t completely gone over to the dark side of electronic correspondence? Do you just use Arial, or have you found something that feels a lot more personal? What is in your word processor?\n\n [‹ New book from Roberto de Vicq de Cumptich](http://web.archive.org/web/20080919173250/http:/www.typophile.com/node/38373 \"Go to previous forum topic\") [Local Gothic ›](http://web.archive.org/web/20080919173250/http:/www.typophile.com/node/38376 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080919173250/http://www.typophile.com/user/23079\" title=\"View user profile.\">JHMcLellan</a>",
  "time": "<br>",
  "uid": "23079",
  "comments": [
    {
      "time": " 22.Oct.2007 3.55pm",
      "content": "I do just about all my writing with Verdana at a minimum of 12 points. Otherwise I’m going to end up blind. If I’m feeling especially motivated I might change over to a serif at a smaller size before printing.\n\n"
    },
    {
      "time": " 22.Oct.2007 4.12pm",
      "content": "I don’t have a word processor; I’m lucky being in the design business that I have Adobe InDesign on my computer, and that’s what I use to compose personal correspondence. As to the typeface, I use, at various times, Elysium, Centaur, Bembo, Garamond, Goudy Old Style. The italic of some fonts (such as Goudy Old Style) is particularly readable and you may find these warmer and more informal than the roman. Also, if you set the text ragged right, it won’t seem as cold and formal as fully justified.\n\nThe trick when using proportional typefaces for correspondence, if you’re putting them on 8.5” x 11” paper, don’t make the text column six and a half inches wide. Four inches is much easier to read. I push this narrower column to the right and use the wide space on the left for drawing cartoons, printing pictures, recipes, etc.\n\n"
    },
    {
      "time": " 22.Oct.2007 4.14pm",
      "content": "I’ve got Helvetica (14 pt) as the default on TextEdit, but if I’m actually sending out something that doesn’t specify a typeface (some only want Times or Arial, for example), I usually use Palatino or Adobe Garamond.\n\n"
    },
    {
      "time": " 22.Oct.2007 8.39pm",
      "content": "Interesting thread. When I first went out on my own, I purchased and used Filosofia for my correspondence and invoices and other official correspondence. It was fantastic, at first. Then I grew more fond of, yes, Georgia in Microsoft Word. I think I was the only designer in the entire world that actually liked using Georgia because of its legibility in print and on screen. It really is a perfect in so many ways and I still contend that, despite it’s faults, it can look good in print.\n\nUnsurprsingly, for the past year or so I’ve been using Mercury because it has a nice range of textures and captures a sense, to me, of casual formality.\n\n"
    },
    {
      "time": " 22.Oct.2007 9.14pm",
      "content": "I use plain-text e-mail, IM, and SMS for all my personal correspondence, so there is no font selection involved.\n\nWhen writing in my word processor, I use plain Calibri. I wait before I’m completely done writing before I do any formatting.\n\n"
    },
    {
      "time": " 22.Oct.2007 11.12pm",
      "content": "Interesting thread indeed, especially for a non-designer like myself.\n\nI use Apex New for all my office work: letters, project summaries, and the like. It is extremely cool and contemporary, with a great color for this purpose especially in the Book weight.\n\nI use Cycles for most of my more literary work, especially books and scholarly articles. I find it subtle, well balanced at its various optical sizes and, again, with a great color and rhythm on the page.\n\n"
    },
    {
      "time": " 22.Oct.2007 11.27pm",
      "content": "For business correspondance I use Freight (more sans than text) and InDesign. I don’t like Word, and in TextEdit the font seems to be Helvetica at the moment. Emails go out in Lucida Grande.\n\n"
    },
    {
      "time": " 23.Oct.2007 4.38am",
      "content": "For email, I use 14 pt Helvetica. Maybe I’m getting older—well, no maybe there—but my eyes find that larger-sounding size more comfortable. I guess I’ve just grown used to it; 14 pt does not seem huge to me any longer. And it’s true that sans serif is easier to read on-screen, at the same time that serif type is easier on the eyes on a printed page.\n\nFor paper correspondence, Palatino has been my choice since the day I got my first Macintosh in November of 1989. I have always liked it’s contours.\n\n"
    },
    {
      "time": " 23.Oct.2007 6.03am",
      "content": "For memos and stuff, I use the defaults, TR and Arial. No one around here but me is typographically aware.\n\nI did do my resume in ID using Briosio, however, and used that font for the cover letters when applying for jobs a few years ago.\n\n"
    },
    {
      "time": " 23.Oct.2007 8.46am",
      "content": "My MS Word default is the always-easy-to-read Utopia, truly an underappreciated font. I too use Helvetica for my mail program default.\n\n"
    },
    {
      "time": " 23.Oct.2007 4.39pm",
      "content": "The interesting part of this thread are the responses. Thanks to all who have posted so far, and to those who still might.\n\nI feel Don McCahill’s pain. I manage my wife’s medical practice, and had to redesign all the patient information forms. Had I left it up to anyone else in the office, everything would use Arial. I was real proud of myself for finding an appropriate font for headings and Verdana for text.\n\nThanks to Gary Long for the additional suggestions. I’m thinking that Goudy Old Style italicized is a winner. Narrowing the print column in my letters: genius!\n\nI’m still re-thinking some of the fonts that I’m familiar with (eg Helvetica, Georgia) and tracking down those new to me (Brosio, Freight, Apex New, eg).\n\nSpire: You don’t know what you are missing, man.\n\nThanks again. There are probably three people in town that I could talk typography to (what little I know) and I’m not even sure who they would be. Sites like this are what make the internet great.\n\n"
    }
  ]
}
