{
  "id": "38331",
  "title": "ski-boat electronics startup company logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,\n\nI’m looking for feedback from the much-more-creative-than-I community regarding the logo for my startup company. I want to stay fairly simple but still exhibit the following characteristics (for the electronic product this logo will be attached to):\n\neasy-to-use  \nconfident  \nski-boat related (i.e. marine-like)  \ntechnological\n\nI’ve struggled with the ’wave’ traversing the logo, trying to keep the text easily readable yet big enough to show it was purposely placed there (i.e. it actually looks like a wave versus a ’wavy horizontal line that looks like a printer defect’).\n\nAnyway, my company has zero income currently, and thus I’m trying to do the logo myself if at all possible. I’m very grateful for any ideas and feedback, regardless of how harsh. I’m still open to professional design services if anyone can recommend a particular firm that’s not too expensive and outputs good work...(if recommendations are legit on this forum).\n\nThanks in advance for everyone’s help!  \nJustin\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/hydrophase_base_outline_blue_72_pt_close_spacing_new_curve_320_3545.gif)\n\n [‹ Wordmark.](http://web.archive.org/web/20071229050610/http:/www.typophile.com/node/38729 \"Go to previous forum topic\") [(Non)logo. Please critique. ›](http://web.archive.org/web/20071229050610/http:/www.typophile.com/node/38465 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071229050610/http://www.typophile.com/user/23081\" title=\"View user profile.\">jmuessig</a>",
  "time": "<br>",
  "uid": "23081",
  "comments": [
    {
      "time": " 22.Oct.2007 4.08pm",
      "content": "Maybe you could have a contest and pay the winning logo creator a PRIZE!!\n\n"
    },
    {
      "time": " 22.Oct.2007 4.12pm",
      "content": "Ouch! Whatever happened to “innocent until proven guilty”?\n\n"
    },
    {
      "time": " 22.Oct.2007 4.35pm",
      "content": "You’re right, Linda, I apologize.\n\n"
    },
    {
      "time": " 22.Oct.2007 4.51pm",
      "content": "Justin, apologies to you. I see you’re from Texas, my home state.\n\nSharon\n\n"
    },
    {
      "time": " 22.Oct.2007 5.01pm",
      "content": "Hi Sharon,\n\nNo problem. To be honest, I’m still not quite sure what you were insinuating. Sorry if I touched a sore spot...\n\nIn any case, I’d appreciate your feedback. I have hard time being objective about the logo I created. I know its not a Picasso, but hopefully it meets the objectives I was aiming to convey in it.\n\nAnyway, your candid feedback is appreciated.\n\nThanks,  \nJustin\n\n"
    },
    {
      "time": " 22.Oct.2007 5.05pm",
      "content": "I’ve had to wrestle today with a client who wants something for nothing. I took it out on you. Bad on me.\n\nI think it would help if you posted a picture of the component you want a logo for. It would help with size, etc.\n\nSharon\n\n"
    },
    {
      "time": " 22.Oct.2007 8.46pm",
      "content": "Understood.\n\nBesides the typical corporate branding locations (i.e. website, stationary, business cards, etc), the logo would go on a small black box with a cover whose dimensions are shown in the attached picture...\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/Untitled_5240.gif)\n\n"
    },
    {
      "time": " 23.Oct.2007 8.48am",
      "content": "It’s quite hard to read the letters. I’ve got no easy solution for that, but I’d try a thicker outline for the lower part.\n\n"
    },
    {
      "time": " 23.Oct.2007 11.06am",
      "content": "Thanks, Henry. I agree about the readability and have tried increasing the thickness of the lower outline below...\n\nIs this more readable?\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/hydrophase_base_solid_blue_72_pt_close_spacing_think_outline_new_curve_320_3587.gif)\n\nOr should I ditch the wave and go with the plain, yet more readable solid logo?\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/hydrophase_base_solid_blue_72_pt_close_spacing_3645.gif)\n\n"
    },
    {
      "time": " 23.Oct.2007 12.28pm",
      "content": "How about a rectangle strip, divided by a waveline, top half blue, bottom half white, then put in the text as reverse (the part above the waveline in white, the part below in blue)? Give it a try.\n\nBTW, the kerning of the letters need some fine-tuning, but we can get to that later.\n\n"
    },
    {
      "time": " 23.Oct.2007 2.39pm",
      "content": "Good suggestion, Henry - thank you.\n\nIt is definitely more readable now. I’m still not thrilled with the logo, though. I’ve probably reached the limit of my amateur creativity...\n\nAny other suggestions are appreciated as always.\n\nStrip Box w/ wave dividing top/bottom.\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/hydrophase_base_solid_blue_72_pt_close_spacing_strip_box_320_5264.gif)\n\nB/W\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/hydrophase_base_solid_blue_72_pt_close_spacing_strip_box_BW_320_3740.gif)\n\n“the flag...”\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/hydrophase_base_solid_blue_72_pt_close_spacing_flag_320_6035.gif)\n\n"
    },
    {
      "time": " 23.Oct.2007 4.23pm",
      "content": "Justin,\n\nI think it’s wise that you are recognizing that this just might not be your forte. There are many designers on here that would be able to design a very good logo for your company. Startups face numerous obstacles entering the business world, and a good logo can at least create an impression of seriousness, quality and trust. Odds are you won’t get a logo for free (you shouldn’t expect that), but consider the cost part of the initial investment made in your company.\n\n"
    },
    {
      "time": " 23.Oct.2007 8.39pm",
      "content": "Hey Justin,\n\nThe logo itself isn’t bad at all, kerning aside (and someone more knowledgable than me can advise), it’s simple and strong and does everything it needs to as far as I’m concerned. It’s mariny and sporty, nice work.\n\nHowever I would lose the outline and the reversed-out-flag thing cause the former is hard to read and the latter is hard to read and looks a bit wack. This would especially be tru at small sizes.\n\nI would keep the wave-device and simply make the lower part of the letters a lighter/different blue, whether that means a blue from a different tonal group of a screened back version of the original blue. You could either make each blue butt up against one another or leave a white line between to emphasise the shape, If I were doing this, I would play with the thickness of the line at various places along it to give it a bit of personality.  \nhope this is helpful\n\nNick\n\n"
    },
    {
      "time": " 24.Oct.2007 1.31am",
      "content": "I also think that the current concept is pretty workable and shouldn’t be abandoned easily. I agree with Nick that the idea of changing the lower part to a lighter blue should be explored — although I think the current color theme which represents the blue sky and the white snowy ground is worth keeping if possible.\n\nRegarding your latest batch, the last one isn’t working at all. You should try make the strip a bit wider (so there is more spare space left and right) and putting a border to the white lower part (box it in instead of leaving it open).\n\n"
    },
    {
      "time": " 24.Oct.2007 2.37am",
      "content": "I like this logo too. Work on it. If nothing else you will create a logo yourself (which is already quite nice and working) learn a lot and save some money too while doing it.\n\nBut. the last version with a rectangle and negatives over it is working and is readable. BUT. Yes there’s a flaw in it. Look at the curve on the letter “e”. It crosses it just where it shouldn’t ant it makes it messy. Your original design has a different and better solution in this area.\n\nYou could also try a double colour version instead of a negative shape. Just don’t use outlines because you’d have nothing else than problems with it. But there’s still one concern with double colour version. Think of your logo in one solid colour (stamps for instance). How would you do it there? It would complicate things.\n\n"
    },
    {
      "time": " 24.Oct.2007 9.49am",
      "content": "<cite>Think of your logo in one solid colour (stamps for instance). How would you do it there? It would complicate things.</cite>\n\nAlthough the FedEx logo uses outlines to solve this problem :^)\n\n- Lex\n\n"
    },
    {
      "time": " 24.Oct.2007 12.58pm",
      "content": "Well Lex. In this case of converting a two colour logo would result in outlines here too. As long as those outlines are sufficiently balanced in their width. Not to strong and not too narrow to make it to delicate for stamp rubber.\n\nThat’s why this may be a problems since our friend Justin here admits he hasn’t got enough experience. Maybe he’s just being modest or not, but that’s what he says.\n\n"
    },
    {
      "time": " 24.Oct.2007 2.11pm",
      "content": "As a rule I don’t use outlines either, but I was just pointing out one successful exception to the rule that Justin might want to look at :^)\n\n- Lex\n\n"
    },
    {
      "time": " 24.Oct.2007 2.29pm",
      "content": "Come on, Robert, give the fellow a break. For an “inexperienced” guy, his original concept is pretty presentable. Plus, how many logos out there have a good mono version? — I’m not saying it’s unimportant, I’m saying it shouldn’t be the primary concern. And an extra-low-res mono version for stamps? That really has to be a side topic. I bet even top professional designers don’t ask themselves, “how would this logo look at 80 \\* 60 pixels in single color”, until after they’ve pinned down the concept.\n\n"
    },
    {
      "time": " 24.Oct.2007 3.15pm",
      "content": "If the right side of my brain wasn’t dead at birth, it surely shrivled up and died in engineering school, so I really appreciate everyone’s suggestions and comments. It is encouraging to know that while I know the logo is far from perfect, at least I am somewhat getting the idea across. For some reason I can tell if a logo is crap or not, but seldom do I know what to do about it.\n\nI was busy today with the other kind of artwork that I do - circuit board layout. I’m now switching gears over to logo work again and hope to incorporate everyone’s feedback into another revision. I’ll post it up when I’ve got a rough image ready to go.\n\nAnd, to answer questions posed before, I am definitely inexperienced in the logo realm. But, I work with a lot of other software tools (i.e. circuit design / capture / layout tools, autocad, etc) so I can usually acquire a rudimentary understanding of how to get around.\n\nI’ve actually learned a lot so far, and that’s directly a result of those who donated their valuable time to critique my logo on this forum. I have a new respect for logos and artwork when I see them now...\n\n"
    },
    {
      "time": " 24.Oct.2007 6.33pm",
      "content": "Try setting it in solid blue with a thin white (negative space) wave running across the centre line, getting thinner in the middle. Again, watch how the wave interacts with the negative spaces of the letters.\n\nThis should give you a nice one-colour version, and you could make the bottom half a different colour if you’d like for a two-colour (I’d go with a darker blue or aqua colour)\n\n- Lex\n\n"
    },
    {
      "time": " 25.Oct.2007 3.21am",
      "content": "@Henry:  \nYou’re right. I can see that more and more logos these days completely discard the mono version. I can’t even imagine how a logo like Virgin Media would look like in mono? I don’t know how a mono version actual looks. Probably without blurs etc. Just clean lines.\n\nI used to be taught you have to create your logo mono and then add other things too it if needed. If it works in mono, it’s much easier to make it colourful and make it work with hues.\n\nBut looking at usage these days, stamps are still VERY much used for various paperwork. It’s somehow a proof beside the signature. Normally. At least in the country where I’m from.\n\nAnd yes Henry. I did say to Justin that his original is a very good example how a not so experienced person in design can create something that works. It needs work, but the rough idea and the result is much better compared to many other designs we have seen here done by somehow professionals. We all know that creating a logo is not a simple process at all and it doesn’t rely so much on a professional mind than on a great idea. The end result may be much better when a professional does it but without a good idea even a professional can’t make miracles.\n\n"
    },
    {
      "time": " 25.Oct.2007 5.30am",
      "content": "(just a little, a little more space, a little more space between the letters).\n\n"
    },
    {
      "time": " 25.Oct.2007 8.34am",
      "content": "Not only stamps, but if you need to include the logo in a newspaper ad, you may need a good one-colour version that can be reproduced at small sizes.\n\nOr even on a small black box with a cover whose dimensions are shown above...\n\n- Lex\n\n"
    },
    {
      "time": " 25.Oct.2007 8.35am",
      "content": "I think anything that splits the letterforms in half like this is going to be very hard to read, especially at small sizes. I’d much rather see the waveform brought outside of the letters, maybe as an underline or attachment to the descenders. As a concept, it’s fine. Executionally, it needs considerably more exploration.\n\n"
    },
    {
      "time": " 25.Oct.2007 9.52am",
      "content": "I think the original idea is workable. The contrast between the top color and bottom color would need to be reduced. On the cover it might be textured on the top, and smooth on the bottom. In print maybe blue and light blue. Or blue and aqua. Etc. Blue and White is too much contrast and hurts legibility I agree.\n\nAn added benefit of lowering the contrast: you could get rid of the ouline stroke. That will also help legibility. Finally, if you must have the outline stroke, instead of outlining the letters themselves, copy the word, paste it behind the original and add the stroke from below. That way the interior shapes of the letters don’t get eaten away.\n\nR\n\n"
    },
    {
      "time": " 25.Oct.2007 12.56pm",
      "content": "Okay, here are the latest renditions...they’re rough, but hopefully you can see the idea, anyway.\n\nOne color - gift wrap?\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/hydrophase_base_solid_blue_72_pt_close_spacing_variable_line_2_320_5014.gif)\n\nTwo colors - Pepsi?\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/hydrophase_base_solid_blue_72_pt_close_spacing_variable_line_4_320_5444.gif)\n\nOne color - B/W\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/hydrophase_base_solid_blue_72_pt_close_spacing_variable_line_5_320_3702.gif)\n\nDoes anyone think these have any potential or should they not pass go and seek out the recycle bin?\n\n-Justin\n\n"
    },
    {
      "time": " 25.Oct.2007 1.06pm",
      "content": "It has definitely improved. I’m not sure I’d modulate the line weight of the wave, as the narrower portions could be a problem in reproduction. That lowercase ’e’ is really a pain though. I think there’s potential to the concept, but needs further study.\n\n"
    },
    {
      "time": " 25.Oct.2007 1.22pm",
      "content": "I have to say I don’t like the latest batch, particularly because it’s lost the “blue sky and snowy ground” association.\n\n"
    },
    {
      "time": " 25.Oct.2007 3.44pm",
      "content": "What I reckon, for what it’s worth, this is good, better than the reversed out shape thing:\n\nI agree with Jonsel about the lowercase ’e’, it looks a bit ugly, the ’s’ too and even perhaps the ’y’ — the line really needs to be sympathetic to the shapes of the letters, to make sure bitsy, secondary and distracting shapes arn’t created, I’m not sure how to exactly do this but to start with:\n\nYou could make a wave shape that isn’t completely symmetrical, so it might start lower on the ’h’ with a sharper curve and then flatten out more as it gets to the ’e’, you could experiment to try the best fit for the letters\n\nOr use a similar wave to what you have now but make sure the wave completely bisects/replaces the ’e’s eye that would get rid of the worst of the problems\n\nI like the differing line-height, I reckon the height on the ends could be made even greater so the effect is obvious and it looks decisive\n\nColour-wise have you tried the two-tones of blue?\n\nAnd finally Henry, I’m not sure he was going for a snowy ground/blue sky association, that may make sens for a skiing company, but perhaps not so much for a ski-boat company —\\> am I missing something?  \nCheers\n\n—N\n\n"
    },
    {
      "time": " 25.Oct.2007 5.24pm",
      "content": "Ouch! The whole time I though his company were in the snow mobile business — I don’t know why I thought that, except maybe my brain translated “ski = snow, boat = mobile” when it happened to be having an off-time.\n\nHowever, in case of ski boat, the blue-white color scheme still makes perfect sense, as white represents the foam of the wave, while blue remains the sky. So I’m displease with the latest batch just the same.\n\n"
    },
    {
      "time": " 25.Oct.2007 11.45pm",
      "content": "What about ALL CAPS? Normally I wouldn’t suggest such a thing but with the wave producing some much Visual Noise making it hard to read the word - I think it would be a good idea to try to solve for the problem.\n\nI second the idea that hiring somebody to do this might be a good plan.\n\n"
    },
    {
      "time": " 26.Oct.2007 9.00am",
      "content": "Hi All,\n\nWell, while I still like my concept, I agree that I can’t find a good way to make the wave work inside the lettering. It may be that I have to do some kind of wave on the outside, or eliminate the wave altogether.\n\nIt seems like one of the more difficult questions to answer in the logo design field is when is a logo good enough (i.e. when do you stop developing it?)\n\nAnyway, I know my logo isn’t quite there yet. But, I believe most of you that have read this thread understand what I’m shooting for.\n\nSo, if any of you are interested in quoting out professional services to me, please email me. I’d like to know how much it would cost to finish out the logo (i.e. kerning work and somehow making some kind of wave work with it), or if starting from scratch is the best way to go, I would like to get quotes on that too (though money is definitely an object for me at this time...) :) I’d much rather give business to folks like yourselves contributing to the industry versus people on ifreelance, etc.\n\nThanks again to everyone for your time and effort. I plan to post the professionally design version on this thread once it is completed so you know how it turned out.\n\n-Justin\n\nBTW\n\nHenry, I like the sky blue / white logo too. You’re right, it doesn’t much matter whether it’s snow skiing or water skiing - it seems to work for both! :)\n\nNicholas, I did try different tones of blue, but couldn’t find a pair that I liked or showed the wave enough. The problem seemed to be that if the colors were not contrasted too much that the ’wave’ became perceptually hard to see / focus on. That may be mitigated by increasing the weight of the intersecting wave line; I’ll continue to look at that.\n\nAs far as texturing half of the logo for a one color ’stamp’ logo, I wasn’t able to find a good texture that simply reduced the color saturation (if you will) of the target color. It would be great if someone developed a filter somewhere that basically turned a solid color into a screen door / lattice / hatch type fill pattern. If anyone knows of this, please let me know!\n\n"
    },
    {
      "time": " 26.Oct.2007 12.28pm",
      "content": "In contrary to some others, I think you should try to continue working on this promising concept on your on, and I believe you can bring it to a presentable result.\n\nRealistically, a logo that looks semi-professional is certainly going to be good enough for a small company, as the majority of small businesses have logos that looks throughly amateurish (although some of them are done by professionals or self-proclaimed professionals).\n\n"
    },
    {
      "time": " 26.Oct.2007 8.44pm",
      "content": "This latest batch is good - this is the sort of thing I was talking about two posts ago.\n\nI’d make the curves of the wave much more subtle, barely deviating from the horizontal. Try to make the right side of the wave work with the natural gap in the ’e’. Reversing the flow of the wave may help this, or it may not.\n\nI also disagree with Jonathan - I think there should be more modulation in the stroke. Make it about twice as thick at either end, and just a hair thicker in the middle.\n\nAs for colours, try something like PMS 7474 for the “water” and PMS 2915 for the “sky”. These are just suggestions. Play around with the colouring - it can work.\n\nAs for one-colour, don’t use a patterned fill. This will only dull your logo’s impact. Keep it solid like you showed in your last example.\n\nHave you thought about using an italicized type to suggest speed? It might come off as cheesy, but it’s worth a look.\n\nI agree with Henry that this is going in a great direction and it just needs a little massaging to look good.\n\n- Lex\n\n"
    },
    {
      "time": " 27.Oct.2007 11.52am",
      "content": "I totally agree with Lex. And I also think that you’ve done a very good job so far so you don’t need any designer to hire. You’re on a good way to make this logo work.\n\nLex suggested italic type. I wouldn’t suggest to use real italics, because their slant may be too much. Try to slant it yourself for about 5 deg. Your Futura is oblique anyway so you can slant it yourself.\n\nRegarding the line: follow Lex’s advice about thickens. But reverting the slant may create a negative effect of falling instead of raising. Try to adjust the curve that much so it will break the “e” below the horizontal joint. And it will stop there. And it will be much better.\n\nBut I would suggest something else. Tweak your extenders to make them shorter. “h”, “y”, “d”, “p” and “h” extent too much to my eye. It will also make the logo more compact and even more powerful.\n\nRegarding the colours: use flat colours as Lex suggests. Don’t use gradients/raster. You don’t really need it.\n\nAnd when you create the “split wave” try to position it on the letters to not create any thin or very pointed parts on letters (look at your “s”). And avoid too many changes in a small area (as you have in your current “e”). This will make it more natural and it won’t look it forces the text to split.\n\n"
    },
    {
      "time": " 29.Oct.2007 2.34pm",
      "content": "Hi guys,\n\nThanks everyone for their encouragement to keep going with the logo work!\n\nAfter several hours of frustration trying to get the wave inside the text to work well with the “e”, I have decided to try another concept - having the wave outside the text. Now it looks like the “p” will be the challenge (the wave kind of makes it look like an “r”...) I haven’t completely abandoned the wave inside the text, but am moving there fast.\n\nAnyway, I’d appreciate your feedback on the ’wave outside of the text’ concept. Also, please comment on the kerning - I tried to improve it but don’t know if it’s acceptable yet or not. The only difference in kerning between the two examples below is the “e” at the end is pulled in on the first example.\n\nThe first image I believe conveys more “speed” with the more aggressive curves in the wave.\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/swoosh_anti_alias_white_tex_4872.gif)\n\nThe second image I believe looks more relaxed and resembles more of a sine wave.\n\n ![](http://web.archive.org/web/20071229050610im_/http:/www.typophile.com/files/wave_anti_alias_white_text_3663.gif)\n\nComments?\n\n"
    },
    {
      "time": " 29.Oct.2007 3.06pm",
      "content": "First impression: Not nearly as good as the original concept. That one has a professional touch, this one is quite amateurish.\n\nTo repeat myself once again: I think it’s a huge mistake to drop the two-color concept just because some people tell you they’ve been taught that the base concept for a logo have to be mono-color. Take a look at the world around you, that guideline is obviously no longer in touch with reality — if it ever has been. A logo need a somewhat acceptable mono-color representation, but that by no mean has to be the base concept.\n\nAnd please, if for some reason you do decide to continue with mono, use black-on-which instead of white-on-black. A special purpose is required to go negative, and in your case there isn’t one.\n\n"
    },
    {
      "time": " 29.Oct.2007 5.18pm",
      "content": "Forget the last concept. It doesn’t work. Unprofessional. At least not in any of these two versions + the ones you could imaginatively improve in your mind.\n\n"
    },
    {
      "time": " 30.Oct.2007 8.50am",
      "content": "Justin - This doesn’t work for me at all. The “wave” looks more like the path of an electron than a water wave. Also, the curves of the wave are not aligned with anything in the text, and seem arbitrarily placed.\n\nYour previous version was very very close to working well. I’d revisit it. If you can’t get the wave to work with the ’e’, maybe make the ’e’ work with the wave (i.e. change the typeface, maybe to something with a larger ’e’ aperture).\n\nHenry - Justin is putting this logo on a black box, as he has said previously, so he does have a reason to reverse the colours; I agree that he needs to think about how it will look on white as well.\n\n- Lex\n\n"
    },
    {
      "time": " 30.Oct.2007 3.22pm",
      "content": "Henry, Litera, Lex,\n\nThanks for keeping me on track. My first thought was “how in h\\*ll does this look amateurish?!?” But the more I looked at it, the more I realized that you’re right.\n\nI will continue to work on the ’wave inside text’ version and post new renditions as I create them!\n\n-Justin\n\n"
    },
    {
      "time": " 30.Oct.2007 5.50pm",
      "content": "I like the original concept, and agree with henry that there’s no need to hire a professional. My boyfriend is starting his own business, and despite the fact that I’m a designer, I’m going to try to stay out of his logo design process, at least at the beginning - largely because he knows his target audience far better than I do, and he has a decent eye for design. Once he has a good concept, I’ll help him tweak it. So - good for you for working this up! :)\n\n-Beth\n\neeblet.com\n\n"
    }
  ]
}
