{
  "id": "38347",
  "title": "Introduction",
  "forum": "sarang's blog",
  "tags": [

  ],
  "content": "Hi, Its me, sarang, a calligrapher and typographer from India.  \ndesigning a font for 7 Indian languages. I will share some of my experiments soon. :)\n\n",
  "author": "sarang",
  "time": "23 Oct 2007 — 12:28am",
  "uid": "741",
  "comments": [
    {
      "time": "23 Oct 2007 — 12:33am",
      "content": "Hello There:\n\nVery nice. Devanagari is very pretty but it looks complex to say the least- everything is contextual right? Please share soon :-)\n\nMike Diaz :-)\n\nPS... Welcome to Typophile- an incredible resource- use it your advantage!\n\n"
    },
    {
      "time": "23 Oct 2007 — 2:34am",
      "content": "wwwwwwooooow !!!  \nAm really curious to know which are those 7 languages you can design fonts for??\\_\n\nI am also from India, and have a little knowledge of 3 Indic languages other than Hindi but since I born, brought up and studied in a Hindi environment, I can only challenge myself to design good Hindi fonts. Other languages are as foreign as France for me. For me, having a bit knowledge isn't enough for a solid output. And even if i design, i will have no idea whether its good or not.\n\nI really want to see your work samples if you want to share.\n\n"
    },
    {
      "time": "23 Oct 2007 — 3:18am",
      "content": "Btw, is your full name Sarang Kulkarni\\_?\n\n"
    },
    {
      "time": "26 Mar 2008 — 4:25am",
      "content": "Sorry for not in touch with any of you. I will be coming up with my website soon.  \nAround 20th April it should be online. thanks\n\n"
    },
    {
      "time": "26 Mar 2008 — 4:26am",
      "content": "Right, my name is Sarang Kulkarni.\n\nLetter conscious person\n\n ![](http://web.archive.org/web/20130203123032im_/http:/typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": "27 Aug 2009 — 11:12pm",
      "content": " ![](http://web.archive.org/web/20130203123032im_/http:/typophile.com/files/download-05_6100.gif)\n\nIt gives amazing result.\n\n"
    },
    {
      "time": "27 Aug 2009 — 11:13pm",
      "content": "I hope I will upload the result soon.\n\n"
    },
    {
      "time": "19 Sep 2009 — 2:05am",
      "content": "WhiteCrow has designed 11 Indian language fonts for Indian Vodafone. WhiteCrow team is planing to launch a new set of 'Indian Language TypeSet' soon, which will be user friendly by keeping the Indian language authenticity intact. We are looking forward for modern Indian typefaces by maintaining the localness in it. I hope, we will get the genuine feedback on our work. :)\n\n ![](http://web.archive.org/web/20130203123032im_/http:/typophile.com/files/WhiteCrow-Sarang-Kulkarni_4099.gif)\n\n"
    },
    {
      "time": "8 Jun 2010 — 10:56pm",
      "content": "I am Font designer from India, and have a knowledge of Indic languages .  \nI have design aprox 200 font in all indian language. u r work is very nice .\n\n"
    }
  ]
}
