{
  "id": "38358",
  "title": "Please help! What is Flaxisign? What is difference between it and Illustrator. THANKS",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Please help! What is Flaxisign? What is difference between it and Illustrator. THANKS\n\n",
  "author": "Black_Jack",
  "time": "23 Oct 2007 — 6:26am",
  "uid": "23108",
  "comments": [
    {
      "time": "23 Oct 2007 — 6:33am",
      "content": "I use Illustrator all the time for my works. But sometimes I heard that employers ask for knowledge in Flaxisign. What is advantages of Flaxisign over Illustrator ? What is differences? Or they are same kind of vector graphic softwares?  \n Thank you very much!  \n Boris\n\n"
    },
    {
      "time": "23 Oct 2007 — 6:41am",
      "content": "Flexisign is made by Beacon Graphics. It is a dedicated program for making signs. There are several variations, from fairly expensive to really expensive. It is possible to design signs with Illustrator, but additional software is required to send files to something like a vinyl cutter. Dedicated sign programs tend to have a lot of ready-made effects that might have to be done manually if done in Illustrator.\n\n"
    },
    {
      "time": "23 Oct 2007 — 7:10am",
      "content": "I should mention that I work as a designer for a sign company. I prefer to do my designing in Illustrator and then send the files to other programs for cutting and printing. We use Gerber's Omega software to take care of the same functions that Flexisign would do.\n\n"
    },
    {
      "time": "23 Oct 2007 — 10:13am",
      "content": "I used to work in a sign shop too. While you could do most of the design work in illustrator, FlexiSign does have precise numerical controls for giving things specific sizes and positions a bit more easily than the equivalent functions in Illustrator. Also the maximum document dimensions are much greater, allowing one to design in full scale for very large signs.\n\nThe \"Pro\" version has the most complete array of drawing tools, while more limited versions only import designs from other programs like Illustrator and allow scaling and positioning and other very simple edits along with supplying the plotter/vinyl cutter drivers.\n\n"
    },
    {
      "time": "23 Oct 2007 — 5:42pm",
      "content": "Due to the expense of the FlexiSign family of programs, it is unlikely for anyone to gain experience with them outside of being employed in a sign shop.\n\n"
    },
    {
      "time": "24 Oct 2007 — 5:39am",
      "content": "we use Flexi for it's plotter and thermal printer drivers, as well as the numerical controls. We design in Corel (in part, because you can work size-as up to 150') and then we import into Flexi for out-put.\n\nIf you already know Illustrator or Corel, some plotter basics and know a bit about how signs are made, it's not difficult to figure out how to get around in Flexi.  \n--  \ngotta love that editing feature here at Typophile that moves your post to the front and out of sequence every time you fix a spelling mistake :o\\  \n--  \nR\n\n"
    },
    {
      "time": "24 Oct 2007 — 3:42am",
      "content": "Thanks to everybody for particular explanation! Now I have idea what it is.  \n So I understood that I also have an option to continue making design in Illustrator and afterwards transfer graphics to Flexisign. May be you can tell me if Flexisign recognize PDF or Illustrator \"ai\" files?\n\n"
    },
    {
      "time": "24 Oct 2007 — 4:29am",
      "content": "[http://www.scanvecamiable.com/resources/FlexiTrainingDemo/flexisign\\_shor...](http://web.archive.org/web/20141010043350/http:/www.scanvecamiable.com/resources/FlexiTrainingDemo/flexisign_short_demonstration.htm \"http://www.scanvecamiable.com/resources/FlexiTrainingDemo/flexisign\\_short\\_demonstration.htm\")\n\nthere are some demos on their site that give an overview.\n\n(also explains how sign shops now have more power than ever to mess with type.)\n\nR\n\n"
    },
    {
      "time": "2 Nov 2008 — 5:56pm",
      "content": "Older versions of flexisign (or casmate, depending on how far back you go) were unable to import .pdf's at all. The .ai files were tough, but still possible as long as everything was converted to curves (outlines). Newer versions such as 7.5 through the newest 8.6 can import and even convert to .pdf's with relative ease. I have found in my 15 years of sign work, that I tend to gravitate toward FlexiSign Pro 8.0 more that anything else. Occasionally, I use Corel to do autotraces and certain color fill operations, but immediately export the design to Flexi to do the real chopping and sewing. And as mentioned above, you can't send stuff to cut or print to actual sign-producing equipment without some kind of sign software. I had the Gerber Omega, but just as Microsoft builds things to work together, Gerber makes life difficult if you are trying to output to machines other than their own. Drivers are more thoroughly checked out in Flexi. I ditched Omega, Illustrator, AnaGraph, CAD, etc...Now I use Flexi and Corel in tandem and can pretty much do anything required very quickly, except activate or load fonts...Flexi still drags on that issue.\n\n"
    }
  ]
}
