{
  "id": "3836",
  "title": "(x) Fugazi - Steady Diet of Nothing - ITC Stone Sans {Hrant}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "i know this one will be kind of easy for most of you. at first i thought it was myriad, but it didn't take long to rule that out. it's on a cd that came out in 1991, if tht helps at all.   \n ![4typophile1](http://web.archive.org/web/20050518124419im_/http:/www.typophile.com/forums/messages/83/2978.jpg)   \n ![4typophile2](http://web.archive.org/web/20050518124419im_/http:/www.typophile.com/forums/messages/83/2979.jpg)\n\n",
  "author": "isaac",
  "time": "Sat, 2002-11-02 21:33",
  "uid": "540",
  "comments": [
    {
      "time": " Sat, 2002-11-02 21:53",
      "content": "There's only one font with a lc \"a\" like that - Stone Sans:   \n [http://www.myfonts.com/Testdrive?id=30861&s=Fugazi&p=96](http://web.archive.org/web/20050518124419/http:/www.myfonts.com/Testdrive?id=30861&s=Fugazi&p=96)   \n   \nBTW, am I the only person who thinks the lc \"a\" in Stone Serif should be given a public flogging?   \n [http://www.myfonts.com/Character?id=0061&vid=117874&charset=CP2&charpage=](http://web.archive.org/web/20050518124419/http:/www.myfonts.com/Character?id=0061&vid=117874&charset=CP2&charpage=)   \nSorry, but that flabby, pretentious wannabe of a glyph makes me queasy.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2002-11-03 00:35",
      "content": "It's Stone Sans that sets my teeth on edge. The serif I find rather readable.\n\n"
    },
    {
      "time": " Sun, 2002-11-03 07:09",
      "content": "thanks hrant. i feel a bit unsmart for not knowing that. i'll have to remember that test drive thing at myfonts. and no, you're not the only one who favors a flogging. i'm not a great fan of the sans either, but i guess that's what happens when you stare at univers for too long. i agree with marc though. the sans is worse, or should i say not as good as, the serif. one last question: should these letterforms be given due process or this more like a kangaroo court?\n\n"
    },
    {
      "time": " Sun, 2002-11-03 17:45",
      "content": "\\> why do you not like the lc \"a\"?   \n   \nI guess because it's like a politician: some parts are firm, but mostly the elements blend together too congenially. And that bulb... like carrion.   \n   \nWhat's interesting is how many people have a certain dislike for Stone (I mean the font - the person himself is highly respected, and rightly so). Maybe it gets attention for being a \"superfamily\", but in fact there's some deep flaw that manifests in different ways in each component. Dunno. And maybe it's a problem with the whole \"Adobe school of design\" - a lot of their \"a\"s are sickly.   \n   \n\\> should these letterforms be given due process or this more like a kangaroo court?   \n   \nIf Typophile had any kind of \"legislative\" power at all, I myself wouldn't be here. Instead, it is something actually useful: a place where people can say what's on their mind, instead of playing politics (even though sometimes it seems to have to be done anonymously). Criticism leads to progress, as uncomfortable as it usually is.   \n   \nhhp\n\n"
    }
  ]
}
