{
  "id": "38365",
  "title": "2 typefaces in old correspondence",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi All.  \nI’m planning to digitize this 2 typefaces that I found in old correspondence.  \nI was wondering if you have ever seen anything similar ou identical?\n\nThanks in advanced  \nAntónio\n\n ![](http://web.archive.org/web/20131020131933im_/http:/typophile.com/files/tipo_4990.jpg)\n\n",
  "author": "afonseca1974",
  "time": "23 Oct 2007 — 8:52am",
  "uid": "22399",
  "comments": [
    {
      "time": "23 Oct 2007 — 10:47am",
      "content": "B seems hand lettered. Richard Beatty's [Childs](http://web.archive.org/web/20131020131933/http:/www.fontshop.com/fonts/downloads/richard_beatty/childs/?sample_text=Proprietario&sample_size=60) set has some similar styles.\n\n"
    },
    {
      "time": "24 Oct 2007 — 1:06pm",
      "content": "B is Utopian, an old typeface. Don't think there is digital version, at least with that name.\n\n"
    },
    {
      "time": "24 Oct 2007 — 1:19pm",
      "content": "I was agreeing with Stephen on this, the variations on the r especially sold me on hand drawn. But I guess it could also be a really distressed or greatly enlarged sample.\n\n"
    },
    {
      "time": "25 Oct 2007 — 8:54am",
      "content": "Hi all!  \nHere are my first tests. Please give me comments (gently...)  \nI'm new in this and have a big learning curve ahead.  \nThe text below its just draws, not type prepared in font lab (I mean with no kerning, etc.)\n\nAntónio\n\n ![](http://web.archive.org/web/20131020131933im_/http:/typophile.com/files/tipoteste_4014.jpg)\n\n"
    },
    {
      "time": "25 Oct 2007 — 3:19pm",
      "content": "Couple of points:  \n• The pen angles on the _d_ and _q_ are different from the rest of the font; did you just mirror the _p_?  \n• The _k_ is just odd but almost works.&nbsp; (What does it look like in the source text?)  \n• The _s_ is too light in the main stroke of the letter.  \n• The _t_ is very awkward; note the height of the cross-bar and the rounding-off of the bottom of the stem in the original.  \n• Where the original _o_ has full-width stroke at either end of the stroke, yours just looks like somebody bit into the letter.  \n• The _v_ is a bit too wide, the _y_ and the right half of the _w_ much more so.&nbsp; (Yes, I see that they're all the same width; they shouldn't be.)\n\nOn the other hand…  \n• Good job on replacing the teardrop dot on the _i_, though the height and shape could be improved.&nbsp; (Maybe a slightly curve-y teardrop, almost a comma, a bit higher up?  \n• Love the _m_.&nbsp; This font needs more such flourishes—why'd you drop the dangling bit on the _r_?\n\n—Joel\n\n"
    },
    {
      "time": "25 Oct 2007 — 5:21pm",
      "content": "FYI--  \nIngacio is right. B is Utopian. I have small specimen of 20pt., 24pt. and 36pt. The strokes also appear irregular as the repro I have was done from an old antique hot metal shop.\n\n"
    },
    {
      "time": "26 Oct 2007 — 2:58am",
      "content": "Norbert Florendo\n\nCan you post or send an image of the specimen of 20pt., 24pt that you have?  \nThanks in advance.\n\nAntónio\n\n"
    },
    {
      "time": "26 Oct 2007 — 5:58am",
      "content": "Why does m get a fancy terminal, and not n. (Have you thought about offering the fancy shapes as swash characters, and having them on the regular cut. I notice you didn't buy into the fancy r of the sample.)\n\n"
    },
    {
      "time": "26 Oct 2007 — 6:04am",
      "content": "Norbert  \nIngacio is wrong, Ignacio is right, sometimes.\n\nAntonio  \nIn [UnosTiposDuros](http://web.archive.org/web/20131020131933/http:/www.unostiposduros.com/) website there is a PDF about the [Fundición Tipográfica Richard Gans](http://web.archive.org/web/20131020131933/http:/www.unostiposduros.com/paginas/histo17.html), on page 44 you can see samples of Utopian, not a complete specimen and not very high resolution but it could help you.  \nSome gems in that PDF.\n\n"
    },
    {
      "time": "26 Oct 2007 — 8:01am",
      "content": "Thanks all!  \nWell... some letters are diferent is by the fact that I dont want to \"copy\" the font! Not sure how this works legally.  \nCan I create (and register) a font call Utopian? That someone draw it 100 years ago?  \nAt least moraly I dont think is correct... unless if you state it the \"author\".  \nSo now I need the opinian of you all:  \nDo I create it, and do an \"exact copy\" of it? or  \nDo I adapt to my taste?\n\nThanks in advanced  \nAntónio\n\n"
    },
    {
      "time": "26 Oct 2007 — 9:51am",
      "content": "\\> _Ingacio is wrong, Ignacio is right, sometimes._\n\nMy apologies Ignacio. You're right again as usual.\n\nAntónio: my samples just show the word \"Utopian\" in 20, 24 and 36 points, very limited but it was enough for me to identify your sample. I can post or email during the weekend. Ignacio's link may serve you better.\n\n"
    }
  ]
}
