{
  "id": "38375",
  "title": "\"Shout vote\" – Sabon + Nexus sans: Go or no go?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am designing a war history book in two columnns 90 mm, 10,5 on 12,75 Sabon. As a complementary sans i have FF Nexus, for captions and extra text in 3 colum setting, 10 on 12,75 pt.\n\nI would be thankful for spontaneous reactions to the combination, is it ok, good or terrible? :)\n\nSuggestions on changing the text font? ( I'm rather not changing Nexus!)\n\n",
  "author": "JH",
  "time": "23 Oct 2007 — 2:30pm",
  "uid": "23125",
  "comments": [
    {
      "time": "23 Oct 2007 — 2:55pm",
      "content": "Since you're using FF Nexus Sans, why not [FF Nexus Serif](http://web.archive.org/web/20150416044646/http:/www.fontshop.com/fonts/downloads/fontfont/ff_nexus_serif_ot/) for text?\n\n"
    },
    {
      "time": "23 Oct 2007 — 3:38pm",
      "content": "Nexus has a lot of the characteristics of Scala — so why not go with Scala Sans AND Serif?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "23 Oct 2007 — 4:16pm",
      "content": "Franklin Gothic works well with Sabon, and might add a bit of authoritarian vibe to a war history book, helping to balance the neutral tone of Sabon.\n\n"
    },
    {
      "time": "23 Oct 2007 — 6:36pm",
      "content": "I would suggest you trust you own taste and make your own decision and stop looking for validation from this motley group.\n\n"
    },
    {
      "time": "23 Oct 2007 — 6:55pm",
      "content": "Gee, James. Why so crankypants? He's a young designer looking for guidance. Nothing wrong with asking for an opinion.\n\n"
    },
    {
      "time": "24 Oct 2007 — 12:37am",
      "content": "Syntax's design was inspired by Sabon's letter proportions. So those two work together as well.\n\n"
    },
    {
      "time": "24 Oct 2007 — 7:13am",
      "content": "\"Shout Vote\". That says looking for guidance?\n\n"
    },
    {
      "time": "24 Oct 2007 — 10:10am",
      "content": "Hehe. Jonatan's title writing may need some maturing, sure.\n\n"
    }
  ]
}
