{
  "id": "38380",
  "title": "A Butterfly Font",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi typophiles, I've been lurking here for a while, and finally made the leap and got an account. Don't hurt me too badly, please...\n\nI'm working on a graphics package for a \"butterfly exhibit\" at a botanical center, consisting of graphics for both informational and identification purposes. I have a few ideas of what I think might and might not work for a title font throughout, but was wondering if anyone else had any thoughts.\n\nSome background on the exhibit: It is a large greenhouse filled with flowering nectar plants and butterflies. Visitors are of all ages, and the graphic panels are probably no smaller than 18\" x 24\".\n\nAny ideas on a font that goes well with butterflies? I'm thinking something that addresses their symmetry, and lightweight frame...\n\n(One of my concerns is keeping this from looking too much like a wedding invitation. Script fonts are out, unless someone has the audacity to convince me otherwise...)\n\n-Thanks for your help\n\n",
  "author": "Thingie",
  "time": "23 Oct 2007 — 6:04pm",
  "uid": "23124",
  "comments": [
    {
      "time": "23 Oct 2007 — 8:20pm",
      "content": "I went through a pretty close senario last year. I paired Neutraface (House) with Historical Allsorts (HF&J) for a \"Moth Exhibit\" logo I worked. I slightly rounded the Neutraface to match my symbol.\n\n[http://www.rosem.com/work/random/mothSymbol.jpg](http://web.archive.org/web/20150225214347/http:/www.rosem.com/work/random/mothSymbol.jpg \"http://www.rosem.com/work/random/mothSymbol.jpg\")\n\nI recently ran into this in a book or magazine (don't remember where, and don't know the fonts - haha), I really like it because it's classy and they didn't do the typical \"organic\" feel\n\n[http://www.rosem.com/work/random/typeSample3.jpg](http://web.archive.org/web/20150225214347/http:/www.rosem.com/work/random/typeSample3.jpg \"http://www.rosem.com/work/random/typeSample3.jpg\")\n\nHope this helps!\n\n- Mike\n\n"
    },
    {
      "time": "23 Oct 2007 — 8:34pm",
      "content": "This thread is taking me back in time... When I was at Merkeley Newman Harty we did a butterflies exhibit for the American Museum of Natural History. Thesis Sans (everybody thinks it's TheSans) was used throughout their wayfinding and identity system and it worked very well.\n\n"
    },
    {
      "time": "23 Oct 2007 — 8:51pm",
      "content": "Maybe I'm learning something here. When I read the original post, my first thought was Neutraface. Nice to see your beautiful work, Mike.\n\nSharon\n\n"
    },
    {
      "time": "23 Oct 2007 — 11:16pm",
      "content": "\\*\\*Gets ready to be shouted down\\*\\*\n\nI must say I felt exactly the same way about script fonts (and I have done my fair share of wedding work when starting out) and they just scream \"no\" at me for myriad reasons because of that.\n\nI did however recently \"discover\" [misprintedtype.com](http://web.archive.org/web/20150225214347/http:/misprintedtype.com/v3/fonts.php), and two faces there, Selfish and Porcelain might be worth you having a quick look at.\n\nThey're both, I would suppose \"grunge\" scripts, but they do convey movement (and possibly the slight otherworldliness of the butterfly's directions), and I got away with sparse use of Selfish as a drop cap in a horticultural piece.\n\nLike I said, I'm ready to be shouted down here. :)\n\nAnd Mike, just like to add what a gorgeous piece of work that is. And envy is no good at this time in the morning...\n\n ![](http://web.archive.org/web/20150225214347im_/http:/typophile.com/files/selfish_4087.jpg)\n\n"
    },
    {
      "time": "24 Oct 2007 — 1:05am",
      "content": "As far as scripts go, you might want to consider Matrix Italic ( [http://www.emigre.com/fontpage.php?PMatI.html](http://web.archive.org/web/20150225214347/http:/www.emigre.com/fontpage.php?PMatI.html \"http://www.emigre.com/fontpage.php?PMatI.html\")) or Matrix Inline Script ( [http://www.emigre.com/ot.php?id=105](http://web.archive.org/web/20150225214347/http:/www.emigre.com/ot.php?id=105 \"http://www.emigre.com/ot.php?id=105\")).\n\nJean Paul\n\n"
    },
    {
      "time": "24 Oct 2007 — 1:41am",
      "content": "<cite>Thesis Sans (everybody thinks it’s TheSans) was used</cite>\n\nThesis is the name for the total of Luc[as] de Groot's typefamilies of TheSans, TheSerif and TheMix. In his words:  \n<cite>Thesis was designed to be the definitive font for every aspect of a corporate identity campaign. The font is so carefully drawn, that it maintains its form in sizes ranging from business card text to lettering on the side of a building.</cite>\n\n[http://www.lucasfonts.com/index\\_neu.html](http://web.archive.org/web/20150225214347/http:/www.lucasfonts.com/index_neu.html \"http://www.lucasfonts.com/index\\_neu.html\")\n\n(I think the Thesis Sans nomer was used in the beginning when it was 'just' a corporate font.)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "24 Oct 2007 — 1:43am",
      "content": "@mike  \nYour mothSymbol is beautiful!\n\n"
    },
    {
      "time": "24 Oct 2007 — 4:59am",
      "content": "Ahhh...I wish it were a moth exhibit now. Mike, I love the look of your logo. These are all great suggestions. I've actually been looking for an excuse to use Neutraface for quite a while now. Jean Paul, Matrix Inline looks pretty good as well. Bert, thanks for the additional info on Thesis.\n\nMike, your second image, the one you found, looks nice too. The type for the word \"Butterflies\" is what I was trying to avoid, but somehow I kind of like it. I looked around a bit to find a match, but didn't find anything really that close...\n\n"
    },
    {
      "time": "24 Oct 2007 — 5:57am",
      "content": "\"(I think the Thesis Sans nomer was used in the beginning when it was ’just’ a corporate font.)\"  \nI thought the Thesis Sans nomer was derived in the beginning when it was ’just’ a student font.\n\n"
    },
    {
      "time": "24 Oct 2007 — 5:57am",
      "content": "\"(I think the Thesis Sans nomer was used in the beginning when it was ’just’ a corporate font.)\"  \nI thought the Thesis Sans nomer was derived in the beginning when it was ’just’ a student font.\n\n"
    },
    {
      "time": "24 Oct 2007 — 6:27am",
      "content": "I'm about to suggest a script-y font, but don't hit me. What about [Zanzibar](http://web.archive.org/web/20150225214347/http:/www.identifont.com/show?9V3)? It's got that crazy, unpredictable back-and forth movement of a butterfly's flight pattern.\n\n"
    },
    {
      "time": "24 Oct 2007 — 5:35pm",
      "content": "BradB,  \nI like your Zanzibar idea. It has got some real potential.\n\n"
    },
    {
      "time": "25 Oct 2007 — 8:09am",
      "content": "Simon - I just discovered Porcelain and Selfish too and am dying to find a project for one of them.\n\nI know you are trying to avoid script fonts but I also like Chanson d'Amour.\n\n[http://www.fontshop.com/fonts/downloads/mvb\\_fonts/mvb\\_chanson\\_damour/](http://web.archive.org/web/20150225214347/http:/www.fontshop.com/fonts/downloads/mvb_fonts/mvb_chanson_damour/ \"http://www.fontshop.com/fonts/downloads/mvb\\_fonts/mvb\\_chanson\\_damour/\")\n\n"
    },
    {
      "time": "25 Oct 2007 — 9:23am",
      "content": "After doing a little sketching, the idea of using a script font for just the word \"Butterflies\" is growing on me (what sold me a little bit was the second image in Mike's post).\n\nChanson d’Amour looks good, but I'm not crazy about the roughened edges on the type. I may give Zanzibar a shot...\n\n"
    }
  ]
}
