{
  "id": "38391",
  "title": "Say Akwaaba to ADINKRA from the friendly folks {at} AKOFAType",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Rooted in the tradition of ancient West African iconography, the Adinkra family of symbols brings a new perspective to age old tradition with the introduction of 66 striking icons.\n\nYou may have seen these same symbols in various GAP and Product (RED) campaigns...but now is your chance to have your own set of these unique symbols with just a simple keystroke...\n\nChoose Adinkra Calabash for the hand-hewn quality found in African art, Adinkra FineFine for a clearer and more contemporary look or Adinkra WantaWanta to achieve a wax print/batik-like effect that adds a certain touch of West African authenticity to any project.\n\nWould you like to know more...Vist AKOFAType here at: [http://type.akofa.com/mailroom/adinkra](http://web.archive.org/web/20081203173117/http:/type.akofa.com/mailroom/adinkra)\n\n [‹ Stainless](http://web.archive.org/web/20081203173117/http:/www.typophile.com/node/38406 \"Go to previous forum topic\") [Postcript Laser printers models? ›](http://web.archive.org/web/20081203173117/http:/www.typophile.com/node/38259 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203173117/http://www.typophile.com/user/19102\" title=\"View user profile.\">sasabonsam</a>",
  "time": "<br>",
  "uid": "19102",
  "comments": [
    {
      "time": " 24.Oct.2007 6.34am",
      "content": "Do you provide an interpretation for each symbol? They look very nice, but what do they mean?\n\nCheers, Si\n\n"
    },
    {
      "time": " 24.Oct.2007 7.59am",
      "content": "Thank you for your comment...we worked hard to get these together and surely appreciate any feedback from the design community...\n\nYes as a matter fact there will be interpretations coming with the release of the OpenType Version of the font....The OpenType Version will combine all three into one and give you the freedom of using them by just clicking on a ligature tab or alternate tab...Look for that coming in Late 2007 to early 2008...\n\nFrom the desks of the friendly folks {at} AKOFA - Where the Impossible is only the unthought of...\n\n"
    },
    {
      "time": " 24.Oct.2007 10.58am",
      "content": "Sorry, I was asking the meaning of the symbols - or are they purely decorative? I recall working on a Tamil font here at work and some of us really liked one of the characters, and we suggested making t-shirts. The native speakers we were working with objected to this idea over this as the particular character had some religious significance.\n\n"
    },
    {
      "time": " 24.Oct.2007 12.28pm",
      "content": "Oh I understand what you mean...and the answer is yes they are decorative but they also have meanings...most of these symbols while they are for decorative purposes also have meanings about man’s relation to God, nature and the world around him/her. And wearing these symbols is part-in-parcel of the creation of them...They are customarily worn in Ghana for all occasions on hand-printed cloth (that was the inspiration for Adinkra Calabash) so the worst that you would probably get from a person who knows about these symbols would be a smile and a casual coversation about the symbol used...\n\nBut since you asked the question about meaning...we will be putting out a PDF with the names and meanings of the symbols soon so that others can understand the symbols and use them with the knowledge that they know what it means.\n\nFrom the desks of the friendly folks {at} AKOFA - Where the Impossible is only the unthought of...\n\n"
    }
  ]
}
