{
  "id": "384",
  "title": "TYPOPHILE TEAM: GRID GOTHIC",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This may or may not be workable solution to the Team Dynamics idea.   \n   \nGrid Gothic has the potential to be a very useful system. While simple, it's a modular face that can be modified to no end. I use these faces, especially the top one, for basic chores.   \n   \nThis particular system calls out a width and height and a stem width. Grid Gothic 991 is made on a 9X9 grid with a stem of 1. It's black value is 81 (9X9/1). (The higher the number, the lighter the face.)   \n   \nGG662 has a value of 18 (6X6/2), GG 733 has a value of 7. You can get darker than 7, but you have to fudge a bit.   \n   \nWhat I was proposing was that Grid Gothic become a tester or a guinea pig for the Typophile Team Dynamics idea.   \n   \nEverybody, newbies and veterans, can make these faces if they have access to Illustrator.   \n   \nThe faces can be brought together into a family.   \n   \nOnce you get a basic grid down, you can elaborate. Example No. 4.   \n   \nFirst, maybe within a week, anyone interested would let the Team Leader know with a post or email and what weights they'd like to attempt. Then the Leader could make the dummy files to work from. (If the grid isn't done right, when it is United, it will leave gaps).   \n   \nI would think that Jared or Joe should Team Leader. I would not want to do it, but I'll contribute these three as a start.   \n   \nI think that Jared or Joe might have some good ideas on what to do with the family once it's finished. (bandwith$)   \n   \nThere are some other points to talk about (spacing, etc.) and some things I'm leaving out.   \n   \n If anyone's online now, feel free to discuss.   \n   \nIf there's not enough interest, I will keep the concept, though it's on the back burner.   \n   \nbj\n\n",
  "author": "beejay",
  "time": "19 Apr 2002 — 12:14am",
  "uid": "1014",
  "comments": [
    {
      "time": "19 Apr 2002 — 12:16am",
      "content": "Here are some sample widths.\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20141114080421im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">grid.swf<br><a href=\"http://web.archive.org/web/20141114080421/http:/www.typophile.com/forums/messages/30/grid.swf\"><b>grid.swf</b></a> (15 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "19 Apr 2002 — 12:21am",
      "content": "maybe this'll work...   \n   \n ![pic.jpg](http://web.archive.org/web/20141114080421im_/http:/www.typophile.com/forums/messages/30/1193.jpg)\n\n"
    }
  ]
}
