{
  "id": "38408",
  "title": "Drawing letters",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can't remember what typographer said it, but he said, about drawing letters, \"I think of a letter and then I draw a line around it.\" I told that to my 4 1/2 year-old the other night at the table, and now she's drawing really nice outlines of uppercase A's.\n\nThis reminds me how much I like to draw letters...and always have. Can anyone direct me to some web sites featuring \"hand lettering service for the graphic arts\" so that I can begin formulating a plan to give them some competition?\n\nRelatedly, I am saddened to see so many posts asking, \"What font is this?\" As if all anybody does is \"choose a font\" anymore. I think it sucks that we don't see nearly as much hand lettering in advertising and in logos, etc. as we used to (open any magazine from 1950). The current and future generations are already brainwashed to believe that the best letters are created by choosing a font on their computer. I used to teach jr. high English...the kids' penmanship, most of it, was terrible. The consensus was, \"Why should I know how to write cursive when the computer makes letters so much better than I can?\"\n\nWhat font is \"Coca-Cola\"?\n\nPlease cheer me up with examples of hand lettering in the modern world of graphic art. I want to be proven wrong.\n\n",
  "author": "Koppa",
  "time": "24 Oct 2007 — 12:35pm",
  "uid": "18852",
  "comments": [
    {
      "time": "24 Oct 2007 — 1:31pm",
      "content": "Dengo, Monica. 2007, [_Le penne in pugno_](http://web.archive.org/web/20141109082923/http:/www.aiap.it/libreria.php?ID=367) (_The Pens In One's Fist_).\n\n"
    },
    {
      "time": "24 Oct 2007 — 1:49pm",
      "content": "Check out [Hand Job: A Catalog of Type](http://web.archive.org/web/20141109082923/http:/www.papress.com/bookpage.tpl?isbn=1568986262&cart=109), edited by Michael Perry and just out on Princeton Architectural Press.\n\n"
    },
    {
      "time": "24 Oct 2007 — 2:19pm",
      "content": "The growing flexibility of type in the post-metal world (phototype and digital type) is what killed hand lettering as a mainstream graphic art. Lettering stepped in where type could not. Now type can be used for practically anything, including personal correspondence.\n\nThe only reason anyone hires a lettering artist anymore is when they are going for a very hand-made look or trying to recreate the look of classic hand lettering.\n\nThere are still a few who can and do do it (me for one), but it's a very tiny niche. On the bright side, digital tools have made have made hand lettering easier to produce. I don't miss ink, white-out, or razor blades.\n\n"
    },
    {
      "time": "24 Oct 2007 — 5:53pm",
      "content": "[Alison Carmichael](http://web.archive.org/web/20141109082923/http:/www.alisoncarmichael.com/) does some very nice lettering.\n\n"
    },
    {
      "time": "24 Oct 2007 — 8:57pm",
      "content": "Forgot to mention... You can see some of my work at these links:\n\n[http://www.directoryofillustration.com/ArtistPortfolioThumbs.aspx?AID=1694](http://web.archive.org/web/20141109082923/http:/www.directoryofillustration.com/ArtistPortfolioThumbs.aspx?AID=1694 \"http://www.directoryofillustration.com/ArtistPortfolioThumbs.aspx?AID=1694\")\n\n[http://www.ms-studio.com/letteringdesign.html](http://web.archive.org/web/20141109082923/http:/www.ms-studio.com/letteringdesign.html \"http://www.ms-studio.com/letteringdesign.html\")\n\n"
    },
    {
      "time": "24 Oct 2007 — 9:10pm",
      "content": "It's really beautiful work Mark.\n\npbc\n\n"
    },
    {
      "time": "24 Oct 2007 — 10:28pm",
      "content": "_The growing flexibility of type in the post-metal world (phototype and digital type) is what killed hand lettering_\n\nRight. The phototypositor simplified art direction and empowered art directors by giving them a system for specifying headlines which produced inexpensive results within predictable horizons of expectation, but with enough complexity to enrich the product. As an AD, I worked with lettering artists occasionally, and it could be fantastic, but it was always expensive, and you never knew quite what you'd be getting, so headlines set by a type-house was the advertising agency norm.\n\nAn AD could do a rough comp (comprehensive layout), and everyone involved -- creative director, account executive, client, photographer, type house -- knew how the end result should turn out. At the same time, there was room to exercise typographic nuance, by spec'ing type style, size, letterspacing and leading precisely, even horizontal scaling.\n\nI worked like that during the late 1970s through the '80s. For some reason, I only kept one example of my work which shows the process, and as fate would have it, the typeface is Helvetica.\n\nThis ad from the early '80s was 15-20 years after the demise of widespread hand-lettering of headlines, and represented a regime that lasted, say, from around 1960 to around 1990.\n\nI wonder if my perspective is typical. Anybody?\n\n ![](http://web.archive.org/web/20141109082923im_/http:/typophile.com/files/Perma-LocA_4331.jpg)\n  \n.  \n\n ![](http://web.archive.org/web/20141109082923im_/http:/typophile.com/files/Perma-LocB_3477.jpg)\n\n"
    },
    {
      "time": "25 Oct 2007 — 5:50am",
      "content": "Yeah, I had the same experience. I hated doing marker comp layouts. I had to lay out a whole catalog that way once. Page after page of sketching photos and greeked type blocks with markers. I still have a set of AD markers I used to use for comp layouts. Some of them still work.\n\nWhen I started out, I sometimes put type specimen sheets into a Lucy (a kind of overhead opaque projector that could reduce and enlarge things) in order to accurately trace letters onto a layout. Somebody I knew worked at a place were they let them use Letraset type and dummy text in their comps. Then they would send that to the typesetter to match. I was astounded (it was expensive) and jealous.\n\nAround 1980, I worked at a magazine where we had access to a photocopy machine that could enlarge and reduce. That changed everything (until desktop publishing).\n\n"
    },
    {
      "time": "25 Oct 2007 — 7:56am",
      "content": "Both the Alison Carmichael and Mark Simonson sites are very refreshing. Thank you.\n\nAnd if I understand your commentary correctly, Mr. Shinn, few ADs will go the hand lettering route these days because it's too expensive and too unpredictable, and any impact to be gained through the unique, human element of hand drawn lettering is just not enough to make it a regular consideration. Reasonable enough, but a bit of a bummer. I'm only 38 and I can't see sitting in front of this computer for the next 25 years. I DO miss ink and x-acto blades (though I've never been a fan of white-out...it only takes away the flaws of being human that I crave).\n\nIf not hand lettered headers, then at least, and back to my main point, I hope to some day see more hand lettered logos (and I'd love to be drawing some of them).\n\nPlease keep the links and samples coming!\n\n"
    },
    {
      "time": "25 Oct 2007 — 7:57am",
      "content": "I will post something as soon as I can find that copperplate nib.\n\n"
    },
    {
      "time": "25 Oct 2007 — 9:08am",
      "content": "Ian Brignell does fantastic lettering design. He's based in Toronto: [http://www.ianbrignell.com/](http://web.archive.org/web/20141109082923/http:/www.ianbrignell.com/ \"http://www.ianbrignell.com/\")\n\n"
    },
    {
      "time": "25 Oct 2007 — 10:55am",
      "content": "_...few ADs will go the hand lettering route these days because..._\n\n...because it wouldn't mean anything.  \n99 times out of 100 when typographers use a \"hand-written\" script, it's typeset, and there is often the illogical occurence of two rough-looking letters side by side that are identical. But nobody notices the absurdity, within the ecosystem of designer--supplier--client--consumer. Such critical awareness and appraisal has generally vanished from the culture of commercial production, where I suggest it evolved related closely to the practice of \"comping\" with rough sketches, which required a keen eye for the relationship between sketched and finished art, from those involved in the production process, whether client or supplier. Now concept artwork looks as slick as finished art (as Mark notes, the photocopier made its contribution).\n\n_unique, human element of hand drawn lettering_\n\nIs that really the issue? You may be refering to \"natural\" media, as opposed to digital media.  \nNatural media, and the quality of capturing a critical live performance with pen/brush and ink, with its extemporization, idiosyncracies and accidents. But even there, few of those pieces are left in their raw state. It's not a black/white distinction, as drawing and vector-adjusting handwork are an integral part of digital glyph-making in almost all fonts. It wasn't always that way -- once, letters were mainly written or punchcut. Drawing, i.e. taking a line from point A to point B, is an integral part of digital letter-making.\n\nIt matters little now whether a piece of what looks like hand lettering is:  \n1) natural media scanned and bitmapped  \n2) natural media scanned, (auto-) traced to vectors and modified  \n3) original digital artwork drawn in Photoshop  \n4) original vector artwork drawn in Illustrator  \n5) combination of above  \n6) digital artwork made from plain \"script\" fonts with vector-drawn glyphs, not outlined  \n7) digital artwork made from OpenType \"script\" fonts with vector-drawn glyphs, and contextual alternates  \n8) vector artwork built on 7 or 8, then modified by further drawing in Illustrator/Photoshop\n\nProfessional lettering artists, not to mention type designers, use many of these techniques--mixed media.\n\n"
    },
    {
      "time": "25 Oct 2007 — 11:38am",
      "content": "Here are more lettering artist links:\n\nLeslie Cabarga: [http://www.lesliecabarga.com/](http://web.archive.org/web/20141109082923/http:/www.lesliecabarga.com/ \"http://www.lesliecabarga.com/\")\n\nMichael Doret: [http://www.michaeldoret.com/](http://web.archive.org/web/20141109082923/http:/www.michaeldoret.com/ \"http://www.michaeldoret.com/\")\n\nJill Bell: [http://www.art.net/Studios/Visual/Jillbell/Intro.html](http://web.archive.org/web/20141109082923/http:/www.art.net/Studios/Visual/Jillbell/Intro.html \"http://www.art.net/Studios/Visual/Jillbell/Intro.html\")\n\nDoyald Young: [http://www.doyaldyoung.com/](http://web.archive.org/web/20141109082923/http:/www.doyaldyoung.com/ \"http://www.doyaldyoung.com/\")\n\nMichael Clark: [http://www.alphabytes.com/michael\\_clark/](http://web.archive.org/web/20141109082923/http:/www.alphabytes.com/michael_clark/ \"http://www.alphabytes.com/michael\\_clark/\")\n\nJohn Langdon (who specializes in \"ambigrams\"): [http://www.johnlangdon.net/](http://web.archive.org/web/20141109082923/http:/www.johnlangdon.net/ \"http://www.johnlangdon.net/\")\n\nAlex Trochut: [http://www.underconsideration.com/speakup/archives/003869.html](http://web.archive.org/web/20141109082923/http:/www.underconsideration.com/speakup/archives/003869.html \"http://www.underconsideration.com/speakup/archives/003869.html\") (I'd link to his website, but it's a bit user-unfriendly, and there are lots of good examples on this Speak Up item.)\n\nMarian Bantjes: [http://www.bantjes.com/](http://web.archive.org/web/20141109082923/http:/www.bantjes.com/ \"http://www.bantjes.com/\")\n\nDaniel Pelavin: [http://www.pelavin.com/](http://web.archive.org/web/20141109082923/http:/www.pelavin.com/ \"http://www.pelavin.com/\")\n\nGerard Huerta: [http://www.gerardhuerta.com/](http://web.archive.org/web/20141109082923/http:/www.gerardhuerta.com/ \"http://www.gerardhuerta.com/\")\n\nKen Barber and others at [House Industries](http://web.archive.org/web/20141109082923/http:/www.houseind.com/) also do a lot of hand lettering, but they don't have a portfolio of samples on their site anymore.\n\n"
    },
    {
      "time": "25 Oct 2007 — 11:52am",
      "content": "(I would love to include John Downer and Ray Cruz, but they don't have websites, as far as I know.)\n\n"
    },
    {
      "time": "25 Oct 2007 — 12:04pm",
      "content": "Super, Nick. All of this professional insight is very helpful. Being that I like working with my hands so much and that I am growing increasingly sick of my illuminated screen of a desk AND that I'd rather be outside today (and almost every day!), maybe I should focus on becoming a farmer. Kidding, mostly...just like my comment about giving professional hand letterers some competition...you all knew there was a chuckle attached to that, right?\n\nAnd Mark, thanks for all the links. Typophile is a great resource.\n\nHere's a link to some [samples of my work](http://web.archive.org/web/20141109082923/http:/www.heavydutypress.com/services/for_Hire). I try to make it a point to tug on vector handles of outlined type when and where I can, as you mentioned, Nick. It's admittedly primitive and not too slick, but I like it for what it is, and I like to think I specialize in cranking out half-way decent stuff for average folks who don't have a lot of money...which is just about everyone where I live!\n\n"
    },
    {
      "time": "25 Oct 2007 — 12:19pm",
      "content": "I’m working on my lettering... [http://www.26symbols.com](http://web.archive.org/web/20141109082923/http:/www.26symbols.com/). Also, here at Hallmark we have some amazing lettering artists who do it all day every day. Just take a look at some cards. The stuff that doesn’t look like a font came from the hand.\n\n"
    },
    {
      "time": "25 Oct 2007 — 12:29pm",
      "content": "This man \"AARON HORKEY\" does some awesome work, i can't find a proper link with all of this work...\n\n[http://gallery.guyforget.week4paug.net/prints/horkey/](http://web.archive.org/web/20141109082923/http:/gallery.guyforget.week4paug.net/prints/horkey/ \"http://gallery.guyforget.week4paug.net/prints/horkey/\")\n\nthis page has alot of his illustration but you can see some of the lettering.. ill try to find a better page.\n\n"
    },
    {
      "time": "25 Oct 2007 — 12:44pm",
      "content": "_we have some amazing lettering artists who do it all day every day._\n\nAny insights into their technique, Josh?  \nDo they work primarily in traditional media, digital, or mix it up?\n\n"
    },
    {
      "time": "25 Oct 2007 — 1:00pm",
      "content": "Tom Nikosey, too:\n\n[http://www.tomnikosey.com/lettering1.htm](http://web.archive.org/web/20141109082923/http:/www.tomnikosey.com/lettering1.htm \"http://www.tomnikosey.com/lettering1.htm\")\n\n"
    },
    {
      "time": "25 Oct 2007 — 3:32pm",
      "content": "<cite>Any insights into their technique, Josh?<br>\nDo they work primarily in traditional media, digital, or mix it up?</cite>\n\nBoth. Everyone here is skilled in all types of media, tools, and techniques. Flat pen, pointed pen, brush, drawn/built up, digital etc...\n\n"
    },
    {
      "time": "25 Oct 2007 — 3:59pm",
      "content": "Koppa, check out the work of [Michael Perry](http://web.archive.org/web/20141109082923/http:/www.midwestisbest.com/work.php), author of the recent [_Hand Job: A Catalog of Type_](http://web.archive.org/web/20141109082923/http:/www.amazon.com/Hand-Job-Catalog-Michael-Perry/dp/1568986262).\n\n(There is a post about his work at [IllustrationMundo](http://web.archive.org/web/20141109082923/http:/www.illustrationmundo.com/audio/artist/129).)\n\n"
    },
    {
      "time": "25 Oct 2007 — 7:11pm",
      "content": "Mark, that's some great work there.\n\nTom Nikosey's site was going to be my suggestion, his work has inspired me for a long time.\n\n"
    },
    {
      "time": "25 Oct 2007 — 8:35pm",
      "content": "Do doodles during class count?  \n [http://www.flickr.com/photos/jabzug/](http://web.archive.org/web/20141109082923/http:/www.flickr.com/photos/jabzug/ \"http://www.flickr.com/photos/jabzug/\")\n\n"
    },
    {
      "time": "26 Oct 2007 — 7:25am",
      "content": "Incredible stuff here. Super refreshing...all of the links are much appreciated! And yes, I like doodles. Back in 1993-1995, a few years out of college, I published 20 issues of a zine (sometimes as many as 20 pages) entirely drawn by hand (with a bit of collage and clippings from old mags), which was more or less a whole lot of carefully orchestrated doodling. I intend to put more of it on my site some day, but for now the best sample I've got to share is [Andy's Hunch on What to Munch](http://web.archive.org/web/20141109082923/http:/www.heavydutypress.com/sphere/milkcrate/sphereIII4p7). And on that note... [Horse anyone?](http://web.archive.org/web/20141109082923/http:/www.chda.org/news/IAFH071206.php)\n\nThanks again, all. I will most definitely keep this node bookmarked for reference well into the future.\n\n"
    },
    {
      "time": "26 Oct 2007 — 8:53am",
      "content": "Wow Josh I can't believe you just started that blog like a month and a half ago!\n\n"
    },
    {
      "time": "26 Oct 2007 — 10:15am",
      "content": "Mark, i'm shocked that you didn't list [Charles Borges de Oliviera](http://web.archive.org/web/20141109082923/http:/www.borgeslettering.com/) in your lineup.\n\n"
    },
    {
      "time": "26 Oct 2007 — 10:52am",
      "content": "Thanks, Paul. I tried to think of as many as I could, but I knew I would forget some. Another one is Gabriel Martínez Meave, who did some amazing stuff at TypeCon this year. His website is currently under construction. ( [http://www.kimera.com.mx/](http://web.archive.org/web/20141109082923/http:/www.kimera.com.mx/ \"http://www.kimera.com.mx/\") )\n\n"
    },
    {
      "time": "26 Oct 2007 — 1:37pm",
      "content": "Screw concrete. Perma-Loc is what it's all about.\n\n"
    },
    {
      "time": "26 Oct 2007 — 3:02pm",
      "content": "I like it. Mr. Shinn, no disrespect intended...it seemed like a fun way to end the week.\n\n ![](http://web.archive.org/web/20141109082923im_/http:/typophile.com/files/Perma-Loc_4923.jpg)\n\n"
    },
    {
      "time": "26 Oct 2007 — 4:10pm",
      "content": "Please. I need to find the screw concrete font. Preferably for free. Thanks!\n\n"
    },
    {
      "time": "26 Oct 2007 — 4:37pm",
      "content": "Koppa, you said, \"<cite>And if I understand your commentary correctly, Mr. Shinn, few ADs will go the hand lettering route these days because it’s too expensive and too unpredictable, and any impact to be gained through the unique, human element of hand drawn lettering is just not enough to make it a regular consideration.</cite>\"\n\nI think the answer is probably more generational - the people that hire for hand lettering learned in an era where you select the typeface from the list on your computer. Signs have gone vinyl for convenience and cost. Ads and other publishing have gone digital. Finding someone to do competent hand lettering got difficult years ago, and people stopped looking.\n\nThere are a few cases where new fonts are designed, and new designers are earning reputations, but for the most part the world changed. The craftsmen are competing with MS Word and The Font Thing - and the amateurs and young designers don't understand the difference.\n\nI think the issue is less the actual difference in cost or convenience, than AD's being unfamiliar with when hand lettering is appropriate or even available. \"The tool defines the task\" sort of thing, once a publisher gets out of the habit of hand lettering.\n\n"
    },
    {
      "time": "27 Oct 2007 — 9:59am",
      "content": "If you look at the recent regional issue of Print Magazine, you will see lots and lots of handlettered work. Whether it is any good or not is up to you to decide!\n\n"
    },
    {
      "time": "27 Oct 2007 — 5:17pm",
      "content": "Here are some recent hand-lettering sites that I stumbled upon:\n\nThe work of John Stevens and Joyce Teta: [http://www.calligraphycentre.com/](http://web.archive.org/web/20141109082923/http:/www.calligraphycentre.com/ \"http://www.calligraphycentre.com/\")\n\nBetsy Dunlap: [http://betsydunlap.googlepages.com/bdunlap](http://web.archive.org/web/20141109082923/http:/betsydunlap.googlepages.com/bdunlap \"http://betsydunlap.googlepages.com/bdunlap\")\n\nBluebird Studios: [http://www.bluebirdstudios.com](http://web.archive.org/web/20141109082923/http:/www.bluebirdstudios.com/ \"http://www.bluebirdstudios.com\")\n\nMay + Belle: [http://www.may-belle.com](http://web.archive.org/web/20141109082923/http:/www.may-belle.com/ \"http://www.may-belle.com\")\n\nCrystal Kluge: [http://www.crystalkluge.com](http://web.archive.org/web/20141109082923/http:/www.crystalkluge.com/ \"http://www.crystalkluge.com\")\n\nTracy Joe: [http://www.tracyjoe.com](http://web.archive.org/web/20141109082923/http:/www.tracyjoe.com/ \"http://www.tracyjoe.com\")\n\nNancy Howell: [http://www.nancyhowell.com](http://web.archive.org/web/20141109082923/http:/www.nancyhowell.com/ \"http://www.nancyhowell.com\")\n\n"
    },
    {
      "time": "27 Oct 2007 — 9:13pm",
      "content": "\\>_Please. I need to find the screw concrete font. Preferably for free. Thanks!_\n\nLOL\n\n"
    },
    {
      "time": "29 Oct 2007 — 1:07pm",
      "content": "Alternate characters available for creative barter or credit.\n\n ![](http://web.archive.org/web/20141109082923im_/http:/typophile.com/files/screwconcrete_5135.jpg)\n\n"
    },
    {
      "time": "17 Sep 2009 — 4:00am",
      "content": "I've just done some hand-lettering for a new brand: Bubtree\n\n[http://www.bubtree.com.au](http://web.archive.org/web/20141109082923/http:/www.bubtree.com.au/ \"http://www.bubtree.com.au\")\n\n"
    },
    {
      "time": "17 Sep 2009 — 11:49am",
      "content": "Try Here\n\n[http://www.letterheadfonts.com/](http://web.archive.org/web/20141109082923/http:/www.letterheadfonts.com/ \"http://www.letterheadfonts.com/\")\n\n"
    },
    {
      "time": "18 Sep 2009 — 8:04am",
      "content": "I've been fascinated by hand lettering ever since I had John Langdon as a professor for my Typography II class about 5 years ago. He has since taken me under his wing as an assistant/apprentice and my goal is to become a specialized typographer, much in the same vein as he is. I'm working on creating a custom type centered portfolio after being laid off almost a year ago and realizing that I need to separate myself from all the other designers out there. I love drawing type and despite what some are saying about it being a dying art due to advanced Open Type, I would like to make it a majority of my income in the near future: [http://cargocollective.com/davebailey](http://web.archive.org/web/20141109082923/http:/cargocollective.com/davebailey \"http://cargocollective.com/davebailey\")\n\n"
    },
    {
      "time": "1 Feb 2012 — 6:31pm",
      "content": "To koppa.\n\nHi...have a look at my website at \\>keithmorris.com.au\\<\n\nAll hand drawn in pencil and rendered in Illustrator as vector art.\n\nCheers,  \nKeith\n\n"
    },
    {
      "time": "1 Feb 2012 — 8:36pm",
      "content": "Well, if you are going to resurrect an old thread,\n\nThis really hits close to my heart. I am 32 years old, and I still use a paper calendar, take paper notes, and even perform the occasional pencil-and-paper calculation. I have developed a style of handwriting for numerals which is almost like a typeface, and I use it together with similarly-styled caps. (My lowercase, though, is another matter.)\n\nFor some reason, when people see this special style of handwriting, they say that it is very neat. One even told me he would like to see it as a typeface. To me, though, it is just a utilitarian style of handwriting I use so that others and myself can read what I wrote.\n\n"
    }
  ]
}
