{
  "id": "38416",
  "title": "Neutraface No. 2",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Alright, I searched via the Typophile search function and via Google and found no thread, so if this a duplicate, sorry.\n\nGot the email yesterday as an owner of Neutraface that House has released [Neutraface No. 2](http://web.archive.org/web/20120717032341/http:/www.houseind.com/index.php?page=showfont&id=612&subpage=viewfontspecimens), a companion. A quick first impression is that the caps are more Futura inspired and less Art Deco looking.\n\nA nice caps Inline titling weight has been added too.\n\nWith the geometric and alternate humanistic lowercase letters, looks like House Industries is going for world domination.\n\nI like the special discount for current owners of Neutraface to upgrade to No.2.\n\nSo, did Christian work on this or did the House team just expand on his work?\n\n",
  "author": "adnix",
  "time": "24 Oct 2007 — 3:44pm",
  "uid": "5455",
  "comments": [
    {
      "time": "24 Oct 2007 — 4:31pm",
      "content": "Christian did it.\n\n[http://typographica.org/001115.php](http://web.archive.org/web/20120717032341/http:/typographica.org/001115.php \"http://typographica.org/001115.php\")\n\n"
    },
    {
      "time": "25 Oct 2007 — 12:34am",
      "content": "Where did you find the special discount for current owners of No. 1?\n\n"
    },
    {
      "time": "25 Oct 2007 — 1:42pm",
      "content": "I got an email from House with a hyperlink to a special page. Contact them if you didn't get it.\n\nDavid\n\n"
    },
    {
      "time": "25 Oct 2007 — 3:29pm",
      "content": "Hopefully this one will spread quickly. I love Neutraface, but I’m getting sick of seeing it used by bad designers in places where the character of the font sticks out like a sore thumb. This version will be much more successful at becoming ubiquitous.\n\n"
    },
    {
      "time": "29 Oct 2007 — 2:31am",
      "content": "Christian Schwartz updated his orangeitalic site to reflect on the changes in Neutraface 2.0. I especially like the improved kerning in the text. The only beef one could have with the new design is that the lowercase alternates don't get the same attention as they did in the 1.0 version. Notice there are no two-story lower case g's with diacritics. Not that I care... I will only set in the english language probably for the rest of my life.\n\nMikey :-)\n\n"
    },
    {
      "time": "29 Oct 2007 — 4:48am",
      "content": "To correct a factual error here: Neutraface No.2 does indeed have full accents for all the alternate lowercase letters. Though an example is not up at either Christian's or House's site, they are in the fonts.\n\n"
    },
    {
      "time": "29 Oct 2007 — 6:56am",
      "content": "Hi Mikey,\n\nThanks for catching that mistake in the character set image. I have corrected it. This is what happens when I recycle an old InDesign file and don't proofread properly.\n\n"
    },
    {
      "time": "29 Oct 2007 — 7:10pm",
      "content": "Hi Christian:\n\nThank you for the correction. I'm so glad that I'm not correct about the character set.\n\nI see Neutraface as a well honed and stylish take on the geometric sans, a field occupied by Relay, Verlag, FB Nobel, DTL Nobel, Erbar, Drescher Grotesk, FF Super Grotesk, and Futura. These are either stylish or austere. But with Neutraface 2.0 I get the bauhaus geometry for serious text work and the those stylish details that make it work it for display applications. I get it all.\n\nOn Typographica there was a comparison to Gotham (which I personally don't get) but the closest sans would be the exclusive VF Sans from Terminal Design for Vanity Fair. All of the things that bugged me about Neutaface (and stopped me from buying it) are gone! Your \"neutral\" Neutraface has more versatility and I appreciate that :-)\n\nJust as a side question: In House & Garden magazine they started using a slanted version of Neutraface Drafting- is that something they came up with or is there Drafting Oblique made special for them?\n\nBest Wishes and keep cranking them out!\n\nMike Diaz :-)\n\nPS... I love the lower case a and g.\n\n"
    },
    {
      "time": "30 Oct 2007 — 6:13am",
      "content": "Hi Mikey,\n\nThe designers at <cite>House &amp; Garden</cite> appear to be slanting Neutraface Drafting in InDesign - we didn't make any additional styles for them. That magazines is the only place I've seen the Drafting used at all.\n\n"
    },
    {
      "time": "30 Oct 2007 — 12:25pm",
      "content": ":-) Cool, thanks for the information.\n\n"
    },
    {
      "time": "11 Mar 2008 — 2:07am",
      "content": "BTW... House and Garden shut down... bummer :-( One of the most typographically appealing magazines in circulation died.\n\nMikey :-(\n\n"
    }
  ]
}
