{
  "id": "38439",
  "title": "Slab Serif Defined",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Could someone please point me in the direction of some literature (or a thread) where someone tries to nail down the criteria for a face being a slab-serif?\n\nA true formula would be extra nice. Something like \"the thickness of the serif on a lower-case h, from the baseline to the point at which the slop of the bracket is equal to zero, must constitute at least X percentage of the stroke width of the h's stem.\"\n\n",
  "author": "Ehague",
  "time": "25 Oct 2007 — 10:34am",
  "uid": "16884",
  "comments": [
    {
      "time": "25 Oct 2007 — 10:46am",
      "content": "<cite>A true formula would be extra nice.</cite>\n\nIt'll never happen. This is art, not science.\n\n"
    },
    {
      "time": "25 Oct 2007 — 11:31am",
      "content": "I know, but I'm sure someone, somewhere has tried. I'm only looking for the attempt.\n\n"
    },
    {
      "time": "25 Oct 2007 — 11:36am",
      "content": "The moment the official definition comes out, some wiseacre will design a face that doesn't quite fit in the pigeon hole. :o)\n\nR\n\n"
    },
    {
      "time": "25 Oct 2007 — 12:15pm",
      "content": "This was a great thread:\n\n[http://www.typophile.com/node/30127](http://web.archive.org/web/20150115070213/http:/www.typophile.com/node/30127 \"http://www.typophile.com/node/30127\")\n\nOne of my posts to it seems relevant:\n\n_slab serif and egyptian are synonyms,_\n\nThat’s always beeen my understanding. I named my slab-serif take on Bodoni “Egyptian” partly for that reason, as well as others, but most logically because the serifs don’t look at all like slabs in the Light and Thin weights.\n\nBut for encompassing a variety of typefaces, rather than weights, “Slab” is more practical, which is no doubt why the FontBook uses it as a category, to include many hefty-serifed faces (eg for news text) that are not at all “Egyptian”.\n\n"
    },
    {
      "time": "26 Oct 2007 — 5:50am",
      "content": "The official rule for slab serifs (which I am about to make up) is that they have thick serifs, at least 50% as thick as the narrowest part of stem and other strokes, and no bracketting. Some people will call a Clarendon a slab serif (it fits, but has brackets), but they are the type of people who would steal sheep.\n\n"
    },
    {
      "time": "26 Oct 2007 — 6:27am",
      "content": "Track down a copy of Mosley’s _The Nymph and the Grot_ and read the explanation of the origins of the terms grotesque, egyptian, and slab serif at the end of the book. With all the type designers in Boston finding a copy to look at should be easy.\n\n"
    },
    {
      "time": "26 Oct 2007 — 10:54am",
      "content": "James, that section in _The Nymph and the Grot_ doesn't explain the origin of the term \"slab serif\" at all, taking its meaning as axiomatic.\n\nDan, your definition doesn't work for extra-light Egyptians, as slabs are inherently thick. Who's the sheep stealer now?\n\n"
    },
    {
      "time": "26 Oct 2007 — 2:21pm",
      "content": "So is Clarendon a slab/Egyptian then? How about New Century Schoolbook, or Utopia, or Font Bureau's Miller? I've seen each alternately described as a scotch roman, a transitional, or an Egyptian.\n\nFrankly, labels are as boring in typography as in life, but I suppose we need some metric to aid in compartmentalizing and categorizing the thousands of fonts out there nowadays....\n\n"
    },
    {
      "time": "28 Oct 2007 — 8:20am",
      "content": "Here You find two helpful essays about Slab Serif (Egyptienne):\n\n[http://www.typefacedesign.org/resources/essay/MitjaMiclavcic\\_essay\\_scr.pdf](http://web.archive.org/web/20150115070213/http:/www.typefacedesign.org/resources/essay/MitjaMiclavcic_essay_scr.pdf \"http://www.typefacedesign.org/resources/essay/MitjaMiclavcic\\_essay\\_scr.pdf\")\n\n[http://www.typeculture.com/academic\\_resource/articles\\_essays/pdfs/tc\\_art...](http://web.archive.org/web/20150115070213/http:/www.typeculture.com/academic_resource/articles_essays/pdfs/tc_article_24.pdf \"http://www.typeculture.com/academic\\_resource/articles\\_essays/pdfs/tc\\_article\\_24.pdf\")\n\n"
    },
    {
      "time": "28 Oct 2007 — 10:46am",
      "content": "Update: I've since found a few definitions (contradictory, of course) in my more or less usual reference sources. I'm thinking I might have been too hasty in putting this to typophile, but then again, I mightn't have found that thread or Arno's two links on my own. Thanks again.\n\n"
    }
  ]
}
