{
  "id": "38435",
  "title": "Interactive PDF? How do you make one?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Good afternoon, my name is Teunis and this is my first post.\n\nI have been asked to submit an \"interactive\" PDF to a client. Basically, the client will personalize each PDF for a specific customer. The tests that I have run so far have not faired well. When using the advanced text tools and editing the copy this way the text is not wrapping properly and in the end the PDF looks terrible.\n\nI am wondering if there is a specific way to build my Quark file and/or export my .ps file so that this copy can be personalized and as editable as possible? Do I need to exempt this text box from the Quark file and build it directly in Acrobat Professional?\n\nThank you for your time and help. It is grealty appreciated.\n\n\\_teunis\n\n",
  "author": "teunis",
  "time": "25 Oct 2007 — 9:29am",
  "uid": "23198",
  "comments": [
    {
      "time": "25 Oct 2007 — 10:06am",
      "content": "You have to make the editable text fields in Acrobat Pro using Form-fields. You can make a 'background' in Quark, and then add the Form fields in Acrobat Pro after that.\n\n"
    },
    {
      "time": "25 Oct 2007 — 10:29am",
      "content": "Clauses, thank you for your response.\n\nI was just reading about Form Fields. I have not been able to figure out how to change the font from Arial to Frutiger, and change the font size. Is this possible?\n\n... I have now figured out how to edit my font. Still stuck on leading, justified and having two fonts in the same text field e.g. frutiger light and frutiger bold.\n\n"
    },
    {
      "time": "25 Oct 2007 — 11:43am",
      "content": "There are embedding permissions issues here - you need to use fonts set to 'editable' embedding which means Adobe originals and system fonts (I think).\n\n"
    },
    {
      "time": "25 Oct 2007 — 2:28pm",
      "content": "When you first create a text field in Acrobat, you can only assign one font to the entire field. You can, however, set up the field to allow detailed editing of the field after it's been created:\n\n1. When you create or edit the text field in Acrobat and have the Text Field Properties dialog open, click the Options tab. Check the Allow Rich Text Formatting box.\n\n2. Now, when you're in either Acrobat or Reader, do one of two things:\n\nA. Type some text in the field and then, on the keyboard, press CTRL+e. You'll get a floating Form Field Text Properties toolbar. (Actually, you can press CTRL+e at any time, but the toolbar will be greyed out unless the cursor is in a text field with the Rich Text Formatting permission applied to it.) Select the text you want to modify and click the appropriate button on the toolbar (font, font color, point size, alignment, bold, italic, underline, strikeout, superscript, subscript). If you click More... and then Font, you get some of the same options, but if you click on Paragraph, you can adjust paragraph alignment, indents, and spacing (leading).\n\nB. To modify a blank field, simply put your cursor anywhere in the field and press CTRL+e. You get the same floating Form Field Text Properties toolbar.\n\n3. When selecting text in a field, you can select just the characters or words you want to modify.\n\n"
    },
    {
      "time": "26 Oct 2007 — 8:55am",
      "content": "I had to do this back in the late 90s. Adobe always has/will want PDFs to be more than they are, but, really, I don't think this is the medium for it.\n\nEven complex Word Templates would be better (and have them saved off as PDFs) for the people to use, IMHO. Definitely easier to maintain. Even better if they are Mac folks...give them Pages or something.\n\nEvery time I have to modify a PDF form with Acrobat, I cringe.\n\n"
    },
    {
      "time": "26 Oct 2007 — 9:14am",
      "content": "<cite>Adobe always has/will want PDFs to be more than they are, but, really, I don’t think this is the medium for it.</cite>\n\nI don’t think that the problem is the PDF format. The problem is that Acrobat Professional is one of the worst-designed pieces of publishing software on the market. Acrobat’s interface is the stuff of nightmares at best, and the help system is terrible. I have never been able to understand why a company that has done so much for software design keeps releasing such a dreadful piece of software.\n\n"
    },
    {
      "time": "26 Oct 2007 — 12:02pm",
      "content": "I make interactive PDFs with TeX all the time. And I do not even own Acrobat.\n\n"
    },
    {
      "time": "26 Oct 2007 — 12:28pm",
      "content": "\"I don’t think that the problem is the PDF format. The problem is that Acrobat Professional is one of the worst-designed pieces of publishing software on the market.\"\n\nI tend to not discern between the two. ;0)\n\nTo be fair, PDF as a rather static 'end of life' format for paper document archiving is fine. But the whole concept of 'interactive PDF' just seems both dated and pointless in this day and age. Combine that with the atrocity that is the Acrobat UI and it's just scary.\n\n\\*If\\* a custom front end were to be used (anything other than Acrobat...perhaps a web interface) then maybe. Otherwise, let them use software they know/understand, and have that save off the PDFs.\n\n"
    }
  ]
}
