{
  "id": "38455",
  "title": "Best Daily Practice",
  "forum": "Design",
  "tags": [

  ],
  "content": "i guys,\n\nI just joined this forum and I am very interested to learn more about typography and design composition.  \nI tried to post it on the typography section but there was like almost no one at there :( so, I hope you guys don’t mind that I post it here\n\nFYI, I was a student in graphic design program but I dropped out after my first year because I just don’t have enough money to continue so, while I am trying to save the money, I was thinking to keep on practice because I am still not very clear when to stop or dram the line what is good enough.\n\nI have few books about typography from my class textbook  \nThe Elements of Typographic Style by Robert Bringhurst  \nThinking with Type by Ellen Lupton  \nTypography Workbook: A Real-World Guide to Using Type in Graphic Design by Timothy Samara  \nThe Ten Commandments of Typography by Paul Felton and Jonathan Barnbrook  \nLay Out Work Book  \nDesigner and The Grid\n\nbut I need to say that I am not very book person :(\n\nI am just wondering what is the best practice for me to do it daily?  \nI am more than willing to make a commitment to my self to sit for 2-3 hours every single day and only to play around with typography and design composition (I have two jobs).  \nBtw, I tried to read a book about grid system but I think its a bit avanced for me because I don’t really get it.\n\nFor my future goal, I just want to work around typography, publication,web/motion and branding. My current goal is want to have a better handle of kerning, spacing, and choosing the right combination of font type for poster design and understand better design composition in print media .\n\nPlus, I want to learn how I can create my own type face. I tried to sketched some font type then, I scanned it and trace few of them at illustrator but then, what’s next for me.  \nI am quite clueless\n\nI was thinking to took some words from magazine articles/lyrics, type it manually, and play around so, I can have better handle at spacing and kerning but I dunno.\n\nby the way, is they any some kind of online courses (small budget) for typography?\n\nthanks guys\n\n [‹ RA kerning pair in HTF Didot](http://web.archive.org/web/20071121083449/http:/typophile.com/node/38541 \"Go to previous forum topic\") [Type in old Portuguese typography book ›](http://web.archive.org/web/20071121083449/http:/typophile.com/node/38517 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071121083449/http://typophile.com/user/22024\" title=\"View user profile.\">Avalon</a>",
  "time": "<br>",
  "uid": "22024",
  "comments": [
    {
      "time": " 25.Oct.2007 8.06pm",
      "content": "You could always try swapping one of your jobs for a job at a local print shop that does in-house design, and see what layout work they’ll let you do. It’s a start.\n\n"
    },
    {
      "time": " 25.Oct.2007 9.22pm",
      "content": "I would recommend trying to create facsimiles of exemplary printed specimens.  \nFor instance, the introductory editorial from the first day of _The Observer,_ Sunday, December 4, 1791.  \nThe distance from rule to rule is 16 picas, 10 pts.\n\n ![](http://web.archive.org/web/20071121083449im_/http:/typophile.com/files/Observer_6370.jpg)\n\n"
    },
    {
      "time": " 25.Oct.2007 9.40pm",
      "content": "wow! thanks guys for the comments!  \nJames, I was working in the print shop before but then I quit! because I really need to find better payment job because they paid me quite little :/ and I need to paid my loans too...\n\nNick, wow! thanks for the graphics! sure I will try it :)  \nby the way,where I can find it online that kind of old type images? because I am also think to make sort of kind of journal but most of the letters from old newspaper/magazines  \nI tried ebay but I don’t have much luck.\n\n"
    },
    {
      "time": " 25.Oct.2007 10.25pm",
      "content": "There must be some “old paper” stores in town.  \nOften comic book stores have old magazines, and many second-hand and antique stores have a few old printed pieces.  \nThe thing about the old printed pieces is that they’re from the pre-digital era, so the technology and fonts don’t match exactly, and trying to create a facsimile digitally will always require a lot of “massaging” — you really have to look hard to see just what the spacing is like, and fiddle with things like tracking, justification settings, maybe even kerning and horizontal scaling, to get the text to break in the same places, and it is this difficulty which will sharpen your eye and typesetting skills.\n\n"
    },
    {
      "time": " 26.Oct.2007 1.35pm",
      "content": "yup! I totally get it what are you saying Nick! I am starting doing it now!\n\nthanks a lot\n\n"
    },
    {
      "time": " 28.Oct.2007 12.03pm",
      "content": "I came into being a graphic artist through the back door — working in a print shop. I started out as a pressman, but that job doing paste-up and mechanicals looked a whole more interesting, not to mention cleaner.\n\nOnce I managed to finagle my way into that one-man department, I began to teach myself by reading whatever I could find on type and design. I then took the approach Nick speaks of: I would see old and new printed pieces that I liked, and then would go about duplicating them. I learned a lot about type that way.\n\nI was quite content doing that for a while, but fortunately, one of our more savvy press-ready clients came into the back of the shop one day and saw my stuff hanging on the wall, and said “You don’t belong here...you need to be in a graphics house.” Thus my careeer was born.\n\nSo even if that print job pays less, it might be worth it to find a way to work there.\n\n"
    }
  ]
}
