{
  "id": "38487",
  "title": "Question: according to you, what's the best font for books' body?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi...!\n\nSo...  \nAccording to you, what's the best font for books' body?\n\nI have to choose one for my work.\n\nThanks everybody...\n\nD\n\n",
  "author": "<a href=\"/web/20111228172628/http://typophile.com/user/23002\" title=\"View user profile.\">technopaegnion</a>",
  "time": "<br>",
  "uid": "23002",
  "comments": [
    {
      "time": "",
      "content": "Depends on subject, target group, paper.. amongst other things.  \nBut my favourites, which works in most cases, are Scala and Nexus.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.linotype.com/51467/verwendung-buecher.html?pid=listview&page=...](http://web.archive.org/web/20111228172628/http:/www.linotype.com/51467/verwendung-buecher.html?pid=listview&page=0&pagesize=50 \"http://www.linotype.com/51467/verwendung-buecher.html?pid=listview&page=0&pagesize=50\")\n\n"
    },
    {
      "time": "",
      "content": "I've just set a poetry book in [Dolly](http://web.archive.org/web/20111228172628/http:/www.underware.nl/site2/index.php3?id1=dolly&id2=overview) (and in 9 pts. too). It worked out really well.\n\n"
    },
    {
      "time": "",
      "content": "I think this should go in General Discussions.\n\n"
    },
    {
      "time": "",
      "content": "I have yet to typeset a book, but I have read more than I can keep track of, and I have come to prefer books set in Adobe Garamond, Adobe Caslon, or Monotype Didot. That’s right, Didot. I don’t care how many books about type say that modern typefaces are inappropriate for running text, when the designers and printers do their jobs right, I can read it just fine.\n\n"
    },
    {
      "time": "",
      "content": "What is your \"work\"?  \nHow will it be printed?\n\n"
    },
    {
      "time": "",
      "content": "According to me, the best typeface for body text is the one I like best at the moment.\n\n"
    },
    {
      "time": "",
      "content": "Novel, historical research book, scientific tome, math text book -- all would have different requirements.\n\n"
    },
    {
      "time": "",
      "content": "Agreed. Selecting a book font is pointless unless the intended audience, book design, and subject matter are addressed first. For example, I love Utopia and ITC Garamond for a junior high school social studies text; for a scholarly article in a science journal though, not a chance.\n\nIf you don't care about such things, you could set your book in Fraktur and Caxton, that would be interesting....\n\n"
    },
    {
      "time": "",
      "content": "With no information to go on except that it's book body text, I'd have to say Baskerville.\n\n"
    },
    {
      "time": "",
      "content": "There IS such a thing as a best general typeface for book text. My picks are Sabon and Janson, always with oldstyle figures. You will NEVER go wrong with these two perennal winners, and it doesn't matter what the subject is. Scala is surprisingly clear and beautiful and is beginning to turn up more and more in stylish books. And NuSwift with oldstyle figures is a very crisp choice, by no means over-exposed. Bitstream Arrus, also with oldstyle figures (available as a separate bundle), is also strong and not used much. My tastes run to fatter faces, which leaves out Minion, Quadraat, and Kepler, just a tad too condensed for me; Warnock is right on the verge of being too condensed also. Germans use Adobe Garamond a great deal, always with plenty of leading, and it always looks great--but at 11 pt. or larger. For any subject in the mid-19th century, use ITC Bodoni Twelve, so clear, stylish and subtle, really outstanding. Others worth checking out: Celeste, Aries, Zingha (fantastic!), Buccardi, ITC New Baskerville, Storm's Regent II (very strong), Esta, Filosophia, Haarlemmer (as superb as Sabon), and Storm's Walbaum Text. Requiem would be ideal but those morons never released it with bold or bold italic! Mrs. Eaves looks like crap with those absurd proportions: forget it! But Joshua Darden's new Corundum is the next big thing: at long last, a re-think and completion of Fournier, which never had bold or bold italic...nice fat counters and overall a true classic! Just remember that oldstyle figures are an absolute must with books: when I see liner figures I just want to puke!\n\n"
    },
    {
      "time": "",
      "content": "I'll edit a novel.  \nI don't know why but I like Hoefler Text.\n\n"
    },
    {
      "time": "",
      "content": "Hoefler Text is really elegant...I just find its base text weight a tad too heavy. And, oldstyle figures are standard. But...it may become over-exposed because every new system has it installed--you might want to consider that aspect.\n\n"
    }
  ]
}
