{
  "id": "38489",
  "title": "InDesign CS3 translucent white box.",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi.\n\nSome years back before i knew anything about design software i had created a logo in photoshop. The logo is on a transparent background. I recently found this and wanted to use it in indesign. if i imported in to indesign the transperancy looks fine on scree.. but when i print it.. its a translucent white box.. ive gotten solid white boxes before due to transperancy but never a translucent white box.\n\nany ideas and how to resolve this problem?\n\n",
  "author": "<a href=\"/web/20100203131031/http://typophile.com/user/22418\" title=\"View user profile.\">mandatorycannibalism</a>",
  "time": "<br>",
  "uid": "22418",
  "comments": [
    {
      "time": "",
      "content": "How do you place it in ID? As a PSD?\n\n"
    },
    {
      "time": "",
      "content": "yes it is as a psd.\n\nif i try tif.. i get an all white box.\n\nthanks for all your help.. im a student and im barely learning how to use all of these programs.. thanks for all the help.\n\n"
    },
    {
      "time": "",
      "content": "For now try PNG. I've had success with transparent backgrounds in print before converting PSDs to PNGs and placing them. For later, try making logos in a program more suited to making logos.\n\n"
    },
    {
      "time": "",
      "content": "I've had trouble with transparency in Adobe software all the time. Well, actually it's the transparency flattening that causes the strange boxes. Always check the Transparency Flattener Preview in InDesign if you are working with transparency, to see any problems. Also I think RIPs find it very difficult to handle transparency flattening properly.\n\nUsually when I use transparency in a document, I tell the prepress/printers that I use it and where, and that they need to pay attention when outputting my file because of it.\n\nSomehow I remember reading somewhere that it might also be somewhat buggy handling of transparency of the Adobe Suite?\n\n"
    },
    {
      "time": "",
      "content": "converting to png did not work\n\n"
    },
    {
      "time": "",
      "content": "I suggest you watch the InDesignSecrets podcast [Episode 23: Practicing Safe Output](http://web.archive.org/web/20100203131031/http:/indesignsecrets.com/episode-23-practicing-safe-output-video.php) (or: [direct link](http://web.archive.org/web/20100203131031/http:/www.theindesigner.com/podcasts/tid23_theindesigner_23.mp4) to the video]]. It gives several tips on how to safely use transparency in InDesign, how to check the flattening, etc.\n\n"
    },
    {
      "time": "",
      "content": "<cite>For now try PNG.<br>\n</cite>\n\nFor print? No!  \nPNG is for the web, not for prepress.  \nPSD and TIFF are the best choice for prepress documents.\n\nMake sure to use a consistent color space. Is your PSD converted to CMYK? Is your InDesign workspace CMYK? Do you export the PDF in CMYK?\n\n<cite><br>\nI’ve had trouble with transparency in Adobe software all the time. Well, actually it’s the transparency flattening that causes the strange boxes.<br>\n</cite>\n\nThe white lines in Acrobat are just a problem of screen resolution.  \nIf you see color changes around a transparent image, you have most likely mixed different color spaces.\n\n<cite> Also I think RIPs find it very difficult to handle transparency flattening properly.<br>\n</cite>\n\nThat's why you should flatten the PDF in InDesign by choosing PDF 1.3.\n\n<cite><br>\nSomehow I remember reading somewhere that it might also be somewhat buggy handling of transparency of the Adobe Suite?<br>\n</cite>\n\nNo, if you know what you are doing it works just great with all the Adobe apps.\n\nRalf\n\n"
    },
    {
      "time": "",
      "content": "Well, on screen I don't really have any problems with transparency. I used to have some trouble when printing, but I have used some of the tips from the video I posted above your post, and that helps a lot. I've noticed that checking the Flattener Preview in InDesign and then use proper layering of your document eliminates a lot of the white-box problems.\n\nJose could also try to make a clipping path in photoshop around the logo, instead of a transparent background, and then place it in InDesign and let it clip the image with the embedded clipping path.\n\n"
    },
    {
      "time": "",
      "content": "i used the tips on the video.. and it printed without the white box.\n\nwhat i had to do was export to pdf.. \"pdf/x1a-2001\"\n\ngreat help guys!! thank you\n\n"
    },
    {
      "time": "",
      "content": "I also used the \"export to pdf.. pdf/x1a-2001\".\n\nWorks a treat! :) And for ID CS4, too.\n\nThanks a lot.\n\n"
    }
  ]
}
