{
  "id": "38499",
  "title": "SKATEBOARD BEARING LOGO",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This is a school project for an introductory type course. These are the rough logos for Quantum skateboard bearings. The logo should reflect the technological breakthroughs in bearing design that my pseudo company is making. The one on the left has some centering problems, but i am still happier with that one. I like the concept of the one on the right, but somethings off. Critiques PLEASE PLEASE PLEASE.\n\n ![](http://web.archive.org/web/20080925090649im_/http:/www.typophile.com/files/logo1-typofile_5107.jpg)\n\n [‹ Communications Network Logo](http://web.archive.org/web/20080925090649/http:/www.typophile.com/node/38951 \"Go to previous forum topic\") [Logo for Promotion Agency ›](http://web.archive.org/web/20080925090649/http:/www.typophile.com/node/38352 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080925090649/http://www.typophile.com/user/23261\" title=\"View user profile.\">DENIM</a>",
  "time": "<br>",
  "uid": "23261",
  "comments": [
    {
      "time": " 26.Oct.2007 8.21pm",
      "content": "The “um” ligature does not work for me at all.\n\nI like the mark on the left, although something seems off in the centre. Maybe it’s the way the white circle is just “punched out” of the ’q’s. I’d like to see something that flows a little nicer in the centre of the symbol.\n\nI’d also make the type in the left logo much larger - it looks too small in proportion to the darkness of the mark. Maybe bring the mark down to the left of the type.\n\nWatch your curves in the right-hand logo where the base of the ’q’ becomes the ’b’.\n\n- Lex\n\n"
    },
    {
      "time": " 26.Oct.2007 8.23pm",
      "content": "the right one is pretty useless (IMO)\n\nand the one on the right ... why did you join the U and the M?\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20080925090649/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 27.Oct.2007 8.31am",
      "content": "In the left mark you’ve got a q form that looks much more like a 6 or a 9. Also, repeating and rotating a character has been done so often, that it looks like an obvious and uninteresting choice. (Sure, you could talk me into a bearing company being the most logical company where you could pursue that... but here it’s lost its spark.)\n\nIn the right mark, you’ve got a letterform with a traditional cut (the cuts where the circlular shape meets the stem of the q) mashed up with a modern cut (a b with a very uniform bowl). That’s why it’s not working, in addition to the other reason mentioned. Despite the problems, I think the one on the right has more potential to be interesting, because of its asymmetry. Just decide if it’s going to lose or hang on to recognizable and traditional letter shapes or whether it’s going to be more modern.\n\nAnd Ratbaggy, you have the coolest avatar icon I’ve seen in a long time. Nice.\n\n"
    },
    {
      "time": " 29.Oct.2007 6.49am",
      "content": "i tried to fix up the cut a bit leaning towards the modern style.  \noh and the ligature on the other logo was the teachers suggestion.\n\n ![](http://web.archive.org/web/20080925090649im_/http:/www.typophile.com/files/TYPOFILE_4032.jpg)\n\n"
    },
    {
      "time": " 1.Nov.2007 10.57pm",
      "content": "You lost the asymmetry on the far right. I like how the middle is saying skateboard wheel and bearing, with its circuler-ness. Have you played with a UC Q reversed out?\n\nSomething beautiful and something ugly almost always works.\n\n"
    },
    {
      "time": " 2.Nov.2007 4.28pm",
      "content": "a UC Q reversed out? i’m not sure i understand. could you clarify?\n\n"
    },
    {
      "time": " 2.Nov.2007 5.10pm",
      "content": "In the middle one you have a O reversed out. It could easily become an uppercase Q, inside the black “Wheel” Actually I might just go with that and leave the b out of it altogether.\n\nSomething beautiful and something ugly almost always works.\n\n"
    },
    {
      "time": " 2.Nov.2007 7.02pm",
      "content": "What about an uppercase ’Q’ in a dark font (like Futura XBd) with the counter in the shape of a hexagon and a small black circle inside (to represent a skateboard wheel)?\n\n- Lex\n\n"
    },
    {
      "time": " 4.Nov.2007 1.17pm",
      "content": "i tried the uppercase Q like that already and all i heard from the class was how much it looked like the target logo. i didn’t have the Futura xbd but i tried to recreate it. thanks you so much for all the help so far. your thoughts on these?\n\n ![](http://web.archive.org/web/20080925090649im_/http:/www.typophile.com/files/logo2-typophile_5639.jpg)\n\n"
    },
    {
      "time": " 6.Nov.2007 3.53pm",
      "content": "In the top right example, make the center black circle a black hex with no white circle reversed and your outer black circle 20-25% heavier and that will make it feel more like a skateboard wheel and less like a target logo done. I think that will be a beautifully simple solution.\n\nSomething beautiful and something ugly almost always works.\n\n"
    },
    {
      "time": " 11.Nov.2007 3.08am",
      "content": "The new Logo looks way better.  \nI can associate the Logo more to a Skateboard brand and think like it was mentioned before, in the Top the right one, and in the middle the one in the middle are the ones i would keep working on. But the logotype is definitely on a good way...\n\n"
    }
  ]
}
