{
  "id": "38497",
  "title": "Leopard?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Any one here getting Leopard tonight?\n\nPlease report on all things typographic after you install the OS. Particularly, how does the iWork suite handle complex OpenType fonts and any other pertinent goodies.\n\nMikey :-)\n\n",
  "author": "<a href=\"/web/20111221030136/http://typophile.com/user/12479\" title=\"View user profile.\">SuperUltraFabulous</a>",
  "time": "<br>",
  "uid": "12479",
  "comments": [
    {
      "time": "",
      "content": "Font Book is massively improved, has auto-activation, and now fonts show previews right in the Finder (Abc text rendered in the font shows as the file icon)! You can use the new Quick Look feature on font files, too -- just select a file in the Finder, hit the space bar, and a window pops up instantly to show you the whole character set of that font! I'm going to have to rethink my whole management strategy, I think for a lot of people apps like FontExplorer will no longer be necessary. I haven't tested it extensively, of course, so once the gloss wears off there will surely be shortcomings I don't notice. But in terms of type, Leopard is a winner without a doubt.\n\nLeopard is a fantastic upgrade, the Finder in general is improved in so many ways. Time Machine really is as good as it sounds -- after years of using various unix tools to get compact, differential versioned backups, it's built into the system now with one click. it's fast, space efficient, and very well-designed in terms of how it lays out the backup files. Pretty much the best functionality of all the different unix backup utilities, the only drawbacks seeming to be the limited support of backup destinations and the minimalist configuration interface. Tying in rsync and some spotlight-powered inclusion/exclusion filters to Time Machine would create the ultimate desktop backup system.\n\nSpeed is good on my dual G5, the same or slightly better than Tiger was -- I'm sure on the intel systems it will be noticeable faster. This is, no bones about it, a fantastic OS release.\n\n"
    },
    {
      "time": "",
      "content": "I'm gonna wait until they iron out the kinks. I never buy the first version.\n\n"
    },
    {
      "time": "",
      "content": "Any specific kinks, Patty? Or just the ones you assume are hidden and waiting to be discovered?\n\n"
    },
    {
      "time": "",
      "content": "The latter. I'm looking forward to Leopard. Given I'm on 10.4.10 it's safe to say 10.5 will have a few bugs.\n\nWhat's next do you think - Ocelot? Cheetah? Lynx? I guess Cheetah would have to be fast.\n\n"
    },
    {
      "time": "",
      "content": "I’m waiting until Adobe gives the all-clear. I don’t want to install this thing and suddenly find out that Indesign starts rounding picas off to the nearest sixth decimal place or something...\n\n"
    },
    {
      "time": "",
      "content": "_What’s next do you think - Ocelot? Cheetah? Lynx? I guess Cheetah would have to be fast._\n\n[http://en.wikipedia.org/wiki/Felinae](http://web.archive.org/web/20111221030136/http:/en.wikipedia.org/wiki/Felinae \"http://en.wikipedia.org/wiki/Felinae\")\n\n[Cheetah](http://web.archive.org/web/20111221030136/http:/en.wikipedia.org/wiki/Cheetah) sounds impressive Patty. Aw they're so pretty. :^)\n\n ![](http://web.archive.org/web/20111221030136im_/http:/typophile.com/files/cheechee_6015.jpg)\n\nI wonder about the comic potential of Hyena.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Another tiny but appreciated improvement to Font Book: Now when you select a type family, it displays the regular weight instead of just the first font in the list. Since that list is sorted alphabetically it used to display the black or bold variant by default.\n\n"
    },
    {
      "time": "",
      "content": "[http://en.wikipedia.org/wiki/Mac\\_OS\\_X](http://web.archive.org/web/20111221030136/http:/en.wikipedia.org/wiki/Mac_OS_X \"http://en.wikipedia.org/wiki/Mac\\_OS\\_X\")\n\nCheetah was Mac OS 10.0. It was _painfully_ slow on the G4/533Mhz I was using at the time. It lacked the \"Quartz Extreme\" acceleration introduced with 10.2, so all advanced graphics processing was handled by the (probably slow) CPU. I loved it because I could use a \\*nix system at work, but it was pretty sad overall. Most design apps were run in Classic, which at that point wasn't fully functional. If I remember correctly, the Chooser was buggy--and this was a time when I needed to use the Classic Chooser to select printers for Classic apps. The 10.1 upgrade was free, and Apple provided disks to any users who wanted them. In those days, the \"big cat\" code names weren't used in marketing materials, so it's no wonder that people aren't familiar with them.\n\nSpeaking as a fearless early adopter, I would have to say the 10.5 upgrade was relatively smooth. I haven't experienced any major disasters so far...\n\n"
    },
    {
      "time": "",
      "content": "Waiting for the Lion King …\n\n"
    },
    {
      "time": "",
      "content": "Just bought it this morning. Am writing this in Leopard. It's fast! Preview, Textedit and Spotlight are insanely fast now, like really really fast. It really has that Steve Jobs 'BOM!' thing now. I'm on a Mac Pro 8-core beast, and before I had 10.4.10 Server running, and that did not have teh snappy.\n\nMore news as I explore further...\n\n"
    },
    {
      "time": "",
      "content": "I'm waiting for Cougar---runs natively in Canada\n\n"
    },
    {
      "time": "",
      "content": "Leopard is compatible with many of the Adobe apps (especially InDesign, Illustrator, PhotoShop) but there are many others in the Adobe product line. Acrobat Pro 8 and Reader 8 are two that don't work and Adobe says they won't have an update for those until mid or late January.\n\nDownload a PDF document of their compatibility list at:\n\n[http://www.adobe.com/go/leopardfaq](http://web.archive.org/web/20111221030136/http:/www.adobe.com/go/leopardfaq \"http://www.adobe.com/go/leopardfaq\")\n\n"
    },
    {
      "time": "",
      "content": "\\>Am writing this in Leopard.\n\n\\>I’m on a Mac Pro 8-core beast, and before I had 10.4.10 Server running, and that did not have teh snappy.\n\nSpell checker not working then? ;-)\n\n"
    },
    {
      "time": "",
      "content": "\\>I’m waiting for Cougar—-runs natively in Canada\n\nLOL, and in Eastern Washington!\n\nI'm waiting for \"Meer Cat\" to pop it’s head out of a hole in Cupertino. :-)\n\n"
    },
    {
      "time": "",
      "content": "Well, reports are already popping up about some Leopard upgraders having boot times that last anywhere between several minutes and infinity. As wonderful as this new OS sounds, I’ll hold off until at least Thanksgiving break, and maybe the long holiday before risking it. I just don’t need to deal with any major OS/software headaches interrupting my senior thesis work.\n\n"
    },
    {
      "time": "",
      "content": "Apple reports 6 new Font-related features in Leopard, including a few \"new\" fonts:  \n [http://www.apple.com/macosx/features/300.html#fonts](http://web.archive.org/web/20111221030136/http:/www.apple.com/macosx/features/300.html#fonts \"http://www.apple.com/macosx/features/300.html#fonts\")\n\n"
    },
    {
      "time": "",
      "content": "With this new auto-activation that Fontbook has . . . Is there any way to disable it?\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>With this new auto-activation that Fontbook has . . . Is there any way to disable it?\\<\\<\n\nWhy would you want to?\n\n"
    },
    {
      "time": "",
      "content": "Why? I'm a control freak. :^D\n\nSeriously, I do want to know if you can disable that feature.\n\n"
    },
    {
      "time": "",
      "content": "I'm waiting on Mac OS X \\*\\*\\*\\*...\n\nOKAY FOR REALS: How does the os handle complex opentype fonts- complex contextual fonts like LT Zapfino Extra or Bickham Script? Do you have access to glyph alternates?\n\nHow does it perform in Pages or other non-Adobe apps?\n\nHow does the typography panel look?\n\nHave you noticed a difference in rendering of small text? Has the renderer improved?\n\nSOMEONE PLEASE POST AN IMAGE OF PAPYRUS CONDENSED. PURTY PLEASE :-) I want to get an early start poking fun of it or appreciating it.\n\nMikey :-)\n\n"
    },
    {
      "time": "",
      "content": "Upgraded few hours ago and have been testing it for various stuff.\n\nSo far this has been the smoothest OSX to date. Everything is faster in general.\n\nHere are few things font-related:\n\nThe Quicklook is really useful for previewing fonts before installing. In previous versions if you clicked on the font file you'd invoke FontBook which would display it's own preview. This one leaves FB alone and gives you the repertoire:\n\n[http://img139.imageshack.us/img139/6286/40354017qn8.png](http://web.archive.org/web/20111221030136/http:/img139.imageshack.us/img139/6286/40354017qn8.png \"http://img139.imageshack.us/img139/6286/40354017qn8.png\")\n\nIt also renders a thumbnail of each font's \"Ag\" and gives it that icon. This is sort of cool in CoverFlow, which is a good way to browse esoteric fonts.\n\n[http://img457.imageshack.us/img457/3209/19474539gp6.png](http://web.archive.org/web/20111221030136/http:/img457.imageshack.us/img457/3209/19474539gp6.png \"http://img457.imageshack.us/img457/3209/19474539gp6.png\")\n\nHelvetica Neue is now included with OSX. 55 has friends now.\n\n[http://img134.imageshack.us/img134/3158/97858410pc6.png](http://web.archive.org/web/20111221030136/http:/img134.imageshack.us/img134/3158/97858410pc6.png \"http://img134.imageshack.us/img134/3158/97858410pc6.png\")\n\nYou can print a fontbook directly from Font Book by select font + print. It formats the fonts and everything, but the information is lacking. There are better solutions out there like FontDoc and FontParade, but it's a good start for quick stuff.\n\n[http://img134.imageshack.us/img134/9640/37052834zx6.png](http://web.archive.org/web/20111221030136/http:/img134.imageshack.us/img134/9640/37052834zx6.png \"http://img134.imageshack.us/img134/9640/37052834zx6.png\")\n\nPer-application activation is a nice touch, but Linotype Font Explorer X does a better job and doesn't hog Font Book. It runs smoothly under Leopard.\n\n"
    },
    {
      "time": "",
      "content": "I am waiting for the first fix version that will surely follow in a couple of months as usual. I am still annoyed that the OpenType support has not been improved.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "<cite>Leopard is compatible with many of the Adobe apps (especially InDesign, Illustrator, PhotoShop) but there are many others in the Adobe product line. Acrobat Pro 8 and Reader 8 are two that don’t work and Adobe says they won’t have an update for those until mid or late January.</cite>\n\nDownload a PDF document of their compatibility list at:\n\nhttp://www.adobe.com/go/leopardfaq\n\nSeems like the bugs does not effect a running Creative Suite installation (from the PDF):\n\nAcrobat 8.1.1 Professional:  \nStandalone trial version not available on Mac  \nOS. Can update Acrobat in Design Premium,  \nDesign Standard, Web Premium, and Master  \nCollection when in trial mode. Update  \nexpected in late January 2008.\n\nI can't find any bugs on Acrobat on Leopard bugs in [www.adobe.com/go/support](http://web.archive.org/web/20111221030136/http:/www.adobe.com/go/support \"www.adobe.com/go/support\") (?)\n\n"
    },
    {
      "time": "",
      "content": "Tiff - you can just disable Font Book. I really don't like it altho I am willing to give it another look when I upgrade eventually to Leopard if it's as improved as they say.\n\n"
    },
    {
      "time": "",
      "content": "Opentype support seems to be somewhat improved based on my cursory testing: (I've just been testing with Pages which uses CoreText, I believe)\n\nI have an old copy of Adobe Garamond Pro OpenType that I could never use effectively because I don't have proper apps like InDesign. In Pages, the Tiger typography panel never gave me any options with this font; now, with Leopard, I get (true) small caps, rare/historical ligatures, lining and old-style figures, contextual alternatives, swash caps, etc. I could also add glyph variants from the character palette.\n\nZaner Super Pro Opentype also never worked well for me under Tiger, but the Pages typography panel under Leopard now offers stylistic and contextual alternatives (all worked) but I still couldn't add all of the glyphs from the character palette with this font. :(\n\nSo, Opentype support does not appear to be complete, but perhaps a tad better?\n\n-don\n\n\"There are 10 types of people in the world: those who can count in binary and those who can't.\"\n\n"
    },
    {
      "time": "",
      "content": "Tony, thanks for sharing these insights – highly appreciated.\n\n<cite>Helvetica Neue is now included with OSX. 55 has friends now.</cite>  \nI don’t get that one … those 10 weights have been shipped with previous versions of OSX, no?\n\n"
    },
    {
      "time": "",
      "content": "I'm using an old 1.5 GHz PowerBook with 1 Gb of RAM and can attest that the whole thing is far snappier than Tiger. I'm surprised, since most system upgrades just add bloat. However, I'm happy to report that this cat seems really tightly engineered. It also seems to be handling virtual memory better, though I have yet to really test it out with Word, Photoshop and InDesign all running together.\n\nMy fave features so far: Spaces (I've got separate spaces for iCal, Mail, Surfing and Real Work™) and QuickLook (damn brilliant!). Type looks crisper somehow; dunno if the antialiasing algorithms have been tweaked. I don't use Font Book, so I can't attest to how that is working, but the latest version of Suitcase Fusion seems to be working fine. (As does Photoshop CS2, so far).\n\nAlso, the new system voice, Alex, is quite charming. He even takes breaths before beginning a new sentence. Still, I can't quite get used to the translucent menu bar. It's growing on me...\n\nI've got a sample of Papyrus Condensed to post. But, the \"Insert image\" link doesn't seem to work in Safari 3.\n\n--m\n\n"
    },
    {
      "time": "",
      "content": "\"Insert image\" doesn't seem to work in Firefox on Leopard either.\n\n"
    },
    {
      "time": "",
      "content": "<cite><br>\nOpentype support seems to be somewhat improved based on my cursory testing: (I’ve just been testing with Pages which uses CoreText, I believe)<br>\netc.<br>\n</cite>  \nI played around with a Mac Book running 10.5 in an Apple store the other day for a couple minutes. It had some Adobe apps and included OT fonts installed so fiddled with Arno Pro in Pages. It didn't seem any different than in Tiger. Same options in typography panel and I couldn't insert glyph alternates via the character panel (I tested some swash caps I think). Why would different fonts behave differently as far as the same OT features are concerned?\n\n"
    },
    {
      "time": "",
      "content": "Hi guys:\n\nI went to the Apple Store Sunday. And I brought with me, DST's Estilo to evaluate the Leopard's opentype capabilities. First off, Pages nor TextEdit recognized the lowercase of the font. And _yes_ I made sure the caps lock was off. I also could not substitute the character I wanted in Pages (just like now) but the shocker- in TextEdit too. In Tiger I can add any glyph I like even if it does not recognize it in TextEdit. But now both of those are dumb in Leopard.\n\nInterestingly, Bickham Script that comes with the Adobe Creative Suite installed on all the demo machines works just fine- in Pages and TextEdit. I added alternates with foreign accents and it worked okay for me. So I have no idea why the inconsistency. Perhaps the fonts are programmed differently?\n\nI also have Papyrus Condensed to show off:\n\n ![](http://web.archive.org/web/20111221030136im_/http:/typophile.com/files/Picture1_4055.png)\n\nMS sans:\n\n ![](http://web.archive.org/web/20111221030136im_/http:/typophile.com/files/Picture2_5744.png)\n\nThe renderer is different too.\n\na zoom of Papyrus condensed taken within FontBook in Leopard:\n\n ![](http://web.archive.org/web/20111221030136im_/http:/typophile.com/files/papyruscondensedzoom_5773.png)\n\nA zoom of the old Papyrus from my Tiger machine:\n\n ![](http://web.archive.org/web/20111221030136im_/http:/typophile.com/files/Papyrusregularzoom_6574.png)\n\nMS Sans very zoomed:\n\n ![](http://web.archive.org/web/20111221030136im_/http:/typophile.com/files/mssanszoom_5337.png)\n\nBut here is an inconsistency:\n\nBickham Script within Pages in the new Leopard:\n\n ![](http://web.archive.org/web/20111221030136im_/http:/typophile.com/files/bickham_zoom_3580.png)\n\nNotice the grayscale anti-aliasing in Pages is not used in Font Book. Why? And Why use the colorized antialiasing period- it makes you blink. I think it's terrible.\n\nI tested Time Machine and I got it not to restore a bunch of iPhotos and apps I deleted- so no- I'm not impressed. In fact, I'm not overly impressed with anything. Even cover flow is not so hot. Font icon previews are really useless anyways. Ag is not very helpful.\n\nSpotlight on the other hand is very fast. Spaces looks useful. And that's about it......\n\nMike Diaz ;-/\n\n"
    },
    {
      "time": "",
      "content": "BTW... thank you guys for all your comments thus far.\n\n"
    },
    {
      "time": "",
      "content": "A nice (and very welcome) feature: In Finder select a fontfile, hit the spacebar and a full alphabet-showing pops up. What makes it very nice is that you can navigate in the Finder to other files (other fonts) and the display changes to a full viweing of the new selection. Makes it alot easier to find THAT font you want.\n\nMy Leopard update went almost hitchfree (just a printerdriver that needed reinstalling — darn Canon), and all the CS3 programs in the Design Edition work fine (cursory testing on my account — no warranty).\n\n. . . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Does anyone know if Leopard fixes the iMac crash/freeze issue?\n\nMy wife said she thinks there will eventually be a version of the OS called \"Feral.\"\n\n"
    },
    {
      "time": "",
      "content": "Mike the rendering differences you're seeing between Leopard and Tiger may be related to different preferences - best for LCD v best for CRT? Also Pages may switch off the Apple ClearType style rendering at large sizes and use a different technique - Word 2007 does this to minimize ClearType stepping at large sizes.\n\n"
    },
    {
      "time": "",
      "content": "Simon, I think you are right about the renderer as I do use a CRT at home and all the new mac use LCDs. I changed the appearance settings on tiger machine to strong and the effect was similar. Thanks for the correction.\n\nNow however, the text engine still needs improvement. I found that it actually regressed.\n\nMikey :-)\n\n"
    },
    {
      "time": "",
      "content": "Adobe released a new version of Flash player today, which seems to fix the \"Insert Image\" bug. [More information is here](http://web.archive.org/web/20111221030136/http:/feeds.tuaw.com/~r/weblogsinc/tuaw/~3/178233689/). Just be sure to uninstall your previous copy before upgrading.\n\n"
    },
    {
      "time": "",
      "content": "I don't know about you all, but the new Dock looks awful -- yechh. And... a translucent menu bar??? Huh? What's up, Apple? The interface looks like so much iCandy...\n\n[http://arstechnica.com/reviews/os/mac-os-x-10-5.ars/4](http://web.archive.org/web/20111221030136/http:/arstechnica.com/reviews/os/mac-os-x-10-5.ars/4 \"http://arstechnica.com/reviews/os/mac-os-x-10-5.ars/4\")\n\nBleah!\n\n"
    },
    {
      "time": "",
      "content": "Totally agree, Ricardo. Fortunately, both missteps are easily fixed.\n\n"
    },
    {
      "time": "",
      "content": "_What’s next do you think - Ocelot? Cheetah? Lynx? I guess Cheetah would have to be fast._\n\nI hate to sound pedantic, but Mac OS 10.0 was Cheetah:\n\n[http://en.wikipedia.org/wiki/History\\_of\\_Mac\\_OS\\_X](http://web.archive.org/web/20111221030136/http:/en.wikipedia.org/wiki/History_of_Mac_OS_X \"http://en.wikipedia.org/wiki/History\\_of\\_Mac\\_OS\\_X\")\n\n:-)\n\nMac OS X Public Beta \"Kodiak\"  \nMac OS X v10.0 \"Cheetah\"  \nMac OS X v10.1 \"Puma\"  \nMac OS X v10.2 \"Jaguar\"  \nMac OS X v10.3 \"Panther\"  \nMac OS X v10.4 \"Tiger\"  \nMac OS X v10.5 \"Leopard\"\n\n"
    },
    {
      "time": "",
      "content": "_Fortunately, both missteps are easily fixed._\n\nGood to know, Stephen. Thanx.\n\n"
    },
    {
      "time": "",
      "content": "To get rid of the 3-D Dock, [see here](http://web.archive.org/web/20111221030136/http:/www.macosxhints.com/article.php?story=2007101815375480). To make the menu bar white again, [see here](http://web.archive.org/web/20111221030136/http:/www.macosxhints.com/article.php?story=20071026065829864).\n\nBack in 2003, [when Apple trademarked](http://web.archive.org/web/20111221030136/http:/www.macrumors.com/2003/07/24/apple-trademarks-lynx-cougar-leopard-tiger-and-more/) \"Tiger\" and \"Leopard\" for use as marks for system software, they also trademarked \"Cougar\" and \"Lynx,\" so I'm sure those will be the next cats to lend their names to OS X.\n\n"
    },
    {
      "time": "",
      "content": "There are two simple ways to change the look of the Leopard dock to a non-\"3D\" style:\n\n1. Move the dock to the left or right side of the screen (Apple menu \\> Dock \\> Position on Left/Right), or\n\n2. Open Terminal and type:\n\n`   defaults write com.apple.dock no-glass -boolean YES`\n\n&nbsp;&nbsp;&nbsp;killall Dock\n\nThe alternate dock is quite nice.\n\n(Oops--redundant post.)\n\n"
    },
    {
      "time": "",
      "content": "Thank you, Mark and Michael, for those tips.\n\n"
    },
    {
      "time": "",
      "content": "Did Apple include Opentype versions of the new fonts, or are they still including .dfont and TrueType fonts?\n\n"
    },
    {
      "time": "",
      "content": "Which new fonts? The fonts we licensed to them are OpenType (signed TrueType with OpenType Layout for combining diacritics and such)\n\n"
    }
  ]
}
