{
  "id": "38492",
  "title": "Get the trial of Akira Kobayashi's AXIS for free!",
  "forum": "SuperUltraFabulous's blog",
  "tags": [

  ],
  "content": "Hi there:\n\nOne can easily say Akira Kobayashi's AXIS sans is a beautiful distillation of Frutiger and Meta. Does it surpasses those types? Decide for yourself.  \nTypeProject is releasing trial versions of the regular and condensed styles.\n\nI'm sure you'll see, like I have, AXIS presents text clearly, friendly, and yet is a fresh take on familiar informational type designs .\n\n ![](http://web.archive.org/web/20130301070257im_/http:/typophile.com/files/akira2_4745.png)\n  \n [http://www.typeproject.com/product/file/axis\\_cond\\_joyo\\_chars.pdf](http://web.archive.org/web/20130301070257/http:/www.typeproject.com/product/file/axis_cond_joyo_chars.pdf \"http://www.typeproject.com/product/file/axis\\_cond\\_joyo\\_chars.pdf\")  \n [http://www.typeproject.com/product/file/axis\\_joyo\\_chars.pdf](http://web.archive.org/web/20130301070257/http:/www.typeproject.com/product/file/axis_joyo_chars.pdf \"http://www.typeproject.com/product/file/axis\\_joyo\\_chars.pdf\")  \n [http://www.typeproject.com/product/download.html](http://web.archive.org/web/20130301070257/http:/www.typeproject.com/product/download.html \"http://www.typeproject.com/product/download.html\")\n\nUse Google Language Tools to help you navigate the site.  \nREMEMBER THIS IS A TRIAL- YOU WILL HAVE TO DELETE THE FONT FILES FROM YOUR MACHINE AFTER THE TRIAL IS OVER!\n\nMike Diaz :-)\n\nPS... Wouldn't it be nice for a latin only version of these type?\n\n",
  "author": "SuperUltraFabulous",
  "time": "26 Oct 2007 — 1:49pm",
  "uid": "12479",
  "comments": [
    {
      "time": "26 Oct 2007 — 3:06pm",
      "content": "Nice. Do you know who designed the Greek and Cyrillic?\n\n"
    },
    {
      "time": "28 Oct 2007 — 9:16am",
      "content": "Kunihiko Okano (Shotype) is able to answer this question because he works for Typeproject that designed AXIS.\n\nI’ll send an E-mail to him later.\n\nBy the way, AXIS is used in various places, for example, [Nintendo Wii website](http://web.archive.org/web/20130301070257/http:/www.nintendo.co.jp/wii/).\n\nI’ve used AXIS Condensed Bold recently. It worked fine.\n\nEDIT: I heard Akira Kobayashi designed the latin characters of AXIS. The chinese characters, Japanese Kana phonetic characters and so on were designed by Type Project, especially Isao Suzuki who workd for Adobe from 1993 to 2000.\n\n"
    },
    {
      "time": "28 Oct 2007 — 8:32pm",
      "content": "Hi Mike,  \nThanks for your introduction.\n\nIsao Suzuki (Type Project founder) asked Akira Kobayashi to design the Atlphabet parts of AXIS before Akira worked for Linotype. So all Latin, Greek and Cyrillic parts of AXIS standard ver. designed by Akira Kobayashi. And I've expanded the family of AXIS Condensed and Compressed version after Akira went to Germany. We've been preparing to release AXIS Compressed by the end of next year.\n\nThe Greek and Cyrillic are included in Japanese font, which is not for a body text but for a symbol like math and so on. So I guess it's hard to set a body text using the Greek and Cyrillic parts. Besides, the width of them are mono and 1000upms.\n\nYes, Nintendo Wii uses AXIS font in Japanese text but it is combined with Avenir in Latin part. And Apple store Japan also uses AXIS Fonts but of course, the Latin part is Myriad.\n\nBTW, I'm going to attend Kobayashi's lecture today.  \nI'm looking forward to hearing it.\n\nThanks.\n\nKunihiko Okano\n\n"
    },
    {
      "time": "28 Oct 2007 — 9:07pm",
      "content": "Thank you very much, Okano-san.\n\nI’ve never known Akira Kobayashi also designed Greek and Cyrillic characters of AXIS. But as you mentioned, I think it’s hard to use the characters for body text.\n\nBy the way, [multi-bits](http://web.archive.org/web/20130301070257/http:/images.multi-bits.com/index.jsp) has used both latin characters and Japanese characters of AXIS. I told it to Okano-san last week.\n\nEnjoy Mr. Kobayashi’s lecture!  \n(I’d want to join it...)\n\n"
    },
    {
      "time": "29 Oct 2007 — 9:41am",
      "content": "Thanks for the info.\n\n"
    },
    {
      "time": "29 Oct 2007 — 9:31pm",
      "content": "Hello Kunihiko:\n\nThank you so much for the information. Hope you enjoyed the lecture.\n\nI think AXIS is a real gem. I think, in addition to the full Japanese packages, a latin only version would definitely sell very well outside of Japan. Is there a possibility that a latin only version could be marketed? I can see many users adopting AXIS for general work and even corporate users strongly considering replacing Frutiger, Meta, or Myriad in favor of it.\n\nThere is some interest in it already.  \n [http://typophile.com/node/38424](http://web.archive.org/web/20130301070257/http:/typophile.com/node/38424 \"http://typophile.com/node/38424\")\n\nIt's a thought.\n\nAll my best,\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "30 Oct 2007 — 9:01pm",
      "content": "Type Project has a plan to retail Latin only versions of AXIS. So now we've been designing Italics, Small caps, Old style figures and some ligatures. We've also got some requests about the Italics and Small caps from users. If you have any request about AXIS, let us know and refer to it.  \nUnfortunately, we are tied up with a lot of high priority projects now, but we try to release Latin versions as soon as possible.\n\nI enjoyed Akira Kobayashi's lecture. The lecture had three parts. The first was the Alphabet logotype critiques. Akira critiqued the logos which were designed by active young graphic designers. Akira exchanged ideas and opinions with each designer and refined the logo with every designer on stage. I was excited about hearing each person's opinion. Akira mentioned his opinion from type designer's point of view, on the other hand, every designer had a concept designing his/her logotype as a graphic designer.  \nSecond, Akira showed his works such as Avenir Next, Palatino sans and explained what the appropriate letter form of geometric sans serif is. He compared the O of Avenir Next with a perfect circle form and explained the difference of the two forms.  \nThe third part was the talk session with another two graphic designers.  \nAnd at last, Akira answered the questions that the attendees asked him about the type, the letter forms and so on.  \nThere were about three hundred peoples in the lecture room. It's hard to get a ticket of his lecture recently. I was lucky to join it.\n\nThanks.  \nKunihiko Okano\n\n"
    },
    {
      "time": "4 Nov 2009 — 8:04pm",
      "content": "Hi Mike,\n\nAXIS Latin has been released.  \n(Greek characters and Cyrillic characters are not included)  \nThe family was designed by Akira Kobayashi and Kunihiko Okano.  \n [http://www.typeproject.com/product/axis\\_latin/](http://web.archive.org/web/20130301070257/http:/www.typeproject.com/product/axis_latin/ \"http://www.typeproject.com/product/axis\\_latin/\")  \n [https://www.axisfont.com/](http://web.archive.org/web/20130301070257/https:/www.axisfont.com/ \"https://www.axisfont.com/\")\n\n"
    }
  ]
}
