{
  "id": "38507",
  "title": "Pharmaceutical recipe symbol and a caduceus",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Wherre may I find a font that has a Bodoni style Rx for use on medical prescription forms? I now create my own by placing a diagonal line through a Bodoni cap R, but would like to just use a single character.\n\nIs there a symbol font for medical caduceus available? (What is the plural of caduceus? Is it caduceuses?).\n\n",
  "author": "zap",
  "time": "27 Oct 2007 — 5:06am",
  "uid": "23271",
  "comments": [
    {
      "time": "27 Oct 2007 — 6:24am",
      "content": "<cite>What is the plural of caduceus?</cite>\n\nCaducei\n\n"
    },
    {
      "time": "27 Oct 2007 — 6:34am",
      "content": "From [decodeunicode](http://web.archive.org/web/20120415125340/http:/www.decodeunicode.org/en/u+2624):\n\n<cite>Caduceus vs. Aesculapius<br>\nThe Caduceus looks very similar to the Staff of Aesculapius and the two are frequently confused with each other. The Staff of Aesculapius has no wings and just one snake.</cite>\n\nFor the ‘Rx’: Can you show some samples of this character in use?\n\n"
    },
    {
      "time": "29 Oct 2007 — 11:49am",
      "content": "Both regular and italic versions:\n\n ![](http://web.archive.org/web/20120415125340im_/http:/typophile.com/files/Rx_4996.jpg)\n\nI've see it printed on top of my doctor's prescription form that he prints off from his laptop, but I've never looked at the font: this is from a privately released font in my collection.\n\n"
    },
    {
      "time": "29 Oct 2007 — 3:08pm",
      "content": "Does it have a Unicode point?\n\n(Not that this would make it easier, or can you name some fonts featuring [u+2603](http://web.archive.org/web/20120415125340/http:/www.decodeunicode.org/en/u+2603)?)\n\n"
    },
    {
      "time": "29 Oct 2007 — 4:43pm",
      "content": "Florian, thanks. I never would have guessed \"Caducei.\" But then I failed Latin when I was 14.\n\nNow, if someone can tell me where there might be a font with medical symbols. Back in the 50s and 60s, ATF sold \"HANDYPACKS\" for about $4.00 that contained medical signs among which were \"Recipe symbols,\" \"skull & crossbones,\" \"pestle & mortor,\" and a few other symbols.\n\n"
    },
    {
      "time": "29 Oct 2007 — 5:59pm",
      "content": "The regular is 211E, while the italic is 211F.\n\n"
    },
    {
      "time": "29 Oct 2007 — 7:12pm",
      "content": " Florian: See [FileFormat.info](http://web.archive.org/web/20120415125340/http:/www.fileformat.info/info/unicode/char/2603/fontsupport.htm). On my system, Arial Unicode MS, Code2000, some of the DevaVu forms, and Unicode Symbols all have it. Some fonts display a “borrowed” glyph, but I haven’t discovered where the original is.  \n Linda: Again according to [FileFormat.info](http://web.archive.org/web/20120415125340/http:/www.fileformat.info/info/unicode/char/211f/index.htm), U+211F is the unrelated “response” symbol (℟); no idea what it’s for.  \n—Joel\n\n"
    },
    {
      "time": "30 Oct 2007 — 1:32am",
      "content": "Joel, great advice – I haven’t known that site. Thank you!\n\n"
    },
    {
      "time": "30 Oct 2007 — 7:47pm",
      "content": "Thanks, Joel -- learn something new every day. ;-)\n\nGiven that the font I pulled this from is (a) not publicly released, (b) has a wonderful set of Regular characters, a more-than-adequate set of Italics, but no bolds, and (c) has been personally licenced to me for projects, I'm not surprised that it lacks some of the \"social niceties\" when it comes to font conventions.\n\n"
    },
    {
      "time": "1 Nov 2007 — 8:20pm",
      "content": "Joel: The \"response\" symbol is used in church liturgies. The part spoken or sung by the pastor is called the \"versicle\" and is symbolized by ℣ (U+2123). The response, marked by ℟ (U+211F), is sung or spoken by the congregation. The \"response\" symbol is one up from what is called the \"prescription take\" symbol ℞ (U+211E).\n\n"
    }
  ]
}
