{
  "id": "38516",
  "title": "Golden Deco: my first typeface critique.",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": " ![](http://web.archive.org/web/20150416175319im_/http:/typophile.com/files/goldendeco_5682.gif)\n\nDeveloped this a while ago, but now I want to complete it and make it into an actual typeface. Would love any critique. Oh yes, it is called Golden Deco, inspired by the golden ratio and art deco style.\n\nEdit: top section is UC, bottom section is LC.\n\n",
  "author": "npgraphicdesign",
  "time": "27 Oct 2007 — 12:55pm",
  "uid": "23247",
  "comments": [
    {
      "time": "27 Oct 2007 — 2:53pm",
      "content": "Do research, forget about that, start a new one from scratch.\n\n"
    },
    {
      "time": "27 Oct 2007 — 4:08pm",
      "content": "Alessandro,  \nHow about a bit more constructive information?  \nResearch - I did my research before starting to work on this. You say 'do research', in what sense?  \nWhy forget about it? Just saying that is the equivalent of saying something is bad/good without offering any more suggestions or feedback.\n\nThanks.\n\n"
    },
    {
      "time": "27 Oct 2007 — 4:12pm",
      "content": "I like this. I think you should get rid of the lowercase (bottom section) and stick with the variable-width uppercase. H, I, K, L , N and T don't need to have curved upper corners, straighten them out. With those as simple rectangular letters, the curved letters will be more interesting. The I in particular doesn't work; I think you should get rid of your 1, and use the current I as your 1, and make new, plain rectangular I. The 2 and 7 should match the Z, the 8 should take a cue from the X, the 5 should have a rectangular top, and the 3 should have a curved bottom.\n\nI don't think you should \"forget\" about this font and \"start a new one from scratch.\" Even if this won't end up being the best font in the world, you'll still learn something by working on it, and the next font you design will be even better.\n\n-matt\n\n"
    },
    {
      "time": "27 Oct 2007 — 4:21pm",
      "content": "Matt,  \nThank you for your comments. I still have a lot of work to do there, as several of the letters do look very awkward and out of place. In terms of taking the curves off the H I K L N + T, you don't think that will offset the curve used in other letterforms too much?\n\n"
    },
    {
      "time": "28 Oct 2007 — 2:54am",
      "content": "Nikita Prokhorov, what's occasionally more constructive than tearing down gently or with love ?  \nYou can evenly criticize my post for being too confident with your project, I don't see an Art Decó influence if not it's purely decorative to have lowercase letters in uppercase skeleton, and where is the ±0·61803 39887 ±1·61803 39887 for. I see the constraints of a project such as OCR-A for instance, but it's a waste. Maybe you could survey at something on the way of ITC Anna or Fountain Ultura. Fine, post a second version but not a similar fish split and dried in the open air without salt, blast the energy of the hand.\n\n"
    },
    {
      "time": "28 Oct 2007 — 6:23am",
      "content": "Alessandro,  \nThank you, that's better. ;)  \nNikita\n\n"
    }
  ]
}
