{
  "id": "38521",
  "title": "Who are some of the most well respected members of typophile?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Who are some of the most well respected members of typophile?\n\n",
  "author": "Chris Dean",
  "time": "27 Oct 2007 — 8:04pm",
  "uid": "/web/20131023012745/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "28 Oct 2007 — 3:45am",
      "content": "it depends on whom you ask and in what regards you are meaning.\n\n"
    },
    {
      "time": "28 Oct 2007 — 6:28am",
      "content": "The moderators are pretty well respected.\n\n"
    },
    {
      "time": "28 Oct 2007 — 6:58am",
      "content": "Not Hrant.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20131023012745/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "28 Oct 2007 — 7:42am",
      "content": "It could also be solved in another way. Like the rankings of ATP, or rather [ArtFacts](http://web.archive.org/web/20131023012745/http:/www.artfacts.net/index.php/pageType/artists). Combine number of typeface releases (and the general consensus regarding the quality of each release) with years in the business. Add status within organizations such as ATypI/SoTA etc., articles, papers, lectures, exposure in correct design magazines. Different foundries will generate different amount of points (so a foundry ranking is also necessary). Of course context will matter, custom type for an international fashion magazine will beat custom type for a provincial news paper. Unless the latter is given proper exposure in a Correct design magazine. In contrast another factor will be numbers of licenses sold. Regarding the quality aspect this factor won't be as big as some other factors, but making fonts that sell well generates a certain respect within the community, so why not.\n\n"
    },
    {
      "time": "28 Oct 2007 — 7:57am",
      "content": "I would certainly think John Hudson for his generous use of his knowledge and willingness to share with the rest of the community would be highly respected.\n\nChrisL\n\n"
    },
    {
      "time": "28 Oct 2007 — 8:56am",
      "content": "What is the point of this thread?\n\n"
    },
    {
      "time": "28 Oct 2007 — 11:27am",
      "content": "Since I adopted the current somewhat imperious-looking avatar, I find more people referring to me as Mr. Shinn, rather than Nick.\n\n"
    },
    {
      "time": "28 Oct 2007 — 12:57pm",
      "content": "Don't know about Typophile, but on another forum I recently got the ultimate accolade (\"You saved my life.\"). Does that make me 'most well respected'? Let's hope so…\n\n. . .  \nBert Vanderveen BNO  \n(Thats Mr. Vanderveen for you)\n\n"
    },
    {
      "time": "28 Oct 2007 — 1:58pm",
      "content": "\\> _What is the point of this thread?_\n\nR-E-S-P-E-C-T\n\nI think.\n\nR\n\n"
    },
    {
      "time": "28 Oct 2007 — 2:10pm",
      "content": "The question of this thread invites what are called invidious comparisons--comparisons that are likely give needless offense to some individuals; and this has already started. Though no doubt well-intentioned, it is not, in my opinion, a good idea.\n\n"
    },
    {
      "time": "28 Oct 2007 — 2:26pm",
      "content": "My immediate thought when I saw this thread title, was that just about every poster is respected, I'm sure this is one of the most \"civilised\" places on the interwebnetthing.\n\nRichard\n\n"
    },
    {
      "time": "28 Oct 2007 — 2:43pm",
      "content": "_... just about every poster is respected ..._\n\nYep. And despite an earlier remark (which one hopes was made in jest only), that definitely includes Hrant.\n\n"
    },
    {
      "time": "28 Oct 2007 — 4:36pm",
      "content": "_Though no doubt well-intentioned..._\n\nMaybe. But do well-intentioned people hide their [identity](http://web.archive.org/web/20131023012745/http:/typophile.com/user/15065)?\n\nJust wondering...\n\n"
    },
    {
      "time": "28 Oct 2007 — 5:20pm",
      "content": "<cite>The question of this thread invites what are called invidious comparisons—comparisons that are likely give needless offense to some individuals; and this has already started. Though no doubt well-intentioned, it is not, in my opinion, a good idea.</cite>\n\nMy sentiments exactly. Even when we disagree we \\*try\\* to do so with respect.\n\nI have tremendous respect for the amount of typographic knowledge members of this forum possess, and also for those who create type. Without them I wouldn't be in business.\n\n"
    },
    {
      "time": "28 Oct 2007 — 8:47pm",
      "content": "\\>Maybe. But do well-intentioned people hide their identity?\n\nTrue, Müller may reveal himself to be Nelson Mandela and trump the lot of you ;-)\n\n"
    },
    {
      "time": "28 Oct 2007 — 10:26pm",
      "content": "I keep a list of the notable people I have read in typophile but it would be distasteful to reveal it.\n\nHéctor\n\n"
    },
    {
      "time": "29 Oct 2007 — 4:00am",
      "content": "All I know about respect is this:\n\n_You know I am Heaven bound but I'm surely hell bent  \nOn getting the job done like I know I should,  \nGet the job done like my momma told me to.  \nOnly one thing can remember she said,  \n**You gotta earn all of your respect.** _\n\nAnd I don't care what race or what colour or what creed  \nAll that shit don't bother me,  \nOnly one thing that you should not forget,  \n**You gotta treat yo' momma with respect.**  \n--from Treat Yo' Momma, by the John Butler Trio\n\n"
    },
    {
      "time": "29 Oct 2007 — 6:40am",
      "content": "The best way to judge the respect level of any forum is to read it. See which members' advice is heeded, and which is contradicted. See the ones who get into (or worse, cause) flame wars, and which ones just walk away.\n\nTruth is, there are very few regulars here that I don't respect highly, and some of the students even gain my respect by asking intelligent questions and showing that they are seeking to learn from the wisdom of the others.\n\n"
    },
    {
      "time": "29 Oct 2007 — 2:27pm",
      "content": "\\> <cite>I find more people referring to me as Mr. Shinn, rather than Nick.</cite>\n\nI've recently addressed Nick as Mr. Shinn. Why? Well, lots of kids in my community refer to adults by first name. Growing up, that's the last thing I'd have ever done. Mister was a sign of respect. It took a long time to get to be a dad, and by God, I've earned the rite to be referred to as Mr. Koppa, and I don't care what the rest of the parents say. I'll admit that Nick's [avatar](http://web.archive.org/web/20131023012745/http:/www.askoxford.com/concise_oed/avatar?view=uk) does command some automatic respect, and that may be what triggered my impulse. But I did have a pirhanna named Mr. Chin when I was in college, which is also a contributing factor. Nevertheless, having been a member posting infrequently for only a couple months, I find Mr. Shinn to be respected, especially in light of his recent unprofessional comment about the Holiday Inn logo. And Mr. Vanderveen. I also like Mr. (Gerald) Lange. And just about everybody else, really. It's fun to be connected to everyone.\n\n"
    },
    {
      "time": "29 Oct 2007 — 6:32pm",
      "content": "Ricardo, on the link you post (for Müller's profile), is the title screwed up (on account of the ü, which Super Duty must not have)? When I load the page (in OmniWeb and Safari on Mac OS X), the profile title is simply M.\n\n"
    },
    {
      "time": "29 Oct 2007 — 8:05pm",
      "content": "Steve, try clicking directly on Müller's name at the top of this thread -- that's what I was linking to. I can see his name just fine on my dinosaur Mac, but then again it's not displaying in Super Duty. I'll check from work tomorrow and let you know.\n\n"
    },
    {
      "time": "29 Oct 2007 — 8:14pm",
      "content": "When I click on Müller's name, I only see the letter c in all the fields.\n\nChrisL\n\n"
    },
    {
      "time": "29 Oct 2007 — 10:00pm",
      "content": "Worse things happen at 'c' or maybe M's a coder?\n\n"
    },
    {
      "time": "30 Oct 2007 — 5:59am",
      "content": "He should get a c++ then for effort :-)\n\nChrisL\n\n"
    },
    {
      "time": "30 Oct 2007 — 8:49am",
      "content": "Without dismissing the idea that it might potentially be good to know such a thing - the question I have is. Why do you want to know? Hopefully it's not so you can pull your fore lock in the correct directions!\n\nMy suggestion is use google's site search ( advanced feature ) to find out what's been written on topics of interest to you. Then read read read those older threads. Then you can draw your own conclusions.\n\n"
    },
    {
      "time": "30 Oct 2007 — 10:14am",
      "content": "<cite>Ricardo, on the link you post (for Müller’s profile), is the title screwed up (on account of the ü, which Super Duty must not have)?</cite>\n\nSuper Duty has the umlaut, however I am going to assume that [sIFR](http://web.archive.org/web/20131023012745/http:/www.mikeindustries.com/blog/archive/2004/08/sifr) is having trouble rendering the character. This should change soon with the new upgrades in Flash.\n\n"
    },
    {
      "time": "30 Oct 2007 — 12:01pm",
      "content": "So when do we get the next new titling font for the pages here? We've had Beorcana (which I really like) and Super Duty (not so much)... what's next?\n\n"
    },
    {
      "time": "30 Oct 2007 — 12:24pm",
      "content": "commonly heard question among Typophiles: \"But, will I be still be well respected in the morning?\"\n\n(bud-ump-bump)\n\nR\n\n"
    },
    {
      "time": "30 Oct 2007 — 12:47pm",
      "content": "Steve: _Ricardo, on the link you post (for Müller’s profile), is the title screwed up...?_\n\nZara: _Super Duty has the umlaut..._\n\nThanks for the info, Zara. Like Steve, I only see the initial M when I am using OS X and Safari.\n\nDezcom: _When I click on Müller’s name, I only see the letter c in all the fields_\n\nExactly -- \"c\" what I mean, Chris? ;-)\n\n"
    },
    {
      "time": "30 Oct 2007 — 1:49pm",
      "content": "You get a c-note for that one, Ricardo :-)\n\nChrisL\n\n"
    },
    {
      "time": "30 Oct 2007 — 2:29pm",
      "content": "Jeez, Chris, when will the puns CCCCccc?\n\nAs for me... _I don't get no respect..._\n\n ![](http://web.archive.org/web/20131023012745im_/http:/typophile.com/files/rdangerfield_red_4255.jpg)\n\n"
    },
    {
      "time": "30 Oct 2007 — 2:35pm",
      "content": "C ya later, Rodney :-)\n\nChrisL\n\n"
    },
    {
      "time": "30 Oct 2007 — 2:46pm",
      "content": "C, c, c Señor.\n\n"
    },
    {
      "time": "30 Oct 2007 — 3:08pm",
      "content": " Or after a long while without puns, we’ll say “A, B, … … …”  \n—Joel\n\n"
    },
    {
      "time": "30 Oct 2007 — 3:17pm",
      "content": "Typophile Respect Survey\n\n1. Where do you live?  \nA. Europe.  \nB. East Coast USA.  \nC. West Coast USA.  \nD. Canada or elsewhere.\n\n2. What do you do?  \nA. Type designer.  \nB. Graphic designer.  \nC. Work for a large multinational company.  \nD. Foundry person.\n\n3. Do you own a computer?  \nA. No I own a pencil.  \nB. Yes a high end Mac.  \nC. Yes a high-end PC based gamer rig.  \nD. Yes a Linux box I built myself.\n\n4. How often do you post to Typophile?  \nA. I limit myself to one or two carefully considered lengthy posts each week.  \nB. I regularly top the leader-board in posts and puns.  \nC. I drop in every now and then with pearls of wisdom.  \nD. Whenever there’s an opportunity for self promotion.\n\n5. How do you normally dress?  \nA. Black polo-neck, wire rim glasses, “did I mention I’m bald?”  \nB. Typophile T-shirt, khaki shorts.  \nC. Helvetica T-shirt, blue jeans.  \nD. Business casual.\n\n6. When at TypeCon or ATypI do you?  \nA. Hang out in the bar with your entourage .  \nB. Spend the whole event in your hotel room working on an important font project.  \nC. Attend talks.  \nD. Shop-lift from the vendor area.\n\nGive yourself 3 points for every A, 2 points for every B, 1 point for every C, and zero for every D.\n\nSo how did you score?\n\n15 to 18 - R E S P E C T !  \n9 to 14 – respect  \n4 to 13 – no respect  \n0 to 3 – what are you doing here?\n\n"
    },
    {
      "time": "30 Oct 2007 — 3:35pm",
      "content": "Hilarious, Si! ‹8°D\n\n"
    },
    {
      "time": "30 Oct 2007 — 3:53pm",
      "content": "Si,  \nI resemble that remark :-)\n\nChrisL\n\n"
    },
    {
      "time": "30 Oct 2007 — 4:20pm",
      "content": "Very Nice Si!\n\n"
    },
    {
      "time": "30 Oct 2007 — 5:02pm",
      "content": "That's so funny.\n\n"
    },
    {
      "time": "30 Oct 2007 — 5:10pm",
      "content": "Yeah — in spite of the fact that I scored 2 1/2 (I chose to take a half-point because I wear blue-jeans but don't own an Helvetica T-Shirt).\n\n"
    },
    {
      "time": "30 Oct 2007 — 5:29pm",
      "content": "<cite>1. Where do you live?<br>\nA. Europe.<br>\nB. East Coast USA.<br>\nC. West Coast USA.<br>\nD. Canada or elsewhere.</cite>\n\nHmmm... maybe I should rethink my plan to move to the Pacific Northwest after graduation...\n\n"
    },
    {
      "time": "30 Oct 2007 — 8:45pm",
      "content": "ROFL! Brilliant, Si -- you obviously have too much time on your hands....\n\n(but, um, should it be 4-8 = no respect and 9-13 = respect. And should there be points for noting stuff like this?)\n\n"
    },
    {
      "time": "31 Oct 2007 — 5:10am",
      "content": "Editors.  \n:-)\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2007 — 5:13am",
      "content": "<cite>Editors.</cite>  \nYou mean … like in Q2, E = Editors; minus -3? ;°)\n\n"
    },
    {
      "time": "31 Oct 2007 — 5:17am",
      "content": "LOL!\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2007 — 5:34am",
      "content": "_Not Hrant._\n\nSpeak for yourself. I often found Hrant pretty insightful and non-pandering.\n\nAs for this thread, it's kinda pointless. It's like asking \"Who's the worst President?\" (okay, too easy -- maybe that's a bad example)\n\n"
    },
    {
      "time": "31 Oct 2007 — 5:52am",
      "content": "\"...like asking “Who’s the worst President?” (okay, too easy...\"\n\n:-D\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2007 — 6:18am",
      "content": "”...like asking “Who’s the worst President?” (okay, too easy...”\n\nHey, he just wanted to get into the history books.\n\nOne way or the other.\n\n"
    },
    {
      "time": "31 Oct 2007 — 7:24am",
      "content": "_Editors._\n\nAh, Chris, I'm sure you meant \"Editors!\"\n\n;-)\n\n"
    },
    {
      "time": "31 Oct 2007 — 8:21am",
      "content": "Douh!\n\nChrisL\n\n"
    }
  ]
}
