{
  "id": "38531",
  "title": "Logo for Design Studio",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello@all and thanks in advance for your suggestions on my tiny contribution! I’ve just been creating these versions and like to point out some things: personally, i like the latter font most, thus i created some versions concerning kerning and ligatures. #3 + #4 are my favorite shapes, #3 connects visual design + a positive line upwards, #4 points to the (european) DIN size-page with a piece detached, leaving the blue area as the shape of the varnish-free area on folding boxes. lastly, there’s everywhere a negative space in it, depicting the “/”stroke in “Z” (Zett).\n\nthanks for your forthrightness!\n\n ![](http://web.archive.org/web/20080101095324im_/http:/www.typophile.com/files/zettlogo_4081.jpg)\n\n [‹ Is there a font that can effectively be used for both print and screen?](http://web.archive.org/web/20080101095324/http:/www.typophile.com/node/38688 \"Go to previous forum topic\") [Logo Critique ›](http://web.archive.org/web/20080101095324/http:/www.typophile.com/node/38727 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080101095324/http://www.typophile.com/user/19080\" title=\"View user profile.\">rdnzl</a>",
  "time": "<br>",
  "uid": "19080",
  "comments": [
    {
      "time": " 28.Oct.2007 8.31am",
      "content": "I like your mark in the 3rd batch, especially b & c. Well done!  \nApart from the di lig, most of the ligatures look a little forced to me and i am wondering wether  \nthey are necessary at all? I am not 100% sold on the font choice either, although i do like the  \nsoftness. Have you tried a more traditional arrangement of mark & name?  \n{Mark} {centered name}\n\n"
    },
    {
      "time": " 29.Oct.2007 2.39am",
      "content": "I find the italicized logotypes (1, 3a) a bit more pleasing, visually. The only thing I would fix is the ’Z’ to fit the harmonious curvature of the other letters (you don’t have to, not critical). The ligatures connecting the S-t and d-i in the straight ones make it look too tight and close together.\n\nAs for the logo shapes, 1, despite it being first, caught my attention immediately. It says “zing! I have an idea!” the snapping of fingers. I also like 4, but I find it too simple. You should try more variations of 4. I found 3 to be a little pepsi-ish.\n\n"
    },
    {
      "time": " 29.Oct.2007 10.39am",
      "content": "Frankly all ligatures in your logotype looks very unnatural to me. My first instinct would be to work on the harmonious ending stroke of “Zett” and make that into a distinctive logotype while taking a plain approach on “Studio” — maybe same font, but lighter stroke, and no distortion whatsoever.\n\nThe colors need some tweaking, too. Bur first and foremost: Get rid of all gradient, that’s a no-brainer.\n\n"
    },
    {
      "time": " 31.Oct.2007 5.08am",
      "content": "have i already said, that i HATE it when posting disappear before they are posted?  \nwell, typing again...\n\nthanks for your comments!  \ni made some changes (concentrating on the “3”-series). i got rid of the gradients (they were not intended for the “plain” version). i also tweaked the font a bit, changed the “e” ... finally added the “.com” reference.  \ni am not quite sure about the colour altogether. i try to avoid a too serious/conservative look (like banks or financial service companies). the pepsi-look, as coupdegrace pointed out accurately is also bad, i’d rather it looked a bit “old school”.\n\nanyway, thanks for your opinion again  \nrdnzl\n\n ![](http://web.archive.org/web/20080101095324im_/http:/www.typophile.com/files/a_3940.jpg)\n\n"
    },
    {
      "time": " 4.Nov.2007 5.42am",
      "content": "as i work in the print section, i liked to display this in the logo as well. although i haven’t got rid of the ligature (yet), this my new effort, making the traingles more vibrant, not so stativ and crest-like. (tried the yellow/blue combination first)\n\n ![](http://web.archive.org/web/20080101095324im_/http:/www.typophile.com/files/ddd_6050.jpg)\n\n"
    },
    {
      "time": " 4.Nov.2007 12.56pm",
      "content": "I really liked your last entry overall.  \nBut why is that “.com”\\_? Is it a virtual studio\\_? Also the word “Studio” is looking too tight to me. You may try balancing your whites and the blacks in “Studio Zett”.\n\nAlso try making the sides parallel to each other where the colored blocks are overlapping.\n\nsatya\n\n"
    }
  ]
}
