{
  "id": "38542",
  "title": "Is this a good set of 'basic' typography rules?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Keep in mind these rules are for 2nd year students in college (in USA) that have never had any typography courses beforehand.\n\nJust realized I only exported 1 page in the PDF (as opposed to 3 pages that were in the original Indesign doc.) The error has been fixed!!\n\n| Attachment | Size |\n| --- | --- |\n| [typography\\_rules.pdf](http://web.archive.org/web/20130908123631/http:/typophile.com/files/typography_rules.pdf) | 74.52 KB |\n\n",
  "author": "Fantômas",
  "time": "28 Oct 2007 — 2:22pm",
  "uid": "23247",
  "comments": [
    {
      "time": "28 Oct 2007 — 2:36pm",
      "content": "You could add that it's not advisable to stretch or squoosh type.\n\nOtherwise your document looks fine.\n\n"
    },
    {
      "time": "28 Oct 2007 — 2:43pm",
      "content": "thanks Quin,  \nIf you want, check the updated pdf. I mistakenly exported only 1 page, and there's 3 pages to the rules.\n\n"
    },
    {
      "time": "28 Oct 2007 — 2:57pm",
      "content": "Nice document, but I'd provide clear examples everywhere.\n\nBeing concise is good, so if you can replace 10 lines of exposition with a short example your guidelines have a much better chance of being read and followed. I'd focus the document on the examples.\n\n"
    },
    {
      "time": "28 Oct 2007 — 3:05pm",
      "content": "\\> _If you want, check the updated pdf_\n\nI still only see a one-page document. :)\n\n"
    },
    {
      "time": "28 Oct 2007 — 3:07pm",
      "content": "Quin,  \nrefresh your browser when the PDF loads. That's what I have to do.\n\n"
    },
    {
      "time": "28 Oct 2007 — 3:08pm",
      "content": "Paul,  \nGood idea, but I just wanted to make this a type-driven list. I am assembling a separate document with examples only.\n\n"
    },
    {
      "time": "28 Oct 2007 — 3:23pm",
      "content": "There is a similar project in German; [Typokurz](http://web.archive.org/web/20130908123631/http:/www.zvisionwelt.de/downloads.html#typokurz) [typoshort] by Christoph Bier – jfyi.\n\n"
    },
    {
      "time": "28 Oct 2007 — 3:26pm",
      "content": "it is all in german...and i do not see an english version anywhere...\n\n"
    },
    {
      "time": "28 Oct 2007 — 3:36pm",
      "content": "It may be appropriate to add to the part _24. Always spell check!_ \"Even  \nif text is given to you by a client, check it.\", that it is not advisable to correct text that is given to you, unless you are asked to do so. You can point out errors to the writer, but do not correct it yourself. Some 'errors' in the text might be on purpose, so if you correct it you could ruin the text. Only correct with permission. At least, that is what I have (learned) as a rule.\n\nAlso the bit called _28. Indents_, I think this is to be decided by the typographer/typesetter, only if he/she thinks indents are appropriate for the particular text he/she is working on. It's not a rule, because it is not always necessary.\n\n"
    },
    {
      "time": "28 Oct 2007 — 3:40pm",
      "content": "Jelmar,  \nThe list that I paraphrased from (was given to my by my old type teacher) uses #24 in case of obvious spelling errors. But i think the disclaimer you suggest is good.  \n28 is also a good point..hmm...\n\n"
    },
    {
      "time": "28 Oct 2007 — 3:41pm",
      "content": " Some nits for picking:  \n• In Rule 7: “headlines may be the _one_ exception to this rule.”  \n• The list in Rule 9 violates Rule 2.  \n• Rule 29 is stylistic rather than typographic; many writers, editors, and style guides disagree.\n\n—Joel\n\n"
    },
    {
      "time": "28 Oct 2007 — 3:43pm",
      "content": "JC,  \nYou wise guy you! :D (in terms of 9 violating 2)  \nthank you for the nitpicking though...\n\n"
    },
    {
      "time": "28 Oct 2007 — 4:27pm",
      "content": "\\> _But i think the disclaimer you suggest is good._\n\nIt is just to protect yourself, so no one can say 'hey, I never agreed to that change, I want my money back or have everything reprinted!'. ;)\n\n"
    },
    {
      "time": "28 Oct 2007 — 9:09pm",
      "content": "A few you missed... ;-)\n\n1. Always use capitalization consistently (unlike rule 4 and 10)  \n2. Never have three hyphens in a row (as in rule 1)  \n3. Never use a period in place of a comma (unlike rule 17)  \n4. Don’t use = in place of a hyphen (as in rule 24)  \n5. No whiners (as in rule 26)  \n6. Always have an even number of rules (that should be rule 30)  \n7. Don’t patronize Mac users – they know that the Mac didn’t invent proportional type.  \n8. Avoid the use of emoticons :-(\n\n"
    },
    {
      "time": "29 Oct 2007 — 12:24am",
      "content": "<cite>it is all in german</cite>\n\nThat’s what I said. Still, though it certainly isn’t perfect either, I thought it could provide you with some inspiration.\n\n"
    },
    {
      "time": "29 Oct 2007 — 1:58am",
      "content": "Here are my thoughts on the rules:\n\n6: It would be helpful to explain when old-style figures might be appropriate.\n\n8: I assume you'll explain the proper use of bold weight.\n\n29: The jury is out on this one, but you'll find far more grammar and usage experts who disagree with you. Including the last comma adds consistency; omitting it often creates ambiguity (it leaves the reader confused about whether the final two elements of the series have a special relationship above and beyond their inclusion in the series).\n\nOtherwise, very nice.\n\n"
    },
    {
      "time": "29 Oct 2007 — 4:01am",
      "content": "Firstly, I 've got your back on No. 29! I worked at a newspaper for several years, where AP style says omit that last comma. Even then, though, I recognized that clarity may call for you to use it (no style rules should be absolute; they should be used as guidelines to enhance clarity).\n\nThis may reflect my time with the newspaper, but regarding rule No. 3: I understand that only periods and commas go within quotation marks. Other punctuation, such as semi-colons, still sit outside the marks. I'd be interested to hear of another style guide that says differently (I always found that rule awkward).\n\nFinally: I'm not sure how you mean that an en dash is used to denote a duration of time. That may very well be true, but I'd need an example to know just what you mean.\n\nLindsay\n\n"
    },
    {
      "time": "29 Oct 2007 — 5:02am",
      "content": "The denotion of time he's aiming at is probably things like 'August–September' or 'from 08:00–10:00'.\n\n"
    },
    {
      "time": "29 Oct 2007 — 6:46am",
      "content": "Exactly. I was implying duration of time or dates.\n\n"
    },
    {
      "time": "29 Oct 2007 — 7:18am",
      "content": "I think maybe you want to change the \"to\" to \"do\"? This sentence isn't clear to me.\n\n#26: Whine elements receive the most attention, and which one or two messages **to** you want to command most of the viewer’s attention?\n\n"
    },
    {
      "time": "29 Oct 2007 — 7:22am",
      "content": "Mmmm yes, and about #29, I would say it is more important to use it consistently. The comma before \"and\" is called the serial comma, and for some it is the preferred method. Being consistent is more important in that regard, I think.\n\nGood work and I hope you don't mind, I'm going to stash this in my file of reference material.\n\n"
    },
    {
      "time": "29 Oct 2007 — 7:37am",
      "content": "I think a short list of 'blunders to avoid' can be useful, but not a 3 page guide to good typography. That takes a book, like Bringhurst, Felici, etc.\n\nCases in point:\n\n\"Rule 12. Increase line spacing to improve readability in text.\"\n\nToo much leading is also a problem.\n\n\"Rule 19. Ideal Column width.\"\n\nYour recommendation on ideal single column width of 4 1/2 inches is just wrong. Both Bringhurst and Felici both recommend about 2 1/2 lower case alphabets for ideal measure in a single column. The physical length will be affected by the typeface chosen. Also it will vary with leading, etc.\n\nA good relationship between font, measure, leading, number of lines, and margins is a complex subject, and central to good typography. The books devote a lot of pages to it, with illustrations.\n\nAlso the writing here is too loose and informal for a guide.\n\n"
    },
    {
      "time": "29 Oct 2007 — 9:05am",
      "content": "hey y'all,  \nthank you for the comments so far. I will be revising this later today and posting a new version.\n\nWilliam,  \nTo answer your questions: i agree w/ your statement about the column width, but it's just a rough overall suggestion. The comments you made will be a lot more evident once some examples are shown, but I def. agree with you.  \nIn terms of the writing, i intended it to be rather informal, but do you think it is too much?\n\n"
    },
    {
      "time": "29 Oct 2007 — 9:08am",
      "content": "Try this in addition:\n\n[http://ideas-training.com/PDFs/TypographyBasics.pdf](http://web.archive.org/web/20130908123631/http:/ideas-training.com/PDFs/TypographyBasics.pdf \"http://ideas-training.com/PDFs/TypographyBasics.pdf\")\n\nIt's a little bit more detailled.\n\n"
    },
    {
      "time": "29 Oct 2007 — 9:24am",
      "content": "Vertex,  \nThank you! That's a great resource.\n\n"
    },
    {
      "time": "29 Oct 2007 — 10:03am",
      "content": "#26: Whine? Which?\n\n#29: Omit entirely.\n\n"
    },
    {
      "time": "29 Oct 2007 — 10:09am",
      "content": "yes, 26 is a mistake..suppose to be 'which'\n\n"
    },
    {
      "time": "31 Oct 2007 — 9:18am",
      "content": "I enjoyed reading your rules!\n\nRegarding #29, here is the Grammar Girl (great podcast, btw) episode on this issue: (transcript included if you don't wish to listen)\n\n[http://grammar.quickanddirtytips.com/serial-comma.aspx](http://web.archive.org/web/20130908123631/http:/grammar.quickanddirtytips.com/serial-comma.aspx \"http://grammar.quickanddirtytips.com/serial-comma.aspx\")\n\n"
    },
    {
      "time": "31 Oct 2007 — 1:14pm",
      "content": "I was thinking about posting pretty much what William B. put up. Trying to measure column width in inches, without basing it on point size is pretty much like trying to say how long a piece of string would be.\n\n"
    },
    {
      "time": "31 Oct 2007 — 2:16pm",
      "content": "The only rules in typography are line rules.  \nThis is a style guide.\n\n"
    },
    {
      "time": "1 Nov 2007 — 12:14pm",
      "content": "I wish I could have had a set of rules like that at university! Granted I turned to books which I am very grateful for but now and again a check list or a prompt (which ever you prefer) would have been of immense help.\n\nThank you, I've kept a copy for future reference ;)\n\n"
    },
    {
      "time": "1 Nov 2007 — 2:12pm",
      "content": "Rule 5\n\nLetterspacing is the amount of space between characters in a  \nword. Some software programs \"caller\" letterspacing tracking.\n\nShould \"caller\" be \"call it\"\n\n"
    },
    {
      "time": "1 Nov 2007 — 9:36pm",
      "content": "2. Why put quotes (single) around em and en? The terms are not quoted in the explanation, and quotes seem to be out of place in the rule text.\n\n3. I would loose \"true\" in \"true quotation marks\". While there are fake small caps and true small caps, I don't think there are any fake quotes. There are simply quote marks and feet and inch (prime) marks.\n\n9., 10., 28. I think uppercase \"not\" is over the top. Rule 24 works effectively with a bold word, perhaps these three would too. Perhaps emphasis with italics would be even better?\n\n13. I am not sure how other people feel about this but Airal, Helvetica, Meta are all huge at 9pt. I'd say 7pt is a more appropriate lower figure. And I'm not talking about special cases (like faces not likely to be used for extended text, or special cases like children's books). I am talking about mainstream type.\n\n17. I believe the period after \"caps\" should be a comma.\n\n19. I don't feel this rule is necessary at all. You can never get it right with absolute measures like inches anyway. To me this falls under 16 where you do talk in character count unit (some people express it in ems too).\n\n24. \"spell=check\"?\n\n26. \"Whine\"?\n\n28. Quoting em again seems unnecessary. I don't think an em can be equated with 3 spaces. I would simply loose spaces reference altogether. I would also advise students against using tabs. Indents option in the software is the only way to go, imho.\n\n29. Just omit...\n\nHope that's constructive.\n\n"
    }
  ]
}
