{
  "id": "38556",
  "title": "TypeSHED11: A typography conference in New Zealand!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Kia ora folks!\n\nI am not sure whether this topic has come up, but a typography conference is going to hit Wellington & you are invited:\n\n[TypeSHED11](http://web.archive.org/web/20150416033920/http:/www.typeshed11.co.nz/): <cite>Typography, across five stretched out summer days on the water's edge. </cite>\n\nOur wine is fantastic, our beer is cold, our food is delicious & we are happy to see you! How can you not be tempted?\n\nThe call for papers deadline is 31 October 2007. Get those submissions in!\n\n—K\n\n",
  "author": "kris",
  "time": "29 Oct 2007 — 12:12am",
  "uid": "1519",
  "comments": [
    {
      "time": "29 Oct 2007 — 2:09am",
      "content": "BTW... CONGRATS ON THE NATIONAL GROT RELEASE!!!! :-) What a fine job you've done... now all you need is post that nice pdf you have somewhere on your hard drive on VLLG so we can really soak it up!\n\nMikey :-)\n\n"
    },
    {
      "time": "29 Oct 2007 — 3:14am",
      "content": "This sounds great and worthwhile, although being in Melbourne I'll have to wait and see if it fits my schedule.\n\nNot sure about the wine but Emerson's beer is fantastic. :)\n\nCheers.\n\n"
    },
    {
      "time": "29 Oct 2007 — 12:25pm",
      "content": "bloody choice mates! ill be savin up my cash and hopefully i'llo be able to coma and drink some quiality piss with you fullas!!\n\nhey Kris nice typefface! Why the hell are they using Maple on that typesehd11 page and not your national?? seems pretty dumb to me mate!!\n\n-----------------------  \nChopper Reid says \"Harden the \\*\\*\\*\\* up\".\n\n"
    },
    {
      "time": "29 Oct 2007 — 12:46pm",
      "content": "What were TypeSheds one through ten like? Or is this a Spinal Tap reference?\n\n"
    },
    {
      "time": "29 Oct 2007 — 1:04pm",
      "content": "Ha! Not a Spinal Tap reference as far as I know. If you go to the website it explains quite clearly, in nice big type: \"Typography…Zero in…to a redeveloped ex-cargo store, Shed 11\".\n\nOr do they need to make the type bigger, Si? ;)\n\n—K\n\n"
    },
    {
      "time": "29 Oct 2007 — 1:30pm",
      "content": "I suppose I should have visited the site before asking ;-)\n\n"
    }
  ]
}
