{
  "id": "38566",
  "title": "(x) Magazine text faces - ITC Berkeley, Adobe Caslon, Eldorado {Marc O}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Greetings friends,  \nI’m in the beginning stages of a magazine re-design for Montana Outdoors, a small circulation (about 45,000, mostly U.S. and Canada) bimonthly magazine that focuses on Montana conservation and wildlife issues: [http://fwp.mt.gov/mtoutdoors](http://web.archive.org/web/20071201152148/http:/fwp.mt.gov/mtoutdoors \"http://fwp.mt.gov/mtoutdoors\")\n\nWe’re a small outfit, just an editor and myself, and I’d like to launch a new look next year, with better grids and a more effective and readable typeface for our body copy. We currently use Adobe Garamond 10/13, which I think is a little light, and perhaps a bit challenging for our older readers to read comfortably.\n\nI’ve only been in the magazine design business for five years, so I have much to learn. I’d like to transition to a more square typeface with a taller x-height. Utopia is pretty high on my list right now... I’ll be pairing the body font with ITC Franklin Gothic condensed for our sans-serif / subhead choice.\n\nMy editor has asked me to survey the body text typestyles used by some of our peer magazines, who we view as the “gold standard” for us to strive for. Specifically, does anyone know at-a-glance what typefaces the following magazines use for body text:\n\nArizona Highways  \nField and Stream  \nAudubon  \n(see attached samples)\n\nThanks in advance for any help. If I can’t find the answers, I’ll do it the old-fashioned way and call their art departments!\n\n ![](http://web.archive.org/web/20071201152148im_/http:/www.typophile.com/files/arizonahighways_5839.jpg)\n  \n\n ![](http://web.archive.org/web/20071201152148im_/http:/www.typophile.com/files/audubon_3775.jpg)\n  \n\n ![](http://web.archive.org/web/20071201152148im_/http:/www.typophile.com/files/fieldandstream_6501.jpg)\n\n [‹ Does anyone know the font from the cover of Guitar Hero 3 video game?](http://web.archive.org/web/20071201152148/http:/www.typophile.com/node/38562 \"Go to previous forum topic\") [(x) Fortel's pizza signage - Franklin Gothic {Jan E, Antonio Cavedoni, Eric Quenenville} ›](http://web.archive.org/web/20071201152148/http:/www.typophile.com/node/38547 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071201152148/http://www.typophile.com/user/20505\" title=\"View user profile.\">gravityfrog</a>",
  "time": "<br>",
  "uid": "20505",
  "comments": [
    {
      "time": " 29.Oct.2007 9.16am",
      "content": "Arizona Highways: ITC Berkeley\n\n"
    },
    {
      "time": " 29.Oct.2007 9.17am",
      "content": "Audobon: Adobe Caslon  \nField & Stream: Eldorado\n\n"
    },
    {
      "time": " 29.Oct.2007 9.29am",
      "content": "Wow. Amazingly fast response!  \nThanks so much for your help. And now I’m going over the merch page to support Typophile.  \nPeace,  \nLuke\n\n"
    },
    {
      "time": " 29.Oct.2007 9.42am",
      "content": "The slab in _Audubon_, by the way, is [PMN Caecilia](http://web.archive.org/web/20071201152148/http:/www.fontshop.com/fonts/downloads/linotype/pmn_caecilia_std_ot_virtual/).\n\n"
    },
    {
      "time": " 29.Oct.2007 10.33am",
      "content": "Thank you both.  \nIf you have any favorites you recommend for consideration, I’m open. I like the density and x-height of Utopia, which I see more in newspaper body, but it might look nice in a magazine spread...\n\n"
    },
    {
      "time": " 29.Oct.2007 10.46am",
      "content": "That’s nice, a new free newspaper (like Metro) just launched here  \nwhich – I believe – also uses ITC Berkeley. I don’t know if I find it appropriate for newspaper use or not (I think not, actually), but I just wanted to mention it. ;)\n\n"
    },
    {
      "time": " 29.Oct.2007 1.03pm",
      "content": "If you’d like the large body but with more elegance, consider [Classica](http://web.archive.org/web/20071201152148/http:/www.fontshop.com/fonts/downloads/presence_typo/classica/) or [Alinea Serif](http://web.archive.org/web/20071201152148/http:/www.fontshop.com/fonts/downloads/presence_typo/alinea_serif/).\n\n"
    },
    {
      "time": " 29.Oct.2007 7.01pm",
      "content": "Can’t go wrong with Utopia. It is one of the most readable fonts out there. Plus, I think its more casual tone would work perfectly with a publication targeted towards seniors.\n\nFor your accompanying sans, Franklin Gothic works well with Utopia, I’ve used that exact combination before. Not surprisingly, Helvetica Neue is also a safe choice with Utopia.\n\n"
    },
    {
      "time": " 29.Oct.2007 7.10pm",
      "content": "In my opinion both Franklin Gothic as well as Helvetica are pretty dull typefaces for magazines. They have been used to death for it. :)\n\n"
    },
    {
      "time": " 30.Oct.2007 4.57am",
      "content": "Personally I wouldn’t go for the safe choice, but maybe that’s just me. ;^)\n\n"
    },
    {
      "time": " 30.Oct.2007 7.35am",
      "content": "I agree. Franklin is pretty common in magazines, and is certainly a safe choice, but I’m trying to keep at least ONE typeface consistent for a little familiarity to our readers.\n\nThe Alinea Serif that was recommended is just beautiful. I love the lower case g! It’s just a little too pretty for our audience. I have to strike a fine line between readers who subscribe to Audubon and Nature Conservancey versus our sportsmen readers that pick up Field & Stream and Outdoor Life.\n\nI’ll have to pick up Alinea for some freelance projects. It’s just too nice to overlook...\n\n"
    },
    {
      "time": " 30.Oct.2007 9.23am",
      "content": "You could also pick a typeface that has the same feel as Franklin, but is just a tad different in the details.\n\n"
    }
  ]
}
