{
  "id": "38575",
  "title": "Typeface used in Life magazine?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi everyone,  \nI have been going nuts trying to find out what typeface was used in Life magazine. Both in its avatar between 1883 and 1936 and later on from 1936 to 2007. Trade Gothic looks close for the logo but it came about in 1948- while the red-white logo came about in 1936. So am very confused!  \nAlso, would like to know what did they use for the text inside? Pre-1936, it looks like some serif type while the more contemporary issues seem to have a sans-serif font.  \nDoes anyone have a issue of the Life maagazine from 2005-07? I have never seen one and was wondering what the layout is like.\n\nThanks for you help guys- I hope you can crack this in time!\n\n",
  "author": "thepegu",
  "time": "29 Oct 2007 — 12:32pm",
  "uid": "23349",
  "comments": [
    {
      "time": "29 Oct 2007 — 12:40pm",
      "content": "Hi Anuranjan,\n\nplease run a [search first](http://web.archive.org/web/20150315231736/http:/www.google.com/search?q=site:typophile.com%20life%20magazine).  \nThen, logos or nameplates (I guess that is what you call an avatar) often are customly designed, and especially in pre-digital time there hasn’t necessarily have to be a font.\n\nFor the body text – do you have a sample? Are you lookng for something special? I guess they have used some faces over the years.\n\n"
    },
    {
      "time": "29 Oct 2007 — 1:17pm",
      "content": "Wow. I have never heard \"avatar\" used in this context. Fun!\n\n"
    },
    {
      "time": "29 Oct 2007 — 1:20pm",
      "content": "You can browse through [all the LIFE covers](http://web.archive.org/web/20150315231736/http:/www.coverbrowser.com/covers/life) with the ingenious [Cover Browser](http://web.archive.org/web/20150315231736/http:/www.coverbrowser.com/).\n\n"
    },
    {
      "time": "29 Oct 2007 — 1:59pm",
      "content": "Thanks guys- you are superb! And fast!  \nI had seen those forums but on searching, I could never find it again!  \nHowever, it is the following logos and text I wanted to ask about- they are from late 1800s and early 1900s. This is the earlier version of Life when it was illustration based and this logo is the older \"avatar\"! I use avatar a lot mainly because it is a multi faceted Indian word and I am from India originally! ;)\n\nAny ideas if the logo was hand drawn or set in type? The text is some serif based typeface- caslon?\n\n ![](http://web.archive.org/web/20150315231736im_/http:/typophile.com/files/oldLife_3813.jpg)\n\n ![](http://web.archive.org/web/20150315231736im_/http:/typophile.com/files/old_logo_4294.jpg)\n\n"
    },
    {
      "time": "29 Oct 2007 — 2:00pm",
      "content": "oh, sorry for the quality of the images- I took it off from a microfilm so thats why it is crappy- and I did not resize it any further as it was getting heavily pixelated.\n\n"
    },
    {
      "time": "29 Oct 2007 — 2:22pm",
      "content": "The text face in the first sample is what was generically called \"old style\". Most foundries had some version of this (sort of like Times Roman nowadays). There are some digital versions of this style: [Binny Old Style](http://web.archive.org/web/20150315231736/http:/www.myfonts.com/fonts/agfa/binny-old-style-mt/), [Monotype Old Style](http://web.archive.org/web/20150315231736/http:/www.myfonts.com/fonts/agfa/old-style-mt/), and [Linotype Old Style No. 7](http://web.archive.org/web/20150315231736/http:/www.myfonts.com/fonts/linotype/old-style-7/).\n\n\"HIGHBROW NUMBER\" appears to be an old ATF face called Post Oldstyle No. 2. I don't know of a digital version. The price and date text on the right side is [Cheltenham Old Style](http://web.archive.org/web/20150315231736/http:/www.myfonts.com/fonts/bitstream/cheltenham/).\n\nThe logo is definitely custom-drawn. This was very common back then due to the fact that metal typefaces were very limited in terms of available size and styles.\n\n"
    },
    {
      "time": "29 Oct 2007 — 2:39pm",
      "content": "Thanks Mark. Thats a great help.  \nAny idea where I can see a layout of the sunday life magazine that was published till earlier this year? I need to see what kind of a grid they used for the layout- unfortunately, I haven't seen any of these versions.\n\n"
    },
    {
      "time": "29 Oct 2007 — 5:43pm",
      "content": "Wow, I don't know where you might find those. Earlier issues, from when it was a regular magazine, would probably be available at libraries in the U.S. The Sunday newspaper supplement incarnation has probably all ended up in recycling bins.\n\n"
    },
    {
      "time": "29 Oct 2007 — 9:42pm",
      "content": "See Nick Curtis's [Saturday Morning Toast](http://web.archive.org/web/20150315231736/http:/www.myfonts.com/fonts/nicksfonts/saturday-morning-toast/) for something quite similar to 'HIGHBROW NUMBER' (based upon the Saturday Evening Post's logotype from the 20's).\n\n"
    },
    {
      "time": "29 Oct 2007 — 11:52pm",
      "content": "And [Hightower](http://web.archive.org/web/20150315231736/http:/www.fontshop.com/fonts/singles/font_bureau/hightower_text_roman_sc/?sample_text=highbrow%20number&sample_size=36&acs_p=1&acs_pt=24&acs=1)\n\n"
    }
  ]
}
