{
  "id": "38585",
  "title": "body typefaces that compliment Carter's Galliard CC",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am putting together a new magazine, using either bauer bodoni or galliard cc for the display/headline type, but i am trying to think of a face that would compliment them for the body of the publication...\n\nwhat do you all think?\n\n",
  "author": "isokon",
  "time": "29 Oct 2007 — 3:40pm",
  "uid": "23359",
  "comments": [
    {
      "time": "29 Oct 2007 — 3:41pm",
      "content": "forgot to mention, there will be some reverse outs and i am hoping to go somewhat small on the sizing given the magazine's young demographic.\n\n"
    },
    {
      "time": "29 Oct 2007 — 4:39pm",
      "content": "Traditionally, Galliard CC is used exclusively as the text face and Mantinia, also from Carter and Cone, is used as the display face. However, Galliard does have the sharpness needed to function at larger sizes. I would suggest mating Galliard to something spanish warm feeling like Bohemia or Eudald or Pradell. Ball terminals aid in legibility. Kis might look pretty too.\n\nMikey :-)\n\n"
    },
    {
      "time": "29 Oct 2007 — 4:44pm",
      "content": "Given such minimal info on the magazine it's hard to give any real suggestions. You might find some of my typefaces fit for this project. Look here;\n\n[http://www.macrhino.com](http://web.archive.org/web/20120710111132/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\nor for my latest three creations (Brasserie), Expansion and Ommegaand over here;\n\n[http://www.veer.com/products/browse.aspx?vendor=CTT&page=&view=new](http://web.archive.org/web/20120710111132/http:/www.veer.com/products/browse.aspx?vendor=CTT&page=&view=new \"http://www.veer.com/products/browse.aspx?vendor=CTT&page=&view=new\")\n\nGood luck anyway\n\n"
    },
    {
      "time": "29 Oct 2007 — 4:53pm",
      "content": "great! thanks for the suggestions, apologies about the lack of info, its kind of all over the place at the moment.\n\n"
    },
    {
      "time": "29 Oct 2007 — 5:20pm",
      "content": "when you have more info, please post...\n\n"
    },
    {
      "time": "29 Oct 2007 — 6:34pm",
      "content": "I've set two recent books using Galliard as the body typeface, and it is beautiful.\n\n"
    },
    {
      "time": "29 Oct 2007 — 7:12pm",
      "content": "Steve Peter\\> Hi, what did you use as the display complement?\n\nMikey :-)\n\n"
    },
    {
      "time": "30 Oct 2007 — 12:40pm",
      "content": "Galliard. :-)\n\nThe books are academic tomes, so the design is pretty old-fashioned, but it looks great (IMHO).\n\n"
    },
    {
      "time": "30 Oct 2007 — 10:56pm",
      "content": "I have two different editions of a particular legal text. The older set in Galliard and the most recent in Minion. I refer to the older one Whenever I can.\n\n"
    },
    {
      "time": "3 Nov 2007 — 8:56pm",
      "content": "I think your question is really what sans-serif goes best with Galliard both as display and text...whenever I do a magazine I always use two families, serif supplemented by sans, with the sans for sidebars and highlighted material, especially if reversed. With Galliard, I would suggest Josh Darden's Freight Sans or ITC Franklin Gothic, whose letterforms are very similar to Galliard in their proportions. ITC now makes both Galliard and Franklin Gothic with oldstyle figures for all weights, never available before, in OpenType format. Freight Sans comes with oldstyle figures standard.\n\n"
    },
    {
      "time": "4 Nov 2007 — 10:50am",
      "content": "Mondo\\> great suggestion! I wouldn't have considered Franklin Gothic but I think you are right.\n\nMikey :-)\n\n"
    }
  ]
}
