{
  "id": "38629",
  "title": "Personal Logo - please help!",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello, this will be my very first post at typophile.com. I’ve just recently come across this type community and wish I had found it sooner.\n\nI’m currently a graphic design student trying to create a personal logo for myself, for use on a business card and other stationary. The logo is an ambigram.\n\nI won’t tell you want it reads, I’d like to see if it is legible.\n\nAny feedback, good or bad would be appreciated.\n\nExcited to hear from you!  \n- Melo\n\n| Attachment | Size |\n| --- | --- |\n| [meloolew.gif](http://web.archive.org/web/20081203173018/http:/typophile.com/files/meloolew.gif) | 4.46 KB |\n\n [‹ Multi-Faceted Tradesman Identity](http://web.archive.org/web/20081203173018/http:/www.typophile.com/node/42091 \"Go to previous forum topic\") [Logo Critique ›](http://web.archive.org/web/20081203173018/http:/www.typophile.com/node/41437 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203173018/http://www.typophile.com/user/23404\" title=\"View user profile.\">melo</a>",
  "time": "<br>",
  "uid": "23404",
  "comments": [
    {
      "time": " 30.Oct.2007 4.20pm",
      "content": "_I won’t tell you want it reads, I’d like to see if it is legible._\n\nThen don’t call the file that way and post it under that username. ;)\n\n"
    },
    {
      "time": " 30.Oct.2007 4.55pm",
      "content": "LOL!\n\nOkay, so it says ’MELO’. :p\n\n"
    },
    {
      "time": " 30.Oct.2007 5.08pm",
      "content": "Well...I read “Otelo Melo”.  \nThe last has something...but I think they all are a little strong..not organic...not flexible...  \nPerhaphs round corners?\n\nAntónio\n\n"
    },
    {
      "time": " 30.Oct.2007 5.34pm",
      "content": "I read “melo”.... sorry! :(\n\nedit: I mean “meld”! I read meld.\n\neeblet.com\n\n"
    },
    {
      "time": " 31.Oct.2007 6.24am",
      "content": "the top ones read ’mew’ but the bottom works well, IMHO.\n\n"
    },
    {
      "time": " 31.Oct.2007 3.41pm",
      "content": "definitely a work in progress, thanks for the feedback.\n\n"
    },
    {
      "time": " 2.Nov.2007 8.05pm",
      "content": "This is my original concept drawing.\n\nMaybe I should resort to something more similar to this style?\n\n ![](http://web.archive.org/web/20081203173018im_/http:/www.typophile.com/files/melo_3986.jpg)\n\n"
    },
    {
      "time": " 2.Nov.2007 8.07pm",
      "content": "Ooohh... I definitely like the sketch direction better ... But what is your design style, usually?\n\nThanks for the feedback on mine by the way! :-)\n\n"
    },
    {
      "time": " 2.Nov.2007 8.17pm",
      "content": "This definitely doesn’t suit my style but definitely speaks about my ever growing passion for letters and new ideas. Teacher suggested my original post because it was “cleaner” and less Arabic looking.\n\nBoth lack visual interest I think.\n\n"
    },
    {
      "time": " 3.Nov.2007 8.52am",
      "content": "Ambigrams are really hard to pull off - I think you need to make it more organic like your sketch in order for it to work.\n\nI’d also recommend adding a small loop and exit stroke to the ’o’ (and by extension the base of the ’m’) to make it read less like a ’d’.\n\n- Lex\n\n"
    },
    {
      "time": " 3.Nov.2007 8.58am",
      "content": "Thanks,\n\nbut do you think an ambigram is even appropriate as a personal logo?  \nI’m beginning to wonder.\n\n"
    },
    {
      "time": " 3.Nov.2007 10.43am",
      "content": "I think an ambigram is appropriate if it speaks to you and about you as a designer. Before you start any mark, you need to be sure of what you’re communicating. That is much easier said than done when dealing with your own mark (you know, I’m in the same boat...), but you have to do that first. Maybe try defining what your design style is, and what makes you unique as a designer. What specific part of design are you most passionate about? (For me, it was type, specifically individual letterforms, so I made a mark/image out of my initials, and the complexity of the mark speaks of the general complexity of my work.) If an ambigram is justifiable, it is absolutely appropriate. Just make sure you love your concept before you move forward, because for a mark like this, if you’re heart’s not in it, it will show.\n\n"
    },
    {
      "time": " 3.Nov.2007 6.46pm",
      "content": "I prefer the last variant.\n\nOverall, I think it’s a very good logo. That said, I’m not sure why “E”, “L” and “O” all have differnt widths — optically, “O” is wider than “E”, which is wider than “L”. I’d recommend a unified width for those three letter.\n\n"
    },
    {
      "time": " 11.Nov.2007 1.24pm",
      "content": "Was playing around with the concept a little more... I think this is more legible. I haven’t decided on the actual colors I’ll be using so this is the grayscale showing the values I am considering. On that note, are there any websites that help with color choices?\n\n ![](http://web.archive.org/web/20081203173018im_/http:/www.typophile.com/files/melo_5737.gif)\n\nWhat do you guys think?\n\n"
    },
    {
      "time": " 11.Nov.2007 5.37pm",
      "content": "[Kuler](http://web.archive.org/web/20081203173018/http:/kuler.adobe.com/) is a color-picking-website-thingy. Good for inspiration, but in the end it should be up to you. :)\n\n"
    },
    {
      "time": " 11.Nov.2007 6.01pm",
      "content": "Was just shown this logo for a company called TURN.\n\n ![](http://web.archive.org/web/20081203173018im_/http:/www.typophile.com/files/turn%20logo_4382.gif)\n\nI really thought I was onto something unique... back to square one I guess :(\n\n"
    },
    {
      "time": " 11.Nov.2007 11.57pm",
      "content": "“Unique” is relative. In today’s world of 2-D design, aiming for real uniqueness (as opposed to perceived uniqueness) is somewhat unrealistic.\n\n"
    },
    {
      "time": " 12.Nov.2007 9.29am",
      "content": "Agreed. But the likeness of those two logos is unsettling. Some alterations are in order, I think. Or am I making to harsh of a comparison on those two logos?\n\n"
    },
    {
      "time": " 13.Nov.2007 10.37pm",
      "content": "New direction.\n\n ![](http://web.archive.org/web/20081203173018im_/http:/www.typophile.com/files/ambi_trace_5633.gif)\n\nfeedback, PLEASE... how can i make this a more effective LOGO?\n\n"
    },
    {
      "time": " 13.Nov.2007 11.05pm",
      "content": "I like that latest one. It would look great embroidered on a jacket, pin-striped on a motorcycle tank or maybe in the center of a phonograph record (recording labels are a place where we should see ambigrams far more often. They make more sense there).\n\n"
    },
    {
      "time": " 13.Nov.2007 11.33pm",
      "content": "Other variations.\n\n ![](http://web.archive.org/web/20081203173018im_/http:/www.typophile.com/files/melo2_5122.gif)\n\n"
    },
    {
      "time": " 14.Nov.2007 8.10am",
      "content": "The little beaks on the ’e’ are a little distracting. Try incorporating this feature into other letters (such as the top-right of the ’o’).\n\n- Lex\n\n"
    },
    {
      "time": " 14.Nov.2007 10.43am",
      "content": "The last one in your latest batch looks interesting. It resembles both a Chinese (or more generally, East Asian) seal and an Ancient Central American Hieroglyph. Now the question is, do you want that association? The “Coca-Cola” concept is entirely different, but not bad, either. It’s like traditional Eastern influence versus traditional Western influence here. Which one is closer to your identity as a designer?\n\nI strongly recommend you to base your decision about the “direction” of the logo on what you want to express with your personally logo, and not just what looks better right now. Because in the long run, the one with the “right message” will grow in appeal, while the one with the “shallow face” will get old really fast.\n\n"
    },
    {
      "time": " 14.Nov.2007 11.57am",
      "content": "The last of the last batch ... you should make the white space equal all away around. I also agree that the beaks seem superfluous.\n\n"
    },
    {
      "time": " 14.Nov.2007 10.03pm",
      "content": "Either direction would be fine, but I agree that it should be that which best reflects you and your design. You will be able to push the one that is more true to you further, and more easily. Plus, of course, you want to be honest in your representation of yourself.\n\n"
    },
    {
      "time": " 16.Nov.2007 11.26am",
      "content": "Okay, I’ve rounded out the inside edges so its not such a sharp image. Trying to “mellow” it out a little I guess.\n\nI’m asking for two suggestions at this point:  \n1. Which E is more suitable to the logo as a whole?  \n2. Which typeface might work well to compliment the logo?\n\n ![](http://web.archive.org/web/20081203173018im_/http:/www.typophile.com/files/melo3_5584.gif)\n\nThank you to everyone who has help me throughout this process. Designing for myself has proven to be the most challenging process I’ve ever been through in my short career.\n\nKevin Melo\n\n"
    },
    {
      "time": " 16.Nov.2007 2.56pm",
      "content": "Looks a lot better now. The latter e is far more appropriate.\n\n"
    },
    {
      "time": " 16.Nov.2007 3.39pm",
      "content": "cerulean:\n\nthanks, means a lot coming from someone very experienced in ambigrams!\n\n"
    },
    {
      "time": " 22.Jan.2008 8.28pm",
      "content": "It has been awhile, but what would be an effective supporting typeface to use along side this logo?\n\n"
    },
    {
      "time": " 13.Feb.2008 2.36pm",
      "content": "I think the last one of “Other variations.” is basically the best, but the “t” is not clear. Make the “t” look like one - and it’s good.\n\n"
    }
  ]
}
