{
  "id": "38626",
  "title": "Oksana Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "dear typophiles!\n\nI work over [my round letters](http://web.archive.org/web/20150303050538/http:/www.typophile.com/node/37078) and now I cut the serifs.  \nbasically, I'd like to save its soft look.\n\nhere is normal:\n\n ![](http://web.archive.org/web/20150303050538im_/http:/typophile.com/files/tf_sans_reg_4615.gif)\n\nand bold faces:\n\n ![](http://web.archive.org/web/20150303050538im_/http:/typophile.com/files/tf_sans_bold_5777.gif)\n\nplease tell me what do you think about.  \nthank you, Andrij\n\n",
  "author": "andrijtype",
  "time": "30 Oct 2007 — 1:17pm",
  "uid": "7662",
  "comments": [
    {
      "time": "30 Oct 2007 — 3:36pm",
      "content": "I think the 'normal' is very light for a normal weight. Or is it me?\n\n"
    },
    {
      "time": "31 Oct 2007 — 2:19pm",
      "content": "I find these letters way to wide. I'm not a fan of wide type but this one definitely not just looks wide but also stretched. Which is not good.\n\n"
    },
    {
      "time": "1 Nov 2007 — 8:47pm",
      "content": "Jelmar (Quincunx ) is right.\n\nI find that the bold is working better than the light.\n\nThe strech feeling comes mostly from big apertures in the p p q & o. They look stretched. The others don't so much. They need to match.\n\nLook at the spaces between the letters. Look at the spaces inside. see how the big openings don't work with the letter spaces? They need to relate to each other & feel good together. Sculpt that white & forget the black for a while. Then when you can see the white spaces properly come back to the black & then see them together.\n\nI think the leg on the cap L is a very good width.\n\nThe g needs reconsidering.\n\nThe tooth on the Cap C seems like it's too much.\n\nBefore you get too crazy - ask yourself ( and maybe tell us ) - what is this for? The better answer to that question you have the better the font.\n\nKeep going.\n\n"
    },
    {
      "time": "3 Nov 2007 — 1:19pm",
      "content": "Quincunx, litera, Eben Sorkin  \nthank you!\n\ni think it would be a display sans so i consider to make normal & bold so contast.  \nEben, thank to you i get another point of view and need some time to play over it ))\n\n"
    },
    {
      "time": "4 Nov 2007 — 3:29am",
      "content": "for those of you wanting to comment, you may want to have a look at [Oksana](http://web.archive.org/web/20150303050538/http:/www.myfonts.com/fonts/andrijtype/oksana/).\n\n"
    },
    {
      "time": "10 Nov 2007 — 1:05pm",
      "content": "Oksana is very hip, but just cutting of the serifs a new typeface does not make. Orighinal Yoda-quote.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "28 Jan 2008 — 6:40am",
      "content": "hello again!\n\ni spend some time with this font,  \nso please look to new oksana sans  \nwith slavic cyrillic:\n\n ![](http://web.archive.org/web/20150303050538im_/http:/typophile.com/files/oksana_sans_2_5820.gif)\n\n"
    },
    {
      "time": "13 Feb 2008 — 3:59am",
      "content": "promo-picture:\n\n ![](http://web.archive.org/web/20150303050538im_/http:/typophile.com/files/oksanasans_5884.jpg)\n\n"
    },
    {
      "time": "13 Feb 2008 — 4:36am",
      "content": "I think things are clearly getting better! The bold seems to have really come into it's own! Here are some suggestions: About the thin parts - their use could be nice but because they only occur in some letters & not in others it creates an uneven effect which I think isn't ideal. I think you should decide to keep them & expand their use or make the thinking more subtle. The spacing between letters is getting much better. It seems more right in the case of the bold still. With the lighter weight I would consider gently narrowing the wider openings c, o, b etc and keeping your overall spacing scheme. Or letting the lighter letters' spaces open up more to match the counters. If it was me I would go with the 1st option because it would make the face more versatile. The second option is a good one for making a display face because it plays to the distinctiveness of what you have. I think the g is still not quite what you want but it is an improvement. What about an more typical one store g design and leaving this one or a similar design as an option? Your design seems like it would be a natural home for a one g with just one level. If you want to keep the double story the bold g you have is the better one. And actually I quite like it, but I think it needs an ear to work perfectly. There is something odd about the lc o I can't say for sure what it is. Maybe it's an artifact, but does it have the same height and depth as your lower case e? Probably it should. The nearly touching in the ft & FT seems like something to fix. Either let them overlap or don't. I would not. Congratulations on great progress!\n\n"
    },
    {
      "time": "14 Feb 2008 — 11:32am",
      "content": "Looking at this image I thought of this inside & outside balance that I keep talking about.\n\n[http://ilovetypography.com/img/arnhem-2.gif](http://web.archive.org/web/20150303050538/http:/ilovetypography.com/img/arnhem-2.gif \"http://ilovetypography.com/img/arnhem-2.gif\")\n\nI should note that this designer, in addition to keeping a nice balance of inside & outside white has done something else as well, something that you may or may not want to do. He has kept the width of the glyphs constant instead of making them wider as they get bolder which is more common and which may be easier.\n\n"
    },
    {
      "time": "16 Feb 2008 — 2:41am",
      "content": "oh thanks, Eben!  \ni have one-level -a- and -g- in alternatives, but still want two-level -g- without ear. i have no argument for it, but like it )) i'll make a ear for -g- in oksana\\_slab and serif.\n\n ![](http://web.archive.org/web/20150303050538im_/http:/typophile.com/files/gaga_3553.gif)\n  \nso i'll play with widths and spaces again \n"
    },
    {
      "time": "16 Feb 2008 — 10:28am",
      "content": "I have been meaning to give you a reference or two because it isn't always something that is easy to do or to see.\n\nhere is one:\n\n[http://briem.ismennt.is/2/2.3.5a/2.3.5.02.method.htm](http://web.archive.org/web/20150303050538/http:/briem.ismennt.is/2/2.3.5a/2.3.5.02.method.htm \"http://briem.ismennt.is/2/2.3.5a/2.3.5.02.method.htm\")\n\nIt's the Noordzij example I really wanted to link to, but the letterror images are not loading today.\n\nIt's from this book.\n\n[http://www.typotheque.com/books/the\\_stroke/](http://web.archive.org/web/20150303050538/http:/www.typotheque.com/books/the_stroke/ \"http://www.typotheque.com/books/the\\_stroke/\")\n\nHave you had a chance to see it? Perhaps I can scan the example I want to show you later. Or someone else can link to it.\n\n"
    },
    {
      "time": "16 Feb 2008 — 12:24pm",
      "content": "Here it is\n\n ![](http://web.archive.org/web/20150303050538im_/http:/typophile.com/files/whitespace_3494.jpg)\n\nThe idea being that on the top & bottom the white space and inter-letter space relate. And in the middle example it does not.\n\n"
    },
    {
      "time": "16 Feb 2008 — 11:08pm",
      "content": "This is different from the Arnhem. It expands left to right.\n\n[http://www.flickr.com/photos/ebensorkin/2270141025](http://web.archive.org/web/20150303050538/http:/www.flickr.com/photos/ebensorkin/2270141025 \"http://www.flickr.com/photos/ebensorkin/2270141025\")\n\n"
    },
    {
      "time": "19 Feb 2008 — 4:56am",
      "content": "many thanks, Eden!  \nArnhem system looks great.  \ni knew about classic spacing scheme, but i tried to keep one more tight. i spend some time with ovals, especially with -e- and -c-.\n\nhere is like Regular weight looks now:\n\n ![](http://web.archive.org/web/20150303050538im_/http:/typophile.com/files/oksana_sans_newspace_6156.gif)\n\n"
    },
    {
      "time": "20 Feb 2008 — 2:45pm",
      "content": "I can't speak to the cyrillic, but the latin lc x seems too wide. The Narrow bits seem a little too narrow. It's interesting how different the words veldt, and zephyrs seem like they fit well. Look at the others & see if they do as well & if not why. The top of the e might overshoot a bit more. Does it go as far as the o? Look at the space between the i & c in quick. Now look at the other side u & i. They feel too different.\n\n"
    },
    {
      "time": "2 Mar 2008 — 1:58pm",
      "content": "Eben, thanks you a lot!  \nnow i need to make a break with Oksana, but i will play again with it.\n\nofftopic:  \ni saw very funny pysanka's in your flickr album.  \nhave you Ukrainians in family?\n\n"
    },
    {
      "time": "10 Mar 2008 — 12:26pm",
      "content": "<cite> Ukrainians </cite>\n\nSure. But I learned about it on my own. We have no big tradition about it - as you can see.\n\n"
    }
  ]
}
