{
  "id": "3862",
  "title": "/need to get in touch with a greek designer/",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Any skilled type designer or graphic designer here from Greece or very familiar with Greek culture? If you are reading this - please leave your mark and i will contact you via email. I have some questions about greek type and whatnot. \\* martin (core)\n\n [‹ Original](http://web.archive.org/web/20080709011631/http:/www.typophile.com/node/4038 \"Go to previous forum topic\") [Charlotte Sans. What do you think of it? ›](http://web.archive.org/web/20080709011631/http:/www.typophile.com/node/34177 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080709011631/http://www.typophile.com/user/939\" title=\"View user profile.\">core</a>",
  "time": "<br>",
  "uid": "939",
  "comments": [
    {
      "time": " 13.Nov.2002 6.37am",
      "content": "well, let's leave a mark then... ![:)](http://web.archive.org/web/20080709011631im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 13.Nov.2002 12.01pm",
      "content": "this is a mark\n\n"
    },
    {
      "time": " 17.Nov.2005 2.59am",
      "content": "+ we are not many, are we? +\n\n"
    },
    {
      "time": " 17.Nov.2005 4.50pm",
      "content": "Tesera? Endaxy.\n\nChrisL\n\n"
    },
    {
      "time": " 17.Nov.2005 5.08pm",
      "content": "Portrait of the Artist as a YOUNG Man\n\n ![](http://web.archive.org/web/20080709011631im_/http:/www.typophile.com/files/evzone%20chris.jpg)\n\nChrisL\n\n"
    },
    {
      "time": " 22.Nov.2005 3.23pm",
      "content": "I have seen the work of Christos Tsolerides. And it is good.\n\nhhp\n\n"
    },
    {
      "time": " 22.Nov.2005 3.37pm",
      "content": "“I have seen the work of Christos Tsolerides. And it is good”\n\nYes, it is—and, he is Superman disguissed as a mild-mannered graphic designer 8-)\n\nChrisL\n\n"
    },
    {
      "time": " 22.Nov.2005 3.41pm",
      "content": "You’re still cuter though.\n\nhhp\n\n"
    },
    {
      "time": " 22.Nov.2005 6.12pm",
      "content": "\\>I have some questions about greek type\n\nDon’t ask Gerry Leonidas. He will tell you to get your pencil out, have a couple of drinks, and start writing.\n\n"
    },
    {
      "time": " 24.Nov.2005 10.02am",
      "content": "Yes, only listen to artistes drunk on their own “internally consistent” creativity...\n\nI mean, Nick, don’t you even have an iota of a shadow of a doubt that maybe just maybe it might be worth listening just a little bit to the foremost type expert in a given writing system? It’s not like I agree with Gerry on everything, but if I manage to pay attention to <cite>you</cite>, I hope you can manage to pay attention to him, at least when it comes to friggin’ Greek type, sheesh.\n\nOn this day, give thanks that people even bother to try to help you.\n\nhhp\n\n"
    },
    {
      "time": " 24.Nov.2005 12.09pm",
      "content": "Hrant, the topic of my thread was “angle of the tonos”. I had hoped Gerry would have had more to say about why various factions preferred different angles. Rather than discuss that topic, he used the opportunity to take a patronizing shot at my typeface, as if I were one of his students. He didn’t reply to my rationale.\n\n"
    },
    {
      "time": " 24.Nov.2005 12.58pm",
      "content": "I actually thought Gerry was being quite tactful, if also candid. BTW, it’s not good to make public [parts of] a private exchange (except by explicit previous permission).\n\n\\> my design philosophy is different\n\nThe point being this may be unsuited to the healthy development of [Greek] type. You will disagree. Which is fine. But when you get bitter, Design suffers.\n\nhhp\n\n"
    },
    {
      "time": " 24.Nov.2005 2.37pm",
      "content": "\\>BTW, it’s not good to make public [parts of] a private exchange (except by explicit previous permission).\n\nI haven’t. It’s all on the Typophile record.\n\n\\>But when you get bitter,\n\nPerhaps a little, but you wind me up with your “artiste” bullshit, Hrant. On reviewing the thread I see that Gerry had in fact initially taken the time to make a number of informative points about the the angle of the tonos, but it’s not tactful to speak to an established designer as if he’s one of your students. I don’t have any beef with Gerry, only with you.\n\nI thought his comment about the two tumblers and the soft pencil was rather amusing. Perhaps when I repeated it, I should have put the happyface emoticon after it.\n\n"
    },
    {
      "time": " 24.Nov.2005 3.25pm",
      "content": "\\> I don’t have any beef with Gerry\n\nExcept to think that people shouldn’t ask his opinion about Greek type...  \nSo Nick, now I’m wondering: what should people ask <cite>your</cite> opinion about?\n\n\\> ... rather amusing.\n\nAmusement was not what you conveyed in your first post in this thread.\n\n—\n\nNick, FYI, this wanton revisionism isn’t working at all.\n\nhhp\n\n"
    },
    {
      "time": " 24.Nov.2005 9.13pm",
      "content": "Hrant, get your pencil out, have a couple of tumblers, and do another Armenian script wontcha? I’m thinking something informal, along the lines of Comic Sans, could be a big hit.  \nOh sorry, I forgot to flag that as a joke :-)\n\n"
    },
    {
      "time": " 2.Dec.2005 7.06pm",
      "content": "I’m smelling “Cyrillic: Don’t ask Maxim” coming up next...\n\nhhp\n\n"
    },
    {
      "time": " 2.Dec.2005 10.11pm",
      "content": "And Armenian Don’t ask Hrant...\n\n"
    },
    {
      "time": " 3.Dec.2005 9.39am",
      "content": "Natch.  \nBut Devanagari, Arabic, Hebrew and even Tamil, do ask Nick!\n\nhhp\n\n"
    }
  ]
}
