{
  "id": "38633",
  "title": "Mini Projects?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone,\n\nI’m new here so be gentle!\n\nAnyway, as I’ve been out of the design loop for awhile (having a baby and being a mum!) means I’m rusty on most things. (Though its coming back, the old ’its like riding a bike analogy!) I was wondering whether any of you have mini projects that you do to keep your creative juices flowing and whether you cared to share what you did?\n\nI keep a journal of creative thought, so if something inspires me I document it, I tend to write a fair amount and then typeset that but I was just interested in something a bit quicker and would help me find my footing again!\n\nRed.\n\n [‹ Typeface similar to Masterfile logo](http://web.archive.org/web/20081203190330/http:/www.typophile.com/node/38705 \"Go to previous forum topic\") [Question: according to you, what's the best font for books' body? ›](http://web.archive.org/web/20081203190330/http:/www.typophile.com/node/38487 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203190330/http://www.typophile.com/user/23308\" title=\"View user profile.\">Redbec</a>",
  "time": "<br>",
  "uid": "23308",
  "comments": [
    {
      "time": " 31.Oct.2007 5.29pm",
      "content": "Welcome, Redbec.\n\nMost of my free time energy goes into illustration and fine art, but for design type mini projects I’ll do logos for myself or redesign my website (maybe one reason it is a permanent work in progress)... Stuff like that. Since coming here though, it’s typefaces... So, be careful :o)\n\nR\n\n"
    },
    {
      "time": " 1.Nov.2007 1.19am",
      "content": "Lol, thanks for you’re suggestions :)\n\nI’m already a typographer so I know how addictive type gets! I’ve not had a chance to get around to sorting out my website. It’s on that list of other things to do which gets bigger by the day.\n\nRed.\n\n"
    },
    {
      "time": " 1.Nov.2007 6.51am",
      "content": "I wish I had free time.\n\nBut...if you’re looking for something...you have a baby now!:\n\n- get the baby’s blog set up  \n - design some posters for the baby’s room  \n - design some wooden toys for the baby (letter blocks!)  \n - the kid needs a logo, right?  \n - start getting some baby onesies with type designs on it printed at an online shop  \n - Type sculpture mobile  \n - type stencils for the baby room\n\n"
    },
    {
      "time": " 1.Nov.2007 12.02pm",
      "content": "Sadly everything you’ve just mentioned I’ve already done! But thank you!\n\nTbh, my main point of this post was to see if people did their own projects outside of their work time and how they got their creative juices flowing? At the time of my first post I had just applied to do my MA and had spent a fair bit ’lurking’ here.\n\nRed.\n\n"
    }
  ]
}
