{
  "id": "38636",
  "title": "Logo for area youth event",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This is a first attempt for a logo for an event that a group of local churches want to put on called “The Bridge.” The demographic we’re trying to meet is high school through mid-twenties. The purpose of the event is to provide an open environment for Christian students to get plugged into spirituality groups at the local churches, as well as a forum for young people interested in Christian spirituality to explore what it might mean for them. Just want to put that out there so you understand what we’re going for. Please contribute your honest, frank and respectful comments.\n\n ![](http://web.archive.org/web/20080821154342im_/http:/www.typophile.com/files/bridge%201_6421.png)\n\n [‹ Logo for graphic design studio](http://web.archive.org/web/20080821154342/http:/www.typophile.com/node/38847 \"Go to previous forum topic\") [Suggestions on Serifs that will compliment Chalet(in my new logo). ›](http://web.archive.org/web/20080821154342/http:/www.typophile.com/node/40034 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821154342/http://www.typophile.com/user/16005\" title=\"View user profile.\">nvhladek</a>",
  "time": "<br>",
  "uid": "16005",
  "comments": [
    {
      "time": " 31.Oct.2007 2.03pm",
      "content": "This may sound harsh.\n\nThis logo is nowhere near your age group you’re aiming. It lacks youth. It looks like an undertaking service (the bridge between life and death)... Sorry. But I think you’ll have to try again.\n\nI know it sounds harsh but this was a way of keeping you away from the current idea.\n\n"
    },
    {
      "time": " 31.Oct.2007 3.09pm",
      "content": "not at all harsh, just honest, i suppose. ok, ok, i’ll be back.\n\n"
    },
    {
      "time": " 1.Nov.2007 7.57am",
      "content": "i have to disagree with litera’s comments. i think it’s not generic _enough._\n\ninfographics are pretty hot in youth culture right now, visuals that look like public warning glyphs and the like. you’re kinda close to that aesthetic, but right now it’s simply boring.\n\nthe type is sitting between styled and unstyled, and needs some attitude in one direction or the other. either remove your opinion entirely so that it reads as _just_ typographic information—helvetica, something generic—or make it flashier, somehow.\n\n"
    },
    {
      "time": " 1.Nov.2007 9.59am",
      "content": "ok, the reason i said i would be back was that i wanted to determine if my intuition towards infographics was appropriate. thank you, patricking, for your affirmation of that direction. were you thinking something like this would be a little more interesting?:\n\n[http://www.fpcukiah.org/misc/thebridge2.png](http://web.archive.org/web/20080821154342/http:/www.fpcukiah.org/misc/thebridge2.png \"http://www.fpcukiah.org/misc/thebridge2.png\")\n\n(sorry about the link; i would have rather put the image right in the comment, but firefox under linux doesn’t play nice with typophile).\n\n"
    },
    {
      "time": " 1.Nov.2007 12.07pm",
      "content": "i think you should pull even further back and take almost all the personality out of it.\n\nmake those crosses hard edged and the type really really utilitarian: akzidenz bold, futura bold, meta bold if you want to be a little more modern.\n\nbut let the coolness live in the arrangement of the crosses — pull ’em apart (or push them closer together) so they become a truly repetitious pattern (rather than the different space vertical versus horizontal).\n\n"
    },
    {
      "time": " 3.Nov.2007 7.02pm",
      "content": "I agree with litera 100%.\n\n"
    },
    {
      "time": " 3.Nov.2007 7.05pm",
      "content": "Why not mix up lots of crosses and build something out of it?\n\n"
    },
    {
      "time": " 29.Nov.2007 10.29am",
      "content": "Thanks for the feedback. When I presented it to the group of people working on this event, it received a pretty bland response. By and large, folks wanted it to look more “bridge-y.” They also thought that it was too static.\n\nSo I went back to the drawing board with several ideas in mind:  \n1. Make it more youthful, playful  \n2. Make it more suggestive of a bridge.  \n3. Keep the plus sign, since that was the core shape that I was riffing on.\n\nI came up with this:\n\n[http://www.fpcukiah.org/misc/thebridgeslantedskinny.png](http://web.archive.org/web/20080821154342/http:/www.fpcukiah.org/misc/thebridgeslantedskinny.png \"http://www.fpcukiah.org/misc/thebridgeslantedskinny.png\")\n\nWhat do people think? Improvement? Or go back to the drawing board again?\n\n"
    },
    {
      "time": " 1.Dec.2007 12.30am",
      "content": "Hey Nick,\n\nGood to see someone from California is on here. Only a few of us are.\n\nI may be too a bit too forward in saying this but I think this definitely needs to have some more production put into it. From a typographic stand point the construction of type is absolutely horrid. A typeface can make or break a logo, in this case it destroyed the feel compositionally and aesthetically. The weights do not match, widths of the letters do not match, the bowls of some glyphs have mistakes, the strokes aren’t fluid (giving a calligraphic feel almost, like it was drawn with a flat speedball pen), kerning/spacing is all over the place, and the tail on the upper case ’R’ is too heavy. Is it hand drawn or a free font?\n\nAlso, (sorry again if I seem like a jerk, but just trying to help) the Cross feels like a 1980’s t-shirt logo for a no-name skate shop in Bakersfield or something (I know, it’s a weird example). I would go back to the drawing board and simplify the type and the cross.\n\nUse bauhausian geometric type (which is really popular) make it look 3-D or distress the logo. Kids eat up that kind of corporate imagery. Hope that helps, goodluck.\n\n[Good example of graphic design that teens love](http://web.archive.org/web/20080821154342/http:/logopond.com/gallery/detail/14782)\n\n"
    },
    {
      "time": " 1.Dec.2007 9.07pm",
      "content": "I was trying for the corporate imagery in my first attempt, although only partially succeeded...\n\nI very much like the Bauhaus idea, thank you for that Wesley... as a child of the 80s it does have the feel I am going for.\n\nWhich is to say it makes me laugh that in my second design I succeeded in the 80s feel, although I was not going for “no-name skate shop in Bakersfield.”\n\nI was trying to avoid the distressed look, since it seems so “of the moment,” and, in fact, cliché to me, but maybe I need to give the kids the hotness that they want? Any opinions? In the meantime, I’ll be back with some other concepts...\n\n"
    },
    {
      "time": " 5.Dec.2007 11.24am",
      "content": "OK - here’s a direction that takes into account the bauhaus & distressed advice. (Note: I haven’t started working on the kerning of the text yet; it’s still a sketch)\n\n[http://www.fpcukiah.org/misc/thebridge3.png](http://web.archive.org/web/20080821154342/http:/www.fpcukiah.org/misc/thebridge3.png \"http://www.fpcukiah.org/misc/thebridge3.png\")\n\nWhat think ye?\n\n"
    },
    {
      "time": " 6.Dec.2007 6.10am",
      "content": "Woa, the latest one looks like something for a Beatles-esque band.\n\n"
    },
    {
      "time": " 6.Dec.2007 8.03am",
      "content": "... which given the demographic might work out perfectly. beatles = cool, retro... rockstars. i think it’s a winner. i would recommend getting some advice about how to improve the drop shadow. i know enough to know it needs some work, but not enough to know how to fix it. how annoying am i? :) i admire your perseverance and your willingness to take advice. good work.\n\n"
    },
    {
      "time": " 6.Dec.2007 12.51pm",
      "content": "You sure the Beatles are “cool” for the intended audience?\n\nSeriously, the problem is that logo doesn’t have any element of spirituality in it. It doesn’t always take a cross to represent Christian spirituality, for a logo for a religous organization does need to show some sort of spirituality in some way.\n\n"
    },
    {
      "time": " 6.Dec.2007 10.12pm",
      "content": "Ya, I agree. This version is not going to appeal.\n\n"
    },
    {
      "time": " 7.Dec.2007 3.52pm",
      "content": "okay ... is anything in the third idea going in the right direction?\n\nalso, it’s great that people add their 2 cents, and all, but it would be helpful for folks to add to the conversation. in other words, if you agree with something that has already been said, then it doesn’t help me just for you to state your agreement. unless, that is, you don’t think that the previous poster’s opinion stands on its own without a fan club. i’m not picking on you picard102; this has already happened on my thread, and it happens often enough on other threads for me to notice. i don’t post here because i’m a masochist; i post because i need critique in order to discover and learn during my process. thanks!\n\n"
    },
    {
      "time": " 8.Dec.2007 1.50pm",
      "content": "The second design struck me as very much like Hitchcock movie titles; very ’60s suspense/horror. Not the mood you’re looking for, but file that design away for later use. I like it but not on this job.\n\nThe third is very iconic of Sacramento (at least, I think that’s the bridge in that one) but I guess it could be any tower draw bridge. I don’t know how many of those there are in the world.\n\n"
    },
    {
      "time": " 8.Dec.2007 4.03pm",
      "content": "very good eye cuttlefish - the image is, in fact, based on a destruction of a freeware image of the Sacramento bridge. I should do more research on it, actually.\n\ni see the hitchcock feel, now that you mention it.\n\ni’ll be back on monday with another idea ...\n\n"
    },
    {
      "time": " 8.Dec.2007 9.25pm",
      "content": "wait, wait... why a new option? i fail to see why the third option needs to be discarded. hpjames asks if the beatles are “cool” for the intended audience... hpjames says no, i say yes. the 9th grader for whom i was a nanny last year ADORED the beatles, as does my 17 year old cousin. admittedly those examples aren’t enough to make a case, so why not do your own mini market research... take the logo a bunch of teens, and see what they think. picard says it won’t appeal, but doesn’t give any specific reasons why not, nor does he offer any useful criticism for improving it. henryp also talks a bit about the fact that the cross is not the only symbol that can represent christianity. agreed! there are many symbols that represent christianity, the chalice, bread, fish, bible, etc. in fact in many evangelical circles a bridge is PRECISELY the image used to represent christianity... (see [http://www.edburrell.com/bridge\\_3.jpg](http://web.archive.org/web/20080821154342/http:/www.edburrell.com/bridge_3.jpg \"http://www.edburrell.com/bridge\\_3.jpg\") and [http://www.azfireandwater.com/jesus2.jpg](http://web.archive.org/web/20080821154342/http:/www.azfireandwater.com/jesus2.jpg \"http://www.azfireandwater.com/jesus2.jpg\")) your logo (#3) is suggestive of this theological concept. (i’m not sure if this helps or hurts your view of the logo, but it is what it is...)\n\nmy two cents? don’t give up on #3 until you have a compelling reason to... it’s the best one of the three, and i think you’re on to something... i’d be curious about what others think, particularly wesley, as his criticism was critical and concrete, and he’s from California... Good luck!\n\n"
    },
    {
      "time": " 10.Dec.2007 5.04pm",
      "content": "thanks for your enthusiasm about #3 sohappy2 ... although I didn’t want to give up on #1 until I had a compelling reason to ...\n\n(as a side note, I was in Target today and there were several Beatles items in the “hip” section of the men’s clothes area, so I think that sohappy2 is right about the Beatles still being cool. sorry henrypijames :( ... I’m sure you don’t rely on Target to define cool for you, but people who want to sell things to teenagers most likely do ...)\n\nI really think that #1 had a great concept, but I did need to do something to make it more youthful. so here’s another shot at it ...\n\n[http://www.fpcukiah.org/misc/thebridgesplatter.png](http://web.archive.org/web/20080821154342/http:/www.fpcukiah.org/misc/thebridgesplatter.png \"http://www.fpcukiah.org/misc/thebridgesplatter.png\")\n\nI think this one is “it.”\n\n"
    },
    {
      "time": " 11.Dec.2007 9.55am",
      "content": "I am unsure why the logo needs to be associated with a cross image. I know the relationship with xtians and the cross is a strong one, but it does come across as an obvious and cliched reaction for a logo aimed at a youth group.\n\nThe use of a stylized bridge would be more suited. Concentrate on number three and look at the link Wesley.Bancroft posted about youth-related logos.\n\nThink Kraftwerk, think distressed, think tertiary colors.\n\n"
    },
    {
      "time": " 11.Dec.2007 11.26am",
      "content": "i agree with you, gareth, that crosses can be cliche in church & church related IDs, but try telling that to the average person in the the pew. so of course it doesn’t need to be associated with a cross image ... i was thinking a plus sign that incidentally is a cross image.\n\nactually, let me share a little bit of my conceptual thought process...\n\nthe idea for “the bridge” is to link together youth groups from the churches in the area at one big event - hence, + to represent the link, and a group of +’s to represent the area churches getting together\n\n“the bridge” is also a resource that supports the churches involved in it - the idea here is that the event links students and youth leaders together, and helps filter the values and benefits of the event down to the member churches. hence the arrangement of the pluses in a sort of parent / children node:\n\n&nbsp;&nbsp;&nbsp;+  \n+&nbsp;&nbsp;&nbsp;+\n\ni arranged this form also to suggest a bridge - the middle + bridges the two bottom +’s, or all three +’s more loosely suggest a bridge\n\n...\n\nfrom the spiritual end, the parent / children node also is arranged in a triangle, a common form in religious art and symbolism.\n\nwithin the christian context, it implies the trinity, one of the unique (and ecumenical) doctrines of the christian religion - hence three +’s instead of a more complex parent / children node.\n\n&nbsp;&nbsp;&nbsp;+  \n+&nbsp;&nbsp;&nbsp;+\n\nnot:  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;+  \n&nbsp;&nbsp;+&nbsp;&nbsp;&nbsp;&nbsp;+  \n+&nbsp;+&nbsp;+&nbsp;+\n\nand lastly, as I said at the beginning, the plus incidentally is a cross, so it does double duty as a form in my design.\n\nnow if this is justification for an unsuccessful design, then fine, but like I said, I don’t want to give up on #1 until I really need to ...\n\n"
    },
    {
      "time": " 11.Dec.2007 12.19pm",
      "content": "Many young people who are very active in their church don’t see the cross as cliche. They wear it on shirts and jewelry. I liked the first idea also, but thought Patrick King’s suggestions should be explored. You did that somewhat with the harder edges in this version. I don’t like the font you chose. The loopy t is distracting to me. And maybe I’m nuts but the bubbles under the middle cross look like a pelvic bone.\n\nSharon\n\n"
    },
    {
      "time": " 12.Dec.2007 1.53pm",
      "content": "ok... i do see the pelvic bone thing. i didn’t before, but now that you mention it...\n\n"
    },
    {
      "time": " 13.Dec.2007 3.56pm",
      "content": "oh man! yeah, it’s really there. everyone i’ve mentioned it to sees it. look closely and you can even see fallopian tubes. this is directed to youth, but it’s not a sex ed sort of thing. yikes!\n\nanother design foiled by a rorschach pelvis.\n\nok, here’s an attempt to put the pluses and the beatles together:\n\n[http://www.fpcukiah.org/misc/bridgeplusbridge.png](http://web.archive.org/web/20080821154342/http:/www.fpcukiah.org/misc/bridgeplusbridge.png \"http://www.fpcukiah.org/misc/bridgeplusbridge.png\")\n\nany thoughts?\n\n"
    },
    {
      "time": " 14.Dec.2007 12.20am",
      "content": "While it’s a bit more suggested than literally anatomical, there is still something very crotchy going on there.\n\n"
    },
    {
      "time": " 15.Dec.2007 2.01am",
      "content": "The crossbar on the lower case _t_ needs to be a bit more thick to match the _t_ anatomically. I would just lower the bowl shape that you have going on and make the cross bar a little heavier.\n\nAlso, the character width of the _t_ does not match the rest of the ascender type characters. Make sure the widths are uniform, otherwise one will stick out like a sore thumb.\n\nOne last thing, did you alter the lower case _g_? This is Helvetica, right? Don’t round descending stroke on the lower case _g_, it makes it too chunky.\n\nGreat work, it has come a long way. Since you are using the modernist approach (Helvetica and the crosses or +’s) make the bridge less busy. Check out **Armin Hofmann**. Good work again.\n\n"
    }
  ]
}
