{
  "id": "38649",
  "title": "Combination with a humanist sans",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there,\n\nWould anyone tell me which display typeface one would combine to Bliss, Syntax or Scala Sans. I would like something feminine and lively (and fat?). It’s for an annual repport for a company dealing with food and restaurants…  \nAny idea?\n\nClaire\n\n [‹ Full set of characters in a typeface?](http://web.archive.org/web/20071102112250/http:/www.typophile.com/node/38485 \"Go to previous forum topic\") [Logo Font ›](http://web.archive.org/web/20071102112250/http:/www.typophile.com/node/38653 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071102112250/http://www.typophile.com/user/10861\" title=\"View user profile.\">claire</a>",
  "time": "<br>",
  "uid": "10861",
  "comments": [
    {
      "time": " 31.Oct.2007 9.21am",
      "content": "Sauna Black? Why not just use the Sauna family for the whole thing?\n\n"
    },
    {
      "time": " 31.Oct.2007 9.43am",
      "content": "Yes, I thought about Sauna, but then I would need to convince my “type-unfriendly” boss to buy it, and I’m afraid it’s a too difficult task. But Sauna is a lovely tasty type indeed…\n\nClaire\n\n"
    },
    {
      "time": " 31.Oct.2007 11.45am",
      "content": "Without Claus’ post, when I read your post in RSS the first typeface that came to mind was Sauna as well. So I think you have some convincing to do with your boss. Then again, Sauna (or any Underware type) is not very expensive, they are relatively cheap (seeing the quality of their fonts, and in comparison with other foundries).\n\n"
    },
    {
      "time": " 31.Oct.2007 12.01pm",
      "content": "For knowing Underware and owning some of their fonts myself, I know that Sauna isn’t expensive for what it is. But some people don’t give creation its right value.  \nThanks for your posts anyway, I’ll try to propose Sauna anyway.\n\n"
    },
    {
      "time": " 31.Oct.2007 3.25pm",
      "content": "I love Underware. I’m sort off waiting for a job for which I can use Sauna myself. I do own Dolly, which I use regularly. :)\n\n"
    }
  ]
}
