{
  "id": "38645",
  "title": "50 percent off: Sale at Stone Type Foundry",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I don’t know if this came up here before, but this might be of interest to some of you: All fonts from [Stone Type Foundry](http://web.archive.org/web/20131022102151/http:/www.stonetypefoundry.com/) are [available at half price](http://web.archive.org/web/20131022102151/http:/www.stonetypefoundry.com/pricelistbeginoa.html) until November 15th, 2007.\n\nGet top-notch families like Stone Super (56 fonts) for $240, Cycles sizes (41 fonts) for $274.50 or Silica (8 fonts) for $84.50 …\n\n ![](http://web.archive.org/web/20131022102151im_/http:/typophile.com/files/stone-sale_6015.png)\n\n",
  "author": "Florian Hardwig",
  "time": "31 Oct 2007 — 4:42am",
  "uid": "16911",
  "comments": [
    {
      "time": "31 Oct 2007 — 7:37pm",
      "content": "Why doesn't Cycles have bold and bold italic? I'd love to get it, but my books always require boldface somewhere, and of course for commercial work it's utterly useless! I'll NEVER understand how foundries can release a text family with half its nuclear members missing! What are you thinking, Mr. Stone?\n\n"
    },
    {
      "time": "31 Oct 2007 — 7:58pm",
      "content": "\\>Why doesn’t Cycles have bold and bold italic?\n\nJust checking, the nine and eleven sizes have a semi-bold.\n\n"
    },
    {
      "time": "6 Nov 2007 — 7:49pm",
      "content": "thanks William...the semibold could offer a tad more contrast (I'm reminded of Sabon bold), and anyway we still need semibold italic as well. So frustrating! I'll never understand not properly equipping text families with a choice of well-contrasted weights! Stone Serif has three beautifully contrasted weights, so why can't Cycles?\n\n"
    },
    {
      "time": "1 Nov 2007 — 3:02am",
      "content": "<cite>Why doesn’t Cycles have bold and bold italic? What are you thinking, Mr. Stone?</cite>\n\nWell, I’m sure Sumner Stone didn’t just forget about them. ;-)\n\n<cite>For 2600 years of making and re-making, the breeding of the Roman letter has been under way …</cite> [from the introduction to the [Cycles Specimen Book](http://web.archive.org/web/20131022102151/http:/www.stonetypefoundry.com/Resources/CyclesSpecimenBook.pdf)]\n\nThough this passage actually is on optical sizes, I think it shows that Cycles is meant to be a book face in a _very very_ classic sense. The idea of having bold weights (for serif text faces), in contrast, is quite young; in traditional book design there is/was no need for having a bold, let alone a bold italic.\n\nI can understand that you miss those weights and find it <cite>utterly useless</cite> for <cite>commercial work</cite>. But then, maybe Cycles never was made for loud advertising? And there are myriads of comparable faces that offer that ‘modern’ R-I-B-BI-variety. You always require boldface? Go with those alteratives! I, for one, appreciate the idea of making a nice text family with 7 (!) optical sizes, all featuring italics, small-caps, lining and os figures … And I’d prefer it over just another ‘nuclear members’-quadrumvirate – with one or two members of such a ‘value pack’ gathering dust untapped.\n\nFurther reading: [Where do bold typefaces come from?](http://web.archive.org/web/20131022102151/http:/typophile.com/node/31036)  \nThere are also some interesting quotes in this thread, [Why doesn’t Swift have a Bold Italic?](http://web.archive.org/web/20131022102151/http:/www.typophile.com/node/8029):\n\n<cite>Some designers don't make a Bold-Italic as a form of functional romanticism, or you could call it capricious (or rebellious) anachronism.</cite> — Hrant H. Papazian\n\n<cite>Bold is type on junk food.</cite> — Giampa the Great\n\n<cite>As a type designer it's hell to make the bold italic weight.</cite> — Stefan Hattenbach\n\n"
    },
    {
      "time": "1 Nov 2007 — 8:53pm",
      "content": "A quite untenable and out-of-date distinction...commercial work can be just as elegant as fine book design...I know; I do both. Mr. Stone did a bang-up job with the two bold weights and bold italics for Stone Serif...in fact, those bold italics look better than the bold romans. Truncating the offering like this just means he won't get the market penetration Cycles really deserves...that's why it's so unjustified...adding a bold and bold italic does nothing to detract from the classical beauty of the roman text face; it just gives the customer options he is entitled to have for the fancy price charged. Ditto for Requiem, which would be used all over the place by now if the foundry had enough sense to complete the family. Josh Darden's re-think of Fournier, Corundum, comes with three weights and full italics and he shows no hesitation at applying his VERY classic face to these helpful additional options. It's just good business. Nobody wants to live in a world without boldface any more than they want to live in a world without air conditioning!\n\n"
    },
    {
      "time": "1 Nov 2007 — 10:03am",
      "content": "Nobody?\n\n"
    },
    {
      "time": "1 Nov 2007 — 10:09am",
      "content": "Yeah, I agree with Paul. Small Caps and Italics are a great way to create emphasis in text, and combined with space and layout options, hierarchy as well. Sure, in some designs, bolds, etc. have their place. But they are not requirements, and I certainly find them far less important than, for example, air conditioning.\n\n"
    },
    {
      "time": "1 Nov 2007 — 11:20am",
      "content": "<cite>Nobody?</cite>\n\nFlorian said all that needs to be said.\n\n"
    },
    {
      "time": "1 Nov 2007 — 11:54am",
      "content": "<cite>...that’s why it’s so unjustified...adding a bold and bold italic does nothing to detract from the classical beauty of the face; it just gives the customer options he is entitled to have for the fancy price charged.</cite>\n\nIf you think that you’re entitled to _more_ when you buy a typeface from Sumner Stone it must be because you’ve carved accolades to yourself into the back your teeth that you can stare at while your head is jammed up your colon.\n\n"
    },
    {
      "time": "1 Nov 2007 — 1:07pm",
      "content": "\\>Nobody wants to live in a world without boldface any more than they want to live in a world without air conditioning!\n\nAnd that, friends, is a boldfaced lie!\n\n"
    },
    {
      "time": "1 Nov 2007 — 5:04pm",
      "content": "<cite>...that’s why it’s so unjustified...adding a bold and bold italic does nothing to detract from the classical beauty of the face...</cite>\n\nActually, no, I think at times it does indeed \"detract from the classical beauty of the face\". By way of illustration, have a look at Alex Kazcun's 1991 expansion of Rudolf Růžička's [Fairfield](http://web.archive.org/web/20131022102151/http:/www.linotype.com/420/fairfield-family.html), which in part \"delicately tilt[ed] it from a pre- to a postmodern design\", as noted by Bringhurst in his <cite>Elements</cite> (3.0, p. 227).\n\nI have tried using Kazcun's Fairfield, but it's just not the same typeface. I suspect Cycles might also lose as much as it would gain were it to be expanded similarly.\n\nCycles is my favorite face for setting books. I've never missed the bold or bold italic styles, no more than I regret the same \"deficiency\" in other classic faces such as HF&J's Requiem or the Carter & Cone version of Galliard. As others have stated, the optical sizes, italics, small caps and various formatting options afford more than enough opportunity for emphasis and contrast.\n\nBy the way, [SFPL](http://web.archive.org/web/20131022102151/http:/www.stonetypefoundry.com/sfploverview.html), the four-style version of Cycles that Sumner Stone created for the San Francisco Public Library, does indeed contain a beautiful bold style, but still no bold italic.\n\n"
    },
    {
      "time": "2 Nov 2007 — 2:12am",
      "content": "I'm a little confused by the font formats, e.g. with Cycles. Could somebody shed some light please?\n\nAs seen at the optional ordering page at myfonts.com (Quote: \"If you would like to order individual fonts or download the fonts immediately on purchase, most of them are at myfonts.com\"), you can't choose Open Type OTF or Open Type TTF. But there are \"Windows/Mac OS X TTF\" and the PostScript versions of Mac or Windows.\n\nWhen clicking at the \"order\" button at Stone Type Foundry it says nothing about the font format. Although there is a passage about open type features at the overview page you can't choose a font format when continuing your order. So which one do you get?\n\n"
    },
    {
      "time": "2 Nov 2007 — 3:52am",
      "content": "tina, these types of questions are best directed at the foundry.\n\n"
    },
    {
      "time": "14 Nov 2007 — 3:20am",
      "content": "Reminder … last orders! ;°)\n\n"
    },
    {
      "time": "14 Nov 2007 — 3:42am",
      "content": "Aiye, I spent all my money on eBay ....\n\n"
    }
  ]
}
