{
  "id": "38674",
  "title": "Sans titling/captioning font to work with Mrs Eaves",
  "forum": "Design",
  "tags": [

  ],
  "content": "Does anyone have suggestions for an appropriate sans to use, with Mrs Eaves used as the primary body copy font? I tried Frutiger, but it doesn’t quite look right. Today Sans?\n\n [‹ Which font?](http://web.archive.org/web/20071102112305/http:/www.typophile.com/node/38694 \"Go to previous forum topic\") [Full set of characters in a typeface? ›](http://web.archive.org/web/20071102112305/http:/www.typophile.com/node/38485 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071102112305/http://www.typophile.com/user/22894\" title=\"View user profile.\">ryanholmes</a>",
  "time": "<br>",
  "uid": "22894",
  "comments": [
    {
      "time": " 31.Oct.2007 6.44pm",
      "content": "Something a little woody might work. What kind of book is it?\n\n[http://vllg.com/KLIM/National/mudTyper+Weights/](http://web.archive.org/web/20071102112305/http:/vllg.com/KLIM/National/mudTyper+Weights/ \"http://vllg.com/KLIM/National/mudTyper+Weights/\")\n\n"
    },
    {
      "time": " 31.Oct.2007 6.45pm",
      "content": "In general I’d stay away from anything over-technical. Mrs. Eaves is a sharp, crisp version of Baskerville. If you use something too cold the page will lie flat. IMHO\n\n"
    },
    {
      "time": " 31.Oct.2007 6.52pm",
      "content": "Your link to “National” is a new one to me, I’ll put it on my list. Having given it a look-over, maybe I’ll try pairing with FF Meta and see how that looks. Or RR Glasgow is another one I really like. I think both have a feminine feel that might work well with Mrs Eaves? (latter btw is client choice, I can’t change it)\n\n"
    },
    {
      "time": " 31.Oct.2007 8.33pm",
      "content": "Try Monotype grotesque. I find that it has some hideous properties that make it a great pair for a serif with a lot of personality.\n\n"
    },
    {
      "time": " 31.Oct.2007 9.23pm",
      "content": "I think Today Sans is a better choice than National or Meta which are much more condensed in feeling than Mrs. Eaves. I paired her once with Geometric 415 which worked well too. I kind of think you want a font with a round o.\n\n"
    },
    {
      "time": " 1.Nov.2007 1.34am",
      "content": "Now we’re talking—I really like the BT Geo 415 suggestion (i.e., Dwiggins’ Metro) in its Black and Light Italic weights, this will work swell. I’d try the MT Grotesque suggestion but I don’t have it. Geo and Mrs Eaves it is.\n\n"
    }
  ]
}
