{
  "id": "38692",
  "title": "[P22 type foundry] Chai Tea or Tai Chi?",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20080105130501/http:/www.typophile.com/user/7006 \"View user profile.\") : 1.Nov.2007 6.48am \n\nIntroducing P22 Chai Tea at special sale price.\n\nFrom Calligrapher & Type Designer Stephen Rapp, designer of P22 Bramble and P22 Tai Chi, comes the new script font Chai Tea. The name is play on Rapp’s Tai Chi font, but his new font evokes exotic and relaxing lands, warm and full of unexpected flavor, like a nice cup of Chai Tea.\n\nP22 Chai Tea is unique among brush lettering scripts. Its sweeping strokes and luxurious use of horizontal space lend personality and warmth to any project. Its sturdy letterforms make it ideal for logos, stationery, titling and packaging. The Pro version is stacked with alternative characters and ligatures programmed to substitute contextually in programs that support OpenType features.  \nIn addition, Chai Tea Pro contains Central European Language support that includes many ligatures with accented characters.\n\nFor the month of November, the Chai Tea Pro set is on sale for 25% off at $29.95 (regular price $39.95) [http://p22.com/ihof/chaitea.html](http://web.archive.org/web/20080105130501/http:/p22.com/ihof/chaitea.html \"http://p22.com/ihof/chaitea.html\")\n\n——————————-  \nNew Web Design\n\nOctober brings a new uniform look to two divisions of P22.  \nP22 type foundry and International House of Fonts now have a standard viewing option for selecting fonts. Each font can be seen in its full set option or as single faces. We hope you like this, because we do. [http://www.p22.com/ihof](http://web.archive.org/web/20080105130501/http:/www.p22.com/ihof \"http://www.p22.com/ihof\") As always, you can try any of your own sample text out for any of our fonts with the TypeCaster:  \n [http://www.p22.com/typecaster/master/caster.html](http://web.archive.org/web/20080105130501/http:/www.p22.com/typecaster/master/caster.html \"http://www.p22.com/typecaster/master/caster.html\")\n\n——————————-\n\nUntil next month...\n\nP22 type foundry  \n [http://www.p22.com](http://web.archive.org/web/20080105130501/http:/www.p22.com/ \"http://www.p22.com\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080105130501/http:/www.typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 1.Nov.2007 6.48am",
  "uid": "7006",
  "comments": [

  ]
}
