{
  "id": "38697",
  "title": "Agriculture Management Logo Ideas anyone?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I stumbled across this site and thought I'd see how it works. I've been freelancing most of this year and it's hard to get good feedback when you're on your own.\n\nI'm working on a logo/identity for an Ag Management company. I've been playing around with the usual earth, sky, sun icons and wondered if anyone may have a different angle.\n\n",
  "author": "Darrel",
  "time": "1 Nov 2007 — 8:00am",
  "uid": "23479",
  "comments": [
    {
      "time": "1 Nov 2007 — 9:01am",
      "content": "\"Agricultural management\" is a pretty broad area. Can you be more specific about the focus within AM, descriptors about your client (geographic location, customers, technology, business and social philosophy...), what your client feels makes them unique in the industry, and what image they want to convey?\n\n"
    },
    {
      "time": "1 Nov 2007 — 9:11am",
      "content": "They service local farms in the midwest [IN, OH, MI, etc] that range in sizes from 1000-4000 acres. They equip the farmers with GPS software that enables them to plant and fertilize fields more effectively using satellite data and even soil analysis.\n\nI'd say their customer service makes them unique along with the technology. Willing to help the local farmers. As far as image... anything is better than their current logo so that's wide open.\n\n"
    },
    {
      "time": "1 Nov 2007 — 11:06am",
      "content": "IMHO, in the ag industry, the logos that really stand out are the ones that have a strong wordmark.\n\nOtherwise, it's a field of blues and greens and cows and tractors and corn stalks.\n\n"
    },
    {
      "time": "1 Nov 2007 — 1:28pm",
      "content": "Hmmm... thanks. How about any of these:\n\n ![](http://web.archive.org/web/20131017061137im_/http:/typophile.com/files/NesterAg-logo_5517.jpg)\n\n"
    },
    {
      "time": "1 Nov 2007 — 2:45pm",
      "content": "I am really drawn to the circle with the \"grain motif\" this has a historical reference.  \nThe top one on the right with the script is elegant.  \nThe san serif bold Nester centred or to the right, merge the old and new.  \nFarming being the traditional and the GPS being the new.\n\nJust a simple designers thoughts from Calgary.\n\n"
    },
    {
      "time": "2 Nov 2007 — 9:02am",
      "content": "I like the arcs as well. To me it could represent the big horizon farmers see. I think if you removed one set of drops, and then angled the others to the horizon, it might strengthen that look.\n\nThen I would look at playing with color/gray to change one of the outer dots, or a row of dots, to provide the idea of satellite's sending down information.\n\nDon't know if any of these would work, but I would play with them.\n\n"
    },
    {
      "time": "2 Nov 2007 — 12:33pm",
      "content": "Thank you. Your comments are helpful and give me some ideas on what I can say to the company. I appreciate your input.\n\n"
    }
  ]
}
