{
  "id": "38693",
  "title": "Case-sensitive punctuation in Spanish",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m working on a new design for a bilingual Spanish/English magazine. We’re switching to a font that includes case-sensitive forms of the opening question and exclamation marks. Since we’re trying to follow Spanish typographic standards, rather than imposing (North American) English norms, I decided to use them.\n\nMy understanding is that in good, pre-digital Spanish typography it was standard to use opening marks that extend from the base-line to cap height before capitals and marks that extend from the descent to the x height before lower case letters. Failure to do this became acceptable with the advent of the typewriter and continued with electronic typesetting, where, originally, case-sensitive forms were available, if at all, in expert sets that most people didn’t have or didn’t care to use. In other words, case-sensitive forms are standard in good typography; not using them is typical of bad typography.\n\nMy manager has been told that this is just not true. “Raised” opening punctuation before capitals should not be used.\n\nCan anyone confirm either of these positions? (While I have my opinion, I don’t mind being wrong. I’m just looking for clear guidance.)\n\n [‹ Children's Charity newsletter with Helvetica Rounded Bold](http://web.archive.org/web/20071102112315/http:/www.typophile.com/node/38709 \"Go to previous forum topic\") [Importing MathType Equations from Word to InDesign ›](http://web.archive.org/web/20071102112315/http:/www.typophile.com/node/38322 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071102112315/http://www.typophile.com/user/20607\" title=\"View user profile.\">Christian Harder</a>",
  "time": "<br>",
  "uid": "20607",
  "comments": [
    {
      "time": " 1.Nov.2007 10.49am",
      "content": "I’ve seen present-day Spanish-language newspapers that use raised opening questionmark/exclam with upper and lower case.\n\nPerhaps the best way to determine the norm would be to get a selection of Spanish daily papers, and see what they do.\n\nBoth Georgia and Verdana have these characters raised as default (and perhaps other MS faces, I haven’t checked). It’s traditionally incorrect, of course, but one hell of a precedent.\n\nPreviously discussed here:  \n [http://dev.typophile.com/node/34363](http://web.archive.org/web/20071102112315/http:/dev.typophile.com/node/34363 \"http://dev.typophile.com/node/34363\")\n\n"
    }
  ]
}
