{
  "id": "38718",
  "title": "(x) \"Guido Bauer\" Art Deco script - Gracia (Troubador Open) {Mike Y (Akira)}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi  \nNew to this site any one know what this font is?\n\n[http://www.guidobauersl.com/](http://web.archive.org/web/20120219010638/http:/www.guidobauersl.com/ \"http://www.guidobauersl.com/\") Font used for company name Guido Bauer\n\nThanks for looking\n\n ![](http://web.archive.org/web/20120219010638im_/http:/typophile.com/files/logoF-2_4675.gif)\n\n ![](http://web.archive.org/web/20120219010638im_/http:/typophile.com/files/hp_scanDS_71125485052_4671.jpg)\n\n",
  "author": "<a href=\"/web/20120219010638/http://typophile.com/user/23253\" title=\"View user profile.\">Blue Sardine</a>",
  "time": "<br>",
  "uid": "23253",
  "comments": [
    {
      "time": "",
      "content": "Hi rss  \nwhere can i find this for mac can find lots art deco but not script\n\nThanks BS\n\n"
    },
    {
      "time": "",
      "content": "Similar to Monotype Script:  \n [http://www.myfonts.com/fonts/linotype/monotype-script/](http://web.archive.org/web/20120219010638/http:/www.myfonts.com/fonts/linotype/monotype-script/ \"http://www.myfonts.com/fonts/linotype/monotype-script/\")\n\nNo exact match, though.\n\n"
    },
    {
      "time": "",
      "content": "This is like some of the work done by Nick Curtis, but I checked his site for scripts and also looked at his old Freebie fonts. There were no exact matches, but I think you're right that this is from the Deco era. Nick's closest styles were [Pismo Clambake](http://web.archive.org/web/20120219010638/http:/www.myfonts.com/fonts/nicksfonts/pismo-clambake-nf/) and [Jaunty Gent](http://web.archive.org/web/20120219010638/http:/www.myfonts.com/fonts/nicksfonts/jaunty-gent-nf/), which only show that the era is similar to his work here.\n\nIs Nick around? Do you recognize this script from one of your books?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I think I just found this in a German Script book I have. It is called Gracia. I don't know if this is available in digital form, although the shading of the sample makes this seem probable.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "sounds the right track as this is a german estate agents website.\n\n"
    },
    {
      "time": "",
      "content": "I cannot find any digital version of this, at least by this name. There are two Gracia scripts at MyFonts, but they are not similar to this in any way. If requested I can make a scan from my book and show the entire font, but I will need to restart my computer to post the image (grrr!).\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Hi Mike\n\nI have uploaded a scan of logo on one of their flyers, perhaps this might help.\n\nRegards BS\n\n"
    },
    {
      "time": "",
      "content": "It’s Troubadour Open or Troubadour Script. There is a version digitized by David Rakowski. Try [Rechtman](http://web.archive.org/web/20120219010638/http:/www.moorstation.org/typoasis/designers/rakowski/dr5/davy_f5.htm).\n\n"
    },
    {
      "time": "",
      "content": "Nice work Akira. In Jaspert it says that 'Gracia' (Amsterdam) is one of the names it was sold under; also 'Donatello' (Niebolo) and 'Hertha' (Berling). The original design goes back to 1926 to Wagner & Schmidt, then cast by many foundries in 1927. Troubador Open was a Haas design by E. Thiele from 1931, if I read this right.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Well Thankyou so much for your help, It is nice to go on a forum and meet great people who not only give you an answer to a problem, but have spent time searching.\n\nI have found the font for PC so far, i have found som saying PC and mac osx but my font book in mac doesnt like any of the files i have downloaded from sites for this font.\n\nAny ideas, or if anyone has a mac version please email through.\n\nThanks so much. BS\n\n[peterhaken@mac.com](mailto:peterhaken@mac.com)\n\n"
    },
    {
      "time": "",
      "content": "[Rakowski](http://web.archive.org/web/20120219010638/http:/home.earthlink.net/~ziodavino/album1_009.htm) originally made his fonts as Mac shareware only. The original Rechtman, I believe, can be downloaded from the [Mac Font Vault](http://web.archive.org/web/20120219010638/http:/www.erik.co.uk/font/script.html).\n\nAlso, [Faces.com](http://web.archive.org/web/20120219010638/http:/www.faces.co.uk/fonts/fontview.cfm?productsku=IN100134) sells commercial versions of some of Rakowski's fonts. Presumably they are superior to the old shareware in technical quality or character set - but I don't know that for a fact.\n\n"
    }
  ]
}
