{
  "id": "38726",
  "title": "Kerning, ink traps, and balance on Print Magnate logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m finishing up identity work for a print services company, and while I love love love House Industries and their amazing Neutraface family, Display Titling was too fat and Display Bold too thin. So I used Neutra Text Bold and wanted your opinions on ink traps (which I removed from the N on two samples) and balance, and the kerning, which admittedly is still not one of my strong points.\n\nFinally, the T in “PRINT” is not mechanically aligned to the “E” in “MAGNATE” – real alignment makes the top look rather unbalanced. Does the bottom one (c) look better or worse than the middle one (b)?\n\n| Attachment | Size |\n| --- | --- |\n| [PM-logo-typophile.pdf](http://web.archive.org/web/20071202124204/http:/typophile.com/files/PM-logo-typophile.pdf) | 234.5 KB |\n\n [‹ Do any of these logotypes have potential?](http://web.archive.org/web/20071202124204/http:/www.typophile.com/node/38255 \"Go to previous forum topic\") [Wordmark. ›](http://web.archive.org/web/20071202124204/http:/www.typophile.com/node/38729 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071202124204/http://www.typophile.com/user/19862\" title=\"View user profile.\">RedMonolith</a>",
  "time": "<br>",
  "uid": "19862",
  "comments": [
    {
      "time": " 1.Nov.2007 10.32pm",
      "content": "First I just want to say how much I like the mark. Very clever use of an old trick.\n\nSecond, removing the traps is fine, I can see how it might be a good thing. However, shifting the T to align with the E makes me want to tell you the kerning is too loose in the NT pair.\n\n"
    },
    {
      "time": " 2.Nov.2007 8.32am",
      "content": "Thanks, MT! I think you’re right about the NT pair, too. Anyone else? Usually Logos / Corporate ID Design is jumping but it seems pretty slow today.\n\n"
    },
    {
      "time": " 2.Nov.2007 9.52am",
      "content": "The IN pair feels a touch too tight to me.\n\nRegarding the ink traps, that’s fine to build in for a smallish size print logo. Just make sure the traps don’t become too obvious so they become part of the actual design (i.e. like the Amplitude typeface). If this is ever going to be used to make a 3D sign, though, those traps have to come out.\n\nI’ve seen this symbol before, but I can’t place it. It’s probably not so unique that you should abandon it, but I thought it worth mentioning.\n\n"
    },
    {
      "time": " 2.Nov.2007 10.37am",
      "content": "Well, the ink traps are from the original face, because I went with Text instead of Display; I didn’t build them into it. I think that for the sizes this will likely be reproduced at that House’s original traps are way too extreme in this setting, although the ones on the A and M seem all right.\n\nAs for prior art, I didn’t find anything similar during the research phase, but that kind of bums me out because I knew it was too good (IMHO) not to have been done before.\n\n"
    }
  ]
}
