{
  "id": "38748",
  "title": "1920s/30s typography - the links between now and then",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi!\n\nI'm currently working on a project to investigate 1920s and 1930s typography. Part of the brief is to explore the links between then and now.\n\nI was reading a post about Tschichold's 'The New Typography' from August ( [http://www.typophile.com/node/36098](http://web.archive.org/web/20131022105422/http:/www.typophile.com/node/36098 \"http://www.typophile.com/node/36098\")) which gave me a few ideas, as (from my understanding anyway) people seemed to be suggesting that whereas a lot of what Tschichold wrote about isn't all that radical now and a lot of it is just common practice, when you consider it in its historical context it was revolutionary. So this would seem to me to be a link - that is that Tschichold's ideas in the 1920s have now become common in contemporary typography. I should point out that I haven't read The New Typography yet, but I have a basic idea of what it's about from researching. I'll be getting it in the library tomorrow!\n\nI was just wondering if anyone had any thoughts on this or any other links?\n\nThanks :)\n\nPS I'm new here, great site, happened to come across it when researching.\n\n",
  "author": "lizmay",
  "time": "2 Nov 2007 — 12:20pm",
  "uid": "23529",
  "comments": [
    {
      "time": "2 Nov 2007 — 12:58pm",
      "content": "I'm admittedly not completely hip to what's going on in the world of typography, but my general impression (which would be much the same as the average joe's), is that the philosophy laid down by Tschichold in The New Typography is not so much in practice in the 21st century. Lots of design magazines I see celebrate a whole lot of chaos and overphotoshopped schlock. It was my understanding from Tschichold that good graphic design begins with good typograhy, as I'm sure many typophiles would concur. However, what I see today makes me think that Adobe's got everyone bamboozled, believing that good design begins in Photoshop.\n\nBeing in Dublin, you may or may not want to explore American Typography, but if you're talking 1920-1930, I think there's some consensus that ATF's 1923 type specimen book is something of a masterpiece from that era. Both that book and The New Typography embrace elements of simplicity and order...something only the best designers of the 21st century understand (which includes a lot of designers, but most definitely not the majority of designers).\n\n"
    },
    {
      "time": "2 Nov 2007 — 1:09pm",
      "content": "\"New Typography\" has never been popular, not then, not now, not once.\n\nIt is an obscure part of design culture practised by few.  \nSubsequently, and to this day, the common practice continues to be either symmetry or sloppy, unstructured typographic layout which people think looks up to date, but lacks the pure principle. Just filling up space, not dynamically organizing it.  \nThere's more to it than rag right setting.  \nSure, there is an elaborate design history which records modernist typography, and it has a small niche in design publications -- our own little metaculture -- but it is rare in the mainstream of graphic design: magazines, newspapers, advertisements, posters, catalogs, flyers, etc.\n\n"
    },
    {
      "time": "2 Nov 2007 — 2:02pm",
      "content": "I feel that a lot of what Iwan wrote and practiced in The New Typography is still valid AND still adhered to in a lot of contemporary design. The reason is that one has to take ‘New’ with a few grains of salt — there are a lot of underlying fundamentals in the dynamic and asymmetric design he proposed that have foundations in history.  \nPeople always act kind of perplexed about Tschicholds ‘turnaround’ after WW2, when he ‘went back to traditional symmetric design’, but I think that he didn’t change that much, he just choose to be less dogmatic.  \n(OK, that’s simplified —&nbsp;I am not really in the mood to write extensively about this…)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "2 Nov 2007 — 2:26pm",
      "content": "\\> <cite>The New Typography is ... still adhered to in a lot of contemporary design.</cite>\n\nMaybe where you come from, Mr. Vanderveen...yes. And maybe you, too, Ms. Lizmay...in my limited European experiences I've always been impressed with the much higher regard for art than what we have here in the United States of Wal-Mart. The worst part about coming back to the states is the overall cultural ignorance and lack of respect for art in general. But then, I don't live in a very culturally advanced part of the country.\n\nNevermind that... Tschichold = well ordered information and less ornamentation. I very rarely see that practiced. I can think of one corporation off the top of my head...Apple. That's about it. Okay, maybe a few magazines...The Economist, sort of...though I think they could push it a little further...hey, that's a Euro-based pub! Imagine that. Surely there are more. As stated, I'm a little out of touch. My neighbors are Amish farmers (and I love 'em).\n\nIf there is a good link to Tschichold in the 21st century, it must be [Tufte](http://web.archive.org/web/20131022105422/http:/en.wikipedia.org/wiki/Edward_Tufte).\n\n"
    },
    {
      "time": "2 Nov 2007 — 2:53pm",
      "content": "Hey, wait a minute...Typophile's got some Tschicholdian flavor to it! Way to go Typophile!\n\n...if only that Super Duty type would go away.\n\n"
    },
    {
      "time": "2 Nov 2007 — 2:59pm",
      "content": "OK Liz, my comment is a bit provocative, and I would add to it that your statement \"a lot of it is just common practice\" is just as vague as the design which passes for \"modern\". Why not survey your local design culture and do a statistical analysis (eg in a newsagents) of just how much of it is bona fide \"asymmetric typography\"?\n\n"
    },
    {
      "time": "2 Nov 2007 — 3:41pm",
      "content": "\\>I can think of one corporation off the top of my head...Apple.\n\nDo you think so? I think Apple is all about symmetry.\n\n"
    },
    {
      "time": "2 Nov 2007 — 5:39pm",
      "content": "On this subject I am reminded of automobiles. Back in the day automobiles had character, style, and presence (remember that chrome bumper of the '57 Chevy or that classic tail fin on the 'ol Caddy ... drool). Today automobiles are like everything else; they all look alike.\n\n"
    },
    {
      "time": "3 Nov 2007 — 4:00am",
      "content": "I'll second that, and the car is eating the user in a justified way, bummer.  \nWould be nice to have some \"acqua & sabon\" in design education.  \np.s. Lovely website, Doug Cloud.  \np.p.s. [This](http://web.archive.org/web/20131022105422/http:/typophile.com/node/19300) was hilarious.\n\n"
    },
    {
      "time": "3 Nov 2007 — 8:32pm",
      "content": "lizmay\n\nYou are asking about links from the 1920s and 1930s to now but then you introduce Tschichold as enfant terrible. Are you just interested in European Modernism and not the Anglo-American Typographic Revival? Tschichold is linked with both.\n\nIn some very realistic terms, economic and political upturn/turmoil have far more to do with type production from this period than with any specific individual or movement. This can be verified by foundry output.\n\nIf we have inherited anything from this period, and we have, it is the basic compositional standards reiterated by any and every typography primer. This is Tschichold's contribution, and his alone. And it is a significant one.\n\nGerald\n\nThe Bieler Press  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20131022105422/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    }
  ]
}
