{
  "id": "38756",
  "title": "Italic and Roman",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "here it is.  \na paragraph set in roman. within that paragraph is a word set in italics followed by a comma. Does the comma become italic OR does the comma remain roman.\n\nfellow typographers, i am in a debate with my coworkers. I feel the comma goes italic.\n\nthoughts?\n\n",
  "author": "Brendan Callahan",
  "time": "2 Nov 2007 — 4:04pm",
  "uid": "112",
  "comments": [
    {
      "time": "2 Nov 2007 — 4:07pm",
      "content": "here it is.  \na paragraph set in roman. within that paragraph is a word set in italics followed by a comma. Does the comma become italic OR does the comma remain roman.\n\nfellow typographers, i am in a debate with my coworkers. I feel the comma goes italic.\n\nthoughts?\n\n"
    },
    {
      "time": "2 Nov 2007 — 4:20pm",
      "content": "The comma remains roman. The comma is part of the punctuation of the paragraph, which is roman, and isn't related to the italicized word, which could have appeared anywhere in the sentence.\n\n"
    },
    {
      "time": "2 Nov 2007 — 4:22pm",
      "content": "If the text immediately preceding the punctuation is styled _(e.g.,_ italic, bold), the punctuation should be likewise styled, regardless of the text that follows.\n\n"
    },
    {
      "time": "2 Nov 2007 — 4:33pm",
      "content": "I will look to Bringhurst who says, \"… there is no advantage in leaving the punctuation in roman. With italic text, italic punctuation normally gives letterfit and thus looks less obtrusive.\"\n\n"
    },
    {
      "time": "2 Nov 2007 — 4:58pm",
      "content": "I think that it depends on the audience. If you’re typesetting something that just needs to look pretty and read well, use the italic comma. If you have to deal with an uptight editorial department that won’t budge on technicalities, save yourself a headache and go roman.\n\n"
    },
    {
      "time": "2 Nov 2007 — 5:00pm",
      "content": "Or choose a typeface with very slightly slanted italics. ;^)\n\n"
    },
    {
      "time": "2 Nov 2007 — 5:10pm",
      "content": "this is getting interesting. i am in an editorial environment. edit staff says roman. part of the design staff shares that opinion. the other part of the design team agrees that it should be italic. It looks to be more of a stylistic move. So maybe the question should be, should typographers unite vs the edit staff and push for a style over grammatical?\n\n"
    },
    {
      "time": "2 Nov 2007 — 5:25pm",
      "content": "Fight the power, Brendan! :)\n\n"
    },
    {
      "time": "2 Nov 2007 — 5:33pm",
      "content": "Italicize commas, semicolons, etc…, only when they fall within italicized material, and not when they merely follow it.\n\n"
    },
    {
      "time": "2 Nov 2007 — 6:47pm",
      "content": "If Bringhurst wrote it in the good book that it should be italics, I'd trust his expertise.\n\n_So it was written so it shall be done._\n\nFight the good fight, B.\n\n"
    },
    {
      "time": "2 Nov 2007 — 9:33pm",
      "content": "I work in book publishing and it's a matter of house style. Some publishers italicize punctuation directly following itals, some don't. There's no across-the-board consensus. It's very frustrating actually to try to keep track.\n\nIn general, I'd follow the style of the manuscript and query the editor if you're not sure.\n\nPersonally, I'm with Brendan, I prefer to italicize it. I don't like the look of italic text bumping into roman without a space. It's even worse with parens or quote marks.\n\n"
    },
    {
      "time": "2 Nov 2007 — 10:27pm",
      "content": "Brendan: _So maybe the question should be, should typographers unite vs the edit staff and push for a style over grammatical?_\n\nIt's not a question of grammar. Grammar only determines that there should be punctuation present, not how the punctuation should be styled. As Patty says, this is a matter of 'house style'.\n\nPersonally, I italicise punctuation that immediately follows italic except when the punctuation is the closure of enclosing punctuation that opened with roman punctuation. In that case, I use roman punctuation for such marks (e.g. parentheses\\*, quote marks). This, of course, gives rise to situations like this, in which careful kerning between the italic comma and the roman closing quotes may be necessary:\n\n“A quote opens in roman, _but ends in italics,_” she said.\n\n\\* Actually, I almost never use italicised parentheses or other brackets; well-spaced roman brackets look much better.\n\n"
    },
    {
      "time": "3 Nov 2007 — 1:56am",
      "content": "\\>“A quote opens in roman, but ends in italics,” she said.  \nI second that, what brings less attention to the comma – go italic.\n\n"
    },
    {
      "time": "6 Nov 2007 — 5:17am",
      "content": "For what it's worth, Chicago 15 says italic comma.\n\n"
    },
    {
      "time": "6 Nov 2007 — 7:29am",
      "content": "I agree with Gary. All punctuation within a paragraph should be in one style, regardless of the style of the word before it.\n\nIf the word is **bold** , instead of _italic_, should the comma be set in **bold**?\n\n"
    }
  ]
}
