{
  "id": "38765",
  "title": "Fonts and sizes",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all, Im new to this site so please bear with me if I post in the wrong places or dont make sense : )\n\nI was after peoples opinions about fonts they like to use for Corporate Identities, not really the actual name of the company but rather addresses, names, numbers ect and what size do you usually go for?\n\nI know certain fonts require certain sizes. But any responses would be appreciated.\n\ncheers\n\n [‹ Happy Birthday, Claude?](http://web.archive.org/web/20071108215536/http:/www.typophile.com/node/38862 \"Go to previous forum topic\") [Seattle gathering! ›](http://web.archive.org/web/20071108215536/http:/www.typophile.com/node/38617 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071108215536/http://www.typophile.com/user/23541\" title=\"View user profile.\">logybear</a>",
  "time": "<br>",
  "uid": "23541",
  "comments": [
    {
      "time": " 3.Nov.2007 12.52pm",
      "content": "<cite><br>\nI know certain fonts require certain sizes.<br>\n</cite>\n\nDo you mean some fonts look best between certain sizes?\n\nI think what you are talking about is the way letterhead & business cards are handled. Basically what I have seen is that the bigger the business the smaller the type. This is over-simple but it seems to be true. There is a good reason for this. A bigger business needs to be able to print a wider range of names and addresses. Some names and addresses are longer than others - and you will want to future proof the design just in case the business grows.\n\nAs to the font, I will suggest that Helvetica gets used a lot. And News Gothic. But a formula should be avoided. This is meant to be creative work...\n\nBTW It’s a good idea to make the title a bit more descriptive of your question in the future. It fact you may want to change it if you want more responses.\n\n"
    },
    {
      "time": " 5.Nov.2007 6.49am",
      "content": "My guess is that you’re asking what fonts people like for names and phone numbers on stationery and business cards. The actual font will generally depend on what the font used in the company name is, as they need to fit well together. But generally I prefer sans serif faces in this use, which often runs at smaller sizes.\n\n"
    },
    {
      "time": " 6.Nov.2007 2.05pm",
      "content": "Yeah I was trying to mean what Don pointed out. I mean compare for example Arial/Lucida Grande at 12pt with Copperplate/Garamond 12pt and see the difference. Not that you would like to put these fonts together or anything.\n\nI like using the sans serifs too, and love to overindulge in some Geneva when I can. Permitting its fits in with the company name.\n\n’Gud job eye listened to mi motther knot two doo an Engerlish degrea’ Sorry bad joke, I know : )\n\n"
    }
  ]
}
