{
  "id": "38762",
  "title": "OK, I didn't have my camera, but...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The city of Toronto is switching over to ClearviewHwy on it’s street signage. To toaday I saw several on which the letter spacing was scrunched to almost nothing.\n\nToo bad. They could have easily used a wider blade or a narrower version. (say, 3W instead of 5W) I’ll snap some photos on the weekend.\n\n [‹ A (little) help needed... \\<( 'ω' )\\>](http://web.archive.org/web/20081205192904/http:/typophile.com/node/39101 \"Go to previous forum topic\") [Quark to InDesign plug in ›](http://web.archive.org/web/20081205192904/http:/typophile.com/node/13068 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081205192904/http://typophile.com/user/13076\" title=\"View user profile.\">russellm</a>",
  "time": "<br>",
  "uid": "13076",
  "comments": [
    {
      "time": " 2.Nov.2007 10.01pm",
      "content": "Unfortunately I am again the person with all the documents on this issue. Are you referring to the blue Clearview signs on light poles at major intersections, the white Clearview signs on residential streets, or the new business that Jerry Kramer managed to sell the city? (If it’s that one, where did you see it? And why the hell don’t you always have a camera on you?)\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20081205192904/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 3.Nov.2007 5.11am",
      "content": "russellm: “on which the letter spacing was scrunched to almost nothing.”\n\nThis is the wave of the future with this font as predicted by Nostrafontus.  \nIn the rong hands, they’d be better off up dare with birch sticks and nails.\n\nCheers~~!\n\n"
    },
    {
      "time": " 3.Nov.2007 7.08pm",
      "content": "Joe, I do, but I was driving and it was in the back seat and it was rush hour and ... never mind the sign’s not going anywhere. Text messaging while driving is challenge enough. :P\n\nThere were several in a row on Yonge Street, just south of York Mills (near south exit from York Mills Station.\n\ndberlow, You win... Well, actually, this sort of thing should be very easy to control. sign makers _are_ capable of working to specifications. They do it all the time for commercial signs that are far less important than road signs that people are supposed to be able to read from a car on a city street designed for 80 clicks but signed for 50. All that has happen is for some one realize it matters and give a damn.\n\nR\n\n"
    },
    {
      "time": " 3.Nov.2007 8.13pm",
      "content": "<cite>They do it all the time for commercial signs…All that has happen is for some one realize it matters and give a damn.</cite>\n\nKeep in mind that you are talking about bureaucrats and their dreadful minions. If anyone is likely to completely screw up a specification, it’s them.\n\n"
    },
    {
      "time": " 15.Nov.2007 6.40am",
      "content": "_Keep in mind that you are talking about bureaucrats and their dreadful minions. If anyone is likely to completely screw up a specification, it’s them._\n\nHey - I’m either a bureaucrat or one of their dreadful minions, depending on what you mean by “terrible minion” or who you ask... [insert self-deprecating humourous smiley here]and, occasionally, we bureaucrats and dreadful minions manage to do things like build bridges that don’t fall down (very often) and drive trains on time (on time being defined as... :o) or make readable signs. As you know,there is a lot of garbage made in the private sector as well as the public. In the public sector it really is simply a matter of saying, THOU SHALT NOT SMOOSH LETTERS OR MESS WITH LETTER SPACING. (and meaning it)\n\n(edited, ’cause I seem to have a a facility for killing my own threads... I meant that “I’m either a bureaucrat ” comment to sound more like a “hey, I resemble that remark” sort of thing. Sorry, James, if this post came of as testy and defensive as it seems to me today.)  \nR\n\n"
    },
    {
      "time": " 15.Nov.2007 7.58am",
      "content": "I’m a .gov minion.\n\nIn our organization, when it was time to redesign our logo, I said ’go for it’ as I had had enough of design-by-committee after creating our first logo for them in-house.\n\nSo, they went out, got an OK logo. Bland, but the committee agreed on it, and that was that.\n\nThen they asked me to create the branding style guide and manual like I had done for my own logo a year earlier, but cut and paste this new logo in to replace the one I had done.\n\nI had to explain to them 3 times that the style guide and manual was based on a specific logo and that if they want this for the new logo (which they should have) they need to have the firm that created it do it for them.\n\nThe never got around to it.\n\nOh well.\n\nAll that said, I agree with russell...this isn’t a .gov thing. This is a big-organization thing. The only difference is that corporations are able to spend a bit more money in this realm without being criticized by legislature.\n\n"
    }
  ]
}
