{
  "id": "38772",
  "title": "(x) Pantone logo - Akzidenz-Grotesk {Marten F}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I was wondering which specific typeface does PANTONE use?\n\n [‹ (x) Sans subheads on Glamour magazine cover - Abadi {Marc O}](http://web.archive.org/web/20081203111201/http:/www.typophile.com/node/38982 \"Go to previous forum topic\") [(x) FactoryMaster sans w/ rounded corners - Calibri {David S} ›](http://web.archive.org/web/20081203111201/http:/www.typophile.com/node/38948 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203111201/http://www.typophile.com/user/23547\" title=\"View user profile.\">tsurkanu</a>",
  "time": "<br>",
  "uid": "23547",
  "comments": [
    {
      "time": " 3.Nov.2007 10.51am",
      "content": "It’s [Akzidenz Grotesk](http://web.archive.org/web/20081203111201/http:/www.typophile.com/node/1437). Search first, then ask... ;^)\n\n"
    },
    {
      "time": " 3.Nov.2007 10.56am",
      "content": "If I had enough time....I would do so. Thanks for your help.\n\n"
    },
    {
      "time": " 3.Nov.2007 11.29am",
      "content": "<cite>If I had enough time</cite>\n\nWell, better let others spend their time, huh? :^(\n\n"
    },
    {
      "time": " 3.Nov.2007 11.37am",
      "content": "Thank you very much for all your help.\n\n"
    },
    {
      "time": " 3.Nov.2007 9.56pm",
      "content": "Florian, who really has time to use the crappy search engine on Typophile anyway? No one here twisted your arm to participate either.\n\nMike Diaz\n\n"
    },
    {
      "time": " 4.Nov.2007 2.17am",
      "content": "I must say using the site operator in Google is a far easier way to find [“stuff”](http://web.archive.org/web/20081203111201/http:/www.google.co.uk/search?hl=en&q=site%3Atypophile.com+stuff&btnG=Search&meta=) here than its own search engine. But then I think that of most site search engines; Google has finally broken my will to think…\n\n"
    },
    {
      "time": " 4.Nov.2007 3.05am",
      "content": "Ask and ye shall receive .... or use Ask.com :)\n\n"
    },
    {
      "time": " 4.Nov.2007 3.06am",
      "content": "Ask and ye shall receive .... or use Ask.com :)\n\n"
    },
    {
      "time": " 5.Nov.2007 1.15am",
      "content": "\\> _Florian, who really has time to use the crappy search engine on Typophile anyway? No one here twisted your arm to participate either._\n\nNo, but the FAQ specifically asks to do a Search first if you know what you’re looking for, so Florian’s remark was warranted. I think he reacted more to the _“If I had time”_ remark which made me jump as well. Especially since doing a Google Search takes exactly 0.22 seconds, so why waste our time then? :^P  \nLet’s say that — fair enough — this time it wasn’t _really_ necessary, but we’ve had times that it can became very tedious answering the same question over and over again. There’s a reason why I put that in the FAQ. ;^)\n\n"
    },
    {
      "time": " 5.Nov.2007 1.17am",
      "content": "And nobody said to use the crappy search engine on Typophile — like Simon said just use Google and restrict your search to site:typophile.com. Works perfect for me. [See the fourth hit.](http://web.archive.org/web/20081203111201/http:/www.google.com/search?q=site:typophile.com%20pantone) ;^)\n\n"
    },
    {
      "time": " 5.Nov.2007 2.26am",
      "content": "<cite>I think he reacted more to the “If I had time” remark</cite>\n\nExactly.  \nI have no problem with id-ing, searching or advising how to search – even if it was one of those notorious recurrent queries – it can be great fun, otherwise we all won’t be here, would we?  \nYet, I might have a problem with being treated as if this was a paid service.  \nWell, Ella nicely said thank you and everything is okay again. ;°)\n\n"
    },
    {
      "time": " 6.Nov.2007 3.55am",
      "content": "Every time (not sometimes, but every single time) the issue of search comes up it’s because the user is new here. (I always check how long a user has been a member). As easy as it is for us, navigation is not very novice friendly on Typophile. Information is layers deep or overwhelming. Search is apart of that too (even Google). With regards to _“If I had the time”_... maybe she doesn’t understand the process/mess here or she’s busy or even lazy. Doesn’t matter to me... because I have immediately took into account that Ella is new. Did anybody else here? Yes, Marten did when he gave her the correct answer then positively encouraged her to use the Google search. That’s how you do it.\n\n_Well, better let others spend their time, huh? :^(_ This question is repellent and not welcoming. I don’t want Ella to have the impression that those who ask questions have to feel responsible or owe or have to answer back to us. We do it for fun. We are not paid. In the scheme of things Typophile is just a trivia endeavor.\n\nThat’s why I said what I said.\n\nI will always give the newbie the benefit of the doubt. I will always light the rear-end of the person who doesn’t either.\n\nMike Diaz ;-)\n\nPS... But if you spot that disruptive good-for-nothing Mike Diaz on here- slap him down like the street corner trash he really is! :-)\n\n"
    },
    {
      "time": " 6.Nov.2007 4.33am",
      "content": "Fair enough. I think there might have been some overreacting on all parts, so now that everyone had the opportunity to explain his position, let’s learn from this and let it lie.\n\nThanks for the input everyone. :^)\n\n"
    },
    {
      "time": " 6.Nov.2007 9.31am",
      "content": ":-) Thank you. I’ll take my Prozac pills now.\n\n"
    },
    {
      "time": " 6.Nov.2007 10.01am",
      "content": "I guess before asking, I had to learn more about how this website really works. I apologize for If I had time “REMARK” (if it helps), however I really had only 30 min to create PANTONE Template (mistake would be crucial). You guys are great, just please try next time to make “new” members feel more welcome. Thank you again. Your quick response was very helpful.\n\n"
    },
    {
      "time": " 6.Nov.2007 10.55am",
      "content": "Don’t worry Ella, I have your back. Typophile is a great resource for individuals of all sorts professions related to type. Some of us are are experienced designers with degrees and accolades all over our wall or some of us are just lovers of type with few a questions to ask here and there. So its a cacophony of voices but we especially like yours. Please continue to post. We like you- _even if your from New Jersey_- kidding :o) Also glad that you found the right font for the job.\n\nBTW... Florian is an excellent font ID’r and Yves is our very own font ID moderator. Both very nice people.\n\nMe on the other hand... koo-koo, koo-koo, koo-koo- brain has checked out years ago.\n\nSee you soon & welcome to the wonderful world Typophile,\n\nMike Diaz :-)\n\n"
    },
    {
      "time": " 7.Nov.2007 9.45am",
      "content": "There’s also this little script someone (I forgot who, sorry!) wrote, which you can place as a bookmark in your browser to search Typophile. It prompts you with a little popup in which you can input search strings. The code is:\n\n`javascript:void(q=prompt('Search%20Typophile:',''));if(q)void(location.href='http://www.google.com/search?q=site:typophile.com'+'%20'+escape(q))`\n\n[edit] Oh my, that code screws with the page layout of the forum. Oh well.\n\n"
    },
    {
      "time": " 9.Nov.2007 1.36am",
      "content": "How in the world do you use that?\n\n"
    },
    {
      "time": " 9.Nov.2007 8.25am",
      "content": "You just make a new bookmark with the line of code as the internet-adress. For convenience sake you can place this bookmark in the bookmark-bar in the top of the screen (on Firefox for example, I don’t know what its called in the English version), so you can click on it. You can make new bookmarks via something like ’organise bookmarks’ in your browser. I only know how it works in Firefox, but I’m sure you’ll manage if you have a different browser.\n\n"
    },
    {
      "time": " 9.Nov.2007 8.49am",
      "content": "If you place the bookmark in the “Bookmarks Toolbar Folder” within your bookmarks, it will appear in the Bookmarks Toolbar.\n\n- Lex\n\n"
    },
    {
      "time": " 9.Nov.2007 6.40pm",
      "content": "Ah, ok, that worked. Just highlighted and dragged the whole thing to the bookmark bar. That’s pretty neat. Thank you.\n\n"
    },
    {
      "time": " 10.Nov.2007 5.49am",
      "content": "This brilliant little piece of code was written by Grant Hutchinson and graciously put at the disposition of all Typophile users. Most of us use it.\n\n"
    },
    {
      "time": " 10.Nov.2007 4.01pm",
      "content": "Alright, Yves, thanks for adding credit where it’s due. :)  \nI could not remember or find who wrote the script, but I’ve had it in my bookmarks toolbar for quite a while now.\n\n"
    }
  ]
}
