{
  "id": "38787",
  "title": "Appropriate alternates or an anachronism?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20150326043158im_/http:/typophile.com/files/imgpdh110807_4557.gif)\n\ni was wondering if certain types of letter forms are \"inappropriate\" for certain type styles. of course, the school book (or single-story) forms of a and g look funny in Bembo, but are they so bad in something like a revival of Johnston's Underground type?  \nsecond question, is it irresponsible of a designer to make these types of alternates available?  \nthird question, there is a strong correlation between some forms (a & g) and a weaker one with other forms (t & l). i'm sure the answer is \"it depends,\" but does anyone have examples of some of these conventions being successfully broken?\n\n_for the sake of transparency the original post is below, the original title of this thread was \"Is this sick and wrong?\" I prefer the ammended post above, but if you want to respond to the post below, feel free._\n\n ![](http://web.archive.org/web/20150326043158im_/http:/typophile.com/files/sickpdh110407_5926.gif)\n\nwell maybe that’s a bit more emotive than i’d like to be, but i wanted to show a few certain things and this text worked. what i’d really like to ask is is the type above in the image above “inapropriate” in any way? this is all i want to ask at this point. i’ll give more context after a few initial reactions.\n\n(post ammended 10 Nov 2007)\n\n",
  "author": "paul d hunt",
  "time": "4 Nov 2007 — 12:24pm",
  "uid": "7006",
  "comments": [
    {
      "time": "4 Nov 2007 — 12:35pm",
      "content": "The spacing looks extremely bad.\n\n"
    },
    {
      "time": "4 Nov 2007 — 1:24pm",
      "content": "A new signage font coming to Reading busses? If so it should fit in. So I'd say 'no' not wrong or sick.\n\n"
    },
    {
      "time": "4 Nov 2007 — 1:35pm",
      "content": "It looks like it should be called Johnston Schoolbook.\n\n"
    },
    {
      "time": "4 Nov 2007 — 1:39pm",
      "content": "Paul, is this from an Reading assignment?\n\n"
    },
    {
      "time": "4 Nov 2007 — 1:42pm",
      "content": "_is this from an Reading assignment_\n\nno. just for my own enlightenment. i'll actually ask some questions a little later on if you come back to this thread.\n\n_It looks like it should be called Johnston Schoolbook_\n\nprobably, but are there problems with that? is that a bad thing somehow?\n\n"
    },
    {
      "time": "4 Nov 2007 — 1:54pm",
      "content": "Are these Stylistic Sets of Underground Pro? I notice the difference on the dot of the 'i', the 'a' and the 'g'.\n\n"
    },
    {
      "time": "4 Nov 2007 — 2:02pm",
      "content": "miguel, yes, you've hit the nail on the head. now back to the question, a bit more explicit this time: is providing these alternates \"inappropriate\" for this typeface?\n\n"
    },
    {
      "time": "4 Nov 2007 — 2:07pm",
      "content": "Nothing is sick and wrong in this. One can read it easily.  \nAnd for a non design person its a typeface, just like others.\n\nI know that its not spaced at all and has no contrast in the strokes. It has lots of poor joints, bad spurs and something is really wrong with the proportions. Though at this size it works for me :)\n\n"
    },
    {
      "time": "4 Nov 2007 — 2:11pm",
      "content": "I would say the dots are too low. They \"stick\" on the main stroke a bit too much, especially in this rather loose setting. (Sorry not to answer your initial question.)\n\n"
    },
    {
      "time": "8 Nov 2007 — 3:44am",
      "content": "i modified the initial post in the interest of moving the discussion in the direction i'm truly interested in. i hope no one minds too much.\n\n"
    },
    {
      "time": "8 Nov 2007 — 4:24am",
      "content": "I bought P22 Underground Pro and I like the extra latitude these alternates give me.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "8 Nov 2007 — 9:52am",
      "content": "On the one hand, a copyist has a responsibility to the designer to stay true to his design, not to benefit from what is 99% his genius then piss on his grave by making arbitrary little changes that taint the flavor of the original because you think you know better than he did.\n\nOn the other hand, times do change, and the typefaces that survive are the ones that are adapted to the changing times and new media, so prolonging the life and relevance of a design is a serious form of homage and myth-making.\n\nThe proliferation of characters in a font is a good thing, because it helps redesigners to solve the above dilemma by providing both an authentic version of the typeface, and a contemporary freshen-up. Then it's up to the users.\n\nWhile I was disappointed that Slimbach's Jenson has chopped a couple of serifs off the M, it was nice to see that he provides the fully serifed version in an alternate set. That was before OpenType.\n\nNow with stylistic sets, foundries can have it both ways more fully, and it's easier for users than having to find\\>replace individual characters to deploy the alternates. But one version still has to be the default, and I do think that the alternate suffers by not having default status, buried in application menus and requiring a sympathetic reading of support material (PDF specimen) to fully appreciate it. Why not make two fonts, Classic and Neue?\n\nI've always been impressed with the authenticity of P22's revivals, which show great respect for their sources.\n\n"
    },
    {
      "time": "8 Nov 2007 — 11:38am",
      "content": "The text of [Never Let Me Go](http://web.archive.org/web/20150326043158/http:/www.amazon.com/Never-Let-Me-Kazuo-Ishiguro/dp/1400078776/ref=pd_bbs_sr_1/103-0785510-7085424?ie=UTF8&s=books&qid=1194550357&sr=1-1) by Kazuo Ishiguro is set in Bembo with single-story a and g alternates. Moving past the anachronism of it, the \"schoolbook\" forms echo many of the novels themes in as insightful a way as I've ever seen type do.\n\n"
    },
    {
      "time": "9 Nov 2007 — 1:24am",
      "content": "I see nothing wrong with it. For example Gill Sans had Futura-styled alternates for \"a, g, t, A and M\"\" that was the most common choice in Germany and the Scandinavian countries (pre-photosetting). Erbar had similar alternates. I think it looked good.\n\n ![](http://web.archive.org/web/20150326043158im_/http:/typophile.com/files/gill_alt_4732.gif)\n\n"
    },
    {
      "time": "9 Nov 2007 — 5:35am",
      "content": " ![](http://web.archive.org/web/20150326043158im_/http:/typophile.com/files/Johnston_not_6550.jpg)\n\n"
    },
    {
      "time": "9 Nov 2007 — 5:51am",
      "content": "thnx for posting this, peter!  \nthis gets at my 3rd question: here (as in the image i posted) the g is 1-story and the a is 2-story. do you think it \"works\"?\n\n"
    },
    {
      "time": "9 Nov 2007 — 6:03am",
      "content": "I think that the longer you've been designing type the more you learn, but at the same time you get more restricted to the ways \"it should be\". I feel that it's often the type designers who know their craft, but break away from restrictions, that do the most interesting work (Storm etc.). What works is in the eyes of the beholder.\n\n"
    },
    {
      "time": "9 Nov 2007 — 6:53am",
      "content": "_The text of Never Let Me Go by Kazuo Ishiguro is set in Bembo with single-story a and g alternates. Moving past the anachronism of it, the “schoolbook” forms echo many of the novels themes in as insightful a way as I’ve ever seen type do._\n\nInteresting! Anyone have a picture of this?\n\n"
    },
    {
      "time": "9 Nov 2007 — 6:57am",
      "content": "What makes my eyes hurt is the tail on the lower case i in Peter's sample. That is wrong and sick.\n\n"
    },
    {
      "time": "9 Nov 2007 — 7:10am",
      "content": "_this gets at my 3rd question: here (as in the image i posted) the g is 1-story and the a is 2-story. do you think it “works”?_\n\nIt's a bit hard for me to imagine that I could be persuaded that a double-story a can't work with a single-story g, as long as we accept that such an a is okay with \"single-story\" p's and q's.\n\n_there is a strong correlation between some forms (a & g)_\n\nBut isn't mixing them (1-st. g & 2-st. a) how most grotesques work? (Or do I misunderstand you?)\n\n"
    },
    {
      "time": "9 Nov 2007 — 7:11am",
      "content": "_What makes my eyes hurt is the tail on the lower case i in Peter’s sample._\n\nAnd the \"reaching\" legs of the Rs.\n\n"
    },
    {
      "time": "9 Nov 2007 — 8:06am",
      "content": "That R is straight out of Gill Sans, tho.\n\n"
    },
    {
      "time": "9 Nov 2007 — 8:44am",
      "content": "No - Gill San's R leg is quirky, but it wasn't meant to reach out almost 2x the distance that the bowl does from the stem (I'm looking especially at \"CLERK\" in the photo).\n\n"
    },
    {
      "time": "9 Nov 2007 — 12:35pm",
      "content": "More thoughts about Johnston and Gill in [this post on Typographica](http://web.archive.org/web/20150326043158/http:/typographica.org/001084.php).\n\n"
    },
    {
      "time": "9 Nov 2007 — 12:58pm",
      "content": "It could become a trend, if not the norm, that OpenType sans serif faces will be designed with both old-style and modern alternates of \"a\" and \"g\".\n\n"
    },
    {
      "time": "9 Nov 2007 — 1:46pm",
      "content": "Stephen, nice round-up. Today Sans is my go-to font when I'm looking for a Gill-alike that has more variety/options and is less quirky and overused. I like Agenda too, but don't own it.\n\n"
    },
    {
      "time": "10 Nov 2007 — 8:20pm",
      "content": "<cite>It could become a trend, if not the norm, that OpenType sans serif faces will be designed with both old-style and modern alternates of “a” and “g”.</cite>\n\nBy the way, if an OpenType sans serif face aims to cover International Phonetic Alphabet (IPA) symbols, both single- and double-storey forms of “a” will be required, since the IPA makes use of both glyphs. In addition, if the default “g” is a double-storey form, then an additional single-storey form will be required, since it's the single-storey “g” that is used by the IPA. Once you have those glyphs, it would be a simple step to designate them as alternates for the default “a” and “g”.\n\n"
    },
    {
      "time": "11 Nov 2007 — 12:31am",
      "content": "There is an inherent style portrayed in a type designers selection of like letterforms.  \nAn addition of a swash in normal letters may come from the original designers need to properly set a particular word with great flare. - - Or with the need to manage character spacing (by hand) when sign painting to monospace characters. Fast Paced planning a Hand Painted sign is initially laid out in monospace when text is to be centered. Try quickly making a hand painted sign from scratch on glass that is on a hung door. It is far different from the modern vinyl cut sign lettering that is the norm now. The hook tail on the lower case \"i\" may have come from such a monospace reason of character placement when hand painting a sign. Many older fonts have origins in hand lettereing. It may even be a quirk of a single hand painting sign guy that loves the hook in his letter \"i\"(s)...\n\nAs in the sample the R and the K in CLERK like forms emulateing one another and then there is the designers feeling of forcing differences to normmaly like forms such as a lower case L and an upper case i in the \"Daisies...\" Sample at the top of this thread.\n\nI would also consider the cap \"i\" in that sample sans font would likely be a simple vertical stroke without slabs. Most likely the same reason the lower L has the swash to prevent the uppercase i and Lower case L from being confused. The lower r emulates the lower c .\n\nAlternates in the opentype fonts ability to contain extra glyphs also afford level 4 typesetter ( on a scale of 1 to 10 ) to take advantage of glyph alternates easily - with applications that support glyph replacement functions. Opentype fonts can also fetch a higher price when they are extensively embellished with goodies or IMHO made correctly and with great care.\n\nthanks - versonova\n\n"
    },
    {
      "time": "28 Feb 2008 — 6:38pm",
      "content": "track\n\nChrisL\n\n"
    }
  ]
}
