{
  "id": "38786",
  "title": "OT - new job assistance from sensible, or not so-sensible Typohiles",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Help!\n\nI lost my “proper” job through redundancy what seems like aeons ago, and I’ve been freelancing as a graphic designer ever since.\n\nBut six years down the line, I decided I’d had enough of sitting in my pants with Radio4 and the cat as company and strove towards a stable environment full of them “people” things.\n\nI start tomorrow. (Yay!)\n\nI am terrified. (Boo!)\n\nIt’s like first day of school all over again. I’m thirty-cough and very aware I’m the new boy.\n\nAny advice from you lot as to nerves/first steps/just being in an office again would be greatly appreciated. I’m filling a new role which is apparently vital and will spend an awful lot of time doing stuff for the development/techy lot.\n\nIt’s Sunday night. I’ve left it awfully late to ask for ideas.\n\ns\n\n [‹ Looking for some info on \"Westminster\"](http://web.archive.org/web/20071108225544/http:/www.typophile.com/node/38809 \"Go to previous forum topic\") [I need reading aptitude test materials ›](http://web.archive.org/web/20071108225544/http:/www.typophile.com/node/38804 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071108225544/http://www.typophile.com/user/22082\" title=\"View user profile.\">nert</a>",
  "time": "<br>",
  "uid": "22082",
  "comments": [
    {
      "time": " 4.Nov.2007 12.04pm",
      "content": "Buona fortuna !\n\n"
    },
    {
      "time": " 4.Nov.2007 12.20pm",
      "content": "Hah! Alessandro!\n\nI shall reply to your email tomorrow, probably whilst crying and gently rocking backwards and forwards.\n\ns\n\n"
    },
    {
      "time": " 4.Nov.2007 1.26pm",
      "content": "Are you familiar with the television series “The Office”, you should be able to pick up some tips and tricks by watching it.\n\n"
    },
    {
      "time": " 4.Nov.2007 1.43pm",
      "content": "_Are you familiar with the television series “The Office”, you should be able to pick up some tips and tricks by watching it._\n\npreferably the brittish version.\n\n"
    },
    {
      "time": " 4.Nov.2007 3.04pm",
      "content": "I’ve been there, and I’d say prepare yourself for small talk about the “real world” from the cubicle habitat. I’ve regretted giving too much of my personal story to new office-mates. You don’t want the the office scurge to know you share a hobby, or even worse - that you’re single!\n\nI try and point questions back at the questioner as much as possible, until you figure out the office politics. People love talking about themselves, so it’s not too hard. Then, you can pick your own confidants and mentors.\n\nOh, and please, don’t use kitten pictures on your desktop. Or drink the last drop of coffee without making new — I usually bring in a pound of my own overpriced-but-yummy gourmet blend on the second or third day and put a sticky “help yourself” on it.\n\nGood Luck!  \nAK\n\nPS Definitely the British version!\n\n"
    },
    {
      "time": " 4.Nov.2007 3.08pm",
      "content": "(at the risk of sounding like a human resources consultant, which I’m not...)\n\nBe open-minded and ask a lot of questions. Find out why things are done the way they are before suggesting improvements. (Once you’ve got the lay of the land, of course, use your fresh point of view and the tricks you’ve picked up as a solo artist to help make things more efficient.) Be specific in your communication with tech folks — they’re so used to vague information from designers and users that detailed, technologically aware feedback will make them your allies for life.\n\n"
    },
    {
      "time": " 4.Nov.2007 3.12pm",
      "content": "Be open-minded, that’s the best advice…\n\nAnd be yourself.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 4.Nov.2007 4.45pm",
      "content": "Everything Marc said.\n\nGood luck! :-)\n\n"
    },
    {
      "time": " 5.Nov.2007 6.27am",
      "content": "Bribing office workers with food never goes out of style. Buy lots of donuts.\n\n"
    },
    {
      "time": " 5.Nov.2007 9.27am",
      "content": "And chocolate. ;-)\n\n"
    }
  ]
}
