{
  "id": "38802",
  "title": "A high quality Arabic OpenType Font",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Arabic font for Holy Quran  \nA high quality OpenType Font for Holy Quran\n\nOctober 23, 2007: Pakistan Data Management Services is pleased to announce the release of an OpenType Font for writing Holy Quran text based on Unicode standard. The font features high quality glyphs and has support for all aeraabs/mark placements at proper places. All waqfs (special symbols) used for identifying different pauses in reading are also provided. ‘PDMS Saleem Quran Font’ provides advanced Arabic typography - close to calligraphy while retaining the beauty and legibility of Quran Majeed Arabic text.\n\nThis font enables desktop and internet publishing of Holy Quran using existing software supporting OTF specifications, e.g. Microsoft Word, Microsoft Publisher, Internet Explorer, etc. ‘PDMS Saleem Quran Font’ is available for free download from [www.pakdata.com/products/arabicfont](http://web.archive.org/web/20141031101356/http:/www.pakdata.com/products/arabicfont \"www.pakdata.com/products/arabicfont\").\n\nWe are confident that ‘PDMS Saleem Quran Font’ will appeal to all Arabic users, especially designers and publishers who will no longer be bound by the technological limitations of old Quran printing methods.\n\nAbout PDMS: Based in Karachi, Pakistan, PDMS is developing Urdu Software products since 1986. The nationally acclaimed ‘Nastaleeq Nizami’ – Urdu Desktop Publishing software has boosted tremendously the use of computers in Pakistan by making them write beautifully in Nastaleeq script of Urdu language. Other products include Urdu Computer Nizam, Ruqqa-UrduEmail, Urdu 98, Urdu Mahir, PDMS Jauhar, Quran Majeed CD. PDMS has also developed fonts for the regional languages like Sindhi and Pushto besides designing a number of Nastaleeq and Naskh fonts. PDMS is also constantly engaged in developing Internet website and portals and has designed a number of Urdu portals including UrduSeek.com, UrduNews.net, CityIslam.com. The area in which PDMS has technical expertise makes it a unique venture in Pakistan.\n\nPakistan Data Management Services  \n207 Fortune Center 45A Block 6 PECHS, Main Shahrah-e-Faisal, Karachi  \nPhone: 9221-4559003, 9221-4316328, 9221-7012038 Fax: 9221-4316258  \nEmail: [contact@pakdata.com](mailto:contact@pakdata.com) Website: [www.pakdata.com](http://web.archive.org/web/20141031101356/http:/www.pakdata.com/ \"www.pakdata.com\")\n\n ![](http://web.archive.org/web/20141031101356im_/http:/typophile.com/files/ArabicText_3427.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [QuranJuz1.pdf](http://web.archive.org/web/20141031101356/http:/typophile.com/files/QuranJuz1.pdf) | 155.66 KB |\n| [Hadith.pdf](http://web.archive.org/web/20141031101356/http:/typophile.com/files/Hadith.pdf) | 33.87 KB |\n\n",
  "author": "Arif",
  "time": "5 Nov 2007 — 3:15am",
  "uid": "22981",
  "comments": [
    {
      "time": "4 Apr 2008 — 10:27pm",
      "content": "i need nastaliq font urgently.\n\nThanks\n\n"
    },
    {
      "time": "14 Aug 2009 — 12:06pm",
      "content": "Assalamu Aliakum:\n\nCould you please give me access to download the Wholy Quran similar to QuranJuz1.pdf.\n\nWa-asslam  \nAli\n\n"
    }
  ]
}
