{
  "id": "38809",
  "title": "Looking for some info on \"Westminster\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI'm trying to learn more about the font called \"Westminster,\" which has been distributed with Windows since Windows 98. Essentially, it's one of many typefaces like Data 70, Orbit-B, and Moore Computer which create letters that mimic the numeric forms from the MICR font E-13B.\n\nAll of the information I can find on the web about Westminster appears to be based on the information Microsoft [provides](http://web.archive.org/web/20131106210923/http:/www.microsoft.com/typography/fonts/font.aspx?FID=208&FNAME=Westminster&FVER=1.01), but I have reason to be suspicious of the accuracy of what it claims.\n\nMainly, that paragraph seems to suggest that Westminster came first and the others followed. I doubt this because the arabic numerals in Westminster are quite different from E-13B. The article (facetiously) suggests that one might use Westminster's numbers if one owned a bank, but obviously this would not work. Moore Computer, on the other hand, _does_ include numerals more or less identical to E-13B and is generally more faithful to the form, so it seems logical in at least an aesthetic sense that Moore Computer is the first full alphabet based in MICR. (Incidentally, I'm [still looking](http://web.archive.org/web/20131106210923/http:/typophile.com/node/35550) to confirm some basic info about Moore Computer, so if you know anything, please post).\n\nSo basically, I'm just wondering if anyone knows anything about Westminster beyond what is in the Microsoft page. The fact that it doesn't actually name the designer also makes me suspicious, as does the fact that I haven't found any mentions of it that pre-date its release with Windows 98. Admittedly, I haven't performed an exhaustive search, but none of the dozen-or-so type encyclopedias, histories and specimen books I've consulted that should cover that period mention it at all.\n\nThanks,  \nZach\n\n",
  "author": "zachwhalen",
  "time": "5 Nov 2007 — 8:07am",
  "uid": "20063",
  "comments": [
    {
      "time": "5 Nov 2007 — 10:09am",
      "content": "More on [MICR fonts](http://web.archive.org/web/20131106210923/http:/typographica.org/000539.php).\n\n"
    },
    {
      "time": "25 Nov 2007 — 1:52pm",
      "content": "Hi again,\n\nSince I'm still looking for info on this Westminster, I thought I'd bump this thread with a more specific question. The paragraph of information from Microsoft fails to mention the designer by name, or even the bank the font is supposedly named after, but it does mention \"Photoscript\" as its producer. Google searches on \"photoscript\" turn up many hits which are clearly unrelated, so can someone please tell me (if you know) which Photoscript is being referred to in this context?\n\nIncidentally, I've got samples of Westminster in use as early as 1971, but still no mentions of it by name until the 90s.\n\nThanks in advance for any and all suggestions.\n\n"
    }
  ]
}
