{
  "id": "38810",
  "title": "Fontalicious.com Reclaimed!",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Around the middle of 2004 after a dispute with a local ISP, fontalicious.com went from being a popular independent font foundry to an error page. Eventually the domain was snapped up by no less than 3 owners over the subsequent years, all overseas and none with any intention to return the domain to Ben Balvanz, the creator of Fontalicious.\n\nFrom that time, the site became a series of landing pages for banner ads or link pages but by this time, Ben had indeed moved on and became deeply invovled in the creation of the wildy successful apparel company Fan Club Member under the Gobitron, Inc. umbrella. Many folks had thought something had happened to Ben and even more companies were looking to legally license works that there was no manner to contact the author as more and more of the massive Fontalicious library started showing up on free font sites . . .\n\nIn 2005 when the idea of Font Bros began, Fontalicious was among the first foundries my partner Mike and I approached and Ben was open to the idea of us beginning to retail his fonts again. At that time, we learned of the backstory about how the fontalicious.com domain ended up in limbo and began our efforts to try to track down the owner of the domain to try and accquire it again . . .\n\nAdditionally, as the demand for his library grew, he gained renewed interest in font creation and has been hard at work on releasing new typeface designs. But even with new designs, without the domain it would be left to Google to help folks find Ben and his work . . .\n\nIt turned out since Ben and his partner had the foresight to trademark the name Fontalicious back in 2001, we had a legal claim to the domain and could pursue working with ICANN to resolve the domain dispute but we didn't want to incurr the estimated $6k in legal fees to get to the point of arbitration.\n\nAt some point a while later, the domain was acquired by yet another party who like the previous ones had many domains but fortunately for us he took the domain to sedo.com a domestic domain broker and for the third time in 2 years we began a dialog to purchase the domain again. After a series of dialogs and excessive sales offers, the conversation stalled and so we began work with a domain broker at sedo.\n\nWe presented the trademark registration plus proof of the history of the domain and began the process of negociation again. The owner who didn't want any legal matters coming to his doorstep finally arrived at a fair price we all agreed on and after a few weeks of discussions, escrow transfers and name server updates, the Font Bros are proud to annouce fontalicious.com is back in the rightful hands of its owner and will be launching soon!\n\nBen is thrilled to have the domain under his control again and is working on the new website and even more amazing new fonts that made his type famous the world over.\n\nHead on over and sign up to be notified when the new Fontalicious.com is live again at [http://www.fontalicious.com](http://web.archive.org/web/20150123080024/http:/www.fontalicious.com/)\n\nWarmly,  \nMike & Stuart  \nThe Font Bros\n\n",
  "author": "Diner",
  "time": "5 Nov 2007 — 8:23am",
  "uid": "1226",
  "comments": [
    {
      "time": "5 Nov 2007 — 10:08am",
      "content": "Great news, fellas. I was sad when I had to change my [broken](http://web.archive.org/web/20150123080024/http:/typographica.org/000539.php) Fontalicious [links](http://web.archive.org/web/20150123080024/http:/typographica.org/000221.php) to dafont and the like.\n\n"
    },
    {
      "time": "5 Nov 2007 — 12:02pm",
      "content": "I've missed Fontalicious so much. It's good to hear it's coming back, and why it went away. I had no idea there was so much drama. Might be good enough to develop into a miniseries during the writers strike.\n\n"
    },
    {
      "time": "13 Nov 2007 — 6:27pm",
      "content": "HOW DO I RECOUNT THE WAYS! Ben is may favorite living cutsey designer in the world!!! I LOVE LOVE to infinity ALL his work!\n\nMikey :-)\n\n"
    },
    {
      "time": "18 Nov 2007 — 6:45pm",
      "content": "Stu:\n\nThanks--that was very kind of you.\n\nLuc\n\n"
    },
    {
      "time": "21 Nov 2007 — 8:59pm",
      "content": "You guys were Gods to us when we were 16 and designing rave flyers. Welcome back!\n\n"
    },
    {
      "time": "27 Nov 2007 — 7:47am",
      "content": "I didn't realize you were Twin Cities based. Nice.\n\n"
    },
    {
      "time": "27 Nov 2007 — 7:53am",
      "content": "Way to go, Stuart!\n\nChrisL\n\n"
    }
  ]
}
