{
  "id": "38841",
  "title": "starting a font type project",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello everyone,\n\nI am really glad to be part of this forum and I know I will learn a whole lot from everyone which is the major reason why I joined...to learn.\n\nI am new to making fonts and I’ll like you guyz to please forgive me if my questions are kinna frustrating...anyways...I’ll try to make them reasonable...\n\nI have some questions to ask and will be glad to read from somebody soon...\n\n1. As a font artiste how do I start a project (I mean how do I start designing a set of fonts and glyphs). I think there has to be some sketches on paper of alphabets/characters, numerals and glyphs before drawing begins on my computer.\n\nI know there are some pros In this forum, can you please share some beginning tips with me...\n\n2. I am still not clear on the differences between characters and glyphs...can someone please break it down for me.\n\n3. Let’s say I want to create an EPS file for a set of alphabets in Illustrator to be used in Fontlab (my preferred font-making and editing application), does this mean an eps file will be for an alphabet and 26 eps files for the 26 alphabets.\n\nIf yes, cant I have them in a single illustrator file.\n\nRegards,  \n’kk’\n\n [‹ Linda, Are you old enough to drink today?](http://web.archive.org/web/20080906231727/http:/www.typophile.com/node/38691 \"Go to previous forum topic\") [Another question... (Importance of ligatures in typeface for a (novel) book body) ›](http://web.archive.org/web/20080906231727/http:/www.typophile.com/node/38730 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906231727/http://www.typophile.com/user/23635\" title=\"View user profile.\">kk01</a>",
  "time": "<br>",
  "uid": "23635",
  "comments": [
    {
      "time": " 6.Nov.2007 1.07am",
      "content": "In simplest terms, a character is the smallest, basic piece of an alphabet: a letter. Glyphs are the various visible forms that letter can take.\n\nExample character: lowercase ’a’.  \nExample glyphs: lowercase ’a’, small cap ’a’, alternate/swash ’a’.\n\n ![](http://web.archive.org/web/20080906231727im_/http:/www.typophile.com/files/FinderScreenSnapz001_6491.jpg)\n\nSo: many glyphs can represent one character. Also, one glyph can contain more than one character, as in a ligature.\n\n"
    },
    {
      "time": " 6.Nov.2007 1.10am",
      "content": "Hello kk, welcome to the forum:)\n\nI don’t know anything about making fonts, but as a designer I can say sketching out your ideas and concepts is the first step (as it is with most projects).\n\nTo learn about characters and glyphs check out this [Wikipedia page](http://web.archive.org/web/20080906231727/http:/en.wikipedia.org/wiki/Typeface). You can learn a lot by just doing a Google search for your questions. This is how I taught myself to use Photoshop; I just searched for tutorials and articles on the program.\n\n"
    },
    {
      "time": " 6.Nov.2007 3.17am",
      "content": "mmph! thank you guyz...I’ll check the wiki page and see if I can find anything interesting...I guess I should...\n\n"
    }
  ]
}
