{
  "id": "38847",
  "title": "Logo for graphic design studio",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello:  \nThis could be the logo for a graphic design studio called tea for two. Our work is simple and clear; you can see some samples [here](http://web.archive.org/web/20081203184244/http:/www.tea-for-two.com/pruebas/anuncio.jpg)  \nThanks for your help.\n\n| Attachment | Size |\n| --- | --- |\n| [tft.jpg](http://web.archive.org/web/20081203184244/http:/typophile.com/files/tft.jpg) | 12.25 KB |\n\n [‹ Logo For My Gallery](http://web.archive.org/web/20081203184244/http:/www.typophile.com/node/40069 \"Go to previous forum topic\") [Logo for area youth event ›](http://web.archive.org/web/20081203184244/http:/www.typophile.com/node/38636 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203184244/http://www.typophile.com/user/23637\" title=\"View user profile.\">buen_vigia</a>",
  "time": "<br>",
  "uid": "23637",
  "comments": [
    {
      "time": " 6.Nov.2007 2.20pm",
      "content": "It seems to me that the spacing in the first 5 letters doesn’t match the spacing of the last 4. It reads like t-e-a-f-o-rt-wo\n\n"
    },
    {
      "time": " 7.Nov.2007 3.08am",
      "content": "I think Tiffany is dead on.\n\n"
    },
    {
      "time": " 7.Nov.2007 7.12pm",
      "content": "It’s heavy at the RT and the overlapping of the WO doesn’t fit.\n\n"
    },
    {
      "time": " 12.Nov.2007 2.29pm",
      "content": "it’s such a classic font, i think you can afford to split it up into the three words. i love the tea part. so can’t you then shift the “for” a bit right, and again with the “two” so that you still have the condensed look but you read it better, thus avoiding what tiffany said?\n\n"
    },
    {
      "time": " 15.Nov.2007 3.13am",
      "content": "Hi!  \nThank you all for your comments.  \nBetter now?\n\n ![](http://web.archive.org/web/20081203184244im_/http:/www.typophile.com/files/tft2_6703.jpg)\n\n"
    },
    {
      "time": " 15.Nov.2007 8.57am",
      "content": "Better, but the main problem remains: The letters in “tea” are merely touching each other, while the letters in “two” are actually melting with each other. To make things equal, “te” and “ea” have to at least touch each others on the upper part, and not just the lower part.\n\n"
    },
    {
      "time": " 27.Nov.2007 3.51am",
      "content": "I dont agree. the spacing is fine. look at the physical width of the words.\n\nto melt the ’tea’ would mean the logo would be off balanced (as ’tea’ would end up being alot shorter in length). However. I notice that the ’W’ in ’two’ seems to be dropping below the line level too far. thats not right.\n\nis this hand crafted text, cos I also notice that the ’e’ looks odd. If you look at where the cross stroke touches the left hand side, that left hand side isnt a smooth line, it indents slightly, thats not right, it should line up. maybe its rendering wrong on my screen?\n\n"
    },
    {
      "time": " 27.Nov.2007 9.49am",
      "content": "Thank you all for your comments!  \nFudog, some parts of the text are hand crafted. Something strange happened to the “e” but I’ve corrected it. Bodoni’s “w” is just as you see in my logo, but I think you are right too.  \nWhat do you all think about the “wo” in two? Do you think it looks good?  \nThanks for your support\n\n"
    },
    {
      "time": " 27.Nov.2007 8.09pm",
      "content": "I see it as trying a bit to hard, almost forcing the “wo” together. Try letting it breathe a bit maybe. It isn’t an original idea to meld glyphs together, creating “false” ligatures, so I would just give it some room.\n\n"
    },
    {
      "time": " 28.Nov.2007 2.51pm",
      "content": "I agree with Wesley. That “wo” is way too tight together. I guess it would work fine if the “o” touches the “w” at a higher spot. ( i don´t know if that would spoil the spacing, though)  \nI personally find very odd the “rt” ligature. Although in itself it looks very nice, I ´d rather see the horizontal cross in the t going straight to the left and the curve of the r getting under it, maybe it will end up looking similar to the “af” ligature which looks so natural to me.\n\n(Un saludo, buen vigia)\n\n"
    },
    {
      "time": " 16.Dec.2007 11.59am",
      "content": "Better now, I guess...Let me know\n\n ![](http://web.archive.org/web/20081203184244im_/http:/www.typophile.com/files/tft2_4573.jpg)\n\n"
    }
  ]
}
