{
  "id": "38859",
  "title": "ITC Franklin? (No, not \"ITC Franklin Gothic\")",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m not sure if this has been previously discussed here, but does anybody know the status of David Berlow’s crazy-super-expanded ITC Franklin family originally [referenced here](http://web.archive.org/web/20080905094605/http:/www.monotypeimaging.com/aboutus/pr_display.aspx?year=2004&pr=229) back in 2004?\n\n [‹ What heights would you go to for good letter spacing?](http://web.archive.org/web/20080905094605/http:/www.typophile.com/node/38931 \"Go to previous forum topic\") [Information design: who is responsible when it fails? ›](http://web.archive.org/web/20080905094605/http:/www.typophile.com/node/38740 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905094605/http://www.typophile.com/user/1995\" title=\"View user profile.\">Eric Gordon</a>",
  "time": "<br>",
  "uid": "1995",
  "comments": [
    {
      "time": " 6.Nov.2007 11.25am",
      "content": "Interesting. But I don’t know why one would want another Franklin (overused), when you can have his [Titling Gothic](http://web.archive.org/web/20080905094605/http:/www.fontshop.com/search/?q=Titling+Gothic) or [Bureau Grot](http://web.archive.org/web/20080905094605/http:/www.fontshop.com/search/?q=Bureau+Grot).\n\n"
    },
    {
      "time": " 6.Nov.2007 1.55pm",
      "content": "I dunno, Stewf — New York magazine used ITC Franklin Gothic for the coverlines and feature heds of its recent design issue (10/29/07) and it looked oddly fresh. It made for a crisp counterpoint to the rounded grot they use in the rest of the book (Elderkin?), and looked nice paired with Miller Display/Text.\n\n"
    },
    {
      "time": " 6.Nov.2007 1.59pm",
      "content": "FYI, there’s a showing of ITC Franklin on p.58 of the David Berlow commemorative type specimen booklet that Font Bureau passed out at TypeCon. It lists 2007 as the release date.\n\nJust call or e-mail the nice folks at FB; they’ll give you the low-down.\n\n"
    },
    {
      "time": " 6.Nov.2007 1.59pm",
      "content": "Franklin might have been overused at one point (I’m guilty myself), but after having a chance to look under the hood I have to say that I am interested all over again.\n\n"
    },
    {
      "time": " 6.Nov.2007 2.34pm",
      "content": "Hmm. I’ll take a look at that, Marc. And I forgot Font Bureau’s other mega-grot, [Benton Sans](http://web.archive.org/web/20080905094605/http:/www.fontshop.com/fontfeed/archives/benton-sans-for-pangea-day/).\n\n"
    },
    {
      "time": " 6.Nov.2007 2.51pm",
      "content": "Thanks for the alternate suggestions, Stephen. I’m a big fan of all of ’em. I don’t really have a need for ITC Franklin, though—it was just one of those “I wonder whatever happened to...?” things. Lost in the mists of time? Fell victim to legal wrangling? M. F. Benton cursed the project from beyond the grave?\n\n"
    },
    {
      "time": " 6.Nov.2007 9.08pm",
      "content": "“Lost in the mists of time?”  \nDo you have any idea how much actual mist is required to lose a typeface?  \n” Fell victim to legal wrangling?”  \nnooooo. Sorry to undersensationalize.  \n“M. F. Benton cursed the project from beyond the grave?”  \nHe’d have to be dead to do that, now wouldn’t he?\n\nCheers!\n\n"
    },
    {
      "time": " 6.Nov.2007 9.37pm",
      "content": "I won’t be done with Franklin Gothic until I have one where the spur on the G curls to nest the o like the letterpress version I used at Typecon.\n\n"
    },
    {
      "time": " 8.Nov.2007 10.22am",
      "content": "Thanks again for the info and well-deserved wise-cracks. Sam Berlow was nice enough to shoot me an e-mail with a PDF specimen, telling me it will be released ’shortly.’\n\n"
    }
  ]
}
