{
  "id": "38885",
  "title": "Romain du Roi samples",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hrant H Papazian does an \"offer\" in [http://typophile.com/node/7177](http://web.archive.org/web/20121128034450/http:/typophile.com/node/7177) that i'm interested.  \nI'm doing some readings about Romain du Roi and would love to have that image that Hrant H Papazian has in Javal book (600).  \nAny other Romain du Roi samples are welcome.\n\nThanks  \nAntónio Fonseca\n\n",
  "author": "afonseca1974",
  "time": "7 Nov 2007 — 5:56am",
  "uid": "22399",
  "comments": [
    {
      "time": "7 Nov 2007 — 7:05am",
      "content": "you can buy this book: \"La réforme de la typographie royale sous louis XIV\" by Andre Jammes\n\nand this one: \"Le Romain du Roi la typographie au service de l'état, 1702-2002\" publish by le Musée de l'imprimerie de Lyon\n\nand some realy short informations on [www.bpfoundry.com](http://web.archive.org/web/20121128034450/http:/www.bpfoundry.com/ \"www.bpfoundry.com\") --\\> Romain BP --\\> font info\n\n"
    },
    {
      "time": "3 Dec 2007 — 10:50am",
      "content": "\"Le Romain du Roi – la typographie au service de l'état, 1702-2002\" mentioned above is the catalogue of the exhibition held at the Musée de l'Imprimerie in Lyon in 2002. In this excellent publication – which can be ordered from the Musée – you will find a very useful piece written by James Mosley plus some very good photos of punches, moulds etc., and the engraved prints of the original designs for the Romain du Roi. There are also some useful illustrations of specimens from the Imprimerie Royale.\n\n"
    },
    {
      "time": "3 Dec 2007 — 10:57am",
      "content": "A paperback collecting much of Tory’s drawings and writing about the Romain Du Roi was available when I was in France back in 2005 for around 20 Euros. Unfortunately I was being stupid, didn’t buy it, and I can never remember what name it was published under so I can’t order a copy. But if you know anyone in France perhaps they’ll be so kind as to track it down.\n\n"
    },
    {
      "time": "4 Dec 2007 — 3:31pm",
      "content": "James, you must be thinking of Tory's Champ Fleury? It's got letters on grids too, but that was 150 years before the Romain du Roi. Great reading though, if you can read 16th-c. French printed with medieval abbreviations. If you'd rather not, [here is an English translation](http://web.archive.org/web/20121128034450/http:/www.allbookstores.com/book/9781891788864/Bruce_Rogers/Champ_Fleury.html).\n\n"
    },
    {
      "time": "4 Dec 2007 — 3:44pm",
      "content": "You’re right, Mark. All these type names get lost in my screwy brain.\n\n"
    },
    {
      "time": "4 Dec 2007 — 6:44pm",
      "content": "\\> <cite>Great reading though, if you can read 16th-c. French printed with medieval abbreviations.</cite>\n\nAnd if you want to look at BNF's (Bibliothèque Nationale de France) Gallica digitization of Champ Fleury in 16th-c. French (175 pages, 15.5Mb), [**here**](http://web.archive.org/web/20121128034450/http:/www.typogabor.com/Media/CHAMP_FLEURY.pdf) it is. The link comes from [**this page**](http://web.archive.org/web/20121128034450/http:/paris.blog.lemonde.fr/2007/06/28/champ-fleury-par-geofroy-tory-numerisation-catastrophe-de-la-bnf/) of [**Peter Gabor's blog**](http://web.archive.org/web/20121128034450/http:/paris.blog.lemonde.fr/a-propos/).\n\nMichel\n\n[edit] On Gallica you get it [**here**](http://web.archive.org/web/20121128034450/http:/gallica.bnf.fr/ark:/12148/bpt6k50961p).\n\n"
    }
  ]
}
