{
  "id": "38897",
  "title": "Italic Antique Clarendon, a first attempt",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello everyone,\n\nI am a final year student studying in the UK. Last month I attended the Plus Type Conference in Birmingham. I listened to a fascinating lecture about the Grotesque Italian by an American lecturer David Sheilds, from the University of Texas.\n\nA few days later I read up on American wood type generally, and was really inspired, in particular by some of the Antique Clarendon's shown within. I decided to try and recreate my own version digitally, as an italic.\n\nHere is my work so far. I have only created uppercase and numerals so far and would much appreciate any form of critique.\n\nThanks a lot\n\nJonny\n\n| Attachment | Size |\n| --- | --- |\n| [Italic Antique Clarendon Preview.pdf](http://web.archive.org/web/20150416142043/http:/typophile.com/files/Italic%20Antique%20Clarendon%20Preview_0.pdf) | 205.49 KB |\n\n",
  "author": "number7",
  "time": "7 Nov 2007 — 2:14pm",
  "uid": "23121",
  "comments": [
    {
      "time": "7 Nov 2007 — 3:22pm",
      "content": "Ok, I'll try to retype what got lost the last time, so I will be short. It might sound harsh because of that, I don't mean it to be. :)\n\nA - The weight is on the wrong leg, it should be on the right one.  \nB/D - Bowls are a bit too light compared to the stem.  \nF - If you lower the crossbar on the F, it will optically fill up the large negative space. Don't apply this to the E.  \nJ - Looks a bit weird, lower part too light.  \nK - Weight reversed, upper arm should be the lightest, lower arm heaviest.  \nP - I would slightly increase the bowl. See B/D.  \nS - Place the weight more on the spine. Said spine is also too horizontal I think.  \nT - Might be a bit too wide.  \nV/W - Apex too far to the right. Shift the apex more to the left.  \n7 - Same as V/W, the stem is too 'straight', the bottom of it should be shifted more to the left.  \n8/9 - Are rolling over optically (both to the right).\n\nAs for the rolling, that is because the level of slant is not consistent throughout the design. Maybe it is, but optically it isn't. :)\n\n"
    },
    {
      "time": "8 Nov 2007 — 6:49am",
      "content": "The serifs don't match the serifs on Clarendon — they're not slabbed enough, and the brackets are too big. Also, Clarendon has greater thick/thin contrast, which I think is one of its defining characteristics. Take a look at [Ziggurat](http://web.archive.org/web/20150416142043/http:/typography.com/fonts/font_overview.php?productLineID=100028) for some cues. It's a slab serif with a nice italic, but without the brackets connecting the stems to the serifs like Clarendon has. You should try modulating the strokes a bit.\n\nI think this can be a very interesting project, just hang in there. There's a lot of potential for a very interesting and useful typeface here.\n\n"
    },
    {
      "time": "8 Nov 2007 — 8:33am",
      "content": "I am definatly going to spend more time on the weight distribution of the strokes, and also look at increasing the contrast of the thick and thin strokes.\n\nThe font is on the backburner for the moment while I work on some other projects but I will be picking it up again in the next month or so. Once I have updated it I will post it again.\n\nZiggurat is fantastic! Thanks for the link\n\nThanks a lot Quincunx and BradB\n\nJonny\n\n"
    }
  ]
}
