{
  "id": "38902",
  "title": "Matt laminate or Gloss for colour brightness and contrast?",
  "forum": "Design",
  "tags": [

  ],
  "content": "G’day folks,\n\nFashion aside, what do you think is the best finish for getting the best brightness and contrast between colours? I’m working on a kid’s book with a mostly black cover with lines picked out in red and white; I want the black to be as black as death and the red to be as bright as oxgenated blood (currently I’m using PMS 032). I’ve only ever used matt laminates up to now and would appreciate a ’ruling’ from the court.\n\nFor your general info: the file is in 3 colour with a 30% cyan screen laid down first then the pantone red bits and then process black to overprint the Cyan.\n\nI’ll try and post an image of a detail of the cover ... Wow, that never seems to work, OK so here’s a [link](http://web.archive.org/web/20071113005708/http:/home.iprimus.com.au/nkgross/SBcover_test.png) to it\n\ncheers\n\n [‹ Road Signage Dissertation-Please Help](http://web.archive.org/web/20071113005708/http:/www.typophile.com/node/38445 \"Go to previous forum topic\") [LOOKING FOR SIMILAR NOSTALGIC FONTS. please help ›](http://web.archive.org/web/20071113005708/http:/www.typophile.com/node/38965 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071113005708/http://www.typophile.com/user/9500\" title=\"View user profile.\">nicholasgross</a>",
  "time": "<br>",
  "uid": "9500",
  "comments": [
    {
      "time": " 7.Nov.2007 6.01pm",
      "content": "The gloss will dark up the black, but the glare will eliminate contrast under certain lighting.\n\n"
    },
    {
      "time": " 7.Nov.2007 7.13pm",
      "content": "What effect do you reckon it will have on the red, when compared with the matt?\n\n"
    },
    {
      "time": " 7.Nov.2007 7.19pm",
      "content": "It will probably look a bit more saturated. If you are going all PMS, look at the different blacks offered—that could really make the difference. So maybe drop the screen mixes and just use the PMS colors for the best look.\n\n"
    },
    {
      "time": " 7.Nov.2007 7.47pm",
      "content": "Can you do a spot varnish on the red? I find matte lam makes a richer, denser black without the glare. But if you can pick up the red or white with a spot gloss that would look cool.\n\n"
    },
    {
      "time": " 7.Nov.2007 9.51pm",
      "content": "Hi Patty,\n\nIt sounds like a continuation of a similar conversation we had recently ;) once again, as with most of the stuff I do, it’s a question of budget. I had the same idea and it would definately look awesome I agree but unfortunately ... money is the issue. I am waiting earnestly for the time I can do spot varnishing :)\n\nJames, I thought that if i dropped the screens I’ll be left with a gray or brown black or do you reckon it’s a goer? Do you reckon a Pantone black would be as dark as a rich black?\n\nthanks guys\n\n"
    },
    {
      "time": " 8.Nov.2007 3.43am",
      "content": "Rather than running process for the black consider a double bump of Black 6, or another black if you want a warm tint.\n\n"
    },
    {
      "time": " 8.Nov.2007 7.02am",
      "content": "If it’s the cover of a kids book, you want it to be as durable as possible, so laminated would seem the way to go there. If you can do the colors with a varnish then all the better.\n\n"
    },
    {
      "time": " 8.Nov.2007 7.28am",
      "content": "who the heck is Matt Laminate?\n\n"
    },
    {
      "time": " 8.Nov.2007 9.47am",
      "content": "\\> who the heck is Matt Laminate?\n\nHe is currently dating Dot Gain.\n\n"
    },
    {
      "time": " 8.Nov.2007 10.38am",
      "content": "Who finally dumped that loser Gutter Creep.\n\n"
    },
    {
      "time": " 8.Nov.2007 10.56am",
      "content": "Uncoated stock with red thermography to raise the type and give it a bit of sheen.\n\n"
    },
    {
      "time": " 8.Nov.2007 11.34am",
      "content": "_the file is in 3 colour with a 30% cyan screen laid down first then the pantone red bits and then process black to overprint the Cyan._\n\nNicholas, that’s the way I would produce the artwork as well (though I like 20% cyan; never tried 30%). Without going to 2 hits of a Pantone, your technique yields nice blacks.\n\nLaminating offers the best protection to inks but will obscure any varnish effects, so even if you had the budget for extra varnish, the lamination would kill it.\n\nI’ve used both gloss and matte laminates. I prefer matte myself, but I think gloss would give you more satisfaction on this job.\n\nGood luck. Let us know how it turns out.\n\n"
    },
    {
      "time": " 8.Nov.2007 2.45pm",
      "content": "Sorry I didn’t explain:\n\nMat (one ’t’) Laminate is an underground electroclash producer from France currently doing a collaboration with DJ PMS 5 using persian breakbeats and microsamples of London bus engine noises to produce a soundtrack to the new Ewan McGregor and Kate Winslet musical about the life of Ralph Macchio.\n\nI hope that’s cleared things up, sorry for the confusion.\n\nThanks guys for all the help, Ken for the reassurance ;) Nick, just to clarify you would do a black pass then the red thermography and then no laminate at all?\n\n"
    },
    {
      "time": " 8.Nov.2007 3.32pm",
      "content": "I’ve decided to stick with the matt Laminate, it’s the devil I know —\\> and I just think glossy things nowadays have a tendency to sometimes look a bit cheap. As far as spot varnising and thermography go, these are good to keep in mind for when I get a job with a bit more lattitude and budget\n\nthanks again, I’l try and remember to post a shot of the finished art for the sake of completion and to satisfy whatever waning interest you’ll still have at that tme ;)\n\n"
    },
    {
      "time": " 8.Nov.2007 9.17pm",
      "content": "Yes, thermography is a bit plastic and tacky (compared to engraving), but it’s thick and shiny and would be OK with your loosely rendered big type, and stand out well against an uncoated stock.\n\n"
    },
    {
      "time": " 9.Nov.2007 5.29am",
      "content": "As Ken mentions, laminating can kill a varnish. Obviously, the varnish needs to run after the lam.\n\nWhen I’ve mixed gloss and matte on a cover before, I’ve found that it often works better to do a gloss lam and then hit it with a matte varnish to kill the sheen except in the areas where you want the sparkle. Not just picking out a matte spot; even when matte is most of the cover.\n\nI’ve also had bad experiences with certain matte laminations that really shift color — bad red shift, more than can be adequately compensated on press beforehand. Sometimes, gloss lam plus flood matte varnish worked better for color fidelity.\n\nI’ve done a few matte lams with a spot gloss varnish. Doesn’t really give you full gloss, obviously. Depends upon whether you’re picking out type or images.\n\nAnd this may also be completely in my imagination: but it seems to me that matte lams are more susceptible to curl. But it can really depend upon the lamination — not all plastics are created equal. Which printer/manufacturer can make a difference.\n\nI always consult with my production manager (and I let her work out the budget ;-)\n\n— K.\n\n"
    },
    {
      "time": " 9.Nov.2007 6.34am",
      "content": "Matt laminate on the black with a glossy red foil block.\n\nTim\n\n"
    },
    {
      "time": " 10.Nov.2007 4.57pm",
      "content": "I’ve used PMS 458c on 412c [on a poetrybook](http://web.archive.org/web/20071113005708/http:/www.flickr.com/photo_zoom.gne?id=1323739729&context=set-72157601601800359&size=o) quite a while ago, and it worked like a charm. (The colors on that link are quite accurate, although the red looks more fluorescent in reality). The brown (412c) is matt laminated and the red is spot varnished gloss. I think red 458c will probably be even more bright on an even darker background.\n\nJust wanted to share my experience whith such a color contrast, not trying to plug. ;)\n\n"
    }
  ]
}
