{
  "id": "38908",
  "title": "Seeking expert help for my typographic sanity",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Long-time listener, first-time caller, so to speak. However I am thankful for the opportunity to seek assistance and/or information, etc., from such brilliant, creative people.\n\nMy dilemma is relatively simple overall but multi-pronged. In other words, I lack quality answers for three straight-forward but - to me at least - rather perplexing questions. If these questions sound elementary, hopefully people here will still take the time to force a smile and shake the rattle for this Typophile infant. I will spare the history leading up to my being faced with these issues, and yes it likely is as moronic as many might suspect. And no, I didn’t conduct a search before posing these questions given their unique nature.\n\nOK, Issue 1: Recently - on this very site I believe - I was reading a post in which the author asked how any why certain fonts appear “soft” on the screen. This rang a bell with me because I often have wondered the same thing, even if not in the same context. For example, on my monitor the typeface “Brown” looks magnificent in part because it has that soft or quasi-fuzzy appearance that actually makes it easier on my eyes. By comparison, a somewhat similar font, perhaps in the vein of Helvetica, looks very clean but just isn’t pleasing to view.\n\nI realize those were poor examples since “Brown” has lots of neat, subtle features that make it visually appealing. However in the past few weeks I’ve discovered something very important: When I view a typeface for the first time, 99 times out of 100 it has that almost-too-sharp appearance. Yet, if I run it through Fontographer and remove all hints, invariably that font takes on the same nice, soft appearance on the screen described above. While this discovery was personally significant, it presents far more difficult questions, one far more than others: In the opinion of the truly accomplished here, just how important is hinting to the every-day sans typeface used in a web browser, etc.? Common sense tells me it must be somewhat crucial since so much time, conversation and technology has been dedicated to “hinting.” But to me for some reason, unhinted fonts almost always are more visually pleasing. Given that I am about halfway through creating my second typeface, this obviously poses a problem. Thoughts?\n\nIssue 2: I was fortunate to spend more than a decade making a living doing exactly what I always wanted to do and there is no greater fortune in the world than that short of familial health and happiness in my opinion. Even when I felt crushed under the perpetual disaster that was my former employer’s publication, I still felt fortunate and never once dreaded going to work.\n\nThat said, I assume most everyone here making a living in digital typography does so for the love of it and therefore can relate to the previous paragraph. In my little corner of the world, when you love something - be it music, sports, art, typography - you long to share it with everyone and try to get others to love it too. And even if they are the absolute worst at what you love, that person’s interest and willingness alone can be enough to set a person’s heart afire - much like it must be for teachers when a student thrives under his or her guidance.\n\nWhich leads to my quandary: for people who should with passion love the art and science of typography, there sure are more than one or two really snotty people here who would seemingly rather cross the street to bitch slap someone than stand still and encourage those standing right next to him or her. The question, then, is why are there snotty people here when nearly EVERYONE should feel nothing but immense fortune to make a living doing what they love? Or even having a chance to do so? Maybe it is just me, but for goodness sakes at times the venom flying around here is unbelievable. Am I hyper-sensitive or is that really a gigantic mud puddle into which I probably shouldn’t jump?\n\nAnd finally: I have spent hours upon hours for the past three years consuming everything typography-related ... except for that latex stuff. Anyway, one of the things I encountered has totally confounded me and I need some light to guide me out of this tunnel.\n\nSpeaking strictly in terms of numbers, during my three years of research I’ve noticed the designer of the Fedra type families seems to have invested untold numbers of hours of work - for years - trying to make this single typographic entity perfect both artistically and comprehensively. In my own uneducated, infantile inner voice I often think to myself, “what else possibly could be done to extend or improve this font? Soon it will include Ebonic accents/characters and play a little rap song on your computer when you insert a ’special character.’” Then came Greta, which is terrific but still in plain Internet sight is only a couple of fonts in what, six or seven years?\n\nMeanwhile, somehow Ray Larabie/Typodermic manages to crank out what seems like three or four new fonts every other week! Obviously there are two very different things going on here. Is Mr. Larabie the world’s most prolific technical genius that can analogically play Mozart with his eyes closed in FontLab and on a keyboard? In direct contrast, that same inner voice keeps saying “Dude, slow down a little bit will ya?” It’s almost like there’s a Typodermic Death Star hoping to take over the font world by sheer numbers.\n\nThough certainly there isn’t an actual “wrong” taking place, what do people here - perhaps even those referred to above - think about these drastically different timetables? Yes, I understand the likelihood some designers are bound by peripheral obligations and just can’t get back to the ol’ board as much as they want, while others may do nothing but generate typefaces. Still, even with that factored in, these seem to be extreme cases (perhaps there are better examples of designers releasing typefaces once every equinox). I am not asking anyone to trash this person’s or that person’s MO, talent, dedication, etc., but I am wondering if anyone has more broadly-stroked, generic opinions on this. Can someone make a good font in a week? Or to be a truly admired, elite typeface, does it require years of work?\n\nI appreciate those who’ve suffered this long and might still have a pulse after reading the above, and really will appreciate those who take the time to offer their observations.\n\nThank you.\n\n [‹ OpenType “Com” ?](http://web.archive.org/web/20081012182007/http:/www.typophile.com/node/39011 \"Go to previous forum topic\") [Ultimate Santana? ›](http://web.archive.org/web/20081012182007/http:/www.typophile.com/node/39001 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012182007/http://www.typophile.com/user/15771\" title=\"View user profile.\">Curioustype</a>",
  "time": "<br>",
  "uid": "15771",
  "comments": [
    {
      "time": " 7.Nov.2007 6.01pm",
      "content": "On the subject of your Fedra (Peter Bil’ak) and Typodermic question,  \nI will probably state the obvious, but nevertheless;\n\nFedra is a very, very large text tailored typeface, where Typodermic mainly designs/sells display-type. Typefaces for text-purposes demand a high level of sophistication and attention for detail to be able to be used at textsizes, and thus take (_most of the times_) far more time to design and build than (most) display typefaces.\n\nAlso, an extensive typeface like Fedra in OpenType for example, can contain thousands of characters to be able to set bodytext in as most languages as possible. But usually also smallcaps, alternates, ordinals, fractions, ligatures, lining- and oldstyle-figures (sometimes both as Tabular and Proportional), superscript, etc. These options also need to be programmed for OpenType, which is also another part of the design process.\n\nSo for a large part it’s about what the designer has set out to accomplish.\n\n"
    },
    {
      "time": " 7.Nov.2007 7.18pm",
      "content": "Thanks for those observations. I kinda picked Fedra out of the air for brevity’s sake rather than perfect illustration. I admire the ambition and dedication necessary to produce such a large amagalmation of function and art, and have been disappointed not by its continuing expansion but rather by the fact I am extremely anxious to see Mr. Bil’ak’s next sans typeface.Whatever the case, I think I approached this particular issue incorrectly. Let me try from a different angle.\n\nIn your post you mentioned the tremendous amount of work put into the various Fedra families - including the display version - which to me is awe-inspiring. If I read your post correctly, however, part of the reason for such disparities in output could be that Ray Larabie creates a lot of display faces, which require less overall effort/time (though immediately coming to mind right now is the amount of work and time put into the Beorcana typeface. However, your point of course is accurate.).\n\nWhat I wonder is, could this disparity - and for that matter any disparities between two designers in production rate - be rooted in something much less technical, and perhaps much more prevalent than anyone might expect?\n\nMy point: I believe the quality of a typeface owes at least some small part to a designer’s expertise and instinct just in operating a computer. Or in understanding the overall concept of how computers work and putting that knowledge to work while using Fontographer, FontLab, etc. I cannot then help but wonder how many times the copy and paste functions are used when successful Designer A is creating a typeface. Given the seconds in which these functions can be employed, taking years to produce a technically superior, attractive typeface - for text, display, or otherwise - seems inconceivable. For that matter, hypothetically speaking, a designer could all but create a solid, geometrically sound skeleton of an entire font in only a few hours just by using the copy and paste function.\n\nI also wonder how many designers - if any - release a font for sale after doing nothing more than selecting the “autohint” option in Fontlab, or auto-kern option in Fontographer? Certainly those kinds of options in font-creating programs were included to be used, but by whom? Are the top tier of designers using these options, or were they included for what in golf vernacular would be use by a typographic hacker having fun with a unique hobby?\n\nIf someone were to ask me to guess how many income-generating designers were using these or other similar program options, I’d probably answer “British Columbia” and be just as confident in its correctness as anything . . . however if a gun was involved I suppose I’d probably say “zero.” Another question this raises: is there anything really wrong with using all of these functions/options? If you answered no, I cannot imagine you then being able to comprehend a font taking years to produce.\n\nI ask these things because I honestly don’t know the answers. To this day I’m just a guy in Florida with a fever for this stuff but still trying to put many things in their place. For reference’s sake, the one font I have somewhat completed - or got completely sick of looking at - is called “Myndraine” and is free at dafont. I strongly considered the far more applicable name “Crappy Sans,” but decided against it. It took me approximately two months to produce what was submitted to the site, with more than a few baseball games, History channel and UFC Fight Nights mixed in and battling for my attention. Trouble is, I spent the entire second of those two months making the font worse. When I said “sanity,” I weren’t kidding.\n\n"
    },
    {
      "time": " 7.Nov.2007 7.32pm",
      "content": "1: People generally value crispness onscreen rather than the soft appearance. So your taste differs from that tendency.\n\n2: There are people here from every age group, country, economic background, and stripe of being you can imagine. Add to that: type is a subject that inspires passion but does not necessarily bring wealth. so there is a small community and some people in it are defensive, overzealous, underemployed, or perhaps frustrated, by their own situation, or possibly someone else’s. There could be a million reasons for the attitudes and personalities presented here. I tend to agree; the level of bile gets unnecessarily toxic sometimes. It’s not necessary, since type is one of those things most of the world can safely ignore forever, but again with the passion....\n\n3: Same variance between visitors: some have all the time in the world, some have very demanding jobs. There’s a variance too in how speedy people are in developing their types. And each design has it’s own demands; one-style display types take a fraction of the time a 48-member text/display family takes. Autotraced? Cut the time in half!\n\nThere’s experience level; the last large family I released overall took a long time to finish; but I started when I was a student, and learned a lot on the way; doing it again, it would take me much less time. It also depends how people define their work as finished; some people are frankly sloppy and do not have good digital hygiene, others obsessively tweak beyond the point when it makes a difference. And there’s the matter of originality. Whether it’s an honorable, faithful revival or a cheap knock-off, with revivals, many design decisions have been addressed before the design gets digitized. Some new designs need a lot of preliminary gestating to clarify their ’thesis’ or feel. Sometimes there’s a customer tapping their fingers, looking at their watch, and ready to write a big check if the work is delivered on time. That can motivate you! Retail type design is speculative; if other, paying work is waiting, you might put off terrific or easy retail designs for years in favor of paying the bills.\n\nCombine all these variables, and you can see there will be a huge range in the time it takes to finish a design. I know type designers who marvel at how their quickest, throwaway designs are the big sellers, and the fussed-over, long-gestating ones don’t get that attention. That has to do with their intrinsic appeal and usefulness, which is not really under the control of the designer.\n\nYes, you can make a font in a week. You can make a font in a day. Depends....\n\n"
    },
    {
      "time": " 7.Nov.2007 7.48pm",
      "content": "Too many words. You need to learn to be more concise.\n\n"
    },
    {
      "time": " 7.Nov.2007 8.16pm",
      "content": "See, that’s just what I mean.\n\nMs. Pattyfab, I easily could be more concise but then I’d be catering more toward your preferences than benefitting from the purging effect being far less concise brought me. Since the former seems to be something you not only find acceptable but apparently expect, there’s a really good chance you will accommodate my preferences and no longer presume to be able to tell me what I need to do or not do.\n\nOr, more concisely, save the tough-girl, opinion-fueled strong-arm tactics for someone else because I fail to see the charm in them.\n\nThank you, though, for the warm-hearted welcome to this forum. I think we’ll be fast friends for sure.\n\n"
    },
    {
      "time": " 7.Nov.2007 8.21pm",
      "content": "Thanks for such an informative answer. It helps me transition perfectly into a more esoteric question:\n\nAbove, you brought up two very intriguing issues. One was your comment “It also depends how people define their work as finished.” Wouldn’t an ability to also know WHEN to define their work as finished be just as important, provided there was no preset deadline? I would be interested to know one thing from you specifically ... how different was Beorcana one year before it was labeled “finished” than it was the day it officially was “released?” Was it so different that an ordinary layperson could successfully have identified half the differences? All of them? Any of them? In truth it doesn’t really matter because your final product was and is stunning. It’s almost too pretty to use, you know ... kind of like the fine china you just display in a case and look at. Whatever tangible returns you get from that typeface will never be enough because when I think of or refer to the upper tier of designs, that font immediately comes to mind. And speaking of production output, if I was in your position I’d be terrified to begin my next typeface and would give a lot of thought to making that my lone legacy. For at least 5-10 years. So were there or will there be any feelings of fear?\n\nAlas, though, you are certainly correct in that there are countless situations that can directly affect the amount of time it takes to build a typeface.\n\nAlso above you wrote that some designers were “defensive, overzealous, underemployed, or perhaps frustrated, by their own situation, or possibly someone else’s.” First I can’t help but believe that eliminating the first two of those probably would help ease or even reverse a lack of sufficient employment or that level of frustration, but more than that, each of those things can slowly but definitively tear down one’s love for the very thing causing those previously mentioned conditions. It just seems like I’ve run across a few people who have forgotten the concept of typography is and always will be much bigger than they are, and I for one honestly thank God for introducing something to my life into which I can gleefully and energetically sink my teeth. I’m still in the believing in Santa Claus stage and it’s a downer to see some of the arrogance and/or blatant disparagement that can go on here. There is of course a foolproof cure for anyone with such a jaded, cynical view of their former love: just take it all away from them for a good while.\n\nYour response was quite thoughtful and very much appreciated.\n\n"
    },
    {
      "time": " 7.Nov.2007 11.12pm",
      "content": "1. Brown is not hinted for stem widths, but it does have alignment zones. There is some leeway for how much hinting is put into a font, and I try and do what’s best for a particular typeface. I find that severely hinted fonts can look awkwardly distorted, and change their personality drastically depending on their screen size.\n\n2. There are occasionally personal issues here, but many people have commented that Typophile is generally pretty polite for an online forum. Remember, it’s easy to feel dissed in some circumstances where no insult was intended, and where the poster would probably change their mind and express themselves more considerately, but it’s the Internet, and it’s not like you can decide not to mail the letter once it’s in the envelope. The button has been pushed. People get upset about the strangest things, and if you post frequently you’ll be on both ends of that stick. It’s not a big deal.\n\n3. I couldn’t put it any better than Carl.\n\n"
    },
    {
      "time": " 7.Nov.2007 11.22pm",
      "content": "_I easily could be more concise but then I’d be catering more toward your preferences_\n\nMr. Miller, being concise has nothing to do with catering to this or that individual’s preferences and everything to do with being thoughtful towards your readers — in this case, the members of this forum, whose assistance you are seeking. As already hinted at in one of the replies, not everyone here has tons of free time to spend on, say, reading Typophile posts. It benefits everyone to keep things short and to the point.\n\n"
    },
    {
      "time": " 8.Nov.2007 1.01am",
      "content": "Thank you Mr. Shinn for your insight. Brown is a great type family and it is interesting to hear some background on it.\n\nAs for Mr. Cordoba and the post immediately previous to this one, I can only say this:\n\n1.) The assistance I was seeking from the members of this forum is on the subject of typography and not how to write a reader-friendly post.\n\n2.) I would neither expect nor advise anyone with some valuable and rare free time to sit and read every word of my previous posts. Fortunately for me I have been provided a few well-considered and thought-provoking responses, even without being so concise.\n\n3.) I find it both telling and interesting that the two people who did take the time to provide their insight also are among the best and most respected designers around. I value that a great deal. Being told what I “need to learn” by someone I’ve never heard of is not what I’d define as “assistance” in this arena. Worse still, I was told I “need” to do something I already know how to do. Perhaps those who would prefer not to read such lengthy posts need to learn how to just ignore them.\n\n4.) I am not sure how it benefits “everyone” to keep posts short and to the point. At least not every time, all the time. I took a chance that maybe one or two people would take the time to read the posts and provide thoughtful answers, and that’s what happened.\n\n5.) I suppose you could define all of this as a “discussion” rather than a straight-forward Q and A, of which I am quite capable when I want to know the time or how the weather is outside. Exchanging experiences and developing greater self-awareness is healthy and certainly capable of benefitting one or two people.\n\nI don’t mean to sound curt, but being told in essence what I need to do or say, or how to say it, flies directly in the face of one of the most fundamental rights I hope every member of this forum enjoys, speech. This all seems like pretty routine stuff to me, but I could be wrong.\n\n"
    },
    {
      "time": " 8.Nov.2007 6.47am",
      "content": "“I don’t mean to sound curt, but being told in essence what I need to do or say, or how to say it, flies directly in the face of one of the most fundamental rights I hope every member of this forum enjoys, speech”\n\nYes of course. One of the main advantages of text over speech being that one can figure out before reading, how long this might take, as opposed to speech where one never knows...does one? I appreciate that you wrote it as you wished...and I think length of post is directly related to the readership. The longest posts in this forum, e.g. are considerably shorter than most of the things I read online, and I don’t care how long it takes to read something here, because quality of life is more important to me than the time which it takes to get there. Others, have perfectly valid opinions, and the means readily at their disposal by which to decide on how they wish to value and thus spend their own time.\n\nMeanwhile, I read your original post and then getting down the page to here, I lost count of your numbering system, but in the old “1” question, how much you read on the screen vs. looking is an important factor. You obviously write a lot, so you must read a lot. But there are so many factors involved in this, I’d hate to tell You what’s right, either as a reader, or a designer, preferring, as I think my job dictates, to give you all the choices, from thin to black, from small to large and from fuzzy to sharp, before style even enters the picture. This, somewhat contentiously, is not the way most providers of screen fonts have been trained. The third question: “Can someone make a good font in a week?” also, sort of obviously implies “How do you know when to stop?” This isn’t obviously just about the designer, but also about the design. It is the combination of needing or wanting a single style, and having the end result, or at least its uses, in your mind before you start, that make the one week font possible, usually, along with a deadline to be shortly followed by a check, all indicating the presence of a client with the hots. Adding additional styles slows the process, as does not knowing how, or why it’ll be used, as in not having a client real or imagined.\n\nThis kind of situation, (aka a professional font designer, a problem, and a client), is not the most common occurrence at this forum. We here, in fact, often see questions not too terribly far from “What would your favorite color’s favorite color be, if it could talk? Hmmm?” So, we need to be the editors of what we read and write, with help from the superb staff of moderators and steady-heads, most of whom need not worry about a 1,000 parts or 29,000 spaces every week.\n\nI hope this answers some questions, and if it brings more longer ones the folks who don’t want to read long texts can see and dodge accordingly. Or, perhaps the folks at Typophile would just set up the forum based on length of post, so that the “You suck!”, “No, you suck!”, “hu uh!”, “uh hu!” posts can all be swept into the “short” post pile and all the “long” posts can be put somewhere for the patient...;)\n\nCheers!\n\n"
    },
    {
      "time": " 8.Nov.2007 7.27am",
      "content": "_What would your favorite color’s favorite color be, if it could talk?_\n\ngrey, of course! \\>^p  \nthat line made my day\n\n"
    },
    {
      "time": " 8.Nov.2007 9.39am",
      "content": "\\> _It also depends how people define their work as finished;_\n\nI think that is an important reason as well. Very good point.\n\n\\> _(though immediately coming to mind right now is the amount of work and time put into the Beorcana typeface. However, your point of course is accurate.)._\n\nWell, Beorcana isn’t really a display face pur sang. So I think it was treated in the level of perfection as a text typeface.\n\nAnd, on the subject of rude, insulting posting on this forum; I honestly don’t know what you are referring to. I think this is one of the most civilised places on the internet. I hardly ever see (or experience) rude answers or comments.\n\n"
    },
    {
      "time": " 8.Nov.2007 9.53am",
      "content": "Wow! I sure hope the less-experienced members of this forum realize the kind of valuable insight they are getting completely free here.\n\nAs for the amount of time it takes to complete a typeface, or should take under average circumstances, I suppose my initial question originated from seeing the sheer volume of typefaces released by Ray Larabie ... keeping in mind the fact he created hundreds of free typefaces in addition to those he now sells.\n\nIt also brings to mind another somewhat intriguing query. I have absolutely no clue how Mr. Larabie goes about conceiving and producing his typefaces, nor have I had the fortune of putting any of them to use since I don’t have any of them in my possession. Just from my initial impressions, however, they all seem to be quite nice.\n\nIt made me wonder, though, what kinds of little shortcuts designers might take to speed the process (of course not to insinuate that Mr. Larabie takes any)? For example, let’s say Designer X creates a typeface he or she calls “Nodobi,” and releases it for sale. At first glance, and to a layperson, this font looks just like Bodoni, except for the fact that it contains a few unique features here and there that separate it from the original Bodoni.\n\nIn this situation it wouldn’t shock me to find out a designer, instead of actually starting from scratch and drawing an entirely new Bodoni-influenced typeface while including those additional, unique features, instead begins by taking some already-existing Bodoni face and just makes his or her “unique” adjustments that way.\n\nWhich of course can be manifested in hundreds of ways. Designers can take such shortcuts within their own font-creation process as well. My question, then, is this: what are some of the better, legitimate and time-saving shortcuts being taken (i.e., such as using copy and paste to build portions of individual characters with identical curves vs. building every single curve from scratch), and what could be considered the taboo, cardinal-sin shortcuts people are using when releasing typefaces? Believe me, I am not attempting to develop any bad habits here ... quite the contrary. I am trying to avoid at all costs taking all of those easy routes the purists and/or talented designers would consider blasphemous.\n\nAs for Mr. Larabie, I envy what he seems to be able to do. I just don’t want to have admiration for things that in reality are blatant examples of corner-cutting. With the volume of fonts he produces, he’s either a mathematical and technological prodigy, sleeps an hour a night, or is cutting some major corners. At this point in my development I would prefer to - and do - believe he probably has an uncanny gift of efficiency.\n\n"
    },
    {
      "time": " 8.Nov.2007 10.16am",
      "content": "Quincunx: As for this board sometimes descending into rudeness and so forth, let me provide a perfect example: I posted my first query on Typophile in this very subject, at the top of this page. While perhaps not the most direct of posts, my goal was to generate well-considered, thoughtful responses which I felt required me to be more descriptive and yes, less concise. There wasn’t a little mini-cannon that popped out of everyone’s monitor forcing everyone to read every single word or anything, so everyone was free to simply ignore the entire thread.\n\nNo sooner had I done that than along comes Ms. PattyFab telling me how I need to say what I want to say. No “Hi! Welcome!” No “you might want to consider streamlining your posts.” Just, “Too many words. You need to learn to be more concise.”\n\nThat kind of thing does nothing but make a person sit there and say, “screw you.” I despise that kind of poisonous, non-productive atmosphere and it stuns me that people fortunate enough to be so involved in what they love can still be so pissy. This forum almost should be church-like in its peace, humility, opportunity and communal nature. Instead after my first post I’m getting composition lessons from past episodes of “Sex in the City.”\n\nWhich made my appreciation for the words of Mr. Berlow, Mr. Shinn and Mr. Crossgrove that much greater.\n\nPeople with experience around here almost have a duty to realize just how much influence they possess and how much their words mean, because oftentimes little pissy remarks like some here can become the type of definitive turning points that deflate the enthusiasm of someone just discovering such a wonderful world. Kind of like, I sure love typography but the participants in this arena sure are a bunch of snotty, arrogant whiners, and that just sapped my love for the subject dry.\n\nTo me, a moment like that in time is horrifying but can come about in a split second. While certainly people should be free to express their views, etc., being successful in this arena - especially one based in art forms - carries with it some undeniable responsibility to typography itself, and the health and promotion of the concept for all. Everyone here owes at least that much to the field, though clearly a few around here have no intention whatsoever of paying it. I find that tragic. And wholly aggravating.\n\n"
    },
    {
      "time": " 8.Nov.2007 11.09am",
      "content": "Well, I guess you were in bad luck or something then. Because I think, as I said, this is one of the most professional and mature forums I have stumbled upon. I haven’t had a bad experience on here before, nor got in an argument with someone. I don’t think you should or can judge a whole community based on a couple of less intelligent remarks.  \nI understand it can scare people off, but with a little common sense you can also ignore it and do your thing. Some people are easily insulted as well.\n\nAnd, you do have very long posts. ;)\n\n"
    },
    {
      "time": " 8.Nov.2007 11.33am",
      "content": "Curious: I apologize - I was no doubt too concise in my own comment, and I’m sorry if you felt insulted. I tend to dip into this forum when I need a break from work and when I saw your thread I just couldn’t - at that moment - imagine taking the time to read it. I think - especially in the initial post - it might behoove you to streamline your remarks a little, to draw the reader in. Especially as the title of your thread didn’t reveal its subject. You might consider starting a blog.\n\n"
    },
    {
      "time": " 8.Nov.2007 12.38pm",
      "content": "“The question, then, is why are there snotty people here when nearly EVERYONE...”\n\nThere are virtually no snotty people here. It’s bizarrely genteel, and the only people who think otherwise are either selfish (how dare they ask me to search on the site before asking what font Pantone uses?), insufferable (“do my homework for me!”) or insane (not telling who). I have been reading Typophile for years, and I have never seen snottiness or impatience - as least not without the recipient badly deserving it. If you think Typophile, of all places, is full of people who will rip you an new asshole for being ignorant, full of yourself, or unwilling to learn the rules before playing, then your browser history must start and end here.  \nI mean, this is one of your first posts, it’s pages and pages long, it includes attacks on the great members of this amazing community, and you’re surprised at some of our reactions? Give me a break.\n\n"
    },
    {
      "time": " 8.Nov.2007 12.55pm",
      "content": "Thanks, I feel much better now. I know some of my posts have been lengthy, but they reflect my level of fascination with type. My response after being told what I need to do was no more acceptable than the original act, which I regret. I know this because I can’t imagine any circumstances under which saying “bite me” would be the considerate, aesthetic thing to do.\n\nI actually do have a blog, but your suggestions were appreciated. Rather than a blog or a forum, however, what I really think I need is to be in a room full of people far more experienced and talented than I who also share my level of enthusiasm for typography. Unfortunately Lakeland, Florida’s reputation as the center of the typographic world came to an abrupt end after the violent hurricane of 1593, known simply in these parts as “Viento Puta.”\n\nI made up that last sentence of course. Anyway, I will make a concerted effort to post in a more efficient manner, keeping in mind the median availability of this forum’s members, some of whom like yourself could be limited by work obligations. Thank goodness, though, you were able to find enough time to jack-slap me with that ruler. Between that and reading another sentence or two in my post, you obviously chose what your personal character told you was the high road.\n\nNot only do I make things up, I tend to kid a lot as well. No one hurt.\n\nSee, the transformation from longer to shorter is already beginning.\n\n"
    },
    {
      "time": " 8.Nov.2007 1.25pm",
      "content": "Monolith:\n\nA.) You said there were virtually no snotty people here. In an earlier post, I wrote that “... I’ve run across a few people” when referring to the . . . snot factor. So our views don’t necessarily clash. My point was, this isn’t a divorce forum or a chat room based in Armed Bunker, Idaho - it’s doesn’t even seem to be one for semi-interested hobbyists. To me it’s like being in the Smoky Mountains. You just kind of look around and wonder how anyone could be in that environment and even consider being rude or bitter. It’s simply too beautiful. I think that same kind of awe and appreciation should exist here, which is why some of the piss and vinegar surprised me.\n\nB.) I IMPLORE you, if I exhibit even the slightest bit of ignorance and you commence with the anal ripping, I will sincerely thank you. I don’t fear that, just snakes. Being ordered to do and say things in certain ways, though, to me is unacceptable. And, well, snotty. Telling me I did or said something ignorant is a far cry from telling me I have to say something in a way others consider acceptable.\n\nC.) You wrote my post included “attacks on the great members of this amazing community.” I strongly disagree. My comments weren’t even that member-specific, and if the snotty members are considered great, the civil ones must immediately be exalted as gods. I didn’t invade Utopia here and execute the town’s priests or anything, so saying I “attacked” the “great members” of this community is a bit strong. I said there were a few snotty people here, and that it surprised me.\n\nI apologize to anyone who might have taken offense to anything I’ve written. I promise my future posts will continue to decrease in length.\n\n"
    },
    {
      "time": " 9.Nov.2007 7.53am",
      "content": "I’m kind of snotty at the moment, but that has nothing to do with disposition and everything to do with a cold...\n\n(And I’m certainly no designer of any note to anyone; just a lowly rural clergyman with a love of typefaces who is avoiding working on a funeral sermon...)\n\n"
    },
    {
      "time": " 9.Nov.2007 3.16pm",
      "content": "Wow! Interesting (to me at least) that there are about 6,000 words in this thread now. I wonder what the record is?\n\nFor those who couldn’t be bothered to read it, it’s touched on many topics, including the ethics of free speech, acceptable boundaries for the Typophile newcomer, and inevitably life and death.\n\nLast time I looked there was nothing lowly about being a rural clergyman.\n\n"
    },
    {
      "time": " 9.Nov.2007 4.38pm",
      "content": "Nick: much thanks for the vote of confidence. I did end up writing that funeral sermon.\n\n"
    },
    {
      "time": " 9.Nov.2007 4.56pm",
      "content": "\\> _Can someone make a good font in a week? Or to be a truly admired, elite typeface, does it require years of work?_\n\nI have been working on my font on and - for several decades - off, since the mid-sixties!\n\n\\> _It also depends how people define their work as finished_\n\nHmmmm let me think about that for a while.\n\n"
    },
    {
      "time": " 10.Nov.2007 10.54am",
      "content": "<cite>Am I hyper-sensitive</cite>  \nNo… :=)\n\n<cite>[…]but it’s the Internet, and it’s not like you can decide not to mail the letter once it’s in the envelope. The button has been pushed.</cite>  \nCiao Nick! ;=) To me that’s the biggest (overall) problem, which is getting worse every day on the web. And being concise may help those who read, but does not solve them. Kindness is lacking everywhere, and this is surely not a problem of long paragraphs or phrases.\n\n"
    },
    {
      "time": " 10.Nov.2007 10.57am",
      "content": "I just add that, nonetheless, shorter paragraphs may be of help to an occasional user of the English language like me, because the points made by Curioustype are worthy, but it takes me a lot to understand well a rich way of writing in English (like many, for which English is the native tongue, have)… :=)\n\n"
    },
    {
      "time": " 10.Nov.2007 4.07pm",
      "content": "Incredible the brain power going on here. While there certainly are a few snotty people, it seems almost everyone here is too smart for their own good. I love that. I’m one of the few ding-dongs in the world who loves being surrounded by people much smarter than I.\n\nIn recent posts, Mr. Tamari informs us he has been working on his font “on and - for several decades - off, since the mid-sixties!”\n\nI can only imagine how exciting it must have been to transfer your work from its original palette to a digital one. To me that would be like putting two full wine glasses on a wet paper towel and moving them into the next room with a minial amount of spillage. I ashamedly admit to not being much of purist, and finding the digital era of typography to be the most compelling. Which of course is retarded since I also believe the typographers of previous centuries likely were far more knowledgeable than those of today. Go figure. No wait ... don’t go figure. Save yourselves.\n\nThen piccic offers us the following: “And being concise may help those who read, but does not solve them.” Come again, he asks while rubbing eyes, shaking head. Actually I may not want to know what you meant there because I’m almost certainly missing something obvious. You mentioned being on occasional (ab)user of English ... what is your native language?\n\nI’m curious because one of the pleasant surprises for me during my typographic indulgence is how many different words I’m learning in an assortment of languages. Five years ago if you would have asked me to say something in German, I would have said “something in German.” The knowledge I’ve gained on issues peripheral to typography has to me been better than chocolate. MARGARET THATCHER SWIMMING NAKED ON A COLD DAY! MARGARET THATCHER SWIMMING NAKED ON A COLD DAY! (little personal inside joke ... got a lot of those. Should I be worried?)\n\n"
    },
    {
      "time": " 10.Nov.2007 4.22pm",
      "content": "You should really get out more often and find people to talk with. I’ve written entire business proposals in less words than your posts.\n\n"
    },
    {
      "time": " 10.Nov.2007 4.38pm",
      "content": "ryanholmes: Thanks for the suggestion. Perhaps you too could get out more often and find people to talk with rather than wasting your time down here with the urchins disparaging me.\n\nLet me say this one final time: after massive amounts of research I’ve concluded no mysterious force exists in my words that somehow forces you to sit down and actually read every single one I write.\n\nOr, more concisely, why take the time to bash me when it would have been much easier and quicker to simply ignore me and this entire thread?\n\nPerhaps this can be resolved as follows: You just tell me how you want me to post, what the content should be, and the length of it, and I’ll only do exactly that from now on ... only when you get back from being the Mr. Social of your chosen hometown.\n\n"
    },
    {
      "time": " 10.Nov.2007 4.39pm",
      "content": "\\>_I can only imagine how exciting it must have been to transfer your work from its original palette to a digital one. To me that would be like putting two full wine glasses on a wet paper towel and moving them into the next room with a minial amount of spillage._\n\nDigital design tools are very powerful and allowed any amount of refinement to my old drawings on paper. At the same time computers introduce their own complications to displaying and printing type, so while it is easy to pour the old wine in new glasses, the new glasses are of an ingenious and complicated nature, fitted with various valves and whistles to confound the hapless imbiber.\n\n"
    },
    {
      "time": " 10.Nov.2007 4.45pm",
      "content": "Mr. Tamari ... my point exactly. I hope these more modern tools and similar valves and whistles haven’t caused too much damage to your initial work. I also wonder ... clearly once you were some years into your project, your typeface was taking a shape and creating an imprint of itself in your mind. And when reviewing your work, that imprint hardened itself into being as familiar as the back of your own hand.\n\nSo I’m curious - when first seeing your work in digital form, did it perfectly match the imprint described above when superimposed over it in your mind? Or did you see it and say, wow, my aunt is now an uncle?\n\n"
    },
    {
      "time": " 11.Nov.2007 11.19am",
      "content": "Its been ages since I’ve logged into typophile, so for the sake of convenience...\n\n1.Its nice to read such discussions, even if one might not be able to contribute to it directly.\n\n2.Yes, it amazes me sometimes, the speed at which some people design fonts. I know a senior of mine at college(he’s a typophile too-Satya), and last time i checked he’d made 7 fonts. For a person like me who finds it difficut to start working on something and even more difficult to stop, thats an insane amount of work in practically no time.\n\n3.Freedom of speech yes, but maybe you needn’t get so defensive about it. They do have a point you know. :)\n\n4.One problem I face at college, is getting people to interact. I couldnt manage to get people to sit down and talk, owing to the fact that people find it nicer to punch eloquent verses on their keyboards over facebook and orkut. So i started a blog for my batch ( [www.fellowgraphites.blogspot.com](http://web.archive.org/web/20081012182007/http:/www.fellowgraphites.blogspot.com/ \"www.fellowgraphites.blogspot.com\")). Completely useless, im the only one posting most of the times. Is it too much to expect people from a design institute to open their mouths and talk?  \nMakes me wonder if i suffer from an OD of “change the world syndrome” or am I just too idealistic?\n\n5.Someone better reply to my post, because too many of mine get ignored in these big discussions. :P\n\n6.oh..and @Curioustype—Whats the link to your blog?\n\nshreyas\n\n"
    },
    {
      "time": " 11.Nov.2007 11.49am",
      "content": "Thanks for your observations and participation sayerhs. In reply:\n\nI realize I probably was too defensive, true. I realize my posts were lengthy, but I felt the manner in which this was pointed out to me was rather confrontational and harsh. There are more polite ways for people make their point, especially to someone new and clearly as consumed by this arena as I.\n\nMy blog link is [http://blog.myspace.com/index.cfm?fuseaction=blog.ListAll&friendID=12801...](http://web.archive.org/web/20081012182007/http:/blog.myspace.com/index.cfm?fuseaction=blog.ListAll&friendID=128014807 \"http://blog.myspace.com/index.cfm?fuseaction=blog.ListAll&friendID=128014807\"), though as you will see there are no thoughts on typography in it.\n\nAs for getting people to talk, I know what you mean. For example, one thing that frightens me is this:\n\nALERTALERTALERTALERT: GETS LONGER HERE.\n\nAs I’ve read about typography,, many times I have come across people either discussing or writing these hyper-complex texts on font development, etc., and I’m not talking about all that ctan/linux/tex stuff. I am talking about mainstream designers or observers.\n\nNow I love typography and am just now getting into creating my own typefaces. But, when I read these typographic manifestos all I can think is, “wow, there is no way on Earth I’ll ever understand all of these extraordinarily technical aspects of type design.” That almost immediately ended my goal of ever creating a typeface of quality or substance, because even though I’ve had a career in design, some of what I’ve read might as well have been in Greek. Actually it might really have been in Greek but I wouldn’t know because I didn’t understand most of it.\n\nSo in retrospect I was wondering out loud whether or not one has to totally understand all the technical ins and outs to be a successful type designer. Even to the present day, I’ve been a pure drawer, so to speak. I realize there are some great musicians out there who can’t even read music, but I wonder whether that kind of thing carries over to typography.\n\n"
    },
    {
      "time": " 11.Nov.2007 2.31pm",
      "content": "_Now I love typography and am just now getting into creating my own typefaces. But, when I read these typographic manifestos all I can think is, “wow, there is no way on Earth I’ll ever understand all of these extraordinarily technical aspects of type design.”_\n\nSo in retrospect I was wondering out loud whether or not one has to totally understand all the technical ins and outs to be a successful type designer. Even to the present day, I’ve been a pure drawer, so to speak. I realize there are some great musicians out there who can’t even read music, but I wonder whether that kind of thing carries over to typography.\n\nI’ve loved reading every single word you’ve written and actually find the whole debate entertaining and some wonderful points that you’ve raised have made me pause for thought. I don’t have very much time, so for me this is the longest I’ve sat and read a thread and actually found it compelling.\n\nThe parts I’ve quoted above are the most relevant to my experience of typography and actually what moulded my decision as to what route my career would follow. I love typography but I do not feel compelled to design fonts purely because the sheer understanding overwhelms me. Instead I love to set type, I love to work with the tools created by others, the words and how I, as a designer can bring elements of the type to life.\n\nI am a lurker here, I am intimidated to some extents because my knowledge is still very limited (hence doing an MPhil), I have encountered very little hostility but the biggest bug bear that I’ve witnessed are people coming along and “demanding” knowledge (I’m not sure whether that is the right word?) I can understand why members become irritated and thus the “venom” springs forth ;)\n\nRebecca.\n\n"
    },
    {
      "time": " 11.Nov.2007 6.50pm",
      "content": "I’ve wondered myself how Ray works so quickly. I think he’s probably very focused and manages time very well. Maybe Ray will read this and give us some insight into how he works.\n\n"
    },
    {
      "time": " 12.Nov.2007 2.23am",
      "content": "\\>_So I’m curious - when first seeing your work in digital form, did it perfectly match the imprint described above when superimposed over it in your mind?_\n\nThe operational word here is ’superimposed’. After scanning my paper designs I superimposed digital lines on them and they became computer fonts. Once I saw my designs on the monitor I did not look back but delighted in making small adjustments in proportions, curve-shape and so forth.\n\nFor ’pure drawers’ like Mr. curioustype Miller and Ms. Rebecca, no - one need not learn too much of the technical details of fonts at first.I suppose one can proceed a step at a time as I have done, and solve each problem as it arises. FontCreator is excellent software that can convert scanned drawings into editable digital lines, and into a usable font, but one does have to learn the necessary techniques and there is plenty of information online to help. Ah metal type...things were much simpler then!\n\nOh, I just remembered something I have done in pre-computer days: make a paper or cardboard font. Photocopy your designs and paste thenm on board and cut the ’type’ pieces. These can be set together to make words which can in turn be photocopied.\n\n"
    },
    {
      "time": " 12.Nov.2007 10.53am",
      "content": "Thank you very much, Rebecca, for relating your own experiences here. And while I don’t believe it’s a huge factor, I do believe having some significant knowledge of computer science and various font-creation programs can be a tremendous advantage in making a good font a little better - or completed faster. Unfortunately that’s about all I have to fall back on since the science and technology specific to type design itself have long since sailed right over my head.\n\n"
    }
  ]
}
