{
  "id": "3892",
  "title": "(x) Excellent communication - Adobe Sans {Yves}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "![type.gif](http://web.archive.org/web/20080907154904im_/http:/www.typophile.com/forums/messages/83/3076.gif)  \n   \nBy any chance, can anyone identify this typeface?\n\n [‹ &#40;x&#41; Thesis... or is it? - PMN Caecilia {Stephen}](http://web.archive.org/web/20080907154904/http:/www.typophile.com/node/3905 \"Go to previous forum topic\") [&#40;x&#41; information about Robert Kirchner &amp; FF isonorm {Yves} ›](http://web.archive.org/web/20080907154904/http:/www.typophile.com/node/26963 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907154904/http://www.typophile.com/user/1203\" title=\"View user profile.\">anonymous</a>",
  "time": "<br>",
  "uid": "1203",
  "comments": [
    {
      "time": " 25.Nov.2002 7.25am",
      "content": "That's Adobe Sans, the horrendous substitute font which ATM uses whenever the original fonts are not available on the user's computer system. This allows the user to read and print documents which feature those missing fonts. It's a chameleon-like typeface that uses Multiple Matser technology to match the widths of the missing font in order to take up exactly the same amount of space. It finds those widths in the \"ATM font database\", a file in your System folder that includes the widths tables of almost every single typeface in the Adobe Type Library. So in fact this could be any typeface.\n\n"
    },
    {
      "time": " 25.Nov.2002 7.46am",
      "content": "That would be \"Multiple Master\" technology. Sorry about the spelling mistake, but I got so worked up by this that I almost tripped over myself writing this post. And Anonymous, don't get me wrong, the following rant is not aimed at you. Don't get caught in the crossfire.   \n   \nI mean, everywhere I look I keep bumping into Adobe Sans or Adobe Serif: on menus, in magazines and newsletters, on wrappers, on huge friggin' billboards... even on my yoghurt pot at breakfast and on the jars of my favourite brand of rice sauce. Don't all these designers, art directors or whoever they might be have eyes and see that the typefaces they so carefully specified were missing when they output the files and came out all wrong? I kid you not, within the space of a couple of months we received two logos with Adobe Sans converted to outlines. Which is doubly ironic because converting your fonts to outlines is exactly what you do when you want to avoid having your typeface being replaced by ATM! Aaargh, this is driving me NUTS! (wheeze wheeze pant pant)   \n   \nOkay, okay...   \n   \nI'm calm now.   \n   \nThis was my little Doctor Jeckyll and Mister Hyde episode.   \n   \nIt won't happen again.   \n   \nExcuse me for shouting.   \n   \nI really had to get this off my chest.   \n   \n   \nP.S. My colleagues often tell me they're happy they're not me, because I keep noticing these kind of things and sometimes get all worked up over them.\n\n"
    },
    {
      "time": " 25.Nov.2002 7.58am",
      "content": "\\> even on my yoghurt pot at breakfast   \n   \nAha - there's your problem.   \nTry having camomille tea instead.   \n   \nhhp\n\n"
    },
    {
      "time": " 25.Nov.2002 8.43am",
      "content": "Okay, now's the time for the truth: is it just me, or do any of you have the same problem with those faceless traitors called Adobe Sans and Adobe Serif? And do we have to move this thread to the \"General Discussions\" board?   \n   \nPS Hrant: LOL\n\n"
    },
    {
      "time": " 25.Nov.2002 2.02pm",
      "content": "This is an interesting issue: versatility versus quality. One could argue that if font substitution were not as \"smart\", it would foster more sensitivity towards type.   \n   \nhhp\n\n"
    },
    {
      "time": " 25.Nov.2002 2.23pm",
      "content": "You're making a very interesting point there, Hrant. Unfortunately I can't delve into the subject matter right now, because I badly need to finish the design of some business card, but what bugs me most is that the text in the sample looks like it's PR for some sort of graphic design firm. Can they really be taken seriously if their advertisement, capability brochure or whatever is flawed by such a production error?\n\n"
    },
    {
      "time": " 25.Nov.2002 2.51pm",
      "content": "Aha, an impostor!   \nYves, how can you claim to be a type geek when you actually bother to read the content?!   \n   \nhhp\n\n"
    },
    {
      "time": " 25.Nov.2002 2.52pm",
      "content": "Just a quick one before I sign off: automatic font substitution combining Multiple Master technology and font width tables was a stroke of genius, and a very important invention given the increasing importance of the Portable Document Format. But I fear in the process Adobe spawned a monster, and it's out there and can't be undone... Of course, the fact that the typefaces continually change their appearance like some kind of virus makes it very difficult to identify them, even to the trained eye, so I guess this explains why they keep popping up everywhere.   \n   \nP.S. If anyone wants more information on font substitution in ATM check Adobe's [Support Knowledgebase document](http://web.archive.org/web/20080907154904/http:/partners.adobe.com/asn/developer/pdfs/tn/5070.SupportATM.pdf), under section 4, page 11. It's pretty rudimentary, but it's the best I could find.\n\n"
    },
    {
      "time": " 25.Nov.2002 3.00pm",
      "content": "Hrant, I just noticed your last post: you crack me up. I confess: sometimes whilst studying typefaces some vague notion of meaning and context come trickling down my brain. I really try to fight it, though. ;P BTW It's Adobe Sans and Serif who are the true impostors.   \n   \nAlthough your server tries real hard to convince me it's only 02:59 pm, it actually is almost midnight down here. Talktayalater.\n\n"
    },
    {
      "time": " 25.Nov.2002 3.07pm",
      "content": "People are used to assuming that if the font   \ndoesn't look like Courier, then the fonts must   \nbe correct. Blame the production people for   \nnot catching it and the designer for not thouroughly   \nquality checking his/her work.   \n   \nCan you point us to a good sample of Adobe Sans?\n\n"
    },
    {
      "time": " 25.Nov.2002 4.20pm",
      "content": "But maybe the Adobe sub fonts are \\*too\\* good?   \n   \nBTW, you know what's funny? I once used the Symbol font (for some Greek letters), and they never showed up in the final output - I guess because they (or at least \"the system\") thought it was a mistake... :-/   \n   \nhhp\n\n"
    },
    {
      "time": " 26.Nov.2002 12.47am",
      "content": "\"People are used to assuming that if the font doesn't look like Courier, then the fonts must be correct.\"   \n   \nCompare it to modern cars: they're so reliable, full of safety gadgets like ABS, airbags et al, that people don't realize that they're driving killing machines at breakneck speeds. They just rely too much on technology and become oblivious to the fact that it's still **you** who's supposed to drive the car, and not be driven by it.   \n   \n\"Can you point us to a good sample of Adobe Sans?\"   \n   \nThat's the point exactly: there are no samples as Adobe Sans nor Adobe Serif are no proper fonts so to speak. They're supposed to be invisible impostors, that's their one and only purpose, and they only appear \"when anything else fails\". I'll see if I can whup up something, because basically it's quite easy to recognize them.   \n   \n\"But maybe the Adobe sub fonts are \\*too\\* good?\"   \n   \nTechnologically speaking, yes, but their design is awful, as I'll point out in the aforementionned sample I'm gonna make. Have a little patience, and watch this space.\n\n"
    },
    {
      "time": " 26.Nov.2002 4.48am",
      "content": "I had a really tough time trying to create this sample, so excuse me if the italics aren't included. I was getting all these weird results after deactivating and removing the fonts and reopening the files: QuarkXPress substituted Gill Sans with Geneva, Adobe Illustrator used Adobe Sans for the regular weights but Helvetica Bold for the bolds, Acrobat used Adobe Sans but didn't slant the italics, Photoshop gave me Times for some lines, and InDesign is just too damn smart: it highlights all missing fonts with a thick red rule (oooh I love that program! ![:)](http://web.archive.org/web/20080907154904im_/http:/www.typophile.com/forums/clipart/happy.gif) ). The system doesn't seem to work that consistently, and I suspect it's the programs themselves that have their own substitution rules which clash with the ATM system.   \n   \nSo below is the result. Just keep in mind that the italics are slanted versions of the same faces. I know it's quite a large file, but it seemed a bit silly to make a sample of 12 pt type at screen resolution.   \n   \n ![AdobeSans_AdobeSerif.gif](http://web.archive.org/web/20080907154904im_/http:/www.typophile.com/forums/messages/83/3083.gif)\n\n"
    },
    {
      "time": " 26.Nov.2002 7.46am",
      "content": "This is useful, thanks!   \nBTW, what \"base\" font(s) did you use? The \"adaptive\" metrics seem pretty extreme, like the lc \"g\" in the regular sans.   \n   \nhhp\n\n"
    },
    {
      "time": " 26.Nov.2002 8.04am",
      "content": "Gill Sans, because I know the inconsistencies in spacing and character widths show up pretty clearly then. If I had used News Gothic, it would have been a lot less evident. Adobe Sans looks a lot like Geneva, whilst Adobe Serif is something of a weird transitional face with chunky serifs   \n   \nI could make you guys a cheat sheet with all the distinctive characteristics of Adobe Sans and Serif. Do you think you could reserve a spot for it, and how/where/what do I upload?\n\n"
    },
    {
      "time": " 26.Nov.2002 8.07am",
      "content": "And don't ask me why Photoshop substituted Gill Sans for Adobe _Serif_ at one attempt. Beats me, I'm just glad I had one that didn't turn into Times.\n\n"
    }
  ]
}
