{
  "id": "38929",
  "title": "I got your concise right here",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Question: When using FontLab, I can be a true guideline freak. However, I cannot seem to shake one ongoing frustration: when I go to pull out a guideline, many times it is crooked at some odd angle and I am forced to go through the right-click, drag-down, hit align process. What causes this (I realize once you draw a crooked guideline, every subsequent one drawn will be the same angle), and is there a way I can eliminate even being able to draw anything BUT a perfectly straight guideline?\n\nAnd in translation for those fans of the utterly concise:\n\nMe. Love guidelines. Always crooked. Dammit. Need solution.\n\n [‹ Helvetica Film on BBC 1 tonight (Tuesday)](http://web.archive.org/web/20081203162339/http:/www.typophile.com/node/38856 \"Go to previous forum topic\") [Good Printers in Montreal? ›](http://web.archive.org/web/20081203162339/http:/www.typophile.com/node/38977 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203162339/http://www.typophile.com/user/15771\" title=\"View user profile.\">Curioustype</a>",
  "time": "<br>",
  "uid": "15771",
  "comments": [
    {
      "time": " 8.Nov.2007 4.47pm",
      "content": "I suggest to drag a pair of guidelines from the square where the two rulers meet. These guidelines will be horizontal and vertical respecitvely. Then, move them. Delete them. Subsequent guidelines you drag out of the rulers will be exactly horizontal or vertical, too.  \nNote that FL gives new guides the angle of the last guide you touched.\n\n"
    },
    {
      "time": " 10.Nov.2007 3.36pm",
      "content": "Thank you, Mr. Ahrens, for making me a smarter person. I also found in your words something quite amusing, and just as telling.\n\nThe following is how someone intelligent like you and ignorant like myself can essentially say the exact same thing in two completely different ways:\n\nYou: “Note that FL gives new guides the angle of the last guide you touched.”\n\nThen there’s my stroke of brilliance: “I realize once you draw a crooked guideline, every subsequent one drawn will be the same angle.”\n\nWait until I start breaking out the “thing-a-ma-jigs” and “doodads” on everyone. “You know, that thing when you hit that one letter flipping do-hicky.”\n\nAside from that, I fear my original problem is only half-solved. The syndrome of creating new crooked guidelines has been cured; what hinders me now is this brain cramp causing me to make crooked a previously drawn, straight guideline. I’ve narrowed down the cause of this to being a product of a cursor/tool movement generally taking place near the top and/or bottom of my active window, during my very first movements of relocating the guideline.\n\nI tried to come up with other possibilities but never got farther than “duh ...”\n\n"
    },
    {
      "time": " 10.Nov.2007 4.04pm",
      "content": "You don’t like reading the manual, do you ;)  \nI didn’t quite understand what you want to say but if you want to change the angle of a guideline you can either drag it near the edge of the window or right-click it and select properties.\n\nOh, and I don’t agree that you and me said exactly the same thing.\n\n"
    },
    {
      "time": " 10.Nov.2007 4.29pm",
      "content": "No, not much of manual person at all. Not much of a map or GPS person either. Unfortunately I’ve been cursed with believing one truly learns best by royally screwing up everything at least two or three times first.\n\nThank goodness you don’t agree that we said the same thing. We really did, but only I know that because, as I said, you are much more understandable than am I. Allow me a mulligan ...\n\nLet’s assume I’m in a window and want to creat a straight new vertical guideline. For reasons currently under investigation, when attempting to do so I often begin the drag process closer to either the top left corner or bottom left corner of the ruler. And when pulling the guideline across the screen, it comes out crooked. Mind you, I am talking now about drawing a new crooked guideline AFTER my most recently drawn one came out straight.\n\nYou solved that by suggesting I begin the dragging process in the top left area of the ruler, which always creates straight guidelines.\n\nMy problem now: let’s assume I’ve drawn the cross-haired guideline as you suggest, and my next desired action is to move the vertical of those two guidelines 10 percent further right. It is at this point I tend to begin this movement at the extremes of the guideline rather from the center and I end up making the guideline crooked. I am just wondering whether there is a more specific, effective way to always be able to draw the kind of guideline you want to. Such as, perhaps, a pre-set option such as those found in FL (i.e. copy offsets, visual BCPs, colored nodes, etc.) As it is, drawing guidelines for me is like a box-a-choc-late.\n\n"
    }
  ]
}
