{
  "id": "38946",
  "title": "Why switch off kerning?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Quick question, perhaps... Under what typographical circumstances would I wish to switch off kerning. I ask because on MS Word it defaults to kerning off (I know this can be changed) and it made me wonder why they’ve programmed it that way.\n\n [‹ How do i review past posts I have made?](http://web.archive.org/web/20071109225719/http:/typophile.com/node/38956 \"Go to previous forum topic\") [Quark and InDesign ›](http://web.archive.org/web/20071109225719/http:/typophile.com/node/38941 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071109225719/http://typophile.com/user/20652\" title=\"View user profile.\">Bendy</a>",
  "time": "<br>",
  "uid": "20652",
  "comments": [
    {
      "time": " 9.Nov.2007 4.27am",
      "content": "Wow, what a weird default setting. Perhaps Si might know about this one.\n\n"
    },
    {
      "time": " 9.Nov.2007 5.55am",
      "content": "\\> Under what typographical circumstances would I wish to switch off kerning\n\nComplete lack of typographical knowledge might be one. A situation faced by 90% (I expect) of Word users.\n\nSeriously, programming code with fixed width characters is the only no-kerning application I can think of, and I suspect that fixed width characters are designed with no kerning table anyway.\n\n"
    },
    {
      "time": " 9.Nov.2007 6.41am",
      "content": "Probably a decision made in the distant past (for performance reasons maybe), and not changed due to document reflow issues (think Bush memos). Surprised Word didn’t turn it on be default when they switched from Times New Roman to Calibri as PowerPoint did.\n\n"
    },
    {
      "time": " 9.Nov.2007 7.10am",
      "content": "Sounds like you need to go bust some heads, Simon.\n\n"
    },
    {
      "time": " 9.Nov.2007 8.12am",
      "content": "\\>not changed due to document reflow issues\n\nAt Typecon I talked to a guy from Microsoft who works on Publisher and he said that was the reason. I argued that if it is on by default you can still turn it off if you want the old flow. He said more or less that Microsoft customers are too clueless to do this, even if there is a notice when the change is made. And I said: by that reasoning you’ll never change to what you acknowledge is a better way. And he replied “go to hell.” Ok, he didn’t actually say that, but that was the message I got.\n\n"
    },
    {
      "time": " 9.Nov.2007 8.39am",
      "content": "If you wanted to simulate the appearance of un-kerned metal-era type.  \nOr capture the flavour of unkerned shareware fonts.\n\nOr if you have a connected script font in InD, set to “optical kerning”.  \nActually, there’s no way to “de-kern” a font in InDesign.  \nBut you can do it in Quark, I believe, by using the kern edit table.\n\n"
    },
    {
      "time": " 9.Nov.2007 8.51am",
      "content": "<cite>Actually, there’s no way to “de-kern” a font in InDesign.</cite>\n\nSure there is. Just select all of the type and set the kerning value to 0.\n\n"
    },
    {
      "time": " 9.Nov.2007 8.58am",
      "content": "@james p.  \n0 means that you don’t modify the kerning information given in the font – metric or optical.\n\n@nick s.  \nWithin paragraph styles or Character styles you can switch off the kerning. But just there.\n\n"
    },
    {
      "time": " 9.Nov.2007 9.39am",
      "content": "I stand corrected.  \nJames, you’re right.\n\n"
    }
  ]
}
