{
  "id": "38941",
  "title": "Quark and InDesign",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m noticing this more and more in job postings. People want me to be proficient or expert or skilled in a long list of design apps, and usually at the top of the list is Quark _and_ InDesign. I’ve used InDesign for years. I’ve had formal schooling on it. I know lots about it. I’ve never been exposed to Quark aside from reading about it. My question is: what am I missing exactly (by not being familiar with Quark)? Would I be limited to using which ever was available any given day, as opposed to just using the one of my choice? Should I be expected to use both because of the limitations of either? Is there interoperability between the two that I don’t know about? I’m not looking to revive the battle between the two products to determine which is best, but rather could you please help me understand why so many potential employers are saying one _and_ the other; not one or the other?\n\n [‹ Why switch off kerning?](http://web.archive.org/web/20081203161531/http:/www.typophile.com/node/38946 \"Go to previous forum topic\") [TIPOGRAFÍA MONTEVIDEO (Typography in Montevideo) ›](http://web.archive.org/web/20081203161531/http:/www.typophile.com/node/38936 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203161531/http://www.typophile.com/user/18989\" title=\"View user profile.\">David Sudweeks</a>",
  "time": "<br>",
  "uid": "18989",
  "comments": [
    {
      "time": " 8.Nov.2007 10.03pm",
      "content": "Hey there. By way of full disclosure, I’ve used QuarkXPress for a long time, and it is only in the last two to three years that I have had to learn and use Adobe InDesign at work.\n\nNow on to your question: my experience is that you will encounter different situations at every workplace. For example, my current employer recently switched over completely to InDesign, but there is still the odd old job, done in XPress, that we have to pick up and re-purpose, so it’s good to know both programs.\n\nMy previous employers, on the other hand, favored QuarkXPress, and even then the younger art directors would comp their stuff in InDesign rather than XPress, so it made sense to know both programs. You never knew which one you would be using on a given day, or for a given job.\n\nWhat it boils down to, for me, is that XPress and InDesign are the best, and most-used, layout programs out there, and it pays to be familiar with both of them — it makes you more valuable to potential employers. That’s a good enough reason for me.\n\nI am going to avoid comparing pros and cons of the two programs, because some employers may have the latest version of InDesign but an older version of XPress, or viceversa. If you’re lucky, they will have upgraded to the latest version of each.\n\nHoping this sheds some light,  \nR.\n\n"
    },
    {
      "time": " 8.Nov.2007 10.11pm",
      "content": "I second what Ricardo said. You will be more well-rounded and employable if you are at least proficient in both programs. I was trained in Quark back around 1990, when it was really the only game in town (far superior to Pagemaker) and have used InDesign for 2 or 3 years now. A lot of my clients still either prefer Quark or use it exclusively - it’s still the lingua franca in book publishing. There is much to recommend about both programs. I’m not going to compare them, just to recommend you verse yourself in Quark.\n\n"
    },
    {
      "time": " 9.Nov.2007 12.10am",
      "content": "i think what drives the need for both (quark and indesign) is what has already been mentioned... that you might be asked to revive a past project that originated in either and you will need to be savvy in both to be able to work on the document.\n\n(furthermore) publishing firms, printers, or other given service bureaus might require that files be delivered in one format or the other. so whether you are working “in-house” or for a creative firm, requirements for a print job are sometimes dictated to you by the printer.\n\n(lastly) if you are working for a creative firm, their clients sometimes dictate which application they want used. and if they love one versus the other... that is the one they are going to want ALL their documents/projects built in. and if the file changes hands back to the client, they will want to be able to open the document for future use, edits, etc.\n\nhope that shed some light...\n\n"
    },
    {
      "time": " 9.Nov.2007 7.58am",
      "content": "I don’t know how the latest version of Quark compares to earlier ones (and I mean real early, like v.3.3), but if it is as user friendly as I remember it, it should be a snap to pick it up.\n\n"
    },
    {
      "time": " 9.Nov.2007 9.04am",
      "content": "Thanks everyone!\n\n"
    }
  ]
}
