{
  "id": "3894",
  "title": "Metron, please critique",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "![Metron version 0.1](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/messages/29/3080.gif)   \n   \nThis is my first font. It is not yet complete, but I'd like to get the opinions of the people on this forum. There seem to be a lot of knowledgeable and/or opinionated folks here. ![:)](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nFor this font (tentatively titled Metron), I wanted to create an attractive, slightly futuristic sans serif typeface for display, corporate logos, and short lengths of text. I also wanted to stay away from the super-geometric look that makes so many fonts gimmicky and unreadable. The capitals were designed first, with the lowercase something of an afterthought (and still unfinished).   \n   \nThe typeface was built around a sketch I made of an uppercase M. I'm happy with it so far, but the N and the 7 have been problematic. Also note that I haven't done any kerning yet.   \n   \nI welcome any help I can get. Go ahead and be as nitpicky as you want. I'll offer free copies (once it's done) to anyone who posts something helpful here.   \n   \nPaul D\n\n",
  "author": "capthaddock",
  "time": "25 Nov 2002 — 4:44pm",
  "uid": "1258",
  "comments": [
    {
      "time": "25 Nov 2002 — 7:22pm",
      "content": "reminds me of the thirstype font Bronzo only much smoother.Good job.\n\n"
    },
    {
      "time": "25 Nov 2002 — 9:03pm",
      "content": "Paul - yes good job and a nice first font.   \n   \nof the problem glyphs you speak of...The 7 looks nice as do all the numbers...the uc N does kinda call attention to itself, but as Hrant might say, that's a feature, not a bug. :8   \n   \nThe m and t you might revisit. It seems like the t sits a little bit high on the baseline.   \n   \nThe tail on the Q...go wild with it.   \n   \nYou might want to make consistent the crossbars on the E and F.   \n   \nThe S could be a bit braver...   \n   \ngood luck   \n   \nbj\n\n"
    },
    {
      "time": "25 Nov 2002 — 10:15pm",
      "content": "Dear Mr Bjharvey\\*,   \n   \nOur customer records show that your organization does not own a current and/or valid license for the use of the phrase \"that's a feature, not a bug\" and/or \"that's not a bug, that's a feature\". Perhaps this was merely an oversight on your part\\*\\*? Please expect a notarized and apostilled Formal Letter of Intent to Sue Your Arse to a Moderately Distant Quasar by one of our legal teams from the Terminology and Quaint Expressions Division, within the hour.   \n   \n\\* As if that's your real name.   \n\\*\\* Riiight.   \n   \n--   \n   \nDear Mr Davidson\\*,   \n   \nPlease expect to received a full non-written apology for the above digression from our Posturing and Crocodile Tears Division, as well as a critique of your font\\*\\* from our Patronization and Blind Encouragement Division, within the next 24 hours.   \n   \n\\* A normal, honest name, with at most 2 consonants in a row and no hint of sexual proclivity.   \n\\*\\* It's really nice.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Nov 2002 — 10:50pm",
      "content": "Dear Mr. Papazian,   \n   \n I've been receiving invoices on this digression for months and now I am writing to you to rectumfy this before it turns ugly.   \nFirst, I acknowledge using your words without the proper license, though I did not see a readme.txt file near your post nor any terms of use. I didn't look very hard, but that's no excuse for a member of your legal team shooting at me with a small-caliber handgun.   \n Worse, you sent this to a collection agency and they called me at my private home number. I told them, accurately, that there was no bj harvey at the residence, and I offered to pay a nominal fee \\*only\\* for the words that I used, but you want to bill me for the bold, the italic, and every other weight of your phrase.   \n Also, please be aware that my legal team did a Google search and found out that thousands of other people are uploading your phrase without the proper license   \n   \n [http://www.google.com/search?hl=en&ie=ISO-8859-1&q=%22that%27s+a+feature%2C+not+a+bug%22&btnG=Google+Search](http://web.archive.org/web/20150414225819/http:/www.google.com/search?hl=en&ie=ISO-8859-1&q=%22that%27s%2Ba%2Bfeature%2C%2Bnot%2Ba%2Bbug%22&btnG=Google%2BSearch)   \n   \nyet I'm the only one getting harassed.   \n   \n Please, please Mr. Papazian, accept my deepest apologies and accept my pledge to refrain parroting your catch phrases and other detritus from now on.   \n   \n Also, en el futuro, you might consider attaching a read me text file to your work. It would save you the legal headaches, like the one you are giving me.   \n   \nthank you   \n   \nmister bj\\*   \n   \n\\* I cannot legally give you legal advice.\n\n"
    },
    {
      "time": "25 Nov 2002 — 10:52pm",
      "content": "Apologies, Paul, for\n\n"
    },
    {
      "time": "25 Nov 2002 — 11:22pm",
      "content": "\\> you want to bill me for the bold, the italic, and ...   \n   \n:-\\>   \nYou know too much - now I really have to shoot you.   \n   \n\\> Google search   \n   \nDrat, foiled by Prior Art yet again!   \n   \nhhp\n\n"
    },
    {
      "time": "26 Nov 2002 — 8:30am",
      "content": "It's a bit like Bronzo as a grown-up: much smoother, but with some new individualistic traits. I like how there's enough organicity to give it a much richer character than something entirely mechanical; and it's not formally straight-laced, which is great (like the killer divergence between the UC \"M\" and \"N\"). The only UC glyphs that bug me are the \"D\" (too square), and the \"Q\": do something drastic with it, although since the font is so nice in all-caps I wouldn't ruin the line with a strong tail (except maybe as an alternate), so do something inside the bowl instead, like maybe cut straight from the bottom-left of the bowl to the (inside) top-left of the tail?   \n   \nThe lc isn't nearly as convincing. For one thing, I think this design needs body, so make the xheight as large as you can. The \"m\" is great and the \"ae\" is smart, but the \"f\" and \"t\" are especially weak. The numerals are really nice, except the \"4\" needs more presence. The peculiars: try a single bar on the Dollar and Yen; lower and lengthen them (towards the inside) in the Euro. The \"?\" needs more presence too. The rest are pretty nice!   \n   \nAlso:   \n1. This design needs at least one darker weight. But don't bother with an italic.   \n2. The rounded corners are a nice professional touch.   \n3. The name is right on.   \n   \nGo all the way with it!   \n   \nhhp\n\n"
    },
    {
      "time": "26 Nov 2002 — 12:32pm",
      "content": "Thanks folks. I've never seen Bronzo, and I'll refrain from looking at it now so as not to pollute my own intuitions here. I'll take all your comments into account for version 0.2.   \n   \nBj harvey: thanks for rectumfying your quarrel that that Armenian troublemaker. I'm not sure about the E and F, but I will try a different S.   \n   \nHrant: Thanks for the tips. You're right, I've been too conservative with the x-height. Your comment on a darker weight is interesting, because I designed this font on paper for a much heavier weight, but thought it would be easier to start light and make the heavier afterwards.   \n   \nI don't plan on an italic, but I'd like to do other character sets.   \n   \nThe rounded corners were inspired by FS Albert. I thought they made it look more refined.   \n   \nPaul Davidson\\*   \n   \n\\*A good Scottish name. If it's not Sco'ish, it's crrrap!\n\n"
    },
    {
      "time": "26 Nov 2002 — 3:40pm",
      "content": "Nice Symmetry. ![:)](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/clipart/happy.gif) Distant relation to Armada by Font Bureau. The comment on the 'Q', yes too conservative. The 'R' and the 'K' look pushed into a box, and too narrow (?). The middle stroke on the 'm' looks a bit out of place too. Nice '4'!\n\n"
    },
    {
      "time": "26 Nov 2002 — 10:10pm",
      "content": "I like this!   \n   \nA couple of things I noticed..   \nThe \"X\" seems out of place. Maybe it needs   \nto incorporate curved lines rather than straight.   \n   \nSame thing with the \"Z\"...it looks like it   \nwas snatched from Futura.   \n   \nAt first I didn't care for the UC \"N\", but it's   \ngrowing on me. Initially I thought it should   \nmatch the LC 'n', but the UC reads really well   \nin the text...so maybe the LC should be styled   \nmore like the UC.\n\n"
    },
    {
      "time": "28 Nov 2002 — 10:49am",
      "content": "A little help for the 'X' (maybe?)   \n   \n+ep+   \n ![Graphic1.jpg](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/messages/29/3106.jpg)\n\n"
    },
    {
      "time": "28 Nov 2002 — 10:56pm",
      "content": "Thanks a ton for the comments, everyone. Here's a revised version:   \n   \n ![Metron version 0.2](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/messages/29/3107.gif)   \n   \nI've made the Q a little more quirky without puncturing the baseline. I've modified the D, the S, the X, the Z, and a few others according to suggestion. I'm still not happy about the t; I may have to give it a tail. Eka, your X suggestion was a little to wild for this face, but I've given the glyph some curve.   \n   \nI've also begun the extended character set. Aligning diacritics on the a is a challenge. I'd like to hear opinions on the edth, too.   \n   \nHrant, I think I like the double-barred yen better, at this point.   \n   \nPaul D\n\n"
    },
    {
      "time": "28 Nov 2002 — 11:05pm",
      "content": "i would suggest more spacing, it's a bit tight. how would a bold weight look like?\n\n"
    },
    {
      "time": "29 Nov 2002 — 1:22am",
      "content": "i would make this all caps. i mean upper case only and probably a lot of alternate figures. MV and ¶ kick . GKSXYZ need some more work. you have something, keep going!\n\n"
    },
    {
      "time": "29 Nov 2002 — 10:41am",
      "content": "Pretty nice! The lc is improving fast.   \n   \nThe biggest problem to me is an uncomfortable conflict between round and flat. For example compare the lc \"a\" and \"c\". This is less obvious in the UC as a whole, for some reason.   \n   \nThe other \"global\" thing that bugs me is optical: at smaller sizes especially, things like the descender of the lc \"g\" and the top of the counter of the numeral \"6\" seem to be \"splaying\" at uneasy angles, disturbing the otherwise wonderful serenity of this design. It's an illusion, and since this is a display face you might just ignore it; or there might be a trick (like turning in the last tip of the flat part) that might help.   \n   \nSome glyph-specific stuff:   \n- Consider giving the UC \"I\" bars.   \n- I know the UC \"M\" is one of your \"mother glyphs\" here, but I think it needs a small mod: take the middle \"v\" lower.   \n- The UC \"Q\" still needs work: the inside is a little bit too strong now; the bottom-right is messy: what about this - make the corner a total 90-degree angle, and the \"tail\" go into it. You'll need some optical compensation.   \n- The UC \"X\" seems a bit too smooth.   \n- The diagonal of the UC \"Z\" is too wavy. Make it more like the \"X\" - three clear segments connected with abrupt curves.   \n- Lower the bar of the lc \"e\" a bit.   \n- The \"f\" and \"j\" are malformed.   \n- That lc \"r\" is going to be a spacing fiasco.   \n- I think the lc \"t\" does need a curl.   \n- The BP currency is strange.   \n   \nKeep it up!   \n   \nhhp\n\n"
    },
    {
      "time": "29 Nov 2002 — 11:47am",
      "content": "Whew, I have my work cut out for me.   \n   \nI think I'll have to tackle the \"round vs flat\" issue with the lowercase letters first. Then I'll work the other problems and repost. I'll keep reading here for further suggestions. Thanks, folks!   \n   \nPaul D\n\n"
    },
    {
      "time": "1 Dec 2002 — 8:05am",
      "content": "the original Q is way better. just my opinion, but i couldn't let it go. the second X is more distinct as well. although by itself the m is interesting, it does seem a little out of place with the middle stroke breaking the baseline. i like both S's, but the original was making my day. nice and squareish, but not square. for the t, maybe a tiny little tail ala din or meta. the first one was stronger than the second. the 3 seems a little top heavy to me. maybe a little assymetry would help. v.0.2 \"?\" is good. the original S and B were great. i think that's the way to go. you can see how personal preference shows up in these critiques. interesting, eh? oh yeah... the counter in the first D was bowing the vertical stroke inward. the second D is much more succesful. also, the G stands out, but not in a good way. something to do with hrant's \"round vs flat\"\\* issue. anyway, time for church. i look forward to seeing more of this.   \n   \n\\*copyright hhp\n\n"
    },
    {
      "time": "3 Dec 2002 — 4:44pm",
      "content": "Here's another update:   \n   \n ![Metron version 0.4](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/messages/29/3157.gif)   \n   \nIsaac, I'm begining to see what you mean about personal preference showing up in these critiques. I'm still grateful to be able to draw on the instincts of experienced type designers, though.   \n   \nI've resolved the round-vs-flat conflict by making the lowercase letters all roundish on top. It's a little more divergent from the uppercase that way, but I think it still fits, and the lowercase characters have more character.   \n   \nI'm still unsure about the f. I think I'll leave the 6 for now; I like its shape despite the optical splaying.   \n   \nPaul D\n\n"
    },
    {
      "time": "3 Dec 2002 — 6:12pm",
      "content": "Paul wrote:   \n   \n\\> There seem to be a lot of knowledgeable and/or   \n\\> opinionated folks here.   \n   \nHah. A worthwhile distinction.   \n   \nOverall, it's farily even but I question the g and y. Why   \nnot take them to the baseline? They sit slightly above   \nand add to the jumpiness.   \n   \nOh, and I like the x suggested by Eka Prasetya earlier.\n\n"
    },
    {
      "time": "3 Dec 2002 — 9:45pm",
      "content": "The problem at this x-height is that the descenders on the g and y would go lower than the ascenders go high.   \n   \nPaul\n\n"
    },
    {
      "time": "12 Dec 2002 — 8:06am",
      "content": "Looking good! I think the curve/flat issue is mostly resolved - maybe a few tweaks here and there.   \n   \nNitpicks:   \nK: too curvy   \nL: too wide   \nS: something wrong   \nV: narrower base   \nCedilla: simplify   \nf: still ungainly   \nm: wider   \nr: shorter beak   \ns: more open   \nt: more \"timid\"   \nv: narrower base   \noe: \"o\" wider   \neszet: narrower top   \n4: too open   \ndiaeresis: dots   \n   \nOtherwise, very shmoove.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Dec 2002 — 12:33pm",
      "content": "Hrant: I agree that the K is too curvy (I've yet to fix it), and I've reworked the S. I'd be interested in knowing why you think the v's need narrower bases. My cedilla was an attempt at a compromise between the simple French cedillas and the curvier Portuguese.   \n   \nI'm including here a little test image that uses text blocks of the font. It gives you a bit more of an idea how the letter shapes fit together. They worked better than I expected, I think, given some of the odd shapes. Seeing it in the text, I'm more confident about the t now. That could just be my inexperience talking.   \n   \nBy the way, those little dingbats are part of Metron Ornaments, a companion font.   \n   \n ![Metron text](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/messages/29/3264.gif)   \n   \nPaul\n\n"
    },
    {
      "time": "12 Dec 2002 — 1:04pm",
      "content": "This is too suave!   \nJust the spacing is too tight, especially where sequences of \"i\"s and \"el\"s are clotting like crazy.   \n   \nThe \"v\": look at \"Jovian\" on the third line: it's more like \"Jouian\". But the \"t\" doesn't seem as overpowering in text, although I still think it needs to be pulled back a little. On the other hand, I'm surprised how well the \"r\" works! But now I think the \"e\" needs a slightly smaller eye.   \n   \nYour single biggest eyesore is the \"f\" though: it's ruining almost any word it's in.   \n   \nBTW, the Space angle is right on!   \n   \nhhp\n\n"
    },
    {
      "time": "12 Dec 2002 — 6:15pm",
      "content": "this is probably not a small-point-size-on-newsprint face, but at small sizes won't the p look like a dot-gained o?   \n   \nyes, letterspacing. i'm no pro, and not even really an amateur, but the tight spacing is fighting with the double f's.   \n   \ni think hrant is right on about v.   \n   \ni still like the original S, but it might not work with the rest of the font now. it might not have been curvy enough.   \n   \nthe other day i saw a font called metron. i'll look around and see where it was and get back to you on it. nice work.\n\n"
    },
    {
      "time": "12 Dec 2002 — 6:20pm",
      "content": "metron at t26. considerably uglier than yours.   \n [www.t26.com](http://web.archive.org/web/20150414225819/http:/www.t26.com/)\n\n"
    },
    {
      "time": "13 Dec 2002 — 11:15am",
      "content": "Bummer...does that mean I need to choose a different name?   \n   \nPaul\n\n"
    },
    {
      "time": "13 Dec 2002 — 1:59pm",
      "content": "The spacing on the right side of the 'f' is too much for the overall spacing and the spacing on the left side of the 't' is too big also. Hrant's suggestion of loosening up overall is a good idea. Another thought might be to remove the left half of the cross-stroke on the 't'.... maybe? Or just shortening it??\n\n"
    },
    {
      "time": "13 Dec 2002 — 2:00pm",
      "content": "And.... just for me, I would hopefully be able to at least use your orginal 'f'. I prefer that one to the new one. Maybe for your ligs you use the overhanging 'f' and the norm you go with the first??\n\n"
    },
    {
      "time": "14 Dec 2002 — 3:57pm",
      "content": "re: conflicting font name   \n   \nOver in San Francisco we have a Sony megaplex called the [Metreon](http://web.archive.org/web/20150414225819/http:/www.metreon.com/). It's a big multi-entertainment center. Perhaps you could call it something similar along those lines to what you currently have. Although Sony might sue if you used theirs directly.   \n   \nOr you could change the font name to Mootron and change the dingbat font to a cosmic cow motif!   \n   \n\\<\\<==== ===\\>\\> ====\\>\\>\n\n"
    },
    {
      "time": "14 Dec 2002 — 5:24pm",
      "content": "Hmm, Metreon is something I could live with.   \n   \nMetreon, Metrion, Metryon ...   \n   \nPaul\n\n"
    },
    {
      "time": "14 Dec 2002 — 6:03pm",
      "content": "A good article on naming...by Emily King...@ typotheque...   \n   \n [http://www.typotheque.com/articles/gorilla.html](http://web.archive.org/web/20150414225819/http:/www.typotheque.com/articles/gorilla.html)   \n   \nfrom the article: \"With colleague Matthew Butterick, (Tobias) Frere-Jones invented a system for the naming of successful typefaces: the name must have three syllables; the stress must be upon the second syllable; the name must end with a vowel, preferably a.\"   \n   \nMetrona? blah.   \n   \nMetronica might be too ravy. (rave-y)   \n   \nbj\n\n"
    },
    {
      "time": "15 Dec 2002 — 4:01pm",
      "content": "The thing that bothers me about the f,   \nespecially in the text setting, is that   \nit seems too tall. It towers over all of   \nthe other letters.   \n   \nMaybe shortening it so the beak of the   \nf is even with the dot of the i would help.   \n   \nFor example..   \n ![met-edit.gif](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/messages/29/3289.gif)   \n-shortening the overall height and the beak.   \n   \ncompared to the original..   \n ![met-og.gif](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/messages/29/3290.gif)   \n   \nIt seems a little more pleasing to   \nthe (my) eye.\n\n"
    },
    {
      "time": "15 Dec 2002 — 5:19pm",
      "content": "Hi   \n   \nmaybe you should use your N (left vertical) as an alt character and make a original N (centered) similar to M or more related.   \nJust a thought, Its a nice font\n\n"
    },
    {
      "time": "16 Dec 2002 — 9:03pm",
      "content": "BJ: Cool article. I keep wanting to keep the campy sci-fi-esque \"tron\" at the end, so my current favourite candidate is \"Megatron\".   \n   \nKyle: Thanks for the f suggestion. I was afraid to have a low crossbar, but that might be better than making the letter extra tall.   \n   \nAlejandro: I had great difficulty making a nice N using curved strokes on both sides like the M does. Using only straight lines would make the N too \"normal\" for this typeface, I think.   \n   \nPaul\n\n"
    },
    {
      "time": "16 Dec 2002 — 10:00pm",
      "content": "i vote you call carlos at t26 and tell him to take his metron off the market because yours is better. i wonder if he actually has the name copyrighted?   \n   \ni like the idea of alternates. more work for you, but i can live with that.\n\n"
    },
    {
      "time": "17 Dec 2002 — 2:24am",
      "content": "i think the first sample has qualities, i took the liberty of making a screenshot of some opinions.   \n ![metron core](http://web.archive.org/web/20150414225819im_/http:/www.typophile.com/forums/messages/29/3301.jpg)   \ni liked it when it was not so rounded. the edges gives the font attitude. it's a matter of personal taste... kind regards martin\n\n"
    },
    {
      "time": "29 Jun 2003 — 2:16pm",
      "content": "Cosmorton is available to buy from [http://www.unionfonts.com](http://web.archive.org/web/20150414225819/http:/www.unionfonts.com/) from tomorrow.\n\n"
    },
    {
      "time": "2 Jul 2003 — 7:18pm",
      "content": "I think maybe a more extreme cut off of the f would even be better. Maybe even leaving it angled upward would keep the letter consistent with the remainder of the alphabet, it could either be a smooth curve or even bend it like the n stems...\n\n"
    },
    {
      "time": "2 Jul 2003 — 7:20pm",
      "content": "I think maybe a more extreme cut off of the f would even be better. Maybe even leaving it angled upward would keep the letter consistent with the remainder of the alphabet, it could either be a smooth curve or even bend it like the n stems...\n\n"
    }
  ]
}
