{
  "id": "38953",
  "title": "(x) Crawford County Independent newspaper nameplate - Holly Script {Patricia}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I’m helping one of the local newspapers with their masthead (and maybe more). The files I’ve been given for the two newspaper names (a merger) are fuzzy eps files. I’d like to find the fonts for these (though it’s possible that one of them was hand lettered, I really doubt it) so that I can recreate them. These are old newspapers from before the dawn of digital typography...I’m anxious to find out if these fonts are available digitally. On behalf of Charley, the editor, and the rest of Crawford County (proudly the poorest county in Wisconsin!), I thank you for your help and expertise!\n\n ![](http://web.archive.org/web/20081203171609im_/http:/www.typophile.com/files/logo_ccIND_4189.jpg)\n\n ![](http://web.archive.org/web/20081203171609im_/http:/www.typophile.com/files/logo_KS_5089.jpg)\n\n [‹ (x) Rönisch Pianos logo - Adobe Caslon {Jan E}](http://web.archive.org/web/20081203171609/http:/www.typophile.com/node/38933 \"Go to previous forum topic\") [Constructed heavy block face in Non-Format design ›](http://web.archive.org/web/20081203171609/http:/www.typophile.com/node/38939 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203171609/http://www.typophile.com/user/18852\" title=\"View user profile.\">Koppa</a>",
  "time": "<br>",
  "uid": "18852",
  "comments": [
    {
      "time": " 9.Nov.2007 8.01am",
      "content": "Crawford County Independent is Holly Script\n\n"
    },
    {
      "time": " 9.Nov.2007 8.02am",
      "content": "link: [http://www.myfonts.com/fonts/urw/holly-script/](http://web.archive.org/web/20081203171609/http:/www.myfonts.com/fonts/urw/holly-script/ \"http://www.myfonts.com/fonts/urw/holly-script/\")\n\n"
    },
    {
      "time": " 9.Nov.2007 8.03am",
      "content": "Number 1 is [Holly Script](http://web.archive.org/web/20081203171609/http:/www.myfonts.com/fonts/urw/holly-script/)\n\n"
    },
    {
      "time": " 9.Nov.2007 8.11am",
      "content": "Mr. Koppa,\n\nI knew right away from the Kickapoo Scout that you had to be from Wisconsin! I canoed that river when I was 13. I’ve also spent some time in La Farge, WI. Which, if my memory serves me correctly, isn’t too far from Viroqua.\n\nWelcome aboard! It’s great to have a fellow Wisconsinite around.\n\nGo Pack!\n\nMark\n\n"
    },
    {
      "time": " 9.Nov.2007 8.24am",
      "content": "Go Pack is right! Not to turn this into a football thread, but I don’t know if any Typophile out there can deny that [the Packers](http://web.archive.org/web/20081203171609/http:/www.packers.com/) have the best looking helmets in the NFL.\n\nYes, La Farge is on the Kickapoo, 16 miles East of Viroqua, and that’s where I’m sitting right now. The Crawford County Independent serves Gays Mills (25 miles South of Viroqua)...you all may have heard about the flood this past August. But we’re a resillient lot, us Kickapoojians. Poor, resillient, and happy.\n\nThanks for the help with the Holly Script, all. What about the Scout? This is so exciting I can hardly stand it.\n\n"
    }
  ]
}
