{
  "id": "38951",
  "title": "Communications Network Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I hope I'm not infringing on any unwritten rule by posting a link to this other site, but I value the input of the creative members of typophile.\n\nI am looking for critque, ideas and possibly entries into a logo design contest that we are hosting on another site.\n\nThe contest is being held at [http://contests.sitepoint.com/contests/4033](http://web.archive.org/web/20131023141126/http:/contests.sitepoint.com/contests/4033).\n\nDetails of our intentions are in the summary and brief.\n\nI've also posted another link [http://scn.ca/SCN\\_Logo\\_Contest/index.html](http://web.archive.org/web/20131023141126/http:/scn.ca/SCN_Logo_Contest/index.html) to our current logo (top) and the recently redesigned logo of our broadcast network. The [SCN\\_Station\\_ID.mp4](http://web.archive.org/web/20131023141126/http:/scn.ca/SCN_Logo_Contest/SCN_Station_ID.mp4) link at the bottom portrays the full effect of our rebrand and how we identify on-air with our viewers.\n\nI would really like to hear some feedback regarding our recent Broadcast Network rebrand.\n\nThanks in advance.\n\n",
  "author": "andrewk",
  "time": "9 Nov 2007 — 6:59am",
  "uid": "23265",
  "comments": [
    {
      "time": "9 Nov 2007 — 7:11am",
      "content": "An agency of the Government of Saskatchewan is holding a contest for a logo and is offering $300?  \nI just heard the premier say he wants the province to get the same consideration other more prominent provinces get from Ottawa, but this seems to strike me as a step backwards in that goal for equal respect.\n\nThe majority of the entries are horrible, as you'd expect from open contests like this.\n\n"
    },
    {
      "time": "9 Nov 2007 — 9:35am",
      "content": "wow that sounds great i can do a whole bunch of work and probably not get paid and even if i do win i'll get much less than half of what i'd charge for a basic identity package\n\nthis is amazing thank you for the opportunity to work for free\n\njust say the magic words \"it can go in your portfolio\" and \"it will bring in other clients\" i'm all over it\n\n"
    },
    {
      "time": "9 Nov 2007 — 9:59am",
      "content": "I think the AIGA says it best:\n\n\"AIGA believes that doing speculative work seriously compromises the quality of work that clients are entitled to and also violates a tacit, long-standing ethical standard in the communication design profession worldwide. AIGA strongly discourages the practice of requesting that design work be produced and submitted on a speculative basis in order to be considered for acceptance on a project.\"\n\nSee also this [lowballers article](http://web.archive.org/web/20131023141126/http:/www.aiga.org/content.cfm/new-challenges-from-the-lowballersand-what-to-do), which gives more insight into the respect our profession deserves, though focusing on a different situation.\n\nPlease know and respect your audience's views before bringing something like this to the table.\n\n"
    },
    {
      "time": "9 Nov 2007 — 11:13am",
      "content": "\"logo design contest\"\n\nLogo design contests produce crap results for the client, and no benefit to those that enter.\n\n"
    },
    {
      "time": "9 Nov 2007 — 12:35pm",
      "content": "Agree.\n\n"
    },
    {
      "time": "9 Nov 2007 — 3:41pm",
      "content": "I think I would start over with all the logos and your website. I would have a hard time getting inspired with the current website. It shouldn't be hard to find a designer who could handle the whole job. Find someone whose work you like and be prepared to pay them. Maybe you could find a local design firm who would do it at a discount in exchange for on-air and website promotion. I see shows on PBS that say \"This program is brought to you by the Cheryl and Henry La-dee-dah Foundation\". Maybe you could make some kind of exchange that way. Then your station and the designer would get something of real value.\n\nSharon\n\n"
    },
    {
      "time": "10 Nov 2007 — 7:36am",
      "content": "Imagine a hospital where anybody could enter a contest to diagnose a patient, and the one who was right would win a prize. No truly qualified doctor would ever enter because it would not be worth their time, the patient would most likely suffer, and nobody would take the hospital seriously.\n\nObviously this would never happen in real life, but if you replace \"doctor\" with \"designer\", \"patient\" with \"logo\", and \"hospital\" with \"client\", it somehow becomes acceptable? Do the right thing and hire a real designer unless you want your logo to suffer and nobody to take your business seriously.\n\n- Lex\n\n"
    },
    {
      "time": "11 Nov 2007 — 7:49pm",
      "content": "I agree with Lex, 100%\n\nThe entries you have so far look like the clip art collection of an elementary school library. Hire a qualified designer, it's worth it for the dignity of your company.\n\n"
    }
  ]
}
