{
  "id": "38966",
  "title": "a8 music",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi guys,\n\nI’ve been asked to create a logo for a relatively new music promotions company based in the UK. They are currently jazz-based but would like to branch out into other genres in the future. This logo must be used on stationery, web and be printed in small sizes (just the ’a8’ ligature) on spines of CDs.\n\nLet me know what you think!\n\nThanks,  \nRich\n\n ![](http://web.archive.org/web/20081201111717im_/http:/typophile.com/files/a8ligature_3568.jpg)\n\n [‹ Logo for Freelance Light Engineer](http://web.archive.org/web/20081201111717/http:/typophile.com/node/39170 \"Go to previous forum topic\") [Logo for Non Profit Org. ›](http://web.archive.org/web/20081201111717/http:/typophile.com/node/39094 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201111717/http://typophile.com/user/18275\" title=\"View user profile.\">richsmall</a>",
  "time": "<br>",
  "uid": "18275",
  "comments": [
    {
      "time": " 9.Nov.2007 6.01pm",
      "content": "I like it. Very good. I might suggest widening the thin stroke of the bottom join a little. And nudge “music” a little to the left, because it doesn’t look centered to me, at least in the unframed versions.\n\n"
    },
    {
      "time": " 10.Nov.2007 4.07am",
      "content": "As a general rule: Get rid of the gradient unless absolutely necessary.\n\n"
    },
    {
      "time": " 10.Nov.2007 4.18am",
      "content": "I really love this!!! A+++\n\nHere is something you need to be concerned about tho:\n\nLook at the negative space in the logo, you may have to correct the axes a bit especially at the top of the 8 and the a. All the axes should be completely vertical. Stroke smoothing in the lower part of a is necessary too.\n\nGood job!\n\nMikey :-)\n\n"
    },
    {
      "time": " 10.Nov.2007 10.55pm",
      "content": "Interesting use of fonts. - There must be a theory behind the characters used and a reason they are entwined - Consider alternate fonts for the word music they should give strength to and not distract from the theory/concept appearing above them. The current selection for music does not portray the seriousness of the logotype above it. Consider the maturity of the ligature and find a way to bring that maturity into the word music making them a stronger unit. —— versonova\n\n"
    },
    {
      "time": " 12.Nov.2007 10.07am",
      "content": "First post here, hi.  \nLike your “a8”-ligature, very elegant.  \nHere is another “a8”-ligature. Hope you find it interesting.\n\n ![](http://web.archive.org/web/20081201111717im_/http:/typophile.com/files/a8_4261.gif)\n\n"
    },
    {
      "time": " 12.Nov.2007 1.07pm",
      "content": "It looks nice, Bjorn, but that’s not a ligature, because “ligature” — from Latin “to be connected” — is only when two or more letters get connected — as opposed to “intertwined” or “melted” together.\n\n"
    },
    {
      "time": " 12.Nov.2007 1.38pm",
      "content": "very smart Rich!\n\nI’ve looked at it for 5 minutes and it’s totally grown on me. if i cast my mind back 4 minutes and 50 seconds i’d have said that the 8 should be dropped down just slightly to give the vertical stroke of the “a” a chance to descend a touch further before becoming the bottom-most stroke of the 8. the “a” just looked a little disempowered to me at first.\n\nbut that was my first impression. other than that, i love it.\n\ni also respect what versonova said, but i also know when you fall in love with a concept it can be really hard to listen to others!!\n\nnice work  \nPaul\n\n"
    },
    {
      "time": " 12.Nov.2007 2.40pm",
      "content": "<cite>It looks nice, Bjorn, but that’s not a ligature, because “ligature” — from Latin “to be connected” — is only when two or more letters get connected — as opposed to “intertwined” or “melted” together.</cite>\n\nSorry, I did not know that.\n\n"
    },
    {
      "time": " 18.Nov.2007 8.41am",
      "content": "Your current ’a8’ ligatures look quite forceful.  \nThis can be a great logo, if you play a little bit more.\n\nAnd in your second entry, I saw ’8A’ at the first glance.\n\n"
    }
  ]
}
