{
  "id": "3897",
  "title": "Sange",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is a remix of a blackletter typeface that I designed for a clients holiday card. Just curious what you all thought of it.\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20131017073240im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">Sange in SWF format<br><a href=\"http://web.archive.org/web/20131017073240/http:/www.typophile.com/forums/messages/29/sange.swf\"><b>sange.swf</b></a> (53 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\> \n",
  "author": "Corey Holms",
  "time": "26 Nov 2002 — 11:27am",
  "uid": "569",
  "comments": [
    {
      "time": "26 Nov 2002 — 12:16pm",
      "content": "This is fun. Odd, disconcerting and fun.\n\n"
    },
    {
      "time": "26 Nov 2002 — 8:03pm",
      "content": "today i was in a bookstore looking at stuff like \"extreme type\", etc. it seemed like all the wacky stuff had been done, and then this. it's great to be surprised once in awhile. the mix of bitmap and blackface is one i haven't seen before (anyone else?). very cool. was there a wry joke behind it? is it a friendly poke at blackletter or bitmaps, or just a crazy thought you had? if only we had those kind of thoughts more often.\n\n"
    },
    {
      "time": "26 Nov 2002 — 11:08pm",
      "content": "Seen something like it at [yipyop.com](http://yipyop.com),   \nbut this is truly original. Nice, Mr. Holms.\n\n"
    },
    {
      "time": "27 Nov 2002 — 9:58am",
      "content": "Thanks for the compliments! I appreciate it.   \nMy main client is a vinatge haute couture boutique. I have always felt that he deals in anachronisms, it's high fashion for now, but all of it is 30 to 40 years old. So I try to accomodate that vision whenever I do a custom typeface for them. My first typeface I ever designed was for this client and it was a cross of Stanley Kubric 2001 computer screen OS type with Viennese Succession typographic layouts - it was very cool and I have always tried to recapture that excitement in the following years. I usually do one typeface a year for them.   \n   \nThis one was designed for the holiday card and I wanted it to have that same feeling, somewhat comfortable and been there before, but seen slightly differently. Judging from your comments, I have succeeded.   \n   \nAgain, thanks!\n\n"
    }
  ]
}
