{
  "id": "38970",
  "title": "Windows font -\\>\\> Mac Font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am switching from PC to Mac and there are a few fonts that I want to take with me. What is the best program that I could buy that would convert the fonts?\n\n",
  "author": "Tom Cannon",
  "time": "9 Nov 2007 — 6:15pm",
  "uid": "1739",
  "comments": [
    {
      "time": "9 Nov 2007 — 6:23pm",
      "content": "The fonts on your PC will almost certainly work on the Mac too, no conversion necessary, especially if they're in TrueType or OpenType format. If that's not the case, I remember using [CrossFont](http://web.archive.org/web/20131023141608/http:/www.asy.com/scrcf.htm) back in the day, but there may be something better out there now.\n\n"
    },
    {
      "time": "9 Nov 2007 — 7:42pm",
      "content": "[TransType](http://web.archive.org/web/20131023141608/http:/www.fontlab.com/cgibin/t.cgi?a=310911&e=font-converter/transtype/) is the finest converter. But if you want to keep legal, you should check the EULAs for your fonts. Most foundries don't allow conversions. You can also ask the source retailer to convert the fonts for you.\n\n"
    },
    {
      "time": "10 Nov 2007 — 12:01am",
      "content": "And PostScript Type1 fonts can be used with the Adobe apps if you put them in one of the Adobe font directories.\n\n"
    },
    {
      "time": "10 Nov 2007 — 9:10am",
      "content": "There was once a freeware utility called TT Converter that would convert Windows .TTF files into MacOS 9 TrueType suitcases (sometimes taking system-crashing corruption with them). Under MacOS X that's no longer necessary. TTF files _are supposed to_ work natively. A few of them just won't, but they may have been technically flawed to begin with.\n\nFor the PostScript fonts, yeah, you will have to go with one of the above suggestions, or maybe open the fonts in [FontForge](http://web.archive.org/web/20131023141608/http:/fontforge.sf.net/) and save them out to a Mac usable format.\n\n"
    }
  ]
}
