{
  "id": "38978",
  "title": "Bold How-To",
  "forum": "Home",
  "tags": [
    "bold",
    "family",
    "fontlab",
    "interpolation",
    "type",
    "weight"
  ],
  "content": "**[Indices](http://web.archive.org/web/20140801133059/http:/typophile.com/wiki/Indices) : [How-To](http://web.archive.org/web/20140801133059/http:/typophile.com/wiki/How-To) : FontLab Interpolation Tutorial**\n\nMost discussions of methods to make bold letters use sans serif letters as an example. Since one of the great virtues of FontLab interpolation is that it preserves curve quality and character, I decided to use a serif example that includes curved stems and very irregular forms: Adobe Jenson Pro.\n\nThe first thing to do is to put the original outline in the mask layer (default Ctrl+M on Windows). During interpolation, FontLab will display both the result of everything you do and the original state, but having the initial glyph shape in the mask allows you to maintain a visual reference through multiple interpolation passes.\n\nThe interpolation tool works with both PS and TT outlines. In PS outline mode, you can only touch on-curve nodes with the tool, but the position of off-curve control handles will be interpolated relative to touched nodes. In TT outline mode, you can touch both on- and off-curve points.\n\n ![](http://web.archive.org/web/20140801133059im_/http:/typophile.com/files/19233_4221.gif)\n  \n1. Here is the lowercase n from Adobe Jenson Pro Regular. The red arrow pointing to the toolbar above indicates the Interpolate tool. Click on this to activate the tool, or use the hotkey (default Ctrl+Alt+P on Windows).\n\n ![](http://web.archive.org/web/20140801133059im_/http:/typophile.com/files/19234_6409.gif)\n  \n2. When the tool is active, you can click and drag any point. I recommend adjusting a glyph in two passes: one x-direction and one y-direction. You can hold down Shift while dragging to constrain direction. The FontLab measurement bar will tell you how many units you are dragging and, if not constrained, at what angle. When you release a touched point, FontLab will display a preview of the result of the interpolation as a grey line. Note that when you move only one point, the grey preview shows the entire glyph shifted: this is because every untouched point has been moved relative to the first touched point. In the illustration, you can see how I have laterally moved five points to make the stems bolder. The grey outline shows the result of these movements. You should try to touch the minimum number of points necessary to achieve your aims, this allows FontLab to interpolate all the others and to preserve curve character even when curves are stretched or compressed.\n\n ![](http://web.archive.org/web/20140801133059im_/http:/typophile.com/files/19235_4500.gif)\n  \n3. As well as clicking and dragging points, you can specify relative or fixed positions for points by opening the Set Link Destination dialogue (default Ctrl+Click on a point on Windows). I use this most of the time.\n\n ![](http://web.archive.org/web/20140801133059im_/http:/typophile.com/files/19236_6701.gif)\n  \n4. The result of the first, x-direction pass.\n\n ![](http://web.archive.org/web/20140801133059im_/http:/typophile.com/files/19237_4034.gif)\n  \n5. In the second pass, make y-direction adjustments. In a Latin typeface, the y-direction adjustments may not be as regularised as the x-direction. For example, to increase the vertical stem weights as shown above, each touched point was moved 20 units. In the y-direction, I try to make optical compensations as I go. For example, the top of the main curve is shifted up 7 units, but the point in the crotch is raised only 3 unit, because I want the connection to the stem to remain relatively light. I've also used this pass to not only increase the weight of the top serif, but also to drop its tip slightly so that the diagonal is closer to that of the original outline. Note the dots with circular patterns around them, e.g. halfway up the left stem, these are points that have been touched but not moved. It is possible to fix a point in this way, and because it has been touched other points between it and the next touched point will be interpolated. This is very useful, but you need to be very careful not to touch any point that you want to be interpolated; if you do, you will have to cancel the interpolate session and start again.\n\n ![](http://web.archive.org/web/20140801133059im_/http:/typophile.com/files/19238_6020.gif)\n  \n6. The result of the second, y-direction pass. At this point I would check the width and, if it needs adjustment, use the interpolate tool again to shift the stems further apart. I would also make any other adjustments that I have not attempted during interpolation, such as shortening the inner serifs slightly. That top serif also needs attention. \n\nNote that you can touch a point as many times as you want within a single interpolate session, so if you are not happy with where you move it, you can move it again. All relative positioning is relative to the initial position.\n\n[Read the full Typophile thread »](http://web.archive.org/web/20140801133059/http:/typophile.com/node/1753)\n\n",
  "author": "Miguel Sousa",
  "time": "10 Nov 2007 — 10:44am",
  "uid": "1844",
  "comments": [

  ]
}
