{
  "id": "38975",
  "title": "Helvetica neutral?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone,\n\nI am doing my dissertation on Helvetica and would be ever greatful if you could answer a few quetions, I only need a few words so it shouldn't take long!\n\n1. Which 3 words would you use to describe Helvetica?\n\n2. Do you have any emotional response to Helvetica and its uses?\n\n3. In your opinion, is Helvetica ‘neutral’?\n\nMark\n\n",
  "author": "<a href=\"/web/20120118201655/http://typophile.com/user/23796\" title=\"View user profile.\">love helvetica ...</a>",
  "time": "<br>",
  "uid": "23796",
  "comments": [
    {
      "time": "",
      "content": "1. Strong, Universal, & Sexy\n\n2. Yes, I love it. I love seeing it. It feels high fashion and classic to me. Many high end european furniture houses use Helvetica for their identity: Edra, Cappelini, & Knoll.\n\n3. Not absolutely. Univers is what I consider absolutely 100% neutral- cold- emotionless type. Helvetica does have some warmth, dare I say, quirkiness. Or perhaps instead of those qualities- attitude. She doesn't exactly wear her heart on her sleeve. If Helvetica was a woman she would certainly be one of Helmut Newton's amazons.\n\nMikey :-)\n\n"
    },
    {
      "time": "",
      "content": "Thankyou very much Mikey for your quick response! fantastic answers\n\n"
    },
    {
      "time": "",
      "content": "1. Commanding, structured, demandin  \n2. I get all warm and squooshy when I see the heavy weights on big trucks.  \n3. Not remotely. The design is too striking, and the cultural connections (big business, big government) are to strong too ignore.\n\n"
    },
    {
      "time": "",
      "content": "1. Ubiquitous, played-out, boring\n\n2. What, again? Does anyone besides obsessive typophiles know of another sans?\n\n3. I thought so when I got hold of it on my first Macintosh in 1989. Now I swear I hear only of people loving it or hating it. And with the fanfare brought on by the movie, not so many who hate it anymore.\n\nStephen Tiano, Book Designer, Page Compositor & Layout Artist\n\n"
    },
    {
      "time": "",
      "content": "1. Any medium? profitable!\\*\n\n2. Yes\n\n3. Yes, but I agree that Univers is more neutral, and Kai Bernau's \"Neutral\" perhaps as well.\n\n\\* See, even in film it can be a success. No matter what the medium (buttons, fonts, fun t-shirts, etc.), Helvetica will bring in monetary rewards.\n\n"
    },
    {
      "time": "",
      "content": "\\>1. Any medium? profitable!\\*\n\nLinotype should errect a huge display atop the factory (the gleaming monument of steel and glass we saw in the movie) which displays the total wide-world sales of Helvetica in euros – just make sure you pick a font other than Helvetica so people can read the numerals.\n\n"
    },
    {
      "time": "",
      "content": "You are very welcome :-) Mikey\n\n"
    },
    {
      "time": "",
      "content": "1. Stale, overused, unreadable in text  \n2. a. Generally, I groan with pain and resignation. b. When used very well, I am impressed by the designer's ability to bring out the best in the typeface. c. On screen, Arial, its twin, is ok thanks to extensive hinting, but not great. d. In printed text, it makes me want to barf.  \n3. No.\n\n"
    },
    {
      "time": "",
      "content": "1. overused, iconic, generic\n\n2. When I see Helvetica really being used for its finer qualities - and not because the designer couldn't think of another font to use, or because it comes bundled with the software, or because they want to be Vignelli - I am impressed. Most of the time it barely registers. I didn't realize until I saw the movie just how ubiquitous it is.\n\n3. I think it is fairly neutral. The reason people have such strong reactions to it has more to do with its use/overuse than with the font itself. It is overused because it is neutral.\n\n"
    },
    {
      "time": "",
      "content": "Even today, when used for display, captioning/titles, and tabular data, and if manually kerned with some tighter tracking--Helvetica/Helvetica Neue looks contemporary, dynamic and hip. Just because the masses overuse it because of Apple and Microsoft is no fault of the typeface.\n\nIn fact, for most graphic designers, aren't Helvetica Neue and Franklin Gothic STILL the first two grotesk sans you turn to? Why not, they get the job done. Univers is too truly antiseptic, Folio is quirky, Akzidenz Grotesk is authentic but less mannered than the big two, News Gothic and Trade Gothic are thin and wimpy.\n\nSo my words for Helvetica I guess are 1. dynamic, 2. flexible, and (unfortunately), 3. corporate.\n\n"
    },
    {
      "time": "",
      "content": "Hell. Vet. Ick.\n\n"
    },
    {
      "time": "",
      "content": "Thankyou everyone for your thorough answers. This has been a great help!\n\nJust in case anybody is interested I'm producing a book that questions the supposed neutrality of Switzerland and Helvetica as both on the surface appear the epitomy of neutrality, but when investigated they are anything but. I am questioning how a typeface can be seen as neutral when there are such un-neutral, contrasting opinions on it. I see Helvetica as having a personality that surrounds itself formed from the nature in which it has been used over the years that has nothing to do with the actual design of the typeface.\n\nYour quotes will be used to show the debate it causes\n\n"
    },
    {
      "time": "",
      "content": "<cite>supposed neutrality of Switzerland</cite>\n\ntwo words: Bergier Commission\n\nFrom a frontline article on the subject:  \nIn December 1999 the Commission issued its conclusions. It stated that Swiss officials during World War II refused entry to thousands of Jewish refugees even after it was known that they faced almost certain death in Nazi Germany. The Commission's historians also said there was no evidence that accepting many more asylum seekers would have put neutral Switzerland in danger of Nazi invasion or \"caused insurmountable economic difficulties.\" The Commission cited anti-Semitism and a deep-seated fear of foreigners in Switzerland as the reasons authorities refused asylum to more than 24,000 Jews.\n\nmore here: [http://www.pbs.org/wgbh/pages/frontline/shows/nazis/etc/status.html](http://web.archive.org/web/20120118201655/http:/www.pbs.org/wgbh/pages/frontline/shows/nazis/etc/status.html \"http://www.pbs.org/wgbh/pages/frontline/shows/nazis/etc/status.html\")\n\nYour book sounds interesting.\n\n"
    },
    {
      "time": "",
      "content": "\\>I am doing my dissertation on Helvetica and would be ever greatful if you could answer a few quetions\n\n...later...\n\n\\>Just in case anybody is interested I’m producing a book\n\n\\>Your quotes will be used to show the debate it causes\n\nYikes! Some up-front honesty might have been nice here - or perhaps the dissertation ruse all part of your social experiment?\n\n\\>supposed neutrality of Switzerland and Helvetica\n\nIn that case Dan and my jokes around the cold-hard-cash being generated by Helvetica should fit in.\n\n"
    },
    {
      "time": "",
      "content": "If you really want to make your thesis worthwhile, you should get responses from people who aren’t typomaniacs. Typophiles users could debate like this about any typeface out there, so our opinions on Helvetica don’t mean a whole lot when it comes to the way most people would react to a typeface.\n\n"
    },
    {
      "time": "",
      "content": "1. It depends on the weight, but for the regular: sterile, serious, unemotional.\n\n2. It depends on the usage, when it's well used I'm usually bored, but most of the time I see Helvetica is use it has been mis-used in a situation for which is it not well suited (e.g. wayfinding signage, small print in packaging, in which cases I'm just mildly irritated. (I'd be more irked, but it's so ubiquitous that I'd get worn out if I had much reaction.)\n\n3. Heck no! Helvetica is not \"neutral.\" Each of the adjectives I use to describe it are at one end of a spectrum, not in the middle. I'll bet that's true for most other folks' adjectives, too.\n\n(I carefully did all my answers before reading what anybody else wrote, btw.)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "1. Grotesque, Plagiarism, Myth.  \n2. Loathing.  \n3. No.\n\n"
    },
    {
      "time": "",
      "content": "1. Style, Bold, Space.  \n2. When its used well its great. Most of the time its not.  \n3. not really, but a lot more than other typefaces.\n\n"
    },
    {
      "time": "",
      "content": "_Hell. Vet. Ick._\n\nyou forgot the \"Ugh.\" at the end.\n\n1 default, uncreative, plain.  \n2 depends on how it is used.  \n3 no.\n\n"
    },
    {
      "time": "",
      "content": "Sii - It is for my dissertation! but we are allowed to choose between the full 10,000 word essay or a 7,500 word report on a project. So I'm doing a project on Helvetica with the book as a final outcome to report on. Sorry for the misunderstanding\n\n"
    },
    {
      "time": "",
      "content": "Reply to James Puckett - I am interseted in the reaction and debate it causes in the design community and I feel Helvetica has one of the strongest love / hate relationships with designers, I think common folk would not recognise Helvetica from most other sans serif's and not have particular strong opinions, which is what I'm basing the project on.\n\n"
    },
    {
      "time": "",
      "content": "\\>So I’m doing a project on Helvetica with the book as a final outcome to report on.\n\nMakes sense, sorry for misinterpreting the book angle - although a real book would be cool too ;-)\n\n"
    },
    {
      "time": "",
      "content": "Don't know if you've seen it, but the \"Standing on the shoulders of giants\" issue of Emigre magazine is essential reading for any dissertation on Helvetica.\n\n"
    },
    {
      "time": "",
      "content": "1) Safe, dull, Zzzzz...\n\n2) Melancholia\n\n3) When used correctly.\n\n"
    },
    {
      "time": "",
      "content": "1. It all depends ... upon how it is being used.  \n2. It all depends upon how it is being used.  \n3. Most of the time, yes, but again it all depends upon how it is being used.\n\nI guess I'm an antique and/or dinosaur because I still see it being used in ways that I think works.\n\n"
    },
    {
      "time": "",
      "content": "1. Safe, my employers corporate font, pervasive.\n\n2. \"Helvetica again - boring\". I am forced to use Helvetica a lot in my job but if it we're up to me would select something with more personality.\n\n3. No.\n\n"
    },
    {
      "time": "",
      "content": "1. Safe, my employers corporate font, pervasive.\n\n2. \"Helvetica again - boring\". I am forced to use Helvetica a lot in my job but if it we're up to me would select something with more personality.\n\n3. No.\n\n"
    },
    {
      "time": "",
      "content": "Nick Shinn - Thats a very good suggestion, I have that issue and it is probably the best resource I have, even more so than the film.\n\n"
    },
    {
      "time": "",
      "content": "Sii - sorry I put it in such a confusing way!\n\nI am producing a real book as a final outcome but then have to write the dissertation on the project and report on the final piece I produced.\n\n"
    },
    {
      "time": "",
      "content": "1. Ubiquitous, leaden, dull\n\n2. Mostly no.\n\n3. No way.\n\n"
    },
    {
      "time": "",
      "content": "I see you got more response here Mark, so I won't repost my answers from the other forum.\n\n"
    },
    {
      "time": "",
      "content": "thinking on this a bit more, it seems to me that Helvetica was designed with a subliminal message built into it, which is applied to anything that it is used on. that message is: \"buy me (or suffer the consequences of being uncool)\"  \nalthough this may be a case of chicken & egg, where it is hard to distinguish whether this is really built into the face or became attached to the face later by association.  \nthis is the reason why i believe that Hevetica cannot be be deemed as neutral, even if at some point in time it may have been (which i have my doubts on).\n\n"
    },
    {
      "time": "",
      "content": "I like your insight here, Paul. I think there was, and maybe still is, something of an aesthetic snob appeal in the 'international style', both in type and in architecture. It wasn't sold just as an appealing new style. It was that everything else had to be 'wrong' and inferior. Tom Wolfe satirized the movement in architecture in his [From the Bauhaus to Our House](http://web.archive.org/web/20120118201655/http:/www.amazon.com/Bauhaus-Our-House-Tom-Wolfe/dp/055338063X/ref=pd_bbs_7?ie=UTF8&s=books&qid=1194981965&sr=8-7). One of his points was that people were able to sell buildings that people never liked, because the designers and sellers appealed to snobbery. By liking the designs showed you one of the elect, a superior being.\n\n"
    },
    {
      "time": "",
      "content": "I should add that it would be handy to actually define \"neutral\"... to me I think of that as being unobtrusive and lacking flavor (which may sound negative, but I don't mean it to be). Franklin Gothic is more neutral than Helvetica. Frutiger is more neutral than Franklin Gothic, and Myriad is more neutral than Frutiger.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Quick Question, might seem a bit silly. Why when discussing neutrality of type do I never hear anyone bring up SERIF FACES? Probably an obvious reason, like the archaic use of such of these type specimens or something like that, but please could someone enlighten me?\n\nThanks.\n\n"
    },
    {
      "time": "",
      "content": "@Wesley.Bancroft  \nYes, good question! What \"serifish\" face you have in your mind?\n\n@Helvetica  \nHow boring is a dissertation on Helvetica, come on, nearly everything is said, felt, shown, etc. about this (obscure) phenomenon called H.\n\nPS It's nearly \"Amtsgrotesk\" to me. Or it looked at me from a plumber's car (place:germany) 10-15 years ago. Nothing dangerous or malicious about it, it's only a typeface. But everything must develop further. So give Helvetica a long weekend.\n\n"
    },
    {
      "time": "",
      "content": "To Poms:\n\nI did not really have a specific serif typeface in mind, I am more curious as to why no Serif faces are brought up. I have been long aware of Kai Bernau’s “Neutral” typeface studies, and they got me to wondering?... why has not anyone done a study on the neutrality of Serif typefaces. Maybe there already is or maybe I will do it. :)\n\nAlso, I think I came up with a idea as to why Serif faces are not discussed as neutral: the majority of the time they are not used for display purposes... I guess?\n\nThanks.\n\n"
    },
    {
      "time": "",
      "content": "Serif faces are used all the time for display purposes. I don't think the concept of neutrality only applies to display fonts either. I guess it could be argued that sans fonts, being stripped down, convey more of a \"neutral\" air. But the point of typographic \"neutrality\", as I understand it, is that the font does not draw attention to itself, and there are plenty of serif fonts that this idea could apply to. Times Roman for one. Minion for another. Janson, Baskerville, even some Caslons are very understated.\n\n"
    },
    {
      "time": "",
      "content": "To Pattyfab:\n\nI guess I meant display in the regard to Corporate Identity, Logo Design, Environmental Graphics, stuff like that. Not necessarily confined to print specifically or the typographic term \"display font\".\n\nAlso, neutrality does apply to Times New Roman (which I love), but again is that only due to it's frequent use?\n\nSaturation always does something to ideas. Why?\n\n"
    },
    {
      "time": "",
      "content": "And I will still contend that there are plenty of corporate identities, logos, and environmental graphics that feature serif fonts. I'm on my way out the door so I can't dig them up for you right now. But it's true that sans serif fonts do convey more of a \"corporate\" feel and are in more common use. Ironically since the sans is probably more \"innovative\" and the serif more \"classic\" ergo neutral?\n\nBut this thread is about neutralilty, not in any particular usage. Neutrality can influence what font you choose for a text book or information graphics as much as for signage or corporate identity. A script can even seem neutral in the right situation.\n\n"
    },
    {
      "time": "",
      "content": "For serifs, I'd say Utopia and Stone Serif are pretty darn neutral. Officina Serif, too. Of course, boring might be equally descriptive.....\n\n"
    },
    {
      "time": "",
      "content": "That's funny, I think of Stone Serif and Officina Serif as both having a fair bit of flavor, much more than Utopia or Times.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "And now that Wesley has edited his post... the five comments above it no longer make any sense chronologically.\n\n"
    }
  ]
}
