{
  "id": "38984",
  "title": "Any brains available for picking?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hope this is the right forum.\n\nWhile I like all the things that go with the concept of typography, I much prefer just looking at typefaces by themselves. In groups of thousands, sad to say.\n\nI especially love sans typefaces, leaning more toward those appropriate for fair amounts of text. That said, I’ve seen a crapload of them, which means I’ve gawked at everything from Agro Sans to the font “Protocol” appearing in something published by the Univ. of Minnesota and featuring an interview with Peter Bil´ak.\n\nSo is there anyone here who could direct me toward some of the more obscure sans faces, or perhaps those unique to businesses not in the Fortune 500? I have literally spent years trudging through the web on this endless search, many times ending with me going “oh my, look at that! That’s beautiful.” Which as I just realized makes me sound like Captain Moron because I probably could have been looking in the same way for women.\n\n(As he snaps out of it ...) Anyway, I would greatly appreciate it - I realize no one knows whether I’ve seen certain fonts or not, which is why I tried to create a pseudo-boundary by saying I’ve seen a god-awful lot of them. The most recent being one called “Nexus” (not FF Nexus) used by Bus Atha Cliath in Ireland, if that’s any help.\n\n [‹ The handwriting is on the Wall (Street Journal)](http://web.archive.org/web/20081203115517/http:/www.typophile.com/node/39124 \"Go to previous forum topic\") [Upcoming book/type/print events in Vancouver ›](http://web.archive.org/web/20081203115517/http:/www.typophile.com/node/38821 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203115517/http://www.typophile.com/user/15771\" title=\"View user profile.\">Curioustype</a>",
  "time": "<br>",
  "uid": "15771",
  "comments": [
    {
      "time": " 10.Nov.2007 8.15pm",
      "content": "This is possibly the oddest post I have ever read on Typophile.\n\n"
    },
    {
      "time": " 10.Nov.2007 11.22pm",
      "content": "I totally understand Christopher. There is a lot of corporate type out there that’s beautiful but exclusive.\n\nHave a gander at [http://www.typebase.com](http://web.archive.org/web/20081203115517/http:/www.typebase.com/ \"http://www.typebase.com\") and open every single link in tabs, save the tabs, and refer back to the tabs. Go through every link thoroughly every now and then. Safari lets you open many links at a time. You will discover many gems.\n\nFor even more obscure stuff: the best resource ever!\n\n[http://cg.scs.carleton.ca/~luc/fonts.html](http://web.archive.org/web/20081203115517/http:/cg.scs.carleton.ca/~luc/fonts.html \"http://cg.scs.carleton.ca/~luc/fonts.html\")\n\nMyfonts.com has the goods too.\n\nHope I helped you.\n\nMikey :-)\n\n"
    },
    {
      "time": " 11.Nov.2007 2.26am",
      "content": "I don’t know about fonts, but yours is the most obscure post I’ve read in a while (lol). Mikey! Thanks for that superultrafabulous link. :)\n\n"
    },
    {
      "time": " 11.Nov.2007 3.16am",
      "content": "Mike, I visited that site ( [www.typebase.com](http://web.archive.org/web/20081203115517/http:/www.typebase.com/ \"www.typebase.com\")) and clicked the first thing I saw (Arion Press). On their main page I saw, _“Just released: The first illustrated edition of T. S. Eliot’s landmark 20th century poem, The Waste Land, with artwork by R. B. Kitaj, and an essay by Helen Vendler.”_ I clicked the photo of the book, but instead of Waste Land I found _Journey Round My Room_, by Xavier de Maistre.\n\nReading about this book I came to this line, _“The initial letters and display type on the title page are Gallia, produced by Lanston Monotype in 1928. This face was chosen because of its striping of thin-thick-thin lines and is printed in rose ink because of the preference of the author for bed-hangings in this color and pattern.”_\n\nThis led me to search out [Gallia](http://web.archive.org/web/20081203115517/http:/www.linotype.com/155925/monotypegallia-family.html) and what a marvelously old and elegant font. While I’ll never be able to splurge for any of these books (or even a fraction of the fonts) I can see I’ll be spending a lot of time on this site goggling and dreaming.\n\n"
    },
    {
      "time": " 11.Nov.2007 9.10am",
      "content": "So, in a nutshell, you’re looking for suggestions on some less popular sans faces. Do you need them for a specific project you’re working on? Here are a few off the top of my head:\n\n[Flama](http://web.archive.org/web/20081203115517/http:/www.vllg.com/Feliciano/Flama/mudTyper+Weights/) Maybe not “obscure” but not used so much in the U.S. as far as I know.\n\n[CP Company](http://web.archive.org/web/20081203115517/http:/www.fsd.it/fonts/cp.htm)\n\n[Wedding Sans](http://web.archive.org/web/20081203115517/http:/www.typecuts.com/fonts.php?kid=2)\n\n[Suitcase Type](http://web.archive.org/web/20081203115517/http:/www.suitcasetype.com/index.php?lmut=en&part=fonts&sub=category&id=1) There are a few faces just released from this guy. Good stuff.\n\n"
    },
    {
      "time": " 11.Nov.2007 11.26am",
      "content": "I kinda made a mistake with the typebase link. It should be [http://www.typebase.com/foundries.html](http://web.archive.org/web/20081203115517/http:/www.typebase.com/foundries.html \"http://www.typebase.com/foundries.html\") This is a more complete list of links to the actual foundries- but that’s not to say that peripheral links won’t get you somewhere intersting too.\n\nMikey :-)\n\nPS... CP Company is getting more and more attention here in the US. Xjet uses CP company for their identity.\n\n"
    },
    {
      "time": " 11.Nov.2007 11.28am",
      "content": "Thanks everyone for the information provided so far; I’ve pretty much seen all of these sites/fonts hundreds of times which is a sad commentary maybe but something I still enjoy nevertheless.\n\nI am not seeking “less-popular” fonts per se, just those hidden gems and treasures that have eluded me. And not for any project ... just to appreciate them. Also, I did see the new Suitcase Type fonts and you’re right, they are quite nice.\n\nPerhaps I could describe a few of the more attractive ones I’ve seen lately:\n\n1.) Technotipo, by Luciano Perondi and Mauro Carichini: I absolutely love this font but only have been able to view its bold weight thus far. See it here: [http://www.molotro.com/tec.html](http://web.archive.org/web/20081203115517/http:/www.molotro.com/tec.html \"http://www.molotro.com/tec.html\")\n\n2.) Tarasu, by Jennifer Lorch, Tronje by Linda Wulf, and Debut by Ruwen Kopp, et. al.: These can be viewed here: [www.vtriad.de/dl/typo\\_wbericht.pdf](http://web.archive.org/web/20081203115517/http:/www.vtriad.de/dl/typo_wbericht.pdf \"www.vtriad.de/dl/typo\\_wbericht.pdf\")\n\n3.) Adressa, by Tibe-T, actual designer unknown: See it here: [www.adressa.no/konsern/rapporter/norsk/pdf/2007/1Kn\\_2007.pdf](http://web.archive.org/web/20081203115517/http:/www.adressa.no/konsern/rapporter/norsk/pdf/2007/1Kn_2007.pdf \"www.adressa.no/konsern/rapporter/norsk/pdf/2007/1Kn\\_2007.pdf\")\n\nAny others like these?\n\n"
    },
    {
      "time": " 14.Nov.2007 9.23pm",
      "content": "Please, in the future, use a more specific title for your topic and try to keep your request more concise. You’ll find that replies will be more numerous and helpful.\n\n"
    }
  ]
}
