{
  "id": "38983",
  "title": "Tallys",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Has anyone used Tallys ( [http://www.josbuivenga.demon.nl/tallys.html](http://web.archive.org/web/20131020092615/http:/www.josbuivenga.demon.nl/tallys.html \"http://www.josbuivenga.demon.nl/tallys.html\"))? Any comments (even if you haven't actually used it)?\n\n",
  "author": "Erik Fleischer",
  "time": "10 Nov 2007 — 4:03pm",
  "uid": "10481",
  "comments": [
    {
      "time": "10 Nov 2007 — 4:56pm",
      "content": "I've not actually used Tallys before; as for a comment all I can say is it certainly doesn't suck.\n\n"
    },
    {
      "time": "10 Nov 2007 — 5:01pm",
      "content": "I like it. I wish it were a complete family but for the price I have no right to complain.\n\n"
    },
    {
      "time": "14 Nov 2007 — 9:25pm",
      "content": "It's interesting how many respectable text faces have popped up in the free font world over the last few weeks. But, like metalfoot says, none of these have true italics, small caps, or even a proper bold, so their usefulness for body copy is limited.\n\n"
    },
    {
      "time": "14 Nov 2007 — 11:26pm",
      "content": "<cite>none of these have true italics, small caps, or even a proper bold</cite>\n\nWhat about [Fontin Sans](http://web.archive.org/web/20131020092615/http:/www.josbuivenga.demon.nl/fontinsans.html)? It has all of these. Well, it’s a sans, but a) one of those that might work quite well as text face (though I haven’t tested it myself) and b) [Fontin Serif](http://web.archive.org/web/20131020092615/http:/exljbris.wordpress.com/2007/03/10/fontin-serif/) will follow someday (not to confuse with the hybrid [Fontin](http://web.archive.org/web/20131020092615/http:/www.josbuivenga.demon.nl/fontin.html)).  \nJos is a crazy Tausendsassa. ;°)\n\n"
    },
    {
      "time": "15 Nov 2007 — 12:17am",
      "content": "Fontin looks like it could be a rare exception. I'll try to give it a decent test soon.\n\n"
    },
    {
      "time": "15 Nov 2007 — 2:34am",
      "content": "Tallys must be regarded more as an experiment. It's quite quirky but I think it has a certain charm. I myself wouldn't use it as a text face.\n\nA few months ago I recieved [this book](http://web.archive.org/web/20131020092615/http:/www.masterkeysystem.de/) which was completely set in Fontin & Fontin Sans. They work very well as text faces. On the same site I found a [pdf](http://web.archive.org/web/20131020092615/http:/www.masterkeysystem.de/pdf/Das%20Master%20Key%20System%20-%20Leseprobe.pdf) sample of Fontin in use (it's not a pdf of the book unfortunately) and also some screens ( [here's one](http://web.archive.org/web/20131020092615/http:/www.masterkeysystem.de/downloads/wp/1024/Gedanke%20ist%20Ursache.jpg)) of Fontin Sans SC in use.\n\n<cite>Jos is a crazy Tausendsassa. ;°)</cite>  \nHad to wiki that, but that's a lot of credit :-)\n\n<cite>Fontin looks like it could be a rare exception. I’ll try to give it a decent test soon.</cite>  \nPlease do and keep me/us posted (if it's ok with Erik, because it's a bit off topic).\n\n"
    },
    {
      "time": "17 Nov 2007 — 2:23pm",
      "content": "Lack of italic, small caps and bold is certainly an issue, but to me Tallys looks less quirky at text sizes than Fontin. That's not to say I don't like Fontin, but if I had to choose one or the other for extended text, I'd go with Tallys.\n\nAnyway, many thanks to Jos for offering such fine typefaces for free.\n\n"
    },
    {
      "time": "17 Nov 2007 — 2:34pm",
      "content": "His site is the first one where I've actually clicked a paypal button and gone through with the donation. Not donating feels almost like stealing the fonts. :)\n\n"
    },
    {
      "time": "17 Nov 2007 — 5:59pm",
      "content": "I started to play with Tallys but, honestly, I got vertigo.\n\n"
    },
    {
      "time": "18 Nov 2007 — 4:12am",
      "content": "@ Erik: I meant quirky more in the way of how the contours are drawn. I never used Tallys at a small text size, but I'll take a look this week to see if I've missed something here :-)\n\n@ Tom: Thanks (again)!\n\n"
    },
    {
      "time": "27 Nov 2007 — 10:36pm",
      "content": "Jos, it's always nice to hear directly from the creator himself. And thanks for the great faces!\n\n"
    }
  ]
}
