{
  "id": "38989",
  "title": "Calgary: November meeting",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "It'll be the meeting that celebrates Lex's birthday. And other stuff could happen too.\n\n ![](http://web.archive.org/web/20131018092652im_/http:/typophile.com/files/5CalTypos4_3973.gif)\n\n",
  "author": "KenBessie",
  "time": "11 Nov 2007 — 8:50am",
  "uid": "13948",
  "comments": [
    {
      "time": "11 Nov 2007 — 10:43am",
      "content": "Is Calgary anti-Bringhurst? Or do you guys think the best thing to come out of BC was the Grizzlies.\n\n"
    },
    {
      "time": "11 Nov 2007 — 11:50am",
      "content": "I just want to see a good collection of reference books. If everyone shows up with their copy of _Elements_, we won't have a lot to talk about. Other than agreeing with each other about how great Bringhurst's book is.\n\nWe probably won't be discussing the Grizzlies.\n\n"
    },
    {
      "time": "11 Nov 2007 — 3:14pm",
      "content": "How Canadian to host this on (American) Thanksgiving eve.\n\n"
    },
    {
      "time": "11 Nov 2007 — 4:35pm",
      "content": "We could always see who has the copy that is the oldest/most dog-eared/autographed/doodled-in/stained-by-wine-or-coffee....\n\n"
    },
    {
      "time": "12 Nov 2007 — 6:34am",
      "content": "\\> Or do you guys think the best thing to come out of BC was the Grizzlies\n\nFor Albertans, the best thing that comes out of BC is a chinook in February.\n\n"
    },
    {
      "time": "12 Nov 2007 — 7:51am",
      "content": "ROFL! Good one, Don!\n\n"
    },
    {
      "time": "12 Nov 2007 — 8:44pm",
      "content": "If you’re concerned about having a topic for debate, I could start out on how I think Bringhurst is a bit overblown. His writing has always tired me out before it has a chance to sink in. That being said, I may have to bring along my copy of “Big Red” as my companion. Mind your beer coasters.\n\n"
    },
    {
      "time": "13 Nov 2007 — 7:56am",
      "content": "I think I'll take _Finer Points_ by Dowding. It is less dog-eared and has fewer coffee stains than Bringhurst. And it doesn't require the rearrangement of beer coasters.\n\n"
    },
    {
      "time": "13 Nov 2007 — 9:39am",
      "content": "I'm wondering if Lex is gonna show up with his dog-eared and coffee stained _www.indentifont.com_?\n\n"
    },
    {
      "time": "13 Nov 2007 — 12:45pm",
      "content": "And since (I hope) no one works in isolation, one could also look at almost anything that speaks to \"design\" as an influence on type and typographical design, if it has influenced one's personal work. ;-)\n\nThat should eliminate multiple copies of Bringhurst....\n\n"
    },
    {
      "time": "19 Nov 2007 — 3:43pm",
      "content": "Mike's contribution:\n\n ![](http://web.archive.org/web/20131018092652im_/http:/typophile.com/files/typeclub_6402.gif)\n\n"
    },
    {
      "time": "19 Nov 2007 — 7:31pm",
      "content": "oooooh, I like that.\n\nI've got some neat stuff in Vancouver, including some of Jim Rimmer's handcast printer's ornaments.\n\n"
    },
    {
      "time": "24 Nov 2007 — 10:15am",
      "content": " **Summary**\n\n1. The Kensington Pub was very crowded and we were unable to get a table immediately. So there was some standing around and discussion of how crowded the K-Pub was. Linda brought treasures from the Wayzgoose in Vancouver, which were greatly admired from a standing perspective. And then a group of non-type-speaking people left, freeing their table for us. Yeah.\n\n2. Listen up: we're gonna change venues for the December meeting. We don't want to fight the Christmas-shopping crowd getting liqueured up at the K-Pub next month, so we're going to meet at Julio's Barrio, a scant half-block away from K-Pub. Linda has booked the entire second floor for the Calgary Typos. So we can have a Christmas-type type meeting. Bring friends. Bring baggage. Spread out. (If Veer/Corbis wants to have a Christmas party, we'll donate a corner for you. You can even set up a barrier so our type discussion won't interfere with your type discussion.)\n\n3. Lex reported that his laptop's battery ran out and then died in the middle of Geophysics class. We were all sad. For a moment.\n\n4. Derek brought along a copy of _Uncommon Vision_ by Peter Ciccariello. (Not sure if it was for Show & Tell or \"Bring your favourite type book\", they sort of got intermingled.) In Derek's words, the artist \"folded type into each abstract landscape\". I haven't googled it yet, but it's a lovely book and well worth a search.\n\n5. From Linda, thanks to Jim Rimmer for his hospitality. And she isn't even sorry for stretching the half-hour appointment into an hour-and-a-half.\n\n"
    },
    {
      "time": "24 Nov 2007 — 10:56am",
      "content": "And for those who didn't see the links on my blog, there are [pictures from the Wayzgoose](http://web.archive.org/web/20131018092652/http:/www.flickr.com/photos/alcuinsociety/sets/72157603225524485/) and a few shots from our visit to [Jim's studio](http://web.archive.org/web/20131018092652/http:/flickr.com/photos/lasquetipress/sets/72157603245758702/).\n\n"
    }
  ]
}
