{
  "id": "38990",
  "title": "Moving to Europe (likely Athens)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My partner and I have been discussing moving out of Toronto for about a year now and we have decided moving somewhere in Europe would be ideal. He was born in Greece and speaks the language and has a lot of cultural ties there still so really wants to move back to Athens. I was born in Canada and my Greek is not -that- good and although this wouldn’t be happening for at least another year and I would have time to work on it, is there really any chance of finding work in the design industry there if I don’t speak the language fluently? Is it like that all over Europe?\n\nMy partner and I both work as Art Directors in interactive departments of advertising agencies.\n\nI know there are a lot of European designers here who could maybe provide some insights for me. I really don’t want to move to London.\n\n [‹ Infringement? Liability? Creating fonts from published Calligraphy](http://web.archive.org/web/20080507180934/http:/www.typophile.com/node/39150 \"Go to previous forum topic\") [Use character map to access alternate glyph ›](http://web.archive.org/web/20080507180934/http:/www.typophile.com/node/39184 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080507180934/http://www.typophile.com/user/17709\" title=\"View user profile.\">HaleyFiege</a>",
  "time": "<br>",
  "uid": "17709",
  "comments": [
    {
      "time": " 11.Nov.2007 10.08am",
      "content": "Have you considered Berlin? That’s where I’d go if I was going to cross the pond.\n\n"
    },
    {
      "time": " 11.Nov.2007 10.39am",
      "content": "There are plenty of type and typography folks in Greece, check-down the participants of the recent ICTVC’s. I’m not sure about the climate for typography though, Klimis (ICTVC organizer) has relocated to Cyprus (from Thessa), and I’m sure Gerry has some views on this too.\n\nCheers, Si\n\n"
    },
    {
      "time": " 11.Nov.2007 10.40am",
      "content": "Berlin is on the list but farther down because it has cold winters and no beaches. And although I do have a German last name, I don’t speak any German. But it’s an amazing city for sure.\n\n"
    },
    {
      "time": " 11.Nov.2007 11.06am",
      "content": "The whole year it’s cold here in Germany, haha. I should know it.  \nBut still there’re plenty of great design agencies in Europe.  \nI am not too sure about Greece but i guess it’s worth a try.\n\nJust curious, why yopu concider your last name as a German name?\n\n"
    },
    {
      "time": " 11.Nov.2007 11.09am",
      "content": "I was born in Canada but the rest of my family is German. I actually don’t know a lot about it, is it not a German last name?\n\n"
    },
    {
      "time": " 11.Nov.2007 11.33am",
      "content": "[hmmmm...](http://web.archive.org/web/20080507180934/http:/smartmarriages.com/stanley.men.anyway.html)\n\n"
    },
    {
      "time": " 11.Nov.2007 11.37am",
      "content": "Athens is a marvelous, crowded, dirty city with millions of feral cats. I used to spend summers there producing a Greek band.\n\nFor food it would be my first choice, for living conditions it would be pretty far down the list of European cities.\n\nBest of luck!\n\npbc\n\n"
    },
    {
      "time": " 11.Nov.2007 11.43am",
      "content": "I can’t help but think of the wife of a co-worker who took lessons to try to better understand the language of her husband to be. Interestingly enough several other women in the class were learning the language for the same reason, and one asked the instructor if she had any advice. Of course the advice was “don’t marry an (insert husband-to-be’s ethnic background here)”. ;-)\n\n"
    },
    {
      "time": " 11.Nov.2007 12.00pm",
      "content": "Haha actually if I married my partner I’d automatically get a Greek citizenship. Thats last resort for us though. His sister got married a few months ago and the relatives were basically planning our wedding at the same time. “When you get married we’ll have 2 lambs!” “When you get married the colours will be pink and white!”\n\nI’ve been told that European countries look at North American Degrees rather highly. Could I use this as leverage even though I don’t speak another language fluently.\n\nPaul is there good internet connections in Athens?\n\n"
    },
    {
      "time": " 11.Nov.2007 2.38pm",
      "content": "You don’t need to speak German in Berlin, everyone there speaks English. But you’re right, the weather is terrible. However there are cheap flights now in Europe if you need to get somewhere beachy and warm.\n\nLisbon is also lovely. As is Rome.\n\n"
    },
    {
      "time": " 11.Nov.2007 2.59pm",
      "content": "<cite>the weather is terrible</cite>\n\nAlas, this is not some nice mottled pattern paper but rather my daunting window view – yesterday the first snow fell:\n\n ![](http://web.archive.org/web/20080507180934im_/http:/www.typophile.com/files/berlin-sky_6321.jpg)\n  \n;°) F\n"
    },
    {
      "time": " 11.Nov.2007 3.20pm",
      "content": "Poor Florian.  \nOf the major cities Berlin is the closest to Siberia in Germany.\n\n"
    },
    {
      "time": " 11.Nov.2007 3.35pm",
      "content": "_I actually don’t know a lot about it, is it not a German last name?_\n\nHaley, according to ancestry.com, Fiege is a variation of the German [Füge](http://web.archive.org/web/20080507180934/http:/www.ancestry.com/facts/fuge-name-meaning.ashx).\n\n"
    },
    {
      "time": " 11.Nov.2007 3.48pm",
      "content": "Thanks Ricardo. Now I know :)\n\nI would be perfectly happy if i never saw snow again in my entire life.\n\n"
    },
    {
      "time": " 11.Nov.2007 4.04pm",
      "content": "Hmm...”Lisbon is also lovely”  \nYes Portugal is a great country to come work...nice beaches...great food...nice weather...great people!\n\nAntónio\n\n"
    },
    {
      "time": " 11.Nov.2007 5.38pm",
      "content": "_I would be perfectly happy if i never saw snow again in my entire life._\n\nHey, what about Barcelona? It’s a major design town — or so I’ve been told (by classmates and colleagues who’ve been there). On the downside, you would probably need to learn Spanish _and_ Catalan to live and work there.\n\n"
    },
    {
      "time": " 11.Nov.2007 9.32pm",
      "content": "\\> Paul is there good internet connections in Athens?\n\nIt’s modern. Not nearly as modern as Berlin but pleny hooked up.\n\nThere’s lots of large companies so I’m sure there’s pleny of work. The local joke is that the Germans own all of them.\n\nThe language seemed completely foreign to me. I have been in most of western Europe and there were almost always parts of the language I could understand but not there, or Scandinavia. The written language seems like it would definitely take some time.\n\nI don’t know exactly what you do but my job requires idiomatic knowledge of language, that’s one of the hardest things to aquire and it takes the longest.\n\nMy friends from Berlin all want to leave now. They say it’s getting a lot more stressful living there. It’s a shame.\n\nAll I can say from LA is welcome to the club. :)\n\nThe Basques live on some of the best real estate on this earth. Bilbao perhaps?\n\npbc\n\n"
    },
    {
      "time": " 13.Nov.2007 5.19am",
      "content": "_I really don’t want to move to London._\n\nWhat’s wrong with London?....apart from the rain, it’s expensive, it’s crowded and the summers are terrible!\n\nHang on a minute, Athens sounds great.\n\nDesigner I work with is from Athens but she says might be difficult not speaking the language although not impossible in the larger ad agencies. Scandanavia always appealed to me.\n\nCheers\n\n"
    },
    {
      "time": " 13.Nov.2007 5.48am",
      "content": "There are quite a few non-Finnish speakers here in Helsinki, and I think it would be possible to work in design without knowing the local languages. I know people who’ve been here for decades and still don’t/won’t speak the language. Houses are good and warm, infrastructure ok, air pretty clean and lots of nature around, even beaches. Downside is the climate, at the moment it’s snowing and we won’t see much sun for a few months from now. Summers are nice. As for swimming – my local beach offers a nice maintaned hole in the ice during the Winter months, so it’s possible to swim in the sea around the year...\n\nActually, I suppose it’s not that different to Toronto, except it’s in Europe, there’s the sea and people speak strange languages.\n\nI lived in Munich for a year, and it was lovely. I was there only as a Hausfrau, it wouldn’t have been possible to get a design job with my poor German skills. A Central European location is a good idea, if you want to visit other countries easily. From Munich we wisited Austria, Italy and Switzerland by train – very convienient.\n\n"
    },
    {
      "time": " 14.Nov.2007 11.23am",
      "content": "hey!i study technology of graphic arts in athens...dont know a lot about the industry but there are a lot of things going around in athens about graphic arts(presentations etc). visit [www.vcdc.gr](http://web.archive.org/web/20080507180934/http:/www.vcdc.gr/ \"www.vcdc.gr\") its the “visual communication designers club”. there is also a special section for people who offer/look for job + a forum for people who dont understand greek-never got in to see what it is about though...\n\n"
    },
    {
      "time": " 15.Nov.2007 5.23am",
      "content": "Haley:\n\nWhy not Istanbul? I’ve been living here for more than 3 years. There’s a huge amount of foreigners, including greek and canadians. Foreigners here are making an awful lot of money, providing they are good at what they do. Language is not a problem, there is a lot of work in graphic design, urban life is awesome, quality of life rather good, europe is an hour and a half away by plane, religion is not invasive.\n\nso, i dont know - think about it.\n\nDavid R\n\n"
    },
    {
      "time": " 15.Nov.2007 5.52am",
      "content": "Yeah that’s awesome. I will definitely look at Istanbul.\n\n"
    },
    {
      "time": " 15.Nov.2007 7.20am",
      "content": "David:\n\nI visited Istanbul on holiday a few years ago and fell in love with it and want to go back so badly. I was wondering how easy a move it was for you? Visa/job hunting/etc? The extent of my Turkish is basically “Bir chai, lutfen!”, so I would need to bone up on that =)\n\n"
    },
    {
      "time": " 15.Nov.2007 7.59am",
      "content": "vxhorusxv (nice nickname by the way :-) :\n\nmoving was not easy, i guess it never is anyway, to start a new life from scratch in a country you don’t know. before thet i have been living 10 years in new york, 1 year in tokyo and 4 years in paris, but this was very different. it takes time to get fully used to this city, about 6 month. after that, its really very nice. to obtain a visa is very tricky and long, depending on your country: for french people, for example, you have to ask the working visa before you actually go and work there; that’s really boring. i dont know for other countries, but french citizens can go and stay in turkey without any visa for 90 consecutive days, which is a blessing: you can go hunt for jobs, eventually find one, and ask the company’s lawyers to get your visa (as in the USA), making things much faster done. job hunting is not very hard: just buy the newspaper hurriyet on sundays, that’s where 95% of the ads are posted. you also might try a spontaneous job request by contacting the agencies here, there is a crazy amount of advertising / graphic design companies, both local or international. in 70% of the time, their creative directors or top art directors are foreigners. if your portfolio is good, they will call you, believe me. 3 major companies called me in the week following my emailing, 3 years ago, and it is still true today.\n\nand to finish with the turkish language... i’m ashamed to say that my turkish sucks, still now. i can chat, order food, talk about graphic design specifics... but that’s pretty thin. i am even married to a turkish girl, but we speak english and she is learning french... so, dont be too much afraid: language is not too much of a problem (until you get in a taxi of course).\n\ndavid r\n\n"
    },
    {
      "time": " 15.Nov.2007 7.25pm",
      "content": "Haha I heard taxi drivers in Turkey are the worst in the world.\n\n"
    },
    {
      "time": " 15.Nov.2007 11.44pm",
      "content": "That’s far away from reality - they are much worse than that.\n\ndr\n\n"
    },
    {
      "time": " 18.Nov.2007 9.00am",
      "content": "I lived in Germany from 2001–2002, and then again from 2003–2007. Now I’m at Reading in the UK, but I’ll be returning to Germany in late 2008. Both times in Germany, I was living near Frankfurt. It is possible to get work in Europe without speaking the native language, but you integrate so much better & so much faster if you do learn it, and quickly. I love Berlin, but the job market there is rubbish, and the salaries low. From what I hear, designers make more there than in Athens, though, if that is consoling. Lots of people seem to like moving to the Netherlands. I think its cities must be quite cosmopolitan, and depending on what you are looking for, pleasant.\n\n"
    }
  ]
}
