{
  "id": "38993",
  "title": "Bellas Artes",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " **S U D T I P O S** //// N E W S // F O N T - R E L E A S E /////\n\n ![](http://web.archive.org/web/20150123074738im_/http:/typophile.com/files/bellastypophile_5477.jpg)\n\nWhen the brush of Angel Koziupa and the technical expertise of Ale Paul go face to face with the art deco aesthetic, you end up with a beautiful face like **[Bellas Artes](http://web.archive.org/web/20150123074738/http:/www.veer.com/products/typedetail.aspx?image=UMT0000299)**. The sensual curves provided by Koziupa become players in a game of equals, where there is no such thing as the better half. Both sides of the characters complement each other like lovers in a perfect romance.\n\nBellas Artes is an excellent choice for packaging design, book covers, and music-related artwork aimed at the feminine demographic and classical tastes.\n\n**[Sudtipos](http://web.archive.org/web/20150123074738/http:/www.sudtipos.com/)**\n\n",
  "author": "Ale Paul",
  "time": "11 Nov 2007 — 10:40am",
  "uid": "827",
  "comments": [
    {
      "time": "11 Nov 2007 — 11:08am",
      "content": "Alejandro, your prolificness combined with the quality of your designs is inspiring. I don’t know how you do it, but keep it up!\n\n"
    },
    {
      "time": "11 Nov 2007 — 12:21pm",
      "content": "Alejandro, didn't you just release [Feel Script](http://web.archive.org/web/20150123074738/http:/www.veer.com/products/typedetail.aspx?image=UMT0000300) in all its OpenType alternates glory? How fast do you push those Beziers around? ;-)\n\n"
    },
    {
      "time": "11 Nov 2007 — 2:44pm",
      "content": "well, they were online same week but not finished the same day. And one is 100% mine (Feel) and the other is with the great Koziupa. has that sense? :)\n\n"
    },
    {
      "time": "11 Nov 2007 — 10:05pm",
      "content": "I figured as much, but each of your scripts is so complete and well-drawn that it's hard to grasp how you maintain such a high output. One script each year from you would still be awe-inspiring. :-)\n\n"
    }
  ]
}
