{
  "id": "38996",
  "title": "My favorite Corporate Design Guide spew",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I look through hundreds of these things in an average week, and I can’t count the number of times I end up reading something like the following, which absolutely cracks me up every single time:\n\n“Typography is a critical element of (Business X), because usually it is the very first thing our customers see about us. We are a modern, cutting edge firm fully cognizant of the crucial part a vibrant, consistent look plays on the path to success. In seeking to reflect this company’s unique, progressive philosophy, and after careful consideration, only one typeface fit our vision: Arial.”\n\nNot sure about you, but to me this is both amusing and an immediate assurance that whatever the business is, I’m not likely to be a patron.\n\n [‹ Piracy Wiki Entry Missing or Deleted](http://web.archive.org/web/20081203151132/http:/www.typophile.com/node/38985 \"Go to previous forum topic\") [Helvetica Film on BBC 1 tonight (Tuesday) ›](http://web.archive.org/web/20081203151132/http:/www.typophile.com/node/38856 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203151132/http://www.typophile.com/user/15771\" title=\"View user profile.\">Curioustype</a>",
  "time": "<br>",
  "uid": "15771",
  "comments": [
    {
      "time": " 11.Nov.2007 12.43pm",
      "content": "“America loves a bargain”, and you don’t get much more of a bargain than a well hinted screen font installed ’for free’ on every Mac, Linux and Windows computer made in the past ten years.\n\nIf these guys were to say, “we picked Arial because our graphic designers and marketing people couldn’t come up with convincing enough arguments to make us spend a few thousand bucks on fonts” would you have more respect?\n\n"
    },
    {
      "time": " 11.Nov.2007 1.06pm",
      "content": "I work on a few major corporate accounts at work. The official font of GM Goodwrench is Myriad. The official Microsoft Canada font is Segoe, which is a weird Tahoma/Frutiger/Myriad face.\n\n"
    },
    {
      "time": " 11.Nov.2007 1.14pm",
      "content": "sii:\n\nI will ALWAYS have more respect for the truth than anything less than the truth, regardless of the circumstances. Next question.\n\nPerhaps something even better to say would be: “For our corporate typeface we’ve chosen Arial, a well-hinted screen font widely available and compatible with nearly every known operating system.” But after being told how dynamic and forward-thinking a company is, and how dedicated it is to having a standout visual program, it just strikes me as funny when these places say the typeface that matches their philosophies is Arial. Or Times New Roman.\n\nTo me it’s almost like a company is saying, as a dynamic, progressive business with employees spending large amounts of time on the road, we believe our company cars should be distinguishable from every other car, fitted with the best safety and technological features of the present day. They also must be attractive to look at. For that reason, all of our company cars are 1991 Honda Civic four-doors. To me that’s just funny.\n\n"
    }
  ]
}
