{
  "id": "39004",
  "title": "Grotesque text typefaces, alternatives to Akkurat",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey all,\n\nI'm currently in the process of creating a brand and have become quite fond of [Sansa](http://web.archive.org/web/20141117105914/http:/www.identifont.com/show?9XK). While this takes care of the branding device, I would like to investigate some nice body fonts that can go along with the identity.\n\nI've been looking at Akkurat, but don't really believe that is available to me at this time, so I would like some recommendations up that same avenue (although I would like to avoid Helvetica/Akzidenz Grotesk as I want to instill a sense of originality - even if I'm the only one who notices it). Any gems out there?\n\nThanks in advance,  \nBen\n\n",
  "author": "benski",
  "time": "11 Nov 2007 — 8:17pm",
  "uid": "8565",
  "comments": [
    {
      "time": "11 Nov 2007 — 10:55pm",
      "content": "In the grotesque vein: [FF Bau](http://web.archive.org/web/20141117105914/http:/www.fontshop.com/search/?q=bau&site=d), [National](http://web.archive.org/web/20141117105914/http:/vllg.com/KLIM/National/mudTyper+Weights), and [Neutral](http://web.archive.org/web/20141117105914/http:/bpfoundry.com/bp/fonts/cuts.htm?font=neutralbp).\n\n"
    },
    {
      "time": "11 Nov 2007 — 11:59pm",
      "content": "Great suggestions, Reed. I would also consider [Galaxie Polaris](http://web.archive.org/web/20141117105914/http:/vllg.com/Village/GalaxiePolaris/mudTyper+Weights/), [Chalet Book](http://web.archive.org/web/20141117105914/http:/www.houseind.com/index.php?page=showfont&id=140), and [Paralucent](http://web.archive.org/web/20141117105914/http:/www.fontshop.com/search/?q=Paralucent) and have a look at my list of other [Helvetica alternatives](http://web.archive.org/web/20141117105914/http:/www.fontshop.com/fontfeed/archives/helvetica-and-alternatives-to-helvetica/).\n\n"
    },
    {
      "time": "12 Nov 2007 — 12:49am",
      "content": "Hi Ben!\n\nSophisto or Stalemate both have a bit of character, but all the same formal enough to be part of a brand identity.\n\nHave a look at; [http://www.macrhino.com](http://web.archive.org/web/20141117105914/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": "12 Nov 2007 — 2:51am",
      "content": "What about the stylish Maquette?  \n [http://www.fontshop.com/fonts/downloads/arstype/maquette/](http://web.archive.org/web/20141117105914/http:/www.fontshop.com/fonts/downloads/arstype/maquette/ \"http://www.fontshop.com/fonts/downloads/arstype/maquette/\")\n\n"
    },
    {
      "time": "12 Nov 2007 — 3:28am",
      "content": "Have a look at some grotesques: [http://www.fontshop.com/fontfeed/archives/helvetica-and-alternatives-to-...](http://web.archive.org/web/20141117105914/http:/www.fontshop.com/fontfeed/archives/helvetica-and-alternatives-to-helvetica/ \"http://www.fontshop.com/fontfeed/archives/helvetica-and-alternatives-to-helvetica/\")\n\n"
    },
    {
      "time": "12 Nov 2007 — 1:13pm",
      "content": "Wow, Maquette is nearly identical to H&FJ's Gotham - ever so slightly more condensed and with a double-storey a.\n\n"
    },
    {
      "time": "12 Nov 2007 — 2:08pm",
      "content": "I love how completely bald-faced Stefan H is in his attempts to create interest in his fonts:\n\n[http://typophile.com/node/39004](http://web.archive.org/web/20141117105914/http:/typophile.com/node/39004 \"http://typophile.com/node/39004\")  \n [http://typophile.com/node/17373](http://web.archive.org/web/20141117105914/http:/typophile.com/node/17373 \"http://typophile.com/node/17373\")  \n [http://typophile.com/node/37965](http://web.archive.org/web/20141117105914/http:/typophile.com/node/37965 \"http://typophile.com/node/37965\")  \n [http://typophile.com/node/38406](http://web.archive.org/web/20141117105914/http:/typophile.com/node/38406 \"http://typophile.com/node/38406\")  \n [http://typophile.com/node/38456](http://web.archive.org/web/20141117105914/http:/typophile.com/node/38456 \"http://typophile.com/node/38456\")  \n [http://typophile.com/node/38585](http://web.archive.org/web/20141117105914/http:/typophile.com/node/38585 \"http://typophile.com/node/38585\")  \n [http://typophile.com/node/35927](http://web.archive.org/web/20141117105914/http:/typophile.com/node/35927 \"http://typophile.com/node/35927\")  \n [http://typophile.com/node/19542](http://web.archive.org/web/20141117105914/http:/typophile.com/node/19542 \"http://typophile.com/node/19542\")  \n [http://typophile.com/node/18555](http://web.archive.org/web/20141117105914/http:/typophile.com/node/18555 \"http://typophile.com/node/18555\")  \n [http://typophile.com/node/33704](http://web.archive.org/web/20141117105914/http:/typophile.com/node/33704 \"http://typophile.com/node/33704\")  \n [http://typophile.com/node/31000](http://web.archive.org/web/20141117105914/http:/typophile.com/node/31000 \"http://typophile.com/node/31000\")  \n [http://typophile.com/node/31593](http://web.archive.org/web/20141117105914/http:/typophile.com/node/31593 \"http://typophile.com/node/31593\")  \n [http://typophile.com/node/13281](http://web.archive.org/web/20141117105914/http:/typophile.com/node/13281 \"http://typophile.com/node/13281\")  \n [http://typophile.com/node/32883](http://web.archive.org/web/20141117105914/http:/typophile.com/node/32883 \"http://typophile.com/node/32883\")  \n [http://typophile.com/node/32896](http://web.archive.org/web/20141117105914/http:/typophile.com/node/32896 \"http://typophile.com/node/32896\")\n\nI guess it's cheaper than advertising. Maybe Stefan H has a bot which does this.\n\n"
    },
    {
      "time": "12 Nov 2007 — 2:24pm",
      "content": "_I love how completely bald-faced Stefan H is in his attempts to create interest in his fonts:_\n\nHe's got some good fonts: I'd certainly be happy for him to point out something in his portfolio that might suit a project I was working on. I don't see him pop up often in the forums with design advice; I'd love to see him share some of his considerable expertise.\n\n"
    },
    {
      "time": "12 Nov 2007 — 2:26pm",
      "content": "James, there's nothing wrong with a little self-promotion. Don't be a hater.\n\n"
    },
    {
      "time": "12 Nov 2007 — 6:13pm",
      "content": "If there's nothing wrong with a little self-promotion, what is the thought on a LOT of self-promotion?\n\n"
    },
    {
      "time": "12 Nov 2007 — 6:30pm",
      "content": "I guess that would depend on what constitutes \"a lot\".\n\n"
    },
    {
      "time": "12 Nov 2007 — 6:30pm",
      "content": "<cite>If there’s nothing wrong with a little self-promotion, what is the thought on a LOT of self-promotion?</cite>  \nThat depends on the wares; if the wares are good I don't mind.\n\n"
    },
    {
      "time": "12 Nov 2007 — 10:05pm",
      "content": "\\> Maquette is nearly identical to H&FJ’s Gotham\n\nThey do share a lot, but look closer, starting with the proportions and x-height. And here's Proxima Nova (which preceded Gotham) as another option.\n\n[\n ![](http://web.archive.org/web/20141117105914im_/http:/typophile.com/files/gotham_m_r_3726.gif)\n](http://web.archive.org/web/20141117105914/http:/www.typography.com/fonts/font_styles.php?productLineID=100008)\n\n[\n ![](http://web.archive.org/web/20141117105914im_/http:/typophile.com/files/font_rend-3_5016.png)\n](http://web.archive.org/web/20141117105914/http:/www.fontshop.com/fonts/singles/mark_simonson/proxima_nova_semibold_ot/)\n\n[\n ![](http://web.archive.org/web/20141117105914im_/http:/typophile.com/files/font_rend-2_6656.png)\n](http://web.archive.org/web/20141117105914/http:/www.fontshop.com/fonts/singles/arstype/ars_maquette_medium/)\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:23am",
      "content": "Come on, James, Stefan always is on-topic. I have no problems with getting good suggestions. You could pick on others, too – why shouldn’t Dan advocate Linotype fonts or Stewf such distributed by Fontshop? They know them very well, and they know they’re good.\n\n"
    },
    {
      "time": "13 Nov 2007 — 6:36am",
      "content": "James,\n\nI can assure you I don't have a \"generator\" for making my suggestions. They are \"hand made\" for each post. I just try to keep it short instead of putting loads of \"bla bla\" about my own typefaces. It's just so much about different taste and t's much quicker and easier for people judging themselves. I agree it's a sort of low budget \"guerilla advertising\", but as an independent type designer, you to make some noise... I'm just surprised that it haven't been used by many more ;-)\n\nGary,\n\nI wish I could spend more time sharing ideas and input on design topics etc. I've actually been thinking of cloning myself, but my wife tells me one is perfectly enough... and god forbid I might start double-posting!\n\nCheers\n\n"
    },
    {
      "time": "13 Nov 2007 — 8:28am",
      "content": "Stefan, my objection to your guerilla advertising is two-fold. First, it is embarrassingly desperate. Are your sales so slow that your advertising plan is to reach the few hundred visitors of this website? Second, it is annoying. You are the Jehovah's Witness of the type world, knocking on doors with your sales pitch. (And I like some of your work!)\n\nIt's not just you, either. It has come up that Stephen Coles is employed by FontShop, and they seem to pay him to suggest fonts available from them on this site. If he just posted \"I work for FontShop. Here are some fonts we sell which you might be interested in.\" It would be like the nice shirt and tie which Jehovah's Witnesses wear, which allow you to spot them before you open the door.\n\n"
    },
    {
      "time": "13 Nov 2007 — 8:50am",
      "content": "People ask a question about type, on a type BBS filled with type designers and vendors. They get qualified information from these type people. That might be advertising, but foremost it is information.\n\n"
    },
    {
      "time": "13 Nov 2007 — 8:56am",
      "content": "‘advertere’ is ‘to pay attention’\n\n"
    },
    {
      "time": "13 Nov 2007 — 11:23am",
      "content": "James -- FontShop sees very few sales from Typophile traffic. I point to fonts at our site because I know the library well and have scripts which ease searching and linking. I think you'll find that the fonts in my posts are not limited to FS.\n\nBut that's beside the point. If you are that annoyed by people recommending fonts for which they might have a financial interest, then I submit that Typophile is probably not for you. If the suggestions were superfluous and unhelpful, I could see your complaint, but your metaphor is flawed: Jehovah's Witnesses offer _unsolicited_ advice.\n\n"
    },
    {
      "time": "13 Nov 2007 — 11:48am",
      "content": "From the original post:  \n\"I’ve been looking at Akkurat, but don’t really believe that is available to me at this time, so I would like some recommendations up that same avenue (although I would like to avoid Helvetica/Akzidenz Grotesk as I want to instill a sense of originality - even if I’m the only one who notices it). Any gems out there?\"\n\nThe suggestions posted by Auricfuzz and Stephen Coles are helpfully Helvetica/AG-like. (And my apologies to Mr Coles. I see that he has linked to non-FontShop fonts.)\n\nHowever, take a look at Stalemate and Sophisto. If those are anything like Akkurat, Helvetica, or AG, I will eat my own hat.\n\n"
    },
    {
      "time": "13 Nov 2007 — 12:35pm",
      "content": "James,\n\nToo bad you get so annoyed by my \"harmless\" posts. In fact I'm surprised they would stir up anything to begin with? You are the first to say so. I might not be on target at all times, but many here have found my \"recommendations\" sometimes useful for other projects or just happy to discover some new faces in the \"ocean\". Comparing me with Jehovah’s Witness is to me hilarious. When I was young,,, they sometimes came knocking on my door, typically early on a Sunday morning! I have \"scared\" them away twice showing them my hammer of Thor, saying something about I'm NOT Christian! ;-)\n\nAs for living on type, I'm doing pretty well. I still do logotypes, graphic identities, graphic design for Greenpeace, but mostly because I still love doing it and it's a good way of mixing both type and design. But I'm almost independent from just royalties and custom typefaces.\n\nRegarding Stephen Coles, I find it very low to accuse him for being a salesman for FS! Yes he works for them and \"EVERYONE\" here knows it, but he's passionate about type and his knowledge is without any doubt! The Typosphere would be dull without him! I feel honoured to have become his friend over the years.\n\nLOVE, PEACE & UNDERSTANDING!\n\n"
    },
    {
      "time": "13 Nov 2007 — 2:37pm",
      "content": "Customer: \"I'm looking for a bowler hat.\"\n\nSalesperson: \"Here's a nice pair of Wellington boots.\"\n\nCustomer: \"Ummm. I'm actually looking for a bowler hat.\"\n\nSalesperson: \"Perhaps you would be interested in Stalemate or Sophisto.\"\n\nCustomer: \"Those are post-modern sans serif fonts. I just want a bowler hat.\"\n\nEtc. Etc.\n\nBeyond the Jehovah's Witness-style salesmanship, my objection lies in the fact that Stefan H suggests his fonts when they are entirely unlike what the person is looking for. Stefan does not deny that he is not on target at all times; maybe he could think a little bit before posting. If he signs up with FontShop to have them distribute his fonts, Stephen Coles will do it for him!\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:00pm",
      "content": "NewGuy: Blah.\n\nTypophile: Huh?\n\nNewGuy: Blah blah blah, blah blahhh!\n\nTypophile: Naw.\n\nNewGuy: Blah.\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:01pm",
      "content": "Actually, your dialogue was fairly amusing, however fictional.\n\nSorry we hiijacked your topic, Ben. I hope you're finding what you need.\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:07pm",
      "content": "If you're going to recommend fonts, perhaps you should declare your financial interest in a signature to the post, if it's not apparent from your username.\n\nLike many contributors to Typophile, Stephen wears several typo hats (eg Typographica and TypeCon), so his posts on various issues here are not necessarily \\*glyph pushing\\* (as he terms it) for FontShop.\n\nI recommend [Brown,](http://web.archive.org/web/20141117105914/http:/www.myfonts.com/fonts/shinn/brown/) which is (so far) my take on the grotesque genre.\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:12pm",
      "content": "It's a Platonic dialogue in the style of Laurel and Hardy...\n\nI applaud Nick Shinn's transparency. And his recommendation of a grotesque which is actually a relevant suggestion. Bravo!\n\n(See, I'm not a total prick!)\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:13pm",
      "content": "_If you’re going to recommend fonts, perhaps you should declare your financial interest in a signature to the post, if it’s not apparent from your username._\n\ni find it fairly simple to understand why stephen and stefan respond the way do in these types of threads, but i think i'd prefer an explanation as to why you're spewing so much venom - that's the one i can't quite figure out...\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:18pm",
      "content": "Stephan H\\> Your little story of how you shooed Jehovah’s Witness from your door is incompatible with \"LOVE, PEACE & UNDERSTANDING!\" at the bottom of your post.\n\nNewGuy, James\\> Jehovah’s Witness are not salesman because nothing is ever for sale. You really need think more about what you say here. You're not just trolling but more seriously your spreading disrespect, prejudice, and intolerance towards people you really no nothing about. James, there is too much ugliness in your posts. You need to stay off typophile for a while or not come back.\n\nMike Diaz\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:27pm",
      "content": "Why don't ya take a walk up High Street and find a nice little joint to have a few beers and chill, New Guy? You might feel better about things later.\n\nChrisL\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:30pm",
      "content": "Better still, smoke the joint. :-)\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:31pm",
      "content": "for the love of the lord above yourall acting like a bunch of yapping dingos. newguy is spot on about the Rhino always chrging in and spamming his fonts, when he hardly helps in other threads. it's not 'guerilla advertising' at all just shameless promo!!\n\n-----------------------  \nChopper Reid says \"Harden the \\*\\*\\*\\* up\".\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:55pm",
      "content": "Thank goodness for muzzer! I thought I was picking fights with windmills!\n\nI just find it hard to take any of these threads seriously when they're polluted with rampant advertising. Maybe there could be a new section, like Font ID, which keeps the self-serving suggestions off on their own.\n\n"
    },
    {
      "time": "13 Nov 2007 — 4:12pm",
      "content": "Why a grotesque sans for body copy? Just curious.\n\nMaquette looks nice but no italics. Won't work for body copy.\n\n"
    },
    {
      "time": "13 Nov 2007 — 4:16pm",
      "content": "I would look at some of the other faces by ourtype. I would think you would find some good compliments to Sansa, and, being from the same foundry, they might work better together.\n\n"
    },
    {
      "time": "13 Nov 2007 — 4:49pm",
      "content": "I agree with Chris, for example have a look at Fresco Sans on OurType.  \nIn my opinion an excellent typeface, suitable even for text.\n\n"
    },
    {
      "time": "13 Nov 2007 — 4:54pm",
      "content": "OurType's underrated Parry Grotesque might be the thing, though it's a little more old school. I would give you a non-FontShop link, but ourtype.be is built in flash and has no linkable pages.\n\n"
    },
    {
      "time": "13 Nov 2007 — 4:57pm",
      "content": "[http://www.ourtype.be/pdf/OT-Parry-Grotesque.pdf](http://web.archive.org/web/20141117105914/http:/www.ourtype.be/pdf/OT-Parry-Grotesque.pdf \"http://www.ourtype.be/pdf/OT-Parry-Grotesque.pdf\")\n\nPerhaps this will help. :-)\n\n"
    },
    {
      "time": "13 Nov 2007 — 7:20pm",
      "content": "_Maybe there could be a new section..._\n\nNot really necessary, as these threads usually begin \"Alternative/similar to...\" or \"Compliment for...\"\n\n"
    },
    {
      "time": "14 Nov 2007 — 1:52am",
      "content": "Super Ultra Fabulous,  \nI wasn't rude to these guys, I made it in a rather ironic and humorous way... But they do work early hours! Waking up people like 9 am on a Sunday morning might not be the optimal sales situation :-)\n\nJames & Muzzer  \nObviously I'm acting provocative towards you, so herby I promise not to spit out my type suggestions unless they are really ON TRAGET.\n\nJames  \nActually all my typefaces sold by Psy/Ops and Fountain are also sold through FontShop, so beware Stephen might suggest some of mine anyhow!?\n\nCheers\n\n"
    },
    {
      "time": "14 Nov 2007 — 2:14am",
      "content": "New Guy and Muzzer: Confess – you are just jealous. ;-)\n\nAnd... for the record, I dont see nothing wrong in promoting your own fonts, especially when you are trying to make a living out of it. I like it when people are taking things in their own hands and promoting whatever they are doing. That is how the free world is functioning.\n\n"
    },
    {
      "time": "14 Nov 2007 — 3:07am",
      "content": "<cite>take a look at Stalemate and Sophisto. If those are anything like Akkurat, Helvetica, or AG, I will eat my own hat.</cite>\n\nThe OP said he’s looking for <cite>Grotesque text typefaces</cite> and likes <cite>to <strong>avoid</strong> Helvetica/Akzidenz Grotesk</cite>.\n\nStefan didn’t claim that his are yet some other Swiss modern grotesques, but, quite the contrary, clearly specified that they <cite>have a bit of character.</cite>\n\nSo, to me, they’re not <cite>entirely unlike what the person is looking for</cite>.  \n(Given the fact that most people won’t notice the difference between Helvetica and Univers)\n\nIt’s neither Wellington boots nor \\/iάgra nor unsolicited proselytization, you know. Just a link. You don’t _have_ to follow it.\n\nAnd before this thread becomes totally off-topic, I’ll add some more suggestions:  \n [PTL Maurea](http://web.archive.org/web/20141117105914/http:/www.primetype.com/faces_info.php?fid=28)  \n [Zeppelin](http://web.archive.org/web/20141117105914/http:/www.stormtype.com/typefaces-fonts-shop/typefaces-590-zeppelin-32)  \n [Axiom GST](http://web.archive.org/web/20141117105914/http:/www.georgsaldentypes.de/)\n\nThey’re not like Helvetica or Akkurat? Exactly. They’re grotesque text typefaces.\n\n"
    },
    {
      "time": "14 Nov 2007 — 7:01am",
      "content": "It's been mentioned but I think [National](http://web.archive.org/web/20141117105914/http:/www.vllg.com/KLIM/National/mudTyper+Weights/) is spot on. But then again I'm a part of Village so I guess I should keep it for myself.\n\nBy the way, I am _always_ rude to the Jehova's Witness\n\n"
    },
    {
      "time": "14 Nov 2007 — 7:04am",
      "content": "I'm being pig-headed about this, and Florian Hardwig is being pig-headed about this. The difference is: I'm right.\n\nThe original post clearly asked for suggestions for a grotesque text alternative to Akkurat, which is not Helvetica/A.G.\n\nMaurea, Zeppelin, and Axiom are alternatives to Frutiger, Interstate, and Frankling Gothic, respectively.\n\nHere's another of my Platonic dialogues for my fans:\n\nBenski: \"I’ve been looking at Akkurat, but don’t really believe that is available to me at this time, so I would like some recommendations up that same avenue (although I would like to avoid Helvetica/Akzidenz Grotesk as I want to instill a sense of originality - even if I’m the only one who notices it). Any gems out there?\"\n\nStefan H: \"I don't have anything like that in my collection, so I'll just keep quiet.\"\n\nBenski: \"I've got another project where I've been using Klavika, but am not sure I like it. Can anyone suggest some replacements?\"\n\nStefan H: \"Perhaps you might like Stalemate or Sophisto.\"\n\nSee how that works?\n\n"
    },
    {
      "time": "14 Nov 2007 — 7:50am",
      "content": "…<cite>the nice shirt and tie which Jehovah’s Witnesses wear</cite>…  \nLet's not forget the Mormons now; (which there are a fair share of in here I've noticed).  \nAlso, I recommend Mario Feliciano's Flama and Jose Feliciano's cover of Light My Fire.\n\n"
    },
    {
      "time": "14 Nov 2007 — 7:46am",
      "content": "<cite>The difference is: I’m right.</cite>\n\nThe difference is: Now I made some suggestions for Ben, while you’re just complaining, still.  \nAnd don’t you come up with Nimbus. ;°)\n\nHug,  \nPig-headed F.\n\n"
    },
    {
      "time": "14 Nov 2007 — 7:52am",
      "content": "New Guy I don't think you're in any position to be critiquing what people do or do not post here. Why don't you contribute something useful, like a recommendation for Ben instead of stirring up trouble. Life is too short, do something helpful.\n\n"
    },
    {
      "time": "14 Nov 2007 — 7:53am",
      "content": "I second the recommendation for [Flama](http://web.archive.org/web/20141117105914/http:/www.vllg.com/Feliciano/Flama/mudTyper+Weights/). Ben, have you been frightened away?\n\n"
    },
    {
      "time": "14 Nov 2007 — 2:49pm",
      "content": "Let's not forget Blacks, Muslims, Jews, Gays, etc. Let's use them all to make our arguments because tolerance is just when your face-to-face. You can't see me, so I can say what ever I like- right?\n\nIt's just Typophile.\n\n"
    },
    {
      "time": "14 Nov 2007 — 4:36pm",
      "content": "Florian - That Salden stuff looks interesting. Pity that the samples are so tiny. Am I missing a big image or PDF somewhere?\n\n"
    },
    {
      "time": "14 Nov 2007 — 7:01pm",
      "content": "Hey all, thanks for the replies. Didn't know this post would spark such controversy!\n\nFor the initial proposal I'm sticking with Akzidenz Grotesk, as I didn't realise OurType's EULA didn't allow outlining (I am aware this is common, silly me didn't check) so I have to make arrangements with my printer.\n\nI do however like the suggestion of using typefaces within OurType's library, I will follow that up and try to squeeze a bit more budget out of the client.\n\nAlthough... Flama is very nice indeed (thanks David, Chris). I'm still a bit new to this, so would anyone be able to tell me if purchasing this allows me to outline?\n\n"
    }
  ]
}
