{
  "id": "39029",
  "title": "Which codepages to support for a general-purpose commercial font?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I’m about 95% done with the glyphs of my current font project. I don’t plan on selling the font (it’s really just for my own use), but I’m acting as if I will, because I want the experience of creating a polished font that would meet the requirements of a commercially viable font.\n\nWhich codepages does everyone think the average, commercially useful font should support? I’m using Fontlab on Windows, and have so far completed the MS Windows 1252 Western codepage. I’ve also included additional characters, such as L slash, the fi and fl ligatures, and a few additional diacritical marks.\n\nSo far, I’ve been basically shooting for the union of the Windows 1252 and MacOS Roman code pages. Am I leaving anything out this way? I notice that neither codepage includes additional ligatures like ffi and ffl. Is there a more standard list of “usually supported” codepages among the major fonts out there?\n\nBefore I move on to metrics and the final round of details, I want to finalize my codepage support and wrap up all the remaining glyphs.\n\nThanks!\n\n",
  "author": "amv",
  "time": "12 Nov 2007 — 10:37am",
  "uid": "23823",
  "comments": [
    {
      "time": "12 Nov 2007 — 12:22pm",
      "content": "You don't say what kind of design it is, which might make a difference.\n\nThere's sort of an escalating scale of bigger and bigger character sets one can consider, for language coverage. Semi-independently are some questions of typographic coverage.\n\nAt Adobe, our most basic character set is essentially the union of MacRoman and WinANSI (codepage 1252), plus litre and estimated.\n\nSome typographic things one might consider as \"relatively\" standard, depending on the design:\n\n- having all five f-ligatures (fi fl ff ffi ffl)  \n- more fractions, or a full set of numeric numerators/denominators/superiors/inferiors  \n- small caps\n\nFor the next step in language coverage, we do \"Adobe CE\" which includes Windows Eastern European, Baltic and Turkish codepages.\n\nSee also [http://www.adobe.com/type/browser/info/charsets.html](http://web.archive.org/web/20131014093017/http:/www.adobe.com/type/browser/info/charsets.html \"http://www.adobe.com/type/browser/info/charsets.html\")\n\nIt keeps on escalating after that, but you probably don't want to have 3000 glyphs per font. :/\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "12 Nov 2007 — 2:22pm",
      "content": "Great, you pretty much confirmed my assumptions. I was actually just having a look at my ligures when I read this and was going to make a list of which ones to include-- I've already got the fi and fl, and will add ff, ffi and ffl.\n\nI also think the small caps/additional numerator/denominators is a good idea.\n\nThanks!\n\nBTW - I've always felt that since the MacOS/WinANSI union already flirts with greek letters so much, an entire majiscule/miniscule greek alphabet should be pretty standard these days in the average font. So many greek letters have so many current uses, especially when it comes to mathematics, programming and engineering, that you might as well go the extra step and round out the alphabet. I might come back for a round 2 with this font of mine and do that.\n\nThanks again.\n\n"
    }
  ]
}
