{
  "id": "3906",
  "title": "Baskerville Blues",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hi,   \n   \ni'm looking to purchase, sooner or later, a font from John Baskerville. I started looking around on the net and to my astonishement there are a lot of choices out there! I knew about the ITC and the Berthold versions (book & regular), but now I discovered that there are quite some big families (with osf & sc) from new foundries like Stormtype ( [http://www.stormtype.com](http://web.archive.org/web/20131016212401/http:/www.stormtype.com/)) & Fountain ( [http://www.fountain.nu](http://web.archive.org/web/20131016212401/http:/www.fountain.nu/)).   \n   \nSo, type-experts out there; which one seams to be the superior design? Or the most versatile?   \n   \nmac+\n\n",
  "author": "anonymous",
  "time": "27 Nov 2002 — 3:16am",
  "uid": "1203",
  "comments": [
    {
      "time": "27 Nov 2002 — 9:03am",
      "content": "According to Graphis's \"TYPE: The Best in Digital Classic Text Fonts\"\\*, the best Baskerville (in the classical sense, I guess) is the one by Monotype. But I'm not sure what name that goes by now.   \n   \nAnd \"Revival of the Fittest\"\\*\\* hand-picks four Baskervilles to analyze: ITC New Baskerville (low readability), Monotype Baskerville (high contrast), Berthold Baskerville (heavier, and lower contrast - maybe your best bet for setting small text in offset), and Mrs Eaves (which is not very literal at all).   \n   \n\\* Don't buy it - it's just a glorified specimen book.   \n   \n\\*\\* By Print Magazine. Some nice insights, but glaring faults as well.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Nov 2002 — 12:09pm",
      "content": "Depending on what kind of job it's for, I'd pick either Mrs Eaves, Storm's John Baskerville, or Monotype Bulmer. All three are available in OT versions. Bulmer (whose OT version you can now get through Adobe) is a different font but a good alternative if you want to set your choice apart.\n\n"
    },
    {
      "time": "27 Nov 2002 — 4:00am",
      "content": "Or maybe go for this?   \n [http://www.stormtype.com/jsans.html](http://web.archive.org/web/20131016212401/http:/www.stormtype.com/jsans.html)   \n   \n/peter\n\n"
    }
  ]
}
