{
  "id": "39060",
  "title": "Positioning ogonek underneath the i and I",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello,\n\nI’m working on a sans serif typeface and like to know where to position the [ogonek](http://web.archive.org/web/20140713230848/http:/typophile.com/wiki/ogonek) in iogonek and Iogonek.  \nDid I do it right?\n\nThanks,  \nPieter\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/ogonek_5816.png)\n\n",
  "author": "Pieter van Rosmalen",
  "time": "13 Nov 2007 — 8:15am",
  "uid": "5585",
  "comments": [
    {
      "time": "13 Nov 2007 — 9:24am",
      "content": "Take a look at this\n\n[http://www.decodeunicode.org/u+012f](http://web.archive.org/web/20140713230848/http:/www.decodeunicode.org/u+012f \"http://www.decodeunicode.org/u+012f\")\n\nTHis version is right aligned\n\nThere is also this  \n [http://www.fileformat.info/info/unicode/char/012f/fontsupport.htm](http://web.archive.org/web/20140713230848/http:/www.fileformat.info/info/unicode/char/012f/fontsupport.htm \"http://www.fileformat.info/info/unicode/char/012f/fontsupport.htm\")\n\nMany of these are right aligned including Cambria Myriad & Consolas. Georgia is gently right aligned as is Gentium. Verdana seems left aligned. Palatino Courier New and Times seem centered. Some examples are hard to give an alignment to in some sense because the ogonek does not narrow. This doesn't seem right to me somehow but I am interested in opinion about that too.\n\nOne area of difference too is if the ogonek is to the right on the serif or, if the design includes one - the serif.\n\nThe diacritics project says <cite> Horizontally, the accent is never placed at the centre of the character (with the exception of į / Į and sometimes Ų, where this may occur) </cite>\n\nFrom: [http://diacritics.typo.cz/index.php?id=20](http://web.archive.org/web/20140713230848/http:/diacritics.typo.cz/index.php?id=20 \"http://diacritics.typo.cz/index.php?id=20\")\n\nIt seems to me that the trend is to set it to the right side either gently or more strongly. My guess is that that is what Adam suggested.\n\nBut I am curious to see what folks here say too because there doesn't seem to be a clear cut answer.\n\nThis is what mine looks like on a Monospace I am working on.\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/iogonek_3641.jpg)\n\n"
    },
    {
      "time": "13 Nov 2007 — 10:50am",
      "content": "I don't think putting the ogonek at the very end of a serif works well. Serifs are not essential skeleton elements of the letter, so it's logically inconsistent to attach something to them -- and also, it does not work for me, optically. I do like Pieter's solution.\n\nA.\n\n"
    },
    {
      "time": "13 Nov 2007 — 11:11am",
      "content": "Hello Eben and Adam,\n\nThanks for the replies.  \nFor the other ogonek glyphs I took the advice of ogonek glyphs on the website of Adam.  \nIogonek and iogonek are not mentioned.  \nHere are all the ogonek glyphs from the typeface (in progress):\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/ogoneks_4219.png)\n\nPieter\n\n"
    },
    {
      "time": "13 Nov 2007 — 1:26pm",
      "content": "Thanks Adam & Pieter!\n\nTo help me feel like I have a more complete grasp on the question. What about this?\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/whataboutthis_5427.gif)\n\nLooking at Pieter's solutions the i is following the idea or example of his uc A. The one I posted just now is following the idea of the uc E. Is the lc 'u' Pieter has a still better solution to emulate for the i because the little gap at the base of the would not be present? Or perhaps the gap is needed to help preserve the salience of the i.\n\nThanks again.\n\n"
    },
    {
      "time": "13 Nov 2007 — 9:30pm",
      "content": "This ogonek looks like it belongs to a face with far more stroke contrast. As I understand it, the ogonek should look like it was drawn with the same \"pen\" as the letters. So, yes, I think a better ogonek would meet both sides of the stroke, eliminating the gap, on the A as well as the i.\n\n"
    },
    {
      "time": "14 Nov 2007 — 12:57am",
      "content": "Hello Eben,\n\nThanks for your solution. I did put the ogonek on the left side of the right stroke of the A to keep it “inside” the base character as much a possible. Otherwise it will stick out too much.\n\nHello Kevin,\n\nThanks for your advise, but when I change the contrast of the ogonek it will become to heavy i think. To eliminate the gaps on the A and i it needs a very heavy ogonek. I made it (quick and dirty) to show you.\n\nPieter\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/ogonek_A_i_5842.gif)\n\n"
    },
    {
      "time": "14 Nov 2007 — 12:59am",
      "content": "Hello Adam,\n\nWhat do you think of the contrast of the ogoneks?\n\n"
    },
    {
      "time": "14 Nov 2007 — 7:12am",
      "content": "I ran more or less into the same questions when making the ogonek glyphs. I found the article from Adam very helpful. This is how I 'solved' it:\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/ogonekzzz_5416.gif)\n\n"
    },
    {
      "time": "14 Nov 2007 — 7:27am",
      "content": "Pieter,\n\nThanks for you example. Now we have all three possibilities shown.\n\nWell, maybe even all four with Jos' example of a thinker more sturdy Ogoneck.\n\nLet's see what Adam says.\n\n"
    },
    {
      "time": "14 Nov 2007 — 8:46am",
      "content": "Jos, your ogonek are perfect, just fantastic.\n\nPieter, I agree -- I personally prefer to give the ogonek less weight at the top, otherwise it looks clunky. I like your approach with the reduced weight but I think the entire set of ogoneks has a bit too much variation. I agree that it may need some variation due to the various attachment methods, but the variation should not be so noticeable. Aogonek, aogonek, eogonek are optimal. In Eogonek, Uogonek, uogonek, they are a bit too squeezed. I'd say that in Eogonek, the bottom end should not exceed the right edge of E but the top end can attach a bit to the left of the edge (a bit like in your iogonek). I'd also try to make the attachment in Uogonek a bit more like in eogonek. And then, uogonek is tricky but I'd say it will survive if the bottom end will exceed the boundary of the u a little bit, while it would not be so much squeezed. And then, I'd try to make the ogoneks in Iogonek and iogonek a bit more squeezed to get the curvature of the ones in aogonek/eogonek a bit more. Simply make the ogoneks in Iogonek and iogonek the same as you have them in Aogonek and you'll be fine.\n\nA.\n\n"
    },
    {
      "time": "14 Nov 2007 — 12:08pm",
      "content": "Thanks Jos and Adam,\n\nI redesigned the ogoneks like Adam advised to draw them.  \nThe part right from the point where the ogonek is attach to the base glyph is optical the same in the A, E and i.\n\nPieter\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/Caponi_ogonek_5662.png)\n\n"
    },
    {
      "time": "14 Nov 2007 — 12:12pm",
      "content": "And thanks Eben. :)\n\n"
    },
    {
      "time": "14 Nov 2007 — 12:14pm",
      "content": "The right part of my ogonek is pointing up and the ones Jos drew for his typeface are pointing down. Are there any rules for it?\n\n"
    },
    {
      "time": "14 Nov 2007 — 1:14pm",
      "content": "<cite>Well, maybe even all four with Jos’ example of a thinker more sturdy Ogoneck.</cite>\n\nI was once told (can't regrettably remember by whom) that –unlike other accents or a cedilla– ogonek is an essential part of the glyph. It's not an accent on a glyph. It's another glyph.\n\n<cite>Jos, your ogonek are perfect, just fantastic.</cite>\n\nThanks Adam, but 95% of the credits must be boomeranged back to you, because of the thorough guidelines for doing this :)\n\n@ Pieter: No rules as far as I know. Ogonek means little hook and we're both hooked :) I like the changes ... much more consistent. I would shift the ogonek a bit to the right on i I A E and a bit to left on U.\n\n"
    },
    {
      "time": "14 Nov 2007 — 1:53pm",
      "content": "Sorry that should of course been 'thicker' not 'thinker'.\n\n"
    },
    {
      "time": "14 Nov 2007 — 2:51pm",
      "content": " ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/Ogonek_4389.gif)\n\nWhat do you make of this? I just revised the Ogoneks to be deeper and to follow the style of the other glyphs a bit better. What I am wondering about especially is how wide the curve should be from left to right. Some of these are less wide and I think that is starting to seem like the better approach. I put the p & j in to show the descender depth.\n\n"
    },
    {
      "time": "15 Nov 2007 — 2:33am",
      "content": "It has a nice optical balance between the ogonek and the glyphs. I think that the ogonek on E and e must be more to the right (all the way to the richt corner on E). I'ld make I and i the same (I is more to the right). Not that important maybe but there is a little difference in shapes: ogonek on for example e and E don't look quite the same to me...\n\n"
    },
    {
      "time": "15 Nov 2007 — 4:20am",
      "content": "Thanks Jos!\n\n"
    },
    {
      "time": "16 Nov 2007 — 6:24am",
      "content": "You're very welcome :-)\n\n"
    },
    {
      "time": "17 Nov 2007 — 2:35am",
      "content": "I am having another go at this. I think my shape swings to far to the left at first which make me push it too far right for balance - which doesn't make it easy to follow Adam's dictum that you should not break the right edge. Part of what seems clever to me about Jos' design is that cutting things off early make s the fit/balance easier which is partly where I started to develop this notion from. I also think that it might survive a bitmap interpretation better.\n\n"
    },
    {
      "time": "17 Nov 2007 — 12:37pm",
      "content": "Thanks, Adam. We always depend on your good advice on the ogonek.\n\nChrisL\n\n"
    },
    {
      "time": "20 Nov 2007 — 1:33am",
      "content": "Thanks all!\n\nPieter\n\n"
    },
    {
      "time": "21 Nov 2007 — 10:57am",
      "content": "Adam, would you have a look at this set?\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/og_4932.gif)\n\n"
    },
    {
      "time": "21 Nov 2007 — 12:30pm",
      "content": "Eben,\n\nI'm inconclusive about your two sets. I think the second set of ogoneks you posted does not really match the overall character of the typeface -- they are too narrow and too shallow. I liked the first set more but the ogoneks were too deeply curved, except the ones underneath the flat letters (iogonek, Iogonek). Use that structure for the remaining ones and you will be fine. In Uogonek, you could shift the ogonek a tad to the right so it merges with the letter really smoothly. In the first set, the attachment of ogonek into E was too thick but in Iogonek and iogonek it is fine.\n\nA.\n\n"
    },
    {
      "time": "21 Nov 2007 — 12:31pm",
      "content": "Pieter,\n\nI'd move the ogonek in Iogonek a tad to the right to give it a better optical balance, but other than that, I'm very pleased.\n\nA.\n\n"
    },
    {
      "time": "22 Nov 2007 — 2:04am",
      "content": "Thanks Adam.\n\nPieter\n\n"
    },
    {
      "time": "22 Nov 2007 — 12:55pm",
      "content": "Yes Thanks. I will have another go.\n\n"
    },
    {
      "time": "26 Nov 2007 — 8:12pm",
      "content": "After many itterations here is ( I hope ) some improvement\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/ogon_3477.jpg)\n\n"
    },
    {
      "time": "27 Nov 2007 — 7:20pm",
      "content": "Eben,\n\nA tad too thick but otherwise fine.\n\nA.\n\n"
    },
    {
      "time": "27 Nov 2007 — 8:31pm",
      "content": "Yay! Thanks! What do you think about the depth that they descend to? When I thin it I was thinking maybe I should do that by bringing it up from the bottom, and in from the left.\n\n"
    },
    {
      "time": "28 Nov 2007 — 2:50am",
      "content": "Eben,\n\nthey sure can be shorter.\n\nFor those interested, below are some samples of sanserifs ogoneks that I designed in the recent years: for Jean F Porchez' Bienvenue (that is used by Poland's telecommunication company TP SA), for Helvetica World (the multilingual version of Helvetica that was extended by John Hudson and released a few years ago by Linotype, originally named Helvetica Linotype and later renamed Helvetica World), as well as for the new versions of Arial and Tahoma (that ship with Windows Vista and Mac OS X 10.5 Leopard). Unfortunately, Microsoft chose not to merge the outlines of the ogoneks with the base letters, which results in visible overlaps when the font is rendered on Mac OS X.\n\nOn the left, there are the ogoneks as can be seen in the older versions of the respective typefaces, on the right are the versions that I \"retouched\".\n\nAdam\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/sanserifogoneks_6053.png)\n\n"
    },
    {
      "time": "28 Nov 2007 — 5:19am",
      "content": "That is a fantastic tutorial in itself, Adam! THANKS!\n\nChrisL\n\n"
    },
    {
      "time": "28 Nov 2007 — 5:50am",
      "content": "Adam, thanks. Do you have any serif examples that you've done?\n\n"
    },
    {
      "time": "28 Nov 2007 — 6:57am",
      "content": "Yeah, but this is a sanserif thread :) I'd need to compile some -- another time!\n\nA.\n\n"
    },
    {
      "time": "28 Nov 2007 — 7:03am",
      "content": "BTW, regarding the width-to-height proportion of an ogonek, often the width-to-height proportion of average lowercase letters (e.g. e or a) is a good indication. In other words, you can draw a rectangle around you \"a\" (the bounding box), and then just scale it down to fit between the baseline and the descender, and align it optically to the right of the letter -- and you have a reasonable proportion for the ogonek. When the descenders are longer than usual, the ogoneks may be a bit shorter, especially in display faces. Also, in rather narrow typefaces, the ogonek may be a bit wider in proportion than the average letter (i.e. it can have the proportions of an \"o\" and not of an \"a\").\n\nA.\n\n"
    },
    {
      "time": "28 Nov 2007 — 8:12am",
      "content": "This is really fantastic. It's fascinating to see the range of solutions but also what binds them together. Thanks also for the these 'rules of thumb' or starting principles!\n\n"
    },
    {
      "time": "1 Jun 2008 — 4:56pm",
      "content": "For the sake of completeness, I'm including the ogonek shapes from Times New Roman. On the left the version designed years ago by Monotype that shipped with Windows until Windows XP, on the right the version that I designed that ships with Windows Vista:\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/ogonek_times_4527.jpg)\n  \nAdam \n"
    },
    {
      "time": "1 Jun 2008 — 11:41pm",
      "content": "Thanks Adam!\n\n"
    },
    {
      "time": "2 Jun 2008 — 3:52am",
      "content": "Reflecting on Pieter's last posted example (Pieter van Rosmalen, 14.Nov.2007 12.08pm)  \nI had a quick idea. It's just a dirty tweak of his sample.\n\nThe top is the original posted by Pieter, the bottom modified according to my idea. ('A', 'E' and 'i' was modified).\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/sans_ogonek_aszsz_3458.gif)\n\nI was wondering whether you deem this a viable solution for ogoneks on this sans, or whether you consider this a mutilation of the letters.\n\nI kinda like it, the only slight doubts I have with the 'i', 'couse it seems less stable so (the A and E are \"standing on their feet\" all right).  \nBut I'm asking your opinion, as you eyes are trained on Polish (and possibly Lithuanian? =\\> I/iogonek) typography.\n\nIf it turns out to be OK and if I ever do a sans, I might come back to this idea...\n\n"
    },
    {
      "time": "2 Jun 2008 — 6:45am",
      "content": "Thanks, Adam, for your usual generosity, which is much appreciated.\n\n"
    },
    {
      "time": "2 Jun 2008 — 7:17am",
      "content": "Jos - jour sollution looks excellent!  \nEben - you are very close. Your ogoneks descent a bit too much for me, but they have right form.  \nPieter - your design is great and \"polish friendly\". Aszszelp proposes the form that is closer to the idea of ogonek - a tail that groes out from a glyph's body, but I am not sure what is better. I like both.\n\nMy opinions aren't opinions of a typographer. I just come from Poland.\n\n"
    },
    {
      "time": "2 Jun 2008 — 7:27am",
      "content": "Aszszelp,\n\nI like your idea. Slightly cutting off the edges of \"A\" and \"E\" looks convincing in this case, though on the other hand, the right leg of the \"A\" starts looking shorter so the top of the letter starts \"tipping over\" to the right a bit. It's usually a hard choice. I'd say, depending on the typeface, one may choose to make the ogoneks more or less integrated with the basic shape. If the letter has traces of calligraphy, then the ogoneks should be integrated with the base letter as naturally as possible, and the modification of the original base letters shape is possible and sometimes recommended. If the letter is extremely typographic or even mechanical (Clarendons, FF DIN etc.), then you can get away with an ogonek that obviously looks like it has been assembled together with the letter rather than growing out of it.\n\nA.\n\n"
    },
    {
      "time": "3 Jun 2008 — 12:23am",
      "content": "Some additional comment by me on Ebens first monospaced font (Eben Sorkin, 13.Nov.2007 9.24am) where he attached the ogonek to the end of the \"serif\".\n\nYou (Adam) wrote: \"I don’t think putting the ogonek at the very end of a serif works well. Serifs are not essential skeleton elements of the letter, so it’s logically inconsistent to attach something to them — and also, it does not work for me, optically. I do like Pieter’s solution.\" in reply.\n\nIMHO you are right in your basic observation (\"serifs are not essential skeleton elements of the lett\" [I usually put this that way: they are not meaning-bearing elements of the letter, which is a similar concept; though this can shift in time]). Therefore ogoneks also IMHO \\_generally\\_ would not go at the end of the serifs. However in some cases as in (a) generally sans-serif fonts (if present: e.g. on the capital I) and even more so in (b) sans-serif monowidth fonts they become something hybrid... more than just decoration, actually, they do become part of the letters. They get upgraded, they appear as strong as the letter itself, usually with the same stroke width as horizontals in the letters generally are, and they begin to bear a meaning (differentiation I from l, more prominently than they do in roman serif fonts e.g.).  \nA lot of people even write the capital I when standing alone WITH the \"serifs\" unlike any other \"regular\" serif which get lost in handwriting.\n\nLooking at Eben's later examples I figure that it is a sans-serif monowidth font with slight stroke weight alteration/dynamics and a double-storey a/g.\n\nIn this special case I thought it did not look wrong at the right side, as (for me) an ogonek is an attached character written at the end of the writing process of the individual letter. Of course, nonwithstanding, in roman serif fonts the attachment point for the iogonek would be more or less centered, as the serifs in that style are superimposed decorational elements.\n\n"
    },
    {
      "time": "3 Jun 2008 — 12:52am",
      "content": "Thanks Adam! I'm curious about how you designed the i-ogonek.\n\n@ marcin: Thanks ... it's great to hear that from a native Polish person!\n\n"
    },
    {
      "time": "3 Jun 2008 — 7:23am",
      "content": "I am ashamed to present this stuff, but I need someone's opinion.\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/odelay13_6521.gif)\n  \nThe biggest problem I have is how to add the ogonek to my \"blackletter\" serif of \"a\".  \nUsing the same template as for the rest of glyphs I would get a \"big black ink dot\" at the end of aogonek. I am not sure of my decision. Maybe I should redraw all ogoneks as it is in [Scala Sans](http://web.archive.org/web/20140713230848/http:/www.fontshop.com/fonts/singles/fontfont/ff_scala_sans_pro_regular/) (more vertical beginning)?\n\nThanks.\n\n"
    },
    {
      "time": "3 Jun 2008 — 10:51am",
      "content": "It's weird but I think I am starting to get this now...the weight dynamic especially.\n\n"
    },
    {
      "time": "3 Jun 2008 — 3:30pm",
      "content": "Guys, I have just submitted a topic in the \"Design\" forum concerning capital U with Ogonek. If you are interested (c'mon, Ogonek issue), you might want to have a look at it:\n\n[http://typophile.com/node/46037](http://web.archive.org/web/20140713230848/http:/typophile.com/node/46037)\n\nBe warned, the posting is pretty lengthish.\n\nSzabolcs\n\n"
    },
    {
      "time": "6 Jun 2008 — 4:59pm",
      "content": "In some typefaces, there is a problem of the narrow space in aogonek and uogonek between the curve that joins the stem and the ogonek. Take FF Meta as an example. In such cases, I would not be afraid of opening the space up from \\_both\\_ sides, i.e. modifying the curve of the letter in aogonek and uogonek as much as the curve of the ogonek itself. In other words, the shape of the original \"a\" does not always have to be identical to the shape of the \"a\" part in aogonek.\n\nTake a look at the attached picture (scroll right to see the wireframe outline comparison):\n\n ![](http://web.archive.org/web/20140713230848im_/http:/typophile.com/files/ogonekopen_3850.png)\n\nNote, I'm not saying that my quickly drawn ogonek shape is the best solution of FF Meta (though certainly better than what is included in FF Meta Pro). The main point I'm making is that I've moved the curve of the \"a\" part upwards. Think of it as creating an ink trap of some sort, just like you would in any other such situation.\n\nAlso note that in some cases, you may choose to remodel the outer (right) part of the a-ogonek junction as I did, so it joins smoothly. Just popping on a composite ogonek wouldn't do it justice, really.\n\nAdam\n\n"
    },
    {
      "time": "6 Jun 2008 — 6:01pm",
      "content": "Point nicely made Adam!\n\nOn a side note, can you imagine circumstances where you might want a contextual (CALT) ogonek? Like maybe an eogonek and a y. Or does it's position on the letter essentially free it from that kind of consideration?\n\n"
    },
    {
      "time": "6 Jun 2008 — 6:45pm",
      "content": "Eben,\n\nsure, there may be instances to call for a \"calt\" in this case, just like a de-ligating \"f\" (a \"short\" one, without an extender) when it occurs before the \"i\" (Cambria has such an \"f\"). I actually favor the calt approach over an \"fi\" ligature approach, not just because it works better in Turkish but it works better in general.\n\nA.\n\n"
    }
  ]
}
