{
  "id": "39072",
  "title": "3 Facts About Me",
  "forum": "TomN-CA's blog",
  "tags": [

  ],
  "content": "<dl>\n<dt>1. I'm a typography noob\n</dt>\n<dd>This is pretty much a hobby for me, although I'd like to incorporate it into what I do for a living. As I'm planning on going into technical writing, it's inevitable that I'll have to have typographic skills at some point. Perhaps the provided style guides will be out of date. Perhaps there will be no style guides.\n</dd>\n<dt>2. I'm overwhelmed at all there is to learn about this\n</dt>\n<dd>I understand the basics of font selection, but if you then gave me 100 fonts to pick from, I could probably pick a broad category of fonts. After that I'd be a little lost. What really makes one geometric sanserif 'better' or 'more suitable' than another? Should I use Avenir, Colbet, Century Gothic, Futura? Why, and when? I get brief inspirations for projects and ideas when I see a new font, but my overall lack of experience pretty quickly derails anything I try.\n</dd>\n<dt>3. I don't have a third item.\n</dt>\n<dd> This info is just here to give a quick overview about me. I'm here to learn and any help or instruction I can get would be great. I also already have the generic reccomended typography books, 'thinking with type' and 'elements of typographic style' which I'm working through. The latter, while full of info, tends to assume a bit of prior knowledge.<br>\n</dd>\n</dl>\n",
  "author": "TomN-CA",
  "time": "13 Nov 2007 — 2:20pm",
  "uid": "19621",
  "comments": [
    {
      "time": "13 Nov 2007 — 3:29pm",
      "content": "Re: 2, if advice is warranted. Having come from a similar position about a year ago, I can tell you that if you keep looking at type, you will start to get better at distinguishing the peculiar feel of each typeface. I remember that I once couldn't see the differences between Helvetica and Arial or Galliard and Adobe Garamond (not to imply that the relationship between them is equivalent), but now it's clear as day. I'd recommend looking through a particular designer's oeuvre (such as Christian Schwartz, Jeremy Tankard, or Xavier Dupre) as a way to improve your ability to pick up on how good type communicates.\n\n"
    },
    {
      "time": "13 Nov 2007 — 3:44pm",
      "content": "auricfuzz !!! ME TOO. For the longest time I couldn't tell Kievit from Myriad from Bliss. Now I can.\n\nEducation is always available. But learning takes time. Keep Posting on Typophile and you'll glean so much valuable information. If you have a doubt about a choice, post here and see what others have to say. You'll find that many other people have been or are in the boat as you.\n\nWelcome to Typophile,\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "15 Nov 2007 — 10:59pm",
      "content": "Thanks!\n\nTaking hints from posts here and from other forums, I went and deleted most of the fonts I'd installed. I came across a coreldraw 5 cd, and a thousand or so quaintly named look-a like fonts sounded like a good idea at the time...  \nThen I went back and only added ones I really wanted, where I was already aware of the original source. They don't quite match up with their \"inspirations\", but it's better than too many or no interesting fonts.  \nOr maybe that's a bad idea, getting used to versions with different overall sizes and perhaps inferior kerning?\n\n"
    },
    {
      "time": "16 Nov 2007 — 12:40am",
      "content": "Hi there:\n\nI think Bitstream fonts came with Corel. These are supposed to be very good. Metrics (kernings etc) should be evaluated on a case by case basis.\n\n[http://www.myfonts.com/browse/foundry/bitstream/?sort=name](http://web.archive.org/web/20131018070249/http:/www.myfonts.com/browse/foundry/bitstream/?sort=name \"http://www.myfonts.com/browse/foundry/bitstream/?sort=name\")\n\nBrowse this list on Myfonts and if you recognize any of them its time to undelete or reinstall those fonts.\n\nMikey :-)\n\n"
    }
  ]
}
