{
  "id": "39099",
  "title": "Seravek & publications for people with learning difficulties",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I'm researching and developing guidelines relevant to publications for adults with learning difficulties. I really like Read Regular for it's simple character differentiation, linear strokes and good spacing, but it is not availible for the public yet and it currently has too few weights and styles. Would anybody like to comment on Seravek? Much like Clearview ADA it seems a good choice.  \nCompare and contrast!\n\n",
  "author": "Double Elephant",
  "time": "14 Nov 2007 — 11:25am",
  "uid": "15250",
  "comments": [
    {
      "time": "19 Nov 2007 — 9:14pm",
      "content": "Seravek has some quirky characteristics that personally I don't care for. What about [Gotham](http://web.archive.org/web/20131012192052/http:/www.typography.com/fonts/font_overview.php?productLineID=100008) or [Myriad](http://web.archive.org/web/20131012192052/http:/www.fontshop.com/search/?q=myriad&x=0&y=0) or [Frutiger](http://web.archive.org/web/20131012192052/http:/www.fontshop.com/fonts/downloads/linotype/frutiger_std_ot_virtual/)?\n\n"
    },
    {
      "time": "20 Nov 2007 — 3:07am",
      "content": "Hi Chris,  \nI've looked at Myriad (Pro) and Frutiger--both are very decent faces and will be assessed at the 'audience testing stage'.  \nGotham is nice, with a generous set-width and x-height; however, it has the appearance of having shorter ascenders and descenders.\n\nSeravek displays good character differentiation between p & q, b & d, and between capital i and lowercase L; furthermore, it displays generous set-width and a generous x-height. Also, Seravek's lowercase alphabet possess characteristics that are would be familiar, and perhaps more legible, for people with learning disabilities--such as the curved tail on the lowercase L.\n\nWhich characteristics are you unhappy with? It is quirky, and for that reason I'm unsure about its suitability to my current project.  \nBut it may just be that Seravek's quirky characteristics are born from a need for an 'Inclusive' typeface.\n\nWhat do you think?\n\n"
    },
    {
      "time": "20 Nov 2007 — 12:56pm",
      "content": "I think trying to make a typeface fix or compensate for learning disabilities is misguided and a red herring. I apologize if this sounds harsh. It is an admirable impulse to wish to help those with disabilities, but unfortunately there are so many variables affecting the success of printed communication, it's a waste of time to fixate on typefaces for too long.\n\nRead Regular has so many other flaws that it is sub-functional as a typeface. It's really a shame that it comes recommended especially for such a purpose. For example, while there is some differentiation between certain ambiguous shapes, other, normally unambiguous shapes have been made more similar; very common vowels a and o now look the same, especially since the drawing of the typeface is so inexpert; where strokes join in 'a' could be carefully modeled to make the tail more explicit, and yet it's monoline, like Comic Sans, its execrable predecessor. Rather than a recognizable, distinct angular y shape, a curved y, like a u with a tail, is provided instead. For a specialized typeface intended for a special-needs audience, would you hire a complete novice at type design? That's who designed Read Regular. Some of the design precepts of Read Regular are simply wrong.\n\nTypefaces perform differently depending on how they are used. Typeface legibility can be destroyed by bad spacing or inappropriate setting. Their performance depends on their application. Are the subjects expected to improve their reading abilities over time? Then consider techniques for teaching reading: larger sizes, open spacing, short texts, simple vocabulary. Do the subjects have visual limitations? Reduce the challenges to reading by maximizing contrast, setting type in large sizes, improving the reading environment with lighting and seating, and finally, choosing well-spaced and well-designed faces to begin with. Choose typefaces with clear differentiation between shapes, open counters and apertures, and expert spacing, like Meta, Absara, Freight, Versa, Beorcana, Eva, Amira, Productus, Chaparral, or Whitman. Bad typefaces, because of their inherent ambiguity, tight spacing, and monotonous construction, would be Helvetica, Arial, Interstate, Bodoni, or Courier.\n\nFinally, you don't specify what the learning disabilities are. Dyslexia, low vision, and other learning disabilities are not equivalent, and not necessarily addressed with the same techniques.\n\n"
    },
    {
      "time": "29 Nov 2007 — 9:53am",
      "content": "Hi Carl,  \nSorry for the delay in replying.  \nI wasn't offended at all; I didn't think you were harsh–-It's nice to have your comments.  \nUnfortunately, I cannot be very precise about which learning difficulties the guide is for, because the service group supports a multitude of different disabilities, making the whole task very difficult indeed. However, dyslexia, and low vision would most certainly be two entirely different disabilities that would need to be considered for the project.\n\nI looked at the typefaces you recommend--a mix of seriffed and sans seriffed typefaces. So, are you against a monoline stroke for use in inclusive design? I wasn't quite sure? I've always had it in my mind, and from the mountains of reading that I've completed, that a relatively geometric sans serif are most suitable for learning difficulties (again, apologies for the broad term).\n\nThe guide will be far from text heavy, relying on symbols and singular lines of text. Therefore, I thought that something like New Johnston (London Transport's typeface) would be the paradigm. It has large apertures; a generous set-width and x-height; some differentiation eg, the connective at the bottom of the lowercase L--preventing confusion with capital i (Il); and it is works well in large and small sizes. What are your views?\n\nI think something like Meta could be suitable for this particular kind of Information design, but it has a rather narrow set-width, which, from what I've read, makes it less suitable than others--namely Avenir.  \nHowever, I would like to solve a few of the problems of character differentiation and Avenir just doesn't do that--although it's a great typeface.\n\n"
    }
  ]
}
