{
  "id": "39111",
  "title": "Scanfont 5 released by FontLab",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20071222214627/http:/typophile.com/user/7006 \"View user profile.\") : 14.Nov.2007 2.15pm \n\n**The new Scanfont 5!**  \n_Make fonts from most anything._\n\n[\n ![](http://web.archive.org/web/20071222214627im_/http:/typophile.com/files/scanfont5news111407_5979.jpg)\n](http://web.archive.org/web/20071222214627/http:/www.fontlab.com/)\n\nScanFont has long been the best tool for turning scans into fonts. Anything you could fit into a scanner you could quickly turn into a TrueType or Type 1 font. Now with the new version 5 you can do even more even easier and faster!\n\nScanFont 5 Splash This new version of ScanFont acts as a plugin for any of our font editors - TypeTool, Asiafont Studio, and FontLab Studio (and soon Fontographer, too). SF5 is optimized for scanning glyphs for autotracing into fonts, but it also gives you complete control over the scanning and autotrace process. You can adjust trace tolerance, curve fit and linearity to suit your subject, thus assuring the cleanest and most accurate scan possible so that the final font character requires little or no editing.  \n With its new, improved GUI, new filters, and new tools (like smart background removal) ScanFont is perfect for making handwriting fonts, symbol fonts, clipart fonts, signature fonts, or any other font from print or bitmap source material.\n\n**Your Price: US$99**  \n**Upgrade Price: US$29.95**\n\nFor Windows users ScanFont is now unbundled from TypeTool. But we’re offering a special TypeTool 3 upgrade bundle if you want to upgrade both Typetool and ScanFont at one time.  \n Give your creativity a boost today! Just visit the fontlab.com website and download a demo version of Scanfont 5: [www.fontlab.com/font-converter/scanfont/](http://web.archive.org/web/20071222214627/http:/www.fontlab.com/font-converter/scanfont/ \"www.fontlab.com/font-converter/scanfont/\")\n\nSincerely,  \nTed Harrison  \nFontlab Ltd.\n\n",
  "author": "<a href=\"http://web.archive.org/web/20071222214627/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 14.Nov.2007 2.15pm",
  "uid": "7006",
  "comments": [

  ]
}
