{
  "id": "39135",
  "title": "german black letter",
  "forum": "Blackletter",
  "tags": [
    "Blackletter"
  ],
  "content": "hi guys im new to the forum i discovered you while doing research for my dissertation and i was wondering if anyone could help me out? Basically im a masters degree student and im trying to prove that the abolition of german black letter in 1941 was due to its ilegibility and not the associations with 'jewishness'. If anyone knows any good source material or could be of any help it would be seriously appreciated. Thank You\n\n",
  "author": "chez",
  "time": "15 Nov 2007 — 7:23am",
  "uid": "23977",
  "comments": [
    {
      "time": "15 Nov 2007 — 7:51am",
      "content": "Do you mean it was hard to read itself, or that it was hard to read for people who were not used to it? (for example in the conquered territories)  \nI think it is pretty obvious that the latter was the reason to ban blackletter typefaces. But I don't know how one could ever really prove this unless one would find some secret diary pages of Hitler.\n\n"
    },
    {
      "time": "15 Nov 2007 — 8:54am",
      "content": "You might find something in this thread:  \n [http://typophile.com/node/36966](http://web.archive.org/web/20150317104833/http:/typophile.com/node/36966 \"http://typophile.com/node/36966\")\n\nThe document I link to there is very good but in German, unfortunately.\n\nI have indeed read that Fraktur was abolished because in 1941 the Nazis were more or less expecting to rule the world some day and wanted to facilitate the spread of the German language. Can't remember the source, though.\n\n"
    },
    {
      "time": "15 Nov 2007 — 9:12am",
      "content": "Sorry i never have been very good at making myself clear so this dissertation is doomed from the start lol anyway what i meant was that my dissertation is centered around the use of blackletter within german propaganda and why it was abolished when it appeared so parallel with the german national identity. I have read many sources stating that the true reason was that conquering nations were having trouble with its legibility but this seems unlikely when you consider that it had been a political issue since the early 1900's and it been brought before parliament to make roman type the standard in 1911 and failed. I guess what im asking for really is if anyone knows a source that gives a contrasting view prehaps that 'judenlettern' or jewish arguement or maybe theres another view that i am not yet aware of? or an account that seems to give a realistic study and outcome?\n\n"
    },
    {
      "time": "15 Nov 2007 — 10:33am",
      "content": "Stringent proof that the abolition of the Blackletter had nothing to do with a connotated jewishness might not be easy to find, although this seems to be a valid point of view.\n\nI have never looked deep into this subject (I can't tell you anything you don't already know), but what came to my mind when I read your question is the 'script decree' by Martin Bormann (who then was Director of the NSDAP party headquarters) from January 1941. It says that the Gothic script had wrongly been considered German and that it actually was composed of 'Schwabacher Jew letters' and hence not to be used any longer, especially not by authorities, in school books or in German magazines and newspapers that already were or planned to be syndicated outside of Germany. Hans Heinrich Lammers (head of the Reich Chancellery), who passed the decree on, described its rationale slightly differently (without a reference to an alleged 'jewishness'): the use of the (wrongly named) Gothic script would disservice German interests, as many aliens in and outside of Germany who could understand German could not read Blackletter.\n\nWhen Hitler displayed an aversion against the Gothic script at the 1934 Reichsparteitag (Nuremberg Rally), he argued that once German had become the language of Europe, it would be easier to learn for other peoples when written in Latin script. AFAIR, he made no connection between Gothic script and 'jewishness'.\n\nI only scanned it quickly, but the PDF linked to by Tim ( [www.peterrueck.ch/pdf/sprache%20der%20schrift.pdf](http://web.archive.org/web/20150317104833/http:/www.peterrueck.ch/pdf/sprache%20der%20schrift.pdf \"www.peterrueck.ch/pdf/sprache%20der%20schrift.pdf\")) seems to be a qualified and exhaustive disquisition of the 1941 Blackletter ban.\n\n"
    },
    {
      "time": "15 Nov 2007 — 11:39am",
      "content": "On page 48, from the book [Blackletter: Type and National Identity](http://web.archive.org/web/20150317104833/http:/www.amazon.com/Blackletter-National-Identity-Peter-Bain/dp/1568981252/ref=sr_1_1?ie=UTF8&s=books&qid=1195155547&sr=8-1) there is a letter printed on the Third Reich's letterhead with a translation that states:\n\n\"It is false to regard or to describe the so-called gothic script as a German script. In reality the so-called gothic script consists of Schwabacher-Jewish letters. ...\"\n\nIt continues on to discuss how the roman is to be used from then on.\n\nIt is a letter from 1941.\n\n"
    },
    {
      "time": "15 Nov 2007 — 11:50am",
      "content": "That's the first sentence of the above mentioned letter by Bormann.\n\n"
    },
    {
      "time": "15 Nov 2007 — 11:59am",
      "content": "JP I managed to scan that part. Well, at least it doesn't detract. Thanks.\n\n"
    },
    {
      "time": "15 Nov 2007 — 1:28pm",
      "content": "In case someone is wondering what we are talking about, here is an image of the letter:  \n [http://www.joern.de/borm.gif](http://web.archive.org/web/20150317104833/http:/www.joern.de/borm.gif \"http://www.joern.de/borm.gif\")\n\n"
    },
    {
      "time": "26 Jun 2008 — 4:04am",
      "content": "Conveniently I am studying in Germany at the moment, I will try to remember to ask my typographer teacher about the subject. He's addicted to type. Just throwing this out there though...ANYTHING to do with that era is generally shunned and avoided. So the colors Black and Red are a big no no in design. (Found this out the hard way)\n\n"
    },
    {
      "time": "30 May 2009 — 6:47am",
      "content": "Currently the best source of answers is Silvia Hartmann's dissertation <cite>Fraktur oder Antiqua: Der Schriftstreit von 1881 bis 1941</cite> which includes an exhaustive section of facsimiles from primary sources, including dozens of argumentative letters in 1941 between the BfdS and the Reich authorities, featuring a depressingly escalating appeal to antisemitism from both sides as the BfdS's desperation increased. Really, it's breathtaking how absurdly all-consuming the antisemitism became in every piddly policy spat. The Jews were just a disposable excuse to justify every single random whim inside a growing autocracy that fostered and rewarded magical thinking.\n\n(The closer one looks at this, the more prophetic Franz Kafka's writing seems.)\n\nBlackletter was a minor casualty compared to the countless humans. That it should needlessly remain a casualty, however, is nonetheless sad and absurd. The evil men in charge first embraced this beautiful art form that had evolved over centuries and claimed it as their own, only to destroy it, just like they did the same to Germany itself and a great portion of its rightful citizens.\n\n"
    }
  ]
}
