{
  "id": "39133",
  "title": "[Gentium] Update #5 - Gentium Basic and Gentium Book Basic available for testing",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20071223032348/http:/typophile.com/user/7006 \"View user profile.\") : 15.Nov.2007 4.27am \n\nDear friends of Gentium,\n\nGreat news! We have been hard at work to complete the first versions of [Gentium](http://web.archive.org/web/20071223032348/http:/typophile.com/wiki/Gentium) that include bold and bold italic. For the first time in many years we have a major release for you - in a preliminary test version.\n\nWe have two new font families in the Gentium clan: Gentium Basic and Gentium Book Basic. Each has a complete set of four weights: regular, italic, bold and bold italic. Gentium Book Basic is generally heavier than the original Gentium and better for some publishing uses. Both families also include a few OpenType and Graphite smart font features, including optimized diacritic positioning.\n\nThe new fonts are called ’Basic’ because they support a smaller set of characters than the full Gentium fonts. They only support basic Latin and a handful of extended Latin characters. There is no Greek or Cyrillic, or even full IPA. The purpose is to provide early versions of the new weights that meet the needs of most Latin script users.\n\nNever fear - we haven’t abandoned the main Gentium fonts. Our next task will be to return to them and complete an update of the existing regular and italic to add extended Cyrillic, ancient Greek glyphs, Unicode 5.1 updates, and smart font capabilities. We’d hoped to have this completed by now, but wanted to get the new weights to you as soon as we could. After that we plan to expand the main Gentium family to include these new weights and smart font code.\n\nThe new Basic fonts are only available in beta test right now. They contain known bugs, so we don’t yet recommend them for everyday production use, or as the source for derivative versions. The most serious one is that the lowercase ’z’ has too much space in the heavier italic weights. We plan to release a fixed, final release of the Basic fonts in a month or two, once initial broad testing is done. So we welcome your bug reports and general opinions on the design of the heavier faces.\n\nThe beta test fonts are available at:\n\n[http://scripts.sil.org/Gentium\\_basic](http://web.archive.org/web/20071223032348/http:/scripts.sil.org/Gentium_basic \"http://scripts.sil.org/Gentium\\_basic\")\n\nA few requests:\n\n- please note the limitations and known problems  \n- please do not ask us to expand the Basic character set, as those needs will be met by the complete Gentium font family  \n- please report problems to me at the email address below, not via the download feedback form on the main Gentium download page\n\nThanks again for your interest in Gentium, and the many encouraging emails you have sent.\n\nVictor Gaultney  \nGentium /at/ sil.org\n\n",
  "author": "<a href=\"http://web.archive.org/web/20071223032348/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 15.Nov.2007 4.27am",
  "uid": "7006",
  "comments": [

  ]
}
