{
  "id": "39145",
  "title": "Posterony!",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is a quick and dirty trace job I did from an old Speedball Textbook (16th ed.). It took me about a week.\n\nThe original:\n\n ![](http://web.archive.org/web/20150417044904im_/http:/typophile.com/files/SB_poster_gothic_cond_5292.png)\n  \nand my output:  \n\n ![](http://web.archive.org/web/20150417044904im_/http:/typophile.com/files/posterony_test_image_6559.png)\n\nThe spacing isn't perfect, and I had to create a couple letters to fill out the alphabet, plus all the extras for a complete MacRoman font. See the attached PDF for all that, and to peer into the fleshy curves.\n\nI made it in FontForge mostly using Spiro curves. They get a bit difficult to deal with though, since you have to convert them to Bezier curves to make a usable font and the procedure isn't fully optimized in the current version, requiring much manual tweaking, lest one get 5 or more Bezier points for each Spiro point on a curve.\n\n| Attachment | Size |\n| --- | --- |\n| [PosteronyThree\\_test\\_2.pdf](http://web.archive.org/web/20150417044904/http:/typophile.com/files/PosteronyThree_test_2.pdf) | 35.99 KB |\n\n",
  "author": "cuttlefish",
  "time": "15 Nov 2007 — 3:14pm",
  "uid": "14556",
  "comments": [
    {
      "time": "15 Nov 2007 — 3:58pm",
      "content": "I don't know if you want to keep it true to the original, but I think the 3, 4, 5, 6, 7, 9 and X are too wide. Y too narrow. Some characters are too heavy, like M, S, T and U. B is probably too light, as is C.\n\n"
    },
    {
      "time": "15 Nov 2007 — 4:05pm",
      "content": "Oh I heartily agree they are imperfect. The numbers in general are much too heavy, and the N and X didn't even exist in the original. It is most assuredly time fore some cleanup, but I'm doing this mostly for the experience of translating hand-lettering to digital type, and there are flaws inherent in that process.\n\nI swear I've seen a similar commercial font somewhere, but I just can't place it in my mind. Hmm...\n\n"
    },
    {
      "time": "15 Nov 2007 — 4:32pm",
      "content": "Yeah, it does look somewhat familiar.\n\n"
    },
    {
      "time": "15 Nov 2007 — 8:02pm",
      "content": "Reminds me of some of René Knip's work. If that's what you're thinking; then there's no commercial font; I don't believe he has released a retail design yet.\n\n"
    },
    {
      "time": "16 Nov 2007 — 6:31am",
      "content": "Yeah, it does resemble Knip's style a bit (which isn't a problem). :)\n\n"
    },
    {
      "time": "16 Nov 2007 — 6:35am",
      "content": "If you finish this, I'd make one version with the arrows retained.\n\n"
    },
    {
      "time": "16 Nov 2007 — 7:40am",
      "content": "Well, to include the arrows I'd have to \\*gasp\\* learn how to draw these letters properly, since I'll have to make them up for all the characters not in the original sample.  \nI don't think I even have a Speedball A-1 nib.\n\n"
    },
    {
      "time": "16 Nov 2007 — 10:49am",
      "content": "Well, there are probably not many ways to draw the letters you added yourself.  \nLooking at the image quickly shows that there are only horizontal strokes from left to right and downstrokes.\n\n"
    }
  ]
}
