{
  "id": "3917",
  "title": "Archive through March 12, 2002",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The fact that you need to move eg. a capital T or V at the start of a text line a little to the left when aligning that line with other lines in a flush left text arrangement ... is that due to a phenomenum called\n\n",
  "author": "soreno",
  "time": "8 Mar 2002 — 4:50am",
  "uid": "636",
  "comments": [
    {
      "time": "8 Mar 2002 — 7:35am",
      "content": "The definition I'm finding for \"entasis\" doesn't seem to work for that. The action is called \"hanging\" the glyph over the margin, and the more a glyph's \"optical weight\" is away from its absolute boundaries, the more it's necessary. In the case of quotes (which are small and very off-center) it's common practice to hang them.   \n   \nWhat's interesting is that -technically- this problem is a hold-over from the metal days, when glyphs were necessarily confined to a rectangle (except for the occasional physical kern: a protrusion outside the base block, like sometimes in the beak of the lc \"f\"). Now with digital type and the easy availability of kerning, it's possible to adopt a very different spacing scheme, one that allows everything to hang out (thus inherently accounting for optical weight), and relying absolutely on (positive) kerning to fix any collisions.   \n   \nUnfortunately, virtually nobody does this, because:   \n1. Type design is a conservative field (even after the hooliganism of the 90s).   \n2. It's more work: you need a ton more kerning.   \n3. The user must have kerning enabled, otherwise the setting will look like a freeway pile-up.   \n   \nThe good news is that automatic kerning routines (or perhaps [an evolution of] InDesign's optical spacing algorithm) might make this a reality. Result: totally straight margins.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Mar 2002 — 12:06am",
      "content": "Hrant, my English is not quite good enough, but I will try anyway: when I was asking for an English equivalent to the idea of 'entasis' I was asking for a broader term than 'hanging punctuation'. Because the way we use 'entasis' in Danish, 'hanging punctuation' is only \\*one\\* type of 'entasis'. Others are 'baseline overhang' ... the fact that an UC 'O' is wider than an UC 'H' ... the fact that columns in Greek temples are thicker in the middle to appear straight ...   \n   \nIn other words, 'entasis' is the conception of 'helping \"less\" to look \"the same\" by turning it into \"more\"'.   \n   \nSo, if 'Ford' and 'Volvo' are 'hanging punctuation' and 'baseline overhang' ... what is 'car'?   \n   \nSoren O\n\n"
    },
    {
      "time": "11 Mar 2002 — 7:49am",
      "content": "\\> what is 'car'?   \n   \nYou know, those big pieces of metal that line up on freeways with their prisoners locked up inside...   \n   \nSeriously:   \nNow I understand what you mean. Good question. The few terms that I can think of (like \"optical compensation\") are neither elegant nor very accurate. I think maybe \"entasis\" is just fine.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Mar 2002 — 1:11am",
      "content": "So ... why don't we start a new thread in \"Typophile Open Directory Project\" -- a place to accumulate \"new\" words, infrequently used words and the like (all related to type design and typography of course)?   \n   \nSoren O\n\n"
    },
    {
      "time": "12 Mar 2002 — 7:31am",
      "content": "Good idea. I have \"bouma\" waiting to lunge.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Mar 2002 — 11:57pm",
      "content": "'Bouma' was exactly the one I was thinking about, a word I would expect to find in that kind of dictionary. Yesterday, I nearly posted a follow-up just saying \"Words like 'bouma'\". Instead, I got the idea to see if Google knew 'bouma'. I learned that the word itself is not new -- there is a company in Montana dealing with 'Bouma Trucks' or something like that.   \n   \nAnyway, what should be the name of the thread, and exactly what words should be included -- apart from 'entasis' and 'bouma'?   \n   \nSoren O\n\n"
    },
    {
      "time": "11 Mar 2002 — 6:11pm",
      "content": "That sounds like a great word for English speakers to borrow to convey that idea, like we did with the German word \"gestalt.\"   \n   \nI don't know of any other word in English that sums up the same idea as well as \"entasis.\"   \n   \nDavid\n\n"
    }
  ]
}
