{
  "id": "39170",
  "title": "Logo for Freelance Light Engineer",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "How do you like this one?\n\nIt’s a logo for a freelance light engineer based in Germany. “Oving” is the guy’s name and “Lichttechnik” means “Light engineering”. For the type I used Myriad and then customised all letters except “v”. Please let me know how you like it and what could be improved. Cheers!\n\n ![](http://web.archive.org/web/20071202140113im_/http:/www.typophile.com/files/logo_5377.png)\n\n [‹ Wordmark for Home Baby Care](http://web.archive.org/web/20071202140113/http:/www.typophile.com/node/39189 \"Go to previous forum topic\") [a8 music ›](http://web.archive.org/web/20071202140113/http:/www.typophile.com/node/38966 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071202140113/http://www.typophile.com/user/19464\" title=\"View user profile.\">Tintin81</a>",
  "time": "<br>",
  "uid": "19464",
  "comments": [
    {
      "time": " 16.Nov.2007 8.27pm",
      "content": "Well, I guess you have spent a lots of your time on  \njust the Photoshop Bevel instead on the logo itself.\n\nRedo, I’d say.\n\n"
    },
    {
      "time": " 16.Nov.2007 9.16pm",
      "content": "I’d have to agree with satya. Gradients and bevels only cause problems in logos, and rarely work well.\n\nBut, the worst problem I see is that it reads “Qving.”\n\n"
    },
    {
      "time": " 16.Nov.2007 9.25pm",
      "content": "I read it as Qving too. Your pic really does look like Tintin. I am glad someone does. :-) But back to the logo. I would keep trying more ideas. If you a jam for timeI suggest that you loose the connection to the O and let the Letters be their regular shapes and heavily letterspace the caps out under Oving. But if you have some time I would keep brainstorming & see what you think of.\n\n"
    },
    {
      "time": " 17.Nov.2007 2.48am",
      "content": "OK, how about this then...\n\n ![](http://web.archive.org/web/20071202140113im_/http:/www.typophile.com/files/logo__5730.png)\n\n[Web Design Hamburg](http://web.archive.org/web/20071202140113/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 17.Nov.2007 3.54am",
      "content": "Yeah, but what about Q\\_ and that ugly cut\\_?\n\n\\ now correct spacing between “Oving” and the “LICHTTECHNIK”.  \n\\ The dot on the letter “i” is too low.  \n\\ Myriad is a one of its kind, please don’t mess with it.  \n Use em properly and it will look awesome by default.\n\nRight now, it looks like you have used a total 4  \n typefaces in one logo. The visual language of Q, vi, ng and  \n the LICHTTECHNIK is completely different from each other.  \n Try to do something so that it looks a part of a family even  \n if you edit them.  \n\\ Also at the bottom its looking a bit weired cause one side(O) is very  \n edgy yet the another side(g) is too roundish. And on the top its vice-versa.  \n\\ You will get some valuable feedback from other Typophiles too.\n\nAll the best.  \n Satya\\_\n\n"
    },
    {
      "time": " 17.Nov.2007 4.56am",
      "content": "I wonder if you’re not getting into minute details of form too early out here. First of all it has to communicate a clear idea. I’m not sure it does with this concept.\n\nWhat I’d do would be to explore as many diverse ideas as possible, without spending too much time on finetuning forms. The formal details can be resolved once you feel confident about any of those routes.\n\n"
    },
    {
      "time": " 17.Nov.2007 7.16am",
      "content": "Yeah, I think you got to involved with the details too early. There doesn’t seem to be much of a concept here, just letters customized for no reason except to be customized.\n\nThat and I see a sperm entering the egg.\n\nDavid\n\n"
    },
    {
      "time": " 17.Nov.2007 7.44am",
      "content": "I agree with what the others have said. There’s no real unifying theme to the elements in the logo.\n\nWhat do you want the logo to communicate to a viewer?\n\n- Lex\n\n"
    },
    {
      "time": " 17.Nov.2007 8.16am",
      "content": "I disagree with a lot of what’s been said, except for the Qving problem. I think that the chunky letters with the connection below have a strong mechanical feel that’s entirely appropriate to a lighting technician. The same goes for the idea of using a gradient—I think that have a lit version of the logo for the internet and color printing and a plain version for single-color use is a great idea, albeit one that needs to be carried out very carefully with some overlaid shapes in illustrator.\n\n"
    },
    {
      "time": " 17.Nov.2007 8.38am",
      "content": "I’d think it’s an interesting concept if the O/Q was meant to be a light bulb connected to some sort of circuit.\n\nBut again I’m not sure that’s the best logo idea for a lighting technician. I wouldn’t say ’that’s it, just resolve the details’\n\n"
    },
    {
      "time": " 17.Nov.2007 10.09am",
      "content": "Glowing Ideas for free :)  \n\\\n\n ![](http://web.archive.org/web/20071202140113im_/http:/www.typophile.com/files/Ideas_for_life_6202.jpg)\n  \n\\  \nMetaphor : A Bulb and the Battery.\n"
    },
    {
      "time": " 17.Nov.2007 10.33am",
      "content": "Satya, those sketches and glows look really fantastic.\n\n"
    },
    {
      "time": " 17.Nov.2007 10.41am",
      "content": "... red light ;)\n\n"
    },
    {
      "time": " 17.Nov.2007 11.00am",
      "content": "Thanks, Dan.\n\n——  \nBtw, i dont see you much on the Typophile these days.  \nHope you are not working too much at Reading :)\n\n"
    },
    {
      "time": " 17.Nov.2007 1.37pm",
      "content": "Timo,\n\nThe image below is just a 5 minute play about to see how basic it can be. It’s about what you get rid of, not what you keep. The more convoluted the concept becomes, the less successful the logo will be.\n\n ![](http://web.archive.org/web/20071202140113im_/http:/www.typophile.com/files/oving_ideas_5567.gif)\n\nSatya: <cite>Myriad is a one of its kind, please don’t mess with it.<br>\nUse em properly and it will look awesome by default.</cite>\n\nDon’t use any typeface in a default way when in a logo! As a bare minimum the spacing needs to be adjusted. There is no harm in modification of the forms as long as they end up looking like they belong together.\n\nGood luck\n\n"
    },
    {
      "time": " 17.Nov.2007 1.57pm",
      "content": "Maybe you could work the tail of the g into an electric cord underlining the rest of the font to add to the “light/lighting/electrical” feel. I’m trying to think of how to make my idea not look cheesy and I’m a bit stuck. :\\\n\n"
    },
    {
      "time": " 18.Nov.2007 11.44am",
      "content": "Hey,\n\nThanks you guys, especially to satya for the nice “sketches and glows”!  \nMy client hasn’t reported back to me, but will hopefully do so very soon. So I should be posting an updated version of the logo here soon. Thanks...\n\n[Web Design Hamburg](http://web.archive.org/web/20071202140113/http:/www.designbits.de/)\n\n"
    }
  ]
}
