{
  "id": "39185",
  "title": "Yep...another design studio logo in need of critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey all! I've lurked around here for quite awhile but never really posted anything. Nevertheless, I've found it very enriching to read your critiques and watch the creative process at work.\n\nMy brother and I are in the process of starting up a graphic design / fine art company, and I'm trying to finalize a logo. We're planning to do a wide variety of things, from basic design work (identity, signage, etc.) to music-oriented work (gig posters, album art) to more traditional artwork (painting, murals). We both tend toward \"quirkiness\" in our work, I guess you could say.\n\nI've sketched out a bunch of ideas, and this seemed to be the strongest to me. I'm reluctant to explain myself too much, because I really want to see what comes across to you through this logo. Needless to say, it's not strict typography. Any suggestions are much appreciated!\n\n ![](http://web.archive.org/web/20131019044327im_/http:/typophile.com/files/reinvention_design_idea_3456.png)\n\n",
  "author": "Chris Scales",
  "time": "17 Nov 2007 — 11:50am",
  "uid": "18551",
  "comments": [
    {
      "time": "17 Nov 2007 — 1:19pm",
      "content": "I like your logo, it rocks.  \nThe socket of the lightbulb is screwed into the word design like you are saying \"screw design\". Reinvention is exactly that, and spelling it out in your font of choice is perfect for the concept. I get the idea!?  \nThin strokes, like those in the middle of the lightbulb, will be hard to print in smaller versions and then the lightbulb might look like a sun. You could do something to the \"DESIGN\" as it do not look as good as the \"REINVENTION\", maybe try to make it more related by removing the serifs on the \"I\" (but that might go against the concept?).  \nGreat colors!  \nLove it! Well done and best of luck!\n\n"
    }
  ]
}
