{
  "id": "39189",
  "title": "Wordmark for Home Baby Care",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This logotype is for a service that you can get for the first few months of bringing your new baby home. They will help out by watching your baby throughout the night so you can sleep - or come do your laundry, run your errends so you can spend time with your baby...  \nAlso considering \"Welcome Home\" as the tag line instead of \"Welcome Baby\"\n\nFeedback on these different versions would be most appreciated.\n\n ![](http://web.archive.org/web/20131107041412im_/http:/typophile.com/files/PromiseCare_A_4119.gif)\n\n",
  "author": "designwithin",
  "time": "17 Nov 2007 — 3:04pm",
  "uid": "24058",
  "comments": [
    {
      "time": "17 Nov 2007 — 11:01pm",
      "content": "That's an interesting service: Take the pain out of parenting!\n\nI agree with you; Welcome Home sounds better than Welcome Baby. But probably there is a risk of that being a little generic. Why not Baby's Day In ;)\n\nFor the logo, nice choice of typeface. Somehow the very first option - without any modification - looks the best of the lot. If you want to have the loop device, perhaps you cold think of a way of integrating it with the tagline.\n\nAlso it may be an idea to tweak the small-caps height a little. Probably 80-85% of cap height.\n\n"
    },
    {
      "time": "18 Nov 2007 — 8:05am",
      "content": "Try building a Mother & the Child relationship in your logotype if possible.  \nThe best typographic solution I can remember is Herb Lubalin's \"Mother & the Child\" logo (1965).\n\n ![](http://web.archive.org/web/20131107041412im_/http:/typophile.com/files/mother%20and%20child_6559.jpg)\n\n"
    },
    {
      "time": "18 Nov 2007 — 8:19am",
      "content": "Even minimalistic.\n\n ![](http://web.archive.org/web/20131107041412im_/http:/typophile.com/files/Mother%20and%20child2_5060.jpg)\n\n"
    },
    {
      "time": "18 Nov 2007 — 8:17am",
      "content": "And the father Adrian Frutiger's Mother & Child.\n\n ![](http://web.archive.org/web/20131107041412im_/http:/typophile.com/files/233827696_1f93581ae7_4349.jpg)\n\n"
    },
    {
      "time": "18 Nov 2007 — 9:41am",
      "content": "But then this service is not quite about mother and child, is it?\n\n"
    },
    {
      "time": "18 Nov 2007 — 9:55am",
      "content": "No, I didn't asked to implement the same idea.  \nBut something like this can also convey that they will take care of your  \nbabies just like the mothers do.\n\nThe word \"Promise Care\" should speak itself.\n\n"
    },
    {
      "time": "18 Nov 2007 — 10:02am",
      "content": "Arun:\n\nBtw,  \nAre you the same Arun Kumar from Rediffusion DYR, Bangalore\\_?\n\n"
    },
    {
      "time": "18 Nov 2007 — 10:14am",
      "content": "Sure.\n\nProbably a rather oversized C drawn so that it cups the letters that follow. A bit like some of the C/o ligatures shown on this thread: [http://typophile.com/node/39183](http://web.archive.org/web/20131107041412/http:/typophile.com/node/39183 \"http://typophile.com/node/39183\")\n\n"
    },
    {
      "time": "18 Nov 2007 — 10:22am",
      "content": "\"Are you the same Arun...\"\n\nNo Satya. Bangalore has far too many people with that name these days :(\n\n"
    },
    {
      "time": "18 Nov 2007 — 12:20pm",
      "content": "\\> Probably a rather oversized C drawn so that it cups the letters that follow.  \n\\> A bit like some of the C/o ligatures shown on this thread:  \n\\> [http://typophile.com/node/39183](http://web.archive.org/web/20131107041412/http:/typophile.com/node/39183 \"http://typophile.com/node/39183\")\n\nInteresting... And I think it would support the idea of the company... which is to provide support. I will try this out..\n\nThe company is also considering a division that would work in the same way for elder care. Again, helping to come over and clean, do laundry, do errands, etc. So I dont want to play up the Mother/Child connection as I would like to play up the ideas of care and support. Not sure what the tag line will be for that division...\n\n"
    },
    {
      "time": "18 Nov 2007 — 1:54pm",
      "content": "Going to second Welcome Home over Welcome Baby.\n\nWelcome Home gives the feel that someone is already there doing things to help you out and take care of you. \"We'll support you while you support your [new] baby\"\n\nWelcome Baby is more suited to greeting cards or baby shower banners\n\nFor the elderly servive maybe also consider companionship/company. I think a lot of elderly are capable but aren't as independant anymore and get lonely since they may not be able to drive or get around that easily. They might also be sensitive about needing help\n\n"
    },
    {
      "time": "19 Nov 2007 — 9:59am",
      "content": "Would you use Welcome Home then for both divisions or what would you use for Elder Care?\n\n"
    },
    {
      "time": "19 Nov 2007 — 10:44am",
      "content": "Well, do you really need a tagline?\n\nIt may be better to just have a descriptor instead. Something as straightforward as: Housekeeping help for the not-so-young.\n\n"
    },
    {
      "time": "19 Nov 2007 — 4:27pm",
      "content": "In 1, the way the R cradles the O serves your theme best, but repeating it with the sharp-cornered E in \"care\" fails; it draws attention away from the RO, which if allowed to stand alone as the focus of the logo would evoke quite well what Satya is on about. Perhaps you could even make the O somewhat larger to make it more clear.\n\nOf the the designs given, I think you can eliminate 2, in which the swash wanders toward then away from the tagline, 3, in which it wanders away before coming back, and 4, in which it just leads away from the whole thing. These all have an undertone of inattention, which you certainly don't want. 5 is the most aesthetically pleasing in that regard, as it leads directly to the tagline just as you would hope the attendant would run straight to the baby when it needs something.\n\n"
    },
    {
      "time": "31 Dec 2007 — 6:49am",
      "content": "Thank you all for your time and feedback!\n\n"
    },
    {
      "time": "31 Dec 2007 — 2:11pm",
      "content": "I want to see the final result when you're done! ;)\n\n------------------------------------------------------:  \nJean Chouinard (formerly emerjean on Typophile)\n\n"
    },
    {
      "time": "1 Jan 2008 — 9:51am",
      "content": "Yup, I think you should gain inspiration from th emother and child idea.\n\n"
    }
  ]
}
