{
  "id": "39211",
  "title": "American Type Foundry Rock Stars",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A friend of mine, who shall remain nameless, recently mentioned that he thought there were four American type foundries that were truly top notch.\n\nHe listed Font Bureau, House Industries, H&FJ, and Emigre, and implied that there weren’t really any others that came close.\n\nI mentioned a couple that I thought were contenders, but he contended that these four were THE rock stars, and that any other than them were more like ’indie rock.’\n\nThere are obviously lots of talented individuals outside of these, but what about other companies?\n\n [‹ Survey: Global - Regional](http://web.archive.org/web/20081203113634/http:/www.typophile.com/node/39195 \"Go to previous forum topic\") [Problems with vector logotype - could you help me? ›](http://web.archive.org/web/20081203113634/http:/www.typophile.com/node/39198 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203113634/http://www.typophile.com/user/11130\" title=\"View user profile.\">JLM</a>",
  "time": "<br>",
  "uid": "11130",
  "comments": [
    {
      "time": " 18.Nov.2007 9.20pm",
      "content": "Adobe is certainly top notch also.\n\n"
    },
    {
      "time": " 18.Nov.2007 9.20pm",
      "content": "I think the analogy is wrong. These are not rock stars or even rock bands they’re record labels.\n\n"
    },
    {
      "time": " 18.Nov.2007 9.29pm",
      "content": "True enough. Though if the company is the record label, the rock stars are the designers who in turn own the record label (in most of these cases - Adobe notwithstanding).\n\n"
    },
    {
      "time": " 19.Nov.2007 4.24am",
      "content": "Si is right. Also the Mono-Lino conglomerate has to be there, as well. They have a lot of both good and bad in their back list, and their new stuff is also uneven. But they have so many classics and enough good recent stuff that I would think you have to include them.\n\nSo from the point of view of ’labels’ the big 5 (in no particular order) are probably: FontBureau, H&FJ, House Industries, Monotype Imaging, and Adobe.\n\nI don’t include Microsoft, as its type is normally included with software, rather than sold separately. Beyond those 5, you would probably get more arguments, including about Emigre.\n\nedit: On second thought, if you are thinking ’quality’ any list of foundries is probably misconceived. The story of type in the past ten years is as much a story of \\*individuals\\* as foundries, though both are important. For example, Village, with its collection of outstanding designers, may be as much of a factor now as House or Emigre. And Christian Schwartz, who has published through a number of foundries and collaborations, is so productive and his quality so high that he on his own is a virtual foundry. Then you have one-man American shops like those of Typophilers Mark Simonson and Eric Olsen, who also have a large and high quality body of work.\n\nAnd among distributors you have Veer and Bitstream (MyFonts), who also have high quality work that is exclusive.\n\nSo I don’t think a picture of a big 5 is very representative of what is going on in the production of type in the US.\n\n"
    },
    {
      "time": " 19.Nov.2007 6.22am",
      "content": "From what I can tell, P22 also seems to fall under the label/distributor category, even though they also produce their own fonts.\n\n"
    }
  ]
}
