{
  "id": "39225",
  "title": "No OT features in CorelDraw X13?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi there!!\n\nI was testing my fonts in CorelDraw x13 and had a big surprise! I couldn't find anywhere to acess opentype features such as stylistic alternates and discretionary ligatures... actually, when I searched the help in Corel, I didn't find anything related to \"opentype\" or \"open type\". In the section of font formats, in help, OT doesn't even appear. Too weird...\n\nMy AFTER fonts ( [http://www.myfonts.com/fonts/bytype/after-headline/](http://web.archive.org/web/20130823072027/http:/www.myfonts.com/fonts/bytype/after-headline/ \"http://www.myfonts.com/fonts/bytype/after-headline/\")) have lots of special ligatures that aren't encoded, so I can't even acess them in the INSERT SPECIAL CHARACTER box because the software only shows encoded gliphs :/ dammit Corel!!\n\nIs Corel indeed like this or someone knows how to solve this?\n\nthks!!  \nFabio\n\n",
  "author": "haag",
  "time": "19 Nov 2007 — 8:45am",
  "uid": "2079",
  "comments": [
    {
      "time": "19 Nov 2007 — 10:59am",
      "content": "You must assign Unicode indexes to ALL GLYPHS (of course from PUA, to avoid possible conflicts).\n\n"
    },
    {
      "time": "19 Nov 2007 — 11:10am",
      "content": "Thanks Henyk... that seems to be the only way.\n\nI remember I read in FL manual that some foundries use the PUA unicode range for special characters, while others don't, for reasons I can't remember now.\n\n"
    },
    {
      "time": "19 Nov 2007 — 11:31am",
      "content": "Using PUAs in retail fonts is generally a bad practice, so you should avoid it.  \n [http://www.typophile.com/node/16858](http://web.archive.org/web/20130823072027/http:/www.typophile.com/node/16858 \"http://www.typophile.com/node/16858\")\n\nFYI, Adobe has abandoned the practice of assigning PUAs on new fonts:  \n [http://blogs.adobe.com/typblography/2006/05/eliminate\\_priva.html](http://web.archive.org/web/20130823072027/http:/blogs.adobe.com/typblography/2006/05/eliminate_priva.html \"http://blogs.adobe.com/typblography/2006/05/eliminate\\_priva.html\")\n\n"
    },
    {
      "time": "19 Nov 2007 — 12:24pm",
      "content": "So do I get this right: a small cap A, for example, should be 'A.small' with no unicode assignment at all?\n\n"
    },
    {
      "time": "19 Nov 2007 — 12:36pm",
      "content": "Yes.\n\n"
    },
    {
      "time": "19 Nov 2007 — 1:02pm",
      "content": "I'll also add that the glyph suffix is arbitrary, i.e. the smallcap A could be named \"A.smcp\" or \"A.sc\" or \"A.small\" or anything else.\n\nA.\n\n"
    },
    {
      "time": "19 Nov 2007 — 1:07pm",
      "content": "Yes, its bad customers use Corel, Freehand or Word.\n\n"
    },
    {
      "time": "19 Nov 2007 — 1:31pm",
      "content": "<cite>with no unicode assignment at all?</cite>\n\nWell, it depends.  \nThe bad thing about insertig PUA characters is, that you will mess up the text. You cannot change the typeface, without having wrong characters, spell checking won't work and so on.  \nBut if you design a display typeface this is not so much of a problem. And if you know your customers will use CorelDRAW you may rather do the wrong thing ... and make your customers happy.\n\nRalf\n\n"
    },
    {
      "time": "20 Nov 2007 — 3:08am",
      "content": "Thanks every one for the comments... it's all clear now.\n\nI knew Corel sucks, but not that much.\n\nProducing Corel friendly versions of the fonts is not nice, and mess a little the production process, but I'll end up doing it for these \"special\" customers.\n\nthks again\n\n"
    },
    {
      "time": "20 Nov 2007 — 7:42am",
      "content": "\"I knew Corel sucks, but not that much.\"\n\nAnd Adobe is sucking more and more each day.\n\nI'm still holding on to Freehand but will have to give in soon. I'm trying to avoid the Adobe CS suite, though I know I'll end up with it.\n\nI do want to consider the alternatives, though. Corel is definitely a contender.\n\n"
    },
    {
      "time": "20 Nov 2007 — 11:21am",
      "content": "Corel is pathologically correctly interact with system font driver then under Vista you may forget about PUA :))\n\n"
    }
  ]
}
