{
  "id": "39228",
  "title": "Bullets in the Gutter?",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "Google thinks I'm inquiring about gang life, and the Typophile search isn't turning up anything either. I'm sure this has been covered some where in these forums, but for the life of me, I can't find it. I'm a noob, and the resources I've found in books and on the Internet haven't been terribly explicit on this.\n\nShould [bullets](http://web.archive.org/web/20150416142220/http:/typophile.com/wiki/bullet) be hung in the gutter beyond all of the text, OR should they align with the header and body copy, OR should they be indented. In the latter two options the bullets would be hung beyond the bulleted text, but not the regular body copy. The first one it would be hung all the way out into the gutter, beyond the grid.\n\nI'm being redundant because I'm trying to be clear.\n\nMy first impression was that they should be hung all the way out the gutter, and the bulleted text should remain aligned with regular text, but now I'm not sure.\n\nAlso, an en-dash between the bullet and the text?\n\nI'd appreciate the education I didn't receive in college.  \nThanks!\n\n",
  "author": "kobhart",
  "time": "19 Nov 2007 — 9:33am",
  "uid": "17684",
  "comments": [
    {
      "time": "19 Nov 2007 — 9:52am",
      "content": "No. The bullets should not go into the gutter. You need that. What you do is indent the left margin in by the width of a bullet and a space, and then you hang the bullet and the space into the resulting indent. End the indent when the bulleting ends.\n\n"
    },
    {
      "time": "19 Nov 2007 — 10:09am",
      "content": "So they are not in the gutter. I was mistaken, I thought so.  \nAnd your bulleting would look like option 1, rather than option 2...right?\n\n ![](http://web.archive.org/web/20150416142220im_/http:/typophile.com/files/bullets_6366.jpg)\n\n"
    },
    {
      "time": "19 Nov 2007 — 10:10am",
      "content": "As long as there is the space available, I like to put my bullets or dashes (or digits, etc) in the gutter.\n\n"
    },
    {
      "time": "19 Nov 2007 — 10:27am",
      "content": "I tend to go with Option 1, indent and align. I think it makes the information easier to scan through. However, it does get confusing if you have multiple levels of indenture (I've had a document with 6 starting I. A. 1. a. i. 1.) ), so having hanging bullets/numbering does make things cleaner.\n\nI would consider this decision to be at the designer's discretion. Thought, if someone disagrees I'd be very interested in hearing the reasoning (for or against). I also didn't learn everything I probably should have while in school.\n\n"
    },
    {
      "time": "19 Nov 2007 — 10:29am",
      "content": "There is no rule. Each job will have different possibilities. As Dan says, if you have a wide enough gutter so the bullets will not get lost in the bind or trim, then they can hang. & that is a perfectly fine position for them, as long as the rest of the design, the design as a whole, supports this position.\n\nAn en space is a very good idea.\n\nAnother good idea is to use a center dot instead of a bullet. 99% of bullets are way too fat. Of course, for a lot of uses the center dot may be too small. In that case I like to scale the bullet down or the dot up to some middle weight. Or screen the bullet or run it as a softer color to lessen its impact.\n\npowers\n\n"
    },
    {
      "time": "19 Nov 2007 — 10:46am",
      "content": "center dot, is that also known as \"period centered?\" (·). (ALT+0183 on a Windows machine or Shift+Option+9 on a Mac)\n\n"
    },
    {
      "time": "19 Nov 2007 — 11:31am",
      "content": "Thanks for the responses. Very enlightening.  \nI've done it both ways in the past, and wasn't sure if either one was correct. I like Option 1 simply because it's easier to set, and won't get messed if there are content changes in the document later on down the line.\n\nWhen I did hang the bullets in the gutter in the past, I either put the bulleted text in a separate text box, and moved it's x-location to the left and then tabbed the bulleted text to line up with the rest, or I added each of the bullets manually in separate boxes. Neither way was very ideal since the copy I get to begin with hasn't been finalized. It's a pain, but I do like the way it looks.\n\nAnyways, thanks again everybody for the input. This had been bugging me.\n\nKevin\n\n"
    },
    {
      "time": "21 Nov 2007 — 10:13am",
      "content": "Two things to say here:\n\n#1:  \nYES: the smaller bullet is also known as a centered period. & Yes: it is at shift+option+9 on a Macintosh. I don't know from Windows.\n\n#2:  \nIf you get deeper into your program, and use a variety of indents, you will not need to drop the bullet list into a separate text box. Then you can keep all text in the same text flow, and as you make changes to text before the bullets, you'll not need to move that box by itself.\n\npowers\n\n"
    }
  ]
}
