{
  "id": "3922",
  "title": "Archive through May 24, 2002",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As you've probably gathered, I am a general newbie to the whole typography thing. I have come across Atypi as some pretty official typography thing. Is it to typography what W3C is to the web? And is it worth joining? Or is it completely out of my league?   \nThanks in advance,   \nMatthew\n\n",
  "author": "matthew_dob",
  "time": "22 May 2002 — 4:39am",
  "uid": "600",
  "comments": [
    {
      "time": "22 May 2002 — 12:41pm",
      "content": "Ditto on TypeCon. Come if you can! I'll be   \nthere in Toronto with my chicken. Let's   \nhave a Typophile rendezvous.   \n   \nLast year was a good time.   \n   \nStephen\n\n"
    },
    {
      "time": "22 May 2002 — 12:48pm",
      "content": "The speakers at ATYPI will be amazing this year. And I've   \nheard they usually are amazing. I'm looking forward to a   \nmind expanding trip to Rome ... and the food. ;-) If you   \ncan afford it, don't feel like you shouldn't go because you   \nare a newbie. I'm going to be a newbie this year too.\n\n"
    },
    {
      "time": "22 May 2002 — 1:02pm",
      "content": "\\> I'll be there in Toronto with my chicken.   \n   \nI'll bring the stuffing!   \n   \nhhp\n\n"
    },
    {
      "time": "23 May 2002 — 3:27pm",
      "content": "Seriously:   \n   \nFirst, there was a discussion about this on the ATypI list itself, a little over a year ago. It starts here:   \n [http://www.textmatters.com/pipermail/members/2001-February/014320.html](http://web.archive.org/web/20131020191348/http:/www.textmatters.com/pipermail/members/2001-February/014320.html)   \n   \nThe conference and membership are not strongly related; the conference discount you get does not make up for the membership. So attending a conference is a great idea for anybody, as long as you can justify the cost wrt what you get out of it. But even for somebody with not enough reason to be a regular at ATypI conferences, it's probably a good idea for any font freak to do it at least once, especially if there's a geographic facility. And Tiffany's right about Rome: it does look like it's going to the best one in a while. But I've only been to two before, so...   \n   \nNow, when it comes to being a paying member, that's frankly much harder to justify. I suspect that many people do it as a socio-professional obligation. Some people do it because it does feel like a fraternity, to some extent. And some people do it because they're freaks (like my case). On the other hand, membership does have its priviledges: you get first access to certain publications; you get to ask questions of the notably illustrious members (as opposed to just listening to them); and once in a while you get favorable treatment versus non-members (which is natural for any organization).   \n   \nSo give it all some serious consideration, and you might find that it's for you after all.   \n   \nhhp\n\n"
    },
    {
      "time": "24 May 2002 — 6:21am",
      "content": "Jonathan --   \n   \nI think what Hrant meant (he can confirm once he wakes up out there) was the ATypI mailing list, which nonmembers can \"audit\" on the web but to which they cannot post.   \n   \nOf course, with regard to the conferences, you're right. There's no distinction, and it's a wonderful opportunity for beginners and oldtimers alike. Speaking from experience: that's where I got my jump-start, thanks to Jonathan, Matthew Carter, Jill Pichotta, and other notables too numerous to mention.   \n   \n-- K.\n\n"
    },
    {
      "time": "24 May 2002 — 8:49am",
      "content": "\\> there are quite a few illustrious long-time attendees who aren't members   \n   \nTrue\\*, but like Kent said, I was talking about the mailing list, and by extension actual membership in the organization (as opposed to going to a conference, a much less nebulous decision to make). Unless you have a very large loudspeaker (not to mention more gall than would be advisable, even by me) you can't ask questions to a collection of experts during the conference. Not that most of them generally reply on the ATypI list anyway :-/ especially if you're unwilling to spend a few years groveling before asking anything of any significance...   \n   \n\\* In fact, I would point to this as an indication of the large difference between being a member versus going to the conference.   \n   \n\\> that's where I got my jump-start   \n   \nMy own intial large-scale exposure to other type designers (at least in the physical realm - which still has advantages over cyberspace) was at the supremely wonderful TypeCon98. That was one trippy event, with an atmosphere completely different (and certainly much more \"open\") than ATypI99 in Boston, my second outing.   \n   \nhhp\n\n"
    },
    {
      "time": "24 May 2002 — 9:18am",
      "content": "Well, I agree with everything you just wrote, but I don't think we're actually talking about the same thing.   \n   \nhhp\n\n"
    },
    {
      "time": "24 May 2002 — 9:46am",
      "content": "Please keep talking. The more you talk, the more   \nexcited ... (does that make me somewhat lame?)   \n... I become to sit and listen to seminars on the   \nhistory of type. Slightly off-topic ... What   \nabout a good list of hotels? Any ideas?\n\n"
    },
    {
      "time": "24 May 2002 — 9:54am",
      "content": "\\> What about a good list of hotels?   \n   \nThere's one called the Palatino.   \n   \nhhp\n\n"
    },
    {
      "time": "24 May 2002 — 10:10am",
      "content": "Yes, this is _slightly_ off topic, but only a tiny bit.   \n   \nIn principle, the idea of being able to bump into people at conferences seems appealing and accessible to all, but it can be very hard for some of us to build up the courage to speak to those whom we hold in such high regard, Jonathan.   \n   \nTypeCon2002 is going to be my first conference, and while I may seem fairly confident on the web or via email, it is a different matter altogether in person. Shyness and a lack of confidence carries the risk of being misconstrued as aloofness and arrogance unfortunately.   \n   \nSo, maybe I could suggest that some of us on Typophile who are travelling to Toronto for TypeCon2002 arrange to meet up for a drink, break some ice and get to know eachother a bit better?   \n   \nJust a thought ![:)](http://web.archive.org/web/20131020191348im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "24 May 2002 — 11:34am",
      "content": "Ahh David!   \n   \nGlad you are coming! I think you'll enjoy it lots and lots! I would have been there this year but my son is due the day Typecon starts. . . . the wife just won't let me get away for it :D   \n   \nAnyhow, to your point about meeting people that you only know by name and work. You have no reason to psych yourself out about approaching personal idols of typography.   \n   \nChances are you'll both look at eachothers nametag and instantly know who one another is. It's actually quite fun! People are suprisingly approachable and for the most part wouldn't have gone to the conference if they too weren't intersted in \"getting out from behind the monitor\" to meet the world!   \n   \nBring some of that good UK lager, you'll be making friends before you know it!   \n   \nStuart :D\n\n"
    },
    {
      "time": "22 May 2002 — 12:34pm",
      "content": "If you are looking for something a little less \"official\"\n\n"
    },
    {
      "time": "24 May 2002 — 5:24am",
      "content": "\\> you get to ask questions of the notably illustrious members   \n\\> (as opposed to just listening to them)   \n   \n   \nEveryone's welcome to participate in ATypI, members or not. There's no distinction, and frankly there are quite a few illustrious long-time attendees who aren't members. So come to Rome!\n\n"
    },
    {
      "time": "24 May 2002 — 9:10am",
      "content": "\\> you can't ask questions to a collection of experts during the conference   \n   \nI've been going to ATypI since 1989, and this really hasn't been my experience. At my first ATypI, I met Mike Parker at dinner, Erik Spiekermann at a cocktail party, Erik and Just at my hotel, and John Dreyfus en route to Adrian Frutiger's house.   \n   \nI certainly wouldn't recommend using the question and answer session after someone's lecture to discuss personal business, nor is it a good idea to buttonhole anyone without warning, but this has less to do with ATypI than with good manners. I've enjoyed meeting a lot of people at ATypI over the years, and I'd recommend the conference to anyone interested in type.\n\n"
    }
  ]
}
