{
  "id": "39233",
  "title": "My first typeface.",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Gentle forum-goers, presented here is the first rendition of a future typeface.\n\nI have never designed a font before, so these humble trials are unlikely to receive anything but righteous scorns from seasoned and experienced typographers. Still, I feel that this task might be a good learning experience.\n\nTo make things easier, I decided to settle on an orderly geometric san-serif display face, largely composed of simple repeating elements, and a slight nostalgic quirkiness. I'll try posting the scans of the original sketches when I get home.\n\nWhat is the intended purpose of this face? Aside from practice, I was thinking about a unique display font to be used in the title of a hypothetical magazine dealing with computer history and retro-gaming. But that was just to give myself some kind of a direction, as I don't think this font would ever see the light of day.\n\nI am treading in uncharted (for me) waters, so I'll greatly appreciate any critiques and suggestions.\n\n ![](http://web.archive.org/web/20150417084335im_/http:/typophile.com/files/oxfordhire_4419.gif)\n\n",
  "author": "oprion",
  "time": "19 Nov 2007 — 10:41am",
  "uid": "23991",
  "comments": [
    {
      "time": "19 Nov 2007 — 11:10am",
      "content": "Is there any specific purpose of having the strokes monolinear\\_?  \nYour horizontals must be a little thinner than the vertical strokes.\n\nAlso, I found \"s\" and \"r\" a bit problematic.\n\n"
    },
    {
      "time": "19 Nov 2007 — 11:15am",
      "content": "OPen up the spaces between the Glyphs. That way you can design it to work in more that one way. The openess of the counters and the tight spaceing don't seem to go together to me eye. Also, making your face geometric doesn't absolve you of needing to compensate ( in non-geometric ways ) for the needs of the eye. This means tapering joins. It can still appear geometric. But this way it will look less clunky. Look at the join on the r. I would open up the mouth of the e. Make the D wider. Consider what widths look best for each letter. This isn't a monospace so take advantage. A full character set would help too.\n\n"
    },
    {
      "time": "19 Nov 2007 — 3:47pm",
      "content": "As redundant as one might be tempted to feel it is, it seems you've somehow managed to give this face its own personality. Keep at it.\n\nYour rounds overshoot the baseline a little too much, I think.\n\n"
    },
    {
      "time": "19 Nov 2007 — 5:27pm",
      "content": "Kevin is right about the overshoot.\n\n"
    },
    {
      "time": "19 Nov 2007 — 5:38pm",
      "content": "Thanks Everyone! I'll try to adapt your wonderful comments to the design, and will post a new version.\n\nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20150417084335/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "22 Nov 2007 — 1:55pm",
      "content": "Your welcome!\n\n"
    },
    {
      "time": "22 Nov 2007 — 2:19pm",
      "content": "There's too much re-using of common elements, and you should pay some more attention to the way the curves turn into straights — that oughta be more flowing.  \nOther points that needs attention are the overall rhythm (relationships in widths of the glyphs) and the balance of outer and inner spaces (ideally the inner space of o should be equal to what's between two o's, but also in line with the innerspace of an m, for instance).  \nLook for balance.\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
