{
  "id": "39248",
  "title": "(x) bold and rounded sans \"Glorification\" - Frankfurter {Brandon S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "hello, i’m looking for the white font on the left in this photo. i found a free font similar to it called debussy, but this font has filled in a’s and the c’s are a bit more rounded. any help is much appreciated!\n\n ![](http://web.archive.org/web/20080410005442im_/http:/www.typophile.com/files/baron_3590.jpg)\n\n [‹ The Sun newspaper logo, headlines and body text](http://web.archive.org/web/20080410005442/http:/www.typophile.com/node/39412 \"Go to previous forum topic\") [Marriage Is Murder weathered goth display face ›](http://web.archive.org/web/20080410005442/http:/www.typophile.com/node/39415 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080410005442/http://www.typophile.com/user/23186\" title=\"View user profile.\">dublave</a>",
  "time": "<br>",
  "uid": "23186",
  "comments": [
    {
      "time": " 19.Nov.2007 6.34pm",
      "content": "It could be a separate font with its own name, but it’s essentially [Frankfurter](http://web.archive.org/web/20080410005442/http:/www.myfonts.com/fonts/linotype/frankfurter/) with extra weight added.\n\n"
    },
    {
      "time": " 19.Nov.2007 8.06pm",
      "content": "i think you’re absolutely right. i wish i could find a free version of this!\n\n"
    },
    {
      "time": " 19.Nov.2007 9.26pm",
      "content": "You could always just draw each letterform yourself from scratch.\n\n- Lex\n\n"
    },
    {
      "time": " 20.Nov.2007 1.35am",
      "content": "Or you could go even fatter and take the brand-new [Corpulent](http://web.archive.org/web/20080410005442/http:/www.suitcasetype.com/index.php?lmut=en&part=fonts&font=6) by Tomáš Brousil.\n\n"
    },
    {
      "time": " 20.Nov.2007 2.07am",
      "content": "\\> _i wish i could find a free version of this!_\n\nYeah, I totally understand that. Me, I wish I could find a free version of the new iPhone. Or even better, a MacBook Pro! Wouldn’t that be neat? :^P\n\n"
    },
    {
      "time": " 20.Nov.2007 8.25am",
      "content": "c’mon, let’s not get carried away now.\n\n"
    },
    {
      "time": " 20.Nov.2007 8.29am",
      "content": "Geez, Yves. It’s just a font. It’s not like somebody spent time and effort creating the letterforms one bezier curve at a time, then hinting, spacing, and kerning them.\n\nOh, wait...\n\n- Lex\n\n"
    },
    {
      "time": " 20.Nov.2007 5.10pm",
      "content": "man, two snarky, passive aggressive pshaws in a row. apparently i’m off to a good start here. very welcoming.\n\nhow about instead of rolling your eyes at me, we talk it through? i’m always open for learning.\n\ntypography is new to me. i am a student. who is extremely excited by the possibilities of text. i’m sorry that i stepped on some toes here by considering free fonts. i will do better.\n\n"
    },
    {
      "time": " 21.Nov.2007 1.52am",
      "content": "Hey Brent, you _are_ welcome.  \nYou just hit the sore point, I’m afraid. There are a lot of type designers here on Typophile, and they’re quite allergic to free fonts, you certainly can relate to that.\n\nHowever, there _are_ free fonts – unlike free iPhones and MacBooks. Hell, there are a lot of Typophile type designers who give away (some of) their fonts for free. And there’s even a [FAQ on free fonts](http://web.archive.org/web/20080410005442/http:/typophile.com/node/14652) in the Typophile wiki.\n\nSo – additionally considering that an adipose Frankfurter is not something like a genuine textface that would be considered as labour-intensive, requiring extensive kerning an whatsoever, but quite on the contrary rather a face that typically would reside in the realm of free fonts – I cannot understand the harsh reaction.\n\n"
    },
    {
      "time": " 21.Nov.2007 12.49pm",
      "content": "well thank you very much, florian hardwig! i will definitely look into that free fonts FAQ!\n\nand to the serious type designers i’ve offended—i am truly sorry.\n\n"
    },
    {
      "time": " 25.Nov.2007 11.29am",
      "content": "Aw, come on, I was having a little joke at your expense. Does the :^P smiley ring any bell? No need to be sorry, I just wanted to put what you said into perspective. What is it with those oversensitive Americans? Talking about stepping on someone’s toes… :^D\n\nBTW I’m not at all allergic to free fonts, just to rip-offs of commercial fonts or stolen ones. If you are a student, maybe the [Introductions to Type Design](http://web.archive.org/web/20080410005442/http:/typophile.com/node/38901) on [Unzipped](http://web.archive.org/web/20080410005442/http:/www.fontshop.be/) might be a good start at understanding why good quality typefaces rarely are free. ;^)\n\n"
    }
  ]
}
