{
  "id": "39246",
  "title": "Convert web pages to PDF in Acrobat",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone know how to convert a webpage into a pdf using the \"create pdf from website\" option in adobe acrobat.\n\nI tried saving it multiple times using various settings, but each time..the images and type did not stay in the webpage layout on the pdf.\n\nAny suggestions? The links don't need to work or go to any other levels.  \nI could just simply take a screen shot and do all that stuff...but now this option has got me curious!\n\nIf anyone could help I would appreciate it! Thank you :)\n\n-Cat\n\n",
  "author": "catastrophe",
  "time": "19 Nov 2007 — 5:15pm",
  "uid": "13621",
  "comments": [
    {
      "time": "19 Nov 2007 — 5:50pm",
      "content": "The best and the easiest way would be to log onto [this website](http://web.archive.org/web/20140803034205/http:/www.easysw.com/htmldoc/pdf-o-matic.php), enter the URL and hit \"Create PDF\" icon.\n\nAnd you're done :)\n\n"
    },
    {
      "time": "19 Nov 2007 — 11:10pm",
      "content": "I would have to see your web page, but I suspect you have some kind of static format that is not fitting into the web layout when it is forced to a single page width.\n\nWith a fluid web layout I have never had problems with Acrobat.\n\n"
    },
    {
      "time": "20 Nov 2007 — 7:45am",
      "content": "when creating PDFs, you are really emulating the print drivers.\n\nWeb sites, when printed, aren't usually designed to look the same as they do on screen. This can be a good thing when done properly, afterall, screen and print are different mediums.\n\nBy default, you won't see background colors or background images when printing a web site (to PDF or otherwise). If the web developer/designer so chooses, they can even completely redesign the layout for printing and that happens automatically when you print/convert to PDF.\n\nIf what you want is a PDF of what it looks like EXACTLY on screen, then you need to do a screen shot. Note that you will no longer have a text-indexable PDF, though...if that is a concern.\n\n"
    },
    {
      "time": "20 Nov 2007 — 8:26pm",
      "content": "Thank you for your input! I will have to look into it more, and it could be the format of the website.\n\nSatya: I'm not sure if it's the particular website I'm trying to convert, but I tried that link you suggested, but it only creates a text pdf of the website, and does not include any images or the format.\n\nThanks a bunch! :)\n\n"
    },
    {
      "time": "21 Nov 2007 — 4:11am",
      "content": "This is a link concerning wordpress, but generally the basics are similar:  \n [http://lorelle.wordpress.com/2007/02/10/wordpress-plugins-that-play-with...](http://web.archive.org/web/20140803034205/http:/lorelle.wordpress.com/2007/02/10/wordpress-plugins-that-play-with-paper-and-documents/ \"http://lorelle.wordpress.com/2007/02/10/wordpress-plugins-that-play-with-paper-and-documents/\")\n\n"
    }
  ]
}
