{
  "id": "39257",
  "title": "Hamish Muir fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Can you maybe help me find some fonts designed by Hamish Muir? I am searching the web for the whole day, and I’m going to freak.. I have to design a booklet with his bio and work (school stuff), but I cannot find anything..\n\nthnx!\n\n [‹ Mystery novel](http://web.archive.org/web/20081203155224/http:/www.typophile.com/node/39082 \"Go to previous forum topic\") [When bad design goes horribly wrong. ›](http://web.archive.org/web/20081203155224/http:/www.typophile.com/node/39275 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203155224/http://www.typophile.com/user/24133\" title=\"View user profile.\">mmmihela</a>",
  "time": "<br>",
  "uid": "24133",
  "comments": [
    {
      "time": " 20.Nov.2007 2.53am",
      "content": "The name doesn’t ring a bell. I’ll move this thread to General Discussions as there will be more people able to help you over there.\n\n"
    },
    {
      "time": " 20.Nov.2007 3.23am",
      "content": "Hamish Muir is the founder of Octavo, but I never heard he designed any fonts.\n\n"
    },
    {
      "time": " 20.Nov.2007 3.33am",
      "content": "Well the Octavo site is set in FF Clifford and the Octavo logo was commissioned by typobrand- the same guy of MVB fonts- to design the logo. But if you ask me... it looks like Walbaum as a logotype.\n\nMikey :-)\n\n"
    },
    {
      "time": " 20.Nov.2007 5.54am",
      "content": "The Octavo site is a different company. That Octavo make facsimilies of old books. It was founded by one of Adobe’s founders I think. Nothing to do with Hamish Muir’s Octavo.\n\nHM’s Octavo was a 1980s British design firm. I believe that all of its members studied in Basel with Weingart. Octavo made a great typography magazine (there is a book version of it for sale now) called 8vo. (I think I have all my facts right here). If I remember correctly, the used a lot of Haas Unica.\n\nI wish that Hrant was here to straighten me out on this one!\n\n"
    },
    {
      "time": " 20.Nov.2007 10.01am",
      "content": "Dan — yeah they used Unica a lot. Between 1993 and 1995 they developed a font which took into account the problems of anti-aliasing and aliasing in on-screen typography. It was known as ’Interact’ and was based on a grid — the 45 degree line’is rendered by a series of one by one pixel steps.\n\nHamish Muir also has a website, which I guess you can find on google.\n\nmmmihela — try and buy or borrow from the library the 8vO book ’On the Outside.’ You will find info on the typeface in there.\n\nPhil\n\n"
    },
    {
      "time": " 20.Nov.2007 10.42am",
      "content": "ooopps :-)\n\n"
    },
    {
      "time": " 20.Nov.2007 11.13am",
      "content": "thank you all.. i have never heard about him acctually, but i picked a number with his name at school (there should be only typographers), so i assumed..\n\ni found his website, but it’s quite useless.. i’ll try with the book..\n\n"
    },
    {
      "time": " 20.Nov.2007 1.41pm",
      "content": "“On the Outside” is a great book about a great design studio. By the way, Dan, the name of the studio is indeed 8vo, “Octavo” being the name of the magazine (which lasted eight issues). And yes, they used a lot of Unica, but a lot of Futura as well (for the Museum Boijmans van Beuningen in Rotterdam under Wim Crouwel’s tenure as director).\n\n"
    },
    {
      "time": " 20.Nov.2007 2.52pm",
      "content": "Oops! I switched the name of their studio and magazine. Thanks for straightening me out.\n\n"
    },
    {
      "time": " 20.Nov.2007 3.05pm",
      "content": "There is a very nice book about 8vo, <cite>On the outside</cite>:  \n [http://www.youworkforthem.com/product.php?sku=P0674](http://web.archive.org/web/20081203155224/http:/www.youworkforthem.com/product.php?sku=P0674 \"http://www.youworkforthem.com/product.php?sku=P0674\")\n\nJohn Warnock is the main investor in Octavo. Wonderful concept. I bought a digital copy of Bodoni’s <cite>Typographic Manual</cite> some years ago.  \n [http://www.octavo.com/editions/bodtip/index.html](http://web.archive.org/web/20081203155224/http:/www.octavo.com/editions/bodtip/index.html \"http://www.octavo.com/editions/bodtip/index.html\")\n\nAnd I have some issues of 8vo’s mag somewhere… probably in storage, along with my 70’s comix collection, I guess.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 20.Nov.2007 5.04pm",
      "content": "Issues of “Octavo” magazine ? Lucky guy…  \nI was born too late.\n\n"
    }
  ]
}
