{
  "id": "3927",
  "title": "Archive through September 25, 2002",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Guys, I started a new discussion in Critique/Typography Composition with a very looooooong and detailed posting about my current first attempt at magazine design. If you can bother, have a look and let me know what you think.   \nThank you.   \nCiao a tutti.   \n   \nPaolo\n\n",
  "author": "paolo",
  "time": "16 Aug 2002 — 4:07am",
  "uid": "922",
  "comments": [
    {
      "time": "18 Aug 2002 — 3:09pm",
      "content": "Aw. Disappointed by Fast Company's new cover. I found the last flag incredibly endearing. The compartmentalized cover with the red/black/mustard/cyan color combination makes my stomach queasy.   \n   \nInside, now it's pretty much Standard-Issue Magazine Layouts with no Storm at all, which was what I liked best. Now seems corporate and robotic.   \n   \nthey refer readers here:   \n [http://www.fastcompany.com/keyword/redesign62](http://web.archive.org/web/20150417092025/http:/www.fastcompany.com/keyword/redesign62)   \n   \nBusiness 2.0 also changed some things. Mimi Dutta, the new creative director, is a little more creative with her feature heds. And she likes DOTS a lot. ...   \n   \nMac Addict did a redesign three or four issues ago. There's a face inside that I can't seem to figure out. I'll get a scan up during the week.   \n   \nAs far as throwing magazines out...I have a pack-rat collection of magazines dating back about 10 years. Nobody understands why I keep them, including myself....I just can't read a magazine and \\*throw it away!\\*   \n   \nbj\n\n"
    },
    {
      "time": "18 Aug 2002 — 7:34pm",
      "content": "Fernando Gutiérrez is a Pentagram Partner and the creative director of COLORS nowadays - he studied at LCP in the early 80's - apart from COLORS & MATADOR - he just did a Phaidon photo book on Gandhi - he is in my book one of the finest graphic designers of the classic mould working today.   \n   \nNow with that said i am a big fan of his stark approach at COLORS which i think is the right response to the content and the line of photography they accomodate   \n   \nHis work is much more lively at MATADOR where he reaches astonishing expression from so few means (one typeface, often subtle and consistent colors and blinding work in proportions)\n\n"
    },
    {
      "time": "19 Aug 2002 — 7:19am",
      "content": "i'm glad to see this discussion because i publish a small (in circulation, not paper size) print electronic music magazine and since my volunteer art director left, i have to design the mag myself.   \n   \njust to detail my experiences as a non-designer by trade, i can say i have the following problems:   \n   \n1) i have to work in black&white (can't afford color)   \n   \n2) image quality of photos i receive are of a wide range of quality, from very good to horrible.   \n   \n3) i can't afford any design help.   \n   \nwithin these constraints, i'd love to get some suggestions on how to work. it seems to me that if you get great images to begin with, that helps make a good look for a magazine already.   \n   \ni am currently planning on using a new font, Sys, for the text and a futuristic-looking font--House Spaceport 3009 for heads. one problem i am having is trying to create some kind of \"header\" for our different sections of reviews that meshes well with the rest of the page. perhaps i can put together a couple of PDFs when i get home for some input. is there a way to upload to this site?   \n   \nthanks, sean portnoy   \ngrooves magazine--experimental electronic music magazine   \ngroovesmag.com\n\n"
    },
    {
      "time": "19 Aug 2002 — 7:02pm",
      "content": "here's 2 pages of a spread from my magazine. As you can see, there's nothing at the top of the page that could be a header to indicate that this is a Gear Review in our Reviews Section. I'd love to hear any tips for this. I'm also post another all-text review page (should be much smaller file).   \n   \n\\grooves1.jpg   \n   \n\\grooves2.jpg   \n   \nthanks, sean   \ngrooves magazine   \ngroovesmag.com\n\n"
    },
    {
      "time": "19 Aug 2002 — 7:04pm",
      "content": "whoops, didn't do that right.   \n   \nhere's one \\image   \n   \nhere's another \\image   \n   \nthanks, sean\n\n"
    },
    {
      "time": "19 Aug 2002 — 7:06pm",
      "content": "shoot, this is not working for me for some reason. you can send me an email and i can send you a pdf file of the spread if you want.   \n   \nthanks!   \nsean   \n [grooves1200@yahoo.com](mailto:grooves1200@yahoo.com)   \n   \n\\grooves1.jpg\n\n"
    },
    {
      "time": "19 Aug 2002 — 8:59pm",
      "content": "I'd agree that good photos, illustration and type are needed for a mag, but your shooting blanks without great editorial and content.   \n   \nmichael\n\n"
    },
    {
      "time": "26 Aug 2002 — 6:17am",
      "content": "AdAge [http://www.adage.com/news.cms?newsId=35816](http://web.archive.org/web/20150417092025/http:/www.adage.com/news.cms?newsId=35816) has an article on the redesign of RollingStone.\n\n"
    },
    {
      "time": "26 Aug 2002 — 7:55am",
      "content": "Jann Wenner:   \n\".... it's not my [expletive] fault!\"   \n   \nYeah, just keep passing the blame in a circle - that'll make everything OK.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2002 — 8:32am",
      "content": "I just found this site a couple days ago [http://www.newspagedesigner.com](http://web.archive.org/web/20150417092025/http:/www.newspagedesigner.com/) it has more to do with newspapers but still very addicting and hours of fun will be had in exploring the portfolios. There are some real gems to be found.   \n   \nm\n\n"
    },
    {
      "time": "30 Aug 2002 — 10:47am",
      "content": "Wenner Dumbs Down: New, sexier Rolling Stone is in stores...here are a few links.   \n   \nAlso, Blender's Editor in Chief is Andy Pemberton.   \n   \n [http://www.latimes.com/features/lifestyle/la-lv-rollingstone30aug30.story](http://web.archive.org/web/20150417092025/http:/www.latimes.com/features/lifestyle/la-lv-rollingstone30aug30.story)   \n   \n [http://www.medialifemagazine.com/news2002/jun02/jun24/4\\_thurs/news3thursday.html](http://web.archive.org/web/20150417092025/http:/www.medialifemagazine.com/news2002/jun02/jun24/4_thurs/news3thursday.html)   \n   \n [http://www.adage.com/news.cms?newsId=35816](http://web.archive.org/web/20150417092025/http:/www.adage.com/news.cms?newsId=35816)   \n   \nmore stuff at Google\n\n"
    },
    {
      "time": "30 Aug 2002 — 10:57am",
      "content": "bj - I don't get it. So [Fred Woodward](http://web.archive.org/web/20150417092025/http:/www.adcny.org/hallfame/96woodward.html) is gone?   \nHis work inspired me to be a designer. This makes me cry.   \n   \nmichael - nice link! haven't seent that.   \n   \nStephen\n\n"
    },
    {
      "time": "30 Aug 2002 — 11:16am",
      "content": "Stephen: The current Art Director is Andy Cowles. I'm guessing that Woodward, Black, Parkinson, Wenner, et al. all contribute (advice or actual work) to the look of all Wenner Media publications. What Woodward does day to day, I don't know. I'm just a lowly subscriber. Maybe Jonathan Hoefler has some info.   \n   \nbj\n\n"
    },
    {
      "time": "30 Aug 2002 — 12:23pm",
      "content": "Stephen - Glad that I could return the favour considering what I've learned from typographi.ca and of course from this site too.   \n   \nm\n\n"
    },
    {
      "time": "31 Aug 2002 — 12:31pm",
      "content": "I didn't see any mention of Baseline - man the cover they had with the scraped silver ink over florescent orange printing. I would love to know how they did that. Obviously hand done I would think? but to millions of issues?   \n   \nI peeled the price tag off carefully only to realize that they did in fact stamp the price tags on when the thick metallic was still wet.   \n   \nthe other cover that caught my attention was the June issue of Flaunt, the circus scene, punch cut, die cuts, replacement maps, and crazy dot gains. craziness I say.\n\n"
    },
    {
      "time": "1 Sep 2002 — 2:22pm",
      "content": "FYI -- These days, Fred Woodward is the creative director at GQ.\n\n"
    },
    {
      "time": "1 Sep 2002 — 9:51pm",
      "content": "Here's a good short article on magazine cover design - and it's decline. I agree with the sentiment, although mags like The New Yorker are still churning out wonderful covers week in week out.   \n [http://popcultmag.com/criticalmass/culture/magazines/magazines0.html](http://web.archive.org/web/20150417092025/http:/popcultmag.com/criticalmass/culture/magazines/magazines0.html)\n\n"
    },
    {
      "time": "2 Sep 2002 — 5:26pm",
      "content": "\\>However, for fun, take a trip around the web to the olde guarde of US graphic design...   \n   \n\\>1\\_ http://www.pentagram.com/   \n\\>2\\_ http://www.vignelli.com/   \n   \nI saw Michael Bierut [speak a couple of years ago](http://web.archive.org/web/20150417092025/http:/www.aigapgh.org/bierut.html), and he said he worked at Vignelli (eventually becoming a vice president there) before joining Pentagram.   \n   \n\\>It must be an effort to extend their own brand - a kind of visual association.   \n   \nBierut said that he uses his (and Pentagram's) signature style as a kind of back up plan. With each project he experiments and tries new things, but knows that if nothing new works, he can fall back on a style that he is sure will work. He said that this was similar to the way Vignelli works (something to the effect of \"If all else fails, put [big black stripes](http://web.archive.org/web/20150417092025/http:/www.vignelli.com/poster.htm) across it\").\n\n"
    },
    {
      "time": "2 Sep 2002 — 6:31pm",
      "content": "Thanks Marc, Mart, and Graham. The last three   \nposts of this thread are so enlightening, it reminds   \nme how much the current comment threads at   \ntypographica suck. Good info.\n\n"
    },
    {
      "time": "4 Sep 2002 — 12:23pm",
      "content": "Magazine Lovers, run don't walk to get STEP inside design. The premier issue is on newsstands now, $7.95 US.   \n   \nAmong the features:   \n   \n\\* Q and A w/ Paula Scher (incl. questions about her Pentagram collaborations and views on typography)   \n\\* A piece on Tobias and Jonathan (Hoefler Text and Interstate were chosen by Art Director Robert Valentine for use in STEP.)   \n\\* an Open Type discussion   \n   \n+ more.   \n   \n   \nAlso, we are not the only ones making pud puns. see page 74.   \n   \nbj\n\n"
    },
    {
      "time": "4 Sep 2002 — 12:27pm",
      "content": "\\> A piece on Tobias and Jonathan   \n   \nSorry, BJ, but I found that particular article to be pretty horrid. Every few sentences there's something to trigger a guffaw. Those two designers deserve better.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Sep 2002 — 12:33pm",
      "content": "\"I believe type design is both art and craft. It combines practical and aesthetic considerations.\" -- Robert Valentine.   \n   \nConsidering what you've been writing lately, I'm guessing that this was one of the triggers?\n\n"
    },
    {
      "time": "4 Sep 2002 — 12:46pm",
      "content": "Well, not really. There is art in type design - just like anything else humans do - it's unavoidable. On the other hand, for Valentine to actually say that in an article of that nature seems trite and cliche. But that wasn't one of the major sore spots for me - I'd have to re-read the thing - which I really don't want to...   \n   \nhhp\n\n"
    },
    {
      "time": "4 Sep 2002 — 5:31pm",
      "content": "BJ,   \nis STEP a new design magazine? Does it have an URL? I'd like to have a look, I guess I'll have to order it to get it here in Milan.   \n   \nJumping to another subject: Hrant, I am glad to tell you that I will very probably come to Rome to attend aTypI. :-)   \nDo many of you guys on this forum will come to Rome too? Tiffany? Kent? Stephen?   \nI'd love to meet you guys, and talk to you in person.   \nCiao   \n   \nPaolo\n\n"
    },
    {
      "time": "4 Sep 2002 — 6:49pm",
      "content": "Great news, Paolo! Try to make it to the gathering on the evening of the 19th, and you'll meet bunches of people.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Sep 2002 — 10:05pm",
      "content": "Paolo - well the web site hasn't caught up with the magazine...published by Dynamic Graphics.   \n   \nyou can get more information here   \n   \n [http://www.dgusa-europe.co.uk/sbseditor.htm](http://web.archive.org/web/20150417092025/http:/www.dgusa-europe.co.uk/sbseditor.htm)   \n [http://www.dgusa.com](http://web.archive.org/web/20150417092025/http:/www.dgusa.com/)\n\n"
    },
    {
      "time": "5 Sep 2002 — 5:14am",
      "content": "I think the complete offical title is supposed to be _STEP inside design_ -- although you'd be forgiven for not guessing it from the logo. It was formerly _Step-by-Step Graphics_. The second issue under the new name and new design just arrived in my mailbox. I can't say that I'm all that taken with the new format. But I'll give it a year to get settled in.   \n   \nI remember thinking the piece on Hoefler and Frere-Jones was a bit fluffy. But that may be because I'm no longer a general reader in this particular arena.   \n   \nPaolo, I won't be coming to Roma. Perhaps you can join us in Vancouver next year?   \n   \nAnd, for those keeping score at home, I'll take this opportunity to report that we've decided to postpone the release of Whitman until I can create the bold and black weights, which, due to a couple of pressing book design commissions, looks like it won't be until January.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "5 Sep 2002 — 7:37am",
      "content": "Kent, It'll be worth the wait.   \nI'm curious to see what approach you'll take for the darker weights: the Modernist style that's in fashion now, or the \"divergent\" method like in Carter's incomrapable Galliard.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 8:18am",
      "content": "Kent -- Will you be doing condensed versions   \nof _Whitman_?\n\n"
    },
    {
      "time": "5 Sep 2002 — 3:51pm",
      "content": "What do you mean by \"Modernist style   \nthat's in fashion now\", Hrant?   \nAnd elaborate on \"divergent method\" also,   \nif you please.   \n   \nR\n\n"
    },
    {
      "time": "5 Sep 2002 — 4:06pm",
      "content": "The use of a weight axis (internally if not in the released font) which has become de rigueur since the increase in sophistication of font editors encourages uniformity in style between the various weights. This has certain advantages, but suffers from the classic flaw of Modernism: lack of contrast; which just happens to be what a Bold is intended for... In contrast (so to speak) Carter explains how he \"diverged\" the darkest weights of Galliard, giving them a singular life. I have a copy of an old article that he wrote about the development of Galliard, but I can't remember where it was from...   \n   \nBTW, this is somewhat parallel to the fact that the copy-paste (which became so easy to do with computers\\*) also encourages uniformity/Modernism, but on a more local level.   \n   \n\\* There was actually a primitive form of copy-paste even in the foundry days: punchcutters used the same counterpuch to make similar parts of different letters, like the counters of \"n\" and \"h\". See Smeijers and Paput (personally, if you like ;-) for elaboration.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 4:21pm",
      "content": "\\> but suffers from the classic flaw of Modernism: lack   \n\\> of contrast;   \n   \nI see your point. Just don't quite agree with this assessment   \nof \"Modernism\".   \n   \n\\> an old article that he wrote about the development of   \n\\> Galliard, but I can't remember where it was from...   \n   \nIf your memory recovers, please tell us. I'd like   \nto have a look at that.   \n   \n\\> punchcutters used the same counterpuch to make similar   \n\\> parts of different letters, like the counters of \"n\"   \n\\> and \"h\".   \n   \nOh yes. I've done my Smeijers. ;) BTW, a [preview](http://web.archive.org/web/20150417092025/http:/www.rcapeto.com/etc/punch_anim3.gif).   \n   \nThanks.\n\n"
    },
    {
      "time": "5 Sep 2002 — 4:32pm",
      "content": "I'll dig up the Galliard thing tonight.   \n   \nBTW, nice little anim!   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 5:16pm",
      "content": "Hrant, I think the article you're referring to is from _Fine Print_ and is collected in _Fine Print on Type_, Bigelow, Duensing, Gentry eds. (San Francisco: Bedford Arts, 1989). Although, I see now that this article was written by Chuck Bigelow. Maybe you're referring to a different one.   \n   \nIt's funny you should mention Galliard in this context, however, because I recently had a very long and encouraging conversation with Mike Parker about the heavier weights of Whitman and we specifically discussed Matthew's process with Galliard.   \n   \nAs for how \"divergent\" my work will be, we'll just have to wait and see.   \n   \nTiffany, I hadn't really considered condensed versions (not being too big on condensed faces myself). I had always figured that when/if I get around to display cuts, they'd be naturally a little narrower; but hardly what I would consider condensed, sorry. But who knows. . .   \n   \n-- K.\n\n"
    },
    {
      "time": "5 Sep 2002 — 5:19pm",
      "content": "Rodolfo, I second Hrant on that animation: Neat.\n\n"
    },
    {
      "time": "5 Sep 2002 — 5:26pm",
      "content": "\\> not being too big on condensed faces myself   \n   \nTo me a little condensation (I mean a little more than \"usual\" in a text face - Rotis comes to mind as a good target, although its spacing is way too loose) is good for readability, but I find width variations in general largely useless in a \\*text\\* face; you decide what width is best for your design, and that's that. The first axis I would dump in most MM designs is in fact the Width.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 7:54pm",
      "content": "\\> Fine Print on Type   \n   \nI was thinking maybe you were right\\*, but then I found my copy: \"Galliard: a modern revival of the types of Robert Granjon\", Matthew Carter, Visible Language XIX 1 Winter 1985. It's really a great article, providing some unique insight. And when you read it, you might join those of us who have no doubt whatsoever that Granjon was the best type designer we have yet seen (although Gill might have had more raw talent).   \n   \n\\*   \nI \\*think\\* I've scoured all the issues of Fine Print, and I distinctly remember going through Fine Print on Type at UCLA-SpecialCollections, and when I do that I never leave without copies of the interesting parts (even if I have to cajole them into exceeding the photocopy limit), but I don't remember anything about Galliard. Dare I suggest it wasn't memorable? Pardon the candor, but what is it about Bigelow that he never manages to turn me on? Maybe it's me.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 8:38pm",
      "content": "Kent -- Your thoughts equal mine, it was the display version of which I had been thinking. I wasn't thinking of anything extreme, simply tighter, more clean and more crisp.\n\n"
    },
    {
      "time": "6 Sep 2002 — 11:32am",
      "content": "You're right, Hrant. I reread the Bigelow article on Galliard and it wasn't the treasure that one might have hoped. He does make some interesting observations and quotes a little Carter. But the _Visible Language_ article sounds infinitely more interesting -- being from Carter himself and all that. Who publishes _VL_? Do you know where I might get a copy?   \n   \n-- K.\n\n"
    },
    {
      "time": "6 Sep 2002 — 11:42am",
      "content": "\\> Who publishes VL?   \n   \n [http://www.id.iit.edu/visiblelanguage/](http://web.archive.org/web/20150417092025/http:/www.id.iit.edu/visiblelanguage/)   \n   \n\\> Do you know where I might get a copy?   \n   \nYou can buy back issues, or do an ILL from a good library. You've been planning that 100-mile trip for a while now - do it before the weather gets bad. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "6 Sep 2002 — 11:56am",
      "content": "Hrant:   \n   \n\\> what is it about Bigelow that he never manages   \n\\> to turn me on?   \n   \nDoes this give us a clue on the origins of MasLucida? ;)\n\n"
    },
    {
      "time": "6 Sep 2002 — 12:09pm",
      "content": "Yes it does! :-)   \nMasLucida (a set of structures, not a font) was based on Lucida because Lucida has very \"elemental\" letterforms, so they didn't need much change in order to look like \\*structures\\*, like I wanted. But I don't think I'm the only one who thinks that a \\*usable\\* font must not look so \"structural\". By the way, on the way from Lucida to MasLucida I incorporated certain \"phase one\" changes to Lucida, in order to make it more bookish, and as a result facilitate a comparison to MasLucida' intentions. Besides increasing the extenders and tightening the spacing (I \\*think\\* - it's been a while), I added a bicameral \"g\": it wasn't easy to get it to feel right, but except for a slightly large head that needs to be scaled smaller to the left, I think it provides for a better solution than the original mono \"g\".   \n   \nMaybe one thing that bugs me is the scope of the Lucida megafamily: it really seems too strict, formally speaking. Some of the constituent fonts look like they've been inbred just a \\*bit\\* too closely to become healthy adults...   \n   \nhhp\n\n"
    },
    {
      "time": "20 Sep 2002 — 3:12pm",
      "content": "interesting reading/site   \n   \n [http://popcultmag.com/criticalmass/culture/magazines/magazines0.html](http://web.archive.org/web/20150417092025/http:/popcultmag.com/criticalmass/culture/magazines/magazines0.html)   \n   \nvia Kaliber 10,000°\n\n"
    },
    {
      "time": "25 Sep 2002 — 2:59pm",
      "content": "Paolo, nice meeting you in Rome!   \nI hope the conference was useful to you.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2002 — 5:34pm",
      "content": "Sean, as you mentioned quality photography is key, as   \nis quality type.   \n   \nMy strongest suggestion is to find another volunteer   \ndesigner. Students eager to get real press experience   \nmay be a great place to start.   \n   \nWhen you're ready to post samples, please start a new   \nthread in Critique \\> Typography/Composition. You'll get   \na much more focused critique that way.\n\n"
    }
  ]
}
