{
  "id": "39277",
  "title": "InDesign ads have text problems when pasting",
  "forum": "Build",
  "tags": [

  ],
  "content": "Our graphics people have ads that are created from scratch in InDesign, with no character styles or paragraph styles applied (at least not intentionally). When placed on a template that we created for our daily newspaper pages (that have object styles, character styles and paragraph styles associated with it) the text in some (not all) of the ads that are placed loses attributes and defaults to 10 pt leading. Some times even the font is replaced to helvetica. When we check character styles, paragraph styles and object styles, it doesn’t show that it has picked up one of the styles on the page. Has anyone run into this before? Can it be avoided? Thanks for the help.\n\n [‹ Kerning in a Dynamic Text box in Flash MX 2004](http://web.archive.org/web/20080121025436/http:/www.typophile.com/node/27381 \"Go to previous forum topic\") [No OT features in CorelDraw X13? ›](http://web.archive.org/web/20080121025436/http:/www.typophile.com/node/39225 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080121025436/http://www.typophile.com/user/21003\" title=\"View user profile.\">Tim Engstrom</a>",
  "time": "<br>",
  "uid": "21003",
  "comments": [
    {
      "time": " 20.Nov.2007 12.50pm",
      "content": "Ignoring the fact that supplying an ad as an InDesign file is bad practice… you (or the supplier of the ads) should create a print-ready PDF of the ads and insert that into your magazine layout instead.\n\n"
    },
    {
      "time": " 20.Nov.2007 12.52pm",
      "content": "Thanks for the reply, these ads are all done in-house and stay in-house for our daily newspaper. We’re trying to avoid the step of creating the pdf and dropping it on the page as such since oftentimes last minute changes are needed.\n\n"
    },
    {
      "time": " 20.Nov.2007 12.57pm",
      "content": "Just a guess: Did you check if “basic character/paragraph/object style” has been chosen on your machines?  \nIt is safer to base character styles, paragraph styles and object styles on “no character/paragraph/object style” (visible via double click on the single style) than on “basic character/paragraph/object style”, because the latter can be chosen different on each machine and nevertheless it’s always named “basic”.\n\n"
    },
    {
      "time": " 20.Nov.2007 1.02pm",
      "content": "I don’t get it. What do you place in the templates? Do you Copy&Paste text only, or multiple objects or even InDesign documents?\n\nKeep in mind there is no “no paragraph style”. If you copy something from one machine to another, you may get different text settings because the preferences for “basic paragraph style” are different. Same is true for standard typeface, sizes and so on.\n\n"
    },
    {
      "time": " 20.Nov.2007 1.03pm",
      "content": "Thank you Tina, that worked perfectly!\n\n"
    },
    {
      "time": " 20.Nov.2007 1.29pm",
      "content": "Yes Tina, this is exactly what I had im mind. You answered it while I was writing my post.\n\n"
    },
    {
      "time": " 20.Nov.2007 1.33pm",
      "content": "I wonder why this feature is so hidden, because I can’t think of any good reason to have it that way. Only if you’re insolubly glued to use one font only for the rest of your life (default = basic is set to Times, 12 pt ... — at least it’s not Arial ...).\n\n"
    }
  ]
}
