{
  "id": "39276",
  "title": "Logo font / body text",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi Everyone,  \nI’m currently working with a property company, who use Eurostile in their logo, and I’m designing some marketing material for them. I was wondering if anyone had any suggestions on what font might go nicely for the body text? I dont want to use eurostile on in everything.\n\nAlso, I was interested in general, to what criteria anyone used when deciding what font to use with a brand,that wasn’t used as part of their idendity, and how many different fonts to use with a brand?\n\nThanks in advance!\n\nT\n\n [‹ Magazine redesign - separating text from image.](http://web.archive.org/web/20080505022900/http:/www.typophile.com/node/39287 \"Go to previous forum topic\") [InDesign Black Output on PDF Export ›](http://web.archive.org/web/20080505022900/http:/www.typophile.com/node/31345 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080505022900/http://www.typophile.com/user/24013\" title=\"View user profile.\">Mint</a>",
  "time": "<br>",
  "uid": "24013",
  "comments": [
    {
      "time": " 20.Nov.2007 12.40pm",
      "content": "...what font might go nicely for the body text?...\n\nMaybe you could get a long with other fonts created by Aldo Novarese (the designer of Eurostile)\n\nITC Fenice [http://www.myfonts.com/fonts/linotype/itc-fenice/](http://web.archive.org/web/20080505022900/http:/www.myfonts.com/fonts/linotype/itc-fenice/)  \nCentral [http://www.myfonts.com/fonts/agfa/central/](http://web.archive.org/web/20080505022900/http:/www.myfonts.com/fonts/agfa/central/)\n\n...and how many different fonts to use with a brand?...\n\nOne font would mean that you have chosen a good font (family), which is for example capable of being flexible enough to be used in different matters.\n\nTwo fonts would mean that you weren’t there when somenone has decided for the first one (like in this case)\n\nAnd three fonts would mean, that you are not a very good designer/typographer  \n;-)\n\nDerya\n\n"
    },
    {
      "time": " 20.Nov.2007 1.25pm",
      "content": "Hi Derya,  \nThanks for the reply.  \nI’ll definitly look at those. In previous things helvetica has been used. I was wanting to create something more personal to them, that could be used across various applications as part of their brand.\n\nIs there a general rule you would go by, in terms of a body copy complimenting , or contrasting a font used in a logo? When the logo font doesn’t lend its self to being used.\n\nToby\n\n"
    },
    {
      "time": " 20.Nov.2007 2.05pm",
      "content": "Toby,\n\nthere are several rules, which you can follow:\n\n1. look for good equipped typefaces, type families (who have sans & serif cuts)  \n2. the mixed fonts should be different enough to be recognized for the untrained eye  \n3. try to avoid mixing a sans with another sans, or a serif with another serif  \n4. try to match fonts which have a almost similar x-height, so that a mixture in body copy doesn’t look to strange and fit harmonious  \n5. look what good typographers do, because there are as many opinions, as designers  \n6. use the search function here on typophile (could be the first rule)  \n7. look for the links at the and of this thread: [http://typophile.com/node/38882](http://web.archive.org/web/20080505022900/http:/typophile.com/node/38882)\n\nDerya\n\n"
    }
  ]
}
