{
  "id": "39288",
  "title": "Suitable font for a medical centre?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi  \nMaking a logo for a medical centre named \"Legenes Legesenter\" (it is close to the real name). Initials are \"LL\". The sketch illustrates how I ended up with the symbol at the bottom right. It contains one positive and one negative \"L\", and a heart. Not sure if this is the best solution? I like some of the \"calligraphic\" shapes but they tend to look like eyes, mouths etc.\n\n ![](http://web.archive.org/web/20131103160427im_/http:/typophile.com/files/brainstorm_6395.gif)\n\nNow I am searching for a \"medical\" font that fits this symbol. If anyone has a suggestion I'll be happy to try it.\n\n ![](http://web.archive.org/web/20131103160427im_/http:/typophile.com/files/legesenter_3575.gif)\n\n",
  "author": "BjornH",
  "time": "20 Nov 2007 — 4:38pm",
  "uid": "23869",
  "comments": [
    {
      "time": "21 Nov 2007 — 10:42am",
      "content": "I could not decide in what direction to go so I tested out the stethoscope idea a litle further:\n\n ![](http://web.archive.org/web/20131103160427im_/http:/typophile.com/files/legesenter3_5929.gif)\n\nAny critique is most welcome.\n\n"
    },
    {
      "time": "21 Nov 2007 — 10:57am",
      "content": "As I quickly loaded and scanned down the page I saw Starbucks right away.\n\n"
    },
    {
      "time": "21 Nov 2007 — 10:57am",
      "content": "Oops. I meant to add that the mark itself is nice, but you might want to reconsider the rest.\n\nCrud. I also want to say I did like the simplicity of the first although the L was a little abnormally shaped. Like a short man with big feet.\n\nDoes the heart in the new mark have to be closed. In your sketches, at the top on the far right, that implies a heart without being blunt.\n\n"
    },
    {
      "time": "21 Nov 2007 — 11:42am",
      "content": "Thanks for your comments Miss Tiffany.  \nI see what you mean\n\n ![](http://web.archive.org/web/20131103160427im_/http:/typophile.com/files/starbucks_4331.gif)\n  \nWe do not have Starbucks im my part of the world and the medical centre is local. I did not know the Starbucks logo myself, honestly. I'll see what I can do about it.\n\nI'll try to open up the heart in the mark and get some longer legs on the \"L\", thanks for noticing.\n\n"
    },
    {
      "time": "21 Nov 2007 — 1:58pm",
      "content": "Longer legs looks better\n\n ![](http://web.archive.org/web/20131103160427im_/http:/typophile.com/files/legesenter4_3443.gif)\n\n"
    },
    {
      "time": "21 Nov 2007 — 2:26pm",
      "content": "I love the heart/stethoscope mark. The gradients dull the contrast in your logo, and make it look less clean - I'd get rid of them.\n\nI really like the reversed version - it looks much cleaner and appropriate for a medical centre than the top example. I think it could work on white if you just removed the outermost stroke. I'd also remove the black stroke around the centre circle to make it less busy.\n\nThe green colour really evokes Starbucks to me. I'd go with blue instead. Try to work in some red or pink into the mark - maybe just in the small circle within the heart.\n\nOverall, great work.\n\n- Lex\n\n"
    },
    {
      "time": "22 Nov 2007 — 9:36am",
      "content": "Tried to open the heart as Miss Tiffany suggested, I was afraid to get a face with two angry eyebrows but I think it works better now? More stethoscopic without loosing the heart. Thanks again for seeing that.\n\nHi Lex, thanks for commenting. Removing excess decorations seems like a good idea. I am not shure about the outermoust circle, I think it looks a bit ragged without it?  \nTried some blue and red as you suggested, good call, well appreaciated.\n\n ![](http://web.archive.org/web/20131103160427im_/http:/typophile.com/files/legesenter5_4541.gif)\n\n"
    },
    {
      "time": "22 Nov 2007 — 11:58am",
      "content": "Nice work! I like it with the outer circle. It works with and without color.\n\nSharon\n\n"
    },
    {
      "time": "22 Nov 2007 — 7:58pm",
      "content": "Sorry - I was unclear about what I meant when I said to remove the outermost circle.\n\nI meant that you should use the \"reversed\" version of the logo on white instead:\n\n ![](http://web.archive.org/web/20131103160427im_/http:/typophile.com/files/legesenter_demo_4438.gif)\n\nI like the new colours too. Good work.\n\n- Lex\n\n"
    },
    {
      "time": "23 Nov 2007 — 5:17am",
      "content": "Thanks Sharon! I think the small versions with the circle looks nice, trying to fugure out why.\n\nThanks for making the drawing Lex, I should have understood your explanation right away. I see what you mean now.  \nHere it is with one, two and three circles.  \nLooking into the weights of the symbol, it is becomming almost like a glyph to me. Maybe I could find a font that looks related to the symbol?\n\n ![](http://web.archive.org/web/20131103160427im_/http:/typophile.com/files/legesenter6_6281.gif)\n\n"
    }
  ]
}
