{
  "id": "39281",
  "title": "News Plantin or Aldine 721?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Which would you use if you had the option of buying either — that is, which one is considered the 'better' cut?\n\n—Phil\n\n",
  "author": "<a href=\"/web/20111214113218/http://typophile.com/user/18149\" title=\"View user profile.\">pbaber</a>",
  "time": "<br>",
  "uid": "18149",
  "comments": [
    {
      "time": "",
      "content": "Not the same thing. Aldine 721 is Bitstream's clone (some would say blatant copy) of Monotype Plantin. I have compared these two closely--for all intents and purposes, they are identical. If you want authenticity, buy Plantin. Though if you have one of the Bitstream monster CDs already, then you have Aldine 721 on the cheap, so just use it and be happy.\n\nAs far as I know, \"Linotype Plantin\" is the same as MT, they simply cross-licensed years ago, back when Plantin was a popular typeface in the newspaper industry.\n\n\"News Plantin\" is a condensed version of Plantin, approximately 20% condensed, with tighter letterform tracking as well. It is very close in look and feel to good-old Times Roman and Times New Roman, as well as Dwiggins' New Caledonia. The Bitstream clones of Times and News Plantin are the Dutch faces, I forget the specific numbers.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I have compared these two closely—for all intents and purposes, they are identical</cite>\n\nNo, they are not.  \nFor instance, the numerals differ quite a lot, as you can [read in this thread](http://web.archive.org/web/20111214113218/http:/www.typophile.com/node/4806).  \nAlso, [Aldine 721 is “slightly narrowe[r]”](http://web.archive.org/web/20111214113218/http:/typophile.com/node/17814).  \nThen, [Plantin has some more weights](http://web.archive.org/web/20111214113218/http:/www.fonts.com/FindFonts/HiddenGems/Plantin.htm), if that’s of interest.\n\n ![](http://web.archive.org/web/20111214113218im_/http:/typophile.com/files/Aldine-721_5813.png)\n  \n\n ![](http://web.archive.org/web/20111214113218im_/http:/typophile.com/files/Plantin_3756.png)\n  \n\n ![](http://web.archive.org/web/20111214113218im_/http:/typophile.com/files/Aldine-721-Italic_5130.png)\n  \n\n ![](http://web.archive.org/web/20111214113218im_/http:/typophile.com/files/Plantin-Italic_4238.png)\n\nA clone, as in copied outlines? Rather not.  \nA blatant copy? Well, others might say ‘just another boring revival/reinterpretation’. One thing is for sure;: When the Monotype Corp. was founded, the eponym was dead for 300 years, and Bitstream came another 100 years later. C. Plantijn might not be happy with either of their versions.\n\n"
    },
    {
      "time": "",
      "content": "The letterforms are essentially identical, and your images above confirm this, in both italic and roman versions. There are \\*\\*slight\\*\\* differences with the numerals, OK. Yawn.\n\nTo me, a typeface clone refers to look, feel and usage. I don't design typefaces, I could care less whether the end result is from outline copies, or a mere inspiration. You seem to get excited about the nuances, terrific.\n\n"
    },
    {
      "time": "",
      "content": "_You seem to get excited about the nuances, terrific._\n\nWelcome to Typophile, Ryan. You're gonna see a lot of that here. :-)\n\n"
    },
    {
      "time": "",
      "content": "<cite>You seem to get excited about the nuances, terrific.</cite>\n\nThey’re _letters_. Nuance, subtle or otherwise, is really the only source of differentiation.\n\n"
    },
    {
      "time": "",
      "content": "Nuances are one thing; trivialities are another. I would argue the differences between Aldine 721 and MT Plantin are genuine trivialities.\n\n"
    },
    {
      "time": "",
      "content": "They have quite different metric effects.  \nThe Aldine vertical strokes are even in rhythm, whereas Plantin has more of an oldstyle beat.\n\n"
    },
    {
      "time": "",
      "content": "Plus the x-heights are considerably different.\n\n"
    },
    {
      "time": "",
      "content": "Ryan,\n\neven my mother can tell that Aldine 721 and Plantin MT look different, though she is not able to be as precise as to say that the Aldine vertical strokes are even in rhythm, whereas Plantin has more of an oldstyle beat.\n\nI myself prefer Bitstream's version -- it has a more solid color, better spacing and is overall a better text typeface. In fact, it is one of my favorite text faces of all times.\n\nI used to think that the Bitstream versions are \"blatant copies\" and pitiful clones, obviously inferior in quality, until I came to realize that when the digital versions of many classic typefaces were made, Linotype, Monotype and Bitstream all digitized the faces in a certain hurry, using somehow primitive equipment. The difference was that Linotype and Monotype owned the trademarks but they also had constraints resulting from the fact that those faces have undergone multiple adaptations for photo composition so often the latest drawings had little to do with the metal originals -- and you were never sure what was the basis of the digitization.\n\nBitstream did not have the trademarks but they did not have the said limitations either. Also, keep in mind that in that time, Bitstream operated under the typographic supervision of Matthew Carter, and that some designers such as Hermann Zapf consulted on the Bitstream versions of their Linotype designs. Others such as Adrian Frutiger did not approve of the Bitstream digitizations but in 2003, Linotype officially approved the Bitstream versions of Frutiger's faces such as Frutiger (Humanist 777) and Univers (Zurich) along with other designs including Helvetica (Swiss 721), Times (Dutch 801), and many others.\n\nSo from the licensing point of view, Swiss 721 by Bitstream, Helvetica LT by Linotype, Helvetica by Adobe or Helvetica by Apple are just four different \\*licensed\\* versions of the same design.\n\nIn case of Aldine 721, I don't think that Bitstream ever signed a similar agreement with Monotype, but as Florian pointed out, both Plantin and Aldine 721 are revivals of Christophe Plantin's punches. As I said, in this particular case I prefer the Bitstream face over the Monotype face, but there are cases where my typographic preferences are the other way around.\n\nBut one thing is for sure: many text faces in the Bitstream font collection are of solid typographic and technical quality -- just like many among Linotype's and Monotype's offerings. And, there are some poor faces in all these libraries as well.\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": "",
      "content": "Adam,  \nI feel much better about my Bitstream fonts now. They're the core of what I work with at the moment.\n\n"
    },
    {
      "time": "",
      "content": "Also something to take in account: the MT-versions of Plantin (and there are a LOT of these floating around) are pests to work with. Suitcases with family links that don't work, trouble with previews in fontmanagers, RIPs choking on them and so on. MT messed up a lot of fonts in the early days, softwarewise.\n\nAnd I prefer the solid look of the BT, anyway.\n\n…  \nBert Vanderveen BNO\n\n"
    }
  ]
}
