{
  "id": "39306",
  "title": "Any London typophile members?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello Everyone,  \nI’m taking a trip to London in January. Would love to meet some of the international Typophile contingent, as well as take a look at some design firms.\n\nSo two questions:  \n1. any London typophile members?  \n2. any London design companies that are worth looking at, maybe stopping by for a tour of the office?\n\nThank you!\n\n [‹ Wedge serif](http://web.archive.org/web/20071128121358/http:/www.typophile.com/node/39407 \"Go to previous forum topic\") [Please change the title font... ›](http://web.archive.org/web/20071128121358/http:/www.typophile.com/node/39297 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071128121358/http://www.typophile.com/user/23247\" title=\"View user profile.\">Fantômas</a>",
  "time": "<br>",
  "uid": "23247",
  "comments": [
    {
      "time": " 21.Nov.2007 8.36am",
      "content": "I’m not in London, but 60k away in Reading (30 minute train ride). There are quite alot of Typophiles here!\n\n"
    },
    {
      "time": " 21.Nov.2007 1.12pm",
      "content": "hey Dan...  \nIt would be great if i could meet up with a group of UK typophiles!  \nDo you know who else here is from your neck of the woods?\n\n"
    },
    {
      "time": " 21.Nov.2007 1.21pm",
      "content": "In Reading is this year’s MA Typeface Design class at the University of Reading (the class of 2008, I mean). No public list of the students is posted anywhere online yet, but Paul Hunt—another Typophile moderator and regular—is in the group, too. One of last year’s (2007) graduates is still in town, and several more are scattered across the country. We don’t have an awful lot of contact with the local British typographic scene, though (at least I don’t… this is what happens when you are only going to live in a place for a year, I guess :-( ).\n\nThe Department of Typography and Graphic Communication here \\*is\\* worth a day trip if you’ll be in London for awhile. I’m sure we could round up a good group to go for a pint. Feel free to contact me over my Typophile profile anytme.\n\n"
    },
    {
      "time": " 25.Nov.2007 7.04pm",
      "content": "bumping for more London typophiliacs!\n\n"
    }
  ]
}
