{
  "id": "39318",
  "title": "Realist sans with small caps?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nI'm a complete wannabe — I even put that as my occupation in my profile — so go easy.\n\nA while back I inherited the tedious upkeep on a minor project that has forever used a LOT of Helvetica fake small caps. It's just as awful as you think, and I can't stand it anymore. But I don't have the authority to completely overhaul the card.\n\nI've tried some other sans-serifs with true small caps, but most of them are humanist and thus all wrong. I've found that you can get [an SC font of Akzidenz Grotesk](http://web.archive.org/web/20131020065353/http:/www.itcfonts.com/fonts/detail.htm?pid=423642), but it leaves me feeling \"Ennh.\"\n\nAre there any realist sanses out there with nice-looking small caps?\n\n",
  "author": "75th Trombone",
  "time": "21 Nov 2007 — 12:46pm",
  "uid": "24197",
  "comments": [
    {
      "time": "21 Nov 2007 — 12:51pm",
      "content": "The GX version of Helvetica had real small caps (really!). It hasn't been distributed since probably the mid-1990s. Still, older design studios may still have their GX font collections on CD, or 3.5\" floppy disks… Worth a look?\n\n"
    },
    {
      "time": "21 Nov 2007 — 1:04pm",
      "content": "Although it's a little quirkier than Helvetica, [National](http://web.archive.org/web/20131020065353/http:/vllg.com/KLIM/National/mudTyper+Weights/) has small caps, along with oldstyle and lining numerals.\n\n"
    },
    {
      "time": "21 Nov 2007 — 2:34pm",
      "content": "\\> The GX version of Helvetica had  \n\\> real small caps (really!).\n\nWow. I'm a newbie, I've never seen a GX font in person before. Are they backwards-compatible with vanilla TrueType? Or do you have to basically have FontLab to use them these days?\n\n\\> Although it’s a little quirkier than  \n\\> Helvetica, National has small caps\n\nHey now, that's a lot closer to what I'm looking for! Thanks!\n\nThe only problem is that there's a dark side to my situation. I'm a lone design-conscious mercenary in a company that epitomizes design bankruptcy.† There's a very large central repository of fonts we're licensed to use, but we don't have direct access to it; instead, we have to contact a representative who searches the repository for us.\n\nMy point is that I can't just buy a font from any foundry; I have to find something that we're already licensed to use.\n\nAnd my REAL point is that National, while an excellent candidate that I'm glad to know about, is a no-go, so I'd still like more suggestions if anyone has them. :)\n\n----------------------------\n\n† You can probably guess the company in about three tries (but I beg you not to try).\n\n"
    },
    {
      "time": "21 Nov 2007 — 2:39pm",
      "content": "_Wow. I’m a newbie, I’ve never seen a GX font in person before. Are they backwards-compatible with vanilla TrueType? Or do you have to basically have FontLab to use them these days?_\n\nI don't know.\n\n"
    },
    {
      "time": "22 Nov 2007 — 12:23am",
      "content": "Skia is another one the would be fabulous to get the GX version. Thin to black! Yes, please!\n\n"
    },
    {
      "time": "22 Nov 2007 — 11:42am",
      "content": "I bought the Linotype GX-collection at the time. Is it worth the effort to look for the disks, Dan?  \nThat is: does it work on OS X?\n\n<cite>My point is that I can’t just buy a font from any foundry; I have to find something that we’re already licensed to use.</cite>  \nIn that case you should take a real close look at what you got, mate… That guy with the key to the vault can help you or what else is his job?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "22 Nov 2007 — 2:52pm",
      "content": "Heheh, the guys with the key to the vault can't tell a sans-serif from Sanskrit. I even asked them the other day if they could describe the type collections they have (Adobe Font Folio? Linotype Library? 1001 COOL FONTS?, and the guy was like \"Duhhh, usually we have what you need. You can tell us what font you need and we'll see if we have it.\"\n\nLike I said, I might be the only design-conscious person who works at this whole 20,000-person company, and I'm not even a proper designer. I just try to give my particular place of work a better reputation than the company at large deserves.\n\n'Sokay, though, I'm definitely quitting soon, and then I won't care if they have fake small caps anymore. :P\n\n"
    },
    {
      "time": "22 Nov 2007 — 2:54pm",
      "content": "I should add that the guys with the key to the vault aren't only in charge of font distribution, they do support on all digital stuff company-wide. Being type-conscious isn't in their, or anyone's, job description.\n\n"
    },
    {
      "time": "22 Nov 2007 — 3:38pm",
      "content": "\\>I bought the Linotype GX-collection at the time.  \n\\>Is it worth the effort to look for the disks, Dan?\n\nYes. It can't be too much effort to look, right? The cover is mostly white with black and red, I think.\n\n\\>That is: does it work on OS X?\n\nI don't know. I never tried! But GX was a font format developed by Apple, so…\n\n"
    },
    {
      "time": "22 Nov 2007 — 3:39pm",
      "content": "From the TeX Gyre project, Adventor & Heros are free sans-serif fonts with small-capitals features. Not sure what you mean by \"realist\" though.\n\n—Joel\n\n"
    },
    {
      "time": "22 Nov 2007 — 4:02pm",
      "content": "Support for GX fonts was dropped in OS X.\n\n"
    },
    {
      "time": "22 Nov 2007 — 4:25pm",
      "content": "Just for fun:\n\n[http://www.fontmarketplace.com/ProductInfo.aspx?productid=TAH02-01-01-01](http://web.archive.org/web/20131020065353/http:/www.fontmarketplace.com/ProductInfo.aspx?productid=TAH02-01-01-01 \"http://www.fontmarketplace.com/ProductInfo.aspx?productid=TAH02-01-01-01\")\n\nPerhaps we'll get old style figures too.\n\nMikey :-)\n\n"
    },
    {
      "time": "22 Nov 2007 — 5:17pm",
      "content": "\\> Adventor & Heros are free sans-serif fonts with  \n\\> small-capitals features. Not sure what you mean  \n\\> by “realist” though.\n\nAha! By [realist](http://web.archive.org/web/20131020065353/http:/en.wikipedia.org/wiki/Sans-serif#Classification) I mean Heros!\n\nAdventor is a geometric sans-serif, and is in fact a rip-off of Avant Garde. But Heros is a realist sans-serif, and is in fact a rip-off of Helvetica. And it does have small caps!\n\nIf we didn't have a license to the whole extant Helvetica family, I'd feel funny about using any of those. But we do, so I won't. :) Thanks!\n\n"
    },
    {
      "time": "22 Nov 2007 — 9:41pm",
      "content": "You could also replace the smaller letters with a heavier weight of Helvetica (e.g. 9 pt Helvetica Medium with 12 pt Helvetica Regular as caps). Depending on which application you're using, there might be a way to automate it as well.\n\n- Lex\n\n"
    },
    {
      "time": "23 Nov 2007 — 9:56am",
      "content": "I took a look at Heros -- the small caps are OK, but would need a slight weight increase to match my Helvetica (but the accents over them should not have the weight increase). They also needed to be a touch larger; a small amount of vertical scaling would fix that.\n\nThe old style numbers seem to just be the regular numbers \"moved\" a bit, except, obviously, for the \"1\" and \"2\". The oldstyle \"2\" is just dreadful.\n\nAll in all, I don't think you could just use them directly with another foundry's Helvetica.\n\nFWIW\n\n"
    },
    {
      "time": "23 Nov 2007 — 3:57pm",
      "content": "I'm not using Heros with Helvetica, I'm replacing Helvetica entirely with Heros. :)\n\nI know Heros isn't just spectacular; I don't like a few random features of some letters, and I could tell the small caps weren't perfect. But I'm not using the text figures at all (for which I think I have good reasons), and anything like a close approximation of true small caps is a drastic improvement, even with Heros's cons.\n\nAs far as mixing weights of Helvetica, well... that looks really good. I'm using InDesign CS, though, and I don't know of a way to have it automatically use a different font for the small caps. There's just enough text with just enough caps to make it really tedious to tweak the type manually.\n\nI'll have to consider it, though, because now that I look at them side-by-side, the Helvetica one is far, far superior. Thanks. :)\n\n"
    },
    {
      "time": "23 Nov 2007 — 4:51pm",
      "content": "[Corporate S](http://web.archive.org/web/20131020065353/http:/www.fonthaus.com/products/fonts/view.cfm/sku/UR20703.cfm) small caps are just fantastic.\n\n"
    }
  ]
}
