{
  "id": "39325",
  "title": "OK, so you can tell Helvetica from Arial...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Can you tell [Swiss 721](http://web.archive.org/web/20071226011842/http:/www.fontfinder.ws/20514/Swiss-721-Medium.html) from [Helvetica](http://web.archive.org/web/20071226011842/http:/www.fontfinder.ws/4844/Helvetica-65-Medium.html), and does anyone remember Helios?\n\n [‹ Gift ideas for typophiles](http://web.archive.org/web/20071226011842/http:/www.typophile.com/node/39678 \"Go to previous forum topic\") [Frederic Goudy, a thief? ›](http://web.archive.org/web/20071226011842/http:/www.typophile.com/node/39395 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071226011842/http://www.typophile.com/user/13076\" title=\"View user profile.\">russellm</a>",
  "time": "<br>",
  "uid": "13076",
  "comments": [
    {
      "time": " 21.Nov.2007 8.56pm",
      "content": "R\n\n"
    },
    {
      "time": " 21.Nov.2007 9.35pm",
      "content": "According to [its MyFonts page](http://web.archive.org/web/20071226011842/http:/www.myfonts.com/fonts/bitstream/swiss-721/), Swiss 721 was designed by Max Miedinger, and its letterform design is based on Helvetica.\n\n"
    },
    {
      "time": " 21.Nov.2007 11.43pm",
      "content": "MyFonts’ language isn’t exactly accurate.\n\nMax Miedinger designed Helvetica.\n\nSwiss 721 is based on Helvetica.\n\nBut Miedinger had nothing to do with Swiss 721.\n\n"
    },
    {
      "time": " 22.Nov.2007 4.01am",
      "content": "I wouldn’t be able to tell the difference unless both are put next to each other. Swiss 721 has a narrower M and R and a taller bowl on the g. The e and c seem to have slightly flatter sides too.  \nHelios? No.\n\n"
    },
    {
      "time": " 22.Nov.2007 4.17am",
      "content": "Helios sounds like Compugraphics if I remember.\n\n"
    },
    {
      "time": " 22.Nov.2007 6.49am",
      "content": "And we Alphatype shops had to use Claro - until Berthold bought out Alphatype and gave us true European drawings for Helvetica.\n\nThere are a lot of names out there for fonts that are based and look like Helvetica.... lots.\n\n"
    },
    {
      "time": " 22.Nov.2007 11.22am",
      "content": "_MyFonts’ language isn’t exactly accurate._\n\nThanks for that, Stephen. I wasn’t too sure about their statement myself, and interpreted it as a sheepish acknowledgement that Swiss 721 owes a lot to Helvetica.\n\n"
    },
    {
      "time": " 22.Nov.2007 11.27am",
      "content": "_There are a lot of names out there for fonts that are based and look like Helvetica.... lots._\n\nThere is a partial listing [here](http://web.archive.org/web/20071226011842/http:/desktoppub.about.com/cs/findafont/a/fontaliases_h.htm).\n\n"
    },
    {
      "time": " 22.Nov.2007 11.28am",
      "content": "Wasn’t there a press release a few years back on a Linotype/Bitsream agreement that legitimised the outlines?\n\nIn that case cediting Max and Helvetica as the basis of the design would have been apropriate, no?\n\n"
    },
    {
      "time": " 22.Nov.2007 11.34am",
      "content": "Here it is... [http://www.bitstream.com/corporate/news/press\\_2003/type\\_030718\\_linotype....](http://web.archive.org/web/20071226011842/http:/www.bitstream.com/corporate/news/press_2003/type_030718_linotype.html \"http://www.bitstream.com/corporate/news/press\\_2003/type\\_030718\\_linotype.html\")\n\n"
    },
    {
      "time": " 23.Nov.2007 7.13am",
      "content": "I worked in a Compugraphic shop in the 70s. We used the word Helvetica on our font listing, but the filmstrip said Helios.\n\n"
    },
    {
      "time": " 23.Nov.2007 7.22pm",
      "content": "Thanks, sii.\n\nInteresting. I didn’t know there was an agreement that legitimized Swiss.\n\nDon, That’s about when I used Helios. It was the “Helvetica” you got from the typesetter across the road from where I worked back then.\n\n-=®=-\n\n"
    },
    {
      "time": " 24.Nov.2007 7.05am",
      "content": "I worked at some publications back in the Seventies that had Compugraphic or AM typesetting equipment in house. Their respective versions of Helvetica—Helios and Megaron—were noticeably different, but superficially similar to Helvetica. I remember wishing we could afford to send out for type from a shop that had Linotype equipment because the knock-offs didn’t look quite like the real thing. Another common off-brand Helvetica back then was Aphatype’s Claro. Compugraphic released an exact copy of Helvetica in the early Eighties called Triumvirate. (Now that I see the name again, “Megaron” sounds like the name of a Japanese movie monster.)\n\n"
    },
    {
      "time": " 24.Nov.2007 8.58am",
      "content": "I think it’s interesting how clones and metrically compatible fonts have been effectively “retired” as foundries have consolidated. From the “old days” what do we have in every-day use? Swiss (as seen in the recent Sony eReader) and Arial, and even Arial has been ‘retired’ as a default in Office. On the other hand in the past ten years we’ve seen several new fonts based on Arial’s metrics.\n\n"
    },
    {
      "time": " 24.Nov.2007 9.45am",
      "content": "The old clones were mainly a result of the fact that fonts from one manufacturer’s equipment could not be used in another’s. In effect, there is only one kind of typesetting machine now, and fonts are for the most part interchangeable. If you want to set type in Helvetica, you don’t need to by your “typesetting machine” from Linotype anymore. You just need to license the font.\n\n"
    },
    {
      "time": " 2.Dec.2007 3.58pm",
      "content": "Mark -\n\nTriumvirate was produced digitally by Agfa Fonts for the Mac back (I think) in the early ’90s.  \nAlphatype’s Claro - was really, really weak as a Helvetica. Our shop loved getting in the Berthold one - and Len Leone Sr., the art director of Bantam Books at that time - really took notice to our Helvetica. I think I shared that story here before, so I won’t do it again.... but hey, it was a good, positive sign for my typeshop...\n\nAlso, you may remember that the Helvetica on film for typositor was also very different from the digitized versions for Alphatype, Harris, Compugraphic, Linotype and forgive me for all the other typesetting equipment I didn’t name that bit the dust.\n\nOne of my favorites was from Castcraft — Helvetica Advertising. It had lower case the same height as upper case - and it was wonderful for ad copy.\n\n"
    },
    {
      "time": " 2.Dec.2007 8.45pm",
      "content": "Yes, I remember Triumvirate was released by Agfa (before it joined up with Monotype) when they first started selling PostScript Type 1 fonts in the early Nineties. It seemed like a strange idea to me at the time. Why would you buy it if you could get the real thing?\n\nThe film headline fonts of Helvetica were based on the metal foundry type for display sizes. Most of the current digital versions are based on Linotype’s machine-set metal version, which were all designed for 18-point or smaller. The display sizes in metal were always more elegant and refined, no matter what typeface it was. Sadly, most of the digital versions of the old standbys are based on text sizes. URW has digital versions of both for some faces (designated with a T for text or a D for display), as does Bitstream (with the word “Headline” in the name). Check out URW’s Nimbus Sans D and you will see the Helvetica you remember.\n\n"
    }
  ]
}
