{
  "id": "3933",
  "title": "(x) Looking for Ancient style - Greek/Roman - various {gang}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi all,   \n   \nIm looking for a face to represent the ancient style. Not in the way of Lithos or p22's Acropolis. More like Bitstreams Engravers'Roman or Symbol/Universal Math. SPQR comes to mind.   \n   \nIf anyone has any links to types or research of this sort I would really appreciate it.   \n   \nThanks,   \nBrennan\n\n",
  "author": "brennan",
  "time": "2 Dec 2002 — 5:24am",
  "uid": "641",
  "comments": [
    {
      "time": "2 Dec 2002 — 5:45am",
      "content": "Engravers Roman   \n [http://store.bitstream.com/charactermap.asp?handle=233&fontname=Engravers'%20Roman](http://web.archive.org/web/20131023193351/http:/store.bitstream.com/charactermap.asp?handle=233&fontname=Engravers'%20Roman)\n\n"
    },
    {
      "time": "2 Dec 2002 — 7:22am",
      "content": "Thanks for that character ref Jared,   \n   \nActually I was looking for more variations on that theme. I am developing a logotype for a company called Spartan and was after some research.   \nI was looking for an older style. I think im going to hit the Library and see what they have.   \n   \nIf Gerry Leonidas is on this forum he might know ;)   \n   \nI found some resources if you want to check them out:   \n [http://www.kolumbus.fi/jltypes/grproof.html](http://web.archive.org/web/20131023193351/http:/www.kolumbus.fi/jltypes/grproof.html)   \n [http://www.linguistsoftware.com/lgk2.htm](http://web.archive.org/web/20131023193351/http:/www.linguistsoftware.com/lgk2.htm)\n\n"
    },
    {
      "time": "2 Dec 2002 — 7:53am",
      "content": "Brennan, I for one am a little confused.   \nCould you pinpoint what you/the\\_client are trying to convey?   \n   \nhhp\n\n"
    },
    {
      "time": "2 Dec 2002 — 8:18am",
      "content": "Ahh! sorry Hrant,   \n   \nHere is the deal:   \nThe logotype is for a company called Spartan. I am trying to find an oldstyle Greek font that has an appearance of the engraved, worn look.   \nI know that im not going to get away with a totally Greek face so im going to have to \"dress a Roman like a Greek\" as you said on one of these posts. ;)   \nBut its the feel of the face im after. 'Weathered by time' sort of look. I was going to do some research and draw the logotype myself, but was wondering if there were any faces like this already.   \n   \nSorry for the confusion.   \n   \nBren\n\n"
    },
    {
      "time": "2 Dec 2002 — 8:33am",
      "content": "If you want to be culturally authentic, you might have a tough time, since \"Hellenicized\" Latin fonts are pretty rare, so a specifically weathered one might not exist. One reason not to worry too much about authenticity in this case is that people might -understandably- not even have the sensitivity to realize what it is! Collective memory (in the West) doesn't seem to extend to anything before the Roman Empire, I mean in terms of noticing if it's authentic or not. Just use Democratica... ;-)   \n   \nYou could go Bizantine and use Sophia. Or you could use a less-familiar Roman style (like Herculanum) and pretend. Or you could take something like Skia and weather it yourself. Or you could wait for Gerry to give a much more qualified answer. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "2 Dec 2002 — 8:59am",
      "content": "Man, you are a wealth of information! haha! ;)   \n   \nThanks for all the recommendations! I agree that people might not recognise the authenticity, or even care, but I have the unfortunate/fortunate nature of being a perfectionist ;)   \nDemocratica? uhh... No. (no offence Miles!)   \n   \nSophia is a great call! I love the geometry. I am going to have to adapt it somehow.   \n   \nThanks for all the info Hrant,   \nI'll show you what I come up with.   \n   \nBren   \n   \nPS. I remeber you from the old TyD elist. Nice to know some things never change =)\n\n"
    },
    {
      "time": "3 Dec 2002 — 2:13am",
      "content": "Cheers for the link Mike,   \n   \nThere certainly are a couple there for reference. Thanks heaps!   \n   \nBren\n\n"
    },
    {
      "time": "4 Dec 2002 — 2:53am",
      "content": "Hi George,   \n   \nThanks for the info.   \nI dont know how this is going to work, but im going to try and merge the Latin & Greek to 'create' the feel of antiquity.   \n   \nI only have to get a combo of S, P, A, R, T & N. Maybe hint at a bridge (is that the right term?) on the \"A\"? The Greek \"R\" is a Latin \"P\" thats going to be tricky because I use both. \"S\" will **have** to be Latin, same with the \"T\".   \n   \nAny suggestions?   \n   \nBren\n\n"
    },
    {
      "time": "4 Dec 2002 — 8:28am",
      "content": "\\> merge the Latin & Greek to 'create' the feel of antiquity.   \n   \nSounds like a plan. Fortunately it's a logotype - a font would be a whole different story.   \n   \nS: What about an h-flipped \"Z\"? That would look like a Greek Sigma.   \nP, R: Keep them open?   \nA: Try a chevron bar.   \nT: Tough one. Making it a cross is an obvious answer, except the Ancient Greeks were pagan.   \nN: Do something funky.   \n   \nBTW, you could look at Barnbrook's Mason and Exocet for inspiration. And maybe Trajic notRoman:   \n [http://www.themicrofoundry.com/ss\\_trajic.html](http://web.archive.org/web/20131023193351/http:/www.themicrofoundry.com/ss_trajic.html)   \nBut please don't ask for a copy.   \n   \nOverall: make things not very aligned; maybe flare the stroke endings.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Dec 2002 — 8:58am",
      "content": "Sorry for joining in late (been on a short holiday): Blambot has a worn-looking Greek-looking freeware font called [Pythia](http://web.archive.org/web/20131023193351/http:/www.blambot.com/title.html). Maybe worth checking out?\n\n"
    },
    {
      "time": "4 Dec 2002 — 9:01am",
      "content": "Hrant! you were holding out on me! ;)   \n   \nThat face you have is a perfect refrence! The P and R are fantastic. I see how you have tried to combine the S.   \n   \nS is tricky because (I feel) its about recognition. Since that is the first letter it has to have some sort of flow to lead you in (or am I being pedantic?). I agree a h-flipped S would look more authentic... lets see what happens ;)   \n   \nI also had thoughts about keeping the P & R open. I was just looking at Palatino, maybe I'll funk them up similarly.   \nAs for the A, I could use a lowercase: **a**   \n   \nneed to think now.   \n   \nThanks   \n   \nBren\n\n"
    },
    {
      "time": "4 Dec 2002 — 9:07am",
      "content": "Hi Yves,   \n   \nThanks for the link. I am trying to stay away from the Lithos style, but at the same time use some elements. Im contradicting myself! I'll stop now ;)   \n   \nBren\n\n"
    },
    {
      "time": "2 Dec 2002 — 9:47pm",
      "content": "There might be a couple here worth checking out:   \n   \n [http://www.dafont.com/en/theme.php?cat=108](http://web.archive.org/web/20131023193351/http:/www.dafont.com/en/theme.php?cat=108)   \n   \n Mike\n\n"
    },
    {
      "time": "3 Dec 2002 — 9:57pm",
      "content": "Keep in mind that the inverted \"V\" which is used as a cap \"A\" in some of the fonts offered by the \"ionics\" foundry is \"L\" in Greek.\n\n"
    }
  ]
}
