{
  "id": "39364",
  "title": "How savvy are our readers?",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Typographers choose which typefaces to use on their expressive qualities, but how much of this awareness do you think is shared by the reader?\n\n",
  "author": "tanyaholbrook",
  "time": "23 Nov 2007 — 3:13am",
  "uid": "24259",
  "comments": [
    {
      "time": "23 Nov 2007 — 5:29am",
      "content": "It depends, sometimes you don't want to express anything, but still make the reader free to read in between the lines, plus you can consider how print designers differ from the web.\n\n"
    },
    {
      "time": "23 Nov 2007 — 10:06am",
      "content": "I struggle question with this every day. Both as a font seller and user. So much of how typography effects readers depends on the subject and design and the literacy (cultural) of the reader.\n\n"
    },
    {
      "time": "23 Nov 2007 — 11:04am",
      "content": "This is impossible to measure. I would say that the odds of our readers \"getting\" exactly our reason for a typeface choice is not very high unless the target audience is the design/typography crowd. That does not mean our loves' labours are lost, it just means audiences can't verbalize intangible effects.\n\nChrisL\n\n"
    },
    {
      "time": "26 Nov 2007 — 1:56pm",
      "content": "I remember being 7 or 8 years old and loving certain books I read, in part, because of the type used.\n\nSharon\n\n"
    },
    {
      "time": "27 Nov 2007 — 6:07am",
      "content": "Thank you for you posts,\n\nWould you think that your choices are based more on the legibility of the typefaces or their expressive qualities? I would presume that for the web our choices are much more limited and detrimental to the readers experience. But is this the case?\n\nTanya\n\n"
    },
    {
      "time": "27 Nov 2007 — 6:47am",
      "content": "Please, Tanya, explain better your idea(s) on this, maybe with the use of some examples.\n\n"
    },
    {
      "time": "27 Nov 2007 — 7:35am",
      "content": "\"how much of this awareness do you think is shared by the reader?\"\n\nIt depends on the reader.\n\n\"Would you think that your choices are based more on the legibility of the typefaces or their expressive qualities\"\n\nIt depends on the project.\n\n\"I would presume that for the web our choices are much more limited and detrimental to the readers experience. But is this the case?\"\n\nFewer options can be a good thing as much as a bad thing.\n\n"
    }
  ]
}
