{
  "id": "39368",
  "title": "Typographic overhaul on website: line-height, readability etc.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A couple of days ago I updated my css for my own personal website to make it a little more readable. I removed italics and boldness from all headlines, shrunk the font a little bit in favour of a bigger line-height, etc.\n\nCould you give me some feedback on the readability of the site now? And on the general feel of the site?\n\nThe link is [squawkdesign.com](http://web.archive.org/web/20071201031024/http:/www.squawkdesign.com/ \"Squawk\")\n\n [‹ TYPE BLOCK: photography + typography call for participants](http://web.archive.org/web/20071201031024/http:/typophile.com/node/38892 \"Go to previous forum topic\") [UK design firms? ›](http://web.archive.org/web/20071201031024/http:/typophile.com/node/38591 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071201031024/http://typophile.com/user/23567\" title=\"View user profile.\">Squawk</a>",
  "time": "<br>",
  "uid": "23567",
  "comments": [
    {
      "time": " 23.Nov.2007 8.26am",
      "content": "Lovely illustration on the top bar! I fact the top one-third of the page is really nice. Somehow the rest is not working as well as that.\n\nProbably it is an issue of hierarchy. Quite a lot of elements seem to have more or less the same level of prominence that you are not sure what to look at first, what next.\n\nA few suggestions:\n\n:: Relook the text of your intro. While the different definitions of Sqawk are sort of fun, I wonder if it may not be an idea to combine those three levels of intro into one crisp, and if possible amusing :), paragraph of not more than three lines.\n\n:: You might want to introduce some white on the background in the lower half of the page. It’s currently a little too monochromatic.\n\n:: Make the screen-shot of the featured project a little smaller. And avoid the project-title running into the thumbnail.\n\n:: The date on the description of the featured projects could perhaps come after the description itself, as against between project name and description.\n\nGood luck!\n\n"
    },
    {
      "time": " 23.Nov.2007 8.52am",
      "content": "writingdesigning : Thanks for the suggestions. I’ll try them in Potatoshop to see if it makes a difference. What exactly do you mean by avoiding the project title running into the thumbnail? What browser are you using?\n\n"
    },
    {
      "time": " 23.Nov.2007 11.12am",
      "content": "“What exactly do you mean by avoiding the project title running into the thumbnail?”\n\nI meant that:\n\n ![](http://web.archive.org/web/20071201031024im_/http:/typophile.com/files/Overlap_4853.jpg)\n\nBut you’re right. It’s to do with the Opera browser. ’Doesn’t seem to happen in IE\n\n"
    },
    {
      "time": " 23.Nov.2007 12.50pm",
      "content": "OK, thanks for the clarification... I’ve thought I tested every browser, but apparently I did forgot Opera... I’ll have a look what I can do against that... css-wise...\n\n"
    },
    {
      "time": " 23.Nov.2007 2.39pm",
      "content": "Hi Dominik,\n\nthis is from Safari:\n\n ![](http://web.archive.org/web/20071201031024im_/http:/typophile.com/files/screen_6592.png)\n\nThis happens when users specify a minimum font-size. I know, there are not a lot of people who use that option, but I do …  \nF\n\n"
    },
    {
      "time": " 23.Nov.2007 3.51pm",
      "content": "Florian: I did a little research on Safari’s minimum font size. It seems like Safari forces it on the element after all other values have been computed. This means that widths (such as my left padding) are not updated. The only solution would be to stop using ems to specify widths, which I do not want to do... I do not know whether !important would make much of a difference.  \nWhat’s your opinion? I saw that did some webdesign, so I think it is safe to ask. (even though this is a typography forum.)\n\nEDIT: It seems like there is a way around it: [http://www.gunlaug.no/contents/wd\\_1\\_03\\_04.html](http://web.archive.org/web/20071201031024/http:/www.gunlaug.no/contents/wd_1_03_04.html \"http://www.gunlaug.no/contents/wd\\_1\\_03\\_04.html\") Just specify the largest font size on the parent and use values smaller than 1em on its children. Does anybody have any experience with this?\n\nThanks to everybody who pointed up some (obvious) flaws. However, I directed the post more at readability... Any comments on that? :(\n\n"
    },
    {
      "time": " 24.Nov.2007 3.33pm",
      "content": "<cite>What’s your opinion? […] even though this is a typography forum.</cite>\n\nHey, there’s more to typography than letterforms – quite the contrary; positioning, size and interaction of text (and other) elements is what typography in a narrower sense is all about. ;°)\n\nMy 2 cents (I hope you find them helpful and constructive):\n\nBuilding a scalable website is a honourable task – but it’s full of pitfalls, too. So, test-test-test, and don’t assume every user will use the same UAs, fonts and font-sizes.\n\n<cite>The only solution would be to stop using ems to specify widths, which I do not want to do</cite>  \nMaybe you have to compromise … Your background image is based on pixels, too – in consequence text runs across the bright vertical sidebar border.  \n**Create true correlations:** If you want the sidebar to have a border, specify the border for this very element, not via the background-image for some superior element (‘div id=”dock”’).\n\nI see you’re fond of the web standards idea – which is laudable – however have in mind that it’s not the validation engine that wants to be pleased but the human user.\n\nSome concrete points:  \nSpecifying image size in em will preserve proportions, but it implicates uglily blurred images.  \nYour list item contains a h4 heading, a paragraph (date) and another paragraph. If you want these 3 to align properly, treat them equally! If necessary, wrap them up in a container element. Right now, their aligning is more or less coincidental, depending on the user to retain the defaults (which defaults?).\n\n<cite>However, I directed the post more at readability... Any comments on that?</cite>  \nWell, it’s hard to descend to the details if elements overlap … ;°) However:  \nI find the line-height of h1 quite big.  \nFor the ‘Recent Weblog Entries’ section: Why can’t the titles themselves be clickable? Is it really necessary to have a (to me) distracting extra ‘Read’ link in every single line?\n\nBest regards,  \nF\n\n"
    },
    {
      "time": " 26.Nov.2007 1.46pm",
      "content": "Thanks Florian, it is nice to get some feedback on this. I’ll make some adjustments over the next weekend. What you said about the backgrounds and the scaling of the type when users enlarge the text is definitely true, and I’ll have a look how I can fix some of the other issues as well...\n\nOh, and the Read link will be killed soon as well: Quite a few other people already mentioned that to me and I believe that I wasn’t thinking when I put it in;-)\n\n"
    }
  ]
}
