{
  "id": "39383",
  "title": "Titling Typeface: Shadowcliffe (Moved from Serif)",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "See the latest PDF here (latest updates at bottom of post):\n\n[http://www.alexvaranese.com/work/amv-Shadowcliffe-Regular\\_Rough\\_Cut\\_5.pdf](http://web.archive.org/web/20150417042801/http:/www.alexvaranese.com/work/amv-Shadowcliffe-Regular_Rough_Cut_5.pdf \"http://www.alexvaranese.com/work/amv-Shadowcliffe-Regular\\_Rough\\_Cut\\_5.pdf\")\n\nThanks to Antonio for the great feedback. In response to what you said:\n\n- The proportions are definitely not accurate. Shadowcliffe is only partially based on Trajan, as opposed to being a direct replica/revival. So I'm still taking plenty of artistic liberties.\n\n- The S is indeed wider by design; as much as I love the original Trajan S, I wanted Shadowcliffe to be a little more versatile, and as a result things like the ultra-narrow S have been adjusted for greater consistancy.\n\n- The J, K and R terminals did in fact \"swell\" too much. I was trying to give some of the standard glyphs a slightly more swash-like character, but as much as I like the idea I was going for, the execution never quite worked out. So I've reverted them to a more standard design.\n\n- The X was unintentionally top-heavy and should be fixed now.\n\n",
  "author": "amv",
  "time": "23 Nov 2007 — 12:49pm",
  "uid": "23823",
  "comments": [
    {
      "time": "23 Nov 2007 — 3:21pm",
      "content": "I like it, well produced and balanced (probably _because_ of things like the 'S' being wider than it is in Trajan and such).\n\nOnly thing I don't like -- which I also don't like in Trajan (amongst other things) -- are the serifless tops of the 'M' and 'N'. I understand that the historical precedents have this as well, but I think it makes them look as if they don't belong in the set.\n\nI like the 'R', the fact that it doesn't connect to the stem, and the leg as well.  \nThe weight distribution could use some attention, but only here and there. For example compare the diagonal of the 'N' with the spine of the 'S'. But also the bowl of the 'D' compared to those of the 'C'/'G'. It's only minor, but nevertheless. :)\n\n"
    },
    {
      "time": "23 Nov 2007 — 3:30pm",
      "content": "Thanks for the comments. Funny how subjective this stuff can be: The missing serifs on the M and N are among my favorite aspects of the Trajan characters, and one of the reasons I chose it as an inspiration. :)\n\nYou're also right about the weight issues-- I noticed the S vs. N problem shortly after uploading the PDF, and have since fixed it. I also always knew there was something up with the C/G vs. D thing, but you've prompted me to take a more formal look at it and actually do something about it.\n\n"
    },
    {
      "time": "23 Nov 2007 — 4:41pm",
      "content": "Yeah, just a difference in opinion, but those characters are one reason why I don't use Trajan. Well... mainly the fact that it has been used to death on movieposters, but ok. ;)\n\n"
    },
    {
      "time": "25 Nov 2007 — 8:50pm",
      "content": "Phew! Turns out the last character set was anything but finished. :) I just did another complete overhaul, doing a lot of very brutal testing, viewing test strings from a distance, from weird angles, etc:\n\nNOW, I think I might finally be ready to wrap up the character set. I did a lot of work across all of the weights/strokes/stresses, and made a rather bold change in the size of the bowls on the R, P and Thorn-- they're considerably larger now, giving the face quite a bit more character than it had originally. They're so big they almost remind me of Goudy Old Style or something. But this is a titling font, and I think it makes sense. As part of my move away from the strangely narrow characters found in the Roman Trajan capitals, such as R, P and S, I think this to some degree inescapable.\n\nI should be able to knock out the rest of this weight within a few days, assuming I don't once again decide to redo the damn capitals. :) Here's what I plan on:\n\n- Union of WinANSI + MacOS Roman characters  \n- Small caps for lowercase  \n- Both lining and old-style figures (lining will be default, as this is a title font)  \n- Complete set of numerators/denominators for OpenType fractions  \n- Select swash capitals  \n- Flourish ornaments\n\nOnce that's done, I'll at the very least be adding a considerably heavier bold weight, and possibly a light weight on top of that.\n\n"
    },
    {
      "time": "25 Nov 2007 — 8:51pm",
      "content": "New update:\n\n[http://www.alexvaranese.com/work/amv-Shadowcliffe-Regular\\_Rough\\_Cut\\_5.pdf](http://web.archive.org/web/20150417042801/http:/www.alexvaranese.com/work/amv-Shadowcliffe-Regular_Rough_Cut_5.pdf \"http://www.alexvaranese.com/work/amv-Shadowcliffe-Regular\\_Rough\\_Cut\\_5.pdf\")\n\nRethought the bowl proportions on R/P/Thorn again. Added numerals as well.\n\n"
    },
    {
      "time": "27 Nov 2007 — 3:31am",
      "content": "Hey Alex, I think the X could use some more work: doesn’t the lower left serifs look a bit too small, making the letter out of balance? As for everything else I stand by my sadly deleted comments, I like what I see.\n\n"
    }
  ]
}
