{
  "id": "39395",
  "title": "Frederic Goudy, a thief?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Fellow Typophiles,\n\nI’ve read an interesting story about good ol’ Goudy. Making research about the unfortunate and talented Oz Cooper, I’ve learned that his teacher and mentor in type design was Frederic Goudy, and a few years after they parted their ways, when Cooper Black became a huge success, most of the competiting foundries made copies of this type, and of these replicas was made by... Frederic Goudy himself. Oz Cooper was quite bitter, tried unsuccessfully to protect his design, and finally died from cancer in 1940 at age 61.\n\ndoes anyone know more about this? I’d like to learn.\n\ndr\n\n [‹ OK, so you can tell Helvetica from Arial...](http://web.archive.org/web/20080830040258/http:/www.typophile.com/node/39325 \"Go to previous forum topic\") [non-lining helvetica numerals ›](http://web.archive.org/web/20080830040258/http:/www.typophile.com/node/39675 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080830040258/http://www.typophile.com/user/19074\" title=\"View user profile.\">David R</a>",
  "time": "<br>",
  "uid": "19074",
  "comments": [
    {
      "time": " 24.Nov.2007 12.57am",
      "content": "[http://cheshiredave.com/mastication/2002/07/0037a-btt.html](http://web.archive.org/web/20080830040258/http:/cheshiredave.com/mastication/2002/07/0037a-btt.html \"http://cheshiredave.com/mastication/2002/07/0037a-btt.html\")\n\n"
    },
    {
      "time": " 24.Nov.2007 1.32am",
      "content": "And here I was walking in thinking it was just him letterspacing some lowercase...\n\n"
    },
    {
      "time": " 24.Nov.2007 7.21am",
      "content": "Ralf: That’s classic. Thanks!\n\n"
    },
    {
      "time": " 24.Nov.2007 8.06am",
      "content": "that’s classic, and nice, but i can’t find any documentation which would back up what’s being said there.\n\nhow come?\n\ndr\n\n"
    },
    {
      "time": " 24.Nov.2007 12.53pm",
      "content": "David R, You said you read this story but didn’t say where. Could you provide a source (online or printed)? I’ve been curious about the story since hearing it in the Cheshire Dave film which I agree is very funny and very clever.\n\nHowever, the narrator’s claim in the Cheshire Dave film never seemed right for the simple fact that the specific Goudy type (was it Pabst?) mentioned doesn’t look at all like Cooper Black to my eye. It might be another. The lettering style is imitated all the time during the period. And guys, let’s remember, plagiarism was rampant at the time (look at ATF and Koch, or Continental Type Foundry’s [FWG’s foundry type distributor in the 1930s] attempt to sue ATF in the 1920s) and designers (including Goudy) didn’t get rich off their commercial designs. They made their money on private designs and book/advertising design.\n\nI doubt the story made it into print in their day. Most of the nasty comments about Goudy found their way into private letters or unpublished talk. Rudolf Ruzicka’s <cite>Speaking Reminiscently</cite> (Grolier Club, 1986)( [cite](http://web.archive.org/web/20080830040258/http:/worldcat.org/oclc/13803244)) mentions his own break with FWG over a portrait—it was Goudy’s egotism that irritated RR. (The unedited tapes are held by the Club but FWG warrants only two short mentions.) Morison and Updike wrote snidely about G in their private correspondence (but then they also were a bit snide about Bruce Rogers too). If you don’t have <cite>The Book of Oz Cooper</cite> (STA, 1949) ( [cite](http://web.archive.org/web/20080830040258/http:/worldcat.org/oclc/41547813)), you should look at it. I think RH Middleton also has a Cooper book ( [cite](http://web.archive.org/web/20080830040258/http:/worldcat.org/oclc/34637591)). Not much published on him outside the Chicago area. You might check with current Chicago-area AIGA members and such. A number of old-timers knew Middletown and had heard stories from them, but not being in Chicago, I’ve never tried to get the stories.\n\n-Paul\n\n"
    },
    {
      "time": " 24.Nov.2007 1.08pm",
      "content": "Ralf,\n\nThank you so much for showing us the way to Behind the Typeface...\n\nI just adored it! Made my day....\n\nI was waiting to hear how Cooper Black went so down and out - you could find him on the Bowery...\n\n"
    },
    {
      "time": " 24.Nov.2007 1.20pm",
      "content": " ![](http://web.archive.org/web/20080830040258im_/http:/www.typophile.com/files/cooperheavy_4864.jpg)\n  \nThe Goudy type in question would be Goudy Heavyface. Goudy recalls in his “Half Century of Type Design” that this type of heavy black face held little appeal to him but that Harvey Best of Lanston Monotype was “obsessed” with releasing one...most likely to compete with Cooper Black. As far as forgery, theft or inspired mimicry, you decide, here they are for comparison.\n"
    },
    {
      "time": " 24.Nov.2007 11.13pm",
      "content": "The italics have more differences, if I recall correctly.\n\n"
    },
    {
      "time": " 25.Nov.2007 12.09am",
      "content": "If I remember _Letters of Credit_ correctly (which I may not), Walter Tracy much prefers Goudy Heavyface to Cooper Black, calling most of the other faces inspired/ripped-off from Cooper Black “obscene.” I think I concur that Goudy’s version has its own merits: it feels a lot closer to “traditional” type (almost like a crazy, extra black weight) compared to Cooper’s, which gives me a more independent vibe.\n\n"
    },
    {
      "time": " 25.Nov.2007 6.18am",
      "content": "The Goudy is much more refined and crisp than Cooper. It is in the same weight and general feel but they are very different to me. Cooper is much more loose and casual. It has a different relaxed appeal and perhaps less broad usage. Goudy fills more usefulness categories and is just better crafted.\n\nChrisL\n\n"
    },
    {
      "time": " 25.Nov.2007 6.59am",
      "content": "I agree that they are significantly different.\n\nTo me Goudy Heavyface is not as good a typeface, even though it very well executed—maybe better than Cooper Black. The problem is that it is neither here nor there. It has the fat and soft look, but without the distinctive charm of Cooper Black. What is great about Cooper black is those endearing bulbous serifs and terminals—while still the face still has a strong spine, unlike Hobo or Souvenir. So yes, Goudy Heavyface could be used in more categories, but who wants to? You probably have better alternatives. But if you want something bold but cute, which is in demand in advertising, then there you have Cooper Black smiling at you. It has won the popularity contest with Goudy Heavyface and I think you can see why.\n\nChris, I disagree with you that Goudy is ’more crisp’, as it is still quite soft. For a charming fat face that is more clean and crisp, we are awaiting the heavy weight of your “Froggy,” which you have shown in the Critique threads. Now that will give Cooper Black some real competition!\n\n"
    },
    {
      "time": " 25.Nov.2007 7.21am",
      "content": "On the other hand — speaking as a dilettante type observer — Goudy’s perpetuates the distinctive visual voice of its designer, so although it was evidently occasioned by Cooper Black, and clearly draws on Cooper’s notion of a rounded, fat display face, the term “thief” seems wildly inappropriate. All the more so, in the pre-digital era.\n\n"
    },
    {
      "time": " 25.Nov.2007 7.50am",
      "content": "... Though, we are all, here, meticulous typography lovers and observers, our eyes can make a quick distinction between the two types. But for Mr everyone, these are almost the same. The link is quite obvious, especially when you know that Goudy was the type teacher of Cooper.\n\nBut maybe I’m wrong.\n\ndr\n\n"
    },
    {
      "time": " 25.Nov.2007 8.05am",
      "content": " ![](http://web.archive.org/web/20080830040258im_/http:/www.typophile.com/files/Thanks-William_4190.png)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Nov.2007 10.53am",
      "content": "David, if we base our claims on what is recognizable (or not) by the “layperson,” then most of the discussion here at Typophile is moot.\n\n"
    },
    {
      "time": " 25.Nov.2007 11.22am",
      "content": "I have to say I think that Cooper Black is the more successful typeface overall compared to Goudy Heavyface, with a more timeless appeal (it certainly doesn’t look its age to me).\n\nIf a design called for a period look though, I’d go with the latter.\n\n"
    },
    {
      "time": " 25.Nov.2007 12.57pm",
      "content": "\\> (it certainly doesn’t look its age to me)\n\nThat may be because you see so much of it in use today on current design.\n\n"
    },
    {
      "time": " 25.Nov.2007 1.53pm",
      "content": "Don’t know if “theft” would be my term of choice here, but I would definitely opt for Cooper since the “better executed” Goudy is so sanitized as to be sterile in comparison.\n\nAnd who can easily forget the charm of Cooper’s hand?\n\n ![](http://web.archive.org/web/20080830040258im_/http:/www.typophile.com/files/coopmove_6420.gif)\n\n"
    },
    {
      "time": " 25.Nov.2007 8.42pm",
      "content": "Cooper was persuaded to do a “similar to” version of a Bernhard script.  \nEven obliging their foundries in such a manner, he and Goudy showed considerably more originality than one often sees today.\n\n"
    },
    {
      "time": " 25.Nov.2007 11.40pm",
      "content": "Solfeggio: This is a very beautifyl document. Would you happen to have it in a better resolution?\n\ndr\n\n"
    },
    {
      "time": " 26.Nov.2007 5.08am",
      "content": "Sorry, David, but I can’t provide a better resolution version as all I have is a ratty photocopy in a folder of items culled from early 20th cent. “show card” lettering books. I failed to note the source, unfortunately, but perhaps someone else might recognize the item. (Perhaps Mark Simonson or Nick Shinn might chime in on this?) What I thought you would find interesting is this particular sample predates “Cooper Black” by roughly six or eight years (if memory serves). Wish I could help more.\n\nRegards,  \nErnie\n\n"
    },
    {
      "time": " 26.Nov.2007 6.17am",
      "content": "Solfefggio, thanks for the info. ’m gonna try to get this in high res, if I can do so outside of this forum, i’ll keep you informed.\n\ndr\n\n"
    },
    {
      "time": " 26.Nov.2007 7.26am",
      "content": "It’s from the Book of Oz Cooper  \nin the intro, it says Ozbuk means “alphabet” in Russian\n\n"
    },
    {
      "time": " 26.Nov.2007 7.56am",
      "content": "I half-expect to see an “R Crumb” signature at the bottom of that!\n\n"
    },
    {
      "time": " 26.Nov.2007 12.16pm",
      "content": "[http://www.oakknoll.com/detail.php?d\\_booknr=52520&d\\_currency=](http://web.archive.org/web/20080830040258/http:/www.oakknoll.com/detail.php?d_booknr=52520&d_currency= \"http://www.oakknoll.com/detail.php?d\\_booknr=52520&d\\_currency=\")\n\n"
    },
    {
      "time": " 26.Nov.2007 1.06pm",
      "content": "_http://www.oakknoll.com/detail.php?d\\_booknr=52520&d\\_currency=_\n\nWhoa! The “Book of Oz” cover looks bizarrely similar to the old Lutheran hymnal I grew up with!\n\n ![](http://web.archive.org/web/20080830040258im_/http:/www.typophile.com/files/052520_4109.jpg)\n\n ![](http://web.archive.org/web/20080830040258im_/http:/www.typophile.com/files/library_red_hymm_book_4254.jpg)\n\nHave I uncovered some kind of type-designer/mainline-Protestant cabal?\n\n"
    },
    {
      "time": " 26.Nov.2007 1.16pm",
      "content": "Have you ever seen the old Nabisco Ritz Crackers logo?\n\nChrisL\n\n ![](http://web.archive.org/web/20080830040258im_/http:/www.typophile.com/files/Nabisco_Logo_4958.gif)\n\n"
    },
    {
      "time": " 26.Nov.2007 4.38pm",
      "content": "Thank you for the information, this is very much appreciated.\n\nAlso, i didnt realize, but the Robert Crumb allusion is indeed quite pertinent...\n\nI’ll look into that as well.\n\nKegler, I think I understand that you hace a copy of the Book of Oz Cooper. If yes, would it be possible for you to scan the image that was posted above? Is there another example of such a handwtiting in the book?\n\nthanks\n\ndr\n\n"
    },
    {
      "time": " 26.Nov.2007 7.29pm",
      "content": "Goudy also did a knock-off of Cooper Black for Ludlow in Chicago called Ludlow Black. The serifs are more “dogbone” in shape than Cooper, p. 172 in the red Ludlow book.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 27.Nov.2007 5.30am",
      "content": "Ludlow Black is much closer to Copper Black but it is attributed to Robert Middleton not Goudy.(ref: McGrew, American Metal Typefaces)\n\nDavid: I would be happy to scan if you can wait a few days. please email me off-list richard (insert at sign here) p22.com\n\n"
    },
    {
      "time": " 27.Nov.2007 6.23am",
      "content": "Eliason: Nothing quite like the old SBH is there? The Cross on top of the circle with a line is a symbol for the proclamation of Christ throughout the whole world, etc. Not quite related to Oz’s symbol, I’m sure!\n\n"
    },
    {
      "time": " 27.Nov.2007 6.30am",
      "content": "I posted a scan of that lettering by Oz Cooper along with some other lettering from the book on [this thread](http://web.archive.org/web/20080830040258/http:/www.tcj.com/messboard/viewtopic.php?t=2635&start=40) at the Comics Journal messageboard. There are also some nice samples of Crumb lettering posted on the same thread.\n\n"
    },
    {
      "time": " 27.Nov.2007 6.45am",
      "content": "The Orb and Cross has a long history for printers going back to Jenson (and supposedly back to medieval scribes)  \n [http://www.myfonts.com/person/jenson/nicolas/](http://web.archive.org/web/20080830040258/http:/www.myfonts.com/person/jenson/nicolas/ \"http://www.myfonts.com/person/jenson/nicolas/\")  \n [http://www.myfonts.com/images/library/source/Jenson.jpg](http://web.archive.org/web/20080830040258/http:/www.myfonts.com/images/library/source/Jenson.jpg \"http://www.myfonts.com/images/library/source/Jenson.jpg\")\n\nWith variations used by many printers  \n [http://www.gutenberg.org/files/20393/20393-h/images/13.jpg](http://web.archive.org/web/20080830040258/http:/www.gutenberg.org/files/20393/20393-h/images/13.jpg \"http://www.gutenberg.org/files/20393/20393-h/images/13.jpg\")  \n [http://libweb.uoregon.edu/pix/guides/architecture/oregon/pictures/sculpt...](http://web.archive.org/web/20080830040258/http:/libweb.uoregon.edu/pix/guides/architecture/oregon/pictures/sculpture/colophon5.jpg \"http://libweb.uoregon.edu/pix/guides/architecture/oregon/pictures/sculpture/colophon5.jpg\")\n\nand widely used 100 years ago at the Roycroft  \n(where i believe there may have actually been a trademark dispute with Nabisco)  \n [http://www.chicagosilver.com/marks2\\_files/image059.jpg](http://web.archive.org/web/20080830040258/http:/www.chicagosilver.com/marks2_files/image059.jpg \"http://www.chicagosilver.com/marks2\\_files/image059.jpg\")  \n [http://www.umkc.edu/lib/exhibits/images/3-crop.jpg](http://web.archive.org/web/20080830040258/http:/www.umkc.edu/lib/exhibits/images/3-crop.jpg \"http://www.umkc.edu/lib/exhibits/images/3-crop.jpg\")\n\n"
    },
    {
      "time": " 27.Nov.2007 7.18am",
      "content": "_Ludlow Black is much closer to Copper Black but it is attributed to Robert Middleton not Goudy.(ref: McGrew, American Metal Typefaces)_\n\nOops, you’re right. I gotta stop doing this after several glasses of wine.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 27.Nov.2007 8.46am",
      "content": "_supposedly back to medieval scribes_\n\nThe orb and the cross — a visual pun representing a quill pen in an inkwell?\n\n"
    },
    {
      "time": " 27.Nov.2007 11.15am",
      "content": "FWG is yelling from beyond the veil:\n\n“The old fellows stole all our best ideas!”\n\nOnce a typeface from foundry A took off, suddenly foundry B, C and D wanted one “just like it”. No mystery that Goudy was asked to mimic other popular faces. What I think is interesting is the kind of solution Goudy came up with; it satisfied the brief but clearly shows his individual style. Another face in this category is Kompakt, a very bold roman by H Zapf. It also looks similar on a superficial level, but has all kinds of personal style in it. That’s fascinating.\n\n"
    },
    {
      "time": " 27.Nov.2007 11.46am",
      "content": "We are hard at work on our Beorcana clone as we speak.\n\n"
    },
    {
      "time": " 27.Nov.2007 11.48am",
      "content": "\\*\\*\\*kidding\\*\\*\\*\n\n"
    },
    {
      "time": " 27.Nov.2007 6.20pm",
      "content": "You guys who think Goudy’s is somehow better must be smoking crack! ;-) Oho! that was a bit strong. Just joshin’ ya.\n\nBut seriously think about the context. This isn’t text type. It’s ad type. To me Cooper black is genius. I really don’t like the feeling/style that much but I admire what he has going on very much. To my eye that genius is missing in the Goudy. The sheer integration of the elements in Cooper Black is fantastic. And look at the things he gets away with. The lower case o for instance. But it works!\n\n"
    },
    {
      "time": " 27.Nov.2007 9.31pm",
      "content": "Apparently Goudy was never big on bolds, or sans for that matter.  \nBenton did the bold weights of Goudy Old Style, if I recall correctly.\n\n"
    },
    {
      "time": " 28.Nov.2007 4.04am",
      "content": "_That may be because you see so much of it in use today on current design._\n\nWe don’t see it that much over here but I take your point, it could be just that I’ve been exposed to Cooper Black quite a bit in modern work (lots more 10+ years ago) and there’s an unconscious association.\n\n"
    },
    {
      "time": " 29.Nov.2007 9.19am",
      "content": "He looks like a puzzycat to me :D\n\n ![](http://web.archive.org/web/20080830040258im_/http:/www.typophile.com/files/goudy_4620.jpg)\n\n"
    },
    {
      "time": " 2.Dec.2007 7.25pm",
      "content": "On Orb & Cross, if anyone’s interested, Paul Moxon’s Fameorshame website has a summary of well-known (and not so well-known) orb & cross press marks [online here](http://web.archive.org/web/20080830040258/http:/fameorshame.com/about.htm). At some point I should give PM some more references on printers’ marks since most of the heavy duty research was done before 1930 (some of it grew out of 19th C research on heraldic devices; more extensive work done on French printers).\n\n-Paul\n\n"
    }
  ]
}
