{
  "id": "39393",
  "title": "\"...what we ARE thankful for ...spirit of the season altogether.\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Not to get all mushy or anything, but... I'd like to thank all those that make this 'place' as rich as it is. From the brilliant design and maintenance of Typophile - to the one time poster, it's all good.\n\nFor me, I constantly push/search. I'm looking for the edge - the raw edge - the leading edge. And I think those that put together Typophile knew that it would enable leading minds a place to share - to challenge - to encourage - us/one another.\n\nAnd I thank you all for that...\n\n",
  "author": "Hiroshige",
  "time": "23 Nov 2007 — 11:29pm",
  "uid": "9690",
  "comments": [
    {
      "time": "24 Nov 2007 — 3:41am",
      "content": "In spite of not being Christian, I really must say Amen to that!\n\n"
    },
    {
      "time": "24 Nov 2007 — 7:04am",
      "content": "Nice post.\n\n"
    },
    {
      "time": "24 Nov 2007 — 7:10am",
      "content": "Yes, I hope nobody misconstrues me as complaining. This is a wonderful site and an excellent resource. My only regret is that there's no Hranting around here anymore.\n\n"
    },
    {
      "time": "24 Nov 2007 — 7:29am",
      "content": "I’m always thankful for the civility of discourse on Typophile. It’s like Usenet was back when Usenet was useful for anything but porn and warez.\n\n"
    },
    {
      "time": "24 Nov 2007 — 7:39am",
      "content": "_I’d like to thank all those that make this ’place’ as rich as it is. From the brilliant design and maintenance of Typophile - to the one time poster, it’s all good._\n\nCheers to that, Hiroshige. I think that all too often we take Typophile for granted, so this is a great opportunity to say thanks to everyone who puts in so much time and care, whether it is the kind folks at Punchcut, or the moderators, or the users.\n\n"
    },
    {
      "time": "24 Nov 2007 — 9:51am",
      "content": "Thank you for starting this thread, Hiroshige/Neil. Mushiness does have its place ;) I'm thankful for this wonderful community we have, and that Jared and Joe have taken so much time and effort to build a place for meeting and discussion overseen by a group of thoughtful caretakers. We are very lucky to be here.\n\n"
    },
    {
      "time": "24 Nov 2007 — 10:58am",
      "content": "If I could only go to one place on the internet, this would be the one. I love this place and everyone involved in it. It has made me a better person.\n\nThanks isn't a big enough word.\n\nSharon\n\n"
    },
    {
      "time": "24 Nov 2007 — 11:08am",
      "content": "I'm also very grateful for this community. Thanks guys for having me.\n\n"
    },
    {
      "time": "24 Nov 2007 — 12:14pm",
      "content": "Yeah typophile is great--it has enriched my life. Thanks to all!\n\n\\>In spite of not being Christian, I really must say Amen to that!\n\nFYI: \"Amen\" is a Hebrew word meaning \"it is true,\" or \"so be it\"--exactly as you use it--and was part of Jewish liturgy for many centuries before Christianity came around. The word for faith, \"emunah\" is from the same root, as is the word for truth, \"emet\".\n\n"
    },
    {
      "time": "24 Nov 2007 — 12:53pm",
      "content": "Typophile proves a lot about what it means to be human, to have intelligent, mindful friends we can share our thoughts with, about the value of being candid. Tolerance goes a long way towards keeping affairs here civil. Unlike so many other places on the internet we barely need a code of civil conduct.\n\nIt's just amazing how fair people can be.\n\nj a m e s\n\n"
    },
    {
      "time": "24 Nov 2007 — 1:35pm",
      "content": "\"FYI: “Amen” is a Hebrew word\"\n\nSure.\n\nI'll make that \"In spite of not being Christian or Jewish or of any other faith for which this time of the year has a particular significance\" :)\n\n"
    },
    {
      "time": "24 Nov 2007 — 1:40pm",
      "content": "It's been a real education to eavesdrop on and participate in conversations here over the past few years - unmatchable anywhere else, I believe. Thanks to all who contribute!\n\n"
    },
    {
      "time": "24 Nov 2007 — 1:51pm",
      "content": "I’d like to thank all the typophile widows and orphans out there.\n\n"
    },
    {
      "time": "24 Nov 2007 — 2:12pm",
      "content": "Well said Si! now I am out of sorts because you posted the best pun, again! :-)\n\nThank you Punchcut gang and all volunteers in San Fran and abroad in places like Belgium and Reading UK!\n\nChrisL\n\n"
    },
    {
      "time": "25 Nov 2007 — 4:45pm",
      "content": "I'm thankful for this site too - I've learned a ton about type from the wizards here and it's a great place to go when I need a break from work.\n\nAnd thankful to Punchcut for the sometimes thankless task of providing it.\n\n"
    },
    {
      "time": "25 Nov 2007 — 11:38pm",
      "content": "Hear, hear!\n\nI have been interested in typography for quite some time now, but this place has taken it to a totally new level. I've learned a lot from people here, and enjoyed every moment. The only problem is the amount of time I sometimes end up spending here instead of working or sleeping. On the other hand, time spent doing what you like is not wasted.\n\nThank you.\n\n"
    },
    {
      "time": "26 Nov 2007 — 1:24pm",
      "content": "Thank you, Punchcut; thank you, moderators; thank you, community members: for a true love of talking about type. If it weren't for Typophile, I doubt I would have gotten far beyond visiting Dafont every once in a while.\n\n"
    },
    {
      "time": "26 Nov 2007 — 1:47pm",
      "content": "I, too, am so grateful to this entire community for everything—the discussions, the critiques, the wealth of knowledge; you've all taken my love and awareness of type to a new level. Thanks to everyone for making it what it is, and especially thanks to Punchcut!\n\n"
    },
    {
      "time": "26 Nov 2007 — 2:26pm",
      "content": "Definitely my favourite place on the web.  \nLots of provocative ideas to bat around, and the technical assistance I get from Thomas, John, Miguel, Adam etc. is absolutely priceless, as well as the insight into what makes hardcore \"users\" like Patty, Tiffany and Charles tick.\n\nHaving said that, I detest Christmas, even, perhaps especially, in November.\n\n"
    },
    {
      "time": "26 Nov 2007 — 2:39pm",
      "content": "\\>Having said that, I detest Christmas, even, perhaps especially, in November.\n\nI believe the timing relates to the United States custom of “Thanksgiving”, which takes place at the end of November.\n\n"
    },
    {
      "time": "26 Nov 2007 — 2:40pm",
      "content": "_The Grinch hated Christmas!  \nThe whole Christmas season!  \nNow, please don't ask why. No one quite knows the reason.  \nIt could be that his head wasn't screwed on quite right.  \nIt could be, perhaps, that his shoes were too tight.  \nBut I think that the most likely reason of all  \nMay have been that his heart was two sizes too small._\n\n;-)\n\n"
    },
    {
      "time": "26 Nov 2007 — 2:53pm",
      "content": "From last year... [http://typophile.com/node/30113](http://web.archive.org/web/20140803041745/http:/typophile.com/node/30113 \"http://typophile.com/node/30113\")\n\n\"THE NIGHT BEFORE CHRISTMAS AT MONOTYPE\n\n’Twas the night before Christmas, when all through the house  \nNot a creature was hinting, not even with a mouse;  \nThe proofs were stacked in the office with care,  \nIn hopes that Robin Nicholas soon would be there…\n\nI could go on ;-) but gave up. Merry Christmas!\"\n\n"
    },
    {
      "time": "26 Nov 2007 — 3:02pm",
      "content": "And once more with feeling...\n\n\"I'm dreaming of a Typophile Christmas  \nJust like the ones I used to know  \nWhere Hrant’s not missin’  \nAnd the lurkers listen  \nIn general discussions “anything goes”\n\nI'm dreaming of a Typophile Christmas  \nWith every wiki entry that I write  \nMay your postings be merry and bright  \nAnd may all your font ID’s be right\"\n\n"
    },
    {
      "time": "26 Nov 2007 — 3:04pm",
      "content": "_No one quite knows the reason._\n\nI guess what ticks me off most is the orgy of consumerism.  \nRecently, I've added profligate energy waste (Xmas lights) to my list of seasonal bugbears.\n\n"
    },
    {
      "time": "26 Nov 2007 — 3:37pm",
      "content": "Thank you to everyone involved in Typophile.\n\nIt is a great privilage to learn from others sharing their expertise and experience.\n\nI am a sucker for Christmas, especially the lights. I had never considered their environmental impact - but you are right :(\n\n"
    },
    {
      "time": "26 Nov 2007 — 4:47pm",
      "content": "<cite>Recently, I’ve added profligate energy waste (Xmas lights) to my list of seasonal bugbears.</cite>\n\nI'd like to see them replaced with LEDs which use far far less energy. The lights are about the only thing I can bear about the holiday season, I do love decoration.\n\n"
    },
    {
      "time": "26 Nov 2007 — 5:31pm",
      "content": "I'll also take this opportunity to thank typophile and its users for the knowledge about type they provided me with. And of course the nice community as well. I've been on a couple of other communities, but never really taken part actively, or at least not like on here. Not that I really know anyone here (or vice versa), but I've been here for a while now and I enjoy participating in the discussions. And getting to know new people is always good. :)\n\n"
    },
    {
      "time": "26 Nov 2007 — 9:14pm",
      "content": "Typophile is where I come to hear crickets chirping. Thanks punchcut. Thanks Tiffany, Dan, Paul and Stephen. Thanks to all those font-making professionals who share their knowledge and wisdom.\n\nJelmar you've got many friends here :^)\n\nLight Emitting Diode christmas lights are just coming in now:\n\n[http://www.google.com.au/search?hl=en&q=christmas+lights+%2Bled&btnG=Goo...](http://web.archive.org/web/20140803041745/http:/www.google.com.au/search?hl=en&q=christmas+lights+%2Bled&btnG=Google+Search&meta= \"http://www.google.com.au/search?hl=en&q=christmas+lights+%2Bled&btnG=Google+Search&meta=\")  \n [http://www.christmaslightsetc.com/led-christmas-lights.htm](http://web.archive.org/web/20140803041745/http:/www.christmaslightsetc.com/led-christmas-lights.htm \"http://www.christmaslightsetc.com/led-christmas-lights.htm\")\n\nJimmy Cat love! Jimmy Cat get!\n\nj i m m y &nbsp; c a t\n\n"
    },
    {
      "time": "26 Nov 2007 — 11:24pm",
      "content": "The overwhelming thing we have felt for a long time is that Typophile's strength is you -- your sharing, your ideas, your humor, even your curmudgeonly reproof. This thread is a reminder of the essence of this place -- you all sharing professionally and socially and otherwise.\n\nAs for us, we're grateful to provide the medium. This thread really means a lot. Thank you all.\n\n"
    },
    {
      "time": "27 Nov 2007 — 2:22am",
      "content": "_Thanks Tiffany, Dan, Paul and Stephen._\n\nand don't forget Yves & Eben! thnx from me to all the guys & gals at punchcut who keep this thing ticking. And to all of you who contribute for expanding my mind.\n\n"
    },
    {
      "time": "27 Nov 2007 — 4:48am",
      "content": "I knew I forgot two! Yves, I know you're there on the ID board but I rarely visit (I read your column at typographer.org), but thanks so much for the great service you provide to type users. Seasons greeting Eben :^) I didn't know we had six mods. The typophile Sera Senshi Sentai Six (pretty sailor-soldier guardian magical girl team ;^)\n\n ![](http://web.archive.org/web/20140803041745im_/http:/typophile.com/files/temple318_4765.jpg)\n\nj a m e s\n\n"
    },
    {
      "time": "27 Nov 2007 — 7:52pm",
      "content": "Thanks! And best wishes to you all as well. I would offer my own pile of heartfelt sweet mushiness for all the help, insight and technical know how that has been made available to us all - but you all have been eloquent already!\n\n<cite> replaced with LEDs </cite>\n\nTotally. I am working on a scheme to replace some indoor bulbs this way too. It's tricker than I would like but it obviously needs doing.\n\n"
    },
    {
      "time": "29 Nov 2007 — 8:28am",
      "content": "Well somebody is reading our minds - I just read that the Rockefeller tree is decorated with energy-saving bulbs this year. Now if they could just figure out a way to NOT kill the tree...\n\n"
    },
    {
      "time": "29 Nov 2007 — 9:14am",
      "content": "Plant the tree on the spot permanently. ;)\n\n"
    },
    {
      "time": "29 Nov 2007 — 10:21am",
      "content": "It goes with out saying that I heart Typophile. I'm lucky to be a part of such a great community. Thank you, Typophile!\n\n"
    }
  ]
}
