{
  "id": "39416",
  "title": "Eras outlines",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi, hope this is the right forum for this kind of question.\n\nCan anyone tell me, is there a version of Eras for the Mac that coverts to outlines correctly, i.e. with the correct slant and thick/thin?\n\nWith the version I have, ITC Eras is how it shows in the font list (from Adobe?), it prints correctly but when converted in Illustrator the paths are like a cheap knockoff - right basic letter forms but upright and worst of all uniform in weight, which is of course not what Eras is all about.\n\nI've always wondered if there's a technical reason this font can't be made to outline properly although it seems like it should be possible given the characteristics of fonts that do convert OK.\n\n",
  "author": "Gräfenberg",
  "time": "25 Nov 2007 — 10:51am",
  "uid": "24341",
  "comments": [
    {
      "time": "2 Dec 2007 — 9:16am",
      "content": "Anyone? Bueller? Bueller? :-)\n\n"
    },
    {
      "time": "2 Dec 2007 — 9:33am",
      "content": "It's very likely that nobody else has encountered your problem, and it may not be the fault of the font. Maybe you should post an image of the results so people can get a better idea of what you're talking about.\n\n"
    },
    {
      "time": "2 Dec 2007 — 11:37am",
      "content": "Perhaps this is at the root of your problem:  \n [http://blogs.adobe.com/typblography/2007/07/old\\_optima\\_and.html](http://web.archive.org/web/20131018234823/http:/blogs.adobe.com/typblography/2007/07/old_optima_and.html \"http://blogs.adobe.com/typblography/2007/07/old\\_optima\\_and.html\")\n\n"
    },
    {
      "time": "5 Dec 2007 — 5:28am",
      "content": "Thanks John, that looks like it might be it!\n\n"
    },
    {
      "time": "6 Dec 2007 — 8:38pm",
      "content": "Yes, that would be it. You have the \"old\" version of Eras from the early 90s, and when converting to outlines you are getting the \"low-res\" set of outlines.\n\nTime to update the font!\n\nT\n\n"
    },
    {
      "time": "7 Dec 2007 — 7:30am",
      "content": "_Time to update the font!_  \nLong past time :-D\n\n"
    }
  ]
}
