{
  "id": "39421",
  "title": "logotype",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "hey this is a logo for a low end pre-teen cosmetics company. any constructive advice?\n\n| Attachment | Size |\n| --- | --- |\n| [lippulpoix.pdf](http://web.archive.org/web/20071202140137/http:/typophile.com/files/lippulpoix_0.pdf) | 224.79 KB |\n\n [‹ Take your pick](http://web.archive.org/web/20071202140137/http:/www.typophile.com/node/39379 \"Go to previous forum topic\") [choose your favourite logo! ›](http://web.archive.org/web/20071202140137/http:/www.typophile.com/node/39311 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071202140137/http://www.typophile.com/user/24290\" title=\"View user profile.\">pauljames</a>",
  "time": "<br>",
  "uid": "24290",
  "comments": [
    {
      "time": " 25.Nov.2007 1.45pm",
      "content": "Constructive advice: please remove this post from Typophile.\n\n"
    },
    {
      "time": " 25.Nov.2007 1.52pm",
      "content": "Ummmmmm...... I guess to BjornH this is not good enough, bown down to the mighty BjornH.\n\nI think he is the ultimate say when it come to all things design, last I checked.\n\nThe counter spaces in the “p” characters need to be smaller. The space between the counters and the bowls is too thin and causes a “tangent”: unnecessary visual and optical space.\n\nAlso, why is there a counter space in the lower case “i”. I would remove that.\n\n"
    },
    {
      "time": " 25.Nov.2007 2.00pm",
      "content": "Cosmetics to pre-teens for crying out loud! I did not even look at the logo.\n\n"
    },
    {
      "time": " 25.Nov.2007 2.07pm",
      "content": "Ok?\n\nI am not quite sure what you mean, but Ok.\n\n"
    },
    {
      "time": " 25.Nov.2007 2.43pm",
      "content": "Absolutely smack on the target. Don’t change anything, just add some sickeningly sweet colours.\n\n(Jeez, what’s up with these design and type snobs — don’t they recognize good work anymore? Get a life!)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 25.Nov.2007 2.52pm",
      "content": "What he means is that pre-teen cosmetics line is ethically very questionable. I agree with that. Chemistry and young children don’t go together. I don’t want my girlfriend to use too much cosmetics anyway. Not to even think about kids. I’m exaggerating but it’s like selling drugs to kids. It messes with their own perception of themselves and their society.\n\nIf a cosmetic line for pre-teen population really has to exist there must be something SERIOUSLY wrong with their parents, education, culture and society. Not to even mention the government.\n\nI did check the logo but I’m going to use a veto on the comment.\n\n"
    },
    {
      "time": " 25.Nov.2007 3.00pm",
      "content": "Oh lord, it isn’t cigarette advertising.\n\nI like the logo, but it could use some refinement. I find it quite nice how the circles get bigger with each. This creates a nice sense of depth. Keep this, and try to polish up the whole.\n\n"
    },
    {
      "time": " 25.Nov.2007 3.33pm",
      "content": "\\*rolls eyes\\* It’s not as if pauljames asked anyone about whether they thought marketing cosmetics to pre-teens was ethical or not. He wants feedback on his logo design.  \nI agree with bert\\_vanderveen I’d like to see color.\n\n"
    },
    {
      "time": " 26.Nov.2007 7.49am",
      "content": "Seems fine. It will need to be set in pink glitter glue, of course. ;o)\n\nAnd yes, color is a requirement for this one. You could also probably get a way with adding some flourishes. I assume this will be sold in those pre-teen mall stores that have more gaudy logos per square inch than anywhere on earth, so you might have to ’tart it up’ a bit more to compete.\n\n"
    }
  ]
}
