{
  "id": "39427",
  "title": "Personal business card critique please",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Okay... I'm finally ready for some feedback on my personal stationery to go with the mark I created a few weeks ago. This is what I am somewhat happy with so far for the business card, and I have not yet started the rest of the stationery. I'd like critique on everything—composition, type treatments, etc. Please note that I've not yet done anything with kerning; I'm going to wait to do that when I have everything else nailed down. I look forward to the feedback!\n\nThanks!!\n\n| Attachment | Size |\n| --- | --- |\n| [CassieStationery3-1.pdf](http://web.archive.org/web/20131017083830/http:/typophile.com/files/CassieStationery3-1.pdf) | 577.92 KB |\n| [CassieStationery4.pdf](http://web.archive.org/web/20131017083830/http:/typophile.com/files/CassieStationery4.pdf) | 980.33 KB |\n\n",
  "author": "Cassie",
  "time": "25 Nov 2007 — 4:46pm",
  "uid": "20665",
  "comments": [
    {
      "time": "25 Nov 2007 — 4:48pm",
      "content": "PS This will be letterpress ... yummy.\n\n"
    },
    {
      "time": "25 Nov 2007 — 7:44pm",
      "content": "Hi Cassie\n\nI will give you my thoughts (please note: newbie feedback!)\n\nMy initial reaction to you designs are I love the simplicity, they convey a sense of substance and sophistication.\n\nI would set your first and second name in the same style, capitalise both and not have them running together. I think this would suit the conservative and refined style of your design better.\n\nI like option 3 (front & back) the most. I think the mark in this option anchors the text rather than competing with it.\n\nOverall I think your stationary is looking beautiful.\n\nZennie\n\n"
    },
    {
      "time": "25 Nov 2007 — 8:45pm",
      "content": "Hi Cassie,\n\nI like #2 the most —&nbsp;the composition is interesting, yet not too crazy for the classy style you're going for. What doesn't work for me is your name treatment; I don't think lowercasing it and closing it fits well with the back of the card, where everything is simply typed out. I'd say either more variation on the back, or (better yet) the front is also typed out quite simply. It's your name; it should be very clear and clean. Ethos is an important aspect — you can have your name treatment project authority and simplicity.\n\nI'm not sold on the typeface either. Is it Mrs. Eaves? It's nice, but it's a bit overused. Not bad, I just wonder if it can be better. Something slightly updated, but still serif. And then I wonder if, in addition to the old-style figures, you can have another special treatment here & there. I would love the text to feel really crafted, fitting your beautiful traditional esthetic.\n\nAlso your mark at first seems a bit arbitrary, like any old pretty thing — but then I see C's in it! It's a great discovery. Did you intend that? It's beautiful. Anyway, my 2 bits.\n\n"
    },
    {
      "time": "26 Nov 2007 — 1:13am",
      "content": "Hi cassie.\n\nI'd go with #1 on the front but I'd change the back to match the front. What I'd like you to consider for the back to match the front is to introduce some font play in it. You use three different fonts on the front, but only one on the back.\n\nAnd why #1? Because the symbol is still a symbol and not a background pattern/item. #2 emphasizes it the most. Maybe a bit too much because it becomes overwhelming and makes people recognise the symbol but can't relate it to any trademark.\n\nAnd I guess that word \"graphic\" isn't necessary. Design is enough.  \n\"cassie forrington design\" is a trademark name. When \"graphic\" word is used, then \"cassie forrington\" become a trademark name with an explanation of \"graphic design\".\n\nOf course it depends what you want to achieve here.\n\n"
    },
    {
      "time": "26 Nov 2007 — 7:43am",
      "content": "Are these going to to be handset or lettepressed via a plate? if the latter, why not go ahead and use a few of these options on one plate. Might be fun.\n\nPersonally, I like 3 - 6\n\n2 is interesting, but with the added tactility of the letterpress process, I think you might have a bit too much going on with the stroke.\n\n1 has a nice layout, but I'm not a fan of the smashed-together-type.\n\nWith #6, i like the sans typeface on the back, but I think mixing it with the condensed serif numerals is a bit off.\n\n"
    },
    {
      "time": "26 Nov 2007 — 7:44am",
      "content": "Oh...and if you do get plates made, consider setting your company name, your address block, and your mark as separate blocks that can be rearranged by the printer to create multiple pieces (letterhead, cards, envelopes, etc.) Might save you a few dollars and give you a bit more versatility.\n\n"
    },
    {
      "time": "26 Nov 2007 — 10:34am",
      "content": "Thanks for all the input! Looks like I have some decisions to make...\n\n_I think this would suit the conservative and refined style of your design better._\n\nI'm not sure that I want to be 100% conservative. I'd like to find a way to mix a contemporary type treatment with a more simple, traditional composition, but I guess I haven't gotten there yet. I definitely haven't spent enough time on the type on the back (in any version)...\n\n_Is it Mrs. Eaves?_\n\nYes, it is. I chose it because my mark is constructed out of MrsEaves italic c's and f's, so I feel it best complements the mark. I'm also using Johnston for the sans. I used the treatment that I did on my name mostly because of the italic f, to reference the mark. Not necessary?\n\n_I would love the text to feel really crafted..._\n\n:) Yes! That is exactly what I need, and want. As soon as I know which one I'm going with, that will definitely be my next step.\n\n_Are these going to to be handset or lettepressed via a plate?_\n\nProbably with a plate. That's an interesting idea... making a sort of series with a few different layouts. I've seen business card series before, but I'm worried about having too many different compositions, just for the sake of consistency. But it's definitely something to think about. Thanks for the idea about setting each as a separate block, I didn't even realize that was an option!\n\n_2 is interesting, but with the added tactility of the letterpress process, I think you might have a bit too much going on with the stroke._\n\nI was hoping the stroke would help accentuate the tactility. It's offset slightly from the mark on purpose, and I know it may be even more slightly off with the registration of the letterpress, which I like. I feel the layers add a nice depth, although I am worried that it detracts from the mark too much to be worth it.\n\nSo it seems like the general suggestion is to set my name more traditionally? Or should I keep trying to make the contemporary+traditional thing work?\n\nLooking forward to more feedback!\n\n"
    },
    {
      "time": "26 Nov 2007 — 12:38pm",
      "content": "It seems there hasn't been any fine kerning done at all. The letters in \"forrington\" look particularly disturbed.\n\n"
    },
    {
      "time": "26 Nov 2007 — 12:59pm",
      "content": "_It seems there hasn’t been any fine kerning done at all. The letters in “forrington” look particularly disturbed._\n\nNo, as mentioned in my first post, I haven't done anything with kerning yet. \"forrington\" does look especially strange in the PDF, though, unless you zoom in really close...\n\n"
    },
    {
      "time": "26 Nov 2007 — 1:37pm",
      "content": "I found your name to be too difficult to read in the first card. Overall, your design is very nice.\n\nSharon\n\n"
    },
    {
      "time": "26 Nov 2007 — 7:37pm",
      "content": "I like many of these. I agree with the previous commenter that said to drop \"graphic\" and just use \"cassie forrington design\", with spaces in between. I'd try not to get too cutesy with the typeface changes; it starts to become a bit whimsical.\n\nI'd love to see some use of pattern with the mark (although still have a clear mark on one side).\n\n"
    },
    {
      "time": "27 Nov 2007 — 10:45am",
      "content": "Okay, I've posted a new PDF, following the suggestions. There are 3 versions of the front (all very similar) and 6 of the back. I've done some really quick kerning, but haven't gone through it with a fine-tooth comb yet, but I would still love feedback on everything at this point.\n\n_I’d love to see some use of pattern with the mark_\n\nWonderful suggestion, I had completely forgotten about that! I tried several patterns, but nothing was really working... There is one pattern in the new PDF but I'm not really happy with it. What do you think about a pattern running behind the text? The other thing I haven't tried is incorporating lines or dots or anything into the pattern, which might help. Right now it's just a symmetrical shape, and that doesn't make very interesting patterns in one color.\n\nThanks again! I'm getting closer...\n\nedit: please ignore the typo on #3 on the back! oops!\n\n"
    },
    {
      "time": "27 Nov 2007 — 2:00pm",
      "content": "I miss the multi-line setting of your name in the first revisions.\n\nOf these, I like all the fronts, though #1 stands out for me. In all cases, I think 'design' is a tad too close to your name. Nudge it out a bit further.\n\nOf the backs, I really like 5 in how it frames it in.\n\n"
    },
    {
      "time": "28 Nov 2007 — 12:32am",
      "content": "I know, I liked the two lines, too, but I think the simplicity of this is better, plus I agree with the above comments that I need to present my name with more confidence (which I think these versions have, now). I think I've decided to go with #1 on the front and #1 of the back, but with the framing of #6. I'll post the kerned version tomorrow so hopefully I can get some help tweaking it to perfection (or as close to it as possible)! I've also been working on letterhead and envelope.\n\nThanks all!\n\nPS Does anyone have any letterpress tips? I've been doing some research but any info is helpful... recommendations for printers? paper (for business card, letterhead and envelope)?\n\n"
    },
    {
      "time": "28 Nov 2007 — 10:05am",
      "content": "I like working with local printers, so you can see the proofs without too much of a hassle. Look up some letterpresses in your area, and then work with them to find papers you like. You don't need anything dazzling. I'd say fairly smooth, but not glossy, and bright white. It would be nice if you can pay for 160 lb cover stock. That way it's a really hefty card {ethos! : ) } and you won't get impressions from the opposite side of the card. It's pretty expensive, though, so if you choose against it, your printer will be able to recommend something else for you. Prices also depend on what he may have in stock, so it's best to work that out with him (sorry, and/or her). : )\n\n"
    },
    {
      "time": "28 Nov 2007 — 4:21pm",
      "content": "Check out [Briar Press](http://web.archive.org/web/20131017083830/http:/www.briarpress.com/) online. They should be able to help you find a local press.\n\n"
    }
  ]
}
