{
  "id": "39428",
  "title": "How do I make wobbly underscore in InDesign?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've got something that has to be set in InDesign CS in a \"typewriter\" font to mimic typing in the old days, which includes using the underscore to indicate italics (old timers like me remember actually doing that, on a real typewriter).\n\nIt happens the typewriter font I'm using, suitably battered, has a matching underscore (suitably battered, that is). Those who remember manual typewriters will recall how the underscore key was never quite aligned, so that the resulting underline was kind of wobbly, or saw-toothed. I need that effect.\n\nProblem is, I can't figure out how to place the underscore under the letters (there's a lot of passages). On the typewriter is was easy: you just ran the carriage back and typed the underscore--rat-tat-tat-tat-tat. How do you do this in InDesign? There must be a simple way that somehow eludes me. Using the underline feature is no good, as it doesn't access the underscore character, even through the stroke options palette (even a suitable custom stroke would seem to be impossible to create, at least in CS1).\n\nOne solution, failing keyboard manipulatoin, would be to open the font up in Fontlab, add an understroke to each character, and save the result as the \"italic\" font to be used where needed (EULA permitting, of course). Funny that \"typewriter\" fonts don't come with one of these ready-made (let me know if you know of one that does).\n\n",
  "author": "Gary Long",
  "time": "25 Nov 2007 — 7:13pm",
  "uid": "19337",
  "comments": [
    {
      "time": "25 Nov 2007 — 7:35pm",
      "content": "I can’t answer your questions, but I applaud your efforts on behalf of authenticity.\n\n"
    },
    {
      "time": "26 Nov 2007 — 2:21am",
      "content": "Not that it'd be a whole lot easier but could produce more random results (what you want) than just making a font:\n\nSince it's a typewriter font you should be able to reasonably assume the location of any character on a page if you were, say, given a bounding box, the text that contains it, and its index in the text. Then you could place the underscore characters in individual text boxes and then jostle them about.\n\nIf InDesign scripting is as capable as Illustrator's then it should be pretty possible to just set a style that changes the color of the underlined text to red, and then before printing you could run the script, which would identify the red text and understand to place the underscores.\n\nBut all this depends on a few things: that the font is perfectly fixed-width and that InDesign's scripting is as capable as I would hope to think it is. But writing the script would only really be feasible if there are a high number of pages each needing the underline.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "26 Nov 2007 — 8:00am",
      "content": "Thanks Matthew for the ideas. Unfortunately scripting isn't my forte, so I think it will be quicker for me to make an underline font in FontLab. I don't need all the characters--just plain a-z, A-Z, numbers and some punctuation.\n\nJames: It's pretty much impossible I've found to authentically replicate the look of an old typewriter with an underinked ribbon in digital type. A lot of the distressed typewriter fonts look like a photocopy of a typewritten page when printed. Usually I just need a couple of lines, in which case I just bash it out on my real typewriter, scan it, and place it as a half-tone image.\n\n"
    },
    {
      "time": "26 Nov 2007 — 8:02am",
      "content": "I'd make a separate text box that has a bunch of underscore characters that match up with your underscored text (don't forget to fiddle with minor baseline shifts and some even more minor character width and height adjustments to give it an authentic look), and then just overlay it on your original text. Clumsy, but it should work.\n\n"
    },
    {
      "time": "26 Nov 2007 — 8:11am",
      "content": "You didn't say how long is the copy and how much time you have, I think I'd paste-in-palce the empty text box in a new layer and use the space and the underscore.  \nIt's a good idea your underscored \"italic\" for that.\n\n"
    }
  ]
}
