{
  "id": "39432",
  "title": "Caslon Sans Serif, available somewhere?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Fellow Typophiles,\n\nI read somewhere that a student, Miko McGinty, revived the Caslon Sans Serif of William Caslon IV, dated 1816, in a 1997 class supervised by Tobas Frere-Jones. Does anyone know more about this? Is this digitized Caslon Sans available somewhere?\n\nthanks  \ndr\n\n",
  "author": "David Rault",
  "time": "26 Nov 2007 — 1:50am",
  "uid": "19074",
  "comments": [
    {
      "time": "26 Nov 2007 — 5:25am",
      "content": "As me, you probably read the same note on the Christian Schwartz website: “Please note that, except where indicated, these typefaces are not available for licensing.” That note seems to be for the Caslon's Egyptian designed by Miko McGinty and Cyrus Highsmith.\n\n[http://www.orangeitalic.com/caslon.shtml](http://web.archive.org/web/20150214011315/http:/www.orangeitalic.com/caslon.shtml \"http://www.orangeitalic.com/caslon.shtml\")\n\n"
    },
    {
      "time": "26 Nov 2007 — 6:15am",
      "content": "Too bad.\n\nA nice and talented typographer should revive it again and sell it.\n\ndr\n\n"
    },
    {
      "time": "26 Nov 2007 — 6:27am",
      "content": "It’s on my list of things to do post-graduation, along with metal Franklin Gothic and a ligature face from the necropolis at Arles. That and paying off my student loans.\n\n"
    },
    {
      "time": "26 Nov 2007 — 6:33am",
      "content": "well, i have others to add on the list if you feel like superman: jacno, oswald cooper handwriting... gosh i wish i was a typographer.\n\nim going to get a copy of fontlab.\n\ndr\n\n"
    },
    {
      "time": "26 Nov 2007 — 7:07am",
      "content": "<cite>im going to get a copy of fontlab.</cite>\n\nBest money I ever spent.\n\n"
    },
    {
      "time": "26 Nov 2007 — 7:50am",
      "content": "You might also be interested in Nick Shinn's [Figgins](http://web.archive.org/web/20150214011315/http:/www.shinntype.com/figgins.html) based on another very early sans serif.\n\n"
    },
    {
      "time": "26 Nov 2007 — 9:23am",
      "content": "David, get in touch with Font Bureau. The magazine that Caslon's Egyptian was designed for (Red Herring) is no longer a print publication, so it may be that any exclusivity agreements have expired.\n\nAnother alternate: Rian Hughes' English Grotesque, which shares a similar vibe, even if it differs significantly in the details.  \n [http://www.fontshop.com/fonts/downloads/device\\_fonts/english\\_grotesque/](http://web.archive.org/web/20150214011315/http:/www.fontshop.com/fonts/downloads/device_fonts/english_grotesque/ \"http://www.fontshop.com/fonts/downloads/device\\_fonts/english\\_grotesque/\")\n\n"
    },
    {
      "time": "27 Nov 2007 — 12:17am",
      "content": "James: I agree :-)\n\nStephen: Thanks, this is an interesting revival indeed, even if not quite the same with Caslon IV's.\n\nMarcox: I'll try to get in touch with Font Bureau. I know Ryan Hughes' font, but it is for me much closer to Gill Sans than Caslon's sans...\n\ndavidr\n\n"
    },
    {
      "time": "27 Nov 2007 — 2:34am",
      "content": "David, I know of several versions. First there’s James Mosley’s own Tivoli type, which is a an autotraced version from scans turned into a Type 1 font. I think it works very well for single words, it was used in the Italian book <cite>Radici della Scrittura Moderna</cite> which is a collection of translation of James’ own essays on typography, including <cite>The Nymph and the Grot</cite> ( [recently updated](http://web.archive.org/web/20150214011315/http:/typefoundry.blogspot.com/2007/01/nymph-and-grot-update.html)) where he introduced the history of sanserif types.\n\nAfter seeing Mosley’s Tivoli I decided to have a go myself and produced my own version, called Micerino (Italian name of the smallest – as in “small character set, uppercase only” – pyramid in the Giza complex). It’s quite rough around the edges as to spacing and kerning. Some glyphs need review, too, but it’s almost usable. I included the alternate forms found in the two specimens I was given by James and Œ Æ ligatures as OpenType features/stylistic sets.\n\nThe Font Bureau version is definitely the way to go if you want something more usable. It has several weights and a lowercase, although it’s more loosely based on the original from what I’ve seen. I think it’s a reasonable type, especially considering it was done for a contemporary magazine so it’s natural that some of the features in the original type had to be somewhat muted.\n\n[Paul Barnes’ home page](http://web.archive.org/web/20150214011315/http:/www.moderntypography.com/) used to feature a specimen of what looked like his own digitization on Caslon’s Two Lines English Egyptian. I know nothing about it, apart from what I saw online, so I’m not sure about it, but you could try asking. [Martin Tiefenthaler](http://web.archive.org/web/20150214011315/http:/www.idiidiiidesign.at/) from Vienna recently wrote me about it, and I think he’s enquiring Paul as well as per my suggestion.\n\n"
    },
    {
      "time": "27 Nov 2007 — 3:11am",
      "content": "Antonio:\n\nMany thanks for all these informations, though i can't seem to be able to find any of these types on Internet, not even Micerino on your website... Thanks for the info, anyway.\n\ndr\n\n"
    },
    {
      "time": "27 Nov 2007 — 3:27am",
      "content": "[Here’s an initial specimen of Micerino](http://web.archive.org/web/20150214011315/http:/cavedoni.com/2007/11/introducing-micerino.pdf). It isn’t linked from my home page as I usually avoid publishing in-progress typeface specimens. You’ll see it’s not done yet but I’ll be glad to work on it more if you need it for any project, depending on your schedule.\n\n"
    },
    {
      "time": "27 Nov 2007 — 3:52am",
      "content": "Antonio:\n\nYour job is brilliant, congratulations. For now this pdf is enough for me, but be sure I will keep you informed.\n\nPlease let me know when you finalize it.\n\ndr\n\n"
    },
    {
      "time": "20 Mar 2010 — 7:38pm",
      "content": "\" I realize that I completely misunderstood the sources I worked from, and I now consider the lowercase an interesting failure. \"\n\nfrom Christian Schwartz, what does that exactly mean and how should he have designed it for a more accurate revival?\n\n"
    },
    {
      "time": "20 Mar 2010 — 10:08pm",
      "content": "As the only English sans serif lower case letters that were around during the first half of the 19th century were Bold Condensed, an \"accurate revival\" of a Regular style from that era is impossible.\n\nThere are other considerations today. For instance, in the Figgins lower case I contemplated giving the top of the \"f\" a substantial overhang, which I thought would be appropriate for that era, but decided against that in a 21st century international face, where the \"f\" is followed by all sorts of accented characters.\n\nNote that the early 19th century \"G\" is problematic, and very few new faces in the style of that era follow the model authentically.\n\n"
    },
    {
      "time": "21 Mar 2010 — 3:20am",
      "content": "thanks for your response nick, i've also just read some of the other threads regarding the caslon two lines english egyptian\n\n"
    },
    {
      "time": "6 Mar 2013 — 7:17am",
      "content": "David:\n\nI created my own version of Caslon Two Line Egyptian for a book I published with Coach House Books in 1997 entitled \"Head Paintings\". I added lowercase letters, numbers and punctuation. The book is now out of print but copies can occasionally be found at [www.abebooks.com](http://web.archive.org/web/20150214011315/http:/www.abebooks.com/ \"www.abebooks.com\"). You can see the full font at my website: [www.robertfones.com](http://web.archive.org/web/20150214011315/http:/www.robertfones.com/ \"www.robertfones.com\"). I have to confess that I found the combination of uppercase and lowercase very awkward and have never used the font since. No wonder Caslon only issued it originally in caps. I have also seen a version used in the New York Times magazine.\n\n"
    },
    {
      "time": "6 Mar 2013 — 4:24pm",
      "content": "What are the differences between Caslon Two Line Egyptian and the Caslon's Egyptian by Miko McGinty, Cyrus Highsmith, and Christian Schwartz that's available for licensing at [Font Bureau](http://web.archive.org/web/20150214011315/http:/www.fontbureau.com/fonts/CaslonsEgyptian/)? - Herb\n\n"
    }
  ]
}
