{
  "id": "39467",
  "title": "good, bad, average... indifferent.?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is there a typeface you think is good (or at least, not bad), but that you would not use because of some association with something that has nothing to do with it’s graphic qualities? And I don’t meant simply because you think it is over used or dated... Maybe it was designed by your X’s mother in law, or a wing-nut in an aluminum foil hat and you don’t condone that sort of thing... What ever. It has nothing to do with the typeface itself.\n\nI’ve found the recent spate of threads about bashing typefaces a little puzzling and difficult to take seriously. If you don’t like a typeface don’t use it. It’s just a typeface. (And it was probably designed by a regular here... )  \nDavid’s comments about Futura interesting, and I agree, but I would have described it differently.\n\n [‹ \"...what we ARE thankful for ...spirit of the season altogether.\"](http://web.archive.org/web/20071231134055/http:/typophile.com/node/39393 \"Go to previous forum topic\") [What typeface do you wish to be designed, digitized, revived? ›](http://web.archive.org/web/20071231134055/http:/typophile.com/node/39480 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071231134055/http://typophile.com/user/13076\" title=\"View user profile.\">russellm</a>",
  "time": "<br>",
  "uid": "13076",
  "comments": [
    {
      "time": " 26.Nov.2007 9.35pm",
      "content": "It has been done, Russell McGorman, “the architect creates planes and grids that facilitate the dynamic behavior of people. Having designed, the architect relinquishes control. Over time, the people who use the building bring out and add to the meaning of the architect’s design.”\n\n"
    },
    {
      "time": " 26.Nov.2007 9.53pm",
      "content": "The Nazis about killed blackletter for me.\n\n"
    },
    {
      "time": " 26.Nov.2007 10.47pm",
      "content": "I don’t think you really know a typeface until you take it for a spin.  \nAs a type designer, I feel the same way about type genres.\n\n"
    },
    {
      "time": " 26.Nov.2007 11.54pm",
      "content": "I agree with Pattyfab. The nazis, Motley Crue, Marylin Manson contributed to give a really bad reputation to a truely beautiful letter.\n\ndr\n\n"
    },
    {
      "time": " 27.Nov.2007 2.32am",
      "content": "“I don’t think you really know a typeface until you take it for a spin.”\n\ni think types are versatile/independent graphics... i can’t remember a typeface doomed to be forever associated with particular events or people, and i think this is how it should be. I cannot embed my feelings in to it, we should instead “exercise” it, free them from that (this for a non private design of course).\n\n"
    },
    {
      "time": " 27.Nov.2007 4.39am",
      "content": "_I agree with Pattyfab. ...Motley Crue... contributed to give a really bad reputation to a truely beautiful letter._\n\nAnd to make things worse, they ruined umlauts for me!\n\n"
    },
    {
      "time": " 27.Nov.2007 7.41am",
      "content": "“The nazis, Motley Crue, Marylin Manson contributed to give a really bad reputation to a truely beautiful letter.”\n\nNazis were evil, but fairly adept at graphic design. I think the Nazi party is a great example of the power that graphic design can have.\n\nNot sure I’d group the other two in with the Nazis. They weren’t evil nor as talented graphic design-wise.\n\n"
    },
    {
      "time": " 27.Nov.2007 8.15am",
      "content": "I of course dont group them altogether, but as far as i’m concerned, the overuse of gothic and fraktur by the early hard rock bands, then metal, now gothic singers and bands gave a very bad reputation to these poor letters, at least for the people of my generation (30-35 yo).\n\ndr\n\n"
    },
    {
      "time": " 27.Nov.2007 10.01am",
      "content": "“gave a very bad reputation to these poor letters”\n\nOr good, depending on your POV. ;0)\n\nBlackletter, to me, has such a varied legacy that it seems to withstand a lot. It can mean Christmas cards, motorcycle gangs, hair metal bands, illuminated bibles, awards, etc...\n\n"
    },
    {
      "time": " 27.Nov.2007 10.48am",
      "content": "I can’t stand Palatino, because it was my ex-boyfriend’s default font. He’s a historian and I read his papers, pages and pages of Palatino. No amount of persuasion changed a thing.\n\n"
    },
    {
      "time": " 27.Nov.2007 10.51am",
      "content": "This sparked an interest in blackletter for me. [http://www.typophile.com/node/17496](http://web.archive.org/web/20071231134055/http:/www.typophile.com/node/17496 \"http://www.typophile.com/node/17496\")\n\nSharon\n\n"
    },
    {
      "time": " 27.Nov.2007 11.04am",
      "content": "I refuse to use Helvetica because designers never shut up about it and I just don’t want to think about it anymore.\n\nThere are a lot of Berthold fonts I would love to use, but I won’t touch anything from that foundry anymore. I’m tempted to make a knockoff of Akzidenz Super to use with Linotype’s Basic Commericial, tho, because Akzidenz is just so amazing.\n\nIn my student work, I won’t touch novelty fonts/display type anymore. One thing I‘ve learned is that a clean layout using well-chosen text or jobbing faces stands out above the crowd of students who stay up all night finishing over-the-top work with the latest novelties. It irritates some of my professors, but in a job interview people love it when I can explain the historic and graphic reasons for picking a face instead of just saying “I saw someone do this in a magazine and thought it looked cool.“\n\n"
    },
    {
      "time": " 27.Nov.2007 12.25pm",
      "content": "“in a job interview people love it when I can explain the historic and graphic reasons for picking a face instead of just saying “I saw someone do this in a magazine and thought it looked cool.“\n\ntotally agree on that.\n\ndr\n\n"
    },
    {
      "time": " 27.Nov.2007 1.25pm",
      "content": "A client from hell forced me to use Optima and Copperplate Gothic on his job... I can’t use either one without thinking of him. Luckily I can’t stand Optima and am sick to death in general of Copperplate.\n\n"
    },
    {
      "time": " 27.Nov.2007 2.15pm",
      "content": "I have avoided Helvetica like the plague for a long while. It was the corporate typeface at my first design job, and I used it every day for about 3 years. \\*This may not be the type of answer you were looking for, but there you go...\n\n"
    },
    {
      "time": " 27.Nov.2007 5.17pm",
      "content": "Too many doped-up parties with pseudo-artistes in the 70s = intense dislike for Memphis, Avant Garde Gothic and anything with the name Bauhaus or Benguiat in it.\n\n"
    },
    {
      "time": " 28.Nov.2007 12.10am",
      "content": "I have a deep love/hate relationship with Cooper Black. Here in Istanbul, it is insanely overused by cheap hairdressers and textile shops (which happen to be everywhere), plus it’s often distorted, extended... It bears a strong “cheap” and “seventies” smell, and yet, i love it. I can’t help myself seeing the genius of Oz Cooper’s hand in its greasy curves. I’m always finding myself defending this rounded piece of bacon against almost everyone around me, though I understand their critics.\n\nUh... I may be slightly off topic.\n\ndr\n\n"
    },
    {
      "time": " 28.Nov.2007 10.10am",
      "content": "I love Cooper Black. Luckily here I wouldn’t say it’s overused, though there may be a bit of a prejudice against it.\n\nJP, why no more Berthold? Just tired of them? Their Akzidenz is probably my all-time favorite face. Ah!\n\n"
    },
    {
      "time": " 28.Nov.2007 11.04am",
      "content": "I love, I would put my serif in that [bodonna](http://web.archive.org/web/20071231134055/http:/www.mikeindustries.com/blog/images/inline/adactio_big.jpg).\n\n"
    },
    {
      "time": " 28.Nov.2007 2.01pm",
      "content": "I’m relatively early in my design life, so most fonts spark my curiosity; no negative connotations.\n\nExcept for Copperplate. In the last few weeks I’ve noticed just how used it is. And no joke, it kind of makes me nauseated.\n\n"
    },
    {
      "time": " 29.Nov.2007 12.31am",
      "content": "I already noticed that there is a veru strong prejudice against copperplate...That’s too bad, really, this type is very beautiful, and quite unique. Long life to Copperplate.\n\ndr\n\n"
    },
    {
      "time": " 29.Nov.2007 1.50am",
      "content": "“Already” noticed ?  \nCopperplate is the cause of global warming, anyone agree ?\n\n"
    },
    {
      "time": " 29.Nov.2007 5.50am",
      "content": "Oh, and I have nothing against Copperplate. I think when it’s used well it’s handsome.\n\nBut I do have this strange, involuntary vomity feeling when I see it used in what seems to be a default way.\n\nThere are so many fonts used as defaults that I’m not sure why I seem to have a thing with Copperplate.\n\n"
    },
    {
      "time": " 29.Nov.2007 6.04am",
      "content": "I do like Optima — for print and display. Online it generally sucks due to the low resolution. In text sizes in print the subtle serifs can’t play well either.\n\nCopperplate is nice too — for copper plates, and a few other uses.\n\nBut together? That might turn me off both of them as well.\n\n"
    },
    {
      "time": " 29.Nov.2007 7.54am",
      "content": "I wouldn’t use Helvetica very quickly, for no real reason. Maybe the fact that there are people who say it’s the only typeface you need, I don’t use it on purpose. It also gives designs a blandness I might not want. And even if I want that, I can achieve that with a different typeface just as well.\n\nI wouldn’t use Avant Garde either, because it was used to death again a while ago by those so called ’trendwhore’ designers. And of course the Alternates...\n\nThe same goes for DIN.\n\nDon’t get me wrong, I don’t hate these typefaces, I like them sometimes when I see them used well. But I wouldn’t use them myself.\n\n"
    },
    {
      "time": " 29.Nov.2007 10.10am",
      "content": "Rotis  \nbecause it’s ugly and... ugly.\n\nCompatil  \nbecause it’s a Frankenstein kind of type design. It’s dead, but it’s alive.\n\nvery subjective, but nevertheless.  \nCheers, Co.\n\n"
    }
  ]
}
