{
  "id": "39472",
  "title": "Inherited Museum Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’ve just been given some freelance work for a literary house/museum. The director is very keen to keep this existing logo, which I personally cannot stand. Any suggestions on how to improve the attached whilst maintaining recognisability?\n\ncb\n\n| Attachment | Size |\n| --- | --- |\n| [wordsworth\\_trust\\_logo\\_small.jpg](http://web.archive.org/web/20071202140142/http:/typophile.com/files/wordsworth_trust_logo_small.jpg) | 853.28 KB |\n\n [‹ Kerning double check](http://web.archive.org/web/20071202140142/http:/www.typophile.com/node/39544 \"Go to previous forum topic\") [New try for design agency logo ›](http://web.archive.org/web/20071202140142/http:/www.typophile.com/node/39598 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071202140142/http://www.typophile.com/user/21183\" title=\"View user profile.\">crazig</a>",
  "time": "<br>",
  "uid": "21183",
  "comments": [
    {
      "time": " 27.Nov.2007 4.03am",
      "content": "Well, this isn’t so bad. Loose the bevel effect and the frame around it (why do people always have to put things into a box). Voila, the overall appearance will be much more elegant.\n\nSeb\n\n"
    },
    {
      "time": " 27.Nov.2007 5.10am",
      "content": "with all due respect that isnt a logo. its text in a box. very amateur ’oooo look ive just discovered photoshop’. Lets get to the point ’ITS CRAP!’\n\nIf he wants to keep it...why is he asking for a designer to do a new one? classic arrogance. Its one thing for the client to steer things to their liking, it is afterall for them...but quite another to insist they know your job better than you.\n\nyou dont go telling a carpenter how to make a table do you.\n\n—-\n\nwhat works in your favour, is the guy prob knows nothing, and is just trying to ’be in charge’ so some tact is needed. just do a design, use the copy, but not the design hes supplied...and tell him youve re-worked ’his’ design, keeping the flavor of the original logo etc etc...just butter his ego...\n\nthats whats really required.\n\n"
    },
    {
      "time": " 27.Nov.2007 7.38am",
      "content": "The image “http://typophile.com/files/wordsworth\\_trust\\_logo\\_small.jpg” cannot be displayed, because it contains errors.\n\n"
    },
    {
      "time": " 27.Nov.2007 8.33am",
      "content": "Make sure your image is in RGB mode, not CMYK.\n\n- Lex\n\n"
    },
    {
      "time": " 1.Dec.2007 10.57am",
      "content": "What a nice project to given!\n\nI guess it’s a little late in the day. But if you’re still on the project, it might be an idea to exaggerate the contrast in sizes even further so that Dove Cottage and Wordsworth are far more prominent. That and course all those things Seb suggested.\n\nG’luck!\n\n"
    }
  ]
}
