{
  "id": "39495",
  "title": "Good resources for specifying Chinese, Japanese and Arabic typefaces?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am working on a corporate standardization project, and I need to offer some loose guidelines on what faces to specify for Chinese, Japanese, and Arabic documents. Do any Typophiles out there have a favorite resource for international typeface matters?\n\nJAPANESE: So far, I know that Japanese is split into Mincho (calligraphic) and Gothic (monoline) categories, but I’m looking for the names of faces in these categories that are easily found or procured for users of Windows XP, Vista, or Mac OS X.\n\nCHINESE: I’m assuming that these two categories also exist for Chinese characters, but I just need the names of those categories and a name of a corresponding typeface I can recommend.\n\nARABIC: I’m ignorant. I can’t even find if they have monoweight-stroke versions, though it’s looking like the answer is no.\n\nAny help you could give me would be very much appreciated!\n\nEnrico\n\n [‹ need help with Cyrillic christmas greeting text](http://web.archive.org/web/20080414221454/http:/www.typophile.com/node/39015 \"Go to previous forum topic\") [Luxury Shoes and Handbag Company Logo Suggestion ›](http://web.archive.org/web/20080414221454/http:/www.typophile.com/node/39517 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080414221454/http://www.typophile.com/user/4485\" title=\"View user profile.\">enrico_limcaco</a>",
  "time": "<br>",
  "uid": "4485",
  "comments": [
    {
      "time": " 27.Nov.2007 11.12am",
      "content": "For Arabic, this may be a useful resource:\n\n[http://www.khtt.net/](http://web.archive.org/web/20080414221454/http:/www.khtt.net/ \"http://www.khtt.net/\")\n\n"
    },
    {
      "time": " 27.Nov.2007 11.21am",
      "content": "The Netherlands-based designer of Arab origin, Tarek Atrissi has worked on quite a few Arabic faces including the Arabic version of Fedra. You can view some of his work here:\n\n[www.atrissi.com](http://web.archive.org/web/20080414221454/http:/www.atrissi.com/ \"www.atrissi.com\")\n\nand\n\n[www.typotheque.com/fonts/fedra\\_arabic/info/](http://web.archive.org/web/20080414221454/http:/www.typotheque.com/fonts/fedra_arabic/info/ \"www.typotheque.com/fonts/fedra\\_arabic/info/\")\n\n"
    },
    {
      "time": " 27.Nov.2007 11.40am",
      "content": "I’m interested in knowing which Arabic/Chinese/Japanese faces are common across operating systems... basically the equivalent of Helvetica and Times New Roman for these languages, across computer platforms.\n\n"
    },
    {
      "time": " 27.Nov.2007 11.58am",
      "content": "But couldn’t you write to those people to find out?\n\n"
    },
    {
      "time": " 27.Nov.2007 12.04pm",
      "content": "The forums at khtt.org don’t look very well travelled (almost no posts have replies to them). I also looked at the Microsoft Typography page. Thanks for the links...those pages have some links that may have some answers to some of the more involved issues I’m looking at.\n\n"
    },
    {
      "time": " 27.Nov.2007 12.36pm",
      "content": "Good luck on that.\n\n"
    },
    {
      "time": " 27.Nov.2007 9.13pm",
      "content": "Enrico, don’t forget that for Chinese there is Traditional Chinese and Simplified Chinese, so that is something to specify when making questions about fonts for that language.\n\n"
    },
    {
      "time": " 27.Nov.2007 9.17pm",
      "content": "Some info about displaying Japanese characters (which are divided into Hiragana, Katakana and Kanji):\n\n[http://japanese.about.com/od/fonts/Displaying\\_Japanese\\_Characters.htm](http://web.archive.org/web/20080414221454/http:/japanese.about.com/od/fonts/Displaying_Japanese_Characters.htm \"http://japanese.about.com/od/fonts/Displaying\\_Japanese\\_Characters.htm\")\n\n"
    },
    {
      "time": " 27.Nov.2007 9.23pm",
      "content": "One more link...\n\n[Alan Wood’s Unicode Resources](http://web.archive.org/web/20080414221454/http:/www.alanwood.net/unicode/index.html) site might be useful to you.\n\n"
    },
    {
      "time": " 27.Nov.2007 10.17pm",
      "content": "Sweet! I just spent the better part of the day also looking for sans-serif and serif pairings that also had cyrillic and other language support. It’s a really small number so far. Serifs are LT Excelsior, LT Minion, Adobe Garamond Premier Pro (nothing too spectacular unfortunately) and sans-serifs are FF Kievit and FF DIN. Hopefully I can whip up a document that looks like it was worth the research time I’m billing for.\n\nIs the distinction between Simplified and Traditional Chinese like Katakana and Kanji?\n\nThanks for the links...everyone else, please also feel free to add to the list!\n\n"
    },
    {
      "time": " 27.Nov.2007 10.44pm",
      "content": "Paratype seems to be the go-to shop for Cyrillic extensions of font families...\n\n"
    },
    {
      "time": " 28.Nov.2007 11.02am",
      "content": "_Is the distinction between Simplified and Traditional Chinese like Katakana and Kanji?_\n\nNo. Among other things, Simplified Chinese has less characters than Traditional Chinese. More info at the links below:\n\n[http://en.wikipedia.org/wiki/Simplified\\_Chinese\\_character](http://web.archive.org/web/20080414221454/http:/en.wikipedia.org/wiki/Simplified_Chinese_character \"http://en.wikipedia.org/wiki/Simplified\\_Chinese\\_character\")\n\n[http://people.w3.org/rishida/scripts/chinese/](http://web.archive.org/web/20080414221454/http:/people.w3.org/rishida/scripts/chinese/ \"http://people.w3.org/rishida/scripts/chinese/\")\n\nMore on written Japanese here:\n\n[http://en.wikipedia.org/wiki/Japanese\\_writing\\_system](http://web.archive.org/web/20080414221454/http:/en.wikipedia.org/wiki/Japanese_writing_system \"http://en.wikipedia.org/wiki/Japanese\\_writing\\_system\")\n\n"
    },
    {
      "time": " 28.Nov.2007 11.18am",
      "content": "\\>Simplified Chinese has less characters than Traditional Chinese.\n\nNot fewer characters, but fewer strokes per character. Simplified characters are still ideograms, not an alphabet or simply syllables representing sounds. They were based on simplifications commonly used in handwriting, for speed. For formal calligraphy even on the mainland they often use traditional characters, which are thought to be more beautiful than their simplified counterparts.\n\n"
    },
    {
      "time": " 28.Nov.2007 1.41pm",
      "content": "Ah, thanks for the clarification, William. I stand corrected.\n\n"
    },
    {
      "time": " 28.Nov.2007 7.15pm",
      "content": "Thanks for the links...I’ll have to re-evaluate my earlier assumptions...\n\n"
    },
    {
      "time": " 29.Nov.2007 6.33am",
      "content": "Enrico,\n\nI hope this is not too late, check out the link below:  \n [http://marica.nodblog.com/2007/11/29/most-common-chinese-typefaces/](http://web.archive.org/web/20080414221454/http:/marica.nodblog.com/2007/11/29/most-common-chinese-typefaces/ \"http://marica.nodblog.com/2007/11/29/most-common-chinese-typefaces/\")  \nI wrote it just now, hope it clears up the mess a little bit. I am a Chinese myself, so feel free to ask me if you have other questions.\n\n"
    },
    {
      "time": " 29.Nov.2007 4.33pm",
      "content": " I’ve been wondering a similar thing, trying to match a Latin titling font with a Chinese one for a Firefly-themed book. Right now I’m using Gentium Basic and MingLiU, which seem to work nicely together—but then I’m an engineer, so what do I know? ;)  \n I did have to un-bold the chapter headings since the fonts I have on the computer don’t include a bold Song/Ming face and I have no idea what to look for in a Chinese font. OTOH, I think I prefer the headings this way.  \n If this was a real project (rather than a hobby to occupy my “copious spare time”) I’d also be looking for some guidelines on matching the “feel” of faces from unrelated scripts.\n\n—Joel\n\n ![](http://web.archive.org/web/20080414221454im_/http:/www.typophile.com/files/Firefly%20Book_6146.jpg)\n\n"
    },
    {
      "time": " 29.Nov.2007 4.37pm",
      "content": "Marica, I have a question not about Chinese Characters, but about the Pin Yin romanization. If you type Pin Yin, do you know if it composes the letter + tone accents, or whether these composed characters have to be part of the font? Is there a special program or keyboard for this?\n\nI know there are Unicode slots for the accents, but I don’t know whether they need to be part of the font.\n\n"
    },
    {
      "time": " 29.Nov.2007 4.43pm",
      "content": "Thanks Marica. I learned that the company I’m doing the research for uses a company called Enlaso to do the translations. I’m awaiting word on what character sets they use for which purposes. At least I know now that the Chinese Hei is like the Japanese Gothic and that Song is like the Mincho designation.\n\n"
    },
    {
      "time": " 29.Nov.2007 6.19pm",
      "content": "William, there are special input programs(for example PinYin input) for typing Chinese characters, but no special keyboard. A Chinese font normally contains about 10000 characters, and Latin letters which include the accented ones. Here is how to type a character, type PinYin(no accents), the input program shows you all the characters that have the same PinYin(could be a lot) ordered by the tone, then you choose the one you want.  \nIt takes hell of a time to finish a font because of the amount of characters.\n\n"
    },
    {
      "time": " 29.Nov.2007 6.31pm",
      "content": "Marica, I knew about using pin yin to get Chinese characters, because my wife uses such a program. I was interested rather in how to type pin yin itself. For example here I have here is a pinyin word from the wikipedia article: túshūguǎn, which means library. That has the u-macron and a-caron, which are not in the western european character set.\n\nThe MS fonts have everything on earth in them but the question is when people want to do signs etc in Hong Kong and China, or books that give a pinyin romanization, what fonts do they go to? Do they have to have all the pinyin diacritics (the accents over the vowels to indicate the four tones) or what?\n\n"
    },
    {
      "time": " 30.Nov.2007 12.50am",
      "content": "William, yes every standard Chinese font has those special accented vowels. As to what font they usually use, I’ve no idea, probably fonts similar to Song.\n\n"
    }
  ]
}
