{
  "id": "39511",
  "title": "Handwriting Sample",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Thought some here might enjoy this. Look at how he wrote the word Dear. We can make out everything in the letter except what he is wanting 800 bushes of.\n\nSharon\n\n ![](http://web.archive.org/web/20120623015755im_/http:/typophile.com/files/letter_5216.jpg)\n\n",
  "author": "Sharon Van Lieu",
  "time": "27 Nov 2007 — 5:50pm",
  "uid": "3775",
  "comments": [
    {
      "time": "27 Nov 2007 — 6:00pm",
      "content": "sand\n\n"
    },
    {
      "time": "27 Nov 2007 — 6:14pm",
      "content": "You sure it's not gold or something. I can't believe we have a one hundred and fifty plus year old letter about dirt!\n\nThanks, Richard.\n\nSharon\n\n"
    },
    {
      "time": "27 Nov 2007 — 7:02pm",
      "content": "Looks like \"sand\". Where did you find this Sharon? It would be plenty heap fun to turn into a font.\n\nj a m e s\n\n"
    },
    {
      "time": "27 Nov 2007 — 7:08pm",
      "content": "It's one of a nice set of papers we have. It includes some large loose paper journals that we are worried about handling. The earliest paper goes back to the 1700's. I just love the Dear. I couldn't turn it into a font but you are welcome to do it. :-)\n\nSharon\n\n"
    },
    {
      "time": "27 Nov 2007 — 7:14pm",
      "content": "What do you plan to do with this lovely stuff, Sharon? I'd find an experienced bookbinder/conservator and turn this into a fab keepsake....\n\n(Love that d in \"sand\" -- so Cochin-like!)\n\n"
    },
    {
      "time": "27 Nov 2007 — 7:34pm",
      "content": "We're not sure what we'll do with it. My husband has been googling information about the boat mentioned and it's fascinating what you can find. Federal blockaders eventually destroyed it during the Civil War. It was from Savannah and called the Vapor.\n\n"
    },
    {
      "time": "27 Nov 2007 — 9:07pm",
      "content": "Yeah Linda, it's uh, \"fine art\" scrapbook material. You like Cochin? That thing is cooler than cool. I love everything by Rudolf Koch.\n\n_I couldn’t turn it into a font but you are welcome to do it. :-)_\n\nAlright, count me in. Keep in mind it will take a year or two (I've got about six fonts in development including a masterwork) and I'll need high resolution samples to work from. Probably this would be good to post in the critique forum because I will need some coaching, but I am immensely keen. Immensely.\n\nYou can contact me at james dot arboghast @ gmail dot com  \nor use the contact thingy on my typophile user page.\n\nj a m e s\n\n"
    },
    {
      "time": "27 Nov 2007 — 11:49pm",
      "content": "If i might say something, there is a distinctive dot right after the word sand, which might mean that this is a diminutive for a longer word... Sandwiches? Sandpaper?\n\ndr\n\nps: If you actually make a font out of it, keep us informed. This handwriting is gorgeous.\n\n"
    },
    {
      "time": "28 Nov 2007 — 12:17am",
      "content": "We found information tonight that this boat carried sand and guano at times. Amazing what you can find so quickly these days.\n\nSharon\n\n"
    },
    {
      "time": "28 Nov 2007 — 12:36am",
      "content": "well then, no suspense anymore, it's all about dirt :-)\n\ndr\n\n"
    },
    {
      "time": "28 Nov 2007 — 1:03am",
      "content": "<cite>I can’t believe we have a one hundred and fifty plus year old letter about dirt!</cite>\n\nWell, you can’t build a city on gold, can you? ;°)  \nGosh, [there even is ‘foundry sand’](http://web.archive.org/web/20120623015755/http:/en.wikipedia.org/wiki/Sand#Uses_of_sand)!\n\n"
    },
    {
      "time": "28 Nov 2007 — 3:34am",
      "content": "It's actually Bush. that's the short form - meaning Bushels of sand.\n\nA Bushel is a measure of capacity equal to 64 US pints, used for dry goods.\n\nThat is gorgeous BTW - I wish my handwriting were as fluid.\n\nNick Cooke\n\n"
    },
    {
      "time": "28 Nov 2007 — 5:52am",
      "content": "I can sort of read it, but some words are difficult for a non-native English reader. :(\n\n"
    },
    {
      "time": "28 Nov 2007 — 6:14am",
      "content": "I'm intrigued by the swashes between the lines \"until that time. / Send me. . . \" and the signature. I'm trying to imagine when (in the writing) one added these. The Signature swash seems to grow out of the \"M,\" but it wraps around \"Ketchum\" in a way that suggests the name had been written by the time the swash surrounded it. The prior swash seems to function as the crossbar of the \"t\" in \"time,\" but it aligns with other crossbars, and perhaps corsses the \"t\" in \"the bill.\"\n\nQuin, as best I can puzzle it out, it reads:\n\nCapt. Ivor Higbe(e?)\n\nD[ea]r Sir,\n\nI wish you to deliver  \nme 800 bush. sand. Same  \nkind as before at Merrit  \nDock next week without  \nfail as I have only  \nabout enough on hand  \nto last one until that time.  \nSend me the bill and  \nI will send you the money  \nby Mr [name I can't make out] Young.\n\nTruly,  \nJ[oh]n McKetchum  \nDover, New York  \nNov, 5, 1852\n\nDo not fail to get the  \nsand there next week  \nby the middle if possible.\n\n"
    },
    {
      "time": "28 Nov 2007 — 6:15am",
      "content": "This is an exaggerated, sarcastic \"review\", to inform and entertain (mainly for entertainment value).\n\n**Letter to Captain Higbee of the Vapor**  \nUtterly maniacle everyday cursive hand from the late 18th century with expressive if rather over-enthusiastic pen manner. Existing on the margins of outright stupefaction but still posessing a fundamental coolness that modern handwriting just doesn't have. Pressure-induced changes in stroke width, character size variation visible from space and hedge-threatening understeer present a daunting challenge to digitzation.  \n**Spec notes:** All but j, q and z are present, but alarming lack of capitals means Jimmy Cat will need to study loads of similar writing from the period.  \n**Completion date:** Not distant enough  \n**Rivals:** P22 Cezanne, Lamar Pen, Houston Pen, Emily Austen, A good fountain pen  \n**But also try:** A nice sit down and a cup of tea.  \n**My choice:** Provided I don't intend to finish working on it before 2020, why not?\n\nLooking at the high res pic the plot gets a lot thicker. Do I seriously believe it can be made into a font? Maybe, maybe not. At this early stage I think the basic effect of the letter can be wrought in font form, but a full-blown emulation with all eccentricities may prove impossible.\n\nI'll keep you posted.\n\nj a m e s\n\n"
    },
    {
      "time": "28 Nov 2007 — 6:27am",
      "content": "indeed beautiful handwriting! I especially like the lowercase **e** at the beginning of 'enough'.  \nThis is what I could make out:\n\nCapn. Jonas Hiqbee  \nD(ear) Sir  \nI wish you to deliver  \nme 800. Bush. Sand. Same  \nKind as before at [? me...d].  \nDock next week without  \nfail as I have only  \nabout enough on hand  \n[? .la.t] me until that time  \nsend me the Bill and  \nI will send you the money  \nby mail. [?] yours  \nTruly  \nIn. M [? Kelcham]  \nDover, NewYork  \n[?] 5.1852.  \nDo not fail to get the  \nsand here next week -  \nby the middle of [?]\n\nedit: it seems while I was doing my best to read the letter someone else beat me to the punch. And better I must add!\n\n"
    },
    {
      "time": "28 Nov 2007 — 6:24am",
      "content": "Just noticed the handwritten double-s in \"possible.\" Crazy.\n\n"
    },
    {
      "time": "28 Nov 2007 — 6:26am",
      "content": "Ha, ‘possible’ (last word) is written with ‘ß’ (‘ſs’, that is)!\n\n"
    },
    {
      "time": "28 Nov 2007 — 6:49am",
      "content": "Thanks akma, for the transcript.  \nAnd Wouter as well. :)\n\nI could make out most of it, but some words proved difficult. I think if it was written in Dutch in such a handwriting, I would be able to read it better, since the words(shapes) are imprinted in my brain much better. If you know what I mean. :)\n\n"
    },
    {
      "time": "28 Nov 2007 — 7:02am",
      "content": "I think it's Morris Dock, not Merrit.\n\n"
    },
    {
      "time": "28 Nov 2007 — 8:44am",
      "content": "I think AKMA and Wouter have it mostly correct, but let me give it a shot:\n\nCapt. Jonas Higbee  \nDear Sir\n\nI wish you to deliver  \nme 800. Bush. Sand. Same  \nkind as before at Morris(?)  \nDock next week without  \nfail as I have only  \nabout enough on hand  \nto last me until that time\n\nSend me the Bill and  \nI will send you the Money  \nby Mail\n\n(?) Yours Truly  \nJn. M Ketchum  \nDover, New York  \nNov. 5 1852\n\nDo not fail to get the  \nsand there next week -  \nby the middle if possible.\n\nI'm not quite convinced that the dock name is \"Morris\" and I can't quite figure out what the word before \"Yours Truly\" is, but I suspect it's part of the close.\n\n"
    },
    {
      "time": "28 Nov 2007 — 9:42am",
      "content": "I think it's 'Oblig. Yours Truly'\n\nNick Cooke\n\n"
    },
    {
      "time": "28 Nov 2007 — 10:19am",
      "content": "According to NY Times archives it is Morris Dock. And I think Jonas looks right, Mark.\n\nIf anyone else wants to see the larger scan, I leave it up here for a while.\n\n[http://www.acksite.com/typophile/letter.psd](http://web.archive.org/web/20120623015755/http:/www.acksite.com/typophile/letter.psd \"http://www.acksite.com/typophile/letter.psd\")\n\nIt's almost 26mb so I'll take it down after a while.\n\nSharon\n\n"
    },
    {
      "time": "28 Nov 2007 — 10:25am",
      "content": "It is definitely Jonas Higbee, born in 1797 in Little Cow Harbor, Long Island.\n\n"
    },
    {
      "time": "28 Nov 2007 — 11:16am",
      "content": "But is that a period after what we're taking to be \"Morris\"?\n\n"
    },
    {
      "time": "28 Nov 2007 — 11:21am",
      "content": "Akma, it's an illusion. The tail of the M leads into the trunk of the K with a sharp turn. The big swash is the crossbar of the t. They appear to follow the same curve, but if you look closely, they don't actually meet.\n\n"
    },
    {
      "time": "28 Nov 2007 — 12:11pm",
      "content": "Superb work, all! Points all around for \"Morris,\" \"Oblig.,\" and the correct names.\n\nThanks, Cerulean, for that illumination -- I see it now, and can imagine how a practiced hand would produce that sort of linear congruence. I often find that my own (unskilled) handwriting produces parallel lines and harmonious swashes that I could never have drawn by deliberate effort; it's delightful to see Ketchum's hand at work. This is an effect that OpenType may approximate, but will never equal.\n\n"
    },
    {
      "time": "28 Nov 2007 — 3:42pm",
      "content": " The “Dʳ Sir” is a nice use of abbreviating superscript, which Unicode doesn’t nicely accommodate. It can be faked with a spacing modifier letter (U+02B3).  \n The swash after the `h' in “Bush. Sand” is harder to identify; is that just an ornament or is it supposed to read “Bushˢ Sand” with a superscript `s'?\n\n—Joel\n\n"
    },
    {
      "time": "29 Nov 2007 — 3:47am",
      "content": "Thanks everyone for the deciphering.\n\nj a m e s\n\n"
    },
    {
      "time": "29 Nov 2007 — 3:35am",
      "content": "Pretty nice! And even sort of right-aligned.\n\n<cite>The swash after the ‘h’ in “Bush. Sand” is harder to identify; is that just an ornament or is it supposed to read “Bushˢ Sand” with a superscript ‘s’?</cite>\n\nYou mean to denote the plural of bushel? Doesn't look all too much like an s to me, but it certainly would make sense.\n\n800 bushels are quite a lot of sand.  \n(Wikipedia shows a [Table of Weights](http://web.archive.org/web/20120623015755/http:/en.wikipedia.org/wiki/Image:Bushel_Table_of_States.jpg) from that time.)\n\n"
    },
    {
      "time": "15 Jul 2010 — 12:37am",
      "content": "Hello  \n I'm not really a typophile type, but while googling my Great Grandfather Captain Jonas Higbee, I came across the site and enjoyed seeing the letter written to Jonas. I don't know much about him other than he was a ship's Captain during the Civil War era. I have a few letters written by him and to him regarding his ship and his work. Thanks for posting the letter above which has added to my knowledge of old Jonas! And, by the way, I took German in high school and a double \"s\" was often represented by the character that looks something like a capital \"B.\"\n\nRod Brush\n\n"
    }
  ]
}
