{
  "id": "39533",
  "title": "Postscript fonts not working with Leopard and Keynote",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A [discussion over on ZDNet](http://web.archive.org/web/20130812015722/http:/blogs.zdnet.com/Apple/?p=1057) about Postscript Courier and Helvetica fonts not working under Mac OS X Leopard and the Keynote presentation software. I wonder if this happens in other situations.\n\n",
  "author": "Gus Winterbottom",
  "time": "28 Nov 2007 — 9:31am",
  "uid": "15033",
  "comments": [
    {
      "time": "28 Nov 2007 — 9:45am",
      "content": "<cite>Perhaps this rejection of a Classic Mac font by Keynote and OS X is yet another sign of OS X bowing a bit to the dominant Windows platform.</cite>\n\nSeems they don't have a clue about font formats.\n\nRalf\n\n"
    },
    {
      "time": "28 Nov 2007 — 10:46am",
      "content": "My guess is that keynote is having issues with \"Oblique\" vs \"Italic\" in the name? I don't think the formats have anything to do with the problem, but who knows, and really who cares?\n\n"
    },
    {
      "time": "28 Nov 2007 — 10:53am",
      "content": "The guy who wrote that cr\\*p has \"20 years of Mac experience\"? ROTTL!\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "28 Nov 2007 — 11:03am",
      "content": "This seems to be a bigger issue...\n\n[http://www.itnews.com.au/News/65935,apples-tiger-upgrade-causing-catastr...](http://web.archive.org/web/20130812015722/http:/www.itnews.com.au/News/65935,apples-tiger-upgrade-causing-catastrophic-failure-users-report.aspx \"http://www.itnews.com.au/News/65935,apples-tiger-upgrade-causing-catastrophic-failure-users-report.aspx\")\n\n...but I would have used some hilarious feline pun in the headline to link Tiger, Leopard and \" **cat** astrophic\" - although maybe the users who lost all their \"music and videos\" might not appreciate the joke.\n\nAnd why is it music and videos that are lost forever - are spreadsheets, documents, and porn not important to the average Mac user? :-)\n\n"
    },
    {
      "time": "28 Nov 2007 — 1:39pm",
      "content": "I'm sorry to hear that Apple employs such poor technicians at their 'Genius Bar'. There are at least two solutions for the problem that allow users to salvage their data -- and that without taking the screwdriver in your hand.\n\nOne is to attach an external Firewire drive to the Mac, boot it from the system DVD, install Mac OS X on the external Firewire drive, boot from it and the copy all the data from the internal hard drive to the external one. The other one is to hook up the Mac to another Mac using a Firewire cable and boot your Mac in the target mode (pressing the T key while booting). This will allow the other Mac to recognize your Mac's internal hard drive as an external drive, so you'll be able to copy all your data from your Mac to the other one.\n\nThese solutions are known since Classic times, and I'm quite familiar with them, being a recent Mac switcher myself (the main reason I switched to Mac OS X was Windows Vista). If the 'Mac geniuses' at the Apple store did not suggest any of those simple solutions, well, shame on them.\n\nAdam\n\n"
    },
    {
      "time": "28 Nov 2007 — 6:12pm",
      "content": "\\>I’m sorry to hear that Apple employs such poor technicians at their ’Genius Bar’.\n\nMaybe this is the problem...\n\n ![](http://web.archive.org/web/20130812015722im_/http:/typophile.com/files/thumbnailCATU0E9F_4056.jpg)\n\n"
    }
  ]
}
