{
  "id": "39552",
  "title": "What makes expensive books smell so good?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What gives expensive, well-printed book that incredible luscious smell? You know what I mean—that soft odor of luxury and petroleum that comes out of every single book printed in Belgium, most of the books from France, Italy, and Japan, and not a damned thing printed in the USA. Is it the inks, the paper, the glue, or just some tangible residue of the dedication of insanely dedicated pressmen?\n\n",
  "author": "<a href=\"/web/20100703130153/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": "",
      "content": "\\>not a damned thing printed in the USA.\n\nWhat is printed in the USA in this day and age? Maybe tax forms and loto tickets if you're lucky.\n\n"
    },
    {
      "time": "",
      "content": "Expensive Printing Smell. This is a spray on product manufactured in Japan and, under license, in Germany, by the same people who invented New Car Smell. The US imposes heavy tariffs on products whose only purpose is to produce an odour, which is why a lot of European perfumes are also not available in the USA or are very expensive. I believe this is due to the Hollywood lobby, which wants Americans only to purchase perfumes 'designed' by American celebrities. Unfortunately, Expensive Printing Smell got caught in the same classification. American used car dealers use a knock off of New Car Smell, but no one in the USA has succeeded in replicating the scent of the highly secret ingredients in Expensive Printing Smell, although some vegetable based inks have been found to have powerful if often unpleasant odours.\n\n"
    },
    {
      "time": "",
      "content": "Has the new-book smell spray can ever been mixed up with the house for sale/cookies and vanilla smell...\n\nJust wondering.\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "My printer has a sampler of smells that you can have added in the binding stage --\"Olde English Leather\", \"British Columbia old growth forest\", etc.\n\n"
    },
    {
      "time": "",
      "content": "Gary, you need to see if your printer has \"Prairies after a Hailstorm\" -- there's something almost intoxicating about it. ;-)\n\n"
    },
    {
      "time": "",
      "content": "My printer offers an \"old money\" and \"new money\" scent. In the old money case they actually rub each piece of paper on the forehead of a bald, grumpy rich guy. For the new money scent they drive over each ream of paper in a black 2007 Audi A8 L W12.\n\nFor the ultra cool, \"designer scent\" they leave an iPhone next to the paper - unfortunately they charge $90 a month and you have to sign a two year contract.\n\n"
    },
    {
      "time": "",
      "content": "I purchase _Eye_ magazine exclusively for its \"Expensive Design Magazine\" scent.\n\n"
    },
    {
      "time": "",
      "content": "I might get off topic there, but we have a chain of shops in France called \"Nature et decouvertes\", some kind of new age-discovery channel stuff, and in there you can actually buy ambiance perfumes with names such as \"breakfast under the tree in autumn\" or \"a visit to grandma's countryhouse\"... I'm regularly buying the one called \"nature after the rain\" and it is quite amazing: it really does reminds a whole lot of things, from hours walking in some normandy fields right after a shower. Odour is an extremely powerful memories safekeeper.\n\ndr\n\n"
    },
    {
      "time": "",
      "content": "Paper quality is also quite important. Cheap paper stinks. But in most cases publishers are not willing to charge 5-10% more for a book that is printed on good (or at least decent) quality paper.\n\nKlaus Wagenbach, a publisher who has founded the Wagenbach Verlag in Germany, was famous for tasting the paper before printing his books on it. Wagenbach books are arguably the nicest books produced in Germany - and yes, these books are a bit more expensive than the average books, but it’s a pleasure to read them.\n\n"
    },
    {
      "time": "",
      "content": "\\> Wagenbach books are arguably the nicest books produced in Germany\n\nAnd the tastiest, I'll wager.\n\n"
    },
    {
      "time": "",
      "content": "Anyone remember the old Starkist ads?\n\n\"Charlie, Starkist don't want tunas wit' good taste; they want tunas that taste good!\"\n\n"
    },
    {
      "time": "",
      "content": "The smell of books is the smell of a life lived or a life about to be lived. It is the expectation we have. No?\n\n"
    },
    {
      "time": "",
      "content": "\"What gives expensive, well-printed book[s] that incredible luscious smell?\"  \nReading them in a rose garden?\n\n"
    }
  ]
}
