{
  "id": "39574",
  "title": "Legible font needed for magazine body text",
  "forum": "Design",
  "tags": [

  ],
  "content": "I volunteer for a small organisation which publishes a magazine giving a socio-political analysis of current events. The magazine is aimed at the general public, but many of our long-term subscribers are becoming older and visually impaired, and are complaining that the text is hard to read. We don’t want to increase the font size to the point where our typography stands out like a sore thumb as that will turn off new and casual readers, so perhaps we could change the typeface to something more legible? The body text currently looks to be 9.5 pt Times New Roman (clichéd, I know). I hear that studies have shown that Century Schoolbook is more legible to young readers; would it also be more legible to older or visually impaired ones?\n\n [‹ Luxury Shoes and Handbag Company Logo Suggestion](http://web.archive.org/web/20071201091758/http:/typophile.com/node/39517 \"Go to previous forum topic\") [Soft Return in Photoshop CS3 ›](http://web.archive.org/web/20071201091758/http:/typophile.com/node/39455 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071201091758/http://typophile.com/user/17917\" title=\"View user profile.\">Psychonaut</a>",
  "time": "<br>",
  "uid": "17917",
  "comments": [
    {
      "time": " 29.Nov.2007 9.26am",
      "content": "I publish a magazine where the vast predominence of readers are 50+. I switched to Century Schoolbook, and we set the type 10/12 - and that had really made the readers very happy.\n\n"
    },
    {
      "time": " 29.Nov.2007 10.52am",
      "content": "I would suggest Utopia that matches well the magazine subject and also has larger x-height. However, I did not test it in reality for legibility issues compared to Times.\n\nYou could also try Times Seven  \n [http://www.fonts.com/findfonts/detail.htm?pid=205579&grab\\_id=0&page\\_id=4...](http://web.archive.org/web/20071201091758/http:/www.fonts.com/findfonts/detail.htm?pid=205579&grab_id=0&page_id=40489&query=times%20seven&SCOPE=Fonts \"http://www.fonts.com/findfonts/detail.htm?pid=205579&grab\\_id=0&page\\_id=40489&query=times%20seven&SCOPE=Fonts\")  \nthat is more robust for small sizes, so you would not actually change the typeface that much while improving legibility.\n\n"
    },
    {
      "time": " 29.Nov.2007 11.16am",
      "content": "Also, a rule of thumb for myself is not going below 12 pts in body copy for readibilty and legibility purposes\n\nChase Langdon\n\n"
    }
  ]
}
