{
  "id": "39579",
  "title": "Typography - basic education",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "1. Do you think people/children should get basic information about typography in the context of mandatory education?  \n2. Would this improve the overall taste and literacy of general public?  \n3. How would you schedule such education?  \n4. Are there countries that actually made some steps in this area?\n\nSlightly unrelated, but:  \nwhat you think, will there ever be something like “personal graphic identity”, resembling corporate identity?  \nOr, rephrased, could typography someday become a part of person’s style (resembling one’s preferences in cars, clothing brands etc.). The answer is probably no, but could you at least imagine such scenario?\n\nThanks in advance for any comments.\n\n [‹ I'm just going to ask...](http://web.archive.org/web/20080704152905/http:/www.typophile.com/node/39618 \"Go to previous forum topic\") [[ATypI] Maestría en diseño tipográfico ›](http://web.archive.org/web/20080704152905/http:/www.typophile.com/node/39591 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080704152905/http://www.typophile.com/user/18817\" title=\"View user profile.\">loremipsum</a>",
  "time": "<br>",
  "uid": "18817",
  "comments": [
    {
      "time": " 29.Nov.2007 11.36am",
      "content": "I think it should be at LEAST offend as an elective, like keyboarding... or even as a secondary class to keyboard like keyboard 101, keyboarding 110: Typographic Basics. Have more on the chidrens computers than microsof word like Indesign or Illustrator.\n\nChase Langdon\n\n"
    },
    {
      "time": " 29.Nov.2007 11.42am",
      "content": "1. No. General education—at least here in the states—is muddled up enough trying to cram in the interests of too many people as it is. Trying to teach everyone something as subtle and esoteric as typography would just leave them more confused than they already are.\n\n2. Mandatory music classes education hasn’t done anything to change the public taste for bad music, so I see no reason to assume that it would work with type.\n\nCarefully developed personal graphic identities seem pretty unlikely to happen on a large scale; people have better things to do with their time. That’s why so many people just stick with Arial and Times New Roman.\n\n"
    },
    {
      "time": " 29.Nov.2007 11.51am",
      "content": "<cite>Or, rephrased, could typography someday become a part of person’s style (resembling one’s preferences in cars, clothing brands etc.). The answer is probably no, but could you at least imagine such scenario?</cite>\n\n[American Psycho](http://web.archive.org/web/20080704152905/http:/www.youtube.com/watch?v=qoIvd3zzu4Y)\n\n"
    },
    {
      "time": " 29.Nov.2007 11.52am",
      "content": "That is true about music. People would rather pick something easy and fast than spend time to find whats really good. Thats why people just listen to hits radio to find out what they like rather than pouring themselves into a nice independant record company. But I still think it should be an elective, to give at least the choice to discover type before college for those not growing up around design.\n\nChase Langdon\n\n"
    },
    {
      "time": " 29.Nov.2007 12.01pm",
      "content": "I think ’design’ in general needs to be better taught. Aspects of Graphic design could certainly be included in Writing classes and art classes.\n\n"
    },
    {
      "time": " 29.Nov.2007 12.11pm",
      "content": "“American Psycho”\n\nROFL.\n\nI imagine a wife nagging her husband that while the neighbors already use 2 nicely matching DTL fonts we only have a license for Courier.\n\n"
    },
    {
      "time": " 29.Nov.2007 12.32pm",
      "content": "I’ve said this in another thread but will repeat it here. Am doing some mandatory and painful PowerPoint training. I am amazed and disgusted by the delivery of the material. It’s all about everything you CAN do, and nothing about WHY you should do it. One thing that would have incredible impact is Microsoft getting rid of “WordArt” (has there ever been anything more offensive to a typographer) and making some effort to educate users of its software about the fundamentals of design, rather than just telling everyone, “Look! You can center it!” “Look! You can make everything a different color!” “Look you can italicize it!” or, of course, the creme de le creme, “LOOK! YOU’VE GOT HUNDREDS OF FONTS TO CHOOSE FROM!!!”\n\nTeaching it in schools? That would require good teachers. Who’s going to educate the teachers?\n\n"
    },
    {
      "time": " 29.Nov.2007 12.46pm",
      "content": "“Teaching it in schools? That would require good teachers. Who’s going to educate the teachers?”\n\nCould they be perhaps guest lecturers instead?\n\nI’ve noticed that for many people it’s quite interesting to hear about the origin of a typeface etc. once they get beyond the feeling that all sans faces look the same. And children use to be excited when they can identify Optima or Futura on a product packaging or posters in the street. But yes, it would be different if they were obliged to do a homework with that subject.\n\n"
    },
    {
      "time": " 29.Nov.2007 1.37pm",
      "content": "“I am amazed and disgusted by the delivery of the material. It’s all about everything you CAN do, and nothing about WHY you should do it.”\n\nPar for the course when it comes to MS products and training.\n\n"
    },
    {
      "time": " 29.Nov.2007 2.20pm",
      "content": "Isn’t this standard for any ’creative’ product - I’m sure the Adobe trainers don’t say, “we include all of these crazy filters but don’t use them as they look crap!”\n\nTeaching kids visual literacy skills shouldn’t involve computers or type - kids should be taught how to create visuals using pen and paper to convey information - charts, maps, etc.,\n\n"
    },
    {
      "time": " 29.Nov.2007 2.21pm",
      "content": "_1. Do you think people/children should get basic information about typography in the context of mandatory education?_\n\nI think children should be educated to use the media prevalent in society. It used to be pen and paper. Now it is keyboard and page layout application.\n\n_2. Would this improve the overall taste and literacy of general public?_\n\nTypographic taste, certainly.\n\n_3. How would you schedule such education?_\n\nAfter learning basic “block letter” writing, before learning cursive script, as per below.\n\n_4. Are there countries that actually made some steps in this area?_\n\nNorway.  \n [http://news.bbc.co.uk/2/hi/uk\\_news/education/3103421.stm](http://web.archive.org/web/20080704152905/http:/news.bbc.co.uk/2/hi/uk_news/education/3103421.stm \"http://news.bbc.co.uk/2/hi/uk\\_news/education/3103421.stm\")\n\n"
    },
    {
      "time": " 29.Nov.2007 2.23pm",
      "content": "<cite>1. Do you think people/children should get basic information about typography in the context of mandatory education?</cite>\n\nNo. To me, typography seems to be about the last thing that everyone must know about — but nothing against offering information for those who seek it! When I was in school, I enjoyed taking part in voluntary courses in my free time (actually, I enjoyed that more than school itself). There weren’t all too many students who weren’t already sated by the chemistry and physics classes they _had_ to take, though, and I doubt that as many would’ve been eager to learn about typography.\n\n<cite>2. Would this improve the overall taste and literacy of general public?</cite>\n\nImprove taste?  \nTeaching about type (or graphic design, for that matter) might help to impart a sense for the related aesthetics, yes, although I consider it to not be terribly relevant whether the general public has good typographic taste or not.  \nBut teaching about type and design might actually have a greater influence on the taste of the public than does teaching about music: some people do have what you might call poor musical taste and you wouldn’t be very likely to change their preferences (if you felt the urge to try), but I assume that people don’t awarely like bad design, they just don’t know any better.\n\nImprove literacy?  \nIf by literacy you mean being educated: yes, obviously (by however much it improves your literacy to know about type), as long as being tought about type doesn’t mean you’re not tought about something possibly more important instead.  \nIf you mean the ability to read, I don’t see a connection to knowing about type.\n\n——\n\nWhen you ponder about the typographic taste of the public, please don’t forget that the life of some designers would be devoid of joy if they couldn’t ridicule Comic Sans and its ubiquitous use.\n\nJens\n\n"
    },
    {
      "time": " 29.Nov.2007 2.32pm",
      "content": "\\>Mandatory music classes education hasn’t done anything to change the public taste for bad music\n\nWhere in the US do they have mandatory music education? According [to this article](http://web.archive.org/web/20080704152905/http:/music-for-all.org/sos.html), in California, for example, there was a huge decline in music education 2000-2004, from about 18% to 9% of students. The problem isn’t bad education but no education, so far as I can see.\n\nI think education in the arts lifts taste. Go to a jazz or classical concert and I bet most of the audience will have played an instrument in school, or learned as a child. I think our country would be a better place with good arts education.\n\nI would like to see design education in high schools. Now art is most often taught only as something expressive. I think some education in design—architecture, product design, and graphic design—would be great, and would lift the taste of the public.\n\n"
    },
    {
      "time": " 29.Nov.2007 2.59pm",
      "content": "This is an interesting idea. I think children learning to write have such open, interested minds. It would be a wonderful time to introduce something about type. Education in the arts lifts more than tastes. I think it lifts the spirit and inspires students to raise their own expectations. Every high school graduate should leave school with a skill they can use to make a living, basic skills in maintaining a home and raising a family, and a serious introduction to at least one of the arts.\n\nSharon\n\n"
    },
    {
      "time": " 29.Nov.2007 5.19pm",
      "content": "<cite>Where in the US do they have mandatory music education?</cite>\n\nVirginia had it when I grew up there in the 1980s and early 1990s. Maybe that has changed.\n\n<cite>I would like to see design education in high schools…</cite>\n\nI am not opposed to general design education in schools; my life would be far better had that been an option. But the original question was specifically about teaching typography. If schools would add design as an option students could explore in the way I studied drafting when I was in school, I could see it as making sense. But just adding typography into education, along with all the other stuff kids are taught, and all of the test-taking skills they have to learn to prove that they’re memorizing all of the random factoids they’re taught, just seems like a bad idea to me.\n\n"
    },
    {
      "time": " 29.Nov.2007 5.55pm",
      "content": "“But just adding typography into education, along with all the other stuff kids are taught, and all of the test-taking skills they have to learn to prove that they’re memorizing all of the random factoids they’re taught, just seems like a bad idea to me.”\n\nIt was not meant this way. (I am opposed to homeworks, test-taking, grades, in relation to typography.) It’s entirely open question. I don’t think of single subject named Typography. Some topics on book and printing history, type basics and so on, could be included in other subjects (art? history?). The questions are: 1. if it should be a part of education, 2. what should be taught, 3. which way it should be taught + how to include it in various subjects, 4. at what age. Of course, it should be clear 5. why - to expand the mental horizons? To improve taste? To better understand the culture? To emancipate typography from an obscure art to its deserved position?\n\n"
    },
    {
      "time": " 29.Nov.2007 6.12pm",
      "content": "BTW, I have the experience with my own kids. They loved to browse through typeface specimens without any guidance or suggestions. It was surely not boring for them compared to any of their schoolbooks. Is that not an opportunity to combine pleasure with some useful knowledge?\n\n"
    },
    {
      "time": " 30.Nov.2007 12.29am",
      "content": "Hi, loremipsum. I don’t have time to read the whole thread right now, but, considering the fact that kids today have access to computers, fonts, and document-creation programs, I don’t think that imparting some basic typographic dos and don’ts is such a bad idea... at least in theory. The so-called “democratization of type and graphics” has done away with years of craft and knowledge, and I don’t think we can ever go back, barring some huge power crisis and/or breakdown of civilization from an overload of useless information bombardment... but I digress. Just as kids should be taught to be media-savvy, read between the lines and not believe everything the newspaper or television says, maybe they should know a minimum of type rules...\n\n_BTW, I have the experience with my own kids. They loved to browse through typeface specimens without any guidance or suggestions._\n\nTypeface specimens in the classroom... Ha! I love it. :-)  \nJust playing devil’s advocate here, but... When I was growing up there were plenty of books at home... but not all of my siblings got into reading for pleasure. Still, if they (the type specimens) are around, the chance of someone discovering and falling in love with type increases...\n\nBy the way, have you seen the [D.I.Y.](http://web.archive.org/web/20080704152905/http:/www.papress.com/designityourself/index.html) series of books by Ellen and Julia Lupton?\n\n"
    },
    {
      "time": " 30.Nov.2007 5.54am",
      "content": "In 2003 at the forum typografie-conference in Essen/Germany we initialized discussion groups. And one them, started by Jay Rutherford, discussed this item – typography at school – for two days. As far as I know, there had been two persons who than began to realize projects in this direction. Sandra Brand gave workshops at a german highschool. Her first aim was to explain the teachers the need of knowledge of typographic basics. And she did it very well, the teachers has been convinced about the idea, what a useful tool typography can be, to facilitate reading and learning by visualizing structures. Karin Schmidt-Friderichs is the other one. She is one of the owners of the well-known Schmidt Verlag in Mainz/Germany. And her aim was, to tell the children directly about type and book-making. I met her at Typo Berlin, and she told me with shiny eyes, how interested the six and seven year-old kids had been in regarding different letterforms, and talking about this – as well as discovering how books are made, and in catching the differences in function. After this succesful experiences Bertram and Karin Schmidt-Friderichs decided this year to establish a foundaton which will bring typography to schools. The first step now, ist to work out a detailled concept for teaching at elemantary schools the basics of designing and manufacturing of books, and in the second step to introduce something like a “driver license for keyboards” at middle and upper school. (More Info: only in german: [http://www.fontblog.de/typografie-paedagogische-stiftung-foerderer-gesuc...](http://web.archive.org/web/20080704152905/http:/www.fontblog.de/typografie-paedagogische-stiftung-foerderer-gesucht \"http://www.fontblog.de/typografie-paedagogische-stiftung-foerderer-gesucht\"))\n\n"
    },
    {
      "time": " 30.Nov.2007 6.32am",
      "content": "“Virginia had it when I grew up there in the 1980s and early 1990s. Maybe that has changed.”\n\nIt absolutely has changed. The arts have been hit the hardest in our public school system.\n\n“But just adding typography into education, along with all the other stuff kids are taught, and all of the test-taking skills they have to learn to prove that they’re memorizing all of the random factoids they’re taught, just seems like a bad idea to me.”\n\nRight...the problem is all the time we’re wasting with the testing and rote memorization that should be better spent on the arts. ;o)\n\n"
    },
    {
      "time": " 30.Nov.2007 8.28am",
      "content": "As a trained and full-time musician, I’m very encouraged by all the parallels fellow typophiles draw to music and music education. I have encountered many similarities among type/design theory and music theory, be they technical, aesthetic, or more esoteric.\n\nBTW, as far as the thread goes, I have mixed feelings about the proposed ideas. The idealist in me says “Bring on the type education!” I do think it may provoke better homemade design, ubiquitous as this stuff seems. However, that would ultimately lead to less work for experienced designers. We’re already becoming a DIY society. To provide education on type and design without solicitation could be akin to the magician revealing the secrets his tricks. Then we’d get a bunch of people who actually know \\*how\\* to design well, but don’t necessarily have the talent to do it with appeal.\n\n???\n\nRegards,  \nRay  \n [http://rkingston.com](http://web.archive.org/web/20080704152905/http:/rkingston.com/ \"http://rkingston.com\")\n\n"
    },
    {
      "time": " 30.Nov.2007 8.39am",
      "content": "I’m working as a teacher in a small school in Bergen, Norway. We use Sasson in all printed material, as well as education. The kids start out reading and writing (using dotted characters at first) in first grade.\n\nI’ve also been suggesting some fonts for a hiphop project we did (we’ve got a large Dr. Dre poster set in Eagle on the wall), as well as other stuff they create, but they tend to choose Comic Sans when ever possible.\n\n"
    },
    {
      "time": " 30.Nov.2007 10.47am",
      "content": "Back to the top:\n\n<cite>Could they be perhaps guest lecturers instead?</cite>\n\nI like this idea so much I might just try it here in my hometown. I think if you gave me just one hour with a group of high school students, I could give them a very valuable Design Fundamentals or Type 101 lecture with slides that would, at the very least, encourage the one or two kids who are interested to learn more. (Surely lots of us could that, but it probably doesn’t pay very well, so it’d have to be thought of more as a civic duty or public service.) Baby steps is a good way to start. We must “be the change we wish to see in the world.” That’s the hard part.\n\n"
    },
    {
      "time": " 30.Nov.2007 11.00am",
      "content": "“I think if you gave me just one hour with a group of high school students, I could give them a very valuable Design Fundamentals or Type 101 lecture with slides that would, at the very least, encourage the one or two kids who are interested to learn more.”  \nGreat! Let us please know what was the response.\n\n“That’s the hard part.”  \nSomeone has to be the first typovangelist :-)\n\n"
    },
    {
      "time": " 30.Nov.2007 12.49pm",
      "content": "My 6 year old (1st grade) likely has ADD (I was diagnosed as an adult and it’s fairly clear he’s got some of the same challenges I had).\n\nHe’s currently in gifted program that seems mainly focused on the 3 Rs, which is a bit frustrating (for him and us), as I find that to not be very balanced curriculum (that and us ADD folks really prefer the hands-on courses).\n\nAnyways, long story short...he has a lot of trouble with handwriting, as it takes a lot of focus and it frustrates him. However, he absolutely loves the computer and typing on it. The other day he was in KidPix and began typing a letter to me. He’d then choose a different font, print it out, and give it to me and ask me if I could read it. He was impressed that I could read blackletter (some dads fix cars to impress their kids, I guess I read blackletter and know fonts ;o). He finally stumped me with WingDings.\n\nIt didn’t occur to me until this thread, but I have done nothing formal with him in terms of talking about graphic design and typography. He simply discovered fonts on the computer on his own and noticed that they are all different.\n\nSo clearly a child even in first grade could benefit a bit from some simple education on things like letterforms.\n\nAfter all, they are learning handwriting alongside of computer typesetting these days. Typography also has great tie-ins to languages, cultures and history as well.\n\n"
    }
  ]
}
