{
  "id": "39570",
  "title": "Fresh or classic? Newspaper fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,\n\nI'm redesigning a daily newspaper that's moving to a tabloid size. It will still be a serious publication, not tabloid in nature. All the daily headlines will be in there, but there will also be a large lifestyle section. At the same time, the editors are keen on a \"fresher\" look, especially since the paper is moving to a new format.\n\nThis newspaper has been through 2-3 redesigns already in the last 10 years, and has moved from Century to Franklin Gothic for display. I like a classic typeface as much as the next person, but I think we are ready for a more contemporary, more energetic feel. At the same time, the pages have to be reader-friendly and legible.\n\nI'm looking for a serif that has a variety of weights, as well as a sans and a slab serif to go with. I absolutely love these serif families with all my heart: Mercury, Farnham, Greta Display, Prensa and Publico. (As you can see, I'm big on x-height). For sans, I lust after Amplitude and Leitura Sans. As for the slab, I would get Freight if the budget allowed, but sadly, it does not.\n\nSo here are the issues.\n\n1. Are the \"spiky\" faces like Farnham too fancy and distracting for news? They would be perfect for the lifestyle section but I fear they will be too \"much\" for news. I have seen Mercury used in a major daily newspaper and got very excited by the letters, but I was looking at it as a designer, not a reader. Should I go back to the drawing board and relook at the classic faces? Or should I seize the opportunity to give the paper a new look? (We will be showing prototypes to focus groups: if they hate it, then well, back to the drawing board)\n\n2. I doubt that the budget will accomodate most of the fonts I've mentioned. What similar or comparable typefaces would you recommend that will be less expensive? Are there typefaces that have serif, slab and sans in the same family?\n\nI apologise in advance if these are issues that have been brought up before. Thanks for your time!\n\n",
  "author": "<a href=\"/web/20100304071714/http://typophile.com/user/24506\" title=\"View user profile.\">friendlyreader</a>",
  "time": "<br>",
  "uid": "24506",
  "comments": [
    {
      "time": "",
      "content": "Well, since you mentioned Leitura Sans... I must say that I'm finishing two new workhorse typefaces: Glosa and Prelo.\n\nGlosa is a serif typeface in three styles: Roman with sharp serifs, News with bracketed serifs and Headline, with x-height matching the small caps. Prelo is a sans with the same x-height as Glosa, and 9 weights from Hairline to Black with matching italics.\n\nIf you want to, send me an email and I don't mind to send you digital specimens of both typefaces, since the fonts aren't available and will not be available that soon.\n\n"
    },
    {
      "time": "",
      "content": "\"We will be showing prototypes to focus groups: if they hate it...\"\n\nThey will. If they don't, you have a problem :)\n\n"
    },
    {
      "time": "",
      "content": "It's good to see you thinking deeply about your type choice for the paper. My first piece advice would be to _print_ every font you're considering, preferably the kind of paper that you'll be using. A 100dpi monitor is no way to test newspaper fonts. Most good foundries have a PDF specimen available, and some suppliers (like FontShop) will supply a PDF with a selection of text formatted to your preference for testing.\n\n\\> \"I doubt that the budget will accomodate most of the fonts I’ve mentioned\"\n\nWhat is your budget? When you're talking about type families, the prices don't differ very much.\n\n"
    },
    {
      "time": "",
      "content": "\\> Roman with sharp serifs, News with bracketed serifs\n\nDino, it's interesting that some \"newspaper\" fonts are bracketed, but others, like [Swift](http://web.archive.org/web/20100304071714/http:/www.gerardunger.com/fontstore/store-swift.html), were designed specifically for newsprint are sharp wedges. Can you say more about your decision to title the bracketed serif a \"News\" face?\n\n"
    },
    {
      "time": "",
      "content": "Well, let's say that when I introduced the Roman version to a designer, he told me he considered it too idiosyncratic.  \nI guess that a bracketed serif looks smooth on body text than sharped serifs. Although I prefer sharped serif typefaces like Greta, Farnham and of course Swift (my favorite typeface of all time).\n\n"
    },
    {
      "time": "",
      "content": "DS - Yes Please!!\n\nwritingdesigning - Ha! Yeaah ... those dang readers... :)\n\nStephen - I wonder if I'm thinking \\*too\\* deeply about the fonts. I've been looking at proofs of pages set with various fonts, but I haven't tested them on newsprint - thanks for reminding me! As for the budget, well, I can't really say because honestly, I don't know what it is. But because the purchase would be for multiple licenses, the cost of buying 2-3 font families would be quite high. So I'm hoping to maybe just ask for one or 2 new fonts, that could match with fonts that we already have (Adobe fonts).\n\n"
    },
    {
      "time": "",
      "content": "Yeah, licensing fonts like that can be expensive, but I think it would be a good investment. Firstly it will make your newspaper look good, secondly you only have to invest once. If you invest wisely, you can use those fonts for years to come. Which would be worth the money.\n\n"
    },
    {
      "time": "",
      "content": "Off-topic: Dino the email I've been sending to you keep bouncing back to me. Are you getting them? (email me)\n\n"
    },
    {
      "time": "",
      "content": "I used Farnham Display for headlines and Mercury Text for body text (with Shaker for captions) when I redesigned my former school's newspaper. When reviewing samples of Mercury and Farnham, I found Mercury smoother to read, although part of this may be colored by Yves' excellent review of the Fleischmann revivals (in the Typographer.org archives). I purposely wanted type that readers would notice; my reasoning was that even if future editors did not design pages very well, the terrific, exciting type would carry the layout.\n\nIf you're concerned about Farnham, you should be aware (if you're not already) that Christian Schwartz made a headline version to tone its quirks down a bit (see it [here](http://web.archive.org/web/20100304071714/http:/www.christianschwartz.com/farnhamhead.shtml)). And if you're concerned about cost, before I bought Shaker I used Myriad Pro as the complement and it worked quite well. I just wanted more style, even in the captions.\n\nEDIT: I've also been compiling a list of newspaper types, and I think mine is now pretty exhaustive. You actually mentioned most of my absolute favorites, but you may also want to consider Chronicle from Hoefler & Frere-Jones, Arnhem from OurType, Lexicon from The Enschede Font Foundry, Eudald from Feliciano Type Foundry, Leyden from Psy/Ops, and Houston from Christian Schwartz.\n\n"
    },
    {
      "time": "",
      "content": "You can try out [Brown](http://web.archive.org/web/20100304071714/http:/www.shinntype.com/brown.html) and [Worldwide](http://web.archive.org/web/20100304071714/http:/www.shinntype.com/worldwide.html) at headline size online, with my new type tester.  \nDon't forget to check out the PDFs too.\n\nThey are a proven, matched serif+sans news type system with text and headline variants. Both are good for tabloid size, as they have a large x-height, quite short descenders, and semi-condensed proportions.\n\n"
    },
    {
      "time": "",
      "content": "/ Yeah, licensing fonts like that can be expensive, but I think it would be a good investment. Firstly it will make your newspaper look good, secondly you only have to invest once. If you invest wisely, you can use those fonts for years to come. Which would be worth the money. /\n\nQuincunx - That's exactly what I'll be telling our Finance department :)\n\nAuricfuzz, NickShinn - Thanks for the suggestions. I did consider Chronicle, but I still prefer Mercury/Farnham/Greta. I noticed that the Farnham Headline is listed under \"custom\" type rather than retail, but it says in the description that Farnham Headline is available to publication designers - I'll have to go see what that means. Meanwhile, I'm growing quite attached to Dino's Glosa. (Except for the yen sign - sorry Dino!)\n\n"
    },
    {
      "time": "",
      "content": "[edited & so out of order]\n\nFriendlyreader, I think it's a good idea to gather information by calling/e-mailing all the foundries whose types you are considering. These discussions, with questions and suggestions will mean you are able to make a decision you will be satisfied is the best one. As the buyer you are in the driver's seat, so make them work for you :)\n\n"
    },
    {
      "time": "",
      "content": "William - I'm onto it :)\n\n"
    }
  ]
}
