{
  "id": "39592",
  "title": "Choosing a font for book design?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm sure this has been a thread at some point, but doing a search didn't show me what I was looking for, so if I just need to be redirected, go for it. :-)\n\nThe situation is this- I have a book I need to format for someone (my dad actually) and am already stuck- trying to decide what font to use!\n\nThe only info I'm beginning with is that I'd like to use serif, having heard more than once that sans serif is inadvisable for books.\n\nI would like to give a better idea of what I'm looking for, but my ignorance has got the best of me here. The book is non-fiction, essentially about ethics, society, agnosticism, serious schtuff like that. :-)\n\nSo if anyone has suggestions of fonts I can try, I'm all ears. I'm also open to suggestions regarding books about fonts for books, but that is more long term, as I need to begin formatting this book yesterday.\n\nThanks for any advice you can give,  \nGertie\n\n",
  "author": "gertie",
  "time": "29 Nov 2007 — 8:52pm",
  "uid": "24533",
  "comments": [
    {
      "time": "29 Nov 2007 — 9:20pm",
      "content": "<cite>I need to begin formatting yesterday</cite>\n\nThen [this book](http://web.archive.org/web/20150415100132/http:/tinyurl.com/yo6bhq) might be the one for you.  \nI have read it and can recommend it.\n\n,-)\n\n"
    },
    {
      "time": "29 Nov 2007 — 9:36pm",
      "content": "When in doubt, just use Adobe Caslon.\n\n"
    },
    {
      "time": "30 Nov 2007 — 6:31am",
      "content": "I've used [Dolly](http://web.archive.org/web/20150415100132/http:/www.underware.nl/site2/index.php3?id1=dolly&id2=overview) before. I like it. :)\n\n"
    },
    {
      "time": "30 Nov 2007 — 6:35am",
      "content": "_When in doubt, just use Adobe Caslon._\n\nWAY too funny. Is that this millennium's version of \"When in doubt, use Caslon\"?\n\n"
    },
    {
      "time": "30 Nov 2007 — 6:48am",
      "content": "<cite>WAY too funny. Is that this millennium’s version of “When in doubt, use Caslon”?</cite>\n\nLike I said in another thread, everybody likes it, nobody notices it, nobody complains about it.\n\n"
    },
    {
      "time": "30 Nov 2007 — 8:59am",
      "content": "Baskerville reads nicely too. Also Adobe Garamond, Minion, Fournier, Dante, Bembo, Sabon. If you want you could use a sans for some of the heads.\n\n"
    },
    {
      "time": "30 Nov 2007 — 11:48am",
      "content": "Thanks for the responses so far- tonight I'm gonna take a look at the fonts mentioned here and see how they strike me. No doubt money will come into the factoring at some point. :-(\n\nI do plan to use sans for the chapter headings, but at least that decision I'll be able to handle more easily. Sort of.\n\nThanks!\n\n"
    },
    {
      "time": "30 Nov 2007 — 12:14pm",
      "content": "Minion is lovely, great for continuous reading, and very beloved by most designers.\n\n"
    },
    {
      "time": "2 Dec 2007 — 8:23am",
      "content": "Yes, to each and every one of the types mentioned here. I've used most of them. I'd throw Usherwood and Cheltanham into the mix, too, tho’, of them, my personal favorites are Bembo and Adobe Garamond. Don’t laugh, I also happen to think that Palatino is an elegant-looking face for extended stretches of text. That said—and despite my ranting about the current, exasperating overuse of sans serifs for book body text on any number of blogs—including [my own](http://web.archive.org/web/20150415100132/http:/www.tianodesign.com/blog)—I’m trying to steel my nerve for using Optima if the right project comes along.\n\nOne thing, if you want to approach this like a book designer—and this needn’t take a chunk of time out of your life ... Start by reading just a few paragraphs explaining type classification: the differences between Old Style, Transitional, etc. Then look at some types from different periods and places. Finally, take a look at the material your dad has written about and consider whether there’s a type that just seems to naturally go with his book in your eyes.\n\n"
    },
    {
      "time": "3 Dec 2007 — 8:57am",
      "content": "Wow, it's the fogey types revue. Cheltenham.... Shuffleboard anyone? How about some new, excellent book types? Dolly is the only 21st-century type here (and most mentioned are 19th century).\n\nFreight  \nFarnham  \nMiller  \nMercury  \nPrensa  \nProforma  \nWhitman  \nArnhem  \nFresco  \nVersa  \nScala  \nKingfisher  \nChaparral  \nMerlo  \nCorundum  \nFeijoa  \nEudald  \nRongel  \netc....\n\n"
    },
    {
      "time": "3 Dec 2007 — 11:55am",
      "content": "The new featured font may suit your needs (if not your budget)\n\n"
    },
    {
      "time": "4 Dec 2007 — 12:01pm",
      "content": "\\> How about some new, excellent book types?\n\nWay to go, Carl!\n\nHere's something maybe more important than which specific face you choose: find a face you know will have all the elements that make for good book typography. Roman + italic, of course. Small caps, and maybe even italic smalls. Semibold, with italic & smalls, if you need subheads. Do you have notes? Then get superiors and stay away from the false ones.\n\nMake sure you get faces that suit text and body copy to use for chapter numbers and chapter titles.\n\n& see if you can find some university press books in those areas Dad wrote about and look at them. Do not steal, but get ideas. Buy or borrow a copy of Richard Hendel's \"On Book Design.\"\n\nGood luck. Have fun.\n\npowers\n\n"
    },
    {
      "time": "4 Dec 2007 — 4:11pm",
      "content": "Crossgrove, I applaud your willingness to avoid the trite, the overdone, and types that are used more out of habit than anything else. However, Cheltenham is none of those.\n\nWhen I see an excellent, new type that suits a book, I’ll use it. I can’t say, however, that anything in your list—save for the Scala—comes even close to overwhelming me.\n\n"
    },
    {
      "time": "4 Dec 2007 — 4:56pm",
      "content": "Eh, Steve,\n\nI hope that is not your main criterion in selecting a book typeface?....\n\nBut I would seriously like to know which of the above (or other recent book types) you have tested in actual settings (i.e. in print)?\n\nWill's point is well taken; sometimes you delight in the initial appearance of a new face, only to discover it is missing essential parts, making it useless for certain kinds of projects.\n\n"
    },
    {
      "time": "5 Dec 2007 — 4:47am",
      "content": "But for printing a longish sample of Scala a while back, I can’t say that I have printed any of them. But I’ve been doing book design and layout that I have a sense of how things translate from pixels to paper. I don’t mean to be argumentative, and I’m not trying to insult anyone’s heartfelt work, I simply meant that none of those types do anything for me: there’s no visceral response that just works it’s way to me, telling me I want to work with any of those faces, was all I meant. Whereas Cheltenham—perhaps marking me as a geezer, I admit—still has a nice “readerly” look to it ... in my eyes.\n\nBut do keep the suggestions coming, as I’d be thrilled to discover some new faces that shout “Book! Book!”\n\n"
    },
    {
      "time": "5 Dec 2007 — 5:22am",
      "content": "Jeez. I've been typesetting -- and occasionally designing -- books for over 25 years. I guess that makes me an old fogy.\n\nHow to be with it (if that's still an acceptable hip term) is to go to a catalog of a juried book show, and see what fonts the designers who got the most books in the show used.\n\nThen increase the leading. If they set 10/15, you set 10/18.\n\nIgnore what the book is about. Ignore the audience (who's going to read it). After all, the biggest design problem is designer boredom. Solve that, and everything else falls into place.\n\nAnd since I seem to be filled with vitrol this morning, to Will Powers: Why in the world would you use boldface for subheads? I can see it in a travel book, where the reader is skipping around, trying to find only what interests him/her. But in a book to be read continuously, a subhead simply takes the place of a paragraph used to transit from one topic to another. You don't need to ruin the color of the page by using boldface.\n\nBut back to the original question: what's the book about? Who (aside from your dad) is going to read it?\n\n"
    },
    {
      "time": "5 Dec 2007 — 5:47am",
      "content": "I was going to stay out of this, but now I can't help myself.\n\nI have to say that Cheltenham is one of the most unlikely and idiosyncratic choices I can think of for setting book text.\n\nBut that's speaking in generalities. I suppose I would have to consider which specific Cheltenham we're talking about (please tell me \\*not\\* ITC Cheltenham) and what the nature of the book is -- format, topic, audience. Even so, I have a hard time swallowing it.\n\nI, too, applaud Carl's list and his perspective -- even though I will confess that there are a handful of faces on his list that I would not likely employ for book work. But maybe that's just the books I work on.\n\nI do use Miller regularly; it's a standard for me. I've used Mercury with modest success (but I think that's just me getting used to it -- the face has the right qualities and attributes to recommend it, especially with the grades to play with). And of course, Whitman now and then (what can I say? ;-).\n\nI've worked with Chaparral and it can serve in certain contexts. (The page design wasn't mine, and I was skeptical at first, but came to terms with it.) I've seen Will use it to good effect.\n\nI've admired Merlo and Rongel, but haven't had a chance to get close enough to them to be certain. Kingfisher, too, holds great promise and has been recommended by designers whose judgment I value. Arnhem has been highly recommended, and I've been keeping my eye on it.\n\nHowever, I have mixed feelings about Scala. I admired the design when it was released, but I just don't care for it in books. It's certainly been done often enough (I noticed there was a raft of Scala in last year's AAUP award winners), but it's too stiff and clunky for me in book text. (This was, in fact, part of the impetus to develop Whitman.)\n\nAnd much as I admire Farnham and Prensa as designs and for periodicals, I find they are too distracting in book text for my taste. I'm afraid the same might hold true for Feijoa (again, much as I admire it); but I'm willing to suspend final judgment until I've had occasion to put it through more paces.\n\nAll that said, Carl's is a pretty solid list. Even those I have dismissed, I might reconsider under the right circumstances, with the right manuscript.\n\n-- K.\n\n"
    },
    {
      "time": "5 Dec 2007 — 7:09am",
      "content": "I wish Carl's list had links. I couldn't easily track down some of his suggestions.\n\nI haven't used Cheltenham for running text in about 20 years. I'm a bit of an old fogy too but it reminds me of the 80s, as does Goudy.\n\nUnfortunately I haven't bought a new serif font in awhile because if I'm going to buy a font for text use I want the complete family and I just haven't had the money recently. I have my eye on Atma and Miller.\n\nBut I think for a book where the text is the thing, not the design, Janet would be wise to stick with a font that doesn't have too much personality, which is why some of Carl's fonts might not work for her. Chaparral for example, I keep trying to use it and it always seems to fall short. I can't articulate why.\n\n"
    },
    {
      "time": "5 Dec 2007 — 10:28am",
      "content": "<cite>I wish Carl’s list had links.</cite>\n\nHere you go … I wanted to track them down myself, too –&nbsp;and in doing so I ran across a fascinating foundry (FTF) that I haven’t had heard of before, shame on me.\n\n- [Freight](http://web.archive.org/web/20150415100132/http:/www.joshuadarden.com/shop/freighttext.php)\n- [Farnham](http://web.archive.org/web/20150415100132/http:/www.fontbureau.com/fonts/Farnham)\n- [Miller](http://web.archive.org/web/20150415100132/http:/www.fontbureau.com/fonts/Miller)\n- [Mercury](http://web.archive.org/web/20150415100132/http:/www.typography.com/fonts/font_overview.php?productLineID=100017)\n- [Prensa](http://web.archive.org/web/20150415100132/http:/www.fontbureau.com/fonts/Prensa)\n- [Proforma](http://web.archive.org/web/20150415100132/http:/www.fontbureau.com/fonts/Proforma)\n- [Whitman](http://web.archive.org/web/20150415100132/http:/www.fontbureau.com/fonts/Whitman)\n- [Arnhem](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=Arnhem)\n- [Fresco](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=fresco)\n- [Versa](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=Versa)\n- [Scala](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=Scala)\n- [Kingfisher](http://web.archive.org/web/20150415100132/http:/www.typography.net/type/kingfisher.htm)\n- [Chaparral](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=Chaparral)\n- [Merlo](http://web.archive.org/web/20150415100132/http:/www.felicianotypefoundry.com/main/?page_id=13)\n- [Corundum](http://web.archive.org/web/20150415100132/http:/www.joshuadarden.com/shop/corundumtext.php)\n- [Feijoa](http://web.archive.org/web/20150415100132/http:/www.vllg.com/KLIM/Feijoa/mudTyper+Weights/)\n- [Eudald](http://web.archive.org/web/20150415100132/http:/www.felicianotypefoundry.com/main/?page_id=88)\n- [Rongel](http://web.archive.org/web/20150415100132/http:/www.felicianotypefoundry.com/main/?page_id=22)\n\n"
    },
    {
      "time": "5 Dec 2007 — 10:54am",
      "content": "\\> Why in the world would you use boldface for subheads?\n\nCharles: I did not suggest \"bold\" for subs. I just checked my post and it said \"semi-bold\", and I believe there's valid reasons for using semi-bold as subs in many texts. I very rarely use bold in books, and discourage its use by freelancers who design for us.\n\nBut keep that vitriol flowing, Charles. It keeps us geezers young and healthy. And likable. All your other comments are vitriolically valid.\n\nI'd never use Chelt for anything in a book except maybe a chapter number. & for the work I do I find very little to like in Adobe Caslon or Adobe Garamond. Chaparral is hard to use well, for sure.\n\npowers\n\n"
    },
    {
      "time": "5 Dec 2007 — 11:17am",
      "content": "Oh Florian can you do these too?\n\nKIDDING! I'm sorry I'm so lazy about linking. It's easier now so I will try not to leave items unlinked.\n\n[MVB Verdigris](http://web.archive.org/web/20150415100132/http:/www.mvbfonts.com/html/fonts/verdigris/pk_verdigris.htm)\n\n[Paperback](http://web.archive.org/web/20150415100132/http:/www.houseind.com/index.php?page=showfont&id=171&subpage=viewfonts)\n\n[Joanna](http://web.archive.org/web/20150415100132/http:/www.fonts.com/FindFonts/RecentReleases/2007/JoannaPro.htm)\n\n[Haarlemmer](http://web.archive.org/web/20150415100132/http:/www.fonts.com/findfonts/detail.htm?pid=431926&grab_id=0&page_id=9730&query=Haarlemmer&SCOPE=Fonts)\n\n[Celeste 1 and 2](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=celeste&x=0&y=0) (with a Sans counterpart)\n\n[Clifford](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/fontfont/ff_clifford/)\n\n[Maiola](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/fontfont/ff_maiola/)\n\n[Quadraat](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/fontfont/ff_quadraat/) (also with a Sans counterpart)\n\n[Beorcana](http://web.archive.org/web/20150415100132/http:/www.fonts.com/findfonts/detail.htm?pid=433479&grab_id=0&page_id=32581&query=beorcana&SCOPE=Fonts)\n\n[Hollander](http://web.archive.org/web/20150415100132/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns06.html)\n\n[Paradox](http://web.archive.org/web/20150415100132/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns17.html)\n\n[Cycles](http://web.archive.org/web/20150415100132/http:/www.stonetypefoundry.com/cyclesoverview.html)\n\nSteve, at the risk of seeming to nag, while you may feel confident estimating the performance of book types by viewing them onscreen, I think it's unrealistic to think that is enough information. I would have had a more harsh reaction to the idea of Cheltenham for books, except I took a look at the ITC Cheltenham specimen, and while I understand Kent's and others' revulsion, I can see how the Book weight could be used at small sizes. I think this is due to its large x-height, and would be possible only with generous tracking. It wasn't really possible for me to make an estimation of its capabilities without that real example. I encourage you to make more of an effort to research these new faces; If you get PDF specimens and print them out at 1200 dpi, you might be surprised to discover that some of them are indeed valuable, appealing workhorses.\n\n"
    },
    {
      "time": "6 Dec 2007 — 1:11pm",
      "content": "I've had great success with Delicato. And I particuarly like Delicato italic. It also has old style numeral's which I think works beautifully for non-fiction titles that contain many dates and statistics.\n\nMandi\n\n"
    },
    {
      "time": "13 Feb 2008 — 3:52am",
      "content": "wow!  \nI have bookmarked this thread!  \nSome excellent typefaces here!\n\nThanks!\n\n"
    },
    {
      "time": "13 Feb 2008 — 5:49am",
      "content": "Now that this is back up here, what would be recommended if I had to use a sans? (I'm interested in sci-fi) I think optima would probably be best, as it's almost semi-serif.\n\n"
    },
    {
      "time": "13 Feb 2008 — 12:14pm",
      "content": "_When I see an excellent, new type that suits a book, I’ll use it. I can’t say, however, that anything in your list—save for the Scala—comes even close to overwhelming me_\n\n_But for printing a longish sample of Scala a while back, I can’t say that I have printed any of them._\n\n_But I’ve been doing book design and layout that I have a sense of how things translate from pixels to paper._\n\nAre you joking, Steve? Please don't tell me that you're judging these typefaces based on what you see on screen.\n\n—K\n\n"
    },
    {
      "time": "14 Feb 2008 — 5:19am",
      "content": "<cite>what would be recommended if I had to use a sans?</cite>\n\nHere are a couple of diverse non-grotesque, rather [humanist](http://web.archive.org/web/20150415100132/http:/www.typophile.com/node/35301) [sans serif](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/sans%20serif) typefaces that could possibly be used in books – even though I won’t unreservedly recommend all of them for _novels_.  \nAnd: Of course, some of them rather are ‘some-serifs’, or ‘stressed sans-serifs’, or ‘serifless romans’ …\n\n- [Beorcana](http://web.archive.org/web/20150415100132/http:/www.beorcana.com/) and [Mundo Sans](http://web.archive.org/web/20150415100132/http:/www.fonts.com/findfonts/detail.asp?pid=403346) by [Carl Crossgrove](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Carl%20Crossgrove)\n- [Optima nova](http://web.archive.org/web/20150415100132/http:/www.linotype.com/54142/optimanova-family.html) by [Hermann Zapf](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Hermann%20Zapf), [Akira Kobayashi](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Akira%20Kobayashi)\n- [Amira](http://web.archive.org/web/20150415100132/http:/fontbureau.com/fonts/Amira) by [Cyrus Highsmith](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Cyrus%20Highsmith)\n- [Syntax](http://web.archive.org/web/20150415100132/http:/www.linotype.com/1518/syntax-family.html) by [Hans Eduard Meier](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Hans%20Eduard%20Meier)\n- [Magma](http://web.archive.org/web/20150415100132/http:/www.stonetypefoundry.com/magmaoverview.html) and [Stone Sans](http://web.archive.org/web/20150415100132/http:/www.stonetypefoundry.com/itcstoneoverview.html) by [Sumner Stone](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Sumner%20Stone)\n- [FF Legato](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/singles/fontfont/ff_legato_ot_regular/) by [Evert Bloemsma](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Evert%20Bloemsma)\n- [Eva](http://web.archive.org/web/20150415100132/http:/www.ourtype.be/) by [Merel Matzinger](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Merel%20Matzinger) & [Fred Smeijers](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Fred%20Smeijers)\n- [Alinea Incise](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/presence_typo/alinea_incise/) by [Thierry Puyfoulhoux](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Thierry%20Puyfoulhoux)\n- [Angie](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=FF+Angie) by [Jean François Porchez](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Jean%20Fran%C3%A7ois%20Porchez)\n- [Legacy Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/itc/itc_legacy_sans/) by [Ronald Arnholm](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Ronald%20Arnholm)\n- [Scala Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/fontfont/ff_scala_sans_ot/), [Seria Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/fontfont/ff_seria_sans_pro/) and [Nexus Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/fontfont/ff_nexus_sans_pro/) by [Martin Majoor](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Martin%20Majoor)\n- [Versa Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=versa+sans) by [Peter Verheul](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Peter%20Verheul)\n- [Fresco Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=fresco+sans) and [Quadraat Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=Quadraat+Sans) by [Fred Smeijers](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Fred%20Smeijers)\n- [Today Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=today%20sans) by [Volker Küster](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Volker%20K%C3%BCster)\n- [Caspari](http://web.archive.org/web/20150415100132/http:/www.dutchtypelibrary.nl/Caspari_rdrct.html) by [Gerard Daniëls](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Gerard%20Dani%C3%ABls)\n- [Haarlemmer Sans](http://web.archive.org/web/20150415100132/http:/www.dutchtypelibrary.nl/HaarlemmerSans.html) by [Frank E. Blokland](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Frank%20E.%20Blokland)\n- [Relato Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/emtype/relato_sans_ot_family/) by [Eduardo Manso](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Eduardo%20Manso)\n- [Celeste Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/search/?q=celeste+sans) and [Pragma](http://web.archive.org/web/20150415100132/http:/www.myfonts.com/fonts/neufville/pragma-nd/) by [Chris Burke](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Chris%20Burke)\n- [Ronnia](http://web.archive.org/web/20150415100132/http:/type-together.com/ampl_font.php?idpuente=11&nomfuente=Ronnia) by [Veronika Burian](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Veronika%20Burian) & [José Scaglione](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Jos%C3%A9%20Scaglione)\n- [Finnegan](http://web.archive.org/web/20150415100132/http:/www.linotype.com/1034/finnegan-family.html) and [Agilita](http://web.archive.org/web/20150415100132/http:/www.linotype.com/183977/agilita-family.html) by [Jürgen Weltin](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/J%C3%BCrgen%20Weltin)\n- [Bliss](http://web.archive.org/web/20150415100132/http:/www.typography.net/type/blisspro.htm) by [Jeremy Tankard](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Jeremy%20Tankard)\n- [Strada Text](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/fontfont/ff_strada_text/) by [Albert Pinggera](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Albert%20Pinggera)\n- [Fedra Sans](http://web.archive.org/web/20150415100132/http:/www.typotheque.com/site/fonts.php?id=1) by [Peter Biľak](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Peter%20Bi%C4%BEak)\n- [Argo](http://web.archive.org/web/20150415100132/http:/www.dutchtypelibrary.nl/Argo_rdrct.html) by [Gerard Unger](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Gerard%20Unger)\n- [Grotext](http://web.archive.org/web/20150415100132/http:/www.kltf.de/kltf_grotext.htm) by [Karsten Luecke](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Karsten%20Luecke)\n- [Sebastian](http://web.archive.org/web/20150415100132/http:/www.stormtype.com/typefaces-fonts-shop/families-42-sebastian) by [František Štorm](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Franti%C5%A1ek%20%C5%A0torm)\n- [Freight Sans](http://web.archive.org/web/20150415100132/http:/www.fontshop.com/fonts/downloads/garagefonts/freight_sans/) by [Joshua Darden](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/Joshua%20Darden)\n\nThere is [another list with contemporary sans serifs](http://web.archive.org/web/20150415100132/http:/www.typophile.com/node/13281#comment-77403) (I’d call them ‘reading/text sans’, not ‘book sans’).  \nF\n\n"
    },
    {
      "time": "14 Feb 2008 — 1:39pm",
      "content": "What does the coloration of the little \"w\" mean, and I don't suppose you could put the in order of preference or highlight favorites for me?\n\n"
    },
    {
      "time": "14 Feb 2008 — 2:59pm",
      "content": "Great thread. I can't comment on Cheltenham because I set nothing but for two years on a compugraphics platform.\n\nI'm reading a book set in Eldorado and it is driving me nuts. I don't think I've ever been so distracted. Anyone have an example where they feel Eldorado really is well used? I'd love to see that, and some good Cheltenham so i can erase my bias.\n\n"
    },
    {
      "time": "14 Feb 2008 — 2:40pm",
      "content": "_The little red w means a Wiki link_\n\nred means there is no existing [typowiki](http://web.archive.org/web/20150415100132/http:/typophile.com/wiki/typowiki) article as yet, green means there is an entry for this topic in the wiki.\n\n"
    },
    {
      "time": "15 Feb 2008 — 3:12am",
      "content": "Of the types mentioned, I would second Freight Text and Minion. Bringhurst set his \"bible\" in Minion. There are many other good suggestions as well.\n\nI would also like to suggest Cycles Eleven: [http://www.stonetypefoundry.com/cyclesoverview.html](http://web.archive.org/web/20150415100132/http:/www.stonetypefoundry.com/cyclesoverview.html \"http://www.stonetypefoundry.com/cyclesoverview.html\")\n\nAnd, yes, I own all three.\n\nBoth Freight Text and Cycles are beautiful \\*and\\* extraordinarily readable. Cycles lacks bold italic. The heavier you go in Freight Text, the more the italic loses its neutrality. Depending on how you use it, that may be a good thing or not.\n\nTwice in the last six months, Cycles was available at MyFonts for half price; not so now.\n\nI have Cheltenham, but I've never used it, mostly because I think it looks ugly.\n\nWhile some may argue for personal preference, I agree with Colin Wheildon that setting a book in Sans Serif is not a good idea. Good for a STOP sign but not for a book.\n\n"
    },
    {
      "time": "15 Feb 2008 — 11:46am",
      "content": "\"While some may argue for personal preference, I agree with Colin Wheildon that setting a book in Sans Serif is not a good idea. Good for a STOP sign but not for a book.\"\n\nThe problem I have with this and other iterations of the sentiment is that it pre-emptively collapses every example of \"sans\" into a single abstract idea, somehow made binarily opposed to the similarly generic and abstract idea of \"serif\". It's the most oversimplified, thoughtless, outdated trope that unfortunately still has currency with otherwise intelligent designers. Consider:\n\nIs digital Bauer Bodoni, at 9 points, set solid, printed in a weak gray ink on hard glossy paper, necessarily, categorically easier to read, safer, more advisable than Syntax, at 11/14, in a rich black ink on soft off-white paper? This is one possible interpretation of the \"axiom\" being repeated above. It isn't enough to simply say that this exception proves the rule, since every real-world example you can think of is an exception.\n\nThere are so many different typefaces under the heading of \"Sans\" and so many \"Serif\" that the very idea that \"serif is better than sans for books\" now sounds like something you say when you have no other information, or have no ability to discern the differences between typefaces. It's not a visual idea at all. It made a lot more sense in the early 20th century when the available range of types was so much more limited, but this is a very different world typographically, and readers have evolved as well. What constitutes a \"Sans\" typeface has expanded and grown considerably more complex since this kind of distinction was first made. The evolution of the Sans letter has been a very recent and very sudden one.\n\nIt may cause a number of readers here to become defensive and reach for their Updike and Morison for reinforcement, but I challenge you all to perform with your own eyes, the actual, literal act of reading text set in some of the newer sans designs (see Florian's list above) and compare them with our \"classics\" like Bodoni, Garamond 3, Cheltenham, Bookman, Palatino, Trump Mediaeval, or any other faces considered acceptable or safe for book text.\n\nMy contention is that this sentiment, this axiom, this truism of typography is an unexamined myth, waiting to be disproved by the simple act of direct engagement with the real typographic scene of today. It is an echo of earlier times, before the sans letter had undergone the enormous, rich and rapid evolution it has undergone during the last century. Right now, it's 2008, and Florian's list is a very useful bellwether of the changes the genre of \"Sans\" has undergone since Updike and Morison were even alive.\n\nI've done my part by designing a typeface for book text that has no serifs. Others have existed, and more are on the way. If you want a printed specimen of Beorcana, which is a real example of its actual performance, contact me. As always, judging typefaces online for book text is useless.\n\nRepeating a tired axiom from decades past only limits you, leaving you prejudiced, blind and unable to take advantage of recent advances. Join the 21st century.\n\n"
    },
    {
      "time": "15 Feb 2008 — 12:06pm",
      "content": "BRAVO! Carl! Too many people have a way of pigeonholing things into categories and assuming that their task has brought more meaning to the value of the things sorted. There is no definitive statement made by any study that takes to task the individual conditions of every typeface in composed use. The task is just too daunting and too cloudy to take for much value. How nice and simplistic it would be if we just applied such a simple litmus test as sans vs serif but it just ain't so.\n\nChrisL\n\n"
    },
    {
      "time": "15 Feb 2008 — 4:16pm",
      "content": "You know, a study on why sans have been cast as inferior in legibility would be very informative in the construction and usage of fonts in general.  \nI can see several differences that could be looked at: the serifs themselves, line width variation (humanist sans seem to be a recent development), weight (sans are often heavier), spacing, and letter shape.\n\nA good idea would be to take a wide variety of serif fonts, and slice off the serifs and line endings, which would be saved separately as serif sets. Then, a variety of sans serif fonts and the castrated fonts from earlier would be taken, to each of which each serif set would be applied, as well as Optima, Albertus, and Candara-style flarings and finishing off the castrated serifs as sans (given that different sans use different cuts [this being one of the main differences between Helvetica and Arial], various endings from sans could also be added to the mix-and-match). This would, of course, require great skill, as tailoring would be necessary for each combination, and potentially tens of thousands of man-hours.  \nAfter this, the various combinations could be tested for legibility. Due to the large number of combinations, this test would be much simpler than it would be for single fonts (though finding enough people would be tough). The scores could than be tied to each feature, so there would be an average of all scores of combinations with geometric builds and an average for old style serifs.\n\n"
    },
    {
      "time": "15 Feb 2008 — 5:02pm",
      "content": "A serif font is designed, not a stick on version of a sans with castrated appendages affixed. The whole issue is not one of \"does it have serifs\" as it is \"Is it a good typeface\".\n\nChrisL\n\n"
    },
    {
      "time": "16 Feb 2008 — 5:15am",
      "content": "Carl -- A very impassioned and eloquent argument. Well said.\n\n-- K.\n\n"
    },
    {
      "time": "16 Feb 2008 — 3:05pm",
      "content": "\"Is digital Bauer Bodoni, at 9 points, set solid, printed in a weak gray ink on hard glossy paper, necessarily, categorically easier to read, safer, more advisable than Syntax, at 11/14, in a rich black ink on soft off-white paper?\"\n\nComparing a worst possible case for a serif font with a best possible case for a sans is ludicrous.\n\n"
    },
    {
      "time": "16 Feb 2008 — 3:17pm",
      "content": "\"Comparing a worst possible case for a serif font with a best possible case for a sans is ludicrous.\"\n\nNot really. When the point you are making is that the presence or absence of serifs is not the whole story, it is a good way to show how other things are operating.\n\nChrisL\n\n"
    },
    {
      "time": "17 Feb 2008 — 8:40am",
      "content": "Great argument, Carl. Well spoken.\n\n"
    },
    {
      "time": "17 Feb 2008 — 4:25pm",
      "content": "What a great thread to introduce people to the new typefaces that are out there. Very damaging to the wallet though, unfortunately. Feijoa is looking pretty good to me at the moment!\n\n"
    },
    {
      "time": "19 Feb 2008 — 12:04am",
      "content": "Gertie, there are two fonts that are ALWAYS successful in books, even with the wrong leading/formatting: Sabon and Janson, both with oldstyle figures. You can NEVER go wrong with either of these. Just remember to always use old-style figures, and be very careful about throwing in sans-serifs: the combo usually looks vulgar in a book.\n\nBeyond that, my vote is for fat (Adobe Caslon or MT Plantin with OSF) over slightly condensed letter forms, like Minion. I disagree with one poster's aversion to Scala in books: I feel it looks great. Josh Darden's re-think of Fournier, Corundum, is just outstanding. Then there are all the options re periods and themes: mid-19th-century is effectively called up by ITC Bodoni 12, and earlier 1800s by either Storm's version of Walbaum or Richard Beatty's of Kennerley. For evocations of late 18th century French typography, we're still needy: Sirenne and Acanthus are just too heavy to work properly in today's book designs.\n\nWe still have a horrible problem with foundries releasing text families that lack bold and/or bold italic. There are lots of manuscripts that call for bold somewhere, and a publisher does not want to hear he can't get something in bold. This is why Clifford and Requiem have not swept the design field: they are shamelessly incomplete!\n\n"
    },
    {
      "time": "19 Feb 2008 — 6:35am",
      "content": "<cite>Gertie, there are two fonts that are ALWAYS successful in books, even with the wrong leading/formatting: Sabon and Janson, both with oldstyle figures.</cite>\n\nI like Sabon but I find Janson's italics very hard to read, like Caslon's. I wouldn't recommend that font for a book that might have a lot of italic text.\n\nI don't miss the bold in Requiem (altho I'd love fractions!) or in most other serif fonts. In general I don't use a lot of bold serif fonts. Sans serif bold, yes.\n\nI am going to bookmark this page too next time I want to go on a font spending spree. There are some excellent suggestions here, some I knew already, others not. I must confess to not liking stressed sans in general which cuts out (for me) much of Florian's list.\n\n"
    },
    {
      "time": "19 Feb 2008 — 10:40am",
      "content": "Hmm. Let's seen now.\n\nJohn D. Berry \"quite happily read a novel that was typeset in Optima\" and Pattyfab \"would not read a novel in Optima, just as a matter of principle.\" ( [http://www.typophile.com/node/41586](http://web.archive.org/web/20150415100132/http:/www.typophile.com/node/41586 \"http://www.typophile.com/node/41586\")) OK, so different strokes for different folks.\n\nAnd Pattyfab confesses to \"to not liking stressed sans in general.\" Fine.\n\nBut let _me_ suggest that serif is better suited to extended text than sans, and, in a pompous, arrogant, demeaning tone Carl Crossgrove essentially brands me a Luddite.\n\n\"I've done my part by designing a typeface for book text that has no serifs.\" Whoopee do, Carl, does that \"disprove the unexamined myth\"? Does your new sans text font rewrite 500 years of typographic practice? You _could_ use Curlz to typeset a book. I could come up with some scenarios where Curlz looks better than a sans, if you want to use ludicrous examples as Carl did. What does that prove?\n\nIf you really examined \"the myth,\" Carl, you'd find that there have been numerous studies over decades and, at best, they're inconclusive or contradictory.\n\nI have no problem with any typeface anyone wants to set their book or magazine or newspaper in. My principle in refusing to read any text is whether or not it is easy and pleasant (i.e., not difficult or annoying) to read.\n\nI'm open to lots of things, setting text in sans included. I'm not open to snotty, condescending diatribes like Carl's.\n\nIs civility so hard?\n\n"
    },
    {
      "time": "19 Feb 2008 — 2:19pm",
      "content": "Steve,\n\nBefore we get to civility, try re-reading my post. Note what I was responding to. Does your \"stop sign\" comment indicate an open mind? You've missed my main points, so there's no reason to continue arguing them with you.\n\nBut you're right, numerous studies about type legibility have been inconclusive at best!\n\n"
    },
    {
      "time": "19 Feb 2008 — 3:58pm",
      "content": "I didn't miss your point, Carl. I just didn't like your attitude.\n\n"
    },
    {
      "time": "19 Feb 2008 — 9:29pm",
      "content": "Don't you think that if sans-serifs worked for book design, they would be in regular use? But they're not, Blanche! They're not!\n\n"
    },
    {
      "time": "19 Feb 2008 — 9:44pm",
      "content": "That's cuz we publishing types are a bunch of Quark-using fuddy duddies\n\n[http://typophile.com/node/42202](http://web.archive.org/web/20150415100132/http:/typophile.com/node/42202 \"http://typophile.com/node/42202\")\n\n"
    },
    {
      "time": "19 Feb 2008 — 10:56pm",
      "content": "Monotype Erhardt, preferably at 11pt. Great typeface, under-used and under-appreciated.\n\n"
    },
    {
      "time": "20 Feb 2008 — 5:52am",
      "content": "Some some on (and off) topic comments.\n\nI think Janson (Text) is among the most readable fonts. I agree with Pattyfab about the italics. It always looked to me like somebody (or something) sat on top of the lc and flattened the tops of some letters.\n\nIf you like Janson, you should also like Ehrhardt, also by Kis. But I am not a big fan of the windswept _w._\n\nAnother Kis-based possibility is E+F's Nikis Light, but I don't know where you can get it anymore. I always loved the lc italic _g_ because it didn't look like a pair of eyeglasses or a wire coat hanger. (Is E+F out of business?)\n\nI thank Pattyfab for mentioning Sabon, which I haven't used in a while. I'm reprinting some \"Best of\" pieces from my newsletter, and switched one piece from Adobe Garamond to Sabon, and I really like it.\n\nI also think Pattyfab has the most beautiful and classy avatar on the forum.\n\n ![](http://web.archive.org/web/20150415100132im_/http:/typophile.com/files/Kis_6155.jpg)\n\n"
    },
    {
      "time": "25 Feb 2008 — 9:09am",
      "content": "Great thread.\n\nI'm looking for a new font to use in a new book project. It's a heavily illustrated architecture book, hopefully with a lot of white space, but also with some large blocks of text. I wish that all of the fonts on Carl's list had PDF sample sheets, cause that seems to be the best way to get an initial impression of how the font feels. I printed out the ones that did, and my initial choices would be Kingfisher, Arnheim and Freight. I guess I'm looking for something very readable, but with a slight edge. Usually like to open up the leading, but I think that may be adding to the impression of the type being too light?\n\nI have been using Terminal Design's [Alfon](http://web.archive.org/web/20150415100132/http:/www.terminaldesign.com/fonts/sets/?CID=2) quite a lot recently, and like it alot, but I'm starting to think it prints too light, and want to mix things up a bit.\n\n"
    },
    {
      "time": "26 Feb 2008 — 6:40am",
      "content": "John --\n\nMost folks naturally link Whitman to the Font Bureau site, where the fonts are available for license; but I have an alternate PDF specimen, which might be more useful for judging the type for book purposes, at my site:  \n [http://www.kentlew.com/Type/WhitmanSpecimen.pdf](http://web.archive.org/web/20150415100132/http:/www.kentlew.com/Type/WhitmanSpecimen.pdf \"http://www.kentlew.com/Type/WhitmanSpecimen.pdf\")\n\nI don't know if you'll deem this design to be what you have in mind.\n\nI'm not aware of Whitman in use in any architectural books quite like what you do. There was a recent guide to Chicago architecture, but that was a small format (and small type). It has been used in some how-to building titles -- <cite>The Fence Bible</cite> and <cite>How to Build Paths, Steps &amp; Footbridges</cite> (both from Storey Publishing, under my direction), which are similar in format to yours.\n\nIf the type interests you, but you need to review more examples, I'd be happy to set some of your own sample text to match your specifications and send you a PDF. Contact me if you want to arrange this.\n\n-- Kent.\n\n"
    }
  ]
}
