{
  "id": "39610",
  "title": "Anyone know of any Type Conventions around the Asheville NC Area?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I want to go to one so bad, We have Black Mountain College Museum + Art Center. Why No Type Con? Maybe I’m not looking hard enough.\n\n [‹ I'm just going to ask...](http://web.archive.org/web/20071201213748/http:/typophile.com/node/39618 \"Go to previous forum topic\") [Typography - basic education ›](http://web.archive.org/web/20071201213748/http:/typophile.com/node/39579 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071201213748/http://typophile.com/user/24368\" title=\"View user profile.\">Chasography</a>",
  "time": "<br>",
  "uid": "24368",
  "comments": [
    {
      "time": " 30.Nov.2007 8.36am",
      "content": "TypeCon moves around every year. Never lose hope.\n\n"
    },
    {
      "time": " 30.Nov.2007 9.58am",
      "content": "Find the font people in your area, organize meet-ups, maybe organize small local events, send a delegation to typecon, and lobby for a conference. With a bit of work and a bit of luck I think you could pull this off in five to seven years.\n\n"
    },
    {
      "time": " 30.Nov.2007 10.21am",
      "content": "SoTA relies heavily on a local team to partner with the board of directors in hosting TypeCon each year. So that is one important factor in the decisions about locale.\n\nIf you can round up enough seriously interested, committed, and reliable folks, let us know. We’d be happy to hear about ideas for future TypeCon cities.\n\n— K.\n\n"
    },
    {
      "time": " 30.Nov.2007 12.58pm",
      "content": "Asheville is a magical enclave, Chase! Do what Si and Kent recommend: come to TypeCon next summer, preferably with a group of local type and design geeks, and let’s have a discussion about the possibilities. Consider yourself invited to volunteer at the conference if you want to find out what it’s all about from the inside out. Contact me offline to discuss: tamye (at) typesociety.org.\n\n"
    }
  ]
}
