{
  "id": "3962",
  "title": "Serif types",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi everybody!   \nCan anyone tell me about this fonts? I need to know the history about serif fonts since the beginning until now.   \nCan you help me??   \n   \nThanks a lot\n\n",
  "author": "anonymous",
  "time": "6 Dec 2002 — 5:30am",
  "uid": "1203",
  "comments": [
    {
      "time": "6 Dec 2002 — 6:19am",
      "content": "Hi Brennan   \nThanks a lot!!   \nI'll check right now. And remember if you see some new site in the future please send me a message, ok?   \nGod bless you my friend\n\n"
    },
    {
      "time": "6 Dec 2002 — 7:53am",
      "content": "No probs Guilherme,   \nCheck this one too:   \n [http://www.redsun.com/type/abriefhistoryoftype/](http://web.archive.org/web/20131019061307/http:/www.redsun.com/type/abriefhistoryoftype/)   \n   \nI would try [http://www.typebooks.com](http://web.archive.org/web/20131019061307/http:/www.typebooks.com/) for some more detailed ionformation or you could read this monstrosity of a book: [Typography: An Encyclopedic Survey of Type Design and Techniques Throughout History](http://web.archive.org/web/20131019061307/http:/www.amazon.com/exec/obidos/ASIN/1579120237/ref=ase_dmastypebooksforA/102-9871203-5579349)   \nCheck the reviews first!   \n   \nBren\n\n"
    },
    {
      "time": "7 Dec 2002 — 5:49pm",
      "content": "Revival of the Fittest is pretty good, too...   \n   \nTypography: An Encyclopedic Survey... a monstrosity? Noooo... It sits on a chair by my desk because I feared for my cheap shelf (which bowed mightily under its weight)... For those not products of the fine American education system, the multi-lingual aspect must be pretty helpful. Hell of a reference book, though hardly one you could just sit down and read (in bed or the bath)!\n\n"
    },
    {
      "time": "10 Dec 2002 — 10:15am",
      "content": "Can anyone tell me about the new book of Steven Heller called \" Typology:type design from the victorian era to the digital age\"? Have you aread read this?? I need information about the history of type and my main interest is serf types. What do you think? This will be a good book for me with these needs??   \nThanks a lot   \nGuilherme\n\n"
    },
    {
      "time": "10 Dec 2002 — 12:06pm",
      "content": "\"Typology\" is a good book for a quick visual coverage on the history of type. I find that I use it more for inspirational and less for historical purposes. --- In fact, all of the books by Stephen Heller and Louise Fili are useful for this purpose. --- Used in conjunction with books that are more academic they can serve as very useful for visual reference.\n\n"
    },
    {
      "time": "10 Dec 2002 — 12:57pm",
      "content": "i agree. typology is a good jumping off point. it covers different periods and movements, but doesn't provide intricate detail. surely you need to know something more specific than \"the history of serif type.\" what about it? just general info or do you need to go deeper than that?\n\n"
    },
    {
      "time": "11 Dec 2002 — 5:38am",
      "content": "Hi Isaac   \nIt's nice talking to you. Thanks for the opinion about the book.   \nActually I need to do a work for my pos graduation about \"the typograph on Vogue magazine\". They use three but I will study two. Didot and Garamond. So, I think that is very important to know about the history of both, of serif type and all about typograph. What do you think? I must study another subject or what? What book I should read to find good informations?   \nIforgot to say that my work, or my problem is to realise if this two fonts \"say\" the same things that the magazine. We know that is a fashion magazine but the project was done well with this fonts?? This is what I must do.   \nCan you or anybody help me?? Anything!?\n\n"
    },
    {
      "time": "11 Dec 2002 — 8:55am",
      "content": "Are you working from a specific time period? You might try researching the art director's from those time periods as well.   \n   \nMaybe this has been asked (too lazy to double check), but have you written a thesis yet? I would personally be interested in reading it.\n\n"
    },
    {
      "time": "11 Dec 2002 — 9:49am",
      "content": "I dont know if I have aread told but I'm from Brasil. Now a days this two fonts make part of this magazine. I will make a research about who created Didot (Firmin Didot) and talk about Neoclassicismo ( I dont know how can I call this in inglish ), and Napoleao Bonaparte and French revolution. I beleave that everything that \"come to life\" has a reason and carry a lot of situations and experiense n the \"backstage\". Than I will make a comparison with the days that we live, the period in art history and the culture that we live in.   \nAnd the same with Garamond   \nI dont know if I was clear but a hope that my english dont interfear in my communications with you.   \nNo, I haven't write nothing until now. I'm in a project time. Last week I handed over to my teacher as a text. Next year I will start actually.   \nBut I swear that I will send you, ok Tiffany?   \nThanks so much.   \nDo you have some to ask me or to help?   \nDo you read some book that will be very important to me??   \nGod bless you!!!\n\n"
    },
    {
      "time": "11 Dec 2002 — 11:57am",
      "content": "Guilherme, \"neoclassicismo\" can be translated as \"neoclassicism\".   \nNot so different. But beware! Followers of R. Bringhurst   \n(there must be quite a few around here) don't think Didot is   \na neoclassical face, they call it \"Romantic\"...   \n   \nRegarding Linotype Didot specifically, there was a nice article   \nin TM a few years ago that, IIRC, offered a background on   \nthe historic period of the original face, the Napoleonic wars   \netc. I don't remember if it was written by Frutiger himself   \n(I think so) - my memory of it is dim, but I could send you a   \nxerox copy (pelo correio) if you wish. I'm in Rio. (The article is   \nin French in fact. It was published in the French-language   \nsection of TM (RSI))\n\n"
    },
    {
      "time": "6 Dec 2002 — 5:57am",
      "content": "Hi Guilherme,   \n   \nThats a lot of reading you have to do!! ;)   \nHere is a link that might help you:   \n [http://www.webreference.com/dlab/9802/serifI.html](http://web.archive.org/web/20131019061307/http:/www.webreference.com/dlab/9802/serifI.html)   \n   \nBren\n\n"
    }
  ]
}
