{
  "id": "39649",
  "title": "Liberation Sans, Serif & Mono",
  "forum": "Design",
  "tags": [

  ],
  "content": "I was delighted to discover that in May this year, RedHat released free of charge a new series of typefaces designed by Steve Matteson and produced by Ascender: Liberation Serif, Liberation Sans and Liberation Mono.\n\nThe fonts were released in OpenType TT format under a modified opensource GPL license (so it permits modifications). Each font includes approx. 660 glyphs covering Pan-European Latin, basic Greek and basic Cyrillic. The typefaces are metrically compatible with Helvetica, Times and Courier, making them an attractive replacement in office environments. The screen quality (hinting) is quite good, though not as good as Arial's on Windows.\n\nI find the designs quite interesting: the Sans have some Univers qualities but with some Akzidenz Grotesk flavor. The serif has strong traits of a Gerard Unger influence, Charter also comes to mind. Plus, the Serif roman has some similarities to Cambria, and the italic to Constantia, so Liberty Serif should be a reasonable alternative to the old Windows/Office fonts (Times New Roman) as well as the new Windows Vista/Office 2007 ones (Cambria and Constantia, that is). Liberation Mono is a monospaced variant of the Sans.\n\nOverall, the diacritics are rather well designed, so is the Cyrillic (definitely much better than those Cyrillics in Arial or Times New Roman), though the Greek looks somehow stiff, especially in the Serif.\n\nBelow is a sample of six out of the 12 fonts (I skipped the Mono and the Bold Italics).\n\n ![](http://web.archive.org/web/20100305232342im_/http:/typophile.com/files/Liberation1_6255.png)\n  \n\n ![](http://web.archive.org/web/20100305232342im_/http:/typophile.com/files/Liberation2_4462.png)\n\nThe fonts can be downloaded here:  \n [http://www.redhat.com/promo/fonts/](http://web.archive.org/web/20100305232342/http:/www.redhat.com/promo/fonts/ \"http://www.redhat.com/promo/fonts/\")\n\n(The \"TTF files for Windows\" set is, of course, good for Mac OS X as well).\n\nSome specimens and more information are available on the Ascender site:  \n [http://www.ascendercorp.com/liberation.html](http://web.archive.org/web/20100305232342/http:/www.ascendercorp.com/liberation.html \"http://www.ascendercorp.com/liberation.html\")\n\n(I have also just noticed that the commercial Ascender Serif, Ascender Sans and Ascender Mono are the same design, simply available under a commercial license rather than modified GPL).\n\nComments?  \nAdam\n\n",
  "author": "<a href=\"/web/20100305232342/http://typophile.com/user/1133\" title=\"View user profile.\">twardoch</a>",
  "time": "<br>",
  "uid": "1133",
  "comments": [
    {
      "time": "",
      "content": "[Already covered at the time of their release.](http://web.archive.org/web/20100305232342/http:/www.typophile.com/node/33693)\n\nNot that I'm complaining Adam. It doesn't hurt to make a development like this more visible.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Ah, sorry, I did not notice.\n\nA.\n\n"
    },
    {
      "time": "",
      "content": "No need for \"sorry\". This is good. I like it. Not my cup of tea but I like it and the fact it exists. Anything that succeeds in challenging the mainstream is a plus.\n\nj a m e s\n\n"
    }
  ]
}
