{
  "id": "3966",
  "title": "Personal logotype for class",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hey ho, im all new around here, and a friend of my sis directed me over to this uber-cool place of typeness.   \n   \nso just a little intro, im dante. ive worked in the field for awhile, doing freelance projects and stuff. and now im going to the artcenter college of design, dying but fufilling my masochistic urges. this project is for my form and letterform class, where we have to make a personal logotype. its supposed to read 'ante,' which is the root word of many of my nicknames.   \n   \n ![http://dantecom.future.easyspace.com/amerika/anteaite.jpg](http://web.archive.org/web/20150417164602im_/http:/www.typophile.com/forums/messages/29/3210.jpg)   \n   \nits still kinda unreadable, so if you guys have any suggestions, id be so greatful! thanks!\n\n",
  "author": "dantemante",
  "time": "6 Dec 2002 — 1:56pm",
  "uid": "729",
  "comments": [
    {
      "time": "6 Dec 2002 — 2:17pm",
      "content": "I think it's beautiful. How legible does it have   \nto be? Do people need to know what it says   \nwithout being told or can it survive as a graphic   \nmark with an obscure layer of meaning?   \n   \nYour glyph connections are genius. It's one   \nlovely 4-letter ligature.   \n   \nWhy the dot?\n\n"
    },
    {
      "time": "6 Dec 2002 — 2:31pm",
      "content": "the dot was a silly idea that im still debating on whether or not i should leave. i kinda wanted to break up the monotonous symmetry a bit without making it too radical, but at the same time, when you turn the logo upsidedown, it says 'aite!'   \n   \nabout the whole obscure thing, im not too sure, im getting really different feedback. like the ambiguity of the forms attract people, but then again, other people are telling me that it should first read 'ante' and then the mark should come in. or something like that.\n\n"
    },
    {
      "time": "6 Dec 2002 — 2:37pm",
      "content": "I guess it depends on the requirements of the   \nassignment. But I think this works as a logotype   \n- and better than most.   \n   \nIf you wanted to break up the symmetry, you could   \nextend the stem of the 't' to make it more clear.\n\n"
    },
    {
      "time": "6 Dec 2002 — 2:46pm",
      "content": "I would rather see the a properly formed e rather than using the upsidedown a, and you wouldn't have to modify it much. Other than that I think it's very nice work.\n\n"
    },
    {
      "time": "6 Dec 2002 — 2:59pm",
      "content": "that's really neat. what does aite mean? I agree with Stephen - the t could be clearer.   \nIs there a reason the logotype isin't straight?\n\n"
    },
    {
      "time": "6 Dec 2002 — 3:03pm",
      "content": "aite is what i say alot. its shorthand for 'alright'\n\n"
    },
    {
      "time": "6 Dec 2002 — 3:05pm",
      "content": "Very beautiful. While I can see, perhaps,   \nthe need for a little more legibility,   \nI don't think it needs much. Really nice   \ncombination of blackletter and roman. ![:)](http://web.archive.org/web/20150417164602im_/http:/www.typophile.com/forums/clipart/happy.gif)  \nYmmY!   \n   \nMaybe you have, maybe you haven't, seen the work   \nof John Langdon? Check out his ambigrams!   \n  [http://www.inkblot.net/johnlangdon/](http://web.archive.org/web/20150417164602/http:/www.inkblot.net/johnlangdon/)\n\n"
    },
    {
      "time": "6 Dec 2002 — 3:07pm",
      "content": "okay, heres one with the regular e instead of the upsidedown a:   \n   \n ![regular e](http://web.archive.org/web/20150417164602im_/http:/www.typophile.com/forums/messages/29/3213.jpg)   \n   \nand heres one with the stem of the t lengthend a little   \n   \n ![longer t stem](http://web.archive.org/web/20150417164602im_/http:/www.typophile.com/forums/messages/29/3214.jpg)\n\n"
    },
    {
      "time": "6 Dec 2002 — 3:11pm",
      "content": "wow dante, you jumped right in eh ;)   \n   \nits looking great!\n\n"
    },
    {
      "time": "6 Dec 2002 — 3:12pm",
      "content": "The original 'e' is best. Don't break up the flow   \nof the stroke. I like the last image. Can we see   \nit small?\n\n"
    },
    {
      "time": "6 Dec 2002 — 3:14pm",
      "content": "thanks kevin, wish i knew about this place sooner!\n\n"
    },
    {
      "time": "6 Dec 2002 — 3:19pm",
      "content": "here ya go, stephen:   \n   \n ![scaled down logo](http://web.archive.org/web/20150417164602im_/http:/www.typophile.com/forums/messages/29/3215.jpg)\n\n"
    },
    {
      "time": "7 Dec 2002 — 3:34am",
      "content": "if ante is the name it should be readable.   \ncurrently it is not. combining letters is fine as long as the letter doesn't disappear. when I think of ante I think of ante up or put something of value on the table.\n\n"
    },
    {
      "time": "7 Dec 2002 — 12:13pm",
      "content": "But \"mystery\" has value too. Not to mention abstract shape.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Dec 2002 — 1:47pm",
      "content": "It's very cool, but you have to look hard to see \"ante\" instead of \"aite\".   \n   \nBy the way, \"aite\" (ah-ee-teh) is Japanese for partner, opponent, or interlocutor.   \n   \nPaul D\n\n"
    },
    {
      "time": "7 Dec 2002 — 3:56pm",
      "content": "yeah, im still playing with the space inbetween the n part and the a, but i lose some of the rhythm and color when i try. ill experiment more later tonight.   \n   \naite (as in aitemasu) also means to meet, but in old japanese vernacular. depends on the kanji.\n\n"
    },
    {
      "time": "9 Dec 2002 — 3:25pm",
      "content": "This is a great exercise. Any chance of getting your classmates to post their marks?\n\n"
    },
    {
      "time": "9 Dec 2002 — 10:10pm",
      "content": "ohhh, nice. I can't really read \"ante\" either, but it's sooo beautiful.\n\n"
    },
    {
      "time": "10 Dec 2002 — 5:14am",
      "content": "I am really drawn to the letterforms! can you show it to us without the dot? It seems to make it questionable. What if the dot were someplace else?\n\n"
    },
    {
      "time": "10 Dec 2002 — 5:16am",
      "content": "could it be something other than a dot?\n\n"
    },
    {
      "time": "10 Dec 2002 — 11:53pm",
      "content": "joe: ill ask a couple of my friends if they would mind if i posted their stuff up too.   \n   \ncody: well, the dot is supposed to hint towards flipping the logo upsideown to get the 'aite,' and it doesnt really look as composed without it. so i feel more comfortable keeping it at this point, besides the fact that ive already printed and mounted my final version.   \n   \nand thanks richard. :D\n\n"
    },
    {
      "time": "7 Jan 2003 — 9:31am",
      "content": "just wanna see if my avatar works.\n\n"
    },
    {
      "time": "2 Jul 2003 — 10:26am",
      "content": "I'd like to see it become a true ambigram.\n\n"
    },
    {
      "time": "2 Jul 2003 — 10:53am",
      "content": "maybe sumphin like this ![](http://web.archive.org/web/20150417164602im_/http:/www.typophile.com/forums/messages/29/12433.jpg)\n\n"
    },
    {
      "time": "2 Jul 2003 — 10:54am",
      "content": "just for desolve the problem ![:-)](http://web.archive.org/web/20150417164602im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "2 Jul 2003 — 4:43pm",
      "content": "I think it would be far more readable if you didn't marry the left half   \nof the _n_ into the _a_. The ambigram/inversion thing can very definitely   \nwork for this word. Try using the middle of the right stroke of the _n_  \nas your centre of rotation, curving left at the top as normal, and   \ncurving into the _t_ at the bottom, something like a cursive join. Then   \nthe left stroke of the _n_ can invert to the _t_. A half serif on the end   \nand a slightly descending stroke will give you your _t_.\n\n"
    },
    {
      "time": "2 Jul 2003 — 4:54pm",
      "content": "Picture. Thousand words. You know the drill.   \n   \n ![Ambigram of \"ante\"](http://web.archive.org/web/20150417164602im_/http:/www.typophile.com/forums/messages/29/12450.gif)\n\n"
    },
    {
      "time": "9 Jul 2003 — 9:52am",
      "content": "AH yes!!! Looks great. This is the first ambigram I have seen on typophile.\n\n"
    },
    {
      "time": "9 Jul 2003 — 10:48am",
      "content": "Uf! That looks awesome! I really don't say that too much. Very much kick-. Nice to see the evolution.\n\n"
    }
  ]
}
