{
  "id": "39670",
  "title": "Datum",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is Datum, my first attempt at a font. It's a display face in which the letters are made up of bits of grids. It's not perfect, I know, but I'm not sure just how to improve it. Any suggestions?\n\n| Attachment | Size |\n| --- | --- |\n| [datum-v0.1.pdf](http://web.archive.org/web/20150417042648/http:/typophile.com/files/datum-v0.1.pdf) | 5.3 KB |\n| [datum-v0.2.pdf](http://web.archive.org/web/20150417042648/http:/typophile.com/files/datum-v0.2.pdf) | 5.31 KB |\n\n",
  "author": "zcatlin",
  "time": "2 Dec 2007 — 10:02am",
  "uid": "24605",
  "comments": [
    {
      "time": "2 Dec 2007 — 2:08pm",
      "content": "I think the letter spacing needs to be larger. It's too hard to read now.  \nMaybe you could try justing using the rectangle shape to build the letters, instead of having all the little bits.\n\n"
    },
    {
      "time": "2 Dec 2007 — 2:42pm",
      "content": "The thing that grabbed me immediately was how the stems of pairings like UM, ON, MN, etc blend together and make those letters difficult to read. Not sure if is helpful but your font reminded me of some of the sandblasted lettering in the Toronto Subway system. In that case the grid kind of manifests itself within the medium to give a (similar?) effect. Might be worth checking out for some more ideas.\n\n(There are some photos in Joe Clark's recent article on type in the Toronto Subway..  \n [http://joeclark.org/appearances/atypi/2007/TTC/inscribed/](http://web.archive.org/web/20150417042648/http:/joeclark.org/appearances/atypi/2007/TTC/inscribed/ \"http://joeclark.org/appearances/atypi/2007/TTC/inscribed/\"))\n\n"
    },
    {
      "time": "3 Dec 2007 — 2:51pm",
      "content": "Okay, I've doubled the inter-character spacing, so it should be more readable. I'm not sure if it's enough, but as the creator of the font, I'm probably not the best judge of that. I've attached the results as datum-v0.2.pdf.\n\n_Maybe you could try justing using the rectangle shape to build the letters, instead of having all the little bits._\n\nI'm not quite sure what you mean by \"the little bits\"--the little rectangles that all the characters are made out of, or the smaller rectangles on characters like C and G? Could you please clarify?\n\nFinally, does anyone have any ideas about how I could improve my Q? I think it could use some improvement, but I don't know just what to change.\n\n"
    }
  ]
}
