{
  "id": "3967",
  "title": "Mintchaos: Logo/identity first draft for personal design firm.",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Here's the first draft of the logo/identity I am working on for my personal design firm Mintchaos.   \n   \n**Note:** I apologize for the links instead of embedded images. I couldn't get them to work.   \n   \nFigures one and two show the two variations I'm working with. I started with #1 but my preference has been leaning towards #2. There are also small version of both to show how they read at very small sizes.   \n   \n [Figures one and two](http://web.archive.org/web/20131019185042/http:/outbox.staging.mintchaos.com/logo/mc.1.logos.gif)   \n   \nFigure three shows some colors:   \n   \n [Figure 3 - color test](http://web.archive.org/web/20131019185042/http:/outbox.staging.mintchaos.com/logo/mc.3.colors.gif)   \n   \nFigure 4 is a business card mockup (There is also a [version of the bcard using the logo from figure 2](http://web.archive.org/web/20131019185042/http:/outbox.staging.mintchaos.com/logo/mc.4b.bcard.gif):   \n   \n [Business card mockup](http://web.archive.org/web/20131019185042/http:/outbox.staging.mintchaos.com/logo/mc.4.bcard.gif)   \n   \nAnd now that you've seen it, a bit about the Mintchaos and the logo.   \n   \nMintchaos is my personal design firm. Our main focus is web but we do some of everything. The short version of my web-design philosophy is that everything should be done in the cleanest and most technologically \"correct\" way I can. This includes adherence to web-standards, accessibility, future-proofing, etc. while at the same producing visually appealing solutions that lack needless complexity. I probably sound like a pompous  saying it. but that's what I do.   \n   \nThe logo is only made up of only one primary triangle, the one used for the wings. The shapes in the middle are made from the triangle. The triangle it self is a golden triangle. And the shapes in the middle are [Penrose Tiles](http://web.archive.org/web/20131019185042/http:/mathworld.wolfram.com/PenroseTiles.html) (these tiles can cover an infinite space and never create a repeating pattern). There are only two edge lengths used in the entire logo, and they are the [golden ratio](http://web.archive.org/web/20131019185042/http:/www.google.com/search?ie=ISO-8859-1&q=the%2Bgolden%2Bratio). Mathematically speaking the longer length is 1 + Ø long and the shorter length is 1 + 1/Ø long. (Not exactly the correct symbol for phi, but this forum eats HTML entities.)   \n   \nThe goal of the logo was to create a simple and recognizable mark that betrayed the complex exactness that it is built on. Which is what I try to do.   \n   \nThat said, have at it! And thank you in advance for your thoughts!\n\n",
  "author": "xian",
  "time": "26 Mar 2004 — 11:15am",
  "uid": "3256",
  "comments": [
    {
      "time": "26 Mar 2004 — 1:31pm",
      "content": "Is it OK that it looks a lot like origami?   \n   \nI like the \"ghost\" pattern line on the business cards.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Mar 2004 — 1:41pm",
      "content": "Hrant: No, I don't mind that it looks like origami.\n\n"
    },
    {
      "time": "26 Mar 2004 — 1:45pm",
      "content": "Hrant, I was going to say the same thing. I've been folding Origami since I was 8, maybe its an idea for Mint Chaos? to look into. Sorry for butchering your name but thats what I see.\n\n"
    },
    {
      "time": "26 Mar 2004 — 2:25pm",
      "content": "I am a fan of fiqure 1 myself.   \n   \nAnd I really dig figure 4. I like spatially unfolding it. The deep green is nice.   \n   \nThe g in \"design\" is a little overdone. Maybe use an alternate?   \n   \nI like it.   \n   \nAndrew\n\n"
    },
    {
      "time": "26 Mar 2004 — 7:24pm",
      "content": "I realize this is not a particularly significant concern, but your design will tend to furrow the brows of those few who know something about Penrose Tiles.\n\n"
    },
    {
      "time": "26 Mar 2004 — 9:48pm",
      "content": "it doesnt read mint-chaos to me.. you need to find a way to visually or phisically seperate the words.\n\n"
    },
    {
      "time": "26 Mar 2004 — 10:02pm",
      "content": "Kyle: Mintchaos isn't supposed to be two words. Does it look like mintchaos? Or does it confuse?   \n   \nI guess what I'm saying is that I don't mind it looking like only one word (because it is) but if the word itself is confusing I'll see if it can be clarified.\n\n"
    },
    {
      "time": "26 Mar 2004 — 10:51pm",
      "content": "The first impulse in perceiving the word is to see \"tch\" as a common letter grouping, and so surmise that the word is pronounced \"Minch-ouse\" and might be someone's last name. One has to examine it for a few seconds before saying, \"Ohhh, it's mint-chaos.\"   \n   \nPerhaps if \"mint\" were in smallcaps, and \"chaos\" in lowercase? But I'm not sure if that would work, since \"c\" wouldn't really distinguish itself as one or the other.\n\n"
    },
    {
      "time": "27 Mar 2004 — 6:19am",
      "content": "I'm just wondering whats so chaotic about the logo or your biz plan - sounds like a pretty tight equation.   \n   \nIs there anything chaotic about it or is it simply an interesting name you'll use to attract.   \n   \nThe mint part - clean/fresh/standard I get.\n\n"
    },
    {
      "time": "27 Mar 2004 — 6:39am",
      "content": "The most difficult design job ever is your own mark. I'm of your grandfather's generation so I just don't get it. For that reason I won't comment except to advise you never to letterspace lower case. I know it's trendy but so are four-letter words in Hollywood.\n\n"
    },
    {
      "time": "28 Mar 2004 — 3:16pm",
      "content": "In regards to the pronounciation maybe this would clarify:   \n   \nHow would you answer your phone?\n\n"
    },
    {
      "time": "28 Mar 2004 — 8:37pm",
      "content": "Tanya: I would say that the chaos part is all about the inspiration. Pulling all the random pieces together and 'mint'ing them into something well defined. Also it ties in with the use of penrose tiles(unrepeatable patterns), and golden ratio (an irrational number).   \n   \nPronunciation: It is pronounced mint-chaos. I don't think I'll have a problem with people getting it. I've been operating under the name for a few years.   \n   \nPaul: Thank you for your comments, and yes, this mark has been harder for me than anything else I've worked on. I've revised it to not be tracked so loosely. I'm pretty sure I can see the value, but if anyone can explain (or point me to some information) about why, from a typographical standpoint this is unwise I'd love to hear it. Typography is one of my weaker design areas and is something I'm trying to learn more about.   \n   \nHere are the new, and probably final versions. I've decided to go with the original (fig 1 above) design). I think it's stronger and more focused. And as a friend said \"#1 looks like an 'M' but #2 looks like [Pom Pom](http://web.archive.org/web/20131019185042/http:/homestarrunner.com/vcr_pp.html). I have toned down the 'g' in design a bit as Andrew suggested.   \n   \nThe colors are still up in the air somewhat. Except for that green, I really like that.   \n   \nI want to print the ghosted repeating line that is behind the logo in the business card as a spot varnish, not as an actual inked color/value.   \n   \nThank you all for your input! And if you have any more thoughts I'd love to hear them.   \n   \n ![MClogocombindedfile](http://web.archive.org/web/20131019185042im_/http:/www.typophile.com/forums/messages/29/32205.gif)\n\n"
    },
    {
      "time": "28 Mar 2004 — 8:45pm",
      "content": "That 1.5-nocular 'g' just throughs the whole thing off, IMO. I like the mark, I can live with the 'mintchaos', but that g throws it all.   \nMore so in the stacked verticaly alighed version, than the horz version. I think you could get away with it there. it seems like you have all this symetry going on, and this little g sticks his foot in the door. ![:-)](http://web.archive.org/web/20131019185042im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nHildebrant.\n\n"
    },
    {
      "time": "28 Mar 2004 — 9:03pm",
      "content": "I'm repeating myself, but if you're emphasising chaos as a theme, you might want to create something consistent with the rules of a true Penrose tiling. That is to say, if you fit the two shapes together to make a diamond, you've defeated the purpose.\n\n"
    },
    {
      "time": "28 Mar 2004 — 9:28pm",
      "content": "Logo is nicely executed. Pattern is a very nice touch, however icon remind me of a nun.\n\n"
    },
    {
      "time": "29 Mar 2004 — 4:57am",
      "content": "I like the rocket ship alot but if it is mint chaos (I thought I was making a joke) why not use a mint color rather than a mossy green\n\n"
    },
    {
      "time": "29 Mar 2004 — 6:52am",
      "content": "\"Pronunciation: It is pronounced mint-chaos. I don't think I'll have a problem with people getting it. I've been operating under the name for a few years. \"   \n   \nHa! Until you said that, I thought this was simply some foreign word and didn't even try to pronounce it...but that's just me.\n\n"
    },
    {
      "time": "29 Mar 2004 — 8:40am",
      "content": "FWIW:   \n   \nlike darrel, i didn't even bother trying to pronounce it, because the letter combination was somehow unfamiliar, and did not register as two recognizable words.\n\n"
    },
    {
      "time": "29 Mar 2004 — 9:14am",
      "content": "\\> 1.5-nocular   \n   \n:-\\>   \n   \nhhp\n\n"
    },
    {
      "time": "29 Mar 2004 — 4:05pm",
      "content": "HHP: You like they huh? ![:-)](http://web.archive.org/web/20131019185042im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "30 Mar 2004 — 7:18pm",
      "content": "_Logo is nicely executed. Pattern is a very nice touch, however icon remind me of a nun._   \n   \nTo be a bit nerdish, it reminds me of the Emperor's white shuttle in Star Wars( i dont know the name of it.)\n\n"
    },
    {
      "time": "30 Mar 2004 — 11:05pm",
      "content": "Hey if I can add my two cents: I don't have a problem understanding your concept and name, though I must admit because \"mintchaos\" is one word, it can have a tendency not to resonate clearly upon initial glancing...   \n   \nAs for the altered \"g\": I think the reason why some people have a problem with it, is because it sticks out and seems to aggravate a seemingly cohesive and symmetrical design...perhaps this can be remedied by having the logo graphic be unsymmetrical in some way. If some other part or section between the graphic and the typography were not so balanced, the altered g would not cause such a stir...this is what I see in my mind's eye, so forgive me if reality proves this advice otherwise...but I do feel you are very close to having this solution finalized.\n\n"
    },
    {
      "time": "31 Mar 2004 — 9:44am",
      "content": "Christian:   \n   \nAside from all of the philisophical rhetoric I've read here, I really like this design. A few comments\n\n"
    },
    {
      "time": "31 Mar 2004 — 11:51am",
      "content": "First off, thanks to all of you for your comments, they have been quite helpful.   \n   \nI'm working on some new versions of the type that I should have ready to post tomorrow sometime. Trying to visually break up mint and chaos to increase recognition, without hurting the flow of the design.   \n   \nI'm trying some versions that don't have 'design' in them at all. Because that is not all I do, and because it will make the logo more versatile. I am not pleased at all with how the above version looks horizontally.   \n   \nI'm also trying some other fonts, although I really like [Target](http://web.archive.org/web/20131019185042/http:/www.myfonts.com/fonts/t26/target/). I keep coming back to it. I'll show you were all of that is going tomorrow.   \n   \nAs far as the symbol goes, I'm in love with it, and doubt it will change. I think it will serve me well over time. Everyone seems to see different things in it: Darth Vader, origami, a rocketship, a kite, a KKK mask, a nun. ![:-)](http://web.archive.org/web/20131019185042im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nDaniel: I really like this color of green. And while it isn't 'mint' in the artificial sense of the word it isn't all that far off from the [real thing](http://web.archive.org/web/20131019185042/http:/www.pbs.org/wgbh/nova/shamanactivity/amazon4.html).   \n   \nScott: I took the shading out of the symbol to purify the internal shapes. I'm still undecided over which one I like better. I think both styles work well.\n\n"
    },
    {
      "time": "31 Mar 2004 — 9:49pm",
      "content": "Hi Christian,   \n   \nI like the logo. I think it is a good idea to try other typefaces, but if you just adjust the spacing, as Scott pointed, it is fine to me. (the 1.5 g doesn't disturbs me)   \n   \nAbout the green, well, I think you should go with the \"artificial\" one insted. This one is not \"fresh\" enough for me, too yelow... :-)   \n   \nOne last thing, the golden ratio is not related to phi (0,314...) but to other letter which name I don't remember (0,618...)   \n   \nThat's it, congratulations for the nice logo, and good luck with the improovements!\n\n"
    },
    {
      "time": "1 Apr 2004 — 4:10am",
      "content": "W. If you knew me you'd know I like to joke around here, its because everyone else is soooo serious. The mint green comment was a joke. So was the rocketship crack.\n\n"
    }
  ]
}
