{
  "id": "3968",
  "title": "TURBO",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I have seen a few logotypes that resemble this font, but I haven't been able to find an actual face that is too similar. (if you know of one, tell me) This is my first font and I've only been working on it for a few weeks now.. Already I have many alternates for a lot of the letters, and it's tough deciding which ones will go in the final product. (especially the \"e\" and \"a\") So far there is only a lower case, but I plan to have a full character set plus an alternate or \"expert\" face when I finish.   \n   \n ![TURBO Sample](http://web.archive.org/web/20150416041608im_/http:/www.typophile.com/forums/messages/29/322.gif)\n\n",
  "author": "anonymous",
  "time": "2 Sep 2001 — 8:31pm",
  "uid": "1203",
  "comments": [
    {
      "time": "9 Nov 2001 — 12:13pm",
      "content": "i like the sencond \"e\" better. the first one is hard to read. it dose give the   \n\"Chalet\" feel.(one of my favorite font families) would like to see the other   \nletter alternatives. this will be a dope font for the youngin's\n\n"
    },
    {
      "time": "19 Jun 2003 — 11:18am",
      "content": "this kind of typeface is always fun to play with. consider looking at 'Pop' by Gareth Hague on t.26's site ( [www.t26.com](http://web.archive.org/web/20150416041608/http:/www.t26.com/)) for inspiration and comparison.\n\n"
    },
    {
      "time": "3 Sep 2001 — 11:26am",
      "content": "Nice. It's similar in feel to Lance Wyman's logo and font for the 1968 Olympic Games in Mexico, or even Pritchard Line Out.   \n   \nI'd be interested in seeing some of the alternates, especially to the lc \"e\".   \n   \nDavid Thometz\n\n"
    },
    {
      "time": "3 Sep 2001 — 10:37pm",
      "content": "Thanks!   \n   \nthe MEXICO 68 logotype was definately an inspiration, except I went with 2 stripes instead of 3. TURBO's letter forms are based off of all of the geometric, avant garde style faces out there, ie House's CHALET TOKYO. Below are some of the lc \"e\" alts that are already finished. Also, you can see alternate \"b\" & \"d\", the same letterforms that makes up \"q\" & \"p\" .   \n   \n ![alt sample](http://web.archive.org/web/20150416041608im_/http:/www.typophile.com/forums/messages/29/333.gif)\n\n"
    },
    {
      "time": "4 Sep 2001 — 1:45am",
      "content": "Ah -- the lc \"k\" bothers me a bit too, and I think I just realized why: its x-height differs from that of the other letters. Same is true with the lc \"h\", to a lesser degree. It doesn't bother me as much with the lc \"i\", though. Still, that's a relatively easy fix. Overall, the font is a good one.   \n   \nI think I personally prefer the non-tilted alternate lc \"e\" to the tilted one, too.   \n   \nI look forward to seeing your complete set.   \n   \nDavid Thometz   \n   \nStephen - Hey! Thanks! ![:)](http://web.archive.org/web/20150416041608im_/http:/www.typophile.com/forums/clipart/happy.gif) Drop me a line sometime.\n\n"
    },
    {
      "time": "18 Jun 2003 — 2:11pm",
      "content": "Ok, so this is a couple of years late, but [here's a link](http://web.archive.org/web/20150416041608/http:/www.fontshop.com.au/fontdetailc.php3?ns=&sns=&co=&co2=&id=fp-2647) to the   \naforementioned Dubbeldik at FontShop Australia's fine site.\n\n"
    },
    {
      "time": "4 Sep 2001 — 12:49am",
      "content": "Aaron,   \n   \nIt's lovely. Reminds me of the following...   \n   \n1 - [http://www.myfonts.com/Testdrive?p=96&s=alpha&id=62582&submit=display](http://web.archive.org/web/20150416041608/http:/www.myfonts.com/Testdrive?p=96&s=alpha&id=62582&submit=display)   \n   \n2 - Mecanorma's Dubbeldik (only sample I find is in FontShop's FontBook)   \n   \n...but is differs beautifully from both. (Only the 'k'   \nbothers me, but I can't propose a better solution, so   \nI'm a worthless heap.) I've long seen promise in the   \nmultiline bauhaus forms and you've brought that   \npotential to reality. This can definitely be a seller.   \nWhat vending options have you considered?   \n   \nStephen   \n   \nDave T. - nice to see you here!\n\n"
    }
  ]
}
