{
  "id": "39689",
  "title": "I need a new display - suggestions?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "It’s hard to find trustworthy information on the web and nowadays it’s seems impossible to actually go some place and test and see for youself. So I’d really appreciate your suggestions and hear about your experiences. The thing should offer everything a graphic designer would expect (color calibration ...) of course. Flatscreen is probably the way to go.  \nThanx.\n\n [‹ categories and styles](http://web.archive.org/web/20080905043632/http:/www.typophile.com/node/45999 \"Go to previous forum topic\") [Mistakes in job listings - funny or scary? ›](http://web.archive.org/web/20080905043632/http:/www.typophile.com/node/45363 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905043632/http://www.typophile.com/user/17243\" title=\"View user profile.\">Jan</a>",
  "time": "<br>",
  "uid": "17243",
  "comments": [
    {
      "time": " 3.Dec.2007 5.19am",
      "content": "[Maybe](http://web.archive.org/web/20080905043632/http:/aryarya.net/wassyoi/lcdmemo.html) ViewSonic VX2025WM.\n\n"
    },
    {
      "time": " 3.Dec.2007 7.43am",
      "content": "I’m still with the CRT, and on my second Mitsu Diamond Pro. I now have a 2070SB with 3rd party calibration.\n\nThat’s probably what I’ll use until SED hits the market.\n\n"
    },
    {
      "time": " 3.Dec.2007 9.10am",
      "content": "\\> I’m still with the CRT  \nYep, just like me.\n\nIn fact, I’m not so sure about LCD.  \nHadn’t heard of SED before. Sounds promising.\n\n"
    },
    {
      "time": " 3.Dec.2007 3.36pm",
      "content": "Swissmiss asked this question a little while ago and got a ton of replies, though a good few blindly shouted “Apple!” even though their displays are, quite frankly, weak: the display in my brand new Santa Rosa MacBook is awful – it’s a Samsung panel LTN133W1, made in the 1st quarter of 2006, and exhibits the “dithering” that so many people have complained about – and the Cinema Displays really, really need updating. I reckon Apple will announce new models in January, along with new Mac Pros and the mythical thin MBP. Anyway, here’s the post:  \n [http://swissmiss.typepad.com/weblog/2007/11/advice-from-my-.html](http://web.archive.org/web/20080905043632/http:/swissmiss.typepad.com/weblog/2007/11/advice-from-my-.html \"http://swissmiss.typepad.com/weblog/2007/11/advice-from-my-.html\")\n\nPersonally, I’d hit “cheap but big with decent performance” option and go for the Dell 2707WFP (single-DVI connection) when it’s on discount, along with a third-party calibrator, as I said in the link above. I’m still a little amazed that I’m the only one that mentioned hardware calibration in that thread, all displays tend to be mediocre without profiling. I’m willing to live with the trade-off of poorer performance of LCDs vs. CRTs in exchange for the larger display size, and the extra desk space is quite welcome, too. SED does sound promising, though If you need something now there aren’t any displays available using that technology.\n\nBy far the most thorough review of the Dell I’ve found online has been at Anandtech; it’s a real shame they don’t review displays more often:  \n [http://www.anandtech.com/printarticle.aspx?i=2961](http://web.archive.org/web/20080905043632/http:/www.anandtech.com/printarticle.aspx?i=2961 \"http://www.anandtech.com/printarticle.aspx?i=2961\")\n\nThat review should give an idea of the competition, too, though it’s 6 months old so there’ll probably be newer models about.\n\n"
    },
    {
      "time": " 3.Dec.2007 4.22pm",
      "content": "Thanks Pause.  \nI doubt myself if Apple is such a good choice. I’ve been disappointed by Apple products several times, especially with stuff they just put their logo on (like printers).\n\nAnyone else?\n\n"
    },
    {
      "time": " 3.Dec.2007 6.12pm",
      "content": "CRTs are awful for the environment and for your eyes - the flicker.\n\n"
    },
    {
      "time": " 3.Dec.2007 7.46pm",
      "content": "I like my Apple LCDs - the color is really good right out of the box. I have had a 22”, 2 24”s, 2 17”s and a 20”. A laptop display is not a good example of the Cinemas. Get an Eye One Display 2 to calibrate it and you’re good. If you are more demanding look at EIZO - very expensive but probably the best flat panel these days.\n\nIt is very difficult to buy a good CRT these days - Barco, Sony, LaCie all quit making them.\n\nI’m with Patty on the flicker - I can live without it…\n\npbc\n\n"
    },
    {
      "time": " 4.Dec.2007 8.10am",
      "content": "On a side note, has anyone had experience with radio interference banding on an LCD monitor? I live next door to a ham radio operator and it plays havoc with my CRT. Apart from the vertical stripes everything looks like it has a drop shadow and reversed text is nearly impossible to read.\n\n"
    },
    {
      "time": " 4.Dec.2007 9.03am",
      "content": "Eizo. Their screens are magnificent, calibration is easy, they look nice. And cheaper than Apple’s displays.\n\nBTW: I have an Apple 23-inch Cinema Display. It has the famous magenta cast, but I am not bothered by that — being old school I KNOW what cmyk-values a skintone has. ; )\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 4.Dec.2007 12.08pm",
      "content": "Eizo is cheaper? I don’t think so. A CG211 is $3000. A 30” Cinema Display is $1800. You get what you pay for - like he says the Eizo are magnificent.\n\nThe magenta cast was on the earlier versions and has been corrected for a long time.\n\nI am no Apple fan per se - but their LCDs have served me well.\n\npbc\n\n"
    },
    {
      "time": " 4.Dec.2007 12.33pm",
      "content": "<cite>Personally, I’d hit “cheap but big with decent performance” option and go for the Dell 2707WFP (single-DVI connection) when it’s on discount ...</cite>\n\nI will second the Dell — not that I really have a lot of data by which to judge. I recently had to order myself a new display at work, and our hardware standards offer Dell and Apple. I am a die-hard Apple guy, but I compared the specs and, for the same size/pixels, the Dell wins. Better specs, better price, better warranty. (I was reading about high failure rates with the Apples.) And the Dell (2407WFP-HC) easily spins to portait (vertical), if that’s your cup of tea.\n\n"
    },
    {
      "time": " 5.Dec.2007 4.50am",
      "content": "Thanks people.\n\nAre there any issues with graphics cards and displays? All I have avaibable right now is a Radeon 9000. Is that sufficient for large (22” +) displays?\n\n"
    },
    {
      "time": " 5.Dec.2007 9.07am",
      "content": "Assuming you’ve got at least a single DVI-I connector on that Radeon (I sure hope so) then the maximum res. you can do is 1920x1200, I think. So for native resolution you’ve could go for the Dell 27”, the Apple 24” or the Eizo CG241W. For more than that (i.e. the 30” models) you’ll need dual-link DVI.\n\n"
    },
    {
      "time": " 28.May.2008 9.13am",
      "content": "So, I finally got my Dell 2208WFP Ultrasharp 22” display.\n\nWhat kinda annoys me is that the lightness of the screen seems uneven.  \nThere’s a gradient from darker (top) to lighter (bottom).  \nIf I turn the display 90 degrees the gradient will go from right to left (so it’s not a viewing angle or environmental lighting thing).  \nIs that normal? Or is the thing bad and I need a replacement?  \nAnybody experienced something like that? Is it a known problem?\n\nThanks.\n\n"
    },
    {
      "time": " 28.May.2008 10.50am",
      "content": "From my limited exposure to LCDs that has been the case with most of them. Especially the iMacs where I used to work. I would bet the higher quality screens don’t have this issue and I hope to someday find out.\n\n"
    },
    {
      "time": " 2.Jun.2008 12.49pm",
      "content": "I learned quite a lot about LCD displays today (took me half of the day).\n\nMost important: DON’T BUY THE DELL 2208WFP!!!  \nIt doesn’t have anything in common with the 2007WFP that has been praised as an adequate substitute for the Apple displays.  \nIt has a much cheaper (and less quality) panel technology built into it (TN) whereas the old ones had S-IPS panels.\n\n"
    },
    {
      "time": " 2.Jun.2008 4.04pm",
      "content": "This is recommended by Andrew Rodney - the color management guru.\n\n[NEC](http://web.archive.org/web/20080905043632/http:/www.clubmac.com/clubmac/shop/detail~dpno~7199152.asp)\n\nIt comes with some great software to calibrate it. We hope to get a couple when our new office is ready.\n\nSharon\n\n"
    },
    {
      "time": " 2.Jun.2008 5.33pm",
      "content": "These are supposed to be really good Sharon, with the caveat that they are wide gamut. I think they are up to 92% or so of aRGB which means they display a lot more colors you can’t print and a much wider gamut than almost anyone viewing your webpages would. Most monitors are somewhere around sRGB, which is why that is the standard color profile for web work. It is also a lot closer to the print gamut. So people are struggling a little bit with these wide gamut monitors, seeing changes in what they see on screen and what is printed or on the web. Especially the reds for this NEC in particular, making skin tones particularly elusive.\n\nWide gamut is the future and I’m sure we’ll adjust…\n\npbc\n\nAll ideas, theories and statements are subject to change without notice.\n\n"
    },
    {
      "time": " 2.Jun.2008 7.46pm",
      "content": "Ah, interesting points, Paul. I wonder if it works better for photographers than typographers.\n\nSharon\n\nEdit: mmm...just noticed your skin tone comment so maybe not.\n\n"
    },
    {
      "time": " 2.Jun.2008 7.57pm",
      "content": "I need to study this more, but I suspect you have to calibrate it to a standard that is appropriate. For my own information, is anyone using a single system that can switch on the fly from, say, D50 to ColorMatch? And, does this require more frequent calibration?\n\n"
    }
  ]
}
