{
  "id": "39694",
  "title": "germandbls in Freight",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello everybody,\n\nhas anybody out there used Joshua Darden's Freight for German language? I've considered it for several projects now, but I think because of the germandbls it's pretty much unusable. I understand the thought behind it (long s + normal s = double s) and also like it aesthetically, but no one I tested it on could actually read it. At least not without thinking about it for a while.  \nFor anyone who doesn't know what I'm talking about, I took a screenshot from Joshua Darden's homepage.\n\nIs there an alternative??? I'm afraid this otherwise great font not is suitable for german language without one.\n\n ![](http://web.archive.org/web/20131018061359im_/http:/typophile.com/files/freight_6035.jpg)\n\n",
  "author": "hn2o",
  "time": "3 Dec 2007 — 6:18am",
  "uid": "4781",
  "comments": [
    {
      "time": "3 Dec 2007 — 6:54am",
      "content": "Hello Hanno,  \nFreight Sans has alternative glyphs for g and a, according to the [PDF specimen](http://web.archive.org/web/20131018061359/http:/www.joshuadarden.com/shop/freightsans.pdf). Maybe there’s an alternate ß for Freight Text, too, though it doesn’t appear in the [character set](http://web.archive.org/web/20131018061359/http:/www.joshuadarden.com/shop/freighttext_charset.php). Then, the alternate Sans glyphs [don’t appear there](http://web.archive.org/web/20131018061359/http:/www.joshuadarden.com/shop/freightsans_charset.php) either. I suggest contacting the foundry directly.\n\n<cite>I’m afraid this otherwise great font not is suitable for german language without one.</cite>  \nI agree. This form is only suitable in an historic context.  \nIf a type designer wants to include ſs, then the best way to go would be to do it like in [Meta Serif Pro](http://web.archive.org/web/20131018061359/http:/www.fontshop.com/fonts/singles/fontfont/ff_meta_serif_pro_book/): as linked alternates, with ß as default.\n\n ![](http://web.archive.org/web/20131018061359im_/http:/typophile.com/files/ss-alternates_5479.png)\n  \nF \n"
    },
    {
      "time": "3 Dec 2007 — 7:14am",
      "content": "Well, ſs is not ß, just like ü is not an u with a superscripted e and ç is not a c with a subscripted Ʒ. Those letters have lost their original ligation contexts centuries ago. If Joshua designed ß like ſs, it is an obvious error -- I would contact the designer and complain.\n\nI also don't see a huge practical point of putting ſs as an alternate of ß, let alone putting it in the font if there is no physical ligation. If anyone wants ſs, he will type in ſs. If one chooses to make a \"longs\\_s\" aka \"uni017F0073\" glyph after all, he might consider associating it with ß in the \"hist\" feature.\n\nA.\n\n"
    },
    {
      "time": "3 Dec 2007 — 8:16am",
      "content": "Hi Adam,\n\n<cite>Well, ſs is not ß, […] Those letters have lost their original ligation contexts centuries ago</cite>\n\nWell, I agree – partly. The ß – as a ‘real’, discrete letter, not just a ligature – _in Latin script_ (i.e. ‘Antiqua’, not ‘Gebrochene Schrift’) is quite young. So, in this case, not centur **ies** , but rather only one or one and a half …&nbsp;;°)\n\nHave a look at this book, picked from what Google has to offer from that period (of course, most of the German books then still were set in Fraktur):  \nJacob Grimm: Deutsche Mythologie. Göttingen: Dieterichsche Buchhandlung, 1854. (p. VI)\n\n ![](http://web.archive.org/web/20131018061359im_/http:/typophile.com/files/grimm-m_4478.png)\n\n- einfluſs — present day spelling: Einfluss — before the 1996 reform: Einfluß\n- bloſser — present day spelling: bloßer\n- heiſse — present day spelling: heiße\n- daſs — present day spelling: dass — before the 1996 reform: daß\n\nGiven this situation, I consider putting ſs (and ss) as an alternate of ß very helpful.  \nCheers, F\n\n"
    },
    {
      "time": "31 Jan 2008 — 1:48pm",
      "content": "Hi Florian,\n\nI'm making a german folder with Freight Text and I encountered the same problem.  \nDid you solve it? Did you contacted Joshua?\n\ncheers\n\nlettertiep\n\n"
    },
    {
      "time": "31 Jan 2008 — 2:06pm",
      "content": "Hi Benjamin,\n\nit wasn’t exactly my problem/concern – but Hanno’s.  \nThus: No, I didn’t take further action, sorry.  \nF\n\n"
    },
    {
      "time": "31 Jan 2008 — 2:25pm",
      "content": "thanx for the quick reply, I'm writing Mr Darden right now…\n\nB\n\n"
    },
    {
      "time": "31 Jan 2008 — 3:08pm",
      "content": "Cool. Keep us updated, please!\n\n"
    },
    {
      "time": "11 Feb 2008 — 7:06am",
      "content": "I've received an e-mail from Robert Lovely, who assured me there's a version with ß and that he'll send it to me, but I didn't recieve it yet…\n\n"
    },
    {
      "time": "19 Feb 2008 — 5:36am",
      "content": "Still didn’t receive the ß from Darden :(  \nSomebody knows an alternative? My folder must be at the printers this week\n\nthanx\n\n"
    },
    {
      "time": "10 Mar 2008 — 9:18am",
      "content": "Got it! Look s nice ;-)\n\n ![](http://web.archive.org/web/20131018061359im_/http:/typophile.com/files/freighteszett_4214.gif)\n\n"
    },
    {
      "time": "27 Mar 2008 — 7:53am",
      "content": "Yeah, good work Josh!\n\nA.\n\n"
    }
  ]
}
