{
  "id": "39718",
  "title": "Fuse Magazine and D&AD",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nAs a project for my BA degree in graphic design we have been set to take on one of this years d&ad briefs. The one I have chosen is set by Research Studios and is to relauch Fuse Magazine and its 20th issue.\n\n`The brief\nRe-launch FUSE magazine by designing its 20th issue.\nMandatory requirements\nFUSE was seen as a revolution in both typography and the format it chose for publication. This re-launch should further this FUSE heritage.\nThroughout your concept and design you must feature a new, original font created specially for this issue. Your final presentation must include:\n• Format and examples of layout\n• Complete font display\n• Promotional poster for the re-launch\n• Anything else you think is relevant\n`\n\nIt can be read in full here: [http://www.dandad.org/studentawards08/briefs/pdf/GRAPHIC\\_RESEARCHSTUDIOS...](http://web.archive.org/web/20100709214116/http:/www.dandad.org/studentawards08/briefs/pdf/GRAPHIC_RESEARCHSTUDIOS.pdf \"http://www.dandad.org/studentawards08/briefs/pdf/GRAPHIC\\_RESEARCHSTUDIOS.pdf\")\n\nResearch for this project has been fairly hard as I have not yet been able to even view a copy of Fuse Magazine.\n\nDoes anyone know where I can get hold of on? I am located in the United Kingdom. If not, any additional information would be appreciated. Or if someone has a copy at home a few scans would be great.\n\nRegards,\n\nGustaf\n\nNeville Brody: [http://typophile.com/node/14015](http://web.archive.org/web/20100709214116/http:/typophile.com/node/14015 \"http://typophile.com/node/14015\")  \nFuse Magazine: [http://typophile.com/node/14028](http://web.archive.org/web/20100709214116/http:/typophile.com/node/14028 \"http://typophile.com/node/14028\")?\n\n",
  "author": "<a href=\"/web/20100709214116/http://typophile.com/user/23549\" title=\"View user profile.\">Gus</a>",
  "time": "<br>",
  "uid": "23549",
  "comments": [
    {
      "time": "",
      "content": "Hi. I imagine that the [St. Bride Library](http://web.archive.org/web/20100709214116/http:/www.stbride.org/) might have back issues...\n\nYou could also try ebay.com, half.com, and bookfinder.com\n\n"
    },
    {
      "time": "",
      "content": "?\n\n[http://www.fusemagazine.org/back.html](http://web.archive.org/web/20100709214116/http:/www.fusemagazine.org/back.html \"http://www.fusemagazine.org/back.html\")\n\n"
    },
    {
      "time": "",
      "content": "jupiterboy, that's a different FUSE... Gus is talking about a set of experimental fonts that came in a box (on floppy disks), along with a poster. Each issue had a theme, and the guest designers had to make a typeface using that theme as inspiration. [Neville Brody and FontShop were involved.](http://web.archive.org/web/20100709214116/http:/www.fontshop.de/fuse95/fuse-talk/brody.html)\n\n"
    },
    {
      "time": "",
      "content": "A selection of FUSE editions can be bought in the German FontShop for a mere € 199:  \n [http://www.fontshop.de/sukr.php3?ch=%2Ffontproductdetailc.php3%3Fns%3D1%...](http://web.archive.org/web/20100709214116/http:/www.fontshop.de/sukr.php3?ch=%2Ffontproductdetailc.php3%3Fns%3D1%26sns%3D0%26ns%3D1%26sns%3D0%26co%3D%26co2%3D%26id%3D6026594 \"http://www.fontshop.de/sukr.php3?ch=%2Ffontproductdetailc.php3%3Fns%3D1%26sns%3D0%26ns%3D1%26sns%3D0%26co%3D%26co2%3D%26id%3D6026594\")  \nSingle issues here (not every one):  \n [http://www.fontshop.de/sukr.php3?ch=%2Ffontproductdetailc.php3%3Fns%3D1%...](http://web.archive.org/web/20100709214116/http:/www.fontshop.de/sukr.php3?ch=%2Ffontproductdetailc.php3%3Fns%3D1%26sns%3D0%26ns%3D1%26sns%3D0%26co%3D%26co2%3D%26id%3D6034160 \"http://www.fontshop.de/sukr.php3?ch=%2Ffontproductdetailc.php3%3Fns%3D1%26sns%3D0%26ns%3D1%26sns%3D0%26co%3D%26co2%3D%26id%3D6034160\")\n\nI just noticed I have the first four issues on top of the bookcase next to me ; ) They are NOT for sale.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Oh lovely. I need to overlook my finances and see if my girlfriend will allow me to spend some money on some backissues.\n\nBert V, would you consider just scanning in some sample or something if you have access to a scanner? Would be much appreciated. I have still not been able to find any copy close to me to have a look at.\n\nRegards\n\n"
    },
    {
      "time": "",
      "content": "These FUSE-magazines consist of a poster each for the experimental fonts presented (four at format A2) and a booklet (A5 oblong, A4, A5 regular, etc.) with some background on the designers and their work.  \nScanning the posters is something I cannot do with my current setup. And my digital camera is being repaired (…).  \nBut I will give the booklets a go. As soon as I have something I will post here, ok?\n\n.. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "OK. Just put scans of the booklets of FUSE 01—04 (in the form of 300 dpi PDF's) in my Download Webarea:\n\n[http://homepage.mac.com/WebObjects/FileSharing.woa/wa/default?user=bertv...](http://web.archive.org/web/20100709214116/http:/homepage.mac.com/WebObjects/FileSharing.woa/wa/default?user=bertvanderveen&templatefn=FileSharing5.html&xmlfn=TKDocument.5.xml&sitefn=RootSite.xml&aff=consumer&cty=US&lang=en \"http://homepage.mac.com/WebObjects/FileSharing.woa/wa/default?user=bertvanderveen&templatefn=FileSharing5.html&xmlfn=TKDocument.5.xml&sitefn=RootSite.xml&aff=consumer&cty=US&lang=en\")\n\nNo warranty, these are quick and dirty.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Thank you so much Bert! Its great to see layouts, materials and how it actually looks, not just read about it. It is very much appreciated!\n\nRegards\n\nGustaf\n\n"
    },
    {
      "time": "",
      "content": "As I have been working with this project for the last week I have come to the conclusion that I really need to set myself a theme to be able to define within what area my work will land.\n\nMany themes that I have thought about has come back to some type of geometics etc.. although I would like some theme that is just something completely different. An earlier competition set by Research Studios was \"Security\" which I thought was a pretty good one.\n\nThe themes that I have thought of sort of feels pretty pointless so far, **anyone got any ideas for a good theme?**\n\nCould be pretty much anything! Whatever you can think of, write it down!\n\n"
    },
    {
      "time": "",
      "content": "_The themes that I have thought of sort of feels pretty pointless so far, anyone got any ideas for a good theme?_\n\nGus, I hate to play the bad guy, but I think that this is really something you should come up with... It will be a better project if you come up with the brief. Don't cheat yourself.\n\n"
    },
    {
      "time": "",
      "content": "Yeah, I pretty much would just like to see on what level what I have written down so far compares.\n\nA war theme is something that has been poping around in my head for a while today. Could be a good way to go ahead considering the uk's participation in the iraq war etc.. Its a way I think could have been handled a bit differently, if that is even possible for someone who has not been there to say, at least from what has been displayed in media here, also considering the different things that the media has reported in this country and some of the issues that has been completely disregarded (Media from other countries has aired some other stories which seems to have been blacklisted here).\n\nAs It might end up as a pictogram typeface, the items of war and geometrics would work nicely together.\n\n**Edit:** If anyone knows what typeface was used for the FUSE logo, that information would be appreciated. I have used this image to check in What-Is-The-Font etc as well but without any good matches.\n\n ![](http://web.archive.org/web/20100709214116im_/http:/typophile.com/files/Fuse%20Logo_3662.jpg)\n\nRegards\n\nGustaf\n\n"
    },
    {
      "time": "",
      "content": "Hey all,\n\nIm currently undertaking this project as well. Has been very difficult to find research material and I have still been unable to find an issue of any issue of FUSE.\n\nI went to london this week, St Briars and everywhere else i could think of, don't bother, i couldent find it anywhere.\n\nI guess we will have to buy it!\n\nAdam\n\n"
    },
    {
      "time": "",
      "content": "hi Adam,\n\nThe PDF-scans of issues 1 thru 4 are still downloadable on the site I mention above.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Bert,\n\nThanks very much, really appriciate that. What are these scans exactly? The issues booklet or the mag itself?\n\nThanks\n\n"
    },
    {
      "time": "",
      "content": "The booklet that came with each issue (times 4). The posters that were included are A2 (4 for each issue) and too large for my scanner. Maybe I’ll make some digital snapshots and put them up too. (My camera just came back from being repaired).\n\nDon't know of a magazine.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "hey gus\n\nthe font is neville's typeface 6, which then turned into bonn.\n\nif you fancy trekking back into london, you should pay a visit to the studio. if you like, drop me an email and I could sort something out.\n\nLuke\n\n"
    }
  ]
}
