{
  "id": "39715",
  "title": "Gravestones of famous designers, typographers and lettering artists.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As I've been researching the project of designing  \n [my father's gravestone,](http://web.archive.org/web/20120730171218/http:/www.typophile.com/node/39537) I've become fascinated with the gravestones of designers, typographers, stone carvers/lettering artists etc. Many are beyond gorgeous, all are of extraordinary quality.\n\nI've found William Morris's tombstone, but I've been unable to find Josef Hoffman. I suspect I'm googling in the wrong language to find it? If anybody has a picture of Josef Hoffman's gravestone, or any other legendary designers, I'd love to see them.\n\n ![](http://web.archive.org/web/20120730171218im_/http:/typophile.com/files/a_morris_william2_gb_5809.jpg)\n\n ![](http://web.archive.org/web/20120730171218im_/http:/typophile.com/files/WilliamMorrisTombstone_6241.jpg)\n\n",
  "author": "EileenB",
  "time": "3 Dec 2007 — 1:57pm",
  "uid": "21709",
  "comments": [
    {
      "time": "3 Dec 2007 — 2:13pm",
      "content": "It's not of a designer, but I've always liked Borges' tombstone:\n\n ![](http://web.archive.org/web/20120730171218im_/http:/typophile.com/files/borgesgrave_5636.jpg)\n\n"
    },
    {
      "time": "3 Dec 2007 — 3:28pm",
      "content": "[This thread](http://web.archive.org/web/20120730171218/http:/www.typophile.com/node/32799) features a photo of Didot’s grave at the Père Lachaise cemetery in Paris, provided by Chuck Groth.  \nAnd Ralf Herrmann once [has found a grave plaque](http://web.archive.org/web/20120730171218/http:/www.flickr.com/photos/ralf_herrmann/262962641/) in Weimar that possibly could be the one of [Justus Erich Walbaum](http://web.archive.org/web/20120730171218/http:/typophile.com/wiki/Justus%20Erich%20Walbaum) – btw with [ſs](http://web.archive.org/web/20120730171218/http:/www.typophile.com/node/39694).\n\n"
    },
    {
      "time": "4 Dec 2007 — 11:48am",
      "content": "One typographic notable had his headstone already cut except for the last date, long before he died. It stood ready in the barn at his New Hampshire home.\n\nNot many folks any longer recall Professor Ray Nash. He was a long-time teacher of art (maybe art history, actually) at Dartmouth College, and he wrote often about handwriting, calligraphy, & printing. He ran a teaching press at Dartmouth where he taught such folks as printer Rocky Stinehour and letterer extraordinaire Stephen Harvard. I spent the summer of 1975 (?) at his farm, with about 6 other young printing and type enthusiasts, working on iron hand presses in that barn.\n\n& there in the corner stood the black stone, rounded top and all. I believe Stephen Harvard had cut the letters. I assume he finished the job when Ray died in 1982. Maybe I'll go find his last resting place when I'm in New England in June and see if I can get a photo. & post it here.\n\npowers\n\n"
    },
    {
      "time": "30 Jun 2011 — 6:20am",
      "content": "I worked as an in-house designer for a large group of funeral homes here in Toronto. I've always been interested in the craftsmanship that goes into some headstones (mostly older).\n\nPaul Rand's tombstone is pretty stunning. Not only is it not your standard tombstone shape, but it uses two different types of stone.\n\n ![](http://web.archive.org/web/20120730171218im_/http:/typophile.com/files/CLRykq3wuc1ho8cs4G0WiQnX_500_6531.jpg)\n\n"
    },
    {
      "time": "30 Jun 2011 — 10:18am",
      "content": "A related thread on [tombstone typography](http://web.archive.org/web/20120730171218/http:/typophile.com/node/58550).\n\n"
    }
  ]
}
