{
  "id": "39712",
  "title": "Seeking critique while peeking from behind a tree.",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "OK, pervasive terror now almost fully confined, I submit for the first time a typeface for critique. While I already know what some are likely to be, stating the following may reduce the number of obvious views:\n\n1.) This font will not be given or sold.  \n2.) It is quite uneven - the capitals don't even match in style or size and many of the curves in all the letters are slightly different  \n3.) Both cases of the letter \"S\" are absolutely disgraceful. Ignore if possible.\n\nWhat I'm hoping to obtain here is not an ordinary \"change this\" or \"try that.\" Instead, I am first merely wanting to know if I should permanently give up trying to design a typeface; second, if there are any particular aspects/letters off which I should build (i.e., the uc \"P\" is different from the \"B,\" so perhaps which looks better); third, if I've unwittingly designed something almost identical to some other typeface out there and; fourth, if I am missing something about typography as whole that screams from this font.\n\nThanks for any input, it all will be quite valued.\n\n| Attachment | Size |\n| --- | --- |\n| [54.pdf](http://web.archive.org/web/20131012141624/http:/typophile.com/files/54.pdf) | 11.22 KB |\n\n",
  "author": "Curioustype",
  "time": "3 Dec 2007 — 1:33pm",
  "uid": "15771",
  "comments": [
    {
      "time": "3 Dec 2007 — 1:44pm",
      "content": "Technical error. Proceed\n\n"
    },
    {
      "time": "3 Dec 2007 — 1:36pm",
      "content": "Hey, where’s your file?\n\n"
    },
    {
      "time": "3 Dec 2007 — 1:59pm",
      "content": "In the meantime ...\n\n"
    },
    {
      "time": "3 Dec 2007 — 1:38pm",
      "content": "Does it showed in the preview?\n\n"
    },
    {
      "time": "3 Dec 2007 — 2:00pm",
      "content": "After only four meaningless posts and 20 minutes, I've finally succeeded. Somehow. Critique away\n\n"
    },
    {
      "time": "3 Dec 2007 — 1:58pm",
      "content": "cleaning\n\n"
    },
    {
      "time": "3 Dec 2007 — 2:07pm",
      "content": "Not bad. Carry on.\n\n"
    },
    {
      "time": "3 Dec 2007 — 2:11pm",
      "content": "Very intersting, Christopher Miller, but the capitals don't match in color (weight) as well.\n\n"
    },
    {
      "time": "3 Dec 2007 — 2:14pm",
      "content": "Thanks to all so far. Nice spot, Mr. Segalini, by the way. Please see No. 2 in the original post.\n\n"
    },
    {
      "time": "3 Dec 2007 — 3:06pm",
      "content": "I personally don't think it's bad. In my (very amateur) opinion, it's probably more of a display face than something you would use for body text, but the angles on letters like 'b' and 'u' make for an interesting effect. One suggestion I have is that it might look a little more uniform if (for example) you used the same general kinds of angles for 'c' and 'o' as you do for some of the other letters. I think I'll leave further critique for those with more experience and a larger typographic vocabulary.\n\n"
    },
    {
      "time": "3 Dec 2007 — 3:08pm",
      "content": "Oh, and no, I think this font should be worked on, not abandoned.\n\n"
    },
    {
      "time": "3 Dec 2007 — 4:29pm",
      "content": "I like it. Keep working on it. You are right, the S and s need to be thrown out and you need to start over. I would take the uppercase C, flip the bottom half, and use an upward (left to right) sloping diagonal at the same angle as the other letters.\n\nI particularly like the synergy between the diagonals in the 'yp,' 'yin,' and 'gin' letter combinations. Keep that.\n\nThe P and B don't have to match. They both look fine.\n\nIt would be helpful to see upper and lower case at the same point size.\n\nI'd say design the numbers and punctuation next, and then kern it.\n\n"
    },
    {
      "time": "4 Dec 2007 — 1:37am",
      "content": "Think of it as a replacement of the hand lettering in comic books. It would go rather nicely in that context. (See e.g. [http://blambot.com/](http://web.archive.org/web/20131012141624/http:/blambot.com/ \"http://blambot.com/\") )\n\n"
    },
    {
      "time": "15 Dec 2007 — 7:33am",
      "content": "Try to give only one direction (leftbottom to right top) in the letters, not two. This is too distracting when reading it.\n\nSee here:\n\n[http://www.wg2007.com/direction.gif](http://web.archive.org/web/20131012141624/http:/www.wg2007.com/direction.gif \"http://www.wg2007.com/direction.gif\")\n\n"
    },
    {
      "time": "16 Dec 2007 — 2:13pm",
      "content": "I will give that a shot and post the results. Thanks for such a great visual example to go by.\n\n"
    }
  ]
}
