{
  "id": "39716",
  "title": "New Releases from P22 & Lanston Type Company",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20080107033537/http:/typophile.com/user/108 \"View user profile.\") : 3.Dec.2007 2.16pm \n\nFor Immediate Release:  \nBuffalo, NY, December 3rd, 2007:\n\nP22 and the Lanston Type Company introduce LTC Italian Oldstyle and Goudy Extras\n\nItalian Oldstyle designed by Frederic Goudy in 1924 has now been digitized by Paul Hunt. This new font is not to be confused with the font “Adobe Italian Oldstyle MT”, which is an earlier design from 1911 based on William Morris’s Golden Type based on Nicholas Jenson’s Roman face. Goudy went back to Jenson’s original Roman and other Renaissance Roman faces for his inspiration and the result is what many consider to be the best Renaissance face adapted for modern use.\n\nWith most digitizations of old metal typefaces, one source size is often used as reference (as was Goudy’s method for his own cuttings of his Village foundry types) so that all sizes refer to one set of original artwork. The original hot metal fonts made by Lanston Monotype (from Goudy’s drawings) and other manufacturers used two or three masters for different size ranges to have optimal relative weights (smaller type sizes would need proportionally thicker lines to not appear thin and larger sizes would require thinner lines to not appear to bulky). The variations in size ranges can also be affected by the size of the cutter head in making the master patterns.\n\nThe light weights of LTC Italian Oldstyle were digitized from display sizes (14, 18, 24, 30, 36 pt) and the regular weights were digitized from smaller composition sizes (8,10,12 pt.). The fitting for the regular weights is noticeably looser to allow for better setting at small sizes. Very few font revivals take this approach.  \n [http://www.p22.com/lanston/italianoldstyle.html](http://web.archive.org/web/20080107033537/http:/www.p22.com/lanston/italianoldstyle.html \"http://www.p22.com/lanston/italianoldstyle.html\")\n\nLTC Goudy Extras is a set of over 50 ornaments, connecting borders, flourishes and decorative motifs originally designed by Frederic Goudy throughout his career. Many of these designs were used by Goudy at his Village Press and offered by his Village Foundry in the 1920s. The styles range from complex title page illustrations to simple linking borders, but all have the unique Goudy style.  \n [http://www.p22.com/lanston/goudyextras.html](http://web.archive.org/web/20080107033537/http:/www.p22.com/lanston/goudyextras.html \"http://www.p22.com/lanston/goudyextras.html\")\n\nThese new releases and all Lanston Type Company fonts can be viewed on our newly redesigned Lanston web pages:  \n [http://www.p22.com/lanston/](http://web.archive.org/web/20080107033537/http:/www.p22.com/lanston/ \"http://www.p22.com/lanston/\")\n\nAdditional images of the font for both web and print can be found here:\n\n[http://p22.com/products/press-images.html](http://web.archive.org/web/20080107033537/http:/p22.com/products/press-images.html \"http://p22.com/products/press-images.html\")\n\n——————————-  \nSUPER DELUXE BOXED SET\n\nLike a fine meal, an exceptional font collection deserves an exceptional presentation. Lanston Type Co. presents the full collection of over 270 Fonts in a limited edition box with an original Lanston Monotype Matrix case.  \n [http://www.p22.com/lanston/ltccollection.html](http://web.archive.org/web/20080107033537/http:/www.p22.com/lanston/ltccollection.html \"http://www.p22.com/lanston/ltccollection.html\")  \n————————-  \nHappy Holiday Season!  \nP22 Type Foundry  \n——————————————-  \nP22 type foundry, Inc.  \nNot your typical type™  \nPO Box 770  \nBuffalo, NY 14213  \n [http://www.p22.com](http://web.archive.org/web/20080107033537/http:/www.p22.com/ \"http://www.p22.com\")  \nPhone: 716-885-4490  \nFax: 716-885-4482  \n——————————————-\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080107033537/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 3.Dec.2007 2.16pm",
  "uid": "108",
  "comments": [

  ]
}
