{
  "id": "39747",
  "title": "seeking earliest example of a 5 dot by 8 dot pixel font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "a historical query: I'm looking for the earliest creation of a 5 dot by 8 dot pixel font. i noticed [Susan Kare's beautiful fonts from 1984](http://web.archive.org/web/20131217193720/http:/www.kare.com/MakePortfolioPage.cgi?page=4) but none of them are 8 pixels tall. again, i'm looking for pixel fonts, nothing curved or anti-aliased. attached is an image of what i'm looking for. any suggestions?\n\n| Attachment | Size |\n| --- | --- |\n| [OscillographicProductionOfLetters copy.png](http://web.archive.org/web/20131217193720/http:/typophile.com/files/OscillographicProductionOfLetters%20copy.png) | 18.87 KB |\n\n",
  "author": "l---l",
  "time": "4 Dec 2007 — 11:01am",
  "uid": "24697",
  "comments": [
    {
      "time": "4 Dec 2007 — 11:04am",
      "content": "Gosh, I don't know. I'm sure there was a lot of that going on with the early rasterized displays in the 70s and 80s with the introduction of home computers...\n\n"
    },
    {
      "time": "4 Dec 2007 — 11:14am",
      "content": "You should try contacting computer science historians. I’m sure that someone over at Stanford could help you with this—if they weren’t responsible for the font, someone there was at least using it.\n\n"
    },
    {
      "time": "4 Dec 2007 — 11:20am",
      "content": "I imagine this would correlate with the introduction of the dot-matrix printers?\n\n"
    },
    {
      "time": "4 Dec 2007 — 1:11pm",
      "content": "Hi l---l,\n\n<cite>a historical query: I’m looking for the earliest creation of a 5 dot by 8 dot pixel font</cite>\n\nMaybe there are examples that are _a lot_ older … imagine cross-stitch embroidery or mosaic works?  \nThere is a publication on ‘the assembled character’ – [Das gefügte Zeichen](http://web.archive.org/web/20131217193720/http:/www.signographie.de/cms/front_content.php?idart=67) (SIGNA Nº 10) by Nina Stößinger. However, I can’t recall if it explicitly contains examples of a 5×8 units face; and it’s in German, of course. It might be a great read for you anyhow.  \nF\n\n"
    },
    {
      "time": "4 Dec 2007 — 1:14pm",
      "content": "indeed  \npre-1970s  \n [http://www.leatherwoodantiques.com/images/Textiles/TS-0066.jpg](http://web.archive.org/web/20131217193720/http:/www.leatherwoodantiques.com/images/Textiles/TS-0066.jpg \"http://www.leatherwoodantiques.com/images/Textiles/TS-0066.jpg\")\n\n"
    },
    {
      "time": "4 Dec 2007 — 1:26pm",
      "content": "Surely you need at least six pixels to do an M - otherwise they'll crash together?\n\n"
    },
    {
      "time": "4 Dec 2007 — 1:45pm",
      "content": "_Surely you need at least six pixels to do an M - otherwise they’ll crash together?_\n\n+===+  \n+===+  \n++=++  \n++=++  \n+=+=+  \n+=+=+  \n+===+  \n+===+ ?\n\n"
    },
    {
      "time": "4 Dec 2007 — 2:16pm",
      "content": "The dot matrix or grid of the Apple II screen characters was 5 dots wide and 7 dots high. See Apple II Reference Manual of 1979, page 14. Certain dot matrix needle printers featured the same 5 x 7 dot matrix. An emulation truetype font is shown on page 15 of this document\n\n[http://www.sanskritweb.net/fontdocs/ega-cpi.pdf](http://web.archive.org/web/20131217193720/http:/www.sanskritweb.net/fontdocs/ega-cpi.pdf \"http://www.sanskritweb.net/fontdocs/ega-cpi.pdf\")\n\n"
    },
    {
      "time": "4 Dec 2007 — 2:27pm",
      "content": "\"+===+  \n+===+  \n++=++  \n++=++  \n+=+=+  \n+=+=+  \n+===+  \n+===+ ?\"\n\nSpace between letters is important too, no?\n\n"
    },
    {
      "time": "4 Dec 2007 — 3:03pm",
      "content": "\\> Space between letters is important too, no?\n\nCorrect. But at that time 3 decades ago (starting in 1977 with Apple I), the dot matrix referred to the visible dot matrix only, because the text characters were generated by hardware, a so-called type 2513 character generator. The old Apple II manual says on page 96: \"The seven rows in each character are scanned by VA, VB, and VC signals, and the output of the character generator is serialized into a stream of dots by a 74166 at location A3. This bit stream is routed to an exclusive-OR gate...\" Am I to continue this Wozniak jargon?\n\n"
    },
    {
      "time": "4 Dec 2007 — 3:13pm",
      "content": "Thanks, makes sense - looking at your PDF seems as if the space between characters may have even been variable.\n\n\\>Am I to continue this Wozniak jargon?\n\nNot unless you have a big enough iBong for the rest of us.\n\n"
    },
    {
      "time": "4 Dec 2007 — 3:17pm",
      "content": "Here is explained (for the Atari) how it worked:\n\n[http://www.atariarchives.org/cgp/Ch02\\_Sec04.php](http://web.archive.org/web/20131217193720/http:/www.atariarchives.org/cgp/Ch02_Sec04.php \"http://www.atariarchives.org/cgp/Ch02\\_Sec04.php\")\n\n"
    },
    {
      "time": "4 Dec 2007 — 7:32pm",
      "content": "thank you everyone! all the suggestions are very helpful\n\n"
    },
    {
      "time": "4 Dec 2007 — 8:00pm",
      "content": "I would imagine that some of the early Emigre fonts (the \"coarse resolution\" series) were drawn on a 5 x 8 grid... (Although I don't know if they are the earliest examples.)\n\nFor instance, most of the characters in [Emperor 8](http://web.archive.org/web/20131217193720/http:/www.emigre.com/EFoICoaD.php) are 4 x 8, but the **M** is 5 x 8...\n\nThe coarse resolution fonts were replaced by the [Lo-Res series](http://web.archive.org/web/20131217193720/http:/www.emigre.com/EFfeature.php?di=101).\n\n"
    },
    {
      "time": "8 Dec 2007 — 8:16am",
      "content": "\\> Thanks, makes sense - looking at your PDF seems as if the space between characters may have even been variable.\n\nIn the PDF source file, MS Word (erroneously) made the space variable due to flush-right justification, but the font was a non-proportional, fixed-width 5 x 7 needle printer emulation font made by Berthold in 1985:\n\n[http://www.sanskritweb.net/temporary/needle.jpg](http://web.archive.org/web/20131217193720/http:/www.sanskritweb.net/temporary/needle.jpg \"http://www.sanskritweb.net/temporary/needle.jpg\")\n\n"
    },
    {
      "time": "10 Jan 2009 — 5:27pm",
      "content": "Ridiculously late, but I just came across this.\n\nFlorian, thanks for referencing the SIGNA issue. Indeed \"pixel fonts\" are hardly a modern invention :-)&nbsp;&nbsp;As to the original question, AFAIR there is no historical 5 by 8 units example in the SIGNA issue. In fact, the vast majority especially of the \"older\" faces that I found have a cap height with an odd unit count.\n\nAlso, it would likely be an impossible task to find \"the definitive oldest one\" such alphabet; this stuff is quite tedious to research anyway, as the sources for this are scattered across so many fields (if they have even survived that is). There's not exactly a \"center of pixel type design\" out there that collects this stuff in a central location, sorted by cap height. Though I still dream of that.\n\nAs the original poster was looking for something with a fixed, orthogonal grid (so e.g. mosaics in the traditional sense don't count), a good bet would likely be checking out historical cross stitch manuals (although you'd have to be lucky to find eight stitch letters because letters with a seven stitch cap height were hugely popular; see page 37 of SIGNA 10 for some examples of these).  \nQuickly looking through my archive, I found one cross stitch example of glyphs with an eight stitch cap height, but they're only numerals, and also not old (1984), although I assume it revives older models.\n\n ![](http://web.archive.org/web/20131217193720im_/http:/typophile.com/files/8pxcrossstitch_4108.jpg)\n\n--\n\nAnother field to look into may be the tiny embossed \"dot matrix\" alphabets for the blind, which were popular in Europe before the inception of the Braille system (and even afterwards). These are highly interesting faces, but descriptions of what they actually looked like (or felt like, rather) are excruciatingly hard to find. The only one I managed to get my hands on was this one by Braille himself, done in 1839 (my visualization based on the original data). It has a 7 dot cap height, but there are other such faces too; apparently there was one used in Belgium that had a 5 dot cap height!\n\n ![](http://web.archive.org/web/20131217193720im_/http:/typophile.com/files/raphi_3886.gif)\n\n--\n\nI have a fantastic book showing really old examples of embroidered alphabets somewhere, but I can't find it right now. Let me know if anyone is still interested in this – I could dig that up and see what I can find.\n\n"
    },
    {
      "time": "10 Jan 2009 — 9:43pm",
      "content": "Nina, great stuff!\n\nl---l, my brother and I made 8x7\\* glyphs for our  \nCommodore64 in 1982... in Armenian and Arabic! :-)  \nNeedless to say that scarred me for life.\n\n\\* The bottom row was blank so lines wouldn't touch.\n\nhhp\n\n"
    },
    {
      "time": "14 Jan 2009 — 9:33am",
      "content": "Hrant, no hurries, but if you still have some rendering of those glyphs, that sounds like something I'd love to have in my collection (I have only a few examples of Arabic bitmap fonts so far, and no Armenian ones at all!).\n\n"
    },
    {
      "time": "14 Jan 2009 — 9:57am",
      "content": "My Commodore64 probably still boots (it wasn't called The Brick for nothing) but it's a couple of continents away right now, plus the floppies are probably moldy... Armenian bitmap fonts I still make however, and the best example is Arasan, which is an outline font with 5 sizes of bitmaps embedded: [http://themicrofoundry.com/f\\_arasan.html](http://web.archive.org/web/20131217193720/http:/themicrofoundry.com/f_arasan.html \"http://themicrofoundry.com/f\\_arasan.html\")\n\nhhp\n\n"
    },
    {
      "time": "14 Jan 2009 — 10:23am",
      "content": "A bit off-topic, but here are so Russian \"Pixel\" fonts from 1890s\n\n ![](http://web.archive.org/web/20131217193720im_/http:/typophile.com/files/page_09_4968.jpg)\n  \n\n ![](http://web.archive.org/web/20131217193720im_/http:/typophile.com/files/page_07_4173.jpg)\n  \n\n ![](http://web.archive.org/web/20131217193720im_/http:/typophile.com/files/page_08_4391.jpg)\n\n[The rest](http://web.archive.org/web/20131217193720/http:/community.livejournal.com/ru_typography/507620.html)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131217193720/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "14 Jan 2009 — 2:35pm",
      "content": "Ivan, very very big thanks for posting this! This is incredible. I wish I'd seen  \nsomething like this before publication.  \nSpontaneously, I find it very interesting how the formal characteristics of  \nsome alphabets correspond quite closely to some of the common Latin traditions,  \n& others feel specifically Cyrillic. I'll have to look at this in detail.\n\nHrant: No problem (please chuck out any moldy floppies!), and Arasan is \\*cool\\* (also quite interesting because on such a coarse grid, the smaller sizes especially seem to clear up a few structural questions I had about the Armenian alphabet). Thanks!  \n(Except your client is not offering the free download atm. :-| )\n\nShould I feel bad about hi-jacking this thread? It was dead before, right?\n\n"
    },
    {
      "time": "14 Jan 2009 — 2:44pm",
      "content": "Ivan, that's awesome!\n\n[http://3noor.org/arasan.html](http://web.archive.org/web/20131217193720/http:/3noor.org/arasan.html \"http://3noor.org/arasan.html\")\n\nThreads don't die - they just get sick.\n\nhhp\n\n"
    },
    {
      "time": "14 Jan 2009 — 2:47pm",
      "content": "Thanks, Hrant!&nbsp;&nbsp;:-)\n\n"
    },
    {
      "time": "18 Jan 2009 — 4:21pm",
      "content": "Amazing, Ivan!\n\n"
    },
    {
      "time": "18 Jan 2009 — 4:29pm",
      "content": "It seems to be a general rule that, when seeking the earliest example of a thing, that example will almost always turn out to be far earlier than you expected it to be.\n\n"
    },
    {
      "time": "19 Jan 2009 — 10:11am",
      "content": "These embroidery patterns are really cools, thanks for that post.\n\n\"I’m looking for the earliest creation of a 5 dot by 8 dot pixel font.\"\n\nI'm fairly certain you'll find these first appearing commonly in the ROMs of early computers from DEC, IBM and others. If you set up that grid, you'll find out that there are not many options, so you can recreate them quite simply, if that's what you're looking for.\n\nCheers\n\n"
    },
    {
      "time": "20 Jan 2009 — 7:29am",
      "content": "Somewhat related. Nokia turns the world on it's head with dot-matrix keys - exactly like the ones olde computers didn't have.\n\n[http://www.engadget.com/2009/01/19/nokia-5730-xpressmusic-gets-exhaustiv...](http://web.archive.org/web/20131217193720/http:/www.engadget.com/2009/01/19/nokia-5730-xpressmusic-gets-exhaustively-previewed/ \"http://www.engadget.com/2009/01/19/nokia-5730-xpressmusic-gets-exhaustively-previewed/\")\n\n"
    },
    {
      "time": "20 Jan 2009 — 7:47am",
      "content": "Ah, they _must_ be emulating those reconfigurable keyboards with  \ntiny LCD screens on each key! What historic insight!! What art!!!\n\nhhp\n\n"
    },
    {
      "time": "20 Jan 2009 — 7:54am",
      "content": "Arguably a more \"modern\" font choice than the iPhone. ;-)\n\n"
    }
  ]
}
