{
  "id": "39752",
  "title": "Aringacute",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "What's the Unicode for this character, and which language(s) is it used in?\n\n",
  "author": "Nick Shinn",
  "time": "4 Dec 2007 — 12:07pm",
  "uid": "2021",
  "comments": [
    {
      "time": "4 Dec 2007 — 12:18pm",
      "content": "[http://www.typophile.com/node/35221](http://web.archive.org/web/20120421233938/http:/www.typophile.com/node/35221)\n\n"
    },
    {
      "time": "4 Dec 2007 — 12:25pm",
      "content": "Probably well known but a very handy site:  \n [http://www.decodeunicode.org/u+01FB/zoom](http://web.archive.org/web/20120421233938/http:/www.decodeunicode.org/u+01FB/zoom \"http://www.decodeunicode.org/u+01FB/zoom\")\n\n"
    },
    {
      "time": "4 Dec 2007 — 12:36pm",
      "content": "It's not used in Danish as Hudson claimed in that other thread.\n\n"
    },
    {
      "time": "4 Dec 2007 — 12:51pm",
      "content": "I think the aringacute is a practical joke, since no one really can say what it is, and where it comes from ;-)\n\n"
    },
    {
      "time": "4 Dec 2007 — 1:09pm",
      "content": "It is for someone who wants ringtones on their Aacute :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Dec 2007 — 2:40pm",
      "content": "I can not recall ever seeing an aringacute, neither in norwegian or in danish. Nor can I think of any way to use such a character (the acute would not alter the pronounciation of the aring in any instance I can think of, and adding the acute therefore seems superfluous).\n\n"
    },
    {
      "time": "4 Dec 2007 — 6:54pm",
      "content": "Claus: _It’s not used in Danish as Hudson claimed in that other thread._\n\nThis character is not _normally_ used in writing Danish, but if syllable stress is marked in Danish, as may happen in e.g. dictionaries, then any standard Danish vowel, including the A with ring, may take an acute accent. This isn't unusual for any Latin script orthography: the acute accent is widely used to mark stress, and the only thing that makes the Danish situation a bit more complicated is that the A with ring is a standard vowel, not a diacriticised vowel, and hence you have the phenomenon of stacked marks that is otherwise not usual in European orthographies (but is very common in Africa for example).\n\nNow, most diacritic stacking in Unicode makes use of combining mark character sequences, so letters with two marks above are uncommon in the standard. If they exist in Unicode it is a very strong indication that they pre-date Unicode in some 8-bit character set, since Unicode has a policy of providing one-to-one round-trip mapping for earlier encoding standards. My guess is that the Aringacute character probably existed in something like a library cataloguing encoding, since these tend to be quite exhaustive in their coverage of possible accentuation.\n\nIf you check the Danish information in the [The Alphabets of Europe](http://web.archive.org/web/20120421233938/http:/www.evertype.com/alphabets/danish.pdf), you'll see that Aringacute is included there. This document originated as a CEN project, and included input from a wide range of national experts and standardisation bodies. If you were to check the documents listed in the bibliography, I'm sure you would find the justification for Aringacute in one or both.\n\nWhen Microsoft were spec'ing the WGL4 character set, they decided to take an inclusive approach to European diacritic letters, even if the characters in question were not found in everyday orthographic use. Hence, the Aringacute (along with Oslashacute and AEacute, and lowercase equivalents) were all included and, through this, became fairly standard inclusions in OpenType glyph sets for European language support.\n\n"
    },
    {
      "time": "5 Dec 2007 — 3:47am",
      "content": "Hi John. As it still seems very alien to me, I'm going to write and ask some people who would know. I'll report back later.\n\n"
    },
    {
      "time": "5 Dec 2007 — 8:28am",
      "content": "<cite>the only thing that makes the Danish situation a bit more complicated is that the A with ring is a standard vowel, not a diacriticised vowel...</cite>\n\nIn Swedish, the Aring is also its \"own\" character, compared to an accented É or similar.\n\nOur alfabet is from A-Ö (where the last three is Å Ä Ö), but we dont have the aringacute that is why I think it is rather strange this character.\n\nAnd for all of those Americans who doesnt know that Sweden is another country than Switzerland (believe me, it is common) I can tell you it is right next to Denmark ;-)\n\nLooking forward to finding out more on the Aringacute from Clauses.\n\n"
    },
    {
      "time": "5 Dec 2007 — 8:31am",
      "content": "\"I can tell you it is right next to Denmark\"\n\nLOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "5 Dec 2007 — 9:28am",
      "content": "Denmark, Wisconsin?\n\n[http://www.denmark-wi.org/](http://web.archive.org/web/20120421233938/http:/www.denmark-wi.org/ \"http://www.denmark-wi.org/\")\n\n"
    },
    {
      "time": "5 Dec 2007 — 10:09am",
      "content": "\\> “I can tell you it is right next to Denmark”\n\nBut you do have to get your feet wet.\n\n"
    },
    {
      "time": "5 Dec 2007 — 10:30am",
      "content": "_But you do have to get your feet wet_\n\nNot any more: they build a bridge.\n\n"
    },
    {
      "time": "5 Dec 2007 — 10:39am",
      "content": "In Danish typesetter terms the å is called 'Swedish å'. The character was, as it is written today with the ring on top of the a, invented in the 15th century in Sweden. In the 14th century the first ways to indicate the o-sounding a included ā ă â and ao written together like æ is. The origin of the aring was writing the a with the ring right just to it's right side, later in the 15th century it was moved up on top of the a. The first time the å is used in print is in 1526 for a Swedish bible. After a few centuries of mucking about with aa versus å, the å was implemented by law in Danish in 1948.\n\n"
    },
    {
      "time": "5 Dec 2007 — 10:56am",
      "content": "Goran: _In Swedish, the Aring is also its “own” character, compared to an accented É or similar._\n\nYes, but if you look here\n\n[http://www.evertype.com/alphabets/swedish.pdf](http://web.archive.org/web/20120421233938/http:/www.evertype.com/alphabets/swedish.pdf \"http://www.evertype.com/alphabets/swedish.pdf\")\n\nyou'll see that the Aringacute is not listed, nor is it listed in either of the Norwegian orthographies\n\n[http://www.evertype.com/alphabets/bokmaal-norwegian.pdf](http://web.archive.org/web/20120421233938/http:/www.evertype.com/alphabets/bokmaal-norwegian.pdf \"http://www.evertype.com/alphabets/bokmaal-norwegian.pdf\")  \n [http://www.evertype.com/alphabets/nynorsk-norwegian.pdf](http://web.archive.org/web/20120421233938/http:/www.evertype.com/alphabets/nynorsk-norwegian.pdf \"http://www.evertype.com/alphabets/nynorsk-norwegian.pdf\")\n\nwhereas it is listed here\n\n[http://www.evertype.com/alphabets/danish.pdf](http://web.archive.org/web/20120421233938/http:/www.evertype.com/alphabets/danish.pdf \"http://www.evertype.com/alphabets/danish.pdf\")\n\nThis is a good indication that the Aringacute will be found identified as a Danish character in the Danish Language Committee (Dansk sprognævn) documents listed in the bibliography for the Danish PDF:\n\nDansk sprognævn. 1996. _Retskrivningsordbogen._ 2. udgave. København: Aschehoug. ISBN 87-11-10000-1\n\nDansk sprognævn, in Icelandic Council for Standardization. 1992. _Nordic cultural requirements on information technology._ Reykjavík: Staðlaráð Íslands. ISBN 9979-9004-3-1\n\nInterestingly, the Wikipedia entry on the Danish alphabet has this to say:\n\n_Standard Danish orthography has no compulsory diacritics, but allows the use of an acute accent for disambiguation. Most often, an accent on e marks a stressed syllable in one of a pair of homographs that have different stresses, for example en dreng (a boy) versus én dreng (one boy) or alle (every/everyone) versus allé (avenue)._\n\nLess often, any vowel except 'å' may be accented to indicate stress on a word, either to clarify the meaning of the sentence, or to ease the reading otherwise. For example: jeg stód op (\"I was standing\"), versus jeg stod óp (\"I got out of bed\"). Most often, however, such distinctions are made using typographical emphasis (italics, underlining) or simply left to the reader to infer from the context, and the use of accents in such cases may appear dated.\n\nThat explains the use of the acute accent (which is similar to the use of optional diacritics in Norwegian), but whoever wrote that entry maintains that å cannot take the accent mark, which is presumably contrary to whatever document resulted in the inclusion of Aringacute in ISO 10646 and Unicode.\n\nAnnex G of the CEN document _User requirements study and programming for standardization in the field of Character Set Technology_ provides the table of contents of the _Nordic cultural requirements on information technology_ publication:\n\n[http://www.open-std.org/CEN/TC304/docs/pt01-fin.htm](http://web.archive.org/web/20120421233938/http:/www.open-std.org/CEN/TC304/docs/pt01-fin.htm \"http://www.open-std.org/CEN/TC304/docs/pt01-fin.htm\")\n\nNote that this includes 'Library application', and as I wrote above such use tends to be very inclusive of possible accentuation, since library catalogues need to be able to accurately represent information from books of different periods, when diacritic use may have varied.\n\n"
    },
    {
      "time": "5 Dec 2007 — 4:04pm",
      "content": "I wouldn't take Evertype documents at face value. For instance the quotation marks are wrong. Shown is the Anglo tradition whereas Denmark traditionally follow the Germanic tradition: „Dansk“ not “Dansk”. The two references mentioned is the standard (small) Danish dictionary which I doubt has anything on aringacute, and the other I can't find on the interweb so who know what is in that one?\n\nFurther, if you search the 22'500 pages dictionary 'Ordbog over det danske Sprog' for aringacute it comes up with nothing. But then again ODS only cover the period of 1700 to 1950, so the ǻ might be of older date.\n\nAnyhoot, I will give 'Dansk Sprognævn' a call tomorrow.\n\n"
    },
    {
      "time": "5 Dec 2007 — 2:55pm",
      "content": "_Anyhoot, I will give ’Dansk Sprognævn’ a call tomorrow._\n\nGreat. I look forward to seeing what you discover. I've been trying to locate a copy of the _Nordic cultural requirements on information technology_ publication, but I have not so far managed to do so. I'll also contact some people at the UTC to see if they can shed any light on how the character ended up in Unicode.\n\n"
    },
    {
      "time": "5 Dec 2007 — 3:00pm",
      "content": "Well, they are the folks that gave smileyface and a cup of coffee their own code points :-)\n\n"
    },
    {
      "time": "5 Dec 2007 — 4:55pm",
      "content": "Thanks for posting all this extra info.\n\n"
    },
    {
      "time": "5 Dec 2007 — 5:16pm",
      "content": "Ken Whistler at the Unicode Technical Committee confirms that the Aringacute entered Unicode as part of the merger of character sets with ISO 10646, i.e. Unicode 1.1. U+01FA..U+01FF came in as a set, and presumably from one of the Scandinavian national standards bodies, most likely the Danes. Ken also confirms that the characters with acute accents, including Aringacute, are listed on page 24 of the _Nordic Cultural Requirements on Information Technology_ publication, and are annotated in the Danish column as 'Letters seldom used in writing the language'.\n\nNick: _Well, they are the folks that gave smileyface and a cup of coffee their own code points_\n\nThe smiley face may have come into Unicode via Apple, and I believe the 'hot beverage' symbol originated with the Japanese. There's this mistaken idea that the Unicode consists of a bunch of people coming up with characters to encode, but most of the characters are proposed by other bodies or by individual researchers, and the UTC's task is to review and determine whether the proposed characters should be encoded and how, and it does so in coordination with WG2, the ISO body responsible for 10646. It just happens that most font developers come to know the Universal Character Set via Unicode.\n\n"
    },
    {
      "time": "6 Dec 2007 — 5:06am",
      "content": "I just called them and got the number of a person from Dansk sprognævn who was present at the 1992 Icelandic meeting mentioned as the second source in the Evertype document. She is in tomorrow, and I'll give her a call then.\n\n"
    },
    {
      "time": "6 Dec 2007 — 10:55am",
      "content": "_most of the characters are proposed by other bodies or by individual researchers_\n\nI wasn't poking fun at any particular organization, just Unicode workers in general.  \nI suppose it's rather like typefaces.  \nSome people may say, \"Don't we have enough typefaces already?\" -- of course not!  \nSo in answer to the question, \"Don't we have enough Unicode characters already?\" -- of course not, there are tens of thousands of codepoints waiting to be filled!  \nAny news on the Ruble?\n\n"
    },
    {
      "time": "6 Dec 2007 — 11:07am",
      "content": "_’hot beverage’ symbol originated with the Japanese_\n\nwhat? no kanji character for \"hot beverage\"?\n\n"
    },
    {
      "time": "6 Dec 2007 — 11:15am",
      "content": "MacDonalds must have come up with one to avoid more spurious law suits :-)\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2007 — 4:32pm",
      "content": "In countries that don't have central heating as a standard thing hot beverages are probably more compelling come winter.\n\n"
    },
    {
      "time": "5 Aug 2009 — 4:58am",
      "content": "Classic.\n\nThis is totally my favourite character. I like the idea that it may or may not exist. In my world it does, and will continue on my way creating a .sc for it (which I notice Adobe Garamond Premier Pro has conspicuously left out).\n\nBonus point to the first person to use it. Perhaps one day I can design a Danish dictionary?\n\nHere's how it looks in ISOGLYPH with its friends aogonek and ae...\n\n/michael\n\n ![](http://web.archive.org/web/20120421233938im_/http:/typophile.com/files/aringacute_5120.png)\n\n"
    },
    {
      "time": "5 Aug 2009 — 11:00am",
      "content": "\\> _(which I notice Adobe Garamond Premier Pro has conspicuously left out)_\n\nWhich family are you talking about? [Adobe Garamond Pro](http://web.archive.org/web/20120421233938/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1703) or [Garamond Premier Pro](http://web.archive.org/web/20120421233938/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1737)?\n\n"
    },
    {
      "time": "5 Aug 2009 — 2:08pm",
      "content": "Miguel, I have been looking at Adobe Garamond Premier Pro. Version 1 Revision 14.\n\nAringacute  \naringacute  \naringacute.sc\n\nare currently \\*not\\* included.  \nall others are seem present and correct.\n\nI notice they are not in Myriad either.  \nI only noticed as I am trying to cover the Extended Latin character set used by Adobe and H&FJ.\n\n/michael\n\n"
    },
    {
      "time": "5 Aug 2009 — 4:52pm",
      "content": "\\> _I have been looking at Adobe Garamond Premier Pro. Version 1 Revision 14._\n\nI just checked the Regular font and ALL the glyphs ARE included. They're actually named,\n\nuni01FA  \nuni01FB  \nuni01FA.sc  \nuni01FB.sc\n\nThey're also correctly included in the respective features, Small Caps (smcp) and Caps To Small Caps (c2sc).\n\n(BTW, there's no \"Adobe\" in \"Garamond Premier Pro\")\n\n\\> _I notice they are not in Myriad either._\n\nWhich version? Myriad Pro v2.007 has them.\n\n"
    },
    {
      "time": "6 Aug 2009 — 12:35am",
      "content": "@Miguel\n\n**Re: Garamond Premier Pro**\n\n`uni01FA Aringacute\nuni01FB aringacute\nuni01FA.sc aringacute.sc\nuni01FB.sc Aringacute.sc`\n\nCool.\n\n**Re: Myriad:**\n\n\\> I notice they are not in Myriad either.\n\n<cite> &gt;Which version? Myriad Pro v2.007 has them. </cite>\n\n`uni01FA\nuni01FB`\n\nAs code - I see them now!\n\nThanks,\n\n/michael\n\n"
    },
    {
      "time": "6 Aug 2009 — 6:17am",
      "content": "Michael\n\nIf you are used to line commands, then here is a Python script that outputs all the unicode points in a font file.  \n`\n----\n#!/usr/bin/python`\n\nimport&nbsp;fontforge,sys  \nfnt=fontforge.open(sys.argv[1],1)\n\nfor&nbsp;g&nbsp;in&nbsp;fnt.glyphs():  \n&nbsp;&nbsp;&nbsp;if&nbsp;(g.unicode&nbsp;!=&nbsp;-1):  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;print&nbsp;\"%04X\"&nbsp;%&nbsp;(g.unicode)  \n----  \n  \nIt works well on a mac (more generally on unix) and assumes [**FontForge**](http://web.archive.org/web/20120421233938/http:/fontforge.sourceforge.net/) is installed. Say you call the script `lstucodes`, you make it executable, and you put it in some folder in your path. Then, to see what unicode characters there are in `GaramondPremrPro.otf` you just type \"`lstucodes GaramondPremrPro.otf`\" where the font is. If you don't want the error messages, you type \"`lstucodes GaramondPremrPro.otf 2>/dev/null`\"; if you want the list to be sorted then\n\n`lstucodes GaramondPremrPro.otf 2>/dev/null | sort`\n\ndoes it.\n\nIf for some reason you want both the unicode point and the glyph name, you replace the line\n\n`      print \"%04X\" % (g.unicode)`  \nwith  \n`      print \"%04X;%s\" % (g.unicode, g.glyphname)`\n\nHere is then a copy paste of part of the output on GaramondPremrPro.otf (Version 1.014)\n\n`\n01FA;uni01FA\n01FB;uni01FB\n01FC;AEacute\n01FD;aeacute\n01FE;Oslashacute\n01FF;oslashacute\n`\n\nIt is surprising to see all you can do with very short scripts like this.\n\nMichel\n\n"
    }
  ]
}
