{
  "id": "39750",
  "title": "Fairfield Inn Serif Font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hello again folks. Need some more help finding the font in the Fairfield Inn by Marriott logo (just the relevant portion is shown here):\n\n ![](http://web.archive.org/web/20141110022648im_/http:/typophile.com/files/fairfield_6473.jpg)\n\nI don't think the _Fairfield_ and _Inn_ are the same (the serifs look a little different, and the _Inn_ looks heavier as well), but just posting the _Inn_ may not be particularly helpful. The _Inn_ is all I really need to replicate, though.\n\nAssistance is most appreciated!\n\n",
  "author": "iskippy227",
  "time": "4 Dec 2007 — 11:47am",
  "uid": "20451",
  "comments": [
    {
      "time": "4 Dec 2007 — 11:57am",
      "content": "FAIRFIELD is based on Goudy\n\nNot sure which version...\n\n"
    },
    {
      "time": "4 Dec 2007 — 11:57am",
      "content": "Customized Goudy Old Style. The INN could be the small caps.\n\n"
    },
    {
      "time": "5 Dec 2007 — 6:32am",
      "content": "Based on the suggestion of Goudy, I played around with it in Illustrator this morning. When attempting to change the fill colour, I accidentally added a stroke to some type I set in Goudy Extra Bold, and, what do you know, it came pretty darn close. I should be able to play with the stroke and tracking and get it pretty close to perfect.\n\nThanks for setting me on the right path!\n\n"
    },
    {
      "time": "5 Dec 2007 — 7:27am",
      "content": "Not that recreating a logo isn't isn't a fun and educational exercise, but if you just need the artwork...\n\n[http://brandsoftheworld.com/search/?query\\_id=31658486&page=1&brand\\_id=59072](http://web.archive.org/web/20141110022648/http:/brandsoftheworld.com/search/?query_id=31658486&page=1&brand_id=59072 \"http://brandsoftheworld.com/search/?query\\_id=31658486&page=1&brand\\_id=59072\")\n\n"
    },
    {
      "time": "5 Dec 2007 — 7:50am",
      "content": "\"but if you just need the artwork...\"\n\nAlways thought it would be good to have a resource like this - didn't realize it was already there. Thanks for the link.\n\nThe Fairfield Inn sample there is totally different though.\n\n"
    },
    {
      "time": "5 Dec 2007 — 8:46am",
      "content": "That one must be an older one. The second one on that page is the one they currently use.\n\nMy problem was that my client is a Fairfield _Inn & Suites_ location, and, try as I might, I couldn't find a version of this logo (hence needing to know what they used for _Inn_ so I could add _& Suites_). I have found BotW indispensable in the past, though, and didn't even think to check there first.\n\n"
    }
  ]
}
