{
  "id": "39775",
  "title": "Ommegaand - Featured Face",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I like this type. Is it just me or is the spacing really loose? It has an early silent films feel to it, like the type they'd use for the dialog placards between shots.\n\n",
  "author": "AndrewSipe",
  "time": "5 Dec 2007 — 6:56am",
  "uid": "6496",
  "comments": [
    {
      "time": "5 Dec 2007 — 7:00am",
      "content": "It is very loose, I don't know if that is how the font is kerned/hinted or just how it was set for the titles.\n\nI keep wanting to call it Ohmigod.\n\n"
    },
    {
      "time": "5 Dec 2007 — 7:16am",
      "content": "Makes me think of [http://www.ommegang.com/](http://web.archive.org/web/20131101100143/http:/www.ommegang.com/ \"http://www.ommegang.com/\")\n\n"
    },
    {
      "time": "5 Dec 2007 — 7:24am",
      "content": "Maybe a dumb question, but how do they embed Ommegaad into the website with me having it in my computer?\n\n"
    },
    {
      "time": "5 Dec 2007 — 7:27am",
      "content": "I like some of the Mac Rhino faces, but this one appears to me quite awkward. To some others this might be nicely innovative, but for me, the rounds are too light compared to the verticals, resulting in a disturbingly uneven color. Also for me the serifs appear to be snapped on backwards. A traditional pen-influenced way (from Jenson on) is to have the left a thicker wedge and the right a thinner, longer horizontal. To me this makes visual sense, giving a sense of motion in the direction of reading. The other way around kind of feels to me like bumps in the road.\n\nI guess I should be an equal opportunity critic and say that I detested Super Duty. No problems with the crafting of the shapes, but I just took an antipathy to the brutal look and some difficult-to-read characters...\n\n"
    },
    {
      "time": "5 Dec 2007 — 8:56am",
      "content": "@mydot2001: It's embedded through Flash and JS, by a method known as [sIFR](http://web.archive.org/web/20131101100143/http:/www.mikeindustries.com/sifr) (or Scalable Inman Flash Replacement)\n\n"
    },
    {
      "time": "5 Dec 2007 — 10:10am",
      "content": "I have been looking at the PDF of Ommegaand, and I'm wondering if part of the unevenness I saw is due to a problem with hinting, or with embedding it in Flash, and not with the font. I still feel something is off, but when I look at it large in the PDF it looks a lot more balanced...\n\n"
    },
    {
      "time": "5 Dec 2007 — 10:19am",
      "content": "It's definitely spaced for text, not headlines. Typophile should adjust the tracking for use at this large size.\n\n"
    },
    {
      "time": "5 Dec 2007 — 11:20am",
      "content": "At the moment, sIFR does not support kerning, so the way it performs here is going to be slightly different than when users have tighter control over it, not to mention the rendering in Flash will undoubtedly affect its appearance on screen.\n\n"
    },
    {
      "time": "5 Dec 2007 — 4:49pm",
      "content": "<cite> sIFR does not support kerning </cite>\n\nThis explains a great deal. I kept wondering why Beorcana looked so different on Typophile - and that was the reason I most suspected. And Zara is of course 100% correct about rendering being a significant factor.\n\nBill, I agree with you that these is something about it that is surprising. I think part of it is the unusual details at the end of the top 'arm'\\* of the 'a'. The cuts at the joins are not as extreme as I would like when it's used at smallers sizes.\n\nBut the thing I like about it is the flavor of it. It's got a clunky but likeable voice.\n\nWhen you look closely at the serifs I think you find about half the reason for that voice. They are really weird. Weirder than I would expect you could get away with.\n\nBut there is something to that uneveness thing you brought up too. When you look at the o & u next to each other they don't match in the way you would expect. The feeling get from this - too naively I admit - is of uneven letter press. Perhaps that was the intent. To create something that slips an association of the coloful & antique past you - but in a new way. Of course maybe I am reading too much into it.\n\nI would prefer to set a menu or an information piece about a Hotel or a Magazine article in this font than a book. This isn't a ding or a negative - just my sense of what it's most suited to. I can say that about plenty of faces I respect - like Sanuk & Amalia for instance.\n\n\\* Actually I have forgotten if I ever knew - what is that part called anyway?\n\n"
    },
    {
      "time": "7 Dec 2007 — 9:50am",
      "content": "Eben, looking again, I think what is most causing what is for me an unbalanced look is the disparity in the treatment of top horizontal arches. The treatment of the arches on the hmn is much heavier than in the acdso, for example. It is not just that the biggest and smallest places are different, but also that so much weight is carried from the right stems on the mnh so far into the join with the left stems. Stefan has other fonts that are well balanced, so these things were deliberate decisions. But for me they break the boundaries of what the eye is comfortable reading.\n\n"
    },
    {
      "time": "7 Dec 2007 — 11:53am",
      "content": "Yes, looking at the s & b vs the n I see what you mean. This is what I was getting at when I said <cite> The cuts at the joins are not as extreme as I would like when it’s used at smallers sizes. </cite> I should have been more specific. I also agree with Andrew about it seeming a bit loose. That said, I have to admit it is sort of growing on me a bit.\n\n"
    }
  ]
}
