{
  "id": "39777",
  "title": "Tell me more about Parachute fonts",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "General Discussions",
    "Type ID Board [OLD]"
  ],
  "content": "I'm looking at this foundry called Parachute Fonts and it's sort of obvious that their designs were 'inspired' by well known typefaces. Anyway, there's one typeface I really like and I'd very much like to know what is the original:\n\n[http://www.parachute.gr/fonts.aspx?Sample=1&FontStyleID=&FontFamilyID=7&...](http://web.archive.org/web/20140307112243/http:/www.parachute.gr/fonts.aspx?Sample=1&FontStyleID=&FontFamilyID=7&CharacterSetID=12 \"http://www.parachute.gr/fonts.aspx?Sample=1&FontStyleID=&FontFamilyID=7&CharacterSetID=12\")\n\nIf I'm wrong (meaning if Parachute are not ripping anyone off) I apologize in advance!\n\n",
  "author": "raa",
  "time": "5 Dec 2007 — 7:05am",
  "uid": "12957",
  "comments": [
    {
      "time": "5 Dec 2007 — 11:26am",
      "content": "Rade, you should re-title your subject as \"Parachute Fonts! What the rip?\"\n\n(On second thought I have re-titled it for you to see if more people don't bite.)\n\n(I edited out a phrase which seemed far too harsh)\n\n"
    },
    {
      "time": "5 Dec 2007 — 12:09pm",
      "content": "Someone once has added a typophile wiki stub about [Parachute](http://web.archive.org/web/20140307112243/http:/www.typophile.com/wiki/Parachute). However, it doesn’t address the originality question.\n\n"
    },
    {
      "time": "5 Dec 2007 — 2:37pm",
      "content": "Parachute at ICTVCIII...\n\n ![](http://web.archive.org/web/20140307112243im_/http:/typophile.com/files/parachute_5053.jpg)\n  \nLook like an honest pair to me.\n\nVia [http://www.flickr.com/groups/ictvc2007/pool/](http://web.archive.org/web/20140307112243/http:/www.flickr.com/groups/ictvc2007/pool/ \"http://www.flickr.com/groups/ictvc2007/pool/\")\n\n"
    },
    {
      "time": "5 Dec 2007 — 2:40pm",
      "content": "But Si, are they taking that glyph? :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Dec 2007 — 3:31pm",
      "content": "Thought someone might ask that question. No they were delivering it to their booth at the conference.\n\n"
    },
    {
      "time": "6 Dec 2007 — 12:10pm",
      "content": "Those appear to be very expensive fonts for just being knock-offs (if that's what they are)\n\n"
    },
    {
      "time": "6 Dec 2007 — 2:01pm",
      "content": "I am moving this thread to the TYPE ID area so the original question can be answered by the experts.\n\n"
    },
    {
      "time": "6 Dec 2007 — 3:36pm",
      "content": "So you guys think I might have made a rushed judgement there? Well, I hope so. I certainly wouldn't mind using Agora should it be an original design.\n\n"
    },
    {
      "time": "6 Dec 2007 — 10:26pm",
      "content": "I'll go out on a limb and say these \\*are\\* original designs, albeit ones that draw on influences or sources also seen in other faces.\n\nI rather like their take on German and American highway signage (DIN and Highway Sans), and see some features I like better than similar offerings from Fontshop (FF Din) and Font Bureau (Interstate).\n\nParachute seems to enjoy introducing a bit of funkiness into their heavier weights, which I also enjoy.\n\nAs for Agora, its three iterations (sans/serif/slab) would make a nice corporate identity package.\n\n"
    },
    {
      "time": "15 Dec 2007 — 5:33am",
      "content": "Oh my God!  \nThat guy on the right is me.  \nRipping other fonts? Please!!!\n\nHappy to be here, anyway... :-(\n\n"
    },
    {
      "time": "15 Dec 2007 — 7:52am",
      "content": "The name 'Agora' is a bit unfortunate, since that is the name of an [Albert Boton font](http://web.archive.org/web/20140307112243/http:/www.myfonts.com/fonts/berthold/agora-bq/) for Berthold.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "16 Dec 2007 — 9:28am",
      "content": "Welcome, Charis!\n\nChrisL\n\n"
    },
    {
      "time": "17 Dec 2007 — 10:50am",
      "content": "As a new member (this is my second time around) and not having made any friends yet in this forum, I feel being in an awkward position to defend several years of work as a type designer and the 7+ years of Parachute’s existence. Parachute may be new to you (our site just went up a few months ago), but we are well established in the local market.  \nIf we were to believe member ‘raa’s’ unacceptable title, then corporations such as Ikea, Vodafone, Nestle, Unilever, BBDO, McCann Erickson, JWT, Saatchi & Saatchi, DDB, Leo Burnett, TBWA, Ogilvy & Mather, National Geographic, Playboy, Elle, Harper’s Bazaar, PC Magazine, Votre Beaute, National Bank of Greece, and so many others must be doing something wrong being our clients.  \nWell known design agencies in Germany, England and the United States must have been out of their minds when they purchased PF Agora Sans Pro.  \nSchools and conference organizers must be doing something wrong when they invite us as guest speakers.  \nThe awards we received over the last few years should not have been given to us.\n\nLet me invite you all to visit our site [http://www.parachute.gr](http://web.archive.org/web/20140307112243/http:/www.parachute.gr/) and spend some time reading all about Parachute before you make any rush judgments. Read about each and every typeface, read how they were made, when they were made, how they differ, what more they have to offer, download the 30+ page pdfs and see for yourself. We do not claim some high degree of originality here, but \\*only to the same level as other companies do\\*.\n\nInfluences? Yes a lot. But don’t you see this in all new faces? As Goudy once said “the old guys stole our best ideas”. If originality was questioned, in this harsh and inappropriate way, anytime each one of us spotted some sort of ‘inspiration’ from another source, then all existing new faces would have been knockoffs to different people for different reasons. I myself, and assume many of you, every time I look at typefaces I find similarities to other ones. This does not necessarily mean one is a knockoff of the other.  \nA knockoff is a cheap almost-identical or simply identical version of an existing original typeface and definitely not something you have created from scratch and of course not something that is based on public domain material.  \nParachute fonts, as member ‘aluminum’ mentioned, are expensive. Imagine that. A knockoff that expensive!! Who are you kidding ‘raa’? Parachute fonts are original as much as others can be, very well crafted and designed to offer more than other competitive typefaces, simultaneously supporting Latin, Greek and Cyrillic.\n\nIf we were to be blamed for designing some highly competitive typefaces like the Din Text Pro Series, Highway Sans Pro etc, which were created using original public domain sources in the most ethical way (old manuscripts, manuals for major standards, historic catalogs), then we are guilty as charged. Nothing to hide, just read the credits. I’m glad that members like ‘marcox’ have already picked their favorite.  \nBut if we were to be judged based on one member’s misconception then that makes me really mad.\n\nBy the way 'raa', to save up some time to you looking for demons, PF Agora Sans Pro was based on PF Agora Serif Pro as well as some older incomplete commisioned work. Period.\n\nI thought that Typophile is a forum that deals with typography issues to the extend that would not allow its members damage a company’s reputation with such vague comments.  \nOtherwise thanks but no thanks ‘Miss Tiffany’ for rephrasing the title. I don’t think you believe that made things much less harsh.\n\nI would like to see some of you out there question the “legit typefaces” that big companies offer using the same unacceptable comments as member ‘raa’ so light-heartedly used and then you’ll see how fast and hard they will come down on you. Myself, I’ll stick to this honest answer and hopefully it is appreciated.\n\n-I feel that your title is inappropriate, offensive and should be altered.  \n-Dirt may be washed off but bad stain stays there forever.  \n-If only, a small company like Parachute would have expected your support.\n\n-Panos Vassiliou\n\n"
    },
    {
      "time": "17 Dec 2007 — 11:04am",
      "content": "Panos, the part about me editing something that was too harsh was in my own post. I removed it because it did sound too harsh. As a sort of olive branch I've also edited the thread title. (Not something we often do.)\n\n"
    },
    {
      "time": "17 Dec 2007 — 11:17am",
      "content": "Thanks Tiffany,\n\nI appreciate it!\n\n"
    },
    {
      "time": "17 Dec 2007 — 12:43pm",
      "content": "Panos...methinks you were a tad too defensive there. Which is perhaps understandable. I believe raa was simply asking the question (and not intentionally accusing anyone). I, for one, am glad you were able to come in and answer it! Thanks...and look forward to having parachute on the radar!\n\n"
    },
    {
      "time": "17 Dec 2007 — 12:50pm",
      "content": "Panos, perhaps some good may come of this -- I've contacted you via e-mail regarding corporate licensing for some of your families, something which wouldn't have happened without this thread. :)\n\nMarc\n\n"
    },
    {
      "time": "17 Dec 2007 — 1:18pm",
      "content": "I think a more subtle but appropriate design question would be....other than the apparently excellent foreign language support, what is there about HIghway Sans for example that would motivate a graphic designer to license it, if he/she already had FB Interstate? Or PF DIN if one already had FF DIN?\n\nI do think the Agora family looks nice and interesting though, I like well-thought-out designs that cover the serif, sans, and slab angles as a coherent whole. NIcely done.\n\n"
    },
    {
      "time": "17 Dec 2007 — 1:49pm",
      "content": "To me, Parachute's take on DIN and highway signage is not as strictly beholden to its sources of inspiration -- less geometric and more typographic, most obviously in the italics, but even in the joins and shapes of the roman.\n\nWhether that would be enough to entice someone who already owned FF or FB versions to license the PF version, I don't know. (PF's DIN Display is an entirely different animal that could happily coexist with FF Din as body copy.)\n\nBut that's not really the point -- why can't we have multiple DINs along with our dozens of Garamonds?\n\n"
    },
    {
      "time": "17 Dec 2007 — 3:30pm",
      "content": "Parachute aside, legalities aside (as Din and most highway fonts are the most pure of pure public domain designs), I think people in the \"font world\" react to new DIN and highway fonts negatively as it's seen as bandwaggonism - cashing in on a popular genre.\n\nSame would go for most distressed typewriter fonts and Dymo label fonts.\n\n"
    },
    {
      "time": "17 Dec 2007 — 9:00pm",
      "content": "marcox--\n\nI'd say the short answer is because not all designers have unlimited budgets for font licenses--at some point, choices need to be made. I'd love to have the resources to license every quality font out there, the \"just-in-case\" design scenario--but realistically, I tend to shy away from designs that are just \"five percent\" moves from fonts I already have licensed.\n\nTwelve Garamonds? Yikes. Five is plenty for me; and one of them isn't even a Garamond at all (ITC).\n\n"
    },
    {
      "time": "16 May 2009 — 2:02am",
      "content": "panos, I wish I saw your post a year and a half ago but I haven't been on Typophile since I started this thread and nothing happened for a week.\n\nI'm terribly sorry that I had offended you. Seeing too many ripp-offs has probably made me over-suspicious. Plus, you guys had some high quality good work and still didn't exist on google. That was the reason I thought what I thought. But please read both my posts again, 5. and 6.Dec.2007 – I have allowed the possibility of being completely wrong and have appologized in advance.\n\nJust checked your website again. What happened to Agora?\n\nKeep up the good work, I'm off to take some forum behaviour lessons(or was this my lesson?)..\n\n"
    },
    {
      "time": "16 May 2009 — 3:07am",
      "content": "Agora has been renamed PF Centro Pro, probably due to the existence of another typeface called Agora as Mike Yanega mentioned.\n\nRaa, don't be too hard on yourself, and don't let this stop you from posting in the forums. It's just that we should be more careful to rush to judgements based on the lack of Google presence (especially if that is due to being active mostly in a non-Western market separated by a different writing system as well as language).\n\nBy the way, I would like to hear what people think of PF Centro Pro, including the Greek and Cyrillic designs. The Greek has some obvious details, like some serifs in the lowercase, that many of the Greek experts here would consider inauthentic but are in keeping with many of the contemporary designs produced in Greece.\n\n"
    },
    {
      "time": "25 Jun 2009 — 1:54am",
      "content": "i've only recently discovered parachute, and i'm liking them. i think their DIN is great.\n\n"
    }
  ]
}
