{
  "id": "39780",
  "title": "Which is the better way to organize my fonts? By foundry or by theme?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Apparently I am not going to use some manage software for my font.\n\nNow I am weighing cons and pros.\n\nEach way has its advantages, and I have to choose one, but one thing is clear that not every font has a foundry. Those free fonts are hard to trace its origins I guess.\n\nAny idea?\n\n [‹ Wanted Art Directors from London](http://web.archive.org/web/20081119051313/http:/www.typophile.com/node/39796 \"Go to previous forum topic\") [Security and Software hi tec feeling font ›](http://web.archive.org/web/20081119051313/http:/www.typophile.com/node/39782 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081119051313/http://www.typophile.com/user/24484\" title=\"View user profile.\">mydot2001</a>",
  "time": "<br>",
  "uid": "24484",
  "comments": [
    {
      "time": " 5.Dec.2007 7.50am",
      "content": "Personally, organizing by foundry does me little good. When I’m looking for a font to use for a project I’m much more likely to think “what’s a good condensed sans serif?” than “I wonder if anything from H&FJ would work for this project”. I think you should consider your own criteria - I realize a lot of typophiles do organize by foundry. The only two foundries that I have “sets” for in my Font Explorer are House Industries and Emigre, both of which (to me) have a pretty distinct personality. Plus your themes can extended beyond serif and sans serif to categories that might work better for you.\n\n"
    },
    {
      "time": " 5.Dec.2007 8.31am",
      "content": "Take a look at [http://www.fontscape.com](http://web.archive.org/web/20081119051313/http:/www.fontscape.com/ \"http://www.fontscape.com\")\n\nFontscape offers the time-honoured ’typographic’ classification scheme as well as many alternative schema, eg: appearance, application, mood, historical.\n\nj a m e s\n\n"
    },
    {
      "time": " 5.Dec.2007 8.43am",
      "content": "Organize by theme. Besides, you should be able to do a search by foundry if you know you want to stick to a specific one.\n\n"
    },
    {
      "time": " 5.Dec.2007 8.52am",
      "content": "Definitely theme… Makes it that much easier in those “Hmm... I think a Garamond would look good - but which?!”-situations as well...\n\n"
    },
    {
      "time": " 5.Dec.2007 9.14am",
      "content": "That fontscape link is actually pretty good, I was thinking about organising my fonts by Vox or some British classification system.\n\n"
    },
    {
      "time": " 5.Dec.2007 9.43am",
      "content": "The font files are organized by foundry in my computer but in font explorer they are in sets organized by theme.\n\n"
    },
    {
      "time": " 5.Dec.2007 9.48am",
      "content": "Organizing by foundry helps in some situations, but not ones directly related to selecting designs. If you’ve purchased/acquired fonts with varying licenses (e.g.: free fonts that are free for personal but not commercial use), the terms of the licenses might be a better search criteria. This will sometimes correlate to the foundry they come from, though not reliably so. Still, some foundries include a license brief in the copyright line (not a full EULA, just a statement) and this can be helpful.\n\n"
    },
    {
      "time": " 5.Dec.2007 11.21am",
      "content": "Once upon a time I organized my fonts like Patty, but then Suitcase gagged and I lost it and I have yet to go back. Since that time I’ve organized by foundry. Why? Because foundries generally have a style and/or quality that represents the lot of their work. Jason’s mention of EULA also is important (to me).\n\n"
    }
  ]
}
