{
  "id": "39792",
  "title": "Advent Calendar",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I don't know if there is a similar tradition out of europe ... at the first of december we open ”doors or windows” of an advent calendar until the 24.th of december. On the german type related blog ”Slanted\" i offer one in this year, where i show a small amount of my collection of wrapping papers of oranges. Every day i'll add a new one. Perhaps someone is interested in regarding ...  \n [http://www.slanted.de/node/1561](http://web.archive.org/web/20131011084742/http:/www.slanted.de/node/1561 \"http://www.slanted.de/node/1561\")\n\n ![](http://web.archive.org/web/20131011084742im_/http:/typophile.com/files/01_3941.12.jpg)\n\n",
  "author": "nora g",
  "time": "5 Dec 2007 — 12:04pm",
  "uid": "21512",
  "comments": [
    {
      "time": "5 Dec 2007 — 12:43pm",
      "content": "Nora, those are lovely. Do you collect these on a regular basis or only when you travel? Louise Fili shared some in her book(let) [A Designer's Guide to Italy](http://web.archive.org/web/20131011084742/http:/louisefili.com/books/b3.html).\n\n"
    },
    {
      "time": "5 Dec 2007 — 3:00pm",
      "content": "Thanks Tiffany. I have a lot of them, but i stopped collecting because of not knowing where to store more big boxes with a lot of sheet of papers in it ;-) and I'm really no \"good\" collector – because i hate to press these papers. In my opinion they loose their souls. I love to touch the papers and to hear the rustling sound of the paper. But i collected them at stores around the corner while buying fruits. Sometimes i can't resist ... Here in Germany there is one really professional collector. His name is Dirik von Oetttingen and his collection is about 40.000 papers. There are a lot of very fine and very old papers, while mine are really common. He published a fine book now, where you can stare at old sicilian ornaments, and more ... it's written in german, but even if you aren't able to read german it's worth regarding. (http://www.amazon.de/Verhüllt-verführen-Die-Welt-Orange/dp/3930752476/ref=pd\\_bbs\\_sr\\_1?ie=UTF8&s=books&qid=1196890004&sr=8-1)\n\n"
    },
    {
      "time": "5 Dec 2007 — 2:51pm",
      "content": "I think these would make a charming gift book, printed on vellum of course.\n\n"
    },
    {
      "time": "5 Dec 2007 — 3:47pm",
      "content": "Yeah, that would be a great book, Patty.\n\nNora, that book is all about his collection? Too bad amazon.com doesn't have it. It would be an interesting book to view.\n\nI think ephemeral collecting might begin as \"common\" things, but it is the story and the reason behind the collecting that makes them uncommon. Your collection will, one day, tell a story to others who didn't share the same store as you. (For instance)\n\n"
    },
    {
      "time": "5 Dec 2007 — 11:47pm",
      "content": "Perhaps you can get in contact with the publisher. It is the ”vacat verlag” in Potsdam. The owner ist Betina Müller. She also teaches typography and did the artwork for this book. You can ask her if there is a possibility to deliver the book outside of europe.  \n [http://www.vacatverlag.de/?show=vacat&p=p\\_11&sName=vacat](http://web.archive.org/web/20131011084742/http:/www.vacatverlag.de/?show=vacat&p=p_11&sName=vacat \"http://www.vacatverlag.de/?show=vacat&p=p\\_11&sName=vacat\")\n\n"
    },
    {
      "time": "6 Dec 2007 — 10:39am",
      "content": "Sorry, nothing really new here. I tried to correct a mistake. The book isn't written in english but in german language. After correcting the post above, it has changed his place ...\n\n"
    },
    {
      "time": "6 Dec 2007 — 11:29am",
      "content": "Nora, I edited the time stamp to put it back. (although I probably should've just left it alone.)\n\nThanks for the contact information. :^)\n\n"
    },
    {
      "time": "6 Dec 2007 — 6:51pm",
      "content": "We have advent calendars in the US, but I've never heard of 'orange wrappers'. Nice collection!\n\n"
    }
  ]
}
