{
  "id": "39800",
  "title": "Resume/Business card critique?",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I'm a student about to have my final review before graduation, and I've been agonizing over the type in my resume/business card. Because of administrative idiocy I was unable to take the advanced typography class but have tried my best to progress on my own, but my confidence is shaky and I'm somewhat unsure of myself. I've done a lot of lurking on these forums and many of my decisions regarding type and format of this resume are inspired ideas I've seen here, as I'm sure you'll notice.\n\nI'm trying to communicate that I love clean, simple design that shows a respect and inspiration from the past while embracing the current. I also want to show some friendliness, cleverness, humor. I love classic, tried and true typefaces but am constantly infatuated with fun, new beautiful options. I'm dying to get into the professional environment and learn. I'm just now really trying to develop my own sense of what faces go together well based on proportions, origin, etc. I feel like that's somewhere many of my typophobic classmates might be pretty lacking.\n\nIf the 2 typefaces are just too much, let me know and I'll pare it down. As for suggestions of other typefaces, I have a surprisingly good selection of (many probably pirated.. ugh) typefaces at work so chances are I'll have access to whatever you're suggesting. I can spend a little money on purchasing a typeface if I fall in love with it and it's not overly pricey.\n\nI've posted 2 versions of my resume, which is on my personal letterhead. My personal information on the letterhead is basically my businesscard, so I would love an independent critique of that as well. I can post an image of that alone if needed.\n\nOne is set in Trade Gothic LT Std - Bold Condensed No. 18 and Proforma\n\nThe other version is set in Dolly and Auto 2\n\nTear it up! I can take it. And thanks =)\n\nps - No fine kerning has been done yet, just fyi\n\n| Attachment | Size |\n| --- | --- |\n| [resume\\_dollyauto.pdf](http://web.archive.org/web/20130310021115/http:/typophile.com/files/resume_dollyauto.pdf) | 476.46 KB |\n| [resume\\_proformatrade.pdf](http://web.archive.org/web/20130310021115/http:/typophile.com/files/resume_proformatrade_0.pdf) | 426.04 KB |\n\n",
  "author": "wren_fern",
  "time": "5 Dec 2007 — 2:17pm",
  "uid": "24702",
  "comments": [
    {
      "time": "5 Dec 2007 — 3:10pm",
      "content": "Of the two, I'd definitively go for the Trade Gothic/Proforma-version - it's just that much cleaner, lighter and more consistent on the retro-feeling…\n\nThe four different cuts (Proforma small-caps, italic and book and the Trade Gothic) is a bit much for me - but I'm not sure how I'd scale it down... Perhaps try something different for the subheads (the Proforma Italics)…\n\nAnd, I'm not sure if I agree with myself on this one, but how about letting the bullets line up with those subheads? I mean, every level already has a different typographic style, I don't think the indentation really needs to be _that_ prominent..? I'd also consider just a little more leading..?\n\nOh, and you're missing an fi-ligature in the ‘business card’-field - “purveyor of **fi** ne graphic design services”... And, not having ever been a great fan of Proforma I've never checked - but Proforma doesn't have ff-ligatures?\n\nBut all in all, I think you've done a great job on these! Loving the clean, retro look! Good luck job-hunting!\n\n"
    },
    {
      "time": "5 Dec 2007 — 3:53pm",
      "content": "I think I agree with pretty much all of your suggestions. I've been staring at it so long it's hard to see what little things can improve it. Thanks for noticing the ligature too!\n\nI've uploaded the version with the little edits to the main post.\n\n"
    },
    {
      "time": "5 Dec 2007 — 4:53pm",
      "content": "No need for the bullets.\n\n"
    },
    {
      "time": "5 Dec 2007 — 5:30pm",
      "content": "I like the Trade Gothic/Proforma version as well. What really communicates your design approach is the left section in the blue box, but I also think that's the part that needs the most work. Everything is too small and tight in that section. Add some space in there, leading, and also some space between the info and the blue box, it just seems crammed. And the type seems small compared to the copy to the right.\n\n"
    },
    {
      "time": "6 Dec 2007 — 8:22pm",
      "content": "'I’m trying to communicate that I love clean, simple design that shows a respect and inspiration from the past while embracing the current. I also want to show some friendliness, cleverness, humor. I love classic, tried and true typefaces but am constantly infatuated with fun, new beautiful options.'\n\nI like the Dolly and Auto combination because I feel it has a very cute character. I think the composition is fairly clean (which is cool) but maybe you could use your grid a bit more – your only using one column. This could help you to break down the information into yummy bite sizes rather the huge mouth-fulls. I don't mind your typeface choices but I think the positioning and composition could be improved.\n\n"
    }
  ]
}
