{
  "id": "39811",
  "title": "Wanted : Art Directors (London)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey everybody !\n\nMy request may sound a little awkward : I’m looking for Art Directors / Graphic Designers currently living and working in [London](http://web.archive.org/web/20080706223418/http:/www.typophile.com/wiki/London). I’m considering moving there, and I have a few work related questions that I would like to ask to a “local”. Plz contact me at [virginie@drduckling.com](mailto:virginie@drduckling.com) or on skype : drduckling. Or just via [www.typophile.com](http://web.archive.org/web/20080706223418/http:/www.typophile.com/ \"www.typophile.com\") if you prefer.  \nThanks in advance for the sense of community !\n\nVirginie\n\n [‹ Morris Fuller Benton and \"Yankee eclecticism\"](http://web.archive.org/web/20080706223418/http:/www.typophile.com/node/39662 \"Go to previous forum topic\") [[math] Moebius Transformation Revealed ›](http://web.archive.org/web/20080706223418/http:/www.typophile.com/node/39785 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706223418/http://www.typophile.com/user/14086\" title=\"View user profile.\">drduckling</a>",
  "time": "<br>",
  "uid": "14086",
  "comments": [
    {
      "time": " 6.Dec.2007 2.37am",
      "content": "London is hectic and busy, expensive and dirty and I don’t think I want to live here for too long. However the pay is better than outside of London and there’s always stuff to do and see.\n\nPlus its raining again...\n\nWhere would you be moving from? What area of design are you looking to move into?\n\nG\n\n"
    },
    {
      "time": " 6.Dec.2007 3.21am",
      "content": "Hey G,\n\nI’m coming from France.  \nI’m looking for an art director / graphic designer position at a fashion magazine or a creative agency. I’m starting to have interesting offers but It’s difficult for me to estimate what would be ideally my gross salary / annum.  \nSo I’m starting to collect informations about other art directors / graphic designers income there.\n\nI wanna live in zone 1 or zone 2 max. I have a daughter who’ll have to go to the French Lycée. What about health insurance ? do employers provide it there ?\n\nThanks again everybody for your support !\n\n"
    },
    {
      "time": " 6.Dec.2007 3.46am",
      "content": "well I’m a designer in my second year of design and my first at this magazine. Its a larger company (Natmags) than when I first started and so there are more benefits. My experience isn’t very broad, but it seems the larger the company, the more perks/policies you get. I think they offer me life insurance and a pension, but we’ve got the NHS for health problems so no need for health insurance (not entirely true, the NHS does suck so it depends what quality of healthcare you want).\n\nI’m on about 21k a year which does me ok. But then I’m only a designer with limited experience.\n\nZone 1 will cost ya. But then you’ll save on travel if you are within walking distance (and willing to do so) of your work. Oyster travelcards are not cheap to say the least (there are less polite words I could use to describe the London transport situation but this is a family restaurant...)\n\nI live at the edge of zone 2, in North Acton and it only takes me about half an hour to get to work at Oxford Circus on the central line.\n\nHope I’ve been of some help.\n\n"
    },
    {
      "time": " 6.Dec.2007 4.11am",
      "content": "Thanks a lot G !  \nI’ve gathered a lot of informaton this morning !  \nSo it’s getting more and more precise.  \nJust one thing, are u talking gross or net salary ?\n\n"
    },
    {
      "time": " 6.Dec.2007 6.15am",
      "content": "gross.\n\n"
    }
  ]
}
