{
  "id": "39814",
  "title": "Futura Oblique - wtf?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been researching obliques in preparation for the execution of the style in my own typefaces, and have found that Futura's oblique is literally nothing more than a 9 degree slant applied to the corresponding non-oblique weight. Now, while obliques are certainly simpler than true italics, they're still supposed to be more than just mechanical slanting. I might expect this from a cheaper face, but in the case of a designer-favorite like Futura, I was rather surprised.\n\nIs this more common than I apparently think? Futura's Oblique pays no attention to the changes that need be made to stroke width, diagonals and curves.\n\nBTW - For the experiment, I created two text boxes in Illustrator. Both were filled with A-Z, a-z and 0-9. One was in set in Futura Light, the other was in Light Oblique. I then converted them both to outlines and sheared the first text box (Futura Light) by 9 degrees. I then overlaid the two textboxes to find that EVERY glyph lines up EXACTLY.\n\nStrange stuff.\n\n",
  "author": "amv",
  "time": "6 Dec 2007 — 2:26am",
  "uid": "23823",
  "comments": [
    {
      "time": "6 Dec 2007 — 2:37am",
      "content": "This is quite common with sans serifs. Adrian Frutiger used to use it with his typefaces—I'm told—because back in the day when type foundry drawing offices still employed 100s of letter drawers, it would save the company so much time and money.\n\nBut if you look at Univers and Frutiger, as well as many other typefaces (like Helvetica, too) you will see that this is the case. Note that for new designs, this comes up way less. Good new families are expected to have true Italics. It seems to just be want the people want nowadays.\n\n"
    },
    {
      "time": "6 Dec 2007 — 2:39am",
      "content": "Mechanical obliques are just obtuse, especially in a giant like futura. Quite recently Avant Garde was completely redrawn... then the obliques were just slanted. I think it was linotype? I believe the futura the barbican in london uses as part of their corporate identity has tweaked obliques.\n\n"
    },
    {
      "time": "6 Dec 2007 — 2:45am",
      "content": "An italic companion to a sans does not necessarily make it better. Redrawing the oblique doesn't make it an italic in my opinion. It just makes it a better made slanted version. Ideoligically I'm not against sans italics, but they don't always fit where well made obliques do.\n\n"
    },
    {
      "time": "6 Dec 2007 — 2:54am",
      "content": "\\>_Quite recently Avant Garde was completely redrawn... then the obliques were just slanted. I think it was linotype?_\n\nYou are thinking of the recent ITC Avant Garde Pro OpenType version. This was made at ITC, not at Linotype. It is sold at itcfonts.com, linotype.com, fonts.com, and certainly many other locations.\n\n"
    },
    {
      "time": "6 Dec 2007 — 2:59am",
      "content": "As far as I know the Berthold versions of typefaces (including Futura) have visually corrected obliques.\n\n"
    },
    {
      "time": "6 Dec 2007 — 6:53am",
      "content": "Is it just me or does Storm design the most beautiful italics? Oh yeah, it's just me… :)\n\npbc\n\n"
    },
    {
      "time": "6 Dec 2007 — 8:44am",
      "content": "<cite>Is it just me or does Storm design the most beautiful italics? Oh yeah, it’s just me…</cite>\n\nThat’s not you, that’s Storm.\n\n"
    },
    {
      "time": "6 Dec 2007 — 9:26am",
      "content": "\\>Quite recently Avant Garde was completely redrawn... then the obliques were just slanted.\n\nThis was discussed here (I think) and on [typographica](http://web.archive.org/web/20130203114717/http:/typographica.org/001029.php). I think it would be wrong to say it was \"completely redrawn\". I think it would be better to say that it was reworked and extended. ITC made the decision to maintain backward compatibility with the existing version of the font and that drew criticism with some people seeing the effort as a somewhat wasted opportunity.\n\n"
    }
  ]
}
