{
  "id": "39837",
  "title": "Where are my Ligatures...?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "As an old-school-trained typo (ie: pencils and character counting, definitely a dead art) I sometimes struggle with applications like Flash, which seem never intended to natively support what I consider to be basic typographic considerations such as ligatures.\n\nUsing my Mac, I can easily type Option-Shift-5 for an ’fi’ lig and Option-Shift-6 for an ’fl’, but what do I do when I want more ligatures?\n\nI’m specifically after an ’ffi’ lig, which I don’t know the key combination for. But how would I determine the key combos for this, or for an ’ffl’ - especially when I have an expert set available?\n\nIs there an app or utility which would look at the font and tell me what key combo to use? I seem to remember something that did this under Mac System 7, 8 and 9 (showing my age now, lol), but can’t find anything similar for OSX.\n\nI’m not sure if this final bit of info is relevant or not, but it’s an Open Type font I’m using - a well-crafted one too, so I’m sure the ligatures will be present.\n\nPlease help me find them!\n\n [‹ Cooper Black Italic swash alternates?](http://web.archive.org/web/20071208124153/http:/www.typophile.com/node/15256 \"Go to previous forum topic\") [The average / 'perfect' lettershape... ›](http://web.archive.org/web/20071208124153/http:/www.typophile.com/node/39813 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071208124153/http://www.typophile.com/user/8866\" title=\"View user profile.\">JonPhillips</a>",
  "time": "<br>",
  "uid": "8866",
  "comments": [
    {
      "time": " 6.Dec.2007 12.44pm",
      "content": "PS : It’s really annoyed me that my single quote marks in the post above are all facing the same way. Apologies to anyone else similarly offended.\n\n"
    },
    {
      "time": " 6.Dec.2007 12.55pm",
      "content": "There are almost 100.000 characters defined in Unicode. Not everyone can have a keyboard shortcut by default. ffi and ffl certainly don’t have one.  \nWhich app do you use to type? In apps like InDesign ligatures can be replaced by default. In apps like word these ligatures may not be available at all.\n\nRalf\n\n"
    },
    {
      "time": " 6.Dec.2007 1.18pm",
      "content": "In old Postscript fonts, these ligatures, when provided, would have been accessible via the keyboard because they would have been put in place of other characters (rather than having a place of their own). So, for instance, typing a W would yield the ffi character in an old Adobe expert set. Other foundries had/have different standards. (For instance, H&FJ and Font Bureau would put ffi in the ∞ position in their regular fonts.)\n\nIn an Opentype font, however, ff-ligatures have their own unique place, but cannot be accessed via the keyboard. They must be deployed via OpenType layout features (specifically the {liga} feature). Or they may be manually inserted, if the application offers a method to do this (such as the glyph palette in Adobe applications).\n\nIf your application provides neither of these, then you may be out of luck.\n\n— K.\n\n"
    },
    {
      "time": " 6.Dec.2007 2.13pm",
      "content": "_single quote marks in the post above are all facing the same way._\n\nSmartyPants software contextually substitutes single and double “dumb” quotes by curly quotes, however:\n\nAll single quotes are treated as “right” quotes — this allows the apostrophe for abbreviation to work correctly.  \nSo you have to adopt the North American style of using double quote marks for primary quotations, to make the system work correctly.\n\n"
    },
    {
      "time": " 6.Dec.2007 3.04pm",
      "content": "Many thanks for the above replies, it’s great to have so much expert help available.\n\nI’d like to ask one more question regarding kentlew’s post above :\n\n“In an Opentype font, however, ff-ligatures have their own unique place, but cannot be accessed via the keyboard. They must be deployed via OpenType layout features (specifically the {liga} feature). Or they may be manually inserted, if the application offers a method to do this (such as the glyph palette in Adobe applications).”\n\nPlease can you explain the {liga} feature you mention? I think I broadly understand what you mean, but in an application like Flash (where I have my specific problem), apart from using key combinations, how would I deploy the ligatures I need?\n\nI think I’m basically asking how do I find the characters I require?\n\n"
    },
    {
      "time": " 6.Dec.2007 4.07pm",
      "content": "Maybe there’s an easier way, but on OS X you can open the Character Palette which is in your System Preferences under International/Input Menu. From there you can view Glyph for whatever font you need and drag the ligatures you need into Flash. There has to be a better way, but I haven’t had much time to look.\n\n"
    },
    {
      "time": " 6.Dec.2007 4.44pm",
      "content": "Flash currently lacks support for OpenType advanced typographic features.  \nOpenType substitutions (ligatures, for example) don’t work in it.\n\n[Adobe is working on a “new low level text framework” for the next Flash Player](http://web.archive.org/web/20071208124153/http:/weblogs.macromedia.com/emmy/archives/2007/05/tiny_clarificat.cfm). Priorities seem to be bidirectional / complex text layout support. Maybe we will finally have OT support in Flash?\n\nI wonder how this will perform in terms of CPU load... I imagine it could get very heavy very quickly, AS code and OT lookups running at the same time.\n\n— [omine.net](http://web.archive.org/web/20071208124153/http:/www.omine.net/)\n\n"
    },
    {
      "time": " 6.Dec.2007 5.08pm",
      "content": "It is true that Flash does not support OpenType like it should, but you can still put ligatures in as I said above. Because it doesn’t support automatic substitutions like other programs it can be rather annoying to do, but it does work.\n\n"
    },
    {
      "time": " 6.Dec.2007 5.15pm",
      "content": "I don’t recall opentype liga or calt features being supported in Flash. I will have a look. - Nope. I don’t think so. Not even in CS3. You could always import outlines from Illustrator if it’s a one-off headline.\n\n"
    },
    {
      "time": " 6.Dec.2007 5.28pm",
      "content": "Flash won’t take everything, but you CAN put in ff ffi ffl st and maybe some others. You just have to try the one you want, but as JonPhillips said, he was looking specifically for ffi which works fine for me in Flash CS3 by dragging from the Character Palette.\n\n"
    },
    {
      "time": " 6.Dec.2007 7.27pm",
      "content": "\\> _on OS X you can open the Character Palette which is in your System Preferences under International/Input Menu. From there you can view Glyph for whatever font you need_\n\nThis is true as long as the glyph as a Unicode value assigned to it (either PUA or not). Unencoded glyphs do not show up in the Character Palette.\n\n"
    },
    {
      "time": " 6.Dec.2007 9.32pm",
      "content": "ff, ffl, and ffi all have standard Unicode values (in the code page “Alphabetic Prsentation Forms”) — so foundries that include them in fonts are likely to give them the appropriate cooding.\n\n"
    },
    {
      "time": " 7.Dec.2007 3.22am",
      "content": "I found Zachary’s tip the one that worked best for me in this instance, but thanks very much to everyone who contributed advice and opinions.\n\n"
    },
    {
      "time": " 7.Dec.2007 6.26am",
      "content": "Jon — In case you check back, and in case it still might not be clear from the foregoing, OT layout features, like {liga}, are bits of programming inside the font that provide rules for substitutions and the like. In order for a user like yourself to take advantage of these features, an application needs to provide support for them.\n\nThere are specifications for certain features to be activated by default; others are discretionary, to be applied on an ad hoc basis. The application needs to be written to implement these kinds of OT layout features and then provide an interface for the user to activate or deactivate them.\n\nApparently Flash does not do so yet.\n\nLevels of support for OpenType layout features vary widely between applications still, and this whole arena is still in a state of flux.\n\nHTH. Sorry to have left you hanging earlier. I’m glad that Zachary provided a workable solution for you.\n\n— K.\n\n"
    }
  ]
}
