{
  "id": "39830",
  "title": "Any decent typography/design bookstores left in NYC?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everybody,\n\nSorry for the short notice here, but...\n\nTomorrow I’m going on a two-day trip to New York City with a couple of friends, and I plan to hit some of the new and used bookstores down there.\n\nI was wondering if there are any decent typography/graphic design bookstores left in NYC that would be worth my while to visit? I had hoped to go to Untitled, but I see by searching the forums here that they closed about two years ago.\n\nAny recommendations would be greatly appreciated.\n\nThanks in advance for your time,  \nJohn the Fontaholic\n\n [‹ Albert Schiller, ring a bell?](http://web.archive.org/web/20071208124148/http:/www.typophile.com/node/36821 \"Go to previous forum topic\") [Font Poll ›](http://web.archive.org/web/20071208124148/http:/www.typophile.com/node/39797 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071208124148/http://www.typophile.com/user/21144\" title=\"View user profile.\">John the Fontaholic</a>",
  "time": "<br>",
  "uid": "21144",
  "comments": [
    {
      "time": " 6.Dec.2007 8.48am",
      "content": "I think there’s a wiki on this but I’m not sure how to find it (I’m a moron when it comes to wiki).\n\nAnyway...\n\nUrban Center  \nCooper Hewitt  \nMoMA  \nStrand  \nPrinted Matter  \nGlenn Horowitz\n\n"
    },
    {
      "time": " 6.Dec.2007 9.05am",
      "content": "[Bookstores](http://web.archive.org/web/20071208124148/http:/www.typophile.com/wiki/Bookstores)\n\n"
    },
    {
      "time": " 6.Dec.2007 9.06am",
      "content": "My failed attempt at something useful. Completely forgot about it.\n\n"
    },
    {
      "time": " 6.Dec.2007 9.23am",
      "content": "Here’s a little NY bookstore tour. Start at the new Taschen bookstore on Greene just south of Prince. Then walk 3.5 blocks to the MoMA store on Spring and Crosby St. Then just up Crosby St. is a famous used bookstore, I forget what it’s called, but it’s within 2 blocks. The Strand is within a 15-min walk up Broadway, at 12th St. The Strand is the best one. Design is one level up from the entrance.\n\n"
    },
    {
      "time": " 6.Dec.2007 9.23am",
      "content": "Hi, John,\n\nYou could check out AIGA while you’re here- they often have great exhibitions (altho you might have just missed a good one on the 50 best book covers of 2006.... [http://www.aiga.org/](http://web.archive.org/web/20071208124148/http:/www.aiga.org/ \"http://www.aiga.org/\")).\n\nAlso, bundle up- it’s freakin’ cold here!\n\nEnjoy!\n\n"
    },
    {
      "time": " 6.Dec.2007 9.26am",
      "content": "<cite>Then just up Crosby St. is a famous used bookstore</cite>\n\nHousing Works. It is great AND they have concerts there sometimes, all the money going to charity. I saw Gomez there.\n\nIt is FREEZING.\n\n"
    },
    {
      "time": " 6.Dec.2007 9.58am",
      "content": "Its really a shame that Untitled closed down. But some of the general book shops in the city do have decent selections devoted to the area of design and typography.\n\nThe Strand  \nMoMA (either Soho or uptown)  \nZakka  \nGiant Robot  \nCooper-Hewitt  \nNew Museum (haven’t been yet)  \nKinokuniya (everything is 50% off at the original location, new store just opened across Bryant Park)  \nSt. Mark’s Bookshop  \nRand McNally  \nSkyline bookstore (great for used type specimen books and annuals)\n\nHope you have a wonderful time in New York! If you can you should see if its possible to set up a meeting at the TDC (don’t think any books for sale, but their collection is incredible)\n\n"
    },
    {
      "time": " 6.Dec.2007 10.32am",
      "content": "Also, in case you make it across the river to Brooklyn, there’s a great bookstore called Spoonbill & Sugartown in Williamsburg. They have a lot of good art books, lots of rare and used stuff: [http://www.spoonbillbooks.com/](http://web.archive.org/web/20071208124148/http:/www.spoonbillbooks.com/ \"http://www.spoonbillbooks.com/\")\n\n"
    },
    {
      "time": " 6.Dec.2007 1.32pm",
      "content": "Hi everyone,\n\nThanks for your input! :-D You’ve certainly given me a lot of places to choose from, and I’ll definitely bundle up. (Mind you, I live on the Rhode Island/Massachusetts border and grew up in Massachusetts, so this New Englander is no stranger to freezing temperatures!)\n\nCheers,  \nJohn the Fontaholic\n\n"
    }
  ]
}
