{
  "id": "39843",
  "title": "Type Terminology: Systems? Suites? Super Families?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "in relation to discussions [here](http://web.archive.org/web/20141104183322/http:/typophile.com/node/31592) and [here](http://web.archive.org/web/20141104183322/http:/typophile.com/node/29942), and bearing consequences for articles [here](http://web.archive.org/web/20141104183322/http:/typophile.com/node/29924) and [here](http://web.archive.org/web/20141104183322/http:/typophile.com/node/39833), can we try to pin down some terminology just for clarification of the wiki articles.\n\nDo the following mean anything to you as typographic terms?\n\nFamily  \nSuper Family (Superfamily)  \nSystem  \nSuite\n\n",
  "author": "paul d hunt",
  "time": "6 Dec 2007 — 2:35pm",
  "uid": "7006",
  "comments": [
    {
      "time": "6 Dec 2007 — 2:50pm",
      "content": "in previous posts and in the wiki articles that i have authored, i have used \"super family\" to mean a set of related fonts that contain at least a serifed and an unserifed counterpart, but may also include other sytles inluding an \"informal\" or a \"someserifs\" style. i believe there is precedence in this kind of usage, as [Ilene Strizver](http://web.archive.org/web/20141104183322/http:/typophile.com/wiki/Ilene%20Strizver) uses the term this way in [her article on super families](http://web.archive.org/web/20141104183322/http:/www.fonts.com/AboutFonts/Articles/FineTypography/Super+Families.htm) for the fonts.com website.\n\nhowever, the unscientific poll i put together (which is linked to above) seemed to indicate that typophiles might prefer another term with \"suite\" and \"type system\" being offered as alternates. somehow i think of a \"type system\" as something different: i think of a system as including a range of weights and optical sizes, which may or may not be included in my concept of a super family. i have similar reservations about the term suite: to me it is a more inclusive concept.\n\nis it silly to try to find a term that refers specifically to types families which come in both serifed and unserifed flavors? maybe so, but i don't know...\n\n"
    },
    {
      "time": "6 Dec 2007 — 2:59pm",
      "content": "Family: A collection of related typefaces and fonts. In some cases a family is sort of a marketing gimmick, eg. some of the families sold by House Industries, or collections of old typefaces marketed together, like Akzidenz and MT Grot. There is a subtle distinction between family and typeface; I think that is because a family can be comprised of multiple typefaces whereas a typeface cannot.\n\nSuperfamily: A very large family of fonts that applies to a wide variety of applications. Adrien Frutiger generally gets credit for inventing the superfamily when he designed Univers. I think that to get to superfamily status a family should include two or more widths in multiple weights.\n\nSystem: Synonymous with family.\n\nSuite: I do not think that I have ever seen this term used outside of marketing materials, so it has no technical meaning to me.\n\n"
    },
    {
      "time": "6 Dec 2007 — 3:30pm",
      "content": "My definition of Family is narrower than James's - I'd say a family is all the various weights and special features of a single font, such as ligatures, ornaments, condensed, etc. But only of one font. I'd put Univers here, not in superfamily.\n\nSuperfamily: I'd agree that it should be more extensive - sans + serif, for example. Thesis, Freight, families like that. And yes Rotis (ugh)\n\nSuite: This is what I'd call a group of fonts that work together, with a single theme or idea, but they could be disparate in appearance. House Industries collections belong here, to me.\n\nSystem: I think of my Mac OS, not fonts when I hear this term. Or of the mildly annoying Univers/Helvetica Neue way of numbering the different weights, that never really caught on.\n\n"
    },
    {
      "time": "6 Dec 2007 — 3:30pm",
      "content": "From reading the various threads that are relevant on Typophile the prospect that we can develop a really solid consensus meaning seems distant. In seems like in type there are relatively few terms that are not a bit or even very amorphous. That said, I am utterly happy to abide by whatever consensus can be acheived. Paul, you have made a very good start on a case for one way to do it. I applaud your effort!\n\nAlternatively perhaps for the purposes of the Wiki the thing to do is to choose terms System, Super familily etc; and then define them in some way; and then list the fonts that fit the supplied definitions. Then even if somebody has semantic differences with the Typophile Wiki they can still use the info.\n\n"
    },
    {
      "time": "6 Dec 2007 — 3:42pm",
      "content": "Based on some of the other comments I think that the sans and serif requirement for superfamily makes sense; perhaps the term system is more appropriate for a family like Univers, I still don’t think that family is descriptive enough for fonts like Univers. Perhaps “systematic family” could be coined…\n\n"
    },
    {
      "time": "6 Dec 2007 — 3:50pm",
      "content": "_...could be coined…_\n\nin fact, this is my dilemma. i don't want to be inventing new terms if there are perfectly acceptable alternatives already in currency. maybe we need new terminology? but i'm hoping we can find something that already has wide-spread accepted usage (if such a thing exists).\n\n"
    },
    {
      "time": "6 Dec 2007 — 3:55pm",
      "content": "I don’t know that inventing new terms is such a bad thing—especially in a time when boundaries are constantly transgressed and the traditional historic and stylistic classifications become less useful. I’ve run into this problem with [my thesis work](http://web.archive.org/web/20141104183322/http:/www.typophile.com/node/39388) and Ralf Hermann will likely end up in the same place with his. Why not have a running dialogue about it on Typophile and writing up the results for Interrobang?\n\n"
    },
    {
      "time": "6 Dec 2007 — 4:40pm",
      "content": "Sometimes you have to accept that terms are more arbitrary & vague than one would like. Still, I am rooting for ya! Perhaps somebody will pose a position we can all rally round. It is sounding so far like the idea of 'Super' does seem to be associated with sans & serif combo families. And come to think of it I think that would be my working guess\\* before I saw a new font labeled as 'superfamily'.\n\n\\* But in my case it would be a very soft guess.\n\nDoes nobody like my idea of accepting the arbitary & just defining term we supply? I wonder if there is a way of using quotes around the term to imply or suggest that it's not a completely agreed on term... Like this:\n\n'Superfamily'\n\n"
    },
    {
      "time": "6 Dec 2007 — 8:12pm",
      "content": "Another term that has recently been introduced to me as an option for this concept is \" [dynasty](http://web.archive.org/web/20141104183322/http:/www.webster.com/cgi-bin/dictionary?book=Dictionary&va=dynasty)\" (a powerful group or family that maintains its position for a considerable time).\n\n"
    },
    {
      "time": "6 Dec 2007 — 8:52pm",
      "content": "If you go that route, why not \" [Imperium](http://web.archive.org/web/20141104183322/http:/en.wikipedia.org/wiki/Imperium)\"? I say this mostly in jest of course. Similarly, why not a \"Type Convolution\" or \"Type Strata\". I can see more & more the wisdom of the term Family. It suggests variation but with commonality of features seemingly like no other term.\n\n"
    },
    {
      "time": "6 Dec 2007 — 9:41pm",
      "content": "I agree with Patty.  \nHowever, superfamily seems to suggest size, i.e. a lot of fonts, with perhaps a lot of feature and language coverage--so just because a family has sans and serif variants wouldn't necessarily make it super.\n\n"
    },
    {
      "time": "7 Dec 2007 — 12:02am",
      "content": "The definitions I use are:\n\n**[Typeface](http://web.archive.org/web/20141104183322/http:/typophile.com/wiki/Typeface)** is a collection of all typographic characters that share the same design characteristics such as weight, width, inclination, optical size, stroke modulation or treatment of serifs. Helvetica Bold is one typeface, Times Roman is another typeface, Times Bold is yet another typeface.\n\n**[Font](http://web.archive.org/web/20141104183322/http:/typophile.com/wiki/Font)** is a certain physical form in which a typeface with a certain character set is released by a certain vendor under a certain trade name — for example a set of metal type sorts, a digital font in the Type 1 format, a digital font in the OpenType PS format etc. Times Roman by Linotype in Type 1 format is one font, Times Cyrillic Regular by Linotype in Type 1 format is another font, Times Roman Std by Adobe in OpenType format is another font, Dutch 801 Roman by Bitstream in Type 1 format is another font — all of the same typeface Times Roman.\n\n**[Typeface family](http://web.archive.org/web/20141104183322/http:/typophile.com/wiki/family)** is a set of typefaces released under a common trade name that differ in weight, width, inclination, optical size and character sets, but belong to the same stylistic class because of some common design characteristics such as stroke modulation and treatment of serifs. Helvetica, Times, Palatino, ITC Stone Sans, ITC Stone Serif, ITC Stone Informal and ITC Stone Humanist are all different families.\n\n**[Typeface superfamily](http://web.archive.org/web/20141104183322/http:/typophile.com/wiki/superfamily)** is a set of typefaces released under a common trade name that combines several families across stylistic classes. Members of a typeface superfamily differ not only in weight, width, inclination, optical size and character sets, but also in other design characteristics such as stroke modulation and treatment of serifs — but still share certain other characteristics such as proportions, which allows them to work together. ITC Stone Sans, ITC Stone Serif, ITC Stone Informal and ITC Stone Humanist are four families that form a superfamily.\n\n(I think the issue of the common trade name is important. There are often serif and sans families that share stylistic features and work together well, but they are designed by different people and released under different trade names. Those do not form a superfamily.)\n\nI also like another term:\n\n**[Typeface series](http://web.archive.org/web/20141104183322/http:/typophile.com/wiki/series)** is a set of typefaces that form a family, a superfamily or even have a looser connection, for example are designed by the same designer with a common thought in mind. So, any family or superfamily is a series, but also Verdana, Tahoma, Nina and Meiryo form a series, though not a family nor a superfamily. Another example of a series are Arepo, Stone Print, SFPL, and Cycles by Sumner Stone.\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": "7 Dec 2007 — 2:19am",
      "content": "i like that approach, Adam. as always you deliver a well-thought-out, complete, and concise method to approaching the problem. I think I'll start using this jargon myself. do others feel comfortable using Adam's definitions for the wiki?\n\n"
    },
    {
      "time": "7 Dec 2007 — 6:15am",
      "content": "I'd like to echo what Adam described about family vs. superfamily. The ITC Stone typefaces are the classic example and immediately came to my mind also when I read the initial post.\n\nI'll add that \"type system\" suggests to me a selection of typefaces designated to work together for a given purpose, and has more to do with an overall design program rather than the design or marketing of the types themselves. For instance, when I revised the brand for my former publisher, I chose for them three typefaces (for marketing, not publishing) -- Iowan Old Style for working text, Vectora for supplementary sans, and PMN Caecilia for occasional flavor. This then constituted our \"type system.\" So I think of this as more of a design term than a typographic term, if that makes any sense to anyone.\n\nI have to admit that I've never used or even contemplated the term \"suite\" in a typographic context.\n\nAdam's notion of \"series\" is new to me, but seems quite useful. Another example might be Palatino, Aldus, and Michelangelo.\n\n-- K.\n\n"
    },
    {
      "time": "7 Dec 2007 — 6:47am",
      "content": "Adam seems dead on. It would probably be worthwhile to try passing these definitions by Steve Heller, Ellen Lupton, Tova Rabinowitz, and other authors of typography textbooks to see if they feel the definitions concur with what is being used in design books and schools, so that the Typowiki doesn’t end up in conflict with some other important source.\n\n"
    },
    {
      "time": "7 Dec 2007 — 8:46am",
      "content": "I like that Adam's definition is thoughtful, explicit ( not vague) and lacks internal contradictions. It is also no-less arbitrary than another one might be. But as I said before, that's not a slight or criticism.\n\nThinking further, what I think is also useful is the way he has defined Superfamily outside of a serif centric model.\n\nIf a family of fonts has optical variations, italics, Small Caps, more than 2 kinds of figures and small caps you quickly get enough fonts in pure numbers to qualify for super family status I think. Arno Pro is the example I am thinking of. That family is huge. That is the only issue that I think is left still unresolved. eg Does anybody think of Arno Pro as outside of Superfamily status because it lacks a Sans?\n\nAlso I think including a semi-serif should definitely not be the defining characteristic even if there is some historical basis for that position. I say this because in part because I don't think our terms should be encouraging or discouraging design choices in order to \"qualify\". And I think it would be mistake for instance to deny Meta as a Superfamily.\n\n"
    },
    {
      "time": "7 Dec 2007 — 9:02am",
      "content": "_Does anybody think of Arno Pro as outside of Superfamily status because it lacks a Sans?_\n\ni don't think of Arno as a Superfamily, but not because it lacks a sans, but because it lacks _something else_. I would think of Arno as a family. I _would_ consider Meta as a superfamily because (as we ALL know) the family was recently augmented with an additional component--a serif.\n\n"
    },
    {
      "time": "7 Dec 2007 — 9:16am",
      "content": "<cite>Does anybody think of Arno Pro as outside of Superfamily status because it lacks a Sans?</cite>\n\nI don’t see Arno Pro as a superfamily because it is—at least in my mind—a text face with a huge variety of optical weights. I can’t see Arno being used as the face of an entity with widely varied needs like I can Meta, Thesis, or Scala.\n\n"
    },
    {
      "time": "8 Dec 2007 — 12:07am",
      "content": "Thanks for the kind words — indeed, I like coming up with definitions, plus I've recently completed editing the [Polish edition of Bringhurst's \"Elements\"](http://web.archive.org/web/20141104183322/http:/www.d2d.pl/), which gave me sufficient opportunity to think about these things lately :)\n\nAs for the term \"series\", it was new to me a few years ago, but I heard many designers who worked at Mergenthaler Linotype (e.g. Matthew Carter, Larry Oppenberg and Dennis Pasternak) used it. I somehow like the concept that a series would be more general than a family, because _family_ implies the same name (as in _family name_) while _series_ does not.\n\nFor me, the distinction between a family and a superfamily is whether members of the particular series belong to different stylistic categories (superfamily) or just the same (family). The concept of a \"stylistic category\" or \"class\" is vague enough to leave some room for intepretation, which I think is fine.\n\nA.\n\n"
    },
    {
      "time": "8 Dec 2007 — 1:20am",
      "content": "Adam, I am glad that you feel good about a little fuzziness somewhere in the definition. Of course 95% of the time it will be serif & sans etc. but your method means that it doesn't HAVE to be. It leaves growing room. I think that's healthy.\n\nPaul, are you satisfied with \"stylistic categories\" as a cut off point?\n\n"
    },
    {
      "time": "8 Dec 2007 — 2:45am",
      "content": "eben, yes.\n\n"
    },
    {
      "time": "8 Dec 2007 — 3:20am",
      "content": "Cool.\n\n"
    },
    {
      "time": "8 Dec 2007 — 5:58am",
      "content": "Bravo Adam!\n\nChrisL\n\n"
    }
  ]
}
