{
  "id": "39859",
  "title": "Metraux",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I'm still working on [Shadowcliffe](http://web.archive.org/web/20150417040415/http:/www.typophile.com/node/39383), but had a sudden idea I wanted to play with.\n\nI've been working for two days now on _Metraux_, a display typeface based on the following requirements:\n\n- Starts with a geometric basis similar to Futura  \n- Low crossbars on the caps  \n- Wedge serifs (exterior only)  \n- Noitcably low x-height  \n- A few other idiosyncrasies here and there\n\nThere's still some work to be done on the overall color, and I have quite a bit of work ahead of me in terms of kerning and such (which is HIDEOUSLY hacked at this point, so pay it no mind), but the stylistic idea is definitely there.\n\n| Attachment | Size |\n| --- | --- |\n| [amv-Metraux-Regular\\_Rough\\_Cut\\_1.pdf](http://web.archive.org/web/20150417040415/http:/typophile.com/files/amv-Metraux-Regular_Rough_Cut_1.pdf) | 139.63 KB |\n\n",
  "author": "amv",
  "time": "7 Dec 2007 — 3:31am",
  "uid": "23823",
  "comments": [
    {
      "time": "13 Dec 2007 — 7:20am",
      "content": "I really like a lot of what I see here, although it reminds me more of Eric Gill than Paul Renner. But I take issue with some uses of the exterior only serifs. I’m not entirely sure it’s that they’re exterior only as it is that they’re symmetrical, both horizontally and vertically. The serifs just seem tacked on at the top of **a** and as the ear of **g**. I think that playing with them would really make this a strong face and add in the idiosyncrasies you speak of.\n\nOther things:\n\n•Using the serifs as the crossbar on **t** creates a down arrow, and it’s a distraction.  \n•A two-story **a** would go better with the three-story g.\n\n"
    },
    {
      "time": "14 Dec 2007 — 11:45pm",
      "content": "I agree with most of what you're saying. I totally understand the down-arrow commment on the t, as well as the comment about the stories on the a vs. g, but in both cases I have to say I just personally like the look as-is, even though I can't really defend it on any rational level. :) I'll have an update soon.\n\n"
    }
  ]
}
