{
  "id": "39867",
  "title": "Alternative to Papyrus",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Dear Typohiles,\n\nThis is my first post -- I've been learning from watching you smart folks for months, and now I'm in a situation where I could use a little of your expertise...\n\nI am doing the titling for a documentary about a trip to a childrens orphanage in Africa and the director is in love with Papyrus. I can't stand the font (and from doing a papyrus thread search, I've gathered that most of you feel the same way).\n\nCan anyone suggest some Papyrus alternatives? The font will be used for names of people and places, as well as short & long quotes.\n\nI've been scouring my library and myfonts.com for something that I might be able sell to the director as a better alternative -- perhaps something elegant, friendly, and with a slightly \"african\" feel -- but I thought I would put the question to you, the ultimate type experts.\n\nThanks in advance for your time, and any input is very much appreciated.\n\nRegards,  \nJulia\n\n",
  "author": "jdeakin",
  "time": "7 Dec 2007 — 10:06am",
  "uid": "24826",
  "comments": [
    {
      "time": "7 Dec 2007 — 10:14am",
      "content": "[Kigali](http://web.archive.org/web/20150315143301/http:/www.myfonts.com/search?search%5Btext%5D=Kigali) perhaps?\n\n"
    },
    {
      "time": "7 Dec 2007 — 10:21am",
      "content": "[http://www.veer.com/products/typedetail.aspx?image=RRT0011504#specimen](http://web.archive.org/web/20150315143301/http:/www.veer.com/products/typedetail.aspx?image=RRT0011504#specimen \"http://www.veer.com/products/typedetail.aspx?image=RRT0011504#specimen\")\n\nMaybe this?\n\nChase Langdon\n\n"
    },
    {
      "time": "7 Dec 2007 — 10:55am",
      "content": "Wow, was that ever fast!\n\nChase - Thanks for the suggestion, but I think it's a little too... um... \"clean\"? not sure of the right descriptor here :/\n\nKent - Kigali might be close, maybe something with less extreme thicks & thins? I'm looking at some of Arthur Baker's other fonts right now, and leaning towards [Pelican](http://web.archive.org/web/20150315143301/http:/www.myfonts.com/fonts/agfa/pelican/familytree.html) or [Oakgraphic](http://web.archive.org/web/20150315143301/http:/www.myfonts.com/fonts/glyph/oakgraphic/familytree.html) Thanks for turning me to Arthur Baker... not quite my taste in type, but I need to satisfy the director's desires while not succumbing to the ubiquitous Papyrus.\n\nStill searching... any other suggestions are welcome.\n\nThanks again,  \nJulia\n\n"
    },
    {
      "time": "7 Dec 2007 — 1:45pm",
      "content": "[http://www.veer.com/products/typedetail.aspx?image=PTT0000181#specimen](http://web.archive.org/web/20150315143301/http:/www.veer.com/products/typedetail.aspx?image=PTT0000181#specimen \"http://www.veer.com/products/typedetail.aspx?image=PTT0000181#specimen\")\n\nmorris golden is distressed but it has serifs... I don't know I don't think anything can take the place of papyrus(not in a good way hah)\n\nmaybe this too?\n\n[http://www.veer.com/products/typedetail.aspx?image=RRT0011416](http://web.archive.org/web/20150315143301/http:/www.veer.com/products/typedetail.aspx?image=RRT0011416 \"http://www.veer.com/products/typedetail.aspx?image=RRT0011416\")\n\nWhat i was going for with Canterbury sans was the small x-heights.\n\njust trying to help.\n\nChase Langdon\n\n"
    },
    {
      "time": "7 Dec 2007 — 3:00pm",
      "content": "A quick search in Identifont brought up [Plato](http://web.archive.org/web/20150315143301/http:/www.identifont.com/list?2+Plato+1+4WF+0+G4N+0+CW4+0) and [G&G](http://web.archive.org/web/20150315143301/http:/www.identifont.com/find?font=G%26G&q=Go) as possible similar ones. I bet you could probably get away with using Plato without the director ever noticing. :-p\n\n"
    },
    {
      "time": "7 Dec 2007 — 3:51pm",
      "content": "Plato looks like a great alternative. Me likee (note to self: use ASAP!)\n\n"
    },
    {
      "time": "7 Dec 2007 — 6:06pm",
      "content": "_elegant, friendly, and with a slightly “african” feel_\n\nI think that [Palatino Sans](http://web.archive.org/web/20150315143301/http:/www.linotype.com/113189/palatinosansinformal-family.html) certainly meets the first to qualifications, i'm not sure if you can ever really \"feel\" Africa in a typeface, but i don't think Palatino Sans would be too far off this mark either. I linked to the \"informal\" variant, but there is another, more regularized version as well.\n\n"
    },
    {
      "time": "7 Dec 2007 — 6:55pm",
      "content": "Randy Jones's hand-lettered serif face [Olduvai](http://web.archive.org/web/20150315143301/http:/www.veer.com/products/typedetail.aspx?image=UMT0000054) might be worth checking out. It's certainly got an African name. I must say though that I share Paul's doubt as to whether one can ever really \"feel\" Africa in a typeface. What aspects of Africa (an entire continent, by the way) do you (or perhaps more importantly your client) want to evoke?\n\n"
    },
    {
      "time": "8 Dec 2007 — 6:04pm",
      "content": "Julia - If you like Baker, you might also like [Bouwsma](http://web.archive.org/web/20150315143301/http:/www.fontshop.com/fonts/designer/philip_bouwsma/).  \nAnd a bit cleaner, but similarly structured: [The Florentine Set](http://web.archive.org/web/20150315143301/http:/www.fontshop.com/fonts/downloads/creative_alliance/the_florentine_set/)\n\n"
    },
    {
      "time": "8 Dec 2007 — 6:14pm",
      "content": "Maybe it would be better to address why the director thinks a typeface in the vein of Papyrus is appropriate for a documentary about an African orphanage. To me it seems like using Papyrus is just perpetuating negative stereotypes of poor Africans who can be coddled by rich foreigners but not actually treated with dignity.\n\n"
    },
    {
      "time": "10 Dec 2007 — 4:02pm",
      "content": "I can't thank you all enough for the many excellent suggestions here.\n\nPaul - thank you for the gentle correction, I realized after posting that using the word \"African\" as an adjective was inaccurate and a little on the ignorant side. I should have come back to correct myself, but got carried away with work. Thanks for not flaming me :)\n\nJames - I am in complete agreement with you, and am trying to steer the director and editor down a different road by giving some other options. But showing them an alternative to Papyrus that is close will at least demonstrate that I am listening to them as well.\n\nPlato does look like a great alternative, and I am loving the hand-lettered Olduvai as well -- especially because it is a film about a travelling performing arts camp, with emphasis on hands-on artistic expression and experience. Palatino would be great for smaller/longer bits of text, perhaps to pair with another more overtly stylized display font?\n\n...I'm interested in every font suggested here -- I've got some work to do!\n\nThank you all again, your feedback has helped immensely.\n\n"
    },
    {
      "time": "10 Dec 2007 — 4:28pm",
      "content": "Something else to consider is that if you really want to reflect Africa, look at color. The generic green, red, white and yellow colors that are often used to represent Africa have been used in some parts of the continent for so long that nobody even remembers what they originally stood for; using colors appropriate for these particular people could be more evocative than type could ever be alone.\n\n"
    },
    {
      "time": "10 Dec 2007 — 7:26pm",
      "content": "This [U&lc article](http://web.archive.org/web/20150315143301/http:/www.itcfonts.com/Ulc/2621/DesignAfrika.htm) might give you some clues to approach tis project with. It also has a few nice examples of contemporary African lettering design.\n\n"
    },
    {
      "time": "10 Dec 2007 — 7:54pm",
      "content": "I keep thinking of [Amira](http://web.archive.org/web/20150315143301/http:/fontbureau.com/fonts/Amira). It has a calligraphic feel like Papyrus, and the caps have a rugged wooden feel. Only imagination can relate it to Africa though I'm afraid.\n\n"
    },
    {
      "time": "10 Dec 2007 — 11:39pm",
      "content": "Brioso Pro Poster: Lighter than Papyrus, but has the same rough edge. This typeface is pure elegance and looks great at 300pt. They do have other cuts for smaller sizes. EDIT:Not african feeling though (to me).\n\nEDIT: Olduvai is not intended to feel African in any way. The archeology angle is a big burial mound of schtick that my \\*ahem\\* marketing team came up with.\n\nSide note: I did draft up a font a couple of years ago in the flavor Neuland (but more calligraphic). I was chuckling because if you want it to be \"ethnic\" choose Neuland. Hawaiian? Check. African? Check. Amazon? Check. I'm not saying, mind you that this makes any sense, or has any cultural sensitivity, but Neuland is pretty unique in it's ability to resonate with so many people on this level. It's called Indigenous, and it is growing cobwebs. Somehow, whenever I set out to draw a display face, it evolves into some crazy long project with text companion and blah blah blah.\n\n ![](http://web.archive.org/web/20150315143301im_/http:/typophile.com/files/sample_3446.gif)\n\nAnd i did manage a stab at a \\*text\\* (using the term lightly) version:\n\n ![](http://web.archive.org/web/20150315143301im_/http:/typophile.com/files/indig_6162.gif)\n\n"
    },
    {
      "time": "11 Dec 2007 — 9:23am",
      "content": "Randy, I think that is a lot of fun!! What is the text font?\n\n"
    },
    {
      "time": "11 Dec 2007 — 9:27am",
      "content": "Randy, you need to get that new site up already! I want to have a look through your whole library. \\>^p\n\n"
    },
    {
      "time": "11 Dec 2007 — 10:21am",
      "content": "MissT: Indigenous Text?  \nPaul: Aaaaaaaaaaaaaaaaaaaahhh. I know.\n\nThe discussion about type parody vs cultural sensitivity is an interesting one, that I don't want to side track. Type parody might be damaging in a butterfly flaps its wings in Montana and a typhoon strikes Mauritius kind of way. Some will argue that type parody is directly offensive and damaging. I just don't have a good answer, you have to pick a typeface. Chances are you're awareness of the design history and use of a font will be lost subtleties on most audiences. Still, not sure that means you need to go find a font that Joe Starbucks will overtly say is Tiki lettering. But then [Tiki lettering has it's place](http://web.archive.org/web/20150315143301/http:/www.flickr.com/photos/89239849@N00/1253968262). Like I said, I don't have a good answer. Just go with Olduvai. Muuuuuuhahahahahahahaha. Or not.\n\n"
    },
    {
      "time": "11 Dec 2007 — 10:45am",
      "content": "or Randy's Hand-drawn Sans, email him and bug him abt it.\n\n"
    },
    {
      "time": "11 Dec 2007 — 7:24pm",
      "content": "I like Stewf's Florentine suggestion. I was thinking along the same lines. I was thinking of [Carlton](http://web.archive.org/web/20150315143301/http:/www.myfonts.com/fonts/linotype/carlton/) myself. Look at the similarity of the Fs. The long cross stroke of the upper case, and the descending lc f are very reminiscent of Papyrus.\n\n ![](http://web.archive.org/web/20150315143301im_/http:/typophile.com/files/6dba8a4c99d98a0303a21ecf92e3c497_6080.png)\n\nOr, if you want to go classic \"Afica\", Thomas Phinney once told me that Koch's [Nueland](http://web.archive.org/web/20150315143301/http:/www.myfonts.com/fonts/p22/koch-nueland/) was always used to represent \"ethnic\" way back in the cold/hot-metal days.\n\n ![](http://web.archive.org/web/20150315143301im_/http:/typophile.com/files/93f8b3348feea8cfc0d486cd88a68268_5578.png)\n\n"
    },
    {
      "time": "12 Dec 2007 — 12:50am",
      "content": "<cite>Koch’s Nueland was always used to represent “ethnic”</cite>  \nCheck out [the article ‘New Black Face’](http://web.archive.org/web/20150315143301/http:/www.studio-gs.com/neuland.html) by Rob Giampietro.\n\n"
    },
    {
      "time": "12 Dec 2007 — 5:14am",
      "content": "If the Neuland suggestions hit anywhere near the mark, then don't forget to look at Font Bureau's [Aardvark](http://web.archive.org/web/20150315143301/http:/www.fontbureau.com/fonts/Aardvark) also.\n\n"
    },
    {
      "time": "12 Dec 2007 — 8:38am",
      "content": "Florian: thanks for posting that article. It caused quite a bit of introspection. I do think that Indigineous panders to caracature, but it was not intended to be hurtful, but playful. It was helpful to learn more about the climate that Neuland was introduced into, and who adopted it. Also to read more about the deco connection, which I wasn't aware of, but which shows up in my design more overtly. Probably not a bad thing that it stays on my hard drive. I wonder what others think about that. I honestly don't care. As far as it depends on me, I want to be about peace.\n\n"
    }
  ]
}
