{
  "id": "39876",
  "title": "Logo - Under water rugby - Cooper Black",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi, this is a logo for a local under water rugby club. Made the symbol a while ago and now I'm trying to get the typography right.  \nTeams for women and men. They have a solid community with a lot of social activity besides the sport. Easy going friendly bunch that loves a loud party.  \nThey insist on Cooper Black, and I think it suits them well, but I think having all the text in CB is to heavy. I need a second font that goes well with CB and the spirit of the team. I think Comic Sans might work, although, after hanging around this place I should maybe know better.  \nWide open to suggestions/critique on fonts, kerning, sizes or the logo in general.\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwrugby_5205.gif)\n\n",
  "author": "BjornH",
  "time": "7 Dec 2007 — 1:55pm",
  "uid": "23869",
  "comments": [
    {
      "time": "7 Dec 2007 — 2:36pm",
      "content": "Fun logo. I'd start by suggesting you center the type under the two people disregarding the water. I also think the two lines are set too tight and too close, especially giving how large your word space is in between the two words in the top line.\n\nIf the mark isn't set in stone I might also consider not overlapping the water on the people. It seems a little distracting, especially at small sizes.\n\nOh, and are you looking for type crit or is this the type you are to use?\n\n"
    },
    {
      "time": "7 Dec 2007 — 2:43pm",
      "content": "Just Say No to Comic Sans (sorry, Vince :-P)\n\nBitstream makes lighter weights of Cooper which might work better for this logo.\n\nI agree with Tiffany that the text should be centred under the circle, not the entire logo. I also agree that the lines of text are way too tight.\n\nI'd like to see a version without bubbles. They won't reproduce well at small sizes, and the perfect circles seem out of place in such an organic mark.\n\n- Lex\n\n"
    },
    {
      "time": "7 Dec 2007 — 4:02pm",
      "content": "Hi, thanks for comments!  \nMiss Tiffany, here it is centred under the two people with no water. I added a little weight to them to see what happened since I thought they looked a bit skinny. I also removed the small text for now. The mark is in no way set in stone except that it must be Cooper Black for the “SURK TSI” part, or all text if possible. I’m all ear about kerning and spacing, to me it looks fine, you think the space is to wide between the two words?\n\nLex, Comic Sans in a logo may be stretching it a bit to far. Thanks for the font tips. I like the liveliness of the bubbles for this logo, but I see that they may be to small and to many. I do not think that they seem out of place as they are randomly distributed and as a group they have an organic presence.\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwrugby2_4747.gif)\n\n"
    },
    {
      "time": "7 Dec 2007 — 5:55pm",
      "content": "I like the second one quite a bit.\n\n"
    },
    {
      "time": "7 Dec 2007 — 6:50pm",
      "content": "i like the weight relation of the 2nd one, but your players are getting too lumpy. I hope you don't mind me posting a type of image for reference to illustrate a good balance of dynamism and grace (most likely it will be a bit to art deco for this, though, but the same principles can be applied).\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/pdhilly120807_6596.gif)\n  \nalso, i think the two separate words could be brought a bit closer together: the space between K and T is a sticking point. \n"
    },
    {
      "time": "8 Dec 2007 — 7:55am",
      "content": "Sharon, thanks.  \nPaul, that is so beautiful, I'll never ever in a milion years acheive grace like that. Thanks for posting it.  \nI tried to make a version influenced by it, I'm afraid it is not even close.\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwrugby3_6239.gif)\n\n"
    },
    {
      "time": "8 Dec 2007 — 9:16am",
      "content": "ah, very nice! i didn't mean for you to copy the illustration quite so literaly (btw, it's an old ATF cut that i posted for reference), but over all i think you found your own balance. the tushes and the torsos might be toned down a bit? and the quads a bit larger? but overall i think this is nicer than your other heavied-up versions. can we see what this mark looks like with the type?\n\n"
    },
    {
      "time": "8 Dec 2007 — 1:03pm",
      "content": "I like it sans bubbles.\n\nI have to admit, I don't mind the comic sans for the tagline, either. (Did I just say that?)\n\n"
    },
    {
      "time": "9 Dec 2007 — 6:28am",
      "content": "I'd like to see more from that artist paul, any info available?  \nI dived into negative space exploration with the logo, sorry. I'll have to be back with the type later. This perhaps still is sort of type relevant, since I wonder if the symbol still is possible to read? They are both men and women in the club so I wanted a female player also.  \naluminum, good laugh!\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwrugby4_4581.gif)\n\n"
    },
    {
      "time": "9 Dec 2007 — 10:33am",
      "content": "I like it except for the left hands on the ball. The tension was better there in the older versions.\n\n"
    },
    {
      "time": "9 Dec 2007 — 11:29am",
      "content": "bjorn, just sent you an email through the system here. you may need to fish it out of your trash folder.\n\n"
    },
    {
      "time": "9 Dec 2007 — 2:53pm",
      "content": "You are right Sharon, I'll see if I manage to arrange them different.  \nPaul, are there a mail system here? If you sendt it to my gmail-account I am unable to open it until tomorrow. All https sites will not load and I think it has something to do with my router. Am I in trouble?\n\n"
    },
    {
      "time": "9 Dec 2007 — 3:07pm",
      "content": "bjorn, you're not in trouble. the email most likely went to your gmail account.\n\n"
    },
    {
      "time": "9 Dec 2007 — 4:28pm",
      "content": "I really like the changes. Much improved. I agree with you all about the hand/ball problem.\n\nCan you articulate the shape of the ... ahem ... posterior region of both figures more? The outer leg of both figure could be curved a bit more toward the ... ahem ... cheeks. I also think the women's left arm could use a tiny bit more muscular definition. (Her outer leg too, her thigh look a little lumpy.) The man's outer leg, the calf to foot seems deformed somehow.\n\n"
    },
    {
      "time": "9 Dec 2007 — 6:14pm",
      "content": "hey guys,\n\nI agree with the hands-into-ball, lost tension comments.  \nI would suggest to look for equal level of detail/synthesis (hands vs face, for instance).  \nAlthough I like the positive/negative going on, I feel the negative space in the woman's back isn't favorable (It's not necessarily its size, but being \"unshaped\"). I like what's going on in the heads with this matter.  \nAlso look closer on the topmost and lower feet, they're sort of funny.\n\nType, type, type!\n\nRegards,\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.gabssnake.4t.com](http://web.archive.org/web/20140307105251/http:/www.gabssnake.4t.com/ \"www.gabssnake.4t.com\")\n\n"
    },
    {
      "time": "10 Dec 2007 — 12:49pm",
      "content": "Thanks for all the comments! The only thing I could not try to improve was the long strech of negative space on the back of the woman. Maybe use the text to make that line readable? I tried to adjust the rest according to your suggestions, hard work for a clumsy guy like me.\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwrugby6_4304.gif)\n\n"
    },
    {
      "time": "10 Dec 2007 — 2:45pm",
      "content": "Bjorn, while the mark itself is much improved (including posterior regions) I think attaching it to the type is a mistake. For one, it now looks like two people are hanging from a hook. :^)\n\n"
    },
    {
      "time": "10 Dec 2007 — 4:01pm",
      "content": "Super feedback Miss Tiffany, thanks! I thought it would read like two people diving below the surface of the \"type water\". Here it is the classic way. In my eyes the weight of the text and the figure should be about this ratio. I'm struggeling to keep inside of the original concept with the two divers inside a circle. The concept is why the legs was so distorted. Moving towards more realistic figures, the circle is getting invisible and the concept is fading. Anyway, how about that type?\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwrugby7_5681.gif)\n\n"
    },
    {
      "time": "10 Dec 2007 — 4:42pm",
      "content": "I don't think you need to worry about the circle. It is still present.\n\nThe type still seems a little large to me, and the word spacing seems a little large too. But the line spacing is a little tight.\n\n"
    },
    {
      "time": "12 Dec 2007 — 12:12am",
      "content": "Forgive me but is \"Tsi Surk\" and \"Surk Tsi\" the same?\n\nAnd for the latest figure draft, maybe you can avoid confusion by adding a suggesting lines (Lady's back and Gentleman's trunk) to make the shape discernible?\n\nAlso, the actual rugby is round, right?\n\nJust my 2 cents from someone outside the water sport.\n\n--- pinky kinky winky ---\n\n"
    },
    {
      "time": "12 Dec 2007 — 11:13am",
      "content": "Comic Sans is imho out, since the comic cartoon look is gone. I need to find a substitute font that is more relevant to this new look. Miss Tiffany, I do not know how to determin the best line spacing. How do you see that it is to tight? I tend to want to put the lines as close together as possible. Are there any rules to follow in a case like this logo?  \nIt is \"TSI SURK\", plus the long tagline, sorry for not being consistent.  \nI like your suggestion about the suggesting line verdiinpink. If I where to use a suggesting line for the back of the woman, I think it would be something like in the attached picture. I rather avoid it in the b/w version because it makes the logo less interesting I think.  \nYes the ball is round, and filled with something a little heavier than swimming pool water, so it will slowly sink. I think the size is about the same as a handball.\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwrugby2_6362.jpg)\n\n"
    },
    {
      "time": "12 Dec 2007 — 2:43pm",
      "content": "Here is a suggestion for a better fitting type, possibly:\n\n[JohnSans Xblak CE](http://web.archive.org/web/20140307105251/http:/www.myfonts.com/fonts/storm/john-sans/xblak-sc/testdrive.html), it holds its own distinction and is highly legible. The rounded edges will reflect the idea of underwater/fluidity, but the strength of the characters is not compromised by the subtle roundness.\n\nGreat job on the logo by the way. It is amazing to see the evolution of an idea and input on the idea work itself out.\n\n"
    },
    {
      "time": "15 Dec 2007 — 11:37pm",
      "content": "Cheers,\n\nit looks great!\n\non the type, maybe space between letters in \"tsi turk\" can be tighter.  \ncan \"tromsostudentenes undervannsrugbyklubb\" be in two lines? I'm seeing that doing so may make it easier to work with and allow better proportion. It's kind of small right now.\n\nagain, it looks great.  \nregards,\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.gabssnake.4t.com](http://web.archive.org/web/20140307105251/http:/www.gabssnake.4t.com/ \"www.gabssnake.4t.com\")\n\n"
    },
    {
      "time": "15 Dec 2007 — 11:49pm",
      "content": "on the secondary typography, I think the one you have already is fair enough.  \nIf you're looking for more choices, I would suggest Stone Sans Medium, Aroma, Dialog, or something soft, neither too vertical or horizontal, and not too heavy.  \nCheers,\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.gabssnake.4t.com](http://web.archive.org/web/20140307105251/http:/www.gabssnake.4t.com/ \"www.gabssnake.4t.com\")\n\n"
    },
    {
      "time": "31 Dec 2007 — 6:15am",
      "content": "I'm jumping in a bit late (and there hasn't been an update to this article in about 3 weeks) so I don't know if this will be helpful or not.\n\nFirst off I love the progression of the illustration. Bjorn, you have quite a talent, it was very impressive to see the slight variations over time.\n\nBut, I'm afraid you haven't hit it with the type. It almost seems like the type is an after thought (which I suspect it is.) For starters the layout seems a bit neutral. Since you've created such a beautiful image, you should have type that helps not hinders the final product. If you're going with stacked type look, consider reducing the size of the tag-line so it's not the same width as the name. This will hint of a pedestal for your image to \"sit on\".\n\nAlso, I think you might want to consider more contrast between your type selections. Cooper Black with another rounded sans for the tag is almost too similar. Rugby isn't a gentle sport, where it might be more graceful in the water, I'm sure there is still high levels of aggression during play. I'm envisioning a black chiseled slab-serif for TSI SURK with a muted rounded sans for the tag-line. It'll have the aggression I expect from rugby with softened effect that helps illustrate the water arena.\n\nsuggestion: [Malaga black](http://web.archive.org/web/20140307105251/http:/www.fontshop.com/fonts/downloads/emigre/malaga_black/?sample_text=TSI%20SURK&sample_size=74)for TSI SURK and maybe [Omnes medium](http://web.archive.org/web/20140307105251/http:/vllg.com/JoshuaDarden/Omnes/mudTyper+Weights/) for the tag-line.\n\nGood luck.\n\n"
    },
    {
      "time": "31 Dec 2007 — 9:24am",
      "content": "Hi and thanks for suggestions and feedback, inspiring and very appreciated! Sorry for not keeping you updated, I was hoping to have something to show before posting.\n\nI have been looking on all the fonts suggested, thanks Wesley.Bancroft and gabssnake, all of them is for sure nice. Sadly I have not been able to implement any of them.\n\nThe logo has been resting for a while and in that time I got an idea that we'll try to follow through:  \nWe are in the progress of sampling handwriting from the members in order to make a tag line from the samples. Due to holidays and no deadline we have not been able to collect the samples yet.  \nI'm a bit excited about this concept for the tag line.  \nFirst because it make a nice connection between the members of the team and the logo since they get to participate and see their own graphics in the design.  \nSecond because I finally have a defined \"concept box\" to work inside.  \nThird because of the challenge, vectorizing the samples, putting them together and see how it turns out.  \nIt may be a total fiasco, time will show.\n\nThe typography is indeed an afterthought Asvetic. I find typography very difficult and interesting.\n\nI do not think that we will scrap Cooper Black. I will on the other hand definitely try out your suggestions concerning adjustments. Rugby is pretty brutal but we do not want to focus on the brutality. The team want to encourage female players to join and we hope a friendly logo is better than a brutal one.\n\nFor the record: placing this logo on the chopping block, in the critique section of Typophile, means that I welcome any critique, in any shape or form.\n\nAgain thanks for critique and suggestions from all of you, I'm learning a lot from them. The team love the logo and says hello! I'll post back once I have something to show.\n\nBest regards  \nBjornH\n\n"
    },
    {
      "time": "9 Jan 2008 — 11:53pm",
      "content": "The letters for the tag line is taking some time to collect. In the mean time, some update on the Cooper Black arrangement.\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwrugby8_4492.gif)\n\nEDIT: adding a render test\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwrugby3_5404.jpg)\n\nEDIT: not to bump my own thread\n\nThe rendered image might suggest that the water is extreamly cold. Here is a ref. shot of a UWR player. They use a second speedo in a looser/unshapely fit on top of their own.\n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/uwplayer_3578.jpg)\n  \nStepping gently out of the groin rendering minefield by testing party clown suits. Different suits for different occations might be a concept?  \n\n ![](http://web.archive.org/web/20140307105251im_/http:/typophile.com/files/UWrugby10_4911.gif)\n  \nI'm not to happy with the type as it is now, I think it looks to forced. \n"
    },
    {
      "time": "11 Jan 2008 — 9:57am",
      "content": "What seems wrong to me most is how the type is now interrupting the shapes.\n\n"
    }
  ]
}
