{
  "id": "39878",
  "title": "Q: Currency Symbol for the Yuan (Chinese Currency) U+5143",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Today I ran across the currency Symbol for the Yuan (Chinese Currency) U+5143 here\n\n[http://www.decodeunicode.org/en/U+5143](http://web.archive.org/web/20120622131919/http:/www.decodeunicode.org/en/U+5143 \"http://www.decodeunicode.org/en/U+5143\")\n\nAnd I wondered if it would be prudent to add to the set of major currencies that my monospaced programmer's font supports. But maybe there is a reason why this isn't standard- (yet?). Maybe there is a latin abreviation that's used. Maybe because the Yuan doesn't float in currency trading it isn't relevant. Or maybe it's time we all added the Yuan symbol!\n\nWhat do you think?\n\n",
  "author": "ebensorkin",
  "time": "7 Dec 2007 — 2:16pm",
  "uid": "2942",
  "comments": [
    {
      "time": "7 Dec 2007 — 2:30pm",
      "content": "It seems a mark of, what, honour, pride?--certainly not relevance--for foundries to include a raft of currency symbols in their fonts.  \nPut the blame on Unicode and FontLab.  \nAs far as I can determine, the only currency symbol other than dollar, cent, yen, sterling and euro that is used in a practical context is the colon monetaire, in Costa Rica (pop. 4 million).  \nOther than that, these symbols are never used, acronyms are, so are unnecessary and a complete waste of time.  \nLess use than smileyface and hot beverage!\n\n"
    },
    {
      "time": "7 Dec 2007 — 2:55pm",
      "content": "I was wondering what you were referring to when I saw the topic. Well, 元 (U+5143) _is_ a symbol for the yuan, but it is not a currency symbol in the vein of $, €, or £. It is a Chinese ideograph.\n\nI guess because of the nature of the Chinese writing system, many Chinese characters can be used in a way they can be considered symbols, and in the case of 元, it functions as a currency symbol. But keep in mind that many single Chinese characters stand for single words, and 元 standing for 'yuan' is a typical example of that. I don't have one at hand, but I'd think that Chinese dictionaries would include 元 as a character, whereas for example $ would not be considered a part of even an extended latin alphabet.\n\nThe character 元 is an interesting one though, because it bears little resemblance to the traditional character for 'yuan' is 圓 (the character for 'circular object'), or in the Mainland simplification, 圆. It is an übersimplified, informal character that must have been invented to avoid writing ten strokes or more for every mention of yuan in shop signs.\n\nAs displayed prominently on Japanese bank notes, the Japanese yen--which shares the character etymology of 圓 with yuan--uses a similarly simplified character 円.\n\nSo to answer your question, I'm not sure 元 (or 円) would be suitable for a monospace font, or indeed any font not supporting any other Chinese characters. Also, in \"monospace\" fonts supporting Chinese characters, the Chinese characters usually take up double the space of the usual monospace glyphs, and it might be jarring to see a \"half-width\" form of a Chinese character. Still, you're welcome to experiment.\n\nThe currency symbol for yuan is ¥, which it shares with the yen. As used for the yuan, ¥ can have either one or two crossbars; as I remember, two bars are preferred for the yen.\n\n"
    },
    {
      "time": "7 Dec 2007 — 3:34pm",
      "content": "Nick, maybe that's bang on. Especially from the point of view of proper emphasis. But... two things:\n\n- The old glyphs could be used in academic papers/texts. Eg \"in 1962 this cost 36 Fr (franks)\"\n\n- Also if I recall correctly when I was in Japan, prices in print usually did have the symbol. And I imagine that the Yuan would/could be similarly used in print.\n\nSo maybe we need a Sinophile to describe what the current state of affairs is.\n\n"
    },
    {
      "time": "7 Dec 2007 — 3:46pm",
      "content": "Would get the ¥ symbol next to a price paid for a business or would they simply use the Ideograph ( old or new)? What about in a car advertisement? Would that be true in Hong Kong & Bejing? What about in Korea? Singapore?\n\nUnless I am mistaken there are only two code points for the Yuan, the one I brought up ( the simplified one ) and the old one Brian mentioned. Does anybody know otherwise?\n\nWhen the Yuan is symbolized using the ¥ symbol are they just using whatever ¥&nbsp;they have in whatever font they have? That's my guess.\n\n"
    },
    {
      "time": "7 Dec 2007 — 6:27pm",
      "content": "First, let me clear up a slight mistake I made. I almost made it sound like 元 is a variant form of the traditional ideograph for yuan, 圓. It is not. It is a standard ideograph in its own right, of similar pronunciation but quite independent origins from 圓, with the meaning of \"fundamental\" or \"element\". Like most Koreans, I don't speak Chinese although I wish I did, and barely read some hundreds of Sino-Korean characters, as in knowing their Korean pronunciations and having a vague sense of their meanings.\n\nSo when I was in China and saw signs giving prices in the form 100元, I knew that 元 had the sound value of \"won\" in Korean (which corresponds to yuan), and immediately realized that it was the ideograph being used for yuan. Though I should have known better and in fact had a vague idea of what had happened, until I looked it up just now, I didn't know for sure that the Mainland Chinese just adopted a simpler ideograph with the same sound as the symbol for the currency yuan.\n\nI've visited China three times for a total of around three months. I've never been to Hong Kong, and only briefly visited Singapore too long ago to have any memory of the Chinese price signs there. So I only have fleeting impressions of how yuan is written in China.\n\nAs I recall, in printed signs and price tags, both the forms ¥100 and 100元 are used. In department stores, I recall the form ¥100 being used more often, but don't quote me on that. In handwritten signs, the form 100元 seems to predominate. I might have seen other permutations like 100 RMB where RMB stands for the Mainland currency _renminbi_. When the context is clear, the numbers alone may be used to indicate a price. I've never seen the traditional ideograph 圓 or its simplified variant 圆 used to indicate price in Mainland China. Bear in mind though that I've only seen signs and tags, not what's used in books or magazines for example. So there's the possibility that the traditional ideograph is reserved for more formal, literary uses.\n\nAs for Unicode code points, 圓 is U+5713 and 圆 is U+5706, both different from U+5143 for 元. Unicode encodes traditional and simplified Chinese characters separately.\n\nI also found [this page](http://web.archive.org/web/20120622131919/http:/www.alanwood.net/unicode/currency_symbols.html) which lists 圎 (U+570E) and 圜 (U+571C) as variants of the same ideograph. The page also describes the traditional ideograph 圓 as the currency symbol used in Hong Kong and Taiwan (I've been to neither).\n\nSo what about the Korean won? The Korean dictionary I looked up has separate entries for \"won\", the currency currently in use, and for \"won\", the historical currency before the currency reform of February 1954 when the _hwan_ replaced the won. The difference? The latter is written as 圓 in _hanja_, the Chinese characters used for Korean; the former is not written in _hanja_. Won is ultimately a cognate of yuan and yen, but I guess the public and/or the powers that be decided that any sense of the etymological origin of the word (\"round object\") has been lost by now and has been entirely replaced with the sense of \"unit of currency\".\n\nSo legally and properly, the (current) Korean won has no Chinese ideograph equivalent. However, \"won\" is a short enough, monosyllabic name that the Korean alphabet spelling 원 is used in most price signs and tags, as in 5000원. The same price may also be listed as ₩5000 in print or more rarely in handwriting (₩ is the currency symbol for the won).\n\nI think word order might be an important reason why the currency is \"written out\" rather than indicated by the currency symbol; we say \"one hundred dollars\", which is better reflected in writing \"100 dollars\" rather than \"$100\". Whereas in English, writing out \"dollars\" is unwieldy compared to just writing \"$\", in Chinese, Japanese, and Korean (as well as Thai, I might add), \"writing out\" the names for the currency is less cumbersome and so makes using currency symbols like ¥ and ₩ less pressing alternatives.\n\n"
    },
    {
      "time": "7 Dec 2007 — 8:07pm",
      "content": "Thanks Brian!\n\n"
    },
    {
      "time": "11 Dec 2007 — 4:17am",
      "content": "My impressions from a recent visit to China match Jongseong's. Unofficially, many Chinese have co opted the Yen sign (¥), especially in contexts they feel to be international. There seems to be no official typographical symbol for the yuan, yet. The government of Taiwan calls their currency \"New Taiwan Dollar\", abbreviated NT$.\n\n"
    }
  ]
}
