{
  "id": "3988",
  "title": "Just Getting Started, looking for a little advice",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti"
  ],
  "content": "Hello, I am about to begin work on my first typeface. This will be a digitization of the letters that my grandfather drew on Christmas cards and the like. It's sort of a Bodoni-esque style filtered threw my grandpa's congenital hand tremor.   \n   \nThe reason I am posting is this: I have enough experience in other things to know that there are usually important questions to ask one's self at the outset of a project like this. Having zero experience in making a typeface, I don't know that I'm asking myself enough questions, or the right ones, or all of them.   \n   \nMy question for you is this: from your experience, what are the major and minor considerations for creating a typeface based on the sample posted below?   \n   \nThank you very much,   \n   \nAlex G.   \n   \n ![The year he got me a subscription to the Nation...](http://web.archive.org/web/20150419023952im_/http:/www.typophile.com/forums/messages/29/32183.jpg)\n\n",
  "author": "ag_alt",
  "time": "28 Mar 2004 — 10:10am",
  "uid": "2605",
  "comments": [
    {
      "time": "28 Mar 2004 — 10:36am",
      "content": "I think the main question to answer in such a design is how you will balance faithfulness to the original against typographic integrity.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2004 — 11:12am",
      "content": "As I get further into this, I'm understanding better what you meant by balancing faithfulness to the original and typographic integrity. I find myself making a lot of decisions. Right now I'm looking for this balance as I sketch the forms of the caps in Illustrator.   \n   \nHere's about as far as I've gone. At this point I'm interested in comments that could help make this useful.   \n   \n ![](http://web.archive.org/web/20150419023952im_/http:/www.typophile.com/forums/messages/29/32464.gif)\n\n"
    },
    {
      "time": "1 Apr 2004 — 11:31am",
      "content": "Charming... and authentic so far.   \n   \n :-)   \n   \nSome of the curvy letters might need some optical adjustments.   \nFor instance: the O\n\n"
    },
    {
      "time": "1 Apr 2004 — 12:20pm",
      "content": "That's outstanding.   \n   \nSome suggestions: give the serifs a little more weight on some of the glyphs. For instance, your grandpa's N in Nation has very pronounced serifs.   \n   \nAlso, and I know this is somewhere in the future, but I'd love to see an italic version, such as he used in \"for a year.\" Good stuff!\n\n"
    },
    {
      "time": "1 Apr 2004 — 1:03pm",
      "content": "You're right, this is very close to Didot. I'd been looking at a version of Bodoni for guidance, but there were some differences between it and the character of my grandpa's letters that I had to work around. Didot is a much closer fit.   \n   \nAnd thanks for your comments. This is my first typographic effort, and it's more difficult than I expected. I feel encouraged. Ultimately I'd like to do the italic, and also an outline version of the capitals.\n\n"
    },
    {
      "time": "17 Apr 2004 — 10:47am",
      "content": "Well, I haven't given up yet. I do need some critical guidance though: I've been trying to reconstruct the lower case using a combination of g'pop style and didot. I'm particularly concerned with the letters: a, e, and especially g.   \n   \nThe 'g' is driving me nuts: sticking to the principle that this font is a version of didot as imagined by an 80-something retired architect with a hand tremor, I've decided that a binocular 'g' is not something he would have done. I've also decided that using an uppercase 'g' in the lowercase isn't something that I want to do. I think the best approach is to didonicize a cursive g, which is what I've been trying to do with very little success. Any suggestions would be very welcome.   \n   \nAnother concern: I read somewhere that having many anchor points in a font outline creates problems with computer printers, etc. Is this style a problem? Or is this a concern that belongs to several years back when things weren't quite as robust?   \n   \nCurrent samples:   \n   \n\\<img\\>   \n   \n\\<img\\>\n\n"
    },
    {
      "time": "17 Apr 2004 — 10:50am",
      "content": "Okay, Current samples:   \n   \n ![](http://web.archive.org/web/20150419023952im_/http:/www.typophile.com/forums/messages/29/33704.jpg)   \n   \n ![](http://web.archive.org/web/20150419023952im_/http:/www.typophile.com/forums/messages/29/33705.jpg)\n\n"
    },
    {
      "time": "19 Apr 2004 — 9:46am",
      "content": "Oh, and please ignore the spacing. I'm not at that stage yet, I just pasted this thing together! ![:-)](http://web.archive.org/web/20150419023952im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "1 Apr 2004 — 12:30pm",
      "content": "I agree with John ... I do like the N is NATION more than the one in NASAL. I agree with Nicolai's comment about the O as well. The R in HONOR seems a little too droopy. The B might be a little narrow, or maybe the E is too wide?   \n   \nThis is fun, reminds me of Didot. You might reference Didot on a few of these characters. I really d like the warmth of it, reminds me of old movie titles.\n\n"
    }
  ]
}
