{
  "id": "39882",
  "title": "logo discovery for visual design company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’ve just chosen 10 sketches from my discovery phase for a logo for my visual design company Binary Colors. I specialize in flash animation and motion design. I want the logo to have a tech feel but still show characteristics of my design background. Any and all critiques would be appreciated no matter how painful.\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/bc_final10_4661.gif)\n\n [‹ Font for Web Design Business logo needed](http://web.archive.org/web/20071213222726/http:/www.typophile.com/node/38426 \"Go to previous forum topic\") [Law firm logo, letterhead ›](http://web.archive.org/web/20071213222726/http:/www.typophile.com/node/35829 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071213222726/http://www.typophile.com/user/24786\" title=\"View user profile.\">BInaryC</a>",
  "time": "<br>",
  "uid": "24786",
  "comments": [
    {
      "time": " 7.Dec.2007 4.46pm",
      "content": "I think black/white background in number one underlines “binary” in a good way. Also, the type reminds me of Benetton (of some wierd reason) – I immediately tought of colours. You will need to visualy align the words better.\n\nThe cables in number seven are great.\n\n"
    },
    {
      "time": " 7.Dec.2007 5.42pm",
      "content": "#7 cables would need some work to read as an s  \n#5 the 1&0 is clever, but you’d have to watch that it doesn’t read as “loinary”  \nLetters in #2, 6, and 10 have a very retro (’57 Chevy) kind of feel - is that intended or desirable for your brand?  \nI think #5 is my favorite, if the above concern could be lessened somehow.\n\n"
    },
    {
      "time": " 7.Dec.2007 5.54pm",
      "content": "Nice series! I like number 7 quite a bit but I’m not seeing the s to well either. Are the dark spots in number 2 indicating led lights?\n\nI look forward to seeing how this logo progresses. Please keep us posted.\n\nSharon\n\n"
    },
    {
      "time": " 7.Dec.2007 10.06pm",
      "content": "Lovely sketches.\n\n5 seems to be the one, which even at this stage, clearly spells out an idea. The ’1’ and ’0’ do read as ’l’ and ’o’, but that can quite easily be corrected, I feel.\n\n"
    },
    {
      "time": " 7.Dec.2007 10.59pm",
      "content": "Too bad Master Card’s logo is taken because in some ways that’s the obvious solution with a name like that. Which brings me to my 2 cents. All of these logos ideas are okay but are a little too fussy & clever. I say that because the name itself sounds classy & simple. So I would go that way. Think of obvious stuff & find a way to make that it simple & low key. If you really want to go the other way & be very special effect/lucas film-y; why not a binary stars? One red one blue? Then just pick a font and write the name simply underneath. Or do something with the two holes in the upper case B maybe, but keep it understated.\n\nWhy this name? What’s it mean?\n\nThanks for showing this to us.\n\n"
    },
    {
      "time": " 8.Dec.2007 12.35am",
      "content": "Thank you for all the feedback everyone. I feel that maybe I haven’t explored the word color as much as I should. I am having a tough time coming up with concepts of color that aren’t old and used or just to busy (test patterns, color blocks, etc.)\n\neliason the ’57 Chevy isn’t what I was looking for. I was trying to play with a few scripts just to explore some different typeface options but it doesn’t sound like I got the effect I was looking for-a techy, yet artsy typeface.\n\nSharon the dots are supposed to look like the connector circles on circuit diagrams but the more I look at them the more I believe they should be more subtle.\n\nEben I really think your on point. I’ve played with the binary star concept a lot and have missed the mark. I would really like something modern and understated. Maybe I will revisit. I chose the name for two reasons: (1) Playing off the phrase “Primary” Colors and (2) Adding the Binary to mean digital since all my work is ’digital colors’ in essence.\n\n"
    },
    {
      "time": " 8.Dec.2007 3.23am",
      "content": "I think I might have a sweet one for ya. What about ’binary c01ors’? Hint: See the “zero one”?\n\nI actually like the idea enough that I would be happy to work on it formally with you. That if you would like the help. If so send me an email.\n\nBTW: It would work better in a monospace font.\n\n"
    },
    {
      "time": " 8.Dec.2007 3.52am",
      "content": "I’m up for exploring that option, I’ll drop you an email. I’m still wondering if I should be focusing more on ’colors’ since my focus is the visual design aspect. I swear working personal projects is so much more difficult!\n\n"
    },
    {
      "time": " 8.Dec.2007 6.18am",
      "content": "binary co1ors.\n\nbrilliant\n\n"
    },
    {
      "time": " 9.Dec.2007 6.45am",
      "content": "Excited to see how it turns out, clever concept! Is it zero-one-zero or only zero-one?\n\n"
    },
    {
      "time": " 9.Dec.2007 11.31am",
      "content": "This isn’t the final typeface choice but I figured it would work for testing eben’s suggestion.\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/c01ors_5590.png)\n\n"
    },
    {
      "time": " 9.Dec.2007 12.17pm",
      "content": "On the bottom one the 1 seems too heavy. Actually the weight seems strangely uneven all over. The s & c on the top one don’t seem to relate. Did you make these letters? Are they from a font? Are you using machine/auto bolds?\n\nIf you are using a font I would suggest looking for one where the ’ry’ combination is better.\n\n"
    },
    {
      "time": " 9.Dec.2007 12.26pm",
      "content": "I’m using a font but no auto bolds. I see what you’re saying; let me find something better to work with.\n\n"
    },
    {
      "time": " 9.Dec.2007 1.16pm",
      "content": "Here are three samples with three variations of height on the 1. Anyone have a suggestion of a monospace font that would be best to experiment with this idea on?\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/c01ors-v2_5059.png)\n\n"
    },
    {
      "time": " 9.Dec.2007 7.20pm",
      "content": "There are a lot actually. OCRA on the “tech” side, all the way to Consolas with a slight humanist riff. Or Lucas De Groot’s other Mono Space fonts like ’The Sans Mono’ Also Andale Mono, or Osaka Mono. There is something wrong with the lc s In Osaka though. On the top. Orator. Actually I was just looking at Udo, even though you don’t get the lc l effect but still, it looks pretty great. Add some color and you might be there.\n\n"
    },
    {
      "time": " 10.Dec.2007 6.33am",
      "content": "I think you need (at least one of) the o’s to read clearly as a zero, or else the “joke” gets lost. I think even a slashed (or maybe even better, a dotted) zero would work.\n\n"
    },
    {
      "time": " 10.Dec.2007 7.46am",
      "content": "This could also be a way of taking it forward:\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/BC_1_6636.jpg)\n.  \n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/BC_2_3805.jpg)\n.  \n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/BC_3_4560.jpg)\n.  \n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/BC_4_4392.jpg)\n.\n"
    },
    {
      "time": " 10.Dec.2007 11.03am",
      "content": "I’m pretty sure Andale Mono has a dotted zero, I’ll take a look at that.\n\n"
    },
    {
      "time": " 10.Dec.2007 2.02pm",
      "content": "Arun, that’s great.\n\n"
    },
    {
      "time": " 10.Dec.2007 7.19pm",
      "content": "Thanks Eben. I had used Orator, if that helps.\n\n"
    },
    {
      "time": " 10.Dec.2007 8.41pm",
      "content": "Arun, i like your explorations as well. I think you hit on something adding the 1 in binary - with that, i think the extra lines of 1s and 0s may be unnecessary.\n\n"
    },
    {
      "time": " 10.Dec.2007 9.21pm",
      "content": "I like the look of the 1 in binary too. I saw that in a CNET logo somewhere so I was trying to stay away from it, but it does fit the concept. Orator looks great, but isn’t it all caps? I’m really leaning towards using all lc so I can the concept from sketch #5 (the lc b lettermark made of a 1 and 0) as an element that goes with the b1nary co1ors. Another option to use on web pages.\n\n"
    },
    {
      "time": " 11.Dec.2007 12.12am",
      "content": "Looking again if it was me I would ask Arun nicely If I could use the last two versions & have done with it. They are just so good.\n\nThe only thing I can imagine doing differently now is maybe letting some colors wash through the 01010s. Making the i & l read through the 1 is sooo sweet. It shouldn’t work logically & yet it does.\n\nStill, it’s hard not to keep digging.\n\nAs to the middle line not being needed I guess you could try it without but I think it brings a certain grace. A pause that is probably how the i & l trick works!\n\n"
    },
    {
      "time": " 11.Dec.2007 7.40am",
      "content": "“Arun, i like your explorations.... i think the extra lines of 1s and 0s may be unnecessary.”\n\nThanks Jarrod. As Eben says, dropping the middle row doesn’t work too well. Do take a look:\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/BC_6_6253.jpg)\n\n.  \n“I like the look of the 1 in binary too....”  \nRobert: Thanks. Yes, Orator is all caps. It’s your call finally, but the concept seemed so interesting that I couldn’t resist playing around with it for a few minutes. Just in case you’d like to go along this route, it may be an idea to use the 0s and 1s as a sort of secondary property. For instance you could use it as a background pattern on your website, or along the rear-face of your letterheads.\n\n.\n\nEben, reading your post was a nice way to start the day this morning:) I’d be happy to send across the files if it’s useful.\n\nDo take a look at this option to see if this what you were thinking of on colours running through:\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/BC_5_4911.jpg)\n\n"
    },
    {
      "time": " 11.Dec.2007 9.22am",
      "content": "I think that looks REALLY amazing with the colors running through the 0s and 1s! The small caps are growing on me too. As much as I like it I feel that extra line of numerals makes the logo massive; that’s a lot of real estate. Nonetheless, Arun do you mind if I run in the direction you’ve taken the design? I think you really hit on something.\n\n"
    },
    {
      "time": " 11.Dec.2007 9.36am",
      "content": "”...that’s a lot of real estate”\n\nIf space is an issue, you could always do this:\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/BC_7_6691.jpg)\n  \n.  \n.\n\n“do you mind if I run in the direction you’ve taken the design?”\n\nNo problem. If it gets anywhere, ’would appreciate it if you’d post. Good luck :)\n\n"
    },
    {
      "time": " 11.Dec.2007 10.02am",
      "content": "I think Arun has hit the nail on the head with the three lined, colored transition logo. I am unsure why the extra line would compromise the real estate issue. As it would or could work in the same way the TYPOPHILE logo works for interactive media.\n\nI loved watching how this logo evolved. It was succinct and pushed and pulled really well.\n\n"
    },
    {
      "time": " 11.Dec.2007 8.17pm",
      "content": "Arun, just curious, is the B1NARY spaced out because the shape of the Y will look anemic on the right? My eyes find it curious and a little jarring that this monospace font’s letters don’t align vertically.\n\n"
    },
    {
      "time": " 11.Dec.2007 11.57pm",
      "content": "I did one according to Arun’s artwork as displayed below. I personally think i in Binary and l in Colors should not use the same 1 so I stick with 010 combination and since the original concept is to play with Primary colors, so I use only red, yellow, blue for 0, 1, and 0. And it’s Andale Mono for your reference (I added the line in 0’s to make it read zero la).\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/binarycolors_5425.gif)\n\n—- pinky kinky winky —-\n\n"
    },
    {
      "time": " 12.Dec.2007 11.04am",
      "content": "“Arun, just curious, is the B1NARY spaced out because the shape of the Y will look anemic on the right?...”\n\nNot really Craig, just slapdash execution. Shouldn’t be doing that sort of thing on a type forum :) See if this is a little more comfortable for you:\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/BC_8_3551.jpg)\n  \n.  \n.\n\n“I did one according to Arun’s artwork as displayed below...”\n\nViroj, that’s an equally valid solution.\n\nThe way I read it, the little coup in the name was that it replaced ’primary colours’ with ’binary colours’ thereby promising a richer visual experience. It is sort of ’beyond primary colours’. Which is why I felt a slightly more exuberant palette made sense.\n\n"
    },
    {
      "time": " 12.Dec.2007 3.08pm",
      "content": "Or you could let the colors bleed. This is my unreleased mono.\n\n ![](http://web.archive.org/web/20071213222726im_/http:/www.typophile.com/files/goofing_6330.jpg)\n\n"
    }
  ]
}
