{
  "id": "39896",
  "title": "Aldus, a sans serif companion?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've previously published a book typeset in Palatino. Examples in the book were presented as an italic in greyed boxes. I'm considering revising the book for a second edition, and among other changes I am using the more readable (and to me, visually interesting) Aldus. I'd also like to ditch the italic in favor of a sans serif, but am unsure what pairs well with this typeface. Any recommendations? (Likewise, any reservations against mixing sans serif and serif in this fashion?)\n\n",
  "author": "Clay",
  "time": "8 Dec 2007 — 8:33pm",
  "uid": "24859",
  "comments": [
    {
      "time": "8 Dec 2007 — 9:45pm",
      "content": "Actually, while I'm on the subject...\n\nPart of the reason I'm switching to Aldus is because, originally, I had artificially altered the width of Palatino due to its rather wide stature. I have since seen the error of my ways and thought Aldus was a better way to go about it. However, I have a vast preference for Palatino's more script-esque punctuation. Aldus's commas and exclamations seem blandly round by comparison.\n\nWith the advent of the new Palatino Nova, has a face more suitable for extended book text been created? Conversely, how egregious would it be to simply slip Palatino's punctuations into Aldus? Or, just to simplify matters, is it so bad to simply set Palatino's width to 92.5% as I had before?\n\n"
    },
    {
      "time": "8 Dec 2007 — 10:31pm",
      "content": "Regarding [squooshing](http://web.archive.org/web/20131023125224/http:/typophile.com/wiki/squooshing): You should do what looks good to you, but usually, compressing or expanding type by more than a few percentage points is dangerous as it messes with the delicate proportions of the verticals and horizontals and the thicks and thins. For example, my newspaper compresses its headline type by 90%, which I cringe at every time I see it. So I'd suggest Aldus over compressed Palatino.\n\nRegarding Palatino Nova: There's also an [Aldus Nova](http://web.archive.org/web/20131023125224/http:/www.linotype.com/109957/aldusnova-family.html). I haven't had a chance to use Palatino/Aldus Nova, but I've heard good things. I've read that Zapf designed them to work with digital typography, as opposed to metal.\n\nRegarding sans-serif pair: Rather obvious, but have you looked at [Palatino Sans](http://web.archive.org/web/20131023125224/http:/www.linotype.com/111707/palatinosans-family.html) and [Sans Informal](http://web.archive.org/web/20131023125224/http:/www.linotype.com/113189/palatinosansinformal-family.html)?\n\n"
    },
    {
      "time": "9 Dec 2007 — 7:48am",
      "content": "Yes, I have, but I've only seen them available as rather expensive \"packs\" and was hoping for a suggestion already part of my collection. \\*laughs\\* But perhaps I should just bite the bullet. Thanks for all the help!\n\n"
    },
    {
      "time": "9 Dec 2007 — 11:47am",
      "content": "Palatino sans is sold by the weight, and Linotype has recently made most high-end collection fonts available in much less expensive four-weight packs, so it might be less expensive than you think.\n\n"
    }
  ]
}
