{
  "id": "399",
  "title": "Fontlab or Fontographer? Newbie needs advice",
  "forum": "Build",
  "tags": [

  ],
  "content": "Back in about 1996 I developed an interest in fonts and started making some. I used Fontographer, the only program I knew of at the time. I had a lot of fun, but I haven't done anything since then.   \n   \nNow I'd like to get back into things. Not only that, but my mother is interested and wants to learn as well. We have slightly different goals, but I'm hoping to gather some advice from all you experts about what software would be the best buy to meet our needs.   \n   \nI have a background in graphics design, and I just LOVE fonts, for reasons I don't think I need to explain to this audience! I work with Photoshop a lot, but not with very many other graphics programs (though I am quick to learn). I'd love to be able to create my own fonts to meet specific needs, and also just because it's art and it's fun.   \n   \nMy mother is a schoolteacher, and her interest in fonts is primarily for her classroom. She'd like, among other things, to be able to make a font of her own printing, plus various cute, theme-based letterings (animals, flowers, etc.) that can be personalized more than the downloadable freebies out there (we're talking pictures with letters pasted on top probably - nothing very fancy). She is not very experienced with any design software though, so if this stuff is too complicated, it won't work for her (she does have 2 capable people to help her out though, but even then there are limits). Also, since it's just for her own personal use and satisfaction, the \"good enough\" motto applies.   \n   \nWe both use Windows (2000, probably XP sometime soon). From what I have read, Fontographer seems easiest to use, but Fontlab sounds more flexible. Can anybody comment? Also, there seem to be a myriad of smaller, cheaper programs, but I can't tell for certain whether they will be a good enough starting place for us, or if we are better off with one of the big ones.   \n   \nSorry for such a lengthy post, but when we are considering forking out $550 US (which is more like $800 Canadian, for us) it's a big enough investment that I want to make sure we make the right choice. ![:-)](http://web.archive.org/web/20050524123219im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nLooking forward to some interesting comments and advice! Thanks everyone,   \n   \nJulie\n\n",
  "author": "tzulah",
  "time": "Fri, 2003-06-20 11:32",
  "uid": "1963",
  "comments": [
    {
      "time": " Fri, 2003-06-20 12:16",
      "content": "Julie   \n   \nFontLab is also selling a light version of its software called TypeTool. You can download a demo (and manual) from the FontLab site. I think it only costs about $100. About the same as Fontographer.\n\n"
    },
    {
      "time": " Fri, 2003-06-20 13:20",
      "content": "Fontographer is most likely powerful enough to do what you need, but it's a dead end. So I'd second Gerald's suggestion. Also, in the case of your mom, she might be better off drawning the letters on paper (or maybe even in something like Illustrator), but leaving the gory stuff like spacing, encoding, etc. to somebody else - maybe you!   \n   \nhhp\n\n"
    },
    {
      "time": " Fri, 2003-06-20 14:06",
      "content": "FontLab also has a product called ScanFont which acts as a plug-in for either TypeTool or FontLab. It will take a scan of the complete character set and somewhat automate the process. Also available as a demo with downloadable manual. Another $100. And then there is TransType, a font format converter. Demo, manual, another $100. FontLab, yeah, they got it figured out.\n\n"
    },
    {
      "time": " Fri, 2003-06-20 20:49",
      "content": "Remember that FontLab offers academic pricing, for which your mother would probably qualify as a teacher. It's about half off.   \n   \nDavid\n\n"
    },
    {
      "time": " Tue, 2003-07-29 23:08",
      "content": "At this time, I'd recommend almost anything that isn't Fontographer. It is, as Hrant says, a dead end (at least at this time).   \n   \nCheers,   \n   \nT\n\n"
    }
  ]
}
