{
  "id": "39903",
  "title": "Attempt at type design - hoping for some advice",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I’ve been attempting to teach myself type design but don’t see any point in learning about kerning pairs, hinting…etc until I have some letterforms I’m actually satisfied with. After playing around with the enclosed for ages, I feel like I am going round in circles. The idea was to do a sans with roman proportions and I started out doing a skeleton using Sabon, then thickened everything in Freehand and re-did the branch connections/line intersections and tried to optically compensate all the horizontal bits. Basically I’m not completely happy with the letters and not sure they work together properly, but can’t quite figure out why. Any suggestions would be greatly appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [test.pdf](http://web.archive.org/web/20131012071414/http:/typophile.com/files/test_2.pdf) | 21.31 KB |\n\n",
  "author": "sihep",
  "time": "9 Dec 2007 — 10:20am",
  "uid": "17392",
  "comments": [
    {
      "time": "11 Dec 2007 — 2:54am",
      "content": "Hi Simon. Everything looks neatly finished but the spacing is fairly wide. In the PDF are we looking at default sidebearings, or has everything been tracked out? It's hard to say much about how it perfoms without seeing text settings.\n\nProportions look good. Notes:\n\na -- bowl shape lacks definition and rigor.\n\ne -- could be a tad wider. That's a personal taste thing. Some people prefer the e narrowish in a roman set like this.\n\ng -- could be wider. Top bowl by 15%, bottom bowl by 20 - 30%\n\ni & j -- dots can be that big if you want and will give good performance at 8pts or smaller. At larger sizes some people may be alarmed by them. Left side bearing on j too wide.\n\nG -- align crossbar with E, F, H midline?\n\nH, N, U -- in both even width caps and proportional caps, H often turns out to be the measure of all things. I base the width of N and U on H. \\*Base\\* them on H, as making them the same won't neccessarily work. If you make H about 10% wider, N could then be narrowed by approximately the same amount, then widen U to suit.\n\nR -- consider moving top of leg back to harmonize with angles on K, N, X\n\nr -- arm lacks definition.\n\nS -- curves letting the team down a bit. Adjust spine angle and reshape curves to match P, B etc. If you change S you might change s to match, since that kind of thing is such a contemporary preoccupation.\n\nV -- a bit narrow by prevailing standards.\n\nOverall it's sweet but undistinguished. There are dozens of competitors out there just like it. Were it to be released as is (with spec corrections) most font buyers will fail to see the point.\n\nBut keep going.\n\nj a m e s\n\n"
    },
    {
      "time": "11 Dec 2007 — 12:16pm",
      "content": "Awesome James – many thanks for that. I’m actually just at the stage of trying to learn how to draw letters so I can guarantee I won’t be releasing any typefaces anytime soon. I do have to start somewhere, though. Will now go back to my cave and try some of your adjustments. Thanks again, Simon H.\n\n"
    },
    {
      "time": "11 Dec 2007 — 1:07pm",
      "content": "Great. I experienced the same thing when I first started making fonts. Ganymede was drawn three times over, and I still wasn't happy with it.\n\nIt's a process of first learning how to draw letters, then drawing them enough times until you've got stylistic range and you're confidant with genres. The only way to attain that confidence is to draw some fonts, so it involves making a few early ones you will probably always look back on as learning material. But as you say, you have to start somewhere, and you've made that start.\n\nOnce you start it can be just as tough walking away from a font you're certain is far from finished, even if you're sick of working on it. So, if it really gets to you, have no qualms about putting this one away for a while and starting another one, because once you've got some experience a fresh start is always good.\n\nI think what you've got here is very nicely conceived (Sabon is a good starting point for a sans); it needs refinement and more specific shapes for the bowl letters to give it a true voice. It's good in a way that you've kept it neutral to begin with. There are many directions it could go in from here. Would you like styling suggestions?\n\nj a m e s\n\n"
    },
    {
      "time": "12 Dec 2007 — 2:17am",
      "content": "Funnily enough I had naively thought that 10-ish years of working with type would allow me to suddenly start drawing it competently but now I realise that with graphic design you only really know what words and text blocks look like and don’t actually ‘see’ the individual letters. I’m also not used to concentrating on 1 thing for long periods of time but wouldn’t say I’m sick of yet – think you just lose objectivity after a while. I do have a couple of other unfinished typeface attempts so am going to make an effort to beat this one into shape.\n\n“There are many directions it could go in from here. Would you like styling suggestions?”  \nCompletely agree about it being ‘undistinguished’ and lacking a personality - would obviously be very interested to hear any ideas.\n\n"
    },
    {
      "time": "12 Dec 2007 — 7:21am",
      "content": "Start by defining exactly the genre of type you aim to make. Some well-known plots this font could easily turn into:\n\n1) pen-influenced,  \n2) neutral sans,  \n3) geometric sans  \n4) stressed linear,  \n5) \"high-concept\" high-definition stressed linear,  \n6) blackletter-influenced,  \n7) \"gothic\" sans eg: URW++, Brown,  \n8) serifless Sabon, with or without stressing  \n9) Gill-esque humanist  \n10) Koch-esque\n\n11) something else.\n\nLowercase **a** is obviously a key genre-setting device, as vigorously-discussed elsewhere. Look at a dozen or so premium sans serif fonts in the genre you like and pick an **a** bowl design that appeals to you. Have a good close up look at its construction.\n\nThis **a** I drew over a year ago:\n\n ![](http://web.archive.org/web/20131012071414im_/http:/typophile.com/files/parlance_a_6140.gif)\n\nRigor depicted by way of an exaggerated plot and shape contrast. I was aiming for a high tension effect---toyght like a toyger! You may not need that much tension but you can apply the spirit of it to your moxie-starved **a**. Keep your bowl size and proportions, but---\"jarr\" the lines by way of exaggeration.\n\nYou probably need to add more nodes to make a \"bespoke\" bowl shape.\n\nj a m e s\n\n"
    },
    {
      "time": "12 Dec 2007 — 12:01pm",
      "content": "Hi James, I’d originally got the idea from admiring a book done completely in Syntax (‘Rencontres Typographiques’ by Roger Châtelain) which I guess is ‘pen-influenced’, along with lapidary writing. Think mine has ended up as ‘neutral’ without my consciously deciding – possibly because my last attempt was an Akzidenz rip-off. I had thought about removing the remaining Roman references but will have a go at re-drawing them instead. Will hopefully report back at some point next year if I manage to get anywhere – cheers again for the comments, this has been a huge help.\n\n"
    },
    {
      "time": "15 Dec 2007 — 8:22pm",
      "content": "You're in the right ball park for a Syntax-like humanist sans, and yes at this stage it is veering into neutral territory.\n\nSome directions you could go in from here:  \n\\* keep the remaining Roman/roman references and add more cues from 16th century Italian designs like Jenson and Griffo, to give it a stronger humanist resonance than Syntax.\n\n\\* If that works out the design could be further differentiated by adding more definition to the outlines. You might end up with an exaggerated humanist type. I'm picturing something related to Frantisek Storm's Sebastian, one of the few examples of a \"high-concept, high-definition stressed linear\", but different again.\n\nj a m e s\n\n"
    },
    {
      "time": "17 Jan 2008 — 1:32am",
      "content": "What James was saying about the a makes sense. It does feel a bit floppy somehow.\n\nI think the g is the weakest point. Optically is is way heavier than the letters around it. It isn't a part of the group.\n\nRather than pounding out all 26 letters again I would get a core set together maybe 'aoiehns' or something similar & really get what you are after settled in a deeper way. Otherwise the thing becomes too labour intensive to let yourself do the right things - and by this I mean being relentless and not settling for second best. Then you can swing back through and have some good fun with the g and fight your way through the diagonal shapes knowing that at least the core latin shapes are solid.\n\nAnd then you can question it all over again. ;-)\n\n"
    },
    {
      "time": "18 Jan 2008 — 3:08am",
      "content": "_Rather than pounding out all 26 letters again I would get a core set together maybe ’aoiehns’ or something similar & really get what you are after settled in a deeper way._\n\nYep. I would include v, f, t, and one bowl letter as well.\n\nj a m e s\n\n"
    }
  ]
}
