{
  "id": "39907",
  "title": "Gohan Script is Chewy",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Sometimes it's hard to decide which slot to file a design under, but since this is derived from an old display type of mine, I figure it ought to stay with the display category.\n\n ![](http://web.archive.org/web/20150417045330im_/http:/typophile.com/files/screenshot_0249_5601.png)\n\nThis is based pretty loosely on my old [Gohan](http://web.archive.org/web/20150417045330/http:/www.1001fonts.com/font_details.html?font_id=2205) font, available for free if you'd like to compare.\n\n| Attachment | Size |\n| --- | --- |\n| [gohancript-testsheet-001.pdf](http://web.archive.org/web/20150417045330/http:/typophile.com/files/gohancript-testsheet-001.pdf) | 21.01 KB |\n\n",
  "author": "cuttlefish",
  "time": "9 Dec 2007 — 12:17pm",
  "uid": "14556",
  "comments": [
    {
      "time": "21 Dec 2007 — 9:40am",
      "content": "This is really nice! The 4 is so great.\n\nA few characters that kinda bug me are the lowercase v, maybe could be more pointed at the bottom.  \nI think the diagonal on the capital X is too thick. Perhaps the top of the capital T as well.\n\nI can't wait to see this finished.\n\n"
    },
    {
      "time": "30 Dec 2007 — 1:34pm",
      "content": "You're right about the x there. Most of these letters are based in the Gohan font skewed 10° (heavily modified thereafter). The swelling of the downstroke diagonals, most obvious in the X, is an artifact of that.\n\nI'm glad you like the 4, though. It has kind of troubled me, since it is a descending numeral among an otherwise lining set of figures. It is, however, the least derivative from the upright of the set.\n\nI tried making the v more pointed, but that just resulted in the vertex being too thick, and II had trouble fixing that with a deep ink trap. That solution worked on the uppercase but to make it deep enough to be visible in the lc distorted the strokes too much.\n\n"
    },
    {
      "time": "3 Jan 2008 — 4:38pm",
      "content": "I think it's a nice set within your font family.\n\nAlthough I noticed something that might not be a big issue. If you design the G with a descender, why not giving the Y one as well?\n\nBy the way, very interesting stamp.\n\n"
    },
    {
      "time": "4 Jan 2008 — 3:27pm",
      "content": "The font is still a bit half-baked. The G has a descender because it didn't look good without one, though I find it looks deflated as it is. The Y looks just fine without a descender, in my opinion, but I would definitely like to make some swash alternates eventually, and those would include a long Y.\n\nWhich ampersand do you like?  \nand that 3 shaped Z; what's up with that?\n\n"
    },
    {
      "time": "6 Jan 2008 — 4:21pm",
      "content": "Haha don't be so hard on yourself.  \nThe last ampersand is the best.\n\nI think it's time to see some settings. Maybe some increasingly dangerous cheeses...  \n [http://www.mcsweeneys.net/links/lists/29LucasKlauss.html](http://web.archive.org/web/20150417045330/http:/www.mcsweeneys.net/links/lists/29LucasKlauss.html \"http://www.mcsweeneys.net/links/lists/29LucasKlauss.html\")\n\n"
    }
  ]
}
