{
  "id": "39905",
  "title": "Shape of things to come",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Going through another thread: typophile.com/node/39632 brought up the thought of typography and the future.\n\nFilms; Hollywood ones in particular, make projections from time to time on how the world might look in the future (eg. Minority Report)\n\nDoes anyone know of similar exercises with type.\n\nI know of all those typefaces that were inspired by 60s and 70s sci-fi. But anything that draws from more recent paradigms in science/technology? Ideas more evolved than say Blur or the many pixel-fonts.\n\n",
  "author": "writingdesigning",
  "time": "9 Dec 2007 — 11:28am",
  "uid": "18436",
  "comments": [
    {
      "time": "9 Dec 2007 — 11:56am",
      "content": "I get the impression that futurism in the visual creative fields is sort of fading out in the same way it has done so in science fiction. So many of the twentieth century’s preconceptions of the future just turned out to be dead wrong because people imagined the twenty-first century all of the wrong: genetically engineered people flying through space staring at CRT screens and only important people had anything resembling a cell phone. I think that the same sort of holds true of futurism and type; people assumed that type would reflect computers of the time, instead type fit to computers has become anachronism and all the old notions of type are being revived. I expect that in a few more decades screen resolution will have increased pretty dramatically (e-readers are already in the 120-160 dpi range) and there may not be any reason for type to have strayed too far from the path its on now.\n\nOne could argue that there are futurist tendencies in the orthographic reforms proposed by Bayer and Crouwell, but that could simply be an impression ingrained in our minds by the people who used those types to seem futuristic because they were unfamiliar.\n\n"
    },
    {
      "time": "9 Dec 2007 — 12:25pm",
      "content": "That's quite a comforting vision, James :) I think I agree with most of what you say.\n\nAlthough I was quite keen to know what people here thought about this, I was in fact holding back from making this a type-futurism question thinking that it would appear somewhat pointless to many.\n\nCan't say I'm familiar with the 'orthographic reforms proposed by Bayer and Crouwell'. Will look it up. Thanks for mentioning.\n\n"
    },
    {
      "time": "9 Dec 2007 — 2:31pm",
      "content": "<cite>Can’t say I’m familiar with the ’orthographic reforms proposed by Bayer and Crouwell’.</cite>\n\nI was referring to their proposed changes to alphabets and capitalization.\n\n"
    }
  ]
}
