{
  "id": "39904",
  "title": "Looking for the TrueType font \"Script-S\"",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello.  \nI’m looking for a font called “Script-S”.  \nIt’s a True Type font.  \nI can’t find it anywhere! No info, no nothing.  \nBut I know it exists because i’ve seen it before.\n\nAnyone know where to find it? Or at least some  \ninformation on it...\n\nThanks!  \nA\n\n [‹ \"CBS News 36\" sans from the 1960s](http://web.archive.org/web/20071212184455/http:/typophile.com/node/39919 \"Go to previous forum topic\") [NFLshop.com serif font ›](http://web.archive.org/web/20071212184455/http:/typophile.com/node/39966 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071212184455/http://typophile.com/user/24868\" title=\"View user profile.\">selectedworks</a>",
  "time": "<br>",
  "uid": "24868",
  "comments": [
    {
      "time": " 9.Dec.2007 11.50am",
      "content": "Are you sure it’s just Script-S?\n\nDo you remember what it looked like (obviously script, but what sort?)\n\n"
    },
    {
      "time": " 9.Dec.2007 12.04pm",
      "content": "[Scriptease](http://web.archive.org/web/20071212184455/http:/www.myfonts.com/search?search%5Btext%5D=scriptease) ?\n\n"
    },
    {
      "time": " 9.Dec.2007 12.15pm",
      "content": "It’s not in [this list](http://web.archive.org/web/20071212184455/http:/bowfinprintworks.com/ListPages/ScriptListS.html), so I dare to say it doesn’t exist … ;°)\n\n"
    },
    {
      "time": " 9.Dec.2007 2.45pm",
      "content": "I found this homepage where it says Script S is for free download. But it isn’t.  \nThere is a link to some kind of font library though. I’ve mailed the company to check if the font really is included in the cd, and if there is some way to buy it single.\n\nCheck the page (it also has a tiny picture of some characters from the font):\n\n[Link removed by a moderator.]\n\n"
    },
    {
      "time": " 9.Dec.2007 4.31pm",
      "content": "Selected Works, I had to remove the link to that site. They are a site which has been contacted on numerous occasions for their illegal sharing of fonts.\n\n"
    },
    {
      "time": " 10.Dec.2007 1.43am",
      "content": "ah ok...\n\nBut I got a mail from the company that said the font was included in the font-pack that is for sale on the homepage.\n\nMiss Tiffany—\\> Can they be trusted if I want to buy the font?\n\n"
    },
    {
      "time": " 10.Dec.2007 2.51pm",
      "content": "Let me say that if the font is not available anywhere else on the web (with good reputation) I wouldn’t buy anything from them myself.\n\n"
    },
    {
      "time": " 10.Dec.2007 3.31pm",
      "content": "If you can show us somthing that uses the mystery font, maybe we can tell you what its real name is, so you can get it from a legitimate source.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 10.Dec.2007 4.18pm",
      "content": "I found a copy online and it turns out to be a somewhat crude school-type script font copyrighted by Autodesk, 1996. So, selectedworks, if that sounds like your font, then it’s likely that the only legitimate source is via an Autodesk software program.\n\n"
    },
    {
      "time": " 10.Dec.2007 5.08pm",
      "content": "ScriptS is mentioned in Luc Devroye’s page [http://cg.scs.carleton.ca/~luc/autocad.html](http://web.archive.org/web/20071212184455/http:/cg.scs.carleton.ca/~luc/autocad.html \"http://cg.scs.carleton.ca/~luc/autocad.html\") where he even gives a (dead) link to a file containing the fonts. I could also find a font named ScriptS with Autodesk’s copyright. I could hardly believe it: all the contours are piecewise linear (there is no curve, only straight lines). Is that a joke like [Euroface](http://web.archive.org/web/20071212184455/http:/typophile.com/node/37359)?\n\n"
    },
    {
      "time": " 10.Dec.2007 6.34pm",
      "content": "From [Information removed by Moderator] in French, one learns that between 1999 and 2003, Autodesk was offering for free (one only had to register) a software named [Information removed by Moderator] which contained all the SHX and TTF fonts used by their Autocad software.\n\n"
    },
    {
      "time": " 10.Dec.2007 7.42pm",
      "content": "Here is a link from [Link removed by Moderator]. It seems all the fonts are still available [edit]...\n\n"
    },
    {
      "time": " 10.Dec.2007 9.30pm",
      "content": "I’ve emailed Autodesk to see if they mean for that link to be accessible by anyone. Usually those are an accident.\n\n"
    },
    {
      "time": " 11.Dec.2007 5.13am",
      "content": "\\> <cite>Usually those are an accident.</cite>\n\nGood thing to check. Given the fact that the ftp link [Link removed by Moderator] leads exactly there, I had taken for granted this was no accident.\n\n"
    },
    {
      "time": " 11.Dec.2007 7.29am",
      "content": "<cite>I’ve emailed Autodesk to see if they mean for that link to be accessible by anyone. Usually those are an accident.</cite>\n\nActually, the downloads are in an FTP <cite>pub</cite> folder, with multiple links within that folder as well, and a mirror to boot. It’s extremely unlikely that this was done accidentally.\n\n"
    },
    {
      "time": " 11.Dec.2007 9.14am",
      "content": "When CS2 was released the bonus font URL was made public. It was an accident. This looks like it is part of an older structure that is why I felt the need to ask. I’m very wary of people downloading old software just to get to a font when there are so many other fonts available for license. Is it really worth all of the trouble? Are we getting access to quality fonts by doing so?\n\nHmm. That is supposed to sound like a rant. ;^D\n\n"
    },
    {
      "time": " 11.Dec.2007 3.05pm",
      "content": "Ok, things moving here i see!  \nNice for yall to help!\n\nMichel Boyer —\\> Did you have a chance to download this?? Because I use macintosh, and the files was in .exe.  \nIf anyone could download this and then maybe mail me the Script S font (if it’s actually for free) I would be really grateful! It would help me alot...  \nThanks!\n\n"
    },
    {
      "time": " 11.Dec.2007 3.28pm",
      "content": "\\> <cite>Did you have a chance to download this</cite>\n\nYes, without any difficulty, from one of the zip files. Some of the fonts there are very clearly not free fonts and, in my opinion, the above site should not be accessible. As for the font ScriptS, given the circumstances, I will wait till Tiffany gets an answer about it.\n\nMichel\n\n"
    }
  ]
}
