{
  "id": "39913",
  "title": "Why is it so common for typefaces to include small caps in only one weight, such as regular/medium?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I suppose in some cases, the combination of heavy bold weights and the reduced proportions of small caps might just be too much to be legiable, but Minion appears to have small caps in every weight.\n\nAny particular reason? I can't imagine it's got anything to do with the work involved, since I've seen this phenomenon in typefaces with otherwise massive, sprawling character sets.\n\n",
  "author": "amv",
  "time": "9 Dec 2007 — 2:56pm",
  "uid": "23823",
  "comments": [
    {
      "time": "9 Dec 2007 — 4:16pm",
      "content": "There just aren't that many reasons to use small caps in bold (or italic, for that matter). Small caps aren't a simple reduction of cap size, so there is real development required, and every new glyph adds more time to the overall production effort (spacing, mastering, display).\n\nMost foundries believe that the most important glyph sets should be completed and released first, and if there is sufficient demand, the family can expand.\n\n"
    },
    {
      "time": "9 Dec 2007 — 5:34pm",
      "content": "I don't think it's so much the extra work as the fact that, traditionally, small caps were only included in the regular weight of a font. So, including them in the italic or bold styles simply doesn't have a lot of precedent. Personally, I don't see any reason not to include them, although they they don't get used much (yet).\n\n"
    },
    {
      "time": "9 Dec 2007 — 6:54pm",
      "content": "_I don’t see any reason not to include them_\n\nbesides all the hard work, mark? \\>^p\n\n"
    },
    {
      "time": "9 Dec 2007 — 7:29pm",
      "content": "I think the newer typefaces are more likely to include smallcaps in all the weights. Book faces dones in the last 5 years, mostly the OpenType fonts done in the past 4 years, are better candidates for full inclusion than older faces.  \nThere is a good bit of work involved if you consider diacritics and kerning. The downside is that the time to market gets drawn out doing all the extra work and the profit difference is small.  \nHere I sit doing smallcaps in bold, italic, and bold italic when I could be out on the town living the high life instead :-)\n\nChrisL\n\n"
    },
    {
      "time": "9 Dec 2007 — 7:31pm",
      "content": "I think it is the hard work. But Linotype used to cut them for a few fonts -- the comp shops always hoped customer didn't know about them -- they usually had to be inserted & distributed by hand; more hard work.\n\nActually, nowadays, with run-in citations as opposed to true footnotes, there is probably more of a need for them, for abbreviating titles.\n\n"
    },
    {
      "time": "9 Dec 2007 — 8:50pm",
      "content": "The reason for setting something in small caps could also play a role in why only the regular/medium/book weight gets the treatment. It seems to me that Bringhurst has a bit to say about that, along the lines of Mark's comment about tradition.\n\nBefore italics were matched to roman, small caps were used for contrast in a text setting, right?\n\n"
    },
    {
      "time": "9 Dec 2007 — 9:22pm",
      "content": "Sometimes you like a typeface's roman weight, but aren't so hot on the italic. The small caps present a nice alternative for when emphasis is required. I often do this for the bibliography section of an academic article; the journal or book title is set in small caps instead of italics. For example, I always do this with Times, since I despise Times' italic weights.\n\nI can't think of much use for bolder weights of small caps other than the occasional titling application, and even then, I am more likely to use all-caps for titling.\n\n"
    },
    {
      "time": "9 Dec 2007 — 9:24pm",
      "content": "The rules are there, sure, but I've seen small caps used for display work, including packaging and such. It seems to me even if a type designer wouldn't dream of their font being used in a certain way they sure are limiting their options by not doing so.\n\n"
    },
    {
      "time": "10 Dec 2007 — 1:43am",
      "content": "Why? Tradition.  \nThe vast majority of classic typefaces (and especially [families](http://web.archive.org/web/20130219095644/http:/typophile.com/wiki/family) has been made for body text, often as in books.  \nThis is related to [this issue](http://web.archive.org/web/20130219095644/http:/www.typophile.com/node/38645), why certain faces don’t have a bold and/or a bold italic.\n\nWhy don’t Helvetica, AG etc. have small caps and osf? Because that would look totally out of place, in a historic sense. Same goes for those whimsical small caps in an already inherently odd extra bold garalde, and even the most traditional italic serif face, yet in regular weight, starts to scream ‘pomo!’ when set in small caps, imho.\n\nI don’t say it’s not nice to have them (i.e. black or italic sc) for _some_ cases, but you don’t need them very often, at least when you’re doing rather traditional things like books or scientific publications.\n\n"
    },
    {
      "time": "10 Dec 2007 — 6:38am",
      "content": "I like to have a few faces around that carry italic smalls, even semibold italic smalls.\n\nEach year a couple of projects come along that require them, and I can start those projects knowing this need can be filled.\n\nMore of a trouble is the book that, in ms, seems not to need them, so is specified in a face that does not have them. Then at first page proofs, author or editor decides to make an edit that then requires italic smalls. Perhaps this is an addition that (had it been set all roman) would have used roman smalls, but because the entire addition is ital, requires maybe one word in italic smalls.\n\nFor most book faces in our repertoire, I find I can fiddle Minion or Miller italic smalls to get a fairly decent match. But it is a patch, and thus not fully satisfactory.\n\npowers\n\n"
    }
  ]
}
