{
  "id": "39917",
  "title": "the Mc in Irish and Scotish names",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "is there a rule of thumb for placing the c?\n\n",
  "author": "russellm",
  "time": "9 Dec 2007 — 4:57pm",
  "uid": "13076",
  "comments": [
    {
      "time": "9 Dec 2007 — 6:11pm",
      "content": "I don't believe there is.\n\nThe Mc is a bastardization of Mac, which means \"son of\", similar to the \"-sen\" or \"-son\" in scandanavian names: Mac Donald means \"son of Donald\".\n\nThe superscript 'c' is just a design thing, I believe. It looks kinda cool, especially in classic fonts (by which I n00bishly mean the fonts popular about when the superscript 'c' was popular; the 1920s-1950sish).\n\nProperly, the Mc should be a Mac, and should have a space in between it and the following bit. Also, the Irish Mac's are probably Northern Irish, who are Scots who were resettled in Northern Ireland by (I believe) James I to spread protestantism through the Empire. [/history lesson]\n\n"
    },
    {
      "time": "10 Dec 2007 — 7:30am",
      "content": "_is there a rule of thumb for placing the c?_\n\nYes, as normal :-)\n\nUnless, as mentioned, you're aiming for specific design aesthetic.\n\n"
    },
    {
      "time": "10 Dec 2007 — 8:36am",
      "content": "Well, to get it to look correct to my eye, I set the 'c' at about 66% of the x-height and align the top with the cap height. Was or is there a special character for this? As far as I know it has alway been a superscribed character when hand written.\n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcgo_6622.jpg)\n\n& :¬\\ thanks for informing me my last name has been misspelled all these hundreds of years, typographic n00b13. :¬D\n\n-=®=-\n\n"
    },
    {
      "time": "10 Dec 2007 — 8:39am",
      "content": "Fitz- also means son of. I know a guy named FitzGerald who's adamant about capitalizing the G in Gerald, because if it were lower case it would mean he's illegitimate. I've not heard the same thing about Mc-, though.\n\n"
    },
    {
      "time": "10 Dec 2007 — 10:28am",
      "content": "If you want a fuller history lesson, the original Scots were from Ireland. An Irish tribe known as the Scoti moved across the strait and pushed back the Picts who already lived there, and the two groups pretty much assimulated to form the highland scots. The lowland scots are tainted by quite a bit of English blood.\n\n"
    },
    {
      "time": "10 Dec 2007 — 10:43am",
      "content": "Don.\n\nTo her dieing day, my Irish grandmother insisted our family and our Irish ancestors were really Scottish.\n\n:¬_)_\n\n-=®=-\n\n"
    },
    {
      "time": "23 Dec 2007 — 5:50am",
      "content": "The anglicised forms of Irish surnames can have either 'Mc' or 'Mac'; the anglicised forms of Scottish surnames only have 'Mac'.\n\nThe use of a superscript 'c' in 'Mc' is somewhat old-fashioned, an ordinary 'c' being more usual these days. From the 18th century to the early 20th century an 'open single quote' was commonly used instead of a 'c'.\n\nIn the original languages, Irish continues to use two words whereas Gaelic writes surnames as a single word.\n\nTo summarise:  \nIrish 'Mac Néill' can be anglicised as either 'McNeill' or 'MacNeill'  \nGaelic 'MacNèill' is invariably anglicised as 'MacNeill'\n\n"
    },
    {
      "time": "23 Dec 2007 — 12:38pm",
      "content": "I recently did some work for an author/publisher who required that the superscript c have a small line underneath it. Scottish descent. Don't know if this is correct in terms of whether that was usually reserved for handwriting as opposed to type, but it looked quite cool.\n\nGerald\n\n"
    },
    {
      "time": "28 Dec 2007 — 7:36am",
      "content": "So, I never knew this, then MacPaint, means \"Son of Paint?\n\n"
    },
    {
      "time": "17 Jan 2009 — 8:05pm",
      "content": "Here are some examples of the way \"Mc/Mac\"-prefixed surnames have been set in type. These examples are from Justin McCarthy, ed., et al <cite>Irish Literature</cite> (John D. Morris & Company, Philadelphia, 1904). I extracted the images from the digitalized version on the Internet Archive. Vol 1 can be found [here](http://web.archive.org/web/20150416042940/http:/www.archive.org/details/irishliterature01mccauoft).\n\n1. This is from the Title Page (the same in all volumes). The actual size is about 1.4 inches (and the following images are scaled to maintain the correct relative size with this one).  \n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_irish_lit_titlpg_5026.gif)\n2. From Vol 3, page v (which lists the Editorial Board);  \n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_irish_lit_edpage_6284.gif)\n3. From Vol 1, page xvi (after his article on Irish Literature):  \n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_irish_lit_sig_6589.gif)\n4. From Vol 1, page xxi (in the body of a \"special article\"):  \n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_irish_lit_bodytext_4345.gif)\n5. From Vol 6, Table of Contents (selected \"Mc/Mac\"-prefixed surnames):  \n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_irish_lit_toc_3662.gif)\n  \n Evidently, the different forms are not interchangeable, even if they are essentially the same, and some people must prefer that their names be set one way or the other. \n\nSince I am new, please let me know if this is not sufficiently interesting and/or it should be posted elsewhere. I have more examples. I am not an expert on this topic. But I have recently been looking around to see how these surnames are written and set in type and wanted to share.\n\n"
    },
    {
      "time": "17 Jan 2009 — 10:17pm",
      "content": "More examples...\n\n1. Here the \"c\" is above the caps line. This is the title page from McCarthy, Justin, <cite>The Epoch of Reform</cite> (London: Longmans, Green, and Co. 1882. Printed by Spottiswoode and Co.)  \n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_epoch_reform_title_3952.gif)\n2. This is from the series title page of the very same book. In this instance the \"c\" is between the caps line and the baseline.  \n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_epoch_reform_seriestitle_6328.gif)\n3. In the following two, the \"c\" is small and between the caps line and the baseline.  \n(from the title page and the page prior of <cite>Ballads, Poems, and Lyrics, Original and Translated</cite> by Denis Florence MιCarthy (Dublin: James McGlashan, 1850).  \nThis was taken from the Google Books digitalization, which is why the resolution is poor.  \n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_ballads_mcglashan_1_5779.gif)\n  \n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_ballads_mcglashan_2_6625.gif)\n4. My previous post shows examples where the \"c\" is relatively big and on the base line.\n\n"
    },
    {
      "time": "18 Jan 2009 — 7:03am",
      "content": "Signage examples: These two are from old family storefront photographs. The stores were in Greenoch, Scotland. I don't know the precise date, but I am guessing around 1900 to 1920. Magnus was the father, so his sign was probably older than Peter's.\n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_mccuaig_peter_6454.jpg)\n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_mccuaig_magnus_5705.jpg)\n\nNote that the \"c\" is raised with two vertical dots underneath.\n\nBrian\n\n"
    },
    {
      "time": "18 Jan 2009 — 7:33am",
      "content": "Russ,  \nIf you want to use a superscript \"c\", choose a font which has one instead of scaling the lowercase c. The scaled c looks too anemic.\n\nChrisL\n\n"
    },
    {
      "time": "18 Jan 2009 — 8:08am",
      "content": "With respect to item 5 in my first post above, I believe it is more common to see the apostrophe facing the other way:\n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_mcculloch_princ_titlepg_5003.gif)\n\nrather than\n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_irish_lit_mcgee_4944.gif)\n\nThe first example is from the title page of McCulloch, J. R, <cite>Principles of Political Economy</cite>, 4th ed. (Edinburgh: Adam and Charles Black, and Longman, Brown, Green, and Longmans, London, 1849; Printed by William Blackwood and Sons, Edinburgh), extracted from the digitalized copy in the Internet Archive [here](http://web.archive.org/web/20150416042940/http:/www.archive.org/details/4edprinciplesofp00mccuuoft). McCulloch's book was one of the standard political economy textbooks of the 19th century.\n\n"
    },
    {
      "time": "18 Jan 2009 — 9:12am",
      "content": "From Beadnell, Henry, <cite>Guide to Typography</cite> (London: F. Bowering; Adams and Gee, printers, publication date unkown) Part 1, pg 172 . It is in the Internet Archive [here](http://web.archive.org/web/20150416042940/http:/www.archive.org/details/guidetotypograph00beadrich). The internet archive gives the publication date as 1859--61, noting that the exact date is unknown.\n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/mcfann_from_beadnell_3715.jpg)\n\nBrian\n\n"
    },
    {
      "time": "18 Jan 2009 — 5:04pm",
      "content": "That last text uses exactly the right font to suggest that the form M`Dougall was a printer's kluge for not having the correct sort to produce MᶜDougall.\n\n—Joel (ᴀʙᴜsɪɴɢ ᴜɴɪᴄᴏᴅᴇ ʙᴇᴄᴀᴜsᴇ ɪ ᴄᴀɴ)\n\n"
    },
    {
      "time": "20 May 2009 — 12:05am",
      "content": "From the cover of <cite>Mr. Bingle</cite> by George Barr McCutcheon (published by A.L. Burt Company, New York, by arrangement with Dodd, Mead and Company, 1915).\n\n ![](http://web.archive.org/web/20150416042940im_/http:/typophile.com/files/Mr%20Bingle_6002.jpg)\n\n"
    },
    {
      "time": "20 May 2009 — 12:57pm",
      "content": "So clearly there is not an exact rule. Do whatever that looks aesthetically pleasing. We all hate rules.\n\n"
    },
    {
      "time": "18 Jun 2009 — 6:43pm",
      "content": " Something I've noticed on street signs: The `c' is often lower-cased in otherwise all-caps settings; _e.g._, \"McDONALD\".  \n—Joel\n\n"
    },
    {
      "time": "18 Jun 2009 — 10:42pm",
      "content": "_The ‘c’ is often lower-cased in otherwise all-caps settings_\n\nWith good reason. If they don't do that, you might not know to pronounce the \"MC\" as \"Mac\"... For example, in the new movie \"Terminator Salvation,\" the opening credits are in all caps, so the last credit reads:\n\n**DIRECTED BY MCG**\n\nIf I didn't happen to know that the guy goes by \"McG,\" I could think that \"MCG\" is a very strange-sounding name, or the man's initials!\n\n[EDIT] I found a review that mentions the all-caps name: [\"The director is Charlie's Angels hack McG – or MCG as the opening titles print it, making him look like a corporation or a software programme, and he might as well be either.\"](http://web.archive.org/web/20150416042940/http:/www.independent.co.uk/arts-entertainment/films/reviews/terminator-salvation-mcg-115-mins-cert-12a-1698492.html)\n\n"
    },
    {
      "time": "18 Jun 2009 — 11:22pm",
      "content": "Yep, Ricardo. A world of difference betwwen Bobby McG, and the holy of holies, the [Melbourne Cricket Ground](http://web.archive.org/web/20150416042940/http:/www.mcg.org.au/).\n\n"
    },
    {
      "time": "19 Jun 2009 — 6:45pm",
      "content": "Thanks for the Kris Kristofferson reference, paragraph (Bobby McGee)! Although, truthfully, I've only heard Janis Joplin's cover version. And very recently, Gordon Lightfoot's.\n\nSadly, I've never been to Melbourne.\n\n"
    },
    {
      "time": "19 Jun 2009 — 11:31pm",
      "content": "The Grateful Dead live recording of Me and Bobby McGee (\"Skull & Roses\", 1971) is pretty good.\n\n"
    },
    {
      "time": "20 Jun 2009 — 9:41am",
      "content": "Thanks for reminding me, Nick! I have been trying to remember that version for a while!\n\nChrisL\n\n"
    },
    {
      "time": "20 Jun 2009 — 3:34pm",
      "content": "Chis,<cite>If you want to use a superscript “c”, choose a font which has one instead of scaling the lowercase c. The scaled c looks too anemic.</cite>\n\nChrisL\n\nWhen I do, I useually end up re-drawing a \"C\" to make it work.\n\nMy reason for asking was to do with making my own fonts though.\n\nCreativemilk <cite>So clearly there is not an exact rule. Do whatever that looks aesthetically pleasing. We all hate rules.</cite>\n\nNot me. I love rules. Can't be a rebel without rules to break! :o)\n\n-=®=-\n\n"
    },
    {
      "time": "21 Jun 2009 — 4:00pm",
      "content": "Hi, Russ!\n\nThe reduced \"c\" set high in position is typically an ordinal in Opentype fonts which have that feature. Usually, it is positioned as if there were ascenders in the line so it might drop a tad from where you show it. Truth is, it is a matter of taste. I wish I had a nice iron-clad rule for you to break but, alas, there is none that I know of :-)\n\nChrisL\n\n"
    },
    {
      "time": "21 Jun 2009 — 6:43pm",
      "content": "dezcom: we can always just set the rules thus:\n\nRule 1: \"The c in Mc shall be raised\"  \nRule 2: \"It shall be aligned with the top of the capital M\"  \nRule 3: \"It shall be 66% the size of a normal c\"  \nRule 4: \"It shall be optically scaled\"  \nRule 5: \"It shall have an underline\"\n\nNow we have not just one rule, but five rules to break :) (arbitrary rules are the easiest ones to be a rebel with)\n\n"
    },
    {
      "time": "21 Jun 2009 — 8:05pm",
      "content": ":-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Jun 2009 — 4:45am",
      "content": "Thought I'd share this recent \"son of\" story: I was sitting at a baseball game a few weeks back, with my lawyer, who's Jewish, and when he announced he was a new grandfather I congratulated him and asked the baby's name, which he said was Bennet.\n\nSo, as a result of this thread, I asked if the lucky couple met online. ;)\n\nCheers!\n\n"
    },
    {
      "time": "11 Nov 2012 — 5:31pm",
      "content": "Hi russellm,\n\nYou are absolutely correct! You may not be able to find the font, but there is a very good reason for where and how the \"c\" is placed in McGee.\n\nI have never been able to find this font. However, as a child, my father taught me to sign my last name McGee with a superscript \"c\" along with 2 vertical lines beneath as though the \"c\" is sitting just above an \"11\".\n\nHe explained to me that it was very important to do this because it is specific to our family line.\n\nLater in life, while researching my family genealogy, I looked into trying to understand what my father meant when he said it was important to \"our family line\".\n\nWhat I have found is this:  \nKing James I did dangle the proverbial potato (free farm land in Ireland if you will just leave my country and get off my back) in front of the Scots who were starving at the time, which led to the Scots-Irish or Black-Irish relocating to Ireland. I do not believe that was the beginning of the use of the superscript \"c\" in surnames like McGee. Most of the people who were not of \"Nobility\" were essentially illiterate by todays standards.\n\nWhat I have found though is that during the Irish Immigration to America, (I will use just the surname McGee for this example) Not all families could immigrate at the same time, or on the same ships. There were McGee family groups from many different areas. The thought of being forever separated from their immediate family was frightening. Each McGee family group adopted a simple symbolic way for separated families to reconnect after immigration. They altered the way they spelled their last name. Many used the superscript \"c\" alone or in combination with other markings underneath it.\n\nMy theory about why we do not find these variations in fonts is that the use of them served a very specific purpose, for a relatively brief period of time. Most examples show up in 'handwritten' names, very few in 'type set'.\n\nYou may be aware that many years of Irish to America Immigration Records were lost due to a fire in the warehouse used to store them. This makes it all the more challenging for those of us with Scot-Irish and Irish heritage to connect the dots to our Irish ancestors.\n\nI like to think that our Irish ancestors were very wise in using this clever way of reconnecting with their family members in America because in doing so, they have left us a few \"bread crumbs\" to help us find our way back to them.\n\nAll the Best!  \nRobert Harbin-McGee\n\n"
    },
    {
      "time": "11 Nov 2012 — 5:32pm",
      "content": "LOL!\n\n"
    },
    {
      "time": "11 Nov 2012 — 5:56pm",
      "content": "Sounds like a job for Unicode.\n\nhhp\n\n"
    },
    {
      "time": "13 Nov 2012 — 9:48am",
      "content": "A single left quote mark (i.e. rotated comma) was sometimes used to represent the superior /c in “Mc-” names, in the days of foundry type.\n\n"
    },
    {
      "time": "13 Nov 2012 — 1:58pm",
      "content": "\\> a job for Unicode.\n\nJobs, as far as I can tell, are usually left to others by Unicode.  \n;-)\n\n"
    },
    {
      "time": "13 Nov 2012 — 8:36pm",
      "content": "Well, a few years down the road...  \n [  \nOf the 8 faces I’ve published to date](http://web.archive.org/web/20150416042940/http:/www.myfonts.com/foundry/Our_House_Graphics/), 4 have ‘Mc’ has a discretionary ligature.  \nThe one I am working on at the moment will have the raised ‘c’ available as part of the dlig or as a c.sups.\n\n"
    },
    {
      "time": "14 Nov 2012 — 12:40pm",
      "content": "I usually include the c.sups in my Ordinal feature.\n\n"
    },
    {
      "time": "14 Nov 2012 — 1:13pm",
      "content": "Only to substitute after M?\n\n"
    },
    {
      "time": "14 Nov 2012 — 5:08pm",
      "content": "<cite>... c.sups in my Ordinal feature.</cite>\n\nI haven't actually done it yet so I only half know what I'm talking about, Chris. The intention is there and I will figure it out.\n\n:o)\n\nOn a bigger picture note, I have absolutely no evidence it's a selling point to ad 'Mc'.\n\n"
    },
    {
      "time": "9 Mar 2013 — 12:13am",
      "content": "Although these days Mc with the raised and underlined c is a stylistic choice, it was originally the same type of abbreviation as Wm and Thos, both of which you may have seen with the raised and underlined last letter. The letter was raised and underlined as a convention to show that letters had been omitted. It was done by clerks and scribes to save time and ink. We don't think of ink as a precious substance these days, but if you had to make your own, and the process included wetting crushing oak galls to make tannic acid and making iron sulfate, you'd want to conserve your supply, I'm sure. In the case of Mc, the a has been omitted. I can see Wm, you save illia, which is a substantial amount of ink, but I don't see the benefit in trading the a for an underline. I suppose you have to view it as an incremental savings that adds up over time.\n\nI am not a typographer per se, and I learned this while studying old (and Olde) English handwriting pursuant to deciphering written records while transcribing them for genealogical use. I stumbled across this discussion while trying to find the rule for \"space or no space\" in McNames. I believe that over 90% have no space, but I can't find any source or authority to back it up.\n\nI found Robert Harbin-McGee's story about his dad teaching him to write the family name really fascinating.\n\n"
    },
    {
      "time": "27 Feb 2014 — 11:48am",
      "content": "I'm a Cartographer, I'm in an ALL CAPS font, where there does not exist, a lower case letter, yet tradituon here has it that the \"c\" in McDONALD, for example, is to be displayed as lowercase.  \nMs Cheri Ross of a local university, English department opined, \"the c should enjoy no special privelege over the other lowercase letters in the name to be lowercase.  \nI agree, I believe the significant factor isn  \n't that the c be lowercase rather that the D be uppercase as was mentioned above, it represents the proper family name, LaFrance, DeSendi, McKean, MacArthur.  \nOpinion?\n\n"
    }
  ]
}
