{
  "id": "3992",
  "title": "Uniqueness of pixel fonts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm about to start a little personnal pixel font project and I cannot help but wonder:   \n   \nBecause of their nature, how can one make sure their pixel font hasn't already been done by someone else (even if they start from scratch)?   \n   \nOnly talking about small sizes that is.   \n   \nAnd if it has been already created,   \n   \n-What happens if both people can prove they initially created it from scratch?   \n   \n-Does the earlier one prevail?   \n   \n-Is there other ways of telling them apart (is one supposed to design bigger sizes included with it so we can distinguish them?)   \n   \n-Or, in a more drastic manner, should we keep ourselves from designing things that are very \"standard\" to make sure each is different?   \n   \nFeel free to add of your own.\n\n",
  "author": "emilie",
  "time": "28 Mar 2004 — 11:25am",
  "uid": "2485",
  "comments": [
    {
      "time": "28 Mar 2004 — 7:42pm",
      "content": "This is a very interesting topic indeed, with many facets to it.   \nI think the key is to be both pragmatic and honest.   \n   \nYou can't know if somebody has already made what you're making (although asking on Typophile is a pretty solid method of finding out). But that doesn't mean it's worth going on with your design or not! As long as you don't consciously copy somebody without credit, you're morally safe. But that doesn't mean it won't be a waste of time! On the other hand, the action of making something yourself has its own rewards.   \n   \nFor smaller sizes, chances are in fact that something 95% similar has already been done. Does it matter if it was done before? Not really. As long as you don't pretend yours was earlier.   \n   \nLarger sizes: I don't think that's significant (because WYSIWYG is illusionary anyway), except maybe if the other font also has a large size (that's different than yours) - but even then it might be moot.   \n   \nHere's a real cruncher: Should you consciously AVOID finding out if your design has already been done?! Maybe yes. Because if you start something then find something extant that's very similar you will be tempted (if you're an honest person) to intentionally make yours different in some hoaky way! :-/ And that's bad design.   \n   \nIf you're sincerely worried, you might consider going with grayscale pixelfont design, where the chances for conflict are much less.   \n   \nSo in some ways it's good not to pay too much attention to what others are doing. Personally for me this is a tug-of war: I relish knowing what's out there, but I'm also too full of myself to draw too much inspiration from what I do see! I can be very negative and over-confident, always seeing ways that I can do something so much better, often in a totally different way. But in practice I hit many of the same obstacles everybody else does. I think that's OK because my constant critique of what I see keeps people (including me) always on their toes and looking ahead.   \n   \nIn the case of my Mana (a grayscale font), I started the 16-pixel version 6 years ago, and now that it's released I don't see anything similar (and it's hard to imagine something similar that's not consciously copied). But I've been working on the 13 for about 2 years now, and recently I realized it's somewhat close to Arial (at 13 PPEM)! Does it matter? Morally, no, because I didn't look at Arial when I was making it - I made it by carrying over as much of the essence of the 16 that I could, without violating the essence of the 13 pixel constraint, so to speak. But it would very much matter practically, because nobody would buy it... except that it's grayscale!   \n   \nhhp\n\n"
    },
    {
      "time": "28 Mar 2004 — 8:58pm",
      "content": "I don't really pay a lot of attention to other stuff so I think I'm \"clean\" on that matter. =)   \n   \nI really meant to create it as a total improvisation, something small that I can do quickly just to get the basics down for creating pixel fonts. Then I'll move to something more complicated.   \n   \nCan you develop on the grayscale topic? By this, do you mean creating some kind of anti-aliasing? I can really see how this would open possibilities to make something different, even if small.\n\n"
    },
    {
      "time": "29 Mar 2004 — 9:36am",
      "content": "Grayscale bitmaps are simply\\* bitmap fonts that use shades of gray instead of just black and white, the point being that a careful\\*\\* application of gray pixels can deliver greater fidelity and readability (while being careful not to introduce too much fuzz). On the surface you can just \"paint\" your grayscale fonts in something like Photoshop, but when it comes to deliver them as robust fonts, you don't have the same luxury as with 1-bit fonts in terms of delivering them as \"true\" bitmap fonts (for example by embedding them in TT fonts for Windows), you have to make pixelfonts (like you're doing anyway). The difference is that pixelfonts are outline fonts, but ones that only \"click\" for one point size. The tricky thing with grayscale pixelfonts is that the way you place _partial_ pixels is technically challenging, in terms of ensuring correct rendering in both platforms and various apps. The other negative is that they look lousy when set large (unlike 1-bit pixelfonts, which can look cute, if not very versatile).   \n   \n\\* Actually, the availability of gray makes the creation of such fonts a very different exercise - so the difference really isn't \"simple\" at all.   \n   \n\\*\\* Careful being what automatic-from-outline rendering algorithms are NOT. That's why it needs to be done by hand (for sizes below about 22 pixels).   \n   \nYou can look at [http://www.ultrafonts.com](http://web.archive.org/web/20131013130920/http:/www.ultrafonts.com/) to see grayscale pixelfonts in action.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Mar 2004 — 8:11pm",
      "content": "Hrant, thanks for the info!   \nI think I'll start without the gray pixels ;)   \n   \nWhat about the kerning of pixel fonts?   \nI've done it in fontographer before using standard outlines. Next time I'm planning to switch to FontLab.   \n   \nDo you need to do your kerning in pixels as well so that it will snap? Also, do you know if it's possible to have some glyphs overlapping on each other? (example, a long \"tail\" on the Q like in Baskerville.) God, I need to learn these english typographic terms =)\n\n"
    },
    {
      "time": "30 Mar 2004 — 9:23pm",
      "content": "Kerning: yes, you can (and should) do kerning - and like you suspect it just has to be defined in \"whole units\". For example if your Em is 8 pixels high the kern values would be mutiples of 125 (+/-). In practice, few people kern pixelfonts though.   \n   \nOverlapping: In a \"true\" bitmap font you might have trouble defining pixels outside of the bounding-box (I think it depends on the format), but in a pixelfont it's not an issue, since it's basically an outline font. But you don't often have to do it; in Mana-16 for example only the Florin and Ordfeminine do it - although the cap accents do extend over the top of the Em.   \n   \nBTW, the old metal term for \"overlapping\" - or actually just a part of a letter projecting beyond its sidebearings- was \"kern\"!   \n   \nhhp\n\n"
    }
  ]
}
