{
  "id": "39945",
  "title": "I need your help for a font survey ^^",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everybody here,\n\nCurrently I am doing my thesis with the the font perception and human feelings.  \nI need to collect more opinions to get some conclusions.  \nThe .pdf file attached is about examples of 30 fonts and the word file is the  \nsurevy to be completed.\n\nIf you are interested in this area, pls help me to finish this survey and send  \nthe saved word file to my email: [lyliying@gmail.com](mailto:lyliying@gmail.com).\n\nThank you very much and hope to get your feedback soon!\n\nYing\n\n| Attachment | Size |\n| --- | --- |\n| [Perception of Fonts\\_30\\_font\\_F.pdf](http://web.archive.org/web/20071211201144/http:/typophile.com/files/Perception%20of%20Fonts_30_font_F_0.pdf) | 566.39 KB |\n| [Survery\\_table.doc](http://web.archive.org/web/20071211201144/http:/typophile.com/files/Survery_table_0.doc) | 542.5 KB |\n\n [‹ whats this font](http://web.archive.org/web/20071211201144/http:/typophile.com/node/39947 \"Go to previous forum topic\") [Chris Ware and Hollywood ›](http://web.archive.org/web/20071211201144/http:/typophile.com/node/39946 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071211201144/http://typophile.com/user/22794\" title=\"View user profile.\">S_watch</a>",
  "time": "<br>",
  "uid": "22794",
  "comments": [
    {
      "time": " 10.Dec.2007 1.42pm",
      "content": "Please don’t post into multiple forums. Also, consider putting your survey into an online survey tool like surveymonkey. You’ll get a lot more responses.\n\n"
    },
    {
      "time": " 10.Dec.2007 3.22pm",
      "content": "I am doing a similar idea for my dissertation, I found that their are too many assumptions on typefaces, everyone has a different opinion and is hard to show a positive outcome on the feeling of the typeface.  \nThere seems to many surveys and research of typefaces and their persona, Eva Brumburger to name but one.\n\ncompanies use Helvectica like Orange, American Airlines, Natwest, Panasonic, Jeep, iPhone, and 3M, from my research i found out that this font communicates:\n\nStraight Forward and no-nonsense, stability, Safe, Serious, a quote from the BBC:\n\n“Helvetica’s message is this: you are going to get to your destination on time; your plane will not crash; your money is safe in our vault; we will not break the package; the paperwork has been filled in; everything is going to be OK.\n\nTo me it seems boring, plain, no character or personality, just like everyone else.\n\nI felt no matter how much research i done, i could never really change anything, but instead add to the debate and discussion.\n\nWe describe the appearance of type in a very humanistic way, almost like how we describe people, just from how they look. This took my idea further.\n\nI decided if we could see more character within the typeface if we looked at certain individual characters from within. My results suggested that if we look at the components of each letter in more depth, we revile more answers, we begin to see their individual detail that we may of missed if they were arranged with other letters.\n\nI asked what human characteristics do these type characters have, and my results started to come back with actual human descriptions. Describing letters as people just from their form. The audience began to take notice of their individual components such their serifs, ascenders, descenders, loops, ears, counter, weight and overall shape much more.\n\nI am now in the process of creating a story with human characters being represented by letters! it seems a fun idea, and something that hasn’t really been explored!!\n\nI created a online questionnaire, and believe me i agree with Aluminium, people don’t like hassle, so make it easier for them. it really does help.\n\ncheck it out if you like:\n\n[http://www.woodymedia.co.uk/uni/crabby/typequestionnaire.htm](http://web.archive.org/web/20071211201144/http:/www.woodymedia.co.uk/uni/crabby/typequestionnaire.htm)\n\n"
    }
  ]
}
