{
  "id": "3996",
  "title": "Please help me with this Titleist logo.",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "![your_file_name.gif](http://web.archive.org/web/20140307083446im_/http:/www.typophile.com/forums/messages/83/3222.gif)   \nAny idea what this is or what it closely resembles. Any and all help would be greatly appreciated.   \nThx\n\n",
  "author": "anonymous",
  "time": "6 Dec 2002 — 8:49pm",
  "uid": "1203",
  "comments": [
    {
      "time": "7 Dec 2002 — 9:12am",
      "content": "Sorry about that sarcastic last phrase: I've always wanted to say something straight out of an all-American action movie ;-P Let me know if you find something.\n\n"
    },
    {
      "time": "7 Dec 2002 — 12:59pm",
      "content": "Better yet, grab a [Speedball](http://web.archive.org/web/20140307083446/http:/www.antiquesetc.net/misc/images/o067.jpg) pen with   \na \"B\" or \"D\" nib and draw your own.   \n [Here's a lovely instructional PDF](http://web.archive.org/web/20140307083446/http:/www.speedballart.com/letteringcharts.pdf).\n\n"
    },
    {
      "time": "7 Dec 2002 — 1:53pm",
      "content": "Scoles, you sure got some delightful stuff in your stash. Kewl.\n\n"
    },
    {
      "time": "7 Dec 2002 — 2:18pm",
      "content": "Thanks, Yves. It's the result of obsessive anti-social   \ninternet use. Now ask me if I have any friends.\n\n"
    },
    {
      "time": "7 Dec 2002 — 5:18pm",
      "content": "do you have any friends?\n\n"
    },
    {
      "time": "7 Dec 2002 — 5:49pm",
      "content": "besides the chicken.\n\n"
    },
    {
      "time": "7 Dec 2002 — 5:54pm",
      "content": "Damn. That was going to be my answer.\n\n"
    },
    {
      "time": "8 Dec 2002 — 1:30am",
      "content": "LOL   \n   \nYou guys are funny.   \n   \nBTW Scoles are ye British or American (if you don't mind me asking I do hope I'm not offending anyone)\n\n"
    },
    {
      "time": "8 Dec 2002 — 10:00am",
      "content": "You are very much insulting all Brits or Americans, depending on which one Stephen is. ;-)   \n   \nBTW, please do try to humor the Canadians by pretending they're distinct from Americans and mentioning them too, especially since you're doing that favor for the Brits (Tony Blair being the \\*real\\* VP of the US of A).   \n   \nhhp\n\n"
    },
    {
      "time": "8 Dec 2002 — 1:45pm",
      "content": "I could make that logo in Illustrator in about 20 minutes.   \n   \nGot budget?   \n   \n:D\n\n"
    },
    {
      "time": "8 Dec 2002 — 4:33pm",
      "content": "Stuart:   \nI think it's even possible to make a complete font in less than a week starting from that logo.   \n   \nGot time?   \n   \n;-P   \n   \nHrant & Scoles:   \nI asked this because I've been playing music with Brits for the last 10 years or so (re: my comment of September 23, 2002 03:01 AM on the post [Recently Released](http://web.archive.org/web/20140307083446/http:/typographi.ca/cgi-bin/mt-comments.cgi?entry_id=333) at Typographi.ca). I've kinda grown to appreciate their typical sense of humor, which I thought I recognized in some of the postings. (The only thing I absolutely loathe is that they're persuaded that British humor is so incredibly superior. As if they've got world exclusivity at being funny. No kidding!)\n\n"
    },
    {
      "time": "8 Dec 2002 — 9:16pm",
      "content": "Actually, Germans seem to currently have the best sense of humor: they think everything is funny.   \n   \n [http://news.bbc.co.uk/2/hi/uk\\_news/england/2297365.stm](http://web.archive.org/web/20140307083446/http:/news.bbc.co.uk/2/hi/uk_news/england/2297365.stm)   \n   \nhhp\n\n"
    },
    {
      "time": "8 Dec 2002 — 10:27pm",
      "content": "Yves - I agree on the Brit humor superiority point. I'm an ex-pat Brit living in the USA, and although I miss the ever-ready sense of humor over there it really is almost all in the same tone: irony, irony, irony.\n\n"
    },
    {
      "time": "9 Dec 2002 — 4:30am",
      "content": "Hrant, you know what's REALLY funny? I wore almost exactly the [same suit](http://web.archive.org/web/20140307083446/http:/news.bbc.co.uk/olmedia/1715000/images/_1719400_chick150.jpg) as the guy in the picture in your article when we filmed our first videoclip last month! The video is loosely inspired by [Triggerhappy TV](http://web.archive.org/web/20140307083446/http:/www.triggerhappytv.com/), the funniest hidden camera show ever.   \n   \nY   \n   \n\"I'm gonna steal that dog. Could you please watch out for the police for me?\"\n\n"
    },
    {
      "time": "9 Dec 2002 — 4:32am",
      "content": "What's with this obsession with chickens in this thread? First Scoles, then Isaac, then Hrant, now me?\n\n"
    },
    {
      "time": "9 Dec 2002 — 10:00am",
      "content": "It's a dark, dark secret, that now has to come to light... Stephen runs the Northern Hemisphere's premiere chicken cult (the \"ph\" in his name is actually pronounced not as a \"f\", but as two distinct sounds), and he has beguiled us into unholy worship...   \n   \nhhp\n\n"
    },
    {
      "time": "9 Dec 2002 — 11:21am",
      "content": "_ **FEAR THE STEP HEN!** _   \n   \n   \nYves - I'm tickled to be mistaken for a Brit.   \nI live in the States but I don't feel American   \nat all. Soon to be Svensk actually.\n\n"
    },
    {
      "time": "9 Dec 2002 — 11:41am",
      "content": "I had a nagging feeling this was going to blow up in my face... Beware ye who tickles the Step Hen!   \n   \nPeople tell me I live in Belgium, but I feel more like living in the World.   \n   \nPS Svensk?!\n\n"
    },
    {
      "time": "9 Dec 2002 — 2:16pm",
      "content": "Frukta stäpphönan!\n\n"
    },
    {
      "time": "10 Dec 2002 — 12:17am",
      "content": "what do you mean by being swedish (svensk) soon? are you moving? welcome to stockholm.\n\n"
    },
    {
      "time": "10 Dec 2002 — 12:31am",
      "content": "Cheers, Martin! My goal is to be in Stockholm   \nwithin 6 months. If the current employment plan   \nfails me, I'll be cleaning your house for food. I   \nhope that's cool.   \n   \nBut now we've really veered from the subject of   \ngolf balls.\n\n"
    },
    {
      "time": "10 Dec 2002 — 2:50am",
      "content": "Though there is a direct correlation between the success of the employment plan and the regular use of golf balls. (!) I do hope the ones they use in Sweden are in fluorescent colours. You know, with all that snow...   \n   \nPS Stop by in Belgium on your way to Sweden. My ceilings need repainting. ;-P\n\n"
    },
    {
      "time": "10 Dec 2002 — 10:46pm",
      "content": "Ohh Stephen, come and do my dishes, I make delicious swedish food (stäpphöner om du vill, yes sire)... too bad I'm on the opposite side of Sweden. oh well.\n\n"
    },
    {
      "time": "10 Dec 2002 — 10:48pm",
      "content": "Oh, I always found those fluorescent golf balls soooo tacky. You do have a point though, our games usually consist of 5% playing, 95% looking for the golf balls.\n\n"
    },
    {
      "time": "11 Dec 2002 — 8:40am",
      "content": "Stephen... it only hit me that you were leaving. When? Why? Are you going to school?\n\n"
    },
    {
      "time": "11 Dec 2002 — 9:08am",
      "content": "I _should_ go to school. All of what I say about   \nand do with type and design is questionable   \nsludge scraped from the bottom of a small pot of   \nexperience. I've never been to an art class. I   \ndropped out of college after two years. If I   \nfound a sponsor, I wouldn't mind a shot at   \nReading or Rhode Island or The Hague. But, for   \nnow, I'm going with what I've got. Hmm, that was   \nmore answer than you asked for. Sorry.   \n   \nI am leaving for Sweden because I feel I belong   \nthere. My mama is Svensk. Our home was built   \nwith special attention to ample light and furnished   \nin scandinavian woods. Christmas was (and   \nstill is) a decidedly Swedish affair with apples   \nand straw on the tree, a grand smorgasbord, and   \nlots of songs sung in her native toungue. It was   \na trip to Stockholm in 2000 that clinched it. At   \nthe end, I felt homesick going home.   \n   \nSo I'm looking for ways to make it work. There is   \none small possibility for a job, but I've got no   \nlodging lined up. So if you svenskers know of   \nanything, please pass it along.\n\n"
    },
    {
      "time": "11 Dec 2002 — 9:42am",
      "content": "Stephen, go for it - and the best of luck to you. Build your own log cabin if you have to! ;-)   \n   \nBTW, I've heard that in Sweden you're supposed to keep the Christmas Tree up until January 15. Which is great, since although I'm no \"radical conservationist\" I think if you're gonna chop down a tree at least enjoy its presence in your home as long as possible. Over here they're thrown out on the curb the \\*next day\\* - makes me sad.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Dec 2002 — 9:55am",
      "content": "Congratulations on your upcoming adventure. I keep threatening, myself, to just move to Paris. But all I can muster is the threat. :/ So I'm happy that you are able to go for it!\n\n"
    },
    {
      "time": "11 Dec 2002 — 3:05pm",
      "content": "The nice thing about internet forums is that someone you get to know (well, sort of) may move to the other side of the world and still never leave.   \n   \nIt may seem obvious to most of you, but it just struck me after reading Stephen's last entry. Thought I might share it.\n\n"
    },
    {
      "time": "11 Dec 2002 — 3:06pm",
      "content": "Amen to that, Yves.\n\n"
    },
    {
      "time": "11 Dec 2002 — 6:54pm",
      "content": "i thought of that too. but won't scoles' response times to id posts be hampered? your reputation is in jeopardy.   \n   \ni was also thinking of the culinary changes. aren't you in utah? from green jell-o salads and tatertot casserole to lutefisk... talk about adventure. or is lutefisk from a different scandinavian country?\n\n"
    },
    {
      "time": "11 Dec 2002 — 11:56pm",
      "content": "Lutefisk _is_ Swedish, as far as I know.   \n   \nMormon and Svensk fare aren't too distant of   \nrelatives. Potatoes, gelatin and meat are big in   \nboth worlds. Luckily I have yet to see all three   \n [combined in one dish](http://web.archive.org/web/20140307083446/http:/www.lileks.com/institute/gallery/knox4.html).\n\n"
    },
    {
      "time": "12 Dec 2002 — 6:45am",
      "content": "\\>I have yet to see all three combined in one dish.   \n   \ni'll try to find a recipe for you.\n\n"
    },
    {
      "time": "12 Dec 2002 — 8:42am",
      "content": "![:)](http://web.archive.org/web/20140307083446im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nIsaac -- You wouldn't be guilty of generalizing would you now??\n\n"
    },
    {
      "time": "12 Dec 2002 — 8:52am",
      "content": "I think they serve dat dish in Minnesota y'know!   \n   \nUp Nort a bit Y'betcha!   \n   \n:D\n\n"
    },
    {
      "time": "12 Dec 2002 — 10:27am",
      "content": "i thought you were allowed to make fun of your own kind. i've never had tatertot casserole, but i've seen plenty of ornamented jell-o at pot-luck dinners.\n\n"
    },
    {
      "time": "12 Dec 2002 — 1:15pm",
      "content": "We don't call it casserole in these parts, it's hot dish. The tatortot variety is as tasty as you may expect. the formula I believe is one part cheese/sour cream with one part meat with one part carb party (tatortots, macaroni, mashed potatoes)   \n   \nThe combinations are endless and usually flavorless.   \n   \nI am a fan of the Jello molds though, I have a nice 50s recipe of one made with chicken broth that suspends radish slivers, carrots, and contains a liver paté it's really quite scrumptious looking as well.   \n   \nI can only imagine being invited to a dinner party where that concoction is wheeled out on a serving cart and unveilied beneath a silver dome - I can hear the \"Ahhhh's\" of the dinner guests now!   \n   \n:D\n\n"
    },
    {
      "time": "12 Dec 2002 — 1:59pm",
      "content": "This must be the longest and weirdest font ID thread ever? I'm already looking forward to the next direction we shoot off to. (and still no trace of that darn Titleist script face)   \n   \nLOL   \n   \n=D\n\n"
    },
    {
      "time": "12 Dec 2002 — 2:11pm",
      "content": "\"BTW, I've heard that in Sweden you're supposed to keep the Christmas Tree up until January 15.\"   \n I think you mean \"Tjugondag Knut\", it's 20 days after Christmas (which we celebrate on the 24th).   \nIt's an excuse for the kids to plunder the christmas tree for little gifts & candy & a little golfball (Tileist). If I remeber correctly from when I was kid. It's actually called \"Christmas Tree Pillage & Country Club\"\n\n"
    },
    {
      "time": "12 Dec 2002 — 2:13pm",
      "content": "I'm almost certain it's not a font due to the alternate 't' and 'i's   \n   \nI bet it could be drawn quickly though . . .   \n   \nSeriously, I'll draw it if someone needs it for titling, but JCN hasn't reposted since the first post.   \n   \nStuart :D\n\n"
    },
    {
      "time": "12 Dec 2002 — 2:13pm",
      "content": "Isaac -- I was saying that with my tongue planted firmly in my cheek. There is nothing quite like a fresh albacore casserole when you are sick.   \n   \n ![:)](http://web.archive.org/web/20140307083446im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "12 Dec 2002 — 6:46pm",
      "content": "Hey. My link to scary gelatin was flummoxed. [Here it is](http://web.archive.org/web/20140307083446/http:/www.lileks.com/institute/gallery/knox/4.html).\n\n"
    },
    {
      "time": "13 Dec 2002 — 12:12am",
      "content": "Oh my, Stephen! Gross! Do people actually EAT this? Is this a cultural thing? There could easily be a golfball hidden in there and you'd eat it without even noticing.   \n   \nI think we scared the $#!\n\n"
    },
    {
      "time": "13 Dec 2002 — 8:19am",
      "content": "tiffany- at first i had assumed that about your tongue, but sometimes i open my mouth too widely and too often (recall the comic sans debacle), and i get misunderstood. i guess i should start using those face thingies. just so you know, it's hard to be serious about most things when you drive a '92 caravan loaded with baby seats. when i say you, i mean me.\n\n"
    },
    {
      "time": "13 Dec 2002 — 11:46am",
      "content": "I tried a live tree once: it was about 3 feet tall, and I bought it after Christmas that year, planning on growing it in my back yard for use the following year - it didn't make it... :-( I also thought of just decorating one of the trees in my back yard, but I think Garmir (\"Red\", my beagle) would have had a hard time telling which gifts were not for him...   \n   \nhhp\n\n"
    },
    {
      "time": "13 Dec 2002 — 11:14am",
      "content": "re: Conserving christmas trees. We bought a live one this year (in a pot, even!) it's only 4 feet tall, but it's a happy tree.   \n   \nre: Stephen's caserole. Nasty. Do the FDA and the CDC know about that?   \n   \nre: Stephen's move to Sweden. What?! Crazy, awesome, cool. The funny thing is, now that you'll be across the world, I'll probably see you on AIM during the DAY time.\n\n"
    },
    {
      "time": "7 Dec 2002 — 9:10am",
      "content": "You're probably not going to find a match: you need a perfectly monoline connected script, and there aren't that many. Even the one called [Monoline Script](http://web.archive.org/web/20140307083446/http:/www.myfonts.com/fonts/agfa/monoline-script-mt/) from Monotype isn't exactly Monoline... :/ What you might try is go over to MyFonts.com where I made you a link with [connected scripts](http://web.archive.org/web/20140307083446/http:/www.myfonts.com/Search?searchtext=connected%20script&x=28&y=9). Browse through the list and testdrive a couple of them. This is for example what you get when you set it in [Handsome Bold](http://web.archive.org/web/20140307083446/http:/www.myfonts.com/fonts/shinn/handsome/bold/testdrive.html?s=Titleist&p=48) by Nick Shinn. See what else you can find. Good luck... you'll need it.\n\n"
    }
  ]
}
