{
  "id": "39968",
  "title": "Adam BP",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "B&P Typefoundry is proud to present and distribute Adam BP, by Anton Koovit.\n\nTypeface Adam  \nInitally Adam project started as a typeface specifically for art manifestos. Over a period of 1½ years more members and cuts were added to the family. Characterset was fully expanded to the Pro set (about 700 glyphs). In the early beginning, while working at the project in KABK type and media in Netherlands it was clear that manifestos require, like any other text which is to be seen and read, readability across long distances of copy. As well, the family needed good variants at hand for the creation of hierarchies (to represent the writing of multiple authors). Curatorial and critical writings, gallery publications as well signage and magazine articles often require the construction of complex hierarchies. Therefore Adam has been made with multiple weights, a fitting true italic and four display stencil-based cuts.\n\nEstonian typeface Adam italic  \nAdam is the first typeface made in Estonia specially for reading sizes and continuous text. Due to the fact that there haven’t been any text typefaces to look at, Adam’s influences come from many different sources. Capitals are influensed by early 20th century Grotesques, lowercase redraws the rhytm of broad-nib writing practice. Italic is in many ways contrasting member in the whole family, fitted in colour and rhythm into the Adam. Text sizes have proved to work well in magazines. For display purposes Cutted version with contextual alternates gives livelyness to headlines.\n\nCutted typeface Adam  \nAdam’s cutted versions were kept in mind while creating the solid base fonts. In a way sans-serif letter shapes were fitted for cutting them later. Cuts refer to the vernacular stencil typography. The most difficult challenge was to create cutted typeface that still has lively image while set on a page. A lot of stripes and “faulty inkjet” effect were tending to happen while printing regular stencil fonts at 10pt. For that end many double combinations of letters have contextual alternates, for example oo, aa, nn, ee, etc. Cutted Adam is at its best on posters and in newspapers. For example political newspaper “Argument” in Norway has used Adam cutted black for its strong display abilities.\n\nKind regards\n\nIan Party, Maxime Buechi\n\n[www.bpfoundry.com](http://web.archive.org/web/20131015222213/http:/www.bpfoundry.com/ \"www.bpfoundry.com\")\n\n",
  "author": "ian party",
  "time": "11 Dec 2007 — 6:50am",
  "uid": "14097",
  "comments": [
    {
      "time": "11 Dec 2007 — 9:17am",
      "content": "If you have Typophile worthy news, post it! [http://typophile.com/node/add/story](http://web.archive.org/web/20131015222213/http:/typophile.com/node/add/story \"http://typophile.com/node/add/story\")  \nLet [Tiffany Wardle](http://web.archive.org/web/20131015222213/http:/typophile.com/user/108/contact) (me) or [Paul Hunt](http://web.archive.org/web/20131015222213/http:/typophile.com/user/7006/contact) know you have posted some news so we can approve it for you.\n\n"
    }
  ]
}
