{
  "id": "39988",
  "title": "Duplicate letters in logo identity",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,  \nI’m working on a logo for a media (Advertising/Marketing) agency, the name is just initials with the letters s, e, s, I’ve been playing around with different concepts but keep on getting stuck because of the duplicate “s” letters.\n\nThe goal is to create more of an ’Identity’ than a logo, I’m thinking of implementing [Vista Sans](http://web.archive.org/web/20081007181312/http:/www.fontshop.com/search/?q=vista%20sans) as the general brand typeface (a custom font would probably not be affordable).\n\nAny suggestions or direction?\n\n [‹ Self Promo Logo](http://web.archive.org/web/20081007181312/http:/www.typophile.com/node/47763 \"Go to previous forum topic\") [Logo Design for Photographer ›](http://web.archive.org/web/20081007181312/http:/www.typophile.com/node/48041 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007181312/http://www.typophile.com/user/17353\" title=\"View user profile.\">BlueEyedPeas</a>",
  "time": "<br>",
  "uid": "17353",
  "comments": [
    {
      "time": " 11.Dec.2007 8.01pm",
      "content": "BEP ... seems like there might be some interesting possibilities.\n\nbut we need some questions answered ... :D\n\nplaying around = what exactly?\n\ndoes that mean sketching on paper ... or digital ideations — illustrator, or some other program?\n\ndo they want upper or lowercase? (i’d imagine upper).\n\nany particular style they are trying to convey with the letterforms? Do they have a site we could see?  \nAny background on the company? What \\*exactly\\* do they do? Who are their competitors? Who are their customers?\n\nwhat are they currently using for a logo? Where are they based? Do they want something monogram-ish? Do they want a graphic device or just the three letters?\n\nare there periods between S.E.S. ?\n\nkinda difficult to assist b/c Step 1 = research and we don’t have any info. :)\n\n"
    },
    {
      "time": " 11.Dec.2007 9.13pm",
      "content": "Hi Brian,  \nThanks for your interest and response, here are some answers.\n\n<cite>playing around = what exactly? does that mean sketching on paper ... or digital ideations — illustrator, or some other program?</cite>  \nPlayground is in Adobe Illustrator of course, I didn’t post drafts because I don’t really like any of them.\n\n<cite>do they want upper or lowercase? (i’d imagine upper).</cite>  \nThey currently use both, I prefer lowercase rather which would give it more of a modern feel.\n\n<cite>Do they have a site we could see?</cite>  \nWebsite doesn’t show much, here is a [link](http://web.archive.org/web/20081007181312/http:/www.sesmedia.com/).\n\n<cite>Any background on the company? What *exactly* do they do? Who are their competitors? Who are their customers?</cite>  \nThis is the interesting part, I can’t elaborate much because some of the details are confidential, but here are the basics. They are a young and fresh think tank group aspiring to reach the american orthodox jewish sector just like other ethnic marketing agencies (e.g. WingLatino, Vidal Partnership, Alma DDB, etc.) are already doing with the hispanic sector for example.\n\nThey offer insight to a sector that corporate america cannot reach with conventional media, they serve as a link to a community which is mostly secluded from mainstream america. That is also the reason why they virtually have no competition to date, because they are from within this marketplace and are therefore very exclusive in understanding the language and subtle nuances of this specific market.\n\n<cite>what are they currently using for a logo? Where are they based?</cite>  \nSee previous [link](http://web.archive.org/web/20081007181312/http:/www.sesmedia.com/) please.\n\n<cite>Do they want something monogram-ish?</cite>  \nI don’t think monogram style would be appropriate, I envision something ’corporate’, a clean modern identity, I might be wrong but a monogram to me conveys a traditional printshop etc.\n\n<cite>Do they want a graphic device or just the three letters? are there periods between S.E.S. ?</cite>  \nA graphic element would be cool if it could be incorporated, no periods between letters.\n\n"
    },
    {
      "time": " 12.Dec.2007 7.04pm",
      "content": "<cite>Playground is in Adobe Illustrator of course, I didn’t post drafts because I don’t really like any of them.</cite>  \nTry sketching on paper. There’s much more flexibility and wiggle room with pencil roughs than with beziers.\n\nAnother idea would be to focus on the graphic and use a nice clean readable typeface. Looking at the other companies you mentioned, they all seem to have very safe, clean logos.\n\n- Lex\n\n"
    },
    {
      "time": " 13.Dec.2007 10.31am",
      "content": "That’s exactly what I’m trying to establish, a safe clean logo, I’m now exploring with Vista Sans as mentioned.\n\nHere are some rough samples, don’t really like any of them.\n\n ![](http://web.archive.org/web/20081007181312im_/http:/www.typophile.com/files/HelveticaLight_6324.jpg)\n  \n\n ![](http://web.archive.org/web/20081007181312im_/http:/www.typophile.com/files/Box_6620.jpg)\n\nOther ideas:\n\n ![](http://web.archive.org/web/20081007181312im_/http:/www.typophile.com/files/DaleysGothic_4039.jpg)\n  \n\n ![](http://web.archive.org/web/20081007181312im_/http:/www.typophile.com/files/VisualPlay_3880.jpg)\n\nI like the last one that is a visual play about thinking ’out of the box’, but its not corporate at all, it would be more appropriate for an architect e.g.\n\n"
    },
    {
      "time": " 13.Dec.2007 11.27am",
      "content": "I realy like what’s going on in the first picture under “Other ideas”. The black version seems to have a candelabre scattered around in the negative spaces. If a candelabre is relevant to this group of people I’d try to make something out of that.  \nIt might sound like I’m drunk but I’m not.\n\n"
    },
    {
      "time": " 13.Dec.2007 3.30pm",
      "content": "I prefer the first one in the second file under “Other ideas”. It’s the simplest of all, and therefore the best imho. I don’t like the “media group” font though. It’s too hard to read. Maybe go for a more common font here?\n\n[Web Design Hamburg](http://web.archive.org/web/20081007181312/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 14.Dec.2007 1.00am",
      "content": "I think both of the marks in the first under »Other ideas« are worth elaborate on. The one in the top of the last picture is similar to the logo of swedish design- & brand agency [Essen](http://web.archive.org/web/20081007181312/http:/www.essen.se/1000.asp?SectionId=523&lang=1)...\n\n"
    },
    {
      "time": " 30.Mar.2008 1.08am",
      "content": "Thanks for your comments, I don’t know why but somehow this project turned out to be far more challenging than anticipated, I’m thinking now that maybe an “ambigram” might be a clever solution, any ideas?\n\nHere is another concept developed lately:\n\n ![](http://web.archive.org/web/20081007181312im_/http:/www.typophile.com/files/sesgrowth_5561.jpg)\n  \nPlease post your opinion and critic - it is greatly valued.\n"
    },
    {
      "time": " 30.Mar.2008 2.43am",
      "content": "Quick comment from the sidelines: Maybe it’s just me, but the shapes in your “ambigram” notion seem reminiscent of Jeremy Tankard’s “Blue Island” typeface. (Adobe has it, if aging memory serves.) That might be an avenue worth exploring, too. Or maybe not.\n\nIn any case, have fun & good luck.\n\n"
    },
    {
      "time": " 30.Mar.2008 10.16am",
      "content": "It is indeed based solely on the lowercase letter “e” from Blue Island, and the question is, does it work? Is it appropriate as a logo mark?\n\n"
    },
    {
      "time": " 7.Apr.2008 6.31am",
      "content": "throw together ... started as a development on the basic shape method as about (the arrows.) Pathways to ideas that work ... breaking the circle(cycle.)\n\n ![](http://web.archive.org/web/20081007181312im_/http:/www.typophile.com/files/ses_4635.jpg)\n\nhave fun!\n\n—————  \n**Paul Ducco**  \n [Design Studio Melbourne](http://web.archive.org/web/20081007181312/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 7.Apr.2008 1.10pm",
      "content": "The 1:08 “ambigram” is interesting. Looks a little Polynesian or something to me.\n\nAlong those lines, could you do a more rectilinear version - I’m picturing something like a Greek [key pattern](http://web.archive.org/web/20081007181312/http:/images.google.com/images?q=greek%20key%20pattern&hl=en) that reverses direction. Maybe that’d be too architectural.\n\n"
    },
    {
      "time": " 8.Apr.2008 11.33am",
      "content": "The first one in the forth set and the newest one have the most potential in my eyes. I think perhaps the type in the gray box from Mar 30 is a bit something, It feels like the label for a mens clothing line to me. The letters are too sharp but it’s a great idea.\n\nPauls idea above works fantastically.\n\nhonk if you love the status quo\n\n"
    },
    {
      "time": " 9.Apr.2008 1.52am",
      "content": "of the ones posted I think the arrows has the most potential for an identity .. ideas in all direction ... refreshing.\n\nthe type you’ve put with it is too structured/rigid (not what idea people are meant to be) and certainly not friendly.\n\n:)\n\n—————  \n**Paul Ducco**  \n [Logo Design Melbourne](http://web.archive.org/web/20081007181312/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 10.Aug.2008 1.58pm",
      "content": "A final [ambigram](http://web.archive.org/web/20081007181312/http:/www.sesmedia.com/), old logo [here](http://web.archive.org/web/20081007181312/http:/www.sesmedia.com/index1.htm).\n\n"
    }
  ]
}
