{
  "id": "39994",
  "title": "Barbara Kruger's Work - how does it affects consumerism?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What do you personally think of her work, specially the 'I Shop Therefore I am' and 'Love for Sale' and how do you think it affects consumerism? Is she mocking and being ironic? Please click on the links below to view her work.\n\n[http://www.barbarakruger.com/art.shtml](http://web.archive.org/web/20130101064701/http:/www.barbarakruger.com/art.shtml \"http://www.barbarakruger.com/art.shtml\")\n\n[http://www.bbc.co.uk/dna/collective/A904196](http://web.archive.org/web/20130101064701/http:/www.bbc.co.uk/dna/collective/A904196 \"http://www.bbc.co.uk/dna/collective/A904196\")\n\n",
  "author": "missgiggles",
  "time": "11 Dec 2007 — 6:49pm",
  "uid": "14600",
  "comments": [
    {
      "time": "11 Dec 2007 — 7:05pm",
      "content": "I don’t see any evidence whatsoever that this sort of work affects consumerism. Aside from the adbusters and Utne reader crowd, almost nobody has—or will—see this stuff, and given the way people like to shop, I don’t think that they want to. Anti-consumerism is an echo chamber, not a dialogue being had by the masses.\n\n"
    },
    {
      "time": "11 Dec 2007 — 7:11pm",
      "content": "I saw all sorts of this stuff in Seattle on \"Buy Nothing Day,\" the day after Thanksgiving. People were rallying around and protesting in the middle of Westlake Center, a mall in the heart of downtown. They were carrying signs that said \"buy more stuff!\" etc.\n\nI was like, \"Yeah! Consumerism sucks!\" but then I walked around them because I needed to get to the sale at Guitar Center.\n\n"
    },
    {
      "time": "11 Dec 2007 — 7:32pm",
      "content": "_Is she mocking and being ironic?_\n\nNo, she's telling the truth.\n\n"
    },
    {
      "time": "11 Dec 2007 — 8:13pm",
      "content": "So many products, so little time.\n\n"
    },
    {
      "time": "11 Dec 2007 — 8:43pm",
      "content": "\\> What do you personally think of her work...\n\nGreat! Always loved her stuff. Much like Ann Hamilton, Vito Acconci...\n\n"
    },
    {
      "time": "11 Dec 2007 — 8:57pm",
      "content": "Jenny Holzer...\n\nI credit Barbara Kruger more for her inroads into the male dominated 80s art scene (and her impact on graphic design - she redefined red) than for any effect she may have had on consumerism. The average consumer wouldn't know who she is. Not to diminish the power of her work.\n\ncreeping up on thread #40000\n\n"
    },
    {
      "time": "12 Dec 2007 — 2:46am",
      "content": "I was looking specifically at 'I shop therefore I am'. Do you not think it is looking into the female obsession of shopping? All these anti- aging cream adverts to make them beautiful etc. Is she not mocking consumerism and its link to females?\n\n"
    },
    {
      "time": "12 Dec 2007 — 3:06am",
      "content": "Is there by any chance a thread on here or an article on females and how they shop and buy? And as to why they shop obsessively (handbags, million pairs of shoes etc). Her work was pinched by Debenhams. This is what I have heard but can not seem to find the evidence online. Hmmm...I wonder if anyone on here knows about this and could guide me.\n\n"
    },
    {
      "time": "12 Dec 2007 — 5:58am",
      "content": "<cite>Is she not mocking consumerism and its link to females?</cite>\n\nShe certainly is. But so do a lot of other artists—what are you trying to get at beyond the obvious?\n\n"
    },
    {
      "time": "12 Dec 2007 — 6:30am",
      "content": "I shop because I like to shop.\n\n"
    },
    {
      "time": "12 Dec 2007 — 7:05am",
      "content": "_can not seem to find the evidence online_\n\nIf it's not online... it doesn't exist. Or matter.\n\n"
    },
    {
      "time": "13 Dec 2007 — 12:06pm",
      "content": "I concur. With a graph.\n\n ![](http://web.archive.org/web/20130101064701im_/http:/typophile.com/files/2086934736_94e0720871_3597.jpg)\n\n"
    },
    {
      "time": "13 Dec 2007 — 1:39pm",
      "content": "I like her work. Her work, by itself, probably isn't a major factor on the masses' buying habits. Is she mocking and being ironic? Is that not obvious?\n\n"
    },
    {
      "time": "13 Dec 2007 — 2:30pm",
      "content": "Haley, you rock! :-)\n\n"
    },
    {
      "time": "13 Dec 2007 — 3:10pm",
      "content": "_Is she mocking and being ironic? Is that not obvious?_\n\nThe phrase \"I shop therefore I am\" is not a mockery of consumerism, but a recognition of it as a cultural imperative. Her important early work, after all, comes soon after the development of cultural studies as an academic discipline. The idea of \"popular culture\" was an oxymoron until around 1970.  \nThe graphic style she used was not an imitation of commercial media. It had something in common, certainly, in the image+text combination, and Futura and color bars were popular at the time. But that was her style (she had worked in publishing), and also had resonance with, of course, John Heartfield's work--another artist who worked as a commercial graphic designer.  \nIt was her medium, her way of expressing herself, not a parody.\n\n"
    },
    {
      "time": "13 Dec 2007 — 5:19pm",
      "content": "Haley & Ricardao: I wonder why my tutor would want to lie to me? Hmm... I would also like to mention that he said that Debenhams ripped it off her, without any consent etc. Could that create a link to shopping somehow?  \nEveryone else: Thank you for taking my question seriously. I wanted to see if there was a link or a connection could derive from a female approach to shopping, 'I shop therefore I am' and consumerism. Any ideas? I am trying to create a connection as part of my dissertation.\n\n"
    },
    {
      "time": "13 Dec 2007 — 6:19pm",
      "content": "Nothing effects consumerism. Especially an artist whose work most people have never seen.\n\n"
    },
    {
      "time": "13 Dec 2007 — 11:08pm",
      "content": "Barbara Kruger is about more than just \"I shop therefore I am,\" or consumerism...\n\n[http://www.eng.fju.edu.tw/Literary\\_Criticism/feminism/kruger/kruger.htm](http://web.archive.org/web/20130101064701/http:/www.eng.fju.edu.tw/Literary_Criticism/feminism/kruger/kruger.htm \"http://www.eng.fju.edu.tw/Literary\\_Criticism/feminism/kruger/kruger.htm\")\n\nAlso: _finding_ a link or connection is one thing, but you cannot _create_ a link or connection if there is none to begin with. There is a difference.\n\n"
    },
    {
      "time": "14 Dec 2007 — 12:06am",
      "content": "Kruger had an exhibition in Glasgow in 2005, commissioned by GoMA, specifically related to violence against women, in her classic agitprop text+image technique:  \n [http://www.studio-international.co.uk/reports/kruger.asp](http://web.archive.org/web/20130101064701/http:/www.studio-international.co.uk/reports/kruger.asp \"http://www.studio-international.co.uk/reports/kruger.asp\")\n\nIf you're looking to discuss sexual politics in her work, why not choose that, where she directly addresses the issue?  \nI wouldn't say she particularly addresses consumerism in her work, although her use of commercial media may give that impression.\n\nBarabara Kruger is one of that generation of \"second wave\" feminists, and there's no denying that sexual politics is an important element in her work, but I would echo Ricardo in saying that there's more to it than that, and ironically by focusing on it and pigeonholing her as a consumerism/shopping/women's issues artist, you'd be missing the point.\n\nI like what she has to say, and the way she puts words and images together.\n\nAt the same time and place as the GoMA exhibit, she showed a more recent direction, an installation (four walls of an enormous room in an old transport terminal) involving four simultaneously screened movies of \"talking heads\" she had written and directed, with text captions.\n\n"
    },
    {
      "time": "18 Dec 2007 — 10:41am",
      "content": "I know that Kruger mocked masculinity in most of her work because she was a feminist but the 'I shop therefore I am' was a piece she did where she was cynical of women. Is she two faced then? She just mocks both men and women?\n\n"
    },
    {
      "time": "18 Dec 2007 — 11:06am",
      "content": "I think you are either reading way to much into the art, or not enough.\n\n"
    },
    {
      "time": "18 Dec 2007 — 11:21am",
      "content": "Why wouldn’t a feminist artist express her anger toward men and women? Feminism was as much about dealing with womens’ perceptions and behavior as it was about men.\n\n"
    },
    {
      "time": "18 Dec 2007 — 12:05pm",
      "content": " ![](http://web.archive.org/web/20130101064701im_/http:/typophile.com/files/shopping1_5565.jpg)\n\n ![](http://web.archive.org/web/20130101064701im_/http:/typophile.com/files/51KQBM2RY9L_3489._AA240_.jpg)\n\n"
    },
    {
      "time": "19 Dec 2007 — 10:31am",
      "content": "<cite>Her work was pinched by Debenhams. This is what I have heard but can not seem to find the evidence online.</cite>\n\nIt was Selfridges [another UK department store], and it wasn't pinched - Kruger did the work. You'll find lots of examples online.\n\n"
    },
    {
      "time": "19 Dec 2007 — 1:04pm",
      "content": "In that case, maybe the question should be, \"How has consumerism affected Barbara Kruger's work?\"\n\nRead it and barf:  \n [http://www.socialistreview.org.uk/article.php?articlenumber=9706](http://web.archive.org/web/20130101064701/http:/www.socialistreview.org.uk/article.php?articlenumber=9706 \"http://www.socialistreview.org.uk/article.php?articlenumber=9706\")\n\n"
    },
    {
      "time": "1 Jan 2008 — 9:24am",
      "content": "Hmm...yup i noticed the Boxing day sale advert on TV for Selfridges. Thanks for pointing that out. I wish it was pointed out well before the 19th but nevermind. I know Kruger did the work of I Shop Therefore I am but did they have permission to use it? It was bastardised. That's not what my tutor told me. Hmm...I wonder.\n\n"
    }
  ]
}
