{
  "id": "39990",
  "title": "(x) Slab serif typeface on classic Marlboro ads - Neo Contact {Dan R}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "can anyone identify the font used in the marlboro ads?\n\n ![](http://web.archive.org/web/20120203214532im_/http:/typophile.com/files/dana_marlboro_6207.jpg)\n\n",
  "author": "<a href=\"/web/20120203214532/http://typophile.com/user/24853\" title=\"View user profile.\">asdf1234</a>",
  "time": "<br>",
  "uid": "24853",
  "comments": [
    {
      "time": "",
      "content": "Its Neo Contact.\n\n"
    },
    {
      "time": "",
      "content": "Here is a link –\n\n[http://www.linotype.com/43414/neocontact-family.html](http://web.archive.org/web/20120203214532/http:/www.linotype.com/43414/neocontact-family.html \"http://www.linotype.com/43414/neocontact-family.html\")\n\n"
    },
    {
      "time": "",
      "content": "Probably custom but it's some sort of condensed Clarendon\n\nHave a look at these\n\n[http://www.myfonts.com/fonts/redrooster/consort-rr/](http://web.archive.org/web/20120203214532/http:/www.myfonts.com/fonts/redrooster/consort-rr/ \"http://www.myfonts.com/fonts/redrooster/consort-rr/\")\n\n"
    },
    {
      "time": "",
      "content": "Arguably one of the more recognizable typefaces of all time. Nobody else uses it because Marlboro owns it. Who else would touch it unless they're panning/mocking Marlboro?\n\n"
    },
    {
      "time": "",
      "content": "It is Neo Contact! Erik Spiekermann says so in the Helvetica movie, too. Or at least he says that he has it and you can buy it. That's because it is in the FontShop store as well.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20120203214532im_/http:/typophile.com/files/Marlboro-dammit_6061.gif)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I don't mean to overstep my bounds, because I am by all rites a noob here. However, I worked in a production studio basically owned/operated by the ad agency responsible for Marlboro Racing, Outdoor, Print and the like. I was always under the impression that the font was custom made for Marlboro. The names of the fonts are: Marlboro and Marlboro CBC Display.\n\n ![](http://web.archive.org/web/20120203214532im_/http:/typophile.com/files/Marlboro_4609.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Neo Contact is an old ATF face, from at least the 1950s. It existed before digital type, and Marlboro must have used it before digital type, too. I suspect that Marlboro's fonts are branded, i.e., they are Neo Contact with minimal changes, different interletter spacing, especially for size considerations, etc, and above all, a name change. This make people feel better when they are using the font. But its the same face… everyone and their parents may not be able to get a hold of the fonts with \"Marlboro\" in their names, but for 20-odd bucks, they can get as close as branding guidelines'll allow.\n\n"
    },
    {
      "time": "",
      "content": "For example the same goes for Volvo. The corporate faces are called Volvo Sans and Volvo Serif, but they are identical renamed versions of Akzidenz-Grotesk and Berling (the digitizations that originally were commercialized by Adobe).\n\n"
    },
    {
      "time": "",
      "content": "S-s-s-s-mokin' :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chris,\n\nYou aren't kidding. Up until recently, the agency paid the city levied fines for smoking in the building so those who did, could. One of those nice perks. I can still remember walking into work looking across the studio and seeing plumes of smoke rising from artists' desks.\n\nDan and Yves, thank you very much for the insight. I am always amazed and humbled at the amount of information one can find here!\n\nI'm going out and rebranding my Chevy Celebrity into a Volvo right now! ;)\n\nThanks again!\n\n"
    }
  ]
}
