{
  "id": "400",
  "title": "Packaging for Haircare",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Ok typophilers. Here's a question. I'm digging all over now, even as I type. But then I realized that perhaps someone here might be able to help me find a supplier.\n\n",
  "author": "Miss Tiffany",
  "time": "20 Jun 2003 — 11:52am",
  "uid": "108",
  "comments": [
    {
      "time": "20 Jun 2003 — 1:20pm",
      "content": "There's a brand of perfume with a corset. I can't remember if it's Gaultier, or something else. Go to Sephora. BTW, it sounds like doing this project creatively might required the acquisition of stronger taste, or at least a stronger stomach! You can't get creative if you're not happy. Unless you're Goya or something.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jun 2003 — 2:45pm",
      "content": "Although Gaultier does have perfume bottles with corsets, they're just the way the glass is shaped.   \nThe one I was really thinking of is actually a champagne:   \n   \n [http://www.kodiakwines.com/gaultier.asp](http://web.archive.org/web/20131018233135/http:/www.kodiakwines.com/gaultier.asp)   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jun 2003 — 2:53pm",
      "content": "You are so right Hrant. I'm not \"really\" the type to do this sort of thing. But, we are only in the conceptual stage, and as much as I hate to Admit this sort of thing, this client has been known to flake.   \n   \nThat said. I have seen this wine bottle and I've the Gaultier parfum as well. The wind bottle is closer to the idea.\n\n"
    },
    {
      "time": "20 Jun 2003 — 3:06pm",
      "content": "\\> I'm not \"really\" the type to do this sort of thing.   \n   \nWell, you don't have to model the thing yourself, do you?! :-) Give yourself enough credit, I mean in adapting to the client. Maybe you could do a smart parody of the idea?   \n   \n--   \n   \nHmmm, haircare...   \nHey you know those \"butterfly\" hair clasps? What if it was something like that squeezing the bottle instead?   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jun 2003 — 8:24pm",
      "content": "A bit off-topic, but: be careful how much you talk about flaking clients here -- oh, I just got it... \"flake,\" \"haircare!\" HA! -- because I find that the search engines pick up our jabber pretty quickly. The last thing you might want is for a potential client to tap your name into google and find you bad-mouthing a client (though your comment wasn't particularly harsh.)   \n   \nOr they might just admire your candor.\n\n"
    },
    {
      "time": "23 Jun 2003 — 9:15am",
      "content": ":^O   \n   \nPaul. The flake remark was more of a pun. But you're right. Especially as this is a growth client, or rather a client with potential.   \n   \n:^/\n\n"
    },
    {
      "time": "23 Jun 2003 — 12:19pm",
      "content": "corset looking purses have been around awhile.   \n   \nbut in any case - sure the big thing is the sleazy yucko corsets, but remember even Cinderella worn an endo-corset thing. think of Watteau paintings...it can be very innocent and romantic in shades of Crabtree & Evelyn.\n\n"
    },
    {
      "time": "23 Jun 2003 — 1:33pm",
      "content": "Tanya -- I'm with you. Beautiful idea. I'm really interested, for one approach, in using Misprinted Type's Porcelain or Selfish.\n\n"
    }
  ]
}
