{
  "id": "40006",
  "title": "Adbusters",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What is the main focus of adbusters and how do they work? I do not understand how it links to the first things first manifesto. Please explain. I know that the manifesto was redone in 2002.\n\n",
  "author": "missgiggles",
  "time": "12 Dec 2007 — 2:52am",
  "uid": "14600",
  "comments": [
    {
      "time": "12 Dec 2007 — 5:56am",
      "content": "Adbusters and First Things First 2000 don’t directly link. First things first is an essay by designers who believe that designers could be doing better things with their talents and abilities than marketing products—products which are, in the view of the authors, unnecessary. There might be a connection to Adbusters by way of inspiration.\n\nAdbusters is an attempt at mocking branding and marketing, in which advertisements and the mainstream media are parodied with recreations of their advertisements and ephemera, usually by altering the wording of an ad campaign. The people behind it refer to their activity as culture jamming, although as I already pointed out in another thread, most people pay no attention, so it’s not so much affecting culture as a dialogue between holier-than-thou hipsters. It has been pointed out that Adbusters itself is a heavily branded, overpriced magazine just like those it often mocks, and that the same can be said for the unbranded products sometimes sold within its pages or by its creators.\n\nYour best bet for understanding the anti-consumerist movement is to go down to the library and start sifting through old issues of Adbusters, or find a local group that engages in this stuff and talk to them. Reading up on Jonathan Barnbrook would be very worthwhile.\n\n"
    },
    {
      "time": "12 Dec 2007 — 6:05am",
      "content": "\\> Adbusters itself is a heavily branded, overpriced magazine\n\nThe magazine is only overpriced if you compare it to those that carry advertising, which generally provides many times the income that circulation does. Since Adbusters carries no ads, the cover price is naturally going to be at least double what an ad-rich publication will (and remember that an 80 page issue without ads has the same editorial space as a 200 pages magazine that carries ads.\n\n(And no, I am not a holier-than-thou hipster. I have bought exactly 1 copy of the magazine in the last five years.)\n\n"
    },
    {
      "time": "12 Dec 2007 — 6:19am",
      "content": "You are correct Don, I meant to be more specific and say that those points have been made in the letters to the editor section of Adbusters.\n\n"
    },
    {
      "time": "12 Dec 2007 — 12:05pm",
      "content": "Maybe tangentially related, if you're interested in the anti-consumerism movement and the whole parody method this movie coming out might interest you:\n\n[http://www.imdb.com/title/tt0939681/](http://web.archive.org/web/20131014014421/http:/www.imdb.com/title/tt0939681/ \"http://www.imdb.com/title/tt0939681/\")\n\nGranted, being a graphic designer and anti-consumerist can be a bit of a contradiction at times. ;0)\n\n"
    },
    {
      "time": "13 Dec 2007 — 9:17am",
      "content": "That's why I practice editorial design. When the revolution comes, the ad people will be the first to go.\n\nUnless the government hires them first, ALA Goebbels.\n\n"
    },
    {
      "time": "13 Dec 2007 — 10:09am",
      "content": "When the revolution comes, the hundreds of millions of people whose manufacturing jobs are dependent on selling stuff with probably be quite happy to keep the ad designers around.\n\n"
    },
    {
      "time": "13 Dec 2007 — 12:04pm",
      "content": "Haha yeah right. Advertising will definitely outlive the need for print editorial designers.\n\n"
    },
    {
      "time": "13 Dec 2007 — 1:11pm",
      "content": "Not every revolution will hat advertisers. Weren't many figures in the Nixon administration and election teams from a JWT office in California?\n\n"
    },
    {
      "time": "13 Dec 2007 — 1:23pm",
      "content": "_Advertising will definitely outlive the need for print editorial designers._  \nHa! Editorial started this whole mess, we'll end it too.\n\nWhenever there is injustice in the world, wherever there is crime being committed, whenever there is a need for someone to stand up and complain so that someone else will stand up and fix it for those poor shmoes, EDITORIAL WILL BE THERE!\n\nBut going back to Adbusters, they do have some hard hitting journalism being conducted. Just recently they had a [scathing exposé about the mass media in Vancouver, BC](http://web.archive.org/web/20131014014421/http:/www.adbusters.org/the_magazine/73/The_Death_of_Canadian_Journalism.html). Damn scary, if you ask me.\n\nAlso, their recent coverage of [São Paulo](http://web.archive.org/web/20131014014421/http:/www.adbusters.org/the_magazine/73/So_Paulo_A_City_Without_Ads.html)'s decision to remove all of their outdoor advertising is a very soothing concept that I wish most cities in America would adopt.\n\n"
    },
    {
      "time": "13 Dec 2007 — 1:47pm",
      "content": "Nice article about the Vancouver paper. Maybe a bit personal. Reminds me of working in college textbook publishing and watching the politics—when Mankiw was still an author.\n\n"
    },
    {
      "time": "13 Dec 2007 — 5:56pm",
      "content": "Hmm...so adbusters makes money from their magazine but are they allowed to advertise like a typical ad as their own or is that illegal? Who came up with the idea anyway? What role do they play in advertising? Surely, they must put consumers off or am I wrong? Is it for sarcastic perposes only or is there something deeper to it than that?\n\nAlso, what is the difference between the first manifesto of 1960's and that of 2002?  \nPS was it Garland (I am not aware of the surname, please can someone enlighten me) who designed the 1960's version? Thank you.\n\n"
    },
    {
      "time": "13 Dec 2007 — 6:21pm",
      "content": "Word of mouth or viral advertising has been around.. well probably since humans gained the ability of speech. Marketing of ones skills or wares started before the invention of the printing press and will live on long after it becomes obsolete.\n\nI find the whole anti-advertising/commercialism argument pretty ridiculous. When was the last time you blacked out after watching tv commercials and woke up with 50 boxes of Tide detergent? Advertising helps us decide. Nothing more.\n\nUnless we're talking about kids and cigarette ads or something bad like that. In which case I agree.\n\n"
    },
    {
      "time": "13 Dec 2007 — 9:43pm",
      "content": "_Advertising helps us decide. Nothing more._\n\nAdvertising imposes a lot of stupid and uninvited dreck on my consciousness that i would rather not have there.\n\n-=®=-\n\n"
    },
    {
      "time": "14 Dec 2007 — 1:07am",
      "content": "missgiggles, it was Ken Garland who published the manifesto back in 1964.\n\n"
    },
    {
      "time": "14 Dec 2007 — 6:11am",
      "content": "Thank you Crappo :)  \nJames & Don: Does Adbusters magazine carry advertising or not? James said it does, Don said it does not. Erm...err...\n\n"
    },
    {
      "time": "14 Dec 2007 — 7:03am",
      "content": "<cite>Also, what is the difference between the first manifesto of 1960’s and that of 2002?</cite>\n\n<cite>James &amp; Don: Does Adbusters magazine carry advertising or not?</cite>\n\nGiggles, you need to get off your duff and do some research in a library. I happen to know that the UK is full of them. Hell, you don’t even need to do that to compare the FSF manifestos—they’re both online.\n\n"
    },
    {
      "time": "16 Dec 2007 — 2:35pm",
      "content": "_do some research in a library_\n\nor failing that at least buy a copy of Adbusters.\n\nI once bought Adbusters religiously, and I can tell you right now that the majority of activities in it are designed to make the activist feel good about themselves and be seen to be \"making a difference.\"\n\nThey rarely make a difference.\n\n"
    },
    {
      "time": "16 Dec 2007 — 2:48pm",
      "content": "^ not shopping for entertainment and not driving around or taking airplane trips=not very glam. Kinda reminds me of those foolish truth spots for not-smoking.\n\n"
    },
    {
      "time": "16 Dec 2007 — 3:29pm",
      "content": "The big problem I have with Adbusters is that I never know when it starts. In a real magazine, you have 30 pages of ads, then the index, another 30 pages of ads and then content.\n\nWhen your content IS ads, then I'm kinda lost. It's not until about half-way through the magazine when it gets to the actual editorial content that I have realized that I'm finally reading something.\n\nBut, you gotta love a product that says, \"Buying stuff and marketing stuff is bad!\" When if they lived by their own premise, they would collapse under their own anti-commercialist stance.\n\n"
    },
    {
      "time": "16 Dec 2007 — 5:41pm",
      "content": "Not shopping for entertainment, not owning multiple cars etc are all fine good ideas that I fully support. I grow all my own food, generate much of my own energy, and have never had a licence. I'm referring more to the militant attitude they promoted with activities such as scattering fake broken glass on roads, tagging shop fronts, stink bombings etc. In my experience they're not an effective way to reach people.\n\nIn the end Adbusters are still selling a lifestyle, and by and large are preaching to the converted, or bored, rich, white kids who have latched onto what was the latest popular cause.\n\n"
    },
    {
      "time": "17 Dec 2007 — 8:38am",
      "content": "Tell...I agree with you. That tends to be the issue with a lot of the movements ala PETA or Greenpeace or the like. Good intentions, but a faction of those intentions manifest themselves into rather obnoxious and ill-conceived actions that puts a lot of people off.\n\nThat said, at least in the US, we tend to live in an increasingly polarized world where those that partake in the issues tend to trend to one extreme or the other.\n\nI'd like to seem something happening more in the middle, but perhaps we're all too busy working to pay for the crap we buy that no one has had the time to put effort into that realm. ;o)\n\nI can say the more I watch Nickelodeon with my Kids, the more I realize that there is \\*way\\* too much advertising in our society and that it absolutely effects/influences us at a very young age. (And yea, I should just shut the TV off, but Spongebob is still fun to watch...)\n\n"
    },
    {
      "time": "17 Dec 2007 — 9:31am",
      "content": "I started a green marketing company in 1988, and tried to make a go of it for a couple of years.  \nI worked out a philosophy and practice that addressed the issue of creativity.  \nAs every ad should be, in essence, an environmental audit--reasoning why the product is justified or an improvement--there is no place for stretched benefits, i.e. claims and promises which have nothing to do with the product's environmental impact.  \nFor instance, a celebrity endorsement or a suggestion that a car will give the consumer sex appeal or social status.  \nThat challenged a lot of the notions of creativity which exist in advertising, making it quite restricted.  \nAs well as \"non-creative\" ads, it was also hard to get clients to buy into the idea that, for instance, smaller ads were better. Creatives, of course, like big ads with white space.\n\nI came to the conclusion that the traditional business qualities advertisers look for in an agency are the be-all and end-all: price, quality (includes creativity), and service, and called it a day in 1990, by which time the green buzz of the late '80s was fading and digitization was capturing everyone's imagination. No doubt I could have kept at it longer if I'd been a better salesman.\n\nThere are a small number of green and pro bono agencies, and they will remain a small number. Some environmentally-favorable practices occur in the industry, notably to do with materials used, but that doesn't address the central issue of consumption-stimulation, and the role played by \"creativity\" in hyping it.\n\nThere is only so much that business can do, because its bottom line is the bottom line.  \nIt's up to governments to regulate consumption--in the aggregate, citizens and corporations have too much self-interest to make much of a difference individually, despite the best efforts of a green minority.\n\n"
    },
    {
      "time": "17 Dec 2007 — 12:44pm",
      "content": "Nick...nice post. Good food for thought.\n\n"
    },
    {
      "time": "17 Dec 2007 — 1:16pm",
      "content": "Nick - Green is back. It's amazing how many full page ads I'm seeing in the paper for \"Green shopping\" which seems like such an oxymoron to me.\n\nReminds me of a book my company published in the very early 90s on Global Warming, which nobody bought. Way before its time unfortunately, nobody got it then.\n\n"
    },
    {
      "time": "17 Dec 2007 — 1:56pm",
      "content": "an agency in kansas city -- willoughby and associates -- is making a name for themselves as being green _and responsible._ i remember their holiday card last year listed various things that we, as designers, could do to change our thinking, and the card was, itself, recyclable as wrapping paper.\n\n"
    },
    {
      "time": "17 Dec 2007 — 2:40pm",
      "content": "\"“Green shopping” which seems like such an oxymoron to me.\"\n\nIt is. Just like 'organic corporate farming'. We consumers are such suckers. ;o)\n\n"
    }
  ]
}
