{
  "id": "40016",
  "title": "Fonts for Visual Basic",
  "forum": "Build",
  "tags": [

  ],
  "content": "Anything special to think of to make a font work fine in Visual Basic, or should a standard OTF or TTF work fine? Naming procedures etc?\n\nThe font contains only one symbol.\n\nAnyone with knowledge like this?\n\n [‹ Word randomly using OOT ligatures in OS X 10.5](http://web.archive.org/web/20080414165856/http:/www.typophile.com/node/40064 \"Go to previous forum topic\") [Zero-Width Combining Diacritics ›](http://web.archive.org/web/20080414165856/http:/www.typophile.com/node/39916 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080414165856/http://www.typophile.com/user/11526\" title=\"View user profile.\">Goran Soderstrom</a>",
  "time": "<br>",
  "uid": "11526",
  "comments": [
    {
      "time": " 12.Dec.2007 12.01pm",
      "content": "What do you mean ’work in visual basic’? Visual basic is a programming language. Are you referring to rendered interfaces? Visual studio?\n\n"
    },
    {
      "time": " 12.Dec.2007 1.01pm",
      "content": "To be honest, I don‘t know what Visual basic is, more than that I am going to do a font that somehow is compatible with Visual Basic, so one can use the font when using(?) Visual basic.\n\n"
    },
    {
      "time": " 12.Dec.2007 1.49pm",
      "content": "It sounds like you want to make sure that the symbol contained in your font can be rendered/displayed by an application written in Visual Basic.\n\nIf that’s the case, then yes, a standard OTF or TTF should work just fine.\n\n"
    },
    {
      "time": " 12.Dec.2007 2.37pm",
      "content": "Well, that’s like saying ’make a font work in English’. Since Visual Basic is a programming language written in English, as long as you have all the standard english characters, you’ll be fine.\n\nThat said, I’m curious as to where this goal/request came from. I can’t say I’ve ever felt a need to have a font just for use with my visual basic programming ;o)\n\nOtherwise, if you mean ’rendered via a VB application’ I guess that depends on the type of application. If it’s a windows app, then you’d need a font compatible with windows. If it’s a web app, though, then that’s really not applicable.\n\n"
    },
    {
      "time": " 13.Dec.2007 2.13am",
      "content": "Yes, rendered by an application written in Visual Basic must be the goal here.\n\n"
    },
    {
      "time": " 13.Dec.2007 6.37am",
      "content": "Well, I suppose the simple answer is ’no’ there’s really nothing special you need to think about. It’s going to use the standard font formats that windows uses.\n\n"
    },
    {
      "time": " 13.Dec.2007 8.42am",
      "content": "Thanks for supporting me here.\n\n"
    }
  ]
}
