{
  "id": "40026",
  "title": "Alternative to Georgia",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Looking for suggestions as alternatives to Georgia, for use on da web. I like Georgia for body text. But I'm wondering if there are any other serif typefaces that, like Georgia, are excellent for body text on screen.\n\nMy plan would be to specify Georgia as a value of my font properties, but also include some unique serif typefaces that some folks just might have installed on their system... Just for fun.\n\nAdditionally, I assume that if one were to install Vista on one's Mac, one would be installing the new Vista typefaces. True?\n\n",
  "author": "hellojon",
  "time": "12 Dec 2007 — 12:36pm",
  "uid": "7075",
  "comments": [
    {
      "time": "12 Dec 2007 — 8:25pm",
      "content": "Faces bundled by Adobe, Apple and Microsoft would be most likely to be installed on many computers.  \nTypographers and graphic designers might appreciate old style faces such as Minion and Adobe Garamond.\n\n"
    },
    {
      "time": "13 Dec 2007 — 4:28am",
      "content": "I tend to specify one of the new MS faces before Georgia on most projects. Constantia and Cambria are great little faces.\n\nI certainly wouldn't recommend anything like Minion - far too much chance of it looking awful.\n\n"
    },
    {
      "time": "13 Dec 2007 — 10:46am",
      "content": "I'm going to at least test Minion. I'm curious...\n\n"
    },
    {
      "time": "13 Dec 2007 — 12:03pm",
      "content": "IMO, Minion looks fine in Safari on a Mac, which is the environment you'd expect to find it installed on, and the user-base who would be inclined to appreciate an alternative to Georgia, Palatino and Times.\n\n"
    },
    {
      "time": "13 Dec 2007 — 2:54pm",
      "content": "<cite>which is the environment you’d expect to find it installed on</cite>\n\nSo, Adobe has ceased to sell its products for Windows? Must have missed something …  \n;°)\n\n"
    },
    {
      "time": "13 Dec 2007 — 4:59pm",
      "content": "I don't know. Minion doesn't look right. I assumed it would look like Minion pushed into an environment in which it doesn't feel comfortable. And that's how I perceive it. I wonder whether this is because I'm so accustomed to seeing Georgia work well, or if I'm just used to seeing Minion on paper.\n\nThere should be more Georgias in the world. I'm curious to see those MS faces in my browser...\n\n"
    }
  ]
}
