{
  "id": "40034",
  "title": "Suggestions on Serifs that will compliment Chalet(in my new logo).",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello everyone,\n\nI don't post very often, but have a great deal of respect for the many knowledgeable and insightful members here. I hope some of you can provide good suggestions and feedback for this project of mine.\n\nI have a logo which features Chalet for the type, and I'm trying to find a Serif for headings (and possibly body) to properly compliment it. I guess I'm just trying to achieve a proper balanced look, since the logo type is so distinctive.\n\nAny advice/suggestions are much appreciated, as well as any criticisms on the logo itself. The logo is very much a work in progress, and I attempted some small modifications to the type (for the lowercase u and a).\n\n[Chalet Fonts](http://web.archive.org/web/20140531075937/http:/www.houseind.com/index.php?page=showfont&id=4&subpage=viewfontspecimens)\n\nCheers\n\nEDIT: I'm thinking a slab serif of some variety. Any thoughts? I saw [http://www.myfonts.com/fonts/linotype/pmn-caecilia/](http://web.archive.org/web/20140531075937/http:/www.myfonts.com/fonts/linotype/pmn-caecilia/ \"http://www.myfonts.com/fonts/linotype/pmn-caecilia/\") suggested in another thread.\n\n| Attachment | Size |\n| --- | --- |\n| [Early logo test](http://web.archive.org/web/20140531075937/http:/typophile.com/files/sc_test.jpg) | 40.32 KB |\n\n",
  "author": "Trevor Curtis",
  "time": "12 Dec 2007 — 4:09pm",
  "uid": "19243",
  "comments": [
    {
      "time": "12 Dec 2007 — 6:18pm",
      "content": "Hi Trevor,\n\nI'd probably suggest using something a little understated compared to Chalet. Have you seen MVB Verdigris? (But, I guess I might see Caecelia being used too.)\n\nAs for you logo. I don't mind the change to the lowercase u, but the serif on the lowercase a isn't smooth enough. In addition the u serif seems more rounded while the a is more attached.\n\n"
    },
    {
      "time": "12 Dec 2007 — 7:35pm",
      "content": "Hey Trevor,\n\nI agree with Miss T. There's a lot going on the mark already, so choose something simple. In fact I'd be inclined to stick Chalet, but one of the less ornate cuts.\n\nWith the logo itself, I'd probably lose the gradient fade in the separating line, you don't need it. And yep, the little hair flip on the a needs a little smoothing.\n\n"
    },
    {
      "time": "12 Dec 2007 — 9:38pm",
      "content": "Thanks for the input. It's hard to find good constructive criticism these days :)\n\nI hadn't heard of Verdigris, and it looks like another contender. I've done a few quick tests with Caecelia, and it seems to go quite well with the logo type. It's my current favourite.\n\nA lot of my content will be web-based, so that's definitely a concern when choosing fonts. I'm happy to use SIFR for headings and very brief paragraphs.\n\nI'll take a look at implementing those logo improvements.\n\nAttached is one of the Caecilia tests:\n\n ![](http://web.archive.org/web/20140531075937im_/http:/typophile.com/files/test2_4005.jpg)\n\n"
    },
    {
      "time": "12 Dec 2007 — 9:50pm",
      "content": "I think Caecelia works. However isn't Caecelia a Linotype font? Their EULA doesn't allow for web embedding. What about Adobe's [Chapparal](http://web.archive.org/web/20140531075937/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1718)?\n\n"
    },
    {
      "time": "12 Dec 2007 — 10:38pm",
      "content": "Caecilia is Lino, yeah. I wasn't aware SIFR would violate their EULA. This is their section on embedding:\n\n<cite>1.5 Embedding of the Font Software into electronic documents or Internet pages is only permitted under the absolute assurance that the recipient cannot use the Font Software to edit or create a new document (read-only). It must be ensured that the Font Software cannot be fully or partially extracted from said documents.</cite>\n\nThere's so many flash-based websites that feature commercial fonts. I would've assumed SIFR is no different, unless of course all those flash sites have broken the EULA too :)\n\nIt turns out I have Chapparal (does it comes with the Adobe apps?). It looks good, but not as nice as Caecilia. The bold weight is also way too heavy.\n\nI'm consulting Mr. Google for some clarification on the licensing thing.\n\nEDIT: I was just comparing Caecilia and Chapparal a bit more. Caecilia is definitely the winner. Even if I don't use it here, I'll keep it in mind for other projects. It's quite impressive.\n\nDo you think [Freight Micro (book)](http://web.archive.org/web/20140531075937/http:/www.garagefonts.com/typespecimens_2.html?sku=GF060016X1P2&start=1) would be an option? In a world without Typophile, that's probably what I would've ended up choosing. It's so expensive.\n\n"
    },
    {
      "time": "12 Dec 2007 — 10:50pm",
      "content": "Freight Micro could be a nice choice. Since you seem to be interested in humanist slab serifs, take a look at the ones I posted in [this thread](http://web.archive.org/web/20140531075937/http:/www.typophile.com/node/38605). Silica is my personal favorite out of them, although the lack of an italic may make it a no-go. TheSerif is probably the closest you can get to Caecilia without being Caecilia.\n\n"
    },
    {
      "time": "13 Dec 2007 — 9:59am",
      "content": "Well now there is a hole in my research. Where did you find that information?\n\n"
    },
    {
      "time": "13 Dec 2007 — 10:27am",
      "content": "The colour scheme and shape of the mark immediately made me think of the Firefox logo.\n\n- Lex\n\n"
    },
    {
      "time": "13 Dec 2007 — 6:09pm",
      "content": "Miss Tiffany:  \nHere it is: [http://www.linotype.com/2061-20496/licenseagreementforfontsoftware.html](http://web.archive.org/web/20140531075937/http:/www.linotype.com/2061-20496/licenseagreementforfontsoftware.html \"http://www.linotype.com/2061-20496/licenseagreementforfontsoftware.html\") I'm assuming that's a correct/current EULA. Personally I wouldn't hesitate to use any fonts I own in flash files. If a foundry wants to get fussy and send me a letter, I'll happily switch to another font/foundry. I asked a few designers and they agreed that flash is flash, regardless of whether it's a spinning logo or SIFR ;) Obviously, I'll still take every reasonable precaution to ensure people can't rip the fonts or characters.\n\nAuricfuzz: Thanks for that. I like Silica too, but it doesn't seem to mesh as well with Chalet. TheSerif looked nice, very similar to Caecilia.\n\nLex: To some extent I agree, but I believe the concept is different enough that it should be fine. A large selection of my clients helped choose the logo from several options. I'm still working on ways to build a brighter/happier looking site around it. I don't want everything appearing too dark and dreary.\n\nA quick experiment with colour:\n\n ![](http://web.archive.org/web/20140531075937im_/http:/typophile.com/files/test2_6631.jpg)\n\n"
    }
  ]
}
