{
  "id": "40035",
  "title": "Rules of Letterspacing",
  "forum": "Design",
  "tags": [

  ],
  "content": "I recently saw the logo for a new condo going up in Seattle, and given that I was standing 3 feet away from it, I couldn’t read it. When I stepped back a bit, I glimpsed this little fellow:\n\n ![](http://web.archive.org/web/20080905135355im_/http:/www.typophile.com/files/untitled_6660.JPG)\n\nThe letterspacing is hugemungously wide, too the point that I couldn’t read it on the fence I was walking by. (Interesting name, considering the topic though...)\n\nIs there any kind of rule, other than the Mach 1 Eyeball, for how wide is too wide? I mean, seriously, an EM space is too much.\n\nWhat do you think?\n\n [‹ To superscript or not to superscript](http://web.archive.org/web/20080905135355/http:/www.typophile.com/node/39940 \"Go to previous forum topic\") [Alternative to Georgia ›](http://web.archive.org/web/20080905135355/http:/www.typophile.com/node/40026 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905135355/http://www.typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": " 12.Dec.2007 4.58pm",
      "content": "Not that you are wrong. This is quite wide, but it depends upon whom they really want to be able to read it. For someone driving by, at a distance, this wouldn’t appear near as wide as it did to you.\n\n(edit: I said “aren’t”, but I meant “are”.)\n\n"
    },
    {
      "time": " 12.Dec.2007 5.12pm",
      "content": "But at that far away, the “l o f t s” type-size would then be verging on too small anyways, wouldn’t it?\n\n"
    },
    {
      "time": " 12.Dec.2007 5.15pm",
      "content": "I’m thinking it is like watching a TV that is set up for HD, but the television show itself doesn’t fit the ratio so you stretch it to fit. But, then you watch the TV from an angle, say from the kitchen, and the perspective is corrected. Someone driving past won’t ever see it from straight on so the spacing won’t be as wide.\n\nAnyway, at face value the spacing is too wide. Another example of something being designed without be tested in the environment or at final sizes. IMHO\n\n"
    },
    {
      "time": " 12.Dec.2007 6.32pm",
      "content": "Also, the letters look distorted, as if they had been stretched?\n\nChrisL\n\n"
    },
    {
      "time": " 12.Dec.2007 7.08pm",
      "content": "(not the same veer, I take it?)\n\nI guess if the intention is to get you to slow down your reading speed, so you pay attention and then think about it later, they’ve succeeded.\n\n... It does looks like proportionally distorted letters!!!!!!!!!!!\n\nBy God, Chris, if you’re right I’ll NEVER buy a condo from those people!.\n\n-=®=-\n\n"
    },
    {
      "time": " 12.Dec.2007 7.22pm",
      "content": "_if the intention is to get you to slow down your reading speed, so you pay attention and then think about it later_  \nOn a road sign in a heavy traffic area? Brilliant!\n\n"
    },
    {
      "time": " 12.Dec.2007 8.24pm",
      "content": "Hey, they want to sell you condos - not win you a good driver citation :¬_)_\n\n(while you are waiting for the tow truck and fumbling in your wallet for ID to show the nice officer, you’ll be thinking _“Say... That V - E - E - R place looks pretty darn swell.”_)\n\n[|:¬)|||\n\n-=®=-\n\n"
    },
    {
      "time": " 13.Dec.2007 5.55pm",
      "content": "\\> Also, the letters look distorted, as if they had been stretched\n\nPerhaps this was designed, based on the angle of view from the road from a stop sign or something. From a sharp angle extended characters and wide letterspacing will look more natural.\n\n"
    },
    {
      "time": " 13.Dec.2007 8.12pm",
      "content": "I think you give them too much credit, Don.  \n-=®=-\n\n"
    }
  ]
}
