{
  "id": "40046",
  "title": "tracking in Garamond",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hi, i´m a novel designer from Spain (that´s because i cannot express myself good enough in english...sorry) and i´m making a book with another friend.  \nI have some questions about the “tracking” and i was trying to get some information about it but i couldn´t find a good answer.  \nI´m using Garamond to compose the main text (wit InDesign) and i´m not sure about how “long” should be the space between the letter in a line.  \nI know, it depends of the type (Garamond in this case) and the size that i´m using but i cannot find any kind of table with the standard meassures and i´m don´t know, how i should do it. Should i just print the text and see if i have too much space in each line between the words (as i do) or there is some special rules for that, or for the Garamond type?.\n\nThanks a lot and excuse me if the question is stupid; it is difficult to find help in spain about it.\n\n [‹ Calgary: December meeting](http://web.archive.org/web/20071215144405/http:/typophile.com/node/40042 \"Go to previous forum topic\") [Hooray, 40000! ›](http://web.archive.org/web/20071215144405/http:/typophile.com/node/40000 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071215144405/http://typophile.com/user/25004\" title=\"View user profile.\">pantalondepana</a>",
  "time": "<br>",
  "uid": "25004",
  "comments": [
    {
      "time": " 13.Dec.2007 3.52am",
      "content": "¡Hola Ignacio!\n\n<cite>Should i just print the text and see</cite>\n\nThat sounds like a _very_ good idea to me. Look (and _read_ !), and you’ll see.\n\n<cite>the space between the letter</cite>  \nDo you mean between the words? They should be even, not too tight and not too wide (most often, the latter is the problem).\n\nOr are you talking about the spaces between the letters? When working with a good font (that is in this case, a font with well-done spacing and kerning), there usually is no need to mess around with that.\n\n<cite>I’m using Garamond</cite>\n\nWhich one? There are [thousands](http://web.archive.org/web/20071215144405/http:/www.myfonts.com/search?search%5Btext%5D=garamond)!\n\nF\n\n"
    },
    {
      "time": " 13.Dec.2007 4.32am",
      "content": "hi, thanks for your fast answer!,\n\nexcuse me, i was talking about the space between words in a line, not betwenn two letters...you are right.  \ni´m working with garamond regular(i dont know exactly which one...sorry) and the question was about the tracking; in InDesign i used 25 pt. for the tracking and after two prints i´ve noticed that it was toooo much space between two words and that´s because i reduced it to 0. But now i´m not sure about it and i ask me if there is some special rules about the kerning for text in books, or if the typographer has to check the text and decide, how long should be the space.  \nI mean, it sounds maybe stupid, that i don´t know such things but i´ve read in somebook, that there is some information about the tracking for each type and i would like to know more about it.\n\nthanks again!!!\n\n"
    },
    {
      "time": " 13.Dec.2007 5.44am",
      "content": "Normally you will use tracking at 0 for text. Places where you might use tracking include when using small caps for folios or headings set entirely in true small caps, for instance. In display settings you might want to use a small amount of negative tracking.\n\n"
    },
    {
      "time": " 13.Dec.2007 7.52am",
      "content": "<cite>Normally you will use tracking at 0 for text.</cite>\n\nI have to disagree with you there. At text sizes Indesign sets type a little uncomfortable much of the time, and serif faces usually need five to ten units of tracking to get some nice color, whereas serifs need similar amounts of negative tracking. If you get really lucky a designer will even suggest tracking values in the specimens/manuals for fonts, as Sumner Stone does. Erik Spiekermann [explained it in a little more detail a while back](http://web.archive.org/web/20071215144405/http:/www.spiekermann.com/mten/2004/03/).\n\n"
    },
    {
      "time": " 13.Dec.2007 8.40am",
      "content": "<cite>Erik Spiekermann explained it in a little more detail a while back.</cite>\n\nDo you refer to this?\n\n<cite>Text is usually set too tightly and with too big a wordspace. One of the legacies of Quark Xpress. Always set the optimum wordspace (under H&amp;J) to 80% or less in unjustified setting. And increase tracking by at least 2 units (that’ll be 10 in InDesign) for sizes under 12 pt. If that makes the copy run too long, simply decrease the size by 0.1 or 0.2 pt. That actually increases space between lines (aka leading) and by giving the type a little more room to breathe, makes<br>\na more legible even though it’s a little smaller.<br>\nDon’t open tracking for my new typeface, FF Unit, as i have designed it to be generous at small sizes.</cite>\n\nTo me, the last sentence is the most important one.  \nUse good fonts, and you don’t have to fiddle around (a lot). This totally depends on the font, the size, the medium and the application (ES doesn’t explicitly name those applications just for the fun of it).  \nAnd no, FF Unit is not the only font that has been made with caution.\n\nKeep in mind that this has been written in 2004 – some things have changed since then, fortunately – a lot of superb text fonts (i.e. fonts, not typefaces) are quite young (yes, we are spoiled OpenType kiddies, aren’t we?).\n\nHave a look at this sample:  \nTwo [optical sizes](http://web.archive.org/web/20071215144405/http:/typophile.com/wiki/optical%252Bsize) of Garamond Premier Pro, by [Robert Slimbach](http://web.archive.org/web/20071215144405/http:/typophile.com/wiki/Robert%252BSlimbach)/Adobe:\n\n ![](http://web.archive.org/web/20071215144405im_/http:/typophile.com/files/gpp_4554.png)\n  \nSame nominal value, different size and spacing.  \nTrue, smaller sizes tend to need more space. But you don’t necessarily have to manually assign that in your application, it could already be in your font(s), too.  \nThere are no absolute rules that fit for _all_ situations. Use your eyes. ;°)\n"
    }
  ]
}
