{
  "id": "40047",
  "title": "West Hams Sans",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I attach two images of something I am working on and I really need your opinions.\n\nLegible from a distance?\n\nEven colour?\n\nAny strokes look too fat or thin compared to the rest?\n\nDo any curves look strange?\n\nAny letterforms 'out of place'?\n\nWhat characters don't sit next to each other well?\n\nThanks in advance, Tom\n\n| Attachment | Size |\n| --- | --- |\n| [characters.pdf](http://web.archive.org/web/20150416161715/http:/typophile.com/files/characters_0.pdf) | 33.82 KB |\n| [names.pdf](http://web.archive.org/web/20150416161715/http:/typophile.com/files/names.pdf) | 26.21 KB |\n\n",
  "author": "tomhowe",
  "time": "13 Dec 2007 — 4:52am",
  "uid": "14955",
  "comments": [
    {
      "time": "13 Dec 2007 — 5:55am",
      "content": "M N W look out of place and look too heavy.  \nR and K legs to relate more.  \nI would also have tried to balance the widths of the H N U characters.  \nThe LJ combination in LJUNBERG looks a tricky one, particularly from a distance.  \nGenerally spacing needs some work and attention.\n\nMalcolm\n\n"
    },
    {
      "time": "13 Dec 2007 — 6:31am",
      "content": "I wouldn't waste your breath with Dyer... he'll never get himself fit!\n\noff the bat, the Y seems a bit tall, the Z falls a touch to the left, and the flick on the U seems arbitrary. The X is way too wide. The W looks like a reflection of the M?\n\n"
    },
    {
      "time": "13 Dec 2007 — 6:32am",
      "content": "by tall, I meant that the join in the two diagonals is uncomfortably high.\n\n"
    },
    {
      "time": "13 Dec 2007 — 6:59am",
      "content": "Hi Tom,\n\n_Legible from a distance?_  \nyep\n\n_Even colour?_  \nN, Y and W too heavy, A slightly heavy, M functional but lacks stylistic integration\n\n_Any strokes look too fat or thin compared to the rest?_  \nN verticals and joints, joints at baseline of W\n\n_Do any curves look strange?_  \nnothing overtly strange, but \"wierd is good\" in the sense that a lot more can be done with the curves you've got. There's a tameness and repetition that leaves a feeling you are holding back something more interesting. For example, the asymmetric theme used on E, F, L could be applied to the curves of C, G, O, Q, P, R, S---a faint wiff of Revue.\n\n_Any letterforms ’out of place’?_  \nN structure/style and heaviness, same for W\n\n_What characters don’t sit next to each other well?_  \nneed to see more combinations, set words. N and W fail to integrate with most others.\n\nj a m e s\n\n"
    },
    {
      "time": "13 Dec 2007 — 7:31am",
      "content": "Luke, Dyer's going to come good and when he does we'll be challenging for top 6!\n\nThanks for the input guys, I will be looking at sorting it out and then I will post back soon.\n\nThanks, Tom\n\n"
    },
    {
      "time": "13 Dec 2007 — 10:07am",
      "content": "I agree with most of James' comments. The W shouldn't be a mirror image of the M -- start from the V to build the W. And M and W are too dark. What if the center point of the M didn't descend all the way to the baseline? Take the diagonals from the Y and put them in the M.\n\nAlso, the 4 is too narrow.\n\nNow I want to see some lowercase. :)\n\n-matt\n\n"
    },
    {
      "time": "21 Dec 2007 — 9:35am",
      "content": "This is a great start. I'm excited to see some lowercase as well.\n\n"
    }
  ]
}
