{
  "id": "40059",
  "title": "On 'Commercial products'",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "G'day guys, merry Christmas,\n\nSomething's been bugging me for a while EULA-wise and I haven't found anything quite explicit enough on Typophile to answer my question, so forgive me if it's been covered in depth before.\n\nMy current understanding of 'commercial product' is that it is something which keeps on generating revenue every time it's sold, like an ebook or magazine. Am I right to assume that a set of information leaflets which I sell to a client on PDF, for which he pays me, but which he is going to distribute free is not a 'commercial product'? What is the protocol here? Do I warn him of the licensing obligations the fonts carry and that these pdfs are not to be sold? What if he sells them in the future (not likely but concievable) am I liable?\n\nOne more question, if I am paid to make electronic advertising brochures which market a product or service but which are distributed freely, is this now a commercial product?  \nblah, blah blah EULA EULA EULA, I know, I know, but it's just been bugging me  \ncheers and thanks\n\n--N\n\n",
  "author": "nicholasgross",
  "time": "13 Dec 2007 — 3:22pm",
  "uid": "9500",
  "comments": [
    {
      "time": "13 Dec 2007 — 5:17pm",
      "content": "My understanding is that if the client has licensed the font they can use it in print in PDFs etc. A 'commercial product' would be something that makes letters or makes use of them - like a machine metal type - or cloth or paper letters - or an automatic engraving tool. Also a phone, or computer or ebook reader would be making use of the font in the same way. So Commercial product would be something that isn't using the font once ( like a newspaper) but is insteading using the font in an ongoing generative manner.\n\nOf course some fonts are not supposed to be embedded in a PDF - just outlines is okay (but won't render as well or as quickly).\n\nOther folk? What do you say?\n\n"
    },
    {
      "time": "13 Dec 2007 — 5:34pm",
      "content": "If the EULA allows beyond internal business embedding, and if the EULA doesn't have some kind of limit set to how many impressions can be made, and if the EULA allows for online distribution, then you client can share that PDF without needing an extended license.\n\nYou are correct though that if you were creating a PDF which your client would then turn around and sell in some way, some EULA regard that as a Commercial Product. However, some EULAs also regard rubber stamps, alphabet stickers, etc. as a Commercial Product.\n\nWhich foundry's EULA are your trying to decode?\n\n"
    },
    {
      "time": "13 Dec 2007 — 8:59pm",
      "content": "Thanks guys, I think it's Monotype/linotype which I think may specify internal business use only. So are you saying that the PDF I make for which I charge my client but whcih he doesn't sell is a commercial product/ or illegitimate? I guess I have understood internal business use to be the opposite of commercial product, so I guess I thought, well if it's not commercial product it must be internal business use. Miss tiffany, I know you've done a lot of work on this, thanks for your help.\n\nEben, I didn't think it was so much the nature of the font being used to generate new copies so much as charging for these generated copies, am I wrong?\n\n--N\n\n"
    },
    {
      "time": "13 Dec 2007 — 10:02pm",
      "content": "No. You may give your client a PDF. That is within the standard EULA and is fair use. AFAIK Your client can also give away that PDF to clients of his. I do not recall their EULA saying anything about needing extended licensing for that.\n\nThey say: _1.5 Embedding of the Font Software into electronic documents or Internet pages is only permitted under the absolute assurance that the recipient cannot use the Font Software to edit or create a new document (read-only). It must be ensured that the Font Software cannot be fully or partially extracted from said documents._\n\nThere is no mention of not giving your client a PDF that they will in turn use to give to their clients.\n\nI'm paranoid. What I would do is set the preferences in the PDF to no allowance for Changing the document, assembly of the document, content copying, page extraction, commenting, etc. Do you have Acrobat Pro?\n\n"
    },
    {
      "time": "13 Dec 2007 — 10:13pm",
      "content": "I should add, just to be safe, that I'm not a lawyer and the best thing you can do is contact Linotype. They would be happy to make anything clear. Dan Reynolds used to work (still works? is on sabbatical?) for Linotype. He's a moderator here. He might be able to back up or correct my statements. :^)\n\n"
    },
    {
      "time": "13 Dec 2007 — 10:56pm",
      "content": "I think that no matter what the EULA may or may not say that if you do graphic design for a living & you have licensed a font you can create with the use of Outlines ( if embedding is not permitted) a PDF that may be sold as a finished product to the client. This is how for instance books are made. And Magazines. Somebody designs them ( maybe in house at the publisher's or not) and then they printed and sold. Now if you made a template that they could fill out with new content - say a book layout that could be customized or a Menu with a certain style and font ( add the dishes & prices ) and they resold that.... That's different. So - would that be a problem? Yes, but <cite>only</cite> if they don't have a font license. Or that's my understanding. I should add that it is an understanding I would not hesitate to act on.\n\n"
    },
    {
      "time": "14 Dec 2007 — 4:58am",
      "content": "I do work for Linotype, but I'm out of the office and out of the loop until next autumn. Whenever you have licensing-related questions about Linotype fonts, the best place to get answers in directly from Linotype. Our customer support team can be reached by e-mail at info (that symbol) linotype (period) com. There is also telephone and fax contact information on our website.\n\n"
    },
    {
      "time": "15 Dec 2007 — 3:30pm",
      "content": "Thanks very much guys!\n\nYeah, I'm paranoid too, I lock up everything that goes out externally and set printing to high res and changes to none etc. Eben thanks, making outlines is a good kind of failsafe, but it just does seem to bloat the files out to what seems like unreasonable sizes, also (less of a problem) some desktop printers seem to render outlined text a bit thicker.\n\nThanks Dan, I appreciate you're on a break! Enjoy. I have contacted Monotype and Linotype in the past. What struck me was the great difference in my understanding from the legalese of the EULA and what they told me was OK. I was pleasantly relieved.\n\nThanks for all your help people. To be honest it feels very strange to be agonising over the details of law which affects most people but which most people would never consider for a second. It feels strangely like obsessive behaviour and as is the case with obsessive behaviours, a bit alienating also. This is simply a personal observation and not intended as a backhanded rebuke of EULAs.\n\n"
    }
  ]
}
