{
  "id": "40079",
  "title": "Ignorance is bliss?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was reading a book last night when it occurred to me that I didn’t know what font was used. Probably something basic like Times or Garamond. But I didn’t \\*know\\*.\n\nIt also occurred to me that I was glad I didn’t know, because if I did it might drive me to distraction. I might be thinking of the font, not the words I was reading.\n\nAnyone else find some truth in that?\n\n-Lindsay\n\n [‹ Fonts available in Mac and Windows browsers (new list)](http://web.archive.org/web/20080706083648/http:/www.typophile.com/node/40153 \"Go to previous forum topic\") [Hooray, 40000! ›](http://web.archive.org/web/20080706083648/http:/www.typophile.com/node/40000 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706083648/http://www.typophile.com/user/18714\" title=\"View user profile.\">lindsaydurango</a>",
  "time": "<br>",
  "uid": "18714",
  "comments": [
    {
      "time": " 14.Dec.2007 8.23am",
      "content": "Nope. Always think of the font. But the font only gets in the way when there’s a problem - font is too small, hard to read, ugly, no ligatures, bad H&Js.\n\n"
    },
    {
      "time": " 14.Dec.2007 8.57am",
      "content": "i always notice the font, too. but it really annoys everyone around me.\n\n_I might be thinking of the font, not the words I was reading._  \npatty’s right — although we may always think of the type (because, jeez, it’s what we do), the only time it’s a problem or interuptive is when the type has been used inappropriately or poorly. i would guess a horticulturist would look at a landscape, mentally noting the plants but appreciating the _garden._ but if something’s wrong, it might stick out leaving him distracted and wondering. “why are the ferns next to the cacti?”\n\n"
    },
    {
      "time": " 14.Dec.2007 9.08am",
      "content": "(I should clarify that I’m a designer that admires type, so my experience may be far different from people who work in type for a living. Maybe I’m in some kind of infant stage of typophilia, where every new thing grabs my attention.)\n\n"
    },
    {
      "time": " 14.Dec.2007 9.16am",
      "content": "If you’re a designer or typographer, or just interested in type, it pretty much goes with the territory that you’ll note the type used in anything you read, or try to figure it out if you don’t recognize it offhand. But as Patty says, this doesn’t interfere with reading unless the type (or the typesetting) is bad. My wife likes to test me: she’ll have a book out of a library, hand it to me, and ask me was the typeface is. But she will get annoyed when opens up something like an art book to a specific page and say’s “Look at this!” I study it carefully for a minute, then announce the body type is Monotype Baskerville and the captions are Gill Sans. She sighs. “The picture! What do you think of the painting?”\n\n"
    },
    {
      "time": " 14.Dec.2007 9.52am",
      "content": "IDK, I used to work as a copywriter and it ruined me on reading a bit.\n\nWe are a bit doomed to a profane appreciation of the things we do as craft/trade.\n\n"
    },
    {
      "time": " 14.Dec.2007 10.01am",
      "content": "Once in a while I won’t notice the typeface, but only if the content is particularly engrossing and the typography is competent without being flashy.\n\n"
    },
    {
      "time": " 14.Dec.2007 10.07am",
      "content": "I always find it relaxing and refreshing when I can read a book and not even notice the typography, where the words and the ideas just flow without thought or hesitation.\n\nWhich is the greatest achievement that good typography can attain to.\n\nBut when everything is set is ITC Garamond, I am immediately repulsed and only continue to read by concentrating _really hard_ on the content.\n\n"
    },
    {
      "time": " 14.Dec.2007 10.27am",
      "content": "So we have a little “ignorance is indeed bliss” and a little “I notice but it doesn’t get in my way.”\n\nCan I hear a “I notice, and it enhances my reading experience”?\n\nJust curious ;)\n\n"
    },
    {
      "time": " 14.Dec.2007 2.30pm",
      "content": "I don’t know that it enhances my reading experience per se—i.e. the absorption and understanding of the author’s message—but it does make me feel good when it’s clear to me that the book designer went to some trouble to choose a font really matches the subject matter and tone of the book.\n\n"
    },
    {
      "time": " 14.Dec.2007 4.24pm",
      "content": "I think it enhances my reading experience when comprehension rests on visible differences. When there’s a high frequency in a story of an inner voice set in italics, I consciously appreciate a face with a distinctive old-fashioned italic that keeps me from getting confused. I like it when manuals set off command terms from the text with an entirely different face. I like the bottomless timbre conjured in my mind when Death speaks in small caps.\n\n"
    },
    {
      "time": " 15.Dec.2007 8.42pm",
      "content": "An interesting and related question then would be—what typefaces do you find it easiest to ignore, that are so invisible the content alone speaks to you? I can think of a few in my case:\n\nTimes, Syntax, Lucida, Helvetica, Officina\n\n"
    },
    {
      "time": " 16.Dec.2007 1.05am",
      "content": "I’d have to agree with the Times, Lucida and Helvetica comments. These are (were) the three basic Windows/Mac system fonts/default web fonts and have been ingrained in my head since I was a mere padawan.\n\n"
    },
    {
      "time": " 16.Dec.2007 7.51am",
      "content": "The typeface and the way that it is used enhances my ’viewing’ experience and my desire to read or continue reading. Once I am immersed in the text, the visual experience becomes subliminal. If the writing sucks, I might then revert back to the visual by thinking, “Nice type, too bad the writing is so dull or taxing.”\n\nChrisL\n\nPS: Lindsay, “infant typophilia” sounds pretty serious! You had better consult your Pediatrician :-)\n\n"
    },
    {
      "time": " 18.Dec.2007 3.32am",
      "content": "Maybe “you read best what you read most”. Trough the years I’ve read so many books set in Simoncini Garamond—the default of most italian publishers—that I don’t notice it anymore. There are some book faces that are a bit distracting to me, like Perpetua and Electra—even when properly set—because I stop to read to look at the letterforms. I suppose it’s a very personal thing.\n\n"
    }
  ]
}
