{
  "id": "40074",
  "title": "PF Beau Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "After converting [PF Beau Sans](http://web.archive.org/web/20130819191829/http:/www.example.com/) (by Parachute) to outlines in Illustrator CS3, I noticed that it's forms are made up of very many points. Especially the V looks like it could be made with a lot less.\n\nI'm not a font designer, but isn't there a point to using as few points as possible in the design of a font?\n\nAnd is this an example of using too many points, or is there a reason for doing it this way?\n\nI'm now assuming that converting the font to outlines in illustrator will give approximatley the same points as those in the original design. Please correct me on this if I'm mistaken.\n\n ![](http://web.archive.org/web/20130819191829im_/http:/typophile.com/files/BEAU_crop_3901.gif)\n  \n\n ![](http://web.archive.org/web/20130819191829im_/http:/typophile.com/files/Bilde27_4843.jpg)\n\n",
  "author": "Jorg",
  "time": "14 Dec 2007 — 2:29am",
  "uid": "13107",
  "comments": [
    {
      "time": "14 Dec 2007 — 2:51am",
      "content": "That is very strange...\n\n"
    },
    {
      "time": "14 Dec 2007 — 3:16am",
      "content": "When you convert a font to outlines in Illustrator, Illustrator gives the curves a new point placement, i.e., this is not the way the fonts actually look in FontLab. You can't use this feature in Illustrator as a way to judge font outline quality, sorry :(\n\n"
    },
    {
      "time": "14 Dec 2007 — 4:48am",
      "content": "Good to know, Dan.\n\nStill it's kind of weird that the one side of the V has over 9 points while the other has only two. Of course a few more points are needed to get a slight decrease in the width, but not this many.\n\n"
    },
    {
      "time": "14 Dec 2007 — 5:53am",
      "content": "Hello Jorg,  \nAre you using a ttf font file or an open type font file?  \nMaybe this make the difference?\n\n"
    },
    {
      "time": "14 Dec 2007 — 6:13am",
      "content": "OpenType it is. Does it matter?\n\nHere is a detail from the V, which I also find quite weird.\n\n ![](http://web.archive.org/web/20130819191829im_/http:/typophile.com/files/Bilde32_3787.jpg)\n  \n\n ![](http://web.archive.org/web/20130819191829im_/http:/typophile.com/files/Bilde28_6732.jpg)\n\n"
    },
    {
      "time": "14 Dec 2007 — 7:04am",
      "content": "The OTF format can describe the shape of characters in either TrueType or PostScript formats.  \nTrue type format needs more points to describe the same shape of a glyph...  \nThat's why I'm asking...\n\n"
    },
    {
      "time": "14 Dec 2007 — 8:18am",
      "content": "Hi Jorg,\n\nI’m sorry to inform you but this is a hacked ttf copy of PF Beau Sans. Let me explain to you. Shortly after our site went up a few months ago it was hacked and somehow they managed to get several of our fonts but only the ttf versions which are used specifically online for generating the samples in the font test driver section. We acted immediately and now everything is well hidden but the damage was done. I’ve had a hard time managing illegal circulation of our fonts to a minimum. Our opentype fonts which are sold online including PF Beau Sans are optimized and each one of the characters is made up of just a few nodes (postscript bezier curves). On the other hand the ttf versions being truetype contain multiple nodes (as is the case with this one) which were generated when we converted the opentype into truetype simply for online testing. No hard feelings but I would appreciate you buying the font.\n\n"
    },
    {
      "time": "14 Dec 2007 — 8:51am",
      "content": "<cite>When you convert a font to outlines in Illustrator, Illustrator gives the curves a new point placement, i.e., this is not the way the fonts actually look in FontLab. You can’t use this feature in Illustrator as a way to judge font outline quality, sorry :(</cite>\n\nWhat? No, I have never experienced that they change in Illustrator. I did a double check and all the fonts I tested had exact point placements as they have in FontLab. The only difference is the type of nodes (Illustrator cant show the three type of nodes FontLab has).\n\nAdobe Jenson Pro in Illustrator:\n\n ![](http://web.archive.org/web/20130819191829im_/http:/typophile.com/files/illu_5735.png)\n\nAdobe Jenson Pro in FontLab:\n\n ![](http://web.archive.org/web/20130819191829im_/http:/typophile.com/files/fontlab_5361.png)\n\n"
    },
    {
      "time": "14 Dec 2007 — 9:14am",
      "content": "Thanks for the reply, Panos.\n\nI had no idea this was a hacked ttf copy of the font, as I believed it to be bought and licenced by my school. I'll make sure it's deleted, and have it properly purchased if anybody wants to use it.\n\nFor the sake of curiosity: If you (or anyone else) with the real version of the font could upload a screenshot of the curves of these letters (A and V), that would be very interesting.\n\n"
    },
    {
      "time": "14 Dec 2007 — 9:15am",
      "content": "Illustrator, and other vector programs, do their own things. This was discussed on Typophile years ago when Evert was still alive.\n\n[http://www.typophile.com/node/7740](http://web.archive.org/web/20130819191829/http:/www.typophile.com/node/7740 \"http://www.typophile.com/node/7740\")\n\n"
    },
    {
      "time": "14 Dec 2007 — 9:41am",
      "content": "Good link, Dan, very interesting thread with lots of nice digressions and arguments.\n\n"
    },
    {
      "time": "14 Dec 2007 — 10:26am",
      "content": "This is what you get when you convert PF Beau Sans Pro (opentype ps)  \nto outlines in Illustrator\n\n ![](http://web.archive.org/web/20130819191829im_/http:/typophile.com/files/BEAU_GAV_4013.gif)\n\n"
    },
    {
      "time": "14 Dec 2007 — 11:50am",
      "content": "Welcome to Typophile, Panos!\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2007 — 12:13pm",
      "content": "Thanks Chris, nice to be here!!\n\n"
    },
    {
      "time": "14 Dec 2007 — 12:37pm",
      "content": "Yes thanks for posting, Panos. You really have made some nice fonts, no doubt I'll be following the future releases from Parachute.\n\nKeep up the good work!\n\n"
    },
    {
      "time": "15 Dec 2007 — 2:54am",
      "content": "Panos, does that correspond to the original node placement in FontLab as discussed above?\n\n"
    },
    {
      "time": "16 Dec 2007 — 3:55pm",
      "content": "Yes, it does\n\n"
    },
    {
      "time": "17 Dec 2007 — 7:50am",
      "content": "Cubic\\_DS says:  \nThe OTF format can describe the shape of characters in either TrueType or PostScript formats.  \nTrue type format needs more points to describe the same shape of a glyph...  \nThat’s why I’m asking...\n\nIt is important to be very clear in the definition of OpenType. There are too many myths around this format: OpenType is a transparent format that can hold both CFF outlines (compacted PostScript) and TrueType outlines. If the font file is labelled OTF, either outline can be present in the font. A font labelled .TTF is as much of an OT font as a font labelled .OTF. The reason Microsoft decided to stick with .TTF is to provide backward compatibility with older systems, way back to NT4 even. Of course, OT typographic features will not work in these environments.\n\nAgain, it is very important to understand that .TTF fonts \\*ARE\\* OpenType. They work on both Mac OSX and Win.\n\nMy two pennies worth - and yes, the extra points are placed when Illustrator converts a TTF outline.\n\nBruno Maag\n\n"
    },
    {
      "time": "16 Mar 2008 — 8:53pm",
      "content": "How tremendous is this. Here we have a guy named Panos complaining about having his fonts hacked and imploring someone to buy his font when his own \"Muse\" is an obvious ripoff of a much nicer font called \"Delicious,\" created by Jos Buivenga. Come on, Panos. Fess up. A few added \"serifs\" does not an original font make. That's pretty pathetic if you ask me, and for those who don't believe me, simply check out the pdf from parachute.gr. and compare with Delicious, which is free.\n\n"
    },
    {
      "time": "16 Mar 2008 — 8:55pm",
      "content": "And to make the process quicker, look specifically at the lower case f in both fonts, the lower case g, the upper case b, the numbers, et. al.\n\n"
    }
  ]
}
