{
  "id": "40087",
  "title": "FontLab or Fontographer?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m going to be upgrading from TypeTool to a better program, pretty soon here. I had planned on upgrading to FontLab, but I just disovered that I could instead upgrade to Fontographer for $300 less. So, my question is, what would I be missing if I didn’t spend those $300? The big limitations on me from TypeTool are that it won’t let me put more than one character set in a font, it takes lots of effort to make all the accented characters, and it’s a bit unstable. Would Fontographer solve these problems? If I wanted to export in .otf format, would I have to buy FogLamp, or is there another utility that I could use? And what does FontLab have that Fontographer doesn’t?\n\n [‹ What % of women work in advertising agencies?](http://web.archive.org/web/20071215185900/http:/typophile.com/node/40082 \"Go to previous forum topic\") [Degrees & Graduate School / Feelings? ›](http://web.archive.org/web/20071215185900/http:/typophile.com/node/40061 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071215185900/http://typophile.com/user/7642\" title=\"View user profile.\">Number3Pencils</a>",
  "time": "<br>",
  "uid": "7642",
  "comments": [
    {
      "time": " 14.Dec.2007 12.09pm",
      "content": "<cite>…and it’s a bit unstable.</cite>\n\nFYI, so are Fontographer and Fontlab.\n\n"
    },
    {
      "time": " 14.Dec.2007 12.32pm",
      "content": "I’m on a Mac and I have used Fontographer since its initial concept. Those guys in Texas were great - too bad they sold out.\n\nMeanwhile, I had a demo of FontLab — and for the Mac I was too impressed. It was good for opening OT fonts and for saving them. The Fontographer I have doesn’t even recognize an OT font — but it is great for making Mac Type 1 fonts.\n\nDon’t know if that helps you - but I think you can still try a 30 day demonstration from each and decide for yourself. Then you can report back here an let us know.\n\n"
    },
    {
      "time": " 14.Dec.2007 1.11pm",
      "content": "I would strongly recommend FontLab. I was using Fontographer at first (for about two-three months while learning how to make fonts...) but very soon I felt it was very limited. You cant make an OpenType font in Fontographer, and you cant use any OpenType features at all. OpenType is the new standard, and that makes Fontographer outdated.\n\nSpeaking of old, the whole application has an old, almost retro-touch over it. It feels like using an application in MacOS 7.5 or something with anti-aliasing always OFF, which makes the bezier curves look not so smooth. FontLab is smooth and you see the letters as you see them in apps like InDesign etc. Fontographer is looking more like some old CAD-vector-drawing tool. Think of the difference between game consoles. Fontographer is like a Commodore 64 or Atari 128 while FontLab is more like Xbox 360 ;-)\n\nOther than that, I would also like to add that FontLab has a whole bunch of helping tools that really helps you when making fonts, and you can also add all the great python scripts available.\n\nGo FontLab, you wont regret it!\n\n"
    },
    {
      "time": " 14.Dec.2007 2.12pm",
      "content": "While you’re at it, don’t forget to give [FontForge](http://web.archive.org/web/20071215185900/http:/fontforge.sf.net/) a try. It’s come a long way in the last few months even, now that it has a Spiro drawing mode that no other font editor has (if you install libspiro first, among some other dependencies you may need to install too). It will generate OpenType fonts and a bunch of other formats both common and obscure. It’s a little weird and initially uncomfortable working in an X11 window when you’re used to Mac software, but you’ll get over it, and if you find you don’t like it at least you aren’t out any cash for trying.\n\n"
    },
    {
      "time": " 14.Dec.2007 2.22pm",
      "content": "I hear a lot about OpenType features. What kind of stuff can you do with them? Is that the kind where you can put in all sorts of ligatures and stylistic alternates and such?\n\n(It’s now very obvious that I approach font designing mainly in a “drawing letters” way, and have little idea about any programming aspects)\n\nAlso, I’ll check out FontForge.\n\n"
    }
  ]
}
