{
  "id": "40088",
  "title": "Newsprint and Laser Printer",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi\n\nI have a pretty big problem. I need to find a stock that feels/looks like newsprint but can be sent through a laser printer. If anyone had any experience like this, or if you know of any paper stocks that simulate newsprint please let me know.\n\nThanks!\n\n",
  "author": "<a href=\"/web/20090621073721/http://typophile.com/user/13674\" title=\"View user profile.\">tannenhauser</a>",
  "time": "<br>",
  "uid": "13674",
  "comments": [
    {
      "time": " 14.Dec.2007 1.53pm",
      "content": "[http://www.mrfrench.com/results.asp?image=3549](http://web.archive.org/web/20090621073721/http:/www.mrfrench.com/results.asp?image=3549 \"http://www.mrfrench.com/results.asp?image=3549\")\n\nThere’s a newsprint white, but it is still pretty dark. Not really like newsprint though.\n\n"
    },
    {
      "time": " 14.Dec.2007 2.01pm",
      "content": "I have tried sending regular newsprint paper through a small office photocopier, basically the same printing technology as a laser printer, and found that the toner won’t stick tightly to the smooth surface. This was useful for a certain transfer technique, but not for general purposes. Fortunately it didn’t jam the feed mechanisms, but I feared it would because of its light weight and limp body. I have not tried rough surfaced newsprint (such as that in artists pads), though I suspect the loose fiber in the surface might cause other problems.\n\n"
    },
    {
      "time": " 14.Dec.2007 2.08pm",
      "content": "yeah... the french paper co is the paper i have now. my problem with it is that its “pretty” and not cheap looking.\n\n"
    },
    {
      "time": " 14.Dec.2007 2.59pm",
      "content": "As a former seven-year Kinko’s vet., I would suggest finding a small Canon copier with a by-pass tray. Those little copiers were amazing with the types of paper that would work! I tried everything from handmade paper to tissue paper. Viola! The hard part will be to first find one and two your stock size. The copiers I am referring to had an 8.5 inx 14 in max sheet size.\n\n"
    }
  ]
}
