{
  "id": "40091",
  "title": "Is it so?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "While discussing typography over dinner, my friend and I ended up talking about designers we knew. His impression where that most designers are arrogant, bitter and often very negative. Thinking through my own experiences, I realized I had crossed paths with quite a few visual artists fitting that description as well.\n\nNow, I truly hope this is not the case. I feel most typophiles are very humble and helpful in dialog with youngsters & newbies, like myself.\n\nWhat’s your impression?\n\n [‹ Custom University Type](http://web.archive.org/web/20080905210547/http:/www.typophile.com/node/40185 \"Go to previous forum topic\") [Monaco m-o-n-o ›](http://web.archive.org/web/20080905210547/http:/www.typophile.com/node/40125 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905210547/http://www.typophile.com/user/17101\" title=\"View user profile.\">frode frank</a>",
  "time": "<br>",
  "uid": "17101",
  "comments": [
    {
      "time": " 14.Dec.2007 2.58pm",
      "content": "Humans are arrogant, bitter and often very negative.  \nHumans are modest, sweet and often very positive.\n\n"
    },
    {
      "time": " 14.Dec.2007 3.10pm",
      "content": "What Stephen said.\n\nAs the old song says, “It takes all kinds to make a world.”\n\n"
    },
    {
      "time": " 14.Dec.2007 3.32pm",
      "content": "Obviously :) Perhaps this is a silly question. I just feel designers often get in positions where they “know better” than whom ever they meet. I hope not to become a patronizing old man with all the answers.\n\n"
    },
    {
      "time": " 14.Dec.2007 7.56pm",
      "content": "musicians often get in positions where they “know better” than whom ever they meet  \nwriters often get in positions where they “know better” than whom ever they meet  \nlawyers often get in positions where they “know better” than whom ever they meet  \npoliticians often get in positions where they “know better” than whom ever they meet  \npeople often get in positions where they “know better” than whom ever they meet\n\n"
    },
    {
      "time": " 14.Dec.2007 10.49pm",
      "content": "But one thing is for sure: All designers use Macs and carry iPhones and drive Audi’s. Well, that’s three things. All designers are NOT mathematicians.\n\n"
    },
    {
      "time": " 15.Dec.2007 2.54am",
      "content": "A friend once described me as being like a hedgehog; cute and cuddly and mostly harmless, but every once in a while out come the spikes - yee-ouch!\n\nJust call me Sonic....\n\n"
    },
    {
      "time": " 15.Dec.2007 2.58am",
      "content": "Designers have a general reputation for being cranky or bitchy.\n\nLawyers have a general reputation for being assholes.\n\nFactory workers have a general reputation for being clueless.\n\nPoliticians have a general reputation for being insincere.\n\nCar salesmen have a general reputation for being deceptive—-their pore ooze untrustworthiness.\n\nPeople have a general ability to generalize and formulate stereotypes representing and misrepresenting each other.\n\n_But one thing is for sure: All designers use Macs and carry iPhones and drive Audi’s._\n\nNope, nope, nope. Not this little black duck.\n\nj a m e s\n\n"
    },
    {
      "time": " 15.Dec.2007 7.04am",
      "content": "... and all generalizations are false — including this one.\n\n"
    },
    {
      "time": " 15.Dec.2007 8.22am",
      "content": "James, are you telling us you don’t drive an Audi? You must not be a graphic designer. :-)\n\n"
    },
    {
      "time": " 15.Dec.2007 12.44pm",
      "content": "i’m sick and tired of people describing designers as arrogant and negative. that’s the kind of thing that makes me hate everyone and think there’s no use in trying to change their pathetic minds.\n\n"
    },
    {
      "time": " 15.Dec.2007 12.50pm",
      "content": "`< sarcasm>< /sarcasm>`\n\n"
    },
    {
      "time": " 15.Dec.2007 1.11pm",
      "content": "i _knew_ there was a code for that!\n\n"
    },
    {
      "time": " 15.Dec.2007 6.54pm",
      "content": "_James, are you telling us you don’t drive an Audi? You must not be a graphic designer. :-)_\n\nHa-ha, bloody ha. Thanks for the vote of confidence.\n\nNo offense taken.\n\nj a m e s\n\n"
    },
    {
      "time": " 15.Dec.2007 7.45pm",
      "content": "I don’t know about designers in general but type designers are just the best.\n\nGood looking, intelligent, fair-minded, good-hearted. And they can sing. Oh and did I mention they are great lovers? :)\n\n"
    },
    {
      "time": " 15.Dec.2007 8.18pm",
      "content": "My 1990 Nissan Sentra is such a babe magnet :-)\n\nChrisL\n\n ![](http://web.archive.org/web/20080905210547im_/http:/www.typophile.com/files/dezsentraShirt_5762.jpg)\n\n"
    },
    {
      "time": " 15.Dec.2007 8.33pm",
      "content": ": ) Chris I’m eating a yummy fish right now, and the fish has asked me to say, “Chris Lozos is the most totally awesome dude evarrr, and chicks line up to get a ride in his cute little Nissan!”\n\nWill, I can’t sing for peanuts but the rest is true of me. Type designers are generally great-looking. My friend Amanda just called because she wants to play another game of “You give me forty dollars” with me ;^)\n\nj a m e s  \nInventor of the “Understand-a-scope”\n\n"
    },
    {
      "time": " 15.Dec.2007 8.44pm",
      "content": "Is that the standard license plate typeface of Va?\n\nDIN, it ain’t.\n\nBut in any case, when do you get to return the loaner to the Audi dealership?\n\n"
    },
    {
      "time": " 15.Dec.2007 11.04pm",
      "content": "I dunno, Chris, methinks it is that awesome t-shirt that is the female (design nerd) magnet! ;-D\n\n"
    },
    {
      "time": " 16.Dec.2007 3.03am",
      "content": ":) Allright, allright. I bow my knees in front of the great God of design to ask for forgiveness for thinking his disciples are being cranky.\n\n"
    },
    {
      "time": " 16.Dec.2007 9.06am",
      "content": "Mac- check  \niPhone - maybe one day, not available here  \nAudi - nooo, Marin bike, tram or legs\n\n"
    },
    {
      "time": " 17.Dec.2007 4.13am",
      "content": "Mac—Nope, but I’ll probably get one in a while. So I have both a PC and a Mac.  \niPhone—Nope.  \nAudi—I don’t even have a drivers license. ;)\n\n"
    },
    {
      "time": " 17.Dec.2007 4.49am",
      "content": "I am reminded of a very talented designer. She married a designer as well. He was cranky, arrogant, yes, even bitchy. His mother told the talented designer, that her son was an ARTIST and therefore allowed his mood swings. It was all part of the creative process.\n\nNeedless to say, they were soon divorced.\n\nAnd some designers do drive Porsches and BMWs....\n\n"
    },
    {
      "time": " 17.Dec.2007 5.05am",
      "content": "High blood pressure has a lot to do with crankiness and bitchiness.\n\nI’m thinking of buying a used 1970’s Silver Shadow Roller. You get a lot of lovely British motor car for the money but the thing drinks too much petrol.\n\nj a m e s\n\n"
    },
    {
      "time": " 17.Dec.2007 8.13am",
      "content": "\\><cite>Good looking, intelligent, fair-minded, good-hearted. And they can sing. Oh and did I mention they are great lovers? </cite>\n\nI’m with Mr. Berkson on this one. As for arrogance, I’ve always considered that to be part of the act. And when it comes to transportation, a graphic artist <cite>must</cite> travel in ($600) style.\n\n ![](http://web.archive.org/web/20080905210547im_/http:/www.typophile.com/files/hdt_0907_6254.jpg)\n\n"
    },
    {
      "time": " 17.Dec.2007 9.02am",
      "content": "$600 bucks and it came with whitewalls! That is a steal! :-)\n\nChrisL\n\n"
    },
    {
      "time": " 17.Dec.2007 9.09am",
      "content": "\\> <cite>And it came with whitewalls!</cite>\n\nDid I mention that it’s entirely brush painted, save for the original light blue detailing? 10 cd changer and obligatory seat cover?\n\nKeys are in the ignition. It’s over in the city lot by the local tire shop. This, friends, is living.\n\n"
    },
    {
      "time": " 17.Dec.2007 9.11am",
      "content": "LOL!\n\nChrisL\n\n"
    },
    {
      "time": " 17.Dec.2007 11.31am",
      "content": "_i’m sick and tired of people describing designers as arrogant and negative. that’s the kind of thing that makes me hate everyone and think there’s no use in trying to change their pathetic minds._\n\nThanks Chuck; I’m sitting skimming Typophile while my two English classes write their final exam and your comment just made me burst out laughing, which I think some of the students may have taken the wrong way. A good laugh is always welcome, even for the arrogant and bitchy.\n\n"
    },
    {
      "time": " 17.Dec.2007 1.24pm",
      "content": "All typophiles are modest, sweet and very positive, except for David Berlow. :-P\n\n"
    },
    {
      "time": " 17.Dec.2007 1.27pm",
      "content": "Truth is, David Berlow gives very good advice.\n\nChrisL\n\n"
    },
    {
      "time": " 17.Dec.2007 1.30pm",
      "content": "<cite>Truth is, David Berlow gives very good advice.</cite>\n\nVery good advice, delivered with an edge! ’Twas not my intention to downplay his knowledge.\n\n"
    },
    {
      "time": " 17.Dec.2007 1.33pm",
      "content": "I know you were not being negative, Dave.\n\nChrisL\n\n"
    },
    {
      "time": " 17.Dec.2007 4.35pm",
      "content": "_All typophiles are modest, sweet and very positive, except for David Berlow._\n\n_I know you were not being negative, Dave._\n\nHe was being very apt and very witty, like David himself. I think David Berlow is incredibly funny. All typophiles are modest, sweet, very positive and very witty.\n\nj a m e s  \n“mew”\n\n"
    },
    {
      "time": " 18.Dec.2007 2.06am",
      "content": "Geez guys, don’t pull any punches ok?\n\n ![](http://web.archive.org/web/20080905210547im_/http:/www.typophile.com/files/taubin_6439.jpg)\n\n"
    },
    {
      "time": " 18.Dec.2007 4.18am",
      "content": "Apologies for the recent rhetorical punch-pulling of mine Dan.\n\nI have been known to write some verbal jibes solely for the thrill of using a hyphenate. I am kind of addicted to grammar and punctuation and wordforms. I am trained to use rhetoric to get the point across. sick, sick, sick\n\nNo really.\n\nj a m e s\n\n"
    },
    {
      "time": " 18.Dec.2007 4.49pm",
      "content": "I think we operate in environments where lots of people have opinions about design (informed and uninformed) so iIt’s natural for a designer to weigh in heavily at times. I have seen the developers here get in more heated debate than the designers at times. In development and design there are right and wrong ways to do things, and huge grey subjective areas in the middle.\n\nBut, just don’t confuse strong opinions with cockiness. If people think you’re cocky it’s because you’re delivering your opinions wrong.\n\nIn my experience the only people that fit the description you gave are when kids are right out of school and have the “right” talent and get into “right” job. These traits (arrogance, etc.) don’t serve them very well in the real world and they learn. You can imagine the same thing happening with bright medical students or engineering students who excel and get great positions.\n\nI’ve only ever met one seasoned designer who was actually a true jerk. I admired this guy for years (and bought his books) but meeting him in person was a disappointment. Like I said, though, that’s been a major exception.\n\n(Oh, and my primary mode of transportation is black, and it’s Italian. But it’s not a car. =)\n\n"
    },
    {
      "time": " 18.Dec.2007 5.12pm",
      "content": "[Ducati?](http://web.archive.org/web/20080905210547/http:/www.ducati.com/)\n\n"
    },
    {
      "time": " 18.Dec.2007 5.13pm",
      "content": " ![](http://web.archive.org/web/20080905210547im_/http:/www.typophile.com/files/800px-Highland_cattle_Black_cow_3719.jpg)\n\nOh! You said _Italian_, not _Highland_.\n\nMy bad.\n\n"
    },
    {
      "time": " 18.Dec.2007 5.42pm",
      "content": "The eyesight problem caused by my aneurysm means I drive a lot less these days. I wear black Italian leather lace-ups like these, everywhere, no matter what the occasion.\n\n ![](http://web.archive.org/web/20080905210547im_/http:/www.typophile.com/files/blackshoes_6362.jpg)\n\nj a m e s\n\n"
    },
    {
      "time": " 18.Dec.2007 6.49pm",
      "content": " ![](http://web.archive.org/web/20080905210547im_/http:/www.typophile.com/files/Bugatti_3721.jpg)\n\n"
    },
    {
      "time": " 18.Dec.2007 7.24pm",
      "content": "Does Chris have the only vanity plate named for a typeface? Now that’s hot.\n\n"
    },
    {
      "time": " 18.Dec.2007 7.34pm",
      "content": "Yes, but I couldn’t get the Virginia DMV to make it in the actual typeface :-/\n\nChrisL\n\n"
    },
    {
      "time": " 18.Dec.2007 8.31pm",
      "content": "If you must wear Italian lace-ups everywhere, wingtips are definitely the way to go.\n\nMe, I prefer Brazilian loafers, which reminds me that I need to take out another student loan…\n\n"
    },
    {
      "time": " 18.Dec.2007 9.38pm",
      "content": "Spiekermann drives a Jaguar. And David Berlow speaks like Yoda. I sometimes don’t understand him but I always enjoy what we writes. I always wondered if he was friends with Frank Oz. Or with Joseph Heller.\n\nA.\n\n"
    },
    {
      "time": " 18.Dec.2007 9.58pm",
      "content": "_...I need to take out another student loan..._\n\nJames click the contact thingy on my user page and drop me a line—-I will mail you a check or money order to help pay your bills. Yes really, I mean it.\n\nI owned a Jaguar once, a Mark III saloon made back in the 1970’s when Jaguars still had massive quality problems. Very nice plush town car but it kept falling to bits, and the servicing requirements were wallet-threatening to say the least. Also try—-fueling a barbeque with $50 notes.\n\nj a m e s\n\n"
    },
    {
      "time": " 19.Dec.2007 6.29am",
      "content": "My ex-wife always hated my BMW - but she sure wanted (and got) that thing in the divorce! She’s not a designer, but 20 years later she’s still arrogant, bitter and often very negative.\n\nJeff Fisher | Engineer of Creative Identity | [Jeff Fisher LogoMotives](http://web.archive.org/web/20080905210547/http:/www.jfisherlogomotives.com/)\n\n"
    },
    {
      "time": " 19.Dec.2007 7.43am",
      "content": "James,\n\nI had a 2001 Jaguar S-Type - and it had as many problems as the old Jags did. And to think - not one Lucas part in it - ahuh! I was delighted when I sold it. And since I never wanted to see it again - I was thrilled when here I am on the Southeast coast of the USA and it was bought by a man on the Northwest coast of the USA. Every now and then I get an email from him as to what he has done to the car, and he is always so happy. (After all, he got it for a song....and I was happy selling it to him.)\n\nSorry about your BMW Logomotives — that’s a nice car to have. I visited recently the BMW plant in Spartanburg, South Carolina, didn’t care for the robots making them - they had no personalities to speak of — however, I did enjoy the few “driving experiences” they reserved for our group.\n\n"
    }
  ]
}
