{
  "id": "40109",
  "title": "Tangerine- serif AND sans versions?",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I started working on a new font, working title Tangerine. I threw together some words to show the state its in right now..\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 167.png](http://web.archive.org/web/20131012143709/http:/typophile.com/files/Picture%20167.png) | 24.8 KB |\n\n",
  "author": "chillypepper",
  "time": "15 Dec 2007 — 12:15pm",
  "uid": "15170",
  "comments": [
    {
      "time": "16 Dec 2007 — 10:28am",
      "content": "This is interesting. It's a little to programatic or rule detived to be REALLY great. But it's got promise. The lc c throws me a bit. What use to you intend it for? What's the history behind the font?\n\n"
    },
    {
      "time": "17 Dec 2007 — 3:24pm",
      "content": "Could you elaborate a bit on 'rule detived'?  \nI'm not developing this font for any specific project, I've just got this ideal fun (but not too fun) sans-serif font brewing in my head and I'm trying to bring it to life . It's definately got more work to be done, but the basic model is pretty much there. I plan on adding a lighter and heavier weight once I nail this one.\n\nFeel free to knock it around some more, because I'd love it to be REALLY great\n\n"
    },
    {
      "time": "17 Dec 2007 — 5:16pm",
      "content": "What I mean by rule derived ( sorry typo before) is that some of the shapes in your font take their form from a consistent approach to the forms. So when I look at the tail and join on the lower left of your lc a I see it is identical to the lc d and u. This might be okay but it might not be. When forms repeat too often or too completely an opportunity for richness is lost. Similarly the shape of your lc c is the same as the left side of the bowl of your g. This was a quick way to do it & it's okay-ish but I think it is definitely not ideal.\n\nYou have come a long way quickly using rules. But now you have to focus on the well crafted exception! Do you see what I mean?\n\nSome of the questions you have to ask yourself have to do with what size the font will be used ( and \"Every size!\" is not a really good answer) and what purpose it will have. So for example this might be a novelty face meant for packaging. Weird choices could be more okay in that case. Or you might want the font to be useful for magazine Titles. Or you might want it be work at subhead sizes or for a magazine's article's body text. Each of these choices implied slightly different things in terms of contrast, optical tweaking and other purely typographic factors but also in terms of style because the smaller the font is used the more likely it is that you are going to want to draw on traditional forms in some way.\n\nPut another way - to be great the face will have to serve a purpose. The idea is that you can't hit something unless you aim at it.\n\n"
    },
    {
      "time": "18 Dec 2007 — 10:08pm",
      "content": "I've been working some more on it, it seems to want to go both serif and sans-serif directions... I think I'll end up making both  \n [picture 2](http://web.archive.org/web/20131012143709/http:/farm3.static.flickr.com/2175/2122294290_a95d8da12f_o.png)\n\n"
    },
    {
      "time": "18 Dec 2007 — 11:11pm",
      "content": "I would also consider making the white spaces in the h & n more silimar to the b & d.\n\nThe new c is better. Have a look at the top & bottom and thing if they should be the same or not. Also, what about the e... It seems a bit pinched to me.\n\n"
    }
  ]
}
