{
  "id": "40100",
  "title": "Standardized Font Pricing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Looking at the Adobe/Monotype/Linotype pricing structure, it appears that they have all standardized on $24 for Postscript and $29 for Opentype fonts, whether it be on Myfonts, Adobe, Fonts.com, FontExplorer, whatever.\n\nI'm curious what others in the industry think about this. On the one hand, it's not a horrible price to be paying for quality cuts of beef from the mega foundries. But for independent type foundries, do you feel that it sets the bar too high? Or too low?\n\nDo you think that standardizing the cost of fonts along these lines would level the playing field so that only the best designs stood out?\n\nImagine we're talking about Myfonts, and they adopt this pricing scheme. All fonts are $24/$29. Which version of Garamond do you want? They're all the same price, so obviously you're gonna pick Premier Pro or Sabon instead of some knockoff Jannon. Or you'll pick Storm's Baskerville over the Monotype version.\n\nIt all depends upon the design, not the price. That would make the quality of the type the determining factor. (Ruling out a lot of the crap fonts, since no one is going to pay $29 for Black Chancery. Yeah buddy, I totally just went there.)\n\nSilly? Smart? Insipid? Inspired?\n\n",
  "author": "Dan Gayle",
  "time": "14 Dec 2007 — 10:42pm",
  "uid": "12948",
  "comments": [
    {
      "time": "14 Dec 2007 — 11:04pm",
      "content": "I think the biggest problem of font pricing with some of the independent/boutique foundries are the ones that refuse to allow a-la-carte pricing of individual weights and styles (e.g., HFJ). I understand the rationale behind the pricing strategy, but to me, it is a significant hurdle to purchasing more licenses.\n\nAs for the 24/29 thing, seems like the Type 1's are overpriced. No one seems to want them anymore, Adobe won't even cut them--so shouldn't the price be a lot LOWER? After all, to get most of the glyphs in a fully-fleshed-out OT typeface, but in Type 1 format, you need to license at least three fonts (standard, caps and OsF) and perhaps even more (LF, TF, foreign language...)\n\nThe market has grown accustomed to the \"roughly $20-$30\" price for an individual font, so the OT price seems about right.\n\n"
    },
    {
      "time": "14 Dec 2007 — 11:13pm",
      "content": "Personally I find the antiquated concept of the \"five user license\" to be stranger than the pricing.\n\n"
    },
    {
      "time": "15 Dec 2007 — 12:40am",
      "content": "I think that value-based pricing is a fine and reasonable thing, and I don't see any reason that (for instance) the pricing of lower-quality fonts should be raised, or that Linotype should cut the pricing on their Platinum series fonts.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "15 Dec 2007 — 1:13am",
      "content": "\\> $24 for Postscript and $29 for Opentype fonts\n\nFormat isn't the only indicator of value. Two OpenType fonts could have very different OT features, glyph sets, and language support. It would be unfeasible to standardize all those variables.\n\n\\> Imagine we’re talking about Myfonts, and they adopt this pricing scheme.\n\nMyFonts, as a reseller, doesn't really set prices. Pricing is generally up to the foundry (unless the reseller decides to jack the price above the MSRP).\n\n\\> That would make the quality of the type the determining factor.\n\nIt already is. For the most part, fonts of higher quality fetch the cash they deserve.\n\n"
    },
    {
      "time": "15 Dec 2007 — 3:25am",
      "content": "_But for independent type foundries, do you feel that it sets the bar too high? Or too low?_\n\nAs an indie font maker\\* the big guys have set their standardized prices about right for me. I am able to match it, and in fact better it with low-end font products at budget prices. Primex is a simple font but it's cheap and useful, and designers buy it for those reasons. That's something any indie font maker should be able to do with just a dash of imagination.\n\n_Do you think that standardizing the cost of fonts along these lines would level the playing field so that only the best designs stood out?_\n\nThe font market really doesn't work that way. The best designs stand out on the basis of merit, including a fair price.\n\n_Imagine we’re talking about Myfonts, and they adopt this pricing scheme. All fonts are $24/$29._\n\nVery hard to see that ever happening. The whole concept of Myfonts is based on an open supermarket plan; independent vendors set their own prices, and the roach-baited font-buying public make their choice, based on the apparent quality of font products, features offered, perceived value for money, rival font products, and market trends. Myfonts has a ranking system that ensures all the good stuff (fonts people are buying) filters to the top, and the rubbish nobody buys filters to the bottom.\n\nStephen is quite right in saying that quality already is the determining factor.\n\n\\*I have never once called my operation or anyone else's \"foundry\". Only Myfonts literature refers to Sentinel Type as a \"foundry\", but I don't complain---life's too short.\n\nj a m e s\n\n"
    },
    {
      "time": "15 Dec 2007 — 7:32am",
      "content": "_...all the good stuff (fonts people are buying) filters to the top, and the rubbish nobody buys filters to the bottom_\n\nHey Hollywood!\n\n"
    },
    {
      "time": "15 Dec 2007 — 10:55am",
      "content": "<cite>…the biggest problem of font pricing with some of the independent/boutique foundries are the ones that refuse to allow a-la-carte pricing of individual weights and styles…</cite>\n\nThat’s why I stopped trying to use House Industries fonts in my commercial stuff. It’s not easy to convince someone to buy five fonts just to get one. The same held true for the high-end Linotype fonts until recently, when the value packs were announced.\n\n<cite>Personally I find the antiquated concept of the “five user license” to be stranger than the pricing.</cite>\n\nI tend to think of it as up-to-five users and not gouging individual designers.\n\n"
    },
    {
      "time": "15 Dec 2007 — 11:34am",
      "content": "_Hey Hollywood!_\n\nIt is unfortuntely like that---a popularity contest in which the winners are the most popular (best-selling) fonts, some of them the shittiest non-design yet seen, and the losers are frequently solid, interesting designs that are not commercial or trendy enuff to appeal to \"the roach-baited font-buying public\".\n\nI use that turn of phrase to liken mass audience font buyers to cinema-goers hungering after action-packed block-buster movies. Their buying habits are not the same as graphic designers. I don't make many block-busters, and neither do you Nick. We concentrate on turning out good designs loaded with philosophy, and our reward is a tepid sales rate.\n\nj a m e s\n\n"
    },
    {
      "time": "15 Dec 2007 — 12:26pm",
      "content": "_... loaded with philosophy, and our reward is a tepid sales rate_\n\nNot quite how I would have phrased it.  \nCertainly, I'm not interested in catering to popular taste by concentrating on retro scripts and distress.  \nBut making original designs is nonetheless a viable business model, given the nature of the market -- huge and long-term.  \nSo if a foundry builds up a catalogue of products, and has good retail distribution, every one of its fonts will be licensed by someone somewhere, occasionally: Long Tail theory. And that adds up, even if you don't crack the Myfonts best seller list. (It should be noted that such charts are consumer-oriented, rather than corporate-oriented, as they are based on unit volume, not dollars, so the sale of a multi-font family with a multi-user license, for thousands of dollars, counts as a single sale and doesn't dent the chart, whereas if the value of the sale were divided by the typical cost of a single font, it would register as a big hit.)\n\nI'll be releasing some low-cost fonts soon. Tranching down.\n\n"
    },
    {
      "time": "15 Dec 2007 — 1:46pm",
      "content": "When will Figgins be released, Nick? And Scotch Modern?\n\nSharon\n\n"
    },
    {
      "time": "15 Dec 2007 — 1:46pm",
      "content": "I know that some complain about not being able to license one single font from some foundries. The way I think about it is two-fold.\n\n- \"Is this font _the_ best for the project?\"  \n- \"Will I be able to use again in the future, even many times?\"\n\nIf I (you) can say \"yes\" to both you will get your money back. It might take a project or two, but you'll get it back.\n\nAlso consider that the time you spend trying to find something close is costing you money too.\n\nPerhaps consider only charging your client for the one font and then when you use the next font in the pack charge another client for that one.\n\nFonts are tools that we use in our work. I couldn't buy part of a computer even if that was all I could afford. So I buy the whole computer knowing I'll get my money back eventually. I have a well-stocked toolbox and know that I will get my money out of them.\n\nAlso consider not even charging your clients for the fonts. I don't. It goes back to the toolbox analogy. I'm not giving the tools to my clients when I'm done. I'm giving them the final product. I keep the computer and the fonts to use another day.\n\n"
    },
    {
      "time": "15 Dec 2007 — 2:56pm",
      "content": "\\>\\>When will Figgins be released, Nick? And Scotch Modern?\\<\\<\n\nHuh? Do tell please, I loooooove a good Scotch face.\n\n"
    },
    {
      "time": "15 Dec 2007 — 3:39pm",
      "content": "Sharon, Ryan, it's taking longer than I thought, I was a bit ambitious with all the Greek and Cyrillic.  \nProbably February.\n\n"
    },
    {
      "time": "15 Dec 2007 — 4:16pm",
      "content": "Pricing is always tricky. At what point does the volume increase overtake the individual profit margin? Developing decent type is quite time consuming work and not guaranteed to return the initial investment of time. What does it take to determine the market saturation point of a given face and divide it into the cost of production? There is quite a bit of speculation involved. It is truly a gamble. Like playing Bingo, your odds of winning increase with the number of cards you purchase to play--as does your investment in the game. It isn't just the value of the individual typeface in the market but the marketing power of the vendor. A large established entity with plenty of market inroads will have a much easier time of getting their work even noticed. The small outfits and newcomers with no track record have to bleed the most to get a bandage. This same group has the least capital to invest so they are between a rock and a hardplace. They have to spend more on marketing and lower their pricepoint to get the attention of the buyers. Nick's concept with MyFonts is a perfect example. His logic is spot on with the MyFonts sales model. You have to tread water long enough to be there for the feeding.\n\nChrisL\n\n"
    },
    {
      "time": "18 Dec 2007 — 3:14pm",
      "content": "_Not quite how I would have phrased it. ..._\n\nThankyou for correcting me, and explaining in more detail.\n\n_But making original designs is nonetheless a viable business model, given the nature of the market — huge and long-term.  \nSo if a foundry builds up a catalogue of products, and has good retail distribution, every one of its fonts will be licensed by someone somewhere, occasionally: Long Tail theory. And that adds up, even if you don’t crack the Myfonts best seller list._\n\nQuite so. Mainly I meant that the fonts you and I make rarely see chart success as Myfonts starlets.\n\nNow that I've learnt the basics of the craft, I'm concentrating on producing more original designs concieved to be long-termers. The next step is to have them more widely distributed. My friend Ray Larabie concentrates on much trendier material---hit after hit on the singles chart---that burns out quickly. To his credit tho he is prolific, and with so many products on the market it all adds up.\n\n_There is quite a bit of speculation involved. It is truly a gamble. Like playing Bingo, your odds of winning increase with the number of cards you purchase to play—as does your investment in the game. It isn’t just the value of the individual typeface in the market but the marketing power of the vendor. A large established entity with plenty of market inroads will have a much easier time of getting their work even noticed._\n\nWell put Chris. This is how Ray Larabie works.\n\nj a m e s\n\n"
    }
  ]
}
