{
  "id": "40125",
  "title": "Monaco m-o-n-o",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is monaco called monaco because it contains, in proper order, the letters which form the word ’mono’ (because it is a monospaced font)?\n\nJust wondering, I bet it’s been pointed out before and it’s probably laughably obvious. But I thought it was (borrows American slang) kinda neat. Sorry to bore you.\n\n [‹ Is it so?](http://web.archive.org/web/20080501183128/http:/www.typophile.com/node/40091 \"Go to previous forum topic\") [Looking for a nice condensed but readable font for hymnbook project. ›](http://web.archive.org/web/20080501183128/http:/www.typophile.com/node/39975 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080501183128/http://www.typophile.com/user/9500\" title=\"View user profile.\">nicholasgross</a>",
  "time": "<br>",
  "uid": "9500",
  "comments": [
    {
      "time": " 16.Dec.2007 3.52pm",
      "content": "I think Monaco was named that as part of the original Apple font set with place names. I recall Geneva being another. The fact that it was a mono probably made calling it Monaco easier. They were made by Bigelow & Holmes.\n\nAccording to Mark Simonson here:\n\n[http://typographica.org/000785.php](http://web.archive.org/web/20080501183128/http:/typographica.org/000785.php \"http://typographica.org/000785.php\")\n\n<cite><br>\nHere’s a list of the Mac “city” fonts:</cite>  \n<cite><br>\nChicago*<br>\nGeneva*<br>\nNew York*<br>\nMonaco*<br>\nAthens*<br>\nSan Francisco*<br>\nLondon*<br>\nVenice*<br>\nToronto* **<br>\nTaliesin<br>\nCairo<br>\nLos Angeles<br>\n</cite>  \n<cite><br>\n*Shipped with the original Mac.<br>\n**Dropped after one of the first system updates.</cite>  \n<cite><br>\nMicrosoft had one, too, which was included with MultiPlan called Seattle. It came in 10- and 20-point. I recall that it was the first Mac font in those sizes. The 10- and 20-point versions of Geneva came later.<br>\n</cite><cite><br>\nOne other bit of trivia: The version of Geneva that came with the first release of the Mac system software had a one-story lowercase a. It was changed to two-story with the first system update.<br>\n</cite>\n\nI realize I haven’t answered the question completely but I hope this helps.\n\n"
    },
    {
      "time": " 16.Dec.2007 7.56pm",
      "content": "Written by Susan Kare\n\n“Landing in the Macintosh group as a bitmap graphic designer was a lucky break for me, and one interesting part of the job was designing screen fonts. It was especially enjoyable because the Macintosh was able to display proportional typefaces, leaving behind the tyranny of monospace alphabets with their narrow m’s and wide i’s.\n\nThe first Macintosh font was designed to be a bold system font with no jagged diagonals, and was originally called “Elefont”. There were going to be lots of fonts, so we were looking for a set of attractive, related names. Andy Hertzfeld and I had met in high school in suburban Philadelphia, so we started naming the other fonts after stops on the Paoli Local commuter train: Overbrook, Merion, Ardmore, and Rosemont. (Ransom was the only one that broke that convention; it was a font of mismatched letters intended to evoke messages from kidnapers made from cut-out letters ).\n\nOne day Steve Jobs stopped by the software group, as he often did at the end of the day. He frowned as he looked at the font names on a menu. “What are those names?”, he asked, and we explained about the Paoli Local.\n\n“Well”, he said, “cities are OK, but not little cities that nobody’s ever heard of. They ought to be WORLD CLASS cities!”\n\nSo that is how Chicago (Elefont), New York, Geneva, London, San Francisco (Ransom), Toronto, and Venice (Bill Atkinson’s script font) got their names.”\n\n"
    },
    {
      "time": " 16.Dec.2007 7.59pm",
      "content": "Anyway your idea is probably right. Seems like a few of them had cheeky reasons for their city names. ie Cairo = hieroglyphics reference.\n\n"
    },
    {
      "time": " 16.Dec.2007 8.18pm",
      "content": "I found a site with a lot of them for download.\n\n[http://masterstech-home.com/the\\_library/font\\_samples/](http://web.archive.org/web/20080501183128/http:/masterstech-home.com/the_library/font_samples/ \"http://masterstech-home.com/the\\_library/font\\_samples/\")\n\nSome are missing, like Toronto and San Francisco. I wonder what the legality of these fonts are? Some of the old mac fonts are in dire need of fixing so they work with modern systems. A re-mastered version of Cairo would be amazing.\n\n"
    },
    {
      "time": " 16.Dec.2007 8.40pm",
      "content": "A tiny clarification to Eben’s post: The TrueType (outline) versions of the Mac system fonts were created by Bigelow & Holmes, the earlier bitmap fonts on which they were based were created by Susan Kare.\n\n"
    },
    {
      "time": " 16.Dec.2007 10.24pm",
      "content": "Thanks guys,\n\nI’m actually hoping it’s a happy coincidence; much cooler that way.\n\n"
    },
    {
      "time": " 16.Dec.2007 10.28pm",
      "content": "Thanks Mark!\n\n"
    },
    {
      "time": " 18.Dec.2007 4.04pm",
      "content": "I don’t think it was a coincidence. I think they thought it was clever.\n\n"
    },
    {
      "time": " 18.Dec.2007 8.15pm",
      "content": "Some don’t really make any sense though. Toronto and Los Angeles for example.. Probably just filler at that point.\n\n"
    }
  ]
}
