{
  "id": "40126",
  "title": "Suggestions for classic text fonts and swash italic headlines for book design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am preparing a hardcover of 18th-century French garden architecture, illustrated with elevational watercolors of selected buildings. The artwork is contemporary and is rendered with extreme photorealism and will be reproduced on a white ground. Secondary illustrations will be period paintings, architectural and garden plans and views, portraits and engravings. There will be no photography to break this immersion in the Ancien Regime.\n\nThe texts are thoroughly researched but written with an engaging rather than scholarly intent and will be 10-11 pt., fully justified. Three-line inset caps will open chapters, so display capitals are very important. Titles and headers will be printed in a second color, yet to be chosen. The book has a simple, minimalist design with generous margins that accentuate the use of white space, and this echoes the presentation of the drawings.\n\nI am looking for an appealing, classic typeface for the texts other than a Garamond (I like Garamond Premier very much but have used it before) or a Caslon (too rounded, and also used for a previous book). Also a handsome italic swash for chapters and titles.\n\nFor lack of a better description, I'd like a text font that is something a bit out of the ordinary that does not call too much attention to itself. I've looked at Berling and like it but find it a tad generic, and Book Antiqua's italic, though the caps are too vertical and brittle.\n\nFor titles, Adobe Centaur italic swash is handsome but more antique than French. I also find Andrade appealing but with too much flourish.\n\nAny suggestions for this project would be extremely welcome. I am new member of this forum and discovered it while looking for a Bodoni font for a previous book, and had the remarkable good fortune to learn of LT Gianottan Light, which was the perfect solution for the project. I hope the members here can point me toward other beautiful fonts such as this.\n\n",
  "author": "EAZ",
  "time": "16 Dec 2007 — 3:54pm",
  "uid": "25123",
  "comments": [
    {
      "time": "16 Dec 2007 — 5:11pm",
      "content": "Farnham  \n [http://fontbureau.com/fonts/Farnham](http://web.archive.org/web/20140320105434/http:/fontbureau.com/fonts/Farnham \"http://fontbureau.com/fonts/Farnham\")  \n [http://www.fontshop.com/search/?q=Farnham](http://web.archive.org/web/20140320105434/http:/www.fontshop.com/search/?q=Farnham \"http://www.fontshop.com/search/?q=Farnham\")  \n [http://www.fontshop.com/fonts/singles/font\\_bureau/farnham\\_display\\_regula...](http://web.archive.org/web/20140320105434/http:/www.fontshop.com/fonts/singles/font_bureau/farnham_display_regular_italic_swash/?sample_text=July%20Quo%20Twenty%20Yet&sample_size=36&acs_p=1&acs_pt=24&acs=1 \"http://www.fontshop.com/fonts/singles/font\\_bureau/farnham\\_display\\_regular\\_italic\\_swash/?sample\\_text=July%20Quo%20Twenty%20Yet&sample\\_size=36&acs\\_p=1&acs\\_pt=24&acs=1\")\n\n"
    },
    {
      "time": "16 Dec 2007 — 5:13pm",
      "content": "FF Clifford  \n [http://www.fontshop.com/fonts/downloads/fontfont/ff\\_clifford/](http://web.archive.org/web/20140320105434/http:/www.fontshop.com/fonts/downloads/fontfont/ff_clifford/ \"http://www.fontshop.com/fonts/downloads/fontfont/ff\\_clifford/\")  \n [http://www.fontshop.com/fontfeed/archives/akira-kobayashi-on-ff-clifford/](http://web.archive.org/web/20140320105434/http:/www.fontshop.com/fontfeed/archives/akira-kobayashi-on-ff-clifford/ \"http://www.fontshop.com/fontfeed/archives/akira-kobayashi-on-ff-clifford/\")  \n [http://www.fontshop.com/fonts/downloads/fontfont/ff\\_clifford\\_eighteen\\_it...](http://web.archive.org/web/20140320105434/http:/www.fontshop.com/fonts/downloads/fontfont/ff_clifford_eighteen_it_it_alt_lf_exp/?sample_text=July%20Quo%20Twenty%20Yet&sample_size=36 \"http://www.fontshop.com/fonts/downloads/fontfont/ff\\_clifford\\_eighteen\\_it\\_it\\_alt\\_lf\\_exp/?sample\\_text=July%20Quo%20Twenty%20Yet&sample\\_size=36\")\n\n"
    },
    {
      "time": "16 Dec 2007 — 5:17pm",
      "content": "\\> Caslon (too rounded)\n\nCan you explain what you mean by \"rounded\"?\n\n"
    },
    {
      "time": "16 Dec 2007 — 7:01pm",
      "content": "Nexus (not your cupa tea)  \nFeijoa  \nKingfisher (higher price)\n\n"
    },
    {
      "time": "16 Dec 2007 — 7:41pm",
      "content": "You probably already considered Fournier, as it is such an obvious candidate.\n\nTrinite is also a lovely font, at least at text size. The \"swash\" is made up with an extender character, and works better with some letters than others.\n\nI am curious why using a font once rules it out for more use. Most of us have to use a font many times before we can use it to best effect.\n\n"
    },
    {
      "time": "16 Dec 2007 — 8:40pm",
      "content": "Sirenne\n\n[http://www.mvbfonts.com/html/fonts/sirenne/about\\_sirenne.htm](http://web.archive.org/web/20140320105434/http:/www.mvbfonts.com/html/fonts/sirenne/about_sirenne.htm \"http://www.mvbfonts.com/html/fonts/sirenne/about\\_sirenne.htm\")\n\nBulmer is also nice - not a swash italic exactly but some of the itals have nice flourishes.\n\n"
    },
    {
      "time": "16 Dec 2007 — 9:27pm",
      "content": "And if you do consider Fournier, consider Corundum Text- a tough n' lovely take on Fournier's work.  \nI'm not sure if the italic z alternates are enough for your swash requirements.\n\n[http://www.joshuadarden.com/shop/corundumtext.php](http://web.archive.org/web/20140320105434/http:/www.joshuadarden.com/shop/corundumtext.php \"http://www.joshuadarden.com/shop/corundumtext.php\")\n\n:-) Mikey\n\n"
    },
    {
      "time": "17 Dec 2007 — 1:19am",
      "content": "Stephan, both Clifford and Farnham are too bold and angular for this project, but Clifford is very handsome and I'm glad to have found it.\n\nAs for Caslon being too round, I'd used Adobe's Caslon for the last book by these authors and it was perfect for it, but the o a d c q etc. are very full and give the impression that the point size is actually larger than it is. Most Garamond faces have the opposite effect, looking finer than they actually are.\n\n"
    },
    {
      "time": "17 Dec 2007 — 5:04am",
      "content": "charles\\_e, Fournier is too obviously archaic for this project, I don't want to give the impression that the book is trying to be of the period, but Trinite, especially the roman text, is extremely appealing. A truly beautiful font. The italics though are the rub, as they are not at all French in spirit. Lovely, though.\n\nSUF, Conrundum is definitely a candidate, I'll experiment with it but it may be too bold on the page. Kingfisher is also very strong, though slightly hard-edged. Thank you for pointing them both out.\n\n"
    },
    {
      "time": "17 Dec 2007 — 1:59am",
      "content": "pattyfab,  \nSirene is again too archaic, and once having seen Trinite, Bulmer lacks elegance.\n\n"
    },
    {
      "time": "17 Dec 2007 — 2:14pm",
      "content": "\\> Clifford and Farnham are too bold and angular for this project\n\nI'm confused again by your terminology. Help me.\n\n"
    },
    {
      "time": "17 Dec 2007 — 2:34pm",
      "content": "Like Stephen I am having trouble figuring out exactly what it is you ARE looking for, given the range of fonts you have rejected for various reasons. But maybe Cloister? It has both a cursive and a swash italic.\n\n[http://www.myfonts.com/fonts/lanston/ltc-cloister/](http://web.archive.org/web/20140320105434/http:/www.myfonts.com/fonts/lanston/ltc-cloister/ \"http://www.myfonts.com/fonts/lanston/ltc-cloister/\")\n\nor Hoefler Text (or Titling)?\n\n[http://www.typography.com/fonts/font\\_styles.php?productLineID=100010](http://web.archive.org/web/20140320105434/http:/www.typography.com/fonts/font_styles.php?productLineID=100010 \"http://www.typography.com/fonts/font\\_styles.php?productLineID=100010\")\n\n"
    },
    {
      "time": "17 Dec 2007 — 2:40pm",
      "content": "Fabiol is also worth a gander\n\n"
    },
    {
      "time": "17 Dec 2007 — 8:58pm",
      "content": "Andrew,\n\nCould you please tell me what I will need to do in order to get one copy of this book? The theme sounds awesome. No kidding.\n\n"
    },
    {
      "time": "17 Dec 2007 — 10:19pm",
      "content": "[Apolline](http://web.archive.org/web/20140320105434/http:/www.typofonderie.com/alphabets/view/Apolline/?SID=73674af2549ca44c5eddfc2840f2b11a)\n\nor\n\n[Jannon](http://web.archive.org/web/20140320105434/http:/www.stormtype.com/typefaces-fonts-shop/families-21-jannon)\n\n"
    },
    {
      "time": "19 Dec 2007 — 8:31pm",
      "content": "I second Corundum, but don't forget Sabon (from Linotype with oldstyle figures), a very classic, reliably elegant face used in many museum settings. Buccardi has an intriguing funkiness though the base weight may be a tad heavy, which is not the case with Sabon. Monotype Bulmer is a little too boring and English. Look at Celeste, Dante, Esta, Filosofia, Janson, Van Dijck, and Village--each offers a different take on what you need. Storm has a number of period Garamonds, but be very careful of them.\n\n"
    }
  ]
}
