{
  "id": "4014",
  "title": "WIP: Type Speciment Posters",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey!   \n   \nI just got an idea the other day about making some own type speciments for my favourite typefaces and then make SRA3-posters to frame and put up on my wall. I just finished the second one (Minion Pro) and I would like to get some critique on my work.   \n   \nI will create at least one more but I'm still deciding on what more typefaces I want to pay homage to.   \n   \n [001. Gill Sans](http://web.archive.org/web/20131018075259/http:/www.joacim.net/forum/gillsans_speciment.gif)   \n [002. Minion Pro](http://web.archive.org/web/20131018075259/http:/www.joacim.net/forum/minion_speciment.gif)   \n   \nBest regards,   \nJoacim W\n\n",
  "author": "shamrock",
  "time": "30 Mar 2004 — 2:52am",
  "uid": "2812",
  "comments": [
    {
      "time": "30 Mar 2004 — 10:26am",
      "content": "What a nice idea! You might even be able to sell these. Although that will affect what typefaces you choose... For which you might benefit by looking at top-seller lists and such.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Mar 2004 — 5:29pm",
      "content": "I would buy a Minion poster, as for Gill, well, I have probably made my opinion fairly well known around these parts.   \n   \nHildebrant.\n\n"
    },
    {
      "time": "31 Mar 2004 — 10:18am",
      "content": "I like the quoute on the Gill's specimen.\n\n"
    },
    {
      "time": "31 Mar 2004 — 11:38am",
      "content": "Is the straight quote on the Gill Sans specimen purposeful?   \nJust wondering.\n\n"
    },
    {
      "time": "12 Apr 2004 — 11:19pm",
      "content": "Some of the spacing on the Minion poster could use some work: there are nasty gaps in some of the text samples.\n\n"
    },
    {
      "time": "12 Apr 2004 — 8:41pm",
      "content": "I'd think designers would certainly appreciate an oversize specimen, particularly of the format you used on Minion, with uc&lc as well as alternates and ornaments.   \n   \nThumbs up on the single-spot choice, too.\n\n"
    }
  ]
}
