{
  "id": "40151",
  "title": "Why is the Centaur so thin?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi everyone, I’m a new guy.  \nBecause I’m Japanese, I’m sorry for poor use of English.\n\nI am researching about Centaur, and I can’t find an answer about why digital Centaur is so thin compared to that of metal type. Can anyone tell me what happened to Centaur?\n\n [‹ gd ligature](http://web.archive.org/web/20071218164353/http:/typophile.com/node/40168 \"Go to previous forum topic\") [Fuse Magazine and D&AD ›](http://web.archive.org/web/20071218164353/http:/typophile.com/node/39718 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071218164353/http://typophile.com/user/25106\" title=\"View user profile.\">Tosche</a>",
  "time": "<br>",
  "uid": "25106",
  "comments": [
    {
      "time": " 17.Dec.2007 12.25pm",
      "content": "I’d guess because they based the outline, the design, on the metal and not the print.\n\n"
    },
    {
      "time": " 17.Dec.2007 12.27pm",
      "content": "Also I’d guess that they based it on a fairly large size of the metal type. That would also tend to make it weak when shrunk down to text sizes, though it might look fine large.\n\n"
    },
    {
      "time": " 17.Dec.2007 2.30pm",
      "content": "Further to Tiffany’s point:\n\nIn the mid-1970s there was a photo-type version of Centaur that did not suffer from this thin-ness, so characteristic of many photo and digital versions of metal types. Centaur suffered more than most.\n\nThis version was made by proofing the entire Monotype hot-metal character set on newsprint, rather than on the hard, impermeable repro paper commonly used. The ink seeped into the paper, gathering weight. These proofs were then used as the basis for that version of Centaur. I do not know what company made this. It may have been a proprietary version for a particular typesetting shop.\n\npowers\n\n"
    },
    {
      "time": " 17.Dec.2007 4.32pm",
      "content": "Unfortunately Centaur wasn’t the only typeface that developed severe anaemia when digitized. It always baffles me how major foundries, able to afford the best brains in the business, could blunder so spectacularly. It wasn’t like the behaviour of modern printing technology was exactly unknown!\n\n"
    },
    {
      "time": " 17.Dec.2007 5.19pm",
      "content": "<cite>It always baffles me how major foundries, able to afford the best brains in the business, could blunder so spectacularly.</cite>\n\nThey rushed. Everyone wanted get those photo types out fast, before the other guys ate up all of the sales. It happened again with the digital fonts, and in some really awful cases, crummy phototypes got digitized because nobody went back to the metal.\n\n"
    },
    {
      "time": " 17.Dec.2007 5.21pm",
      "content": "It is all due to ignoring what I call “ink squish” - the fact that metal type allowed the ink to spread into the paper - creating a warmer and heavier looking font. I actually think that some fonts look better output to lower resolution imagesetters because they are closer to the letterpress (ink on metal type) version.\n\n"
    },
    {
      "time": " 17.Dec.2007 7.37pm",
      "content": "<cite>wasn’t the only type . . .</cite> Hell, they are almost all bad this way. Not only the overall thinness, but the contrast between the thick & thin strokes. With letterpress, the fine lines of the metal bit into the paper a little more, lessening the contrast.\n\nPart of it was rushing. Janson went from the most popular (2nd most popular?) Linotype font in the linecaster days to “not used” in the Linotron 202. The lower-case “oh” looked like two small parentheses. Janson Text was a partial fix. It took me three solid weeks to get a Janson I liked.\n\nIf your license allows, you can fix most of them. Centaur would be one of the tougher ones, as getting the contrast right is quite important. We had designers keep using it in spite of my objections. Finally my business partner said we had to do something, so I just emboldened it in Fontographer — about 3-4 units, as I remember. Not a cure, just a band-aid. I got stubborn & decided not to spend the hours needed to re-work the contrast, esp. since in metal varied a fair bit. Perpetua is similar. The 14-point master was about the smallest that would work. Now you get people wanting to use it at text sizes. To do that correctly would involve reinventing the font, as it just wasn’t originally meant to be used that way. A lot of work & probably no one would be pleased.\n\nThere is a lot to recommend in many of the older metal faces. Just remember that Linotype & Monotype, by in large, never made good versions of the metal fonts for photocomp, early digital, or PostScript. By the 70s & 80s, they were being sold & sold again to companies looking only at the profit line.\n\nIf you have the patience, you can rework them for your own use, and they will rival or exceed most of the new stuff.\n\nJust a old 20th century guy’s opinion.\n\n"
    },
    {
      "time": " 17.Dec.2007 9.08pm",
      "content": "Tosche\n\nTo respond to your question I would suggest that Centaur is likely as it is supposed to be (though it was likely patterned after photofilm renditions rather than metal). The difference between the digital and the metal would be that you are looking at, in the latter, are specimens of the face as printed with a process that has inherent weight added to it (via ink spread and the optical additive of impression). Easily 5% at minimum.\n\nThe original designs are themselves rather thin in the Monotype metal version. And, it was a very poorly structured face in that regard as it does not hold up well under repeated printing (letterpress). The digital version, printed via the photopolymer plate process has much more strength but this is due to the differing relief structure.\n\nIn terms of a digital typeface per se, well you can’t always get what you want, especially when differing type production technologies are involved.\n\nGerald\n\n"
    },
    {
      "time": " 17.Dec.2007 11.01pm",
      "content": "Thank you so much everyone!  \nI have never seen a photo-type of Centaur. Does anyone know the book or specimen that I can find it (or show me directly)?\n\nTiffany  \nWilliam\n\nThere were 4 drawings of Centaur according to type size in the metal age, and digital version was probably made from text size.\n\n ![](http://web.archive.org/web/20071218164353im_/http:/typophile.com/files/centaur-size-difference_6103.jpg)\n  \nI collected proofs of metal type and compared to the digital version, and I found that the 42pt is not the original of the digital one (maybe 42pt was made from the same drawing as 60 or 72pt).\n\ncharles\n\nYes, actually I am re-digitizing Centaur as my graduation work. It is thicker than the existing one, but not too much. In fact I have another kind of question.\n\n ![](http://web.archive.org/web/20071218164353im_/http:/typophile.com/files/strasse_3445.jpg)\n  \nRight now eszett in Centaur looks like B, but this is originally a ligature of sz, not ss, and it is less calligraphic than other characters. I changed the shape but I don’t know wether my decision is right. How do German (or European) people think about it?\n"
    },
    {
      "time": " 18.Dec.2007 4.24am",
      "content": "\\>The 14-point master was about the smallest that would work. Now you get people wanting to use it at text sizes. To do that correctly would involve reinventing the font, as it just wasn’t originally meant to be used that way. A lot of work & probably no one would be pleased.\n\nI think Charles has really nailed it in the above. I have found in my revival of Caslon that the contrast issue is one of the most important to getting the warmth of older metal type, and it requires creative effort to get a good result. (I discussed this in my talk at TypeCon 2006.) As Charles says, 14 point is not in fact a text size. I believe that using 14 point metal masters is one reason why so many initial digital versions of classics were anemic when used in text (9-12 pt).\n\nI know from his posts here at Typophile the Raph Levien also has had the ambition of producing a text Centaur, but I don’t know how far he has gotten with it. He says [here](http://web.archive.org/web/20071218164353/http:/levien.com/type/myfonts/), where you can see a sample, that he expects it will take him years to get it right.\n\n"
    },
    {
      "time": " 18.Dec.2007 5.25am",
      "content": "Tosche\n\nFirst of all, don’t look only at drawings. Look at printed work, and “real” books are often more helpful than specimen sheets.\n\nMaybe what shows on the screen with your example is just an artifact of getting them on the screen, but if you look at a printed letter (printed letterpress), there will be a blacker ring around the outside of the letter, and the center of each stroke will be a touch lighter.\n\nYou probably know how Monotype made their matrices, so at one level, replicating the drawings may simply replicate the problem. The drawings used as templates also had to allow for “ink squish,” what we want is the letterform after it was printed.\n\nAn expensive book, but worth it to some one in your situation, is Fred Smeijers <cite>Counterpunch</cite> from the Hyphen Press. You are in effect making a digital punch, and the thinking is the same as for someone making a metal punch.\n\nIn passing, 14-point is on the upper edge of text size. Monotype sizes were a little smaller than Linotype, but in the earlier photocomp days, Linotype would use a 12-point master for “text” fonts, this being a compromise between most test sizes (8-10) and, lets, say, subhead/chapter head sizes (12-20+ points).\n\nBut is is the <cite>design</cite> of the letterform that is most important, not its nominal size — of course, ther is usually a strong correlation here.\n\n"
    },
    {
      "time": " 18.Dec.2007 5.53am",
      "content": "_They rushed._\n\nNonetheless, they thought they were doing a good job.\n\nIt’s easy with hindsight to see how we went from A to B, but what if we had gone to X instead?  \nThere were many aspects of the high resolution, digital workflow that we had to come to terms with.\n\nDuring the early 1990s there was a vogue for ITC Garamond Light Condensed in graphics (and other) publications such as catalogues. It was set small and tight, very tidy. Now, that would have been problematic with the previous generation of phototype technology, because the fine details of that typeface tended to vanish as it was reproduced photographically several times during the production process. So here was a new look—and the high res digital workflow also made using Helvetica 25 and 35 practical at smaller sizes. Who was to say that “squishy” letterpress gain would be required in the digital age? Wouldn’t that be like faking the sound of original instruments in a Baroque recording? Bauer Bodoni was another typeface that was popular for text in the early days of digital; it certainly looked a bit anemic to me, but a lot of people were attracted to its extremely fine details. The novelty appealed, perhaps, and the thrall of high-tech slickness.\n\nAnd unless a typeface was produced with size-specific variations, a version that corresponded to a “middle size” was appropriate for use in deck and display settings, as well as printed on a 300 dpi laser printer.\n\nThere were foundries producing size-specific fonts from the early days of digital type—those that catered to magazines and newspapers, such as Font Bureau and Hoefler of course, and many other type designers, myself included, were wrestling with the problem of getting the classic letterpress genre of text typefaces to look good in the high res environment. But it’s not a simple task—making Jenson look good in successive waves of technology is the grail of typography.\n\n"
    }
  ]
}
