{
  "id": "40164",
  "title": "Great Book for Font Developers",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I was doing some Christmas shopping yesterday and spotted this at the local B&N:\n\n[Fonts and Encodings](http://web.archive.org/web/20131101014812/http:/www.oreilly.com/catalog/9780596102425/index.html), by Yannis Haralambous.\n\nThe French edition has been out for a while, and I was looking forward to an English edition. Apparently, it has been out since September.\n\nThis book is really amazing, and a must-have for font developers.\n\n",
  "author": "Mark Simonson",
  "time": "18 Dec 2007 — 7:42am",
  "uid": "1043",
  "comments": [
    {
      "time": "18 Dec 2007 — 7:55am",
      "content": "Indeed, an excellent book.\n\nA.\n\n"
    },
    {
      "time": "18 Dec 2007 — 7:58am",
      "content": "Can you give some examples what you liked about the book? What's in there, that's not in other books?  \nI stumbled over the book several times, but always hesitated to buy it.\n\nRalf\n\n"
    },
    {
      "time": "18 Dec 2007 — 8:12am",
      "content": "I've only had the book since yesterday, so I haven't read the whole thing. But, from what I have read and looked at, it appears to be very thorough and lucid. The writing style is engaging with a bit of subtle humor (even sarcasm at times), which can be illuminating in its own way.\n\nWhat attracted me to this book is the way it gathers a huge amount of information into one place. Sure, you can find all of it (and more) on, for example, Microsoft's, Apple's, and Adobe's websites, but it's nice to have it summed up in one book, and from a (presumably) more objective observer. And if you do need further information, links are included to the relevant documents on the Web.\n\nWhat other books are comparable?\n\n"
    },
    {
      "time": "18 Dec 2007 — 8:25am",
      "content": "I have noticed a few typos, however: \"RoboLab\" instead of \"RoboFab\" on page 442.\n\n"
    },
    {
      "time": "18 Dec 2007 — 8:29am",
      "content": "I’m buying it just for geek cred. What could possibly be geekier than an O’Reilly book about fonts and encodings?\n\n"
    },
    {
      "time": "18 Dec 2007 — 8:43am",
      "content": "What about \"Unicode Explained\"? Anyone read that one?\n\n[http://www.oreilly.com/catalog/unicode/](http://web.archive.org/web/20131101014812/http:/www.oreilly.com/catalog/unicode/ \"http://www.oreilly.com/catalog/unicode/\")\n\nChrisL\n\n"
    },
    {
      "time": "18 Dec 2007 — 8:50am",
      "content": "\"writing style is engaging with a bit of subtle humor (even sarcasm at times),\"\n\nSounds like my kind of book and written by a reknown Greek typographer!\n\nChrisL\n\n"
    },
    {
      "time": "18 Dec 2007 — 8:58am",
      "content": "\\> I was doing some Christmas shopping yesterday and spotted this at the local B&N:\n\nFonts and Encodings, by Yannis Haralambous.\n\n[http://www.typophile.com/node/38641](http://web.archive.org/web/20131101014812/http:/www.typophile.com/node/38641 \"http://www.typophile.com/node/38641\")\n\n"
    },
    {
      "time": "18 Dec 2007 — 9:04am",
      "content": "I think the Unicode book is geared towards working with and taking advantage of Unicode in documents from a user's perspective.\n\n"
    },
    {
      "time": "18 Dec 2007 — 9:02am",
      "content": "\\> [http://www.typophile.com/node/38641](http://web.archive.org/web/20131101014812/http:/www.typophile.com/node/38641 \"http://www.typophile.com/node/38641\")\n\nI missed that thread, and it didn't show up when I did a Typophile search on the author's name. (Should have used Google--d'oh!)\n\n"
    },
    {
      "time": "18 Dec 2007 — 9:48am",
      "content": "Thanks Mark!\n\nChrisL\n\n"
    },
    {
      "time": "18 Dec 2007 — 9:50am",
      "content": "I missed that thread too, David.\n\nChrisL\n\n"
    },
    {
      "time": "18 Dec 2007 — 10:44am",
      "content": "Yeah, I also recommend getting the Unicode Explained book. I think many of the non-super-technical font developers and type designers will find there good, concise and practical explanations of not only the Unicode Standard but also many implementation issues around it.\n\nA.\n\n"
    },
    {
      "time": "18 Dec 2007 — 10:54am",
      "content": "And see this one [Unicode Demystified: A Practical Programmer's Guide to the Encoding Standard](http://web.archive.org/web/20131101014812/http:/www.amazon.com/Unicode-Demystified-Practical-Programmers-Encoding/dp/0201700522/ref=pd_sim_b_img_4)\n\n"
    },
    {
      "time": "18 Dec 2007 — 11:32am",
      "content": "Now you made me order \"Unicode Explained\" too, Adam :-)\n\nChrisL\n\n"
    },
    {
      "time": "18 Dec 2007 — 12:21pm",
      "content": "\\* adds two more books to the xmas wishlist \\*\n\n"
    },
    {
      "time": "18 Dec 2007 — 1:16pm",
      "content": "\\> I missed that thread  \n\\> I missed that thread too\n\nThat's OK :)\n\n"
    },
    {
      "time": "18 Dec 2007 — 4:58pm",
      "content": "Oh, my...\n\nI've noticed one alarmingly serious flaw in the book: Everywhere that code is shown, which is set in monospaced type (Letter Gothic), whenever there is a negative number, only the minus sign is present--no numeral. At first I wasn't sure, but it seems to be consistent throughout the book.\n\nO'Reilly has really messed up. I think they need to pull the copies and issue refunds or something.\n\n(Seems like I saw another book where this happened, but I can't quite remember what it was...)\n\n"
    },
    {
      "time": "18 Dec 2007 — 5:07pm",
      "content": "I just sent an errata notice to O'Reilly.\n\n"
    },
    {
      "time": "18 Dec 2007 — 5:13pm",
      "content": "(Actually, it's not Letter Gothic, but something similar.)\n\n"
    },
    {
      "time": "18 Dec 2007 — 7:13pm",
      "content": "And it's available used through Amazon for less than $56.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "19 Dec 2007 — 1:27am",
      "content": "\\* takes one book off the xmas wishlist \\*\n\n"
    },
    {
      "time": "19 Dec 2007 — 7:38am",
      "content": "The book is also missing or unavailable for reading online on O'Reilly's Safari service. Maybe this means they have pulled it and are correcting it (I hope).\n\nIt's a real shame because the book is otherwise terrific. I am very reluctant to return it, even in it's current state.\n\n"
    },
    {
      "time": "19 Dec 2007 — 7:56am",
      "content": "My copy should arrive tomorrow from Amazon. I assume O'Reilly will send errata sheets or some such thing to make the code right for us.  \nChrisL\n\n"
    },
    {
      "time": "19 Dec 2007 — 9:37am",
      "content": "The book is about 1000 pages. I found missing number errors on 65 pages. Curiously, the code listings in the TEX sections seem to have been spared.\n\nHow could something like this happen? A bug in a formatting script perhaps?\n\n"
    },
    {
      "time": "19 Dec 2007 — 11:16am",
      "content": "Seems like it, Mark. My guess is the minus sign triggered some sort of hidden text function that requires some sort of exception tag.\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2007 — 11:27am",
      "content": "It's the hyphen, actually. So, \"utf-8\" appears as \"utf-\" in the book, for example.\n\n"
    },
    {
      "time": "19 Dec 2007 — 11:33am",
      "content": "Kind of ironic considering that the book concerns itself partly with describing the advantages of XML and TEX-based typesetting systems, and such a system was used to produce the book.\n\n"
    },
    {
      "time": "19 Dec 2007 — 11:52am",
      "content": "Kinda like Jim Fixx dieing of a heart attack?\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2007 — 12:13pm",
      "content": "\"Kinda like Jim Fixx dieing of a heart attack?\"\n\nWill the old timers please stand and be recognized. That was what, a hundred years ago? I remember the sense of irony well. I guess I thank god for my knees going before my heart.\n\nThanks Mark for the good and bad news.\n\n"
    },
    {
      "time": "19 Dec 2007 — 12:52pm",
      "content": "My knees went too and my heart followed several years later :-)\n\n[http://www.halhigdon.com/Articles/Fixx.htm](http://web.archive.org/web/20131101014812/http:/www.halhigdon.com/Articles/Fixx.htm \"http://www.halhigdon.com/Articles/Fixx.htm\")\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2007 — 11:21pm",
      "content": "I can't say how the French edition is, but the English edition is just riddled with errors. Most are typos and the like, but some of the errors are pretty serious. For example, in the introduction it claims that the standard em square is 1024 x 1024 for PostScript fonts, and 4096 x 4096 for TrueType fonts. Of course, the correct values are 1000 x 1000 and 2048 x 2048 - and that difference between 1000 and 1024 is important, because it means that the TrueType norm is not a simply multiple of the Type 1 (\"PostScript\") norm.\n\nIt's a shame, because it is a wonderfully ambitious book and covers an amazing amount of ground. A second edition that corrected the errors could be a truly great book.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "20 Dec 2007 — 5:50am",
      "content": "My copy arrived last night. I will write to the publisher and see what they say.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2007 — 6:52am",
      "content": "I wrote to them about the negative number omissions using their online errata form for the book. I also heard back about the lack of an online edition, but no real answer yet, just a note to say the question has been forwarded to the author and publisher. (I thought O'Reilly was the publisher, but I guess it's more complicated than that.)\n\nI can confirm Thomas's comment about the book being \"riddled with errors.\" I'm noticing more little things the more I read it. I can look past the mistakes when I know better, but it makes it hard to trust the information that's new to me.\n\n"
    },
    {
      "time": "20 Dec 2007 — 7:26am",
      "content": "I was hoping to use the book as a reference to fill in my knowledge gaps. There are plenty of cases where I would not know there was an error so this makes me leery of the value in reading it. :-/  \nThe woes of translation are compounded when you need both technical and language skills to proofread the manuscript.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2007 — 7:42am",
      "content": "I guess until a corrected edition is out, it will be a bit like the Wikipedia. Gloriously deep, but suspect.\n\n"
    },
    {
      "time": "20 Dec 2007 — 3:27pm",
      "content": "I find Wikipedia more reliable. :/\n\nI really wanted to recommend this as a reference for Adobe tech support, but I just can't, yet. I hope for a second edition. I've been accumulating all my little bugs in an email to send to O'Reilly.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "20 Dec 2007 — 3:49pm",
      "content": "I knew there was a reason I didn’t put it on my Amazon wish list. That and I would have to actually, you know, design and release fonts to make it useful.\n\n"
    },
    {
      "time": "21 Dec 2007 — 12:24am",
      "content": "Here is [Yannis Haralambous](http://web.archive.org/web/20131101014812/http:/typophile.com/wiki/Yannis%20Haralambous)' [personal site](http://web.archive.org/web/20131101014812/http:/omega.enstb.org/yannis/), in case you want to contact him directly about the errors.\n\n"
    },
    {
      "time": "21 Dec 2007 — 5:32am",
      "content": "Thanks, Stewf!\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2007 — 7:46am",
      "content": "James said,  \n\"That and I would have to actually, you know, design and release fonts to make it useful.\"\n\nActually I was interested in it to find out more about specifying type on websites. Is it only useful for font design? I'm still interested, but at the cost I'm inclined to wait for the next edition.\n\n"
    },
    {
      "time": "21 Dec 2007 — 8:09am",
      "content": "It does have a chapter (about 50 pages) called \"Fonts and Web Pages\" in which he talks about of using fonts on the Web as well as efforts to expand the range of typefaces available for use on the Web, such as TrueDoc, WEFT, GlyphGate, and SVG.\n\n"
    },
    {
      "time": "21 Dec 2007 — 8:20am",
      "content": "I was excited to read this book until I got 1/2 way through the thread.\n\nThat said, I'll be holding out until the second edition.\n\n"
    }
  ]
}
