{
  "id": "40171",
  "title": "Technical question about 0 kb font files.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This is about packaged files that I received from my art director. When he packaged the font DIN and I open it, the info says that it is 0 kb and there is no file extension. I can't load it in Fontbook or Suitcase. Any suggestions? Thank. Oh and if this is posted somewhere else please let me know. I am new on this board and haven't really browsed around too much.\n\n",
  "author": "The Big Squid",
  "time": "18 Dec 2007 — 9:13am",
  "uid": "25184",
  "comments": [
    {
      "time": "18 Dec 2007 — 9:43am",
      "content": "If they are Mac suitcase files, then, most likely, the resource fork (part of the file) was lost. In Mac font suitcases, this is where all the data is stored, which is why the files are 0 kb. This can happen if the files were transfered to some non-Mac file system. Non-Mac file systems cannot \"see\" the resource fork and it doesn't get copied.\n\n"
    },
    {
      "time": "18 Dec 2007 — 9:50am",
      "content": "One other thing: If the font suitcases were emailed, you can lose the resource fork that way, too. The best solution, if the fonts are to be transfered over the internet, is to compress the files using StuffIt or use OS X Finder's \"archive\" feature to create a .zip file containing the fonts. When the fonts are uncompressed on the receiving end, the resource forks will be intact. (This is all assuming the computer on the receiving end is also a Mac.)\n\n"
    },
    {
      "time": "18 Dec 2007 — 10:06am",
      "content": "I've had problems with .zip files losing their resource fork. I've since only used .sit and had no problems.\n\n"
    },
    {
      "time": "18 Dec 2007 — 10:07am",
      "content": "Oh. Mark covered it. :^)\n\n"
    },
    {
      "time": "18 Dec 2007 — 10:18am",
      "content": "My advice is the same as Mark's and Tiffany's... Have them use StuffIt on the font files before e-mailing or switching to a non-Mac platform.\n\n"
    },
    {
      "time": "18 Dec 2007 — 10:34am",
      "content": "I think the .zip option only works if you do it from the Finder compress/uncompress command on both ends. If you make the .zip file using some other utility, it probably won't work.\n\n"
    },
    {
      "time": "18 Dec 2007 — 12:11pm",
      "content": "Thanks for the comments I will try to unzip a couple different ways. This is mac to mac btw.\n\n"
    }
  ]
}
