{
  "id": "40191",
  "title": "Currency warning for fonts.com",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I just noticed a peculiarity on the fonts.com site (Monotype) that could end up making you pay more than you need to for a font. The site figures out what country you're in and displays the prices in the appropriate currency. But currencies fluctuate relative to each other, and this pricing apparently isn't live.\n\nFor example, I'm in Canada, and a font was displaying $43 CAD. Switching the display to U.S. currency, I found the price is $35 USD. But the two currencies are about equal now. It should be about $35 CAD as well.\n\nBottom line: check the exchange rates and compare with other currencies. You might save money buying in something other than your home currency. Not a problem paying by credit card: the credit card company will convert it to your own currency on your bill.\n\nI've emailed Monotype about this; will post their response when I receive it.\n\n",
  "author": "Gary Long",
  "time": "18 Dec 2007 — 8:15pm",
  "uid": "19337",
  "comments": [
    {
      "time": "18 Dec 2007 — 8:29pm",
      "content": "Also there may be an extra charge from your own bank for making an overseas purchase. I usually get charged $5.00 for shopping at Linotype.\n\n:-) Mikey\n\n"
    },
    {
      "time": "19 Dec 2007 — 6:05am",
      "content": "Gary\n\nIs that the actual price, or just a guide set up to approximate the cost? I suspect that they bill in USD and this might just be something set up before GWB decided to spend the US down to our level. If they bill in USD, then you will get the actual rate, (less the credit card conversion gouge charged by your particular card).\n\n"
    },
    {
      "time": "21 Dec 2007 — 6:48am",
      "content": "Gary, I've seen it in publishing with Can and US prices. When US was 5.99 CAN was 8.99  \nFor March of 2008, one publisher dropped the CAN price and it will be 5.99 for both  \nbut in April of 2008 it becomes 5.99 in US and 6.99 in CAN\n\nI don't know why - and I don't know how they predict the future of currency - I just typeset it!\n\n"
    },
    {
      "time": "21 Dec 2007 — 9:49am",
      "content": "I had a reply from Monotype about the currency matter, and they're looking into it.\n\nDon--I didn't go far enough through the checkout to see if they actually billed everything in USD, as I wasn't purchasing the font. I should have experimented with that. Still, if they're going to have prices visible in different currencies for the convenience of customers, they should be reasonably close to reality.\n\nJackie--I do book work too, and it has been a real hassle up here in Canada with the exchange rate changing so much in the last few months. I don't print a price on books in cases where I have the say--the stores can put their own sticker on.\n\n"
    }
  ]
}
