{
  "id": "40205",
  "title": "P22 type foundry - Music & Fonts",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20080220103608/http:/typophile.com/user/108 \"View user profile.\") : 19.Dec.2007 8.04am \n\nDecember 19, 2007\n\nP22 announces the P22 Music Text Composition Generator, a free online music utility that allows any text to be converted into a musical composition. This composition is displayed in musical notation and simultaneously generates a midi music file that is played back on your computer. The P22 MTCG was programmed by designer Colin Kahn from an idea conceived by P22 creative director Richard Kegler.\n\n[http://p22.com/musicfont/](http://web.archive.org/web/20080220103608/http:/p22.com/musicfont/ \"http://p22.com/musicfont/\")\n\nA P22 Music Composition Font was originally proposed in 1997 to the John Cage Trust as an accompaniment to the John Cage text font based on the handwriting of the composer. The idea was simple- every letter of the alphabet was assigned to a note on a scale. This would allow for any text to be converted into musical notation. The idea was rejected by the John Cage Trust. However, the John Cage Silence font, based on his famous 4’33” Composition, was accepted and continues to be offered for sale to this day. An earlier project based on the work of Marcel Duchamp was also influential in the evolution of this project.\n\n[http://www.p22.com/products/cage.html](http://web.archive.org/web/20080220103608/http:/www.p22.com/products/cage.html \"http://www.p22.com/products/cage.html\")\n\nThe font used in the P22 Music Text Composition Generator closely follows the initial Cage inspired idea. Each letter, number and punctuation mark is assigned a note on the C major scale. When the user generates their composition, the same substitutions are applied to their text that the soon to be released Opentype font performs. These substitutions are based on the frequency of phonetic sounds and letters in the English language corresponding to the most common ranges in the human voice and note durations. The generated score can be printed and the midi file can be saved to your hard drive (note to MAC users- the midi file can be imported into Garageband). The font will be available in two formats; a basic version that can create pages of sheet music in any word processing or design application as well as a separate font of notation symbols and an expanded Opentype version that will additionally include contextual chords and the full range of notation symbols.\n\nP22 type foundry has a long history of combining music and fonts. The P22 record label has 17 releases that include: Futurismo, the first ever soundtrack to a font, based on Italian Futurist music manifestos; 2 CD re-issues of Rod McKuen recordings that include fonts on the CDs; The William Caslon Experience CD of electronic down-tempo music along with a “remixed” font on the CD as well as a printed specimen of the expanded LTC Caslon font family. In addition, P22 partner Jimy Chambers is a professional musician (current project Odiorne) and original member of modern rock iconoclasts, Mercury Rev.\n\n[http://www.p22.com/records/](http://web.archive.org/web/20080220103608/http:/www.p22.com/records/ \"http://www.p22.com/records/\")\n\nRichard Kegler presented an overview of the P22 music projects at recent international design conferences in Berlin & Seattle.\n\n[http://www.fontshop.de/typo2007/index.php/Richard+Kegler;82/3](http://web.archive.org/web/20080220103608/http:/www.fontshop.de/typo2007/index.php/Richard+Kegler;82/3 \"http://www.fontshop.de/typo2007/index.php/Richard+Kegler;82/3\")\n\n————————-  \nHappy Holidays and Best Wishes in the New Year!  \nP22 Type Foundry  \n——————————————-  \nP22 type foundry, Inc.  \nNot your typical type™  \nPO Box 770  \nBuffalo, NY 14213  \n [http://www.p22.com](http://web.archive.org/web/20080220103608/http:/www.p22.com/ \"http://www.p22.com\")  \nPhone: 716-885-4490  \nFax: 716-885-4482  \n——————————————-\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080220103608/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 19.Dec.2007 8.04am",
  "uid": "108",
  "comments": [

  ]
}
