{
  "id": "4020",
  "title": "Logotype kerning critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a recent identity project I am doing for a client. Rather than leaving it at default, I adjusted the kerning until it looked to my satisfaction. I just wanted to get some feedback from this forum, since most design forums focus more on layout and the macro-aesthetics and I am trying to fine tune the micro.   \n   \nbtw, this identity is for a mortgage company   \n-Frank   \n   \n   \n ![](http://web.archive.org/web/20131023204455im_/http:/www.typophile.com/forums/messages/29/32285.gif)\n\n",
  "author": "franklin_new",
  "time": "30 Mar 2004 — 8:31am",
  "uid": "3164",
  "comments": [
    {
      "time": "30 Mar 2004 — 9:13am",
      "content": "How would this work at 24 points?   \nI think your first issue to tackle is balance.   \nYou have really big, and really small.   \nScale the whole thing down to 24 points, print it on a laser printer, and then re-acess the balance issue.\n\n"
    },
    {
      "time": "30 Mar 2004 — 9:31am",
      "content": "Frank - A few things ...\n\n"
    },
    {
      "time": "30 Mar 2004 — 11:54am",
      "content": "Never use quotes in a tagline. There's no reason to do so and, if anything, hints at it being not literal. (BTW, that is a poor tagline...it's way too generic to really have any weight.)   \n   \nI agree with Kyle. It's hard to look at the micro until the macro issue of scale and balance is addressed. I'd suggest leaving the type as-is and shrink the logo down to 10/20% of its current size.\n\n"
    },
    {
      "time": "30 Mar 2004 — 8:06pm",
      "content": "I made some changes to the design   \n   \n1.) I raised the house-shaped counters higher to reduce any optical weight at the top.   \n   \n2.) The \"doorknobs\" have been reduced in size yet still maintain its intended impact   \n   \n3.) The typeface size has been increased dramatically to balance out the two forms.   \n   \nQ.) How does one feel about the way I positioned the typography?   \n   \n-Frank   \n   \n   \n   \n   \n ![id: the mplace](http://web.archive.org/web/20131023204455im_/http:/www.typophile.com/forums/messages/29/32310.gif)\n\n"
    },
    {
      "time": "30 Mar 2004 — 8:59pm",
      "content": "Since you asked about kerning, I think h-e and a-c are a bit too loose.   \n   \nAs for the position, well, gosh, I don't know. I can't see any kind of intent behind it. Align something with something.\n\n"
    },
    {
      "time": "30 Mar 2004 — 9:12pm",
      "content": "This is a bit off, but am I the only one who feels that the m with the dots looks kinda like a weird old 80s videogame character or like a simplified face of a comic book character... with the doors/knobs as eyes? Is that intended? Especially from a distance that is the effect I get from the m. Not bad per se, but I wonder if that is what you wanted.   \n   \nThe relationship between typo and visual mark has improved, specially as the wrong quotationmarks are gone... but there seems to be no specific kind of logic behind the positioning of the mplace text, or is there? It just doesn't feel very... constructed.\n\n"
    },
    {
      "time": "30 Mar 2004 — 10:21pm",
      "content": "_This is a bit off, but am I the only one who feels that the m with the dots looks kinda like a weird old 80s videogame character or like a simplified face of a comic book character_   \n   \nThat's exactly what I thought, too.   \n   \nMaybe shorten the length of the \"m\" legs? Those dots are too small, but I think they'll look even worse bigger. Eliminate them?\n\n"
    },
    {
      "time": "31 Mar 2004 — 4:42am",
      "content": "Why is the guy with the blue roman helmet looking to the left?\n\n"
    },
    {
      "time": "31 Mar 2004 — 6:32am",
      "content": "I see people are reading more into the graphics than just two houses...humanistic interpretations aren't neccesarily a bad thing, at least it draws in some level of participation...tonight I am going to post another variation and also explain some design methodology which might clarify..   \n   \n-Frank\n\n"
    },
    {
      "time": "31 Mar 2004 — 9:09am",
      "content": "Frank:   \n   \nI am confused by the spacing between \"m\" and \"space\"\n\n"
    },
    {
      "time": "31 Mar 2004 — 9:51am",
      "content": "Silos... The blue shapes have to be something.   \n   \nIF you make a house out of negative space, I am going to want to make the positive shape into something too. I made it a silo.   \n   \nI came into this discussion late, so excuse me if I am repeating.   \n   \nThe houses are very elongated. Are you trying too hard to force the houses into an M?   \n   \nIf you put a rectangle on the house, I would instantly know its a door. If you put a dot, it could be an eye, as many have said. If you put a dot on a door, it would be a doorknob.\n\n"
    },
    {
      "time": "15 Apr 2004 — 2:17pm",
      "content": "With regard to the logo, I'd make the whole darn thing shorter. Normal houses aren't that tall relative to their width, and excepting a ski chalet, you won't see that acute pitch on a real roof.   \n   \nWhat if you used a 'real' lc M from the same face as the caption line, and suggested houses in the negative space with a door, knob, and window? You'll have more unity in the design and it might be more obvious that the spaces are houses.   \n   \nAs for the logo text itself, using all-lc in black and ocean blue is reminiscent of AT&T's mmode/mlife thing. What about normal capitalization\n\n"
    },
    {
      "time": "22 Apr 2004 — 12:47am",
      "content": "The first thing I see is a pair of eyes, and only afterwards, a connection to a house.   \n   \nI feel the logo is too shy to come out to play!   \n   \nk\n\n"
    },
    {
      "time": "17 May 2004 — 10:10pm",
      "content": "Hey I almost forgot about this post...I just wanted to thank everybody for commenting and giving their two cents.   \n   \nWell the client liked one of my latest incarnations and thus the project is finished...   \n   \n(In hindsight I think I should have posted the logo at a smaller size so one could gage the macro-aesthetic character...it seemed like everybody was looking at it realll close and only then would different interpretations come up...at work when I had printed out the piece in regular/smaller size, there seemed to be no confusion....)   \n   \nAgain, thanks for all the help and feedback   \n   \n-Frank\n\n"
    }
  ]
}
