{
  "id": "4023",
  "title": "3D nostalgia",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone have any tips on how you can make type (the finished product that is) look more soft/natural/3D and less harsh/digital/2D? I think most of what I'm getting at is the difference between old books and new ones. I've had some limited success by printing, scanning, and reprinting, but you can only do that so much. Maybe there's certain kinds of paper that bleed slightly?   \n   \nSorry if this isn't a very clear question... it's hard to describe what I have in mind. I just don't always like the ultra-crisp way type looks laser-printed on white paper.\n\n",
  "author": "figbash_acrobat",
  "time": "30 Mar 2004 — 11:31am",
  "uid": "2091",
  "comments": [
    {
      "time": "30 Mar 2004 — 11:55am",
      "content": "use newsprint?\n\n"
    },
    {
      "time": "30 Mar 2004 — 12:20pm",
      "content": "You're referring to a more tactile look in a final produced piece of artwork . . .   \n   \nOne trick is to adjust the level of contrast of the text over its surface so instead of 100% black over 100% white, try 95% Dark Brown over 90% Ivory.   \n   \nAnother trick is selecting fonts that already have a printed look to them, one comes to mind by Mark Simonson is here: [http://www.ms-studio.com/FontSales/metallophilesp8.html](http://web.archive.org/web/20131107020502/http:/www.ms-studio.com/FontSales/metallophilesp8.html)   \n   \nStuart :D\n\n"
    },
    {
      "time": "30 Mar 2004 — 12:53pm",
      "content": "I'll try that sometime... although one problem is I don't have easy access to a color printer. But I suppose 95% gray would have a similar effect. And I'll also try newsprint, or just rougher paper in general (maybe I should stop by an art supply store).   \n   \nAnd I really like that Metallophile font... it's interesting he mentioned Futura on that page: I really can't abide Futura when it's ultra-precise looking (like on glossy paper). But I've seen older use it bookswhere it's a lot more tactile, as you say, and it looks really nice.\n\n"
    },
    {
      "time": "30 Mar 2004 — 1:09pm",
      "content": "Instead of 100% black for type, how about a mixture of 50/50/50/50 (that's a guess). That could screw up hairlines on serif type, even without mis-registration.   \n   \nYou could combine this technique with \"graded\" fonts such as Poynter Oldstyle (from the Bureau), one version in 100% black on one layer, another, heavier version in 50/50/50/0 on a back layer.   \n   \nI've designed several faces that incorporate stylized distress that mimics the effect of letterpress type -- Brown, Paradigm, Worldwide, Walburn. (All on view at shinntype.com.)   \n   \nThere is a difference between stylized distress and raw, random distress: classic in this genre is Poliphilus. More recently Founder's Caslon.   \n   \nAnd finally, why not use real letterpress?\n\n"
    },
    {
      "time": "30 Mar 2004 — 6:09pm",
      "content": "Do people still use letterpress? I had assumed (without much evidence) it was more or less history.   \n   \nI like the 50/50/50/50 idea -- I bet that would work.\n\n"
    },
    {
      "time": "30 Mar 2004 — 6:28pm",
      "content": "Physical things like letterpress get obsolete much, much slower than something like a font format! :-) More than _use_, however, most people who use letterpress these days are in fact _abusing_ it. They use its tactile quality as a reactionary escapism from the coldness of the digital world. Valid feelings, but spawning invalid expressions. If this all sounds obscure (it would have to me about 1.5 years ago), it just means you have to get to know letterpress first-hand, and see the contemporary conflict between sensationalism versus substance evolving. It causes things like Tiffany & Co. to commission a letterpess-looking version of their logotype for friggin' $10,000 (never mind that it will generally be applied with foil stamping). How do I loathe thee - let me count the ways...   \n   \nhhp\n\n"
    },
    {
      "time": "6 Apr 2004 — 5:54pm",
      "content": "About letterpress being history, this reminds me.   \n   \nMy teacher said we have one guy somewhere in Montreal who's around 70 and still does letterpress with his machine. Though the technician who could fix the machine died recently so if the machine breaks, we're all pooped. It's kind of ironic when you think about it...\n\n"
    },
    {
      "time": "6 Apr 2004 — 6:32pm",
      "content": "You will find there are MANY people still using letter press. One very commun use of it still (aside from its intended use) is die-cutting things. and variable number prints and such...   \n(over-simplified)   \n   \ncheck out [www.briarpress.org](http://web.archive.org/web/20131107020502/http:/www.briarpress.org/) for more information.   \n   \nHildebrant.\n\n"
    },
    {
      "time": "7 Apr 2004 — 7:14am",
      "content": "\"Do people still use letterpress?\"   \n   \nI used to work as a web designer along side a huge working letterpress:   \n   \n [http://www.blincpublishing.com](http://web.archive.org/web/20131107020502/http:/www.blincpublishing.com/)   \n   \nIt was a nice mix of technologies.\n\n"
    },
    {
      "time": "7 Apr 2004 — 9:13am",
      "content": "There are still quite a few people printing lettrpress in a private press environmnet. A great many of them doing very good work. As Hrant has stated: some doing awful work by over-impressing, and some doing the same by attempting to kiss-impress and under-ink.   \n   \nI am not aware of anyone successfully offering letterpress commercially in Canada, other than in the capacity of numbering and perfing.   \n   \nI occasionally conduct workshops in letterpress and in typecutting. The workshop I instructed at the ATypi conference in Vancouver last Fall had only one attendee . . . from Australia.   \n   \nI am instructing a Chicago man for a few days at my workshop in May in punch and matrix cutting.   \n   \nYesterday a man from Washington state called me and we talked at length about a book he is having letterpressed at Steinhour Press using polymer plates. The book is a good size; around 100 pages. He was looking for a type that looked like it had letterpess roots, and was considering Lanston Type Co.'s Metropolitan. (Since Metropolitan was had digitized directly from the Lanston patterns, I felt that it was as good a choice as any).   \n   \nI am in the midst of a personal project: the limited edition printing of The Adventures of Tom Sawyer. I've cut a new metal type for the book. I am anticipating making about 100 or so copies.   \n   \nIn my part of the world there are two very fine letterpress printers: Barbarian Press and Heavenly Monkey Press, both very active.   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "7 Apr 2004 — 7:49pm",
      "content": "I believe (but I may be mistaken) that Glenn Goluska at the Imprimerie Dromadaire in Montreal is still using a letterpress for printing type. He may be the person you are refering to Emilie (although I don't think that he is 70 yet...)\n\n"
    },
    {
      "time": "7 Apr 2004 — 7:58pm",
      "content": "It might be, the story went through a few people I think so it probably got distorted =) The younger the better, I really hope this gets passed on locally.   \n   \nWhat do you do in Montreal? I believe your family name sounds familiar to me but I'm not sure!   \n   \nEm\n\n"
    },
    {
      "time": "8 Apr 2004 — 6:19am",
      "content": "Here, take a look at this link!   \n [http://www.aaupmontreal04.com/event\\_glenn.html](http://web.archive.org/web/20131107020502/http:/www.aaupmontreal04.com/event_glenn.html)   \n   \nThere are also some other interesting events on the agenda (like the Quark vs InDesign panel) and it is all taking place in Montr\n\n"
    },
    {
      "time": "8 Apr 2004 — 11:34am",
      "content": "Hey cool link! That's weird I didn't even hear of this at UQAM. Though I think I did hear that Denis was going to do a conference so it's probably this one. The rare books at McGill seems to be really interesting too.   \n   \nWhat's the AAUP exactly?   \n   \nHmm, I'm getting out of uni in 3 weeks and my favorite areas for the past two years have been corporate and books. Any openings? =)\n\n"
    },
    {
      "time": "8 Apr 2004 — 4:04pm",
      "content": "\\> What's the AAUP exactly?   \n   \nAAUP is the Association of American University Presses. They have a general meeting every year, and this year McGill-Queen's in Montreal is the host. I am not sure if the whole event is open to the public however...I was told that space was limited and they would let me know if I could attend.\n\n"
    }
  ]
}
