{
  "id": "40231",
  "title": "evolution of type",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I thought itd be interesting to see if any of you could come up with something which involved the evolution of type/language.....\n\ni cant get into my photoshop at the mo... but ive started it off in latin/greek and ended up finishing off with chatroom lingo... just wanted to know if anyone else has, made anything similar which theyd care to show?\n\n",
  "author": "koopdoggedawg",
  "time": "20 Dec 2007 — 1:45am",
  "uid": "25250",
  "comments": [
    {
      "time": "20 Dec 2007 — 2:11am",
      "content": "Do you mean info-aesthetically showing the progression, like with graphics and type aiding the information given? It would make a interesting short film/flash presentation.\n\nOtherwise, there have been a few books written about the evolution of type and visual language. I am reading one right now called 'Lettering'.\n\n"
    },
    {
      "time": "20 Dec 2007 — 3:55am",
      "content": "I did this for a year during my MA. I mapped the British museum collection, cataloguing the pieces that had writing on them. I then divided them according to scripts and made a little book.\n\nIt would help me know what exactly you're talking about if you posted an example. But yeah, it sounds interesting!\n\n"
    },
    {
      "time": "20 Dec 2007 — 6:43am",
      "content": "\\> <cite>...and made a little book.</cite>\n\nI'd love to see that book. And any other samples of work like this.\n\nPlease and thank you.\n\n"
    },
    {
      "time": "20 Dec 2007 — 3:41pm",
      "content": "Sure thing! I promise to post some stuff on the weekend, when I might get some time to do the pdf's and stuff. It might not be a great idea, as I (shamefully) don't have a website to call my own. I'll come up with something.\n\nOh, and by \"little\" I meant BIG...I was trying to be sarcastic ;)\n\n"
    },
    {
      "time": "20 Dec 2007 — 3:50pm",
      "content": "and i'd start off earlier than greek (which i believe came before latin), but with lasceaux, pictographs, and phoenician alphabets.\n\n"
    },
    {
      "time": "20 Dec 2007 — 5:57pm",
      "content": "ah, yeh thatd be good idea chuck\n\n"
    },
    {
      "time": "21 Dec 2007 — 1:37am",
      "content": "As far as I know (or believe) it went like this:  \n- Proto-writing  \n- Cuneiform  \n- Hieroglyphs  \n- Linear Scripts (A and B)  \n- Greek  \n- Cypriot  \n- Etruscan  \n- Latin  \n- Western Alphabet\n\nWith some scripts coming and going in different directions:  \n- Chinese  \n- Japanese  \n- Cyrillic  \n- Mesoamerican scripts  \n- Ogham  \n- Runes\n\nI'd start in Proto-writing because that's the first time ideas (as opposed to objects) are expressed with pictures.\n\nI could go on and on and on and on about this, so I better stop now....\n\n"
    },
    {
      "time": "21 Dec 2007 — 7:20am",
      "content": "Mason’s _History of the Art of Writing_ contains some diagrams like this for individual letters and shorter periods of history, as does Jubert’s _Typography and Graphic Design History_. Neither one is worth purchasing just for the diagrams—especially the latter—, but the former can be found on Google books as it has passed into the public domain.\n\nAnd Antonio, I would love to see your book as well :)\n\n"
    },
    {
      "time": "9 Jan 2008 — 1:33pm",
      "content": "Where's the book?\n\n"
    },
    {
      "time": "17 Jan 2008 — 8:51am",
      "content": "Sorry guys, but I've been insanely busy these last weeks. I'll try to post a PDF of it tonight. It will be of a five letter version of it; one I sent some people I admire in the design industry. I also have to post one to my tutor, who helped a lot during the MA.\n\nSpeak to you soon\n\n"
    },
    {
      "time": "17 Jan 2008 — 2:21pm",
      "content": "Ok, I'm ready. After leaving work, running half–way through London to get my lovely wife a birthday present, stopping to finally buy a comic book I've been looking for, getting home, editing my InDesign file and exporting it, I'm happy to say the PDF is ready to go!\n\nIf only I knew how to upload it... Anyone care to assist me on this? \\*keeps fingers crossed\\*\n\n\\*edit: I'll post a new topic to see if I get some help that way.\n\n"
    }
  ]
}
