{
  "id": "40230",
  "title": "How to Rasterize an image?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am just curious, does anyone here know how designers in the past rasterized images?\n\nWas it all hand done or was there some photo-machine that would produce them.\n\nBelow are some attached examples of what I am referring to.\n\n| Attachment | Size |\n| --- | --- |\n| [485181413\\_e864407686.jpg](http://web.archive.org/web/20120203231432/http:/typophile.com/files/485181413_e864407686.jpg) | 150.51 KB |\n| [500627153\\_ee0f05ad23.jpg](http://web.archive.org/web/20120203231432/http:/typophile.com/files/500627153_ee0f05ad23.jpg) | 168.43 KB |\n| [542136912\\_e681af684d.jpg](http://web.archive.org/web/20120203231432/http:/typophile.com/files/542136912_e681af684d.jpg) | 146.48 KB |\n\n",
  "author": "<a href=\"/web/20120203231432/http://typophile.com/user/18175\" title=\"View user profile.\">Wesley.Bancroft</a>",
  "time": "<br>",
  "uid": "18175",
  "comments": [
    {
      "time": "",
      "content": "The first two examples are of halftone dots blown up to huge proportions. But basically, yes, a screen was used to photograph a continuous-tone image and [prepare it for the printing process](http://web.archive.org/web/20120203231432/http:/en.wikipedia.org/wiki/Halftone). Whereas the term [raster](http://web.archive.org/web/20120203231432/http:/en.wikipedia.org/wiki/Raster_graphics) has to do with imaging on a video screen or computer monitor.\n\nIn the third example, perhaps there was some work done by hand.\n\n"
    },
    {
      "time": "",
      "content": "Here's what I used at my first job... an [Agfa Gevaert Repromaster Vertical Camera](http://web.archive.org/web/20120203231432/http:/cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=300183458227&ih=020&category=4701&ssPageName=WDVW&rd=1)!\n\n"
    },
    {
      "time": "",
      "content": "I was looking through an old issue of Graphis Issue No. 92, and there was an old advertisement that offered services for 'Spezial-Raster' of images (German Company). They offer various catagories you could have it at, such as '40er Spezial-Raster' & '20er Spezial-Raster'. What does this mean, and is there any other process of doing it without that insane machine :O.\n\nAlso, why is the online software program called [The Rasterbator](http://web.archive.org/web/20120203231432/http:/homokaasu.org/rasterbator/) if you still get kinda the same effects as the images attached?\n\nThanks Ricardo. I appreciate talking to people who used the archaic machinery, really fascinating!\n\n"
    },
    {
      "time": "",
      "content": "Play around with 2 things in Photoshop:\n\nThe Half Tone filter\n\nPrinting with a wacked out screen - in the print dialogue you can specify a screen - try this for starters: 35lpi with 45 degree lines - I've used different screens a lot, printed them and then resampled with a scanner. It's not going to go through a good RIP this way but works on most lasers that have Postcript - haven't tried it on an ink jet but now that I'm thinking about it I probably will.\n\npbc\n\n"
    },
    {
      "time": "",
      "content": "Thanks Paul, I will try messing around with that.\n\n"
    },
    {
      "time": "",
      "content": "82 degree lines were recommended to me when i was designing a shirt to screen over the weekend  \nbut i suppose its all up to what you're looking to have as an end result\n\ni was happy with it\n\n"
    },
    {
      "time": "",
      "content": "_Also, why is the online software program called The Rasterbator if you still get kinda the same effects as the images attached?_\n\nHi, Wesley. I wasn't clear, sorry: the effects of both processes are indeed the same, or sufficiently similar. I was just splitting hairs to point out the different origins and uses of both methods: one from the print world, the other from the television/onscreen world.\n\nNot sure what the ads from the German company are for, or if they used the term \"raster\" for both print and screen.\n\nNeat fact I found out last night: \"raster\" comes from the Latin word rastrum, which means \"rake,\" as in: \"Screen images are made up of a pattern of several hundred parallel lines created by an electron beam 'raking' the screen from top to bottom at a speed of about one sixtieth of a second.\" (from _The Mac Designer's Handbook_, 1992 edition, by Alastair Campbell.)\n\n"
    },
    {
      "time": "",
      "content": "Take a greyscale image in photoshop and convert to bitmap. Specify custom halftone and you can choose the dot/line etc and rate. Start with an upsampled 1200 dpi image and you will get good results.\n\nUsed to be done on a stat camera as mentioned. You would lay a screen over your 100% image and impose the dot.\n\n"
    },
    {
      "time": "",
      "content": "The third image (the sheep) was likely created using pattern sheets (Zipatone, Letraset, etc.). The sheets were adhesive-backed translucent film with halftone patterns printed on them in various sizes. They were used by illustrators and comic book artists a lot. You could cut out shapes with an X-acto knife and burnish it onto the art board, for instance. In the sheep illustration, it appears that several pattern sheets were overlaid at slightly different angles to get a moiré effect and shading.\n\n"
    },
    {
      "time": "",
      "content": "You might also find these PhotoShop Filters of interest:\n\n[http://www.andromeda.com/main/cutline.php](http://web.archive.org/web/20120203231432/http:/www.andromeda.com/main/cutline.php \"http://www.andromeda.com/main/cutline.php\")\n\n[http://www.andromeda.com/main/screens.php](http://web.archive.org/web/20120203231432/http:/www.andromeda.com/main/screens.php \"http://www.andromeda.com/main/screens.php\")\n\n[http://www.andromeda.com/main/etchtone.php](http://web.archive.org/web/20120203231432/http:/www.andromeda.com/main/etchtone.php \"http://www.andromeda.com/main/etchtone.php\")\n\nThey all duplicate effects we used to do with a stat camera and dot screens and line screens etc.\n\n"
    },
    {
      "time": "",
      "content": "Thanks everyone. Sounds like I will be doing some experimentation : )....\n\nGreat to hear all the old processes; it gives me a deeper appreciation of how design has evolved.\n\n"
    }
  ]
}
