{
  "id": "40245",
  "title": "fresh logo uploaded :)",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "here is the new logo i have made based more or less on your suggestions. i‘m curious about new critiques for this one :)\n\nP.S. the motto is about to born...i guess :))\n\n ![](http://web.archive.org/web/20080905094318im_/http:/www.typophile.com/files/new%20logo%202_5252.jpg)\n\n [‹ Wordmark for Home Baby Care](http://web.archive.org/web/20080905094318/http:/www.typophile.com/node/39189 \"Go to previous forum topic\") [Font for Shipping Company Needed ›](http://web.archive.org/web/20080905094318/http:/www.typophile.com/node/39776 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905094318/http://www.typophile.com/user/24991\" title=\"View user profile.\">marosi_lorant</a>",
  "time": "<br>",
  "uid": "24991",
  "comments": [
    {
      "time": " 20.Dec.2007 12.24pm",
      "content": "“What’s a motto?”\n\n—“Nothin’... Wat’s a-motta wit’ you?”\n\n"
    },
    {
      "time": " 20.Dec.2007 12.47pm",
      "content": "Hmm I cannot see much, because the letters are cut off at the bottom... Is this your intention?\n\n[Web Design Hamburg](http://web.archive.org/web/20080905094318/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 20.Dec.2007 1.31pm",
      "content": "“and right over here is the viaduct.”  \n“i donno — you tell me. why a duck?”\n\n"
    },
    {
      "time": " 20.Dec.2007 2.27pm",
      "content": "Marosi dude, for a graphic desing firm your new logo lacks the following:  \n\\* a clever design idea  \n\\* a cleverly-designed, contemporary typeface  \n\\* the current zeitgeist  \n\\* coolness  \n\\* subtlety\n\nAll of these qualities are essential to the logo of a graphic design firm to show potential customers the brilliant and appealing nature of what you are going to do for them. The red squiggle looks just like the meaningless scribble used in the logos of sign-making companies employing tradesmen as ersatz designers. If you must include a hand-scrawled element, abstract is okay but make it an _artful_ abstract squiggle suggesting something specific.\n\nThe whole thing might work better if the type is colored and the abstract part in black.\n\nj a m e s\n\n"
    },
    {
      "time": " 20.Dec.2007 2.51pm",
      "content": "I think it still lacks cohesiveness,as it did in the early version, but in a different way.\n\n ![](http://web.archive.org/web/20080905094318im_/http:/www.typophile.com/files/MAROSI_3757.jpg)\n\n"
    },
    {
      "time": " 20.Dec.2007 11.34pm",
      "content": "cohesiveness\n\noh damn, now it looks even more like a “posh European furniture store”\n\n ![](http://web.archive.org/web/20080905094318im_/http:/www.typophile.com/files/marosi_angel_5814.gif)\n\nthat’s all I could come up with in two minutes.\n\nj a m e s\n\n"
    },
    {
      "time": " 21.Dec.2007 5.13am",
      "content": "james - don’t be hatin’. if we’re no longer free to improperly grammatize, then those who would threaten our way of life have already won.\n\nanyway. i like your type use above. i was just trying to see where m’s logo might go using the same building blocks.\n\n"
    },
    {
      "time": " 21.Dec.2007 6.18am",
      "content": "No stress Chuck, I thrive on improper grammar and was being silly. I get so sick of having to write everything properly.\n\n_i like your type use above._\n\nThanks, the color is uneven in “morosi”, but I suppose it’s eye-catching overall.\n\n_i was just trying to see where m’s logo might go using the same building blocks._\n\nI’m trying to persuade him to use a different font. But don’t mind me, keep going with those same building blocks. The font I used hasn’t even been released yet.\n\nj a m e s\n\n"
    },
    {
      "time": " 21.Dec.2007 7.08am",
      "content": "james- don’t look now, but you just switched from a train to a cat.\n\nseveral years ago, my nephew (three at the time) insisted he was going to be a train when he grew up. later that year, he decided he would grow into a bear instead (better career opportunities?).\n\nhappy transformation.\n\n"
    },
    {
      "time": " 21.Dec.2007 7.16am",
      "content": "Cheers! When I was three I wanted to be a gleaming metal rocket ship when I grew up, but my parental units said it would be too dangerous and expensive.\n\nj a m e s\n\n"
    },
    {
      "time": " 21.Dec.2007 7.32am",
      "content": "Marosi, you need to try and start simple. That means no circa 1985 flourishes and script, no custom type, and don’t even work with color until everything else is done.\n\n"
    },
    {
      "time": " 21.Dec.2007 10.00am",
      "content": "dear james,\n\nthe logo you have come up with is - no ‘fence - worse than mine. it has nothing that suggest a design firm. At all. rather a law firm. or whatever else but not a design firm. As you said a design firm logo needs the following:  \n\\<\\<\\* a clever design idea  \n \\* a cleverly-designed, contemporary typeface  \n \\* the current zeitgeist  \n \\* coolness  \n \\* subtlety\n\nAll of these qualities are essential to the logo of a graphic design firm to show potential customers the brilliant and appealing nature of what you are going to do for them.\\>\\>\n\ni can‘t find any of these in that logo. the same goes to chuckgroth, too.\n\ni‘m not saying that the suggestions are not good. the suggestions are great and thanks for them but don‘t make something that has nothing to do with your theories.\n\n"
    },
    {
      "time": " 21.Dec.2007 10.07am",
      "content": "I want to contribute, but am wondering what the logo is for exactly.\n\n"
    },
    {
      "time": " 21.Dec.2007 10.11am",
      "content": "it‘s for a design firm/agency\n\n"
    },
    {
      "time": " 21.Dec.2007 10.37am",
      "content": "_...i can‘t find any of these in that logo. the same goes to chuckgroth, too._\n\ni‘m not saying that the suggestions are not good. the suggestions are great and thanks for them but don‘t make something that has nothing to do with your theories.\n\nWell gee whiz dude, I think we’re on a different wavelength to the one you are on—-no offense. By the way, the “logo” I posted is nothing more than a dummy I threw together in two minutes with little or no thought. It was not intended as finished artwork or a finished logo design. Nor did I claim it embodies any or all of the qualities listed as essential for a design agency logo. I was working on Chuck’s suggestion of “cohesiveness”. Mainly I wanted to show the potential of using another type. You don’t have to use a font like the one I used.\n\nTry a font of recent design/release. James P is right about the circa 1985 reference. The square font is out of step chronologically, lacking a contemporary feel. As for not using color in the development stage: I’ve designed logos in monochrome and added color later, and done other logos working with color from the start, and the results were equally good.\n\nj a m e s\n\n"
    },
    {
      "time": " 21.Dec.2007 10.44am",
      "content": "I kind of disagree that a design firm needs a ’cool/clever’ logo. A lot of the big firms have a very simple word mark. Sometimes simple is better... it doesn’t pigeon hole you nor competes with the product you produce.\n\n"
    },
    {
      "time": " 21.Dec.2007 11.01am",
      "content": "Good point Darrel. A design firm can go either way—-neutral or trendy—-depending on the philosophy of the designers or principals involved. A non-trendy logo will date much slower. I think it counts for a lot of cred tho if your design shop logo is at least clever to some extent (it doesn’t have to be ultra-clever), because it works as an example of how you can be clever in presenting your client’s image.\n\nIt helps too to come up with something “bespoke”, a design that is original and cannot be found anywhere else (except by coincidence).\n\nj a m e s\n\n"
    },
    {
      "time": " 21.Dec.2007 11.06am",
      "content": "_A lot of the big firms have a very simple word mark..._\n\nOkay, but does that mean simple word marks really are more effective for design agencies? Or is it just a trend with widespread acceptance? I’ve seen this kind of ergo hoc, prompter hoc argument in action at Wikipedia, “Encylopedia Britannica doesn’t distinguish between Western and Eastern typography, therefor why should Wikipedia?” Answer: “Just because the great EB does it that way does not make it right, or the best way.”\n\nj a m e s\n\n"
    },
    {
      "time": " 21.Dec.2007 12.31pm",
      "content": "The logo looks amateurish. The paint swoosh has been done over and over and over again. Is there a reason for the letters to be cut off?\n\nForm always should follow function. So, what kind of firm are you? Are you specializing? What sets you apart? Figure out answers to those questions and use them to guide your design.\n\nIt’s not a horrible start, but it’s far from over my friend. Back to the drawing board.\n\nJoseph Szala  \nVigor - an interactive branding strategy firm  \n [www.vigorbranding.com](http://web.archive.org/web/20080905094318/http:/www.vigorbranding.com/ \"www.vigorbranding.com\")\n\n"
    },
    {
      "time": " 21.Dec.2007 2.16pm",
      "content": "sorry, ml. didn’t mean to offer ideas where they aren’t wanted.\n\nyour logo is perfect. go with it. don’t let anyone talk you out of it.\n\n"
    },
    {
      "time": " 21.Dec.2007 6.39pm",
      "content": "Well said Chuck. Marosi brothers is (presumably) a small design firm. Simple workmarks are appropriate for large agencies, but for a small outfit there’s room for individuality.\n\nj a m e s\n\n"
    },
    {
      "time": " 22.Dec.2007 9.33am",
      "content": "Frankly, I think you have something workable at the core of the design. First you should get rid of all the excess elements (squiggle, “brothers”) and build off your name.\n\n ![](http://web.archive.org/web/20080905094318im_/http:/www.typophile.com/files/nl_alone_5416.jpg)\n\nBoiled down, this design has some assets you can use. It is well proportioned, looks very stable, but still a bit esoteric (it looks like OCR text at the bottom of a soviet check). If this is what you are going for I would focus on polishing what you have. As angular as the type is, the variation in the width in the letters makes it look a bit too random. I would tweak the width of the letters (the m needs to be narrower and the o looks like it is shrinking as compared to the a) After that I would open up the letter spacing a tad, then see what you have.\n\n"
    },
    {
      "time": " 22.Dec.2007 10.34am",
      "content": "James E. Richards  \nAll lower case is a style that is beyond criticism. Hoping you will greturn to clarity. The red “M” is great, tho.\n\n"
    },
    {
      "time": " 22.Dec.2007 2.19pm",
      "content": "_First you should get rid of all the excess elements (squiggle, “brothers”) and build off your name._\n\nWe’ve already been thru that but it seems m. doesn’t want to do it, or doesn’t see the point in de-cluttering.\n\n_Boiled down, this design has some assets you can use._\n\nAssets huh? Mmmm—Idunno.\n\n_It is well proportioned, looks very stable,_\n\nAmazing. Where do you get this stuff? How did you come up with that?\n\n_As angular as the type is, the variation in the width in the letters makes it look a bit too random._\n\nToo random by whose standards? I’ll concede the “o” looks a bit narrow by the standards of most proportional fonts. Other than that it’s like most other fonts, containing letters of varying width in the time-honoured tradition. How that can be construed as undesirable reaches the margins of common sense.\n\n_After that I would open up the letter spacing a tad, then see what you have._\n\nIt would be easier if you made those edits to the bitmap yourself and posted the result. No wait—-I’ll do it.\n\n ![](http://web.archive.org/web/20080905094318im_/http:/www.typophile.com/files/dude_4004.gif)\n\nOkay, done. Very hard to see the point tho.\n\n@James E. Richards: _The red “M” is great, tho._\n\nYou mean the red m in marosi’s icon, or the red dot in the logo?\n\nj a m e s\n\n"
    },
    {
      "time": " 22.Dec.2007 3.50pm",
      "content": "i guess he means this “m,” but i have to disagree that it’s ’great.’\n\n ![](http://web.archive.org/web/20080905094318im_/http:/www.typophile.com/files/mm_4496.jpg)\n\nin any case, i think i’ll move on to another thread.\n\n"
    },
    {
      "time": " 22.Dec.2007 6.06pm",
      "content": "If you are going to use a “m” as your symbol, maybe you could look to see if there are some “m” that is more “brotherly” than others?\n\n ![](http://web.archive.org/web/20080905094318im_/http:/www.typophile.com/files/mbrothers_5553.gif)\n\n"
    },
    {
      "time": " 22.Dec.2007 10.31pm",
      "content": "Mmmmm, yes. I had one more idea for this logo. It’s been around the block a few times. Even so it still has potential.\n\nMake M the main element. Turn it into a feature. You’ll need a very good M for this, one with loads of merit, maybe even a clever one, bold, spunky, luscious—-whatever. So long as it has the effect of being eye-catching. A decorative style M for example, something fancy or old. That’s just one example.\n\nCombine the eye-catching M with the “arosi” letters in another font—-something plain and functional in a style that goes with the brassy M. The contrast between the M and the plain letters alone should give an eye-catching effect.\n\nj a m e s\n\n"
    },
    {
      "time": " 23.Dec.2007 1.51am",
      "content": "I found these two on the attic, lying behind the christmas balls and gathering only dust.\n\n ![](http://web.archive.org/web/20080905094318im_/http:/www.typophile.com/files/M1_6127.gif)\n\n ![](http://web.archive.org/web/20080905094318im_/http:/www.typophile.com/files/M2_6037.gif)\n\n"
    },
    {
      "time": " 23.Dec.2007 3.43am",
      "content": "Posting your own versions of a logo used to be taboo in the critique sections and I think the reasons are demonstrated in this thread, posters are offended, umbrage is taken, diversion from the subject, withdrawal in a huff (some of which are welcomed/entertaining in other forums), and yes, those can occur without the addition of images.\n\nTo go back to the original, the masked characters (not a particularly original concept) need, in my opinion, to be treated similarly throughout Marosi brothers, or at least to have some recognisable reason for the differences, at the moment the mask doesn’t seem to be at quite the right point (or possibly angle). The combination of the vertically-biased letter forms and the mask doesn’t work particularly well, if you tried a more “classic” letterform (sans or serif) and experimented you could mask quite a large amount from bootom and/or top, you wouldn’t have to make allowances for the o and the m\\_r\\_i needn’t appear unmasked. Alternatively you could work with the letterforms you have, but improve on them – the m and h are a little wide and the r a touch narrow, I think the t needs something too, it is too geometric to my eyes, maybe moving the crossbar so that it is less symmetrical.\n\n"
    },
    {
      "time": " 23.Dec.2007 11.32am",
      "content": "Every thread ends in tears.\n\n"
    },
    {
      "time": " 23.Dec.2007 11.39am",
      "content": "_“Posting your own versions of a logo used to be taboo in the critique sections”_\n\nI didn’t know this (but I may either be not a frequent enough visitor of this board or not a member for long enough).\n\n_“offense, umbrage, diversion, withdrawal in a huff...  \nand yes, those can occur without the addition of images.”_\n\nWhich then, I’d assume, has a lot more to do with the people involved than with the mere posting of illustrations.\n\nThis doesn’t do anything for this thread, but let me just say that if I should ever post a logo on this board, I’d be more than glad if people would take the time to edit the hell out of it should they think that my design needs it.\n\n"
    },
    {
      "time": " 23.Dec.2007 3.52pm",
      "content": "Unless the person who creates the thread explicitly notes that they would like to _see_ other’s ideas you shouldn’t be posted your ideas.\n\n"
    },
    {
      "time": " 23.Dec.2007 5.29pm",
      "content": "It’s hard to see the point of a critique session—-in _any_ context, but especially on the internet—-where suggestions cannot be made visually in order to demonstrate _what’s the deal_.\n\nComps I post are for the sole purpose of instruction—-this is what I mean dude, something like this, _but that’s not to say I think your attempt is horrible or hopelessly flawed._\n\nWhere did he get t h a t from?\n\nDrawings are candid ideas, nothing more.\n\nStatements like this one are candid too, and very much on the ball, but first-timers and the insecure might find the opening sentence insulting:\n\n_The logo looks amateurish. The paint swoosh has been done over and over and over again. Is there a reason for the letters to be cut off?_\n\nj a m e s\n\n"
    },
    {
      "time": " 23.Dec.2007 6.53pm",
      "content": "Generally I aim to be constructive.\n\n_Posting your own versions of a logo used to be taboo in the critique sections..._\n\nWhen was t h a t ?\n\n@j\\_p\\_giese: _Which then, I’d assume, has a lot more to do with the people involved than with the mere posting of illustrations._\n\nThis thread demonstrates that most lucidly.\n\nTim—-tust everyone, but cut the cards.\n\nj a m e s\n\n"
    },
    {
      "time": " 23.Dec.2007 7.42pm",
      "content": "@Tiffany: _Unless the person who creates the thread explicitly notes that they would like to_ see _other’s ideas you shouldn’t be posted your ideas._\n\nTrust everyone. I trust you a lot as a moderator, but there is a degree of post-modern cynicism going on in this thread holding back an effective solution. What happened to “typographic collaboration”?\n\n@timd: _...if you tried a more “classic” letterform (sans or serif) and experimented you could mask quite a large amount from bootom and/or top, you wouldn’t have to make allowances for the o and the m\\_r\\_i needn’t appear unmasked._\n\nThat’s the kind of descriptive remedy I think is better expressed in a drawing.\n\n@marosi\\_lorant: _...the suggestions are great and thanks for them but don‘t make something that has nothing to do with your theories._\n\nThat’s nonsense. Your view is cynical and out of touch.\n\nj a m e s\n\n"
    },
    {
      "time": " 23.Dec.2007 10.44pm",
      "content": "_It’s hard to see the point of a critique session—-in any context, but especially on the internet—-where suggestions cannot be made visually in order to demonstrate what’s the deal._  \ni agree completely with james here. although i’ve been a typophile member for a while, i admit to an ignorance of the policy of not showing visually representational examples of concepts (has this really been the case?). images are effective because they ARE concepts, but not directives (we are peers instead of clients). in fact, i have often posted (and have seen posted) visual examples of concepts.  \n_My_ feeling is, unless a person is willing to receive written and visual feedback, there’s little point to offering it up to a public forum such as this.\n\n"
    },
    {
      "time": " 24.Dec.2007 12.55am",
      "content": "[http://typophile.com/node/14424](http://web.archive.org/web/20080905094318/http:/typophile.com/node/14424 \"http://typophile.com/node/14424\")\n\nAn earlier thread which makes my point(and conflicting ones).\n\n\\>That’s the kind of descriptive remedy I think is better expressed in a drawing.\n\nPossibly, but I choose not to unless asked, as I believe that it does a disservice to the poster.\n\nTim\n\n"
    },
    {
      "time": " 24.Dec.2007 2.43am",
      "content": "Hey Tim ... one of the links in your node is broken, but here’s the [link](http://web.archive.org/web/20080905094318/http:/www.typophile.com/node/3051)\n\nthis gives a little more background.\n\nthere was a time when it was not taboo to post graphic-based logo suggestions. And lots of people did it. I was guilty.\n\nJoe Pemberton said something. And Stephen called the practice selfish. So from that point on, it seemed like it’d be a good idea to speak up and let others know, too. But that caused problems — one crit recipient got mad when I said something, and basically said, Dude, don’t fight my battles.\n\nAs the site grew, the new people had no idea.\n\nI think quick sketches are fine, but creating an entire new logo is very close to saying, ’Your logo isn’t working, let’s scrap it, and take a look at what I’m capable of!’\n\nI don’t mean this in a bad way, James, or anyone else in this thread. (James, I know about your diligence on the Larabie forum, your type design skills, and of course I’ve seen the helpful advice you impart here.) You certainly are just trying to help.\n\nOne solution is for Joe or Jared or someone behind the curtain to take the input from these threads, and make an official decision on how to handle this.\n\nAs seen in the past discussions, there’s a difference of opinion on this subject, so clearly it’s not something that is going to fix itself. :)\n\nsorry to continue the thread derail.\n\n"
    },
    {
      "time": " 24.Dec.2007 3.42am",
      "content": "Thanks Tim and Brian for pointing us to that 2004 thread. There will always be new typophilers who are unaware of it.\n\n@timd: _Possibly, but I choose not to unless asked, as I believe that it does a disservice to the poster._\n\nHow does my posting a drawing do a disservice to the poster (of original)?\n\n@bjharvy: _...creating an entire new logo is very close to saying, ’Your logo isn’t working, let’s scrap it, and take a look at what I’m capable of!’_\n\nNothing like that was intended. That thinking is on the same wavelength as Stephen saying it’s selfish. I think m. is being a somewhat selfish or insecure with respect to his own design skills.\n\nFor me the quickest way to contribute is often to do a “quick drawing”, and lately I have posted disclaimers “that’s all I could come up with in 2 minutes”. It’s easy to see how a statement like that could be interpreted as “look what I can do in two minutes!”\n\nSorry if my lingua franca is oblique and too satirical for some tastes.\n\n_...I think quick sketches are fine, but creating an entire new logo..._\n\nFor me that &nbsp; w a s &nbsp; a “quick sketch”. So where do we draw the line betwwen a sketch and an entire new logo?\n\nj a m e s\n\n"
    },
    {
      "time": " 24.Dec.2007 3.59am",
      "content": "_...Your logo isn’t working, let’s scrap it and..._\n\nThat’s par for the course with any kind of critique, whether it happens verbally or visually. Some people can’t handle it.\n\nAlso try: “The logo looks amateurish. The paint swoosh has been done over and over and over again. Is there a reason for the letters to be cut off?”\n\nAlso try: growing some skin, and having a sense of humour. It says that in the general posting guidelines, so do we need a different sticky guidelines for the critique forums root?\n\nTrust everyone, but cut the cards. Draw a line, guys, between “quick sketch” and “whole new logo”.\n\nj a m e s\n\n"
    },
    {
      "time": " 24.Dec.2007 12.58pm",
      "content": "I would encourage quick sketches from anyone who cared to offer me ideas.  \nI think both logos here remind me of kitchen appliances, but if i had a better idea, i would like to be able to illustrate it with a quick graphic. I wouldn’t presume to say it was better than somebody else’s.  \nPeople are trying only to give useful feedback, at least I hope so! :)\n\n"
    },
    {
      "time": " 24.Dec.2007 11.19pm",
      "content": "Joe Pemberton, Tiffany, Stephen, Eben, Paul Hunt, Dan Reynolds, Yves—-some questions I would appreciate some answers to:\n\n\\* If seasoned designers or type designers posting their own version of a logo on a critique thread is taboo, _why are we hearing about it for the first time now?_ I’m a regular contributor, you know my posting habits, and presumably you trust me. Yet I and other members have been allowed to post problematic material will-nilly—-and nobody said anything until now. How did it come to that?\n\n\\* T h a t &nbsp;is doing a disservice to designers and others who are genuinely trying to help out. Trust everyone.\n\n\\* Why&nbsp; i s n ’ t&nbsp; there a guidelines sticky for the Critique area? Evidently we need one. There will always be new contributors.\n\nHere’s a draft text to get the meatball rolling. Please amend as you guys see fit:\n\n=============start====================  \nCritique Forum Guidelines\n\nFor logos:  \n\\* Seasoned and professional designers contributing to logo critiques are asked to look at the logo design and the forum-based critique process from the Client User’s point of view and avoid posting their own version of the logo (for example, using a different font), as it may appear self-indulgent. Unless the client user specifically asks for raw input, check that it’s okay first before posting your own comps and drawings.\n\n\\* Students, first-timers and non-professional designers (client users) asking for critiques are asked to look at the forum-based critique process from the perspective of seasoned designers who may contribute, bringing in new ideas or challenging your perspective.\n\n\\* Look at it from each other’s point of view, trust everyone, have a sense of humour etc. Also try: A nice sit down and a cup of tea.  \n=============end====================\n\nj a m e s\n\n"
    },
    {
      "time": " 25.Dec.2007 7.50am",
      "content": "Could you please take this derailed train somewhere more appropriate?\n\n"
    },
    {
      "time": " 26.Dec.2007 10.33am",
      "content": "We all have to use judgment in these areas. I like to hint at a solution rather than solving or offering a finished idea. For example, if someone needs a font I often suggest a classic and leave the refinement and search up to the person asking.\n\nThis particular thread is a little different, in my opinion, because the designer needs to push their own ideas and discover the development process. A good way to show this is with examples of directions they have not attempted.\n\nI’m in the less is more camp when it comes to critique—maybe that’s what I’m trying to say.\n\n"
    },
    {
      "time": " 26.Dec.2007 11.57am",
      "content": "James, is that your picture in your avatar?\n\n"
    },
    {
      "time": " 26.Dec.2007 12.41pm",
      "content": "Yep. When I was really quite a young man struggling to make movies. Ha! Those were the days.\n\nI see you are now a “Typophile phile”. Does that mean you’re a lover of Typophilers?\n\nMy cat Zoot says to say howdy to you :^)\n\nj a m e s\n\n"
    },
    {
      "time": " 26.Dec.2007 3.00pm",
      "content": ":-)\n\n"
    },
    {
      "time": " 30.Dec.2007 6.06pm",
      "content": "So... Marosi Brothers...\n\n————————-:  \nJean Chouinard\n\n"
    },
    {
      "time": " 31.Dec.2007 1.55am",
      "content": "This post is kinda split in three parts... :S\n\n[http://typophile.com/node/40033](http://web.archive.org/web/20080905094318/http:/typophile.com/node/40033 \"http://typophile.com/node/40033\")  \n [http://typophile.com/node/40246](http://web.archive.org/web/20080905094318/http:/typophile.com/node/40246 \"http://typophile.com/node/40246\")\n\n———————————————————————————:  \nJean Chouinard (formerly emerjean on Typophile)\n\n"
    }
  ]
}
