{
  "id": "40262",
  "title": "Autorities on information design as applied to dictionaries",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello all,\n\nFor my master's project I'm creating an electronic prototype of a printed Aleut-English dictionary. The information in the dictionary is wonderful but many other things about the dictionary are not. The dictionary's organization can be criticized on several levels, including typographically--at least, I think so. But as my background is in linguistics and not design, I don't know where to find an authoritative source on this subject. My searches on \"information design and dictionaries\" and \"information design and lexicography\" so far have either turned up dictionaries on information design or articles on how to structure lexical databases, which are not what I need.\n\nI'm looking for scholarly works that spell out fairly accepted principles of laying out information (specifically, bilingual dictionary entries with no pictures) in a way that guides users to what they're looking for. I need these principles both in order to critique the existing dictionary and to guide the design of the computerized one. At a minimum, some source that conveys ideas similar to \"presenting complex hierarchical information as dense running text is bad\" and \"an 8x10 inch page really deserves wider margins than three eighths of an inch\" would be really helpful.\n\nTypographic considerations constitute a very small part of my thesis, but they affect dictionary usability in a big way, so I hope to address at least the most major problems. If anyone knows of sources that address the visual design of reference works specifically, that would be wonderful; but in any case I'd be grateful for anything that might come remotely close.\n\nAric\n\n",
  "author": "aric",
  "time": "21 Dec 2007 — 1:49am",
  "uid": "21991",
  "comments": [
    {
      "time": "21 Dec 2007 — 4:25am",
      "content": "Dear Aric,\n\nI’ve been involved in a large number of dictionary projects together with Peter Matthias Noordzij and Bas Smidt at TEFF. A portfolio of this work can be seen at [http://www.teff.nl/design/portfolio.html](http://web.archive.org/web/20131107202909/http:/www.teff.nl/design/portfolio.html \"http://www.teff.nl/design/portfolio.html\"). You will notice that our approach to dictionary design is a pure typographical one, and that we place much emphasis on micro-typography; even the tiniest details in the text are the result of careful considerations. We also have developed custom technology to produce high quality typography in automated layout designs. Quite a lot of these types of books are produced with applications like Adobe Framemaker that are very inflexible from a typographical point of view.\n\nI am not aware of specific books about dictionary design although many wonderful books have been written about information design which to me are very helpful sources. I can particularly recommend to have a look at the series of books that Edward Tufte wrote on the subject.\n\nHope this helps.\n\n"
    },
    {
      "time": "21 Dec 2007 — 7:37am",
      "content": "Here is a great (and lengthy) article from Typotheque about the Collins dictionary re-design they took on.\n\n[http://www.typotheque.com/articles/microtypography\\_designing\\_the\\_new\\_col...](http://web.archive.org/web/20131107202909/http:/www.typotheque.com/articles/microtypography_designing_the_new_collins_dictionaries/ \"http://www.typotheque.com/articles/microtypography\\_designing\\_the\\_new\\_collins\\_dictionaries/\")\n\n"
    },
    {
      "time": "21 Dec 2007 — 5:35pm",
      "content": "Paul and Haley,\n\nThanks for the pointers. I will look at Tufte's work as soon as I get back to the university library. The typotheque article is excellent, and the TEFF Portfolio is absolutely beautiful. This should get me off to a good start.\n\nMany thanks,\n\nAric\n\n"
    },
    {
      "time": "21 Dec 2007 — 10:35pm",
      "content": "The people behind the Oxford dictionaries redesigned their bilingual dictionaries to great effect within the last few years. I don’t know who was behind it, but there are some articles out there, and if you like the design it would be worth looking into.\n\n"
    },
    {
      "time": "27 Dec 2007 — 9:35pm",
      "content": "Aric\n\nI think your first concern would be to find a font that will incorporate all the possible letterforms you will encounter.\n\nSecondly, you will want to ensure that you have a number of optically correct small text sizes for a balanced look to the varying elements of the descriptions.\n\nI've done a dictionary and a work, The Aldine Press ( [http://Bielerpressiii.blogspot.com](http://web.archive.org/web/20131107202909/http:/bielerpressiii.blogspot.com/ \"http://Bielerpressiii.blogspot.com\")), that required descriptive bibliographic entries (over 600 large format pages worth) in the past and that is the very best information I can give you.\n\nWith the appropriate font you have a great advantage typographically; most dictionaries and descriptive bibliographies are rarely considered in this regard.\n\nGerald\n\n"
    },
    {
      "time": "29 Dec 2007 — 10:00pm",
      "content": "I hope you’ve thoroughly read _Making dictionaries: Preserving indigenous languages of the Americas_, William Frawley, Kenneth C. Hill, & Pamela Munro, eds., 2002, University of California Press, ISBN 0520229967. That text addresses more of the content and structure of dictionary design for indigenous languages than it does the form, but there is some discussion of form in there.\n\nFor dictionary design, my professors have recommended simply studying the dictionaries of many other languages and getting a feel for what works well and what doesn’t. Also, especially in your case, you should examine the design of other Eskimo-Aleut and Paleosiberian dictionaries because those families present some difficult problems in dealing with long polysynthetic headwords.\n\nI heartily recommend giving the Elbert & Pukui dictionary of Hawaiian a good look, it’s a great example of a very usable dictionary for an indigenous language. Also see Robert Young’s dictionary of Navajo.\n\nIf it’s possible, include citations for all of the examples you give that are from already published or archived sources. This makes it much easier for other linguists who need to study the context in which things are uttered, or who want additional information.\n\nIf you’ve already got a grammar published, include references to it for all the function words and morphemes in your dictionary. _Do not omit function words in the dictionary_ – a dictionary is the first place people look for answers, and being alphabetically organized it also serves as an index for grammar forms.\n\nAnd an absolute must is ensuring that you have good fonts with consistent representation of the diacritics you need. Make sure that uppercase diacritics are handled well too, this is often overlooked by English speaking linguists who are diacritic-illiterate. Avoid a profusion of different fonts, instead stick to one serif face with relatively short ascenders and descenders and with a good companion italic, and then a fairly strong sans serif for the headwords. Avoid lots of fancy symbols like arrows, daggers, and the like; instead use “standard” dictionary abbreviations like “q.v.”, “cf.”, “arch.”, etc. Include a list of all the abbreviations you use at the beginning of the dictionary. When you’re giving a form of a headword that has an extended context, don’t repeat the headword but instead use a long swung dash (like a stretched out and centered tilde). You may need to add this glyph to your font, but it should be easy to create.\n\nI haven’t had much chance to look at the new Haida dictionary, published by your own ANLC, but from what I saw of it I was fairly impressed. That would probably be a good example to ponder.\n\nIf you can, you should consider using XeTeX and XeLaTeX for compiling the dictionary since it seems like you already have an electronic database which will be used for it. If you can handle learning TeX & LaTeX you’ll find it much easier to deal programmatically with your large collection of data. The XeTeX and XeLaTeX system handles Unicode natively as well as playing nice with fonts installed normally on your computer.\n\nFor the sake of everyone who uses your dictionary, please make sure to include lots of example sentences. An excellent show of example sentences in a dictionary is the Tlingit Verb Dictionary by Naish and Story. You needn’t provide finely detailed morpheme glosses, just as long as the translations are solid.\n\nOne issue you will need to seriously consider is hyphenation. There are no strict rules for hyphenation in Aleut, I suspect. You’ll need to develop some. Is the orthography one-to-one with the phonemes, or are there things like digraphs? Should you hyphenate only at syllable boundaries, or are there morphemes which cross syllable boundaries that are better candidates for hyphenation? These are some of the questions you’ll need to resolve as early as possible.\n\nThere are lots of other thoughts I have but my wrists are sore from working on my Tlingit grammar... ;-)\n\n"
    },
    {
      "time": "1 Jan 2008 — 11:25am",
      "content": "James, Gerald, and James,\n\nThanks all three of you for your suggestions and for taking the time to post.\n\nJames P., I stumbled upon the name Paul Luna as a result of your suggestion. I haven't had much time to find any of his publications, but after the holidays his work will be high on my to-look-at list. Thanks!\n\nGerald, I appreciate the guidelines.\n\nJames C., it's nice to hear from someone else with an interest in indigenous language revitalization. I agree with your recommendation of _Making dictionaries_. It's been invaluable to me.\n\nI should have been more clear about the nature of my project. I'm not actually compiling a dictionary; instead, I'm creating a digital version (XML database + GUI) of Knut Bergsland's _Aleut Dictionary_. There's definitely room for improvement in his dictionary, especially as far as pedagogical lexicography goes. But my biggest complaints about the dictionary are the bare-bones English-to-Aleut index, and the complex organizational scheme used to order the Aleut words. These two things create a lot of difficulty for language learners, and my primary goal is to create a digital version of the dictionary with an interface that mitigates these issues. Along the way, I hope to address some less critical shortcomings of the paper dictionary, including the dense typesetting, which makes it hard for the user to extract the information they seek.\n\nI will look for the Elbert and Pukui dictionary. I've looked at the Young and Morgan dictionary of Navajo; is that the one you recommend, or did Young write another dictionary on his own? As far as ANLC dictionaries go, I find the Koyukon dictionary quite attractive; the Haida dictionary is not bad either, although the system of using lozenges to represent levels of subentries doesn't work for me.\n\nI see from your homepage that you have a background in computer science. If you have any thoughts on the place of technology in language revitalization, I'd be interested to hear them. Since that subject is quite off-topic for this forum, feel free to send me an e-mail: the domain is uaf dot edu and the address is ftarb2.\n\n"
    },
    {
      "time": "17 May 2008 — 1:56am",
      "content": "Hi Aric - I spotted this and thought you might like to get in touch. You can contact me at Reading:  \n [www.reading.ac.uk/typography](http://web.archive.org/web/20131107202909/http:/www.reading.ac.uk/typography \"www.reading.ac.uk/typography\")\n\nPaul\n\n"
    }
  ]
}
