{
  "id": "40278",
  "title": "font with an embedded drop shadow?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi...I'm wondering if anyone knows of any fonts that have a dropshadow built in as part of the font. The company I work for is going to automate their price tagging and the computer programmers tell me that I can't add a drop shadow to the current piece of cra]p font..or any font for that matter. My boss is insane about having a drop shadow on his price tags. HELP!!!!Please!!!!\n\n",
  "author": "giggsy",
  "time": "21 Dec 2007 — 2:00pm",
  "uid": "23258",
  "comments": [
    {
      "time": "21 Dec 2007 — 2:12pm",
      "content": "You might find something here:\n\n[http://www.myfonts.com/search?search%5Btext%5D=shadow](http://web.archive.org/web/20130324051839/http:/www.myfonts.com/search?search%5Btext%5D=shadow \"http://www.myfonts.com/search?search%5Btext%5D=shadow\")\n\n"
    },
    {
      "time": "21 Dec 2007 — 8:56pm",
      "content": "I think this is what you mean by...\n\n ![](http://web.archive.org/web/20130324051839im_/http:/typophile.com/files/drop_5304.jpg)\n?\n\n-=®=-\n\n"
    },
    {
      "time": "21 Dec 2007 — 9:12pm",
      "content": "Hopefully you will be able to live with something from Aluminum's list, because I don't know of any font with a shadow built in like russel shows. (I am assuming that was a gif with the shadow added later.)\n\n"
    },
    {
      "time": "22 Dec 2007 — 6:11am",
      "content": "It would be easy to create the effect in InDesign and turn it to a style, but I doubt you'll be using that application for price tags?\n\n ![](http://web.archive.org/web/20130324051839im_/http:/typophile.com/files/dropshadow_5526.jpg)\n\n"
    },
    {
      "time": "22 Dec 2007 — 5:35pm",
      "content": "Presumably it would be possible to have a font with a half tone drop shadow on each glyph, but the DPI would be relative to font size, and probably by necessity rather course.\n\nMaybe if the price tags are printed in two colours (and the second one happens to be grey :o) you could off-set the grey, and get your drop shade that way.\n\nDon, that's a jpg of text with the shade added. Most design aps should be able to handle editable text with drop shade effects.\n\n-=®=-\n\n"
    },
    {
      "time": "22 Dec 2007 — 8:34pm",
      "content": "\\> Most design aps should be able to handle editable text with drop shade effects.\n\nYes, but the original post said that his application cannot. Sounds like it is custom built and the programmers are too lazy (or weren't given the resources) to program drop shadows in.\n\n"
    },
    {
      "time": "23 Dec 2007 — 5:52am",
      "content": "I think the quest is for something more like this: [http://www.myfonts.com/fonts/bitstream/vineta/](http://web.archive.org/web/20130324051839/http:/www.myfonts.com/fonts/bitstream/vineta/ \"http://www.myfonts.com/fonts/bitstream/vineta/\")  \nUnfortunately, Myfonts seems to find lots of fonts that have no shadow.\n\nCheers!\n\n"
    },
    {
      "time": "23 Dec 2007 — 1:11pm",
      "content": "They said you can't add a drop shadow to a /font/. I don't really say where it was said the program could not be made to dropshadow the price when printed, leaving the font itself alone, although that may have been what they meant, but teh fact that you can't really have a nice gradient shadow inside any font system I know of does make the answer a bit ambiguous.\n\n"
    },
    {
      "time": "26 Dec 2007 — 7:14pm",
      "content": "As you saw on the myfonts link above, drop shadows embedded in fonts are all solid, not halftone and certainly not fuzzy. But you can create these effects per text box in Creative Suite programs and Quark 7. I doubt it will ever be possible to put halftone or fuzzy drop shadows into a font--they have their hands full just extending the glyph coverage! You can create shadowed reusable type buttons and motifs for a web design, though.\n\n"
    },
    {
      "time": "27 Dec 2007 — 6:58am",
      "content": "Thanks! Yeah the program is a bit of a pain in the butt! It's called E-pass. Which essentially is what the company uses to do everything from database to customer invoices to...EVERYTHING. So it is very limited. No creative flair at all. There was a couple in there that might be of use. Thanks for your input!\n\n"
    }
  ]
}
