{
  "id": "40277",
  "title": "Andy Warhol classic Campbell's Soup painting",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "[http://en.wikipedia.org/wiki/Image:Warhol-Campbell\\_Soup-1-screenprint-19...](http://web.archive.org/web/20141114142521/http:/en.wikipedia.org/wiki/Image:Warhol-Campbell_Soup-1-screenprint-1968.jpg \"http://en.wikipedia.org/wiki/Image:Warhol-Campbell\\_Soup-1-screenprint-1968.jpg\")\n\nI need to know the font both for the word Tomato, and Soup on Warhol's Campbell's soup print. Any ideas?\n\nAlso, in the likelihood that both these font are fairly obscure and hard to find, does anyone have some suggestions of a lookalike that would be easier to get a hold of?\n\n",
  "author": "jnollsch",
  "time": "21 Dec 2007 — 1:52pm",
  "uid": "25305",
  "comments": [
    {
      "time": "21 Dec 2007 — 2:01pm",
      "content": "[http://www.typophile.com/node/34808](http://web.archive.org/web/20141114142521/http:/www.typophile.com/node/34808 \"http://www.typophile.com/node/34808\")\n\nSearch is your friend.\n\n"
    },
    {
      "time": "21 Dec 2007 — 3:54pm",
      "content": "That thread is similar, but only IDs the logo font, not the other two. Does anyone know what the other two are?\n\n"
    },
    {
      "time": "21 Dec 2007 — 11:12pm",
      "content": "For that you might need to post an image of a printed Campbell's wrapper.\n\nIf it's this image, you could get a rather close approximation with Shannon Bold or Formata for TOMATO and Bookman Bold or Bramley Bold for SOUP\n\n"
    },
    {
      "time": "22 Dec 2007 — 7:43am",
      "content": "I've never been quite sure what typeface they used for the kind of soup, if it was a typeface. It may have been custom or hand-lettered, even though it's very plain. I sometimes imagine there was an old guy at Campbell's whose job it was to design and letter the cans. He'd been there forever. They couldn't let him go, he was like family. Finally, some time in the Seventies, he retired or died, and they started using type on the cans. Or something like that.\n\nFor \"TOMATO\" [ITC Mixage](http://web.archive.org/web/20141114142521/http:/www.fontshop.com/fonts/downloads/elsner_flake/itc_mixage_2/?sample_text=TOMATO&sample_size=36) is very close if you condense it a bit. (It's condensed soup, so it's okay.)\n\nBoth \"Campbell's\" and \"SOUP\" go way back to when labels were mostly drawn by hand. You won't find fonts that match exactly.\n\n"
    }
  ]
}
