{
  "id": "40286",
  "title": "Wil Hudson during the 1970s: photos",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nThe community may be interested in a series of photos taken of printer/typographer Wil Hudson at his Vancouver shops during the 1970s, located at:\n\n[http://flickr.com/photos/hhjohnston](http://web.archive.org/web/20130821055103/http:/flickr.com/photos/hhjohnston)\n\nThey were taken mainly by my father, photographer Hal Johnston, and have been recently digitised and uploaded.\n\n",
  "author": "chapelcross",
  "time": "22 Dec 2007 — 5:28am",
  "uid": "25318",
  "comments": [
    {
      "time": "22 Dec 2007 — 8:44am",
      "content": "Great stuff. You should think about releasing hi-res versions under a Creative Commons license for students to use in their papers about Hudson and/or letterpress.\n\n"
    },
    {
      "time": "22 Dec 2007 — 9:34am",
      "content": "Thanks, I'll probably do that within the next six months or so, when I get access to a better scanner. Locating the negatives was the slowest part.\n\n"
    },
    {
      "time": "22 Dec 2007 — 11:19am",
      "content": "Very nice. I recognise the steps in the photos with Hannah, on Cambie Street, just around the corner from where I used to have my studio in the Dominion Building. At the recent wayzgoose in Vancouver, I met someone who assumed that I was Wil Hudson's son. We had this rather strange conversation, in which he kept making references to my father, and it took me a while to figure out the mistake.\n\n"
    },
    {
      "time": "25 Jan 2008 — 11:48am",
      "content": "More pics, at higher resolution, added to Wil Hudson folder:  \n [http://www.flickr.com/photos/hhjohnston/sets/72157603575682661/](http://web.archive.org/web/20130821055103/http:/www.flickr.com/photos/hhjohnston/sets/72157603575682661/ \"http://www.flickr.com/photos/hhjohnston/sets/72157603575682661/\")\n\n"
    },
    {
      "time": "14 Apr 2013 — 9:44am",
      "content": "Great archive. I stumbled across these searching for information about Wil Hudson who (as is obvious) worked in Cape Dorset Kinngait Studios of which I am the current arts advisor manager. I have been involved in the studios since 1988 and have hear all the stories bout Wil and his influences. I am a lithographer by trade but we still have the Vandercook that Wil used as a proofing press and we are actively getting into readiness to do it's part in the year collections. I have sent many of these photos (Flickr collection) to Terrance Ryan now mid 70's who hired Wil, to work in Dorset and I have had local help from Facebook to ID the Inuit people in the photos, some of whom are still alive.  \nCan anyone tell me if Wil is still roaming this earth? He was such a powerful and influential person in the development of the Kinngait Studios (then Kingait Press) that I'd like to cobble together what ever I can so he will be remembered for the contributions left behind.  \nRegards  \nWilliam Ritchie\n\n"
    }
  ]
}
