{
  "id": "40292",
  "title": "HELP : InDesign CS3 proper TEXT Settings for a Major American Magazine.",
  "forum": "Build",
  "tags": [

  ],
  "content": "Kind Regards Fellow Typophiles .\n\n_I come to you in search of some honest and informed help._\n\nI am currently at the helm of redesigning a major american magazine.  \nWhat I would like to ask for is some help with properly infusing good typographic principles throughout the text of the mag.\n\nI am working in InDesign CS3 and would like to ask if any of my fellow designers/typesetters here might be able to share some wisdom and insight as to how I might tweak the default settings to get the best possible aesthetic and functionality out of flowed text ?\n\nI know this request may be a bit general / but I’ve just read through this great discussion here : [http://www.typophile.com/node/16395](http://web.archive.org/web/20071229080114/http:/www.typophile.com/node/16395 \"http://www.typophile.com/node/16395\") regarding justification and right ragged copy.\n\nMany great points are made in that discussion: For the design of this magazine I have incorporated both formats throughout. Obviously my concern is that the settings and details be set optimally so that I get the best readability out of the text.\n\nSo - Should I be using the HYPHENATION feature when flowing copy ?  \n_I tend to turn it on - and change the settings to only allow it for larger letters /  \n I know that one needn’t use hyphenation on larger columns of text / but I’m typically  \n working in a 3 Column grid / on a normal Mag sized page / therefore it seems okay ?_\n\nShould I be working with Adobe Paragraph Composer / as opposed to Single Line Composer ?  \n What kind of settings should I be using ?\n\nHere’s another great Thread I was reading in hopes of getting on the right track : [http://www.adobeforums.com/webx/.3c0558fd](http://web.archive.org/web/20071229080114/http:/www.adobeforums.com/webx/.3c0558fd \"http://www.adobeforums.com/webx/.3c0558fd\")\n\nPLEASE LEND ANY AND ALL ADVICE / It’d be much appreciated / and you’d be helping to steer a large publication in the right typographic direction!\n\nTHANKS ALL .\n\n [‹ Kerning Multiple Master fonts](http://web.archive.org/web/20071229080114/http:/typophile.com/node/38719 \"Go to previous forum topic\") [Nodes in MM-fonts ›](http://web.archive.org/web/20071229080114/http:/typophile.com/node/39965 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071229080114/http://typophile.com/user/8574\" title=\"View user profile.\">Aerosyn-Lex Mes...</a>",
  "time": "<br>",
  "uid": "8574",
  "comments": [
    {
      "time": " 23.Dec.2007 6.15am",
      "content": "Regarding the paragraph composer to single line composer, as far as I know you should always use the paragraph composer. The paragraph composer is a nifty technique in which InDesign “looks” not only at the line it is justifying but also at neighboring lines to try to calculate the best possible justification settings. Single line looks at each line separately, which means you’re more likely to get rivers and lakes in text.\n\nIf you’re fully justifying lines, hyphenation tends to be a good idea, especially if the column width is small, so that InDesign has small enough units to work with to keep the spacing consistent. But since rag left keeps the word spaces the same, hyphenation is far less necessary.\n\nCaveat: I’m a student whose knowledge may be more academic than practical, though I think it’s valid.\n\n"
    },
    {
      "time": " 23.Dec.2007 6.28am",
      "content": "IMO you will need a wide variety of H&J-settings for the different parts of a magazine. In all instances even ‘colour’ is what you should aim for. An example: when doing an introductory paragraph in a larger typesize than the body, with also a different leading/typesize ratio, you should change the wordspace to even out the different linespace.\n\nIt would be a major undertaking to explain this in every finesse (and it’s something I am going to do on a professional basis, soon), so I will leave it here & suggest that you do a lot of experimenting (or hire an expert to do it for you).\n\nCheers.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 23.Dec.2007 7.46am",
      "content": "_helping to steer a large publication in the right typographic direction!_\n\nI know I’m going to sound like a grumpy curmudgeon for saying this, but they’re **paying** you to steer this large publication in the right typographic direction. It’s **your job** to do it. And here you are asking for major help.\n\nSo my advice is, how about getting some books on working with type, magazine design, etc. There’s even a book out there about typography and InDesign. Then come back with less general questions.\n\n"
    },
    {
      "time": " 23.Dec.2007 8.38am",
      "content": "I agree with Ricardo. Moreover, why in the world would you ask type designers about setting type?\n\nHere are a few observations from a compositor, with the caveat that I have 20+ years setting type with TeX, but less than a year with ID CS2.\n\nParagraph composer versus single-line composer: In general, if you take the time to get the min-ideal-max spaceband settings optimized for a particular typeface, particular size, and particular measure, it will set better type. If you do not, then the single-line composer will set better type. If you think about it, you will see why, but for what it is worth, I’ve tested this notion on a limited basis and found it correct so far.\n\nAs to hyphenation and all the rest . . . All typesetting involves compromises. Making the best compromises depends on the particular standards of an audience. That audience is ideally the readers, but in practice is apt to be the editors and/or the designers. There are formal standards, too. AP style is different than “Chicago” style, and both different from MLA style. Legal style has variations too — the Harvard “Blue” being one style for legal works.\n\nIf all this were cookbook, the people at Adobe are smart enough to have pre-programmed settings; if not just one, then “book” “magazine” “newspaper” etc. But setting type isn’t a cookbook problem, and they’re smart enough to recognize that, too.\n\n"
    },
    {
      "time": " 23.Dec.2007 8.45am",
      "content": "Regarding paragraph vs. single-line composer: designers I know who use the single-line composer do so mostly because paragraph composer gets really irritating when one is making a lot of manual adjustments to line breaks.\n\n"
    },
    {
      "time": " 23.Dec.2007 9.55pm",
      "content": "Kind Regards All, and many thanks for your responses.\n\nI suppose I was just hoping to engage in a conversation which may bring me some technical insight which I might not have found in the books and manuals I have read. I’ve always found it best to learn from those more versed than I and further more I’d hate to think that I’d be above asking for help or advice simply because of my position.\n\nThat being said.  \nBert - I agree with you whole-heartedly and I believe my approach to this particular design problem has been intuitive and it has been about maintaining a proper “colour” to the copy of the magazine.\n\nRicardo & Charles - I appreciate your words. I know that typography is something of great nuance and as such I see it as something that demands a curiosity and willingness to learn in order to really excel at it’s application. I’ve studied type under some noted  \ntypographers at PRATT in NY as well as Cal Arts. I understand some of the underlying theories of good type as detailed in texts like _The New Typography_ & _The Crystal Goblet_. Regardless I just sought to get some tips & pointers from any editorial design pros that may frequent these forums.\n\nI’ve only used inDesign for the last 3 years and I had wondered if anyone here might be able to share with me some user tips or tricks - insight into their working process.\n\nFor example : “Here’s an option you might have missed in the H&J’s settings that really makes a difference”  \nor “The best way to insert manual breaks is . . . “\n\n_Stuff like that._\n\nAgain, I apologize for the general questions. I was simply hoping to get a variety of responses and pick up the dialogue from there.\n\nCharles - thanks for taking the time out to site some of the settings I should be focused on. I’ll be sure to research  \nand experiment with the min-ideal-max spaceband settings.\n\nTHANKS AGAIN ALL.\n\nbest\n\n"
    },
    {
      "time": " 24.Dec.2007 5.38am",
      "content": "Do some mockups of the different styles you want to start with. We used to set annual reports and other important jobs with greeking to get and idea of what the design would ultimately look like. Try this, then you can show us what you have done and we can give you some pointers from there.\n\nMerry Christmas,\n\nRodrigue Planck\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": " 24.Dec.2007 6.09am",
      "content": "With a magazine, you have a great many constants to work with. I would use the paragraph composer and tweak the settings with your line length and type size combination. Adjust your hyphen limit and break options to handle most situations and make a stylesheet of that. After that make a style sheet based on it previous one which is a bit more lenient on hyphenation for problematic situations. The problems come with editing after layout. Reserve your single line work for just the final stage prior to printing. After a couple of issues of tweaking your style sheets, you should be good to go for most situations.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Dec.2007 6.17am",
      "content": "Pardon my suspicion: Why would a major magazine want you to head up it’s redesign?\n\nI know books, not magazines, but the first things I think of with magazines are:\n\n1. All the advertisements have to get in.\n\n2. The pictures (images) are at least as important as the text.\n\n3. There will always be a lot of material that will bleed, and some material that won’t quite fit a grid.\n\n4. By in large, you need to fit is as much of the scheduled text as you can.\n\netc.\n\nMuch of this isn’t true for books; depends on the type of book.\n\nNow don’t you think the kinds of compromises you need to make in setting the text for the above are going to be quite different than for setting text in a book?\n\nI can’t stress enough that every decision in setting type is a compromise; that all the aesthetic rules of “good type” come with presuppositions about what you are doing.\n\n"
    },
    {
      "time": " 24.Dec.2007 4.45pm",
      "content": "Here are my thoughts on a few things about InDesign text setting for a magazine.\n\nFirst, a lot depends on your typical line lengths and the typeface you’re using. Knowing that would help a fair bit. That being said....\n\nSecond, IMO the paragraph composer will almost always give results that are as good as or better than the single-line composer - usually better. However, extra work in adjusting line breaks is the cost of this, as noted.\n\nThird, rather than trying to \\*control\\* the paragraph composer, you should be thinking about how to \\*influence\\* it. It’s much easier to stop it from doing something you don’t way than to make it do something you do want. In particular, careful and limited use of “no break” formatting is usually the best way to get it to keep stuff together or otherwise influence its line breaking decisions. In a pinch, switch the entire paragraph to the single line composer and manually tweak the line breaks.\n\nFourth, if you’re using a well-made typeface, mostly use “metrics” kerning rather than “optical” kerning. BUT, the latter is still useful when mixing type sizes/styles or trying to correct for the omission of a specific kern pair in the text. Stick the cursor between the two letters and change the kerning to “optical” to just affect that combo.\n\nFinally, InDesign has that really handy slider (code name: Nigel) that lets you control the tradeoff between hyphenation and spacing. If you don’t like hyphenation, don’t turn it off! Instead, adjust the slider to the point where you are happy with that tradeoff. That allows InDesign to still hyphenate when the alternative is really bad. (My own opinion it that there’s nothing wrong with hyphenation, and I’d much rather have a few hyphens than lousy spacing, so I put the slider pretty far the other way. But I recognize that there are diverse opinions on this issue.)\n\nHope those tips help.\n\nCheers,\n\nT\n\nThomas Phinney  \nProduct Manager  \nFonts & Global Typography  \nAdobe Systems\n\n"
    },
    {
      "time": " 27.Dec.2007 9.46am",
      "content": "I have a few more suggestions:  \n1) Use the paragraph composer. The paragraph composer should significantly reduce the number of lines that need manual adjustments to improve color. One reason some magazines don’t use it is because they are concerned about the effects of late-stage edits (the entire paragraph could reflow). However, it doesn’t affect more than 1 paragraph and the change is generally the best alternative.  \n2) Turn off the hyphenation zone (set it to zero) and experiment with real layouts with real text with different hyphenation-slider settings (like Thomas suggests).  \n3) For things like headlines or pull-quotes, you can turn off hyphenation and try using “Balance Ragged Lines” which does a first-pass at balancing the line lengths (it doesn’t do it grammatically, just mathematically).\n\n"
    }
  ]
}
