{
  "id": "40296",
  "title": "Help with Poster Design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am participating in a math conference in early January and need to prepare a poster on my research. The poster is to be a 3 fold, science fair style poster board. I was wondering if anybody had general design tips for fonts, font sizes, line spacing, spacing between different sections &c. It's a pretty serious conference, so there isn't much room for pictures or anything but I was thinking of adding some color with a border around the sections. Thank you!!!\n\n",
  "author": "Glen",
  "time": "23 Dec 2007 — 7:50am",
  "uid": "24145",
  "comments": [
    {
      "time": "23 Dec 2007 — 8:50am",
      "content": "Well, not exactly a direct suggestion on fonts, font sizes, line spacing, spacing between different sections, &c, but I suggest you look at [Nicola Talbot](http://web.archive.org/web/20150414062111/http:/theoval.sys.uea.ac.uk/~nlct/)'s [flowfram](http://web.archive.org/web/20150414062111/http:/theoval.sys.uea.ac.uk/~nlct/latex/packages/index.html#flowfram) package if you're comfortable with LaTeX. There's also a Java program called [JpgfDraw](http://web.archive.org/web/20150414062111/http:/theoval.sys.uea.ac.uk/~nlct/jpgfdraw/index.html) that can be helpful in designing complex layouts with flowfram.\n\n"
    },
    {
      "time": "23 Dec 2007 — 8:47am",
      "content": "Head over to the nearest big bookstore, buy Ellen Lupton’s book _Thinking With Type_, and read through it. You can get through it in an afternoon or two, and it will give you a ton of useful information for this project.\n\n"
    },
    {
      "time": "23 Dec 2007 — 9:27am",
      "content": "Awesome! Thanks for the suggestions!\n\n"
    },
    {
      "time": "23 Dec 2007 — 10:27am",
      "content": " ![](http://web.archive.org/web/20150414062111im_/http:/typophile.com/files/justdoit_3420.jpg)\n\n"
    },
    {
      "time": "30 Dec 2007 — 4:04pm",
      "content": " ![](http://web.archive.org/web/20150414062111im_/http:/typophile.com/files/PosterDesign_5054.JPG)\n  \n\n ![](http://web.archive.org/web/20150414062111im_/http:/typophile.com/files/PosterDesign2_3966.JPG)\n  \nThanks again for your help! This is my first try at it. I wasn't able to get flowfram to work but I made good use out of the a0poster document class. \"Thinking With Type\" is in the mail... There is still much work to be done, but I didn't want to post all my math! :) \n"
    },
    {
      "time": "1 Jan 2008 — 8:41pm",
      "content": "I'd suggest that you first think about how the poster will be viewed. Will you be standing next to it most of the time, or will it have to stand on its own?\n\nIf you'll be close by most of the time, then consider making the type big enough that a viewer could read your abstract and conclusions without invading your personal space. I've found that conference attendees like to be able to get a sense for what you've done before having to engage you in conversation. Then include diagrams and other visual aids that you'd like to be able to refer to while explaining your work to those that are interested. This approach will lead to including less detail in the poster.\n\nIf the poster is expected to stand on its own, then temptation is to write it like a mini-paper. I've had colleagues who have insisted that this is the correct approach to take in creating a poster, and they may be right. However, I'd still consider very carefully the level of detail you choose to use.\n\nI'm not sure which typeface you're using for the text, but it looks like the tex package uses computer modern for the math. I'd suggest _not_ using Computer Modern in the poster. To my taste, it's too spindly. Try to use a package that replaces both text and math font: for example mathpazo (based on Palatino) or fourier (based on Utopia) or the mathdesign fonts based on Bitstream Charter. Of those, only mathpazo gives true small caps (if you select that as an option).\n\nFinally, I'd also recommend the flowfram package for creating a poster. But consider trying the beamer package as well (if not this time around, then in the future). Beamer was designed for slides, but it gives very fine-grained control of many aspects of the layout once you've gotten used to it. One of my student research teams won a poster prize for a poster created with Beamer. You just need to tell it to create a very large slide.\n\nST\n\n"
    },
    {
      "time": "6 Jan 2008 — 7:24am",
      "content": "Thank you very much for the helpful suggestions Scott!!!\n\n"
    }
  ]
}
