{
  "id": "40303",
  "title": "ITC Galliard best format?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm trying to work out what the deal is with opentype vs mac postscript fonts and how ligatures and alternates work.\n\nApparently Opentype fonts can have automatic insertion of old style figures, ligatures and small caps (last para [http://www.itcfonts.com/Fonts/NewFonts/2006/May2006.htm](http://web.archive.org/web/20141010122837/http:/www.itcfonts.com/Fonts/NewFonts/2006/May2006.htm \"http://www.itcfonts.com/Fonts/NewFonts/2006/May2006.htm\")) .. wtf? rad. Does this work in CS3?\n\nDoes that mean if you were using a MAC postscript font you'd have to insert your alternates and ligatures manually?\n\nI'm looking at buying ITC Galliard for the sexy alternates and ligatures.\n\nOpenType (does this come with the same characters as MAC postscript below??)  \n [http://www.itcfonts.com/fonts/font/pid/427686/ITC+Galliard+Pro+Italic/de...](http://web.archive.org/web/20141010122837/http:/www.itcfonts.com/fonts/font/pid/427686/ITC+Galliard+Pro+Italic/detail&grab_id=0&page_id=55631&query=galliard%20pro&SCOPE=ITCFonts \"http://www.itcfonts.com/fonts/font/pid/427686/ITC+Galliard+Pro+Italic/detail&grab\\_id=0&page\\_id=55631&query=galliard%20pro&SCOPE=ITCFonts\")\n\nMac Postscript  \n [http://www.fontshop.com/fonts/singles/carter\\_cone/itc\\_galliard\\_roman\\_ita...](http://web.archive.org/web/20141010122837/http:/www.fontshop.com/fonts/singles/carter_cone/itc_galliard_roman_italic_alternates_cc/ \"http://www.fontshop.com/fonts/singles/carter\\_cone/itc\\_galliard\\_roman\\_italic\\_alternates\\_cc/\")\n\nShould I just go old school and buy the MAC postscript?\n\n",
  "author": "1pxsolid",
  "time": "23 Dec 2007 — 6:09pm",
  "uid": "25352",
  "comments": [
    {
      "time": "23 Dec 2007 — 7:28pm",
      "content": "If you've got InDesign, get the Opentype version of Galliard. It may have glyphs the Postscript Type 1 version doesn't, and it'll be a lot easier to access the sophisticated typographic features, which you'd have to insert manually with Type 1.\n\n"
    },
    {
      "time": "23 Dec 2007 — 8:19pm",
      "content": "\\> OpenType (does this come with the same characters as MAC postscript below??)\n\nIt's difficult to know, because the previews on itcfonts.com and fonts.com don't seem to show all the glyphs in an OT font. I would contact ITC and ask them.\n\nNormally, I would recommend the OpenType version of any font, because small caps, ligs, figures, and alternates are indeed much easier to use in that format. But _[ITC Galliard CC](http://web.archive.org/web/20141010122837/http:/www.fontshop.com/fonts/downloads/carter_cone/itc_galliard_cc/) is a different set of fonts than ITC Galliard_. They were created by Matthew Carter after the ITC release, so the two families may not be comparable. [Carter and Cone](http://web.archive.org/web/20141010122837/http:/typophile.com/wiki/Carter%20and%20Cone) have not released an OT version of ITC Galliard CC, but you could contact them or FontShop to create one for you.\n\n"
    },
    {
      "time": "23 Dec 2007 — 9:57pm",
      "content": "Thanks Stephen,\n\nI've emailed both itcfonts.com and fontshop.com to find out more information.\n\nOne newbie type question: If I didn't have the advantage of OpenType format with ITC Galliard, how would I use the alternates? I'm primarily going to be using Photoshop and Illustrator... I'm guessing I'd have to identify the alternate characters myself and change them manually?\n\nCheers.\n\n"
    },
    {
      "time": "23 Dec 2007 — 11:47pm",
      "content": "Yep. It's a tad tedious if you're setting a lot of type. Automatic glyph substitution is one of the many reasons OpenType was developed.\n\n"
    },
    {
      "time": "24 Dec 2007 — 3:56am",
      "content": "Damn that really sucks. From testing this out myself, you don't even get to use the same letters when you want to manually use alternate characters... I just tested using the font Mr Eaves. In order to write 'tricky' with the funky 'cky' ligature, I have to write 'tri5'... 'tri' was set in normal italic, and '5' being the character that represents 'cky' in the ligature keymapping.\n\nAm I doing this correct? If so, it might be worth hunting down a solid OpenType implementation of ITC Galliard CC... if one exists. :(\n\n"
    },
    {
      "time": "24 Dec 2007 — 7:23am",
      "content": "I don't believe Carter & Cone (CC) Galliard is commercially available in OpenType. There are a number of characters available in the C&C fonts that likely (i.e., weren't in the past) available in the ITC fonts, like tabular old-style numbers. Also, there is a \"Swedish\" version available from C&C that has lower-case \"f\" which works better with umlaut-accented vowels.\n\nI don't think C&C would object to your making an OpenType version of Galliard for your own use -- That would be worth checking. If you don't try to go hog-wild with the features, it is pretty easy, and in passing, you can include some kerning pairs not in any of the Galliards available.\n\nC&C Galliard is available only in roman & italic; for the bolds & blacks you have to buy ITC fonts. But the roman & italic cover the text, and that's where the refinements of C&C Galliard really show.\n\nFWIW\n\n"
    },
    {
      "time": "24 Dec 2007 — 10:55am",
      "content": "Again, like Charles and I said, ITC Galliard CC in OpenType is not available. You'll need to get permission to create it yourself, or inquire with Carter & Cone or FontShop about a conversion.\n\nNote to self: this is a great thread to show people who want to see one of the main benefits of OpenType.\n\n"
    },
    {
      "time": "24 Dec 2007 — 11:54am",
      "content": "Ah, the image won't upload. I'd delete the post but that doesn't seem to be an option.\n\n ![](http://web.archive.org/web/20141010122837im_/http:/typophile.com/files/C&C%20Galliard_4495.gif)\n\n"
    },
    {
      "time": "24 Dec 2007 — 6:41pm",
      "content": "In Carter&Cone Galliard, the uppercase and lowercase have better harmony that the ITC version.  \nAlso C&C fonts are expertly kerned by Matthew Carter himself.\n\nTell Cherie Cone your needs and she will help you... very excellent customer service from her.\n\nMike Diaz:-)\n\n"
    },
    {
      "time": "24 Dec 2007 — 9:04pm",
      "content": "& if you do start to use the C&C Galliard, which I highly recommend over the ITC Galliard, you might want to do some tests and open the tracking maybe + 1 or even +2 for text work. It seems to help.\n\npowers\n\n"
    },
    {
      "time": "25 Dec 2007 — 1:06am",
      "content": "'will powers' you said above\n\n\"if you do start to use the C&C Galliard, which I highly recommend over the ITC Galliard\"\n\nAre you recommending this version? -\\> [http://www.fontshop.com/fonts/downloads/carter\\_cone/itc\\_galliard\\_cc/](http://web.archive.org/web/20141010122837/http:/www.fontshop.com/fonts/downloads/carter_cone/itc_galliard_cc/ \"http://www.fontshop.com/fonts/downloads/carter\\_cone/itc\\_galliard\\_cc/\")\n\nCos that's still ITC... but from what I gather that version is the most extensive in terms of characters. Am I right? If so, I think I will buy the MAC Postscript myself and perhaps in time create an Opentype version... If I really desire it.\n\n"
    },
    {
      "time": "25 Dec 2007 — 6:38am",
      "content": "<cite>Cos that’s still ITC... but from what I gather that version is the most extensive in terms of characters. Am I right?</cite>\n\nWell, yes, and no. I don't know the exact timeline of Galliard; Carter may have cut it when still working for Linotype. At some point, it got sold to ITC, and at that point, ITC owned the name. This has happened to more than one type designer . . . Sumner Stone cut at least part of the \"Stone\" clan when working for Adobe. It got sold (\"licensed\") to ITC. When Stone started up his own foundry, he had to pay ITC for the right to offer his own fonts -- which he did, refining them some in the Stone foundry version.\n\nAnybody who releases an ITC font is suppose to stick pretty much to the same font. The trick here is the \"pretty much.\" I liken it to the notion that if the font was used in printing newspapers, then if you changed from one foundry to another for an ITC font, you shouldn't have to change your settings in the composition program (size, kerning, etc.) and most of your readers wouldn't notice the difference.\n\nBut most of us frequenting this site aren't printing newspapers, and we like to think our use of type is a little better than with newspapers, and our audiences a little more attuned to detail.\n\nSo, in my somewhat less than humble opinion, the C&C versions of ITC Galliard are a little more refined than the Bitstream (also a Carter company). He fixed some things that bothered him. The kerning is a little more refined too, but a user of type always has to do his/her own tinkering with the kerning. It is the letterforms themselves that are better with C&C.\n\nKeep in mind that even the C&C Galliard was rendered before direct-to-plate printing, and some feel the balance of the letterforms is a bit off, a bit <cite>thin</cite> when printed CTP. But I doubt Carter will refine Galliard yet again, so the C&C version is probably the last version we'll get.\n\nIt is still a wonderful font if you pay attention to the setting size; has great balance when you get the size just right.\n\nWhenever I buy one of Matthew Carter's fonts nowadays, I always call Cherie Cone first. I figure they make a little more money with no intermediary.\n\nFWIW\n\n"
    },
    {
      "time": "26 Dec 2007 — 3:16am",
      "content": "Stephen Coles and Charles\\_e ... thanks for the words of wisdom. Hugely appreciated.\n\nAfter much deliberation, I'm still very much set on getting this version -\\> [http://www.fontshop.com/fonts/downloads/carter\\_cone/itc\\_galliard\\_cc/](http://web.archive.org/web/20141010122837/http:/www.fontshop.com/fonts/downloads/carter_cone/itc_galliard_cc/ \"http://www.fontshop.com/fonts/downloads/carter\\_cone/itc\\_galliard\\_cc/\") as it seems a lot more extensive and from the comments above, more work and detail has gone into it than the OpenType version.\n\nCalling Cherie Cone from Carter and Cone is a little hard for me as I'm in Australia ... and it's the festive season ;)\n\nAll the OpenType hype has already got me researching how to convert the MAC Postscript using the advantages of OpenType ... hmm\n\nCheers\n\n"
    },
    {
      "time": "26 Dec 2007 — 7:35pm",
      "content": "To me Galliard without oldstyle figures for all fonts is unthinkable, so I was very pleased when ITC recently issued its OpenType version with oldstyles for all the fonts and weights in the family, plus plenty of other glyphs. They say that their font versions were approved by Matthew Carter before issue, which is enough for me. When I checked awhile back, the Carter & Cone versions only give oldstyles for the base-weight roman and italic--they seemed to think you only need oldstyles for stationery! So for me, the ITC OpenType is the only one to get.\n\nDo NOT get the Adobe OpenType version of Galliard, which did not even TRY to extend glyph coverage beyond the old PS1 version, which I denounced as fraudulent on another thread. ITC, however, is making landmark efforts to bring full glyphs, including oldstyle figures, to many older issues, including, for instance, ITC Franklin Gothic, which never offered oldstyles before. This is very encouraging for the future.\n\n"
    },
    {
      "time": "26 Dec 2007 — 7:20pm",
      "content": "<cite>When I checked awhile back, the Carter &amp; Cone versions only give oldstyles for the base-weight roman and italic—they seemed to think you only need oldstyles for stationery!</cite>\n\nPerhaps that is because Carter & Cone only offered roman & italic in Galliard?\n\n"
    },
    {
      "time": "27 Dec 2007 — 8:57am",
      "content": "Hi Scott,  \ncheck out [this thread](http://web.archive.org/web/20141010122837/http:/typophile.com/node/6833) and, in particular, [this one](http://web.archive.org/web/20141010122837/http:/www.typophile.com/node/31219).\n\nIn the latter I wrote:  \n<cite>Most ligatures and swash alternatives [of the ITC Galliard CC version] were incorporated in the [ITC] OT Pro version, others are missing (among them: alternative ampersand, 2-storey g, long-tailed Q, fj/fr/us/as/is-Lig, end swash forms for d, m, e) [edit: there actually <em>are</em> end swash forms for a, e, h, n, r, t in the OT Pro Roman] or look different (ij-Lig). Ornaments also only with ITC Galliard CC […].<br>\nThen, with ITC Galliard Pro you’d get one font with all the extra stuff comfortably accessible, not to mention all the foreign language diacritics.</cite>\n\nStewf wrote:  \n<cite>It’s difficult to know, because the previews on itcfonts.com and fonts.com don’t seem to show all the glyphs in an OT font.</cite>\n\nYeah, missing glyph tables on foundries’ (or distributors’) websites are annoying! Once more, kudos to Fontshop.com for being so groundbreaking in this point.  \nLinotype once used to show the Galliard Pro glyphs, but they seem to have gone.\n\nFor better comparison, here are all glyphs of ITC’s Galliard Pro OpenType:  \nRoman has 634 glyphs, Italic ‘only’ 512.\n\n ![](http://web.archive.org/web/20141010122837im_/http:/typophile.com/files/itc-galliard-pro-roman_5130.gif)\n  \n\n ![](http://web.archive.org/web/20141010122837im_/http:/typophile.com/files/itc-galliard-pro-italic_4703.gif)\n\n&nbsp;\n\n ![](http://web.archive.org/web/20141010122837im_/http:/typophile.com/files/figures-linking_6512.gif)\nIn addition to the other advantages of OpenType, like linked figures (see above), small-caps etc., there is something special to Galliard Pro OT: a stylistic subset with slightly longer descenders:\n\n ![](http://web.archive.org/web/20141010122837im_/http:/typophile.com/files/itc-galliard-pro-descenders_5227.gif)\nIn InDesign, you can select this option via the OpenType palette, or, for a wider application, via paragraph styles.\n\nmondoB wrote:  \n<cite>Do NOT get the Adobe OpenType version of Galliard, which did not even TRY to extend glyph coverage beyond the old PS1 version, which I denounced as fraudulent on another thread.</cite>\n\nJohn, you refer to [this thread](http://web.archive.org/web/20141010122837/http:/www.typophile.com/node/29567). However, it seems you haven’t really read it. Several people, Thomas and Miguel among them, have explained why Adobe _can’t_ extend those fonts: they are only licensed, Adobe is not authorized to add additional glyphs to them.  \nSo, you have a point in claiming that Adobe Galliard OT is not the best Galliard one can get. But please stop accusing others of being ‘fraudulent’, okay?\n\nF\n\n"
    },
    {
      "time": "1 Feb 2008 — 3:53pm",
      "content": "I considered it fraudulent when Adobe's sales copy for the OpenType library CD, consulted in Nov '06, promised a new world of enhanced glyph coverage across the board for all OpenType issues, NO EXCEPTIONS NOTED. Then, the customer who paid thousands for this CD is shocked to find just how many text families in OpenType actually offer nothing new for their glyphs versus the PS1 format.\n\nWe all understand the licensing problem, but that was not the point for customers who, unable to research precise glyph coverage for each of 2,300 fonts, feel victimized. Perhaps because of our widely-read discussion of this discrepancy, Adobe sales copy now says \"most\" but not all fonts offer extended glyphs, a helpful qualification. But I also made many constructive suggestions about addressing the glyph shortfall family by family, creative collaborations with license-owners that would have demonstrated Adobe's leadership instead of their current passive indifference to their customers' needs. Now that ITC has released their enhanced OpenType Galliard, perhaps they are ready to re-license it to Adobe so Adobe can replace their now worthless version. But that's another thread.\n\n"
    },
    {
      "time": "1 Feb 2008 — 5:31pm",
      "content": "Just so you know, the CC Galliard Roman and Italic match the other weights of the Bitstream version -- if you need the other weights (I have never used them). To my knowledge, these weights have only the standard character set, none of the extras shown in the Pro version above.\n\nI asked Cherie Cone a couple of years ago if they would be producing an OpenType version. She told me that I was the first person to ask, and that they would consider it if there was a demand.\n\nThe Pro version above seems to have just about everything needed to set good type. Unless you really need an fj (which you can easily make yourself), I don't see why you can't make do with the Adobe Pro Galliard. The CC version does contain both fitted and non-fitted numerals, both in lining and hanging, plus a few extra swash characters (dangerous).\n\nI like the CC version, and have used it for years. It is in serious need of an update to OT. If enough people ask for this, I'm sure CC will respond accordingly.\n\n"
    }
  ]
}
