{
  "id": "40302",
  "title": "Looking for a free alternative to Nyx",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi! I hope I’m in the right board for this. A thousand pardons if I’m not. :)\n\nI’m looking for a look-a-like (preferably free) of the font Nyx. Here’s a link to the original font:  \n [http://www.fonts.com/FindFonts/detail.htm?pid=202867](http://web.archive.org/web/20071225134453/http:/www.fonts.com/FindFonts/detail.htm?pid=202867 \"http://www.fonts.com/FindFonts/detail.htm?pid=202867\") It doesen’t have to be \\*exactly\\* alike, but the closer the better.\n\nI appreciate the help!\n\n [‹ !!! PLEASE READ THIS FIRST !!! Frequently Answered Questions](http://web.archive.org/web/20071225134453/http:/typophile.com/forum/typeid/faq \"Go to previous forum topic\") [(x) Barbapapa fonts - VAG Rounded, custom, Croissant {Michael A, Stephen, Yves} ›](http://web.archive.org/web/20071225134453/http:/typophile.com/node/40315 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071225134453/http://typophile.com/user/25347\" title=\"View user profile.\">Neeter</a>",
  "time": "<br>",
  "uid": "25347",
  "comments": [
    {
      "time": " 23.Dec.2007 2.29pm",
      "content": "Your best bet for free fonts is [http://www.dafont.com](http://web.archive.org/web/20071225134453/http:/www.dafont.com/ \"http://www.dafont.com\")\n\nIf you don’t find something that looks the same, you may have to spend the money on the legitimate font.\n\nOff the top of my head, La Bamba with a white stroke applied might be close. I think it was included with some versions of Office or Photoshop.\n\n- Lex\n\n"
    },
    {
      "time": " 23.Dec.2007 5.49pm",
      "content": "The font Nyx — Fonts.com:  \nSource Foundry: Adobe  \nDesign Foundry: Unknown  \n_Designer: Data not available_\n\nThey don’t know who’s Rick Cusick?\n\n"
    },
    {
      "time": " 23.Dec.2007 8.25pm",
      "content": "It’s a sad reality that reseller sites like Fonts.com do not always list complete designer credit information, and ours (FontShop.com) is no exception. We do try to add info where it’s missing, but when the foundries don’t supply it from the beginning, that’s often the root of the problem.\n\n"
    },
    {
      "time": " 25.Dec.2007 4.42am",
      "content": "Stephen is abolutely right! All resellers try to nail as much info as they can. At Linotype.com, we have the following information about Nyx:\n\nDesigner: Rick Cusick  \nNyx is a stencil typeface designed by lettering artist Rick Cusick and named after the designer´s muse: the Greek goddess of night. Classic roman capital forms underlie its sharp, energetic surface. Nyx first began to take shape as hand lettering on the artist´s New Year´s greeting card. It later appeared in several art exhibits of Cusick´s work before it was digitized and refined on the computer. Gallant and spartan at once, Nyx infuses music CD liners, toys, games, and magazine titles with dash and daring. (Nyx is a trademark of Adobe Systems Incorporated which may be registered in certain jurisdictions.)\n\nSadly, I haven’t got a year for Nyx. On the Linotype.com webshop, I always tried to get in a designer name, a release year, and some sort of description (in that order of importance). There is also a designer page for most designers, but Rick’s just repeats the info for Nyx — [http://www.linotype.com/353/rickcusick.html](http://web.archive.org/web/20071225134453/http:/www.linotype.com/353/rickcusick.html \"http://www.linotype.com/353/rickcusick.html\")\n\nOn the flip side, all of our Nyx info is at least Bi-Lingual; we have it in German on our German website, too.\n\nAs for a free similar font, I don’t know of any, and honestly, it’d be a bit difficult. Rick is a great calligrapher, and well, for a similar font you’d probably need to find a free font designer whose a great calligrapher, too. But if you look at Nyx and the way it was created, maybe you could find a designer who makes free fonts who works in similar manners or from similar inspirations. But in terms of the time you’d spend searching, it might be more cost effective for your project just to license the font.\n\n"
    }
  ]
}
