{
  "id": "4031",
  "title": "How do I pay my taxes?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "It's almost April, and what does _that_ mean? For US residents, it's Tax-Paying Time! And this, being a typography forum, is probably the best place to ask for advice! \\<|:^)   \n   \nSerioiusly, though, this forum is chock full of people who are in the same situation as me: Freelance Designer. I'm new to this freelance thing, fresh out of school, and I have no clue how to do this stuff. So, my questions to any of you takers is,   \n   \nHow do I pay my taxes? Do you know any good online resources (better yet, any free online things for freelancers who didn't make too much)? Any tips on writeoffs? How not to get audited?\n\n",
  "author": "whoisdan",
  "time": "Tue, 2004-03-30 20:38",
  "uid": "2739",
  "comments": [
    {
      "time": " Tue, 2004-03-30 21:31",
      "content": "Two suggestions:   \n   \n1. Pay quarterly estimated taxes. This saves you from having to write a fatty check in april (same idea as having taxes witheld from you paycheck)   \n   \n2. I use TurboTax. Seems to work out ok. It's a straight forward walkthrough that anticipates your questions and doesn't require a green eyeshade to operate. As a freelancer my larger clients send me 1099's (not the W2's you're used to). I think a 1099 is not needed for values under $600. Even if you don't get one and value is over 600, you should still report those earnings (your client will probably report it, just not with a 1099 -- and you want your numbers and their numbers to jive). Turbo Tax also walks you through various ways to write of business expences (equipment, travel etc). Then you print a copy for yourself and E-file the thing off to the IRS. Done. All in all, no complaints.   \n   \nGood luck!   \nRandy\n\n"
    },
    {
      "time": " Wed, 2004-03-31 06:09",
      "content": "If you are concerned about being audited and where to find writeoffs then the only proper advice anyone should offer is for you to hire an accountant.   \n   \nAfter you hire one and discuss your current tax problems, may I suggest you look into creating a more formal business entity. Either a LLC or a Corporation subchaper S or C. The Schedule C tax form for Sole Proprietor that most freelancers file is the most heavily scutinized form the IRS receives, simply because most tax fraud occurs there.   \n   \nThe prevailing climate in the U.S, favors business over individuals. By creating for yourself a formal business entity, you will avail yourself of more rights than you currently have as an individual. Sad but true.   \n   \nAnd after you hire your accountant. Find a good lawyer!\n\n"
    },
    {
      "time": " Wed, 2004-03-31 08:30",
      "content": "I second James! In simpler lingo, by incorporating, you're taxed at a lower rate on your income and your accontant can define a paperless system so you don't have to write timecards to your self of hold board meetings.   \n   \nIn addition, you will need to issue yourself a W-2 and define a salary for your position. Also people should pay the corporation with an EIN number instead of your personal social security number.   \n   \nAnother benefit is that if somebody comes after you with a liability claim, they cannot sue you personally.   \n   \nKeep in mind you can stay a sole proprietor for up to 3 years and show a loss but at year 4 you must show a profit or it's considered a hobby.   \n   \nWhile it's better to have an accountant do your incorporation, a friend of mine just used this service and was very pleased with the results. [http://www.mycorporation.com/](http://web.archive.org/web/20050516143013/http:/www.mycorporation.com/)   \n   \nBy the way, if your company name is different than your corporation name, you may need to file an assumed name form with the state you live in. Also if you decide to start accepting credit cards online, they'll use the corporation name instead of the DBA name.   \n   \nThe thing about taxes is that you can't lump them into one category, you must manage state taxes and federal taxes seperately because each has their own rules and to some degree benefits that you can find additional deductions with.   \n   \nGood luck whichever way you decide!   \n   \nStuart :D\n\n"
    },
    {
      "time": " Wed, 2004-03-31 09:21",
      "content": "Look for an accountant who is experienced with people in your kind of business.   \n   \nAnd be aware that some are more aggressive than others in what they will claim as an expense on your behalf. If you are audited, it will be a costly haggle (your accountant vs the establishment's) over the interpretation of what are legitimate expenses. It's a big complex grey area that the bean counters in government, the bureaucracy, and the private sector have created for the purpose of sucking money from your line of work into theirs.   \n   \nSo, if possible, get a favorable recommendation from a peer.\n\n"
    },
    {
      "time": " Wed, 2004-03-31 11:20",
      "content": "This is great feedback. I posted because I thought it would help me out, but I had a hunch that it would grow and cover a lot of ground that could help other, more advanced freelancers.   \n   \nI am actually just beginning my career as a designer and I've been working freelance for a few months. I only worked a little bit last year, so Randy's advice works better for me. That said, the rest of the information is awesome because I may be headed in that direction sometime this year (things have been picking up. It's amazing). About TurboTax: I saw that you can buy it online, but there's different versions. I assume I'd have to buy the $70 one for the self-employed? Is there anything else online that's similar? I don't think I can afford an accountant, btw...\n\n"
    }
  ]
}
