{
  "id": "40329",
  "title": "Kerning Rule Question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I saw a basic kerning rule in [Wikipedia](http://web.archive.org/web/20101215175826/http:/en.wikipedia.org/wiki/Kerning) such as “AV” and “Wa” letter.\n\nI try it in MS Office Word and it looks very good.\n\nHowever, I’ve found few letters is not easy to kerning such as ce, co, od, and Da.\n\nCan anyone tell me what the kerning rule for those letters is?\n\nThanks in advance\n\n",
  "author": "<a href=\"/web/20101215175826/http://typophile.com/user/22375\" title=\"View user profile.\">tomcenjerrym</a>",
  "time": "<br>",
  "uid": "22375",
  "comments": [
    {
      "time": "",
      "content": "What MS Word calls \"kerning\" works more like a tracking control. The program does however respond to the kerning settings in a font (if any is present). So all you really need to do is have kerning switched on with the checkbox thingy in the Font dialog.\n\nFor letter pairs like ce, co, od and da, not many fonts have kerning for those pairs because usually they don't need any, unless the letters are very badly designed.\n\nIncidentally, for typesetting ability, MS Word sorely needs to take a few lessons from Adobe InDesign.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "<cite>MS Word sorely needs to take a few lessons from Adobe InDesign.</cite>\n\nAdobe InDesign sorely needs to take a few lessons from Quark. Quark has a kerning pairs feature which InDesign lacks. This lets you override a font's default kerning, pair by pair, and preserve these settings for future use. Believe me there are a lot of badly hinted fonts out there. I've complained about this in the past, both here and on Adobe forums - and received support from other frustrated users but not a lot of response from Adobe.\n\nMS Word is not designed to be a typesetting software. It's for word processing, and as such is not likely to be able to produce the same level of finesse. For typesetting you need really to use Quark or InDesign.\n\n"
    },
    {
      "time": "",
      "content": "I almost left it at \"...needs to take a few lessons from Adobe.\" You're quite right about the flexibility of Quark. I use it more often than InD but had forgotten about the kerning pairs feature, taking it for granted.\n\n_Believe me there are a lot of badly hinted fonts out there._\n\n\"badly kerned\" you mean.\n\nMerry christmas Patty :^)\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Surely there _are_ a lot of badly hinted fonts, but that's a separate issue.\n\nDarn this technical jargon; fixing the meaning of things like words.\n\n"
    },
    {
      "time": "",
      "content": "Just when you thought life has some surprises and mysteries left in store, human technical prowess made the world just a little bit smaller again ;^)\n\nCheers Jason. Best wishes to you over there in Cupertino.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Maybe I read the Wikipedia article a bit to quickly. I didn't see any \"rule,\" though the example the top right of the piece was curious. To my eye, the unkerned VAST was superior to the kerned version -- the kerned one suggested two abbreviations, \"VA\" and \"ST\" (for Virginia Streets?)\n\nEvenness applies to the whole word, the whole line, the whole page. To get the right spacing between \"V\" and \"A\", you have to look at VARIATION, or some such word. All the spaces should be even. Tough, isn't it.\n\nAnd with cap-lowercase kerning, for goodness sake don't get the first lowercase letter closer to the cap than to the following lowercase letter(s).\n\nTo answer your question, round pairs sometimes require a \"positive\" kern (+). If you set the sidebearings of your round letters so they need little or no kerning with many other lowercase letters, they are usually a bit too tight against themselves. You are free to pick a particular strategy, but usually the result is the need to kern a few pairs -- which ones depends on the particular strategy you picked when setting sidebearings.\n\nThose of us dinosaurs who grew up reading material set in hot metal -- especially set Linotype -- perhaps have a different perspective. You couldn't kern Linotype. But you could have badly set Linotype and well set Linotype. There are other spatial relationships, you know. Maybe that notion can help with kerning -- it is just one more spacial arrangement, and has to fit with all the others (wordspacing linespacing, margins, etc.).\n\n"
    },
    {
      "time": "",
      "content": "_I didn’t see any “rule,” though the example the top right of the piece was curious. To my eye, the unkerned VAST was superior to the kerned version — the kerned one suggested two abbreviations, “VA” and “ST” (for Virginia Streets?)_\n\nThat kind of questionable illustration shows up all over the place at Wikipedia. The person who created it had good intentions, and it does illustrate kerning and the difference between kerning and tracking. Not, however, as artfully as a type designer or a typophile would try to make it.\n\n_All the spaces should be even._\n\nOptically even, but not neccessarily equal linear amounts of whitespace.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "All the spaces should be even.\n\n<cite>Optically even, but not neccessarily equal linear amounts of whitespace.</cite>\n\nSort of. I suppose \"balanced\" might be a better word, though that too leaves something to the imagination, just as \"optically even\" does. If your point is kerning isn't mathematical, I agree.\n\n"
    },
    {
      "time": "",
      "content": "Yes. Aesthetic sense has the final say on what looks right.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Here is a nice link for beginners to a typeworkshop by Ellen Lupton. Not about kerning, but spacing letters. [http://typography.art.udel.edu/schedule.html](http://web.archive.org/web/20101215175826/http:/typography.art.udel.edu/schedule.html \"http://typography.art.udel.edu/schedule.html\")\n\n"
    },
    {
      "time": "",
      "content": "Can you tell me what is meant by 0-L-0 (zero-L-zero) or o-L-o on the following image?\n\nThe image is form this [letter-spacing exercise.](http://web.archive.org/web/20101215175826/http:/typography.art.udel.edu/schedule.html)\n\n ![](http://web.archive.org/web/20101215175826im_/http:/typophile.com/files/TAKE_5062.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\\>Not about kerning, but spacing letters.\n\nThat is kerning, in digital type.\n\n\\>what is meant by 0-L-0\n\nI just looked at the exercises. The \"0\" means you've kerned the letter pair correctly. If it is off the number indicates by how much. The pairs that you cannot move in the exercise seem to be labeled with the \"L\". It might mean 'legacy' or something.\n\n"
    },
    {
      "time": "",
      "content": "The \"L\" appears only between fixed letters – those you cannot move anymore – I don't know the meaning. The ”0” appears when the spacing is perfect. You can see it on the attached picture. I made some mistakes, and now there are different figures (1 and 64). The measurement of the score depend on this figures.\n\n ![](http://web.archive.org/web/20101215175826im_/http:/typophile.com/files/tws_5303.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\\>That is kerning, in digital type.\n\nI'll never get that for the rest of my life ...  \nI thought kerning is the definited space between letterpairs adjusted by the type-designer himself ... and spacing is what I can do in layout programs to change the space for correcting pairs which are not well adjusted in my opinion or for visual effects which i want to achieve ...\n\n"
    },
    {
      "time": "",
      "content": "I guess the'L' means 'Locked' and the numbers reflect how much (em units?) you're away from the perfect kerning: so 0 (zero) is best. Nice link Nora.\n\n\\*\\*edit\\*\\* Oops ... read past William :(\n\n"
    },
    {
      "time": "",
      "content": "\\> _The “0” means you’ve kerned the letter pair correctly._\n\nThat’s what I want to ask or want to know.\n\nHow do I know that I have made the letter spacing correctly?  \nSay, as many people here was said, all spacing should be even, optically even, looking good, etc.\n\nI just wonder if there available any exact method to kerning letter.\n\nAnd about the letter-spacing exercise 0 – L – 0 on above link, that just the luck of mine.\n\n"
    },
    {
      "time": "",
      "content": "_I just wonder if there available any exact method to kerning letter._\n\nThere's no de facto standard method because every font is different, and depending on the use you put the font to, context can be a determining factor. The only available method is your own good judgement---when it looks right.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "\\>I’ll never get that\n\nIn the font there are two sets of \"metrics\". One is the two side bearings of each letter, which specify the gap between the left and right most black of the letter and the adjacent letters. That is called \"spacing.\" The other set is numbers which specify how to change that default spacing for specific pairs of letters, like AV, Ta, etc. This second set is called \"kerning\" metrics. So when you adjust specific pairs in a layout program you are also \"kerning.\"\n\n\\>if there available any exact method to kerning letter\n\nI wish! The excellent \"hints\" give you an indication of how complicated this is--it is a craft to be learned, which is the point of the exercises, which are very good.\n\nThere is the automatic \"optical spacing\" of Adobe, but the eye can be better.\n\nThe only thing I think people might object to in the exercises is her preference to completely overlap some letters, such as the L and A in \"PLAY\". Some might prefer to space out the whole word.\n\nI'd be interested in Charles's views on this.\n\n"
    },
    {
      "time": "",
      "content": "I think there is no rule. There is a quote by Paul Renner (custom made translation ... sorry): ”The belief in counting and measuring seduces to the greatest mistakes in all kind of arts.” It's all about looking to thousands of letterforms and getting blind and wise ;-) It's about white and black forms and space. But I think there are also personal preferences, perhaps also national preferences, i dont' know, but when i once reached the higher levels of the above mentioned typeworkshop, there are some correct solutions i don't like very much.\n\nThank you, William!\n\n"
    },
    {
      "time": "",
      "content": "I don't have a good formula and doubt if one is even worthy of pursuit. The fixed spacing is typically anything next to a straight vertical like a cap H next to any letter. Kerning pairs are for situations when a fixed spacing is impossible. This is typical of diagonal letters like A and V or letters with large gaps like L and T. The idea is to try to minimize the holes caused by adjoining glyphs with airy underarms. The problematic thing is balancing the kerning adjustment throughout a font. The V to W with the A to V with the W to A and so on. The perceived color should feel comfortable next to fixed letters like H next to N. This is no mean feat. There are problems with overlaps and tensions between near overlaps struggling to keep a parity with extended appendages. If you think Latin caps are tough to space and kern, try Cyrillic! There are way more problem children there to contend with.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "<cite>I’d be interested in Charles’s views on this.</cite>\n\nI don't really have a fixed view. In our work, we have to accommodate the \"House Style\" of the publishers we work for. Usually \"House Style\" is a combined effort of editorial and design, with the editor's opinions frequently ranking higher than designers. Some editors devoutly believe (i.e., a matter of faith, not to be swayed by any argument) that letters should never \"touch.\" Occasionally, I have even had ligatures marked \"PE, touching.\" This one I fight for (\"If you want us to set your books, you'll have to allow ligatures,\" which isn't an argument but an ultimatum).\n\nMore subtle would be a case like Galliard, where the \"quotedblleft\" frequently touches a capital letter. Gives it a bit of a hint of a swash cap, which I think just fine with Galliard's letterforms & spacing. But more editors will mark that an error than will let it pass, so our kerning in Galliard removes that bit of touching -- & I take the more common approach that the space between a double quote and a letter should be a bit more than the space between the two marks making up the double quote.\n\nIt is fairly common for display type to be considered an exception; though for some editors, that too seems to fall under the \"no touching\" rule. In these cases, if the designer's layouts have made clear that touching letters in display are what the designer wants, we'll do it & let the designer fight with the editor.\n\nFor text, my personal feeling is that the type design itself tells you when touching or even overlapping letters are OK; the nominal spacing in the font gives you the clues. For me, Galliard works, & some things touch. An overly aggressive tracking of a looser font often just ruins the font.\n\n"
    },
    {
      "time": "",
      "content": "The biggest negative about Quark kerning pairs is that you have to export and send them along to its next destination. Tracking same thing. Another negative about Quarks kerning pairs is that they are a once size fits all… but they do get you into the ballpark of good looking type. They are decades ahead of Adobe on this front, literally! I once kerned several hundred fonts with Quark, then lost the computer I used for it, can we say loose as a goose? My family owned a type house and to get proofreaders to actually see that balance was far better than tight tight tight was a constant battle for me. They were used to advertising type of 60's and 70's, which was too tight for comfort, I preferred balance and the occasional overlap. We had many more ligatures with each font than most have today, too.  \nThe Truth shall set you free\n\n"
    }
  ]
}
