{
  "id": "40338",
  "title": "The Most Useful OpenType Ligatures",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Being that it's the holidays and there may be more than a few of us trolling around looking for topics to dig into, I thought up a juicy topic that may or may not have already been covered but I think it's worth further discussion regardless . . .\n\nAs OpenType gives us the auto ligature feature, it occurred to me, what are the MOST useful ligatures that I could add to my fonts . . .\n\nNow, before I throw this out there, I'm already throwing out the common ffl ffi ae oe deal because how often can one eat a waffle while reading an encyclopaedia?\n\nAnd to further up the ante, I'm thinking this in reference to more display oriented designs rather than text faces . . .\n\nI'm looking for good common substitutive ligatures that can give the effect of non-repeating forms such as oo, ll, ee, and ss, etc . . .\n\nIdeally, I'd like to come up with a top 10-20 that would be a standard for most fonts . . .\n\nAt worst, any fonts you can point to that may feature a thoughtful approach would also make for good fodder . . .\n\nCast away . . .\n\nStuart :D\n\n",
  "author": "Diner",
  "time": "26 Dec 2007 — 3:14pm",
  "uid": "1226",
  "comments": [
    {
      "time": "26 Dec 2007 — 4:00pm",
      "content": "Hi Stuart,  \nI think ligature use is determined more by the type of font in question. I've been working on an antique style handwriting font lately. In handwriting, forms are predominantly connected. Most connections can occur smoothly in the same place. I find that letters whose stroke end at the top such as o v w and sometimes b often work best with ligatures. w\\_h is one that seems to flow better that way. I don't always make ligatures for double letters as contextual substitution seems to cover that well enough. Exceptions to that are usually combos with crossbars like f\\_t t\\_t or things like oo. Sometimes I get tempted into spicing things up a bit and include ligatures that are for beginnings only.\n\nAll this is assuming we're talking about Open Type ligatures as opposed to creating a 2nd PS version with extras. If you go too wild with ligatures you have to watch out for conflicts. For instance, if you have both o\\_o and o\\_n you might consider an o\\_o\\_n ligature to be first in line.  \nHope that helps ...not exactly a list.  \nStephen\n\n"
    },
    {
      "time": "26 Dec 2007 — 4:16pm",
      "content": "Hi Stuart,  \nI always think of common pairings like Th, th, tt, and certainly ff. The extended f ligs used mostly in other languages fj ffj fh ffh fk ffk and fb ffb are more often seen now with opentype. I have done some goofy ones in my Froggy typeface including gg, ggy, gy, and gh but they are discretionary to say the least :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Dec 2007 — 4:57pm",
      "content": "The most useful OpenType ligature or alternate pair is the one that's not included in the typeface :)\n\n"
    },
    {
      "time": "26 Dec 2007 — 5:15pm",
      "content": "Don't forget, æ and œ are counted as distinct letters in certain languages' orthographies rather than simple ligatures. They're hardly ever used in modern English, true, but are a requirement in others, like French or Icelandic (which has a few other noteworthy extensions too).\n\nAs for suggestions on novel ligatures, look for combinations where ordinary letters would collide, particularly in the descenders, g\\_j, g\\_y, g\\_g, j\\_j, and almost anything preceding j.\n\n"
    },
    {
      "time": "26 Dec 2007 — 5:16pm",
      "content": "<cite>The most useful OpenType ligature or alternate pair is the one that’s not included in the typeface</cite>\n\nLike f + igrave (or a lot of vowels with a grave, dieresis, breve, caron, etc.).\n\n"
    },
    {
      "time": "26 Dec 2007 — 6:00pm",
      "content": "Most <cite>useful</cite> ligatures would indeed be solutions preventing collitions, greatly depending on what font you're making. You could also consider contextual alternates (for example a 'shorter' f in a fì (yes that an ì) combination).\n\n"
    },
    {
      "time": "26 Dec 2007 — 8:38pm",
      "content": "\\<---(Formerly blank comment)  \n(Man, the re-ordering of edits is a pain in the a\\*\\*)\n\nTHAT's your ligatures to build, right there. Replacing swear words with family-friendly alternatives.)\n\n"
    },
    {
      "time": "26 Dec 2007 — 6:58pm",
      "content": "Quite a wordy post there, Dan? :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Dec 2007 — 7:09pm",
      "content": "I was speechless.\n\n"
    },
    {
      "time": "26 Dec 2007 — 7:11pm",
      "content": "I myself love the old Roman/Renaissance monument style ligatures. Mmm. Ligatures.\n\nAnd the new ones that people have been creating for things like smileys. :) :( :P :O\n\n"
    },
    {
      "time": "26 Dec 2007 — 7:37pm",
      "content": "Speak, Dan---speak. I'm listening. I hear your champagne laff, I live in the curtain, I sleep in your hat ;^)\n\nHi Stuart---Ray Larabie has made a quite a few OT fonts loaded with discretionary ligatures that may be worth your while checking out:  \n [Mecheria](http://web.archive.org/web/20131019195750/http:/www.myfonts.com/fonts/typodermic/mecheria/)  \n [Sinzano](http://web.archive.org/web/20131019195750/http:/www.myfonts.com/fonts/typodermic/sinzano/)  \n [Zamora](http://web.archive.org/web/20131019195750/http:/www.myfonts.com/fonts/typodermic/zamora/)  \n [Rinse](http://web.archive.org/web/20131019195750/http:/www.myfonts.com/fonts/typodermic/rinse/)  \n [Neuzon](http://web.archive.org/web/20131019195750/http:/www.myfonts.com/fonts/typodermic/neuzon/)  \n [Oxeran](http://web.archive.org/web/20131019195750/http:/www.myfonts.com/fonts/typodermic/oxeran/)  \n [Croteau](http://web.archive.org/web/20131019195750/http:/www.myfonts.com/fonts/typodermic/croteau/)\n\nNeuropol ligatures is one giant ligatures font from the pre-OT era, but the pairings are closely related to the Neuropol structure.\n\n\\>As for suggestions on novel ligatures, look for combinations where ordinary letters would collide, particularly in the descenders, g\\_j, g\\_y, g\\_g, j\\_j, and almost anything preceding j.\n\nThat's been one of my main uses of ligatures, for collision avoidance, and pairs that normally have poor fit like r\\_a.\n\nj a m e s\n\n"
    },
    {
      "time": "26 Dec 2007 — 9:21pm",
      "content": "I would echo what was said about intent being key. If you want to make a silly/fun/expressive/threatening/(insert your display description here) font more so then what you choose to ligate & why is completely different than if you are making a text face.\n\nSo I guess I am saying that building a laundry list isn't what I would suggest.\n\nAlso contextual substitution might be a better route in some cases because it leaves the fonts free to be rough ridden more evenly by designers ( take that! ya!). Whereas a ligature will just break the word when they track it out at 200 or whatever they decide is needed. And a contextual sub can be made to build a ligature if it's really needed.\n\n"
    },
    {
      "time": "27 Dec 2007 — 10:26am",
      "content": "Being that I deal with the ff ligature on a daily basis I have to say it is important. Yeah, I'm vain. If a typeface doesn't have a nice ff lig when it \\*should\\* have one I turn the page quickly.\n\nTIC\n\n"
    },
    {
      "time": "27 Dec 2007 — 11:51am",
      "content": " Chris, ‘saying least’ is indeed a habit indicating great discretion, but what’s that got to do with…. Oh. Never mind. ☺  \n—Joel\n\n"
    },
    {
      "time": "27 Dec 2007 — 12:25pm",
      "content": "I see you just considered the source, eh Joel? :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Dec 2007 — 1:07pm",
      "content": "Tiff, how happy would you be ( or not happy ) with a font that built it's ff \"lig\" from two glyphs and let you track them slightly for justification etc. if you needed to? Would you see that as a step back?\n\n"
    },
    {
      "time": "27 Dec 2007 — 7:37pm",
      "content": "Eben, at face value I'd rather trust the designer to give me ligatures that work with the design. However, some fonts have ligatures that are spaced (or drawn however you see it) that are too tight and force the user to either not have control over letter-spacing or turn off ligature usage. But in this instance, I'm thinking of designs that beg for the first letter in the double-f lig (or any double letter lig) to be slightly different than the second.\n\n"
    },
    {
      "time": "27 Dec 2007 — 10:35pm",
      "content": "Doesn't Spiekermann go off on this subject in his Stealing Sheep book? Something about the \"th\" ligature being too tight or something? I've always wondered about that.\n\n"
    },
    {
      "time": "28 Dec 2007 — 5:17am",
      "content": "I really wish to see a text face with a solution for f+umlauts.  \nIn German language, ‘fä’, ‘fö’ and ‘fü’ are anything but rare, just think of ‘für’ [‘for’].  \nIn a lot of classic serif faces the drop of the ‘f’ reaches out quite far to the right. That’s why there are ligatures like fl, ff, fi – to avoid collision, right?\n\nSo, dear type designers: before doing fancy things like including ‘ffj’ and ‘ſſl’ ligatures, 5 different ampersands and a truckload of ivies, please consider addressing this umlaut issue!\\*\n\nSee this illustration:\n\n ![](http://web.archive.org/web/20131019195750im_/http:/typophile.com/files/f-umlaut_4616.gif)\n  \nYellow is (to me) only just acceptable, red isn’t anymore.  \nAnd, of course: the bolder, the more clotted it gets.\n\nBy the way, I didn’t pick 4 fonts by Adobe because they were especially ‘bad’ – no, this problem is inherent to all faces that have an extensive ‘f’. I used these fonts as they are commonly regarded as being – in all aspects – very well equipped OpenType text fonts – and _still_ suffer from this particular issue.\n\nIn my humble opinion, merging the ‘f’ drop with the left dot of the umlaut (as in ‘fi’) can’t be the way to go – that would look really awkward. I’d love to have an alternative ‘f’ with a narrower top for those cases, preferably with automatic substitution, via the lig feature.\n\nAnd while doing so, don’t forget the triple combinations :°)\n\n ![](http://web.archive.org/web/20131019195750im_/http:/typophile.com/files/affaere_6019.png)\n\nI don’t think this problem is limited to German language; the Swedish among others will benefit aswell.\n\nF\n\n\\*) Don’t get me wrong; I very much appreciate all those special equipment. All I want to say is: first things first.\n\n"
    },
    {
      "time": "28 Dec 2007 — 5:40am",
      "content": "P.S.: I see this came up before [in this thread](http://web.archive.org/web/20131019195750/http:/www.typophile.com/node/33330), though not especially focussed on umlauts. There, Thomas Phinney called that less sweeping ‘f’ a “Linotype f” – it all has been there before … :°)\n\n"
    },
    {
      "time": "28 Dec 2007 — 7:20am",
      "content": "Not as sophisticated as Adobe, but here is one of the Central European ligs from Chai Tea Pro.  \nStephen Rapp\n\n ![](http://web.archive.org/web/20131019195750im_/http:/typophile.com/files/oft_4290.jpg)\n\n"
    },
    {
      "time": "28 Dec 2007 — 8:13am",
      "content": "Tiff, I think you are answering a different question. I am wondering if a type designer made a visual lig using two glyphs ( as opposed to the traditional one glyph lig) that moved with tracking would that be better or worse in your opinion? The assumption being that they look look identical if there is no tracking.\n\n"
    },
    {
      "time": "28 Dec 2007 — 8:46am",
      "content": "I thought I had with the first sentence. :^) If the type designer thinks that is the best solution then why not. Of course, I'd want to see an example and test it for myself. ;^)\n\n"
    },
    {
      "time": "28 Dec 2007 — 9:38am",
      "content": "Makes sense.\n\nIt is also true that the solution I am advocating ( two glyphs ) no matter how skillfully made can be made visually broken by too much tracking as well. I guess I just think it's a better model because it has a chance at least to be more resilient. But your point about actual implementation being 'all' is bang on.\n\nI suppose what I really wanted to know was if you thought there was any inherent superiority to the one glyph model & if so why. But it sounds now like you wouldn't take that position. Is that right?\n\n"
    },
    {
      "time": "28 Dec 2007 — 1:12pm",
      "content": "No. I don't see any superiority. As far as I am concerned I want the ligatures to belong to the design. I suppose the only reason I might think the one glyph model would be superior is because the design calls for true integration of the shapes.\n\n"
    },
    {
      "time": "28 Dec 2007 — 1:21pm",
      "content": "_design calls for true integration of the shapes_\n\nWrite that down. Good shot Red Two!\n\n\"mew\"\n\nj a m e s\n\n"
    },
    {
      "time": "28 Dec 2007 — 6:01pm",
      "content": "Aha! I thought I heard something rattling around. ;-)\n\nBut what if prior to any tracking going on you could have uterly identical shapes? Admittedly it might be that some kinds of designs wouldn't be amenable to this - but just for the sake of argument - if you could get a lig that was visually identical - then I think the reason for 1 glyph ligs evaporates.\\* Do you agree? Feel free not to!\n\nWith one important exception: Backwards Unicode compatibility. But you could include a glyph with out using it in your replace functions!\n\n"
    },
    {
      "time": "28 Dec 2007 — 7:11pm",
      "content": "See, when you start talking about the coding I get left behind. You guys are way beyond my under the hood knowledge of fonts.\n\nBut, if I follow . . . Why would I want that?\n\n"
    },
    {
      "time": "28 Dec 2007 — 11:42pm",
      "content": "Sorry. I didn't realize how opaque some of this was. I will do my best.\n\nIn the case of backwards compatibility I am saying that a text can be hard-encoded to include the glyph for ff or fi for instance. And if you had a text like that you could loose the meaning of the text if you didn't include the single unicode glyphs 'ff' or 'fi' in your font.\n\nOn the other hand, if you had a common sort of text - the sort we set 99.9 % of the time - with fand i or fandf indicated as separate glyphs you could allow the ff & fi to interpreted into the visual appearance/shape of a classic ff or fi ligature but using coding to make two glyphs overlap.\n\nAnd as far as why you would want to - a regular one glyph ligature often looks quite wrong with only fairly minor tracking.\n\nSo.. one solution to that ( apart from not tracking a font ) is that as a font designer you could contrive a design that let the shapes ( within a tight range probably ) to flex in tracking right along with the other letters. Then inter letter spacing wold be consistent.\n\nProbably the best thing to do is to make a visual reference! I have been meaning to make a stab at one for some time in order to see what results were possible. And to see what the practical limitations might be.\n\n"
    },
    {
      "time": "29 Dec 2007 — 1:41am",
      "content": "Optical auto-kerning in InD positions single glyph ligatures in a tracked-out line of text made up of mostly normal a -- z letterforms so that the weight distribution and color is even. Even tho the single glyph ligature structure presents a bigger lump of type. It somehow takes that into account. I think that thing works on equal division of the white space.\n\nj a m e s\n\n"
    },
    {
      "time": "29 Dec 2007 — 9:06am",
      "content": "Of course not everybody uses InD... ;-)\n\nBut still that's a good point. On the other hand if the font is well made it might be better left with it's own kerning table.\n\nJames; what's your take on this? Does what I am talking about make sense to you?\n\nA minor point - those ct & st ligs might not survive my plan, depending on how they were made.\n\n"
    },
    {
      "time": "29 Dec 2007 — 6:01pm",
      "content": "_James; what’s your take on this? Does what I am talking about make sense to you?_\n\nYes. Everything you talk about makes sense to me.\n\nIn 25 words or less: OT positioning commands can make up ligatures \"on-demand\" from a library stocked with a range of glyphs to suit different tracking conditions.\n\nThat's 23 words.\n\nTiffany---_I want the ligatures to belong to the design...because the design calls for true integration of the shapes._\n\nThat can be done with Eben's scheme. Custom parts that integrate on an intuitive aesthetic basis. It would take some planning tho. It's only a matter of egineering it into existence.\n\nI put caps spacing programs into my OT fonts, a kind of in-built tracking feature using simple positioning commands. The one piece capital ligatures are designed to work with what I determine are the best or most useful tracking settings.\n\nj a m e s\n\n"
    },
    {
      "time": "29 Dec 2007 — 9:51pm",
      "content": "I think the idea of coding to overlap the letters accordingly sounds dangerous. Interesting, but dangerous. I can imagine what you're talking about, but the proof would be in the pudding, so to speak. Show me what you're thinking, let's see if it is possible.\n\n"
    },
    {
      "time": "29 Dec 2007 — 11:15pm",
      "content": "<cite>sounds dangerous. </cite>\n\nOddly enough so do i in a way. And it's true that some kinds of designs could not be made any less brittle with a two glyph model than they are with a one glyph model. But I am betting that many could be made better. Still, as you say it's \"in the pudding\".\n\nThanks for your comments James!\n\nI will try to get a visual example to post sometime this week. What examples would be the most convincing for you Tiff? What about you James? And by this I mean what ligatures and what source fonts?\n\nBTW if you mean technically \"dangerous\" then no worries. There are perils but technical perils are the very very least of them.\n\n"
    },
    {
      "time": "30 Dec 2007 — 8:30am",
      "content": "Florian, [MUFI fonts](http://web.archive.org/web/20131019195750/http:/www.mufi.info/fonts/) have fä, fö and fü ligatures. They use the solution you reject as awkward, but considering the nature of the project I must assume there is historical precedent for the form.\n\n"
    },
    {
      "time": "30 Dec 2007 — 10:54am",
      "content": "_I think the idea of coding to overlap the letters accordingly sounds dangerous._\n\ni don't think it'd be that dangerous (if i'm following correctly). of course it could be problematic if a user tries to increase letterspacing too much. i'll hafta run some tests...\n\n"
    },
    {
      "time": "30 Dec 2007 — 11:41am",
      "content": "Kevin, thanks for the link!  \nI decided to start a [new thread on the ‘f’+umlaut thing](http://web.archive.org/web/20131019195750/http:/typophile.com/node/40439), as this is quite special, and I don’t want the question get buried by other aspects.  \nF\n\n"
    },
    {
      "time": "30 Dec 2007 — 12:55pm",
      "content": " ![](http://web.archive.org/web/20131019195750im_/http:/typophile.com/files/f_6060.png)\n\n"
    },
    {
      "time": "30 Dec 2007 — 4:16pm",
      "content": "Good idea Florian!\n\nPaul, I have been looking at some examples that would probably not work as given. They would have to be re-invented to a certain extent. I am looking forward to comparing solutions.\n\n"
    },
    {
      "time": "10 Apr 2011 — 3:52pm",
      "content": "As I learn German since 2006, I've encountered some things that disturbed my eyes in German texts : the lack of NECESSARY ligatures that makes the text pleasant to read. Just like Florian Hardwig explained it very well above in the thread : the glyphs (f+umlaut) are often in collision. Since the beginning of the metal type, the type designers have created special ligatures in order to avoid these problems. Unfortunately this scheme applies only for a few languages today. Since a long time, I was asking to myself : Has a designer created a typeface with such ligatures already ?\n\nToday I discovered Ingeborg, by Typejockeys. It has won the TDC awards in 2010. And it has those special ligatures.  \nI was amazed !\n\n ![](http://web.archive.org/web/20131019195750im_/http:/typophile.com/files/DA-Fas1_4474.gif)\n\nbetter image [http://img851.imageshack.us/img851/6230/ingeborgfligs.jpg](http://web.archive.org/web/20131019195750/http:/img851.imageshack.us/img851/6230/ingeborgfligs.jpg)\n\nAnyone knows other typefaces with those specifications ?\n\ncarlos\n\n"
    },
    {
      "time": "11 Apr 2011 — 12:03am",
      "content": "Carlos,  \nyes, see the spin-off thread: [f + umlauts](http://web.archive.org/web/20131019195750/http:/typophile.com/node/40439).  \nNote however that most commentators (including myself) feel it is better to have a contextual alternate (a short f), than to introduce uncommon and potentially annoying ligatures.\n\n"
    },
    {
      "time": "11 Apr 2011 — 10:23am",
      "content": "Right. The f-ï ligatures in Ingeborg are enough like f followed by an i with a displaced tittle to cause confusion.\n\n"
    },
    {
      "time": "11 Apr 2011 — 12:24pm",
      "content": "of course totally agree with your remark. fï ligs are weird in Ingeborg.  \nAfter reading the thread you created Florian, I conclude that merging the f's drops with the first umlaut's drops gives the f too height in comparison of the 'standard' f. It's like an arm that tries to catch an object (ball) out of reach !\n\n"
    },
    {
      "time": "11 Apr 2011 — 12:59pm",
      "content": " ![](http://web.archive.org/web/20131019195750im_/http:/typophile.com/files/mondA_4569.png)\n  \n\n ![](http://web.archive.org/web/20131019195750im_/http:/typophile.com/files/mondAkurs_6514.png)\n\nLigatures from [this unreleased typeface](http://web.archive.org/web/20131019195750/http:/www.typophile.com/node/61066) of mine. I'm wondering for which words in which language an fï ligature is needed, by the way.\n\n"
    },
    {
      "time": "11 Apr 2011 — 1:31pm",
      "content": ".\n\n ![](http://web.archive.org/web/20131019195750im_/http:/typophile.com/files/lig_4859.jpg)\n  \n.  \nYou never come at an end …  \n(Is there really a use for f\\_f\\_f??) \n"
    },
    {
      "time": "11 Apr 2011 — 3:36pm",
      "content": "schifffahrt\n\n"
    },
    {
      "time": "11 Apr 2011 — 11:51pm",
      "content": "<cite>schifffahrt</cite>\n\nNo!! This is a compound word: Schiff-fahrt. An established rule says that you must not use any ligature across word boundaries.  \nApart from that, Schiffahrt with 3 f’s is dull new age spelling, no decent German.  \nBut that’s another thread ;-)\n\n"
    },
    {
      "time": "12 Apr 2011 — 3:10am",
      "content": "Hi Stuart,  \nOn the Lobster, I have put the 'fina' into the 'liga', so the 'fina' is turned on by default. Also included in the 'liga' all the ligatures that you will normally put in 'calt', since I believe that they need to be turned on by default too.\n\n"
    }
  ]
}
