{
  "id": "40332",
  "title": "InDesign users to be extinct like \"lead\" users, CSS coauthor cries!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A [YouTube video](http://web.archive.org/web/20131022135107/http:/www.youtube.com/watch?v=vcXUrNSvjhU) of a presentation at Google by Håkon Lie and Michael Day has Lie declaring that InDesign users, particularly at newspapers, will soon be so passé they will be more comparable to the old guys who moved “lead” type.\n\nThe context is the ability of Prince, a software application, to output a “typeset” PDF from HTML+CSS. (Lie was coauthor of the original CSS spec.) While that claimed capacity was covered in an [article](http://web.archive.org/web/20131022135107/http:/www.alistapart.com/articles/boom \"Printing a book under CSS\") I read, then and now my response is “_I’ll_ be the judge of that.” The presenters’ insistence that HTML-CSS-Prince handles “most” requirements (more than 80%) will, I suspect, be antithetical to the real typographers who read this forum. I think we spend rather a lot of time on that other 20%.\n\n",
  "author": "joeclark",
  "time": "26 Dec 2007 — 11:11am",
  "uid": "7076",
  "comments": [
    {
      "time": "26 Dec 2007 — 11:23am",
      "content": "Uh, yepp. We spend way too much time on that 20% CSS doesn't handle particularly well. Sorting out formatting problems in webpages designed with CSS has long been a major time waster for me. It's just plain deadline-threatening. CSS's failings are typical of the developmental bungling the W3C are reknown for. The fact I'd rather have a new biro should tell you everything. Also try: eating glass.\n\nThanks for the link Joe :^)\n\nj a m e s\n\n"
    },
    {
      "time": "26 Dec 2007 — 11:39am",
      "content": "The guys at the W3C always say the cutest things when they pull their heads out of their asses long enough to talk.\n\n"
    },
    {
      "time": "26 Dec 2007 — 11:44am",
      "content": "\"will soon be so passé\"\n\nWell, I didn't hear him say 'will soon be', so, I would have to say that I think it's certainly plausible that at some point, yea, this will be the way to go...especially for publishing entities that need to publish massive amounts of content to multiple media.\n\n"
    },
    {
      "time": "26 Dec 2007 — 11:45am",
      "content": "\"The guys at the W3C always say the cutest things when they pull their heads out of their asses long enough to talk.\"\n\nNo matter how evil some folks think the W3C is, I'll take them any day over 'standards' dictated by Adobe and Microsoft.\n\n"
    },
    {
      "time": "26 Dec 2007 — 12:04pm",
      "content": "I don't think they're evil Darrel, but misguided, and compromised by the commercial interests which decide what directions the steering committee recommends. That committee is made up of professionals from Mightgosoft and Abode, and the W3C itself is funded by massive contributions from them and other software companies involved in the business of making crummy software.\n\nI'm equally critical of the 'standards' pushed by MS and Adobe. Their software blows goats. What WC3 delivers is seldom any better. But I hope you're right in saying this is the way to go---provided CSS can be made to deliver what we need it to. Proliferation of multiple media publishing should drive it closer.\n\nj a m e s\n\n"
    },
    {
      "time": "26 Dec 2007 — 12:12pm",
      "content": "Watching the video, I get the impression that Prince is really a print-based 'browser' so-to-speak. In other words, it's a product that actually supports the CSS features that make print design a lot easier that most current browsers either ignore or mess up.\n\nSo, that's probably a good thing.\n\nNo doubt that the W3C is influenced by corporate entities. I still find that better than just having corporate entities state the standard (not that microsoft and aobobe don't already do that...). ;0)\n\n"
    },
    {
      "time": "26 Dec 2007 — 12:39pm",
      "content": "A print-based browser, yes. That's what it looks like. If it's dedicated to print it might end up handling that medium properly as the de facto standard for CSS, leaving online browsers to catch up.\n\n_No doubt that the W3C is influenced by corporate entities. I still find that better than just having corporate entities state the standard (not that microsoft and aobobe don’t already do that..._\n\nBeyond question, yes.\n\nj a m e s\n\n"
    },
    {
      "time": "26 Dec 2007 — 3:08pm",
      "content": "Yes, admittedly not “soon.” But he means “sooner rather than later.”\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20131022135107/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "27 Dec 2007 — 3:16am",
      "content": "I like that CSS will get more and more of those features, but I don't get the general point of that talk. They claim that they have invented the perfect way of automatic typesetting, whereas in Word or InDesign there are those sad people doing point and click to get the job done. Haven't they heard that every text and layout application uses stylesheets? And with much better results ...\n\nAnd about web fonts: I like the fact that they try to push it, but Larabie/Steffmann fonts as the future of web and print? OMG!\n\n"
    },
    {
      "time": "27 Dec 2007 — 3:52am",
      "content": "_And about web fonts: I like the fact that they try to push it, but Larabie/Steffmann fonts as the future of web and print? OMG!_\n\nAh, they're just hedging for the popular angle, something contentious to make people read it. Or maybe they're on a bum steer. I wouldn't take it too seriously.\n\nj a m e s\n\n"
    },
    {
      "time": "27 Dec 2007 — 6:57am",
      "content": "\"but I don’t get the general point of that talk.\"\n\nI think it was just to show off a particular technology...one that would (in theory) reduce the workload of a publisher that needs to accommodate multiple mediums. Instead of typesetting it for print, then formatting it for the web, you'd do it once, for both mediums, via HTML and CSS.\n\nI think it's definitely more of a 'in theory' thing right now, but I can definitely see hos there is some appeal to this down the road for high volume publishers (such as the newspaper they used in the example in the beginning).\n\n"
    },
    {
      "time": "27 Dec 2007 — 7:36am",
      "content": "Until the web starts to allow more finesse and control across browsers and platforms, it's hard to imagine one application that can handle both the precision required for print design and the flexibility required by the web.\n\nThat said, I know nothing about css. But I do know that for a lot of designers, code is fairly anti-intuitive to work with. I have a background in print (hence Quark, InDesign) and can fumble my way through Dreamweaver because it's aimed at users like me who need to actually see something rather than just write code, but when it comes to html, I leave that to the programmers.\n\nBack in the day, typesetting was done by typesetters, design by designers. The Mac changed all that, now most designers I know do their own typesetting (for better or worse). If the software gets too far removed from the physical act of designing, you'll start to partition things off again. I work with web programmers when I need to get a site done, but I'm not going to want to hire out for my typesetting.\n\n"
    },
    {
      "time": "27 Dec 2007 — 8:13am",
      "content": "\"Until the web starts to allow more finesse and control across browsers and platforms, it’s hard to imagine one application that can handle both the precision required for print design and the flexibility required by the web.\"\n\nWell, I think that's the intent of this particular application.\n\n\"But I do know that for a lot of designers, code is fairly anti-intuitive to work with. \"\n\nCSS isn't really more complicated than understanding proper styles in XPress or Indesign.\n\nGetting CSS to work PROPERLY in browsers takes some work, but the appeal of this Prince application is that it seems to fully support CSS \\*as intended\\*. Which is rare, unfortunately.\n\n"
    },
    {
      "time": "27 Dec 2007 — 9:04am",
      "content": "So I wonder which major newspaper will take their workflow from Quark to CSS.\n\n"
    },
    {
      "time": "27 Dec 2007 — 1:26pm",
      "content": "_The presenters’ insistence that HTML-CSS-Prince handles “most” requirements (more than 80%) will, I suspect, be antithetical to the real typographers who read this forum. I think we spend rather a lot of time on that other 20%._\n\nTrue, but that doesn't necessarily influence the dominance of production tools and workflows. Quark Xpress managed to grab most of the page layout market for a long time while supporting somewhat _less_ than 80% of typographic sophistication; indeed, so much less that Dean Allen used to call it anti-typographic.\n\n"
    },
    {
      "time": "27 Dec 2007 — 2:10pm",
      "content": "What I think the non-coders are missing is that a lot of the design we are doing now IS XML-based, or approaching it. For instance, although not a design program, Microsoft Word now uses XML.\n\nXHTML and CSS is XML, so we shouldn't be too far off from having a design program that can automatically spit it out properly encoded text. No programming required.\n\nThe issue is having a comprehensive enough CSS specification that covers more than the 80% of what we're talking about. IF, and it's a big if, we can get the specification to reach at least the level of sophistication of say, Pagemaker, that's a lot of design that can be accomplished.\n\n"
    },
    {
      "time": "27 Dec 2007 — 3:09pm",
      "content": "Yeah, but you’re doing it wrong if you start with styled text in an unpublished format (like MS Word, Quark, or InDesign) _and then_ try to output to HTML. Your result will be tag soup and will be unusable on any modern site.\n\nI have had more-than-satisfactory results with a workflow of valid HTML → MS Word → InDesign → tagged PDF. I start with and end up with published, accessible formats, and one of the intermediate formats lets me twiddle with typography and page layout to my heart’s content. (It bothers me that InDesign cannot simply inhale a valid [X]HTML file directly.)\n\nI feel I am reasonably informed on the topic and I am pretty sure that even Prince would not do what I want. Typesetting a single page that varies its number of columns is punishingly difficult in CSS yet readily achieved in InDesign, for example. Then there are the issues of ligature substitution, swash characters, and _real_ H&J. (Hyphenation is rather glossed over in the video; it’s viewed as being present or absent. I would like to know how I _prevent_ a word from being hyphenated in Prince, for example.)\n\nEven if John is right, the baseline has been raised. For Prince to achieve 80% of InDesign is a much taller order than PageMaker’s achieving 80% of whatever came before it. (And if that was 80% of the crapola CompuGraphic photosetters I worked on, well, how hard was that?)\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20131022135107/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "27 Dec 2007 — 9:41pm",
      "content": "Am I wrong, or are there not plenty of newspapers and magazines still using their own custom developed page layout systems designed to coordinate out put with invoicing systems for ad space? Something Quark and Indesign didn't do before, and something I don't quite see CSS handling. The applications I know best are for making signs, and they can track inventory, billable hours, etc. and spit out an invoice when you are done. I imagine a newspaper publisher would expect nothing less. Does CSS do that and if it does, is it still a cascading style sheet?\n\nAlso, I hear so many 80% / 20% rules lately... \"80% of your problems are caused by 20% of your (whatever)\", \"80% of you profits come from 20% of your customers (or products, or ideas)\", and so on... It just seems to me that if you are going to pick a number and say \"up to this point is good and you don't really need the rest\", then, don't pick 80%. (82.5% is better. ;o) These rules almost always make it seem as though it's the 20% that you _really_ want.\n\n-=®=-\n\n"
    },
    {
      "time": "27 Dec 2007 — 10:50pm",
      "content": "The CCI system used at the Seattle Times is exactly such a system. It was originally designed to aid the layout of time-intensive, text and ad heavy publications like phone books. It was and is not a typographically advanced system, no ligatures I'm afraid. It handles the bulk of the design work though, since ads constitute the bulk of a paper.\n\nFor graphically intense pages without ads, like our Entertainment and Arts Page 1, we use InDesign and Illustrator because we need more control over that final 17.5%\n\nAnd don't even begin to talk about classified advertising, because my head will explode.\n\nWill CSS handle this? Perhaps a sophisticated enough CSS spec could handle the layout of a dimestore novel respectably, but something as complex as a multi-page newspaper needs to not only be well specified, but also brutally error-free and as steady as a rock.\n\nWhich we all know web design/xhtml/css to NOT be. (See Exhibit A, Internet Explorer, any version.)\n\n"
    },
    {
      "time": "28 Dec 2007 — 2:48am",
      "content": "Sure, this is using proper CSS, but XML/SGML + stylesheets have been used for print for years. Recall being interviewed for a job of this kind in 1996. Technical publisher stored all their content in XML, used stylesheets to output to various paper formats, CDRom, later web.\n\n[http://en.wikipedia.org/wiki/XML\\_Professional\\_Publisher\\_%28XPP%29](http://web.archive.org/web/20131022135107/http:/en.wikipedia.org/wiki/XML_Professional_Publisher_%28XPP%29 \"http://en.wikipedia.org/wiki/XML\\_Professional\\_Publisher\\_%28XPP%29\")\n\nAs a half and half designer/coder, it is an increasing frustration that stylesheets in Quark/Indesign only go so far - you can't instantly rework a document from A4 to US letter, or make all 1st level headings within the 'further information' section of the page blue using stylesheets alone.\n\n"
    },
    {
      "time": "28 Dec 2007 — 8:27am",
      "content": "\"For instance, although not a design program, Microsoft Word now uses XML.\"\n\nAs does InDesign, actually.\n\nUltimately, it'd be nice to see a company like Adobe embrace a product like this and incorporate it into their own DTP apps.\n\nHowever, knowing MS and Adobe, they don't really like those open standards and prefer to keep to themselves. ;o)\n\n(To be fair, I think Adobe has been a bit better in this regard than MS has)\n\n\"No programming required.\"\n\nWell, for the record, CSS as it is now isn't really programming. It's just learning a bit of syntax. Really no different than learning prepress terms, or how to bind a book, etc. Just another publishing medium.\n\n\"I feel I am reasonably informed on the topic and I am pretty sure that even Prince would not do what I want. Typesetting a single page that varies its number of columns is punishingly difficult in CSS yet readily achieved in InDesign, for example.\"\n\nJoe, have you used Prince yet? I haven't, but if you do, I'd love your opinion. I agree that for a web browser, using CSS for varying columns is a huge PITA at the moment. Prince, however, seems to actually support CSS-3 fully, which DOES allow for columnar layouts. One example: [http://developer.mozilla.org/en/docs/CSS3\\_Columns](http://web.archive.org/web/20131022135107/http:/developer.mozilla.org/en/docs/CSS3_Columns \"http://developer.mozilla.org/en/docs/CSS3\\_Columns\")\n\nI agree, this is not a replacement for InDesign now. I am thrilled by the potential it has down the road, though.\n\n\"I know best are for making signs, and they can track inventory, billable hours, etc. and spit out an invoice when you are done. I imagine a newspaper publisher would expect nothing less. Does CSS do that and if it does, is it still a cascading style sheet?\"\n\nI have no answer for that (though would love to hear one). But, to add to the topic, it seems as if most successful papers are moving a lot of their ad revenue towards their online existence as advertiser depend less and less on the print medium for advertising. So this may very well become a nice addition to, rather than replacement of, current systems. It's been a decade since I've worked in a paper, though (which, at the time, was MS Word, cut and pasted into XPress [and then printed, cut, and waxed onto the keylines...those were the days...] and then cut and pasted into a primitive HTML editor where we published each article manually onto a static HTML site.)\n\n\"Which we all know web design/xhtml/css to NOT be. (See Exhibit A, Internet Explorer, any version.)\"\n\nAgain, Prince isn't a web browser. It's a HTML/XML to PDF renderer. The appeal is that it does support a much fuller set of the CSS spec (especially for print) than any current web browser.\n\n\"Sure, this is using proper CSS, but XML/SGML + stylesheets have been used for print for years.\"\n\nExcellent point. Doesn't Framemaker also use SGML or a subset thereof?\n\nI think the idea, though, is that everyone touches HTML/XML these days, if not a fuller SGML subset. So this product probably hits a few more of the pragmatic buzzwords out there.\n\n"
    },
    {
      "time": "28 Dec 2007 — 11:00am",
      "content": "At some point there was something called XSL-FO (formatting objects) flying around, with the express purpose of producing fully formatted paginated documents and PDFs from XML.  \nDoes anyone know what happened to that?\n\n\"Excellent point. Doesn’t Framemaker also use SGML or a subset thereof?\"  \nLast time I used Framemaker (admittedly, a few years ago) it worked quite well with XML (although it had to translate it into its own native markup). The most impressive thing about Framemaker was its very powerful stylesheet system to which nothing I've seen comes close.\n\n"
    },
    {
      "time": "28 Dec 2007 — 12:36pm",
      "content": "(I believe) We used Framemaker for for classified ads in one of the local papers I worked for. They would output their fully marked-up text, about 12 pages of classifieds, and we would input that into Pagemaker. We had style substitutions set up, so all we had to do was let it flow, ad display ads, then tweak to fit.\n\n"
    },
    {
      "time": "28 Dec 2007 — 11:31pm",
      "content": "Google is barking up an interesting tree, but it's still the wrong one. What I would much rather see is a tool like InDesign that can actually output usable HTML/CSS! Why use CSS for typesetting? Back Asswards.\n\nOutputting a typeset PDF deserves a (one handed golf clap) applause. But getting a decent layout application that works flawlessly is a whole other thing. Writing CSS still requires a developer to sit down and write code. We've gone miles beyond hand-writing Post Script, but we're not there close with HTML/CSS editors. We're 10 years out from the time the original WYSIWYG editors came out (NetObjects, GoLive) and still no serious web developers worth their salt use (or admit to using) WYSIWYG tools because they introduce too much error and require hand-coding. (Modern browser suckage is as much to blame as the people behind Dreamweaver.)\n\n(I realize the term WYSIWYG is probably also passé... but you get my drift.)\n\n"
    },
    {
      "time": "29 Dec 2007 — 4:34pm",
      "content": "\\> Why use CSS for typesetting? Back Asswards.\n\nAmen. How much professional typography experience do these gentlemen actually have?\n\n"
    },
    {
      "time": "29 Dec 2007 — 7:00pm",
      "content": "_professional typography experience_\n\nHey, Once you know what a serif is, some places you get to call yourself an expert.\n\n-=®=-\n\n"
    },
    {
      "time": "29 Dec 2007 — 7:35pm",
      "content": "_Once you know what a serif is, some places you get to call yourself an expert._\n\n(Or as someone said to me in Iqaluit, \"an 'expert' is someone from South of 60, with slides\" (in the days before PowerPoint).\n\nAmazing -- we all agree on something.\n\nI've learned some basic CSS because I had to for a client (to post some of their stuff on a website I did not design in the first place), not because I wanted to. ;-) And as much as I think Dreamweaver is terrifically useful for sketching-out things like tables that can be intricate (WYSIWYG is rather passé, as Joe has noted, although it does have its moments), I find that I still do most of my coding by hand.\n\nBut to make a blanket statement like this shows an incomparable amount of ignorance -- heaven forfend, even \"lead\" users are anything but extinct!\n\n"
    },
    {
      "time": "29 Dec 2007 — 11:32pm",
      "content": "InDesign will go away when printing goes away, which is sooner than people think. Everyone will cry for a while about how good type was in the days of InDesign and \"desktop publishing\" and lament that \"they just don't make 'em like they used to\". Then type on screens will get better and everyone will forget, except for a few grey hairs on Typophile :)\n\n"
    },
    {
      "time": "30 Dec 2007 — 12:12am",
      "content": "Technologies tend to coexist more often then they throttle each other to death.\n\nChristian, do you want to speculate as to a date?\n\n"
    },
    {
      "time": "30 Dec 2007 — 12:42am",
      "content": "I swear they said the same thing about the \"paperless office.\"\n\nSometimes you just gotta hold something in your hand.\n\n"
    },
    {
      "time": "30 Dec 2007 — 9:43am",
      "content": "Technologies usually don't go away completely, but their use tends to become more specialized as they are replaced. The paperless office is actually a good example. Sure we still use printers, and there is still paper around the office, but they are used very differently. Paper now tends to be very temporary. It is almost always a copy of something that already exists in digital form. It may be a handout for a meeting, or a note to be thrown away, but it's rare that people have binders and filing cabinets full of things they intend to keep. More often for that type of thing you hear \"can you send me a digital copy?\". What's more, that transition is far from over. Offices are still populated by \"digital immigrants\". The new generation of natives use the technologies very differently, and they certainly aren't printing out everything they read like the old folks.\n\nAnother good example of this would be handwriting itself. Whereas handwriting used to be used for everything, it was replaced in large part by printing. It was replaced further by typewriters and morse code. Computers, personal printers and email further relegated it to a niche purpose. Texting and t9 have even replaced it for notes passed under the desk in junior high school. Now it's rare that we use handwriting to communicate with anyone but ourselves, rarely over distances, and almost never archivally. Sometimes it serves a nostalgic or ceremonial purpose, like for handwritten thank you notes.\n\nInterestingly, the same thing happens with words as they are replaced by new ones: the old words take on more specialized meanings.\n\nAs for a date where printing will be gone from the face of the earth: probably never. As for a date where it started to fade, just look at the sales charts for paper newspapers, paperback books and annual report design, to name a few. Moving forward the act of stamping ink on paper will likely fill a niche purpose, at best for something useful or artistic, at worst for nostalgia alone. Unfortunately there will be typographic quality lost in the translation (ie that last 20%), especially at first.\n\n"
    },
    {
      "time": "30 Dec 2007 — 10:49am",
      "content": "Good old 201Clead201D users, how 201Cquaint201D.\n\n"
    },
    {
      "time": "30 Dec 2007 — 11:07am",
      "content": "Christian, I think there's no doubt that the mix is changing, with more going digital. How far it will go to my thinking depends partly on how good screens get. Have you seen the new Amazon 'Kindle' screen with text on it? I haven't, and I'm wondering if it really is 'digital paper.'\n\nWe print things out or buy print on paper when we want to read anything extended. And the preference for readers, probably based on physiology and psychology of reading is for small type--12 pt and under. That means to my thinking that screens won't substitute for paper until there are high resolution screens--at least 300 dpi,and maybe up to 1200. And then, I don't know. As Yogi Berra said, prediction is really hard, especially when it comes to the future :)\n\n"
    },
    {
      "time": "30 Dec 2007 — 12:57pm",
      "content": "\"InDesign will go away when printing goes away\"\n\nI don't think it has much to do with the medium. InDesign will go away when a proper typesetting tool replaces it. CSS is not it.\n\n"
    },
    {
      "time": "30 Dec 2007 — 11:15pm",
      "content": "\"Ah, they’re just hedging for the popular angle, something contentious to make people read it. Or maybe they’re on a bum steer. I wouldn’t take it too seriously.\"\n\nYou are completely wrong there. Håkon Lie seriously claims that such free fonts are \"good enough\" for general use, and has been working very hard to prevent the adoption of any web font scheme that would work with retail/commercial fonts.\n\nI'm a bit bemused by folks putting down Adobe-promoted standards relating to typography. I take it PostScript, Type 1 and now OpenType have not solved real problems and you didn't like them?\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "31 Dec 2007 — 1:20am",
      "content": "Christian, I don't think you have completely argued the notion of \"also\" away. You have made some great points however. And I don't disagree with them.\n\nStill lingering or malingering does go on. Vinyl sales are up in a big way....\n\nI also think we don't disagree so much as maybe differ over degree of certainty.\n\nAnd maybe we are thinking about different time scales as well. In 100 years I think we can't hope to imagine what's in store - I think thats the period I was arbitrarily thinking of for whatever reason. But where things will be in 20 years from now... I think you are describing that quite well.\n\nLong term though - I think that at polyform state of existence for text/letters in the far furure is the safest bet of all.\n\n"
    },
    {
      "time": "31 Dec 2007 — 6:49am",
      "content": "As to the original post, I fail to see the scandal. Forget all the rhetorics (20% vs 80%, death of InDesign), just stick to what he actually presented.\\*  \nThe presentation makes it clear that Mr Lie is not a typographer, see his selection of 'good' typefaces or the fact that he does not seem much interested in OpenType except for the fancier features. I do not even care since in the more fundamental issues he is pretty right: The HTML+CSS model is (or allows to be) quite strict in separating two independent domains which are, first, structured data, and second, (graphic or typographic) representation of these.\n\nI think that in the long run, typographers will need to think of design in a more structured and abstract way. Designing nice books or brochures manually and individually by placing frames on a virtual page and filling these with given texts or images, is one thing. It is another thing to 'design' design rules -- the actual design results from (automatically) merging data and design rules. This is nothing to be afraid of, it can help make the design process more efficient. And this does not necessarily result in a loss of quality: What did the most traditional book designers do? Define the design rules. See the beautiful sketches by Jan Tschichold or Max Caflisch.  \nWith this in mind, I consider ther HTML+CSS approach as pretty interesting. Another example is [DocScape](http://web.archive.org/web/20131022135107/http:/www.docscape.de/) (cannot find an English version). This system allows to program very complex design rules, and one command will merge these with texts and images from any database and generate a PDF of an entire catalog or book. Its developers claim that this is much different from scripting layouts in InDesign or XPress in that these fill fixed template pages or frames with content while in their system the layout by default is supposed to be programmed such that it can deal with texts and images of various length or size, e.g. using two columns instead of three.  \n'Defining design' rather than 'designing' requires that designers or typographers are able to think of design abstractly.\\*\\* And to make designers (myself included) feel comfortable with this it needs appropriate visually oriented tools. This is a particularly interesting question for which I have not seen solution. How would such a tool represent a layout, and allow designing it, if there is no 'content' yet? Would it be possible to create such a layout visually nevertheless -- and also _show_ which parts of the layout are fixed and which parts remain variable? In short, how to represent virtual representation of data?  \nNobody seems to have made an attempted to address this. Current solutions either force designers to fix text and image snippets on a digital page (PageMaker, XPress, InDesign), or require developers rather than designers (like LiveCycle, can anybody explain this to me in an afternoon?). There is nothing inbetween.\n\n\\*&nbsp;&nbsp;I think it was Mr Lie who made an interesting remark in the presentation: The actual typographic representation, which also includes things like hyphenation or optical margin alignment, is not up to CSS itself but to the browser or PDF generator.  \n\\*\\*&nbsp;&nbsp;For this reason, web designers and developers may easier adapt than print designers. Also I am not surprised that all these technologies, PrinceXML, but also AIR and WPF emerged from the web & UI design rather than the print world. My impression is that currently there are pretty exciting things under way, including the above-mentioned technologies. Many of these have the potential to change the way we think of design: By allowing to address document (or print) design, web design, UI design in the same 'language' they may help overcome the strict distinction of these three -- they have more in common than previous design tools (special tools for each of them) suggested. The _real_ distinction is between data and their representation. The same data can be represented in a book or on the screen, or these data may be opend up for manipulation, then the form of representation turns out to be a UI.)\n\nAs an aside, it is with more or less automatic design in mind that I think that fonts need to be spaced and kerned well enough that no or very little intervention by the typographer is required. And OpenType helps a lot with this.\n\nKarsten\n\n"
    },
    {
      "time": "31 Dec 2007 — 7:31am",
      "content": "\"Why use CSS for typesetting? Back Asswards.\"\n\nNot at all. That's the very point of CSS. No different than style sheets in your DTP apps.\n\n\"Amen. How much professional typography experience do these gentlemen actually have?\"\n\nHow much typographical experience do 90% of inDesign users have? ;o)\n\n\"I don’t think it has much to do with the medium. InDesign will go away when a proper typesetting tool replaces it. CSS is not it.\"\n\nCSS isn't a typesetting tool in and of itself. It's style markup language. Consider it like printers marks on the margins of a proof. Given that a lot of content is now being natively stored in XHTML and XML and the like, CSS seems like a perfectly logical extension. Now, whether or not Prince is 'the tool' is certainly debatable, but I certainly see CSS as the future. Rather than XPress styles, InDesign styles, Word Styles, we'd have one standard: CSS. If anything, and if the moons align, we might see InDesign eventually just use CSS natively within the application.\n\n\"I’m a bit bemused by folks putting down Adobe-promoted standards relating to typography.\"\n\nNothing wrong with [insert big software corporation] promoted standards. It's when they are also solely owned by said entity that some of us tend to start rooting for the open standard instead.\n\nAnd yea, I can't think of any Type-centric standards that Adobe has created that have been anything BUT a boon to the industry. I, personally, just have qualms about the Adobe vs. Microsoft issues as we go forward in trying to agree on standardization of content storage in general. If you're in a business where part of your requirements is to pump content out to the public at-large, then open HTML begins looking like the best solution. As it is now, one-click exporting from print documents into an easy to publish HTML format is still a bit of a dream for most DTP apps (though, admittedly, a big part of that is simply lack of application user training/knowledge).\n\nAs for calling these gentlemen out for a lack of type knowledge, I think that's valid...they are clearly more technology orientated and seem to be focused on a lot of university and scientific documentation (which is the origins of the web). But I don't think that invalidated their vision...if anything, it should be a call to arms to help them improve the product based on the needs of the professional typesetter/designer.\n\n\"Still lingering or malingering does go on. Vinyl sales are up in a big way....\"\n\nThis is maybe for an entirely different thread, but I find that point very interesting. Why is that? Clearly, part of that is the fact that it's a tangible item. Perhaps that's the appeal of Prince for some? It turns the intangible screen of HTML into a tangible book?\n\n"
    },
    {
      "time": "31 Dec 2007 — 8:09am",
      "content": "\"Vinyl sales are up in a big way....\"\n\n\"Perhaps that’s the appeal of Prince for some?\"\n\nPrince was always better on vinyl, purple vinyl in particular.\n\n"
    },
    {
      "time": "31 Dec 2007 — 8:10am",
      "content": "\"Prince was always better on vinyl, purple vinyl in particular.\"\n\nHa! Purple Rain was the first LP I ever owned. (I'm not sure if I'm proud or embarrassed of that fact...)\n\n"
    },
    {
      "time": "31 Dec 2007 — 11:03pm",
      "content": "I think the idea of separating content from presentation is very useful and has a huge potential for making information more accessible, but it's not always easy to draw the line between the two...\n\n ![](http://web.archive.org/web/20131022135107im_/http:/typophile.com/files/dada_3473.gif)\n  \n(Dada poster, 1923)\n\n ![](http://web.archive.org/web/20131022135107im_/http:/typophile.com/files/helvetica_3581.gif)\n  \n(Poster for a typesetting service, design by Jack Sommerford, 1979) \n"
    },
    {
      "time": "1 Jan 2008 — 4:41am",
      "content": "@Thomas: _You are completely wrong there. Håkon Lie seriously claims that such free fonts are “good enough” for general use, and has been working very hard to prevent the adoption of any web font scheme that would work with retail/commercial fonts._\n\nThanks I didn't know that. I know Ray Larabie's fonts rather well. His free products have no serious problems. But surely there's a taste issue here. Ray's old Larabiefonts catalog is permanently \"set\" in the late 1990's/2000 era geist. Dieter Steffmann's blackletters I love but have never seen under the hood, and again there is a style issue.\n\nAlso, by \"popular angle\" I was thinking of Manfred Klein's mysterious output, confusing him with Steffmann for a moment.\n\n@Thomas: _I’m a bit bemused by folks putting down Adobe-promoted standards relating to typography. I take it PostScript, Type 1 and now OpenType have not solved real problems and you didn’t like them?_\n\nI like what Adobe has given us and embrace it whole-heartedly. OpenType allows me to realize some fantastic creative ideas.\n\nW3C's concept of typography and typesetting I find compromised. Its lack of versatility and precision is offputting.\n\nj a m e s\n\n"
    },
    {
      "time": "1 Jan 2008 — 7:51pm",
      "content": "@James: No offense intended to either you or Ray, but I might disagree with you on the quality of his fonts as well. I guess it depends on what you mean by \"no serious problems.\" For my own needs and how I evaluate fonts, \\>95% of the time I'm holding it to a pretty high standard, and price is only a secondary consideration for me.\n\nI also assume that Ray is making a tradeoff between the quality of his fonts and the quantity/variety they produce (or the time he puts in per font, if you want to look at it that way).\n\nType designers in general are free to choose something other than the extreme \"quality\" end of that spectrum. Personally, I'm more interested in typeface quality than quantity, and that's what I'd like to see more of in the world as a whole.\n\nThis is all a bit of a diversion from the main topic. i think that the general idea that more and more content is going to be primarily Web based is true. The video in question sensationalizes it a bit, and there are questions about the speed of content migration to the Web. But the general idea is indisputable. I don't think that means either print or InDesign will go away any time soon, though.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "1 Jan 2008 — 8:22pm",
      "content": "Thomas, no offense taken. I only meant no serious technical problems in Larabiefonts. Aesthetics and typeface design is of course another matter.  \nI would love to see Ray make fewer fonts of more artful design, but what Ray does is what Ray does (Ray is as Ray does) and it isn't really my job to decide major content issues for him. I'm more a tweaker of his work and a coach, and a partner he bounces ideas off. He does the same for me.\n\n_I also assume that Ray is making a tradeoff between the quality of his fonts and the quantity/variety they produce (or the time he puts in per font, if you want to look at it that way)._\n\nThere is a tradeoff in the amount of time put into each font in order to maintain the level of quantity Ray turns out. But again it's a matter of what Ray does being what Ray does. It's a question of momentum and keeping the momentum going. He needs to because that's his nature. It has everything to do with continuous creative activity and very little to do with compromising quality in any sense.\n\n_The video in question sensationalizes it a bit..._\n\nYes, that's what I was getting at with, \"hedging for a poular angle\". It's not over until the obese lady sings.\n\nBack on topic...\n\nj a m e s\n\n"
    },
    {
      "time": "2 Jan 2008 — 12:19am",
      "content": "@Aluminum  \n<cite>If anything, and if the moons align, we might see InDesign eventually just use CSS natively within the application. </cite>\n\nTHAT's what I'm waiting for. An ideal program would be a combination of Dreamweaver and InDesign, able to organize and simplify stylesheets for complex typography ALA InDesign, but output well-specified valid XHTML + CSS.\n\nThat's the day that I am happy, where I can spend my time on the visual end of design, rather than on wondering why the padding on this or that DIV is bumping this column over and breaking under IE.\n\n"
    },
    {
      "time": "2 Jan 2008 — 6:18am",
      "content": "\"That’s the day that I am happy, where I can spend my time on the visual end of design, rather than on wondering why the padding on this or that DIV is bumping this column over and breaking under IE.\"\n\nAlas, InDesign supporting valid XHTML and CSS won't fix the issues with a particular browser.\n\nThe reason css isn't 'precise' is that it'd not designed to be. HTML + CSS is how one typically 'suggests' a visual presentation to the end user. It doesn't dictate it.\n\nThe appeal of an app like Prince or a CSS-enabled InDesign is that it would allow you to dictate a layout for that one particular medium...in this case, a PDF. You'd still have valid CSS and HTML that may or may not render exactly as you want in any one particular web browser, but at least you'd have the full control over the PDF you are creating. The valid and portable and semantic HTML+CSS is then just a bonus that makes it easy to slap onto the web.\n\n"
    },
    {
      "time": "2 Jan 2008 — 7:05am",
      "content": "\"CSS and HTML that may or may not render exactly as you want in any one particular web browser, but at least you’d have the full control over the PDF you are creating.\"\n\nThen why not use InDesign in the first place? :-o There are several other amuzing things about this thread.\n\n\"I take it PostScript, Type 1 and now OpenType have not solved real problems and you didn’t like them?\"\n\nThomas, choice in any of the three was not an issue, so WE LOVE 'EM, LOVE 'EM & LOVE 'EM! Do these 'standards' have the guts, balls and smarts to take on the dynamic networked low res typographic requirements of the planet? apparently not. No font format could, that window is now closed. Please proceed to the next window.\n\n\"Technologies tend to coexist more often then they throttle each other to death.\"\n\nMmmm, this may be true, more elsewhere than in software. One could make a strong case that the T1 and TT technologies throttled each other to death, in the bleak and blurry view of the web honchos at least.\n\nThen of course, what columns fill up with is far more important than the columns themselves. I mean...have shorter and/or justified lines of text ever made it easier to compose badly designed and/or poorly rendered type into 'good typography'? We've all seen fixed columns s'plode on impact when users have the audacity to pick their own type size.\n\nCheers!\n\n"
    },
    {
      "time": "2 Jan 2008 — 8:47am",
      "content": "_Håkon Lie seriously claims that such free fonts are “good enough” for general use, and has been working very hard to prevent the adoption of any web font scheme that would work with retail/commercial fonts._\n\nThat demonstrates how ignorant of typography and good typographic design this original author of the CSS spec, Lie, really is. What an impractical, anti-commercial agenda! Does he, or has he ever, worked as a designer for commerce, doing commercial design for money? Does he understand what drives professionalism and high standards in any design industry? Commercial design is about more than money, its about doing a good job and delivering value for the client's money. The CSS spec makes delivering high quality typesetting impractical. Stop wasting my time.\n\nShutting out retail/commercial fonts from adoption by any web font scheme is paranoid, nonsensical, unworkable. Come down out of your ivory tower, Håkon Lie. Throw away your bleeding heart prejudices and look at type from the standpoint of quality and the needs of professional users for quality fonts in web-based publishing. You want everybody to adopt your standards, yet you ply them with contempt and mistrust for the makers of high quality fonts.\n\nj a m e s\n\n"
    },
    {
      "time": "2 Jan 2008 — 9:56am",
      "content": "When I was talking about one thing killing another or not I was thinking of how old computer languages still exist and are quite alive because banks are still using & editing code that was written in the 60's. It's a minor % of the code that's written each year and yet it isn't dead.\n\nHowever David; your point about context/specificity determining the outcome is a hell of a good one. What may be true for say computer languages which rise & fall quickly but may harbor holdouts, may not be true for how documents are stored, or how bread is made or what happens to ID/text layout.\n\nBeing slightly contrary I keep thinking of \"Micro brew\" beer and how it has not only not been wiped out, but seems to be rising each year at the expense of mass market sudz.\n\n"
    },
    {
      "time": "2 Jan 2008 — 10:48am",
      "content": "\"That demonstrates how ignorant of typography and good typographic design this original author of the CSS spec, Lie, really is.\"\n\nDoes it? The CSS spec really has no care/interest in where a font comes from or the particular license it has. It's not biased one way or the other.\n\n\"The CSS spec makes delivering high quality typesetting impractical. Stop wasting my time.\"\n\nAre we talking about the CSS specification or Prince? The point of Prince is to make CSS practical for print based typesetting.\n\n\"Shutting out retail/commercial fonts from adoption by any web font scheme is paranoid, nonsensical, unworkable.\"\n\nAnd unless I missed something, nothing to do with CSS. CSS doesn't shut any particular font out.\n\nNow if we're talking about things like font embedding, well, isn't that the idea of the PDF output? Let the PDF take care of that portion.\n\n\"It’s a minor % of the code that’s written each year and yet it isn’t dead.\"\n\nI think we'd be surprised at how much code IS 'legacy' code each year. I had to use up a $50 Circuit City gift certificate yesterday. I was smiling at the fact that their check-out terminal, which is right next to the latest PCs with Vista, Wiis, and all sorts of other 'modern' technology was running a DOS-like terminal application that I'm sure has code circa 1980 in it still ;o)\n\nAnyways, I don't think Prince has anything to do with 'the end of print'. It's specifically designed FOR print.\n\n"
    }
  ]
}
