{
  "id": "40330",
  "title": "What do you think about 'John Bell Type'?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What do you think about ’John Bell Type’? And more specifically what do you think of this book: by Fred Anthoensen?\n\nSee also [http://typophile.com/node/30145](http://web.archive.org/web/20080106172826/http:/typophile.com/node/30145 \"http://typophile.com/node/30145\")\n\nThanks!\n\n [‹ KABK Type & Media Wiki?](http://web.archive.org/web/20080106172826/http:/typophile.com/node/40337 \"Go to previous forum topic\") [Phototype italics? ›](http://web.archive.org/web/20080106172826/http:/typophile.com/node/40317 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080106172826/http://typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 26.Dec.2007 4.43pm",
      "content": "Eben\n\nMonotype Bell is based on this face and I’ve recently had the opportunity to use it for two projects, the first was a laser-printed chapbook and the second a letterpress printed broadside.\n\nAs a digital face it is a bit thin for text work and needs to be thickened a tad if printed via offset or laser, and for letterpress the larger sizes need to be thinned out a bit but once a decent range of sizes/weights are constructed its a very fine face to work with. It has quite a bit of traditional funk to it and yet yields a fairly even page. The 3/4 figures are a god-send. Since it is based on the metal face or more likely the photocomp version of machine comp version, it does have the usual Monotype quirks in regard to letter fit but those can be adjusted easily enough.\n\nRichard Austin cut the Bell for S & C Stephenson and they have a resemblance to the Scotch Roman that he also cut for the William Miller foundry, whose specimens Matthew Carter used as the basis for his Miller Text, Wilson Greek, and Georgia. Of the William Miller letterforms, Carter commented that they had a “curvaceous ductus” that set them apart!\n\nIt has been suggested that Austin came up with the idea of the 3/4 figures that are often associated with the Scotch faces.\n\nGerald\n\n"
    }
  ]
}
