{
  "id": "4034",
  "title": "Which Swift is the best?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "For a project I am on, I would like to use the Swift from Gerard Unger. Now I saw that he has made two versions, one sold by Elsner & Flake and one by Linotype?   \nWhich one is the best?   \n   \nThank you very much,   \nNicolien\n\n",
  "author": "Nicolien",
  "time": "30 March, 2004 - 11:19pm",
  "uid": "2692",
  "comments": [
    {
      "time": " 30 March, 2004 - 11:25pm",
      "content": "From what I understand the improved version is only slightly better overall.   \n   \nhhp\n\n"
    },
    {
      "time": " 30 March, 2004 - 11:29pm",
      "content": "Hrant,   \n   \nThanks for your quick reaction.   \n   \nI just saw that Gerard Unger also has an version swift 2.0. Do you mean that version?   \nIt is anyway an bigger familie? But is it better?   \n   \nNicolien\n\n"
    },
    {
      "time": " 30 March, 2004 - 11:35pm",
      "content": "Yeah, I meant the 2.0 version. Anything that doesn't have that suffix is most probably the old version, which I think is the same no matter where you get it - but I could be wrong.   \n   \nhhp\n\n"
    },
    {
      "time": " 30 March, 2004 - 11:47pm",
      "content": "Thanks Hrant.   \n   \nCan you please advise me what I can do the best. Buy an postscript or truetype or open type (if it is available!   \n   \nNicolien\n\n"
    },
    {
      "time": " 31 March, 2004 - 10:01am",
      "content": "Swift will probably work better in PS, but it depends on what you're doing with it. For example, if it's hinted well, and you're using it on-screen, then TT might be better. An OT version would be good if Swift has OT features (and you app supports OT).   \n   \nhhp\n\n"
    },
    {
      "time": " 31 March, 2004 - 11:07am",
      "content": "I didn't realize there was a difference in the number of weights.   \n   \nThe fact that Unger is indeed a \"proven talent\" is certainly a positive, but wasn't he that when he made the original Swift? How much can you improve an already superb font without making drastic changes? And are individuals not susceptible to versionitis?   \n   \nhhp\n\n"
    },
    {
      "time": " 31 March, 2004 - 11:26am",
      "content": "_The fact that Unger is indeed a \"proven talent\" is certainly a positive, but wasn't he that when he made the original Swift? How much can you improve an already superb font without making drastic changes? And are individuals not susceptible to versionitis?_   \n   \nDid Gerard personally digitise or directly oversee the manufacture the original Swift? I doubt it. Swift 2.0, apart from the obvious benefit of the extension of the range of weights, might be likened to a 'director's cut': you're getting Swift the way the creator of Swift wants you to have it. This is not to say that some people might not be perfectly happy with the earlier version, or even prefer it. However, if I wanted Swift for a job, and the budget permitted, I would go for Gerard's version. Among other (non-drastic) changes, I believe the spacing is improved.\n\n"
    },
    {
      "time": " 31 March, 2004 - 1:09pm",
      "content": "\\> legiblity/character count tests   \n   \nWazzat?   \n   \nhhp\n\n"
    },
    {
      "time": " 31 March, 2004 - 1:17pm",
      "content": "Yves, is this comparison document available for viewing?   \n   \nBTW, did anybody mention that apparent size and apparent leading need to be normalized for any comparison of economy-versus-readability to really make sense?   \n   \nhhp\n\n"
    },
    {
      "time": " 31 March, 2004 - 2:20pm",
      "content": "The 2.0 version is he most complete and looks very good to me. I ordered it today. I have seen an readingtest from the site of Gerard Unger ( [http://www.gerardunger.com/fontstore/store-howto.html](http://web.archive.org/web/20051130223859/http:/www.gerardunger.com/fontstore/store-howto.html)) and it looks great.   \nAs Hrant says an PS version is in my case the best I think. I have been told that in mei this year the OT font is coming up but unfortunately I can't wait for that. The project is starting soon where I am working on.   \n   \nThanks everybody for thinking with me.   \n   \nNicolien\n\n"
    },
    {
      "time": " 31 March, 2004 - 2:54pm",
      "content": "\\>From what I understand the improved version is only slightly better overall.   \n   \nIn some way this is a great compliment! Gerard Unger Swift 1. 2. 3. 4. whatsoever how they are digitized are so good, that in any case you got already excellence in typeface design. :-)   \n   \n(not a joke, I truly think what I say)\n\n"
    },
    {
      "time": " 31 March, 2004 - 7:16pm",
      "content": "\\>How much can you improve an already superb font without making drastic changes?   \n   \nHere are a couple of other improved versions. The refinements in Minion Pro, compared to Minion, to me made a big difference, even though they are minute. The serifs are a little bit heavier and the round letters narrower.   \n   \nThe big Optima Nova project I think is wonderful. It really improved the weight of Optima for digital setting. I don't know about the other re-dos for Linotype, such as by Frutiger; it would be interesting to have somebody to do a survey of these 'second time around' efforts. My guess would be that they would be significant improvements.\n\n"
    },
    {
      "time": " 1 April, 2004 - 12:57am",
      "content": "Well, as designer of one of the Next, I can say that \"Next typefaces\" are real new fonts (with different designers in many cases) than a version 2.0 as we discuss here about Swift.\n\n"
    },
    {
      "time": " 1 April, 2004 - 9:06pm",
      "content": "Buy directly for Unger if you are able, he has been a overly friendly chap in my personal dealings.   \n   \nHildebrant.\n\n"
    }
  ]
}
