{
  "id": "40351",
  "title": "Arno Pro",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am confused! I am interested in Arno pro, now available through My Fonts.\n\nI went both to the Adobe website, as no Smallcaps font appeared in the My Fonts purchase options. On the Adobe web smallcaps does feature in the pdf they provide, under Latin Regular, but again, not in the actual purchase options, so I am totally confused!\n\nI am a WordPerfect user, and WP is not fully Unicode. Is the smallcaps buried somehere in  \n the Opentype format? And, if so, can I access it through WP\n\nHelp please!\n\nJohn\n\n",
  "author": "johnland",
  "time": "27 Dec 2007 — 5:31am",
  "uid": "9327",
  "comments": [
    {
      "time": "27 Dec 2007 — 6:22am",
      "content": "In the old days, fonts were 8-bit, so only 256 characters could be accesses at once. Moreover, most operating systems/applications programs had a hard-wired encoding vector (that is, what characters were available, & where they lived). OpenType is a 64 bit format, so some 65,000+ characters can \"live\" (be addressed) in a font.\n\nWhen you can only address 256 characters, and their \"names\" are hard wired into addresses, you have to make other arrangements for characters outside that 256 block. So, the small caps were put in a separate font, and given an incorrect name, but one the programs would recognize -- for example, the small \"A\" was put in the lower-case \"a\" spot. To humans, this seems like just a little fib, but it is every bit as much a lie as putting \"omacron\" in the \"odieresis\" spot.\n\nOpenType is mainly based on Unicode, but the characters do still have names -- PDF is name-based, for example, and OT documents heed to be exported to that format. So one OpenType technique is to give the small caps a name, but no Unicode index, then write a \"feature\" which switches them on -- that means they aren't changed, but the typesetting program knows to use small caps when they are switched on. That way, if you later extract an XML file from the original document, you still have the original ABC (or abc), rather than small caps.\n\nI'm told WordPerfect has its uses in preparing documents. My only encounter with it is when an author writes in WordPerfect & we have to convert his/her files for typesetting. What a nightmare. For other than basic Latin, WordPerfect uses its own fonts & own encoding vectors, i.e., to the rest of the world, \"tells lies.\"\n\nIf preparing a final document is all you are about, and WordPerfect meets your needs, stick with it. If your documents are a typescript that will have other uses, use a different word-processing program -- unless newer versions of WordPerfect have changed & I'm just unaware of it.\n\nThe old programs which had to get around the hard-wired encoding vectors found ways to do this, but those tricks also get in the way of other things -- including, I believe, fully using the newer OT fonts.\n\n"
    },
    {
      "time": "27 Dec 2007 — 6:59am",
      "content": "Arno Pro is Open Type with smallcaps included. As far as Wordperfect being able to access them it probably depends on which versions of Windows and Wordperfect you're using. You could find a free Open Type font to test your set up with at [http://www.philsfonts.com/freefont.html](http://web.archive.org/web/20150306061439/http:/www.philsfonts.com/freefont.html \"http://www.philsfonts.com/freefont.html\").\n\n"
    },
    {
      "time": "28 Dec 2007 — 5:30pm",
      "content": "If you look at the link [**Arno Pro Regular**](http://web.archive.org/web/20150306061439/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFont&code=ARNP10005010) on Adobe's site and click on the \"Glyph Complement\" PDF link, you can see that smallcaps are really there, not only for Latin but also for Greek and Cyrillic characters. Those smallcaps cannot be accessed directly; in order to get a smallcap \"a\" for instance, you need to type a lowercase \"a\" and let the opentype \"'smcp' Lowercase to Small Capitals lookup\" table do the job for you; you thus need an editor that knows how to use that table.\n\nIf your editor can't, what can you do? Well, I am also still using an \"old\" typesetting program, namely pdfLaTeX, which uses Type1 fonts. The way to take advantage of those nice new Opentype fonts in pdfLaTeX is to convert them to type1; Adobe allows doing it (many font providers do not). This is what I did (using [**FontForge**](http://web.archive.org/web/20150306061439/http:/fontforge.sourceforge.net/)) with Utopia so as to be able to use the \"expert\" option of the \"Fourier\" latex mathematical package that I like a lot.\n\nThe recipe is simple in principle but requires some programming ability. To get an SC font using a [**FontForge script**](http://web.archive.org/web/20150306061439/http:/fontforge.sourceforge.net/scripting.html), you clear all the lowercase characters that appear in the 'smcp' table and rename smallcaps with their associated lowercase character; If you also want text (old style) figures, you do the same with the 'onum' table. You then reencode the font and save it in the format you need.\n\nMichel\n\n"
    },
    {
      "time": "24 Sep 2010 — 5:48am",
      "content": "Sorry for bumping a three-year-old thread, but the WordPerfect internal engine is still stuck without true OpenType or Unicode support. A fellow can dream that one day they'll get their act together, but until then...\n\n"
    },
    {
      "time": "24 Sep 2010 — 7:23pm",
      "content": "I'm still waiting for Corel to get their act together with CorelDraw too.\n\n- Lex\n\n"
    }
  ]
}
