{
  "id": "40350",
  "title": "Booklet - which fonts go well together? Which font for continious text?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey everyone.\n\nMy communication design course at art university wants every student to create a booklet which is supposed to accompany an ad campaign for a chosen subject. Each and everyone of us needs to present our work early next year.\n\nI have NO idea for an effective ad campaign (newspapers) yet... ;-) However... I thought - why not start with my booklet then, as I did some profound research concerning my topic.\n\nI like the typefaces which were created for the relaunch of the UKs daily “The Guardian” a lot. I would have loved to choose them for lead-ins and headlines in my presentation as well. Another typeface I love (and which was also awarded by the TDC) is “Greta”. However, due to Christmas and other heavy expenses and my life as a poor design student, ;-) I had to settle for Lucida Std which I found on my Mac and thought of it as a good alternative for headlines and bigger sized lead-ins...\n\nI think about combining it with one of the following typefaces (for continuous text):  \nBliss Pro, Vista Sans or Dax... I’ve attached a screen shot of those three, with Vista Sans being my favorite at the moment, for the simple reason that I feel it might be more readable (in small print) although it’s “f” and “l” collide for example.\n\nWhat do you think - I feel the two typefaces might go well together, I’m no type specialist, so I might be completely wrong as well - that’s why I ask you guys :-)\n\nThanks a lot & happy new year,  \nJan\n\n ![](http://web.archive.org/web/20091003024000im_/http:/www.typophile.com/files/Picture3_4119.png)\n\n",
  "author": "<a href=\"/web/20091003024000/http://www.typophile.com/user/16031\" title=\"View user profile.\">AtomicGarden</a>",
  "time": "<br>",
  "uid": "16031",
  "comments": [
    {
      "time": " 27.Dec.2007 10.47am",
      "content": "\\> “f” and “l” collide\n\nThat’s not so much a collision. It’s a [ligature](http://web.archive.org/web/20091003024000/http:/www.typophile.com/wiki/ligature). You can turn it [off](http://web.archive.org/web/20091003024000/http:/www.fontshop.com/fonts/singles/emigre/vista_sans_book/?sample_text=fl%C3%BCchtet&sample_size=14&acs_p=1&acs_pt=24&acs=1) if you don’t like the effect.\n\n"
    }
  ]
}
