{
  "id": "40368",
  "title": "Logo design fee advice",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi, I need some advice on what to charge for a logo.\n\nCurrently, I work as a graphic designer/retoucher for a beauty products company and a couple of my fellow employees are branching out to create their own eco-friendly beauty/skincare products. Their idea is to make an affordable, yet high-quality \"green\" beauty product. They approached me to design their logo. Eventually, this may turn into a full-scale identity project where I would design the packaging, be involved with or take product photography, etc. For now they need a logo as part of their presentation to potential financial backers.\n\nIt's been a while since I've done freelance work, and even then it was primarly non-logo related- illustration, posters, CD covers, etc.- so I'm not too keen on what I should charge.\n\nI want to give them a fair price, make some money for myself, but at the same time not break their bank if their idea doesn't go anywhere.\n\nAny advice would be helpful. Thanks.\n\n",
  "author": "psychopomp",
  "time": "28 Dec 2007 — 12:19am",
  "uid": "3527",
  "comments": [
    {
      "time": "28 Dec 2007 — 2:06am",
      "content": "Are you going to charge in $'s, £'s or another currency? I'd say if you're in the UK (as a starter) and you want to build up a good working relationship with them for future work, maybe it's best to do a deal where you provide 3 logo ideas, based on what they're looking for, for maybe £100 - £150. If they have no idea what they're looking for, chances are no matter how good the logo you may design, it may well not be 'what they imagined', so I'd say it's important to try and get as much info from them as possible. If they can't give you an idea I'd say you'd have to then say that each additional design would have to be £50 a time unless they can then give you some idea of direction. It's quite realistic to claim that they'd be paying a lot more than this for other companies' services.  \nLogo/corporate ID can be quite lucrative work. You can see the fees that some online companies charge.\n\nHope that helps, but I'll just say that's how I'd approach it, although some others here may disagree with me.\n\n"
    },
    {
      "time": "28 Dec 2007 — 6:49am",
      "content": "Drop by a bookstore or Amazon and pick up the _Graphic Artist’s Guild Handbook of Pricing and Ethical Guidelines_, it gives a lot of detailed information on logo pricing.\n\nIf I were you I would avoid giving them a rock bottom rate just to establish a business relationship. Doing so devalues the entire design trade, but it would also put you in a situation where you are allowing friends to take advantage of you for next to no money, which is a good way to sour a friendship. If they really can’t afford a designer, do design work in exchange for a small stake in the business—50 Cent made hundreds of millions of dollars from plugging Vitamin Water that way!\n\n"
    },
    {
      "time": "28 Dec 2007 — 7:42am",
      "content": "Timely...I'm embarking on a pretty exciting frozen pizza project at the moment.  \nI charge $40/hour start to finish. I try to handle clients (which come via a generally friendly network) with the Jedi mastery of Obi Wan Kenobi: \"These aren't the droids you're looking for...\"; i.e. \"I am giving you what you want.\" And usually things go very smoothly. This also requires a good amount of good question asking up front, careful listening (best with beer), and common-sense problem solving. I deliver a very functional, better-than-not-designed-by-a-designer logo for anywhere from $100-$400. Some people think that's a lot, some people think it's too cheap. I serve a very small rural community. I'm sure it might be a completely different story for metropolitan folk, or if you intend to jockey for position on the world wide web.\n\n"
    },
    {
      "time": "28 Dec 2007 — 7:57am",
      "content": "You may note that the above mentioned GAG handbook suggests tiered pricing based on what the organization makes. I think you can look at friend deals differently, depending on what sort of friends you make. Sometimes I will negotiate a bit on price if they will follow me in choosing better materials.\n\n"
    },
    {
      "time": "28 Dec 2007 — 8:03am",
      "content": "Asking what random people on the internet charge isn't going to really help you in any way.\n\nThe way to figure out how much to charge is to first figure out what you'd need to charge if you were on your own full time doing this for a living. From there, you can adjust accordingly based on your situation, but without that baseline calculation, you're just throwing darts.\n\nThe question is:\n\ntotal cash inflow needed per year / # billable hours per year = your minimum hourly rate\n\nNote:\n\nYour total cash inflow includes your salary and ALL expenses (software, hardware, desks, furniture, electriciy, phone, internet, books, insurance, travel, education, fonts, etc, etc, etc)\n\nyour # billable hours per year is NOT the same as # hours you work per year. As a freelancer, a lot of those working hours will be non-billable. You might decide to work a 40 hour week, but odds are that only 20-30 of those hours are actually billable. Don't forget to calculate for vacation and sick time as well.\n\nOnce you do all that math, you'll find your baseline price. Then you can adjust accordingly based on factors like work load, the client, your expertise/skillset, etc.\n\n\"you want to build up a good working relationship with them for future work\"\n\nAgreed, but (IMHO) lowballing your first gig is NOT a good way to build that relationship. It sets unrealistic expectations and devalues your work--ESPECIALLY if these are friends, as both parties will, by default, tend to allow a lot to slip by that one would normally not tolerate in a business relationship.\n\n"
    },
    {
      "time": "28 Dec 2007 — 10:04am",
      "content": "I second koppa. The last 3 logos I did for small businesses were $350-$450 each. Canadian dollars.\n\n"
    },
    {
      "time": "28 Dec 2007 — 10:52am",
      "content": "I think Aluminum is quite correct. Additionally, if you do not have, or are not planning to have, a full-time design business to operate, then you really should worry less about the absolute market value of your work and more about finding a price that both you and they are happy with. They have a variety of options open to them — from doing it themselves, to having a nephew do it for free, to having the designer at work take it on as a side project, to hiring an established design firm or ad agency, etc. — just as you have other options for how you spend your free time. So if everybody is satisfied with the terms, the project is more likely to go well and the friendship more likely to survive it. Irrespective of what the market is charging, be fair to yourself and work out the price with them.  \nI would only add that the offer/promise of future work seems to be something that clients mention instinctively in order to press the price down. As a general rule, I would not allow it to influence the price you set for each individual project. You'll address their being a repeat customer if and when it happens.\n\n"
    },
    {
      "time": "28 Dec 2007 — 11:17am",
      "content": "\"You’ll address their being a repeat customer if and when it happens.\"\n\nYES. Excellent point! Stores don't give you price breaks for the potential future purchases you make. Instead, they give you discounts when those future purchases actually happen (ie, coupons, frequent buyer cards, annual rewards, etc.)\n\n"
    },
    {
      "time": "28 Dec 2007 — 11:55am",
      "content": "I think when you are too unsure of your prices you should set a price and then go up a little.\n\n"
    },
    {
      "time": "28 Dec 2007 — 3:03pm",
      "content": "Thanks for the responses.\n\nI guess I was looking for a range of numbers to refer to for a startup business. BTW, I'm located in New York City (expensive) and will keep that in mind with my fees.\n\nI agree that I should not lowball my fee. Most of my freelance experience, outside of interacting with other creatives, has been one where I give my fee and I get that dead stare into space look. It seems alot of people think anyone with Word can design a logo and owning Photoshop makes you a designer.\n\nLuckily, my co-workers understand the importance of design, know the quality I can give them and realize there is more to designing than a few clicks of the mouse. I'll refer to a recent edition of the Guild handbook, present my number with an expectation of possible negotation and go from there.\n\n"
    }
  ]
}
