{
  "id": "40418",
  "title": "Free Licence Commercial Fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am doing some university work into the commercial use of free license fonts and the limits of freedom allowed in their use. In particular I am interested in the fashion fonts.\n\nCan anyone give some examples of commercial free license fashion fonts and their freedom limits.\n\nThanks.\n\n [‹ a Van Dijck specimen sheet...](http://web.archive.org/web/20081029023952/http:/typophile.com/node/40646 \"Go to previous forum topic\") [Hey diddle, diddle, a Birthday for Biddle! ›](http://web.archive.org/web/20081029023952/http:/typophile.com/node/40596 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081029023952/http://typophile.com/user/25442\" title=\"View user profile.\">Dave Hilton</a>",
  "time": "<br>",
  "uid": "25442",
  "comments": [
    {
      "time": " 29.Dec.2007 7.40am",
      "content": "If you haven’t looked already, [this](http://web.archive.org/web/20081029023952/http:/typophile.com/node/14652) may be helpful.\n\n"
    },
    {
      "time": " 29.Dec.2007 4.29pm",
      "content": "Fashion fonts - what’s that? Also how do you define “free license?” You could argue that the freely licensed Microsoft Web Core Fonts are amongst the most widely used fonts on the planet. More recently the DejaVu (AKA Bitstream Prima or Bitstream Vera) fonts have found their way into many devices where the makers have wanted to avoid paying license fees. Gentium may have been used in a few places, but the lack of available styles has prevented serious commercial exploitation.\n\n"
    },
    {
      "time": " 31.Dec.2007 9.00am",
      "content": "Fashion fonts are fonts which commercial fashion businesses use in all their marketing and communications. For example, in their promotion literature such as on their websites, posters, leaflets, etc. For some fashion businesses the font is incorporated into their logo such as Chanel or Calvin Klein. I would assume that Chanel and Calvin Klein have their fonts specially designed for them. However are there any similar businesses who use free license fonts and if so what other free license fonts are there.\n\nI would define a commercial “free license” as the permission to use a particular font by a business without any restrictions at all. But just as with software various conditions on use may exist.\n\n"
    },
    {
      "time": " 31.Dec.2007 9.29am",
      "content": "“Free” is a loaded term in English, having several meanings. It can mean something provided at no cost, something that can be used without limitation, or a number of other things. Seeing the terms “free” and “commercial” next to each other causes cognitive dissonance.\n\nWhat you’re describing is what most would term a “site” license or in larger applications an “enterprise” license. Such a license allows a piece of software to be used at any device in a location or throughout an entire corporation (freely), respectively, without _additional_ charge after the initial license is paid (not free). This may be time-limited, depending on the terms of the license.\n\nFonts specified for corporate identity integration are often bought on enterprise license terms (or at least they should be).\n\nSometimes there is an exclusivity agreement as part of an enterprise license, especially in the case of custom fonts.\n\n"
    },
    {
      "time": " 31.Dec.2007 9.38am",
      "content": "Yep, site-license rights are typically very similar to those found in end-user license agreements - but with an unlimited or effectively unlimited number of users - limits may include not posting the font on a Web server, limited modification and embedding rights - just as you’d find in a typical EULA. Of course with enough money you can loosen some of these restrictions. The cost of custom type is often comparable to the cost of broad licenses to some fonts.\n\n"
    },
    {
      "time": " 2.Jan.2008 9.59am",
      "content": "I’m just curious, why are you particularly interested in fonts used by commercial fashion businesses and what exactly are you researching?\n\n"
    },
    {
      "time": " 8.Jan.2008 10.23am",
      "content": "So if we take the case of legal free fonts, as available from various websites, what license do they operate under.\n\n"
    },
    {
      "time": " 8.Jan.2008 10.25am",
      "content": "There isn’t just one general license. It is the responsibility of each foundry, should they choose to do so (or hope to retain some rights to their own work) to include the EULA.\n\n"
    },
    {
      "time": " 8.Jan.2008 11.05am",
      "content": "If you are not able to accurately source a particular “free” font, how can you check to see if it is legally “free”.\n\n"
    },
    {
      "time": " 8.Jan.2008 11.09am",
      "content": "?\n\n"
    },
    {
      "time": " 8.Jan.2008 11.19am",
      "content": "You can ask here. :^)\n\n"
    }
  ]
}
