{
  "id": "40424",
  "title": "logo for national school program",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I would love some input on this logo i've been working on for our organization... I can't seem to get anything more than \"It's great\" or \"I like it\" out of my co-workers (none of them are designers).\n\nHere is the scenario:  \nWe are America's largest high school assembly program and we speak to millions of people every year. They have not had a designer until they brought me on in july of 2007. You can see the design mess I inherited here: [Rachel's Challenge](http://web.archive.org/web/20131023204720/http:/www.rachelschallenge.com/). I am currently working on changing things, most of the work I've done is marketing collateral, and I am trying to convince them of the need for them to have a unified brand, to update the logo and website. The problem is that they aren't buying it. Any talking points that would be helpful to convince them would be greatly appreciated.\n\nThis is the logo for a new program they are launching:\n\n ![](http://web.archive.org/web/20131023204720im_/http:/typophile.com/files/legacy_4322.jpg)\n\nI wanted it to be very simple and appealing... It needs to be kind of trendy while still appealing to educators :) It comes in two parts. the actual name, and then the \"Power of One\" graphic. These are actually normally not together as they are here, the \"power of one\" is probably going to be used more frequently.\n\nThe type is Avant Garde.\n\nThoughts?\n\nThank You all in advance!\n\n",
  "author": "rickgingrich",
  "time": "29 Dec 2007 — 12:19pm",
  "uid": "20698",
  "comments": [
    {
      "time": "29 Dec 2007 — 2:43pm",
      "content": "It would appear as if Rachel is design-challenged!  \nd~\n\n"
    },
    {
      "time": "29 Dec 2007 — 11:38pm",
      "content": "Here is what I think as a design graphic student ;)\n\nAvant Garde is a very-seen typo. And, alone (without \"The Power Of One\"), maybe the \"Rachel's legacy\" may be not as stronger as it could be!\n\nI think the written part of the logo, The Power Of One, is quite powerful and efficient. It even may be too powerful for logo part \"Rachel's Legacy\" shown here.\n\nThe graphic part of the logo (the shape next to the word LEGACY) is confuse for me. I'm not convinced what exactly it is when I see it, even if I look with some attention. Is it a feather?\n\nIf I understand, Rachel's Legacy is an organization named after the first victim of the crime at Columbine High School on April 20, 1999. I would care about not using icons of violence and weapons. Maybe the O of \"ONE\" with a star in it may refer to some roundel or a target. I would even think about that some people may think that the feather-like shape next to the word LEGACY is a blood stain... :S\n\nBut I don't know, I'm not a designer yet, I'm just a student... :(\n\n-----------------:  \nJean Chouinard\n\n"
    },
    {
      "time": "30 Dec 2007 — 1:31am",
      "content": "Jean, I had the same thoughts as you. The symbol does look like it's dripping blood and the O is too militant.\n\nSharon\n\n"
    },
    {
      "time": "30 Dec 2007 — 1:24pm",
      "content": "Thanks for the responses! They help a lot...\n\nI was worried that is was a little... harsh. Now that I think about it, I have no idea why I chose RED of all colors :) I think that if I changed the color to a green or blue that would soften it up alot... I also have some other devices that can go in the \"O\"--for lack of a better term, the star does look somewhat...communist.\n\nAs far as the \"feather\" thing goes... I don't have a great reason for it to be there... It is an allusion to heraldry, something older (legacy). It is also there to soften up the look a bit, because Avant Garde is a bit hard.\n\nI have to walk a fine line, making it appeal to educators who actually bring the program into schools, and still making it appeal to students across a wide range of school cliques...\n\nThe powers that be in our organization haven't told me outright, but I have a sneaking suspicion that they would like me to use Comic Sans... ahhhh.\n\nI will repost when I've made revisions...\n\n"
    },
    {
      "time": "30 Dec 2007 — 4:38pm",
      "content": "If the Power of One is going to be used more frequently sans Rachel, why is all the emphasis on Rachel.\n\nMaybe put Rachel's Legacy as a tagline rather then the star of the show.\n\n"
    },
    {
      "time": "1 Jan 2008 — 1:54pm",
      "content": "To \"POWERIZE\" \"The Power Of One\", could use the same icon for the logo and for the \"One\"...\n\n------------------------------------------------------:  \nJean Chouinard (formerly emerjean on Typophile)\n\n"
    },
    {
      "time": "1 Jan 2008 — 11:43am",
      "content": "Ok. I'd ask what's the logo and what is the punch line? Because it looks like you can't really decide what is the mark. Is it Rachel's Legacy or is it The power of one?\n\nI don't like double stars and duality of texts...\n\nBut I welcome colour change.\n\n"
    },
    {
      "time": "1 Jan 2008 — 12:08pm",
      "content": "I agree with the colour change suggestion discussed previously, but I find there is still something very militant about it, even with the colour change(green, i think is not a good choice if you want to avoid military) The star graphic and the choice of type I think need more thought. I agree with Robert about the logo and tagline too.\n\n"
    },
    {
      "time": "2 Jan 2008 — 9:50am",
      "content": "OK, here is a revised version... as you can see, I've made quite a few changes...\n\nI've used the \"Acorn\" device before for some other projects, so I reworked it to fit into this one too...\n\n ![](http://web.archive.org/web/20131023204720im_/http:/typophile.com/files/uno_6307.jpg)\n\nThoughts?\n\nnote: I separated the two parts more because they really won't be used together much at all.\n\n"
    },
    {
      "time": "2 Jan 2008 — 1:19pm",
      "content": "So are these two separate logos now?\n\n"
    },
    {
      "time": "2 Jan 2008 — 10:19pm",
      "content": "Hmmm, no delete button.\n\n"
    },
    {
      "time": "4 Jan 2008 — 4:01pm",
      "content": "\"So are these two separate logos now?\"\n\nAlways have been... read back:\n\n\"It comes in two parts. the actual name, and then the “Power of One” graphic. These are actually normally not together as they are here, the “power of one” is probably going to be used more frequently.\"\n\n------------------------------------------------------:  \nJean Chouinard (formerly emerjean on Typophile)\n\n"
    }
  ]
}
