{
  "id": "40422",
  "title": "Lettering in the environment",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I posted a thread a little while ago asking for examples I could use for my dissertation on the use of [typography in architecture](http://web.archive.org/web/20071231215241/http:/typophile.com/node/37424). Everything that was said in that thread was really useful and interesting, but my tutor’s now suggested that I shift my focus a little so I’m back to appeal for more ideas!\n\nBasically my tutor feels that simple lettering on buildings has been done before, so he’s now suggested looking at lettering in the environment where the structure of the text influences the structure of the building/installation. I think this is a good idea in principle but I’m just not sure how many good examples of this I could actually find. The best so far is probably [Flock of words](http://web.archive.org/www.tern.org.uk/art-flockofwords). Other examples I’ve been looking at include the Vietnam Veterans Memorial, the Little Sparta garden by Ian Hamilton Finlay and the work of Joan Brossa.\n\nI don’t really think many of these derive their structure from the structure of the text, more that the user’s experience of the lettering is important to the way it’s understood i.e. rather than taking it all in in one go you walk through it and experience it in a particular way that’s relevant to the text. This in itself is probably an idea that could be developed further and I might well end up going with this instead.\n\nTo be honest I’m feeling a bit out of my depth, it’s getting a bit ’arty’ and conceptual and I’d really appreciate any ideas or examples that might be able to help me out! Anything near London would be a plus in terms of visiting the site itself.\n\nThanks.\n\n [‹ [site] etemallycool.net](http://web.archive.org/web/20071231215241/http:/typophile.com/node/40441 \"Go to previous forum topic\") [are there such things as typefaces with numeral ligatures? ›](http://web.archive.org/web/20071231215241/http:/typophile.com/node/40401 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071231215241/http://typophile.com/user/21970\" title=\"View user profile.\">megmog</a>",
  "time": "<br>",
  "uid": "21970",
  "comments": [
    {
      "time": " 29.Dec.2007 10.12am",
      "content": "[This](http://web.archive.org/web/20071231215241/http:/www.designboom.com/weblog/read.php?CATEGORY_PK=&TOPIC_PK=1425), while not exactly what you’re looking for, may be of some interest.\n\n"
    },
    {
      "time": " 29.Dec.2007 10.33am",
      "content": "take a look at [Legible City](http://web.archive.org/web/20071231215241/http:/www.jeffrey-shaw.net/html_main/show_work.php3?record_id=83)\n\n“In The Legible City the visitor is able to ride a stationary bicycle through a simulated representation of a city that is constituted by computer-generated three-dimensional letters that form words and sentences along the sides of the streets.”\n\n-=®=-\n\n"
    },
    {
      "time": " 29.Dec.2007 11.28am",
      "content": "The structure of the text influencing the structure of the building is not likely to yield much in the way of suitable examples. Perhaps we type-centric folks might be fond of such an idea but I doubt if you will find many architects with the same leanings. War memorials are the only structures that come to me as well or similar things like the Holocaust Museum here in Washington. There are numerous memorials which have lists of names or famous words inscribed (Lincoln Memorial, etc.). You will probably find several in the UK. I recall Dan Reynolds photographing some WWII sites over there. You might find some more ancient ones from the Roman Empire as well. Look up Armando Petrucci’s book “Public Lettering” for some historic sites.\n\nChrisL\n\n"
    },
    {
      "time": " 29.Dec.2007 12.45pm",
      "content": "For historical material you might want to look at the Italian late-Futurist Fortunato Depero.\n\n ![](http://web.archive.org/web/20071231215241im_/http:/typophile.com/files/depero_6233.jpg)\n\n"
    },
    {
      "time": " 29.Dec.2007 11.04pm",
      "content": "Floor plans are known as letter shapes. ’L’, ’H’, ’I’, etc., each have their unique architectural attributes. Speaking of which, have seen this... [http://www.geogreeting.com/main.html](http://web.archive.org/web/20071231215241/http:/www.geogreeting.com/main.html \"http://www.geogreeting.com/main.html\") ?\n\n ![](http://web.archive.org/web/20071231215241im_/http:/typophile.com/files/TypophileFloorPlan_6680.jpg)\n\n"
    }
  ]
}
