{
  "id": "4043",
  "title": "(x) Athletic shirt font-distressed",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Need help please finding athletic shirt type font. blocky Slab serif scanned from an abercrombie tshirt.   \n   \nThe font is distressed, but if not available distressed, I will try to work around that.   \n   \nThanks for your help   \n   \nSusan\n\n",
  "author": "<a href=\"/web/20120113110540/http://typophile.com/user/1203\" title=\"View user profile.\">anonymous</a>",
  "time": "<br>",
  "uid": "1203",
  "comments": [
    {
      "time": "",
      "content": "Distressed patterns are usually created by overlaying   \na pattern on your final design. If you're working in   \n FreeHand, for example, you import a bitmap or   \n greyscale tiff, make it transparent and voila, you're   \n distressed.   \n   \nHere's a link to a few distressed files:   \n [http://www.screenprinters.net/downloads/](http://web.archive.org/web/20120113110540/http:/www.screenprinters.net/downloads/)   \n(scroll down about 1/2 or 3/4 of the way down   \nthe page.)\n\n"
    },
    {
      "time": "",
      "content": "I think I got exactly the answers you need. The fonts you are looking for are often overlooked because they are just so common and not considered \"high design\" anyway, here is my list (I design athletic apparel):   \n   \nSlab Serif   \n   \nAthletic (cheap looking....very block like) Be sure to space this one manually)   \nCollegiate (complicated outlined font)   \n   \nThe following are thinner and almost identical (I use Yearbook the most)   \nIvy League: the only one without the \"middle V\" on the \"M\" touching the baseline (this is great for designs with outlines or strokes as the outline won't descend beneath the baseline)   \nPrincetown   \nYearbook   \nCollege   \nLetterman (roughened version)   \n   \nSans Serif:   \nITC Machine (I use this one a lot)   \nITC Flat Iron   \n   \nRelated, but not exactly athletic:   \n   \nCity   \nAachen   \n   \nFor scripts, I recommend:   \n   \nFormal   \nBrush Script is the more common script   \n   \nObscure, but worth it:   \nHoboken High (two faces, serif and non-serif; can be found at lineto.com: expensive)   \n   \nThis is about all I know in terms of these fonts. There could be more, but this is what I use.   \n   \nIf you need anymore help, email me [Kmond@hotmail.com](mailto:Kmond@hotmail.com). Put something in the subject that let's me know it's not spam\n\n"
    }
  ]
}
