{
  "id": "40438",
  "title": "1st typeface",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I'm very new to typography and this is my 1st attempt at creating a font so far i have only designed lowercase, feedback is greatly appreciated as I need constructive criticism, as I'm sure a lot is wrong with it, also i was wondering what are the best ways and programs to use I just used illustrator using guides and the grid i was wondering if theres a better way go about creating a font and getting things like contrast accurate other than using guides and grids.\n\nthanks\n\nJohn.\n\n| Attachment | Size |\n| --- | --- |\n| [tyfacelower.pdf](http://web.archive.org/web/20150417083029/http:/typophile.com/files/tyfacelower.pdf) | 214.33 KB |\n\n",
  "author": "JBurgess",
  "time": "30 Dec 2007 — 10:52am",
  "uid": "25332",
  "comments": [
    {
      "time": "30 Dec 2007 — 12:42pm",
      "content": "Do you have any typeface model you would like to follow and analyze ?  \nHow many types of serif would you like to put in one face ?  \nSkill in the digital age is confused with mastery of digital tools, masking the importance of understanding materials and mastering the elements of form.\n\n"
    },
    {
      "time": "5 Feb 2008 — 2:54am",
      "content": "The profusion of seemingly incompatible serif approaches is a bit distracting, yes. And what's with the weird angle of stress on the \"o\" - it seems like it's from a different typeface, as the same angle of stress isn't present in any other letter.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "6 Feb 2008 — 11:53am",
      "content": "Hi\n\ntotally agreee with tomas here, as you know typography comes from the pen, ductus is very important. An exercise that might help you to understand a little more about typography is to try and trace the letterforms of your type with a pen. Is very hard too! hehe\n\nAnyways i'll give my humble opinnion:\n\n- For the regular version it seems too bold  \n- The eye of the \"g\" is a little small and the beggining of the tail is too bold  \n- The \"i\" and \"j\" accents are small. They should be a little more wide than the stem  \n- The \"s\" needs more work (is a tough one)  \n- Intresting \"t\"  \n- x needs optical adjusment, it seems to \"fall\" to the right  \n- You managed to make a sistem with constants and variables, thats tough for first timers! :)\n\nHope to have helped a little!\n\nFerch\n\nPS: Is coming relly good, my first proyects where horrible compared to yours :)\n\n[Tipografía-Montevideo](http://web.archive.org/web/20150417083029/http:/www.tipografia-montevideo.info/)\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:22pm",
      "content": "Neither the r nor the c have serifs on a curve which is highly similar to what you use on the s, which does have a serif.\n\nThe serif on the k is to long, almost making a triangle.\n\n"
    },
    {
      "time": "7 Feb 2008 — 10:50pm",
      "content": "Well, that inconsistency in particular is present in a large number--maybe the majority--of serif fonts. However, this font does have some other issues. My first-slash advice is to make all the hairlines the same width, and all the broad strokes the same width. That will make it look more professional, and make it easier to address the smaller issues.\n\n"
    }
  ]
}
