{
  "id": "40448",
  "title": "Help: understanding dpi (or lpi) of newspapers",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi,\n\nWhat is the approx. resolution of type printed in a newspaper? I have done quite a bit of searching, and all I can work out is that most newspapers are printed offset at 100 lpi. Some articles I've read equate this to 150-300 dpi and others to 600 dpi or more.\n\nI suppose a better question would be: to simulate newspaper resolution what dpi should I set my laser printer to?\n\nThank you,  \nRyan\n\n",
  "author": "RyanW",
  "time": "31 Dec 2007 — 7:08am",
  "uid": "25465",
  "comments": [
    {
      "time": "31 Dec 2007 — 7:18am",
      "content": "newspapers are quite varied these days in terms of paper stock and print quality. Less important than the resolution is the paper stock. Most newsprint (traditionally, at least) tends to be rather absorbent and hence, you end up with a bit of ink bleed that you want to take into consideration. A laser printer won't necessarily emulate that for you. You could go with an inkjet and some crappy paper and trial and error.\n\n"
    },
    {
      "time": "31 Dec 2007 — 8:53am",
      "content": "Ink total is important here, Magazines are usually 280% (shadow areas with a combined CMYK percentages,for instance 80%C, 70%M, 70%Y, 70%K=290%total ink, a little high for a magazine, but would still work), while newsprint is 240%. You have to setup a special CMYK in Photoshop color settings custom cmyk 240% ink total. You can have the LPI set correctly, but if there is too much ink going on the paper M U D. I think on a laser printer it would look light, but the end result would look good.\n\nDo you have a photo that has been printed on newsprint? I would then try to match the laser printer tor the printed piece.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "31 Dec 2007 — 9:04am",
      "content": "The lpi number usually refers to the halftone screen pitch used for photos and graphic tones. It has to be fine enough to blend visually while coarse enough to produce a sufficiently broad range of dot sizes (and thereby, gamut of tones) given the resolution of the imagesetter, compensated for the gain properties of the paper, ink, and press. Most such imagesetters run at 1200 dpi or higher.\n\n100 lpi tone sounds a bit high for newspaper, but a well maintained offset press with the more modern smoother newsprint might be able to handle it.\n\nOn a laser printer you usually have to use an even coarser halftone screen (60-80 lpi) due to the cohesive properties of the electrostatic toner. You may only be able to produce tones from 20 to 80 % before they blow out to white or gain to solid black, respectively.\n\nStill, test it at various settings. Make a test image with stepped tone and smooth gradient bars and see what comes out best at different pitches.\n\n"
    },
    {
      "time": "2 Jan 2008 — 7:15am",
      "content": "An additional issue in newspaper output is that the editorial staffs usually inhabit expensive downtown office space and the production and manufacturing plants are on cheaper ground far outside of town, sometimes across the country. This means the final pages are often scanned at 600 dpi and sent by secure network to the plant. If one reads the NY Times, one can find instant undesired multiple masters where the buffer fills up in this process squeezing and then stretching a thin column of the whole page.\n\nCheers!\n\n"
    },
    {
      "time": "4 Jan 2008 — 12:11pm",
      "content": "Newspaper printing is grey ink on grey paper, whereas laser toner is very black.  \nYou can laser print onto newsprint paper, which helps, as does the \"spread\" of laser printing, which is a bit like the large amount of press gain in newspaper printing.\n\nIf you're serious about this, I would suggest finding a newspaper which uses a commercially available font (Utopia is quite popular), and experimenting, trying to create as close a facsimile as possible of a particular page or column.\n\ndpi and lpi have nothing to do with this--they are really only relevant for halftones, not type.\n\n"
    },
    {
      "time": "4 Jan 2008 — 6:30pm",
      "content": "Newspapers I'm familiar with print with a line screen of 85 lpi to 105 lpi for halftones, which requires a digital image from 170 to 210 ppi. I find my 600 dpi LaserWriter generates both text and halftones that are a reasonable facsimile for a printed newspaper, though looking a little crisper because my paper is whiter than newsprint.\n\n"
    },
    {
      "time": "5 Jan 2008 — 1:41am",
      "content": "Thank you all for your help. It looks like I have some experimenting to do.\n\nRyan.\n\n"
    },
    {
      "time": "5 Jan 2008 — 7:41am",
      "content": "_dpi and lpi have nothing to do with this—they are really only relevant for halftones, not type._\n\nAbsolutely. Nick is right.\n\n"
    },
    {
      "time": "1 Feb 2008 — 3:36pm",
      "content": "I'm having trouble finding instructions on setting the lpi in Photoshop (CS3). Does anyone know how or if this can be done? I thought I set the line screen back in version 5 or 6, but it was so long ago that I can't remember. Thanks!\n\n"
    },
    {
      "time": "10 Feb 2008 — 2:12am",
      "content": "Electronic Pre-Press 101:\n\n`Dots per inch (DPI) x2 = Linescreen (LPI)`\n\nand (basically)\n\n`DPI = Pixels per inch (PPI) `\n\nWhy are most scanned images recommended to be 300 PPI? Because the final output for a magazine is typically 150 LPI, give or take. 100 LPI would be really heavy for newsprint, since the dot gain would basically wipe out any of the benefit of having the higher res. Unless, as was mentioned, really nice newsprint paper were being used.\n\nBut linescreen is not something that we as the designer needs to worry about, except for getting the proper resolution of bitmap images.\n\n"
    },
    {
      "time": "10 Feb 2008 — 8:52am",
      "content": "That should be DPI = LPI x 2, as in your example: scan at 300 dpi for printing at 150 lpi.\n\nThe linescreen is useful to know for other design stuff too - like how much you enlarge/crop in scanning, for example, may depend on how sharp an image you expect your printers to produce. But the general point is very true, that the linescreen is something done by the person operating the imagesetter or platesetter, not the designer.\n\n"
    },
    {
      "time": "10 Feb 2008 — 9:02am",
      "content": "Oh shoot, did I get it sdrawkcab? No wonder I failed Electronic Pre-Press 101 ;)\n\n"
    }
  ]
}
