{
  "id": "4044",
  "title": "Selective Ignorance of Kerns",
  "forum": "Build",
  "tags": [

  ],
  "content": "I've noticed that certain apps ignore certain kerning pairs, and there doesn't seem to be much rhyme or reason to it. For example, Photoshop doesn't apply kerns involving the trademark or the hyphen (although it does kern the emdash), while Word is pretty good except a negative kern of 250 is turned into -125 for my emdash-emdash sequence! I assume InDesign for example doesn't pull any such stunts, but since fonts can be used in any app I'm wondering if:   \n1) There are lists of ignored pairs somewhere, and/or some formal rationale.   \n2) There's a work-around, like maybe using Unicode?   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "31 March, 2004 - 11:15am",
  "uid": "1250",
  "comments": [
    {
      "time": " 31 March, 2004 - 4:20pm",
      "content": "Assuming it's OpenType or TrueType what does Font Validator think of the font? A recent font we tested had this error reported by FontVal...   \n   \nKern   \nE1610   \n The kerning value is invalid   \n kern pair[174]: left id = 696, right id = 812, value = -30056   \n   \nPerhaps Word has a max value you're running into.   \n   \nSi\n\n"
    },
    {
      "time": " 31 March, 2004 - 4:31pm",
      "content": "Yes, it's TT.   \n   \n\\> Font Validator   \n   \nOh, I'll try that.   \nWhere do I get it again?   \n   \n\\> E1610   \n\\> The kerning value is invalid   \n\\> kern pair[174]: left id = 696, right id = 812, value = -30056   \n   \nHow does one read that?   \n   \nBTW, guess what: I just tried to reproduce the problem, but couldn't... :-/   \n   \nSo assuming that was a fluke and Word doesn't ignore any kerns after all (at least not when it's in a good mood), there's still the issue of Photoshop, and maybe other apps too, like Flash. Is there a list of characters whose kerns are ignored in what app?   \n   \nhhp\n\n"
    },
    {
      "time": " 31 March, 2004 - 6:30pm",
      "content": "Hi,   \n   \nOff-list someone has reported that there seems to be a more serious problem with Word's use of FL generated kern tables. We're looking into it.   \n   \nFontVal - [http://www.microsoft.com/typography/developers/validator/default.htm](http://web.archive.org/web/20051111030358/http:/www.microsoft.com/typography/developers/validator/default.htm)   \n   \nCheers, Si\n\n"
    },
    {
      "time": " 2 April, 2004 - 2:45am",
      "content": "Can i novice ask what this Font Validor is to be used for? Just downloaded and testet a random opentype, got a xml and xsl file, but what is this to be used for?   \n   \nMaybe a stupid question.....\n\n"
    },
    {
      "time": " 13 April, 2004 - 9:39am",
      "content": "I am a beginning FontLab user, and haven't spent too much time kerning the typeface I'm working on, but even the \"automatic\" kerning is lost in Freehand MX. Specifically, the S always overlaps an E or a U that follows it. What I find strange is that this doesn't happen in Flash (or any other apps I use). It would seem like all the Macromedia programs would handle type similarly, or that between the two programs, Freehand would have better kerning.\n\n"
    }
  ]
}
