{
  "id": "40443",
  "title": "Student typeface : Calling for feedback",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello all,\n\nI had started [a thread](http://web.archive.org/web/20131012201647/http:/typophile.com/node/40264) few days back but I didn't get enough feedback and now it seems that it has lost completely. Sorry for creating this another thread.\n\nSince last couple of weeks I have been working on the various weights of my typeface called Absans. At the moment Absans has 4 weights, i.e. Hairline, Regular, Bold and Ultra Black. I had never designed an Ultra black typeface before and also this was the first time I did a hairline version too.\n\nPlease have a look at the attached designs and let me know what you think. I really need your master feedback to carry this design furhter.\n\nThanks in Advance  \nSatya\n\n",
  "author": "satya",
  "time": "30 Dec 2007 — 4:08pm",
  "uid": "14032",
  "comments": [
    {
      "time": "30 Dec 2007 — 4:31pm",
      "content": "A sample image:\n\n ![](http://web.archive.org/web/20131012201647im_/http:/typophile.com/files/sample_5716.jpg)\n\n"
    },
    {
      "time": "31 Dec 2007 — 3:28am",
      "content": "I wonder if it would benefit from having two versions- a display one with the embellishments, and a text one for smaller sizes?\n\nI think the c is still falling backwards slightly.  \nI like the K/k for regular, but it seems slightly odd to have a different variation for each weight  \nI like the G, but in regular, the spur seems a bit thin\n\nalso, I love the &\n\n-\n\n[zerotwonine](http://web.archive.org/web/20131012201647/http:/www.zerotwonine.co.uk/)\n\n"
    },
    {
      "time": "31 Dec 2007 — 7:37am",
      "content": "Nice to see your typeface coming alive Satya :) It has a nice feeling I think.\n\nI saw a few things:\n\nW, w could be narrower, now they are like two V, v put together. Try to narrow the angle on them, I think that would be better. And perhaps also push the joining bottoms where the stems meet a little bit to the outside. This is mostly visible on light and regular.  \nThe K, k – I prefer them as they are on the light weight and think you should have these design on all weights.\n\nThe B P R are related letters - but P and R looks differently at the top where the little stem is visible. Either B should also have this, or it could be removed.\n\nThe T looks a little bit to narrow compared to other letters. And the U a little to wide. Especially on the light and regular.\n\nThe S and s are leaning backwards a litte bit. Making them look shy.\n\ni and j has different stems on the top (the small angle) than other straight stems. I cant decide weater I think it's cool or disturbing :)\n\nFor me (maybe this is personal) the stress is on the \"wrong\" stem on V W X Y w v x y. I would shift it so the thickest stem is the first stem, opposite from what it is today. And also the A of course. I know Gill Sans has this \"feature\" also, but most fonts have the opposite I believe.\n\nIf you look at the T on regular – do you see that the horizontal stem is feeling thicker than the vertical? This could perhaps be something you could look into? Or not, if you want to have this feeling of a mathimatical thickness on the stems :)\n\nThe m could be a little narrower perhaps...\n\nWell, that's my two cents after a quick look.\n\nKeep up the good work!\n\n"
    },
    {
      "time": "31 Dec 2007 — 2:07pm",
      "content": "I would add that the g is distracting to me. I know it's meant to be the selling point on some level but I would reserve it for a display option.\n\nThe main issue I think you have is the interletter space and the counterspaces. What I see is thet the interletter space is too tight for the counter spaces.\n\nIn general you should be looking for the counterspaces and the interletter spaces to be similar. Noordzij & Brieim both make good cases for this. Here is briems'  \n [http://briem.ismennt.is/2/2.3.5a/2.3.5.02.method.htm](http://web.archive.org/web/20131012201647/http:/briem.ismennt.is/2/2.3.5a/2.3.5.02.method.htm \"http://briem.ismennt.is/2/2.3.5a/2.3.5.02.method.htm\")\n\nYou can find Noorzij's even more in depth description in \"the Stroke\" Translated by Peter Enneson.\n\nThis may also be relevant. Think about which path you want to take where overall spacing is concerned. My sense is that you are falling outside of these ranges.  \n [http://briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm](http://web.archive.org/web/20131012201647/http:/briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm \"http://briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm\")\n\nIf it was me I might consider shrinking the counters slightly. As well respacing. Not that you should choose either one. Just that they are both options.\n\nI hope this is helpful.\n\n"
    },
    {
      "time": "1 Jan 2008 — 12:52pm",
      "content": " ![](http://web.archive.org/web/20131012201647im_/http:/typophile.com/files/g_3703.jpg)\n\n"
    },
    {
      "time": "1 Jan 2008 — 1:40pm",
      "content": "If you had a unicase version of the font I think that g would work, but in this instance it is distracting to me as well.\n\n"
    },
    {
      "time": "1 Jan 2008 — 2:12pm",
      "content": "Thank you everyone for all your time and the amazing feedback. I am working on some of the corrections mentioned here and hopefully will be able to upload an updated version soon.\n\nWhere is the rest of the Typophiles? I really need them here for next few days.\n\nThanks again,  \nsatya\n\n"
    },
    {
      "time": "1 Jan 2008 — 2:23pm",
      "content": "I like what you did with the i and j curving at the top. I think the w is a bit too wide and the joins look a bit dark. it's nice :)\n\n"
    },
    {
      "time": "1 Jan 2008 — 10:04pm",
      "content": "I should add that I like it too. It hold together better than it seems like it should. I am looking forward to seeing it get better. What do you think it should be for? That's important to know when giving the crit!\n\n"
    },
    {
      "time": "2 Jan 2008 — 1:26am",
      "content": "Dear Eben,\n\nmainly this typeface is for the body text but at the same time it shouldn't look ugly while in the displays. Can you please tell me the things I must keep in mind while doing that? or may be I can have two versions of the same face as Timothy suggested. What you have to say?\n\nSatya\n\n"
    },
    {
      "time": "2 Jan 2008 — 7:41am",
      "content": "I think you've got too much design going on for a nice text face. It maybe needs to be toned down a bit. Eg, the curving of the i, the bottom of the A and the g.\n\n"
    },
    {
      "time": "2 Jan 2008 — 8:33am",
      "content": "If you really want to do both well then it is indeed a good idea to have two versions as Tim said. Or maybe more. But I will get to that...\n\nYou may want to pick at text size you want to use as a standard/baseline and focus on getting the design optimized at that size. say 10 point... That would be a good start.\n\nAlternatively you could instead pick the smallest size you want to support and then interpolate between it and a medium size (16? ) design to make say 6, 8, 9, 10 , 12, 14, 16pt versions. But that might be overkill.\n\nTaking a look at what others have done may help you decide. Before you make size optimized versions you definitely want to settle some things about the core design. the g, w & so on. And definitely the interletter spacing. And actually the spacing is a size specific issue as well! All the more reason to pick a reference size.\n\nAfter you have selected a size to work on much of what you need to know can be figured out by making printouts at the relevant sizes & tweaking based on what you think could look better - eg trusting the eye. This should not be underestimated!!!\n\nBut you are correct also in thinking that there is a good body of work showing what to change when going from text to display. Before you decide what you want to try to support it would be good to see how others have done it. For that I would look at John Downer's work on Paperback, Josha Darden's Freight series, and maybe search Typophile via Google. And there is Arno Pro as well.\n\nI found this:  \n [http://www.typophile.com/node/16839](http://web.archive.org/web/20131012201647/http:/www.typophile.com/node/16839 \"http://www.typophile.com/node/16839\")\n\nFrom the Typophile Wiki:  \n<cite> Of special note is Sumner Stone's Cycles, which is one of the few modern examples of a font carefully crafted at each of the optical sizes. Monotype is also updating their library of classic fonts with some specific sizes, notably Bembo Book.</cite>\n\nI also know that Matthew Carter's designs for Newsweek are size specific. I can point you at a document that compares the outlines though. It's a great problem to dig into.\n\nMeta now comes in text & display versions. Look at them.\n\nAh, and I would definitely not insist on the g minus it's lower bowl for a text face. I would reserve that for a variant glyph in the display size.\n\nI will see what else I come across this week re: optical compensation and post it here. I think the wiki could use updating too.\n\nI am sure that other folk here will also have even better suggestions than mine.\n\n"
    },
    {
      "time": "2 Jan 2008 — 8:44am",
      "content": "I agree with Haley, but I think you could tone things down to get to a text face.\n\n"
    }
  ]
}
