{
  "id": "4046",
  "title": "InDesign CS MAC to PC",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was just wondering if anyone knew of a method or plugin or such that would allow me to take my MAC inDesign CS files and open them on my PC version of inDesign CS. I would think there would be a way, but I haven't been able to find one. Any info would be great! Thanks!\n\n",
  "author": "aquariusangel83",
  "time": "31 Mar 2004 — 11:29am",
  "uid": "3332",
  "comments": [
    {
      "time": "31 Mar 2004 — 11:55am",
      "content": "Windows version expects InDesign files to have a \".indd\" suffix. If this is missing, the OS won't know what app to launch when you double-click the file, and the file may not show up by default in a \"file open\" dialog. But you can still open the file, either by doing \"show all files\" in the file open dialog, or even just drag and drop the file into the PC version's window.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "31 Mar 2004 — 10:54pm",
      "content": "Thanks, but this doesn't seem to work. I have saved the files on the MAC and transferred them to the PC. They have the .indd extension and indesign lists them on the \"OPEN FILE\" dialog box. However when I click on any to open it gives me an error message: \"Cannot open the file \\<name\\>.indd. Adobe Indesign may not support the file format, a plug-in that that supports the format may be missing, or the file may be open in another application\"   \n   \nTo me this makes no sense because obviously Adobe .indd files are supported. So is there another difference in the MAC and PC formats??   \n   \nThanks!\n\n"
    },
    {
      "time": "31 Mar 2004 — 11:11pm",
      "content": "Hmm. Perhaps it's a plug-in issue. Are you using a plug-in on the Mac side that you might not have on the Windows side? For example, do you have an auto-activation plug-in for a font manager that adds extra data to the InDesign file?   \n   \nFailing that, you might want to post in the Adobe User-to-User forums. Just go to http://www.adobeforums.com and pick one of the two InDesign forums. Maybe the Windows one.   \n   \nRegards,   \n   \nT\n\n"
    }
  ]
}
