{
  "id": "40487",
  "title": "Family Plot / CaboBlanco bold Art Deco-esque display sans faces",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "This is my first time posting at this board, and I hope some of you can help. Here are two movie fonts that I’m looking for. If anyone can help identify them, I’d be most appreciative. Thanks in advance.\n\n ![](http://web.archive.org/web/20080106133329im_/http:/typophile.com/files/fam%20copy_6097.jpg)\n\n ![](http://web.archive.org/web/20080106133329im_/http:/typophile.com/files/cabo_4470.jpg)\n\n [‹ Looking for an all caps script similar to graffiti art by Jean-Michel Basquiat](http://web.archive.org/web/20080106133329/http:/typophile.com/node/40515 \"Go to previous forum topic\") [(x) Body copy serif face in redesigned TIME magazine - Proforma {Florian} ›](http://web.archive.org/web/20080106133329/http:/typophile.com/node/40516 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080106133329/http://typophile.com/user/25508\" title=\"View user profile.\">bistis6</a>",
  "time": "<br>",
  "uid": "25508",
  "comments": [
    {
      "time": " 2.Jan.2008 12.15pm",
      "content": "FAMILY PLOT is Novel Gothic. We talked about digital versions of it in [this thread](http://web.archive.org/web/20080106133329/http:/www.typophile.com/node/17577).\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 2.Jan.2008 9.28pm",
      "content": "Thanks for the quick response, Mike, but none of the fonts mentioned on the other thread are an exact match. The most noticeable difference is in the flat tops of the capital A and M, whereas Novel Gothic has pointed tops. The incline in the foot of the capital L is also very unique. I have at one time found this exact font somewhere on the web, but I’ve forgotten the name.\n\n"
    },
    {
      "time": " 3.Jan.2008 7.28am",
      "content": "Hmmm, I didn’t pay attention to that when I saw the triangles for the A and F. It seems obvious that Novel Gothic was used in making this font. Have you searched the Sans fonts at Dafont.com? Such a ’mutilation’ is most often the sort of thing that find its way into the free download sites. Start with a known font, and alter the outlines (the top stroke of the F has been cut off at an angle too), and voilá you have a ’new’ font.\n\n- Mike Yanega\n\n"
    }
  ]
}
