{
  "id": "40484",
  "title": "Need Chinese Type. Don't know where to start.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I don’t even know how to form my question. So please excuse my inexperience in the area of Chinese typography.\n\nI am on Mac osx 10.4.10 using CS2.\n\nA client has provided a tiff of three Chinese characters they wish to use in a logo.  \nThe logo will be comprised of both english and Chinese characters.\n\nThe challenge is I don’t know how to activate chinese fonts on my system.  \nThey appear in my font menu but english characters appear when selected in Illustrator.\n\nHow or what do I need to do to use Chinese characters? Thanks in advance for your insights.\n\n [‹ Anyone got their limited edition Helvetica DVD yet?](http://web.archive.org/web/20081123034756/http:/www.typophile.com/node/39144 \"Go to previous forum topic\") [Last days of the year 2007 in type ›](http://web.archive.org/web/20081123034756/http:/www.typophile.com/node/40483 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081123034756/http://www.typophile.com/user/4885\" title=\"View user profile.\">cathyka</a>",
  "time": "<br>",
  "uid": "4885",
  "comments": [
    {
      "time": " 2.Jan.2008 9.45am",
      "content": "I do not have any experience working with Chinese fonts, but couldn’t you select a Chinese system font and then select the characters you’re going to use from the Glyphs palette? Window\\>Type\\>Glyphs\n\n"
    },
    {
      "time": " 2.Jan.2008 9.47am",
      "content": "Here is a list of the system fonts for OS X 10.4 [http://docs.info.apple.com/article.html?artnum=301332](http://web.archive.org/web/20081123034756/http:/docs.info.apple.com/article.html?artnum=301332 \"http://docs.info.apple.com/article.html?artnum=301332\") There are a few Chinese system fonts.\n\n"
    },
    {
      "time": " 2.Jan.2008 11.13am",
      "content": "You can also get Chinese fonts from Monotype or Linotype or Chinatype... Most of the big font foundries offer Chinese. However, most of them are too expensive in my view!\n\nWell, on the other hand - they of course contain a hell of a lot of characters :-))\n\n"
    },
    {
      "time": " 2.Jan.2008 11.20am",
      "content": "Contact your client and get them to email you the Chinese text. You should be able to cut and paste the text into whatever program you are using and switch to whatever font you choose.\n\nDavid\n\n"
    },
    {
      "time": " 2.Jan.2008 12.48pm",
      "content": "Thanks all. I went the glyph route. It is taking a while but I have been able to locate two of the three characters I need. Your suggestions were much appreciated.\n\n"
    },
    {
      "time": " 2.Jan.2008 1.30pm",
      "content": "\\>I went the glyph route. It is taking a while but I have been able to locate two of the three characters I need.\n\nI’m guessing you’re being paid by the hour ;-)\n\n"
    }
  ]
}
