{
  "id": "40508",
  "title": "Mosaic Technique - Illustrator effect or hand-drawn?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Can anyone help me figure out how this graphic style is achieved?\n\nI’ve seen this used before a number of times, and I find it hard to believe that it’s done by hand - it seems that would take forever. I imagine there’s some sort of Illustrator plugin that automates the process and allows the user to control how the forms are filled. You’ll notice that the ’fill shapes’ are never sliced, but rather resized to accurately define the boundaries of the outer form.\n\nAny ideas? Suggestions?\n\nThanks so much,  \nJim\n\n ![](http://web.archive.org/web/20090702064539im_/http:/typophile.com/files/C5-128-01_5732.jpg)\n\n",
  "author": "<a href=\"/web/20090702064539/http://typophile.com/user/12496\" title=\"View user profile.\">jimsbee</a>",
  "time": "<br>",
  "uid": "12496",
  "comments": [
    {
      "time": " 2.Jan.2008 10.17pm",
      "content": "you could have a look at [Scriptographer](http://web.archive.org/web/20090702064539/http:/www.scriptographer.com/), a pretty versatile Illustrator plug-in.\n\n"
    },
    {
      "time": " 3.Jan.2008 8.22am",
      "content": "Thanks. Looks useful, but I can’t find any existing scripts to do the job.\n\nAny other ideas?\n\n"
    },
    {
      "time": " 3.Jan.2008 8.51am",
      "content": "The Symbol Sprayer Tool in Illustrator does this effect quite well  \nHave a look [here](http://web.archive.org/web/20090702064539/http:/www.jnack.com/adobe/flash/sprayer.html)  \nThere rest is just patience!\n\nScriptographer is great too. Thanks Sebastian\n\nAlso could I ask you James where you got that image?\n\n"
    },
    {
      "time": " 3.Jan.2008 9.20am",
      "content": "Yes, but the symbol sprayer creates overlaps and random spacing...you’d be better off doing the whole thing by hand. If you look at the “2006,” The boundaries are so perfect, it seems there’s some kind of magic assistance involved??\n\nI got the image here:http://www.artgraphics.ru/best/best2006\\_eng.html\n\nJust scroll down.\n\n"
    },
    {
      "time": " 3.Jan.2008 9.46am",
      "content": "The sample you share was most definitely done by hand. Something that organic isn’t the result of a filter or tool. The work of [Marian Bantjes](http://web.archive.org/web/20090702064539/http:/typophile.com/wiki/Marian%252BBantjes) and [Si Scott](http://web.archive.org/web/20090702064539/http:/typophile.com/wiki/Si%252BScott), for instance, could never be done with a filter.\n\n"
    },
    {
      "time": " 3.Jan.2008 10.02am",
      "content": "I agree that the splatters/stray elements were probably done by hand, but what about the base fill of the numbers? It seems to be very consistent, and I imagine that there would be some way to script a fill like that??\n\n"
    },
    {
      "time": " 3.Jan.2008 10.08am",
      "content": "They were simply very careful with the size and placement of the circles. Through Gestalt our eyes are following the shape and that is how it appears to be so perfect.\n\n"
    },
    {
      "time": " 4.Jan.2008 10.30am",
      "content": "More interesting work like [this](http://web.archive.org/web/20090702064539/http:/www.unlekker.net/proj/packing/index.html).  \nLeads me to believe that there is a script that does this effect.  \nImagine trying to do those by hand!\n\n"
    },
    {
      "time": " 4.Jan.2008 2.46pm",
      "content": "I´ve also been looking for a plugin/program to do this kind of stuff. It really looks great. I once contacted a guy who did a piece like this and he said it was done by hand, the “Old School” way as he put it.\n\n"
    },
    {
      "time": " 4.Jan.2008 3.39pm",
      "content": "I have to admit, that those are amazing Seán. I suppose you could define an area using postscript and then the script could be implemented within. :^/ But I still think this is all done by some patient, talented person . . . by hand.\n\n"
    },
    {
      "time": " 4.Jan.2008 4.02pm",
      "content": "There are some great brushes here that might help.\n\n[http://seishido.biz/seishido.html](http://web.archive.org/web/20090702064539/http:/seishido.biz/seishido.html \"http://seishido.biz/seishido.html\")\n\nSharon\n\n"
    },
    {
      "time": " 4.Jan.2008 5.46pm",
      "content": "While I am sure that a script does exists to replicate this effect, my own personal experience doing this type of work was painful.  \nThis was my attempt. Except with lightning bolts of course.\n\n ![](http://web.archive.org/web/20090702064539im_/http:/typophile.com/files/foals_5649.png)\n\n"
    },
    {
      "time": " 5.Jan.2008 2.59am",
      "content": "I once did a poster where I replicated a colour vision test which did not actually contain any hidden letters or numerals. (Don’t laugh; it was one of those “loose lips sink ships”-type military operation security posters, and it was no work of genius.)\n\n ![](http://web.archive.org/web/20090702064539im_/http:/typophile.com/files/poster01_3610.gif)\n\nI also looked for ways to automate this, but in the end, it was all done by hand. This involved making hundreds of copies of circles of various sizes and similar hues and positioning each by hand. I think it took me no more than an hour.\n\n"
    },
    {
      "time": " 7.Jan.2008 12.19am",
      "content": "종성, what does that say? Google Translate gives: “Uh, security ...? They do not know the security of the blind spot, once again confirmed.” The first part makes sense, but the second part less so. Just curious.\n\n"
    },
    {
      "time": " 7.Jan.2008 5.41pm",
      "content": "Max, I’m impressed you were able to input the hangul text into Google Translate at all.\n\nThe poster says:  \n어, 안 보이네? 자신도 모를 수 있는 보안의 맹점, 다시 한 번 확인하세요.\n\nor translating liberally?\n\nHuh, I can’t see it! Any blind spots in security you might not know about? Check once again.\n\nBlind spots and colour vision deficiency tests don’t make the most sense, but I just wanted to use the test in a poster.\n\n"
    },
    {
      "time": " 9.Jan.2008 12.35am",
      "content": "Jongseong, thanks for the translation.\n\nI learned Hangeul a while ago. I was trying to learn Korean but I didn’t get very far. But being a computer geek, I installed the Korean IME and learned the 2-bul keyboard layout. I hear 3-bul is more efficient, but there’s more to remember, and I don’t use it much anyway.\n\n"
    }
  ]
}
