{
  "id": "4050",
  "title": "Isbel la romana",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "hi...   \ni´m new.   \nhere is my isabel, it´s the first version... the roman.   \ni have been working so much, and... is my fist face. i hope good an bad critiques.   \n   \njuan pablo\n\n<center><img src=\"http://web.archive.org/web/20150417144947im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" alt=\"isabel.pdf\"></center>!-/attachment-!\\>!-attachment-!\\> \n",
  "author": "degregorio",
  "time": "10 Dec 2002 — 2:17pm",
  "uid": "619",
  "comments": [
    {
      "time": "10 Dec 2002 — 2:24pm",
      "content": "uf\n\n"
    },
    {
      "time": "10 Dec 2002 — 2:27pm",
      "content": "ahora si que si va mi fuente\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150417144947im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"LEFT\" alt=\"application/pdf\">Text Description<br><a href=\"http://web.archive.org/web/20150417144947/http:/www.typophile.com/forums/messages/29/isabel.pdf\"><b>isabel.pdf</b></a> (14 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "10 Dec 2002 — 6:36pm",
      "content": "Hello Juan, pretty face you got here.   \nHere's some suggest, the 's' seems a little bit light than the others. Maybe you can add some weight on the stroke. And it's a little 'rise' from the baseline. You know that the 's' dont stand like other character.   \nAnd I'm not sure about the 'v'. It's growing on me, and I can't figure it why, and what.   \nWell that's it, I'll post some reply later.   \n   \n+ep+\n\n"
    },
    {
      "time": "10 Dec 2002 — 6:38pm",
      "content": "Oh by the way, where's the uppercase?   \nAnd, can you post us the face in different colour? The red really bothering my eye.   \n   \n+ep+\n\n"
    },
    {
      "time": "10 Dec 2002 — 6:58pm",
      "content": "I like the first 'g'. Are you going to use both, or just one?   \n   \n+ep+\n\n"
    },
    {
      "time": "10 Dec 2002 — 6:59pm",
      "content": "And the first 'y'.   \n   \n+ep+\n\n"
    },
    {
      "time": "10 Dec 2002 — 10:50pm",
      "content": "Mmmmm, sacreligious...   \n   \nIt looks nice, friendly and sort of compressed vertically. I like it. THe 'g' is a wee bit funky, but it might just work.\n\n"
    },
    {
      "time": "11 Dec 2002 — 3:23am",
      "content": "Buena JP   \n   \nMe gusta mucho Isabel.   \n   \nEl ojo de letras como la \"a\", la \"b\",\"c\",\"d\",\"g\",\"e\",,,,etc le dan un muy buen caracter a tu letra, lo que si, trataría de afinar la acentuación de las vocales: fíjate en el contraste que lograste en la de la \"ñ\" (que tiene una inclinación muy linda y femenina).   \n   \nEn cuanto a la \"g\" y a la \"y\", también me gustan mucho más las primeras, pero trataría de hacerlas un poco menos conflictivas con las letra que las antecede.   \n   \nSaludos y felicidades   \n   \nCristián González\n\n"
    },
    {
      "time": "13 Dec 2002 — 3:37pm",
      "content": "Hola Juan Pablo,   \n  \nWellcome to typophile, and show us some uppercases with that sacreligious feeling...   \nAre you already with some lowercase s`s ?   \nKeep fishing!   \n   \n...I love that g & y, im still waiting for the italic sketches (rollitos primavera)   \n   \nMiguel.\n\n"
    },
    {
      "time": "14 Dec 2002 — 9:58am",
      "content": "miguel.   \ni`ll have to end the uppercase before start the italics characters.   \nthe sketches are so basic still.   \n   \nyou´ll have to know to wait, patience... please.   \nonly patience.   \nlet me have less work.   \n   \nthanks for the comments\n\n"
    },
    {
      "time": "16 Jan 2003 — 4:01pm",
      "content": "se\n\n"
    },
    {
      "time": "16 Jan 2003 — 5:51pm",
      "content": "Wow. Bodoni getting fat and happy on South American chorizo...   \n   \nVery promising.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 7:13pm",
      "content": "JP   \n   \ni like a lot, and you have worked a lot since december   \n   \nfew comments   \n   \nin \"Caja alta guatona italiana\" i think that the \"Q\" is too thick in the tail inside the globe, it should be the same the end of the tail(encuentro que la cola en su interior esta muy gruesa, debiera mantener el grosor de la cola al final)   \n   \nin \"caja baja italica\" i think the x and 5 could be more expresive in its inclination(podrian ser mas cursivas, en especial con el 5)   \n   \nfelicidades, y gran trabajo el que haz hecho   \n   \nCG\n\n"
    },
    {
      "time": "16 Jan 2003 — 9:35pm",
      "content": "I would think of _promising_ as an understatement. \\*First face\\* -WOW.   \n  \nI am especially font of your asymmetrical brackets and parentheses.   \n  \nThis is progressing very well. Beautiful presentation.   \n  \nsmc\n\n"
    },
    {
      "time": "17 Jan 2003 — 4:44am",
      "content": "The ligatures! Schwing!   \nMaybe not the most useful crit ever :-)   \nOk. The J's are a sticking point for me. You have a nice thing working with the soft roundness, but the negative space in the hook is maybe a bit too soft/open? Particularly in the small cap and heavy weights. Maybe do a version that echos the g and y.   \n   \nThat would give us Joneses something to work with! This is very tasty font.   \n   \nRandy Jones\n\n"
    },
    {
      "time": "17 Jan 2003 — 11:57pm",
      "content": "Lo mas padre de tu pdf es la biografia super ingeniosa. El font, bien muy bien, solo checate que onda con los overshoots de la \"o\" pero en general tiene buena textura. Si la sigues desarrollando vas por excelente camino.   \n   \nobvias felicidades desde ciudad de mexico   \n   \ny mandame uno de tus comics! (no es cierto)\n\n"
    },
    {
      "time": "31 Jan 2003 — 8:27pm",
      "content": "bueno, he avanzado algo en mi tipograf\n\n"
    },
    {
      "time": "31 Jan 2003 — 8:45pm",
      "content": "Really very nice. I love the differences between the weights.   \n   \nJust one thing: the spacing in the Regular is too loose.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Jan 2003 — 11:10pm",
      "content": "What a font!, really great Juan Pablo, your way of work is always growing with no limits, y claro ma\n\n"
    },
    {
      "time": "31 Jan 2003 — 11:12pm",
      "content": "Viste os manuales de fontographer en el foro de discusi\n\n"
    },
    {
      "time": "31 Jan 2003 — 11:15pm",
      "content": "Ahh, as visto el nuevo foro de comunidad hispana? participa y pasa el dato, chau!\n\n"
    },
    {
      "time": "1 Feb 2003 — 7:30am",
      "content": "juan pablo   \n   \nnotable compadre, me gusta mucho como invertiste los trazos de la \"y\", eso si en la descendente yo no hari tan brusco el cambio de grosor con la diagonal izquierda y ademas tratar\n\n"
    },
    {
      "time": "1 Feb 2003 — 9:19am",
      "content": "Guys,   \nYou know I like reading Spanish (and trying to write it), but I assume you realize that you're seriously limiting the audience of your posts when you don't write in English, and this limits the resultant dialog. Of course it's harder to write in a non-native language, but if your English is not too bad, or even merely somewhat embarassing (I think few people here mind, or would think less of you), as long as it's not largely unintelligible, consider using English instead,\n\n"
    },
    {
      "time": "1 Feb 2003 — 9:42am",
      "content": "Another sad commentary on the state of the American education system, eh?   \n   \nDamn, this does have me wishing that I paid more attention during Spanish class ...\n\n"
    }
  ]
}
