{
  "id": "4052",
  "title": "\"Reverse\" Handwriting",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I saw a children's book where the text is a hand-rendering of a font - Courier:   \n   \n ![unCourier](http://web.archive.org/web/20131018102304im_/http:/www.typophile.com/forums/messages/30/32396.gif)   \n   \nIt's like the opposite of a handwriting font!   \n   \nAny other examples of this you guys know of? Particularly where it's not a self-conscious act. When the writer is explicitly trying to make a point about the reversal, it's a lot less interesting [to me].   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "31 Mar 2004 — 1:11pm",
  "uid": "1250",
  "comments": [
    {
      "time": "31 Mar 2004 — 2:14pm",
      "content": "I think it makes very much sense for a kid's book. It conveys a human aspect making courier feel a little friendlier and more expression. Plus, the kids don't have to read complicated script shapes! (especially if they don't know how to write them) It was probably conscious in some way though I agree with you there's a paradox there.. especially courier!\n\n"
    },
    {
      "time": "31 Mar 2004 — 6:30pm",
      "content": "Hrant, can you let us know the name of the book? I remember reading it to my daughter in the bookstore a while back and thought how cool the lettering was.   \n   \nCheers, Si\n\n"
    },
    {
      "time": "31 Mar 2004 — 6:35pm",
      "content": "\"Don't let the pigeon drive the bus!\" by Mo Willems.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2004 — 12:35am",
      "content": "In the 1970s, drawn/traced type was relatively common in cartooning and illustration. Here's a sample from _The I Hate Mathematics Book_:   \n   \n ![the preposterous googol](http://web.archive.org/web/20131018102304im_/http:/www.typophile.com/forums/messages/30/32442.gif)\n\n"
    },
    {
      "time": "1 Apr 2004 — 8:10am",
      "content": "Might it have been a way for people with imperfect lettering skills (probably 90% of us...) to save money on typesetting? I think at the very least the difficulty of getting good setting for cheap was a catalyst for giving it such a \"hand-made-font\" look. Saving money and creativity often go hand-in-hand. Frankling was wrong: it's not necessity that's the mother of invention, it's laziness! And greed is its father.   \n   \nOne interesting thing in my sample above is that Courier's bad spacing (being a monospaced font) has been reproduced exactly! It seems like the author used tracing paper directly over laserprinted settings of Courier... In the 70s, maybe they used font specimen books that way?   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2004 — 10:41am",
      "content": "Interesting how 'so can you watch' has been shifted half a width to maintain the centered layout. This kind of ruins the whole monospaced look for me.   \n   \nThanks for passing on the title.   \n   \nCheers, Si\n\n"
    },
    {
      "time": "1 Apr 2004 — 12:42pm",
      "content": "Yes, in the 70s we used to comp headlines for rough layouts by tracing over specimen books. The layout paper pads were not tracing paper, but high-quality rag paper, with enough transparency to do this (or trace over one's previous sketches, or a photocopy blow-up, whatever).   \n   \nSo, back then, \"the preposterous google\" represents a \"rough layout\" look that was being used as finished artwork. (After all, illustrators would have been familiar with receiving \"tight comp\" layouts with this kind of lettering, from art directors, for positioning their illustrations.)   \n   \nNow, the traced Courier appears to be about humanizing technology, and also represents the present-day myth that stuff for kids should look crudely formed, like they did it.   \n   \nThat is really  stupid, IMHO -- not the way to educate children at all. Just because kids can't do sophisticated handwriting, doesn't mean they can't appreciate or understand it. Besides, Adults can't write any better either!   \n   \nSure, Dr Seuss had wacky wonky lettering on his book covers, but it was beautifully drawn (unlike the recent travesty of his lettering in the Myers movie which was carried over into his re-released books), and inside his books the youngsters got Garamond and Century. No wonder boomers are so much smarter than subsequent generations -- we grew up reading decent typography!\n\n"
    },
    {
      "time": "1 Apr 2004 — 12:51pm",
      "content": "\\> 'so can you watch' has been shifted half a width   \n   \nProbably because it has a different parity than all the other lines (it's an even number of characters while all the rest are odd). That probably reinforces the probability that it was done by tracing over a DTP composition.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2004 — 4:36pm",
      "content": "I think that playing with the choice of face and how it's set adds a lot to kid's picture books. Here's another good one that also uses a drawn version of Courier. \"Click, Clack, Moo - Cows That Type\" by Doreen Cronin. It was a favorite of my youngest daughter.   \n   \nThere's an inside spread on Amazon's webpage: [http://www.amazon.com/exec/obidos/tg/detail/-/0689832133/qid=1080865706/sr=1-1/ref=sr\\_1\\_1/002-3647610-0932843?v=glance&s=books](http://web.archive.org/web/20131018102304/http:/www.amazon.com/exec/obidos/tg/detail/-/0689832133/qid=1080865706/sr=1-1/ref=sr_1_1/002-3647610-0932843?v=glance&s=books)\n\n"
    }
  ]
}
