{
  "id": "40521",
  "title": "Special colours and cost",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m creating a book for some friends of mine. I’ll only produce two or three books, so offset printing is not even an issue. Anyhow: I’m luvvin this neat fluorescent red colour I came across and really want to use it for this project. What are my options?\n\nI searched the net for clever solutions, but couldn’t find anything (except a printer cartridge called “Canon Bc-29F” with fluorescent ink – but no further description on what results it gives).\n\nCheers.\n\n [‹ Uneccesary Squooshing](http://web.archive.org/web/20080110171648/http:/www.typophile.com/node/40536 \"Go to previous forum topic\") [f + umlauts ›](http://web.archive.org/web/20080110171648/http:/www.typophile.com/node/40439 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080110171648/http://www.typophile.com/user/17101\" title=\"View user profile.\">frode frank</a>",
  "time": "<br>",
  "uid": "17101",
  "comments": [
    {
      "time": " 3.Jan.2008 9.03am",
      "content": "You can get silkscreen ink in some pretty wild colours.\n\n"
    },
    {
      "time": " 3.Jan.2008 9.19am",
      "content": "Haley: Could you shed some light on silkscreen printing? Is that something my regular printer might offer?\n\n"
    },
    {
      "time": " 3.Jan.2008 11.30am",
      "content": "Silkscreening is the same as screen printing. Basically large sheets of fine screen fabric stretched over a frame. Using photo emulsion you can burn and block out patterns into the screen which then, using a squeegee, you push ink through the empty spaces to make a print. It’s fairly easy to do yourself, but you need a super intense light to expose the emulsion. I found a video of someone printing his already prepared screen.\n\n[http://youtube.com/watch?v=qCZe9BWxCu0](http://web.archive.org/web/20080110171648/http:/youtube.com/watch?v=qCZe9BWxCu0 \"http://youtube.com/watch?v=qCZe9BWxCu0\")\n\nI’m not sure if regular printing houses do this, but there are probably studios in your town that will. Also you could hit up art schools and find a printmaking student to do it for you. This is how a lot of hand-printed t-shirts are made as well. I’ve used this technique for type in books before and it works really well. And like I said the ink comes in all sorts of colours like flouresents and glow in the dark. You can also print white.\n\nLook up “silkscreen book” on flickr for tons of images of small run books other people have done.\n\n"
    },
    {
      "time": " 3.Jan.2008 11.45am",
      "content": "Depending upon how much time and money you have, letterpress might be a good solution, especially limited runs like 3 copies.\n\nIf you’d like to explore this option, these three are friends of mine:\n\n[Peter Fraterdeus](http://web.archive.org/web/20080110171648/http:/www.exquisiteletterpress.com/)\n\n[Harold Kyle](http://web.archive.org/web/20080110171648/http:/www.boxcarpress.com/)\n\n[Amos Kennedy](http://web.archive.org/web/20080110171648/http:/www.kennedyandsonsfineprinters.com/)\n\nI’m pretty sure all will take on custom jobs like the one you’re talking about. You can do your set up on the puter and have polymer plates made for printing, with the ink color(s) of your choice. Pretty sure there are no limitations. The only setback here is that it’s going to be pretty expensive, I think.\n\n"
    },
    {
      "time": " 3.Jan.2008 11.52am",
      "content": "I’d look into screen printing too...you could print the pages as a signature (ie, multiple pages on one large sheet) then trim and bind.\n\nThat said, the cost for both screen printing and letterpress is typically the set-up. So, both aren’t really designed for runs of 3 or so.\n\nOne last option...back in the day (a decade+ ago in art school) one could by little sheets of custom color. They looked like foils. You’d place it on top of your laserprinted paper and apply heat to it, the heat would fuse the color to the toner in the paper. It was a way to emulate spot colors and foil embossing.\n\nthat might work if your use of color is in small amounts.\n\n"
    },
    {
      "time": " 3.Jan.2008 12.22pm",
      "content": "To clarify why I think letterpress is ideal for runs of 3 (as opposed to offset)...most commercial printers are not going to want to print a run of 3. There are lots of letterpress printers who would be happy to print a run of 3.\n\nAnother very modern option is the digital press that many small business printers have these days. I think the limitation here, however, is that spot inks are not possible. I could be wrong, but I’m pretty sure you’re limited to the 4-color process with the digital printing technology.\n\n"
    },
    {
      "time": " 3.Jan.2008 12.57pm",
      "content": "Thanks a lot!\n\nHaleyFiege: I’m amazed how well the type held up on those flickr examples.\n\naluminum: Do you know what these sheets are called? It would be great to see some images.\n\nKoppa: I think I have to rule out letterpress for know. The book is more of a friendly gesture, and a young lad need some pocket change for womanizing, milk and cookies.\n\n"
    },
    {
      "time": " 3.Jan.2008 1.10pm",
      "content": "Another good example of how to screen print:  \n [Here!](http://web.archive.org/web/20080110171648/http:/www.youtube.com/watch?v=YyQemBVZJYw&eurl=http://www.monoscope.com/2007/12/aesthetic_apparatus_explains_s.html)\n\nWether you decide to screen print this yourself or send it out to a studio, printing could be a little costly. Especially for a friend job.\n\nIf that color’s worth it to you, I’d say make it happen by any means necessary!\n\n"
    },
    {
      "time": " 3.Jan.2008 1.29pm",
      "content": "Letraset still makes the transfer film, and does custom on order. That stuff isn’t very durable though, if it is the same I used to use. You would need to seal it somehow? And who knows over time…\n\nAnyway, a hand applied wood block print could work in the right situation. Or any other low tech method, depending on the look you want.\n\n"
    },
    {
      "time": " 3.Jan.2008 2.29pm",
      "content": "Another option you might consider is finding a press which has an Indigo printer. Indigo printing is a great option for short run printing. They can replace the inks with spot colors. I think it might be worth looking into for this project.\n\n"
    },
    {
      "time": " 3.Jan.2008 2.53pm",
      "content": "Good old Tiff:) Apparently there are a few Indigo’s in Norway.\n\n"
    },
    {
      "time": " 3.Jan.2008 3.06pm",
      "content": "Ah well. Old? But you’re welcome anyway. :^P\n\n"
    },
    {
      "time": " 3.Jan.2008 4.11pm",
      "content": "The digital presses have zero make ready, and the output gets better all the time. That’s probably a good bet. The solids are not the problem they used to be.\n\n"
    }
  ]
}
