{
  "id": "40550",
  "title": "Fraktur Lowercase Attempt",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "Hi My name Is Charles and I’m a design student at Kutztown University. I did an independent study this past semester on typeface design because no professor at my school teaches it and I wanted to try it.\n\nThis was the result. I was wondering if you guys wouldn’t mind critiquing it. I built it in illustrator because I haven’t the slightest idea about anything that professional type designers use. I used some rulers and built some tools out of boxes that i thought were quite resourceful but I don’t know if I even did the right thing once and not everything is exact because I wasn’t sure where to even start that.\n\nThe books I tried to use were: Karen Cheng’s “Designing Type” and “The Art of Calligraphy” By David Harris because it had all different written alphabets including the fraktur.\n\nI based it off of my own letterforms of the fraktur but it went in some different directions. There are a lot of things that interest me and disturb me and I don’t know how to fix them.\n\nWhat do you think?\n\n[http://farm3.static.flickr.com/2074/2165307545\\_ed6f38079b\\_o.png](http://web.archive.org/web/20150420023539/http:/farm3.static.flickr.com/2074/2165307545_ed6f38079b_o.png)\n\n",
  "author": "MajorMoscow",
  "time": "4 Jan 2008 — 5:30am",
  "uid": "25561",
  "comments": [
    {
      "time": "4 Jan 2008 — 5:32am",
      "content": "I know not everything is standard there. It is a work in progress.\n\n"
    },
    {
      "time": "4 Jan 2008 — 6:23am",
      "content": "Hey Charles, welcome to Typophile. I'm an '02 KU grad, CD of course. I'm not surprised to hear that there isn't anyone available to help you professionally at the school. My impressions were that it's a formula teaching school, not a concept learning school. So anything outside the curriculum is often approached as a independent study. A fellow student (Nicki Stager) had attempted to do a type face of her own as an independent study. She worked with Todd McFeely, who isn't exactly a type professional by any means, but he might be worth approaching.\n\nAs for your work, it looks remarkable. You might want to try and create characters that aren't pieced together from other characters and some that are a single stroke, not a combination of multiple strokes (it's starting to look like a stencil version Fraktur.) Your line thickness is consistent, which is good, and your curves are elegant.\n\nYou'll also need to consider spacing between the letters, I'd open it up a little, these seem a bit tight and with the broken look, make the letters blend together too much.\n\nWould you mind attaching your images using the \"insert image\" link on this site. You can add it to the original post if you click on edit and then insert image. This will help preserve the history of the post if something should ever happen to your Flickr page, or if you remove the image for the page.\n\nGood luck, this looks awesome and I would love to see what becomes of it. Are you planning to do uppercase letters or numbers also?\n\n"
    },
    {
      "time": "4 Jan 2008 — 9:52am",
      "content": "Thanks for your compliments!\n\nI was happy with the support I got from The professor that oversaw my project (It was Karen Kresge) but it was new territory for the both of us and we both were guessing at solutions. I wasn't aware that Prof. Mcfeely did this before otherwise I would have asked him to oversee it for sure.\n\nI tried to attatch it as an image with the insert image but it said there was an error so that's why i posted the link. I will keep trying to get it on there.\n\nI think you are right about the pieces. When I began it I thought part of the concept would be that my counters were open and that you could stencil it if you wanted so I broke it at each thin stroke. Now that I look at it I can see how the letters could curve better If they were fluid along those lines so I'm going to try that. also the f and the t (the only solid characters) seem very heavy and rigid to me and the t I feel doesn't fit the rest of the letters yet.\n\nI was trying to find the common strokes in the letter and use them to assemble the other letters. not out of laziness but because i thought it was correct. The y I know Is a disapointment In that regard I think I'm going to go back to the original shape if closing these gaps helps...\n\nI would love to do the uppercase and numbers to really finish it off but I think i still have a lot of work here yet. I can't do it quickly yet so be patient for an update...\n\nThanks again\n\n"
    },
    {
      "time": "4 Jan 2008 — 10:21am",
      "content": "I like the open, stencil-ness of it. The individual parts vary quite a bit so it doesn't seem to formulaic.\n\nIf you want to continue with blackletter you should pick up \"Blackletter: Type and National Identity\" by Peter Bain and Paul Shaw:\n\n[http://books.google.com/books?id=E4c3sJhNVqkC](http://web.archive.org/web/20150420023539/http:/books.google.com/books?id=E4c3sJhNVqkC \"http://books.google.com/books?id=E4c3sJhNVqkC\")  \n [http://www.cooper.edu/art/lubalin/bletter.html](http://web.archive.org/web/20150420023539/http:/www.cooper.edu/art/lubalin/bletter.html \"http://www.cooper.edu/art/lubalin/bletter.html\")\n\n"
    },
    {
      "time": "16 Feb 2008 — 1:21am",
      "content": "It's a very nice beginning. I basically like Fraktur and just used it in a project. A decent program to create a font in is Fontographer: [http://www.fontlab.com/font-editor/fontographer/](http://web.archive.org/web/20150420023539/http:/www.fontlab.com/font-editor/fontographer/ \"http://www.fontlab.com/font-editor/fontographer/\") and it works somewhat like Illustrator but it lets you test strings of characters and put in spacing – which is the second part of font design. But i would also close those characters and heavy up the hairlines in the \"e\" and the \"z\" just a bit.\n\n ![](http://web.archive.org/web/20150420023539im_/http:/typophile.com/files/matt3_3610.jpg)\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:41pm",
      "content": "The first things that stand out is that some of the character shapes follow other blackletter/antiqua styles, although to good effect. Specifically those are the lowercase K, and X. The K is normally based off the L, as you have it, but with a stroke the same height as the bar in the F, and an additional stroke above. Certainly more readable to the modern reader how you have it, but I just point it out depending on your exact goal. The R is often the basis for the X, simply with a tail. Again, your version is far more readable, but depending on your goal...\n\nI really like the ascender terminals in the lowercase B, K, L, and H. The descender on the Y I think could be a little bit more curvy, it seems too straight. Often times the Y is more based on the H, but with an ascending left stem. I tried copying and pasting your H descender to the Y, but since you have a relatively short descender on it it doesn't fit the style at all on the Y.\n\nWithout a doubt your second Z is better. The swash is great in the first one but just doesn't fit the letter for me. It would make a nice swash for hyphens or other such things though.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
