{
  "id": "4056",
  "title": "Kill bad splines curves :-)",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "anyone could bring the very sensitive curves from ikarus back to typography soft instead of those ugly splines that give every typefaces the look to have been drawn on computer and not with a human hand ?   \nOr maybe is it some really, really nice drawing soft that are using those kind of curves nowaday ?   \nThe curves I am talking about are the one using in some industrial design soft or that are using the REAL beziers curves, not the one so-called béziers you get in Adobe illustrator, Freehand, fontlab or fontographer\n\n",
  "author": "anonymous",
  "time": "11 Dec 2002 — 6:17am",
  "uid": "1203",
  "comments": [
    {
      "time": "11 Dec 2002 — 8:01am",
      "content": "there is something to be said for nice handwriting, calligraphy, etc. but i think it's a little dishonest to use a computer to create and print fonts that appear to be written by hand. my personal rule of thumb is that if i want something that looks like handwriting, i bloody well write it with my hand. is that what you mean by \"rising above\" hrant? i guess i should say i'm not totally opposed to those sorts of fonts, i just don't use them a whole lot. no ban handwriting fonts campaign. ha.   \njulien- don't you find any beauty at all in industrial aesthetics? there is something beautiful about din, for example, even though it's rigid, boring, and lacking in any flamboyance, that's what is so cool about it. but now i have to go check out ikarus.\n\n"
    },
    {
      "time": "11 Dec 2002 — 8:57am",
      "content": "Isaac -- so you only use modern and transitional (some) typefaces when you need a serif??   \n   \nHrant -- I was waiting for that comment. ;¬)\n\n"
    },
    {
      "time": "11 Dec 2002 — 10:04am",
      "content": "So I'm becoming predictable... :-(   \n   \nChirographic (hand-based) type just feels wrong. Feelings are plenty for oneself, but other people like to hear \\*reasons\\*. Fortunately in the past two months I've developed an armada of reasons (based on linguistics, reading theory, as well as the work of Dwiggins and others), and one day I will write a full article to put the regressive hand-mongers in their place. Real quick: chirographic type is dysfunctional because: it promotes excessive, literal, superficial modularity; misuses the cartesian space (differently in each dimension); and creates a detrimental relationship between the two edges of the letterform body (in opposite to Notan, the core principle of design). Run for it Luddites, your days are numbered (perhaps even by definition)...   \n   \nhhp\n\n"
    },
    {
      "time": "11 Dec 2002 — 6:41pm",
      "content": "regressive hand-mongers? do you do freelance stand-up? that is hilarious. i'm with you, even if i don't understand half of what you say. please write that article. i'm holding my breath.   \n   \n\\>so you only use modern and transitional (some) typefaces when you need a serif?   \n   \nok, i left myself open for that one. actually, i generally avoid serif fonts when possible. i'm down with jan and the neue typographie boys when it comes to that. serifs are so... ostentatious. i'm half-joking here. i know jan t. refuted his hard-line stance later on, and i know most of you will argue (i know hrant will for sure) that sans faces are too hard to read in large bodies, but i disagree anyway. phillip meggs' \"history of graphic design\" is set entirely in helvetica (take it easy, hhp), and at least two of his other books are set in univers (go, univers, go!), and they read perfectly fine. the magazine i'm interning at uses meta. trendy, i know, but it works better than many serif text faces would. i don't hate serifs. i dig mrs. eaves, but i do prefer a more modern approach. in fact, i have more than a passing sympathy for herbert bayer's idea that we don't even need upper case letters, as you may have noticed. but i'm no zealot. i even find myself in search of appropriate (gulp) script fonts once in awhile. i wish i could use them like vaughn oliver does.   \n   \nso let's argue: when does one _need_ a serif font? i think maybe it's all in the aesthetics, and when it comes to that, aren't your aesthetics determined by your ethics?   \n   \ndid i just use italics? i need to go wash my hands.\n\n"
    },
    {
      "time": "11 Dec 2002 — 6:59pm",
      "content": "Bayer was a fundamentalist. Fine for rousing rabble, lousy for Craft.   \n   \n\\> i do prefer a more modern approach   \n   \nWell yes, serifs do impart a \"stodgy\" feel, but mostly to designers: for regular readers any such effect is probably small. And serifs most certainly improve readability. So if you're setting a book not intended for idealistic Bauhaus-infected designers, use a serif face. If it helps, use one of the recent \"honest\" Latin-slab faces, like FF Zine, Parkinson's Azusa, Patria (not released yet), etc.   \n   \nItalic? A necessary evil. Just make it close to the roman, like no rediculous descending \"f\".   \n   \nhhp\n\n"
    },
    {
      "time": "11 Dec 2002 — 7:26pm",
      "content": "actually, i've seen some descending f's that rock. base nine is used for the cartoon network's cartoon cartoon friday logo. but i know what you mean.   \n   \n\"honest\" latin-slabs? are you poking fun at me?   \n   \ni just realized there's an example of what i'm talking about in these forums. the id post for the mercedes-benz font. head over there and look at it. do you think benz would use univers in place of that font? i don't think so, but why not? because they're trying to attract snobs, and to do that they use a snobby font. it's elitism. i admit that my opinion is based in some measure on rabble rousing, but i'm not a sans snob either. i used mrs. eaves (does it seem like i'm obsessed with ms. licko here? i'm not, really) for a birth announcement i did for my sister recently, but only because my wife was art directing. and i'm sure my sister wouldn't have gone for any kind of funky stunt i would have pulled.   \n   \nserifs improve readability, but only if that's what you're used to reading. like rudy van der lans said, you read best what you read the most. if you read mostly elliot earls posters (heaven help you), then i guess that's what you'd be comfortable with. so we read serif fonts better because that's what is used most often for body copy, and we use serif fonts for body copy because that's what we read best.\n\n"
    },
    {
      "time": "11 Dec 2002 — 8:18pm",
      "content": "Getting back to Julien's question...   \n   \nFontLab 4.5 has a \"sketch\" mode that is supposed to emulate the Ikarus drawing method. I've played around with it a bit, but I don't know how close it is to the original since I've never used the Ikarus software. It does feel a bit more direct than working with Beziers.\n\n"
    },
    {
      "time": "11 Dec 2002 — 9:44pm",
      "content": "Ikarus never used Bezier curves. It used what are called Hermite splines: essentially concatenated circular arcs with on-curve control handles. There are [many different kinds of spline curves.](http://web.archive.org/web/20131019061555/http:/mathworld.wolfram.com/Spline.html)   \n   \nFontLab's sketch mode doesn't use genuine Hermite splines. It uses some other kind of spline to approximate their behavior. The difference is subtle but noticeable. A side effect is that you cannot import Ikarus IK data into FontLab. You can download the latest FontLab demo for Mac [here](http://web.archive.org/web/20131019061555/http:/www.fontlab.ch/downloads/FL45MacDemo.hqx) or get the Windows version [here](http://web.archive.org/web/20131019061555/http:/www.fontlab.ch/downloads/FL4WinDemo.exe).   \n   \nTo use actual Hermite splines, you need Ikarus or its successor: what used to be called Ikarus is now reincarnated as DTL IkarusMaster, part of their [FontMaster](http://web.archive.org/web/20131019061555/http:/www.fontmaster.nl/) package. You can also download Mac or PC [demo versions](http://web.archive.org/web/20131019061555/http:/www.fontmaster.nl/DemoDownloads.html) of it as well. Be aware that whereas the full FontLab package will run you about $600 (or $550 without the printed manual), FontMaster is upwards of $2000. I spent some time evaluating FM, and so far I think FontLab is the better choice. I would encourage you to first play with its Sketch mode and see if that gives you back the control that you have missed.   \n   \n I recommend FontMaster _only_ if you have a lot of IK data sitting around, or if you prefer its audit or blend routines to FL.   \n   \nI am still searching for tools that aren't tied down to the outline paradigm. Stroke-based font development offers so many advantages for certain kinds of lettering, especially when it comes to multiple weights. The only packages that implement it thoroughly are the unfortunately non-GUI Metafont and some [rather specialized Japanese packages](http://web.archive.org/web/20131019061555/http:/www.fontworks.com/product_gaiji.html).   \n   \nIn addition to implementing the pen metaphor (dare I say \"moving front\") there is also the punchcutting metaphor. While several digital fonts have made use of punchcutting traditions in guiding their development, I wonder how a modern digital tool might more accurately model those practices, or if doing so would be of any use to a currently practicing type designer.\n\n"
    },
    {
      "time": "11 Dec 2002 — 9:45pm",
      "content": "duplicate post, sorry, please remove :-)\n\n"
    },
    {
      "time": "11 Dec 2002 — 10:59pm",
      "content": "\\> \"honest\" latin-slabs? are you poking fun at me?   \n   \nNo, although \"latin-slab\" could be classified as a Hrantism. It means slab serifs that are angled, or Latin serifs that are sheared, depending on how you look at it. Like this:   \n [http://www.myfonts.com/fonts/parkinson/azuza/medium/windows-postscript/84084/character/006B/CP2/](http://web.archive.org/web/20131019061555/http:/www.myfonts.com/fonts/parkinson/azuza/medium/windows-postscript/84084/character/006B/CP2/)   \n   \nTo me such serifs tend to avoid the mechanical feel of slabs as well as the haughtiness of Latins, conveying a certain austerity, which translates to honesty.   \n   \n\\> serifs improve readability, but only if that's what you're used to reading   \n   \nNo way, dude. Don't believe the hype.   \n   \nFamiliarity is only half the story (and it's not even properly understood). The other half is the human reading \"handware\", and even a cursory considering of empirical as well as anecdotal evidence clearly shows how important serifs are in readability.   \n   \n\\> Stroke-based font development offers so   \n\\> many advantages for certain kinds of lettering   \n   \nYeah, regressive display designs... :-/   \n   \nThe moving front violates Notan, the central priciple of Design. And the smaller the text, the greater the dysfunction of the front. Just look at the outlines of the text fonts of true masters such as Carter, Tracy and Dwiggins. The front is a succubus, and she will bite you in the end (not in a good way either).   \n   \nhhp\n\n"
    },
    {
      "time": "14 Dec 2002 — 4:44pm",
      "content": "Hrant, please understand that I'm talking in terms of design _tools_ and not in terms of design itself.   \n   \nThe \"moving front\" idea is an accurate, solid model for representing most Latin lettering before type arrived. When type appeared, lettershapes started to reflect the physical limitations and artifacts of punchcutting, which in turn became integral to later designs. These serifed designs became the order of the day throughout the Latin-script world by the mid-20th century, and people became accustomed to them and grew to prefer them.   \n   \nThey read them best, and they read them most, one might say. :-)   \n   \nStill, there are plenty of recent designs that are based more directly on calligraphy than on later oldstyle and transitional type. Palatino comes to mind, and it just happens to be the most pirated face in the world. Between 1978 and 1996, students of Gerrit Noordzij (the person Hrant has lately fallen into a pattern of aspiring to disagree with... who proposed the moving front model) output over 120 designs, most of whch are being sold commercially. The list of students includes just about every Dutch type designer who's done business in the past twenty years or so. And they're not all tied to this front metaphor either: his students are independent thinkers in their own right, which I would think was his goal all along.   \n   \nEven not-so-purely-calligraphic type designs ultimately derive from writing as well, and in most cases broad-nib-pen writing. But I also asked about other kinds of tools, particularly based on punchcutting metaphors. (Because I just happened to have recently finished _Counterpunch_ which has been the most enthralling book I've read in years.)   \n   \nYou can use more than one tool, Hrant. It's OK. You're allowed. :-) And please also understand that I'm not interested in modeling simple, unmodulated pen strokes. That's been done and is only useful up to a point, and certainly not adequate for most type design.   \n   \nMore complexity can be automated. The fact that no one has yet done so doesn't negate the possibility, and such tools are the kinds I am interested in. Two graphics packages, namely Microsoft Visio and Creature House Expression formerly from Fractal Design, offer object models (but as yet no built-in primitives) for a more powerful kind of stroke-based vector drawing. Expression is more readily suited to this than Visio, but Visio could be put to similar use with some custom shape programming. You can make a shape scale uniformly in Visio, but you can also make it behave more complexly, e.g. stretching a line of icons to add more icons, or changing its width resulting in the icons scaling uniformly and possibly reducing in number.   \n   \nThe next time I talk about this, it will be with pictures, and not on someone else's time. (Apologies to Julien.)   \n   \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   \n[Jared, please let me use hr tags on typophile!]   \n   \nBack to Ikarus: Julien, I would be curious to hear _your_ opinions as an Ikarus user regarding how well FontLab's sketch mode suits your needs. I'm not accustomed to drawing in Ikarus, but I can say that I have occasionally used the Sketch mode to make fine outline adjustments to letters I found for whatever reason unsatisfying, and I really enjoyed using it. It was much easier to adjust curves with it. I still prefer Beziers for corners and tangents, and I'm still not keen on the idea of converting from one kind of outline to another while still in the design phase.\n\n"
    },
    {
      "time": "14 Dec 2002 — 7:58pm",
      "content": "\\> I'm talking in terms of design tools and not in terms of design itself.   \n   \nBut the tools strongly guide the results (as much as that hurts our control-drunk egos). The moving front is indeed good for understanding the lettering of the past, it's in fact also good for understanding much actual type (although in the same way that a breathalizer is good for understanding why that car crashed happened... :-). As you said, there are very many GN disciples who have made a living making chirographic (hand-based) type. It's funny that some of them actually ridicule Zapf (didn't want to mention that, eh? :-) even though he's 10 times more successful than them. How did that happen? Well, 50,000 Frenchman \\*can\\* be wrong. GN has great charisma, and students are typically ripe for being influenced - free thinkers are rare. When William Morris complained about all the misguided commercial products around him, most people didn't get it either. Chirographic type is an impediment to cultural progress. It limits exploration to the continent we're already on. We need an astrolabe to \\*really\\* explore, and that astrolabe -conveniently ignored by the GN clan- is an understanding of \\*reading\\*, not writing.   \n   \n--   \n   \nI thought you were implying that there should be font design software that lets you define fonts based on strokes, coupled to translation and rotation of the front. Well, ideologically that would violate notan (the unity and relationship between black and white - the heart of design). Practically, it would violate human perception: just look at all those masterful text fonts that people who [would] disagree with GN (I'm not the only one, not by a long shot - although I'm also not masterful...) have produced. Design through outlines is not an engineer's distortion of the craft: it is in fact the true way. Chirographic type is selfish artistry, it is anti-craft.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Dec 2002 — 10:20am",
      "content": "\\> over 120 designs   \n   \nBTW, I'm not doubting it, but I wondering where you got that number - \"Haagse Letters\"? (I'm actually waiting for my copy of that compendium.)   \n   \n\\> his students are independent thinkers in their own right   \n   \nStrike up a functionalist argument with one of them, and you might realize how similar they all are; chances are they'll revert to the familiarity escape clause (the way you're doing?). Familiarity is only half the story (and it's not even understood\\*) - face it, and move forward. Independent? Or maybe uncommitted to considering the relevance of \\*reading\\* and/or the limits of their artistry. There is so much potential in those designers - I hope one day they will start thinking fearlessly, and realize there's so much more to type than expression. GN himself can at least take credit for thinking laterally, against his environment. His students (as a whole) seem entirely conventional to me. Which makes sense considering how dogmatically GN actually expresses himself - never a trace a self-doubt - never questions, only answers.   \n   \n\\* Does familiarity concern individual letters, or boumas? Does it concern letters as structures, or as holistic shapes? How quickly is familiarity gained, for what types of things? All of these central questions are never even \\*asked\\* by those who worship at its altar. Makes sense, I guess: religion cannot really handle inquisition. Art exists for its own sake. But type is less than half art.   \n   \n\\> Counterpunch ... the most enthralling book I've read in years.   \n   \n\"Counterpunch\" is indeed amazing. Strangely enough, it's the book that launched my alphabet reform effort, when I realized that the lc \"a\" in the Latin alphabet is facing the wrong way... Although I later realized that glyph direction is irrelevant during immersive reading. You can see the whole messy development of this most uncomfortable idea of mine in the archives of Typo-L. If you're interested, start here [http://listserv.heanet.ie/cgi-bin/wa?A2=ind9805&L=typo-l&P=R2118&I=-3](http://web.archive.org/web/20131019061555/http:/listserv.heanet.ie/cgi-bin/wa?A2=ind9805&L=typo-l&P=R2118&I=-3) , but be prepared to read through a couple of years... Anyway, what's interesting about Smeijers is how deeply he contradicts himself sometimes: the mark of an artist. And I do admire Quadraat, if for other reasons than Smeijers claims to have intended.   \n   \n--   \n   \nBTW, I don't think I'm/we\\_are hijacking Julien's thread: his essential complaint was concerning non-chirographic type.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Dec 2002 — 9:47pm",
      "content": "\\>religion cannot really handle inquisition   \n   \nok, this is truly off the subject, and i don't expect a response (maybe we can discuss some other place and time), but inquisition merely weeds out untruth, whether in religion or something else.   \n   \nhappy holidays. see you next year.\n\n"
    },
    {
      "time": "11 Dec 2002 — 7:43am",
      "content": "There are indeed different kinds of beziers (even different ones in PS vs TT). What kind does Ikarus use?   \n   \nBut anyway, I have to ask: maybe it's time to rise above handwriting?   \n   \nhhp\n\n"
    }
  ]
}
