{
  "id": "40583",
  "title": "Fonts used by Presidential Candidates 2008",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I found it interesting that a sign on the picture on the [front page of yesterday's New York Times](http://web.archive.org/web/20150218043341/http:/www.nytimes.com/indexes/2008/01/04/todayspaper/index.html) from Barack Obama's campaign was set in Gotham, so I started wondering what fonts all of the candidates are doing.\n\nHere are some general trends I noticed by looking at their websites. All but Edwards use serif fonts for their names in their logos. Clinton and Obama use Gotham pretty much everywhere, and their font usage seems most standardized of all the candidates. Edwards also uses Gotham, but his site uses other fonts too.\n\nI doubt it's a coincidence that Clinton, Obama and Edwards all use Gotham, but no other candidates seem to have decided to use the same font as each other. (At least two others are using Helvetica, but that could have been a coincidence.)\n\nI was hoping to find cooler trends, but I didn't. Maybe someone else who's bored will find this interesting and look for some more.\n\nI'm also wondering whether anyone has _consciously_ taken the quality of the design of the candidates' campaign materials in selecting whom to vote for.\n\n",
  "author": "Thomas Levine",
  "time": "5 Jan 2008 — 1:32pm",
  "uid": "19606",
  "comments": [
    {
      "time": "5 Jan 2008 — 2:00pm",
      "content": "Obama's is the most interesting and thoughtful logo by far, but yeah, his materials use Gotham just like the others. It's too bad that the candidates' campaigns would miss this opportunity to set themselves apart. Still, as much as I'm opposed to homogeneity, Gotham is not a bad choice for a U.S. candidate. It's much more American than Helvetica.\n\n"
    },
    {
      "time": "5 Jan 2008 — 3:08pm",
      "content": "I would deeply mistrust an us-american presidential candidate who would use Dolly or Auto from Underware, you know what i mean … hehe\n\n"
    },
    {
      "time": "5 Jan 2008 — 3:37pm",
      "content": "for reference\n\n ![](http://web.archive.org/web/20150218043341im_/http:/typophile.com/files/demo_4796.jpg)\n\nanother version of Obama's\n\n ![](http://web.archive.org/web/20150218043341im_/http:/typophile.com/files/barack-obama-logo_5816.jpg)\n\nprevious iteration for Edwards in Futura Extra Bold\n\n ![](http://web.archive.org/web/20150218043341im_/http:/typophile.com/files/sedwards2008_3692.gif)\n\nlarger version of the front pages:\n\n[http://www.agency26.com/demo.large.jpg](http://web.archive.org/web/20150218043341/http:/www.agency26.com/demo.large.jpg \"http://www.agency26.com/demo.large.jpg\")\n\nOne of the other fonts for Edwards is Gill Sans ... looks very ordinary and generic.\n\nhas someone identified the fonts used by Hillary and Obama?\n\n"
    },
    {
      "time": "5 Jan 2008 — 3:53pm",
      "content": "Ahh, looks like Hillary is using Avenir on her site, not Gotham.\n\n"
    },
    {
      "time": "5 Jan 2008 — 4:45pm",
      "content": "Previously: [Obama '08?](http://web.archive.org/web/20150218043341/http:/www.typophile.com/node/31338)\n\n"
    },
    {
      "time": "5 Jan 2008 — 5:22pm",
      "content": "_Ahh, looks like Hillary is using Avenir on her site, not Gotham._\n\nI hadn't really looked at Avenir before, but now I have, and it looks like that to me too. The most obvious difference is in the punctuation. I was surprised that a font designed for GQ magazine would also be used for a presidential campaign, but I hadn't realized how popular Gotham is.\n\n"
    },
    {
      "time": "5 Jan 2008 — 11:57pm",
      "content": "Gotham isn't GQ. It's everyman. Perfect for someone trying to appeal to an entire nation.\n\n"
    },
    {
      "time": "6 Jan 2008 — 5:33am",
      "content": "I must say that Gotham is a great typeface! Even europeans like myself love the look & feel. Great job by H&FJ\n\n"
    },
    {
      "time": "6 Jan 2008 — 6:40am",
      "content": "Also previously: [NYT comic on campaign logos](http://web.archive.org/web/20150218043341/http:/www.typophile.com/node/39403)\n\n"
    },
    {
      "time": "6 Jan 2008 — 9:34pm",
      "content": "Typography may be a strong point for Obama, but Topography is not... screen grab I took last Thursday...\n\n ![](http://web.archive.org/web/20150218043341im_/http:/typophile.com/files/Capture_5002.JPG)\n\nMaybe he's a Skins fan too?\n\nI reported it and it's fixed - but now I'm on the mailing list :-(\n\nCheers, Si\n\n"
    },
    {
      "time": "7 Jan 2008 — 10:52am",
      "content": "I drove through Iowa this weekend, a few days after their primary. There were still many campaign signs up, so we got a good look at the variations.\n\nI got to say, that EDWARDSO8 all jammed together, does not work very well. Particularly in the 1-color version we saw, white type on a deep blue field. Speeding by it on an Interstate or puttering by it down a farm road, it was not reading very well. Cheryl asked: \"Does it say 'EDWARD SOB' \"? Last time out, when Edwards was running for veep with John Kerry, the signs looked like they were pimping for a guy named \"Kerry Edwards,\" and in fact some reporters dug up folks with that name. Now it looks like someone's mad at some guy name Edward who is a son of a b\\*\\*\\*\\*. No wonder this guy lags today in New Hampshire.\n\nObama's O logo looks amazingly like the logo for a church which I assume to be a conservative Christian church in northern Iowa. Drove by in bad weather too fast for a photo. But I know it pre-dates O's run for the top job.\n\nOh, well. Just keep in mind that type and design are not very good criteria when you must decide for whom you shall vote.\n\npowers\n\n"
    },
    {
      "time": "7 Jan 2008 — 11:16am",
      "content": "I think Mountain Dew have jumped on the Gotham 2008 bandwaggon too - [http://www.dewmocracy.com/](http://web.archive.org/web/20150218043341/http:/www.dewmocracy.com/ \"http://www.dewmocracy.com/\")\n\n"
    },
    {
      "time": "7 Jan 2008 — 11:31am",
      "content": "Looks like Gill to me.\n\n"
    },
    {
      "time": "7 Jan 2008 — 11:32am",
      "content": "oops\n\n"
    },
    {
      "time": "9 Jan 2008 — 12:12am",
      "content": "@Sii: about topography: I don’t think you can modify the font used on the map that easily. I’m curious as to why they used Myriad (or, the reason why the default map typeface was set to that.)\n\nAlso, I think you meant to say that Dewmocracy “jumped on the Obama 2008 bandwagon,” yes? Because the site’s font is Gill :-)\n\nI had actually [attempted to type-ID](http://web.archive.org/web/20150218043341/http:/linkenfuego.wordpress.com/2008/01/04/q-have-anyone-on-the-internet-identified-the-fonts-that-the-2008-presidential-candidates-used-in-their-campaign-logos-side-by-side/) all of the 2008 presidential campaign logo a day before this topic was started—with moderate level of success. I believe that I was right in most of them, but I’m nowhere as typographically geeky as all you guys, so kindly drop a line if I was wrong.\n\n"
    },
    {
      "time": "9 Jan 2008 — 12:22am",
      "content": "Nice rundown, bram. Almost got 'em all.\n\nSide note: some of the poor second-tier candidates couldn't afford real apostrophes on their '08.\n\n"
    },
    {
      "time": "9 Jan 2008 — 7:15am",
      "content": "\\>I don’t think you can modify the font used on the map that easily.\n\nSorry I wasn't clear, I was complaining about the map not the type - the map on the Obama WA page was of \"Washington DC\" not \"Washington State\".\n\n"
    },
    {
      "time": "9 Jan 2008 — 8:03am",
      "content": "Thanks, Stephen. I’m willing to guess that those designers probably used whatever smart quote feature is present in their design program without first checking a writing manual ;^)\n\n@sii: oops. I should’ve seen the picture of the state before assuming anything :)\n\n"
    },
    {
      "time": "9 Jan 2008 — 8:04am",
      "content": "_I’m also wondering whether anyone has consciously taken the quality of the design of the candidates’ campaign materials in selecting whom to vote for._\n\nI think [this](http://web.archive.org/web/20150218043341/http:/www.theonion.com/content/video/poll_bullshit_is_most_important) is the sad but true reality.\n\n"
    },
    {
      "time": "9 Jan 2008 — 7:41pm",
      "content": "Oh, [the good guys at 37signals were right](http://web.archive.org/web/20150218043341/http:/www.37signals.com/svn/posts/770-commandshift3-voters-rank-the-designs-of-candidate-sites), “The most functional sites probably don’t win a lot of sleek home page contests.”\n\n"
    },
    {
      "time": "10 Jan 2008 — 12:27am",
      "content": "American political design is all about looking as middle-of-the-road as possible. Even Lee L. Mercer Jr. ( [http://www.mercerforpresident2008.com/](http://web.archive.org/web/20150218043341/http:/www.mercerforpresident2008.com/ \"http://www.mercerforpresident2008.com/\")) seems like a legitimate candidate with his patriotic (albeit a bit low budget) header, until you start reading his schizophrenic rants.\n\nTypophile members from countries other than the U.S.: what's the design like for political candidates in your country?\n\n"
    },
    {
      "time": "3 Feb 2008 — 10:10pm",
      "content": "Spot on: [Is Obama a Mac and Clinton a PC?](http://web.archive.org/web/20150218043341/http:/www.nytimes.com/2008/02/04/technology/04link.html)\n\n"
    },
    {
      "time": "4 Feb 2008 — 6:56am",
      "content": "So Obama is going to to get 6% of the vote and Hillary 90%?\n\nWho's Linux?\n\n"
    },
    {
      "time": "4 Feb 2008 — 8:06am",
      "content": "\\>Who’s Linux?\n\nRon Paul, obviously…\n\n"
    },
    {
      "time": "4 Feb 2008 — 8:28am",
      "content": "Huckabee is Basic. Dude doesn't even believe in evolution.\n\n"
    },
    {
      "time": "4 Feb 2008 — 9:30am",
      "content": "Surely Ron Paul is the Amiga\n\n"
    },
    {
      "time": "4 Feb 2008 — 9:33am",
      "content": "_Typophile members from countries other than the U.S.: what’s the design like for political candidates in your country?_\n\nPretty turgid -- we're likely going to have a provincial election called here today or tomorrow, so I'll post pix of what shows up in our 'hood.\n\n"
    },
    {
      "time": "4 Feb 2008 — 9:54am",
      "content": "_Typophile members from countries other than the U.S.: what’s the design like for political candidates in your country?_\n\nDemocracy is a bit different here in Germany. We don’t elect candidates for president (since we don’t have a president as the executive). We elect political parties. All parties have been using quite sophisticated corporate designs lately.\n\nCDU (biggest conservative party) uses FF Kievit as corporate typeface (custom version).  \nSPD (biggest socialist party) uses The Sans.\n\n"
    },
    {
      "time": "4 Feb 2008 — 10:05am",
      "content": "In The Netherlands we don't vote for a person (e.g. president) either. We elect political parties as well. What typefaces they use I dont know from memory, but a couple of parties are [SP](http://web.archive.org/web/20150218043341/http:/www.sp.nl/) (a condensed Univers or Helvetica), [PvdA](http://web.archive.org/web/20150218043341/http:/www.pvda.nl/) (apart from the logo, not very consistent. I've seen multiple typefaces, like Scala Sans) and [CDA](http://web.archive.org/web/20150218043341/http:/www.cda.nl/) (also doesn't seem to be really consistent, apart from the logo). But I'm sure they all have official typefaces for their visual identity.\n\n"
    }
  ]
}
