{
  "id": "40587",
  "title": "Type Critique: Weka",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi,\n\nHere is a lowercase alphabet I've been tinkering with in my spare time. I intend this to be used for text/copy. Would love to get some feedback as I'm pretty rusty at this game.\n\nAll comments appreciated!!\n\nashton\n\n| Attachment | Size |\n| --- | --- |\n| [weka v1.pdf](http://web.archive.org/web/20150417141159/http:/typophile.com/files/weka%20v1.pdf) | 24.17 KB |\n\n",
  "author": "ashton",
  "time": "5 Jan 2008 — 3:32pm",
  "uid": "25500",
  "comments": [
    {
      "time": "6 Jan 2008 — 1:07pm",
      "content": "Stroke variation reminds me of Elekctra that's somehow blended with Slimbach's style. There's also quite some \"peaking\" at Scala serif. To some degree.\n\nI like it a lot.\n\nBut I think that \"j\" is too heavy on the curve.\n\nOtherwise. Continue of course...\n\n"
    },
    {
      "time": "7 Jan 2008 — 7:39pm",
      "content": "Oh I like the feel this has. The roundness combined with the kinks.  \nCouple of things that come to mind:\n\nI think the kink in the lower right corner of the **b** might have been placed a bit too low. The bowl is being 'pulled' to the lower right, as if it's being ripped of the stem. The lower curve of the **j** is indeed too heavy.  \n**h/m/n/u** , I think the transition from the shoulders (round) to the stems (straights) could be a bit more subtle or smooth (a less direct change in direction, if you know what I mean).  \n**p/q/r** , usually the serifs on the side of the bowls/ear is a bit longer than the ones on the other side; that way they 'carry' the load as it were. Also the ear of the **r** could be a bit too long, and might start lower on the stem and extend into a tad more heavy terminal.  \nThe **s** seems to be too light, and also very slightly tips over to the right.  \nThe **t** looks like it could use some love, it looks less defined as other characters. The **z** looks too heavy, but it might be ok in text. I don't think the terminal of the **y** fits very well in the design, look at those of the 'f' and the 'r'.\n\nIf you include a couple of lines of text in a future sample, people can probably give more contructive critique. :) But I hope this helps. I like the characteristics this design has alot.\n\n"
    },
    {
      "time": "8 Jan 2008 — 6:06pm",
      "content": "i like it. i may get crucified for saying so, but it has a feels similar to much of kris sowersby's work. is this part of a kiwi aesthetic that we're just starting to see in the West? if so, i hope we see more of this.\n\nfirst remarks: this seems a bit light for text usage. what are you intending this for primarily? it looks great large. i love the broken strokes, they seem to be becoming very trendy, would love to see how they play out in this.\n\nminutiae: love the a. watch your bowls on bdpq: b seems narrow compared to d. c and e seem wide. the f seems a bit broken. the counters on the g seem too large with not much breathing space in between. i disagree and disagree with Jelmar on hmnu: you should either make your joins smoother or more disjointed, i'd opt for more broken. r feels a bit weak. s may be a bit too narrow, same with t. the tail of the y feels like an unfinished thought and the tail of the j to a lesser extent. the crotches on hmnrp feel a bit too shallow, these could be a bit more dynamic.\n\noverall a very nice start! keep up the good work.\n\n"
    },
    {
      "time": "10 Jan 2008 — 8:31am",
      "content": "Ditto on the Electra comparison, to the extent that the \"kink\" in the Electra lowercase g is implemented across the entire alphabet by way of that \"pen-formed\" aesthetic that seems to be cropping up more and more frequently lately. I'm kind of infatuated with it, actually. This is a great start.\n\n"
    },
    {
      "time": "10 Jan 2008 — 6:27pm",
      "content": "I would use that! You're 90% there I think! :)\n\n"
    },
    {
      "time": "10 Jan 2008 — 10:21pm",
      "content": "I like it a lot... although I would prefer a more blacker color.\n\nI love hyper-modulated type!!!!\n\nMikey :-)\n\n"
    },
    {
      "time": "11 Jan 2008 — 6:03pm",
      "content": "Yes, really digging the broken, disjointed strokes. I think that it's more effective on letters like \"f,\" where it's a bit more obvious, than in some of the places where it's more subtle and could potentially be mistaken for a visible anchor point. Basically what Paul is saying, embrace the disjointed aesthetic. I think the \"y\" is really, really beautiful. A superb start! Can we see it in text soon?\n\n"
    },
    {
      "time": "11 Jan 2008 — 9:04pm",
      "content": "Darrin, the y is one of the few glaring problems IMO. The tail is out of character for the face. One man's trash is another man's treasure I guess. Trash, probably too harsh :-) I like the overall impression too. Reminds me of Miguel Hernandez' Quetzal on these forums 3-4 years ago.\n\n"
    },
    {
      "time": "12 Jan 2008 — 6:04pm",
      "content": "I agree that the loweercase y is the weakest link\n\n"
    },
    {
      "time": "12 Jan 2008 — 7:51pm",
      "content": "_...i may get crucified for saying so, but it has a feels similar to much of kris sowersby’s work. is this part of a kiwi aesthetic that we’re just starting to see in the West? if so, i hope we see more of this._\n\nProbably we will see more of it, but it won't catch on in a major way or will be of limited spread. I think it's an international trend in type design rather than one confined to New Zealand.\n\n@Paul: _minutiae: love the a. watch your bowls on bdpq: b seems narrow compared to d. c and e seem wide._\n\nCareful now, let's not knock the life out of it before it's had a chance to grow on us. This sort of bowl letter width variation is common to many recent (and old) fonts we set great store by. The main difference here is that Matt's creation has not succeeded---yet.\n\n@Randy: _...the y is one of the few glaring problems IMO. The tail is out of character for the face..._\n\nYes. But is that really a problem, or a blessing? Is integration of form the be-all and end-all in typeface design? For me integration is behind most design decisions when making a face. Other type designers may not see it that way and should be encouraged to make their own decisions.\n\n@Darrin: _...I think that it’s more effective on letters like “f,” where it’s a bit more obvious..._\n\nIt's been on \"f\" for centuries.\n\nj a m e s\n\n"
    },
    {
      "time": "13 Jan 2008 — 5:36pm",
      "content": "_Other type designers may not see it that way and should be encouraged to make their own decisions._\n\nwhich is great, really. that's what's so awesome about posting to the critique forum is that you (hopefully) get all kinds of conflicting advice that makes you consider things you might not have and force you to be more deliberate in the choices you make in realizing your typeface.\n\n"
    },
    {
      "time": "13 Jan 2008 — 9:55pm",
      "content": ": ^ )\n\nmew-mew!  \n(this is good)\n\nType design is really philosophy _conrete_.\n\nj a m e s\n\n"
    },
    {
      "time": "15 Jan 2008 — 7:50am",
      "content": "And in that spirit:\n\nThis has some traits that are not commonly seen and therefore welcome. There is a generous width to certain characters that reminds me of Diotima somewhat. Nice! Along with that is a brushy feel that gives a whiff of Oz Cooper's hand lettering. Very nice! Long serifs, small eye in a and e, all nice, distinctive touches.\n\nThe spacing needs to be refined; it's uneven, but should not be tighter or looser, just more consistent.\n\nNot sure the trendy sharp cuts in the counters are in the right places however. Look at c, e, g, s. In s and f especially those cuts are creating a weak spot (as mentioned above).\n\nGiven the other, desirable influences that appear here, consider whether the cuts belong at all; or at least reconsider where they are. I am skeptical at this point, having seen them everywhere lately. Make sure you know how to use them.....\n\nThere seem to be principles with letter design that make bends or sharp angles highly functional in certain places (a, s, c terminals), and very distracting in other places. Observe how this affects a typeface's performance in reading. It's those distracting bits that mar otherwise good readable faces.\n\n"
    },
    {
      "time": "15 Jan 2008 — 4:17pm",
      "content": "Might just be the PDF, but j, r, t, u, w and z all look proportionally a bit too dark (the main strokes), especially j.\n\nf ligs?\n\n"
    },
    {
      "time": "16 Jan 2008 — 6:59am",
      "content": "Roman type with kinks or fractures on the inside seem to have originated from calligraphic technique. Canadian letterpress man and type veteran Jim Rimmer has hewn a few in digital form. These may be of interest:\n\n[---Lapis---](http://web.archive.org/web/20150417141159/http:/www.myfonts.com/fonts/rimmer/lapis/)  \n [---Lancelot Title---](http://web.archive.org/web/20150417141159/http:/www.myfonts.com/fonts/rimmer/lancelot-title/)\n\nj a m e s\n\n"
    },
    {
      "time": "16 Jan 2008 — 4:12pm",
      "content": "I think it's actually nice to see another serif with the kink-treatment. There has been a excellent serif with such kinks on the forums [once before](http://web.archive.org/web/20150417141159/http:/dev.typophile.com/kompilat). And there is also [Suite Serif](http://web.archive.org/web/20150417141159/http:/www.textaxis.com/img/posters/suse_pos.gif) on textaxis. And I'm working on a sans for a while now which has the kinks too. And I know of another sans which has it, but I can't remember its name and I can't locate the bookmark. But it does seem to be somewhat of a popular feature. Luckily it's a nice feature! ;)\n\n"
    },
    {
      "time": "17 Jan 2008 — 8:20am",
      "content": "Some weights and styles of [Freight](http://web.archive.org/web/20150417141159/http:/www.joshuadarden.com/shop/freightdisplay.php) sort of have the kink feature going for them. The display italic, particularly.\n\n"
    },
    {
      "time": "23 Jan 2008 — 11:23am",
      "content": "Sorry, but what is the \"kink\" feature?\n\nI like these forms, I see them with quite character, without necessarily a specific single influence.\n\nAs it has been said, it may need some refinement, and of course you should see how it works as a whole with more words setting.\n\n"
    },
    {
      "time": "24 Jan 2008 — 5:35am",
      "content": "The \"kink\"s in this case are the corners, so to speak, on the inside outline of a counter, where a node has been placed and the bezier handles are \"broken\". Oftentimes these kinks are meant to emulate a kind of brush-formed style, or else are placed in such a way as to mimic the normal stress/modulation of a pen-formed letter. In Weka, you can see it in the c, p, q, s, etc.\n\nTheir attractiveness, I think, comes from the tension they bring to a given form — continuous curve outside, discontinuous curve inside. In this way, (and I don't know if I'm alone on this) Ad Lib is sort of a caricature of the style in the same way Bell Gothic is a caricature of the concept of the ink trap.\n\n"
    },
    {
      "time": "24 Jan 2008 — 11:10am",
      "content": "Thank you. Well, I entirely agree on the attractiveness brought by them.  \nOne of the earliest examples of such stylizations I have seen (and very good too), is in a typeface by Aldo Novarese (which does not exist in digital format).  \nHe married the proportions of Roman inscriptions with the overall feel of a \"drawn\" sans-serif.\n\nI can't see how you could relate Ad Lib to this, anyway. It looks to me as informal \"paper-cut\" lettering.  \nI do not think Bell Gothic was meant as a caricature: it was designed by Carter to withstand bad printing conditions and the exaggerate look of these features comes from this, right?\n\n"
    },
    {
      "time": "24 Jan 2008 — 12:17pm",
      "content": "Perhaps caricature isn't the right word (I hadn't yet had coffee when I wrote all that!) and I didn't mean to make it sound like Bell Gothic was strictly a caricature. I more meant that if you were to ask \"What typeface takes the concept of the ink trap to its logical extreme?\" my answer would be Bell Gothic. Similarly, if you were to ask me \"What typeface takes the concept of this inner/outer tension to its logical extreme?\" the best answer I could give would be Ad Lib (I know, it's pretty weak), since, nutty and papercut though it may be, almost all it's outsides are curved, and almost all it's insides are optically rectangular. I can't think of a typeface that takes this same approach but does it rationally or seriously to the hilt.\n\nWhat was that Novarese face called?\n\n"
    },
    {
      "time": "24 Jan 2008 — 2:22pm",
      "content": "I think you're on to something. My immediate reaction is that the bowl on the \"a\" is a little smushed. It's a serious lo-rider. Also, the descender on the \"j\" is a bit heavy. Still, stylish and close to functional.\n\n"
    },
    {
      "time": "29 Jan 2008 — 8:53pm",
      "content": "Hi\n\nThanks a heap for the feedback. Very much appreciated.  \nI think before I go any further I need to invest in some better type software as I'm currently using illustrator.\n\nSo hopefully I'll post again soon with your feedback in mind.\n\nCheers\n\na\n\n"
    },
    {
      "time": "2 Feb 2008 — 6:15pm",
      "content": "Hey! great work,\n\nI like it!\n\nI have some constructive comments to add:\n\n\\*I think the \"j\" might be too bold at the bottom\n\n\\*The \"g\" tail maight be too light (comparing it with the \"j\" or the \"y\")\n\n\\*The \"s\" \"falls\" to the left, you could try keeping it more balanced by adjusting the lower part of the \"s\" more to de left. I think is a little bit light and it could be wider.\n\n\\*The \"z\" is thin at the bottom and bold on the top, try to level it\n\nHope i'd helped!\n\nKeep up the good work, i want to see it finished\n\nFerch\n\n[Tipografía-Montevideo](http://web.archive.org/web/20150417141159/http:/www.tipografia-montevideo.info/)\n\n"
    },
    {
      "time": "6 Feb 2008 — 12:15pm",
      "content": "I understand what you say, Eric, however Ad Lib comes from different premises.  \nCalcite by Akira Kobayashi looks as an extreme stylization of this feature, while mantaining the premises.\n\n<cite>What was that Novarese face called?</cite>  \nIf I'm able, I hope to show it in the other thread, [here](http://web.archive.org/web/20150417141159/http:/typophile.com/node/41687#comment-256822).\n\n"
    },
    {
      "time": "7 Feb 2008 — 2:24pm",
      "content": "This font has a very nice feel to it. I especially like the \"a\" but it's got a character all its own (pardon the pun). Maybe lift the bowl of the \"a\" for this font and build a new font where the \"a\" fits in a little better. This definitely has potential. I really like it a lot!\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:10pm",
      "content": "While this is a small part preference, I feel the two-side serifs on the \"h\" and such contrast with the half-serifs on the \"a\" and such. Might I recomend disbalancing the two-side serifs so the left side is only, let's say, two thirds the size of the right?\n\n"
    },
    {
      "time": "8 Feb 2008 — 6:21am",
      "content": "I love the terminus of the lowercase a. The tops of the m and n appear a little flat in comparison to the b, c, d, o etc.\n\nI want to say it's Rolling Stone magazine that often uses body copy in a similar typeface, but don't quote me on it.\n\nI'm a fan.\n\n"
    },
    {
      "time": "28 Feb 2008 — 6:27pm",
      "content": "I think it's very nice. lowercase a reminds a little of Centaur (maybe it's the bowl) but yes. Very nice job!\n\n"
    },
    {
      "time": "15 May 2008 — 4:07am",
      "content": "I would like to see a bigger-counter-\"a\", otherwise it really stands out as if it does not belong to the group. I like it anyway because it is really legible in small size. Can you make more samples? Add oil =)\n\n"
    }
  ]
}
