{
  "id": "40586",
  "title": "Punctuation?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,\n\nI'm wondering if anyone could point me in the direction of any discussions happening based on punctuation? I've used the search engine/typowiki/resources section of this site and unearthed a thread or two which have been a good insight.\n\nGoogle has not been my friend is this research instance, throwing up more pages aimed at how to use it properly as opposed to why we use it, how it could be changed and so forth. I've dug out a fair few of my type books including 'Hart's rules for Compositors and Readers' from the Oxford University press, which in some instances says when setting type leave the problem of punctuation to the author!\n\nI really want to know as a designer what other people are thinking about punctuation, why it has become so throw away, how can it be changed and adapted to suit our modern ways of communicating? How can we use typography to further emphasise the emotional qualities of the written word?\n\nIt's a research idea I've had rattling around my head since my uni days so I thought I'd come here and see if some could shed some further light on the topic.\n\nBec\n\n",
  "author": "<a href=\"/web/20110408235832/http://typophile.com/user/23308\" title=\"View user profile.\">Redbec</a>",
  "time": "<br>",
  "uid": "23308",
  "comments": [
    {
      "time": "",
      "content": "What you want is to join COPYEDITING-L.\n\nSend an email to [listserv@listserv.indiana.edu](mailto:listserv@listserv.indiana.edu) with a blank subject line, and a note that says \"sub COPYEDITING-L yourname\" (without the quotations and write out your name where it says \"yourname\"). It is fairly high-traffic, but a great list.\n\nIf there's a spot that will have this discussion, that'll be the place.\n\n"
    },
    {
      "time": "",
      "content": "ilovetypography.com had a good article on the correct use of an apostrophe that I found interesting.\n\n[http://ilovetypography.com/2007/10/31/the-apostrophe-contrary-to-popular...](http://web.archive.org/web/20110408235832/http:/ilovetypography.com/2007/10/31/the-apostrophe-contrary-to-popular-belief-it-doesnt-swing-both-ways/ \"http://ilovetypography.com/2007/10/31/the-apostrophe-contrary-to-popular-belief-it-doesnt-swing-both-ways/\")\n\n"
    },
    {
      "time": "",
      "content": "_How can we use typography to further emphasise the emotional qualities of the written word?_\n\nWhy would we want to? It seems to me that if you want to employ emotional markup, then you need something other than punctuation as we have inherited it, because punctuation is doing a different and important job: it is marking the _structure_ of text, and thereby helping us to avoid ambiguity of meaning and to communicate thoughts effectively.\n\nOf course, people use the bits and pieces of typographic punctuation to make emoticons such as ;) but that's using punctuation signs for something other than punctuation. That's fine, but you shouldn't confuse the two things: punctuation, which indicates structure (very precisely), and emoticons, which indicate emotions (very crudely).\n\n"
    },
    {
      "time": "",
      "content": "Karl Kraus put it a bit more drastic:  \n<cite>Ein armseliger Hohn, der sich in Interpunktionen austobt und Rufzeichen, Fragezeichen und Gedankenstriche als Peitschen, Schlingen und Spieße verwendet.</cite>\n\n[A miserable fool, he who exhausts himself on punctuation and uses exclamation marks, question marks and dashes as whips, springes and spears.]\n\n"
    },
    {
      "time": "",
      "content": "Do you know [‘Fisches Nachtgesang’](http://web.archive.org/web/20110408235832/http:/christian-morgenstern.de/dcma/Fisches_Nachtgesang) [The Night Song of the Fish] by Christian Morgenstern? It is said to be ‘the deepest poem in German language’ …  \n;°)\n\nAnd, of course, check out John Harris: _Punctuation Personified, Or Pointing Made Easy By Mr. Stops_, a charming old children's book. There used to be an online version, but that seems to have disappeared. Still, you can have a look at it via the [wayback machine](http://web.archive.org/web/20110408235832/http:/web.archive.org/web/20070117115231/http:/www.make-believe.org/punctuation/) –&nbsp;unfortunately the text there got black on black; in order to read you have to ‘select all’.\n\n"
    },
    {
      "time": "",
      "content": "Thank you for your pointers, sorry for not getting back to you all sooner, I have tonsillitis and a stinking cold right now but the lure of the web is too strong!\n\nFlorian, I don't know of the 'Fisches Nachtgesang' but I have come across the John Harris book in my preliminary research.\n\nJohn, maybe we need to move on with English language and try to adapt a new stance towards providing emotion to the written. My head hurts too much right now to think about it in depth but with so many people having so much disregard for the rules of language maybe a system that is made 'easier'(I mean that in a very loose sense) or accessible to everyone, even a universal set of rules. I don't know, it is such a huge subject!\n\nEmotion cons are an area that could be defined as a way of expressing yourself but then everyone needs to be clued up on every possible combination that exists, I'm not even sure they do enough of a job of getting the point across in some situations.\n\nThanks though, I'm off back to my bed with a lemsip and some essays I've just found :)\n\nBec\n\n"
    }
  ]
}
