{
  "id": "40598",
  "title": "Please translate in your native language",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello Typophilers,\n\nI’m working on a new website (and new typefaces) for the CakeType collection. I like to use recipes of a (chocolate) cakes as faketext. Can you help me by translating the following line into the language you speak?:\n\nIn a separate bowl whisk the egg yolks with the remaining sugar for one minute using the electric mixer.\n\nI’m looking for Greek, Cyrillic and Latin based languages.\n\nThank you very much in advance!\n\nPieter\n\n [‹ TypeCon2008 Calls for Submissions for Speakers](http://web.archive.org/web/20081123033706/http:/www.typophile.com/node/40915 \"Go to previous forum topic\") [Any text faces being designed now with contextual alternates to improve fit? ›](http://web.archive.org/web/20081123033706/http:/www.typophile.com/node/40729 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081123033706/http://www.typophile.com/user/5585\" title=\"View user profile.\">Pieter van Rosmalen</a>",
  "time": "<br>",
  "uid": "5585",
  "comments": [
    {
      "time": " 6.Jan.2008 10.07am",
      "content": "Norwegian would be: “Bland eggeplommene og resten av sukkeret i en separat bolle i mixmasteren i ett minutt.”\n\n"
    },
    {
      "time": " 6.Jan.2008 10.22am",
      "content": "Finnish version goes like this:  \n“Vatkaa jäljelle jäänyt sokeri ja munankeltuaiset erilisessä kulhossa sähkövatkaimella minuutin ajan.”\n\n"
    },
    {
      "time": " 6.Jan.2008 11.05am",
      "content": "Russian:\n\nВ отдельной чашке сбейте яичные желтки с оставшимся сахаром одну минуту в электрическом миксере.\n\n"
    },
    {
      "time": " 6.Jan.2008 11.27am",
      "content": "and french:  \nBattre pendant une minute les jaunes d’œuf et le reste du sucre dans un autre bol, avec un mélangeur électrique.\n\n"
    },
    {
      "time": " 6.Jan.2008 11.57am",
      "content": "German:\n\nIn getrennter Schüssel schlagen Sie eine Minute lang, mit dem elektrischen Mixer, die Eigelbe mit dem restlichen Zucker auf.\n\n"
    },
    {
      "time": " 6.Jan.2008 12.53pm",
      "content": "In German:  \nMan verquirle das Eigelb mithilfe eines Elektromixers in einer gesonderten Schüssel eine Minute lang mit dem restlichen Zucker.\n\n[edit: Sorry, I didn’t see your post, Nora. Wasn’t meant to be a suggestion for improvement –&nbsp;now you have two versions, Pieter]\n\n"
    },
    {
      "time": " 6.Jan.2008 1.01pm",
      "content": "Spanish:\n\nEn otro recipiente, usando la batidora eléctrica, bata durante un minuto las yemas de huevo con el azúcar restante.\n\n"
    },
    {
      "time": " 6.Jan.2008 2.49pm",
      "content": "Dutch:\n\nRoer het eigeel met de resterende suiker in een aparte kom met een elektrische (staaf)mixer.\n\n"
    },
    {
      "time": " 6.Jan.2008 3.07pm",
      "content": "Slovak:\n\nV samostatnej miske jednu minútu šľahajte elektrickým mixérom žĺtky so zvyšným cukrom.\n\n"
    },
    {
      "time": " 7.Jan.2008 4.18am",
      "content": "Thank you very much all!\n\nPieter\n\n"
    },
    {
      "time": " 7.Jan.2008 7.01am",
      "content": "If there are more people who like to translate the line into their native language, please do!\n\nPieter\n\n"
    },
    {
      "time": " 7.Jan.2008 10.49am",
      "content": "Italian:\n\nSbattete per un minuto con il frullatore i tuorli, insieme al resto dello zucchero, in una tazza a parte.\n\n"
    },
    {
      "time": " 7.Jan.2008 11.46am",
      "content": "Danish:\n\nI en separat skål piskes æggeblommerne sammen med resten af sukkeret i et minut, ved hjælp af en elektrisk håndmikser.\n\n"
    },
    {
      "time": " 7.Jan.2008 3.54pm",
      "content": " Yiddish is technically a European language, right? ☺\n\nאון א באזונדערן שוסל, שלאג צאם די געליכלעך מיט די צוקעד מיט אן עלעקטראנישער מיש־מאשין.\n\n—Joel\n\n"
    },
    {
      "time": " 8.Jan.2008 4.02am",
      "content": "Well, Yiddish is spoken in every country, so thanks!\n\n"
    },
    {
      "time": " 8.Jan.2008 5.44am",
      "content": "Swedish/Svenska\n\nVispa äggulorna i en separat skål tillsammans med resten av sockret i en minut med hjälp av en elvisp.\n\nClaus/Denmark & John/Norway: Don’t you think the text refers to an el-pisker/elvisp rather than a håndmikser/mixmaster? Feel free to say something rude about swedes if I’m wrong.\n\n"
    },
    {
      "time": " 8.Jan.2008 7.17am",
      "content": "Does Yiddish use the Hebrew script?\n\nChrisL\n\n"
    },
    {
      "time": " 8.Jan.2008 7.37am",
      "content": "Hello Chris,\n\nYes it does:  \n [http://en.wikipedia.org/wiki/Yiddish](http://web.archive.org/web/20081123033706/http:/en.wikipedia.org/wiki/Yiddish \"http://en.wikipedia.org/wiki/Yiddish\")\n\nPieter\n\n"
    },
    {
      "time": " 8.Jan.2008 8.53am",
      "content": "Thanks!\n\nChrisL\n\n"
    },
    {
      "time": " 8.Jan.2008 9.02am",
      "content": "_Don’t you think the text refers to an el-pisker/elvisp rather than a håndmikser/mixmaster?_  \n“Mixmaster” is the slang for “elvisp” in Norwegian. Probably because there was a brand named “Mixmaster” when electric mixers was introduced? Great branding if that is the case. “Hjulvisp” and “visp” is what we call the none electric ones.  \nI think you overlooked that Claus wrote “_elektrisk_ håndmikser”.\n\n_Feel free to say something rude about swedes if I’m wrong._  \nYou know we call you Swedes “søta bror” (sweet/nice brother), no worries about any rudeness.\n\n"
    },
    {
      "time": " 8.Jan.2008 10.58am",
      "content": "Basque:\n\nBeste katilu batean, gainontzeko azukrearekin gorringoak irabiatu minutu batez, irabiagailu elektrikoa erabiliz.\n\n"
    },
    {
      "time": " 8.Jan.2008 11.33am",
      "content": "Here’s a translation into LOL Cat ...\n\n“I made you a cake, but I eated it”\n\n[http://icanhascheezburger.com/2007/01/15/i-made-you-a-cookie/](http://web.archive.org/web/20081123033706/http:/icanhascheezburger.com/2007/01/15/i-made-you-a-cookie/ \"http://icanhascheezburger.com/2007/01/15/i-made-you-a-cookie/\")\n\n"
    },
    {
      "time": " 8.Jan.2008 1.27pm",
      "content": "Here’s one into ’ [In soviet Russia...](http://web.archive.org/web/20081123033706/http:/en.wikipedia.org/wiki/Russian_reversal#Russian_reversal)’ joke language...\n\n“In Soviet Russia egg whisks you.”\n\n"
    },
    {
      "time": " 8.Jan.2008 5.16pm",
      "content": "_“Here’s one into ’In soviet Russia...’ joke language...”_\n\n...or “yolk language”... (Sorry - waaay easy pun, but I just _had_ to...)\n\n"
    },
    {
      "time": " 9.Jan.2008 12.48am",
      "content": "Thanks again everybody!\n\nPieter\n\n"
    },
    {
      "time": " 9.Jan.2008 1.10am",
      "content": "In Czech:\n\nV oddělené misce šlehejte žloutky se zbylým cukrem jednu minutu elektrickým mixérem.\n\n"
    },
    {
      "time": " 9.Jan.2008 2.20am",
      "content": "In North Sami:\n\nSeagut sierra bollus monnefiskadasaid ja sohkkara mii lea báhcán ovtta minuhta biebmomašiinnain.\n\n"
    },
    {
      "time": " 9.Jan.2008 2.44am",
      "content": "Polish:\n\nW oddzielnej misce mieszaj elektrycznym mikserem żółtka jajek z pozostałym cukrem przez jedną minutę.\n\n"
    },
    {
      "time": " 9.Jan.2008 4.10am",
      "content": "In Portuguese (this is the Brasilian version - shouldn’t be too different in Portugal - they’d probably say “eléctrica”):\n\nEm uma tigela à parte, bata as gemas dos ovos com o restante do açúcar durante um minuto, usando a batedeira elétrica.\n\nRonald Kyrmse  \nronald.info.ms\n\n"
    },
    {
      "time": " 9.Jan.2008 5.51am",
      "content": "In Portuguese (from Portugal) like suggested by kyrmse :-)\n\nNuma tigela à parte, bata as gemas dos ovos com o restante do açúcar durante um minuto, usando a batedeira eléctrica.\n\nAntónio Fonseca\n\n"
    },
    {
      "time": " 9.Jan.2008 5.58am",
      "content": "Turkish:\n\nAyrı bir kapta, kalan şekerle yumurtanın sarısını bir dakika mikserle çırpın.\n\n"
    },
    {
      "time": " 9.Jan.2008 6.48am",
      "content": "Hm, Florian Hardwig’s German sounds more German cooking book style than nora g’s.\n\nHungarian:  \nA tojássárgáját a maradék cukorral egy másik tálba tesszük, és elektromos habverővel egy percig verjük.\n\n(I changed that to the first person plural formulation which is prevalent for cooking books in Hungary, though it does not sound quite “original Hungarian recipie” to me, as e.g. you probably wouldn’t add the time for such a simple task, nor the instruction for using an electric mixer (though I included these in the sentence above not to deviat much from yours and not to make it too short).\n\n"
    },
    {
      "time": " 9.Jan.2008 12.04pm",
      "content": "Thanks all! Does anyone speak Greek? :)\n\nPieter\n\n"
    },
    {
      "time": " 9.Jan.2008 12.24pm",
      "content": "I don’t speak it well enough to give you an accurate translation, Pieter. I wish I did.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Jan.2008 1.00pm",
      "content": "Here you go :)\n\nΣε διαφορετικο μπολ χτυπιστε για ενα λεπτο με το μιξερ τα ασπραδια ε την υπολυπη ζαχαρη.\n\n"
    },
    {
      "time": " 9.Jan.2008 1.20pm",
      "content": "Pig Latin:\n\nIn an eparatesay owlbay iskwhay ethey egg olksyay ithway ethay emainingray ugarsay orfay one inutemay using ethay electric ixermay.\n\nHonestly, I am amazed by scope of this thread. How fun to participate in this global forum! I’m also feeling inadequate with my monoliguisticality.\n\n"
    },
    {
      "time": " 9.Jan.2008 1.29pm",
      "content": " You mean your Americanness, right?  \n—Joel\n\n"
    },
    {
      "time": " 9.Jan.2008 1.45pm",
      "content": "Precisely. But it’s not that simple. My middle-America, not quite suburban, but on the edge of the metropolis, in one of those 1950’s ranch homes on a block with an alley and a basketball hoop on the garage childhood has a lot to do with it. And my brother had a paper route. I am seriously average.\n\n"
    },
    {
      "time": " 9.Jan.2008 2.13pm",
      "content": "Another Russian translation:\n\nПоместите яичные желтки с оставшимся сахаром в отдельную чашку, и взбивайте на протяжении минуты электро-миксером.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20081123033706/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 9.Jan.2008 2.30pm",
      "content": "Swiss German (Basel dialect):  \nIn äre sebarate Schüssle s’Aigäl mit Hilf vom Schwingbäse mit em räschtligge Griesszugger e Minute lang uffschloh.\n\nSwiss German (Bernese dialect):  \nInere separate Schüssle wird ds Eigäub mit em übrigblibene Zucker e Minute lang mit em elektrische Mixer gschlage.\n\n"
    },
    {
      "time": " 9.Jan.2008 3.37pm",
      "content": " BTW, the full-stop should be at the leftmost end of the Yiddish sentence. Perhaps it needs to be wrapped in right-to-left tags of some sort.  \n—Joel\n\n"
    },
    {
      "time": " 9.Jan.2008 6.53pm",
      "content": "indonesian translation\n\ndi mangkok yang terpisah kocok kuning telor dengan sisa gula selama satu menit dengan menggunakan mixer.\n\n"
    },
    {
      "time": " 9.Jan.2008 10.10pm",
      "content": "Get Down Haley! I didn’t know you spoke Greek!\n\nChrisL\n\n"
    },
    {
      "time": " 10.Jan.2008 6.36am",
      "content": "Ramie-should it not be measc instead of meascaigh?\n\n"
    },
    {
      "time": " 10.Jan.2008 9.09am",
      "content": "Here it is in Serbian, courtesy of my wife:  \n“У посебној чинији електричним миксером мутите жуманце са остатком шећера један минут.”\n\n"
    },
    {
      "time": " 10.Jan.2008 9.48am",
      "content": "txt msgN:\n\nn a sepR8 bowl whisk d egg yolks w d remainN sgr 4 1 min. UzN d electric mixer.\n\n"
    },
    {
      "time": " 10.Jan.2008 12.33pm",
      "content": "I don’t speak Greek fluently, but my boyfriend is from Athens so I got him to do the words I didn’t know. :)\n\n"
    },
    {
      "time": " 10.Jan.2008 3.21pm",
      "content": "Irish:\n\nI mbabhla ar leith, measc na buíocáin leis an siúcra atá fágtha ar feadh nóiméid amháin, ag baint úsáid as an meascthóir leictreach.\n\n"
    },
    {
      "time": " 10.Jan.2008 3.23pm",
      "content": "Thanks Lorcs for spotting that. Corrected now.\n\n"
    },
    {
      "time": " 10.Jan.2008 7.35pm",
      "content": "Well, Esperanto isn’t exactly my “native” language, but I’ve been speaking it since I was 14; so, far what it’s worth: ’En aparta bovlo, kirlu per elektra miksilo dum unu minuto la ovoflavaĵojn kun la restanta sukero.’ That gives you a j-circumflex, which I don’t think you’ll find in any other language (as far as I’m aware).\n\n"
    },
    {
      "time": " 10.Jan.2008 10.45pm",
      "content": "Bulgarian:)  \nВ отделна купа разбъркай жълтъците с останалата захар за една минута използвайки електрически миксер\n\n"
    },
    {
      "time": " 11.Jan.2008 12.53am",
      "content": "Thanks again my Typophile friends! :)\n\nPieter\n\n"
    },
    {
      "time": " 12.Jan.2008 2.18am",
      "content": "Iceland somebody? :)\n\nPieter\n\n"
    },
    {
      "time": " 13.Jan.2008 6.40pm",
      "content": "Jason, where is the best place for the circumflex on lower case “h” — above the ascender or the hump?  \n(That’s an Esperanto accent, isn’t it?)\n\n"
    },
    {
      "time": " 14.Jan.2008 7.33am",
      "content": "I’m so blown away by all the different languages everyone here speaks. :)\n\n"
    },
    {
      "time": " 14.Jan.2008 11.36am",
      "content": "Eskimo someone?  \n:)\n\nPieter\n\n"
    },
    {
      "time": " 14.Jan.2008 11.46am",
      "content": "In Canada’s eastern Arctic, it would be called Inuktitut. ;-)\n\nI can’t do it, but one of my favourite cooking show presenters could — [her show](http://web.archive.org/web/20081123033706/http:/www.aptn.ca/index.php?option=com_wse&task=view&id=717636) is done in Inuktitut, with English closed-captioning....\n\n"
    },
    {
      "time": " 14.Jan.2008 12.24pm",
      "content": "Nick—\n\nYes, that’s an Esperanto accent. The circumflex for hcircumflex should be above the ascender. At least that’s where I’ve always seen it, and that’s where I always put it, although I’m not aware of any authoritative rule about its placement. I’ve thought about putting it lower (especially when the ascender is above the capheight), but that just causes other problems, like illegibility, for one.\n\n—Jason\n\n"
    },
    {
      "time": " 14.Jan.2008 1.42pm",
      "content": "Thanks Jason!\n\nAnd then—centred above the ascender, or the whole letter width?  \nI would assume the ascender.\n\n"
    },
    {
      "time": " 14.Jan.2008 1.43pm",
      "content": "Nick,  \nThe most current Adobe faces (see Arno) put the circumflex over the ascender. I assume they checked that out thoroughly with good sources.\n\nChrisL\n\n"
    },
    {
      "time": " 14.Jan.2008 1.57pm",
      "content": "Chris, I generally follow Adobe practice, but good though they are they’re not infallible, there is often more than one way to skin a cat, and it’s brilliant to be able to discuss this here first hand with an Esperanto-reading type designer!\n\n"
    },
    {
      "time": " 14.Jan.2008 2.09pm",
      "content": "I certainly agree with that, Nick. I was just chiming in that Adobe agreed with Jason on placement so 2 bases were covered.\n\nChrisL\n\n"
    },
    {
      "time": " 14.Jan.2008 2.19pm",
      "content": "In general, there’s not enough room to put the h-circumflex accent over the hump, but in a small-x-height face, light and wide, there would be.\n\n"
    },
    {
      "time": " 14.Jan.2008 7.45pm",
      "content": "Nick—\n\nI center the circumflex over the whole letter (h) and that seems to be the general practice in Esperanto literature — although Arno Pro has it centered over the ascender. (The latter approach is more likely to cause spacing problems, I think.) As you said, Adobe is not infallible. The hcircumflex in Esperanto is the least used of the accented letters, and in fact there is a trend to substitute ’k’ for it if that does not cause confusion with other words. Of course, that’s beside the point; I think it’s worthwhile to design our diacritics to follow common usage in the respective languages as best we can, but that’s a whole other topic!\n\n"
    },
    {
      "time": " 15.Jan.2008 5.32am",
      "content": "Hmmm, guess I’ll have to shift some circumflexes back :-)\n\nChrisL\n\n"
    }
  ]
}
