{
  "id": "40592",
  "title": "In-Depth Article on Fonts\\*",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "\\* well not quite.\n\ninteresting to see a mainstream article on fonts by someone who clearly has no grasp of the subject matter. :/\n\n\"Here's a quick primer on typefaces: They are divided into two main groups - serif and sans serif. Serifs, simply, are letters with tiny horizontal lines added to the top and bottom.\"\n\nOriginally appeared in the Sacramento Bee ... nobody bothered to notice that  \nthe lead no longer makes sense when the story is published elsewhere.\n\n[Are\\_you\\_an\\_Arial\\_or\\_a\\_Comic\\_Sans\\_sort?](http://web.archive.org/web/20131012060215/http:/www.philly.com/inquirer/magazine/20080101_Are_you_an_Arial_or_a_Comic_Sans_sort_.html)\n\n",
  "author": "beejay",
  "time": "6 Jan 2008 — 3:15am",
  "uid": "1014",
  "comments": [
    {
      "time": "6 Jan 2008 — 9:21am",
      "content": "\\>the lead no longer makes sense when the story is published elsewhere.\n\nActually looks like the font name was edited...\n\n[http://www.google.com/news?hl=en&ned=us&scoring=d&q=McManis+font](http://web.archive.org/web/20131012060215/http:/www.google.com/news?hl=en&ned=us&scoring=d&q=McManis+font \"http://www.google.com/news?hl=en&ned=us&scoring=d&q=McManis+font\")\n\nAlso looks like Sams mum wrote a letter to the editor ;-) ...\n\n[http://www.sacbee.com/107/story/605311.html](http://web.archive.org/web/20131012060215/http:/www.sacbee.com/107/story/605311.html \"http://www.sacbee.com/107/story/605311.html\")\n\n"
    },
    {
      "time": "6 Jan 2008 — 10:40am",
      "content": "It's odd the writer has such little respect for type and the people who know, design and use it.\n\n"
    },
    {
      "time": "6 Jan 2008 — 11:15am",
      "content": "good call Sii.\n\nI went looking for more information on Milne, and ended up finding  \nthe wonderful work of Dan Milne\n\n[http://typophile.com/node/14576](http://web.archive.org/web/20131012060215/http:/typophile.com/node/14576 \"http://typophile.com/node/14576\")\n\nthen realized it was 4 a.m. (zzz)\n\nLooks like they did update it for their print version — Milne is a revised version of Olympian used  \nin the Inquirer.\n\n"
    },
    {
      "time": "6 Jan 2008 — 12:20pm",
      "content": "_interesting to see a mainstream article on fonts by someone who clearly has no grasp of the subject matter. :/_\n\nActually, it would be interesting if they DID know something about the subject, or made the assumption that a significant number of their readers might perhaps be better informed than they are.\n\nPerhaps it's because there is an assumption that the ignorance of writers on the subject is shared by the general populace, it being inconceivable to writers, who work with fonts all the time, that others would be more knowledgable. However, most writers are not \"visual\" people.\n\n"
    },
    {
      "time": "6 Jan 2008 — 12:51pm",
      "content": "hmm, most often, they DO know something, they do have a grasp.\n\nmost of the articles I read about typography come from people well-versed in the subject.\n\nPrint, How, STEP, Baseline, eye, etc.\n\nAnd when the New Yorker or NYT does something, it's typically thoughtful, and well-researched.\n\nseeing the opposite is a bit of an eye opener.\n\n"
    },
    {
      "time": "6 Jan 2008 — 2:40pm",
      "content": "_Print, How, STEP, Baseline, eye, etc._\n\nI thought you meant mainstream = general media, not trade.  \nOf course trade press writers, such as Allan Haley and John D. Berry, know their stuff!\n\n_well-researched._\n\nWhenever I've been interviewed by mainstream media, the reporter has never done any homework and starts from scratch, and while the stories may be professional, they are stodgy with background. For instance, last year, in response to a press release I sent out for a new typeface, a newspaper reporter devoted less than 20% of the resulting article to the typeface, with the rest devoted to a potted history of digital fonts. Fortunately, she didn't mention good old bancomicsans.\n\n"
    },
    {
      "time": "6 Jan 2008 — 4:04pm",
      "content": "\\> the reporter has never done any homework and starts from scratch\n\nNot surprising. I spent nearly 10 years as a newspaper reporter, and you were expected to produce from 3 to 5 stories a day. This was at smaller papers. For the Bee, I suspect this story was one day's work, perhaps with a few smaller stories put in.\n\nThe author was probably aiming the article at the general reader (you know, grade 10 reading level and all) and not the trade. I didn't see any glaring errors, which is a step above most.\n\nI consider it a good article (not great) in that it gets the word out about type, and it had a nice plug for Helvetica (the movie).\n\n"
    }
  ]
}
