{
  "id": "40606",
  "title": "Help please",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi, I’m new here and to fonts in general. I’m having a really hard time identifying this font. It’s similar to Exocet, but I’m really hoping for a closer match. Any help would be appreciated. Also, any other font matching websites I should be aware of? I’ve used whatthefont and identifont with no luck. Thanks!\n\n ![](http://web.archive.org/web/20080110171721im_/http:/typophile.com/files/46251e4ed0c9cc2209e74e1eb6a907e0_15567_5757.jpg)\n\n [‹ DeLonghi logo](http://web.archive.org/web/20080110171721/http:/typophile.com/node/40726 \"Go to previous forum topic\") [slight-serif block - Mt. Baker ›](http://web.archive.org/web/20080110171721/http:/typophile.com/node/40715 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080110171721/http://typophile.com/user/25625\" title=\"View user profile.\">dantheman</a>",
  "time": "<br>",
  "uid": "25625",
  "comments": [
    {
      "time": " 6.Jan.2008 6.16pm",
      "content": "that \\*is\\* excocet, it’s just squashed and blurred all to hell.\n\n"
    },
    {
      "time": " 6.Jan.2008 6.56pm",
      "content": "Thank you for responding.  \nI’m pretty sure that it’s actually not Exocet, there are many small differences:  \nI not sure if I have all the terminology right, but:  \nThe W in Exocet has horizontal ends to the terminals.  \nThe middle bar of the E is shorter than in Exocet.  \nThe ends of the C are vertical in Exocet.  \nThe serifs are quite different on many of the letters.\n\nDo you think it is a modified version of Exocet? If so, is there software I could use to try to attempt to duplicate it? I’d hate to have to photoshop everything, there’s a lot more text to it than just this. I really need a nearly identical font for the application I’m working on.  \nAny other ideas?\n\n"
    },
    {
      "time": " 6.Jan.2008 9.21pm",
      "content": "This is a derivative version of Exocet. Support Emigre and license it from the original source.\n\n"
    },
    {
      "time": " 9.Jan.2008 1.50pm",
      "content": "Do you think that W is custom drawn maybe?\n\n"
    }
  ]
}
