{
  "id": "40600",
  "title": "What's this Font? Retro Swirly-ish.",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "[http://www.turbomilk.com/](http://web.archive.org/web/20080920053712/http:/www.turbomilk.com/ \"http://www.turbomilk.com/\")\n\nThe main logo.\n\nIf it is custom, than, what would be a good alternative?\n\n [‹ Deleuze piece in DotDotDot 14](http://web.archive.org/web/20080920053712/http:/www.typophile.com/node/40633 \"Go to previous forum topic\") [Hey, looking for embossed sans serif, seventies-ish vintage. ›](http://web.archive.org/web/20080920053712/http:/www.typophile.com/node/40654 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080920053712/http://www.typophile.com/user/25578\" title=\"View user profile.\">WSXF</a>",
  "time": "<br>",
  "uid": "25578",
  "comments": [
    {
      "time": " 6.Jan.2008 11.20am",
      "content": "[http://www.dafont.com/ballpark-weiner.font?nb\\_ppp=50&text=TurboMilk](http://web.archive.org/web/20080920053712/http:/www.dafont.com/ballpark-weiner.font?nb_ppp=50&text=TurboMilk \"http://www.dafont.com/ballpark-weiner.font?nb\\_ppp=50&text=TurboMilk\")\n\nA script by the name of Ballpark Weiner and a bit of photoshopping to make that logo.\n\n"
    },
    {
      "time": " 6.Jan.2008 11.43am",
      "content": "Ouch! Not a very wise thing to recommend “pirate suckers” like Dafont if you like to keep your friendship here... tip of the day :-)\n\n"
    },
    {
      "time": " 6.Jan.2008 12.45pm",
      "content": "Was it an recommendation or just an identification?\n\n"
    },
    {
      "time": " 6.Jan.2008 2.08pm",
      "content": "It was an identification. I don’t recommend any of those cheapy sharewares.\n\n"
    },
    {
      "time": " 6.Jan.2008 3.37pm",
      "content": "Ok, explanation accepted. I was just surprised to see the link at all.\n\n"
    },
    {
      "time": " 6.Jan.2008 4.23pm",
      "content": "Stefan, we often locate fonts there, and link to them, because we get many ID requests for things that are obviously made from amateur/freeware fonts. Dafont organizes their fonts by categories, and lets you set a test phrase and search the entire category — one of the most useful capabilities for IDing fonts. They have also been very good about removing any font that you tell them is a rip-off.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 6.Jan.2008 5.25pm",
      "content": "Not all freeware sites are “pirate-sucker” rip-offs. I think you owe dafont an apology. (stronger feelings self-moderated)\n\n"
    },
    {
      "time": " 7.Jan.2008 1.18am",
      "content": "Sorry, but If you ask me to be a supporter of Dafont, That will never happen. They used to have a rip-off of Oxtail (called Cleopatra) up before. I have to be quite angry before they removed it. And of course the rip-off is still around in other “free-fonts sites”...\n\nI could imagine a site with all the “official” free-fonts from respectable foundries in one place. With a clear definition of the usage etc. Maybe with registration etc. But to me sites like Dafont is and will be sites with low morale and respect for all of us that are trying to make a living on type design.\n\n"
    },
    {
      "time": " 7.Jan.2008 7.11am",
      "content": "A lot of commercial font makers started as freeware font makers. Your morale or respect was probably not considered when they gave their fonts away. They just wanted to share. A simple innocence.\n\nThe quantity of quality fonts that come out as freeware isn’t enough to have much impact on you, I would imagine.\n\nI personally thin dafont rocks! Big time. Without having to search, I can get enough new toys to play with that I don’t miss downloading almost any commercial font I want, for free on the web. A sort of methadone for recovering fontaholics.\n\n"
    },
    {
      "time": " 7.Jan.2008 8.15am",
      "content": "Dennis, the problem with saying it was just innocence is that we both know that it is not always just innocence. Especially here on Typophile where most (if not all) of us know that it is wrong. Continuing to say it is innocence is also, in a way, brushing it under the carpet and letting the practice continue.\n\nI think sites like DaFont, who have been removing fonts when they are told about their questionable origins, should take a stronger stance if they wish to ever be considered a reputable source for free fonts. Otherwise, I cannot in good conscious and without hesitation recommend them as I’ll never be able to guarantee the true origins of the fonts.\n\nThe dafont links are left on Typophile as Stephen has said they are doing what they can to remove links when told to do so.\n\n"
    },
    {
      "time": " 7.Jan.2008 8.48am",
      "content": "DaFont might have an exact match, but it not be the best place to get the font you’re looking for, WSXF. Depending on your project’s requirements, you might want to look at Anziano, Delicato or Tarocco instead.  \n``  \n``  \n``  \n(I kid, I kid.)\n\n"
    },
    {
      "time": " 7.Jan.2008 9.01am",
      "content": "You get what you pay for. If all you want is a new “toy” to play with and you don’t really care how it looks then DaFont “rocks”. But if you are a serious professional designer or typographer, looking for quality fonts with which to create quality designs, you are not likely to find them on DaFont or any other freeware site.\n\n"
    },
    {
      "time": " 7.Jan.2008 9.31am",
      "content": "<cite>But if you are a serious professional designer or typographer, looking for quality fonts with which to create quality designs, you are not likely to find them on DaFont or any other freeware site.</cite>\n\nI agree with that (with a few exceptions).\n\n<cite> Continuing to say it is innocence is also, in a way, brushing it under the carpet and letting the practice continue.</cite>\n\nYou misconstrue what I said. I was referring to newbie fontmakers giving their fonts away. If they want to do that, who’s to say what their motives are? I prefer to believe it is a joy of sharing their work.\n\nFor the most part, I am on the side of the commercial fontmakers (except when they are jerks). Which is why I hang out here instead of where I used to hang. Unfortunately, I no longer have the money to buy fonts for no purpose other than to enjoy them.\n\nA few commercial fontmakers send me copies of their fonts (I think because I supported them early on), and I feature them gladly. And I make a point of referring people to Myfonts if they want a copy.\n\nBest wishes to all from soggy So. Cal.  \n; )\n\n"
    },
    {
      "time": " 7.Jan.2008 9.41am",
      "content": "Miss Tiffany,  \nThanks for your support.\n\nJust to give you an idea... I made a quick search for “Cleopatra” + “free fonts” and found the ugly as ever rip-off from my own OXTAIL on two different sites. One of them proudly stated it had been downloaded over 8000 times. Now I could be spending loads of time trying to have them removing it, but I don’t think it’s worth all of the effort. Still it’s quite annoying.\n\n"
    },
    {
      "time": " 7.Jan.2008 10.04am",
      "content": "@ Dennis: Fair enough. If a young type designer creates his own designs, free from the stink of derivation, then it is up to them to give it away.\n\nI know that some people see type design and can’t help but to want to tinker and do some themselves. I also am realistic enough to know that true innocence does still exist. But, knowing it exists means we have to do something to help them learn the difference. No?\n\n@ Stefan: I would suggest not referring to the name of it anymore. ;^) Don’t help other people by giving them the name.\n\n"
    },
    {
      "time": " 7.Jan.2008 10.14am",
      "content": "Tiffany,\n\nThanks for the advise, but I concentrate on the good thing like the fact that my typefaces are doing just fine. And I’m sure those who steal will sooner or later “pay their price” one way or the other ;-)\n\nCheers\n\n"
    },
    {
      "time": " 7.Jan.2008 10.17am",
      "content": "Stephan, I checked and I apparently used the knock-off of your font here:\n\n[http://www.fontplay.com/images/faustcleo.jpg](http://web.archive.org/web/20080920053712/http:/www.fontplay.com/images/faustcleo.jpg \"http://www.fontplay.com/images/faustcleo.jpg\") (CREATIVITY)\n\nI see the link on my site doesn’t work (because dafont removed it). When I get home, I will remove the reference to it. I had no idea it was yours. The text font is one by Manfred Klein called Faustant.\n\n(I really like the quote used on that FP)\n\n"
    },
    {
      "time": " 7.Jan.2008 1.44pm",
      "content": "Spire\\>\\>\\> That was funny dude!\n\nMikey :-)\n\n"
    },
    {
      "time": " 7.Jan.2008 3.37pm",
      "content": "Fontplayer  \nSo what do you know, HAHA. The saddest thing about the rip-off is that it is badly done from a early pdf version. the curves and lines are really psycho.\n\nSpire  \nWhy this continuous hatred towards me? I hope you have noticed that ever since you made fun of my self promotion, I’ve stopped this activity (as promised). Now go on with your own life and forget about me and my typefaces. God bless!\n\n"
    },
    {
      "time": " 7.Jan.2008 5.30pm",
      "content": "Stefan, you must be confusing me with someone else. As far as I know, this is the first interaction I’ve ever had with you. My post above was just a light-hearted jab, not meant to offend. I thought you might get a chuckle out of it.\n\nApparently I touched a nerve. I apologize.\n\n(For what it’s worth, I like your fonts a lot.)\n\nEdward\n\n"
    },
    {
      "time": " 8.Jan.2008 12.33am",
      "content": "Edward,\n\nI sure did. My apologies! By your joke I was sure it was James Newton (alias New Guy). He had a rather aggressive attitude.  \nSee the whole story here... [http://typophile.com/node/39004](http://web.archive.org/web/20080920053712/http:/typophile.com/node/39004 \"http://typophile.com/node/39004\")\n\nCheers\n\n"
    }
  ]
}
