{
  "id": "40635",
  "title": "Original Besley Clarendon",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi there!  \nI’m studying at [www.esad.pt](http://web.archive.org/web/20091213000158/http:/www.esad.pt/ \"www.esad.pt\") and i’m doing a work about clarendon. i need a lot of information, pictures, anything i can get, even metal letterpress ehehe... can anyone help me? :s\n\n",
  "author": "<a href=\"/web/20091213000158/http://www.typophile.com/user/24330\" title=\"View user profile.\">joelsantos</a>",
  "time": "<br>",
  "uid": "24330",
  "comments": [
    {
      "time": " 7.Jan.2008 1.08pm",
      "content": "[http://www.typophile.com/node/31036](http://web.archive.org/web/20091213000158/http:/www.typophile.com/node/31036 \"http://www.typophile.com/node/31036\")\n\n"
    },
    {
      "time": " 17.Jan.2008 9.36am",
      "content": "thanks a lot! for real!\n\n"
    },
    {
      "time": " 17.Jan.2008 9.37am",
      "content": "even though i have to find some more :s\n\n"
    },
    {
      "time": " 18.Jan.2008 12.48am",
      "content": "hello,\n\ni just wrote a long and documented article about clarendon for a book i’m currently writing. what kind of information are you looking for?\n\ndr\n\n"
    },
    {
      "time": " 19.Jan.2008 10.32am",
      "content": "appreciated really a lot.  \nWell i just need to know anything.  \nThe objective of the work is to know about the typeface. Everything i can.  \nI have to do a presentation to my teacher Dino dos Santos saying what i know from the clarendon and Robert Besley off course, actually i have to tell everything related to clarendon. See what kind of work do i have to do/show? Obviously images are really welcome.  \nI’ve seen already the Paulo Heitlinger book named “Tipografia” but it doesn’t say much. I tried already to speak with Oxford Press that from what i know is one of the responsibles but i didn’t have reply.\n\nCan you help me please?\n\n"
    },
    {
      "time": " 19.Jan.2008 5.06pm",
      "content": "@youremin  \nYou study with Dino? How is his course? You know he’s here on Typophile, right? He’s watching your _every move_.\n\nYou might want to shoot an email to the Canada Type folks, since they just released a new text version of Clarendon. I’m sure they dug up some stuff about it that they’d like to share.\n\n@David R  \nYou interested in contributing your findings to the Typowiki? That would be a good resource.\n\n"
    },
    {
      "time": " 21.Jan.2008 3.32am",
      "content": "ok i don’t mind to contribute. Yes i know, this website was brought to me by him. Thanks for all the help. And even if i don’t have time to present the stuff from Canada Type i learned to love the typeface so... i’ll try it anyway.\n\nThe course is really fine, i’m doing communication design, graphic design, and i’m loving it just loving it. Already worked for some time but it is getting me really important notions especially on the tipography that i didn’t give the honour it deserves.\n\nAbout Dino’s classes, yeah, i’m liking it he thinks that we think that is a bore class but i’m loving it, even with all the work we have to do and all the sweat.  \nHe has made a blog for us [http://estudostipografia.wordpress.com/](http://web.archive.org/web/20091213000158/http:/estudostipografia.wordpress.com/ \"http://estudostipografia.wordpress.com/\") if you want to check it out.\n\nDo you “love” any typeface? Keep on posting..  \nPeople, the work is done but i would like you to keep sending stuff about clarendon because as i said, i’m getting in love for it.\n\n"
    },
    {
      "time": " 21.Jan.2008 1.00pm",
      "content": "So i’ll translate the theoretic work i’ve made to be an auxiliary for my presentation for this work, even not being request, as i said, i learned to love Clarendon ehehe.\n\nEgyptians came with, from the word of historians like James Mosely, the hands of the ” tablets ads” (i don’t know the english word, it is the place that is supposed to be the name of the bar, place, store...) painters, very used for pubs and inns, that’s why the egyptians were very amused in United Kingdom. The typefaces from that time, like Bodoni or Didot, wouldn’t have enough visibility for the purpose. So, the real objective of the so called egyptian typefaces was to offer excelent visibility e that could be easily scaled to big dimensions (like an add, it is pratically impossible to do this on the natural materials (i think it was steel, i think that’s the english word please help me on these words) because of the weight that each character would have).\n\nRegistered in 1845, still on the name of the Thorowgood & Co ( the “Co” was Robert Besley), it appeared the Clarendon. The first typeface being registered, the future of the type designers was being written here may i say. The enterprise bought the Fann Street Foundry (Fann Street Foundry was founded by Robert Thorne in 1794, especialized in making typefaces with strong serifs, mechanical forms. Typefaces named egyptians.) and 4 years later Thorowgood as retired and so it changed the name to Besley & Co (the “Co” now, was Benjamin Fox) and that’s why we most of the times say as being a Besley’s typeface but from what i searched and saw, the real clarendon designer was Thorowgood.  \nJust for curiosity, later, Robert Besley as became Lord Mayor of London.\n\nSo... how did someone remembered to do the Clarendon typeface?  \nThe Clarendon was developed from a bug! On the print, some times it didn’t print so well and so the final work would have some blurs and too much tint ( please the word for this :D) some kind of “bolding” but it wasnt purposed on this time. The concept idea of Bold comes with this “bug” when someone remembered to do a typeface from this “bug” so it could be an auxiliary item of the design. The born of Clarendon. Its “boldish” design and the still beautiful typeface design could help the designer to make hierarchies on the text, doing the diference between the so Clarendon and the roman types.  \nThe letters of Clarendon are pretty close to a perfect square, something i’ve seen when i drew by hand the typeface (later i can post some photos if you want) and at the same time it was a squared and mechanical, Clarendon typeface still a beautiful typeface, even for the time.\n\nNow we can see Revivals of clarendon like Candida from Jakob Erbar and the digital editions from Linotype or Monotype (done in 1935).\n\nThe Clarendon was used on the United States traffic signs, later replaced by Rawlinson Roadway.\n\nThe original Clarendon can be found at the “Type Museum of London”.\n\nAbout photos, i can send them later if someone is interested.\n\nPlease, don’t let “Clarendon” die and help me knowing more about this type and so, keep on sending stuff.  \nNick Shinn has done a wonderful job on the node he told me. See it too.\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 21.Jan.2008 2.16pm",
      "content": "I like your “bug” theory, Joel!\n\n\\*\\*\\*\n\nClarendon was not the first bold, as we understand the concept.  \nUpdike, in _Printing Types_ (plate 310, 2nd edition, 1937) reproduces three samples of Bodoni’s Ducale size of type, three different weights, as shown in Bodoni’s _Manuale_ of 1818.\n\nIt’s hard to assess the influence of Bodoni’s work, as his types were not used commercially, but I suspect that other European type founders would have been familiar with it.\n\n"
    },
    {
      "time": " 21.Jan.2008 2.38pm",
      "content": "I see... i thought that Clarendon was the first one to be used as the bold we know today, i didn’t say it was the first one or if i did it wasn’t what i meant to.\n\nAbout bug theory i read it somewhere but if we think about it ... there is some logical aspects about that. Even the squared typeface if we see well that bug but i wouldn’t go so far. But even though, i think i’ve never seen that Bodoni, ok, i don’t know much about type or types but...  \nAbout the European type founders, well, if we see... the Clarendon was registered just 30 years plus and no one could use something like Clarendon but when the registering ended, from what i read, people got excited and started doing some kind of “Clarendon” too.  \nAs i said i’m still an ignorant on the matter I am just using my ignorance crossed with what i read.\n\nOh, sorry but i’ve searched your name, i’m adicted on information ehehe. Nice fonts. I’m on other threads maybe you can help me on the other ones too... One is about font recognising and the other is about my new respect for the types and i would like to do something... it is better to see the thread... if you wouldn’t mind.\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 21.Jan.2008 2.40pm",
      "content": "Oh, i thought this could be nice for someone who likes clarendon.  \nAs obviously one of the images i flipped.\n\n ![](http://web.archive.org/web/20091213000158im_/http:/www.typophile.com/files/clarendon_extended_3693.jpg)\n\n ![](http://web.archive.org/web/20091213000158im_/http:/www.typophile.com/files/199760069_38250a367d_3822.jpg)\n\nThe others i have are on the node that Mr. Nick Shinn referred to me.\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 23.Sep.2008 6.58am",
      "content": "joelsantos wrote:  \n“Please, don’t let “Clarendon” die and help me knowing more about this type and so, keep on sending stuff.”\n\nHi there,  \nI was doing a bit of research, too, on Clarendon, and this was when I stumbled upon this site.\n\nLet me add that in 1953 Hermann Eidenbenz redesigned Clarendon for the foundry Haas in Münchenstein near Basel.\n\nGreetings from Switzerland!  \nAndy\n\n"
    },
    {
      "time": " 28.Sep.2008 3.31am",
      "content": "oh...\n\nJoel Santos // yrmk . visual\n\n"
    }
  ]
}
