{
  "id": "40652",
  "title": "mdta smile typeface",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Its been a good few years since I posted here. I was dabbling my toes into the typeface pool by editing the Myriad letterforms for a personal logo and typeface.\n\nWell I have recently decided to make a new logo with a custom drawn typeface, this time without using an existing font as a basis.\n\nI originally just designed the letters m d t a, and then went on to make the other letters for the words design and media and thats where it stood, until I decided to do the remaining letters for fun, and then numerals and basic punctuation followed.\n\nNow half a year later, I have started redrawing the letters and making a more complete version. I have done the most work with the bold letterforms as that is what the logo is made from. I have done lowercase, uppercase, smallcaps, 2 forms of numerals, and some simple punctuation.\n\nI have also started work on a regular version of the typeface, and I have only done the lowercase, and some uppercase with that one.\n\nSo far these are just lettershapes in Corel Draw, I would like to form it into a font with fontlab at some point, but I am not comfortable with fontlab's drawing tools, as I usually use corel draw, and feel that the vector shapes seem more solid and maliable, but I guess I will have to change if I want a working font from it.\n\nAnyway, I am talking too much, so take a look at the PDFs and please offer me some comments and criticism on how to improve it, while I am at this early stage, oh also, I have some alternative characters made which I would like to include in the font also, and a whole selection of Q designs. Most of the lettershapes are based around the o design, which is a slightly squared off geometric circle.\n\n| Attachment | Size |\n| --- | --- |\n| [smile-old.pdf](http://web.archive.org/web/20131013151642/http:/typophile.com/files/smile-old.pdf) | 130.74 KB |\n| [new-smile-wip.pdf](http://web.archive.org/web/20131013151642/http:/typophile.com/files/new-smile-wip.pdf) | 182.25 KB |\n| [FL Sample-mdta smile logo.pdf](http://web.archive.org/web/20131013151642/http:/typophile.com/files/FL%20Sample-mdta%20smile%20logo.pdf) | 36.1 KB |\n| [sample.pdf](http://web.archive.org/web/20131013151642/http:/typophile.com/files/sample_4.pdf) | 23.18 KB |\n\n",
  "author": "mdta",
  "time": "7 Jan 2008 — 11:06pm",
  "uid": "10649",
  "comments": [
    {
      "time": "9 Jan 2008 — 1:15pm",
      "content": "I like it. Reminds me of Peter Bruhn's [Mustardo](http://web.archive.org/web/20131013151642/http:/www.fountain.nu/catalogue/imbisspackage.asp). I think you could do without the counter dots. Not really a point to them other than having been in the original logotype. Also I think the B is a little disproportioned. I'd make it slightly more even.\n\n"
    },
    {
      "time": "9 Jan 2008 — 3:20pm",
      "content": "How do you mean, disproportioned, is it in the width of the two bowels?\n\nmdta - Martin Anderson\n\n"
    },
    {
      "time": "9 Jan 2008 — 3:36pm",
      "content": "Yes, the upper bowl feels just a bit too small to me.\n\n"
    },
    {
      "time": "11 Jan 2008 — 6:07pm",
      "content": "I'm thinking the overhang on all three \"s\" characters is a bit much... they feel off-balance, and not in the quirky intentional way that some of the other characters do. I second what Ken says about the dots, I don't think you're gaining much and when you use this as a typeface they will become a distraction. Plus, they're a great way to set the logo and text apart.\n\nIt's nice though, I like it a lot. The small caps in particular work for me.\n\n"
    },
    {
      "time": "12 Jan 2008 — 4:20am",
      "content": "So the straight edges on the S's should be brought inwards? Those were the toughest for me to draw :)\n\nI have started drawing the letters in fontlab directly, instead of moving the ones from Corel, so once I have all the lowercase done, I will do a pdf. I have never done a sample sheet before, so I may find an example of one and use that, would there be a problem with me doing that, I wouldn't want to offend anyone...\n\nmdta - Martin Anderson\n\n"
    },
    {
      "time": "17 Jan 2008 — 7:58am",
      "content": "I have edited the first post to include a sample of the font printed from Fontlab\n\nAt the moment it is only the lowercase, with ligatures, stylistic alternatives, and stylistic alternative ligatures :)\n\nAlso I have not yet started work on metrics, so they use a default setting of 0 left sidebearing, 50 right sidebearing\n\nmdta - Martin Anderson\n\n"
    },
    {
      "time": "17 Jan 2008 — 2:36pm",
      "content": "I like this! I find the H too narrow, and C, S and s slightly too wide.  \nI prefer the curvy y.  \nCan we see some text in paragraphs?  \n:)\n\n"
    },
    {
      "time": "28 Jan 2008 — 4:44am",
      "content": "I have added a sample with sentences, I hope its ok for everyone. Spacing is not finalised, and not all uppercase is complete\n\nmdta - Martin Anderson\n\n"
    }
  ]
}
