{
  "id": "40678",
  "title": "Old Standard",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "[http://www.thessalonica.org.ru/en/fonts.html](http://web.archive.org/web/20150417165816/http:/www.thessalonica.org.ru/en/fonts.html \"http://www.thessalonica.org.ru/en/fonts.html\")\n\nDoes anyone have any opinions about this OFL licensed font? I really like it because it strongly reminds me of the typeface used in many ethnographic and linguistic books published by the Smithsonian Bureau of American Ethnology. I searched around and couldn’t find any serious discussions of it, so I’m curious what you experts here think.\n\nMy greatest complaint is that the mathematical operators and arrows are all very oversized in comparison to the other glyphs. This is however somewhat in keeping with 19th and early 20th century mathematical books that I’ve looked at, where the mathematical symbols are clearly not related to the typeface, but are probably a case of sorts that are mixed in with any other random face in use. For serious use however, I would like to see all the mathematical symbols, even the plebian + and =, scaled down to something more reasonable. Because it’s OFL licensed I’m tempted to do so, but I always seem to have something more important to do with my time.\n\nI think all this family needs is a good set of superiors and inferiors and a set of small caps, and it’s ready for serious use. The bold and bold italic need to be designed at some point, but they’re not necessary for book work if section and chapter headings are done in some other compatible face.\n\n",
  "author": "jcrippen",
  "time": "8 Jan 2008 — 2:03pm",
  "uid": "25436",
  "comments": [
    {
      "time": "14 Jan 2008 — 8:35pm",
      "content": "Old Standard is similar to Computer Modern (used in TeX), having come from the same type traditions. I think that's why there isn't a strong desire to use its mathematics characters.\n\nI like Old Standard, though, and find it has a bit more \"old style elegance\" than Computer Modern. I hope that people use it more.\n\n"
    }
  ]
}
