{
  "id": "40705",
  "title": "Type Designer's Rip-off Ethic",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "At the thread \"Type Designer's Work Ethic\"\n\nsee [http://www.typophile.com/node/32244](http://web.archive.org/web/20131014235659/http:/www.typophile.com/node/32244 \"http://www.typophile.com/node/32244\")\n\nRebecca Alaccari and Patrick Griffin of the Canadatype outfit claim:\n\n<cite>\"Both Patrick and I put in an average of 10 to 12 work hours a day, 6 days of most weeks.\"</cite>\n\nWho is so dumb in the brain as to believes this?\n\nThe Canadatype outfit ( [www.canadatype.com](http://web.archive.org/web/20131014235659/http:/www.canadatype.com/ \"www.canadatype.com\")) is a rip-off joint specialized in ripping off the designs made by others without obtaining permission from the original designers.\n\nFor example, for ripping-off the \"Mark Twain\" design by Gustav Jaeger, it took Rebecca Alaccari and Patrick Griffin less than an hour or two for scanning the \"Mark Twain\" typeface from a type-specimen book.\n\nGustav Jaeger, who contacted me this week, told me in a lenghty talk that the rippers-off Rebecca Alaccari and Patrick Griffin never bothered to get his permission, but instead ripped off his \"Mark Twain\" font without obtaining a license and now sell this ripped-off font as \"Huckleberry\" (\"Tom Sawyer\" could also have been used for the ripped-off \"Mark Twain\" font by Rebecca Alaccari.)\n\nGustav Jaeger told me that the designs of most of his fonts have been registered as design patents at the German design office in Munich.\n\n(For a short extract see [www.sanskritweb.net/forgers/sari.pdf](http://web.archive.org/web/20131014235659/http:/www.sanskritweb.net/forgers/sari.pdf \"www.sanskritweb.net/forgers/sari.pdf\"), page 2.)\n\nDisregarding the fact that Gustav Jaeger is the owner of the design and that he never granted a permission to the Canadatype rip-off outfit, Rebecca Alaccari and Patrick Griffin now claim at Myfonts that the Canadatype joint is the \"owner\" of the design.\n\n[http://www.sanskritweb.net/temporary/huckleberry.jpg](http://web.archive.org/web/20131014235659/http:/www.sanskritweb.net/temporary/huckleberry.jpg \"http://www.sanskritweb.net/temporary/huckleberry.jpg\")\n\nThat's what I call the Type Designer's Rip-off Ethic:\n\n**By ripping-off the designs made by other designers you appropriate the ownership to the designs, irrespective of whether the ownership to the designs has ever been registered at the official design office.**\n\nCheers to Rebecca Alaccari and Patrick Griffin: Continue your rip-off activities. There will be always idiots who buy \"licences\" to ripped-off designs for which Rebecca Alaccari and Patrick Griffin never obtained any licences.\n\n",
  "author": "Uli",
  "time": "9 Jan 2008 — 9:32am",
  "uid": "11274",
  "comments": [
    {
      "time": "10 Jan 2008 — 3:43am",
      "content": "\"Huckleberry\" is not a \"revival\", but a ripped-off copy of \"Mark Twain\".\n\nThe PDF shows Gustav Jaegers's original \"Mark Twain\" font (as PS Type 1) beneath \"Huckleberry\" ripped off by Rebecca Alaccari and Patrick Griffin:\n\n[http://www.sanskritweb.net/temporary/mark\\_twain.pdf](http://web.archive.org/web/20131014235659/http:/www.sanskritweb.net/temporary/mark_twain.pdf \"http://www.sanskritweb.net/temporary/mark\\_twain.pdf\")\n\n"
    }
  ]
}
