{
  "id": "40719",
  "title": "Dysfunctional promotional calendars",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Memo to those businesses in the graphic trades contemplating sending out fancy calendars to this art director/designer next year:\n\n1. It’s overdesigned.  \n2. It doesn’t work  \n3. I get lots of this stuff.  \n4. I use the Entourage calendar.  \n5. It’s going straight to recycling.  \n6. I do actually have a printed calendar in the kitchen—from my insurance agent. Nice scenic photos at top, basic boxed grid below. Not much of a “design”, but the best design for the job.\n\n [‹ speaker for a con in Cleveland](http://web.archive.org/web/20080821200206/http:/www.typophile.com/node/40747 \"Go to previous forum topic\") [Happy B-day Mr.Peters ›](http://web.archive.org/web/20080821200206/http:/www.typophile.com/node/40655 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821200206/http://www.typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": " 9.Jan.2008 2.14pm",
      "content": "Are you trying to tell us that somebody already thought about giving a calendar as a holiday gift? Assholes.\n\n"
    },
    {
      "time": " 9.Jan.2008 2.59pm",
      "content": "Further on #5, recycling:\n\n“Shades of green — 2008 Resource Calendar: Making sense of environmental options for your business” from Flash Reproductions.  \nI get this as a member of the RGD.  \nIt’s a free-standing “tent card” item of 52+ sheets, wire bound.  \nAs I don’t use desktop calendars, and it’s going straight to recycling, the green theme is somewhat ironic.  \nAdded to which, damn thing is set entirely in Helvetica.\n\n"
    },
    {
      "time": " 9.Jan.2008 3.05pm",
      "content": "Ha! I got that one today too. Came in a nice sturdy box for me to feel good about putting right in the little blue box under my desk.\n\nWhat’s with the perforations down the middle of each page?\n\n-=®=-\n\n"
    },
    {
      "time": " 9.Jan.2008 3.13pm",
      "content": "At year end, you’re supposed to tear off the calendar parts, and the remainder is a “handy reference guide”.  \nI could probably have used that as a reference book, if it had been designed in book format with a contents page and index.  \nWhat use is a 52-page reference book with no index? That is really bad, stupid design.\n\n"
    },
    {
      "time": " 10.Jan.2008 6.12am",
      "content": "\\> Added to which, damn thing is set entirely in Helvetica.\n\nYes, but is it recycled Helvetica?\n\n"
    }
  ]
}
