{
  "id": "40713",
  "title": "Color Laser Printer Recommendations. PLEASE.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I just can’t seem to read a review that is right for my needs.  \nI really just want a printer that will print solid beautiful color and crisp clean text.  \nPhotos are not a top priority.  \nI was looking at xerox just because it is True Adobe Postscript but Adobe Postscript has been around forever, hasn’t that technology changed too? Is it something I still need to look for?\n\nThoughts, Ideas insights and experience all welcome.\n\nThanks for you time.\n\n",
  "author": "<a href=\"/web/20090924021747/http://www.typophile.com/user/4885\" title=\"View user profile.\">cathyka</a>",
  "time": "<br>",
  "uid": "4885",
  "comments": [
    {
      "time": " 9.Jan.2008 11.00am",
      "content": "If you’re using Adobe design programs you’ll want PostScript. PostScript interpreters will only get you so far and watching your printer spit out a hundred blank pages when it hits some bit of code it can’t comprehend is truly aggravating (especially on a deadline).\n\n"
    },
    {
      "time": " 9.Jan.2008 3.34pm",
      "content": "Right now you can get an amazing deal at costco.com on the Xerox Phaser 6130/N. We have a higher-end Xerox at work, and I really like it — the color is vibrant, though I have seen some color-shifting. The smaller printer may not have the same issue, and even if it does, it may be able to be fixed with calibration, but I’m not sure. At $280 for a color laser with true PostScript 3, that price can’t be beat. I ordered one the other day, and it should be at my door today. (It would have delivered yesterday had I been home.) I can report further after I set it up at home.\n\nOne cost caveat: the printer takes four toner cartridges that cost $70-80 each. On the plus side, they’re probably good for about 5,000 prints, and you can make it so the printer only prints black when you want it to.\n\n[Here’s the info.](http://web.archive.org/web/20090924021747/http:/www.costco.com/Browse/Product.aspx?Prodid=11242519)\n\n"
    },
    {
      "time": " 9.Jan.2008 4.29pm",
      "content": "Dave:  \n“On the plus side, they’re probably good for about 5,000 prints”...\n\nSadly, no. The printer ships with carts rated at 1000 pages, and the standard ones are 1900 for colour and 2500 for black.\n\nIt’s not easy to find this info! See the bottom of page 4 here:\n\n[http://www.office.xerox.com/latest/613BR-01.PDF](http://web.archive.org/web/20090924021747/http:/www.office.xerox.com/latest/613BR-01.PDF \"http://www.office.xerox.com/latest/613BR-01.PDF\")\n\n"
    },
    {
      "time": " 9.Jan.2008 8.08pm",
      "content": "Separate toner cartridges for the different colors is a really good feature for long-term cost of operation. Odds are you won’t use all the colors at all close to equally.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 9.Jan.2008 9.07pm",
      "content": "My bad. At least it’s still a lot better than inkjet per-page costs. Good sleuthing, John!\n\n"
    },
    {
      "time": " 10.Jan.2008 9.35am",
      "content": "My only warning to to avoid HP. I’ve had some real problems with them in respect to PDF printing. Also, the 2550 series I have through my employer is the loudest damn printer I’ve ever heard.\n\n"
    },
    {
      "time": " 10.Jan.2008 12.06pm",
      "content": "Beware toner cartridges that are set to self-destruct even before they’re empty.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20090924021747/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 11.Jan.2008 12.35am",
      "content": "Update: the printer arrived today. Setup was relatively easy, and print quality seems pretty good. Not the most vibrant thing ever, but color seems accurate enough.\n\nOne truly stupid thing: the manual feed doesn’t have a tray like my LaserWriter 16/600 does — it’s just a slot. I don’t care that much that it only does one page at a time (the LaserWriter ended up being only able to do that too, though it didn’t start out that way), but I’d like to be able to lay the page in the feeder and walk away.\n\nIt’s a bit loud when it’s printing, but otherwise it’s very quiet.\n\n"
    },
    {
      "time": " 28.Feb.2008 11.49am",
      "content": "I’m looking for a good basic BW letter size laser printer with true Postscript also, and can’t seem to get straight answer anywhere. They all seem to say postscript emulsion, which I don’t believe is true. I have an old HP 6MP that’s been a workhorse, but is show as molasiss, and strung together with all kinds of adapters so it can connect to my network. I also have a huge color Minolta Magaicolor that prints nice tabloid sheets, but chokes on almost everything I send to it because it isn’t true Postscript (despite what they told be when I bought it).\n\nAnybody know of one for under $500? Like I said, just nee letter size and black only, but it must be true Postscript.\n\n"
    },
    {
      "time": " 28.Feb.2008 11.58am",
      "content": "I’m about to pull the trigger on this.\n\n[http://computers.pricegrabber.com/printers/m/7548565/](http://web.archive.org/web/20090924021747/http:/computers.pricegrabber.com/printers/m/7548565/ \"http://computers.pricegrabber.com/printers/m/7548565/\")\n\n"
    },
    {
      "time": " 28.Feb.2008 12.12pm",
      "content": "James I highly recommend that machine. I have it. It pumps out pages fast - I’ve printed a 200 page book in 10 mins. The paper tray can be a little awkward if you switch paper size a lot. I don’t have the duplex tray. I tend to leave 11 x 17 paper in there and cut it down to size if I need smaller.\n\n"
    },
    {
      "time": " 28.Feb.2008 3.35pm",
      "content": "cthyaka,\n\nI loved HP products and use to own an HP Color Laser 11x17 printer with duplex — the dots weren’t that sharp, but the machine really doe have artificial intelligence and if the paper is not in the tray - it knows to go to the next tray, which may not be the size - but that was alright with me. To replace all the toner at one shot — I found a place on the internet in Brooklyn and it would be under $700 - and it was good for 20,000 to 30,000 reproductions. A new drum (only one) was a few hundred each year.\n\nToday I own an Okidata C9500 - also 11x17 color laser. It prints extremely sharp (even my professional printer has been overwhelmed by the printers I post - it is as good as the work they do.) It really does an excellent job - but it is not as smart as an HP. For example, should I have 5 sheets of cover stock in it, and I want to print 10 — it will print the first 5 and then start to print 6 and get rattled that it doesn’t have the same paper weight. I have to shut it down and restart. The quality is great and I do get about 30,000 sheets before changing toner. However, every color not only has a toner - but a separate drum for each color... and the belt needs replacement every 12-18 mos. — let’s just say it is expensive to keep it going, and my customers like the idea of the local stationery store charging 49 cents a color copy. So I’ve advised the customers that remind me about this - they are welcome to use the other guy.\n\nI also have a small HP color printer now (I thought I’d save money on toner... not true) it gives me pretty pictures - it doesn’t have to worry about drums - but the toners cost under $600 - and it doesn’t last very long as it loves to print in a default of 2400 dpi, which of course uses up all the toner. I’ve asked how to change the default, and you can’t — you can with every job you are printing request in the software to lower it to 300 or 600 dpi - but the darn printer keeps printing in 2400 dpi. Also, I spent an additional 300 to put it on wireless - only to find out that it was a separate wireless system from the network’s wireless... it is now hardwired into the network - saved a lot of headaches.\n\nIf you have any other questions - feel free... hope my first hand experiences are helpful to you. Even though you already have bought one as I just finished reading... lol\n\n"
    },
    {
      "time": " 4.May.2009 1.27pm",
      "content": "I’m sick of my printer and the amount of ink it goes through even on draft or fast printing it’s eating up all our ink within a month we get [discount office supplies](http://web.archive.org/web/20090924021747/http:/www.land-arts.com/discount-office-supplies.html) but still spending to much it’s time to get rid of this and look for a new model. The only feature we care about in our office is that it uses a little ink as possible. If we have to go to laser printers we’ll upgrade.\n\n"
    }
  ]
}
