{
  "id": "40725",
  "title": "Blackletter to match Fell types",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m working on a newsletter for a band in New Mexico, and we thought it would be interesting to use the [Fell types](http://web.archive.org/web/20080113203304/http:/www.iginomarini.com/fell.html) for everything, at the authentic sizes specified by Igino.\n\nThe largest size he has is the De Walpergen Three Line Pica, at 41pts, with a nice range of sizes smaller than that.\n\nWhat I would like to find for the nameplate of the “authentic” newsletter is a blackletter that the Oxford University Press would have had from the same era. I had read somewhere that De Walpergen had come from Germany and had cut some blackletter for the press, but it didn’t specify what that might be.\n\nAccording to James Moseley’s blog at [typefoundry.blogspot.com](http://web.archive.org/web/20080113203304/http:/typefoundry.blogspot.com/2006/01/materials-of-typefounding.html):  \n<cite>the establishment of the press and its typefoundry is due chiefly to John Fell (1625–86), Dean of Christ Church and Bishop of Oxford, for whom matrices were bought in Holland in 1670–72 and who established a resident punchcutter in Oxford (Peter de Walpergen). In addition to Walpergen’s punches and matrices, the earlier materials in the collection include matrices for types by Robert Granjon, Pierre Haultin and (possibly) Claude Garamont.</cite>\n\nSo I suppose it is reasonable to assume that they had in their collection a blackletter from any of the above sources, be it from Holland or from Granjon &c.\n\nDoes anyone know of a cut that is available that might fit the description? Also, it might be a bit much to ask, if you know of any “worn” blackletters that might match the Fell types?\n\nThanks\n\n [‹ what would ricky ricardo use?](http://web.archive.org/web/20080113203304/http:/typophile.com/node/40671 \"Go to previous forum topic\") [Neutral Typeface for the web ›](http://web.archive.org/web/20080113203304/http:/typophile.com/node/40774 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080113203304/http://typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": " 10.Jan.2008 5.06am",
      "content": "Have you considered the English Textura from H&FJ’s Historical Allsorts? I believe those were digitized directly from the Oxford Fell types.\n\n[http://www.typography.com/fonts/font\\_styles.php?productLineID=100012](http://web.archive.org/web/20080113203304/http:/www.typography.com/fonts/font_styles.php?productLineID=100012 \"http://www.typography.com/fonts/font\\_styles.php?productLineID=100012\")\n\n— K.\n\n"
    },
    {
      "time": " 10.Jan.2008 10.29am",
      "content": "D’oh! But you can’t buy them individually. I’ll take a look and see if I can find a close match.\n\n"
    },
    {
      "time": " 10.Jan.2008 9.41pm",
      "content": "Dan\n\nThe Hoefler Fell were not corrected. They are computer tracings of letterpress printed specimens. Ink spread and all. You might be better off going to\n\n[http://www.moorstation.org/typoasis/typoasis1.htm](http://web.archive.org/web/20080113203304/http:/www.moorstation.org/typoasis/typoasis1.htm \"http://www.moorstation.org/typoasis/typoasis1.htm\")\n\nand see what is available from the free font movement folks. Not often the best but sometimes, in regard to historical interests, quite concerned and useful. The foundries aren’t always the answer. They have to make a buck. The free font folks obstensibly do it for love.\n\nGerald\n\n"
    },
    {
      "time": " 11.Jan.2008 12.13am",
      "content": "I’ve been looking through the Steffman stuff. Blackletter, it seems, is what he’s contributed. I suppose there’s not much demand for authentic revivals of blackletter types that died out of common usage a long time ago.\n\nThe English Textura font they have is authentic enough for my purposes, ink spread and all, but not at the right display size.\n\nI’m being stubborn, but ideally, I’d like to find a blackletter ranging from 50 to 72 pt. Did they even make textura that size? I know they did later, hence the nameplates of newspapers, but would that have been available at the same time as the Fell’s?\n\n"
    }
  ]
}
