{
  "id": "40746",
  "title": "Hebrew font that matches Chevin",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there,\n\nfor an exhibition, that will be partly in 3 languages, german, english an hebrew, I need some help with the right choice of a hebrew font that goes well with [Chevin](http://web.archive.org/web/20080906212221/http:/www.type.co.uk/index.php?p=a_to_z&search=chevin). We use Chevin demibold for the quotes within the interviewtext. The german original in demibold, the english translation in demibold italic an for the hebrew translation we are not sure yet.  \nThe fonts that actually look well are probably the comic sans of hebrew typography, and we don´t know it. You understand our problem: I don´t have an idea what we are doing to someones eyes reading the texts, if choosing one of those:\n\n[Sweeta](http://web.archive.org/web/20080906212221/http:/www.myfonts.com/search?search%5Btext%5D=sweeta)  \n [Sean](http://web.archive.org/web/20080906212221/http:/www.myfonts.com/fonts/masterfont/sean-mf/)\n\nWhat would you suggest?\n\nMany thanks in advance for some help in this tricky situation.\n\n [‹ 8.5 by 11 margins](http://web.archive.org/web/20080906212221/http:/www.typophile.com/node/18382 \"Go to previous forum topic\") [New logo for Design Company ›](http://web.archive.org/web/20080906212221/http:/www.typophile.com/node/41103 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906212221/http://www.typophile.com/user/25765\" title=\"View user profile.\">Schwertf</a>",
  "time": "<br>",
  "uid": "25765",
  "comments": [
    {
      "time": " 10.Jan.2008 6.43am",
      "content": "Sweeta is pretty stylised, verging on distracting. Sean is not too bad.\n\n"
    },
    {
      "time": " 10.Jan.2008 7.33am",
      "content": "I’d like to see the solution you arrive at.\n\nNick Cooke\n\n"
    },
    {
      "time": " 10.Jan.2008 11.02am",
      "content": "\\> What would you suggest?\n\npost the layout, sample — the german + english\n\n"
    },
    {
      "time": " 11.Jan.2008 4.04am",
      "content": "Sweeta looks pretty good to me as it is rounded, although not as condensed as Chevin.\n\nNick Cooke\n\n"
    },
    {
      "time": " 11.Jan.2008 10.40am",
      "content": "Many thanks so far!  \nBut is Sweeta a font that looks reliable or has it a comic-feel?  \nIt is difficult, hebrew is totally alien for me as an alphabet to work with.  \nWe found the page of a [typographer](http://web.archive.org/web/20080906212221/http:/www.fontef.com/) who offers interrestig rounded fonts,  \nI will show if something comes out with this.\n\n"
    },
    {
      "time": " 11.Jan.2008 10.52am",
      "content": "I´ll post a layout sample as I get the data on my machine.\n\n"
    },
    {
      "time": " 11.Jan.2008 1.10pm",
      "content": "There’s [Pronto](http://web.archive.org/web/20080906212221/http:/www.myfonts.com/fonts/masterfont/pronto-mf/), also by Rosenberg. With 3 weights it seems like it might match.\n\n"
    },
    {
      "time": " 11.Jan.2008 3.20pm",
      "content": "[Here](http://web.archive.org/web/20080906212221/http:/juedischejugendheute.ag.htwg-konstanz.de/look/fonts.html) you can see some really rough and and dirty screenshots of matching tests.  \nfirst two different weights of “pausa” from yanek Iontef, then sean, then pronto and then sweeta.  \nPausa works well, doesn´t it?  \nMaybe the Hebrew should be set a bit bigger than the x-height of Chevin.\n\n"
    },
    {
      "time": " 12.Jan.2008 12.20pm",
      "content": "If you’re willing, I would commission a hebrew typeface that truly fits your needs. [Oded Ezer](http://web.archive.org/web/20080906212221/http:/www.typophile.com/wiki/Oded%252BEzer) does exactly this sort of work and comes highly recommended.\n\n"
    },
    {
      "time": " 12.Jan.2008 7.12pm",
      "content": " The Pausa and the Pronto are decent style matches. The Sweeta is a weird blend of ‘square’ and ‘script’ styles and is slower to read—but the height & weight of the letters in the sample is well-night perfect complement to the English.  \n Can you get hold of some Israeli comic books for comparison?  \n—Joel\n\n"
    },
    {
      "time": " 12.Jan.2008 7.19pm",
      "content": "No doubt David Hamuel will come on and tell you his ideas, but in the meanwhile you could also look at his [Shirah Joie](http://web.archive.org/web/20080906212221/http:/www.myfonts.com/fonts/lighthouse/shirah-joie/) typeface, which is somewhat of a match, though you might want more rounded terminals. Following Stehen’s idea, I am sure David could on commission produce a font that is a match and very readable also...\n\n"
    },
    {
      "time": " 14.Jan.2008 7.46pm",
      "content": "Thanks Bill.\n\nWhere’s the sample, layout?\n\n\\> Can you get hold of some Israeli comic books for comparison?\n\nIsraeli comic books? (original or transleted?)\n\n"
    },
    {
      "time": " 15.Jan.2008 9.10am",
      "content": "I’ve already produced Cyrillic and Greek styles of Chevin, how difficult would it be to do a Hebrew style?\n\nNick Cooke\n\n"
    },
    {
      "time": " 15.Jan.2008 10.43am",
      "content": "\\>how difficult would it be to do a Hebrew style?\n\nI don’t know, not having attempted a Hebrew script. I was amused to hear Lucas de Groot in a public lecture tell his story of attempting Hebrew. He said that at he first thought, “How hard can it be with just 22 letters?” After the eighth try, with none of his efforts working in his eyes, he gave up.\n\n"
    },
    {
      "time": " 15.Jan.2008 12.23pm",
      "content": "Quite difficult then.\n\nNick Cooke\n\n"
    },
    {
      "time": " 15.Jan.2008 1.52pm",
      "content": "If anybody is interested—and I am—the Type Directors Club of New York is sponsoring one of their non-Latin week-end work shops in April, and [this time it is on Hebrew](http://web.archive.org/web/20080906212221/http:/www.tdc.org/events/education/non-latinweek-ends/2008nonlatsternhebrew.html).\n\n"
    },
    {
      "time": " 16.Jan.2008 12.36pm",
      "content": "Thank you for the ideas! As the time and the budget won´t allow us to comission a font, we have to see, what font is matching to the existing exhibition design. When we made the exhibition about “Jewish Youth in Germany Today” 3 years ago, to be shown in New York and then in Germany, we couldn´t imagine it being shown again and again and even in Israel one day. So no font was chosen that allowes hebrew from beginning on. But it would be great Nick, if you take the challenge to widen the Chevin-family! I´m sure it´s not the last time we have to “upgrade” the whole thing languagewise.\n\nShirah Joie works very well too, we had that font in the very first list, even before posting here. We had the first impression, that it is too heavy, compared to Chevin, but that was wrong. A very close match so far, but just with one weight!  \nNow we found Pauza, from Yanek Iontef, with rounded terminals, 4 weights and we are very happy how it works with Chevin.\n\nCheck [here](http://web.archive.org/web/20080906212221/http:/juedischejugendheute.ag.htwg-konstanz.de/look/fontsfinal.html) for some screenshots and an image of the whole thing in on language only.\n\nI couldn´t get hold of some Israeli comic books yet, but I soon will in TelAviv.  \nIt is interresting and challanging to work with non-Latin alphabets, I´m glad for the experience with Hebrew!\n\n"
    },
    {
      "time": " 16.Jan.2008 12.44pm",
      "content": "Nice. But the translation is not accurate + spelling errors\n\n"
    },
    {
      "time": " 16.Jan.2008 12.46pm",
      "content": "[edit: sorry. double post]\n\n"
    },
    {
      "time": " 16.Jan.2008 2.23pm",
      "content": "We´ve been told about misspellings in the translation we got, but as those examples are the only ones that I have so far …  \nAre there rude meanings due to misspelling and we better take the images down?  \nThanks for telling.\n\n"
    },
    {
      "time": " 16.Jan.2008 2.41pm",
      "content": "Not rude. However, this isn’t the acute problem. The translation is too literal.\n\n"
    },
    {
      "time": " 17.Jan.2008 4.09am",
      "content": "Looking good!, but the Chevin Demi Bold is a bit spacey for my liking at a large size, but overall it is a pretty good ’colour’ match with Pauza Bold.\n\nI’m sorry, but I won’t be extending the Chevin family with Hebrew as there aren’t enough hours in the day to update all my old stuff to OpenType, as well as produce a few new things in the pipeline.\n\nBut thanks for choosing Chevin anyway.\n\nNick Cooke\n\n"
    },
    {
      "time": " 18.Jan.2008 1.48pm",
      "content": "שואלת  \nnot  \nשועלת\n\nAnd I’m amused by the slang “walla” וואללה in the text, which isn’t hebrew at all.\n\n"
    },
    {
      "time": " 20.Jan.2008 9.42am",
      "content": "So I thank you for helping us in the process of decision and to sum this up, I´ll post some images of the final files soon.  \nAs someone spends time in Tel Aviv this february: The vernissage of the exhibition will be on february 28th, at [www.beit-daniel.org.il](http://web.archive.org/web/20080906212221/http:/www.beit-daniel.org.il/ \"www.beit-daniel.org.il\")  \nYou are very welcome. And I hope the translation will be finte till then.  \nTake care  \nSchwertf\n\n"
    }
  ]
}
