{
  "id": "40792",
  "title": "Modern serif typeface for a law firm",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi.\n\nWhat serif typeface would you recomend for a law firm corporate identity?  \nI'm looking for something very modern but with a lot of human touch.\n\nthanks\n\n",
  "author": "marcinpetrus",
  "time": "11 Jan 2008 — 3:33am",
  "uid": "18192",
  "comments": [
    {
      "time": "11 Jan 2008 — 4:17am",
      "content": "I would suggest [Dolly](http://web.archive.org/web/20150324002807/http:/www.underware.nl/site2/index.php3?id1=dolly&id2=weights&idbp2=dolly-family.gif) from Underware.\n\nGeorge Triantafyllakos - backpacker.gr\n\n"
    },
    {
      "time": "11 Jan 2008 — 5:04am",
      "content": "Or  \nFedra Serif A (or Fedra Serif B). And a matching sans is available too, if you need it, Fedra Sans.  \n [http://www.typotheque.com/fonts/fedra\\_serif\\_a/](http://web.archive.org/web/20150324002807/http:/www.typotheque.com/fonts/fedra_serif_a/ \"http://www.typotheque.com/fonts/fedra\\_serif\\_a/\")\n\n"
    },
    {
      "time": "11 Jan 2008 — 5:31am",
      "content": "Have you thought about [FF Absara](http://web.archive.org/web/20150324002807/http:/www.fontshop.com/fonts/downloads/fontfont/ff_absara_ot/)?\n\n"
    },
    {
      "time": "11 Jan 2008 — 5:33am",
      "content": "Yes, Fedra is a better suggestion.\n\n"
    },
    {
      "time": "11 Jan 2008 — 2:14pm",
      "content": "ITC Stone Serif with oldstyle figures (from ITC, not Adobe) is a tremendous workhorse that blooms at 9pt, whereas others mentioned here bloom more at 10pt. And it's very crisp, fairly high contrast, with a large x-height, available in three weights. Dolly, Absara, and Fedra are way too informal, even cute. Stone Serif (use its matching Stone Sans as a sidebar) is just right for a law firm, even aggressively right. Or, Warnock Pro from Adobe.\n\n"
    },
    {
      "time": "12 Jan 2008 — 1:08am",
      "content": "\\>I’m looking for something very modern but with a lot of human touch.\n\n@MondoB  \nThis says to me marcinpetrus is searching for s.th. \"cute\" that could work properly for running text. Dolly and Fedra are in that grid in my opinion. Stone Serif and Warnock not.\n\nWhat is just right for a law firm? Maybe this is the difference between european and american style preferences – to be polemic; Netherlands vs Engravers MT.\n\nAnd Fedra is huge. It contains additionally cyrillic, CE and all the stuff marcinpetrus maybe needs, the guy is from poland.\n\n"
    },
    {
      "time": "13 Jan 2008 — 2:12pm",
      "content": "Dolly has only two weights, and no bold italic, whereas Fedra Serif and Absara are fully equipped. Here in New York, however, those options would never stand a chance with the client, whatever the designer thought of them. They would work for a non-profit agency, though, and for those clients I have used all three at different times.\n\n"
    },
    {
      "time": "16 Jan 2008 — 2:58pm",
      "content": "Any font for all-purpose law firm use absolutely, positively needs lining figures, not old style figures, as the default, not merely accessible via opentype advanced features. Any law firm needs a font that will work with Microsoft Word or WordPerfect, instead of requiring InDesign. That means that Dolly and Fedra are out. They're both too unusual, anyway, and there's something not quite right about Dolly's bold.\n\nStone Serif might work, but I'm not familiar enough with it. Linotype Sabon is ok. Monotype Sabon is too light. Sabon Next and Le Monde Livre are in general very good, but Porchez likes weird pilcrows (Paragraph signs) for some unknown reason, and that might be a dealbreaker for LML and SN (SN has good pilcrows, but only in its small cap set). Linotype Sabon is a little bit too light, but is good otherwise. SN and LML are just about a perfect darkness for law firm use. Abrams Augereau is also very good, but also has a problem with the pilcrow. What's with these weird pilcrows in Garamond revivals, anyway?\n\nYou may think that it's odd for me to be so concerned with the pilcrow (paragraph sign), but whereas, in general, it's little used, in legal work it's used a lot (although that varies with the type of law practice)\n\nPalatino is quite decent, but it may be too common for branding purposes. Or not. 99% of law firms use Times New Roman or similar, and nothing else. Lawyers don't normally ever see Palatino. And it has a nice, conventional pilcrow.\n\nA law firm will almost never use anything as small as 9 point, except maybe in parts of contracts intentionally aimed at being hard to read.\n\nMiller, Escrow, and assorted variants of Century are quite good, IMO, but may seem too old-fashioned for someone who wants something \"very modern.\"\n\nMeridien is good, except the regular is a little bit too light, and the medium a little bit too dark (and not a big enough contrast with the bold).\n\nI'd be inclined to recommend going with Palatino. It's quite good for many uses, and has the advantage of being \"free.\"\n\nKingfisher would be a really good choice, but Tankard made the default figures old style. You need opentype advanced features to get at the lining figures, so most law firms wouldn't be able to. Grrrrr!\n\n"
    },
    {
      "time": "17 Jan 2008 — 6:28pm",
      "content": "As a lawyer and typefreak I started the quest for the real law font as well (maybe a task for highly appreciated Tobias F.?).\n\nAfter tons of printouts etc I'm still not sure which font to use. Minion has a very professional look, but screams boring at the same time...and I would like to add a bit more modern touch as well.\n\nI love the Scala Sans, but the serif in the family not too much.\n\nH&FJ has really great fonts like Mercury or Gotham, but they just not seem right somehow for our profession.\n\nUntil now I have the following fonts in my shortlist to consider:\n\nScala Sans  \nDTL Documenta  \nQuadraat  \nSabon  \nVerdana (looks surprisingly good sometimes)  \nWhitney  \nCorpid  \nStone Sans/Serif  \nSyntax  \nAlber  \nKievit\n\noops... I guess the shortlist is not that short after all... ;)\n\n"
    },
    {
      "time": "21 Jan 2008 — 5:53am",
      "content": "Thanks for all the suggestions.\n\nFedra is what I was looking for - modern but with human touch.\n\nI was also thinking about Eva and Fresco from Our Type.\n\n"
    },
    {
      "time": "23 Jan 2008 — 9:02am",
      "content": "Fedra is definitely nice. I'm somewhat relieved to see Quadraat on OlafElexander's list; several years ago I used it for a legal identity and I think it has been holding up quite nicely. But these days I think I would be much more inclined toward Stone. It's just the perfect temperature.\n\n"
    },
    {
      "time": "24 Jan 2008 — 6:29pm",
      "content": "When I read modern in your post I tought modern as Century or Torino.\n\nHéctor\n\n"
    },
    {
      "time": "19 Jun 2008 — 7:02pm",
      "content": "Very great topic. As a lawyer now I use Palatino font. I find it stylish, elegant, readable and much better than the boring TN Roman. Although something more unique and masculine font - Fedra or Quadraat - would be maybe even better.\n\n"
    },
    {
      "time": "19 Jun 2008 — 10:14pm",
      "content": "_positively needs lining figures, not old style figures, as the default_\n\nWhy?\n\n"
    },
    {
      "time": "19 Jun 2008 — 10:48pm",
      "content": "Because of text like this:\n\n<cite> However, in Pushpanathan v. Canada (Minister of Citizenship and Immigration), 1998 CanLII 778 (S.C.C.), [1998] 1 S.C.R. 982, at para. 25, this Court held that s. 83(1) does not require that the Court of Appeal address only the stated question and issues related to it<cite></cite></cite>\n\nor this:\n\n<cite> Some Canadian courts have imposed, in certain circumstances, a common law obligation on administrative decision-makers to provide reasons, while others have been more reluctant. In Orlowski v. British Columbia (Attorney-General) 1992 CanLII 878 (BC C.A.), (1992), 94 D.L.R. (4th) 541 (B.C.C.A.), at pp. 551-52 <cite></cite></cite>\n\nMost lawyers would find this in oldstyle untidy.\n\n"
    },
    {
      "time": "20 Jun 2008 — 3:17am",
      "content": "So, that’s why all the EULAs and stuff come in daft all-caps? Because most lawyers find ascenders and descenders ‘untidy’? Oh dear!\n\n"
    },
    {
      "time": "20 Jun 2008 — 7:52am",
      "content": "The conventions were developed when typewriters didn't have small caps or bold. Underline was for italics.\n\n"
    },
    {
      "time": "20 Jun 2008 — 11:18am",
      "content": "Now. Now. Not all EULAs come in all caps. LOL\n\n"
    },
    {
      "time": "20 Jun 2008 — 12:35pm",
      "content": "_Most lawyers would find this in oldstyle untidy._\n\n\"Would\" does not make a convincing _prima facie_ case.\n\nOn further reflection, if you are correct in your assumption, I would hypothesize it's a matter of the importance given to legal precedence, with lawyers refering frequently to Law Reports, set in Modern with lining figures.\n\nI have some old 19th century British Law Reports like that. Is that the general style to this day, perhaps updated to Times?\n\nOn a purely empirical basis, lining figures may no doubt be tidy, but they are also lumpy in running text, and even confusing, with the propensity for mixing up 3 with 8. Why would lawyers prefer tidyness to ugly ambiguity?\n\n"
    },
    {
      "time": "20 Jun 2008 — 2:57pm",
      "content": "Some courts in the United States require submissions in Times.\n\nGenerally lawyers nowadays cite from online sources. Most systems render cases and legislation from Westlaw and Quicklw in Arial.\n\n"
    },
    {
      "time": "11 Sep 2008 — 5:27pm",
      "content": "Since at least 1900 (and probably much earlier than that), printed law reports in the US have uniformly used typefaces with lining figures only. The United States Reports (U.S. Supreme Court opinions) use Century Expanded in the printed version, and Century Schoolbook in the preliminary versions handed out to the press and downloadable from the Court's website. I can't remember what typeface the West reporters use, but they, too, use lining figures only. The vast majority of law firms use Times New Roman, which likewise has lining figures only (at least in the standard Windows versions). Legal texts and law school casebooks use lining figures only. And because citations are put in text rather than footnotes, legal briefs and judicial opinions and law school materials use LOTS of figures, vastly more than in, say, an ordinary novel or magazine article.\n\nSo any lawyer whose uses a typeface with old-style figures (I see Georgia from time to time, for example) is screaming \"WEIRD!! DIFFERENT!!!\" As far as 99.9% of lawyers and judges are concerned, that lawyer might as well use P.T. Barnum or Comic Sans or Blue Island. For a profession as hidebound as the law, OSF are a serious no-no. Legal typefaces need to be invisible, and they can't be invisible if they use OSF.\n\n"
    },
    {
      "time": "12 Sep 2008 — 1:39pm",
      "content": "<cite> Legal texts and law school casebooks use lining figures only. </cite>\n\nAspen publishes popular 1L textbooks set in Minion with osf.  \nAnd I've seen publications coming out of the offices of big (national) firms, set in Georgia and Garamond with osf, so things may be changing.\n\n"
    },
    {
      "time": "19 Sep 2008 — 4:42pm",
      "content": "I can't comment on 1L textbooks--I was a 1L 35 years ago, and have no recent 1L texts on hand. And Aspen (recently eaten by Wolters Kluwer) is small potatoes in American legal publishing. But I compulsively went through the several dozen Aspen treatises and texts (maybe 150 volumes in all) in my firm's library, and every single one uses lining figures only. There was one small exception--on the cover and title page of one supplement, \"2007-2008\" was in OSF, but the body text in that volume uses lining figures only.\n\nI also double-checked the U.S. Reports, and they're lining figures only, all the way back to the first volume (1796).\n\nAs I said, from time to time I see legal publications that use OSF, almost always because they're done using a font (e.g., Georgia) that by default prints using OSF in Microsoft Word or WordPerfect . There are virtually no law firms, big or small, that use anything other than such word processing programs for in-house document production. Many (including my firm) often use outside printers when they aren't equipped to do them in house (e.g., for small format U.S. Supreme Court briefs), and those outside printers often use sophisticated layout programs such as InDesign. And my firm and many others farm out production of glossy propaganda sent to clients and prospective clients. But lining figures are still pretty near universal, and that hasn't changed recently. And I'd be willing to bet that the vast majority of instances where OSF are used don't reflect a conscious choice of OSF over LF when both are available for use, but reflect a choice of an alternative font that happens to have default OSF by people who know nothing about typography, but do know that they're ready for a change of pace from Times New Roman and Arial.\n\nTypographically, documents produced by lawyers and law firms, including the biggest and best firms, tend to suck, because few pay any attention at all to typographical matters. Sample legal briefs from any large, prestigious law firm, and you'll see documents that regularly violate every principle in Bringhurst. Why? Tradition, and the choices made by the firm's head secretary back when typewriters were cutting edge technology.\n\n"
    },
    {
      "time": "22 Sep 2008 — 1:13pm",
      "content": "I teach 1L, and two of the leading property casebooks, Singer and Dukeminier & Krier, come from Aspen. The latest edition (and only the latest) of the former is set with OSF. That's enough to refute <cite> Legal texts and law school casebooks use lining figures only</cite>, and to suggest times are indeed changing. If you check the publications of the top national law firms you'll find an overwhelming dominance of lining figure, but also the occasional osf.\n\n"
    },
    {
      "time": "23 Sep 2008 — 7:07pm",
      "content": "For typical legal writing that includes legal citations (e.g., briefs, issues memorandums, opinion letters, judicial opinions) full height lining figures make the most sense, even apart from tradition, and old-style figures don't make much sense. By the same token, for much \"ordinary\" text, old-style figures often make the most sense, even apart from the current vogue for them. Both the tradition of lining figures in legal writings and the vogue for old style figures in more ordinary text have sound reasons behind them.\n\nChoosing between full height lining figures and old-style figures in varying situations should not be an arbitrary choice. In a typical English language novel or newspaper article, for example, text will ordinarily consist of lots of lower-case letters, a few caps (mostly at the beginning of sentences or in proper names), and even fewer numerals (as in dates, addresses, and the occasional reference to money). In such a situation, a short string of old-style figures will tend to \"blend in\" with the rest of the surrounding text, which is mostly lower case, with the normal mix of ascenders and descenders, and which contains relatively few caps and even fewer numerals. Using full height lining figures in such an instance would tend to emphasize the numerals in a string, much as using caps rather than lowercase would emphasize the letters in a string. Ordinarily, such emphasis is not intended, and the overall effect is aesthetically grating. So the current vogue of using OSF makes perfect sense in such instances, particularly if the typeface used has long ascenders and descenders.\n\nIn ordinary legal writing, on the other hand, numerals are much more frequent, because of legal citations. And, within a legal citation, which is where the vast majority of numerals occur in ordinary legal writing, the non-numeral characters are much more likely than in normal writing to be caps, descenderless lower case letters (esp. d, s, t, h), and/or italics (by legal convention, case names, treatise titles, and many other parts of standard citations, are italicized today, and were underlined in the days of typewriters). So the lining figures traditionally used in legal writing blend in much better with the surrounding characters, which in legal citations are very disproportionately likely to be caps, numerals, or descender-less lower case characters. And although typical citations aren't as long as they used to be, there are still plenty of \"string\" citations (citations to several different authorities that say the same thing) and parallel citations (multiple citations to different published versions of a single case), and so legal citations are still often ridiculously long. Indeed, America's preeminent legal writing guru, Bryan Garner, has for some years now been pressing lawyers and judges to remove all citations from the main text of their briefs and opinions, and instead put those citations in footnotes, to prevent citations from breaking up the flow of content in legal text. The idea makes perfect sense, but has not caught on, to put it mildly, despite Garner's considerable prestige and the obvious rationality of his argument. I'm sure there must be professions more hidebound than the law, but I can't think of any, and banishing citations to footnotes takes considerable effort, whereas legal readers are already in the habit of skipping over citations, so the disruption of the flow of the text isn't as great a problem for them as it might be for laymen.\n\nAnyway, in legal citations old-style figures would tend to clash with the surrounding caps and descenderless lower case characters that dominate citations. And the strong legal tradition of using lining figures makes old-style figures look even weirder to ordinary legal readers.\n\nSo in novels, the principle of \"invisibility\" supports the use of old-style figures, whereas in most legal writing, the very same principle supports the use of lining figures.\n\nI have never seen the newest Singer casebook that EK refers to, and know nothing about its typography. I'll take his word that it uses old-style figures. But I'd bet that that choice was NOT intelligently made by a skilled typographer experienced in setting American legal writing and aware of the centuries-old tradition of near-universal use of full height lining figures in that writing. More likely the decision was mindlessly made by somebody who merely intended to be trendy, without the tiniest understanding of when it makes typographical sense to use OSF, and when it doesn't.\n\nThat's not to say that when a lawyer uses lining figures that represents a typographically well-considered choice. For example, the United States Supreme Court by rule now requires briefs and other papers (except in cases where one side is pro se) to be \"typset in a Century family ... 12-point type,\" and no Century family digital fonts have old-style figures available, as far as I know. So old-style figures are simply not an option for those who practice in that court. Other courts also require the use of fonts for which old-style figures either aren't available at all, or are only available at considerable extra cost. For example, Times New Roman is often specifically required by Court rules (it is in my local federal district court) and there are still a few holdouts that require courier or other monospaced serifed fonts (these were until recently the only commonly available computer fonts permitted by the rules of my state's state appellate courts).\n\nMy guess is that the Times New Roman font included \"free\" with Windows is now used by about 99% of America's lawyers of every stripe, from senior partners at Sullivan and Cromwell to solo practitioners in the sticks, for every legal document they create. If that font had default old-style figures, then no doubt we'd see lots of old-style figures in legal briefs and such. We likewise now see lots of small superscripted ordinals (ugh!) in legal briefs for no apparent reason except that since Word 2003 Microsoft Word has had small superscripted ordinals turned on by default, so that, for example, when someone types \"10th,\" the \"th\" is automatically made small and superscripted. This no doubt happened because some unknown person near the top of the Word development team thinks small, superscripted ordinals are cool. Previous versions of Word (or WordPerfect, which used to be popular with lawyers, but which continues to lose what little legal market share it has left) used ordinary lower case as the default in ordinals, so that's all one used to see. You can bet Dan Rather wishes that Microsoft hadn't altered the ordinals default.\n\nSure, there are times when legal writing is much more like ordinary writing than it is like a legal brief or law report. For example, law firm propaganda aimed at lay audiences, as opposed to professional audiences, usually won't be larded with legal citations, as a legal brief or law report would, and may indeed look a lot like a novel or newspaper article in terms of frequency and spacing of caps, lower case, numerals, rarity of italics, and other typographically relevant dimensions. Moreover, such propaganda is more likely to be designed and/or printed by someone who is typographically more sophisticated than an ordinary lawyer or legal secretary. Similarly, for typographical purposes some kinds of lawyerly correspondence might also be more like a novel than like a legal brief. So I would certainly agree that there are occasional instances in which a typographically sophisticated lawyer might be well-advised to use old-style figures.\n\nBut for most uses by most lawyers, lining figures make the most sense, by a long shot, for reasons of tradition AND typography, and it's just plain dumb to use anything else on purpose for all-purpose legal work.\n\n"
    },
    {
      "time": "23 Sep 2008 — 8:49pm",
      "content": "That's a well-argued opinion, and I used to think the same way until very recently (see my earlier post in this thread). But then I found that it did not bother me at all to be reading cases set in osf. I even began setting my casebooks in Minion with osf and although you don't believe a decision like that could be intelligently made, I received nothing but favourable responses.\n\nAt bottom, it is a question of convention and habit. Lawyers have adjusted quite quickly to reading case law on the screen, set in sans. Surely they will overcome osf.\n\n"
    },
    {
      "time": "22 Jan 2015 — 10:53pm",
      "content": "Here, you’ll go through well-defined and efficient working phases to meet the right solicitor for the winning outcome on complimentary free tenure. [Solicitors in london](http://web.archive.org/web/20150324002807/http:/comparedadvisors.com/)\n\n"
    }
  ]
}
