{
  "id": "4080",
  "title": "Poetry set by letterpress",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Im looking for some classic examples of setting poetry. What Im setting is along the lines of biblical prose.\n\n",
  "author": "hildebrant",
  "time": "Thu, 2004-04-01 23:36",
  "uid": "1286",
  "comments": [
    {
      "time": " Tue, 2004-04-06 21:42",
      "content": "Bruce Roger's Paragraph's on Printing (Dover) might provide you some useful examples of classical settings as well as some very good advice on composition and typographic design in general.\n\n"
    },
    {
      "time": " Wed, 2004-04-07 06:47",
      "content": "![howl](http://web.archive.org/web/20050516143031im_/http:/www.typophile.com/forums/messages/30/32855.jpg)   \nAllen Ginsberg's \"Howl\" set in 10/11 Baskerville, 1956.   \nEvery line of verse is treated as a justified paragraph, with 3 pica hanging indent. No hyphenation. Title, Cloister Bold.   \n(Sample is 30% larger than actual size, to show sufficient type detail.)\n\n"
    },
    {
      "time": " Wed, 2004-04-07 08:48",
      "content": "Nick --   \n   \nThat is very unusual. I wonder if the lack of hyphenation was an ideological decision by Ginsberg or the typesetter, or what. It makes for some very gappy lines. This could introduce an unusual dimension in terms of pacing for a certain school of poetry readers, but I can't imagine it was intended by the poet.   \n   \n-- K.\n\n"
    },
    {
      "time": " Wed, 2004-04-07 08:56",
      "content": "Clifford Burke wrote a much-heralded book: The Printing of Poetry about 20 years ago. You might look it up.\n\n"
    },
    {
      "time": " Wed, 2004-04-07 11:10",
      "content": "Jim,   \n   \nI have been trying to locate Clifford Burke, do you or anyone else know his address?\n\n"
    },
    {
      "time": " Wed, 2004-04-07 12:27",
      "content": "\\> \\> \\> Gerald   \n   \nClifford's address is c/o Desert Rose Press P O Box 50 San Jose, NM 87565-0050\n\n"
    },
    {
      "time": " Wed, 2004-04-07 14:59",
      "content": "Very quick,   \n   \nThank you. I have been trying to re-locate him for several years.\n\n"
    },
    {
      "time": " Wed, 2004-04-07 15:02",
      "content": "\\>I can't imagine it was intended by the poet   \n ![howl2](http://web.archive.org/web/20050516143031im_/http:/www.typophile.com/forums/messages/30/32879.jpg)   \nHowl was voiced before it was printed.   \nHere's a more recent version, smooth digital type, rag right.\n\n"
    }
  ]
}
