{
  "id": "40801",
  "title": "Hollywood 40s",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there!\n\nI have a random, vague question...I know there is no _real_ answer, but I am hoping someone can give me some thoughts, good ideas about this one. My client asked for a typeface that is \"hollywood 40s\". She also used the words \"retro\" and \"streamlined\". Any one have any good thoughts for typefaces under this description?\n\nThanks much in advance...\n\n",
  "author": "bethany",
  "time": "11 Jan 2008 — 8:00am",
  "uid": "4464",
  "comments": [
    {
      "time": "11 Jan 2008 — 8:09am",
      "content": "A script I presume? [Coquette](http://web.archive.org/web/20120623052626/http:/www.fontshop.com/search/?q=coquette&x=0&y=0) might be about right.\n\n"
    },
    {
      "time": "11 Jan 2008 — 8:33am",
      "content": "oh, no sorry, I actually forgot that part -- she does NOT want script...and nothing too \"fancy/girly/lacy/delicate\".\n\nBut thanks, Miss Tiffany, for sharing -- what a beautiful typeface!\n\nB\n\n"
    },
    {
      "time": "11 Jan 2008 — 9:20am",
      "content": "How about [MVB Solano](http://web.archive.org/web/20120623052626/http:/www.myfonts.com/fonts/mvbfonts/solano-gothic/)? Too far in the other direction? What is this to be used for? Text? Packaging? Display?\n\n"
    },
    {
      "time": "11 Jan 2008 — 9:50am",
      "content": "oooh, thats nice too. this is a website. the logo has been done in a serif caps and she wants a tagline to offset it. i think Solano might be too heavy. Sorry, I am so wasting your time and you are being so helpful -- but you are introducing a young designer to some beautiful typefaces!\n\n"
    },
    {
      "time": "11 Jan 2008 — 9:55am",
      "content": "This is how I keep limber. No worries. Can you show us the logo or tell us the typeface that was used? Was Solano right if it weren't too heavy?\n\n"
    },
    {
      "time": "11 Jan 2008 — 10:44am",
      "content": "For me 40’s Hollywood really suggests the hand-painted posters, title cards, credits and sho-cards. What kind of material does this need to go with—does it need to evoke epic films, propaganda films, noir? Or just the immaculately dressed stars in fitted clothes side of Hollywood?\n\n"
    },
    {
      "time": "11 Jan 2008 — 10:46am",
      "content": "Streamlined like [Streamline](http://web.archive.org/web/20120623052626/http:/www.fontbureau.com/fonts/Streamline)?\n\n"
    },
    {
      "time": "11 Jan 2008 — 2:25pm",
      "content": "Linotype Metro is actually of that period, and was widely used. In 40s movies, when they zoom in on a newspaper gossip column, you would see Metro in use right on screen. Or, Mostra Bold looks just like hand-lettered block displays on movie posters.\n\n"
    },
    {
      "time": "11 Jan 2008 — 3:10pm",
      "content": "Technically Metro was released in 1928. :^P But, yes, by the time all the newspapers and advertisers got their hot little hands on it making it ubiquitous it might be considered a face of the 40s (more likely the 30s).\n\n"
    },
    {
      "time": "12 Jan 2008 — 7:03am",
      "content": "If you want \"Hollywood,\" you might take a look at [Meyer Two](http://web.archive.org/web/20120623052626/http:/www.fontbureau.com/fonts/MeyerTwo). However, this is technically '20s Hollywood, not '40s. Plus it might clash with your existing serif. Still . . .\n\n-- K.\n\n"
    },
    {
      "time": "2 Feb 2012 — 10:49am",
      "content": "This is way delayed but thanks so much for such wonderful help and insight!\n\n"
    }
  ]
}
