{
  "id": "4081",
  "title": "Robert Indiana \"LOVE\" Statue",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Do you know the typeface used in Robert Indiana's \"LOVE\" statue in Love Park (downtown Philadelphia)?   \n   \nThanks in advance for your help.\n\n",
  "author": "anonymous",
  "time": "11 Dec 2002 — 6:02pm",
  "uid": "1203",
  "comments": [
    {
      "time": "12 Dec 2002 — 2:33pm",
      "content": "The reason I rescinded my Clarendon idea is that there's no weight or make of Clarendon I could find online that has a V with such a heavy thick part. It may be that the artist started with Clarendon and then redrew all the letters to suit his fancy.\n\n"
    },
    {
      "time": "14 Dec 2002 — 3:58pm",
      "content": "i snapped a pic of it when I was in NY. - I don't know the font but here a visual for debate.   \n   \n ![MVC-027F.jpg](http://web.archive.org/web/20150221212133im_/http:/www.typophile.com/forums/messages/83/3282.jpg)\n\n"
    },
    {
      "time": "14 Dec 2002 — 7:25pm",
      "content": "I really liked the statue until just now.   \nalways thought there was some motive for the tilted O. But look! its tilted simply so that width of the statue is uniform it seems   \n   \nIf he didn't use a serifed font he could have had better balance. hmm.\n\n"
    },
    {
      "time": "12 Dec 2002 — 1:17pm",
      "content": "Thanks for the help -- it does appear to be Clarendon, all except for the O. Maybe the artist took the liberties of introducing a custom counter for the O? Any other guesses would be much appreciated. Otherwise, I can redraw the counter and call it good. Thanks again.\n\n"
    },
    {
      "time": "14 Dec 2002 — 7:18pm",
      "content": "What might have made Dave think of Clarendon is that the letters that Indiana used might have been taken from outlines or patterns designed for smaller sizes. Make any typeface with bracketed serifs large enough and it takes on a Clarendon appearance, in a sense. That's one reason display faces are necessary.   \n   \nTo me, big Clarendons usually look good. The letters in this 'LOVE' sculpture don't look good.\n\n"
    },
    {
      "time": "11 Dec 2002 — 6:24pm",
      "content": "You know, I thought that everything except the O looked like Clarendon, but now I think I was wrong. Well, at least I was 1 for 3 today.\n\n"
    }
  ]
}
