{
  "id": "40833",
  "title": "Georgia in print, or how system fonts dominate English-language book publishing in Korea",
  "forum": "Jongseong's blog",
  "tags": [

  ],
  "content": "I'll eventually get to the part where I see a book set in Georgia. But first, some background...\n\nImagine having to typeset a book in a language--and script--that is not your own. That is the challenge faced by Korean publishers who opt to publish books targeting non-Korean readers, ranging from coffee-table books on Korean palaces to academic works and dictionaries. The vast majority of these books are in English.\n\nThe vast majority of these books also suffer from typographic deficiencies stemming from a lack of familiarity with latin-alphabet book design. Many of these are subtle, and even books published in English-speaking countries are not immune to such problems. However, the most visible indicator that an English-language book sitting in the foreign books corner in a Korean book store came from a Korean publishing house is that they use system fonts.\n\nOne treatment that I can't stand is the use of latin glyphs that come with hangul system fonts for setting whole books. Now, hangul fonts include latin glyphs the way latin fonts are expected to include glyphs for numerals. However, most hangul system fonts have mediocre latin glyphs, often with serious spacing problems and squished proportions.\n\n ![](http://web.archive.org/web/20120203191118im_/http:/typophile.com/files/BatangSample_5337.gif)\n\nBatang, the default hangul serif font for Windows users, is actually not even close to being the worst offender (at least it's not mono-width). But a sample should be enough to show that it is too light and the descenders are too dramatically shortened to work well for latin book work.\n\nThe standard of latin portions of commercial hangul fonts has improved quite a bit in recent years, but I don't remember seeing them in English-language books. Maybe that's because if publishers are savvy enough to use commercial fonts, then they would be using latin-centric fonts in the first place.\n\nSo it is with some relief, however ironic, that I see books set in the ubiquitous Times New Roman. Quite a lot of Korean academic publishing uses Times New Roman. I think I've also seen Palatino.\n\nNow, add to the mix... Georgia! The web's favourite serif has been added to the palette of Korean English-language book publishing. A couple of days ago, I spotted in a Korean book store an interesting paperback volume called [_Dawn of Modern Korea: the Transformation in Life and Cityscape_](http://web.archive.org/web/20120203191118/http:/www.ehbook.co.kr/eng/books/book_view.asp?bei_idx=10005&brand=1) by Andrei Lankov. I picked it up, and lo and behold, the text of the book was set in Georgia.\n\nI was pleasantly surprised by how Georgia worked as a book face. The dark colour certainly helps, especially compared to the spindly latin letters of Korean system fonts. The old style figures are a definite plus.\n\nIt does show that Georgia has been designed for a medium that doesn't reward subtle details, but that doesn't matter, because the simplicity of the finish is integral to the design, and the letterforms are basically indestructible.\n\nI wish I could compare it with Miller, the typeface designed for print that Georgia was based upon, but I've never seen it printed. But Georgia holds up well in print, much better than one might expect.\n\nI wonder if others have seen or even used Georgia in print work. Is this rare? It is, after all, a system font. What are your thoughts on this? I still don't think I would use Georgia as a first choice for book work, but if I suddenly find myself restricted to using system fonts for book work, I think I've found my workhorse.\n\n",
  "author": "<a href=\"/web/20120203191118/http://typophile.com/user/12009\" title=\"View user profile.\">Jongseong</a>",
  "time": "<br>",
  "uid": "12009",
  "comments": [
    {
      "time": "",
      "content": "In high school I co-founded a newspaper for all the kids in town. It was how I started to learn about graphic design. We used Georgia for text, I think.\n\n"
    },
    {
      "time": "",
      "content": "@Jongseong  \nCan you scan of the \"printed Georgia stuff\" and publish here some pages via PDF or large pict? Thanks in advance.\n\n"
    },
    {
      "time": "",
      "content": "Thomas, I wish I could provide scans or pictures, but this was a book that caught my eye browsing in a book store which I decided not to buy. While it deals with an interesting subject, I can only buy the books I absolutely need with my current budget, and too many books catch my eye each time I visit the book store. First, though, I need a camera; my sister took the one I had and now I'm camera-less. Also, I must be the only Korean without a camera-phone. If I had one, I might have sneaked a shot of a sample spread right on the spot, though that's against the store policy.\n\nI'll be on the lookout for more \"printed Georgia stuff\" though, and I'll share it here if I do. Meanwhile, if anyone else sees Georgia in unlikely print applications, I'd appreciate pictures or scans as well.\n\n"
    },
    {
      "time": "",
      "content": "The current publishing organization I'm in used Georgia 8pt for its magazine. People had trouble reading; although the reason was not limited to its typographic problems. I'll post a picture when I get the time. I, too, am camera-less.\n\n"
    },
    {
      "time": "",
      "content": "I've now seen Miller used in print, in the Financial Times Magazine, and it's beautiful. Without having compared them side by side, I would still guess that Georgia in print pales in comparison. Some of the forms in Miller are more elegant, such as the ear of the g and the details in the figures, and overall I have a feeling Miller is somewhat lighter than Georgia in print.\n\nI still think Georgia is a more than competent design for print, more so than people usually give it credit for. Yes, it is a design optimized for screen and seems a bit chunky and inelegant beside Miller, but it is still superior to a lot of digital fonts when printed. Especially the latin glyphs that come in hangul fonts.\n\n"
    },
    {
      "time": "",
      "content": "I scanned a portion of our school magazine which uses Georgia 8pt (or 8.5, but it seems to be 8) for its body text. They will be using Arno Small Text 10pt for the main copy from now on, though. I don't know if that will work for a magazine, especially with Arno's flourishes.\n\nAnyway, I don't have a nice scanner to work with, so the image does no justice to the sharp and crisp print on the paper.\n\n ![](http://web.archive.org/web/20120203191118im_/http:/typophile.com/files/Picture-003_4766.gif)\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the scan! Georgia seems to hold up well there, though of course it's maybe because we're seeing a low-resolution scan.\n\nI also have to say Arno doesn't strike me as a typeface for a magazine (at least if it doesn't aspire to be bookish), but I will refrain from making a judgement before I see it.\n\n"
    },
    {
      "time": "",
      "content": "As soon as I get my hands (borrow) on a good digital camera, I will upload spreads using Georgia. There are a lot of them back in the pub room. I think the potential of Georgia in the scan is quite hindered by using it at just 8 points. Or maybe I want to see it in 10 points. :)\n\nArno might be too elegant for magazine use, but... we'll see. I'll hopefully have scans/pictures of the magazine spread using Arno within the next two weeks.\n\n"
    },
    {
      "time": "",
      "content": "We finally have the magazine proof and Arno Small Text 10x11 pt works... wonderfully, though it's not economical. I'll post pictures when the press is done printing, if you don't mind. :-)\n\n"
    }
  ]
}
