{
  "id": "40843",
  "title": "Helvetica—the film",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I received the CD on Helvetica and was surprised that there were a few inaccuracies in the story of the development of the Helvetica family. There wasn't any information about the first release of the Helvetica family which contained some of the Anzeigen Grotesk fonts and the competition of families such as Folio. When I worked with Saul Bass he preferred the Folio series over the first release of Helvetica. The official type face for the city of West Berlin was the Akzidenz Grotesk Buch designed by G.G. Lange for Berthold and not Helvetica. The Neue Helvetica was shown and not mentioned as a remake by Linotype.  \nHaving lived during that period of early Helvetica and worked with both Bauer, Berthold and Stempel I was aware of the competition and the maketing. The first typographer in the USA to put in the Helvetica was Spartan Typographers in Oakland, California and the fame of Helvetica from there. If you run across the original showing can see a hodge podge of fonts.\n\nI LIKED THE FILM\n\n",
  "author": "Robert Trogman",
  "time": "12 Jan 2008 — 5:09pm",
  "uid": "12824",
  "comments": [
    {
      "time": "12 Jan 2008 — 7:47pm",
      "content": "Its a great story and probably hard to get 100% correct. Thanks for sharing the correct information... Have you shared this in any other way? And, If you don't mind me asking, what was it like working with Mr. Bass?\n\nI also liked the film.\n\n"
    },
    {
      "time": "12 Jan 2008 — 8:50pm",
      "content": "As I recall this historical stuff wasn't part of Gary's original plan for the film. But anyway although it's technically a documentary I think it’s aims to be entertaining rather than historically accurate- you know, like that Al Gore film, or a Michael Moore movie.\n\n"
    },
    {
      "time": "13 Jan 2008 — 9:46am",
      "content": "Having never watched an interview with any of those famous typographers, I really appreciated those talks, which I found greatly inspiring (and eventually found myself reading this board very often). I now consider myself an infected typophile, even though I have rather limited knowledge on the subject\n\n"
    },
    {
      "time": "13 Jan 2008 — 11:53am",
      "content": "My friends and I recently organized a screening of the Helvetica film in our college. I was interesting to see the type of students that turned up. Most of the students came from a design background, but a few that didn't have a major interest in type still sat through the whole movie. Entertainment-wise it does have its funny moments, it also gave us visual communication students a chance to make a poster and promotional helvetica badges for the screening. As you do...Have a [look](http://web.archive.org/web/20131106231527/http:/www.sudoassociates.com/projects/helvetica-screening/).\n\n"
    },
    {
      "time": "13 Jan 2008 — 1:53pm",
      "content": "albriks  \nI had about 2 1/2 years working for Saul Bass. He had a big staff of designers that submitted work to him for approval and he usually  \npicked a simple solution and was a great teacher. His film work was not a financial success; especially with clients like Otto Preminger. He created a whole industry for motion picture title design. I even acted in commercials for him. Probably the biggest project I worked on was the film titles for \"Mad, Mad, Mad, World\". There were 24 actors that had 100% billing and had to be the same size, but different type faces. I remember doing the credits on an Easter Sunday. He was associated with the famous film maker Haskell Wexler and Saul was able to direct the cinema photography as well as the graphics. It was a creative experience I'll never forget!\n\n"
    }
  ]
}
