{
  "id": "4088",
  "title": "Sloped roman and italic in the same family",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm reading Bringhurst and I came across his discussion of sloped romans and italics (p. 56-59). This triggered a series of questions in my mind.   \n   \n1) Is there a family that has sloped romans and italics? (serif or sans)   \n   \n2) If there are any (or if any were made) would you use sloped romans for accents and italics for emphatic speech? Or would you avoid the sloped roman, as Bringhurst suggests?   \n   \nJust some random thoughts...\n\n",
  "author": "<a href=\"/web/20100522182020/http://typophile.com/user/2172\" title=\"View user profile.\">Chris Rugen</a>",
  "time": "<br>",
  "uid": "2172",
  "comments": [
    {
      "time": "",
      "content": "1) Fairfield is close, with Italic and Caption styles   \n   \n2) Hmmm... worth a try\n\n"
    },
    {
      "time": "",
      "content": "Another possibility: use one style for things such as titles or foreign words, and the other for speech/ emphasis.\n\n"
    },
    {
      "time": "",
      "content": "From _Stanley Morison: his typographic achievement_, by James Moran:   \n   \n\"However, Morison's liking for the Arrighi-style italic was not followed when Van Krimpen designed Romulus, cut by Monotype in 1936. Its italic applied Morison's theoretical ideas in his essay _Towards an Ideal Italic_ where he had urged that the only function of the italic was to support the main roman letter. Romulus was therefore a sloped roman, but the result was not a happy one for the reader, as A. F. Johnson observed in a review in _Signature_ (No. 13, 1940) where he stated of the 'sloped roman': 'This may be logical, but results in a stiff and monotonous letter.' Both Morison and Van Krimpen later considered the experiment to be wrong in principle, but they discussed a script type for the Romulus family, and out of this came Van Krimpen's exquisite Cancelleresca Bastarda.\" (p. 142)   \n   \nAs to more modern use of the sloped roman, Knuth (1986) -- although he did not specifically design a sloped roman -- advocates use of a mathematically sloped roman in the context of mathematical text: \"Slanted roman type was introduced in the 1930s, but it first became widely used as an alternative to the conventional italic during the late 1970s. It can be beneficial in mathematical texts, since slanted letters are distinguishable from the italic letters in math formulas. The double use of italic type for two different purposes -- for example, when statements of theorems are italicized as well as the names of variables in those theorems -- has led to some confusion, which can now be avoided with slanted type.\" (p. 13)   \n   \nPersonally, I have an aversion to slanted roman type; this is no slight against Romulus. Rather, it stems simply from seeing so many bad examples of artifically sloped roman type in advertising and text.   \n   \nJon\n\n"
    },
    {
      "time": "",
      "content": "Chris, this is something I've researched a good deal.   \n   \nSome fonts have had an italic that was replaced with another. Think Bembo. Some fonts have had a sloped-Roman which was later replaced by so-called \"true italics\". Probably the best example is Electra. Morison influenced the creation of Electra's first italic. His ideology was solid (for a change), but he went in the wrong direction, taking the idea too literally. Other fonts have had two italics, one more italic than the other. Porbably the best example is Seria (although its first italic is unusable for emphasis). There's also a font which didn't have any italic at first, so people auto-sloped it. When the designer released a true italic, many users clamored for the old one! So the designer released the sloped-Roman as a true separate alternative. That font is Treacy's Arrow.   \n   \nThen there's Sauna, which has two italics with different levels of cusiveness (but the same slope).   \nThis is the closest thing to the \"ideal\" that I've found, except:   \n1) It's not a text face.   \n2) You really want less cursiveness overall, especially in the less cursive one.   \n   \nMy Patria has an italic that's not really a sloped-roman but it's very rigid. There's also a second italics (at the moment with incompatible proportions however - a long story) which is basically a sloped-Roman with semi-serifs. It's called Harrier, and I actually see it as a next-generation book face.   \n   \n\\>\\> \"Slanted roman type was introduced in the 1930s   \n   \nMore like the 1830s... Well, in the second half of the 19th century.   \nMost notably by Tuleu, Deberny's bastard son.   \n   \nThe true age of sloped-Romans is a little-know fact, which Morison deftly covered up. In the end, his single good idea was unoriginal. It's a good thing he wrote a lot of books.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "ff Danubia: Roman, Italic, and Script.   \nThe Italic is not a sloped roman, but like Fairfield there are two \"emphasis\" alternates.\n\n"
    },
    {
      "time": "",
      "content": "You can see Electra's sloped-Roman here:   \n [http://www.typophile.com/forums/messages/30/7437.html](http://web.archive.org/web/20100522182020/http:/www.typophile.com/forums/messages/30/7437.html)   \n(About 3/4 of the way down.)   \n   \nBTW Chris, check out this old thread!   \n [http://www.typophile.com/forums/messages/30/663.html](http://web.archive.org/web/20100522182020/http:/www.typophile.com/forums/messages/30/663.html)   \n   \nLastly, here's the oldest sloped Roman I've found, from about 1870:   \n [http://www.themicrofoundry.com/other/Javal\\_italic.gif](http://web.archive.org/web/20100522182020/http:/www.themicrofoundry.com/other/Javal_italic.gif)   \n   \nBut mechanical sloped-Romans (the kind Morison claimed he invented) were in use by ATF before the turn of the century - although unlike the French effort it had to do with saving money, not ideology or style.   \n   \n\\> I renounce any authority on Dwiggins.   \n   \nOh, come on!   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "This is a topic of great interest to me.   \n   \nTiffany: Perhaps you meant 'upright italic' for Gill's Joanna? I've heard the first (private press) edition of Gill's _An essay on typography_ was set entirely in Joanna's italic (which was once called Felicity).   \n   \nI feel that Joanna's italic might be a little too compressed and its slope too subtle to perform well as a supporting type\n\n"
    },
    {
      "time": "",
      "content": "I'm very glad Electra has been discussed here; I'd neglected to recall its italic/cursive evolution. If you have Tracy's wonderful _Letters of Credit_, you will find another specimen of Electra's first italic on p. 179. See also the text on pp. 179-180 for more information on this. Another specimen of the original Electra italic appears in Carter's _Twentieth Century Type Designers_ on p. 69.   \n   \nWith regard to Gill's work on Perpetua and its associated Felicity, see also Carter's aforementioned work (p. 76) and Morison's _A Tally of Types_, pp. 97-104, particularly p. 102: \"The theoretical discussion about 'sloped roman' had not been without its influence on the italic but the rejection of f [straight-serriffed descender] in favour of f [curved descender] proves that the calligraphic past of italic was still robust and capable of holding its position in the typography of the future.\"   \n   \nAnd so it has.   \n   \nJon\n\n"
    },
    {
      "time": "",
      "content": "\\> Morison wanted italic types that are not too different from their   \n\\> roman counterparts, that perhaps share similar widths and proportions.   \n   \nFrom the famous Fleuron article -where you can see for example Morison taking a Roman, slanting it, then modifying it slightly- it seems that he was advocating an italic structurally similar to the Roman, yes, and even highly so. His problem with the conventional italic is that its informal structures introduce an unnecessary skewing of the Roman's \"voice\". And he was right. For a reader the only real marker of an italic is its slope (which is why upright italics are just a bad joke). As a result, a sloped-Roman is in fact the ideal. This doesn't mean however that all the serifs have to be maintained, or the \"a\" has to remain binocular, etc. First of all, it has to look nice. But the point is that it doesn't have to be cursive to look nice. If you look at the Deberny sample I linked to, you'll see a truly intelligent as well as attractive rendering of a slanted-Roman (unlike the stuff Morrison's contemporaries produced).   \n   \n\\> Trump Medi\n\n"
    },
    {
      "time": "",
      "content": "A couple of responses/corrections to comments above. I'm sorry I don't have time to get into this really fascinating thread.   \n   \nTiffany: I would not call Joanna italic a sloped roman. It is very rigid, certainly, but that is typical of all Gill's italics. Joanna italic has a single-storey a and many other 'true italic' forms, e.g. the e and g.   \n   \nKeith: Felicity is the proper name of Perpetua italic, not Joanna. [Perpetua and Felicitas](http://web.archive.org/web/20100522182020/http:/www.newadvent.org/cathen/06029a.htm) (anglicised as Felicity) are saints martyred, with others, at Carthage in 203AD.\n\n"
    },
    {
      "time": "",
      "content": "\\> I would not call Joanna italic a sloped roman.   \n\\> Joanna italic has ....   \n   \nBut look at the foot serifs, and that \"f\"!   \nSince there isn't (and maybe can't be) a formulaic way to decide if an italic is a sloped-Roman or if it's so-called \"true\", I'd suggest that the important thing is the overall impression. To me, Joanna italic's rigidity, along with some strong Roman features (and weak cursive features) really seem to make it more a sloped-Roman than not.   \n   \nAnother \"litmus test\" might be my Patria's italic\\*. It is in fact structurally derived directly from a Roman framework, but the serifs have been pulled out, softer terminals grafted, and some structures altered - but mostly there's a strong mechanical relationship with the Roman. But is it a sloped or a \"true\"? In fact I think it looks more \"italic\" than Joanna's, but maybe it isn't?   \n   \n\\*   \n [http://www.themicrofoundry.com/other/nour&patria/dev/patria-italic.gif](http://web.archive.org/web/20100522182020/http:/www.themicrofoundry.com/other/nour&patria/dev/patria-italic.gif)   \n [http://www.typophile.com/forums/messages/29/805.html](http://web.archive.org/web/20100522182020/http:/www.typophile.com/forums/messages/29/805.html)   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Since there isn't (and maybe can't be) a formulaic way to decide if an italic is a sloped-Roman..._   \n   \nI generally take the lowercase a as the key letter in determining whether an italic is a sloped roman. Foot serifs and general rigidity, even a non-descending f, these are all found in historical sloped lettering styles that are clearly not sloped romans per se, and which certainly predate the typographic concept of a sloped roman. I think we're making a mistake if we divide all sloped lettering into either 'sloped roman' or 'true italic': there is a variety of sloped lettering, which deserves to be more thoughtfully considered. Joanna italic certainly isn't cursive, but it is very far from being a sloped version of the roman: the compression of the letters is extreme, and quite contrary to Morison's idea of a sloped roman as a subservient style.\n\n"
    },
    {
      "time": "",
      "content": "Chris --   \n   \nAs others have already mentioned, Electra was originally released with a sloped roman counterpart. This was subsequently augmented with a more traditional italic design (designated Electra Cursive), which is the only companion to be found in current digital versions.   \n   \nIn response to your second query:   \nThe best example I know of is Rudolph Ruzicka's design of the two-volume tribute to Dwiggins that was published by the Typophiles after WAD's death -- _Postscripts on Dwiggins_, Typophiles Chap Books 35 & 36 [The Typophiles: New York, 1960.]   \n   \nThe trim size is 4.5 x 7\". The text is set in Electra, 10 / 12 x 19p6, 32 lines deep. Ruzicka specified the use of both the original italic and the cursive for different kinds of distinctions. Within text, the cursive is used for emphasis, foreign phrases, and titles of works; but captions and extended extracts from writings or interviews are set in the sloped roman. The effect is subtle and quite interesting.   \n   \nI don't think I have the entire Electra correspondence, but I have Griffith's dossier on the project. When I get a chance, I'll look through it to see if there is anything substantial to report about the development of the two italics.   \n   \nI have an ambition to redigitize Dwiggins's Electra, going back to the original Megenthaler drawings as the primary source. However, I have not yet been able to secure the appropriate permissions. Part of my plan is to include both versions of the italic.   \n   \n-- K.\n\n"
    },
    {
      "time": "",
      "content": "\\> quite contrary to Morison's idea of a sloped roman as a subservient style.   \n   \nDo you think Morison wanted the italic to totally blend in, only standing out in terms of slant? I guess that could be. And maybe that validates my feeling that he was taking the idea too literally. To me, the point isn't to preserve the structural formalism, but simply to avoid introducing a skew in the \"voice\" (which cursiveness will generally do).   \n   \n--   \n   \nKent, great plan!   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "My Master's thesis actually had a lot to do with the structural differences between roman and italic.   \n   \nPersonally, I'm in agreement with the idea that structural change in the letterforms is the critical feature in determining when you've got an italic instead of a sloped roman. If you want one big change to point at, I agree with John that a change from a double story to single story \"a\" is probably the clearest indicator.   \n   \nI can see a usage for a less distinctive italic when it is going to be set fairly separately from the upright. But when it is being used mixed in with roman text, contrast is exactly what it necessary to help it stand out enough. It's just a question of what's enough contrast; I think it's pretty clear that I'm in the mainstream as believing that a cursive element is helpful in creating the necessary amount of contrast. My impression is that the kind of \"ideal italic\" Hrant would favor, I would find useless in any situation where it had to mix with roman.   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "Nice Master's topic! A copy of the paper anywhere?   \n   \n\\> contrast is exactly what it necessary to help it stand out enough.   \n   \nSure. But:   \n   \n\\> It's just a question of what's enough contrast   \n   \nDegree of \"aggregate contrast\" shall we say is indeed the central issue, and we can talk about that (including the difference between the degree people [think they] want versus the degree designers tend to think they need versus the degree they _actually_ need), but the real point here I think is the _types_ of contrast that can be used, and which are suitable in what ways.   \n   \nItalics can stand out in various ways, such as slant, cursiveness, color, apparent size, narrowness, etc. and certainly most italics combine more than one of these\\*. What we need to try to figure out is:   \n1) How much each factor contributes to the contrast, and in what contexts (most significantly in terms of display versus text work).   \n2) What other \"baggage\" does each factor bring, and how is each type of baggage good/bad with respect to the italic's primary role (emphasis in a body of the Roman).   \n   \n\\* Patria's for example uses ALL the ones I list, mostly because I decided to make its slant very slight (1/16 = ~3.58 degrees), and it needed help pulling away from the Roman.   \n   \nA telling indication that cursiveness is insufficient on its own is the simple truth that an \"upright italic\" (which I prefer to call \"cursive roman\") just doesn't work for emphasis.   \n   \nMy feeling is that cursiveness:   \n1) Does indeed add to contract, but not much.   \n2) Is not _indispensable_ for good functionality.   \n3) Can help or hinder depending on the nature of the Roman (and its proper use). For example, cursiveness is less welcome in a news face than it is in a coffee-table book about Italian art. Cursiveness brings an informality to the setting that might or might not be a good idea; in fact I think it's really a lousy default choice of contrast tactic. Part of the reason is that I think chirographic Romans are themselves flawed.   \n   \nMost of all, I think what needs to be admitted is that _slant_ is in fact the primary axis of differentiation, especially in immersive reading, where structural pedantisms such a deeper angle in the arches of h/n/m/u are secondary (even tertiary, when you consider that color for example is more significant). This is common sense, actually, and the main people resisting this obvious fact are chirographic type designers, who want cursiveness to have a power it simply can't. When they ridicule the sloped-Roman, it's not because they have any proof that it's less functional (the proof would show the opposite!), it's because it counters their \"faith\". Others favor cursiveness simply because \"them's the way me pappy always made 'em\".   \n   \nWhat we need is some progress.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "My Master's thesis topic was actually extreme form change in multiple master fonts. But to embody that problem, I did an MM that morphed from a Venetian roman to a very cursive italic. So I also studied the difference in the forms a lot, and in some different ways than most people have needed to look at them. I learned lots about the problems (and solutions) of linear interpolation along the way.   \n   \nYou did a good job of enumerating the typical differences between roman and italic. Although I agree that the slope is perhaps the single largest factor in visually distinguishing the typical italic from the roman, I don't think it's possible to make a simple formula for the relative contributions of each of the differentiating factors. Indeed, I think that if one was expressing it mathematically, that some of those differences are perhaps multiplicative with each other, or some other more complex relationship.   \n   \nPersonally, I think there's nothing wrong with some cursiveness in an italic. Too much will interfere significantly with readability, but of course if italic is reserved for emphasis, a \\*little\\* slowing down is not necessarily bad.   \n   \nThe part of this where we disagree most strongly is where you bring in all the anti-chirographic screed. It's not that I'm particularly strongly in the chirographic-is-inherently-good camp. But I do think that there is some significant truth to the idea that people are the most comfortable reading fonts that have familiar structure and rhythm. For the Latin script (and many others) that familiar structure and rhythm has a lot to do with the chirographic underpinnings of our printed language.   \n   \nIn a country with sufficiently strong centralized control, it would be possible to change this by decree and just do fonts with no chirographic basis. It would just take 50 years or so. Unlike you, I don't think this would necessarily be \"progress\"; it would just be different.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "\\> an MM that morphed from a Venetian roman to a very cursive italic.   \n   \nHey, I'd really really like to see that font. Is it something you'd publish for general appreciation? I think we can learn a lot from it.   \n   \n\\> some of those differences are perhaps multiplicative with each other   \n   \nWell stated.   \n   \n\\> Too much will interfere significantly with readability   \n   \nAs will too much slant (which is one reason why Patria's is so slight). But really in this case I'm more concerned with \"atmospheric\" conflict with the Roman.   \n   \nChirography: maybe we should stay away from that angle for a change. My main point isn't that anyway - I'm concerned that an italic that has a different level of chirography than the Roman is less useful, because it dilutes the focus of the font's \"voice\". There's a reason fonts have paired Roman-Italics!   \n   \nRate of progress:   \nIn this age of \"democratic\" type design, there's really only one way: people should think about what's needed, and make fonts accordingly, and throw them out so their ideas take life on the ground, slowly but surely.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "I'm not sure that there's much to be learned from it, really. What I learned in doing it was much more interesting than the font itself. The intermediate forms are far from being usable. You've got double-sided serifs turning into one-way cursive exit strokes and the like.   \n   \nBut it is kind of entertaining seeing the two story a turn reasonably smoothly into a one-story a, and the roman ampersand (&) turn into the \"et\" style ampersand. ![:-)](http://web.archive.org/web/20100522182020im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nOn the chirography front, in my mind a different level of chirographic tratment is just another aspect of the distinction between italic and roman. Indeed, I would say that the stronger calligraphic underpinnings of italic are traditionally one of its defining features.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "As promised, here are a few tidbits I dug up.   \n   \nExcerpts from two letters from Dwiggins to Griffith, which confirm that he was influenced by Morison's article:\n\n> March 22, 1932.   \n> \"I send with this . . . trials for my italic. You will remember when we were talking about it once we said let's try something not like the usual italic form. This shot is not like the usual italic. It might be called slanted roman. Stanley Morison was advocating something along this line, as better for words in an otherwise roman set-up that wouldn't jump out of the page so much as the usual italic.   \n> \"This attempt, as you will see, has roman style serifs, etc., -- idea is to have it color just like its accompanying roman -- same weights and finishing features. \"   \n>    \n> June 14, 1932.   \n> \"My gag has been -- working along the lines suggested by Stanley Morison -- to make an italic that would be weighted the same as the roman; keeping the texture of the page, and still breaking away from the roman far enough to do the trick that italic is used for. This [Electra Italic] will unquestionably keep the texture pretty, the test will be to see if it separates enough to do the trick.\"\n\n(It should be noted that the drawings for this italic would have been made by hand -- that is, I don't believe that Dwiggins made use of any photographic manipulation to arrive at his sloped roman.)   \n   \nGriffith, in one of his commentaries, provides this evaluation of the circumstances surrounding the birth of the second italic:\n\n> \"The oblique roman letter, misnamed italic, designed as a running mate with Electra Roman, failed to perform the service that an italic is used for: contrast, emphasis. It was successful, however, in keeping the texture of the page, but so much so that it did not break away far enough to provide a sufficient degree of contrast. Used apart from the roman as an individual face in its own right, this so-called italic possesses essential virtues that make it uniquely appropriate and felicitous for poetry, separatist texts, etc., for its allusive clearness and dignity. . . .   \n> \"With the growth in popularity of Electra as a book text face, the demand became insistent for a more conventional form of italic, particularly the lowercase characters, to provide the necessary break in texture of the printed page. Accordingly, WAD set out to develop a lowercase alphabet in the cursive form which would meet the requirements and at the same time look well in conjunction with oblique style of capitals, numerals, etc., previously made for the original italic.\"\n\nDwiggins's first attempts in this direction were actually quite bizarre, with some distractingly exotic forms for 'g r s' and an idea for some rather swashy capitals. He also faced some challenges working within the constraints of Lino duplexing.   \n   \n-- K.\n\n"
    },
    {
      "time": "",
      "content": "I actually think Electra's slanted-Roman failed because it _wasn't_ \"pretty\". In terms of contrast, I think it had plenty, and anyway that's not the point - the point is cursiveness is not an absolute requirement for effective contrast, and slant works much better. As for the way \"texture\" is used in that correspondence, I think any slanted form naturally has a very divergent texture from a Roman, more so than an \"upright italic\" in fact.   \n   \n\\> some distractingly exotic forms   \n   \nWhere can one see these?   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "I agree with Dwiggins insofar as slant alone is not sufficient for contrast, as well as creating ugly shapes.   \n   \nI do agree with Hrant that cursivity is not a requirement for effective contrast (though I think it is a near-requirement for historical reasons, as outlined earlier). Slant is a near-requirement for effective contrast, though I think that if one combined form change, lighter weight and more condensed width, it might be possible to do an upright italic that had sufficient contrast to \"work\" in that sense, though I think it would probably fail simply because it violated reader expecations.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "\\> slant alone is not sufficient for contrast   \n   \nAre you sure? If the slant is steep enough\\* why wouldn't the emphasis click?   \n   \n\\* Although I do agree that might introduce other problems.   \n   \n\\> Slant is a near-requirement for effective contrast   \n   \n\"Near-\"? Upright italics don't work - giving them enough difference in the other dimensions (like color, width, etc.) causes more problems.   \n   \n\\> violated reader expecations.   \n   \nHere you're getting into conscious expectations (especially those of designers versus laymen) versus what's actually adequate. I really have a hard time imagining that laymen would consciously mind Electra's sloped-Roman. They have trouble telling apart Times and Quadraat. But if by \"expectations\" you mean the subconscious kind, then you have more of a case, but the question becomes: how do you really know?   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Getting back to Chris's second question, I have little doubt that most if not all of us on this list would avoid mathematically sloped romans altogether; they look like crap. The programs for my kids' violin recitals are done largely in sloped Mrs Eaves roman (hit the I in Word, and that's what you get); every time I see this, my blood pressure goes up by at least 20 points.   \n   \nI should say, however, that an exception to my general aversion to sloped or obliqued romans is the \"italic\" of Cyrus Highsmith's excellent Prensa. But for a few characters -- a, f, k, and n -- the italic is an obliqued roman, and in my opinion, it works really well.   \n   \nJon\n\n"
    },
    {
      "time": "",
      "content": "Personally, I find that overly steep slants on italics are jarring and distracting. But maybe that's just me. But I have to admit that for contrast only, there is certainly some amount of slant that is sufficient.   \n   \nActually, that brings to mind an observation. System-slanted \"faux italics\" are usually at 20 degrees I think, while 10 to 12 degrees is typical of real italics. Perhaps the OS designers thought they needed that much slant in the absence of the other changes in form.   \n   \nAs for expectations, I wasn't thinking of them necessarily being conscious expectations, no.   \n   \nAs for differences in weight, if you look carefully or do some measurements, you'll find that the overwhelming majority of italics are slightly lighter in weight than their roman counterparts. Now, they're also slightly narrower, but in general the reduction in weight goes just a tad beyond the amount necessary to maintain the same color. FWIW, I'm pretty sure Robert Slimbach agrees with me on this, unless I'm completely misremembering a conversation we had a few weeks ago.   \n   \nBut we're talking a pretty subtle difference in weight, nowhere near the amount one has between one weight and the next in a series. In most typefaces, italics are definitely a more subtle form of emphasis than boldface. Of course there are exceptions--Galliard Italic springs to mind.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "In an attempt at an answer to Stephen's question above, had Fairbank's italic indeed been paired with Monotype Bembo, it would have appeared lighter on the page than its roman counterpart.   \n   \nMore timely examples of types in which the italic appears a bit lighter than the corresponding roman might include Centaur, Spectrum, and Weiss. Off the top of my head, I cannot think of any examples of fonts for which the italic is darker than the roman variant.   \n   \nJon\n\n"
    },
    {
      "time": "",
      "content": "Stephen:   \n- Many italics are slightly lighter than the Roman (including Patria's, which you've said you like :-).   \n- I actually agree that a darker weight (rarely a full Bold though) is better for emphasis than an italic.   \n   \n\\> Prensa ... But for a few characters -- a, f, k, and n -- the italic is an obliqued roman   \n   \nYou don't think the switch to semi-serifs is significant?   \n   \nThomas: auto-slants actually vary a lot.   \n   \n\\> I cannot think of any examples of fonts for which   \n\\> the italic is darker than the roman variant.   \n   \nUnibody.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> You don't think the switch to semi-serifs is significant?   \n   \nSignificant? If you're asking whether I feel that the unilateral serifs add a degree of \"cursiveness,\" I would say no. They do, however, introduce a different degree of momentum to the italic, don't they; more dynamic than static...   \n   \n\\> Unibody   \n   \nI do not see this. Can you help, or is it presbyopia...?   \n   \nJon\n\n"
    },
    {
      "time": "",
      "content": "Well, I think semi-serifs do actually add some cursiveness, because they sort of emulate in/out strokes (and that's the bad news). But my point was something else: you said Prensa's italic was a sloped-Roman except for different structures on four letters; while I think the change from double to semi serifs is significant - in terms of texture, hence contrast. A \"true\" sloped-Roman (funny) should have full double serifs, no? Or at least a lot more serifs, like in that Deberny face.   \n   \nAs for dynamism, is it coming from the \"seminess\" of the serifs, or actually just the slant?   \n   \nBTW, let me ask something:   \nHow would you compare Prensa's italic with Harrier?   \n [http://www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif](http://web.archive.org/web/20100522182020/http:/www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif)   \n   \nUnibody:   \nIt's slight. I only realized because Nick Shinn pointed it out. Unibody's italic is narrower than the roman, but has the same stroke widths (1 pixel) and letterspacing (2 pixels). This makes it darker.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_I actually agree that a darker weight (rarely a full Bold though) is better for emphasis than an italic._   \n   \nThis is something that really gets on my tit: if you ask people what italics are used for, one of the typical answers is 'for emphasis' (indeed, the 'em' tag in HTML is interpreted almost exclusively as applying italics: you have to make a different choice explicit in your CSS if you want something other, e.g. bold). But this is often followed by the observation that 'bold is actually better for emphasis'. The problem of both the response regarding the use of italic and the observation regarding bold is that it makes no distinction between **visual** emphasis and _linguistic_ or _articulatory_ emphasis. The main use of italics within text is for articulatory emphasis, the typographic equivalent of verbal stress. This is completely different from visual emphasis, which unless used to denote shouting has no verbal equivalent: it is usually navigational or indicative of information hierarchy, e.g. to highlight a warning or some other particularly important message in a text. So when you talk about using italic or bold for emphasis, be clear about what _kind_ of emphasis you mean.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif](http://web.archive.org/web/20100522182020/http:/www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif)  \n   \nThis is absolutely beautiful!   \n   \nThe bigger differences between the two lie more with finish than with the fundamental architecture; with regard to the latter, they may be said to be fairly similar. Readily apparent differences between the two are: (1) a steeper slope and greater stroke angularity in Prensa, (2) the two- (Harrier) vs. one-storey (Prensa italic) lower case a, and (3) the beak (Harrier) vs. quasi-lachrymal (Prensa italic) lower case f.   \n   \nYour face, Hrant, more closely rides the line between roman and italic than any other font I've seen!   \n   \nWith regard to the dynamism I perceive in Prensa's italic, to me it derives more from the unilateral serif placement than from the slant; silly as it may sound, the letters seem to be taking a step in the right direction (no pun intended, really), which is important in a language that is meant to be read from left-to-right. It's the same dynamic effect that I get from Avance (in both the roman and the italic).   \n   \nAn answer (albeit a poor one indeed) to Chris's first question above is Optima, which has an italic and an oblique. The differences between the two are slight but perhaps most noticeable in the lower case f.   \n   \nJon\n\n"
    },
    {
      "time": "",
      "content": "\\> articulatory emphasis ... is completely different from visual emphasis   \n   \nReally? The thing is, in 99% of typesetting emphasis is one-dimensional: you choose a style (usually italics) that will make words stand out, irrespective of what they're standing out for, so to speak. And I'm not sure that italics and bold really represent qualitatively different aspects of speech; you could say that an italics of very steep slant \"shouts\" more than a demi weight.   \n   \nBTW, technically there's no contradiction in saying that \"italics are used for emphasis\" and \"bold makes for better emphasis\". Also, I really haven't heard this second statement often at all - your typical typographer certainly won't agree to that.   \n   \n--   \n   \nJon, I'm very pleased you like Harrier\\*. Would you see it being used as a book face? I mean as a \"roman\", not an italic.   \n   \n\\* You should know however that -just like at the Westmnister show- Harrier is an underdog - pardon the pun. Many other type designers can't stand it, and it caused a Really Famous one to recently exclaim \"you still don't know what is a counter and how counters are the key of good typeface design\". But the opinion of a [discriminating] _user_ is always more valuable to me than that of another type designer...   \n   \nOptima: yes, that's an interesting new dimension, that you now have two italics to choose from (a bit like Arrow). I think the same will happen (or has already?) with Frutiger.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think I agree with John here, in that boldface is used for different kinds of emphasis. I would also add that on average, a bold creates a much heavier emphasis than an italic. Yes, it's possible to design an italic that creates more emphasis (e.g. Galliard), or make weights close enough together that they create less emphasis.   \n   \nBut again, this is not how italics and boldface have generally been designed, nor (as John points out) how they have been used. I'm sure this won't change in my lifetime, and I'm not going to be saddened by this, as I don't feel that we're missing out on some particularly wonderful alternative.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "(Agree with John H about the visual or text emphasis. Not the same thing, text one is part of the writer job, visual part of typographer job).   \n   \nAssuming with start from a Serif roman, attempt to list various way to create an italic in not particularly order, some ways can mixed with others:   \n-- Electronic slope   \n-- Electronic slope, visually corrected by a designer.   \n-- Condensed version   \n-- Roman all serif became semi serif with flat serifs or close too.   \n-- Cursive serifs, in various degrees.   \n-- Ligher weight   \n-- Cursive version from a subtil difference to a Aldus/chancery style   \n-- Different glyphs forms   \n   \nThen, depending of the wishes of the designer, to fit to a style, type category, skills of the designer (!), Morison views, to be creative, innovative, to fit the brief of the client, brand needs, etc. the result can be very different.   \n   \nIn my early years of type design, I tend to like Aldus style cursivity with low slope. Such my Angie. Then, I experimented in my own way \"Morison ideas\" with Apolline (true Aldus cursivity, narrow, lighter, different glyph forms, but Roman serifs). Later, I after various others experiments, I tend to think that is really depending of the subject, some designs need innovative italics, others very traditionals ones.   \n   \nAnd more more, I try to don't \"re-event cold water\" when I design a new face. Caps are caps, lowercases are lowercases, and italics are italics! but always there way to play with forms to have fun (one of my main concern).\n\n"
    },
    {
      "time": "",
      "content": "_\\>you choose a style (usually italics) that will make words stand out, irrespective of what they're standing out for, so to speak._    \n   \nThis is not true at all, at least not in my profession. Hrant, when was the last time you typeset an author's text?   \n   \nMost of the time, italics are used to make the text different, not stand out -- foreign words and phrases, titles, etc. When I set those in italic, I don't want them to _stand out._ The author doesn't want them to stand out. When you look at the page, you aren't supposed to necessarily see those elements first. Heck, that's really true even of articulatory emphasis. I don't think you should notice a use of italics for emphasis _standing out_ from the page.   \n   \nNow, heads, subheads, run-in heads, these are supposed to stand out. And a bold is much more effective here (or a change in size).   \n   \n-- K.\n\n"
    },
    {
      "time": "",
      "content": "_\\>\\> some distractingly exotic forms   \n\\>Where can one see these?_      \n   \nYeah, yeah; I should have known you'd ask. Okay, here you go. Keep in mind, this is from a mediocre photocopy. Those are Griffith's rejections.   \n   \n ![Electra Experimental Italic](http://web.archive.org/web/20100522182020im_/http:/www.typophile.com/forums/messages/30/32621.gif)   \n   \n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Kent,   \n   \nThe world is now ready for his exotic italic. (At least I am)   \nWho do we petition to allow you access? :-)   \n   \nRandy\n\n"
    },
    {
      "time": "",
      "content": "Great thread.   \n   \nThe world needs Kent to do a great version of Electra, as opposed to the current pathetic digital version. You can add my signature to that petition!   \n   \nHrant, I second Jon's admiration of your 'Harrier'. I don't know if it works in text, but in your sample it 'clicks' - it has coherence and panache.\n\n"
    },
    {
      "time": "",
      "content": "\\> I don't feel that we're missing out on some particularly wonderful alternative.   \n   \nI don't know about \"wonderful\" either, but certainly there's something a bit off about using italics for emphasis, and a good typographer will consider alternatives no matter how slight the benefit.   \n   \n\\> Hrant, when was the last time you typeset an author's text?   \n   \nPractically never. My claim comes from observation. In 99% of the typesetting on this earth (and Kent, you can certainly consider yourself in the other 1%), there's the roman, and then there's its italic, and the latter is used for any kind of differentiation, including article names, single words, etc. Yes, they're coming from different places (and if that's what John meant then, sure, I agree), but as far as the reading process is concerned the \"micro\" functionality is the same. Now if you're asking for some sort of formalization for \"the masses\" to use _two_ forms of differentiation instead of just italics, then you're asking for even more than me! I'm simply asking for people to use a Demi (for everything), instead of italics. And onsceen typography is actually heading this way; if ideology won't facilitate the shift from slant to color, maybe technological limitation will! :-/   \n   \nHey, that strange WAD italic is interesting! Mostly I'm glad to see it's not an idea about a funky italics that I've had myself...   \n   \n(William: thanks!)   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Wow, I was away from Typophile all weekend, and now my mind is reeling from the wealth of discussion here. This'll probably be a long post.   \n   \nFirstly, I find it appropriate that Electra comes up in this topic, since I've been a fan of it ever since I discovered it back in school. In fact, it was a large subliminal (and later a direct) inspiration for my first attempt at typeface design. I've always been drawn to lighter faces (a child of the digital age, I suppose), but now I'm starting to find many of them too thin and spindly. In fact, the roman I designed is probably more of an anemic, poorly-fed light face rather than a roman. So, Kent, if you revive Electra, I will be forever in your debt.   \n   \nSecondly, I'm fascinated by the possibilities of these two variations, to the point that I'd want to incorporate both into any serif design I'd end up doing (I still hold out hope that I'll get to it). Although, I abhor the mathematical 'faux' italics of word processing, so it would be interesting to see where my tastes would lead me.   \n   \n--   \n   \nIn reference to the emphasis discussion (bold v. italic/ high contrast v. low contrast), I avoid bold weights in text scrupulously, unless forced by 'marketing concerns'. When I post on the web, I'm emulating my speech (which is often sarcastic or ironic), so I use italics for subtle emphasis, and bold for more blunt emphasis. But in printed text, I think I'd use capitals before I'd use bold, solely because of the color difference in the words. I'm not sure where or when I came to this conclusion, but there it is. I reserve bold for heads, typically. I guess this strikes at editorial/ authorial decisions as well. Why use caps for yelling, one could just preface with, \"He yelled...\"?   \n   \n--   \n   \nAnyway, concerning the sloped v. italic: I would never give up what I consider the rhythmic beauty of a well-matched calligraphic italic in a field of serenely vertical romans. It may not be the most efficient or theoretically sound choice, but I don't think that makes it less effective.\\* However, the idea of supplementing a family's range of voice with a sloped roman does seem like an intriguing idea (Though I'm treading ground that's already been covered here, I suppose.)   \n   \nPerhaps I hold this view for the same reason I wear my great-uncle's manual-winding wristwatch: it's a connection to the past (as Thomas points out) that just feels right... and still works.   \n   \n\\*Interesting side anecdote: I once had to defend the somewhat out-of-context serif italic affectations of Gill Sans italic to a client, who thought they were 'wierd'. I believe they were implying I should faux-italicize instead. Oh, they know not what they do... Fortunately, I cut that debate short before it got out of hand.\n\n"
    },
    {
      "time": "",
      "content": "Randy --   \n   \nDwiggins's \"exotic\" italic was never developed. It was nixed (for good reasons, IMO). It might have been interesting on its own, but it was a poor companion for Electra. It looked really ungainly in-line.   \n   \nHrant:   \n_\\>there's the roman, and then there's its italic, and the latter is used for any kind of differentiation, including article names, single words, etc. Yes, they're coming from different places (and if that's what John meant then, sure, I agree), but as far as the reading process is concerned the \"micro\" functionality is the same._    \n   \nThe micro functionality is to be different, not to stand out. Perhaps we have a semantic misunderstanding. When you say \"stand out\" I think you mean that the emphasized word or phrase should be more obvious than the surrounding text -- which is what I think a demi-bold accomplishes.   \n   \nHowever, I do not think that is what should happen in 99% of typesetting. Nor do I think that is what \"the masses\" would want to accomplish when they are seeking to supply emphasis.   \n   \nYes, italic disrupts the roman \"voice\"; but I would suggest that this is precisely what most people are trying to show with italic -- when they italicize a word or phrase, it is to indicate a shift in tone. I would be willing to bet that most nontypographic people, when asked, would say that italic is like a change in voice, while bold (or demibold) is like a change in volume. (I don't think that is just a \"1%\" perception.)   \n   \n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Chris, in design -unlike Art- _other people_ are more important.   \n   \n\\> Perhaps we have a semantic misunderstanding.   \n   \nPossibly.   \nThe purpose of an emphasis style is simply to differentiate, visually. The context (for example, if it's a magazine title, or a single word) will determine what the reader makes of it. My concern is simply to:   \n1) Ensure proper saccading.   \n2) Avoid a skew in the voice.   \n   \nA typical italic will accomplish the first, but generally fail in the second - it will introduce a _perceptive_ informality (not just a \"shift in tone\") that's not necessarily appropriate (certainly not a newspaper for example). A typical bold will fail in the first (it will cause errant fixations because of its extreme contrast), but succeed in the second. Because failure in the first is more obvious than failure in the second, people will favor italics over bold. But you _can_ have both, with a carefully balanced demi.   \n   \nLook at the Bold of Mana-16 and see how much better than an italics it works.   \n   \n\\> would say that italic is like a change in voice, while   \n\\> bold (or demibold) is like a change in volume.   \n   \n1) I'm not so sure laymen will say this.   \n2) It matters less what they say, versus what they feel.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_The purpose of an emphasis style is simply to differentiate, visually._   \n   \nYes, but differentiating visually does not necessarily involve **visually emphasising** which is what happens when you change weight. Such visual emphasis draws immediate attention to the bold words, overriding normal reading, which is the intent: visual emphasis says 'look here'. Articulatory emphasis, using italics, makes a visual distinction, but it is not a distinction of visual emphasis. Italics do not say 'look here', and they do not override normal reading; rather, as you are reading they subtly signal that a word is of a different order to the words around it, either because it is a foreign word or because it is _stressed_.   \n   \nI disagree that typical italics introduce a 'perceptive informality'. I see nothing informal in the typical italic, e.g. Bembo. If anything, such italics are much more formal (literally, _formata_)than sloped romans, which tend to look like toy versions of their upright versions.   \n   \nA 'carefully balanced demi' is still darker than the surrounding text. It is still going to draw the eye to it: even before one starts reading at the top of the page, one is going to be aware of this dark area in the lower peripheral vision. It is still going to say 'look here'\n\n"
    },
    {
      "time": "",
      "content": "_1) I'm not so sure laymen will say this._    \n   \nPresuming the layman is a competent and experienced reader, give him a piece of text in which a _stressed_ articulation is indicated in italics. Ask him to read it aloud. He will stress the italicised word. Whether he understands conceptually that italicisation indicates a change in voice, he practices the convention.   \n   \n_2) It matters less what they say, versus what they feel._   \n   \nIt matters less what they feel than what they _do_. They articulate.\n\n"
    },
    {
      "time": "",
      "content": "\\> Such visual emphasis draws immediate attention to the bold words   \n   \nNot if it's not too dark. An overly-italic italic has the exact same problem that a too-dark bold has. An emphasized word needs to draw a saccade from the correct range: the fixation before it, but not before that. The correct amount of contrast does this, and this is at the perceptive level, way before the reading mechanism has had time to figure out any higher-level information such as what the emphasis is about.   \n   \n\\> I see nothing informal in the typical italic   \n   \nReally? That's strange. So Noordzij is wrong there [too]?   \n   \n\\> He will stress the italicised word.   \n   \nConsciously, sure. But:   \n1) What about the -more important- immersive mechanics? No such thing happens there.   \n2) There's also a rise in amplitude/volume, just like you \"accuse\" a darker weight of having.   \n   \nI think you're assuming too rigid and superficial an interpretation of what actually goes one during reading. For one thing, silent reading is totally removed from articulation. At least let's not regress so many hundreds of years, please.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"_Chris, in design -unlike Art-_ other people _are more important._ \"   \n   \nI take it this is in response to my bit of prose on my preference for italics. In which case, I agree completely. However, as the appointed guide for the reader through the author's text, as long as the rest of the choices support that preference, then my personal preferences and my service to them shouldn't be at odds. I'm willing to accede that there's a relative subtlety in the sloped romans compared to the italics. But the italics click more for me when considering their common usage as an indication of importance, extra considerations, emphasis, emotion, tone, etc. (excluding titles, which is partially what sparked the questions in the first place ![:-)](http://web.archive.org/web/20100522182020im_/http:/www.typophile.com/forums/clipart/happy.gif) ). This is most likely a moot point, since I tend to use the faces of others, rather than create my own. So, the choice is made for me in most cases.   \n   \n\"_But you_ can _have both, with a carefully balanced demi._    \n   \nAnd a controlled, quality printing environment.\n\n"
    },
    {
      "time": "",
      "content": "\\> my personal preferences and my service to them shouldn't be at odds.   \n   \nI think they _must_ be at odds - but \"naturally\" so - it's a dynamic that can be used well or poorly. Humans can't help being individual and creative - but it's the way you harness that energy which makes the difference between Craft and Art. So for example:   \n   \n\\> italics click more for me   \n   \nNo doubt, and nobody should condemn you for your feelings. But then you have to consider the differences between want and need, between consciousness and the subconscious, and between us and laymen. You have to ask what clicks for _users_, and if that doesn't click for you then to me that's the real test of a designer: the process of compromise itself should click for you, should turn you on. Otherwise it's merely art.   \n   \n\\> And a controlled, quality printing environment.   \n   \nThis is admittedly a very good point: a demi will get lost in lo-fi printing more than an italic. However:   \n1) Lo-fi printing is less demanding in terms of readability anyway. So for example you would use a heavier demi and live with the occasional errant saccade, since they're going to happen a lot anyway. Agreed, this make a demi less desirable in lo-fi printing, but there's still a gain: you're avoiding a skewed voice.   \n2) This still doesn't justify cursiveness in an italic. It's the slope that counts.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_For one thing, silent reading is totally removed from articulation._   \n   \nAre you saying that silent reading is effectively monotonous? I do not think that silent reading is _totally_ removed from verbal articulation, especially not when one is reading a novel and is dealing with dialogue or articulated narration. But note also that I am not claiming a direct or constant parallel between verbal and typographic articulation. Using italics to indicate foreign words is also typographic articulation, assisting higher level processing of text. I use the term articulation because of the parallels that often do exist and because typographic articulation, like verbal articulation, makes the meaning of language clearer.   \n   \nI suspect we are talking at cross purposes, again, because you are obsessing about what happens in the lowest level of reading comprehension -- word identification -- and I am talking about typographic articulation that exists primarily to assist higher levels of reading comprehension -- textual understanding. Once again, I take readability as a given -- it's not an achievement, it's a prerequisite --: there's no point to any sophisticated typographic articulation if people can't read. But people can read, and do read, and the goal of their reading is not word identification _but textual understanding_.\n\n"
    },
    {
      "time": "",
      "content": "Something I forgot to mention:   \nI actually think that a _lighter_ weight in a body of a slightly darkish font might work even better\\*. Admittedly this is even rarer than people using a bold/demi for emphasis. In fact the only example I've seen firsthand is Interactive Weak magazine, before the most recent (?) redesign: they used Interstate for some side material and a lighter weight of it for emphasis (although probably more out of necessity than \"ideology\"). One type designer whose fonts might be very appropriate for such an emphasis technique is Smeijers.   \n   \n\\* The reason might be that the black in a conventional font takes up less surface than the white.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Dwiggins had a typeface with both. I have images. I'll find them and post them.   \n   \nStanley Morison wrote an article trying to convince people that the sloped roman was more appropriate (?) that the traditional italic.\\*   \n   \n\\*Although I don't recall the entire reason.\n\n"
    },
    {
      "time": "",
      "content": "Or ... Display size and text size ... if I'm following you correctly.\n\n"
    },
    {
      "time": "",
      "content": "Very few people have seen Electra's sloped roman. (I renounce any authority on Dwiggins. I've forgotten almost everything, and besides we have Kent here to fill in those blanks.)   \n   \nGill's Joanna also counts as a sloped roman.\n\n"
    },
    {
      "time": "",
      "content": "I can't think an example where an italic of a different color/weight is a good thing.   \nCan someone show me? I feel the contrast should be in structure and slant, not weight.   \nIf even page color is not a priority, why not just use bold?\n\n"
    }
  ]
}
