{
  "id": "40890",
  "title": "new cafe logo please crit",
  "forum": "Design",
  "tags": [

  ],
  "content": "I would love some feedback on the logo for Headfood.  \nHeadfood is the new canteen for Vega the Brand Communication School. Vega is South Africa’s premium school of design and branding. The idea is for the canteen to create food culture activities. It is the opposite of fast food and we want people to cerebrate their food (correct spelling - cerebral + celebrate ). The basic premise is that good food please all the sense and thereby  \nstimulate the minds of young designers and innovators. The canteen will combine good natural food with technology like fingerprint identification for account holders and a beautiful stark interior.\n\nI used Joshua Darden’s great Omnes font for the logo. Any feedback - spacing, legibility? I plan to use Omnes for all Menu boards and associated communication, and would like to laser cut the logo out of thick wood at the entrance.\n\nplease help?\n\n ![](http://web.archive.org/web/20081007180718im_/http:/www.typophile.com/files/headdomnes_3484.jpg)\n\n [‹ I need to re design my company logo please guide me.](http://web.archive.org/web/20081007180718/http:/www.typophile.com/node/41026 \"Go to previous forum topic\") [thesis/dissertation layout ›](http://web.archive.org/web/20081007180718/http:/www.typophile.com/node/41114 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007180718/http://www.typophile.com/user/21926\" title=\"View user profile.\">newageadam</a>",
  "time": "<br>",
  "uid": "21926",
  "comments": [
    {
      "time": " 14.Jan.2008 10.56am",
      "content": "NewAgeAdam\n\n"
    },
    {
      "time": " 14.Jan.2008 10.57am",
      "content": "NewAgeAdam\n\n"
    },
    {
      "time": " 14.Jan.2008 2.36pm",
      "content": "It seems like a great idea, but I struggled to read it. I’m wanting to read the H as an I.\n\n"
    },
    {
      "time": " 14.Jan.2008 5.42pm",
      "content": "It does seem like a great idea. I might narrow the head a bit — perhaps echo the shape of the D that forms the mouth — to make the character appear less overweight. It looks fun, but it also looks a bit fatty, which runs counter to your description.\n\n"
    },
    {
      "time": " 16.Jan.2008 5.46pm",
      "content": "This is tough. The H reads as I.\n\n"
    },
    {
      "time": " 18.Jan.2008 2.58pm",
      "content": "I agree, The H reads as an I. But I do think it’s a great concept and would love if you made it work smoothly.\n\n"
    },
    {
      "time": " 18.Jan.2008 4.37pm",
      "content": "Maybe you could make some sort of H/fro-pick. Could be quirky\n\n"
    },
    {
      "time": " 18.Jan.2008 5.26pm",
      "content": "I had to read your post to understand what it said.\n\n"
    },
    {
      "time": " 18.Jan.2008 7.04pm",
      "content": "You might find people read IDea FooD alternately, or even first, which seems to distort and reinforce the actual name. You’ve also got this sort of black face issue to consider.\n\n"
    },
    {
      "time": " 20.Jan.2008 7.41pm",
      "content": "It seems like it might read better if you rotated both the e and the a - all the other letters are sideways. The fact that the e and the a have a normal orientation probably helps to create the H reading as an I problem - it may be far easier to read if people don’t have to decide which way to read each letter; make it obvious which way the H/I should be read. You could still have the e and a on the same line as above\n\n-Rafe\n\n"
    }
  ]
}
