{
  "id": "40919",
  "title": "OT Font Naming (Mac-Pc)",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’m currently at the export stage on a few fonts and was looking for some insight on a few preferences in regards to generating OpenType PS files.\n\nI’ve followed the naming conventions suggested by Adam Twardoch except I have abandoned the short name usage (Instead replacing Reg with Regular, Lig with Light etc). I’m curious if it’s standard to keep the ’Use PostScript FontName as FullName on Windows’ option checked.\n\nThe reason I ask this question is that ideally I’d like the name of the font, when accessed through an application menu to be similar to mac just for reasons of integrity such as ’Example’ as the font family and the sub menu of ’Regular’, ’Light’, and ’Bold’… keeping it simple… but on PC with this export button mentioned above checked I’m assuming the font will come up as ’ExampleRegular’, same as the Postscript Name field.\n\nI know there are previous topics on font naming but it all seems rather confusing with the cross-platform and cross-application differences.\n\nDoes anyone have any thoughts on generating OpenType PS fonts on Mac that need to be cross platform compatible? Any tweaks or adjustments to create a real consistency in the majority of ’current’ applications and software utilized by creative professionals? (Meaning I’m not really worried about Mac OS 9, Windows 97’, Microsoft Word, ATM etc…)\n\nThanks,\n\nMike\n\n [‹ Short Family Short Style breakdown](http://web.archive.org/web/20080116041003/http:/typophile.com/node/40948 \"Go to previous forum topic\") [Font now 'not working' ›](http://web.archive.org/web/20080116041003/http:/typophile.com/node/40767 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080116041003/http://typophile.com/user/17099\" title=\"View user profile.\">Mike Jarboe</a>",
  "time": "<br>",
  "uid": "17099",
  "comments": [
    {
      "time": " 15.Jan.2008 1.09am",
      "content": "If you generate PS OpenType fonts then “Use PostScript FontName as FullName on Windows” is a _must_ to make sure that your fonts will not conform to the specs. (If you generate TT OpenType fonts, then this is not required.)\n\n[a] <cite>I’ve followed the naming conventions suggested by Adam Twardoch except I have abandoned the short name usage (Instead replacing Reg with Regular, Lig with Light etc).</cite>  \n[b] <cite>The reason I ask this question is that ...</cite>\n\nI am not sure if I understand.  \n[a] What do you assign as ’Family Name’ and ’Style Name’, and as ’OT Family Name’ and ’OT Style Name’? You have read this in Adam Twardoch’s document but to emphasize it: For a family to work in Windows it is important that a family as defined by the ’Family Name’ does not have more, or other, styles (i.e. ’Style Name’) than Regular, Italic, Bold, Bold Italic.  \n[b] Windows applications usually show the ’Family Name’ only, and styles are accessed by Bold/Italic buttons. I cannot remember of any Windows application showing ’PS Font Name’ or ’Full Name’ in the font menu, so in _this_ respect, it does not matter how ’PS Font Name’ and ’Full Name’ look like. (It is different with Adobe applications. These show ’OT Family Name’ and ’OT Style Name’ in the font menu, and only if not present, show ’Family Name’ and ’Style Name’.)  \nWhat is important for cross-platform compatibility of _Word_ documents is that in the regular style, ’Font Name’ is identical with ’Mac Name’, or if you don’t provide the latter, ’Font Name’ is identical with ’Full Name’ (see [here](http://web.archive.org/web/20080116041003/http:/typophile.com/node/17059)).\n\n"
    },
    {
      "time": " 15.Jan.2008 1.46am",
      "content": "Track (always interesting and confusing topic).\n\n"
    },
    {
      "time": " 15.Jan.2008 6.18am",
      "content": "Hm, I use the exact settings (as far as I know ) as were placed on that FontLab MSNGroup by Adam, and that works fine on Windows.\n\n"
    },
    {
      "time": " 15.Jan.2008 8.34am",
      "content": "me — <cite>is a must to make sure that your fonts will not conform to the specs</cite>\n\nShould be:  \nIf you generate PS OpenType fonts then “Use PostScript FontName as FullName on Windows” is a _must_ (to make sure that your fonts will conform to the specs).  \n[no “not”]\n\nMike Jarboe — <cite>I’m curious if it’s standard to keep the ’Use PostScript FontName as FullName on Windows’ option checked.</cite>\n\nNow I see that this is all you want to know. Answer is yes.  \nForget the rest of my post; I was confused by things you wrote about menus etc ...\n\n"
    },
    {
      "time": " 15.Jan.2008 8.49am",
      "content": "Thanks… yes my main question is if I should keep that option checked but in as welll I’m looking for insight via individual responses as this topic of font naming seems rather complex.\n\nI really just wished that there wasn’t such a difference between Mac and Pc font menu structure (another topic) as I want the font menu and sub menu’s to be as similar as possible between platforms and applications.\n\nRight before export I started looking into the ’Generating OpenType PS’ preferences and that started my curiosity.\n\n"
    }
  ]
}
