{
  "id": "40929",
  "title": "baseline grid and font size calculations",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Dear Typophiles,\n\nHow do I choose (or calculate) the font size i use in a publication, and all the bigger and smaller sizes that will be used in it? and how to calculate the baseline grid (70% of font size space between the lines is that right?)\n\ni understand the page size, how many columns and all elements connect to each other in this calculation, how do i start? are there any equations available on the internet that i could use?\n\nthis is in the process of redesigning a magazine, which already have the page size and the font type (but even font will be changed later) or should the font be changed first and then start calculating the sizes?\n\nthanks alot,\n\nb.\n\n",
  "author": "b",
  "time": "15 Jan 2008 — 4:45am",
  "uid": "23727",
  "comments": [
    {
      "time": "15 Jan 2008 — 6:05am",
      "content": "Hey b, I'm from the school that chooses the text font and size first. This is usually between 8.5 and 11 or so points, depending on how the typeface relates to the em (not a big deal), the overall density of the text face you choose, and the age and/or reading abilities of the perceived audience and your column width. The last three are the bigger issues. There are a lot of other ways, but usually a mag in redesign know what the logo and the text look like as they fill in between.\n\nCheers!\n\n"
    },
    {
      "time": "15 Jan 2008 — 6:14am",
      "content": "\\> are there any equations available on the internet that i could use?\n\nIt doesn't really work that way. This is design, not engineering, and as a result the answer to most questions is a qualitative \"what looks good\" rather than something quantitative.\n\n"
    },
    {
      "time": "15 Jan 2008 — 7:25am",
      "content": "<cite>the answer to most questions is a qualitative “what looks good” rather than something quantitative</cite>  \nI second that: Print it, look at it, trust your eyes. No secret math formula involved.\n\n"
    },
    {
      "time": "7 Feb 2009 — 12:00pm",
      "content": "Printing out a series of samples placed in columns works well. I would also do some research looking at different magazines and find ones that have a size that you like. Bring a ruler measure in mm for a more exact measurement or a pica ruler and then convert to points. you can download a demo application called the Art Directors Toolkit it is an amazing time saver, it also does grid calculations and more. check it out here: [http://www.code-line.com/software/artdirectorstoolkit.html](http://web.archive.org/web/20131020194008/http:/www.code-line.com/software/artdirectorstoolkit.html \"http://www.code-line.com/software/artdirectorstoolkit.html\")  \nI would not go any smaller than 7.5pt sans serif face or 8pt serif, it is all about legibility and aesthetics in the end.\n\n"
    }
  ]
}
