{
  "id": "40920",
  "title": "Plural words that require small caps",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Here is a predicament that has been bugging me for the past year. I never know what to do with a pluralized word that requires [small caps](http://web.archive.org/web/20131023200028/http:/typophile.com/wiki/small%20caps). I have inquired within the pages of Elements, Chicago Manual, and a few type books back from school.\n\nTake for instance the words TVs or GMOs. Should they be set like this;\n\n\\< sc \\> TV \\< /sc \\> s  \n\\< sc \\> GMO \\< /sc \\> s\n\nOr should all the letters be set in small caps? My art director says that we should just leave them capitalized (TVs GMOs) and ignore the small caps in this instance. I, by nature, push back against him. Thoughts, guidelines, rules, opinions … anything would do. Take care.\n\n",
  "author": "eastonwest",
  "time": "14 Jan 2008 — 11:02pm",
  "uid": "16215",
  "comments": [
    {
      "time": "14 Jan 2008 — 11:37pm",
      "content": "This is one reason why small caps should be designed slightly larger than the x-height (height of the lowercase 's'). What typeface are you using?\n\n"
    },
    {
      "time": "14 Jan 2008 — 11:51pm",
      "content": "That always bugged me when I was art directing.  \nMy solution was to use the  \n\\< sc \\> TV \\< /sc \\> s  \nstyle, but bump up the size of the small caps a tad, so that there was a noticeable difference from lower-case x-height.\n\nOccasionally, if the face had a larger small cap, that wasn't necessary, so that's the way I make my small caps now.\n\n"
    },
    {
      "time": "14 Jan 2008 — 11:52pm",
      "content": "I wouldn't use small caps for something like \"TV\". Usual practice is to use full caps for two or three letters, and small caps for four letters or longer. I can't think of any of the latter that would ever be pluralized, with the exception of OB/GYNs which I think has been making the move to lowercase lately.\n\n"
    },
    {
      "time": "15 Jan 2008 — 12:11am",
      "content": "_I can’t think of any of the latter that would ever be pluralized,_\n\nFinancial products, e.g. RRSPs, RRIFs, RESPs. These are Canadian, but I would imagine there are similar things in other countries.\n\n"
    },
    {
      "time": "15 Jan 2008 — 3:24am",
      "content": "[A related thread](http://web.archive.org/web/20131023200028/http:/www.typophile.com/node/33815) about small caps in mixed-case abbrevations like PhD, GmbH &c.\n\n"
    },
    {
      "time": "15 Jan 2008 — 6:16am",
      "content": "I wouldn't use small caps either, no matter how many letters -- and that's a position supported by pretty much every North American style guide. Chicago says, however,\n\n_The alternative use of small capitals for acronyms is followed by some publishers, but the University of Chicago Press favors the use of full capitals._\n\nLike most editorial decisions, it's a matter of sticking with a choice: that one can justify a choice certainly helps. :-)\n\n"
    },
    {
      "time": "15 Jan 2008 — 9:56am",
      "content": "I've read that American magazines will often go sc for acronyms at 4 or more letters. To me it would look strange to see 3 and 4 letter acronyms mixed in a list, or even in the same text.\n\nHere's one to add to the sc pile of queries—what do you do with a possessive apostrophe in a heading set in sc? My instinct would be to drop it down so it optically fit as if the heading was in all caps.\n\n"
    },
    {
      "time": "15 Jan 2008 — 11:06am",
      "content": "Mine would be to rewrite it. ;-)\n\n"
    },
    {
      "time": "15 Jan 2008 — 11:09am",
      "content": "Acronyms of more than 3 characters can get really horsey looking and stand out too much, which is why I think a lot of mags favor reducing them. But I don't think The New Yorker uses true small caps, I believe they just make the acronyms a point size or two smaller than the text.\n\n"
    },
    {
      "time": "15 Jan 2008 — 11:26am",
      "content": "<cite>Mine would be to rewrite it. ;-)</cite>\n\nAlways the best solution.\n\n"
    },
    {
      "time": "15 Jan 2008 — 1:15pm",
      "content": "Your question illustrates an important issue, though: typography isn't necessarily the first (and in some cases, only) solution folks need to look at when faced with having to \"fix\" a problem. :-)\n\n"
    },
    {
      "time": "15 Jan 2008 — 1:39pm",
      "content": "Stephen — We are using Bembo Book MT Pro. The small caps do sit just above the x-height but not very. Bumping them up .25–.5 pt might work.\n\nNick — We are a Canadian magazine with the majority of our readers being in the states. We also distribute to the UK & EU, Australia, and South America. So it is difficult to match our art direction with regional tastes and typographic etiquette.\n\nLinda & Jupiterboy — The article this problem is concerned with is about military technology. Their language seems to be riddled with acronyms and abbreviations. Re-writing is mostly out of the question.\n\nThanks for all the help.\n\n"
    },
    {
      "time": "15 Jan 2008 — 7:28pm",
      "content": "Ah, the clarification is useful.\n\nI've worked on stuff like that -- I'm assuming you have a U.S.-oriented style/spelling guide -- and bumping up the small caps as you mention is likely the best solution to your specific problem. (The rewriting suggestion was for the specific problem of inserting a possessive apostrophe: it's definitely not a \"one-size-fits-all\" one.)\n\n"
    },
    {
      "time": "15 Jan 2008 — 9:50pm",
      "content": "_Re-writing is mostly out of the question._\n\nAffirmative. ;-)\n\n"
    },
    {
      "time": "16 Jan 2008 — 10:29am",
      "content": "Maybe off-topic, but don't you think if they design the small caps to work with the lowercase they would be moving to far away from them working with the uppercase? (Which is, of course, the real use.)\n\n"
    },
    {
      "time": "16 Jan 2008 — 3:07pm",
      "content": "There are many ways that small caps can work.  \nA typeface would need at least THREE kinds (i.e. three different heights) to satisy them all.\n\n ![](http://web.archive.org/web/20131023200028im_/http:/typophile.com/files/Sc_5105.jpg)\n\n1. This is probably the most useful, noticeably taller than lower-case x-height. Good for acronyms, and still plenty of size contrast with full caps (unless the full capitals are smallish). Also a good size for Cyrillic small caps, where Maxim Zhukov has argued that size differentiation from lower case is helpful, given the commonality of so many letter forms between the Cyrillic upper and lower case, and the few extenders, especially in Russian.\n\n2. These could be termed _moyen_ caps and petite caps. The petite caps are the same height as lower-case x-height. Moyen caps would be larger than small caps, to allow sufficient contrast with petite caps for setting this kind of titular alphabet soup.\n\n3. A traditional way of setting petite caps, with copious lettespacing.\n\nA fourth size of small caps (bébé?) might be necessary to deal with \"Mc/Mac\" names that are set in all small caps, although this is so infrequent that the typographer should best handle it by tweaking, rather than with a separate font. If foundries wish to remedy the situation in-font, perhaps just two glyphs, \"Scots A and C for small caps\", would do the job.\n\nAnother issue is ordinals and superiors--occasionally, typographers may wish to set these in capital letter style.\n\nSo, my thinking is that the ultimate solution would be to include small caps in the main font, and have a separate Caps font, which contains moyen and petite cap sizes at the basic upper and lower case keystrokes, and also has superiors that are capital in form.\n\nWith this configuration, the difficult titles (B.Des etc.) could be set entirely with the Caps font, simplifying that chore for the typographer. Small caps could also be included, so that it would be possible to set both moyen caps with petite caps (basic \"upper and lower\" keystrokes) and moyen caps with small caps (small caps feature applied), as separate styles.\n\n"
    },
    {
      "time": "16 Jan 2008 — 5:19pm",
      "content": "Ooo.... Nick, you're gonna make Miguel squeal when he hears of this. See the thread [OpenType small caps in a separate font?](http://web.archive.org/web/20131023200028/http:/www.typophile.com/node/32455) by Adam Twardoch.\n\nDoesn't Mrs. Eaves have regular and petite caps? Love'em! Keep'em comin'!\n\n"
    },
    {
      "time": "16 Jan 2008 — 5:51pm",
      "content": "I'm having déjà vu suddenly. I think there is a thread about this where you, Nick, say those exact same things.\n\nI like petite small caps, but they are too small to use in text settings. I'd consider them more a nicety than a necessity. I also think is someone were to use moyen and regular small caps in the same setting don't you think the page would start to become spotty?\n\n"
    },
    {
      "time": "16 Jan 2008 — 6:18pm",
      "content": "[FF Atma](http://web.archive.org/web/20131023200028/http:/www.fontshop.com/features/fontmag/002/02_atma/) offers 4 (four) sizes of caps with corresponding figures and punctuation.\n\n"
    },
    {
      "time": "16 Jan 2008 — 8:43pm",
      "content": "_déjà vu_\n\nI wouldn't be surprised if I'm repeating myself without realizing it! (Doesn't everyone?)\n\nI'm not familiar with Atma. It's nicely done, but not the kind of conservative design I would have looked at twice in 2001, or subsequently recognize in use, and I probably didn't notice the multi-small-caps, as that's something that has only really interested me since I started working in OpenType. Thanks for bringing it to my attention Stephen.\n\nI see that Atma is pre-OpenType, and has Small Caps = Petite Caps, Mid Caps = Small Caps, and Quarter Caps = \"Moyen\" Caps.  \nPresumably its terminology was adopted prior to an awareness of how things shaped up in the OpenType Feature Tag specifications.  \nI wonder how Atma's various small caps will be implemented in OpenType...\n\n"
    },
    {
      "time": "16 Jan 2008 — 9:22pm",
      "content": "Me too! It shouldn't be long now.\n\n"
    }
  ]
}
