{
  "id": "4092",
  "title": "Exfoliant",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Newbie here... I blame the Typophile site, and this forum in particular, for rekindling my obsession with type. Consequently I've been inspired to start working on this, my first attempt at designing a font (not counting \"remixes\"). My goal is to make it fairly readable even though some of the letters are stylized. It still needs plenty of refinements, but I think it's ready for some feedback. Numbers and punctuation are coming soon, and eventually italics and bolder weights, depending on how ambitious I get.   \n   \n   \n   \n ![exfoliant alphabet](http://web.archive.org/web/20131014024949im_/http:/www.typophile.com/forums/messages/29/32535.gif)\n\n<!--attachment: exfoliantABC-32536.pdf*mime_pdf.gif*application/pdf*7.9 **exfoliantABC%2epdf --><!--attachment: exfoliantABC-32536.pdf*mime_pdf.gif*application/pdf*7.9** exfoliantABC%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131014024949im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131014024949/http:/www.typophile.com/forums/messages/29/exfoliantABC-32536.pdf\" target=\"_blank\"><b>exfoliantABC.pdf</b></a> (7.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "john_todoroff",
  "time": "2 Apr 2004 — 9:52pm",
  "uid": "3346",
  "comments": [
    {
      "time": "3 Apr 2004 — 12:54pm",
      "content": "This is pretty elegant.   \n   \nSome \"macro\" stuff:   \n- The caps are too big.   \n- The caps are very conservative while the lc is more progressive. Some difference between the two cases in this respect is generally good (if only in an inescapable sort of way :-), but I think here the disparity is too much.   \n- You might like to look at Berthold's Imago and Agfa's Rotis (SemiSans) for possible inspiration.   \n   \nAnd some micro stuff:   \n- In the caps especially there's some wobbliness in the stroke thicknesses and skeletons. Like look at the \"S\".   \n- I'd give the \"Y\" a bigger head, and make the \"Z\" narrower.   \n- The \"g\" is really very good. Ideal modulation in the join. Maybe an oppen bottom though?   \n- Why is the \"j\" short?   \n- The \"k\" seems over-extended.   \n- The top-lefts of the \"m\" and \"n\" seem out of place.   \n- The \"s\" is too heavy on the bottom-right.   \n- I'd make the bar of the \"t\" like the \"f\". You have a \"reductionist\" thing going on (most notably in the \"a\", and that's one reason I think an open \"g\" might be better), and the \"f\" fits that - so should the \"t\". You were probably thinking along the same lines for the \"m\" and \"n\", but in those two it's not working as it stands (and what about the \"r\"?).   \n- The \"z\" is leaning right.   \n   \nIf you make darker weights, I'd suggest increasing the stroke contrast a lot as you go up in color.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Apr 2004 — 5:07pm",
      "content": "\\>- The caps are too big.   \n   \nI imitated the vertical proportions of Akzidenz Grotesk, since it is one of the more readable sans-serifs, but now that you mention it, the caps in AG are too big, aren't they?   \n   \n\\>- The caps are very conservative while the lc is more progressive.   \n   \nI'm going to try a straight-sided \"A\" with a rounded top, and see what rounded corners look like on some of the other caps letters.   \n   \n\\>- You might like to look at Berthold's Imago and Agfa's Rotis (SemiSans) for possible inspiration.   \n   \nActually I think Imago was one of the sparks for this project. I've also been looking at Optima, and even Bodoni (its \"g\" shows up a little bit in mine).   \n   \n\\>- The \"g\" is really very good. Ideal modulation in the join. Maybe an open bottom though?   \n   \nI think the gap in the loop of an open-bottom \"g\" is often distracting. I tried playing around with opening it up, but settled for a closed loop instead. Since the \"g\" is already so much more complex than the other lc glyphs, the extra bit of white space makes the \"g\" stick out as too \"noisy\" in context.   \n   \n\\>- Why is the \"j\" short?   \n   \nOops, an accident I forgot to fix.   \n  \n\\>- The top-lefts of the \"m\" and \"n\" seem out of place.   \n   \nI've been struggling with these... A simple curve works on the \"u\" but looks gimmicky to me on the \"n\". Making an assymetrical curve on the \"n\" (sort of like FF Dax) worked nicely until I tried to make an \"m\" to match, which looked ugly.   \n   \n\\> (and what about the \"r\"?).   \n   \nIt just doesn't look like an \"r\" anymore without the stem poking up a little (I forget what that little part is called).   \n   \n   \nThanks for your keen eyes, Hrant.   \n   \n   \n/ john\n\n"
    },
    {
      "time": "3 Apr 2004 — 5:47pm",
      "content": "\\> Since the \"g\" is already so much more complex than the other lc glyphs,   \n\\> the extra bit of white space makes the \"g\" stick out as too \"noisy\" in context.   \n   \nIt is in fact the way in which the \"g\" is too complex that makes an open bowl better. Looking at it topologically (the \"layers\" of positive/negative space), only the \"B\" is as complex (and at least the \"B\" has a calming symmetry). By making the bottom open\\* you make the \"g\" much less complex - you basically make it belong more in the Latin alphabet.   \n   \n\\* And I mean generously open, not like the way Baskerville and Meta have it. I agree (if that's what you meant) that such minimal (almost apologetic) openness is worse than none at all, especially in smaller point sizes where the gap becomes neither here nor there, so to speak.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Apr 2004 — 9:33am",
      "content": "Somehow this reminds me of Barmeno   \nGorjan\n\n"
    },
    {
      "time": "6 Apr 2004 — 6:39pm",
      "content": "Re: Barmeno, I took a look at it and now I know what font they use on my package of cotton swabs. You're right, there are some similarities.   \n   \nI've changed some of the glyphs, but haven't decided yet if it's an improvement... still not sure about the \"g.\"   \n   \n ![exfoliant revisions](http://web.archive.org/web/20131014024949im_/http:/www.typophile.com/forums/messages/29/32835.gif)\n\n"
    },
    {
      "time": "7 Apr 2004 — 12:57pm",
      "content": "This are very good improvements in most of the letters but I thin that the original n,r and m were better, the n and m just need an adjustment on the top left for this not to look like a apendix but like a joint. Very nice work.\n\n"
    },
    {
      "time": "9 Apr 2004 — 7:48pm",
      "content": "I think that the old version has more consistent colour, which i think is better. I like the new \\_n\\_ and \\_m\\_ but not \\_r\\_. Abouth the \\_g\\_ i dont know, i never use it ![:-)](http://web.archive.org/web/20131014024949im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nG\n\n"
    },
    {
      "time": "13 Apr 2004 — 8:00pm",
      "content": "I know I'm getting ahead of myself here by designing a specimen sheet way before the font is finished, but I have an interview later this week for a production designer job, so I put this together for a portfolio piece. At least it should show that I take typography seriously -- but I hope the interviewer doesn't look \\*too\\* closely at it ![:-)](http://web.archive.org/web/20131014024949im_/http:/www.typophile.com/forums/clipart/happy.gif). Lots of details left to fix, and the kerning is very \"quick and dirty.\"\n\n<!--attachment: exfoliant_specimen-33440.pdf*mime_pdf.gif*application/pdf*36.2*exfoliant+specimen+sheet*exfoliant_specimen%2epdf --><!--attachment: exfoliant_specimen-33440.pdf*mime_pdf.gif*application/pdf*36.2*exfoliant+specimen+sheet*exfoliant_specimen%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131014024949im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">exfoliant specimen sheet<br><a href=\"http://web.archive.org/web/20131014024949/http:/www.typophile.com/forums/messages/29/exfoliant_specimen-33440.pdf\" target=\"_blank\"><b>exfoliant_specimen.pdf</b></a> (36.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "14 Apr 2004 — 5:59pm",
      "content": "John,   \n   \n\"x\" and \"X\", see:   \n [http://briem.ismennt.is/2/2.3.4a/2.3.4.25.diagonals.htm](http://web.archive.org/web/20131014024949/http:/briem.ismennt.is/2/2.3.4a/2.3.4.25.diagonals.htm)   \nyou don't have to do any changes, just be aware of this.   \n\"E\", think the middle horz. arm is too low.   \n\"F\", middle hor.arm too long\n\n"
    }
  ]
}
