{
  "id": "4094",
  "title": "Please crit my \\<\\< N O V I C E \\>\\>",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi guys,   \n   \nThis is a new font I'm working on for some days now. I had sketched it some months ago, but only started recently.   \nI would like to have some good crits, please. Spacing an weight balancing is off right now. I only have the glyphs in Freehand. I would like to get the basic perfect before I go on with the rest.   \n   \nIt has to be a font the works very well in small sizes. I will not make a big family out of it, just the regular bold and black. Caps and numbers are not available yet. They will be made upon this basic look-and-feel.\n\n<!--attachment: RV_Novice1-32543.pdf*mime_pdf.gif*application/pdf*20.8*RV%a9Novice1*RV%a9Novice1%2epdf --><!--attachment: RV_Novice1-32543.pdf*mime_pdf.gif*application/pdf*20.8*RV%a9Novice1*RV%a9Novice1%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">RV</td>\n</tr>\n</table>\n</center>\n",
  "author": "Rene Verkaart",
  "time": "3 Apr 2004 — 1:41am",
  "uid": "1946",
  "comments": [
    {
      "time": "3 Apr 2004 — 5:57am",
      "content": "Hi Ren\n\n"
    },
    {
      "time": "3 Apr 2004 — 8:59am",
      "content": "(Ole, you're really taking critiquing seriously! Cool.)   \n   \nRen\n\n"
    },
    {
      "time": "4 Apr 2004 — 7:03am",
      "content": "\\> Try giving the \"e\" and \"a\" bit more bowl and counter. I will try that and make an update later.   \n   \n\\> (Ole, you're really taking critiquing seriously! Cool.) I like that too. Keep 'm coming, Ole. I think you're right. I had it in my head but was not sure. With you saying that makes me sure that I have to change it. The first reaction is always the most important.   \n   \n\\> the x-height is way too small; But that will change if I make the ascenders and descenders smaller. Like Ole also suggested, it will then have less negative space.   \n   \n\\> and the weight is too light. Too light? Are you sure? I printed it many times in different sizes and it seems to be OK. How much darker does it have to be than? Is there something like a golden rule that I can follow? Do you have maybe a reference font that I can check up on?   \n   \nI'm personally not so sure about the 's'. Do you see a problem there? Another thought is that I would like to make the bowls of the 'd, p' g, q' a bit more round so that the little serifs more distinct (if that makes any sence). Or would you leave that like it is?   \n   \nThanx,\n\n"
    },
    {
      "time": "4 Apr 2004 — 10:19am",
      "content": "\\> I printed it many times in different sizes and [the weight] seems to be OK.   \n   \nDid you do this on a laser printer?   \nBecause of the way fonts are RIPed, the lower the output resolution, the fatter fonts get. For example a 6 point font on a 600 dpi laser printer will seem much darker than on an imagesetter.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Apr 2004 — 11:03am",
      "content": "Hmm, than I have to think this over. Would it be best to change it now or do it later in FontLab? I have almost all the glyphs ready and it would be a hell of a job to change it now. I will make an imagesetterproof when I have it ready in FL. Any thoughts on an examplefont that I should check out?\n\n"
    },
    {
      "time": "4 Apr 2004 — 11:06am",
      "content": "Ole, the ascender of a lowercase t is almost never the same height as the other ascenders. If anything, Ren\n\n"
    },
    {
      "time": "4 Apr 2004 — 11:09am",
      "content": "Why not make a weight axis?   \n   \nExamples: It would be most indicative to check out fonts that have different masters for different sizes, like Clifford.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Apr 2004 — 2:16pm",
      "content": "I've made some small updates:   \n- ascender and descenders shortened,   \n- opened up the a and e bowles   \n- and thinnered the part where the round forms connect to the stems. This should keep it more open in small sizes, although I don't know if I really like it. I kinda liked the way it was before. But, as they say 'kill your darlings', I would do that if it would make it better.\n\n<!--attachment: RV_Novice2-32593.pdf*mime_pdf.gif*application/pdf*19.5*RV%a9Novice2%2epdf*RV%a9Novice2%2epdf --><!--attachment: RV_Novice2-32593.pdf*mime_pdf.gif*application/pdf*19.5*RV%a9Novice2%2epdf*RV%a9Novice2%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">RV</td>\n</tr>\n</table>\n</center>\n"
    },
    {
      "time": "4 Apr 2004 — 2:44pm",
      "content": "The vertical proportions are now good for about 10-11 point setting. For that range: the color is slightly light, and the letterspacing is somewhat loose.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Apr 2004 — 12:54am",
      "content": "The color I will change in FOG, I guess. Spacing is off, because I only still have vectorglyphs in Freehand. How do you like the changes in the curved parts? Is it any better or don't you really see the difference? Are the more open a and e better like this?\n\n"
    },
    {
      "time": "5 Apr 2004 — 5:25am",
      "content": "Hi Ren\n\n"
    },
    {
      "time": "5 Apr 2004 — 6:18am",
      "content": "Hi Randy,   \n   \n\\> r: looks like an amputated n   \nActually it is. I read the Workshop and will make adjustments to my r.   \n   \n\\> v: too flat in the point   \nHow do you mean? What should I change? make the point where it connects to the baseline thinner?   \n   \n\\> some wobbly curves (illustrated in the your n)   \nI see it, you're right. That definetely needs some fixing.   \n   \n\\> s: You are right to qu   \nIt now follows the curves of the o. Where these abrupt edges are, I tried to replicate it in the s. Perhaps I skip the whole abrupt edges in the s?   \n   \nWith this font I tried to keep the inner forms as 'flat' as possible for good rendering on screen. Very large open inner forms, therefor the g has a large bowl. You think it's too large?   \n   \nI think this font will look great in heavy. I simulated it shortly in Freehand, insetting the beziers. Sweet.   \n   \nThanx for your good crits,\n\n"
    },
    {
      "time": "5 Apr 2004 — 7:04am",
      "content": "s: I think maybe skip the abrupt edges here.   \ng/v: See attached   \n ![](http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/messages/29/32633.gif)   \nRandy\n\n"
    },
    {
      "time": "5 Apr 2004 — 7:16am",
      "content": "Hi Randy,   \n   \nGot it. Is the v always hanging a little below the baseline? The g looks also better like that. I didn't have any time yet to try it for myself, but your image looks good.   \n   \nThanx,\n\n"
    },
    {
      "time": "5 Apr 2004 — 7:21am",
      "content": "How do you like the name by the way? My girlfiend really likes the font and taking the fact that I promised to make her one, I could maybe take this one. I would then call it 'Insider' because her company name is Insider Immobilien and Insider Consulting. I kinda like Novice, but maybe I'll do her the favour. Politics...\n\n"
    },
    {
      "time": "5 Apr 2004 — 7:36am",
      "content": "_Is the v always hanging a little below the baseline?_   \nGenerally yes. The amount of overshoot depends on how pointy it is! For example futura medium with it's sharp points will overshoot more than helvetica. (Same for the w, W and M, A\n\n"
    },
    {
      "time": "5 Apr 2004 — 3:10pm",
      "content": "I did some minor curvecontrol. Hope you see it. I think it makes it just a little sharper. Is the r better now? Perhaps the m is now a tad to wide?\n\n<!--attachment: RV_Novice3-32698.pdf*mime_pdf.gif*application/pdf*20.4*RV%a9Novice3%2epdf*RV%a9Novice3%2epdf --><!--attachment: RV_Novice3-32698.pdf*mime_pdf.gif*application/pdf*20.4*RV%a9Novice3%2epdf*RV%a9Novice3%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">RV</td>\n</tr>\n</table>\n</center>\n"
    },
    {
      "time": "5 Apr 2004 — 3:31pm",
      "content": "You gotta love them Randygraphs.   \n   \nI think the changes are all for the better, and the new name is much better too.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Apr 2004 — 4:59am",
      "content": "I think so too. I wonder what he says to it. Any other suggestions that you would have for me? If not I go now to FOG and start finalising the lc's and check how they work when they are spaced and set in longer texts. After that it's on to the rest.   \n   \nI felt my girlfriend is really happy with the font and the name.   \n   \nThanx,\n\n"
    },
    {
      "time": "6 Apr 2004 — 6:13am",
      "content": "Hi Ren\n\n"
    },
    {
      "time": "6 Apr 2004 — 3:08pm",
      "content": "Hi Randy,   \n   \nThanx for your tips. I made the changes and would like to take the glyphs to FOG. I feel it's more effective to make the finetuning in FOG. The basic is good, now let's do the real thing.   \nHow would you calculate the internal leading? How much room would you leave over and under the de-/ascenders? Is there a certain golden rule to follow?   \n   \nLater,\n\n"
    },
    {
      "time": "6 Apr 2004 — 7:23pm",
      "content": "I don't think there is a golden rule on this. One need only look to see the variety. I think this is a huge question worth exploration (do a search\n\n"
    },
    {
      "time": "13 Apr 2004 — 2:11am",
      "content": "<!--attachment: RV_Insider4-33336.pdf*mime_pdf.gif*application/pdf*11.7*RV%a9Insider4*RV%a9Insider4%2epdf --><!--attachment: RV_Insider4-33336.pdf*mime_pdf.gif*application/pdf*11.7*RV%a9Insider4*RV%a9Insider4%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">RV</td>\n</tr>\n</table>\n</center>\n"
    },
    {
      "time": "13 Apr 2004 — 5:39am",
      "content": "a: Problematic structure. The bowl seems too small/low to me. Especially onscreen at smaller sizes.   \n   \na,b,d: The way the bowls join the stem at the bottom is causing problems. They seem almost stemless because the join is thick and low. I'd raise it up a bit and maybe add a tail on the a.   \n   \ny: Try a traditional y.   \ng: bowl needs a little more raising.   \n   \nRandy\n\n"
    },
    {
      "time": "14 Apr 2004 — 1:11am",
      "content": "Do you really think the bowl is too small? It looks good on my screen, though I know that doens't mean anything. I think it gives it a bit more personality. I'll try to change it later and see if you like that more. You've said it before, so I think you will. ;-)   \n   \nDoes a tail on the 'a' fit to this concept? That would be the only letter that has a tail.   \nI will enhance the stems in the 'a, b, d', I think that's a good thing.   \n   \nI kinda like this 'y' that I have. I would leave it for now, can always change it later.   \n   \nWill raise the bowl of the 'g'   \n   \nRandy, you are shaking my world. A lot you suggest goes against my original Idea with this font, but I'll follow you and see where it leads me. Please keep in mind that I should not look (too much) like all the other sans serif on-screen readible fonts out there. It needs a certain own personality.   \n   \nThanx,\n\n"
    },
    {
      "time": "14 Apr 2004 — 6:45am",
      "content": "Re: Shaking your world   \n   \nI've found that the intensity of immersing in the project makes me partially blind to the problems in my forms. Only time lets my eyes, see fully again. Barring that, it's a balancing act trying to borrow other people's eyes, but keeping my concept. The same is true of trying to write a paper in school. As you proof your own work, you combine what you've got in your head with what's actually on paper. Your readers don't have that luxury so their eye is more critical, but less aware of what you're actually wanting to say.   \n   \nDon't let me drag you off concept. All my suggestions are just that. Any other typophiles want to jump in here?   \n   \nOne final suggestion :-) Move on to the caps. Immerse in those for a while. When you're \\*done\\* go back and look at prints of the lowercase with fresh eyes. Then make your move.   \n   \nRandy\n\n"
    },
    {
      "time": "25 Oct 2004 — 1:35pm",
      "content": "Hi Randy and hhp,   \n   \nA small update on Insider Regular. I've been working on it again for the last week. I couldn't spend much time on it, I was to busy with our website and my hernia (grrr).\n\n<!--attachment: RV_InsiderReg-52030.pdf*mime_pdf.gif*application/pdf*50.1*InsiderRegular*RV%a9InsiderReg%2epdf --><!--attachment: RV_InsiderReg-52030.pdf*mime_pdf.gif*application/pdf*50.1*InsiderRegular*RV%a9InsiderReg%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">InsiderRegular<br><a href=\"http://web.archive.org/web/20131013183714/http:/www.typophile.com/forums/messages/29/RV_InsiderReg-52030.pdf\" target=\"_blank\"><b>RV</b></a>\n</td>\n</tr>\n</table>\n</center>\n"
    },
    {
      "time": "25 Oct 2004 — 2:35pm",
      "content": "Hmmm. Well, the remnants of the funky modulation in the original design are hurting you. Like the \"O\" and dots on the \"i\"/\"j\" look totally out of place now, I mean in the overall picture. I think you either need to go back to the original modulation (find out why it's making you \"angry\", and deal with it) or totally get rid of it. I guess you could alternatively make the funky modulation a very gentle presence throughout, but that will be very hard to pull off, I think.   \n   \nStructurally, the only glyph that really bothers me is the \"k\" - I'd make it like the UC. The \"C\" and \"G\" seem too wide. The diaresis is too strong, and I'd flatten the UC accents. Otherwise once you figure out the modulation issue you'll have a solid design on your hands I think.   \n   \nI think your spacing is loose. Now, if you're still going for small sizes, that's fine, in fact your vertical proportions are much better now for that; but the color will be too light then. Also, because your spacing is loose, you need a bigger blank space - and this might in fact be the problem with the all-caps setting: they're already hard to read, but with their taller height the small wordspace ruins everything.   \n   \nDon't give up! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "26 Oct 2004 — 12:10am",
      "content": "\\> Hmmm. Well, the remnants of the funky modulation in th   \n   \nVery true, and the modulation is also not forgotten yet. For this version I skipped it, but I will finish the modulated type too. I liked it more, but I need a bit more zen before I can finish it.   \n   \n\\> Now, if you're still going for small sizes   \n   \nNot neccecairily. Because I will be mainly used onscreen, the average size will be 12 pt. So in print it will propably be the same. Therefor I guess the spacing will be loose.   \n   \nThanks for the crits. More updates later.   \n   \nRegards,\n\n"
    },
    {
      "time": "4 Nov 2004 — 1:47am",
      "content": "<!--attachment: Insider_Regular_fontbook-52799.pdf*mime_pdf.gif*application/pdf*135.1*Insider+regular+fontbook*Insider_Regular_fontbook%2epdf --><!--attachment: Insider_Regular_fontbook-52799.pdf*mime_pdf.gif*application/pdf*135.1*Insider+regular+fontbook*Insider_Regular_fontbook%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Insider regular fontbook<br><a href=\"http://web.archive.org/web/20131013183714/http:/www.typophile.com/forums/messages/29/Insider_Regular_fontbook-52799.pdf\" target=\"_blank\"><b>Insider_Regular_fontbook.pdf</b></a> (135.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nThis is the latest version of the current Insider. I finished it up till this status because my girlfriend has her birthday tomorrow. The typeface is long from ready, but it's presentable for someone who doesn't know much about weights, proportions, kerning, etc.   \n   \nThe italic is long from ready, because much of the weightproportions are wrong. I have to correct this all by hand. The kerning has to be done also.   \n   \nhhp, you will get your funky modulation. I've looked for my sketches again and found the mistake in my thinking. I will make a complete new version bases on this sceleton. I think I will call this version Insider HHP. ;-) It will be a display face with only two weight (+ Iitalics), a regular and a black. I like black italic typefaces.   \n   \nLater,\n\n"
    },
    {
      "time": "4 Nov 2004 — 3:54am",
      "content": "Very Nice. I like just about all the glyphs except the uc \"Q\". It somehow just looks a bit too relaxed, for lack of a better word, and it seems different from the rest of the glyphs. Have you considered something more conservative? I took the liberty of doing a mod to a screenshot. ![q](http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/messages/29/52814.jpg)\n\n"
    },
    {
      "time": "4 Nov 2004 — 5:18am",
      "content": "Hi Ole,   \n   \nThat's also a very nice Q. I'll give it a try. Important is the result onscreen. If it looks good there it's a good option.   \n   \nRegards,\n\n"
    },
    {
      "time": "4 Nov 2004 — 8:10am",
      "content": "I am a big fan of this typeface. Nice work. And after reading all the way through the thread, I agree with ole's thoughts on the uc \"Q\".   \n   \nI like it's simplicity in body text as well. I think it is rather readable.\n\n"
    },
    {
      "time": "4 Nov 2004 — 8:11am",
      "content": "I am a big fan of this typeface. Nice work. And after reading all the way through the thread, I agree with ole's thoughts on the uc \"Q\".   \n   \nI like it's simplicity in body text as well. I think it is rather readable.\n\n"
    },
    {
      "time": "4 Nov 2004 — 8:20am",
      "content": "Thanks Aaron for the compliment. What say you about the crit from hhp that I discarded the funky modulation that I had in the inner shapes in the beginning. It's not lost, but I skipped it out of this version.   \nPersonally I think it's became better without it, because I could let go of some difficulties. I found my error and I will make another display typeface with this funky modulation later on.   \n   \nIs there maybe someone who can give me some good crits and tips on my spacing for the italic. I have difficulties with it. I did it on the fly, but there must be a more constructive way to do this.   \nBTW, is the spacing in the italic narrower than in a regular???   \n   \nRegards,\n\n"
    },
    {
      "time": "4 Nov 2004 — 1:07pm",
      "content": "I think you have your (revised) modulation under control now.   \n- The \"k\" still bothers me; \"s\"/\"S\" too wide.   \n- It would be nice if you could give the numerals more character.   \n- The bars on the Euro are sitting high.   \n- The ampersand is a bit much here.   \n- Spacing: pretty loose.   \n- The italic is quite nice, although in some places it looks too mechanically inclined.   \n- Nice presentation.   \n   \nBTW, the funky version, what about calling it Insiderer?   \n   \n\\> is the spacing in the italic narrower than in a regular?   \n   \nDo you mean is it, or _should_ it be?   \nItalic forms tend to be narrower, and lighter (and often other things too). The former means the overall space it takes will be less, but the latter actually means the interletter spacing generally needs to be _more_.   \n   \nBTW:   \n1) What's that cool monogram, that looks like \"g3\"?   \n2) The usual term is \"waterfall\", not \"cascade\". Although I've actually used the latter myself sometimes - it just _sounds_ so much nicer. Hmmm, so forget what I said, just use \"cascade\"!   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2004 — 3:27am",
      "content": "I like this typeface. But you really should make another one as well keeping the funky modulation intact. It is cool.   \n   \nHrant, I think the monogram is supposed to be GB as in Gabrielle Birnstein, the lucky reciever of the typeface. Am I right Ren\n\n"
    },
    {
      "time": "8 Nov 2004 — 1:00am",
      "content": "Hi guys,   \n   \nmagnus, that's absolutely correct with the monogram.   \n   \nhhp, what and where do some of the characters look mechanically inclined? Just to get a good feeling for what I should look out for.   \nWith my italic I just, like you could see, mechanincally inclined it. I 'italized' it here and there to get the typical italic look and feel. But in fact it is not a real italic.   \nTherefor the width is still the same. My spacing is a bit more tight than the Regular, but I can change that back.   \n   \nI think you're right with the ampersand. I'll change it. What about keeping it in the italic? Would that work?   \n   \nThis are the original sketches with the funky modulated typeface. I will start on that this weekend and keep you updated. I'm looking for a good name for it, so if someone has some good ideas...   \n   \n ![Insider original sketch](http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/messages/29/53063.jpg)   \n ![Insider original sketch 2](http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/messages/29/53064.jpg)   \n ![Insider original sketch 3](http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/messages/29/53065.jpg)   \n ![Insider original sketch 4](http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/messages/29/53066.jpg)   \n   \nRegards,\n\n"
    },
    {
      "time": "8 Nov 2004 — 3:27pm",
      "content": "The lc italic glyphs that look strongly mechanical to me are: c k o r s   \nBasically I guess the longer stretches of curves, and the diagonals need the most attention.   \n   \n\\> What about keeping it in the italic?   \n   \nSeems smart.   \n   \n\\> I'm looking for a good name for it   \n   \nFor some reason \"Concrete Jungle\" just popped into my head.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Nov 2004 — 5:54am",
      "content": "Hi Ren\n\n"
    },
    {
      "time": "9 Nov 2004 — 8:03am",
      "content": "Hi Randy,   \n   \nWelcome back. :-) And thanks for the nice compliment. Coming from you I think that means something.   \n   \nYes, it came right after Nordic. I guess you can see my handwriting. Could you recognize it as my font, not knowing that it came from me?   \n   \nAbout the funky version, I will finish it based on the sketches. I won't overwork Insider to push the modulation back in. This font will mainly work onscreen and needs no funky modulations; it's a working horse. Insider became more round over the time and the funky one needs a bit more tight curves. You can see that clearly on the sketches.   \n   \nI'm really looking forward for working on the funky font. I've overcome my frustration and feel that I'm up to the challenge now.   \nThe glyphs that frustrated me most are: b, e, s (although I now kinda like it with the funky curves in).   \n   \nhhp, what's going on in your head? :-) I don't see it beeing the name for the font, but perhaps the sample book that I will make for it. It's a great theme where I see some interesting images.   \n   \nLater,\n\n"
    },
    {
      "time": "3 Dec 2004 — 4:44am",
      "content": "Question:   \n   \nIs it possible to get this type face somewhere?   \n   \nYou've make a great job.\n\n"
    },
    {
      "time": "3 Dec 2004 — 5:52am",
      "content": "Hi Sim,   \n   \nThis typeface is still in progress, so it's not up for sale yet. If it will be sold here:   \n [www.characters.nl](http://web.archive.org/web/20131013183714/http:/www.characters.nl/)   \n   \nLeave your emailadres under 'Keep you informed' and I w\n\n"
    },
    {
      "time": "5 Jan 2005 — 5:53am",
      "content": "Hi guys,\n\n<!--attachment: InsiderPDF-57158.pdf*mime_pdf.gif*application/pdf*274.5*InsiderRegular+fonts*InsiderPDF%2epdf --><!--attachment: InsiderPDF-57158.pdf*mime_pdf.gif*application/pdf*274.5*InsiderRegular+fonts*InsiderPDF%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013183714im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">InsiderRegular fonts<br><a href=\"http://web.archive.org/web/20131013183714/http:/www.typophile.com/forums/messages/29/InsiderPDF-57158.pdf\" target=\"_blank\"><b>InsiderPDF.pdf</b></a> (274.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nFor he who cares, this is an update of Insider. I've done some heavy curvecontrol and mucho kerning. I'm almost ready with both fonts as singles. I want to crosscheck them because I have the feeling there are some inconsistencies (width, accents, spacing).   \n   \nSome minor things I will finish later: change ampersand in the Roman, change oe and ae in Italic, check numbers in Italic (I have the feeling spacing could be improved) and implement your crits ;-)   \n   \nI want to start working on the InsiderBlack Roman and Italic. Then I will interpolate the Bold. I will also make the Regular a bit more heavy, it's a bit to light now.   \n   \nLater,\n\n"
    }
  ]
}
