{
  "id": "40957",
  "title": "OLPC Laptop",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "It arrived!\n\nI thought I’d give you a list of fonts it came with. I haven’t heard of any of them, maybe someone can illuminate us.\n\nAbyssinica SIL  \nDejaVu LGC Sans Mono  \nDejaVu Sans  \nDejaVu Serif  \nGaruda  \nKacstArt  \nKacstBook  \nKacstDecorative  \nKacstDigital  \nKacstFarsi  \nKacstLetter  \nKacstPoster  \nKacstQuraFixed  \nKacstQuran  \nKacstTitle  \nKacstTitleL  \nLoma  \nNafees  \nNorasi  \nPakTypeNaqsh  \nPakTypeTahreer  \nPurisa  \nTlwgMono  \nTlwgTypewriter\n\n ![](http://web.archive.org/web/20081123034500im_/http:/www.typophile.com/files/hellothere_4550.jpg)\n\n [‹ looking for Lux by Erbar and Reform Grotesk by Stempel](http://web.archive.org/web/20081123034500/http:/www.typophile.com/node/40642 \"Go to previous forum topic\") [InDesign ME: Possible to do work in US English as much as Arabic, etc.? ›](http://web.archive.org/web/20081123034500/http:/www.typophile.com/node/40907 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081123034500/http://www.typophile.com/user/17709\" title=\"View user profile.\">HaleyFiege</a>",
  "time": "<br>",
  "uid": "17709",
  "comments": [
    {
      "time": " 15.Jan.2008 3.33pm",
      "content": "DejaVu is a derivative of Bitstream Vera, the open source font they did for Gnome foundation. The others are likely open source non-latin fonts.\n\n"
    },
    {
      "time": " 15.Jan.2008 3.37pm",
      "content": "Yeah I assume they’re all open source since it’s one of the principals behind the laptop. Do we know who designed any of them?\n\n"
    },
    {
      "time": " 15.Jan.2008 3.54pm",
      "content": "Vera was designed by Jim Lyles - as for others you can probably find information on Sourceforge...\n\n[http://sourceforge.net/](http://web.archive.org/web/20081123034500/http:/sourceforge.net/ \"http://sourceforge.net/\")\n\nCheers, Si\n\n"
    },
    {
      "time": " 15.Jan.2008 4.04pm",
      "content": "By saying it arrived, do you mean you own one?\n\nI am really impressed by what little I know about this piece of kit.  \nHas anyone seen the Motorola MOTOFONE? It’s single handedly taking typography back to year zero :)\n\n"
    },
    {
      "time": " 15.Jan.2008 4.12pm",
      "content": "\\>Has anyone seen the Motorola MOTOFONE? It’s single handedly taking typography back to year zero :)\n\nOfftopic. I don’t think Moto does fonts well. The anti-iPhone, maybe? Has anyone seen the new cross-handset Verizon fonts Monotype announced today?\n\n"
    },
    {
      "time": " 15.Jan.2008 4.56pm",
      "content": "There’s a table at the bottom of [this page](http://web.archive.org/web/20081123034500/http:/wiki.laptop.org/go/Fonts) that might answer some of your questions.\n\nIt’s clear from the list of fonts that the main goal driving font selection is to support the writing systems of the XO’s target populations. Abyssinica SIL is for Ge’ez (Ethiopic); DejaVu handles Roman, Greek, and Cyrillic, and may provide partial support for some other scripts; Garuda, Loma, Norasi, Purisa, and the Tlwg fonts do Thai; and the Kacst fonts, Nafees, and the PakType fonts do Arabic script.\n\nOf those fonts, I’ve used the DejaVu fonts and Abyssinica SIL. The DejaVu fonts support a lot of languages, which I appreciate; they’re not the most attractive fonts in the world, though, as you may have noticed. Abyssinica SIL is a good looking font as far as I can tell (I don’t read Ge’ez or speak any language that uses it). No bold or italic, but it was plenty good for a few papers on Amharic. It’s developed under the auspices of the SIL Non-Roman Script Initiative.\n\n"
    },
    {
      "time": " 15.Jan.2008 5.07pm",
      "content": "Does the OLPC support Devanagari? Their wiki isn’t exactly clear, and the fonts they mention there aren’t on the list a top this thread!\n\n"
    },
    {
      "time": " 15.Jan.2008 5.44pm",
      "content": "Looks like it does...\n\n[http://wiki.laptop.org/go/Khairat\\_Chronicle](http://web.archive.org/web/20081123034500/http:/wiki.laptop.org/go/Khairat_Chronicle \"http://wiki.laptop.org/go/Khairat\\_Chronicle\")\n\n...mentions a Marathi font which uses Devanagari script.\n\nCheers, Si\n\n"
    },
    {
      "time": " 16.Jan.2008 12.49am",
      "content": "Yeah, I think that from the whole language about Devanagari and Hindi that it does, too. But why no properly-delineated font list! Isn’t that what a wiki-formated webpage should be all about? What if I were asking the same question, but for Tamil, or Korean, or Mongolian? Haley’s list in the opening thread is not a long font list at all. There are more fonts that fit with their values that they could have included, I think.\n\n"
    },
    {
      "time": " 16.Jan.2008 6.28am",
      "content": "Yes I own one.\n\nThe keyboard is in English and from the sounds of it they have different keyboards for the different regions so that would explain why my laptop didn’t come with any other language fonts.\n\n"
    },
    {
      "time": " 16.Jan.2008 7.33am",
      "content": "OK. I heard this from someone else today, too. Oh well!\n\n"
    }
  ]
}
