{
  "id": "40953",
  "title": "The 'Energy' in Monster Energy Drink...",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I have to recreate this logo for AMA supercross sponsored by Monster Energy Drink, so I need to know Monster Energy drink’s font for the worg ’energy’ as it’s the same one used in the sample.\n\nIt is very close to both Eurostile and Bank Gothic. The R is similar to Bank Gothic, yet it is more rounded in nature to Eurostile Bold Extended... Help.\n\nI have been using both fonts to recreate, but as this is from the web it’s not looking so perfect. Can’t seem to get the curves just so...\n\n| Attachment | Size |\n| --- | --- |\n| [recreate.jpg](http://web.archive.org/web/20080613052715/http:/typophile.com/files/recreate.jpg) | 58.79 KB |\n\n [‹ goodsense - italic seif](http://web.archive.org/web/20080613052715/http:/www.typophile.com/node/40980 \"Go to previous forum topic\") [(x) Basic monospaced sans - Akkurat Mono {John McHugh} ›](http://web.archive.org/web/20080613052715/http:/www.typophile.com/node/40889 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080613052715/http://www.typophile.com/user/25981\" title=\"View user profile.\">katsola</a>",
  "time": "<br>",
  "uid": "25981",
  "comments": [
    {
      "time": " 15.Jan.2008 1.20pm",
      "content": "Is this the logo you created? It would help to see the sample of “energy” to identify it.\n\n- Lex\n\n"
    },
    {
      "time": " 15.Jan.2008 1.23pm",
      "content": "no, I need to recreate it it was found on their site\n\n ![](http://web.archive.org/web/20080613052715im_/http:/www.typophile.com/files/Monsterheader_4889.jpg)\n\nI guess this would be a better one to show. It has all the characters stumping me.\n\n"
    },
    {
      "time": " 15.Jan.2008 4.20pm",
      "content": "Looks like plain old bank gothic to me.\n\n- Lex\n\n"
    },
    {
      "time": " 16.Jan.2008 5.24am",
      "content": "OFFICIAL WEBSITE is Bank Gothic, SUPERCROSS not.\n\n"
    },
    {
      "time": " 16.Jan.2008 6.42am",
      "content": "yes, and through out the site all the headings seem to be bank gothic, it’s just this one that is different.\n\nI have been using a combination of eurostile bold extended for the s, c and o. Mainly because those letter are rounder than those same characters in bank gothic, the end of the s is of course different than the bank goth s and those letters look most like eurostile.\n\nIt’s just not perfect, the roundness is not just right. Eurostile has a slightly fuller curve- but these are slightly tighter, but not as tight at bank gothic. I will keep playing with the letters and see how close I can get.\n\n"
    }
  ]
}
