{
  "id": "40974",
  "title": "Portfolio/Freelance logo critique.",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey there, Im in the process of building a portfolio site and identity for my design (mostly web) services. Its called “number eight wired” based on the New Zealand phrase “Number Eight Wire”. (Im based in the UK though)  \n“Number Eight Wire is a metaphor for Kiwi ingenuity and enterprise: the ability to achieve or build anything out of a piece of number eight wire”\n\nSo this is where Im at, Im not sure why i have arrived at this point, but Im mostly happy with it and am looking for some typographic critique, (not so much conceptual critique).  \nThe N and W are built from Didot and the 8 is based off stencil forms (P22 Albers) because that was the only style of 8 that I could match with the stencilish/rectalinear nature of the N and W. (the Didot 8 wasnt working at all)\n\nTheres something happening with the 8 when i first look at it that make it feel like its actually the negative space of an eight????  \ncant decide if this is good or bad or if this can be worked off.\n\nthe small text below it is set in Whitney SemiBold SmallCaps , which Im currently using sitewide as body text (Im an big HTF fan)\n\nthanks for any comments in advance,  \ng\n\n ![](http://web.archive.org/web/20080706221858im_/http:/www.typophile.com/files/n8w_3447.jpg)\n\n [‹ Custom Lettering Logo Project](http://web.archive.org/web/20080706221858/http:/www.typophile.com/node/41079 \"Go to previous forum topic\") [Logo for Cookie Company ›](http://web.archive.org/web/20080706221858/http:/www.typophile.com/node/40129 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706221858/http://www.typophile.com/user/21749\" title=\"View user profile.\">George Coltart</a>",
  "time": "<br>",
  "uid": "21749",
  "comments": [
    {
      "time": " 16.Jan.2008 10.22am",
      "content": "I really like it when names have meaning. This one is especially interesting.\n\nI realize you are aligning the name with the mark, but I personally find it too close and in need of aligning with the full width of the mark, or in other words, align with the full W. I think the 8 is a bit too close to the N as well..OR...the 8 is too far from the W.\n\n"
    },
    {
      "time": " 16.Jan.2008 10.52am",
      "content": "I made a few small adjustments...  \nI think if the base text goes too much further out it “hangs” too much... I do like it further out though, kinda lines up with the angles of the W.\n\n ![](http://web.archive.org/web/20080706221858im_/http:/www.typophile.com/files/n8w2_6522.jpg)\n\n"
    },
    {
      "time": " 16.Jan.2008 12.06pm",
      "content": "Great name/concept!\n\nI like the new weight of the “base text.” I think the 8 needs attention.\n\nSuggestions:  \n-Try increasing 8’s size, giving it as much importance as the N and W.  \n-Adjust the shape of 8, making it longer, as to match the heights of N and W.  \n-Shrinking 8 and centering it (without it looking like N&W)\n\n"
    },
    {
      "time": " 16.Jan.2008 2.30pm",
      "content": "thanks Keena,  \nyea more balanced i think, I just thought it fit a little more snug the other way:\n\n ![](http://web.archive.org/web/20080706221858im_/http:/www.typophile.com/files/n8w3_6294.jpg)\n\nand one spaced a little looser:\n\n ![](http://web.archive.org/web/20080706221858im_/http:/www.typophile.com/files/n8w4_3456.jpg)\n\n"
    },
    {
      "time": " 16.Jan.2008 5.30pm",
      "content": "I think those both work well! Personally, I prefer the top.\n\n"
    },
    {
      "time": " 18.Jan.2008 5.41am",
      "content": "Really nice — I reckon you’ve nailed it. Latest versions maybe a bit dark for the web, but with a gold/metallic or something in print, it would look awesome. Great job.\n\n"
    },
    {
      "time": " 18.Jan.2008 10.37am",
      "content": "thanks Jim I think Im finally happy with it also, Ive been getting that problem where you look at something too much and you lose your point of view...\n\nthe colour was going wrong somewhere between doing screen grabs in illustrator then moving to photoshop. The final output is a bit lighter.\n\nheres a (very close to completed) beta of the website if anyones interested: [www.n8w.co.uk/beta.html](http://web.archive.org/web/20080706221858/http:/www.n8w.co.uk/beta.html \"www.n8w.co.uk/beta.html\")\n\nI need to update the work in there as I have stuff in there from design school which Im not so proud of anymore...\n\n"
    }
  ]
}
