{
  "id": "40986",
  "title": "Crit Needed for Company Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone. New here. Found this through, none-other, Google.\n\nI've been working on a logo design for a small business that I started with back in March 2006.\n\nSince June 2007, the business sold and now the new owner is actually utilizing me rather than letting me sit around and do paperwork.\n\nFirst off, I am no graphic designer. I have taken classes but I'm far too hard on my own work to ever accept anything I do as good enough.\n\nWell, except for this one. I actually love this design but I felt that I needed to get more opinions, specifically opinions from designers.\n\nI will not tell you what we do though as I want to see what people think about this concept as well as if they can figure out what services we provide.\n\nThanks. I'll be keeping this page open all day.\n\n ![](http://web.archive.org/web/20131019095058im_/http:/typophile.com/files/2008-01-15-_4319.-Blueprints-Now.gif)\n\n",
  "author": "kaygdanimal",
  "time": "16 Jan 2008 — 8:44am",
  "uid": "26006",
  "comments": [
    {
      "time": "16 Jan 2008 — 10:42am",
      "content": "\"I will not tell you what we do though as I want to see what people think about this concept as well as if they can figure out what services we provide.\"\n\nA logo doesn't need to literally describe the specifics of the business. If it does, great, but you don't want to over-detail the logo to do that. A logo really only needs to represent you.\n\nAs such, the current logo seems crowded and busy. If I had to guess, you do something with blueprints, but given that blueprints are kind of a dying product, I'm not entirely sure. ;0)\n\n"
    },
    {
      "time": "16 Jan 2008 — 11:32am",
      "content": "Why did you select these typefaces?\n\nWill this logo appear on a sign or only on the web?\n\nWho/what is Destin?\n\n"
    },
    {
      "time": "16 Jan 2008 — 11:34am",
      "content": "Google just told me Destin is a city in Florida... disregard that one.\n\n"
    },
    {
      "time": "16 Jan 2008 — 1:18pm",
      "content": "Yep, Destin is a city in Florida.\n\nBlueprints of Destin is/was the original name. The owner wants to keep it but the very fact that the word Blueprints is used twice hurts it some. Others feel it is too redundant.\n\nBlueprints are not exactly a dying product. You'd think that they were because we are in the digital age but contractors cannot take large computer screens on the job site and they'd prefer to not have to scroll around on a tiny micro computer either just to view the job details.\n\nWhat we do is reprographics, specializing in printing architectural blueprints, either through reproduction or first time plans. The lines on the left represent the lines that architects use in their drawings.\n\nThe fonts used was an attempt to go away from our current corporate feel. I wanted to let our clients understand that we love what we do, we do our job quickly, and we can help them with their needs as general contractors, sub-contractors, owners, and architects.\n\nOne thing I do not want to do is to flat out tell them what we do just by looking at the logo. I'd like for them to be intrigued and to wonder about us. We already have a large clientel base but for those that have never heard of us, then the first time they see that logo, I want it to stand out so by chance, one day they decide to have plans designed for their own residence or commercial, they will remember the name, Blueprints Now!\n\n"
    },
    {
      "time": "16 Jan 2008 — 1:32pm",
      "content": "\"I want it to stand out\"\n\nWell, I wouldn't used things like the blue print lines. These are way overused in the cad/architecture world as it is.\n\nSo, is the company 'Blueprints of Destin' or 'Blueprints Now'?\n\nI agree, having the both is very confusing.\n\n"
    },
    {
      "time": "16 Jan 2008 — 2:31pm",
      "content": "The company has both names. The new owner wants to phase Blueprints of Destin out of the name slowly. He took over in June of 2007 and the very first store opening was called Blueprints of Destin. Since then it has grown to five stores. I'm not sure of when the first store opened but the new owner wants to keep the tie to our roots (or something like that) for the time being.\n\nApparently, he has decided to stick with my design which can be modified as we move forward. For now he wants to get business cards made up for the two stores that currently need them.\n\nHe never asked me to design the logo. I just thrust it upon him one day to get his opinion and he loved the idea.\n\n"
    },
    {
      "time": "16 Jan 2008 — 4:22pm",
      "content": "It seems awfully messy to represent a product that should be precise. To me, it says restaurant or laundromat.\n\n"
    },
    {
      "time": "16 Jan 2008 — 5:24pm",
      "content": "Having 2 names is really confusing. Its hard to get passed it. I understand that you want to appear less corporate and more approachable... but the Blueprints font looks ghost-like. I would only include the \"!\" if you use it consistently, whenever writing or communicating, BLUEPRINTS NOW!\n\n"
    },
    {
      "time": "17 Jan 2008 — 9:08am",
      "content": "Just be careful when you need to print it in small sizes...I'm guessing the \"BLUEPRINTS\" bit will get mushed together (\"mushed\" is an approved design word, mind you!)\n\nOn more personal issues, I'm not too keen on the \"W\" having one straight stroke and one curved; also, using blue for blueprints seems too obvious (not wrong, just obvious).\n\nHappy hunting!\n\n"
    },
    {
      "time": "18 Jan 2008 — 5:39am",
      "content": "Lose it all -- elegant and minimal are the way forward here -- maybe just a logotype.\n\n"
    },
    {
      "time": "20 Jan 2008 — 1:11am",
      "content": "To tell you the truth, this logo looks like one of those DIY logos, that are normally very bad and tell me only one thing: \"We are either short of money or tight or ignorant. Or a combination of the above.\"\n\nYou're doing blueprints, yet your logo tells people that your blueprints are inaccurate, your business is a mess and it'll be expensive since you're cheap, but we'll have to get blueprints somewhere else to get the right ones. So paying twice. And that's what your logo tells me.\n\nI'm being frank on purpose because I don't think this current logo has any potential worth pursuing. Try to get new ideas in your head and on the paper. Or get a designer to do it for you.\n\n"
    }
  ]
}
