{
  "id": "40996",
  "title": "My logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I posted this on a different part of the forum in the hope that someone can select a new font that will go well with this logo. So ignore the text for the time being.\n\nSteve\n\n ![](http://web.archive.org/web/20080706221744im_/http:/www.typophile.com/files/fontneeded_4406.gif)\n\nIt’s for an adult store. I’ve tried a few different variations with it, i’ve come up with this logo that catches my eye.\n\nThanks\n\n [‹ Improving church logo](http://web.archive.org/web/20080706221744/http:/www.typophile.com/node/41247 \"Go to previous forum topic\") [If you kern, kern, kern, kern, kern, kern. ›](http://web.archive.org/web/20080706221744/http:/www.typophile.com/node/41271 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706221744/http://www.typophile.com/user/26011\" title=\"View user profile.\">acrucia</a>",
  "time": "<br>",
  "uid": "26011",
  "comments": [
    {
      "time": " 16.Jan.2008 11.46am",
      "content": "Where else is this posted?\n\n"
    },
    {
      "time": " 16.Jan.2008 11.48am",
      "content": "In design\n\n"
    },
    {
      "time": " 16.Jan.2008 1.02pm",
      "content": "Can you explain the logo a it more?\n\n"
    },
    {
      "time": " 16.Jan.2008 1.34pm",
      "content": "Hmm...well, everyone has their own preferences, of course, but giant sharp pointy things don’t equate well with ’adult products’...at least for me. Maybe I’m not daring enough? ;0)\n\n"
    },
    {
      "time": " 16.Jan.2008 1.37pm",
      "content": "heh i can see your thinking, any suggestions?\n\n"
    },
    {
      "time": " 16.Jan.2008 2.43pm",
      "content": "Well, who’s it targeting? Aside from colors (which are feminine), I’m getting a very male vibe with the pointy figures and the mudflap girl. I typically would group adult stores into two slightly different demographics: 1) women/married couples and 2) Long Haul Truck Drivers.\n\nThis seems to fit the latter OK, but not the former. If you’re aiming for the former, I’d think a bit softer, maybe even a bit more abstract.\n\n"
    },
    {
      "time": " 17.Jan.2008 9.45am",
      "content": "Thanks for the feedback. I rounded the edges off. Added a leg, I played around with adding an arm, but it didn’t look right. Not quite sure on the colours, and again, I’m open to suggestions.\n\nThis is my first time using illustrator, so it’s taking some getting used too, I did the last in illustrator and placed it into photoshop to add some colour.\n\n ![](http://web.archive.org/web/20080706221744im_/http:/www.typophile.com/files/new_6497.gif)\n\nThanks  \nSteve\n\n"
    },
    {
      "time": " 17.Jan.2008 10.07am",
      "content": "New revision:\n\n ![](http://web.archive.org/web/20080706221744im_/http:/www.typophile.com/files/new2_5278.gif)\n\nDoes anyone know of any like sexy fonts?\n\n"
    },
    {
      "time": " 17.Jan.2008 10.48am",
      "content": "Its seems tough to think of a typeface thats sexy but doesnt go down the scripty and elegant path.  \nmaybe just me but I find Sauna to be sexy, its kinda “fleshy”. But then I dont know if thats an approach you want to take, Im interested to see what others think.\n\nthis is the Bold Italic Swash. you’ll find it here, along with other great fonts they make. [http://www.underware.nl](http://web.archive.org/web/20080706221744/http:/www.underware.nl/ \"http://www.underware.nl\")\n\n ![](http://web.archive.org/web/20080706221744im_/http:/www.typophile.com/files/acrucia_6523.jpg)\n\n"
    },
    {
      "time": " 17.Jan.2008 11.06am",
      "content": "I looks like her leg is severed or badly broken.\n\n"
    },
    {
      "time": " 17.Jan.2008 1.15pm",
      "content": "What’s your concept? It seems just like a bunch of stuff randomly thrown together. The “shark fin” growing out of her leg and the other leg tapering to a point do not work for me.\n\n- Lex\n\n"
    },
    {
      "time": " 17.Jan.2008 2.40pm",
      "content": "You was right about the severed leg. The shark fin as you put it :) heh is basically representing the A.\n\nNew revision:\n\n ![](http://web.archive.org/web/20080706221744im_/http:/www.typophile.com/files/new3_5754.gif)\n\nAgain thanks for this input, i don’t think i would have got this far if it wasn’t for the feedback.\n\nCheers for that font george, i’ll check out some of those fonts :)\n\nThanks  \nSteve\n\n"
    },
    {
      "time": " 18.Jan.2008 5.35am",
      "content": "Lose those random spikes — they’re doing nothing for the design, and use a different silhouette - maybe try and integrate it into the logotype rather than just banging them together at random.\n\nAnd the pink is a bit dull — something brighter and funkier would be much better — use a neon where possible for instance.\n\n"
    },
    {
      "time": " 20.Jan.2008 10.01am",
      "content": "Nice! It’s cool to see it evolve from the first sketch to this last revision. Nice progress; the lines between the girl and the “A” are a bit thin and will be hard to reproduce though.\n\n"
    },
    {
      "time": " 24.Jan.2008 4.17am",
      "content": "The progression between layout 1 and the rest is heading in the right direction.\n\nPersonally, I saw a girl and a wind-surfing sail in pic 1, and ever since cant seem to acknowledge the “adult store” idea behind the communication. Im kinda getting a beach bar or resort-like feel from these.\n\nPerhaps you could deepen the colours so they were less “candy”/girly and a bit more erotic? Rich purple and perhaps a vivid orange?  \nMaybe you could find a nice clean san-serif font and sit the girl inside the bowl of the ’a’?\n\nThe progression of ideas is good so far - keep pushing it and playing with it.\n\n:::::::::::::::::::::  \nWicked Design Potions\n\n"
    },
    {
      "time": " 24.Jan.2008 8.33am",
      "content": "Like Nightshade, it feels more surf shop than adult store to me. That curving triangular shape is more closely associated with the shapes on surfboards, sharks, and sails for many people.\n\nI scaled down the image, to simulate it being seen from a distance, and the woman gets pretty jumbled with the A form. It’s not illegible, because it’s similar to the truck flap girl that everyone knows, but it’s confusing if you don’t know what to expect.\n\n ![](http://web.archive.org/web/20080706221744im_/http:/www.typophile.com/files/small_3551.gif)\n\nPart of this is the details, the other part is the super-thin lines. And most importantly, I think the lady needs some help. Her silhouette may be accurate to a photo, but her body makes lots of weird shapes when in a silhouette. Imagine if someone could only see her upper body by covering her legs and hand - the shape that’s left over doesn’t read as a human form to my eyes. I think the drawing needs to be stylized a bit, or at least considered further. [The truck flap girl](http://web.archive.org/web/20080706221744/http:/images.google.com/images?client=safari&rls=en&q=truck+flap&ie=UTF-8&oe=UTF-8&um=1&sa=N&tab=wi) works because they use a profile silhouette, which allows them to emphasize her bust and show the profile of her face. This helps to make each part of her body feel like a part of a body on its own. The human form doesn’t contain straight lines, so be careful when using them, particularly for feminine forms. Her back and legs should not have straight lines. Also, her arm is a bit anemic and her elbow’s a bit knobby. Don’t take it personally, I’m sure she’s a great person. But figure drawing can be tricky and these are key points to help a figure feel more vital and sensual.\n\nPerhaps you should look at some old [pulp novel covers](http://web.archive.org/web/20080706221744/http:/images.google.com/images?client=safari&rls=en&q=pulp+novels&ie=UTF-8&oe=UTF-8&um=1&sa=N&tab=wi) or some Varga girls for some better buxom, curvy silhouettes. Going for an archetype is a better bet for a logo, which must be a bit more iconic than a simple illustration.\n\nI look forward to seeing where you go with it.\n\n"
    },
    {
      "time": " 25.Jan.2008 6.35am",
      "content": "I’m still not entirely sure of your target demographic. If it is, indeed, the truck-stop type place, this will work (ie, mainly a male-centric clientelle). However, pink might not be the way to go in that case.\n\nAs it is now, I’d suggest adding a right hand to the women extended outward from her body, and have her ’hold’ the a. Just an random idea that may not actually work outside of my head. ;o)\n\nIf the ’truk-stop’ isn’t the type of place you are branding, and are trying to bring in a more female/couples/mixed clientelle, I think you should play with some more abstract ideas.\n\n"
    },
    {
      "time": " 25.Jan.2008 12.45pm",
      "content": "That “A” looks like it is from a faux-east font for an American Chinese food restaurant.\n\n"
    }
  ]
}
