{
  "id": "41000",
  "title": "Jobs: books are dead",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I doubt anyone here has an opinion on this...\n\n[http://www.engadget.com/2008/01/16/if-jobs-says-people-dont-read-anymore...](http://web.archive.org/web/20131014224131/http:/www.engadget.com/2008/01/16/if-jobs-says-people-dont-read-anymore-does-this-headline-rea/ \"http://www.engadget.com/2008/01/16/if-jobs-says-people-dont-read-anymore-does-this-headline-rea/\")\n\n",
  "author": "Si_Daniels",
  "time": "16 Jan 2008 — 12:29pm",
  "uid": "1049",
  "comments": [
    {
      "time": "16 Jan 2008 — 12:33pm",
      "content": "Hasn't print been \"dead\" already for a decade and a half? ;-)\n\nStill, Jobs' take on \"people don't read anymore, especially on paper\" isn't very different from what most technologists/futurists say at given opportunities.\n\nEven if print and books do die, there is still hope for type. At least for now.\n\n"
    },
    {
      "time": "16 Jan 2008 — 12:40pm",
      "content": "this is absurd.  \nprint will die when physical reality goes away.\n\nelectronics, luminous screens, computer interfaces -  \nthese are all great and seductive and increasingly ubiquitous  \nbut to suggest that:  \nA) they will someday be available to everyone,  \nand  \nB) they will someday be preferred by everyone  \nsimply flies in the face of observation and reason.\n\npeople are still drawing and painting, too.  \nnot just obscure marginalized eccentrics,  \nbut active and vital artists.\n\nreflective light and physical pigments have a life and value of their own.\n\n"
    },
    {
      "time": "16 Jan 2008 — 12:48pm",
      "content": "I am an admitted old fart and not gen X or Y or Z. BUT,  \nI love books even if just to have and hold.  \nWhen your battery is on the fritz or your system is down, or when the sun is bright, or when the power is off, or when the cable breaks, or when the UV rays get to you, or when...  \nYou can read a book without worrying if you will need an upgrade, drop it on the floor tuck in a bookmark, lend it to your Aunt Sue, see real type...\n\nChrisL\n\n"
    },
    {
      "time": "16 Jan 2008 — 1:27pm",
      "content": "From what I can tell, the entire notion that reading is rapidly, dramatically declining, is a fallacy. While sales of what publishers and librarians call “serious fiction“ are clearly falling off, it seems like the markets for pulp fiction, fantasy, nonfiction, comics/graphic novels/manga and periodicals are all selling wildly. The tiny independent bookstores of America have been replaced by massive superstores, whose profits are in free-fall because people buy enough books that they’re ordering them from mail-order discounters to save money—not something that people who only read one or fewer books a year do. Digital library catalogs, editions of books, periodical archives, etc. make it easier to do vast amounts of research in relatively minuscule amounts of time. Stephen King has written about this phenomenon, point out that maybe people are just reading less serious fiction because what’s on the shelves is often boring and pretentious, and consumers would rather just stick to Harry Potter.\n\nCan anyone who works with the book industry shed some light on overall book sales as opposed to the decline in reading novels?\n\n"
    },
    {
      "time": "16 Jan 2008 — 1:35pm",
      "content": "Jobs will be dead long before books ever cease to exist. I'm another one of those people (and a design-o-saur at that) who needs and wants to feel the book, smell the ink, and escape from technology into the true reading experience. I've usually got 3-4 books going at once, scattered about the house.\n\nJeff Fisher | Engineer of Creative Identity | [Jeff Fisher LogoMotives](http://web.archive.org/web/20131014224131/http:/www.jfisherlogomotives.com/)\n\n"
    },
    {
      "time": "16 Jan 2008 — 1:38pm",
      "content": "He's got a point. I don't read books nearly as much as I used to nor would like to. And bookstores aren't what they used to be, for sure.\n\nGranted, this is likely what they also said when Radio was invented...and TV...and the Web...and...\n\n"
    },
    {
      "time": "16 Jan 2008 — 1:46pm",
      "content": "I for one read in bed, on the subway, on the beach, all places I don't want to be staring at a screen. Books are perfect because they are both disposable and reusable, I buy most of my books used (even though I work in publishing).\n\nI think some kinds of books may well be dead - phone books for one. But I have a stack of paperbacks by my bed - and am among the 60% who DO read at least a book a year (more like a book a week, or at least a month). So I think he's full of hot air.\n\nAlarmingly, my eyes are starting to go. It's probably just age but I blame the computer screen as well.\n\nI also read the newspaper!\n\n"
    },
    {
      "time": "16 Jan 2008 — 1:59pm",
      "content": "\\>_I for one read in bed, on the subway, on the beach_\n\nAlthough I've not yet taken a laptop to the beach (not so odd, as I actually don't like the beach… unfortunately for me it is just skin cancer waiting to happen…), I very often have my laptop open to read or work in bed or on the subway.\n\nP.S.: Actually, I read and buy quite a lot of books, actually –&nbsp;both used and new. Plus, I read newspapers quite often, although here I must admit as pretty as the print edition is, I always read the New York Times online! It is just more convenient for me, I think.\n\n"
    },
    {
      "time": "16 Jan 2008 — 2:10pm",
      "content": "According to the article [referenced here](http://web.archive.org/web/20131014224131/http:/bookyards.blogspot.com/2008/01/decline-of-book-publishing.html), last year there were more books published than the previous year. And I haven't heard of any over decline of book sales, as compared to the decline in printed-on-paper newspapers.\n\nKindle or its successors may replace paper books, but there's no sign of it yet.\n\nHas anyone seen a Kindle? How readable did you find the screen? \\*Readable\\*, not legible--you could read a hundred pages just as comfortably as a well designed and printed book.\n\n"
    },
    {
      "time": "16 Jan 2008 — 2:21pm",
      "content": "Be sure to get out your Kindle everyone! So you can experience the future of reading! It gives you immediate access to any book in the world, typeset by software with absolutely no typographic skill or quality at all! Here's to trashing one of the most refined pieces of human design in the world: the book!\n\nFeh.\n\nBooks will _never_ go away, unless something occurs to A) prevent their production, or B) make their production untenable. They're too cheap, to convenient, and too good to disappear. Anyone who says otherwise has too much disposable income (or tech stocks).\n\n"
    },
    {
      "time": "16 Jan 2008 — 2:26pm",
      "content": "<cite>I always read the New York Times online! It is just more convenient for me, I think.</cite>\n\nOne of the reasons I read the print edition instead is that by paging through the entire thing I often find myself reading articles I would probably skip online, if I just saw the headline. I hate wasting all that paper but I do feel like I am much better informed by looking at every page of the paper.\n\nI look at books as a way to give my eyes a break from the screen, which is why I don't bring my laptop to bed. I wouldn't dare use it on the subway. I also \\*try\\* not to stare at the screen in the last hour before going to bed - I was told once it was bad for sleep.\n\nI read an article awhile back that I can't find now in defense of the book - it speaks to this point. Oh well.\n\n"
    },
    {
      "time": "16 Jan 2008 — 2:32pm",
      "content": "Uhhhh. 100%-40%=60%. 300 (million people), is to X, as 60 is to. 100..so...180 million people reading more than one book, is a large number to equate to \"no one\". If there is a hidden meaning here, I think Mr. Jobs isn't hiding it. Because Apple can't make good reading devices either in America or for Americans, preferring to make cheap listening devices and communication toys in other countries, Mr. Jobs is not interested in that 60%, preferring to suck blood out of one entertainment industry sector after another, before someone else does. Good reading fonts, after all, are difficult, when compared to phone calls, or vegging to Black Sabbath for a nickel.\n\nCheers!\n\n"
    },
    {
      "time": "16 Jan 2008 — 2:49pm",
      "content": "\\> Jobs: books are dead\n\nSo, fewer jobs, more job seekers ? :)\n\n"
    },
    {
      "time": "16 Jan 2008 — 3:20pm",
      "content": "[uh-huh...](http://web.archive.org/web/20131014224131/http:/www.geekculture.com/joyoftech/joyarchives/692flash.html)\n\n-=®=-\n\n"
    },
    {
      "time": "16 Jan 2008 — 4:00pm",
      "content": "Didn’t he just announce the iTunes Movie Store or something?  \nWhat else could he say but books are dead to promote this.\n\nWhat Stevie didn’t consider is that most Americans may not find the time to read a book in between their two dayjobs and the nightjob (nor can afford a slick MacHotAirBook).  \nThe man’s seriously overrated.\n\nI couldn’t imagine my life without reading books.  \nI have to admit though, all I ever designed in that respect are audiobooks ;-)\n\n"
    },
    {
      "time": "16 Jan 2008 — 4:15pm",
      "content": "If any of Apple's typography managers or programmers are reading this, we have a couple of open positions. Contact me off-list and I'll hook you up. The weather up here isn’t that bad. ;-)\n\n"
    },
    {
      "time": "16 Jan 2008 — 4:42pm",
      "content": "Sorry sii, I had to google a bit first to understand where _up here_ is.  \nIs the weather actually better than _down there_?\n\n"
    },
    {
      "time": "16 Jan 2008 — 5:31pm",
      "content": "By most measures the weather is worse. I remember flying down to sell Apple some fonts two years back. It had been rainy, gray and damp in Seattle for what felt like (and probably was) months. At Apple HQ we sat outside their cafe in the sunshine and had some great noodles - was very pleasant.\n\n"
    },
    {
      "time": "16 Jan 2008 — 5:34pm",
      "content": "Do they sell no-fault insurance in Cupertino?\n\nChrisL\n\n"
    },
    {
      "time": "16 Jan 2008 — 5:40pm",
      "content": "@Descom  \n<cite>You can read a book without worrying if you will need an upgrade.</cite>  \nI dunno about that. Bringhurst is up to version 1.3, and I'm waiting in eager anticipation for when he spells Carl Crossgrove's name correctly in 1.4.\n\n"
    },
    {
      "time": "16 Jan 2008 — 5:41pm",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "16 Jan 2008 — 5:44pm",
      "content": "As to the weather, I'd take our perfect Spring/Summer/Fall and a miserable rainy winter in Seattle over the blistering hot summer and forest/grass fires of Cali.\n\n"
    },
    {
      "time": "16 Jan 2008 — 5:51pm",
      "content": "There is no blistering hot summer or grass fires in Northern California. Northern California is the best place in the entire world if you don't mind the threat of an occasional (every 50 to 100 years) massive earthquake.\n\nAnd, you're not reading this either.\n\n"
    },
    {
      "time": "16 Jan 2008 — 6:04pm",
      "content": "You've sold me. I've not been down to the bay-area in a while... but as they say down there \"I'll be back.\"\n\n ![](http://web.archive.org/web/20131014224131im_/http:/typophile.com/files/thumbnailCAXJ4AUZ_6238.jpg)\n\n"
    },
    {
      "time": "17 Jan 2008 — 1:39am",
      "content": "If the book was invented today, it would be a sensation: You don’t need electricity but you can still take it everywhere.\n\n"
    },
    {
      "time": "17 Jan 2008 — 2:30am",
      "content": "This must be the symptom of our age.\n\n\\_\\_\\_\\_\\_\\_ is Desd!\n\nGod, paper, books, newspapers, no matter how sacrosanct a thing is, it has to be removed.\n\nIt's like something out of Douglas Adams.\n\n"
    },
    {
      "time": "17 Jan 2008 — 4:11am",
      "content": "Wasn't Apple dead, not so long ago?\n\n-=®=-\n\n"
    },
    {
      "time": "17 Jan 2008 — 5:53am",
      "content": "There are several things at play here. First, I’m not one to defend Steve Jobs, but the Engadget article linked at the top of this thread has him saying that people don’t read anymore, not that books are dead. I have issues with both statements anyway.\n\nThat people are reading more and more off screens is just a fact, I don’t think it needs to be qualified further. I’m reading my news online on my computers (an iMac and a crusty old TiBook, alas), and I’m reading technical material (documentation, etc.) and work documents. Do I ever need to print stuff? Very seldom, and I think it’s for the better.\n\nI don’t buy the somewhat luddist position of people who want to feel the paper and smell the ink vs. shabby computers or book-reading devices. I love books, I love paper, I love letterpress too, I wouldn’t be here if that wasn’t the case. But I don’t think anyone can argue that John Le Carré or Dan Brown books, which are printed on cheap paper and are the classical read and then throw in a pile of crap kinds of books, are really objects that we want to carry around in this new century. My father consumes them like crazy, then they end up in huge stacks that just take place and gather dust. Never do they get re-read, because that’s not what they’re after: you don’t read novels like these, you consume them as entertainment. If you follow my point, that kind of disposable stuff doesn’t belong to print, in my opinion. These books don’t have the feel of good books, because they are cheap by design.\n\nThat market sector, which is just huge, is rife for being passed onto e-book reading devices, screens, etc. I have been working with an Italian company that imports e-ink reading devices like the [iRex Iliad](http://web.archive.org/web/20131014224131/http:/www.irextechnologies.com/products/iliad), and I have had one for more than a year now. That is something, like the Kindle, which you can take with you in bed. It doesn’t make any noise, it doesn’t produce light (you’ll need your regular book lamp), it’s as light and as a book. Don’t take my word for it, try to get your hands on one and see for yourself. And consider a device holds not just one book, you can annotate them without harming the original, you can download one while on the road for a fraction of the cost of the paper version, etc.\n\nAlso think of the distribution scenarios and of the environmental issues. Paper needs to be transported by plane, trains, wheel, it has weight, it has limited supplies so new print runs need to be scheduled and produced, then there’s the issue of excess copies, etc. All of this problems that we take for granted are simply not there in a digital scenario. People get books more often, pay them less, authors get paid faster and possibly more without the overhead of print production and distribution, and marketing changes dramatically, too.\n\nFor books which are truly of value, either because they’re wonderful references (think <cite>Letters of Credit</cite>!) or just plain wonderful books (the <cite>Divina Commedia</cite> published by [Tallone](http://web.archive.org/web/20131014224131/http:/www.talloneeditore.it/)), I just don’t see what the supposed threat might be. Where form is ahead or on par of function, form has value and I’ll gladly continue to pay for it.\n\nAs for typography: technical changes are all over the history of our craft, yet until we somehow come up with a way to replace words that need to be read and written, I don’t see any sort of harm whatsoever. In fact I think the market for screen fonts and other ways to present text on screens will become bigger and more diverse, and that is good news for typographers, type designers and for people reading off screens as well.\n\n"
    },
    {
      "time": "17 Jan 2008 — 6:09am",
      "content": "Newspapers are in peril right now, but I suspect that is more from the loss of the once lucrative classified advertising than people not reading. The Web is simply more efficient for buying houses, cars, and getting a job.\n\nAnd the younger generation probably reads less than the older one (and we ... age 50 ... probably read less than our grandparents).\n\nBut when you do read, there is no better format than the old codex.\n\n"
    },
    {
      "time": "17 Jan 2008 — 6:19am",
      "content": "Nostradamus\n\n"
    },
    {
      "time": "17 Jan 2008 — 8:05am",
      "content": "If the [printed] book were invented today? A novel concept. Let's pretend that printing never existed and books have been printed electronically for the last 500 years and are read on electronic readers that were perfected during the first two or three hundred years of electronic publishing.\n\n[seque to futuristic conference room, start with voice over]\n\nI'm a writer and at my publishers office this morning. The publisher, designers and typesetters have my new book all wrapped up in Portable Document Format ready for global distribution. We're excited. My book is ready to be distributed to the entire world in minutes by just pushing some electrons around.\n\nBut one of the designers speaks up and says somewhat confidently, \"hold up, I've thought of a better way to get this information to the readers of the world. First we'll chop a few thousand trees and transport them on big trucks to a plant that will grind them up into pulp, wash the pulp with wicked bleach\" — he didn't know what happened to the bleach after the wash. \"Then we press the pulp and iron it on huge screens, roll this new paper on huge spools, and put the spools on other big trucks to take them a few hundred miles to another plant. It only takes a month or so and only cost a few hundred thousands dollars.\"\n\n\"While the trees are being ground, bleached and pressed, another factory is cooking up big gloppy oil and pigment. The plant cooks this glop to just the right consistently by mixing in some sweet solvents — it's quite a spiritual thing. Then it's put in barrels, loaded on other big trucks, and transported a few hundred miles to the same plant where the paper was delivered.\"\n\nAt this point the designer said \"they take our PDF that we have prepped here, and they etch these huge metal plates with the design. Then they put it on these big machines that transfer the pigmented glop, called ink, onto the paper. This pigmented paper is then cut up and glued into stacks called books. These books you can actually hold in your hand and smell, or even lick if you want! These paper books are collected and put into boxes, and then, you know, loaded on big trucks and taken a few hundred miles to a warehouse.\"\n\n\"At that point the books are broken into smaller units and taken on thousands of smaller trucks and airplanes to places all over the world. What about it? What do you think?\"\n\nSo we think about it. Hmmm? We can deliver this right now with hardly any effort or expense and it can be read on electronic readers that we've been using for hundreds of years, edits and corrections can be made instantly, and autoreaders can even read it to someone without effort. Or we can chop hundreds of trees, mix hundreds of gallons of solvents, cook oil into ink, burn thousands of gallons of fuel and employ thousands of hours of manpower. It didn't take long for us to snort and say \"nah, we think not.\"\n\n[freeze frame, and wrap with voice over]\n\nI'm sure the printed book will last, for a few more years anyway. But you guys are funny. Do all of you naysayers still hitch the horse to the buggy every morning for the ride to the bookstore? I'm amazed at the lack of vision — the same crowd that dismissed typesetting on PCs a couple of decades ago. And let's see, who was that guy who saw the potential for proportional type on PCs?\n\n"
    },
    {
      "time": "17 Jan 2008 — 8:46am",
      "content": "Blue Streak, you left out the part about paper having a resolution of 2700 dpi vs 96 dpi for screen, and being able read paper for hundreds of pages in comfort, vs two paragraphs on screen.\n\nWhen we can read screens with the comfort and comprehension of paper, then screens will replace much of the paper sources of information. The silly part of what Jobs says is that people are not reading. The internet is reading too, and book buying hasn't gone down, as I said.\n\nThe question is when will screen reading be as good as paper.\n\n"
    },
    {
      "time": "17 Jan 2008 — 9:03am",
      "content": "I'm developing a website for an association of landlords in my area. One thing I have to do is get up to speed quickly on New York landlord-tenant law, and one of the association members is lending me a 600-page book on the subject. This book is apparently the only one on the topic that these people recommend, and is both expensive and difficult to find.\n\nI had planned to spend the next couple of weekends reading Harry Potter and the Deathly Hallows ... which is a lovely example of a printed book.\n\n"
    },
    {
      "time": "17 Jan 2008 — 9:12am",
      "content": "William: e-ink based devices are up to 160dpi and getting better, while devices like the Nokia N810 are up to 225dpi. The Apple iPhone is somewhere around 163dpi, apparently. Yes, it’s much worse than paper, but improving quite fast.\n\n"
    },
    {
      "time": "17 Jan 2008 — 9:13am",
      "content": "I'm betting on books. They are fetish objects more and more. As reading on screen becomes increasingly common the line between informational reading and the collecting aspect of owning a printed book will become even more precious. Just follow a thread or two about which vintage version of a book is most desirable. I can see the market for printed books shrinking, and the quality going up as books will become seen more as collectible objects. If on screen reading improves, as we all suspect and are being sold on the idea, then many of us may find ourselves reading books on screen that we own in print so as not to put the wear and tear on the spines.\n\nI like to backpack, but I don't own a GPS device. I take a compass and USGS map. The reason is weight. Same issue with a book. Not everyone wants to be encumbered with electronic devices. There is a freedom to a book and a low tech appeal that probably will never be matched by an electronic device. How many book pages can you read while the person next to you turns on a device and loads the text they want to read? How long to you have to recharge a book before you continue reading? There are so many more factors than on screen text rendering.\n\n<cite>I’m sure the printed book will last, for a few more years anyway. But you guys are funny. Do all of you naysayers still hitch the horse to the buggy every morning for the ride to the bookstore? I’m amazed at the lack of vision — the same crowd that dismissed typesetting on PCs a couple of decades ago. And let’s see, who was that guy who saw the potential for proportional type on PCs?</cite>\n\nThe horse and buggy thought is interesting. We do drive cars (for the moment) but horses still exist, along with the tack, training and other associated industries. Horses are still used for patrol and crowd control in some urban environments (I'm laughing as I write from Fort Worth). The new technology came in and the old industry contracted and adapted. Point being that if you wanted a buggy today you would probably be purchasing one from a very skilled artisan. The buggy might very well be of higher quality than what was available pre-automobile.\n\n"
    },
    {
      "time": "17 Jan 2008 — 9:39am",
      "content": "James, I think your post is based on the false assumption that there has to be some kind of winner in this debate: books are not going away but neither are screens or other digital devices. We just have to understand where each one might fit.\n\n"
    },
    {
      "time": "17 Jan 2008 — 9:58am",
      "content": "Me? False assumption? Is there any other kind? Sry if my tone is combative. I'm actually attempting to dilute the black and white aspects of the Jobs statement and grey it all up.\n\n"
    },
    {
      "time": "17 Jan 2008 — 10:15am",
      "content": "I wonder if a similar debate happened when clay tablets were starting to get replaced by papyrus.\n\nClayman: This papyrus stuff sure is sporting, but it'll never replace the tablets! We've had them for thousands of years, there is an inherent quality, the reassuring weight... they can last for centuries and longer! Clay is warm, volumous and sacred, it's taken from our world's bosom, and shaped by crafty hands into a thing of beauty. It is binding and once set, can not be altered. Without clay, there can not be a law.\n\nScrollman: Yeah dude, but it's frigging heavy, and a pain in the loincloth to produce!\n\nI am sure books will last for at least 10 more years, and would still be around as relics and collectors items after that, but the paradigm is shifting, and as much as this saddens me, there doesn't seem to be much we can do.\n\nPersonally, I'd rather we were still hand-drawing things on virginal vellum.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131014224131/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "17 Jan 2008 — 10:25am",
      "content": "<cite>Not everyone wants to be encumbered with electronic devices. </cite>\n\nor to risk losing it or having it get damaged.\n\n<cite>I am sure books will last for at least 10 more years</cite>\n\noh please, that is ridiculous. My god, people even still listen to the radio, can you believe it? And vinyl was declared dead only to be... not so dead.\n\nIt is just nicer on the eyes to read a book. Call me a luddite. I spend so many hours staring at the screen all day, it's nice to give my eyes a rest when I can.\n\n"
    },
    {
      "time": "17 Jan 2008 — 10:36am",
      "content": "[http://www.ala.org/ala/alonline/selectedarticles/10reasonswhy.cfm](http://web.archive.org/web/20131014224131/http:/www.ala.org/ala/alonline/selectedarticles/10reasonswhy.cfm \"http://www.ala.org/ala/alonline/selectedarticles/10reasonswhy.cfm\")\n\n"
    },
    {
      "time": "17 Jan 2008 — 10:43am",
      "content": "Perhaps the devices themselves can get to the point where it is comfortable to read from, but I have yet to see an electronic book that was typeset properly.\n\nEspecially all of the awesome manuscripts available at the Gutenberg Project, which suffer from an especially hard scenario to read or fix:\n\n1. Courier\n2. Forced line breaks\n\nGranted, WE could probably just fix the stuff and be done with it. But what about the \\*millions\\* of people who have no clue, but gotta have the latest technology?\n\n"
    },
    {
      "time": "17 Jan 2008 — 11:15am",
      "content": "What needs to happen for the e-books to become the dominant form:\n\n1.The readers must become dirt-cheap (will happened when e-texts become responsible for most of the revenue)  \n2. The screens must be of high enough resolution and have no strain on the eyes. (Already happening with e-paper)  \n3. The device must be highly durable and easy to use.  \n4. Common formats must emerge.  \n5. Professional practices of design and typesetting must be applied to commercially available texts.  \n6. Freely available and public domain books and previews (Gutenberg, Moshkov library, google books etc.) be instantly accessible.  \n7. Free wireless across the western world.\n\nMost of these should be achieved in the next 3-4 years, and 6 more years for gradual adoption and acceptance. So all-in-all 10 years. of course this leaves us with only 5 more years until the singularity, but that's a different story :)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131014224131/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "17 Jan 2008 — 11:16am",
      "content": "\\>\\>According to the article referenced here, last year there were more books published than the previous year.\\<\\<\n\n2 words:  \nHarry Potter\n\n"
    },
    {
      "time": "17 Jan 2008 — 11:29am",
      "content": "For some reason the idea of \"curling up with a good e-book\" doesn't strike me as even remotely fun.\n\n"
    },
    {
      "time": "17 Jan 2008 — 12:05pm",
      "content": "\\>For some reason the idea of “curling up with a good e-book” doesn’t strike me as even remotely fun.\\<\n\nEven in nice leather binding?\n\nRemember, we are not talking about clunky grey boxes with shiny buttons and pixalated text on sinister glowing screens.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \nwww.ivangdesign.com\n\n ![](http://web.archive.org/web/20131014224131im_/http:/typophile.com/files/ebook_4620.jpg)\n\n"
    },
    {
      "time": "17 Jan 2008 — 12:39pm",
      "content": "The \"idea\" of a book gives it depth.\n\nDid the \"Video Phone\" (_a phone that captures the user and sends a live feed of one user to another_), ever catch on? No.\n\nWhy?  \nWell, because people like the idea of the traditional phone concealing the user, whether that be subconscious or purposive.\n\nPeople enjoy the \"idea\" of a book.\n\n"
    },
    {
      "time": "17 Jan 2008 — 2:09pm",
      "content": "The video phone did not catch on because it does not solve any particular problem. It is more expensive, and less useful then a voice-only phone. It makes people feel uncomfortable and self-conscious, complicating communication. You wouldn't want to receive a call while sitting on a toilet, or on bad-hair-day, and would think twice about calling someone after a night of heavy drinking. Video calling is more difficult, more expensive and less efficient in day-to-day life then voice communication. E-books are cheaper to produce, easier to distribute, and simpler to augment.\n\nDon't get me wrong, I love books, love 'em with all me heart. I enjoy the smell of good binding, the tactile quality of the paper, the sound of rustling pages and the sight of arching spines, lining together on the shelf. The prospect of books becoming obsolete, sends a shiver down my spine. But look at it this way: An illuminated manuscript is much more precious and beautiful thing then a printed codex. Each volume is unique, each infused with the humanity of the scribe and the vibrance of the illuminator. But movable type on paper, is simply more practical, accessible and easier to produce. Clay-\\>Papyrus-\\>Vellum-\\>Paper-\\>... Each was succeeded by the next. What makes paper exempt?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131014224131/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "17 Jan 2008 — 2:32pm",
      "content": "Jobs is dead.\n\nHéctor\n\n"
    },
    {
      "time": "17 Jan 2008 — 7:49pm",
      "content": "Jobs wasn't suggesting that books themselves are dead; he was commenting on the failure of the Kindle as a product. I disagree with his reasoning--the Kindle is a failure because people prefer physical media, and there's never any reason you would need to carry 800 books with you. I can believe the statistic, however, that 40 percent of Americans read one book or fewer last year. And that one book was Harry Potter.\n\n"
    },
    {
      "time": "17 Jan 2008 — 8:01pm",
      "content": "enjoyed this list\n\n\\*\\*\\*\\*\n\nPosted By: Steven Poole of The Guardian\n\nI here propose a minimal list of features that any successful ebook device must eventually have. Feature parity with physical books, after all, is surely a reasonable baseline demand. So here is what the electronic book of the future will be like.\n\n1 It will have an inexhaustible source of energy and never need recharging.\n\n2 It will have resolution as good as print. (No, Amazon: really as good as print.)\n\n3 It will be able to survive coffee and wine spills, days of intense sunlight, dropping in the ocean, light charring, and falling completely into two or more pieces, while still remaining perfectly readable afterwards.\n\n4 It will allow me to scribble notes and/or doodles in the margins, with my choice of mechanical pencil or fine Muji fibre-tip pen (black). (Note: typing in the margins with a crappy thumb keyboard is not an acceptable alternative.)\n\n5 It will allow me to riffle through it and thus get a quick, intuitive look at the book's argumentative or narrative structure.\n\n6 It will allow me to tear off the corner of a page to write down my phone number (or someone else's).\n\n7 It will display to other people in coffee shops and on public transport the title of what I am reading, so as to advertise my erudition or quirky sense of humour.\n\n8 It will be physically handsome, not drop-dead fugly. (Note to Amazon: for pity's sake, next time, head-hunt people from Sony or Apple.)\n\n9 Indeed, the books on it will still be designed, by typesetters and graphic artists, so as to feed our aesthetic pleasure.\n\n10 I will still be able to lend or give books to friends, or swap books in and out of the honour library of much-read novels in a Mediterranean seaside bar.\n\n11 I will be able to use the ebook as a reliable flat surface for rolling cigarettes or other leaf-based refreshments, without worrying about debris shorting the motherboard.\n\n12 When I receive the updated edition of the Oxford Companion to Philosophy, I will be able to press the previous edition into service as a stand for the left-hand music speaker on my desk.\n\n13 The ebook will function, moreover, as both bug-crusher and discretionary hat. Placed on my face, it will make a soft roof against the sun on the beach.\n\n14 I will be able to hurl a fatuous tome such as Jeff Gomez's Print Is Dead across the room without thereby destroying my ability to read any other books.\n\nThere. Only 14 features to go before we can all abandon paper. Not too much to ask, is it?\n\n"
    }
  ]
}
