{
  "id": "41013",
  "title": "Looking for serif and sans ideal match...",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’ve to produce a book for University 25th anniversary — quite young isn’t? —, and I’m looking for something different from Times, Baskerville, Caslon or Garamond, even if they are pretty. I’ve taken a look at typefaces like Fiona, Leitura, Theserif, however I wonder if this last one is easy to read in a long text. I’ve also take a look at Malaga, but my final choice is not done yet.\n\nThis around 60 pages book will report the short history of this university. Once open the book will have 20 inches in width by 12 inches in height and it will be print on glossy 180 M white paper. I’ll have enough space to work and to play with large headline, large picture and text of course. I thought of Parisine or Agenda for the titles but this final choice is not made either .\n\nI’m looking for a OTF serif typeface for the text, something perfectly readable with a good legibility and with a kind of visual character with something of distinctive with a nice italic. I particularly like the italic lower case k with a bowl. I also look for a type that I can use at 9 or 10 pts. The text will be rather long and probably justified on 3 or 2 columns set on short paragraph with several subtitles.\n\nYour suggestions for a great match between a sans and serif typeface would be very appreciated\n\nThanks in advance.\n\n [‹ Fonts with old style tabular figures](http://web.archive.org/web/20080121184225/http:/www.typophile.com/node/39900 \"Go to previous forum topic\") [Font similar to freight micro ›](http://web.archive.org/web/20080121184225/http:/www.typophile.com/node/40943 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080121184225/http://www.typophile.com/user/5264\" title=\"View user profile.\">sim</a>",
  "time": "<br>",
  "uid": "5264",
  "comments": [
    {
      "time": " 16.Jan.2008 5.04pm",
      "content": "[Serif and Sans Text Families](http://web.archive.org/web/20080121184225/http:/www.fontshop.com/features/newsletters/jun2006_b/)  \n [FF Meta Serif and FF Meta](http://web.archive.org/web/20080121184225/http:/www.fontshop.com/features/newsletters/nov2007_a/)\n\n"
    },
    {
      "time": " 17.Jan.2008 5.56am",
      "content": "Thanks Stephen\n\nI will take a closer look to those suggestions.\n\n"
    },
    {
      "time": " 17.Jan.2008 9.24am",
      "content": "Legacy and Legacy Sans come to mind (by Ronald Arnholm). Meta finally has a serif mate (from Erik Spiekermann). Hoefler Text and Whitney make a good match according to the creators and I particularly like Requiem and Gotham (all four from Jonathan Hoefler and Tobias Frere-Jones)\n\n"
    },
    {
      "time": " 17.Jan.2008 9.50am",
      "content": "The [Amor](http://web.archive.org/web/20080121184225/http:/www.stormtype.com/typefaces-fonts-shop/families-60-amor-serif) family might be worth a look. It has a colorful ital for sure.\n\n ![](http://web.archive.org/web/20080121184225im_/http:/www.typophile.com/files/Amor_Mix_3513.gif)\n\n"
    }
  ]
}
