{
  "id": "4101",
  "title": "Bodoni uses",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "We are currently making a book about typography in one of my classes. I was assigned to do 3 spreads on the font Bodoni. I'm good for all the historical aspects of the font, what I'm missing is mostly some uses for the font in our comtemporary society. I know a lot of magazines and products use it but I don't know which in particular. If some of you are aware of which company (magazine, label, product, newspaper,etc.) uses this font, I would really appreciate it if you could help me out.   \n   \nThanks\n\n",
  "author": "anonymous",
  "time": "3 Apr 2004 — 4:40pm",
  "uid": "1203",
  "comments": [
    {
      "time": "3 Apr 2004 — 10:20pm",
      "content": "And if they haven't redesigned recently, Metropolis (U.S. architecture/design magazine) uses Bodoni (not sure what version) for body copy.\n\n"
    },
    {
      "time": "5 Apr 2004 — 11:15am",
      "content": "Vignelli Associates uses Bodoni all the time.   \nIt's on their web site.   \n   \n [http://www.vignelli.com/](http://web.archive.org/web/20150417022537/http:/www.vignelli.com/)\n\n"
    },
    {
      "time": "5 Apr 2004 — 12:53pm",
      "content": "He asked about Bodoni...\n\n"
    },
    {
      "time": "6 Apr 2004 — 10:17am",
      "content": "Like your music, PattyFab. Yves -- When I knew Massimo his shop was heavily into Helvetica. I'm just thinking off the top of my head now but didn't Bradbury Thompson and Paul Rand use a lot of Bodoni? Bauer used to have the best Bodoni and their Titling series is exquisite IMHO. In Rand's heyday with IBM, Bodoni was used almost exclusively for everything.\n\n"
    },
    {
      "time": "7 Apr 2004 — 5:42am",
      "content": "Tiffany -- I'll take the Bauer version over that WTC Bodoni any day. It looks too much like the Century Schoolbook of metal type days. The x height is wrong for a true Bodoni -- IMO.\n\n"
    },
    {
      "time": "7 Apr 2004 — 11:06am",
      "content": "Louis,   \nVariations of Bodoni seem to be well-loved by industrial designers (for example   \nthe logos of companies like ClassiCon and Artemide). You will also   \nfind Bodoni used in many logos in the fashion and cosmetic industries, such   \nas Elizabeth Arden, some of the product lines for Guerlain, Giorgio Armani,   \nand the CK logo for Calvin Klein. While many of these logos are custom drawn,   \n( \"R\" in Armani), often these companies use Bodoni as a text or title face in   \ntheir promotional materials. Going back farther in time: as Paul mentioned,   \nthere were also many wonderful examples of Bodoni used by IBM. Karl Gerstner   \ndesigned a beautiful volume in 1984 called the \"IBM Bodoni manual\".   \n   \nFabi\n\n"
    },
    {
      "time": "5 Apr 2004 — 9:37am",
      "content": "Harper's Bazaar has always as I remember used Didot. I had a love for this magazine once upon a time. But since Liz Tilberis (editor in chief) passed away it has gone to the crapper. (However I was warming to what Ms. Betts was doing before Glenda Bailey took over.) It was Fabian Baron's brilliance (creative director, demigod of design) and photographer's such as Stephen Meisel, Patrick Demarchelier, Arthur Elgort, Herb Ritts and Peter Lindbergh who did wonders and set them on a path of beauty. Too bad it is not longer like that. The photography is still beautiful, but the magazine seems thin and totally lacking, anti-substantial.   \n   \nAnyway, look into the work of Fabian Baron. He's the maestro of Didot as far as I am concerned (especially his work for Italian Vogue in the early 90s). And before Fabian there was Alexey Brodovitch (Bazaar) and Cipe Pineles (Charm).\n\n"
    },
    {
      "time": "5 Apr 2004 — 11:39am",
      "content": "Vignelli... (shudder) ![:-(](http://web.archive.org/web/20150417022537im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "5 Apr 2004 — 1:01pm",
      "content": "Yes. I do realize that now. (If you are referring to my rant above.)   \n   \nPentagram has done some magazine design. They seem to enjoy Bodoni.\n\n"
    },
    {
      "time": "5 Apr 2004 — 3:33pm",
      "content": "Patricia you're absolutely right. It's just that I'm   \nnot Massimo's biggest fan. Sorry about this slip. ![:-)](http://web.archive.org/web/20150417022537im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "5 Apr 2004 — 4:22pm",
      "content": "thanks for the help guys!   \nanybody else would know of other comapnies using this font?\n\n"
    },
    {
      "time": "6 Apr 2004 — 10:23am",
      "content": "[Massimo Vignelli](http://web.archive.org/web/20150417022537/http:/www.vignelli.com/) is known for his use of Helvetica, but his love for Bodoni was strong enough to create one of [their own](http://web.archive.org/web/20150417022537/http:/www.fonts.com/findfonts/detail.asp?pid=242867).   \n   \noops, i see patricia already posted that link.\n\n"
    },
    {
      "time": "6 Apr 2004 — 10:31am",
      "content": "I suppose it would be more appropriate to say: \"...his love for Bodoni was strong enough [to be involved in the creation of] one of [his] own.\"\n\n"
    },
    {
      "time": "3 Apr 2004 — 10:05pm",
      "content": "The U.S. fashion magazine Harper's Bazaar has long used fonts by Bodoni and Didot.\n\n"
    }
  ]
}
