{
  "id": "41034",
  "title": "Typophile - Design Association/Institution?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Where does Typophile rank among other design associations/instituations, like NAPP or AIGA? Is it considered a design association at all?\n\nI’m considering adding Typophile to my resume’ as one of my design memberships. I figure the amount of knowledge I’ve accumulated over the years posting on Typophile would qualify this.\n\nHow do the rest of you feel about that? Is that a bit much? Would this be noticed/respected by potential employers (I’m betting yes myself)?\n\n [‹ Original Besley Clarendon](http://web.archive.org/web/20080821153645/http:/www.typophile.com/node/40635 \"Go to previous forum topic\") [Happy Birthday Chris! ›](http://web.archive.org/web/20080821153645/http:/www.typophile.com/node/41001 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821153645/http://www.typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 17.Jan.2008 7.59am",
      "content": "Depends on the employer. Applying for a job at Wal-Mart - maybe won’t help, and for a design job do you really want to work for a company that doesn’t know what typophile is? I say include it, when they google you they’ll get typophile as the top hits so you may as well put it on there - you’ve got nothing to hide, right?\n\n"
    },
    {
      "time": " 17.Jan.2008 8.05am",
      "content": "It’s true. And when you do a basic search in Google for my name, most of the hits are from Typophile.\n\nI guess I really posted the question to see what kinda of “official accreditation” Typophile holds within the design community. I’ve always viewed it to be more than just a forum, and I wanted to see if maybe there was a future similar to NAPP or AIGA.\n\n"
    },
    {
      "time": " 17.Jan.2008 8.15am",
      "content": "“I’ve always viewed it to be more than just a forum, and I wanted to see if maybe there was a future similar to NAPP or AIGA.”\n\nYou mean membership dues?\n\n"
    },
    {
      "time": " 17.Jan.2008 8.32am",
      "content": "<cite>You mean membership dues?</cite>\n\nI was thinking conferences, and meet up and training worth college credit. That sort of thing.\n\n"
    },
    {
      "time": " 17.Jan.2008 9.34am",
      "content": "I can’t see why anyone would list membership in most graphic design organizations on business cards or a resume. Unlike architectural, industrial, and interior design associations, most graphic design organizations aren’t accrediting organizations, there are no qualifications to join them, they don’t regulate anything or intercede in matters on behalf of designers and clients, and in the case of NAPP, it’s really just an overpriced magazine subscription. Unless you’re just sucking up to someone who is a very active member of an organization and unlikely to hire nonmembers, it’s just window dressing.\n\nAnd as for Typophile, the last time I was helping someone review resumes, people who added stuff like blogging and web forum activity to their resumes went right into the trash. Who wants to hire someone who spends so much time on web forums that he puts it on a resume?\n\n"
    },
    {
      "time": " 17.Jan.2008 10.03am",
      "content": "\\> Who wants to hire someone who spends so much time on web forums that he puts it on a resume?\n\nA place that wants someone who will be a problem solver and up-to-date on current events in the industry. I had a job once where my job description included 5% for reading magazines and trade publications ... that was pre-Web, I suspect today the same job might want a similar amount of time spent online.\n\n"
    },
    {
      "time": " 17.Jan.2008 10.14am",
      "content": "I work exclusively on the internet and I throw away resumes of people with no web mentions.\n\nI don’t think typophile counts as a group the same way AIGA does, but you’re still a member of the community, so I think it’s safe to list.\n\n"
    },
    {
      "time": " 17.Jan.2008 11.11am",
      "content": "James, you make good points.  \nI’m relatively new to the design world, my experience is still in it’s infantry. I see listing memberships to these active design communities as a viable extension of my design education. I’ve been part of several conferences hosted by NAPP and AIGA. I’ve learned a lot of helpful tips and expanded my design skills (albeit for specific programs) at these conferences too. Granted they’re not nearly as ingrained into the community as other associations are with other professions. You have to agree they’re recognized by most in the design community.\n\n"
    },
    {
      "time": " 17.Jan.2008 11.45am",
      "content": "As any expert on consumer behavior will tell you, people generally don’t make big decisions in ways that strictly conform to the dictates of logic and rationality. A Typophile mention may produce a comprehending nod, but you’ll always have greater success if you present yourself to prospective employers as somebody they want to hire rather than as somebody they should.\n\n"
    },
    {
      "time": " 17.Jan.2008 12.46pm",
      "content": "I think I inadvertently derogated this conversation. Sorry, I appreciate all the comments about my personal standings and how someone should view me as a potential hire but it’s not what I was going for in the original question.\n\nI’m trying to find out if Typophile is or could be considered a valued design association in the likes of other design associations (i.e. NAPP and AIGA). I shouldn’t have added the part about including it in my resume and in hindsight was the wrong way to put the question into context.\n\n"
    },
    {
      "time": " 17.Jan.2008 4.15pm",
      "content": "James said... _there are no qualifications to join them_\n\nTo join AIGA at the Associate or Professional levels, you must be [a practicing and/or teaching member in any design community](http://web.archive.org/web/20080821153645/http:/www.aiga.org/content.cfm/join).\n\nJames also said... _they don’t regulate anything or intercede in matters on behalf of designers and clients_\n\nI don’t know, James. Would you say that about the [Graphic Artist’s Guild](http://web.archive.org/web/20080821153645/http:/www.gag.org/pegs/index.php)? And what do you make of [the many activities that AIGA organizes](http://web.archive.org/web/20080821153645/http:/www.aiga.org/content.cfm/benefits)? Or the annuals that AIGA and the [Type Directors Club](http://web.archive.org/web/20080821153645/http:/www.tdc.org/) publish? Or the [AIGA/Aquent Salary Survey](http://web.archive.org/web/20080821153645/http:/www.aiga.org/content.cfm/salary-survey)? Or AIGA [Voice](http://web.archive.org/web/20080821153645/http:/www.aiga.org/content.cfm/voice)?\n\nNow, getting back to Asvetic’s original question... I think most people would qualify Typophile as an online forum or community, but not as a design or typographic association!\n\n"
    },
    {
      "time": " 17.Jan.2008 4.18pm",
      "content": "Also... associations usually have dues you have to pay, and have a board that runs things. AIGA, GAG, SI, SoTA, TDC, etc. are all examples of this.\n\n"
    },
    {
      "time": " 17.Jan.2008 4.36pm",
      "content": "<cite>You have to agree they’re recognized by most in the design community.</cite>\n\nI don’t disagree with you there at all.\n\n<cite>To join AIGA at the Associate or Professional levels, you must be a practicing and/or teaching member in any design community.</cite>\n\nSorry, I wasn’t specific enough there. What I meant was that there aren’t any sort of examinations to qualify one for membership, which is not the case with some other professional organizations.\n\n<cite>Would you say that about the Graphic Artist’s Guild? And what do you make of the many activities that AIGA organizes?</cite>\n\nI’ll admit the Graphic Artist’s Guild does a heck of a lot. Honestly I forgot about it because I very rarely hear it mentioned outside of Typophile. As for the activities of the AIGA, TDC, and so on, those activities are certainly of great value. However, unless one happens to have been directly involved in making those things happen, they do not apply to one’s resume. My post was in no way intended to denigrate graphic design professional organizations, just to point out that simply being a member of one does little to qualify one for a job.\n\n"
    },
    {
      "time": " 17.Jan.2008 7.09pm",
      "content": "<cite>What I meant was that there aren’t any sort of examinations to qualify one for membership, which is not the case with some other professional organizations.<br>\n</cite>\n\nThis might be a difficult thing to measure in the world of graphic design. So little differentiates us from the wide gamut that makes up the creative art world. Examinations would have to be very specific, and geared towards both knowledge and application. There would be so many fields of accreditation. Would you be expected to take several accreditations if you’re an illustrator, web designer, typographer and production artist?\n\n"
    },
    {
      "time": " 17.Jan.2008 7.22pm",
      "content": "_simply being a member of one does little to qualify one for a job_\n\nI disagree with that, James — to me, at least, it shows you give a heck.\n\n_As for the activities of the AIGA, TDC, and so on, those activities are certainly of great value. However, unless one happens to have been directly involved in making those things happen, they do not apply to one’s resume._\n\nThere are exceptions... for example, the TDC has some great [classes and workshops](http://web.archive.org/web/20080821153645/http:/www.tdc.org/events/education/index.html), and if you attend one, you can list it under “Continuing Education” on your resume. I think that something like that _does_ help to qualify one for a job.\n\n"
    },
    {
      "time": " 18.Jan.2008 12.49pm",
      "content": "I don’t think any design organization _qualifies_ you for a job... but it shows where your interests and commitments lie.\n\nWhen you join the AIGA you show your belief in the AIGA’s agenda. Because the AIGA is well know, that says something about who you are, or at least what you think is important.\n\nListing your involvement as a member of Typophile would say something about your interest in staying current with your typography practice; which is at the core of any graphic design practice. But, I would hesitate to call us an institution... We lack the bureaucracy and budget of the AIGA.\n\nA hypothetical question: would Typophile be a more legit organization if we mailed you more “recyclable” materials.\n\n"
    },
    {
      "time": " 18.Jan.2008 1.50pm",
      "content": "_Listing your involvement as a member of Typophile would say something about your interest in staying current with your typography practice; which is at the core of any graphic design practice. But, I would hesitate to call us an institution..._\n\nAn alternative is to list Typophile as an online forum you belong to (rather than an institution).\n\n"
    },
    {
      "time": " 18.Jan.2008 2.15pm",
      "content": "<cite>A hypothetical question: would Typophile be a more legit organization if we mailed you more “recyclable” materials.</cite>\n\nOnly if it doubles as a tote bag or windbreaker.\n\n<cite>An alternative is to list Typophile as an online forum you belong to (rather than an institution).</cite>\n\nI might have a miscellaneous section for awards, extended learning/conferences, and memberships. I’m a NAPP member and I’m going to probably be joining AIGA again this year. But of all my memberships, I feel as if I get more out of my membership to Typophile.\n\n"
    },
    {
      "time": " 18.Jan.2008 2.25pm",
      "content": "<cite>A hypothetical question: would Typophile be a more legit organization if we mailed you more “recyclable” materials.</cite>\n\nDatabases and moderators aside, is Typophile really even organized? Typophile is a pretty fun and open forum—I’m not sure organization is the point.\n\n<cite>But of all my memberships, I feel as if I get more out of my membership to Typophile.</cite>\n\nThat’s one of the reasons I didn’t renew with the AIGA.\n\n"
    },
    {
      "time": " 21.Jan.2008 1.29pm",
      "content": "James, Andrew (Asvetic) that is the best endorsement any organization (or disorganization) could ask for.\n\n"
    }
  ]
}
