{
  "id": "41050",
  "title": "Logo Critique",
  "forum": "Design",
  "tags": [

  ],
  "content": "My photographer friend says that my initial logo looks too much like an optometry business. I’ve read so much relevant feedback towards the various design critiques, that I thought I would post it for feedback. Have fun.\n\nRussell\n\n| Attachment | Size |\n| --- | --- |\n| [Sharp Eyes\\_logo.jpg](http://web.archive.org/web/20080207163422/http:/typophile.com/files/Sharp%20Eyes_logo.jpg) | 104.06 KB |\n\n [‹ grotesque sans serifs](http://web.archive.org/web/20080207163422/http:/www.typophile.com/node/19185 \"Go to previous forum topic\") [Designer/Animator Portfolio ›](http://web.archive.org/web/20080207163422/http:/www.typophile.com/node/41254 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080207163422/http://www.typophile.com/user/25711\" title=\"View user profile.\">Bucky</a>",
  "time": "<br>",
  "uid": "25711",
  "comments": [
    {
      "time": " 20.Jan.2008 2.14am",
      "content": "As nobody has posted anything yet I thought I’d drop my 2 pence.  \nThis logo isn’t really working for me. I might even say that I think that the name is a bit too obvious and design is always aimed at communication so the tagline also doesn’t really work I think. If you use a name like that you can use a nicer tagline.. even something like “making things looks pretty” (was it Sagmeister who said that as an explanation of his work??), improving your view, enhancing your vision (maybe these aren’t too great, but I just mean you can probably write something a bit more witty if you take some time to think about it).  \nYou might also want to do some more mapping of other things that have to do with sharp eyes (blurry vision vs sharp vision). I’m not sure if the lettering works well inside the eye. You could also perhaps draw an eye (or even photograph a real eye or eyeball) and use that as a mark with “Sharp Eyes” written underneath.\n\nI think you need to experiment a bit more and try not to make everything too obvious. Also write down how you want your company to feel, what does it want to express. Just a few keywords to give yourself a certain feeling to what you want the logo to express.\n\ngood luck and hope to see some more examples of different styles.  \ndav(2)\n\n"
    },
    {
      "time": " 21.Jan.2008 12.09pm",
      "content": "Hi Dave,\n\nThanks for the feedback. I was beginning to wonder if I’d violated some typophile unwritten law about posting! Your comments make a lot of sense. I chose a name that has personal meaning for me as it was a nickname my dad gave me when I was young. I have a background in copy editing and typesetting as well as design, so the name is a hint at that. I want a logo that has a corporate feel as those are the clients I seem to get, but you are correct in that I’m being a bit obvious/safe. My thinking was that “blurry vision” didn’t really give the connotation of a company “sharp, exact, precise and on their game. I used the tagline because I thought graphic design was a bit too common. Anyway, I posted for exactly this kind of feedback, so I’m back to my sketchpad!\n\nThanks Dave, I’ll post again when I have something relevant to present.\n\nRussell\n\n"
    },
    {
      "time": " 23.Jan.2008 7.12am",
      "content": "I’ve already replied to this... is it posted somewhere else?\n\n"
    },
    {
      "time": " 29.Jan.2008 7.16pm",
      "content": "no...please, dont do it\n\n"
    }
  ]
}
