{
  "id": "41066",
  "title": "New Cookie Stuff (Critique Needed)",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I thought I’d make a new thread for this to separate it a bit.  \nMy brief was to create an identity for a homemade cookie company with emphasis on the homemade and traditional elements of the brand.  \nI’ve taken the logo in a different direction from my original ideas.\n\nThis logo was my original idea that I wanted to use.\n\n ![](http://web.archive.org/web/20081007180101im_/http:/www.typophile.com/files/logo_1_4204.png)\n\nThis is the different direction that I took it. This logo would be applied by rubber stamp to all the stationary and packaging.  \nBecause this is quite a small-time company this is commercially viable. I hand drew the lettering and then traced them. Advice on the type would be really appreciated as I have never really done it before.\n\n ![](http://web.archive.org/web/20081007180101im_/http:/www.typophile.com/files/logo_2_4658.png)\n\nThanks for the feedback in advance.\n\n [‹ I hate this logo](http://web.archive.org/web/20081007180101/http:/www.typophile.com/node/40520 \"Go to previous forum topic\") [Multi-Faceted Tradesman Identity ›](http://web.archive.org/web/20081007180101/http:/www.typophile.com/node/42091 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007180101/http://www.typophile.com/user/25012\" title=\"View user profile.\">smongey</a>",
  "time": "<br>",
  "uid": "25012",
  "comments": [
    {
      "time": " 18.Jan.2008 7.41am",
      "content": "I would say you’ve done something very nice. It is legible. I would mention that my eye goes to that ball terminal in the ampersand, probably because of the power of the target/sun glyph. You might turn the volume down on that bit and then the L & E will lead the eye.\n\n"
    },
    {
      "time": " 18.Jan.2008 8.59am",
      "content": "How about this?\n\n ![](http://web.archive.org/web/20081007180101im_/http:/www.typophile.com/files/logo_3_4133.png)\n\n"
    },
    {
      "time": " 18.Jan.2008 9.09am",
      "content": "More balanced. It keeps my eye moving. I’m not stopping on the ampersand. I suspect you could work with the curves and the harmony of shapes forever. This, to me, is a much improved direction.\n\n"
    },
    {
      "time": " 18.Jan.2008 9.45am",
      "content": "I think that could look very nice rubber stamped. Check [this flickr page](http://web.archive.org/web/20081007180101/http:/www.flickr.com/photos/luxuryluke/510533727/) for that kind of rubber stamp aesthetic.\n\n"
    },
    {
      "time": " 18.Jan.2008 10.46am",
      "content": "They’re great images for that Butter label. Nice type too. I want to use labels like that with thread to tie up small canvas bags for the packaging.\n\n"
    },
    {
      "time": " 19.Jan.2008 9.31am",
      "content": "Any other feedback about the actual logo would be appreciate too.\n\n"
    },
    {
      "time": " 20.Jan.2008 5.23am",
      "content": "This is a much awaited and fresh approach that works much better. Besice some little tweaks maybe it seems pretty much done.\n\n"
    },
    {
      "time": " 24.Jan.2008 8.39am",
      "content": "I like what you’ve done. The L form could use a bit of work. The stroke feels a bit stiff at the transition points at the top loop and the bottom. The little hook on the E that meets the j feels like it could use a little work. Something about where it transitions from thin to thick doesn’t quite sit right with me. Also the bottom left curve of the ampersand feels like it has a slight kink in it near the dot in the i, that flattens the bottom bowl a bit.\n\nAs jupiterboy said, you could tweak this thing forever. Overall, it’s looking very good. Hopefully you’ve been tweaking this thing for a few days now.\n\n"
    },
    {
      "time": " 4.Feb.2008 5.53am",
      "content": "Thanks again for all your support and comments.\n\nHere’s the latest!\n\n ![](http://web.archive.org/web/20081007180101im_/http:/www.typophile.com/files/logo_again_6259.png)\n\n"
    },
    {
      "time": " 4.Feb.2008 5.30pm",
      "content": "Wouldn’t it be good (or would it?) if the exit strok on the ampersand and the y crossed in some way?\n\n"
    },
    {
      "time": " 15.Feb.2008 12.55pm",
      "content": "I really like the first & second ones - I’d perhaps want something between them, in terms of weight of the ampersand. The third one feels far stiffer to me - the “E” and “L” seem deprived of some of their fluidity. I disagree about crossing the ampersand & the “y” - those exit strokes balance the L/E strokes on the left very well right now (or at least in 1 & 2).\n\nLovely work!\n\n"
    },
    {
      "time": " 15.Feb.2008 1.43pm",
      "content": "Speed it up a little, so that it looks a bit like you write this message on every product as a signature of approval. The anger over the revaluation that Rumsfeld stamped his signature shows how much people value these little touches.  \nThis means that you should have a slightly inconsistent x-height, drop the bottom of the v, bring the e up so the bottom of the curl is closer to the level of the top of the v, line up the start of the ampersand stroke with the end of the e, link the n w/ the E, draw up the end of the n more sharply, draw the bottom of the j out more horizontally, and not curl back and just let it go.\n\n"
    },
    {
      "time": " 15.Feb.2008 2.42pm",
      "content": "Nice concept. Your curves are getting better. Look at some old issues of U&Lc. Tom Carnase once said to me that while drawing curves on a letterform one should imagine flying a small plane with a cup of coffee on the dashboard and trying not to curve in such a way as to spill it.\n\n"
    }
  ]
}
