{
  "id": "41091",
  "title": "New to Adobe Illustrator",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi everyone, I am new to graphic design. Do you know any good beginners tutorials for Adobe Illustrator CS3?\n\nAlso, I know basic knowledge of the program, and have been trying to finish one of the tutorials off of this website: [http://www.ndesign-studio.com/resources/tutorials/itune-icon/](http://web.archive.org/web/20080328093815/http:/www.ndesign-studio.com/resources/tutorials/itune-icon/ \"http://www.ndesign-studio.com/resources/tutorials/itune-icon/\")\n\nI am stuck at the part where it tells me to create a black to white gradient and to “screen” blend it onto the previous blend. Is there something I’m missing to achieve this? I have followed every step told to me, and when I blend the gradient with the shape it ends up looking deformed.\n\n [‹ Garamond-esqe Typeface](http://web.archive.org/web/20080328093815/http:/www.typophile.com/node/41087 \"Go to previous forum topic\") [Computer/Technology Icons ›](http://web.archive.org/web/20080328093815/http:/www.typophile.com/node/41085 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080328093815/http://www.typophile.com/user/26103\" title=\"View user profile.\">acdc125</a>",
  "time": "<br>",
  "uid": "26103",
  "comments": [
    {
      "time": " 18.Jan.2008 7.12pm",
      "content": "Probably not the best place to ask for detailed help.\n\nThe tutorial uses the word “blend” a little too much (or Adobe does)... The “Blend” they are referencing in the second section (after you make the grayscale gradient circle) is found in the TRANSPARENCY palette. Don’t try to use the Object \\> Blend menu command or tool. The little pop-up menu at the top left of the transparency window lets you change how an object “blends” with other art below it... by setting it to “Screen”, the gradient will only lighten up what it is on top of (the green note head).\n\nI’m not sure this is the best way to create this art. For one thing, it is referencing Illustrator version 9... you could create the 3-D green globe a number of other ways in later versions of Illustrator.\n\nI’m curious as to why you don’t use/follow the tutorials on the Illustrator discs, or the ones on Adobe’s site?\n\n"
    },
    {
      "time": " 18.Jan.2008 7.48pm",
      "content": "Alright, Ill look for the one on my discs. Thank you for the reply.\n\n"
    },
    {
      "time": " 18.Jan.2008 8.32pm",
      "content": "[www.lynda.com](http://web.archive.org/web/20080328093815/http:/www.lynda.com/ \"www.lynda.com\") has good tutorials.\n\n"
    },
    {
      "time": " 18.Jan.2008 10.05pm",
      "content": "<cite>Probably not the best place to ask for detailed help.</cite>\n\nI disagree! There are a lot of very talented designers here with advanced knowledge of Illustrator and a plethora of other design programs from Adobe and more. Don’t be afraid to ask a question about how to do something. You’ll be surprised by how many people will be able to answer. Plus, they’d probably share more information on how to do it better!\n\n"
    },
    {
      "time": " 19.Jan.2008 2.33am",
      "content": "i agree with Asvetic...people on here are some of the most helpful and nicest i’ve seen on forums. :)\n\n"
    },
    {
      "time": " 19.Jan.2008 5.12am",
      "content": "The Peachpit Press Visual Quickstart books are the best of Adobe products. And they are not costly.\n\n"
    },
    {
      "time": " 19.Jan.2008 6.55am",
      "content": "Mike, in addition to lynda.com, there is a great series of books from Adobe called [Classroom in a Book](http://web.archive.org/web/20080328093815/http:/www.amazon.com/exec/obidos/search-handle-url/index=stripbooks&field-keywords=adobe%20classroom%20in%20a%20book&results-process=default&dispatch=search/ref=pd_sl_aw_tops-1_stripbooks_4204023_2&results-process=default)... I highly recommend them. They walk you through a series of projects and come with a CD that has finished and unfinished versions of each project.\n\n"
    },
    {
      "time": " 19.Jan.2008 7.05am",
      "content": "_I am stuck at the part where it tells me to create a black to white gradient and to “screen” blend it onto the previous blend. Is there something I’m missing to achieve this? I have followed every step told to me, and when I blend the gradient with the shape it ends up looking deformed._\n\nMike, I just looked at the tutorial. What they mean by “Screen blending mode” is an option you select in the Transparency palette... All you have to do at that point in the tutorial is to select “Screen” from the pop-up menu (in the illustration that accompanies that step, look for the Transparency palette, and you’ll see what I mean). Don’t blend any gradients at that point.\n\nGood luck,  \nRicardo\n\n"
    }
  ]
}
