{
  "id": "41106",
  "title": "Complimentary body text font for Stag?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello.  \nI'm in the middle of a magazine redesign and I've settled on Christian Schwartz's Stag (serif) for the display, but I need a complimentary body type. Any come to mind?\n\nThanks in advance for your help.\n\nKeith\n\n",
  "author": "<a href=\"/web/20100820030143/http://typophile.com/user/6515\" title=\"View user profile.\">kwebb</a>",
  "time": "<br>",
  "uid": "6515",
  "comments": [
    {
      "time": "",
      "content": "There are literally hundreds of text faces that would work. The most important question to ask is: what is the subject, tone and audience of your magazine?\n\n"
    },
    {
      "time": "",
      "content": "If your goal is to find a \"text\" version of Stag, here are a few slabs that work well in running copy:\n\n[Amasis](http://web.archive.org/web/20100820030143/http:/www.fontshop.com/search/?q=Amasis)  \n [PMN Caecilia](http://web.archive.org/web/20100820030143/http:/www.fontshop.com/fonts/downloads/linotype/pmn_caecilia_std_ot_virtual/)  \n [Serifa](http://web.archive.org/web/20100820030143/http:/www.fontshop.com/fonts/downloads/elsner_flake/serifa_ot/)  \n [Egyptienne F](http://web.archive.org/web/20100820030143/http:/www.fontshop.com/fonts/downloads/linotype/egyptienne_f_std_ot_virtual/)\n\n"
    },
    {
      "time": "",
      "content": "Good questions Stephen.\n\nThe magazine is focused on cities and ideas to solve problems in a sustainable way. The core reader has been urban planners, architects and highly educated academic types (mostly middle aged, white and male). The goal of the design is to broaden and attract a more diverse female reader and shift from being perceived as a trade journal and more as a newsstand title for a more casual audience.\n\nThe copy needs to feel sophisticated and approachable. The content is also very people-focused with lots of interviews, profiles and user information.\n\n"
    },
    {
      "time": "",
      "content": "I also forgot to mention the magazine is a quarterly and intended to be kept for later reference so the magazine needs to a level of craftsmanship and detail. Think 'The Believer'.\n\n"
    },
    {
      "time": "",
      "content": "Sounds like a great job! That's the kind of magazine I would read.\n\nI think any of those slabs I mentioned would do nicely, but if you want to go the more traditional route and use a serif, have a look at these threads which list a few contemporary options:\n\n[http://www.typophile.com/node/41087](http://web.archive.org/web/20100820030143/http:/www.typophile.com/node/41087 \"http://www.typophile.com/node/41087\")  \n [http://www.typophile.com/node/37569](http://web.archive.org/web/20100820030143/http:/www.typophile.com/node/37569 \"http://www.typophile.com/node/37569\")\n\n[FF Meta Serif](http://web.archive.org/web/20100820030143/http:/www.fontshop.com/features/newsletters/nov2007_a/) is also ideal for this project, and because it was co-designed by Christian Schwartz, the creator of Stag, there's some of the same DNA in there.\n\n"
    },
    {
      "time": "",
      "content": "Great options. Thanks Stephen. I was really feeling stuck for a while there. I'll report what I end up doing.\n\nThanks again for you help!\n\nKeith\n\n"
    }
  ]
}
