{
  "id": "41118",
  "title": "Dealing with corporate apathy towards type",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "(apologies in advance for the length of this)\n\nI work in a large creative studio as a lettering artist. From my very first interview 8 years ago I noticed a lack of attention toward typography— this from a company who’s product is copy driven! In that interview I asked about the possibility of getting involved in type design as well. The response was that they had someone on the team who did that and all you needed to do was give him a sheet of letters and he would make a font. (The font guy had no lettering or typography background, but did take a 3 day workshop many years ago in font software.) I was a bit disappointed with that response, but decided I would still try to pursue it. Within the first year I asked about getting Fontographer and having a go at doing my own font. They were a bit wary of the idea as they thought it would take too much time, but said they would let me do it on a trial basis. My first font was produced in less time than their veteran font guy and is still one of our most popular proprietary fonts. As they say, no good deed goes unpunished. Now I carry a full load of lettering jobs and am expected to design fonts as well.\n\nMy latest dilemma involves OpenType. Our design production is done using Freehand (which doesn’t support OT) with extensive use of template keys and scripts for tech checking, etc. There is a team that is supposedly working on making a shift over to Adobe CS3, but the corporate wheels spin slowly. There is some talk about purchasing fonts, but there is no real structure around font licensing decisions. As you can probably sense from my writing, I don’t really have a personality suited to the corporate cubical environment, but I do love that I can do lettering and font development for a living.\n\nEarlier this month I sent an email to my boss with a proposal attached to start getting some of our proprietary fonts turned into OpenType fonts that take advantage of some of the substitution features. It was a bit lengthy as I felt the need to explain some of the advantages of OT. As expected, I got absolutely no response. One of my team members volunteered to ask him about it. My current boss (for about 3 years) is conservative and people tend to fear him. I’ve been told he actually likes me because “He doesn’t cause trouble”. I think I need to cause trouble. I thought I would at least try to get a response and if that doesn’t get anywhere, I would send it out to his manager and possibly the head of creative. I went over his head once on an occasion where he was being completely unreasonable and his boss managed to deal with the situation very tactfully. That person is no longer here, but I think the new person seems reasonable.\n\nAny thoughts on how to get disinterested corporate managers to seriously consider the importance of type and typography?\n\n [‹ Type Specimen Posters](http://web.archive.org/web/20081203203306/http:/www.typophile.com/node/41122 \"Go to previous forum topic\") [Help! ›](http://web.archive.org/web/20081203203306/http:/www.typophile.com/node/41115 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203203306/http://www.typophile.com/user/14650\" title=\"View user profile.\">Stephen Rapp</a>",
  "time": "<br>",
  "uid": "14650",
  "comments": [
    {
      "time": " 20.Jan.2008 9.22am",
      "content": "Show them the money. Explain how the expense will help their bottom line or corporate goals. They won’t care about contextual substitution and how it works but if you can show them time and money savings, increased business, or return on investment, they may listen.\n\nChrisL\n\n"
    },
    {
      "time": " 20.Jan.2008 10.29am",
      "content": "Thanks Chris.  \nI did explain that in the actual proposal, but don’t really have a way to quantify it specifically. Our proprietary fonts have alternates and ligatures now, but can only be accessed through a program we use called Pop Character. Since its a lot of extra work for them to hunt these down and switch glyphs, many designers either skip that or use it minimally. Having OT features to automate this would indeed be a savings of time (and money) and a great improvement towards more professionally set type.\n\nI’m not sure at this point if my boss bothered to read the proposal, and if he did he might be thinking he’d rather play it safe and not propose anything to the higher management. When he first became my boss we had a small meeting of the “type team” to discuss issues and direction. He asked me to bring a list of ideas to it so I did. I showed him the list and he handed it back and said my job was only to help make fonts when asked. He’s not someone that is easy to communicate with. That’s why I’m considering taking the proposal beyond him at some point. I don’t believe its inappropriate for the other managers to have this information as well, but out of courtesy and to avoid going behind his back I did send it to him first. It is a good investment as you say, so deserves to be seen by the other managers involved.\n\nStephen\n\n"
    }
  ]
}
