{
  "id": "41129",
  "title": "Political Typeface",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi Everyone,\n\nI am involved in a local body political party here in Auckland, New Zealand. We are looking to make the jump to national politics, and as such are mounting a branding campaign. A comrade in the organisation is set on using Franklin Gothic on the basis that UK Labour won with it in 1997, and that is used extensively by NZ Political Parties. I'm not too keen on this, perhaps simply because everyone else does it.\n\nDoes anyone know of any work on the topic of typefaces used in political campaigns? Or better yet can someone suggest some typefaces which aren't overused which might allude to our organisation's progressive and socialist roots whilst still appealing to as many as possible? The face will be used predominantly in print ranging from the logo to body text in pamphlets, aimed at EVERYONE (of voting age).\n\nWe are also looking at translating most of our material into Arabic - I know almost nothing about typesetting Arabic: any tips? (I realise that this is the kind of thing people can dedicate their lives to, and is rather a large question)\n\nCheers\n\n",
  "author": "<a href=\"/web/20111217033439/http://typophile.com/user/26154\" title=\"View user profile.\">Rafe Copeland</a>",
  "time": "<br>",
  "uid": "26154",
  "comments": [
    {
      "time": "",
      "content": "Well, the point could be made that Franklin Gothic is a classic American type, and that a party in New Zealand should use type from New Zealand. Try checking out local stuff.\n\n"
    },
    {
      "time": "",
      "content": "Right James:  \n [http://www.myfonts.com/fonts/blhd/churchward-freedom/](http://web.archive.org/web/20111217033439/http:/www.myfonts.com/fonts/blhd/churchward-freedom/ \"http://www.myfonts.com/fonts/blhd/churchward-freedom/\")\n\n"
    },
    {
      "time": "",
      "content": "Come on Nick, there’s such an easy answer to this question: [‘National’ from New Zealand](http://web.archive.org/web/20111217033439/http:/www.klim.co.nz/national_samples.php).  \n;°p\n\nRafe: You might be interested what typophiles had to say about the [Fonts used by [US] Presidential Candidates 2008](http://web.archive.org/web/20111217033439/http:/www.typophile.com/node/40583).  \nF\n\n"
    },
    {
      "time": "",
      "content": "Thanks, huge help. Yes, unfortunately the typography scene in New Zealand is by and large frightening.\n\nCheers for your help\n\n-Rafe\n\n"
    },
    {
      "time": "",
      "content": "\\> Yes, unfortunately the typography scene in New Zealand is by and large frightening.\n\nWell, there’s [Kris Sowersby](http://web.archive.org/web/20111217033439/http:/www.vllg.com/KLIM/), as Florian already pointed out. He was involved in developing FF Meta Serif. Top type designer of our times.\n\n"
    },
    {
      "time": "",
      "content": "And there’s [Matt Bluett aka ashton](http://web.archive.org/web/20111217033439/http:/www.typophile.com/user/25500), among [others](http://web.archive.org/web/20111217033439/http:/typophile.com/wiki/New%20Zealand) … Paul already detected some upcoming [‘kiwi aesthetic’](http://web.archive.org/web/20111217033439/http:/www.typophile.com/node/40587).\n\n"
    },
    {
      "time": "",
      "content": "Florian, although I agree with the notion of \"support your local type designer\", my political preference is for Freedom over Nationalism!\n\n"
    },
    {
      "time": "",
      "content": "Nick, I’m on your side – you saw my winking smiley!?\n\n"
    },
    {
      "time": "",
      "content": "Rafe: I've recently made the acquaintance of Dr. Claire Robinson at Massey University's Wellington campus. She's the head of the Institute of Communication Design, and seems like a plausible partner for identifying some good typographic/design assistance. She has focus/expertise in design for politics.\n\n[http://creative.massey.ac.nz/massey/depart/creative-arts/design/staff/cl...](http://web.archive.org/web/20111217033439/http:/creative.massey.ac.nz/massey/depart/creative-arts/design/staff/claire-robinson.cfm \"http://creative.massey.ac.nz/massey/depart/creative-arts/design/staff/claire-robinson.cfm\")\n\n"
    },
    {
      "time": "",
      "content": "You said socialist, so would literaturnaya work?\n\n"
    },
    {
      "time": "",
      "content": "Thanks for that SpurSerif, I'll give her an email and see what she thinks.\n\nAnd as for literaturnaya, even though one would have to know the history behind it (which most would not), it is important that we aren't associated with communism - as with almost the rest of the world, in NZ communism is used as a negative buzzword by media and politicians alike. By mentioning socialism, I was more trying to suggest that the font is highly accessible and readable which doesn't seem too fancy or classy, as this could be perceived as being pitched at upper classes or the more wealthy portions of society. A font of the people if you will.\n\n-Rafe\n\n"
    }
  ]
}
