{
  "id": "41155",
  "title": "Poster Critique (Updated!)",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi to all!\n\nI would like you to give me some critique about this poster.\n\n[http://typophile.com/files/Others Decide01.jpg](http://web.archive.org/web/20081203224416/http:/typophile.com/files/Others%20Decide01.jpg)\n\nTnx in advance! And please be rough!\n\n| Attachment | Size |\n| --- | --- |\n| [Others Decide01.jpg](http://web.archive.org/web/20081203224416/http:/typophile.com/files/Others%20Decide01.jpg) | 126.29 KB |\n\n [‹ Another hand lettered design](http://web.archive.org/web/20081203224416/http:/www.typophile.com/node/41776 \"Go to previous forum topic\") [Circus Fonts and Wild West Fonts ›](http://web.archive.org/web/20081203224416/http:/www.typophile.com/node/12892 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203224416/http://www.typophile.com/user/22478\" title=\"View user profile.\">eyedreamer</a>",
  "time": "<br>",
  "uid": "22478",
  "comments": [
    {
      "time": " 21.Jan.2008 2.52pm",
      "content": "I don’t entirely understand what it’s supposed to say. If you removed “Others decide,” it would make sense to me, but it would mean something different from what you want it to. Maybe its meaning needs to be slightly more obvious.\n\nYou’ve probably thought about this, but I’ll mention it in case you haven’t: It’s sort of bothersome that it’s “anti hero” on the labels when it really should be “anti-hero,” but there it would look strange if you added the hyphen.\n\n"
    },
    {
      "time": " 21.Jan.2008 3.42pm",
      "content": "Is the type supposed to look al jagged? If so; why? :)\n\n"
    },
    {
      "time": " 23.Jan.2008 7.08am",
      "content": "On the same note as Thomas... if you remove “OTHERS DECIDE,” I would understand.\n\n"
    },
    {
      "time": " 23.Jan.2008 7.31am",
      "content": "I agree that you have a writing challenge. I think the point of the “others decide” is that we don’t get to choose our own labels. This, to me, is where to focus the writing.\n\nAlso, anti-hero is not strong enough. Ever see Bill Viola’s <cite>The Crossing</cite>? I think the idea of showing two oppositional sides could work visually. This is a tough idea to work with. Let us know what elements are set and which are open.\n\n"
    },
    {
      "time": " 28.Jan.2008 1.40am",
      "content": "Thanks guys for the comments. I agree with you. The message is not clear enough. Here is the first version (still not done, some corrections with the typography and the head are yet to be done)\n\n ![](http://web.archive.org/web/20081203224416im_/http:/www.typophile.com/files/hero_5126.JPG)\n\nThe message is much clearer in this poster.  \nAssuming that the first image posted a continuation of this one, I think it will be understandable enough.\n\nOpinions are welcome!\n\n"
    },
    {
      "time": " 6.Feb.2008 5.15pm",
      "content": "Now I really don’t get it.\n\n- Do I decide whether I am a hero or an anti-hero?\n- Do I choose to be (become) one or the other?\n- Am I choosing whether someone else is a hero or an anti-hero?\n- Is the point that labeling someone as a hero or anti-hero is stupid?\n\n"
    }
  ]
}
