{
  "id": "41152",
  "title": "My Pet Peeve",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Maybe the definition of the word has changed.\n\nA WIDOW is the last line of a paragraph that has found itself all alone at the top of the following page.\n\nIt is NOT a single word at the end of a paragraph on a line by itself.\n\nYet it continually amazes me that art directors, professional designers, and professors who teach graphic design do not know this. I encounter daily young designers who will take great pains to ensure words like “combustible” and “nationality” are not without company.\n\nOf course, lone words less than four letters — please don’t call them widows, as they are not — should find their way back among their friends, if possible. Otherwise, stop spending precious time trying to solve something that is neither an error or a problem. And when I ask you, “where’s my ad?” don’t whine and look pleadingly toward Heaven (or the pigeons mating in the rafters) and mumble, “just fixing a few widows; it will only be a minute.” There are no widows in a one-page ad!\n\nThere. I’ve said it.\n\n [‹ A. Paul Weber - your opinion...](http://web.archive.org/web/20080127184634/http:/www.typophile.com/node/41227 \"Go to previous forum topic\") [Isn’t it ironic ›](http://web.archive.org/web/20080127184634/http:/www.typophile.com/node/41261 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080127184634/http://www.typophile.com/user/14140\" title=\"View user profile.\">Greg Stanton</a>",
  "time": "<br>",
  "uid": "14140",
  "comments": [
    {
      "time": " 21.Jan.2008 12.15pm",
      "content": "Speaking as the local ignoramus, aren’t those lone words called orphans? That’s what I’ve been calling them all this time.\n\n"
    },
    {
      "time": " 21.Jan.2008 12.21pm",
      "content": "Nope... [http://en.wikipedia.org/wiki/Widows\\_and\\_orphans](http://web.archive.org/web/20080127184634/http:/en.wikipedia.org/wiki/Widows_and_orphans \"http://en.wikipedia.org/wiki/Widows\\_and\\_orphans\")\n\n"
    },
    {
      "time": " 21.Jan.2008 12.22pm",
      "content": "They need their own name. Out here maybe “republicans” or “war-supporters” might work. ;-)\n\n"
    },
    {
      "time": " 21.Jan.2008 12.23pm",
      "content": "See, so I learned something today! How awesome is that?\n\n"
    },
    {
      "time": " 21.Jan.2008 12.30pm",
      "content": "How about “straggler”?\n\n"
    },
    {
      "time": " 21.Jan.2008 12.37pm",
      "content": "I like straggler, but that suggests it got left behind - maybe “scout” or maybe “Billy no mates”\n\n"
    },
    {
      "time": " 21.Jan.2008 1.04pm",
      "content": "\\> There are no widows in a one-page ad!\n\nWhat if there are multiple columns in the ad?\n\n"
    },
    {
      "time": " 21.Jan.2008 1.49pm",
      "content": "I’m intrigued, because if you’re right, Mr. Stanton, I’ve been an offender.\n\nSo I checked that Wiki definition, and with a credit to Rob Carter, doesn’t it say that the term “widow” can “also be used to refer simply to an uncomfortably short (e.g. a single word or two very short words) final line of a paragraph?”\n\n"
    },
    {
      "time": " 21.Jan.2008 2.01pm",
      "content": "or perhaps it means that those tiny extremities of paragraphs should be called “in need of enlargement spam” :-)ChrisL\n\n"
    },
    {
      "time": " 21.Jan.2008 2.14pm",
      "content": "See the [recent discussion of widows and orphans on another thread](http://web.archive.org/web/20080127184634/http:/www.typophile.com/node/40359), with contributions by three experienced and excellent book designers...\n\n"
    },
    {
      "time": " 21.Jan.2008 5.54pm",
      "content": "I think that the accepted meaning of the term widow has changed over time to refer to the one word last line, and you have to accept that. Or else be the annoying designer who lectures all the editors who mark them as “widows”. Therefore becoming someone else’s pet peeve.\n\nMY pet peeve is when you call someone on a cell phone instead of just the message and the beep you get: “to leave a message just wait for the tone (yup, got that). When you have finished recording you may hang up (um... we know that too) or press 1 for more options (does anybody ever do that?). To leave a callback number press 5 (um... isn’t our number already stored under received calls?) To page this person press pound (anybody EVER do that???)” Meanwhile wasting our precious minutes.\n\nAnother pet peeve? Friends who sit across from each other on the subway instead of next to each other, meaning they have to talk very loudly to communicate.\n\nAnd... people who don’t use bcc for all the names in the email, instead putting them all in the To line, which results in lots of unwanted emails from people hitting “reply all”.\n\n"
    },
    {
      "time": " 21.Jan.2008 6.32pm",
      "content": "I’m pretty sure that the excepted newspaper term for the one word last line is a “runt”.\n\nMy Editor hates them, says they have to go. And yet, there’s a gigantic apostrophe error in the 72 point bold headline that gets no mention.\n\nHow about the “Masthead”/flag/nameplate pet peeve? That one gets me all the time, because you almost \\*have to\\* refer to it incorrectly to get someone to understand what you are talking about, and correcting other people almost has zero effect.\n\nThe best line I ever heard from the Ad Manager talking to an Ad Rep about the “difficulties” she was having with one of the designers was “Just tell him to set everything in Arial. It’s the most legible font of all time. That’s why Microsoft uses it.”\n\nOi!\n\n"
    },
    {
      "time": " 22.Jan.2008 7.20am",
      "content": "My pet peeve is when people who don’t “get” paragraph and character styles (in ID) are allowed to work on the files. Their ignorance wastes their time, and the time of everyone who touches the files after them.\n\n"
    },
    {
      "time": " 22.Jan.2008 7.26am",
      "content": "My pet peeve related to type is that Adobe Illustrator does not have Contextual Alternates on by default (InD does though).\n\nChrisL\n\n"
    },
    {
      "time": " 22.Jan.2008 12.28pm",
      "content": "OK. My pet peeve is you’re allowed to scroll through type in AIllustrator using the up and down arrows on a Windows machine but it doesn’t work on a Mac. UGH! All the years of I’ve been using both platforms and this is honestly the only plus I will give a Windows over Mac OS.\n\nYou don’t know how hard that was for me to admit.\n\n"
    },
    {
      "time": " 22.Jan.2008 12.53pm",
      "content": "Well, OK. A widow is a lone word at the end of a paragraph that has found its way onto the next page or COLUMN.\n\nI like the word “straggler”. I also think stragglers over 4 letters long are just fine!\n\n"
    },
    {
      "time": " 22.Jan.2008 1.02pm",
      "content": "Like I said, I think it’s simpler to just accept that editors will mark short last lines (whether just at the end of a paragraph or at the top of a new page) as widows than to try to re-educate them all.\n\nFWIW Dictionary.com lists both meanings:\n\n3. Printing.  \na. a short last line of a paragraph, esp. one less than half of the full measure or one consisting of only a single word.  \nb. the last line of a paragraph when it is carried over to the top of the following page away from the rest of the paragraph. Compare orphan (def. 4).\n\nAmerican Heritage Dictionary:\n\nPrinting  \na. A single, usually short line of type, as one ending a paragraph, carried over to the top of the next page or column.  \nb. A short line at the bottom of a page, column, or paragraph.\n\n"
    },
    {
      "time": " 22.Jan.2008 5.26pm",
      "content": "I think stragglers — I like this word too — are especially ugly in advertising. Seems to me a copywriter can see what the designer has done and chop a word or two. No?\n\nI have no pet peeves. I love all things. ;^)\n\n"
    },
    {
      "time": " 22.Jan.2008 6.02pm",
      "content": "I started to suggest loiterers.\n\n"
    },
    {
      "time": " 22.Jan.2008 6.31pm",
      "content": "“I have no pet peeves. I love all things. ;^)”\n\nIt must be nice living in a perfect world :-)\n\nChrisL\n\n"
    },
    {
      "time": " 22.Jan.2008 6.35pm",
      "content": "That is why I winked. :^/ Or I should say I winked because I was being sarcastic and/or sardonic.\n\n"
    },
    {
      "time": " 22.Jan.2008 9.08pm",
      "content": "Miss Tiffany, what if the straggler in question is a word like “ambidextrous” and your column is only two inches wide? I can’t imagine this would annoy anyone.\n\n"
    },
    {
      "time": " 22.Jan.2008 10.40pm",
      "content": "No, I guess in that instance the straggler wouldn’t bother me. :^)\n\n"
    },
    {
      "time": " 23.Jan.2008 6.21am",
      "content": "\\> How about the “Masthead”/flag/nameplate pet peeve?\n\nOooh, oooh, is this the peeve venting thread? I want to add headline/heading to the list. There is no headline on the story at the bottom of page 5. There is only one headline in the newspaper. At best you can call the top heading on a section front a headline, but no others.\n\nI agree with Patty on the fact that widow technically is any short line, and has only come to mean the first line at the top of a page over time. Donald Knuth, in the TeXbook, also talks about something called a club line (along with widows and orphans). I have never run across that anywhere else.\n\n"
    },
    {
      "time": " 24.Jan.2008 7.51am",
      "content": "I was just reminded that (what I think is) the misuse of the word [font](http://web.archive.org/web/20080127184634/http:/typophile.com/node/41259) is a pet peeve of mine.\n\n"
    },
    {
      "time": " 24.Jan.2008 8.12am",
      "content": "It’s funny, it never occurred to me that I didn’t have a name for those. I think I just call them “stray line” or “stray word”, but not in any formalized way. Usually in a sentence like: “Adjust the tracking to get rid of that stray line.”\n\n"
    },
    {
      "time": " 24.Jan.2008 8.15am",
      "content": "How about “Members of Sgt Pepper’s Lonely Hearts Club”? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Jan.2008 10.26am",
      "content": "I have always called those words left over “loners,” but stragglers might be a better term.\n\n"
    }
  ]
}
