{
  "id": "41191",
  "title": "A Tabular Question",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A question for those of you who use tabular figures: What characters do you need to have on consistent tabular widths?\n\nNumbers, of course.\n\nWhat about period and comma -- are these important to have on the same width? Generally, I would expect them to line up on themselves, so if period and comma were the same width as each other, would they need to be the same width as the numbers?\n\nWhat about colon (for times)? Semicolon?\n\nIs it important to have a space specially fitted to the tabular width?\n\nIs it important (or useful) to have tabular fractions? On the same width as the numbers, or is it enough that they all be on the same width across fractions?\n\nArithmetic operators: + – × ÷ = \\< \\> ±, etc. ?\n\nMonetary symbols? Percent? Section symbol? Parentheses, braces, and brackets?\n\nThere seems to be a wide variety of implementations among OpenType fonts with the {tnum} feature, so I'd be curious to hear from users -- designers who actually make annual reports and financials and timetables . . . what else? -- what they expect/need from their tabular figures.\n\n-- Kent.\n\n",
  "author": "kentlew",
  "time": "22 Jan 2008 — 1:27pm",
  "uid": "1215",
  "comments": [
    {
      "time": "22 Jan 2008 — 3:35pm",
      "content": "Good questions, Kent. As someone who has done a lot of tabular work on the scientific papers in a pretty wide range of subjects, I'd like to see almost everything you've mentioned above, except for the fractions: I've not seen any scientific work done with fractions (doesn't mean it doesn't happen, but in more than twenty years, I've not seen any!) so they wouldn't really matter to me.\n\n"
    },
    {
      "time": "22 Jan 2008 — 3:41pm",
      "content": "Thanks for your thoughts, Linda.\n\nYeah, I was really thinking about Financials when I mentioned fractions. I was imagining columns of stock prices in tabular columns and thinking that if they use fractions and they're right-aligned, then the fractions need to be at least on a consistent cross-fraction width, so the column doesn't waver. Whether they need to be on the same figure width (i.e., probably a nut fraction) would depend on whether you could expect to find figures and fractions in the same column.\n\n-- K.\n\n"
    },
    {
      "time": "22 Jan 2008 — 4:30pm",
      "content": "Kent,  \nIt may be possible with opentype to create what amounts to case specific punctuation that works with the tabfigures selection. What I mean is, when you select tabular numbers from the OpenType menu, given that you have created a set of operators that match the width, you could substitute a class of glyphs to tabular width (sub @num by @tabnum) where the classes include punctuation and operators. In the case of math operators, I would always make them tabular anyway.\n\nChrisL\n\n"
    },
    {
      "time": "22 Jan 2008 — 4:40pm",
      "content": "When I was asked to modify existing fonts for tabular use it was to save the compositor time - so the font had odd and very specific characteristics. I'll send you info offline.\n\n"
    },
    {
      "time": "22 Jan 2008 — 7:21pm",
      "content": "_Yeah, I was really thinking about Financials when I mentioned fractions._\n\nI'd have to check with my brother-in-law, the financial wizard with the estate in the Bahamas, but if memory serves, only U.S.-based exchanges still use fractions: everyone else has migrated to decimals. Important? Um, well, probably. Essential? I'm not so sure -- if you tune into to Bloomberg TV, for example, they are showing prices on both the NYSE and NASDAQ in decimals these days....\n\n"
    },
    {
      "time": "22 Jan 2008 — 9:29pm",
      "content": "Linda, can you show samples of typesetting where it was useful to have tab-figure-width characters (monetary symbols, punctuation, math symbols)?\n\n"
    },
    {
      "time": "23 Jan 2008 — 5:22am",
      "content": "Chris -- Yes indeed, building {tnum} is exactly why I'm posing the question. I know it would be simple to include tabular punctuation, for instance, but is that necessary or desirable?\n\nIn a table of financials, for instance, presumably the period and/or comma would always be aligned with itself, so it's not necessarily important to have them on the same width as figures. Probably not a bad idea to have the two on the same width, perhaps.\n\nWhat about scientific tables? Again, I would presume that the majority would align on the decimal point, or have a consistent number of digits after the decimal. But, maybe not?\n\nMonetary symbols: Don't they always lead the figures? So do they really all need to be on the same (tabular) width? (Minion Pro includes tabular monetaries in {tnum}, but Arno Pro does not, for example.)\n\nI, too, fit the arithmetic operators on the same width -- but this width doesn't necessarily relate to the figure widths. Should they be adjusted to tabular figure width for {tnum}? Again, if they align with themselves, then consistent cross-operator width is sufficient. If they align against numbers, then they would need a consistent tabular width. But is there any kind of practical situation that would require operators aligned against numbers?\n\nLinda -- You make a good point about the declining use of fractions in stock financials. Tabular fractions are probably only truly valuable in an agate font specialized for stock reporting.\n\n-- K.\n\n"
    },
    {
      "time": "23 Jan 2008 — 9:44am",
      "content": "US stock prices moved to decimals years ago. They are no longer in fractions.\n\nT\n\n"
    },
    {
      "time": "23 Jan 2008 — 10:05am",
      "content": "That is correct. The only use of fractions in financials now would be in historic references, and maybe, rarely in posting interest rates or similar percentages.\n\nOh, and gasoline prices always have that 9/10 of a cent at the end. That's probably the most commonly seen fraction in the US in fact. Seems odd that it isn't a standard character.\n\n"
    },
    {
      "time": "23 Jan 2008 — 1:45pm",
      "content": " ![](http://web.archive.org/web/20130824000739im_/http:/typophile.com/files/figspace_3418.jpg)\n\nIs this the kind of thing that gets set in mechanical equipment catalogs in the USA?\n\nIf so, there are a number of questions:\n\n1. In the second measurement, where there is no fraction, is is good practice to leave a space before the inch mark? If so, it makes sense to have the fraction width correspond to the tab figure width, so that the typographer can use \"Type \\> Insert White Space \\> Figure Space\" (InDesign) to easily access the hard space.\n\n2. Wouldn't it make sense for fonts to have their basic quote marks (hash marks) on an angle? -- identical glyphs, in fact, to the proper minute (foot) and second (inch) characters. That way, they wouldn't be so hard to find and set.\n\n3. Are there similar issues in recipe books?\n\n"
    },
    {
      "time": "23 Jan 2008 — 2:12pm",
      "content": "We don't set many scientific tables, except for a few dismal ones (economics).\n\nWith that caveat, I don't think the period & comma have to be figure width, but they do need to be a comfortable width -- so, for a font like Minion, we made up tabular commas and periods. I just took a look, and the period & tab have a setwidth of 455 units, while the numbers have a 500 unit setwidth. The regular period has a 242 unit setwidth, and is just too tight with numbers, esp. in a table. (This isn't Minion Pro, but a multiple master \"instance.\")\n\nI've also always liked an asterisk at tabular number width, for statistical tables.\n\nWe also usually make up separate arithmetic operators, one set for old style figures, one set for lining. Not so much a width problem as a hight issue. I suppose it would be nice to have them on the figure body -- usually they're close anyway -- although unless they have generous or TeX-like (mathematical) sidebearings, you usually set the arithmetic opeators with a space.\n\n"
    },
    {
      "time": "23 Jan 2008 — 2:20pm",
      "content": "There is actually a character, onedotenleader, Unicode 2024, that can be designated as a period with tab figure width, and I'm doing that in my mega-fonts.  \nBut, as with all these potentially useful characters, the difficulty for the typographer, especially if you're not a specialist typographer per se, and are more of a general graphic designer, is accessibility. This sort of tiny speck character is hard to accurately locate in the glyph palette.\n\n"
    },
    {
      "time": "23 Jan 2008 — 2:24pm",
      "content": "Sounds like a job for a stylistic set, Nick?\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2008 — 3:08pm",
      "content": "But surely that is the \"Tabular Oldstyle\" and \"Tabular Lining\" features, which basically substitute one set of figures with another.  \nNow Kent is wondering if these features should also substitute monowidth, figure-width:\n\n- period and comma  \n-fractions  \n-space  \n-etc., etc.\n\nSounds like a good idea, but are there situations where tabular figures would be required with regular punctuation, etc?  \nYes, with a numbered list, for instance.  \nSo a stylistic set would probably be better--but I'm not sure these are user friendly, and are also in danger of becoming bloated.  \nWouldn't typographers rather have easy access to setting specific glyphs, rather than diificult-to-navigate-to OpenType features that have global effects which are not always apparent exactly what they do?\n\n"
    },
    {
      "time": "23 Jan 2008 — 3:26pm",
      "content": "If stylistic sets ever allow meaningful names instead of numbers, this would be much better,\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2008 — 4:49pm",
      "content": "Right, with roll-over pop-up descriptions--like the way OT features are described at FontShop.com.\n\n"
    },
    {
      "time": "23 Jan 2008 — 5:54pm",
      "content": "<cite>. . . but are there situations where tabular figures would be required with regular punctuation, etc? Yes, with a numbered list, for instance.</cite>\n\nI'm trying to think this through, so don't jump on me for a bonehead mistake, but if you want to use tabular figures in a list, there is no reason you have to use the tabular period with them -- i.e., if formatting direct entry, don't highlight the periods. If coding files, don't include the period in the character code. You wouldn't want any other numbers in the list to be tabular, so not everything in the list could use tabular numbers anyhow. In point of fact, I \\*think\\* I've used the tabular periods with list numbers anyway, and just used less of a ditch to the list body.\n\nI've been making up fonts with a tabular period & comma in \"tnum\" (for some fonts) for a year or so now, & none of the comps has complained. Which isn't to say they shouldn't have.\n\nAlso, BTW, different arithmetic operators, dollar signs, and occasionally pound sterling as a part of \"onum\" & \"lnum\"\n\n"
    },
    {
      "time": "23 Jan 2008 — 6:52pm",
      "content": "_Monetary symbols: Don’t they always lead the figures? So do they really all need to be on the same (tabular) width? (Minion Pro includes tabular monetaries in {tnum}, but Arno Pro does not, for example.)_\n\nThey do, so far as I know, but that doesn't mean they shouldn't be consistent: in extended reading, I would likely not only catch, but also be concerned about monetary symbols that have much variation in width. And if you want to be consistent, wouldn't it be easier to just make one set of monetary symbols to match the tabular figures? ;-) Perhaps we're making this too complicated....\n\n_Linda — You make a good point about the declining use of fractions in stock financials. Tabular fractions are probably only truly valuable in an agate font specialized for stock reporting._\n\nAnd only in historical reference, which really limits usage. Perhaps one would be better off in having individual \"upper\" and \"lower\" values to combine in the Fractions way: that might mean designing lower ones of 16 and 32, but that might be it. You're the designer, Kent: I'm just a lowly user. :-)\n\n"
    },
    {
      "time": "23 Jan 2008 — 8:16pm",
      "content": "<cite> I would likely not only catch, but also be concerned about monetary symbols that have much variation in width. </cite>\n\nI think that in a workhorse where tabular numbers are likely to be used, or where broad compatibility is concerned I utterly agree. But for a text face I don't agree. It's a Georgia vs Scala kind of thing.\n\nIn a text face I think a more expansive if quite judicious sense of difference especially if it's borne out historically should carry the day. For instance I think a British pound sign £ often looks good a bit wider or even much wider than the $ sign.\n\n"
    },
    {
      "time": "23 Jan 2008 — 8:56pm",
      "content": "Good point, Eben -- I think it all boils down to where users expect to see monetary symbols, whether in tables or text.\n\nCertainly, in the few financial publications I read, the vast majority of symbols I see are in a text situation and not a tabular one. Do I notice fluctuations in their character width? Um, well, no. ;-)\n\nBut I'll conduct a non-scientific experiment with tomorrow's rag: my guess (and it's only a guess here) is that the difference in character width isn't terribly large, if it exists at all.\n\n"
    },
    {
      "time": "23 Jan 2008 — 11:29pm",
      "content": "I've designed faces in a lot of different genres, and in my experience the dollar symbol is really the only currency symbol that is comfortable on a width as narrow as that of the numbers. The Euro is of course impossible (figuratively speaking, that is).\n\nI see absolutely no practical reason to make currency symbols the same width as tabular figures -- this is probably just something people think would make effficient design, with no grounding in reality. Of course, I could be wrong, but I will be loth to admit it without seeing evidence.\n\n"
    },
    {
      "time": "23 Jan 2008 — 11:47pm",
      "content": "_if you want to use tabular figures in a list, there is no reason you have to use the tabular period with them_\n\nRight. In fact, a non-tab period should be the default, because of situations like this, where the whole column may have the \"tabular lining\" or \"tabular oldstyle\" feature applied to it as one selection or style sheet. The period with a figure-width (right, below) is too open. The rare occurence where a number (e.g. a year or price) occurs in the text of the list, then that would have to be selected and given a \"proportional\" figure style.\n\nLeft: normal period, quite narrow. Right: period is \"onedotenleader\" with tab figure width.\n\n ![](http://web.archive.org/web/20130824000739im_/http:/typophile.com/files/tablist_6164.jpg)\n\n"
    },
    {
      "time": "24 Jan 2008 — 1:00am",
      "content": "I did a little survey of types and I found that the more old fashioned in style of the font was the more likely that the pound & dollar would diverge. Bickham pro - big difference. Adobe Caslon - small difference. Vista fonts - little or no difference. In terms of my personal taste I will mostly say \"Vive la différence!\" ...if I can get away with using the phrase that is.\n\nNick, I assume you followed your preference regarding the Euro etc with your newspaper type - no?\n\n"
    },
    {
      "time": "24 Jan 2008 — 3:15am",
      "content": "Hello Nick, your list example: If period and comma were half of the tabular-width, then it would be ok to apply such a 'tnum' to list numbers. (A character style with 'tnum' applied to the number only would work best, rather than applying 'tnum' to the entire paragraph.)  \nAnother question (raised above already) is, is it sufficient if period and comma are of equal width, whatever it is, or does it need to be the width of tabular numerals?\n\nThese suggestions introduce an interesting use of 'tnum'! In my current understanding, the effect of applying 'tnum' is the reverse of applying 'pnum', and default would reflect one of them -- which makes two options. The suggestions however imply that 'tnum', 'pnum' and default (none of both applied) are three options. (While by default, punctuation marks or currency symbols may differ in width while numerals may be tabular, applying 'tnum' will turn them into tabular-width ones.) Good idea.\n\n"
    },
    {
      "time": "24 Jan 2008 — 6:28am",
      "content": "\"“lower” values to combine in the Fractions way: that might mean designing lower ones of 16 and 32, but that might be it.\"\n\nLinda, with OpenType, you can write the {frac} feature to combine this all for you for all fractions. All you need is a full set of numerator and denominator glyphs and a couple of lines of feature code. You can then type any fraction like 25/632 apply the fractions feature and get the fraction you wish.\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2008 — 6:32am",
      "content": "That's what I thought, Chris -- I don't have a great need for fractions in the work I edit or things I write these days. One of the nicer advantages to switching over to metric, I guess. ;-)\n\n"
    },
    {
      "time": "24 Jan 2008 — 6:40am",
      "content": "You will never get us bone-headed Americans to switch to the metric system but we can live with decimal numbers :-)\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2008 — 8:20am",
      "content": "\"What characters do you need to have on consistent tabular widths?\"  \nThis depends somewhat on the application, (not program, but rather use, including the size of use, but normally, it was:  \nfigures, figure space, and monetary signs on the figure width. Yen and Pound often needed special drawing for this, with $, ¢ and what was called florin, being fine with but a single drawing. The Euro is and Ruble will be, I think, closer to the Yen and Pound in requirements.  \n: . , ' and \" on 1/2 of the figure width, ; usually followed : just for consistency, on a 1/4 em.  \nvulgar fractions were 1.5 figure width.  \nNormally the figures were on 1/2 em, so the 1/4 em space was used to tab both punctuation and fractions, along with the Em to finish lines, or pile on to the next tab..  \nAssuming then, that your tabularity was based on mulitiples of a full em, there was no problem composing anything.\n\nI'm wondering if OT can be trained to automatically sub . and quarter em for . ... or fractions and quarter em for fractions, when in tabular use, but not too hard...;)\n\nCheers!\n\n"
    },
    {
      "time": "24 Jan 2008 — 9:22am",
      "content": "_figures, figure space, and monetary signs on the figure width._\n\nYes, this is the general belief, although rarely implemented in practice.\n\nMicrosoft standards help propogate the myth, and offer the usual \"reasonable\" explanation:  \n_Fonts with tabular figures should have monetary symbols that are tabular so when they are used for monetary amounts in columns or spreadsheets the data will align_\n\nHowever, I have never come across such columns or spreadsheets where this width equivalence is necessary.  \nIt may have been useful in the days of hard metal space, but surely tabs, set digitally, have made it unnecessary.  \nEven if there were the occasional instance of tab-figure -width currency being useful, is that really enough of a reason to either distort the default currency figures into a narrow width, or go to the trouble of providing an alternate set of figures?\n\n"
    },
    {
      "time": "24 Jan 2008 — 10:56am",
      "content": "\"Yes, this is the general belief, although rarely implemented in practice.\"  \nI've never done anything else...What is implemented in practice?\n\n"
    },
    {
      "time": "24 Jan 2008 — 11:20am",
      "content": "Sorry, a little too subjective as usual.  \nI haven't done a survey, but you're no doubt right David that the norm is tab-figure-width currency.  \nHowever, I'm sure I'm not the only one who does things differently, and many of the OS X .dfonts have varying width currency symbols.  \nBut doing it just because that's the way it's done?--I still say show me why.\n\n"
    },
    {
      "time": "24 Jan 2008 — 12:05pm",
      "content": "One reason to do it outside of some practical reason\\* is to fulfill an aesthetic imperative.\n\nIf you have tabular numbers they take on a certain look and a certain evenness. Having the Currency symbols \"fit\" that look or visual scheme might be better. I think this is like that oft repeated and I think accurate idea that oldstyle figures look better if the number is set into text.\n\nAnother reason would be to continue a modernist urge to regularity in general. I suspicious of that urge these days because I think it was taken too far but it is an idea I understand and can see the practical appeal of.\n\n\\*If you start a line of numbers with a dollar sign & it has one width & then another with a Yen sign and the Currency symbols have different widths the two lines of tabular numbers will be out of synch. There are more ways to look at this than using a set width and an optically equal glyph; one that appears to be the \"same\" size which is what MS seems to like best. You could instead use the same width and position the currency glyph so it's right side relationship to numerals is similar but allow the left side is visually vary in width. You could even let it slip past the bounding box on the left. There might be legit reasons having to do with hinting or something that would preclude that sort of thing.\n\nBut my main point is that I think practicality & aesthetics may have erroneously become conflated here.\n\nAm I off track here?\n\n"
    },
    {
      "time": "24 Jan 2008 — 1:11pm",
      "content": "_If you start a line of numbers with a dollar sign & it has one width & then another with a Yen sign and the Currency symbols have different widths the two lines of tabular numbers will be out of synch._\n\nNot an issue.  \nI just set a table like that a couple of days ago, a business form, using TextEdit.  \nThe Euro (which follows the EU spec.) is much wider than the other currency symbols, but so what?\n\n ![](http://web.archive.org/web/20130824000739im_/http:/typophile.com/files/Shinnter_4416.jpg)\n\n"
    },
    {
      "time": "24 Jan 2008 — 3:13pm",
      "content": "<cite>The Euro (which follows the EU spec.) is much wider than the other currency symbols, but so what?</cite>\n\nI came across [this](http://web.archive.org/web/20130824000739/http:/www.fontshop.com/features/fontmag/002/02_euro) recently.\n\n"
    },
    {
      "time": "24 Jan 2008 — 3:14pm",
      "content": "Nick -- I think Eben is imagining a vertical list of values that is left-aligned, where varying widths in monetaries will force the tabular figs out of line with one another. Whereas, tab-width monetaries will produce an orderly list regardless of left-alignment or right-alignment.\n\n-- K.\n\n"
    },
    {
      "time": "24 Jan 2008 — 3:31pm",
      "content": "_a vertical list of values that is left-aligned_\n\nI don't think anyone who left-aligned a column of values would be too concerned about variances in the width of currency symbols!\n\n"
    },
    {
      "time": "24 Jan 2008 — 3:33pm",
      "content": "Kent has said it better than I could have. I should make a habit of showing what I mean more often. Now it might be the case that Nick's model is the more likely one - I have no idea. But Both models should be supported.\n\nBTW did the point I was making about visual width and the glyph bounding box width being potentially seperate issues make sense to you or should I create a visual?\n\nThanks for the link Jos!\n\n"
    },
    {
      "time": "24 Jan 2008 — 4:34pm",
      "content": "FWIW, some countries \\*do\\* in fact place the symbol after the number. Some countries using the euro, even.\n\nStill, that would only create a need for tabular currency if the doc has multiple currencies....\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "24 Jan 2008 — 4:42pm",
      "content": "You're welcome Eben. Ill-conceived by the so called European Commission’s official specification I found this information very revealing.\n\n"
    },
    {
      "time": "24 Jan 2008 — 6:23pm",
      "content": "I had forgotten about that Thomas! Nice point! It certainly kicks my idea in the head unless you wanted to do something with localization...\n\n"
    },
    {
      "time": "24 Jan 2008 — 6:43pm",
      "content": "_But Both models should be supported._\n\nEben, columns of figures aren't set flush left, they're set flush right or tab-aligned to the decimal point.\n\nWhether the currency symbol is before or after the number, it doesn't interfere with the tabular alignment of the figures.\n\nThe idea that currency symbols should be tab-figure width is an anachronism from the days of hard metal spacing.\n\n"
    },
    {
      "time": "24 Jan 2008 — 7:11pm",
      "content": "A four-to-em space is just too small for a comma, or even a period with tabular numbers. It may make setting a table easier, but to paraphrase Crocodile Dundee, \"It may make your life easier, but it looks like $h!t.\"\n\n"
    },
    {
      "time": "24 Jan 2008 — 7:44pm",
      "content": "<cite>Eben, columns of figures aren’t set flush left, they’re set flush right or tab-aligned to the decimal point.</cite>\n\nI see. These are really good points. But I suppose I was thinking not like a typographer but like a simple typist. If that's your user and in some cases it will be then the MS/Berlow model does give your font some additional robustness even if it makes it a little less interesting/rich.\n\n"
    },
    {
      "time": "25 Jan 2008 — 12:26am",
      "content": "A simple typist would never be able to set a column of figures flush left and have them line up, unless all the numbers had the same number of digits. Because the space character width is not the same as the (tab) figure width.\n\n"
    },
    {
      "time": "25 Jan 2008 — 5:37am",
      "content": "The tab has cured most of the evils.\n\nChrisL\n\n"
    },
    {
      "time": "25 Jan 2008 — 6:57am",
      "content": "\"But doing it just because that’s the way it’s done?—I still say show me why.\"  \nMy answer, reflected not just what works for me.\n\nI think the multiple definitions of 'tabular', and 'you' lurking in the question: \"What characters do you need to have on consistent tabular widths?\" have been explored, and though I hardly ever pine for the days when 'simple typists' solved these problems simply by using typewriters, I pine now. But now the pining, it's over.\n\n\"The tab has cured most of the evils.\"  \nThis too may be true, but take 2 tabs, and you'll never know evil ever existed...\n\nCheers.\n\n"
    },
    {
      "time": "25 Jan 2008 — 9:59am",
      "content": "\"take 2 tabs, and you’ll never know evil ever existed\"\n\nDo I have to call you in the morning after that? :-)\n\nChrisL\n\n"
    },
    {
      "time": "25 Jan 2008 — 12:26pm",
      "content": "Typewriters had tabs, which one could zing the carriage along to, at which point it came to a crashing halt.  \nThe digital equivalent would be to have the tab marker \"snap to\" increments of the tab figure width.  \nBut there's be no point, other than for pining nostalgia buffs.\n\nThe tabs in Quark and InDesign are brilliant. Aligning to the decimal point is indispensible, and the ability to make a sequence of characters into a leader is a lovely bit of fluff.\n\n"
    },
    {
      "time": "25 Jan 2008 — 12:39pm",
      "content": "The true brilliance of the modern digital tab is that a very precise point can be set and repeated and become part of a style sheet that can provide consistent repetion as desired. We can have left aligning, right aligning, center aligning and decimal alining tabs thereby opening the world of tables to sensible production means.\n\nChrisL\n\n"
    },
    {
      "time": "25 Jan 2008 — 12:49pm",
      "content": "Are they called tables because they're tab-led?\n\n"
    }
  ]
}
