{
  "id": "41194",
  "title": "Logo Advice",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi everyone,\n\nThis is my first post on here, despite being a member for a few months, but I was just wondering if I could get some advice.\n\nI’ve been working at a non-denominational Christian church in Mesa, AZ for a couple years, and I’m employed as the graphic designer. But anyways, here is two logos to show you the original, and now the updated one I made recently.\n\n| Attachment | Size |\n| --- | --- |\n| [Spring-of-Life-Logo.jpg](http://web.archive.org/web/20080310015948/http:/typophile.com/files/Spring-of-Life-Logo.jpg) | 121.22 KB |\n\n [‹ Amplitude Italics](http://web.archive.org/web/20080310015948/http:/www.typophile.com/node/41504 \"Go to previous forum topic\") [Yngresagen - a cultural and political organisation for the younger generations ›](http://web.archive.org/web/20080310015948/http:/www.typophile.com/node/41435 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080310015948/http://www.typophile.com/user/22648\" title=\"View user profile.\">Ty</a>",
  "time": "<br>",
  "uid": "22648",
  "comments": [
    {
      "time": " 22.Jan.2008 5.00pm",
      "content": "The new one is easier on the eyes for sure.\n\nBut I am curious about the design sensibility. What does it mean? What should a potential member take from the choice of font and the way it’s presented?\n\nThe letters seems spaced a bit close to me. If the sign is huge that’s one thing. But on a T-shirt or smaller I might loosen up the kerning a bit.\n\n"
    },
    {
      "time": " 22.Jan.2008 5.20pm",
      "content": "Why Helvetica?\n\n"
    },
    {
      "time": " 22.Jan.2008 5.42pm",
      "content": "I’m not sure the dotted line adds anything to the design, or relates to any other part. I’m also not a big fan of the “Web 2.0” gradient on the type, but maybe this is “Church 2.0?” :)\n\n"
    },
    {
      "time": " 22.Jan.2008 6.37pm",
      "content": "church 2.0. smile!\n\ni think the icon lost a bit on impact/energy.  \nbefore it was running over the edges of the  \n“O” which made it more dynamic than having  \nit in the circle.\n\nit seems the man/woman tries to jump out  \nand bangs his/her head on the circle...\n\nalso the doted line doesn’t do it for me,  \nit seems it has been placed without a reason...\n\njust my two cents/rappen\n\nbut i think you did a good job regarding the  \nreadability!\n\n"
    },
    {
      "time": " 22.Jan.2008 6.57pm",
      "content": "\\> Why Helvetica?\n\nmaybe Helvetica isn’t going to hell :)\n\n"
    },
    {
      "time": " 22.Jan.2008 7.38pm",
      "content": "a bit of history:\n\nhelvetia \\> short for confoederatio helvetica \\>  \ntranslation swiss confederation \\> also known as switzerland\n\nthe word helvetica refers to the helvetians, one of the many  \nceltic tribes living in what is now switzerland at the time  \nof the roman conquest.\n\nsmile\n\ni always wanted to write this down...\n\n"
    },
    {
      "time": " 23.Jan.2008 7.53am",
      "content": "Thanks so much for the input!\n\nI see the most questions are regarding Helvetica...\n\nWell, if you guys have seen a typical church logo, it always seems to have crosses, rivers, mountains, etc., along with fancy serif’d fonts and such.\n\nThe biggest issue for me was common stereotypes associated with ’church.’ I don’t believe that crosses, rivers, mountains and all fit any demographic at all anymore. And although real church’s don’t necessarily target any specific demographic, the identity should be simple and neutral.\n\nThe reason I used Helvetica as just an initial idea was because of it’s legibility from distances. It is more fuller in my opinion, and is easier to read if it was to be on a sign. As opposed to the first logo I’ve shown that is News Gothic Standard.\n\nAlso, about the design itself, the original logo before I made the ’old’ one was just the character logo that had ’Spring of Life’ adjacent to it in a horrible font called ’Rage Italic’ I’ve never been a fan of open logos (logos that have no distinct shape) and ’he’ the logo just kinda was standing alone.\n\nAnyways, thanks again for the advice! I’ll see what else I can do with it!\n\nTy\n\n"
    },
    {
      "time": " 23.Jan.2008 8.50am",
      "content": "For me Helvetica reads as “middle of the road” and Consumer oriented. The dots are weird to see in a church logo too - but they are doing a job - separating elements so I can’t ding them except maybe to question the tone they set which is a bit techy maybe. I think you might want to look at other Sans faces as well. What about something with a hint of humanism about it? Maybe something like this?\n\n[http://www.underware.nl/site2/index.php3?id1=fonts\\_in\\_use&findme=auto](http://web.archive.org/web/20080310015948/http:/www.underware.nl/site2/index.php3?id1=fonts_in_use&findme=auto \"http://www.underware.nl/site2/index.php3?id1=fonts\\_in\\_use&findme=auto\")\n\n(depending on intent of course)\n\nSpeaking of which; I would encourage you not merely to break with the previous graphic language ( saying what you are not ) but to describe as fully as you can how the new graphics should read ( saying what you are ).\n\nI will be interested to see how you proceed.\n\n"
    },
    {
      "time": " 23.Jan.2008 2.55pm",
      "content": "I’ve been up to something similar recently. If you wish I could explain more on the concept, as it’s sort of essential to understand how it works.\n\nHere’s the thread on Typophile:  \n [http://www.typophile.com/node/39028](http://web.archive.org/web/20080310015948/http:/www.typophile.com/node/39028 \"http://www.typophile.com/node/39028\")\n\nSome more inspiration for you: the visual identity of _Park Avenue United Methodist Church_ and _Teen Forum/Christian Issues_. A search on Aiga ( [http://designarchives.aiga.org/](http://web.archive.org/web/20080310015948/http:/designarchives.aiga.org/ \"http://designarchives.aiga.org/\")) will turn up large scale images of both.\n\n"
    },
    {
      "time": " 24.Jan.2008 9.44am",
      "content": "Okay, so I worked a little more on it, and I took some advice regarding the line separating the logo and text. I chose Century Gothic rather than Helvetica for the text. I’m trying to stay away from making it look ’churchy’ but it’s kinda hard now...\n\n ![](http://web.archive.org/web/20080310015948im_/http:/www.typophile.com/files/springoflifelogov2_3794.jpg)\n\nLet me know what you guys think.\n\n"
    },
    {
      "time": " 24.Jan.2008 10.45am",
      "content": "I think the wordspacing for the name is too loose and the tag line is much too close to the name. A general rule of thumb I follow (or start from) is my line spacing for two lines such as yours (should I need to do this sort of thing) should be no less than the word (or letter) spacing of the main type (logo).\n\n"
    },
    {
      "time": " 24.Jan.2008 11.13am",
      "content": "“Churchy”\n\nYour mark is very similar to Humanisms happy-human mark.  \n [http://en.wikipedia.org/wiki/Happy\\_Human](http://web.archive.org/web/20080310015948/http:/en.wikipedia.org/wiki/Happy_Human \"http://en.wikipedia.org/wiki/Happy\\_Human\")\n\n"
    },
    {
      "time": " 24.Jan.2008 12.33pm",
      "content": "The letters lif are too tight next to that e. It looks like they have formed a clique and are leaving poor e out. But this isn’t important.\n\nTo me what is important is that even though it is getting better ( it is) I really think it won’t become really good until you can describe what you are after and why. Only then can your choices be deliberate.\n\nYou can always make something that comes close to being a good design by following typographic “rules” or by emulating other designs you like but you can’t get past a 50% or 60% success without serious consideration of the context. Until that happens the design isn’t grounded in it’s purpose. And it will niggle you like a loose tooth or badly fitting clothing because it won’t be quite right.\n\nI don’t mean to brow beat you here. I hope it doesn’t feel that way. Quite the opposite. I hope this helps reduce frustration while you are designing.\n\n"
    },
    {
      "time": " 24.Jan.2008 12.54pm",
      "content": "frode - Yeah, I’m not the original designer of the logo, I’m just trying to develop it.\n\nEben - No, not at all, you’re helping me out a lot. This is the first opportunity I’ve had to been in community with other designers/typographers, and everyone is making really valid suggestions and critiques.\n\nNow about the logo... To be honest, I don’t know what I’m after. Since I’m NOT the original designer of the identity (the jumping man), and the fact that I will never be allowed to design a new one, I’m pretty much stuck with a graphic that I don’t know what to do anything with. Unfortunately, when the original designer thought of ’Spring of Life’ he/she thought of a image of an abstract humanoid slipping on an oil slick, lol. So like I said, since the logo has been established going on 10 years... I’m at a lost.\n\nAnyways, I haven’t even been authorized to try and develop a new identity using the old graphic, I was just trying to make it more appealing in a design perspective.\n\n:)\n\n"
    },
    {
      "time": " 24.Jan.2008 12.59pm",
      "content": "Slipping on an oil slick? Do you know if it’s linked to the church in any way? It seems very wierd.\n\nVisually, I would suggest a lighter circle and perhaps a humanist serif or sans.\n\n"
    },
    {
      "time": " 24.Jan.2008 1.23pm",
      "content": "Could you be allowed to try one thing. Instead of the figure being trapped in the circle, could it break out of the circle. The Spring of Life going beyond traditional boundaries.\n\n"
    },
    {
      "time": " 24.Jan.2008 2.26pm",
      "content": "Thanks for framing the situation. I understand what you are facing better now. I would suggest that as much as you might be able to do by skirting the issue you might request that the church sanction what you are doing in a broader way. Then they could partner with you to develop a clear idea of the message that a new logo/identity might allow. Maybe this is just me but designing around the edges guerilla style and without any involvement or conceptual “buy-in” has always been a recipe for headaches for me. It just never felt worthwhile or satisfying. Maybe you can handle it better than me. :-) Cheers!\n\n"
    },
    {
      "time": " 25.Jan.2008 2.16pm",
      "content": "1 - I definitely think you’re moving in a better direction, but why Century Gothic? Do you happen to have Avenir on your system, Century Gothic is a pale derivative of Frutiger’s genius face.\n\n2 - Have you thought about just ditching the circle around the jumping figure? Or creating a transparent gradient so that it is jumping “out” of something, but jumps into the more “ethereal”. The only problem with that approach is you have to keep the logo in Illustrator format, not generic EPS, however, you can retain spot colors doing a gradient like that in Illy. It could be worth looking into.\n\n3 - I agree with one of the earlier comments who said the bottom eyebrow “Christian Church” is probably a little too close, vertically, to the name. I assume this will have to go on a website and other placements where the render size could be as small as 100 px vertical, so that’s going to shrink down really fast. Maybe do two logos? One for print over a certain size and one for small print/web sizing?\n\nI do like the evolution, no pun intended =)\n\n"
    },
    {
      "time": " 28.Jan.2008 10.18pm",
      "content": "I don’t trust the HELvetica in this Logo, Century isn’t working for me either, and I’m a huge fan of both.\n\nI think for this type of client a humanistic font would be more believable.\n\n“Letters are my friends”\n\n"
    },
    {
      "time": " 29.Jan.2008 1.43pm",
      "content": "Any recommendations on the fonts?\n\nI agree that Helvetica Standard isn’t really working, but what about other variations? I’m a really big fan of Neue Helvetica 23 Ultra Light Extended ( [http://www.linotype.com/13103/neuehelvetica23ultralightextended-font.htm...](http://web.archive.org/web/20080310015948/http:/www.linotype.com/13103/neuehelvetica23ultralightextended-font.html \"http://www.linotype.com/13103/neuehelvetica23ultralightextended-font.html\") ), or maybe Basic Commercial in Bold Extended, but the main thing is that I want to stick with a sans-serif font.\n\nThe majority of serif fonts feel corporate and business like to me. And that’s one thing a church should not be associated with.\n\nI’m really trying to get a budget approval on purchasing maybe a few font packages from Linotype, but I’m the youngest person on staff by 17 years, and my font preference doesn’t seem to agree with the older people on staff :[[\n\nBut in the meantime, I’m still looking for a font that fits the identity of our church.\n\n"
    },
    {
      "time": " 29.Jan.2008 2.27pm",
      "content": "<cite> The majority of serif fonts feel corporate and business like to me. And that’s one thing a church should not be associated with. </cite>\n\nThat really interesting because I associate the other way. I don’t think you or I are wrong or right about this. I don’t think you can be. But it would be interesting to see if that’s how other people feel too.\n\nWhat about a humanistic sans like Beorcana? Maybe that would help with the other members too. I think it feels really warm & human!\n\nCheck it out\n\n[http://www.beorcana.com/specs2.html](http://web.archive.org/web/20080310015948/http:/www.beorcana.com/specs2.html \"http://www.beorcana.com/specs2.html\")\n\n"
    },
    {
      "time": " 29.Jan.2008 3.25pm",
      "content": "I don’t like the roundness of the p, g, o, and e. It doesn’t seem very warm to me. I think it would look better in a font that wasn’t so round.\n\n"
    }
  ]
}
