{
  "id": "41202",
  "title": "Critique for new Web Design agency portfolio/website",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello Everyone,\n\nI'd greatly appreciate some feedback from the experts here. We've just launched the new South Creative portfolio/site.  \nAny thoughts, suggestions, criticisms regarding the logo, web typography, and layout is much appreciated.\n\nMost of the website body is set in Georgia (not like there's many other Serif choices).\n\nThe site:  \n [Gold Coast Web Design by South Creative](http://web.archive.org/web/20131020193108/http:/southcreative.com.au/gold-coast-web-design.html)\n\nFor those of you who commented in my previous thread, I ended up going with Freight Text as body text (in documents) to compliment the logo type.\n\nCheers,\n\nTrevor\n\n| Attachment | Size |\n| --- | --- |\n| [SC-screenshot.jpg](http://web.archive.org/web/20131020193108/http:/typophile.com/files/SC-screenshot.jpg) | 219.56 KB |\n\n",
  "author": "Trevor Curtis",
  "time": "22 Jan 2008 — 11:11pm",
  "uid": "19243",
  "comments": [
    {
      "time": "23 Jan 2008 — 7:24am",
      "content": "My initial reaction: This agency is established and reputable.\n\n"
    },
    {
      "time": "23 Jan 2008 — 9:19am",
      "content": "It’s very solid. I get thoughtful, contemporary, but not trendy.\n\n"
    },
    {
      "time": "23 Jan 2008 — 1:54pm",
      "content": "Thanks, that's definitely what we're trying to portray:) I was initially using SIFR to replace the headers with Freight Text, but it just wasn't close enough to Georgia, and made things appear too cluttered/busy. Removing the SIFR ended up looking better, and improving load times.\n\n"
    },
    {
      "time": "24 Jan 2008 — 2:25am",
      "content": "The site looks great. There is one issue, though. The logo is not rendering very well. The type and icon appear jagged. It seems that you have used a transparent gif. You should try a png-24 instead, which preserves transparency much better than a gif. I believe you'll find that it looks much better.\n\n"
    },
    {
      "time": "24 Jan 2008 — 8:50am",
      "content": "I agree with dch, but I don't know if .png is the best solution. Is it fully supported by the major browsers now?\n\nThe site and logo feel solid and contemporary. I admit, it feels so solid and contemporary that it lacks unique personality for me as a designer. But I imagine for your clients, it's very appealing. I wish the aesthetic of the top navigation was allowed to wander beyond the top area. I prefer the more intriguing and sophisticated dark/light thing you have going over the beige on tan on beige of the rest of the site. Though this allows your work samples to really pop forward, which I imagine was your intent.\n\nUltimately, it's a taste thing, so go with your gut.\n\nOh, one more thing. I really, really want the tail of the 'a' in your logo to have some custom adjustment to follow the curve of the of the 't' it's next to. The 'ut' in 'south' feels better to me, even though I can tell they aren't following the exact same curve. The at looks so close that my brain wants it to be the same curve, but not different enough for it to feel intentional. Though this may simply be a result of the low resolutions of the screen being less faithful to the full resolution version.\n\nAgain, your site is solid and appears to do exactly what you're looking for, and isn't that what design is all about? Nice stuff. I will now just quietly envy your beautiful locale from my office in chilly Philadelphia.\n\n"
    },
    {
      "time": "24 Jan 2008 — 9:55am",
      "content": "Pngs are supported by IE7, Firefox, Safari etc. Supersleight.js (google it) brings IE6 up to standard as well (but with a tell-tale flicker on page loading). Roughly two thirds of browsers support png fully, and with hacks for IE6 99% of browsers do.\n\n"
    },
    {
      "time": "26 Jan 2008 — 11:40am",
      "content": "Hmm... PNGs are still a bit risky when dealing with the masses. Unless you're running the Supersleight script, I'd stick with the gif. In the States at least, IE6 is all over the place.\n\n"
    }
  ]
}
