{
  "id": "4121",
  "title": "Workday projects identity design",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "ive just registered a new domain ( [www.workdayprojects.com](http://web.archive.org/web/20131023204732/http:/www.workdayprojects.com/) ) to showcase my design work and i've decided to go all out and create an identity package for myself. here is a link to the swf file so you can zoom in and check it out. comments appreciated. thanks.   \n   \n [http://clearbolt.com/wdp\\_station.swf](http://web.archive.org/web/20131023204732/http:/clearbolt.com/wdp_station.swf)\n\n",
  "author": "clearbolt",
  "time": "5 Apr 2004 — 11:30am",
  "uid": "2418",
  "comments": [
    {
      "time": "6 Apr 2004 — 4:03am",
      "content": "hi russ   \n   \nfirst, why the dots in the name? do they stand for anything special or are they just design? the color scheme, albeit warm and balanced, is unusual for a design company. I judge the design in terms of client relevance and I find no connection point. It says technical to me, rather than warmth and creativity. The layout is nice, I like it the most of all.   \n   \ngeorge\n\n"
    },
    {
      "time": "6 Apr 2004 — 1:48pm",
      "content": "link to pdf. I can really see what's going on as graphic seems too small to critique\n\n"
    },
    {
      "time": "6 Apr 2004 — 1:49pm",
      "content": "link to pdf. I can't really see what's going on as graphic seems too small to critique\n\n"
    },
    {
      "time": "6 Apr 2004 — 1:56pm",
      "content": "Ole, you can zoom in Flash... Option click I think.\n\n"
    },
    {
      "time": "6 Apr 2004 — 3:38pm",
      "content": "Right-click for the more, savvy/literate PC users ;-P   \n   \nHildebrant.\n\n"
    },
    {
      "time": "6 Apr 2004 — 5:47pm",
      "content": "the reason for the dots is becase i would like to have a more interesting visual element in my identity system. a purely typographic solution wouldve worked but that wouldve definetly pushed it more towards the technical and cold direction you were talking about. im a fan of minimal design and grid systems. its the kind of design i like to do most and hopefully i can continue to work on those type of projects with my future clients.\n\n"
    },
    {
      "time": "7 Apr 2004 — 1:43am",
      "content": "i like the colors. they are very soft and sympathic.   \n   \nif you're printing the backside of your sheet, the negative wouldn't work well, because you will see a shadow of the front-side-logo. what do you think of punching or lasering it out. or you might try to flip the logo.   \n   \nyour logo \"wdp\" is quite rough. i think to rough for the layout and colors.   \n   \ni personally dislike folded business-cards because there are a bit unpractical.   \n   \ncan you make a sample-letter with text? blanc letters are difficult to comment because you'll never send a blanc letter.\n\n"
    },
    {
      "time": "7 Apr 2004 — 12:48pm",
      "content": "its control click for mac users - the zoom thing\n\n"
    }
  ]
}
