{
  "id": "41231",
  "title": "OpenType Pioneers and Best of",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm working on a book (which you can read more about [here](http://web.archive.org/web/20120512004134/http:/www.underconsideration.com/speakup/archives/004208.html)) that devotes one chapter to the \"Best of...\". And I want to feature one or two of the very best and pioneering OpenType typefaces created to this point. Which ones make the best use of technology? Which existing typeface benefited the most from being ported into OpenType? All opinions welcome.\n\n",
  "author": "armin",
  "time": "23 Jan 2008 — 12:08pm",
  "uid": "1996",
  "comments": [
    {
      "time": "23 Jan 2008 — 12:19pm",
      "content": "[P22 Cézanne Pro](http://web.archive.org/web/20120512004134/http:/www.p22.com/products/cezannepro.html) may be the most popular feature-rich OpenType font. It was very popular before OT, but was one of the first typefaces to make use of [contextual alternates, ligatures, and swashes](http://web.archive.org/web/20120512004134/http:/www.fontshop.com/fonts/singles/p22/p22_cezanne_pro_ot/) to improve the emulation of natural handwriting. [Zapfino Extra Pro](http://web.archive.org/web/20120512004134/http:/www.fontshop.com/fonts/singles/linotype/zapfino_extra_lt_pro_ot/) is also a candidate in this handwritten script category, despite it's hyperbolic name. Of course, [Alejandro Paul's scripts](http://web.archive.org/web/20120512004134/http:/www.veer.com/partner/link.aspx?i=1048&c=4&p=search/results.aspx?searchTerm=100002831,100007756,100007359) came later, breaking records as far as number of glyphs.\n\nI'll let someone else determine which fonts take best advantage of the text typesetting features OpenType has to offer.\n\n"
    },
    {
      "time": "23 Jan 2008 — 12:26pm",
      "content": "I'd rate 1. Ed Interlock 2. Arabic Typesetting\n\n"
    },
    {
      "time": "23 Jan 2008 — 1:10pm",
      "content": "I think the record breaker for number of glyphs is actually Arno Pro. Isn't it? And as much as people are loathe to mention Bickham Script it is \\*still\\* hugely popular and was one of the first to show all type designers how many alternates really are possible.\n\nI'll second Ed Interlock. I remember the presentation at TypeCon still and it was awesome to see what House had done.  \nI'll also second Cezanne. (In case a voting system helps.)\n\n"
    },
    {
      "time": "23 Jan 2008 — 1:14pm",
      "content": "Robert Slimbach's open type faces for Adobe have set a new standard for text families.\n\nThey are not only aesthetically very good and superbly crafted, but they have taken great advantage of both Multiple Master and Open Type technology. They don't have all the contextual substitutions of script faces, but they have set a standard by having not only optical sizes--facilitated by multiple master technology--but also within each size they greatly exploit Open type technology: four different sets of figures, fraction creation, small caps in all styles and weights, Central European, Turkish and Greek and Cyrillic characters as well. And open type class kerning. I don't have the latest--Garamond Premier and Arno--but only Minion Pro. Still these, as well as Adobe Jenson and probably others must be counted among the 'bests' of Open Type.\n\nSo I would think that if you are going to feature two 'best of' open type faces, picking one of Slimbach's and one of the script faces would make sense.\n\n"
    },
    {
      "time": "23 Jan 2008 — 1:34pm",
      "content": "I cross-posted with Tiffany. Great minds ... :)\n\nPersonally I think Slimbach's revivals--Jenson, Garamond--are aesthetically the best of his stuff.\n\nAlso, am I the only one who thinks he must have cloned himself, or got the oompah loompas working out there in Adobe land? Do you want a semi-bold caption size swash eth? --It's unnatural.\n\n"
    },
    {
      "time": "23 Jan 2008 — 2:59pm",
      "content": "Ed Interlock was the one that had first come to mind. So it's nice to see that others consider it as well.\n\n"
    },
    {
      "time": "23 Jan 2008 — 3:11pm",
      "content": "William, I can attest to the fact that Robert has oompah loompahs helping him. ;^)\n\n"
    },
    {
      "time": "23 Jan 2008 — 11:20pm",
      "content": "Adobe were the pioneers of course -- they created fonts with all the OpenType features, concurrrently with developing the software applications which support those features, a \"symbiotic\" process testing one against the other.\n\nRobert Slimbach's Caflisch, for instance, which already had many alternates in Type 1, was a natural candidate for applying the contextual alternates, swash, and ligature features in a script font. This was some time before Cézanne Pro.\n\nAt least, that's my impression, but Adobe's Typophilers can probably give a fuller account--I'd be particularly interested in Eric's perspective.\n\nSubsequently, Zapfino Extra Pro and Bickham pushed script coding further, because AFAIK these were designed with OpenType in mind.\n\nHowever, before OpenType, Emigre's \"Ligmaker\" utilized substitution routines for implementing Mrs Eaves' eccentric ligatures.\n\nI don't think you can say that any one face makes the best use of OpenType, because by now the technology has been subsumed into the design process, so may be used integrally by different type designers for quite different purposes that are hard to compare.\n\n"
    },
    {
      "time": "23 Jan 2008 — 11:28pm",
      "content": "\\> Adobe were the pioneers of course\n\nMS (with the non-latin stuff)\n\n"
    },
    {
      "time": "24 Jan 2008 — 3:34am",
      "content": "It also depends if you think only of the obvious features (contextual alternates that make type look like writing, which even my grandma might recognize) or include the more subtle things like contextual positioning which help make the typographer's job a bit easier. The latter is not used in Latin script fonts much, and rather found in non-Latin fonts.\n\n"
    },
    {
      "time": "24 Jan 2008 — 8:49am",
      "content": "Palatino Linotype shipped with Windows 2000, and included many OpenType features, for setting Latin text. The font was also extensively hinted for on screen use.\n\n[http://blogs.msdn.com/fontblog/archive/2007/06/11/a-blast-from-type-past...](http://web.archive.org/web/20120512004134/http:/blogs.msdn.com/fontblog/archive/2007/06/11/a-blast-from-type-past.aspx \"http://blogs.msdn.com/fontblog/archive/2007/06/11/a-blast-from-type-past.aspx\")\n\n"
    },
    {
      "time": "24 Jan 2008 — 8:57am",
      "content": "Armin,\n\nAt Monotype we did a sort of redesign or update to Noori Nastaliq, which had been in Monotype's library for a long time, but was always maddeningly complicated to implement; the calligraphic Nastaliq style has a characteristic slope in each word (among other characteristics), making conventional typographic alignment impossible. As well, given the fluid style of the traditional calligraphy being mimicked, context changes everything, making numerous glyph variants essential. Previous technologies relied on huge numbers of ligatures and substitutions, making for really enormous font sets; we boiled it down to individual glyphs again, with contextual variants, and with the power of OpenType, engineered a way for text to be shaped dynamically, in a convincing Nastaliq style, while you type. It's a good example of the positioning Karsten (and maybe Si) is referring to. This font really takes advantage of OT technology throughout; in fact it depends on OT for basic functionality; without it, words wouldn't compose at all.\n\n"
    },
    {
      "time": "24 Jan 2008 — 9:15am",
      "content": "You might also include Tal Leming as a strong pusher of the opentype envelope with Christian Schwartz's faces.\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2008 — 10:46am",
      "content": "I think Nick was calling my name...\n\nI recall the first OpenType fonts that we tested in InDesign being Adobe Caslon Pro, Garamond Pro, Warnock Pro, Tekton Pro, etc. The first really fun font was Caflisch and we liked showing that one off! We also tested with Palatino Linotype pretty early.  \nGenerally, these early fonts were just slightly better than the Type 1 font would have been. You got a few more characters supported, you got a couple ligatures, old-style figures, fractions...  \nThe choice of a best/pioneering OpenType font would choose the font(s) that inspired all of the really amazing fonts being sold today (Ed Interlock, all of the script faces, etc.) Caflisch Script Pro might be that pioneer, but I'm not sure (since I'm not a font developer) what faces inspired Tal Leming's work, Alejandro Paul’s work, etc.\n\n"
    },
    {
      "time": "24 Jan 2008 — 10:52am",
      "content": "I've been told by an insider that Christian's Local Gothic pushes OT further than Ed Gothic did ... which simply blows my mind even more.\n\n"
    },
    {
      "time": "24 Jan 2008 — 10:56am",
      "content": "As there's no 'random' feature in OT, Local Gothic is technically impressive, but the wow factor of Ed Interlock is higher, IMHO.\n\n"
    },
    {
      "time": "24 Jan 2008 — 11:14am",
      "content": "\\>wow factor of Ed Interlock\n\nFor \"wow\" of open type, I've not seen anything like Ed Interlock. But to me the style itself is stale, and not so good looking. That's why I would rather see one of the scripts on a list of 'best'. I haven't really looked much at cursive fonts; quite a few of them are very impressive.\n\nI confess I don't 'get' Local Gothic either, though generally I am a big fan of Christian Schwartz's work. It seems like a joke, with added technical wizardry. I just can't figure out what you'd want to use it for.\n\nps I don't know if the new Arabic font system Tasmeem, which composes by stroke, uses open type, but the demo at TypeCon was flat out amazing--more than Ed Interlock.\n\n"
    },
    {
      "time": "24 Jan 2008 — 11:19am",
      "content": "I can't imagine not selecting Bickham Script Pro as one of the couple of typefaces. It was one of the first script typefaces to do \\*really\\* complicated ligature/alternate stuff in OpenType, and it is still one of the most complex, and with very few bugs in its implementation. Caflisch Script Pro is great, too, but nowhere near as cool (albeit more of a pioneer).\n\nI don't find glyph count very convincing by itself, even though it makes our (Adobe's) fonts look \"better.\" First, there are more or equally important things to sheer glyph count. Second, our practice of duplicating certain glyphs inflates the glyph count relative to other fonts. (Note that thanks to subroutines, it doesn't have much impact on file size.) But if you were to count that way, either Arno or Hypatia Sans would come out \"on top\":\n\nArno Pro Regular: 2845  \nHypatia Sans Regular: 3057  \nHypatia Sans Italic (coming soon): ~3092  \nArno Pro Italic: 3222\n\nNot that I'd pick Hypatia Sans as either a pioneer or best of, myself. I agree that one of Robert's text faces such as Arno makes a great representative for OpenType.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "24 Jan 2008 — 11:25am",
      "content": "Arial (v 5.0) Vista and Leopard version - 3381 glyphs\n\nOops, there goes the glyph count argument ;-)\n\n"
    },
    {
      "time": "24 Jan 2008 — 11:39am",
      "content": "Caflisch was certainly the face that I noticed first, suggesting the design potential of contextual alternates, which is particulalry pertinent to scripts.\n\nIt inspired me to produce Handsome Pro, released in early 2005, about the same time as Christian Robertson's Dear Sarah.\n\nThe idea is to use a system of alternates rather than precomposed ligatures, which I demonstrated in a TypeCon 2005 workshop, along with Adam and Thomas. There's still a lot of unexplored territory in this area, for instance, enough already with the fancy retro scripts, where are the fonts that look like real contemporary handwriting? A second generation is no doubt in the works.\n\nAlso, I'm still waiting for the release of a roman face which uses contextual alternates to simulate the vagaries of letterpress -- or did I miss that?\n\n"
    },
    {
      "time": "24 Jan 2008 — 12:14pm",
      "content": "\\> I’m still waiting for the release of a roman face which uses contextual alternates to simulate the vagaries of letterpress\n\nIt's not exactly letterpress emulation, but [FF Beowolf OT](http://web.archive.org/web/20120512004134/http:/www.fontshop.com/features/newsletters/oct2007_b/) has as many as 9 slightly different contextual alternates of each character to simulate the randomness of the original FF Beowolf and FF BeoSans.\n\n ![](http://web.archive.org/web/20120512004134im_/http:/typophile.com/files/FirefoxScreenSnapz001_6335.jpg)\n\n"
    },
    {
      "time": "24 Jan 2008 — 12:47pm",
      "content": "This following quote is from an interview I did with Tal Leming last Summer:\n\n\"One great thing about OpenType fonts is that they can be programmed with sophisticated pattern matching routines that can be used as “rules” that govern when glyph substitutions should occur. … When a series of these rules are used in combination, a glyph can flip from its alternate state and back any number of times before the algorithm is finished processing. This makes it very difficult to predict which glyph state will be output, thus effectively creating the illusion that the glyphs are being randomly selected.  \nAfter sitting on this idea for a while, I finally got a chance to use it in the OpenType version of Christian Schwartz’s typeface Local Gothic. The idea behind that typeface is that there is a set number of alternate forms for each character, and these alternates should be used in an arbitrary way. The randomization algorithm takes in the string of characters that the user has entered, pushes it through the various test filters and uses some cipher-like routines to create a sequence of glyphs that appear to be chosen in an unpredictable way.\"\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2008 — 12:56pm",
      "content": " ![](http://web.archive.org/web/20120512004134im_/http:/typophile.com/files/feelit_5949.jpg)\n\n\\> Stephen said \"Of course, Alejandro Paul’s scripts came later, breaking records as far as number of glyphs\".\n\nNo way. Bickham was there. I added the 3 or 4 glyphs ligatures with Ministry...lol, does it counts?\n\n\\> Shinn says \"I don’t think you can say that any one face makes the best use of OpenType, because by now the technology has been subsumed into the design process...\"\n\nIi think that is the key. The type as part of graphic design. Is not a change of format, it's a new thinking. I m designing fonts as a graphic designer not as a type designer. I design some fonts only possible at OT. Without OT there are no font.\n\n\\> emenninga said \"...but I’m not sure (since I’m not a font developer) what faces inspired Tal Leming’s work, Alejandro Paul’s work, etc\".\n\nAt least to me, the lettering people from the 30's working in New York before photolettering. I like the idea to mix the times and methods. I enjoy the words not the glyphs and I love to experiment that with OT technology.\n\n"
    },
    {
      "time": "26 Jan 2008 — 12:51am",
      "content": "To what extent do you think looking at Bickham Script Pro would be relevant to roman text face design? Why?\n\n"
    },
    {
      "time": "26 Jan 2008 — 2:07pm",
      "content": "Thomas Phinney -- <cite>Caflisch Script Pro is great, too, but nowhere near as cool (albeit more of a pioneer).</cite>\n\nSpeaking of best-of, Bickham Pro may be the choice. (And as regards technical solutions one can always learn from Adobe.)  \nSpeaking of pioneers, I consider Caflisch Script as more important. Not so much because it was first in terms of publication date, but because it was the first\\* typeface where contextual alternates and ligatures are really essential -- it would not be the same _design_ without them. (Apple Zapfino and even Bickham Pro may do without contextual alternates and still be Apple Zapfino and Bickham Pro.)\n\n\\* The first? One of the first? I don't know exact dates.\n\n"
    },
    {
      "time": "26 Jan 2008 — 5:19pm",
      "content": "Caflisch Script Pro was indeed the first \\*OpenType\\* typeface to make significant use of contextual alternates, contextual ligatures, and big multi-letter ligatures (like \"offi\"). It was bundled with InDesign 2.0, which was the first significant application to support such features. Bickham Script Pro shipped a year and a half later, with InDesign CS(1).\n\n(Of course, the GX version of Zapfino may pre-date even Caflisch Script Pro, but the question was about OpenType pioneers.)\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "26 Jan 2008 — 7:18pm",
      "content": "Both Thomas (Hypatia) and Karsten (Tiptoe) have done interesting, dare one say pioneering, work with Stylistic Sets, pushing the notion of what constitutes a typeface (as if OpenType itself didn't call that into question).\n\nStylistic Sets is the youngest OpenType feature, a proliferation of the initial Stylistic Alternate feature, and it appears to be turning into the conceptual key that a type designer can use to manage the multiple potentialities of an emerging type design.\n\nI'm developing Stylistic Sets in the Modern Suite to manage varying degrees of historicism in the Greek characters as defined by Unicode. Thomas has done a similar thing enabling the Hypatia user to pick a point on the axis between old style and modern, by applying overlays of Stylistic Sets.\n\nTiptoe offers its users the Stylistic Set of \"Typographic Spacing\", which increases space between word and punctuation, word and guillemet, word and index numeral, currency symbol and numeral. That's like alternate kerning.\n\nIn some ways, Stylistic Sets are like the axes of the Multiple Master format, but the infinitely variable nature of that technology always bothered me. With the alternates in Stylistic Sets, each glyph is carefully considered by its designer, and the typography consequently more purposeful.\n\nTipToe also has fractions that align differently in oldstyle and lining context. It seems to me that this kind of nuancing, of the way that a large font can be organized by its designer into different groups of characters, and alternates made which optimize the relationships between members of different groups, is a great and subtle potential of OpenType.\n\nThe Case feature is a prime example of this: initially it was implemented to allow different punctuation for all-caps (e.g. raised parentheses). But now a designer can add typeface-specific content to this feature. For instance, a font with default \"three-quarter\" lining figures, for use in U&lc and general setting, may be equipped with a cap-height set of lining figures weighted to the capitals. And these figures are deployed seamlessly when \"All Caps\" is selected by the typographer.\n\n"
    },
    {
      "time": "29 Jan 2008 — 4:34am",
      "content": "\\> Tiptoe offers its users the Stylistic Set of “Typographic Spacing”, which increases space between word and punctuation, word and guillemet, word and index numeral, currency symbol and numeral. That’s like alternate kerning.\n\nAnyway, still, I could see some problems. OpenType everywhere but the users still dont know too much about it and amazing graphic designers never listened about what OT means....\n\nWhat do you think is the best way to teach a graphic designer that he has a powerful tool included in his app? I doubt that the pdfs any designer could do to include with the font are enough... ok... maybe should be another topic...\n\n"
    },
    {
      "time": "29 Jan 2008 — 5:28am",
      "content": "Very true!  \nThere are OT features. And then there is the real world: \"I cannot find the small caps font in the font menu!\" Layout applications, including InDesign, don't make it easy for designers to even _find_ OpenType features, and it is not much helpful if Small Caps are in one menu while All Small Caps are in another one ...  \nHow to teach designers is a good question. Currently I like Adobe's short how-to videos. I fear that designers who by definition should be creative and ahead of their time, are pretty conservative when it comes to the tools they use.\n\nSo my attempt is to make things work as automatic as possible. The differently aligning fractions are part of the Oldstyle/Lining numeral features. And I still hope that the punctuation spacing functionality which Nick mentions one day will be an option in layout applications -- it is part of the typographer's and not of the type designer's domain, and should allow the typographer some adjustments. (With this in mind it is located in a Stylistic Set feature and thus is optional.)\n\n"
    },
    {
      "time": "29 Jan 2008 — 8:27am",
      "content": "Looking at the font in question; I see that my question about Bickham Script was pretty silly. Sorry about that.\n\nAle, Karsten. Well put.\n\n"
    },
    {
      "time": "29 Jan 2008 — 9:43am",
      "content": "_What do you think is the best way to teach a graphic designer that he has a powerful tool included in his app?_\n\nClone [Ilene.](http://web.archive.org/web/20120512004134/http:/www.thetypestudio.com/workshops.html)\n\n"
    },
    {
      "time": "29 Jan 2008 — 10:48am",
      "content": "Opentype firsts from P22:  \n(I believe these to be firsts)  \n [Mystic Pro](http://web.archive.org/web/20120512004134/http:/www.p22.com/ihof/mystic.html) - First font with fortune telling capability  \n [Operina Pro](http://web.archive.org/web/20120512004134/http:/www.p22.com/ihof/operinaset.html) - First auto roman numeral feature  \n [Music font](http://web.archive.org/web/20120512004134/http:/p22.com/musicfont/) - First text to music notation chord assembler (not yet released)  \n [Vale Pro](http://web.archive.org/web/20120512004134/http:/www.p22.com/ihof/vale.html) - First Olde Englishe feature  \n [Declaration Pro](http://web.archive.org/web/20120512004134/http:/www.p22.com/products/declarationpro.html) - First \"Signers of Declaration of Independence names to actual signatures\" feature\n\n...and David Lemon questioned the usefulness of some of these features!\n\n"
    }
  ]
}
