{
  "id": "41254",
  "title": "Designer/Animator Portfolio",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi! I've been a reader for some time and have learned a lot from this forum, so first things first: thanks!\n\nI recently finished a complete overhaul of my portfolio site (I'm a graphic designer and animator), and I wanted to get some opinions.\n\n[http://www.brendanmarnell.com](http://web.archive.org/web/20131018104708/http:/www.brendanmarnell.com/)\n\nOne of the main questions I've been wrestling with is about the overall style. I've gotten some flak in the past because my site looks more \"childish\" or \"fun\" than \"professional,\" and I risk pigeon-holing myself as a one-trick designer. The flipside is that (imo) the site is unique, quirky, and shows some personality. Have any of you thought about this decision before? Which side did you come down on?\n\nBrendan\n\n",
  "author": "brendanm",
  "time": "24 Jan 2008 — 4:35am",
  "uid": "16048",
  "comments": [
    {
      "time": "24 Jan 2008 — 7:39am",
      "content": "Hi Brendan, I took a quick look at your site. First off, what type of work do you enjoy doing, and are there particular fields that you enjoy working with more than others? If you are going for corporate work, then your site will probably not appeal to that group. If you are seeking work in the kids/youth market, then the design makes sense. Many design firms have a very neutral look for their identity. It lets the work speak for itself. Personally I like that approach best because I don't want to pigeonhole myself in a particular market. Hope that helps a bit.\n\n"
    },
    {
      "time": "24 Jan 2008 — 9:06am",
      "content": "Hi Chris, thanks for the response. It sounds like you think I am indeed pigeon-holing myself. I do enjoy doing work in the kids market - I worked at an animation studio doing children's programming for about a year and a half. But that's not the only type of work I enjoy doing. Maybe next time I do a redesign I will opt for something more neutral. Time will tell if having a site like this scares away a certain type of client.\n\nI don't know a lot of designers with 3D/animation skills, and I don't know a lot of 3D/animation people with design skills. I guess my goal was to create a site that showed I have that range.\n\n"
    },
    {
      "time": "25 Jan 2008 — 6:31am",
      "content": "99% of sites built with Flash are annoyingly bad.\n\nYours falls into that other 1% ;o)\n\nNicely done!\n\n\"my site looks more “childish” or “fun” than “professional,” \"\n\nWho did you get that flack from? Boring suit-wearing middle managers at banks? Unless you REALLY want those folks as clients, I wouldn't worry about it. I've worked at both staid 'professional' looking firms and quirky 'this guy is winging it' type places. Both attracted plenty of 'professional' boring clients, but the quirky one also had a nice mix of oddball jobs.\n\nOnly nitpick is that once inside a portfolio, it'd be nice to have navigation for 'next' instead of having to click back each time to get to the next piece. I'd also add a bit of line spacing to your text blocks that describe each piece.\n\n"
    },
    {
      "time": "25 Jan 2008 — 10:25am",
      "content": "Hey, thanks! glad you like it :)\n\n\"Who did you get that flack from? Boring suit-wearing middle managers at banks?\"\n\nHa, to protect certain parties let's not go into that.\n\nI think the next/previous buttons are a good idea. And I see what you mean about the text blocks - I can be stingy with the leading sometimes.\n\n"
    },
    {
      "time": "25 Jan 2008 — 10:37am",
      "content": "I love your site. I love the look, the work and it is very easy to navigate. My cat, Lucy, was fascinated with the bird in the cage in the first animation.\n\nI thought it was very creative.\n\nSharon\n\n"
    },
    {
      "time": "26 Jan 2008 — 9:03am",
      "content": "Cool, thanks Sharon! I'm allergic to cats, so I'm glad I can entertain them from a safe distance ;)\n\n"
    },
    {
      "time": "26 Jan 2008 — 11:49am",
      "content": "Brendan. #1, you went to school in Philadelphia... automatic points!\n\nDefining your personal style should be paramount. I think you've done a great job. Good luck!\n\n"
    },
    {
      "time": "28 Jan 2008 — 9:46am",
      "content": "Your style may not work for bankers or lawyers, but do you really want to work for them? Nothing wrong in that site for education, my market.\n\nGood work.\n\n"
    },
    {
      "time": "29 Jan 2008 — 5:25pm",
      "content": "Thanks guys, glad you're liking it.\n\nKeena: yeah, philly! i love and miss that city.\n\n"
    }
  ]
}
