{
  "id": "41277",
  "title": "Helvetica on Digg",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.digg.com/design/Helvetica\\_Awesome\\_Full\\_Length\\_Film\\_About\\_Typo...](http://web.archive.org/web/20081208191438/http:/www.digg.com/design/Helvetica_Awesome_Full_Length_Film_About_Typography \"http://www.digg.com/design/Helvetica\\_Awesome\\_Full\\_Length\\_Film\\_About\\_Typography\")\n\nOr more precisely Google Video... this can’t be right, can it? Swiss Dots?!\n\n [‹ Why Bembo Sucks](http://web.archive.org/web/20081208191438/http:/typophile.com/node/41301 \"Go to previous forum topic\") [The line between Modern and Scotch ›](http://web.archive.org/web/20081208191438/http:/typophile.com/node/41488 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081208191438/http://typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 24.Jan.2008 2.06pm",
      "content": "Stealing Sheeps?  \nOr did author decided to publish it?\n\n—  \nregards,  \nTom\n\n"
    },
    {
      "time": " 24.Jan.2008 2.12pm",
      "content": ".\n\n"
    },
    {
      "time": " 24.Jan.2008 2.16pm",
      "content": "Gary (or someone claiming to be him) has posted that this is an unauthorized upload...\n\n ![](http://web.archive.org/web/20081208191438im_/http:/typophile.com/files/Capture2_4981.JPG)\n\n ![](http://web.archive.org/web/20081208191438im_/http:/typophile.com/files/Capture_3611.JPG)\n\n"
    },
    {
      "time": " 24.Jan.2008 2.35pm",
      "content": "Can’t imagine someone would want to watch a movie with such bad quality.\n\n"
    },
    {
      "time": " 24.Jan.2008 2.44pm",
      "content": "I didn’t think it was a legal post, and I’m surprised that Google didn’t catch it.\n\n"
    },
    {
      "time": " 24.Jan.2008 3.11pm",
      "content": "Google’s legal department responds only after you’ve jumped through all of their red tape.\n\n"
    },
    {
      "time": " 24.Jan.2008 6.32pm",
      "content": "_\\> jumped through all of their red tape._\n\n:-)\n\n...or cut through all their hoops.\n\n"
    },
    {
      "time": " 24.Jan.2008 7.01pm",
      "content": "Illegal versions of movies on the internet?! Since when?!\n\n"
    },
    {
      "time": " 24.Jan.2008 7.42pm",
      "content": "“\\> jumped through all of their red tape.\n\n:-)\n\n...or cut through all their hoops.”\n\n:D\n\n"
    },
    {
      "time": " 25.Jan.2008 10.41am",
      "content": "\\>Illegal versions of movies on the internet?! Since when?!\n\nTrue, but why would reasonable people think that the upload was legitimate? eg.\n\n[http://desktoppub.about.com/b/2008/01/25/helvetica-the-film.htm](http://web.archive.org/web/20081208191438/http:/desktoppub.about.com/b/2008/01/25/helvetica-the-film.htm \"http://desktoppub.about.com/b/2008/01/25/helvetica-the-film.htm\")\n\nIs it because “font people” are mostly unaware of Google’s approach to IP?\n\n"
    },
    {
      "time": " 25.Jan.2008 10.44am",
      "content": "I think it is more along the lines of the fact that most people, including designers, think everything is free now.\n\n"
    },
    {
      "time": " 25.Jan.2008 11.01am",
      "content": "<cite>Illegal versions of movies on the internet?! Since when?!</cite>\n\nIt’s not as if this was a Google search result linking to a website hosting an illegal copy. It’s Google’s own proprietary video hosting service... That’s what made me scratch my head and go “Wha...?”\n\nBut what’s even worse is that it’s not lost in the obscure mess that Google Video is, it was then brought to the attention of the mass that makes up Digg... which could be thousands... in-turn this could spell financial disaster for Gary and his Swiss Dots crew.\n\n"
    },
    {
      "time": " 25.Jan.2008 11.37am",
      "content": "“why would reasonable people think that the upload was legitimate?”\n\nI’d argue it’s because google/youtube is normally pretty quick in taking down media once they receive notice from the copyright owners that it shouldn’t be there.\n\n“in-turn this could spell financial disaster for Gary and his Swiss Dots crew.”\n\nNo. The ’digg masses’ weren’t likely in line to snatch up the DVD from the mall, either.\n\n"
    },
    {
      "time": " 25.Jan.2008 11.45am",
      "content": "<cite>Can’t imagine someone would want to watch a movie with such bad quality.</cite>\n\nIt wouldn’t be a documentary about Helvetica unless heavily bastardized, pirate versions of it began popping up everywhere. : )\n\n"
    },
    {
      "time": " 25.Jan.2008 1.17pm",
      "content": "\\>No. The ’digg masses’ weren’t likely in line to snatch up the DVD from the mall, either.\n\nI don’t want to overplay the damage and financial hardship three days on Google would have unleashed on Gary, Swissdots, Veer (and its owner Mr Gates) but I wouldn’t be surprised if people took this off their Netflix list after watching it online. In the end it really comes down to the hassle of policing ones IP when you could be spending that time creating.\n\n"
    },
    {
      "time": " 25.Jan.2008 1.31pm",
      "content": "“I wouldn’t be surprised if people took this off their Netflix list after watching it online.”\n\nIt’s been part of NetFlix’s ’watch online’ option for a while now.\n\nYou would think Google would have thought to check into this, though. This is a full hour and a half documentary...you’d think this would have raised a flag somewhere at Google HQ.\n\n"
    },
    {
      "time": " 25.Jan.2008 1.49pm",
      "content": "Google doesn’t do its own policing. Just as Google Video has this one slipping through others are using Google’s gmail and groups to share fonts. No policing there either. They depend upon those whose IP that has been violated to work their way through the questions and contact them.\n\n"
    },
    {
      "time": " 25.Jan.2008 2.14pm",
      "content": "“No policing there either.”\n\nI would certainly hope not. I have no interest in Google reading my emails. ;o)\n\n"
    },
    {
      "time": " 25.Jan.2008 2.19pm",
      "content": "_Google doesn’t do its own policing._\n\nIt’s similar to Craigslist not doing its own policing... (Although they don’t have to worry about people uploading pirated content.) But even Craigslist has had to change its policies lately, and now has warnings about posting illegal or inappropriate requests, comments, etc.\n\n"
    },
    {
      "time": " 25.Jan.2008 2.37pm",
      "content": "The video is down. [Gary has posted a response.](http://web.archive.org/web/20081208191438/http:/www.helveticafilm.com/blog/2008/01/25/on-google-video-and-the-new-paradigm/)\n\n"
    },
    {
      "time": " 25.Jan.2008 10.24pm",
      "content": "_I think it is more along the lines of the fact that most people, including designers, think everything is free now._\n\nThat’s because it is.\n\nSomeone should tell Gary about these as well:\n\n[Links removed by Moderator. Please do not post links to such sites. Typophile does not condone the sharing of others’ intellectual property. Should you find links that you think need to be reported contact a moderator or the foundry/person to whom they belong.]\n\n"
    },
    {
      "time": " 26.Jan.2008 12.29am",
      "content": "Torrents can certainly be another form of unauthorized distribution, but at least they are less accessible than a Google or YouTube video which is immediately viewable to the general public.\n\n"
    },
    {
      "time": " 26.Jan.2008 6.55am",
      "content": "Well that’s true, but a 3 hours download time didn’t seem to bother the 8000 people who downloaded the mininova torrent.\n\n"
    },
    {
      "time": " 26.Jan.2008 7.00am",
      "content": "Geez... 8,000!\n\n"
    },
    {
      "time": " 26.Jan.2008 7.29am",
      "content": "Come on! 8,000 torrent downloads, and not \\*any\\* lost revenue? I don’t believe that for a second.\n\nToo bad :(  \nI don’t think that there is any way on the planet to get a removed from the Pirate Bay site, though… you won’t find a Swedish court that’ll go after them, me thinks.\n\n"
    },
    {
      "time": " 26.Jan.2008 7.45am",
      "content": "Actually Pirate Bay owns mininova.\n\nAnyway to get it taken off mininova Gary himself has to email them with the information listed here:\n\n[http://www.mininova.org/faq#copyright](http://web.archive.org/web/20081208191438/http:/www.mininova.org/faq#copyright \"http://www.mininova.org/faq#copyright\")\n\nIf he asks Pirate Bay nicely with no legal threats they MIGHT take it down. Just keep it about the film and the lost profits from being an independent film maker. Nothing about the horrors of piracy or whatever.\n\nOn Monday I’ll check the members only torrent sites to see if I can find any others.\n\n"
    },
    {
      "time": " 26.Jan.2008 8.14am",
      "content": "_Torrents can certainly be another form of unauthorized distribution, but at least they are less accessible than a Google or YouTube video which is immediately viewable to the general public._\n\nunless someone links to them from a general website\n\n"
    },
    {
      "time": " 26.Jan.2008 9.04am",
      "content": "Trying to get torrents taken down, only to have someone upload it again the next day, is sort of a waste of effort at this point. I’d like to make more films, not spend my days writing cease-and-desist emails.\n\nThe Google video issue was different since it was instant access to the full film for anyone who wanted to click, no special software or overnight download needed. And since it was on Google, I think most of the design-blog-reading public assumed it was legitimate. The idea of letting the public watch a small-window, low-res version of the entire film to increase awareness is something we’ve talked about (not just for Helvetica, but with all the films Plexifilm releases). And it’s something we might still do. Watching Helvetica rocket to the #1 watched video on Google was sort of flattering, I guess.\n\nThe question is still this: does free access to a low-res version of a full film, and the increased web attention that can bring, actually help sell more DVDs and merchandise?\n\nCheers,\n\n-Gary\n\n"
    },
    {
      "time": " 26.Jan.2008 10.40am",
      "content": "Gary I think the comment you posted on your site was very provocative. I suppose I find it to be that way mostly because I’m not in your position (or the position of other foundries). I don’t have anything to share. Personally, and from some of my research into pirating, I really do not think you will generate a significant amount of sales by sharing it. I’ve watched television shows on the station sites because I’ve missed them on TV. I watched them because I like the shows and didn’t want to miss them. But, would I buy them if that wasn’t available? No. Maybe this isn’t a good analogy. But I really question offering a full-length version (lo-res or not) to get others to buy it.\n\nEveryone else. I know we all mean well, but I get sick even seeing those shareware sites name mentioned here. You mention the name and you might just be educating someone who didn’t know about it. Yeah I realize people can find out about it anyway, but why do they have to learn about it here? Let’s keep Typophile clean of stuff like this. If you have links which you’d like to report you can email one of the moderators. I personally have contact with many foundries and would gladly send along the information to them. Thanks.\n\n"
    },
    {
      "time": " 26.Jan.2008 11.02am",
      "content": "I liked what you said on the film’s website, Gary — namely,\n\n_“My biggest issue is that it should be the artist’s decision whether to release their work for free. I don’t think it’s fair that someone else can decide to give my work away, and profit from it.”_\n\nIf I didn’t already own the DVD, I would get one even if it were available online 24 hours a day. I’m the kind of person who would rather have a record (vinyl or CD) than a low- or medium- quality MP3. And for me, having the CD or DVD includes the packaging, the cover, the booklet. (Yes, I have songs on my computer. I admit that it’s convenient. But I still like having “the real thing.”) Before music was available in a digital format, I would often tape my friends’ records, and even then I would end up buying certain records — the ones I liked a lot — anyway. Tapes tend to break after a while, and the sound quality is never as good as the original record. But I realize that not everybody acts or feels this way.\n\nGetting back to design-related documentaries, the other day I noticed that Hillman Curtis’s films of graphic designers are [available on DVD](http://web.archive.org/web/20081208191438/http:/www.amazon.com/Hillman-Curtis-Designer-Series/dp/B000K15WL6/ref=sr_1_1?ie=UTF8&s=dvd&qid=1201373198&sr=1-1). Apparently, the DVD was released in October of 2006, but until now all I knew was that they have been online, mostly on [Hillman Curtis’s website](http://web.archive.org/). So am I going to buy the DVD? Damn straight. I can’t compare these shorter films to a feature-length film like _Helvetica_, but I wonder if having his films online has hurt sales of the DVD. Or if the DVD has material that is not available online. Ultimately, though, it is Curtis who has posted the films on his own website, so in this case the artist is making that decision.\n\n"
    },
    {
      "time": " 26.Jan.2008 4.22pm",
      "content": "\\> _If he asks Pirate Bay nicely with no legal threats they MIGHT take it down._\n\nEven without legal threats, I doubt they will take it down. They always [respond](http://web.archive.org/web/20081208191438/http:/www.google.nl/search?hl=nl&q=pirate+bay+response+letter&btnG=Google+zoeken&meta=) with silly (yet sometimes funny) letters. If they respond at all. ;)\n\n"
    },
    {
      "time": " 28.Jan.2008 6.57am",
      "content": "“The question is still this: does free access to a low-res version of a full film, and the increased web attention that can bring, actually help sell more DVDs and merchandise?”\n\nLet us know if you can figure it out. Not sure if it was up long enough to really map it against your online sales, but it certainly would be an interesting statistic.\n\n"
    },
    {
      "time": " 28.Jan.2008 6.59am",
      "content": "And, re: Miss Tiffany’s response, I’ll say the following solely in the name of lively debate and certainly not in any way to be mean or snide:\n\n[http://library.duke.edu/lilly/film-video/newvideos.html](http://web.archive.org/web/20081208191438/http:/library.duke.edu/lilly/film-video/newvideos.html \"http://library.duke.edu/lilly/film-video/newvideos.html\")\n\n(25th entry)\n\n(I just find the whole library issue an interesting part of the overall debate)\n\n"
    },
    {
      "time": " 28.Jan.2008 8.33am",
      "content": "Gary\n\nIt might be worth your time to build a 15 minute or so highlight package and post that, in hopes that a proportion of the viewers of that will buy the full DVD. Like you, I’m surprised that the video shot so high ... lots of closet typographers out there, I guess.\n\n"
    },
    {
      "time": " 28.Jan.2008 8.59am",
      "content": "Not sure where your going with that Darrel, but the library is a perfectly legitimate place to borrow (check out) a movie. No?\n\n"
    },
    {
      "time": " 28.Jan.2008 10.14am",
      "content": "I wasn’t going anywhere specific. Just adding to the discussion, really. One watching the movie from the library can be considered a ’lost sale’ as much as someone grabbing it off of bittorrent. Granted, one is more socially acceptable than the other.\n\nThe issue is usually one of ’bits’ being saved elsewhere. That might be a huge issue, or maybe it’s not. I don’t know.\n\n"
    },
    {
      "time": " 28.Jan.2008 11.13am",
      "content": "Darrel (aluminum), that’s an interesting point you bring up. DVD rental stores are in a similar (though not free) situation to public libraries.\n\nAside from the legal/socially accepted difference, there is another, perhaps more important difference: with libraries or DVD rentals, you have one or maybe a few copies of the movie on loan to individuals at any given time (when not on the shelf). But with a bit torrent, you have the possibility of many, many individuals accessing the film at the same time — and all over the world, not just in one neighborhood or city.\n\nAnd don’t forget that libraries and rental stores have to purchase a copy of the film before they can loan or rent it.\n\n"
    },
    {
      "time": " 28.Jan.2008 12.08pm",
      "content": "Ricardo:\n\nYep, those are pretty much the differences. Are those major differences? I don’t know.\n\nAnother interesting angle to consider are used media stores such as used CD, Book, DVD, and Video Game stores.\n\nThey’re actually making a profit selling media that the original artist does not get a share of.\n\nAgain, not trying to make any specific point other than that there are some interesting tangents to this type of thinking.\n\n"
    },
    {
      "time": " 28.Jan.2008 12.39pm",
      "content": "Ricardo has a point with respect to the rate at which the media can be consumed. I hardly ever buy media, instead using my local library’s usually adequate hold/request network to borrow things that I’d like to watch/read/listen to. A lot of other people do this, though, so the waits for certain items can be quite long.\n\nYes libraries are usually free, and used media outlets are usually cheaper, but they are rarely more convenient than the illegal methods. And besides cost, convenience is probably the most important factor in all of this.\n\nMedia can never be cheaper than free, so perhaps the only way to curb piracy is to make it markedly less convenient than simply paying for it. It can be argued that iTunes, Netflix, et al., have tried to do this.\n\n"
    },
    {
      "time": " 28.Jan.2008 12.56pm",
      "content": "Hmm...reading that over I sound kind of defensive/apologist. I think a better way to say all that is that piracy is not only a product of greed or a false sense of entitlement but of laziness.\n\n"
    },
    {
      "time": " 28.Jan.2008 6.12pm",
      "content": "_Yep, those are pretty much the differences. Are those major differences? I don’t know._\n\nThere’s also a difference in price: the “institutional/educational” DVD of Helvetica is [$350](http://web.archive.org/). (I know because I ordered it for my university.)\n\nFrom the website: “Institutional DVD copies come with a limited public performance license that allows classroom and library use, and on-campus screenings that are free for students of that school and not advertised to the general public.”\n\n"
    },
    {
      "time": " 28.Jan.2008 7.15pm",
      "content": "_There’s also a difference in price: the “institutional/educational” DVD of Helvetica is $350. (I know because I ordered it for my university.)_\n\nThanks for pointing that out, Eliason. I thought of that only after I’d finished my post. I remember that back in the days of VHS, replacing a customer-destroyed VHS tape from a rental store cost a lot more than usual.\n\nBut I think that makes sense... A lot more people are going to get mileage out of that one DVD, or VHS, or book. It’s not all that different from paying more to a foundry or software maker if you are using their product on several machines as opposed to just one computer.\n\n_Yes libraries are usually free, and used media outlets are usually cheaper, but they are rarely more convenient than the illegal methods._\n\nWhat about quality? How good can an illegal, online version of a movie be? Or a DVD sold on the street while the movie is in theaters, for that matter? Is it going to be high-res? Will the picture be as crisp as on a DVD? Will the bonus material be there?\n\n_Another interesting angle to consider are used media stores such as used CD, Book, DVD, and Video Game stores._\n\nThey’re actually making a profit selling media that the original artist does not get a share of.\n\nThose stores are selling used media, and therefore the price is cheaper (if the item is not rare or out-of-print, that is) than for a new copy. Besides, when someone buys a (new) book or DVD, it’s theirs, and if they want or need to sell it to someone else who will give them some money in exchange, well, they are entitled to do that. The original author of the product already made money from it. Why should s/he get a profit from it again?\n\nOn the other hand, buying a book or DVD does not give the purchaser the right to make copies of it and sell the copies for personal profit. And the fact that a book is available, whether in a store or library, does not give anyone the right to copy passages from it and publish them as their own.\n\nIntellectual property theft is not new... What’s new are the means by which it is being done nowadays...\n\n"
    },
    {
      "time": " 29.Jan.2008 6.39am",
      "content": "“Besides, when someone buys a (new) book or DVD, it’s theirs, and if they want or need to sell it to someone else who will give them some money in exchange, well, they are entitled to do that.”\n\nExactly. So, if I buy a digital file, and I want to share it with someone, can I? Should I? I can share a book. Why not an MP3? I’m not making money of the transaction. (Again, just playing devil’s advocate here... ;o)\n\nI admit, the crux of the debate is the issue of ’copy’. And this \\*is\\* about copyRIGHTS, so I completely side with the technical point that it’s wrong to copy something without getting the permission from the copyright holder. I just find the counter-reactions a bit extreme and not really warranted much of the time.\n\n"
    },
    {
      "time": " 29.Jan.2008 11.14am",
      "content": "_Exactly. So, if I buy a digital file, and I want to share it with someone, can I? Should I?_\n\nWell, as I pointed out later in the post you’re quoting, you can “share” a book you buy, yes, but there are limits to that sharing. All you have to do is turn to the copyright notice of almost any book to find something along these lines: **“No part of this book may be used or reproduced in any manner without written permission from the publisher, except in the context of reviews.”**\n\nThat notice hasn’t stopped pirated editions of books from being published in the past (before personal computers). But MOST people abide by the law... With digital media, suddenly it’s very easy to make a copy of something... so easy that a lot of people don’t consider it stealing.\n\nBut the law is still there. It’s a convention that everyone agrees on. That’s what laws are. **Rules we all agree on to be able to live in society and get along.** You don’t HAVE to stop at the red traffic light... It’s just a man-made rule... right? (Of course, if you get run over by another car while crossing that red light, don’t blame anyone else.) Just because you CAN do something, you don’t just go and do it.\n\n"
    },
    {
      "time": " 29.Jan.2008 11.18am",
      "content": "_I can share a book. Why not an MP3? I’m not making money of the transaction. (Again, just playing devil’s advocate here... ;o)_\n\nThere is something else. When you loan a physical book or record, it will be coming back to you (well, not always... But that’s another story!). When you share an MP3, you’re making a copy of it. Making a casette tape is a better analogy here.\n\n"
    },
    {
      "time": " 29.Jan.2008 11.51am",
      "content": "<cite> Making a cassette tape is a better analogy here. <cite></cite></cite>\n\nFirst off analog-y haha...\n\nSecond, the idea of creating a mixed tape or even a mixed CD was rarely seen as criminal... _I’m not sure if anyone was actually processed criminally for making a mix, but I could be wrong._\n\nIt’s this gray area that has made the prospect of pirating more plausible, though on a much larger scale. And it’s less a concept of pirating, more a concept of mass sharing. The idea of sharing a dubbed tape/CD with a friend times x 1000 at no charge. It kinda gets around the copyright issue of creating a copy and distributing it for profit. Like renting a movie and watching it with a very large family.\n\n"
    },
    {
      "time": " 29.Jan.2008 11.56am",
      "content": "Ricardo:\n\nI’m certainly not trying to debate laws. That can be an interesting debate, but really wasn’t where I was trying to go.\n\n“First off analog-y haha...”\n\n;o)\n\n“And it’s less a concept of pirating, more a concept of mass sharing.”\n\nAgreed. I think part of the issue is the oversimplification of the argument. You’re either a good sin-free consumer who buys a copy of something every time brand new, or you’re an evil pirate.\n\nI think there’s probably a lot of middle ground there that really hasn’t been explored fully by either side.\n\n"
    },
    {
      "time": " 29.Jan.2008 12.11pm",
      "content": "Watching a movie or listening to music is a passive act of sensory intake. Sharing it is so others can enjoy seeing or hearing it is still copyright infringement if a copy is made. Fonts and software are tools. Sure some people just like to look at them, but they are interactive tools and components of other creative work. If music was shared and then inserted into a TV commercial that takes the infringement to the level of unlicensed font usage. Fonts are made to be actually be used (except perhaps a few conceptual P22 fonts and some Fuse fonts) because of this, I feel the sharing or less euphemistic term of stealing is more offensive for fonts than music. Not to downplay it or be a hypocrite, I annoy friends when i turn down their offers to burn me some music CDs.\n\nI think Ehague hit the nail on the head _piracy is not only a product of greed or a false sense of entitlement but of laziness._\n\n"
    },
    {
      "time": " 29.Jan.2008 1.49pm",
      "content": "Richard, that’s an important difference.\n\n_I’m certainly not trying to debate laws. That can be an interesting debate, but really wasn’t where I was trying to go._\n\nOh, I wasn’t debating with you... I was just offering hypothetical counter-arguments... More than one person can play devil’s advocate. :-) I’m just trying to think through all of the issues, that’s all. I’m not the one whose film or software products are being illegally reproduced.\n\n_Second, the idea of creating a mixed tape or even a mixed CD was rarely seen as criminal_\n\nIn the late 70s, record companies started making a VERY big deal about kids making tapes of records... They never explicitly mentioned mix tapes, but I’m sure they saw that as a no-no as well. (What they never thought of was lowering the price of records. Then, a few years later, they forced everyone to switch to CDs, and now it’s coming back to bite them in the \\*\\*\\*... My two cents.)\n\n"
    },
    {
      "time": " 29.Jan.2008 2.05pm",
      "content": "I’d like to notice, that posting purchased DVD to Europe + money transfer tip is more expensive than the DVD itself.\n\n—  \nregards,  \nTom\n\n"
    },
    {
      "time": " 29.Jan.2008 2.24pm",
      "content": "_In the late 70s, record companies started making a VERY big deal about kids making tapes of records._\n\nIn fact, they eventually got legislation passed to give music labels a portion of every blank tape sale, according to [this site](http://web.archive.org/web/20081208191438/http:/www.pbs.org/wgbh/pages/frontline/shows/music/inside/cron.html).\n\n"
    },
    {
      "time": " 29.Jan.2008 6.11pm",
      "content": "\\> _In fact, they eventually got legislation passed to give music labels a portion of every blank tape sale, according to this site._\n\nDoesn’t something similar exist for CD-R’s?\n\n"
    },
    {
      "time": " 29.Jan.2008 7.08pm",
      "content": "_Doesn’t something similar exist for CD-R’s?_\n\nLooks like it does, for audio CD-Rs. Wikipedia info [here](http://web.archive.org/web/20081208191438/http:/en.wikipedia.org/wiki/Private_copying_levy) and [here](http://web.archive.org/web/20081208191438/http:/en.wikipedia.org/wiki/Audio_Home_Recording_Act).\n\n"
    },
    {
      "time": " 29.Jan.2008 7.36pm",
      "content": "Yeah, that’s what I meant indeed.\n\n"
    },
    {
      "time": " 30.Jan.2008 7.43am",
      "content": "Yea, I know on the perihpery there’s been talk about ’taxing’ internet access and paying a chunk of that back to the IP holders.\n\nIt’s an interesting idea, and, in fact, I think Canada implemented something akin to that with a fee on all MP3 players.\n\nThe problem is that mainly benefits the big business folks, rather than the independent.\n\nPersonally, I would like to see a lot of the industry attempt a model of ’cheaper, more convnient = more sales” strategy. I know I buy a lot more music now than I ever did before on CD now that Amazon makes it so easy to download DRM-free MP3s.\n\nOnce Apple gets a better deal set up with the movie rentals on iTMS, the AppleTV will start looking really nice.\n\n"
    },
    {
      "time": " 30.Jan.2008 10.02am",
      "content": "Sorry for this aside: Darrel, what is the bit rate on the Amazon MP3?\n\n"
    },
    {
      "time": " 30.Jan.2008 10.26am",
      "content": "_I think a better way to say all that is that piracy is not only a product of greed or a false sense of entitlement but of laziness._\n\nIt’s not laziness, it’s that people don’t want to be dictated when and where they can and can’t consume their media. As far as I’m concerned, the MPAA and the RIAA brought a large portion of piracy down on themselves by not innovating or listening to their consumers.\n\n"
    },
    {
      "time": " 30.Jan.2008 10.37am",
      "content": "<cite>As far as I’m concerned, the MPAA and the RIAA brought a large portion of piracy down on themselves by not innovating or listening to their consumers.</cite>\n\nHere, here... innovate or get the hell out of the way.\n\n"
    },
    {
      "time": " 30.Jan.2008 10.59am",
      "content": "<cite>It’s not laziness, it’s that people don’t want to be dictated when and where they can and can’t consume their media.</cite>\n\nNo, that aspect of it isn’t laziness. When people become fed up with the MPAA and the RIAA, and are finally given a chance to dictate the terms on which they consume their media, they seem mostly to have decided on “right now and for free”. I think, maybe wrongly, that that indicates a false sense of entitlement.\n\nThings may have been (or be) unjust with respect to the supplier/consumer relationship, but I can’t help but feel like the protest is more like a looting than a picketing.\n\n"
    },
    {
      "time": " 30.Jan.2008 11.10am",
      "content": "Ones sense entitlement depends wholly on the person you’re asking :)\n\n"
    },
    {
      "time": " 30.Jan.2008 11.14am",
      "content": "“Darrel, what is the bit rate on the Amazon MP3?”\n\nUmm...I think it’s VBR averaging around 256. Plenty good enough for my ears. ;o)\n\n“is more like a looting than a picketing.”\n\nI’m thinking it’s somewhere in between.\n\n"
    },
    {
      "time": " 30.Jan.2008 11.31am",
      "content": "The fact remains that there are laws and rights.\n\nIf I don’t like the rights that Foundry A or Record Label A claim then the only thing I can do is use Foundry B or Record Label B who both claim rights I can agree to live by. No?\n\n"
    },
    {
      "time": " 30.Jan.2008 11.33am",
      "content": "I also think that it is about time for some international law to come into play in regards to all of this stuff. It is far too convenient for some countries to rest on the laws their country sets forth when it comes to the rights someone in another country is claiming. Oh, wait, doesn’t that exist already!\n\n"
    },
    {
      "time": " 30.Jan.2008 12.24pm",
      "content": "“The fact remains that there are laws and rights.”\n\nCertainly. Fortunately, citizens and market forces can change those over time as needed. Sometimes for the better, sometimes for the worse. But it’s nicer when the industry changes on their own prior to needing to involve the lawyers and politicians.\n\n"
    },
    {
      "time": " 30.Jan.2008 12.41pm",
      "content": "Well, it’ll only be a matter of time before the industry introduces a new superior format with new parameters for playing/copying and controlling, which should obscure the need/use of past formats.\n\nIt won’t recoup the loses and damages for past performers/movies/etc... but it might maintain them for new releases.\n\nConsidering the use and proliferation of Wi-Fi, I’m sure this new format will be under constant monitoring and access will be provided via passwords/keycodes/or connectivity.\n\n"
    }
  ]
}
