{
  "id": "41275",
  "title": "How do you view your own memory?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hia\n\nIf memory is the brain function that records information, stores it as data and recalls said retained data, how would you describe your own memory system? What does it look like, how does it work\n\npersonally I think I view mine structurally similar to the universe, with a ga-billion-trillion stars, clustered together at various points, with no sides or end. and when i recall a memory a selection of stars all very far apart are joined together through connecting lines, drawing information from far and wide to bring together the information i have requested.\n\nThere must be so many different imaginative ways people view their own mind\n\nLindsayy\n\n [‹ Design and type usage in Java applications](http://web.archive.org/web/20080612045130/http:/typophile.com/node/41465 \"Go to previous forum topic\") [\\*\\*\\*PLEASE COMMENT ON MY TYPE\\*\\*\\*\\* ›](http://web.archive.org/web/20080612045130/http:/typophile.com/node/41246 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080612045130/http://typophile.com/user/17501\" title=\"View user profile.\">lindsay noble</a>",
  "time": "<br>",
  "uid": "17501",
  "comments": [
    {
      "time": " 24.Jan.2008 10.50am",
      "content": "My memory is a recalcitrant subordinate/child who won’t do as told.  \n“I thought I told you to retrieve that information. And you still don’t have it?”  \nTo my chagrin, it’s usually easier to put a name to a type face than a person face.  \nFaceBook — is that like FontBook?\n\n"
    },
    {
      "time": " 24.Jan.2008 10.52am",
      "content": " ![](http://web.archive.org/web/20080612045130im_/http:/typophile.com/files/thumbnail_6213.jpg)\n\n"
    },
    {
      "time": " 24.Jan.2008 10.57am",
      "content": "I have no idea about the structure, but I consider my memory as one of my biggest assets. It is very good on most subjects, but like Nick I am very bad at people’s names. That doesn’t bother me a bit and I think somewhere down the line it might be a matter of priorities.\n\nI am a pretty good speller. In a language as irregular as English I think that’s mostly a matter of memorization. That being said I’ll probably put a clunker in this post…\n\npbc\n\n"
    },
    {
      "time": " 24.Jan.2008 11.03am",
      "content": "I see my memory in my rear view mirror, heading the other way.\n\n"
    },
    {
      "time": " 24.Jan.2008 11.05am",
      "content": "The computer model virus got me in the eighties. So, short term is RAM and long term is HD. Science has provided us the realization that 70% of long term (older than two weeks) is largely recreated. Now if the legal system catches up it will have a real problem with any testimony older than two weeks.\n\n"
    },
    {
      "time": " 24.Jan.2008 11.10am",
      "content": "I view my memory as a supermassive relational database in which any request for information is multiplied by the current value of /dev/random. As a result of this I tend to think and speak in segue, which leads people to assume that I’m not right in the head. Fortunately my /dev/random isn’t a true random number generator; its output is based on information gathered from the ebb and flow of the cosmic background radiation, so it tends to produce results that are oddly relevant.\n\nThis would be a great topic for design observer. I would love to see what kind of answers came out the Pentagram crowd.\n\n"
    },
    {
      "time": " 24.Jan.2008 11.28am",
      "content": "I just go to “About My Brain” under the apple menu and it tells me how much hard drive I have left.\n\nSeriously, tho, I wish I could get rid of some of the dross that’s taking up space (e.g. song lyrics from 70s AM radio, ex-boyfriends’ phone numbers) and replace it with new and useful information. Then defrag, optimize, repair permissions, etc.\n\n"
    },
    {
      "time": " 24.Jan.2008 11.50am",
      "content": "Before college, my brain was a well oiled machine, recalling memories and remembering both short term/long term with little problem. After college it’s a jumbled mess of loose sheets dashed across an ever expanding desk. Crumpled memories in the bin, and a few stuck in the shredder. Don’t even talk to me about short term... I’ve already forgot what we were talking about.\n\n"
    },
    {
      "time": " 24.Jan.2008 11.51am",
      "content": "Memory, what’s that? Can you remind me?\n\n"
    },
    {
      "time": " 24.Jan.2008 11.54am",
      "content": "_I am a pretty good speller. In a language as irregular as English I think that’s mostly a matter of memorization._\n\nAnd really, I would guess, a matter of visual pattern recognition and attention to visual detail. Which raises the questions:\n\nDo type designers tend to be better spellers than the average person?\n\nor,\n\nDo better type designers tend to be better spellers than the average type designer?\n\n"
    },
    {
      "time": " 24.Jan.2008 11.57am",
      "content": "\\>Do better type designers tend to be better spellers than the average type designer?\n\nA spelling bee at TypeCon!\n\n"
    },
    {
      "time": " 24.Jan.2008 12.26pm",
      "content": "Scratch N’ Sniff type!\n\n"
    },
    {
      "time": " 24.Jan.2008 1.10pm",
      "content": "I’m with Jupiterboy . . . I think of it this way . . .\n\nThere is a default basic logic board that defines basic things like function, and it parses about 5 seconds of thought . . .\n\nRAM starts as soon as thought becomes action or deeper thoughts and it continues to build until it resets itself and new RAM begins . . .\n\nEach RAM is then stored in long term memory and is simultaneously categorized and subcategorized . . .\n\nWhen active RAM realizes it needs more information, it performs a contextual search first through specific keywords, then subcategories, then categories and weighted results are returned to active RAM as it continues to work on the thought at hand . . .\n\nI actually drew up a basic schematic for a Human OS after a few days of thinking about this . . .\n\nThat said, I don’t believe there is a need for fragmentation, overloads, etc and that there is simply a never ending container for RAM and that all RAM is compiled RAM meaning we never have to start from scratch thinking about breathing, etc . . .\n\nI think as we age, the logic board becomes refined and more elegant as well as more defined meaning it prefers not to change and may start to feed back RAM as it is recalled with editorial notations rather than simply being recalled as it precisely happened . . .\n\nThe concept becomes more believable to me as I watch how my children learn and grow . . .\n\n:D\n\n"
    },
    {
      "time": " 24.Jan.2008 1.18pm",
      "content": "Loved your answer, Patty!\n\n"
    },
    {
      "time": " 24.Jan.2008 1.26pm",
      "content": "Thanks Ricardo. I think I have middle aged Alzheimers. Honestly I can never remember, for example, the html required to make a link in a typophile post, I always post it as a separate link. My brain \\*should\\* be able to process and store that kind of info, no? And yet? I still remember the MAILING ADDRESS of my high school boyfriend. Or here’s another one: on myfonts just now the words “Oh What a Night” popped up when I looked for the font Candace. Yep, I’m singing away and remember the whole damn song. Completely useless.\n\nGonna need reading glasses too...\n\n"
    },
    {
      "time": " 24.Jan.2008 1.34pm",
      "content": "Show us your schematic Stuart, if you don’t mind. I really love to see people’s visual representations of head space. It is such an interesting thing to try and do, and the results are always very entertaining.\n\n"
    },
    {
      "time": " 24.Jan.2008 3.18pm",
      "content": "Patty you should consider getting [TextExpander](http://web.archive.org/web/20080612045130/http:/www.smileonmymac.com/textexpander/index.html). I love it. All I have to do is type “,” and “a” and it enters the a href information.\n\n"
    },
    {
      "time": " 24.Jan.2008 3.34pm",
      "content": "My brain is like a giant sponge —- James and the Giant Sponge. I never pay attention, but somehow I absorb massive amounts of information. Sometimes I wake up and I’m not really sure if I’m in the right room, but other than that I’m fine.\n\nEverything I experience, everything that happens to me causes physical changes in the structure of my brain known as axon modelling. Axons connect themselves to the dendrites of other brain cells. That’s what brain scientists reckon anyway, that there is an actual physical basis for memory.\n\nSure. Put money on it ;^)\n\nI’m a rather average speller and monolinguistic. You see how my mind works—-it’s like a lazaaar! It wants to constantly break down corrupted and atrophied English language spellings.\n\nGenerally I make a conscious effort to exist in a parallel taste-free universe. I try to make connections with the collective consciousness of the 19th and 18th centuries when a lot of things were still sharp and furry.\n\nAlmost a year ago I came very, very close to dying when two arteries inside my brain burst. They repaired the arteries with stents and installed a shunt tube in the rear of my cranium to alleviate fluid pressure on my brain. That makes me part Borg, .05% assimilated. No contact with any Borg cubes yet.\n\nj a m e s\n\n"
    },
    {
      "time": " 24.Jan.2008 3.40pm",
      "content": "My memory is kinda like my bookshelves, chock full of stuff—which sometimes falls out and hits you but mostly kind lies there in disarray unless it is pun related. Then, it flies out at you without ever being requested. My spelling is in great need of such things as spell-check. I never remember names but infinitesimal details spew out like a leaky faucet.\n\n ![](http://web.archive.org/web/20080612045130im_/http:/typophile.com/files/mybookshelf_5282.JPG)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Jan.2008 3.49pm",
      "content": "_Gonna need reading glasses too..._\n\nI’m already using those! :-D\n\nAs for my own memory, I am better at remembering faces than names, for example. My father liked to say that he had a photographic memory, and I feel like I am wired the same way.\n\nOn the other hand, and this is why I liked Patty’s response, I too can remember things like the song order (not to mention lyrics!) of certain albums I listened to as a teenager, but forget things I did or read a couple of nights ago. It really does seem that once you have a certain amount of knowledge stored in your memory, there is less “space” (or gray matter) for new stuff. I want an external hard drive!\n\nAlso: a friend of mine and I were wondering the other night about whether having so much info available online makes people less prone to remember things... This friend always remarks that I am good at remembering names of movie directors, writers, actors, etc., but lately, I’ve been stuck on certain ones. Since my use of the Internet has been increasing lately, we were wondering if both things were related.\n\n"
    },
    {
      "time": " 24.Jan.2008 3.52pm",
      "content": "_mostly kind lies there in disarray unless it is pun related_\n\nROTFL, Chris. I like the exception!\n\n"
    },
    {
      "time": " 24.Jan.2008 4.02pm",
      "content": "Memory\\>\n\nBeing a Luddite, in spirit, if not actually, I see it as a series of giant, but cramped and badly lit rooms, full of dusty filing cabinets. There are hundreds and hundreds of half-literate urchins running around, rifling through massive drawers full of unsorted sheaves of paper tied together with string, trying desperately to fill randomly generated orders, while in other rooms wheezy old scribes sit at row after row of Bob Cratchit style desks feverishly writing down everything that I hear, say, feel and smell in a scratchy, ink spattered and smeared Bickham script, while teams of draughtsmen in yet another room peer out my eyes through quaint looking brass telescopes with smudged poorly ground lenses and draw maps and diagrams of every thing I see. The urchins bundle these up, not bothering to sort in any way, fasten them with string, run off to the filing cabinets and stuff them in, where ever they can find room. The floors are knee deep in loose papers. Retrieved documents are spread out on huge tables where teams of professorial looking gentlemen in frock coats and nineteenth century army uniforms try and make sense of it all, inferring strange connections between completely unrelated documents, with no particular respect for logic or common sense.\n\n-=®=-\n\n"
    },
    {
      "time": " 24.Jan.2008 4.27pm",
      "content": "\\> _Honestly I can never remember, for example, the html required to make a link in a typophile post, I always post it as a separate link._\n\nLuckily you can just type [[ url | text you want as link] ], without the spaces, to make a good link. That is easier to memorize then the html-crap.\n\nOn topic:\n\nMy memory is actually quite good. For most things anyway. For example, I don’t have an agenda/appointment book (whatever it’s called). I just remember appointments, dates and times.\n\n"
    },
    {
      "time": " 24.Jan.2008 5.44pm",
      "content": "I think of memory as a large, muddy field. Your memories are like tracks made by a bicycle. Each track (memory) has a certain shape and location. When you remember something, you ride through the path again. Paths that cross are like when we make associations. Rehearsed memories are deeper, like riding over the same path over and over with the bike. Earlier memories are also deeper because the mud was softer when they were made. The mud in the field tends to harden over time (never completely, unless you get something like Alzheimer’s), making it harder to make new paths. Plus, more experiences you have, the more paths there are, the harder they are to find.\n\nAnyway, that’s how I visualize it.\n\n"
    },
    {
      "time": " 24.Jan.2008 8.05pm",
      "content": "\\> _That makes me part Borg, .05% assimilated. No contact with any Borg cubes yet._\n\nlol! I only just read that. That is actually quite funny. :D\n\n"
    },
    {
      "time": " 24.Jan.2008 8.08pm",
      "content": "\\> how would you describe your own memory system? What does it look like, how does it work\n\nBig trouble. photographic memory, or whatever is the right term.\n\n"
    },
    {
      "time": " 24.Jan.2008 8.32pm",
      "content": "Jelmar — hee-hee. I’m not a huge fan of Star Trek but the Borg and Voyager are fascinating, especially Geri Ryan as the rehumanized Borg named Seven of nine. Very spunky woman. I love the idea of space travel too.\n\nIt’s a bit freaky knowing there are two small titanium mesh cylinders embedded in the middle of my brain.\n\nj a m e s\n\n"
    },
    {
      "time": " 24.Jan.2008 8.34pm",
      "content": "Mark - I agree with you, it’s about the synapses, the paths taken. These paths lead to associations which are often surprising - how you may draw up some image or piece of information long buried. I don’t tend to see it as bike paths as much as some sort of network. I do believe that everything we have learned remains with us, but what we lose, sometimes, is access to it.\n\n"
    },
    {
      "time": " 24.Jan.2008 9.05pm",
      "content": "Mark’s interconnecting bicycle track analogy is “much like” the way axon modelling works. Google reckons it’s really called **[Axon Guidance](http://web.archive.org/web/20080612045130/http:/en.wikipedia.org/wiki/Axon_guidance)**.\n\nThe Wikipedia article looks half decent, altho it has no references or cited sources.\n\nj a m e s\n\n"
    },
    {
      "time": " 24.Jan.2008 9.53pm",
      "content": "_A spelling bee at TypeCon!_\n\nOnly if both ’Murrican and Anglophile spellings are accepted (“Anglophile” being common forms found in most Commonwealth countries — U.K., Canuckistan, the Antipodes, etc.).... ;-)\n\n"
    },
    {
      "time": " 24.Jan.2008 11.46pm",
      "content": "_Canuckistan, the Antipodes_\n\n;-D\n\nAre you talking about the colour grey, typophilic neighbour?\n\n"
    },
    {
      "time": " 25.Jan.2008 5.29am",
      "content": "Like amateur stitching.\n\nWhen I’m learning something, all the time I spend developing or using that skill it’s like I’m adding more random stitches, reenforcing the jumble of tread, tightening the knot.\n\nAll the time I spend not doing something, or accessing certain pieces of information allows the stitching to loosen, come undone, wear away.\n\n"
    },
    {
      "time": " 25.Jan.2008 6.51am",
      "content": "James — hehe, Voyager was pretty good. The concept was different from the other series, with them being stranded in the Delta Quadrant.\n\nI can imagine that the titanium cylinders must be a strange idea.\n\n"
    },
    {
      "time": " 25.Jan.2008 9.29am",
      "content": "This has been a very interesting read.\n\nIt makes me wonder how people view other abstract subjects.\n\nFor example, I tend to picture a year as a large disc with imprinted months/weeks, which serves as a base for various objects which float above to indicate events and activities.  \nThe event icons are rather OS X in style...\n\nAs for my memory... it resembles a teenager’s bedroom with massive heaps scattered about containing all of the information I’ve accumulated. Some heaps are more organized than others.  \nI guess this is what happens when you don’t listen to you mom telling you to clean your room...\n\n"
    },
    {
      "time": " 25.Jan.2008 9.52am",
      "content": "I’ve always appreciated this piece of work by Antero Ali, although he would be the first to note that it is not original.\n\n ![](http://web.archive.org/web/20080612045130im_/http:/typophile.com/files/Antero_6431.gif)\n\n"
    },
    {
      "time": " 25.Jan.2008 10.30am",
      "content": "[Lia Perjovschi](http://web.archive.org/web/20080612045130/http:/www.galleryyujiro.com/Liaperjovschi/lia1.html) is a contemporary artist who is doing some similar (though messier) “mind maps.”\n\n ![](http://web.archive.org/web/20080612045130im_/http:/typophile.com/files/today_5770.jpg)\n\n"
    },
    {
      "time": " 25.Jan.2008 2.39pm",
      "content": " ![](http://web.archive.org/web/20080612045130im_/http:/typophile.com/files/phrenology_6731.jpg)\n\n"
    },
    {
      "time": " 27.Jan.2008 7.57am",
      "content": "theres a book called metaphors we live by (which i havent actually read, though its in the post) which examines how we use metaphors in everyday life to comprehend abstract concepts such as memory.\n\nI love how visual all the personal systems are - perhaps thats because people who like type are very visual. I should ask on a maths-o-phile site, see if they think in numbers.\n\nlindsayy\n\n"
    },
    {
      "time": " 27.Jan.2008 8.39am",
      "content": "Memory? What memory? Oh, you mean the Steel Sieve.\n\n"
    },
    {
      "time": " 27.Jan.2008 3.58pm",
      "content": "I’m sorry I forgot the question... :-)\n\n"
    },
    {
      "time": " 27.Jan.2008 4.56pm",
      "content": "_theres a book called metaphors we live by_\n\nI’ve heard that’s quite good. It is cited in another book, [_Introducing Metaphor_](http://web.archive.org/web/20080612045130/http:/www.amazon.com/INTRODUCING-METAPHOR-Murray-Knowles/dp/0415278015/ref=sr_1_8?ie=UTF8&s=books&qid=1201481722&sr=1-8).\n\n"
    },
    {
      "time": " 27.Jan.2008 9.16pm",
      "content": "There’s folders, lots of subfolders of with nothing in them but yet another subfolder called “new folder”. Lots of shortcuts that cause a little sand glass to preoccupy my attention rather than actually lead somewhere. Plenty of read/write errors, with no time to go fully offline for a low-level scan. And I can never recall quite what fell out the back end of the recycle bin.\n\n"
    },
    {
      "time": " 27.Jan.2008 10.08pm",
      "content": "<cite>...what fell out the back end of the recycle bin.</cite>\n\nThe Recycle Bin. Something in the sound of that resonates with me.\n\n"
    },
    {
      "time": " 28.Jan.2008 1.19am",
      "content": "I view my own memory as an engraving by M.C.Escher of a self-referential cycle feeding back on itself. It’s like a hologram. Cut it in half and something very interesting happens. Instead of two halves of an image you get two complete images each half the size of the original. Cut those two into halves and you get four complete images each one quarter the size of the original. Ad infinitum. It keeps going. Cut it into a thousand pieces and you wind up with a thousand miniature holograms of the complete original scene. Some reduction in resolution is inevitable, but you get the idea. Memory is holographic in structure. All of the information is contained in every part of the brain. This phenomenon has been proven physically true. People who lose part of their brain retain most if not all of their memories, at least as accurately as these things can be measured. Provided you don’t lose a part of the brain critical to normal functioning you continue to remember everything you could remember before the accident reduced the amount of brain material.\n\nThe feedback model is very significant for me, becaws it works just like a rocket engine. There’s a frickin’ turbopump that feeds kerosene (or liquid hydrogen, depending on what kind of brain you got) to the combustion chamber thru the part called the Injector Face, and a do-hickey at the business end taps off some of the power output and feeds it back to the turbopump. The pump then spins a heck of a lot faster, delivering mind-boggling quantities of fuel to the combustion chamber, in turn producing colossal thrust. Yeah! Burn baby burn. When I have a brainwave is  \n“much like” when that turbopump kicks in. Wollop.\n\nOne book in my library I love is _Metaphors for the Mind — The Creative Mind and its Origins_ by Colin Murray Turbayne. ISBN: 0-87249-699-6. University of South Carolina Press. Here’s the back cover blurb:\n\n“The author analyzes the significance of metaphor in human thought by exploring historical traditions of philosophy. Probing into the early philosophies of Plato and Aristotle, Turbayne traces the influence that Platonic metaphors have held for later important philosophers such as Berkeley and Kant. By showing how modern theories of human thought and language (including the substance and attribute theory) arose from the procreation model as presented in Plato’s _Timaeus,_ Turbayne makes a significant contribution in the current philosophical debates concerning relativism/realism. In the discussion, the author restores the model to its original state in which the female and male hemispheres of the mind work as partners to create our world.\n\nTurbayne, author of _The Myth of Metaphor,_ has once again given us an original concept. Students delving into the sub-conscious of our culture, whether lay or academic readers, will find this book a rich vein.”\n\nj a m e s\n\n"
    },
    {
      "time": " 28.Jan.2008 4.09am",
      "content": "**Bicycle tracks  \nHolographic structure  \nFractal branch-like structure  \nStructure!**\n\n ![](http://web.archive.org/web/20080612045130im_/http:/typophile.com/files/puddle_5838.gif)\n\nOh yeah, and credit the artist —- M. C. Escher. (but you all knew that :^)\n\nj a m e s\n\n"
    },
    {
      "time": " 28.Jan.2008 4.44am",
      "content": "Nick said,\n\n“My memory is a recalcitrant subordinate/child who won’t do as told.  \n’I thought I told you to retrieve that information. And you still don’t have it?’”\n\nAgreed, Nick.\n\nYour brother from a different mother,\n\nDylan\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nBuild a man a fire, and he’ll be warm for a day.  \nSet a man on fire, and he’ll be warm for the rest of his life.\n\n"
    },
    {
      "time": " 28.Jan.2008 5.50am",
      "content": "Nice topic, i worked on this question for half a year during my graduating project. I ended up with a book of 560 pages describing and structuring ’10 minutes in my mind’.\n\n ![](http://web.archive.org/web/20080612045130im_/http:/typophile.com/files/hoekjes_6436.jpg)\n\n ![](http://web.archive.org/web/20080612045130im_/http:/typophile.com/files/17_5803.jpg)\n\nAs things change so quickly i had to name it “10 minutes”, ’cause 10 minutes later i would have had a different book to make.\n\n"
    },
    {
      "time": " 28.Jan.2008 6.13am",
      "content": "_There’s folders, lots of subfolders of with nothing in them but yet another subfolder called “new folder”. Lots of shortcuts that cause a little sand glass to preoccupy my attention rather than actually lead somewhere. Plenty of read/write errors, with no time to go fully offline for a low-level scan. And I can never recall quite what fell out the back end of the recycle bin._\n\nI like this. And files and folders that I want to delete, but somehow I don’t have the right permissions...\n\n"
    },
    {
      "time": " 28.Jan.2008 7.58am",
      "content": "@ Ricardo — along with colour, honour, theatre.... ;-)\n\n_And files and folders that I want to delete, but somehow I don’t have the right permissions..._\n\nEspecially that faulty iTunes file that keeps playing bubblegum one-hit wonders from the 1970s over and over and over and over....\n\n"
    },
    {
      "time": " 28.Jan.2008 1.40pm",
      "content": "“How do you view your own memory?” ;)  \nI think, if your can back it up, or delete it, in other words, control both the content and the existence of memory, then it is yours. Otherwise, it is either no one’s, someone else’s, or you’ve otherwise lost it.\n\nCheers!\n\n"
    }
  ]
}
