{
  "id": "41350",
  "title": "Hard Drive Died... Lost Font for my Business Card",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I lost my font collection when my hard drive died and along with that any knowledge of what fonts I used on my business card. I am in the process of recreating my business card so I can get it printed again in the future, but I need the font from the following picture. Thanks a bunch in advance!\n\nNote that I did edit the typeface a little, but the essence is still there.\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 2.png](http://web.archive.org/web/20081203232234/http:/typophile.com/files/Picture%202_55.png) | 12.76 KB |\n\n [‹ Newbie needs HELP identifying a font!](http://web.archive.org/web/20081203232234/http:/www.typophile.com/node/45307 \"Go to previous forum topic\") [2 Fonts: Any Ideas? ›](http://web.archive.org/web/20081203232234/http:/www.typophile.com/node/45303 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203232234/http://www.typophile.com/user/26336\" title=\"View user profile.\">mredig</a>",
  "time": "<br>",
  "uid": "26336",
  "comments": [
    {
      "time": " 25.Jan.2008 10.27am",
      "content": "Hi there,\n\ni’d be gladly assisting you with the concept and design of a new solution for your visual identity - contact me if you like to..\n\ni also hope you do not take this suggestion offensive in any matter.\n\nsince you said you tweaked it a bit:\n\nafter daring ’what the font’ auto-recognition  \n, it looks somewhat close to this:\n\n[http://www.myfonts.com/fonts/agfa/high-script/high-script-forty/](http://web.archive.org/web/20081203232234/http:/www.myfonts.com/fonts/agfa/high-script/high-script-forty/ \"http://www.myfonts.com/fonts/agfa/high-script/high-script-forty/\")\n\nor maybe a suggestion which i like:\n\n[http://www.myfonts.com/fonts/larabie/thiamine/thiamine/](http://web.archive.org/web/20081203232234/http:/www.myfonts.com/fonts/larabie/thiamine/thiamine/ \"http://www.myfonts.com/fonts/larabie/thiamine/thiamine/\")\n\nconcerning this second suggestion i do have some interesting thoughts about a possible design solution for a new wordmark..\n\nkindest regards,\n\nsteffen\n\n"
    },
    {
      "time": " 25.Jan.2008 11.30am",
      "content": "Thanks for the offer, but I already have it designed. (that is also kind of what I do in the business) I just need to recreate it and to do so I need that font. And once again, thanks for the font suggestions, but they aren’t it.\n\n"
    },
    {
      "time": " 25.Jan.2008 3.35pm",
      "content": "This font style doesn’t look familiar (i.e. from one of the better-known foundries). Would you recall anything about where you got your fonts, such as if you often downloaded them from free font sites? This could help with ideas about where to search.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 25.Jan.2008 5.08pm",
      "content": "It is possible I downloaded it from a free site but the only clue I can think of would be that I would just browse them and download ones I liked. Well, that’s not much of a clue, but yeah, that’s how it worked. However, I don’t think I downloaded that one. I think it either came with OS X or possibly an Adobe program (or another program for that matter) that I installed. The problem here though is that I have most of that stuff installed and it’s not in there.\n\n"
    },
    {
      "time": " 25.Jan.2008 5.53pm",
      "content": "I can guarantee that didn’t come bundled with any Adobe products. So we can cross that search off. I’m pretty sure it isn’t part of Corel or the old Freehand bundle either.\n\n"
    },
    {
      "time": " 27.Jan.2008 11.37am",
      "content": "Lol, I don’t know where I got it then, sorry.\n\n"
    },
    {
      "time": " 27.Jan.2008 12.21pm",
      "content": "I’ve done some hard thinking and I think I might have remembered something... I’m pretty sure it’s a free font I downloaded now. To help narrow it down, it would have been one of the first results in a google search for free fonts and more specifically, mac fonts. To help further, I would also bet that it’s in the beginning of the alphabet for its name. The couple times I’ve gone to those font sites I would look through the first few letters of the alphabet and then get bored and do something else. However, it’s also possible that it could be further in and just shown in a gallery or something also.\n\nAny help would be great! thanks!\n\n"
    },
    {
      "time": " 7.Feb.2008 10.14am",
      "content": "If you’re still looking for this... it’s [Gauss Jordan](http://web.archive.org/web/20081203232234/http:/fonts.tom7.com/fonts98.html) by Divide By Zero.\n\n"
    },
    {
      "time": " 7.Feb.2008 1.44pm",
      "content": "Damn! I was so close - I thought it was I Suck At Golf, but when that wasn’t a match, I gave up the search.\n\n- Lex\n\n"
    },
    {
      "time": " 7.Feb.2008 9.56pm",
      "content": "Hats off to Angel for finding another obscurity! I wish I knew your secret.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 8.Feb.2008 9.49am",
      "content": "Yeah, Angel seems to be kinda omniscient.\n\n"
    },
    {
      "time": " 9.Feb.2008 8.44am",
      "content": "BTW, while I was hunting for this I noticed an Art Nouveau-era ’oldie’ that has some of these qualities in a more legible design, called [Pekin](http://web.archive.org/web/20081203232234/http:/www.myfonts.com/fonts/hihretrofonts/pekin/), but originally known as ’Dormer’, according to the writeup on the site.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 13.May.2008 8.28pm",
      "content": "Ok, I’m sorry it took so long to say this, but I just forgot to keep checking here until now... so here it goes\n\nOMG THANKS!!!!! THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU THANK YOU !!!\n\nOk I think it’s all out... Either way, it’s been a while since I read the forum rules so I apologize if this is against them... and even tho it’d be small cuz I don’t have much, I’d be more than happy to send a small paypal gift your way Angel71, so if you get this let me know and pm me or something.\n\n"
    }
  ]
}
