{
  "id": "41355",
  "title": "Brauer Neue",
  "forum": "Home",
  "tags": [
    "Brauer Neue",
    "Lineto",
    "Rounded Sans",
    "Rounded Typeface"
  ],
  "content": "Part of: **[Indices](http://web.archive.org/web/20141108220616/http:/typophile.com/wiki/Indices) : [Typefaces](http://web.archive.org/web/20141108220616/http:/typophile.com/wiki/Typefaces) : [Rounded Typefaces](http://web.archive.org/web/20141108220616/http:/typophile.com/wiki/Rounded%20Typefaces)**\n\nCurrent URL:  \n [http://www.lineto.com/The+Fonts/Font+Categories/Text+Fonts/Brauer+Neue/](http://web.archive.org/web/20141108220616/http:/www.lineto.com/The+Fonts/Font+Categories/Text+Fonts/Brauer+Neue/ \"http://www.lineto.com/The+Fonts/Font+Categories/Text+Fonts/Brauer+Neue/\")\n\nDesigned by [Philippe Desarzens](http://web.archive.org/web/20141108220616/http:/typophile.com/wiki/Philippe%20Desarzens) & [Elektrosmog](http://web.archive.org/web/20141108220616/http:/typophile.com/wiki/Elektrosmog) 1999-2006\n\nPublished by [Lineto](http://web.archive.org/web/20141108220616/http:/typophile.com/wiki/Lineto)\n\n[http://www.lineto.com/Lineto.com/Frontpages/2006/14+Dec+2006/](http://web.archive.org/web/20141108220616/http:/www.lineto.com/Lineto.com/Frontpages/2006/14+Dec+2006/ \"http://www.lineto.com/Lineto.com/Frontpages/2006/14+Dec+2006/\")  \nTalking about the development of the «Brauer» typeface, its originator  \nPierre Miedinger (a nephew of the designer of Helvetica, the legendary Max Miedinger) cryptically said: «As we all know, beer contains alcohol, an intoxicant with all its known side effects, it blurs the vision and obliterates any sharp edges. That’s why we continuously squinted when checking the shapes of the developing letters while drawing the typeface. The resulting negative drawing of the font is both sharp and rounded - as if you didn’t have clear vision anymore.»\n\nToday, we can only guess what role the actual consumption of Hürlimann Sternbräu played in the genesis of the typeface in the mid-seventies.\n\nIn the meantime, the Hürlimann brewery has been bought up by Carlsberg and the typeface was discarded many years ago. The beautiful factory buildings were recently transformed into a complex of offices, shops and restaurants; Google will soon open their largest offices outside the US on exactly the premises where the «Brauer» font found its first modest manifestations.\n\nDesigners Marco Walser of Elektrosmog and Philippe Desarzens very soberly went about the task of further developing Miedinger’s alcoholically challenged Helvetica variant into a full family of six weights. LL Brauer Neue, as it is now called, features a Regular, a Bold, and a Black cut, all with matching Italics. The Black cut replaces the existing version of «Brauer» which has been available from Lineto since 1999.\n\nWith its new weights and italics forming a comprehensive family of fonts, LL Brauer Neue is now ready for much wider use – going well beyond its previous status as a headline font, something many customers have continuously been asking for.\n\nWe raise our glass to Messrs Miedinger, Walser and Desarzens whose fonts promise to reach the parts other fonts cannot reach!\n\n",
  "author": "AndrewSipe",
  "time": "25 Jan 2008 — 10:46am",
  "uid": "6496",
  "comments": [

  ]
}
