{
  "id": "4136",
  "title": "Barry Lyndon Movieposter font",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hey there people, I'm trying to find out what the font on the attached image is for a job I'm doing. The client wants this EXACT font, not something that resembles it, don't ask me why, it's one of those arty farty people.   \nactually, I need to find out both fonts, the one that 'stanley kubrick' is written in and the one that 'Barry Lyndon' is written in.   \nI hope someone can help me out here.   \n   \nCheers.   \n   \n ![Kubrick - Lyndonfont](http://web.archive.org/web/20080705105756im_/http:/www.typophile.com/forums/messages/83/32724.jpg)\n\n [‹ &#40;x&#41; France Telecom corporate face - Bienvenue {Franz}](http://web.archive.org/web/20080705105756/http:/www.typophile.com/node/4152 \"Go to previous forum topic\") [&#40;x&#41; Texas State Technical College Marshall - Monotype Garamond, Palatino {Eduardo} ›](http://web.archive.org/web/20080705105756/http:/www.typophile.com/node/4145 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080705105756/http://www.typophile.com/user/3370\" title=\"View user profile.\">user</a>",
  "time": "<br>",
  "uid": "3370",
  "comments": [
    {
      "time": " 6.Apr.2004 4.01am",
      "content": "\"Stanley Kubrick\" is probably [Goudy Old Style](http://web.archive.org/web/20080705105756/http:/www.myfonts.com/fonts/agfa/goudy/old-style/testdrive.html?s=STANLEY%2BKUBRICK&p=48).\n\n"
    },
    {
      "time": " 6.Apr.2004 4.19am",
      "content": "thx man, direct hit by the looks of it.   \nNow all i need is the 'Barry Lyndon' font   \n[if it even IS a font and not a custom made text [oh god i hope it's a font]   \n   \ncheers.\n\n"
    },
    {
      "time": " 6.Apr.2004 4.26am",
      "content": "Doesn't look too good, Roger. I have the impression that   \nmovie logo is custom designed. It reminds me of the work   \nof [Ed Benguiat](http://web.archive.org/web/20080705105756/http:/www.myfonts.com/Search?searchtext=benguiat), but I couldn't find any match.\n\n"
    },
    {
      "time": " 6.Apr.2004 4.41am",
      "content": "Hm . . . that would surely be my bad luck.   \nGuess there's nothing else to do but convince the client that's he's  outa luck, unless someone else has an idea ??   \n   \nCheers sofar anyhoo ![:-)](http://web.archive.org/web/20080705105756im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 6.Apr.2004 6.51am",
      "content": "Sorry Roger, I too thought of Benguiat but couldn't find anything ![:-(](http://web.archive.org/web/20080705105756im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": " 6.Apr.2004 6.59am",
      "content": "Since the movie was done in 1975, I checked the Solotype Catalog and scanned some photo-type books, and I'd say the letterforms were inspired by some Victorian/Art Nouveau-era lettering (even though I think that's not the era portrayed in the film), but didn't see anything that made me even want to check it more closely for a match. I think it's very likely that it is custom lettering too.\n\n"
    },
    {
      "time": " 6.Apr.2004 8.13am",
      "content": "I took a look at the opening credits in Barry Lyndon (as a Kubrick fan I have the DVD, of course) and they appear to have been done by hand. The letter shapes are consistent overall, but vary in their details and proportions. They are also better drawn than the movie poster version (as shown in Roger's scan above). The same style is used for the intertitles (titles between sections), but the end credits are done in Cheltenham Oldstyle.\n\n"
    },
    {
      "time": " 6.Apr.2004 8.15am",
      "content": "You could fake it with Korinna and some swashes...   \n   \n [http://www.myfonts.com/fonts/linotype/itc-korinna/regular/testdrive.html?s=BARRY+LYNDON&p=60](http://web.archive.org/web/20080705105756/http:/www.myfonts.com/fonts/linotype/itc-korinna/regular/testdrive.html?s=BARRY%2BLYNDON&p=60)   \n   \n(And tell your arty fart boss that look got retired back in the 70s)\n\n"
    },
    {
      "time": " 6.Apr.2004 8.19am",
      "content": "ok, thx for your efforts guys.   \n   \nCouldn't have hoped for more input.   \n   \nCheers.\n\n"
    },
    {
      "time": " 6.Apr.2004 9.01am",
      "content": "[Souvenir](http://web.archive.org/web/20080705105756/http:/www.myfonts.com/fonts/bitstream/itc-souvenir/light/testdrive.html?s=BARRY%a0LYNDON&p=48) is also similar, especially the B. The style is a kind of blending of Souvenir, Bookman (with swashes!), and Desdemona. I'm not sure why Kubrick chose it for a movie set in the 18th century. It evokes the 1970s more than anything else.   \n   \n(In spite of the strange choice for the titles, this is still one of my favorite films. It's absolutely beautiful, but you need to watch it on a big screen--and not on a tv.)\n\n"
    },
    {
      "time": " 6.Apr.2004 1.30pm",
      "content": "\"Barry Lyndon\" could be based in a typeface, with a swash variant and perhaps lowercase.   \nHere is a sample from the Soundtrack CD (bad printed and small reproduction of a the LP record I guess). I see the long \"R\" in BARRY a little bit different than the swash one in the credits, that could be a modified, and the same with the \"A\", or an alternate for this one.   \nIt also looks it could have lowercase from the same family, the last sample are details from a 1976 not really well printed french version of the poster I have, it seems it could be the same lowercase typeface than the american (\"a\" \"d\")... Or maybe they just mixed lower and upper...   \n   \nI haven't found it obviously, this could be a typeface, an old one, or maybe the whole thing was just done for the movie, like in the opening credits.   \nI don't know Roger, hope it helps, I am intrigued too.   \n   \nCould not be more agree with Mark's opinion about the movie and how to see it, the light is special.   \n   \n ![Barry](http://web.archive.org/web/20080705105756im_/http:/www.typophile.com/forums/messages/83/32781.gif)   \n   \n\\*\\* BTW an interesting writing about Kubrick [Typophile](http://web.archive.org/web/20080705105756/http:/www.typophile.com/forums/messages/30/32151.html?1080685006).\n\n"
    }
  ]
}
