{
  "id": "41366",
  "title": "Alternative Characters and \"Logotypes\" in Monotype Metal",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Reading about Bembo just now I came across a reference to the long R & short R in Metal Bembo from Monotype. Which got me wondering what other alternative glyphs or alternative glyph combinations there might have been.\n\nI know that Linotype had quite a few “logotypes” which were a mix of Kering solutions and ligatures (mainly f related but sometimes including much more ) and sometimes there were even contextual alteration of non ligature kerned logotypes. I found the contextual stuff at the Printing History Museum in North Andover. Here is some more info on that:\n\n[http://www.typophile.com/node/36157](http://web.archive.org/web/20080131145737/http:/www.typophile.com/node/36157 \"http://www.typophile.com/node/36157\")\n\nMy questions are, if I wanted to see if similar things had been done with Monotype Metal fonts where would I look? Did Monotype use the Term “logotype”? What alternative characters do you know and or love?\n\n [‹ InDesign Question](http://web.archive.org/web/20080131145737/http:/www.typophile.com/node/41376 \"Go to previous forum topic\") [Wil Hudson during the 1970s: photos ›](http://web.archive.org/web/20080131145737/http:/www.typophile.com/node/40286 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080131145737/http://www.typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 25.Jan.2008 1.52pm",
      "content": "If this were a research project (ie you weren’t planning on making a Bembo knock-off, but were, say, writing a dissertation on Bembo) you’d get in contact with Robin Nicholas, and request an appointment to visit the Monotype UK office in Salfords. Robin, might then let you examine the original engineering drawings which would include the special sorts.\n\n"
    },
    {
      "time": " 25.Jan.2008 2.03pm",
      "content": "Checking my notes, non standard letters or figures were known as ’specials’ they had a L designation when specific to a typeface or an F designation when shared between typefaces.\n\n"
    },
    {
      "time": " 25.Jan.2008 2.14pm",
      "content": "Yes, this is a sort of dissertation albeit not affiliated or otherwise sanctioned by an institution\\*.\n\nI will contact Robin. I don’t think I will be able to visit between now & Typecon but maybe later. And maybe he has some ideas about this. Do you have his contact info? Would you send it to me by email?\n\nNice new avatar BTW! I really like the old one too.\n\n\\*This question is related to a talk I am probably going to give at Typecon about Text faces use of contextual shapes. From hand scripts to metal to digital and a shift in thinking I want to encourage. The Linotype examples are pretty great I think just because they show high craft within a very constrained situation and they support the idea that context specific shapes can be just as useful in text as they are in display. I feel like I have done a reasonable job with the metal Linotype but I haven’t even looked at metal Monotype!\n\n"
    },
    {
      "time": " 25.Jan.2008 2.33pm",
      "content": "Hey that’s great detail - Specials! Now I can ask about them in a more focused manner. Hooray!\n\n"
    },
    {
      "time": " 25.Jan.2008 2.38pm",
      "content": "Sure, sent off-list. I’m sure given the talk subject he’ll be willing to provide some details in email. Sadly the drawings, pencil on paper, are hard to reproduce.\n\nThe new avatar is a pic of the 3 inch wooden Snufkin my kids got me for xmas. My 6yr old calls him “Tiny Brett Favre” as he’s wearing the Packers colors.\n\n"
    },
    {
      "time": " 25.Jan.2008 3.40pm",
      "content": "There’s no need to go all the way back to the engineering drawings to see what special characters were available. If you can track down any copies of the specimen sheets or books that Monotype prepared for their customers, they’ll usually show the special characters along with the part numbers that were used to order the correct matrices for any given typeface. For instance, here’s a note from a specimen for Bembo Bold 428 (unfortunately I don’t have the corresponding sheet for Series 270, the regular weight):\n\n ![](http://web.archive.org/web/20080131145737im_/http:/www.typophile.com/files/bembo_bold_alts_8pt_3673.gif)\n\nYou can see the alternate versions of R available, as well as a few additional ligatures. Granted, the drawings would make it easier to see what’s been adjusted to make those ligatures, but the printed specimens I’ve seen have always had really clear printing.\n\n(That’s 8 pt. type shown at 300%, in case you’re wondering.)\n\n"
    },
    {
      "time": " 25.Jan.2008 3.45pm",
      "content": "Cool! It’s interesting to see that they call the special letter combinations ligatures even if the don’t visually touch. Are there special years that are better or worse to track down like there are for the ATF catalog?\n\n"
    },
    {
      "time": " 25.Jan.2008 3.54pm",
      "content": "The later the better for any given form of the typeface (that is, the latest specimen of either the metal or the film version you can find), since any specials that were custom ordered by any customers would be added to the next round of updates. I’m not sure when the major sets of specimens were released, but I’ve mostly seen binders of specimens that allowed customers to insert the updated sheets as they were produced.\n\n"
    },
    {
      "time": " 25.Jan.2008 5.32pm",
      "content": "I see. That’s how Linotype did it too I think. How late would Monotype Metal catalogues go? Or ... do they still make some metal?\n\n"
    },
    {
      "time": " 26.Jan.2008 2.00am",
      "content": "\\> _That’s how Linotype did it too I think._\n\nI can’t resist quoting the comment by Beatrice Warde aka Paul Beaujon on the extra characters made by Linotype for Granjon in her piece on the ‘Garamond’ types in _Fleuron_ 5:\n\n‘To offset the unfortunate inability of the Linotype to cast a kerned f, no fewer than twenty-six ligatures are provided. After such a sacrifice of practicality to beauty, it would be ungenerous of an author to mention Afghanistan, and so call out the ‘button-hook’ f that is the family spectre of Linotype designers.’\n\n"
    },
    {
      "time": " 26.Jan.2008 6.42am",
      "content": "Eben —\n\nHave I mentioned the Spiral/Emerson contextual r to you before? It was part of Blumenthal’s original foundry type, but didn’t make it into the Monotype cutting of the face — probably because they couldn’t really accommodate it in the matrix case and there wasn’t likely to be much interest in such a specialized sort as an extra.\n\nIf you can get your hands on a copy of the APHA’s <cite>American Proprietary Typefaces,</cite> Jerry Kelly discusses this on page 115 in his article on Emerson.\n\n— K.\n\n"
    }
  ]
}
