{
  "id": "41376",
  "title": "InDesign Question",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Sorry if this is slightly off topic for the site, skip it if you want to -\n\nQ: If you have a Master Sheet and you update it can you get the text boxes to automatically snap to the new guides? If it is possible can you describe how to do it or point to where it says? I have been hunting around but to no avail. Maybe because I am a InDesign Newbie. Or it may be that what I want InDesign to do it doesn't do. If it can't that would be good to know too. Thanks in advance!\n\n",
  "author": "ebensorkin",
  "time": "25 Jan 2008 — 6:56pm",
  "uid": "2942",
  "comments": [
    {
      "time": "26 Jan 2008 — 4:23am",
      "content": "Hi Eben!  \nYes, your keyword is ‘Layout Adjustment’ (at least that’s what it’s called in ID CS2).  \nThe InDesign Help is pretty expedient on this.\n\nFurthermore, the basics of this function are explained in ‘InDesignSecrets Podcast Podcast 053’ ( [Transcript](http://web.archive.org/web/20131109001131/http:/indesignsecrets.com/podcast-053-transcript/) – quite to the end of the episode).  \nF\n\n"
    },
    {
      "time": "26 Jan 2008 — 5:23am",
      "content": "The text box change will only occur if you have used Master textbox in creating the document and have not moved it individually on a single page.\n\nChrisL\n\n"
    },
    {
      "time": "26 Jan 2008 — 5:50am",
      "content": "Have you tested that, Chris? I’m pretty sure that this isn’t 100% true. IIRC, you can make use of Layout Adjustment even if you didn’t check ‘Master textbox’ when creating the document. You need a Master Sheet with guides –&nbsp;or margins, of course.\n\n"
    },
    {
      "time": "26 Jan 2008 — 6:35am",
      "content": "If you have master text frames on your Master page and adjust them, the corresponding frames on the document pages will change accordingly, as long as you have not manually adjusted the text frame on a document page, thereby breaking the Master's control over it.\n\nIf you're talking about individual text frames on document pages (not created via or governed by any master text frames), then Florian's tip about Layout Adjustment is the way to go. Read up on it in the Help: it's not a magic bullet. But it is intended to do the sort of thing that I think you're asking about, as long as your initial conditions are right.\n\n-- K.\n\n"
    },
    {
      "time": "26 Jan 2008 — 6:43am",
      "content": "Kent has explained my meaning better than I did :-)  \nThanks Kent!\n\nChrisL\n\n"
    }
  ]
}
