{
  "id": "41389",
  "title": "Caps, a question.",
  "forum": "David Sudweeks's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20150312052648im_/http:/typophile.com/files/Ralph%20001_3626.gif)\n\n ![](http://web.archive.org/web/20150312052648im_/http:/typophile.com/files/Ralph%20001b_5289.gif)\n  \nThe first glyph I drew when I was sketching out this idea Thursday was the capital R. I'm trying to demonstrate the idea of pieces of positive and negative space fitting together implying lines.  \nNow how do I ask this? Am I unwittingly copying someone else's work here? What I mean is—I'm relatively new to type design and I haven't read more than a handful of books on the subject—does this look like a ripoff of someone else's design or concept? \n",
  "author": "David Sudweeks",
  "time": "26 Jan 2008 — 12:23pm",
  "uid": "18989",
  "comments": [
    {
      "time": "26 Jan 2008 — 8:58pm",
      "content": "Hi, David,\n\nNice work. I know of at least two typefaces that work with a similar idea, but then again they use different types of shapes as their starting points. One of them is [Avia](http://web.archive.org/web/20150312052648/http:/www.fontbureau.com/fonts/Avia), by Raphael Boguslav and Jill Pichotta. The inspiration was \"faulty platemaking or light inking\" that causes the hairlines to be lost, according to Font Bureau's catalog. It goes on to say that Boguslav \"understood it as a sophisticated form of stencil design.\"\n\nI think this shows that two different people can arrive at similar solutions while working on different problems. And it wouldn't be the first time this has happened. Since you're relatively new to type design, it might be a good idea to continue with this project... You will probably learn a lot from it.\n\nI've forgotten what the other typeface is called... It might be a custom job, actually, or unreleased. I am pretty sure that it was featured in Print or Step Inside Design a year or two ago, in those annual Young Visual Artists/Ones to Watch specials that they do.\n\nOh, and this older thread might have something, too:\n\n[http://typophile.com/node/15767](http://web.archive.org/web/20150312052648/http:/typophile.com/node/15767 \"http://typophile.com/node/15767\")\n\nOne more thing... If you would also like a critique of your typeface, try posting some examples in the Critique section of Typophile.\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:07am",
      "content": "Muchas gracias Ricardo.\n\n"
    }
  ]
}
