{
  "id": "41385",
  "title": "Logo for real estate doctors",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I have posted here before and received some great help; I am in web design — not print / graphic, so I know I need your help. I appreciate the help some of you gave me in making my web co. logo in the past.\n\nI am at the very beginning and have just made some sketch concepts - concepts only!\n\nThe logo is for a business for medical professionals involved in real estate transactions. A good friend of mine asked me to create the logo as quickly as I can, and I keep getting stuck at the very beginning with how to incorporate the stethoscope with the house. Those are the two things the company wants included on the logo, placing the steth on the house. I know the stethoscopes look bad - I just freehanded it fast.\n\nThe stethoscope is supposed to read “y” Do you see that or have to look for it?\n\nI also considered not using caps, but I feel that it needs to be stronger because it is a real estate company. Any tips for typeface?\n\nThank you for your help and time.\n\n[http://www.pococreative.com/tests/mikki/Picture%2012.png](http://web.archive.org/web/20081007180121/http:/www.pococreative.com/tests/mikki/Picture%2012.png)\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 12.png](http://web.archive.org/web/20081007180121/http:/typophile.com/files/Picture%2012.png) | 31.38 KB |\n\n [‹ logo crisis!](http://web.archive.org/web/20081007180121/http:/www.typophile.com/node/41068 \"Go to previous forum topic\") [\\*\\*\\*PLEASE COMMENT ON MY TYPE\\*\\*\\*\\* ›](http://web.archive.org/web/20081007180121/http:/www.typophile.com/node/41246 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007180121/http://www.typophile.com/user/19681\" title=\"View user profile.\">Kristi</a>",
  "time": "<br>",
  "uid": "19681",
  "comments": [
    {
      "time": " 26.Jan.2008 10.42am",
      "content": "“medical professionals involved in real estate transactions”  \nThat sounds like an unusual business :)\n\n“The stethoscope is supposed to read “y” Do you see that or have to look for it?”  \nI got the ’y’ readily. If you hadn’t written it, the stethoscope may have been harder. But once you draw it better, I guess that shouldn’t be a problem. And anyway, you’d get it by association.\n\nOf the two options, I prefer the one on the left where the profile of the home is more simple. Why not try an option where the two words, Healthy and Realty are stacked - in such a way that you have the stethoscope making a common ’y’?\n\nAs for typeface, I’d definitely go for something less neutral. Do see if [FF Speak](http://web.archive.org/web/20081007180121/http:/www.fontshop.com/fonts/downloads/fontfont/ff_speak_ot) works for you. The lines of the font may cue a way to draw the steth.\n\nYou may also want to look at replacing all-caps with title case.\n\n"
    },
    {
      "time": " 26.Jan.2008 11.26am",
      "content": "Thanks for your input and tips! Will be back with something more definitive soon. I do like FF Speak - looking for something more in the $20 - $60 range, though.\n\nI appreciate the the help.\n\n"
    },
    {
      "time": " 26.Jan.2008 7.37pm",
      "content": "The other idea I’m considering now based on the suggestion of having two lines (but my friend wants the stethoscope to only act as the lower “y” in “realty,” not on the word “healthy.” This is still a rough concept sketch.\n\n ![](http://web.archive.org/web/20081007180121im_/http:/www.typophile.com/files/healthyrealty3small_6142.png)\n\nAlso, this logo will be used primarily for yard signs, but also business cards, flyers, other branding, etc. Should a 1200 px wide, 360+dpi .png image be sufficient for most printing companies, or will I need to start over and make this as a .bmp or .svg? Thanks for your help.\n\n"
    },
    {
      "time": " 27.Jan.2008 11.50am",
      "content": "”...looking for something more in the $20 - $60 range”  \n [Neo Sans](http://web.archive.org/web/20081007180121/http:/www.fontshop.com/fonts/singles/creative_alliance/neo_sans), [Precious](http://web.archive.org/web/20081007180121/http:/www.type.co.uk/index.php?p=a_to_z&let=*&id=7321), or [Infinity](http://web.archive.org/web/20081007180121/http:/www.vllg.com/Thirstype/Infinity/mudTyper+Weights) could be options\n\n“The other idea I’m considering now..”  \nLooks interesting. I’m not sure you really need to draw the house so literally. Probably just the roof profile, as you had done earlier, would be sufficient.\n\n“but my friend wants the stethoscope to only act as the lower “y””  \nI’m sure you’re friend was just giving a suggestion to get you going, and would be quite okay if the idea evolves a little, as long as it addresses the client brief. Here it looks as if it is.\n\n“Should a 1200 px wide, 360+dpi .png image be sufficient...”  \nIf it’s anything other than an on-screen application, you’d be better off creating it in vector so that it can be scaled to whatever size. That means drawing it in a program like Illustrator, Freehand, Corel Draw etc. If you need an on-screen version, you can always create a jpeg/bmp from that.\n\n"
    },
    {
      "time": " 27.Jan.2008 8.44pm",
      "content": "Gosh, there’s a reason you people go to school for this!!!\n\nI don’t know if I can get much better than these. I have stared at it all day, and I don’t know if I’ll ever be able to draw paths for a stethoscope!\n\nThanks for your help. I have 3 (plus the old one that I originally had in mind) very different concepts, and I’m going to wait and see which one my friend likes the most. Any of these seem worthy of pursuing further to you?\n\n"
    },
    {
      "time": " 27.Jan.2008 8.45pm",
      "content": "Gosh, there’s a reason you people go to school for this!!!\n\nI don’t know if I can get much better than these. I have stared at it all day, and I don’t know if I’ll ever be able to draw paths for a stethoscope!\n\nThanks for your help. I have 3 (plus the old one that I originally had in mind) very different concepts, and I’m going to wait and see which one my friend likes the most. Any of these seem worthy of pursuing further to you?\n\n(image is not uploading - here’s a link: [http://www.pococreative.com/tests/mikki/Picture%203.png](http://web.archive.org/web/20081007180121/http:/www.pococreative.com/tests/mikki/Picture%203.png))\n\n"
    },
    {
      "time": " 29.Jan.2008 6.09am",
      "content": "This is what the client went with for the final.\n\nThanks for your help!\n\n ![](http://web.archive.org/web/20081007180121im_/http:/www.typophile.com/files/healthyrealty4small_3645.png)\n\n"
    },
    {
      "time": " 29.Jan.2008 8.24am",
      "content": "Maybe I am a bit too late, but could you kern the bottom text to align with the top text? It looks off since the letters are identical.\n\n"
    },
    {
      "time": " 29.Jan.2008 6.40pm",
      "content": "You’re right. Thanks.\n\n"
    }
  ]
}
