{
  "id": "414",
  "title": "Critique on Vagebond please",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi,   \nThis is a font I've been working on for quite some time now, but I can't seem to finish it. I rebuild it now 2 times new, but somewhere I keep having an invisible border.   \nPerhaps Philip Cavette has some good ideas. I like his fonts and would appreciate his opinion.   \n   \n ![Vagebond](http://web.archive.org/web/20131018050823im_/http:/www.typophile.com/forums/messages/29/12042.jpg)   \n   \nI have some problems with the \"2\", \"x\" and \"\\<\". Does anyone have some ideas on how to improve them?   \nI'm working on the other special characters. I have some ideas on them and will post them very soon.   \nFrom this font I will also make different weight and italics.   \n   \nThanks,   \nRen\n\n",
  "author": "Rene Verkaart",
  "time": "22 Jun 2003 — 7:57am",
  "uid": "1946",
  "comments": [
    {
      "time": "22 Jun 2003 — 8:09am",
      "content": "To visualise what I mean, see this image.   \n   \n ![vagebondtext](http://web.archive.org/web/20131018050823im_/http:/www.typophile.com/forums/messages/29/12046.jpg)   \n   \nKerning and spacing needs to be tuned, I know.   \n   \nThanks,   \nRen\n\n"
    },
    {
      "time": "22 Jun 2003 — 8:14am",
      "content": "I like the texture. Just the \"R\" needs a different leg, and do compensate for the clotting (like in the join of the \"e\"). And make a lighter weight.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Jun 2003 — 8:54am",
      "content": "This is a great typeface.   \nNot much to fill in with.   \nLike \"d\" \"h\" \"w\" alot,but \"e\" and \"g\" maybe seems a little bit unbalanced.\n\n"
    },
    {
      "time": "23 Jun 2003 — 12:44am",
      "content": "Hrant, would you make it a vertical leg then? I kind of like the diagonal leg. It gives the font a little rythem.   \nThe clotting parts will be corrected soon. Also there will be a lighter weight, this version will be the startingpoint. But first the kapitals.   \nI tried skewing it in Fontographer and that looks great. It gives in more a fast, spacy, techno look to it. I will also try to make a condensed.   \n   \nPer, is it the short lower part of the 'e' and 'g' that you think makes it unbalaned? I could try making it longer.   \n   \nThanks for your time,   \nRen\n\n"
    },
    {
      "time": "23 Jun 2003 — 5:16am",
      "content": "Hi Ren\n\n"
    },
    {
      "time": "23 Jun 2003 — 7:56am",
      "content": "The \"R\": no, definitely keep the leg diagonal - but try moving it forward.   \n   \nItalic: skewing is probably your best bet, but I'm thinking it should be a strong angle, which means the necessity of correcting the inevitable distortions will be great. Also, I'd introduce some shears into the vertical stroke endings (and maybe all of them).   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jun 2003 — 8:06am",
      "content": "Hrant, that is too much for my English. What exactly is a shear?   \nAnd yes, the angle will be strong. Therefor I will propably have to correct all the curves.   \n   \nRen\n\n"
    },
    {
      "time": "23 Jun 2003 — 8:36am",
      "content": "Hmmm, I think I used the opposite word! In a Roman (upright) font a shear is when the ending of a stroke (like a vertical stem) is not flat, it's at an angle (usually \"uphill\").   \n   \nIn an italic, a flat ending is already at an angle to the stem! But I was thinking leaving it like that makes the italic \"boring\", so maybe you can try making the ending either perpendicular to the stroke (which would make the letters look like they're falling forward), or try making the endings _more_ sheared (uphill), which would make the letters look... sharper? Not sure.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jun 2003 — 12:27am",
      "content": "before the \"nice\", \"good\", etc., etc.,....   \n   \n1. what is the story of this typeface?   \n   \n2.== \"...I can't seem to finish it.\" == what is your method? to wit: did you start the design from a to z? or did you work with groups - A,V,W....- diagonal steams...and so on, so on.... ?   \n   \nit is important since you need to know the proportions of the strokes - uppercase & lowercase.   \n   \n3. compare & study : Drukpa (Diehl. Volk, 1990), Akimbo (Joe Treacy, 1992), Mata ( Greg Semata, 1993), and Eurostile extended # 2.   \n   \nhave a good day,   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": "24 Jun 2003 — 12:43am",
      "content": "Hi David,   \n   \nI realised I was always busy with fonts, from an early time. Somehow I seem to have forgotten that. But not really, because one day I started again. Out of nothing.   \n   \nI have propably no interesting story behind this font. I just started on an idea in my sketchbook and very quickly started to build the glyphs in Freehand. I had an idea of the overall look and feel of the font. I wanted a monoline, so no thick-thin proportions. I wanted a font that is very open and, when typed in longer texts, it will start to look like a wallpaper.   \nI'm not looking for selling the font. It was mainly my early contact with font creating. I would like to do that in order to create fonts for myself to use in my work.   \n   \nBecause the font is mainly based on a square with rounded edges, it was very easy to create the basic of the font. So I had no specific order in which to work.   \nThat is maybe also part of the problem. I wish I knew how to handle a fontcreation like that. I'm a graphic designer and know about typography, but not (enough) about font creation. Is there an order in which to work or to handle a project like this?   \n   \nI rebuild the font because, in my FOG, there was no room for the kapitals, etc, etc, etc. Perhaps thats also the fact that I can't seem to finish it. I did so much for it that maybe I'm over the point.   \n   \nDoes anyone have some info on how to deal with font creation? Guidelines, background info, etc. I know it is a profession for itself, but it has to be possible to do it semi-professionally.   \n   \nRen\n\n"
    },
    {
      "time": "24 Jun 2003 — 8:21am",
      "content": "A font still works without a story!   \n   \nBTW, I think you should leave it single-case.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Jul 2003 — 5:06am",
      "content": "did some alterations, not sure if they're any better. I like the font the way it is, including the \"r\" and the \"\\<\". If you were to do Caps maybe consider making them taller than the lower case, rather than having upper and lower case all be one xheight.   \n   \n ![alterations](http://web.archive.org/web/20131018050823im_/http:/www.typophile.com/forums/messages/29/12538.gif)   \n   \n-phillip \"ask for it by name\"\n\n"
    },
    {
      "time": "5 Jul 2003 — 8:44am",
      "content": "Hi Phillip,   \n   \nThanx again for your opinion. Like I said I also had some problems with those characters. The first 'x' is not bad, though it would have to be wider. I wanted to optically correct it a bit, but keep the vertical idea. But this little diagonal touch is great. The second one is not it, for me.   \nThe '2' is a good suggestion. I will try to make the lower horizontal line a little longer. It is just a little to heavy at the top. But other than that it's better than before.   \n   \nConcerning the caps, yes I will make them bigger than the x-height. I wanted to take the top hight of the font and make them all as 'squared' as the lowercases.   \n   \nThe 'r' I will leave like that. I will adjust the cluttering a little, but I kind of like that diagonal there.   \n   \nRen\n\n"
    },
    {
      "time": "28 Oct 2003 — 1:56am",
      "content": "Hi there,   \n   \nfor anyone who cares about seeing the updates. This is the most recent version of the Vagebond. I finally found some time again to work on it.   \n ![Character set](http://web.archive.org/web/20131018050823im_/http:/www.typophile.com/forums/messages/29/19365.gif)   \nThis next gif is a short text so that you can see how it behaves in text. I have some ideas about enhancing the type. I will do so in the near future. This is at least the basic with which I will create the rest of the family.   \n ![Vagebond text](http://web.archive.org/web/20131018050823im_/http:/www.typophile.com/forums/messages/29/19366.gif)   \n   \nCU,   \nRen\n\n"
    },
    {
      "time": "28 Oct 2003 — 5:08pm",
      "content": "Hi Ren\n\n"
    },
    {
      "time": "28 Oct 2003 — 11:18pm",
      "content": "Hi Ricardo,   \n   \nYou're right. Now that you say it, it makes sence. The @ is too small because I never planned to make capitals. I wanted to keep it on the same hight as the LC's, but it can be bigger.   \nI will also change the =. It is indeed too close together. That is the finetuning I need.   \nWhat do you think about the spacing? Is it not to close? I think it's OK, but the issue of legibility is also important to me. If I can increase it a bit I will try that.   \n   \nThanks for the tips.   \nRen\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:31am",
      "content": "Hello again Ren\n\n"
    }
  ]
}
