{
  "id": "41437",
  "title": "Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I would most appreciate your opinions regarding my logo.\n\nThe client, IPiFony, specializes in the development of software that enables hosted VoIP telephony services. Their customers, primarily, are regional ISP’s.\n\nThe concept for the logo is a light bulb formed from exclamation marks, with a cable jack at its base. The light bulb, obviously is a common symbol for a bright idea. I realize that it’s cliche, but I think it works here; it’s simple and memorable, and that’s often the best approach. The exclamation marks suggest the urgency / sudden realization that is an epiphany; furthermore, there are eight of them, which references the number of wires in a CAT5 cable (which is used to connect the phones to the network). The logotype is Mink (from T26) with numerous customizations. I believe it strikes the right balance between casual and formal, and appears sufficiently modern without looking trendy. For the “i” characters, I used inverted exclamation marks to establish visual continuity with the icon. The colors are Pantone Violet and Pantone 122.\n\nNOW, the dilemma...\n\nI have two versions where the only difference is the appearance of the “y”. The client prefers the first. I prefer the second. I believe the crook in the “y” is distracting, and leads the eye back toward the beginning of the type rather than continuing naturally to the icon. I like the consistency achieved in the second version by echoing the vertical descender of the “p” and “f”.\n\nPlease comment. I’d really like additional perspectives before I revisit this issue with the client. I really think I’m right about this, but I welcome your opinions whether you agree or disagree. Thanks!\n\n ![](http://web.archive.org/web/20080907044828im_/http:/www.typophile.com/files/critique_5269.gif)\n\n [‹ Personal Logo - please help!](http://web.archive.org/web/20080907044828/http:/www.typophile.com/node/38629 \"Go to previous forum topic\") [Crit my wordmark [Halvors] ›](http://web.archive.org/web/20080907044828/http:/www.typophile.com/node/41727 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907044828/http://www.typophile.com/user/26284\" title=\"View user profile.\">dch</a>",
  "time": "<br>",
  "uid": "26284",
  "comments": [
    {
      "time": " 28.Jan.2008 6.45am",
      "content": "Is it supposed to be pronounced ’epiphany’? If so, then this works. As for the y, the second seems a little more consistent with the rest of the letterforms.\n\nRemember, never show the clients the versions YOU don’t like. ;o)\n\n"
    },
    {
      "time": " 28.Jan.2008 10.39am",
      "content": "I like that you’ve given so much thought to the symbolism in the logo art. My only worry would be that the purple lines radiating from the light bulb may look a bit elementary or cartoony. And I didn’t see them as marks until I read your description.  \nAnother solution may be to use an exclamation mark (an inverted i here) as the filament in the light bulb, bringing the art in closer to the type and raising it in a superscript-ish fashion to communicate the “exclamation” of sudden insight.\n\nAt any rate, the attractiveness of the artwork should never be sacrificed for the sake of a good idea.\n\n ![](http://web.archive.org/web/20080907044828im_/http:/www.typophile.com/files/ipifony_3445.jpg)\n\n"
    },
    {
      "time": " 28.Jan.2008 10.52am",
      "content": "I like the second one - without the crook in the ’y’. I agree that it is distracting and I am drawn to look at this too. Maybe try this without the crook in the ’y’. With just a curved descender.\n\n"
    },
    {
      "time": " 28.Jan.2008 5.32pm",
      "content": "The problem with the first ’y’ is that the join is way too heavy. Compare this to the join in the ’p’. They should look the same.\n\n- Lex\n\n"
    },
    {
      "time": " 30.Jan.2008 4.51pm",
      "content": "Have you tried experimenting with the “Y” as the lightbulb?\n\n"
    },
    {
      "time": " 5.Feb.2008 12.57pm",
      "content": "I like that idea mac386. I think it’s a bit busy now. And the second Y is definitely better unless you were to take out that weird mass at the bottom of the first and make the descender straight.\n\n"
    },
    {
      "time": " 10.Feb.2008 3.00pm",
      "content": "I like the 1st one at the top but without the purple lines. The bulb says enough to me but is it an electric company or a telephone service? Hmm...the bulb suggests light, idea, electricity to me.\n\n"
    },
    {
      "time": " 13.Feb.2008 2.15pm",
      "content": "The f’s long descender emphasizes the “fony” for me, making it a company I’d be hesitant to trust. Is that just me?\n\nI think making the y into a lightbulb would deemphasize that.\n\n"
    }
  ]
}
