{
  "id": "41435",
  "title": "Yngresagen - a cultural and political organisation for the younger generations",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello typophiles,\n\nI've been pondering on this job for some time now, and thought I'd get some feedback and inspiration.\n\nI volunteer work for the communication group of a newly started political organisation in Denmark, called \"Yngresagen\" (literally: \"The younger cause\", playing on the existence of a large danish organisation: 'Ældresagen', which means \"The older cause\"). Yngresagen wants to help the young generation(s) get an opinion in the parliament (that's the lobby-part), but also to make it easy for members and volunteers to start up projects of their own (that's the activity-part, which is the most important one). Our target group as far as members goes, are young people between 13 and 35 years old (yes, that's an awful large and diverse group). But we also need to communicate with all sorts of media and of course the politicians. Furthermore, it's going to be a nation wide organisation, possibly the largest for our target group.\n\n------  \nI hope to express some of the following words: young (duh), competent (instead of the empty 'serious'), a pinch of politics, progressiveness & forward-thinking, creativity (more than a lobby org.), dynamic, fun & play,\n\nI really want to make the logo dynamic and non-static. In fact even plastic or elastic, in the sense that users/members/supporters could \"remix\" and even adopt the logo for their own purposes, thereby making it their own. My working idea is a green (yngresagens color) spiral, that, when it is drawn, resembles somewhat a fingerprint - with a wee imagination at least. Their initial logo was a real fingerprint. If drawn differently, it could also look like a tube – or even a megaphone (symbolising how the organisation could get the youth heard in public matters). If we want to be really fancy, it could also look like an ear. Nature is full of spirals and that can be exploited. I've included some examples of what I mean. I hope my idea doesn't sound too diffuse.\n\nFor the logo type, I thought having it:  \n\\* Sans and lower-case (maybe the 'Y' as a small capital, thereby only reaching the x-height)  \n\\* A grotesque of some sort, but with a humanistic tendency: cut-off sharp corners to make it less solid, but keep a vacuum-feeling  \n\\* Perhaps: transparency? (symbolising just that: that we want as little as possible to be hidden from the public). Example: [http://www.cphdox.dk/d1/front.lasso](http://web.archive.org/web/20131014213722/http:/www.cphdox.dk/d1/front.lasso \"http://www.cphdox.dk/d1/front.lasso\") (by the way, does anyone know this type? Maybe it's a custom design)\n\nBy the way, I have (almost) completely free hands on this project, so deroutes from my original idea are greatly appreaciated as well! I just want to discuss this as much as possible and look forward to hear your suggestions and ideas\n\nMalte\n\n| Attachment | Size |\n| --- | --- |\n| [krusedulle.jpg](http://web.archive.org/web/20131014213722/http:/typophile.com/files/krusedulle.jpg) | 56.79 KB |\n| [krusedulle\\_megafon.jpg](http://web.archive.org/web/20131014213722/http:/typophile.com/files/krusedulle_megafon.jpg) | 54.13 KB |\n| [krusedulle\\_øre.jpg](http://web.archive.org/web/20131014213722/http:/typophile.com/files/krusedulle_%C3%B8re.jpg) | 51.02 KB |\n\n",
  "author": "maltelunden",
  "time": "28 Jan 2008 — 1:42am",
  "uid": "24816",
  "comments": [
    {
      "time": "29 Jan 2008 — 9:48am",
      "content": "I'm not sure whether the post was too long or too unfocused. If someone tell me what I could do to better may chances for a dialogue on this, I'd greatly appreciate it. I'm still rather green in the design community, so I have a tendency too describe and talk about things in a more intuitive way. But I try to learn a lot from reading this board, so please suggest me what to do.\n\nI could write a short version of the above, maybe? I guess I just like lots of words, and therefore slack on being precise. Oops.\n\n"
    },
    {
      "time": "29 Jan 2008 — 11:46am",
      "content": "The spiral is one of the greatest symbols. I think you've activated enough ideas that you may need to take the next steps and offer something more finished for comment.\n\nThe font you show does look custom because of the transparent overlaps. [Politic ABCD](http://web.archive.org/web/20131014213722/http:/www.stormtype.com/typefaces-fonts-shop/families-38-politic-abcd) has a similar feel.\n\n"
    },
    {
      "time": "29 Jan 2008 — 2:38pm",
      "content": "edit: oops. I meant to say: \"there are _no_ lower-cases in the type.\n\nI've been thinking in lower-cases so far, and only the relation between 'y' and 'n' is what keeps me from being absolutely settled about it.\n\nI'm going to work on the spiral with my type-ideas in mind\n\n"
    },
    {
      "time": "29 Jan 2008 — 2:04pm",
      "content": "Why don't you tighten up your spiral mark and let the line quality guide your sense of the type.\n\nPolitic ABCD used to be Politica. From the description it is used by the Green Party. The C and D versions, in particular, do look like police. Because this type is devised of large blocks you might attempt to render the spiral in a block style—as if the pixels were very large—and match the weight to the type.\n\n"
    },
    {
      "time": "29 Jan 2008 — 3:05pm",
      "content": "Editing a post bumps it to the bottom of the thread.\n\n"
    },
    {
      "time": "29 Jan 2008 — 2:44pm",
      "content": "Yikes. It seems like my pre-previous post was deleted. I might not understand the editing system of this board. Hm.\n\nI like elements in your idea, thanks for the input! I was beginning to turn my head towards very thin sans types, because of the 'y' (actually Gotham thin - but it's probably too american). But I like the layer effect, so maybe I'll try heavier weights in that kind of setting.\n\n– _M_\n\n"
    }
  ]
}
