{
  "id": "4144",
  "title": "The Kingdom of Siam / Thai font diacritics",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "The Asian Art Museum in San Francisco is publishing a major catalogue of classic Thai art from the former kingdom of Ayutthaya, to be called The Kingdom of Siam. The desire is for the catalogue to reflect the style of earlier Western writings from around 1700 (in other words, around the time of the Romain du roi and early Franco-Dutch typography). A sample page of one of the models is provided.   \n   \nThe typeface must also accommodate Thai diacritics, which have a couple of peculiarities, notably a backwards cedilla that has to combine with a macron, and a breve-like finishing stroke to some of the glyphs, which also must combine with a macron. I will upload funky approximations of these from a poor-quality source.   \n   \nI'm prepared to create the special characters if I have to, but I would prefer to find an existing typeface that meets the project needs. To further complicate things, all of my work is postscript but some people need to work with the diacritics on non-postscript Windows machines. Maybe open type is a way around this?   \n   \nAny suggestions much appreciated.\n\n",
  "author": "xensen",
  "time": "6 Apr 2004 — 9:28am",
  "uid": "3089",
  "comments": [
    {
      "time": "6 Apr 2004 — 9:43am",
      "content": "Here they are.   \n ![sample page from model](http://web.archive.org/web/20150313162933im_/http:/www.typophile.com/forums/messages/4100/32763.jpg)   \n ![\"cedilla\"+macron](http://web.archive.org/web/20150313162933im_/http:/www.typophile.com/forums/messages/4100/32764.jpg)   \n ![finish stroke+macron](http://web.archive.org/web/20150313162933im_/http:/www.typophile.com/forums/messages/4100/32765.jpg)\n\n"
    },
    {
      "time": "6 Apr 2004 — 10:18am",
      "content": "I've never encountered a romanization scheme for Thai (although it makes sense there is one). Do you have a link to it?   \n   \nThe sample setting you show is actually more Garamond than RdR, so if you want to match that, something as mundane as an Adobe font might do the trick for you. I would however recommend going the RdR route, if only to give the project a nice archaic look.   \n   \nWhat are some digital RdR-style fonts?   \nIf you don't find a good one, can the project afford a commission for such a design?   \n   \nThe diacritics: well, the reverse-cedilla thing could be approximated with an ogonek (the Polish mark), which is available in many fonts (although with greatly varying quality), especially these days. As for the \"horn\" (which reminds me nicely of the Thai ngao), maybe take the visually comparable mark from Vietnamese? This will be harder to find, especially in an appropriate font, so you might have to graft one on yourself.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Apr 2004 — 10:28am",
      "content": "Thai has its own script (closely related to Lao & Burmese), which is not written with Latin characters. Modern Thai fonts are quite unrelated to this accented Latin stuff.   \n   \nThe \"backwards cedilla\" is an ogonek, byt the way. The little thing sprouting off the u is a horn. Offhand, I don't know of any typefaces that would include these sorts of characters with the macrons as well, as precomposed characters.   \n   \nI could get into the technical stuff in more depth, but the short version is that if you want to use a font in more places than Word 2003 for Windows, you'll probably need specially encoded fonts (non-Unicode). I don't know that such fonts with the characters you want already exist, but I can't swear that they don't, either.   \n   \nRegards,   \n   \nT   \n   \nThomas Phinney   \nProgram Manager   \nFonts & Core Technologies   \nAdobe Systems\n\n"
    },
    {
      "time": "6 Apr 2004 — 11:08am",
      "content": "Thanks for teaching me the word _ogonek._ I will be sure to use it soon!   \n   \nOf course Thai has its own script but it also has a romanization system, which uses the special marks I described among others. We mainly need these to render titles in the bibliography, where I guess they are critical. We are using the system approved by the Library of Congress and the American Library Association and published in a document imaginatively titled ALA-LC Romanization Tables. Following up on Hrant's suggestion I looked on-line for this and found it here: [http://lcweb.loc.gov/catdir/cpso/romanization/thai.pdf](http://web.archive.org/web/20150313162933/http:/lcweb.loc.gov/catdir/cpso/romanization/thai.pdf).   \n   \nI agree about the sample. I considered Adobe Garamond and may still go with it, since we already own that font, but was afraid it wouldn't read as having the archaic quality that is being looked for. Also, this is only one of several model texts, and others are more RdR or Dutch in flavor than this one is.   \n   \nWouldn't it be wonderful if we could afford to commission a special face! I doubt that would be within our budget, however (not having any real idea what it would cost).   \n   \nThanks for your help.\n\n"
    },
    {
      "time": "6 Apr 2004 — 11:38am",
      "content": "Commissioning a whole new face (even one based on a metal source) is indeed expensive - at the very least $2000 (for one weight). So try to find an existing digital face that has the right flavor, and just commission somebody to add the Thai stuff - or do that yourself!   \n   \nBTW, it would be interesting to compare the LoC romanization to that of Lepsius (a scholar who once devised an entire _standardized system_ of romanization usable for any script).   \n   \nhhp\n\n"
    },
    {
      "time": "6 Apr 2004 — 11:46am",
      "content": "BTW, since most fonts include a free-standing macron, all you might have to do for that accent is add some big fat negative kerning pairs to the font (once you find the right font :-). And you could just create a free-standing horn and do the same for that - that way you'll only take up one extra encoding slot, or even use unicode (which must have a horn somewhere).   \n   \nhhp\n\n"
    },
    {
      "time": "6 Apr 2004 — 9:31pm",
      "content": "Funny, I've been searching, and now I'm wondering:   \nIs it possible there are NO digital versions of any RdR-style face?!   \n   \nBTW, I just realized: DTL Fleischman might work great here.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Apr 2004 — 9:53pm",
      "content": "Interesting, I have never seen any standard for Thai romanisation before. Is trere any other Thai romanisation standard around?   \n   \nBTW, does anyone have a reference to a history of Thai typography/printing? I just had an interesting in printing recently. But since I have been studying in Australia for the past five years, so I don't have a chance to go back and search for information back at the Thai National Library.   \n   \nBest,   \nChanop\n\n"
    },
    {
      "time": "6 Apr 2004 — 10:27pm",
      "content": "Finally, Typophile has a Thai member! :-)   \nHopefully Nathan Matteson (a Typophiler highly involved in Thai type) will join us shortly.   \n   \nSince you're here, please allow me to ask you something.   \nWhat do you think about the fonts in this sample?   \n [http://www.themicrofoundry.com/other/thai.gif](http://web.archive.org/web/20150313162933/http:/www.themicrofoundry.com/other/thai.gif)   \n   \nBTW, I will dig up Lepsius's Thai romanization scheme tomorrow.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 1:24am",
      "content": "Hrant,   \n   \nI have been peeking around typophile for a long while, basically since I started having an interest in typography (was it typography?) when I was looking/learing how to make my thesis, report, and slide presentation look more interesting. I got bored with Knuth's Computer modern, Times with MathTimes, and Lucida with LucidaNewMaths on a standard TeX system. There are not many choices there for mathematical oriented typography: Adobe just ditched a mac support for FrameMaker; hopefully, InDesign will have a built-in functionality to typeset mathematics and long documents to the level of previous FrameMaker.   \n   \nFor the font -- I don't have any training in type design at all -- the first line looks nice; it probably is a bold/black weight of a text face.   \nThe eyes of &#3648;, &#3604;, look optically imbalance, not sure why though.   \n   \nIn the second line, I have seen this type of typeface used often in a magazine. Some letters are quite far from the way we write though: &#3619; that looks like s; and &#3600; that looks like &#3592; with a horn.   \n   \nThe main text looks pretty normal to me. IIRC, it looks similar to one that Microsoft includes in their OS.   \n   \nI notice some spacing problems here -- un-even spacing; I don't know how to solve it from the font perspective without hacking into the algorithm of the text setting software though.   \n   \nRegards,   \nChanop\n\n"
    },
    {
      "time": "7 Apr 2004 — 11:38am",
      "content": "Fleischman is an interesting suggestion.   \n   \nRegarding the Thai typeface sample, I will see if I can get some feedback from some of our Thai readers at the Asian Art Museum.\n\n"
    },
    {
      "time": "7 Apr 2004 — 11:55am",
      "content": "\\> I don't have any training in type design at all   \n   \nLike anything else, that can be both good and bad. Since there are many more designers than users on Typophile, and since the main point of typography is to accomodate the user, in this case I think that's definitely good! :-)   \n   \n\\> In the second line, I have seen this type of typeface used often in a magazine.   \n   \nWhat's interesting -and maybe shocking- in this case is that this was taken from a daily newspaper.   \n   \n\\> Some letters are quite far from the way we write   \n   \nBut what about their \"distance\" from what people expect to _read_?   \n1) Are any of the letters highly difficult to decipher?   \n2) Upon a quick initial glance, is there a problem seeing that line as Thai and not English (Latin)?   \n   \nAnd a follow-up question: what do you think of the darker weight for emphasis in the body text? I mean instead of italics.   \n   \n\\> I will see if I can get some feedback   \n   \nCool.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 4:17pm",
      "content": "Oi vey. I was just on my way out to catch the first NHL play-off match. And here I am instead.   \n   \nAFAIK, the Thai romanization scheme is used extensively in foreign language instruction and the like - but not used at all 'in country'. By Thai that is.   \n   \n\\>What do you think about the fonts in this sample?   \n   \n[disclaimer: these comments are distilled through my Thai friends. I only wish they were wholly mine.]   \n   \nLine 1: standard newspaper headline that wants the reader to think it's more important than it is. Because of both the weight off the letters and the heads (loops). I.e. it's 'classical' Thai. Much like I make fun of faces like Trajan, my Thai friends make fun of things like this.   \n   \nLine 2: standard advertising, preferable to some readers than Line 2. Too romanized (e.g., 5th consonant, _ro rua_, is too much like an 's'.). A lot of Thai I know think the heads make reading harder and prefer faces as in Line 2. Even for running copy at small sizes.   \n   \nLines 3-4: The Latin is too heavy. Arabic numerals are too heavy and too tall. I wouldn't be surpised if that was Browallia (an MS font as Chanop says). I'm no expert, but I think that the left sidebearing on _sara e_ is too tight (7th 'base' glyph in the first word on the second line; 4th glyph in the last word). While it might look like the left bearings on _sara o_ and _sar ai_ are too big, that's what I usually see. And what usually seems to be accepted.   \n   \nAlthough, as I mentioned, all the head (loops) that make a face 'look Thai', they seem to hinder efficient reading. It's something I'm stuggling with as I'm working now. To be headed or not be headed.   \n   \nSorry for the bad pun.\n\n"
    },
    {
      "time": "7 Apr 2004 — 4:22pm",
      "content": "Thom: sorry for not properly addressing your post. I have a leaf from a 17th-18th c. book with a map of Thailand on the verso. I'll scan both sides and post them this week if that would help. The map is copper engraved I believe. And I'm betting (I'd put money on it) that the text on the recto is set in something Garamond-esque.\n\n"
    },
    {
      "time": "7 Apr 2004 — 4:41pm",
      "content": "Bloody hell. The Canadian games are on CBC anyway. Who wants to watch Nashville? Here are the pages if they're helpful. 300 dpi TIFFs are available [here](http://web.archive.org/web/20150313162933/http:/www.eightyproof.com/image/thaimap01.tif) and [here](http://web.archive.org/web/20150313162933/http:/www.eightyproof.com/image/thaimap02.tif).   \n   \n ![](http://web.archive.org/web/20150313162933im_/http:/www.typophile.com/forums/messages/4100/32898.gif)   \n ![](http://web.archive.org/web/20150313162933im_/http:/www.typophile.com/forums/messages/4100/32899.gif)\n\n"
    },
    {
      "time": "7 Apr 2004 — 5:03pm",
      "content": "Thom: I thought for a second that the romanization scheme for Thai might be similar to Vietnamese - and that you could use a Vietnamese font for this. But looking through my files, it doesn't appear to be. I'm sure you've already looked into this though.   \n   \n\\>But what about their \"distance\" from what people expect to read?   \n   \nI've got two handpainted signs from a friend's birthday party that I'll have to post scans of Hrant. They're in Thai - you'd love 'em. I can't make any sense of them whatsoever, but apparently Thai readers have no trouble at all. I imagine it's their version of Bickham Script or something.   \n   \n\\>And a follow-up question: what do you think of the darker weight for emphasis in the body text? I mean instead of italics.   \n   \n'Italics' only appeared in Thai printing in 1925. That's what the only source I've ever found says anyway.   \n   \nOK, off to hockey finally.\n\n"
    },
    {
      "time": "7 Apr 2004 — 5:57pm",
      "content": "Wow, the lc \"g\" on that antique map is like a Patpong exotic dancer.   \n   \nVietnamese: it's not Romanized - that's the away it is! :-/   \nThe Carmen Miranda of writing systems.   \n   \nNathan, I'd love to see those scans! But pre-emptively: there's a difference between taking many seconds to read a strange display face versus reading a book.   \n   \n\\> 'Italics' only appeared in Thai printing in 1925.   \n   \nThat's good info. As a separate style, or subordinate to the \"Roman\"? And I wonder why a newspaper that would not mind that hyper-Latinized font _would_ mind using italics.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 6:00pm",
      "content": "Hrant,   \n   \nFor the font in line 2:   \nI have no problem reading it at all as it is on a head line. A quick glance, from my perpective, reveals that it definitely is Thai. I probably have some problem reading it in a long body text though as I feel that it is harder to read compare with the line 1.   \n   \nFor the body text, a number of thai font designers seem to settle down that _bo-height_ (_bo_ is the 10th character on the bottom line) should be somewhere between x-height and caps-height. In many fonts, the harmony between Latin alphabets and Thai alphabets are not there; quite often, latin counterpart has a thicker stroke; sometimes a different design.   \n   \nThe bold emphasis is a normal practice, I think. Usually there is no real italic (cursive) in same family but a slant form. To my knowledge, slant/italic shape in Thai came from a western influence.   \n   \nPersonally, I like Thai face with the loop. It is easier to read. If you have not seen this, the following two links are a publication that the goverment published a while ago about Thai fonts. They are in Thai though. The interesting bits for you guys probably are those specimen at the end of the book and the free thai font \"Norasi\" which is Yannis Haralambous's design. The files are big (13.5Mb) and the difference between the two is Type 1 and TrueType font.   \n   \n [http://www.swpark.or.th/upload/download/ThaiNationalFont\\_PC.zip](http://web.archive.org/web/20150313162933/http:/www.swpark.or.th/upload/download/ThaiNationalFont_PC.zip)   \n [http://www.swpark.or.th/upload/download/ThaiNationalFont\\_LINUX.zip](http://web.archive.org/web/20150313162933/http:/www.swpark.or.th/upload/download/ThaiNationalFont_LINUX.zip)\n\n"
    },
    {
      "time": "7 Apr 2004 — 6:28pm",
      "content": "\\> it is harder to read compare with the line 1.   \n   \nWhy?   \nIs it totally because the structures are unconventional, or partly because your mind is gravitating towards the Latin \"cognates\"? Would you say that an unconventional font that's _not_ Latinized is less difficult to read (for a Thai who reads the Latin scipt)?   \n   \n\\> bo-height (bo is the 10th character on the bottom line) should   \n\\> be somewhere between x-height and caps-height.   \n   \nMakes perfect sense. This should apply to Cyrillic for example too, although I've found great resistance to the idea among designers of Cyrillic - which is particularly strange among their subset who also design Hebrew fonts, but for that script they _do_ break the congruence!   \n   \nIn my sample however this doesn't seem to be enough: \"Home Depot\" still looks too big. The balance seems to be more delicate than just \"between x and cap\".   \n   \nSlant/Italics: Why would you say Thai typographers avoid simple mechanical slanting?   \n   \nThanks for the links - I will definitely check them out!   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 6:35pm",
      "content": "Hey Nathan, Chanop's PDF is the one you once sent me! Cool, less reading to do. :-\\>   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 6:37pm",
      "content": "Norasi: does it have a Latin counterpart?   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 7:27pm",
      "content": "Hrant,   \n   \nIt's harder to read in a long text because of familiarity, perhaps. Most texts that I have grown up used a typical Thai face with the circular head. However, there is no problem reading unconventional face on a poster.   \n   \n\\> Would you say that an unconventional font that's not Latinized is less difficult to read (for a Thai who reads the Latin scipt)?   \n   \nNo, perhaps.   \n   \n\\>\"Home Depot\" still looks too big. The balance seems to be more delicate than just \"between x and cap\"   \n   \nAgree, totally.   \n   \n\\> Slant/Italics: Why would you say Thai typographers avoid simple mechanical slanting?   \n   \nI don't think they avoid mechanical slanting; slant fonts are being used everywhere, however, I think bold are often used more frequenly.   \n   \nNorasi came from an Omega-serif project -- a free face that looks like Times Roman. The aim of the project is to support typesetting in many scripts e.g. latin, greek, hindi, hebrew, and etc.   \n   \nInterestingly, Norasi used a scaled down Latin for its latin counterpart so that the whole font looks more in harmony. Nevertheless, the scaled down caps is ~71% while whe scaled down minuscule is ~77%. To my eyes, minuscule is still too big and too dark.\n\n"
    },
    {
      "time": "7 Apr 2004 — 7:41pm",
      "content": "\\> bold are often used more frequenly.   \n   \nWould you hazard a guess as to why?   \n   \n\\> Norasi used a scaled down Latin for its latin counterpart   \n\\> so that the whole font looks more in harmony.   \n   \nI don't understand. Do you prehaps mean that the Thai font would look funny (too big on the body, I presume\\*) if it were made to match an existing Latin font outright? This would be an interesting paralles to my ArmenoLatin type system (Nour&Patria), where I discovered that the Armenian needed to be set about 10% larger to maintain apparent size (IF that's something you want in a given layout). Unfortunately, this makes some people (mostly die-hard Modernists) very uncomfortable - and many of them seem to have a mental block towards understanding why this _has_ to be so. What's even harder is to explain to people why matching apparent size should not be a goal unto itself.   \n   \n\\* But relative to what? I guess the bulk of existing Thai fonts?   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2004 — 10:09pm",
      "content": "There is a lot of good information here, and I haven't had time to properly consider it yet because of the press of deadlines. But I am once again amazed at what a rich resource typophile is. Could this exchange have occurred pre-internet? Thanks to all of you.   \n   \nNathan, your samples are very interesting indeed. What is the title and what are the publication details of the book they are taken from? Do you actually have the book?\n\n"
    },
    {
      "time": "7 Apr 2004 — 10:26pm",
      "content": "\\> Would you hazard a guess as to why?   \n   \nTowards a modern look, or a contrasty look, perhaps.   \n   \n\\> I don't understand. ...   \n   \n\"Too big on the body\" I don't quite understand the term, but I think it is. Let's say we have a typical Latin face at 1000 emsq design size (Type 1); Caps hight is ~700, x-height ~450, and the length from the highest point to the lowest point (ascender-descender) is within 1000. To match this face with Thai alphabet that has a regular height between Caps and x height, let's assume it to be 550-600. That is fine until we look at some characters like _sara o, sara i, sara u, tonal marks,_ and etc. When we combine the total design size from the top to the bottom, it goes well beyond 1000, quite ofen 1300-1500.   \n   \nIs there any real specification for this issue? Thomas? I have looked into Adobe Type 1 spec book, but found no concrete answer.   \n   \nTrueType Font distributed with Microsoft OS tend to reduce the size of Latin alphabet; the exception probably is Tahoma which is designed for screen reading. Designer of Tahoma squished the upper/lower vowels, tonal marks a little. So everything would fit in the point size.   \n   \nWhat I meant about Nosari is that, since the minuscule was scaled down less than the caps, so it looks too big. Besides, the stroke weight of Thai alphabets does not quite match the weight of the Latin ones, especially the bold weight.   \n   \nLet's see how I can post the image.... (still reinstalling panther, just got my pbook back from a service).\n\n"
    },
    {
      "time": "8 Apr 2004 — 7:13am",
      "content": "OK, so Thai has a \"problem\" with its distribution of vertical information: most of the letters are bo-height, so you have to make that big enough, but many of the letters use up much more vertical space. Sort of like accents in Latin caps (which are normally made to go beyondthe EM bounds), but I guess the super-tall letters in Thai are pretty common?   \n   \nA request: could you possibly find me some linguistic data about Thai? Specifically, I'd love to have a chart showing the relative frequency of each letter in Thai. If you could, that would be very nice!   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 11:16am",
      "content": "\\>Wow, the lc \"g\" on that antique map is like a Patpong exotic dancer.   \n   \nI thought you might dig that 'g' ;-)   \n   \n\\>Vietnamese: it's not Romanized - that's the away it is! :-/   \n   \nWhat about Nom script? I've been under the impression that Vietnamese had it's own ideographic writing system up until colonization and, consequently, romanization.   \n   \n\\>Nathan, I'd love to see those scans! But pre-emptively: there's a difference between taking many seconds to read a strange display face versus reading a book.   \n   \nTrue enough. I'm still amazed at how divergent the letterforms can be.   \n   \n\\>could you possibly find me some linguistic data about Thai?   \n   \nHrant, you might look up Doug Cooper at CRCL in Thailand. Also, the University of Wiscosin at Madison has a pretty good Southeast Asian studies department. I don't know anyone there, but they might be helpful.   \n   \n\\>[italics] As a separate style, or subordinate to the \"Roman\"?   \n   \nOff the top off my head, I'd say a separate style. I.e., not subordinated to 'roman' in running copy.   \n   \n\\>What is the title and what are the publication details of the book they are taken from? Do you actually have the book?   \n   \nUnfortunately, I just have the one leaf. I've been half-heartedly trying to find some details about it, but so far without success. If I run into anything, I'll definitely let you know.   \n   \nIt might be interesting to you that the first book printed with the Thai script was in 1828. About 60 years after the end of the Ayutthaya period. Before that every book used the romanization scheme you've got. Although these days when Thai is transliterated, it typically doesn't use the macrons, horns, and such. That said, I think it'd be pretty hard to do 'period-correct' typography without building a new face with the requisite accented characters.   \n   \n\\>TrueType Font distributed with Microsoft OS   \n   \nYou know, the Thai fonts distributed with Windows have actually gone through one huge change. Originally, Angsana (Times New Roman) was Angsana UPC. These fonts were made by Unity Progress, a Thai company, and I believe optimized for Thai - at 14 points the Latin was way to small. So now Angsana is Angsana New. As are all the Thai fonts in the OS. Although, perhaps the UPC versions are still used in Thailand.\n\n"
    },
    {
      "time": "8 Apr 2004 — 11:33am",
      "content": "Great thread. Sorry I found it so late. Chanop asked:   \n   \n_Is trere any other Thai romanisation standard around?_   \n   \nThere is also an ISO standard for Thai romanisation, ISO/FDIS 11940, but I have not examined it because ISO want me to pay 79 Swiss francs for the privilege.   \n   \nRegarding combining Latin and Thai in a single font, it is necessary to reduce the size of the Latin considerably if you want to balance it to the Thai and still allow adequate vertical space for the latter in the body height. Quite apart from the tall Thai glyphs, including three frequently occuring tall vowels, there are vowel and tone mark stacks to be accounted for, although the taller of these can reasonably extend beyond the body height. When working on a new Thai design, Fiona Ross, Tim Holloway and I examined a number of bilingual publications to get a sense of the conventional relative height and weight proportions of Latin and Thai when used together, and to see what works best. Sorry I can't show the result yet; suffice to say that I can confirm Chanop's observation that 'bo-height ... should be somewhere between x-height and caps-height'.   \n   \nI had no idea Nathan was into Thai type. Cool.\n\n"
    },
    {
      "time": "8 Apr 2004 — 11:41am",
      "content": "\\> What about Nom script?   \n   \nYeah, Nom is not Roman, it's Chinese-based. And I guess it's possible there's been a Romanization scheme for it, although Lepsius\\* came much later than the adoption of Romanized Vietnamese.   \n   \n\\* BTW, the copies from Lepsius's book that I've made don't cover Thai. But here's the reference in case anybody wants to look it up: \"Standard alphabet for reducing unwritten languages and foreign graphic systems to a uniform orthography in European letters\", C R Lepsius, 1863.   \n   \n\\> you might look up ...   \n   \nOK, cool.   \n   \n--   \n   \nJohn:   \n1) So do you have any letter-frequency data for Thai?   \n2) Check out Nathan's Daasang on ultrafonts.com. (And while you're at it, since I remember you having an ultra-hi-res display, please let me know if you think Mana-16 is usable for extended reading.)   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 11:55am",
      "content": "Sorry, Hrant I don't have letter-frequency data for Thai. I've yet to find an appropriately large and varied corpus of Unicode encoded Thai text, although the [BBC](http://web.archive.org/web/20150313162933/http:/www.bbc.co.uk/thai/index.shtml) archive would probably be a good start.   \n   \n   \n[Re. Mana-16, I find the variable contrast disturbing: the r is very dark compared to many of the letters with curves, such as g; the left side of the h is darker than the right side. I think I'll stick with my ClearType thanks ![:-)](http://web.archive.org/web/20150313162933im_/http:/www.typophile.com/forums/clipart/happy.gif) ]\n\n"
    },
    {
      "time": "8 Apr 2004 — 2:29pm",
      "content": "\\> I've yet to find an appropriately large and varied corpus   \n   \nIn terms of word frequency a large corpus is important, but in terms of letter frequency a surprisingly small corpus will generally be very accurate. BTW, what do you use for \"processing\" the textual data?   \n   \nMana-16: I wonder if your gamma is unusually high. Anyway, Mana-13 will be coming out any day now, and it's more \"conservative\" (mostly because the stems are 1-pixel). As for ClearType, if you like it, then just wait for _handmade_ ClearType fonts! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 3:29pm",
      "content": "Pat Chirapravati, who is associated with the museum and is contributing to the catalogue, says that both the more traditional top line and the more modern second line are pleasant, clear, and easy to read. Her only criticism is that some of the characters are too close together. She says they should never touch or come close to touching.   \n   \nShe also asks, how can we get a copy of the typeface?\n\n"
    },
    {
      "time": "8 Apr 2004 — 3:32pm",
      "content": "\\> She says they should never touch or come close to touching.   \n   \nWhy not?   \n   \n\\> how can we get a copy of the typeface?   \n   \nDunno - that was a scan from a newspaper - sorry.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 4:06pm",
      "content": "\\> Why not? Just a cultural convention, as I understand. I don't think it's an issue of legibility, although it does seem consistent with the shapes, which seem to want to breathe.\n\n"
    },
    {
      "time": "8 Apr 2004 — 4:08pm",
      "content": "\\> Just a cultural convention   \n   \nSo loose spacing is a cultural convention but traditional letter structures is not?   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 4:28pm",
      "content": "Tom, I think the top face is Quakerlady from UPC, and the second is Sathorn from DB. Where to go about finding them...I've no idea.   \n   \n\\>some of the characters are too close together.   \n   \nDo you know if she's talking about _sara e_? If I'm not mistaken, _sara e_ attaches to the consonant after it. In these examples it's colliding with the consonant before - which doesn't make much sense.\n\n"
    },
    {
      "time": "8 Apr 2004 — 7:05pm",
      "content": "Hrant,   \n   \nHere is a small study made by some friends a while ago. The result is cryptic in terms of encoding.   \n   \n [http://linux.thai.net/Members/poonlap/tmp/thaichar\\_freq.png](http://web.archive.org/web/20150313162933/http:/linux.thai.net/Members/poonlap/tmp/thaichar_freq.png)   \n   \nThe graph is a histogram of the character number _in hexdecimal_ in tis620 (iso8859-11) encoding, I beleive. The most frequent letter is _sara aa_ which is the character D2. The raw data that he used is attatched below and you can find a sample tis620-encoding here:   \n   \n [http://thaigate.nii.ac.jp/refer/tis620.gif](http://web.archive.org/web/20150313162933/http:/thaigate.nii.ac.jp/refer/tis620.gif)   \n   \nIf you need the data in another form e.g. glyph-frequency, please let me know.\n\n<!--attachment: tis620_histogram-32984.txt*mime_txt.gif*text/plain*1.1*Histogram+of+thai+letters*tis620_histogram%2etxt --><!--attachment: tis620_histogram-32984.txt*mime_txt.gif*text/plain*1.1*Histogram+of+thai+letters*tis620_histogram%2etxt -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150313162933im_/http:/www.typophile.com/forums/icons/mime_txt.gif\" align=\"left\" alt=\"text/plain\">Histogram of thai letters<br><a href=\"http://web.archive.org/web/20150313162933/http:/www.typophile.com/forums/messages/4100/tis620_histogram-32984.txt\" target=\"_blank\"><b>tis620_histogram.txt</b></a> (1.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "8 Apr 2004 — 9:27pm",
      "content": "Wow, this is great! Thank you. And looking at the raw data, the corpus looks to be plenty huge.   \n   \nA couple of questions:   \n1) What's that complex character at DC?   \n2) For the floating accents (like in the range D4-DA and elsewhere), how does one predict how much above/below the main letter they will end up being placed? What base letters do they add on to? And can they double/triple up? What I'm trying to figure out is how much height/depth they can add to the vertical span of a Thai line (both typically and in extreme cases).   \n   \nAgain: thank you!   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 9:40pm",
      "content": "OK, looking a little bit closer, I can see that accents can double-up. Questions:   \n1) Which accents can double-up?   \n2) Can they _triple_ up?   \n3) When accents double-up, are there rules of relative placement?   \n4) Would it be offensive to shorten the base character when an accent (or two) is added?   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2004 — 1:59am",
      "content": "1. In Thai, letter can have a combination of a vowel mark and a tone mark.   \n2. Not for Thai, but I'm not sure if there might also be other, minority languages that use the script, and which might have different orthographic norms.   \n3. The placement of both is determined relative to the right-side vertical of the letter. However, in practical terms e.g. in OpenType GPOS positioning, the upper mark in a stack is positioned relative to the lower mark (\\<mkmk\\> feature), which in turn is positioned relative to the letter (\\<mark\\> feature).   \n4. Yes.\n\n"
    },
    {
      "time": "9 Apr 2004 — 2:02am",
      "content": "_BTW, what do you use for \"processing\" the textual data?_   \n   \nThe very excellent text editor [UltraEdit](http://web.archive.org/web/20150313162933/http:/www.ultraedit.com/) has a count feature in its search function, which is handy for counting occurences of individual characters, pairs, combinations of base characters and marks, etc.\n\n"
    },
    {
      "time": "9 Apr 2004 — 3:37am",
      "content": "Hrant & John,   \n   \nMy friend told me that the data were collected from Thai web pages, mostly news, from a few years back.   \n   \n\\>1) What's that complex character at DC?   \n   \nThat's the work-break (zero-space) character written in Thai, sorry. It's quite important, at least for the moment, in technical implementation for line breaking and justification. Because a sentence in Thai is written without any space, therefore to break a like at an appropriate place, without breaking a word, is difficult -- it still is an active research area. A few people/programs are using external helper who knows about thati words, to insert the word break with H&J engine so that Roman H&J engine can be used straight forwardly.   \n   \nOnly tone marks can double up, sometimes we have multiple slots for the same glyph (think Type 1), in order to accomodate the typograpical need i.e. top vowels have two variants: a normal position and a left-shifted position for letters like BB, BD, and BF; tonal marks have four variants, a normal position for combining with the top vowels , a lower position when combined with the normal consonants, and two left-shifted position.\n\n<!--attachment: thaisample-33009.pdf*mime_pdf.gif*application/pdf*7.0*Thai+samples*thaisample%2epdf --><!--attachment: thaisample-33009.pdf*mime_pdf.gif*application/pdf*7.0*Thai+samples*thaisample%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150313162933im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Thai samples<br><a href=\"http://web.archive.org/web/20150313162933/http:/www.typophile.com/forums/messages/4100/thaisample-33009.pdf\" target=\"_blank\"><b>thaisample.pdf</b></a> (7.0 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\n_John:_ if I am going to process the data, I probably would write a little program to batch read a the text data; then feed it to a statistical package or process the data myself.\n\n"
    },
    {
      "time": "9 Apr 2004 — 8:40am",
      "content": "\\>So loose spacing is a cultural convention but traditional letter structures is not?   \n   \nI am an advocate of tight letterspacing (for but most typefaces, as long as the word space is also tight,) but since when is it \"traditional\" for letters to actually crash, as some of the characters in these samples seem to do?   \n   \nMoreover, as far as \"tradition\" goes, it is arrogant to apply Western traditions to non-Western languages. Traditionally, East Asian characters, for example, have very well defined spaces, far greater than in Western traditions. (Of course I realize there are \"grass\" styles that are roughly the equivalent of cursive scripts in Western writing.)   \n   \nI am not expert on Thai language or culture, and so I must defer to those who are.\n\n"
    },
    {
      "time": "9 Apr 2004 — 8:54am",
      "content": "\\>Do you know if she's talking about sara e?   \n   \nNathan, thanks for the lead on the typefaces. Pat is not around to ask anymore, but she pointed out the lack of space between the fifth and sixth characters in the top line (resembling \"bi\") and the eighth and ninth characters in the second line (resembling \"ak\").\n\n"
    },
    {
      "time": "9 Apr 2004 — 9:26am",
      "content": "Nathan, Tom: yes, that's _sara e_ on the first line who touches the previous consonant.\n\n"
    },
    {
      "time": "9 Apr 2004 — 9:46am",
      "content": "\\> The placement of both is determined relative to the right-side vertical of the letter.   \n   \nIs it offensive to move the second (higher) mark to the left of the first one, to save vertical space? \"Native\" answers preferred. :-) Non-natives can certainly have a lot of knowledge about a script (like John clearly does), but it's much harder for them to have an implicit, \"foundational\" sensitivity. So Chanop, if you can answer this question (as well as my previous #4) that would be great. (Anybody else can answer too, of course!)   \n   \nUltraEdit: I actually have it installed, but didn't realize it can do all that!   \n   \n--   \n   \nChanop, about the DC character: why is it missing from the Unicode Thai encoding? And why is its count so low in the stats?   \n   \n\\> a normal position and a left-shifted position   \n   \nSo how offensive would it be to simply align the tone marks to the left whenever a (floating) vowel mark is already deployed?   \n   \n--   \n   \n\\> since when is it \"traditional\" for letters to actually crash   \n\\> it is arrogant to apply Western traditions to non-Western languages.   \n   \nBut then what about that second line?! I agree with your stance, and that's exactly why I'm confused that a person wouldn't mind hyper-latinized letterforms but would mind hypothetically latinized spacing...   \n   \nPlease ask this of Ms Chirapravati if you can.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2004 — 11:37am",
      "content": "\\> Is it offensive to move the second (higher) mark to the left of the first one?   \n\\> Would it be offensive to shorten the base character when an accent (or two) is added?   \n\\> So how offensive would it be to simply align the tone marks to the left whenever a (floating) vowel mark is already deployed?   \n   \nYes, those would probably be a totally new way of writing Thai script ;-) I think it's orinigal, but Thai people probably have some problems reading it. One may think that it is a creative ads.   \n   \n0xDC in iso8859-11 is 0x200B _zero width space_ in the unicode chart; therefore it is not there in Thai specific one. The souce for the corpus came from html, so I guess those page were not using it at all or use a tag _wbr_ instead. I could imagine some white noise in the data set as well.\n\n"
    },
    {
      "time": "9 Apr 2004 — 12:14pm",
      "content": "Hrant, I see better now what you are getting at. I'll see what I can find out (if anything).   \n   \nJust as a conjecture: could cultural restrictions against inappropriate touching, which can sometimes be rather elaborate, influence the perception of type?   \n   \nAlong these lines, it might be interesting to see if there is elsewhere any correspondence between cultural attitudes to personal space and attitudes to spacing of type.   \n   \nMy guess is that any such analysis would be difficult or impossible because of the number of factors that come into play, and I can't say that any obvious correlation in Western type jumps out at me.   \n   \nFor example, on average northern Europeans might demonstrate a greater ideal personal space than southern Europeans, but economic demands might nonetheless mandate tighter spacing.   \n   \nStill, you would expect ideas about space to affect many kinds of cultural expression (architecture, for example) and consequently to affect typography as well. Somehow I am having trouble seeing this very clearly, however.   \n   \nI suppose analphabetic languages would have a different set of rules.\n\n"
    },
    {
      "time": "9 Apr 2004 — 12:29pm",
      "content": "\\> could cultural restrictions against inappropriate touching, which can   \n\\> sometimes be rather elaborate, influence the perception of type?   \n   \nI think so, yes.   \nOn the other hand, Arabic is the language of Islam! :-)   \n   \nI think a greater cultural factor in touching or not is a culture's tendencies towards control, or Modernism. Westerners for example tend to like compartmentalized things which are easier to analyse, so they invented Greek writing with no ligatures.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2004 — 12:36pm",
      "content": "\\> One may think that it is a creative ads.   \n   \nDo you think it might be more OK in a bitmap font (for onscreen use)?   \n   \nhhp\n\n"
    }
  ]
}
