{
  "id": "41457",
  "title": "Graphic Design Logotype",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Here is a logotype for my graphic design identity I have been working on. It is hand lettered and I wanted something simple, geometric and sans-serif with art deco undertones. It is shown in basic black and white, large and small to allow for examination of the letterforms.\n\nPlease let me know what you think.\n\nThanks,  \nJay\n\n ![](http://web.archive.org/web/20081024203541im_/http:/typophile.com/files/eyesopentype_3954.jpg)\n\n [‹ Logo Critique: Red Hot Property](http://web.archive.org/web/20081024203541/http:/typophile.com/node/46031 \"Go to previous forum topic\") [Wiki Logo Critique ›](http://web.archive.org/web/20081024203541/http:/typophile.com/node/46412 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081024203541/http://typophile.com/user/4974\" title=\"View user profile.\">jayyy</a>",
  "time": "<br>",
  "uid": "4974",
  "comments": [
    {
      "time": " 28.Jan.2008 11.44am",
      "content": "The curves of the S fall flat compared to the P and the O. open up the spine on the top and bottom so they aren’t so pointy and in keeping with the geometric goal.\n\n"
    },
    {
      "time": " 28.Jan.2008 11.45am",
      "content": "I also wonder if the terminals of the S should be horizontal rather than the 30º.\n\n"
    },
    {
      "time": " 28.Jan.2008 12.11pm",
      "content": "Arlo is dead on about the S. I think you could add a little more overshoot to the N. The middle horizontal stroke of e is really bugging me; it’s the combination of it hanging so low and being so long that it draws attention from th other letters. Also, I think the curves on P are a little too tight to fit with the O, try rounding it out some more.\n\n"
    },
    {
      "time": " 28.Jan.2008 7.55pm",
      "content": "Really excellent advice all around. I need some objective and fresh eyes. I have looked at it for too long.\n\nThe ’S’ was bothering me a bit but I was not sure if it was just me. Arlo: what do you mean by ’open up the spine’?  \nThe terminals on the ’S’ I really like being at 30’s - especially since it feeds into the ’E’ on the lower terminal.\n\nJames: I was afraid that raising the middle stroke on the ’E’ would look like it was almost centered, but not quite. It also has to work with the ’P’ which I would not want to raise the top any more (sorry for the lack of type terminology). You are spot on about the loop in the ’P’ though.  \nThe ’N’ is a bit narrow I agree.\n\nAny more crit welcome.\n\n"
    },
    {
      "time": " 18.Feb.2008 10.46pm",
      "content": "Sorry for the delayed response. Life has a way of getting carried away.\n\nIf you look at the inside left curve at the top of the S and the inside right curve at the bottom, they don’t feel circular. If you open up those counter spaces it will bring the S to a more comfortable place in relationship to the O and P.\n\n"
    },
    {
      "time": " 20.May.2008 11.07am",
      "content": "OK - Sorry for the double post guys - I final;ly found the original thread. I am currently working on the redesigned version using all the above advice.\n\nWas just wondering if any lurkers had 2 cents to add as I work?\n\nThanks,  \nJay\n\n"
    },
    {
      "time": " 20.May.2008 1.10pm",
      "content": "Here’s the reworked type:\n\n ![](http://web.archive.org/web/20081024203541im_/http:/typophile.com/files/eyesopennew_3531.jpg)\n\nI have shortened the crossbar on the ’E’ to make it less noticeable. The ’S’ has been reworked to make it more circular and so has the ’P’. Finally, I have extended to ’N’ to give it more visual symmetry.\n\nAs always, your input and advice would be appreciated.\n\n"
    },
    {
      "time": " 20.May.2008 1.37pm",
      "content": "Hmmm, I would just buy Christian Schwartz’s Neutraface, you will get a well drawn typeface that way.\n\n"
    },
    {
      "time": " 20.May.2008 1.40pm",
      "content": "Sorry Jayyy, but Höfe is pretty much right. You could also start with Futura & modify as necessary.\n\n—K\n\n"
    },
    {
      "time": " 20.May.2008 2.15pm",
      "content": "Neutraface is awesome and obviously was the starting point for this. I do not own Neutra though so this is all hand drawn. Because of this it is even more geometric with less minor modifications than Neutra which has to work as a complete typeface and not just a logotype. I needed higher crossbars - but not centered. I needed a perfectly circular ’O’ and a bigger ’P’ that looks more like the ’O’. The ’S’ is also a little too closed in Nuetra AND - I got no cash to buy expensive type :)\n\nFutura was never a consideration - but the first face I thought of when I thought of this.\n\nI really want this to work and not because I will not buy Neutraface - it’s not quite right for what I want. I have given it a lot of consideration.\n\nMy biggest worry is that like what you say Hofe and Kris - I have in some way drawn a ’bad’ logotype. I don’t want to spend endless time working on a logotype which people will look at and say “why didn’t you just buy Neutraface?”\n\n"
    },
    {
      "time": " 20.May.2008 2.26pm",
      "content": "Don’t give in to Neutraface. although it’s a beautiful face, nothing beats hand lettered type. Keep working it until you have something unique. I would try adding the slightest bit of stress to your strokes. that will move it away from the pure geometry of Futura and Neutra and give it a bit more handcrafted feel. But keep it subtle you don’t want to end up with Optima.\n\nLance Kagey, Beautiful Angle.\n\n"
    },
    {
      "time": " 18.Jun.2008 12.25pm",
      "content": "How did this ever turn out Jay.\n\nLance Kagey, Beautiful Angle.\n\n"
    },
    {
      "time": " 19.Jun.2008 4.15pm",
      "content": "Still working on it Lance. I got a little distracted as I started to work on concepts for web. I will definitely upload revisions when complete (next week).\n\nI would still love anyone’s two cents on this (good or bad). I understand that to some of you this may seem like re-inventing the wheel, but I would still like to hear that if that is all. Even better would be any ideas on issues with the letterforms.\n\nRight now I see some issues with the optical width of the top and bottom strokes on the ’S’.\n\nMany thanks,  \nJay\n\n"
    },
    {
      "time": " 19.Jun.2008 7.25pm",
      "content": "I really like this, but the S is still nowhere near done. It looks like the halves of two entirely different esses stuck together.\n\n"
    }
  ]
}
