{
  "id": "41467",
  "title": "Band Font - THE DREI",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi there,\n\nI am recently creating a font for a band. Their name is \"the drei - gottes vorband\" which means \"the three - god's support act\". Don't be distracted by the name, it's nothing religious.  \nThe band's concept is having fun with funny lyrics and being a wannabe rock musician without really knowing how to play their instruments.\n\nThis is why I made it look rough and not precisely elaborated. Which kind of music would you associate it with? I'm doubting a little, that it fits with rock music.\n\nWhat do you think so far?\n\nThanks,  \nDirk\n\n ![](http://web.archive.org/web/20150417045320im_/http:/typophile.com/files/TheDrei-Schrift_3542.jpg)\n\n",
  "author": "Alfred",
  "time": "28 Jan 2008 — 4:51pm",
  "uid": "26453",
  "comments": [
    {
      "time": "28 Jan 2008 — 4:56pm",
      "content": "The main potential problem with this design is that it might be useless in a few months when the [fat font fad](http://web.archive.org/web/20150417045320/http:/typophile.com/node/42643) fades.\n\n"
    },
    {
      "time": "28 Jan 2008 — 6:07pm",
      "content": "This is great!\n\nIt makes me think of Leningrad Cowboys or Six-String Samurai or The Monks -- like a avant-garde punk band that came out of Eastern Europe or Communist Russia in the late Sixties.\n\nThe R is my favorite and the I, S, and Z are particularly nifty.\n\nI want to see the numbers!\n\nWhen/where can we download this font once it's done?\n\n-matt\n\nP.S. And don't worry about this looking useless -- even if it was _just_ catering to a fad, which it isn't, the fat font fad comes back around every few years. :)\n\n"
    },
    {
      "time": "29 Jan 2008 — 4:16am",
      "content": "Thanks for your comments,\n\nI see, that it follows a fad. But this in no reason to stop doing experiments.\n\nI don't think, that this font will be downloadable too soon. This version is created in Illustrator. I don't have any experience with Fontlab or other font-tools.  \nBut maybe it's done, when there will be the next fat font fad...\n\nThose are the numbers:\n\n ![](http://web.archive.org/web/20150417045320im_/http:/typophile.com/files/TheDrei-numbers_4867.jpg)\n\n"
    },
    {
      "time": "29 Jan 2008 — 6:42am",
      "content": "\"fat font fad fades\"\n\nJust wanted to repeat that as it's so fun to say.\n\nYea, it's fat, but still fairly unique, IMHO. I like it.\n\n"
    },
    {
      "time": "29 Jan 2008 — 9:13am",
      "content": "I think that the two diagonal sides of the 7 (and the ?, Z, and S) are at slightly different angles. That looks odd.\n\nCould you post a high-resolution version or a PDF? I might be able to notice more quirks like that if you do.\n\n-matt\n\n"
    },
    {
      "time": "29 Jan 2008 — 11:30am",
      "content": "I like! Very much so!\n\n"
    },
    {
      "time": "1 Feb 2008 — 1:34pm",
      "content": "I can't see the letters (CMYK image perhaps?) but the numbers are super cool.\n\n- Lex\n\n"
    }
  ]
}
