{
  "id": "41488",
  "title": "The line between Modern and Scotch",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "When I hear the term <cite>Modern</cite> in the context of a typeface design, a very clear image of what that looks like comes to mind. I also associate it with its own history, geography, etc.\n\nThe same goes for the term <cite>Scotch</cite>.\n\nHowever – undoubtedly because the latter evolved partially from the former – there are many typefaces which I might term either way. In my head there is this kind of scale between Modern and Scotch that looks something like this:  \n|Modern———|—overlap—|———Scotch|\n\nSo, my question (lightly aimed at Nick Shinn) is this: What are the lines between Scotch and Modern? Are all Scotches (Scotts?) necessarily Moderns? At what point is a typeface beyond-a-doubt Scotch or non-Scotch?\n\nKnowing a typeface’s origins and design history tends to bias my distinction on a case-by-case basis, so I’d be curious to get more of an understanding from a purely formal approach. Specific examples would help a lot too.\n\nPerhaps this is an issue that can’t be nailed down with 100% precision, but if it could, I’m sure it would happen here.\n\n [‹ Helvetica on Digg](http://web.archive.org/web/20081009035806/http:/www.typophile.com/node/41277 \"Go to previous forum topic\") [buying a type face?? ›](http://web.archive.org/web/20081009035806/http:/www.typophile.com/node/41537 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081009035806/http://www.typophile.com/user/15263\" title=\"View user profile.\">Nick Sherman</a>",
  "time": "<br>",
  "uid": "15263",
  "comments": [
    {
      "time": " 29.Jan.2008 3.31pm",
      "content": "The characteristics of the Modern (Didone) style are:\n\nHigh contrast  \nVertical stress  \nUnbracketed serifs\n\nThe class of Scotch types meets the first two criteria, but its adherence to the third varies.\n\nThe Scotch has bracketed serifs.\n\nThere are two ways of looking at this—strictly taxonomic (i.e. what the physical features are), or philogenic (how they evolved).\n\nSo we have the Panose system, with\n\ncove  \nobtuse cove  \nobtuse square cove  \nsquare cove  \nsquare\n\nwhich are taxonomic\n\nand IBM with\n\ntransitional  \nmodern (didone)  \nclarendon  \nslab\n\n\\*\\*\n\nSome wrinkles:\n\nThe Century styles are Scotch, but in headline faces they tend towards modern, and in text, towards slab.  \nTimes Roman has Scotch capitals, but not lower case—except in the bold. Bit of a mash-up.  \nPress gain on letterpress text gives the impression of subtle bracketing.\n\nWhen Richard Austin, inventor of the Scotch, started his own foundry, he addressed the problem of easily damaged type by coming up with what I term the Scotch Modern — the style with huge, fine serifs and tiny aperture. The brackets are so attentuated that they thin out, becoming didone-like. It was that style of type which was first termed “modern” in the late 19th century, not Bodoni, which had yet to be revived, and which is probably now considered most typically “modern”.\n\nSo, as the distinction between Modern and Scotch rests on the degree of bracketing, the degree of “Scotchness” of a particular typeface may vary with both its optical size, and the foundry that produced it.\n\nFor instance, consider these four faces. Pretty similar, eh?  \nYet De Vinne is generally considered a Modern, Georgia and Century Scotch, and Clarendon a slab serif.\n\n ![](http://web.archive.org/web/20081009035806im_/http:/www.typophile.com/files/Scotched_5769.jpg)\n\n"
    },
    {
      "time": " 29.Jan.2008 4.15pm",
      "content": "And does neoclassical cover these styles and stop at slab? Good thread, good explanation.\n\n"
    },
    {
      "time": " 29.Jan.2008 6.23pm",
      "content": "Yeah, thanks for this thread and the explanation.\n\n"
    },
    {
      "time": " 29.Jan.2008 7.15pm",
      "content": "Interesting… so then it’s all about the bracket?\n\nWould that make [Monotype Modern](http://web.archive.org/web/20081009035806/http:/www.myfonts.com/fonts/adobe/monotype-modern/) technically not a strict Modern but a Scotch Modern?\n\nIt’s funny because over time, my hyper-simplified technique was to just look at the cap R, and depending on the upstroke at the end of its leg, I would make my distinction. Anything with an extreme flip (à la [De Vinne](http://web.archive.org/web/20081009035806/http:/www.myfonts.com/fonts/bitstream/de-vinne/)) I labeled as Scotch and reserved <cite>Modern</cite> for the earlier French originals. I think perhaps my assumption of what was typically Scotch was what you refer to more as Scotch Modern… those exaggerated Austin-esque versions which just scream <cite>Victorian</cite>. For whatever reason, I was lumping those faces in with the sturdier, less exaggerated Scotches like [Miller](http://web.archive.org/web/20081009035806/http:/www.myfonts.com/fonts/fontbureau/miller/).\n\nPerhaps my scale should look something more this this:  \n|Didone——|—Modern—|—Scotch Modern—|——Scotch|\n\n?\n\nIs it appropriate to separate Didone from Modern?\n\nI’d also be curious to know where you would place something like [Zooth](http://web.archive.org/web/20081009035806/http:/www.myfonts.com/fonts/intellecta/zooth/) (for lack of a better example) – the Moderns with ridiculously large (but still unbracketed) serifs.\n\n"
    },
    {
      "time": " 29.Jan.2008 9.20pm",
      "content": "_Would that make Monotype Modern technically not a strict Modern but a Scotch Modern?_\n\nThat’s my view, and I do think the nature of the Scotch is open to interpretation.  \n19th century typography generally hasn’t been given critical respect or attention, so there is still much to be discussed and theorized.\n\nHoefler & Frere-Jones, in the blurb for their [Chronicle,](http://web.archive.org/web/20081009035806/http:/typography.com/fonts/font_overview.php?productLineID=100032) consider the Scotch to be Transitional.\n\nWhat then does that make typefaces like Century or De Vinne, with their enormous serifs and pot-hooks on a and R?  \nThey’re not modern, in the sense that they don’t have the Modern’s openness and reductive simplicity.  \nAesthetically, they are between Oldstyle and Modern, but they are not transitional, as we understand that as meaning “on the way to”.  \nThey follow on from the first Modern types of Didot and Bodoni, but we can’t call them Post-Modern — too 20th century.  \nSo that’s why I’ve suggested Scotch Modern as a term for this genre.\n\n"
    },
    {
      "time": " 29.Jan.2008 11.20pm",
      "content": "Interesting read. Thanks, Nick!\n\n"
    },
    {
      "time": " 30.Jan.2008 8.20am",
      "content": " ![](http://web.archive.org/web/20081009035806im_/http:/www.typophile.com/files/bassoon_scotch_4240.jpg)\n\n"
    }
  ]
}
