{
  "id": "41482",
  "title": "Contact Information Layout",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm working on a piece that has multiple levels of contact information.\n\nThe largest that I've come across is set up this way:\n\nName\\* - Bold  \nTitle\\* - Small Caps Bold  \nProgram Title - Medium  \nBuilding/Department  \nAddress  \nAddress  \nAddress  \nPhone Number\\*  \nInternal Phone Number\\*  \nFax Number\\*  \nInternal Fax Number\\*  \nEmail\\*  \nWeb Address\n\n\\*Most common contact information.\n\nStructurally, what would be a good way to layout this out. I've used tables in the past to align all the phone numbers and email address, where I'd use the titles \"phone\", \"dsn\" (internal phone), \"fax\" , \"email\" would be in the right column and the numbers and address in the left column.\n\nI tend to Bold the Name and Small Caps Bold the Title everything else is Medium or Normal weights.\n\nAlso, what's the norm for laying out phone numbers and emails. I tend to used the (000) 000-0000 and emails are always lowercase [user@site.com](mailto:user@site.com). Is there any tracking standards?\n\nI hope that isn't too confusing. Thanks.\n\n",
  "author": "AndrewSipe",
  "time": "29 Jan 2008 — 7:44am",
  "uid": "6496",
  "comments": [
    {
      "time": "30 Jan 2008 — 7:23am",
      "content": "Are we talking business cards here? That is a lot of lines, and I would work out some way to minimize them. Can you get the address down to two lines ... one for the street related bits, and the other for city, state, code, country, etc. Phone numbers can also be placed two or more per line. As for whether to align or otherwise, that is a design decision, not something you want to standardize. Sometimes it will work best aligning the second phone number on a line to something, other times, not so much.\n\nAs for phone numbers, I tend to use your example, but many designers are now omitting the brackets and/or hyphens. I have seen center dots replacing the hyphens as well.\n\n"
    },
    {
      "time": "30 Jan 2008 — 7:33am",
      "content": "No, not business cards. It's all part of my fact sheet hoopla. Most of the contact information is related to military installations, which could have 4-5 lines just for the address. I'd like to be able to par it down, but since I'm not providing the content, I have to work with what is provided.\n\nI just wanted an idea of an ideal layout. I'm currently fitting everything into a small box in the bottom corner of the fact sheet.\n\nMy inexperience is showing quite a bit with this project. Plus, since these are for the military, being creative isn't a positive. This would be easier if I had a style guide to follow with rigid parameters.\n\n"
    }
  ]
}
