{
  "id": "41502",
  "title": "Need Logo Help",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m working on a logo for a federal consulting company, who is moving into more software development and need a modern, solid logo. The more I tried creating a symbol the more I realized they only need a wordmark.\n\nI’ve played with some ideas and have found two faces that I think I can work from. Looking over the attached image do you feel that either of these faces will work. Which ones do you prefer. Can you think of similar typefaces I may want to checkout, or any other comments are all welcome\n\nI am at square one.\n\nThings I’m thinking right now:  \n1,2,4,5 need to be thinned out slightly  \nI need to work on kerning.  \nI think most of the cuts in the L look a bit silly.\n\n| Attachment | Size |\n| --- | --- |\n| [LogoChoice.gif](http://web.archive.org/web/20081007191447/http:/typophile.com/files/LogoChoice.gif) | 10.05 KB |\n\n [‹ Logo Critique for a Carpenter's Brand](http://web.archive.org/web/20081007191447/http:/www.typophile.com/node/41516 \"Go to previous forum topic\") [Logo Advice please ›](http://web.archive.org/web/20081007191447/http:/www.typophile.com/node/41546 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007191447/http://www.typophile.com/user/4114\" title=\"View user profile.\">voiceof</a>",
  "time": "<br>",
  "uid": "4114",
  "comments": [
    {
      "time": " 29.Jan.2008 5.58pm",
      "content": "Great job! Like it a lot!\n\nI do prefer 1 and 5. Or maybe something in between 1 and 5... the L with a smaller curve.\n\n———————————————————————————:  \nJean Chouinard (formerly emerjean on Typophile)\n\n"
    },
    {
      "time": " 30.Jan.2008 1.53am",
      "content": "In the first four examples, the bowl of the Y is too big, and it’s quite distracting to my eye. The descender, by comparison, looks stunted and withering.\n\n"
    },
    {
      "time": " 30.Jan.2008 6.33am",
      "content": "I knew something about the y seemed off. I can do some things with the descender but I’m not sure how to approach the bowl of the y.\n\nany suggestions... i.e. change the angle etc...\n\nThanks\n\n"
    },
    {
      "time": " 30.Jan.2008 10.30am",
      "content": "I’ve modified it slightly. I still think it should be thinner and maybe more angular. Any thoughts are appreciated.\n\n ![](http://web.archive.org/web/20081007191447im_/http:/www.typophile.com/files/LogoChoice_6065.gif)\n\n"
    },
    {
      "time": " 30.Jan.2008 4.43pm",
      "content": "something about those “E’s” seems off, but i’m definitely into the reduced curve on the “L”.\n\n"
    },
    {
      "time": " 30.Jan.2008 8.17pm",
      "content": "The y looks better, but not quite balanced yet. The axis needs to be higher, maybe?\n\nOverall, to my eye, balance is a problem. The width of the c, o and e are all too different to work together. The e looks like the nose was pulled out like taffy. The c feels like it was sliced off in a paper cutter, and it’s optically a bit taller than the o.\n\nI do like the shapely l, and personally, I’d try that effect elsewhere in the mark for unity. I’d also use just black and white while designing, but maybe that’s just me.\n\n"
    }
  ]
}
