{
  "id": "41516",
  "title": "Logo Critique for a Carpenter's Brand",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello, I was hoping I could get some new eyes on this logo. I think it is pretty close to being done, but any critiques would be very welcome.\n\nA little background on the company:\n\n1) First off, I did not choose the name of the company. It still urks me.  \n2) The company specializes in ceilings of all sorts, but also does woodwork (such as carpentry, cabinetry, and other wood-related practices)  \n3) The guy has been doing this stuff since about 1970 and is very traditional in his approaches.\n\nI obviously tried to encompass these traits and really work to convey a traditional, old-style, blue-collar feel.\n\nAgain, please let me know what you think, be it general or specific.\n\nThanks very much for looking!\n\n| Attachment | Size |\n| --- | --- |\n| [Ceiling-Logo.png](http://web.archive.org/web/20080924161340/http:/typophile.com/files/Ceiling-Logo.png) | 40.13 KB |\n\n [‹ Web Design Business Logo](http://web.archive.org/web/20080924161340/http:/www.typophile.com/node/38426 \"Go to previous forum topic\") [Need Logo Help ›](http://web.archive.org/web/20080924161340/http:/www.typophile.com/node/41502 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924161340/http://www.typophile.com/user/17134\" title=\"View user profile.\">cmcd</a>",
  "time": "<br>",
  "uid": "17134",
  "comments": [
    {
      "time": " 30.Jan.2008 8.09am",
      "content": "I’ve seen this elsewhere...this appears to be a nice progression to this point. I agree, silly name, but you’ve done well with what you have to work with.\n\nIt literally says ’ceilings’ but the look and feel certainly give a nice craftsmanship feel to acknowledge the greater service offerings.\n\nOnly major thing is that the ’S’ in ceilings appears optically larger, even though I’m sure it’s not. You might want to fudge the size of that a bit to bring it in balance.\n\n"
    },
    {
      "time": " 30.Jan.2008 9.19am",
      "content": "Exactly what I thought.\n\nMake the fatter stroke on the ’S’ narrower to optically match the rest. I think the ’C’ is probably OK.\n\n"
    },
    {
      "time": " 30.Jan.2008 12.00pm",
      "content": "Thanks for the feedback guys.\n\nAnd you’re right Darrel, you have seen it before. A long, long time ago. I think it progressed really well though with some new direction.\n\nI’ll look at modifying the ’S’.\n\nThanks very much!\n\n"
    },
    {
      "time": " 31.Jan.2008 6.58am",
      "content": "I think it’s great! I see the “S,” too. Since I’ve been coming here for help, I’d love to know how long it took you to do this and if you just tried it in Illustrator / Paint, etc. or if you drew it on paper first. I love the ornamental touch to the lines.\n\n"
    },
    {
      "time": " 31.Jan.2008 12.21pm",
      "content": "This isn’t a comment on the type... which as been addressed ad-nauseum. First off, this is a very elegant looking design, and would look fabulous as a wood etched sign. Two things jumped out at me.\n\nFirst, the border is very nice, but it’s also very heavy and compared to the weight of the text, seems almost too heavy. My eye is drawn to it almost immediately. This almost give the text inside a very trapped feeling to it.\n\nSecond, is more of a nit-picky issue. The rounded corners of the border, though keeping with the soft look of the inner stroke, seems too soft. I think sharp corners would play against the softness of your detail better.\n\nThose are my opinions, either way, you have a nice design going for this.\n\n"
    },
    {
      "time": " 31.Jan.2008 3.49pm",
      "content": "Thank you all for the great critiques. It’s really great to have such good, critical looks available. So that you all very much.\n\nI am actually going to try sharper corners. I’m not sure if I want them to be square, as part of the concept was that it was to look like it was an old-school wood routed sign, but maybe a little less rounded. Thanks!\n\nKristi, to answer your question: all told, this logo probably took about 10 hours of work, not including visual research and planning. And unfortunately, for this one, I did not start by sketching, although I went back to it a couple times. Part of my process is to get jobs, really dig into researching them -visual and otherwise- then let them simmer for a while. In this case what took so long was that the company name is very, very vague and hard to work with, so I got trapped into thinking that I could make it whatever I wanted, which was not the case. When I went back and thought about the founder, the work and what the company actually did I realized the name was just that: a name; and that the actual look and direction for the design was better predicated by those other factors, and not on the name itself.\n\n"
    }
  ]
}
