{
  "id": "41523",
  "title": "Purchasing DTL Dorian. What do you think?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I like DTL Dorian very much and thinking of buying it. I want to use it in a variety of material. Is it worth it?\n\n [‹ maybe a stupid question about fontlab](http://web.archive.org/web/20081203221431/http:/www.typophile.com/node/41633 \"Go to previous forum topic\") [Old Emerson Typeface ›](http://web.archive.org/web/20081203221431/http:/www.typophile.com/node/15269 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203221431/http://www.typophile.com/user/18568\" title=\"View user profile.\">technique</a>",
  "time": "<br>",
  "uid": "18568",
  "comments": [
    {
      "time": " 30.Jan.2008 12.54am",
      "content": "I think it will be difficult to find someone who has Dorian. DTL license holders are rare, and Dorian isn’t often discussed (nor purchased, I assume).\n\n[Elmo van Slingerland](http://web.archive.org/web/20081203221431/http:/www.typophile.com/wiki/Elmo%252Bvan%252BSlingerland) may be the best type designer name of all time.\n\nYou might also dig [FF Quadraat](http://web.archive.org/web/20081203221431/http:/www.fontshop.com/fonts/downloads/fontfont/ff_quadraat_ot/), which has a similar Dutch pedigree but is perhaps less delicate.\n\n"
    },
    {
      "time": " 30.Jan.2008 1.18am",
      "content": "<cite>I want to use it in a variety of material.</cite>\n\nI assume you know that DTL is very good at providing PDF specimen of their fonts … the [one for Dorian](http://web.archive.org/) contains 62 pages!\n\n<cite>Elmo van Slingerland may be the best type designer name of all time.</cite>\n\nHear ye! ;°)  \nFirst time this guy’s name is mentioned on typophile …  \nOutperforming Rodney Shelden Fehsenfeld.\n\n"
    },
    {
      "time": " 30.Jan.2008 1.52am",
      "content": "You seem to be able to buy it directly from DTL themselves, though it is not available in Open Type I noted.\n\n"
    },
    {
      "time": " 30.Jan.2008 2.36am",
      "content": "Hi Thanks for the comments.\n\nSo are you saying that designers rarely use this type or they simply do not purchase a licence?\n\nYeas I have seen the specimens, very good.\n\nAlso was looking at Documenta. I think they are lovely types.\n\n"
    },
    {
      "time": " 30.Jan.2008 5.54am",
      "content": "I think it’s mostly because of the price that is it not widely licensed.\n\n"
    },
    {
      "time": " 30.Jan.2008 7.44am",
      "content": "Considering the number of other quality fonts one could purchase for the price of a single DTL license I’d have to really really want/need one of their fonts to consider buying it. Yes, they are good, but the prices are absurd.\n\n"
    },
    {
      "time": " 30.Jan.2008 10.07am",
      "content": "\\> I think it’s mostly because of the price that is it not widely licensed.\n\nAdd to that their sadly unusable website only partially translated into English, and lack of external marketing. The typefaces are diamonds, it’s the stuff surrounding them that’s the rough.\n\n"
    },
    {
      "time": " 30.Jan.2008 10.23am",
      "content": "Great choice!\n\n"
    },
    {
      "time": " 1.Feb.2008 3.53pm",
      "content": "I do agree that there are other far less expensive fonts. Will sleep on it!\n\nTheir website is indeed awful.\n\nThanks all\n\n"
    },
    {
      "time": " 1.Feb.2008 6.55pm",
      "content": "Their website is awful but that’s not what you’re buying. That is my favorite DTL font. I wish I had a good reason to buy it. I’ll have to think of one. Unfortunately in the business I’m in they are addicted to sans…\n\npbc\n\n"
    },
    {
      "time": " 1.Feb.2008 8.32pm",
      "content": "Prokyon then Paul? Their PDF Specimens are great, agreed. I kinda like their website, you really have to be interested in the product and be willing to navigate it. A big plus for those purchasers in the Americas is that they seem to not care much for the North American market (just my thoughts…) so you get some exclusivity in this market area. I like their fonts.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": " 2.Feb.2008 7.38am",
      "content": "Prokyon - that would be nice but not the apple of my eye. I do like the italics quite a bit.\n\npbc\n\n"
    }
  ]
}
