{
  "id": "41536",
  "title": "Mean, mean FontShop!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I notice that here in Europe FontShop's FontBook is €99 whereas it's only $99 for customers in the rest of the world. That makes it about 50% more expensive in Europe.\n\nSo, why the difference? The meanies! Are we Europeans richer? A bit stupid? Are we more generous with our cash? It's not an unfamiliar scenario: directly changing a dollar sign to a Euro or Pound sign and keeping the numbers the same, so I thought I'd ask them to see why. It's actually quite a difference. Below is my email thread with FontShop. I've given Theresa the whole weekend and yesterday to reply to my last (cheeky) message, but I don't think she'll bother, so I thought I'd share it here.\n\nIf not mean, it does seem a bit unfair. Do you think we can lobby them to fairly convert the $99?\n\n_On Jan 25, 2008, at 6:12 AM, Mark Russell wrote:_\n\nJust a quick question to see why Fontbook is €99 in Europe and $99 everywhere else. This makes the book a third more expensive in Europe. [I was wrong. It's more than a third.]\n\n_Maybe it's a mistake on the website? Or is shipping included? I can't believe it is because 'All other countries' is just $99 and shipping, say to Japan, would be as costly as shipping to London surely._\n\nMark.\n\nOn Jan 25, 2008, at 7:21PM, theresa dela cruz wrote:\n\nHello Mark,\n\nThank you for your email. Unfortunately, the price of the FontBook is correct and does not included shipping. It is set at a value that does not change and therefore the cost of the book is higher than it would be if purchased in the US because the Euro is stronger than the US dollar. Sorry for the inconvenience. If there is anything else that I can help you with then please let me know.\n\nRegards,  \nTheresa\n\n-----------------------------------  \nSales & Support  \nfontshop.com / fontfont.com\n\nOn Jan 25, 2008, at 8:48 PM, Mark Russell wrote:\n\nThanks, Theresa, for your prompt reply.\n\nI do indeed understand that the US Dollar and Euro have different values. To cope with this we use a thing called an 'exchange rate'. At today's rate $99 is equal to €67.\n\nYou don't explain why Fontbook is so much more expensive in Europe than it is in the rest of the world, or why you don't fairly calculate the cost into Euros for the European market.\n\nIt'd be lovely if you could.\n\nMark.\n\n",
  "author": "<a href=\"/web/20100518112844/http://typophile.com/user/26242\" title=\"View user profile.\">olho</a>",
  "time": "<br>",
  "uid": "26242",
  "comments": [
    {
      "time": "",
      "content": "I don't think that Theresa's e-mail sounds cheeky at all :( I think that you are the one who sounds a little angry.\n\nActually, I suspect that the FontBook is produced and printed in Europe. Therefore, given the weak dollar, it might be the Americans getting a deal by only having to pay $99, not the Europeans getting shafted…\n\nNote also, that for the past few days, the dollar has been rising and and falling and rising again slightly against the pound and the euro, and perhaps the pound is falling slightly against the euro as well. These things change all of the time! But a book is produced up front at a specific time. Constantly changing prices based on volatile exchange rates is something that most international companies do not do. And FontShop is a small company (at least compared with, say, Apple), so I wouldn't expect it from them.\n\n"
    },
    {
      "time": "",
      "content": "i wish i could use your line of reasoning to get cheaper prices for goods here in Britain! \"Hi, I'm American and I'll be paying for my groceries in dollars today, thanks!\" I don't think it'd fly...\n\n"
    },
    {
      "time": "",
      "content": "It is not an unfamiliar situation. European Quark users had to put up with much higher prices than their American cousins. It as though companies feel that Americans just wont pay the higher prices whereas the rest of the world will. The rest of the world ends up subsidising lower prices to Americans. (This even happens on U.S. Amazon.)\n\n"
    },
    {
      "time": "",
      "content": "FontShops FontBook is as much a marketing instrument as a reference work for typographers. FS must have put some thought into determining at which pricepoint they would offer the FB to customers. And customerpsychology being what it is, 99 sounds better that something with three figures.\n\nBTW: Look at the list of FontShops — there's one for North America and there are five to cover part of Europe. Marketing costs must be higher in Europe. Sounds familiar? It's the argument Adobe uses in the likewise discussion over software pricing.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Hey Paul, I'd be happy to order it for you in Canadian Dollars!  \nHope all is well in Jolly Olde.  \nCheers.\n\n"
    },
    {
      "time": "",
      "content": "I won't say anything about FontBook, but just few days ago I noticed that even typefaces sold at Font Shop have different prices for US and Europe.  \nFor istance, Scala Sans Pro costs $425 for american customers and €405 for europeans (drop-down menu at top-right of the webpage), although the correct conversion would be €288. Why?\n\n"
    },
    {
      "time": "",
      "content": "If you turn to prescription drugs to work on your frustration, you'll probably wind up breaking even!\n\n"
    },
    {
      "time": "",
      "content": "_Hey Paul, I’d be happy to order it for you in Canadian Dollars!_\n\nAs of today 1.00 CAD = 1.00392 USD  \nNot quite favo(u)rable.\n\nAll nationalities may order directly from the P22 site in local currencies converted to the crappy US$. Perhaps we should change to the Euro.\n\n"
    },
    {
      "time": "",
      "content": "There’s an old James Laube column about a very successful vintner who, when asked how he know how much to raise the prices of his wine each year, said that he applied the “ouch” test. Every year he jacks up the prices until buyers says “ouch!” and stop buying. Then he drops the price a little bit and waits until next year.\n\nEuropeans have a very high threshold for pain; albeit not as high as the Australians.\n\n"
    },
    {
      "time": "",
      "content": "Ouch!\n\n"
    },
    {
      "time": "",
      "content": "I was always led to believe that the ratio of the cost of living in the States to that in many EU countries was roughly equivalent to the currency exchange rate. That is to say, someone who makes $25/hour and pays $3 for a cup of coffee in the US, makes €25/hour and pays €3 for a cup of coffee in EU Country X.\n\nWere that true, the dual Fontbook prices might actually be more fair than a flat rate. The reality of it is probably much more complex than all that though, so the P22 solution seems to make a lot of sense.\n\n"
    },
    {
      "time": "",
      "content": "I don't care, if prices are lower in other countries. I pay local taxes, local rents but I also get a local income. So buying the FontBook for the price in my country's FontShop is a natural thing to do.  \nIt's funny, if something is cheaper abroad, we want those prices, but I have never heard that someone was asking to raise local prices, because they found it elsewhere for a higher price. ;-)\n\nRalf\n\n"
    },
    {
      "time": "",
      "content": "I saw this thread when it was first started up - and the title of it - well, just doesn't fit.\n\nRalf - you have a valid point - and I know that when you buy in the UK - VAT tax really makes the price grow... amazing how different states have different state taxes - New York City last time I checked was still at 8.25%, I'm in the South where up to 2 months ago we were at 5% - now restaurants are at 9%, and all food is at 6% (yes in supermarkets - SC says if you can hold it and walk away with it, it's taxable.)\n\nThe Font Shop has had its up and downs. It has brought us many fine fonts. It has also been ripped off in more ways than you can imagine, and I don't want to go into on an open forum.\n\nTo me, if you like the fonts, please buy them - and if you don't, then do what mum taught you to do, do not say anything at all if you don't have something nice to say.\n\nIt's just one of those days... again.\n\n"
    },
    {
      "time": "",
      "content": "_Mean, mean..._\n\nMark, the bottom line has no emotion.  \nThat's not callous, because businesses aren't human.\n\nIf any business were to charge all its customers only the prices its poorest customers (in this case American designers) could afford, it wouldn't stay in business long.\n\nJust be thankful there IS a FontBook, and that you ply your trade in Europe, not the US.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I was always led to believe that the ratio of the cost of living in the States to that in many EU countries was roughly equivalent to the currency exchange rate.</cite>\n\nIt might work out that way if the free tuition and health care some Europeans get are factored in, but I still think Europeans just pay more because they aren’t very good at saying no.\n\nAn Australian once told me that the high prices there are justified by the high cost of shipping goods to Australia. She was a little gobsmacked when I pointed out that their stuff comes from the same Asian factories that everyone else’s does.\n\n"
    },
    {
      "time": "",
      "content": "So I'm to be greatful that European typographers/designers are better off than those in the rest of the world and stump up the extra (equivalent) $47 without question then? To be honest, I am neither convinced of the truth of that idea or the prescribed reaction. I am more convinced that Europeans complain less and buy artificially expensive goods more readily and FontShop are just taking advantage of that. Or that we're consistently offered no other option but to pay the arbitrary premium here in Europe.\n\nI certainly agree that the bottom line has no emotion, so _Mean, mean FontShop_ should probably be replaced by _Cynical, cynical FontShop_. (I'm tempted by _Profiteering, profiteering..._, but that would probably be going a little too far.)\n\nAnd yes, a FontShop font - say FF Meta Book - is similarly priced at €229 or $240. A realistic conversion of $240 would be €162 making it a substantial 71% more expensive in Europe. Am I 71% better off than an American? I doubt it.\n\nPerhaps some of you are right and there's little to be said about the price difference. It is after all a free market and FontShop are far from the only people who mark up their products so much for the European market. And do I have to buy it? Well, no, of course I don't. And nor will I.\n\nI think more than the mere fact that they do this, it's the fact they're so blatant about it which makes it look so bad. Reputations are undone over matters like this and I can't be the only one who's noticed it. Worse, and I'm sticking my neck out here I admit, (and no, I'm not in any way justifying or advocating theft) won't such seeming unfairness make the moral distaste of copying/taking a font rather than buying it seem just that little bit more easily forgotten if its legitimate sale looks like it's part of a racket?\n\n"
    },
    {
      "time": "",
      "content": "Olho — well said. The excuses for this practice are, frankly, pathetic. FGS people, it's a digital download — there are no shipping costs. This is just gouging one part of the world to subsidise the business to another. We've seen it with Quark, but now this virus has spread itself to other aspects of design.\n\nI do not buy from FontShop because of this.\n\n"
    },
    {
      "time": "",
      "content": "Whoa, discussion getting skewed here… Please, fellow-US-Typophiles, tell us how much of your income goes to taxes (local, sate, federal). In Europe taxtion is around 30 to 60 procent of income, PLUS whatever you consume gets taxed in the form of VAT (Value Added Tax), which can be as high as 25%.  \nNice example: in the Netherlands you pay a third extra on a car (that's a special state tax), and after that 19% VAT. Gasoline is around nine USD a gallon. Thank G, a lot of us drive compacts… ; )\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "I know that I sound like a broken record, but I think that prices aren't priced-up for Europeans, but rather priced-down for Americans. By not jacking up the prices to equal the exchange rate, European businesses are trying to do Americans a favor ;-) Many Americans do not realise yet that their currency has lost quite a bit of its value in recent years. If Americans had to suddenly pay real market value for imported goods, they'd have a lot less money to spend, and a lot less things to buy, and then they might go into shock.\n\n"
    },
    {
      "time": "",
      "content": "Bert, after I moved from the US to Germany, my overall income (if you'd convert dollars up to euros) stayed about the same. My income taxes went up (but not by much), and my monthly health insurance payments went way up (but I got way better coverage).\n\nOverall, public transit got cheaper. I don't drive a car, so I didn't have to worry about gas. Yes, goods cost more because of higher VAT, but food prices were a lot cheaper, as was rent. So I came out rather ok in the long run.\n\nNow I'm in England, where rent, transit, and food are much much much higher than in either Germany or the US. Health care though costs me nothing, but that might just be because of my current student status. Again, I've got no car here, but I could never afford one with the prices on everything around it here. But I don't need one, since I'll be going back to Germany in September.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Many Americans do not realise yet that their currency has lost quite a bit of its value in recent years.</cite>\n\nHush, we certainly don't need you spilling the beans. Our heads are firmly in the sand. Maybe a figurehead can make a difference...Yeah, **that's** the ticket.\n\n\\>\\> \"Come on people now, smile on your brother. Everybody get together. Try to love one another right now.\"\n\n\\> \"It's not working\"\n\nWell, then try harder!  \n; )\n\n"
    },
    {
      "time": "",
      "content": "<cite>Many Americans do not realise yet that their currency has lost quite a bit of its value in recent years.</cite>\n\nThey know, they just don’t understand macroeconomics well enough to care. After all, they can’t afford those fancy vacations in Puerto Vallarta or Provence, so it doesn’t apply to them, right?\n\n"
    },
    {
      "time": "",
      "content": "\"Please, fellow-US-Typophiles, tell us how much of your income goes to taxes\"\n\nWe don't actually pay taxes in the US of A. We just borrow operating capital so we can live large. It means that our children, grandchildren and probably their kids will work in sweatshops in India and China to pay off our debt. But what the hell? You only live once.\n\n[Sarcasm intended]\n\nAnd fellow Americans, remember those \"Don't blame me. I voted for Bush\" bumper stickers from the '92 election? Well don't blame me. I never voted for a Bush.\n\n"
    },
    {
      "time": "",
      "content": "One more point - and back on topic.\n\nFontShop has offices worldwide. Perhaps, if there was a cost accountant among us - they might be able to explain that in the US, Canada and Mexico -- it costs x amount of dollars to operate and in Europe - y amount of dollars to operate. Which might explain the price difference.\n\nJust a thought.\n\n"
    }
  ]
}
