{
  "id": "41546",
  "title": "Logo Advice please",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi guys, sorry if I’m posting in the wrong section; I wasn’t sure where was best.\n\nI’m trying to update our company logo. This is how it looks at present.\n\n ![](http://web.archive.org/web/20081007190125im_/http:/www.typophile.com/files/IMA%20BlueSymbol%20Small_5052.jpg)\n  \nThere are two problems with it. One is the lettering and the other is the composition.\n\nThe custom lettering falls apart at large sizes and doesn’t look modern, especially with that underlining. The lines of the globe seem to interfere with the shapes of the letters. I am wondering if simply updating the font would be successful. I have been looking at possible alternatives and found [Present Bold Italic](http://web.archive.org/web/20081007190125/http:/www.myfonts.com/search?search%5Btext%5D=presence+bold+italic) or [Urbana Bold Italic](http://web.archive.org/web/20081007190125/http:/www.myfonts.com/fonts/cepuertas/urbana/UniqueName-7256-1188935622-1-73207/) very pleasant. I need advice which other fonts to look at. We want to convey cutting-edge, modern, personable, friendly, professional and perhaps not too corporate (more informal). We are a training company working with NGOs in International Development around the world. I think the font should be fairly heavy so it sets itself apart from the globe, perhaps. We use Helvetica Neue for our communications.\n\nColleagues here feel we should keep the globe (perhaps somehow being updated), and the overall look should be welcoming and clean. But, the other problem is that this logo is hard to use in monochrome or on a coloured background, because it is quite complicated. Ideally, I’d like to change it completely but am short of concept on this one. So if anyone has suggestions how to simplify it, I’d be grateful to hear/see them.\n\nThanks :)\n\n [‹ Need Logo Help](http://web.archive.org/web/20081007190125/http:/www.typophile.com/node/41502 \"Go to previous forum topic\") [logo crisis! ›](http://web.archive.org/web/20081007190125/http:/www.typophile.com/node/41068 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007190125/http://www.typophile.com/user/20652\" title=\"View user profile.\">Bendy</a>",
  "time": "<br>",
  "uid": "20652",
  "comments": [
    {
      "time": " 30.Jan.2008 4.04pm",
      "content": "The first thing I saw when looking at the logo is to use a face like Auto ( [http://www.fontshop.com/fonts/singles/underware/auto\\_1\\_bold\\_italic/?samp...](http://web.archive.org/web/20081007190125/http:/www.fontshop.com/fonts/singles/underware/auto_1_bold_italic/?sample_text=ima \"http://www.fontshop.com/fonts/singles/underware/auto\\_1\\_bold\\_italic/?sample\\_text=ima\") )or something similar and modify it, i.e. drop the dot add serifs to the i etc... I would have change the angle of the globe make it the same color as the text and have the ima on a white rectangle cut through the globe maybe out line the top and bottom of the rectangle in the same weight and color as the globe. or something like that :)\n\n"
    }
  ]
}
