{
  "id": "41587",
  "title": "Steinbach Logos Revisited",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "It would be great to get these broken down and find out which one people like the most and what I can do to improve on them.\n\nThanks  \nChris\n\n [‹ Windsor Freezer Logo](http://web.archive.org/web/20081203202415/http:/www.typophile.com/node/13197 \"Go to previous forum topic\") [Web Design Business Logo ›](http://web.archive.org/web/20081203202415/http:/www.typophile.com/node/38426 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203202415/http://www.typophile.com/user/25730\" title=\"View user profile.\">christopher.martens</a>",
  "time": "<br>",
  "uid": "25730",
  "comments": [
    {
      "time": " 31.Jan.2008 12.39pm",
      "content": "sorry, heres the logos.\n\n ![](http://web.archive.org/web/20081203202415im_/http:/www.typophile.com/files/steiner_online_logos_4334.jpg)\n\n"
    },
    {
      "time": " 31.Jan.2008 1.22pm",
      "content": "Wow, those colors choices are nauseating together.\n\nThis is a local radio station right, that has an online presents and it’s focused on the community?  \nI think this needs to be addressed in the logo. There are several approaches you can take. Focus on the radio aspect (speakers, mics, radiowaves, radiotowers), then combine them with the web aspect. If there are any well recognized landmarks in Steinbach, consider incorporating them as well. You need to research to create a concept, I don’t see a concept in this logo, and you have a lot of choices for a cool concept.\n\nSecond, just because this is going to be a web logo, doesn’t mean you have to use eye gouging neon colors, subtlety is still appropriate. But for the time being, design in black and white until you get a concept you like worked out, then you can bring color in to play.\n\nFinally, stop in at your local bookstore and check out some books on logo design, that might help you with your concept.\n\n"
    },
    {
      "time": " 31.Jan.2008 1.40pm",
      "content": "The first type treatment seems appropriate and tasteful, and the first logo is probably the strongest. That being said, Asvetic makes a good point in doing more logo research.\n\n"
    },
    {
      "time": " 1.Feb.2008 3.04pm",
      "content": "Steinbach is known for cars, Mennonites, and being a dry town that you have to pass through to go to Winnipeg.\n\nAdmittedly, I’ve seen very little of Steinbach beyond the Smitties and the Mennonite village, but this doesn’t feel like Steinbach, it’s generic.\n\n"
    },
    {
      "time": " 2.Feb.2008 1.25pm",
      "content": "As for the logo and people claiming it has know creativity, I think what the point of the 2nd and 5th logo is the look of a river/brook/stream. Steinbach is translated as Stony Brook and that’s what Steinbach was built along.\n\n"
    },
    {
      "time": " 2.Feb.2008 3.07pm",
      "content": "It’s been done though. [http://www.mysteinbach.ca/guide\\_autodealers.htm](http://web.archive.org/web/20081203202415/http:/www.mysteinbach.ca/guide_autodealers.htm \"http://www.mysteinbach.ca/guide\\_autodealers.htm\")\n\n"
    }
  ]
}
