{
  "id": "41586",
  "title": "type size for a magazine",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all. I'm currently putting a magazine together for someone, and on one particular article that spreads out over three pages there's a lot of text to get in (not to mention pics). Anyway, this got me to thinking; is there a recognized size for type in magazine articles? Currently I have the type in the aforementioned article at 6.5pts, but seeing it in the screen its hard to really tell if 6.5pts is a tad too small for magazine print. Before anyone suggests printing it out I have to say I have a Dell printer that wont work with my Macs, so that's a non starter. Anyone with experience care to help me?\n\nThanks in advance\n\nSimon (Mr.Gone)\n\n",
  "author": "jazzhustler",
  "time": "31 Jan 2008 — 11:16am",
  "uid": "23155",
  "comments": [
    {
      "time": "31 Jan 2008 — 11:39am",
      "content": "\"tell if 6.5pts is a tad too small for magazine print.\"\n\nIn general, 6.5 pt type would be painful to read in lengths. That size type is typically reserved for the legal stuff no one wants you to actually read. ;o)\n\nBUT, it does, of course, depend on the particular typeface you are using.\n\nBroadly speaking 9-11 pt is the range for most body text.\n\n"
    },
    {
      "time": "31 Jan 2008 — 11:40am",
      "content": "that's very small. i usually go 9.5 pt but then depends on what font you are using.\n\n"
    },
    {
      "time": "31 Jan 2008 — 11:53am",
      "content": "Thanks. I knew 6pts or even 5.5pts is acceptable for some stuff - namely the lyrics on the inside of a CD booklet for example, but wasn't sure it looked right for a magazine. I've gone for 9pts. Thanks for the input.\n\n"
    },
    {
      "time": "31 Jan 2008 — 1:15pm",
      "content": "9 pts sounds fine but you REALLY need to print it out! What font are you using?\n\n"
    },
    {
      "time": "31 Jan 2008 — 1:54pm",
      "content": "at present I'm using a font called Neo Sans, although this may change. I will be getting print outs, but not at this stage, as there's a lot more to do beforehand. Thanks for chipping in though.\n\n"
    },
    {
      "time": "31 Jan 2008 — 2:13pm",
      "content": "Please use a serif type for body copy. After about a page of reading sans serif, your readers will tire. I know there are a lot of people out there who defend the use of sans as a text face. They are used to reading small amounts of information at a time (say, no more than three paragraphs), and for this sort of thing, sans is fine. Any book or magazine intended for continuous reading, and published by a major publisher, is always set in a serif type.\n\nAs groundbreaking as \"The New Typography\" was, even Jan Tschichold was willing to admit this. All his later book typography was set in serif type.\n\n"
    },
    {
      "time": "31 Jan 2008 — 2:15pm",
      "content": "I agree that you should a serif font for reading copy, altho now that my eyes are starting to go I'm noticing sans can be easier to read at small sizes!\n\n"
    },
    {
      "time": "31 Jan 2008 — 2:35pm",
      "content": "Here's a tip Patty -- hold it closer. That makes the type bigger :-)\n\n"
    },
    {
      "time": "31 Jan 2008 — 2:38pm",
      "content": "Thanks Greg, I'll bear the serif point in mind. I know the client's going to think serif fonts look 'old fashioned' (that's my prediction of what he'll say, not what I think!), but I'll quote your take on it, and try and go with that. Having said that I'm looking at Mac Format magazine, and it's all sans.\n\nSimon.\n\n"
    },
    {
      "time": "31 Jan 2008 — 4:07pm",
      "content": "Old fashioned? The earliest Greek inscriptions have a form that could be called sans serif, and it can be argued that the earliest letter forms in recorded history are sans serif.\n\n\"Modern\" by definition is that which is functional, legible, and suits the task for which it is intended. A serif type is easier to read for long stretches. Publishers are not tied to this convention because it is traditional, but because it is functional (i.e. modern).\n\nIf the magazine in question is intended to be browsed, not read, a sans serif type would work. If the articles are long, however, a modernist would choose a more functional and reader-friendly serif type.\n\n"
    },
    {
      "time": "31 Jan 2008 — 6:26pm",
      "content": "Luckily there are a lot of new, fresh serifs. Check [this thread](http://web.archive.org/web/20141027051201/http:/www.typophile.com/node/39592#comment-244536) (direct link to a post) for some ideas.\n\nAlso you _really_ need to print it out too. If you can't use your own printer, make a pdf and go to the nearest printshop or something.\n\n"
    },
    {
      "time": "31 Jan 2008 — 8:41pm",
      "content": "Nick - holding it closer is becoming the problem! I am starting to need to hold the book farther and farther away.\n\n"
    },
    {
      "time": "31 Jan 2008 — 11:22pm",
      "content": "Greg - like I said previously, I was predicting what the client would say about Serif fonts looking old fashioned, not me. I do think your definition of 'Modern' is a bit off the wall, but hey, I came here for advice, not an argument, so thank you. Quincunx, yes I will be printing out, but not until I'm further down the road with it, like I said previously.\n\nthanks anyway.\n\nSimon.\n\n"
    },
    {
      "time": "1 Feb 2008 — 6:44am",
      "content": "You really should firm up the font before you decide on the size. (And I'm not crazy about Neo Sans as a text font. It seems more suited to headings.)\n\nSome fonts can be set smaller if they have a large x-height. For instance ITC Garamond can be several point sizes smaller than Adobe Garamond due to the radically different x-heights. (There will also be leading issues.)\n\nAnd if you can't print it locally, save it as a PDF and take that file somewhere that you can make a printout.\n\n"
    },
    {
      "time": "1 Feb 2008 — 7:28am",
      "content": "Actually I recommend you print it out BEFORE you are too far down the road. As a designer who works in old media (print) I cannot emphasize enough how very important it is to see the printed page. For example, to view my work at true actual size, I need to view it at 137%. Viewing it at 100% is extremely misleading. But... 137% looks huge on the monitor. It can get very confusing. I learned the hard way, when my printer was on the fritz, that you really need to look at printouts - trimmed down. There are a couple of books I'd love to redo with the type a little smaller. You need to invest in a printer that will work with your Mac.\n\nYou are getting this advice from a lot of people; it would behoove you to heed it.\n\n"
    },
    {
      "time": "1 Feb 2008 — 9:01am",
      "content": "I'll just chime in and say I agree that you need to test the typeface on the printed page. Even if you only shape some text into the desired column width with several different point sizes and leading adjustments. Even for a graphic design magazine 6.5 pt (especially 5.5 pt) is far too small if the text is meant to be read.\n\nMany typefaces do not look the same on the monitor as they do on the printed page. The big boys would even suggest printing it on the same press and same paper intended for use. This isn't always possible, of course, but do what you can to get it as close to final. If not you could be surprised, for instance, at how light the text might print once it is on that gloss text weight paper at 3600 dpi compared to a quick print out on a 1200 dpi printer using offset paper. But, at least you'll have an idea.\n\n"
    },
    {
      "time": "1 Feb 2008 — 9:14am",
      "content": "\\>\\>Nick - holding it closer is becoming the problem! I am starting to need to hold the book farther and farther away.\n\nGlasses are not just for drinking. They also make some for reading.  \n:-)\n\n"
    },
    {
      "time": "1 Feb 2008 — 10:10am",
      "content": "Hey everyone, I really do appreciate all the input, and yes I do need to get a new printer! It really is at the early stages right now, so I'm not overly concerned, especially in light of the fact that I know there are gonna be umpteen changes way before it's even considered for print (I've worked for this client before), but I promise it won't get to the stage where it's \"...too far down the road\".\n\nCheers again.\n\nSimon.\n\n"
    },
    {
      "time": "4 Feb 2008 — 12:43am",
      "content": "I have been art directing publications for over 4 years now and every  \nmagazine uses 7.5 typeface. All were Serif body copy.  \nIt depends on your page size, I am guessing that you are using a standard size so  \nthat should be fine. As for serif or sans, well it depends on your audience  \nSans has a more modern feel, where serif is more a matter of fact.  \nHelvetica Nue is a clean family to use that does not draw attention to it's self.  \nIf you want a font with a touch of flavour try a Humanist face such as Aaux Pro.  \nWith all that make sure you have the leading set at 9 pt (if 7.5 is what you go with).\n\n"
    },
    {
      "time": "4 Feb 2008 — 1:27am",
      "content": "Simon --\n\nDepends on your audience. Middle-aged readers tend to like larger type, because for most of us it's getting harder to read the really small stuff; but younger readers may like it small (though not tiny). The art director for a New York book publisher I spoke with recently pointed out that, if she used a small type size in a book aimed at a young demographic, the younger readers would perceive it as a book for old people, and not buy it.\n\nAnd although it's a good rule of thumb that serif faces are more often best for extended text, there are more important things than whether a typeface has serifs or not. I just got through reading a novel, quite happily, that was typeset in Optima. (It all depends on the spacing, of course. Sans serifs, especially light weights, are always getting tracked too tight in text; that kills readability.\n\nMário Feliciano designed his FTF Stella as a text face for a surf magazine. I don't know how closely the readers of \"Surf Portugal\" read the text, but he said that when he tried using a serif typeface, they complained. Stella is a humanist sans; that's the direction to go, if you're looking for sans serifs typefaces that might actually work in extended text.\n\nIn general, I think sans serifs in text need narrower columns (unjustified) than serif faces – but that of course all depends on the individual face. And on everything else about how it's spaced.\n\n"
    },
    {
      "time": "4 Feb 2008 — 6:58am",
      "content": "A novel in Optima I would not read, just as a matter of principal.\n\n"
    },
    {
      "time": "12 Feb 2008 — 6:28am",
      "content": "Koop, John & Pattyfab, thanks for your input. I've settled on 9pts for the main body text for now, with 10.5pt leading (the automatic setting for 9pt). I've gone for a sans serif font for now, and whilst I agree with most of the points made both for and against, I've had to stick with sans serif on the clients insistance. I may get shot down in flames now, but stuck with Neo Sans. It's quite modern looking, but I think it works fine in the context of the magazine. Maybe I'll change this over time (really would like to use Paperback, by House Industries) but we'll see.\n\nThanks again\n\noh, and if you like Jazz Funk my new album's out now worldwide:\n\nMr.Gone presents Afro Elements - 'It Remains To Be Seen' (Freestyle Records)\n\nSimon\n\n"
    }
  ]
}
