{
  "id": "41592",
  "title": "Swash Exercise Critique",
  "forum": "Design",
  "tags": [

  ],
  "content": "In my graphic design class we are looking at a different of element of type and making a tabloid poster representing that. I chose swashes. I would like to recieve some feedback on these two, and whether I should go with drop or no drop.\n\n ![](http://web.archive.org/web/20080206125227im_/http:/www.typophile.com/files/drop_5285.png)\n  \n\n ![](http://web.archive.org/web/20080206125227im_/http:/www.typophile.com/files/nodrop_4900.png)\n\n [‹ Texas License Plate e-vote](http://web.archive.org/web/20080206125227/http:/www.typophile.com/node/41725 \"Go to previous forum topic\") [What is the best place to learn how to do type? ›](http://web.archive.org/web/20080206125227/http:/www.typophile.com/node/41722 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080206125227/http://www.typophile.com/user/26407\" title=\"View user profile.\">Hofweber</a>",
  "time": "<br>",
  "uid": "26407",
  "comments": [
    {
      "time": " 31.Jan.2008 4.58pm",
      "content": "I think you would benefit from narrowing this down. Perhaps create your own swashed letter, and maybe exagregate the swash.\n\nGood luck!\n\n"
    },
    {
      "time": " 31.Jan.2008 6.08pm",
      "content": "Narrowing it down? I’m not sure what you mean. I guess I could take out the tagline, but every letter of the alphabet must be included.\n\n"
    },
    {
      "time": " 1.Feb.2008 1.20am",
      "content": "Every letter huh? Swash caps aren’t meant to be used as a full sentence/line.\n\nI was thinking of something along these lines:\n\n ![](http://web.archive.org/web/20080206125227im_/http:/www.typophile.com/files/Untitled-1_5944.jpg)\n\nbut that might not fit your bill.\n\nAlso you might want to look into Sudtipos [Affair](http://web.archive.org/web/20080206125227/http:/www.sudtipos.com/fonts/2) for some inspiration.\n\n"
    },
    {
      "time": " 1.Feb.2008 7.10am",
      "content": "•Try using a lighter weight of Bookman, it will look better blown up.  \n•You can do better compositionally. Right now I get the impression that you’re focused on fitting all the letters into a composition rather than making a great composition and then rendering it with swashy letters.\n\n"
    },
    {
      "time": " 1.Feb.2008 9.05am",
      "content": "If this is the typeface you wish to use that is ok. This is a good swash face to work with. But instead of seeing it as letters what if you view them simply as shapes? Make a pattern or a patchwork quilt?\n\nI’d suggest seeing how the Queen of Swash (amongst other things), [Marian Bantjes](http://web.archive.org/web/20080206125227/http:/www.bantjes.com/) uses the swash in her designs.\n\n"
    },
    {
      "time": " 4.Feb.2008 12.04am",
      "content": "Thanks guys for the advice. Unfortunately I don’t own a computer running illustrator so my time with it is limited. I did do a revamp though. [This is the basic layout,](http://web.archive.org/web/20080206125227/http:/i119.photobucket.com/albums/o143/patchho/Picture2-5.png) and [this is what i’ve started doing to it.](http://web.archive.org/web/20080206125227/http:/patch.becomearobot.com/weblog/)\n\nI don’t think my layout is particularly strong but it’s the best I could do with limited lab time.\n\n"
    },
    {
      "time": " 5.Feb.2008 2.00pm",
      "content": "The sample shown looks like one of my fonts called Meola Bookman (circa 1965). I had over 245 characters in the font. If you ever run across a Facsimile Font catalog you will see a complete showing of my version of Bookman swashes\n\n"
    }
  ]
}
