{
  "id": "41599",
  "title": "first font - Brass Band",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Never made a font before. I've done hand-lettering and messed around making logos. Actually this font started as a logo for a brass band, and then for some reason I decided to do up a whole font. At this point I'm wondering if it's worth continuing and e.g. trying to sell it on one of those online font stores.\n\nIf it's any good, what do I do next?\n\nPS The kerning is what TypeTool2 did automatically. I did some manual kerning and then lost it all somehow.\n\n ![](http://web.archive.org/web/20150417092220im_/http:/typophile.com/files/Picture2_5526.png)\n\n",
  "author": "sbwoodside",
  "time": "31 Jan 2008 — 8:53pm",
  "uid": "26616",
  "comments": [
    {
      "time": "1 Feb 2008 — 1:04am",
      "content": "You'll definitely want to adjust the kerning manually. A lot of type designers spend more time on this than on the \"black\" shapes, and I would venture most would agree that a sort-of-crappy font can be rescued into at least mediocre-levels if the kerning and metrics are impeccable. That said, I would also definitely revisit a lot of these glyph shapes. If you're going for quirky and wonky, everything seems a bit too rigidly lined up; if you're going for geometric simple forms, it seems a bit too playful. I don't think this is close to being ready for a commercial release yet, but if it's something you really care about it definitely has potential.\n\n"
    },
    {
      "time": "1 Feb 2008 — 4:42am",
      "content": "I can see the potential of this, but it still needs lotsa work to make it attractive enough. I would first make sure that your glyph shapes make music together. Maybe you should cut all the glyphs (from scratch, with your basic idea in mind) out of black paper and see what happens. At this stage I wouldn't put to much energy in kerning.\n\nMaybe you find [this link](http://web.archive.org/web/20150417092220/http:/briem.ismennt.is/2/2.3.5a/2.3.5.03.capitals.htm) about spacing useful.\n\n"
    },
    {
      "time": "1 Feb 2008 — 6:13am",
      "content": "I'd suggest making it a little less structured. I think Jos has a good idea regarding recreating all the letters as paper cut outs. That will give it a bit of a randomness to it.\n\n"
    },
    {
      "time": "2 Feb 2008 — 11:49pm",
      "content": "Thanks a ton for the critique. I've already filed away this version and started messing around with breaking out of the boxes a bit. I had really tried to stick to a really strict structure and width and so on but I think it might be fun to do as you suggest.\n\n"
    }
  ]
}
