{
  "id": "41601",
  "title": "Examples of Well-Designed Schedules",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I just cleaned up the painful rehearsal schedule that my school's Shakespeare club created, and I recently got some poster reference books, so now I'm wondering where I can find examples of good schedule design. Other than in Edward Tufte's books, which I already have, in what books can I find examples of well-designed schedules? I'm not looking for any type of schedule in particular.\n\n",
  "author": "Thomas Levine",
  "time": "31 Jan 2008 — 9:12pm",
  "uid": "19606",
  "comments": [
    {
      "time": "1 Feb 2008 — 1:23am",
      "content": "I suppose the best schedules are those that are thought-out solutions to the problems at hand. In this sense, looking at other schedules would just obfuscate your solution, because they might encourage you to try something fancy when a simple list might work best.\n\nThis is of course the kind of design that is best when it's invisible: nobody will give it a second thought if it works well, but people will be cursing you for months if it doesn't. Any kind of complex iconography or code system tends to confuse people, in my experience. For something like a rehearsal schedule, I would want to get a personalized calendar with just the dates I needed to show up on listed for me. You can set up this data in Excel, then export it to Word and even Illustrator and InDesign, I believe.\n\n"
    },
    {
      "time": "1 Feb 2008 — 7:03am",
      "content": "A few places where you could look for inspiration on information design projects in general, if not schedules as such, are:\n\n[www.nigelholmes.com](http://web.archive.org/web/20120415120703/http:/www.nigelholmes.com/ \"www.nigelholmes.com\")  \n [www.textmatters.com](http://web.archive.org/web/20120415120703/http:/www.textmatters.com/ \"www.textmatters.com\")  \n [www.dynamicdiagrams.com](http://web.archive.org/web/20120415120703/http:/www.dynamicdiagrams.com/ \"www.dynamicdiagrams.com\")  \n [www.andorif.co.uk](http://web.archive.org/web/20120415120703/http:/www.andorif.co.uk/ \"www.andorif.co.uk\")  \n [www.studiolift.com](http://web.archive.org/web/20120415120703/http:/www.studiolift.com/ \"www.studiolift.com\")  \n [www.boag.co.uk](http://web.archive.org/web/20120415120703/http:/www.boag.co.uk/ \"www.boag.co.uk\")\n\n"
    },
    {
      "time": "1 Feb 2008 — 7:55am",
      "content": "I usually find inspiration for schedules in European train tables and work backward as my projects are never so complex.\n\n"
    },
    {
      "time": "1 Feb 2008 — 8:09am",
      "content": "Hah! Try reading the Long Island Railroad timetables. It's amazing anyone gets anywhere.\n\n"
    },
    {
      "time": "1 Feb 2008 — 9:24am",
      "content": "Or the Tokyo ones for the matter.\n\n"
    },
    {
      "time": "1 Feb 2008 — 9:40am",
      "content": "Well, there’s a reason I specified _European_ timetables.\n\n"
    },
    {
      "time": "1 Feb 2008 — 1:54pm",
      "content": "I find [Visual Complexity](http://web.archive.org/web/20120415120703/http:/www.visualcomplexity.com/vc/) a great online ressource when it comes to sophisticated data visualization – like schedules and networks.\n\n"
    },
    {
      "time": "1 Feb 2008 — 9:13pm",
      "content": "Visual Complexity seems to be a fantastic resource. Thanks for pointing it out Florian.\n\n"
    }
  ]
}
