{
  "id": "41605",
  "title": "Disability Act 1995",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Do design agencies work harmoniously with this act of 1995? Do they priorotise it within their business ethics?\n\n [‹ ITC Galliard best format?](http://web.archive.org/web/20080203103029/http:/typophile.com/node/40303 \"Go to previous forum topic\") [hand drawn, ornamental ›](http://web.archive.org/web/20080203103029/http:/typophile.com/node/41617 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080203103029/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 1.Feb.2008 6.22am",
      "content": "Is there a minimum page requirement?\n\n"
    },
    {
      "time": " 1.Feb.2008 6.32am",
      "content": "Not sure about design agencies, but schools definitely are expected to conform to this act on their web pages and online courses.\n\n"
    },
    {
      "time": " 1.Feb.2008 6.42am",
      "content": "Are you referring to UK legislation?\n\n"
    },
    {
      "time": " 1.Feb.2008 8.08am",
      "content": "I don’t know nuthin’ ’bout UK laws but why wouldn’t you assume design agencies are subject to the same laws and ethical standards as any other profession?\n\n"
    },
    {
      "time": " 1.Feb.2008 9.34am",
      "content": "I can’t speak for UK laws, but a lot of US laws pertaining to disability issues have some rather large loopholes in them.\n\nI’m guessing some of the issues related to graphic design, such as public signage and government produced documents adhere to some more specific regulations. However, things like web sites really haven’t been regulated to that great of an extent yet. Again, I’m just talking about US laws at the moment. I know the UK has been a bit more specific regarding some of this (and, of course, any legislation in ’95 likely doesn’t have a whole lot of relevance to specific things like the Web)\n\n"
    },
    {
      "time": " 1.Feb.2008 12.21pm",
      "content": "You’re not concerned about SENDA and DDA 2005? Well, anyway, here are some research _hints_:\n\n1. Adaptive Environments.  \n2. EIDD.  \n3. The Power of Information (Mayo and Steinberg).  \n4. Go to the European Disability Forum and search on media disability.  \n5. W3C WAI and WCAG.  \n6. IBM Able.  \n7. Photosymbols.  \n8. And for a proper student enragée, something has happened with Watchfire and Bobby Online.\n\n"
    },
    {
      "time": " 1.Feb.2008 12.50pm",
      "content": "Almost forgot universal design. Or is that one free hint too many?\n\n"
    },
    {
      "time": " 1.Feb.2008 2.16pm",
      "content": "I am talking in regards to the UK Disability Act 1995. Do design comapnies in the UK adhere accordingly when it comes to employment.\n\n"
    }
  ]
}
