{
  "id": "4160",
  "title": "(x) Wedding font - Bickham Script {Kyle}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "I have been looking for this font everywhere! I see it all the time on wedding invitations websites but can't find it to download and use myself. I would appreciate any help! Thank you. ![wedding invitation](http://web.archive.org/web/20130716213827im_/http:/www.typophile.com/forums/messages/83/32822.jpg)\n\n",
  "author": "aspst22",
  "time": "6 Apr 2004 — 6:14pm",
  "uid": "3377",
  "comments": [
    {
      "time": "6 Apr 2004 — 6:17pm",
      "content": "Bickham Script!!   \n   \n [www.adobe.com](http://web.archive.org/web/20130716213827/http:/www.adobe.com/)\n\n"
    },
    {
      "time": "6 Apr 2004 — 7:01pm",
      "content": "Hi Alexis,   \n   \nThis looks like Bickham Script to me, you can buy it from Adobe.\n\n"
    },
    {
      "time": "9 Apr 2004 — 1:55pm",
      "content": "Be sure to get the Bickham swash caps or you won't be able to to do the embellished caps (the uppercase F, for example).\n\n"
    },
    {
      "time": "9 Apr 2004 — 3:20pm",
      "content": "These days Adobe sells only the OpenType version. You'll need an OpenType savvy application (such as Illustrator CS or InDesign) to take full advantage of the extra goodies. However, if you have one of those, the extra stuff is all built in.   \n   \nThat being said, there is an even more cool version of Bickham Script in the works, but we have not given a release date for Bickham Script Pro.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "9 Apr 2004 — 3:45pm",
      "content": "\\> These days Adobe sells only the OpenType version.   \n   \nBut you said there are outlets that sell the old MMs, right?   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2004 — 10:06pm",
      "content": "I shoulda gotten this one, been using the swashes for a job right now.\n\n"
    },
    {
      "time": "9 Apr 2004 — 11:59pm",
      "content": "Yes, you can still get the MM version from some folks who resell Adobe's fonts, such as MyFonts.com. Given a reasonable alternative, I would not recommend buying an MM font at this time, however.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "21 Apr 2004 — 8:08am",
      "content": "this is so funny.........that picture is from my wedding, and I designed that piece for my guest book!!!   \n   \nIt's amazing how quickly pictures get shuttled around\n\n"
    },
    {
      "time": "9 Apr 2004 — 3:25pm",
      "content": "Big Tease! ;^)\n\n"
    },
    {
      "time": "9 Apr 2004 — 3:56pm",
      "content": "This typeface should go in a list entitled \"top ten most requested IDs\"\n\n"
    }
  ]
}
