{
  "id": "41618",
  "title": "Typeface that goes with Woodcarver Normal and Rosewood...but can be very small",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Help me out please,\n\nI am doing a vintage bluegrass meets elegant invite using Woodcarver and Rosewood. I need something for the fine print that looks like Woodcarver Normal...but is much easier to read in a small size. Although I am open to suggestion if something else would go better with those two Display typefaces.\n\nthanks in advance!\n\n",
  "author": "shielddesign",
  "time": "1 Feb 2008 — 11:42am",
  "uid": "25022",
  "comments": [
    {
      "time": "1 Feb 2008 — 12:51pm",
      "content": "Well I'd personally avoid woodcarver (assuming you're talking about [ICG Carver](http://web.archive.org/web/20150415023031/http:/www.myfonts.com/fonts/imageclub/carver/)). It doesn't fit the mold of old letterpressed woodtype and it's pretty illegible at any size. I think [Corner Bakery](http://web.archive.org/web/20150415023031/http:/www.cornerbakery.com/) does a decent job of incorporating different faces for a rustic quasi-show card feel. Perhaps combine Rosewood & Rosewood Fill with some other woodtype faces like [Brothers](http://web.archive.org/web/20150415023031/http:/emigre.com/EF.php?fid=83), [Council](http://web.archive.org/web/20150415023031/http:/emigre.com/EF.php?fid=86), or some of the [Adobe woodtypes](http://web.archive.org/web/20150415023031/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=searchFonts&type=category&cat=theme&code=old-west)\n\n"
    },
    {
      "time": "1 Feb 2008 — 2:41pm",
      "content": "Nope it is a very nice script font...I agree ICG Carver is icky. I need a feminine font since it is a wedding invite for a chef and her blue-grass husband.\n\nHere is the woodcarver font...see it's nice big, but lousy small.\n\n[http://www.free-fonts-ttf.org/true-type-fonts/woodcarver-normal-2586-dow...](http://web.archive.org/web/20150415023031/http:/www.free-fonts-ttf.org/true-type-fonts/woodcarver-normal-2586-download.htm \"http://www.free-fonts-ttf.org/true-type-fonts/woodcarver-normal-2586-download.htm\")\n\n"
    },
    {
      "time": "2 Feb 2008 — 8:06pm",
      "content": "On a side note, I hope you are fixing the spacing problems of \"Woodcarver.\" Pleasant letterforms, but the spacing is badly broken, especially the \"d\" and \"f\"....\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "4 Feb 2008 — 12:22pm",
      "content": "Thomas...thanks for the great tip. Since there is so little copy on this I am pretty much hand kerning it all. i did however notice what you mean on the d...very odd...I also had to bring the dot on the i closer to the i.\n\nYou sound like a man who would have a great typeface suggestion I could use with these two fonts (woodcarver is dominant with rosewood playing a lesser role...but the details of the event (rehearsal dinner) are unreadable even in in 11pt.\n\nthanks!\n\n"
    }
  ]
}
