{
  "id": "41619",
  "title": "Avenir Next (or other sans) as Body Text? (with examples)",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Just wanted to ask the general opinion on the suitability of Avenir Next for body text. The text in question has lots of images with captions, footnotes and italics. The topic is design and the desire is to keep the appearance clean (images already have lots of text using various fonts in them), contemporary and “constructivist”. I thought I’d also use Avenir for all titles. The primary worries are readability (I am happy with lots of leading and short lines) and the appearance of Italics which are not very contrasty. The results on a high-end digital printing machine, in colour (if that matters).\n\nLet me know what you think. Also, if you can point to examples using Avenir in books or other long documents, I’d be happy to see them.\n\nIf you can suggest better Sans alternatives for body text in books, please let me know too. Again, preferably with examples.\n\nThank you.\n\n",
  "author": "Anna Waldon",
  "time": "1 Feb 2008 — 12:20pm",
  "uid": "26640",
  "comments": [
    {
      "time": "1 Feb 2008 — 1:16pm",
      "content": "Avenir (and the Next-update of that) runs fairly wide, eg you don’t get enough characters in a regular line. To do that you have to go to smaller sizes.  \nThe strong horizontal bias of Avenir asks for more linespacing than regular.  \nAlso to consider: it’s a typeface with very little contrast.\n\nAltogether not a very efficient text face.\n\nIf you want to go the sans’ route and want to stick to a Frutiger typeface, his namesake typeface Frutiger may be a better choice. That also has more variants, esp. a very good condensed. (BTW Frutiger Next has better italics than the original Frutiger.)\n\nIf you want that really old fashioned geometric look, try Akzidenz Grotesk. Or my latest favorite (and a very up-to-date take on that tradition): Kris Sowersby’s National.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "1 Feb 2008 — 2:02pm",
      "content": "(Also, if you can point to examples using Avenir in books or other long documents, I’d be happy to see them.)\n\nThe visual identity and documentation for the city of Amsterdam is all done in Avenir. Lots of example on this website:\n\n[http://www.stijlweb.amsterdam.nl/asp/get.asp?xdl=../views/stijlweb/xdl/P...](http://web.archive.org/web/20150301011550/http:/www.stijlweb.amsterdam.nl/asp/get.asp?xdl=../views/stijlweb/xdl/Page&ItmIdt=00000422&SitIdt=00000002&VarIdt=00000002 \"http://www.stijlweb.amsterdam.nl/asp/get.asp?xdl=../views/stijlweb/xdl/Page&ItmIdt=00000422&SitIdt=00000002&VarIdt=00000002\")\n\n"
    },
    {
      "time": "1 Feb 2008 — 3:18pm",
      "content": "bert\\_vanderveen\n\nThanks. My page size is A4 and the font size should be 11pt or thereabout. Am not sure I understand what you mean by “efficient” and “contrast” here, sorry that I lack the lingo. I can decide on the line length and other parameters to make things look OK.\n\nThanks for the alternatives. I am not wedded to a Frutiger typeface. In fact, I am not sure I like his preference for oblique-like Italics, even in the better “next” generation. Kris Sowersby’s National is a nice and fully-featured option it seems – I shall keep it in mind. I shall need old-style figures + sub- and superscript in the very least whatever I choose.\n\nI thought of Avenir because its look seemed to me compatible and unifying when set against the versatile architecture and design appearing in the images. If there are better sans alternatives out there, I’d be glad to hear of them too. I tried some serifs also but their shapes always seem to clash with what the images do. The images are quite eclectic and in my mind, the body text should not side with any of the styles appearing there. Hence, it seemed that the geometric, minimalist approach would be the best. Maybe people with experience can suggest something else. I am very interested…\n\nSihep\n\nThanks, I knew about Amsterdam and now had a look at the documents. Very helpful. But I see that they use Documenta for longer documents, perhaps confirming that Avenir is a bit too much on masse… I really was hoping to see it in a book somewhere.\n\n"
    },
    {
      "time": "1 Feb 2008 — 4:06pm",
      "content": "What about Proxima Nova? Or Nobel? Or is the wisdom not to use geometric sans at all for long texts?\n\n"
    },
    {
      "time": "1 Feb 2008 — 5:22pm",
      "content": "\\>Or is the wisdom not to use geometric sans at all for long texts?\n\nHmm, i think so. Maybe have a look into a different universe – FF Kievit, \"humanist\" origin but quite neutral and a good read.  \nI really like Avenir (i've no experience with Avenir Next), but i think you will struggle with it if you want use it as a bookface …\n\n"
    },
    {
      "time": "2 Feb 2008 — 7:40pm",
      "content": "Yes, the wisdom is that most geometric sans are quite inappropriate for extensive body text, such as in a book. I'd say the same for pretty much any flavor of sans other than humanist (and even that wouldn't be appropriate for, say, a novel, IMO).\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "3 Feb 2008 — 3:15pm",
      "content": "Thanks all. Well, this is not a novel. This is a design book but with lots of text. It needs to look serious but also visually balanced. Designs in the images are contemporary avant-garde - so the classic/historic-looking fonts are out, especially serifs (e.g., Garamond). I am not so sure about humanist sans. Or maybe I am yet to see the one that is simple and nice and seems suitable. Maybe DIN...? E.g., Kievit seems somewhat loosely drawn, of course only onscreen and in great magnification (I do not have it to experiment with).\n\nI'd like to have a more techy look though. What do you think of PFIsotext? Is that possible in your opinion or too hard to read? Or PFHandbook (this seems nice but rather dense and with wonkish g's).\n\nAs an alternative, what about some minimalist slab serif in humanist proportions? Would that be OK?\n\nAs you all are disapproving of my original intention, I’d like to hear of possible alternatives.\n\n"
    },
    {
      "time": "4 Feb 2008 — 6:53am",
      "content": "It’s all about taste, of course.\n\nThe thing to do is make a shortlist of typefaces you like and do some experimenting with it, eg typeset some material and print it. Weed the selection down. Put away. Look again. Fiddle some more with it. Discard what you don’t like. Etcetera. Until you have the ONE left.\n\nSorry, this may be hard to do and somewhat timeconsuming, but it’s the way to go — because you will learn to discriminate and make choices (and that is what design is all about).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "4 Feb 2008 — 10:45am",
      "content": "I just can’t get with a sans serif for body text in a whole book. I see it all the time now in design books. So maybe they’re the “California” of books. (It seems that I see thing when visiting in California, and six months later they start to show up back home in New York.)\n\nAs a book designer, however, I’m hoping to find the project someday for which I’ll feel comfortable using Optima as the body face.\n\n"
    },
    {
      "time": "4 Feb 2008 — 11:34am",
      "content": "\"As an alternative, what about some minimalist slab serif in humanist proportions? \"\n\nLook at [Chaparral](http://web.archive.org/web/20150301011550/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1718) and [Seria.](http://web.archive.org/web/20150301011550/http:/www.fontshop.com/search/?q=seria&x=0&y=0)\n\n"
    },
    {
      "time": "4 Feb 2008 — 11:58am",
      "content": "It is true about sans and (esp. architectural and related) design books - they are all in sans. If they are not - they are likely historic or are about phenomenology and argue for the fundamental rightness of medieval-peasant life. Is the use of sans going to spread? I do not know. Nor am I in a position to judge. Where design is not supported by aggressive marketing, e.g., in architecture, non-designers prefer to like things of long ago. So, I am not surprised that people also prefer fonts of long ago. In this project, while it is necessary to make things readable, it is also important to make a statement on the value of the contemporary (or even technical)…\n\nThe idea that book texts need to be perceptually transparent to give unobstructed access to underlying content seems to belong to an age of unchallenged rationalism now long-gone. If the act of reading is creative, challenging the reader to do work is OK. E.g, cf. Russian “futurist” designs.\n\nThis all is diverging from the title of the thread now, of course…\n\n"
    },
    {
      "time": "4 Feb 2008 — 12:08pm",
      "content": "<cite>Look at Chaparral and Seria.</cite>\n\nThanks. Both are very nice but both lack that technical flavour I am after. Still, something to consider.\n\n"
    },
    {
      "time": "4 Feb 2008 — 12:13pm",
      "content": "Do you think anything from this parallel [thread](http://web.archive.org/web/20150301011550/http:/typophile.com/node/41654) on Tech Sans would do for longer texts too? Or are there similarly tech slabs?\n\nOf course I am willing to try test layouts! It is just I do not really know the existing palette.\n\n"
    },
    {
      "time": "5 Feb 2008 — 2:33am",
      "content": "PF Isotext? Are you on drugs? Nobody should have to read more than a paragraph in that. Even a paragraph is pushing it. It's a \\*display face\\* not a text face.\n\n\"If the act of reading is creative, challenging the reader to do work is OK.\"\n\nO-kaaay. Just don't expect me to buy or read the book. Nor to recommend it to anyone else I know.\n\nI have a number of design and architecture books, given to me by well-meaning friends, which I will never read - because the book designers thought they were above such issues as readability... sigh.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "6 Feb 2008 — 6:04am",
      "content": "Even the documenta 10 catalog from taschen Verlag was set in a serif (i guess it was Mercury from H&FJ) with the sans compagnion Akkurat from lineto.\n\n_Edit: Argh, it's the documenta 12 catalog_\n\nBTW  \nSome sans suggestions to look at. I think they could eventually work with a magazine-like content –\n\nFF Zwo  \n [http://www.fontshop.com/search/?q=zwo&x=0&y=0](http://web.archive.org/web/20150301011550/http:/www.fontshop.com/search/?q=zwo&x=0&y=0 \"http://www.fontshop.com/search/?q=zwo&x=0&y=0\")\n\nTaz III  \n [http://www.fontshop.com/search/?q=taz&x=0&y=0](http://web.archive.org/web/20150301011550/http:/www.fontshop.com/search/?q=taz&x=0&y=0 \"http://www.fontshop.com/search/?q=taz&x=0&y=0\")\n\nFF Unit  \n [http://www.fontshop.com/search/?q=unit&x=14&y=10](http://web.archive.org/web/20150301011550/http:/www.fontshop.com/search/?q=unit&x=14&y=10 \"http://www.fontshop.com/search/?q=unit&x=14&y=10\")\n\neventually s.th. from primetype, to \"get it colder\"; [http://www.primetype.com/](http://web.archive.org/web/20150301011550/http:/www.primetype.com/ \"http://www.primetype.com/\")\n\n"
    },
    {
      "time": "5 Feb 2008 — 8:36pm",
      "content": "Optima Nova might have enough legibility to get you through.\n\n"
    }
  ]
}
