{
  "id": "41629",
  "title": "mapping characters",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi,\n\nI use a certain font for writing musical chord symbols. Now I changed my software for creating sheet music. I would like to keep using my old font with the new software, but unfortunately for transposing, it requires that all twelve pitch names (A, A sharp, B flat etc.) are on certain places in the font. Which of course isn’t the case.\n\nI hoped there would be a way to map the characters in my old font according to the positions in the new font. E.g. a symbol that used to be on Unicode 0021 would have to go to 00A8 etc.\n\nAs this is not possible from within the software, can anyone suggest a way to do this outside? It only concerns 5 characters, so it would be ok to spend an hour doing it. However, I wouldn’t want to buy software for this issue...\n\nThanks a lot.\n\nPeter\n\n [‹ Opentype 'salt' feature error](http://web.archive.org/web/20080310054729/http:/www.typophile.com/node/41707 \"Go to previous forum topic\") [Font conflict with Helvetica Neue in Leopard, FontExplorer X ›](http://web.archive.org/web/20080310054729/http:/www.typophile.com/node/41591 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080310054729/http://www.typophile.com/user/26654\" title=\"View user profile.\">PeterShaw</a>",
  "time": "<br>",
  "uid": "26654",
  "comments": [
    {
      "time": " 2.Feb.2008 12.43am",
      "content": "If the fonts you’re working with are in TrueType format, and you’re not averse to hand-editing text files (as opposed to working with a GUI), have a look at [TTX](http://web.archive.org/web/20080310054729/http:/www.letterror.com/code/ttx/index.html). It’s free and it will let you do what you’re trying to do.\n\nYou can download Windows and Macintosh versions from the <cite>ttx binaries</cite> section on [this page](http://web.archive.org/web/20080310054729/http:/sourceforge.net/project/showfiles.php?group_id=29196).\n\nIf you’re using Windows, I compiled a newer version of TTX a while back that you can download from [Adam Twardoch’s TTX page](http://web.archive.org/web/20080310054729/http:/www.font.org/software/ttx/).\n\n"
    },
    {
      "time": " 2.Feb.2008 7.33am",
      "content": "Thank you, Spire, it looks like this is the solution to my problem. But unfortunately I can’t quite figure out what to change in all this data.\n\nCan you give me a hint?\n\nThanks a lot again.\n\nPeter\n\n"
    }
  ]
}
