{
  "id": "41624",
  "title": "woody allen's favorite typeface",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "lot’s of typographical posts on boingboing today.\n\nthis one is a funny story:\n\n[http://kitblog.com/2007/12/woody\\_allens\\_typography.html](http://web.archive.org/web/20080907212735/http:/kitblog.com/2007/12/woody_allens_typography.html \"http://kitblog.com/2007/12/woody\\_allens\\_typography.html\")\n\n [‹ what does ah or ahh suggest to you?](http://web.archive.org/web/20080907212735/http:/typophile.com/node/41574 \"Go to previous forum topic\") [Any new/nice heavy slap serifs–Aachen Bold ›](http://web.archive.org/web/20080907212735/http:/typophile.com/node/41627 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907212735/http://typophile.com/user/16657\" title=\"View user profile.\">Ch</a>",
  "time": "<br>",
  "uid": "16657",
  "comments": [
    {
      "time": " 1.Feb.2008 9.27pm",
      "content": "That was interesting! Thanks for sharing, Chris.\n\nIncidentally a hardback copy of Without Feathers that I have has the title set in the same face.\n\n"
    },
    {
      "time": " 2.Feb.2008 7.34am",
      "content": "I have Side Effects (can’t ID the font but not Windsor) and Getting Even (set in Benguiat - UGH). But both white type on black background.\n\nEven though the Woodman’s recent movies have been uneven (I’m being kind) there is always something comforting about the tinkly jazz and the Windsor, it lets me know where I am.\n\n"
    },
    {
      "time": " 2.Feb.2008 8.02am",
      "content": "I miss the old days, when he used to bring his clarinet down to Michael’s Pub on Monday nights....\n\n"
    },
    {
      "time": " 2.Feb.2008 11.31am",
      "content": "Linda - if you ever heard him play you wouldn’t miss those days. But I think he might still have a regular gig somewhere.\n\nYep - just checked. He’s at the Carlyle mondays through at least June.\n\n"
    },
    {
      "time": " 2.Feb.2008 11.53am",
      "content": "I made it down to Michael’s a few times but only caught him once — he wasn’t all that bad, but that was 25 years ago.... ;-) Too bad I won’t be in town on a Monday.\n\n"
    },
    {
      "time": " 3.Feb.2008 5.19am",
      "content": "When my friend Jimmy Harris was alive - at one point of his life he was the art director of trade books for Ballantine Books. He designed those Woody Allen covers. It was in Woody Allen’s contract that the covers would be designed white Windsor type on a solid black background and never his photo as the author.\n\nHere is one funny story he shared with me, that I’d like to share with you now. Jimmy wanted an author’s photo on the back of one of Allen’s books. He asked the author if he wouldn’t mind coming in and placing his face on the xerox machine — he felt it would be in style with the front of the book. Anyway Woody Allen declined, we are sorry to say. I think smashed Allen would have been a great photo!\n\n"
    }
  ]
}
