{
  "id": "41633",
  "title": "maybe a stupid question about fontlab",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hello everybody,\n\ni’m just starting out using fontlab, on the recomandation of a few nice people here i ordered the “lessie cabarga / learn fontlab fast” book but haven’t received it yet.\n\nin the meantime i’m hoping someone here can help me out with a lilt problem i’m having in fontlab, maybe its a stupid question but i can’t seem to figure it out for myself.\n\nproblem 1:\n\nthe font i’m making has lots of slant lines, but how do i make every slant line have the exact same angle degree? what function in font lab do i use to make sure everything has the exact same angle degree..width..\n\ni have posted a screenshot maybe that clears out my question a bit.\n\n[http://users.telenet.be/productions\\_image/sll1.jpg](http://web.archive.org/web/20080405200041/http:/users.telenet.be/productions_image/sll1.jpg \"http://users.telenet.be/productions\\_image/sll1.jpg\")\n\ni would really appreciate the help\n\nkind regards\n\nOmar\n\n [‹ in search of a digital Alphabet 26](http://web.archive.org/web/20080405200041/http:/www.typophile.com/node/41638 \"Go to previous forum topic\") [Purchasing DTL Dorian. What do you think? ›](http://web.archive.org/web/20080405200041/http:/www.typophile.com/node/41523 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080405200041/http://www.typophile.com/user/25150\" title=\"View user profile.\">omar</a>",
  "time": "<br>",
  "uid": "25150",
  "comments": [
    {
      "time": " 2.Feb.2008 5.50am",
      "content": "Omar,  \nUse the rotate feature and type in whatever number of degrees you want. You can also make some components that are triangles of the desired degrees and mirror and rotate them as needed. You can copy and paste the parts from glyph to glyph.\n\nChrisL\n\n"
    },
    {
      "time": " 2.Feb.2008 6.30am",
      "content": "thank you for helping dezcom, i’m going to try it now and let you know how i did...cheers\n\n"
    },
    {
      "time": " 2.Feb.2008 7.11am",
      "content": "I would recommend that you pick up Leslie’s book _The Complete Logo, Font, and Lettering Bible_ to complement _Learn Fontlab Fast_. It’s full of useful construction techniques like the one Chris mentioned, fully illustrated and dripping with humor. That book is so good I had a very hard time not giving Leslie a big hug when I met him last summer.\n\n"
    },
    {
      "time": " 2.Feb.2008 9.04am",
      "content": "thnx for the tip james...whenever i saved up some more money i will buy it..i’m just a poor graphic design student trying to make ends meet.\n\n@dezcom thnx again, it worked!\n\ncheers guys have a nice weekend\n\n"
    }
  ]
}
