{
  "id": "41650",
  "title": "Joy Division Closer Font",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "A long time ago I tried to get the font from the cover of Joy Division's Closer album identified. See [This thread](http://web.archive.org/web/20150418180638/http:/typophile.com/node/32322)\n\nThere were no positives, so I decided to digitize it myself. It was missing three letters that I had to make myself. Can you guess which ones?\n\nMy first font, too.\n\n ![](http://web.archive.org/web/20150418180638im_/http:/typophile.com/files/joy_5745_5436.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [CLOSER.pdf](http://web.archive.org/web/20150418180638/http:/typophile.com/files/CLOSER.pdf) | 9.53 KB |\n\n",
  "author": "Dan Gayle",
  "time": "2 Feb 2008 — 11:26pm",
  "uid": "12948",
  "comments": [
    {
      "time": "2 Feb 2008 — 11:28pm",
      "content": "The kerning looks weird to me in this setting. I went through and kerned the heck out of it in Fontlab, but it's not showing up well in InDesign or Photoshop. Any suggestions?\n\n"
    },
    {
      "time": "2 Feb 2008 — 11:51pm",
      "content": "Looks lovely Dan.\n\nThe slightly different ones seem to be the 'X' and the 'K'. Can't tell which could be the third.\n\n"
    },
    {
      "time": "3 Feb 2008 — 12:43am",
      "content": "Q, X and Z?\n\n"
    },
    {
      "time": "3 Feb 2008 — 12:50am",
      "content": "What's funny is that you both have the X, but that's original :)\n\n"
    },
    {
      "time": "3 Feb 2008 — 1:04am",
      "content": "The three you designed yourself: K, Q, Z.\n\nCrits:\n\n\\* B could be wider  \n\\* T more could be done with the serifs  \n\\* W looks wide  \n\\* Z could be narrowed\n\nOtherwise it's sweet Dan.\n\nj a m e s\n\n"
    },
    {
      "time": "3 Feb 2008 — 1:18am",
      "content": "Dan - did you confirm that the letters were drawn by Saville? I don't think he does that sort of work.\n\n"
    },
    {
      "time": "3 Feb 2008 — 2:47am",
      "content": "@Stewf  \nI never was able to figure out who did the original type. From the inconsistencies, it actually might have been hand lettered. I guess I could give a phone call or email to somebody somewhere.\n\nI forgot to mention that in the image above, the first four lines isn't my font. It's the actual scan. Not bad, eh?\n\n@James  \nThe B is about the same as the S, so I don't see it as a major inconsistency. The W is humongous, but that's not a problem to me. I followed very closely the original proportions, so I'd rather not mess with them.\n\nBut the Z I can fix, as you've noted that I built that puppy myself.\n\nWhat does everyone think of the K? I looked around for different K's that might match the style, but the one I created just felt better.\n\n"
    },
    {
      "time": "3 Feb 2008 — 5:52am",
      "content": "You can get a free version of the 'Closer' typeface [here](http://web.archive.org/web/20150418180638/http:/www.btinternet.com/~comme6/saville/fonts.htm).\n\n"
    },
    {
      "time": "3 Feb 2008 — 6:26am",
      "content": "No, you can't.\n\nThat font certainly is NOT the same font that is on the cover of Closer. Close, but not Closer.\n\nWhat is more, it is an SSi font called Helios that has been illegally re-branded and distributed. They couldn't even be bothered to change the copyright info.\n\n"
    },
    {
      "time": "3 Feb 2008 — 6:44am",
      "content": "Hello!\n\nI like the classic romans type, this type has good things, but some need adjustment  \nAs allways i leave you my suggestion, take it or leave it, but i hope i can help:\n\n+ You have problems with the widness of the letters. What romans did was construct the letters from squares, triangles, circumsferences and half a square.  \n+ The \"J\" looks original but it might be confused with the \"I\", try making it more different  \n+ The \"V\" is bold  \n+ The top \"F\" arm is thin if you compare it to the \"E\", the middle arm should be at the same heigt in E and F.  \n+ The \"I\" might be bold  \n+ The lower arm of the \"K\" might be bold, compare it with the \"R\"\n\nHope i could help a bit\n\nkeep up the work!\n\nFerch\n\n[Tipografía-Montevideo](http://web.archive.org/web/20150418180638/http:/www.tipografia-montevideo.info/)\n\n"
    },
    {
      "time": "3 Feb 2008 — 6:45am",
      "content": "\"What’s funny is that you both have the X, but that’s original...\"\n\nYet, doesn't it seem to have a relatively lower waistline?\n\n"
    },
    {
      "time": "3 Feb 2008 — 6:59am",
      "content": "<cite>What is more, it is an SSi font called Helios that has been illegally re-branded and distributed.</cite>\n\nIs that worthy of being called ironic?I think that is the company all the font-makers were in a dither about back when I was just starting to realize there were copyright issues with fonts. In comp.fonts there used to be some heated discussions when the company president Paul Hunt would pop in to defend himself, and everyone would attack with such ferocity, I sort of felt sorry for him. I guess it all helped draw the lines of what is allowed.\n\n(In time I have come to find that ferocious attacks can come from a few misinterpreted statements, so it is best not to take things too seriously)\n\n"
    },
    {
      "time": "4 Feb 2008 — 7:01am",
      "content": "_The B is about the same as the S, so I don’t see it as a major inconsistency._\n\nThis is good :^) This is where the \"could be\" clause comes into play. There is something about S, as structures go, that makes it more natural in narrow form. The narrow B, P and R look fine.\n\nj a m e s\n\n"
    },
    {
      "time": "4 Feb 2008 — 12:53pm",
      "content": "@Strass  \nI didn't design the widths. That's someone else's deal. I just stayed true to the outlines.\n\nAs to the other bits, I can certainly work on the weights of a few of them. The K I have carte blanche on, so I'll work on it.\n\n@Fontplayer  \nThat SSi stuff is hilarious. I wonder where the original Helios came from :)\n\n"
    },
    {
      "time": "4 Feb 2008 — 1:48pm",
      "content": "<cite>That SSi stuff is hilarious. I wonder where the original Helios came from :)</cite>\n\nI Adobe was a big part of the lawsuit against SSi, so that is where I'd start looking.\n\nIt was many years ago (the early '00s). If Typophile existed back then, there was probably a big discussion going on here, since the outcome would directly affect many in the industry.\n\n"
    },
    {
      "time": "5 Feb 2008 — 2:46am",
      "content": "The lawsuit ended in early 1998, after the judge made a summary judgment in favor of the plaintiffs on some key points.\n\n[http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4](http://web.archive.org/web/20150418180638/http:/directory.serifmagazine.com/Ethics_and_Law/Copyright/judgement.php4 \"http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4\")\n\nGiven the history of thousands of other SSi typefaces, unless shown otherwise it is reasonable to guess that \"Helios SSi\" is a \"knock-off\" of some earlier typeface.\n\n"
    },
    {
      "time": "5 Feb 2008 — 2:50am",
      "content": "It's hard for me to comment much on a revival or reinterpretation without being familiar with the original. But I do note that besides some spacing issues, it seems like the rounds don't have enough overshoot. Very noticeable on the \"O\" and a bit on the \"C' and other rounds as well.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "5 Feb 2008 — 6:35am",
      "content": "_SSi ....company president Paul Hunt_\n\nLets nip this bit of confusion in the bud. Paul Hunt may want to moderate this himself, but he was not the man behind SSi.\n\n"
    },
    {
      "time": "5 Feb 2008 — 7:25am",
      "content": "<cite>The lawsuit ended in early 1998...</cite>\n\n<cite>Paul Hunt may want to moderate this himself, but he was not the man behind SSi.</cite>\n\nI can't believe it has been that long.\n\nI apologize for not getting my facts straight. The way he was being attacked in comp.fonts, it seemed he was the one on trial.\n\nI tended to side with him, as my font sensibilities were somewhat communistic back then. \"Free the fonts for the people!\" might have been the rallying cry. How dare the capitalistic bastards charge $40 for something as 'simple' as a font. Do they think they own the alphabet, or something?  \n; )\n\n"
    },
    {
      "time": "5 Feb 2008 — 7:34am",
      "content": "Mr Schwartz drew my attention to this thread.\n\nThe original lettering for the ‘Closer’ album was taken from ‘The Development of Writing’ by Hans Eduard Meier, which I believe was first published in the late 1950s and then in the late 1960s. The later reissue no longer shows this piece of lettering, though you can find it here [http://www.textism.com/writing/?id=6](http://web.archive.org/web/20150418180638/http:/www.textism.com/writing/?id=6 \"http://www.textism.com/writing/?id=6\"). Its a very nice piece of work, even though the letter J is a little unconvincing. Perhaps its unfamiliarity makes it more appealing than the ubiquitous Trajan\n\nSaville then made PMTs of the lettering and then composed all of the lines. The use of Roman numerals on ‘Closer’ is a give away that Saville could not draw letters (or numerals). In the 1990s Tobias Frere Jones was interested in making a digital revival, but nothing came of it I understand. A digital version was made I believe for the reissues.\n\nI hope this clears up the confusion.\n\n"
    },
    {
      "time": "5 Feb 2008 — 9:53am",
      "content": "Wow. I searched all over for that info, but it's hard to find. I was about to hop on the phone and start calling someone. Thanks a lot for the info. I'll have to hunt the book down if I can to get a higher res scan.\n\nIf there was a digital version made for the reissues, it would have been sweet to use for the movie.\n\n"
    },
    {
      "time": "5 Feb 2008 — 10:27am",
      "content": "I believe that Peter was asked to do them for both movies, but was unavailable.\n\n"
    },
    {
      "time": "5 Feb 2008 — 11:56pm",
      "content": "[http://sleevage.com/wp-content/uploads/2007/12/worfjd.jpg](http://web.archive.org/web/20150418180638/http:/sleevage.com/wp-content/uploads/2007/12/worfjd.jpg \"http://sleevage.com/wp-content/uploads/2007/12/worfjd.jpg\")\n\nViolent mating rituals will tear us apart\n\n"
    },
    {
      "time": "6 Feb 2008 — 12:16am",
      "content": "That's the dumbest image I've seen in a long time. And yet... a chuckle... :)\n\n"
    },
    {
      "time": "6 Feb 2008 — 6:03pm",
      "content": "So here's a question, do you think if I fixed it up nice and pretty I could sell it? Or, is it just the kind of thing that I should just mark up to \"practice\" and give it away?\n\n"
    },
    {
      "time": "6 Feb 2008 — 7:11pm",
      "content": "<cite>Lets nip this bit of confusion in the bud. Paul Hunt may want to moderate this himself, but he was not the man behind SSi.</cite>\n\nMan, am I ever sloooow. I just had a flashback. I meant Paul King.\n\nSorry Paul!\n\n"
    },
    {
      "time": "7 Feb 2008 — 4:18pm",
      "content": "Given how often Trajan is used and how few good alternates (let alone alternates with a bit more character) there are I'd say you could sell this. Will you do Cyrillic and Greek too?\n\n"
    },
    {
      "time": "7 Feb 2008 — 5:45pm",
      "content": "Good thoughts. Perhaps some of that fancy Roman Numeral opentype coding that is oft rumored?\n\nCyrillic and Greek? I hadn't thought about it. I'd like to flesh out the Western European UC character set before I even consider designing those badboys. (Now that I think about it, Greek Inscriptionals aren't too far removed from the Roman, are they? Perhaps it's something I should look into.)\n\n"
    },
    {
      "time": "7 Feb 2008 — 5:59pm",
      "content": "Just did a little counting in the ole' Fontlab, and I guess I'm only needing ten characters for UC Greek. Cool. That should be fun and instructional. Let's see about Cyrillic...\n\nAhhh. Has a bit more letters to create, but they all seem to be basic constructions that can be hashed together using current parts. Sweet!\n\n"
    },
    {
      "time": "8 Feb 2008 — 4:14am",
      "content": "And design the lowercase glyphs and the figures to complete the font?\n\nPieter\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:17am",
      "content": "No lowercase! See [This Thread](http://web.archive.org/web/20150418180638/http:/www.typophile.com/node/28295)\n\n"
    },
    {
      "time": "11 Feb 2008 — 3:05am",
      "content": "I would think that without the permission of Meier you could not make it available commercially.\n\n"
    },
    {
      "time": "11 Feb 2008 — 5:32am",
      "content": "_Given how often Trajan is used and how few good alternates (let alone alternates with a bit more character)_\n\nMeow-miow! Trajan is a major cliché. The Trajan inscription may be the finest example of Roman inscriptional capitals, but it is far from representative of the vast bulk of carved lettering left behind by the Romans. It's stereotypical only.\n\nI've seen some recent TV documentaries with pictures of incriptional capitals left by the Romans in Northern Africa, and the forms are quite different to the Trajan things. The Northern African inscriptions are remarkably close to Bodoni/Didone capitals, but with angled stressing instead of Bodoni's vertical stressing. I'm not kidding. Fat strokes and stems with hairline serifs. The hairline serifs aren't hairline as we know it, but somehow they managed to carve quite thin lines in stone. 'mazing.\n\n_Perhaps some of that fancy Roman Numeral opentype coding that is oft rumored?_\n\nYes, do it dude. Roman numerals are a bitch for maths, but they're fun to contemplate. A real blast from the past. I'm impressed by your grasp of ancient history Dan.\n\n_So here’s a question, do you think if I fixed it up nice and pretty I could sell it? Or, is it just the kind of thing that I should just mark up to “practice” and give it away?_\n\nCheck with the creators / owners of the original typeface first. They're the best people to ask. Certainly you can chalk this one up to practice, but don't give it away for zero cash outlay without first ascertaining if the people who matter have any objections. Play it safe.\n\nj a m e s\n\n"
    },
    {
      "time": "11 Feb 2008 — 10:42am",
      "content": "_I would think that without the permission of Meier you could not make it available commercially._\n\nHe's still alive, so maybe you're right. Not in a legalistic way, but perhaps in a moral way. Couldn't hurt to give Otmar Hoefer over at Linotype a ring. He'd be able to find Mr. Meier for me.\n\n"
    },
    {
      "time": "11 Feb 2008 — 11:32am",
      "content": "_Check with the creators / owners of the original typeface first. They’re the best people to ask._\n\nWell, according to [this image](http://web.archive.org/web/20150418180638/http:/www.textism.com/writing/?id=6) Mr Barnes linked to, the typeface is a Roman Lapidary from the first century AD, so asking the creators may become the hardest part in producing this font ;)\n\nAnyway, typeface designs are not protected by copyright in most countries. And most surely not if they are just an accurate rendition of something conceived 2000 years ago.\n\nCheers,  \nJens.\n\n"
    },
    {
      "time": "14 Feb 2008 — 6:15pm",
      "content": "Ok, I've fixed the missing letters according to the link from Mr Barns (Thanks!)\n\nI've also added Greek capitals. That's hard stuff! Let me know what you think of the letterforms of the Greek. I have tweaking I need to do, and no spacing has been done yet.\n\nThanks!\n\n ![](http://web.archive.org/web/20150418180638im_/http:/typophile.com/files/pic-1_4891.gif)\n\n"
    },
    {
      "time": "16 Feb 2008 — 9:08pm",
      "content": "Nice! I think offering alternates for some of the the letters would make this more widely useable - J, V, and B, maybe others.\n\nFor the Greek: the pi looks a bit odd - the left stem seems unnecessarily angled. The gamma, phi, xi, and theta all seem a but anemic to me. The sigma seems top-heavy to me. The psi seems fruity. ;)\n\nI think in general the Roman letters look stronger than the Greek - the Greek might need to be thickened up to compensate for the less rectilinear letterforms.\n\n(Disclaimer - I am typographically ignorant!)\n\n"
    },
    {
      "time": "16 Feb 2008 — 11:22pm",
      "content": "\"(Disclaimer - I am typographically ignorant!)\"\n\nBla. What kind of thing to say is that? You obviously have an eye for something, because you are on the mark for your critiques. The eye is the final arbiter of taste.\n\nI'll work on some of the things you've mentioned.\n\n(By the way, the links on your home page don't work. JFYI)\n\n"
    },
    {
      "time": "17 Feb 2008 — 3:38pm",
      "content": "Ugh, my front-page SiFR links had stopped working, even though I hadn't changed anything - did a quick and very ugly short-term fix! Thanks. :)\n\n"
    },
    {
      "time": "31 May 2008 — 2:28pm",
      "content": "Tom Perkins – a letter carver based in England and whose fluency in drawn lettering is second to none – has written at length about the geometry of Roman Lettering in the book \"Font\" published by The Ditchling Museum and the Edward Johnston Foundation. It inludes his own drawings of the Trajan letters. His book \"The Art of Letter Carving in Stone' as well as being a sumptous record of lettercarving today again has detailed drawing of the Trajan letters. All the best with your project.\n\n"
    },
    {
      "time": "8 Jun 2008 — 10:08pm",
      "content": "Thanks for the resources. I'll be sure to look them up :)\n\n"
    },
    {
      "time": "11 Jun 2008 — 11:32am",
      "content": "@Jens Kutilek: _Anyway, typeface designs are not protected by copyright in most countries. And most surely not if they are just an accurate rendition of something conceived 2000 years ago._\n\nDude, it's a matter of ethical conduct and moral obligation to respect the design work of others, especially your contemporaries. Just because typeface designs are not protected by copyright in most countries does not make distributing a copy of an existing type design right. Dan has copied the work of contemporary designers who **based** their typeface on Roman letters from 200 years ago. The Joy Divison Closer type is **not** an accurate rendition of something conceived 2000 years ago.\n\nYou really, really piss me off man (Jens). Don't come here and tell falsehoods or misconstrue the letter of the law. I will drive you away. You need lessons in ethics. You need to wake up to yourself and your misanthropy.\n\nWhy is it so often Germans who harp on technicalities? Because they're a technically-minded people. That's not a racist comment or a personal attack. It's an accurate observation with no overtones or negative implication. All you get me on this one is the straight dope.\n\nj a m e s\n\n"
    },
    {
      "time": "24 Jun 2011 — 11:06pm",
      "content": ",\n\n"
    },
    {
      "time": "27 Jul 2011 — 9:07am",
      "content": "@James: Basically, the Closer lettering is lettering, not a typeface.  \nThus, it would be nice to notify the lettering designer if DanGayle decides to commercialize his digital typeface, but in strict sense, here we have someone turning lettering into a digital typeface, which is quite different from copying a contemporary, pre-existing typeface.\n\nI agree on the obligations side, anyway. Even just by saying: hey, I'm doing this, based upon your work..\n\n"
    },
    {
      "time": "20 Apr 2012 — 3:27pm",
      "content": "So what is the final verdict? Has a font been made?\n\n"
    }
  ]
}
