{
  "id": "41653",
  "title": "'Forma', Nebiolo, Novarese",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Dear fellow Typophiles,\n\nI am currently _(desperately)_ seeking sample settings, specimens and basically every single image showing the typeface 'Forma', by Aldo Novarese, for Nebiolo _(Società Nebiolo)_.\n\nAs usual, I am very thankful, for every single hint / image / link.\n\nThank you,  \nDav(id)\n\n",
  "author": "Dav",
  "time": "3 Feb 2008 — 2:17am",
  "uid": "977",
  "comments": [
    {
      "time": "3 Feb 2008 — 6:03am",
      "content": "David,\n\nI have a nice old Nebiolo specimen. I'll se what I can find (and scan for you). Thirst thing Monday morning.\n\nCheers\n\n"
    },
    {
      "time": "3 Feb 2008 — 6:05am",
      "content": "Also I know that my friend Peter Bruhn ( [http://www.fountain.nu](http://web.archive.org/web/20150409035326/http:/www.fountain.nu/ \"http://www.fountain.nu\")) has yet another super nice Nebiolo specimen book. Please check with him as well.\n\n"
    },
    {
      "time": "3 Feb 2008 — 6:17am",
      "content": "Hi David,  \nI have sent you a message. The catalog in possession of Peter, as Stephan suggested, should not have Forma in it, since it is from the 1950s and Forma was designed in the 1960s.\n\nEdit: Stefan, if you hear Rodrigo Cavazos, send him a big hug from me! :=)\n\n"
    },
    {
      "time": "3 Feb 2008 — 6:57am",
      "content": "Thanks a lot for your help/replies, Stefan and Claudio.  \nStefan, that would be great, if you could take a look. Thanks.  \n_(Claudio, I just sent you a reply, off site. Thank you. I also contacted some more people I remembered once noting/stating that they have Nebiolo specimens. I have/own one myself, but mine is older than the release of 'Forma', as well, I am afraid.)_ Thank you, so much.\n\nDav(id)\n\n"
    },
    {
      "time": "3 Feb 2008 — 9:22am",
      "content": "[http://www.tipoteca.it](http://web.archive.org/web/20150409035326/http:/www.tipoteca.it/ \"http://www.tipoteca.it\")\n\n"
    },
    {
      "time": "4 Feb 2008 — 3:09am",
      "content": "Claudio,\n\nYou're right of course. Having checked my book at the office, it's \"pre Forma\" ;-) Anyway I found another specimen in the ever useful \"Encyclopaedia of Type faces\" by Jaspert, Berry & Johnson. And yes I will send your regards to Rodrigo next time I speak to him.\n\nDavid,  \nI've sent you a scan of the mentioned specimen above.\n\nSalute\n\n"
    },
    {
      "time": "4 Feb 2008 — 4:40am",
      "content": "Thank you very, very much, Stefan.  \n_(And thanks as well, for the reference/specimen book suggestion.)_\n\nDav(id)\n\n"
    },
    {
      "time": "4 Feb 2008 — 10:20am",
      "content": "I've got a specimend by Caratteri Nebiolo. It's a blue and gold version without Formo in it. Could somebody put a small scan of Formo online? I would love to see it.\n\n"
    },
    {
      "time": "5 Feb 2008 — 6:22am",
      "content": "David, I have not forgotten you… Just have some patience, please… :=(\n\nEDIT: Forma was released by Nebiolo in 1968.\n\n"
    },
    {
      "time": "5 Feb 2008 — 1:10pm",
      "content": "@Dries: I try to post a small sample.  \nThis is Forma Chiarissimo:\n\n ![](http://web.archive.org/web/20150409035326im_/http:/typophile.com/files/Forma420sample_6024.gif)\n\n"
    },
    {
      "time": "14 Feb 2008 — 10:44pm",
      "content": "To all those who helped me in my quest to find further information on the 'Forma' typeface — [Thank you so much](http://web.archive.org/web/20150409035326/http:/for.ma/blog/?p=108).\n\nAfter 'some' more extensive (re)search it seems I finally found that a digitalisation / digital version of 'Forma' actually may exist. Brendel/AQBF/(EF)TypeShop/SoftMaker currently 'distribute' a typeface named 'Formula', which seems to be based on 'Forma'.\n\nTypophile.  \nMaking the world a more beautiful place.  \nOne typeface at a time. ;)\n\nDav(id)\n\n"
    },
    {
      "time": "16 Feb 2008 — 1:24pm",
      "content": "Glad to be of help, David. I have not forgotten I have to send you other pages, please just have a little patience… :=(\n\nP.S. The Brendel reference is interesting, although they seem they produced a lot of \"hacked\" typefaces without licenses, so who knows where that \"Formula\" could come from…  \nKeep me informed if you make other discoveries… :=)\n\nP.S.2: May I ask you why you like Forma so much?\n\n"
    },
    {
      "time": "16 Feb 2008 — 6:30pm",
      "content": "Claudio, Hmm, Why do I like 'Forma'? I may as well admit that I don't really 'love it to death', but first of all, it sure may be because 'Forma' also is the name of a 'Design Bureau', I am currently establishing. ;) _(Forma/formlos)_ And it's also a nice alternate to the known more or less 'neutral' Sans Serif types, like Helvetica, Akzidenz Grotesk, or Univers. _(Quite a mixture of influences. And maybe the 'lowest common denominator' of/in all these. ;)_\n\nDav(id)\n\n"
    }
  ]
}
