{
  "id": "41675",
  "title": "help please??",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hello, i have bought a type face from a download website. it has downloaded as a zip file onto my desktop. the problem is i dont no how to asign it to any softwares such as illustrator or indesign. i down loaded mac post script is that right?\n\nthanks for any help\n\njoel\n\n",
  "author": "joel stephens",
  "time": "3 Feb 2008 — 11:26pm",
  "uid": "22820",
  "comments": [
    {
      "time": "3 Feb 2008 — 11:47pm",
      "content": "I guess you are using a mac computer?\n\nI would advise you to use fontexplorer. It's a free font management application.  \n [http://www.linotype.com/fontexplorerX](http://web.archive.org/web/20131022043603/http:/www.linotype.com/fontexplorerX \"http://www.linotype.com/fontexplorerX\")\n\nJust download and copy to your applications directory. After that start up the program (just double click), then you can drag and drop the font files into the application window and that should do the trick for you.  \nWhen you then start any application (illustrator, indesign) you will find the font in the font list of the application.\n\ngood luck.  \ndav2.\n\n"
    },
    {
      "time": "3 Feb 2008 — 11:47pm",
      "content": "Hi Joel,\n\n1. You have to unzip the zip file. That will bring you a folder with the font files (and, normally, some other files like the EULA etc.) I assume you are on Mac OSX? Then just doubleclick the zip file.\n\n2. The font has to be activated, so that applications can use it. If you don’t have a lot of fonts, the easiest way is to move the files to your Fonts folder (_Your-User-Name_ /Library/Fonts)\n\n<cite>mac post script is that right?</cite>\n\nDepends. But (still assuming you’re on Mac OSX, that is) that should work just fine.\n\nF\n\n"
    },
    {
      "time": "4 Feb 2008 — 12:00am",
      "content": "See the [Support pages](http://web.archive.org/web/20131022043603/http:/www.myfonts.com/support/) of Myfonts for example for further questions …\n\n"
    }
  ]
}
