{
  "id": "41692",
  "title": "URGENT - sanskrit devanagari open license font",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Could anyone point me towards a wide license FOSS all uses - commercial, non-commercial, personal and academic [sanskrit](http://web.archive.org/web/20131010193939/http:/www.typophile.com/wiki/sanskrit) [devanagri](http://web.archive.org/web/20131010193939/http:/www.typophile.com/wiki/devanagari) font please ?\n\n",
  "author": "fontana",
  "time": "4 Feb 2008 — 12:08pm",
  "uid": "25758",
  "comments": [
    {
      "time": "4 Feb 2008 — 12:48pm",
      "content": "here are your current choices if you go the free route:  \n [http://salrc.uchicago.edu/resources/fonts/available/sanskrit/](http://web.archive.org/web/20131010193939/http:/salrc.uchicago.edu/resources/fonts/available/sanskrit/ \"http://salrc.uchicago.edu/resources/fonts/available/sanskrit/\")\n\nyou'll have to read the licenses yourself to make sure they fit your needs. g'luck!\n\n"
    },
    {
      "time": "4 Feb 2008 — 1:11pm",
      "content": "I don't know a lot about licenses, but from the list Paul linked to, CDAC's Yogesh and Jana Sanskrit would be your best bets in terms of outlines, design, etc. The newer version of Mangal that ships with Vista is also quite a nice option, in my opinion, but I don't know if that falls under your FOSS umbrella. Do you FOSS-fans use Windows? I don't know anything about FOSS :(\n\nThese three I mentioned are all Unicode-encoded OpenType fonts, and will work nicely in Windows. Maybe they'd work on other OSes, too… I don't work with Linux or any of these free operating systems, so I can't vouch for them. But you certainly cannot use these fonts properly in Mac OS, since they aren't AAT format.\n\nCan you tell us more about what it is exactly that you're looking for, fontana? Do you just want to set documents on your computer and print them out yourself, or are you creating something more specific? What sort of look are you going for? Scholarly, contemporary, something else?\n\n"
    },
    {
      "time": "4 Feb 2008 — 1:32pm",
      "content": "The usage is mentioned on this post, [http://typophile.com/node/40734](http://web.archive.org/web/20131010193939/http:/typophile.com/node/40734 \"http://typophile.com/node/40734\")\n\n"
    },
    {
      "time": "4 Feb 2008 — 2:10pm",
      "content": "found a few more:\n\n[http://sanskritweb.org/itrans/index.html#SANS2003](http://web.archive.org/web/20131010193939/http:/sanskritweb.org/itrans/index.html#SANS2003 \"http://sanskritweb.org/itrans/index.html#SANS2003\")\n\nagain, check the licenses to see if they fit your needs.\n\n"
    },
    {
      "time": "4 Feb 2008 — 2:39pm",
      "content": "Fontana, what you are asking then is that you are looking for a font whose Devanagari glyphs you can take and then map these onto a Latin keyboard in a new font, right? So you want to create your own Devanagari font with non-standard encoding?\n\nSome of the fonts that Paul has linked to may allow you to do this, but I don't know. You should track down the producers of the fonts (the URLs of the fonts' producers are often inside the Font Info section of the font files… at least for the fonts that Paul has linked to, I think) and check with them first.\n\n"
    },
    {
      "time": "4 Feb 2008 — 3:03pm",
      "content": "if what you want is to input latin characters and get Devanagari output, you should check out the Google Indic transliterator:  \n [http://www.google.com/transliterate/indic/](http://web.archive.org/web/20131010193939/http:/www.google.com/transliterate/indic/ \"http://www.google.com/transliterate/indic/\")\n\n"
    },
    {
      "time": "5 Feb 2008 — 11:30am",
      "content": "Font Community\n\nI have font design and font layout questions:\n\nHow much does it cost to design a 1 letter sanskrit font for use on a customised FOSS font, any offers / takers?\n\nHow much does it cost to program a font layout, any offers / takers?\n\n"
    }
  ]
}
