{
  "id": "41700",
  "title": "Help me trim an 'f'",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I need to trim the tail from an italic lowercase f using monotype modern bold italic ('original' below). It isn't my preference to do so, but it is the lesser of 2 evils on a project with a fast-approaching deadline. Which of these do you think works? Do you think it should taper at all? Or should it be the same width right to the bottom?\n\nHere are pics for the original, 1 (some), 2 (less), 3 (less still).\n\nAlternately, could anyone suggest a lowercase f that doesn't have a tail that would match this?  \nthanks in advance!  \nJennifer\n\n ![](http://web.archive.org/web/20120624054521im_/http:/typophile.com/files/orig_4256.png)\n\n ![](http://web.archive.org/web/20120624054521im_/http:/typophile.com/files/1_6725.png)\n\n ![](http://web.archive.org/web/20120624054521im_/http:/typophile.com/files/2_5434.png)\n\n ![](http://web.archive.org/web/20120624054521im_/http:/typophile.com/files/3_5403.png)\n\n",
  "author": "Jennifer",
  "time": "4 Feb 2008 — 1:44pm",
  "uid": "10115",
  "comments": [
    {
      "time": "4 Feb 2008 — 2:27pm",
      "content": "I don't have your perspective on this, and please consider that I am not a type designer…\n\nYou may have trouble keeping the descender depth right while trying to keep the weight right as well. One option might be to build some haphazard swash character and avoid the descender completely.\n\n ![](http://web.archive.org/web/20120624054521im_/http:/typophile.com/files/SFU_4020.gif)\n\nI'm sure someone will bring it to our attention if this a particularly awful idea.\n\n"
    },
    {
      "time": "4 Feb 2008 — 2:37pm",
      "content": "That's a neat idea!\n\nI'm not a type designer either, clearly. :)\n\n"
    },
    {
      "time": "4 Feb 2008 — 2:42pm",
      "content": "Check out Old Standard's treatment (scroll to bottom for download).\n\n[http://www.thessalonica.org.ru/en/fonts.html](http://web.archive.org/web/20120624054521/http:/www.thessalonica.org.ru/en/fonts.html \"http://www.thessalonica.org.ru/en/fonts.html\")\n\n"
    },
    {
      "time": "4 Feb 2008 — 2:51pm",
      "content": "Wow. Problem solved. :)\n\nthanks Nick!\n\n"
    },
    {
      "time": "4 Feb 2008 — 2:56pm",
      "content": "If you have to crop it, I think it should be at the baseline. Leaving any more just calls attention to what's missing.\n\n"
    },
    {
      "time": "4 Feb 2008 — 3:31pm",
      "content": "Yeah, the recognizable part of a typeface (glyphs in this case) is the upper part. There is a classic test, where they cut off either the bottom half of a line of type or the upper half. ANd then let people read these lines.  \nMost of the recognition aspects are in the upper parts.\n\nPersonal opinion: cut off at baseline does it for me.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "4 Feb 2008 — 3:57pm",
      "content": "I did try trimming at the baseline, but the result looks confused, as though the f belongs to a different family altogether. It kind of kills the 'lively' in it. The descender, even trimmed flat, still contributes grace and movement. Here is the trimmed version in (partial) context. It feels right to me.\n\n ![](http://web.archive.org/web/20120624054521im_/http:/typophile.com/files/new_4968.png)\n\nps. I am aware of and addressing other inconsistencies in this piece :)\n\n"
    },
    {
      "time": "4 Feb 2008 — 9:19pm",
      "content": "It looks great, especially the way you've integrated it into the design, which apparently was the whole point of the exercise.  \nIt's nice that it's at a slightly different angle--puts some tension in the layout and gets it moving.\n\n"
    },
    {
      "time": "5 Feb 2008 — 12:56pm",
      "content": "Thanks Nick!\n\nHere is the original, which some found confusing. I liked the hook, but I suppose it could be too show-offy. At any rate, I'm fine with the change and I so appreciate your input.\n\n ![](http://web.archive.org/web/20120624054521im_/http:/typophile.com/files/orig_3464.png)\n\n"
    }
  ]
}
