{
  "id": "41703",
  "title": "Max: Mens yoga shorts",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Need a bit of help..  \nThis logo is designed for a Men's spandex extra form fitting yoga short. Think speedo meets boxer briefs. I have been beating my head against the wall and maybe someone here can open a door for me???? My problem is the x and whether it is x enough or not.\n\n| Attachment | Size |\n| --- | --- |\n| [Max1.jpg](http://web.archive.org/web/20150419210958/http:/typophile.com/files/Max1.jpg) | 40.82 KB |\n\n",
  "author": "djg",
  "time": "4 Feb 2008 — 2:22pm",
  "uid": "3471",
  "comments": [
    {
      "time": "4 Feb 2008 — 5:10pm",
      "content": "It reads more as a z for me.\n\n"
    },
    {
      "time": "4 Feb 2008 — 6:10pm",
      "content": "Yeah, it doesn't read as an x. It should be one piece, not 3. Two longer horizontal lines on the sides, and two shorter vertical lines on the top and bottom\n\nThat said, I think the concept might need to be addressed. Right now the lettering makes me think that this product might bend and squish my vital part into a rather uncomfortable position. Especially from the looks of that m--ouch!\n\nDavid\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:46pm",
      "content": "I thought it said \"MAN\"\n\n"
    },
    {
      "time": "10 Feb 2008 — 2:55pm",
      "content": "Reads man and/or max so you are ok. Best of both worlds. What about the words turned upside down and having legs dangling from the M because the M upside down looks like a pair of boxer shorts anyway. haha.\n\n"
    },
    {
      "time": "5 Nov 2008 — 10:07am",
      "content": "Here are my Yoga shorts:\n\n[http://www.sanskritweb.net/deutsch/baddha.htm](http://web.archive.org/web/20150419210958/http:/www.sanskritweb.net/deutsch/baddha.htm \"http://www.sanskritweb.net/deutsch/baddha.htm\")\n\n(Miss Tiffany had better close here eyes :-)\n\n"
    },
    {
      "time": "5 Nov 2008 — 10:41am",
      "content": "I believe Stefan is a spammer.\n\n"
    },
    {
      "time": "1 Dec 2011 — 1:02pm",
      "content": "I agree with adnik the logo conjures up the image of a fat butt squeezed into an uncompromising space. This is maybe true for many taking up yoga initially, but I am sure the overall projected image should be what those going to yoga aspire to. Fit, sleek, this doesnt necessarily mean slim, but always well formed.\n\nRemember this is more than typography this is branding, Stefan hit on another good point, the baseline for clothing branding is people have got to want to wear the brand, be seen wearing the brand, want to buy the brand and want to show off the brand. This is the premise clothing brands are built on, and when you have a particular focus like yoga pants, or indeed yoga, there is an aesthetic to aspire to. As a designer this is your target, to build, with what you create, as asset for your client.\n\n"
    }
  ]
}
