{
  "id": "41717",
  "title": "[P22] New fonts from Norway",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20080207163432/http:/typophile.com/user/7006 \"View user profile.\") : 5.Feb.2008 2.35am \n\nIntroducing two new font families from Norwegian designer Torleiv Sverdrup\n\nInternational House of Fonts welcomes Mr. Sverdrup to its roster. He has been a freelance graphic designer for more than 20 years. Since 2005, has spent most of his time working on type design.\n\nRegarding what motivates him, Torliev states: “I get inspiration wherever I go. Whenever I get an idea, I start from scratch, working with just a couple of letters. These letters then serve as “matrix” for the remaining letters.  \nThe final result is often quite different from my initial idea, as I let things evolve as they go. The creative process is the drive, the engine, of my work: it is like a voyage during which you have enter many hitherto unknown ports of call.”\n\nHoy is a decorative font whose name derives from one of the Orkney Islands. Inspired by the wonderful encounter between the Celtic and Norse cultures in this specific geographic location, the font has adapted some of the features of the Insular half-uncial. It is playful and relaxed, and easily recognizable by its roundness.  \n [http://www.p22.com/ihof/hoy.html](http://web.archive.org/web/20080207163432/http:/www.p22.com/ihof/hoy.html \"http://www.p22.com/ihof/hoy.html\")\n\nSpiggie is a sans-serif, named for a Shetland beach. The beach traces a tight curve between the shoreline and the sea, which is paralleled in the font‚s controlled yet smooth character. The design language reaches back to the art deco period and the 1920s, yet retains a distinct modern flavor.  \n [http://www.p22.com/ihof/spiggie.html](http://web.archive.org/web/20080207163432/http:/www.p22.com/ihof/spiggie.html \"http://www.p22.com/ihof/spiggie.html\")\n\nBoth fonts include Regular, Italic, Bold and Bold Italic variations in basic formats (TrueType, PostScript &  \nOpentype) for $19.95 per face or $49.95 per family. The Pro Opentype versions (Pro includes ligatures, Fractions, Central European character sets) are $29.95 per face or  \n$69.95 per family.\n\nAs a special introductory price, you can order both families for $75 for basic or $99 for Pro.  \n [http://www.p22.com/hoyspigspecialpro.html](http://web.archive.org/web/20080207163432/http:/www.p22.com/hoyspigspecialpro.html \"http://www.p22.com/hoyspigspecialpro.html\")  \nDiscount is valid until Feb 29, 2007.\n\nTakk!\n\nP22 type foundry, Inc.  \n [http://www.p22.com](http://web.archive.org/web/20080207163432/http:/www.p22.com/ \"http://www.p22.com\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080207163432/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 5.Feb.2008 2.35am",
  "uid": "7006",
  "comments": [

  ]
}
