{
  "id": "41725",
  "title": "Texas License Plate e-vote",
  "forum": "Design",
  "tags": [

  ],
  "content": "This week, the Texas DOT is having an e-vote for our new license plate design. There are five designs, including the current plate. As of this morning the vote totals are as follows:\n\n“Lone Star Texas”\n\n ![](http://web.archive.org/web/20080207163438im_/http:/www.typophile.com/files/plate_sky_mountains_6076.jpg)\n39,165\n\n“Natural Texas”\n\n ![](http://web.archive.org/web/20080207163438im_/http:/www.typophile.com/files/plate_bluebonnets_6248.jpg)\n24,759\n\n“Traditional Texas”\n\n ![](http://web.archive.org/web/20080207163438im_/http:/www.typophile.com/files/plate_traditional_5056.jpg)\n18,935\n\n“New Texas”\n\n ![](http://web.archive.org/web/20080207163438im_/http:/www.typophile.com/files/plate_skyline_5640.jpg)\n12,285\n\n“My Texas” (current design)\n\n ![](http://web.archive.org/web/20080207163438im_/http:/www.typophile.com/files/plate_my_texas_6127.jpg)\n9.283\n\nI feel like each one has some detail that bothers me way too much. The red text on the blue background of the current design looks a bit off (though it looks better when printed on metal).\n\n“The Lone Star State” on the “Lone Star Texas” design is written in brush script, and “The” is written smaller than “Lone Star State,” which throws me off.\n\nThe “Natural Texas” design is the most passable in my opinion, but that stretched “The Lone Star State” at the bottom looks a bit off.\n\nThe “Traditional Texas” design just screams “Look at me! I know how to use Photoshop!”\n\nI feel like the “New Texas” design would be a lot more effective with a bold sans serif at the top — it would make the design look a lot more clean and modern.\n\nHere’s the site for voting:  \n [http://apps.dot.state.tx.us/services/vehicle\\_titles\\_and\\_registration/vot...](http://web.archive.org/web/20080207163438/http:/apps.dot.state.tx.us/services/vehicle_titles_and_registration/vote_plate.htm \"http://apps.dot.state.tx.us/services/vehicle\\_titles\\_and\\_registration/vote\\_plate.htm\")\n\nWhat do you think?\n\n [‹ Seeking Inspiration for a food label](http://web.archive.org/web/20080207163438/http:/www.typophile.com/node/41757 \"Go to previous forum topic\") [Serif to pair with Gill ›](http://web.archive.org/web/20080207163438/http:/www.typophile.com/node/40694 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080207163438/http://www.typophile.com/user/26018\" title=\"View user profile.\">DrDoc</a>",
  "time": "<br>",
  "uid": "26018",
  "comments": [
    {
      "time": " 5.Feb.2008 9.19am",
      "content": "Graphically I like the bottom three (that last one SCREAMS kitsch, they threw the kitchen sink at it, but I voted for it). I’d like the second to bottom one much better if the Texas wasn’t in script. Which is what you said. I really hate the top two - I don’t tend to like pictorial license plates.\n\n"
    },
    {
      "time": " 5.Feb.2008 10.28am",
      "content": "A version of the last one has been around for a while. I like the traditional one. I don’t want a license plate messing up the look of my car. I would rather have a really traditional one with a plain white bg and black letters.\n\n"
    },
    {
      "time": " 5.Feb.2008 11.38am",
      "content": "The europeans get these right. All these are not so hot. Not everyone wants a bunch of colorful graphics on their car, just like not everyone puts bumper stickers on their car. We are forced to put one on the front and back. Why not have a clean simple option.\n\nI get the one that helps funds the state parks, which isn’t featured.\n\n"
    },
    {
      "time": " 5.Feb.2008 12.05pm",
      "content": "I liked the old days where it was just color on color, all stamped. NY was orange on blue and then (radical!) they reversed the colors.\n\n"
    },
    {
      "time": " 5.Feb.2008 12.09pm",
      "content": " ![](http://web.archive.org/web/20080207163438im_/http:/www.typophile.com/files/custom_ad2_5870.gif)\n\n ![](http://web.archive.org/web/20080207163438im_/http:/www.typophile.com/files/Europlt2_5454.JPG)\n\nI’m not even going to fuss about the letterspacing. ^This approach is so much better. The function of the tag is to ID the vehicle and identify the state. We just don’t need cowboys, spaceships, oil rigs, etc. (God I sound like a grumpy old idiot!)\n\n"
    },
    {
      "time": " 6.Feb.2008 5.25am",
      "content": "Well, I guess at least they’ll “pretty-up” the prisons, if that’s still where they’re made.\n\n-=®=-\n\n"
    }
  ]
}
