{
  "id": "41746",
  "title": "PC .ttf fonts seem to work fine on my Mac",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was pleased to find that some nice .ttf commercial fonts I have bought for PC seem to work fine on the Mac. Is there any reason I shouldn't be doing this? I'm guessing they work because of the Intel processor switch?\n\n",
  "author": "fontplayer",
  "time": "5 Feb 2008 — 5:17pm",
  "uid": "12014",
  "comments": [
    {
      "time": "5 Feb 2008 — 5:23pm",
      "content": "I believe they've worked since OS X was introduced (maybe even OS9) around the time the data fork nonsense was removed.\n\n"
    },
    {
      "time": "5 Feb 2008 — 5:42pm",
      "content": "Truetype is old hat on the mac these days. Use them to your heart’s content, and don’t listen when the printer tells you not to use Truetype.\n\n"
    },
    {
      "time": "5 Feb 2008 — 6:18pm",
      "content": "Well, this certainly is a nice surprise.\n\nNow my major font disappointment is an easy way to find the keystroke combination for entering characters. FontExplorer X usually seems to have that info slot blank. Probably an editorial comment on the types of fonts I am often working with.\n\n"
    },
    {
      "time": "5 Feb 2008 — 6:59pm",
      "content": "PopChar? [http://www.ergonis.com/](http://web.archive.org/web/20131018130302/http:/www.ergonis.com/ \"http://www.ergonis.com/\")\n\n"
    },
    {
      "time": "5 Feb 2008 — 7:18pm",
      "content": "That looks like it would work. But $44 bucks for what WIndows told me for free? There goes my Norton savings, except maybe for the huge chunk of memory Norton seemed to want.  \n; )\n\nIt's just a little hard to believe there isn't an equivalent of the alt+0243 etc. system Windows uses and gives the info for in Character Map. I thought I remembered Mac people just left off the zero, or something like that. Wouldn't be the first time I didn't have my facts straight.\n\n"
    },
    {
      "time": "5 Feb 2008 — 8:02pm",
      "content": "found this - \"press the Option key and enter four hex digits to specify the hex code of any glyph.\"\n\n\\>alt+0243\n\nThat's a bit antiquated now - In Windows just type the Unicode number and hit ALT + X to get the character. Also works in reverse, highlight a character and hit ALT + X to convert it to Unicode number.\n\n"
    },
    {
      "time": "5 Feb 2008 — 10:37pm",
      "content": "To input off-keyboard characters on Mac OS X:  \nOpen your System Preferences from the Apple menu  \nSelect International  \nSelect the Input Menu tab  \ncheck the Character Palette, Japanese Kana Palette, and Keyboard Viewer to ON  \nCheck on Show input menu in menu bar\n\nThis will bring a flag icon into your menu bar set according to your local keyboard encoding. The palettes can now be selected from a menu under that flag. International preferences can also activate alternate keyboard encodings for other languages, if you want to.\n\nBe advised these palettes only work fully in Cocoa (OS X native) apps. They may cause problems in older Carbon applications, but if you have a fresh new Mac with fresh new software, you should not have many of those.\n\n"
    },
    {
      "time": "5 Feb 2008 — 11:42pm",
      "content": "I'm not sure what is meant by flag icon, but I did get it to show under edit/character palette (shortcut option, command +T) on Safari, and once opened, it can be used in Photoshop also, and can be minimized to the dock for when I want it. This is about as good of a solution as I could have hoped for, so I thank you!\n\n"
    },
    {
      "time": "6 Feb 2008 — 4:11am",
      "content": "All the free fonts are in ttf-format and are offered for Mac and PC (same file).  \nSo yeah, there you go.\n\n\\> I believe they’ve worked since OS X was introduced (maybe even OS9)  \nNo. PC ttf-fonts didn’t work with OS9. There were applications to convert them to Mac Truetype, though. But those made a mess a lot of times.\n\n"
    },
    {
      "time": "6 Feb 2008 — 4:15am",
      "content": "PC TrueType = [OpenType](http://web.archive.org/web/20131018130302/http:/typophile.com/wiki/OpenType) (TT flavor)\n\n"
    },
    {
      "time": "6 Feb 2008 — 6:06am",
      "content": "_I’m not sure what is meant by flag icon,_\n\nThis:\n\n ![](http://web.archive.org/web/20131018130302im_/http:/typophile.com/files/inputmenu_5544.jpg)\n\nIf you select other languages' keyboard layouts in the International control panel, they show up in this menu. The active keyboard layout will be represented by an appropriate flag icon at the top in the menu bar.\n\n"
    },
    {
      "time": "6 Feb 2008 — 1:22pm",
      "content": "Oh, up there. I was looking on the program toolbars. That is a very nice solution.\n\nAnd btw, I really appreciate that you technical font people would help on something as simple as this. Even a MS font person trying to help me with Mac stuff. That is exceptional. Y'all rock!  \n; )\n\n"
    }
  ]
}
