{
  "id": "41761",
  "title": "GREEK MYTHOLOGY HELP",
  "forum": "Design",
  "tags": [

  ],
  "content": "hello,\n\nI need to re actualize this symbol. Does anybody know what  \nit represent in the Greek mythology,  \nand is it greek mythology or more Egyptian.\n\nMaybe its some kind of Greek god???\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 2.jpg](http://web.archive.org/web/20080214125247/http:/typophile.com/files/Picture%202_11.jpg) | 91.05 KB |\n\n [‹ \"What font says change?\" An article on campaign type](http://web.archive.org/web/20080214125247/http:/www.typophile.com/node/41806 \"Go to previous forum topic\") [Cyrillic, recommendations ›](http://web.archive.org/web/20080214125247/http:/www.typophile.com/node/42013 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080214125247/http://www.typophile.com/user/17434\" title=\"View user profile.\">ericquenneville</a>",
  "time": "<br>",
  "uid": "17434",
  "comments": [
    {
      "time": " 6.Feb.2008 8.16am",
      "content": "Hi Eric. I’m not really sure about this, but then I’m not an expert on ancient Greek mythology. I’ll have a go at it regardless.\n\nThis creature has the general appearance of a sphinx, but the anatomical details do not match those of the well-known Egyptian sphinx. It has the coiled tail/body and scales of a Greek hippocamp—-a sea-going creature with with a horse’s torso and the tail of a sea serpent. It’s front legs resemble those of a horse, it’s head is human, and it has human breasts.\n\nSomehow I don’t think it is ancient Greek, but I’d give it at least 25% chance of being Greek. It looks like something from classical antiquity. Hold on and I’ll see if I can get a positive ID on it for you.\n\nj a m e s\n\n"
    },
    {
      "time": " 6.Feb.2008 8.21am",
      "content": "It’s the Greek Sphinx, representing destruction and bad luck. She’s the daughter either of Chimera, or Typhon and Echidna. The Greek Sphinx is described as a woman with the body of a lion, eagle’s wings, and a serpent’s tail, but everybody’s used to seeing the Egyptian Sphinx at Giza, which is only half-man, half-lion.\n\n"
    },
    {
      "time": " 6.Feb.2008 8.30am",
      "content": "Also, by the way, the company name is called: ISINIS\n\n"
    },
    {
      "time": " 6.Feb.2008 8.35am",
      "content": "I should have mentioned that the Greek Sphinx is part of the Oedipus myth. The Sphinx sat outside Thebes and asked all the travelers that passed her a riddle; if they answered incorrectly, she killed them. Oedipus answered the riddle, which was “What goes on four legs in the morning, on two legs at noon, and on three legs in the evening?” Since Oedipus answered correctly (a man, or more PC, a person), the Sphinx had to destroy herself.\n\n"
    },
    {
      "time": " 6.Feb.2008 8.40am",
      "content": "Gus, the creature illustrated does not have wings. All the illustrations I’ve seen of the Greek Sphinx show it with lion’s legs at the rear and no serpent’s tail. What’s your source?\n\nj a m e s\n\n"
    },
    {
      "time": " 6.Feb.2008 8.42am",
      "content": "Didn’t Oedipus solve the riddle of the Greek Sphinx?\n\n[http://ri.essortment.com/oedipusandth\\_rzul.htm](http://web.archive.org/web/20080214125247/http:/ri.essortment.com/oedipusandth_rzul.htm \"http://ri.essortment.com/oedipusandth\\_rzul.htm\")\n\n[http://en.wikipedia.org/wiki/Oedipus](http://web.archive.org/web/20080214125247/http:/en.wikipedia.org/wiki/Oedipus \"http://en.wikipedia.org/wiki/Oedipus\")\n\n[EDIT] Ack, I see that Gus beat me to the punch. :-)\n\n"
    },
    {
      "time": " 6.Feb.2008 8.44am",
      "content": "What I’m seeing is a serpent tail with hooves of a horse and a woman’s torso. You might also look at Hippocamps.\n\n"
    },
    {
      "time": " 6.Feb.2008 8.47am",
      "content": "The English language Wikipedia article, which is well reference, describes the Greek Sphinx: “She was represented in vase-painting and bas-reliefs most often seated upright rather than recumbent, as a winged lion with a woman’s head; or she was a woman with the paws, claws and breasts of a lion, a serpent’s tail and eagle wings.”\n\nYet all illustrations show her with a lion’s tail, unlike the coiled serpent’s tail/body in this illustration. That’s what disuaded me from identifying it asa Greek Sphinx.\n\nPuzzling. Possibly this is an unusual illustration of a Greek Sphinx.\n\nj a m e s\n\n"
    },
    {
      "time": " 6.Feb.2008 8.50am",
      "content": "_You might also look at Hippocamps_\n\nI mentioned them. This thing is half sphinx, half hippocamp.\n\nj a m e s\n\n"
    },
    {
      "time": " 6.Feb.2008 9.02am",
      "content": "So the elements are protection of secrets and a incarnation of the power of the water element. If this idea was manifest today it might be Captain Nemo’s Submarine.\n\n"
    },
    {
      "time": " 6.Feb.2008 9.15am",
      "content": "\\> What’s your source?\n\nSince the image in the OP had a tail, I googled for “sphinx and (serpent or serpents) and tail”. Here are some results:\n\n[Wikipedia](http://web.archive.org/web/20080214125247/http:/en.wikipedia.org/wiki/Sphinx)  \n [Monstrous.com](http://web.archive.org/web/20080214125247/http:/monsters.monstrous.com/sphinx.htm)  \n [Encyclopedia Mythica](http://web.archive.org/web/20080214125247/http:/www.pantheon.org/articles/s/sphinx.html)  \n [Theoi Greek Mythology](http://web.archive.org/web/20080214125247/http:/www.theoi.com/Ther/Sphinx.html)  \n [Greek Myth Index](http://web.archive.org/web/20080214125247/http:/www.mythindex.com/greek-mythology/S/Sphinx.html)\n\n[Bulfinch](http://web.archive.org/web/20080214125247/http:/www.online-literature.com/bulfinch/mythology_fable/10/) just says half-lion, half-woman. There are also references to the Sphinx as just having wings and a lion’s body, but no tail — [here](http://web.archive.org/web/20080214125247/http:/www.greek-gods.info/monsters/sphinx/), for instance.\n\nThe Egyptian Sphinx has come to mean enigmatic, but given the Greek backstory, I’m not sure I’d want it as my logo.\n\n"
    },
    {
      "time": " 6.Feb.2008 9.35am",
      "content": "The entire drawing minus the woman’s head is a hippocampus. The head might resemble a sphinx. Did someone say where they found this image?\n\n"
    },
    {
      "time": " 6.Feb.2008 9.38am",
      "content": "It is probably something Euro, after-the-fact imagined rather than a Greek concept. Tune in to find out.\n\n"
    },
    {
      "time": " 6.Feb.2008 9.45am",
      "content": "Yes, perhaps more a product of the artist’s fancy (or the client’s) than strictly classical?  \nLooks like a mermaid to me, though not exactly Daryl Hannah :-(\n\n"
    },
    {
      "time": " 6.Feb.2008 9.52am",
      "content": "I can sort of see the hippocampus thing, although to me the body could equally as well be a lion, with the hoof-like appearance of the leg just being an artifact of the grey shadow. But perhaps I should have said “it could be” instead of “it is” a Greek Sphinx.\n\nBut if it is a hippocampus, wouldn’t that make it a sort of... mermaid?\n\n"
    },
    {
      "time": " 6.Feb.2008 9.59am",
      "content": "the brand is called ISINIS, it is a french enterprise that fabrics high quality combs.  \nThe reason I am asking is that I need the redo the logo, but I have no story behind  \nit.\n\n"
    },
    {
      "time": " 6.Feb.2008 10.46am",
      "content": "Combs being the product, I’d definitely go with the mermaid theme. A mermaid sitting on a rock combing her hair is a classic image. Her hair is said to be the mermaid’s source of magical power, and it has sexual connotations, too (can I say that?).\n\n(Later edit — Rats, I just noticed that Nick beat me to the mermaid idea.)\n\n"
    },
    {
      "time": " 6.Feb.2008 11.12am",
      "content": "The mermaid idea seems strong to me too.\n\nThe [image](http://web.archive.org/web/20080214125247/http:/en.wikipedia.org/wiki/Image:Hippokampos%2C_Nordisk_familjebok.png#file) to which I’m comparing the other.\n\n"
    },
    {
      "time": " 6.Feb.2008 11.14am",
      "content": "Further, that image I just linked to is part of [NORDISK FAMILJEBOK](http://web.archive.org/web/20080214125247/http:/runeberg.org/nf/) which is available for online viewing. (This is probably going off-topic now, but it is interesting.)\n\n"
    },
    {
      "time": " 6.Feb.2008 11.53am",
      "content": "Some images of mermaids combing their hair:\n\n[http://www.jwwaterhouse.com/view.cfm?recordid=30](http://web.archive.org/web/20080214125247/http:/www.jwwaterhouse.com/view.cfm?recordid=30 \"http://www.jwwaterhouse.com/view.cfm?recordid=30\")  \n [http://homepage.eircom.net/~archaeology/three/mermaid.htm](http://web.archive.org/web/20080214125247/http:/homepage.eircom.net/~archaeology/three/mermaid.htm \"http://homepage.eircom.net/~archaeology/three/mermaid.htm\")  \n [http://heraldry.lordkyl.net/glossary/images/mermaid.gif](http://web.archive.org/web/20080214125247/http:/heraldry.lordkyl.net/glossary/images/mermaid.gif \"http://heraldry.lordkyl.net/glossary/images/mermaid.gif\")  \n [http://www.cornwalls.co.uk/images/zennor\\_mermaid.gif](http://web.archive.org/web/20080214125247/http:/www.cornwalls.co.uk/images/zennor_mermaid.gif \"http://www.cornwalls.co.uk/images/zennor\\_mermaid.gif\")\n\nThe Waterhouse is supposedly based on [The Mermaid](http://web.archive.org/web/20080214125247/http:/www.litscape.com/author/Alfred_Lord_Tennyson/The_Mermaid.html) by Tennyson.\n\n"
    },
    {
      "time": " 6.Feb.2008 12.05pm",
      "content": "Sea Horse, Mermaid\n\n"
    },
    {
      "time": " 6.Feb.2008 1.08pm",
      "content": "I was going to say mermaid variant, too, but I hadn’t noticed the horse legs. That definitely does not fit.\n\nOf course you are asking a bunch of design experts, typographers, and wannabes. I wonder if there is a mythology board someplace where that version of nerd ... I mean expert, hangs out.\n\n"
    },
    {
      "time": " 10.Feb.2008 1.53pm",
      "content": "This creature looks to me as if it was designed by committee.\n\nDavid Thometz\n\n"
    },
    {
      "time": " 11.Feb.2008 6.44am",
      "content": "this looks like a euro-victorian fantasy of “ancient mythology”, but she looks monstrous in a way that doesn’t seem to go with a vanity product.\n\nare you restricted to this image ?\n\n"
    },
    {
      "time": " 12.Feb.2008 4.36pm",
      "content": ""
    },
    {
      "time": " 12.Feb.2008 4.37pm",
      "content": "also breast of a women\n\n"
    },
    {
      "time": " 13.Feb.2008 9.50am",
      "content": "I think, Ch is right.  \nThis looks like a European 18th to 19th century classicist product, clearly inspired by Greek mythology (oh, that’s what classicism was all about...)\n\nIt might be interesting to look up, when the company was founded. I would not be surprised if it was in the given range (though I’d guess rather for the 19th; maybe early 19th?)\n\nThe components — the Greek sphynx and the hippocamp — was already mentioned.\n\n"
    },
    {
      "time": " 13.Feb.2008 2.58pm",
      "content": "I think its a greek sphinx it has everything it should: head of human,body/legs of a lion,and a tail of serpent. Oh by the way, not all sphinxes have wings.\n\nif you can help me with the differnces between the sphinxes posted [here](http://web.archive.org/web/20080214125247/http:/typophile.com/node/42027) that would be great\n\n"
    },
    {
      "time": " 13.Feb.2008 4.26pm",
      "content": "maybe its a cross between the two and your client just wants to create his own thing?\n\n"
    },
    {
      "time": " 14.Feb.2008 2.35am",
      "content": "Iwon, it does not have \\_anything\\_ of a lion...\n\n"
    }
  ]
}
