{
  "id": "41787",
  "title": "Help in Adobe InDesign CS2",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I would like to make any text of 16 mm in height using Adobe InDesign CS2.\n\nHere are the method I’m using:\n\nFirst I make a boundary Grid with 16 mm offset.\n\nNext I create Text Frame between the boundary Grid to insert any text, say, it’s a HELLO text.\n\nI create text “HELLO” in the Text Frame with Times-Roman font and the initial size of the font is 10 pt.\n\nI block all of the HELLO text and click the up-arrow of the Font Size tool in order to increase the size of the text until I can see the HELLO text in 4000% zoom is exactly fit to the boundary Grid.\n\nAnd final size of the text is 66.4 pt.\n\nHowever, there still left a Gap between the Font and the upper boundary Grid and make the text not exactly in 16 mm height.\n\nPlease see image about the Gap.\n\nAnd if I move the Text Frame manually until the upper portion of the HELLO text reach the upper boundary Grid, then the gap will be in the bottom of the boundary Grid vice versa.\n\nSo can anyone help me to find the method for this text treatment?\n\nThanks in advance\n\n ![](http://web.archive.org/web/20080211213939im_/http:/www.typophile.com/files/Gap_5343.jpg)\n\n [‹ A Legibility Test and a Readability Test](http://web.archive.org/web/20080211213939/http:/www.typophile.com/node/41712 \"Go to previous forum topic\") [InDesign users to be extinct like \"lead\" users, CSS coauthor cries! ›](http://web.archive.org/web/20080211213939/http:/www.typophile.com/node/40332 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080211213939/http://www.typophile.com/user/26849\" title=\"View user profile.\">balaaditya</a>",
  "time": "<br>",
  "uid": "26849",
  "comments": [
    {
      "time": " 6.Feb.2008 9.23pm",
      "content": "i know this probably doesn’t help much, but i’ve found to be totally exact you have to convert the text to outlines, then you can re-size it to any size you need.\n\ncheers\n\n"
    },
    {
      "time": " 6.Feb.2008 9.25pm",
      "content": "or.... you could always design a typeface that at a specific point size is 16mm high...\n\n"
    },
    {
      "time": " 6.Feb.2008 11.49pm",
      "content": "Have you played with the First Baseline Offset value?\n\n ![](http://web.archive.org/web/20080211213939im_/http:/www.typophile.com/files/CS2_FrameProperties_3435.png)\n\n"
    }
  ]
}
