{
  "id": "4178",
  "title": "Bembo or Minion MM?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey guys,   \n   \nI'm working on a series of biographies (3 series of 5 books) One is on literature, one on music and one on politics. In each I'm using the same fonts (so far I have Frutiger I'm sure about) but in literature I use the serif in italic, in music the normal serif and in politics the small caps serif.   \n   \nI'm hesitating between Minion MM or Bembo as a serif. What are your opinions? Any other sans come to mind other than Frutiger to complement one or the other?   \n   \nThanks!   \n   \nEm\n\n",
  "author": "emilie",
  "time": "7 Apr 2004 — 7:52pm",
  "uid": "2485",
  "comments": [
    {
      "time": "8 Apr 2004 — 2:39am",
      "content": "Hello   \n   \nFirst time here ...ooh er!   \n   \nI've been using Minion recently for a series of (typographic) ads and templates. I much prefer it to the slightly too wide Bembo. The version of Minion I have comes with a lovely set of ornaments, although unfortunately, no ligatures.\n\n"
    },
    {
      "time": "8 Apr 2004 — 4:03am",
      "content": "Emilie:   \nIf you do decide to go with Minion, I'd use the new OpenType cut. The design has been subtly refined.\n\n"
    },
    {
      "time": "8 Apr 2004 — 7:24am",
      "content": "When you say \"book\", I guess you mean something more like \"short booklet\"? Because you don't want to set too much text in italics and certainly not smallcaps... BTW, I think I'd set the music in italic.   \n   \nFont choice: why so mundane? Try something new. I guess you need something with a tame italic, and smallcaps. Stylisitically mabe it should be \"factual\", since it's biographies - so what about a Scotch face, like Miller?   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 10:14am",
      "content": "I have read that the digital version of Bembo, as opposed to the great original metal version, has problems. In the discussion on the Yale site for Matthew Carter's new face for Yale, influenced by the metal Bembo, he mentions the weakness of the digital version.   \n   \nI know the original Minion and Minion Pro, which is definitely better. I don't know the MM version, but I have read on these boards that the Pro version is improved from it.   \n   \nMinion Pro is wonderfully serviceable because of its completeness: optical weights, and small caps in all sizes, as well as small caps semi-bold, bold, italic, swash characters, ornaments, etc. A bonus is also that you can use Poetica as a formal script companion to Minion, as its letterforms are similar to Minion italic.\n\n"
    },
    {
      "time": "8 Apr 2004 — 10:45am",
      "content": "Thanks for all that feedback!   \n   \nI'll check out your suggestions for sure. Another Minion cut sounds like it would be a good idea. I did notice some huge differences just between Minion and Minion MM so I could imagine the opentype version.   \n   \nHrant: I'm only doing the covers and backs (15 of them) not the inside of the books.   \nWhat do you mean by factual? Maybe, historically correlating? Or Scotch face, what's a Scotch face? Pardon my ignorance on that matter ;-)   \n   \nAll the biographies are of people from Qu\n\n"
    },
    {
      "time": "8 Apr 2004 — 11:04am",
      "content": "\"Factual\": They're biographies, so based on facts (although that's a tricky word :-).   \n   \nScotch: it's a category of serif typeface, with full, \"honest\" forms. Not sure how best to describe it... Check out Georgia. And Scotch italics tend to have tame, somewhat Roman features (hence they're more readable).   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 1:33pm",
      "content": "If you're wanting something with the flavor of Bembo, you could also take a look at Dante and Iowan Old Style. They offer nice italics (especially Dante!) and small caps. Another possibility is Philomela by Lars Bergquist available from [PsyOps](http://web.archive.org/web/20140302110921/http:/www.psyops.com/html/spec_philomela.html).   \n   \nAlso see [Verdigris](http://web.archive.org/web/20140302110921/http:/www.mvbfonts.com/html/fonts/verdigris/pk_verdigris.htm) and [Rongel](http://web.archive.org/web/20140302110921/http:/www.myfonts.com/fonts/feliciano/rongel/).\n\n"
    },
    {
      "time": "8 Apr 2004 — 1:46pm",
      "content": "For a different sans, take a look at [Stella](http://web.archive.org/web/20140302110921/http:/www.myfonts.com/fonts/feliciano/stella/). This is one of my favorites from the Indie Book 2, but I've haven't heard much about it, or seen it used anywhere else. It looks as if it would complement a garalde roman nicely, especially Rongel (from the same foundry).\n\n"
    },
    {
      "time": "8 Apr 2004 — 1:47pm",
      "content": "I can only comment as a reader, not a professional. But ...   \n   \nI'd avoid digital Bembo. It really is grey and dull. It's a terrible pity, because it was in its day such an exquisitely fine typeface: deep warm black type on cream paper. Now it's hardly ever any good. (The Tufte books are fine, but iirc he set in metal then printed from a proof). I think it should be sent to an honourable grave, or reworked a la the New Yale typeface.   \n   \nIf you must use Bembo, please use ff, ffl and ffi ligatures and OS numbers. Bembo really needs them.   \n   \nI personally dislike Minion. You see much too much of it. It's too mannered and too polished. But far sooner Minion than Bembo. But on the whole I'm with the re-open nominations crowd.   \n   \nDante, suggested above, is nice. The other possibility if you are looking for a classic \"academic but friendly\" look is some sort of Baskerville -- alongside Bembo the type of choice for that sort of product in the mid-20th century. But they've been largely killed by digitization as well. I have seen one book (history) in Storm Baskerville, which I thought looked as it should, but I'm not sure about the figures. I don't know if anyone has experience of using it.\n\n"
    },
    {
      "time": "8 Apr 2004 — 3:02pm",
      "content": "The only reason I am tired of Minion is because it's our corporate typeface. Otherwise, it's a lovely piece of work.   \n   \nI'm surprised to hear that Rob thinks he has a version of Minion with no ligatures. Every version we've issued, with the possible exception of Minion Web, has at least fi and fl ligatures. I suppose you could be on Windows and using QuarkXPress, in which case you couldn't use those ligatures (which are still present). InDesign can get at them, though.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "8 Apr 2004 — 4:00pm",
      "content": "\\>a lovely piece of work.   \n   \nI agree. I had reservations about Minion until I got the Pro version, which convinced me. It is still not my favorite, but it is extremely well done and so complete that it is an amazing workhorse. It is very compact with a modest x height, and the result is that it will serve the text well in many many situations.\n\n"
    },
    {
      "time": "8 Apr 2004 — 6:05pm",
      "content": "I don't want anyone to think that I disparage Minion; I can see its virtues, but I cannot love them. I guess it's a matter of taste. Minion seems to me slightly mannered, perhaps too polished, its elegance too studied. When it comes to tea, it spreads its napkin carefully, drops no crumbs, eats its cake with a fork and holds its cup ever-so-daintily. It avoids talking about sex, religion or politics. It leaves when it should and writes its thank-you note that evening. One's mother says, \"When are you having that nice Minion over, such a charming boy.\" I prefer something a little rougher, quirkier, more dangerous.   \n   \nAnd because it's such a pleasant guest, one does see it around a lot. Better, no doubt and by far, than some of the others one sees all the time. But unlikely to thrill.\n\n"
    },
    {
      "time": "8 Apr 2004 — 6:09pm",
      "content": "Paul, right on!   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 7:09pm",
      "content": "Well some updates here, I do like Minion Pro a lot more than the MM one so I changed it. So much for the Bembo, I liked some of its shapes but some spacing was getting problematic.   \n   \nOne problem though, it has no small caps? I'm kind of amazed it doesn't since it has all those display, caption, subhead, text, etc.   \n   \nAnother thing, are there average standard sizes to determine when I should use text, caption and subhead or is it intuitive? (or a bit of both) For now I'm using the small caps from Minion MM but it seems to be more condensed, not sure?\n\n"
    },
    {
      "time": "9 Apr 2004 — 3:49am",
      "content": "\\>no small caps?   \n   \nMinion Pro has small caps in all weights and styles. To access them in InDesign you click on the options arrow at the top right of the Character dialogue box, which will open up a large list of options, including small caps. I don't know about Quark.\n\n"
    },
    {
      "time": "9 Apr 2004 — 5:10am",
      "content": "The small caps feature of OT fonts is not accessible from within current versions of Quark (or any other program that does not support OT layout features, for that matter).   \n   \nThis is one of the main reason why those of us who still depend upon Quark (for whatever reasons; we needn't debate them here) find the upgrade to OT versions to be of less value.   \n   \n-- K.\n\n"
    },
    {
      "time": "9 Apr 2004 — 7:59am",
      "content": "Aaah gotcha.   \n   \nI'm in InDesign so no problems on that. I had my ligatures checked but I was afraid the small caps option would make some \"fake\" ones =)   \n   \nThanks!   \nEm\n\n"
    },
    {
      "time": "9 Apr 2004 — 9:34am",
      "content": "An understandable concern! But as long as the font is OpenType and has real small caps, the small caps formatting in InDesign will use those real small caps. Otherwise it will indeed synthesize fake small caps.   \n   \nEmilie, you might want to browse the OpenType User Guide. I put in a lot of info about exactly these sorts of concerns. See [http://www.adobe.com/type/opentype](http://web.archive.org/web/20140302110921/http:/www.adobe.com/type/opentype) and look for the link on the right.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "9 Apr 2004 — 11:43am",
      "content": "Oops, missed one of your questions there.   \n   \nTypically, caption is about 6-8 points, text is 9-13, subhead 13-24, and display is \\>24. But we post all the details in the \"readme\" for each font package, including the exact sizes that each cut is intended to cover. The Minion Pro readme can be found here: \\< [http://www.adobe.com/type/browser/pdfs/readmes/minionproopticalsreadme.pdf](http://web.archive.org/web/20140302110921/http:/www.adobe.com/type/browser/pdfs/readmes/minionproopticalsreadme.pdf)\\>   \n   \nI hope that helps!   \n   \nT\n\n"
    },
    {
      "time": "9 Apr 2004 — 2:54pm",
      "content": "Hi Thomas,   \n   \nThat's going to be helpful as well.   \n   \nIs there a way to know when you have real small caps in a font or when they are being faked? (not just Minion but in general, in InDesign)   \n   \nThanks!   \n   \nEm\n\n"
    },
    {
      "time": "9 Apr 2004 — 3:49pm",
      "content": "Em,   \n   \nIf you look at the comparison of fake and real small caps in the OpenType User Guide (linked previously), I think that it's pretty clear from just the weight differences. That is, fake small caps always look too light (using caps, lower-case or real small caps for comparison).   \n   \nIf you want to tell \"is there a small cap feature in the font) you can use the Glyph Palette in Illustrator CS or InDesign. It allows you to filter by layout feature, so you can see what all the, say, swash glyphs look like. Or all the small caps.   \n   \nOne can also go online to adobe.com and drill down to the page for the font, and see a bunch of turqoise blue (cyan) icons on the right that tell you what kinds of goodies are in the font. Or one can download the \"glyph complement\" PDF to see them.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "10 Apr 2004 — 7:56pm",
      "content": "I realize you've already chosen Minion Pro, but here's a little additional ammunition to make yourself feel good about your choice, and lament Bembo's lackluster digitizing: [Textism: Twenty Faces: Bembo](http://web.archive.org/web/20140302110921/http:/www.textism.com/textfaces/index.html?id=2). It's a worthwhile list to read through in general. Apologies if this is old news for you, Em.\n\n"
    }
  ]
}
