{
  "id": "41786",
  "title": "Magnitude (08) - Development Crit",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I've been considering this design for a while now. It's kind of an offshoot/development of an earlier design but I've decided to keep the same name since I never actually finished the last one - Magnitude. I've only drawn roughs of the thin weight and half of the black - my goal is to have five weights with italics and possibly alternates.\n\nBelow are some comped jpegs of the lower and uppercase, along with an earlier version vector test draw, rounded. The main features are the angled crossbars and curvature on certain glyphs. I'm unhappy with some of the glyphs so far (the g definitely needs reworked, maybe the M and a). I'd like to get some opinions on my creative direction and whether it's worthwhile pursuing this one.\n\nI know the images are a bit rough so it may be difficult to get a decent idea of the finished type. I'll try to get some PDF samples (vector) uploaded as soon as possible.\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [Mag08\\_Thin\\_Test.pdf](http://web.archive.org/web/20140713233855/http:/typophile.com/files/Mag08_Thin_Test.pdf) | 235.4 KB |\n\n",
  "author": "stimuli",
  "time": "6 Feb 2008 — 6:59pm",
  "uid": "896",
  "comments": [
    {
      "time": "7 Feb 2008 — 9:00pm",
      "content": "I like the way it's turned, but it needs a subtle humanistic touch to make it less stark, and more curves should merge rather than collide.\n\n"
    },
    {
      "time": "8 Feb 2008 — 6:01am",
      "content": "To my point of view, I find this encouraging, I like the lower case, the rounded version is nice, however I agree with you, the g has to be reworked. I think the join between the two bowls is not well done and the lower bowl should be bigger than the one on the top. Also, I think there could be a problem if you use on all caps the the oblique line, particularly in the capital letter B H E F and also in the lc f. May be keep it only in the A. This characteristics can make the reading difficult.\n\n"
    },
    {
      "time": "8 Feb 2008 — 11:57am",
      "content": "I've embedded the thin and bold test sketches below, to save clicking through.\n\nI considered dropping the angled crossbar on the lowercase 't' and 'f' as I thought it would cause problems. I'm reluctant to lose the angled crossbars on the uppercase though, as it's one of the main features carried through from Magnitude, but I can understand why it might become a problem and I might need to rethink these too. Maybe I can keep them for an alternate display version or something.\n\nI'll try to get a vector sample uploaded asap to get some other suggestions. The sketches look a bit harsh, full of errors and inconsistencies.\n\nThanks for the feedback so far!\n\n ![](http://web.archive.org/web/20140713233855im_/http:/typophile.com/files/untitled_thin_lc_5841.jpg)\n\n ![](http://web.archive.org/web/20140713233855im_/http:/typophile.com/files/untitled_thin_uc_6557.jpg)\n\n ![](http://web.archive.org/web/20140713233855im_/http:/typophile.com/files/untitles_bold_lc_5515.jpg)\n\n ![](http://web.archive.org/web/20140713233855im_/http:/typophile.com/files/untitled_bold_uc_5696.jpg)\n\n ![](http://web.archive.org/web/20140713233855im_/http:/typophile.com/files/untitled_thin_testdraw_6164.jpg)\n\n"
    },
    {
      "time": "8 Feb 2008 — 12:02pm",
      "content": "So I think the main questions are... should I try to keep the 'angled horizontals' where possible? And which ones do you think will cause the most problems and should be dropped/reworked? (as sim said, the B, E, H, F and f might be problematic).\n\n"
    },
    {
      "time": "8 Feb 2008 — 5:32pm",
      "content": "Try curving them so that they have the angle on the left end but horizontal on the right.\n\n"
    },
    {
      "time": "27 Feb 2008 — 5:52pm",
      "content": "I'm not happy with the double-storey 'a' and 'g' - in fact I'm considering dropping them altogether as I don't think they fit well with the rest of the face. There is also an alternate 't' and 'f'. I'm drawing the uppercase now and should have the file to upload shortly.\n\n"
    },
    {
      "time": "27 Feb 2008 — 5:54pm",
      "content": "Ok, here's the first attempt at the caps for the thin weight. PDF linked above (lowercase included) and JPEG below. Anyone got any comments suggestions? Thanks in advance :)\n\n ![](http://web.archive.org/web/20140713233855im_/http:/typophile.com/files/Mag08_Thin_Test_5123.jpg)\n\n"
    },
    {
      "time": "27 Feb 2008 — 6:16pm",
      "content": "I like the crossbars of the latter of each set, but I'm not sure about the new a and g. For the a, maybe you could try shortening the second a and extending the downstroke up into a second story.\n\nIf you haven't already, check the wikipedia articles for all the letters' histories.\n\n"
    },
    {
      "time": "12 Feb 2009 — 2:16pm",
      "content": "I love it. :)\n\nNot really a very usefull comment, but I can't give any better critique without better samples (text settings).\n\n"
    }
  ]
}
