{
  "id": "41794",
  "title": "question about the copyright",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hi all! I'm quite new on this site. I've browsed in this section, but didn't found a direct answer to my question, so... thank you in advance :)\n\nThe case:\n\nI felt in love with one typeface - Rotis, particularly - Rotis Semi Serif. I've made the cyrillic letters (the ones on the picture).\n\nThe question:\n\nWith all my I respect to Otl Aicher... can I or the people I gave the font use it legally?\n\n| Attachment | Size |\n| --- | --- |\n| [rotis\\_big.jpg](http://web.archive.org/web/20131015232544/http:/typophile.com/files/rotis_big.jpg) | 150.37 KB |\n\n",
  "author": "thefly",
  "time": "7 Feb 2008 — 1:24am",
  "uid": "26692",
  "comments": [
    {
      "time": "7 Feb 2008 — 4:18am",
      "content": "The typeface Rotis was designed in 1988 by the German Otl Aicher, who died in 1991 in the German village Rotis. This typeface design would have been protected for a period of 25 years, if it had been registered at the Munich design patent office, but by glancing through old Munich design patent records I could not find a registration for it, so that I guess that it had never been registered.\n\n(Typeface designs are not copyrightable in Germany, so this is no issue.)\n\n"
    },
    {
      "time": "7 Feb 2008 — 4:30am",
      "content": "Thanks, Uli!\n\nAs far as I know the typeface design is not copyrightable in Bulgaria too.\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:48pm",
      "content": "fly, subject line says (c) but your question asks...\n\n\"With all my I respect to Otl Aicher... can I or the people I gave the font use it legally?\"\n\nSo that's a respect and ethics question. I think it's ethically and respectfully okay to redist a Cyrillic font inspired by the Latin font, but included lifted Latin outlines would be ethically and respectfully wrong.\n\n"
    },
    {
      "time": "7 Feb 2008 — 11:19pm",
      "content": "thanks, simon!\n\ni've made an evaluation version of the font with cyrillic AND latin characters. i'm using this version to fix the kerning problems. this release includes the information, that the typeface is designed by Otl Aicher.\n\neven if there were no latin characters the credits would be the same - not me, but this great designer \"invented\" the typeface. i just added the cyrillic letters.\n\nmay be the subject line is misleading, but for me the problem is not exactly about designer's ethics.\n\nif the Rotis typeface was published as an Open source project, there would be no problem at all. but it is commercial product - as far as i know adobe and monotype sell it.\n\ni don't want to break their license, but their product miss the cyrillic alphabet. and even if they add cyrillic language, it would be not exactly the bulgarian cyrillic letters. there are small differences between glyphs in russian (for example) and bulgarian cyrillic.\n\ni don't want to make money from this. if my version meets their requirements i will let them incorporate my cyrillic. but i doubt about this :)\n\nyes, you're right - it would be ethically and lawfully ok, if i make a font with only cyrillic letters, BUT the world is moving toward Unicode, when one font can include all the languages. it is silly to have this conflict between technology and law.\n\nsorry about the long posting - i've been just thinking loudly :)) and sorry about my poor english\n\n"
    },
    {
      "time": "8 Feb 2008 — 7:17pm",
      "content": "Your dilemma is not unusual. Typically I think first port of call would be the font’s EULA. Does it permit personal-use modifications. If not then the second port of call would be the font vendor – are they interested in taking your Cyrillics and/or legitimizing your design? After exhausting these options you get onto the more shaky ground. Re-using the Latin outlines is a no-no, as is using the trademarked name – beyond that could you legitimately redraw the Latins as some kind of revival? Read John Downer’s Emigre article on revivals and also check out the typophile thread on Raph’s Centaur revival. My guess is that Rotis is too recent a design for a revival to be seen as legitimate by the type community.\n\n"
    },
    {
      "time": "3 Mar 2008 — 4:18pm",
      "content": "The congress of the US considers the alphabet public domain. Kinda of like copying the wheel.\n\n"
    },
    {
      "time": "13 Mar 2008 — 11:12pm",
      "content": "The US also considers digital outline fonts as software to be subject to copyright, and font designs may be patented.\n\n"
    },
    {
      "time": "22 Mar 2008 — 12:48pm",
      "content": "In order to make sure (and I would have done this before I set down to do the work :-), I would contact the guys who \"own\" the font, i.e. are said to have the copyright. I am not quite sure, but I think there is a version from Adobe and one from Monotype, the latter being the the original version, I believe.\n\nI personally think that the font will probably still be copyrighted (as software), but the design - I agree with Uli (wow!) - is probably not patented anymore, if it ever was (strange that Agfa should forget about something that important). So if you create a cyrillic design and pack it into a new font, than there should be no problem. However, the name may be a registered trademark - you might want to give this type a different name - something like Cyrillic Rotislike, or some such thing :-)) I am quite sure Monotype did NOT forget about this!!! :-))\n\n"
    },
    {
      "time": "22 Mar 2008 — 6:16pm",
      "content": "Adobe licenses it from Monotype - Monotype are the folks you should approach with questions.\n\nRegards,\n\nT\n\n"
    }
  ]
}
