{
  "id": "418",
  "title": "Grotesque/Grotesk?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "what's the reason for grotesque/grotesk type fonts to have this name?   \n   \nis there a connection between the meaning of the word grotesque and the sans serif appearance of the type?\n\n",
  "author": "anonymous",
  "time": "21 Apr 2002 — 12:27pm",
  "uid": "1203",
  "comments": [
    {
      "time": "21 Apr 2002 — 10:39pm",
      "content": "A tangential question:   \n   \nWhat to call a serif like in Charter? Jim Parkinson has been using \"Latin\" to cover that type of serif (look at the description for his wonderful Azuza), but to me a Latin serif is pointy, not sheared off bluntly on the sides. But neither can it be called a slab, because there is a definite tilt.   \n   \n\"Slab Latin\"?   \n   \nhhp\n\n"
    },
    {
      "time": "21 Apr 2002 — 7:45pm",
      "content": "Not quite. \"Grotesque\" is used in the \"primeval\" sense of the word, from the Italian 'grottesco' (\"of a grotto.\") Grotesque types were so named at the beginning of the nineteenth century because of the vogue for antiquity -- the Napoleonic conquest of Egypt ended in these years, and the craze for antiquities led manufacturers of all sorts to attach ancient sounding names to anything novel. Different typefounders chose their own historical names for this new sans serif style, among them \"Egyptian,\" \"Doric,\" \"Antique,\" and \"Gothic.\" The last two terms live on to this day, e.g. \"Franklin Gothic.\"   \n   \nMost of the new type styles developed during these years have antique names, too: slab-serif \"Egyptians,\" wedge-seriffed \"Latins,\" bracketed-seriffed \"Ionics,\" floriated \"Tuscans,\" octagonal \"Grecians,\" inverted \"Italians,\" and so on.   \n   \nFor more on all of this, read James Mosley's \"The Nymph and the Grot,\" an essay now expanded and thankfully republished by the Friends of St Bride a few years ago.\n\n"
    },
    {
      "time": "22 Apr 2002 — 1:42pm",
      "content": "Thanks Jonathan for the wonderful background -- very enlightning.   \n   \nHere's the link to James Mosley's publication:   \n   \n [http://www.stbride.org/publicat.htm](http://web.archive.org/web/20150416140234/http:/www.stbride.org/publicat.htm)   \n   \nCheers.\n\n"
    },
    {
      "time": "21 Apr 2002 — 2:40pm",
      "content": "This kind of family have this name because the first time when appeared looked 'grotesque' to the contemporaries so it was the first defenition to this king of letters and type design.'sans' or 'sans-serif', 'grot'(from'grotesque')in England, 'grotesk' in Germany and 'gothic' in USA, 'grotesca'in Portugal.   \nRegards Lemonlime / Ricardo\n\n"
    }
  ]
}
