{
  "id": "41806",
  "title": "\"What font says change?\" An article on campaign type",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "\"TYPOGRAPHY CAN subtly or boldly define a company, product, or person. Whether it is Best Buy's big, bold, screaming signs or the sweet, elegant script on a wine label, the type talks to us, the reader. The logos of the presidential candidates are no exception.\"\n\n...\n\n[http://www.boston.com/bostonglobe/ideas/articles/2008/01/27/what\\_font\\_sa...](http://web.archive.org/web/20131014040500/http:/www.boston.com/bostonglobe/ideas/articles/2008/01/27/what_font_says_change/ \"http://www.boston.com/bostonglobe/ideas/articles/2008/01/27/what\\_font\\_says\\_change/\")\n\nWhat do you guys think?\n\n",
  "author": "LovesChachi",
  "time": "7 Feb 2008 — 7:27am",
  "uid": "14575",
  "comments": [
    {
      "time": "7 Feb 2008 — 7:41am",
      "content": "Um... d-uh.\n\n"
    },
    {
      "time": "7 Feb 2008 — 7:57am",
      "content": "ok, let me rephrase. What do you guys think \\*of the rest of the article\\*?\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:21am",
      "content": "Of those shown, I guess I like Obama (the type, not the candidate). If there is someone running I thought could make a difference for the better, they must be pretty low profile.  \n; )\n\n ![](http://web.archive.org/web/20131014040500im_/http:/typophile.com/files/prosbodonicurv_5366.gif)\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:41am",
      "content": "Given your gay-baiting past, Dennis, I wish you'd refrain from political commentary. Enjoy the 100 years war.\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:55am",
      "content": "The gay stuff was mainly misinterpreted. I don't think they are any worse than the rest of us.\n\nI don't want war, but ultimately I don't think the other side is going to give us any choice, no matter how weak and accomodating we appear to be. (oh boy, here we go again)\n\nPatty, I like you, and I love your work, so I wish you wouldn't over-react. Can you point out what qualifications Obama has?\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:48am",
      "content": "see this previous thread on the same article:\n\n[http://www.typophile.com/node/41391](http://web.archive.org/web/20131014040500/http:/www.typophile.com/node/41391)\n\nJason C\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:01am",
      "content": "Dennis, his qualifications are quite clear and he is inspiring a whole new generation to vote. But if you don't like his political leanings, he won't be the man for you. I just think that when we get into politics in this forum it doesn't end up in a good place.\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:08am",
      "content": "<cite>Can you point out what qualifications Obama has?</cite>\n\nThe guy has written a memoir covering his life up to and including his time as a state legislator, and since joining the US Senate has written another book reiterating his past and stating his positions on major issues facing the nation and the world. Why is it so hard for people questioning his qualifications to skim them?\n\n<cite>I just think that when we get into politics in this forum it doesn’t end up in a good place.</cite>\n\nAgreed.\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:19am",
      "content": "OK, I'll agree too.  \n: )\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:19am",
      "content": "\\>\\>The gay stuff was mainly misinterpreted. I don’t think they are any worse than the rest of us.\\<\\<\n\nwho's \"us\", and how do you know what the rest of \"us's\" orientation is?\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:24am",
      "content": "<cite>who’s “us”, and how do you know what the rest of “us’s” orientation is?</cite>\n\nDoes it matter? I'm looking at it from a view of either you are perfect, or messed up. And if you are messed up, no sense getting all finger-pointy and self-righteous.\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:47am",
      "content": "I still have some reservations about the Obama logo. Initially I didn't like the non-gradient versions. The gradient version clearly reads sunrise, and works well on many levels. And it is a compact sign and symbol. All that is a real achievement graphically. But I am still a bit uneasy about the cartoonish aura about it.\n\nDennis [here](http://web.archive.org/web/20131014040500/http:/www.washingtonpost.com/wp-dyn/content/article/2008/01/03/AR2008010303303.html) is an excellent article that captures what is great about Obama.\n\nI have become a huge fan of his during this campaign. He's the best we've had for many years,I think. Of course, we can't be sure until he actually governs, but that is true for all of them.\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:49am",
      "content": "<cite>either you are perfect, or messed up.</cite>\n\nAre you kidding??? That's an awfully simplistic view of human nature.\n\nI'm gonna bow out of this thread now...\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:49am",
      "content": "\\> <cite> qualifications Obama has?</cite>\n\nCapable of organizing a team of intelligent and creative people to come out of nowhere and get elected President of the United States of America? (I suspect we haven't seen anything yet.) Like it or not, this guy has already exhibited leadership skills far beyond anything we've ever seen in politics before. He's clean. It's like he's a applying for a job. Policies? I don't know. All I know is he's got his act together.\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:58am",
      "content": "WB, thank you.\n\n"
    },
    {
      "time": "7 Feb 2008 — 11:27am",
      "content": "To get the thread back on topic...\n\nApparently Gotham is the typeface that says \"change.\" Or at least it does in Obama's campaign.\n\n"
    },
    {
      "time": "7 Feb 2008 — 1:54pm",
      "content": "Right. Sorry. I contributed to steering this off topic. I read the article and agree with most of it, especially the top two being McCain and Obama. McCain's says Military. Obama's says \"Welcome to the 21st Century,\" i.e. change. Critically, I think the Gotham is a weak choice because it is TOO soft, TOO dainty. Something suggesting a little more strength and stability would have been nice. Is Arno sturdier?\n\n ![](http://web.archive.org/web/20131014040500im_/http:/typophile.com/files/obama_gotham_5620.jpg)\n\n ![](http://web.archive.org/web/20131014040500im_/http:/typophile.com/files/obama_arno_6092.jpg)\n\n"
    },
    {
      "time": "7 Feb 2008 — 2:11pm",
      "content": "Isn't that Gill Sans for the BarackObama.com?\n\nHis site uses mostly Gotham, which I think looks very strong and presidential, but the Gill on the bumper sticker is indeed weak. He and Rudy were the only ones who had urls on their stickers, which I suppose represents the future.\n\nMcCain's military look is appropriate given he thinks we'll be occupying Iraq for the next 100 years...\n\n"
    },
    {
      "time": "7 Feb 2008 — 7:24pm",
      "content": "Koppa, \"Obama\" isn't Gotham. Gotham is what used throughout his campaign materials. That said, I agree with you that his name in the current serif is a little soft, but I love the logomark.\n\nI just saw him speak in Hartford on Monday. He's got all his bases covered. He's so good...\n\n"
    },
    {
      "time": "7 Feb 2008 — 10:43pm",
      "content": "I saw him speak too - at the Apollo theater. I agree - he was really inspiring.\n\nEven my mama voted for Obama.\n\nFingers crossed...\n\n"
    },
    {
      "time": "8 Feb 2008 — 5:26am",
      "content": "The 'Obama' next to the symbol is Perpetua, I believe. I think it's very strong, but perhaps a little light in weight here. Maybe the bold would have worked better, but it's so bold that it might overbalance...\n\nFor those of us in the know, Gill's work has some uh, associations, but that's probably irrelevant.\n\n"
    },
    {
      "time": "8 Feb 2008 — 7:04am",
      "content": "Has anyone else noticed that once Obama’s Gotham signs got popular the other candidates have been using it on and off? I see it a lot in their televised rallies, especially from McCain and (until yesterday) Romney.\n\nIt would be really nice if someone would start analyzing how boring it is for almost all federal-level campaigns to stick with the red, white, and blue color schemes. It can be really gorgeous when done well, but too often it gets combined with bad type and just looks like phony patriotism. Do campaigns in other countries tend to stick with the flag colors?\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:36am",
      "content": "\\> Do campaigns in other countries tend to stick with the flag colors?\n\nNo. I guess I speak for all europeans (at least) here when I say that the U.S. seem to be obsessed with red, white and blue.\n\n[EDIT] ... and stars.\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:47am",
      "content": "<cite>No. I guess I speak for all europeans (at least) here when I say that the U.S. seem to be obsessed with red, white and blue.</cite>\n\nSorry, I didn’t mean America’s flag colors, I was wondering if people in other nations run their stuff in their own flag colors.\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:56am",
      "content": "I know it is usually similar in Mexico, with red, white, and green.\n\n"
    },
    {
      "time": "8 Feb 2008 — 9:09am",
      "content": "\\> I was wondering if people in other nations run their stuff in their own flag colors.\n\nYeah. I got that right. In Germany you see black, red and gold (yellow) occasionally with conservative parties. But very subtle. Socialist parties stick with good ol’ red of course. Showing off national symbols has been a problem in Germany until maybe recently with the football (soccer for the U.S.) world championship in 2006, because of our history. I think even countries with the same national colors as the U.S. (France, the UK or Norway) don’t use them as exessively.\n\n"
    },
    {
      "time": "8 Feb 2008 — 9:15am",
      "content": "\\> <cite> \"Obama” isn’t Gotham.</cite>\n\nOh. Well, I guess that goes to show how much I know about [Gotham](http://web.archive.org/web/20131014040500/http:/www.identifont.com/show?9YC)! Duh.\n\n"
    },
    {
      "time": "8 Feb 2008 — 9:21am",
      "content": "<cite>No. I guess I speak for all europeans (at least) here when I say that the U.S. seem to be obsessed with red, white and blue.</cite>\n\nThe U.S. is long overdue for a rebranding. The current flag is great and all, but I can't help but feel like people would be less apt to, you know, burn it and stuff if it were more Web 2.0.\n\n"
    },
    {
      "time": "11 Feb 2008 — 5:12pm",
      "content": "When we have candidates like Huckabee supporting the Confederate flag ( [http://www.huffingtonpost.com/2008/01/18/huckabee-embraces-confede\\_n\\_821...](http://web.archive.org/web/20131014040500/http:/www.huffingtonpost.com/2008/01/18/huckabee-embraces-confede_n_82199.html \"http://www.huffingtonpost.com/2008/01/18/huckabee-embraces-confede\\_n\\_82199.html\") ), I can't get too upset about all the American flag crap the rest of the candidates have.\n\nWith Hillary slipping in the nationwide polls, how long before the micro-analyzers at CNN invite a type designer on to explain how it's all the fault of her lame signage?\n\n"
    },
    {
      "time": "12 Feb 2008 — 6:29am",
      "content": "<cite> ...her lame signage?</cite>\n\nHar dee har. I struggle with children calling adults by first names, and even at age 39 I don't like to refer to my superiors by first name. Let alone a presidential candidate. To me, running as \"Hillary\" seems too much of a touchy-feely emotional plea. Let's face it, we're still at war and we still need an ass kicker in the White House. So, to move into philosophy for the sake of a \"general discussion,\" is it the design of the sign, or is it just the \"Hillary?\"\n\nAs for the flag...I'm not so sure I ever thought it was that great of a flag. It's too 1770's. The U.S.S.R. flag was cooler.\n\n"
    },
    {
      "time": "12 Feb 2008 — 7:36am",
      "content": "Here in Finland blue and white tend to dominate presidental election posters, but in other elections it's all about party's own colour.\n\nHere are the last presidental election's final round candidates' posters:\n\n ![](http://web.archive.org/web/20131014040500im_/http:/typophile.com/files/niinisto2_iso_3538.jpg)\n\n ![](http://web.archive.org/web/20131014040500im_/http:/typophile.com/files/maarit_ja_juliste_4017.jpg)\n\nThe woman with photoshopped face won.\n\n"
    },
    {
      "time": "12 Feb 2008 — 7:50am",
      "content": "It's a sorry day indeed when Rotis Semi Serif wins an election...\n\nOn the other hand, the top ad doesn't look like a campaign ad at all. Might help if I could read Finnish.\n\n"
    },
    {
      "time": "13 Feb 2008 — 10:20am",
      "content": "The top poster says: The time of confrontation is over... The Workers' President. The candidate (Sauli Niinistö) is from the Coalition party, sort of Republicans, I suppose, center-right. Trying to win over working class voters but at the same time keep the old voters, upper middle class, entrepreneurs etc.\n\nThe winner's poster claims to be a President of whole of Finland – she was running for her second and last term, and has been one of the most popular presidents ever. Tarja Halonen is a Social Democrat.\n\nIt was a close race, and Halonen won. Niinistö is now the speaker of the parliament. He got in to the parliament with a record amount of votes and this campaign theme (Toivo=hope)\n\n ![](http://web.archive.org/web/20131014040500im_/http:/typophile.com/files/toivo_6277.gif)\n\n"
    },
    {
      "time": "13 Feb 2008 — 7:41pm",
      "content": "Hi Pattyfab! I don't mean to be rude, but something's not right when you can make the following two statements in a single post:  \n[His] qualifications are quite clear and he is inspiring a whole new generation to vote... I just think that when we get into politics in this forum it doesn’t end up in a good place.\n\n"
    },
    {
      "time": "13 Feb 2008 — 9:25pm",
      "content": "I was responding to Dennis comment and then suggesting we leave our political views out of this forum. Everyone is entitled to his or her opinion, but it has gotten ugly in the past.\n\nI don't see a problem with that.\n\n"
    },
    {
      "time": "14 Feb 2008 — 4:38am",
      "content": "But you express your own political views on this thread.  \nSorry, this is a diversion.\n\n"
    },
    {
      "time": "14 Feb 2008 — 7:56am",
      "content": "\\>The top poster says: The time of confrontation is over... The Workers’ President.\n\nAre you sure - I think it says \"Hello, I'm a Mac\" ;-)\n\n"
    },
    {
      "time": "14 Feb 2008 — 8:57am",
      "content": "A lot of people have little room for opposing viewpoints without getting angry. That is one reason political discussions aren't good in a forum like this.\n\n"
    },
    {
      "time": "14 Feb 2008 — 10:58am",
      "content": "Just a couple of comments...\n\nChange - for the sake of change? Give me a break.\n\nStop the Hustle.\n\nThank you.\n\nAnd I think Hillary is squandering any Clinton cashe that would of easily refuted her opponent's hustle. Didn't a Clinton already clean up after one Bush? So why can't that be done again? Huh?? It's the economy stupid.\n\nAnd you want what? Change? Why?\n\nGet a grip, ok?\n\nHillary's graphic has failed - and Barack's has succeeded. McCain's graphic didn't matter anyway. And the rest don't/didn't have a strong graphic message.\n\nAnd again, as for change... that's a whole lot of feathers, and not much chicken.  \n(lyrics, Canadian rocker, Kim Mitchell)\n\n"
    },
    {
      "time": "14 Feb 2008 — 12:06pm",
      "content": "I think its time for a time-out. This forum is about type not people's politics. Please send your remarks to one another directly. I was equally reprimanded at a bird watching site. I didn't follow the real focus of the site and I was embarrassed by my posts by the administrator.\n\n"
    },
    {
      "time": "14 Feb 2008 — 12:48pm",
      "content": "He started it!!!\n\nJust kidding ;-P\n\n"
    },
    {
      "time": "14 Feb 2008 — 4:35pm",
      "content": "As a Typophile moderator† I will kindly ask you to do you very best to resist starting political debates at least until October of this year.\\*\n\nThank you.\n\n† Typophile moderators reserve the right to stop threads, behave yourselves.  \n\\* If you just can't help yourself, post it as a blog entry so it doesn't litter the other forums.\n\n"
    },
    {
      "time": "17 Feb 2008 — 11:29am",
      "content": "<cite>He started it!!!</cite>\n\nShe's a big meanie!  \n: )\n\n"
    }
  ]
}
