{
  "id": "41808",
  "title": "Client vs. Designer :: Who owns the typeface?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I am currently doing environmental graphics for a collegiate arena. The campus recently standardized all exterior building signage as Whitney semi-bold [[Hoefler & Frere-Jones](http://web.archive.org/web/20131013172821/http:/www.typography.com/fonts/font_styles.php?productLineID=100026)], under the direction of a different design consultant.\n\nIf that university purchased Whitney for the other design consultant to use, should my design group have access to that typeface too? Or do we need the university to purchase another license, as we are two separate businesses?\n\nI know this is a basic question, but one must learn these things along the way ...\n\n",
  "author": "Gemma Bayly",
  "time": "7 Feb 2008 — 8:25am",
  "uid": "22593",
  "comments": [
    {
      "time": "7 Feb 2008 — 8:48am",
      "content": "You need to purchase your own based on the number of computers with the fonts. You can contact H&F-J about an educational discount and negotiate if circumstances require, but you need to license the font. You will never own a font unless you design it yourself.\n\n"
    },
    {
      "time": "7 Feb 2008 — 9:03am",
      "content": "The university bought the license for their own use. If your design group wishes to use the same typeface, your design group would need to purchase that license. Unless the university is kind enough to purchase a license for you, I don't think they are obligated to do so.\n\n"
    },
    {
      "time": "7 Feb 2008 — 10:41am",
      "content": "I can see Gemma's dilemma: the licensing requirements for the font seem to contrast with the client's perception that they are buying the same thing twice for only one use. This is an issue that designers deal with all the time with all sorts of digital assets: fonts, photos, illustrations, original layouts, etc.\n\nIf a client requires that you use a typeface that you do not have, that may be an opportunity to have them purchase it for you (as apparently the other designer managed to do so). But no, now neither you nor the university have any claim to his font. I would say that most clients that do pay for typefaces don't fully grasp that this isn't necessarily something they get to walk away with.\n\nWhether you want to openly press the university to cover the cost or whether you eat it as just the price of doing business (and thereby distinguish yourself from the other designer) is really your call.\n\n"
    },
    {
      "time": "7 Feb 2008 — 1:10pm",
      "content": "Should an agency/studio pass along its font licence costs to the client?\n\nAlthough the agency may get fonts for use on one client's job, it can subsequently use the fonts on work for other clients.\n\nIs it unprofessional to use the same fonts on work for different clients? After all, if clients pay for an unusual font, shouldn't they get some measure of exclusivity? If the typeface is in more common usage, as Gotham is, why should the client pay for something that has little exclusivity, and will probably be used by the agency on work for other clients?\n\nIt seems to be a judgement call for the agency/studio, based on the re-usability of the fonts, and their cost as a proportion of the initial job expenses.\n\nPerhaps it makes more sense to budget a \"new font cost\" factor as a general overhead into the hourly rate -- unless one is going to restrict one's practice to fonts bundled with applications and OS's.\n\nThat may seem like padding to some clients, if all they want is in fact a bundled font, but in that case they're using the wrong agency/studio.\n\nEven if you decide to make font licensing a general overhead cost, it may still be necessary to charge certain clients for exceptional font licence purchases.\n\n"
    },
    {
      "time": "7 Feb 2008 — 1:18pm",
      "content": "If I bill the client for a typeface, I transfer it to them upon completion of the job.\n\nUsually, though, If I'm getting a typeface, I want it too, so I usually just buy it and treat it as a business expense like any software. Then I can use it down the road.\n\nIf I buy the font and the client also wants it for their own in-house use, then they buy their own license in addition to the one I bought.\n\nIn the end, your own billing practices are irrelevant. All that matters (ethically/legally speaking) is that all concurrent users of the typeface have a license from the type foundry.\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:51pm",
      "content": "H&FJ have an amazingly clear, concise and well thought out licensing page… [http://www.typography.com/ask/topics.php?topicID=10](http://web.archive.org/web/20131013172821/http:/www.typography.com/ask/topics.php?topicID=10 \"http://www.typography.com/ask/topics.php?topicID=10\") – it seems to answer the exact question asked here.\n\n"
    },
    {
      "time": "28 Feb 2008 — 1:26pm",
      "content": "The problem is that nobody owns the font except the foundry. Everyone else is required to purchase a license for use. I do the same as aluminum: if it's a font I used only for that one job and don't want to use again I pass the fee (and the font) onto the client. For fonts I plan to add to my library and continue to use, I pay. It's a business expense and I budget it in. I do tend to buy them when I have a specific job in mind (which eases the pain) rather than just because I want them\n\n"
    },
    {
      "time": "29 Feb 2008 — 4:26am",
      "content": "<cite>I do the same as aluminum: if it’s a font I used only for that one job and don’t want to use again I pass the fee (and the font) onto the client.</cite>\n\nIsn’t that a kind of (objectionable – depending on the EULA) resale? I mean: _you_ licensed the font, for use on _your_ computer. Thereafter, the client will likely use it on his/her computer. If another designer is going to continue the work in the future, will the client then ‘sell’ (=pass) the fonts to him/her? And back again?\n\n"
    },
    {
      "time": "29 Feb 2008 — 5:48am",
      "content": "exactly ! what is it ? nobody seems to agree or know. did we buy this, are we renting it, or just transferring a license ?\n\nit's not so much resale as it is : \"i'll arrange getting this for our job together and i'll borrow it first and i might charge you a little for the trouble\"... or something.\n\nit's cumbersome and confusing and makes strict EULA conformity seem almost impossible, which points out a big problem with the business model itself.  \nif few understand it and even fewer like it - it's violation time.\n\nhence this thread on the future of licensing :\n\n[http://typophile.com/node/42540](http://web.archive.org/web/20131013172821/http:/typophile.com/node/42540 \"http://typophile.com/node/42540\")\n\n"
    },
    {
      "time": "29 Feb 2008 — 7:07am",
      "content": "\"If another designer is going to continue the work in the future, will the client then ‘sell’ (=pass) the fonts to him/her? And back again?\"\n\nHa! Interesting loophole. I imagine the paperwork involved wouldn't justify it, though.\n\nBut, yea, in theory, one could just keep reselling the license back in forth, uninstall, install, uninstall again, reinstall.\n\n"
    },
    {
      "time": "29 Feb 2008 — 8:17am",
      "content": "How do you all deal with foundries that do not allow license transferring?\n\n"
    },
    {
      "time": "29 Feb 2008 — 8:32am",
      "content": "Some foundries are better than others, but in the case of H&FJ the transfer policy is there in black & white - [http://www.typography.com/home/eula.php](http://web.archive.org/web/20131013172821/http:/www.typography.com/home/eula.php \"http://www.typography.com/home/eula.php\")\n\n“5. No Transfer of Rights. You shall not sell, lease, sublicense, allow to use, or otherwise assign or transfer any of your rights, duties or obligations under this Agreement, in whole or in part, to any person or entity. Without limiting the foregoing, Typefaces licensed for use by a specific publication shall not be transferred to or used by other publications owned or managed by a common corporate parent, and/or affiliated with the specific publication to which this license has been granted, without the purchase of an additional license from H&FJ.”\n\nSeems crystal clear to me, what’s there to discuss? If the terms are good enough for Obama, they should be good enough for everyone. Pay the man, ignore the EULA or shop elsewhere.\n\n"
    },
    {
      "time": "29 Feb 2008 — 8:58am",
      "content": "\\>\\> Pay the man, ignore the EULA or shop elsewhere. \\<\\<\n\nany guess as to which of these is the most common choice ?\n\n"
    },
    {
      "time": "29 Feb 2008 — 9:31am",
      "content": "My guess...\n\nCorporate world - 80% pay the man / 20% ignore the EULA\n\nDesign shops - 80% ignore the EULA / 20% pay the man\n\nIndependent designers - 50% shop elsewhere / 50% ignore the EULA\n\n"
    }
  ]
}
