{
  "id": "41814",
  "title": "Univers on the web",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am comping up a design with Univers used for headings and such, but am a bit miffed about what typface for body copy to pair it with.\n\nWould Helv Nue/Arial go well?\n\nGeorgia and Times look weird to me?\n\nAny suggestions?\n\nExample of usage: [http://myobie.com/temp/univers-and-arial.gif](http://web.archive.org/web/20080214133252/http:/myobie.com/temp/univers-and-arial.gif)\n\n [‹ Gothic720--need a substitute](http://web.archive.org/web/20080214133252/http:/typophile.com/node/41948 \"Go to previous forum topic\") [Font aficionados, I need help ›](http://web.archive.org/web/20080214133252/http:/typophile.com/node/41896 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080214133252/http://typophile.com/user/14970\" title=\"View user profile.\">myobie</a>",
  "time": "<br>",
  "uid": "14970",
  "comments": [
    {
      "time": " 7.Feb.2008 4.03pm",
      "content": "This is for the web? I’ll assume so. In that case I’d use Georgia for contrast with the sans.\n\n"
    },
    {
      "time": " 7.Feb.2008 5.05pm",
      "content": "Or spec Helv at a really small size so the un-Univers-like features are not apparent.\n\nCheers, Si\n\n"
    },
    {
      "time": " 8.Feb.2008 9.23am",
      "content": "Yeah, I was looking at Helv, but it would be substituted by Arial on windows machines.\n\nGeorgia is great, but it does look a bit weird on the page. When I get the page built, I will test out some different faces (including Lucida).\n\n"
    },
    {
      "time": " 8.Feb.2008 10.17am",
      "content": "This might be blasphemy, but on a lot of windows machines Arial actually looks ok at text sizes. Here’s a screenshot taken from Windows XP, cleartype turned on.\n\n ![](http://web.archive.org/web/20080214133252im_/http:/typophile.com/files/post_5300.gif)\n\n(hope that worked, I haven’t used the image uploader here before)\n\n"
    },
    {
      "time": " 8.Feb.2008 11.12am",
      "content": "I find Arial looks much better as body copy on the web anyway. Something about the spacing is just more readable.\n\nThe only time I use Helvetica is for headers, or large point sizes.\n\n"
    },
    {
      "time": " 8.Feb.2008 11.27am",
      "content": "True, most of the haters overlook the screen-hinting aspect of Arial - which is funny because the literature at the time focused on the hinting rather than the metric compatibility with Helvetica - suppose there were so many clones back then vying for attention that it didn’t seem worth mentioning.\n\nAnyhow if it’s being avoided for religious reasons surely “Helvetica, Tahoma, sans-serif” would work?\n\n"
    },
    {
      "time": " 8.Feb.2008 12.45pm",
      "content": "I am not avoiding Arial, just wondering if there is something better to go with Univers. I am looking at Arial and Lucida now. One of those will probably win.\n\n"
    },
    {
      "time": " 8.Feb.2008 12.46pm",
      "content": "And thanx for the screenshot brendanm.\n\n"
    },
    {
      "time": " 9.Feb.2008 1.09pm",
      "content": "You’re welcome! I figured I am one of the few people on this site who actually uses a PC on a regular basis.\n\nFWIW, most of the windows xp users i know have cleartype turned off anyway, so everything looks really pixelated. Under those conditions, arial actually looks better than most of the other options. I believe Vista has cleartype or its equivalent on by default.\n\n"
    },
    {
      "time": " 9.Feb.2008 1.18pm",
      "content": "Kind of off topic, but how do you turn cleartype on and off?\n\n"
    },
    {
      "time": " 11.Feb.2008 12.03am",
      "content": "Vista does indeed have Cleartype turned on by default, and in XP it is done by going into the appearance tab of the display properties dialog, and then clicking the ’Effects...’ button and there’s a dropdown box in there.\n\nThere are a huge host of fonts which render poorly without cleartype on at small or even text sizes, so when doing web work it needs constant checking because, as brendanm noted, most XP users wouldn’t have a clue what cleartype was or how to turn it on.\n\n-Rafe\n\n"
    },
    {
      "time": " 11.Feb.2008 2.40am",
      "content": "99% of the people in the world cannot tell Univers from Helvetica. 99% of the of the same people probably couldn’t tell Helvetica from Arial.\n\nAt body copy size, with Cleartype turned off, that means that most of the people in the entire world won’t even notice if you use Univers, Helvetica, and Arial all in the same word, let alone the same page.\n\nSo if you’re going to go sans, stay with Arial.\n\nAlthough... I like setting Lucida at 13 point, since that’s the same size as the UI of the computer (XP and OS X. Sii? Correct me if I’m wrong.).\n\n"
    },
    {
      "time": " 11.Feb.2008 4.50am",
      "content": "\\>So if you’re going to go sans, stay with Arial.\n\nJust pay attention that Arial is not set too small by default. I know you cannot say that, but Arial set in 10px by default is too small.  \nThere is another option, Verdana. Which reads and looks better in small sizes.\n\n"
    },
    {
      "time": " 11.Feb.2008 10.28am",
      "content": "When you get down to that size all of the characteristics are squished down anyways. In that case, I’d say that Verdana always wins due to the nature of the beast.\n\n"
    }
  ]
}
