{
  "id": "41829",
  "title": "I need information on designing at massive scale",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am working on a massive project—a 100 foot by 24 foot wall hanging that will be printed in smaller sections. I’ll be working with the printer from the start to avoid borking the project, but I want some advice from anyone else who has done this. I know that I can’t do something like this without specialized software, so would it make sense to develop the sections as individual Illustrator or Indesign files and create a large Indesign document (to scale, anyway) for the entire wall and place the files into that to put the whole thing together for comps? Or should I just do one scale piece and then break it up when I print? Also, are there any good books on graphics at this sort of scale?\n\n [‹ Advice and help on Garamond](http://web.archive.org/web/20081203214506/http:/www.typophile.com/node/41572 \"Go to previous forum topic\") [Help designing a gothic typeface ›](http://web.archive.org/web/20081203214506/http:/www.typophile.com/node/41858 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203214506/http://www.typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 7.Feb.2008 4.12pm",
      "content": "Define massive? For offset or large format? Highway signs or building signs?\n\n"
    },
    {
      "time": " 7.Feb.2008 4.50pm",
      "content": "<cite>Define massive?</cite>\n\nThat was the first sentence of my original post. But the forum changed the measurement marks to apostrophes :)\n\n<cite>Highway signs or building signs?</cite>\n\nI’m working on an indoor wall hanging for a large convention. It will be printed using some large-format specialty printer (I’m going after those details tomorrow AM) in the aforementioned sections and assembled on-site.\n\n"
    },
    {
      "time": " 7.Feb.2008 5.58pm",
      "content": "I’ve done billboards in Illustrator and Photoshop before. We’re talking the large 14’x48’ bad boys. (Sorry couldn’t resist.) I usually work at 10% of final size. The final output for the dealers I print through for this dimension is 10 dpi. For highway driving that is plenty of dpi. So I usually work at 100 dpi or more if I have it. Working at a final percentage is never a problem or shouldn’t be. What matters is the math.\n\n"
    },
    {
      "time": " 8.Feb.2008 7.01am",
      "content": "I’ve done some large exhibition design/graphics (30x14). I started with the architectural drawings and got some proportions from the building’s design, and then set up the Indy doc grid to match the surface areas at scale. I made all my output files 100% because I didn’t know/trust the person doing the output. Turns out my biggest problem was with the installation/building crew that was less than precise with their sheet-rock work. Elevations drawings were at 1/2” = 1’, and also 1” = 1’.\n\n"
    },
    {
      "time": " 8.Feb.2008 10.04am",
      "content": "I have done a lot of large signage including a 80’ x 210’ wall covering for Prince.\n\nTight integration with the printer is what it’s all about - find out from them exactly what they need to do this.\n\nIf you are going to work full scale then Photoshop is the only option (yes, it’s possible). You can also work to scale - 1/12, 1/48 are common. (Beware that 1/48 is called 1/4 scale in the signage industry because it is 1/4” - 1’).\n\nBasically let your printer guide you through this - they will tell you what scale and what res at that scale they expect.\n\npbc\n\n"
    },
    {
      "time": " 8.Feb.2008 1.54pm",
      "content": "When I did billboards we used to mock them up on little tent cards and have the client view them from the other end of a boardroom table. It sounds a bit silly (shades of Spinal Tap), but there is actually some correspondence between those little tent cards as 3D objects, and the way large signage is observed in the environment, perhaps to do with the motility of the viewpoint.\n\n"
    },
    {
      "time": " 8.Feb.2008 2.06pm",
      "content": "Nick, those are still used and do make for laughs. We’ve also printed them out at scale and walked the distance to get an idea.\n\n"
    },
    {
      "time": " 9.Feb.2008 9.38am",
      "content": "I thought one of the benefits of vector-based artwork was that it was infinitely scaleable. Then why the photochop stuff? I guess if you want anything bitmapped, but I’ve seen a super-cool method of taking a pixelized bitmap (at like 30 ppi, but just the physical size changed, not the actual resolution) and converting THAT into vector art.\n\n"
    },
    {
      "time": " 9.Feb.2008 10.07am",
      "content": "Wish you’d put that method in your blog, Dan. :-)\n\nSharon\n\n"
    },
    {
      "time": " 9.Feb.2008 10.48am",
      "content": "Lemme see if I can find it...\n\n"
    },
    {
      "time": " 9.Feb.2008 11.00am",
      "content": "Here we go. I found the link. Sorry about that, I was thinking about pixels, but it’s actually a halftone method. 3 of them. Pretty damn cool, if you ask me.\n\n[VECTOR HALFTONES from RASTER Images](http://web.archive.org/web/20081203214506/http:/www.bittbox.com/illustrator/bb-special-3-ways-vector-halftones-from-raster-images/)\n\n"
    },
    {
      "time": " 9.Feb.2008 11.14am",
      "content": "I deal with pop stars so large photos are necessary. You can Live Trace photos with amazingly good results but the outlines are far too complex for most RIPs. I forget the exact number but there is a limit to how many points can be ripped and a limit as to how close they can be (if I remember correctly they cannot be closer than 3px).\n\nMost billboards aren’t really that large in PS - 1/2 a gig or so. All vector is delivered as shape layers.\n\nI have had many billboard vendors ask me for layered .psd files. I don’t argue with them I just deliver it. Most final output res on billboards is 18-25ppi. A typical size is 48’ x 14’. So you’re talking 576” x 168” @ 20ppi or so. 11520px x 3360px if 20ppi is what they are looking for, large but not crazy large. Certainly not .psb territory.\n\nI have 18” x 24” posters that are much larger than that (16bit RGB layered files) before they are converted.\n\nDo I prefer to work in all vector and in ID or Illy? No doubt. It’s just not always possible.\n\nThe real problem is getting quality information. I have been quoted some really bad specs over time. I get the number of whoever is going to print it, call up and ask a question that the receptionist or salesman can’t possibly answer. Then I am transferred to a production person who actually speaks my language.\n\npbc\n\n"
    },
    {
      "time": " 9.Feb.2008 11.40am",
      "content": "I always forget that distance plays a factor in the resolution. Up close, those things look like dogs, but from a ways away things start looking pretty good.\n\n"
    },
    {
      "time": " 9.Feb.2008 12.52pm",
      "content": "Actually a 9 lpi screen up close becomes like an Andy Warhol, really beautiful in it’s own way…\n\npbc\n\n"
    }
  ]
}
