{
  "id": "41831",
  "title": "Anybody know a Bremer Presse font with the alternative \"r\" and \"e\"?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Anybody know a Bremer Presse font with the alternative \"r\" and \"e\"? I was reading about Blumenthal's font Spiral (Later Emerson with monotype) which, before Monotype sold it, had an r with a short arm and another with a long arm. But in the book it mentions that Blumenthal was very influenced by ideas about paper and type that were in vogue at the Bremer Presse. And that the Bremer Presse had a font with the alternative \"r\" and \"e\". The book is called \"American Proprietary Typefaces\", and the section was written by Jerry Kelly. Actually if anybody has info on how to contact him that would be great too.\n\n",
  "author": "ebensorkin",
  "time": "7 Feb 2008 — 5:10pm",
  "uid": "2942",
  "comments": [
    {
      "time": "7 Feb 2008 — 8:26pm",
      "content": "As far as I know, no one has made a digital version of the Bremer Presse type designed by the printer publisher Will Wiegand. If someone has, I think I might prefer not to know about it, because I quite like the idea of private press typefaces remaining what they were -- the exclusive working tools of the people who made them or commissioned them to be used in very particular ways in specific books.\n\nI have a couple of Bremer Presse books, though, Eben, and have scanned the 1922 12pt roman, which includes the variants to which you refer. I had not noticed this feature of the types before, so thank you for drawing my attenion to it. Interestingly, only the 12pt has them: the 1924 11pt does not.\n\nThe differences between the variants are quite subtle. I'm afraid I would need longer to track down examples of the individual variants in use, so we could determine in what contexts they were used.\n\n ![](http://web.archive.org/web/20150221091455im_/http:/typophile.com/files/Bremer12_3906.jpg)\n\nIn the earlier, 1913 16pt there are variants for a f i and t, but not for r. The variant i is particularly interesting: the difference is in the size of the dot, and I'm guessing that one is for use after the non-ligating f.\n\n ![](http://web.archive.org/web/20150221091455im_/http:/typophile.com/files/Bremer16_6743.jpg)\n\nThere are also similar variants in the eccentric Bremer Presse Greek type.\n\n"
    },
    {
      "time": "7 Feb 2008 — 8:28pm",
      "content": "PS. Note the question mark shape, also seen -- and much detested by some people -- in the Schneidler Antiqua types.\n\n"
    },
    {
      "time": "8 Feb 2008 — 12:43am",
      "content": "Thanks very much! This is terrific.\n\nThese examples are quite wonderful. What I am struck by is the multiple t glyphs with their various cross bar lengths. They make a great deal of sense to me. I agree the double i makes sense as well in the context you mention. As do the double f's and perhaps especially the a's. The a corresponds very nicely to what I have seen H. Zapf do in his calligraphy, and 15th century scribes do as well.\n\nIn the book I mentioned above it was stated that the long r in Spiral was supposed to be set to make an over-lose justified line set better. The example I saw didn't suggest that to me at all. Instead they seemed to use the long r as a calligrapher would; setting it at the end of words. The short one was used next to other letters on the right. John, have you see the seen the book I an talking about? If not, would like to see the Spiral?\n\nI have requested the book shown in the sample ( RW Emerson's \"Nature\") but I don't know yet if I get get it.\n\nInterestingly Erik S talked about the utility of the ck & ch glyphs shown in the same here. Also there are two kinds of them. That have to be for a reason. I would like to see why they are so useful in general and why they would require two kinds. Maybe it was for cultural/linguistic reasons rather than optical ones. At the moment I don't have enough insight into that.\n\nIt niggles at me that “American Proprietary Typefaces” is very clear about a second e but none is here. Could this be an incomplete showing? Or an early one; prior to the second e? Could there be another Bremer Presse type font/face with that feature?\n\nIt would be great if somebody would quote us a title so we could get ahold of it and see this face at work. Maybe we could get Dan to find one in Germany or Paul to dig one up at Reading...\n\n"
    },
    {
      "time": "8 Feb 2008 — 4:37am",
      "content": "My first thought: I wouldn't want to be the one to have to sort the i's back into the cases!\n\nWould these alternate sorts be marked on the type for that purpose?\n\n"
    },
    {
      "time": "8 Feb 2008 — 7:31am",
      "content": "Craig, maybe it's just early, but I don't follow your question. Cold you put it another way?\n\n"
    },
    {
      "time": "8 Feb 2008 — 7:51am",
      "content": "I just meant, with such subtle differences in the letterforms on these metal types, it would be very difficult to know which i is which when putting the sorts back in the case (assuming that you would want to file the one kind of i in one box and the other in another). But then I thought it'd be practical to have some marking on the type body itself -- a nick, or hole, or painted side, or engraved symbol or the like -- that would aid this process.\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:20am",
      "content": "I see. Yes that makes sense.\n\nJohn, do you think these faces were cast by Bauer?\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:28am",
      "content": "Eben: _It would be great if somebody would quote us a title so we could get ahold of it and see this face at work._\n\nThe two Bremer Presse volumes I have, one about the press and one publication of the press, are _Die Bremer Presse: Königin der deutchen Privatpressen,_ 1964, and _Albii Tibulli: Elegiae_ 1920. The latter is set in the 16pt type, with elegant initial letters and titles by Anna Simons, who did a lot of work for the Bremer Presse.\n\nA quick perusal of the latter book indicates that the variants of i were, in fact, interspered freely, and not used contextually. It would be interesting to compare this setting with earlier use of the type, including initial specimens if available, to see whether the different i characters were originally contextually selected. Maybe they were, and Wiegand later decided that it wasn't worth the trouble.\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:38am",
      "content": "Very interesting. If they were never contextually selected -- do you know of any precedent in metal type of designed alternates intended to be mixed in, presumably to give the printed copy a more varied, perhaps handlettered appearance? We've seen digital fonts that introduce randomness to gain that effect, but I never considered that metal types might have done something similar. Might this have been a kind of compensation for the improved consistency in the casting technology?\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:55am",
      "content": "In general I don't think these extra sorts were to introduce randomness at all. Quite the opposite. I think they are there to produce a deliberately better optical fit. John, your theory may be right. It sounds pretty plausible. There is not a TON of difference in the i shapes. And if they didn't take the precaution Craig imagined then they might easily have been mixed.\n\n<cite> Might this have been a kind of compensation for the improved consistency in the casting technology? </cite> I don't think that was the idea. But I also don't think introducing a gentle noise into the forms would be an utterly bad idea. I think some gentle variation is pleasant for the brain/eye.\n\n"
    },
    {
      "time": "8 Feb 2008 — 10:13am",
      "content": "_do you know of any precedent in metal type of designed alternates intended to be mixed in, presumably to give the printed copy a more varied, perhaps handlettered appearance?_\n\nWilliam Dana Orcutt, discussing the design of his Humanistic type in _In quest of the perfect book,_ writes 'I decided to introduce the innovation of having several characters for certain letters that repeated most frequently, in order to preserve the individuality of the hand lettering, and still keep my design within the rigid limitations of type'. I'm not sure when the Humanistic type was first used, but Pankow's _Proprietary American Typefaces_ shows a setting from 1906. Here is a sample from Orcutt's book:\n\n ![](http://web.archive.org/web/20150221091455im_/http:/typophile.com/files/OrcuttHumanistic_6246.jpg)\n\n"
    },
    {
      "time": "8 Feb 2008 — 7:39pm",
      "content": "This is really interesting. I find myself wondering how I would have set it differently. The g sort kills it. I admit I like the idea up to a point but I was building variation I would sooner see it more subtle a within a given deliberate fitting. Thanks very much for showing this also.\n\n"
    },
    {
      "time": "9 Feb 2008 — 5:36am",
      "content": "Wasn't this concept of alternates also part of some of the earliest fonts used in the incunabula? I seem to recall something about several variants for many, if not all, Gutenberg's letters -- the idea being to better emulate the work of the scribes in an effort to \"sell\" the new technology to those who were accustomed to variability in their manuscripts.\n\n-- K.\n\n"
    },
    {
      "time": "9 Feb 2008 — 5:47am",
      "content": "FWIW, the variation in Gutenberg's letters is explained by [these guys](http://web.archive.org/web/20150221091455/http:/www.open2.net/home/view?entityID=15589&jsp=themed_learning%2Fexpanding_viewer&sessionID=-1202564568669&entityName=object) as resulting from his casting each letter from a unique mold, rather than a reusable matrix.\n\n"
    },
    {
      "time": "9 Feb 2008 — 7:27pm",
      "content": "The Gutenberg 42-line Bible also shows evidence, as explained by Hermann Zapf, of variant letters as an aid to justification: letters of different width are used to maintain consistent letter and word spacing. Zapf had the idea to do the same thing dynamically, by intelligently scaling glyphs horizontally without distorting them or changing stem weights. This was implemented by URW as part of the Hz text layout engine, but not currently active in any shipping software, so far as I am aware.\n\n"
    },
    {
      "time": "10 Feb 2008 — 1:37am",
      "content": "Actually - there is one software package that does that and many other things, but not as an aid to composition. It's the RMX ( Font Remix Tools ) for Fontlab by \"Just Another Foundry\". I have been meaning to try it & to read about people's reaction to it on Typophile. Maybe soon....\n\n"
    },
    {
      "time": "10 Feb 2008 — 8:58am",
      "content": "The methods differ, I think. According to a brochure, the hz Program would need a single master for this, and adjust certain glyphs' widths only if a line requires this (let's call this 'dynamic'). RMX needs two masters, and does its job on a production level (thus producing a 'static' result).\n\n"
    },
    {
      "time": "10 Feb 2008 — 1:16pm",
      "content": "Good point!\n\n"
    },
    {
      "time": "11 Feb 2008 — 2:16am",
      "content": "For the alternate 'f' in the 1913 Bremer Presse I do have a possible idea.  \nThe second one with the longer crossbar might have been used at the end of words.\n\nI came to such a design decision in one of my font concepts (not digitalised [yet?]) as a contextual alternative (i.e. giving the f a longer crossbar before space, period and comma for better balance). -- And I guess I was not the first one to have this idea (while I did not see it anywhere else before).\n\nInvestigating the actual use of the 1913 f-s would be interesting!\n\n"
    },
    {
      "time": "11 Feb 2008 — 2:33am",
      "content": "I am trying to get a printed sample of Spiral and of Bremer Presse Roman via Interlibrary loan. If successful I will let you know what pattern of use I find.\n\nSzabolcs, extending the bar at the end of a word sounds like something I would try as well. And I might draw it back next to a flat letter. Maybe.\n\n"
    },
    {
      "time": "11 Feb 2008 — 9:25am",
      "content": "I talked to Jerry Kelly today and he filled me in a bit more. He suggested that perhaps:\n\na) the \"e\" in the bremer example may simply be on a different body width, or\n\nb) the \"e\" may be on the 16 pt.\n\nHe was also able to confirm that this Antiqua is the face in question.\n\nHe also mentioned that Wili of the Bremer Presse would explain these things unusual features in his type by referring back to the Gutenburg.\n\n"
    },
    {
      "time": "12 Feb 2008 — 10:12am",
      "content": "Oh, what do I see there? Speaking of alternate e-s and r-s in Bremer Presse: an alternate 'e' in the Georgia font as well! (Its use demonstrated in the name of Gutenberg)\n\n;-)))\n\n"
    },
    {
      "time": "12 Feb 2008 — 1:39pm",
      "content": "Here is a scan of the two \"r\" s in Spiral. This is a photo reproduction not an actual piece of letterpress. It's in “American Proprietary Typefaces”.\n\n ![](http://web.archive.org/web/20150221091455im_/http:/typophile.com/files/2r_3496.jpg)\n\n"
    },
    {
      "time": "22 Feb 2008 — 4:54pm",
      "content": "I got a xeroxed copy of the setting Of Emerson's Nature with Spiral yesterday. Absolutely contrary to what was stated in APT the use of the long \"r\" is exclusively at the end of words. The short r is used inside words. What I am not seeing is the long & short \"r\" used to help justify a line. It's use might be different later but this was it's fist use and I think the full measure of zeal and intention in it's use by Blumenthal is likeliest here. Moreover it works extremely well which is gratifying to me because my theory of contextual shapes ( and scribal tradition ) predicts this use rather than the use suggested by APT.\n\n"
    },
    {
      "time": "23 Feb 2008 — 1:52am",
      "content": "And now a Bremer example. In print, it's actually quite subtle - believe it or not.\n\nI should also note that it's use is not the same as in Blumentahl's Spiral in Emerson's Nature. As you see a long & a short used inside a word. I am wondering now was it line density that determines it's use or the letter shape on the right... or some combination.\n\n ![](http://web.archive.org/web/20150221091455im_/http:/typophile.com/files/long_6348.and.short.r2.jpg)\n\n"
    },
    {
      "time": "25 Feb 2008 — 8:55am",
      "content": "In the last example (eru) the narrower 'r' makes the whitespace less (disturbing) between the seriffed 'u' and itself. In the (ere) you don't have \"too much\" whitespace with the long r-form, because of the shape of the 'e'. If that was understandable.\n\n"
    },
    {
      "time": "25 Feb 2008 — 11:49am",
      "content": "Agreed. And I think that's why with narrower spacing more standard you see the narrower type of r become dominant in the 20th century. Of course if you take this too far the r ends up too narrow and it's saliency is reduced. I have seen some fonts where this is clearly a problem. Also how you space the letters will determine the ideal shape of the arm of the r. Unfortunately there is no script to let the arm shirk or expand with setting. But clearly a wider setting would make a wider arm feel better or more acceptable. Also when you have an r at the end of the word there cannot be too much white space because there is no next letter, and the full sized arm on the r looks and reads the best I think. That is what I think the example of Spiral above shows.\n\n"
    },
    {
      "time": "29 Feb 2008 — 6:01pm",
      "content": "I have just got a copy from the library of the Typography papers from 1997, #2. In it is an article about Bremer Presse. It turns out there is even more alternatives than we knew discussed so far including an s and a t. I will not give a synopsis yet. Moreover you may want to see the article yourself.\n\n"
    },
    {
      "time": "29 Feb 2008 — 6:38pm",
      "content": "I'd entirely forgotten about the essay in _Typography Papers,_ Eben, thanks for reminding me. I have this, but have not looked at it for, well, a decade.\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:37pm",
      "content": "Your welcome!\n\n"
    },
    {
      "time": "1 Mar 2008 — 12:45pm",
      "content": "Yes, very clever. I like the way that diagonals have been driven out of the lower case.  \nBut there is always the problem of T\\_h and W\\_h, which create holes anyway, and these holes stand out even more when everything else is smooshed into greyness.\n\n"
    },
    {
      "time": "10 Mar 2008 — 12:39pm",
      "content": "You are talking about the Bremer type I think. Correct? The example I was looking at until yesterday ( i had to return it) was all in Latin. I did keep wondering what a w or v or k would do to the nice texture. As far as the Th I think they may have had a ligature. I'll check. I imagine they would have used a W with the right side in an arc to maintain the texture... and to maintain the style.\n\n"
    },
    {
      "time": "10 Mar 2008 — 1:43pm",
      "content": "In _Alphabets to Order,_ Alastair Johnston notes that the classic type specimen text (Quousque tandem abutere etc.) was in Latin, without the diagonals, and hence, as he termed it, IIRC, \"prime beef\".\n\nAnother \"cheat\" in the old specimens (and one which I am presently reviving!) was to set justified copy, but without hyphens, and without even breaking words in the correct place, which produces nicely even text.\n\n"
    },
    {
      "time": "10 Mar 2008 — 2:35pm",
      "content": "That makes sense.\n\n"
    },
    {
      "time": "17 Mar 2008 — 9:33am",
      "content": "What do toy think of this? It is supposed to be Circa 1650 or so\n\n ![](http://web.archive.org/web/20150221091455im_/http:/typophile.com/files/tworshapeshighlight_3986.jpg)\n\nIt is plate 19 in \"Catalogue of specimens of printing types by English and Scottish printers and founders, 1665-1830\"\n\n"
    },
    {
      "time": "17 Mar 2008 — 9:43am",
      "content": "A bigger image is here\n\n[http://www.flickr.com/photos/ebensorkin/2340146147/sizes/o/](http://web.archive.org/web/20150221091455/http:/www.flickr.com/photos/ebensorkin/2340146147/sizes/o/ \"http://www.flickr.com/photos/ebensorkin/2340146147/sizes/o/\")\n\nAnd Tiff's comment & mine are here\n\n[http://www.flickr.com/photos/ebensorkin/2340146147/](http://web.archive.org/web/20150221091455/http:/www.flickr.com/photos/ebensorkin/2340146147/ \"http://www.flickr.com/photos/ebensorkin/2340146147/\")\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:55pm",
      "content": "Nick—_Another “cheat” in the old specimens (and one which I am presently reviving!) was to set justified copy, but without hyphens, and without even breaking words in the correct place, which produces nicely even text._\n\nI have to assume that you've never heard of Jost Hochuli or seen the amazing [book of his work.](http://web.archive.org/web/20150221091455/http:/www.youworkforthem.com/product.php?sku=P0026) In this book are examples of type specimens he designed (I think for phototype machines?) using the technique you describe—they are really beautiful. I've [also used it](http://web.archive.org/web/20150221091455/http:/www.klim.co.nz/newzald_samples.php) a few times! It surely is an excellent technique to achieve perfect justification.\n\n(Sorry for the derail, Eben)\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:28pm",
      "content": "No prob dude!\n\n"
    },
    {
      "time": "18 Mar 2008 — 4:22am",
      "content": "Very nice scanned material!  \nThanks for showing it.\n\nIf I wouldn’t be afraid that the world seems to be going to collapse  \nI would have even more fun. :-(\n\nStefan\n\n"
    },
    {
      "time": "18 Mar 2008 — 6:54am",
      "content": "_I have to assume that you’ve never heard of Jost Hochuli_\n\nI read an article about him in _eye_ a few years ago. I don't recall him using that technique.  \nBut you're right, I can't really \\*revive\\* something that's never passed away!  \n(How then is it possible to revive a typeface that has already been revived?)\n\n"
    },
    {
      "time": "18 Mar 2008 — 7:40am",
      "content": "<cite> How then is it possible to revive a typeface that has already been revived? </cite>\n\nGood point. Type terminology is massively arbitrary much of the time.\n\n"
    },
    {
      "time": "22 May 2011 — 11:33am",
      "content": "Get a copy of a book printed at the Bremer Presse, open a page spread and look at it. Turn the whole book 180 degrees, Look again.\n\nOptical spacing, the finest work done by any Press of that time period.\n\n"
    },
    {
      "time": "22 May 2011 — 11:57am",
      "content": "oops. optical justification, not scaling.  \nThe Bremer Presse by design restricted the number of Fonts they used. A Folio page (Bible, Tacitus) could take a day to set, and these were the most skilled typesetters in their Time.  \nThe BP was a private Press in the true sense of the word, as it was not a commercial enterprise, if you look at the Cranach press and how financially draining it was on Kessler, you get an idea about the BP. Fritz Krinitz (Frieda Thiersch und ihre Handbuchbinderei) worked with Frida Thiersch at the BP.\n\n"
    },
    {
      "time": "29 May 2011 — 7:38pm",
      "content": "Thanks very much Ludwig!\n\n"
    }
  ]
}
