{
  "id": "41834",
  "title": "networking or design? what's really important?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I just wanted to get everyones honest opinion on getting a design job. Is it more important to actually know someone in the industry or who works in a company? or do companies judge by looking at portfolios first? I noticed that it's most important to know someone whether it's an instructor, classmate, friend, etc. So if that's the case, why should we have a portfolio in the first place?\n\nAlso, does anyone know how to get any experience when companies say '2-5 years experience' because there's no way any designer will get that experience coming out of design school.\n\n",
  "author": "brockan",
  "time": "7 Feb 2008 — 7:54pm",
  "uid": "26895",
  "comments": [
    {
      "time": "7 Feb 2008 — 8:33pm",
      "content": "This is one of those things that varies a lot depending on where you live and who you want to work for. In a town with more jobs than designers, you can find a good job just by submitting a portfolio in response to a Craigslist ad. But go to one of the cities where prospective designers far outstrip the jobs, and you’d better know somebody. And really great design firms that every kid coming out of school wants to work for might just ignore anybody who isn’t recommended by some third part acting as a scum filter. Of course, the are exceptions to any situation; a great portfolio and persistence might land you a job at a firm that isn’t even hiring to begin with.\n\nThat said, there’s not really any downside to networking. I’ve never walked away from an AIGA function without at least having a good conversation.\n\n"
    },
    {
      "time": "8 Feb 2008 — 12:29am",
      "content": "Knowing people is really a great way to get into an internship, or get your foot in the door for an interview (this is also where coming from an \"established\" art school can help –&nbsp;whatever that means…).\n\nBut these things will not get you the job. That depends on you and your portfolio. They have to want both to make you a permanent offer\n\nOn the whole, for the first job, I'd say that it really is what you can do, not who you know. Your portfolio and abilities will be the biggest help in you getting your first real jobs. But a few years down the line, it will become more and more about who you know. Many of the really great jobs aren't publicly advertised. They just get filled through contacts. So when you are working, it is important to get to know a lot of people outside of your studio or office, maybe join some local design oganizations, etc.\n\nAs for the 2–3 years experience… um, that's a \"for real\" requirement. You've got to build that up somehow. When I was in college, I spent three summers interning with design studios, and I also spent four semesters working as a part-time intern at other design studios. This builds up your time, resume, and portfolio. Plus, it was a lot of fun, and it paid me, too.\n\n"
    },
    {
      "time": "8 Feb 2008 — 6:04am",
      "content": "First gig = great portfolio  \nEvery other gig thereafter = it's who you know\n\n"
    },
    {
      "time": "8 Feb 2008 — 7:27am",
      "content": "\\> Also, does anyone know how to get any experience when companies say ’2-5 years experience’ because there’s no way any designer will get that experience coming out of design school.\n\nSounds like something you read in an ad. Those people don't want someone coming out of design school. They want someon with 2-5 years experience.\n\nPlaces don't advertise for rookies. If you are a rookie, you go to them. Drop off portfolios, resumes, and network all you can. Offer to work for free a day a week at a studio you would like to get into. Be prepared to do mindless jobs like photo copying. Even listing your part time placement at that studio will mean something to a prospective employer (including getting another good reference contact). This assumes that you do a good, diligent job.\n\n"
    },
    {
      "time": "8 Feb 2008 — 7:53am",
      "content": "<cite>First gig = great portfolio<br>\nEvery other gig thereafter = it’s who you know</cite>\n\nActually I'd almost have said the reverse. My first gig came thru a connection, I didn't have a portfolio at all (did not attend design school). I started out making stats and ended up designing books. My portfolio (and to some extent connections) got me my subsequent jobs. I got my dream job at 30 through a cold call. My letter and resume happened to land on the A.D.'s desk just after she learned someone was leaving. Then the A.D. left and I got her job ;-)\n\nIt NEVER hurts to network. Always have your business cards on you. But a design school portfolio is just that. Your portfolio won't be as much help until it has professional work in it (IMHO). I echo what Don said above, do what you can to get a foot in the door and don't expect too much at first. If you're good, you'll move up soon enough.\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:08am",
      "content": "Two more things: try if you can to get the A.D.'s name and send a letter to her/him directly. And educate yourself about the company. Stress that you really want to work THERE. Don't send a form letter (and please run spell check).\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:28am",
      "content": "\"Actually I’d almost have said the reverse.\"\n\nAnd, actually, I'd probably agree.\n\nI guess you need at least one of the two...a great portfolio, or a great network. Either will do. ;o)\n\n"
    },
    {
      "time": "8 Feb 2008 — 8:36am",
      "content": "We hire everyone from Creative Circle. That way they are pre-screened and at least have some software skills. I think a placement agency is a good way to go, you get different experiences and see what the workplace is actually like.\n\nThe hires at my work get accepted on 2 qualifications: portfolio and more important than that, personality. If I have to work closely with someone I need to be able to get along with them. Most portfolios I see are about the same - haven't been knocked out yet.\n\nIf you had the greatest portfolio ever and I didn't think I could get along with you then - no….\n\npbc\n\n"
    }
  ]
}
