{
  "id": "41860",
  "title": "Typeface for identity",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey there,\n\nI’m working on an id for a service co that helps retailers expand. They’d like a high end look..see themselves as “premium, strategic, operational experts, using new approaches to take businesses to new levels.” They’d like to appeal to retailers. possibly show movement or arrow.\n\nSo far I’ve used tarzana wide lowercase (love the a) with star above made using 3 lines, diff shades. a modern look with the movement in the mark rather than the face.\n\nAlso used Mrs. Eaves all uppercase (+ arrow in oval) for classic approach. (is this font outdated?)\n\nfonts that come to mind given the brief would be much appreciated!\n\n(also would love a sans serif suggestion..I have overused engravers gothic but love it. love verlag (also like luxury) but expensive.)\n\nthanks for the help in advance.\n\n [‹ Appropriate use of the ampersand](http://web.archive.org/web/20080423082222/http:/www.typophile.com/node/12426 \"Go to previous forum topic\") [It's been said so many times before. . . ›](http://web.archive.org/web/20080423082222/http:/www.typophile.com/node/41890 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080423082222/http://www.typophile.com/user/17954\" title=\"View user profile.\">cpeace</a>",
  "time": "<br>",
  "uid": "17954",
  "comments": [
    {
      "time": " 8.Feb.2008 11.49am",
      "content": "At this stage, you probably need to be thinking in a more holistic way of a visual identity, rather just a typeface. Once you have some sort of broader brand idea a lot of these decisions - choice of typeface, colour etc. become easier and more focussed.\n\nBtw if you need a typeface that cues luxury, [this](http://web.archive.org/web/20080423082222/http:/www.houseind.com/index.php?page=showfont&id=536&subpage=viewfonts) could be a place to look.\n\n"
    },
    {
      "time": " 8.Feb.2008 5.57pm",
      "content": "thanks for responding (the only one!)  \ndo you have opinion on the faces?\n\n"
    },
    {
      "time": " 8.Feb.2008 11.22pm",
      "content": "“do you have opinion on the faces?”\n\nBoth Tarzana and Mrs Eaves are very expressive typefaces, but they also express very different things (Which was why I thought you’re probably starting at the wrong end).\n\nI don’t know if Mrs Eaves is outdated, I live some distance away from the world of typographic fashion :). But if it’s appropriate for the story you’re trying to tell, that shouldn’t be a concern. With brand identity, it can’t be driven too much by what’s hot this season.\n\n(Btw. You may want to post what you have done so far. People find it easier to respond to a specific piece of work.)\n\n"
    },
    {
      "time": " 9.Feb.2008 5.13am",
      "content": "thanks, I see what you mean. wish I could post..\n\n"
    },
    {
      "time": " 9.Feb.2008 9.32am",
      "content": "Something from the Albertus-Candara-Optima superfamily may hare a nice flare (I only noticed the pun afterwards)\n\n"
    },
    {
      "time": " 9.Feb.2008 9.48am",
      "content": "The key to the luxury look is that you can afford to waste space.  \nThat may be why faces that are markedly condensed or expanded look upscale, because they force one to space them out (copious letterspacing and/or leading) and use them large so that they don’t look crammed or fill in.\n\nFaces with a small x-height, like Mrs Eaves, look upscale because they too are not designed to cram in as much text as possible; book face proportions for a leisurely read.\n\nAlbertus and Optima are elite because they’re not your common or garden sans or serif.\n\n"
    },
    {
      "time": " 9.Feb.2008 11.26am",
      "content": "For some reason, I took high end to mean cutting edge, so I was thinking of adding a recommendation to use something like Clearview because AT&T used it for that purpose so successfully. Maybe I just tunnel-visioned on the word new the mission statement or something. But they look elegant too, so I guess I was either trying to find both or got lucky.\n\nDoes anybody know what was used on [“The Complete Sherlock Holmes Treasury”](http://web.archive.org/web/20080423082222/http:/cgi.ebay.com/THE-COMPLETE-SHERLOCK-HOLMES-TREASURY-1976-MYSTERY_W0QQitemZ160116656490QQcmdZViewItem)? Anything with that must gold must be designed to look elegant! (does anybody know where that vertical line you put between url and text in this site’s content links is on the keyboard? I had to copy-paste it out of the instructions)\n\n"
    },
    {
      "time": " 9.Feb.2008 10.27pm",
      "content": "“Does anybody know what was used on “The Complete Sherlock Holmes Treasury”?”\n\nPossibly some version of Bodoni\n\n”does anybody know where that vertical line you put between url and text in this site’s content links is on the keyboard?..”\n\nIt’s the key to the right of the one with }] and above ’Enter’. In addition to ’vertical line/bar’ it is also called a ’Sheffer stroke’, but more commonly just a ’pipe’.\n\n"
    },
    {
      "time": " 10.Feb.2008 4.09pm",
      "content": "Nick, yes, space is the why I chose the faces (didn’t realize til your comment though)..ty\n\nThanks Scalfin, they would like to be luxury but cutting edge too. “strategic, operational, but definitely premium, premium.”\n\nConcerned that it’s looking like a tech co or oil/gas using sans serif...name is made up so doesn’t elicit any imagery. italic sans serif looks like shampoo/toothpste (+ not using blue/green)..keeping it very simple (colors-grey or brown with mustardy gold) but when use mrs. eaves with simple mark seems to contradict instead of compliment.\n\nall,  \nVEry much appreciate input!!\n\nC\n\n"
    }
  ]
}
