{
  "id": "41865",
  "title": "web -\\> Illustrator; non-latin text",
  "forum": "Build",
  "tags": [

  ],
  "content": "I want to copy and paste text into Illustrator (web/webpage -\\> Illustrator; non-latin text ) and it puts  \neach word backwards.\n\nany idea how to solve it?\n\n [‹ Ligature order](http://web.archive.org/web/20081203203534/http:/www.typophile.com/node/41887 \"Go to previous forum topic\") [Help: understanding dpi (or lpi) of newspapers ›](http://web.archive.org/web/20081203203534/http:/www.typophile.com/node/40448 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203203534/http://www.typophile.com/user/8867\" title=\"View user profile.\">david hamuel</a>",
  "time": "<br>",
  "uid": "8867",
  "comments": [
    {
      "time": " 10.Feb.2008 7.12am",
      "content": "Saying “non-Latin” is like saying “I have a problem with a non-Adobe application”. Cyrillic, Greek, Hebrew, Arabic, Devanagari, Thai, Chinese etc. are all “non-Latin”, but I somehow hardly believe that what you describe is happening for all those writing systems.\n\nPlease be more specific: what language/writing system, what operating system, what browser, what version of Illustrator.\n\nA.\n\n"
    },
    {
      "time": " 10.Feb.2008 9.57am",
      "content": "Thanks Adam.\n\n\\> but I somehow hardly believe that what you describe is happening for all those writing systems.\n\nBelieve it :) almost with all of those writing systems. But at the moment our main concern is Hebrew, Arabic.\n\nThere’s no problem to copy and paste into InDesign ME CS3, Mellel (v.1.9), TextEdit.\n\nIllustrator CS2; Safari, Mac 10.4\n\n"
    },
    {
      "time": " 10.Feb.2008 12.04pm",
      "content": "Don’t you need to use Illustrator ME? Is there an Illustrator ME? I don’t think that you’ll be able to do Right-to-Left text in Illustrator unless you get into ME-ness.\n\nAside from Hebrew and Arabic, lots of non-latin writing systems will do just fine in Illustrator. At least the L to R ones. Not all of them, but a lot of them.\n\n"
    },
    {
      "time": " 11.Feb.2008 4.03am",
      "content": "David,\n\nyou mean, it happens with Cyrillic? Show me.\n\nOf course, Arabic and Hebrew are both bidirectional scripts and Illustrator CS2 does not support bidirectional text, just left-to-right. As with InDesign, you need the Middle Eastern versions of Illustrator and Photoshop if you want this support.\n\nA.\n\n"
    }
  ]
}
