{
  "id": "41886",
  "title": "VECTOR HALFTONES from RASTER Images",
  "forum": "Dan Gayle's blog",
  "tags": [

  ],
  "content": "I posted this link in another thread, but here it is again if anyone is interested. 3 easy methods, via software, to convert a bitmap image into vector artwork that is infinitely scalable.\n\n[VECTOR HALFTONES from RASTER Images](http://web.archive.org/web/20150303172224/http:/www.bittbox.com/illustrator/bb-special-3-ways-vector-halftones-from-raster-images/)\n\n",
  "author": "Dan Gayle",
  "time": "9 Feb 2008 — 11:02am",
  "uid": "12948",
  "comments": [
    {
      "time": "9 Feb 2008 — 11:24am",
      "content": "It's infinitely scalable Dan but usually you don't want to deliver halftones to a printer. That's their job. This is pretty cool on a special effect level though. Bookmarked.\n\nThere's also a way to do this in Photoshop with patterns and blending modes.\n\npbc\n\n"
    },
    {
      "time": "9 Feb 2008 — 11:37am",
      "content": "But it's not a halftone in the typical sense, requiring line screens and all that jazz. The printer is still going to have to separate the images into their own halftone, which I suppose might introduce that wavy effect (can't recall the specific name), but that's still on the RIP end.\n\nBeing able to design a vector graphic at 1/100th size is going to be much smoother than designing a bitmap at 100 feet by whatever for a giant poster, and I'm sure the RIP will appreciate it even more.\n\n"
    },
    {
      "time": "9 Feb 2008 — 12:08pm",
      "content": "Thanks, Dan!\n\n"
    },
    {
      "time": "9 Feb 2008 — 12:41pm",
      "content": "Wonderful link Dan! I licenced Vectoraster. You can even switch the raster dots for any font in your system.\n\n"
    },
    {
      "time": "9 Feb 2008 — 12:56pm",
      "content": "Moire. Very possibly that might happen with these images. Another reason it would be scary to be designing to scale and then have it output much larger - very unpredictable.\n\nTrue about the vector - I wish that was the case but I need photos. My criteria is if I have a choice and the entire background is raster, or the printer requests it, I deliver PS files. They're going to be just as large in an Illy or ID file. They're also going to be just as large no matter what scale you are designing at. PS completely supports vector if you know what kind of file to deliver the type remains sharp, even at 3000 plus points.\n\nIf you make an impossibly complex vector file, then the RIP will reject it, doesn't matter if it's 1\" x 1\". This used to happen all the time to people that had created a selection in PS and made it into a clipping path without knowing what tolerances were allowed in the dialogue.\n\nYou can also have fun with this type of effect in PS by printing with different line screens. You have a lot of control over the shape and frequency in PS (just don't try sending it to a printer) and most laser printers will print anything thrown at them. So I used to  \nprint out photos (my base was 35lpi with a 45 degree angle line), resample them with a scanner and assemble. Fun.\n\nDon't get me wrong - I like this link for special effects…\n\npbc\n\n"
    },
    {
      "time": "9 Feb 2008 — 12:56pm",
      "content": "Just for fun. It can be tweaked.\n\n ![](http://web.archive.org/web/20150303172224im_/http:/typophile.com/files/11_6625.png)\n\n ![](http://web.archive.org/web/20150303172224im_/http:/typophile.com/files/22_5272.png)\n\n"
    },
    {
      "time": "9 Feb 2008 — 12:57pm",
      "content": "@Jos  \nYou can make the dots fonts? That's super cool! I'll have to check it out.\n\n"
    },
    {
      "time": "9 Feb 2008 — 12:58pm",
      "content": "Nice Jos. Done with Vectoraster? No wonder I've been seeing all those ads done this way. BMW Germany did a great series like this.\n\nIt's funny how these techniques get hot.\n\npbc\n\n"
    },
    {
      "time": "9 Feb 2008 — 12:59pm",
      "content": "Indeed :-)\n\n"
    },
    {
      "time": "9 Feb 2008 — 1:19pm",
      "content": "Did you do the BMW work Jos? If so really nice. If not, at least I know how the heck it's done now. :)\n\npbc\n\n"
    },
    {
      "time": "9 Feb 2008 — 1:43pm",
      "content": "LOL ... No Paul. I work for Alfa Romeo and Volkswagen (seriously).\n\n"
    },
    {
      "time": "9 Feb 2008 — 1:46pm",
      "content": "Well I had the country right on one of them.\n\nIn any case purchased - might be just the ticket for this project I'm working on and at $15 certainly worth the price of admission.\n\nMaybe I should read these blogs more often!\n\npbc\n\n"
    },
    {
      "time": "9 Feb 2008 — 1:50pm",
      "content": "<cite>Maybe I should read these blogs more often!</cite>\n\nThat's two of us ;-) I feel lucky today for this nice find.  \nThanks again for the link Dan!\n\n"
    },
    {
      "time": "9 Feb 2008 — 2:14pm",
      "content": "Yeah Dan despite my being an argumentative fellow… :)  \n…thanks a bunch for the links…\n\npbc\n\n"
    },
    {
      "time": "11 Feb 2008 — 4:08am",
      "content": "great post, my congratulations for sharing this, the only thing i dislike is that some things that the software does for you, force you out of your own creativity it is rather abstract and not actually part of the creator, these tools are so powerful that need to be used with caution so as not to disregard your own limits.\n\n"
    }
  ]
}
