{
  "id": "4188",
  "title": "Interview to a Type designer",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi!   \nI'm a bit lost and i would like some help.   \nI was invited to do some questions about type.   \n   \nWhat you think is more relevant to ask to a type designer?   \nOr, if you were reading an interview to a type designer, what questions you would like to see beeing answered?   \n   \nThanks in advance   \n//R.\n\n",
  "author": "ricardo_m",
  "time": "Thu, 2004-04-08 09:01",
  "uid": "1810",
  "comments": [
    {
      "time": " Thu, 2004-04-08 09:03",
      "content": "How he balances personal expression versus what his users want/need.   \n   \nhhp\n\n"
    },
    {
      "time": " Thu, 2004-04-08 10:17",
      "content": "Our fans want to know who we're screwing, who we're wearing, what we're smoking, are those real, how was rehab, they paid you how much? etc., -- topped off with a clip of the upcoming release.\n\n"
    },
    {
      "time": " Thu, 2004-04-08 14:01",
      "content": "Nick: Typophile Cribs?\n\n"
    },
    {
      "time": " Thu, 2004-04-08 14:39",
      "content": "When will clothing companies start sponsoring us? Like they do with skateboarders...   \nNow I'll hit the streets to look for some typefaces to revive...\n\n"
    },
    {
      "time": " Fri, 2004-04-09 08:55",
      "content": "Good point Kenn, What's up Tomas P? Where's my Adobe cap? Yuri? I want my FontLab Coat! Bitstream shoes! AGFA Bling Ring! We need corporate sponsors!   \n   \n:D\n\n"
    },
    {
      "time": " Fri, 2004-04-09 09:07",
      "content": "Yes! I was sponsored once for skateboarding and I think this is a great idea! Hey Fontlab, hook a brother up!!!\n\n"
    },
    {
      "time": " Fri, 2004-04-09 10:43",
      "content": "\\>Where's my Adobe cap?   \n   \nWrong scenario: of the companies mentioned, only Fontlab is not your competitor, and hence a suitable sponsor.   \n   \nIn a realistic scenario, YOU would pay a superstar graphic designer/art director to:   \n\\*Only use Font Diner fonts   \n\\*Wear Font Diner logo on clothing at conferences   \n\\*Appear in ads at Font Diner site, on TV, billboards, etc.   \n\\*Collaborate on celeb-named custom typeface/package   \n   \nHey Armin -- money for nothing and your fonts for free!\n\n"
    },
    {
      "time": " Fri, 2004-04-09 10:53",
      "content": "Do you mean like this:   \n [http://www.performaxhockey.com/images/P22Icy.JPG](http://web.archive.org/web/20050516143117/http:/www.performaxhockey.com/images/P22Icy.JPG)\n\n"
    },
    {
      "time": " Fri, 2004-04-09 11:20",
      "content": "Our new advertising campaign   \n   \n ![](http://web.archive.org/web/20050516143117im_/http:/www.typophile.com/forums/messages/30/33020.gif)\n\n"
    },
    {
      "time": " Fri, 2004-04-09 20:57",
      "content": "ew\n\n"
    },
    {
      "time": " Fri, 2004-04-09 23:06",
      "content": "Nick, companies would sponsor type-designers because then all the kids who'd really, really want to be like the super cool type designers they admire would buy their stuff. Our sponsors wouldn't necessarily be directly type-related, Apple would a good one. Or a brewery. (Please!)   \n   \nI'd hate being David Hasselhoff's jacket or shirt or whatever that shiny thing is.   \n   \nBut somehow we're not really helping Ricardo: There are the obvious questions like how the designers approaches a new design, which other designers inspires him/her and all that.   \nIt all depends on who the article is for, is it for people who'd never thought about the fact that typefaces are designed or for designers?   \nYou could always ask them who'd they like to sponsor them...\n\n"
    },
    {
      "time": " Sat, 2004-04-10 07:34",
      "content": "Ok, how about...   \n   \n   \nHow did you first become interested in type?   \n   \nWho has influenced your work?   \n   \nHow do you develop type, how long does a face take to develop, do you develop it alone or do you get feedback and advice?   \n   \nDo you develop type for yourself or for other people?   \n   \nWhy do you develop typefaces, are there not enough of them? isn't Helvetica perfect for every design anyway?   \n   \nWhat is the best face you have developed? Why?   \n   \nHas your interest in developing typefaces helped you in other area's of design?   \n   \nCan you actually make a living from being a type designer?   \n   \nWhat advice do you have for anyone thinking of getting in to type design?   \n   \nDo you feel your work is influenced by your location (local influences v international)   \n   \nJust a few idea's   \n   \nJIM   \n===\n\n"
    },
    {
      "time": " Sat, 2004-04-10 08:46",
      "content": "i did interview Mr Porchez and i guess, to find questions, you have to study the guy and his work. Out of the good questions Mr Richardson or Hrant gave, specific questions about different aspects of his life and typefaces are interesting.   \nI think for any people interviewed, if he understand, by the questions and attitude, that you know his work, or his person, it's far easier to do; with quite an intimate approach.\n\n"
    },
    {
      "time": " Sat, 2004-04-10 09:13",
      "content": "No really, I was making a serious point.   \nTry the Tarantino test:   \nIf you'd feel uncomfortable asking \"Quentin, don't we have enough movies already?\" or \"Quentin, can you actually make a living being a film director?\" then you probably shouldn't ask a type designer that kind of question.\n\n"
    },
    {
      "time": " Sat, 2004-04-10 11:55",
      "content": "I asked Max Kisman 'do we really need another Helvetica clone' and his answer was 'I guess it's like the Beatles, everyone wants to cover one of there songs'.   \n   \nI felt that was a really good way of putting it...   \n   \n- Ricardo, maybe looking at existing interviews could give you some good idea's.\n\n"
    },
    {
      "time": " Sun, 2004-04-11 07:07",
      "content": "Found this:   \n [http://www.philsfonts.com/wit/peterbilak.html](http://web.archive.org/web/20050516143117/http:/www.philsfonts.com/wit/peterbilak.html)   \n   \ngot more?   \n   \nThanks!\n\n"
    },
    {
      "time": " Sun, 2004-04-11 11:09",
      "content": "Rudy VanderLans   \n   \n [http://www.emigre.com/VanderLans.php](http://web.archive.org/web/20050516143117/http:/www.emigre.com/VanderLans.php)   \n   \nMax Kisman :   \n   \n [http://www.typotheque.com/articles/max\\_kisman.html](http://web.archive.org/web/20050516143117/http:/www.typotheque.com/articles/max_kisman.html)   \n   \nJohn Downer and Jim Parkinson :   \n   \n [http://www.philsfonts.com/wit/pd\\_howtheydowhattheydo.html](http://web.archive.org/web/20050516143117/http:/www.philsfonts.com/wit/pd_howtheydowhattheydo.html)\n\n"
    },
    {
      "time": " Sun, 2004-04-11 16:57",
      "content": "Hrant scripsit: _How he balances personal expression versus what his users want/need._   \n   \nPerhaps this should be a separate thread, since this probably isn't going to help Ricardo very much, but here goes...   \n   \nI'm bothered by this dichotomy that you keep trying to assert, Hrant, between expression (elsewhere explicitly associated with individual, artistic expression; usually in reference to type designers as 'artistes') and a kind of functionalism focused on readability. I'm bothered because the whole notion that art = expression is a modern, debased romaniticism. I say debased, because it is the romanticism of _Drawing on the right side of the brain_: a kind of fantasy of democratic creativity that is measured solely by quantity of expression of self. This is a view of art that is singularly useless for any kind of cultural dialogue, which explains why your dichotomy is unanswerable. 'Expression' is a straw man, especially since the modernism which you otherwise claim to despise propagandises functionalism against romantic expression. [Note that I think the modernist view of functionalism is itself inherently romantic, i.e. fantastical. As C.S. Lewis wrote of literature: '...the canon of 'functionalism' has disabled literature for half its functions.' I think much the same can be said of your obsessions regarding readability: by making this the sine qua non of type design -- despite the very obvious evidence that readability is the simplest function of typography to achieve -- you diminish the total functionality of type.] Who will step forward to defend expression against the user's 'needs'? Not I, nor, I suspect, anyone else.   \n   \nBut someone might step forward to defend another view of art: an older and more sophisticated view in which the individual expression exists as an unavoidable byproduct of the process of making. So, Persian miniature painters equated individual style with a flaw: the error that reveals the hand. This is an extreme view, but something not dissimilar is found in Orthodox icon writing, and even in the Western tradition prior to Romanticism. It is a view expressed in the statement 'The art is more important than the artist', i.e. that what matters is the creative integrity of what is made, not the creative expression of the maker. This is very much the spirit in which I approach type design, and in which the popular romantic distinction of art from craft is meaningless (as it was in the Middle Ages). This is not to say that there is no individual expression in my type design, but that it exists there only by default of the fact that I, and not another person, am the person struggling to make a particular thing. The particularity of the made thing determines its characteristics much more than the personality of the maker, which must sometimes be actively supressed in order to achieve integrity. I might like a particular form of a letter, or part of a letter, but the only thing that matters in the making of a typeface is whether that form is appropriate to the whole. The whole is defined by a particular balance of many things: functional, aesthetic, cultural and, yes, personal, which must be in some kind of balance -- and there are many ways to balance them -- if the whole is to be integrated.   \n   \n   \n[Note: the above is the first time I've tried to put some of these thoughts into words, so I don't claim it is a really solid expression. Also, these are nor theoretical ideas, i.e. they do not intellectually precede the work; rather, they are an attempt to define, exterior to the work, what the work itself expresses. This is remarkably difficult.]\n\n"
    },
    {
      "time": " Sun, 2004-04-11 17:11",
      "content": "The dichotomy is very real, but it's not really expression versus readability. To me the dichotomy of the self versus society is the single most important thing about being human. And in a craft such as type design (versus an art such as tableau painting), one has to worry more about the wants and needs of _users_, and this is certainly not limited to readability.   \n   \n\\> modernism which you otherwise claim to despise propagandises   \n\\> functionalism against romantic expression.   \n   \nAnd Americans claim they're helping the Iraqis. I'm a lot less interested in what modernism pretends (or even thinks) it's doing, versus the effect it has on the ground (for example reducing cultural authenticity and variety). BTW, I don't \"despise\" modernism - more than anything I pity it.   \n   \n\\> an older and more sophisticated view   \n   \nYou're simply talking about the reality that neither art nor craft exist in a pure state - for example that even a tableau painter can often have a paying client who has certain wants of his own. This in fact fits in perfectly with the dichotomy above.   \n   \nAnd when you make a typeface, you neither can banish expression nor do you want to - but you also don't want to apply expression for its own sake, to seek a means of \"venting\" - that's Art. So it reverts again to the most important thing: _intentions_, not results.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-04-11 18:04",
      "content": "Hrant, never mind. Sorry I brought it up. It's clear from your response that we're either operating on completely different wave lengths or that you are more interested in what you think I wrote than what I actually wrote.\n\n"
    },
    {
      "time": " Sun, 2004-04-11 18:27",
      "content": "Hrant,   \n\"And Americans claim they're helping the Iraqis.\"   \nDon't assume all or even most Americans believe this or even condone the actions of their president. Just like the hypocracy of the Viet Nam conflict before it, there is no shortage of differences of opinion on this (or any) subject in America.   \n   \nOnly SOME \"Americans claim they're helping the Iraqis.\"   \nOnly SOME Arabs are terrorists;   \nOnly SOME Germans were Nazis;   \nand sadly, only SOME people stop to help strangers in need.   \n   \nThere is an equivalent distribution of good, evil, stupidity, intelligence, and humanitarianism and greed among all peoples of the world. We all have to strive to clean up our acts and avoid the all-too-easy to blame \"them\" of the world. Prejudice is too deepa hole to fall into yet too easy to rationalize.   \n   \nMy appologies to everyone. I am very sorry, this will be my last \"non-typographic\" post.   \n   \nChris\n\n"
    },
    {
      "time": " Sun, 2004-04-11 18:34",
      "content": "I think I understand your \"wavelength\" well enough. You generally do a great job expressing yourself, and I (immodestly) think that I do a great job of extracting both literal as well the \"behind-the-scenes\" insight from anything I ever read.   \n   \nBut I simply don't agree that compartmentalizing and categorizing is a wise way of looking at things. Specifically, I don't think your particular separation of Art and Craft is \"real\" - I think you need to look at things in the form of extremes that don't exist, with a continuum between them representing things that do exist (like a font), and furthermore see the two extremes are equally relevant to life.   \n   \nInstead of reverting to your classic \"Hrant never listens\" escapism, try an once of self-doubt for a change. It might undermine your religion, but it might also give your spirit wings.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-04-11 18:40",
      "content": "Chris, of course you're right. I was speaking of the \"aggregate\" outlook of the US population. And it's not due to stupidity or any clear character failing, it's due to the System. Who is responsible for the System? That's a very complex question. But instead of worrying about placing blame, let's just work on the future instead. Action Step #1: stop voting. Full elaboration in my Thursday, March 18, 2004, 3:19 pm post here:   \n [http://www.typophile.com/forums/messages/30/28515.html](http://web.archive.org/web/20050516143117/http:/www.typophile.com/forums/messages/30/28515.html)   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-04-11 19:07",
      "content": "BTW, since this is about interviews, I think I have a really good example of the Art-versus-Craft business (and it's something I've actually mentioned before). On Peter Bilak's site there's an interview with Martin Majoor. One of the most notable things in that interview is where Majoor was asked why he made an \"upright italic\" for Seria. His answer was that \"he always wanted to make one\"\\*. To me this sort of expressive desire is exactly what a craftsman needs to suppress, at least in a face intended for general use.   \n   \n\\* Undoubtedly because he's from the chirography school, and they like to believe that cursiveness is a very important structural attribute.   \n   \nBTW, there are many more interviews over there:   \n [http://www.typotheque.com/articles/interviews.html](http://web.archive.org/web/20050516143117/http:/www.typotheque.com/articles/interviews.html)   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-04-11 19:15",
      "content": "Pardon me, I just realized: It's not in that interview where Majoor says that about Seria's italic - it's in his recent article in tipoGrafica magazine. In Bilak's interview however he does point out that he doesn't tailor a font depending on different languages it might be used for, which makes me think that's another facet of the same problem: thinking that the creation of a font is its own self-contained, somewhat abstract, \"artistic\" effort, as opposed to something actually driven by user needs. And possibly the lack of traps in his Telefont is yet another instance.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-04-11 22:54",
      "content": "Hrant, I spent a long time carefully trying to put into words my approach to the making of type, in order to demonstrate that your dichotomy of artistic expression vs. user needs is inadequate and based on presuppositions on the nature of art. You respond by telling me that I am 'simply talking about the reality that neither art nor craft exist in a pure state', and go on to restate the same presupposition on the nature of Art, this time capitalising it to reinforce your point. You do this despite the fact that I was not 'simply' stating anything: I was trying to get at something that is anything but simple, and I certainly wasn't saying what you think I was saying. You are so focused on the relationship of 'self versus society', that you completely miss what I spent a long paragraph discussing, which is the relationship of maker to thing made: that what matters most is neither the demands of the individual nor of society, but the demands of the thing itself, which define its integrity. Instead, you come back and criticise my 'particular separation of Art and Craft' when I explicitly said that my approach made no such separation; whereas you have frequently and loudly made a separation between craft (good) and Art (bad) in type design. You then go on to make the delusional claim that you 'do a great job of extracting both literal as well the \"behind-the-scenes\" insight' from everything that you read. On the contrary, I have frequently had to point out your willful incomprehension, noting the irony that someone so obsessed with the lower level cognitive processes of reading should be so poor at the higher level comprehensive processes of understanding. I strongly suspect that your commitment to always finding a 'behind-the-scenes' insight in what you read actually prevents you from comprehending plain statements: you always believe that people are saying what you imagine them to be saying, regardless of what they actually say. I think you are in this respect quite mad. Communication is only possible in the context of shared meaning: if you are always second-guessing everything that I write, you can't blame me for getting frustrated and giving up. You only want to have a conversation with yourself, and I'm tired of having my words misinterpreted in order to furnish content for that conversation, especially when, as today, I have spent a long time struggling to to find those words. Finally, of course, you are incapable of ending your response without a characteristic personal insult, in which my objection to your very obvious failure to grasp what I have written about -- obvious because nowhere in your response do you allude once to that relationship that is central to my thesis -- is characterised as escapism. Then I am challenged to 'try an once of self-doubt for a change'. This from a man who claims insight bordering on omniscience: to be able to extract both literal and 'behind-the-scenes' meaning from _anything_ that he reads. Sir, where is _your_ self doubt? And this after I have postscripted my thoughts with the acknowledgement that they are not a really solid expression, and represent the first steps in trying to put into words the largely intuitive principle under which I go about making type.\n\n"
    },
    {
      "time": " Sun, 2004-04-11 22:58",
      "content": "John, it's not just an antiquated holistic notion you have. Susan Sontag argued \"Against Interpretation,\" and very recently Libby Lumpkin, in \"The Redemption of Practice\" (An essay in her book \"Deep Design\") put it this way:   \n   \n\"The critical theories ... formulated between the late 1960s and early 1980s in empathy with the conceptualist styles that inspired them, are useless when addressing works that radically blur the distinction between materiality and thought.\"   \n   \nThese are art critics; but nowhere are materiality and thought more intertwined than in typography, which fails if they become distinct.\n\n"
    },
    {
      "time": " Sun, 2004-04-11 23:26",
      "content": "John, first of all, please don't once again revert to whining about being insulted. Your \"you are more interested in what you think I wrote\" is no less an insult than anything else - but I don't mind. Just focus on the discussion (even if others don't), and everybody will be happier.   \n   \n\\> what matters most is neither the demands of the individual   \n\\> nor of society, but the demands of the thing itself   \n   \nNo such \"demands\" exist - the primacy of abstraction is a classic Western fallacy, one that I in fact pointed to in a pevious post, but you choose to ignore - probably because it negates your ordered little universe, which is missing a key human ingredient: _doubt_. \"Demands\" only matter in the context of physical human reality, not some mind-titillating pseudo-religious illusion.   \n   \n--   \n   \nJohn, you need to stop obsessing about countering every single thing I say. There's no other good explanation for the constant attention you pay to anything I happen to utter. I'm _sure_ there are other people posting things you don't agree with, but they don't seem to get nearly as much attention... I know you hate my constant referral to serious flaws in your cherished culture and script, but you need to reclaim the necessary objectivity, the self-control, so you can stop wasting time hunting me down. It's really not worth it.   \n   \nhhp\n\n"
    },
    {
      "time": " Mon, 2004-04-12 10:00",
      "content": "Hrant, I engage you in discussion because you make unfounded claims in public fora, and I'm enough of a believer in the necessity of public discourse to call you on these. In the case of this thread, I responded because you prompted me to think about why the dichotomy you propose doesn't make sense and why, in particular, it doesn't apply to the way I work. I'm now coming to the conclusion that you are not interested in public discourse, but only in the sound of your own voice. Whatever anyone else says to you gets translated into that sound and played back distorted. I have corrected your interpretation of my ideas and the ideas of others many times. Numerous people better informed than either of us have corrected your misconceptions about e.g. Noordzij's ideas. And yet you persist in the same misinterpretations and misconceptions, without even bothering to engage with the objections or counter their points. This is either stupidity or willful refusal to accept any external voices.   \n   \nNow, when I talk about the demands of a _thing_ -- a fully material thing: a typeface -- you think I'm talking about abstraction. Then, after I have explicitly indicated doubt about the ideas I have put forward -- about their tentativeness and the problems of their relationship to practice --, you repeat this bizarre refrain that I lack doubt. Again, you are operating solely within your imagination, and not engaging at all with the content of what I write. And you have the nerve to suggest that I 'focus on the discussion'. There is no discussion! I spent a long time carefully phrasing discussion, and all I got back from you is misreading, avoidance and insults that have absolutely nothing to do with what I wrote.   \n   \nNick at least seems to understand what I'm getting at.\n\n"
    },
    {
      "time": " Mon, 2004-04-12 10:09",
      "content": "This has become so bizarre, that I had to go back and carefully re-read what I wrote in my first long message. There really isn't anything in it, Hrant, to which your response makes any sense: there is no 'compartmentalizing and categorizing', there is no 'separation of Art and Craft', there is no 'abstraction'. You are the one talking in abstractions -- self vs society --: I am talking about a person in the act of making something. I can't think of anything less abstract.\n\n"
    },
    {
      "time": " Mon, 2004-04-12 14:58",
      "content": "Hrant,   \n\\<Action Step #1: stop voting. Full elaboration in my Thursday, March 18, 2004, 3:19 pm post here:   \n [http://www.typophile.com/forums/messages/30/28515.html](http://web.archive.org/web/20050516143117/http:/www.typophile.com/forums/messages/30/28515.html) \\>   \n   \nI much prefer Plato's Philosopher King. Then again decadence strikes every system. We all march relentlessly towards entropy. There is no \"System.\" There is only a steady progression towards the ultimate order of total randomness which will then quickly begin the next singularity and its explosion to once again seek entropy.   \n:-)   \n   \n\"Entropy\"! Now that is a great name for a typeface--perhaps a multiple Master with an infinite number of axis. Perhaps it is the ultimate Grunge face--the letterforms would degrade as you typed until you had an even yet unordered spread of glyph fragments all over your page. That would be a feast for any PostScript RIP.   \n   \nSo, we have made the journey back to the singularity of typography--and they said you cannot escape a black (w)hole.   \n   \nChris\n\n"
    }
  ]
}
