{
  "id": "41893",
  "title": "Why, oh why?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The following are some of the banes of my existence.\n\nWhy isn’t [DTL Elzevir](http://web.archive.org/web/20131019130852/http:/www.dutchtypelibrary.nl/Elevir_rdrct.html), or [Fleischmann,](http://web.archive.org/web/20131019130852/http:/www.dutchtypelibrary.nl/Fleischmann_rdrct.html) available in OpenType? (Or at a feasible dollar price?) And why isn’t the Font Bureau’s [Miller](http://web.archive.org/web/20131019130852/http:/www.fontbureau.com/fonts/Miller/charset) available in OpenType? Didn’t most foundries get their big sellers into OpenType several years ago?\n\nAnd Linotype: Why is your [Baskerville](http://web.archive.org/web/20131019130852/http:/www.linotype.com/43290/baskervilleregular-font.html) only available in your own unimpressive “Com” version of OpenType, which lacks all typographical features? Why is your [Monticello](http://web.archive.org/web/20131019130852/http:/www.linotype.com/56016/monticelloroman-font.html) not available in OpenType at all (and why is there no OpenType Pro version of your [Times](http://web.archive.org/web/20131019130852/http:/www.linotype.com/13450/timesroman-font.html) and [Times Ten](http://web.archive.org/web/20131019130852/http:/www.linotype.com/12767/timestenroman-font.html))?\n\nWhy can’t you reissue the essential-but-tragically-spindly [New Caledonia](http://web.archive.org/web/20131019130852/http:/www.linotype.com/12775/newcaledoniaroman-font.html), or even [Granjon](http://web.archive.org/web/20131019130852/http:/www.linotype.com/13277/granjonroman-font.html), in proper new digitizations, as Monotype did with Bembo ( [Bembo Book](http://web.archive.org/web/20131019130852/http:/www.fonts.com/findfonts/detail.htm?pid=420694&grab_id=0&page_id=30123&query=bembo%20book&SCOPE=Fonts))?\n\nWhen will [Williams Caslon](http://web.archive.org/web/20131019130852/http:/www.typophile.com/node/20893) be released?\n\nAnd hey there, Mark von Bronkhorst: What’s up with not making [Verdigris](http://web.archive.org/web/20131019130852/http:/www.mvbfonts.com/html/fonts/verdigris/pk_verdigris.htm) available in OpenType?\n\nFinally, hello there, Mac OS X Leopard font people responsible for [fouling up the Typography panel](http://web.archive.org/web/20131019130852/http:/www.typophile.com/node/37122) in Pages and other applications that use Core Text—how could you in good conscience release a supposedly finished product that generally fails to work at all, and breaks behavior from the previous OS release, with no detectible gain to the user? Then leave it on sale for months without an update? Do you really use Leopard yourselves?\n\nThis concludeth my rant. Thanks for letting me get that off my chest!\n\n",
  "author": "peter.ricardo",
  "time": "9 Feb 2008 — 9:28pm",
  "uid": "26962",
  "comments": [
    {
      "time": "10 Feb 2008 — 4:08am",
      "content": "Hi Peter,\n\nwelcome to typophile.\n\n<cite>And why isn’t the Font Bureau’s Miller available in OpenType? Didn’t most foundries get their big sellers into OpenType several years ago?</cite>\n\nWho claims Miller isn’t available in OT? MyFonts? At least you can specify OT at [Font Bureau’s website](http://web.archive.org/web/20131019130852/http:/www.fontbureau.com/fonts/Miller).\n\nAnd for DTL: Yeah, that’s a pity. Then again, DTL isn’t a big foundry, so there are likely no big sellers.  \nDemand determines supply. There’s no conspiracy going on.\n\n<cite>And Linotype: Why is your Baskerville only available in your own unimpressive “Com” version of OpenType, which lacks all typographical features?</cite>\n\nUnimpressive to you, American sucker for ligatures and easy fractions! ;°) Language support is a major typographical feature, too!\n\nWhat do you think of [New Baskerville](http://web.archive.org/web/20131019130852/http:/www.linotype.com/749/itcnewbaskerville-family.html)? Or Storm’s [Baskerville Original](http://web.archive.org/web/20131019130852/http:/www.stormtype.com/typefaces-fonts-shop/families-22-baskerville-original)? They offer small caps and stuff.\n\n<cite>as Monotype did with Bembo Book</cite>  \nYeah, but also available only since less than 3 years. Going Open Type is not just pressing some conversion button, is it?\n\nThat said, I understand your huff. The lack of standards is confusing and time consuming. But one has to bear in mind that fonts don’t fall from the sky; they still have to be made by people – with limited time, and a certain focus.\n\n"
    },
    {
      "time": "10 Feb 2008 — 8:30am",
      "content": "Hi Florian,\n\nThis was a product of late-night frustration! Thanks for listening.\n\nWith Miller and OpenType, you're right that I was generalizing from the other font resellers' pages: on their own site, there OpenType is as an option, at checkout. But since Font Bureau charges the same price for their OpenType version as for their TrueType and PostScript versions of Miller, and still segregate out special small caps and old-style figures fonts from the other packages, just as in PostScript, I am guessing that in this case 'OpenType' offers no more features than the TrueType version that is resold on, e.g., FontShop.\n\nMy deep love of OpenType (and especially OpenType Pro!) is, indeed, based on the raw pleasure of gaining easy access to small capitals, to both kinds of figures, and (if needed) to triple ligatures, with the easy ability to change between families altogether while retaining those settings. I wish Miller would join this revolution, since I adore the typeface.\n\nIf DTL hired a new web designer--their site at present seems to me an unnecessarily confusing and even ugly experience--and thought a little about the joys of selling lots of copies of its fonts at slightly lower prices, instead of selling a very few copies at higher ones, it would be a different world for them and for all the rest of us. Or if they would even let resellers offer their fonts for sale (or so much as reproduce images of them!) DTL seems sort of mixed up about the point of offering fonts for sale, which might be more to get people to use and benefit from them than to disappoint eager would-be purchasers.\n\nApropos of Linotype Baskerville: I know that language support is a major feature, it's just that I find it maddening and inexplicable that the best major-foundry Baskerville is still in such a limited format (even compared to most other offerings from Linotype).\n\nI have had Storm's John Baskerville for several years, and I am probably in a tiny, tasteless minority, but I actually find it awkward and almost inexpertly drawn, with noticeably strange spacing. The individual letter forms are appealingly swooshy and free, but the overall effect of a page set in John Baskerville is, for me, almost shudder-inducing. I am thinking of getting his Baskerville Ten in the hope it will be much better, though it probably won't (dating as it does to the same early year of his career).\n\nITC New Baskerville is fine. I just wish it were less sparkly and 'digital' looking.\n\nAnyway, hopefully in time some of the people involved will pick up distant rumbles from the venting of frustration in venues like this one, and some fine day we'll all inhabit a Shining World of OpenType!\n\nThanks again for listening.\n\n"
    },
    {
      "time": "11 Feb 2008 — 5:11am",
      "content": "_...My deep love of OpenType (and especially OpenType Pro!) is, indeed, based on the raw pleasure of gaining easy access to small capitals..._\n\nCertainly. From a type user's perspective, built-in smallcaps are a boon. But for type developers built-in smallcaps create a requirement for a complete second set of kerning values, as smallcap forms fit together rather differently to the way lower case forms fit together. It can be done but it's a pain in the rear end. It's a lot simpler and easier to make a separate smallcaps font.\n\nIf you're really sure of what DTL are doing wrong, put that into an email and send it to them. They'll just love being told by a disgruntled would-be customer how they should run their business.\n\n_I have had Storm’s John Baskerville for several years, and I am probably in a tiny, tasteless minority, but I actually find it awkward and almost inexpertly drawn, with noticeably strange spacing. The individual letter forms are appealingly swooshy and free, but the overall effect of a page set in John Baskerville is, for me, almost shudder-inducing. I am thinking of getting his Baskerville Ten in the hope it will be much better, though it probably won’t (dating as it does to the same early year of his career)._\n\nI think Storm's John Baskerville is meant to be that way. The faults you refer to are features, not bugs. Storm did his research on that one. It's authentic.\n\nOne of the bugbears I have with the so-called \"digital media revolution\" is the way it breeds uncompromising demand in users. If a digital product (software of one kind or another, whether it be a font or a proggie) does not perform exactly as the user imagines it should, and if it does not do everything perfectly and solve all former problems, and make toast and coffee for them as well --- oh dear no! That's just not on, is it? How terrible. How disappointing. What a letdown, to buy a software product only to find it doesn't work the way you imagined it ought to.\n\n_Anyway, hopefully in time some of the people involved will pick up distant rumbles from the venting of frustration in venues like this one, and some fine day we’ll all inhabit a Shining World of OpenType!_\n\nYou wish. Don't dream it. Take it to the man (or woman) directly. They can't read your mind, and in the unlikely event they do pick up distant rumblings, they probably don't care. Not about one person's gripings. They've got much, much more pressing things to occupy them. You'd need a tidal wave of negative opinion regarding their font products to occur to get any action.\n\nj a m e s\n\n"
    },
    {
      "time": "12 Feb 2008 — 9:59pm",
      "content": "Hi James,\n\nThanks for these thoughts. . . . When you say it would be good to advise DTL directly about the problems I see with their web site, pricing, and decisions on formats that might be keeping me and other potential customers from buying more of their fonts, is that the straight skinny, or sarcastic? Honestly unsure, though leaning toward the latter.\n\nAnyway, I wouldn't blame the rise of digital media for making me demanding. I would just blame me!\n\nEven when I am in better humor than when writing the above, I am confident that any foundry that doesn't move to fully OpenType now, is going to fervently wish it had within two or three years. It just makes too much sense. Not fully supporting OpenType will become the way not owning a mobile phone has gotten to be. At first reasonable people could opt out, but because of network effects at a certain point it became indispensable, and there was a sudden, unstoppable rise in adoption.\n\nI know the thing with Storm's John Baskerville's is that it is supposed to be extremely authentic, but to my eye it doesn't look noticeably more like Baskerville's original types—you can view plenty of them yourself, without going to abandoned castle libraries, at Gale Group's Eighteenth Century Collections Online (ECCO)—than Linotype Baskerville. Type set by John Baskerville looks beautiful to my eye, and Storm's doesn't. (E.g., type the word \"The,\" with a capital T, in italics in Storm's John Baskerville.) So I may stick by my opinion that its appearance is more bug than feature, albeit without asking you to share it. Aesthetic judgments are hard to dispute about.\n\nAnd yes, from the user's point of view—by the way, since I think fonts are self-evidently made and sold for users to buy (at least by developers who want to support themselves with what they do), I am not sure I share your implicit opinion that the user's point of view is just one of two, equally important ones, along with that of developers (who, yes, have to expend extra effort to offer new features—in what area of human activity is that not true?)—from the user's point of view, it \\*is\\* disappointing to pay for and download a font, and then to find that it doesn't work the way you thought it would when you bought it.\n\nAnyway, I'll be happy to contact Linotype directly, but I don't know who to write or who would listen to me there. If you do, that would be fantastic.\n\n"
    },
    {
      "time": "13 Feb 2008 — 5:24am",
      "content": "<cite>Even when I am in better humor than when writing the above, I am confident that any foundry that doesn’t move to fully OpenType now, is going to fervently wish it had within two or three years. It just makes too much sense.</cite>\n\nNot a valid argument, I think. Note that a lot of the early OT-re-releases didn’t incorporate extra features, just the original character set with an Expert set thrown in.  \nDeveloping a fully featured OT means adding a lot of extra glyphs and doing some serious programming. That takes time, costs money and thus has to be economically feasible.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "21 Feb 2008 — 12:45pm",
      "content": "Hi Peter,  \napologies for the long delay getting back to this thread. I've been ill for the past week.\n\n_When you say it would be good to advise DTL directly about the problems I see with their web site, pricing, and decisions on formats that might be keeping me and other potential customers from buying more of their fonts, is that the straight skinny, or sarcastic? Honestly unsure, though leaning toward the latter._\n\nThat was the straight skinny, but I worded it sarcastically. If you have serious suggestions for them it wouldn't be unreasonable to send them your thoughts as long as you're very nice about it. Be very polite and explain first that it's nothing more than honest feedback, and with all respect for their ideas and existing vendor model and so on.\n\n_Even when I am in better humor than when writing the above, I am confident that any foundry that doesn’t move to fully OpenType now, is going to fervently wish it had within two or three years. It just makes too much sense. Not fully supporting OpenType will become the way not owning a mobile phone has gotten to be. At first reasonable people could opt out, but because of network effects at a certain point it became indispensable, and there was a sudden, unstoppable rise in adoption._\n\nYou're talking about \"competitive advantage\" regarding OpenType. Yes sir. It's safe to say the majority of type developers have already gone down the OpenType road, and it's hard to see how those remaining on the TrueType route can go on competing in the commercial sense. TrueType is already looking like a dirt track, unpaved and rutted, laden with pot holes and increasingly tiresome to travel for users and developers both.\n\nMonsoon. More soon...\n\nj a m e s\n\n"
    },
    {
      "time": "21 Feb 2008 — 6:13pm",
      "content": "<cite>I am confident that any foundry that doesn’t move to fully OpenType now, is going to fervently wish it had within two or three years</cite>  \nThat argument doesn't always fly with every foundry. You used the Font Bureau's Miller as an example, but at least THAT company will still be providing non-ot fonts for a long time.\n\nTheir clientèle is made up in large part of major newspapers around the world using non-opentype savvy applications, and those behemoth programs won't be going away any time soon because they are $$$$. Miller just so happens to be a well-used newspaper font that fits exactly into that category.\n\n"
    },
    {
      "time": "21 Feb 2008 — 11:55pm",
      "content": "Hi James et al.\n\nThanks for the interesting comments! I hadn't really thought about newspapers, and their legacy applications, at all—I wonder what proportion of the business of the average foundry (if there is such a thing) comes from which categories of users? Knowing that might explain a lot.\n\nApparently MVB is in fact working on an OpenType Verdigris, which is great to know. And if anyone knows who to nag at Linotype about their Baskerville, please share!\n\nI don't completely get why the continuing existence of a market for the divvied-up TrueType versions of Miller would inhibit the Font Bureau from simply combining some of them into a nice OpenType version that includes small caps, but I guess success leads to a lessened sense of urgency, and it must be a fantastic seller for them still.\n\nFinally, I'm sort of hoping someone else will bite on my comments about Storm's John Baskerville! I was so disappointed when I started using it, and wondered whether I was alone in this. But it is just a matter of opinion, like all such things, I know. And in some respects (especially certain italic capital letters) he is certainly very faithful to the ‘original.’ It's just that the overall effect strikes me as off.\n\nIt amazes me that 10.5.2 (released in the days since the original rant) apparently did nothing to fix the Typography palette in Mac OS X. Anyway, I am about to be freed from Leopard—I've been using an Apple Store loaner with Leopard installed on it while my PowerBook was repaired, but my PowerBook is all fixed and ready to pick up again. There's no way I am ‘upgrading’ that puppy from 10.4.11, after two nightmarish weeks on 10.5. I've never badmouthed any Apple computer or OS version before—at least not in the past decade (and I never owned an Apple III)—but there's a first time for everything. With Leopard it feels as if Apple has had some sort of collective corporate stroke, and lost both its taste and its quality control department simultaneously.\n\n"
    },
    {
      "time": "22 Feb 2008 — 12:51am",
      "content": "Although I haven't used it, I'm not too impressed with Storm's Baskerville. It always comes down to Storm's lower case a. Most of them in his designs just appear hideous to my eyes, and it totally ruins a typeface for me.\n\n"
    },
    {
      "time": "22 Feb 2008 — 1:11am",
      "content": "_And if anyone knows who to nag at Linotype about their Baskerville, please share!_\n\nChecking over at the Linotype site yesterday and Baskerville is in Open Type.\n\n"
    },
    {
      "time": "22 Feb 2008 — 4:22am",
      "content": "\"TrueType is already looking like a dirt track, unpaved and rutted, laden with pot holes and increasingly tiresome to travel for users and developers both.\"  \n:-...wow. TT and OT are two different roads, hu?  \nWe do everything and anything that's asked in OT, just ask...  \nWe have no inhibitors, with only sleep or death to prevent the whole library.  \nWhile you're waiting, go draw your own avatar and stop stealing bicycles.\n\nCheers!\n\n"
    },
    {
      "time": "22 Feb 2008 — 8:52am",
      "content": "<cite> Checking over at the Linotype site yesterday and Baskerville is in Open Type.</cite>\n\nUnfortunately, it's only in Linotype's idiosyncratic OpenType “Com\" version (which is “optimised for international communication and for use with Office applications”). It lacks small caps, old-style figures, extra ligatures, and other typographic features commonly associated with OpenType, except for a scattering of characters that allow for support of Breton, Turkish, and the like (listed here: [http://www.linotype.com/1697-21122/opentypecharactersetsopentypecom.html](http://web.archive.org/web/20131019130852/http:/www.linotype.com/1697-21122/opentypecharactersetsopentypecom.html \"http://www.linotype.com/1697-21122/opentypecharactersetsopentypecom.html\")).\n\n<cite>wow. TT and OT are two different roads, hu?</cite>\n\nI might not have put it quite so forcefully myself! Though from an end user's point of view, sometimes it might feel a tiny bit that way. But I'm so delighted to know that Font Bureau can make more standard-issue OpenType versions of things like Miller, and overall just flabbergasted and delighted to hear from someone whose designs I admire so much. Could I be the first to request an amalgamated, \"OpenType Std\" version of [Miller](http://web.archive.org/web/20131019130852/http:/www.fontbureau.com/fonts/Miller)? (Closely followed by [Eldorado](http://web.archive.org/web/20131019130852/http:/www.fontbureau.com/fonts/Eldorado), which I adore as well!)\n\nBy the way, while you're on the line, if you still are, what proportions of Font Bureau's business would you say comes from individuals, companies, special commissions by publications, and the like? If that's trade-secretish sort of information, don't bother answering.\n\nThanks for noticing the bicycle--I have been trying to think of a more individuated avatar!\n\n—Ladro di Biciclette\n\n"
    },
    {
      "time": "24 Feb 2008 — 6:50am",
      "content": "Thanks for your support, and patience.\n\nJames? \"TrueType is already looking like a dirt track, unpaved and rutted, laden with pot holes and increasingly tiresome to travel for users and developers both.\"\n\nWhat is increasingly tiresome to users?  \nWhat is any kind of tiresome for developers...about TT?  \nNext year will be TT's 20th birthday. 'TrueType is already looking [old]' means what...?\n\nCheers!\n\n"
    }
  ]
}
