{
  "id": "41899",
  "title": "Deberny et Peignot examples?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As I've mentioned [before](http://web.archive.org/web/20131019131150/http:/www.typophile.com/node/36998), I'm putting together an exhibition on type design from 1900-1960 this summer. I am presently searching for materials (books, specimens, sorts, whatever) that show any Deberny & Peignot sans faces from the 20s/30s (e.g. Bifur). I'm looking for materials from that era, related to the metal type.\n\nAny Deco collectors out there who have something they'd be willing to lend June-September? (Security, climate control, proper attribution of course all assured.) Anybody know any leads on other people or institutions who might be willing to help?\n\nThanks in advance for any offers or leads!\n\n",
  "author": "eliason",
  "time": "10 Feb 2008 — 7:09am",
  "uid": "3254",
  "comments": [
    {
      "time": "10 Feb 2008 — 9:23am",
      "content": "A great book with wonderfull examples printed by some of the best printers and designers is called \"Specimens: A Stevens-Nelson Catalogue\". It was printed in 1953 and each page is a sample of great paper, a great designer and/or printer including Bruce Rogers - Aldo Novarese -Hans Mardersteig - Joseph Blumenthal etc. Check it out at Booksold.com - sells for $150 t0 300 and would make an exhibition in itself.\n\nSpecimens:A Stevens-Nelson Paper Catalogue  \n[New York]: [Stevens-Nelson], [1953] This is a catalogue “of the finest printing and art papers in the world...” All of the papers presented in this specimen book were either made by hand, or by hand in conjunction with the mould machine. The papers are a kaleidoscope of colors, tones, patterns and textures. “This catalogue owes its existence to ...more than 150 designers, printers, paper-makers, and other participants” (acknowledgements page) and contains a diversity of designs and printing techniques. Designers include Bruce Roger (who designed the introduction to this volume), Joseph Blumenthal, Hans Mardersteig at the Stamperia Valdònega, T. Robert Stumpf, Jan van Krimpen. Presses include Spiral Press, Curwen Press, Meriden Gravure, Golden Cockerel Press, Chiswick Press. Techniques used in the printing include lithography and silkscreen. With price list dated July 1953 loosely laid in (PAPERMAKING) 4to. Frontispiece “is a specially watermarked handmade paper from Cartiere Miliani-Fabriano” which when held up to the light reveals a marvellous portrait of a mother and child.Flyleaves are examples of fine watermarking obtained in mould made papers Numerous additional illustrations. Quarter green Nigerian goatskin over marbled boards by Russell-Rutter.\n\n"
    },
    {
      "time": "10 Feb 2008 — 2:08pm",
      "content": "Thanks Bob for the tip. Looks like there's a copy of this in a couple of local collections - I'll see if I can borrow it. I appreciate the lead.\n\n"
    },
    {
      "time": "11 Feb 2008 — 6:14am",
      "content": "Craig --\n\nTry contacting Amelia Hugill-Fontanel at the Cary Press at RIT, via [http://wally.rit.edu/cary/CP\\_pages/CPcontactUs.html](http://web.archive.org/web/20131019131150/http:/wally.rit.edu/cary/CP_pages/CPcontactUs.html \"http://wally.rit.edu/cary/CP\\_pages/CPcontactUs.html\")\n\nShe did her graduate thesis on D&P's <cite>Arts et Métiers Graphiques</cite> magazine and might be able to point you in some fruitful directions.\n\n-- Kent.\n\n"
    },
    {
      "time": "28 Feb 2008 — 12:23pm",
      "content": "Received a copy of the Stevens Nelson catalogue via interlibrary loan today. Very handsome, and fun to look through. None of my planned typefaces from the exhibit appear in it, so I don't think I'll look to borrow it for the show, but I'm grateful for the tip nonetheless. Fascinating book!\n\n"
    },
    {
      "time": "16 Apr 2008 — 5:05pm",
      "content": "I could help with this request... I am based in Paris and have a fair idea of the sans\n\nserif Deberny-Peignot ranges... even the odd ones like Banjo (asssuming its 30s?!).\n\nI have catalogues from this period and access to catalogues and ephemera of these things.\n\nI also have lots of these European founts in metal in my type studio, it is listed on the\n\nBriar Press site... and what I print and design can be seen on oldpeacock.blogspot.com\n\nbest Michael Caine\n\n"
    },
    {
      "time": "16 Apr 2008 — 6:11pm",
      "content": "(off-topic) Michael, [this cover](http://web.archive.org/web/20131019131150/http:/bp0.blogger.com/_GSld0ayFfo8/RyN-mDyDPZI/AAAAAAAAAMk/VhXDic7_S5M/s1600-h/Zaoumni.jpg) is very beautiful. I love the simplicity. What is the name of that typeface?\n\n"
    },
    {
      "time": "17 Apr 2008 — 5:29am",
      "content": "founts are both early 1900s metal\n\nGiraldon 60 point (ie French 60 pt not pica); has alternative swash characters (M)\n\nand Bellery Large 18 or 22 pt (I think!)\n\n"
    }
  ]
}
