{
  "id": "4189",
  "title": "Buying fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm a graphic artist for the publications department at a small university. I've been here just over a year.   \n   \nThe font situation here is a hodge-podge of image club fonts from eons ago and whatever has acumulated over the years. We've identified fonts as a priority for this fiscal year and we're looking for a good bundle that would lend itself to broad applications in order to update our fonts and make our collection more stable.   \n   \nJust like everybody out there, we need to maximize cost to benefit ratio (in other words, no money to waste).   \n   \nNo doubt, this question has been asked before. Could you please offer advice or direct me to the appropriate thread.   \n   \nThanks much   \n   \njason\n\n",
  "author": "<a href=\"user/3396\" title=\"View user profile.\">jcade</a>",
  "time": "<br>",
  "uid": "3396",
  "comments": [
    {
      "time": " 8 April, 2004 - 1:00pm",
      "content": "How much are you willing to spend? What do you need the fonts for?\n\n"
    },
    {
      "time": " 8 April, 2004 - 1:21pm",
      "content": "I've not been precisely informed of what the budget is. I have been sent on a fact finding mission by my superior.   \n   \nAnyway, in this office we do a quarterly alumni magazine, sports publications (media guides), mailings for fundraising initiatives, president's report, advertising, recruitment, etc. We design all the propaganda that you can think of that might come from a University.   \n   \nIt seems that some of my predecessors have not been good stewards of the assets here. It is difficult to tell what we legitimately own and what has been provided with outsourced jobs or by students needing a specific something-or-other etc.   \n   \nThe fonts that we do own are old and on 3.5\" floppies (which no one in our dept can access anymore). So, to legitimize our collection and get things back in order, we'd like to more or less start fresh with a nice, general and adaptable collection.   \n   \nthanks   \n   \n-j\n\n"
    },
    {
      "time": " 8 April, 2004 - 2:25pm",
      "content": "Don't know if it's too basic for your needs, but at an educational price of 99 USD, the Adobe Type Classics for Learning CD would be hard to beat.   \n   \nAbout 400 fonts in all, including all of Adobe's Pro families, including \"Opticals\", except, I think, Kepler and Brioso. (Might be wrong about that.) So: Minion, Adobe Jenson, Cronos, Warnock, Utopia, Sanvito, Chapparral. Also includes the non-optical Pro families, including Adobe Caslon and Adobe Garamond, Myriad, Lithos, Trajan. And quite a few others.   \n   \nThere's a fair amount of overlap with the fonts bundled with the Creative Suite package (which does include Brioso Pro). The educational price for the \"Premium Suite\" is just under 400 USD.   \n   \n   \nvc\n\n"
    },
    {
      "time": " 8 April, 2004 - 2:30pm",
      "content": "The $99 is the price for a single user for Type Classics for Learning (unlike most Adobe font products, it's not a 5-user license). However, if you're licensing for multiple users, I think it goes down to $50 per user after the first. You'd have to contact your educational software purchasing folks for details.   \n   \nI believe Victor's right about Kepler and Brioso not being on Type Classics; they were released after Type Classics shipped.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 8 April, 2004 - 6:58pm",
      "content": "This thread might prove useful. Much discussion about the relative merits of various type bundles (and of type bundling itself).   \n   \n [http://www.typophile.com/forums/messages/30/25742.html](http://web.archive.org/web/20060502124147/http:/www.typophile.com/forums/messages/30/25742.html)\n\n"
    },
    {
      "time": " 9 April, 2004 - 7:51am",
      "content": "Thanks very much for the information. I'll try to post back and let you know what we decide to do.   \n   \n-j\n\n"
    }
  ]
}
