{
  "id": "41904",
  "title": "New Blackletter Font",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "hello,\n\nCould you please give me your opinion on this font I'm developing?  \nSince it has so many diferent details it would really help to have a few comments.\n\nThanks in advanced\n\n ![](http://web.archive.org/web/20150317222226im_/http:/typophile.com/files/Picture2_5156.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 1.jpg](http://web.archive.org/web/20150317222226/http:/typophile.com/files/Picture%201_41.jpg) | 228.38 KB |\n\n",
  "author": "rui abreu",
  "time": "10 Feb 2008 — 10:08am",
  "uid": "12433",
  "comments": [
    {
      "time": "10 Feb 2008 — 10:37am",
      "content": "The line going down on the E seems to be a little reader unfriendly, the T seems a little pulled up, I'm not sure about the narrowing on the U, and the V looks like a U.\n\n"
    },
    {
      "time": "10 Feb 2008 — 11:02am",
      "content": "I like the overall feel of the letters - nice work - would make a great type to use on a brandy bottle.\n\n"
    },
    {
      "time": "10 Feb 2008 — 12:59pm",
      "content": "Great first impression!\n\nXXZ: seem awkward. XZ maybe too narrow. Z needs more diagonal in the spine. I wonder in such a calligraphic font if the Z stress shouldn't be reversed.\n\nUVW: top left, the cut seems a little wide (sagging?).\n\nKR: their toes are looking cramped!\n\nT: look light.\n\n"
    },
    {
      "time": "10 Feb 2008 — 1:52pm",
      "content": "Some lovely pen-like touches to this typeface, would really work well with a good number of alternate swash characters, in the spirit of the extravagant flourish you've given to the 'Q'\n\n"
    },
    {
      "time": "11 Feb 2008 — 11:40am",
      "content": "Really lovely. The details and the contrast both. I wonder if some of the letters appear awkward because of context. Could you post some word samples?\n\n"
    },
    {
      "time": "11 Feb 2008 — 11:50am",
      "content": "I second what Tiff said!\n\n"
    },
    {
      "time": "12 Feb 2008 — 4:57pm",
      "content": "Let me be the latest congratulations. Great for chapter initials!\n\n"
    },
    {
      "time": "13 Feb 2008 — 3:13pm",
      "content": "Thank you,\n\nTiffany I think some of the letters appear a litlte awkward with other letters but i am not sure if it's just me.  \nAny comment would be very wellcome.\n\nThanks:)\n\nhere goes the sample.\n\n ![](http://web.archive.org/web/20150317222226im_/http:/typophile.com/files/sample2_3876.jpg)\n\n"
    },
    {
      "time": "13 Feb 2008 — 4:04pm",
      "content": "Rul, This is one of those typefaces that is begging for a lot of alternates. I really love it and wonder if a lowercase could ever happen? (Doesn't matter though. Still love it.)\n\nThe EX pair is open, but again ... alternate?  \nAny double letter pair could use an alternate.  \nThe ES pair is a little too open.. Maybe the E needs an alternate? I love the E as it is, but I can see that it needs a sister.\n\nLove this. More! More!\n\n"
    },
    {
      "time": "13 Feb 2008 — 5:38pm",
      "content": "I really think that the thin stroke on the E leads to a drop in readability.\n\n"
    },
    {
      "time": "14 Feb 2008 — 1:17pm",
      "content": "Scott, i think you are right about the E. what do you think about this one?\n\n ![](http://web.archive.org/web/20150317222226im_/http:/typophile.com/files/ict_5110.jpg)\n\n"
    },
    {
      "time": "14 Feb 2008 — 4:39pm",
      "content": "Good point. I think it is improved because of that.\n\n"
    },
    {
      "time": "14 Feb 2008 — 5:44pm",
      "content": "we loves it! can we please have a lower case: a really tall one?\n\n"
    },
    {
      "time": "14 Feb 2008 — 6:10pm",
      "content": "Ooh. What about unicase? OTT?\n\n"
    },
    {
      "time": "14 Feb 2008 — 7:50pm",
      "content": "I think the New E it is much better. I have an idea bout it though; what if you let the bottom stroke of the E start farther out ( in the middle) and take on that small bulb shape that is on the light stroke now. Then the light stroke might be more like the ones on the arms of the T. I think that would let you keep the idea but let the E read as an E just a little faster/better.\n\nDo you mind if I post a graphic suggestion for the E? Maybe it's a terrible idea...\n\nAlso I second what Tiff said about alternatives either coded in to be automatic or just available like swashes. I say this because some pairs are great together like the TA and SU. But TY, and as Tiff pointed out the EX are less so. The potential beauty of this will be greatly enhanced by a lovely consistent fit - using inconsistent forms if needed.\n\n"
    },
    {
      "time": "15 Feb 2008 — 4:32am",
      "content": "Eben, I don't quite see what you mean. Do you mean making the same termination as the one on the L's bottom stroke?  \nIf you want post it, I would like to see you suggestion. That could work, but I think maybe it will be difficult to coordinate it with the curved strokes (if that is your idea) without making it too complex. but I agree that the E isn't the most legible.\n\nPaul & Tiffany, I already see this font as a unicase, there are already lower cases mixed with upper cases. But I don't want to have descenders or ascenders. I want to keep everything above the baseline and under the caps height. But I could have more lower case alternatives, for intance for the H, A, D.\n\nThe ligatures for some pairs are deffenetly nedded, I have to work on them:)\n\n"
    },
    {
      "time": "15 Feb 2008 — 1:07pm",
      "content": "These ideas may be insufficiently calligraphic but the thrust of it in terms of where weight might be added reduced is what I have in mind. In any event if you find it useful feel free to use it in part or whole. Also I tried to make the solutions context driven.\n\n ![](http://web.archive.org/web/20150317222226im_/http:/typophile.com/files/2e_6587.gif)\n\n"
    },
    {
      "time": "15 Feb 2008 — 2:08pm",
      "content": "It might look slightly better if you pull out the top drop on the E as far to the right as the bounds of the letter's shape allow.\n\n"
    },
    {
      "time": "15 Feb 2008 — 2:20pm",
      "content": "Like this?\n\n ![](http://web.archive.org/web/20150317222226im_/http:/typophile.com/files/2e2_5069.gif)\n\n"
    },
    {
      "time": "15 Feb 2008 — 7:00pm",
      "content": "I like that second E on \"exec\". It reads more like an E, I have to redraw one based on this.\n\n"
    },
    {
      "time": "15 Feb 2008 — 7:10pm",
      "content": "I like more of the swishes. If it's a decorative face, then decorate. I love it. Very hard to draw a face like this. Anyone can draw a mechanical monoweight face.\n\n"
    },
    {
      "time": "15 Feb 2008 — 7:36pm",
      "content": "<cite> Anyone can draw a mechanical monoweight face. </cite> If they do it poorly. Doing it well is hard too.  \n<cite>more like an E.</cite> Great. I would consider making a few of them though like Tiff said. And don't use my example too precisely. It's pretty poor except maybe to get a general idea across.\n\n"
    },
    {
      "time": "17 Feb 2008 — 5:20pm",
      "content": "beautiful! love it!\n\n"
    },
    {
      "time": "18 Feb 2008 — 5:22am",
      "content": "This beautiful piece of work needs a name. :)\n\nDavid Thometz\n\n"
    },
    {
      "time": "18 Feb 2008 — 11:21am",
      "content": "I really like it. Only one comment. I wonder if in some context, the F might be looked like a P?\n\n"
    },
    {
      "time": "18 Feb 2008 — 1:56pm",
      "content": "It doesn't read as a P to me. I think Andre's point is stall valid enough that I would encourage an alternative Glyph either as the standard or the second.\n\n"
    },
    {
      "time": "20 Feb 2008 — 10:42am",
      "content": "Bom trabalho :)\n\n- I agree with lots of things said here, but about the \"E\" I like the alternatives Eben gave you.\n\n- \"V\" needs to be fixes, not to be confused with a \"U\"\n\n- And the \"F\" doesn't seem a P to me\n\n"
    },
    {
      "time": "20 Feb 2008 — 10:55am",
      "content": "Thank you. Your comments are helping a lot.  \nI'm not very secure with the F either.  \nV & W have to be less curved:)\n\nI will upload a new E later today.\n\n"
    },
    {
      "time": "20 Feb 2008 — 3:45pm",
      "content": "hi, again\n\nhere are a couple of new E's.\n\nThe first one is started with Eben's suggestion, the second could be an alternative E.\n\nI think the first working:)\n\n ![](http://web.archive.org/web/20150317222226im_/http:/typophile.com/files/exec2_4149.jpg)\n\n"
    },
    {
      "time": "20 Feb 2008 — 4:46pm",
      "content": "I think they both work quite well. The only thinbg is that the other letters have a certain lighthearted flipancy about them if that makes sense. These new \"E\"s seem a bit more quiet or subdued. Do you see what I mean?\n\n"
    },
    {
      "time": "21 Feb 2008 — 2:22am",
      "content": "Do you mean they are too constrict. I think they need more \"gesture\" and spontaniousness. I'm not sure i'm going to use the second E though.\n\n"
    },
    {
      "time": "21 Feb 2008 — 8:35am",
      "content": "Yes the spontanious/gestural aspect captures what I mean. The letters are very lively in general.It would be good if the E fit in with that. It would be cool if there was one that was good for use next to flat letters on the right & one for round shapes and or one for use at the end of a word. The 1st one I made is an example of a possible end of the word design.\n\n"
    },
    {
      "time": "22 Feb 2008 — 7:54am",
      "content": "I love the forms. Beautiful letters. I dont know if anyone agrees, but I have a feeling there is something awkward about the T. I have a feeling that it somehow slants to the right. may be its just me.\n\n"
    },
    {
      "time": "22 Feb 2008 — 8:14am",
      "content": "Hmmm interesting. Yes, maybe so. I think if the base serif was extended to the right slightly that would cover it.\n\n"
    },
    {
      "time": "22 Feb 2008 — 8:05pm",
      "content": "Beautiful. I especially love the ampersand (yes, I'm weird that way). I agree with the \"E\" comments above, but I think your latest post (execution) solves it in the first \"E.\" Very nice work.\n\n--  \nD Molanphy\n\n"
    },
    {
      "time": "6 Mar 2008 — 6:41am",
      "content": "Olá Rui,\n\nVery good stuff. Have you tried small caps for it? Just so you know, if one day you need a specimen of it printed, think letterpress.  \nAlso, my thing with type is more a looking for the name then actually of how it looks. Do you have a name for it?\n\nO tipo é fixe pá!\n\n-André\n\n"
    },
    {
      "time": "7 Mar 2008 — 3:05pm",
      "content": "I like it. Well done.\n\n"
    },
    {
      "time": "10 Mar 2008 — 3:36am",
      "content": "I've called this one Orbe, the portuguese for \"orb\". A nice poetic name:)  \nIt's getting it released i'll upload a PDF later today.\n\nAndré, LetterPress would be perfect. Maybe you can help me on this.\n\n"
    },
    {
      "time": "10 Mar 2008 — 12:46pm",
      "content": "Can you say how it will be released?\n\n"
    },
    {
      "time": "10 Mar 2008 — 2:31pm",
      "content": "Do you mean the format? It will be out in OTF.\n\nI have uploaded a pdf at the top.\n\n"
    },
    {
      "time": "10 Mar 2008 — 2:37pm",
      "content": "No, I meant will you release it yourself? Or will you go with a foundry?\n\n"
    },
    {
      "time": "10 Mar 2008 — 2:43pm",
      "content": "Doh! I see now! You will release it from your foundry! Here:\n\n[http://www.r-typography.com/](http://web.archive.org/web/20150317222226/http:/www.r-typography.com/ \"http://www.r-typography.com/\")\n\n"
    },
    {
      "time": "10 Mar 2008 — 3:01pm",
      "content": "yes. Since this is just one weight. I'll just put it on my site and sell it through MyFonts.\n\n"
    },
    {
      "time": "14 Mar 2008 — 5:35am",
      "content": "Hi Rui,\n\nBack here. I will do it for you. Cheap for sure, just for the pleasure of seeing it on the paper. Black and red. The design could be like a old book title page.\n\n\"Orbe\" - cool!\n\nViva ó Sporting (espero que não sejas encarnado)\n\nInté\n\n-Andre\n\n"
    },
    {
      "time": "20 Mar 2008 — 5:39am",
      "content": "André thats cool, it would look nice. Maybe  \nI have to deal with its release first. Thanks:)\n\nPs.: nem verde nem vermelho, mais azul:)\n\n"
    },
    {
      "time": "21 Mar 2008 — 5:25am",
      "content": "Rui, whenever you think is OK we can discuss printed specimens. I guess some sort of 'limited' edition single piece could and would be a interesting approach. You could use it to promote your work and at the same time please the EYES of the world!\n\nVocê bem poderia incluir a dragon glyph on the font, hehe...\n\nCheers\n\n"
    },
    {
      "time": "22 Mar 2008 — 8:44am",
      "content": "That is a really good one - have you tried sending it in? I daresay this is something the larger type foundries might be interested in.\n\n"
    },
    {
      "time": "26 Mar 2008 — 10:25am",
      "content": "Woah, that's nice. :)\n\nWe'll probably see this typeface in use, like on bookjackets and movieposters.\n\n"
    },
    {
      "time": "26 Mar 2008 — 10:32am",
      "content": "Like a new Trajan? That's a nice thought.\n\n"
    },
    {
      "time": "26 Mar 2008 — 3:45pm",
      "content": "Lol, no not like that. I meant it as something positive. :P\n\n"
    }
  ]
}
