{
  "id": "41926",
  "title": "\"Authentic\" letter spacing of revival fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "All of the talk of \"authentic revivals\" like Garamond Premier Pro has me wondering something. Truly authentic typesetting would use zero kerning, wouldn't it? For instance, if you wanted an AW sequence that didn't have a year's worth of space between them, you'd have to use a physically different sort, i.e., a logotype or ligature to make up the space between them.\n\nSo if a person wanted to create a truly authentic spacing setup as was used up until our modern time, how would you go about doing so? For instance, Caslon. An authentic Caslon would never have been kerned, so how would you set up a document so that the _spacing_ was authentic, not just the letterforms?\n\nOr, what kind of metrics settings would a type designer build into a typeface to do the same thing?\n\n",
  "author": "Dan Gayle",
  "time": "11 Feb 2008 — 12:24am",
  "uid": "12948",
  "comments": [
    {
      "time": "11 Feb 2008 — 1:25am",
      "content": "I guess it would be NO kerning but POSITIVELY spacing (using spacers). Common practice used to be fixing the apparant mistakes as they appeared (at least that’s how we did it in our printing department at Art School).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "11 Feb 2008 — 1:43am",
      "content": "You would try to figure out what the metal spaces had been either directly by examining the metal or by inference.\n\nIf it was a handmade punchcut type it would be more complicated. If it was a Monotype or Linotype then you could learn about their widths which were more standardized.\n\nBut doing something like this wouldn't be something I would consider seriously. With real progress possible why create a deliberately hobbled typo-fetish object? ...Unless you think you think there is a market for it.\n\nDo you?\n\n"
    },
    {
      "time": "11 Feb 2008 — 2:30am",
      "content": "My reasoning is this: If you're gonna make a revival typeface, why not recreate the whole thing? Sure, most of us want to have nicely fitting type. But what if I WANT to create a page of type that looks like it's straight out of 17th century Holland?\n\nYou'd obviously not want that the default setting, but it wouldn't take brain surgery, I'm guessing, to create a stylistic set for just the spacing. That way, the Luddites, such as myself, could turn it on or off to our heart's content.\n\n"
    },
    {
      "time": "11 Feb 2008 — 3:08am",
      "content": "The old punchcutters did have kerned parts in their letters. Where do you get the idea that they didn't? 17th century Dutch type had kerning. The 15th and 16th century Italians had it, too, IIRC.\n\nThe Linotype machine didn't really have it, but I think that the Monotype machine did. There came much later anyway.\n\nKerning may have been \\*used\\* less in the 17th century than it is today (lots of unkerned cap Vs and Ws back then, I think). But kerning wasn't a foreign practice. It was just hard to do, not impossible.\n\n"
    },
    {
      "time": "11 Feb 2008 — 4:57am",
      "content": "Have a look at ‘old-style kerning’: [Article on hand composition by Thomas Maier](http://web.archive.org/web/20120720113540/http:/www.dma.ufg.ac.at/app/link/Grundlagen:DTP/module/13712) (scroll down to ~ top third of page; ‘WALTER’).  \nF\n\n"
    },
    {
      "time": "11 Feb 2008 — 6:33am",
      "content": "As the WALTER photo shows, metal type could indeed be \"kerned\". We spent many an hour with saw and file undercutting parts of metal types so, for instance, that W could rest nicely on the shoulder of the A.\n\nThe cutting had to be precise so the pieces fit together sweetly, lest the kerned part break off during the press run, possibly fouling other parts of the forme.\n\nA clever Monotype keyboard operator could get the same thing to happen right on the machine, no sawing necessary. I forget how that was done, but I do know that few keyboarders knew the trick.\n\nTake a look at books designed and printed by Leonard Baskin at Gehenna Press. He'd set dense lines of all caps with never a thought about the wide spaces that come with WA, etc. And I seem to recall that he used the Bembo long-tail R in those settings, too. That's about as \"authentic\" as you could get.\n\npowers\n\n"
    },
    {
      "time": "11 Feb 2008 — 6:53am",
      "content": "<cite> &gt; For instance, if you wanted an AW sequence that didn’t have a year’s worth of space between them, you’d have to use a physically different sort, i.e., a logotype or ligature to make up the space between them.</cite>\n\nNo, Dan, you'd have to cut some of the body metal away so that the A and W would overlap. (As seen from the link Florian posted.)\n\nThat is, in fact, the original meaning of 'kern' -- a part of the type that extended beyond the body and overlapped with the sort beside it. The verb \"to kern\" meant to cut away some metal (producing a \"kerning\" element).\n\nSome foundry sorts might have been cast with a kern -- e.g., the f might often have a projecting terminal. Linotype could not accommodate any kerned elements, thus the infamous Linotype non-kerning f. Monotype casting, however, could accommodate kerned sorts.\n\nNaturally, kerned elements could be fragile. And manual kerning (with a kern saw) was time-consuming. So it kerning was employed sparingly.\n\nBut it's not correct to say that it didn't exist.\n\n-- K.\n\n"
    },
    {
      "time": "11 Feb 2008 — 7:02am",
      "content": "Personally I think that authenticity in revivals is not a goal worth the effort, and you are going to fall short anyway, as every other 'authentic' revival has. What is worth it is to revive what you find good in a old type, and suit it for modern printing, or the screen, as the case may be.\n\nOn spacing, I don't see any charm in having, eg, your italic caps look like they are in another county from the rest of the word they go with--something you can see in old books.\n\nKerning in digital type is a good thing, as Martha would say.\n\n"
    },
    {
      "time": "11 Feb 2008 — 10:56am",
      "content": "<cite>No, Dan, you’d have to cut some of the body metal away so that the A and W would overlap.</cite>\n\nI have in my hands a Linotype specimen from the 50s where they are clearly selling V\\_A A\\_W W\\_A, etc., ligated sorts.\n\nThat idea of the kerned, as in cut away, sorts was something I was vaguely familiar with, but I was under the impression that it was rarely done. I think one of the old school letterpress guys here on Typophile even posted some pics at one time of a long overhanging f in foundry type.\n\nBut that's still going to be mainly for book printing, correct? What about the more ephemeral things like newspapers?\n\n ![](http://web.archive.org/web/20120720113540im_/http:/typophile.com/files/IMAGE089_3828.jpg)\n\n"
    },
    {
      "time": "11 Feb 2008 — 10:59am",
      "content": "In any case, I can't seem to recall where I saw it, but didn't metal sorts have width sizes for standardization purposes? Something like i, n, and m widths, then UC specific widths? Or am I just imagining that I've seen that somewhere...\n\n"
    },
    {
      "time": "11 Feb 2008 — 11:44am",
      "content": "Such authenticity is not out of the question.  \nFirstly, most type designers would, I imagine, make sure their typefaces are fine without kerning first, before they add it. The reason being it's much easier to work that way.  \nThen, all the typographer has to do is enter zero in the kerning field in Quark/InDe.\n\n"
    },
    {
      "time": "11 Feb 2008 — 12:30pm",
      "content": "\\> He’d set dense lines of all caps with never a thought about the wide spaces that come with WA, etc.\n\nIf you are setting dense lines of all caps, why bother with kerning.\n\n---\n\nIn the newspaper sample, there is a Tr and a Ve that clearly show no kerning. But then newspapers didn't worry about kerning until the computer generation (if they do at all).\n\n"
    },
    {
      "time": "11 Feb 2008 — 12:48pm",
      "content": "That's my point. If I wanted to create an authentic 17th century newspaper \\*look\\*, would simply setting all of the kerning to zero work?\n\nPossibly for upright Roman faces, but not for italics, since modern metrics have the right sidebearings within the letterform itself. Obviously, except in the cases as mentioned above, NOT something that would have happened on a letter cut into a physical block of metal.\n\nThe sidebearings would have to be bumped to the edges of the letterform itself, NOT something that a modern type designer would want by default in all cases. Hence, the idea of a stylistic set that only effects the spacing, using composite glyphs that vary only in the change of sidebearings and kerning.\n\n"
    },
    {
      "time": "11 Feb 2008 — 12:53pm",
      "content": "Someone else can correct me if I am wrong, but I believe that italic hotmetal was cast on oblique type slugs. I think it is the Ludlow machine I see in my mind, but perhaps Linotype did the same thing? And handset?\n\n"
    },
    {
      "time": "11 Feb 2008 — 2:02pm",
      "content": "The Linotype Machine didn't have oblique matrices. In fact, the italic and the roman (or the roman and the bold) were often duplexed, i.e., they were one the same matrix, one letter above the other (e.g., roman over italic). The means, of course, that the two duplexed letters had to have the same character width. Typefaces that were designed with this limitation in mind look good. Others don't really…\n\n"
    },
    {
      "time": "11 Feb 2008 — 3:12pm",
      "content": "Dan [Gayle] -- Sorry, didn't mean to imply that there were no ligated sorts (or, properly, logotypes). But that was mostly only for Linotype, because the nature of the linecasting technology is such that it cannot accommodate kerns at all. (Since an entire line is cast at once, you can't very well cut kerns manually either.)\n\nMonotype casts individual sorts and automatically sets them up in a line, and the casting technology could accommodate kerning (although, as Will pointed out, this might take some clever finagling). So generally speaking, logotypes were not provided for the kind of combinations you're talking about. Same for foundry type, I believe.\n\nThere were certain faces in foundry (I don't know about Mono) that would offer special logotype and ligatured sorts, but that was usually for decorative faces, not so much with workhorse text faces. This is not the same as the AW VA AW kind you're talking about.\n\nStarting around the beginning of the 20th century, Linotype acquired the lion's share of newspaper text market. So, you won't see any kerning in newspaper type. I doubt any of them ever bothered to use logotype or ligatured sorts -- too much hassle on newspaper deadlines. Also, as a consequence, the kind of AW or WA logotypes you're referring to weren't provided for newspaper faces, mostly only some book faces.\n\n<cite> &gt; In any case, I can’t seem to recall where I saw it, but didn’t metal sorts have width sizes for standardization purposes? </cite>\n\nI think you're recalling that Monotype designs were constrained to a unitized width system -- initially 18 units, later 54 units -- where widths were restricted to certain increments of the em.\n\nNot true of Linotype or foundry type.\n\nThere was a system of \"quick-set\" types developed by ATF with very restricted, modular widths, and promoted as easier to justify quickly because of the modular nature of line lengths. But I don't think that was very widely embraced.\n\n-- K.\n\n"
    },
    {
      "time": "11 Feb 2008 — 3:29pm",
      "content": "_Also, as a consequence, the kind of AW or WA logotypes you’re referring to weren’t provided for newspaper faces, mostly only some book faces._\n\nSure, no logotypes for Corona and Opticon, but a great many Linotype faces had them, including Times, Spartan, and Metro.  \nWhether the operators used them is another matter.\n\n"
    },
    {
      "time": "11 Feb 2008 — 7:15pm",
      "content": "\\>\\> I believe that italic hotmetal was cast on oblique type slugs. I think it is the Ludlow machine I see in my mind.\n\nYou are sort of right, Don. The slugs themselves are not oblique. The slug, the underpinning of the line of type cast on a Ludlow, is no different than for roman type. Slugs are 6 or 12 points thick, and they all look the same. So it is not correct to say that the slugs for italic type on the Ludlow are oblique.\n\nThe matrices for italic type are angled, to accommodate the \"slant\" of the letterforms. All Ludlow italic mats are angled to the same degree. I am not sure if this could allow for varying degrees of slant amongst faces; I never really looked at that.\n\nThere are two ways to set italic. If you are setting a line in all italic, you get out the \"italic stick.\" The ends of the stick are angled the same as the matrices. You place mats in the stick the same as roman mats or dingbat mats, lock the stick, slide it in the machine, click the trigger and get a slug with italic type.\n\nIf you wish to inert an italic word within a roman line—say, a book title or a cuss word—you insert an italic word space fore and aft of the italic. These are \"triangular\" word spacers. The \"flat\" side snugs tight with the roman mat ahead of it, and the following edge slants to receive the ital mat. Just the opposite at the other end of the ital sorts. Sometimes this makes for odd word spacing. Sometimes I'd cast two of such a slug and cut the italic out of each, then with the saw adjust the space either side of the ital, generally reducing it, and re-assemble the line.\n\nAngled mats give Ludlow lines the impression of kerns: look at the italic f in Ludlow Garamond (the basis for Font Bureau's Garamond].\n\nI have tried to find some pix on the web of these things, but no luck. I thought Mark Jamra had a little Ludlow movie on his site, but no can find tonight. & I cannot post anything, for all my books are in deep storage. Sorry.\n\nLudlow is so cool. I loved working one. The only way I'd ever get back into letterpress was if I could get a good Ludlow and good selection of mats.\n\npowers (an old school letterpress guy)\n\nOH: re Leonard Baskin: most of the clasic \"fine printers\" abhorred all-cap lines in which the spacing was not evened out so such as HE appeared to have the same amount of space as WA. That's all I was pointing out: Leonard's iconoclasm in that regard.\n\n"
    },
    {
      "time": "11 Feb 2008 — 10:31pm",
      "content": "Just did a quick search on Googlé, and I found this image of an italic composing stick for the Ludlow on Ebay:\n\n ![](http://web.archive.org/web/20120720113540im_/http:/typophile.com/files/3309_1_4042.JPG)\n\nSo the idea of spaced all caps came about _because_ of spacing issues? That's an interesting observation.\n\n"
    },
    {
      "time": "12 Feb 2008 — 6:16am",
      "content": "Thanks, Dan, very much, for giving us that photo. You're better at the web than I.\n\nWhat you show here is more than just an italic Ludlow stick. This is an italic LONG stick. There is also a long stick for roman work.\n\nFirst the \"italic\" part. You can see how the ends of the stick are angled so the angled italic mats fit into it. I wrote about that last night.\n\nNow for the \"long\" part. Take note of those notches on the upper edge of the stick, and of the pairs of diagonal lines on the bottom edge. Most Ludlow machines were built to cast slugs 22.5 picas long. A few were made to cast 30-pica slugs (American picas). This points to its dominance in news and ad work. But obviously a newspaper will often need heds longer than 22.5 or 30 picas. When that happens, the comp resorts to the long stick. He sets the entire headline, up to about 66 picas in this stick, I think. At those notches he sticks a special spacer, maybe about 5 picas wide. This spacer can go between words or letters, no matter. The spacers allow the comp to insert that stick full of mats into the stick holder 3 times in succession, each time at the \"regular\" length of 22.5 picas. Once, twice, thrice. Each slug is then 22.5 picas long, and they can then be butted together to set the full-measure hed. At the end of each slug the type is \"kerned\" (for lack of a better word) out over the end of the slug, and at the beginning of the next slug is empty space to the exact width of the kern, so the join is seamless and not noticeable in the printed line.\n\nI'd be happy to chat here about other Ludlow questions: we've gotten a bit off topic. If someone wants to start a Ludlow session, do so. & I'd encourage any others who once used Ludlows to join in. I hope I'm not the only one who has used this sweet gizmo.\n\nSPACED CAPS. I think spacing of all caps (and small caps) came about for two reasons. One is that the massed rectangle of all caps, especially when there are more vertical strokes than rounds or diagonals, is easier to read when some air is introduced. We do this today by adding overall tracking, as when a book's running head is set in spaced smalls. We also can automatically space lines of all-cap or all-smalls on Monotype machines that have a \"unit adder\" (that ain't a kind of snake). The second reason is aesthetic. Those spaced lines, Monotype or computer, look better if some of the letterspaces are varied a bit so they appear to be equal. With Leonard Baskin, un-spaced all caps was part of his type vision.\n\npowers\n\n"
    },
    {
      "time": "12 Feb 2008 — 1:23pm",
      "content": "\"My reasoning is this: If you’re gonna make a revival typeface, why not recreate the whole thing?\"\n\n\"I’d be happy to chat here about other Ludlow questions: we’ve gotten a bit off topic...\"\n\nNot really. You are representing the knowledge Dan's 100% revival would require to properly use such a face.  \nSo, if you make a face, recreate the whole thing, as metal would have allowed, then one had better recreate the users who could make the best out of it.\n\n\"The sidebearings would have to be bumped to the edges of the letterform itself,...\"  \nMetal does allow some kerning to occur, you know. It might not last long under tough printing conditions, but letters did and do 'bleed' off the body.\n\nCheers!\n\n"
    },
    {
      "time": "12 Feb 2008 — 3:00pm",
      "content": "<cite>So the idea of spaced all caps came about because of spacing issues? That’s an interesting observation.</cite>\n\nActually it may be a re-invention of the wheel as much as anything. Actual Roman Roman caps were often spaced widely. Jan Tschichold was a big advocate. See\n\n[http://briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm](http://web.archive.org/web/20120720113540/http:/briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm \"http://briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm\")\n\nActually, the old carved letters also had a wider variety of widths than do Caps in the period you are talking about. Look at an E\n\n[http://www.flickr.com/photos/canadianveggie/172779789/in/pool-visible\\_words](http://web.archive.org/web/20120720113540/http:/www.flickr.com/photos/canadianveggie/172779789/in/pool-visible_words \"http://www.flickr.com/photos/canadianveggie/172779789/in/pool-visible\\_words\")\n\nI think this variance helped to make them read more readily ( more distinctive) when \"set\" as text. Making Caps whose widths were more similar probably came about as a result of their new use with the miniscule. Which makes me wonder if small cap designs aught to vary their widths more than they usually do...\n\nWhat do you think?\n\n"
    },
    {
      "time": "12 Feb 2008 — 4:50pm",
      "content": "I have some Ludlow display mats that have kerning pairs in the capital. They are shown in the Ludlow catalog.\n\n"
    }
  ]
}
