{
  "id": "41922",
  "title": "Wacom again",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I know this has been discussed a couple of times around here as I read that a 6x8 inches tablet is just fine and that some Typophiles are addicted to it but:\n\nAre Wacom tablets really efficient outside Photoshop and Corel Painter?\n\nCan they really replace a mouse in more publishing design oriented tasks like vector tracing or text editing?\n\nI'm asking because I got tendinitis on the wrist and would like to try a tablet for a relief but I have seen these tablets advertised almost exclusively for drawing applications and sloppy tagging (bamboo promo).\n\nMost of my work is done on Illustrator and Indesign, I do use photoshop frequently but mostly for adjusting the color, sharpness and contrast on photos.\n\nHéctor\n\n",
  "author": "rs_donsata",
  "time": "10 Feb 2008 — 10:35pm",
  "uid": "1530",
  "comments": [
    {
      "time": "10 Feb 2008 — 10:51pm",
      "content": "Sure, I know a number of folks who use their tablets in lieu of a mouse, particularly those who have carpal tunnel issues. The only reason I don't is that I generally use the tablet propped on my lap, which makes it fairly inconvenient for using the keyboard at the same time. Slapping it down on the side of the keyboard basically makes it like an active mouse pad, and you can even buy a Wacom mouse and switch back and forth as I did a few years ago (that's when it is REALLY cool and convenient that each device is individually programmable and automatically recognized by the tablet).\n\n"
    },
    {
      "time": "10 Feb 2008 — 11:13pm",
      "content": "The thing I hated about using it exclusively was that your hand, your wrist, drags on the pad and starts to get rubbed sore. I had one of those nice gel pads for my mouse, but I can't use that for the tablet.\n\n"
    },
    {
      "time": "11 Feb 2008 — 1:38am",
      "content": "I used one of the small ones (A5-size) for years (after I started having problems with my wrist) and found it to be very convenient.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "11 Feb 2008 — 3:57am",
      "content": "I have the Cintiq 21UX and I can't imagine life without it now. Vector work is so much less pleasant with a mouse now that I'm comfortable doing it with a stylus. I use it with Photoshop quite a bit, but much more frequently in Illustrator.\n\n"
    },
    {
      "time": "11 Feb 2008 — 4:01am",
      "content": "I use a Wacom tabled with my right hand and a mouse with my left hand. I tend to use the left mouse for trivial work like scrolling while reading web pages, file copying and anywhere else where precision is not required.\n\nA.\n\n"
    },
    {
      "time": "11 Feb 2008 — 6:34am",
      "content": "i began using a tablet to relieve \"mouse cramp\" and i love it. now i can't work without it - but i insist on a large one. i found that with a pen i need to get as close as possible to a 1 to 1 scale relationship between monitor and hand.\n\nas noted, the tablet also allows you to work very close to the body, relieving arm reach and shoulder strain.\n\nif you are starting to experience any kind of repetitive stress- wrist, arm, or elsewhere - i strongly advise you to change up the ergonomics as soon as possible, and a tablet is an easy way to do that.\n\ni use it (in tandem with a mouse) for all sorts of non-drawing tasks, and it also allows me to return to mouse tasks with more endurance than i would have with a mouse-only station.\n\nfor drawing tasks, of course, it is ideal.\n\n"
    },
    {
      "time": "11 Feb 2008 — 6:52am",
      "content": "I use a 6x8 and use InDesign and Illustrator almost exclusively and I never use my mouse. Actually I don't remember the last time I used my mouse. I use my tablet when online, and I even type with the pen in my hand.\n\n"
    },
    {
      "time": "11 Feb 2008 — 7:42am",
      "content": "Stangely enough, and in contrast to what Adam says, I end up using the mouse when precision is required and the tablet on random other occasions.  \nThis is because the mouse allows me to position the cursor where I want and then let go of the button precisely there whereas with the pen I tend to move the cursor unwillingly while I lift it, messing up the carefully selected position I was at. Anyone else has the same problem or am I just too shaky?  \nPlus, a pen is obviously not so convenient if you switch a lot between typing and using the cursor because you can't simply let go of it like with a mouse.\n\n"
    },
    {
      "time": "11 Feb 2008 — 9:40am",
      "content": "Great, then I'll be ordering a 6x8 Graphire soon.\n\nHéctor\n\n"
    },
    {
      "time": "11 Feb 2008 — 9:58am",
      "content": "I haven't tried a Wacom tablet, but I do find a track ball is significantly easier for me to handle with precision than is a mouse. I originally switched because of a sore shoulder from repetitive motion with the mouse, and it helps for that too.\n\n"
    },
    {
      "time": "11 Feb 2008 — 10:36am",
      "content": "to tim:\n\n\"because the mouse allows me to position the cursor where I want and then let go of the button precisely there whereas with the pen I tend to move the cursor unwillingly while I lift it, messing up the carefully selected position I was at. \"\n\nyes, this is common for me too - i too end up going to the mouse sometimes when i want a precise stop.  \ndrinking less coffee helps. ;)\n\nas for mouse ergonomics: i love my logitech bluetooth !  \nit's the smallest mouse i've found and ergonomically perfect for me.\n\n"
    },
    {
      "time": "11 Feb 2008 — 1:13pm",
      "content": "I have 2 Wacom tablets - a medium Bamboo Fun I use at home and a 9x12 Intuos I use at work. I use the mouse for must design work and surfing, but the pen for any image editing or drawing. I could probably get used to surfing with the pen, but I've just never really tried.\n\n"
    },
    {
      "time": "12 Feb 2008 — 10:30am",
      "content": "One of the unadvertised benefits of the Wacom mouse is that it is a bit lighter. Many USB mice are a bit heavier + if it isn't cordless the slight tension of dragging around a cable means just a bit more work with every movement. It may seem like a microscopic difference but over time it has an effect. I switched to a Wacom tablet thinking that the stylus would help relieve hand stress, but the light cordless mouse was itself enough.\n\n"
    },
    {
      "time": "12 Feb 2008 — 11:30am",
      "content": "Hector,  \nI think Wacom works very well for you, though it takes couple of weeks to get used to.. at first it isn't so easy not to make accidental clicks and move stuff around. :) I also had a bit of a stress in my shoulder at the beginning. I have Intuos3 A5 wide, and I haven't used mouse for over a year now. I work mainly in Indesign and Photoshop.\n\n"
    },
    {
      "time": "12 Feb 2008 — 11:48am",
      "content": "I think mouse weight depends on the model. The Intuos is still a bit heavy, but the Bamboo mouse is very light.\n\n"
    },
    {
      "time": "12 Feb 2008 — 2:33pm",
      "content": "Well, if you are looking for a <cite>really</cite> lightweight mouse you should check out [this](http://web.archive.org/web/20131018102357/http:/www.designodoubt.com/entry/Jelly-click-_-mouse-for-laptop).\n\n"
    },
    {
      "time": "12 Feb 2008 — 3:47pm",
      "content": "I've been using a Wacom for everything since 1992, and attribute it to keeping me free of hand/wrist ailments, despite a vast number of hours at the computer.\n\nThe reason is:\n\n1. The natural position for the wrist is with the plane of the palm vertical, as when standing or walking. And that's the position used in writing. In mousing, the wrist is rotated 90 degrees, which twists and stresses nerves in the carpal tunnel.\n\n2. When mousing, you're using just one finger for clicking. Any physical activity so exclusive is bad in the long run, because it's better to share the load. Therefore, clicking with a \"writing\" movement that spreads the work between fingers and wrist is less stressful.\n\n"
    },
    {
      "time": "12 Feb 2008 — 5:17pm",
      "content": "I use the pen and a puck digitizer as my mouse on my ARTZ II. 12 X 9. I love it, it is the only way to go.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "12 Feb 2008 — 6:52pm",
      "content": "Spring for the Intuos. Much better than the Graphire.\n\nI have a 4\"x5\" Graphire, and a 6\"x8\" Intuos and a 9\"x12\" Intuos. I never use a mouse, ever.\n\nThe 6\"x8\" is just fine for almost everything, but cutting masks in PS sometimes the bigger one is desirable.\n\nSaved my wrist.\n\npbc\n\n"
    },
    {
      "time": "12 Feb 2008 — 7:05pm",
      "content": "I use the 6 x 8 Intuos.  \nThe only problem I had when I got it was the cumbersome (to me) stylus, the \"Grip\" pen, that came as standard.  \nPresumably they did some market research before they came up with it, but to me it was like using a kid's crayon.  \nYou may prefer the more slender \"Classic\" pen, which has more the barrel width of a normal pen or pencil.\n\nWhat do other people think of stylus barrel width?\n\n"
    },
    {
      "time": "12 Feb 2008 — 8:25pm",
      "content": "I don't mind the kindergarten pencil grip pen - pretty used to it - I got one of the metal ones at one point and that didn't work for long - I hate the click button so mine is just gone - one of the nice things about the metal pen was that you could remove the button and replace it with a grip that had no hole in it.\n\nI have gone through a few and I must say I prefer the grip to the classic.\n\npbc\n\n"
    },
    {
      "time": "12 Feb 2008 — 9:08pm",
      "content": "What would be quite nice would a second input for the tablet, so it could be used parallel to a mouse. Well, at least to those few of us who have a tablet on the left and mouse on the right.\n\nI'd have to say that I am the only tablet user I associate with that hasn't transitioned to using the tablet as the primary input. Most seem to use it for all tasks, after a few-week acclimation.\n\n[C](http://web.archive.org/web/20131018102357/http:/www.chozcunningham.com/) [!](http://web.archive.org/web/20131018102357/http:/www.exclamachine.com/) [.~](http://web.archive.org/web/20131018102357/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "12 Feb 2008 — 9:19pm",
      "content": "You probably know this, but learning the keyboard shortcuts definitely help lessen the repetitive motion problems. I have gone through touch-pads (my favorite, but got a sore finger tip), trackballs (sore thumb from left-clicking with it), mice (numb back of hand), and now use a Wacom tablet, and like it just fine. It came with a mouse, and I occasionally use it for a change of pace.\n\n"
    },
    {
      "time": "13 Feb 2008 — 11:11am",
      "content": "I use the Wacom Intuos 3. Since I work in Photoshop with handlettering/calligraphy a lot, its great for cleaning up lettering. I would find it hard to do with a mouse. The mouse that comes with the tablet is great for navigating the web and such. Before I upgraded my FontLab, I found the pen a little too sensitive, but seems to work fine in FL5.\n\nStephen\n\n"
    },
    {
      "time": "14 Feb 2008 — 6:28pm",
      "content": "My digitizer (4 keys) acts just like a mouse, you just have to keep it on the tablet. Wacoms website has no less than 13 pens for the intuos, with different grips.  \nThe Truth shall set you free\n\n"
    },
    {
      "time": "14 Feb 2008 — 7:32pm",
      "content": "I read somewhere that Graphire and Bamboo tablets tend to lag ¿Is it true?\n\nHéctor\n\n"
    },
    {
      "time": "15 Feb 2008 — 9:27am",
      "content": "I still am confused by the name of that company. Is it pronounced \"whack'em\", \"walk'em\", \"way-calm\", or what?\n\n"
    },
    {
      "time": "15 Feb 2008 — 10:01am",
      "content": "WAY COM\n\n"
    },
    {
      "time": "15 Feb 2008 — 11:04am",
      "content": "_I read somewhere that Graphire and Bamboo tablets tend to lag ¿Is it true?_\n\nA while back, under heavy multitasking, in windows 2000, on a 1.3 GHz Athlon with 1 GB ram, I'd have to say no, not at all. Unless everything was lagging. But I think that tables can get a reputation for that when people overload their computers with crazy-complex photoshop brushes - which lag with a mouse, too.\n\n[C](http://web.archive.org/web/20131018102357/http:/www.chozcunningham.com/) [!](http://web.archive.org/web/20131018102357/http:/www.exclamachine.com/) [.~](http://web.archive.org/web/20131018102357/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "16 Feb 2008 — 6:34am",
      "content": "Re pronunciation - I phoned the customer service line once and the guy on the other end pronounced it \"WAH-com\".\n\n- Lex\n\n"
    },
    {
      "time": "16 Feb 2008 — 7:32am",
      "content": "dohp ! thanks for the correction lex... funny thing is  \ni've been on the phone w/ them too and they didn't correct me.\n\ntomahto tomayto ?\n\n"
    },
    {
      "time": "16 Feb 2008 — 7:56am",
      "content": "You just reminded me of a classic Walken monologue from SNL :-)\n\n- Lex\n\n"
    },
    {
      "time": "16 Feb 2008 — 8:07am",
      "content": "<cite>I read somewhere that Graphire and Bamboo tablets tend to lag ¿Is it true?</cite>\n\nI think that notion is a result of users who only have the budget for the inexpensive tablets also having inexpensive computers. Photoshop and any version of Painter pre-IX are not friendly to the RAM-impaired. Learning to use GIMP usually fixes this problems.\n\n"
    },
    {
      "time": "16 Feb 2008 — 2:11pm",
      "content": "Christopher Walken: Thank you. It’s good, as always, to be here. It’s a treat. But this time, it’s extra special because it’s the final show of the season. After how many shows, Jimmy? 505, actually. 505, Wow! I've done it five times - what's that? A drop in the bucket. So I thought, \"What can I do to make my mark?\" And then, I thought, \"Well, I'll sing a song.\"\n\nsinging\n\n\"Things have come to a pretty pass  \nOur romance is growing flat  \nFor you like this and the other  \nWhile I go for this and that  \nGoodness knows where the end will be  \nOr I don't know where it's at.  \nIt looks as if we two will never be one  \nSomething must be done.  \nYou say potato, and I say potato  \nYou say tomato, and I say tomato  \nPotato, potato  \nTomato, tomato  \nLet's - \"\n\nJimmy Fallon: Chris?\n\nChristopher Walken: Jimmy, wazzup!\n\nJimmy Fallon: Sorry to interrupt. I don't know if that's how the song goes.\n\nChristopher Walken: What do you mean?\n\nJimmy Fallon: You're singing the words the same. You have to say, likw, tomayto, tomahto. Tomahto, potahto.\n\nChristopher Walken: Tomahto? What's that?\n\nJimmy Fallon: It's just how they say it.\n\nChristopher Walken: Okay, I'll give it a try.\n\nsinging\n\n\"You say potahto, I say potahto  \nYou say totahto, I say totahto  \nTomahto, potahto  \nPotahto, potahto, tomahto, tomahto -\"\n\nJimmy Fallon: Chris, I'm so sorry. You're doing it the other way now. And I think you have to alternate them.\n\nChristopher Walken: Alternate, shmaltermate! Jimmy, look, they're all spelled the same on the cards. What do you want from my life?\n\nJimmy Fallon: I think you're supposed to go - potayto, potahto..\n\nChristopher Walken: Jim, how old are you?\n\nJimmy Fallon: I'm 26.\n\nChristopher Walken: Ouch! Look, son.. sometimes you just gotta do what you gotta do. Let me show you. And a-one, and a-two -\n\n"
    },
    {
      "time": "17 Feb 2008 — 7:50am",
      "content": "This was actually the original reason I got a graphics tablet. (Well, I didn't technically have tendonitis, but my wrists always hurt.)\n\nI'm not certified in any way in ergonomics, but I've read _a lot_ about it. Mice are absolutely terrible for your hands, much worse than keyboards, (I can give you dozens of studies that support this.) and one study referenced in a textbook I read showed essentially that graphics tablets were on average the best of any pointing input device in terms of usability and posture and almost as easy to use as a mouse. I find it easier to use than a mouse.\n\nThere are some alternative mice out there that are better in general but put a lot of strain on the thumb muscles. This includes joysticks and the Gyration mice. The AerO2bic mouse looks really good and simple. It's expensive though. I've seen some touchscreen desks, and they look awesome, but they're still outrageously expensive.\n\nMy general recommendation is get as many different styles of pointing input device as you have space for them on your desk, one of which should be a graphics tablet, and use whichever one you feel like using.\n\nIf you're also considering getting a better keyboard, check the [altkeyboards Yahoo! group](http://web.archive.org/web/20131018102357/http:/groups.yahoo.com/group/altkeyboards/).\n\n"
    },
    {
      "time": "15 Apr 2008 — 2:37pm",
      "content": "Received my Wacom tablet today and fund myself instantly comfortable with it, great response and all.\n\nThe only pet pevee would be the USB cable has to be connected on the top side so it collides with the keyboard.\n\nHéctor\n\n"
    },
    {
      "time": "15 Apr 2008 — 2:48pm",
      "content": " ![](http://web.archive.org/web/20131018102357im_/http:/typophile.com/files/desktopsetup_5430.jpg)\n  \nI work with the keyboard and monitor bang in front, and the tablet to the right of the keyboard.  \nThe desk is L-shaped. X is where my elbow is. \n"
    },
    {
      "time": "15 Apr 2008 — 2:57pm",
      "content": "<cite>What do other people think of stylus barrel width?</cite>\n\nSame. My first experience was with the classic (slender barrel) stylus at work. Instantly comfortable with the tablet. Loved it.\n\nBought a tablet for home and got the big fat crayon stylus. Disappointed.\n\n1 1/2 year-old daughter bit the trigger out of the crayon stylus and I was delighted to find you can still order the classic stylus.\n\nI recently converted to a standing work station and I cannot imagine ever sitting for 8 hours a day again. Using the stylus and keyboard at belly-button height is perfectly comfortable, and in fact allows for a little exercise when the toes start tapping and the hips start swaying to the ever-surprising iTunes shuffle!\n\nOh yeah...I do get that rub on the wrist bone, but it's mildly comforted by a mouse pad...the top of the tablet is propped up by a an old 5/8\" thick book to achieve the most natural writing angle for me.\n\n"
    }
  ]
}
