{
  "id": "41938",
  "title": "Compact legible typeface for tv interface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi, i'm looking for typefaces for a television interface. Legibility is of course important but it's almost as important that it's a space saver for use in EPG:s (the table with different programmes in your digital tv interface).\n\nI have two so far that looks interesting and wanted to check if anyone out there has experience from something similar or just know faces that are optimized for (tv)screen-use.\n\nThe one i'm the most interested in at the moment is Clearview that have some condensed styles.  \n [http://www.terminaldesign.com/fonts/sets/?CID=4](http://web.archive.org/web/20131023140339/http:/www.terminaldesign.com/fonts/sets/?CID=4 \"http://www.terminaldesign.com/fonts/sets/?CID=4\")\n\nMonotype Screen looks ok as well but no condensed styles  \n [http://www.monotypefoundation.org/ProductsServices/tv\\_fonts.aspx](http://web.archive.org/web/20131023140339/http:/www.monotypefoundation.org/ProductsServices/tv_fonts.aspx \"http://www.monotypefoundation.org/ProductsServices/tv\\_fonts.aspx\")\n\nCheers\n\n",
  "author": "frequencies",
  "time": "11 Feb 2008 — 6:46am",
  "uid": "27019",
  "comments": [
    {
      "time": "11 Feb 2008 — 7:19am",
      "content": "Not exactly the same thing but worth a read - [http://screenfont.ca/](http://web.archive.org/web/20131023140339/http:/screenfont.ca/ \"http://screenfont.ca/\") if you've not seen it already.\n\n"
    },
    {
      "time": "11 Feb 2008 — 12:13pm",
      "content": "I appreciate my esteemed colleague’s plug for my site, but TV-interface fonts have to be hacked and dug out so much to be legible on NTSC it’s not funny. I don’t know of any off-the-shelf fonts that work well in those conditions, unless the fonts are huge, but that’s a different story. (So is HDTV.) Chyron etc. fonts are custom-mangled so they look vaguely legible onscreen.\n\nCan you tell us more about your application?\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20131023140339/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "11 Feb 2008 — 2:07pm",
      "content": "\\>but TV-interface fonts have to be hacked and dug out so much to be legible on NTSC it’s not funny.\n\nJoe is correct. Unless you want to burn through a ton of cash I’d suggest going custom and working with a good local type designer who can readily get access to a test rig. I was involved in an NTSC TV font project (practically no budget) a few years ago, and there was a lot of test and tweak, retest and tweak, rinse, repeat – having a designer available for site visits was invaluable. Basically we started by trying different weights of our fonts until we found the ones that performed best, then adjusted the spacing, character shapes and counter shapes until we got the best results. Finally applied some hints to edge out some artifacts.\n\n"
    }
  ]
}
