{
  "id": "4194",
  "title": "Licensing fonts embedded in applications",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I've received an inquiry from a small developer who wants to embed one of my commercial fonts in an application he's developing. He says that the font won't be accessible for printing or use outside the application--it would just be used for interface elements. If anyone has dealt with this kind of thing before, I would love to get some advice. My standard license doesn't cover this kind of thing (yet).\n\n",
  "author": "Mark Simonson",
  "time": "8 Apr 2004 — 12:57pm",
  "uid": "1043",
  "comments": [
    {
      "time": "8 Apr 2004 — 1:49pm",
      "content": "Well, then what do you do with Flash? You can easily zoom in a Flash movie with characters smaller than 150x150 pixels...\n\n"
    },
    {
      "time": "8 Apr 2004 — 1:58pm",
      "content": "In this case, it's not a multimedia kind of thing, so I don't think the House EULA is relavent. The size the fonts would be used would be smallish--12 to 18 pixels roughly.   \n   \nI have also found out that it would be possible (though probably not easy) to extract the font(s) from the application. Or, at least not possible to prevent extraction entirely (similar to the situation with PDF).\n\n"
    },
    {
      "time": "8 Apr 2004 — 2:47pm",
      "content": "Mark, figure out how extractable the font would be. For example, Shockwave is unsafe, while Flash and PDF are pretty safe. Charge them an extra amount based on that level of security.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2004 — 3:21pm",
      "content": "Hrant--Good idea. I'll check.\n\n"
    },
    {
      "time": "9 Apr 2004 — 9:04am",
      "content": "Mark,   \n   \nI invented an Embedded Electronic Device license for just this purpose.   \n   \nI have been regularly contacted by companies who want to make slot machine interfaces with my fonts (aka gaming devices) so I came up with a seperate license for this purpose.   \n   \nThe main clause in this license states the font used must be protected and NOT be reverse engineerable or extractable from the electronic device.   \n   \nI define an electronic device as as a kiosk, gaming device, portable electronic device, etc. with no other restrictions beyond the normal scope of licensing.   \n   \nIn some cases you can base the license fee on number of estimated or real SKUs being distributed with your font(s) on 'em. You can make this an annual license.   \n   \nIn most cases they prefer not to disclose these numbers so you'll most likely need to do a one time buyout license of the font for this use for ONE title. (eg. Can use for Pac Man but not Ms. Pac Man)   \n   \nStuart :D\n\n"
    },
    {
      "time": "9 Apr 2004 — 10:59am",
      "content": "Hi,   \n   \nWe're doing a workshop on the subject of type designers working with software companies at TypeCon this year. Jim Wasco from AMT and I will be leading it, and we're certainly going to be touching on this issue.   \n   \nSecurity is certainly the key here, you should expect to be paid more if your font is a system-wide resource as opposed to it being locked into the application.   \n   \nHowever securing the font is not completely straight forward. You want to ask the customer if the font is going to be supplied as a TrueType or in some derivative format - having it in a non-standard format would make it much harder to re-use. If it's going to be a TTF even if the font is privately installed it is still theoretically possible for it to be snagged. On Win 9x a privately installed font has to exist on the hard-disk somewhere as a file. In more recent versions of Windows it can exist in memory. All of this protection is a bit of a waste if the font itself can be easily extracted from the installation package prior to install.   \n   \nI would get details of the protection written into the contract, and have some clause that would pay-out if the fonts were found to be extractable. That way the customer is putting some money behind their assurances.   \n   \nIt's important not to get into side-tracked by embedding permissions - the OpenType and earlier TrueType specification make it completely clear that these relate to 'document' embedding. If someone tries to tell you they can embed your font into their application based on the embedding bits set in your retail fonts point them at the specs, and send them to me.   \n   \nHope this helps.   \n   \nCheers, Si\n\n"
    },
    {
      "time": "9 Apr 2004 — 12:08pm",
      "content": "Thanks everyone for the suggestions. I've made a special arrangement with the developer to include specific wording in his license for the application which explains that the font(s) may only used with the application and where to obtain a license for other use. The font(s) themselves will also include similar information. As he explains it, it's really impossible to protect a font absolutely from being extracted, but it's also not obvious or trivial to do so. The audience for the application is rather small, so I'm not too worried about it.\n\n"
    },
    {
      "time": "8 Apr 2004 — 1:17pm",
      "content": "Good question. I'm curious too.   \n   \nHouse Industries' EULA states:   \n   \n**Web/Video/Televsion/Multimedia Restrictions** Web use is unrestricted in applications under 150 x 150 pixels. Applications over this size will be priced on an individual basis.\n\n"
    },
    {
      "time": "8 Apr 2004 — 1:56pm",
      "content": "For fonts licensed from House Ind. you'd have to obtain a separate license. So I assumed you would call them before purchasing a basic licensed font off their site. I posted that as an example for Mark, not to change the subject. Sorry.\n\n"
    },
    {
      "time": "8 Apr 2004 — 2:05pm",
      "content": "Right. I guess once you've \"rasterized\" the typeface it is no longer ... really ... a font software.   \n   \nEmigre is pretty clear on how they feel about embedding for multi-media too.\n\n> * * *\n> **quote:**\n> \n> Can I embed fonts into digital documents?   \n> Web sites and CD-ROM titles may feature bitmap images made using our fonts, but the fonts themselves may not be distributed. Embeddable font formats require the duplication of the fonts and thus seriously compromise the security of typefaces. The Emigre license excludes font embedding, except as described in the Embedding License Addendum. This addendum allows restricted distribution of portable digital documents in Adobe Acrobat PDF format under specific circumstances.   \n>    \n> Distributing copies of a printed document is not the same as distributing copies of a digital document with embedded fonts. The latter also distributes live fonts, which add value to the digital document by making it more useful, flexible, and cheaper to distribute than a traditional printed document.   \n>    \n> Unfortunately, currently available embedding technologies, which incorporate live fonts into web pages and digital documents, do so by jeopardizing the security of the fonts. This is largely due to the fact that developers of these technologies have little or no vested interest in protecting the intellectual property of independent font developers. Before allowing such usage of their fonts, font developers want to be certain that encryption of the embedded fonts is secure enough to prevent unauthorized access or use.   \n>    \n> We can only hope that this situation will improve in the future. If not, independent font developers, who depend on the sales from their fonts, will find it increasingly difficult to invest in the development of new designs.\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n\n"
    }
  ]
}
