{
  "id": "4197",
  "title": "(x) Shangai, 1935 (Indiana Jones titles) - Steile Futura/Tasse {Marc O}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello,   \n   \nJust wondering if any of you knew what this was. The movie was released in 1984 (Temple of Doom). It's from the titles. Is there a suitable digital version around? I don't think it's related to the this post for the type on the poster. But I wanted to be thorough and check. Here's a link to that old post:   \n   \n [http://www.typophile.com/forums/messages/83/13951.html](http://web.archive.org/web/20050518124543/http:/www.typophile.com/forums/messages/83/13951.html)   \n   \n Any help appreciated ![:-)](http://web.archive.org/web/20050518124543im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n ![](http://web.archive.org/web/20050518124543im_/http:/www.typophile.com/forums/messages/83/32993.jpg)\n\n",
  "author": "jamiegareth",
  "time": "Thu, 2004-04-08 20:58",
  "uid": "1797",
  "comments": [
    {
      "time": " Thu, 2004-04-08 22:21",
      "content": "It looks like a cousin of Steile Futura, Tasse (Font Bureau) or Topic (URW). A quick check at MyFonts didn't turn up that alternate N for any of those faces, though.   \n   \nAnother, more recent face along the same lines is Emigre's Solex\n\n"
    },
    {
      "time": " Fri, 2004-04-09 05:46",
      "content": "I think you were right about Tasse Marc, because it does have an alternate N like this, and an alternate rounded A. You can see the N and A [here](http://web.archive.org/web/20050518124543/http:/www.fontbureau.com/fonts/font_frames.tpl?cart=10663172097593320&fontname=Tasse) in the words \"COMMUNITY OUTRAGED\". It is shown more clearly in the Font Bureau Type Specimens book. While Solex has an S like this, it has neither the N nor the A.   \n   \nOf course, this has been slanted graphically, since Tasse has no oblique face.\n\n"
    },
    {
      "time": " Fri, 2004-04-09 06:58",
      "content": "Both Tasse and Solex were created long after this movie was released. The inspiration for both of these was Steile Futura/Topic (both are names of the same Bauer foundry face) which had these alternate characters in the roman styles. It appears that the alternate characters were not included in the existing dital versions.   \n   \nInteresting that they used a face released in the mid-fifties for a film set 20 years earlier.\n\n"
    },
    {
      "time": " Fri, 2004-04-09 12:24",
      "content": "Thanks for the information everyone. Mark, I saw your page on type in film, so I know how you notice these things. Their choice is interesting indeed!\n\n"
    },
    {
      "time": " Fri, 2004-04-09 18:04",
      "content": "Thought I'd mention that Dieter Steffmann digitized [Topic](http://web.archive.org/web/20050518124543/http:/www.moorstation.org/typoasis/designers/steffmann/samples/t/topic.htm), including a bold, alts and alts bold. He seems to have produced a compressed version, though, as this image (using the alts bold font) shows:   \n ![](http://web.archive.org/web/20050518124543im_/http:/www.typophile.com/forums/messages/83/33067.gif)\n\n"
    },
    {
      "time": " Fri, 2004-04-09 22:49",
      "content": "Wow, thanks for the information Mike! When uncompressed, and skewed a bit, it matches almost perfectly. And it's inexpensive too! ![:-)](http://web.archive.org/web/20050518124543im_/http:/www.typophile.com/forums/clipart/happy.gif) Here's a rough comparison with the original:   \n   \n ![](http://web.archive.org/web/20050518124543im_/http:/www.typophile.com/forums/messages/83/33087.jpg)\n\n"
    },
    {
      "time": " Sat, 2004-04-10 01:29",
      "content": "Kinda sorta. Glad it was useful.   \n   \nMark, I'd always thought that Futura Display was just another name for Steile Futura/Topic,   \nbut [these fonts](http://web.archive.org/web/20050518124543/http:/www.myfonts.com/fonts/ftbauer/futura-display/familytree.html) by that name are quite different. An entirely different typeface?\n\n"
    },
    {
      "time": " Sat, 2004-04-10 01:46",
      "content": "Oh.\n\n"
    },
    {
      "time": " Sat, 2004-04-10 06:53",
      "content": "Same designer, different typeface. It's funny, I'd never noticed the similarities between Futura Display and Steile Futura/Topic before. I think this was because I only knew it as Bauer Topic for a long time and didn't know Renner did it. Incidentally, Futura Display was released in 1932.\n\n"
    },
    {
      "time": " Sat, 2004-04-10 10:15",
      "content": "I guess it was a stupid question to ask if these were different typefaces.   \nWhat I really was after was the relationship between them, given the   \nclear similarities.   \n   \nThanks for the info, Mark.\n\n"
    },
    {
      "time": " Sat, 2004-04-10 14:04",
      "content": "Yves, I don't I deserve the ID on this one. At best, include me in a group with the Mikes and Mark S.\n\n"
    }
  ]
}
