{
  "id": "41995",
  "title": "Logo for my personal tech site",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I built a site a couple months back, and wish I had found this site before I was done. I would appreciate some feedback on the logo I made for my site:\n\n ![](http://web.archive.org/web/20081008043235im_/http:/www.typophile.com/files/wwjdl_5335.gif)\n\nI wanted something clean and sharp that could be used in a variety of ways; printable, over complex backgrounds, possibly on t shirts & other mediums, looks good in black & white as well as other variations that include multiple colors. I also want to be able to add it to a new background image for the site to easily create a different look (sorta like the backgrounds on MTV’s website)\n\nHere is a screenshot of how I’m using it as the logo currently.\n\n ![](http://web.archive.org/web/20081008043235im_/http:/www.typophile.com/files/wwjdl2_6679.gif)\n\nPlease, let me know your thoughts on this. I think it’s the first logo I’ve made that isn’t crappy.\n\n [‹ Yet another Logo](http://web.archive.org/web/20081008043235/http:/www.typophile.com/node/42443 \"Go to previous forum topic\") [Logo Critique : Microspective Multimedia ›](http://web.archive.org/web/20081008043235/http:/www.typophile.com/node/42400 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081008043235/http://www.typophile.com/user/27071\" title=\"View user profile.\">ewker</a>",
  "time": "<br>",
  "uid": "27071",
  "comments": [
    {
      "time": " 13.Feb.2008 9.45am",
      "content": "The concept doesn’t work, sorry its forced. Its not clear where you are going with this,\n\n"
    },
    {
      "time": " 13.Feb.2008 12.43pm",
      "content": "Are you being sincere or ironic? I’m not trying to be obnoxious, but I honestly can’t tell.\n\nFrom a purely aesthetic perspective, I find the question mark to be very odd - it doesn’t look like a question mark, and is encroaching on the L. The huge pixelated arrow in the background is competing in space with the second “W”, and the first Ws of each line are also competing with each other in a distracting way. The “wnload” in color and style reminds me of Howard Dean’s campaign materials from a few years ago, which is probably not what you’re intending. Instead of the font & image mashup you have here, I’d stick with one font for the WWJDL, and one for for the “What would Jesus download”, the latter being in sentence case and italics. Then you can use color to set off the “wnload” if you need to, although that just hits you over the head with the joke (which is why this reads as parody to me).\n\n"
    },
    {
      "time": " 13.Feb.2008 9.32pm",
      "content": "I think this logo needs a hook. The WWJDL is too long. The WWJD sounds better. Download is one word anyway – or should be. Something like this...\n\n“The human brain is unique in that it is the only container of which it can be said that the more you put into it, the more it will hold.  \n” Carl Sagan\n\n ![](http://web.archive.org/web/20081008043235im_/http:/www.typophile.com/files/jesus_3728.jpg)\n\n"
    },
    {
      "time": " 13.Feb.2008 9.39pm",
      "content": "I like logosam’s suggestion.\n\n"
    },
    {
      "time": " 13.Feb.2008 10.33pm",
      "content": "I think it’s cute, but the question mark stands out immediately as being off. I don’t agree with losing the L, as that will only confuse people when navigating to the site at [www.wwjdl.com](http://web.archive.org/web/20081008043235/http:/www.wwjdl.com/ \"www.wwjdl.com\")\n\n"
    },
    {
      "time": " 14.Feb.2008 9.28am",
      "content": "I say he has a writing issue. WWJD (What Would Jesus Do?) is so well established that the viewer has to read the mark as this first, then back up and try and figure out why the L is there. I don’t know a synonym for download—Rip?\n\nOn another note, I suspect you are in somewhat of a backlash against this whole concept. After “What Would Jesus Drive?” and “Who Would Jesus Bomb?” I think we’ve all had about enough of this deific speculation.\n\n"
    },
    {
      "time": " 21.Feb.2008 9.03pm",
      "content": "Well, from a quick glance at your website, it’s clear you’re not being ironic. Unfortunately, I think that your branding is off the mark; namely, it doesn’t reflect the same intention as the other “WWJ\\*” messages. What Would Jesus Do / Drive and Who Would Jesus Bomb both intend to make the listener apply a critical eye to his/her attitudes or behavior in regard to personal conduct, choice in vehicle or political opinion about military violence. Do you intend to have people question their internet usage? I suspect not, since your site seems like some sort of Christian portal. Let me know if I am off the mark here. Also, I want to second jupiterboy’s observation that DL strays too much from the expected 4 letter abbreviation.\n\nAs a result, although this may be slightly off topic or out of line, I suggest your reconsider your branding concepts behind the creation of your ID. It is my view that, in fact, this is the most confounding factor in your process. Since your starting point is unclear, I can’t see how your ID could clearly express an unclear idea. (Or the only thing that will be clear is that your idea is unclear ... but I digress).\n\n"
    },
    {
      "time": " 27.Feb.2008 8.58pm",
      "content": "I think he’s hit the nail on the head. I like the “?” and the “DL” that reference downloading. I like the font selection and stroke, but I would do something slightly different with the “DL” to drive home the point. Maybe an outline, different color or try making it slightly smaller than the “WWJ”?\n\nMaybe just try that with the “L”.\n\n=====  \n [http://goscreative.com](http://web.archive.org/web/20081008043235/http:/goscreative.com/ \"http://goscreative.com\")\n\n"
    }
  ]
}
