{
  "id": "42007",
  "title": "Take a look at my logo and give your opinion.",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,\n\nI’m a graphic designer and I am working on an identity for my company. I just started with my logo and I would be very happy if you good give some feed back.\n\nThe name of the company is Westvierzes. That means West For Six / Westforsix. That is a combination of the name of the street and my house number. So Westvierzes is nothing more than a geographical point on the map from were I work. A starting point from were I develop communication solutions. My clients are mainly communal /governmental, television and diverse.\n\nI want to be my logo:  \nclear, friendy and a good mix between trendy and timeless (don’t know if this is the right word in english, but I mean the opposite of trendy)\n\nThe first designes are in black. In a later stadium I am going to choose colors.  \nIn option A I combine the 4 and the 6 into one shape. To my it looks like a road and that I like.  \nOption B and C are two variations with an arrow. In option C it works as a flag.\n\nMy favourite is B because of the simplicity.\n\nPlease give your reaction. Thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [Westvierzes.jpg](http://web.archive.org/web/20081007002655/http:/typophile.com/files/Westvierzes.jpg) | 63.27 KB |\n\n [‹ logo for graphic design 4](http://web.archive.org/web/20081007002655/http:/www.typophile.com/node/42617 \"Go to previous forum topic\") [Critique: Wine Merchant Logo ›](http://web.archive.org/web/20081007002655/http:/www.typophile.com/node/42069 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007002655/http://www.typophile.com/user/14995\" title=\"View user profile.\">west_46</a>",
  "time": "<br>",
  "uid": "14995",
  "comments": [
    {
      "time": " 12.Feb.2008 12.50pm",
      "content": "I dig C, just because I’m a sucker for Vista Sans. Nice customization, too. Will the “road” from A work with C’s type?\n\nGood luck.\n\n"
    },
    {
      "time": " 12.Feb.2008 12.52pm",
      "content": "I feel like I’ve seen that triangle mark before, oriented with the base at the bottom.\n\n"
    },
    {
      "time": " 12.Feb.2008 4.56pm",
      "content": "<cite>I feel like I’ve seen that triangle mark before, oriented with the base at the bottom.</cite>\n\nI’m thinking the [Triforce](http://web.archive.org/web/20081007002655/http:/en.wikipedia.org/wiki/Triforce) of Zelda fame.\n\nAs for the logo, my initial thoughts are in line with microspective’s comment. I like the mark on A and the type on C. Just A is too modern, but mixing the two might have a good balance.\n\n"
    },
    {
      "time": " 12.Feb.2008 5.01pm",
      "content": "I’m not getting any feeling or meaning from any of these—they are just slick type treatments. You have a good story behind your business name, why aren’t you using that as the basis of the logo?\n\n"
    },
    {
      "time": " 12.Feb.2008 5.21pm",
      "content": "Nice style. Maybe too stylish to be “timeless.” I feel like I might get tired of those fonts in a year or two. The type in option C seems to be the most versatile.\n\nIn option A I like the 4 and 6, but I didn’t read it like that. It has potential to be a very attractive logo. I would continue to explore that logo but I would find another typeface.\n\nIn option B (sorry this is a bit scattered, just thinking and writing), I think the dynamic of the offset type is very interesting.\n\nOverall nice work. Good dynamic in the composition.\n\n"
    },
    {
      "time": " 13.Feb.2008 7.28am",
      "content": "Thanks for your reaction. I am going away for a few days and get in contact with you next week.\n\n"
    },
    {
      "time": " 27.Feb.2008 7.05am",
      "content": "Hi again,  \nI decided to concentrate on option A. Like I said before it’s a 4 and 6 combined into one shape. Maybe you can not read it like that but to me it looks attractive. And to me it also looks like a microscopic part of a road map. And I like that idea. I did some research on the 46-sign. Later I want to look to type and color.\n\nPlease give your reaction. Thanks\n\n ![](http://web.archive.org/web/20081007002655im_/http:/www.typophile.com/files/W46_5926.jpg)\n\n"
    },
    {
      "time": " 27.Feb.2008 5.46pm",
      "content": "At five through eight, I think you may hear from the Anti-Defamation league.\n\n"
    },
    {
      "time": " 28.Feb.2008 1.31am",
      "content": "@ Scalfin: Yes 5-8 are dangerous. I am not going to use them.\n\nI took the last variation to develop it further.\n\n ![](http://web.archive.org/web/20081007002655im_/http:/www.typophile.com/files/W46-2_5016.jpg)\n\nPlease give your comments. Is it friendly enough, how is the balance between timeless and trendy? Do you like type and color?\n\nHow about this variation? To much?\n\n ![](http://web.archive.org/web/20081007002655im_/http:/www.typophile.com/files/W46-3_3417.jpg)\n\n"
    },
    {
      "time": " 28.Feb.2008 5.32am",
      "content": "Not much reaction yet...?\n\nNew upload. Any ideas or feedback...\n\n ![](http://web.archive.org/web/20081007002655im_/http:/www.typophile.com/files/W64-4_6362.jpg)\n\n"
    },
    {
      "time": " 28.Feb.2008 6.10am",
      "content": "I think your last one is probably your strongest one (one with just part of the ’46’ orange). Looks pretty strong to me. I think the way the inner line curves out at the top of the 4 could use some minor tweaking. I think it should follow the curve just right of it a little more.\n\nOn second thought those inner lines may get lost at smaller sizes. maybe make them a little thicker.\n\n"
    },
    {
      "time": " 28.Feb.2008 2.43pm",
      "content": "Try making the 4/6 distinction more obvious by only having the double lines in areas both numbers are present.\n\n"
    },
    {
      "time": " 28.Feb.2008 6.11pm",
      "content": "Or use the orange to highlight the 6 or 4? It’s getting a lot closer to something awesome.\n\nI do not like the orange and grey combo - seems the opposite of timeless. But color really isn’t as important as developing the shapes, IMO... color swaps are easy. :)\n\n"
    },
    {
      "time": " 29.Feb.2008 2.13am",
      "content": "@tylor.reimer: I did some tweaking. Better?\n\n@eeblet: You are right about the color. I did ad color in this stadium because the logo sign looked a little harsh in black and I wanted to have an impression how it works in color. I go back to black.\n\n@Scalfin: I made some variations, but somehow it is less dynamic. I don’t know it’s an improvement. Is it important that you can read 46? I prefer A3 or D12.\n\nThanks so far for your reactions. Helps a lot. Hope you keep responding.\n\n ![](http://web.archive.org/web/20081007002655im_/http:/www.typophile.com/files/W64-5_5699.jpg)\n\n"
    },
    {
      "time": " 29.Feb.2008 6.12am",
      "content": "Oké the type. I started with the idea of using Vista Alt. Because I really like the W in it. But I have my doubts about the E and S. Three E’s and two S’s in the name, so they are important for the wordimage (?is that english?) I tried other fonts and came to three other options; Helvetica Neue, Frutiger and Interstate. I prefer Frutiger. Nice T, S and E but the W I find less than the Vista W.\n\nWhat is your opinion? Wich font fits best with the logo sign? (Like I said before I want it to be clear, friendy and a good mix between trendy and timeless) Do you have other suggestions? Really like to hear it.\n\n ![](http://web.archive.org/web/20081007002655im_/http:/www.typophile.com/files/W46typo1_4335.jpg)\n\n"
    },
    {
      "time": " 29.Feb.2008 6.31pm",
      "content": "I meant something like this (this is a five minute attempt).\n\n ![](http://web.archive.org/web/20081007002655im_/http:/www.typophile.com/files/46_6656.jpg)\n\n"
    },
    {
      "time": " 5.Mar.2008 6.58am",
      "content": "I think a font like trade gothic (maybe bold condensed) would fit the icon better. The fonts you are using now don’t match the icon. Maybe try making the icon smaller in relation to the type.\n\nAttached is a revised icon that may make more sense using the w and v.\n\n ![](http://web.archive.org/web/20081007002655im_/http:/www.typophile.com/files/w3_6555.gif)\n\nTom\n\n"
    },
    {
      "time": " 5.Mar.2008 7.08am",
      "content": "I would like to see this idea in a more lose version. I know that the idea is linked to looking like a street, but I think it could be stronger if it wasn’t so rigid (although my logo is rigid). Right now all the versions look like an airline logo. The version I attached may look good as brush strokes.\n\nTom\n\n"
    }
  ]
}
