{
  "id": "4201",
  "title": "Who could convert a font into an open type font",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Dear typography gurus,   \n   \nI am new to this goroup and a bit out of my league here, that is pretty obvious as I read some of the postings, so this must be the right crowd to turn to for much needed advice.   \n   \nI am a studio manager for a medium sized Advertising agency based in Amsterdam. As with most Studios, we are seriously considering making the switch to InDesign. For now, one of the most compeling reasons to do this is that a very large multinational client of ours suffers when their materials are converted from English Masters to local masters as the typographical attention we give to the materials is often lost when the text is simply translated and pasted back into a layout by a local agency which often strips away any of the typographical adjustments we have made. The worst results are when our mac based fonts are repaced by PC fonts which even in a straight conversion of the English Masters results in unwanted line breaks and terrible kerning.   \n   \nI have heard that open fonts will help solve this problem but where in the world would I have this corporate typeface converted into an open type font?   \n   \nThis particular client reproduces work throughout the world, in over 20 languages using at least three different versions of their font which seems like another strong reason why open type sounds so interesting to me even if we stayed with our current layout application.   \n   \nSo to make a very long question a bit shorter, where can I draw the line between the hype of the Adobe sales guys who are parading the open face type and InDesign flag and the reality of really having more creative control over the final products that are produced in over 60 countries? Would open type help? Where would I find a passionate typographer that would not only convert the current fonts but actaully improve it?   \n   \nAny help or advice would be grately appreciated!   \n   \nThank you,   \nJim\n\n",
  "author": "jim_bowes",
  "time": "Fri, 2004-04-09 02:40",
  "uid": "3403",
  "comments": [
    {
      "time": " Fri, 2004-04-09 04:30",
      "content": "There are a lot of people on this list who, like me, work with OpenType everyday. I for one would not call Adobe's enthusiasm for OpenType hype. A well-constructed, feature-rich OpenType font working together with InDesign is a beautiful thing.\n\n"
    },
    {
      "time": " Fri, 2004-04-09 08:19",
      "content": "Hi Jim,   \n   \nIt seems very much as if your workflow is busted, and this is what you need to fix. Certainly standardizing on a set of good, full-feature multilingual OpenType fonts and Adobe InDesign across your complete workflow, Windows and Mac, including the 'local agency', would be a good move, but there may be other ways to fix the problems.   \n   \nCertainly if the Adobe Sales guy or someone else is suggesting that getting a few OpenType fonts will magically solve your process problems, they are over-selling the fonts.   \n   \nAs you're dealing with sixty languages you're probably going to hit on more than a few that InDesign will have trouble with. You probably want to have Adobe help identify these and work out a process specifically around them. Likewise with the fonts themselves, you're probably not going to find a single OpenType family that supports all the languages your customer cares about.   \n   \nHope this helps,   \n   \nCheers, Si\n\n"
    },
    {
      "time": " Fri, 2004-04-09 08:49",
      "content": "It would be interesting and helpful to see the list of languages in question. On the plus side, InDesign supports more languages, better, than any other high-end DTP application. But it is still not a panacea for language support. For example, you're out of luck if you want to do any of the Indic languages (short of sticking an EPS or PDF into your InDesign layout).   \n   \nI just spent 40 minutes this morning (at 7 am, ouch!) in a teleconference with a major US newspaper chain discussing whether/when they should start moving to OpenType. I'm happy to discuss these sorts of things with our customers, including in public. OpenType isn't perfect (nothing is, really), but in most workflows it's an improvement, and often a very large one.   \n   \nAssuming you are also using InDesign and a Unicode-based text workflow, and that InDesign supports all the languages you need, at least some of your specific problems can be avoided by also using OpenType fonts. You can use the exact same font on both platforms, and your kerning and layout will be 100% identical on both Mac and Windows.   \n   \nRegards,   \n   \nT   \n   \nThomas Phinney   \nProgram Manager   \nFonts & Core Technologies   \nAdobe Systems\n\n"
    },
    {
      "time": " Fri, 2004-04-09 11:23",
      "content": "\\>a very large multinational client of ours suffers when their materials are converted from English Masters to local masters as the typographical attention we give to the materials is often lost when the text is simply translated and pasted back into a layout by a local agency which often strips away any of the typographical adjustments we have made.   \n   \nThis is disingenuous, and somewhat arrogant. The multinational is simply not prepared to pay for quality typography at the local level. To the multinational mentality, a single \"smart-software\" solution is preferable. Hence the crass uniformity of global culture, and the derogation of local culture.   \n   \nGood typography requires a discriminating human presence, and that can never be replaced by \"smart\" software.   \n   \nFor example, there is no way that Quark or InDesign will EVER be able to make truly smart quotes (\"Typographer's quotes\")! Stuff like \"rock 'n' roll\" will always fool it.\n\n"
    },
    {
      "time": " Sat, 2004-04-10 14:24",
      "content": "Greetings Jim,   \n   \nInDesign can handle most languages based on the Latin alphabet, plus CJK stuff. The ME version adds Arabic and Hebrew. For Indic, a good start is the latest version of (!) Microsoft Publisher. I get the impression that the 60 languages you're talking about are mostly Latin script, though.   \n   \nIf you have a set of custom corporate fonts, please feel free to contact me privately about OpenType conversion. ( [john@eccentrifuge.com](mailto:john@eccentrifuge.com)) If they were commissioned from a third-party designer, you will need that person's written permission up front.\n\n"
    },
    {
      "time": " Sat, 2004-04-10 14:27",
      "content": "Oh, another thing to note: InDesign supports existing Type 1 and Truetype fonts just fine. You can even use its fancy optical kerning on any font in any format.   \n   \nJust for kicks, set a block of text in something monospaced like Courier, and apply optical kerning. (!)\n\n"
    }
  ]
}
