{
  "id": "42013",
  "title": "Cyrillic, recommendations",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello everyone,\n\nYes, I am one of those people who have been reading typophile for a while, but post only when they need help. I guess I think I have nothing to contribute to a cool comunity like this one:). I promise i will try harder from now on...\n\nThe Project:\n\nI am designing a visual identinty for a really small nation (which I am part of) that is spread all over the world. We have a few small communities in Canada and they are my main focus group (Including every single Canadian to whom I have to explain who actually I am:). My main idea is to represent our history, culture, tradition, but finally in a very modern and “professional” way to represent who we are currently. I dislike websites and brochures with tons of text on irritating backgrounds (that sadly became a style) and I understand that text is important, but lets face it : “normal” (can’t find a better word) person is not going to be intrigued by this aproach. Fast, interesting, modern and fun presentation of my nation ( It even rhymes:).\n\nMethod of Attack:\n\nThe primary project is a flash website ( Huge image of a small room set in traditional style for a background and “jump” navigation to different parts of the room to represent different aspects of our nation). As a secondary project, I would also like to include some brochures, posters... for our presentations at “folk fests”.\n\nNeeded Resources:\n\nTwo Cyrillic typefaces (sans + serif), they would have to work well in white on dark valued backgrounds ( Is that a typographic element?) + I love the look of white type on a brown background. :) Of course, they have to work well together. Text and Display.\n\nI am also on a budget (read student), with really no way of explaining to certain people that “fonts” matter and that you are supposed to pay for them. Did I mention I am not getting payed for this either? :)\n\nCyrillic Univers (what do you think about this as my sans) ?\n\nPS I was warned (In really nice and funny context) by certain people that I should watch my spelling and writing style around here and I tried to the best of my knowledge (of English language) to follow this advice, again with the help of other certain people:)\n\n^ But I don’t know, you don’t look that scary to me:)\n\nThank you,  \nSebastian\n\n [‹ InDesign: How do you justify type up to a tab, not the end of the line?](http://web.archive.org/web/20080907043441/http:/typophile.com/node/43021 \"Go to previous forum topic\") [Alternative for Poplar ›](http://web.archive.org/web/20080907043441/http:/typophile.com/node/42878 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907043441/http://typophile.com/user/26703\" title=\"View user profile.\">ad_infinitum</a>",
  "time": "<br>",
  "uid": "26703",
  "comments": [
    {
      "time": " 12.Feb.2008 7.11pm",
      "content": "For the sans, [FF Din Pro](http://web.archive.org/web/20080907043441/http:/www.fontshop.com/fonts/downloads/fontfont/ff_din_pro/) is really handsome:\n\n ![](http://web.archive.org/web/20080907043441im_/http:/typophile.com/files/1_4038.png)\n\n ![](http://web.archive.org/web/20080907043441im_/http:/typophile.com/files/2_3747.png)\n\nAs for the serif, I’ve struggled with that question myself and would likewise be interested in what others have to say.\n\n"
    },
    {
      "time": " 12.Feb.2008 7.37pm",
      "content": "For the serif Cyrillic, you might consider [Agamemnon](http://web.archive.org/web/20080907043441/http:/typophile.com/node/41105).  \nYes, blatant self promotion on my part. (Is it possible to do self promotion on the part of someone else?) I would like to know if that section is worthy of further development, though.\n\n"
    },
    {
      "time": " 13.Feb.2008 9.57am",
      "content": "May I try to guess which small nation you exactly are from?\n\n"
    },
    {
      "time": " 13.Feb.2008 10.09am",
      "content": "Thank you for recommendations, I would still like to hear a lot more (serif typefaces especially). I was also thinking about FF Meta as a sans, although Din seems interesting too. Is there a Cyrillic Meta Serif?\n\n@aszszelp: Sure, It’s not a secret:) I will post a link to Wikipedia once you guess, so I don’t ruin whole quiz feeling:)\n\n"
    },
    {
      "time": " 13.Feb.2008 6.30pm",
      "content": "Since you said “really small nation”, I would guess Montenegro. My second guess would be Serbia. In either case, Zdravo! :) .\n\n"
    },
    {
      "time": " 13.Feb.2008 7.08pm",
      "content": "Zdravo Mark\n\nAmazing guess (Now explain us how did you cheat? My last name? How come you speak Serbian?) ), unfortunately you are wrong:)  \nI recently moved from Serbia to Canada (20 months ago), but I am not Serbian, I am: [http://en.wikipedia.org/wiki/Rusyns](http://web.archive.org/web/20080907043441/http:/en.wikipedia.org/wiki/Rusyns).  \nSpent most of my life (18 years in Serbia) and have some Serbian blood so I guess my “2nd nationality could be Serbian”.\n\nBtw I do not consider Serbia and Montenegro as small nations, when I say small I mean tiny maybe I should also mention a nation without a country:)\n\nFor the rest of the crowd sorry for offtopic and yes, recommendations for fonts are really appreciated.\n\n"
    },
    {
      "time": " 14.Feb.2008 2.33am",
      "content": "I would have guessed from “tiny” and cyrillic \\_and\\_ your last name either Montenegrin or Macedonian. Rusyn is an interesting option :-) Are you Zakarpathian Rusyn or Voivodin Rusyn?\n\n"
    },
    {
      "time": " 14.Feb.2008 2.34am",
      "content": "“Spent most of my life (18 years in Serbia) “\n\nOOps, of course Voivodin Rusyn. I should have read more carefully.\n\n"
    },
    {
      "time": " 4.Mar.2008 4.34pm",
      "content": "If you haven’t yet resolved your search, you might want to take a look at Resavska and Resavska Sans, created by Serbian type designer Olivera Stojadinović. The regular and bold weights are freely and legitimately available at the Beograd city website, while licenses for the light and medium weights are available for purchase from various vendors. If interested in the details, send me a PM.\n\nResavska:\n\n ![](http://web.archive.org/web/20080907043441im_/http:/typophile.com/files/resavska_6736.jpg)\n\nResavska Sans:\n\n ![](http://web.archive.org/web/20080907043441im_/http:/typophile.com/files/resavska_sans_4955.jpg)\n\n"
    },
    {
      "time": " 5.Mar.2008 10.27am",
      "content": "Very nice typeface. Though the uneven spacing of the stemps of the š in the Sans make it somewhat hard to read/recognise that letter fluently. Or is that only a pixel rendering issue?\n\n"
    },
    {
      "time": " 5.Mar.2008 10.52am",
      "content": "I Love it! This is pretty much what I was looking for, Stylish Sans (my typography language) and nice serif in the same family. I downloaded the free versions from [www.tipometar.org](http://web.archive.org/web/20080907043441/http:/www.tipometar.org/ \"www.tipometar.org\") and was playing with it all night:). I like the fact that I will have to buy only few weights, I like that I am supporting a Serbian designer and that it is not overused (Is that a word?) font. Thank you Mark and Typophile!\n\nIs it only me (probably) or cyrillic in general has a lot of characters that are very simple and they tend to look quite boring(plane) if they are set in “perfect” typefaces like Helvetica? Talking mostly about capital sans. Or maybe Helvetica is the first typeface I had contact with (learned how to read in it) so I’m awfully biased:)\n\nPS I really love Sans Bold Italic version of Resavska.\n\n"
    },
    {
      "time": " 5.Mar.2008 12.14pm",
      "content": "The Georgia and Verdana cyrillics are very good, and have the benefit of being designed to look good at small sizes on screen. They are also freely available under the MS webfont license.\n\nI remember doing some research on the Rusyn orthography a few years ago, and found it very difficult to find reliable information. In the end, I found some information about an orthography in use among Carpathian Rusyns, but I’ve mislaid this information. Sebastian, what characters are included in the Rusyn alphabet as used by the Voivodin Rusyns?\n\nThere is indeed a Cyrillic version of Meta: a very good and authorised version from [www.paratype.com](http://web.archive.org/web/20080907043441/http:/www.paratype.com/ \"www.paratype.com\")\n\n"
    },
    {
      "time": " 5.Mar.2008 2.19pm",
      "content": "_Is it only me (probably) or cyrillic in general has a lot of characters that are very simple and they tend to look quite boring(plane) if they are set in “perfect” typefaces like Helvetica?_\n\nIf you’re going to generalize and talk about all-cap settings and H, yeah, that’s boring alright—in L, C, or G.\n\nHowever, the question for typographers is, how would that text (set in H) differ if set in Akzidenz or Arial? Which Cyrillic adaptation is most faithful? Who ripped off who? What was the earliest Cyrillic grotesque? And so on. Now we can have a debate.\n\nAs an antidote to H, Vladimir Yefimov’s version of [Advertiser’s Gothic!](http://web.archive.org/web/20080907043441/http:/www.paratype.com/pstore/fonts/AdverGothic.htm)\n\n"
    },
    {
      "time": " 5.Mar.2008 2.48pm",
      "content": "Вітаєме!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080907043441/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 5.Mar.2008 4.40pm",
      "content": "@aszszelp, yes, it’s just a pixel rendering issue.\n\n@ad\\_infinitum, you’re most welcome!\n\n"
    },
    {
      "time": " 6.Mar.2008 7.54am",
      "content": "\\ad\\_infinitum: “overused” is a word. Exactly with the meaning as you used it.\n\n"
    },
    {
      "time": " 10.Mar.2008 2.49pm",
      "content": "@ John, here is what we use : [http://i35.photobucket.com/albums/d185/aurora\\_mortalis/DSCF4580.jpg](http://web.archive.org/web/20080907043441/http:/i35.photobucket.com/albums/d185/aurora_mortalis/DSCF4580.jpg) :) . I am really interested why were you researching Rusyn orthography if you don’t mind sharing, that is not a really popular or ordinary thing to do.\n\n@ Nick, I am really not sure how to respond to sarcasm (if there is any). What I was trying to say is that cyrillic “needs” some sort stylish typeface to look more interesting, but that is just my personal opinion.\n\n@oprion: Thank you for the greetings.\n\n@aszszelp: thx for confirming:)\n\n"
    },
    {
      "time": " 10.Mar.2008 3.09pm",
      "content": "_sarcasm (if there is any)_\n\nNo, that is my sincere opinion.  \nI genuinely believe that Helvetica is equally dull in Latin, Greek, and Cyrillic, and that the Cyrillic alphabet is no better or worse than the Latin alphabet, just different.\n\n_cyrillic “needs” some sort stylish typeface to look more interesting_\n\nThose typefaces are already “out there” and available at Paratype, such as versions of the presently trendy-in-the-West faces Avant Garde, Futura, DIN, Officina, Meta (Go, Erik!), and “indigenous” designs such as adaptations of Tatlin’s constructivist lettering, and brand new faces, for instance a new fruity (or was it a vegetable?) script at Lebedev.\n\nThen there are designers such as Slimbach (with the swash calligraphy in Arno) and Phinney (with the alternates in Hypatia) at Adobe, providing “new tools”. (Correct me if I’m wrong, but I would imagine the “alternate _a”_ feature in Hypatia works in Cyrillic as well as Latin.) I’ll shortly be releasing a face with cross-script features that will, for instance, set bold italic small caps and swash all caps in Cyrillic, including Asian Cyrillic. Look out, Kazakhstan.\n\n"
    }
  ]
}
