{
  "id": "42038",
  "title": "Font legality - web use with user created content",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello all. First time user with some font questions.  \nI think I have reached a gray area (at least to me!) in regards to whether my use of fonts on my web site will infringe upon the owner copywrite.  \nFirst off, to clarify a few things I \\*think\\* I understand.  \nIf I own a font and use it on my web page or within images on my web page then that is ok within the licensing agreement?  \nIf I own a font and create a way for users to create things with that font (like glitter-text etc) then is that ok? I have seen this kind of font use around a lot so I am assuming based on the wide use that it is ok.\n\nAnd here is where I really start to get lost. I have an idea for a community website I am making that will allow users to create a page of their own to show to others. Just a typical user page with stuff like interests, favorite movies, pictures of your dog etc. Then included with this will be the ability to customize the look of your page. You can do this by changing colors, adding images for the border etc etc. I was thinking that part of this could also allow you to choose custom fonts for things on your page. The difference between this and some other sites like this is I wanted to allow users to upload their own fonts to use in customizing their page. Now also included would be the option to publish your completed page design as a template so that others can use the same design if they like it. So if I am new to the site and would rather not spend time creating a look for my page from scratch I can browse through user created templates and choose one I like. However in order for the template to look correct it will also need to include the font they used on the page. Adding to the confusion of font use on the site, once someone has a template for their page they can change the template around to their liking.  \nSo...here's how it could work. I sign up and create my page. I upload some images to use as the background, window border, etc and also upload the font \"Helvetica\". I think my design is worth sharing so I publish it as a template. Another user sees my design and decides to use it on their page. They also decide to make some changes to it. When making changes they can choose what fonts they want to you in different areas of text. Since I uploaded the \"Helvetica\" font it is now a choice to use when customizing this template. They can also upload their own font to customize it further.  \nOk, hope I explained this ok without boring anyone! Also keep in mind that no one is able to download the fonts from the web site. Once they are uploaded, they can be used in your template and used by others if you share your template but can only be used on the site and not be downloaded to your computer. However over time with people uploading fonts all over the site could potentially have a large selection of fonts to choose from if you spend the time looking through everyone's templates and picking out what you want to use.  \nDo you think that this would be a major legal issue?\n\n",
  "author": "Mctittles",
  "time": "13 Feb 2008 — 5:07am",
  "uid": "27112",
  "comments": [
    {
      "time": "13 Feb 2008 — 11:10am",
      "content": "I don't think you really want people to be able to upload fonts to a site to use on the server, to customize their own site. Licensing aside, this would be an IT/support nightmare. For starters, end-users would have to have some ability to install fonts on the server...something I doubt your server admin is going to want to happen. Secondly, something would have to check that the font is valid/not corrupt. And then you'd have to figure out how to get the font onto the web page...are you thinking font embedding (not much support for that)...flash?...dynamic image rendering on the server?\n\nAnd THEN there is the licensing issue. ;o)\n\n"
    },
    {
      "time": "13 Feb 2008 — 12:32pm",
      "content": "_If I own a font and use it on my web page or within images on my web page then that is ok within the licensing agreement?_\n\nNot necessarily. It depends upon how you used them. Many foundries wouldn't care if you created images to be used such as GIF, JPG, or PNG. But any sort of live image generation is highly questionable. Moreso if anyone using your site can create their own images using shared fonts.\n\n_If I own a font and create a way for users to create things with that font (like glitter-text etc) then is that ok?_\n\nMost foundries would not allow this kind of usage.\n\nDarrel is correct about uploading fonts. Most foundries not allow this sort of usage. That is embedding for live text such as SIFR. So not only would the users be violating the EULAs for their own licensed fonts, they would also be sharing their fonts with others to use which is not allowed by any foundries.\n\nI should add that some foundries do allow web embedding, such as use in SIFR, but that comes under an extended license which is beyond the basic license.\n\n"
    },
    {
      "time": "13 Feb 2008 — 2:36pm",
      "content": "\\>If I own a font and create a way for users to create things with that font (like glitter-text etc) then is that ok?\n\nI agree with Tiffany. Monotype/Linotype/ITC, Ascender and probably most others class this as user-interaction with the font and require that you get a 'server' license.\n\nAllowing users to upload fonts, storing fonts on your server and letting users interact with them is a recipe for a nasty-gram from the fonts owners.\n\n"
    }
  ]
}
