{
  "id": "42042",
  "title": "'Expert' PS1 fonts still broken in OSX 10.5.2",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Maybe I'll be lucky and one of the Apple folks on here (Dan?) will read this. The release of Leopard seems to me to have broken support for type 1 fonts with custom tables, for example and most notably 'Expert' fonts (you know, how we got optical small caps and old-style figures before OpenType ...)\n\nSymptom-wise, it's pretty much what happened with 10.3.5, which was fixed in 10.3.6, so I'm holding out for another cure. Hopes of that arriving with 10.5.2 weren't fulfilled. I don't know if this is in hand (I filed a bug report, but it was a bit sketchy) or not, but some fix some time not too far down the line would be much appreciated ...\n\n",
  "author": "kikujiro",
  "time": "13 Feb 2008 — 7:13am",
  "uid": "24459",
  "comments": [
    {
      "time": "13 Feb 2008 — 10:50am",
      "content": "\\> Symptom-wise, it’s pretty much what happened with 10.3.5\n\nWhich was?\n\nA.\n\n"
    },
    {
      "time": "15 Feb 2008 — 4:17pm",
      "content": "You didn't happen to attach a copy of one of the fonts involved to the bug, did you? That's the single best thing you can do to help the type folks at Apple track the problem down.\n\n"
    },
    {
      "time": "15 Feb 2008 — 5:48pm",
      "content": "Hmmm. It is a fairly common name, but I need to point out that Mr. Jenkins as \"tseng\" is in not associated with Tseng Information Systems (aka Tseng Books), which I co-own along with Larry Tseng.\n\n[http://www.tsengbooks.com/](http://web.archive.org/web/20150421071644/http:/www.tsengbooks.com/ \"http://www.tsengbooks.com/\")\n\nI suppose I should be glad my last name isn't \"Apple\".\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:58am",
      "content": "Is there any news on this subject? The last posts here are from almost 2 months ago.\n\nThe problem I am experiencing since upgrading to OS X 10.5 (and then to 10.5.2) is that not all characters from \"Expert\" fonts display. I am trying to use old style numbers from two expert fonts (NicolasJensonSG and Centaur Expert MT) and some of the old style numbers show and some don't. All the numbers worked just fine in 10.4.11.\n\nThanks.\n\n"
    },
    {
      "time": "7 Apr 2008 — 12:36pm",
      "content": "Which program are you using to manage your fonts? (I just wonder if this might contribute to the problem.)\n\n"
    },
    {
      "time": "7 Apr 2008 — 1:25pm",
      "content": "I do not use that many fonts, so I am only using Font Book. I am using expert fonts just to get the old style numbers in Finale ( a music notation program). The old style numbers are broken in other programs as well.\n\n"
    },
    {
      "time": "7 Apr 2008 — 5:19pm",
      "content": "You might consider getting in touch with the people from which you originally licensed the fonts. Wish I had better suggestions.\n\n"
    },
    {
      "time": "8 Apr 2008 — 6:58pm",
      "content": "\"type 1 fonts with custom tables\"\n\nI just wanted to note that Type 1 fonts don't have any tables, custom or otherwise.\n\nI'm thinking maybe you mean custom encodings? But the expert set is a standardized encoding rather than custom. So perhaps \"uncommon encodings\" would be the phrase one wants to use.\n\nCheers,\n\nT\n\n"
    }
  ]
}
