{
  "id": "42040",
  "title": "Kerning help please",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi everyone, I need some help with the kerning on this one. Any help will be greatly appreciated. Thanx\n\n ![](http://web.archive.org/web/20131108074416im_/http:/typophile.com/files/REG_5427.png)\n\n",
  "author": "tishbite",
  "time": "13 Feb 2008 — 6:11am",
  "uid": "23589",
  "comments": [
    {
      "time": "13 Feb 2008 — 6:17am",
      "content": "I'm no pro and wouldn't mind getting a more technical guide to how to approach kerning but optically it looks like the EA might be a bit tight.\n\n"
    },
    {
      "time": "13 Feb 2008 — 11:55am",
      "content": "I am certainly no pro either, but the RA looks a little spacey to me - or maybe everything else looks too tight.\n\n"
    },
    {
      "time": "14 Feb 2008 — 2:36am",
      "content": "Tylor: basically the goal of kerning is just getting an even optical distance between letterforms. There is no mathematical way of doing it, it must be optical. Basically its a process of printing it out and tweaking it. So your opinion is just as good as anyone's. The most important thing to kern appropriately to the shape of the letter hence HH \\< needs mores space than \\> OO .\n\nTo me the R and the A seem tight. The G seems abit loose.\n\n"
    },
    {
      "time": "14 Feb 2008 — 11:21am",
      "content": "Upon revisiting, the R & the A do look fine in terms of spacing - I'm bothered by their interaction because of the letterforms themselves.\n\n"
    },
    {
      "time": "23 Feb 2008 — 1:46pm",
      "content": "To my early morning eye this looks right! Don't change.\n\n"
    },
    {
      "time": "22 May 2008 — 2:01pm",
      "content": "i may be a lil' late on commenting. but look at the spacing between the r and a and the spacing between the b and i. they aren't equal. just compare the spacing in between and make sure that it looks natural. so that it reads easier and doesn't look broken up or awkward. the type is to work as a family, tight family.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n::ducky::\n\n"
    }
  ]
}
