{
  "id": "42066",
  "title": "Paper for Professional Portfolio... where to get paper samples and recommendations?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm a student nearing graduation and was curious to where to get good quality paper to print my portfolio on.. price doesn't matter i'm willing to pay since this will be what i show to potential employers int he next 6 months and also in my portfolio review at school... also wondering if anyone knows of any good places to go for cases and cd jewel cases etc to put my work in.. want anything that is brushed aluminum so it goes with my whole brand (me) and my website/business card etc etc.. be nice if it had a window on the outside so i can put my design company logo on the outside..  \nthanks!  \n---Sean\n\n",
  "author": "seansurfn2",
  "time": "13 Feb 2008 — 4:40pm",
  "uid": "12674",
  "comments": [
    {
      "time": "13 Feb 2008 — 5:18pm",
      "content": "I used to buy from these guys all the time. It was great because I lived in downtown Chicago and lived a few blocks from their location.\n\n[www.paper-source.com](http://web.archive.org/web/20131017024137/http:/www.paper-source.com/ \"www.paper-source.com\")\n\n"
    },
    {
      "time": "13 Feb 2008 — 5:30pm",
      "content": "One thing I have to add is that jewel cases are not the least bit classy when it comes to having your portfolio on it. I believe in Arthur Miller's The Crucible, Reverend Hale proclaims \"Design, sir, is a fortress; no crack in a fortress may be accounted small.\"  \nJewel cases crack easily and very difficult to express yourself artistically. Instead I suggest using InDesign's CD case template and spending the time to make something of your own design. Then just print that out on matte paper and rubber cement it together. CD cover stickers are a bonus.\n\n"
    },
    {
      "time": "13 Feb 2008 — 6:31pm",
      "content": "I just bought a portfolio from these folks. The service was excellent.\n\n[http://www.officepdx.com/index.php](http://web.archive.org/web/20131017024137/http:/www.officepdx.com/index.php \"http://www.officepdx.com/index.php\")\n\nSharon\n\n"
    }
  ]
}
