{
  "id": "4207",
  "title": "Novice seeking help",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "this logo will be used for a website redesign. the audience are high-calibre, professional, wall-street types. the product is a highly focussed newsletter with analysis and forecasts of the capital markets (interest rates, stocks, commodites).   \n   \nseeking any constructive critism and ideas. i am very new at this, as i am sure people can tell. in fact, i don't design logos or websites at all, and don't have an ounce of artistic talent in my body. any and all input is deeply and graciously appreciated. thank you. ![New website logo](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/33039.jpg)\n\n",
  "author": "zchuss",
  "time": "9 Apr 2004 — 2:50pm",
  "uid": "3374",
  "comments": [
    {
      "time": "9 Apr 2004 — 6:34pm",
      "content": "This is a slightly modified version. ![charttricks logo v.02](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/33072.jpg)\n\n"
    },
    {
      "time": "9 Apr 2004 — 7:03pm",
      "content": "and finally... color? the red elements might be thought of as stylized \"bars\" as found in an ordinary bar chart. ![charttricks logo w/color](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/33075.jpg)\n\n"
    },
    {
      "time": "9 Apr 2004 — 7:19pm",
      "content": "or maybe..? ![charttricks logo v.04](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/33078.jpg)\n\n"
    },
    {
      "time": "12 Apr 2004 — 7:56am",
      "content": "Play with the 'TT' joint. Right now, it's an awkward smashing of two words into one. The box with bars is fine, but you need to align it with something (most likely the baseline of your type).\n\n"
    },
    {
      "time": "12 Apr 2004 — 9:28am",
      "content": "Much appreciated. Attached is pdf document ctfonts.pdf\n\n<!--attachment: ctFonts-33230.pdf*mime_pdf.gif*application/pdf*215.1 **ctFonts%2epdf --><!--attachment: ctFonts-33230.pdf*mime_pdf.gif*application/pdf*215.1** ctFonts%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131020062318/http:/www.typophile.com/forums/messages/29/ctFonts-33230.pdf\" target=\"_blank\"><b>ctFonts.pdf</b></a> (215.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nMy sort-of favorite is the last one, Zurich BD. Would you suggest I use a font that, by default, joins the 'TT' -- such as tahoma? -- Or should I manually (brute force) join a font like the Zurich.\n\n"
    },
    {
      "time": "12 Apr 2004 — 11:55am",
      "content": "here's another round of fonts -- these are more appealing to me. comments feedback all appreciated.\n\n<!--attachment: ctFonts2-33258.pdf*mime_pdf.gif*application/pdf*228.5 **ctFonts2%2epdf --><!--attachment: ctFonts2-33258.pdf*mime_pdf.gif*application/pdf*228.5** ctFonts2%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131020062318/http:/www.typophile.com/forums/messages/29/ctFonts2-33258.pdf\" target=\"_blank\"><b>ctFonts2.pdf</b></a> (228.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "12 Apr 2004 — 2:03pm",
      "content": "Bob...I think you need to take a step beyond just choosing a typeface. Pick a face, and then start playing with the 'TT' junction. Or perhaps apply some contrast between 'chart' and 'tricks' (weight, layout, typeface, color, etc.)\n\n"
    },
    {
      "time": "12 Apr 2004 — 3:26pm",
      "content": "thanks darrel, you are right. i have decided to stick with futura bold.   \n   \nwhen you say play with the 'TT' junction, do you mean the kerning? -- thanks so much.\n\n"
    },
    {
      "time": "12 Apr 2004 — 3:51pm",
      "content": "The bars don't really look like bar charts to me. I'd show a variety of heights of 3 bars to give the appearance of a bar chart. The minimum number of repeating elements required to establish a pattern is 3.   \n   \nI also agree with what others have said concerning the 'TT' and the box alignment. The Ts should either join purposefully, or contrast (separate) purposefully. The way it is now complicates the visual parsing of the words a bit, and therefore the name.   \n   \nAlso, doesn't red have a negative market connotation?\n\n"
    },
    {
      "time": "12 Apr 2004 — 4:01pm",
      "content": "Much thanks for the feedback Chris. It was decided just recently not to use the bars at all. \"Charts\" are trite and over-used. To imply a \"chart\" without actually using the bar elements is good enough and maintains the austere, staid feel I am after. So the icon will be just the bold square.   \n   \nNot sure what others have said regarding the box alignment. I missed that. I am playing with the TT juncture as well. Any suggestions there -- i.e., should I play with kerning to get the TT's to join? I am using futura bold. My second choice would be to use contrasting colors. thanks so much for the feedback.\n\n"
    },
    {
      "time": "13 Apr 2004 — 7:59am",
      "content": "\"when you say play with the 'TT' junction, do you mean the kerning?\"   \n   \nI mean PLAY! Don't be timid...try anything and everything! Make 50 variations with different weights, colors, layouts, styles, connections, etc. Most will be quick sketches and not amount to much, but I bet you'll find a few that are worth exploring a bit further.   \n   \nSpecific for the Ts, try overlapping, connecting, stacking, rotating, flipping, skewing, replacing with other characters, ligatures, etc.\n\n"
    },
    {
      "time": "13 Apr 2004 — 11:14am",
      "content": "thanks again Darrel. you da man!\n\n"
    },
    {
      "time": "14 Apr 2004 — 7:29am",
      "content": "Bob -- I think you may have a comprehension problem with the type by setting it all in caps. It's much more difficult to read than caps and l.c. If you run charttricks together, why not capitalize the words if the client will allow it, as in ChartTricks. The subhead runs too wide in measure for all caps to be readable. As for the icon, use something that is recognizable like the no parking slash in a circle.\n\n"
    },
    {
      "time": "14 Apr 2004 — 1:27pm",
      "content": "tHANKS Paul,. appreciate the input. the client is dead set on all caps. dont ask me why., something about a certain \"auster\" look for his institutional clients.\n\n"
    },
    {
      "time": "14 Apr 2004 — 2:42pm",
      "content": "one more idea ![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/33512.png)\n\n"
    },
    {
      "time": "14 Apr 2004 — 4:11pm",
      "content": "I am not a professional, so I can only give you the innocent eye test ... The difference in colour within CHARTTRICKS makes this less uncomfortable, but I'm afraid, for me, this is not working. It looks not so much austere as dull. The problems I think I have are:   \n   \n1. The box has no significance. With those heavy lines it does not conjure up an image of a chart, for instance. It's just a box. If it reminds me of anything it is a ballot paper.   \n   \n2. There's no tension: it's a series of blocks: a blocky box, and a rectangle of blocky capitals. It's neat, but it is the regimented neatness of the suburban lawn. Whether it be a contrast of type, or of line length, or of position, or of colour, some sort of injection of life is needed. (The first version actually had more tension.)   \n   \n3. The bold box and the bold type all make it rather heavy. Is this necessary. Heavy typography is the typography of shouting. Is that what you want? Lighter weight caps might have more elegance and subtlety, and perhaps be more \"austere\".   \n   \nI'd say: Don't be bullied by the client. If he knew how to design this, he'd do it himself. Perhaps you need to start with something outlandishly odd and then move it towards respectability, rather than the other way round. Show him what he really wants, not what he thinks he wants.\n\n"
    },
    {
      "time": "18 Apr 2004 — 2:50pm",
      "content": "![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/33753.png)\n\n"
    },
    {
      "time": "18 Apr 2004 — 2:50pm",
      "content": "client has become more flexible actually. he can live without the \"square\", as well as without the strap line beneath the logo.\n\n"
    },
    {
      "time": "18 Apr 2004 — 2:53pm",
      "content": "![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/33757.png)\n\n"
    },
    {
      "time": "19 Apr 2004 — 3:14pm",
      "content": "The typeface chosen is to condensed in relationship the the square beside it.   \n   \nIt feels to me like the T's should be separated naturally, with regular kerning.   \n   \nOr another possiblilty would be to combine the T's into 1 and make the new letter half grey and half blue. The transition of grey to blue could conceptually relate to the idea of trading.   \n   \nThe box tells me nothing about trading, In fact if anything it tells me not to trade and be safe with my money.\n\n"
    },
    {
      "time": "19 Apr 2004 — 6:00pm",
      "content": "Yeah. Do something with the TT combo.   \nIf you don't mind, here is a quicky in   \nphotoshop:   \n   \n ![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/33842.gif)\n\n"
    },
    {
      "time": "19 Apr 2004 — 8:33pm",
      "content": "I really like the mixed-case version. All caps on both lines next to a square just feels like the client did a bit too much art-directing.\n\n"
    },
    {
      "time": "20 Apr 2004 — 5:38am",
      "content": "Typeface feels funny... like Ariel or something.\n\n"
    },
    {
      "time": "21 Apr 2004 — 5:31pm",
      "content": "Guys thank you all for the input. Mixed case is probably the right way to go. Will let y'all know how it turns out in the end.\n\n"
    },
    {
      "time": "23 Apr 2004 — 10:38pm",
      "content": "still working on this ... feedback welcomed. ![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/34194.gif)\n\n"
    },
    {
      "time": "24 Apr 2004 — 6:27am",
      "content": "and another idea still.. ![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/34201.gif)\n\n"
    },
    {
      "time": "24 Apr 2004 — 7:30am",
      "content": "and another (possible \"pi\" connection?) ![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/34204.gif)\n\n"
    },
    {
      "time": "26 Apr 2004 — 7:49am",
      "content": "Loose the all caps. The square means nothing. I have serious problems with the name. Wallstreet types have been tricked alot lately and their is an air of upfront open to the public reaction because of the scandles.\n\n"
    },
    {
      "time": "26 Apr 2004 — 3:06pm",
      "content": "thanks daniel for the input.\n\n"
    },
    {
      "time": "3 May 2004 — 8:23pm",
      "content": "comments greatly appreciated. ![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/35025.jpg)\n\n"
    },
    {
      "time": "3 May 2004 — 8:31pm",
      "content": "Looking for feedback on the above revised logo. My concern is that the logo is not staid enough for the serious minded folks it is intended to reach. Also have a concern about legibility (is it hard to make out the two TTs in the middle?). Other than that, I actually like the concept.\n\n"
    },
    {
      "time": "3 May 2004 — 11:15pm",
      "content": "Conceptually, this last post is in another league from the others on this critique. Is there a reason for the \"T\"s not to be centered? I'm sure you'll continue to get some valuable technical critique from the true typophiles here so I'll leave that to them. I just want to say that I have spent many years working in-house in a few corporate environments and those guys eat this stuff up. I think this direction is fine for the \"serious minded folks\"\n\n"
    },
    {
      "time": "4 May 2004 — 4:51am",
      "content": "Scott, I am most greatful for your feedback. One question though. What did you mean by \"Is there a reason for the \"T\"s not to be centered?\" -- thanks.\n\n"
    },
    {
      "time": "4 May 2004 — 5:08am",
      "content": "I believe he may have meant using one T for both sides. Visually, it could work well and simplify the space between both words.   \n   \nIf I am wrong then... =)\n\n"
    },
    {
      "time": "4 May 2004 — 5:33am",
      "content": "The color scheme and the eurostile give this a very 1997-internet-startup look. I don't think those are the best associations. You still need to go with something lowercase for the byline. I think this concept works better, but you can find a more memorable face and color choice that will still give you a similar feel.\n\n"
    },
    {
      "time": "4 May 2004 — 7:32am",
      "content": "RE: \"What did you mean by 'Is there a reason for the 'T's not to be centered?'\"   \n   \nSimply that the \"TT\" is not centered within the diamond shape. They are offset to the right.   \n   \nI think Daniel is right about exploring more typefaces and colors. Keep the core concept of the \"TT\" mark, then experiment with alternatives to the rest of the elements (type, color, positioning) and alterations to the \"TT\" mark itself. I like the upward arrow created in the mark. I wonder if that could be exposed in a stronger way. Maybe try making the type (including the \"TT\") monochromatic and highlighting the arrow with a contrasting color\n\n"
    },
    {
      "time": "4 May 2004 — 9:36am",
      "content": "Daniel -- i am listening. What is your rational for using lowercase for the strap line (byline).   \n   \nI hear ya about the colors -- these are definately just exploration only -- not final. Thanks.\n\n"
    },
    {
      "time": "4 May 2004 — 12:18pm",
      "content": "Other fonts I am contemplating:   \n   \n [http://snipurl.com/64bq](http://web.archive.org/web/20131020062318/http:/snipurl.com/64bq)\n\n"
    },
    {
      "time": "4 May 2004 — 1:04pm",
      "content": "My rationale for the byline is pretty similar to the ones expressed above: All cap settings are just plain hard to read. It's not going to kill you to have a byline set in allcaps, but when both your wordmark and the byline are allcaps, it just isn't legible or effective.   \n   \nSorry, that's not eurostile, it's a bank gothic variant. Anyway, of the fonts in your album, I would suggest you stay away from any of the copperplates, eurostiles (includes microgramma), and bank gothics. These are just overused and as such are seriously beginning to lack character. There are so many good alternatives out there that are fresher and more memorable. Some suggestions:   \n   \n [Teuton Fett Bold](http://web.archive.org/web/20131020062318/http:/www.myfonts.com/fonts/storm/teuton/fett-bold/testdrive.html?s=Chart%2BTricks&p=72) (Storm)   \n   \n [DynaGrotesk DXE Bold](http://web.archive.org/web/20131020062318/http:/www.myfonts.com/fonts/storm/dynagrotesk/dxe-bold/testdrive.html?s=CHART%2BTRICKS&p=60) (Storm)   \n   \netc. etc. Wish I had more time to browse around right now. In short, there are lots of great offerings to explore.\n\n"
    },
    {
      "time": "7 May 2004 — 10:32am",
      "content": "welcome feedback... ![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/35387.jpg)\n\n"
    },
    {
      "time": "7 May 2004 — 10:47am",
      "content": "one last page...! thanks again for any feedback. ![](http://web.archive.org/web/20131020062318im_/http:/www.typophile.com/forums/messages/29/35393.jpg)\n\n"
    },
    {
      "time": "11 May 2004 — 7:54am",
      "content": "12\n\n"
    },
    {
      "time": "11 May 2004 — 11:26am",
      "content": "I have one suggestion try making the type like a building with perspective. As if you went to the corner of chart and tricks.\n\n"
    },
    {
      "time": "11 May 2004 — 2:49pm",
      "content": "12\n\n"
    },
    {
      "time": "12 May 2004 — 4:02pm",
      "content": "Thanks to all who contributed. Greatly appreciated.   \n   \n\"Chart Tricks\" is a research report/service which interprets the price charts of financial markets.   \n   \nIt is somewhat ironic that the name of the report is novel and \"tricky,\" when in fact it is aimed at a serious, no-nonsense audience. The image sought is one of professionalism and seriousness. There should be very little if anything \"tricky\" or cute about the image.   \n   \nSo, after all the exploration, we have opted to go with a text only logo, using a sackers heavy gothic (lower case) for both the logo and the strap line.   \n   \nthanks again to all.\n\n"
    }
  ]
}
