{
  "id": "42097",
  "title": "Logo for Financial Svcs Program/Forum",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi everyone:\n\n[Three logo concepts](http://web.archive.org/web/20081012141147/http:/farm3.static.flickr.com/2136/2265525214_e72eaf7640_o.jpg)\n\nI’m working on logo concepts for a financial institution. The logo is for a forum /program hosted by this bank  \nthat is focused on financial wealth management for 20-30 year olds. These are high net worth individuals,\n\nThe client requested that the logo look “current” and “cutting edge” and that it have some appeal to this age bracket. That said, this is a very conservative banking institution . such a request has to be taken in context.\n\nConcept A is about taking MICR characters out of context. These are transit and routing symbols found on checks. I thought it might be interesting to take these symbols— which are very old school banking, and give them a new spin.\n\nConcept B is supposed to be a visual metaphor for next generation, i.e., the budding of young from parent.\n\nConcept C is supposed to be pretty abstract, and refers somewhat obliquely to building blocks, at the same time the pattern of blocks connect an “N”, or an “X”, or a right-pointing arrowhead\n\nAny feedback would be greatly appreciated. This, as all projects seems to have a deadline of yesterday.\n\n [‹ The Making of a Logo](http://web.archive.org/web/20081012141147/http:/www.typophile.com/node/40144 \"Go to previous forum topic\") [Feedback more than welcome... ›](http://web.archive.org/web/20081012141147/http:/www.typophile.com/node/42654 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012141147/http://www.typophile.com/user/11266\" title=\"View user profile.\">frosticocoon</a>",
  "time": "<br>",
  "uid": "11266",
  "comments": [
    {
      "time": " 14.Feb.2008 11.05am",
      "content": "I don’t get the MICR feeling from A at all, and it looks too web 2.0. You could make it work by using MICR type and losing the lighting gimmick—which makes little sense when working with a concept rooted in two-dimensions—but the generation you want does not use checks often enough—if ever—to get it.\n\nB is too abstract, and the text treatment is too complicated and distracting to work as a logo.\n\nC could work, but the mark needs tweaking. Dropping the rightmost block will make the wall concept more obvious, and the perspective needs to be toned down, right now it appears to be curving the mark.\n\nI also think that you should not be breaking up “Next Generation” typographically. It makes little sense from a grammatic perspective, and visually it looks overwrought.\n\n"
    },
    {
      "time": " 14.Feb.2008 11.27am",
      "content": "Thank you James. All makes perfect sense. I wonder now, about Concept C, whether the perspective really adds or should it be removed altogether?\n\n ![](http://web.archive.org/web/20081012141147im_/http:/www.typophile.com/files/NGW_2_4551.jpg)\n\n"
    },
    {
      "time": " 14.Feb.2008 12.17pm",
      "content": "Be careful with those checkers/squares. It looks a little Ralston/Purina or some cereal company.\n\n"
    },
    {
      "time": " 14.Feb.2008 12.33pm",
      "content": "I’m not wild for the checkerboard. It reminds me of the Purina logo, not building blocks. I preferred the lower version of A. The rectangles looked like computer keys to me rather than MICR characters (especially with the \\* in one) Which works for that generation especially in the glowing Mac blue. If you do decide to stick with the checkerboard play more with the type, even try angeling the baseline to parallel the base of the squares. Right now the negative space wedge is uninspired. Good suggestion by James not to break next generation, that was really distracting on your original post.\n\n"
    },
    {
      "time": " 14.Feb.2008 12.44pm",
      "content": "Thanks so much for the feedback. I was concerned about the Purina correlation, it is quite similar. I tried extending the shapes so they’re more literally like bricks. Still trying to figure out how I can make the type a bit more dynamic..\n\n ![](http://web.archive.org/web/20081012141147im_/http:/www.typophile.com/files/NGW_3_4500.jpg)\n\n"
    },
    {
      "time": " 14.Feb.2008 1.29pm",
      "content": "The two versions drawn in perspective have more interest to me than the flat two. Right now your brick wall over powers the text. I’d like to see the type have more presence to it. Play with scale and try some other fonts.\n\n"
    },
    {
      "time": " 14.Feb.2008 1.34pm",
      "content": "Change the color arrangement so that bricks of the same color follow a bottom-left to top-right line, making the image slightly reminiscent of growth on a time chart.\n\n"
    },
    {
      "time": " 14.Feb.2008 6.51pm",
      "content": "This is getting close to the I Ching symbol for water.\n\n"
    },
    {
      "time": " 15.Feb.2008 7.53am",
      "content": "thanks for all the very helpful feedback. i’ve tried taking everything into consideration and wound up here... i’m not sure this is working but hopefully i’m headed in the right direction?\n\n ![](http://web.archive.org/web/20081012141147im_/http:/www.typophile.com/files/NGW_4_4297.jpg)\n\n"
    },
    {
      "time": " 15.Feb.2008 8.52am",
      "content": "I think that you took the width of the blocks a little too far and putting the text in perspective makes the whole thing lest interesting. I also think you can keep the blocks in a single shade, at least until the details are worked out. Something else to consider is using a very soft lens blur effect to enhance the perspective with less distortion.\n\n"
    },
    {
      "time": " 15.Feb.2008 11.13am",
      "content": "it feels extremely basic. rather than messing with two planes, one plane being the mark and the other being the text as in the latest version, why not working the two planes into the ’bricks’? the type feels weird, wrong and out of perspective in the latest. what if that type had to stand on it’s own in a certain instance? i think being skewed takes all the focus off the strength of the mark and places it on some tricknology. i’m not a huge fan of that typeface either. especially in this instance. the shapes don’t match up, don’t make sense and don’t really say 20-30 years old to me at all; it looks obvious that the designer and the target audience are not on the same page.\n\nthank about patterns too. could this mark be used in patterns for later applications? could you duplicate it and have it work as a fill? what would that look like? explore you possibilities. it will help define the outcome\n\nw|m\n\n"
    },
    {
      "time": " 15.Feb.2008 1.15pm",
      "content": "I prefer the other brick pattern (the one w/ six), I think, and the colors produce too high a contrast now. As green and black symbolize economic success, try looking at shades of dark green and black.\n\n"
    },
    {
      "time": " 19.Feb.2008 1.49pm",
      "content": "Frankly, all of these look uninspired. I think you should steal a cue from Barack Obama’s branding - young and fresh can be indicated through type alone. Do you need a logomark at all?\n\n"
    },
    {
      "time": " 19.Feb.2008 1.51pm",
      "content": "I know the type here is really lacking but I wonder if I can ask for some feedback for where I am right now... Trying my best to respond to some of the suggestions, too simple, distracting perspective, wrong type, etc... I also think I will not work in color until I get the basic idea going. cheers, and much thanks to you all.\n\n ![](http://web.archive.org/web/20081012141147im_/http:/www.typophile.com/files/NGW_5_6510.jpg)\n\n"
    },
    {
      "time": " 19.Feb.2008 1.51pm",
      "content": "Step away from the computer. Use your brain and pencil and paper to sketch.\n\nDavid\n\n"
    },
    {
      "time": " 19.Feb.2008 1.55pm",
      "content": "Well, the client specifically requested a mark, so I’m trying my best to come up with something that will work for this event/purpose. But maybe this is a situation where I just can’t come up with anything that will work, and perhaps you’re right I should just focus on type only?\n\n"
    },
    {
      "time": " 19.Feb.2008 7.40pm",
      "content": ".\n\n"
    },
    {
      "time": " 19.Feb.2008 10.22pm",
      "content": "The top one is a little busy but it’s miles better that the others. I think you’re on to something. And that call out chevron is brilliant. Suggests movement and next. You might not even need the supporting squares.\n\n"
    },
    {
      "time": " 20.Feb.2008 6.13am",
      "content": "i agree, i think you could play with fills on some of those shapes and make an interesting mark. i’d even make a stretch and say you could relate it back to your original idea of building wealth or something like that? the type still feels wrong and/or clunky... (sorry, i’m a typophile ;)\n\nw|m\n\n"
    },
    {
      "time": " 20.Feb.2008 4.01pm",
      "content": "I agree with sam that the chevron is strong - get rid of those squares, and focus on type that stands up to the chevron.... My advice is to open up 100s of tabs in FF, each with “Next Generation Wealth” previewed in a different font. :)\n\nJust don’t turn the Chevron counter-clockwise 90 degrees, especially with that font.\n\n"
    },
    {
      "time": " 21.Feb.2008 7.17am",
      "content": "You’ve made some really good strides. And to reiterate others suggestions, simplify the mark and try LOTS of different font choices. The lines of the box look weak and flimsy next to the heavy chevron and the type also looks weak and out of place.\n\nDon’t get discouraged, keep going.\n\n"
    },
    {
      "time": " 24.Feb.2008 3.33pm",
      "content": "I think it looks good w/ the cubes.\n\n"
    },
    {
      "time": " 28.Feb.2008 12.15pm",
      "content": "Hi everyone: thanks so much for the helpful suggestions.\n\nI tried working only with one cube, to simplify that version as much as possible. The attached is the result of experimenting with the various shapes and their fills.\n\nThe type I’m struggling with. The chevron’s weight, as one of you suggested, demands something to stand up to it. Do any of these seem like they are heading in the right direction?\n\nCheers, and thanks again.\n\n ![](http://web.archive.org/web/20081012141147im_/http:/www.typophile.com/files/NGW_5_6570.jpg)\n\n"
    },
    {
      "time": " 28.Feb.2008 1.33pm",
      "content": "In most of these, the logomark looks like an empty cardboard box - not a sign of wealth or stability! In the ones on the bottom, it looks like a forward arrow with a backward arrow - a sign of stagnance or backwards progress. I think you should keep it simple - something like the type in 1 or 4, with a chevron weighted to balance it (not so thick).\n\n—-  \n [http://www.flickr.com/photos/eeblet/](http://web.archive.org/web/20081012141147/http:/www.flickr.com/photos/eeblet/ \"http://www.flickr.com/photos/eeblet/\")  \nLive near Oakland? Now in Jack London Square on Sundays: screamsorbet.com\n\n"
    },
    {
      "time": " 28.Feb.2008 2.37pm",
      "content": "As I was working with this mark I thought that it was actually working because the chevron would be seen as a symbol of next/forward, and that it is actually “outside of the box”which is also another nice tie in.\n\nSo it is interesting to hear this comment about an empty box.I’m concerned now.\n\nDo you think this mark is just not working ? Should the mark just be a chevron? I’m worried that if that’s the case, I am now so far from the original concept of building blocks that the client might raise some concern (this is an internal client, and i had to show some early work in progress. She agreed with several of the commentors that the dimensional blocks was the direction to pursue).\n\nOK, I’ll keep plugging away....\n\n"
    },
    {
      "time": " 7.Mar.2008 3.27pm",
      "content": "i think the type and mark style of number 7 work well together. i’d push for that harmony in some of your other solutions\n\nw|m\n\n"
    }
  ]
}
