{
  "id": "42098",
  "title": "Any ideas on what to use with this typeface?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all, I’m looking for some help in the direction of developing my personal identity and wanted to get some typeface thoughts.\n\nMy renamed portfolio site will be figdigital, fig- being the shortened version of my last name and the -digital suffix being something vague enough to encompass all my design interests. I’m wanting to develop something that will appeal to my range of clients but lean towards the edgy side (I do work with some music clients and may be doing a good bit more) and be flexible enough to use in a variety of mediums.\n\n ![](http://web.archive.org/web/20081201203547im_/http:/www.typophile.com/files/fd_type_5525.gif)\n\nI’ve spent hours sketching ideas with little to show, then recently ran across FF Disturbance and really love some of the letterforms (image above). The “fig” in particular really grabs me, I love the open letterform of the “g” and feel that it’s really unique. When combined with “digital” set in the same face, however, it seems to be a bit too much visually and loses it’s distinctiveness. I’ve been playing with the idea of some kind of a mark to use with this, but I feel like the typeface needs to be worked out first.\n\nAny ideas on possibly combining typefaces with this or other thoughts on direction for the logo in general? I’ve stared at it for so long that I’m needing some fresh opinions. Thanks for any thoughts.\n\n [‹ The project named 'Made in Clerkenwell'.](http://web.archive.org/web/20081201203547/http:/www.typophile.com/node/42113 \"Go to previous forum topic\") [Morphing Software ›](http://web.archive.org/web/20081201203547/http:/www.typophile.com/node/42093 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201203547/http://www.typophile.com/user/27157\" title=\"View user profile.\">chrisfig</a>",
  "time": "<br>",
  "uid": "27157",
  "comments": [
    {
      "time": " 14.Feb.2008 11.41am",
      "content": "Jermy Tankard, FF Disturbance  \n [http://www.fontshop.com/search/?q=disturbance&x=0&y=0](http://web.archive.org/web/20081201203547/http:/www.fontshop.com/search/?q=disturbance&x=0&y=0 \"http://www.fontshop.com/search/?q=disturbance&x=0&y=0\")\n\n"
    },
    {
      "time": " 14.Feb.2008 11.55am",
      "content": "Sorry I don’t see the g”s. If you make your readers work its not communication. Use your creativity on another aspect of your site.\n\n"
    },
    {
      "time": " 14.Feb.2008 12.31pm",
      "content": "Christopher,\n\nSorry for being so quick, I realise I totally mixed this one up...\n\n"
    },
    {
      "time": " 14.Feb.2008 12.32pm",
      "content": "Christopher,\n\nSorry for being so quick, I realise I totally mixed this one up... I will read posts more carefully in the future ;-)\n\n"
    },
    {
      "time": " 14.Feb.2008 12.46pm",
      "content": "Not a problem Stefan.\n\nDan, thanks for the comments. Any other thoughts on how to approach this? I’ve made several attempts at a strictly typographic logo but everything tends to come out looking a bit...unfinished, for lack of a better term.\n\n"
    },
    {
      "time": " 14.Feb.2008 1.18pm",
      "content": "Christopher,\n\nMaking your own identity is sometimes really hard work. Having to play the role of the designer and the the “client” at the same time might not always be optimal. If you feel stuck, why don’t you ask some of your graphic designer friends to have a go on this?\n\nAnyway, good luck.\n\nCheers\n\n"
    },
    {
      "time": " 14.Feb.2008 2.55pm",
      "content": "Yup, I’ve learned I’m a terrible client :)\n\nI have talked to friends about it a bit, but it’s the sort of thing that I feel I really need to do myself. So it’s back to the drawing board...any other ideas or advice welcome.\n\n"
    }
  ]
}
