{
  "id": "4211",
  "title": "Small Type recommendations for a topographic map re-design",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "First time posting on this list but I have been lurking for months. I am also mostly a typography novice, hence my questions.   \n   \nI am a cartographer working on a re-design of a large scale topographic map (1:50k). This is a large sheet 28\" x 40\" with a 4 color CMYK tiff with type and line work printing over that in black and two spot colors: a blue and a greyish brown. Large quantities of single line small type blocks in the 5 or 6pt range and usually 4 to 6 letters long need to be placed. But some may be longer and two to three lines long. Some text may also be 8pt to 10pt in size. In the past this was set in Arial. I am looking to change this. I want to use a sans serif family for most of it, with a well matched serif or semi-sans for some place names and water bodies. I realise this may be a bit off-topic for this list but I really enjoy the tone of the discussion here and though I would solicit your informed opinions.   \n   \nLegibility is very important, and there is a good chance text will need to be converted to paths at some point in the printing process.   \n   \nBTW I am loathe to use Bell Centennial.   \n   \nI've been recommended Frutiger and Amasis. Anyone else with some suggestions?   \n   \nThanks\n\n",
  "author": "<a href=\"user/3413\" title=\"View user profile.\">drown</a>",
  "time": "<br>",
  "uid": "3413",
  "comments": [
    {
      "time": " 9 April, 2004 - 4:04pm",
      "content": "\\> In the past this was set in Arial.   \n   \nOuch. You can choose a replacement using _dice_ and you'd still do better! :-/   \n   \nYou should look for a font that's been designed for small sizes - and it doesn't have to be something bland. Look at the work of Chris Burke:   \n [http://www.myfonts.com/fonts/fontfont/parable/](http://web.archive.org/web/20060516000414/http:/www.myfonts.com/fonts/fontfont/parable/)   \n [http://www.myfonts.com/fonts/neufville/pragma-nd/](http://web.archive.org/web/20060516000414/http:/www.myfonts.com/fonts/neufville/pragma-nd/)   \n   \nOr if you want something more extreme maybe Tracy's Adsans:   \n [http://www.myfonts.com/fonts/linotype/adsans/](http://web.archive.org/web/20060516000414/http:/www.myfonts.com/fonts/linotype/adsans/)   \n   \nAs for a companion semi/serif design, that would depend on the (more pivotal) small-text choice. Although Amasis -which I'd never heard about- could actually work out.   \n   \nhhp\n\n"
    },
    {
      "time": " 9 April, 2004 - 4:06pm",
      "content": "Yves: Shame on you, Fedra is my little secret.\n\n"
    },
    {
      "time": " 9 April, 2004 - 7:33pm",
      "content": "You might also try Greg Thompson's Agenda or Hans Reichel's Dax\n\n"
    }
  ]
}
