{
  "id": "42127",
  "title": "New avatar problems",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I would like to add a new avatar but every time I load up an image it replaces it with my old avatar. Is there a problem with the way I’m doing it?\n\n [‹ Chris Rugan birthday, a swing and a miss!](http://web.archive.org/web/20080828003001/http:/www.typophile.com/node/43614 \"Go to previous forum topic\") [For Fun - Justice Videos ›](http://web.archive.org/web/20080828003001/http:/www.typophile.com/node/43568 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080828003001/http://www.typophile.com/user/8008\" title=\"View user profile.\">Nick Job</a>",
  "time": "<br>",
  "uid": "8008",
  "comments": [
    {
      "time": " 15.Feb.2008 8.11am",
      "content": "Have you cleared your browser cache?\n\n"
    },
    {
      "time": " 15.Feb.2008 9.03am",
      "content": "Got rid of temporary internet files. Wasn’t anything to do with that though. Just refreshed and the old one was replaced by the new one. I feel very silly.\n\n"
    },
    {
      "time": " 15.Feb.2008 9.57am",
      "content": "On a related note, how do I get my donation badge added?\n\n"
    },
    {
      "time": " 15.Feb.2008 10.43am",
      "content": "Haley - did they not send you the kit for that? You need to apply it in photoshop. The graphic came along with the confirmation from Typophile.\n\n"
    },
    {
      "time": " 15.Feb.2008 11.33am",
      "content": "Hmm no I never got anything. Just my receipt from paypal.\n\n"
    },
    {
      "time": " 15.Feb.2008 1.49pm",
      "content": "\\> Hmm no I never got anything. Just my receipt from paypal.\n\nYep. I got my receipt about a month ago but nothing has been transfered from my bank account yet. I guess paypal just sucks.\n\n"
    },
    {
      "time": " 15.Feb.2008 9.36pm",
      "content": "Haley - FWIW mine went into my spam folder. I have no idea why. You might check there, or else contact Typophile. You should wear your badge proudly!\n\n"
    },
    {
      "time": " 17.Feb.2008 6.26pm",
      "content": "I don’t have a spam folder. Maybe I’ll make my own typophile badge. :)\n\n"
    },
    {
      "time": " 18.Feb.2008 2.45pm",
      "content": "Image size?\n\n-=®=-\n\n"
    },
    {
      "time": " 18.Feb.2008 6.21pm",
      "content": "_Hmm no I never got anything. Just my receipt from paypal._\n\nSame here. After Patty’s comment, I just went and checked my confirmation e-mail, but there is no attachment. Hmph.\n\n"
    },
    {
      "time": " 19.Feb.2008 5.23pm",
      "content": "I’m having the same problem. I think the problem is that I cannot get my file size down below 24 Kb. I’ve made the image extremely small (30x30) but the file size will not get smaller than 52 Kb. I’m obviously not a web guru. Any suggestions?\n\n"
    },
    {
      "time": " 19.Feb.2008 7.01pm",
      "content": "_I think the problem is that I cannot get my file size down below 24 Kb. I’ve made the image extremely small (30x30) but the file size will not get smaller than 52 Kb. [...] Any suggestions?_\n\nHi, Michael. This worked for me:\n\n1. In Adobe Photoshop, start with a new image that is 60 pixels wide x 60 pixels tall, and has a resolution of 300 pixels per inch. Alternately, in Adobe Illustrator, make a square that is 60 points x 60 points. This will equal 60 x 60 pixels later, when you save your file for the Web.\n\n2. Make sure you are in RGB mode (in either Photoshop or Illustrator), and that you have the color palette set to Web-safe colors (to make sure your icon’s colors will look the same on a Mac or on a PC).\n\n3. When your icon is ready, go to **File \\> Save for Web**. This will open a window that gives you a preview of your icon, and lets you choose different image formats (JPEG is best for color, GIF is best for black and white). This window will also show you what size the final file will be, and let you choose different variables for image compression and quality. Once you hit the Save button, you will get a chance to change the name of your file, if you wish.\n\nI hope this helps!\n\n"
    },
    {
      "time": " 19.Feb.2008 7.22pm",
      "content": "<cite>(JPEG is best for color, GIF is best for black and white)</cite>\n\nActually the way it works is that jpeg is good for photos and GIF is fine for color as long as it’s flat color. Mine is a gif I think. It should be anyway.\n\n"
    },
    {
      "time": " 19.Feb.2008 9.00pm",
      "content": "Ack, thanks for the correction, Patty!\n\n[EDIT] And you’re right — your icon is saved as a GIF file.\n\n"
    },
    {
      "time": " 3.Mar.2008 4.23pm",
      "content": "_On a related note, how do I get my donation badge added?_\n\nHello, moderators and/or Punchcut folks... Just a friendly reminder that I have not received my donation badge kit... (I wrote e-mails to Joe, Jared, and Zara, as well, but have not heard back yet.)\n\nThanks in advance,  \nR.\n\n"
    },
    {
      "time": " 3.Mar.2008 4.37pm",
      "content": "After 1&1/2 months I emailed Joe and got my badge right away.\n\n"
    },
    {
      "time": " 3.Mar.2008 5.50pm",
      "content": "Hey everyone,\n\nAs stated above, please email us if you have any issues with donation transactions, and if you have not received a badge, we’ll get one out to you as soon as possible. We just moved our office and things have been quite busy - we’ll catch up soon!\n\ntypophile [at] punchcut [dot] com\n\n@Ricardo: When did you send an email? I apologize you haven’t gotten a response. I wish I could look up your email, but the life of my computer ended suddenly over the weekend and I lost all my mail :( In the mean time, we’ll get ya taken care of.\n\nThanks everyone for the support and for your patience :)\n\n"
    },
    {
      "time": " 3.Mar.2008 5.59pm",
      "content": "I just got my email.. But I think I’ll keep my fake badge. Thanks though!\n\n"
    },
    {
      "time": " 3.Mar.2008 7.47pm",
      "content": "_@Ricardo: When did you send an email? I apologize you haven’t gotten a response._\n\nHey, Zara, sorry to hear about your computer problems. :-(\n\nI wrote on February 21, but not to the address you posted here... (I wrote to your individual addresses.) Thanks!\n\n"
    },
    {
      "time": " 27.Mar.2008 5.31pm",
      "content": "Kind folks at Punchcut, I am still waiting from my donation badge... \\*pretty please?\\*\n\nmerci / gracias / danke\n\n"
    }
  ]
}
