{
  "id": "42142",
  "title": "Whitman Display",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "When is this getting released to the public?\n\n",
  "author": "adnix",
  "time": "15 Feb 2008 — 2:34pm",
  "uid": "5455",
  "comments": [
    {
      "time": "15 Feb 2008 — 3:46pm",
      "content": "Why aren't you asking Font Bureau?\n\n"
    },
    {
      "time": "17 Feb 2008 — 6:02am",
      "content": "adnix --\n\nThe Whitman Display fonts that I completed last summer are actually available for license now. They just haven't been \"officially\" released -- i.e., integrated into the Retail site for purchase and download. You have to contact Font Bureau directly.\n\nThe Display fonts were set to be launched back in October last year. But then <cite>Fortune</cite> magazine commissioned Display Italics for the normal width (among other styles). So, now FB has decided they want to wait until I add Display Condensed & Compressed Italics in all seven weights before launching.\n\nI'm hoping to turn my attention to those after I finish working with David Jonathan Ross to establish the framework for his expansion of the Whitman Text family to full-featured OpenType fonts.\n\nIn the meantime, I've put a PDF sample of the Whitman Display fonts on my site: [http://www.kentlew.com/Type/WhitmanDisplay\\_Sample.pdf](http://web.archive.org/web/20120717112603/http:/www.kentlew.com/Type/WhitmanDisplay_Sample.pdf \"http://www.kentlew.com/Type/WhitmanDisplay\\_Sample.pdf\")  \n[_In case anyone is reading this months or years later: This sample probably won't be up after the fonts are released._]\n\nBut if you're interested in licensing the Whitman Display fonts now (or the text Bold Italic or Semibolds for that matter), you can contact the folks at Font Bureau by e-mail or phone.\n\n-- Kent.\n\n"
    },
    {
      "time": "17 Feb 2008 — 2:08pm",
      "content": "Hi Kent — what is the expected release date for the Open Type version of the standard weights? (I have my eye on getting them!)\n\nbest\n\nEl.\n\n"
    },
    {
      "time": "17 Feb 2008 — 3:26pm",
      "content": "Font Bureau in OpenType? ;)\n\n"
    },
    {
      "time": "18 Feb 2008 — 5:10am",
      "content": "Stephen: \"Font Bureau in OpenType? ;)\"  \nWe tried for several years to get it that way, but we had to settle for OpenType in Font Bureau.\n\nCheers!\n\n"
    },
    {
      "time": "18 Feb 2008 — 10:39am",
      "content": "hehe\n\n"
    },
    {
      "time": "18 Feb 2008 — 10:45am",
      "content": "Eluard -- I'm afraid it's too early to say with any precision. I certainly don't have enough experience with this to predict an endpoint. Since the project is aimed at expanding features and weights, there's a fair bit to be done. We're definitely talking in terms of months, not weeks. But my personal hope is that DJR can have this all finished up by TypeCon this summer.\n\n-- K.\n\n"
    }
  ]
}
