{
  "id": "42145",
  "title": "Rock Band - Typography affecting my enjoyment of things.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Or, how I learned to stop worrying and love insane, excessive Avant Garde ligatures.\n\nYesterday, for Valentine's day, the boyfriend and I decided to each buy 1/2 of that video game 'Rock Band' for each other. Meaning we just bought it and split the cost. We brought it home, took all the instruments out of the huge box, put them together, and started the game.\n\nAs we progressed through the first few screens, I began to notice things.\n\nFirst, Avant Garde in all caps with VERY liberal usage of ligatures. Everywhere. Everywhere. Ack. And they were obviously inserted fairly randomly. So slanty.\n\nSecond, and not so frighteningly, someone finally found a fairly appropriate use for Fakir. I've been waiting for a chance to use it myself, so I'm glad I have a place to reliably enjoy it now. And wow. I think they managed to use all but the very lightest weights. How thorough...\n\nBut then it keeps going. They use Chalet. And not the dignified, unassuming Chalet Text. Oh no. They use one of the 1980's Display versions of it. With the really distracting miniscule t. Little t boats, everywhere, interrupting words left and right. Their one opportunity to use a normal body text face, and they failed with flying colors.\n\nOh, but that's not all! On the quick little gamesave screens, there is Bodoni Poster. I think that's what it is anyway. Why did they choose something dignified here? Why not just go ahead and throw in a chunky Rat Fink face? That's rock and roll, right?\n\nWhew. I think that's it. It wouldn't suprise me if they snuck another in there somewhere. My point in all of this being, it's affecting my enjoyment of the game. I'm constantly thinking \"Oh, I don't think there are enough typefaces on this particular screen! I wonder why they limited themselves to 3 here. They really could have fit another in,\" and I frequently find myself pondering how the designers could have possibly come to the conclusion that they were all necessary. Or if perhaps the game company just gave a couple highschool hipsters cart blanche to make the type look \"hip\" and \"edgy.\"\n\n",
  "author": "<a href=\"/web/20100920235131/http://typophile.com/user/24702\" title=\"View user profile.\">wren_fern</a>",
  "time": "<br>",
  "uid": "24702",
  "comments": [

  ]
}
