{
  "id": "4215",
  "title": "Archive through November 06, 2002",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "the time has come to rise up against our oppressors. join me in this sticker campaign to rid our lives of this travesty of type design. we all know comic sans is the absolute worst. if i had millions of dollars i would buy you all a ton of sticker paper, but i don't, so please go get some and join the resistance. future generations will thank you.   \n [www.bancomicsans.com](http://web.archive.org/web/20131107162348/http:/www.bancomicsans.com/)\n\n",
  "author": "Isaac",
  "time": "3 Nov 2002 — 11:25pm",
  "uid": "540",
  "comments": [
    {
      "time": "4 Nov 2002 — 8:46am",
      "content": "anomonis, i share your passion.   \ni myself have not yet targeted   \nsand for a couple of reasons:   \nmost people at my school who   \nare clueless prefer comic sans,   \ni think because it's closer to   \nthe beginning of the font menu.   \nalso, it's difficult to fight   \na war on two fronts, just ask   \nhitler. so it's one amateur   \nfont at a time. by the way,   \nyour deletions are ingenius.   \neven i never thought of that,   \nand i hate comic sans more   \nthan ... well, i hate it more   \nthan anything. it's a sign   \nthat the last days are here   \nand armageddon is near. i've   \nactually seen it on tv.   \nmind-boggling. one last   \nthing- i've vectorized the   \nimage intended for stickers.   \nif anyone wants it, drop   \nme an e-mail.\n\n"
    },
    {
      "time": "4 Nov 2002 — 1:12pm",
      "content": "Isaac, bring some more info for the typophiles.   \n   \n...Are you a design student? Is this ban comic sans movement a hostile thing or a laid-back thing, a satirical thing or a serious thing?   \n   \nWhy include the picture of Vincent Connare on the sticker? HE is not comic sans. Did he ask you to take it off your site? If he did ask, would you?   \n   \nTell us some of the fonts that you DO like.   \n   \nAnd is the \"design\" of the site, www.bancomicsans.com, a wry statement on comic sans or did it just turn out that way?   \n   \nbj\n\n"
    },
    {
      "time": "4 Nov 2002 — 9:12pm",
      "content": "here's the deal. i didn't mean to sound like that was my web site. i didn't make it, and i don't know who did. i'm just a believer. my passion for hating comic sans is a healthy (i hope) blend of satire and frustration. i'm a design student, graduating in december, and i'm completely bewildered by other students who use it because it's \"cute\" or whatever reason they give. like, lewis, i think it's just an arbitrary decision on their part, as if typography is some kind of minor detail they slap on their project at the last minute. that offends me. here's a funny story from school: i was in the library looking for a specific book for my typography class and couldn't find it. i went to ask the person at the desk (ostensibly a librarian, but...) to help me find a book on typography. she said (and this is an exact quote), \"a book about typing? let's see...\". typing? typography! gee my krug! anyway, like lewis' prof, i just get so tired of seeing it when there are so many other options. a lot of my message also goes to the administartive offices at school. i don't know if they think we like it or what, but there are always notices and announcements on the bulletin boards set completely in comic sans, and sometimes they get fancy and go with corsiva.   \nfonts i like? that's a huge can of worms, as you can imagine. my first love was univers (don't laugh) just because it's so simple and consistent through all of it's weights. i dig a lot of zuzana licko's stuff, and local heroes thirst have some cool stuff. btw, be on the lookout for ex-thirst designer patricking's new font next year. he gave me a sneak peek at it a while back. it's based on some herbert bayer sketches, so obviously it's going to be, y'know, bayerish, but i love it so far. also, some of the fonts i've seen in the critique boards here have blown me away. off the top of my head: review beta by jared benson and pill gothic by christian robetson.   \ni feel like hrant with this ultra-long post. so bj, i hope you don't think i'm going to assassinate vince. i really am a nice guy. if you're ever in chicago i'll prove it. you can stay at my place if you need to (sorry, not in my bed. my wife has that spot), or i'll just make you some cinnamon rolls or something.\n\n"
    },
    {
      "time": "4 Nov 2002 — 10:19pm",
      "content": "I think we can all breathe a little easier now.   \n   \n Thanks for the xplanation. I'll remember the cinnamon roll offer if I'm ever in Chicago.   \n   \nbtw, the site (bancomicsans.com) belongs to Dave Combs of Indianapolis. (thanks Anthony).   \n   \n   \nbj\n\n"
    },
    {
      "time": "5 Nov 2002 — 5:38am",
      "content": "Hope you don't know what phonetically means \"Connare\" in french: \"connard?\"   \n   \nG.\n\n"
    },
    {
      "time": "5 Nov 2002 — 7:38am",
      "content": "More interesting is the aviary connection: canard/mapgpie.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2002 — 12:30pm",
      "content": "\\> produced in and distributed by one of the largest corporations in the world   \n   \nCome on, large corporation mess up typography all the time.   \n   \n\\> Run it through TTX   \n   \nAnybody who strikes down ComicSans based on technical merit is a retard. But I think the concern here is aesthetic/cultural, and there's no question that more typophiles dislike it than like it. Why?   \n   \n--   \n   \nI think deleting fonts does have an unethical element, and it's not activism; it's more like guerilla warfare. But does it help? I think it might. Does education also help? Certainly. What does \"bancomicsans.com\" accomplish? More than its absense.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2002 — 1:41pm",
      "content": "\\>why not read some books and then discuss typography in a critical, engaged (and engaging) way?   \n   \nthere is nothing i would like more in the world than to do just that, and that's why i love this website and have a deep appreciation for those who created it and run it. i can't speak for anomonis (is that supposed to be anonymous?), but that is a big part of the reason i'm frustrated. hrant is right when he says people who actually like and have a knowledge of type generally do not use comic sans. discussions in my typography classes generally boil down to me, the instructor, and one or two others actually participating and the rest of the students staring with mouths agape. once i gave a brief (20 minutes) presentation on the history of sans serif fonts and the class was bored to the point of insanity. maybe it was me. as far as the deletions, i agree with hrant and anomonis both. there is an ethical problem anytime you take someone's agency away, but at the same time, my experience has shown me that no amount of discussing or proseletyzing (and i've done tons of both) can change someone if they don't want to be changed. deleting offensive fonts may be the only recourse some people see. and when i say offensive, i'm referring not only to my opinion of the aesthetics of it, but to other students and designers lack of effort and care when they use it. i love typography, and when someone shows it so little respect, i get offended.   \n   \nbtw, my participation in the sticker campaign is mostly just a lot of fun.\n\n"
    },
    {
      "time": "5 Nov 2002 — 1:59pm",
      "content": "\\> deleting ComicSans   \n   \nI just realized that one should let people know that it's been deleted: it makes it less unethical, and more importantly it makes it an \\*issue\\*.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2002 — 5:29pm",
      "content": "\\> most people at my school who   \n\\> are clueless prefer comic sans,   \n   \nIsn't being clueless subjective? How do you know that these people aren't trying to target an audience who might appreciate this typeface? It doesn't bother me personally that you do not like it, I just think your reasoning needs a little more work.   \n   \n\\> i think because it's closer to   \n\\> the beginning of the font menu.   \n   \nI think this is an asinine reason. Do you really think people outside of \"the world of typography\" have no desire to make a statement or visually communicate to others? Isn't that a bit judgmental?   \n   \n\\> so it's one amateur   \n\\> font at a time.   \n   \nAnother asinine remark.   \n   \n\\> today my professor asked me to delete Comic Sans off of all the computers   \n   \nThis is one solution to this \"supposed\" problem. But wouldn't a more appropriate solution be to simply educate the students about the typefaces which are not to be used (along with sound reasoning as to why).   \n   \n\\> students who use it because it's \"cute\"   \n   \nBut, if this is the reason they are using it, maybe they feel it communicates cute. Again, subjective.   \n   \n\\> More interesting is the aviary connection: canard/mapgpie.   \n   \nReally? :-D How bizarre.   \n   \n\\> It's funny to think of Comic Sans as an \"amateur font\"...   \n\\> I'm not going to argue that what typeface people use...   \n\\> But really what this comes down to is a foolish exercise...   \n\\> Instead of wasting time with little web sites and clandestine font deleting...   \n   \nWell spoken.   \n   \n\\> Anybody who strikes down ComicSans based on technical merit is a retard.   \n   \n:-D Totally agree.   \n   \n\\> aesthetic/cultural   \n   \nWhat about the fact that this says a lot about the break-down (read: total failure) of the educational system. When I have taught typography/design classes I always give the students a week or two for experimentation. Then when they bring in roughs set in a typeface that is meant for the viewing on a computer, I show them and explain to them why their selection isn't sound. I have had a few students insist they chose the best face and to them I would smile and nod. I cannot design for them, I can only help in the process. It is, after all, their portfolio.   \n   \n\\> no amount of discussing or proseletyzing   \n   \nThis is sad, but true.   \n   \n\\> but to other students and designers lack of effort and care when they use it   \n   \nFor those that do choose poorly their typefaces, well it let's those of us that supposedly \"know\" what we are doing truly shine. (Tongue in cheek) Kinda separating the, ahem, men from the boys.   \n   \n---   \n   \nWhen I was in England, Vinnie actually showed me this site. He thought it was hilarious. He knows the font was developed for a children's computer application and it was never meant to be included in the font pack for the public. As Joe pointed out and I've experienced first hand, finding the typeface used in odd situations is a game for Vinnie.   \n   \nI think the ban should be on \"bad communication\" not the poor little unassuming typeface. Typography in the end isn't, as Yer Momma has stated, about the typeface. I think it does play a part. Certainly a typeface can communicate and imply many things. Comic sans is not, perhaps, the most appropriate choice for an airline company.   \n   \nI personally think more time should be spent educating ourselves and helping those that truly do want help. Not wasting energy and time on the details that really don't matter, such as banishing a typeface that doesn't need banishing.   \n   \nMaybe a bit wordy. In the end, it comes down to education and that makes me sad. Sad that instead of trying to educate we are simply becoming boring and dogmatic. Leave poor comic sans, and helvetica for that matter, alone.\n\n"
    },
    {
      "time": "5 Nov 2002 — 5:47pm",
      "content": "\\>\\> i think because it's closer to   \n\\>\\> the beginning of the font menu.   \n   \n\\> I think this is an asinine reason.   \n   \nIt's a bad reason, but it's also true. The same thing at the other end: when a user is looking for a font but runs out of choices, he often chooses Zapf Chancery.   \n   \n\\> wouldn't a more appropriate solution be to simply educate the students   \n   \nI agree that education is the \"main way\". But deleting is not useless; fewer choices (especially the absense of \"fall-back\" choices) promotes clearer thinking.   \n   \n\\> it was never meant to be included in the font pack for the public.   \n   \nHmmm. It's strange how this seems to be a standard excuse or something. John Hudson has said that Sylfaen (which is included with Office2000, but has flawed Armenian and Georgian components) was never supposed to actually ship...   \n   \n--   \n   \nTiffany, there is merit to the argument that how you \\*use\\* a typeface is central, especially from the viewpoint of a \\*user\\* of type. But from the perspective of a \\*maker\\* of type, there is very much a good and bad to it (even if it's subjective) - just like you can use a font well or poorly! For example, the letterspacing in Helvetica is \\*bad\\*.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2002 — 7:49pm",
      "content": "What do you mean? Starting to talk is the first step.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2002 — 10:06pm",
      "content": "such passion, everyone! so, due to my laziness and the fact that i had to catch a train, i didn't properly express myself.   \n   \n\\>TYPOGRAPHY IS NOT ABOUT FONTS. TYPOGRAPHY IS NOT ABOUT COMIC SANS. TYPOGRAPHY IS NOT ABOUT YOUR PRESENTATION ABOUT THE HISTORY OF SANS SERIFS.   \n   \nof course i don't think typography is about my piddly presentations, i was juxtaposing the passion some people have for learning as much as possible about type and others who couldn't care less about the difference between times new roman and helvetica.   \n   \n\\>\\>students who use it because it's \"cute\"   \n   \n\\>But, if this is the reason they are using it, maybe they feel it communicates cute. Again, subjective.   \n   \nagain, my laziness. i forgot that you all haven't seen it in the contexts i reference. comic sans on a hip hop cd cover? i reckon not. i've inquired as to the use of this font during critiques, and generally the answer is, \"it's cute\", or, \"i just thought it worked.\" so there really isn't any attempt to communicate any sort of feeling or vibe, it was just there.   \n   \n\\>\\>i think because it's closer to   \n\\>\\>the beginning of the font menu.   \n   \n\\>I think this is an asinine reason. Do you really think people outside of \"the world of typography\" have no desire to make a statement or visually communicate to others? Isn't that a bit judgmental?   \n   \ni was referencing fellow students, not the public at large. recent sightings of projects using comic sans include the above mentioned hip hop cd cover, a menu for a fancy restaurant, as part of a personal logotype (hey, it's your logo), and as body copy in a magazine mock-up. appropriate?   \n   \n\\>\\>so it's one amateur   \n\\>\\>font at a time.   \n   \ni admit, that was an asinine statement. can i use scoles' \"lack of sleep\" excuse?   \n   \nin the end, my fun little steam-letting-outing sticker game served as a poor introduction to people whose abilities and opinions i have come to respect as i've been perusing these boards. maybe the all powerful moderators can just delete this whole thing i can start again.   \n   \ntiffany - asinine? i haven't been called that in ... well, at least a couple of days. but i agree with you anyway.\n\n"
    },
    {
      "time": "6 Nov 2002 — 12:58am",
      "content": "_\\> can i use scoles' \"lack of sleep\" excuse?_   \n   \nSure, Isaac! Toss in that excuse whenever you need   \nit. It sure comes in handy. I think I'll use it now: I   \nwrote the following on far too little sleep...   \n   \n   \nThere are a lot of assumptions being made as to why   \nthe \"Ban Comic Sans\" campaign began. But the   \nwebsite lists no reasons. No manifesto is posted.   \nSo remember that most of what people here are   \nresponding to is Isaac Stanfield's _interpretation_ of   \nwhat the sticker campaign is about.   \n   \n   \nThat said, I'm learning a lot from this thread.   \nTwo things I do know:   \n   \n   \n1. If the creator of the campaign intended to _incite   \ndialog_ about...   \n   \n a. the merits or demerits of Comic Sans   \n b. misguided typeface selection, or   \n c. what signs point to amateurish design   \n   \n...then he succeeded. He's definitely generated a   \ndiscussion, and that is often the purpose of a   \ngrassroots campaign.   \n   \nMostly I just think it's funny. People who don't might   \nhave a different sense of humor, but they also might   \nbe taking this far too seriously.   \n   \n   \n2. A font's location in the font menu can have an   \ninfluence on the user's selection. I know it because   \nI've seen it - more than once. People who don't care   \nor are short on time, rush to the first font that agrees   \nwith them. A font near the top of the menu has a   \ngood chance of getting picked. I'm not talking about   \ndesigners here, I'm talking about people who do not   \nearn a living using type. They are people with an   \nimmediate need, whipping out a flyer or sign. Their   \ncontribution is still important - these people produce   \na pretty big part of what the world sees.\n\n"
    },
    {
      "time": "6 Nov 2002 — 1:03am",
      "content": "Incidently, tonight I saw Comic Sans used very   \nappropriately: for the titles in a [documentary](http://web.archive.org/web/20131107162348/http:/www.hbo.com/americaundercover/journeys/) on HBO.   \n   \nIt's rare, but it happens.\n\n"
    },
    {
      "time": "6 Nov 2002 — 6:05am",
      "content": "thanks for permission to use your excuse. my wife doesn't believe it anymore, but maybe you guys will.   \n   \n\\>A font near the top of the menu has a   \ngood chance of getting picked. I'm not talking about   \ndesigners here, I'm talking about people who do not   \nearn a living using type.   \n   \nexactly what i'm talking about. i think it's sad that people who want to be designers are doing the same thing. i think they should at least care a little about type.   \n   \ni'm starting to feel bad about plastering vince's face all over, especially since he apparently doesn't like it. i guess i should change the sticker. what a sheep i was to use someone else's anyway.\n\n"
    },
    {
      "time": "6 Nov 2002 — 6:17am",
      "content": "The more you talk about Comic Sans, the more I am starting to like Comic Sans again.\n\n"
    },
    {
      "time": "6 Nov 2002 — 8:29am",
      "content": "then i have done a great disservice.\n\n"
    },
    {
      "time": "6 Nov 2002 — 9:18am",
      "content": "\\>A font near the top of the menu   \nhas a good chance of getting picked   \n   \nOk, so don't delete it, just rename it Zomic Sans or Verysad Sans.\n\n"
    },
    {
      "time": "3 Nov 2002 — 11:50pm",
      "content": "Hilarious. Vincent Connare--Comic Sans now infamous   \ndesigner--gives an equally funny response [here](http://web.archive.org/web/20131107162348/http:/www.microsoft.com/typography/links/news.asp?nid=2648).\n\n"
    },
    {
      "time": "4 Nov 2002 — 12:15am",
      "content": "I have a confession: at school I delete comic sans from every mac i sit at. Is this criminal destruction of communal property, or is it justifiable, given the fact that it's comic bloody sans and no one at a design school should even consider using it anyway? Excoriate me or justify me, either way my conscience needs to know.\n\n"
    },
    {
      "time": "4 Nov 2002 — 1:12am",
      "content": "Hmm, typographic activism. That probably deserves   \nit's own banned book.   \n   \nAnomonis, why limit yourself to Comic Sans? Why not   \nSand as well? (Ok, so I'm 85% joking, but only because   \nI'm a responsible citizen.) For less subtle impact, you   \ncould just put the stickers all over campus...\n\n"
    },
    {
      "time": "4 Nov 2002 — 8:37am",
      "content": "Yes, but stickers are more expensive than the recycle bin. And as for Sand... we shall see.\n\n"
    },
    {
      "time": "4 Nov 2002 — 8:20pm",
      "content": "It's funny, the synchronicity. I work in the graphic design studio at my school and today my professor asked me to delete Comic Sans off of all the computers. Which is something I'd be more than happy to do. I don't think he is aware of the ban comic sans campaign, but I know he is sick of seeing it in his student's work.   \n   \nIt's not funny how little my peers think about typography. Most of them think \"Typography? That's words, right?\" and then they arbitrarily pick a typeface. And these are people who are going to graduate in a month.\n\n"
    },
    {
      "time": "5 Nov 2002 — 11:43am",
      "content": "Pemberton said: 'Hmm, typographic activism.'   \n   \nI say: not at all. (Substantive) typographic activism is a whole other thing entirely.   \n   \n-----   \n   \nIt's funny to think of Comic Sans as an \"amateur font\". Of course it is far from that, having been produced in and distributed by one of the largest corporations in the world. Run it through TTX and then tell me if you still think it is \"amateur\".   \n   \nI'm not going to argue that what typeface people use to do their typography doesn't matter, because that is a naive and reductive argument. It matters certainly -- up to a point.   \n   \nBut really what this comes down to is a foolish exercise that doesn't accomplish anything. If you are motivated to spread the gospel of rational and diligent typography, then you should direct your efforts to something more constructive than deleting fonts on public computers. It's a childish, wannabe-guerilla, watered-down-Adbusters sort of thing to do.   \n   \nInstead of wasting time with little web sites and clandestine font deleting, why not read some books and then discuss typography in a critical, engaged (and engaging) way? Then you can begin to form a plan of action for promoting typographic progress, right?\n\n"
    },
    {
      "time": "5 Nov 2002 — 1:24pm",
      "content": "First, I take the 'ban comic sans' site for what it is,   \nhumor. It's on the same order as poking fun at Hobo or   \ncreating a mockumentary of Cooper Black. (Although,   \nusing Connare's picture is in poor taste.)   \n   \nThis isn't a question of whether Comic Sans has   \nintegrity as a typeface. It's a commentary on fonts in the   \nhands of amateurs--students, professionals and lay   \npeople alike. This problem isn't new either. How many   \ntimes have we seen Apple's Chicago in print (eww).   \n   \nConnare's own comments hit the nail on the   \nhead... (The link I posted earlier was broken.)   \nRead the [article on Microsoft's Typography site](http://web.archive.org/web/20131107162348/http:/www.microsoft.com/typography/links/news.asp?nid=2648).   \n   \nAnd an excerpt:   \n   \nI have seen Comic Sans used well - Disney has used it in some advertising - and I have seen it used poorly - An English coach line uses Comic Sans as its logo font painted on the side in half meter lettering. I am too personally amused when I go to restaurants and have to read it off the menu.   \n   \n--Vincent Connare   \n   \nIn the end, I agree with 'Your Mother.' Deleting fonts on   \npublic or private property isn't going to educate   \nanybody about good typography. Your energy could be   \nspent in more productive ways.\n\n"
    },
    {
      "time": "5 Nov 2002 — 2:26pm",
      "content": "But Isaac, you don't seem to see the point. Bluntly: TYPOGRAPHY IS NOT ABOUT FONTS. TYPOGRAPHY IS NOT ABOUT COMIC SANS. TYPOGRAPHY IS NOT ABOUT YOUR PRESENTATION ABOUT THE HISTORY OF SANS SERIFS. You are not seeing the forest for the trees.   \n   \nAnd Hrant said: \"Come on, large corporation mess up typography all the time.\"   \n   \nHrant, you missed my point. I was responding to the person who said Comic Sans was an AMATEUR font. It is as far from AMATEUR as you get. You may think the letters in the font are ugly, but that is another thing entirely. It was made by a guy who was PAID to DESIGN TYPE.\n\n"
    },
    {
      "time": "5 Nov 2002 — 7:23pm",
      "content": "Removing Comic Sans is not a solution. When students ask where it went -- most won't even notice -- a dicussion will be sparked as to why. And even if no one notices it will still be talked about.\n\n"
    },
    {
      "time": "6 Nov 2002 — 1:20pm",
      "content": "If you're reading this message in a happy, bubbly (although sometimes inappropriate) typeface, then you have Comic Sans on your computer.   \n   \n However, if all you see is Arial, then there's a good chance your computer is the victim of a guerilla font saboteur.   \n   \n=)\n\n"
    }
  ]
}
