{
  "id": "42155",
  "title": "Graphic Designers",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What are their roles? What kind of work do they produce? Are they advertisers? Photographers? Typographers? or people who generate concepts for advertising, people who art direct in photography etc? Or are they there to produce leaflets, logos, junk mail, stationery sets and editorial work? Hmm...what do you think?  \nPS graphic designers have been told they are not advertisers, they are not illustrators or photographers. So what are they and what do they do?\n\n [‹ What a cop out](http://web.archive.org/web/20080220142553/http:/typophile.com/node/42203 \"Go to previous forum topic\") [Freight Micro for headlines ›](http://web.archive.org/web/20080220142553/http:/typophile.com/node/42241 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080220142553/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 16.Feb.2008 8.30am",
      "content": "Well, for starters I’m guessing that most of them **do their own research.**\n\n"
    },
    {
      "time": " 16.Feb.2008 12.18pm",
      "content": "@James - Nice. (and true) :)\n\n@missgiggles - There are loads of specialties that can live under the umbrella of Graphic Design; identity design, interface design, publication design, information design, and so on.\n\nI usually only call myself a graphic designer in when speaking to people who either wouldn’t get the specifics or wouldn’t care. :) Doctors are a (somewhat) reasonable analogy. Most of them practice within a specialty or sub-specialty like cardiology, neurology, etc. When asked what they do for a living, much of the time they’ll just tell you they’re “a doctor”.\n\n"
    },
    {
      "time": " 16.Feb.2008 12.27pm",
      "content": "I’m a graphic designer, and I certainly am a photographer. I use my photography to augment my Graphic Design. The boundaries of what constitutes a graphic designer has changed since the old days of X-acto knives and paste-up.\n\nThese days, a designer IS and illustrator/photographer/etc. It’s the most encompassing and non-specific label you can put on someone who does that specific job.\n\nIt’s called Visual Communication, and that’s what all of the schools are now calling it and offering degrees for.\n\n"
    },
    {
      "time": " 16.Feb.2008 3.50pm",
      "content": "I’m with Dan on this one. In the course of designing graphics I’ve been an illustrator (in a number of media), photographer, typographer, video editor, costume designer, webpage designer, sculptor, etc., etc.\n\nOn a related note, I’ve been holding off on printing my business cards because I can’t think of a title. “Graphic Designer” just doesn’t seem to encompass what I can do. Any ideas?\n\n- Lex\n\n"
    },
    {
      "time": " 16.Feb.2008 4.03pm",
      "content": "I’ve seen “Visual Communicator”, “Graphic Journalist” (for news designers), “Visual Communications Expert” etc.\n\n"
    },
    {
      "time": " 16.Feb.2008 7.16pm",
      "content": "I would think that asking other people what they think _is_ research.\n\nAsk this question to 10 different people, you might get _at least_ 10 different answers.\n\n-=®=-\n\n"
    },
    {
      "time": " 16.Feb.2008 10.05pm",
      "content": "Yes.\n\n"
    },
    {
      "time": " 16.Feb.2008 10.10pm",
      "content": "Well said guys. there’s also the Marketing Director hat you get to wear...I’ve renamed albums, totally changed the number or type of pieces being designed, etc.\n\nLex, I’m in the process of reworking my personal identity now (in a graphic sense, not a psychological one) and I’m leaning towards just “Designer” for my next card. Encompasses pretty much anything a client could ask for.\n\n"
    },
    {
      "time": " 17.Feb.2008 11.00am",
      "content": "[http://www.rgdontario.com/hireADesigner/aboutGraphicDesign/default.asp](http://web.archive.org/web/20080220142553/http:/www.rgdontario.com/hireADesigner/aboutGraphicDesign/default.asp \"http://www.rgdontario.com/hireADesigner/aboutGraphicDesign/default.asp\")\n\n"
    },
    {
      "time": " 17.Feb.2008 11.34am",
      "content": "“I’m leaning towards just “Designer” “\n\nI would argue against that. Given that graphic designers are about clarifying communication, the term ’designer’ isn’t all that clear.\n\nFashion designer?\n\nInterior designer?\n\nIndustrial designer?\n\nI think it’s not a bad idea to use an appropriate adjective or two if one can.\n\n"
    },
    {
      "time": " 17.Feb.2008 6.19pm",
      "content": "I’m an imagineer!\n\n"
    },
    {
      "time": " 17.Feb.2008 7.39pm",
      "content": "It’s not quite the same thing, but “Art Director” has a similar perception problem. Here is what Saul Bass had to say about it:\n\n“For years, my mother wondered what I do; that is, what i _really_ do. She new I did art work—and actually she was very happy about it despite some vagueness that surrounded the matter. Her only concern was that I should make a living, and I seemed to be doing all right. But finally her curiosity overcame her timidity, and, I think with some prompting from the neighbors, she finally asked me what it was that I _really_ did.\n\n“I pulled out a proof of an ad that I had designed and I showed it to her and said, ‘Mom, that’s what I do.’ She looked at this and said, ‘Oh, I see . . . ’ and she pointed to a photograph in the ad and said, ‘_That’s_ what you do?’ I said, ‘Oh, no, you see, there are photographers—and they are specialists—they know all about cameras and things of that kind, and they make the photographs.’\n\n“‘Oh,’ she said, disappointed, ‘Then _this_ is what you do?’ I said, ‘No, that’s typography. You see there are special organizations who do nothing but set type—you know, Garamond, Caslon, etc. . . . these people do that.’ Again she was a little disappointed. She pointed to the lettering and we went through this again. Finally she looked at me somewhat concerned, and said, ‘Well, now, what do _you_ do?’ I said, ‘Well, you see, I conceived the whole thing, and then I get all these people together and get them to carry out the process.’ She looked at me very coyly, and said, “Oh—you devil!’”\n\n(From “The Design of Advertising” by Roy Paul Nelson)\n\n"
    },
    {
      "time": " 18.Feb.2008 5.28am",
      "content": "i’ve used various titles depending on my role on the project :\n\nart director  \ncreative director  \ndesign director  \ndesigner  \nvisual designer  \nvisual consultant  \nmotion graphics  \nmotion graphics designer  \nretinal advisor  \nretinal police\n\non my last business card i had:  \ncreative direction and media design\n\nwhen people ask me what i do, i usually say :  \n“i’m a graphic designer” - but i’ve never used that as a formal title.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.06am",
      "content": "Haley clearly works for an advertising agency. :P\n\n"
    },
    {
      "time": " 18.Feb.2008 11.22am",
      "content": "I spent some time thinking about this and I’m wondering if “Media Designer” would be appropriate, since I do video and web work in addition to logo design and print design. What do you guys think?\n\n- Lex\n\n"
    },
    {
      "time": " 18.Feb.2008 11.25am",
      "content": "What isn’t designed?\n\nI used to be OHGD. Now I’m just OHG.\n\n-=®=-\n\n"
    },
    {
      "time": " 18.Feb.2008 11.25am",
      "content": "There is too much churn in language. University and textbook culture push this a bit, so ideas can be repackaged as new/better/different.\n\nI think sticking to the classic and accepting the limitations and flaws could be worth the pain. I think it helps the profession over the long haul. I was never a visual communicator.\n\n"
    },
    {
      "time": " 18.Feb.2008 2.05pm",
      "content": " **I would argue against that. Given that graphic designers are about clarifying communication, the term ’designer’ isn’t all that clear.**\n\nTrue. and I should probably clarify that I’m a graphic designer with a degree in architecture that also does some interior work, a bit of architecture, etc...hence the intentional vagueness. but point taken :)\n\n"
    },
    {
      "time": " 18.Feb.2008 5.40pm",
      "content": "[http://en.wikipedia.org/wiki/Graphic\\_design](http://web.archive.org/web/20080220142553/http:/en.wikipedia.org/wiki/Graphic_design \"http://en.wikipedia.org/wiki/Graphic\\_design\")\n\nGiven that “graphic design” is one of the few growing professions nowadays (or so I hear) I think more people generally know what it means than used to be the case. The next question is usually “what do you design” and then you can get into specifics. And no, Uncle Al, it doesn’t mean I draw the pictures.\n\nBut we do a little bit of everything. In addition to designing (layout/print/books, in my case) I art direct photo shoots, check proofs, read copy for mistakes, typeset, lots of things that fall outside the job description but that (I hope) make me more valuable to my clients.\n\nYou might also peruse AIGA.org to get a sense of the business: [http://www.aiga.org/](http://web.archive.org/web/20080220142553/http:/www.aiga.org/ \"http://www.aiga.org/\")\n\n"
    },
    {
      "time": " 18.Feb.2008 9.03pm",
      "content": "Mark -\n\nLoved you sharing the Saul Bass story from “The Design of Advertising” by Roy Paul Nelson. Nelson was my instructor and mentor in college.\n\nI finally gave up years ago when trying to explain to my grandmother what I did for a living and just said “I make things pretty.” To which my grandmother FINALLY responded with “Oh, that’s nice” and she was totally content.\n\nJeff Fisher | Engineer of Creative Identity | [Jeff Fisher LogoMotives](http://web.archive.org/web/20080220142553/http:/www.jfisherlogomotives.com/)\n\n"
    },
    {
      "time": " 19.Feb.2008 7.31am",
      "content": "“True. and I should probably clarify that I’m a graphic designer with a degree in architecture that also does some interior work, a bit of architecture, etc...hence the intentional vagueness. but point taken :)”\n\nThe solution there is simple: have two business cards.\n\nUnless your clients tend to need BOTH a new logo and a new office designed at the same time, you’d be fine presenting one card or the other depending on the client.\n\n"
    },
    {
      "time": " 19.Feb.2008 10.24am",
      "content": "also a good idea...thanks. though i’m having enough trouble with just one as evidenced in my identity design crit :)\n\n"
    },
    {
      "time": " 19.Feb.2008 10.37am",
      "content": "This was about 20 years ago. I got to know the woman who ran the general store in Victoria Beach (Manitoba), a hardy old soul, and one day she asked what I did for a living. I told her I was an art director in an ad agency. “Oh Dear,” she said with a look of disgust, “Well, I suppose somebody has to do it.”\n\n"
    },
    {
      "time": " 19.Feb.2008 10.40am",
      "content": "[duplicate]\n\n"
    },
    {
      "time": " 19.Feb.2008 10.41am",
      "content": "I’m going to go out on a limb here and say graphic designers design graphics. Art directors direct the art and so on and so forth.\n\nWhy do we need one job description in the first place?\n\n"
    },
    {
      "time": " 20.Feb.2008 4.58am",
      "content": "Nick: haha. That’s funny.  \nMark: Thank you for sharing the Saul Bass story.  \nI know my tutors mum still does not have a clue to what he does. He just gave up in the end. I guess it depends on the type of work you are doing at the time.\n\n"
    }
  ]
}
