{
  "id": "42159",
  "title": "Major Project - Minimalist Book",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m in the process of collecting the content for my Major Final Project for my BA degree in Graphic design currently. It will take the form of a book tackling the subject of minimalism, style and typography.\n\nCurrently I am contacting a number of designers for interviews to answer a short set of questions in regard to my topic. If anyone has any names for designers that might fit in well for my project that would be appreciated. Their geographic location is not really an issue, but London based or such might be a plus. Or if you are a designer who might fit my project and be up for an informal interview of some kind, please contact me, in thread or by email, hello at manhem dot net.\n\nI have been looking to contact Willi Kunz, (Author of Typography: Macro + Micro Aesthetics, and teacher of Typography at Ohio State University) but without any success of finding any contact details. If anyone knows how to get in contact with him, that would be appreciated.\n\nAny names or such would be much appreciated. :)\n\n-Gus\n\n [‹ Mathamatical grid](http://web.archive.org/web/20080220142605/http:/typophile.com/node/42170 \"Go to previous forum topic\") [A typographic brief ›](http://web.archive.org/web/20080220142605/http:/typophile.com/node/42156 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080220142605/http://typophile.com/user/23549\" title=\"View user profile.\">Gus</a>",
  "time": "<br>",
  "uid": "23549",
  "comments": [
    {
      "time": " 16.Feb.2008 8.55am",
      "content": "[Kenya Hara](http://web.archive.org/web/20080220142605/http:/www.ndc.co.jp/hara/home_e/) would be a great choice. Talk to him (or read [his book](http://web.archive.org/web/20080220142605/http:/www.amazon.com/Designing-Design-Kenya-Hara/dp/303778105X/ref=pd_bbs_sr_1?ie=UTF8&s=books&qid=1203180842&sr=8-1)) and you’ll learn about minimalism from a very zen perspective.\n\n"
    },
    {
      "time": " 16.Feb.2008 2.13pm",
      "content": "Experimental jetset comes to mind. Don’t really know their number...\n\n"
    },
    {
      "time": " 16.Feb.2008 3.57pm",
      "content": "Ah that’s great! More of this!\n\nKenya Hara seems to fit very good, thankyou James. Experimental jetset, the Dutch guys? They got contact details on their website, not very much recent work from what I could see but surely worth a try.\n\nThanks\n\n-Gus\n\n"
    }
  ]
}
