{
  "id": "42152",
  "title": "Is \"PRO\" really \"PRO\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Having some font that have \"PRO\" in their names, I wonder if that means the same?  \nI'll explain:  \nin the font Adobe Caslon Pro the characters like g with ^ and c with ^, which are being used in the independent language Esperanto could not be found, whereas in the font Minion Pro, there are present, just like in the font Garamond Premier Pro.\n\nAny comment on this?\n\nPS. I am new here, and I hope I can learn a lot from everybody.\n\n",
  "author": "gen79",
  "time": "16 Feb 2008 — 4:18am",
  "uid": "27205",
  "comments": [
    {
      "time": "16 Feb 2008 — 5:21am",
      "content": "In Adobe's terminology, a \"Pro\" font is one that contains diacritics for Central European and Baltic languages (Polish, Czech, Slovak, Hungarian, Lithuanian, Latvian, Estonian, Croatian, Slovenian), and an \"Std\" font is one without those characters even if it contains Western European small caps, swashes etc.\n\nBut of course, this is the minimal prerequisite. A \"Pro\" font may contain many more characters for different scripts, including Cyrillic and Greek, and more Latin characters, as well as alternate glyphs, small caps etc.\n\nA.\n\n"
    },
    {
      "time": "16 Feb 2008 — 5:34am",
      "content": "Hi,  \nthis question came up before; you can [run a search](http://web.archive.org/web/20131107174953/http:/www.google.com/search?q=site%3Atypophile.com+adobe+pro+fonts) or have a look at these older threads:\n\n[FF Meta OT or Pro? What's the difference?](http://web.archive.org/web/20131107174953/http:/www.typophile.com/node/32516)  \n [Is the Term ‘Pro’ Adobe property or a defacto standard?](http://web.archive.org/web/20131107174953/http:/www.typophile.com/node/19012)  \n [OpenType, TrueType, Type One PostScript](http://web.archive.org/web/20131107174953/http:/www.typophile.com/node/36876#comment-225921)\n\nThe short answer is: ‘Pro’ can mean a lot of different things; it’s not a standard. As your example illustrates, even two Pro fonts of one foundry can differ in glyph count/language support.\n\n[OpenType](http://web.archive.org/web/20131107174953/http:/typophile.com/wiki/OpenType) Pro, according to:\n\n- [Adobe (‘What makes a font a Pro?’ at Microsoft Typography)](http://web.archive.org/web/20131107174953/http:/www.microsoft.com/typography/links/news.aspx?NID=1474)\n- [Monotype](http://web.archive.org/web/20131107174953/http:/www.fonts.com/AboutFonts/Articles/fyti/OpenTypePro.htm)\n- [Typotheque](http://web.archive.org/web/20131107174953/http:/www.typotheque.com/fonts/opentype_pro_vs_std/)\n- [FSI/FontFont](http://web.archive.org/web/20131107174953/http:/www.typophile.com/node/36876#comment-225931)\n\n"
    },
    {
      "time": "16 Feb 2008 — 5:45am",
      "content": "Perhaps slightly off topic, our use of \"Pro\" in the designations of our CJK fonts, which are based on static glyph sets called character colections, is a bit different.\n\nIf a character collection Supplement contains primarily glyphs that correspond to character set standards, the \"Std\" designation is used for such fonts. Adobe-Japan1-4 (/Registry \"Adobe,\" /Ordering \"Japan1,\" and /Supplement 4) represents the glyph repertoire level that allows Japanese fonts to be declared as \"Pro\" fonts. Adobe-Japan1-4 defines 15,444 glyphs (CIDs 0 through 15443). The current Supplement is 6 (Adobe-Japan1-6), which defines 23,058 glyphs (CIDs 0 through 23057).\n\nGlyphs above and beyond character set standards are included in \"Pro\" fonts, and are intended to be used for professional and commercial publishing. This means additional punctuation, common ideograph variants, a rich set of Latin glyphs, to include a full set of italic forms (made accessible through the 'ital' GSUB feature), and so on. We have yet to define Supplements for our Chinese and Korean character collections that can be considered \"Pro\" level, and when time permits, that is something that I plan to do. Curiously, Adobe-GB1-5 defines 30,284 glyphs (CIDs 0 through 30283), but fonts based on this character collection are still designated as \"Std\" fonts, because the collection of glyphs is primarily based on character set standards, specifically GB 18030-2005.\n\nInterestingly, some font developers apparently have other criteria for designating their CJK fonts as \"Pro,\" such as Apple for their Chinese fonts that are based on GB 18030-2005. Their criteria is based solely on the number of glyphs. I find this to be a poor criteria, because the threshold is highly subjective. The criteria that I briefly described in the previous paragraph represents a much more practical and useful criteria for using the \"Pro\" designation for CJK fonts.\n\nDr. Ken Lunde  \nSenior Computer Scientist, CJKV Type Development  \nAdobe Systems Incorporated  \n [lunde@adobe.com](mailto:lunde@adobe.com)\n\n"
    },
    {
      "time": "16 Feb 2008 — 9:24am",
      "content": "In Adobe's terms, Helvetica Std is a \"Std\" font even though it includes Western+Cyrillic (but no CE). Though I must admit such cases are rare. In the vast majority of cases, \"Pro\" does indicates \"the character set beyond Windows Western, with at least Central European Latin diacritics included\". Typotheque sets the bar higher, as their Std fonts do include CE glyphs as well (but their Pro includes also Cyrillic and Greek).\n\nURW++ has a more elaborate scheme that involves \"L1\", \"L1.5\" and \"L2\" character sets. I somehow agree that there is a need for a term to describe the Western-only fonts (\"Std\" is OK here) but then there is also a need for two different terms, one to denote the Latin-only multilingual fonts (i.e. extended character coverage within one writing system), and another to describe fonts that offer more than that (Cyrillic, Greek and other alphabets, potentially).\n\nFor my internal purposes, I've adapted the optional \"Basic\" vs. \"Plus\"/\"Extended\" suffix. An \"Std Basic\" font would really be just the Western codepage, an \"Std Plus\" or \"Std Extended\" font would have small caps, oldstyle numerals, extra ligatures or perhaps swashes, but still only for the Western characters, a \"Pro Basic\" font would offer Western and Central European diacritics, and perhaps some alternate glyphs for those, but no Cyrillic or Greek, while \"Pro Plus\" or \"Pro Extended\" would mean an open-ended font with at least two writing systems supported (one other than Latin).\n\nBut then again, once you start making those finer distinctions, you can never stop, and also, there is no way to \"standardize\" those terms across vendors (not that I would think such standardization is necessary).\n\nA.\n\n"
    },
    {
      "time": "16 Feb 2008 — 9:53am",
      "content": "I first used the designation \"Pro\" to distinguish an OpenType upgrade to a Latin 1, Type 1 font, by the addition of contextual alternates. (Handsome Pro.) That's all, no extra language support.\n\nHowever, in future I plan to release basic fonts that will have Extended Latin support, and Pro fonts that will also have typographic OpenType features (small caps, alternate figures, etc.)\n\nIMO, \"everyone\" now needs Extended Latin support (and perhaps Greek and Cyrillic--blame the E.U.), but only professionals need true small caps and superior figures.\n\n"
    },
    {
      "time": "16 Feb 2008 — 12:43pm",
      "content": "Isn't that the official position of Microsoft as well? Their language support is intense, but their typographic support is \"eh\".\n\nYou could come up with a different standard based on Boxing terms.\n\nSuper heavyweight  \nHeavyweight  \nLight heavyweight  \nMiddleweight  \nWelterweight  \nLight welterweight  \nLightweight  \nFeatherweight  \nBantamweight  \nFlyweight  \nLight flyweight\n\n"
    },
    {
      "time": "16 Feb 2008 — 1:55pm",
      "content": "@Dan: [Already taken](http://web.archive.org/web/20131107174953/http:/www.typography.com/fonts/font_styles.php?productLineID=100013), sorry. ;°)\n\n"
    },
    {
      "time": "16 Feb 2008 — 2:13pm",
      "content": "Ah, crap. I knew it.\n\n"
    },
    {
      "time": "16 Feb 2008 — 4:45pm",
      "content": "_Isn’t that the official position of Microsoft as well?_\n\nThanks Dan, that's the first time I've ever been compared to MS :-)\n\n"
    },
    {
      "time": "17 Feb 2008 — 10:31am",
      "content": "Perhaps we need a new term, other than \"Pro\", for fonts containing true small caps and superior figures and other typographic niceties, but not necessarily extended language support.\n\n"
    },
    {
      "time": "17 Feb 2008 — 10:55am",
      "content": "\\>Their language support is intense, but their typographic support is “eh”.\n\nI'm not sure that's entirely fair - Palatino Linotype, and the C\\* fonts combine good language coverage and \"Pro\" level western OT features. The core fonts have even broader language coverage and combining diacritic support via OpenType. On the application development front I don't think anything beats WPF in terms of support for OT features.\n\nCheers, Si\n\n"
    },
    {
      "time": "17 Feb 2008 — 11:20am",
      "content": "<cite>I'm not sure that’s entirely fair</cite>\n\nYep, good support for OT layout features in ClearType fonts, virtually no support for OT layout features in MS applications.  \nWPF is great in terms of giving application (and document) developers access to OT layout features, but this is of no relevance to end users' since no major application makes use of it yet. Unfortunately.\n\n"
    },
    {
      "time": "17 Feb 2008 — 11:24am",
      "content": "True - on the app front there's InDesign and it's all downhill from there :-(\n\n"
    },
    {
      "time": "17 Feb 2008 — 11:31am",
      "content": "_Perhaps we need a new term, other than “Pro”, for fonts containing true small caps and superior figures and other typographic niceties, but not necessarily extended language support._\n\nHow about \"Prosumer\"?  \nBut with a limited number in a font name Pro is a good concise three character way to designate \"more advanced than basic\" In the end, it seems like most foundries who sell Pro fonts tell you what is in each font, so having separate names for each potential suite of glyph sets or options is near pointless. Super-Pro or Mega-Pro or Premier Pro all imply better than pro, so as long as the features and range of glyphs can be referenced, having a specific name industry wide is not needed.\n\n"
    },
    {
      "time": "17 Feb 2008 — 11:58am",
      "content": "I'll note on the side that the accented characters needed for Esperanto are not part of the basic Adobe \"Pro\" character set, although some Adobe \"Pro\" families may have them.\n\n(This is because most of them are combinations used by no other significant language on the planet.)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "17 Feb 2008 — 1:02pm",
      "content": "_True - on the app front there’s InDesign and it’s all downhill from there :-(_\n\nI take it you're referring to Illustrator and Photoshop :-?\n\nQuark has been supporting OT features since v.7.\n\n\\*\\*\\*\n\nDitto what Rich said.  \nIt's very important for foundries to support the OT features in their fonts with good literature, either online or in pdfs and printed specimens.  \nNice to see FontShops' online method of showing OT features!\n\nHowever, it's still very difficicult for prospective buyers to figure out which OT fonts have, say, CE support.\n\nAscender does a nice job at its site, so you can \"Search fonts by Language\".\n\n"
    },
    {
      "time": "17 Feb 2008 — 2:12pm",
      "content": "\\>I take it you’re referring to Illustrator and Photoshop :-?\n\nAbsolutely, if you had to chart it ID would be at the top, then PS and Illustrator half way down the cliff, XPress near the bottom and everything else under water.\n\n"
    },
    {
      "time": "17 Feb 2008 — 2:46pm",
      "content": "I like the way you can bring the OpenType menu to the top level in Illustrator -- you can't do that in InDesign.  \nAnd by having separate OT and Character palettes, it makes a clear distinction between faux and real features (eg small caps, superiors).\n\nSo does Quark, and IMO it handles the main figure options better than Adobe, with two toggle buttons, rather than four options.\n\nThey all have room for improvement and slightly different OT implementation strategies, so I don't think InDesign is head and shoulders above the rest.\n\n"
    },
    {
      "time": "18 Feb 2008 — 8:33am",
      "content": "Apple Pages, Apple Keynote, Apple Numbers, Apple TextEdit running on Mac OS X 10.5.2 support virtually all \"advanced typographic\" features you'd wish. On top of that, Numbers produces wonderful charts and Keynote is a fantastic presentation tool. The only thing I cannot get so convinced about is Pages, so I stick to Word 2007 for Windows (especially since with the multilingual packs, it gives me spelling and hyphenation in 30 languages, and it easily integrates with 3rd party dictionaries and writing tools).\n\nA.\n\n"
    },
    {
      "time": "19 Feb 2008 — 10:21pm",
      "content": "Actually, Apple Pages running under OS X 10.5.2 does not support virtually all the advanced typographic features one would wish. Pages running under OS X 10.4.11 genuinely did, however, and this is one of my biggest single beefs with Leopard.\n\nI find it flabbergasting that this is still broken, but simply try it for yourself and you'll see--under Leopard, the Typography pane accessed from the Text palette in Pages cannot reliably generate small capitals, or old-style figures, or any of the gamut of other features, from OpenType fonts.\n\nOr, for that matter, even draw itself correctly!\n\nIn a word, it's crippled. And, for what it's worth, Pages cannot handle most 'variant glyphs,' or undertake fine-grained control of ligature settings (e.g., what if you don't \\*want\\* \"Th\" to be a ligature in Arno Pro?) under any version of Mac OS X.\n\n"
    },
    {
      "time": "1 Mar 2008 — 1:32pm",
      "content": "@peter.ricardo: Same here. I have had trouble with small caps and alternate figures in Keynote 08 – but only since upgrading from 10.4.11 to 10.5.2.\n\nI have figured out that small caps will not work if you select a whole sentence before a line break. If you select a few letters or words in the middle of a sentence, the small caps feature will work as expected. I have tested this in Pages 08, too, getting the same symptoms. Interestingly, in TextEdit everything works fine.\n\nSmall caps problems are not limited to iWork though: In the invoicing application I use, Billings 2.5, the small caps in my self-made template are broken, but as Adam Twardoch pointed out here: [http://www.typophile.com/node/37122](http://web.archive.org/web/20131107174953/http:/www.typophile.com/node/37122), this is due to a change in the way small caps are marked up in the RTF file format that Mac OS uses. Needless to say that Keynote has also forgotten all the small caps formatting, probably because of this issue.\n\nSo apparently there are at least two different small caps problems: Apps forgetting smcp formatting and apps not allowing certain kinds of smcp formatting.\n\n"
    }
  ]
}
