{
  "id": "42164",
  "title": "font file from a mac for install on a pc; is it possible?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi,\n\nThe piece i am working on uses a font that was sent to me by the designer who created the logo and stuff. I want to install the font (carpediem) onto my computer. The files came from a mac. Going thru my basic install routine seems to not be working. Any knowledge out there on this?  \nThanks,  \nsara\n\n [‹ FFIL and LWFN](http://web.archive.org/web/20080829234347/http:/typophile.com/node/15330 \"Go to previous forum topic\") [OpenType Conversion Issues ›](http://web.archive.org/web/20080829234347/http:/typophile.com/node/42160 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829234347/http://typophile.com/user/19653\" title=\"View user profile.\">sarafina</a>",
  "time": "<br>",
  "uid": "19653",
  "comments": [
    {
      "time": " 16.Feb.2008 3.27pm",
      "content": "The only font formats that work on both Macs and PCs are OpenType (.otf) or Windows TrueType (.ttf). If it’s coming from a Mac, and it’s not one of those, it’s not going to work on your PC. You’ll need to get hold of a version of the font in Windows TrueType (.ttf), OpenType (.otf), or Windows PostScript Type 1 (.pfb).\n\n"
    },
    {
      "time": " 16.Feb.2008 3.35pm",
      "content": "There are 3 files. one is .DS\\_Store one is CarpediemEF-Regular.bmap and the last is CarpeEFReg\n\nso the deal is these will not open for me?\n\nI only ask in the vain hope that they just need... different extensions typed on or such but it isn’t sounding good...\n\nThanks,  \nsara\n\n"
    },
    {
      "time": " 16.Feb.2008 4.38pm",
      "content": "No, you need software to convert. The Y&Y TeX program \\*mactopfa\\* will do it (maybe free from TUG), but without metrical data. There is another that will get kerning data from a “screen font” (“scrtoafm” ?? I forget).\n\nA lot easier with a commercial program like TransType.\n\nYou also should check the license agreement. I believe E&F, at one time anyway, allowed this. Some foundries don’t.\n\n"
    },
    {
      "time": " 16.Feb.2008 5.03pm",
      "content": "aaarrrgggghhhh....\n\n\\*sigh\\*\n\noh well at least i know now, thanks so much.\n\nsara\n\n"
    },
    {
      "time": " 16.Feb.2008 5.23pm",
      "content": "BTW, even with a conversion program, the mac files need to be sent to you stuffed. As soon as you see the “zero K” for file size, you’re lost. This comes from the data fork/resource fork Mac system.\n\n"
    },
    {
      "time": " 17.Feb.2008 10.47am",
      "content": "Note that even if the license for the retail font software allows the user to convert it, that doesn’t mean it allows them to share it with somebody else entirely. Usually, this is about as legal (with regards to copyright) as the other person sending you a copy of your favorite Office software suite. Might be fine if it’s OpenOffice, but not so much so with Microsoft Office.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 17.Feb.2008 2.53pm",
      "content": "the font was purchased by the association and its a case of the font moving with the association... so i don’t see any legal conflict. just data conflict ; -P\n\nthanks all,  \nsara\n\n"
    },
    {
      "time": " 17.Feb.2008 4.32pm",
      "content": "Sarafina — If you have X11 you can download FontForge for free and convert using that. As someone who has just begun what looks to be a steep learning curve on Font Forge I can say that to do what you want to do will take about a day of learning to use the software — ie it is at the easy end of the things that can be done with it. There’s an online tutorial that can guide you through some aspects.\n\nbest\n\nEl.\n\n"
    },
    {
      "time": " 17.Feb.2008 5.41pm",
      "content": "Yeah, the freebees can take so much time to learn & use that if you put any value on your time, the true cost is quite high. If you just want to convert a font, it’s usually cheaper to just re-purchase it. If you want to do custom work, then you do need the tools.\n\n"
    },
    {
      "time": " 18.Feb.2008 10.15pm",
      "content": "You might also see if the type foundry, Elsner + Flake, will simply allow you to “exchange” the Mac version for Windows, either for free or at a discount.\n\nCheers,\n\nT\n\n"
    }
  ]
}
