{
  "id": "42181",
  "title": "I am new: here are my 20 favorite serif fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am new, and I’d like to introduce myself by showing my 20 favorite serif fonts. Do you know them all?\n\n| Attachment | Size |\n| --- | --- |\n| [20fonts.pdf](http://web.archive.org/web/20081119055748/http:/typophile.com/files/20fonts.pdf) | 771.76 KB |\n\n [‹ How quickly is Typophile indexed?](http://web.archive.org/web/20081119055748/http:/www.typophile.com/node/42358 \"Go to previous forum topic\") [Giovanni Battista Bodoni or Giambattista Bodoni? ›](http://web.archive.org/web/20081119055748/http:/www.typophile.com/node/42367 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081119055748/http://www.typophile.com/user/27205\" title=\"View user profile.\">gen79</a>",
  "time": "<br>",
  "uid": "27205",
  "comments": [
    {
      "time": " 17.Feb.2008 4.28am",
      "content": "Well it seems the attached file won’t attach...\n\n"
    },
    {
      "time": " 17.Feb.2008 7.30am",
      "content": "Most of the more active users can positively answer your question without the file that you’re having trouble attaching.\n\n"
    },
    {
      "time": " 17.Feb.2008 7.33am",
      "content": "Is your file rgb? That seems to be the most common reason for attatchment problems.\n\n"
    },
    {
      "time": " 17.Feb.2008 7.54am",
      "content": "[How to post a sample or image](http://web.archive.org/web/20081119055748/http:/typophile.com/node/18067)\n\nWhy don’t you just post a list with the names (and links, perhaps)? Or is it supposed to be a little quiz?  \nF\n\n"
    },
    {
      "time": " 17.Feb.2008 9.23am",
      "content": "No rgb, just pdf, it says it is attached, but when I post it, it just won’t appear!\n\n"
    },
    {
      "time": " 17.Feb.2008 9.34am",
      "content": "I really like the third one.\n\n"
    },
    {
      "time": " 17.Feb.2008 9.53am",
      "content": "“Why don’t you just post a list with the names...”  \nI’m guessing gen79 is trying to post samples of fonts in use, and is probably trying to find out what they are called.\n\n“I really like the third one”  \nWhich third one, Frode?\n\n"
    },
    {
      "time": " 17.Feb.2008 10.28am",
      "content": "No spaces in file name.  \n.jpeg or .png work for me.\n\n"
    },
    {
      "time": " 17.Feb.2008 1.21pm",
      "content": "It worked!  \nThere was a space in the filename.. Thanx Nick Shinn!!\n\n"
    },
    {
      "time": " 17.Feb.2008 1.49pm",
      "content": "1. Arno Pro\n2. Adobe Caslon\n3. Baskerville\n4. Bembo\n5. Chaparral\n6. Cambria\n7. Constantia\n8. Garamond Premier\n9. Joanna\n10. Junicode\n11. Linux Libertine\n12. Latin Modern Roman (CTAN)\n13. Minion\n14. Palatino\n15. Perpetua\n16. Sabon\n17. Spectrum\n18. Times\n19. Walbaum\n20. Warnock\n\n"
    },
    {
      "time": " 17.Feb.2008 6.12pm",
      "content": "well i wouldnt know all the fonts, but to give you the names is easy...\n\nopen file in acrobat and check the document properties...  \nvoilà all fonts in a nice list...\n\n"
    },
    {
      "time": " 17.Feb.2008 6.15pm",
      "content": "Boring!\n\n"
    },
    {
      "time": " 17.Feb.2008 6.56pm",
      "content": "I for one printed it out and tried to figure it out the good old fashioned way. Quite interesting looking at all of them printed off of a low res laser printer at work.\n\nMost of the finer details just disappear, leaving you having to figure things out by skeletal structure. Very informative.\n\n"
    },
    {
      "time": " 19.Feb.2008 5.46pm",
      "content": "writingdesign: We Norwegians still find irony hilarious;)\n\n"
    },
    {
      "time": " 20.Feb.2008 12.42am",
      "content": "“writingdesign: We Norwegians still find irony hilarious;)”\n\nToo many bearded people not getting Norwegian humour these days ;)\n\n"
    },
    {
      "time": " 22.Feb.2008 6.41pm",
      "content": "Personally I don’t care what your list contains. It is boring because it is only a list. Who cares. If you want anyone to care perhaps you should explain the reasons for your choices. Lacking that, again, who cares. A waste of list space as far as I can see.\n\n"
    },
    {
      "time": " 22.Feb.2008 6.55pm",
      "content": "Wow. Some pretty harsh monologues here.\n\n"
    },
    {
      "time": " 23.Feb.2008 12.00pm",
      "content": "If you’re asking for critical responses to your list, here goes. Perpetua, ideal for display, makes a surprisingly crude, unsatisfactory text face. Joanna is more legible, but the italics look absurd; there’s a tradition of designing italics with different proportions than the roman, and Joanna is exhibit A for why that tradition should be rejected. The best Gill serif is Aries, with default-loaded oldstyle figures (not all versions have that). Walbaum: which one? Berthold, famously used by Musee d’Orsay, is just too heavy in its basal weight; ditto Linotype; Monotype is a little too wimpy and still does not offer default-loaded oldstyle figures. So I would recommend Storm Foundry’s version—just right, with default-loaded OSFs. Times is now the most over-exposed typeface on earth, reason enough never to use it. Monotype Spectrum should be shunned...I’m reading a book set with it now...though good for display, for text use, it’s wimpy and lame, does not offer default-loaded oldstyle figures...and the liner figures look awful. Ugh!\n\nYou should also consider Janson Text, Storm’s Regent II, Scala, Bitstream Arrus (now with OSFs), Bembo, ITC Bodoni 12, Galliard (now with OSFs for all fonts via ITC in OT), Buccardi, ITC New Baskerville, Celeste, Electra, Esta, Corundum, Legacy Serif, Stone Serif, NuSwift, Proforma.\n\n"
    }
  ]
}
