{
  "id": "42190",
  "title": "Plug Research Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I've been playing with this logo all weekend. It's for a record label focused on underground experimental electronic music. Trying some different variations here. I colored #4 because that's the one I'm leaning towards at the moment. Strikes a nice balance compared to 2/3 & 5/6 I think.\n\nLooking for some feedback. Thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [plug.gif](http://web.archive.org/web/20130621031422/http:/typophile.com/files/plug.gif) | 36.62 KB |\n\n",
  "author": "subcons",
  "time": "17 Feb 2008 — 3:10pm",
  "uid": "26955",
  "comments": [
    {
      "time": "17 Feb 2008 — 3:26pm",
      "content": "I can't see the difference between 1&5, but I like them.\n\n"
    },
    {
      "time": "17 Feb 2008 — 4:00pm",
      "content": "<cite>I can’t see the difference between 1&amp;5, but I like them.</cite>\n\n1-3 are using a more narrow U that matches the L and G, while 4-6 are using a wider U which matches the P. I think I like the wider U. Seems more balanced to me. Also, 1 is using a different face for ‘research’ than 5.\n\n"
    },
    {
      "time": "17 Feb 2008 — 6:45pm",
      "content": "Very nice. The wider U definitely. I think the whole mark could be heavier.\n\n"
    },
    {
      "time": "17 Feb 2008 — 10:03pm",
      "content": "i like the logo as well. I might be repeating logosam, but I think a heavier stroke for \"PLUG\" to give it some more weight and provide a little more contrast to \"research\"\n\n"
    },
    {
      "time": "17 Feb 2008 — 11:35pm",
      "content": "I don't like number 1. And 2,3,4,5, and 6 as well. They all look like something done by the guy who owns the corner hardware store. I don't get _'record label focused on underground experimental electronic music'_ from that effort. They seem flat and trite.\n\nTry saying Plug without showing a plug... nothing more boring than a literal interpretation.\n\n"
    },
    {
      "time": "18 Feb 2008 — 4:45am",
      "content": "I agree with Hiroshige...looking at them, I felt they were all fine for an electrician or the like, but then realized it was for a record label.\n\nKeep this on the options list, but I'd suggest some more brainstorming as well.\n\n"
    },
    {
      "time": "18 Feb 2008 — 3:24pm",
      "content": "Thanks for the feedback guys.\n\n"
    },
    {
      "time": "19 Feb 2008 — 2:02pm",
      "content": "If you want to go with some sort of imagery, it might be a bit more fun to go with an outlet than a plug - see [here](http://web.archive.org/web/20130621031422/http:/www.flickr.com/search/?s=int&ss=1&ct=6&w=all&q=outlet+electric&m=tags) for inspirations.\n\n"
    },
    {
      "time": "22 Feb 2008 — 12:08am",
      "content": "Eeblet's right. For an underground record label it's got to be something out there. Her images would be a good starting place.\n\n ![](http://web.archive.org/web/20130621031422im_/http:/typophile.com/files/plug_3799.jpg)\n\n"
    },
    {
      "time": "22 Feb 2008 — 1:02pm",
      "content": "Ooooh, if you want to be really edgy: [(SOOOO not safe for work)](http://web.archive.org/web/20130621031422/http:/www.goodvibes.com/Item--i-14BA04)\n\n"
    },
    {
      "time": "22 Feb 2008 — 5:57pm",
      "content": "Ha. Love it eeblet.\n\nI don't really see how depicting an outlet would be any more “edgy” than a plug per say. Just as “flat and trite” as jsgh would say. I listen to quite a lot of music and most of it is on indie labels. These labels, the ones with well designed identities, are usually not very edgy, but more subtle/sophisticated/modern for the most part.\n\nI get the idea though. Back to the drawing board. May just drop the visual element all together and stick with typography.\n\nThanks again for the insight/suggestions.\n\n"
    },
    {
      "time": "23 Feb 2008 — 12:37pm",
      "content": "I never said the outlet would be edgy - only \"more fun\". I think you can play with the imagery in this one, although of course a nice typographic treatment would be fine, too. For starters, just let your drawings run free - don't be too anal.\n\n(OMG I AM SORRY)\n\n"
    }
  ]
}
