{
  "id": "42200",
  "title": "FFMeta: the first comission for an identity typeface?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "From my thesis research I am getting the impression that FFMeta represents the first time an organization commissioned a typeface intended to become its typographic identity on all printed output (at least in the context of organizational systems, obviously newspaper and magazines commissions predate it). Is this correct, or is the popularity of FFMeta overshadowing another important design?\n\n [‹ Dollar Bill Type](http://web.archive.org/web/20080907042559/http:/typophile.com/node/42437 \"Go to previous forum topic\") [Linocut Typographic Maps ›](http://web.archive.org/web/20080907042559/http:/typophile.com/node/42448 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907042559/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 18.Feb.2008 6.14am",
      "content": "Commissions are much earlier. Goudy did Pabst for Pabst. Californian for the University of California, etc. I wouldn’t be surprised if this goes back to the 19th century...\n\n"
    },
    {
      "time": " 18.Feb.2008 6.38am",
      "content": "Even in the near past, Kurt Weidemann’s Corporate A,S and E predates Meta. I agree that there are probably lots of instances.\n\n"
    },
    {
      "time": " 18.Feb.2008 6.54am",
      "content": "[C.M.](http://web.archive.org/web/20080907042559/http:/typophile.com/wiki/Charlemagne), CEO of Franksco, commissioned Al Cuin (Senior Art Director of York Scribal Branding) to design a [new face](http://web.archive.org/web/20080907042559/http:/typophile.com/wiki/Carolingian%252Bminuscule) for standardised use on communication material throughout his enterprise. That wasn’t exactly a _type_face, but nevertheless kind of a forerunner, no?\n\n"
    },
    {
      "time": " 18.Feb.2008 7.15am",
      "content": "<cite>Goudy did Pabst for Pabst.</cite>\n\nPabst was used for advertising and doesn’t really fit into the context of a identity system; at least not in the context of corporate identity as established during the 1930s and what that has evolved to today.\n\n<cite>Kurt Weidemann’s Corporate A,S and E predates Meta.</cite>\n\nIt predates Meta actually being turned into a usable font, but the commission—which is what I am interested in—for Meta came in 1981, and the Corporate A, S and E series were designed from 1985-1990, implying a 1984/1985 commission.\n\n<cite>That wasn’t exactly a typeface, but nevertheless kind of a forerunner, no?</cite>\n\nI think that there’s a pretty big gap there in terms of context.\n\nKeep in mind that I am not asking about commissions for specific uses, I am looking at a commission of a typeface that was meant to be used for _everything_, not just running copy or advertising or a signage system. I am looking for the commission that said ”we want to stop printing everything from business cards to our truck lettering in Helvetica and print everything in our own typeface” and I think that the Meta commission might be that moment.\n\n"
    },
    {
      "time": " 18.Feb.2008 7.54am",
      "content": "“the commission...for Meta came in 1981”\n\nI didn’t know that!\n\n"
    },
    {
      "time": " 18.Feb.2008 7.56am",
      "content": "Maybe the work of Peter Behrens for AEG  \n [http://en.wikipedia.org/wiki/Peter\\_Behrens](http://web.archive.org/web/20080907042559/http:/en.wikipedia.org/wiki/Peter_Behrens \"http://en.wikipedia.org/wiki/Peter\\_Behrens\")\n\nIn Italy, in the ’50s, Giulio Einaudi (one of the most important publisher, in Italy), commissioned a Garamond to Simoncini. Einaudi still uses Simoncini Garamond. It was discussed in a recent thread.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.06am",
      "content": "[FF Meta](http://web.archive.org/web/20080907042559/http:/typophile.com/wiki/FF%252BMeta) was commissioned by Deutsche Bundespost in the 80s (what is your source for 1981?), but not accepted. The design was done in 1985. It later became the corporate identity typeface for [MetaDesign](http://web.archive.org/web/20080907042559/http:/typophile.com/wiki/MetaDesign). In addition to the Wiki, you can read about the history of FF Meta/PT55 in [Erik Spiekermann](http://web.archive.org/web/20080907042559/http:/typophile.com/wiki/Erik%252BSpiekermann)’s own blog, he put [an article from Baseline 7, 1986](http://web.archive.org/web/20080907042559/http:/www.spiekermann.com/iblog/C61720386/E150639911/index.html) online.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.07am",
      "content": "An earlier thread...\n\n[http://typophile.com/node/27315](http://web.archive.org/web/20080907042559/http:/typophile.com/node/27315 \"http://typophile.com/node/27315\")\n\n\\>”at least in the context of organizational systems”\n\nHow about Bell Centennial??\n\nJames, rather than ask if Meta was the first, you could have asked - “under what definition of corporate branding font would Meta be classed as the first?” ;-)\n\n"
    },
    {
      "time": " 18.Feb.2008 8.10am",
      "content": "Edward Johnston’ Railway Type (1916) would also qualify, wouldn’t it ?\n\n"
    },
    {
      "time": " 18.Feb.2008 8.17am",
      "content": "The Romain du Roi was commissioned by King Louis XIV in 1692—for exclusive use by the crown, I believe. That might be the first.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.26am",
      "content": "RdR - I was thinking the same thing - [http://typophile.com/node/38885](http://web.archive.org/web/20080907042559/http:/typophile.com/node/38885 \"http://typophile.com/node/38885\")\n\nCheers, Si\n\n"
    },
    {
      "time": " 18.Feb.2008 8.44am",
      "content": "<cite>FF Meta was commissioned by Deutsche Bundespost in the 80s (what is your source for 1981?), but not accepted</cite>\n\nI double-checked my source (_Revival of the Fittest_) and the commission date was actually 1984, my notes were wrong. Thanks for pointing that out.\n\n<cite>How about Bell Centennial??</cite>\n\nFrom what I’ve read Bell Centennial was specifically designed to improve legibility in phone books.\n\n<cite>Edward Johnston’ Railway Type (1916) would also qualify, wouldn’t it ?</cite>\n\nEdit: Sorry, lost my reply here. Anyway, Railway, at least from my reading, began as a letting/type system for signage and was adapted for other purposes later.\n\nI have remembered that I know someone here in Washington who did a doctorate thesis on the history of identity system, I’ll probably drop by her office tomorrow.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.58am",
      "content": "Let me try a different track: does anyone know of a written history that explicitly covers this subject? I’m not having much luck with my school library’s catalog, and going after one possible example at a time is sort of like playing whack-a-mole.\n\n"
    },
    {
      "time": " 19.Feb.2008 12.41am",
      "content": "do you know alexander lawson’s anatomy of a typeface?\n\nmight be interesting for you.\n\ndr\n\n"
    },
    {
      "time": " 19.Feb.2008 1.16am",
      "content": "James, Volkswagon got VAG Rounded in 1978, I believe. And I’m pretty sure that corporations, or at least a few publicly funded ones, in Germany in the 1930s had their own typefaces, too. In any event, Meta is most definitely not the first commissioned identity typeface. I don’t know where you’ll find the literature that you are looking for (your best bet would be to start a research MA program and write it yourself).\n\n"
    },
    {
      "time": " 19.Feb.2008 6.35am",
      "content": "It’s a question of feasibility.  \nHow would a large corporation have handled its everyday media at diverse locations, in the past, at various times in history?  \nAnd what kind of media would they have been?\n\nFor instance, a corporation would have had many suppliers: a design firm for its identity, perhaps another for packaging, an ad agency to handle national media, but local offices, outlets and distributors would have used local suppliers and marketing firms for things like co-op ads, flyers, point of purchase material, brochures and signage, as well as in-house material, as few branch offices/plants would have had their own print shops.\n\nIn the past, where would local suppliers have got custom fonts from? The cost would have been prohibitive to outfit provincial type and signage shops with a custom face.  \nThat is why in the early years of corporate identity, there was a nice dove-tail with modernist simplicity by using Futura, Univers and Helvetica as the text font component of an ID, because they were readily available everywhere. These faces were often used indiscriminately and interchangeably—if for no other reason than it made life more interesting for local designers.\n\nSo pre-digital it was quite feasible for a consumer product corporation to have a custom face for a national advertising campaign (and that was happening in the 1950s in the US, using relatively inexpensive phototypositor technology), or for a publication or publisher to have a custom face (they controlled printing centrally), but for companies with more generic or diverse requirements, not so easy.\n\nCorporations that are more centralized and vertically integrated, such as a national post office, and are not so reliant on local print suppliers, producing more of their literature in one place, so would have been better able to implement a custom face.\n\n"
    },
    {
      "time": " 19.Feb.2008 12.51pm",
      "content": "Thanks for all the help everyone. I’m in the library sifting through a pile of books right now, but Behrens definitely designed Behrens-Antiqua as the AEG identity face back in 1906, although I’m not sure it’s use went beyond a promotional campaign.\n\nAnd Dan, you’re right, pushing into this subject with any serious depth would be a undertaking worthy of a long master’s thesis. But it’s definitely cool stuff.\n\n"
    },
    {
      "time": " 19.Feb.2008 1.01pm",
      "content": "There’s also Volvo’s proprietary headline face, and the special headline Garamond that H. Zapf drew for Bell in the 70’s/80’s. Both were headline faces only though. I do think Goudy’s Californian or maybe his Scripps Oldstyle satisfy more of your criteria. They were intended for broad use by the commissioning body.\n\n"
    },
    {
      "time": " 19.Feb.2008 1.17pm",
      "content": "Thanks Carl, I’ll look at Californian.\n\nOn a related note, if anyone out there writes or edits/compiles a design history book, please get the publisher to index it. I really don’t know how some history books are expected to be of use to anyone who hasn’t got limitless to kill reading long essays.\n\n"
    },
    {
      "time": " 21.Feb.2008 2.29pm",
      "content": "I believe that Herbert Bayer’s “universal” typeface was commissioned by Walter Gropius ca. 1925 as the official typeface of the Bauhaus (similar to California in this regard?)\n\n"
    },
    {
      "time": " 21.Feb.2008 2.42pm",
      "content": "…except that California was actually produced. Universal never became a metal typeface. Bayer drew it, and you can see the pictures. Later, he and other people used the basic graphic idea on various letterprojects (like the title on the cover of the magazine _die neue linie_). But those letters were just drawn, they were not part of a typeface, which anyone could set. So Universal was not the Bauhaus’s (or anyone else’s) “typeface.” This is a very important distinction that more people to work into their vocabulary when talking about letters in the visual environment, I think.\n\n"
    },
    {
      "time": " 21.Feb.2008 3.15pm",
      "content": "Wasn’t Eastern Souvenir commissioned in the 60s (maybe the 70s) by Eastern Airlines.\n\n"
    },
    {
      "time": " 21.Feb.2008 4.25pm",
      "content": "I’ve decided to go with Behrens Antiqua as the first typeface produced for use in what could be considered a modern identity system. It isn’t the total identity face I’m looking for, but really answering that question is too much for me. On the upside, this thread and the related writing and research have made me realize that Meta, on of the typefaces that spurred much of my research, isn’t particularly relevant to my thesis.\n\nAs Dan noted, Bayer’s Universal Alphabet was not a typeface. It was an attempt at total reform of the alphabet, and Bayer developed it on his own, not as a commission. New alphabets and orthographies were a really hot topic at the time, and the new alphabet was one of many—often very good—such ideas that came out of Weimar Germany.\n\n"
    },
    {
      "time": " 21.Feb.2008 6.02pm",
      "content": "Wasn’t a lot of the early, as in Incunabula early, type derived via commission? I seem to recall something about rich aristocrats or priests or something commissioning type for their exlcusive use.\n\nSomething like what happened with the Janson “Garamonds” and the French government might be considered a forerunner of the identity system as well.\n\n"
    },
    {
      "time": " 21.Feb.2008 9.26pm",
      "content": "<cite>Wasn’t a lot of the early, as in Incunabula early, type derived via commission?</cite>\n\nAgain, similar concept, very different context.\n\n"
    },
    {
      "time": " 22.Feb.2008 3.29am",
      "content": "<cite>Again, similar concept, very different context.</cite>\n\nBut if we look at the first italic of Griffo for Manutius, maybe not. It was designed for a new serie of books: “portable books in the nature of manuals” (see Harry Carter, A view of early typography). moreover “the Venetian Senate gave Aldus exclusive right to its use” (see [http://en.wikipedia.org/wiki/Italic\\_type](http://web.archive.org/web/20080907042559/http:/en.wikipedia.org/wiki/Italic_type \"http://en.wikipedia.org/wiki/Italic\\_type\")).  \nIt was the distinctive typeface for that kind of books and it was imited to print counterfeit edition of manutius “portable books” in Lyon.\n\nWell, it was not exactly a corporate font, but something similar.\n\n(Forgive me for my english)\n\n"
    },
    {
      "time": " 22.Feb.2008 4.56am",
      "content": "“Wasn’t a lot of the early, as in Incunabula early, type derived via commission? “\n\nYes. Nearly everything, from the ’beginning’, was commissioned. When did founders start designing products for public purchase? (lol) At first, I thought this thread was simply trying hard to write a paper on Meta. :)  \nNow, I see that it is trying to distinguish between commissions exclusively for a commercial identity as opposed to an identity of any kind, (including a qualitatively superior identity). I just don’t know the answer, and, I do not think one answer can be correctly established. But if the question is “when”, I think the point’s being missed anyway, with “why” being what’s important to any thesis on the subject.\n\nCheers!\n\n"
    },
    {
      "time": " 25.Feb.2008 4.03am",
      "content": "Centaur — originally a titling fount for the Metropolitan Museum of NY in 1915. And later adapted and extended. Not as old as others suggested, but essentially a custom typeface.\n\n"
    }
  ]
}
