{
  "id": "42203",
  "title": "What a cop out",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Cardiff, the capital of Wales unvails a new logo in an attempt to rid itself of dragons and daffodils and become hip and young.\n\nlame. What a load of balonium.\n\n[http://news.bbc.co.uk/1/hi/wales/south\\_east/7250149.stm](http://web.archive.org/web/20080906161220/http:/news.bbc.co.uk/1/hi/wales/south_east/7250149.stm \"http://news.bbc.co.uk/1/hi/wales/south\\_east/7250149.stm\")\n\n [‹ Typo synth in action](http://web.archive.org/web/20080906161220/http:/typophile.com/node/42375 \"Go to previous forum topic\") [Vectormagic ›](http://web.archive.org/web/20080906161220/http:/typophile.com/node/39105 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906161220/http://typophile.com/user/11280\" title=\"View user profile.\">G T</a>",
  "time": "<br>",
  "uid": "11280",
  "comments": [
    {
      "time": " 18.Feb.2008 7.22am",
      "content": "That’s so hugely disappointing!!! Who did it?\n\nWhat’s wrong with dragons anyway, they tend to look so smart in destination logos like [the one](http://web.archive.org/web/20080906161220/http:/www.travelwales.org/) for Wales Tourism.\n\n"
    },
    {
      "time": " 18.Feb.2008 7.32am",
      "content": "That’s pathetic—did they hire the branding firm of the living dead for that boring, trite, dated nonsense? Given the requirements any branding person with half a brain should have just developed the dragon into an avatar and dumped that static mark concept entirely. Does anyone else feel that projects like this one have a lot to do with why designers still have to justify everything we do to so many clients?\n\n"
    },
    {
      "time": " 18.Feb.2008 7.41am",
      "content": "45k... hats off to that.\n\nbland, generic, unimaginative...\n\nencroyable\n\n"
    },
    {
      "time": " 18.Feb.2008 7.49am",
      "content": "The logo undoes three years of work by the BBC to make Cardiff cool... [http://en.wikipedia.org/wiki/Torchwood](http://web.archive.org/web/20080906161220/http:/en.wikipedia.org/wiki/Torchwood \"http://en.wikipedia.org/wiki/Torchwood\")\n\n"
    },
    {
      "time": " 18.Feb.2008 7.54am",
      "content": "”...projects like this one have a lot to do with why designers still have to justify everything we do to so many clients?...”\n\nThat’s very likely. But there are also instances where the client is extremely ’nice’ and just approves the first thing the design firm walks in with. It is not exactly unknown for branding agencies to recycle options from previous briefs.\n\n"
    },
    {
      "time": " 18.Feb.2008 7.55am",
      "content": "Sii, I was thinking the same thing! If the BBC can make Wales interesting, why can’t a design firm? Of course, the BBC is sort of its own client, but still!\n\n"
    },
    {
      "time": " 18.Feb.2008 8.04am",
      "content": "listen, the dark lords of branding themselves couldn’t make cardiff cool.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.08am",
      "content": "i’m not sure you can call torchwood cool...\n\n"
    },
    {
      "time": " 18.Feb.2008 8.08am",
      "content": "’If the BBC can make Wales interesting, why can’t a design firm?’\n\nMaybe ’cos they’re far too busy trying to make it look ’fresh’ and ’young’ and many other meaningless adjectives than to make it Welsh. I know its not easy to make something modern and yet at the same time retain some historical references, but this is throwaway design.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.12am",
      "content": "<cite>i’m not sure you can call torchwood cool...</cite>\n\nCompared to what Wales used to be known for, it’s cool, even if it does make the sheep feel left out.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.15am",
      "content": "Bland crap - doesn’t say ’City’. It says “I’m a designer who can’t be bothered to think of anything, but this idea is in at the moment so I’ll do this, so as not to waste any precious brain cells”.\n\nCircles in perspective (I’m sure there’s a proper name for it) are the new ’arch thing’ (I’m sure there was a name for that also).\n\nWhy are logotypes designed with built-in obsolescence nowadays? That is going to look so dated very quickly. In fact it will probably look dated by the time I post this comment.\n\n45K? Nice work if you can get it.\n\nNick Cooke\n\n"
    },
    {
      "time": " 18.Feb.2008 8.16am",
      "content": "why does Cardiff need to be cool. Why can’t it just be Welsh.\n\nTom Jones isn’t cool, he wears leather trousers for god’s sake. But women still throw their pants at him, which is the effect I’m sure the client was hoping looking for…\n\n"
    },
    {
      "time": " 18.Feb.2008 8.21am",
      "content": "’Why are logotypes designed with built-in obsolescence nowadays?’\n\nSo we get to design new ones in 5 years time.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.28am",
      "content": "doesn’t this thread belong on the design forum ?\n\n"
    },
    {
      "time": " 18.Feb.2008 8.31am",
      "content": "<cite>Why are logotypes designed with built-in obsolescence nowadays?</cite>\n\nSo freelance designers can get lots of phone calls about not wanting to pay more than $99 for a logo because the expensive ones are just a scam anyway.\n\n"
    },
    {
      "time": " 18.Feb.2008 10.13am",
      "content": "<cite>doesn’t this thread belong on the design forum ?</cite>\n\nMunicipal governments overpaying for crappy design are as bad as those that hold “contests” to get decent work from inexperienced and/or desperate designers for nearly nothing (as San Francisco did for their bus company a decade ago; the “winning” design was never used due to the outcry). Both practices hurt us all in the graphic design community. It’s a political and economic issue.\n\n"
    },
    {
      "time": " 18.Feb.2008 10.28am",
      "content": "Something I don’t get is why companies and organizations don’t just get a new ident, and simply start using it. Why the press release and press conference? Why publicize the $’s it cost, or the designers invovled? Why the designery BS about synergy and dynamism? Just use it, if it can’t stand on its own, then it’s failed design.\n\n"
    },
    {
      "time": " 18.Feb.2008 10.38am",
      "content": "Besides, as illustrated in the article, though buried way down in the comments, The Cardiff logo is virtually identical to the one from Greek Tourism. At least in that case the cluster of circles could be interpreted as a bunch of islands, which has _some_ relevance for Greece.\n\n"
    },
    {
      "time": " 18.Feb.2008 10.47am",
      "content": "\\>i’m not sure you can call torchwood cool...\n\nPaul, to be fair, the two episodes that have aired since the one you saw were better ;-)\n\n"
    },
    {
      "time": " 18.Feb.2008 10.54am",
      "content": "Sii, the PR departments have to justify their existence somehow!\n\n"
    },
    {
      "time": " 18.Feb.2008 11.01am",
      "content": "@cuttlefish : yes, i see yr point about being a political issue. which brings me to a topic i’ve wanted to launch for discussion for some time, but it’s loaded, vague, ripe for argument, and my thoughts thus far are rather superficial.  \nbut the recent writer’s strike got me thinking about this again :\n\nhow is it that composers and writers have a mechanism and several organizations in place to ensure residual payments over extended usage (royalties, etc) but graphic designers and illustrators don’t ?\n\nthere are exceptions - character design, font design licenses, deals detailing subsequent media, etc., but in general it seems that the graphic artists get the shortest stick. i’ve commissioned music for animated graphics which i’ve produced and the composers still get royalties everytime it plays. i got a flat fee, end of story.\n\nany thoughts ? new thread ?\n\n"
    },
    {
      "time": " 18.Feb.2008 11.10am",
      "content": "[http://forum.theorchidsource.com/attachments/Krylon1.jpg](http://web.archive.org/web/20080906161220/http:/forum.theorchidsource.com/attachments/Krylon1.jpg \"http://forum.theorchidsource.com/attachments/Krylon1.jpg\")\n\n-=®=-\n\n"
    },
    {
      "time": " 18.Feb.2008 11.23am",
      "content": "[The story about the logo + the designer](http://web.archive.org/web/20080906161220/http:/www.mymms.com/customprint/?src=112117&sc_cid=C_MC_37_N00_MA9ALN00CMC37111) :^)\n\n"
    },
    {
      "time": " 18.Feb.2008 12.45pm",
      "content": "_...ditching the “stereotype” of daffodils and dragons._\n\nPicking on helpless daffodils is just plain mean. But no one ditches a dragon.\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/CardiffRevenge_4291.jpg)\n\n"
    },
    {
      "time": " 18.Feb.2008 2.41pm",
      "content": "<cite>how is it that composers and writers have a mechanism and several organizations in place to ensure residual payments over extended usage (royalties, etc) but graphic designers and illustrators don’t ?</cite>\n\nBecause neither designers nor their clients want to deal with the headaches involved in tracking logo use and calculating royalty payments. Because designers don’t want to get a tiny payout up front and only really collect over time. Because there are more than enough good designers—not to mention the hacks—willing to do a job for next to nothing.\n\n"
    },
    {
      "time": " 18.Feb.2008 3.16pm",
      "content": "Suggests a toy telephone dial to me, and AG is very 70s, when dials were still used.  \nSo it’s a retro telcom brand. But there weren’t telcoms before 1981, just the GPO.  \nToo much analysis Nick, just enjoy the pretty colours and the bouncy circles.\n\n"
    },
    {
      "time": " 18.Feb.2008 4.02pm",
      "content": "\\>\\>Because neither designers nor their clients want to deal with the headaches  \n\\>\\>involved in tracking logo use and calculating royalty payments.\n\nin the case of music the tracking isn’t done by the artists and direct (account) clients, it’s done by a combination of dedicated tracking systems including broadcasters (usage) and publishers (payments).\n\n\\>\\>Because designers don’t want to get a tiny payout up front  \n\\>\\>and only really collect over time.\n\nwho said anything about a tiny payout up front ? the musicians i’ve worked with get serious fees upfront as well as residuals.\n\n\\>\\>Because there are more than enough good designers—not to mention  \n\\>\\>the hacks—willing to do a job for next to nothing.\n\nso true, and yet so wrong...\n\n"
    },
    {
      "time": " 18.Feb.2008 5.13pm",
      "content": "Oh I get it! It symbolizes diversity!\n\nAnd Torchwood isn’t cool. People only watch it because there are no new episodes of Dr.Who right now. I hate how they have to point out Captain Jack is gay in every single episode. I’m all for politically correct programming, but why did they have to make the only two good looking male characters in love with each other?!\n\n"
    },
    {
      "time": " 18.Feb.2008 5.26pm",
      "content": "<cite>I hate how they have to point out Captain Jack is gay in every single episode.</cite>\n\nIsn’t Captain Jack bi? He seems to shag everything that moves. Which might be why they set the show in Cardiff…\n\n"
    },
    {
      "time": " 18.Feb.2008 6.16pm",
      "content": "I must say, this is better than the old idols, and a little incompetent iconoclastism still helped.\n\n"
    },
    {
      "time": " 18.Feb.2008 6.20pm",
      "content": "I can’t be attracted to him or Yanto when all I can picture is them playing sexy Unit games.\n\n"
    },
    {
      "time": " 18.Feb.2008 6.46pm",
      "content": "they didn’t need a new ugly logo, they just needed to make sure that [this video](http://web.archive.org/web/20080906161220/http:/youtube.com/watch?v=oMLCrzy9TEs&feature=related) gets seen everywhere. that makes me want to get my a\\*\\* over to cardiff!\n\n"
    },
    {
      "time": " 18.Feb.2008 6.48pm",
      "content": "I remember when the BBC launched Torchwood, all the guff in the interviews with writers and stars was about how it was more adult than Doctor Who, how by being broadcast later in the evening it could deal with more mature themes. The irony of all this is that there is nothing in Torchwood that begins to approach the emotional depth developed in the first two seasons of the new Doctor Who.\n\n"
    },
    {
      "time": " 18.Feb.2008 7.34pm",
      "content": "I just realized that this conversation is putting us all in danger. A comparison of Doctor Who and Torchwood on a typography forum could very well create a singularity of nerdiness that will turn into a black hole and suck the entire solar system in.\n\n"
    },
    {
      "time": " 18.Feb.2008 7.45pm",
      "content": "For the record I did not say Torchwood was cool. I said that the logo undermines BBC’s efforts to make Cardiff cool.\n\nI personally think Torchwood is silly, but the show makes Cardiff appear\\* infinitely cooler than it really is.\n\nCheers, Si\n\n\\*Note, I was born in Basingstoke.\n\n"
    },
    {
      "time": " 18.Feb.2008 7.58pm",
      "content": "_I just realized that this conversation is putting us all in danger. A comparison of Doctor Who and Torchwood on a typography forum could very well create a singularity of nerdiness that will turn into a black hole and suck the entire solar system in._\n\nToo late! It is as in the novel Ratner’s Star: we are already inside the black hole, and that is why such things can \\*appear\\* perfectly normal. The laws of physics as we know them have already broken down.\n\nThe moment we began discussing Cardiff and typography the curvature turned negative.\n\n"
    },
    {
      "time": " 18.Feb.2008 8.27pm",
      "content": "EX-TER-MI-NATE!  \nEX-TER-MI-NATE!\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/Dalek_cardifF_4195.jpg)\n\n"
    },
    {
      "time": " 18.Feb.2008 8.52pm",
      "content": "This is why they should have kept the dragon. Just think about the possibilities for CGI Dragon Vs. Dalek commercials!\n\n"
    },
    {
      "time": " 18.Feb.2008 8.55pm",
      "content": "I found an address for typophiles to forward their complaints...\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/complaints_5181.JPG)\n\n"
    },
    {
      "time": " 19.Feb.2008 1.56am",
      "content": "<cite>I hate how they have to point out Captain Jack is gay in every single episode.</cite>\n\nit becomes a little tiring... the show’s camper than a row of tents. perhaps doctor who will get a male assistant? I totally get sucked into watching it. Then again I could watch qvc for hours on end.\n\ncardiff... dodgy nightclubs, slaggy women and aggressive drunks. hold on, that’s every provincial town in the UK ;-)\n\n"
    },
    {
      "time": " 19.Feb.2008 6.15am",
      "content": "\\*\\*sigh\\*\\* ...and i wanted to talk about residuals...\n\n"
    },
    {
      "time": " 19.Feb.2008 6.24am",
      "content": "I bet 1 billion dollars that some branding agency in the future brings back the dragons in an effort to “respect Cardiff’s rich history”.\n\nOr, if they like, they can hire me in 10 years, seeing as how I’m just that prescient and drawing dragons is, like, way fun.\n\n"
    },
    {
      "time": " 19.Feb.2008 6.25am",
      "content": "\\>\\*\\*sigh\\*\\* ...and i wanted to talk about residuals...\n\nI think a new thread might be your best bet.\n\nCheers, Si\n\n"
    },
    {
      "time": " 19.Feb.2008 6.34am",
      "content": "“The colours represent the city’s waterfront and parks”\n\nummmmm...ok?\n\n"
    },
    {
      "time": " 19.Feb.2008 7.49am",
      "content": "Catherine Tate is going to be the next companion on Dr.Who actually.\n\nI hope one day it will be Dr.Who and Stephen Fry.\n\n\\*sigh\\*\n\n"
    },
    {
      "time": " 19.Feb.2008 8.15am",
      "content": "My six year old thinks the next doctor should be a woman or a black man - damn you Obama and Hillary, for putting such ideas into a small girl’s head!\n\nAlso I’ve never been to Cardiff. I assume its kind of like Tacoma.\n\nCheers, Si\n\n"
    },
    {
      "time": " 19.Feb.2008 8.19am",
      "content": "\\> I hope one day it will be Dr.Who and Stephen Fry.\n\nMaybe Hugh Laurie could play the doctor? That would go well over here – an American Dr Who, on FOX!\n\n"
    },
    {
      "time": " 19.Feb.2008 8.31am",
      "content": "To illustrate Jason’s point...\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/greece_6226.gif)\n\nAm I right in thinking that the circle of dots is in fact a ’C’ and that makes everything OK?\n\nGreat way to make sure no-one ever forgets what your colour palette is.\n\n"
    },
    {
      "time": " 19.Feb.2008 8.35am",
      "content": "[It](http://web.archive.org/web/20080906161220/http:/www.visitcardiff.com/) moves.\n\n(A lot of logos are getting bad press because they are release in flat static formats.)\n\nNot sure if the movement helps though...\n\n"
    },
    {
      "time": " 19.Feb.2008 8.47am",
      "content": "random google search for “dots logo”\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/dotslogo_6471.png)\n\n"
    },
    {
      "time": " 19.Feb.2008 10.29am",
      "content": "Hugh Laurie as the Doctor... with companion Ice-T!\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/ice-t-photo-ice-t-6203870_4856.jpg)\n\n"
    },
    {
      "time": " 19.Feb.2008 2.11pm",
      "content": "<cite>random google search for “dots logo”</cite>\n\nIn the future, every place will be the same place. Every thing will be the same thing and it will be always be one-size-fits-all - For all. There will be one logo for everything. Apparently it is going to have a circle of dots.\n\n-=®=-\n\n"
    },
    {
      "time": " 19.Feb.2008 2.14pm",
      "content": "dots wot u tink !\n\n"
    },
    {
      "time": " 19.Feb.2008 2.56pm",
      "content": "<cite>“The colours represent the city’s waterfront and parks”</cite>\n\n<cite>ummmmm...ok?</cite>\n\nIsn’t drugging the client unethical?\n\n"
    },
    {
      "time": " 19.Feb.2008 3.27pm",
      "content": "uh, no... First I’ve heard of that rule.\n\n-=®=-\n\n"
    },
    {
      "time": " 19.Feb.2008 3.58pm",
      "content": "As mentionned by Nick Shinn above...\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/fisher_6062.jpg)\n\n"
    },
    {
      "time": " 19.Feb.2008 4.11pm",
      "content": "Someone mustn’t have told these guys that dragons could not be more hip with the young. They should have put dragons on everything!\n\nSurely this whole thing was the brainchild of someone who is neither hip nor young.\n\nGreat picture sihep! Where were you hiding that phone?\n\n"
    },
    {
      "time": " 19.Feb.2008 4.12pm",
      "content": "Isn’t Harry Potter Welsh? There’s your angle.\n\n"
    },
    {
      "time": " 19.Feb.2008 6.38pm",
      "content": "<cite>In the future, every place will be the same place. Every thing will be the same thing and it will be always be one-size-fits-all - For all. There will be one logo for everything. Apparently it is going to have a circle of dots.</cite>\n\nIn the future, all restaurants will be Taco Bell and you will use three seashells for personal hygiene.\n\n"
    },
    {
      "time": " 19.Feb.2008 7.19pm",
      "content": " ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/tacobell_cardiff_5263.jpg)\n\n-=®=-\n\n"
    },
    {
      "time": " 19.Feb.2008 7.33pm",
      "content": "yup, just like that!\n\nDemolition Man: B-grade sci-fi flick or work of prophecy?\n\n"
    },
    {
      "time": " 20.Feb.2008 2.38am",
      "content": "Sii\n\n\\>Maybe Hugh Laurie could play the doctor? That would go well over here – an American Dr Who, on FOX!\n\nHuh? Hugh Laurie is English.\n\nNick Cooke\n\n"
    },
    {
      "time": " 20.Feb.2008 5.20am",
      "content": " ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/ice-taco_bell_5684.png)\n\n-=®=-\n\n"
    },
    {
      "time": " 20.Feb.2008 10.37am",
      "content": "Err..Cities don’t need logos anyway, they need coats of arms.  \nStephen Fry as The Doctor - classy!\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/Escudo_de_Cardiff_6335.png)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080906161220/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 20.Feb.2008 10.49am",
      "content": " ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/Cardiff_5978.png)\n\n"
    },
    {
      "time": " 20.Feb.2008 12.38pm",
      "content": "This one is a lot more imaginative and it even has a soundtrack.\n\n[http://www.bahamas.com/bahamas/index.aspx](http://web.archive.org/web/20080906161220/http:/www.bahamas.com/bahamas/index.aspx \"http://www.bahamas.com/bahamas/index.aspx\")\n\nIt also has the appropriate archipelago reference.\n\n"
    },
    {
      "time": " 20.Feb.2008 2.49pm",
      "content": " ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/topleft_logo_4431.jpg)\n\nYes that is indeed a very nice tourism logo. Much more thoughtful looking, at the very least, but also pleasant.  \nIt even makes a nice page background and border.\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/shorelogo_footer_5480.jpg)\n\n"
    },
    {
      "time": " 20.Feb.2008 2.56pm",
      "content": "The new Tallinn logo has a nice vibe to it.\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/Tallinn_5355.png)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080906161220/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    },
    {
      "time": " 20.Feb.2008 3.28pm",
      "content": "Having just seen an ad for Greek Tourism with their logo proudly displayed I think the people of Cardiff should all rebel. Do they really want to be identified with plagiarists?\n\n"
    },
    {
      "time": " 20.Feb.2008 5.40pm",
      "content": "\\>Huh? Hugh Laurie is English.\n\nHe meant Hugh Laurie playing an American Dr.Who.\n\n"
    },
    {
      "time": " 20.Feb.2008 6.22pm",
      "content": "<cite>…I think the people of Cardiff should all rebel.</cite>\n\nI agree. The stuff Warren Ellis would write about a Welsh rebellion might be funny enough to put me into the hospital.\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/welshmen_4855.jpg)\n  \n(With apologies to all the wonderful Welshmen out there)\n"
    },
    {
      "time": " 20.Feb.2008 8.20pm",
      "content": " ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/crappy_6017.png)\n\nhaving said that, I sort of like the Haciendo logo, and the DOTS one is well, honest.\n\n"
    },
    {
      "time": " 21.Feb.2008 2.31pm",
      "content": "Wow. Just wow. What a shame. What dreck.\n\nThat said. I have known my fair share of clients that get all excited by the “logo-ey-ness” of things.. I think, at least as far as logos are concerned, that is the cause of the phenomenon where the client ALWAYS chooses your last place option as their favorite. It’s usually the most generic, logo-ey looking thing on there. Granted, these clients are mostly small businesses that either had no logo, or an amateur one and they’re just dying to look “professional.” Seeing their name in a way that they associate with other larger companies just gets them going. It takes awhile for that to wear off then they usually start wishing they had a really unique brand that makes them stand out instead of one that just makes them feel better.\n\nBut this is a city?? A city with rich tradition and a long history. Not a hip startup. The mind is boggled.\n\nKudos to the designers for convincing someone to give them $45k for that. As it’s been said before, it will only make it harder for me to convince someone they should pay for the time required for a really strong, unique, smart identity.\n\n"
    },
    {
      "time": " 21.Feb.2008 2.38pm",
      "content": "Tom, that’s the wrong font :-)\n\n"
    },
    {
      "time": " 21.Feb.2008 3.25pm",
      "content": "It’s a low effort image, just like it says. And it probably should be deleted, like it says. :)\n\nActually, hold on. If you want it you can have it for jut $10k. Look what Wales paid for theirs, this is a real deal!\n\nI’ll even take off the stickynote for free.\n\n"
    },
    {
      "time": " 22.Feb.2008 1.34am",
      "content": "I’ve had Avant Garde Demi for 20 years, and it still works like it ever did. IIRC, it was one of the Laserwriter fonts.  \nMaybe ITC Garamond will come back into fashion too.\n\n ![](http://web.archive.org/web/20080906161220im_/http:/typophile.com/files/Flppy_6729.png)\n\n"
    },
    {
      "time": " 22.Feb.2008 5.33am",
      "content": "ITC Garamond will come back into fashion\n\n"
    },
    {
      "time": " 22.Feb.2008 6.15am",
      "content": "Did it ever go out? [ducks]\n\n"
    },
    {
      "time": " 22.Feb.2008 1.10pm",
      "content": "@Nick “and it still works like it ever did.”\n\nCould you imagine if digital fonts had an internal counter, and as you used them more and more, they started to flatten, bend, and break? Eventually you’d have to buy them once more to get them all sharp and crisp.\n\nAnd if you forgot to convert it to outlines, you couldn’t use those fonts at all until the printer sent your file back.\n\nThat could get pretty inconvenient.\n\ne: I see this isn’t a new concept at all and there are distorted fonts that adjust slightly. Still not quite the same as a font that actually wears out though. Maybe via a plugin then?\n\n"
    }
  ]
}
