{
  "id": "42213",
  "title": "3D Type",
  "forum": "Build",
  "tags": [

  ],
  "content": "I'm looking for a 3D application that has the ability to create professional looking 3D type, either a specific type based application or more likely a general 3D application for mac, that's easy to use and can get good results from.\n\nAny suggestions would be great, I wondered if there was an industry standard.\n\nCheers\n\nSteve\n\n",
  "author": "<a href=\"/web/20100204090940/http://typophile.com/user/16748\" title=\"View user profile.\">simplysteve</a>",
  "time": "<br>",
  "uid": "16748",
  "comments": [
    {
      "time": "",
      "content": "do you need to animate, or just render for print ?\n\nwhat are your shading / texturing / lighting needs ?  \n(modelling is just the beginning)\n\nif print only, illustrator CS3 has some simple 3D plug-ins.\n\n"
    },
    {
      "time": "",
      "content": "I only want to use it for print for now, but I would like to be able to light and texture my type and have more control over it than illustrator offers (I only have CS2). I'm not overly experienced with 3D software but it's something I'd like to explore further. Any suggestions for softaware to start with?\n\nCheers\n\n"
    },
    {
      "time": "",
      "content": "Should do everything you want. If you are willing to invest some time.\n\n[http://www.blender.org](http://web.archive.org/web/20100204090940/http:/www.blender.org/)\n\n"
    },
    {
      "time": "",
      "content": "i think there are more recent additions to the simplest, consumer level (limited) 3D packages, but the beginners, hobbyists, & quick turn-around artists (tv news artists) that i know are liking : Cinema 4D. it's fairly straight-forward.\n\nmost 3-D packages have a similar entry-level set-up, but they get complicated quickly.\n\nsorry, i don't mean to assume anything about your skill set or work needs, just taking a cue from your query.\n\n"
    },
    {
      "time": "",
      "content": "that Blender looks interesting - worth checking out.\n\n"
    },
    {
      "time": "",
      "content": "Sketch-up, by Google, is available for free online (\\*in the novice version), but it is a \"sketchy\" aesthetic, and not very clean lines. Its easy to use though.\n\n[http://www.sketchup.com/](http://web.archive.org/web/20100204090940/http:/www.sketchup.com/ \"http://www.sketchup.com/\")\n\n"
    },
    {
      "time": "",
      "content": "There was another recent thread about this: [How to best produce type in 3d?](http://web.archive.org/web/20100204090940/http:/www51.academy.typophile.com/node/40029)\n\n(I recommended [POV-Ray](http://web.archive.org/web/20100204090940/http:/www.povray.org/).)\n\n"
    },
    {
      "time": "",
      "content": "Cheers for your help\n\n"
    }
  ]
}
