{
  "id": "4223",
  "title": "Kentucky Lights",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am redesigning a mark for a company called Kentucky Lights, inc. There are no real boundaries, so I don't have to keep any elements from the old mark.   \n   \n ![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/33115.jpg)   \n   \nI haven't picked colors yet or a typeface. I am leaning to Champion Gothic Bantamweight with alot of kerning. Any help would be appreciated and I welcome sketches etc.   \n   \n ![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/33116.gif)\n\n",
  "author": "Tom Cannon",
  "time": "10 Apr 2004 — 7:49am",
  "uid": "1739",
  "comments": [
    {
      "time": "10 Apr 2004 — 11:19am",
      "content": "![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/33121.gif)\n\n"
    },
    {
      "time": "12 Apr 2004 — 5:54am",
      "content": "I like it a lot. What they had was aweful, and I don't just mean the printing. I would consider making the broad diagonal a bit thinner. see example. ![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/33217.gif)\n\n"
    },
    {
      "time": "12 Apr 2004 — 7:29am",
      "content": "It makes me think of piano-keys.\n\n"
    },
    {
      "time": "12 Apr 2004 — 7:59am",
      "content": "I see Piano Keys as well, but in the context of lighting, it's probably not a big deal. I wonder if you could do it with fewer 'rays' just to make the mark a bit more flexible in size. Also, maybe try one where the thicker parts of the rays are 'hanging' from the ray insteald of centered on the ray (does that make sense).   \n   \nAnd, I hate to say it, but the original card is so bad that it's good. ;o)\n\n"
    },
    {
      "time": "12 Apr 2004 — 2:27pm",
      "content": "Thank you all for the great advice. I agree with everyone. I hope to have a new version by tonight.   \n   \nTiffany, is this the old logo or the current?   \n [http://web.brandsoftheworld.com/?id=112&query\\_id=3736610&page=1&brand\\_id=2585](http://web.archive.org/web/20131023161857/http:/web.brandsoftheworld.com/?id=112&query_id=3736610&page=1&brand_id=2585)\n\n"
    },
    {
      "time": "12 Apr 2004 — 8:11pm",
      "content": "The latest...   \n   \n ![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/33311.gif)\n\n"
    },
    {
      "time": "12 Apr 2004 — 8:46pm",
      "content": "Good questions Tiffany. Below are the logos at smaller sizes. They won't need to be any smaller than what I have them at. I don't want to take too many rays out because I like the gradual increase in the shapes of the tail of the \"k\". Let me know if you think it looses too much, but I don't feel it does.   \n   \n ![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/33314.gif)   \n   \nAs far as color I will tackle that next. Like you said I do b&w first before color. I will probably do the icon in 1 color, unless I find it looks better otherwise. I will probably do the text in anoher color.\n\n"
    },
    {
      "time": "12 Apr 2004 — 8:48pm",
      "content": "Tom, I like the image you're going for quite a bit, but I think the K needs to be sturdier. The righthand leg feels too flared, or perhaps too tapered at the top. The thinning of the upper diagonal is better in the second version, but I still think the flaring of the leg is too strong. Also, the lefthand leg is getting eaten away by the negative space of the rays, but I'm not sure that's as much of a problem. Adjusting these might help for smaller sizes, though (which will cause problems at all of those joins). I guess I'd recommend being freer with the manipulation of the original letterform.   \n   \nAre you still considering Champion Gothic Bantamweight?   \n   \nAlso, I prefer the earlier versions, in spite of the piano interpretations. I actual saw a clock hand/ metranome moving at first glance. I like the concept a lot. I'm eager to see where it goes.\n\n"
    },
    {
      "time": "13 Apr 2004 — 1:55am",
      "content": "What if you taper the top stroke to match the bottom stroke?\n\n"
    },
    {
      "time": "13 Apr 2004 — 7:55am",
      "content": "what if you arched the rays so they formed a curved right-edge to the mark?\n\n"
    },
    {
      "time": "13 Apr 2004 — 1:00pm",
      "content": "Hi Tom,   \n   \nI guess you want the rays effect to expand the \"lighting/radiant\" concept? I like it but I think the logo looks a bit \"oldie\" as an 80's corporate logo (can't think on a more correct word, sorry). I know there will be type and more info on it and this can change how I'm looking to it now. I've looked on an old logo book (from '91 DAVID E. CARTER, logos of America's fastest growing corporations) and found some examples you can see for inspiration.   \n   \n ![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/33398.gif)\n\n"
    },
    {
      "time": "13 Apr 2004 — 7:40pm",
      "content": "I'll have to admit over-using the linear halftoning effect during the late 80s and early 90s myself, and for that reason I haven't found myself going there anymore, but I wouldn't steer Tom away from experimenting with the technique. I think exploring as many techniques as possible for value gradation is essential to any designer's education. This is a great collection of samples Adriano.   \n   \nI'm not quite feelin' the logo yet, Tom. Fortunately for you, I don't have to. I think I'm on a similar page to Ryan's. I'm not crazy about the flaring of the leg and upper arm/stroke (optical). I kind of like the light rays starting inside the base of the stem, but I wonder if they angled, causing a slight flare to the base of the stem, if it would offer more stability. Maybe even start the top ray by completely separating the base of the stem by following the upper arm/stroke through the stem. Have you tried stopping the rays at the outer edge of the leg?   \n   \nJust some thoughts.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "15 Apr 2004 — 1:58pm",
      "content": "I think you should bolster the lower-left leg (spine), perhaps having the vertex of the rays farther to the right. Obviously, the optical perception of the vertex will vary with print size and technique, but right now that part looks too thin IMO.   \n   \nWhat about alternating an extra-long (beyond the square shape) ray and a shorter one to add some visual interest to that side?   \n   \nAlso, about the \"80s look\": Most of the companies that used a linear halftone logo were telecommunications (AT&T) or high-tech, like the ones Adriano posted. Since Kentucky Lights is actually a lighting supplier, your use of rays in the logo is representative of their business rather than a trendy design feature.   \n   \nMake sure the new business cards spell \"commercial\" right ![:-)](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "15 Apr 2004 — 3:12pm",
      "content": "I will make the changes you all suggested (unflairing the k, enlarging the base, etc) and post them. I like your idea of separating the bottom with the top, Scott.   \n   \nI feel that my logo doesn't fit in with that group of logos posted (as Chase said above) because it is symbolizing light which is relative to the company. Light will probably always be symbolized by bursts and rays. Customers immediately (if done right) should think light. However, I agree that the halftoning in most of the above logos looks outdated.\n\n"
    },
    {
      "time": "10 Jun 2004 — 4:33pm",
      "content": "Here is another icon I have been working on.   \n   \n   \n   \n ![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/38064.gif)\n\n"
    },
    {
      "time": "12 Jun 2004 — 4:57pm",
      "content": "Tom,   \n   \nGreat work as usual! In this last iteration I see kind of a V-A ligature, instead of K, though.\n\n"
    },
    {
      "time": "12 Jun 2004 — 5:35pm",
      "content": "I see the loovered light box baffles as you might see on a SofBox. This helps with the lighting concept\n\n"
    },
    {
      "time": "13 Jun 2004 — 3:35pm",
      "content": "I find the first versions you posted best, Tom. They are the only ones communicating \"light\" at two different cogitive levels. The first level is visual description: rays. The second one is a subtle presentation of light by thin white spaces (between rays) which actually \"shine\" somewhere from behind the K logo. The thick parts, which are sitting on the rays then make little geometrical shadows.   \n   \nThat first logos make the viewer FEEL the light.   \n   \nI am afraid this second layer of meaning has been spoiled in later versions. The reason might be in fact that you have turned those shadows into some kind of wall. This wall can even be understood as a device for stopping the light. You don't want that, do you?   \n   \nIn case you agree with my advice, then maybe you will have to balance those thick parts of the K and white spaces a bit more carefully.\n\n"
    },
    {
      "time": "13 Jun 2004 — 5:11pm",
      "content": "Lauri: thank you for your kind words. I am not concerned with the v-a association because I think a K is seen before any other letters.   \n   \nMatjaz: The problem with the first version was my client didn't like it at all. He has seen another logo I did that was more simplistic and streamline and wanted his to have the same look. After I did the latest version he is happy with the direction it is going.   \n   \nThe big thing I am trying to figure out is type that will go with the icon. I am thinking about buying hoefler's knockout or Raleigh ( [http://www.myfonts.com/fonts/agfa/raleigh-gothic/roman/testdrive.html?s=KENTUCKY+LIGHTS&p=72](http://web.archive.org/web/20131023161857/http:/www.myfonts.com/fonts/agfa/raleigh-gothic/roman/testdrive.html?s=KENTUCKY%2BLIGHTS&p=72))   \n   \nI would like to hear opionons on if these would be good choices. I obviously want to be sure before I buy one of them.   \n   \nThanks,\n\n"
    },
    {
      "time": "26 Aug 2004 — 4:50am",
      "content": "I'm just looking back through some old topics, Tom this design reminds me of the logo for K Cider (a nice drop for the underage). This project has probably been put to bed by now but I though I'd show you.   \nTake a look:   \n   \n ![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/47612.jpg)\n\n"
    },
    {
      "time": "26 Aug 2004 — 8:22pm",
      "content": "Thanks for the post Photo. The project was put to bed by the clients wife who felt that the logo was fine the way it was. I like clients who aren't married.\n\n"
    },
    {
      "time": "27 Aug 2004 — 5:25am",
      "content": "Tom you are lucky she didn't design something at the kitchen table for you to execute. Photo, that 3D logo is a cop out. That would never work in 2D.\n\n"
    },
    {
      "time": "27 Aug 2004 — 5:48am",
      "content": "they just do it head on when in 2d, i think it works pretty well....i've got very fond memories from my youth of that logo!   \n   \n ![](http://web.archive.org/web/20131023161857im_/http:/www.typophile.com/forums/messages/29/47732.jpg)\n\n"
    },
    {
      "time": "12 Apr 2004 — 9:03am",
      "content": "Tom -- If you do choose this direction you will probably find yourself having to do different versions for different sizes ala the old Novell ID. Remember that?   \n   \nBTW -- I saw piano keys too. I couldn't read the fine print on my home computer (it's a beast).\n\n"
    },
    {
      "time": "12 Apr 2004 — 2:31pm",
      "content": "tom -- the first one looks like the old logo, sorta, is that wavy? if it is wavy, then no, that isn't it at all. the dot version is newer. the old logo had a varying amount of prongs depending upon the size it was to be used at.\n\n"
    },
    {
      "time": "12 Apr 2004 — 8:25pm",
      "content": "Tom -- Better use of white and black. I can see rays of light now. But, how does it work at smaller sizes? And, how will you incorporate color? Or is it a one-color logo. I know the old adage \"must work good in black and white\", but I'd like to see how you plan on solving that problem. But first, size.\n\n"
    }
  ]
}
