{
  "id": "42231",
  "title": "Personal identity for crit",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi all, wanted to post a mark in progress I’m working on to get some feedback, this a personal identity for a portfolio/blog site. I’ve been through lots of sketches and I’m at this point trying a purely typographic mark, though I’m not necessarily sold on that approach. The kerning on “digital” needs some work but I’m more looking to see if the overall idea is working at this point. Any feedback or ideas for other typeface combinations or other directions to try greatly appreciated, thanks.\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fd_sketch04_5808.jpg)\n\n [‹ Class Project Band Logo.](http://web.archive.org/web/20080907031549/http:/www.typophile.com/node/42561 \"Go to previous forum topic\") [Yet another Logo ›](http://web.archive.org/web/20080907031549/http:/www.typophile.com/node/42443 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907031549/http://www.typophile.com/user/27157\" title=\"View user profile.\">chrisfig</a>",
  "time": "<br>",
  "uid": "27157",
  "comments": [
    {
      "time": " 19.Feb.2008 7.32am",
      "content": "what if you simplified it down to just ’fig’. I think that’d be a bit more profound.\n\nAs for the fi ligature...I’m not sure if it’s needed.\n\n"
    },
    {
      "time": " 19.Feb.2008 8.54am",
      "content": "that isn’t a bad idea. I’m thinking the identity should probably reflect the domain though? and fig.com is a multibillion dollar pharmaceutical company...i don’t think they’ll give it to me :)\n\n"
    },
    {
      "time": " 19.Feb.2008 9.30am",
      "content": "Hmm...well, ’fig’ could certainly be the primary element, with ’figdigital.com’ being a tagline or supporting mark.\n\nI guess my point is that ’fig’ is much more interesting/unique than ’digital’ and, as it is now, the ’digital’ has the emphasis.\n\n"
    },
    {
      "time": " 19.Feb.2008 1.45pm",
      "content": "I’d like to see “digital” not in italic, and grey. Or other ways of emphasizing “fig” - right now the ligature is in visual competition with the “D”, to me.\n\nOn your site - is “in theatres” in Gotham? Either way, if “digital” were to look more like that, and be de-emphasized colorwise, I think it would look pretty sweet.\n\n"
    },
    {
      "time": " 19.Feb.2008 3.52pm",
      "content": "Good thoughts, thanks guys. And yes eeblet, Gotham on the splash page (I’ve had a slightly unhealthy addiction to Gotham recently). That could work well, I’ll play with it a bit tonight and see what might work.\n\n"
    },
    {
      "time": " 20.Feb.2008 9.11am",
      "content": "Ok, had a go with Gotham incorporated with the “fig” as it exists. I couldn’t get a lighter gray tone of type to work well, but by going with a thinner weight I think it balances much better. thoughts?\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fd_sketch05_3671.jpg)\n\nI’m also sketching a bit on an “fd” mark with sort of similar shapes rotated 180 degrees...not sure how that’ll develop yet.\n\n"
    },
    {
      "time": " 20.Feb.2008 1.25pm",
      "content": "DIGITAL is still too predominant, IMHO. I’d try to come up with a contrast closer to this:\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fig_4181.gif)\n\n"
    },
    {
      "time": " 20.Feb.2008 1.25pm",
      "content": ""
    },
    {
      "time": " 20.Feb.2008 4.13pm",
      "content": "OK, I see why this is hard to balance - these are two semi-failures of suggestions. (The second reads “fidgital” to me, which is funny, but inappropriate.)\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fig1_4141.png)\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fig2_6142.png)\n\nOh, and I like aluminum’s second suggestion. And I think the light Gotham works better than your original, but it still needs something. IMO. :)\n\n"
    },
    {
      "time": " 21.Feb.2008 10.07pm",
      "content": "Maybe it’s just me but I have to wonder why the FIG of FIG digital isn’t DIGITAL. Something like this...\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fig_6462.jpg)\n\n"
    },
    {
      "time": " 21.Feb.2008 10.40pm",
      "content": "I’d be more inclined to wonder why there isn’t a sumi-e drawing of a luscious fig - but that might just be me.\n\n"
    },
    {
      "time": " 22.Feb.2008 6.42am",
      "content": "I was thinking of a fig icon too, but then realized figs aren’t all that identifiable of a shape.\n\nThere’s always the fig leaf, though. You could have some fun with that.\n\n"
    },
    {
      "time": " 22.Feb.2008 8.26am",
      "content": "Good thoughts guys. and eeblet, aluminum nailed it...i did tons of sketching, research, etc., and a fig is a horribly unidentifiable shape :) I have played with the fig leaf concept and haven’t yet hit on one I like, while I think the concept has some potential I want to stay away from the scripty leafy trend but i’m not at all opposed to the concept. logosam, i tried a pixel approach like that as well but kind of leaned away from it as i thought it might give an appearance of being too digital/web-centric.\n\nThat being said, here’s two revisions on a combination of earlier discussed comments. I’m leaning towards the linear version, or do you guys think I should explore some other concepts?\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fd06_4423.jpg)\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fd07_4047.jpg)\n\n"
    },
    {
      "time": " 22.Feb.2008 10.31am",
      "content": "I think the linear version works well. You may not need to screen it back to grey now that you have the size contrast working better.\n\nTo nitpick...I’m still not convinced the fi ligature works. The g seems disconnected. I’d maybe try one with a slight gap between the bar of the f and the i.\n\n"
    },
    {
      "time": " 22.Feb.2008 1.18pm",
      "content": "Those both look nice, although I agree with Darrel about the fi - to me, it seems stilted. The f & i are so starkly parallel, that the small curve of the f is the only thing holding the g in.\n\nI was being kind of jokey about the fig - as in, “well, I’d rather illustrate ’fig’ than ’digital’ if I had to illustrate something” - but now I’m wondering if an abstracted fig behind the vertical arrangement of “fig digital” wouldn’t soften things up? Something like this, only not looking like it was drawn in MS paint (I think figs have a quite distinctive shape...):\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fig3_5872.png)\n\nBut probably not. :)\n\n"
    },
    {
      "time": " 23.Feb.2008 10.08am",
      "content": "Is that a garlic clove or a deflated whoopie cushion? :-)\n\n- Lex\n\n"
    },
    {
      "time": " 23.Feb.2008 12.42pm",
      "content": "Aw, [fig](http://web.archive.org/web/20080907031549/http:/www.flickr.com/photos/oonaa/2286543986/) off. :)\n\n"
    },
    {
      "time": " 25.Feb.2008 9.18pm",
      "content": "You guys are a trip :-)\n\nOk, I really liked the ligature originally but after trying it the consensus was correct, it does have a much better feel with the “fi” separated. The kerning still needs to be tweaked a bit but it’s darn close...any last thoughts? And thanks so much for all the help and advice, greatly appreciated.\n\n ![](http://web.archive.org/web/20080907031549im_/http:/www.typophile.com/files/fd08_6255.jpg)\n\n"
    },
    {
      "time": " 26.Feb.2008 6.29am",
      "content": "The ’f’ needs to come in just a tad. Looking good, though!\n\n"
    },
    {
      "time": " 26.Feb.2008 12.03pm",
      "content": "I agree, bring the F in, and it’s a wrap (minus colors/shades)!\n\n"
    },
    {
      "time": " 28.Feb.2008 12.41pm",
      "content": "Agreed on the f, will do some tweaking. and colors...argh :)\n\nI’m going to start working into designing the business card to develop what i might want to use as far as color palette. Planning to design the site and card with a cohesive look and then do any other materials as needed.\n\nThanks y’all.\n\n"
    }
  ]
}
