{
  "id": "42260",
  "title": "Origin of blackletter use in gang tattoos",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone,\n\nI'm preparing a talk on typeface selection which includes a section about cultural significance of type. There is a missing link though. I know that the use of blackletter on rap album covers stems from the gang tattoos, but how/why did blackletter become the preferred type style for those tattoos?\n\n",
  "author": "<a href=\"/web/20111221025645/http://typophile.com/user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": "<br>",
  "uid": "110",
  "comments": [
    {
      "time": "",
      "content": "I'll bet it ties into the use of blackletter in Mexico, and then transferring to barrios. Then spreading in prisons as the gang members did time (sometimes on purpose I'm told, because it was a badge of honor to do time)\n\nAnd the blackletter in Mexico came from German immigrants that also brought Polkas, accordians, oom-pah bands, and the making a decent beer with them.  \n; )\n\n"
    },
    {
      "time": "",
      "content": "Interesting theory. Can anybody back this up?\n\n"
    },
    {
      "time": "",
      "content": "You have probably read these but if not:\n\n[www.typophile.com/node/17496](http://web.archive.org/web/20111221025645/http:/www.typophile.com/node/17496 \"www.typophile.com/node/17496\")  \n [www.typophile.com/node/28919](http://web.archive.org/web/20111221025645/http:/www.typophile.com/node/28919 \"www.typophile.com/node/28919\")  \n [www.typophile.com/node/9921](http://web.archive.org/web/20111221025645/http:/www.typophile.com/node/9921 \"www.typophile.com/node/9921\")\n\nI have never heard it suggested but I think that it's a string ( or web ) of mental associations with blackletter where each new association being only vaguely aware of being influenced by the previous one.\n\nI am pretty sure that nobody has gone beyond speculation with each jump.\n\nFor Rap & LA culture I think you have a convergence of Heavy Metal music's use of it to signal \"Tough/Hard\" with a Mexican use which is Neighborhood/Street oriented. Heavy Metal comes to it from it's interest in gothic and medieval and Tolkein/fantasy imagery.\n\n"
    },
    {
      "time": "",
      "content": "Yves, originally [hip-hop and early rap](http://web.archive.org/web/20111221025645/http:/en.wikipedia.org/wiki/Hip_hop_culture), which originated in the Bronx, New York City, was not associated with gangs. It had three elements: graffiti, break dancing, and rap music\n\nThere seems to be a definitive documentary on early hip-hop graffiti, called [Style Wars](http://web.archive.org/web/20111221025645/http:/www.stylewars.com/). That should tell you what you want to know. You can order it through the link. My memory is the styles of this early graphitti were not black letter, but I may well be wrong.\n\nThe 'gangster rap', which I believe started in LA, is a later development. It is important not to confuse hip hop with ganster rap, because the spirit is so different.\n\nOn gangster rap, there may well be an influence of hispanic gangs, but I suspect that also  \nGerald Huerta's AC/DC logo was an influence. He writes about it on [this Typophile thread.](http://web.archive.org/web/20111221025645/http:/www.typophile.com/node/20336) That spawned a whole style for heavy metal, which I think predates the gangster rap albums and may have influenced them.\n\nI short, I don't know the answer to your question, but these links might help put you on the right track.\n\n"
    },
    {
      "time": "",
      "content": "If there is a connection to Mexican culture, the origin would look to be Catholic.\n\n"
    },
    {
      "time": "",
      "content": "<cite>If there is a connection to Mexican culture, the origin would look to be Catholic.</cite>\n\nAfter the conquer of Mesoamerica the first printing presses set up in Mexico used blackletter type and blackletter has been a big part of the culture ever since.\n\nThe book _Mexican Blackletter_ has a little information on this digging into various histories of alphabets and letting will turn up much more. The question of whether American gangs picked it up on their own or appropriated it from Mexican gangs doesn’t seem to be answered yet.\n\n"
    },
    {
      "time": "",
      "content": "Well they certainly appropriated the saints and made that aspect their own on many levels. I suspect the typography was part and parcel.\n\nYou can bet the prison system was the petri dish.\n\n"
    },
    {
      "time": "",
      "content": "100 pesos says this guy knows the back story... [http://www.vanishingtattoo.com/lars\\_krutak.htm](http://web.archive.org/web/20111221025645/http:/www.vanishingtattoo.com/lars_krutak.htm \"http://www.vanishingtattoo.com/lars\\_krutak.htm\")\n\nMy guess is that during the period when gang tats became popular amongst African American gang members the resident tattoo artists in Southern Cal were Hispanic or had been primarily serving the Hispanic community – where blackletter was the predominant letterform.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Well they certainly appropriated the saints and made that aspect their own on many levels.</cite>\n\nOr they just picked it up in school. Mexican ghettos aren’t the only ones with Catholic schools—almost a quarter of Americans grow up with those saints.\n\nIf anyone is bold enough to engage the body mod/tattoo community, it probably wouldn’t be too hard to find people in California, Texas, or Florida who could chart the history. I wouldn’t be surprised if various state and Federal police and prison wardens know all this, and have decades of photos to back it all up.\n\n"
    },
    {
      "time": "",
      "content": "I have a friend that was in a hispanic gang in Hawthorne in the 60s, and he has a sort of home-made newsprint publication put out by someone that showed RIP drawings for their dead friends done in blackletter.\n\n"
    },
    {
      "time": "",
      "content": "Think oom-pah.\n\npbc\n\n"
    },
    {
      "time": "",
      "content": "One interesting thing about Mexican Oom-pah bands (called 'banda' or 'tambora' at some point-popular in north Mexico) is that they often seem to never have heard of dynamics, with everyone blowing for all they are worth, often to the point of being unable to control intonation. It takes some getting used to.\n\n"
    },
    {
      "time": "",
      "content": "Might it also have to do with that blackletters don't have as many curves as roman letterforms? Eventhough blackletter forms can be quite complex, I can imagine that the shapes they are made out of are easier to tatoo than lets say a regular typeface.\n\n"
    },
    {
      "time": "",
      "content": "_One interesting thing about Mexican Oom-pah bands is that they often seem to never have heard of dynamics_\n\nThere's an old (german?) joke about guitarist asking the drummer to use more dynamics, who responds \"What do you mean, 'dynamics'? I can't play any louder!\"\n\n_Might it also have to do with that blackletters don’t have as many curves as roman letterforms?_\n\nTrue for the lowercase, but not so much for the uppercase blackletter forms, which are often used exclusively in tattoos.\n\nJens\n\n"
    },
    {
      "time": "",
      "content": "the exact \"how\" may be vague, but the \"why\" seems obvious: for nazis and gangs the style connotes an ancient or deeply rooted authority, much as medieval typography itself must have seemed to the common illiterate. the presumed status of a coded complexity just outside our reach.\n\nthe meeting of catholic and nazi typographic associations provides an irresistible style for co-opting by the underground (disenfranchised) power system.\n\n"
    },
    {
      "time": "",
      "content": "^ Both religion and gangs are highly invested in initiation rights, which usually deal symbolically with death it seems.\n\nI'm a little skeptical about the German connection simply because (and I'm no historian) the Spanish were in Central America well before the Germans settled in Texas. Also, if you skip over the border into NM you find nothing but hatred for the German influenced Tejano music, yet the black letter, appropriated saints, and candle shop culture cut across state borders.\n\n"
    },
    {
      "time": "",
      "content": "Golden thread everyone, thanks so much.\n\n\\> _Yves, originally hip-hop and early rap, which originated in the Bronx, New York City, was not associated with gangs. It had three elements: graffiti, break dancing, and rap music._\n\nYeah, I knew that -- I was a breakdancer in my days. ;^) Thanks for the documentary and the tips.\n\nMy point in the presentation is that mainstream hip hop and R&B music picked up blackletter use via the gangsta rap sub-culture. So although they've got little to do with actual gangsta rap, both music genres use its specific typography.\n\n"
    },
    {
      "time": "",
      "content": "NWA used Mistral. What are your sources for the earliest use? Looking around I don't see much blackletter in the early work.\n\n"
    },
    {
      "time": "",
      "content": "No, it's a pretty recent trend.\n\n"
    },
    {
      "time": "",
      "content": "If you're looking into blackletter as tattoo art you're probably going to want to dig into the tattoo development side quite a lot as well. I suspect style and development of tattoo genres/phases influenced the lettering artists use. For instance, tattooing around the time of WWII lettering was a more open style, these days a lot of lettering is script or blackletter. A good example of the latter, and someone who might be able to provide insight are tattooists like [Mr Cartoon](http://web.archive.org/web/20111221025645/http:/www.mistercartoon.com/) and [Maxx242](http://web.archive.org/web/20111221025645/http:/www.maxx242.com/).\n\nI'd also suggest contacting the editor of International Tattoo Art, and going to BMEzine. You might get some more answers there as well.\n\n"
    },
    {
      "time": "",
      "content": "jupiterboy may have a point questioning the german influence but i suspect it's there, indirectly, thru the heavy metal connection.\n\n ![](http://web.archive.org/web/20111221025645im_/http:/typophile.com/files/blackletterbands_5184.png)\n\n"
    },
    {
      "time": "",
      "content": "i recommend you contact mike mccabe, historian of tattooing well known in the tattoo community.\n\nhe's hard to find, but here's a few links:\n\n[http://tattoos.com/articles/mccabe/index.html](http://web.archive.org/web/20111221025645/http:/tattoos.com/articles/mccabe/index.html \"http://tattoos.com/articles/mccabe/index.html\")\n\n[http://www.amazon.com/Tattooing-York-City-Style-Continui/dp/0764313886](http://web.archive.org/web/20111221025645/http:/www.amazon.com/Tattooing-York-City-Style-Continui/dp/0764313886 \"http://www.amazon.com/Tattooing-York-City-Style-Continui/dp/0764313886\")\n\n[http://www.vam.ac.uk/vastatic/microsites/tattoo/search/Blue/talks.htm](http://web.archive.org/web/20111221025645/http:/www.vam.ac.uk/vastatic/microsites/tattoo/search/Blue/talks.htm \"http://www.vam.ac.uk/vastatic/microsites/tattoo/search/Blue/talks.htm\")\n\n[http://books.google.com/books?id=9kjG\\_vxVMaUC&pg=PA351&lpg=PA351&dq=mike...](http://web.archive.org/web/20111221025645/http:/books.google.com/books?id=9kjG_vxVMaUC&pg=PA351&lpg=PA351&dq=mike+mccabe+tattoo&source=web&ots=wnWKLw_-kl&sig=pDNyawWI6Mu8-LFszjIrNurhW5w \"http://books.google.com/books?id=9kjG\\_vxVMaUC&pg=PA351&lpg=PA351&dq=mike+mccabe+tattoo&source=web&ots=wnWKLw\\_-kl&sig=pDNyawWI6Mu8-LFszjIrNurhW5w\")\n\n"
    },
    {
      "time": "",
      "content": "And possibly the root—Hawkwind\n\n ![](http://web.archive.org/web/20111221025645im_/http:/typophile.com/files/Warrior_on_the_Edge_5334.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Oh, of course somebody had to come up with nazi comparisons in a thread about Mexico and blackletter, with Hitler being alive and well in South America and all ... ;)\n\nCh: _the “why” seems obvious: for nazis and gangs the style connotes an ancient or deeply rooted authority, much as medieval typography itself must have seemed to the common illiterate._\n\n\"medieval\" is a very broad term, wasn't it Martin Luther who printed the Bible in blackletter and thus the people's typeface, opposed to the a bit more authoritarian catholics using Latin set in Antiqua?\n\nAnd for the nazis, I don't think they used blackletter (before they banned it, but let's not go through all that again) because it spoke of authority but more due to its \"völkisch\" rustical character - if they had to have any reason at all to use it, other than it being the most widely used typeface style in Germany at the time.\n\nJens\n\n"
    },
    {
      "time": "",
      "content": "Thanks for that last bit, Jens, I can use that. :^)\n\n"
    },
    {
      "time": "",
      "content": "If it's recent, then my bet would be that it all traces back to Gerald Heurta's AC/DC logo; that's an iconic work that has just has stuck in everyone's head, and influenced legions of logos that emulated the look. So this might be the case of a consummate pro influencing the streets, rather than the other way around.\n\n"
    },
    {
      "time": "",
      "content": "http://en.wikipedia.org/wiki/Godwin's\\_law\n\n"
    },
    {
      "time": "",
      "content": "my point was the perceived authoritarian nature of the script among its appropriators thru association (correct or not), not the actuality of historical authoritarian usage.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.graphics.com/modules.php?name=Sections&op=viewarticle&artid=476](http://web.archive.org/web/20111221025645/http:/www.graphics.com/modules.php?name=Sections&op=viewarticle&artid=476 \"http://www.graphics.com/modules.php?name=Sections&op=viewarticle&artid=476\")\n\nSpanish Invade—1500s\n\nGermans Settlers—1830s\n\nHawkwind—1970\n\nACDC (Let there be Rock)—1975\n\n"
    },
    {
      "time": "",
      "content": "Yes, there is attribute such as \"authority\" essential to blackletter. All of that is imposed. It doesn't mean that these associations are not culturally active for a particular use. Just that they shift. That's the funny thing about blackletter. It pops up intermittently. And that allows it's meaning to be reinvented.\n\nThat Hawkwind image is super-fab! It looks a bit like an album cover for the band Yes although I bet it pre-dates those. How old is it?\n\n"
    },
    {
      "time": "",
      "content": "excellent link, jupiterboy. i concede the german influence is indirect at best, possibly thru heavy metal logos.\n\nperhaps it functioned as a sort of catalyst toward defiant identity mongering, or not at all. the hispanic catholic tradition seems to be the obvious thread.\n\n@baldcondensed: will you share your talk with us ?\n\n"
    },
    {
      "time": "",
      "content": "There's also a photographer, whose name i can't recall right now, but he documents gangs, he might know a bit of the history. His stuff is largely b/w, and had a lot of neo-nazi, gang and cuban boxing imagery.\n\n"
    },
    {
      "time": "",
      "content": "I had been thinking that the hawkwind was 1920's. Except for the landscape... I bet a romantic cartoon from the 1920 could have had blackletter title.\n\nWhat about Motörhead?\n\nDoes it's use of blackletter pre-date Hawkwind's?\n\n[http://upload.wikimedia.org/wikipedia/en/thumb/6/64/Motorhead.jpg/150px-...](http://web.archive.org/web/20111221025645/http:/upload.wikimedia.org/wikipedia/en/thumb/6/64/Motorhead.jpg/150px-Motorhead.jpg \"http://upload.wikimedia.org/wikipedia/en/thumb/6/64/Motorhead.jpg/150px-Motorhead.jpg\")\n\n"
    },
    {
      "time": "",
      "content": "I think Motörhead's use predates ACDC's BTW.\n\n"
    },
    {
      "time": "",
      "content": "All depends I guess. The Germans kids in the '60s really took to VU rather than Blues music. From that hot bed of rebellion against the recent past contemporary electronic, punk, and I would suggest metal were born. Most of it would be classified as prog. I could make a pretty good case that Amon Düül II, with the release of Yeti, was the proto metal band. Can the proto electronic. Hawkwind follows closely in that metal/prog. tradition. A good survey of this rediscovered music is Julian Cope's Krautrock Sampler.\n\nBack to Mexican Blackletter, I bet the real thread is in Santería and the syncretic appropriation of Catholicism.\n\n"
    },
    {
      "time": "",
      "content": "<cite> Back to Mexican Blackletter, I bet the real thread is in Santería and the syncretic appropriation of Catholicism. </cite>\n\nI don't think so so much. What has been impressed on me by a variety of sources is that Mexican blackletter is the opposite of special/underground/secret/dark - it's mainstream. And has been for a long time. Hence ice cream signs in Blackletter.\n\nAs for Metal beginning with Amon Duul - certainly the timing is valid. But Deep Purple Led Zepplin and Black Sabbath all come in right about there too 1967,8 9.\n\nI am not seeing Amon Düül or anybody else in blackletter though. I may be wrong, but the earliest use I have found so far is Motorhead.\n\n"
    },
    {
      "time": "",
      "content": "from a fascinating article in wikipedia:\n\nIn 1968, the sound that would become known as heavy metal began to coalesce. That January, the San Francisco band Blue Cheer released a cover of Eddie Cochran's classic \"Summertime Blues,\" from their debut album Vincebus Eruptum, that many consider the first true heavy metal recording.\n\n[http://en.wikipedia.org/wiki/Heavy\\_metal\\_music#History](http://web.archive.org/web/20111221025645/http:/en.wikipedia.org/wiki/Heavy_metal_music#History \"http://en.wikipedia.org/wiki/Heavy\\_metal\\_music#History\")\n\n"
    },
    {
      "time": "",
      "content": "\\>earliest use I have found so far is Motorhead.\n\nIn the thread linked above Gerald Huerta says he used blackletter on an album cover for Blue Oyster Cult which appeared in early 1975, when Motorhead was just being formed. That experience--where he appears on the back cover!--inspired him to return to that style for the AC/DC album, he says.\n\n"
    },
    {
      "time": "",
      "content": "Fascinating thread!\n\nI think the choice of blackletter as the preferred type style for tattoos and tattoo artist has very little to do with antiquity, reglion, culture, tradition or otherwise. I think deep down what appeals to the nature of those that chose blackletter for a tattoo are the strong and weak elements of the letter form itself. They graphically impart to the user a strong sense of community. Plus, elements of the letter offer to the tattoo artist and user alike, the opportunity to re-state the letter form as an indiviual statement.\n\nTest case - present two type choices to a hundred people in the 15-25 age group (group dynamic male and female). One choice sans serif, and the other choice blackletter. And ask each person why they chose one over the other. It would be cool if you could do this study in some major cities on a global scale.\n\nMy bet is that across all cultures, forget about just the gangs, my bet is that blackletter will be chosen over sans serif because of its letter form elements and how those elements relate to each other within each letter shape.\n\nDescriptive words that superceed stuff like tradition, religion, and culture - are words like 'elegant' and 'style'. Those words appeal to us all equally - regardless of religion, culture, tradition etc., etc... And that imho is what reaches us from the blackletter.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I don’t think so so much. What has been impressed on me by a variety of sources is that Mexican blackletter is the opposite of special/underground/secret/dark - it’s mainstream. And has been for a long time. Hence ice cream signs in Blackletter.</cite>\n\nMaybe I was not very clear, but I think we are saying the same thing—that the Spanish Catholics brought in a new culture and that new culture combined with the existing traditions. Special and mainstream are not opposed in my mind, and Santería is a folk expression of the power of the introduction of western religion combined with healer/shaman traditions that existed before the Spanish. In my neighborhood people go to church but also the candle shop. I don't see much dark or underground about this at all. I see these non-sanctioned religious expressions on almost every porch on my street. It is just another manifestation of some cosmic wish fulfillment.\n\nBlue Cheer is the official line ala Rolling Stone, but to my ear they are heavy, but also blues influenced—I don't completely buy it. Motorhead formed in 1975? That Hawkwind record in from 1970.\n\nAmon Düül II had that heavy, plodding, sludgy gate—along with an experimentalism and anger, and a hot female singer, and…\n\n[http://www.youtube.com/watch?v=\\_pcla5zyZfA](http://web.archive.org/web/20111221025645/http:/www.youtube.com/watch?v=_pcla5zyZfA \"http://www.youtube.com/watch?v=\\_pcla5zyZfA\")\n\nOdd video assemblage but the music is there.\n\n"
    },
    {
      "time": "",
      "content": "@hiroshige : i don't see how one can possibly divorce formal aspects from popular associations. as an academic exercise perhaps, but not in the real world.\n\n@jupiterboy : i don't think it's about blue cheer as much as it's about '68 - '69  \nas the beginning of the sound. i can't wait to seriously research this. i must know.\n\nand i think the blues influence is vital (led zep) - in fact it distinguishes the metal direction from prog.\n\n"
    },
    {
      "time": "",
      "content": "You're right. Those blues redo songs of Zep were never my favorite—my bias shows through.\n\n"
    },
    {
      "time": "",
      "content": "and just out of curiousity: how many typophiles have tattoos ?\n\n"
    },
    {
      "time": "",
      "content": "We had a thread about [Typophile tattoos](http://web.archive.org/web/20111221025645/http:/www.typophile.com/node/1156) before. There are a couple of links in there, but very few images.\n\n"
    },
    {
      "time": "",
      "content": "Chris, Godwin's Law doesn't really apply here because the mention in this thread is relevant and legitimate, and is not used to inflame. Furthermore -- I left out that part because I already have that information -- I'm indeed talking about the shift in cultural perception in my presentation, starting off with the Nazi/right wing connotation of blackletter.\n\n"
    },
    {
      "time": "",
      "content": "right about godwin's law - i just get a chuckle out of it.\n\nbut i repeat my question: would you be willing to share your talk with typophile ? it's been a scintillating read so far !\n\n"
    },
    {
      "time": "",
      "content": "[Written on the Body: The Tattoo in European And American History](http://web.archive.org/web/20111221025645/http:/www.amazon.com/Written-Body-Jane-Caplan/dp/0691057230/ref=cm_lmf_tit_18_rdssss0)\n\n"
    },
    {
      "time": "",
      "content": "I agree somewhat with what Hiroshige is saying. The reason that blackletter was chosen originally was for its beauty and decorative forms.\n\nI'm pretty sure there are other threads about this, but Nazi's had there own blackletter that was a mix of fractur and sans-serif.\n\nNobody is mentioning the fact that there are Aryan gangs in prison, and perhaps blackletter was introduced into the prison-system and therefore underground culture that way.\n\nIn my mind blackletter has come to represent many counter-cultures because it has a lot of power built in to its forms. It is always fun to use something that the mainstream culture has used for \"good\" and subvert it for your own use.\n\n"
    },
    {
      "time": "",
      "content": "\\> Written on the Body....\n\nBy [Professor Jane Caplan](http://web.archive.org/web/20111221025645/http:/www.history.ox.ac.uk/staff/postholder/caplan_j.htm) — University of Oxford\n\n"
    },
    {
      "time": "",
      "content": "James, I see now. Quite right. What I am not sure about is the Hawkwind sound. I mean - that looks glam to me aesthetically speaking. I need to fallow that up. The other thing is for all I know there is some pop record in the 60s that uses blackletter...  \nWilliam thanks for the reminder about the BOC/ACDC stuff.\n\n"
    }
  ]
}
