{
  "id": "42272",
  "title": "How Do I Make A Good Looking Arial Uicode Bold Font?",
  "forum": "Build",
  "tags": [

  ],
  "content": "We’re building a web page using Dreamweaver CS3/Fireworks and using Unicode MS as the main font. In both the Firefox and Windows browsers (in fact all we’ve tested) the bold version looks pretty bad. They don’t give you a true bold font so you have to achieve it using the “Bold” style setting in Dreamweaver.\n\nAnyone out there have experience with this?\n\nI’m also trying to figure a way to set the font at a variable width but no luck.\n\nThanks in advance :)\n\nmolly\n\n [‹ \"uni\" glyph name conventions](http://web.archive.org/web/20080907002329/http:/www.typophile.com/node/42294 \"Go to previous forum topic\") [Sent Fonts have lost some metrical information ›](http://web.archive.org/web/20080907002329/http:/www.typophile.com/node/42171 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907002329/http://www.typophile.com/user/27354\" title=\"View user profile.\">molly3</a>",
  "time": "<br>",
  "uid": "27354",
  "comments": [
    {
      "time": " 21.Feb.2008 1.13pm",
      "content": "There is no bold version of Arial Unicode, so you’re seeing the OS’s fake/synthetic bold. Larger question, why Arial Unicode? It comes with Office (and Mac OS Leopard?) but not any version of Windows, and on top of that both Windows and Mac come with far better language-specific fonts in regular and bold.\n\n"
    },
    {
      "time": " 21.Feb.2008 1.40pm",
      "content": "Thanks for getting back to me about arial unicode—I like the way the regular unicode looks especially when there’s lots of text. I first saw it on the youtube site—it’s the text font they use and I thought it was pretty much available across all browsers. I don’t like verdana , geneva or myriad—can you suggest one you think is closer to unicode but a better screen font with a bold option? Thanks again for all your help—Molly\n\n"
    },
    {
      "time": " 21.Feb.2008 2.06pm",
      "content": "How about the standard Arial? What characters in Arial Unicode are missing in Arial that you care about?\n\n"
    },
    {
      "time": " 21.Feb.2008 2.52pm",
      "content": "I guess I’m very picky-I can see a difference between arial and arial unicode—The unicode has a more sophisticated look to it(except for the fake bold issue). I gues what I’ll end up doing is setting most of my text in unicode and the bold text in arial bold—not perfect but I think as close as i’ll get to it.\n\n"
    },
    {
      "time": " 21.Feb.2008 9.19pm",
      "content": "Interesting, the fonts are basically the same outlines for the western characters, but Arial has “better” hinting. As you say, there’s nothing to stop you specifying “Arial Unicode MS, Arial” in your code and specifying “Arial Bold” for any bold text\n\n"
    }
  ]
}
