{
  "id": "42270",
  "title": "A SURVEY: What was your first book about typography?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi there,  \nI’m doing a quick survey to ask, ’what was your first book about typography?’  \nParticularly, which books were on your first year (freshman) university/college/apprenticeship reading list? And which of these was the first that you bought, read, and referred to early on in your typographic education.\n\nFor me it was James Felici’s Complete Manual of Typography.\n\n",
  "author": "<a href=\"/web/20091213000205/http://www.typophile.com/user/15250\" title=\"View user profile.\">Hellbox</a>",
  "time": "<br>",
  "uid": "15250",
  "comments": [
    {
      "time": " 20.Feb.2008 3.59am",
      "content": "PS I realise there are other posts regarding ’books for newbies’, ’best books on typography’ and, of course, the ’Typographic Triumvirate’. But I’m really after the name of your first book, not your/the best.\n\nAnswers on a postcard!\n\n"
    },
    {
      "time": " 20.Feb.2008 4.15am",
      "content": "Erik Spiekermann and EM Ginger’s _Stop stealing sheep and find out how type works._\n\n"
    },
    {
      "time": " 20.Feb.2008 4.16am",
      "content": "[_Basic Typography: A Design Manual_](http://web.archive.org/web/20091213000205/http:/www.amazon.com/Basic-Typography-Design-James-Craig/dp/0823004511) by James Craig.  \nRequired reading before I began college – <cite>does exactly what it says on the tin!</cite> Certainly not one for igniting _inspirado_.\n\n"
    },
    {
      "time": " 20.Feb.2008 5.46am",
      "content": "Thanks Dan and Conor.\n\n\\> Certainly not one for igniting inspirado\n\nNo – understandably.\n\nAs a matter of interest, when you do offer the name of your first book, it would be great if, like Conor, you could offer a few words about its impact on you and your peers.\n\nDid many of your peers buy/read/borrow the same book?  \nWhat was the general class consensus?  \nWere you in a minority?  \nDid it inspire you to read more? Or did it bring on a yawn?\n\n"
    },
    {
      "time": " 20.Feb.2008 5.52am",
      "content": "I believe I bought both Bringhurst’s _The Elements of Typographic Style_ and Craig’s _Designing with Type_ at the same time in the RISD bookstore, but I only take one with me wherever I go. Guess which one ;-) .\n\nEDIT: Per Ryan’s request, I’ll make it more explicit. I had been into type for several months before buying Bringhurst, but as soon as I sat down with it, I knew I was passionate about what it detailed. Just one of those classics (if I can call it that after only two years). Craig was certainly not bad, but I read it after reading most of Bringhurst, and there wasn’t too much new information in there. Some practical knowledge, though, and a better introduction to identifying common typefaces than Bringhurst.\n\n"
    },
    {
      "time": " 20.Feb.2008 6.05am",
      "content": "_Stop stealing sheep and find out how type works_ was my first too.\n\n"
    },
    {
      "time": " 20.Feb.2008 6.15am",
      "content": "The first book that I bought on typography was in 1967, “Typographie” by Emil Ruder. It was not available until a year after I graduated from design school but my typography professor was a student of Ruder so his teachings were part of our curriculum before the book was published.\n\nChrisL\n\n"
    },
    {
      "time": " 20.Feb.2008 6.20am",
      "content": "Either Bringhurst or S. Carter’s _Twentieth-Century Type Designers_ — can’t remember which.\n\n"
    },
    {
      "time": " 20.Feb.2008 6.22am",
      "content": "Stop Stealing Sheep.\n\n"
    },
    {
      "time": " 20.Feb.2008 6.28am",
      "content": "In addition to this post, I’d like to post the same question on another forum for designers, which isn’t so obviously for typophiles.  \nCan anyone recommend such a forum?\n\n"
    },
    {
      "time": " 20.Feb.2008 6.29am",
      "content": "_Types of Typefaces_ (1967) by J. Ben Lieberman.\n\n"
    },
    {
      "time": " 20.Feb.2008 8.41am",
      "content": "I don’t remember the exact title, but it was a grim technical textbook on how-to’s. I still remember my excitement at first letterspacing and leading!\n\n"
    },
    {
      "time": " 20.Feb.2008 8.57am",
      "content": "Type and Typography: The Designer’s Type Book, Revised Edition by Ben Rosen\n\nI had jobs though before school so I had (and still do) a Linofilm by Typographics sample book.\n\n"
    },
    {
      "time": " 20.Feb.2008 9.38am",
      "content": "Ursache und Wirkung: ein typografischer Roman (1984) by Erik Spiekermann\n\n"
    },
    {
      "time": " 20.Feb.2008 9.42am",
      "content": "[Hans Peter Willberg, Friedrich Forssman: _Erste Hilfe in Typografie. Ratgeber für Gestaltung mit Schrift_](http://web.archive.org/web/20091213000205/http:/www.typografie.de/verlagsverzeichnis/typografie/474-3.html)\n\n"
    },
    {
      "time": " 20.Feb.2008 11.13am",
      "content": "I got my one 1972 and I wrote already about it.  \nMay be you guys cannot read it, because its written in german. Please forgive me that I’m too tired to tranlate it now — but: there is a picture included:\n\n[http://www.bleisetzer.de/cms/front\\_content.php?idcat=58&idart=804](http://web.archive.org/web/20091213000205/http:/www.bleisetzer.de/cms/front_content.php?idcat=58&idart=804 \"http://www.bleisetzer.de/cms/front\\_content.php?idcat=58&idart=804\")\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": " 20.Feb.2008 11.43am",
      "content": "In 1973, I had just gotten my journeyman’s card as a hot-metal hand compositor. I had worked as an apprentice comp for 5 years. Though I had never read anything about “typography,” I was excited about setting type for books. That summer I spent 5 weeks at the Vermont farm of the great type teacher Ray Nash. I read both volumes of Updike’s “Printing Types” and talked with Ray and the handful of other students about what I had read.\n\nWhen I had time I watched the Watergate hearings on TV.\n\nDiscovering the richness of typography in Updike made me go back to college, finish the final semester for a BA in English, and then commit to becoming a typographer. Here I yam, 35 years later.\n\npowers\n\n"
    },
    {
      "time": " 20.Feb.2008 12.21pm",
      "content": "35 years, Will...  \nTell me: Is this real? What is real?? Am I real???  \nOh Jeeee... 35 years.\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": " 20.Feb.2008 12.35pm",
      "content": "Tschichold’s _Meisterbuch der Schrift_, and a bit later _The Form of the Book_. Then at university, yet another Tschichold. He did have quite an impact, but meanwhile I have more sympathy for less dogmatic authors like Paul Renner. No idea why I prefer dead authors, though ...\n\nIt’s funny to see that the books indicate how old its readers are. _Stop Stealing Sheep_ readers must be the younger Typophilers.&nbsp;&nbsp;:D\n\nbleisetzer — <cite>but: there is a picture included</cite>\n\nNice, I have one too!\n\n"
    },
    {
      "time": " 20.Feb.2008 12.36pm",
      "content": "I don’t remember which order they came in, but the required reading when I was studying type and design in college in the mid-1970s was:\n\nTypography, by Emil Ruder  \nAsymmetric Typography, by Jan Tschichold  \nDesign With Type, by Carl Dair\n\n"
    },
    {
      "time": " 20.Feb.2008 12.38pm",
      "content": "The TeXBook, by Donald Knuth.\n\nNot really a general typography book, being specifically for the typesetting of mathematics, but it carried a lot of typographic information.\n\n"
    },
    {
      "time": " 20.Feb.2008 1.23pm",
      "content": "\\>Stop Stealing Sheep _readers must be the younger Typophilers._\n\nHmmm. But not **so** young. Wasn’t the book first published in 1991 or 1992? (I bought mine albeit much later, in 1998…)\n\n"
    },
    {
      "time": " 20.Feb.2008 2.25pm",
      "content": "I honestly can’t remember for certain, but I think it was _Stop Stealing Sheep_. Though the first book I bought of my own accord was Bringhurst’s _The Elements of Typographic Style_.\n\n"
    },
    {
      "time": " 20.Feb.2008 2.27pm",
      "content": "Bringhurst.\n\n"
    },
    {
      "time": " 20.Feb.2008 2.28pm",
      "content": " ![](http://web.archive.org/web/20091213000205im_/http:/www.typophile.com/files/AT_6203.jpg)\n  \nI don’t recall there being any typography books on the curriculum of my Foundation course or Dip.AD (Fine Art), in the early ’70s in the UK. So “my” first book about typography actually belongs to my wife, who bought it when she was studying art at the University of Manitoba.\n\nI’ve always been impressed with the asymmetric application of the price stickers, and their red bars which echo the bar on the dust jacket!\n\n"
    },
    {
      "time": " 20.Feb.2008 2.31pm",
      "content": "Now that’s a bullet.\n\n"
    },
    {
      "time": " 20.Feb.2008 2.31pm",
      "content": "Nick is so damned hardcore.\n\n"
    },
    {
      "time": " 20.Feb.2008 2.41pm",
      "content": "But now that I think about it (for the first time, it would seem), the grey sticker covers up the asymmetricality of the author line.\n\n"
    },
    {
      "time": " 20.Feb.2008 3.38pm",
      "content": "But Nick, 6 bucks for a book is a real deal :-)\n\nChrisL\n\n"
    },
    {
      "time": " 20.Feb.2008 3.47pm",
      "content": "Elements of typographic style. i jumped in on the deep end...\n\n"
    },
    {
      "time": " 20.Feb.2008 4.04pm",
      "content": "There was a little thing I picked up in the late 1980s:  \n_The Mac is not a Typewriter_  \nNot so much a typography book, but it was enough to break me of typewriter habits before I got out of high school.\n\n"
    },
    {
      "time": " 20.Feb.2008 5.18pm",
      "content": "Typographic Design: Form and Communication, by Carter, Day and Meggs\n\nNot the most exciting of books, but solid. 95% of the class switched from print design to web design after Typography 101 and this book :)\n\n"
    },
    {
      "time": " 20.Feb.2008 5.40pm",
      "content": "<cite>95% of the class switched from print design to web design after Typography 101 and this book :)</cite>\n\nThat book scared the living shit out of me during sophomore year. Now I have two copies.\n\n"
    },
    {
      "time": " 20.Feb.2008 6.13pm",
      "content": "I, unfortunately, sold it back to the school bookstore.\n\nBut the book set me on a path. I never intended on getting interested in type or typography. I went to school for photography, but our school’s Visual Communications: Photography program required a class in basic typography.\n\nAfter that first class that everyone else dropped, I was hooked :)\n\n"
    },
    {
      "time": " 20.Feb.2008 8.05pm",
      "content": "bringhurst, 20th century type, stop stealing sheep, and robin kinross’ classic modern typography — which i am quite surprised no one has yet mentioned — it’s crucial.\n\n"
    },
    {
      "time": " 20.Feb.2008 8.29pm",
      "content": "Bringhurst, and thinking with type.\n\n"
    },
    {
      "time": " 20.Feb.2008 9.06pm",
      "content": "I haven’t gone to university, college or an apprenticeship. The first typography book I read was _The Elements of Typographic Style_.\n\n"
    },
    {
      "time": " 20.Feb.2008 11.02pm",
      "content": "Mine were also Stop Stealing Sheep & The Elements of Typographic Style.\n\n"
    },
    {
      "time": " 20.Feb.2008 11.21pm",
      "content": "I became interested in type\\* long after I’d graduated college. I’ve done a lot of internet research & went to TypeCon in 2006, but my first real typography book is “About Alphabets” by Zapf, which I read last year. Since then, I’ve gotten a bunch from the library. I’m still quite new to it all, though.\n\n\\*I’ve loved type since I was a little kid - I’d pore over books from the library on “Circus Letters” and spend hours retraining my handwriting to be big or small or have two-story a’s, etc. But I didn’t know other people liked this and kind of lost track of it until a few years ago.\n\n"
    },
    {
      "time": " 21.Feb.2008 2.43am",
      "content": "Excellent — don’t stop! With any luck I’ll get the feedback from everyone on Typophile.com.  \nDan is right about <cite>Stop Stealing Sheep</cite> — I have the first English paperback edition that was published in 1993.\n\nAs a matter of interest: is anyone here still studying, or in some way in touch with current design students? Do you know what is being read Now by beginners? I spoke to a first year student last weekend who mentioned <cite>Type &amp; Typography</cite>, by Baines & Haslam, <cite>About Face</cite> by David Jury and, obviously, one of Carson’s books.\n\n- What are the main titles now being read by complete beginners?\n- Perhaps <cite>Elements of Typographic Style</cite> is a bit heavy for a beginner, or do you disagree?\n- Do you think many graphic design students read <cite>First Principles of Typography</cite> by Stanley Morison(?) or are such books now considered irrelevant by beginners?\n\nBack in the beginnings of my education, I always had the opinion that anything printed more than 10 years before wasn’t worth reading!\n\n"
    },
    {
      "time": " 21.Feb.2008 2.58am",
      "content": "_anything printed more than 10 years before wasn’t worth reading!_\n\nStudents would take to Morison if he were reprinted in Helvetica.\n\n"
    },
    {
      "time": " 21.Feb.2008 3.15am",
      "content": "Before setting my first book I bought Bringhurst and John Kane’s _A Type Primer_ simultaneously. Kane’s book isn’t bad, but it didn’t change my life. Bringhurst did (obviously).\n\n"
    },
    {
      "time": " 21.Feb.2008 3.18am",
      "content": "Maybe that’s true Nick. Please elaborate.\n\n"
    },
    {
      "time": " 21.Feb.2008 3.49am",
      "content": ":-)\n\n"
    },
    {
      "time": " 21.Feb.2008 4.47am",
      "content": "[A Type Primer](http://web.archive.org/web/20091213000205/http:/www.amazon.co.uk/Type-Primer-John-Kane/dp/1856692914/ref=pd_bbs_sr_1?ie=UTF8&s=books&qid=1203597970&sr=8-1) by John Kane.\n\n"
    },
    {
      "time": " 21.Feb.2008 4.57am",
      "content": "The _first_ book I got was _inPrint_ by Alex Brown. It really is a great _introductory_ book for those who don’t want to start at the deep end.\n\nSome people start with the (Bringhurst) Bible; others start with bible stories.\n\nISBN 0823025446; out of print; you can find used copies dirt cheap, unlike Dowding’s _Finer Points_ which sells for about $80.\n\n"
    },
    {
      "time": " 21.Feb.2008 6.33am",
      "content": "<cite>Perhaps Elements of Typographic Style is a bit heavy for a beginner, or do you disagree?</cite>\n\nIt was a touchstone for me. When I was in school (not a very good design school) it was all backlash and ’70s freedom. There was very little taught about classic geometry and structure. Everything was stagnant and the Mac was about to hit. Elements was the real deal—it had all the knowledge my teachers didn’t have, which is exactly what I wanted. I think the book works as a read, but also a great reference. I still look things up in it all the time.\n\n"
    },
    {
      "time": " 21.Feb.2008 6.43am",
      "content": "I became interested in type looking at specimens used by my parents. :) But the first real book was “Designer’s Guide To Typography”, edited by Nancy Aldrich-Ruenzel and John Fennell [1991] . It is the special annual edition of Step-By-Step Graphics magazine.\n\n"
    },
    {
      "time": " 21.Feb.2008 7.12am",
      "content": "<cite>A Type Primer by John Kane.</cite>\n\nIt should be everyone’s first. Reading Kane cleared up all the confusion I was left with after reading the usual stuff.\n\n<cite>Perhaps Elements of Typographic Style is a bit heavy for a beginner, or do you disagree?</cite>\n\nI tried reading it early on and was really confused as to why my professor wanted me reading all this pretentious nonsense that no editing department would ever go with. I often use it as a reference, particularly for terminology, but as a student I find the advice in it is usually too impractical to be of much real value. Professors who insist we read Bringhurst will usually see our work as boring, dated, or stuffy if we put the ideas into practice. And all three of my design jobs have explicitly stated not to follow Bringhurst.\n\n"
    },
    {
      "time": " 21.Feb.2008 7.37am",
      "content": "Well, it is not my first type book, but Edmund C. Arnold was my hero in my college days back in the 70s. He wrote several books about newspaper design during the 50s and 60s. At that time I thought I wanted to be a reporter ... turns out I really wanted to design newspapers, not write for them.\n\n"
    },
    {
      "time": " 21.Feb.2008 7.38am",
      "content": "Gerald Unger’s “About Reading” is a good blend. Batty’s “Type & Typography”, and AtypI’s “Language, Culture, Type” are worthy reads, too.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Feb.2008 7.39am",
      "content": "Do you mean “Ink on Paper” Don?\n\nChrisL\n\n"
    },
    {
      "time": " 21.Feb.2008 7.41am",
      "content": "That could be one, Chris. I seem to remember two or three books by him in the Niagara College library back in the early 70s.\n\n"
    },
    {
      "time": " 21.Feb.2008 7.43am",
      "content": "I too started at the deep end with Bringhurst.  \nIt was very interesting, but after that I needed something lighter - so my next was Stop Stealing Sheep.  \n:-)\n\nSince then I have aquired and read quite a few books about Typography - some favourites:  \nLogo, Font & Lettering Bible - Leslie Cabarga  \nCounterpunch - Fred Smeijers  \nDesigning Type - Karen Cheng  \n...  \nBut the best bit is actually \\_working\\_ with fonts!  \n:-)\n\n"
    },
    {
      "time": " 21.Feb.2008 7.55am",
      "content": "Don, Arnold’s “Ink on Paper” was the book used often in journalism schools in those years for editors and aimed mostly at newspaper editors.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Feb.2008 8.19am",
      "content": "I showed the _Logo, Font & Lettering Bible_ to one of my teachers who was about to start teaching the Design 101 classes after some staff turnover, and he loved it. He’s the grizzled oldschool graphics guy who polishes the students from beginners to advanced, but he’s always complaining that he’s getting students who managed to go through two typography courses without even a basic understanding of typography.\n\nHe’s also the teacher who goes the most into logo conceptualization and design, so Cabarga’s book was a big hit with him. He said he was contemplating using that book as the Design 101 textbook. I wouldn’t have complained myself.\n\n"
    },
    {
      "time": " 21.Feb.2008 8.51am",
      "content": "Planck’s Typographic specimen, from my fathers hot metal shop… I was 4 or 5, smell the lead! I still use it for inspiration today.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": " 21.Feb.2008 9.23am",
      "content": "_EoTS_ is definitely too heavy to just throw in a new student’s lap. It should follow a more surface-level primer, so they at least have their footing first. That being said, when I did a brief bit of TA’ing and teaching, I recommended to my students that they sit down and read it, acknowledging that they would only understand about 50% of it, if that. Then, a year later, they should re-read it and they’d be surprised at how much more they understand and how much more they could analyze and consider the concepts. Every so often I return to Bringhurst (I’ve read it from front to back about 3 times, but dip into it regularly) as both a barometer and a refresher. I don’t think I’ll ever understand/use 100% of it, but I get more and more from it each time. This, to me, is what makes it such a valuable and practical tool.\n\nMost of these books overlap with about 50% of their content, so I’ve found that finding the right book is often just as much as case of the quality of the text as it is the compatibility of the reader and the presentation.\n\nOther books I’ve found useful are: Lupton’s _Thinking With Type_ and Felici’s _Complete Manual of Typography_. Lupton delivers the message in a very digestible and skillful manner. She hits on the totality and reality of designing with type very well, whereas I like Felici’s somewhat pedantic nature. It was great to have someone really get down to the nitty gritty and show blocks of type with different H&J settings (it’s Quark 4.1-centric, which is now ironic, as it was published by Adobe). The further irony is that I really didn’t like the typesetting in Felici’s book. But I found the actual content to be very valuable at training my eye and mind to recognize subtle differences in set type.\n\n"
    },
    {
      "time": " 21.Feb.2008 9.37am",
      "content": "If my memory serves me right, the first type related books I bought were The Thames and Hudson Manual of Typography by Ruari McLean and Type & Typography by Baines & Haslam, can’t recall the order. Neither was for school, and I didn’t have a clue what to look for in a book on type.\n\n"
    },
    {
      "time": " 21.Feb.2008 10.08am",
      "content": "Thanks Chris,  \nThis is certainly not intended to sound rude, but it would be interesting to know just how many of your students <cite>really</cite> read <cite>’Elements’</cite> whilst still at university? And who fibbed and skipped to the end?  \nDo you/have you ever encouraged self-expression in your typography classes?\n\nA few years back, when I was at university, ’conventional’ typography was seen as too academic and a lot of students — myself included, initally — just wanted to be creative without a planned, conventional approach (whoops!).  \nI think my entire class wanted to be a Stanley Donwood, or a David Carson, rather than an unknown who communicated conventionally!  \nHowever, maybe that was just my experience, and/or perhaps this has now changed – is rational fashionable?\n\n"
    },
    {
      "time": " 21.Feb.2008 10.12am",
      "content": "Hi Mili,  \nIn which country did you study?  \nDid you find either of the books inspiring?  \nOne more than the other?  \nDid you know what to look for in a book about typography after reading them?\n\nSorry — so many questions.\n\n"
    },
    {
      "time": " 21.Feb.2008 10.29am",
      "content": "What was exciting for me to read middle of the 70ies was an american magazine, a big formatted one, I cannot remember the name, but I think, you guys know it? It was called UC&L or so. A newspapier format and paper. With exciting new typography ideas (for me). It was the first magazine, what I got (for free!!) by mail from US.\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": " 21.Feb.2008 10.45am",
      "content": "U&lc was published by ITC and had a very large following. It was free to anyone on their mailing list. I still have several copies as wellth the hardbound book of specimens from ITC, “The ITC Typeface Collection”. It is filled with the large x-height and tightly spaced faces of the era.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Feb.2008 10.47am",
      "content": "_...just how many of your students really read ’Elements’ whilst still at university? And who fibbed and skipped to the end?_\n\nThey’re just cheating themselves. How can you understand the ending unless you’ve read the whole thing?\n\n:-)\n\n"
    },
    {
      "time": " 21.Feb.2008 10.54am",
      "content": "I must admit that I have attempted to read “Elements” a few times and just can’t get through it. I realize everyone on earth praises it to glory but I just find it grueling to read. There is tons of information there, for sure, but I just can’t connect with the writing. I have owned the book for 4 years but avoid it over any of the other books I own and I have hundreds of type books collected over the past 50 years.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Feb.2008 10.59am",
      "content": "I sort of skipped the last third of _The Elements of Typographic Style_, but I still got a lot out of it. I think I read _Stop Stealing Sheep_ next and _Designing with Type_ third. The first two discussed differences in different styles of type, but _Designing with Type_ explained them in a more exciting way. Only after reading _Designing with Type_ did I understand the major differences among different styles of type.\n\nOne of my friends recently expressed interest in typography after I critiqued her use of hyphens. I gave her _The Elements of Typographic Style_ and _Thinking with Type_. I was thinking about giving her _Designing with Type_, but I didn’t give it to her, mainly because the pages are big.\n\n"
    },
    {
      "time": " 21.Feb.2008 11.32am",
      "content": "On the topic of current textbooks, the popular books one finds either on syllabi or in handouts at the Corcoran are:  \n1st & 2nd semester: _Stop Stealing Sheep_, _Thinking With Type_, _Typographic Design: Form and Communication_, _Elements of Typographic Style_, _Revival of the Fittest_  \n3rd and 4th Semester: _Exploring Typography_, _Type and Typography_, _Grid Systems (Muller-Brockmann)_, _Designing Books_\n\nIt’s also pretty common to see teachers recommend _Making and Breaking the Grid_, _Designing Type_ (for logo projects) and Willi Kunz’s books. Typography and grids are pretty important at the Corcoran.\n\n"
    },
    {
      "time": " 21.Feb.2008 11.49am",
      "content": "I suffered from poor craft skills during my Typography 1 course. Everything was done by hand there, and this caused me to severely dislike the course and the subject.\n\nBefore I took my second semester of typography, I had a six-week course in stone-carving, for which the hand-lettering and carving was just more craft, which I did not excel at. However (God knows why…) I read _Elements_ of my own accord concurrently. Bringhurst’s prose (and his magical writing alone!) made me fall in love with type. I read the book quickly, in a feverish rush, from cover to cover (except for that weird chapter on page proportion). I was only 19.\n\nI do not buy this rubbish that young students do not read. Those that do not I cannot take seriously! This is just the way it is… not everyone who studies graphic design is cut out for typography, which isn’t a bad thing. I’m not particularly cut out for illustration myself either, for instance.\n\nI know plenty of type and typography people who read. I’ve studied at four schools in three countries, and the students that were the most into type were always voracious readers. They read everything. In fact, we used to try to out do each other (“what, you read that? goddamit! what can I read next that’ll be even more impressive?”).\n\n"
    },
    {
      "time": " 21.Feb.2008 11.54am",
      "content": "My very first book about typography was The Lettering Book by Noelene Morris. I started using it from when I was about 7, and stopped using it when I was about 12 (we stopped doing ’title pages’ in our exercise book after that). I’m pretty sure that I still have it somewhere. Ah, the memories!\n\n—K\n\n ![](http://web.archive.org/web/20091213000205im_/http:/www.typophile.com/files/The_Lettering_Book_4185.jpg)\n\n"
    },
    {
      "time": " 21.Feb.2008 11.55am",
      "content": "_Typography and grids are pretty important at the Corcoran._\n\nMaybe that’s because typography and grids **are** pretty important. Typing, with fonts in a document, you are setting characters in a line. This line is spaced in relation to other lines. These multi-line blocks live in relation to their pages, and with other blocks, elements, images, etc.\n\nSounds like a grid to me ;-)\n\n"
    },
    {
      "time": " 21.Feb.2008 11.56am",
      "content": "Ginger’s Stop stealing sheep and find out how type works. =)\n\n-\n\n[www.nunocoelho.com](http://web.archive.org/web/20091213000205/http:/www.nunocoelho.com/ \"www.nunocoelho.com\")\n\n"
    },
    {
      "time": " 21.Feb.2008 1.13pm",
      "content": "<cite>I do not buy this rubbish that young students do not read.</cite>\n\nIt’s not that they don’t read, it’s that they often don’t read what they’re supposed to, at least relative to their majors.\n\n<cite>Maybe that’s because typography and grids are pretty important.</cite>\n\nI agree. I was just making the point that we get the stuff beaten into our heads in every design class for three years, while at some schools only a semester of type is required and grids are not taught at all.\n\n"
    },
    {
      "time": " 21.Feb.2008 1.39pm",
      "content": "_This is certainly not intended to sound rude, but it would be interesting to know just how many of your students really read ’Elements’ whilst still at university? And who fibbed and skipped to the end?  \nDo you/have you ever encouraged self-expression in your typography classes?_\n\nNo offense taken, certainly. It’s a good question. I imagine the number was low, as I was not the lead professor and was simply making a recommendation. _EoTS_ was starting its first sweep through CMU’s School of Design at the time. I was simultaneously TA’ing for a Graphic Design Fundamentals-style crash course and teaching 4 design apps in 4 weeks to incoming grad students. They were a very serious and committed bunch, though, so I’m sure most of them checked it out and those who did read it, really dug into it. Because it was simply my recommendation and not a real directive, I didn’t bother to hold them to it in any way.\n\nBecause I’ve never really run my own type class in the full sense, I wasn’t in a position to encourage self-expression. However, I strongly believe that it’s far too easy to swing the pendulum to either side to the detriment of the other. Some of my favorite professors, Karen Berntsen and Karen Moyer (these are the two relevant to this topic, not my only favorites) had ingenious ways of encouraging creative problem solving over handing out stylistic specifics. CMU was very Swiss-centric when it came to style, but in many ways the onus for creativity and style was pretty much in the laps of the students. However, it was rock-solid for teaching problem solving and conceptual thinking. If I were to teach, I would put students on three parallel paths, intersecting with a final project: 1) rules, conventions and standards; 2) free-form exploration and expression; 3) problem solving and [lateral thinking](http://web.archive.org/web/20091213000205/http:/en.wikipedia.org/wiki/Lateral_thinking).\n\nI think there’s a way to emphasize all three approaches and keep students engaged. In the end, the professor needs to communicate a true passion for what they do, particularly because graphic design and typography are such a strange brew of pedantic rules and heady rule-breaking. This is why Lupton’s book is a good first step, from my perspective. It’s like a friendly conversation with a passionate practitioner, whereas reading Bringhurst is more like gaining access to the secret manuscripts of the Cult of Typography;\\* if you don’t have some degree of passion and knowledge already, you’ll quickly lose interest in the prose and minutiae and become overwhelmed. I’m sure this is why Bringhurst is not as appealing to longtime practitioners as well: much of that knowledge is not particularly novel to those who’ve experienced pre-digital type.\n\n\\*Though they’re certainly only secrets in the sense that most never think to seek them out.\n\n"
    },
    {
      "time": " 21.Feb.2008 2.06pm",
      "content": "At school, we began with _Thinking with type_ then proceeded to _Elements of Typographic style._  \nBut my real first, was an old Russian/Estonian book on typography and lettering _“Современный шрифт” Modern Type by Villu Toots._\n\n ![](http://web.archive.org/web/20091213000205im_/http:/www.typophile.com/files/toots_6526.gif)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20091213000205/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    },
    {
      "time": " 21.Feb.2008 2.49pm",
      "content": "W. A. Dwiggins’ _Layout in Advertising_.  \nA brilliant little book.\n\n"
    },
    {
      "time": " 21.Feb.2008 3.19pm",
      "content": "My first “type book” was _Le Ramat de la typographie_ (sorry, no English translation, in a word, it’s a technical book telling rules about where to place spaces and so on). Next followed Felici’s _The Complete Manual of Typography_.\n\nAt University we were obligated to read Bringhurst’s _The Elements of typography_ (wich lead me to _A Short History of the Printed Word_) and Noordzij’s _The Stroke_ (wich lead me to _Letter Letter_). To be sure that we were reading them, our teacher asked us to do an oral presentation about the chapter of the week. I do like Bringhurst and do not find it difficult to read, but I must admit that I skipped _Appedix A:The Working Alphabet_ (don’t be rude to me, it’s “just” a listing of glyphs!).\n\nBringhurst and Noordzij are still in the corpus of the University.\n\nOtherwise, I enjoyed _Making and breaking the grid_, _Grid Systems in Graphic Design_, _Dutch type_, _Couterpunch_, _Type now_, lots of Hyphen Press books and so on…\n\n"
    },
    {
      "time": " 21.Feb.2008 4.22pm",
      "content": "Eric Gill’s An Essay on Typography\n\n"
    },
    {
      "time": " 21.Feb.2008 4.45pm",
      "content": "If type specimen books count then it was so long ago I couldn’t tell you. But if it’s actual books about type we’re after, it was either [Helvetica: Homage to a Typeface](http://web.archive.org/web/20091213000205/http:/www.amazon.com/Helvetica-Homage-Typeface-Lars-M%C3%BCller/dp/3037780460/ref=sr_1_1?ie=UTF8&s=books&qid=1203640679&sr=1-1) or this gem. I don’t have a lot of typography books.\n\n ![](http://web.archive.org/web/20091213000205im_/http:/www.typophile.com/files/26letters_3926.jpg)\n\n"
    },
    {
      "time": " 21.Feb.2008 8.10pm",
      "content": "The first one I bought was Felici’s. Coming into typography from being an editor, not a designer, I found Felici to be a more familiar language than Bringhurst.\n\n"
    },
    {
      "time": " 21.Feb.2008 11.23pm",
      "content": "<cite>In which country did you study?</cite>  \nFinland, but the books were bought in London. The school I went to had fairly limited amount of typography in its agenda, and we had our own material. There weren’t a lot of books on type in Finnish then, not even now.\n\n<cite>Did you find either of the books inspiring?<br>\nOne more than the other?</cite>  \nI somehow found the Hudson a bit old fashioned (well, it was older), Type and Typography was more interesting. Getting really into typography took time, there were so many other aspects in design to learn, too.\n\n<cite>Did you know what to look for in a book about typography after reading them?</cite>  \nNot really. I don’t know if I should even admit this, but I only learned about Bringhurst from Typophile. After discovering this site my typografical library has grown a lot.\n\n<cite>Sorry — so many questions.</cite>  \nThat’s ok :)\n\n"
    },
    {
      "time": " 22.Feb.2008 1.31am",
      "content": "Bringhurst.\n\nFavourite, though it’s not really a book on typography per se, is the Lubalin biography.\n\n"
    },
    {
      "time": " 22.Feb.2008 2.16am",
      "content": "Thanks to all that have posted since I last logged on.\n\n**Mili**  \nThat’s quite acceptable that you learnt about Bringhurst’s <cite> ‘Elements’</cite> on Typophile. I think the book is largely referenced in typographic circles, but I don’t think I have ever seen it in a bookshop here in the UK. At least not since its original release.\n\n**Chris**  \nI agree, I think Lateral Thinking is absolutely crucial. Learning about past and current methodologies before using abstract concepts. I think students who have learnt convention in the first stages can’t help being guided by it in the lateral thinking modules, because it makes sense. I think one benefit of lateral thinking, is that it serves to show the order and balance provided by well-practiced conventional design methods that the student has stepped away from (in the lateral thinking module).\n\n**Dan**  \nI agree. Reading books/articles/other comes with the territory. Sure, not every graphic design student is cut out for studying typography, however, unfortunately, many of them want to practice it. I think if you sign up to design books, brochures, websites, newspapers, and visual identities or, in fact anything text-based it would be foolish to ignore the discoveries of the people who have laid the path for you — to listen to what they have to say before you make your moves.\n\nThis week I have seen two very worrying examples of typography. The first was a conversation with a student, who on the one hand told me he was a stickler for typography rules and on the other told me that kerning was no longer relevant to designers as “Indesign does it for you”, and past technologies (metal and photosetting) were ‘irrelevant to digital typography”. I recommended <cite> ‘Elements’</cite>.\n\nThe second was a friend of a friend who sent us an ’e-catalogue’ he’d just finished for his new employers. The catalogue was in flash, and when we zoomed-in the type at low resolution so it could not be distinguished, “but” he said, “the pages-turning effect is cool”.\n\nReading is not for everyone, but sometimes you have to just get on with it — it will broaden your mind.\n\n"
    },
    {
      "time": " 22.Feb.2008 6.13am",
      "content": "smiling emoticon.\n\n ![](http://web.archive.org/web/20091213000205im_/http:/www.typophile.com/files/oneline_5321.png)\n\n"
    },
    {
      "time": " 22.Feb.2008 7.04am",
      "content": "_The Elements of Typographic Style._\n\nIt thins out the crop of first years.\n\n"
    },
    {
      "time": " 22.Feb.2008 7.28am",
      "content": "<cite>…“Indesign does it for you”…</cite>\n\nI told a friend of mine he needed to track out some big capitals a few days ago. He thought I was talking about optical kerning settings :(\n\n<cite>It thins out the crop of first years.</cite>\n\nDoes it really thin the herd, or does it just turn them into kids who blow off required type classes and will spend the rest of their lives using software defaults and system fonts?\n\n"
    },
    {
      "time": " 22.Feb.2008 8.49am",
      "content": "Regarding “First years”, books on typography have their place but the instructor has the major role to play in how the class is presented and what gets emphasis. The students also have a role to play in either their demise or their success in typography. If a student does not have the desire to learn and is trying to maximize their beer drinking time by ignoring their studies, then they deserve to be the chaff which the wind driveth away. I am an old fart and there just were not many typography books available in 1962 when I was a freshmen in design school. We did not have a text book. We were required to purchase the ATF specimen card stack. Everything else we learned from the instructors and by hand-setting metal type. The jobstick is a cruel, unrelenting teacher. I wish I had all the books now available as a youngster back then but I think we were a dedicated lot of kids who took our work seriously. Students today may also be dedicated and those are the ones who will succeed. The party-timers will pass with the same exhale as their last beer burp and evaporate.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Feb.2008 8.55am",
      "content": "FWIW, my first was _Stop Stealing Sheep_ followed rapidly by the Baines & Haslam. Unless you count stuff like _Hart’s Rules_. Bringhurst was a while later.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 22.Feb.2008 9.38am",
      "content": "Oh, what the hell.\n\n<cite>The Design of Books</cite> by Adrian Wilson. Then Tschichold’s <cite>The Form of the Book</cite>.\n\n"
    },
    {
      "time": " 22.Feb.2008 9.39am",
      "content": "Funny how these things oscillate. I went into design because of my fascination with computers, then ended up cranking an old letterpress!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20091213000205/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 22.Feb.2008 12.20pm",
      "content": "Tschichold, _The Form of the Book._\n\nThe fact that this was my first book on typography while Nick’s was Tschichold’s _Asymmetric Typography_ probably presages many agreements and disagreements.\n\n"
    }
  ]
}
