{
  "id": "42278",
  "title": "Ellipsis style",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello All,  \nI work at a magazine and we're discussing our use of the [ellipsis](http://web.archive.org/web/20150215224243/http:/typophile.com/wiki/ellipsis). Currently, we use period, full space, period, etc. and I find it makes me crazy. There's just way too much space. I suggested using period, thin space, period, etc. but a friend told me I should just use the glyph since that's what it's there for.\n\nWhat type of ellipsis are people using these days?\n\nThanks!\n\n",
  "author": "black currant",
  "time": "20 Feb 2008 — 8:23am",
  "uid": "9935",
  "comments": [
    {
      "time": "20 Feb 2008 — 8:24am",
      "content": "It makes me crazy too (period/space/period/space/etc) but that seems to be the standard in publishing. The other problem with it is line breaks, I often have to track it up to get all three periods on the same line. I vastly prefer the glyph but my editors won't go for it.\n\n"
    },
    {
      "time": "20 Feb 2008 — 8:29am",
      "content": "FWIW here's what Chicago has to say:\n\nQ. Our writing department uses Chicago’s style of putting spaces between the periods in ellipses. The graphic designers argue that in typesetting, the space is much smaller, and so use the ellipses character that is built into our publishing software. Who is correct?\n\nA. Everyone is correct. Chicago uses the spaces, but not everyone follows Chicago style. Someone in your department just needs to pick a style and stick with it. If you use the ellipsis character, make sure your typesetters know whether you want spaces between the dots.\n\n(of course the last sentence of the answer makes no sense - if you use the ellipsis character you can't put spaces btw the dots)\n\n"
    },
    {
      "time": "20 Feb 2008 — 8:30am",
      "content": "... period period period.\n\nno spaces, period.\n\n"
    },
    {
      "time": "20 Feb 2008 — 8:40am",
      "content": "...in which case you might as well use the ellipsis character. Except when you're using a monospace font, where it looks stooopid.\n\nFWIW, we use the unspaced version in our academic journals...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "20 Feb 2008 — 9:14am",
      "content": "I use the ellipsis character. If I didn’t, my editors would be very unkind.\n\n"
    },
    {
      "time": "20 Feb 2008 — 9:24am",
      "content": "I'm just about to go into a meeting about this with our editors. I think I will suggest using the glyph. The dot/thin space/dot might be too much for them. Oh God, then there's the problem of ellipsis ending in a period... .\n\n"
    },
    {
      "time": "20 Feb 2008 — 9:47am",
      "content": "black current:\n\nBe aware that there are multiple styles -- Associated Press has one style, Chicago another, Modern Language Association another . . .\n\nConsider this, too. If you use a fixed space between the points in (and perhaps around) an ellipsis, you have a character that takes up an em's worth of space or more, conjoined to a word that probably takes up several ems worth of space. You also remove those spaces within the ellipsis as \"justifying\" spaces in a line. Finally, many editors also don't want to have an ellipsis begin or end a line. All right, now if you follow all these purities (fixed spaces, no line breaks, etc.,) there are going to be times when, in setting justified copy, the few remaining justifying word spaces in a line are either have to be huge (loose line) or tiny (tight line), in order to set the line. I suppose if you are only setting 60 lines -- a brochure -- that can be worked around. If you are setting a book, 7,000 lines, that's a PITA with any author favoring ellipses . . .\n\nBTW, PattyFab, my old Chicago says to use a 3-to-the-em fixed space between the points. (13th ed, section 10.36). That's a honking big space -- bigger than a nominal justifying word space. We tried to make them see the error of that spec when we wrote the glossary; dunno if they made a change in later editions.\n\nCharles' favorite dictum: \"All editors, and all designers, would be better at their jobs if they had set type for a while.\"\n\n"
    },
    {
      "time": "20 Feb 2008 — 9:58am",
      "content": "I wish, when putting an ellipsis character after an actual period, that the spacing between the period and the first ellipsis dot matched the spacing between the ellipsis dots.\n\n"
    },
    {
      "time": "20 Feb 2008 — 10:01am",
      "content": "^ that's what the editors want! And with OpenType maybe we will see an ellipsis with period character.\n\n"
    },
    {
      "time": "20 Feb 2008 — 11:10am",
      "content": "Most editors are traditionalists and will prefer spaced periods. Most typographers consider this to be usually too much space.\n\nPeriods set tight are too tight. Looks miserly.\n\nI think that using the ellipsis character can have it's own problems. For one thing, the design (spacing) of the ellipsis character can vary greatly among designers/foundries. Some are too tight, some are too loose. Usually the spacing between ellipsis and period has not been taken into consideration.\n\nCharles mentioned the problems with justifying, and Patty mentioned the problem with line breaks. (Patty, I can't remember how I used to do it in Quark, but you can search out the sequence period-space-period-space-period and substitute non-breaking spaces. I think you might have to export the text as tagged text and use the code for the non-breaking space, then re-import. It's been a while.)\n\nAfter some consideration, the practice I've arrived at in my own type designs is to space the ellipsis periods with an interval equal to the space character -- this yields an ellipsis which is a little tighter than spaced periods because is leaves out the sidebearings from the period character, but is looser than unspaced periods.\n\nI then set the sidebearings on the ellipsis so that when set alongside a period, the space between the two is consistent with the internal spacing of the ellipsis (this yields sidebearings on the ellipsis that are wider than the period).\n\nWhile I do some pair-kerning with the period, I don't apply the kerning values to the ellipsis. So there's a subtle distinction between period-ellipsis and ellipsis-period sequences, which shows up in the spacing relationship with the surrounding characters. I feel these differences support the subtle distinctions in how/why an author might sequence the two in either fashion.\n\n-- K.\n\n"
    },
    {
      "time": "20 Feb 2008 — 11:34am",
      "content": "My 2 cents:\n\n\\*\\* If you use the ellipsis character with justifying spaces flanking, you will at times end up with huge word spaces throughout the line, and then those tiny spaces between the ellipsis points. Looks really stupid. In fact, it says to me \"the person who designed this layout or set this type . . . doesn't know how to make a line look good.\"\n\n\\*\\* I am not a strong believer that an ellipsis should not start a line. As a reader I find it no impediment to moving through the text. As a typographer, that little bit of open space does not look bad. Allowing a line to start with an ellipsis may also be a way to solve some other spacing problems.\n\n\\*\\* My preferred method is to use thin spaces within and flanking the ellipsis. If you have designed your text well, and used H&Js that will give you nice, tight word spaces, the thins won't be that much different from the justifying spaces. This is what Al Johnson at Phoenix Type here in Minnesota does when he sets type for me.\n\n\\*\\* If all typeface designers took the care with the ellipsis (and with other sorts) that Kent does we'd all be better off and be able to go home earlier. Few do, though.\n\n\\*\\* Don't let editors badger you about type . . . or ellipses. Teach them what looks good.\n\n\\*\\* I was going to use the ellipsis character in this post, to make a point (so to speak), but I don't know where it is. I guess I don't really care since I'll never use it.\n\npowers\n\n"
    },
    {
      "time": "20 Feb 2008 — 11:40am",
      "content": "If you use QUARK you can set up kerning pairs for multiple periods...\n\n<cite>** Don’t let editors badger you about type . . . or ellipses. Teach them what looks good.</cite>\n\nbut a lot of publishers have \"house style\" and aren't very flexible about it.\n\n"
    },
    {
      "time": "20 Feb 2008 — 11:45am",
      "content": "\\>\\> a lot of publishers have “house style” and aren’t very flexible about it.\n\nI know. I just can't stop myself from saying crap like that. Because I believe it. & I have taught some editors better style.\n\npowers\n\n"
    },
    {
      "time": "20 Feb 2008 — 12:06pm",
      "content": "The current (15th) edition of \"Chicago\" does not specify the amount of space to be put between ellipsis points. It just refers to \"three spaced periods.\" See 11.51 through 11.66. After that initial mention of \"three spaced periods\" they go on to refer to \"dots\" rather than periods.\n\nIn 14 they still specified those godawful 3-to-em spaces Charles mentioned. In 15 they got it right.\n\nTime marches on . . . and wounds all heels.\n\npowers\n\n"
    },
    {
      "time": "20 Feb 2008 — 12:12pm",
      "content": "Try no spaces with generous tracking.\n\n"
    },
    {
      "time": "20 Feb 2008 — 12:33pm",
      "content": "This is, I think, another typewriterism that plagues typesetters. On a typewriter, there is no ellipsis character, so you have the choice of three periods, or three periods separated by spaces. The former is too tight, the latter is better, but too wide. Because it is better, it becomes the standard.\n\nFifty years pass. Typewriters become extinct. Computer fonts do have ellipsis characters, but people who grew up with the typewriter spaced versions think they look too tight. It is like the second space after a period, which we are just now beginning to train typewriter-indocrinated people to omit.\n\nThe solution is simple. Use the character that a professional typeface designer created to look perfect with his or her font. If that character is wrong, then you probably have a poorly designed font.\n\n"
    },
    {
      "time": "20 Feb 2008 — 1:16pm",
      "content": "I just got out of the copy-related-design-elements meeting and we will be using the glyphs that come with our font. I had to argue it though. I also pushed for thin-space before and em-dash (instead of a full space) but that was a no-go (although, an editor said she agreed with me philosophically).\n\nI agree with you Don that people are extremely attached to these \"typewriterisms\". I still get stories full of double spaces before each sentence.\n\nThank you all for your comments!\n\n"
    },
    {
      "time": "20 Feb 2008 — 1:19pm",
      "content": "_I was going to use the ellipsis character in this post, to make a point (so to speak), but I don’t know where it is._\n\nOption-semicolon on my mac … FWIW\n\n"
    },
    {
      "time": "20 Feb 2008 — 1:48pm",
      "content": "<cite>Try no spaces with generous tracking.</cite>\n\nSo, only computer composition with application programs that support tracking can set \"good\" type? And you wonder why editor's tend not to listen to designers?\n\n"
    },
    {
      "time": "20 Feb 2008 — 2:36pm",
      "content": "_I wish, when putting an ellipsis character after an actual period, that the spacing between the period and the first ellipsis dot matched the spacing between the ellipsis dots._\n\nYour wish is granted.\n\n"
    },
    {
      "time": "20 Feb 2008 — 2:59pm",
      "content": "smackdown: … vs. ...  \nand the winner is... … !\n\n"
    },
    {
      "time": "20 Feb 2008 — 4:06pm",
      "content": "Isn't the traditional method for foundries to make the ellipsis em-width?  \nDoes that still have any merit?\n\n"
    },
    {
      "time": "20 Feb 2008 — 4:48pm",
      "content": "<cite> &gt; This is, I think, another typewriterism that plagues typesetters. On a typewriter, there is no ellipsis character, </cite>\n\nI'm sorry, but I don't buy this \"typewriterism\" theory. There was no ellipsis character in the foundry case or on the Linotype/Monotype keyboard either, back when the typewriter was commonplace. The ellipsis was always formed from periods and spaces. The difference was that the typesetter had a variety of spaces at his command. The \"typewriter-er\" did not.\n\nI don't think there existed a pre-composed ellipsis prior to digital type.\n\n<cite> &gt; Use the character that a professional typeface designer created to look perfect with his or her font. If that character is wrong, then you probably have a poorly designed font. </cite>\n\nI actually don't think most typeface designers create the ellipsis to look perfect with their fonts, since perfect (in the case of the ellipsis) is a function of the setting, not the typeface design.\n\nPersonally, I don't advocate the use of the pre-composed ellipsis for the reasons cited by Will and Charles. Given that it exists as part of the standard character set, I try to design it with care. But I don't use it myself.\n\n<cite> &gt; Isn’t the traditional method for foundries to make the ellipsis em-width?<br>\nDoes that still have any merit? </cite>\n\nFor all the reasons cited here, I think the em-width approach has no merit. I think this was another \"standard\" developed by early digital pioneers who weren't actually typesetters.\n\n-- K.\n\n"
    },
    {
      "time": "21 Feb 2008 — 6:45am",
      "content": "<cite>So, only computer composition with application programs that support tracking can set “good” type? And you wonder why editors tend not to listen to designers?</cite>\n\nNot at all what I was getting at. I was simply offering one solution that I prefer, like many of the other posters on this thread. No need to get unchuffed.\n\nTracking, by the way is not limited to computers, predated by letter-spacing, as I'm sure you know. : )\n\n"
    },
    {
      "time": "21 Feb 2008 — 7:40am",
      "content": "\\> Isn’t the traditional method for foundries to make the ellipsis em-width?  \nDoes that still have any merit?\n\nNo more than any other rule in typography that conflicts with the Golden Rule of Typography: It should look right!\n\n"
    },
    {
      "time": "21 Feb 2008 — 8:00am",
      "content": "_Isn’t the traditional method for foundries to make the ellipsis em-width?  \nDoes that still have any merit?_\n\nAccording to [Microsoft's character standards](http://web.archive.org/web/20150215224243/http:/www.microsoft.com/typography/developers/fdsspec/punc.htm), this is the correct way to fit this glyph. However, a quick check of the new CT fonts found that only 1 family actually followed this rule.\n\n"
    },
    {
      "time": "21 Feb 2008 — 4:21pm",
      "content": "I've found, in some cases, that the ellipsis character doesn't sit on the same baseline as the period.\n\nAnyway, given that a best case scenario would be to avoid the character and make each instance using the period and spaces, I find three basic possible configurations for the ellipsis glyph.\n\n ![](http://web.archive.org/web/20150215224243im_/http:/typophile.com/files/Example_3624.gif)\n\nWhat is most confusing is that in the current Chicago, it appears that the examples vary from what I'm showing above. Examples like number one above show a sentence space after the ellipsis. In examples like number two above there is a word space after the period. (11.63 & 11.64 for those following at home)\n\nI'm not a type designer, but it would seem there are uses for three separate characters, given that two would be identical save the side bearings.\n\n"
    },
    {
      "time": "21 Feb 2008 — 9:50pm",
      "content": "No one has mentioned Bringhurst's _Elements,_ which criticizes Chicago's method as being too open. Likewise, I agree with those who find the included ellipsis in fonts to be too tight; is it ok to have a character wider than the em in fonts? I currently use a macro that inserts a space, then a combination of 3 periods and 2 non-breaking spaces, all with character style having tighter tracking, and finally a normal space. This works for the fonts I use. The first line below uses this method; 2nd line is spaces and periods, 3rd is the font's built-in ellipsis with regular spaces.\n\n ![](http://web.archive.org/web/20150215224243im_/http:/typophile.com/files/ellipsis_3504.png)\n\n"
    },
    {
      "time": "22 Feb 2008 — 7:39am",
      "content": "I think many people work with editors who are more tuned to Chicago than Bringhurst.\n\nWhat would be lovely would be to pick out the collective intent of the mark, the difficult usage situations, and a proposal for a more automated and universal solution.\n\nIn the example I posted above I'm using the ellipsis mark from the font. What I don't get is what Chicago wants in terms of a space after a period or other sentence ending punctuation when combined with an ellipsis.\n\n"
    },
    {
      "time": "22 Feb 2008 — 8:21am",
      "content": "Editors don't know Bringhurst from Adam. They all use Chicago.\n\n"
    },
    {
      "time": "23 Feb 2008 — 4:04am",
      "content": "Most Adobe fonts were designed with the ellipsis on an em width, per Chicago. When I questioned the practice a while back, David Lemon told me that it allowed for the ellipsis to be used as a standardized dot leader in typesetting software. I'm not completely convinced this is still relevant today, but it might explain the history.\n\nWe've recently been talking about some possibilities for contextual processing to use it both for the dot leader function and as an actual ellipsis.\n\n\\> I often have to track it up to get all three periods on the same line.\n\nWhy not just format it with \"no break\"? Or is this a feature not present in your DTP software?\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "23 Feb 2008 — 6:52am",
      "content": "<cite>Editors don’t know Bringhurst from Adam. They all use Chicago.</cite>\n\nThose of us who cry ourselves to sleep after the daily dose of AP style wish it were so.\n\n"
    },
    {
      "time": "23 Feb 2008 — 7:26am",
      "content": "Thomas: <cite>Why not just format it with “no break”? Or is this a feature not present in your DTP software?</cite>\n\nIf you mean the \\*nobreak\\* space character, it is usually 500 units -- an en-space. Too big.\n\nBack when we were using TeX, we had a new customer who used Quark, and wanted an ellipsis with fixed space between the periods, rather than the justifying word space (my preference). But they had trouble specifying that fixed space. With TeX, we could define \\ellip{} to be anything (e.g., .\\hskip.02em{}.\\hskip.02em{}.). We set ellipses with about 30 different values for the horizontal skip, so they could pick a value. Faced with that level of choice, they just gave up & said \"set what you think looks good.\"\n\nVarying house style s not something the type designer should address. From my point of view, the ellipsis character is there only for those who don't really have an opinion.\n\nAs to Chicago Style, I've sat in too many meeting where the Chicago editors had to field complaints about \"Chicago style.\" Their answer, which seems perfectly appropriate to me, is that Chicago Style is the house style of the University of Chicago Press. Anyone who doesn't want to follow a particular part of it is free to do what they want. And while rare in practice, the University of Chicago Press does, on occasion, vary from their house style when it makes sense to do so. Formatting tables is one obvious place where the overall design of a book may require varying from the standard template & style. That some other editors take Chicago Style as revealed truth rather than a way to proceed when all other things are equal is not Chicago's problem.\n\nThe best answer is to think about what an ellipsis signals, and how this is best done within the rhythm of the text. It would be a copout to only look at what Bringhurst says, or Chicago says. Whatever you come up with will be a compromise, so pay attention to what you are willing to live with.\n\n"
    },
    {
      "time": "23 Feb 2008 — 7:56am",
      "content": "I haven't read every scrap of text on this thread but will offer my take on ellipsis for what it's worth.\n\n(1) To a type designer, ellipsis is a single, self-contained character, consisting of three dots **and no more than three dots**. For example, there is no such thing as an ellipsis made up of four dots. What are the bars like on a Euro? They're slashed from top right to bottom left. That's the standard for a Euro. What's the definition of an ellipsis? Three dots. That's all there is to it. Anything more and it's not an ellipsis.\n\n(2) The idea of breaking up the dots of an ellipsis over two lines is preposterous and inconcievable.\n\n(3) When I use ellipsis in typeset material (rarely) it goes at the end of a line or as close to the end of a line as possible. Usually I use an emdash instead of an ellipsis because ellipsis has become a typographic cliché thanks to the internet and message boards.\n\n(4) If my editor or other seniors question the way I use ellipsis, or the fact I've replaced it with an emdash I tell them emphatically \"It's just common sense. If you don't agree, sack me.\" Nobody has ever sacked me for it. I always get my way becaws it's very easy to demonstrate why breaking the thing up or putting it on the next line when it clearly belongs at the end of the previous line is the most utterly senseless thing you can do with an ellipsis.\n\n(5) This thread and most of its participants are firmly in the grip of Bringhurst and the Chicago Manual of Style. The rest of the world is not slave to such unimaginative and stifling typesetting manuals.\n\n(4) You don't put a period or a comma or any other form of dot-like punctuation after an ellipsis. What are you guys, nuts? An ellipsis is equivelant to a period. At the end of a sentence it indicates that the sentence continues. It's common sense that if the sentence continues, there is no need for a period, no earthly reason for putting one there. Replace the ellipsis with an emdash---now put a period after the emdash. No-no-no! Common sense. It doesn't belong there because the dash indicates the sentence continues. So why would you do that to an ellipsis? Doesn't make sense.\n\n(5) Breaking the ellipsis up over two lines by typing it manually with periods and spaces is like taking an emdash and breaking that across two lines, or breaking an ampersand over two lines. Inconcievable! That makes no sense to me at all. I know, I know, I've covered this point twice. I did that on purpose because _I'm having trouble believing_ that anyone calling themself a typographer, let alone a professional typographer or typesetter, would break an ellipsis over two lines for spacing reasons. Makes no sense to me at all and is the kind of boring pedantic act I would never contemplate.\n\nj a m e s\n\n"
    },
    {
      "time": "23 Feb 2008 — 8:04am",
      "content": "Breaking an ellipsis over to the next line? No that's nuts. Completely bonkers. I can't think of anything more counterintuitive. No way dude.\n\nj a m e s\n\n"
    },
    {
      "time": "23 Feb 2008 — 8:52am",
      "content": "Well James thanks for YOUR take on things but I work in book publishing where editors don't take too kindly to \"my way or the highway\". Chicago and Bringhurst are designed to set up common styles and conventions in typesetting that make it clear TO THE READER what is going on. If you want to reinvent punctuation, be my guest, but don't expect your readers to thank you. If you're designing a poster for a rock festival or a contemporary art exhibition, then sure, play around with punctuation, but if you're typesetting a novel for folks to read, creating your own punctuation styles will only confuse, distract, and annoy your readers (yeah, I used the serial comma there. That's in Chicago too; I don't like it but my editors insist on it).\n\nAn ellipsis has a VERY different function editorially than an em-dash. The function of an ellipsis is to indicate omission in cited text. Yes, it is used as well to indicate a pause or hesitation in thought or trailing off, but those are not its primary function. In those latter cases it could perhaps be replaced with another character. But in its primary function it must be used as is. It should NEVER be broken over two lines as you've said. And you are right that the punctuation (period, comma) should precede not follow it.\n\n"
    },
    {
      "time": "23 Feb 2008 — 9:18am",
      "content": "Consider the challenges of publishing a book of interviews. You have missing info, trailing off, and interuptions to conversation. These are subtle differences but they can be handled consistently and will give the reader insight into the nuances of the conversation that would otherwise be lost.\n\nWe need editors working with authors to handle this aspect of decision making.\n\nEvery style guide has rules for using ending puncuation with the ellipsis. It is the spacing associated with these situations that end up holding the information. See my post above.\n\n"
    },
    {
      "time": "23 Feb 2008 — 9:33am",
      "content": "Sorry if I ranted above, I just think that design that doesn't respect content is bad design. As an art director I encountered designers that refused to respect editorial concerns and that arrogance really got under my skin. It does a disservice to our profession.\n\n"
    },
    {
      "time": "23 Feb 2008 — 9:37am",
      "content": "I've assembled style guides before. The process of bringing 60 or so NY editors together in agreement on micro issues that are not covered by any style guide convinced me that most people, even professionals, do not know about the number of grey areas in grammar and punctuation.\n\nI think this is an area that warrants a good airing out, as dreadful as it gets.\n\n"
    },
    {
      "time": "23 Feb 2008 — 10:52am",
      "content": "_And you are right that the punctuation (period, comma) should precede not follow it._\n\nI would think that that would depend on the structure of the text that is being omitted. For example:\n\nORIGINAL:  \nThey talked about ellipsis style in the thread. As you can see, Craig added his opinion.\n\nPERIOD THEN ELLIPSIS:  \nThey talked about ellipsis style in the thread. … Craig added his opinion.\n\nELLIPSIS THEN PERIOD:  \nThey talked about ellipsis style … . As you can see, Craig added his opinion.\n\n(Note: spacing just to clarify the characters used - I'm already on record as wishing the spaces in any period-ellipsis combo would be equal.)\n\nThe four dots are logical and informative and should certainly be retained where appropriate. And a dash is something else entirely, I believe.\n\n"
    },
    {
      "time": "23 Feb 2008 — 11:31am",
      "content": "When I add ellipsi to fonts, I test them to see if they look nice and appropriate for the font. Fontlab will autogenerate an ellipsis but often it can look too tight. So, usually, I'll space the periods slightly further apart and pad the sidebearings a bit until it looks balanced.\n\nIs everyone cool with that strategy?\n\nIf you're scanning my old fonts for ellipsi, you'll see tight ones and Bringhurstian honkers so don't bother. I'm just talking about my current ellipsis strategy for text fonts.\n\n"
    },
    {
      "time": "23 Feb 2008 — 2:56pm",
      "content": "Why should the spacing between the dots in the ellipsis be equal to the space between the ellipsis and the period? It essentially means the reader has no way of telling if it should be read ... . or . ... (assuming they even notice there are four dots instead of three).\n\nPersonally, I don't see the need to use the period with the ellipsis anyway.\n\n<cite>Three dots ... anything more and it’s not an ellipsis.</cite>\n\nBut this depends on how much editorial freedom you have.\n\n"
    },
    {
      "time": "23 Feb 2008 — 6:50pm",
      "content": "_Why should the spacing between the dots in the ellipsis be equal to the space between the ellipsis and the period? It essentially means the reader has no way of telling if it should be read ... . or . ... (assuming they even notice there are four dots instead of three)._\n\nYou're right that it makes the parsing more difficult, so that's a pretty good point. But the space between the last word and the first dot should give it away: no space means the first dot's a period, space means it's the beginning of an ellipsis. As in jupiterboy's \"Granpa\" examples above, which also show different spacing after.\n\n"
    },
    {
      "time": "23 Feb 2008 — 8:15pm",
      "content": "I'm looking at a page on unicode space characters and still pondering:\n\n[http://en.wikipedia.org/wiki/Space\\_(punctuation)#Table\\_of\\_spaces](http://web.archive.org/web/20150215224243/http:/en.wikipedia.org/wiki/Space_(punctuation)#Table_of_spaces)\n\nEspecially the \"thin space,\" \"hair space,\" and \"narrow no-break space.\" However, in Word, none of these break.\n\nIn TNR, \"thin-space\" is the same width as \"narrow no-break space,\" and using combinations of these and periods may be a viable solution.\n\nPart of the problem is that there are so many ways to create the ellipses.\n\nInDesign has a character format setting that can specify \"do not break.\"\n\nLooking at eliason's post above, for PERIOD THEN ELLIPSIS it would seem allowable to allow a linebreak after the period/before the ellipsis, but for ELLIPSIS THEN PERIOD, to my eye, any line break at all doesn't work, including before the ellipsis.\n\nAlso there is a discrepancy (in response to Charles\\_E): in newer fonts, the non-breaking space is exactly the same width as the regular space, but in many \"older\" (in Internet years) fonts it is an en-space. The unicode definition calls for the nb space to be the same width as regular space.\n\nThe advantage of using some type of space rather than a precomposed glyph is that your paragraph composer (human or programmed) could squeeze or stretch the ellipsis along with the rest of the line.\n\nBut of course if there is no ellipsis in the font many will complain ...\n\n"
    },
    {
      "time": "24 Feb 2008 — 1:52am",
      "content": "<cite>You’re right that it makes the parsing more difficult, so that’s a pretty good point. But the space between the last word and the first dot should give it away: no space means the first dot’s a period, space means it’s the beginning of an ellipsis. As in jupiterboy’s “Granpa” examples above, which also show different spacing after.</cite>\n\nYes, but that assumes that as the reader you know what editorial convention the editor has used. I still think it is clearer to make the spacing between the ellipsis and any periods slightly bigger (or smaller) than the spacing between dots in the ellipsis (if you insist on using them at all). I prefer to simply use the ellipsis character, even if I am connecting parts of a quote that ran over two sentences. I think the alternative can be at best ugly, and at worst confusing for the reader.\n\n"
    },
    {
      "time": "24 Feb 2008 — 7:00am",
      "content": "I'm sure many of you don't like all the characters in the Latin alphabet. They make kerning hard, and some of them are downright ugly. Plus, the Latin alphabet is archaic. Why don't we just make a new one, with characters better suited to our tastes?\n\n"
    },
    {
      "time": "24 Feb 2008 — 7:58am",
      "content": "Now that we have teams we can clarify a few points.\n\n1.) Chicago does have a simple three dot only ellipsis method, which is appropriate for many projects.\n\n2.) Quoted interviews and legal language often require a level of parsing that a simple style can't cover. I suspect some people may not have ever set text like this.\n\n3.) Chicago may have not set their own book with the best examples of spacing, which clouds and confuses the ideas.\n\n4.) Fonts built with an ellipsis character that works in harmony (equal interior spaces) with ending punctuation offer those without the software and those in search of an automated approach a good option. (See \"Granpa\" lol example above.)\n\n5.) Variance in spacing could potentially add clarity, but this is specifically not the rule and editors won't tolerate looking like dunces to indulge a designer's personal sense of aesthetics.\n\n"
    },
    {
      "time": "25 Feb 2008 — 3:00pm",
      "content": "If well designed, I prefer the precomposed ellipsis personally.\n\nFor editorial style, it's still not uncommon to see the ellipsis placed in brackets for quotes, especially when the source text might include ellipses (and often times italicised):\n\nOriginal text: So… I went down to the big blue store.  \nQuoted: “So… I went down to the […] store”.\n\nThis often comes up in quoting poetry.\n\nIf the distinction between period-ellipsis, and ellipsis-period is critical to the discussion of a text, I think most article authors would prefer to split the quotation even if it's as simple as “and later states”:\n\nOriginal text: Alabama is in the Deep South. Long ago, the North invaded the South because the South broke away desiring stronger state’s rights.  \nArticle text: Matthew notes that “Alabama is in the Deep South”, and adds that the Northern Invasion, where “the North invaded the South” happened in 1861.\n\nNote that even in this case the punctuation is ambiguous, because I would still quote it as “Alabama is in the Deep South” + comma even if the original sentence were “Alabama is in the Deep South of the United States of America.”\n\nSo, I don't think it’s a huge issue being able to distinguish the order in a period-ellipsis or ellipsis-period combination. I do feel it’s important that they can be connected with no visual break between the four dots.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "25 Feb 2008 — 4:51pm",
      "content": "<cite>So, I don’t think it’s a huge issue being able to distinguish the order in a period-ellipsis or ellipsis-period combination. I do feel it’s important that they can be connected with no visual break between the four dots.</cite>\n\nIt is in an extended interview format that it gets tricky. Add to this a heavy name, and you must attempt to get these details right because the work will be quoted.\n\nHere are two examples that come to mind.\n\n[http://www.stoutbooks.com/cgi-bin/stoutbooks.cgi/76420.html](http://web.archive.org/web/20150215224243/http:/www.stoutbooks.com/cgi-bin/stoutbooks.cgi/76420.html \"http://www.stoutbooks.com/cgi-bin/stoutbooks.cgi/76420.html\")\n\n[http://news.artlimited.net/news\\_display.php?id=432813&lg=en](http://web.archive.org/web/20150215224243/http:/news.artlimited.net/news_display.php?id=432813&lg=en \"http://news.artlimited.net/news\\_display.php?id=432813&lg=en\")\n\nBoth have extended exerpted sections that employ the full range of possible combinations.\n\n"
    },
    {
      "time": "26 Feb 2008 — 4:28am",
      "content": "Patty: _Well James thanks for YOUR take on things but I work in book publishing where editors don’t take too kindly to “my way or the highway”. Chicago and Bringhurst are designed to set up common styles and conventions in typesetting that make it clear TO THE READER what is going on. If you want to reinvent punctuation, be my guest, but don’t expect your readers to thank you._\n\nI have never sought to reinvent punctuation, only to keep it simple. Why do you assume bad faith regarding my methods (why else would you type in capitals)? The way I handle ellipsis is aimed at making it clear to the reader what is going on in a text.\n\n_...if you’re typesetting a novel for folks to read, creating your own punctuation styles will only confuse, distract, and annoy your readers._\n\nI've not done novels or story anthologies, but for jobs where I've set prose fiction including dialog with ellipses and emdashes I quizz readers about the clarity of the typesetting. It turns out very few readers are even aware of any difference between ellipsis and emdash. For dialog the two marks have much the same effect and meaning as far as readers can tell.\n\n_An ellipsis has a VERY different function editorially than an em-dash. The function of an ellipsis is to indicate omission in cited text. Yes, it is used as well to indicate a pause or hesitation in thought or trailing off, but those are not its primary function. In those latter cases it could perhaps be replaced with another character. But in its primary function it must be used as is._\n\nWhy is ellipsis only supposed to be used to indicate omission in cited text? What about omission in other kinds of text? And if that's the editorial function of an ellipse, please define the editorial function of an emdash.\n\ncharles\\_e: _I’m sure many of you don’t like all the characters in the Latin alphabet. They make kerning hard, and some of them are downright ugly. Plus, the Latin alphabet is archaic. Why don’t we just make a new one, with characters better suited to our tastes?_\n\nI love all of the characters in the Latin alphabet. It could be improved a great deal however, if only the world would allow type designers to do so.\n\nj a m e s\n\n"
    }
  ]
}
