{
  "id": "42282",
  "title": "Multichoice.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My Editor explains to me (in response to my suggestion that Freight Micro is not designed to be used so big, as it looks a bit weird and lumpy and maybe we should consider looking for something else) that ’It may look wrong from a type person point of you, but the readers aren’t going to notice are they? I don’t think it looks bad. It’s all about opinions, everyone has got an opinion’\n\nDo I respond;\n\na)Incredulously.  \n’You’re kidding me. You seriously can’t see how strange and lumpy that looks.’\n\nb)Carefully.  \n’I know they may not notice it and write a letter in complaining, but they will subconsciously react.’\n\nc)Insultingly.  \n’You don’t know what the hell you’re talking about. What makes you think you know about these things? Do I tell you how to edit?!!’\n\nd)Melodramatically.  \n’I quit. You don’t value my opinion. You don’t deserve me’\n\ne)Other.  \n’\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_’\n\n(ps. If I come across as arrogant I don’t reckon my skills THAT much, I just find it a little frustrating that they don’t really listen to me)\n\nPlease advise,\n\nThanks  \nG T\n\n [‹ need a typographic organiser (agenda)... needs...wants...](http://web.archive.org/web/20080706084847/http:/www.typophile.com/node/42277 \"Go to previous forum topic\") [Time Zones and Typophile ›](http://web.archive.org/web/20080706084847/http:/www.typophile.com/node/42289 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706084847/http://www.typophile.com/user/11280\" title=\"View user profile.\">G T</a>",
  "time": "<br>",
  "uid": "11280",
  "comments": [
    {
      "time": " 20.Feb.2008 11.55am",
      "content": "This is a good question. No, you’re not coming across as arrogant, you just care about your type and wish to handle the situation with tact.\n\nMy gut reaction says a combination of **a** and **b** , with the weight on **b**.\n\nBut, what will support your defense? Are many of your readers the kind who will notice or care? Etc...\n\nGood luck, and keep us posted!\n\n"
    },
    {
      "time": " 20.Feb.2008 11.57am",
      "content": "By the way, what’s your editor doing with Freight Micro, anyway? : )\n\n"
    },
    {
      "time": " 20.Feb.2008 12.07pm",
      "content": "e. Then why the f\\*\\*k did you hire a graphic designer if none of this matters!?\n\nIn all honesty, my response to this sort of reaction is typically something along the lines of:\n\n“To someone trained to catch these things, it’s a glaring error. (this is good because it implies that other professionals will judge the publication) To the reader, it will not be a glaring error, but doing it the right way will feel better to their eyes and invite their attention. Typesetting is not about making a few big decisions, it’s about making many tiny decisions that are then repeated hundreds or thousands of times, and that’s why I nitpick. If I didn’t, I wouldn’t be a very good designer and the the production value of the work would decline. (Then, I summarize with something snappy they can repeat to other people to sound good when defending their decision to let me do my job.) It’s the difference between a steak at a diner and a steak at a fine restaurant. They’re both cow on a plate, but the attention to the details collectively makes the difference.”\n\nGood luck.\n\n"
    },
    {
      "time": " 20.Feb.2008 12.11pm",
      "content": "e.) That is sooo true! My dog loves to eat cat shit. Who am I to bring her down with my anthropocentric tastes. But should I feed it to her? There’s the question.\n\n"
    },
    {
      "time": " 20.Feb.2008 12.14pm",
      "content": "rugen nailed it, but be careful and even indirectly flattering. appeal to his good sense in having a designer, and appeal to his wisdom in letting a designer do the designing. sounds manipulative, i know, but sometimes you have to kill them with kindness.\n\n"
    },
    {
      "time": " 20.Feb.2008 1.12pm",
      "content": "I’d say both you and your editor are correct.\n\n"
    },
    {
      "time": " 20.Feb.2008 9.27pm",
      "content": "I.E., Freight Micro\n\nE)Consider that he might be correct, and educate both yourself and your editor on your findings. It is almost always easier or faster to _show_ somebody why something does or does not work rather than insist on arguing. In a good design, the results are obvious. Who knows, maybe he’s right? Or maybe he just hasn’t seen what you’re talking about with his own eyes.\n\nBesides, some professional art directors intentionally choose to use the micro size types like Freight Micro and Bell Centennial, just because they _are_ slightly unusual, and thus, eye catching.\n\n"
    },
    {
      "time": " 20.Feb.2008 10.03pm",
      "content": "FWIW, I believe Wired magazine in the U.S. used Freight Micro as body copy for some feature-length stories before their redesign last year.\n\nYou’ll have to take my word for it, but the body copy in “Heroes of Color” is Freight Micro. And I realize this isn’t a long story, but it was the first example I could find on the interwebs.\n\n[http://www.teshkeelcomics.com/contn/wired002.jpg](http://web.archive.org/web/20080706084847/http:/www.teshkeelcomics.com/contn/wired002.jpg \"http://www.teshkeelcomics.com/contn/wired002.jpg\")\n\n"
    },
    {
      "time": " 21.Feb.2008 2.27am",
      "content": "Thanks everyone.\n\nJust to clarify, I haven’t got a problem with us using freight micro for body copy. It works wonderfully for this, but I’m just not sure about using it for display.\n\nI’m probably gonna find a few examples to demonstrate how they would be better. One of the problems is that my editor bypassed myself and my art director in getting the redesign of our magazine farmed out to some guy. We didn’t see any of it until it was all OK’d by everyone who had to OK it. I think that my editor thinks we may be objecting to the font out of bitterness (which is probably partly responsible) but also we just don’t think it works. I also think that he has taken it as a personal affront because in a way its his design, or at least he commissioned it.\n\nAnother problem lies in the fact that both he and the deputy editor reckon their design knowledge quite a lot. I do respect his opinion, and often he makes excellent suggestions, but it is sometimes hard to get him to see what I see as sense.\n\nOh well, I will tread cautiously…\n\nThanks again. I’ll keep yar updated\n\nG\n\n"
    }
  ]
}
