{
  "id": "42363",
  "title": "The future of Cyrillics.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "There is a discussion going on between Russian type designers over the future of Cyrillics. The main question, is weather the alphabet should continue on it’s 300 year journey of forced latinization (launched by Peter I) which so far has failed to produce a result comparable to the perfection of the Latin form, or step back to it’s scribal roots and branch off in a fit of free-form evolution to become it’s own thing. The problem, is that there simply isn’t enought variety between the letterforms right now, with miniscules being near copies of majuscules, and letters like ШЩЧЦ sticking out like sharpened rakes. What do you guys think?\n\n [‹ CID (Identity-H) encoded fonts in PDF](http://web.archive.org/web/20080706222235/http:/www.typophile.com/node/43259 \"Go to previous forum topic\") [Famous Quotes from Type Designers ›](http://web.archive.org/web/20080706222235/http:/www.typophile.com/node/13406 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706222235/http://www.typophile.com/user/23991\" title=\"View user profile.\">oprion</a>",
  "time": "<br>",
  "uid": "23991",
  "comments": [
    {
      "time": " 22.Feb.2008 10.49am",
      "content": "It’s really hard for me to say, not speaking any Cyrillic languages. What do they plan to replace it with? The Latin alphabet?\n\n"
    },
    {
      "time": " 22.Feb.2008 11.03am",
      "content": "\\> There is a discussion going on between Russian type designers\n\nWhere? who?\n\n"
    },
    {
      "time": " 22.Feb.2008 11.27am",
      "content": "Those miniscules are vexing me too. And the kerning.  \nThere are a handful of the Cyrillic miniscules that have forms close enough to Latin lower case that the Latin form is often inserted directly in fonts that have both character sets, but is this right, or do they need further adaptation?\n\nOh so much to discuss.\n\n"
    },
    {
      "time": " 22.Feb.2008 11.49am",
      "content": "I echo David’s question: Where is this discussion taking place?\n\n300 years is a long period for even an awkward, latinized Cyrillic to gain momentum. Is there any official talk of [re-]reform, or is this just a conversation between type designers? A few type designers are not going to force a revival of historic forms in general use, much as we might all appreciate them. A more complete cultural campaign could do it, but these days there aren’t many people like Peter I around to dictate such sweeping changes.\n\n"
    },
    {
      "time": " 22.Feb.2008 12.13pm",
      "content": "The trouble with the idea of ’going back to the scribal roots’ of Cyrillic, if one of the concerns with the modern script is the similarity of miniscules to majuscules, is that the reason for that similarity _is_ the scribal tradition. Prior to the Petrine reform, the Cyrillic script was essentially unicameral or uncial, with very little case differentiation per se, only letters written larger or smaller depending on context. The process by which the Latin and Greek scripts developed bicameral alphabets never really happened in Cyrillic prior to the typographic period. What is that process? It is the gradual development of a relatively quickly written formal uncial that becomes the miniscule to a re-imported classical style that becomes the majuscule. And the context of the process is scribal book production. If you look for the parallel Cyrillic context, you find small and large letters both derived from the same uncial forms: the process has not had time to evolve a more independent formal miniscule, and there is no convenient classical style to provide a model for distinct majuscules.\n\nPost-Petrine Cyrillic handwriting, on the other hand, has developed greater distinction between miniscules and majuscules, so might suggest a new directions in text type design. However, many of these distinctions are evolved from cursive speed, i.e. they are essentially ’italic’, and existing attempts to adapt them to upright forms look awkward to me.\n\n"
    },
    {
      "time": " 22.Feb.2008 2.24pm",
      "content": "Maybe this has something to do with something:\n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/2022796_5192.jpg)\n\nMore like that over [here.](http://web.archive.org/web/20080706222235/http:/www.hiero.ru/2022796)\n\n"
    },
    {
      "time": " 22.Feb.2008 2.35pm",
      "content": "The discussion is quite sporadic and unofficial. Held mostly on LifeJournal, in different designer [articles](http://web.archive.org/web/20080706222235/http:/eldesign.ru/sreda/2007/0131/) and occasionally referenced in [books](http://web.archive.org/web/20080706222235/http:/www.artlebedev.com/everything/izdal/kniga_pro_bykvy/).\n\nThe basic argument, is that the only way to really match the perfection of Latin forms, is to adopt Latin. Alternatively, the letters should move away in it’s own direction, and develop a unique aesthetic. Otherwise, it is often feared, that Cyrillic might remain second-best. This is certainly speculative and non-realistic, and there are neither the means nor the will to attempts these reforms. After all, some of us still lament the loss of ѣ (among others).\n\nI am merely trying to decide, what would hypothetically constitute the best course of action in an ideal world.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080706222235/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 22.Feb.2008 2.44pm",
      "content": "What makes the Latin alphabet so perfect that Cyrillic designers would want to emulate it more than they already do? From a graphic standpoint, Unified Canadian Aboriginal has a lot more going for it.\n\n"
    },
    {
      "time": " 22.Feb.2008 2.52pm",
      "content": "“What makes the Latin alphabet so perfect that Cyrillic designers would want to emulate it more than they already do?” -The fact that it’s already quite close to it, and thus gets constantly compared and judged against.\n\nHey! What a great lubok!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080706222235/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 22.Feb.2008 2.52pm",
      "content": "John’s perspective sounds very convincing to me but I would like to see examples of your ideas just the same.\n\n"
    },
    {
      "time": " 22.Feb.2008 2.55pm",
      "content": "As quirky as Cyrillic is now and as laborious it is to kern, I don’t see a need to either return to older forms or adopt Latin script as the Czechs have done. Three hundred years of use has made it pretty ingrained by now and why confuse all current users even more. It isn’t an issue of whether Latin or Greek or Korean script is better, people just will resist change as readers.  \nFor me, Cyrillic has its own charm and should be kept. I like the way it looks even if it is more difficult to design than Latin. That is the type designers problem and we can deal with it. Let’s not make it the reader’s problem just so we can tidy it up and save ourselves some work.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Feb.2008 2.57pm",
      "content": "_the perfection of the Latin form_\n\n? The Latin script is not without problems.\n\nSequences with vertical stems are dodgy: so you can get some words, like, er, Cyrillic, which go all op art in the middle, and loosey-goosey elsewhere, I mean, just how much kerning should there be in C-y?\n\nAnd in many genres, (especially bold and condensed) diagonal lines are awkward—not a problem for Cyrillic!  \nAs an aside, don’t those Constructivist-era posters look great with all their bold condensed rectilinear letterforms!\n\nAlso, Latin scripts require much more kerning than Cyrillic (or Greek), on account of the diagonals.  \n(Although Ge and Che, and Gamma, can be nasty.)\n\nI would say Cyrillic type designers should continue to be inventive in adapting what they have, just as Latin type designers have added a tail to lower case “l” and “i”, in sans fonts, and employed the italic (monocular) form of “g” in types like Helvetica.\n\nRecently, Greek type designers, with the “flipped h” form of lambda, have innovated to address the question of “problematic diagonals”.  \nI believe this was the same impetus that, over time, caused the triangular Cyrillic “De” to evolve to its present squarish shape.\n\nThe role of the gatekeepers (Maxim and Gerry, you know I’m talkin’ bout you!) in recent years has been interesting — it’s led to a lot of Cyrillic fonts produced by Western foundries, types that are “correct” but extremely conservative.\n\nAlphabet reform has always been protracted and political, and given the vast number of players today, looks to be evoltionary from now on, rather than decisive.\n\n\\*\\*\\*\n\nIf you are holding out the Latin form as being \\*better\\* than Cyrillic, take a look at the Bulgarian initiative — IMO, and as someone who has designed both serif and sans fonts to the Bulgarian spec, this Latinized Cyrillic is far from ideal, too “blobby”.\n\nOf the various Cyrillic languages, Russian is the one with the fewest ascenders, descenders, and floating diacritics.  \nIf Latin script is held out as exemplary, Bosnian and Serbian produce much better-looking continuous “normal” text than Russian.\n\nIn fact, this seems to be more of an issue with Russian, rather than Cyrillic per se.\n\n"
    },
    {
      "time": " 22.Feb.2008 3.09pm",
      "content": "“I don’t see a need to either return to older forms or adopt Latin script as the Czechs have done.”\n\nAbandoning it is certainly not an option, it would be a chore, and simply drown in ugly diacritics. The current alphabet is quite nifty in replicating the phonetic language with it’s one letter per sound routine, so it has to stay. Nor, is it prudent to subject the folks to learn a whole new glyph forms (the number of people who read books is falling already.) But letter styles do evolve over time, and I feel there is still some room for Cyrillic to grow. I am merely trying to imagine a possible direction for that growth.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080706222235/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 22.Feb.2008 3.14pm",
      "content": "Perhaps I misunderstood your original question. I thought you were talking about adopting a different script, not just evolving Cyrillic into something better. Latin has been eveolving for centuries albeit slowly. Cyrillic has had fewer centuries to evolve but it has to some degree includint dumping the yat. There will always be those who disagree with whatever change is made so acceptance is slow to come.\n\nChrisL\n\n"
    },
    {
      "time": " 23.Feb.2008 1.20am",
      "content": "_gatekeepers_\n\nSorry, not the right word.  \nI took a seminar on Cyrillics from Maxim, and he was more of an door-opener, generous in sharing his knowledge, and very open-minded about design possibilities!\n\nBut here’s what I mean;  \nIf western attempts at Greek and Cyrillic typefaces were occasionally “innovative” through a lack of knowledge, now it’s more likely they’ll be well-informed but careful not to put a foot wrong.\n\nI wonder what Cyrillic readers think of western typefaces that make “mistakes”? Do they just look ignorant, or can they be useful?\n\nAnd what is the opinion of Robert Slimbach’s invention of Cyrillic pseudo-Renaissance calligraphic forms in Arno?\n\n"
    },
    {
      "time": " 23.Feb.2008 6.39am",
      "content": "_I wonder what Cyrillic readers think of western typefaces that make “mistakes”? Do they just look ignorant, or can they be useful?_\n\ni think it depends on whom you talk to. with a recent project of mine that included cyrillics, several of the “old school” russian camp took objection to some of my design decisions and some younger designers outside of russia found the same design to be well put together and perfectly acceptable.\n\n"
    },
    {
      "time": " 23.Feb.2008 7.49am",
      "content": "What sort of specific design issues are at play? I can only speak from my own experience and imagination, which are limited and outside any linguistic context respectively, so I would like to know a bit more about what I’m dealing with before I start slinging ideas around.\n\n"
    },
    {
      "time": " 23.Feb.2008 10.27am",
      "content": "Looking at the glyphs you can quickly get a basic idea though. Obviously it cannot help but be naive if you are not a reader/speaker; but on the other hand I think if you have an eye you can start to see things. Optical issues are optical issues.\n\nI will have to see the “pseudo-Renaissance” - that sounds interesting/fun/funny.\n\nThis is perhaps an especially silly idea but I wonder if the constructed/techy/wipeout/designers republic approach to latin might better be used with Cyrilic.\n\nPerhaps even more silly, I also what a Chinese/ Japanese approach would yield if only because Chinese as it began was almost geometric and certainly mono-line. And it was a bit unlovely IMHO. The brush forms work way better because the tell tale features of the tool offer, as Peter Enneson might say: ’salient features’.\n\n"
    },
    {
      "time": " 23.Feb.2008 10.47am",
      "content": "_Optical issues are optical issues._\n\nYes, and getting relative proportion and weight right in Cyrillic is more demanding than in Latin because of the repetition of similar but not identical shapes. But the biggest problem that designers have when they start working with an unfamiliar script is lack of understanding of idioms. They see various shapes in various typefaces, and they quickly assume that these represent permissable or available forms without understanding their specific contexts. So they mix and match forms from different idioms. Imagine a designer with no prior experience working with the Latin script looking at specimens and deciding that he likes the shape of the y in Bodoni, and the shape of the a in Granjon and the little flourish on the p in Gill Sans Italic, and then incorporating these shapes or details into a single typeface, not understanding that they are particular to certain styles or idioms of the Latin script.\n\nOf the many things I have learned from working with Maxim over the past decade, the most important has been this: to see and understand the idioms of Cyrillic type. And the benefit I have drawn from this is confidence in making design decisions.\n\n"
    },
    {
      "time": " 23.Feb.2008 11.08am",
      "content": "I think this would make a fantastic topic for this year’s ATypI conference in St Petersburg, wouldn’t it? :)\n\nA.\n\n"
    },
    {
      "time": " 23.Feb.2008 11.45am",
      "content": "“I wonder what Cyrillic readers think of western typefaces that make “mistakes”? Do they just look ignorant, or can they be useful?”\n\nHere are some of the more common mistakes that peeve me a little in western attempts to render Cyrillic. Luckily the trend seems to have stopped now for the most part, and the new typefaces that are coming out do a splendid job differentiating between the letterforms.\n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/CYR_3807.gif)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080706222235/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    },
    {
      "time": " 23.Feb.2008 1.25pm",
      "content": "John, interesting post. This is actually what i was trying to get at with this controversial thread now titled [Appropriate alternates or an anachronism](http://web.archive.org/web/20080706222235/http:/www.typophile.com/node/38787). Even with your example, i think that a skilled type designer could make all the quirky things you listed work. I think this approach you describe, taking design elements of design from disparate traditions, is what Juliet Shen means when she speaks of [“Yankee eclecticism,”](http://web.archive.org/web/20080706222235/http:/www.typophile.com/node/39662#comment-243781) and we’ve been doing it in America for our entire history of type.  \nI think my eclectic approach is what caused the rift between Slavic type traditions in respect to the Cyrillic I created for Underground. In particular, the old school objected to my choice of the trapezoidal shape of Д and Л for a humanist sans, where tradition dictates that the rectangular shape should be used and that for Ж and К the opposing arms top-to-bottom should be opposites of dynamic/static forms where mine are static (straight strokes) everywhere. It seems that these traditions were cultivated within Russia, as other Slavic designers are not as aware of them. Some younger designers object to these hard-and-fast rules, recognizing these directives as fabricated traditions.\n\nMy impression (and I haven’t studied this out extensively) is that there is a greater divergence of letterforms found acceptable in display types and lettering (as is true with Latin as well) and I wonder if some of these could be incorporated into the body of acceptable typographic forms. I sense that many designers from outside Russian and some designers within Russia have begun to push the boundaries of what is acceptable. Some new innovations will be found acceptable while most will be rejected. I’m not sure that a return to scribal forms would be accepted after 300 years of reading a more latinized azbuka, but try it and see if it works.\n\n"
    },
    {
      "time": " 24.Feb.2008 11.46pm",
      "content": "Ivan, could you explain what you think the mistakes are in the image you posted? Do you think none of the forms in the left column are suitable for Cyrillic?\n\n"
    },
    {
      "time": " 25.Feb.2008 12.30am",
      "content": "Ivan’s images:\n\nThe top right is the Bulgarian version.\n\nThe middle right is missing a serif, although if the rest of the typeface were similarly depleted, it might be a concept—it certainly seems to go with Zapf’s “y”s, which posed a problem for his plagiarists, who thought he’d made a mistake, and put the serifs back on, but he hadn’t, because he’s German, not Russian, so he’s allowed to do that! :-)\n\nThe bottom right is an Asian Cyrillic form, used in e.g. Mongolian and Kazakh as well as the one centre left, so both are needed for a full set of Cyrillic characters.\n\n"
    },
    {
      "time": " 25.Feb.2008 2.14am",
      "content": "twardoch : ...fantastic topic for this year’s ATypI conference in St Petersburg...\n\nAbsolutely, with the slogan “300 years of disgrace and you’re in Unicode” ;)))\n\nUpdated with picture:\n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/300_years_4814.gif)\n\n"
    },
    {
      "time": " 25.Feb.2008 4.10am",
      "content": "Dear Oprion, your question sounds to me like:  \nHave germans continue latinization of german alphabet launched by Martin Bormann, or go back to it’s scribal roots (Textura, Swabacher, Fractura)?\n\n"
    },
    {
      "time": " 25.Feb.2008 6.12am",
      "content": "Ivan,\n\n“Abandoning it is certainly not an option, it would be a chore, and simply drown in ugly diacritics.”\n\nDiacritics are beautiful.\n\n“The current alphabet is quite nifty in replicating the phonetic language with it’s one letter per sound routine, so it has to stay.”\n\nYou might be a type designer, but you have no idea of linguistics. Actually, Russian orthography is anything but one letter per sound. Actually, it is not only utterly bad at replicating the phonemes (the Cyrillic letter о stand for at least three different phonetic realisations in Russian; хорошо — the first two sound definitly unlike the last) on a stipulated by you one-to-one basis, but it even \\_breaks\\_the\\_phonemes\\_boundaries\\_ in written form (I mean the yotated vowel signs. лук and люк both end in -/uk/ but start with a different sound /ɫ/- vs. /lʲ/-).\n\nDon’t misunderstand though. I really don’t care, just wanted to put you right, as orthographies clearly don’t have to be one-to-one phonetic mappings to work. Good example is English. It’s all just convention, and as long as everyone sticks to it, it works out, guys, don’t forget that!\n\nBy the way, that’s the exact reason, why I don’t believe either a script transition (to Latin) nor a glyph design transition (to historic scribal tradition inspired cyrillic) will be successful. The reader-base is too big. Don’t forget, why Peter I’s “writing reform” was so successful: a) he was RULING (even though some might be tempted challenge this, Russia today is no dictatorship), b) there was a small reader-base. I.e. relatively little number of people were reading and writing yet (at least except for the clergy, but we are talking about civil society now; remember, Peter’s type style is still called “civil type” to differentiate from the scribal one). Now, it’s more than 100 million, c) there was a major technological transition. Comparably little was printed in cyrillic in Russian previously. (btw. the Peterian cyrillic form only comparatively late “spread back” to Rumanian (they used cyrillic pretty long), Bulgarian and Serbian printing tradition.\n\n"
    },
    {
      "time": " 25.Feb.2008 10.18pm",
      "content": "It has been said that Cyrillic lacks sufficient ascenders and descenders, particularly evident among the miniscules. Some of the letters have, not knowing the proper term, drop-serifs that go below the base line; de has two and a few others have one. In helping the letters evolve, would anyone appreciate those drop-serifs morphing into “proper” descenders and if so what shape should they take?\n\n"
    },
    {
      "time": " 25.Feb.2008 11.00pm",
      "content": "Nick:_The middle right is missing a serif, although if the rest of the typeface were similarly depleted, it might be a concept—..._\n\nNo, the problem with this ’letter’ is that it is just a Latin N flipped, so the stroke weights are all wrong for the Cyrillic I. Likewise the ka and U forms on the right are misused Latin forms. The ascending ka is the least problematic of them, since this form is found in some styles (not only in Bulgarian) but not typically in text faces.\n\n"
    },
    {
      "time": " 25.Feb.2008 11.16pm",
      "content": "Jason, what you call ’drop-serifs’ take a variety of different forms in Cyrillic types and lettering (spikes, flourishes, wavy shapes, inverted spikes). The form to which you refer I usually call ’spikes’, in part to differentiate them from serif-like terminals, because they need to be much longer and heavier than serifs. This is one of the most common problems with people’s first attempts at Cyrillic type design: they make these descenders much too small. This is so much that case the my advice to designers is to deliberately make these descenders too big, obviously too big, and then reduce them in size gradually until they don’t look too big any more. It is better for them to be almost too big than for them to be too small.\n\n"
    },
    {
      "time": " 26.Feb.2008 4.06am",
      "content": "_No, the problem with this ’letter’ is that it is just a Latin N flipped, so the stroke weights are all wrong for the Cyrillic I. Likewise the ka and U forms on the right are misused Latin forms._\n\nI’m not interested in the fact that these are obviously Latinized forms.  \nThey are nonetheless viable in Cyrillic typefaces, although the reversed contrast of the bad “I” which you draw attention could be difficult—but if other characters were given a similar contrary stress in a purposeful manner, why not? I’ve designed Latin faces with that kind of feature, “flipp’ed-ness”. But, so far, nothing Cyrillicized.\n\n"
    },
    {
      "time": " 26.Feb.2008 6.12am",
      "content": "nice to hear from en-US speakers about feature of uk-UA 8))) or ru-RU  \nI think You people have to assign such topics directly to cyrillic professionals  \n———————————-  \nАндрій Поданенко  \nweb: [http://my.ukrweb.info](http://web.archive.org/web/20080706222235/http:/my.ukrweb.info/ \"http://my.ukrweb.info\")\n\n"
    },
    {
      "time": " 26.Feb.2008 8.53am",
      "content": "There is a certain liberty in lettering outside one’s native context. It’s surprising what one can accomplish when one doesn’t know what one can’t do. That said, I’m just trying to get a little educated here, so as to not be operating from _pure_ ignorance.\n\n"
    },
    {
      "time": " 26.Feb.2008 10.04am",
      "content": "\\>I think You people\n\nThose “Ugly Americans” John Hudson and Nick Shinn!\n\n\\>have to assign such topics directly to cyrillic professionals\n\nDo they have the power to change things? Isn’t it the case that most Cyrillic text is rendered or printed in type designed by Matthew Carter or an anonymous foundry person working for Linotype or Monotype? Or are “Cyrillic professionals” contributing to the mainstream?\n\n"
    },
    {
      "time": " 26.Feb.2008 10.46am",
      "content": "<cite> Ugly Americans </cite>\n\nIt is probably reasonable on some level to want or hope that bigger foundries would employ people who are culturally grounded in a given Glyph set. But like any software it is likely that people will look for ways of doing thing more efficiently/cheaply especially if they are running small foundries. Simple cultural chauvinism isn’t a sales pitch.\n\n"
    },
    {
      "time": " 26.Feb.2008 11.06am",
      "content": "“szszelp”:\n\nI agree 100% that this discussion, while \\*very\\* interesting, is mostly fantasy. Type designers certainly don’t have the power to enact Cyrillic alphabet reform, and in the post-Soviet era, probably no single government does either. Even if Russia did it, there are many important Cyrillic-using countries that would not necessarily follow suit.\n\nChanges that are subtle enough to be acceptable to current readers might fly, but it would be hard to direct such evolution as a process, and it would take centuries to effect “real” change through ongoing subtle changes.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 26.Feb.2008 11.55am",
      "content": "So what are we talking about?  \nThere must be a range of variation that is acceptably legible within current standards, though much of that might fall outside the realm of “good design”. The same can be said for any script. But does this discussion we are having in any way relate to the discussion among the Russian designers? Are there proposals for injecting more variety? Are there any samples of the proposed changes we can look at? To choose between progressive Latinization and scribal regression seems to be a false dilemma. Why can’t Cyrillic be its own thing?\n\n"
    },
    {
      "time": " 26.Feb.2008 12.00pm",
      "content": "“it would take centuries to effect “real” change through ongoing subtle changes.”\n\nThats it! That’s just what we need, a secret cabal, an elusive order of type initiates, caring forth their hidden agenda, passing the secret knowledge from one generation to the next, shaping the alphabet century after century according to their illusive doctrines! We will see a rise of the brotherhood of grim-faced typophiles, infiltrating the political structure, and subverting the corporate hegemony.\n\n“Why can’t Cyrillic be its own thing?”\n\nThis is exactly it, the crux of the problem. Can Cyrillic be it’s own thing while it’s trying to mimic Latin?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080706222235/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 26.Feb.2008 12.23pm",
      "content": "Si: _Isn’t it the case that most Cyrillic text is rendered or printed in type designed by Matthew Carter or an anonymous foundry person working for Linotype or Monotype? Or are “Cyrillic professionals” contributing to the mainstream?_\n\nThe impact that ParaType has had in Moscow and St Petersburg seems to be considerable. In particular, their Cyrillic versions of Charter and Meta are apparently very popular and to be seen almost everywhere. Adam Twardoch wrote something on this subject after his return from Russia.\n\nBut of course ParaType employ Maxim Zhukov as an expert reviewer, just as I do and just as Microsoft does, so the same kind of review and advice is contributing to all our designs. [I’ve had my Cyrillic type designs selected in two Russian design competitions, so I’m reasonably confident that I’m not doing anything terribly wrong.]\n\n"
    },
    {
      "time": " 26.Feb.2008 12.30pm",
      "content": "Nick: _They are nonetheless viable in Cyrillic typefaces..._\n\nThe Latin Y as Russian U certainly is not. This is a completely different letter (and appears as such in some non-Slavic Cyrillic orthographies, U+04AE).\n\n_...although the reversed contrast of the bad “I” which you draw attention could be difficult—but if other characters were given a similar contrary stress in a purposeful manner, why not?_\n\nSure, sure, if one is setting out to apply a reversed stress to all the letters as a stylistic effect, then this sort of shape of I makes sense. But Ivan’s point was to draw attention to some mistakes made by some beginner foreign type designers encountering the Cyrillic script for the first time, e.g. taking Latin letters and flipping them (the same thing happens with R/Ya) without taking into account the necessary shift in stroke weight and other details. He’s not complaining about people making carefully worked-out unusual typefaces; he’s complaining about people being lazy and manipulating Latin letters instead of designing Cyrillic ones. Thankfully, as he notes, most people seem to have moved past that approach.\n\n"
    },
    {
      "time": " 26.Feb.2008 12.33pm",
      "content": "_I think You people have to assign such topics directly to cyrillic professionals_\n\nI disagree, because:\n\n1. Typefaces have been globalized (Unicode + openType)  \n2. Typefaces are best designed and crafted by one person (or a close team), not a committee\n\nTo get a type design to work well in Latin, Cyrillic, and Greek is the challenge, and that can be done by someone coming from any of the separate language backgrounds.\n\nThere is only We people, and we are type professionals.\n\n"
    },
    {
      "time": " 26.Feb.2008 1.17pm",
      "content": "_There is only We people, and we are type professionals._  \nDang Nick! That’s the phrase, right there. That needs a t-shirt or something.\n\n"
    },
    {
      "time": " 26.Feb.2008 1.24pm",
      "content": " ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/51MQN16ZPBL_4783._OU01_AA240_SH20_.jpg)\n\n"
    },
    {
      "time": " 26.Feb.2008 1.27pm",
      "content": "Is there, perhaps room for a round-writing style with Cyrillic, as there was with the youth-styled Japanese kana of the last decade and a half? As I imagine it, round-handed Cyrillic might take on a more Greek influence than Latin. Aligning miniscules to a center rather than base line might help too.\n\nOK, there’s my next project.\n\n"
    },
    {
      "time": " 26.Feb.2008 1.29pm",
      "content": "Wow, what a great and insightful discussion. You guys are awesome. I am not really a type designer, just a regular kind, but the sheer amount of brilliant, in-depth and quite eloquently presented information that I find here is both humbling and exhilarating.\n\nThank you!\n\n/sniff  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080706222235/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 26.Feb.2008 1.52pm",
      "content": "_Is there, perhaps room for a round-writing style with Cyrillic..._\n\nThere are many styles of Cyrillic _writing,_ just as there tends to be for any script, influenced by different writing tools, surrounding artistic culture or subculture, etc. There is certainly a roundhand tradition, which corresponds to the same development in 18th and 19th century writing in France, England, etc., but I suspect you are thinking of a different kind of ’round-writing’ from your reference to kana.\n\nThere are many, many Cyrillic script types based on handwriting models or greater or lesser formality. Some are based on specifically Cyrillic models, and some are adaptations of Latin script faces (e.g. ParaType’s version of Excoffon’s Mistral and Underware’s new Bello Cyrillic— the latter is very nice, by the way).\n\nBut as in the Latin script, there is a distinction made between text faces and script faces.\n\n"
    },
    {
      "time": " 26.Feb.2008 4.43pm",
      "content": "The round kana styles I’m talking about are called “marui ji” or “koneko ji”. Of the fonts I’ve found in this style, many have corresponding Latin alphabets.\n\nexamples:  \n [http://www.flopdesign.com/e\\_font/flopfont/wa.html](http://web.archive.org/web/20080706222235/http:/www.flopdesign.com/e_font/flopfont/wa.html)  \n [http://www.flopdesign.com/e\\_font/flopfont/47amayadori.html](http://web.archive.org/web/20080706222235/http:/www.flopdesign.com/e_font/flopfont/47amayadori.html)  \n [http://www2.wind.ne.jp/maniackers/colo.html](http://web.archive.org/web/20080706222235/http:/www2.wind.ne.jp/maniackers/colo.html)\n\n"
    },
    {
      "time": " 26.Feb.2008 8.17pm",
      "content": "This has some similarity to the kana styles: brush style smallcaps from Underware’s [Bello Cyrillic](http://web.archive.org/web/20080706222235/http:/www.underware.nl/site2/index.php3?id1=underware&id2=custom-type&id3=bello-cyrillic). The remainder of the type is a connecting script.\n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/bello-cyrillic-09_5569.jpg)\n\nBut of course this, like the kana fonts, is a display face, not intended for substantial text work in e.g. books or periodicals.\n\n"
    },
    {
      "time": " 27.Feb.2008 1.01am",
      "content": "\\>\\>I disagree, because:  \n\\>\\>1. Typefaces have been globalized (Unicode + openType)  \n————————————-  \nVery nice but it is mean that any globalization depending from locales and without them Unicode and Opentype are only new “gift boxes” for old style fonts with a ugly “localized” parts (just look at [http://typophile.com/files/CYR\\_3807.gif](http://web.archive.org/web/20080706222235/http:/typophile.com/files/CYR_3807.gif \"http://typophile.com/files/CYR\\_3807.gif\") from **oprion** )\n\n\\>\\>2. Typefaces are best designed and crafted by one person (or a close team), not a committee  \n\\>\\>To get a type design to work well in Latin, Cyrillic, and Greek is the challenge, and that can be \\>\\>done by someone \\>\\>coming from any of the separate language backgrounds.  \n————————————-  \nUps 8( ! It is not good! Because **one person** can‘t make true Unicode font - just beleive! That person can do some glyph forms for some localized tables - not for all of them. And without committee’s control - that work often ugly, cause **We are people**.\n\nAs for example - few “Unicode fonts”\n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/cyr_good_5162.png)\n  \n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/cyr_bad_4766.png)\n  \n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/bad_cyr2_5595.png)\n  \n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/bad_font3_3781.png)\n  \n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/bad_font5_3680.png)\n\nSorry for my English  \n———————————-  \nАндрій Поданенко  \nweb: [http://my.ukrweb.info](http://web.archive.org/web/20080706222235/http:/my.ukrweb.info/ \"http://my.ukrweb.info\")\n\n"
    },
    {
      "time": " 27.Feb.2008 1.16am",
      "content": "I’m not sure of your point. You’ve shown that some Cyrillic fonts, while adequate for Russian, are deficient for Ukranian. That is unfortunate but not unexpected. You’ll frequently find even more deficiencies in a Latin font designed for English tested against requirements of Icelandic or Turkish.\n\n"
    },
    {
      "time": " 27.Feb.2008 1.31am",
      "content": "And another “professional” ‘s fonts when glypts from 14pt all good but from 12pt - some of them lost.\n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/unicode_cyr_6481.png)\n  \n———————————-  \nАндрій Поданенко  \nweb: [http://my.ukrweb.info](http://web.archive.org/web/20080706222235/http:/my.ukrweb.info/ \"http://my.ukrweb.info\")\n"
    },
    {
      "time": " 27.Feb.2008 1.34am",
      "content": "2cuttlefish  \nnope! I saw You “ukrainian and russian” fonts that looks normal at 12px(example) but lost(or cross-copied - [http://typophile.com/files/CYR\\_3807.gif](http://web.archive.org/web/20080706222235/http:/typophile.com/files/CYR_3807.gif \"http://typophile.com/files/CYR\\_3807.gif\") ) some glypts in other sizes.  \n———————————-  \nАндрій Поданенко  \nweb: [http://my.ukrweb.info](http://web.archive.org/web/20080706222235/http:/my.ukrweb.info/ \"http://my.ukrweb.info\")\n\n"
    },
    {
      "time": " 27.Feb.2008 8.58am",
      "content": "_Sorry for my English_\n\nNo need to apologize Andrey, and thank you for making the effort to contribute to this thread!\n\n_one person can‘t make true Unicode font_\n\nWell, [I have](http://web.archive.org/web/20080706222235/http:/www.shinntype.com/Figgins_Scotch.pdf) (and I’m not the only one—many independent foundries are also “competing” with Adobe, Linotype and Microsoft in this respect) but I didn’t do it completely alone, I had some help from the Internet—and technical, aesthetic, cultural and linguistic help from other people here at Typophile.com. But I designed and drew every glyph.\n\n"
    },
    {
      "time": " 27.Feb.2008 9.14am",
      "content": "_one person can‘t make true Unicode font_\n\nAny font that contains a Unicode cmap table is a Unicode font, even if it only contains Latin glyphs or even only contains one glyph. So let’s presume that we’re talking about some level of multi-script Unicode character set coverage, of which the most common is probably the three-script Latin+Greek+Cyrillic font. A lot of these have been made and a lot of them designed by single individual type designers, although the best of them, I think, have also incorporated the expert opinion of typographic experts in the individual scripts.\n\n"
    },
    {
      "time": " 27.Feb.2008 9.20am",
      "content": "Sorry, I did miss that point. That certain characters would disappear at some point sizes and not others is truly bizarre behavior that is well beyond my technical ability to explain.\n\n"
    },
    {
      "time": " 27.Feb.2008 10.41am",
      "content": "Nick, lookin good and ready for Spring?\n\nChrisL\n\n"
    },
    {
      "time": " 27.Feb.2008 10.47am",
      "content": "_And another “professional” ‘s fonts when glypts from 14pt all good but from 12pt - some of them lost._\n\nAre you basing this on what shows up in the MyFonts preview? This could be a problem with the MyFonts database mechanism, not the fonts.\n\n"
    },
    {
      "time": " 27.Feb.2008 11.12am",
      "content": "Yes Chris, I might actually release it!\n\n"
    },
    {
      "time": " 27.Feb.2008 11.29am",
      "content": "“I might actually release it!”\n\nThe long hard struggle finally shows light at the end of the tunnel :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Mar.2008 6.29am",
      "content": "back on this, we had lectures with Gerard Unger this week and he gave a lecture in which he concisely explained what I think I was trying to get at before, that is script reform must be accepted by readers for it to become widely used. if something is too radical, readers will reject it and it will not catch on. Of course readers had to adapt to the Petrine reforms because those were imposed upon them, but i don’t think that a cartel of designers would have the same authortiy as an autocrat. So although designers may want to “improve” the Cyrillic script, whether or not they succeed will be completely out of their hands and any changes that might happen will happen slowly as readers adapt to changes. This is just my opinion.\n\n"
    },
    {
      "time": " 8.Mar.2008 7.01am",
      "content": "I think you nailed it, Paul.\n\nChrisL\n\n"
    },
    {
      "time": " 8.Mar.2008 11.04am",
      "content": "Bulgaria?  \nA poster to Typophile described a “cartel” situation there—with only one design school teaching typography, and a small community of typographers. Several type designers have gotten together in the HermesSoft foundry, and are promoting alphabet reform with their fonts. (The reform is to use italic or script letter forms in the Roman alphabet, which produces a latinized look, with more ascenders and descenders than usual in Cyrillic.)  \nHow much support does this have within the country’s education system? If Bulgarian cyrillics are being taught in elementary schools, that would critical.  \nThere is also the fact that Bulgaria is the only Cyrillic-using country in the EU, so Bulgarian cyrillics could become a de facto norm in the EU.\n\nThat’s all I know about the situation, but it was enough to persuade me to include a set of Bulgarian alternates in my Cyrillic fonts (along with five or six Serbian alternates). These glyphs are language-tagged, so are the default when the fonts are used (a) with Bulgarian language and (b) software that supports language tagging in OT fonts (that would be CS3—I don’t know about MS).\n\n\\*\\*\\*\n\nSpeaking of Microsoft, consistent letter-forms were aplied to the whole range of ClearType faces. Nothing radical in the Cyrillics, but note that the “single bowl” concept of the letter ef is used. Given the ubiquity of the Microsoft OS, won’t this have an influence in driving out the older, double-bowl form? More evolution than reform.\n\n"
    },
    {
      "time": " 8.Mar.2008 11.17am",
      "content": "Nick: _Nothing radical in the Cyrillics, but note that the “single bowl” concept of the letter ef is used. Given the ubiquity of the Microsoft OS, won’t this have an influence in driving out the older, double-bowl form?_\n\nThis is an idiomatic issue. The single bowl works best in type styles based on renaissance humanist models, the double bowl works best in neo-classical and romantic styles, i.e. styles with a more vertical axis and stronger stroke contrast. The double bowl form is chronologically ‘older’ in the context of Cyrillic typography because the Petrine reform took place in the 18th century and only later did Russian type designers, notably Lazurksi, explore stylistically older Latin models from the renaissance. Lazurski was a genius who successfully re-imagined the Cyrillic script in a new idiom, recognising that re-introducing certain Greek features — the triangular el, the single bowl ef — contributed to a more distinctive and also more unified style.\n\nSee my comments above about the need to understand idioms, i.e. to understand what form is appropriate in what context (which is not to say that, understanding the ’rules’ you can’t break them in clever and thoughtful ways, only that you shouldn’t break them through mere ignorance).\n\n"
    },
    {
      "time": " 8.Mar.2008 12.10pm",
      "content": "I’m not so sure that understanding idiom is the major criterion here, although it may be for faces that fall into the clearly defined historical categories you have mentioned.  \nThere are many Cyrillic faces, perhaps more hybrid, that successfully combine double-bowl ef with triangular el.  \nAnd then there is the De in Futuris (square) and Avant Garde (triangular); the influence of Lazurski has definitely opened the door for Yefimov to break the rule—but surely in a way that says the rule now only applies to revivals.\n\nIdiomatically, I don’t see much difference between most of the ClearType faces and, say, Meta (semi-condensed, low contrast, squarish), which has a double-bowl ef. Of the ClearType faces, Calibri would probably be better with a double bowl ef—the single bowl shape seems a bit round, given the squarishness of the rest of the rounds in that face.\n\nI note your point about vertical axis and high contrast being more conducive to the double bowl format, but a thin monoline face would also permit the double bowl.\n\nI suspect that in future, Cyrillic faces designed for OpenType may include both flavours of el/de and ef, in the same way that several Latin faces include single- and double-bowl “a” and “g”, as stylistic alternates.\n\n"
    },
    {
      "time": " 8.Mar.2008 2.05pm",
      "content": "As a Bulgarian, I can say there is not much upholding (excluding the media, of course!) to the HermesSoft’s idea of such Cyrillics reform. The long-standing tradition here is related with the Russian-style typography, which was in fact the only choice in printing during the whole “communist” period (and I do not see this as a disadvantage). Too many books and in fact all newspapers during these years were using Russian-tradition typefaces, and this is not going to change soon (long-standing habits die slowly).\n\nIn fact, I see the HermesSoft idea as a way of standing some market ground against the ubiquitous Russian fonts. But in the mainstream typography I do not see that much usage of upright italic-style fontage (excluding smallcase **т** , for which some newspapers here use an upright italic equivalent of latin **m** (which in fact I find extremely annoying, because of the named above habit). Same goes for the newspaper usage of h **тт** p in front of hyperlinks, which often happens here. Well, this is a matter of personal taste, of course.\n\nIMHO the important problem in Bulgarian typography is that too many western - and Russian - typographers do not pay attention is the Bulgarian equivalent of possession pronoun “hers” - the **accented smallcase и** (which is not the same as **ugrave** ). Only a few typefaces include such glyph (_namely the HermesSoft ones_).\n\nRegarding the Nick’s comment: rven if there are “Bulgarian”-style alternates in some fonts, I honestly doubt many people will break the typographic tradition (at least soon).\n\nThe typographer’s community is indeed small in Bulgaria, but in fact there is no problem to study typography in \\*respected\\* schools abroad (well, at least I remember I’ve seen _Filip Zrantchev_ in the MATD alumni list). As a member of EU, the possibilities for studying in Europe are excellent. So the things are not that “cartel”-ish (but still close).\n\n"
    },
    {
      "time": " 8.Mar.2008 2.28pm",
      "content": "So do you think it will be a mistake if my Cyrillic fonts, which I am about to release, have “Hermes-style” characters as the default for Bulgarian language in applications such as Adobe InDesign?\n\nDo you think it would be better if these were an option, as a Stylistic Set?\n\n_the accented smallcase и (which is not the same as ugrave)_\n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/shorti_6633.jpg)\n  \nThis is the glyph substitution according to Hermes.  \nIf the “Russian” glyphs are kept as standard, would this substitution be suitable as a Stylistic Alternate?\n"
    },
    {
      "time": " 8.Mar.2008 2.28pm",
      "content": "“the accented smallcase и (which is not the same as ugrave).”\n\nacnapyx, Is this what you mean?\n\n ![](http://web.archive.org/web/20080706222235im_/http:/www.typophile.com/files/u_4613.png)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Mar.2008 3.14pm",
      "content": "@Nick: _“So do you think it will be a mistake if my Cyrillic fonts, which I am about to release, have “Hermes-style” characters as the default for Bulgarian language in applications such as Adobe InDesign?”_  \nNo, not a mistake in any way, I just \\*think\\* they will be not used in most cases. It is better still to have it, than not, in case somebody is willing to use them. But I consider the idea about the stylistic set way better, so these who prefer using this “Hermes” standard can use it without much hassle.\n\n_the accented smallcase и (which is not the same as ugrave)_  \nAbout the look of these glyphs please check this [PDF](http://web.archive.org/web/20080706222235/http:/www.hermessoft.com/pdf/specimens/Garamond.pdf) (the _Technical data_ part)  \nBoth Nick and descom have posted the “i short” (i kratko, _name:afii10075, Unicode:0439_) in Bulgarian, which often is wrongly used in the place of the accented lowercase и, obviously due to the lack of adequate glyph in most fonts. That й is not in fact considered a diacritics, it is a regular letter and \\*is\\* available in (almost) all cyrillic alphabets, including Russian.\n\nThe case I am speaking about is (excuse me for the lame example):  \nI gave her the book _of hers_  \nwhich in Bulgarian is  \nДадох **и** книгата **и** (both **и** should be accented in this way, but too often due to lack of adequate glyphs these are substituted with **й** or ugrave). I wish I could post here an example, but looks like there is no unicode point for such glyph, so it is provided as an alternate in HS fonts.\n\nAs far as I know, there is no way to provide some kind of automatic substitution of **и** via **calt** feature, because unaccented **и** is also used as a conjunction. But it is safe to suppose a separate **й** (_afii10075_) can be safely replaced via calt with the **accented и** glyph.\n\n"
    },
    {
      "time": " 8.Mar.2008 3.38pm",
      "content": "acnapyx,\n\na) there is a unicode codepoint for the letters you wish:  \n U+040D CYRILLIC CAPITAL LETTER I WITH GRAVE  \n U+045D CYRILLIC SMALL LETTER I WITH GRAVE  \nb) even without them you could always represent it by the sequence  \n U+0418 CYRILLIC CAPITAL LETTER I, U+0300 COMBINING GRAVE ACCENT  \n U+0438 CYRILLIC SMALL LETTER I, U+0300 COMBINING GRAVE ACCENT  \n (and OpenType capabilities placing those accents into the most aesthetic way...)\n\nIt is clearly very wrong to replace “i kratkoe” with the grave-accented glyph even as a stylistic alternate (a calt feature would be even more fatal), as they are (as even you stated it) different characters.\n\nThere is quite often the problem of people not understanding Unicode enough...\n\nPS: Asparouh is a very nice old Bulgar name. I like it. :-)\n\n"
    },
    {
      "time": " 8.Mar.2008 4.08pm",
      "content": "_It is clearly very wrong to replace “i kratkoe” with the grave-accented glyph even as a stylistic alternate (a calt feature would be even more fatal), as they are (as even you stated it) different characters._\n\nThe glyphs I showed are for the character, U+0439.\n\nI have been referring to a font I bought from Hermes, Helen Pro Thin, which has the glyph that looks like “u macron” at the “i kratko” codepoint.\n\nHowever, that font is missing the characters U+040D and U+045D.\n\nI already have those characters in my fonts, but without Bulgarian alternates, so I will now add the alternates!\n\n\\*\\*\\*\n\nOn a related note, what is the status of the Serbian alternate glyphs?  \nShould these be the default, or a stylistic set?\n\n"
    },
    {
      "time": " 8.Mar.2008 4.16pm",
      "content": "aszszelp, I am not in any way an Unicode expert. I just say that in Bulgarian this way of using “i kratko” is very widespread - and this letter, surrounded by two spaces, has no other use here. So I considered this a way of correcting this behaviour. Yeah, _I know_ these letters are _different_.\n\nBut the Unicode point you mentioned is correct, I admit. My bad. (Note: _HermesSoft do not use it anyway, but name the glyph afii10074.alt01 with no Unicode reference_)\n\n"
    },
    {
      "time": " 8.Mar.2008 4.46pm",
      "content": "I’m finding a lot of valuable information on this thread, so thanks to all of you who contributed.\n\nJohn Hudson’s explanation about Lazurski and others exploring a new idiom based on renaissance Latin typefaces cleared up a question I had on this subject. Does anyone know where I can find more info on Lazurski and others who reimagined the Cyrillic alphabet based on renaissance forms?\n\n<cite>On a related note, what is the status of the Serbian alternate glyphs?<br>\nShould these be the default, or a stylistic set?</cite>\n\nAs I understand it, Serbian forms of both upright and italic б and the italic г, д, п, and т are mandatory for Serbian (and probably Macedonian) typesetting. So the locl feature should be used, but since software support for that feature is difficult to come by, adding a stylistic set for Serbian forms (in addition to the locl feature) would help the most users, I would guess. On a slightly related note, over at the [Chinese Typography and Graphic Design](http://web.archive.org/web/20080706222235/http:/typophile.com/node/42433) thread, I discussed the possibility of a single CJK font that would substitute the appropriate Chinese ideograph forms as preferred by the Chinese, Japanese, or Koreans based on the language. This would require a similar solution.\n\nI would like to learn more about the origins, usage status, and acceptance levels of Bulgarian forms, but let me state outright that I cannot stand ю with an ascender. It just looks wrong, as if one introduced an extender just for the sake of adding an extender.\n\n"
    },
    {
      "time": " 8.Mar.2008 5.15pm",
      "content": "Regarding the Serbian cyrillics, I would recommend checking out the page of [Cultural Secretariate of Serbian National Assembly](http://web.archive.org/web/20080706222235/http:/www.tipometar.org/aktuelno/akcija%21/ResavskaBGSans/IndexLat.html). There you can get absolutely free two sample Serbian cyrillic fonts, made by the Serbian designer Olivera Stojadinović.\n\n"
    },
    {
      "time": " 8.Mar.2008 7.00pm",
      "content": "_reimagined the Cyrillic alphabet based on renaissance forms_\n\nThere is a word for this, taken from DC Comics (Superman etc.) and also applied to Star Wars(!) “retcon”, meaning retroactive continuity.\n\n"
    },
    {
      "time": " 17.Mar.2008 12.03pm",
      "content": "back on topic, i would love to see a bit more influence of the ustav and polustav styles in contemporary designs. If you could breathe a bit of [this](http://web.archive.org/web/20080706222235/http:/www.flickr.com/photos/7333287@N07/2339414669/in/photostream/) into the cyrillic lowercase, i think it could work with an innovative approach?\n\n"
    }
  ]
}
