{
  "id": "42362",
  "title": "VTT & hinting a script font",
  "forum": "Build",
  "tags": [

  ],
  "content": "hello there.\n\ni’m going to ask for advice about VTT. i can pretty much use it (according to me) but i have a basic problem about hinting a script font: getting the letters to run together perfectly.\n\nthere’s a picture **[HERE](http://web.archive.org/web/20080704194516/http:/www.jellyhedge.com/hint.html)** (sorry but there’s a problem inserting it...) Could you see the tiny steps where the tail on the preceding letter doesn’t quite align with the next letter sometimes? and how it wasn’t the same error each time...\n\nthe 2 rows of iiiilllllll are - i think - rasterized by the MS and the Apple rasterizers. (i’m not sure what that means...) the 2nd line is ok, the top one isn’t...\n\nthe tail - whatever it’s called - is the same width as the left stem. i think script fonts usually make it a bit thinner, so it nestles well inside, or tapers away inside. is that the problem/solution...?\n\ni’m trying to link the right phantom point to the left side of the tail... but this doesn’t seem to mean the right bearing itself (the blue line) is linked... at least as far as the next letter is concerned, and in that one rasterizer....\n\nobviously i have a very inadequate grasp of digital type... can anyone enlighten me a little?\n\n [‹ Unknown 'thing' in glyph window](http://web.archive.org/web/20080704194516/http:/www.typophile.com/node/42565 \"Go to previous forum topic\") [Best Mac to PC font converter? ›](http://web.archive.org/web/20080704194516/http:/www.typophile.com/node/9696 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080704194516/http://www.typophile.com/user/27464\" title=\"View user profile.\">charmaine zopf</a>",
  "time": "<br>",
  "uid": "27464",
  "comments": [
    {
      "time": " 22.Feb.2008 7.41pm",
      "content": "Have you seen this... [http://www.microsoft.com/typography/CursiveScriptGuidelines.mspx](http://web.archive.org/web/20080704194516/http:/www.microsoft.com/typography/CursiveScriptGuidelines.mspx \"http://www.microsoft.com/typography/CursiveScriptGuidelines.mspx\")\n\n"
    },
    {
      "time": " 23.Feb.2008 7.37am",
      "content": "thanks. i haven’t stumbled on that before. they’re a mine of information.. maybe the answer’s there somewhere.\n\nalthough... it isn’t a dropout that’s my problem: i have too many pixels not too few.\n\n"
    },
    {
      "time": " 25.Feb.2008 8.23am",
      "content": "here’s the picture:\n\n ![](http://web.archive.org/web/20080704194516im_/http:/www.typophile.com/files/hint_3644.gif)\n\n"
    },
    {
      "time": " 27.Feb.2008 12.55pm",
      "content": "The top preview is unhinted, and the bottom preview is hinted?\n\n"
    },
    {
      "time": " 27.Feb.2008 4.01pm",
      "content": "I suspect the difference between the two rows is that one is compatible widths and the other is not. Hence the problem only showing up sometimes and not at every junction.\n\n"
    },
    {
      "time": " 28.Feb.2008 3.23am",
      "content": "the display I am seeing here is GreyScale, so I dont think its to do with Compatible widths.\n\nChris, if you send me a copy of the font to [mikedu@microsoft.com](mailto:mikedu@microsoft.com), I can review the hinting for you. I think based on what I see, the bottom line in VTT is showing the correct results. The bottom line in VTT shows the hinted advance Widths, top line shows, Linear advance widths. Applications will use the hinted advance widhts, so what you show looks correct. Have you tried saving and installing the font to test this?\n\n"
    },
    {
      "time": " 29.Feb.2008 9.18am",
      "content": "thanks for replying....\n\ndberlow & john hudson: thanks. both were gridfitted. not sure what compatible widths are...\n\nmike duggan: as it stood, with that very minimal hinting, the irregularities were still there when installed.\n\ni went ahead and hinted some letters fully, and it works much better. (why didn’t i do that first? good question) but it seems a bit illogical, tho’ obviously it can’t be, that the problem went away. i thought that if the letters were grid-aligned at the bearings, like in the pic, any overspills moving rightwards would all be equal and not seen. saving the trouble...\n\nthanks for the offer of help. if i still can’t fix it i’ll take you up on it.\n\n"
    }
  ]
}
