{
  "id": "42374",
  "title": "combining accents unicode question",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am creating some unusual glyphs in my font, for example ’LATIN CAPITAL LETTER N WITH DOT ABOVE’. How should I name such new glyph? Unicode convention say it should combine two unicode values, so if LATIN CAPITAL LETTER N is 004E and DOT ABOVE is 02D9, than new glyph could be uni004E02D9. Is this correct?\n\nHowever, in the Unicode, one can also find the combining accents, and there COMBINING DOT ABOVE is 0307. So, should this LATIN CAPITAL LETTER N WITH DOT ABOVE, be named after all uni004E0307, combining these two unicode values (004E + 0307)?\n\nI am planning to write also the CCMP feature for the right composing/decomposing of these glyphs. Does it make any difference how I name these glyphs? Will both ways render the glyphs the same way? What is considered more correct?\n\nthanks, Peter\n\n [‹ Simple FontForge question](http://web.archive.org/web/20081119054313/http:/www.typophile.com/node/42377 \"Go to previous forum topic\") [InDesign Canadian Dictionary Problems ›](http://web.archive.org/web/20081119054313/http:/www.typophile.com/node/19865 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081119054313/http://www.typophile.com/user/3279\" title=\"View user profile.\">peter bilak</a>",
  "time": "<br>",
  "uid": "3279",
  "comments": [
    {
      "time": " 22.Feb.2008 2.11pm",
      "content": "Karsten Luecke was kind enough and pointed me to example of Arno Pro. A similar issue of for example LATIN CAPITAL LETTER G WITH TILDE ABOVE is solved by naming it as it was a ligature (g\\_tildecomb), and added a line of code in their CCMP feature (sub G tildecomb by G\\_tildecomb;).\n\nIf anyone from Adobe is reading this, is this how they suggest solving this issue? Will typing the G followed by tilde enter this glyph in text, provided the application supports CCMP feature?\n\ncheers, Peter  \n [http://www.typotheque.com](http://web.archive.org/web/20081119054313/http:/www.typotheque.com/ \"http://www.typotheque.com\")\n\n"
    }
  ]
}
