{
  "id": "42371",
  "title": "Post Graduate TypeDesign Education",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi.\n\nI am curios to know your opinion and recommendations about the different offers in advanced/post graduate education for Type Design. I am aware of the programs at Reading University in England and the one at Royal Academie in Holland. Are there other of such quality? If so, which ones? ... Apart from listing other schools, what are the main differences in between those two programs?\n\nThanks for any feedback,  \nRegards,\n\nGiovanni\n\n [‹ Typophile subdomains: What’s the deal?](http://web.archive.org/web/20080709005851/http:/www.typophile.com/node/42491 \"Go to previous forum topic\") [A FontBook for sale ›](http://web.archive.org/web/20080709005851/http:/www.typophile.com/node/42508 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080709005851/http://www.typophile.com/user/5062\" title=\"View user profile.\">Giovanni Jubert</a>",
  "time": "<br>",
  "uid": "5062",
  "comments": [
    {
      "time": " 23.Feb.2008 3.21am",
      "content": "TypeMedia has a new site at [http://typemedia.org/](http://web.archive.org/web/20080709005851/http:/typemedia.org/ \"http://typemedia.org/\")  \nCheers, Erik\n\n"
    },
    {
      "time": " 24.Feb.2008 6.14pm",
      "content": "There’s ECAL in France, but the catch is that it’s taught in French. For an American like myself, I’m limited to the two English-speaking programs, which are the ones you mentioned above. There’s also a certificate in type design you can get from SCAD (Savannah College of Art & Design), but from just my brief scanning of the program it doesn’t look like it compares at all to Reading or KABK. Why isn’t there a good American, or at least North American, type design program that rivals those in Europe? Does anyone think this could be a possibility in the future?\n\n"
    },
    {
      "time": " 25.Feb.2008 11.03am",
      "content": "Very few people have attended both programs, so I would take any comparisons of them with a grain of salt. I graduated from the Reading program in 2006 and I can speak to some of the benefits of their approach:  \n- the opportunity, through first-class lectures and the proximity of research resources, to really solidify your understanding of the historical legacy underpinning the art  \n- rigorous standards requiring that you design a family of typefaces, and that they be readable in text settings (harder than designing a display face)  \n- exposure to diverse design approaches through guest lecturers (no dogma)  \n- a requirement that you write a research dissertation. (If you are not interested in research and writing, this may not be for you, but have you noticed that those who contribute most to the community dialog have a background in research as well as design?)  \n- some great field trips  \n- and, as was mentioned, an opportunity to learn from experts in nonlatin typefaces.\n\nThings you might want to consider:  \n- this is a program for self-learners. The absence of dogma means nothing is simply handed to you. You have to figure out for yourself the right approach.  \n- this is a very intense program for most people to accomplish in 12 months. You work all the time. Your social life will be on hold, except of course with your fellow students.  \n- Reading graduates are very successful in finding jobs in the industry and are well represented in the awards competitions\n\nHope this helps, even though it only speaks to half your question.\n\nJuliet\n\n"
    },
    {
      "time": " 25.Feb.2008 12.58pm",
      "content": "Giovanni,\n\nA little while back there was a thread [“Practical master in type design”](http://web.archive.org/web/20080709005851/http:/typophile.com/node/36918) that might help answer some of your questions.\n\nAndy\n\n"
    },
    {
      "time": " 25.Feb.2008 11.06pm",
      "content": "Thanks to all for your replays.  \nThanks Julliet for your fist hand comments,  \nPeter for the new link and Andy for pointing me to the right thread.\n\nCheers to all!\n\nGiovanni\n\n"
    }
  ]
}
