{
  "id": "42399",
  "title": "Would you license a library of fonts for $100 per year",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The header says it all.\n\n100 bucks for a basic license (1-5 users single location). Larger installations would require larger yearly fees\n\nJames\n\n [‹ Anyone have Basel workshop portfolio tips?](http://web.archive.org/web/20081007163542/http:/www.typophile.com/node/42552 \"Go to previous forum topic\") [Question about Papyrus ›](http://web.archive.org/web/20081007163542/http:/www.typophile.com/node/42575 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007163542/http://www.typophile.com/user/1947\" title=\"View user profile.\">terminaldesign</a>",
  "time": "<br>",
  "uid": "1947",
  "comments": [
    {
      "time": " 23.Feb.2008 11.15am",
      "content": "How much of a library? in other words: how many fonts?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 23.Feb.2008 11.18am",
      "content": "How many fonts would make it worthy of your consideration?. 50, 100, 1000?\n\nAt $19-$50 per font as a current average price, what is the size threshold that would be the tipping point?\n\n"
    },
    {
      "time": " 23.Feb.2008 11.22am",
      "content": "The question is which fonts. Isn’t it?\n\n"
    },
    {
      "time": " 23.Feb.2008 11.30am",
      "content": "Also, would there be just a static batch of fonts that would never change, or would that be a plan where new fonts are added to the pool once they are released, for no additional fee?\n\nIf you’d expect me to give you an answer based on a one-liner like “would you license a library of fonts for $100 per year”, my only response could be “Maybe”.\n\nA.\n\n"
    },
    {
      "time": " 23.Feb.2008 11.32am",
      "content": "I would want it to be a lot of fonts.\\* But if it were, then the answer would be yes. I would do that. And I would keep paying year after year. 100 dollars isn’t really that much actually, I wouldn’t miss it mentally the way that I would miss even $200. Funny how we draw these lines.\n\n\\* I don’t know what this number would actually be. It’d have to just feel right. Sorry for being so subjective.\n\n"
    },
    {
      "time": " 23.Feb.2008 11.34am",
      "content": "The number of fonts and the price are important variables, of course, but in general, I think a “subscription license” is an interesting idea, James. P22 has something like it with their [P22 Club](http://web.archive.org/web/20081007163542/http:/www.p22.com/members/club.html), incidentally, also $99 per year.\n\n"
    },
    {
      "time": " 23.Feb.2008 11.38am",
      "content": "Doesn’t the P22 deal just give you a discount on fonts you buy? I like this subscription idea quite a bit. My answer would be - probably.\n\nSharon\n\n"
    },
    {
      "time": " 23.Feb.2008 11.40am",
      "content": "You know, now that I think about it, the number of fonts would have to be only about as big as the Underware library. They only have about fix or six typefaces out, but they all have what I consider a lot in them, and I like all of them a lot. I’d pay a hundred bucks a year for that. Hope this helps a little.\n\n"
    },
    {
      "time": " 23.Feb.2008 11.51am",
      "content": "As a student, it would depend on the library, but probably. I’ve already dropped $400 on fonts this semester—and it’s only a month in! It would have been even better during my sophomore and junior years when I had less money to spend and was just using whatever bootleg fonts were going around. I also think professors would be less likely to give fonts to students if the cost of a years worth of fonts was about equal to two good textbooks.\n\nThis would also be a great deal for the organization I work for. We don’t have a huge budget so our display types don’t change much because we can’t justify dropping money on a font to use it once or twice. Paying a subscription fee would make a lot more sense, and allow me to avoid getting every font purchase approved. I would have very little trouble getting $100 per _month_ approved if the collection were big enough.\n\nEdit: On a related note, I would be especially likely to use it if the whole thing operated using FEX.\n\n"
    },
    {
      "time": " 23.Feb.2008 11.58am",
      "content": "\\> if the whole thing operated using FEX\n\nPaid _Typecasts_. Linotype, are you listening?\n\n"
    },
    {
      "time": " 23.Feb.2008 12.00pm",
      "content": "<cite>I also think professors would be less likely to give fonts to students...</cite>\n\nIs this common? I heard about one such case before and it really sounds like a very... well, stupid thing for a teacher to do.\n\n"
    },
    {
      "time": " 23.Feb.2008 12.47pm",
      "content": "Yes, as long as the fonts were good. Quality would matter far more than quantity (hey, I hear I can get 1000 fonts for only...).\n\n"
    },
    {
      "time": " 23.Feb.2008 1.45pm",
      "content": "My answer would have to be “It depends”. I’d like to have the option to choose between this and current standard licensing. I’m assuming that you wouldn’t be able to license an entire library for $100, so if I could choose maybe 2 full families in fully-featured OpenType and a handful of single-style fonts (probably display but not necessarily) this offer may be worth it. I’d much rather be able to pick a few things that I think would work for me than be saddled with whatever a default licensing package might be. Of course, I’m speaking as someone who is currently a hobbyist user of type, not a professional.\n\nThe biggest obstacle I see would be enforcing this licensing scheme. Have self-obsolescing fonts been developed? How would you retrieve the fonts after 1 year? Would this system be based on the honor system?\n\n"
    },
    {
      "time": " 23.Feb.2008 2.33pm",
      "content": "Start a font of the month club!\n\n"
    },
    {
      "time": " 23.Feb.2008 3.40pm",
      "content": "As a principle I think this would be a great idea. But it would heavily depend on which fonts exactly. Which would also influence how many — I don’t mind less fonts for the same price if they’re really good.\n\n"
    },
    {
      "time": " 23.Feb.2008 3.44pm",
      "content": "It would be interesting to combine this with a survey about font piracy. The last survey I saw showed over half of the respondents admitting to font piracy—I wonder how many would pay for a subscription service.\n\n"
    },
    {
      "time": " 23.Feb.2008 3.47pm",
      "content": "no. I’d rather buy rights as I need them.\n\nThere are already so many annual, semi-annual, & etc. fees to keep track of the thought of a new one is not an attractive one.\n\n-=®=-\n\n"
    },
    {
      "time": " 23.Feb.2008 5.04pm",
      "content": "_as long as the fonts were good_\n\nMy condition as well. I’d rather have quality than quantity.\n\n"
    },
    {
      "time": " 23.Feb.2008 5.43pm",
      "content": "if the fonts were good and the number was generous : yes absolutely.\n\nif the fonts were good but the number was limited : depends on the deal.\n\nif the fonts were so-so : probably not.\n\nif the fonts were fancy, exclusive, expensive otherwise : i’d seriously consider it.\n\nsmiling emoticon.\n\n"
    },
    {
      "time": " 25.Feb.2008 2.45am",
      "content": "I don’t license fonts or lease them. What kind of bullshit is that? How did we all get conned into that? Digital foundries can’t protect their wares from being copied and it is OUR fault?\n\nThen, again, that is why I haven’t BOUGHT a digital font in years. Though I did BUY (license) Peanut from P22 maybe a year or so ago. Hopefully, my license will transfer with the next font format change; does that work?\n\nGerald\n\n"
    },
    {
      "time": " 25.Feb.2008 3.07am",
      "content": "\\> Hopefully, my license will transfer with the next font format change; does that work?\n\nThat depends on the foundry. Many foundries do not upgrade you for free. Many more do not even offer discounts. On the other hand, an OpenType font often has far more in it than a normal PostScript Type 1 font may have. So a free upgrade there wouldn’t really be fair in a lot of cases.\n\nThere will inevitably be a lot that changes in the next generation font format, and a lot that stays the same… just like every other technological step. But I personally don’t expect the attitude toward the terms “licensing” and the idea of protecting intellectual property to change. In fact, if I were betting, I’d say that the next format will offer foundries even more protection somehow.\n\n"
    },
    {
      "time": " 25.Feb.2008 6.32am",
      "content": "It’s a neat idea. As much as I hate ’renting’ software, that’s pretty much what all of us do these days anyways. I always thought Adobe should come out with some subscription plan. $x a year and you have access to whatever Adobe software you need.\n\n“I don’t license fonts or lease them. What kind of bullshit is that? How did we all get conned into that?”\n\nBill Gates is a master marketer.\n\n"
    },
    {
      "time": " 25.Feb.2008 6.37am",
      "content": "I don’t know if a subscription would help any of the parties. Before they know it, they may have paid out more in a few years for all those subscriptions then they would had they bought the fonts they use.\n\nAlso, if a person subscribes in year one, and doesn’t for year 2 - what is to stop that person from still using the fonts? Or worse, passing them on...?\n\n"
    },
    {
      "time": " 25.Feb.2008 6.49am",
      "content": "\\> Is this [teachers giving out fonts] common? I heard about one such case before and it really sounds like a very... well, stupid thing for a teacher to do.\n\nSadly, it is. Usually in graphic design courses, not typography ones. I once worked with a teacher who laughed when I said I was saving up for Adobe’s font folio. He came in the next day with a copy on disk, and thought I was foolish for not accepting it.\n\n"
    },
    {
      "time": " 25.Feb.2008 7.36am",
      "content": "Thank you for all your comments. I was just trying to gauge your opinions.\n\nCurrently for several of our clients, we offer a licensing deal as follows: For a yearly fee they gain access to our entire library. As we come out with new fonts, they get access to those as well. When they use our fonts in their client’s work, they bill price of the relevant fonts to their client. We offer them a discount on the font price that they can either pass along to their client, or take as a sales commission.\n\nWe also work with them to develop designs that they feel are useful.\n\nSo far it is working nicely.\n\nJames\n\n"
    },
    {
      "time": " 26.Feb.2008 10.10am",
      "content": "Say you could license 10 typefaces out of a full library with the ability to select different typefaces every year. That would be something.\n\n"
    },
    {
      "time": " 26.Feb.2008 2.24pm",
      "content": "@Terminal Design  \nSo are you saying that you give the design firm full access to the typefaces for design and layout purposes, but charge a discounted price for the font when it is actually put into use?\n\n"
    },
    {
      "time": " 26.Feb.2008 2.32pm",
      "content": "@DanGayle  \nYes. So if you use typeface A-Light for a client1 you purchase the license of A-Light for the client at a discount. When you use typeface A-Light for client2, you purchase the license of A-Light for the client at a discount. And so on.\n\nJames\n\n"
    },
    {
      "time": " 26.Feb.2008 3.19pm",
      "content": "I like that idea. It monetizes a practice that some designers have already. Some designers will download entire foundries’ libraries, not legally of course, for use in the design process. Then, after the work of getting the typefaces approved by the client, etc., they will properly license the font from the foundry.\n\nYour idea is the same, except legal. As an added benefit, the actual purchase of the typeface comes at a discount, and you get access to the newest fonts and perhaps unique fonts that otherwise would be unavailable. Nice compromise.\n\n"
    },
    {
      "time": " 26.Feb.2008 6.24pm",
      "content": "<cite> It’s a neat idea. As much as I hate ’renting’ software, that’s pretty much what all of us do these days anyways. I always thought Adobe should come out with some subscription plan. $x a year and you have access to whatever Adobe software you need.... Bill Gates is a master marketer. <cite></cite></cite>\n\nSoon the day will come when you will pay licensing fees for your first born’s first name.  \nYou read it here first.\n\n"
    },
    {
      "time": " 26.Feb.2008 6.46pm",
      "content": "_What kind of bullshit is that?_\n\nLicensing is a mechanism which protects copyright in digital media.\n\n"
    },
    {
      "time": " 27.Feb.2008 8.13am",
      "content": "“Licensing is a mechanism which protects copyright in digital media.”\n\nBut so is selling. ;o)\n\n"
    },
    {
      "time": " 27.Feb.2008 8.21am",
      "content": "[http://typophile.com/node/42540](http://web.archive.org/web/20081007163542/http:/typophile.com/node/42540 \"http://typophile.com/node/42540\")\n\na thread i started on the future of licensing.\n\nthe current model is seriously flawed and woefully cumbersome, and thus doomed. i have mixed feelings.\n\n"
    },
    {
      "time": " 27.Feb.2008 9.39am",
      "content": "<cite>So is selling</cite>\n\nMmmm.. No. I don’t think so. Selling implies complete ownership including the right to re-package, re-sell.\n\n-=®=-\n\n"
    },
    {
      "time": " 27.Feb.2008 10.14am",
      "content": "an argument for revising copyright law. not mine, just for discussion.\n\n[http://www.boingboing.net/2008/01/29/we-need-a-different.html](http://web.archive.org/web/20081007163542/http:/www.boingboing.net/2008/01/29/we-need-a-different.html \"http://www.boingboing.net/2008/01/29/we-need-a-different.html\")\n\n"
    },
    {
      "time": " 27.Feb.2008 10.31am",
      "content": "James: <cite>So if you use typeface A-Light for a client1 you purchase the license of A-Light for the client at a discount. When you use typeface A-Light for client2, you purchase the license of A-Light for the client at a discount. And so on.</cite>\n\nThat’s a great idea. Count me in.\n\nI would gladly pay 100 usd a year for the use of say 20 or 25 type families.\n\nBTW I have been a P22 Clubmember for a few years now, because I like that concept too. Just a shame that their Library is somewhat limited. So for THIS concept to work there has to be quite a broad base of fonts to choose from & maybe the possibility to change your prefs and such.\n\nLet me think some more on this.\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
