{
  "id": "42395",
  "title": "How do you type an X Bar",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "My wife is currently in a stats class in her masters program and asked me how she would go about typing an X Bar. I've attached an image of the character. I've done some digging around online and found the character mentioned on [this page](http://web.archive.org/web/20150218042732/http:/ta.wikipedia.org/wiki/%E0%AE%95%E0%AE%A3%E0%AE%BF%E0%AE%A4%E0%AE%95%E0%AF%8D_%E0%AE%95%E0%AF%81%E0%AE%B1%E0%AE%BF%E0%AE%AF%E0%AF%80%E0%AE%9F%E0%AF%81%E0%AE%95%E0%AE%B3%E0%AF%8D) (third character from the bottom).\n\nI see that Lucida Sans Unicode has it as a character, and I can copy and paste the X bar from that page into Word when using that font. I've checked the Character Map in Windows and couldn't find it, so I'm curious though how I would go about typing this on a PC. Is there a key combination using the Alt key + a series of numbers?\n\nThanks for any help.  \nDavid\n\n| Attachment | Size |\n| --- | --- |\n| [84790e2b15a305120bc3fbeb4a4eeb4f.png](http://web.archive.org/web/20150218042732/http:/typophile.com/files/84790e2b15a305120bc3fbeb4a4eeb4f.png) | 182 bytes |\n\n",
  "author": "DavidM",
  "time": "23 Feb 2008 — 10:03am",
  "uid": "8636",
  "comments": [
    {
      "time": "23 Feb 2008 — 10:34am",
      "content": "I don't think that the x-bar (or any other letter-bar) is included in a standard font set. Normally, the typesetting program will add the bar itself by writing the letter and then drawing the line over the top. If you want a symbol like this in Word, you should be able to use the Microsoft Equation plugin (something like Insert \\> Object \\> Microsoft Equation x.x). You can use the dialog that appears to create the x-bar (and a whole equation that includes it). If you're looking to use mathematics symbols seriously, consider the LaTeX typesetting system.\n\n"
    },
    {
      "time": "23 Feb 2008 — 10:39am",
      "content": "x̄  \nFor the web at least, here is how you can do it.  \n [http://www.personal.psu.edu/ejp10/psu/gotunicode/statsym.html](http://web.archive.org/web/20150218042732/http:/www.personal.psu.edu/ejp10/psu/gotunicode/statsym.html \"http://www.personal.psu.edu/ejp10/psu/gotunicode/statsym.html\")\n\nThis should apply to regular programs as well, I'm not entirely clear on unicode support in non-web contexts, but it appears to work in most. For example copy and paste the x here. It should work in most apps.\n\nBTW. Character map doesn't show it because this is actually one regular character and then a special modifier TO the character. The x here may not be correct, but the modifier should be.\n\n"
    },
    {
      "time": "23 Feb 2008 — 11:13am",
      "content": "For typesetting formulas in academia the usual tool is [TeX](http://web.archive.org/web/20150218042732/http:/en.wikipedia.org/wiki/TeX). TeX editors are available as free software for most operating systems. The TeX system will create any symbol used in mathematics and statistics.\n\n"
    },
    {
      "time": "23 Feb 2008 — 2:55pm",
      "content": "Great! Thanks everyone for your help.\n\n"
    },
    {
      "time": "25 Feb 2008 — 8:31am",
      "content": "As an alternative to Word's equation editor, [this](http://web.archive.org/web/20150218042732/http:/sbarnhill.mvps.org/WordFAQs/Overbar.htm) page explains how to construct an overstrike character and assign a shortcut key.\n\nBut for doing statistics or other math, wouldn't a math pi font be a better solution in the long run? The American Mathematical Society has free Postscript distributions of Computer Modern and AMSFonts at [http://www.ams.org/tex/type1-fonts.html](http://web.archive.org/web/20150218042732/http:/www.ams.org/tex/type1-fonts.html). TrueType versions are on the Mozilla website at [http://www.mozilla.org/projects/mathml/fonts/](http://web.archive.org/web/20150218042732/http:/www.mozilla.org/projects/mathml/fonts/).  \nWolfram's downloadable Mathematica 6.0 fonts are at [http://support.wolfram.com/mathematica/systems/windows/general/latestfonts.html](http://web.archive.org/web/20150218042732/http:/support.wolfram.com/mathematica/systems/windows/general/latestfonts.html), and MathType fonts are at [http://www.dessci.com/en/dl/fonts/](http://web.archive.org/web/20150218042732/http:/www.dessci.com/en/dl/fonts/).\n\n(These are all properly licensed or donated fonts, so I don't believe the links violate any Typophile rules.)\n\n"
    },
    {
      "time": "25 Feb 2008 — 9:59am",
      "content": "Gus\n\nBut is there an x bar character in those AMS fonts? I haven't set maths for a long time, but I recall that the x bar was created by an overline on the x, not a specific character.\n\n"
    },
    {
      "time": "25 Feb 2008 — 1:32pm",
      "content": "\\> But is there an x bar character in those AMS fonts?\n\nYou're probably right. I, too, don't work with scientific material any more and don't have any math fonts installed, but I did have a vague memory of using a font that had an x-bar, and those fonts are the usual suspects. Of course, given that this is Monday, I might be thinking of h-bar.\n\n"
    }
  ]
}
