{
  "id": "42432",
  "title": "Simple Question, Words per line in publications?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey guys and gals, I am a new designer and I cant for the life of me remember what the standard words per line is in publications. Anyone help me out? Thanks and much appreciated!\n\n",
  "author": "<a href=\"/web/20090430074213/http://www.typophile.com/user/27526\" title=\"View user profile.\">a.zuccs</a>",
  "time": "<br>",
  "uid": "27526",
  "comments": [
    {
      "time": " 24.Feb.2008 1.16pm",
      "content": "It depends on story length, leading, and font size and style.\n\n"
    },
    {
      "time": " 24.Feb.2008 1.47pm",
      "content": "Have a look at Bringhurst’s ’Elements of Typographic Style’. He has a table, based on the widely accepted idea that 2 1/2 lc alphabets is the maximum optimal measure for single column pages. That can be stretched with additional leading. When a column gets too narrow in multi-column layouts, then you either have problems with spacing or the ’rag’. But the best thing is to try it with the typeface and size you have in mind. The thing is to find the mixture of point size, leading, measure and margins that work together. And as Stephen indicates, there’s no formula for that; the ’eyes’ have it.\n\n"
    },
    {
      "time": " 24.Feb.2008 2.30pm",
      "content": "I will have to check out that book, sounds like the table might be the key. Thanks for the tip\n\n"
    },
    {
      "time": " 25.Feb.2008 7.27am",
      "content": "\\> It depends on story length, leading, and font size and style.\n\nAnd the number of characters in the words.\n\n"
    },
    {
      "time": " 25.Feb.2008 7.36am",
      "content": "Take a look at you favourite book series and start from here.  \nGood luck\n\n"
    },
    {
      "time": " 25.Feb.2008 8.02am",
      "content": "I don’t know if this is of any use to you, but one bit of wisdom that is always passed around is that there should be no more than 10 to 12 words per line (or 50 to 60 characters), because this is what the human eye is comfortable with.\n\nOf course, everything already said above also applies — if you are working on a letter-size page broken up into four columns of text, the words per line will probably be less than 10 to 12.\n\n"
    }
  ]
}
