{
  "id": "42449",
  "title": "Old Mac system fonts?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for some of the older system fonts for the Mac - namely Chicago and New York. Is there a place where I can get these? (Preferably online, as I don't really want to dive into my huge collection of system and OS-discs to find it right now...)\n\nIn theory, I still have the license for them, as my old OS licenses are still valid; though I really wouldn't mind paying a little for them either...\n\nThanks!\n\n",
  "author": "twistedintellect",
  "time": "24 Feb 2008 — 5:57pm",
  "uid": "24565",
  "comments": [
    {
      "time": "24 Feb 2008 — 7:29pm",
      "content": "I'm reasonably sure Apple has their old Mac operating systems available at least up to System 7, if not later, available for free download at their company website [http://apple.com](http://web.archive.org/web/20120424142856/http:/apple.com/). I can't think of the direct link off hand. Those old OS versions should include the basic fonts along with them. You'll have to dig through their download archives, though, and there may be other hoops to jump through.\n\n"
    },
    {
      "time": "25 Feb 2008 — 3:26am",
      "content": "Hi John,  \nhave a look [at this site](http://web.archive.org/web/20120424142856/http:/home.earthlink.net/~gamba2/syslist.html).  \nF\n\n"
    },
    {
      "time": "25 Feb 2008 — 7:30pm",
      "content": "From that list:\n\n[http://download.info.apple.com/Apple\\_Support\\_Area/Apple\\_Software\\_Updates/English-North\\_American/Macintosh/System/Older\\_System/System\\_7.5\\_Version\\_7.5.3/](http://web.archive.org/web/20120424142856/http:/download.info.apple.com/Apple_Support_Area/Apple_Software_Updates/English-North_American/Macintosh/System/Older_System/System_7.5_Version_7.5.3/)\n\nIt appears System 7.5.3 is the latest full version posted for free download, but with updaters you might be able to push that to 7.6.1. You'll have to skip up the parent directories to find everything. I'm not sure how up-to-date the fonts are at those versions. You should find the GX versions of the ones you're looking for, which is nice to have, though you might have to take them apart to find all the goodies hidden within.\n\n"
    }
  ]
}
