{
  "id": "42443",
  "title": "Yet another Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nThis is a logo I am developing for my client \"Pedro\", a professional chef spezialising in Spanish paella. I am a little worried about the chef's hat, because of its colour. Any ideas? Thanks for any feedback...\n\n ![](http://web.archive.org/web/20120424143242im_/http:/typophile.com/files/logo5_6504.png)\n\n",
  "author": "Tintin81",
  "time": "24 Feb 2008 — 4:33pm",
  "uid": "19464",
  "comments": [
    {
      "time": "24 Feb 2008 — 5:11pm",
      "content": "I'm not digging the black outline. I also think the hat could have more detail to separate it from a piece of broccoli.\n\nOverall the direction, a chef's hat for a chef, seems a bit cliche.\n\n"
    },
    {
      "time": "24 Feb 2008 — 10:12pm",
      "content": "Purely abstractly, I like the chef's hat, but due to the reasons picard mentions, it just doesn't work. What about ingredients of Paella? :)\n\nI like the type, and I think making a barely perceptible stroke for the letters would be better.\n\n(Didn't make the first post! BTW, would love your thoughts on [this](http://web.archive.org/web/20120424143242/http:/typophile.com/node/42345).)\n\n"
    },
    {
      "time": "25 Feb 2008 — 3:35am",
      "content": "to me, a paella should be a party around a circle.\n\nPaella means a big pan.\n\n ![](http://web.archive.org/web/20120424143242im_/http:/typophile.com/files/acorn_sum_01_4961.jpg)\n\n"
    },
    {
      "time": "25 Feb 2008 — 11:29am",
      "content": "First loose the stroke on the type. It will become a production problem when you use it at different sizes. Unless you want to spent a ton of time making rules for how thick the stroke is at different sizes. In general its just a bad idea.\n\nMy next question is are those Spanish colors? Look vaguely Italian to me.\n\nLastly open up the ro combination. Its the only combination that almost touches, it looks wrong. The el might be a tad to open as well. Good start keep going\n\n"
    },
    {
      "time": "25 Feb 2008 — 12:23pm",
      "content": "Things to look at for Spanish cuisine: every publication affiliated with El Bulli. If you can find a shop that sells high-end cookbooks, go ask for everything by or associated with Ferran Adrian - the design on all their cookbooks & products is top-notch and very Spanish. For Scream (who's doing stuff that's somewhat similar to El Bulli's approach to ice cream), I almost went with [Letterine](http://web.archive.org/web/20120424143242/http:/www.fontshop.com/fonts/downloads/fontfont/ff_letterine/) by the Italian type designer Alessio Leonardi. You might want to check out his website for his other faces.\n\nGood luck!\n\n"
    },
    {
      "time": "25 Feb 2008 — 5:00pm",
      "content": "I think this is the most clever food related logo I've seen, by a member of these forums even. It's very fresh where alot of logos are all similar for this particular field.\n\n[http://www.thedesignfirm.ca/identity/dana-mccauley/](http://web.archive.org/web/20120424143242/http:/www.thedesignfirm.ca/identity/dana-mccauley/ \"http://www.thedesignfirm.ca/identity/dana-mccauley/\")\n\n"
    },
    {
      "time": "25 Feb 2008 — 5:11pm",
      "content": "The more I look at it, the more the little chef's hat appears off-center to me. It's driving me a little crazy - is it just me?\n\nAnyway, I would suggest that you use the paella as the inspiration for the design rather than the fact that Pedro is a chef. I assume most people will assume that Pedro is the one who prepared the dish. Paella is a such a fun thing to eat ... rice full of meaty prizes!!! Plus, typically when I have ordered it, it's for two, making it a social, even romantic, dish to eat.\n\nAnyway, I really like paella (obviously), but I still think that the dish is the core idea to drive the design.\n\n"
    },
    {
      "time": "26 Feb 2008 — 8:58am",
      "content": "Hey, thanks a lot. Really nice input from you guys...\n\nThese are some of my other early concepts:\n\n ![](http://web.archive.org/web/20120424143242im_/http:/typophile.com/files/logo4_6016.png)\n\n ![](http://web.archive.org/web/20120424143242im_/http:/typophile.com/files/logo6_3819.png)\n\n[Web Designer Portfolio](http://web.archive.org/web/20120424143242/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "26 Feb 2008 — 9:00am",
      "content": "And this is my current favourite. The font is \"Nueva\" which sounds AND looks Spanish to me, no?\n\n ![](http://web.archive.org/web/20120424143242im_/http:/typophile.com/files/logo7_6226.png)\n\nPlease let me know what you think of it. Thanks...\n\n[Web Design Portfolio](http://web.archive.org/web/20120424143242/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "26 Feb 2008 — 10:51am",
      "content": "I like the new font, but I think the paella pan isn't working at that size - try it at a much smaller size, and then try color treatments for the name. I also think that the lack of space looks to webby - no need for it, IMO!\n\n"
    },
    {
      "time": "26 Feb 2008 — 2:55pm",
      "content": "See if you can get that looks slightly Arabic as well as Spanish, which could help channel southern Spain (especially Grenada). This specificity should help give a feel of authenticity.\n\n"
    },
    {
      "time": "27 Feb 2008 — 2:00pm",
      "content": "Thanks for the plug, picard102!\n\nTintin81 - I like the current direction, but I think it could use a bit more color / excitement...\n\n"
    },
    {
      "time": "27 Feb 2008 — 6:04pm",
      "content": "Try putting something like this design in the pan:  \n [http://www.abacoarte.com/images/productos/imagenes/plato-estrella\\_med.gif](http://web.archive.org/web/20120424143242/http:/www.abacoarte.com/images/productos/imagenes/plato-estrella_med.gif)\n\nFor more nice designs:  \n [http://www.abacoarte.com/index.php?cPath=23\\_35\\_36&osCsid=41deb22bf07c32465487c2b5468ed907](http://web.archive.org/web/20120424143242/http:/www.abacoarte.com/index.php?cPath=23_35_36&osCsid=41deb22bf07c32465487c2b5468ed907)  \n [http://www.abacoarte.com/index.php?cPath=23&osCsid=d40ecc19e535ac47cbcfba34bfc229a3](http://web.archive.org/web/20120424143242/http:/www.abacoarte.com/index.php?cPath=23&osCsid=d40ecc19e535ac47cbcfba34bfc229a3)  \n [For this one, look at the pieces titled From: \"Al-Andalus The Art of Islamic Spain\"](http://web.archive.org/web/20120424143242/http:/images.google.com/imgres?imgurl=http://math.dartmouth.edu/~matc/math5.pattern/Al-Andalus.p364.jpeg&imgrefurl=http://math.dartmouth.edu/~matc/math5.pattern/lesson5art.html&h=533&w=378&sz=176&hl=en&start=1&um=1&tbnid=zP0SRAxu4sExFM:&tbnh=132&tbnw=94&prev=/images%3Fq%3D%2Bandalus%2Bart%26um%3D1%26hl%3Den%26safe%3Doff%26client%3Dfirefox-a%26rls%3Dorg.mozilla:en-US:official%26sa%3DN)\n\n"
    },
    {
      "time": "27 Feb 2008 — 6:29pm",
      "content": "While Scalfin's plates are beautiful, I strongly disagree - make the pan smaller and more iconic (forget the dimensionality) if you're going to keep it! Iconic, with beautiful type and lively colors. I suspect your client is more interested in being associated with the latest in Spanish cuisine than in Spanish historical icons - but you should ask. :)\n\n---  \n [http://www.flickr.com/photos/eeblet/](http://web.archive.org/web/20120424143242/http:/www.flickr.com/photos/eeblet/ \"http://www.flickr.com/photos/eeblet/\")  \nLive near Oakland? Now in Jack London Square on Sundays: screamsorbet.com\n\n"
    },
    {
      "time": "27 Feb 2008 — 8:33pm",
      "content": "I was posting them to expand upon TDF's recommendation, so I don't particularly mind him going in the other direction. Just get out of the valley between.\n\nOh, and the plates in the second link might be good for simplicity, especially the fish (if the place serves a lot of fish), the bull(s) (beef) and the boar (pork).\n\n"
    },
    {
      "time": "28 Feb 2008 — 10:41am",
      "content": "Hi eeblet and Scalfin,\n\nI love both your ideas. Especially Scalfin's plates are really nice to look at, in fact I had a similar idea today when I found myself flipping through an Andalusian art book I found on my dad's bookshelf. However, since I'm not only developing the logo but also the website, I will probably use one of the historical patterns Scalfin proposed on the background and keep the logo rather simple like eeblet suggested. That should make both of you happy, no? I'll repost here in a few weeks, when I get on with the project. Thanks for your input!!\n\n[WebDesign Portfolio](http://web.archive.org/web/20120424143242/http:/www.designbits.de/)\n\n"
    }
  ]
}
