{
  "id": "42453",
  "title": "Logo Brand Critique.",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Sup guys,\n\nNew to this forum and I would like to get some feedback. I like to see what do you guys think. Positive or Negative are welcome. hah I don’t care. This is my brand name that I registered last year. I was thinking of redesigning the logo, but I need to see which one you would tell me to go for.\n\n ![](http://web.archive.org/web/20080821151602im_/http:/www.typophile.com/files/logos_3735.jpg)\n\n [‹ Critique for a church logo](http://web.archive.org/web/20080821151602/http:/www.typophile.com/node/43237 \"Go to previous forum topic\") [Logo Redesign Input ›](http://web.archive.org/web/20080821151602/http:/www.typophile.com/node/42860 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821151602/http://www.typophile.com/user/27536\" title=\"View user profile.\">basixone</a>",
  "time": "<br>",
  "uid": "27536",
  "comments": [
    {
      "time": " 24.Feb.2008 9.17pm",
      "content": "I had a hard time figuring out what it was supposed to say in the majority of them. The left logotypes were the only ones I was able to read correctly. The Symbols didn’t read well either.\n\nSeems like more time is being spent with odd fonts then an overall composition.\n\n"
    },
    {
      "time": " 24.Feb.2008 11.36pm",
      "content": "I had the same impression as picard102 regarding odd fonts.\n\nIf the word “basic” is a root of the name, work with that. Make things more basic...simpler. I’d work from the first pair. The rest aren’t doing anything for me.\n\nI’d suggest a less stylized face for “one” in the wordmark and maybe give it a little more room. The symbol version would be more solid with out the “one” element entirely.\n\n"
    },
    {
      "time": " 25.Feb.2008 1.56am",
      "content": "There’s a little too much going on in every single one of your logos IMHO. If I had to choose one, I’d go for the horizontal lettermark under “Original Logo TM 2007”, because it’s the only one I can read. The others are barely readable to me. If you add colour, this effect will become even more disturbing.\n\n[Web Design Portfolio](http://web.archive.org/web/20080821151602/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 25.Feb.2008 11.31am",
      "content": "What the hell is your business? Explain\n\n"
    },
    {
      "time": " 25.Feb.2008 12.15pm",
      "content": "@ picard. The symbols represents “B6 - one” . Yes your right, I spent lots of time on these. But thanks for your critiques.\n\n@dropkick: The word basic is too generic.. and plus I can’t have that name. There are tons of basic(s) brand name out there.. So therefore I did “basix one”.\n\n@Tintin81: True. I guess I need retune the logos. thanks for the critiques.\n\n@Dan Weaver: To answer your question. I do Graphic T-shirts. Streetwear brand.\n\n"
    },
    {
      "time": " 25.Feb.2008 3.00pm",
      "content": "I figured out what it meant, still, spend more time with an overall concept, and less time with bad fonts.\n\n"
    },
    {
      "time": " 25.Feb.2008 4.09pm",
      "content": "What font would you recommend using? These fonts I made are customed.\n\n"
    },
    {
      "time": " 25.Feb.2008 4.26pm",
      "content": "There are countless possibilities. It seems to me you prefer the more unusual fonts though. Maybe have a look at these ones:\n\n ![](http://web.archive.org/web/20080821151602im_/http:/www.typophile.com/files/basix_one_3613.png)\n\nThe 1st one is NeoSans, the 2nd is FF Sari, and the 3rd is Vista Sans.\n\n[Web Design Portfolio](http://web.archive.org/web/20080821151602/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 25.Feb.2008 5.48pm",
      "content": "@Tintin: Yes I do prefer unsual fonts. I don’t like using stock fonts. I like to be creative. This is going to be my street clothing brand name. So I basically create tweak fonts. Anyway.. I’m going to stick to my 3rd concept letter-mark. Which represents strong and bold.\n\n"
    },
    {
      "time": " 25.Feb.2008 6.22pm",
      "content": "A designer once said, in referance to type, the word dog doesn’t have to bark.\n\n"
    },
    {
      "time": " 25.Feb.2008 7.26pm",
      "content": "not to be a dick or anything, but make sure learn how to check your spelling.\n\n"
    },
    {
      "time": " 25.Feb.2008 8.39pm",
      "content": "Hah. Another one bites the dust. No Sir. I’m not here to pick a fight. Have a good day. Peace!\n\n"
    },
    {
      "time": " 25.Feb.2008 8.42pm",
      "content": "Basixone if you are just picking fights you might want to properly construct a sentence. “make sure learn how”?\n\nAs for the logos I prefer the original letter mark but instead of the “one” written like that how about a nice bold 1 instead? I do agree there’s a reason to use some more edgy designs in this case but within reason of course.\n\n"
    },
    {
      "time": " 25.Feb.2008 11.33pm",
      "content": "@tylor: don’t get me wrong.. I like everything I create. Its something I always wanted to collect. But then I can only pick the best one and put it to use. My original letter mark is Trademark. So therefore, I’m thinking of using something better. More simpler bolder feel and sleeker look. Heres one. Let me know what you think.\n\n ![](http://web.archive.org/web/20080821151602im_/http:/www.typophile.com/files/basixoneclothinglogo_4601.png)\n\n"
    },
    {
      "time": " 26.Feb.2008 2.42pm",
      "content": "If it’s on tees, don’t use grey. It won’t show up\n\n"
    },
    {
      "time": " 27.Feb.2008 11.17am",
      "content": "“not to be a dick or anything, but make sure learn how to check your spelling.”\n\nNot to be a dick or anything, but “make sure learn how to” write a sentence, asshole.\n\n"
    },
    {
      "time": " 27.Feb.2008 1.36pm",
      "content": "I love the original design. Might not go too well on a typographyboard but it says “streetwear t-shirts” more than anything else I’ve seen in this thread ^^\n\n"
    },
    {
      "time": " 15.Mar.2008 3.58pm",
      "content": "Hi, I like the name. I keep picturing it in simple block letters enclosed in a vehicle license plate outline. Using the number “6”, but writing out the number (1) one. Best of luck on your brand symbol and venture.\n\n"
    }
  ]
}
