{
  "id": "42454",
  "title": "How much do I tweak nature?",
  "forum": "Design",
  "tags": [

  ],
  "content": "G’day guys,\n\nI’m working on a newspaper with a whole bunch of photos from a variety of sources and so quality varies greatly. Often I wonder if I should leave people alone or whether I should help nature out a bit: removing pimples, whitening teeth and generally make things look a bit more presentable. Is there an unspoken industry standard along the lines of, we do pimples but don’t whiten teeth, we remove stray beard hairs but we don’t take off kilos etc?\n\nIt’s probably important to point out this is a pretty straight newsy newspaper  \nvery curious,  \nthoughts?\n\n—N\n\n [‹ your opinion](http://web.archive.org/web/20081007163817/http:/www.typophile.com/node/42209 \"Go to previous forum topic\") [Web design business logo ›](http://web.archive.org/web/20081007163817/http:/www.typophile.com/node/42593 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007163817/http://www.typophile.com/user/9500\" title=\"View user profile.\">nicholasgross</a>",
  "time": "<br>",
  "uid": "9500",
  "comments": [
    {
      "time": " 24.Feb.2008 10.45pm",
      "content": "Whatever happened to good old _veritas_, eh? Did it fall down a manhole? ;-)\n\nIf I were you I would ask my supervisor. But, after all, you aren’t working for _Vogue_, or _Us Weekly_, right? :-)\n\n"
    },
    {
      "time": " 25.Feb.2008 5.15am",
      "content": "On a personal level i would have thought that the better you make the people in the pictures look the more likely they are to be amenable to a repeat performance if you should ever need it!\n\nWil\n\n"
    },
    {
      "time": " 25.Feb.2008 5.31am",
      "content": "Usually I only tweak photos if it’s something absolutely garish that stands out because the photographer/makeup person botched the shoot. A little foundation/concealer and good lighting is what makes a photo work, retouching is just the last step in that process.\n\nBut if a big zit is particularly distracting, spot healing brush it.\n\n"
    },
    {
      "time": " 25.Feb.2008 10.08am",
      "content": "If it is a newspaper, you must not alter news photos. More than one designer has been fired for doing so. The news is what happened. Someone has a zit, God can remove it, not you. Remember the photog that was fired for adding an additional missile to a photo of an attack in the middle east. He no longer works there. Another controversy was when TV Guide used Oprah’s head and another model’s body ... dunno if heads rolled for that.\n\n"
    },
    {
      "time": " 25.Feb.2008 6.40pm",
      "content": "Fired really? Wow. I take your point and it’s totally fair enough I want to know that when I get news it all happened as is. Hmmm... I’m not talking about making people beautiful in a vanity fair way just removing... hmmm\n\nOK good one, thanks\n\n"
    },
    {
      "time": " 25.Feb.2008 6.47pm",
      "content": "I’d love to hear if everyone who worked on newspapers worked on this principle. Or maybe people would prefer not to say... I’m a newbie at this area of design. It’s probably worth pointing out that it isn’t really hard news like current affairs, international conflicts. that kind of stuff but more community news/newslettery kind of stuff  \nthanks again guys\n\n"
    },
    {
      "time": " 25.Feb.2008 10.32pm",
      "content": "I’ll say it again... When in doubt, ask your supervisor. Surely this newspaper you work for has a policy on the matter, and if it doesn’t, maybe they will start one because of your question. And you don’t own the newspaper, so the decision is not up to you. Also, don’t forget that this forum is called Typophile — you might find more knowledgeable opinions on a blog or forum about news design (for example, [http://www.newsdesigner.com/blog/](http://web.archive.org/web/20081007163817/http:/www.newsdesigner.com/blog/ \"http://www.newsdesigner.com/blog/\")).\n\nLast but not least, I think that what other people have been saying here is pretty much the same: You don’t make people look prettier for a news photo. It’s not fashion photography, and it’s not celebrity photography, nor is it some glossy magazine.\n\n"
    },
    {
      "time": " 25.Feb.2008 11.57pm",
      "content": "[double post sorry!]\n\n"
    },
    {
      "time": " 26.Feb.2008 12.03am",
      "content": "Thanks again Ricardo for your wisdom,\n\nI don’t really have a supervisor as such but I can definitely consult with the newspaper’s editor, and I’m reasonably sure they don’t have a policy on that. Time to make one I guess.\n\nAlso I’m aware of Newsdesigner.com, great site; it’s probably a reasonable assumption to make that there will be a bit of overlap between the news-designing community and type people but, again, good advice.  \nthanks again\n\n"
    },
    {
      "time": " 26.Feb.2008 9.09am",
      "content": "retouching news photos is strictly for supermarket tabloids and propaganda rags.\n\nit’s more important than ever that the public understand that  \nnews (should) = truth, and truth isn’t always pretty.\n\n"
    },
    {
      "time": " 26.Feb.2008 10.49am",
      "content": "Hey, Nicholas,\n\nI guess I didn’t read your earlier comments carefully enough, so I apologize. But even if it’s a community newsletter rather than a newspaper, my feeling is that it is one thing to do color correction or contrast adjustment (perfectly OK) and quite another to remove pimples or blemishes, whiten teeth, etc. (definitely not OK, at least in my book).\n\nCheers and good luck, sir!\n\n"
    },
    {
      "time": " 26.Feb.2008 1.44pm",
      "content": "As a newspaper guy, I can tell you that editing a photo, outside of the range of optimization for print and cropping, is like spitting on the bible.\n\nYou just don’t do it, no matter what your opinion about it is.\n\n"
    },
    {
      "time": " 26.Feb.2008 2.03pm",
      "content": "_outside of the range of optimization for print and cropping,_\n\nThere’s also a bit of design-driven “cheating” on optimization, which you can see by comparing the same shot (as occasionally happens) on the front page of different papers. Typically, there is a figure in the foreground which the editors would like to stand out from the visual noise; so a cropping mask is drawn, and filters applied to the differentiated areas, adjusting blur/sharpness, colour and tone.\n\nThis kind of enhancement, \\*focus\\*, or selection may be compared with the shooter adjusting depth of field to get the subject to stand out.\n\n"
    },
    {
      "time": " 26.Feb.2008 2.25pm",
      "content": "Politicians wear make-up, not to make themselves look better than they really do, but because the lights make them look pale to the point of vampyric, and the camera messes them up in a way I can’t recall.  \nUse that to guide what to edit. That means you may offset the ten pounds the camera adds, and lighten the teeth so they look as white as the do in person, but no more.\n\nSo, basically, remove artifacts if you want, but nothing else.\n\n"
    },
    {
      "time": " 26.Feb.2008 2.52pm",
      "content": "Thanks, this is what I was after,\n\nOK so the colours and the focussing stuff seems OK to me as well. From Nick’s suggestions it seems to be a rule of thumb that anything that could conceivably done (within reason!) in camera is probably OK to replicate in the ’shop. I imagine there is a certain degree of flexibility to be creative with feature stories / analysis but perhaps it needs to say somewhere that it’s manipulated art and it also probably needs to be a significantly and obviously new creation rather then the Vanity fair nip-tuck.\n\nScott, maybe your point gets back to the original question of whitening teeth and removing blemishes. It is true that you can do this with makeup (maybe not the teeth) but it seems that most people so far wouldn’t do this with newsy stories.  \nI still wonder whether the designer can resist the urge to have a quiet tweak...  \nthanks again\n\n—N\n\n"
    },
    {
      "time": " 26.Feb.2008 3.11pm",
      "content": "Can you get the people in person? If yes, see if the photo differs, as correct. I’m not in the biz, but that seems acceptable.\n\n"
    },
    {
      "time": " 27.Feb.2008 8.16am",
      "content": "for the first time ever, and hopefully the last, i’m just going to cut and paste from what i posted earlier.\n\nit’s somewhat disturbing to me that we’re even considering this option.\n\nretouching news photos is strictly for supermarket tabloids and propaganda rags.\n\nas consumers we must navigate thru so much spin doctoring, propaganda, and outright lies, that it’s more important than ever that the public understand that news (should) = truth, not only for it’s own sake but also as a sanctuary from all the “truthiness” out there.\n\nthe news isn’t about pimples or no pimples. leave the pictures alone  \nunless specifically assigned to enhance their clarity.\n\n"
    },
    {
      "time": " 27.Feb.2008 9.20am",
      "content": "There’s plenty of opportunity to skew a story by picture selection, without having to resort to retouching.\n\n ![](http://web.archive.org/web/20081007163817im_/http:/www.typophile.com/files/images_5957.jpeg)\n  \nThis classic example was shot by Doug Ball when Bob Stanfield was running for PM in 1974, and fooling around with the press corps, playing a little ball. There were many shots taken of him making successful plays, but the fumble was deemed newsworthy (not one paper ran a shot of him making a catch), and went down in history, cost him the election.\n"
    },
    {
      "time": " 27.Feb.2008 1.38pm",
      "content": "What if there are dust spots in the photo?\n\nWhen changing lenses outside of a studio environment, you can get a bit of dust in the camera which causes what I would consider unsightly blemishes in the photograph. Do those stay in because it’s how it was shot - or do they get removed because it wasn’t the photographers intention?\n\n"
    },
    {
      "time": " 27.Feb.2008 2.08pm",
      "content": "Ch...the ’news’ isn’t quite as simple as = truth.\n\nIt \\*is\\* reporting, for sure.\n\nThere’s no clear line. The framing and lighting decision from the photographer is ’editing’. Sizing and cropping it for print is ’editing’. Just deciding which shot to use is editing. There’s no such thing as ’pure truth’ short of looking at the event via your own eyes and even that is clouded by your own personal views, time, what you ate for lunch. ;o)\n\nOf course, one should definitely avoid modifying photos in a newspaper in terms of CONTENT. Is a pimple ’content’? I dunno. Go ask your supervisor. ;o)\n\n"
    },
    {
      "time": " 27.Feb.2008 10.27pm",
      "content": "I’ll give you an idea of what I decided to go with for the paper in the end:\n\nPimples and yellowed teeth and eyes, stayed.  \nBits of bark and a hose and tap on the green grass in front of a sparkling new featured building stayed.  \nPens in pockets, also safe.  \nFlaky skin, rests easy tonight.\n\nHowever\n\nColours were brightened, blue casts removed, red-eyed eyeballs reconstructed, date stamps cloned out, pin-pricks of flash glare on skin were blurred, background blurred in one flat, over-exposed small image for an upcoming event item in the noticeboard section, plain colour background added to a head-shot of a regular columnist.\n\n"
    },
    {
      "time": " 27.Feb.2008 10.32pm",
      "content": "The moral of Nick’s story must be, if you are in any kind of public eye, don’t play any kind of sports. There’s a famous tape of our former prime-minister and renowned cricket tragic John Howard bowling a shocking ball into the pitch a few short yards away from his feet. It didn’t lose him the election, his politics took care of that, but it didn’t help.\n\n"
    },
    {
      "time": " 27.Feb.2008 10.37pm",
      "content": "<cite>plain colour background added to a head-shot of a regular columnist</cite>\n\nGood observations on what should or shouldn’t be edited. Anything that is the newspaper’s _art_ is fair game, IMO. Also, depending on context, photography for variety/A&E/humorous sections have a little more leeway in what can and cannot be done.\n\n"
    },
    {
      "time": " 28.Feb.2008 10.52am",
      "content": "yes aluminum you’re right - “truth” may never be absolute and we all know about heisenberg and the observer and the inevitable spin supplied by even the most objective attempts...\n\nbut i think there needs to be an implicit understanding in news media (sorely lacking these days) that what is shown is as close as possible to what was seen.\n\nspin-doctoring, vanity, and general fluffiness are killing this understanding.\n\ni can see where dust and contrast - formal aspects and technical artifacts of the photography process - could need touch-up, but i would draw the line there. pimples, teeth, and other “presentable vanity” items should, imho, be left alone.\n\nwhich is why i prefer not to be photographed for newspapers ! ;)\n\nnicholas’ final list makes sense.\n\n"
    },
    {
      "time": " 28.Feb.2008 2.32pm",
      "content": "<cite>The moral of Nick’s story must be, if you are in any kind of public eye, don’t play any kind of sports.</cite>\n\nAnd if you are a very stupid president, don’t ride a Segway\n\n ![](http://web.archive.org/web/20081007163817im_/http:/www.typophile.com/files/bush_segway_fall_4164.jpg)\n\n(and PLEASE don’t wear short shorts)\n\n"
    }
  ]
}
