{
  "id": "42459",
  "title": "FontLab Studio Ligatures",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I'm currently a student majoring in graphic design--more particularly 3D visualization/animation--but type is an integral part of my daily routine. I decided to involve myself more with the process of creating typefaces to better understand their purpose.\n\nRight now, I'm currently doing my first design off of my handwriting. I figured it'd be an easy exercise as opposed to redeveloping Univers or something. I have all the letters, numbers, symbols, etc., placed and kerned properly so they are writing. The problem I'm having is getting ligatures to work.\n\nTo make clear, I understand the purpose of ligatures and the vast amount of them there can be. Most of the discussions I searched for here on the forum seem to involve those notions in one way or another. My trouble is that when I have f\\_l in Fontlab, when I go to type out fl the ligature does not appear.\n\nThis is most likely due to my own naivety with the program as a novice and was thus wondering if I could get some basic help.\n\nHere is a panagram of what I have, it is fairly close to my handwriting, but I'm interested in adding more 'connective' ligatures like th, letters I commonly hook together.\n\n ![](http://web.archive.org/web/20120415130519im_/http:/typophile.com/files/Hand_6008.jpg)\n\nAny help is very appreciated.\n\n",
  "author": "Hallock",
  "time": "24 Feb 2008 — 11:58pm",
  "uid": "27528",
  "comments": [
    {
      "time": "25 Feb 2008 — 5:34am",
      "content": "What program are you using to test the font - some programs like Indesign allow you to switch ligatures on or off, so you might just have ligatures switched off.\n\nRr\n\n"
    },
    {
      "time": "25 Feb 2008 — 9:17am",
      "content": "Right now I'm just using the quick test in Fontlab Studio.\n\n"
    },
    {
      "time": "25 Feb 2008 — 9:40am",
      "content": "Have you defined your ligatures in a liga feature, compiled the feature, and selected the liga feature in the Opentype features preview?\n\n"
    },
    {
      "time": "25 Feb 2008 — 9:46am",
      "content": "Well of you are testing in Fontlab I think you would use the keybroad for that character, so for the mac shift/alt 5 would give you the fi ligature\n\n"
    },
    {
      "time": "25 Feb 2008 — 11:37am",
      "content": "John, no I don't know how to do that at all yet.\n\nRachel, when I hit that nothing shows up. What is strange is when I export the font as an opentype, InDesign recognizes it and displays the ligatures. Photoshop, however, doesn't recognize it as an OpenType.\n\n"
    },
    {
      "time": "25 Feb 2008 — 6:13pm",
      "content": "You're missing a lot of the basics.\n\nI'm not sure this is the right place to get them, but first of all, have you made an OpenType font, or a PostScript Type 1 font?\n\nFor ligatures to work in OpenType, you have to write a \"feature\" program, as John was describing, then any application that supports OpenType will support the basic features, like automatic ligatures. For Type 1 fonts, some applications programs can be instructed to switch the fi and fl ligatures on, other can't. For programs that don't have a ligaturing switch (Photoshop is probably one) you have to call them directly by a keyboard command.\n\nI haven't tried it but I'd imagine FontLab's \\*preview\\* won't generate the fi and fl ligatures automatically with a Type 1 font. With an OpenType font, yes, if you've written & complied the appropriate feature.\n\nAnother way of making this point is that fonts are now software, and that \"software\" extends beyond just drawing the characters. I think it very wise of you to begin to get a handle on fonts, but it involves more than graphic design.\n\n"
    }
  ]
}
