{
  "id": "42464",
  "title": "Influential Typefaces?",
  "forum": "SoCal Type Fanatics",
  "tags": [
    "SoCal Type Fanatics"
  ],
  "content": "Hi! I'm compiling a list of the 10 most influential classic and contemporary typeface,  \nso far I have produced a list as follows;\n\nClassic typefaces\n\n1. Garamond  \n2. Gill Sans  \n3. Bodoni  \n4. Caslon  \n5. Palatino  \n6. Bembo  \n7. Baskerville  \n8. Clarendon  \n9.  \n10.\n\nContemporary typefaces\n\n1. Avant Garde  \n2. Helvetica  \n3. Bell Gothic  \n4. Franklin Gothic  \n5. Futura  \n6. Optima  \n7. OCR- A  \n8.  \n9.  \n10.\n\nPlease feel free to post your suggestions and any changes you feel necessary\n\n",
  "author": "deano86",
  "time": "25 Feb 2008 — 3:53am",
  "uid": "27544",
  "comments": [
    {
      "time": "25 Feb 2008 — 6:03am",
      "content": "First list: delete Clarendon (of no importance whatever) and add: Sabon, Galliard, and Janson. The first two kicked off the typhoon of new tyefaces in our era--more instant classics since 1970 than in the entire history of movable type until then. And Janson has been a consistent winner in book design, if nowhere else.\n\nYour distinction between classic and contemporary is somewhat pointless: a first-rate new face aims to become a timeless classic, as Sabon and Galliard certainly have.\n\nAnd don't forget to give credit to the foundry ITC, which since the late sixties revived interest in typography as a living growing creative medium open to newcomers, well before digital and Postscript. Adobe moved into a field fertilized and sown by ITC.\n\n"
    },
    {
      "time": "25 Feb 2008 — 7:28am",
      "content": "I'm not sure I would credit ITC with anything other than bastardizing type with oversized x-heights.\n\n"
    },
    {
      "time": "25 Feb 2008 — 12:53pm",
      "content": "ITC did two things wrong: they did bastardize Garamond with a version with really bad proportions and too much x-height, though the condensed form worked nicely. And they wasted their time on a series of text faces actually designed for advertising instead of editorial use, like Berkeley Oldstyle, where the first weight is too light for editorial text and the next weight up is too heavy. Yet we all learned from these mistakes. Denying the importance of ITC in type history is like denying the importance of George Balanchine in ballet.\n\n"
    },
    {
      "time": "3 Jun 2008 — 9:18pm",
      "content": "I'd add Caledonia and Janson to the classic list\n\n"
    },
    {
      "time": "3 Jun 2008 — 9:35pm",
      "content": "I think it only natural to add either Avenir or Gotham (both may be repetitive) to the contemporary list. Then again, Frutiger (the man, myth, legend) could own that list with Univers as well, which I think, needs to be there. I was under the impression that Frutiger (the typeface) was very influential as well. Akzidenz may belong somewhere, and DIN is big too, but I've only been a professional designer for two years, so maybe I don't know fad from movement yet. Consider my suggestions as something for consideration.\n\nI second Caledonia from Robert. Dwiggins Represent!\n\n"
    },
    {
      "time": "3 Jun 2008 — 9:41pm",
      "content": "[http://www.typophile.com/node/31132](http://web.archive.org/web/20150317114104/http:/www.typophile.com/node/31132 \"http://www.typophile.com/node/31132\")\n\n"
    },
    {
      "time": "25 Feb 2010 — 7:45pm",
      "content": "All hail Gotham.\n\n"
    },
    {
      "time": "19 Mar 2011 — 4:57am",
      "content": "Copperplate  \nDidot  \nDin  \nBank Gothic  \nCooper  \nEurostyle\n\n"
    },
    {
      "time": "29 May 2013 — 6:54am",
      "content": "Thanks AzizMostafa!\n\nJohnny..\n"
    }
  ]
}
