{
  "id": "42465",
  "title": "Influential Typefaces?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi! I’m compiling a list of the 10 most influential classic and contemporary typeface, so far I have produced a list as follows;\n\nClassic typefaces\n\n1. Garamond  \n2. Gill Sans  \n3. Bodoni  \n4. Caslon  \n5. Palatino  \n6. Bembo  \n7. Baskerville  \n8. Clarendon  \n9.  \n10.\n\nContemporary typefaces\n\n1. Avant Garde  \n2. Helvetica  \n3. Bell Gothic  \n4. Franklin Gothic  \n5. Futura  \n6. Optima  \n7. OCR- A  \n8.  \n9.  \n10.\n\nPlease feel free to post your suggestions and any changes you feel necessary.\n\n",
  "author": "deano86",
  "time": "25 Feb 2008 — 4:00am",
  "uid": "27544",
  "comments": [
    {
      "time": "25 Feb 2008 — 4:55am",
      "content": "Would that be the contemporary Franklin Gothic that was designed in 1902?\n\nNick Cooke\n\n"
    },
    {
      "time": "25 Feb 2008 — 5:04am",
      "content": "... and is that Palatino the classic typeface designed in the 1950’s? ;-)\n\nI think you’re mixing up most influential with most used.\n\n"
    },
    {
      "time": "25 Feb 2008 — 5:29am",
      "content": "Have you considered Univers?\n\nIt is rather good.\n\nAnd rather important.\n\nWil\n\n"
    },
    {
      "time": "25 Feb 2008 — 6:39am",
      "content": "[http://www.100besteschriften.de/](http://web.archive.org/web/20150415092003/http:/www.100besteschriften.de/ \"http://www.100besteschriften.de/\")\n\nThere should be an English version of the site as well but I somehow can't find it right now.\n\n"
    },
    {
      "time": "25 Feb 2008 — 6:45am",
      "content": "Wouldn't Times make the list? It is overused, but that doesn't mean it was not influential.\n\n"
    },
    {
      "time": "25 Feb 2008 — 7:22am",
      "content": "This is the list from an italian point of view:\n\n1. Minion  \n2. Bembo  \n3. Garamond Simoncini  \n4. Bauer Bodoni (may be also the rare OurBodoni by Vignelli)  \n5. Helvetica  \n6. Gill Sans  \n7. Frutiger  \n8. Dante  \n9. MrsEaves (?)  \n10. Gotham (?)\n\n"
    },
    {
      "time": "25 Feb 2008 — 8:01am",
      "content": "Would serif and sanserif be more accurate categories than classic and contemporary?\n\n"
    },
    {
      "time": "25 Feb 2008 — 8:55am",
      "content": "Walbaum\n\n"
    },
    {
      "time": "25 Feb 2008 — 9:02am",
      "content": "I think both Mrs. Eaves and Gotham are more \"influenced\" than \"influential\". Both are new fonts derived from classic sources. If you want influential, you'd have to consider including Baskerville (which influenced Mrs. Eaves) and Futura (which has influenced a whole lot of contemporary sans including Avenir and Gotham.)\n\n"
    },
    {
      "time": "25 Feb 2008 — 9:05am",
      "content": "You’ve pretty much ignored the Venetian types—that’s a pretty big miss. Akzidenz belongs on that list; maybe even as #10 on the classics. Franklin probably doesn’t belong here, but if it does, it needs to be expanded to cover the entire Franklin, Trade, Lightline, etc. Gothic “family.” Univers and Frutiger are more important than any other modern font on the list. Optima, OCR-A and Bell Gothic? I don’t understand why those would make the list at all.\n\nWhat is the basis for your list?\n\n"
    },
    {
      "time": "25 Feb 2008 — 10:05am",
      "content": "what is the need for lists such as this?\n\npowers\n\n"
    },
    {
      "time": "25 Feb 2008 — 10:11am",
      "content": "oh my god, you are ridiculous, you complete amateur . I find the lack of diverse knowledge in the world of type some what sickening. I think based on that list you should find a new profession my friend.\n\n"
    },
    {
      "time": "25 Feb 2008 — 10:45am",
      "content": "I think that Comic Sans has been incredibly influential, particularly influencing me to vomit whenever I see it.\n\n"
    },
    {
      "time": "25 Feb 2008 — 10:47am",
      "content": "So student Daniel joined typophile to post his incomplete and poorly researched list and Dean joined typophile to rant about it? Not sure which is sadder. Stoke-on-Trent must be a very dull and lonely place.\n\n"
    },
    {
      "time": "25 Feb 2008 — 1:20pm",
      "content": "Serif-serif, there's no need to crap on this thread's creator. It's always fun to swap favorites. First list: delete Clarendon (of no importance whatever) and add: Sabon, Galliard, and, obviously, Times. The first two kicked off the typhoon of new typefaces in our era—more instant classics since 1970 than in the entire history of movable type until then. Sabon and Galliard are the St. Peter and St. Paul of post-metal type.\n\nI question your distinction between classic and contemporary: a first-rate new face aims to become a timeless classic, as Sabon and Galliard certainly have.\n\nAnd don’t forget to give credit to the foundry ITC, which since the late sixties revived interest in typography as a living growing creative medium open to newcomers, well before digital and Postscript. Adobe moved into a field fertilized and sown by ITC.\n\n"
    },
    {
      "time": "25 Feb 2008 — 1:41pm",
      "content": "ITC? Letraset!\n\nDeano, those are not contemporary typefaces, your selections are all pre-digital.  \nThis industry went digital 20 years ago.\n\nI can recommend \"American Type Design & Designers\" by David Consuegra, for its potted history of typography, which provides a good connection between technolgoy and design. You will find that influential designs are often prompted by a change in technology.\n\n"
    },
    {
      "time": "25 Feb 2008 — 9:20pm",
      "content": "mondoB\n\nhow can you say \"Clarendon (of no importance whatever)\"??!\n\nYou're teh problem with this site, you have idiocy posing as fact.\n\nyou;ll just have to ingore him deano mate, he's cleary a bit of a hack.\n\n-----------------------  \nChopper Reid says \"Harden the \\*\\*\\*\\* up\".\n\n"
    },
    {
      "time": "25 Feb 2008 — 10:24pm",
      "content": "Romain du Roi influenced Baskerville who influenced Bodoni and Didot.\n\nThe face for the London underground by Edward Johnston influenced Gill Sans which influenced a number of 20th century sans serif humanist typefaces.\n\nThe roman typeface by Nicholas Jenson is the model for all subsequent roman typefaces.\n\nThe typefaces by Griffo for Aldo Manuzio influenced Garamond.\n\nArrighi's chancery italic has to be considered influential as well.\n\nPlantin's typeface influenced Times New Roman.\n\nJanson typeface by Nicholas Kis influenced Caslon.\n\n¿Could Bell be considered responsible for the XIX century type style?\n\nFF Scala is a \"contemporary\" influential serif face.\n\nMeta is a \"contemporary\" influential sans serif typeface.\n\nHéctor\n\n"
    },
    {
      "time": "26 Feb 2008 — 1:22am",
      "content": "This is clearly the kind of post which will generate an endless string of rants from people who are always passionate in their strong belief of knowing the true truth. I've read a lot of intelligent things up there, altogether with complete crap (according to me, of course). If we are going in the direction offered by Hector, well then the only influential typeface is the first one, for all the other ones have been made after it... Well, I guess I have no choice but to give my own point of view. According to my understanding of the question, my list of typefaces which have \"launched a stylistic / visual trend in typography\", to make it simple, would be:\n\n- Jenson (basically, the first roman type, in 1465)  \n- Alde Manuce's italic (by Manuce and Griffo)  \n- Garamond's Romain (A significant upgrade of Jenson's, Manuce's and Griffo's types)  \n- Grandjean's Romain du Roi (Baskerville and Caslon, though skilled artists, were 100% influenced by this one)  \n- Bodoni (a true landmark which inspired many typographers)  \n- Slab serif (again, a significant upgrade to Bodoni, though it's hard to give a name to a specific type, for they existed as Egyptians before Clarendon was commercialized)  \n- Caslon two-line egyptian (the true influence to all the grotesks of the late XIXe century)  \n- Akzidenz Grotesk (significant improvement to Caslon IV's egyptian, direct influence to Franklin Gothic, Helvetica, Univers et al)  \n- Erbar (direct and aknowledged influence to Futura, which influenced kabel, avant garde, avenir, and the handpainted signs of chicago or new york that influenced gotham)  \n- DIN Mittelschrifft (though not designed in an aesthetic purpose, it influenced a great deal of typefaces)  \n- I have to mention Optima, though it can hardly be considered as an influence to anything: despite its huge success, it is still one of a kind, 50 years after its design.  \n- Syntax (a truely new style at the time, the authentic influence to most of the contemporary typefaces, including Stone's types and FF Meta)  \n- Frutiger (a big improvement on humanistics sans serifs which influence you can see on many contemporary designs, including Myriad)\n\nand, I think, that's all. the remaining types are either truely successful and original, but didnt influence enough types to be named \"influential\" (Eurostile, FF Cocon, FF Dax...), or they just show their parent's eyes or mouth too obviously.\n\nthat of course is open to discussion.\n\ndr\n\nEDIT: I consciously omitted the script typefaces, otherwise I would have no time to work today.\n\n"
    },
    {
      "time": "26 Feb 2008 — 3:41am",
      "content": "I don't believe in the great man theory of history, or the great typeface theory.\n\nWith a little knowledge, one can detect trends, ignore what doesn't fit in, and construct a narrative.  \nWhether this has anything to do with the motivations of type designers is doubtful.\n\nTypefaces are designs which address complex issues to do with technology, page layout, and type culture--not sequels.  \nAll types, that is, that aren't overly plagiaristic.\n\nHaving said that, I've heard that Bodoni thought Baskerville was the shiz.  \nBut what really compelled Bodoni to go mod and neoclassical, and leave behind the Fournier frills of his youth?  \nNo doubt he was blown away by Baskerville's hard metal, smooth paper, and black ink.  \nBut I would imagine that most _contemporary_ typefounders were making the same trip, caught up in the neoclassicism, romanticism and modernity of the era, inspired by revolutions and discoveries, just as we are today. For various reasons, one or two are in the history books, three or four if you're better read.\n\n"
    },
    {
      "time": "26 Feb 2008 — 3:52am",
      "content": "Thanks to everyone who has helped here, this is a great help in my research and i shall consider all of your opinions.\n\n"
    },
    {
      "time": "26 Feb 2008 — 4:12am",
      "content": "Nick: I do not agree with you. I strongly believe that in the large scale, typographers are followers, sometimes they upgrade existing designs with genius, but most of the time, they just follow one's path. I think it's a huge mistake to think that 2, 3, 10 typographers in the world will create a similar kind of type because they are making \"the same trip, caught up in the neoclassicism (...) of the era\". I think they are indeed mainly attracted by the commercial possibilities of having a type which looks a lot like the successful one from \"this other typographer\". You give the example of Bodoni: he always aknowledged Baskerville as his main inspiration, and his early types were very close in the design, but he undoubtedly came to a design on his own some years later that was widely copied after encountering fame and recognition; he spent a lot of his life arguing with Didot for plagiarism, as you probably know. When you say that \"typefaces are designs which address complex issues to do with technology, page layout, and type culture—not sequels\", you are saying a very limited truth, for this is a true definition of, say... 3, maybe 4% of the total amount of typographers out there. In my opinion, that's very idealistic; I am certain that the motives of typographers now and then was much more mercantile, even if their names are Morris Fuller Benton, Frederic W. Goudy, Eric Gill or Adrian Frutiger - this being said with a sincere respect and admiration for their outstanding works.\n\ndr\n\n"
    },
    {
      "time": "26 Feb 2008 — 4:22am",
      "content": "Sorry David, I don't share your cynicism.  \nTo speak of mercantilism in this way is to banalize the craft.  \nSure, we address markets, but in a complex way.  \nAlthough I have said, in another thread, that this is a sleazy business with a lot of plagiarism, I don't subscribe to the elitist idea of the few, 3%-4%, and the many, IMO there is a broad spectrum.\n\n"
    },
    {
      "time": "26 Feb 2008 — 4:25am",
      "content": "Dear Nick,\n\n\"Sorry David, I don’t share your cynicism\"\n\nthis is your right, I am jealous actually.\n\n\"To speak of mercantilism is to banalize the craft.  \nSure, we address markets, but in a complex way.  \nI certainly don’t subscribe to the elitist idea of the few and the many, IMO there is a broad spectrum\"\n\nYou are right, my answer was a simplification of a truth that is probably more complex, but your way of explaining the fact that marketing strategy is out of the frame makes me also cringe. And by no way I intend to banalize the craft: wonderful designs came out of a strictly \"mercantile\" commission, such as Helvetica, Didot or Gill Sans.\n\ndr\n\n"
    },
    {
      "time": "26 Feb 2008 — 5:29am",
      "content": "i consider these as very influential typefaces:\n\narial\n\nbauhaus\n\nbook antiqua\n\ncochin\n\ncomic sans\n\neurostile\n\nhelvetica\n\nrockwell\n\nenjoy....\n\n"
    },
    {
      "time": "26 Feb 2008 — 6:05am",
      "content": "\\>oh my god, you are ridiculous, you complete amateur\n\n\\>very influential typefaces: ...book antiqua ...arial\n\nUm, if you are going to sneer at folks, it is best to have enough knowledge of the field that you don't make ridiculous blunders.\n\nBook Antiqua is a rip-off of Palatino. It was so egregious that it led Hermann Zapf to resign from Atypi. You can read the story [here](http://web.archive.org/web/20150415092003/http:/en.wikipedia.org/wiki/Palatino).\n\nArial has a similar story, which you can read [in Mark Simonson's nice article about it.](http://web.archive.org/web/20150415092003/http:/www.ms-studio.com/articles.html)\n\n"
    },
    {
      "time": "26 Feb 2008 — 6:32am",
      "content": "serif-serif, you have got to be kidding here, i hope its just a provocation.\n\narial... bauhaus... book antiqua... comic sans...rockwell...\n\ni'm gonna quote a contributor whom you know well: \"I think based on that list you should find a new profession my friend.\"\n\ndr\n\n"
    },
    {
      "time": "26 Feb 2008 — 7:24am",
      "content": "<cite>I strongly believe that in the large scale, typographers are followers, sometimes they upgrade existing designs with genius, but most of the time, they just follow one’s path.</cite>\n\nTypesetters are often followers, but not type designers. Type designers are constantly pumping out radical new stuff. It’s the typesetters who hold back change by treating their readers as morons who should only be expected to read the lowest common denominators and labeling anything that departs from the familiar as “display” type.\n\n"
    },
    {
      "time": "26 Feb 2008 — 7:40am",
      "content": "Whoa there James. The concept of \"display\" and \"text\" faces comes from an era probably before you were born, where you actually ordered them from different compositors. Display type was set in strips and intended for headlines and titles and such. Text type was set in galley form and intended for body copy. They have very different functions, at least when it comes to book design.\n\nThe same font can exist both in \"text\" and \"display\" form, such as H&FJ Requiem or Perpetua.\n\nAs one who will be needing reading glasses very soon now, I appreciate the difference between thoughtfully set text faces for reading copy, and display faces to add character. The morons are the designers who think there is no difference between display and text faces and who try to foist unreadable text on their poor suffering readers.\n\n"
    },
    {
      "time": "26 Feb 2008 — 10:09am",
      "content": "Amen!\n\n"
    },
    {
      "time": "26 Feb 2008 — 10:34am",
      "content": "And I should add that all this display and text type was VERY EXPENSIVE. Which meant that if you screwed up you often had to live with it. Also meant hours messing around with a xerox machine and an x-acto to make sure your type choices were the right ones before you ordered it. Display type was priced by the word so we used to cheat by making up words out of our initial caps to save money.\n\nText type involved copyfitting, character counts, etc. If you wanted to make an inset for a photograph you had to specify how many lines, and copyfit around it.\n\nBut I'm way off topic here.\n\nOn topic: I do think Clarendon is influential (in response to whoever said it isn't). There are a lot of slabs that came out of the Clarendon mold.\n\n"
    },
    {
      "time": "26 Feb 2008 — 10:38am",
      "content": "Tell it! Clarendon good!\n\nI’m loading the 4\" film now so if anyone needs to que…\n\n"
    },
    {
      "time": "26 Feb 2008 — 10:47am",
      "content": "Right now, Fleischmann is looking very influential....\n\n"
    },
    {
      "time": "26 Feb 2008 — 12:53pm",
      "content": "_your way of explaining the fact that marketing strategy is out of the frame makes me also cringe._\n\nDifferent foundries have completely different strategies for productization.  \nAfter all, there's a world of difference between the three main sectors of font production (megacorps, asset-holders, and independents.)  \nOn the corporate side, Linotype is very much driven by the strategy of leveraging its brand assets.  \nThen there's Ale Paul, combining his penchant for scripts with Veer customers' insatiable appetite for them.  \nHouse and Diner have been driving the script market as much as following it, synergy.\n\nMy retail sales would be stronger, no doubt, if I turnedd out a few more script fonts, but like many independent designers I compromise between doing what interests me and what I \\*think\\* will sell. But who knows what will sell until it's been designed, produced, and put on the market? So what I do is follow my nose, developing ideas that interest me, and trying to move them into directions that I anticipate will be useful, in other words, that people will buy.\n\nYeah, I've noticed the Fleischmann thing, and it's certainly influenced me--to do the opposite!\n\n"
    },
    {
      "time": "26 Feb 2008 — 1:13pm",
      "content": "Patty, I’m wasn’t referring to people who might put as much thought into it as you did. I was referring to people who lump anything but the “classics” into the dustbin of display/decorative/novelty and ignore it.\n\n"
    },
    {
      "time": "26 Feb 2008 — 1:49pm",
      "content": "[offensive comment removed by moderator]\n\n"
    },
    {
      "time": "26 Feb 2008 — 2:06pm",
      "content": "Daniel, this is not acceptable.\n\n"
    },
    {
      "time": "26 Feb 2008 — 2:10pm",
      "content": "James, I am sure there are plenty of people who get their terminology wrong, but at the same time there are lots of designers who use more traditional display fonts for text and vice versa. Not that it can't be done (and done well) of course. David Carson famously broke all the rules and that needed to happen, but his followers often tried to emulate him without really understanding what he was doing. There is a general blurring of the two with the computer, and I am not sure a lot of the students and younger members of this forum necessarily know where the terms come from.\n\n"
    },
    {
      "time": "26 Feb 2008 — 2:17pm",
      "content": "\\>When you say that “typefaces are designs which address complex issues to do with \\>technology, page layout, and type culture—not sequels”, you are saying a very limited \\>truth, for this is a true definition of, say... 3, maybe 4% of the total amount of \\>typographers out there.\n\nYes, but all the others follow those 3%\n\n\\>\\>oh my god, you are ridiculous, you complete amateur\n\n\\>\\>very influential typefaces: ...book antiqua ...arial\n\n\\>Um, if you are going to sneer at folks, it is best to have enough knowledge of the field that you don’t make ridiculous blunders.\n\n\\>Book Antiqua is a rip-off of Palatino. It was so egregious that it led Hermann Zapf to resign from Atypi. You can read the story here.\n\n\\>Arial has a similar story, which you can read in Mark Simonson’s nice article about it.\n\nWhile that is true, I would contest that the copies can have had a greater influence, as a multitude can be inspired by something made by a man who is the only one to take inspiration from another work.\n\nI would say that Optima can go with Gill Sans and Johnston as one of the originators of humanist sans (and yes, I know Gill is partly based off John). They caused type designers to think outside of the geometric framework, and made people start thinking about making sans with the same thoughts as serifs. Optima might have had an even greater influence in this respect due to just how many pieces in broke the mold into (it is probably still the most obviously humanist font ever). While I am not a font historian, I can quite confidently say that typographers took one look at it and said \"holy sh-t, that actually works!\"\n\nI would have to say that TNR is probably a good idea to include, as it is probably the default that stays in the minds of most designers simply due to its omnipresence.\n\nVerdana should probably also be included, not because its form is influential, but because the way it was designed set the stage for modern designing (at least for the screen, which is why it takes precedence over Georgia).\n\n"
    },
    {
      "time": "26 Feb 2008 — 3:19pm",
      "content": "Perhaps Hermann Zapf thought Optima was \"the better Stella\" in the way that Adrian Frutiger considered Avenir \"the better Futura\".\n\nOr perhaps someone at Linotype said, \"Hermann, we need a sans\".\n\nOr perhaps it's a transcription of ancient stone-carved lettering.\n\nOr perhaps Zapf thought \"Ha--this'll give August [Rosenberger, his punchcutter] a fit!\"\n\nOr perhaps all four and more--the theory being that designs materialize when two or more congruent ideas (memes) coincide and fall into place, illuminating one another with a touch of synergy, creating meaning.\n\n\\*\\*\\*\n\nAnd Melior is the better Optima?!\n\nI've set out on several occasions to create a news text face that is \"a better Utopia\", with something that looks not much like it, but with the same character count and apparent size. I suppose I could have used Charter or some other benchmark, but I had one client who commissioned me to design a face to replace Utopia, so that's the one it's been. An example of momentum, ubiquity breeds ubiquity.\n\n"
    },
    {
      "time": "26 Feb 2008 — 4:19pm",
      "content": "Dean, you might be categorizing these more as \"fonts that look old\" and \"fonts that look new.\"\n\nIf you want to look at influential fonts of the contemporary period vs. influential fonts of the \"classic\" period, you need to look at what the creators of these fonts were trying to accomplish. Two fonts that I think were very influential on contemporary type design, for example, are PMN Caecilia and Syntax, because they brought humanist elements into the world of slab serif and sans serif type. Of course, you can trace this idea back to older typefaces like Optima, and you start to get a picture that there's a slow process of evolution at work in the history of type, and things rarely pop out of nowhere.\n\nIn terms of \"classic\" fonts, you might want to come up with a different way to describe these, because \"classical\" typefaces often refer to a specific period in type design.\n\nThe more you study type, the more it becomes apparent that classifications are, at best, a way for us to hold a public converation about type, just like the music store has to file everything under a genre, even if it doesn't fit. All that is to say, do you think this exercise will help you in any way?\n\n"
    },
    {
      "time": "27 Feb 2008 — 12:39am",
      "content": "just a little edit: Nick, it's Stellar, not Stella... this is a typo i guess.\n\ndr\n\n"
    },
    {
      "time": "27 Feb 2008 — 9:06am",
      "content": "Yes, I always get that muddled, thanks to the Dave Farey/Richard Dawson revival, which for some reason I think changed the name, but didn't!\n\n"
    },
    {
      "time": "27 Feb 2008 — 9:16am",
      "content": "Thanks, FeeltheKern, for reminding us of how influential Syntax was for years--all the new sans type designs that followed that lead...certainly the best index of influence. And then Gill Sans seemed to follow Syntax as the must-emulate model for new sans designs...\n\n"
    },
    {
      "time": "27 Feb 2008 — 9:32am",
      "content": "I designed a humanist sans in the early 1980s, when there weren't many around.  \nI certainly thought of Gill Sans as a precedent, and didn't pay any attention to Syntax.  \nHowever, I had been studying calligraphy at that time, as a means of getting inside the cheirographic soul of the typographic tradition, and I think that influential idea may have been \"in the air\" at the time -- no doubt reinforced by the presentation of Hermann Zapf's calligraphy in the trade media, as being an important part of his method.\n\n"
    },
    {
      "time": "27 Feb 2008 — 9:39am",
      "content": "MondoB, I covered that point with my reference to Optima. If I was talking about the 90s, I wouldn't bring up Helvetica, I'd talk about Meta.\n\nOf course Syntax was born out of Gill Sans, but I'm talking strictly about contemporary faces. Syntax had a certain sense of modernity that you don't see in Gill Sans, and it touched off a whole new interest in humanist sans.\n\nA good example of this today is Galaxie Polaris [http://vllg.com/Village/GalaxiePolaris/](http://web.archive.org/web/20150415092003/http:/vllg.com/Village/GalaxiePolaris/ \"http://vllg.com/Village/GalaxiePolaris/\"). This obviously owes a lot to Helvetica -- a lot of people would not be able to tell the difference -- but it has a feeling of \"nowness\" that has maybe evaporated a bit from Helvetica. The same could be said for Kai Bernau's Neutral.\n\n"
    },
    {
      "time": "27 Feb 2008 — 9:51am",
      "content": "Thanks Nick, that's what I'm trying to get at but didn't say very well. These trends in design aren't a concerted effort. They just happen as type designers see gaps in the type library and fill in the hole with similar solutions. Syntax and PMN Caecilia are just two good examples of large trends in the 80s and 90s -- they were very popular, and embodied the idea of humanizing seemingly cold and stark slab serif and sans serif typefaces.\n\nI'm sure if you went back in time and told the heads of type foundries 100 years ago what type they'd be remembered for, there'd be quite a few that were obvious to them, and quite a few that pissed them off.\n\n"
    },
    {
      "time": "27 Feb 2008 — 10:01am",
      "content": "_Syntax had a certain sense of modernity that you don’t see in Gill Sans, and it touched off a whole new interest in humanist sans._\n\nLike I said, I don't buy that theory, which is a connect-the-dots, post-facto application of simplistic narrative-style history, operating from face to face. I don't thin type design works like that, I certainly don't.\n\nGill Sans was released in the 1920s, Syntax in the 60s. If they were so influential, how come there was no bandwagon or critical mass of humanistic sans faces emerging until the 1980s?\n\nI recall Shannon (1982) as another face that I noticed when I was doing Shinn Sans, and paid more attention to it than Syntax, as it was, indeed, a contemporary face. I didn't really think about Frutiger, it was just too sublime to get a handle on!\n\n"
    },
    {
      "time": "27 Feb 2008 — 10:05am",
      "content": "_They just happen as type designers see gaps in the type library and fill in the hole with similar solutions._\n\nGood point, although it begs the question of why one would notice a particular gap, or whether some effort is required to imagine gaps into existence.\n\n[Our last posts crossed.]\n\n"
    },
    {
      "time": "27 Feb 2008 — 10:33am",
      "content": "Nick -- I totally agree that the deeper you get into the history of anything, the more it shows no clear narrative with starting points and ending points. I hinted at that a bit with my original response, where I said \"...you start to get a picture that there’s a slow process of evolution at work in the history of type, and things rarely pop out of nowhere.\" Of course, we're also talking about Top 10 lists in the original post, so I don't think we can have that serious of a discussion :)\n\nMaybe Syntax is debatable, in terms of being the \"epitome\" of a certain typographic grouping -- it doesn't neatly stand out as an achievement of anything in a historical sense. You could say the same of Helvetica, although Helvetica is clearly omnipresent while Syntax is present, but by no means deserving of omni- status.\n\n"
    }
  ]
}
