{
  "id": "42485",
  "title": "Movable Type Question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello,\n\nI’m trying to find an answer to a question pertaining to movable type. I’ve looked all over the internet but I can’t seem to find a definitive answer, so I’m hoping someone here can help. The question is “What sizes were lead type available in?”. Any help would be greatly appreciated.\n\nThanks,  \nJustin K.\n\n [‹ ATF ligatures and contextual features](http://web.archive.org/web/20080828112654/http:/www.typophile.com/node/42563 \"Go to previous forum topic\") [Happy birthday, Tiffany! ›](http://web.archive.org/web/20080828112654/http:/www.typophile.com/node/42514 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080828112654/http://www.typophile.com/user/27565\" title=\"View user profile.\">Justin K.</a>",
  "time": "<br>",
  "uid": "27565",
  "comments": [
    {
      "time": " 25.Feb.2008 12.11pm",
      "content": "Nonpareil, Minion, Brevier, Long Primer, Pica, English, Columbian, Paragon....and others.\n\nBasically, it went like this 3,4,5,6,7,8,9,10,11,12,14,16,18,20,22,24,28 until 30 points, after that, it was mostly wood type.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080828112654/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 25.Feb.2008 12.21pm",
      "content": "Moveble Type existed before the era of international standardization so specific agreed upon standards did not exist at the outset. Standards eventually came into being once printing became more widespread and foundries started to sell type but still varied amongst regions. Hence arcane names such as Brevier, Nonpareil, etc. did not necessarily translate from one place to the next.\n\n"
    },
    {
      "time": " 25.Feb.2008 12.36pm",
      "content": "<cite> it went like this 3,4,5,6,7,8,9,10,11,12,14,16,18,20,22,24,28 until 30 points, after that, it was mostly wood type...</cite>\n\nMaybe so, but generally speaking, in the twentieth century, it was a little more limited than that. At least in my experience. The common sizes included 6, 8, 10, 12, 14, 18, 24, 30, 36, 48, 60, and 72...all available in lead.\n\nI happen to have some 16 pt and 54 pt type, but I wouldn’t consider them common.\n\nThis is good to keep in mind if you’re designing a publication that is supposed to have a retro or throw-back feel.\n\n21.5 pt type? No such thing!\n\n"
    },
    {
      "time": " 25.Feb.2008 1.08pm",
      "content": "Incomplete, and probably not accurate, but fun none-the-less...\n\n[http://www.microsoft.com/typography/glossary/ch6.htm](http://web.archive.org/web/20080828112654/http:/www.microsoft.com/typography/glossary/ch6.htm \"http://www.microsoft.com/typography/glossary/ch6.htm\")\n\n"
    },
    {
      "time": " 25.Feb.2008 1.26pm",
      "content": "Here is an excellent type chart of common sizes and their names as used across the globe.  \n [http://www.paratype.ru/pictures/help/term/typometr2.gif](http://web.archive.org/web/20080828112654/http:/www.paratype.ru/pictures/help/term/typometr2.gif \"http://www.paratype.ru/pictures/help/term/typometr2.gif\")  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080828112654/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 25.Feb.2008 1.36pm",
      "content": "Большое спасибо, Ivan,\n\nthis is priceless!  \nF\n\n"
    },
    {
      "time": " 26.Feb.2008 5.30am",
      "content": "ATF offered a few of their headline typefaces in sizes larger than 72 — 84, 96, and 120 pt.\n\nI think the largest size commercially cast in lead type was the 288-point Stymie Compressed, which was too large to cast in a typical type mold and was actually cast horizontally in smaller molds.\n\n— K.\n\n"
    },
    {
      "time": " 27.Feb.2008 6.26am",
      "content": "BIG TYPE!! Ludlow, Lino, ATF\n\nLudlow made some huge type. Their biggest was “240 Point (Title) Ludlow 3-BEC Bodoni Campanile Advertising Figures”. The figures are about 19 picas tall. They also made this face and some others in 144, 120, and 96. The interesting thing about these is how they are cast. The comp uses the same stick as for any other Ludlow face. But instead of inserting mats along the length of the stick, assembling words just as a foundry type compositor would, these faces are cast one character per slug. The mats are set into the stick in the long direction. The resulting slugs are then assembled into a price.  \n The fonts consisted of one mat for each figure, a dollar sign, a period, and a comma. A pound mark was available in the UK. The largest sizes were often used for dollar amounts, with smaller sizes used for the cents, elevated so the tops of the figures aligned.  \n Ludlow was proud of these large mats. Here’s their description of the mats for one face: “The matrices for 144 point Ludlow Gothic Extra Condensed Advertising Figures are engraved in solid blocks of brass and are practically indestructible.” They are wonderful artifacts of the age of metal type.\n\nLinotype had the same sort of system, called the A-P-L, or All-Purpose-Linotype. It was basically an adaptation of the Ludlow system described above. I never ran one, so I’m not sure if regular Lino mats could be run in this hand-assembly fashion, or if only the special A-P-L mats could be used.\n\nIn my San Francisco printing shop years ago I had some of the ATF Caslon 540 in those 84, 96 and 120 point sizes Kent speaks of. One knew one was setting type when working with those sorts.\n\npowers\n\n"
    },
    {
      "time": " 27.Feb.2008 1.33pm",
      "content": "Well, the sizes of a lead fonts first of all depend on the country it is used.  \nYou guys from anglo-american countries use Pica Point.  \nAnd e.g. you have a 18 p size. What the Didot Point - used in Germany e.g., don’t have.\n\nPica point:  \nhttp://en.wikipedia.org/wiki/Pica\\_(unit\\_of\\_measure)\n\nDidot point:  \nhttp://en.wikipedia.org/wiki/Point\\_(typography)\n\nIn Germany and several other european countries with exception of UK we know:\n\n3/6 p very rare  \n4/6 p rare  \n5/6 p rare  \n6 p (Nonpareille)  \n7/8 p  \n8 p (Petit)  \n9/10 p  \n10 p (Korpus)  \n12 p (Cicero)  \n14 p (Mittel (middle))  \n16 p (Tertia)  \n20 p (Text)  \n24 p (2 Cicero)  \n28 p (Doppelmittel (double middel))  \n36 p  \n48 p  \nThat’s the standard.  \nThe names in brackets are more or less a kind of slang. E.g. Nonpareille is a french word for “not possible to built smaller”. But in Germany its not pronounced real french. Its more... slangy..\n\nWhat I feel strange for is, if I see you digital guys work with e.g. 9.6 p size or so... As a lead letter typograph I’ld never ever use e.g. 11 p (there is no, but if, I won’t.\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    }
  ]
}
