{
  "id": "42500",
  "title": "Class 1 Driving Training School Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’ve been lurking for a while and haven’t really had much to post but I’m working on a new logo for a Class 1 training school. Smaller business needing a bit of a logo update. So here’s what I have so far and the original. More looking for ideas for the typeface; placement sizing and all but suggestions and comments on the mark are fine too. Thanks.\n\n ![](http://web.archive.org/web/20080906160900im_/http:/typophile.com/files/freeeagle-logo_5208.jpg)\n\nPS. I realized it resembles Ferrari’s logo a bit (slab serif under image of animal) which was totally unintentional.\n\n| Attachment | Size |\n| --- | --- |\n| [freeeagle-original.jpg](http://web.archive.org/web/20080906160900/http:/typophile.com/files/freeeagle-original.jpg) | 155.09 KB |\n\n [‹ Eight Zero](http://web.archive.org/web/20080906160900/http:/typophile.com/node/44042 \"Go to previous forum topic\") [casting a critical eye... ›](http://web.archive.org/web/20080906160900/http:/typophile.com/node/44177 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906160900/http://typophile.com/user/25880\" title=\"View user profile.\">tylor.reimer</a>",
  "time": "<br>",
  "uid": "25880",
  "comments": [
    {
      "time": " 25.Feb.2008 5.25pm",
      "content": "When I first saw this, I was reminded of a teenagers’ clothing shop. Considering it’s about training truckers to drive, try to pursue a more “proud to be an American” tack. The type should have more of a country western feel to it, I think (think “Cracker Barrel”).\n\n"
    },
    {
      "time": " 25.Feb.2008 5.45pm",
      "content": "Ironically it’s not an American company, it’s Canadian, heh but maybe that point is still applicable. I’m not sure how they’d feel about too much of a western feel but I could play around with it. I was thinking a little more classy and corporate looking than that.\n\n"
    },
    {
      "time": " 26.Feb.2008 6.57am",
      "content": "freeeagle is going to be a hard URL to type. ;o)\n\nI’d maybe play with some slightly more modern sans to go with it if you’re aiming for the ’corporate’ look. It’ll also help move it away from the American vibe.\n\n"
    },
    {
      "time": " 26.Feb.2008 2.09pm",
      "content": "Yes the URL is difficult to type as you have to keep hitting the ’e’ so many times. The thought of using a sans crossed my mind but I feel it might not look as strong. Any suggestions on some faces to try out? I will have to play around with combinations of loose light text vs tighter heavy text.\n\n"
    },
    {
      "time": " 26.Feb.2008 2.23pm",
      "content": "With that angular logo, I’d recommend one of the House United fonts, H&FJ Acropolis (or any of their Proteus fonts), or else I’d go with a brushy script.\n\n- Lex\n\n"
    },
    {
      "time": " 26.Feb.2008 7.53pm",
      "content": "1.) The name is odd to me in that I can hardly imagine a captive eagle. Would they ever drop “free” or consider an alternate name?\n\n2.) Looking at the line quality in the wing and elsewhere I might try transforming the edge into a recognizable tire tread pattern. This is cliché, but look where this all started.\n\n3.) On the type? Maybe something like [Swift Black Condensed](http://web.archive.org/web/20080906160900/http:/www.myfonts.com/fonts/linotype/swift/black-condensed/).\n\n4.) The eagle claws look odd—maybe too much detail?\n\n"
    },
    {
      "time": " 26.Feb.2008 8.23pm",
      "content": "Lex: Thank you, I’ll look into those faces.\n\njupiterboy: 1) Likely not. I’m also curious the origin of the name but I have to work with it 2) That’s a possible idea. Would tie in a bit of the driving part. 3) I’ll check it out, thank you. 4) I agree they seem to be a little fine when compared to the rest.\n\n"
    },
    {
      "time": " 27.Feb.2008 9.29pm",
      "content": " ![](http://web.archive.org/web/20080906160900im_/http:/typophile.com/files/Ultra_donE_6065.jpg)\n\nI think it has already been done, no?\n\n"
    },
    {
      "time": " 27.Feb.2008 11.52pm",
      "content": "Hiroshige: I’m not exactly sure what you’re getting at. What’s been done before? Having an eagle for a logo? There have been countless companies with eagles for their logos. I don’t feel that mine shares much in common with that one.\n\nHere’s a little update on the type. Is this going in the right direction?\n\n ![](http://web.archive.org/web/20080906160900im_/http:/typophile.com/files/freeeagle-logo2_6193.jpg)\n\n"
    },
    {
      "time": " 28.Feb.2008 2.24am",
      "content": "I think this type choice is much better.\n\nSharon\n\n"
    },
    {
      "time": " 28.Feb.2008 7.55am",
      "content": "I think you are well aware of what I’m getting at tylor, that that expression has been done before. And if the owners of the driving school are aware of Ultramar’s mark, then I would hope that they would be wanting something ’more’ original than what your effort is trying to express for _their_ company.\n\nTo me, your effort is either an intentional blurring of the Ultramar automobile service station mark and your driving school mark, or perhaps just by chance the two expressions are very much alike.\n\nEither way, I hope the driving school as a seperate and privately owned company will push for their own identity. Which in turn will push your _own_ creativity.\n\n"
    },
    {
      "time": " 28.Feb.2008 8.01am",
      "content": "I’m not to crazy about the font choice on “Driver Education LTD”. Mixing serif fonts isn’t usually a wise design choice. Perhaps a sans serif for contrast would be more suitable. I’d also make it slightly shorter in line length than “FREE EAGLE” to balance your image on top better and to help direct the eye towards “FREE EAGLE” more so.\n\n"
    },
    {
      "time": " 28.Feb.2008 8.01am",
      "content": "<cite>I can hardly imagine a captive eagle. Would they ever drop “free” or consider an alternate name?</cite>\n\nFreebird?\n\n"
    },
    {
      "time": " 28.Feb.2008 9.42am",
      "content": "Hiroshige: First of all I’ve never seen the Ultramar logo before so it’s definitely not intentional. I did extensive studies on eagles and this pose is far from unseen. I felt it was a strong enough posture without being completely aggressive as seen in a hunting/fishing posture. I did a lot of sketching before coming up with this one. I had some ideas for doing just a head but that’s been done (USPS) and didn’t want it to be too abstract either.\n\nAsvetic: Well it’s not really “mixing” as they are the same typeface” but I will try using a sans. I’ll see if I can find a nice complementary face. As stated before I don’t think a name change is possible. Name’s been around for around 10 years and I’m not sure the client is too huge on a completely new logo direction either but I think what I have so far isn’t too extreme.\n\nI’m still open to ideas and will try to incorporate some. I just know some of the ideas may not fly so sorry for my hesitance.\n\n"
    },
    {
      "time": " 28.Feb.2008 10.00am",
      "content": "<cite>Well it’s not really “mixing” as they are the same typeface”</cite> My apologies, I didn’t realize it was the same font (the extended leg of the R didn’t match up.) I still think you should considering changing just “Driver Education LTD” to a sans serif.\n\nKeep up the good work.\n\n"
    },
    {
      "time": " 28.Feb.2008 11.11am",
      "content": "I still think you should look at a pic of an eagle’s feet. The feet in the logo look like human hands.\n\nI also keep looking at the original logo. So kitsch, and it does say trucking. I think I miss the truck.\n\n"
    },
    {
      "time": " 28.Feb.2008 11.15am",
      "content": "James is right about the claws. They need help. (And I know what he means about the kitschy original. The truckers I know love their trucks!)\n\nThat said, I like the logo you’ve made. I think it will work well. Very well done.\n\nSharon\n\n"
    },
    {
      "time": " 28.Feb.2008 2.18pm",
      "content": " ![](http://web.archive.org/web/20080906160900im_/http:/typophile.com/files/Fly_like_an_eaglE_6502.jpg)\n\nTylor, a different expression would greatly improve the mark. Also, consider using the bird’s wing span to help emphasis the expression of ’Free’. By appling your idea of white head and neck plummage on the tail feathers as well will help enhance the wing span.\n\nGood luck.\n\n"
    },
    {
      "time": " 28.Feb.2008 2.31pm",
      "content": "Well don’t I feel like the jingo? But as an American, it’s hard for me not to connect “free” and “eagle” with “American.” (Curse you GWB!!!)\n\nI want to second Hiroshige’s suggestion for a wider wingspan ... that’s what was in the original, and while needing refinement, it worked well.\n\nYour second font choice is much stronger.\n\n"
    },
    {
      "time": " 28.Feb.2008 8.53pm",
      "content": " ![](http://web.archive.org/web/20080906160900im_/http:/typophile.com/files/freeeagle-logo3_3932.jpg)\n  \nOk I’ve been tweaking the eagle a bit, tried to address the feet issue. Plus some other minor stuff that was bugging me. I think I still have some work to do on it such as the feet now maybe don’t look as “casual” as you’d expect with the words free.\n\nI will try out a more “soaring” eagle for the sake of trying it out. We’ll see how it turns out.\n\nAlso I have used a sans face now on the lower part. How does this typeface look? Better suggestions?\n\nThank you all for your comments and suggestions.\n\n"
    },
    {
      "time": " 29.Feb.2008 6.00am",
      "content": "Myriad being a humanist sans has a lot of character. I was thinking of more along the lines of a Gothic that would accentuate your font choice for FREE EAGLE instead of competing with it. FREE EAGLE is the most important part of this logo. DRIVER EDUCATION LTD is just a description of what service FREE EAGLE performs.\n\nThis is Freight Sans, but you could use any gothic sans like Trade Gothic, Franklin Gothic, Avenir, Gotham...\n\nI also reduced the size of DRIVER EDUCATION LTD, again so it doesn’t compete with FREE EAGLE but in fact accentuates it.\n\n ![](http://web.archive.org/web/20080906160900im_/http:/typophile.com/files/FREEEAGLE_5301.gif)\n\n"
    },
    {
      "time": " 29.Feb.2008 7.20am",
      "content": "Asvetic: Very nice edit. I’m still learning continually about typography and design and had this strange idea that I had to use two fonts together that were almost identical just one being sans and the other serif. I’m still unsure of how the relationship between two fonts that go well together is but certainly like this idea. Secondly I didn’t think of making it smaller like that and having it NOT line up with the edges of the “FREE EAGLE” but I think that seeing as Free Eagle is the name of the company and Driver Education LTD just describes what they do it’s a very nice adjustment.\n\nI will continue to update and tweak this until there are no further adjustments needed.\n\n"
    },
    {
      "time": " 29.Feb.2008 7.28am",
      "content": "Notice how the cap height of the sans is right at 1/4 or so of the cap height of the main text, and the space between is right at the cap height of the sans. These repeated proportions look very ordered and give that sense of not questioning the size or placement.\n\n"
    },
    {
      "time": " 29.Feb.2008 7.29am",
      "content": "A lot of design hinges on the execution of rhythm and balance. Anyone can design, but those that master the subtle elements of design, rise above the masses.\n\n"
    },
    {
      "time": " 12.Apr.2008 8.22pm",
      "content": "It’s been a long time since I posted here but I’m hoping I can still get some help. I went in quite a new direction and this thing has been sitting around for a while. I’m trying to wrap it up as the client wants to start using it for some stuff. Any final suggestions? Sizes, placement, other? You guys have been very helpful so far. Thank you.\n\n ![](http://web.archive.org/web/20080906160900im_/http:/typophile.com/files/freeeagle-logo_4088.jpg)\n\n"
    },
    {
      "time": " 14.Apr.2008 5.54am",
      "content": "Now that’s a FREE EAGLE soaring gracefully!\n\nI’d suggest either shrinking “FREE EAGLE” and the subheader slightly. There’s a bit of competition between the image and the text that’s unsettling.\n\nI am not a fan of the colors however. The seagreen and yellow don’t work for me. I can’t think of anything right now, but would recommend watching a sunset to get some inspiration.\n\n"
    },
    {
      "time": " 14.Apr.2008 6.13am",
      "content": "For it to be a free eagle I would like to see it not bound by being centred, up and to the left seem a better placement or maybe range the type left on three lines with the icon off to the right, to nit-pick I prefer the form of the tail feathers, with a squarish end than the pointed wing feathers which aren’t so ‘eagle-like’. Overall the proportions of type to image isn’t quite working for me, especially the sans for small use.\n\nTim\n\n"
    },
    {
      "time": " 14.Apr.2008 7.18am",
      "content": "_to nit-pick I prefer the form of the tail feathers, with a squarish end than the pointed wing feathers which aren’t so ‘eagle-like’_\n\nthought the pointed feathers work well with the triangular serifs, IMO.\n\n"
    },
    {
      "time": " 14.Apr.2008 9.42am",
      "content": "Have you tested your design? What’s the smallest size it will be used? Does it still read? Does it work in Black and White? Remember clients can ask you to do an assignment and then come back to you with another totally different direction.\n\n"
    },
    {
      "time": " 14.Apr.2008 10.55am",
      "content": "It has been very satisfying to observe the development of this project. The above posts give great pointers for refinement, but I think you’ve got it. Great work.\n\n—-  \nNick Hladek\n\n"
    }
  ]
}
