{
  "id": "42506",
  "title": "Desktop laser printer for high quality text",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I realize this is a bit of a tangent from usual topics, but printers were discussed here a few times before and it seems like a good place to ask.\n\nWhat's a good SOHO laser printer for high quality B&W text printing? I'm not a pro, but I do a fair bit of DTP-like stuff and low-volume document printing would benefit from better-than-inkjet quality output.\n\nI have been looking at 1200dpi printers in the $300-$400 price bracket but print quality leaves much to be desired. For example, sample prints done on a Brother HL 5240N show that the printer rasterizes text at around 200dpi. The result is unacceptably jagged output that looks awful compared to something done on a nine year old 600dpi laser. I don't know where to look from here as the 5240 got top marks for text quality from various review outfits, even in competition with higher end printers.\n\nWhat are people around here using for low volume B&W text output that doesn't look like sandpaper?\n\nThanks\n\n",
  "author": "Typophobic",
  "time": "25 Feb 2008 — 9:43pm",
  "uid": "27579",
  "comments": [
    {
      "time": "26 Feb 2008 — 2:22am",
      "content": "I have the HP P2015 and it's great. 1200 dpi and eight seconds from print to first page from standby.\n\n"
    },
    {
      "time": "26 Feb 2008 — 9:43am",
      "content": "But don't HP printers use a reverse-engineered clone rip instead of genuine Adobe PostScript?\n\n"
    },
    {
      "time": "26 Feb 2008 — 9:54am",
      "content": "HPs do have a work-around. I recommend Ricoh Aficio laser printers for high quality and speed. I get 20 ppm at 1200 x 1200 dpi.\n\n"
    },
    {
      "time": "27 Feb 2008 — 5:12am",
      "content": "HPs have bitten me in the ass when printing PDFs in OSX. Apparently, this is a known issue they will not fix. I now have my own known issue: no more HP for me. I wonder if it is related to their PS workaround.\n\n"
    },
    {
      "time": "27 Feb 2008 — 7:37am",
      "content": "Chris, what exactly happens when you print a PDF?\n\n"
    },
    {
      "time": "28 Feb 2008 — 9:58am",
      "content": "Has anyone had any experience with Xerox's lower end models, such as the Phaser 3150 (PCL only) or 3500? My needs are not high-end enough that I must have Postscript.\n\nI have looked at Ricoh's Aficio line but no one seems to publish prices for Ricoh products. That's a bit too much like a shell game.\n\n"
    },
    {
      "time": "28 Feb 2008 — 10:14am",
      "content": "The Aficio AP610N cost me around $800 a couple of years ago BUT it's large format, up to 11 x 17. If you don't need tabloid size I'm sure they are much cheaper. I just found it online for $600.\n\nGo to Google, click on \"Shopping\" and type in the product you are interested in. You can get a pretty good sense of prices that way. It isn't a shell game.\n\n[http://www.google.com/products?q=ricoh+aficio+laser+printer&btnG=Search+...](http://web.archive.org/web/20120731021353/http:/www.google.com/products?q=ricoh+aficio+laser+printer&btnG=Search+Products&hl=en&show=dd \"http://www.google.com/products?q=ricoh+aficio+laser+printer&btnG=Search+Products&hl=en&show=dd\")\n\n"
    },
    {
      "time": "28 Feb 2008 — 2:12pm",
      "content": "Yeah, I'm looking too, but only need 8-1/2 x 11 black only becuase I already have a larger format color. Hard to find one that is True Postscript. I have an ancient HP Laserjet that has been great, but all the new HPs don't look like they are true Postscript. The Ricoh Aficio SP 4100 looks promising, but is still around $700. Was hoping to keep it under $500. Maybe I'll keep plugging with the old HP until it dies.\n\n"
    },
    {
      "time": "28 Feb 2008 — 2:24pm",
      "content": "As far as I know HP has never made a true postscript printer, they all have the emulation software.\n\nYou might also look into Xante laser printers.\n\nBut what about the Ricoh Aficio BP20 or BP20N - both under $300.\n\n"
    },
    {
      "time": "28 Feb 2008 — 6:19pm",
      "content": "I have yet to run into any problem with the emulated PS on my HP. So unless you know of a specific bug that you would run into, I would say that they are perfectly fine to use.\n\n"
    },
    {
      "time": "29 Feb 2008 — 1:29am",
      "content": "I've used an HP 2100M for about 5 years and have found it to be fairly good — and I pretty much only ever print pdf's from OSX. (I must say though that I haven't yet got 10.5.2 to print properly, but I mainly use 10.4.11.) If there is an issue with these printers then I'd be interested to know what it is. When I first got the HP I was a little disappointed by the look of the letter forms which did not look the same as the Apple laser printer that I'd been used to. I put this down to the fake postscript.\n\n"
    },
    {
      "time": "21 Mar 2008 — 9:29am",
      "content": "Hello--I was silly and started my own laser printer thread and was kindly directed here by pattyfab. :) I hope my joining the discussion won't be a hijack...\n\nI'm very interested in the Ricoh Aficio BP20 or BP20N--they're more within my price range than the AP or SP series they have. On the specs, however, the BPs say \"PCL 6\" under \"Printer Languages.\" The AP series lists: Adobe PostScript 3: 136 Type 1 fonts; PCL: 35 Intellifonts, 10 TrueType fonts, 1 bitmap font. Does this mean that the BP models are not PostScript? I'm not very fluent in this PostScript/printing language so all I gathered from wiki-ing PCL 6 is that PCL competes with PostScript. Does that mean that the BP models are emulators like the HPs you're discussing?\n\nI appreciate your help! Thank you!\n\n(I'm on OSX Leopard, MBP, running CS3--if this matters.)\n\n"
    },
    {
      "time": "21 Mar 2008 — 9:45am",
      "content": "Ooh you're right, PCL6 is the newest HP postscript emulation. That's very interesting. I didn't notice their lower end printers weren't postscript. I don't know if Ricoh offers a smaller format postscript printer. I'd stick with postscript if you can swing it.\n\n"
    },
    {
      "time": "21 Mar 2008 — 10:05am",
      "content": "OK! Thank you so much for your advice, Patty! :) Maybe I can find a used one of the real PostScript model somewhere.\n\n"
    },
    {
      "time": "21 Mar 2008 — 1:58pm",
      "content": "Dumb question, but what's the advantage to True Postscript printing?\n\n"
    },
    {
      "time": "21 Mar 2008 — 5:52pm",
      "content": "Truthfully it's been awhile since I used an HP and they may have improved things by now, but back in the day there were limits to the capabilities of the emulation software.\n\nThere is more on it here:\n\n[http://en.wikipedia.org/wiki/PostScript](http://web.archive.org/web/20120731021353/http:/en.wikipedia.org/wiki/PostScript \"http://en.wikipedia.org/wiki/PostScript\")\n\nand here\n\n[http://en.wikipedia.org/wiki/Printer\\_Command\\_Language](http://web.archive.org/web/20120731021353/http:/en.wikipedia.org/wiki/Printer_Command_Language \"http://en.wikipedia.org/wiki/Printer\\_Command\\_Language\")\n\n\"PCL has been criticized for having less error tolerance than the competing PostScript printing language. PCL errors are especially common with PCL 6 hardware and drivers.\"\n\n"
    },
    {
      "time": "21 Mar 2008 — 7:38pm",
      "content": "Chris, I want to know what it did too & what kind of PDF it was.\n\nPatty, HPs do have a work-around? What is the workaround?\n\n"
    },
    {
      "time": "21 Mar 2008 — 9:55pm",
      "content": "[http://en.wikipedia.org/wiki/Printer\\_Command\\_Language](http://web.archive.org/web/20120731021353/http:/en.wikipedia.org/wiki/Printer_Command_Language \"http://en.wikipedia.org/wiki/Printer\\_Command\\_Language\")\n\n"
    },
    {
      "time": "22 Mar 2008 — 12:02am",
      "content": "Patty I looked at that page but I don't see any \"work around\"s.\n\n"
    },
    {
      "time": "22 Mar 2008 — 12:13am",
      "content": "PCL6 is not a PostScript clone, but rather HP's own printer control language (which in its earliest renditions is even older than PostScript).\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "22 Mar 2008 — 8:17am",
      "content": "I guess my question must have been stupid.\n\n"
    },
    {
      "time": "22 Mar 2008 — 8:21am",
      "content": "I guess work-around is the wrong term. As Thomas said, it's a different language that (as was explained to me) tries to emulate postscript, but is not true postscript.\n\n"
    },
    {
      "time": "22 Mar 2008 — 2:14pm",
      "content": "I see I has hoping there was a work around for the bug Karsten was talking about. Okay, thanks!\n\nAlex, It's not a dumb question. The answer is that Post Script is \"best of breed\" for a wide range of reasons. But unless you spend heavily you can't have it. Sad but true.\n\n"
    },
    {
      "time": "23 Mar 2008 — 6:16am",
      "content": "Metalfoot -- For proofing typeface designs, it's very useful to use a printer with true Adobe Postscript. Postscript clones may possibly interpret code slightly differently -- for example, hinting instructions. Since commercial output for print will be processed and rasterized through a true Postscript interpreter, it's most useful to be reviewing your work in a workflow as close as possible to the likely result.\n\nFor general design work, there are similar advantages -- things like color interpretation, layout features, etc. True Adobe Postscript will always be guaranteed of giving you a consistent industry-standard interpretation of the code. (There will of course be other limitations, based on the mechanics of a desktop laser; postscript rasterization is only one part of the puzzle.)\n\nThat doesn't mean that all PS clones are all rubbish. But you need to investigate to know whether a given rasterizer will perform according to your needs and expectations.\n\n"
    },
    {
      "time": "23 Mar 2008 — 10:36am",
      "content": "Also, many printers have entry which may say \"Postscript : Yes\" But upon investigation it will be emulated Postscript ( PCL6 etc). It amounts to false advertising as far as I am concerned.\n\n"
    },
    {
      "time": "29 Dec 2011 — 10:40am",
      "content": "I was trying to look something up and stumbled on this old thread.\n\nJust to clarify, PCL is \\*not\\* a PostScript emulation! It is a completely different page description language (PDL). HP printers typically \\*also\\* have a PostScript emulation built in.\n\n"
    },
    {
      "time": "30 Dec 2011 — 1:09am",
      "content": "How things change. My first PS laser printer, a GCC, cost me GBP 2500 in 1990. I got distracted into writing my own PS imposition program but I couldn't afford a PS interpreter for the PC (I had no Mac! still don't) to test it on. But the printer had a bi-directional serial port. I was able to send my generated PS code to it and read back the imposed output (which incorporated page creep allowing for folds in both axes, and what-not, and spot ink-trapping) to test on imagesetters. Pretty cool solution I thought at the time. As for the program (\"Reproshop\"), as it was on PC I couldn't even give it away. But it's how I learnt programming.\n\n"
    },
    {
      "time": "1 Jan 2012 — 12:55pm",
      "content": "Okay, so almost three years after the start of this thread, what's the answer for a low-end-priced, 1200 dpi, true Postscript, B&W laser printer? I was using a Xerox Phaser 3450B for about 6 years. I loved the quality. But it died suddenly a coupla months ago. I'm wondering about going the Xerox replacement for this model. Any thoughts?\n\n"
    }
  ]
}
