{
  "id": "42540",
  "title": "The Future of Licensing",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "i belong to another chat group comprised mainly of computer geeks and code cowboys who almost universally oppose the current definition of intellectual property and advocate open source code, creative commons licensing, file sharing, and drm-free documents. you know, the whole boing-boing crowd.\n\ni've noticed on typophile a strong and understandable trend towards conforming  \nto EULAs and strict adherance to license regulation.\n\ni don't know where i stand, as i understand both arguments but feel unable  \nto consistently advocate or practice either.\n\ni'm curious if any of you hardcore typophiles have any thoughts on the future of  \nfont licensing or possible alternative models. i know there are free fonts  \nand cc fonts out there, but is this really the best we can do ?\n\n(should this thread be in this forum or \"general\" ?)\n\n[http://www.boingboing.net/2008/02/24/knowledge-isnt-prope.html](http://web.archive.org/web/20131015025137/http:/www.boingboing.net/2008/02/24/knowledge-isnt-prope.html \"http://www.boingboing.net/2008/02/24/knowledge-isnt-prope.html\")\n\n",
  "author": "Ch",
  "time": "26 Feb 2008 — 1:13pm",
  "uid": "16657",
  "comments": [
    {
      "time": "26 Feb 2008 — 1:40pm",
      "content": "How many of these geeks and code cowboys create software? How do they propose making a living from said software?\n\n"
    },
    {
      "time": "26 Feb 2008 — 5:30pm",
      "content": "In the Google/IBM/Red Hat \"sponsored\" open source world coders, and yes even type designers, can make a living - Ascender and Bitstream got paid for those fonts (Droid/Liberation/Vera) after all. But beyond that initial engagement, the model seems to fall apart for fonts. Case in point being the amount \"paid\" work Vera generated for Bitstream and other font designers.\n\n"
    },
    {
      "time": "26 Feb 2008 — 6:33pm",
      "content": "to stephan : i'm not interested in mediating the argument.  \ni'm interested in knowing if there are alternate models out there  \nor under discussion in the font industry.\n\n"
    },
    {
      "time": "26 Feb 2008 — 6:40pm",
      "content": "From what I understand, as Cory puts it in his article, \"Fundamentally, the stuff we call \"intellectual property\" is just _knowledge_ - ideas, words, tunes, blueprints, identifiers, secrets, databases\". I'm pretty sure that my typefaces are not merely 'knowledge'. How does all this relate to free software & fonts?\n\n—K\n\n"
    },
    {
      "time": "27 Feb 2008 — 6:00am",
      "content": "yes, kris, the article is only indirectly related. but it is related, as is chris anderson's concept of the long tail and what happens when the cost of reproduction of media approaches zero. again, i don't want to be the mediator (or presenter of one side to the other).\n\ni can say, however, that i find the per-computer license model frustrating and by its very definition bound to be violated. not from mean spirited scoff-law piracy but rather from inconvenience, ignorance, and economics. per-computer licensing is clearly a flawed business model. i'm wondering if there is a better one.\n\nsome of you may find this appalling, but as a young designer i used nothing but copied fonts without even knowing i was violating any laws or agreements. and i'm willing to bet that this is normal. i don't say this proudly, and you can rest assured that now i purchase (oops... license!) legitimate copies of anything i need. i pass the expense to my client when possible, or i designate the annual costs as a normal business expense.\n\n( i was amused to recently see a request on typophile for barry deck's fontoid.  \ni worked on the project at nickelodeon for which he created this. he had us all sign a document vowing never to copy, distribute, or use this font for anything other than the nickelodeon project. ever. that was my very first exposure to the issue of proprietary fonts and usage restriction. )\n\nas i matured and began to work more seriously with fonts and fontographers, and as i bought fonts i couldn't find, i began to more fully understand and respect the work that goes into all design and i began to actually read the EULAs and frankly, even while doing my best to respect the spirit of the agreements and restrict my usage to a legal context, i find the arrangement cumbersome and at times absurd.\n\nthere have been other threads on this list regarding the all too common practice  \n( now waning due to technological advances) of sending fonts to printers or freelancers bringing fonts to work sites, etc.\n\nstudents and young hungry designers are the most likely to think \"i can't afford it\" or \"we already bought it so why shouldn't we share it\". it's hard for them to justify spending money again and again on files that are so easily and rampantly duplicated. as i explained, i myself had to gain a certain career momentum before i fully cooperated with the licensing system as it stands. these days, even if i find a font i want to use in my vast collection from years gone by, i'll find a way to buy it for a job. it's not difficult but it took a few years for the rationale to kick in.\n\nwe loan books, we share music, we invite friends over to watch movies, we make people dinner. we share things of value. this is a normal impulse and for a lot of people it is counter-intuitive to prohibit. and i think the font situation is aggravated by the very language of the license agreements. on most font sites every aspect of the transaction is called a buy - you \"buy the font\" - but in fact you are not buying, you're not even renting. you are licensing with restrictions. perhaps that should be made more explicit at the top of the agreement.\n\ni play by the rules, folks, but i wonder if there's another approach to this problem other than lectures on ethics ?\n\n"
    },
    {
      "time": "27 Feb 2008 — 6:56am",
      "content": "Much of Typophile consists of professional type designers who make a living on type, so it's understandable that the trend would be to lean towards their interests.\n\nThe question is, in general, does strict technology based and legal based copyright restrictions actually favor the copyright holder as much as they think it does? It's obviously a complicated question with no straight answer. It also is likely heavily dependent on the particular niche industry we happen to be talking about.\n\n\"How many of these geeks and code cowboys create software? How do they propose making a living from said software?\"\n\nA lot of people make a living creating and supporting Open Source Software. The concept of open source does not negate a project from making a profit. That tends to be one of the myths of the open source movement. Does it apply to type design? Probably not as easily.\n\nIMHO, I think most software licensing is overly strict, and that most open source licenses probably aren't ideal for most of the industry, leaving the answer somewhere in the middle.\n\nMy biggest gripe, in general, about software licensing right now is the fact that much of it is licensed PER MACHINE, rather than PER USER.\n\n\\*I\\* am the one paying for the license. \\*I\\* should get to use it where I want. My computer is not paying for the license. It has no right to my software.\n\nI think Apple kind of gets this, even though they don't overtly state it.\n\n"
    },
    {
      "time": "27 Feb 2008 — 11:10am",
      "content": "<cite>My biggest gripe, in general, about software licensing right now is the fact that much of it is licensed PER MACHINE, rather than PER USER.</cite>\n\nI couldn't agree more and I have argued this point on other threads in vain. As a single user with three computers and two printers, I resent having to pay individually for each workstation. Most EULAs cover a number of devices, say 1-5, which works just fine for me, but H&FJ among others does charge per computer. The argument was made that it is easier for the font police to monitor the number of workstations than the number of users and then the thread got ugly.\n\nI think that overly restrictive EULAs do nobody a service - designers will either not buy the font or will violate the EULA (knowingly or unknowingly). I really appreciate the foundries that make an effort to work with individual designers and not just major corporate clients or custom jobs. I am respectful of the hard work of the typographers, but only ask that they respect my needs as a user of their fonts.\n\n"
    },
    {
      "time": "27 Feb 2008 — 12:15pm",
      "content": "Patty — <cite>As a single user with three computers and two printers, I resent having to pay individually for each workstation.</cite>\n\nI would consider that covered under a single computer license. Or are you ambidextrous, with wholly separated brain halves, and able to work on more than one computer at a time? (And I don’t even know how to send the same print job to two printers simultanously…)\n\nThere is something like ‘fair use’, IMO. A one-person operation is in a different league than a x-person agency. At least that’s how I see it (and acted like for 20 years plus in this business). Fair that an agency would pay more.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "27 Feb 2008 — 12:37pm",
      "content": "<cite> I think that overly restrictive EULAs do nobody a service - designers will either not buy the font or will violate the EULA (knowingly or unknowingly). I really appreciate the foundries that make an effort to work with individual designers and not just major corporate clients or custom jobs. I am respectful of the hard work of the typographers, but only ask that they respect my needs as a user of their fonts. <cite></cite></cite>\n\nNegotiating with a foundry can work. But one of the functions of the law is to save transaction costs by offering a default set of contractual rights and obligations that may be more efficient overall. So, if regulators find so called \"agreements\" overly restrictive, they can give consumers additional rights notwithstanding the EULA. It may not be in the interest of type designers, but it may be in the public interest.\n\n"
    },
    {
      "time": "3 Mar 2008 — 10:20pm",
      "content": "Expect to see more differential pricing, based on either the amount of content in the font, or who's using it.\n\nFor instance, there are already two price points for legacy and OpenType versions of the same typeface.\n\nCheck out Canada Type's CULA and PULA--different prices for commercial and personal use.\n\nThe font market will continue to expand, driven by factors such as better marketing by distributors, and more aggressive pricing by competing foundries from around the world. $5 fonts, $25 fonts, $50 fonts, $75 fonts -- more tranches, bigger overall sales volume.\n\n_there are free fonts and cc fonts out there, but is this really the best we can do ?_\n\nI'm afraid so, because these comprise the lowest tranche, and act as a gateway for users to then move up to commercial products.  \nLook at what happened in the early 19th century when book publishers on the European continent went after the controlled UK market, offering a cheaper product and not paying authors. Before this was closed down by international agreements, it (among other things) had stimulated the book and reading market in the UK hugely, and brought prices down--as well as popularizing Byron and Scott throughout Europe.\n\nThe US ignored European copyright at that time, published European authors cheaply, with affordability boosting the reading rate in the US, again stimulating the commercial market, and allowing writing to emerge as a profession.\n\n"
    },
    {
      "time": "4 Mar 2008 — 1:17am",
      "content": "One problem of making a license per computer is that it is not clear what a computer is. For example I have a Powermac G5 and it has two internal drive bays (more recent ones have four). One hard drive has OS X 10.4.11 on it and the other has 10.5.2. For almost everyone this counts as one computer, not two. Now am I entitled to put a font onto both drives and have that count as one computer? In this case I suspect no one would cavil — after all, I cannot use both drives and both operating systems simultaneously. But this a real problem for me with CS2, which I have a license for. It is currently on the 10.4.11 drive but I genuinely have no idea whether I am entitled to put it on the Leopard drive as well. And yet it is licensed for one computer, and, as I say, most people would consider the whole thing just one computer. (If the license is really for one hard drive then it should really say so.)\n\n"
    },
    {
      "time": "4 Mar 2008 — 6:38am",
      "content": "To add to that, Eluard, I have a MacBook with XP running on it. It's one computer, but why do I have to buy two licenses for my software if I want to run it inside of XP and OSX?\n\nMore arguments for software companies to consider the 'per user' license concept instead. Alas, that means they have to give up concepts like DRM which they may or may not go for.\n\nI've always thought a 'dongle' approach would work. Maybe a bluetooth device that stores all of your licenses on it. No matter what computer you are on, as long as you have the license on the device, the computer will recognize it and launch the software for you. This gives the vendor the DRM-want, and the customer the flexibility of not being tied to a physical box.\n\n"
    },
    {
      "time": "4 Mar 2008 — 1:18pm",
      "content": "Yes, it would be interesting to see THIS restriction on users tested in court.\n\n"
    }
  ]
}
