{
  "id": "42547",
  "title": "CV Feedback please",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have recently finished college an im looking to start a career in graphic design/motion graphics.  \nI hav created a cv and will post links to it on this message.  \nI will be grateful for any feedback.  \nThanks.  \nAsh.\n\n[http://i256.photobucket.com/albums/hh178/AshR214/cv-cover2.jpg](http://web.archive.org/web/20081205092343/http:/i256.photobucket.com/albums/hh178/AshR214/cv-cover2.jpg \"http://i256.photobucket.com/albums/hh178/AshR214/cv-cover2.jpg\")\n\n[http://i256.photobucket.com/albums/hh178/AshR214/page2.jpg](http://web.archive.org/web/20081205092343/http:/i256.photobucket.com/albums/hh178/AshR214/page2.jpg \"http://i256.photobucket.com/albums/hh178/AshR214/page2.jpg\")\n\n[http://i256.photobucket.com/albums/hh178/AshR214/cv-work-examples.jpg](http://web.archive.org/web/20081205092343/http:/i256.photobucket.com/albums/hh178/AshR214/cv-work-examples.jpg \"http://i256.photobucket.com/albums/hh178/AshR214/cv-work-examples.jpg\")\n\nthe work examples arent all my best work, its mainly just to show a layout idea.\n\n [‹ Font that would have square uppercase](http://web.archive.org/web/20081205092343/http:/www.typophile.com/node/42622 \"Go to previous forum topic\") [Hi, I'm the Newbie! ›](http://web.archive.org/web/20081205092343/http:/www.typophile.com/node/42594 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081205092343/http://www.typophile.com/user/27625\" title=\"View user profile.\">ash214</a>",
  "time": "<br>",
  "uid": "27625",
  "comments": [
    {
      "time": " 26.Feb.2008 4.01pm",
      "content": "Most employers like to see 1 page with just the facts. Maybe think about how you could make it as simply as possible, using just typography. I would resist the urge to get too creative with your resume — it’s an opportunity to show your information design skills, not your illustration skills.\n\n"
    },
    {
      "time": " 26.Feb.2008 8.10pm",
      "content": "I agree, and I think the reader will be more impressed if you can convey clear organization just through the arrangement of text (and images on the examples page) alone (i.e. without boxes, extra slashes, etc.)\n\n"
    },
    {
      "time": " 27.Feb.2008 8.11am",
      "content": "Separate your CV and your portfolio. They should be documents that can stand on their own individually.\n\nLoose the gradients, stretched boxes, etc. Anything put on here should be done with purpose...not just to decorate.\n\n"
    },
    {
      "time": " 27.Feb.2008 3.28pm",
      "content": "Having sifted through CVs on a number of occasions in order to compile a shortlist I can honestly say that, as FeeltheKern says, one side of A4 is massively preferable.\n\nShort and to the point. Make the design readable and simple. You should be aiming to outline your skills and achievements and offer information on referees and suchlike.\n\nI generally skim multi-page CVs which means I may overlook something vital I admit but when one has a pile of 50-100 job applications time is of the essence.\n\nOh, and one other thing, you have spelled ’halloween’ incorrectly on your examples page.\n\n"
    },
    {
      "time": " 28.Feb.2008 8.04am",
      "content": "What Darrel (aluminum) said. And after that, you might consider changing the hyphens in the date ranges to en-dashes, and the hyphens at the front of each list item to bullets. Restricting the ellipsis (“I enjoy...”) to just three dots (or indeed switching to a colon). A close-bracket after the Media Studies grade, etc. A general proofread and typographical tidy-up, in other words.\n\nSome employers won’t notice or care about typographic niceties, but you can bet your bottom dollar that the one you _really_ want to work with _will_. And obviously you want to, since you’ve posted here!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    }
  ]
}
