{
  "id": "4256",
  "title": "The origins of Bembo",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "any idea where i could start digging to find samples of different stages of this more than 500 yrs old typeface? any tips for bibliography, or even links for online stuff? how often has this typeface been redrawn, which ones were successful, which ones weren't? would love to get really deep into this typeface. cheers,   \nc\n\n",
  "author": "elastik",
  "time": "Mon, 2004-04-12 15:56",
  "uid": "3434",
  "comments": [
    {
      "time": " Mon, 2004-04-12 17:24",
      "content": "Well, for starters, the face we know as Bembo is from 1928. It was a modern revival of the faces which were cut for Aldus Manutius over 500 years ago. The name comes from the name of an author of a book that Aldus published. The face went into disuse after Aldus until it was revived as Bembo.   \n   \nOff the top of my head, here are some good sources of information about Bembo:   \n   \nA Tally of Types, by Stanley Morison   \nPrinting Types: An Introduction, by Alexander Lawson   \nTwentieth Century Type Designers, by Sebastian Carter\n\n"
    },
    {
      "time": " Mon, 2004-04-12 18:41",
      "content": "great! do you actually have any ideas where i could find original examples of bembo? the version before 1928?\n\n"
    },
    {
      "time": " Mon, 2004-04-12 19:28",
      "content": "Just to be clear: Bembo didn't exist before 1928. The earlier types that it was based on didn't have a name as such, and I wouldn't call them earlier versions of Bembo. That would be like calling the New Testament an earlier version of the movie _The Passion of the Christ_.   \n   \nAnyway, for samples of Aldus Manutius' printing, which might have examples of the typeface that inspired Bembo, try one of these:   \n   \nThe Art of the Printed Book, by Joseph Blumenthal   \nAn Atlas of Typeforms, by Sutton and Bartram   \n   \nIncidentally, the book that inspired the name was called _De Aetna_, by Bembo (the cardinal, not the font), published in Venice in 1495.\n\n"
    }
  ]
}
