{
  "id": "42579",
  "title": "Replicating German handwriting between 1880-1910",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am trying to replicate what a hastily scribbled note on the back of the business card would look like, if it were written some time between 1880 and 1910 by a well-educated German. It isn’t meant to be legible, but needs to look fairly authentic.\n\nNow, my knowledge of German is limited to the prase “Hände Hoch”, and what little reaserch I managed, is based on conjecture and automatic translations. Anyway, from what I could find, it seems that I need to use a version of the script that came before the spread of [Sütterlin](http://web.archive.org/web/20081007002012/http:/en.wikipedia.org/wiki/S%C3%BCtterlin) which became popular after 1915. I’ve compiled a short sampling of handwritten notes from before that period, and tried to combine them with some letters from the [Kurrent Kupferstich](http://web.archive.org/web/20081007002012/http:/www.waldenfont.com/product.asp?productID=8) font to get enough variation in repeating glyphs.\n\nHere’s what I got. Am I completely off the mark?\n\n ![](http://web.archive.org/web/20081007002012im_/http:/www.typophile.com/files/German_6166.png)\n\nThe German text is supposed to read:  \nWo: Der Narrenturm, Operationssaal  \nWann: 12. Januar, 9:30 Uhr  \nOhne Fleiß kein Preis.\n\n [‹ Prouns with Type?? I need your advice.](http://web.archive.org/web/20081007002012/http:/www.typophile.com/node/42691 \"Go to previous forum topic\") [Experiment with Futura. ›](http://web.archive.org/web/20081007002012/http:/www.typophile.com/node/42649 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007002012/http://www.typophile.com/user/23991\" title=\"View user profile.\">oprion</a>",
  "time": "<br>",
  "uid": "23991",
  "comments": [
    {
      "time": " 27.Feb.2008 10.33am",
      "content": "Hi Ivan,\n\nyeah, basically you’re right: This is ‘Kurrentschrift’, the ‘broken’ script that was used in Germany until it got banned, together with Fraktur and the other ‘broken’ typefaces, in the 1940s. [See here: Wikipedia on [Deutsche Kurrentschrift](http://web.archive.org/web/20081007002012/http:/de.wikipedia.org/wiki/Deutsche_Kurrentschrift)]. It still can be seen now and then in old people’s handwriting.\n\nAnd yes, Sütterlin is a reformed version of it; upright, with a larger x-height.\n\nSome remarks: The ‘N’ in Narrenturm looks like ‘St’.  \nAnd: you left out the word Operationssaal.  \nThe ‘n’ in Januar seems to be missing.  \nYou wrote ‘Fleis’, not ‘Fleiß’. The latter would be the correct spelling – then again, German orthography was not that consistent before Konrad Duden (he published his first dictionary in 1880).  \nYou wrote a ‘long s’ (ſ) at the end of Preis: This is wrong, at the end of words, there has to be a ‘round s’.\n\nThe typical writing instrument of Kurrentschrift would be a pointed pen.  \nF\n\n"
    },
    {
      "time": " 27.Feb.2008 11.54am",
      "content": "Thanks! Is this any better?\n\n[Updated]\n\n ![](http://web.archive.org/web/20081007002012im_/http:/www.typophile.com/files/German_3715.png)\n\nWas there a standard business card size that was typically used at that time?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20081007002012/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 27.Feb.2008 12.35pm",
      "content": "Yes, that’s better! ;-)  \n(Though the connections aren’t very smooth, but I think you are aware of that – e.g. P\\_r in Preis, Fl\\_e in Fleiß, …)  \nThere should be a dot after the 12.\n\nWhat the _hell_ is this for? A faked paper chase in Vienna? I’m really curious.  \n(And if it’s in Vienna, written by an Austrian, then it should/might be Jänner instead of Januar.)\n\nAs for the paper size: I have no idea. Standardization came a lot later, so I don’t think this is really an important point.\n\n"
    },
    {
      "time": " 27.Feb.2008 2.52pm",
      "content": "Heh, yeah I know about the connections, thats the next thing on the list of things to fix.\n\nWhat is this for...err...it’s a little difficult to explain.  \nBasically, it’s just a personal project. I am designing various paraphenalia to accompany a really short story, that I’ve written in the style of 19 century Russian plays (including the orthography though that still needs work)So far, I have an ExLibris, a business card of a German doctor working in Viennese Krankenhaus, a photocopy of a catalog page, a postcard of the estate, and annotated scraps of the pages missing from the book. There is no real point to any of this, just idle play in the spare time between the boring in-house jobs. Still, I want to make sure this looks and feels and authentic.\n\nIf you are interested, I can attach some of the items in their current half-baked state.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20081007002012/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 27.Feb.2008 5.15pm",
      "content": "This is cool. I love it when people aim for authenticity.\n\n"
    },
    {
      "time": " 29.Feb.2008 3.18pm",
      "content": "If the doctor working in that Viennese hospital himself is not a German from Germany (but Austrian), then it should be very definitely Jänner instead of Januar. (Actually, back then, also Feber instead of Februar still used sometimes, but more seldom, while Jänner is even today used exclusively).\n\n"
    },
    {
      "time": " 29.Feb.2008 3.47pm",
      "content": "No, the doctor is German (from Germany) and is briefly staying in Austria for a series of lectures and “demonstrations” so the spelling should match his origin.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20081007002012/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 29.Feb.2008 4.00pm",
      "content": "See? I thought of all eventualities :-)\n\n"
    }
  ]
}
