{
  "id": "42592",
  "title": "the beginnings of an art book...",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi all,\n\nI've been working on this project in a cave, and I think I'm at a point where I can use some criticism from the pros. This is my first _real_ book project, that is, the first book project I have full control over as far as art direction and type/graphic standards.\n\nIt's an 11x11\" art book--a survey of the themes of Apocalypse and Rapture in contemporary art.\n\nI'm in the stage of developing standards for displaying the varying written pieces in the book. The challenge is that every written piece has its own specific function (letter from the editor, essay on the themes, radio transcripts, poem, and indexes), so I'm straddling a threshold of displaying them all appropriately for what they are, yet having some harmony with one another--staying within the same grid system, using the same typefaces, and so on.\n\nIn it's current stage, it's pure type.\n\nI'd like to dive into the forensics of all my decisions down to point sizes and baseline offsetting, but I think right now I should save that for later and just get an idea for what you 'philes think, and if there's any immediate reactions / no-no's that are spotted.\n\nThe goal is to respect the grid, respect readability, be reserved in the approach, aim for timelessness, but move beyond the default systems.\n\nLet me know what you think!\n\n\\*\\*edit\\*\\* can't get file attachment working here, so I've uploaded it to my ftp:\n\n[http://www.dwcastillo.com/SOTAR-title-and-index.pdf](http://web.archive.org/web/20130310025939/http:/www.dwcastillo.com/SOTAR-title-and-index.pdf)\n\n",
  "author": "dcastillo",
  "time": "27 Feb 2008 — 4:56pm",
  "uid": "7765",
  "comments": [
    {
      "time": "5 Mar 2008 — 8:49am",
      "content": "I like your layout. So here's just some details I don't like.\n\nOn spread 6, is there a particular reason why the word 'side' needed to be left to the lower size and not kept in the three upper lines?\n\nAlso at spread 8, I don't like how 'end of time' ends an entire paragraph on another side.\n\n– _Malte_\n\n"
    },
    {
      "time": "5 Mar 2008 — 1:05pm",
      "content": "Thanks Malte,  \n Re: spread 6: I fixed that up--and there are no longer any hyphens.  \n Re: spread 8: I let it end that way because it's not the final copy for the essay.\n\nThere was some criticism about having the body of type on spread 6 being larger than the rest of the essay. I wanted it to be a bit separate overall from the rest of the story--there's a wider column too, but that wasn't flying with the rest of the gang.\n\nI've also been throwing around the idea of incorporating some geometric graphic elements in the book--my geometric extractions of the themes, which have some groundings in the fundamentals of sacred geometry. It's still fresh, but I'd like to get an idea if it's too much. I definitely want to be somewhat reserved, but don't want this to be stale either.\n\n[http://www.dwcastillo.com/SOTAR-title-and-index-2.pdf](http://web.archive.org/web/20130310025939/http:/www.dwcastillo.com/SOTAR-title-and-index-2.pdf)\n\n"
    }
  ]
}
