{
  "id": "426",
  "title": "School logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm not a designer, but as my father is kind of director of a ceramics school, i submitted him ideas for a logo for his school. There isn't, and every single compagny paper they have are of very poor quality (the worse is that there's a \"graphism\" branch in another school of the same group).   \nSo though i know my things really not deserves to be there, i guess maybe you can give me ideas to make it less miserable (in all cases, it will be better than the nothing they have).   \nThere's an old first version, made with Dominican (which appears to me to fit well with ceramics) and another with tyfa (which is more modern but still make tghink of some past in my view).   \nBe hard, i really haven't any pretention. You can't hurt me. ![logo](http://web.archive.org/web/20150417142817im_/http:/www.typophile.com/forums/messages/29/12086.gif)   \nOnly typography, it's not a brand but, let's say a \"pretty name\".\n\n",
  "author": "ponofob",
  "time": "23 Jun 2003 — 6:18am",
  "uid": "1804",
  "comments": [
    {
      "time": "23 Jun 2003 — 8:45am",
      "content": "I don't like the antique treatment, but it seems the logo might need some softness, somehow. Or even some mix of styles?   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jun 2003 — 3:31pm",
      "content": "So if i understand well, you'ld keep the tyfa one, but you'ld add some softness. Does it implies to search another font, or to make any treatment, and what ?   \nI appreciate your help.\n\n"
    },
    {
      "time": "23 Jun 2003 — 4:35pm",
      "content": "I love the first one, especially for the context of an art school.   \n   \nI would like to see the \"de provence\" done in an italic like in the third one, though. If you have a distressed italic to go with the main face that is.\n\n"
    },
    {
      "time": "23 Jun 2003 — 7:07pm",
      "content": "I think you should probably choose a \"softer\" font from Storm.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jun 2003 — 10:34pm",
      "content": "Define softer.\n\n"
    },
    {
      "time": "23 Jun 2003 — 11:02pm",
      "content": "Hmmm.   \n   \nLike slab serifs are not soft. Garamond #3 (Jannon) is soft. Wide is soft. Small x-height is not. Maybe.   \n   \nI know, try a flare-serif design, like Poppl-Laudatio.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jun 2003 — 12:46am",
      "content": "Rules:   \n1. don't play with a common letter (here the big E) for two words, not the best legibility. And not very interesting, conceptually. Generally done by people who have no \"ideas.\"   \n   \nThe main letter will be C here I think.   \n   \n2. don't play with caps then lowercases for hierachy (levels: 1, 2, 3, 4), more with \"size\" or color: all caps or caps+lowercases.\n\n"
    },
    {
      "time": "24 Jun 2003 — 2:30am",
      "content": "Guillaume -- here's another approach.   \n   \nLooking at the name of the school...i noticed   \na typographic anomaly...   \n   \neach word has two Es.   \n   \nAnyway, as we sometimes do here at typophile,   \nI took the liberty of messing around with   \nyour work, just for kicks.   \n   \nI tried A, which wasn't working.   \n   \n\"B\" might be a step in a decent direction, but   \nit needs something (flourishes to the left and   \nright of de Provence?) to make   \nit into a real logo, er, trademark.   \n   \n   \nAnyway, you might explore this concept further with   \nsome other typefaces, Tyfa?, and some different   \nE treatments.   \n   \nYou might also follow the advice of the experts, but   \nremember, hrant is NOT a graphic designer. ![:-)](http://web.archive.org/web/20150417142817im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nThis is Ellington slightly modified...ITC new baskerville   \nis the italic typeface. :0   \n   \ngood luck   \n   \nbj   \n ![ecole.jpg](http://web.archive.org/web/20150417142817im_/http:/www.typophile.com/forums/messages/29/12125.jpg)\n\n"
    },
    {
      "time": "24 Jun 2003 — 3:05am",
      "content": "well, bj started...   \n   \nhere i had an idea: why dont you do something with what your school is about? ceramics.   \n   \ni made a very quick sketch with a mosaic-like word. maybe this will give you new ideas.   \n   \n--jacques   \n   \nPS: maybe you should experiment with ceramics. draw a logo on a tile and then watch what happen. Then redraw the logo to get good final results. Then digitize the original drawing. This might give some interesting forms and details   \n   \n ![MOSAIC.gif](http://web.archive.org/web/20150417142817im_/http:/www.typophile.com/forums/messages/29/12136.gif)\n\n"
    },
    {
      "time": "24 Jun 2003 — 3:11am",
      "content": "Thank you all !   \nYour advices are precious, and i especially thanks Mr Porchez to have enlighten me about the big E. Indeed, if i would do it in the same way, it would be with the C. And your comments about it (lack of ideas, \"trick\") are sadly right\n\n"
    },
    {
      "time": "24 Jun 2003 — 3:14am",
      "content": "double\n\n"
    },
    {
      "time": "24 Jun 2003 — 3:30am",
      "content": "Jecques, your idea is good, and obviously i should do something more related to ceramics, but :   \n1. It has to be very legible as their reproduction ways are the worse possible (photocopy etc\n\n"
    },
    {
      "time": "24 Jun 2003 — 3:44am",
      "content": "Guillaume,   \ni get the point. (But to get a logo working for ceramics (glaze, pigment etc.) is\n\n"
    },
    {
      "time": "24 Jun 2003 — 4:26am",
      "content": "\\>Yes, a logo working for ceramics is probably harder to do. But i'm not sure letters are more difficult to do than a mosaic thing. It's an interesting way to go, but despite the name, the school teaches also plate decoration & things like that, so if the ceramics motto is a thing to explore, i guess i don't have to be to precise about it, if you see what i mean. About the ADEF (this is it) logo, i don't think i can do anything. They don't have even a designer (there's maybe someone who's in charge of it, being a secretary or so, and they don't care all all. Seeing their communication is made by printers\n\n"
    },
    {
      "time": "24 Jun 2003 — 5:57am",
      "content": "So, without going too far (i'll explore the other ideas, Jacques one will take time\n\n"
    },
    {
      "time": "24 Jun 2003 — 6:04am",
      "content": "Sorry; here's the file :\n\n<!--attachment: ECP2-12143.pdf*attachment_icon.gif*application/octet-stream*36.6*with+intimacy*ECP2%2epdf --><!--attachment: ECP2-12143.pdf*attachment_icon.gif*application/octet-stream*36.6*with+intimacy*ECP2%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417142817im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"application/octet-stream\">with intimacy<br><a href=\"http://web.archive.org/web/20150417142817/http:/www.typophile.com/forums/messages/29/ECP2-12143.pdf\" target=\"_blank\"><b>ECP2.pdf</b></a> (36.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "24 Jun 2003 — 8:17am",
      "content": "\\> L\n\n"
    },
    {
      "time": "24 Jun 2003 — 9:29am",
      "content": "...hrant could be called a (typo)graphic philosopher\n\n"
    },
    {
      "time": "24 Jun 2003 — 9:39am",
      "content": "If that means doing nothing in a toga, I'm all for it.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jun 2003 — 3:52pm",
      "content": "Guillaume, on the profile of the vase seems too rigid looks very different from the type...   \nWhen I'm stuck on ideas (very often by the way) I take a little distance from the subject Mmmm are any specific images you can associate with the school? some history background? some \"special\" technique they teach? maybe in the answers to those questions you find something interesting ![:-)](http://web.archive.org/web/20150417142817im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "24 Jun 2003 — 9:42pm",
      "content": "The new version is, IMO, a step backwards from the first designs.   \n   \nI really like the first design, even though it doesn't follow the \"rules\". If everyone followed the rules, design as we know it would be quite boring.\n\n"
    },
    {
      "time": "25 Jun 2003 — 7:14am",
      "content": "Arturo, i know that about the vase profile looking different, it was supposed to be more an idea than anything else, i just wanted to know if the idea of using the proeminence of the C, and do a vase profile (which can be done far better) in its side was interesting or not.   \nChris, thank you, but JFP and others were sadly right on one point : the big E doesn't mean anything. And i don't want so much a meanless design, even if it's aesthetically nice.\n\n"
    },
    {
      "time": "25 Jun 2003 — 11:07am",
      "content": "\\>it was supposed to be more an idea than anything else   \n   \nUnderstood ;)\n\n"
    },
    {
      "time": "25 Jun 2003 — 3:22pm",
      "content": "\"Chris, thank you, but JFP and others were sadly right on one point : the big E doesn't mean anything. And i don't want so much a meanless design, even if it's aesthetically nice.\"   \n   \nThat's the crux of the matter though.   \n   \nIf people recognise what you're trying to say, even if the design is meaningless through a design standpoint, you've done your job as a designer.   \n   \nYou can have perfectly good design, playing by the rules and all that, that can be aestheticly pleasing, yet more often than not, it's the breaking of the rules that actually makes a design aesthetically pleasing.   \n   \nWhen I see your first logo, I see right away what it says, and I look at the way you emphasize the E and think it's a novel away of dealing with the situation.   \n   \nThen I look at your updated design, and see the same type of process going on, but say to myself \"how boring\".   \n   \nBefore you decide, do this: Take both of your designs and show them to laypersons and see which design they like the best. That is the design you should stick with.   \n   \nYou're not designing your logo for designers, you're designing it for the common person, and they want something that looks nice.\n\n"
    },
    {
      "time": "25 Jun 2003 — 4:37pm",
      "content": "Guillaume. There is something nice about this latest version. The hand shows through. Similar to ceramics, you can often see the hand in the work. However, I think the silhouette of the vase is too tricky. I wouldn't use that. Can you unify the weights? The widths on the strokes and interior lines change too much.   \n   \nAs for the first version. Having the E large as you do, completely confuses the hierarchy of legibility. And as JFP pointed out you have too much going on.   \n   \nI would say Tyfa is of the crunchy variety. Not creamy. On the other hand, Biblon is super creamy.\n\n"
    },
    {
      "time": "30 Jun 2003 — 3:24am",
      "content": "coming back to the first font, but adding the latest ideas, her's another possibility.   \nThe colors aren't important.\n\n<!--attachment: ecp-3-12313.pdf*mime_pdf.gif*application/pdf*67.9*another*ecp%2d3%2epdf --><!--attachment: ecp-3-12313.pdf*mime_pdf.gif*application/pdf*67.9*another*ecp%2d3%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417142817im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">another<br><a href=\"http://web.archive.org/web/20150417142817/http:/www.typophile.com/forums/messages/29/ecp-3-12313.pdf\" target=\"_blank\"><b>ecp-3.pdf</b></a> (67.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "30 Jun 2003 — 6:05am",
      "content": "Guillaume,   \n   \nI have to agree with Tiffany. The vase shape seemed too contrived before. Now that it's also the C and the accent, it feels even more so.   \n   \nI like the handlettered feel of ECP2. Take out the vase and work to make the weight even as Tiffany suggested (Draw a real cap for the C and P rather than enlarging one). I like the horizontal rules in the type though. It subtly suggested a coil pot to me. This can look very elegant too if you want. Consider [http://www.thomaspink.com](http://web.archive.org/web/20150417142817/http:/www.thomaspink.com/)   \n   \n   \nGood luck   \nRandy\n\n"
    },
    {
      "time": "30 Jun 2003 — 7:19am",
      "content": "I really think that you stick too much to this single concept. Maybe you should try something completely else (I don't know how you are used to do that, but I would take a sketchbook and go to the coast or mountains somewhere...). Actually I would read this last version as \"eramique\" instead of \"Ceramique\", if I would not have seen the earlier posts. Personally I even can't see a possibility to make a vase out of a serifed C letter without loosing the legibility completely.\n\n"
    },
    {
      "time": "30 Jun 2003 — 7:25am",
      "content": "Yes, it seems that this C is not easely readable as a C, as some other people tell me. It's a pity because i liked both the idea and the look. I'm going to the south, very soon, so i guess i'll have to think about it around the seaS\\<caron\\> My father himself is a drawer, and a talented one, so i'll try to work with him on other ideas.\n\n"
    }
  ]
}
