{
  "id": "4261",
  "title": "Fonts for Jubilee Book",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,   \n   \ni could layout a jubilee Book. 125 years old firm.   \n   \nWhich fonts would you use. I have some money for the fonts. So i want to buy some good fonts.\n\n",
  "author": "jawbox",
  "time": "13 Apr 2004 — 12:50am",
  "uid": "2335",
  "comments": [
    {
      "time": "14 Apr 2004 — 12:26am",
      "content": "For a social organization. It is a book about the history and about this time.\n\n"
    },
    {
      "time": "14 Apr 2004 — 1:09am",
      "content": "Tiffany's willingness to help is admirable. But I can't help thinking there's something really wrong when a designer(?) who's commissioned to design a commemorative book for a long-established firm comes to a forum like this and asks what font(s) they should be using. Call me mean-spirited (and I'm sure someone will), but this is a bit pathetic.\n\n"
    },
    {
      "time": "14 Apr 2004 — 2:48am",
      "content": "Sorry, it was the wrong question. Perhaps my english is to bad.   \n   \nThe thing is: I have money for the fonts and want to try something new. There are a lot of nice fonts on my mac. But perhaps there are nice fonts produced over the last month i never heard about that are good for use in this project. You know what i mean. I don't want to hear fonts like garamond or itc quay. I'am interested in \"underused\" fonts\n\n"
    },
    {
      "time": "14 Apr 2004 — 9:45am",
      "content": "Andrew, exactly what's the point of such a forum if it's pathetic to ask for advice from people who are willing and able to help?   \n   \nAs long as Timo doesn't take undue credit for other people's ideas, what's the problem?   \n   \nhhp\n\n"
    },
    {
      "time": "13 Apr 2004 — 9:19am",
      "content": "For whom are you producing this book? What kind of firm? Law? Medical? Toys? What kind of book? Coffee table? More of an annual report?\n\n"
    },
    {
      "time": "20 Apr 2004 — 4:57pm",
      "content": "Timo you could start by looking at the newest releases from these fine purveyor's of type:   \n   \n [MyFonts](http://web.archive.org/web/20131018075348/http:/www.myfonts.com/WhatsNew)   \n [FontShop](http://web.archive.org/web/20131018075348/http:/www.fontshop.com/?area=sf_fonts&content=/virtual/fssf/fonts/ff33/index.html)   \n [Emigre](http://web.archive.org/web/20131018075348/http:/www.emigre.com/NewMF.php)\n\n"
    },
    {
      "time": "21 Apr 2004 — 2:47pm",
      "content": "[Andulka](http://web.archive.org/web/20131018075348/http:/www.stormtype.com/andulka.html)\n\n"
    }
  ]
}
