{
  "id": "42620",
  "title": "Top 20 Typefaces That Have Influenced Design?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,  \nI posted a request earlier this week for the top 20 influential typefaces. After reading the numerous helpful replies I’ve come to realise that my question was a little ambiguous. Rather than typefaces that have influenced other typefaces, I was instead more interested in the top 20 typefaces that have impacted upon the design world itself.  \nAfter this reflection my list now looks a little more like this:\n\n- Helvetica  \n- Garamond  \n- Univers  \n- Bembo  \n- Times  \n- Futura  \n- Optima  \n- Bodoni  \n- Gill Sans  \n- Frutiger  \n- OCR  \n- Cooper Black  \n- Myriad  \n- Franklin Gothic  \n- Rockwell  \n- Mrs Eaves  \n- Avant Garde  \n- Baskerville  \n- Caslon  \n- Dax\n\nThanks for all your comments on my other post and again I’d value your opinions and feedback on this one.\n\n",
  "author": "deano86",
  "time": "28 Feb 2008 — 10:13am",
  "uid": "27544",
  "comments": [
    {
      "time": "28 Feb 2008 — 10:48am",
      "content": "I don't think Times has had impact. Perhaps you mean fonts that have been HUGE and so over-used that one can't use them without thinking of that time period? Your list could be fine-tuned. For instance, Futura Ex-Bold Condensed instead of just Futura. I'd use Didot instead of Bodoni, but I'm thinking of Bazaar magazine, Italian Vogue, and Madonna's... well her \"book\". You are missing Meta and Avant Garde. Myriad, OCR, and Bembo... not so much. ITC Garamond, as much as we loathe it, was huge when it was released. Bell Gothic lead the way, IMHO, to our loving weird traps (Amplitude) and Freight Micro. I'd not include Rockwell but would include Lubalin. Caslon 540 perhaps.\n\n"
    },
    {
      "time": "28 Feb 2008 — 11:00am",
      "content": "What qualifies a font as having influenced design? I’m especially confused as to how a revival of a popular style—Mrs. Eaves—is influential. It’s not like Mrs. Eaves was released and a whole generation of designers suddenly discovered Baskerville. And why is Bembo on there as opposed to any other similar Renaissance book face? This list seems largely arbitrary.\n\n"
    },
    {
      "time": "28 Feb 2008 — 11:21am",
      "content": "and don't larger design trends influence type design as much as the other way 'round ? the question is a bit \"chicken or the egg\".\n\nit's a web of cross pollination and a combination of vision, circumstance, and general milieu.\n\ninfluence can also include a \"reaction against\" as much as \"inspired by\".\n\n"
    },
    {
      "time": "28 Feb 2008 — 11:48am",
      "content": "Know what font has the most impact? IMPACT.\n\n"
    },
    {
      "time": "28 Feb 2008 — 11:52am",
      "content": "I do think if you handed this list to a class of students, and each one had to write a report about 1 typeface, every report could be interesting and different\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:27am",
      "content": "Oh, I am largely confused here. I don't think any typeface ever influenced design. I think design influenced many typefaces.\n\nor not?\n\ndr\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:38am",
      "content": "The modernists were looking for a typeface that satisfied their desire to make straight-laced, non-frilly design. Looking, looking...\n\nAha! Univetica! Perfect!\n\nDesign that was aided and abetted by type design, design that otherwise would have turned out much differently.\n\nI would say that \"Jenson\", or more specifically William Morris's version of Jenson, definitely influenced the 19/20th century resurgence of the Renaissance typefaces and the resurgence of the book as art.\n\n"
    },
    {
      "time": "29 Feb 2008 — 7:27am",
      "content": "<cite>I don’t think any typeface ever influenced design. I think design influenced many typefaces.</cite>\n\nI’m pretty sure that the availability of large families/systems like Cheltenham or Univers had a pretty big impact on what designers were doing.\n\n<cite>I would say that “Jenson”, or more specifically William Morris’s version of Jenson, definitely influenced the 19/20th century resurgence of the Renaissance typefaces and the resurgence of the book as art.</cite>\n\nMorris’ Jenson was really part of something larger spurred by a lot of people being tired of what mass-production had done to the quality of damned near everything. It’s part of that messy history Nick likes to talk about.\n\n"
    },
    {
      "time": "29 Feb 2008 — 10:45am",
      "content": "Lubalin's Avant Garde and Brody's Industria were similar to Morris' Golden Type, in that the designer of the publication also designed the typeface for it.\n\nAll types influence design, in as much as you may conceive of a layout with a particular face in mind, or start to work with a font in a layout, and modify the layout accordingly.\n\n"
    },
    {
      "time": "29 Feb 2008 — 10:53am",
      "content": "Nick, you really should write a book. _Myth, Misconception, and Rubbish: Don’t Believe What You Learned in Design School_.\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:26am",
      "content": "I have almost finished that book, but type design projects keep getting in the way. Damn you, OpenType!\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:38am",
      "content": "Finish it so that I can spend the rest of my life referencing it in response to pretentious design blog posts!\n\n"
    },
    {
      "time": "29 Feb 2008 — 3:46pm",
      "content": "I agree with James Puckett when he says this list seems largely arbitrary. I think any such list would naturally be pretty arbitrary. How can one really tell how influential a face has been? The true influence of typefaces is probably subtle, subliminal, and perhaps subconscious.\n\nHowever, I also think this is an interesting question, and I'm curious: what is the purpose of compiling this list? (I'm not trying to be snarky; I'm really curious.) Are you an aspiring type designer who intends to examine the influential faces of the past to learn some good type design tips? Are you a graphic designer who intends to avoid using type that has previously been influential, in effort to break new ground?\n\n"
    },
    {
      "time": "29 Feb 2008 — 8:01pm",
      "content": "I think the biggest influences on type history have not been type faces at all. First, non-metal hardware, like typositor machines and Compugraphic photo typesetters, finally got us away from metal decisively and created new sources of supply staffed more by designers than skilled blue collar. Second, ITC seems to me to be the key influential foundry; it successfully repositioned type design as a truly happening medium open to all comers and goosed its competitors to fresher, more ambitious effort and stronger marketing. Type design became visible to the public. The big bang in type history occurred around 1970, with more instant classics appearing since than in the whole history of movable type until then--e.g., Sabon and Galliard, to start with. All this happened before Macs and Postscript, but PS was obviously the next big bang that allowed a new surge of creativity even more awesome. Now everybody could build their own type library at home.\n\nThe last influence of note was stylistic: I can't imagine how it happened, but oldstyle figures, largely ignored in photo-typesetting, kept gaining steadily until now they count as our key stylistic option globally--even the New York Times online uses Georgia, with oldstyle figures! Go figure! And thank God, OpenType finally makes accessing OSFs a snap; no more excuses like having to reach into the expert folder.\n\nWe should be careful ascribing influence to type faces because they are often a matter of fashion, coming and going in exactly that way. I remember when ITC Tiffany and Korinna were huge; now, who cares?\n\nWe still need revised industry standards in two areas: no more text families that lack bold and/or bold italic, and keystroke font links between roman and matching italic at a minimum. The cool boutique foundries are the worst perps here; the big boys never gave us these problems.\n\n"
    },
    {
      "time": "1 Mar 2008 — 5:31am",
      "content": "Just a historical clarification: ITC (International Typeface Corporation) wasn't technically a foundry, in the sense that they did not manufacture or distribute any type fonts themselves, at least not initially. It was formed to \\*license\\* designs to foundries and manufacturers, and to control the quality, consistency, and names of said designs.\n\nBut as John states, ITC represents a key paradigm shift in the history of typefaces by separating the activity of design from its dependence upon specific means of manufacture and machinery.\n\n-- K.\n\n"
    }
  ]
}
