{
  "id": "42623",
  "title": "\"AGL GRAND OPENING\" A Letterpress Shop",
  "forum": "AGL's blog",
  "tags": [

  ],
  "content": "Hi there,\n\nI have visited this blog for a long time, but I was busy with something else and did not created a account. I could have something to say about types and beautiful fh8 curves. I even have designed a nice form typeface in past seven or eight years, among some others experiments.\n\nIn the past two years I have been collecting letterpress artifacts (it is antique now baby) and after alotofgoingaroundandbiddingonauctionsandhoppingtogetthepiece I finally can tell to the word:\n\nAG Letterpress announces its promptness, headed to printing glory and adorned with 19th century and earlier great typography (I love type and the only thing I can say is that I would like to meet people that could be of some help - \"how the old type founders got their mats?\")\n\n\"AGL Grand Opening\" could well be a typeface name, why not. But the typeface is more then a table of characters. The presentation for this typeface which we already know the name is to be printed using my long waited Heidelberg T platen 1969 (groovy) - man, this press rocks. I also got a few old new ATF small type (Engravers 6 pt, Caslon Italic 14 pt, Shaded 12 on 18 pt, Craw Modern 6 pt and some others. My goal is to use this typefaces to print announcements and cards.\n\nAs a kid on a summer vacation I was first introduced to a letterpress shop. It was no more then a little cabinet with 16 cases of type, and a platen press 10\"x16\". That was in 1977 and few months later I was an apprentice. And so it happened: I am a type lover, and after 30 years of dealing with type I don't cease to admire letters.\n\nAs time permit I will posting some of my works. To start a picture of our dog, Nicky, which I designed as if it was a 'leadcut', and use it to print a card.\n\nThanks\n\nAndre\n\n| Attachment | Size |\n| --- | --- |\n| [nicky lead cut.jpg](http://web.archive.org/web/20140629221830/http:/typophile.com/files/nicky%20lead%20cut.jpg) | 66.14 KB |\n\n",
  "author": "AGL",
  "time": "28 Feb 2008 — 10:18am",
  "uid": "27669",
  "comments": [

  ]
}
