{
  "id": "42645",
  "title": "Tschichold and Schmoller",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I just found “Penguin By Design” this week, and fully awoke to the glory of Tschichold and Schmoller. Tschichold’s Penguin Shakespeare cover design—mmph! Schmoller’s rigid, beautiful typographic rules for every situation—ka-chah! I had always loved Schmoller’s hardcover <cite>Pelican Shakespeare</cite> (with its original spine and paper, still one of the most beautiful books I’ve ever seen), but without particularly fastening onto him as a Great Man. And Tschichold I mostly just associated with Sabon.\n\nMy question: Where can I best glut my need for lots and lots of information about both these great Penguin typographers and designers? (Not only Tschichold.) I want to know everything they knew!\n\nIn real life I am an author, and I now want to make sure my next book obeys all of their Rules. Or at least infringes them <cite>knowingly.</cite> The designer of my first book, a person employed by a major, much-loved trade publisher, wanted to letterspace its italic lowercase running heads. Which made me feel that it’s every man for himself out there.\n\nThanks!\n\n [‹ April Fooled](http://web.archive.org/web/20081015165913/http:/www.typophile.com/node/43755 \"Go to previous forum topic\") [Antique ›](http://web.archive.org/web/20081015165913/http:/www.typophile.com/node/43641 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015165913/http://www.typophile.com/user/26962\" title=\"View user profile.\">peter.ricardo</a>",
  "time": "<br>",
  "uid": "26962",
  "comments": [
    {
      "time": " 29.Feb.2008 1.00am",
      "content": "Knowing more about Tschichold and Schmoller may not save you... unless you have more pull with your publisher than I imagine authors do. I admit to be interested in Schmoller now though.\n\n"
    },
    {
      "time": " 29.Feb.2008 1.40am",
      "content": "peter — any chance you could post an image of the books you like?\n\n"
    },
    {
      "time": " 29.Feb.2008 2.28am",
      "content": "Eluard: there is a Flickr group, devoted to Penguin book covers:  \n [The Penguin Paperback Spotters’ Guild](http://web.archive.org/web/20081015165913/http:/www.flickr.com/groups/penguinpaperbackspotters/pool/)\n\nPeter, for information on [Jan Tschichold](http://web.archive.org/web/20081015165913/http:/www.typophile.com/wiki/Jan%252BTschichold), check out this (rather new and substantial) book –  \n [Christopher Burke](http://web.archive.org/web/20081015165913/http:/www.typophile.com/wiki/Christopher%252BBurke): _Active literature. Jan Tschichold and New Typography_, [Hyphen Press](http://web.archive.org/web/20081015165913/http:/www.hyphenpress.co.uk/books/978-0-907259-32-9).\n\nF\n\n"
    },
    {
      "time": " 29.Feb.2008 5.56am",
      "content": "My favorite Schmoller quote:\n\n“One more attribute the modern typographer must have: the capacity for taking great pains with seemingly unimportant detail. To him, one typographical point must be as important as one inch, and he must harden his heart against the accusation of being too fussy.”\n\nHans Schmoller, “Book Design Today,” <cite>Printing Review</cite> Spring 1951.  \n[used as an epigraph in Dowding’s <cite>Finer Points</cite>]\n\n— K.\n\n"
    },
    {
      "time": " 29.Feb.2008 6.37am",
      "content": "I got deeper into design as an author who wanted his books to look good, like you. I believe that your control over design will be nothing or minimal, unless you can get it into your contract that you will be consulted. Of course, there may be some agreeable people who are happy to have your input. But as usually I believe this stuff is done pretty quickly on deadline, it is tough. The book designers here should be able to tell you more about the process. Good luck!\n\n"
    },
    {
      "time": " 29.Feb.2008 7.43am",
      "content": "In my experience (mostly trade illustrated reference), authors have no control over their books. Some very important authors may have influence, but no authority. They may have some limited veto power over certain elements, particularly as related to the proper communication of content. But this usually occurs through their editor, who is the author’s advocate within the publishing process.\n\nAny influence is usually earned through charisma and intelligence. If an author has particular expertise in his/her area of authorship, then he/she may have some influence over some aspects of the cover.\n\nThe underlying principle at work is that the publisher is the one who is taking the greatest financial risk in publishing the work. As such, the publisher has the right to do whatever it deems best, in terms of design, marketing, etc., to ensure the best return on its investment.\n\nIf design is of great importance to an author, then he/she would always do well to research a publisher’s catalog before signing. If you don’t like the other books that are being published, there’s no reason to expect that you, as an author, will be able to influence your book to be significantly different.\n\nOn the other hand, if you’re signing with a publisher because you feel they are successful selling to the market you’re addressing, then you should give them the benefit of the doubt when it comes to doing the same with your work.\n\nI hope I’m not sounding like “the publisher is always right.” I’m trying to paint a realistic picture. One in which you might say, “the publisher always thinks it is right.”\n\nThat’s not to say that an author should not educate himself and engage in discussions about design where he feels strongly. As I said, influence is earned through charisma and intelligence, and operates through engagement and discussion, not authority and control.\n\n— K.\n\n"
    },
    {
      "time": " 29.Feb.2008 7.48am",
      "content": "[Completely off topic]\n\nBill — I sent a reply to your spacing/kerning e-mail, but I have a paranoid feeling that you did not receive it. (My ISP has been known to get caught up by spam filters on occasion.) I tried using your Typophile contact, but that e-mail failed delivery. If you didn’t get my message, please white-list my address and let me know by e-mail, and I will re-send it.\n\n[Apologies to all others for using the forums, and this thread in particular, for this personal message.]\n\n"
    },
    {
      "time": " 29.Feb.2008 4.23pm",
      "content": "Great replies—but I can tell people are more taken with the question of authors-and-publishers (and designers) than with the main query, so I’ll chip in my own experience about that!\n\nWith my first book, I did in fact have a lot of input—almost an alarming amount, giving me the sense that no one was firmly in charge—into the internal design of the book. (Not the cover, of course, where they did choose the basic picture from an image suggested by me, and did change the display type to be simpler, at my suggestion, but the overall design was nonetheless set independently of my input.) Inside the book, though, everything was run past me, and I had lots and lots of suggestions, nearly all of which were taken if they didn’t add to the cost of the book. I’m not sure what would have happened if I had wanted something radically different from what they came up with, but that situation didn’t arise. I had to pick up on things like the inconsistent use of old-style figures in italicized text, and the like, and I think they were probably glad that I did. It was a major publisher, so I wondered at times whether I only had the “B Team”—younger, less experienced people—working on my book, or what, but they really did let me muck around with things.\n\nMore after dinner about designs I love, and about Schmoller and Tschichold.\n\n"
    },
    {
      "time": " 29.Feb.2008 8.16pm",
      "content": "Can someone confirm how to pronounce Tschichold? A German friend told me to say CHEE-COLD. Is that correct?\n\n"
    },
    {
      "time": " 29.Feb.2008 8.30pm",
      "content": "MondoB,\n\nTschichold is pronounced CHICK-OLD. At least according to Hans Schmoller when he and his wife were a guest of my shop.\n\n[http://www.p22.com/lanston/giampa/EndPapers.html](http://web.archive.org/web/20081015165913/http:/www.p22.com/lanston/giampa/EndPapers.html \"http://www.p22.com/lanston/giampa/EndPapers.html\")\n\nGiampa\n\n"
    },
    {
      "time": " 29.Feb.2008 8.45pm",
      "content": "Thanks Giampa...that seems pretty definitive!\n\n"
    },
    {
      "time": " 1.Mar.2008 2.46am",
      "content": "[Jan Tschichold.mp3](http://web.archive.org/web/20081015165913/http:/florian.hardwig.com/public/typophile/Jan%20Tschichold.mp3)\n\n"
    },
    {
      "time": " 1.Mar.2008 2.43pm",
      "content": "_Eluard: there is a Flickr group, devoted to Penguin book covers:  \nThe Penguin Paperback Spotters’ Guild_\n\nThanks for this: I spent a night discovering lots of Penguin covers that I’d never seen before: and saw some great graphic design in the process.\n\nI’m still curious however, what this wonderful Pelican Shakespeare book looked like. I’ve seen many Penguin Shakespeare designs but don’t know which one is being referred to.\n\n"
    },
    {
      "time": " 1.Mar.2008 10.46pm",
      "content": "The Pelican Shakespeare was a special one-volume hardcover, collecting all the texts from the individual volumes in the Pelican Shakespeare series, edited by Alfred Harbage. The Pelican Shakespeare texts were all edited and produced by the American branch of Pelican, which was then based in Baltimore rather than New York, more or less to show what it could do. (The Penguin Shakespeare was British, the Pelican Shakespeare, American.) Schmoller’s designs for the Pelican Shakespeare series (and the collected volume) included such nice little touches as non-arbitrary line numbering—only lines containing words that were annotated at the foot of the page were numbered. This worked perfectly in Shakespeare, given the high density of annotation. It was all set in Ehrhardt. And the quite wonderful complete hardcover version was published in 1969, originally with a green-and-gold spine. Later printings switched to red and gold, and at some point in the late 1980s or the 1990s, Penguin evidently lost or damaged the dies for the spines, so they mocked up new (red-and-gold) ones that didn’t look nearly as graceful as the old. Then, much more recently, they came out with a simply hideous new “Complete Pelican Shakespeare,” edited by Stephen Orgel, which is a sad and inadequate heir to the original.\n\nI have been on the go the past couple of days, but I will post some pictures of these books that I love as soon as I get a chance.\n\nIncidentally, the designs for the Penguin Poets covers in that Flickr group, and on some blogs that one finds references to there, are just amazing. I’m surprised no one has scanned them all in at high quality (instead of simply photographing them) and made them available to use, e.g., as Desktop Patterns. “Penguin by Design” has a nice spread on the Penguin Poets as well.\n\n"
    },
    {
      "time": " 1.Mar.2008 10.48pm",
      "content": "Giampa: You knew Hans Schmoller? Wow!\n\n"
    },
    {
      "time": " 8.Mar.2008 9.58am",
      "content": "The Monotype Recorder New Series Number 6 (April 1987) was a 64-page issue devoted to Hans Schmoller’s life and work.\n\n"
    },
    {
      "time": " 8.Mar.2008 10.30am",
      "content": "Hello Gerald! I hope all is well with you and the good ship retirement :-)\n\nChrisL\n\n"
    },
    {
      "time": " 12.Mar.2008 1.24am",
      "content": "About Tschichold: I just finished reading Christopher Burke’s “Active literature” and I must say that it is a great book, a wonderful research in European art and printing history (before Penguin Tschichold was involved with the avant garde German scene in the twenties and thirties). I really recommend this book, it’s a joy for the mind and the eye.\n\n“Only when the design fails does it draw attention to itself; when it succeeds, it’s invisible.” (John D. Berry)\n\n"
    },
    {
      "time": " 12.Mar.2008 3.12pm",
      "content": "I’ve just discovered that among my books I have a volume in the Complete Pelican Shakespeare (the Tragedies) designed by Schmoller. However it is a rather rough paperback printed in the early Eighties and I doubt anyone would find it particularly beautiful.\n\nHowever I also have a great 1955 penguin paperback volume of Rabelais, with a separate paper wrapper, set in a beautiful fine Bembo. I would guess that this is a product of the Tschichold design period.\n\nAh how inseparable Penguins are from my youth!\n\n"
    },
    {
      "time": " 12.Mar.2008 3.16pm",
      "content": "_Incidentally, the designs for the Penguin Poets covers in that Flickr group, and on some blogs that one finds references to there, are just amazing. I’m surprised no one has scanned them all in at high quality (instead of simply photographing them) and made them available to use, e.g., as Desktop Patterns. “Penguin by Design” has a nice spread on the Penguin Poets as well._\n\nI do agree with you Peter — those Penguin Poetry designs are wonderful. Many of them I had never seen before.\n\n"
    },
    {
      "time": " 29.Mar.2008 6.48pm",
      "content": "Dear Gerry,\n\nWhere could I pick up a copy of _The Monotype Recorder,_ new ser., 6 (April 1987)?\n\nSince starting this thread, I have gotten a copy of a nice little pamphlet from the Penguin Collector’s Society that has some nice illustrations and descriptions of work by Tschichold and Schmoller, including an essay by Schmoller.\n\n"
    },
    {
      "time": " 1.Apr.2008 9.32am",
      "content": "Peter,\n\nI just did a Google search on “The Monotype Recorder, new ser., 6 (April 1987).” The fourth entry was my first contribution to this thread. The fifth was a listing from a bookseller offering a copy for $30.\n\nIf you’d like to see the book before buying it, you might investigate an interlibrary loan through a local library, assuming it doesn’t already have a copy.\n\nGerry K\n\n"
    }
  ]
}
