{
  "id": "42649",
  "title": "Experiment with Futura.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm sure this exact thing has been done many times before, turning a font into just counters or outlines around the characters that aren't enclosed. I got inspired to try this after seeing counterless fonts several times, something that may have been inspired in turn by an earlier attempt at what I've just done.  \nSeveral of the letters were pretty easy, where there were many curves forming an enclosed or nearly enclosed space. The G and the Q gave interesting results, for example.  \nThe S and the rest of the \"straight line\" characters were more challenging. On these I just filled out the surrounding space by connecting up points visible from each other.\n\nThis was just for fun, the result is readable with a fair amount of effort, but the more I look at it, the more it grows on me.\n\nHow would you handle letters like L, I and J, or W/M, and are there some well-known examples using this? This probably falls under use of negative space, but there's more going on than just that, I think.\n\n| Attachment | Size |\n| --- | --- |\n| [Counters.pdf](http://web.archive.org/web/20131020153937/http:/typophile.com/files/Counters.pdf) | 54.7 KB |\n\n",
  "author": "TomN-CA",
  "time": "29 Feb 2008 — 1:06am",
  "uid": "19621",
  "comments": [
    {
      "time": "29 Feb 2008 — 3:52am",
      "content": "Hello.\n\nA2/SW/HK have recently used this concept to brand faulkner browns architects! Works very well indeed.  \nJust thought I'd post as it reminded me of your tpeface experiments etc.\n\n[www.a2swhk.co.uk](http://web.archive.org/web/20131020153937/http:/www.a2swhk.co.uk/ \"www.a2swhk.co.uk\")  \n [www.faulknerbrowns.co.uk](http://web.archive.org/web/20131020153937/http:/www.faulknerbrowns.co.uk/ \"www.faulknerbrowns.co.uk\")\n\n--  \nRez +\n\n"
    },
    {
      "time": "29 Feb 2008 — 3:01pm",
      "content": "Found another.  \nLook at the Blackberry logo, the berry is made out of the lower counter from the B.  \nIt's one of those logos I've always kind of liked, but I'd never looked that closely at it.\n\n"
    }
  ]
}
