{
  "id": "42640",
  "title": "words too tight",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I just bought a copy of Freight Text on the recommendations of many people on here, and while I like the look of the font, I'm not at all happy with how tight it is allowing the word spacing to go. I don't usually spend a lot of time adjusting H&J settings, but I messed around with the ones I know about, and nothing seems to help. Just in the first page of text it is doing this quite often. See circled line in the image below.\n\nAny ideas what I can do about this. Using InDesign.\n\n ![](http://web.archive.org/web/20130324051844im_/http:/typophile.com/files/tootight_5871.jpg)\n\n",
  "author": "typehunter",
  "time": "28 Feb 2008 — 4:39pm",
  "uid": "13413",
  "comments": [
    {
      "time": "28 Feb 2008 — 5:14pm",
      "content": "Try the settings in the justification dialogue box. Another thing is that you HAVE to turn on hyphenation – and use it – if you are ever going to achieve a harmonious page colour and line rhythm.\n\n ![](http://web.archive.org/web/20130324051844im_/http:/typophile.com/files/justification_4948.png)\n\nThe word spacing is pretty self explanatory. In the letter spacing section you should only allow a very small value to be added, and the same goes for glyph scaling, as that really can get ugly. Look carefully, adjust with the preview on, print and re-adjust until it's perfect... The rest of the fitting is then good old hand work. Be aware that if you are using the paragraph composer as opposed to the single line composer, you can get in trouble with preceding lines when you make changes by hand.\n\n"
    },
    {
      "time": "28 Feb 2008 — 5:53pm",
      "content": "glyph scaling? hmm i wouldn't scale the glyphs...  \neven if its just 1 or two percent....I was taught  \nto use the word spacing only.\n\nTry the word spacing first before you start changing  \nthe font.\n\nan other thing to ad more space:  \nTo adjust the wordspacing only use, select  \nyour line and...  \nexpand: option apple  \n and backslash (under the delete button)\n\ncontract: option apple and delete\n\nI agree with clauses...use hyphens  \ni know its not a common thing in english,  \nbut it is not wrong, as long as you split the  \nwords correct. Back at school I had to  \nlearn hyphenating for german and french,  \nnot english unfortunately,  \nso i wouldn't know how to do it...\n\n"
    },
    {
      "time": "28 Feb 2008 — 6:14pm",
      "content": "Glyph scaling should be invisible, and it can help nudge a line in place, so use with care. And again, there are no rules, it just have to look right... By the way I would also add hanging punctuation to the layout.\n\n"
    },
    {
      "time": "28 Feb 2008 — 6:42pm",
      "content": "Hyphenation is on, actually. See \"deterio-rating\" I tried it both on and off, and it didn't help this issue. I also did try all kinds of options with the word spacing & it didn't seem to help. I think it defaulted to 80/100/133 & I tried all the way to 100/100/133 & it didn't help. Clauses, I will try the specific settings you show, and also the slight letter spacing tomorrow I see if that does anything.\n\nWould it be a likely that any particular font would do this more than another? I've never seen any font go this tight on me before?\n\n"
    },
    {
      "time": "28 Feb 2008 — 7:24pm",
      "content": "Check your hidden characters, you might have a hard or soft return that's keeping things bunched up. I've had that happen occasionally. Also, the way you set your hyphenation might dictate whether a word is split or not, changing the amount of characters before and after a hyphenation will change when a word might hyphenate or not.\n\n"
    },
    {
      "time": "28 Feb 2008 — 7:32pm",
      "content": "is it possible to make the column a bit wider?  \nthis might fix it as well...\n\n"
    },
    {
      "time": "28 Feb 2008 — 9:10pm",
      "content": "Glyph scaling should be a last resort. You should be able to adjust this in the H&Js as suggested above. InD isn't as smart as it thinks it is.\n\n"
    },
    {
      "time": "28 Feb 2008 — 11:42pm",
      "content": "Freight has a slim space character.  \nIt's part of the type's design.  \nYou can see its width in a flush left setting.\n\nTo \"widen\" any font's space character in justified setting, make the \"Word Spacing\" mimimum larger than 100%.  \nTry 125%, which will effectively increase the width of the space character by 25%.\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:26am",
      "content": "According to Dowding and Gill, tight word spacing shouldn't be a worry. In fact, tighter word spacing might _improve_ readability.\n\nI know I prefer tighter word spacing when running newspaper text, because justifying narrow newspaper columns is a pain, and I'd much rather have it too tight than too loose and have rivers running all over the place.\n\n"
    },
    {
      "time": "29 Feb 2008 — 2:12am",
      "content": "<cite>In fact, tighter word spacing might improve readability.</cite>\n\nI agree. With a lot of typefaces, I tend to decrease the default word space, to something like 90–95%. Depends on the typeface (and size, leading, line-length &c), of course.  \nBut the more important part is: word spacing, be it tighter or wider, should be _even_.\n\n<cite>Hyphenation is on, actually. See “deterio-rating”</cite>\n\nIs the language set to the right value? Could be another pitfall. English words won’t break (at the right point, or at all), if the paragraph’s language is set to French.\n\nF\n\n"
    },
    {
      "time": "29 Feb 2008 — 5:27am",
      "content": "First of all, I don't agree that those lines are too tight. They are not ideal, but that's a different issue.\n\nThe points above on adjusting the space settings are correct -- I've gone into fonts an changed the wordspace value, and it has the same effect as changing the min-ideal-max settings. So, you are left with finding the values you want, and accepting all the compromises.\n\nThings to think about-- You can get the effect of looser wordspacing with the same values by decreasing the leading. Space is as much relational as absolute. One of the reasons designers went to greater leading was to get the appearance of tighter wordspacing.\n\nA second option is to slightly increase the space values, and increase the measure. I use different minimum values depending on the measure. If we're setting short measures -- say 18 picas in a double-column text, I'll go way down on the minimum. If it is a longer measure, raise it. Why? Because it is all a compromise. The best way to get text to fit as you want it is to rewrite the text. Usually not an option. But wordpace values, hyphenation, line length, etc. are all compromises you have to make.\n\nFor example, consider the compromises Dowding was willing to make in <cite>Finer points</cite>, in the Wace edition which showed what he really wanted. There are a few lines where there are no word spaces at all, only hair spaces -- his preference in compromise in order to avoid a \"loose\" line. There are places too, where the natural space between a parenleft and the following letter are greater than the wordspace [eg. \"(a\"] he uses in the line. Again, a compromise he wanted to make. And I think he was wrong -- not so much in his words per se., as in the compromises he showed he was willing to make.\n\nLong, long ago, I tried a test. I set a journal article two ways, once with tighter wordspace values, once with looser spacing. Not much, jut a touch. Sent the samples to the publisher. All (yes, all) the designers preferred the tighter setting. All (yes, all) the editors preferred the looser setting.\n\nAs a compositor, you have to get a sense of these things, and consider your several obligations -- e.g., who hired you (usually a designer) versus who's reading the text.\n\nFWIW\n\n"
    },
    {
      "time": "29 Feb 2008 — 5:55am",
      "content": "Like Charles, I don't feel that the circled line is necessarily too tight. I think the effect is exacerbated by the lines directly above and below it, and by the fifth line, which is looser than I like.\n\nIf you feel that the native value of the word space in Freight is too narrow and is contributing to lines that are too tight, then just messing with the Minimum value won't necessarily yield the results I think you're looking for, because I think the Min/Max values only really affect the outer limits.\n\nI recommend this approach:\n\nFirst, set some sample paragraphs unjustified, flush left/rag right. See how the word spaces feel in this setting. If they are indeed too tight, then adjust the value for Desired word spacing in the Justification dialog until it is more comfortable for you.\n\nThen adapt your Minimum and Maximum based around this Desired value. Switch to justified setting and fine-tune the Min/Max to taste.\n\nYou might also consider adjusting the slider at the bottom of the Hyphenation settings to allow more hyphens for better spacing. It's hard to tell from just one sample, but it looks to me like allowing a little bit more hyphenation might even things out a bit more.\n\n-- Kent.\n\n"
    },
    {
      "time": "29 Feb 2008 — 6:30am",
      "content": "Yeah, I printed out the first sample ragged & it didn't bother me, even though the spaces were just as tight. I think it was only when I tried it justified & you had tight line spacing next to loose line spacing that it started to bug me. Now that I look at the ragged version closer, it is pretty tight there too. It may be exasperated, because in this type of book, I like to do loose leading. I think the loose leading may be contributing to the word spacing looking too tight. If I used it in a magazine setting with tighter leading, I'd bet it would feel better.\n\nAnyways, adjusting the desired word spacing up, seems to help, so thanks for that suggestion. I have never got into this detail with typography before, so it's great to have all this great input.\n\n"
    },
    {
      "time": "29 Feb 2008 — 7:13am",
      "content": "<cite>because in this type of book, I like to do loose leading.</cite>\n\nWhy? because it is all the rage? Spatial relationships all have to work together. That includes intercharacter space, word space, line space, and very important, margins.\n\nWatched <cite>Bernard and Doris</cite> on HBO the other night, and went & dug out Durden's <cite>The Dukes of Durham</cite>, published in 1975. That book was set Linotype metal. At first, you do notice the old technology a bit, but then you don't & can enjoy the book. A rather timeless design.\n\nContrast that to <cite>A Legacy of Ashes: The History of the CIA</cite>, by Tim Weiner. A Pulitzer-Prize winning book. No bottom margin. Top margin too great. Space between running head & text too great. It bothers the hell out of me on every page.\n\nWhile I do think it is true that all books reflect the time of their manufacturing, designs that don't try to tart things up too much, that don't slavishly follow the current fashion, fare rather better over time. Not just my opinion, it is also what the likes of Ron Costley & Rich Hendel advise.\n\n"
    },
    {
      "time": "29 Feb 2008 — 7:18am",
      "content": "Indy\n\noption+apple(command)+delete=reduced word space\n\ncontrol+option+apple(command)+\\=increase word space\n\nGood for quick global changes when fitting. Select blocks of text at a time.\n\n"
    },
    {
      "time": "29 Feb 2008 — 7:55am",
      "content": "Wow James, that is very cool, thanks. But I think it's shift+option+command+backslash to open up word spacing.\n\n"
    },
    {
      "time": "29 Feb 2008 — 8:27am",
      "content": "pwnd!\n\n"
    },
    {
      "time": "29 Feb 2008 — 8:50am",
      "content": "Are you Quarking me?\n\nBoth work in Indy, but the shift gives a larger jump and the control version is a fifth of what you get when you start with shift—for smaller increments.\n\nI guess everyone already knows this and I’m just being goofy by pointing it out?\n\nAlso, I have to use the control because I have not disabled the OS shortcut that conflicts with the shorter key combo.\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:16pm",
      "content": "Loose leading because its a picture heavy book with a lot of white space and a loose grid, and tight leaded text doesn't seem the right way to go. I probably won't justify it anyway, really was just playing around and getting a sense of the font at this point. Am starting to think it might not be the most appropriate font for this job anyway. May save it for some other project.\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:24pm",
      "content": "I didn't know it! I know how to track using key commands but I didn't know the same could be done for word spacing.\n\nI don't know what's up with Dan's comment.\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:57pm",
      "content": "<cite>Loose leading because its a picture heavy book with a lot of white space and a loose grid, and tight leaded text doesn’t seem the right way to go.</cite>\n\nOK, that makes sense.\n\n"
    },
    {
      "time": "29 Feb 2008 — 1:53pm",
      "content": "Sorry Patty, `pwnd` is computer nerd code for \"owned\" and means that you owned him, as in \"you got him good and he knows it!\"\n\nI'll shut up now :(\n\n"
    },
    {
      "time": "4 Mar 2008 — 1:53am",
      "content": "My way of obtaining even colour is using different H&J-settings defined in separate paragraph-styles. These can be very subtly different (like just upping the Desired (aka Mediate) Wordspacing a notch). Seeing what looks ok is just a matter of applying a few keyboard-combinations ; )  \nTypically I'd put these styles on the numberspad next to each other.\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
