{
  "id": "42654",
  "title": "Feedback more than welcome...",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi Typophiles, Typophilians and Typophilia,\n\nI know I’m new round here but I would be eternally grateful if I could gage a reaction to the logomark I have designed below. If you could let me know what you can see in it, and the nature of the business that it is intended for that would be great!\n\n ![](http://web.archive.org/web/20080709010431im_/http:/www.typophile.com/files/dreamsarescape_3693.png)\n\nThankyou\n\n [‹ Logo for Financial Svcs Program/Forum](http://web.archive.org/web/20080709010431/http:/www.typophile.com/node/42097 \"Go to previous forum topic\") [youth sports trading card company logo ›](http://web.archive.org/web/20080709010431/http:/www.typophile.com/node/32915 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080709010431/http://www.typophile.com/user/27737\" title=\"View user profile.\">itsgareth</a>",
  "time": "<br>",
  "uid": "27737",
  "comments": [
    {
      "time": " 29.Feb.2008 3.58am",
      "content": "Welcome to the forums! : )\n\nWell... I see a pencil. Is something going on with the ’rubber’ tip..?\n\nPersonal comments;  \nKeep it simple. Is there too much going on? Strip it right down to the core. Will it work as 1 colour, grayscale even?  \nIm still trying to figure out what its saying... or the wit within it, should I say.\n\nIll be interested to see what this turns out like.\n\n—  \nRez +\n\n"
    },
    {
      "time": " 29.Feb.2008 4.32am",
      "content": "Thanks for your comments Rez,looking forward to more peoples opinions before I explain it..hopefully I wont need to.\n\n"
    },
    {
      "time": " 29.Feb.2008 5.05am",
      "content": "hello, im new to here, i think you will enjoy it!\n\nwhat this pencil brings me in mind... is the word VOID.  \nwhy is that? well the first part is like an individual speaking on transmitting a message, thats where i get vo... (voice) thi midle part brings me a (i) simply because of the shape and similarly the last part brings me out a (D)... so i see void and i actually like it a lot.\n\nI would say that the nature of business that this mark was intended to represent is a comunicational party, or transmitional party, something like blogs, probably, because of the fact that in blogs, people “write” their oppinions, they “submit” their thoughts ...\n\ni dont know if i got even close to what the logos actual work is but i think thta if you consider the above you will find that it is a pretty much logical explanation.\n\n"
    },
    {
      "time": " 29.Feb.2008 6.56am",
      "content": "Il give you a hint, the company is called “dreamscape”\n\n"
    },
    {
      "time": " 29.Feb.2008 7.09am",
      "content": "It’s OK to have to explain the meaning behind a logo. A logo doesn’t have to tell a novel-length story all by itself.\n\nThat said, I see a green pencil with a D on the end and a speaker icon on the front.\n\n"
    },
    {
      "time": " 29.Feb.2008 7.12am",
      "content": "Thanks for your comments darrel, think I recognise your work from the pond ;)\n\nDo you think this will design will perform well for a design agency? or is the pencil a bit of a cliche??\n\n"
    },
    {
      "time": " 29.Feb.2008 10.01am",
      "content": "I see radio waves, and a D\n\n"
    },
    {
      "time": " 29.Feb.2008 12.22pm",
      "content": "I’d say a pencil is cliche in the way scales of justice are cliche for a lawyer or a hammer is cliche for a carpenter.\n\nSometimes, it’s OK to use a cliche ;o)\n\nIt’s a nicely designed pencil, so I’d say, sure, it will work just fine for that purpose.\n\n"
    },
    {
      "time": " 29.Feb.2008 2.06pm",
      "content": "To me a pencil says elementary school.\n\nI see the D also, obviously.\n\nI’m guessing the front of the pencil with the led is supposed to be some sort of waves? Sound waves?\n\n"
    },
    {
      "time": " 5.Mar.2008 4.58am",
      "content": "Thanks everyone for the feedback on this. Heres another concept I have developed and moulded from the previous design. Still not set on the colours, but would love some feedback if possible. Again let me know what you see, cheers!\n\n ![](http://web.archive.org/web/20080709010431im_/http:/www.typophile.com/files/tester_6675.png)\n\n"
    },
    {
      "time": " 5.Mar.2008 10.48am",
      "content": "bee in motion.\n\n"
    },
    {
      "time": " 5.Mar.2008 9.26pm",
      "content": "Sauron (yes I thought of that)\n\n"
    },
    {
      "time": " 6.Mar.2008 7.55am",
      "content": "I don’t understand, are you designing logos and then trying to figure out where or who they’d work well for?\n\n"
    },
    {
      "time": " 6.Mar.2008 8.52pm",
      "content": "I’ve been through way too much therapy for this business. The silly bee looks great for web applications, however.\n\n"
    }
  ]
}
