{
  "id": "42655",
  "title": "Poster",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi Everyone,\n\nI’ve recently been asked by the local student arm of the Green party to make them a poster. Although it’s too late to make any changes for the actual event (already gone to print), I’m interested to get some feedback because it was something of a new adventure into an almost Constructivist style.\n\nI would love some criticism.\n\nThanks!\n\n-Rafe\n\n| Attachment | Size |\n| --- | --- |\n| [15.pdf](http://web.archive.org/web/20081008043536/http:/typophile.com/files/15_0.pdf) | 22.68 KB |\n\n [‹ Functional / 'Freight' display type](http://web.archive.org/web/20081008043536/http:/www.typophile.com/node/42700 \"Go to previous forum topic\") [Suggestions for a symbol ›](http://web.archive.org/web/20081008043536/http:/www.typophile.com/node/42681 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081008043536/http://www.typophile.com/user/26154\" title=\"View user profile.\">rafe.copeland@g...</a>",
  "time": "<br>",
  "uid": "26154",
  "comments": [
    {
      "time": " 29.Feb.2008 5.12am",
      "content": "Hello, i think that theres a hierarchy problem going on it there, to do this kind of layouts, you must organize them in the most bizare but legible way, i believe that there is a problem with lettering beeing too close to the edjes of the pages, this is something that confuses the eye, the numerous types of font weights make the eye follow a balance line, getting to confusing with them, you make the viewer to lose his mind and just stop trying to read the poster, also, i have been writting this for about 2 minutes and i have already forgotten the message, the only thing i remember is GREEN, that is because green had something different on its shape (leaf) , i dont know but i would say, take it easy with the typefaces, use max 2 weihts or correctly justify the use of more through your design.\n\nandreas\n\n"
    },
    {
      "time": " 1.Mar.2008 4.46pm",
      "content": "Rafe — I like this, though the El Lissitzky style really cries out for a bar of crimson red somewhere in the design. Without that it looks a bit anaemic. But I like the angled type and I think it’s well balanced.\n\n"
    },
    {
      "time": " 1.Mar.2008 6.53pm",
      "content": "Thanks for your comments; I would like to put some colour in there, I will try that out (the poster had to be black and white on this occassion though). And yeah, I used four different weights; perhaps I overdid it a bit there, though I think the type up to the edges is part of what gives it its dynamism.\n\nI appreciate all of your feedback!\n\n-Rafe\n\n"
    },
    {
      "time": " 1.Mar.2008 9.17pm",
      "content": "Of course a slab of very rich green would provide a counterpoint to Lissitzky’s/Malevitch’s usual red.\n\n"
    }
  ]
}
