{
  "id": "42662",
  "title": "Gotham in Ten Years",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "You probably have to be in your 40s to answer this, but maybe not. Maybe younger and astute students of recent type history will have opinions. Will Gotham ten years from now seem like Eurostyle did in the '80s? Is it so popular and such a summation of the current times that in ten years it's going to seem dated and trite? Eurostyle was everywhere in the '70s and then in the '80s it quickly fell out of favor. Is the same fate waiting for Gotham? I'm off to a meeting where Gotham may be the best type choice. But I'm hesitant to consider it because this project will need to have legs for many years to come, and I'm thinking that Gotham is over the line of being overused the way Eurostyle was in the 1970s.\n\n",
  "author": "BlueStreak",
  "time": "29 Feb 2008 — 7:52am",
  "uid": "9700",
  "comments": [
    {
      "time": "29 Feb 2008 — 8:08am",
      "content": "I doubt Gotham will go the way of Eurostile because Gotham is much less noticeable than Eurostile. Eurostile is a wonky design that really stands out and screams for attention. Gotham was designed after years of research into vernacular letterforms that people are used to seeing; it’s popularity will eventually make it a vernacular typeface and/or ensure that plenty of derivative works pop up. I see the future of Gotham as being similar to FF Meta; designers will be a lot more reserved about using it, identity systems around it will get redone for the same reasons they always do, and it will remain out there but be a lot less everywhere.\n\n"
    },
    {
      "time": "29 Feb 2008 — 8:36am",
      "content": "Based on the models used for Gotham it's already stood the test of time. The only way I can see if falling from grace is if Microsoft licenses it and ships it with Windows or Office.\n\n"
    },
    {
      "time": "29 Feb 2008 — 8:44am",
      "content": "I hear your concerns. In my opinion, its already saturated. I think the difference with Eurostile (or Microgramma as I call it) is that it was more adaptable than Gotham. For example, Microgramma could be used on letterhead, but it could also be used for dishwashers, car batteries, and tennis shoes with distinction and prose. Gotham cant do that. On the plus side, Gotham is more \"safe\", and its harder to pick it apart, so a lot of designers want a more bullet-proof campaign, but in a sense, that also makes it less memorable, so its a trade off of sorts.\n\n"
    },
    {
      "time": "29 Feb 2008 — 9:39am",
      "content": "I love you, Si.\n\n"
    },
    {
      "time": "29 Feb 2008 — 9:53am",
      "content": "\\> Will Gotham ten years from now seem like Eurostyle did in the ’80s?\n\n[The Crystal Ball's reply:](http://web.archive.org/web/20150426204519/http:/predictions.astrology.com/cb/)\n\n_Probably not going to happen_\n\nSo, don't worry too much. Use it.\n\n"
    },
    {
      "time": "29 Feb 2008 — 10:57am",
      "content": "I think Gotham will stand the test of time, it's an instant classic, but it is so overused right now that you might want to consider an alternative just to distinguish your design from the pack.\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:00am",
      "content": "Stephen,\n\nCare to enumerate the alternatives to Gotham? Might be very handy....\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:01am",
      "content": "Gotham is the new Helvetica. Like it or not, it builds on the heritage of the past and distills the essence of American vernacular lettering into a single typeface, which gives it broad and lasting appeal (particularly in America). Maybe my likeness falls short in respect to Gotham's universal appeals. I'd be curious to find out if it is as much used in countries other than the states.\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:25am",
      "content": "<cite>I’d be curious to find out if it is as much used in countries other than the states.</cite>\n\nWell, it’s not like Gotham was some peculiar face that would catch one’s eye … but I must admit I haven’t noticed it _at all_, neither in publications nor public space, over here in Germany. Maybe I’m just ignorant … on the other hand, I _do_ notice Univers, Helvetica, DIN, Frutiger, AG or Meta all the time.\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:34am",
      "content": "\\> Gotham is the new Helvetica\n\nMore simple: Gotham is Gotham.  \nAnd what is 'overused' — 100? 200? 2,000? . We say 'popular/successful song/book/band/movie....'. — what's wrong with popular or successful font?\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:41am",
      "content": "<cite>And what is ’overused’</cite>\n\nOverused is when designers use it because it’s cool, not because it’s appropriate. I can think of a few places in DC that picked Gotham because it’s hot, and not because they were looking for a font that wouldn’t look out of place ten feet tall and stuck on the front of a Beaux-Arts building. The same goes for the health club management magazine I saw using Neutraface on the cover.\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:44am",
      "content": "When the underground goes pop, it sells out then loses its street cred. You gotta keep it real and only be popular among those who liked you before you got popular. Who wants to belong to a club that would have them as a member?\n\nComplete nonsense, but so it goes.\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:50am",
      "content": "\\> Overused is when designers use it because it’s cool\n\nSo, the right term/word is misused. And why to \"blame\" the font; \"blame\" the designers, no?\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:50am",
      "content": "I agree with all that Gotham is a classic and will not go out of fashion like more stylized or faddish typefaces. It's around for the long haul, and I'm fine with that.\n\nFor some jobs, it makes sense to go for something different. The most obvious alternative to Gotham is Proxima, which actually preceded it. [Proxima Nova](http://web.archive.org/web/20150426204519/http:/www.fontshop.com/fonts/downloads/mark_simonson/proxima_nova_complete_ot/) gives you more weights and widths, and alternative glyphs like a single-story 'a' — a small detail that can convey a surprisingly different feeling overall.\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:06pm",
      "content": "Actually, as an aside, Gotham's conversion to OpenType brought it an alternate single-story \"a\" which can be accessed from Stylistic Set 3 and the Stylistic Alternates feature.\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:17pm",
      "content": "Thanks for all of the input. I was thinking that someone might ask me what kind of product, company, or service I was thinking of using Gotham for. Then I wondered if it would matter. Would it?\n\nOverused is when a type is used for everything, everywhere. (Neutraface was slow to get momentum in this category, but is well on its way now.) Considering the use of Gotham more, it seems to have potential, to my sensitivities at least, to be used for almost anything, anywhere. Also from my perspective it _is_ being used for everything and used everywhere. So I find myself feeling about that face the same way I feel about Helvetica. It's the best possible choice and the worst possible choice all at the same time.\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:18pm",
      "content": "Helvetica? Helvetica was designed to be non-vernacular, it's almost anti-vernacular, it's opposite to Gotham.  \nMaybe Gotham replaces Interstate in the graphic design scene - with the advantage of being more carefully built. In fact Gotham seems so carefully built that time will probably be fair to this charming face (the italics are too slanted for my taste, but that's part of its charm).  \nEurostile reminds me of Stainless: it's fashionable and interesting, but it speaks too loud and we soon get tired of it. That's not the case of Gotham, which is a more subtle font.\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:22pm",
      "content": "<cite>And what is ’overused’ — 100? 200? 2,000? . We say ’popular/successful song/book/band/movie....’. — what’s wrong with popular or successful font?</cite>\n\nOverused means it is everywhere you look. It is in magazine designs, subway ads, web sites, logos (hello Typophile) you name it. It is a versatile, attractive font—understated yet with character. Nothing is wrong with that, of course (especially if you're H&FJ!) but if you use it right now you do run the risk of seeming to follow rather than lead the pack.\n\nDavid, haven't you ever grown tired of a song you like because it's being used in car ads on TV?\n\n"
    },
    {
      "time": "29 Feb 2008 — 2:22pm",
      "content": "I think Gotham has a more neutral look, similar to Helvetica, and will help it look less dated in 10 years, whereas Eurostile comes in and out of fashion because it is more stylized.\n\nIt will get used less, but probably because something will come along to replace it as the favorite font, not because there is anything wrong with Gotham.\n\nDavid\n\n"
    },
    {
      "time": "29 Feb 2008 — 2:41pm",
      "content": "I think the original poster of the thread is referring to its use in multiple applications. You all speak mostly of Gotham's advertsing & marketing uses. Does Gotham cover a lot of ground there? Saturatedly yes. Does it cover as many physical applications as Microgramma could? No. And the same would apply today as well.\n\n"
    },
    {
      "time": "29 Feb 2008 — 8:33pm",
      "content": "I disagree with your premise: when I started designing in the seventies, all us young designers in NYC thought Eurostile was crap and in fact we seldom saw it used, well or badly.\n\nAnother thread went into Avenir vs Gotham pretty thoroughly, and I agree that Avenir will prove the more lasting because its excellence is less obtrusive, more natural, nearly transparent. But I have nothing against Gotham: it just has a way of calling attention to itself that Avenir does not.\n\nNow if you asked, back when it was new, if Syntax would be old milk in ten years...it's been around since 1968 and it's stronger than ever, having inspired a long run of wannabee type designs.\n\n"
    },
    {
      "time": "1 Mar 2008 — 11:13am",
      "content": "I may not have the best insight here, as I was under ten years old for the entire decade of the eighties, but are we speaking of Eurostile's current applications, or it's applications when it was new and fresh in the eighties? I would relate it more to that of the one-trick-pony Bank Gothic, which we have all learned is required by law on all sci-fi/action epic movie titles, end credits, and dvd cases. Eurostile to me only has this one voice, whereas Gotham has an overal neutral tone to it. For the sake of discourse, if we were to say that Gotham is kind of like Helvetica in it's voice, then I think the applications are decidedly more endless than that of Eurostile.\n\n"
    },
    {
      "time": "1 Mar 2008 — 11:40am",
      "content": "If anyone knows what will be considered popular, inventive, classic, or influential in 2018, then they are going to be the only millionaire in type design.\n\n"
    },
    {
      "time": "1 Mar 2008 — 11:42am",
      "content": "_when it was new and fresh in the eighties_\n\nThe 80s was actually seeing a revival of Eurostile, which dates from the early 60s (or really the early 50s if we consider its beginnings in the all-caps Microgramma).\n\nWhich may suggest that if Gotham looks outdated in 10 years, in 20 it might be worth another look!\n\n"
    },
    {
      "time": "1 Mar 2008 — 5:41pm",
      "content": "[http://www.onthemedia.org/episodes/2008/02/22/segments/94075](http://web.archive.org/web/20150426204519/http:/www.onthemedia.org/episodes/2008/02/22/segments/94075 \"http://www.onthemedia.org/episodes/2008/02/22/segments/94075\")\n\nThis was on several blogs last week. Sam Berlow from The Font Bureau talks about the various typefaces and identities used by the various presidential candidates. For Obama, he compares Gotham to a \"set of freshly manicured nails,\" and says its the \"metrosexual\" one of the bunch. I don't know if I agree entirely with that statement, but I do think it's harder to make Gotham look blunt, dull and ugly than Helvetica, which is a rather easy task.\n\n"
    },
    {
      "time": "2 Mar 2008 — 8:34pm",
      "content": "You said it, Josh. Gotham can be easier to abuse given certain contexts, but it's a much easier font to work with in the genres implied.\n\nAs far as font usage in ratio to neutrality, it should scale upwards, in that eurostile is far more discernable it should be far less used than Gotham. The same can be said when using Gotham and Avenir. The more identifiable a font is, the less it should be used overall. Although more applications in which a graphic designer is hired tend lend themselves to a certain style that we think of as being \"metrosexual\" etc.\n\nAs a side note, I was in San Francisco this weekend and saw enough Futura and Eurostile to make me hurl, and any use of Gotham was a breath of fresh air. That being said, I do rather wish we could catch ourselves so as to not have the same thing happen with Gotham, as the OP was talking about.\n\n"
    },
    {
      "time": "3 Mar 2008 — 3:34am",
      "content": "_The only way I can see if falling from grace is if Microsoft licenses it and ships it with Windows or Office._\n\nThey probably won't. They might however do their own version that will elevate the Microsoft haters to yet another level.\n\n"
    },
    {
      "time": "3 Mar 2008 — 11:47am",
      "content": "I think it's becoming harder and harder for people to hate on Microsoft's type, especially with Apple settling into serious mediocrity with the fonts they ship. I haven't worked on a PC since Windows 98, but the new \"C\" fonts that shipped with Vista are not only good for Windows, but are some of the best fonts released in the last few years. And with ClearType and everything, it's clear Microsoft has placed typography as a high priority. Everything in the world has gone completely upside down!\n\n"
    },
    {
      "time": "3 Mar 2008 — 11:50am",
      "content": "Maybe in 10 years, Microsoft will be seen as the gold-standard of quality typography? Of course, they can never take fonts out once they've added them, so Windows will always have fonts that will end up as god-awful email signatures for secretaries across the land.\n\n"
    },
    {
      "time": "3 Mar 2008 — 12:07pm",
      "content": "Right, it's hard to take fonts out of a product - but like the Cylons there is a plan. #1 sell fonts to Apple so they get the positive glow aura effect of shipping on the iPhone, and #2 add font management features to the products so although the Secretary-loved fonts are still there under the hood they may not be as redily exposed.\n\n"
    },
    {
      "time": "3 Mar 2008 — 12:35pm",
      "content": "This makes me wonder what would anger more people: keeping Comic Sans and Arial around forever, or getting rid of them.\n\n"
    },
    {
      "time": "3 Mar 2008 — 12:52pm",
      "content": "There was an erroneous article in the German press a few years back that said Arial was going away – that article generated a much greater degree of concern amongst customers than the blanket use of Comic Sans in restaurant menus across Europe ever has.\n\n"
    },
    {
      "time": "3 Mar 2008 — 2:50pm",
      "content": "\\> David, haven’t you ever grown tired of a song you like because it’s being used in car ads on TV?\n\nLet me think...... :^)\n\n"
    },
    {
      "time": "3 Mar 2008 — 6:54pm",
      "content": "[Gotham](http://web.archive.org/web/20150426204519/http:/typophile.com/wiki/Gotham) is much more likely to go the way of [Meta](http://web.archive.org/web/20150426204519/http:/typophile.com/wiki/Meta) or of [Trade Gothic](http://web.archive.org/web/20150426204519/http:/typophile.com/wiki/Trade%20Gothic) or of [DIN](http://web.archive.org/web/20150426204519/http:/typophile.com/wiki/DIN). Each of these is classic, and will always remain classic. But as with any classic it will show its stamp of time.\n\nSo, what is today's Eurostile?\n\n"
    },
    {
      "time": "3 Mar 2008 — 7:35pm",
      "content": "This is my first post, I've been watching for a long time. Can it really be said that Gotham will be like Meta and Trade Gothic? I never see the lowercase used, only caps, and the italics seem to be less than popular, no?\n\nFarquart\n\n"
    },
    {
      "time": "3 Mar 2008 — 10:18pm",
      "content": "_So, what is today’s Eurostile?_  \nIronically, I believe it is the square sans superfamily. Klavika, Apex etc. I think this look is characteristic of our times and will fall from grace.\n\n"
    },
    {
      "time": "4 Mar 2008 — 1:38pm",
      "content": "Randy -- totally agree with you, although I must admit I use these square sans faces on a ton of projects. Probably not a good option for long-term identities, but it works well for a lot of ephemeral projects. Comparing Apex and Klavika: Apex will probably age more gracefully, and Klavika will probably scream \"first decade of 2000s.\" Apex kind of makes me think of Legacy Sans -- obviously from the 80s, but still suitable for a lot of projects. I imagine Apex will be like this: obviously from this decade, but still suitable for making things look clean, crisp, and machined 20 years from now.\n\nSii -- I love the idea of having the ClearType collection on Apple Products. Any idea when this will start shipping on iPhones and Macs? (Maybe it already has, since I haven't looked at new computers in a couple years).\n\n"
    },
    {
      "time": "4 Mar 2008 — 3:51pm",
      "content": "Hi Josh, nothing to announce on that front as of now. However, Apple does add fonts based on customer demand, so ping your favorite Apple employee (like that guy with all the piercings and tats who works at the U-Village Apple store). Also if you work for a big Apple customer a request is more likely to make it down the chain to the Apple font group. ;-)\n\n"
    },
    {
      "time": "4 Mar 2008 — 6:21pm",
      "content": "I will alert the geniuses at the GeniusBar -- \"add ClearType.\" I'm not familiar with the tat dude, but I love the girl with curly hair at the Genius Bar, she knows what she's doing. I know a lot of designers at MS use Macs (at least upper-level people who can get away with it), so I wonder if there's people at Apple who use PCs? Probably not -- guru Jobs would have them cleansed from the eyes of the chosen.\n\n"
    },
    {
      "time": "5 Mar 2008 — 5:08am",
      "content": "The 'ilarious irony of this thread, (to me) is, that as a result of the decisions made in OS lands, the simplified square sans are going to be the rats, pigeons, and cockroaches of type's future. The simplified square sans is what survives best on TV and the web in the face of low resolution, and ad hoc, or semi-ad hoc rendering. When the previously mentioned decision-makers 'took away' size-dependent type enabling of all kinds, they sealed the deal against such marvels as Gotham, because both clients and designers understand, visually, what works best for both print and screen-based media, wins for both! So, get used to 'em.\n\n\"...— I love the idea of having the ClearType collection on Apple Products.\"  \nHey!, have you looked at 'em on the Mac? You can kiss, Apple and Apple's big customers from foot to navel, inclusively, and it ain't a gonna make your idea look better. The ClearType collection ain't just dressed in frog suits you know. ;)\n\nCheers!\n\n"
    },
    {
      "time": "5 Mar 2008 — 5:21pm",
      "content": "David -- I don't particularly want the ClearType collection because I think those fonts are going to help me design better, although I think they're all beautifully done and wouldn't necessarily count out using them for design projects. It's just that, as most deisgners can attest to, clients invariably run Windows, as do a lot of office-type people you need to communicate with. When you're talking about sending a client a .pdf for review, fine, who cares what fonts they have. But having ClearType fonts would be great when there's PowerPoint presentations and Word .docs being edited by people who run Windows, but you still want it to look semi-presentable and don't want to use Arial. This would just be really useful for office communications between Mac and PC users. I don't see how any harm (at least for the general consumer and designers) could come out of Microsoft licensing their ClearType fonts to Apple.\n\nAs far as square sans being the cockroaches and pigeons of type, you have a good argument. I love using them precisely for the reason you brought up -- I know they'll look good on screen and on paper. However, it doesn't matter how perfectly suitable these fonts are for various media, if people are forced to look at them long enough there's going to be a reactionary response, and everyone will start using condensed Bodoni or something for screen :)\n\n"
    },
    {
      "time": "6 Mar 2008 — 12:06am",
      "content": "The latest version of Office for the Mac includes the ClearType fonts, conveniently.\n\n"
    },
    {
      "time": "6 Mar 2008 — 7:57am",
      "content": "True, that and the fact that Ascender has been offering them to the graphic designer market since June addresses most of Josh's Mac scenarios. Beyond that however I think there's still value in them becoming as ubiquitous as the Web fonts, shipping with various devices and all OSs.\n\n"
    },
    {
      "time": "6 Mar 2008 — 8:08am",
      "content": "I agree that Gotham is a classic in the making. I say \"in the making\" because I think we're still a tad too close to it for it to be a classic just yet. I think the design community's collective love and appreciation of H&F-J is also contributing to Gotham's popularity (I am one of these appreciators, by the way). Its impression and structure is timeless, but it's not without its own unique characteristics. Gotham's widespread use will help it set into the concrete of visual cultural memory, making it feel familiar to even those who don't pay attention.\n\nBut, as has been pointed out elsewhere, it is a nod and a wink away from Avenir, particularly in situations where the full character set is not in use, so time will be the true test of Gotham's staying power. My vote is that it will endure, but who can say what will and will not linger? That's for future generations to decide.\n\n"
    },
    {
      "time": "8 Jul 2009 — 1:03pm",
      "content": "I'm addicted to Gotham. I dunno why - I can usually find a way to use it in a project and have it work and have a hard time finding a substitute because it doesn't resonate with me like Gotham does.\n\nIt's sort of annoying :p\n\n"
    },
    {
      "time": "10 Jul 2009 — 6:51am",
      "content": "Only a year later and Gotham seems to be becoming a has-been to me. Now everyone seems to be getting drunk on Klavika.\n\n"
    },
    {
      "time": "10 Jul 2009 — 9:48am",
      "content": "_...widespread use will help it set into the concrete of visual cultural memory..._\n\nEspecially if it becomes a reference point in the metaculture, which seems to be the case--for instance it is the main typeface of David Rault's new book _Guide pratique de choix typographique_, which will soon be published in English, I believe. (BTW, thanks for the book David--send me your address and I'll return the favour).\n\nI do think that types which achieve a critical mass of usage will continue to be used, this is my experience with Fontesque, which was very popular 15 years ago and continues to sell steadily at a modest level.\n\nI always think of Ridley Scott's scifi movies, Alien and especially Blade Runner, where past genres persevere, and Green Day!\n\nHas it always been that way, or does the present digital era erase the distinction between museum and warehouse, with the artefacts of culture remaining perpetually shiny and new? For all that one may criticize font formats, it is surely a huge benefit to foundries that font software formats have remained viable for twenty+ years.\n\n"
    }
  ]
}
