{
  "id": "42669",
  "title": "Complimentary Typefaces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can anyone point me as to where I should research complimentary typefaces? I am working on a huge contract designing custom photo albums evocative of coffee table books such as one would buy at the giftshops in museums. So the typefaces need to have a classic quality to them, they can be both classic fonts and modern streamlined fonts depending on the theme of the albums, be it weddings or births.\n\nFinally, does anyone recognize the fonts used in Martha Stewart's everyday food magazines?\n\nThanks ever so much.\n\n",
  "author": "tangospeak",
  "time": "29 Feb 2008 — 12:15pm",
  "uid": "27751",
  "comments": [
    {
      "time": "29 Feb 2008 — 12:44pm",
      "content": "You mean, like, fonts that tell you how good you look? Or do you mean complementary?\n\nYou didn't specify which parts of the MS magazine you wanted ID'd, but I know the ones I've seen use a lot of Gotham and Whitney, both from [H&FJ](http://web.archive.org/). Good luck.\n\n"
    },
    {
      "time": "29 Feb 2008 — 12:53pm",
      "content": "And of course there's H&FJ's newest type family for Martha's magazine, [http://typography.com/fonts/font\\_overview.php?productLineID=100033](http://web.archive.org/web/20150307043926/http:/typography.com/fonts/font_overview.php?productLineID=100033 \"http://typography.com/fonts/font\\_overview.php?productLineID=100033\")\n\n"
    },
    {
      "time": "29 Feb 2008 — 1:41pm",
      "content": "Well, if I used the right fonts for the mock albums, they would make me look good, no?\n\nYou're right - complEmentary fonts - that's what I'm looking for.\n\nFor the Martha Steward EveryDay Food magazines, I am looking at the September 2003 issue. It's a nice light font with slight serifs - rather friendly looking. Ideal for baby albums, I think.\n\nThanks in advance.\n\n"
    },
    {
      "time": "29 Feb 2008 — 1:52pm",
      "content": "Archer is not actually H&FJ's \"newest\" type family for Martha, just the most recent one that they're finally able to release for public license. Archer was designed back in c.2002. The Walbaum-ish serif face that they designed for <cite>Martha Stewart Living</cite> is newer (can't remember the name offhand), but isn't available for license. But I suppose I'm just nitpicking semantics.\n\nMartha's <cite>Everyday Food</cite> magazine uses Whitney pretty much throughout, almost exclusively. There are some numbers that look like Clarendon or Belizio (or perhaps custom from H&FJ in the same vein). But otherwise, Whitney Whitney Whitney. Unless something's changed in the last several months since I looked at a copy.\n\n-- K.\n\n"
    },
    {
      "time": "29 Feb 2008 — 1:59pm",
      "content": "Oh, sorry, didn't see your post about 2003 until after I posted mine. They may not have had the Whitney fonts in 2003. I don't have a 2003 copy around, so I can't say. Sounds like it might be Archer, which they were still getting a lot of mileage from in the Living series. I wouldn't be surprised if they launched Everyday Food in the same fonts as Living to piggyback on the brand, and only later distinguished it by shifting fonts. (I have a 2005 issue in Whitney as I described.)\n\nIf you posted a scan, I'm sure we could ID the 2003 fonts for you.\n\n-- K.\n\n"
    },
    {
      "time": "29 Feb 2008 — 2:01pm",
      "content": "One more thing: for wedding albums, consider Cyrus Highsmith's Biscotti, designed for <cite>Brides</cite> magazine.\n\n[http://www.fontbureau.com/fonts/Biscotti](http://web.archive.org/web/20150307043926/http:/www.fontbureau.com/fonts/Biscotti \"http://www.fontbureau.com/fonts/Biscotti\")\n\n-- K.\n\n"
    },
    {
      "time": "29 Feb 2008 — 3:16pm",
      "content": "One of these days, I'll name a face \"YouAreSOcreative!\"  \nIt will be a Frutiger clone.\n\n"
    },
    {
      "time": "29 Feb 2008 — 4:33pm",
      "content": "Thanks everyone! It WAS the Whitney font.\n\nStill looking for guides on complementary fonts...\n\n"
    },
    {
      "time": "29 Feb 2008 — 9:06pm",
      "content": "If you want museum art-book elegance, that's easy: Linotype Sabon with oldstyle figures (or the Adobe OpenType version), and, very selectively, Linotype Syntax with oldstyle figures. Sabon is very popular for museum displays and catalogues: in my view, it is the most nearly perfect serif there is. And Linotype Syntax is superior because its base weight is not too heavy, as with so many other sans families. Just remember the oldstyle figures--always makes a really nice difference. In my experience, Sabon looks best set 11/15.\n\n"
    },
    {
      "time": "29 Feb 2008 — 11:22pm",
      "content": "Bizarre coincidence - I am using Linotype Syntax for the smaller captions - looking up Sabon right now - yep, I have it. Thank you for the suggestions.\n\n"
    },
    {
      "time": "1 Mar 2008 — 8:52am",
      "content": "_Still looking for guides on complementary fonts..._\n\nDarden and Maag foundries have type testers where you can set up two (or more) types beside one another.  \nReminds me of type specimens where the pages are cut horizontally into three, so that you can view bits of different pages with other bits, if you know what I mean.  \nThere was a children's book I recall, Victorian possibly, _Heads Bodies and Legs_ -- from which the surrealist game _The Exquisite Corpse_ may have been derived.\n\n"
    }
  ]
}
