{
  "id": "42660",
  "title": "Can anyone help me identify this typeface?",
  "forum": "Thord's blog",
  "tags": [

  ],
  "content": "I have a client that wants me to use this typeface, and I cant seem to find it anywhere. I'm not even sure that is a typeface, and not some hand drawn special sort of thing.\n\n ![](http://web.archive.org/web/20150416170005im_/http:/typophile.com/files/ex_4927.gif)\n\n",
  "author": "Thord",
  "time": "29 Feb 2008 — 6:29am",
  "uid": "12494",
  "comments": [
    {
      "time": "29 Feb 2008 — 6:57am",
      "content": "It is artwork. Bernhard Fashion can be a option. If you need this very font, I can remake it for you in 48 hours, as a custom font. Caps and figures only.\n\n-Andre\n\n"
    },
    {
      "time": "29 Feb 2008 — 6:59am",
      "content": "Is that from a plotter? Interesting mix of extreme x-height and crazy kerning. But nice!\n\n"
    },
    {
      "time": "29 Feb 2008 — 7:24am",
      "content": "It's from some architectural drawings in a spanish book/magazine called El Croquis. Although it is quite quirky it actually works very well in these sort of drawings. Thanks Andre, I'll have to get back to you on your offer.\n\nThord\n\n"
    },
    {
      "time": "29 Feb 2008 — 9:13am",
      "content": "OK. This artwork appears to be done using a drawing device (rotring) used before the computer age to draw the text on a architectural plant.\n\n-Andre\n\n"
    },
    {
      "time": "29 Feb 2008 — 9:37am",
      "content": "You might dig [Neutra Drafting](http://web.archive.org/web/20150416170005/http:/www.fontshop.com/fonts/singles/house_industries/neutra_display_drafting/).\n\n"
    },
    {
      "time": "10 Mar 2008 — 7:50pm",
      "content": "Like minds. I thought of a rotring when I saw this. There was one in a weekly newspaper I worked for and I wish I had asked for it. It had a raft of adjustments and could even do italics. You used a relief template with the pointer and an engineering pen traced the letter with india ink. Does the fact that so many suspected that was the source mean we’re all grey beards?\n\n"
    },
    {
      "time": "10 Mar 2008 — 8:20pm",
      "content": "<cite>You might dig Neutra Drafting.</cite>\n\nI dig it man. (bongo drums playing in background)\n\nDo you know of any examples of it in use?\n\n"
    }
  ]
}
