{
  "id": "42674",
  "title": "FontCreator vs FontLab",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Recently, in a completely off-topic post in another thread, \"Fanatic Font Addict\" wrote:\n\n<cite>I’ve been on Typophile less than twenty-four hours and am not a professional font designer. However I felt obliged to point out the following. I notice there are repeated references in this forum to FontLab. However, no one seems to be familiar at all with a product called FontCreator. FontCreator is vastly superior to anything put out by Fontlab. I advise you to go to cnet.com and download a 30 day trial copy and see for yourself. (And I most certainly do not work for the company.)</cite>\n\nI have never used FontCreator from HighLogic. Looking at its feature list, it seems to be appropriately priced for what it does, and it may be quite capable in some areas. It supports up to 64K glyphs, and the \"professional edition\" is only $149.\n\nHowever, just going by the comparison chart on the HighLogic web site ( [http://www.high-logic.com/comparisonchart.html](http://web.archive.org/web/20150215140048/http:/www.high-logic.com/comparisonchart.html \"http://www.high-logic.com/comparisonchart.html\")), it has several \\*huge\\* shortcomings for many, probably most, professional users:\n\n1) FontCreator only runs on Windows ( [http://www.high-logic.com/fontcreator.html](http://web.archive.org/web/20150215140048/http:/www.high-logic.com/fontcreator.html \"http://www.high-logic.com/fontcreator.html\")). Most professional font developers use a Mac as their primary machine. (I'm not one of them, but I think it's important.)\n\n2) It can generate final fonts only with TrueType outlines, as .ttf (OpenType TrueType / Windows TrueType). It can't generate fonts as Mac TrueType, Mac Type 1, or Windows Type 1.\n\n3) It can only open .ttf and .otf fonts - it cannot open Type 1 (\"PostScript\") fonts.\n\n4) FontCreator has no built-in support for OpenType layout features - they expect you to use VOLT instead.\n\nI'm not saying these things to slam FontCreator. It may very well be a really wonderful tool for what it does. But I think the combination of those factors would utterly rule it out for the huge majority of professional type designers, which hardly makes it \"vastly superior.\"\n\nCheers,\n\nT\n\n",
  "author": "Thomas Phinney",
  "time": "29 Feb 2008 — 2:57pm",
  "uid": "909",
  "comments": [
    {
      "time": "29 Feb 2008 — 3:43pm",
      "content": "But are you disputing their claim of having the \"most popular font editor\"? ;)\n\nI think lack of OT features, PS outlines only, in and out, and PC platform only pretty much kill it as an option for me.\n\nThere has always been a market for this kind of tool but I don't think it really overlaps with the market for FL.\n\n"
    },
    {
      "time": "29 Feb 2008 — 4:01pm",
      "content": "Perhaps they should be comparing themselves with the other entry-level font editor: [TypeTool](http://web.archive.org/web/20150215140048/http:/www.fontlab.com/cgibin/t.cgi?a=310911&e=font-editor/fontlab-studio/). But even then, I don't think FontCreator matches up.\n\n"
    },
    {
      "time": "29 Feb 2008 — 6:22pm",
      "content": "I have tried it. I'm working a couple typefaces and can't afford to buy Fontlab at the moment...\n\nFont Creator's vector editing tools are cumbersome and unpleasant to use.\n\nFor that reason, I drew my characters in Corel. FontCreator lets you import shapes as JPEGs or gifs or you can drag and drop vectors, so I thought Id make the outline in Corel and turn them into a font in FontCreator. However, I found that (at least in my experience) it messed them up, adding nodes where none were intended or required and even adding bevels to some corners. So, I'll just save my pennies.\n\n-=®=-\n\n"
    },
    {
      "time": "3 Mar 2008 — 2:14am",
      "content": "I should note that it wasn't the folks from Highlogic claiming their tool was better than anything from FontLab, it was our newbie Typophile \"Fanatic Font Addict.\"\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "6 Mar 2008 — 1:47pm",
      "content": "Just some remarks explaining my previous endorsement of FontCreator. Its obviously a very complex product and also seems to be comprehensive in its functionality. But it also seems very well designed to me. I as a novice have been able to perform some fairly obscure tasks using it. Example one: I wanted to change the line spacing for an existing font, and was able to accomplish this within an hour of downloading FontCreator for the first time, having never used it or FontLab or any other font creation software previously. The second example is even more obscure. For a project I'm working on, I wanted to create a font that consisted of nothing more than varying advance widths - a different advance width for each character and no glyphs at all. FontCreator was the only product I figured out how to do it on, and I downloaded FontLab and several other products. Furthermore, FontLab seems to have all these different products with overlapping functionality, as if they've been operating as a partial monopoly and are really trying to maximize they're revenue through marketing.\n\nFinally, (and this is the primary reason I am adding to this thread now) I registered at the High-Logic Font Creator forum for the first time less than two hours ago, and my original question I posted in this forum has already been answered over there.\n\nSo, it just surprised me that no one here really seemed to be familiar with them at all.\n\n"
    },
    {
      "time": "6 Mar 2008 — 3:24pm",
      "content": "I first heard of Hi-Logic here on Typophile, so somebody here knows about it.\n\n-=®=-\n\n"
    },
    {
      "time": "6 Mar 2008 — 9:49pm",
      "content": "\"seems to be comprehensive in its functionality\"? Hmmm. That's kind of funny, I thought all four of those things I cited in my first post were really fundamental omissions.\n\nI think it's great that you find FontCreator easy to use. I would not for a moment defend the ease of use or approachability of FontLab, and I'm quite willing to believe that FontCreator could be vastly easier to use.\n\nBut of course all of the functionality you mentioned is present in FontLab (and presumably DTL FontMaster and FontForge as well, among others). None of those functions are particularly advanced or obscure, IMO.\n\nI'm curious about one thing, though: when you changed the line spacing, WHICH kinds of line spacing in the final font did you change? You see, there are several different values relating to vertical spacing in a TrueType font, and they are used in different ways on different platforms, and sometimes even by different applications on the same platform.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "7 Mar 2008 — 6:41am",
      "content": "T:\n\nAs far as the line spacing problem, there was this font I found that had a mottled antiquated times new roman appearance (\"Titus Cyberbit Basic\"), at least when rendered as bold I think, which I wanted to embed in an application I was developing. However, the line spacing was ridiculously large. So I downloaded FontCreator, could have been the first thing I found, and you're right, there's a profusion of terminology pertaining to this and just about everything else related to fonts. And yet I accomplished my task pretty quickly, and the fact the font was embedded in my own application made other platform-related issues a nonconcern. It looks like I tweaked typo line gap, win ascent, win descent, ascender, descender, line gap and probably some other things until I got the results I wanted.\n\nThat second problem I mentioned, developing a font consisting of varying advance widths, actually involved other things as well. For example I wanted the size of the font to be calculated only above the baseline. This as well I could only figure out how to do with FontCreator. (Development of this \"font\" had to do with embedding images in text.)\n\nHowever, when a complete novice can in short order be productive with a big complex piece of software, I think its an indication its very well designed.\n\nAs far as the four problems you mentioned, two of them were just that FontCreator doesn't run on a Mac. But those aren't deficiencies per se, just marketing decisions.\n\nJust think about it - FontLab has the fiecely loyal following and FontCreator is the new kid on the block. What do they have to bring to the table other than superior design and functionality. (Sort of how Mac survives against the PC.)\n\n"
    },
    {
      "time": "9 Mar 2008 — 5:18am",
      "content": "I used the trial edition of FontCreator for my first attempt at type design three years ago. I have a very vague recollection of it, though I don't remember being that impressed with its bezier handling. As I didn't advance beyond the stage of drawing glyphs, I didn't get a chance to try out its full functionality.\n\nFrom Thomas's list, I see that it's got a number of major strikes against it. However, if it does support up to 64K glyphs and the professional edition is only $149, then that's a critical point of consideration for someone looking to generate CJK fonts. FontLab Studio only generates fonts of up to 6400 glyphs, which is simply not enough for this purpose, and AsiaFont Studio, which can handle 65536 glyphs, costs $1999.\n\nEven if one is limited to .ttf fonts without Opentype features, the mere possibility of generating a full CJK font for an affordable price range is an important argument in FontCreator's favour. I could imagine that a CJK font designer would pay for FontCreator just to generate a large font whose individual glyphs were designed using other font creation software.\n\n"
    },
    {
      "time": "10 Mar 2008 — 6:24am",
      "content": "\"FontLab seems to have all these different products with overlapping functionality, as if they’ve been operating as a partial monopoly and are really trying to maximize they’re revenue through marketing.\"\n\nIt usually takes people years to figure this out, if they ever do. Well done!\n\nAs Thomas rightly points out, FC has some shortcomings for professionals in the production department, but if you can do your stuff for $199 and not be bothered, go for it! As you can probably see now, it's very hard to compare until you've been through lots of fonts, and perhaps more importantly, lots of clients.\n\nTime, is on FC's side though, as I don't think it's likely that FL'll improve, without competition, and even then, it's probably only 50%-50% (that is to say, 50% of what they change will be retrograde.\n\nCheers!\n\n"
    },
    {
      "time": "10 Mar 2008 — 1:38pm",
      "content": "<cite>As far as the four problems you mentioned, two of them were just that FontCreator doesn’t run on a Mac. But those aren’t deficiencies per se, just marketing decisions.</cite>\n\nThe decision to support only one operating environment can have fairly significant consequences from a software engineering perspective. Once product development goes down the dark and narrow path of relying heavily on platform-specific components, its really hard to go back. I would be just as skeptical of a Mac only product, perhaps more so, because I want to maintain the ability to chose.\n\nThe problem is that FontCreator doesn't compete against FontLab, it competes against TypeTool for the low end market. Font creation is a sufficiently small niche that there aren't enough customers to support lots of competing products. If there were such a thing as FontCreator Pro, might feel differently. FC is taking market share without providing any of the functionality that pro users need.\n\n"
    },
    {
      "time": "10 Mar 2008 — 3:11pm",
      "content": "There is always Font Forge and that is free. And it is incredibly sophisticated.\n\n"
    },
    {
      "time": "10 Mar 2008 — 6:38pm",
      "content": "Hmmm,\n\n\"FC is taking market share without providing any of the functionality that pro users need.\"\n\nReplace FC, with GoogleDocs, Buzzword, Star Office or even Mac OS. It's a slippery slope, don’t you think. Competition is good.\n\n"
    },
    {
      "time": "11 Mar 2008 — 11:38am",
      "content": "<cite>I don’t think it’s likely that FL’ll improve, without competition, and even then, it’s probably only 50%-50% (that is to say, 50% of what they change will be retrograde.</cite>\n\nHm... :-)\n\n"
    },
    {
      "time": "12 Mar 2008 — 5:54am",
      "content": "\"Hm... :-)\"\n\nI can prove it. :)\n\nI can also show that multiple requests for upgrades to a paying customer have been ignored for months.\n\nIs there anyone even home there?\n\nCheerz!\n\n"
    },
    {
      "time": "12 Mar 2008 — 6:51am",
      "content": "Dave, to be fair, Fontlab isn’t a company with a whole lot of customers or much of a budget to work with. It may not be the best piece of software in the world, but given how small the market is I’m sort of surprised Fontlab even exists.\n\n"
    },
    {
      "time": "12 Mar 2008 — 12:54pm",
      "content": "I am sorry for being silent for some time, and I am not ready to announce anything specific, but some exciting announcements are to be expected soon. I am not retired yet :)\n\n"
    },
    {
      "time": "12 Mar 2008 — 1:13pm",
      "content": "I would hope at least bug fixes are being attended to.\n\nChrisL\n\n"
    },
    {
      "time": "12 Mar 2008 — 4:23pm",
      "content": " ![](http://web.archive.org/web/20150215140048im_/http:/typophile.com/files/BugBackpack_4231.jpg)\n\n"
    },
    {
      "time": "12 Mar 2008 — 7:03pm",
      "content": "I am glad you got a leg up with that one, Dan :-)\n\nChrisL\n\n"
    },
    {
      "time": "13 Mar 2008 — 4:25am",
      "content": "What ever it is Yuri, I'm certainly hoping for the best!\n\nCheers!\n\n"
    },
    {
      "time": "13 Mar 2008 — 11:40pm",
      "content": "\"As far as the four problems you mentioned, two of them were just that FontCreator doesn’t run on a Mac.\"\n\nNo, \\*one\\* of them was not running on a Mac. Another was not generating a bunch of formats, which included some Mac formats but also Windows Type 1.\n\nI believe I remember some tool which actually solved the problem of generating Mac format fonts on the Windows platform - it spit out the fonts in an archived file which could then be uncompressed on Mac OS! It was a very clever solution for a tool that wanted to run only on Windows, but allow the Windows user to support Mac clients.\n\nDave B: I agree that FontLab has overwhelming market share with their products. But that doesn't stop them from needing/wanting to innovate: they want upgrade revenue. If the value isn't there, their existing customers won't buy new versions, and if they already have major market share, how do they make money? The same applies to lots of companies who have major market share in some particular areas, whether it's Adobe or Microsoft.\n\nSome companies do fail to pursue this path, but it costs them both in upgrade revenue and the eventual emergence of competitors. Think what happened to Brand X after they dropped the ball for a few years too many in a software competition we're all familiar with....\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "14 Mar 2008 — 1:48pm",
      "content": "<cite>I believe I remember some tool which actually solved the problem of generating Mac format fonts on the Windows platform </cite>\n\nI think this was the \"Macromedia PC to Macintosh Font Conversion Utility\" which shipped with the Windows version of Brand X.\n\n"
    },
    {
      "time": "14 Mar 2008 — 3:09pm",
      "content": "I use FC, and it has its issues. As far as the not supporting OT features natively, some of the more avid users have now compiled tutorials on their forum on how to add those features, and it is something the developer is considering adding. It's a fairly lively, if small, community of users, and it is being actively developed and reworked to get better. What it does, it does pretty well. It's no world beater, but it is easier to use than FontForge, if not nearly as powerful. I agree with the comparison to TypeTool rather than FontLab.\n\n"
    },
    {
      "time": "14 Mar 2008 — 7:44pm",
      "content": "I personally think Font Creator is great, and I use it at my workplace. The features that I use are the global glyph transformations and the creation of outlines from bitmap images (something that FontLab can't do - you need ScanFont). But as a font designer's tool it is useless, because it doesnt have proper bezier drawing tools (see [http://www.cr8software.net/article004.html](http://web.archive.org/web/20150215140048/http:/www.cr8software.net/article004.html)).\n\n<cite>Time, is on FC’s side though, as I don’t think it’s likely that FL’ll improve, without competition</cite>  \nFontCreator is aimed at a different market (there ARE non-designers out there that need to use font editors, and for whom font lab is WAY too complex). There is no hope of competing with FontLabs products within their market niche. They purchased Fontographer, and also DTP's Type Designer (now no longer on the market). This is sad, because, as you imply, competition leeds to better products and better prices.\n\nAlso, regarding Jongseong's comment - does anyone know why FontLab Studio is limited to 6400 glyhs? Lesser font editors (including TypeTool) can handle over 65,000. Seems like a deliberate limit to encourage the purchase of AsiaFont Studio to me.\n\n"
    },
    {
      "time": "14 Mar 2008 — 8:12pm",
      "content": "<cite>something that FontLab can’t do - you need ScanFont</cite>  \nWhat are you talking about? Fontlab can scan bitmaps. I do it all the time.\n\n"
    },
    {
      "time": "14 Mar 2008 — 10:31pm",
      "content": "<cite>What are you talking about? Fontlab can scan bitmaps. I do it all the time.</cite>  \nSorry, you are right - you can do that in version 5. (Last version that I used was 4.6).\n\n"
    },
    {
      "time": "16 Mar 2008 — 3:45am",
      "content": "I must admit that Fontlab Ltd. currently has a somewhat confusing list of products for font editing. So, let's take a look:\n\nTypeTool 3 (US$99) is a font editor that support Type 1, OpenType PS (.otf) and OpenType TT (.ttf), note that it supports up to 65,535 glyphs and generally serves as a rather effective font editor for non-professionals. The \"core\" of TypeTool is based on FontLab Studio 5, so the generated fonts have the same quality (with autohinting etc.). No support for adding OpenType Layout features, so you may need to use Microsoft VOLT or Adobe FDK for OpenType for that. Obviously, as I work for Fontlab Ltd., it would be unfair for me to draw any comparisons with FontCreator, but I'd be thrilled to see a comparative review between TypeTool and FontCreator some time.\n\nFontographer ($349) is really in a 'transitional' state. Two years ago we acquired the product to salvage it from complete extinction (something that happened to FontStudio and many other font editing products). We have upgraded it to Mac OS X but nothing much less happened, the last feature upgrade was done by Macromedia back in 1996. We have great plans for Fontographer in the future, but it's too early to announce something.\n\nFontLab Studio ($649) is our high-end font editor, the one that most of Typophile readers are probably familiar with. We are working on the next version of the product right now. The 6,400 glyph limit has been introduced back in the days when we launched a separate product, AsiaFont Studio, specifically for the Asian market. The limit was not much of a problem then because hardly any non-Asian font reached that limit, and for simple font work there was always TypeTool that did not have this limitation. These days, even European OpenType fonts can reach the 6,400 limit if they come with lots of alterates, so we are considering the possibility to lift that limitation in the next version.\n\nAsiaFont Studio ($1999) is \"FontLab 4.6 on steroids\", an editor based on the previous version of our high-end editor, extended with some features for Asian type design and supporting some Asian font formats. We are currently working on the next version of a font editor for that segment, details to be announced.\n\nThere is a comparison chart showing the main differences between the four font editors at:  \n [http://www.fontlab.com/fontlab-products/compare/](http://web.archive.org/web/20150215140048/http:/www.fontlab.com/fontlab-products/compare/ \"http://www.fontlab.com/fontlab-products/compare/\")\n\nAs far as our competition goes, we are thrilled to see something going on. We view FontForge, FontCreator and DTL FontMaster as interesting alternatives, or sometimes as complements to our own products. For example, I know some users who use FontLab Studio combined with FontForge or with some DTL FontMaster modules. We think that competition on the market, be it as small and specialized as font editing software, is essential and good. I have been in regular (though occasional) e-mail contact with Erwin Denissen (FontCreator), Frank Blokland (DTL FontMaster) and George Williams (FontForge), the tone of those exchanges was always friendly, and I doubt there is any 'negative competition' going on.\n\nWe think that Fontlab Ltd. can compete successfully in questions of both product quality and support. I realize very well that we need to improve in both aspects, and I can assure you all that we're not letting us rest on this.\n\nBest,  \nAdam Twardoch  \nFontlab Ltd.\n\n"
    },
    {
      "time": "18 Mar 2008 — 6:44am",
      "content": "That may all be true, but it don't help when the start point will not turn blue and interpolate, as there is no reason for it not to! ;)\n\nCheers!\n\n"
    },
    {
      "time": "31 Mar 2008 — 5:25am",
      "content": "‘[…] As far as our competition goes, we are thrilled to see something going on. We view FontForge, FontCreator and DTL FontMaster as interesting alternatives, or sometimes as complements to our own products […]’\n\nSeptember last year Miguel Sousa of Adobe and I gave a duo presentation at the FM Track during the ATypI TypeTech Forum in Brighton. Using two beamers we compared some parts of the font production for which at Adobe the FDK is combined with FontLab and for which FM is used at DTL. The comparison was informative and enjoyable and overall well received.\n\nPerhaps we could repeat such a comparison on a larger scale and with multiple beamers starring FontLab, FontForge, FontCreator and DTL FontMaster, for instance in the main program of the coming ATypI conference at St. Petersburg. The submission deadline has been extended till the 14th of April, so there is time to come up with a joined proposal.\n\n"
    }
  ]
}
