{
  "id": "42693",
  "title": "Brilliant Nonsense",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all,\n\nMy brother and I are planning on doing some creative work together... for fun initially. Later on we may try to sell merchandise like t-shirts, posters, etc.\n\nThe name brilliant nonsense has been floating around in my brother's head for years. I liked it so we've decided to use it for our collaborative work. I've been charged with coming up with a logo. Originally we were focused on doing a crest but I wasn't really loving the direction. Later I decided to try scribbling... playing off of nonsense. I scribbled and scribbled and then combined a few. We both really liked the one you see here.\n\nNow I am trying to pair the logo with type and I need some help. All of the fonts here have the feel I'm looking for, but the more I look at the word brilliant the stranger it looks to me...something about all those i's and l's in a row. I'm thinking the 2nd and the last may work better for this word. What do you think? Is there a better font for this? I've also been wondering if a formal serif might be interesting...contrasting the playfulness of the name with the formality of type. I may have to try that.\n\nI welcome all comments. Your help is greatly appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [BN\\_logo.jpg](http://web.archive.org/web/20131020071412/http:/typophile.com/files/BN_logo.jpg) | 128.13 KB |\n\n",
  "author": "starlux",
  "time": "1 Mar 2008 — 10:57am",
  "uid": "4094",
  "comments": [
    {
      "time": "1 Mar 2008 — 11:35am",
      "content": "great name. the name alone would catch my eye, so you're home free !\n\njust a few quick thoughts : the scribble is nice but very dense - it could block up in certain media and might benefit from cheating those spaces a little bigger.\n\nthe formality of font vs. concept could work but these fonts look formal to me as much as they conjure the kindler, gentler pseudo-formality brought into play with these styles (officina, etc.) in the last decade or so... casual fridays fonts.  \nvery useful style but possibly too familiar for this.\n\ni'm not as well versed in fonts as most folks here but i would suggest going MORE formal, to really push the tongue-in-cheek irony. high classical, or over-the-top decorative, or old world. might not work w/ the scribble, tho. what about scribbling the font, precisely bounded as if within a stencil ? just a thought.\n\nor : did you try a more surprising combination of fonts ? not so much \"ransom note\" but more quirky, an out-of-place combo of two styles ? this was much abused in the 90's, i know, but somehow i think these words could support it with some experimenting.\n\n"
    },
    {
      "time": "1 Mar 2008 — 11:34am",
      "content": "x2. Try making it very proper with Baskerville or something and let irony work.\n\n"
    },
    {
      "time": "1 Mar 2008 — 11:38am",
      "content": "This is very playful. I like the type in the fourth the best .. like the second, the shape of the L's help to set them apart from the i's. But the fourth is a better font.\n\nOverall, I get a mad scientist sort of vibe off of it, which is very cool. You may want to find some type that draws out that sense a little better than what you have (while nice, your choices are neutral).\n\n"
    },
    {
      "time": "1 Mar 2008 — 11:42am",
      "content": "Thank you both for the comments. I'm going to try pairing the scribble with much more formal fonts. I'll also try loosening up the scribble a little and then repost as soon as I can.\n\n"
    },
    {
      "time": "1 Mar 2008 — 7:18pm",
      "content": "nvhladek,\n\nI missed your comment earlier. We were probably typing at the same time. I like your take on it. I think gravitated toward sophisto and stratum initially because I was going for a scientist vibe... without fully realizing it. We'll I'm going to try both directions. Hopefully I can post again tomorrow.\n\n"
    },
    {
      "time": "6 Mar 2008 — 12:00pm",
      "content": "you could try justifying right and then \"nestling (although not tightly!) your mark on the left. also, use the i's to your advantage, could the dot tie into the scribble so they can be used separately and still relate?\n\n"
    }
  ]
}
