{
  "id": "42691",
  "title": "Prouns with Type?? I need your advice.",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am a graphic design student graduating in a few months. My class is putting on an end of the year show. Lissitzky is my hero and gretest influence. My thesis idea is to re-create Lissitzky’s prounenraum with posters with type instead of his sqares and rectangles. I am having trouble deciding on what type should say. The word proun means project of the new, so I want to aproach this the way Lissitzky would if he had a computer and CS3. I need this to reflect typography of the 21st century and the definition of proun.\n\nWhat should the type be to connect my thesis idea. I am thinking about using either cheeky type sayings. I also thought about typesetting popular key commands. What do you guys think about this? Any better suggestions for what the type would say. Any advice would be appreciated. Thank you!\n\n [‹ Suggestions for a symbol](http://web.archive.org/web/20080507180948/http:/www.typophile.com/node/42681 \"Go to previous forum topic\") [Antique Old Style No. 3 ›](http://web.archive.org/web/20080507180948/http:/www.typophile.com/node/42626 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080507180948/http://www.typophile.com/user/27777\" title=\"View user profile.\">Julie Brookins</a>",
  "time": "<br>",
  "uid": "27777",
  "comments": [
    {
      "time": " 1.Mar.2008 10.27am",
      "content": "Why not contrast some of the type from his early 1930s propaganda work with text about the [Ukranian Famine](http://web.archive.org/web/20080507180948/http:/www.ukrainiangenocide.com/) of the same period? That would be a pretty interesting way to approach Lissitzky.\n\n"
    },
    {
      "time": " 1.Mar.2008 11.45am",
      "content": "Thanks, but I really need to try to make this connect with 2008 or the 21st century per my professor...that’s what’s killing me. I can’t find the connection..\n\n"
    },
    {
      "time": " 1.Mar.2008 12.43pm",
      "content": "Have you tried finding a connection between Jewish themes in Lissitzky’s proun works and contemporary Jewish art? That might turn up something interesting. Check out the library at your local Jewish community center.\n\n"
    },
    {
      "time": " 1.Mar.2008 2.18pm",
      "content": "Very clever. Thanks man.\n\n"
    }
  ]
}
