{
  "id": "42692",
  "title": "DTL Fontmaster - Thoughts?",
  "forum": "Build",
  "tags": [

  ],
  "content": "It seems that Fontlab has become the standard font production software, but has anyone used the DTL Fontmaster modules? There seems to be such a high regard for their typefaces I’m curious if the software is equally good.\n\n [‹ Double Points in FontLab](http://web.archive.org/web/20081119155941/http:/typophile.com/node/42902 \"Go to previous forum topic\") [Stroked fonts for engraving ›](http://web.archive.org/web/20081119155941/http:/typophile.com/node/42566 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081119155941/http://typophile.com/user/1115\" title=\"View user profile.\">Chris Keegan</a>",
  "time": "<br>",
  "uid": "1115",
  "comments": [
    {
      "time": " 1.Mar.2008 8.29pm",
      "content": "Just quickly, at 5 am ... The best thing would be to download the demo version, test it, and decide for yourself.&nbsp;&nbsp;:)\n\nThree things that come to my mind: BezierMaster’s bolding function gives better results than FLS’s. The way the FontMaster modules deal with OT features is quite smart — they generate a font-specific feature file from a big one and omit specific substitutions if required glyphs are missing in the font. Also, you only need to set up a .cha file (which links glyph IDs, glyph names, Unicode codepoints) once and do not need to care for these things any more.\n\n"
    },
    {
      "time": " 2.Mar.2008 10.46am",
      "content": "Chris if you can make it ATypI Frank will likely be offering a day of FM demos and training. It always attracts a dozen or so followers along with the curious.\n\n"
    },
    {
      "time": " 3.Mar.2008 6.25am",
      "content": "Thanks guys. I’ve downloaded it and will give it a try. I just realized I posted this in the wrong area.\n\n"
    },
    {
      "time": " 3.Mar.2008 9.59am",
      "content": "No prob, Chris. I’ve moved this discussion to the Build forum.\n\n"
    },
    {
      "time": " 3.Mar.2008 11.03am",
      "content": "Thanks Stephen. I would love to hear from other users. Any other benefits or disadvantages? I’m a graphic designer just starting to dabble with type design. I’m thinking Typetool to start, but want to consider my options down the road.\n\n"
    },
    {
      "time": " 3.Mar.2008 11.26am",
      "content": "<cite>“There seems to be such a high regard for their typefaces I’m curious if the software is equally good”</cite>, this is an interesting equation. I think you can do (technically) good and bad fonts with all font editors (especially since there are no clear-cut definitions for good and bad). It may be unavoidable to read some technical papers so that you know what you are doing if you mark any checkbox — in any font editor.\n\n"
    },
    {
      "time": " 3.Mar.2008 11.54am",
      "content": "Karsten, you’re absolutely right about that. It’s not so much the tools, but how you use them. I agree.\n\n"
    },
    {
      "time": " 4.Mar.2008 1.22pm",
      "content": "Like Simon wrote, if everything goes well I will definitely organize a FM Track in St. Petersburg coming Autumn. In the meantime I will provide some info here.\n\nFM is especially developed with batch production in mind. The separation of glyph, naming and metrics info, the way the generation of OT features is handled and the character mapping files (which like Karsten wrote, link glyph IDs, glyph names, Unicode codepoints and code pages) in combination with command files makes it possible to come up with reproducible and consistent results.\n\nMost of the files are easy to alter text files. Changes in a character mapping file or features file can be applied to a complete library at once by using command files. Or, if FM is updated (like at the moment to version 2.7.0 with the 2.0 SDK built-in), all fonts can be generated again in batch.\n\nAt DTL we use a hierarchic system for the command files. I tried to explain some of the stuff in my presentation in Brighton last September, for which I used the following PDF:  \n [http://www.fontmaster.nl/pdf/FM\\_docs/FM\\_Easy\\_automation.pdf](http://web.archive.org/web/20081119155941/http:/www.fontmaster.nl/pdf/FM_docs/FM_Easy_automation.pdf \"http://www.fontmaster.nl/pdf/FM\\_docs/FM\\_Easy\\_automation.pdf\")\n\n"
    },
    {
      "time": " 6.Mar.2008 6.21am",
      "content": "Frank, thanks for the .pdf. I am definitely a beginner at this point. It looks like Fontmaster may be more advanced than what I need. I did download the lite version, and will try it out. My goal this year is to create a few display types to get started. Thanks for the reply. - Chris\n\n"
    }
  ]
}
