{
  "id": "427",
  "title": "Fine Points on Mac Conversion",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello. Total newbie here.   \n   \nI've been making my own fonts for quite some time now using Font Creator Program (I hear groaning). One visitor to my site, a Mac user, downloaded my Tin Doghouse and Tin Birdhouse fonts, but found that the Mac versions lagged behind the current versions.   \n   \nI've lost my contact for converting to Mac, so I'm stuck doing it myself. Fortunately, I do have complete access to a Mac, and the person I'm trying to help has a conversion program, TTConverter. The trouble is that things have gotten weird.   \n   \nPhotoshop doesn't seem to recognize the Italic version of the font at all. Outlook Express does recognize the font, but won't do \"special characters\". (He's from France, so he may mean accented characters.) InDesign works in a way:   \n   \n\"If i select a text yet typed and change the font to one of the tins, it works. But i can type anything, even spaces display always the same odd character. The special charcters function of InDesign works perfectly, but it's not very quick.\"   \n   \nAnybody have any idea what's going on here?   \n   \nThe originals can be downloaded at:   \n   \n [http://dartcanada.tripod.com/Objets/New/tz\\_frame.html](http://web.archive.org/web/20150415081333/http:/dartcanada.tripod.com/Objets/New/tz_frame.html)   \n   \nI can post what I got when I tried converting to Mac if that would help.\n\n",
  "author": "dart",
  "time": "23 Jun 2003 — 9:03am",
  "uid": "1975",
  "comments": [
    {
      "time": "23 Jun 2003 — 10:50am",
      "content": "You have a font called Yerevan? Cool. I can see some Armenian-ness in it, but as you probably realize it needs work... :-/   \n   \nKeep it up!   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jun 2003 — 12:00pm",
      "content": "Try [TransType](http://web.archive.org/web/20150415081333/http:/www.fontlab.net/?/html/transtype.html). Works more reliably than the good old TTConverter.\n\n"
    },
    {
      "time": "23 Jun 2003 — 12:58pm",
      "content": "Ouch. It's $100 US. I don't have that kind of money.   \n   \nHave you noticed this kind of weird behaviour coming from TTConverter before? I'm wondering if it's some setting or something that needs to be done to the fonts themselves.\n\n"
    },
    {
      "time": "23 Jun 2003 — 6:18pm",
      "content": "What about CrossFont? I never actually used it, but it's free, anyway...\n\n"
    },
    {
      "time": "23 Jun 2003 — 6:36pm",
      "content": "Actually, it's not. It has a $45 US registration fee, and registration includes being able to make an italic version, which has been my specific problem.   \n   \nMy big problem is that I don't know Macs, and my friend in France doesn't know the inner workings of fonts.   \n   \nI have Suitcase on the Mac, I haven't been able to make a suitcase that has more than one font in it, which I've seen. I know there are things I'm doing wrong. Does anyone have any advice, or a place to point me to for better instruction, before I start throwing money at the problem?\n\n"
    },
    {
      "time": "24 Jun 2003 — 1:49pm",
      "content": "I know exactly what you mean about the font creator program. But it's cheap and while I'm a newbie I figure it's a good learning tool. And it's pretty amazing for shareware!   \n   \nSorry, no help on the conversion issues. I own a Mac at home but haven't had a chance to try to make a font for it. Hang in there ![:-)](http://web.archive.org/web/20150415081333im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "24 Jun 2003 — 6:29pm",
      "content": "Sorry about the Crossfont information. I've downloaded it a long time ago, and never actually used it, so... :-/   \nI don't know much about Macs and font conversions, but as a workaround, you can just rename the italic and not generate it as a proper italic. The user of your font will have to change the typeface each time he uses the italic.\n\n"
    },
    {
      "time": "25 Sep 2003 — 3:16pm",
      "content": "Reviving the old, old thread. Now I have someone else, a Japanese magazine, who want to feature some of my fonts in an article of some sort. They've listed the fonts they're interested in, but may not realize that they're actually a version behind.   \n   \nI have access to a Mac, and PCs galore, including a friend's that has FontLab on it. Can I use _that_ to make Mac fonts? Our first efforts seem to have made PC Type1 fonts that my Mac doesn't recognize.   \n   \n(Still clueless when it comes to Macs. I have a G4, and I can't manage to access anything on CD-ROM by myself. :/ )\n\n"
    },
    {
      "time": "25 Sep 2003 — 3:18pm",
      "content": "[hic]\n\n"
    }
  ]
}
