{
  "id": "42704",
  "title": "hah",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "no more\n\n",
  "author": "<a href=\"/web/20110824005537/http://typophile.com/user/27786\" title=\"View user profile.\">maria kasabian</a>",
  "time": "<br>",
  "uid": "27786",
  "comments": [
    {
      "time": "",
      "content": "Hi Maria,\n\nSince you're in London, I'd advise you to meet Gagik Stepan-Sarkissian and Susan Pattie at the [Armenian Institute](http://web.archive.org/web/20110824005537/http:/www.armenianinstitute.org.uk/), and Vrej Nersessian at The British Library. That's what I did when I designed [Calouste](http://web.archive.org/web/20110824005537/http:/www.tdc.org/news/2006Results/Calouste.html).\n\n"
    },
    {
      "time": "",
      "content": "From the ATypI list (yesterday) - timing is interesting/related? 100,000 in pize money!\n\n<cite><br>\nHere are two announcements which may interest anyone with an interest in Armenian (or Cyrillic) type design:</cite>\n\nThe Ministry of Culture of the Republic of Armenia is sponsoring a new international competition for type design: ‘Granshan 2008’  \n(Granshan means ‘character’ in Armenian).  \nThe deadline for entries is 10th June 2008.  \nThe competition judging will take place in Yerevan, 21–28 June 2008.\n\nCategories:  \n1. Armenian text type – serif  \n2. Armenian text type – sans serif  \n3. Armenian traditional text type  \n4. Latin text type  \n5. Cyrillic text type  \n6. Display type\n\nThe competition is open to type designers/producers internationally.  \nThe first prize is 100 thousand Armenian drams (c. $300).  \nThe 2nd and 3rd prize winners will receive diplomas and prizes.  \nEntries should be sent to the Book Chamber of the Republic of Armenia.  \nAddress: Yerevan, Gevord Kochari, 21, Armenia.\n\nTelephone: (010) 51 98 91  \nE-mail: [armtype@xter.net](mailto:armtype@xter.net)\n\nFor more information contact the Chairman of the organizing committee Edik Ghabuzyan (on the above email address). Full details are available in Armenian, English and Russian as pdf files. Announcement of the results of the competition and prizegiving will take place in Yerevan. (The exact date to be confirmed).\n\nArmenian Type Now – Exhibition in July 2008 In July, the University of Lincoln is hosting three visitors from the Armenian Ministry of Culture, Yerevan, including the aforementioned Edik Ghabuzyan, Head of the Department of Creating and Keeping Armenian fonts of the National Book Chamber.\n\nWe will be creating a small exhibition called ‘Armenian Type Now’ in the Wren Library of Lincoln Cathedral. This will showcase the design of letters for the Armenian alphabet: hand lettering; book design and typeface design (it will feature some of the entries from the Granshan 2008 competition).\n\nThe exhibition will be open to the public from Saturday 5th–Saturday 12 July inclusive (not Sunday) 11am–3pm each day.\n\nIf you are not able to come to Lincoln, I am hoping to make a CD of images and some of the typefaces available to members later in the year.\n\nThe General Assembly of the United Nations has proclaimed 2008 to be the International year of languages to promote ‘Unity in Diversity and Global Understanding’  \n– both of these events recognise this United Nations initiative and celebrate the unique Armenian alphabet.\n\nCarolyn Puzzovio\n\nUniversity of Lincoln, UK.\n\n"
    },
    {
      "time": "",
      "content": "thank you for the info i will look into the pointers and the advice, the competition might be a good incentive too .I have started but i never anticipated the difficulty i guess designing the English alphabet is brobably much more easy than this ( prove me wrong and i will consider the belief / key word =consider).\n\n"
    },
    {
      "time": "",
      "content": "What happened to this? The Title and the Main Entry are gone. Can I help Maria?\n\n"
    }
  ]
}
