{
  "id": "42719",
  "title": "Kerning and tracking help",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am developing a logo for a project called virgo (lowercase). The font I have selected is Ronda EF regular. I have scowered the web for a logic to kerning and tracking for logo design. I am stuck at the point at which I have customized the logo from Ronda EF regular by thickening the stoke and modifying some letters. Now I need to properly space and kern the letters but I don't know how (not optical kerning). In my defense I have purchased a book on designing type, and have spent hours digging through google, but the results don't give me what I need.\n\nCan anyone recommend a professional kerning/tracking service provider? I am a novice when it comes to the above mentioned.\n\nAny logic or assistance would be greatly appreciated as well.\n\nBest Regards,  \nMarvin\n\n",
  "author": "MarvinMe",
  "time": "2 Mar 2008 — 12:46pm",
  "uid": "13460",
  "comments": [
    {
      "time": "2 Mar 2008 — 3:09pm",
      "content": "Why did you buy a book to space five letters ?\n\n"
    },
    {
      "time": "2 Mar 2008 — 6:13pm",
      "content": "I've had the book for a long while. I have been trying to educate myself on the subject of font creation, and in the kerning/tracking field, this is relevant.\n\nAnyone have any assistance?\n\n"
    },
    {
      "time": "2 Mar 2008 — 7:13pm",
      "content": "Why not post an image in the design forum and get actual criticism on your attempt. I don't know what anyone can say without seeing what you've done thus far.\n\n"
    },
    {
      "time": "3 Mar 2008 — 2:19am",
      "content": "I hope the client isn't paying you by the hour. Talk about making a meal of it!\n\nCan anyone recommend a professional kerning/tracking service provider?\n\nLOL!\n\nNick Cooke\n\n"
    },
    {
      "time": "3 Mar 2008 — 3:37am",
      "content": "If we are only speaking of a few letters for the logo - why not outline them in Illustrator and then by hand place them where you want them to be. Save the file, archive it and now you have a logo that will always be the same and that you know your other programs can not match the arrangement of the letters. BTW - If you don't have Illustrator, perhaps you have Photoshop? You can set each letter on an individual layer and move them/overlap them, whatever - till you get what you are looking for.\n\nMeanwhile, what programs are you working from? Most of us would be working in QuarkXPress or InDesign. But if you are on an IBM or IBM compatible working with some Microsoft program - I understand it is most cruel to the fonts out there... and kerning/letterspacing falls to the wayside.\n\nGood luck with your project. Hope it turns out well and is appreciated by all.\n\n"
    },
    {
      "time": "3 Mar 2008 — 4:52am",
      "content": "You can read some of [David Kindersley's](http://web.archive.org/web/20130821181002/http:/www.kindersleyworkshop.co.uk/) thoughts on letter spacing here.\n\n"
    },
    {
      "time": "3 Mar 2008 — 5:02am",
      "content": "[Briem's excellent web site on type design](http://web.archive.org/web/20130821181002/http:/briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm) includes a section on spacing.\n\nThe great [Fonts & Logos](http://web.archive.org/web/20130821181002/http:/www.delphipress.com/) book by Doyald Young gives examples of how to modify type for logos.\n\nIt does take time to train your eyes and brain to be good at this.\n\n"
    }
  ]
}
