{
  "id": "42711",
  "title": "Photographic website/magazine logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I am working on a logo for a website called ’foto8’ and would like to hear your comments/criticisms on where I have got to thus far.\n\nBackground information: The logo is also to be partially used on a bi-annual magazine called ’8’ and I am working on trying to incorporate the 2 logo’s in order form some kind of a cohesive identity (so the website is called ’foto8’ and the magazine just ’8’ as a number). The style of letters used is in tune with the headline typography of the magazine, so I wouldn’t want to deviate from that too much.\n\nIn particular, it would be good to have comments on how readable/effective it is as a logo; as well as ideas on achieving the best balance between the ’f’ and the ’t’; and any other comments would be much appreciated.\n\nThanks,  \nMike\n\n| Attachment | Size |\n| --- | --- |\n| [foto8\\_1.jpg](http://web.archive.org/web/20081007002323/http:/typophile.com/files/foto8_1.jpg) | 61.65 KB |\n\n [‹ Critique: Wine Merchant Logo](http://web.archive.org/web/20081007002323/http:/www.typophile.com/node/42069 \"Go to previous forum topic\") [NCAA Gymnastics Championships Logo ›](http://web.archive.org/web/20081007002323/http:/www.typophile.com/node/42535 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007002323/http://www.typophile.com/user/5489\" title=\"View user profile.\">micthemod</a>",
  "time": "<br>",
  "uid": "5489",
  "comments": [
    {
      "time": " 2.Mar.2008 3.51pm",
      "content": "Very nice idea. From the ones shown I’d prefer No.4.  \nWhat about caps for F and T and not connecting them?\n\n"
    },
    {
      "time": " 2.Mar.2008 5.00pm",
      "content": "Jan, thanks for your input.\n\nI have tried cap F and T in earlier drafts, but wasn’t really convinced (I think the lowercase letters create more interesting shapes). As for No.4, I have been made aware that the f and t can appear difficult to see when not separated in some way (hence the white line used in No’s 1-3) and be read as some kind of arbitrary shape next to a figure 8. Could you please elaborate why you prefer No.4?\n\nMike\n\n"
    },
    {
      "time": " 2.Mar.2008 5.11pm",
      "content": "I also like number 4. The other ones all read as ’ft8’ at first.\n\n- Lex\n\n"
    },
    {
      "time": " 2.Mar.2008 5.27pm",
      "content": "<cite>The other ones all read as ’ft8’ at first.</cite>\n\nThat’s a really good point, and one that I had missed (probably because I have only showed these drafts to people who are familiar with the name already).\n\nThanks,\n\nMike\n\n"
    },
    {
      "time": " 3.Mar.2008 12.09pm",
      "content": "Hi Mike,\n\nI like #4 as well. The stencil-like break seems out of step with the 8.\n\n"
    },
    {
      "time": " 3.Mar.2008 4.57pm",
      "content": "Hello Mike,\n\nAnother vote for #4 here. My mind started forming an idea of what your description would look like, and then when I saw your work it was so much better than what I was imagining. Elegant, simple and dynamic. Now just refine it and call it a day. Good work.\n\n"
    },
    {
      "time": " 5.Mar.2008 2.56am",
      "content": "Thanks for all your comments guys. Much appreciated.\n\nMike\n\n"
    }
  ]
}
