{
  "id": "42725",
  "title": "Personal Logo Crit",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I am new to these forums (posting on them, at least). I’m am not a professional designer, more of a hobbyist, and have been messing around with making a personal logo. I’m not dead set on using my initials, nothing has struck me as a good idea other than that yet. Please let me know if any of these are headed in the right direction, and don’t hold back on the criticism! Thanks!\n\n ![](http://web.archive.org/web/20081202133109im_/http:/www.typophile.com/files/interlocking%20copy_6157.jpg)\n\n ![](http://web.archive.org/web/20081202133109im_/http:/www.typophile.com/files/C%20Circle%20copy_4001.jpg)\n\n ![](http://web.archive.org/web/20081202133109im_/http:/www.typophile.com/files/Swoosh%20C%20copy_5032.jpg)\n\n ![](http://web.archive.org/web/20081202133109im_/http:/www.typophile.com/files/CW%20(Small)_6507.jpg)\n\n [‹ Retro logo](http://web.archive.org/web/20081202133109/http:/www.typophile.com/node/42689 \"Go to previous forum topic\") [Your professional opinion. Just out of curiousity. ›](http://web.archive.org/web/20081202133109/http:/www.typophile.com/node/42648 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202133109/http://www.typophile.com/user/24841\" title=\"View user profile.\">Werm</a>",
  "time": "<br>",
  "uid": "24841",
  "comments": [
    {
      "time": " 2.Mar.2008 5.12pm",
      "content": "A few questions:\n\n1. Why are you creating this logo?  \n2. What do you want it to convey?  \n3. Did you sketch anything by hand, or did you start designing on the computer right off the bat?\n\n- Lex\n\n"
    },
    {
      "time": " 2.Mar.2008 5.16pm",
      "content": "Each design is quite different in its style, so from this selection I find it difficult get an idea or feel for the type of person you are (which I guess is something that you want to get across with your logo). No’s 2 & 4 appeal to me most, though 4 reminds me of the chanel logo, and the ’w’ is not so easy to decipher (which is necessarily a bad thing). Which is your favourite, and why?\n\nMike\n\n"
    },
    {
      "time": " 2.Mar.2008 6.41pm",
      "content": "Lex: Sorry, I should have been more specific. I would like to have a logo to possibly do some freelance work in my spare time. Never having done any professional work in the past, I do not really have a target audience. Just anyone who will give me work... I would like it to convey professional, modern, and contemporary. I sketched them all out first, except for 3, which kind of came about by accident.\n\nmitch: I think my favorite is 2. It’s not complicated, kind of like me. I used to like 4, only because I thought it was the most creative with the 2 c’s on their side to make the w. But now that you mentioned that it looks like the network logo, it has fallen out of all contention of use. The CW network logo is easily one of the ugliest logos around today, IMO. I wish I wouldn’t have two of the hardest letters to throw together.\n\n"
    }
  ]
}
