{
  "id": "42738",
  "title": "was TED covered in WIRED?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does someone know if WIRED magazine's latest issue covered the TED Monterey conference from last week?\n\n[http://www.wired.com/science/discoveries/news/2008/02/ted\\_cox](http://web.archive.org/web/20131023205339/http:/www.wired.com/science/discoveries/news/2008/02/ted_cox \"http://www.wired.com/science/discoveries/news/2008/02/ted\\_cox\")\n\nI went to look for WIRED but it's a US magazine so I don't know if I can get it around the UK everywhere.\n\nthanks\n\nvincent in brixton\n\n",
  "author": "vinceconnare",
  "time": "3 Mar 2008 — 5:00am",
  "uid": "7029",
  "comments": [
    {
      "time": "3 Mar 2008 — 5:09am",
      "content": "you should be able to pick it up in borders or the like.\n\n"
    },
    {
      "time": "3 Mar 2008 — 5:09am",
      "content": "Minor celebrities moving their chubby little carbon footprints around the world to talk evil and the environment? In print?\n\nNo thanks.\n\nCheers!\n\n"
    },
    {
      "time": "3 Mar 2008 — 5:21am",
      "content": "wow dberlow, where did that come from ?\n\nTED offers some amazing minds the chance to present, compare and synthesize views on everything from the future of computing in art and design to social justice and the politics of technological superiority.\n\nit's heavily blogged and many of the presentations can be viewed online.  \nyou can start at the boingboing coverage and trace the links from there.\n\n[http://www.boingboing.net/2008/02/29/ted-2008-paul-stamet.html](http://web.archive.org/web/20131023205339/http:/www.boingboing.net/2008/02/29/ted-2008-paul-stamet.html \"http://www.boingboing.net/2008/02/29/ted-2008-paul-stamet.html\")\n\n[http://www.google.com/search?ie=UTF-8&oe=UTF-8&domains=boingboing.net&si...](http://web.archive.org/web/20131023205339/http:/www.google.com/search?ie=UTF-8&oe=UTF-8&domains=boingboing.net&sitesearch=boingboing.net&q=TED&btnG=Search \"http://www.google.com/search?ie=UTF-8&oe=UTF-8&domains=boingboing.net&sitesearch=boingboing.net&q=TED&btnG=Search\")\n\n[http://www.google.com/search?hl=en&q=TED+presentations&btnG=Google+Search](http://web.archive.org/web/20131023205339/http:/www.google.com/search?hl=en&q=TED+presentations&btnG=Google+Search \"http://www.google.com/search?hl=en&q=TED+presentations&btnG=Google+Search\")\n\n"
    },
    {
      "time": "3 Mar 2008 — 7:02am",
      "content": "Dr. Brian Cox got a standing ovation after his talk about Nuclear Power stuff and he had to have a talk backstage with Cameron Diaz and Bob Geldof.\n\nAnd I want to see if they used my shot of Dr. Brian without asking to use it since they nicked it off the website.\n\n"
    },
    {
      "time": "3 Mar 2008 — 8:53am",
      "content": "Paul Stamets is such a great guy. I think he is a fantastic example of how to meld science, terroire, futurism, environmentalism and commerce in a maturing culture like the US.\n\n"
    },
    {
      "time": "3 Mar 2008 — 10:25am",
      "content": "_Dr. Brian Cox got a standing ovation after his talk about Nuclear Power stuff and he had to have a talk backstage with Cameron Diaz and Bob Geldof._\n\nWhat, as punishment?\n\n"
    },
    {
      "time": "3 Mar 2008 — 11:02am",
      "content": "<cite>he had to have</cite>\n\nsounds compulsory, must have been\n\n"
    },
    {
      "time": "4 Mar 2008 — 4:50am",
      "content": "\" compare and synthesize \"  \nlol, exactly.\n\n\"it’s heavily blogged and many of the presentations can be viewed online.\"  \nThen why should anyone go, incl. the presenters?\n\nYou are missing the truth, inconvienient as it may seem. This being the whle point o the thread...  \n\"...I want to see if they used my shot of Dr. Brian without asking...\" :-)\n\nTo court! (and give the money to the Gates Foundation)\n\nCheers!\n\n"
    },
    {
      "time": "4 Mar 2008 — 5:53am",
      "content": "'To court! (and give the money to the Gates Foundation)'\n\nnobody usually like to pay the photography for their copyrighted work and their expensive lights, lenses and cameras. Magazines are thieves.\n\n"
    },
    {
      "time": "4 Mar 2008 — 11:09am",
      "content": "dberlow: what's yr complaint exactly ? too many smart people in one place ?\n\n\\>\\> ” compare and synthesize “ lol, exactly.\n\nwhy is that funny ?\n\n\\>\\>“it’s heavily blogged and many of the presentations can be viewed online.”  \n\\>\\>Then why should anyone go, incl. the presenters?\n\nduh. networking and realtime experience, among other reasons.  \never been ? it's great. priceless contacts.\n\n\\>\\>You are missing the truth, inconvienient as it may seem.  \n\\>\\>This being the whle point o the thread...  \n\\>\\>“...I want to see if they used my shot of Dr. Brian without asking...” :-)\n\nplease enlighten us, oh wise one. that complaint is directed at WIRED, not at TED.\n\n\\>\\>To court! (and give the money to the Gates Foundation)\n\nwhatever.\n\n\\>\\>Cheers!\n\nexactly.\n\n"
    },
    {
      "time": "4 Mar 2008 — 12:53pm",
      "content": "Well back to the question.\n\nDoes anyone have a WIRED subscription? I can't find it in London. I've been to Borders, Books Etc, Waterstones, WH Smith, and they only have WIRE which is a UK mag.\n\nta\n\n"
    },
    {
      "time": "4 Mar 2008 — 12:59pm",
      "content": "I wonder if all the speakers walked from the airport to the conference?\n\n[http://spacing.ca/wire/?p=1372](http://web.archive.org/web/20131023205339/http:/spacing.ca/wire/?p=1372 \"http://spacing.ca/wire/?p=1372\")\n\n"
    },
    {
      "time": "4 Mar 2008 — 1:04pm",
      "content": "_In print?_\n\nNeither print not digital are sustainable in their present forms.  \nWriting in sand is probably our best bet.\n\n"
    },
    {
      "time": "4 Mar 2008 — 1:24pm",
      "content": "or rock if you have a really big idea\n\n"
    },
    {
      "time": "4 Mar 2008 — 4:09pm",
      "content": "smoke signals !\n\n"
    },
    {
      "time": "4 Mar 2008 — 5:12pm",
      "content": "No. There is at least one article online, but nothing in the Mar. 2008 print issue. Maybe the April issue?\n\n"
    },
    {
      "time": "4 Mar 2008 — 5:37pm",
      "content": "There are TED links on [UnBeige](http://web.archive.org/web/20131023205339/http:/www.mediabistro.com/unbeige/conferences/keeping_tabs_on_ted_08_78819.asp).\n\n"
    },
    {
      "time": "5 Mar 2008 — 7:05am",
      "content": "\"why is that funny ?\"  \nI won a 1968 Mustang in buzz-word bingo, with that phrase.\n\nI'm sorry to leap out of the forum at anyone's opinion, but I am of the opinion that there is a whole kind of conference, and this is not new, that I find, and have found, to be deeply superficial, narrowly hypocritical... and broadly hilarious. But, I've mostly resisted.\n\nAuthor Paul Stamets, bless his heart, \"...mushrooms can save the world\", not unless they can learn to grow in sea water, not to mention that they're breathing my air. Undersea explorer Robert Ballard, brilliant guy, lots of people Do Explore the Oceans, stop taking pictures, haul up some of them battleships, lower sea level, make reefs. Todd Machover, genius, is gonna make sure that no rich parent will survive, and no rich child will be left behind, by Star Search. And I don't mean to 'peck' at you but Joshua Klein master of machines, why is he building a vending machine for crows to deposit coins, for peanuts...some future web model?\n\n\"Writing in sand is probably our best bet.\"  \nSand? For one to impress such an audience, one'd need to design and 'draw' a new font, liiive, in ones own blood.  \nMaybe next year.\n\nCheers!\n\n"
    },
    {
      "time": "5 Mar 2008 — 7:15am",
      "content": "<cite>Author Paul Stamets, bless his heart, “...mushrooms can save the world”, not unless they can learn to grow in sea water, not to mention that they’re breathing my air. </cite>\n\nAn interesting note on Mycelium is that several types work symbiotically with the roots of trees and provide nutrients that fertilize the trees. It is a very important issue with forestation and the paper industry because if the mycelium can be kept alive it reduces or eliminates the fertilization needs for tree farming. So David, the mushrooms are helping to make the air you breathe and are probably a huge factor in keeping a steady supply of breathable air.\n\n"
    },
    {
      "time": "5 Mar 2008 — 7:41am",
      "content": "[http://blog.wired.com/monkeybites/2008/03/exclusive-photo.html](http://web.archive.org/web/20131023205339/http:/blog.wired.com/monkeybites/2008/03/exclusive-photo.html \"http://blog.wired.com/monkeybites/2008/03/exclusive-photo.html\")\n\nHow funny is this!?\n\n ![](http://web.archive.org/web/20131023205339im_/http:/typophile.com/files/wired_TED_5618.jpg)\n\nWIRED nicked (L), TED used (R)....I guess anything on the net is public domain.. Even with a visible watermark and an embedded Digimarc.....\n\n"
    },
    {
      "time": "5 Mar 2008 — 10:52am",
      "content": "dberlow: so unless someone's presentation is the flawless be-all and end-all of their area of interest they should say nothing ? you must be kidding. it's called research and exploration. this is how ideas germinate, expand, cross-pollinate, fertilize, inspire, and evolve. it's an organic process and conferences can provide a concentrated dose of exposure, contacts, and inspiration.\n\nsorry none of them are good enough for you. perhaps next year we should all just ask you for your perspective on these topics ?\n\n"
    },
    {
      "time": "5 Mar 2008 — 12:27pm",
      "content": "I've subscribed to the Ted podcast feed on iTunes since it became available. There's some great stuff on there and there's some stuff that I just don't find interesting.\n\nDavid\n\n"
    },
    {
      "time": "7 Mar 2008 — 3:50am",
      "content": "JB, Mycelium can save the world then, which is different from mushrooms saving the world.\n\nCh:\" perhaps next year we should all just ask you for your perspective on these topics ?\"  \nTopic, not topics. It will not have changed. My perspective will remain that the typical digital 'see me' circus is not my thing. :)\n\nCheers!\n\n"
    },
    {
      "time": "2 Apr 2008 — 10:17pm",
      "content": "um.... well, breakfast with geniuses is always a treat. face time. interaction, conversation, questions & ideas, moments of inspired argument, all that human hello! eye contact talking about seriously interesting things which sometime lead to projects jobs or strategies.\n\nfrom the detachment of my lone computer the typophile comes close.  \ngreat minds at work. humbling and nutritious.\n\n"
    },
    {
      "time": "7 Mar 2008 — 7:52am",
      "content": "<cite>JB, Mycelium can save the world then, which is different from mushrooms saving the world.</cite>\n\nAnything saving the world is clearly hyperbole, but what I did not clarify is that mycelial mats are the root structure of the mushroom. The mats are the worlds largest organisms, and their fruit, so to speak, is the mushroom.\n\n"
    },
    {
      "time": "27 Mar 2008 — 12:56pm",
      "content": "just fyi : here's one of those useless, trendy, minor celebrities  \npresenting something really boring and inconvenient :\n\n[http://www.ted.com/index.php/talks/view/id/129](http://web.archive.org/web/20131023205339/http:/www.ted.com/index.php/talks/view/id/129 \"http://www.ted.com/index.php/talks/view/id/129\").\n\n"
    },
    {
      "time": "31 Mar 2008 — 5:24am",
      "content": "I don't think this person is a useless or trendy, just slow and not likely to finish. He is not a miinor celebrity, I'll give him that. My jaw remained firmly raised. The really interesting thing in this video, besides the crap type, was the number of times, the presenter says, \"what if\". Like, what if \"everybody\" put all kinds of text data and metrics matching data into all their photos, and then gave them away for free! Or, what if everybody had enough memory and bandwidth to browse a glabobyte of data on their computer in ten seconds...What if Operating systems were as scaleable as the fonts and images we've been supplying for nearly three decades, WOW!\n\nWhat'a the big deal to \"be there\" for something that's not possible for years?\n\nCheers!\n\n"
    }
  ]
}
