{
  "id": "42730",
  "title": "student needs input on logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I am trying to create a logo for a zoo in Ohio. It is called “The Wilds” and this is what I’ve got so far. Anyone have any suggestions at all? I think I could use some help.\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 2.jpg](http://web.archive.org/web/20080925080856/http:/typophile.com/files/Picture%202_13.jpg) | 93.31 KB |\n\n [‹ Identity Logo Design](http://web.archive.org/web/20080925080856/http:/typophile.com/node/45336 \"Go to previous forum topic\") [Logo for Music Publisher ›](http://web.archive.org/web/20080925080856/http:/typophile.com/node/44764 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080925080856/http://typophile.com/user/27665\" title=\"View user profile.\">jcduffy</a>",
  "time": "<br>",
  "uid": "27665",
  "comments": [
    {
      "time": " 2.Mar.2008 10.29pm",
      "content": "Are those horns, grass or snakes? I’ve never seen green horns.\n\n"
    },
    {
      "time": " 3.Mar.2008 6.21am",
      "content": "Is it supposed to have that jaggy aliasing effect on it? If not, you’ll want to design your logo in a vector application so the logo can be used at any size.\n\nTo me, a zoo is a place filled with fun and adventure (and animals). If I wanted to see four blades of grass, I could go into my backyard.\n\nI’d take a look at some existing zoo logos for inspiration, then start again.\n\n- Lex\n\n"
    },
    {
      "time": " 3.Mar.2008 6.49am",
      "content": "What level design course is this? (High School? Tech school? College?)\n\n"
    },
    {
      "time": " 5.Mar.2008 2.06pm",
      "content": "I see 2 sets of frog legs.\n\n"
    },
    {
      "time": " 5.Mar.2008 7.29pm",
      "content": "Frogs diving into green soup. :)\n\n"
    },
    {
      "time": " 6.Mar.2008 12.10pm",
      "content": "To be honest, this is just not very good. Judging by the way you’ve chosen to present this - jaggy lines, bad typography, three colors when one would do - the suggestions we would give you would be pointless. How did you create this? Do you have any sketches? What class is this for?\n\n"
    },
    {
      "time": " 6.Mar.2008 8.49pm",
      "content": "My wife took a look at this and said it was “too erotic.” ... looks like it’s two women with, “knees bent, ready to go.”\n\nI thank God every day for my randy, sassy little wife of mine.\n\n"
    },
    {
      "time": " 7.Mar.2008 11.17am",
      "content": "that’s funny.that’s all i can see now. thank! =)\n\n"
    },
    {
      "time": " 9.Mar.2008 9.27pm",
      "content": "The image is really bad - but the idea isn’t, IMO. Try grabbing a pen & paper and sketching it out, instead of using the computer. I suspect it’ll look a lot better, and will be easier to give constructive feedback on.\n\n"
    },
    {
      "time": " 10.Apr.2008 10.52am",
      "content": "updated try. thanks for the input. anything else?\n\n ![](http://web.archive.org/web/20080925080856im_/http:/typophile.com/files/Wilds_Logo_5777.jpg)\n\n"
    },
    {
      "time": " 10.Apr.2008 11.28am",
      "content": "umm...still not sure what those are supposed to be. Antlers? Snakes? Not sure a zoo is the type of entity that should have an abstract logo.\n\n"
    },
    {
      "time": " 10.Apr.2008 12.02pm",
      "content": "I think the updated version is a big improvement over the first one.\n\nMy first guess when seeing this was zebra tails. Not sure if that’s what you want, but it makes total sense, provided that there really are zebras in your zoo.\n\nThe typography has also improved a lot. The green colour block behind “theWilds” seems like a very natural colour choice and makes total sense to me.\n\n[Webdesign Portfolio](http://web.archive.org/web/20080925080856/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 10.Apr.2008 7.35pm",
      "content": "I’m sorry, but I can’t resist ...\n\nnow it’s frog legs in a zebra costume.\n\nKids will love it! :D\n\n"
    },
    {
      "time": " 11.Apr.2008 7.02am",
      "content": "Surely antelope antlers forming a W?  \nIn the second iteration the form is showing much better but I believe they should be distinctly pairs of antlers rather than the same ‘pair’ reflected. I think that reinforcing the crossed W in the text is too much. It is the kind of logo/client that could benefit from having the same basic treatment – animals or parts of animals used to create a character – it has legs (no pun intended), but the illustration has to be really spot on.\n\nTim\n\n"
    },
    {
      "time": " 11.Apr.2008 7.30am",
      "content": "I think it would work better if we could see the animals’ ears. I also agree that the reflected antlers look strange.\n\n- Lex\n\n"
    },
    {
      "time": " 11.Apr.2008 4.35pm",
      "content": "I did think antlers with the second version. A great improvement. Lex’s idea about showing the ears is brilliant; I think a ’W’ and animals connection would really drive the point home. Keep us posted!\n\n—-  \nNick Hladek\n\n"
    },
    {
      "time": " 19.May.2008 5.15pm",
      "content": "if you want to design logos you’re going to need a good vector illustration program.\n\nAdobe indesign works well, as does Inkscape, an open-source solution\n\n[http://www.inkscape.org](http://web.archive.org/web/20080925080856/http:/www.inkscape.org/ \"http://www.inkscape.org\")\n\n"
    },
    {
      "time": " 19.May.2008 5.28pm",
      "content": "Innovati,  \nHuh? InDesign is page layout, but more curious, why would you just assume he’s not using Illustrator?  \nE\n\n"
    },
    {
      "time": " 20.May.2008 10.21pm",
      "content": "@Eileen\n\nI meant illustrator, I promise!\n\n(maybe it’s because I love InDesign so much more than illustrator because it’s not such a toy :) haha)\n\n"
    },
    {
      "time": " 21.May.2008 5.07pm",
      "content": "Tools are just tools - I think the improvement between the first and second drafts indicates a change in attention to detail, not tools! I think an equally improved third draft could be made with markers, cut-out construction paper, or drawn in the sand (OK, maybe not that). Tools are RARELY the limiting factor.\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 23.May.2008 7.23am",
      "content": "tools may not be the limiting factor to creativity, but to a professional logo tools do make the difference. Vector is needed, no matter what vector, but that’s how logos need to be constructed. Logos must be scalable. Pixel-designs don’t allow for lossless scaling.\n\nBefore you say tools don’t matter, I think you would have a hard time typesetting a PDF magazine of all you had to work with a a ziploc bag of cut-out construction paper fonts from the foundry. I think you’d be singing a different tune.\n\n"
    }
  ]
}
