{
  "id": "4273",
  "title": "Fear",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Fear is the prospective name for a decorative font:   \n [http://www.dazeofourlives.com/fear.gif](http://web.archive.org/web/20150416095921/http:/www.dazeofourlives.com/fear.gif)   \nObviously it is a work in progress. So far I have only come up with the HAMBURGERFONTS characters, plus \"D\". (I submitted it to ITC, but it was rejected.)   \nI'm very happy with the basic concept. I've never seen a font where the stroke essentially weaves in and out like this. Hopefully you can see the hand behind this work. It was not produced with a digital filter.   \nI'd be interested in any opinions.   \nMany thanks.\n\n",
  "author": "anonymous",
  "time": "4 Sep 2001 — 11:41am",
  "uid": "1203",
  "comments": [
    {
      "time": "5 Sep 2001 — 10:31am",
      "content": "Thankyou both for your comments.   \nHere is a \"light\" version of Fear:   \n [http://www.dazeofourlives.com/fearlite.gif](http://web.archive.org/web/20150416095921/http:/www.dazeofourlives.com/fearlite.gif)   \nwhich WAS produced using a filter. (The Offset Path filter in Illustrator.) It's just for comparison really. The \"levels of jitteriness\" idea is very interesting.   \n   \nRe: ITC. I totally agree about their generally bland type collection. But they and they alone still pay the designer an upfront royalty for each font they publish. No other font publisher does this.   \nPersonally - and this is probably not the right forum to discuss this - I have no idea how anyone except the elite type designers make any money from their craft. Every font is so labor intensive that it just doesn't make economic sense to pursue type design as anything more than a hobby.   \nSo for me - if I'm not going to get a $2500 check from ITC in advance of sales - then why bother devoting hundreds of hours for the paltry sums I might get through other outlets? It works out to what - a dollar an hour? I cannot justify spending time on type design when I have bills to pay, etc.   \nAnyhow - sorry for the negative rant.\n\n"
    },
    {
      "time": "5 Sep 2001 — 10:53am",
      "content": "Martin,   \n   \nBitstream makes a similar offer.   \n   \nSee the PDF available at   \n [http://www.bitstream.com/categories/products/nfc/submit\\_index.html](http://web.archive.org/web/20150416095921/http:/www.bitstream.com/categories/products/nfc/submit_index.html)   \n   \nIt's $2000 for exclusive ownership transferred   \nto BT. They seem to accept just about anything,   \njudging by the quality of their recent releases.   \n   \nStephen\n\n"
    },
    {
      "time": "5 Sep 2001 — 10:58am",
      "content": "Stephen!   \nThanks for that link. I didn't know that about BitStream.\n\n"
    },
    {
      "time": "5 Sep 2001 — 11:57am",
      "content": "Martin,   \n   \nSort of off topic, but I enjoyed surfing around [http://dazeofourlives.com](http://web.archive.org/web/20150416095921/http:/dazeofourlives.com/). Nice.   \n   \n//joe\n\n"
    },
    {
      "time": "5 Sep 2001 — 12:14pm",
      "content": "Yes! Hoorah! (Martin: Is Terry Gilliam your uncle?)   \n   \nStephen\n\n"
    },
    {
      "time": "5 Sep 2001 — 5:46pm",
      "content": "Joe and Stephen!   \nYou are too kind. Thanks for the compliments.   \nDaze gets a lot of traffic and I published the first collection in book form last year.   \n   \nThe most common comparison people make is Edward Gorey:   \n [http://www.geocities.com/SoHo/Square/3441/object1.html](http://web.archive.org/web/20150416095921/http:/www.geocities.com/SoHo/Square/3441/object1.html)   \n   \nBut there is another humorist called Glen Baxter whose work I love. At The New Yorker Cartoon Bank:   \n [http://www.cartoonbank.com/search\\_results.asp?mscssid=CJ6KCUR2S1S92MD000GPBQXDMWKV2US9&s\\_keywords=&s\\_artist=baxter&s\\_caption=&s\\_id=&s\\_topic=&s\\_fromdate=&s\\_todate=&x=26&y=13](http://web.archive.org/web/20150416095921/http:/www.cartoonbank.com/search_results.asp?mscssid=CJ6KCUR2S1S92MD000GPBQXDMWKV2US9&s_keywords=&s_artist=baxter&s_caption=&s_id=&s_topic=&s_fromdate=&s_todate=&x=26&y=13)   \n   \n   \nTypographically, I have great fun playing with 19th century types for designs used in Daze of Our Lives material. I really think it was such a rich, inventive and eclectic time for type design. The modern age and minimalism definitely killed a lot of that spirit off.   \nAgain, thanks - and spread the good word about Daze for me would you?\n\n"
    },
    {
      "time": "8 Sep 2001 — 10:30am",
      "content": "I've spun the last 16 posts in this thread off   \ninto a subtopic under \"General Discussions:   \nMaking a living as a type designer.\"   \n   \n//joe\n\n"
    },
    {
      "time": "5 Sep 2001 — 8:59am",
      "content": "This is a cool effect, and the characters are suprisingly legible at all sizes.   \n   \nAt risk of offending potential marketers of my own fonts, don't feel too badly about the fact that ITC rejected yours. I find many (not all) of ITC's fonts to be overly sterilized anyway. (As evidence, witness what they did to the Storm Typefoundry's beautiful Biblon typeface, or ITC \"Garamond\".)   \n   \nI suspect you'd do well with this font on MyFonts.com.   \n   \nI look forward to seeing more of the character set, including lower case characters.   \n   \nDavid Thometz\n\n"
    },
    {
      "time": "4 Sep 2001 — 4:40pm",
      "content": "Nifty! In the smaller sizes it comes out great. I think you should make a number of weight and \"jitteriness\" variants.   \n   \nAs for the name, I think maybe it's a bit too plain/descriptive.   \n   \nhhp\n\n"
    }
  ]
}
