{
  "id": "42760",
  "title": "Running Windows XP on Mac...Freelance Graphics font Q",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Okay...I found this forum through googling for an answer to a random font question, and I’m hoping you font experts will be able to help me. It’s kind of a random question.\n\nI’m the IT Mgr in my office, which is an office of Windows users. We have 1 Mac user who works remotely. He is running Win XP on his Mac, in order to run the software our company uses - namely, Lotus Freelance Graphics. We do a lot of presentations with graphs of data, and we’ve found Freelance to be superior in that department. So even though the program was discontinued in 1999 or 2000, we still use it and have no trouble with it on XP Pro and Win2K machines.\n\nRecently, this Mac user brought to my attention that he had to change the fonts on every page of a presentation because the Freelance font engine is outdated, and when he opened the file on his Mac (running Windows), things got screwy. However, our presentation template uses Arial. Not Arial MT, or Arial Black, plain Arial. Which I would think would have no problem across platforms. And furthermore, we open presentations on tons of PCs — home computers, laptops, work computers, etc...and never had to change fonts on any windows-based machine.\n\nMy question is: is it the font engine as my user stated, or is it a windows-on-mac issue?\n\nI don’t know anything about running Windows on a Mac, and how that affects fonts. And since Freelance is so outdated, it’s hard to find info online about that specific program.\n\nI don’t know anything about font engines either...so any help you can provide will be much appreciated! My boss is anxiously awaiting my response.\n\nThank you!\n\n [‹ Font that envokes the ocean?](http://web.archive.org/web/20080310032254/http:/www.typophile.com/node/42670 \"Go to previous forum topic\") [Beorcana ›](http://web.archive.org/web/20080310032254/http:/www.typophile.com/node/42764 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080310032254/http://www.typophile.com/user/27852\" title=\"View user profile.\">edison</a>",
  "time": "<br>",
  "uid": "27852",
  "comments": [
    {
      "time": " 3.Mar.2008 2.12pm",
      "content": "Sounds fishy - if the user is booting Win XP on the Mac then there should be no interference issues – but under Parallels, maybe I don’t know.\n\n"
    },
    {
      "time": " 3.Mar.2008 2.15pm",
      "content": "Parallels should have no problems with fonts, at least assuming he’s not running ones of those crazy stripped builds of XP that are popular with the VM crowd.\n\n"
    },
    {
      "time": " 3.Mar.2008 2.29pm",
      "content": "knowing nothing about Parallels, does an app running on it have access to just the Win XP installed fonts or can it access Mac OS fonts too?\n\n"
    },
    {
      "time": " 3.Mar.2008 2.34pm",
      "content": "I don’t know if an app running on it has access to just the Win XP installed fonts or if it can access Mac OS fonts too. I really don’t know his setup as he is remote (I can’t just walk over and troubleshoot) and although I have experience w/ macs I am not familiar with running windows on a mac.\n\nWhat are parallels?\n\n"
    },
    {
      "time": " 3.Mar.2008 2.42pm",
      "content": "There are two ways to use Windows on a Mac -one is to use bootcamp and set up a dual boot system. This would be the safest option. The other is to run Parallels or similar virtualization software that lets you run Windows in a window on the Mac - I’d guess this is more risky. My gut instinct is that the problem relates to the fonts installed and how Lotus enumerates them, my guess is that it’s tripping over font conflicts related to the Mac fonts. That might be as simple as the user copying the Mac fonts over and installing them on the Windows side.\n\n"
    },
    {
      "time": " 3.Mar.2008 2.52pm",
      "content": "Interesting. That makes sense. I believe he’s running bootcamp but I am verifying that. Hopefully it will be something that simple. I also found some complaints about display issues in the bootcamp/windows environment that are fixed with video driver upgrades. I can have him try that as well. Will keep you posted. Thank you!\n\n"
    },
    {
      "time": " 3.Mar.2008 2.54pm",
      "content": "\\>\\>That might be as simple as the user copying the Mac fonts over and installing them on the Windows side.\n\nI’d do the opposite. Windows fonts to Mac.\n\n"
    },
    {
      "time": " 3.Mar.2008 3.23pm",
      "content": "I don’t think Windows (or any other OS) running in Parallels has any access to the host OS or resources like fonts. It’s not like Classic running on OS X. Parallels virtualizes the PC hardware, not the software running on it. You can access files from the host system, but the host system appears to the virtual machine as just another computer on the network.\n\n"
    },
    {
      "time": " 3.Mar.2008 3.29pm",
      "content": "One more thing: When running Windows with Boot Camp, Windows boots from a separate partition and the Mac start up volume is not visible or mountable. Windows running on a Mac with Boot Camp functions exactly like Windows running on any PC hardware, except that you have the option to boot into Mac OS at start up.\n\n"
    },
    {
      "time": " 3.Mar.2008 3.30pm",
      "content": "Thanks Mark, that kind of reinforces my feeling that the user may have copied Mac fonts to the Windows partition (jumping through hoops to do so) and there’s a clash.\n\n"
    },
    {
      "time": " 3.Mar.2008 3.59pm",
      "content": "I run Windows XP Professional on my MacBook Pro, using Parallels Desktop (build 3214, 06/21/2007). There is no way I can access the fonts on the Mac OS side. Conversely, the TT and OT fonts I use on my Windows side are usable on the Mac side.\n\n"
    },
    {
      "time": " 3.Mar.2008 6.23pm",
      "content": "So what do you think could be causing this?\n\n"
    },
    {
      "time": " 4.Mar.2008 1.14am",
      "content": "With Bootcamp, when you boot up in Windows, you cannot access any of the files from the Mac partition of your hard drive. But if you boot into Windows, you can access ALL of the files from your Windows partition.\n\nSo, in Mac mode, you can move files to and from your “PC,” but not vice versa. This means that if you want Mac fonts in Windows, you have to copy them to the Windows font folder from Mac OS X. However, I don’t think that any of the Mac system fonts will work in Windows. Windows doesn’t support AAT fonts, right? Are all Mac system fonts AAT format, or just some of them?\n\nAnyway, even if they do work, it is a big workaround to view the same fonts you use on your Mac side in your Windows side. But if you want to copy any of the PC fonts over to your Mac side, that is easy.\n\nSi, as an aside, does using the Windows fonts in Mac OS X violate the Microsoft EULA? One might assume that it would not, since both Windows and Mac OS X in this case would be installed on the same workstation.\n\n"
    },
    {
      "time": " 4.Mar.2008 6.38am",
      "content": "\\>Si, as an aside, does using the Windows fonts in Mac OS X violate the Microsoft EULA?\n\nUsual disclaimers in place - I’m not attorney… The Vista EULA says that the fonts may be used while the software (Windows) is “running”. Win XP EULA does not have this wording.\n\n"
    },
    {
      "time": " 4.Mar.2008 6.40am",
      "content": "Mark is correct. Windows is windows. It has no concept of the OSX environment it’s running in. The only thing it can recognize are ’shared’ folders that Parallels creates. It ’tricks’ Windows into seeing a folder on your OSX install as a shared drive within windows.\n\nSo, yea, if you want to use fonts in windows, you need to install them \\*in\\* windows.\n\n"
    },
    {
      "time": " 4.Mar.2008 8.59am",
      "content": "I’m blaming Arial ;)\n\n"
    },
    {
      "time": " 4.Mar.2008 9.00am",
      "content": "\\* double post \\*\n\n"
    }
  ]
}
