{
  "id": "42766",
  "title": "Is there a reasonably narrow font that comes with Linux?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi\n\nI define my html headings and headers using:  \nfont-family: \"Arial Narrow\", \"Helvetica Narrow\", Arial, Helvetica,  \nsans-serif\n\nHowever, according to the screen captures I've done at  \nbrowsershots.org Linux machines display this using very wide metrics  \nindeed, to the extent that the number of characters per line on a  \nLinux machine is roughly half the number of characters per line  \ndisplayed on Windows and Mac machines when viewing the same web page.\n\nIs there a reasonably narrow headline (sans serif) font that comes as  \nstandard with Linux which I could use as a substitute for Arial Narrow/  \nHelvetica Narrow?\n\nDave\n\nPS - I've noticed that Wikipedia uses a reasonably narrow font for  \ntheir main article headings, but (a) I can't work out what font-family  \nthey are using (their css files are a labyrinth and I can't make sense  \nof them); and (b) I can't test how their headings look under Linux (I  \nuse Windows), because Wikipedia has blocked browsershots.org using a  \nrobots.txt file.\n\nDave\n\n",
  "author": "Dave Rado",
  "time": "3 Mar 2008 — 2:45pm",
  "uid": "27854",
  "comments": [
    {
      "time": "3 Mar 2008 — 3:50pm",
      "content": "Most distros should come with Bitstream Vera, DejaVu or Nimbus. There are condensed weights of DejaVu Sans and of Nimbus Sans.\n\n"
    },
    {
      "time": "3 Mar 2008 — 5:26pm",
      "content": "Arial Narrow isn't a default Windows font either (although it's quite common as it comes with Office). I think it would be considered bad-form to rely on it for Web pages to work properly.\n\n"
    },
    {
      "time": "3 Mar 2008 — 5:59pm",
      "content": "Re. Thomas's post, how should I define the font-family in the css file in order to get the condensed Vera, DejaVu or Nimbus fonts to display? E.g. does one write:\n\n{font-family: “Vera Condensed”, \"DejaVu Condensed\", \"Nimbus Condensed\"}?\n\nRe. dii's post, it depends what you mean by \"work properly\" - I have defined the font family of my heading and header styles to display Arial or Helvetica if Arial Narrow and Helvetica Narrow are both not present, so it will work properly to an extent on any machine with any of those four fonts installed. But having said that, if you can think of a narrow sans serif headline font that comes as standard on Windows machines which \\*don't\\* have Arial Narrow installed, and if you can think of a narrow sans serif headline font that comes as standard on Mac OS machines which don't have Helvetica Narrow installed, then I would be very grateful for this information.\n\nDave\n\n"
    },
    {
      "time": "4 Mar 2008 — 5:01am",
      "content": "I don't know CSS; maybe you can figure it out if you download the fonts.\n\nHow did I forget to mention this? I looked at Wikipedia's stylesheets a while ago. I think the font was just set as \"sans-serif\", which I think is a soft link in some distros to another font, but squooshed so that it was 125% of it's normal width.\n\n"
    },
    {
      "time": "5 Mar 2008 — 4:29am",
      "content": "Re. Thomas Levine's post, can anyone work out how they've \"squashed\" it?\n\nDave\n\n"
    }
  ]
}
