{
  "id": "42774",
  "title": "Please help: Milo Text with Milo Medium? Or better with the bold weight?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm about to suggest FF Milo to one of my clients and I'm pondering which weights are reasonable for combination. I'd thought I'd find some printed material in the latest Font Book, but Milo is missing in there. Also I've printed out the pdfs available, but it's difficult to decide on the basis of a few lines of text printed with an inkjet printer.\n\nThanks to [this thread](http://web.archive.org/web/20131106070155/http:/typophile.com/node/31150) I've narrowed the choice to the text weight and now the question is which additional weight looks good for emphasizing. Italic is fine without any doubt, but concerning medium or bold, looking at the inkjet printed pdfs I'm hesitating: medium looks as if there is not enough color difference in comparison to the text weight, whereas bold seems to be too strong.\n\nWhat do you think? Which weight is better suited as a companion for Milo text?\n\n",
  "author": "tina",
  "time": "3 Mar 2008 — 4:20pm",
  "uid": "4754",
  "comments": [
    {
      "time": "3 Mar 2008 — 4:43pm",
      "content": "Hi, Tina. FontBook came off the presses just a few months before FF Milo was released, so it was unfortunately not possible to include it.\n\nI believe FF Milo Medium is intended as an emphasis for Regular. And Bold complements the Text weight. The contrast would be too low otherwise, as you've observed.\n\nThis is why they are sold in these two packages:  \n [http://www.fontshop.com/fonts/downloads/fontfont/ff\\_milo\\_1\\_ot/](http://web.archive.org/web/20131106070155/http:/www.fontshop.com/fonts/downloads/fontfont/ff_milo_1_ot/ \"http://www.fontshop.com/fonts/downloads/fontfont/ff\\_milo\\_1\\_ot/\")  \n [http://www.fontshop.com/fonts/downloads/fontfont/ff\\_milo\\_2\\_ot/](http://web.archive.org/web/20131106070155/http:/www.fontshop.com/fonts/downloads/fontfont/ff_milo_2_ot/ \"http://www.fontshop.com/fonts/downloads/fontfont/ff\\_milo\\_2\\_ot/\")\n\n"
    },
    {
      "time": "4 Mar 2008 — 1:56am",
      "content": "Hi Stephen, thanks for your help.  \nI'd seen these packages, too, and I'm sure there are lots of thoughts behind grouping the fonts as they're offered. On the other side, it's always the tiny details which keep bugging, no? But ok, as there might only a few words to be emphasized and not long parts of text, and the overall amount of text won't be that much at a time, the text/bold combo might be fine then.\n\n"
    },
    {
      "time": "4 Mar 2008 — 10:44am",
      "content": "Is italic an option for emphasis? That's the preferred method in books and other long texts.\n\n"
    }
  ]
}
