{
  "id": "42775",
  "title": "Feature this: New Slant on Beorcana",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Carl returns to the Typophile display arena with his italic version this time. Lookin' pretty clean up there, Carl!\n\nChrisL\n\nPS: edited to avoid terminal embarrassment for poor typing\n\n",
  "author": "<a href=\"/web/20110709002538/http://typophile.com/user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": "",
      "content": "Needs more cowbell.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Chris. This is the Text version.\n\n"
    },
    {
      "time": "",
      "content": "Damn straight -- looks tighter than a nun's chuff :)\n\n"
    },
    {
      "time": "",
      "content": "Typophile has never looked that good before.\n\n"
    },
    {
      "time": "",
      "content": "What about a proper em-dash in the header Chris?\n\n(and you missed the second i in italic)\n\n"
    },
    {
      "time": "",
      "content": "Beocana is looking great.\n\nPatty, I have a feeling that 'smarty pants' doesn't work for headings--hence the double dash. And is kerning missing also in the headings?\n\n"
    },
    {
      "time": "",
      "content": "But... you can keystroke an em-dash, can't you?\n\n"
    },
    {
      "time": "",
      "content": "Patty, What William said :-)  \nNow, if I fix it, it goes to the bottom and makes no sense so I will just stay forever as typo-man and victim of Smarty Pants :-/\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I just key-stroked it, Patty and it changed to the figure 2014 which is even worse :-(\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "OK, so now I used a colon to avoid the ferschtunkana M-dash 2014 problem.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Haley, I don't think Will Farrel will be playing this gig :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Right, William,\n\nNo kerning, no OT features. The cowbell is turned off too. ;( Maybe someday all those bells and whistles can be presented online. I still think it's very cool they can use a specific typeface for headers at all. Not to mention transparency etc.\n\n"
    },
    {
      "time": "",
      "content": "It looks very nice up there, Carl. :^)\n\nNothing smart happens in the headlines. People who try to outsmart it will be met with code and rubbish. :^P\n\n"
    },
    {
      "time": "",
      "content": "\"People who try to outsmart it will be met with code and rubbish. :^P\"\n\nI have been so met :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Ah, I think it works really well. :)\n\n"
    }
  ]
}
