{
  "id": "42770",
  "title": "Good free font for book.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I know, good fonts usually do not come cheap. But I am writing my first novel and typefaces are not something I can be spending money on because I am pretty much broke. But I might be able to get some better suggestions if I tell you that it is realistic si-fi and much of it has to do with robots. Some of the fonts I have been looking at are Perpetua and Trump Mediaeval and they are both very good, so something similar would be great.\n\n-Thanks,  \n Yamfox\n\n [‹ Looking for fonts similar to Untitled](http://web.archive.org/web/20080907034158/http:/www.typophile.com/node/39247 \"Go to previous forum topic\") [Origin of blackletter use in gang tattoos ›](http://web.archive.org/web/20080907034158/http:/www.typophile.com/node/42260 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907034158/http://www.typophile.com/user/27858\" title=\"View user profile.\">yamfox</a>",
  "time": "<br>",
  "uid": "27858",
  "comments": [
    {
      "time": " 3.Mar.2008 3.24pm",
      "content": "What is the content and tone of your novel? In what period is it based?\n\n"
    },
    {
      "time": " 3.Mar.2008 3.28pm",
      "content": "Use the Google Android fonts, I’m sure they’ve not been used in a novel, and a few people will get the joke.\n\nCheers, Si\n\n"
    },
    {
      "time": " 3.Mar.2008 5.04pm",
      "content": "It starts in period 1958 and ends in 2014.\n\n"
    },
    {
      "time": " 3.Mar.2008 5.41pm",
      "content": "<cite>it is realistic si-fi and much of it has to do with robots. Some of the fonts I have been looking at are Perpetua and Trump Mediaeval and they are both very good,</cite>\n\nI don’t mean to be cruel — well, maybe I do — but if Perpetua looks good to you, you must be using it around a 14-point setting. And if it reminds you of robots & science fiction, I guess we inhabit different planets.\n\nPostScript Perpetua never did work very well, and even in metal it only worked at larger sizes. Don’t look at the type as it comes off your laser printer; that will in no way look the same as when printed on an offset press.\n\n"
    },
    {
      "time": " 3.Mar.2008 5.46pm",
      "content": "I was going to suggest the new book weights of Gentium, but then remembered that they’re not ready for prime time yet.\n\n"
    },
    {
      "time": " 3.Mar.2008 5.58pm",
      "content": "The reason I like Perpetua is because my younger brother reads the ’Artemis Fowl’ series of books and the font caught my eye. After some searching I learned that it used 13.5 pt. Perpetua. And it looks quite good in the book, actually.\n\n"
    },
    {
      "time": " 3.Mar.2008 6.34pm",
      "content": "as mentioned [here](http://web.archive.org/web/20080907034158/http:/www.typophile.com/node/42193) Weiss is used in the Saga of Seven Suns series by Kevin J. Anderson.\n\n"
    },
    {
      "time": " 3.Mar.2008 6.41pm",
      "content": "Curious: Will you offer the book via on-demand printing? Why would your publisher, and their designer not be responsible for type selection and other production issues?\n\n"
    },
    {
      "time": " 3.Mar.2008 6.49pm",
      "content": "And the tone of the book is very unique. It is hard to describe it, but I guess I can give a quick plot description.\n\nPLOT: Twelve year old Cahal Anakoni Marcon suffers the loss of his father due to leukemia in 1958. He makes a vow to carry on his father’s work at the University of Pennsylvania, where his father helped develop the ENIAC supercomputer. After graduating from college he works as professor there for many years, until he finds out about the invention of the microprocessor in 1971. After getting his hands on the chip, he experiments with it to try to create a small, powerful computer, which ends up becoming a fully-fledged robot. He keeps updating the robot and it eventually is able to talk with a 2,000 word vocabulary and even mop his kitchen. He gives the robot the name Erica, and brings it to a local science fair, where he wins first prize. The prize of $3,000 dollars helps him create some new components and it eventually is able to do most things an average 6-year old can do. In 1985, after years developing the robot, he brings it to Armonk, New York and shows it to IBM. They turn out to be interested in his robot, and ask him if they can reverse engineer the robot to help develop some of their products. After learning that he will not get paid, he turns the offer down. He soon develops a program to help the robot learn, and soon it knows enough that they are having genuine conversations and the robot becomes a companion to Cahal. After suffering a bike accident, he does not see the robot for a few weeks. When he comes home, it turns out the robot was sitting at the counter with a cake frosted with the letters ’Get Well Soon’. “I just made it for you.” the robot replied. After this happened, he learned that the robot is smart enough to help people, and soon arranges with the nearest nursing home to introduce the robot with the residents and possibly have him work there for a few weeks. After it helps many of the residents and even cooked dinner for them, the nursing home allowed him to stay for 2 weeks, after which they would pay  \nCahal for every hour the robot worked. As it turned out, he worked nonstop for the whole 2 weeks. They ended up paying him $1,428. In 1992, Cahal is proven HIV-positive and leukemia diagnosed. The robot takes care of him until 1999, when Cahal dies. The robot calls the funeral home, all of Cahal’s surviving family members and the university. After the funeral, the university asks the robot if they can research him. After agreeing this is what Cahal would have wanted, he allows them to research him. In 2014, the university announces that they have created the most intelligent robot in the world, from both their own software and software reversed engineered of the robot.\n\nPretty crazy, I know.\n\n"
    },
    {
      "time": " 3.Mar.2008 6.53pm",
      "content": "and crossgrove, I want to be in control on the look of my book.\n\n"
    },
    {
      "time": " 3.Mar.2008 8.08pm",
      "content": "How close are you to being finished? A single weight of a font isn’t too expensive, and you could wait until the book is finished to make sure to buy the fonts so you can make sure that you don’t buy anything unnecessarily.\n\nI didn’t see anything here that looked particularly like Perpetua, (I didn’t look too hard.) but check out the [LaTeX serif fonts](http://web.archive.org/web/20080907034158/http:/www.tug.dk/FontCatalogue/seriffonts.html).\n\n"
    },
    {
      "time": " 3.Mar.2008 11.47pm",
      "content": "Gentium.\n\ndr\n\n"
    },
    {
      "time": " 4.Mar.2008 3.57am",
      "content": "’ [Lido](http://web.archive.org/web/20080907034158/http:/www.stormtype.com/typefaces-fonts-shop/typefaces-120-lido-stf)’, by František Štorm, maybe?\n\nDav(id)\n\n"
    },
    {
      "time": " 4.Mar.2008 4.18pm",
      "content": "I have fallen in love with ’Lido’, and I will be using it.  \nTHANKS!!\n\n"
    }
  ]
}
