{
  "id": "42772",
  "title": "Advice on logotype",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hi,\n\nI've been working on this logo for a while now and  \nI've completely lost any objectivity. I would appreciate any advice, recommendations  \nor constructive criticism because basically I can't tell anymore if it's alright or complete crap.\n\nP.S. It's for a interactive studio and the typeface is modified PMN Caecila\n\nCheers.\n\n ![](http://web.archive.org/web/20131021114805im_/http:/typophile.com/files/logotype_4042.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [logotype.jpg](http://web.archive.org/web/20131021114805/http:/typophile.com/files/logotype.jpg) | 44.84 KB |\n\n",
  "author": "suspekt007",
  "time": "3 Mar 2008 — 3:20pm",
  "uid": "27296",
  "comments": [
    {
      "time": "3 Mar 2008 — 3:25pm",
      "content": "I looks pretty good to me. What's the concept behind it?\n\n"
    },
    {
      "time": "3 Mar 2008 — 3:56pm",
      "content": "If you pull the design element closer to Wolfpack it makes a better unit. Otherwise go for it.\n\n"
    },
    {
      "time": "3 Mar 2008 — 4:14pm",
      "content": "It’s OK. Go for it.\n\n"
    },
    {
      "time": "3 Mar 2008 — 4:35pm",
      "content": "I would try and drag the element a tiny bit more to the left for a slightly better optical balance (this might be like that only when viewed on a screen).\n\n"
    },
    {
      "time": "3 Mar 2008 — 7:36pm",
      "content": "Very nice typography! I do agree with Robert and Tina (above), and I also find the picto to be a touch too big for the package. But I'm sure you've fought with the proportions in your sleep, so do what you and the client like best. Nice work!\n\n"
    },
    {
      "time": "4 Mar 2008 — 6:43am",
      "content": "The type works great, IMHO.\n\nThe mark, while slick, seems purely decorative and arbitrary and I'd argue isn't really needed at all. Since this is for a design studio, I'd suggest dropping the mark all together. It keeps the type pure and prevents your own logo from competing with your actual work in the portfolio.\n\n"
    },
    {
      "time": "4 Mar 2008 — 2:50pm",
      "content": "I agree with aluminum, I like them independently, but not necessarily together. They are very different in feel: the mark seems fluid and decorative and the typography is a little \"stiff\" for the mark. Maybe if both pieces used the same type of line (either rounded or straight ends) or maybe if you modify the type to flow with the mark instead of chopping the ends.  \nGood luck - I too am fighting with a logo but I don't know if I am brave enough to post!\n\n"
    },
    {
      "time": "4 Mar 2008 — 2:54pm",
      "content": "I like the combination but I think, with others, that the logo needs to nudged leftwards so that it \"appears\" centered. At the moment it feels weighted to the right.\n\n"
    },
    {
      "time": "4 Mar 2008 — 4:16pm",
      "content": "I don't get it. It's a mark with no meaning. Joe average will never get it. Does it have a purpose?\n\n"
    },
    {
      "time": "4 Mar 2008 — 4:33pm",
      "content": "First of all, thanks everyone for your comments, it's great to get some feedback...  \nIn response to some of the posts:\n\nDan: It does have a meaning behind it, but I think your right and it may be far to obscure and overly subtle. The four pieces coming together are supposed to represent wolfs, the three lines as claw-marks in the shape of a wolf's front leg. Also the star in the negative space relates to the Lupus (the wolf) constellation.\n\nOthers: I think you are right the type could probably exist without the mark, and i am looking at going down this road, although I am very attached to that symbol :).\n\nAnother point(probably why I'm finding this logo difficult to resolve) is that it's for a personal business venture.\n\nAgain cheers for your feedback.\n\n"
    },
    {
      "time": "5 Mar 2008 — 1:41am",
      "content": "You say the three lines in the mark represent claw-marks, but when I think about claw-marks ik picture raw and powerful lines instead of subtle rounded ones. It's like a wolf trying to paint with paint on it's nails. Could be a nice image, if that's what you were aiming at.  \nAlthough i think the mark looks really nice and the idea behind it is pretty good, it doesn't really fit the name of the studio. But that's my opinion\n\n"
    },
    {
      "time": "5 Mar 2008 — 5:18am",
      "content": "Brainstorming, I think a better image (if you're still considering a logomark) would be a wolfpack. I'm envisioning the silhouette of 3 wolves standing proud, as if they're looking out over a cliff at their prey. One centered, one angled to the right and one angled to the left (off kilter, wolves aren't into symmetry.)\n\nBut, that's just an idea.\n\n"
    },
    {
      "time": "5 Mar 2008 — 6:26am",
      "content": "I'm afraid the 'lines' will be too thin at small sizes, and the space between them too.\n\n"
    },
    {
      "time": "5 Mar 2008 — 6:49am",
      "content": "I also immediately thought that the customized type was done really well, and could exist on its own without a problem. But I can imagine you are attached to the symbol, because it does look very nice. If you keep 'em both, I would suggest closing the gap between the two a little.  \nTo make the wordmark play the leading role, you could also see what happens if you make the symbol smaller. Although I can imagine it might indeed get too light compared to the type when you do that.\n\nOtherwise; go for it. It's nice.\n\n"
    },
    {
      "time": "6 Mar 2008 — 1:13am",
      "content": "Maybe let the lines grow a bit thicker at the end of the \"paw\"? That would support your metaphor a bit. I actually _did_ see some kind of hand/paw of some sort, before you mentioned it. I think it's because it reminds of a lot of club visuals I've seen in Copenhagen (I couldn't find a picture, sorry)  \n– _Malte_\n\n"
    },
    {
      "time": "6 Mar 2008 — 5:28pm",
      "content": "Ok.. I think i may have resolved it..\n\nTell me what you think.. :)\n\n ![](http://web.archive.org/web/20131021114805im_/http:/typophile.com/files/logotype2_5765.jpg)\n\n"
    },
    {
      "time": "10 Mar 2008 — 8:43pm",
      "content": "I'm not sure I like the new symbol, but apart from that, I think it might be a bit too heavy. It wants all the attention, where -- I think -- the wordmark should get it.\n\n"
    },
    {
      "time": "11 Mar 2008 — 10:53am",
      "content": "Did you tighten the tracking? The letters seem a little jammed together now. I didn't feel that way from your first entry. If you didn't change it, then it's just because it's at a smaller size. You may want to consider having a version used exclusively for small sizes that uses <cite>slightly</cite> looser tracking, for the sake of visual consistency.\n\nI really like your letter customization.\n\n"
    },
    {
      "time": "11 Mar 2008 — 11:26am",
      "content": "What does the new symbol mean?\n\n"
    },
    {
      "time": "11 Mar 2008 — 12:31pm",
      "content": "\\> What does the new symbol mean?\n\nWell, it does contain 4 Ws if you look closely.\n\n"
    },
    {
      "time": "11 Mar 2008 — 12:56pm",
      "content": "<cite> &gt;&gt;What does the new symbol mean?&lt;&lt; </cite>\n\nIt looks like a Native American symbol to me.\n\n"
    },
    {
      "time": "12 Mar 2008 — 7:53am",
      "content": "\\> _It looks like a Native American symbol to me._\n\nYes, reminiscent of a Hopi symbol or something like that.\n\n"
    },
    {
      "time": "12 Mar 2008 — 10:18am",
      "content": "It looked Native American to me, also. I hate to see you abandon your first symbol. I liked it.\n\nSharon\n\n"
    },
    {
      "time": "16 Mar 2008 — 10:16pm",
      "content": "Further development.. not sure if I;m happy with this though..  \nhave done a fair few symbols now..\n\n ![](http://web.archive.org/web/20131021114805im_/http:/typophile.com/files/logotype3_5475.jpg)\n\n"
    },
    {
      "time": "16 Mar 2008 — 11:43pm",
      "content": "I'd go without the symbol completely, I think the type is very strong and the symbols aren't adding significantly to the identity. If you do go with a symbol though, focus on the weight and the width of the positive/negative space in relation to the text. Well done.\n\n"
    },
    {
      "time": "17 Mar 2008 — 7:21am",
      "content": "Pablo, everyone loves the word mark, why are you forcing a logo with it? Even you don't sound too sure about them. There's an old saying, \"Good Design is the balance between Monotony and Self Indulgence.\" quit while you're ahead, don't try to add more than is needed.\n\n"
    }
  ]
}
