{
  "id": "42788",
  "title": "consciousness through typography",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I thought it would be interesting to typographically represent ’consciousness’.\n\nWhether it be human consciousness, a baudrillard simulation style consciousness, or perhaps an abstract artists viewpoint. It is such a vast an interesting subject Can anyone think of any interesting ideas for typographically representing this? Or any links to any similar concepts?\n\n:)\n\n [‹ Alternative to Berthold Caslon](http://web.archive.org/web/20081015172426/http:/www.typophile.com/node/43301 \"Go to previous forum topic\") ['Private Character Editor' in WinXP and Vista ›](http://web.archive.org/web/20081015172426/http:/www.typophile.com/node/43308 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015172426/http://www.typophile.com/user/25250\" title=\"View user profile.\">koopdoggedawg</a>",
  "time": "<br>",
  "uid": "25250",
  "comments": [
    {
      "time": " 4.Mar.2008 7.21am",
      "content": "type itself in any coherent form is a representation of consciousness.\n\nother than that, i suggest a transparent overlay of every style of “0” (zero) ever designed.\n\n"
    },
    {
      "time": " 4.Mar.2008 10.31am",
      "content": " ![](http://web.archive.org/web/20081015172426im_/http:/www.typophile.com/files/Typographical_consciousnesS_6263.jpg)\n\n"
    },
    {
      "time": " 4.Mar.2008 10.44am",
      "content": "!\n\n"
    },
    {
      "time": " 4.Mar.2008 12.41pm",
      "content": "Ernst Pöppel has investigated the idea of the “temporal platform” of consciousness as having a two to three second duration. (_Mindworks—Time and Conscious Experience_)\n\nHe has compared this with the length of phrases in speech, and lines of verse.\n\nI would take it a step further, and argue that there is a “three-second” quality to the typographic page.\n\n"
    },
    {
      "time": " 6.Mar.2008 5.45am",
      "content": "thanks guys.\n\nI have been asked to represent consciousness typographically, as a series of different experimental works. I could really do with some more ideas!!!\n\n“other than that, i suggest a transparent overlay of every style of “0” (zero) ever designed.” Why zeros?\n\nthanks\n\n"
    },
    {
      "time": " 6.Mar.2008 6.54am",
      "content": "why zeros ?\n\nbecause consciousness seems to depend on material (brain matter) but is itself non-material. it is “empty” in the buddhist sense of the word, without location, without permanent form.\n\nbecause the zero as a symbol for “no-thing” had to be invented (by consciousness).\n\nand the various forms of zero (or any character) overlaid transparently will display both the unique qualities of each and the similarity of all.\n\nalso: i think the use of lowercase “i” in so many products now is a related reference to consciousness in the sense that it triggers the identification of self, the self-conscious “me”.\n\niBook, iPhone, iPod, iLife, etc. perhaps you could play with that.  \niThink ther4 iAm.\n\n[http://en.wikipedia.org/wiki/Shunyata](http://web.archive.org/web/20081015172426/http:/en.wikipedia.org/wiki/Shunyata \"http://en.wikipedia.org/wiki/Shunyata\")\n\n"
    },
    {
      "time": " 6.Mar.2008 11.23am",
      "content": "_I could really do with some more ideas!!!_\n\nWhat interpretations did you come up with for the “three second platform”?\n\n"
    },
    {
      "time": " 6.Mar.2008 11.46am",
      "content": "Consciousness — as William Hoffer, bookseller, liked to say — is a prerequisite, not an achievement. Legibility is a prerequisite of reading.\n\nThe best way to represent consciousness in type is to make type readable.\n\n"
    },
    {
      "time": " 6.Mar.2008 12.02pm",
      "content": "_I have been asked to represent consciousness typographically..._\n\nThat sounds like a typically moronic design school project. Typography is a tool for making language visible and recording linguistically structured ideas in a visible form. Typography represents language, not abstract concepts. It can be made, within the conventions established and exploited by advertising, to express a fairly crude set of qualities or emotional responses (excitement, fun, elegance, etc.), but this is only successful insofar as the thing advertised actually possesses such qualities to some degree (intentional irony excepted, in which case the success depends upon the contrast between the quality evoked and the thing itself). Even in such situations, typography remains primarily linked to language, to the ability to say something meaningful in language, and not to pure form. So in order to say something about consciousness typographically, you first have to say something about consciousness.\n\n"
    },
    {
      "time": " 6.Mar.2008 2.42pm",
      "content": "Consciousness may be easier to describe by talking about what it isn’t:\n\n<cite>Z Z Z Z Z Z Z Z Z Z Z Z </cite>\n\nThat would be the opposite of consciousness.\n\nHope that helps |¬)\n\n-=®=-\n\n"
    },
    {
      "time": " 11.Mar.2008 6.31am",
      "content": "What interpretations did you come up with for the “three second platform”?\n\nI thought of displaying different quotes on consciousness in a room for 3 seconds, then the spotlight would light up the next quote etc....\n\nalso thought of arranging the quotes in a tryptych format to summarise this triangular unison of information.\n\nOther than than i cant really think of anything...\n\nI really like the idea of expressing nothingness... i understand now why the zero, it symbolises nothingness which is the essence of an em pty consciousness.\n\nAre there any other ways of representing nothingness??\n\n"
    },
    {
      "time": " 11.Mar.2008 8.17am",
      "content": "_I thought of displaying different quotes on consciousness in a room for 3 seconds, then the spotlight would light up the next quote etc...._\n\nThat’s an idea I’ve started to explore, where instead of conscious attention actively moving along static text (absorbing it in 3-second increments), units of text are presented sequentially in the same place, in 3-second intervals. You can see it in the Softmachine video at [http://typography.tv/](http://web.archive.org/web/20081015172426/http:/typography.tv/ \"http://typography.tv/\") (the link is the icon that’s an “S”). It’s more like 2-seconds per word/phrase, though.\n\n"
    },
    {
      "time": " 11.Mar.2008 9.47am",
      "content": "<cite>I would take it a step further, and argue that there is a “three-second” quality to the typographic page.</cite>\n\nThree is a magic number.\n\nThree plus two is five—Pentameter.\n\nIn a way, no-mind might be absence of imposed order. With consciousness comes imposed/perceived order.\n\n"
    },
    {
      "time": " 11.Mar.2008 11.17am",
      "content": "Typography maybe doesn’t represent ’consciousness’ in itself, but good typography helps clear the path so that someone may get to a higher consciousness\n\n"
    },
    {
      "time": " 11.Mar.2008 11.18am",
      "content": "btw I don’t understand half of the words in this thread D:\n\n"
    },
    {
      "time": " 12.Mar.2008 2.28am",
      "content": "<cite>That sounds like a typically moronic design school project.</cite>\n\nI sort of disagree with this, although it did make me laugh. I think it’s a really bad project for undergraduate students studying typography. I’ve seen a lot of Type 101 projects that are all about type as an expressive form, and yet these students come out knowing nothing about how to lay out a book or magazine. I think the idea of representing consciousness typographically is interesting, though, if the students know the rules and traditions of typography.\n\nI’d be more interested in how you could make this project about the act of reading, or the act of creating letterforms.\n\n"
    },
    {
      "time": " 17.Mar.2008 9.13pm",
      "content": "i agree its probably a moronic school project... although i cant blame the teachers, because i chose the subject..\n\nThe problem is with my course at uni, is that its a self initiated course, and you have to come up with ur own briefs.. which means you have to think of what is relevant to you and what you are interested in, then articulate the idea through design.\n\nIm am interested in posthumanism, consciousness, the meaning of life etc, so tried to introduce this to my work...\n\nCan anyone poerhaps think of any better ideas other then consciousness, or any other paths i should take?\n\ncheers guys\n\n"
    },
    {
      "time": " 18.Mar.2008 9.48am",
      "content": "Consciousness is so hard to define, and has a slippery historical aspect. Maybe you could go all Deleuze and Guattari on Geofroy Tory.\n\n"
    },
    {
      "time": " 18.Mar.2008 9.57am",
      "content": "_Can anyone poerhaps think of any better ideas other then consciousness, or any other paths i should take?_\n\nI’d suggest you stand up for love. Say it strong, loud and proud. Don’t sugar coat it, just let it rip. I’m not talking about the sentimental smoochy kind of love, I’m talking about the kind where life/death is on the line. Talk about that... and say it without boarders, malice, and sarcasm etcetera. Keep it raw. As a reference point you might want to check out the work of graphic designers like Sister Corita (even though she had a paritcular slant to her work).\n\nOther than that, talk about Life. The vibrancy of Life, how unstoppable it is, how vital it is. There’s lots of other stuffs too like, the Groove...\n\n"
    }
  ]
}
