{
  "id": "42799",
  "title": "Great Type Resources?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello everyone,\n\nI’m a new typophile member (2 minutes and 24 seconds according to my account info,) student of graphic design, and discoverer of a previously unknown love... typography. I’ve spent the past week trying to find a good internet resource for typography, more specifically for a list or library of typefaces and their designers. My aim is to become familiar with the classics, and then the designers of my favorite typefaces. Any post with a link, a book suggestion, or a typographer that you know and a listing of fonts they created would be great!\n\nThanks in advance for your help.\n\nNewly discovered typophile,  \nMichael\n\n [‹ Does anyone have wrinkles?](http://web.archive.org/web/20080704191857/http:/www.typophile.com/node/42699 \"Go to previous forum topic\") [letterpress ›](http://web.archive.org/web/20080704191857/http:/www.typophile.com/node/42967 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080704191857/http://www.typophile.com/user/27893\" title=\"View user profile.\">InsatiableCuriosity</a>",
  "time": "<br>",
  "uid": "27893",
  "comments": [
    {
      "time": " 4.Mar.2008 9.49am",
      "content": "Try your school library. It’s amazing what you can find in books.\n\n"
    },
    {
      "time": " 4.Mar.2008 10.17am",
      "content": "I think you have already found a good resource, if not the best on the web — Typophile. Take a look at the [TypoWiki.](http://web.archive.org/web/20080704191857/http:/typophile.com/typowiki) It contains a lot of useful information in regards to designers and their work, book and online resources, etc…\n\n"
    },
    {
      "time": " 4.Mar.2008 10.24am",
      "content": "Welcome Michael.\n\nWell, first off I’d like to recommend Typophile’s very own, ever expanding Typowiki as a resource: [http://typophile.com/typowiki](http://web.archive.org/web/20080704191857/http:/typophile.com/typowiki \"http://typophile.com/typowiki\") It’s chocked full of useful information on everything type related and maintained by the very blood that fuels this forum, our avid Typhophiles.\n\nJames comes off a bit gruff, but he’s right. If you have access to a library (hard to imagine, but possible) take advantage of it. There are many a resources on type there. Also consult your local book emporiums. There are many books on the history of typography, including font selections from the past up to the most contemporary.\n\nFinally, check out these online resources and foundries: [www.Fontshop.com](http://web.archive.org/web/20080704191857/http:/www.fontshop.com/ \"www.Fontshop.com\"), [www.Myfonts.com](http://web.archive.org/web/20080704191857/http:/www.myfonts.com/ \"www.Myfonts.com\"), [www.Adobe.com/type](http://web.archive.org/web/20080704191857/http:/www.adobe.com/type \"www.Adobe.com/type\"), [www.Veer.com](http://web.archive.org/web/20080704191857/http:/www.veer.com/ \"www.Veer.com\") and [www.identifont.com](http://web.archive.org/web/20080704191857/http:/www.identifont.com/ \"www.identifont.com\")\n\nKeep contributing to Typophile.\n\n"
    },
    {
      "time": " 4.Mar.2008 2.50pm",
      "content": "[Luc Devroye’s pages](http://web.archive.org/web/20080704191857/http:/cg.scs.carleton.ca/~luc/fonts.html) are a wealth of tidbits of info. Many many links to otherwise hard-to-find sites, type designers and resources.\n\n"
    },
    {
      "time": " 4.Mar.2008 11.12pm",
      "content": "\\>\\>Try your school library. It’s amazing what you can find in books.\n\nIt’s amazing how many design books just... disappear... from libraries. Most the the libs here in Seattle SUCK when it comes to decent design books, let alone anything remotely related to type.\n\nEven our brand-new mega-bucks Central Library has a crap selection. Interlibrary loan has a crap selection.\n\nYour best bet is to go down to Half-Priced Books, a used book store near a University, online, then Barnes & Nobles/Borders/Amazon. In that order.\n\n"
    },
    {
      "time": " 5.Mar.2008 11.38am",
      "content": "<cite>It’s amazing how many design books just... disappear... from libraries.</cite>\n\nI forget that same schools have that problem; at this school the punishments for not returning books on time are not kind.\n\nBut on the subject of online goodies, the TDC has a great list: [http://www.tdc.org/views/typelinks.html](http://web.archive.org/web/20080704191857/http:/www.tdc.org/views/typelinks.html \"http://www.tdc.org/views/typelinks.html\")\n\n"
    },
    {
      "time": " 8.Mar.2008 3.27pm",
      "content": "Great! I really appreciate everyone’s feedback.  \nMy school’s library is quite small, and DEFINITELY plagued with book disappearance, but I found a few books that had a start to what I’m looking for. The websites that you’ve all offered have also been phenomenal so extra special thanks for those.  \nLook forward to nerding it up with you guys soon!\n\nMichael\n\n"
    },
    {
      "time": " 8.Mar.2008 5.34pm",
      "content": "The typefont section at adobe.com gives you the history of nearly every typeface sold there.  \nAn incredible lion’s share of type fonts, especially from cool small boutique foundries from around the world, can all be sampled at myfonts.com.  \nStorm Foundry in Prague is especially literate about type history and has contributed some stupendous historical revivals and re-thinking of old faces.  \nBest young type designers: DSType and Joshua Darden.  \nThe biggest single Renaissance in type design now is from Hispanic countries: Spain, Portugal especially, and all over South America. Most of them are carried on myfonts.com in the foundries index. Or just sample all the myfonts.com fonts under each type category, like “Garalde” or “Traditional,” and see the range of what is happening now. Create your own custom sample line for global display: when I’m there, I use the phrase “23569MetOpera” because right off it shows me oldstyle figure fonts and the cap M plus lower case e, r, and a, always important indicies of creativity.\n\n"
    },
    {
      "time": " 9.Mar.2008 6.53am",
      "content": "“Luc Devroye’s pages are a wealth of tidbits of info. Many many links to otherwise hard-to-find sites, type designers and resources.”\n\nThis was a good one...\n\nAnd if you are interested in classic fonts (lead fonts), visit my font collection, please:  \n [http://www.bleisetzer.de/cms/front\\_content.php?idcat=41](http://web.archive.org/web/20080704191857/http:/www.bleisetzer.de/cms/front_content.php?idcat=41 \"http://www.bleisetzer.de/cms/front\\_content.php?idcat=41\")\n\nI am typing this comment with \\_very\\_ dirty fingers, ’cause yesterday I printed again approx. 30 new old character sets...\n\nEvery example is classyfied like this below:\n\nGruppe VII - Antiqua-Varianten - Tauperle  \nSchelter & Giesecke, Leipzig  \nErstguß 1922  \nAlbert Auspurg\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n ![](http://web.archive.org/web/20080704191857im_/http:/www.typophile.com/files/1_4551.jpg)\n\n"
    },
    {
      "time": " 9.Mar.2008 7.04am",
      "content": "First of all, some of us distinguish between “typography” and “type design.”\n\nThe best book I know of on typography is <cite>Art of the Printed Book</cite> published by the Pierpont Morgan Library & David R. Godine. This is not a “how to” book; you will find no rules or easy formulas. And perhaps it is not a beginners book, you need an good eye to see through the fashion and technology of the various times to the typographic principles demonstrated. But if you continue with an interest in typography — rather than an interest only in the current fashions — I think you will find it valuable.\n\n"
    },
    {
      "time": " 9.Mar.2008 7.11am",
      "content": "(kontrapunkt, you need to close that tag! It doesn’t seem to work when later posters try to do it.)\n\nSome very good links in here for the new among us. Thank you all.\n\n"
    },
    {
      "time": " 9.Mar.2008 3.35pm",
      "content": "[TypeBase](http://web.archive.org/web/20080704191857/http:/www.typebase.com/) _…contains 553 links to fine quality typographic websites around the world…_\n\n(ups! Oisín, you’re right, sorry ;-))\n\n"
    }
  ]
}
