{
  "id": "42804",
  "title": "Ultrathin geometric sans-serif font similar to ITC Avant Garde Extra Light",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "This typeface was used for a letterhead by a local (Massachusetts) printer in the early 1970's. It was said to have been similar to a typeface seen in Avant Garde magazine. The printer is still in business but the current personnel do not know the source. I suspect it is a phototype typeface that has not been digitized. I have not been able to search PLINC catalogs yet and have not found it on the various online sources or in the few standard references that I have been able to check. What is very distinctive about this typeface beyond the delicate, condensed spacing is the narrow uppercase \"A\" with relatively high crossbar, the narrow, straight lowercase \"t\", the absence of a spur on the lowercase \"u\" and how the circular parts of the lower case \"p\". \"a\" and \"d\" just barely touch the vertical parts of these letters. We have an additional sample of this typeface with a few more letters not shown in the image given here. If anyone has a name or source for this typeface, we would be much obliged. Otherwise we will attempt to recreate a digital version with some font software that we have.  \n Thanks much,  \n Ray\n\n ![](http://web.archive.org/web/20150220005705im_/http:/typophile.com/files/MysteryFont_4292.jpg)\n\n",
  "author": "ray-a",
  "time": "4 Mar 2008 — 10:44am",
  "uid": "27894",
  "comments": [
    {
      "time": "4 Mar 2008 — 12:19pm",
      "content": "It has more of a look of Futura than Avant Garde to me but I can't find a Futura that is that thin. The A doesn't match Futura either.\n\nThe tight spacing probably has nothing to do with the font, more the tracking.\n\n"
    },
    {
      "time": "4 Mar 2008 — 12:41pm",
      "content": "It's L&C Hairline. (L&C = Lubalin & Carnase.) I don't know if there is a digital version.\n\n"
    },
    {
      "time": "4 Mar 2008 — 12:54pm",
      "content": "About the digitizations read [this thread](http://web.archive.org/web/20150220005705/http:/www.myfonts.com/WhatTheFont/forum/viewthread.php?threadid=103823).\n\n"
    },
    {
      "time": "4 Mar 2008 — 12:58pm",
      "content": "In Futura the uppercase \"A\" is wider, the circular part of the lowercase \"a\", \"d\" and \"p\" has much greater contact with the vertical stroke than in this typeface, and the dot of the lowercase \"i\" is higher than the top of the lower case \"t\". There are lots of similar typefaces out there that seem to be variations of this simple, geometric construction, of which this seems to be one of the purest and to me most elegant. The recent Stylor JNL and the common Century Gothic are two that share many traits. You are correct that the spacing between letters is probably just an artifact of the typesetting. In my sample the lowercase \"p\" and \"e\" are actually touching in the letterhead.  \n Ray\n\n"
    },
    {
      "time": "4 Mar 2008 — 1:03pm",
      "content": "I believe you are correct. I had been suspecting that Lubalin and Carnase were responsible for this typeface. Thanks so much!!  \n Ray\n\n"
    }
  ]
}
