{
  "id": "42805",
  "title": "LOXORIA - The new luxurious website / What type?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi guys,\n\nwe are about to create a new identity for a new luxury website named  \n“LOXORIA”. Right now we are in the search for an adequate font for  \nour logo to represent the luxurious philosophy.\n\nHow do you think about [Optima](http://web.archive.org/web/20080709012509/http:/www.fontshop.com/fonts/singles/linotype/optima_demi_bold/?sample_text=LOXORIA),  \n [Perpetua Titling](http://web.archive.org/web/20080709012509/http:/www.fontshop.com/fonts/singles/monotype/perpetua_titling/?sample_text=LOXORIA), [Meta Serif](http://web.archive.org/web/20080709012509/http:/www.fontshop.com/fonts/singles/fontfont/ff_meta_serif_book/?sample_text=LOXORIA) or [FF Utility](http://web.archive.org/web/20080709012509/http:/www.fontshop.com/fonts/singles/fontfont/ff_utility_ot_regular/?sample_text=LOXORIA)?\n\nOther suggestions?\n\nThe content and concept of the site can be compared with  \n [Robb Report](http://web.archive.org/web/20080709012509/http:/www.robbreport.com/)\n\nThanks for you help. Best regards, Franz\n\n [‹ Entry Level Design Positions Without A Design Degree?](http://web.archive.org/web/20080709012509/http:/www.typophile.com/node/42888 \"Go to previous forum topic\") [Numbering pages indesign help ›](http://web.archive.org/web/20080709012509/http:/www.typophile.com/node/42920 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080709012509/http://www.typophile.com/user/21442\" title=\"View user profile.\">flabrea</a>",
  "time": "<br>",
  "uid": "21442",
  "comments": [
    {
      "time": " 4.Mar.2008 12.13pm",
      "content": "what is a luxury portal and where can i get one ?  \nthese doors i’ve been using are starting to get old.\n\n"
    },
    {
      "time": " 4.Mar.2008 12.22pm",
      "content": "Check [Robb Report](http://web.archive.org/web/20080709012509/http:/www.robbreport.com/)\n\n"
    },
    {
      "time": " 4.Mar.2008 12.31pm",
      "content": "House Industries Luxury Collection:\n\n[http://www.houseind.com/index.php?page=showfont&id=536&subpage=viewfonts](http://web.archive.org/web/20080709012509/http:/www.houseind.com/index.php?page=showfont&id=536&subpage=viewfonts \"http://www.houseind.com/index.php?page=showfont&id=536&subpage=viewfonts\")\n\n"
    },
    {
      "time": " 4.Mar.2008 12.39pm",
      "content": "I like those fonts from HouseInd. Unfortunately they are too expensive. Not the US$ 249 for the font kit, but the licensing fee that has to be paid for using their fonts for a logo. It is about US$ 2,500 to 3,000 dollars. Even though luxury is our main topic we do not have that money. I do like the LUXURY PLATINUM!\n\n"
    },
    {
      "time": " 4.Mar.2008 1.22pm",
      "content": "so websites are called portals now ?  \nif i open one in a new window is that a portal in a window or a window to a portal ?\n\nand... the newest luxury portal can’t afford an expensive font collection ?  \nthey should demand it !\n\nmonacled winking emoticon.\n\nseriously, those house fonts are quite nice and not (yet) overused.  \nyour client should appreciate price point and relative exclusivity.  \nbetter yet, they could pay for a custom font.\n\n"
    },
    {
      "time": " 4.Mar.2008 2.14pm",
      "content": "<cite>I like those fonts from HouseInd. Unfortunately they are too expensive. Not the US$ 249 for the font kit, but the licensing fee that has to be paid for using their fonts for a logo. It is about US$ 2,500 to 3,000 dollars.</cite>\n\nOops — used Luxury for the secondary stuff on my girlfriend’s stationery. Mind you: printrun 500. Am I toasted now, or covered?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 4.Mar.2008 2.15pm",
      "content": "“There is no additional charge for companies under $5 million (US Dollars) in annual gross revenue. If the logo has a specific application for a business within another company, then use the estimated gross revenue for that venture. For example a logo for a major motion picture would be priced on the movie gross, not the studio gross.  \n$5 million to $10 million: $5000  \n$10 million to $50 million: $10,000  \n$50 million and over: $15,000”\n\n"
    },
    {
      "time": " 4.Mar.2008 2.21pm",
      "content": "I’d say the most expensive typeface you can buy would sum up ’luxury’ regardless of what it actually looks like.\n\nMaybe have a custom typeface design commissioned, cast it in gold, letterpress print it, then use THAT as the logo.\n\n“but the licensing fee that has to be paid for using their fonts for a logo. It is about US$ 2,500 to 3,000 dollars.”\n\nHmm...that’s unusual, isn’t it?\n\nThat said, I went and dug out the info on their site:\n\n[http://www.houseind.com/index.php?page=licensing&section=pricing](http://web.archive.org/web/20080709012509/http:/www.houseind.com/index.php?page=licensing&section=pricing \"http://www.houseind.com/index.php?page=licensing&section=pricing\")\n\nIt appears that your company has to bring in at least 5 million annually before you have to pay a license for use in a logo, starting at 5k.\n\nI do find that a bit of an odd contingency.\n\n"
    },
    {
      "time": " 4.Mar.2008 3.01pm",
      "content": "I just read the “Logo Usage and Product for Sale” at the [House Industries](http://web.archive.org/web/20080709012509/http:/www.houseind.com/index.php?page=licensing&section=pricing) Website. This seems to be new policy. I recently asked for a price using a font for logo design and they wanted to have about US$ 3,000 for worldwide usage.\n\nAre there any other suggestions than the House Industries LUXURY Collection?\n\n"
    },
    {
      "time": " 4.Mar.2008 3.05pm",
      "content": "This is the [WIKIPEDIA](http://web.archive.org/web/20080709012509/http:/en.wikipedia.org/wiki/Web_portal) definition of an internet portal.\n\n"
    },
    {
      "time": " 4.Mar.2008 4.13pm",
      "content": "different license for usage in a logo ??? that’s totally bogus. is that normal ? is that legal ? goodbye to them.\n\nsorry flabrea, i was a bit cranky today. portal, info-motel, link-bank, web basket, clearing house, hub... all good.\n\n"
    },
    {
      "time": " 5.Mar.2008 6.01am",
      "content": "I think an added fee for the use of type in a logo is very reasonable. Think of the exposure and usage (for instance if I’d use a font that cost me 30 bucks for a logo that would appear on 30 million pieces op paper and would bring in tens of thousands in design fees…).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 5.Mar.2008 6.55am",
      "content": "flabrea:\n\nHave you considered hiring a typographer or graphic designer to give you a custom wordmark? That would be a luxurious solution, IMHO.\n\nbert...yea, the clause makes perfect sense for the type foundry...if they can sell it. It’s just rather atypical, IMHO. If I was a full time logo/brand designers, I doubt I’d have a few hundred faces on my machine with only a handful having that clause and then trying to remember which ones I need to go hunt down further licensing agreements with each time I use them.\n\n"
    },
    {
      "time": " 5.Mar.2008 8.43am",
      "content": "\\> Have you considered hiring a typographer or graphic designer to give you a custom wordmark?\n\nI would think that you could get a fairly good wordmark designed for $15000.\n\n"
    },
    {
      "time": " 5.Mar.2008 9.01am",
      "content": "Or much less, even. (Or more, of course...)\n\n"
    },
    {
      "time": " 5.Mar.2008 9.47am",
      "content": "to bert vanderveen: i think it’s price gouging.\n\nshould i pay more for the paint i use on the outside of my house than the paint for the inside, simply because more people will see it ? ridiculous.\n\nyes i can hear the howls of protest among some of the artists here, but if you’re going to offer a creative tool to the creative public, just set a fair price and let the games begin.\n\nthe vendor should have no dominion or jurisdiction over my use of their product unless they want to share in the responsibility for that usage development. it opens the door to an eventual labyrinth of restriction, prohibition, violation, and random fruitless enforcement. it essentially creates an antagonistic relationship between parties who should be allies.\n\ni may regret or rethink this post but my gut response is to delete all my house fonts and never consider them again. i’ll carefully read their EULA first, but on the surface i find this outrageous.\n\n[http://en.wikipedia.org/wiki/Price\\_discrimination](http://web.archive.org/web/20080709012509/http:/en.wikipedia.org/wiki/Price_discrimination \"http://en.wikipedia.org/wiki/Price\\_discrimination\")\n\n"
    },
    {
      "time": " 5.Mar.2008 9.55am",
      "content": ". . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 5.Mar.2008 9.55am",
      "content": "Point to make: You use a font in a logo. Client and other designers use that logo. Type has NOT been converted to outlines. Ergo: all users need to buy a license (or have a license).  \nThe other scenario: You convert font to outline, Rest is the same, except no one has to pay for using ’a’ font.Please explain the logic in this to me.\n\n@Ch. Your example is crooked, of course. Better example: painter paints nice image of cleanlooking girl. Soap manufacturer buys painting, puts image on soappackaging. Does he pay the artist? Sure, because he makes money of that image.  \n(BTW: Name of soap: Pear’s, name of artist: Millais. Circa 1890.)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 5.Mar.2008 10.22am",
      "content": "In what scenario would a logo be made from type and not converted to outlines? That isn’t a logo then. If you build a logo for someone, that would be delivered and shared as an outline graphic or other freestanding graphic image file. If the logo can simply be typed from a retail or otherwise easily available font, it’s not much of a logo.\n\nI agree that simply converting type to outlines hardly changes the balance of creative effort, but there is the little matter of the entire font file no longer being available to anyone else for use in other projects. Logos are often tweaked and customized anyway, type right out of the box rarely satisfies the needs of a finished logo.\n\nHow far down the path of restriction do you want to go? People don’t buy typefaces expecting to be constrained in the ways they can use them. Type is made to be used in a million different ways. Make logos, signs, books, magazines, wordmarks, bookplates, websites, etc. etc. You don’t pay per use, or else nobody would buy type at all (and we’re already too close to that).\n\nPeople too easily confuse access to font software with the application of type in print or other use. “Well then why aren’t they charging more for type used in newspapers since so many people read them?” The reason is that the fonts themselves aren’t distributed with the paper. Nothing here has changed in hundreds of years, you get typefaces so you can use them. You don’t get type software so you can distribute it.\n\n"
    },
    {
      "time": " 5.Mar.2008 10.51am",
      "content": "Really nice discussion here about licensing fees ,) but does anyone have an idea what font a luxury brand logo named “LOXORIA” can be BASED on? It is often just a customised version of a font that makes the logo special.\n\nSo any ideas?\n\n"
    },
    {
      "time": " 5.Mar.2008 11.54am",
      "content": "“Soap manufacturer buys painting, puts image on soappackaging. Does he pay the artist? Sure, because he makes money of that image.”\n\nNo, that’s the exact opposite of what you are trying to say. If I use a House font in a logo, it’s not house’s design, it’s mine.\n\nFlabrea:\n\nAlas, you need to give us more to go on if you want any other specifics. Really, the best advice is that if you need a logo, hire a logo designer.\n\nBarring that, start showing us some logos that you feel are ’luxurious’ and we can maybe start pointing you towards specific typefaces in the same realm. It’s often less about the typeface itself, and more about how it’s used.\n\n"
    },
    {
      "time": " 5.Mar.2008 12.06pm",
      "content": "“Really nice discussion here about licensing fees ,) but does anyone have an idea what font a luxury brand logo named “LOXORIA” can be BASED on? It is often just a customised version of a font that makes the logo special.”\n\nYou seem willing to consider nearly any style of font; square techy sans, Optima, Meta Serif (?!?!) and Utility. So far we have no clue what stylistic direction you want to go in. I applaud your openness of mind to various interpretations of luxury, but you really have the entire world of type to choose from, and you aren’t giving us much to go on.\n\nMy instinct is to choose something both new and under-exposed. Find a new serif font with elegant display versions and make a wordmark from one of those. Or a new, futuristic sans. Or.... But the direction I am going is one of exclusivity. Many of the comments here (my own included) have been rather glib, but in all seriousness, I think you should very strongly consider having a customized wordmark made by a lettering artist or expert typographer (by which I mean someone who can work with type outlines without mangling or otherwise ruining them). This work is not expensive to commission, if your enterprise is truly luxurious. Then, your wordmark or logo is completely exclusive, and the application of it and layout choices can only reinforce this feeling of exclusivity.\n\n"
    },
    {
      "time": " 5.Mar.2008 1.06pm",
      "content": "I would not only look for a typeface with the impression of luxury but, probably, also look for one which has some distinctive characters that could be used in the logo. To illustrate this, here’s a picture. Zapf Renaissance is used (not expensive: [www.myfonts.com/fonts/efscangraphic/zapf-renaissance-antiqua-sb/](http://web.archive.org/web/20080709012509/http:/www.myfonts.com/fonts/efscangraphic/zapf-renaissance-antiqua-sb/ \"www.myfonts.com/fonts/efscangraphic/zapf-renaissance-antiqua-sb/\"))—the typeface has definitely a bit of luxury in it and also a very distinctive x. Just a quick draft, of course, it’s not something I would consider a final design.\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/loxoria_5703.jpg)\n\n"
    },
    {
      "time": " 6.Mar.2008 12.44am",
      "content": "If you like Optima, but want a sharper and more modern attitude:\n\n[http://autodidakt.se/index.php?page=exemplar](http://web.archive.org/web/20080709012509/http:/autodidakt.se/index.php?page=exemplar \"http://autodidakt.se/index.php?page=exemplar\")  \nThe font is very near a release now.\n\n"
    },
    {
      "time": " 6.Mar.2008 7.30am",
      "content": "Very nice one Goran! Thank you!\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/capturedata1315377_5720.jpg)\n\nWhat do you think about this one:\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/Unbenannt-1_4325.jpg)\n\nIt’s [AVIANO](http://web.archive.org/web/20080709012509/http:/www.myfonts.com/fonts/dooleytype/aviano/) from [Insigne](http://web.archive.org/web/20080709012509/http:/www.insignedesign.com/)\n\n"
    },
    {
      "time": " 6.Mar.2008 7.44am",
      "content": "Flabrea,  \nI suggest [Bell](http://web.archive.org/web/20080709012509/http:/www.fonts.com/findfonts/_tryfont.htm?Pid=205451&ProductNo=012014OPN&ProductID=16541&SiteID=ODBS&SourceFoundry=Adobe&productname=Bell%C2%AE) from Monotype.  \nInteresting you suggest Optima right off the bat. How conscious was that choice? Was it a simple word association to, say, _opulence_ for example? Optima doesn’t necessarily always look dated—and good designers can control context to a degree—but it usually looks dated. And though it’s fine work, it’s not rare or scarce or precious—as luxury might suggest—quite the opposite.  \nMaybe the reason those participating in the conversation aren’t yielding up more suggestions is because they would be doing so blindly, as I am. What do you like? Who do you like? Will you be producing this mark yourself? If we have no idea, the best we can do is send you to someone who will spend time talking it over with you one on one. Until then, you might expect the discussion to wander on to greener, more interesting pastures.\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/lox_5109.gif)\n\n"
    },
    {
      "time": " 6.Mar.2008 8.00am",
      "content": "Optima because of Gorans “Exemplar” font. BELL is also a nice suggestion. Maybe your right: OPTIMA is not a very rare one.\n\nAnyway : i just made these designs : what do you think?\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/capturedata78_3506.jpg)\n\n"
    },
    {
      "time": " 6.Mar.2008 8.18am",
      "content": "Both designs look very pharmaceutical. Using all lowercase really isn’t appropriate for a “luxury” web site, when you’re trying to sell people on luxury you need caps to make it ostentations.\n\n"
    },
    {
      "time": " 6.Mar.2008 8.56am",
      "content": "I’m glad I’m not the only one getting a sense of a new sleep drug from these trial settings. Be careful not to amplify this effect; unfortunately with a new synthetic word like Loxoria, you run that risk. I think the Zapf Renaissance with drop shadow and trademark symbol is quite, as James says, pharmaceutical.\n\n"
    },
    {
      "time": " 6.Mar.2008 9.22am",
      "content": "Thanks for the open words. I think you are right. Any font suggestions?\n\n"
    },
    {
      "time": " 6.Mar.2008 10.33am",
      "content": "flabrea, to reiterate, help us out here: what direction do you want to go in? Futuristic? Old Money? Chanel? Mont Blanc? Country Club? Asian jet-setter? Give us a sense of what you like and what you don’t like. If you can point at (or post) examples, even better.\n\n"
    },
    {
      "time": " 6.Mar.2008 10.37am",
      "content": "Part of the problem is that Loxoria sounds like a medication.\n\nYou might also consider an Engravers font, either in the classic vein or a gothic. See here.\n\n[http://www.myfonts.com/search?search%5Btext%5D=engravers](http://web.archive.org/web/20080709012509/http:/www.myfonts.com/search?search%5Btext%5D=engravers \"http://www.myfonts.com/search?search%5Btext%5D=engravers\")\n\nI think the Prada wordmark is in this vein.\n\n"
    },
    {
      "time": " 6.Mar.2008 11.22am",
      "content": "Crossgrove,\n\nwe would like to be seen next to (from the design point of view) Chanel, PRADA, GUCCI, Louis Vuitton. Not Old Money, no Country Club. What do you think of [Ambroise](http://web.archive.org/web/20080709012509/http:/www.fontshop.com/fonts/downloads/porchez/ambroise/?sample_text=LOXORIA&sample_size=74)?\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/font_rend_5051.php.png)\n\n"
    },
    {
      "time": " 6.Mar.2008 11.23am",
      "content": "examples\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/DesignerLogos_5442.jpg)\n\n"
    },
    {
      "time": " 6.Mar.2008 11.28am",
      "content": "I tend to prefer the simple solutions:\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/lox_5854.jpg)\n\nGotham on top, Neutraface on bottom\n\n"
    },
    {
      "time": " 6.Mar.2008 11.31am",
      "content": "Keep in mind that those are luxurious brands not because of the typeface, but because of the brand as a whole.\n\nThe one similarity between them all is that they are, for the most part, simple wordmarks using a rather classic typeface form.\n\n"
    },
    {
      "time": " 6.Mar.2008 11.56am",
      "content": "Exactly: they have nearly nothing in common, except for the simplicity that Aluminum mentions. The cachet and associations they carry mean that you don’t have to say anything else. So layout and white space are at least as important as the logo itself. It’s whispering to be heard.\n\nPrada and Ferragamo are the only ones in that graphic not using standard typefaces. Times Roman for Guess! Clearly a special typeface is not going to bring a feeling of luxury. It’s almost like the reputation has to be built up beforehand, for the logo to convey any feeling of luxury. It could be the owner’s signature, or Bank Gothic, or Futura, or whatever. But the products have to emanate luxury.\n\n"
    },
    {
      "time": " 6.Mar.2008 12.05pm",
      "content": "“VERSACE” is a custom type?\n\n"
    },
    {
      "time": " 6.Mar.2008 12.32pm",
      "content": "It might have been adjusted, re-scanned and munged over time, but I think that’s just Peignot caps.\n\n"
    },
    {
      "time": " 6.Mar.2008 1.48pm",
      "content": "I really like those:\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/0338c520e96988a46639aaa8d054f23d_5317.png)\n\n[Terfens Bold](http://web.archive.org/web/20080709012509/http:/www.myfonts.com/fonts/dooleytype/terfens/)\n\nor\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/4cb24530ebe267dcd2bff1eabfc08a71_5564.png)\n\n[Sommet Bold](http://web.archive.org/web/20080709012509/http:/www.myfonts.com/fonts/dooleytype/sommet/) but i don’t like the “A” - This should be custom made based on a capital “U”.\n\n"
    },
    {
      "time": " 6.Mar.2008 2.33pm",
      "content": "If you want luxurious, perhaps you’d consider a lettered word mark. Or else, something that is different, without being too quirky. Your initial description made me think of a fifties or sixties style of narrow, elegant lettering. below are a few (very) quick samples of what I’m talking about.\n\n ![](http://web.archive.org/web/20080709012509im_/http:/www.typophile.com/files/loxoria_6691.jpg)\n\nThe top row are re-drawn Bodoni. (stretched with stroke weights corrected)  \nnext row, re-drawn Broadway (as above) and Agency FB  \nbottom, Chianti OSF with Chianti ItSwash BT. And (Yes, it’s... ) Ariel, to make everything else look good.\n\n"
    },
    {
      "time": " 6.Mar.2008 8.36pm",
      "content": "Dang Flabrea (do you have a real name?) you are getting a lot of free ideas - and executions - from the experts here. I hope you appreciate that!\n\n"
    },
    {
      "time": " 6.Mar.2008 11.17pm",
      "content": "Loxoria sounds like an unknown land from an old adventure movie to me, i don’t associate the “term” with luxury.\n\n"
    },
    {
      "time": " 6.Mar.2008 11.31pm",
      "content": "When Loxoria is set in lowercase it reminds me of a pharmacutical brand name- all caps is much better.\n\nMikey :-)\n\n"
    },
    {
      "time": " 7.Mar.2008 3.42am",
      "content": "poms, the content must transport the luxury not the name. versace or armani may also not sound very luxurious unless you know what’s behind\n\n"
    },
    {
      "time": " 7.Mar.2008 4.30am",
      "content": "Maybe, I’ll try Filosofia Grand from Emigre!  \nI’ll set the text in Small Caps!\n\nJ itsa JOTAOITENTA&CINCO\n\n"
    },
    {
      "time": " 7.Mar.2008 6.32am",
      "content": "the name itself can have some influence on perception. millions of branding dollars are spent on that idea. loxoria is a bit strange, especially being so close to luxoria, which rides closer to the target concept. it sounds pharmaceutical because so many drug names are hybrid polysyllables designed to ambiguously suggest positive associations : celebrex, ambien, acutrim, vivactil, etc.\n\na designer’s name, such as versace, has an obvious place in fashion branding.\n\nit’s interesting that so many fashion brands utilize such simple font-based logos. is it a deliberate strategy, or did they launch on a budget and feel no need to develop something further as the revenues grew, or did they actually launch with something more developed and revert as the brand grew in strength ? most likely the first of these options. let the product speak louder than the logo.\n\ni haven’t designed for that sort of client, but i remember admiring the simplicity of baron & baron’s logo work for calvin klein.\n\nthe recurring motif seems to be : simplicity.\n\n"
    },
    {
      "time": " 7.Mar.2008 8.00am",
      "content": "I think this simplicity and unsophistication is what was being lampooned in the original, exhorbitantly priced release of the Luxury font collection. The premise was that all luxury brands could be represented by the three single styles. Simple. Very little focus seems to be put on the wordmark for these luxury brands, and I think the products’ status may have to precede the familiarity and associations of the logo.\n\n"
    },
    {
      "time": " 7.Mar.2008 8.19am",
      "content": "Something that needs to be addressed is the audience. What kind of luxury customers are being targeted? Is this for wealthy young bankers in New York who want mid-century modern living? Educated children of western European landowners who like the latest designer goods from Switzerland? Nouveau rich Americans who think luxury looks like something Versailles threw up? Urban gangsters who just want overpriced cheap cigars and fake diamond jewelry? Luxury means different things different people, and addressing the customer’s concept will serve the design better than picking a font that looks expensive to a designer.\n\n"
    },
    {
      "time": " 7.Mar.2008 8.33am",
      "content": "James is right. Donald Trump’s idea of luxury is glitz and more glitz (Versace). Contrast that with the people who are spending gazillions of dollars to live in one of Richard Meier’s minimalist glass and steel boxes (Armani, Prada). Then you have the Park Avenue set who have overstuffed sofas, silk wallpaper, and armoires full of tchotchkes (Chanel, Polo).\n\n"
    }
  ]
}
