{
  "id": "4281",
  "title": "Perosnal Identity feels stuck",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi, this is my current personal Project feels kinnda stuck I could use some help please let me know what you think. I have thought about constructing the letters myself. It's supposed to read moh ![jpeg of Logo](http://web.archive.org/web/20131021031111im_/http:/www.typophile.com/forums/messages/29/33449.jpg)\n\n",
  "author": "moh",
  "time": "14 Apr 2004 — 12:29am",
  "uid": "3454",
  "comments": [
    {
      "time": "14 Apr 2004 — 3:21am",
      "content": "What's the 'o' for?\n\n"
    },
    {
      "time": "14 Apr 2004 — 3:50am",
      "content": "my second name olukayode\n\n"
    },
    {
      "time": "14 Apr 2004 — 3:54am",
      "content": "oops i keep getting an error so i sent it again   \n   \nsorry for the tripple posting\n\n"
    },
    {
      "time": "14 Apr 2004 — 6:43am",
      "content": "If you use a graphic image in a design it must mean something -- either immediately understood (in the millesecond you will get for recognition) or readily discovered, which is a pleasant experience for the viewer. The green roof doesn't explain itself and causes an awkward linkage between the m and h. I would advise substance over manipulation. You can't be faulted for explaining yourself in a clear, clean, and concise solution.\n\n"
    },
    {
      "time": "14 Apr 2004 — 8:23am",
      "content": "@Paul Thanks for your post the roof is supposed to close the o in moh i have noticed that the linkage between m and h seems a little akward, but like I said i got stuck. I would like to keep the o open a little an use the \"roof\" by itself. Do you think a different font maybe a bit bolder would help? Like I said I am also considering constructing a clear form of the 3 Letters (just a form same line thickness in vertical and horizontal lines) Do you think that would help. I hope the link between m and h won't be so awkward any more\n\n"
    },
    {
      "time": "14 Apr 2004 — 8:37am",
      "content": "I don't read the \"o\" at all. It needs to be connected somehow. Maybe add some needed weight to the \"h\" by continuing the upper right \"o\" curve (gray) to connect to the green \"roof\".   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "14 Apr 2004 — 10:05am",
      "content": "thanks am trying something new post coming soon.\n\n"
    },
    {
      "time": "14 Apr 2004 — 10:26am",
      "content": "Am i getting closer probably should put it away for a few days let me know what you think better or worse? self constructed the \"m-part\" might be a little wide   \n   \n ![2nd try](http://web.archive.org/web/20131021031111im_/http:/www.typophile.com/forums/messages/29/33486.jpg)\n\n"
    },
    {
      "time": "14 Apr 2004 — 11:58am",
      "content": "What if you made the 'o' a full letter, entirely in green?   \n   \nI think if you really want the O as part of the identity mark, then it needs to be immediately recognizable. Even if you went to something with block letters that defined the O as negative space, you'd still be directly conveying the letter as opposed to suggesting it with the caret/hat.\n\n"
    },
    {
      "time": "14 Apr 2004 — 1:22pm",
      "content": "I like Chase's suggestion, green or otherwise. Maybe use the O as a target, or something like the RAF insignia where the blue and red circles kiss-fit. Play with it and give it time to work through your subconscious. It must say grafiker IMHO.\n\n"
    },
    {
      "time": "14 Apr 2004 — 5:57pm",
      "content": "I read this as \"muh\" all the time.   \n   \nIf the green roof is \"o\", then it should overshoot the x-height just like \"m\" and \"h\" in the first post, and overshoot the baseline like in the last example. Will this help in making clear that this is an \"o\"?\n\n"
    },
    {
      "time": "16 Apr 2004 — 7:47am",
      "content": "just ide \"conecta\" m and H to creath negative space which implays O   \n   \njust idea   \n ![:-)](http://web.archive.org/web/20131021031111im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "19 Apr 2004 — 10:52am",
      "content": "New Version Pleas give an update!   \n   \nVersion 3 in Avantgard   \n   \n ![](http://web.archive.org/web/20131021031111im_/http:/www.typophile.com/forums/messages/29/33799.jpg)   \n   \nVersion 4 in Bauhaus (forget the little line on the \"h\")   \n   \n ![](http://web.archive.org/web/20131021031111im_/http:/www.typophile.com/forums/messages/29/33800.jpg)\n\n"
    },
    {
      "time": "19 Apr 2004 — 1:33pm",
      "content": "I read \"moh\" now.\n\n"
    },
    {
      "time": "19 Apr 2004 — 2:34pm",
      "content": "I wonder what it would look like if all the shoulder strokes were consistant.\n\n"
    },
    {
      "time": "19 Apr 2004 — 2:39pm",
      "content": "If the shoulders were consistant than the green portion of the o might want to drop below the baseline.\n\n"
    },
    {
      "time": "19 Apr 2004 — 8:35pm",
      "content": "Marvin, I like the revision that more clearly defines the O. The green 'bowl' section is visually a bit high. Knock it down a touch.\n\n"
    },
    {
      "time": "20 Apr 2004 — 9:40am",
      "content": "thanks a lot for all your comments probably needs a whole lot of more work still\n\n"
    },
    {
      "time": "21 Apr 2004 — 8:50am",
      "content": "New and modified idea what du u read now? still okay?   \n ![5](http://web.archive.org/web/20131021031111im_/http:/www.typophile.com/forums/messages/29/33973.jpg)   \n5   \n   \nor 6?   \n   \n   \n ![6](http://web.archive.org/web/20131021031111im_/http:/www.typophile.com/forums/messages/29/33974.jpg)\n\n"
    },
    {
      "time": "22 Apr 2004 — 6:01pm",
      "content": "I like #5 better out of the two serif designs, but I think you might want to leave in the \"feet\" on the M and H to avoid people reading an rr ligature. Overall, it's a good design, with a nice balance of positive and negative space; I think #6 isn't 'solid' enough.   \nI daresay I like 5 better than 4, but that might be because it reminds me of [this](http://web.archive.org/web/20131021031111/http:/www.2river.org/gallery/indiana/love.html).\n\n"
    }
  ]
}
