{
  "id": "42811",
  "title": "Typeface suggestions for a science magazine",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am looking for a sans serif typeface that suggests science, technology, and mathematics without seeming clichéd or trite. I am looking for something with enough character to be distinctive, but still appropriate for an academic publication.\n\nThis is for a redesign of a magazine for a college of physical and mathematical sciences. The institution and the magazine are fairly traditional and academic. Articles mostly deal with research conducted by students and faculty. The audience is primarily students and alumni in the college.\n\nThe typeface will be used for things like cover lines, pull quotes, headlines, subheads, etc. It will range in size from about 10 to 18 points, and will be paired with something like minion or caslon for body copy. It would be nice to have a decent range of weights.\n\nMy first choice now is DIN, but it seems a bit overused and obvious. Any suggestions will be very appreciated. Thanks.\n\n [‹ [small caps usage.]](http://web.archive.org/web/20080706221810/http:/www.typophile.com/node/43061 \"Go to previous forum topic\") [Trouble with matching black ›](http://web.archive.org/web/20080706221810/http:/www.typophile.com/node/43007 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706221810/http://www.typophile.com/user/27902\" title=\"View user profile.\">cumaso</a>",
  "time": "<br>",
  "uid": "27902",
  "comments": [
    {
      "time": " 4.Mar.2008 1.09pm",
      "content": "Interesting... I just used DIN in an Einstein-related project and found it worked quite well.\n\n"
    },
    {
      "time": " 4.Mar.2008 4.50pm",
      "content": "How about Stratum or Klavika?\n\n"
    },
    {
      "time": " 4.Mar.2008 6.12pm",
      "content": "Sans:  \nEdgy but not too: Interstate, Meta.  \nEmigre Cholla interesting but lacks enough weights for you.  \nStylish but not calling attention to itself: Linotype Syntax (available with OSFs)  \nStraight vanilla workhorse well matched to serifs like Caslon: ITC Franklin Gothic\n\nFor the serif, also take a look at Adobe OpenType Warnock, very very crisp, stylish, and good for science.\n\nMy approach would be: Warnock and Linotype Syntax, a champ combo!\n\n"
    },
    {
      "time": " 4.Mar.2008 7.22pm",
      "content": "Pill Gothic could make a science publication look way cool.\n\n"
    },
    {
      "time": " 4.Mar.2008 9.02pm",
      "content": "Thanks for your suggestions. I am really liking Klavika, Stratum, and Pill Gothic, they each have nice little quirky details. Syntax is also nice, I may come back to that if I need a more conservative face. I considered Cholla, but it is a little too quirky for this project.\n\n"
    },
    {
      "time": " 4.Mar.2008 9.13pm",
      "content": "Links to some of the typefaces mentioned above:  \n [Stratum](http://web.archive.org/web/20080706221810/http:/www.processtypefoundry.com/typefaces/stratum1/index.html)  \n [Klavika](http://web.archive.org/web/20080706221810/http:/www.processtypefoundry.com/typefaces/klavika/index.html)  \n [Syntax text](http://web.archive.org/web/20080706221810/http:/www.linotype.com/54897/linotypesyntax-family.html)  \n [Pill Gothic](http://web.archive.org/web/20080706221810/http:/www.veer.com/products/typedetail.aspx?image=UMT0000043#specimen)  \n [Cholla](http://web.archive.org/web/20080706221810/http:/www.emigre.com/EF.php?fid=84)\n\n"
    },
    {
      "time": " 7.Mar.2008 5.18pm",
      "content": "There’s a list of legible sans in the thread of fonts for books. Try scanning that.\n\n"
    },
    {
      "time": " 7.Mar.2008 7.23pm",
      "content": "Although a very different approach, I always appreciated the clean feel of [The Sciences](http://web.archive.org/web/20080706221810/http:/www.nyas.org/publications/sciences.asp) among other things.\n\n"
    },
    {
      "time": " 11.Mar.2008 7.38am",
      "content": "Thanks for the link to The Sciences. That is another approach to the problem that I will definitely look at.\n\n"
    }
  ]
}
