{
  "id": "42824",
  "title": "Louisiana",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hi,\n\nWe have a new font that is being released called Louisiana. An Art Director that I do work for has the most beautiful handwriting I have ever seen. So I asked her if she would like to make a font together and this is what we came up with :)\n\nI had to modify and correct some of the forms to make it work as a font.\n\nWe are very pleased with the end result.\n\n-Charles Borges de Oliveira\n\nCBdO\n\n[www.borgeslettering.com](http://web.archive.org/web/20131015031537/http:/www.borgeslettering.com/ \"www.borgeslettering.com\")\n\n ![](http://web.archive.org/web/20131015031537im_/http:/typophile.com/files/Louisiana_4840.gif)\n\n",
  "author": "Charles_borges_...",
  "time": "4 Mar 2008 — 6:06pm",
  "uid": "1657",
  "comments": [
    {
      "time": "4 Mar 2008 — 7:17pm",
      "content": "Gorgeous!\n\nLuke.\n\n"
    },
    {
      "time": "5 Mar 2008 — 4:37pm",
      "content": "Charles, it's outstanding! Well done. -Jess\n\n"
    },
    {
      "time": "6 Mar 2008 — 2:32am",
      "content": "Lovely and flowing - you can just tell it's a feminine hand.\n\nYou could do replacement ligatures for duplicate characters together (sunny, Hawaii, Cookies) to make it look more realistic.\n\nNick Cooke\n\n"
    },
    {
      "time": "6 Mar 2008 — 6:30am",
      "content": "Thanks guys. Nice suggestion Nick. I had made a bunch of ligatures for this font but fontlab didnt like the new ligatures. Anytime I introduced new kerning to the font I would keep getting an error message when generating the font \"causes overflow of offset to a subtable (0x11a00\" It was frustrating so I had to bag the new ligatures and just keep the current ones. It is interesting to note that she is left handed which I believe may give to the slight italic slant.  \n-Charles\n\n"
    },
    {
      "time": "6 Mar 2008 — 7:39am",
      "content": "Fabulous work!\n\n"
    },
    {
      "time": "6 Mar 2008 — 11:45am",
      "content": "I like the tension between the forwards rounds and the backslant straights, nicely balanced.  \nSpecial!\n\n"
    },
    {
      "time": "8 Mar 2008 — 9:06am",
      "content": "Thanks James and Nick!\n\n"
    }
  ]
}
