{
  "id": "42835",
  "title": "stationery / letterheads books ?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Libraries are full of crappy letterheads+stationery books; but i miss to have ever seen a good one.\n\nI found only one to be somewhat usefull that is : Designer’s Sationery from Roger Walton.  \nIts not great but good.\n\nDo you have any great references ?\n\n [‹ InDesign cs3: 100k black outputs both black and gray on same pdf](http://web.archive.org/web/20080907154414/http:/www.typophile.com/node/45551 \"Go to previous forum topic\") [Request : Examples of FF Sanuk in use ›](http://web.archive.org/web/20080907154414/http:/www.typophile.com/node/45537 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907154414/http://www.typophile.com/user/12069\" title=\"View user profile.\">nlx</a>",
  "time": "<br>",
  "uid": "12069",
  "comments": [
    {
      "time": " 5.Mar.2008 6.25am",
      "content": "So theres nothing ? its what i was afraid off !!!\n\n"
    },
    {
      "time": " 5.Mar.2008 6.51am",
      "content": "Rockport has all sorts of books on that subject:\n\n[http://www.rockpub.com/](http://web.archive.org/web/20080907154414/http:/www.rockpub.com/ \"http://www.rockpub.com/\")\n\n"
    },
    {
      "time": " 5.Mar.2008 8.25am",
      "content": "As i said I know theres tons of books about letterheads and i think 99% are crap.\n\nSo what i’m searchin is references of good ones.\n\n"
    },
    {
      "time": " 5.Mar.2008 9.02am",
      "content": "define ’good’\n\n"
    },
    {
      "time": " 5.Mar.2008 10.33am",
      "content": "easy :\n\ngood = not evil\n\n"
    },
    {
      "time": " 5.Mar.2008 10.38am",
      "content": "seriously, i don’t think anyone can define ’good’ design\n\nbut i can show you what is evil :\n\n ![](http://web.archive.org/web/20080907154414im_/http:/www.typophile.com/files/Image6_4891.jpg)\n\n"
    },
    {
      "time": " 5.Mar.2008 10.51am",
      "content": "what’s evil about this? It’s stylized approach for a specific client, maybe?\n\n"
    },
    {
      "time": " 5.Mar.2008 11.51am",
      "content": "You really aren’t giving us anything to go on, nlx. We have no clue as to what you think makes that ’1% good’ so I don’t think we’ll by much help to you.\n\n"
    },
    {
      "time": " 5.Mar.2008 12.38pm",
      "content": "The goodest ever. And I double dog dare you to pull off anything as good as shown in this book. It’s just not done anymore and hasn’t been for decades.\n\n[http://www.flashfonts.com/flashsite/letterheads.html](http://web.archive.org/web/20080907154414/http:/www.flashfonts.com/flashsite/letterheads.html)\n\nIt’s out of print, but you can get one on Amazon for $3.28 plus shipping. Cabarga even claims that “violent skinhead types might enjoy the book too.” I’m not sure of that, but all things are possible.\n\n"
    },
    {
      "time": " 5.Mar.2008 1.33pm",
      "content": "FWIW I agree with you nix — I think the tanning factory letterhead is pretty awful. Terrible colours, very cluttered over the page.\n\n"
    },
    {
      "time": " 5.Mar.2008 1.35pm",
      "content": "\\*Accidental double post\\*\n\n"
    },
    {
      "time": " 5.Mar.2008 7.59pm",
      "content": "I picked up the latest edition of _The Big Book of Letterheads_, and it’s pretty clear that Carter put a lot of thought into what got in. It’s mostly drek-free, and it’s cool to see what people are doing with letterheads that never go out in an envelope and stationery systems without business cards.\n\n"
    },
    {
      "time": " 6.Mar.2008 12.52am",
      "content": "@aluminum\n\nI’m sure you can understand that ’defining good’ is an impossible task, in any field. Even philosophs can’t define good.\n\nBut in graphic design, there are books that are references. For exemple, Grid System is a design bible, like The Elements of Typographic Style or Counterpunch. Most of us can agree with this.\n\nSo i’m searching books that have the same universal quality and that can be a reference for stationary. I doubt there is one, but for sure some must be better than others. So all designers that are interested in letterheads etc. must have searched for this and can share there conclusions.\n\nMe as i said, i found nothing really helpfull but the Designer’s Sationery from Roger Walton. But really its not as timeless and wellmade as we can hope.\n\n+ Something i don’t like in letterheads books too, as, to me, it often look very american, and for me (european, and french) it really look exotic and unusable (the image i posted is a an exemple).\n\n-\n\nThanks for your references.  \n• I was wondering about the Carter one, i need to check it in a library.  \n• about LETTERHEADS: One Hundred Years of Great Design, 1850-1950. The cover look VERY american to me and well it seems something more historic-centred so it can be interesting in this perspective.\n\nI’m suprprise too that any book seems to be interested in elaboring rules and technical requests on this topic. (cause in this area it seems there are very important !)\n\n"
    },
    {
      "time": " 6.Mar.2008 1.01am",
      "content": " ![](http://web.archive.org/web/20080907154414im_/http:/www.typophile.com/files/9780066213903_6618.jpg)\n\nJust for reference. But i don’t think you can find it brand new.  \nI’m not sure i would recomend it either. Its just not as bad as…  \n+ its not about designing letterhead for big corps or anything, but still interesting (the layout is terrible btw)\n\n"
    },
    {
      "time": " 6.Mar.2008 1.07am",
      "content": "and what about Graphis Letterhead serie ? Never seen it ? i’m afraid it’s borring…\n\n"
    },
    {
      "time": " 6.Mar.2008 6.27am",
      "content": "“that can be a reference for stationary. I doubt there is one”\n\nHmm...I’d probably agree. I’m not sure there really is any tried and true rules of stationery. Whatever works, seems to work.\n\nIn many ways, stationery is going the way of annual reports...\n\n"
    },
    {
      "time": " 6.Mar.2008 2.11pm",
      "content": "Hi there,\n\nA definition of good design and printing could be relative to the time dedicated to craft a design and the print.\n\nOne thing I know, if your stationery is printed letterpress, patiently plated and printed, even a bad design can look good.\n\n-Andre\n\n"
    },
    {
      "time": " 9.Mar.2008 7.55am",
      "content": "Hi there, about a decade ago AIGA sponsored an exhibit on engraved letterhead and the accompanying catalog is the best I have ever seen.\n\nToday, my graphic design business is devoted to engraving which is even finer than letterpress for beautiful type. Buddy up with an engraving company (there are few anymore so find one now before they all go away.)\n\nFYI: In America, the trade term “engraving” refers to any intaglio printing process but most is actually etched, not engraved. You can go to my website for some looks and tips.\n\n[http://nancysharoncollinsstationer.com](http://web.archive.org/web/20080907154414/http:/nancysharoncollinsstationer.com/)\n\n"
    },
    {
      "time": " 9.Mar.2008 8.00am",
      "content": "Leave it to the engraver to one up everybody ;b\n\nSeriously, Nancy, that you’re willing and able to dedicate yourself to engraved stationery is fabulous. Especially in a world where so many people are picking their designs from the book of options at Kinko’s/Staples/Office Depot.\n\n"
    },
    {
      "time": " 9.Mar.2008 9.06am",
      "content": "James and anybody interested:\n\nPlease let me know if anyone is interested in knowing about engraving, it has been my area of interest since graduate school in the late 70s and is now my formal academic area of research. I teach graphic design, graphic design history and typography and use the historic model of engraving as the base for almost everything I teach. So, if anyone wants information of it (including monograms, cyphers and etc.,) just ask.\n\nJames: you are lucky, there are still a couple of engraving shops in the D.C. area. Next time I am there I will be giving a mid-day lecture on monograms and engraving at an architectural firm. I will post it on this blog site so you will know.\n\n"
    },
    {
      "time": " 15.Mar.2008 7.40pm",
      "content": "Hi Nancy,\n\nWow! I have been on your site and I love it! I bookmarked it.  \nThe fine details on illustrations... Metal plates are optimal for fine details and don’t get busted by pressure.  \nAs you know today’s letterpress goes mostly with photopolymer plates. In my case I realized that photopolymer is good, if the thinner details are not smaller then 0.3 of a point. When reproducing screens, the line screen amount is low, around 50 lpi.  \nI remember back in the seventies the shop I worked for used brass plates for long run jobs, and also for fine detail and screened jobs.  \nI believe that are people out there who recognizes printed art when they see it.  \nLucky You!\n\n"
    },
    {
      "time": " 20.May.2008 4.17pm",
      "content": "Quick question — I know this is a little off topic but, anyone see something in the “tanning” staytionery?\n\n"
    }
  ]
}
