{
  "id": "42833",
  "title": "Subject for a paper",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "Hello all,\n\nI'm new to this forum, but as all of you, I've been interested in typography for a long time. (maybe not as long as most of you, but I think of it as long)\n\nWhy am I reaching towards you for help?  \nWell, I've got to write a thesis to be able to graduate from my education (Communication & Multimedia Design, I'll get to that later on). I want to do a paper on a typography related subject, but so far the only thing I've come up with is this:\n\nCan typography change the reaction / emotion a viewer has?\n\nI'm not quite satisfied with it, so I would like to know if anyone has some idea's that could point me in a different direction, or could help me redefine my question, prefferably with some resource links.\n\n(I'm not asking you to write my paper for me, that's my job, but a hint or advice on a direction would help)\n\nSo what is Communication & Multimedia Design?  \nCommunication & Multimedia design is a study taught in the Netherlands (at least that is where I'm attending). It focusses on combining the new and old media whilst creating new and innovating ways of using them.  \n(the website of my education can be found here [http://www.cmd-breda.nl](http://web.archive.org/), but it's in Dutch. And please look through the not so well designed website.)\n\nThanks in advance,\n\nVincent Delahaije\n\nP.S. As most of you would've probably noticed; English isn't my primary language.\n\n",
  "author": "blaze.online",
  "time": "5 Mar 2008 — 12:45am",
  "uid": "27913",
  "comments": [
    {
      "time": "6 Mar 2008 — 11:25am",
      "content": "\"Can typography change the reaction / emotion a viewer has?\"\n\nHi Vincent. That probably needs to be a little more focussed. What is the approximate length of the paper? If it's not a sort of thesis then it's better to look at typography in a specific industry/application/historic context.\n\nA few stray ideas for whatever they may be worth.\n\n1. There are typefaces like Clarendon, Century and Gill Sans that are very reminiscent of the British empire. Institutions, businesses, publications etc of that period used a lot of those faces. The Netherlands too had overseas colonies. Maybe you can access examples of typography from that period to see if there was any consistent style. You could also examine if it would give any hints on how different nations looked at their overseas dominions (benign, domineering, mercantile etc). The VOC monogram of the Dutch East India company could be a starting point\n\n2. In a time when the Latin script is gaining ascendence the world over, it may be interesting to look at factors that can influence growth/decline of typography in vernacular scripts. Factors like technology, government intervention, chauvinistic politics, market pressures etc. You can do this by looking at examples from different countries.... Across the middle east, government regulations require the use of Arabic. In the early 90s the Indian goverment set up a project to design and propogate vernacular language fonts primarily to stem the outflow of foreign exchange to overseas foundries. You could look at examples from Israel, Thailand, China etc.\n\n3. You may also find it interesting to look at the evolution of typography in currency notes; both in your country and elsewhere. It might reflect the changes in how governments have wanted to be percieved over the years: from distant and majestic to today's friendly and inclusive. After all curreny notes carry the most ubiquitous form of typography and everyone would be familiar with those letters.\n\nHope some of this may be useful, or at least would spark off useful ideas.\n\n"
    },
    {
      "time": "7 Mar 2008 — 12:08am",
      "content": "First off; to answer your question, writingdesigning, my thesis (It's a small one but still) is supposed to be around 5000-8000 words. It isn't much, I know, but we've only been granted 10 weeks to write it.\n\nI think your stray idea's are quite interesting. Especially the one about the VOC and the 17th century forms of (handwritten) communication. I'll have to go and look into that one.  \nBut I also like the one about typographic elements in currencies.\n\nMy problem with picking a subject is, in my opinion, likely caused by the (way too large) number of interests I have. I find too many things too interesting, so I'm always looking in the wrong (or to much) direction(-s) to pick a good subject. Thanks for your directions!\n\n"
    },
    {
      "time": "9 Mar 2008 — 1:07pm",
      "content": "\"My problem with picking a subject is, in my opinion, likely caused by the (way too large) number of interests I have...\"\n\nI know just what you mean :) But far from being a problem, I think that's crucial asset for a designer. You just need to structure your work into two broad stages: the first where you allow a lot of play for exploring diverse ideas and the second where you focus on just the best of those ideas and take them forward.\n\nGood luck anyway!\n\n-  \nArun  \n-\n\n"
    },
    {
      "time": "9 Mar 2008 — 1:20pm",
      "content": "Maybe a more interesting question would be \"Can a typeface illicit zero emotional reaction in the viewer?\"\n\nI think it's pretty obvious there are a lot of typefaces that have a clear emotional message -- fancy scripts convey elegance and romance, bold sans serifs convey a no-nonsense bluntness -- but are there typefaces that say absolutely nothing, and allow for a completely transparent text, where the only thing that matters is the words of the writer? If you've seen \"Helvetica\" (the movie), you know this was a major goal of modernist thinking in typefaces. To me, there's a much bigger question surrounding the notion of a \"neutral\" typeface being possible.\n\n"
    },
    {
      "time": "9 Mar 2008 — 11:55pm",
      "content": "FeeltheKern, that's something I haven't thought about, (I'm a bit ashamed); flipping the question in the other direction, making it the opposite. I'll look into that. And yes I've seen helvetica the movie, but I'm gonna watch it again, since my memory of it is a bit blurry.\n\nThanks!\n\n"
    },
    {
      "time": "10 Mar 2008 — 3:57pm",
      "content": "Since you're from the Netherlands, maybe the idea of expressive type is more interesting, since Dutch type in the 20th century has a history of being very neutral. The US, both typographically and culturally, has never been a big fan of neutrality, at least for too long.\n\n"
    },
    {
      "time": "13 Mar 2008 — 12:07am",
      "content": "FeeltheKern, do you have any examples of Dutch Type from the 20st Century. Because I have to admit that my knowledge of typographical history isn't as large as most of yours (and most of the others here) is.\n\nI love typography, but since it's just a minor part of my education, most of its information I have to collect myself. And I don't always know where to look.\n\n"
    },
    {
      "time": "2 Jun 2008 — 7:38pm",
      "content": "track\n\n"
    }
  ]
}
