{
  "id": "42857",
  "title": "Do you have hi-res H&FJ photos?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am working on a big publication project (for school) about Hoefler and Frere-Jones and I’m having trouble finding good photos of the guys. Everything I have is scanned from design magazines, but the dot screen in those magazines is giving me the most horrible moire patterns I’ve ever had to deal with. Does anyone have some good photos of Jonathan and Tobias from conventions?\n\n [‹ SALSA & LATIN JAZZ typeface](http://web.archive.org/web/20080316201143/http:/typophile.com/node/42879 \"Go to previous forum topic\") [What are the best fonts to use for a book? ›](http://web.archive.org/web/20080316201143/http:/typophile.com/node/42847 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080316201143/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 5.Mar.2008 2.40pm",
      "content": "Maybe there are stills you can use from _Helvetica._ Example [here](http://web.archive.org/web/20080316201143/http:/helveticafilm.com/stills.html). I know there’s a forthcoming Blu-Ray edition, so the resolution will be really great. You could try e-mailing Gary Hustwit about using them.\n\n"
    },
    {
      "time": " 5.Mar.2008 2.51pm",
      "content": "Why not email the men themselves?\n\n"
    },
    {
      "time": " 5.Mar.2008 3.19pm",
      "content": "<cite>Why not email the men themselves?</cite>\n\nI will, but the photos people send out of themselves are never anything like what other people might have.\n\n"
    },
    {
      "time": " 6.Mar.2008 2.13am",
      "content": "So you want an embarrassing photo?\n\n"
    },
    {
      "time": " 6.Mar.2008 5.46am",
      "content": "<cite> &gt; I will, but the photos people send out of themselves are never anything like what other people might have.</cite>\n\nThen approach folks who work with them. Talk to Sara Soskolne, for instance. Maybe she has some nice candids. Didn’t Jared Benson intern at HTF (as it was known then)?\n\nWhen David Berlow was awarded the SoTA award at last year’s TypeCon, Sam had a hilarious photo of Jonathan from the early days — long, curly, wild-man hair. I’ll bet FB has photos of Tobias as well. I don’t know if they’ll feel comfortable giving them without permission from the subjects, however.\n\n— K.\n\n"
    },
    {
      "time": " 6.Mar.2008 6.20am",
      "content": "<cite>So you want an embarrassing photo?</cite>\n\nDo you have some? :¬)\n\n-=®=-\n\n"
    },
    {
      "time": " 6.Mar.2008 7.00am",
      "content": "<cite>So you want an embarrassing photo?</cite>\n\nNo, no. This is going into one of those now-you’re-a-big-design-student publication projects and I’m just going for quality and variety. I know how photo-happy some Typophiles are, but Flicker wasn’t turning up much, and I was just hoping to find some solid photos that looked a little casual.\n\n"
    }
  ]
}
