{
  "id": "42861",
  "title": "On sending portfolios in the mail.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is it still worthwhile to print a good-looking portfolio and mail it to a design firm? When I first went into school I heard people talk about this, but the last time I remember it coming up was at least two years ago. When I talk to people about jobs now, or see a job listing online, everyone wants to see an online portfolio or get a PDF via email; nobody has ever asked for anything else.\n\nI ask because I have been thinking about doing a nice, simple piece to mail out to a few places, but it occurred to me that 1) it might be a waste of time better spent sending emails or redesigning my web site and 2) people might think I’m a moron for inconveniencing them with snail mail in 2008.\n\n [‹ Any NYC type designers hiring interns?](http://web.archive.org/web/20081202133916/http:/www.typophile.com/node/42851 \"Go to previous forum topic\") [TDC2 2008 Results ›](http://web.archive.org/web/20081202133916/http:/www.typophile.com/node/42446 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202133916/http://www.typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 5.Mar.2008 8.49pm",
      "content": "I don’t see how it could hurt but I’d keep it simple and not spend too much on it. I have a single page tear sheet with my book covers and it’s nice either to send (by snail mail or as a pdf) or as a leave-behind. But I wouldn’t go crazy on it. And I would also have a kick-a$$ pdf to send them.\n\n"
    },
    {
      "time": " 5.Mar.2008 9.01pm",
      "content": "James,\n\nMy experience so far has been that placement/temp agencies prefer e-mails and PDF samples or portfolios, but that graphic design studios (at least those that specialize in print work) like to have something printed on nice paper.\n\nHowever, I advise you not to send your entire portfolio... Instead, send a cover/introduction letter asking for an interview, along with your resume and 3 or 4 samples (or that nice, simple piece you are thinking of doing)... These are meant to get an art director interested in seeing more, and getting you an interview. THEN, once you get an interview, you pull out and show your entire portfolio, which you have tailored to that particular studio/interviewer. :-)\n\n_nobody has ever asked for anything else_\n\nThat doesn’t mean they won’t like it if you go above and beyond minimum expectations... :-)\n\n"
    }
  ]
}
