{
  "id": "4288",
  "title": "Custom Art Company",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I need your feedback on this logo, as I'm about to take Custom Art Company from a fun little side gig to a full time business. I have done one short print run with this logo, but I'm willing to make changes. I'm about to begin designing a new website and make a second print run for design promotion.   \n   \nThe Custom wordmark carries a somewhat heavy burden: I design for print and web, illustrate, and, like you, have this fetish for typography, particularly hand-lettered type. I like the wordmark as a solution, and I want to convey a mark that is strong, not too flashy, and shaped a little out of the ordinary. Swelling with pride, potential, but not bloated. I wanted something that instantly said, \"This is not created from a stock typeface (or one that's instantly recognizable)\". At the same time, I wanted a refined, clean, ordered finish on the thing.   \n   \nSo this is where the logo stands currently (plain, with full name, and with URL). As I mentioned, I do have some equity in it, but not much at this point. Thoughts? Thanks, everyone.\n\n<!--attachment: templogo-33490.pdf*mime_pdf.gif*application/pdf*24.2*custom+logo*templogo%2epdf --><!--attachment: templogo-33490.pdf*mime_pdf.gif*application/pdf*24.2*custom+logo*templogo%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131021001421im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">custom logo<br><a href=\"http://web.archive.org/web/20131021001421/http:/www.typophile.com/forums/messages/29/templogo-33490.pdf\" target=\"_blank\"><b>templogo.pdf</b></a> (24.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "dylan",
  "time": "14 Apr 2004 — 10:28am",
  "uid": "1022",
  "comments": [
    {
      "time": "14 Apr 2004 — 10:32am",
      "content": "Seems to full and kind of blurry try to make it a little cleaner, edges might look better a little straighter.\n\n"
    },
    {
      "time": "14 Apr 2004 — 10:37am",
      "content": "Marvin: Check your preferences in Acrobat Reader (or Acrobat, for that matter). There should be a setting for \"Smooth Line Art\". Make sure that box is checked/on.   \n   \n$%#@ Acrobat Reader! Why wouldn't Adobe just set this pref' to 'on' when they send the application?   \n   \nAnyway, give that a try and re-open the PDF. Should give you a much smoother view!\n\n"
    },
    {
      "time": "15 Apr 2004 — 7:57am",
      "content": "I think it's great. Print!   \n   \nIf anything, it's maybe a bit too much like some of the older House Industries stuff, but I don't think your average client would ever make that connection (or even if they did, it wouldn't necessarily be a bad thing)\n\n"
    },
    {
      "time": "16 Apr 2004 — 9:56am",
      "content": "I am getting caught on the warped crossbar of the T, and the bottom prong of the C.   \n   \nThe O is slanting downward to the right. I really dislike that. I think it's a bit too tall as well. The U is my favorite letter.   \n   \nThe logo is a rectangle that wants to be an oval.   \n   \nIMO, an ovular solution would be handsome.   \n   \nWarp it all, or angle it. Both just bother me.   \n   \nI like the mark alone. Its very powerful.   \nIt could be that the other text does not feel   \nas \"Custom\" too.   \n   \nAndrew\n\n"
    },
    {
      "time": "19 Apr 2004 — 8:59pm",
      "content": "Dylan-   \n   \nI'm glad you're running this through the gamit even after you've done a short print run.   \n   \nOne of the biggest strengths of this mark is the hand lettering; you're able to achieve a definite sense of independence. I don't think the letterforms swell too much. In fact, I think you're on to something unique by juxtaposing crisp edges with somewhat organic forms. Every curved line seems to be balanced by a straight one. I would definitely not warp it all or angle it all. Having both is what balances it and makes it custom.   \n   \nKeeping with the theme of independence, \"CUSTOM\" by itself seems the natural choice. Its not as descriptive verbally, but I believe it conveys the boldest iconic message of the three. Alone, it should work at smaller sizes and in more contexts.   \n   \nOn the other hand, you're still left with the dilemna of not explaining enough about your company through the name. However, I think the mark is strong enough that it would be worth your time to find creative design solutions to design your way out of this problem. Perhaps the design promotion and website could be designed in such a way to strategically identify Custom Art Co's various services.   \n   \nCustom Art Co., Custom Art Company, or simply Custom? Consistency in branding yourself through naming could be dicey. Audibly, Custom Art Co. has the best ring to it. I would guess that Custom Art Company is what will be on the books, and then CUSTOM is most interesting graphically by itself.   \n   \nSince your website is [www.customartco.com](http://web.archive.org/web/20131021001421/http:/www.customartco.com/), I would think you'd want your customers to think of your company by that name. Perhaps you could have \"Custom Art Co\" written out in addition to your \"CUSTOM\" logo. \"Custom Art Co\" could shy away from being a logo element and become part of the introductory text of your design promotions and website.   \n   \nOverall, I'm very impressed by the mark \"CUSTOM\" makes. It'd be interesting to see it scaled down, scaled up, reversed, and applied to a couple of promo peices.\n\n"
    }
  ]
}
