{
  "id": "42888",
  "title": "Entry Level Design Positions Without A Design Degree?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello there,\n\nFirstly, this forum is very cool and quite the helpful resource. :) Anyway, on to my question: I graduated in December from Berkeley with a non-design degree (English). However, I do have roughly seven months of industry design experience via a user interface design internship for a web start-up company which I worked on while in university, and which I am still continuing until I find a full time job. I am confident in the design skills I have built as a result of this internship experience but of course I understand that I lack formal training, so as I search for jobs I wonder am I at a great disadvantage not having completed a design degree? Can industry experience plus my portfolio of work substitute formal training? It’d be great to know what employers are thinking! Problem is, sometimes you apply to these online positions and you never hear back from them, so I don’t know where the heck my resume has gone or if it’s just floating along in space somewhere. :] Or perhaps I am just being impatient and the job search will take much longer than I anticipated?\n\nI’d appreciate your advice on this matter!\n\n [‹ Ai Blend Tool and Type](http://web.archive.org/web/20080706224234/http:/www.typophile.com/node/42937 \"Go to previous forum topic\") [LOXORIA - The new luxurious website / What type? ›](http://web.archive.org/web/20080706224234/http:/www.typophile.com/node/42805 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706224234/http://www.typophile.com/user/28004\" title=\"View user profile.\">happycamper</a>",
  "time": "<br>",
  "uid": "28004",
  "comments": [
    {
      "time": " 6.Mar.2008 9.25am",
      "content": "I have a similar background as yours. I majored in English, got interested in design, got a part time job during college doing ad layout at a newspaper, and then got a design/marketing job after college. I stayed at that job for 9 years, and managed to build up a decent portfolio (mainly of stuff I did on my own). That place closed down, and my job search took a LONG time. I can definitely say that you’re at a disadvantage without a design degree — not because you’re inherently less talented (I’ve seen lots of people with design degrees who suck), but because a lot of potential employers won’t even consider you for an interview without a design degree on your resume (on numerous occasions, when I was able to get an interview, i was told that they weren;t going to call be because of the lack of the degree, but something else on my resume stuck out).\n\nThat said, I have a great job doing design right now. One bit of advice I have is that you should use your english degree as a selling point. A lot of designers can’t write, spell, or proofread. The fact that I can write has been a huge benefit. Instead of having to depend on outside sources for that, the company I work for can just use me.\n\nSometimes a job posting will specify that you need a degree. When I applied for those, I would state in my cover letter something about how I knew they were looking for someone with a degree, but I had extensive experience and a portfolio that would prove I knew what I was doing. This tactic definitely worked at getting me a few interviews I probably wouldn’t have otherwise gotten.\n\nJonathan\n\n"
    },
    {
      "time": " 6.Mar.2008 9.32am",
      "content": "Try looking for in-house jobs at big companies that need UI designers. Large companies tend to have employees who do jobs with no relation to their degrees because of lateral career moves, so they’re less likely to be picky about new hires.\n\n"
    },
    {
      "time": " 6.Mar.2008 9.48am",
      "content": "My story’s not too different...\n\nMy degree is in music. During college I spent a ton of time learning Photoshop, for kicks. I started getting very good with it, and one day I realized that I could be making money with my new-found skills. I bought CS2, learned my way around the other apps, started my own small design business, built up a working portfolio, and started looking for jobs.\n\nI submitted a rather eclectic resume on careerbuilder.com, had a couple of interviews, and before I knew it, I got a job as the graphic designer for the state office of a nationally-renowned non-profit, making more than I’ve ever made in my life (not bank — I still struggle a bit; just a step up!).\n\nSo throw together a portfolio and start selling yourself. Entry-level or not, the quality of your work and your personality can land you a good job!\n\nGood luck, and let us know how you do...\n\n"
    },
    {
      "time": " 6.Mar.2008 10.40am",
      "content": "I don’t know how the job market is today, but I graduated with a degree in fine art and no design background whatsoever. This was no impediment to my career. When I was an Art Director hiring young designers, I was never that impressed with a design degree.\n\nI think you should target places you’d like to work and send them letters, resumes and samples describing your skills & experience and explaining why you want to work for THEM. If they are going to get all snooty about a design degree you might not want to work for them anyway ;-)\n\n"
    },
    {
      "time": " 6.Mar.2008 11.33am",
      "content": "define ’design’\n\nIf you are talking about web UI design, a specific degree is less important for most shops. They want to see that you have technical skills and a decent portfolio.\n\nIf you are talking more traditional graphic design (annual reports, branding, etc) the larger firms may very well prefer a design degree on that resume.\n\nIn the end, though, it all depends on the particular firm.\n\n"
    },
    {
      "time": " 7.Mar.2008 11.12am",
      "content": "Thanks a bunch! Really helpful. And yeah, my internship is actually a combo of UI + graphic design, so I am looking into positions of both types. Appreciate the advice :)\n\n"
    }
  ]
}
