{
  "id": "42915",
  "title": "Font Forge",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Trying to select quadratic Béziers in Font Forge.\n\nIt seems to be a closely-guarded secret...\n\nCan anyone help?\n\n [‹ ITC's Lame-o promotion](http://web.archive.org/web/20080709010237/http:/www.typophile.com/node/45400 \"Go to previous forum topic\") [Font ID please... ›](http://web.archive.org/web/20080709010237/http:/www.typophile.com/node/45580 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080709010237/http://www.typophile.com/user/28027\" title=\"View user profile.\">nyomdasz</a>",
  "time": "<br>",
  "uid": "28027",
  "comments": [
    {
      "time": " 6.Mar.2008 10.34pm",
      "content": "Element -\\> Font Info -\\> General -\\> Quadratic Splines\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 6.Mar.2008 11.26pm",
      "content": "Gracias a este post llegué a: [http://fontforge.sourceforge.net/](http://web.archive.org/web/20080709010237/http:/fontforge.sourceforge.net/ \"http://fontforge.sourceforge.net/\") Me resultó sumamente interesante.  \nLástima que no exista una versión en castellano.\n\nSaludos,\n\n—  \nCarlos Fabián Camargo G.\n\n"
    },
    {
      "time": " 7.Mar.2008 12.10am",
      "content": "George welcomes any assistance in translating the interface and documentation of FontForge to other languages.\n\n"
    },
    {
      "time": " 7.Mar.2008 2.06pm",
      "content": "Thanks.\n\n[nyomdasz@yahoo.com](mailto:nyomdasz@yahoo.com)\n\n"
    },
    {
      "time": " 7.Mar.2008 3.08pm",
      "content": "I’ve been thinking about doing a Spanish one, although if I there were one or two others users with whom I could collaborate it would be a lot easier, given I only have some time here and there to do it. (okay so this is kind of hijacking the thread but....)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 9.Apr.2008 11.21am",
      "content": "Somebody knows how can I scale uniformely in Font Forge with the scale tool from the toolbar? Thanks,  \nneus\n\n"
    },
    {
      "time": " 10.Apr.2008 9.14am",
      "content": "<cite> Somebody knows how can I scale uniformely in Font Forge with the scale tool from the toolbar? </cite>\n\n- Select the points you want to scale. Select the scale tool, then while holding the shift key (this engages angular constraint), click and drag your pointer from your scale origin point until the points have scaled your desired amount.\n- Select the points you want to scale. Double-click on the scale tool. this will open the transformation dialog window, with the “Scale” option selected. From that same pull down menu, select the next item “Scale Uniformly”. Enter the percentage by which you want to scale, and select your preferred transformation origin from the pull down menu at the top of the dialog window. Click “OK” \n\n"
    },
    {
      "time": " 21.May.2008 9.17am",
      "content": "Hello Cuttlefish, thanke you very much for your answer, i knew the second option and it works, but i find it very unconfortable; the first option would be great, but it doesn´t work..\n\n"
    },
    {
      "time": " 21.May.2008 2.05pm",
      "content": "It would be nice to be able to scale numerically by em units rather than percentages. The first option works as described _for me,_ but it is difficult to control, and I generally use percentage scaling instead.\n\n"
    }
  ]
}
