{
  "id": "42917",
  "title": "Cochin with OSF and small caps ????",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is there an interation of Cochin out there that has old style figures and small caps?\n\nWould be nice as, Cochin, is one of my favorite types- probably the Bitstream version- nice ’n crisp.\n\nMikey :-)\n\n [‹ Printers in New York City](http://web.archive.org/web/20080907143135/http:/typophile.com/node/40736 \"Go to previous forum topic\") [Suggestions for Justice and order typeface ›](http://web.archive.org/web/20080907143135/http:/typophile.com/node/43057 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907143135/http://typophile.com/user/12479\" title=\"View user profile.\">SuperUltraFabulous</a>",
  "time": "<br>",
  "uid": "12479",
  "comments": [
    {
      "time": " 7.Mar.2008 5.03am",
      "content": "Hi Mike,\n\n[Linotype Nicolas Cochin](http://web.archive.org/web/20080907143135/http:/www.fontshop.com/fonts/singles/linotype/nicolas_cochin_regular/) has osf only, and [Lanston Nicolas Cochin Pro](http://web.archive.org/web/20080907143135/http:/www.fontshop.com/fonts/singles/lanston_type/ltc_nicolas_cochin_pro/) has both osf and tf. No small-caps, AFAIK\n\nHowever, they are quite different from [Bitstream (i.e. Linotype) Cochin](http://web.archive.org/web/20080907143135/http:/www.myfonts.com/fonts/linotype/cochin/familytree.html).\n\nF\n\n"
    },
    {
      "time": " 7.Mar.2008 11.06am",
      "content": "I didn’t no about the Lanston interpretation. Thanks Florian!\n\nI’ve always included MVB Sirenne in the same company, although its more leftfield.\n\nMikey :-)\n\n"
    },
    {
      "time": " 7.Mar.2008 1.01pm",
      "content": "You’re right, Mike, they belong to the same category — typefaces inspired by lettering found in copper engravings and etchings from the eighteenth century.  \nLinotype Nicolas Cochin is a quite faithful revival of Deberny & Peignot’s Cochin family (circa 1912-1914), whereas Bitstream Cochin is based upon a 1917 Monotype recutting (by Sol Hess) of the same face.\n\n"
    },
    {
      "time": " 8.Mar.2008 12.21pm",
      "content": "“Nicolas Cochin” and “Cochin” are completely different faces.\n\n"
    },
    {
      "time": " 8.Mar.2008 2.33pm",
      "content": "Yes, they are — in my opinion, Sol Hess did a very good job by toning down the quaintness of the Deberny & Peignot version.\n\n"
    },
    {
      "time": " 8.Mar.2008 10.05pm",
      "content": "The Cochin carried by Adobe for years should always have had oldstyle figures but was digitized early on without. The pre-digital version did include oldstyle figures somewhere in its original design program, but OSFs were just blown off in early conversions. Why the license holder can’t go back and fix that, I cannot imagine. Guardi is another Renaissance-feel face that obviously needs oldstyle figures—probably the reason it is not more popular, because otherwise it’s excellent. This is one of the continuing scandals in our field today, something that should be solved as an industry-wide standard, along with the problem of families released without bold and/or bold italic, or families whose fonts cannot be keystroke-linked.\n\n"
    },
    {
      "time": " 9.Mar.2008 4.53am",
      "content": "Hi John, I value your dedication – but this grows into a serious pet peeve, doesn’t it? ;-)\n\n"
    },
    {
      "time": " 9.Mar.2008 4.58am",
      "content": "“Pet peeve” ? What does it mean ?\n\n"
    },
    {
      "time": " 9.Mar.2008 1.37pm",
      "content": " ![](http://web.archive.org/web/20080907143135im_/http:/typophile.com/files/Capsmash_3753.png)\n\nI wanted to illustrate something that’s difficult about this class of face and why, perhaps, there are not more small caps. (lol)\n\nThe bottom line is a light drawn as the style demands in Italic, with AMVW heavily angled, all the caps around the same visual width, and an exuberant Y. All this is done so this uppercase work well with l.c. letters.\n\nThe top line shows what ’should’ be done to prepare it for use in all caps. and as a preparation for making small caps. That shows the angles of AMVW modified, the widths more spread out from narrowest to widest, and a less exuberant Y.\n\nI don’t know when this will be done, or when it will be available, so please don’t...\n\nCheers!\n\n"
    },
    {
      "time": " 9.Mar.2008 2.14pm",
      "content": "Three pet peeves, to be precise, Florian, and I will mention the case for reform until some of the worst perps get the message(s). Surely that’s one of the functions of this board, is it not? Admire your work, by the way.\n\n"
    },
    {
      "time": " 9.Mar.2008 3.40pm",
      "content": "Thanks a lot, John. And don’t get me wrong, I myself appreciate it very much when typefaces are well-equipped and provide all the options that are necessary. I just don’t think it is a realistic hope that having small caps, osf _and_ a bold/bold-italic weight for each and every typeface in the world will become an <cite>industry-wide standard</cite>. Yes, sometimes it’s a pity, and sometimes it’s annoying, but I can’t agree that it’s a _scandal_. IMO, there are so many good options/alternatives.\n\n"
    },
    {
      "time": " 9.Mar.2008 8.32pm",
      "content": "Not each and every, just the text families where the consumer has every right to expect: OSFs (default-loaded or globally switchable in OT), at least two weights each with matching italics, and keystroke links at least to the matching italics. After all, the big boys manage these features, why can’t the cool little boutique foundries? We pay the same money for their families without getting the same conveniences: to me, that’s a scandal, and I hope somebody else will eventually think so. I just CAN’T be the only one who wants such basics as industry-wide standards! It’s perfectly do-able, blocked only by attitude.\n\n"
    },
    {
      "time": " 10.Mar.2008 6.42am",
      "content": "“We pay the same money for their families without getting the same conveniences: to me, that’s a scandal”  \nSo what you are asking for is being asked for free. Ain’t that a scandal?\n\n“It’s perfectly do-able, blocked only by attitude.”  \nWow. Only attitude hu? Go draw some OSF and SC and then come back here, if you make it, and tell us it should be free and not take any time, effort or skill.\n\nCheers!\n\n"
    },
    {
      "time": " 11.Mar.2008 1.49am",
      "content": "Hello All:\n\nDavid, thank you for the graphic that shows the additional effort one might need to make before releasing such an ‘exuberant ’ face. When Matthew Carter was working on this at Bitstream perhaps it wasn’t economically feasble for him to continue with proper small caps. If I’m correct Bitstream barely started opentype pro-ing stuff. :-)\n\nA question tho: Its that a Cochin that you are working on at FB?\n\nMondoB: I agree with you that boutique designers really need to complete their feature sets since they are not cheaper than thourough heavy iron foundries. I usually avoid those products/foundries that don’t do a good job..\n\nBut even that I can tolerate but what I can’t tolerate is...\n\nBAD KERNING!!!\n\nHello! Why even relese the darn thing? If the ‘aga’ in magazine looks weird or punctuation thats all jamed up on the capitals- throw in the towel buddy.\n\nSide note: Font Bureau fonts are expertly kerned. Me likey.\n\nBut back to Cochin... if any of you guys get a chance to look at the book “French Women Don’t Get Fat”- it’s set in Cochin and DTL Nobel. Very beautiful and one of a few books published these days that has a colophon.\n\nMike Diaz :-)\n\n"
    },
    {
      "time": " 11.Mar.2008 9.12am",
      "content": "dberlow, most new text families with any kind of antique look (and many with very modern looks) are being designed with oldstyle figures now as a matter of course, reflecting the enormous demand for them, so this priority is nothing new to young type designers.\n\nWhen ITC published their series of sample books in the 1970s and 80s for new text families, these books showed that many had oldstyle figures designed and available for all the fonts, but most OSFs were not converted to digital in the 1990s. ITC is now moving, family by family, to put OSFs fully into play in OpenType, where they are most easily accessed. Via ITC, Galliard finally has OSFs for every single font—while Adobe’s OpenType Galliard still has none. I suspect pre-digital Cochin also had OSFs designed, so they just would need to be digitized.\n\nI certainly agree that crude kerning should be added to our hit list of industry-wide reforms. Why can’t somebody show some industry leadership on these issues?\n\n"
    },
    {
      "time": " 11.Mar.2008 9.19am",
      "content": "Why are you blaming Adobe though? They didn’t digitize the fonts, they only license those. No?\n\n"
    },
    {
      "time": " 11.Mar.2008 10.22am",
      "content": "<cite> &gt; I suspect pre-digital Cochin also had OSFs designed, so they just would need to be digitized.</cite>\n\nUnfortunately, John, this suspicion is unfounded.\n\nAccording to Mac McGrew: “Cochin originated with the Peignot Foundry of Paris, about 1915. . . . Sol Hess adapted it to the Monotype in 1917, while ATF copied the French face in 1925. Both Monotype and ATF replaced the French figures with the more usual lining figures.”\n\nSo more than mere digitization would be required; it would take someone to design them. (Note: French figures are not quite the same as oldstyle figures and would be probably even less acceptable to 21st century taste than lining figures.)\n\nI’m not saying it couldn’t or shouldn’t be done. It’s just that it would take more work/investment than one might initially suspect (as is often the case, unfortunately).\n\n— K.\n\n"
    },
    {
      "time": " 11.Mar.2008 8.02pm",
      "content": "Thanks for that answer, Kent...it’s a great pity. We discussed Adobe’s role in OpenType glyph coverage extensively on another thread; in this case, all they would have to do is replace their worthless Galliard by licensing the new ITC version, and thus make more money on it than ever, because—vee-oh-lah—OSFs for every font, at long last!! Strangely, even the 1970s pre-digital Galliard offered OSFs only for two of the fonts in that large family...I guess Carter felt OSFs were only good for stationery back then...he certainly changed his tune later, as we see whenever we post using his Georgia!\n\n"
    },
    {
      "time": " 11.Mar.2008 10.18pm",
      "content": "You’re missing the business rationale of ITC. If ITC sells their new “pro” fonts for $30 bucks a piece, they make $30. If they sell the same font through Adobe, they make $20. (Or whatever, I don’t know the numbers.)\n\nHence, if I recall what I have read somewhere else, it’s not Adobe that isn’t willing to osf all of their licensed typefaces, it’s ITC who isn’t willing.\n\nLooking through the vendors proves this point: No new Monotype Pro or ITC Pro fonts are available through 3rd party vendors.\n\n"
    },
    {
      "time": " 11.Mar.2008 10.47pm",
      "content": "It isn’t up to Adobe. It is up to those who license through them. AFAIK.\n\n"
    },
    {
      "time": " 12.Mar.2008 12.58am",
      "content": "Carter did rework Galliard.  \nC&C version is a from scratch re-digitization that- I would say- is superior to any version out there.  \nThe ITC version looks anemic to me. True is doesn’t have the other weights but it looks great.\n\nMikey :-)\n\n"
    },
    {
      "time": " 12.Mar.2008 4.22am",
      "content": "Kent is right about the lack of osf in Monotype Cochin. None of the Monotype shops I worked in/with ever had them; they weren’t available.\n\nThis comment by Kent is also true:  \n“(Note: French figures are not quite the same as oldstyle figures and would be probably even less acceptable to 21st century taste than lining figures.)”\n\nI proofread a book back in the mid-1980s that had been designed in Cochin by one of the best book designers on the West Coast. He used the Nicholas Cochin figures, which to me are the “French figures” to which Kent refers. They looked outlandish along with Cochin text. I had to go head-to-head with the designer to get them out of there. I cannot recall what we ended up using. It would be very hard to substitute osf from any other face into Cochin and have them look right. & very time-consuming to draw them new for a face that probaly is not near the top of any font best-seller lists.\n\nI think it a bit far-fetched to say consumers have “every right” to expect such things as osf. Consumers have every right to expect cars with gas tanks that won’t explode, baby clothing that will not roast the infants, software that won’t screw up our machines, and otherwise healthful and safe products. But osf hardly falls into the category of what we have every right to expect. As users of fonts/faces, we have every right to not use faces/fonts that haven’t got what we need, at the possible fiscal peril of the seller. Lack of osf hardly rises to the level of “scandal.”\n\nI’m hard-pressed to imagine a job for which Cochin is the only face that will work.\n\npowers\n\n"
    }
  ]
}
