{
  "id": "42921",
  "title": "Flashblog/Gotham/Thoughts on my website if you will....",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Ive almost completed a new project of mine, its a blog built in flash, with a wordpress backend, so technically its quite ambitious.\n\nIm unsure about choosing Gotham as one of the fonts due to all the publicity its had lately and I never wanted to give the feeling of an American vernacular. Its just a beautiful face that I wanted to use in conjunction with some others to show off my design skills and style. So if you think its inappropriate please tell me.\n\nIts only WIP so forgive the senseless content in there.\n\n[http://www.n8w.co.uk/WIP/WordpressFlash/](http://web.archive.org/web/20130310020948/http:/www.n8w.co.uk/WIP/WordpressFlash/ \"http://www.n8w.co.uk/WIP/WordpressFlash/\")\n\nany thoughts appreciated.  \nthanks\n\n",
  "author": "George Coltart",
  "time": "7 Mar 2008 — 4:10am",
  "uid": "21749",
  "comments": [
    {
      "time": "12 Mar 2008 — 1:46am",
      "content": "Hello George,\n\nI like the feel and look of your site. I have a (too) hard time reading the white text beneath your logo though, the tone is too similar to the background I guess.\n\nUsing Gotham feels allright to me, and I don't think you should be afraid of using it because everyone else does it at the moment.\n\nGreat idea about having the comments on the right side by the way.\n\nI'm not sure, but your choice of brown color might come out as a bit too retro for me. Anyways, I'm not sure and I think you should keep it if you like it.\n\n– _Malte_\n\n"
    },
    {
      "time": "12 Mar 2008 — 5:07am",
      "content": "Thanks malte,\n\nIm looking at changing the brown color actually, or adding another one as its all a bit monotone for my liking at the moment.\n\nI have recently checked out the site on a few different monitors and agree its a little ambitious using the white on grey for that intro text. I just liked the low contrast effect on it.\n\n"
    }
  ]
}
