{
  "id": "42948",
  "title": "Source of Inspiration",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm wondering, do any type designers out there (who are willing to fess up) decide to create a face with a lot of the same qualities of something pre-exisiting and use the pre-existing face as a template to start from. basic stroke width, height, general shape etc... is this taboo? do you think there are a lot of commercial types out there that were created in this manner? i love drawing a face from ground up but sometimes isn't it nice to improve on an existing model? I heard the typeface General was something like this. Based on Helvetica but with better spacing. thoughts?\n\n\\_will\n\n",
  "author": "Will Miller",
  "time": "7 Mar 2008 — 2:56pm",
  "uid": "4552",
  "comments": [
    {
      "time": "7 Mar 2008 — 3:03pm",
      "content": "It’s pretty common, for example, Helvetica Neue was based on Helvetica which was based on Akzidenz which was (probably) based on some British design which was based on painted signs which were based on contemporary stone carvings which were based on ancient stone carvings and so on.\n\n"
    },
    {
      "time": "7 Mar 2008 — 3:14pm",
      "content": "point taken. i was only thinking within the realm of digital type outlines, though. being able to piece together vectors and shapes from other types to create a beautiful frankenstein from an existing template. while it seems like cheating to me, I really have no gauge on how often, and if at all, this practice is performed.\n\nw|m\n\n"
    },
    {
      "time": "7 Mar 2008 — 4:17pm",
      "content": "If I may speak for men of letters, Will, and readers, I think that you are missing the aspect of (the craft of) fontography as a tool for creating learning & knowledge coexisting with making pragmatic values.\n\n"
    },
    {
      "time": "8 Mar 2008 — 12:12pm",
      "content": "No, I don't think I am missing this aspect at all, but I understand how it may sound when reading the above.\n\nI can't seem to find a way to form this question without sounding ignorant to designing typefaces and that is something i don't think I am. It's merely a technicality of the digital side of working with type that I am curious about.\n\nw|m\n\n"
    },
    {
      "time": "8 Mar 2008 — 12:33pm",
      "content": "I don't see the advantage in doing what you are saying, Will. I assume you are not talking about creating a knock-off so how does it help? Why would you want to \"correct\" someone else's work? There is no short cut if you want to design an original face. Doing the work is part of the design and gives you knowledge. What would you learn from a Paint-by-Numbers set? Nothing but staying within the lines. If you are in a hurry to do a design of a typeface, then type design is not the best choice for a profession.  \nHave their been people who have borrowed bits and pieces of other's digital fonts to make their own? Probably so but my guess is that their results were not as good as the original.\n\nChrisL\n\n"
    },
    {
      "time": "8 Mar 2008 — 1:48pm",
      "content": "That's how I feel about this as well. I would imagine the results to be less quality, i just wondered if this was something a lot of type designers do contrary to what I feel and usually hear. I guess my ego was slightly bruised for a moment in fear of sounding like i'm trying to validate \"borrowing\" parts to quickly make a knock off face. not the case at all, merely curious how others work. thanks for the reponses though. maybe I'm in danger of being overly touchy on this one\n\nw|m\n\n"
    },
    {
      "time": "8 Mar 2008 — 2:16pm",
      "content": "Will, my 2 cents worth:  \nFor me, designing type is about coming up with something that is of my own. I am more likely to avoid looking at other faces for ideas or ways of solving problems than seeing what the masters have done and following their ways. That is not to say that what I come up with will be better or even as good as what has been done in the past. I am just increasing the odds of it being my own ideas and solutions that surface. It may even be that I end up reinventing the wheel and doing what is tried and true over again. That does not bother me because the struggle I will have gone through will have taught me much more than just following existing models. I think looking at a type design problem in a naive way is healthy and enlightening. It may take longer to achieve a product and it may be frustrating at times but I still think it is the best approach for me. Will my results be truly innovative or noticeably \"new\"? Who knows. That is not my intention. Will my work become accepted by flocks of users? Probably no more chance of that than anything else being done. I am just casting my bread upon the waters and letting happen whatever happens. My way does not look like a sound business model so I don't advise it for those with a burning need for financial success. It is simply what I want to do right now.\n\nChrisL\n\n"
    }
  ]
}
