{
  "id": "42956",
  "title": "Are you a Grammarian? 10 Grammar Myths",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm well aware that there are many Grammarians on Typophile. I see it often in several threads. So, I thought the rest of us might take a cue and learn something from this.\n\nEnjoy.\n\nDirect Link: [http://grammar.quickanddirtytips.com/top-ten-grammar-myths.aspx](http://web.archive.org/web/20130707145549/http:/grammar.quickanddirtytips.com/top-ten-grammar-myths.aspx \"http://grammar.quickanddirtytips.com/top-ten-grammar-myths.aspx\")  \nReproduced Text:\n\n**Grammar Girl's Top 10 Language Myths:**\n\n**10.** A run-on sentence is a really long sentence. Wrong! They can actually be quite short. In a run-on sentence, independent clauses are squished together without the help of punctuation or a conjunction. If you write I am happy I am glad as one sentence without a semicolon, colon, or dash between the two independent clauses, it's a run-on sentence even though it only has six words. (See episode 49 for more details.)\n\n**9.** You shouldn't start a sentence with the word however. Wrong! It's fine to start a sentence with however so long as you use a comma after it when it means \"nevertheless.\" (See episode 58 for more details.)\n\n**8.** Irregardless is not a word. Wrong! Irregardless is a word in the same way ain't is a word. They're informal. They're nonstandard. You shouldn't use them if you want to be taken seriously, but they have gained wide enough use to qualify as words. (See episode 94 for more details.)\n\n**7.** There is only one way to write the possessive form of a word that ends in s. Wrong! It's a style issue. For example, in the phrase Kansas's statute, you can put just an apostrophe at the end of Kansas or you can put an apostrophe s at the end of Kansas. Both ways are acceptable. (See episode 35 for more details.)\n\n**6.** Passive voice is always wrong. Wrong! Passive voice is when you don't name the person who's responsible for the action. An example is the sentence \"Mistakes were made,\" because it doesn't say who made the mistakes. If you don't know who is responsible for an action, passive voice can be the best choice. (See episode 46 for more details.)\n\n**5.** I.e. and e.g. mean the same thing. Wrong! E.g. means \"for example,\" and i.e. means roughly \"in other words.\" You use e.g. to provide a list of incomplete examples, and you use i.e. to provide a complete clarifying list or statement. (See episode 53 for more details.)\n\n**4.** You use a before words that start with consonants and an before words that start with vowels. Wrong! You use a before words that start with consonant sounds and an before words that start with vowel sounds. So, you'd write that someone has an MBA instead of a MBA, because even though MBA starts with m, which is a consonant, it starts with the sound of the vowel e--MBA. (See episode 47 for more details.)\n\n**3.** It's incorrect to answer the question \"How are you?\" with the statement \"I'm good.\" Wrong! Am is a linking verb and linking verbs should be modified by adjectives such as good. Because well can also act as an adjective, it's also fine to answer \"I'm well,\" but some grammarians believe \"I'm well\" should be used to talk about your health and not your general disposition. (See episode 51 for more details.)\n\n**2.** You shouldn't split infinitives. Wrong! Nearly all grammarians want to boldly tell you it's OK to split infinitives. An infinitive is a two-word form of a verb. An example is \"to tell.\" In a split infinitive, another word separates the two parts of the verb. \"To boldly tell\" is a split infinitive because boldly separates to from tell. (See episode 9 for more details.)\n\nAnd now, the number one grammar myth, which my Twitter friends chose over splitting infinitives [fanfare music]\n\n**1.** You shouldn't end a sentence with a preposition. Wrong! You shouldn't end a sentence with a preposition when the sentence would mean the same thing if you left off the preposition. That means \"Where are you at?\" is wrong because \"Where are you?\" means the same thing. But there are many sentences where the final preposition is part of a phrasal verb or is necessary to keep from making stuffy, stilted sentences: I'm going to throw up, let's kiss and make up, and what are you waiting for are just a few examples. (See episode 69 for more details.)\n\n",
  "author": "AndrewSipe",
  "time": "8 Mar 2008 — 8:38am",
  "uid": "6496",
  "comments": [
    {
      "time": "8 Mar 2008 — 9:24am",
      "content": "[http://ngm.typepad.com/rogers\\_rules/](http://web.archive.org/web/20130707145549/http:/ngm.typepad.com/rogers_rules/ \"http://ngm.typepad.com/rogers\\_rules/\") is a great blog for grammar tips. I particularly like the entry on the demise of hyphenation.\n\n"
    },
    {
      "time": "8 Mar 2008 — 10:42am",
      "content": "a fun collection of anti-anti-isms :-)\n\nChrisL\n\n"
    },
    {
      "time": "8 Mar 2008 — 11:27am",
      "content": "That was great!\n\nBut I bogged down in item four when you started discussing the letter \"a\" without quote marks, as I thought it was the indefinite article, rather than a noun. I often write about letters, and find that sometimes quote marks are necessary, sometimes not.\n\nFollowing the general principle \"omit the mark if doing so doesn't disturb meaning\", it would seem that it's better to discuss the letters of the alphabet without quotes; however, the fact that \"a\" may be mistaken for an indefinite article scotches that idea. Also, single letters may be mistaken for typos (i.e. the accidental addition of a space, or an \"i\" that has been inadvertently uncapitalized). So, although it might seem a bit pedantic, it's probably best to put quote marks around the letters of the alphabet when they're being used as names.\n\n"
    },
    {
      "time": "8 Mar 2008 — 12:03pm",
      "content": "So is <cite>over/more than</cite> over?\n\nAnd have we given up on <cite>begs the question</cite> as a logical fallacy in favor of the more common usage?\n\n"
    },
    {
      "time": "8 Mar 2008 — 12:58pm",
      "content": "<cite>7. There is only one way to write the possessive form of a word that ends in s. Wrong! It’s a style issue. For example, in the phrase Kansas’s statute, you can put just an apostrophe at the end of Kansas or you can put an apostrophe s at the end of Kansas. Both ways are acceptable. (See episode 35 for more details.)</cite>\n\nWrong. Arkansas's is the only correct form for the possessive of Arkansas, as decreed by the Arkansas State Legislature (note that also it is against the law to mispronounce the name of the state whilst in Arkansas).\n\nA better site for discussion of English grammar is [Language Log](http://web.archive.org/web/20130707145549/http:/itre.cis.upenn.edu/~myl/languagelog/).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "8 Mar 2008 — 1:26pm",
      "content": "These are mostly correct, but I object to the elevation of \"irregardless\". Comparing it to \"ain't\" is nonsense. \"Ain't\" is practically as old as the English language; in strict usage it is a contraction of \"am not\". The illogically constructed \"irregardless\" is born of ignorance, and no more deserving of validation through repetition than \"nukular\" or \"asterick\".\n\n"
    },
    {
      "time": "8 Mar 2008 — 2:03pm",
      "content": "Seems a pretty ho hum list to me. I don't see how exposing any of these trivial \"myths\" is going to liberate anyone's writing and make it better.\n\n"
    },
    {
      "time": "8 Mar 2008 — 2:49pm",
      "content": "I for one am from this day forward, going to write way more better irregardless. _(Irregardless is in my spell checker so it must be a word,eh?)_\n\nOne of the people who installs signs for me is wont to say things like \"Stay where you're at 'til I comes where you're to.\"\n\n-=®=-\n\n"
    },
    {
      "time": "8 Mar 2008 — 3:34pm",
      "content": "But \"ginormous\" is a cromulent word, ain't it?\n\n"
    },
    {
      "time": "8 Mar 2008 — 4:03pm",
      "content": "Ginormous is more than cromulent. It is!\n\n"
    },
    {
      "time": "8 Mar 2008 — 4:03pm",
      "content": "Sometimes you's guys jist hav'ta have fun wit stuff irregardless of if it be good :-)\n\nChrisL\n\n"
    },
    {
      "time": "8 Mar 2008 — 4:14pm",
      "content": "\"Me? Fail English? That's unpossible!\"  \n --Ralph Wiggum\n\n"
    },
    {
      "time": "8 Mar 2008 — 4:17pm",
      "content": "I had an English teacher who used to go ballistic if anybody used the word \"got\".  \n\"BOY!\" he would thunder, \"Excise that word from your vocabulary!\"  \nThat's why I tend to get (sorry) a bit sesquipedalian at times.\n\n"
    },
    {
      "time": "8 Mar 2008 — 4:41pm",
      "content": "As someone who has just written a looong book on the disastrous consequences of not being clear about when one is referring to a linguistic item and when one is referring to a thing --- ie on the non-use of quotation marks --- I second Nick's complaint. The letter 'a' in the initial post, and various other references to words and letters, need quotation marks. If they should be there, put them in.\n\n"
    },
    {
      "time": "8 Mar 2008 — 4:43pm",
      "content": "There is also a converse to number 10 that I want Word's Grammar checker to get through it's thick skull: not every long sentence is automatically a run-on sentence.\n\n"
    },
    {
      "time": "9 Mar 2008 — 5:46am",
      "content": "<cite>«You shouldn’t end a sentence with a preposition. Wrong! You shouldn’t end a sentence with a preposition when the sentence would mean the same thing if you left off the preposition. That means “Where are you at?” is wrong because “Where are you?” means the same thing. But there are many sentences where the final preposition is part of a phrasal verb or is necessary to keep from making stuffy, stilted sentences: I’m going to throw up, let’s kiss and make up, and what are you waiting for are just a few examples. (See episode 69 for more details.)»</cite>\n\nWhat the bloody hell?!? WRONG WRONG WRONG WRONG WRONG! [There’s a run-on sentence for ya!]\n\nI thought this guy was supposed to be _breaking_ myths, not empowering and continuing them!\n\nThe reason the myth that “ending a sentence in a preposition is bad” even exists is that purists in the 14th to 16th centuries all thought Latin was the greatest thing ever and French should be used as an ideal role model at all times; and in Romance languages, it _is_ wrong to end a sentence in a preposition.\n\nBut English is a Germanic language, and _there is never anything wrong with ending a sentence in a preposition in any Germanic language_ (assuming it makes logical and grammatical sense to do so, of course), it’s a perfectly natural result of the rather complex patterns of word inversion that appear in all Germanic languages when fronting a sentential topic (some more complex than others, of course).\n\nAnd when it comes to ‘throw up’ and ‘make up’ … well, that just goes to show that the [excuse the harsh language] idiot who wrote this list doesn’t know a thing about language or grammar. ‘Up’ in these two phrasal verbs are _not_ prepositions, they’re bloody adverbs! A preposition requires the possibility of adding an object, which neither of these two have. If an object is added, it’s the object of the verb, not the preposition (which is an adverb).\n\n&nbsp;\n\n<cite>«Wrong. Arkansas’s is the only correct form for the possessive of Arkansas, as decreed by the Arkansas State Legislature (note that also it is against the law to mispronounce the name of the state whilst in Arkansas).»</cite>\n\nBut he was talking about Kansas, not Arkansas. ;-)\n\n(I have to admit, I don’t know if a similar situation exists for Kansas)\n\nAlso, he completely neglects to mention here that where personal names taken from antiquity are concerned, there is in fact no choice: an apostrophe without an s is the only choice.\n\n&nbsp;\n\n<cite>«I had an English teacher who used to go ballistic if anybody used the word “got”.<br>\n“BOY!” he would thunder, “Excise that word from your vocabulary!”<br>\nThat’s why I tend to get (sorry) a bit sesquipedalian at times.»</cite>\n\nUgh, I hate people (teachers) who do that. _Get_ is a good Ol’ Norse (that was a pun) word that’s been frequently used and has formed part of the basic core of English verbs and auxiliaries for at least seven or eight centuries. There is absolutely no reason to excise it.\n\n(And surely there is nothing wrong with sesquipedalianism, as long as it’s not outright hippopotomonstrosesquipedalianism)\n\n"
    },
    {
      "time": "9 Mar 2008 — 6:34am",
      "content": "<cite>The letter ’a’ in the initial post, and various other references to words and letters, need quotation marks.</cite>\n\nDunno about Australia, but in the States, and following the dreaded Chicago style, the single quotes are allowed only in books about philosophy. That lets philosophers have their sense-reference distinction. For any non-philosophical topic, the editor will change single quotes to double quotes.\n\nBefore you think philosophers are on to something, consider that in philosophy, the statement \"I don't understand\" is a serious criticism of an argument just offered, and in no way refers to the intellectual capacity of the person who says \"I don't understand.\" Rather different situation in mathematics, engineering, computer science, and even English.\n\n\\* \\* \\*\n\nI once asked an editor what was the difference between \"regardless\" and \"irregardless.\" He replied \"breeding.\"\n\nThen there is the <cite>Irregardless Cafe</cite> in Raleigh, North Carolina . . .\n\n"
    },
    {
      "time": "9 Mar 2008 — 8:56am",
      "content": "_There is absolutely no reason to excise it_ [get].\n\nHis reason: that \"get\" is an all-purpose word which lazy pupils will use when they can't be bothered to think of anything more precise or interesting, and such bad habits will stunt the growth of their vocabulary, impoverishing their means of expression (and exam results). So:\n\nI got up this morning: I arose  \nI got angry: I became angry  \nI've got to go: I must go  \nI get the point: I understand  \n...and so on\n\nBut you have a point, perhaps he would have been better to allow us a few legitimate uses, explaining when it's appropriate to be terse and vernacular, rather than long-winded and pretentious. That was earlier in my school career though, and we got (ah-ha!) a dose of Pinter and Beckett later on.\n\n"
    },
    {
      "time": "9 Mar 2008 — 10:35am",
      "content": "<cite>And when it comes to ‘throw up’ and ‘make up’ … well, that just goes to show that the [excuse the harsh language] idiot who wrote this list doesn’t know a thing about language or grammar. ‘Up’ in these two phrasal verbs are not prepositions, they’re bloody adverbs! </cite>\n\nHe would have been better off just calling them particles, which is a better catch-all term for the preposition/adverb/etc that follows the root verb in a phrasal verb. (in English, at least)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "9 Mar 2008 — 1:52pm",
      "content": "Conjunction Junction, what's your function?  \nHooking up words and phrases and clauses.\n\n"
    },
    {
      "time": "9 Mar 2008 — 5:02pm",
      "content": "<cite>«He would have been better off just calling them particles, which is a better catch-all term for the preposition/adverb/etc that follows the root verb in a phrasal verb. (in English, at least)»</cite>\n\nBut that wouldn’t fit this particular context well, since dangling prepositions (or, if we’re including this airhead’s examples, dangling particles in general) is one of the cases where distinguishing between prepositions and adverbs actually becomes relevant, since it is possible—in most cases—to front prepositions, but never adverbs, in phrasal verb constructions.\n\n&nbsp;\n\n<cite>«His reason: that “get” is an all-purpose word which lazy pupils will use when they can’t be bothered to think of anything more precise or interesting, and such bad habits will stunt the growth of their vocabulary, impoverishing their means of expression (and exam results). So:</cite>\n\n_I got up this morning: I arose  \nI got angry: I became angry  \nI’ve got to go: I must go  \nI get the point: I understand  \n...and so on»_\n\nI honestly cannot see why the existence of ‘get up’ should deny ‘arise’, or vice versa. This kind of teaching has always struck me as odd.\n\nNaturally, the students need to know that there are various different ways of expressing the same thing, and they need to realise that there are register differences between them. They should know that in a written work aspiring to be terse, epic, or poetic in character, writing, “I got out of bed this morning” is an inferior choice to, “I arose this morning”. But they should also know that in a colloquial, verbal setting, when chatting with your mates, the latter sentence would sound almost ridiculously formal, while the former would be neutral and expected.\n\nTo say that only the higher-register forms should exist, and the lower-register forms should be expunged altogether is as much a crime against the language as the opposite would be. It’s linguistic snobbery, something that has plagued the history of the English language in particular (though many others have been nearly as affected by it) in the past demi-millennium.\n\n"
    },
    {
      "time": "9 Mar 2008 — 5:30pm",
      "content": "«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos».  \n[La Luz Oscura, por Javier Guerrero]\n\nThat is far my understanding can go. My head is a big salad of languages. Is there a Tipófilo (Tipophilo) románico?\n\nAs to add wood to the fire of discussion, a word:\n\nGorgeosity\n\n"
    },
    {
      "time": "9 Mar 2008 — 5:30pm",
      "content": "_\"The reason the myth that “ending a sentence in a preposition is bad” even exists is that purists in the 14th to 16th centuries all thought Latin was the greatest thing ever and French should be used as an ideal role model at all times; and in Romance languages, it is wrong to end a sentence in a preposition._\n\nBut English is a Germanic language, and there is never anything wrong with ending a sentence in a preposition in any Germanic language (assuming it makes logical and grammatical sense to do so, of course), it’s a perfectly natural result of the rather complex patterns of word inversion that appear in all Germanic languages when fronting a sentential topic (some more complex than others, of course).\"\n\nEnglish is a a hybrid language formed from a Germanic base and with much French influence, starting in the 11th Century, thus causing the enormous difference between Middle English and Anglo-Saxon. If you are going to shout on a forum at least shout things that are true.\n\n(That said, I don't disagree with what you said about prepositions here — merely your argument for that conclusion.)\n\n"
    },
    {
      "time": "9 Mar 2008 — 6:06pm",
      "content": "Is fascinating that folks can talk among themselves in italian spanish and catalan, not knowing the other ones language and parlar.  \nSorry no apóstrofes.\n\nA line for a specimen:\n\nIMAGINARIUM LANGUAE\n\nI don't even know if it exists, catalogued. But authought uncertain its meaning\n\nIT IS A GREAT LINE\n\nfor my coming románica type face. Nothing fancy. A exercise, the rummering the curve.\n\n"
    },
    {
      "time": "9 Mar 2008 — 6:34pm",
      "content": "<cite>«English is a a hybrid language formed from a Germanic base and with much French influence, starting in the 11th Century, thus causing the enormous difference between Middle English and Anglo-Saxon. If you are going to shout on a forum at least shout things that are true.»</cite>\n\nBut English is not a hybrid language, it is a purely Germanic language. It’s true that it’s been under extremely heavy Romance influence, but its base is still unequivocally Germanic—if anything, its _vocabulary_ is hybrid.\n\nIt’s also true that Romance languages have had some influence in the fact that certain sentence patterns and structures have fallen into disuse or at least become less common or more stilted than they once were (a good example is the reduced use of inversion in Modern English, a simplification that was no doubt partially spurred on by the relative lack of inversion in French); but that doesn’t make the English language itself any less Germanic in base.\n\nAnd really, in the entire period between Anglo-Saxon (I take it that by using this term, rather than ‘Old English’, you are referring to the earlier stages of the language?) and Middle English, Early French was hardly a major contributor in causing the rapid evolvement of the language. In the earlier parts of this interval, various Celtic languages and Latin were by far the largest influences, and in the later parts of it, Old Norse was—and of these, only Old Norse managed to really make any kind of lasting impression beyond the simple vocabulary level. It was only towards the very final stages of Old English, and especially in the early stages of Middle English, that French really began to be a heavy influence.\n\nBut anyways—this is all neither really here nor there, nothing more than a derailment. Apologies if I came off like I was “shouting on a forum”, that wasn’t my intention. I just get all riled up when people create these ‘myth-busting’ articles and publish them for all the world to read, and then include such elemental errors. No hard feelings, I hope. :-)\n\n"
    },
    {
      "time": "9 Mar 2008 — 11:35pm",
      "content": "Supposedly, an editor had clumsily rearranged one of Winston Churchill’s sentences to avoid ending it in a preposition.\n\nThe British Prime Minister, very proud of his style, reportedly scribbled this note in reply:\n\n“This is the sort of bloody nonsense up with which I will not put.”\n\n[http://www.wsu.edu/~brians/errors/churchill.html](http://web.archive.org/web/20130707145549/http:/www.wsu.edu/~brians/errors/churchill.html \"http://www.wsu.edu/~brians/errors/churchill.html\")\n\nDavid Thometz\n\n"
    },
    {
      "time": "10 Mar 2008 — 12:52am",
      "content": "Sagacious tip from Mark Twain: \"Substitute 'damn' every time you're inclined to write 'very'; your editor will delete it and the writing will be just as it should be.\"\n\n"
    },
    {
      "time": "10 Mar 2008 — 5:44am",
      "content": "\"3. It’s incorrect to answer the question “How are you?” with the statement “I’m good.” Wrong! Am is a linking verb and linking verbs should be modified by adjectives such as good. Because well can also act as an adjective, it’s also fine to answer “I’m well,” but some grammarians believe “I’m well” should be used to talk about your health and not your general disposition. (See episode 51 for more details.)\"\n\nHm... isn't \"to be\" polysemic? Both a linking word (a \\_copula\\_), but also a regular verb?  \nWhile it's correct, that copulae bind adjectives to nouns, when it's used as a verb, it is modified with an adverb.\n\nSuch, \"I'm good\" means \"I am a good person\", \"I'm well\" means \"I'm feeling well\".\n\nTo answer the question \"How are you?\" with \"I'm good\" is either misunderstanding the question, or being the opposite of modest... :-)\n\nWell, that for the theory. In practice, a lot of people \"say\" I'm good. So from a descriptive point of view, it's correct. One ought not write it though. \"You bloody don't write everything that leaves your dirty mouth\". ;-)\n\n"
    },
    {
      "time": "10 Mar 2008 — 5:47am",
      "content": "On quoting \"a\".\n\nIn some linguistic typesetting traditions, when speaking of a word on the meta level, you italicise it, rather than using quotes.\n\nAlso a nice solution.\n\n"
    },
    {
      "time": "10 Mar 2008 — 6:54am",
      "content": "<cite>«Hm... isn’t “to be” polysemic? Both a linking word (a _copula_), but also a regular verb?<br>\nWhile it’s correct, that copulae bind adjectives to nouns, when it’s used as a verb, it is modified with an adverb.»</cite>\n\nI can’t think of any (normal) instances where ‘to be’ is not a copula. A copula is not merely a verb that binds an adjective to a noun; rather, it’s any verb that connects the subject of a sentence with the subject complement. As such, it is a verb that connects to equal sentential units, and they must both be nominal (&nbsp;=&nbsp;either a noun, a nominal phrase, or an adjective). It cannot connect a nominal unit with a verbal or adverbial unit (using ‘adverbial’ in the non-systemic sense of ‘anything that’s neither nominal nor verbal’). The verb ‘to be’ is never modified; rather, is used as a ‘dummy placeholder’ in the required verbal position in the sentence when the subject itself is what’s being modified.\n\nWhether you say, “I am good” or “I am well”, ‘good’ and ‘well’ are both adjectives. ‘Good’ means what you say it means, dealing with inherent qualities (being a good person, &c.), but it is also, albeit informally so, used as a subsitute for the adjective (not adverb!) ‘well’, which means ‘healthy, free of illness’. So, “I am good” can mean both things, depending on context.\n\nConsider that substituting a different adjective for ‘good/well’, but the sentence ceases to make sense if you substitute an adverb in their stead: “I am angry” works fine, but “I am angrily” does not. The only case where the latter might be said to work is if you take ‘to be’ in its meaning of ‘to exist’: “He exists angrily” would then imply the way in which he carries out his existence. It’s a bit far-fetched, but it’s the only way ‘to be’ can be used with an adverb that I can think of.\n\n"
    },
    {
      "time": "10 Mar 2008 — 8:35am",
      "content": "I am oh, so glad I never chose a career as an editor :-)\n\nChrisL\n\n"
    },
    {
      "time": "10 Mar 2008 — 9:15am",
      "content": "Chris, everyone who respects the English language and good spelling is glad I didn't.\n\n-=®=-\n\n"
    },
    {
      "time": "10 Mar 2008 — 9:38am",
      "content": "\\> If you write I am happy I am glad as one sentence without a semicolon, colon, or dash between the two independent clauses, it’s a run-on sentence even though it only has six words.\n\nUm. It depends on the thought you're trying to express. If you're saying the same thing two different ways (e.g., to be poetic, to intensify the thought, or because you're misquoting the Cream song), then yes, it's a run-on sentence. But perhaps you mean that you're pleased to be feeling glad: \"I am happy (that) I am glad.\" That's not a run-on sentence.\n\n"
    },
    {
      "time": "11 Mar 2008 — 8:20am",
      "content": "I've got no problem with \"irregardless\", as long as it ain't used to mean \"regardless\".\n\n"
    },
    {
      "time": "11 Mar 2008 — 9:31am",
      "content": "\"I would like to share a revelation that I have had\". It is just a drawing; made back in the nineties. I used to make this quick drawings using china ink and color markers.\n\nI believe it has a relationship to something I was thinking back then related to idiomatic expressions, and pertinent to the topic of THE discussion.\n\nI noted also that there are some romanesqve lines in the drawing. The drawing is just a vision, so, what you see, is what you get.\n\n(It doesn't have a title. I ended up writing this one, which is pertinent)\n\n\\*\\*\n\n ![](http://web.archive.org/web/20130707145549im_/http:/typophile.com/files/romanesqve-idiomatic_4390.jpg)\n\n\"Romanesqve Idiomatic\" [3\"x4\"]\n\n"
    },
    {
      "time": "11 Mar 2008 — 12:59pm",
      "content": "man, dis ’ish is off da mugga fuggin chain!!!\n\nmeaning roughly- “requisite collection of grammatical dictums”\n\nMikey :-)\n\n"
    },
    {
      "time": "11 Mar 2008 — 3:30pm",
      "content": "Irregardless appears to be an inflammable topic.\n\n"
    },
    {
      "time": "11 Mar 2008 — 8:55pm",
      "content": "when I was a kid in Back of Beyond, British Columbia, we were driving along behind a big truck that had the word INFLAMMABLE in big bold red letters across the back and along the sides. I asked my dad if that meant that whatever it was carrying would or wouldn't burn. It was confusing. If it won't burn, then why the warning signs? He said, it means it won't burn, it'll just explode. I never knew if he just made that up or not, but he was a miner at the time, so I figured he knew what he was talking about. :-)\n\n-=®=-\n\n"
    },
    {
      "time": "11 Mar 2008 — 8:57pm",
      "content": "It means the cargo can become inflamed.\n\nI wonder if this jacket is breathable?\n\n"
    },
    {
      "time": "12 Mar 2008 — 7:21am",
      "content": "\"INFLAMMABLE\" means that it can burn. The trick is that the in- in inflammable is not the same as in e.g. \"inable\".  \nBoth are Latin verbal prefixes, but one relates to English \"in-\", the uther to English \"un-\".\n\nThe one in \"inable\", \"inadvertable\" means (related to \"un-\") means \"not\": not able, not advertable, it's also the \"ir-\" in irrelevant (not relevant), but there the \"n\" turned into an \"r\" due to phonological processes in Latin.\n\nThe one in \"inflammable\" (related to \"in-\") means the same as the preposition \"in\", it signifies direction, movement (in an abstract sense as well), or the following in time (metaphoric usage of \"movement\" used instead of space for \"movement\" in time). Here inflammable inflamm- (from inflammare) means to start burning (where the \"start\" semantic component comes from \"in\", the \"burning\" from flamm(are); flamm(are) is kin to \"flame\"), so inflammable means: it can start burning, it's burnable.\n\nFlammable is a neologism which is derived from the original inflammable (probably also through contamination with the English word \"flame\".  \n\"inflame\" (of which inflammable is derived with -able) is attested as of 1340. \"flammalbe\" is first attested 1813.\n\n"
    },
    {
      "time": "12 Mar 2008 — 8:10am",
      "content": "Perhaps (for more clarity) the sign on the truck should have read: \"This sucker will burn will burn your arse of so stay the hell away!\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Mar 2008 — 9:37am",
      "content": "aszszelp, not saying you're wrong, but wouldn't that sense of \"in\" more commonly be rendered \"en,\" so inflammable would be enflammable?\n\n"
    },
    {
      "time": "12 Mar 2008 — 10:49am",
      "content": "réellement, je pense que le camion est venu du Québec... pre federal regulations on bilingualism in Canadia.\n\n-=®=-\n\n"
    },
    {
      "time": "13 Mar 2008 — 9:28am",
      "content": "Gus, en- would be usually used if the word was taken via Norman-French (or later from French). Not however, if it was taken directly from Latin via \"scholarly\" knowledge/introduction etc. Remember: in 1340 those who could write were 99.5% monks and would know (and use) latin all the time!\n\nWell, English had to endure a lot of \"mixing\"...  \nto sum up, verbal prefixes with the meaning \"in\" can be (at least): in-, en-  \nverbal prefixes with the meaning \"not\" can be (at least): in-, un-, a-, an-, non-, etc.\n\n"
    },
    {
      "time": "13 Mar 2008 — 9:49am",
      "content": "English was a melting pot language which is why we have so many exceptions to so many rules.\n\nChrisL\n\n"
    },
    {
      "time": "13 Mar 2008 — 4:45pm",
      "content": "<cite>«Gus, en- would be usually used if the word was taken via Norman-French (or later from French).»</cite>\n\nOr from Greek (in which case it means ‘inside’, i.e., in a locative sense, rather than ‘into’ in an accusative sense).\n\n&nbsp;\n\n<cite>«verbal prefixes with the meaning “not” can be (at least): in-, un-, a-, an-, non-, etc.»</cite>\n\nAnd all but the last come from the exact same word, logically enough simply _n̥_ (wonder how that will look in Georgia). **Edit.** Apparently none too good. That was supposed to be a syllabic n, an n with a ring under it.\n\nWe should have just stuck with PIE while it was still a more or less homogeneous and manageable can of worms. Would have been much easier.\n\n"
    },
    {
      "time": "14 Mar 2008 — 6:31am",
      "content": "\"non\" (Latin for not) also has the PIE syllabic \"n\" with the semantics of \"negation\" in there. The difference is, that the others were already verbal prefixes in the languages from which English took over the words in question, while the non-construct is more-or-less an English invention (using a latin word as a verbal prefix).\n\n"
    },
    {
      "time": "14 Mar 2008 — 6:33am",
      "content": "The n-ringbelow does not look that bad... but at that leading the bottom half of the ring is cut off / not rendered (at least in FF).\n\n"
    },
    {
      "time": "14 Mar 2008 — 6:35pm",
      "content": "Oh—in Safari (at least here), it appears as an _n_ with a big, fat square after it. Which is rather untelling.\n\n&nbsp;\n\n<cite>«“non” (Latin for not) also has the PIE syllabic “n” with the semantics of “negation” in there.»</cite>\n\nYes, but it also has _oenum_, unlike the others.\n\n_Non_ sort of worked as a prefix in Latin, too, the same way it does in English: it could be used to negate adjectives (especially present participle- or gerundive-based ones), and would then lead to units that could almost be considered semantically close enough to form a word, even in Latin.\n\n"
    },
    {
      "time": "15 Mar 2008 — 5:00am",
      "content": "Hi there good folks. I am back. I have a little gift that everyone will love:\n\n ![](http://web.archive.org/web/20130707145549im_/http:/typophile.com/files/1st-Page-Bible_3417.jpg)\n\nI posted here earlier, some \"stuff\" and, although some of you may consider this coming out of some crazy book or cinematographic animation; \"Am I dreaming\" you would say that, but it is pure and simple right out of own head.  \nI posted something in this blog because I have a feeling that my English skills (?) are kind of amusing, and I hope you will like the entertainment, \"this is only the beginning\". If that is your case, you are welcome.  \nI did not post here my comments as to inmiscuate myself in somebody else's business nor to illustrate myself as a \"Total Informal\" entity. I do that sometimes... I am still trying to figure out why, huuummm; why do I do (...) that?\n\n\\*\\*\n\nPara aquellos de Ustedes qué hablan Español, todo sería más fácil si pudieramos simplemente olvidar la Lengua Inglesa.  \nEn mayúsculas.\n\n\\*\\*\n\nPour ceux de vous qui parlez le français, j'étends mon grand respect et admiration, parce qu'un monde sans France serait inconcevable — Salud.\n\n\\*\\*\n\nFor sometime, right after coming to upstate New York from Lisbon, I attended English classes. The students were from all places, Japan, Chinese-Canadians, Italians and so many other good folks. The teacher, Ms. Proust was german. She spoke clean beautiful English. The first day of class, she wrote her name and asked to the students to pronounce it. Out of a dozen students I was the only one who spelled it correctly. She also said some time later that she was happy that the German language wasn't poluted by Latin. I pronounced her name correctly by a series of guessings (!) right out of my own round head.  \nFew months down the road I simply stop attending classes, because the thick accent of most of the students were actually poluting my mind, in a way that I would dislearn(?) what I already knew.\n\nI actually learned some English talking to Germans, good folks. I was lucky to have so good teachers. I did also studied English as a kid, but the course of English in a public school was more a curiosity of the teachers then actually education.\n\nI love the diccionary in the Mac OS X. I found this in there (hehe):\n\n ![](http://web.archive.org/web/20130707145549im_/http:/typophile.com/files/BE_3728.jpg)\n\nI highlighted a definition that, for my EYES has to do with what we are talking here.\n\nMy first posting in the Tipophile was \"AGL Grand Opening\" A Letterpress Shop.  \nIt is dreamy, though, but it is my vision. It seems informal, but THIS IS AN ARTIST'S VENUE and therefore appropriate.\n\n\\*\\*\n\nP.S.: I come here a couple of days after my second comment and the blog was no longer on top of the \"hottest\" list. Then I thought:\n\nOooPsss....\n\nCheers\n\nThe Small Printer\n\n"
    }
  ]
}
