{
  "id": "42970",
  "title": "Poster design critique please",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey all! Been lurking here for few weeks now and I see people giving some good advice so I decided to register. :)\n\nBasicly, we had to design a poster that would promote a pop art gallery exhibition hosted by the National Portrait Gallery, so I’ll need your opinions on what’ve created.\n\n ![](http://web.archive.org/web/20080412130255im_/http:/www.typophile.com/files/poster_6414.jpg)\n\nI used the type Century Gothic which I think looks nice and modern. As you can see I played around a lot with the character kerning to give that modern feel to it. I decided to use the fading dots on the background these were used a lot in pop art. I then got a few pop art examples by famous artists from the NPG’s gallery ( [http://www.npg.org.uk/popart/](http://web.archive.org/web/20080412130255/http:/www.npg.org.uk/popart/ \"http://www.npg.org.uk/popart/\")).\n\nCheers\n\n [‹ How to set rounded text - Illustrator](http://web.archive.org/web/20080412130255/http:/www.typophile.com/node/43068 \"Go to previous forum topic\") [[small caps usage.] ›](http://web.archive.org/web/20080412130255/http:/www.typophile.com/node/43061 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080412130255/http://www.typophile.com/user/28075\" title=\"View user profile.\">KizZ</a>",
  "time": "<br>",
  "uid": "28075",
  "comments": [
    {
      "time": " 9.Mar.2008 12.22am",
      "content": "Well..you could work on the legibility. the spaced between the words is rather large, compared to the very small/non-existent space between your letters. You should remove the the space btween the 20 & th. January is capital “J”, and I guess so is the location.\n\nTry and find a proper apostrophe for st martin’s and watch that kerning!\n\nthe design of the poster is okay overall. Nothing spectacular...but it works on the basic level. You could lessen the contrast of the purple dots in the background. I know this differs from screen to screen...so when you get it printed out make sure that the purple dots don’t make the text hard to read.\n\nHope this helps!\n\n"
    },
    {
      "time": " 9.Mar.2008 6.04am",
      "content": "<cite>«January is capital “J”, and I guess so is the location.»</cite>\n\nAll-lowercase seems to be a conscious stylistic choice here, in which case capitalisation becomes somewhat irrelevant.\n\nThe proper apostrophe is a must, though. So is using an en dash rather than a hyphen in the two cases on your poster, since they both indicate an interval. So, “11th october 2007 – 20th january 2008” and “10.00 – 18.00”, rather than “11th october 2007 - 20th january 2008” and “10.00 - 18.00”. And if you’re going to give the dash such wide spacing as you do between the dates, you need to do the same between the opening and closing hours. It would be preferable to do it the other way around, though, and reduce the space surrounding the dash between the two dates. Don’t remove it altogether, but rather than having a space character on each side of it, type it directly between “2007” and “20th” and add a bit of kerning (and then add similar kerning between the hours).\n\n&nbsp;\n\nDid you consider filling the p, o, and a of “portraits” with the orange colour used for “pop”, rather than the green colour used for “art”? That would create a somewhat more even oppositional relationship between the words, I’d think.\n\nAnd the thing that boggles my mind most of all: why are you designing a poster for an exhibition that apparently ended six weeks ago?\n\n"
    },
    {
      "time": " 9.Mar.2008 7.11am",
      "content": "If you’re going to track the letters in so tightly, you need to kern the word spaces to be equally tight.\n\n"
    },
    {
      "time": " 9.Mar.2008 10.43am",
      "content": "Thanks for your suggestions guys. The date on the poster doesn’t matter as the poster is not going to be used in the “real” world. :) It’s just the design that will be looked at.\n\n"
    },
    {
      "time": " 10.Mar.2008 12.09pm",
      "content": "Curious, where did your color palette come from? I don’t see green in any of the “example” images.\n\nAlso, you might want to consider at least 4 different artists, the POP ART movement was pretty big, I’m sure you can find lots of great examples from a plethora of artists.\n\nAs for the layout, it seems rather stodgy and conformed. I’m assuming this is for a Design 1 class, Intro to Typography, or perhaps a Layout Techniques class. So, I’ll also assume you’re still learning value design skills such as hierarchy, balance and rhythm. Using these principles will help create focal points within your poster with clear movement for your eye to scan without hitting to many visual traps. As of now, the overall color of the poster isn’t inviting, and my eye gets trapped in your “negative” cross that’s formed between your images. I can’t focus on the text as the bottom because it’s formatted in a way that’s difficult to read, and your header text is tight, using only color to determine the breaks (which gets confusing with the negative letter forms filled with a secondary color.)\n\nThis is an honest critic of what I see in your original post. I think you have room for improvement. Don’t be discouraged, it’s good to make mistakes. You learn more from them.\n\n"
    },
    {
      "time": " 10.Mar.2008 1.11pm",
      "content": "Adding to a previous comment about the dots, what about flipping them around, so the largest dots are up top, leaving more contrast for the text below?  \nAnother thing I’ve noticed, intentional or not, is one a and i are overlapping, but the other is not - d(ai)ly and portr(ai)t. It looks interesting, but it is a little hard to read.\n\n"
    },
    {
      "time": " 10.Mar.2008 1.54pm",
      "content": "Janus, No harm done, but you might want to edit your comment out and start a fresh thread devoted to your needs.\n\n"
    },
    {
      "time": " 10.Mar.2008 2.12pm",
      "content": "(This post was before Asvetic’s post. Content has been edited out and placed in [this separate](http://web.archive.org/web/20080412130255/http:/typophile.com/node/43015) thread, instead)\n\n"
    },
    {
      "time": " 10.Mar.2008 3.48pm",
      "content": "The negative spaces between the images should be smaller than the negative space between the images and the edge of the design.\n\nThe woman in the upper right is staring right out of the composition. You may want to reconsider the arrangement of the images.\n\nThe colours of the images are rather cold, dower and uninviting in contrast to the text. As per the advertising dictum; “make the product the star,”, either use different images or tone down the rest of the design so the the images stand out more.\n\n-=®=-\n\n"
    },
    {
      "time": " 11.Mar.2008 3.13pm",
      "content": "If it were my poster I would remove three of the images and just have one big image. I would also move Pop Art Portraits down to the bottom, leave the dates of the exhibition and the National Portrait Gallery on but reduce the gallery hours of operation or, better yet, remove them altogether.\n\n"
    },
    {
      "time": " 11.Mar.2008 8.52pm",
      "content": "You are taking art and colorizing it. Don’t do that, and don’t crop the images.\n\n"
    },
    {
      "time": " 12.Mar.2008 1.57am",
      "content": "Personally, I don’t think it works to kern the letters so close together while leaving the word spacing as large as it is. But I don’t think the problem can be fixed by decreasing the word spacing. So my vote goes to not kerning the letters like this.\n\n"
    }
  ]
}
