{
  "id": "42987",
  "title": "Segoe Script - Where can I purchase this from?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hi guys,\n\ncurrently developing a brand for a client - have developed 3 very cool concepts!\n\nunfortunately the client has come back with a word document using a font call 'segoe script' indicating they want to use this font.\n\naaaarrrrrrrrrrrgggggggggggghhhhhhhhhhhhhhhhhhhh!\n\nanyway, can anyone point me in the right direction to obtain this font - i cannot seem to locate it.\n\nit is a handwriting font.\n\nmike\n\n",
  "author": "<a href=\"/web/20100625024234/http://typophile.com/user/7753\" title=\"View user profile.\">mike_from_nz</a>",
  "time": "<br>",
  "uid": "7753",
  "comments": [
    {
      "time": "",
      "content": "Comes with Windows Vista.\n\n"
    },
    {
      "time": "",
      "content": "so it can not be purchased on its own then?\n\n"
    },
    {
      "time": "",
      "content": "Have them use Frutiger, Segoe is basically a Frutiger clone.\n\n"
    },
    {
      "time": "",
      "content": "it is actually the script version.\n\n ![](http://web.archive.org/web/20100625024234im_/http:/typophile.com/files/segoe_4911.gif)\n\n"
    },
    {
      "time": "",
      "content": "It seems that it’s not available from [Ascender](http://web.archive.org/web/20100625024234/http:/www.ascendercorp.com/index.html) (as I would have expected).\n\n"
    },
    {
      "time": "",
      "content": "<cite>it is actually the script version.</cite>\n\nAhh, ok. Never even seen that one.\n\n"
    },
    {
      "time": "",
      "content": "It should be included with the Microsoft Office 2007 Compatibility pack, along with the other new ClearType fonts.\n\n[Office 2007 Compatibility Pack](http://web.archive.org/web/20100625024234/http:/www.microsoft.com/downloads/details.aspx?FamilyId=941b3470-3ae9-4aee-8f43-c6bb74cd1466&displaylang=en)\n\n"
    },
    {
      "time": "",
      "content": "\\>currently developing a brand for a client - have developed 3 very cool concepts!\n\nWhat fonts did you use in the concepts? What did they like about Segoe Script that was missing from your concepts?\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": ":-ooops.\n\n(the reply to which I replied, \"ooops\" has been removed)\n\n((see, this is a good use of \"edit\"))\n\n"
    },
    {
      "time": "",
      "content": "moderator: cleanup, aisle 42987\n\n"
    },
    {
      "time": "",
      "content": "Hey Simon,\n\nCan you please list all the possible ways/places that Segoe Script is available? Does one have to install Vista on a PC to get it?\n\n"
    },
    {
      "time": "",
      "content": "Okay here goes, Segoe Script was developed by Monotype Imaging for Microsoft specifically for the Windows Vista Tablet PC help system. Previously Tablet had been using bitmaps in their help files to demonstrate the “ink UI” of the product, using a font would greatly simplify the creation and localization of these help services. The font is a contextual handwriting font, designed to be subtle rather than an out-there showcase font (like say Bickham or Zapfino). Also includes Greek and Cyrillic. Segoe Print is a non-cursive version for use where OT Layout is not available, also is slightly more legible at tiny sizes on screen. It currently only comes with Windows Vista, isn’t part of Office, the Office Compatibility pack or elsewhere.\n\nI think it makes sense to make the font available to regular users, I’ll look into this. Don’t think this will happen in time to help Mike.\n\n"
    }
  ]
}
