{
  "id": "42999",
  "title": "Webheads - A Call for Help",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Howdy Web gurus and masters of the code. I’m hoping to illicit a bit of direction from the masses on getting my web game in order.\n\nA few years ago, I designed a website, and only one website. It was a chaotic mess built mostly of images and HTML. It’s still in use, but it’s falling apart. ( [view here](http://web.archive.org/web/20081205192924/http:/www.indivijewels.net/)) _Sorry, about the front page, the client tried to make changes and messed it up something awful._ (This was not posted as a critique, just an example of my current level.)\n\nThis being my infant step into the wondrously humongous world of web, it was extremely overwhelming to me. I’m still frightened by web design, but understand that if I’m going to develop and expand as a designer, it’s an important tool to have in my arsenal.\n\nThat’s why I’m calling for help. I know that if I’m going to have a passing chance at web design, I’m going to need to understand more than making pretty images and some basic HTML. I also know I can’t rely solely on my web development software to make designs that are both web friendly and work. So, I need to at least learn CSS, if I’m going to make a run at this.\n\nI’d like to find some literature (be it web based or hard copy) that gives a no-nonsense approach to the building blocks of web design. I don’t want to learn advanced techniques until I understand the basics. Something that instills good markup and semantics would be also appreciated.\n\n [‹ Font coversion scenario](http://web.archive.org/web/20081205192924/http:/typophile.com/node/43147 \"Go to previous forum topic\") [Valentype | Declare your love for a FontFont and win the FontFont you love! ›](http://web.archive.org/web/20081205192924/http:/typophile.com/node/42119 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081205192924/http://typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 10.Mar.2008 7.32am",
      "content": "The [W3C (World Wide Web Consortium)](http://web.archive.org/web/20081205192924/http:/w3.org/) have a site that is a cornucopia of information, but it’s a bit daunting in the beginning. Ok, very daunting.\n\n[W3 School](http://web.archive.org/web/20081205192924/http:/www.w3schools.com/) are easier to approach and are aimed at _teaching_, rather than being a place to look up information.\n\nThere are literally thousands of books written on how to learn to code web design, and it’s hard to give recommendations on specific titles—try browsing through whatever your local library has and see which ones seem the best. Just make sure they’re new, ’cause (X)HTML standards and mores have evolved quite a bit over the past few years.\n\nAnd there is of course always the time-honoured way of learning: go through the source code on Web sites you like and learn from their greatness.\n\nI would suggest that you first learn XHTML (don’t bother with plain HTML, it’s still supported, but is being phased out as a recommended standard) and CSS. These two are both fairly simple and straightforward to learn, since they’re both markup languages. And of course learn them the right way to begin with: by using XHTML for structuring information, and CSS to control all layout.\n\nA very good place to get under the skin of CSS (not really to _learn_ it, but to understand it on a deeper level) is the [CSS Zen Garden](http://web.archive.org/web/20081205192924/http:/www.csszengarden.com/). Click on some of the designs on the right and see the power of CSS—the XHTML markup is precisely the same for all pages, only the CSS is changed.\n\nOnce you feel good and comfortable with XHTML and CSS, I’d suggest learning some basic JavaScript and PHP. These two languages are the two most widely used ways of creating dynamic content and database interaction, at least in \\*NIX-based server environments. In Windows-based environments, ASP is probably more common than PHP, but I’d learn PHP anyway, since it, unlike ASP, is platform-independent.\n\n"
    },
    {
      "time": " 10.Mar.2008 8.05am",
      "content": "Take a class taught by a working web designer. Learning how XHTML/CSS actually do work (as opposed to how the W3C or designers want them to work) will make life a lot easier.\n\nWhen it comes to reference works, nothing beats _Web Design in a Nutshell_ and _The Zen of CSS Design_.\n\n"
    },
    {
      "time": " 10.Mar.2008 8.10am",
      "content": "<cite>W3 School are easier to approach and are aimed at teaching, rather than being a place to look up information.</cite> Easier is best!\n\n<cite>There are literally thousands of books written on how to learn to code web design</cite> Ain’t that the truth. I’ve looked at a lot of literature and websites over the past few years. It was always difficult to know what to look at and focus on though, since I don’t have any formal web training outside of an HTML class I took 7 years ago. I didn’t know about XHTML being the better mark up language, and I’ve only recently learned of the power of CSS, but not really how to implement it.  \nI’ve read articles from [http://www.digital-web.com](http://web.archive.org/web/20081205192924/http:/www.digital-web.com/ \"http://www.digital-web.com\"), [http://particletree.com/](http://web.archive.org/web/20081205192924/http:/particletree.com/ \"http://particletree.com/\") and [http://www.sitepoint.com/](http://web.archive.org/web/20081205192924/http:/www.sitepoint.com/ \"http://www.sitepoint.com/\") but a lot of the information just went over my head.\n\n"
    },
    {
      "time": " 10.Mar.2008 8.14am",
      "content": "<cite>Take a class taught by a working web designer. Learning how XHTML/CSS actually do work (as opposed to how the W3C or designers want them to work) will make life a lot easier.</cite> This is ideal, but not realistic in my area. All the colleges/schools that offer web classes require enrollment. I can’t just take them piece meal or as extended learning. I might be able to take a weekend seminar though my work, but I’m still waiting on approval from the higher-ups.\n\n"
    },
    {
      "time": " 10.Mar.2008 8.20am",
      "content": "Hi Andrew, when learning the wonders of CSS I found this site to be a nice resource:\n\n[http://www.alvit.de/handbook/](http://web.archive.org/web/20081205192924/http:/www.alvit.de/handbook/ \"http://www.alvit.de/handbook/\")\n\n"
    },
    {
      "time": " 10.Mar.2008 8.22am",
      "content": "I recommend this book: [_Bulletproof Web Design_ by Dan Cederholm](http://web.archive.org/web/20081205192924/http:/www.simplebits.com/publications/bulletproof/).  \nEric Meyer’s [books on CSS](http://web.archive.org/web/20081205192924/http:/more.ericmeyeroncss.com/) are very good for starters, too.\n\n<cite>learn XHTML (don’t bother with plain HTML, it’s still supported, but is being phased out as a recommended standard)</cite>  \nI don’t claim that this is wrong … but it’s a little bit like saying ‘Don’t learn InDesign – learn InDesign _CS3_!’. No? ;-)\n\n"
    },
    {
      "time": " 10.Mar.2008 8.36am",
      "content": "Florian, I’ve looked at all of those books. While they seem very rich in content, and I’ve heard nothing but praise from the community. They’re way above my current skill level.\n\nNeil, that’s a massive resource. I’ll bookmark that for later scrutiny.\n\n"
    },
    {
      "time": " 10.Mar.2008 10.13am",
      "content": "<cite>«I don’t claim that this is wrong … but it’s a little bit like saying ‘Don’t learn InDesign – learn InDesign CS3!’. No? ;-)»</cite>\n\nYou’re right, that was sloppy wording. What I meant was of course that it is better to learn the HTML 4.01 Standard through the filter of the XHTML 1.0 specification, and to specify doctypes as XHTML, rather than HTML 4.01. :-)\n\nI’m still a bit miffed that they decided to only publish the _change_ in the XHTML 1.0 Specification, rather than the full thing. It’s so tiresome having to go back and forth between the HTML 4.01 specification and the XHTML 1.0 specification to check if something still applies or has been amended in XHTML 1.0. Lazy bastards, they are.\n\n"
    },
    {
      "time": " 10.Mar.2008 10.36am",
      "content": "<cite>What I meant was of course that it is better to learn the HTML 4.01 Standard through the filter of the XHTML 1.0 specification...</cite>\n\nI started going through the W3Shool on XHTML, and from I’ve gathered, it doesn’t seem too much different from HTML, other than it’s more strict in the actual coding. (which seems better practice anyway.) I’ve learned basic computer coding when I was in high school and you had to be strict or your functions wouldn’t work right. XHTML goes the route of it’s “better to be safe, than sorry.” Personally, I’d like to learn it that way, it gives more visual reasoning behind why a function (or in this instance an element) is set up, it would keep things more uniform and organized. Dot all my i’s and cross all my t’s.\n\n"
    },
    {
      "time": " 10.Mar.2008 10.45am",
      "content": "That is precisely the difference: XHTML is stricter than HTML. Sloppy coding that worked in HTML (neglecting to close tags, using semi-proprietary or even fully proprietary tags, &c.) will not fly in XHTML—at least not if you want your document to validate, which is always a good thing, though never a replacement for extensive browser testing.\n\n"
    },
    {
      "time": " 10.Mar.2008 10.56am",
      "content": "If we’re in agreement, I’ll take that as a good sign that I’m learning something.\n\nI finished the surprisingly short tutorial on XHTML (and got a 19/20 on the quiz), now I’ll move onto the CSS tutorial.\n\nEventually, I’d like to take the site I posted originally and try recreating it using XHTML and CSS (it’s all built in code from Dreamweaver MX). The site is simplistic enough that the transition shouldn’t be too difficult (though I will probably have to rebuild all the pages.)\n\nI really appreciate all the input guys!\n\n"
    },
    {
      "time": " 10.Mar.2008 11.31am",
      "content": "<cite>«Eventually, I’d like to take the site I posted originally and try recreating it using XHTML and CSS (it’s all built in code from Dreamweaver MX).»</cite>\n\nAs you guess, that shouldn’t be too hard, though you will have to rebuild every page, that’s true. If nothing else, then at the very least to get rid of that horrendous light blue text on the beige background in the `:hover` state defined for the footer links. ;-)\n\nMight I suggest waiting until you’ve grasped some basic PHP to redo the site, though? Or, alternatively, ask someone who does know some PHP to give you a hand. The `include()` function is, in my view, absolutely indispensable when making the menu system, since it enables you to define the menu in one single file and then simply include that file in every other page. That means that any site-wide changes to the menu system (or any other site-wide element, of course) can be changed once and then propagated to the entire site.\n\n"
    },
    {
      "time": " 10.Mar.2008 11.48am",
      "content": "<cite>If nothing else, then at the very least to get rid of that horrendous light blue text on the beige background in the :hover state defined for the footer links. ;-)</cite> I’m glad you pointed that out (is having a footer like that still necessary I wonder?) Honestly, I’m not a fan of the color scheme (it was selected by the client) and would love to change it. Hopefully with the addition of CSS this won’t be too difficult to do in the future (if necessary at all.)\n\n<cite>Might I suggest waiting until you’ve grasped some basic PHP to redo the site, though?</cite> Right now, I have no clue what value PHP offers to a website other than it’s used in database coding. From what you’re suggesting, it does sound like a valuable feature though. However, for this site I won’t be too concerned about having to change the menu system (or the work involved in doing it manually for all the pages.) The client hasn’t shown interest in investing in any major updates or a site wide overhaul at this point. I’m going to update it only to learn from it (since it’s available, simplistic and finished.)\n\nEthically, I don’t feel right charging the client to learn on their dime. If things go well, I’ll equal out the time invested as an educational discount and sell the updated site to the client finished. Anyway, that’s a discussion for another thread at a different time.\n\nIf you have suggestions on how I should start the update, I’m all ears.\n\n"
    },
    {
      "time": " 10.Mar.2008 11.57am",
      "content": "For the love of God, can we get BLOCKQUOTE on this damned system?\\> I know that if I’m going to have a \\>  \n\\> passing chance at web design, I’m going to need to understand more \\>  \n\\> than making pretty images and some basic HTML.\n\nBasic (i.e., Web-standards-compliant) HTML is _the most important_ thing to know.\n\n\\> I’d like to find some literature (be it web based or hard copy) that  \n\\> gives a no-nonsense approach to the building blocks of web design.\n\nThe [HTML Dog book](http://web.archive.org/web/20081205192924/http:/www.htmldog.com/book/ \"By Griffiths\") will teach you basic semantics. <cite>Designing with Web Standards</cite> by Zeldman teaches separation of structure, presentation, and behaviour (HTML, CSS, and [usually] JavaScript, respectively).\n\n\\> There are literally thousands of books written on how to learn to  \n\\> code web design, and it’s hard to give recommendations on specific  \n\\> titles\n\nIt’s very easy to give recommendations _against_ certain titles, namely most of them.\n\n\\> Just make sure they’re new, ’cause (X)HTML  \n\\> standards and mores have evolved quite a bit over the past few  \n\\> years.\n\nOnly the mores have evolved. The standards are fixed in stone, which is one of the problems. And the only evolution was from 1999 (tables and font tags) to 2000 (Web standards). We are still in the Web-standards era even if some of your friends, and Microsoft users, think otherwise.\n\n\\> And there is of course always the time-honoured way of learning: go  \n\\> through the source code on Web sites you like and learn from their  \n\\> greatness.\n\nDon’t do that unless you know up front that the developer is a standardista. _Especially_ don’t do that for JavaScript.\n\n\\> I would suggest that you first learn XHTML (don’t bother with plain  \n\\> HTML, it’s still supported, but is being phased out as a recommended  \n\\> standard)\n\nThat’s false. XHTML has no advantages whatsoever for general Web sites and many disadvantages (e.g., a single capital letter in an element name makes your whole page invalid). HTML Strict is much more forgiving yet semantically identical to XHTML.\n\nXHTML is interpreted by browsers in all cases, save for XHTML 1.1 and XHTML 1.0 served with the right MIME type, as HTML with added slashes. Repeat: XHTML is not better than HTML. They are approximately the same thing.\n\n\\> These two are both fairly simple and  \n\\> straightforward to learn, since they’re both markup languages.\n\nCSS is not a markup language.\n\n\\> A very good place to get under the skin of CSS (not really to learn  \n\\> it, but to understand it on a deeper level) is the CSS Zen Garden.\n\nThe Zen Garden [book](http://web.archive.org/web/20081205192924/http:/www.amazon.com/exec/obidos/ASIN/0321303474/joeclark-20/ \"&lsquo;The Zen of CSS Design&rsquo;\") is a good visual place to start.\n\n\\> Take a class taught by a working web designer. Learning how  \n\\> XHTML/CSS actually do work (as opposed to how the W3C or designers  \n\\> want them to work) will make life a lot easier.\n\nThe way the W3C wants them to work is generally the way they do work in all browsers that aren’t called Internet Explorer. While you were sleeping, Web standards took over.\n\n\\> You’re right, that was sloppy wording. What I meant was of course  \n\\> that it is better to learn the HTML 4.01 Standard through the filter  \n\\> of the XHTML 1.0 specification, and to specify doctypes as XHTML,  \n\\> rather than HTML 4.01. :-)\n\nWrong in practice.\n\n\\> I’m still a bit miffed that they decided to only publish the change  \n\\> in the XHTML 1.0 Specification, rather than the full thing. It’s so  \n\\> tiresome having to go back and forth between the HTML 4.01  \n\\> specification and the XHTML 1.0 specification to check if something  \n\\> still applies or has been amended in XHTML 1.0. Lazy bastards, they  \n\\> are.\n\nBecause next to nothing was invalidated. XHTML _is_ HTML with self-closing tags, an all-lower-case requirement, quoted attribute values, and a small list of additional minor differences (like valid entity names, few of which come up in Unicode documents).\n\n\\> I started going through the W3Shcool on XHTML, and from I’ve  \n\\> gathered, it doesn’t seem too much different from HTML, other than  \n\\> it’s more strict in the actual coding.\n\nThat’s not entirely true. It’s more accurate to say that HTML, even Strict HTML, is more permissive. For example, you can leave off `</p>` in most cases, and many elements, even HTML and BODY, just aren’t needed at all.\n\nNonetheless, you can write an HTML document (any flavour) with all its tags closed and all its attribute values quoted and all its element names in lower case. At that point, almost certainly the only difference between that an an equivalent XHTML document is self-closing tags.\n\n\\> That is precisely the difference: XHTML is stricter than HTML.\n\nFalse. HTML and XHTML both have document-type definitions, i.e., both have rules. Transitional and Strict document types constitute another subset of rules.\n\n\\> Sloppy coding that worked in HTML (neglecting to close tags, using  \n\\> semi-proprietary or even fully proprietary tags, &c.) will not fly  \n\\> in XHTML—\n\nFalse some of the time. There are many HTML elements that don’t have to be closed, including P, LI, HTML, and BODY. _Only_ the elements in the spec may be used for all HTML and XHTML documents, though technically you can define your own elements for XHTML. (Ask me about `embed` sometime.)\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20081205192924/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 10.Mar.2008 1.19pm",
      "content": "<cite>«For the love of God, can we get BLOCKQUOTE on this damned system?»</cite>\n\nYes, please. Or at the very least set the `cite` elements properly apart from other text.\n\n&nbsp;\n\n<cite>«Only the mores have evolved. The standards are fixed in stone, which is one of the problems. And the only evolution was from 1999 (tables and font tags) to 2000 (Web standards). We are still in the Web-standards era even if some of your friends, and Microsoft users, think otherwise.»</cite>\n\nYou’re right, of course. What I should have said was that mores and descriptions of the standards in web design books have changed, not the standards themselves. Even in books that are no more than three or four years old, it’s not uncommon to see authors advising _against_ using CSS properly and using tables to create layout.\n\nAnd what does “some of your friends” refer to?\n\n&nbsp;\n\n<cite>«CSS is not a markup language.»</cite>\n\nI wasn’t aware of that. I thought stylesheet languages were considered a subset of markup languages, actually. What I meant by that comment, though, was that both (X)HTML and CSS have very simple and limited syntax components, compared to most scripting or programming languages.\n\n&nbsp;\n\n<cite>«The way the W3C wants them to work is generally the way they do work in all browsers that aren’t called Internet Explorer.»</cite>\n\nThat’s a bit Utopian, isn’t it? So far, to my knowledge, no other browser than Safari WebKit Nightly r30881 has even managed to reach the 90 per cent mark in the ACID3 test. And even for simple, normal, validating XHTML pages, there are plenty of small bugs that creep up, though to be fair, some of those represent gaps in the specifications, rather than aberrant browser behaviour.\n\n&nbsp;\n\n<cite>«Wrong in practice.»</cite>\n\nHow do you mean, “in practice”? It’s still not worded very well, but I don’t see why it’s any more wrong in practice than in theory.\n\n&nbsp;\n\n<cite>«Because next to nothing was invalidated. XHTML is HTML with self-closing tags, an all-lower-case requirement, quoted attribute values, and a small list of additional minor differences (like valid entity names, few of which come up in Unicode documents).»</cite>\n\nThat doesn’t mean the entire Recommendation shouldn’t be available as a single document. Laws are constantly amended, small bits at a time, but that doesn’t mean the original document should not be updated whenever such an update takes place. Most commonly, unfortunately, they are not; but that does not mean they shouldn’t be.\n\n&nbsp;\n\n<cite>«False. HTML and XHTML both have document-type definitions, i.e., both have rules.»</cite>\n\nAnd the rules in XHTML impose more restrictions or demands on the layout of the document than the rules in HTML do, whether we’re talking Strict, Transitional, or Frameset. I would call that being stricter, or more restrictive.\n\n&nbsp;\n\n<cite>«False some of the time. There are many HTML elements that don’t have to be closed, including P, LI, HTML, and BODY. Only the elements in the spec may be used for all HTML and XHTML documents, though technically you can define your own elements for XHTML.»</cite>\n\nI’m not sure how that makes what I said false some of the time?\n\nBy “work”, I was referring to validation, not actual browser behaviour, which is of course a topic entirely divorced from validation. Failing to close a `p` tag in HTML will not cause the page not to validate; it will in XHTML. I don’t consider that a disadvantage, by the way, in the same way that I don’t consider JavaScript’s permissiveness compared to many other scripting languages to be an advantage. If anything, the permissiveness is the disadvantage.\n\n"
    },
    {
      "time": " 10.Mar.2008 1.46pm",
      "content": "XHTML doesn’t say anything about “the layout of a document.”&nbsp;HTML doesn’t, either.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20081205192924/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 10.Mar.2008 2.05pm",
      "content": "Well, what’s a better word for it, then? The … physical shape? No. The way the document is built? No.\n\nThe word I’m thinking of (which fits perfectly) is _udformning_, but I can’t think of a proper English word for it, if there is one. Something like the way that each element in the whole of the document is expressed/typed/put. Or something.\n\nWhen typing an element in an XHTML document, there are tighter restrictions that must be adhered to than when typing an element in an HTML document. Thus, XHTML is more restrictive than HTML. That’s the best way I can word it.\n\n"
    },
    {
      "time": " 10.Mar.2008 2.12pm",
      "content": "<cite>udformning</cite>\n\nI suppose in Swedish this means more than just “design”.\n\n"
    },
    {
      "time": " 10.Mar.2008 2.15pm",
      "content": "It doesn’t mean anything in Swedish (where it would be _utformning_). ;-)\n\nBut in Danish, yes, it means more than ‘design’. In fact, it rarely means just ‘design’. It’s more to do with the structural form, design, and order of the individual components that make up a larger whole.\n\n"
    },
    {
      "time": " 11.Mar.2008 6.51am",
      "content": "“That is precisely the difference: XHTML is stricter than HTML. “\n\nNot really. You can have strict OR loose HTML OR XHTML.\n\nXHTML is simply HTML that follows the XML standard. As for learning one or the other, there really isn’t much of a difference. Most would argue that there’s little point in using XHTML these days \\*unless\\* you have a specific need for your HTML to be XML compliant.\n\nBut, yea...in summary, the key to understanding any medium is to understand the tools and process. That’d be HTML and CSS to begin with. Add some Javascript, Flash and back end stuff to taste.\n\nI’d forgo a tech-school class. Most of them will teach you DreamWeaver and not really teach you HTML.\n\nIt’s not rocket science...but it can take some time. As stated, the biggest hurdle will be fighting the Microsoft flavored web browser rendering engines (though with IE8 on the horizon, we may FINALLY be reaching a point where that’s a moot issue in the next several years).\n\n"
    },
    {
      "time": " 11.Mar.2008 7.21am",
      "content": "Can someone answer this question then,\n\nIf HTML is the content on the page, and CSS is the style on that content, which controls the layout/location of that content?\n\n"
    },
    {
      "time": " 11.Mar.2008 8.01am",
      "content": "<cite>«Not really. You can have strict OR loose HTML OR XHTML.»</cite>\n\nLike I already said, I wasn’t referring to flavours.\n\n&nbsp;\n\n<cite>«(though with IE8 on the horizon, we may FINALLY be reaching a point where that’s a moot issue in the next several years)»</cite>\n\nI wish I shared your positivism, but I fear a, “Keep dreaming” is more in order.\n\n&nbsp;\n\n<cite>«If HTML is the content on the page, and CSS is the style on that content, which controls the layout/location of that content?»</cite>\n\nHow do you mean?\n\n"
    },
    {
      "time": " 11.Mar.2008 8.11am",
      "content": "<cite>If HTML is the content on the page, and CSS is the style on that content, which controls the layout/location of that content?</cite>\n\nCSS does. It can be used to ‘style’ elements – to specify colours, fonts, borders, background-colours, background-images, all kinds of typographic formatting etc pp.  \nBut you can also arrange the elements with CSS – define the size, the margins, the padding, whether they are ‘inline’ or ‘block’ (whether they trigger a new line or not), even the exact position within the viewport.  \nDoes that answer your question?\n\nF\n\n"
    },
    {
      "time": " 11.Mar.2008 8.17am",
      "content": "<cite>«If HTML is the content on the page, and CSS is the style on that content, which controls the layout/location of that content?»</cite>\n\nHow do you mean?\n\nThis is what’s really confused me about web design, the actual visual layout of the data and how the code controls that layout. The WYSIWYG end of web design. I know I can set up a row of images and buttons and text boxes with HTML, but apparently (from what I’ve gleaned) it’s better to do it in CSS, which could change the layout on the fly if need be. So, from a visual design perspective, understanding CSS would be more beneficial than HTML. Correct?\n\n"
    },
    {
      "time": " 11.Mar.2008 8.31am",
      "content": "<cite>«I know I can set up a row of images and buttons and text boxes with HTML, but apparently (from what I’ve gleaned) it’s better to do it in CSS, which could change the layout on the fly if need be. So, from a visual design perspective, understanding CSS would be more beneficial than HTML. Correct?»</cite>\n\nI’m still not entirely sure what you mean. You can’t understand only _either_ HTML _or_ CSS. Well, you can, of course, but it won’t do you much good.\n\nIn your example, you would define a sequence of images, buttons, and text boxes in HTML. In HTML, you would specify at which logical point in the undisrupted flow of the document each of these elements comes, as well as the source of the images, whether the buttons were selected by default, and whether any text appears in the text boxes when the page is loaded.\n\nAfter you had done this, you would create a CSS file that contains information on how these elements should be presented: should the images have borders, what should the background colour of the text boxes be, should they all appear on one long line or each with their own line, &c.\n\n"
    },
    {
      "time": " 11.Mar.2008 9.04am",
      "content": "I think Asvetic has identified a key point on the web design learning curve here, and one that colleagues and I have had problems with. This is how I see many individuals grasp of HTML/CSS develops (I’m writing quickly between jobs so hope it makes sense):\n\nOne discovers early on that writing HTML \\*does\\* determine both layout and appearance of a document - because browsers have inbuilt stylesheets, invisible to the user, thus ways of rendering it.\n\nThis confuses right from the start by conflicting with the “correct” model of HTML being purely structural.\n\nRe Oisin above, the buttons, images and text would show up in the right place on screen with no use of CSS at all.\n\nCSS is then found to be a convenient way of globally specifying fonts and colours, maybe margins, but not much more - it’s a fairly superficial layer which \\*adds\\* to the appearance of plain HTML.\n\nPeople often find that more complete uses of CSS fail to render as they expect, so abandon further experimentation. For example, trying to lay out complex forms. Or when trying to put together an HTML email. Tables-for-layout work better for both, so are seen as a reliable method, and the individual’s understanding of the HTML+CSS model stalls - this is why they are sometimes seen as alternatives.\n\nI think use of ’reset’ stylesheets can help with this by eliminating the inbuilt browser styling.\n\n"
    },
    {
      "time": " 11.Mar.2008 9.22am",
      "content": "So a better analogy could be HTML is the skeleton, nervous system, and all the organs (where they’re located mostly) and CSS is the skin and hair and color of the organs and blood. Depending on how the HTML is set up, I could have a foot where my hand is, and a heart where my brain is. CSS doesn’t control this, but it controls how tan my skin is and how far set my eyes and ears are.\n\nHTML is the broad layout, and CSS is the nudged version of that layout. And if I create the website with this in mind, HTML, then CSS... that would render a more exact visual design.\n\n"
    },
    {
      "time": " 11.Mar.2008 9.36am",
      "content": "Print design is you take the content, and visually lay it out on the page. You end up with a single piece in the end.\n\nWeb design is you take the content, format it so it’s \\*meaningfullly\\* organized, and then you lay it out/style it for a particular display.\n\nIn otherwords, the ’content’ of HTML may be used in many different ways, so it’s important that it has some structure and meaning to it ’in the raw’.\n\nFor example, it may be shown in a visual web browser on your computer. It might be read to someone via an aural web browser. Some folks might parse the content sans any style. Someone might view it via their handheld device. Someone might be programmatically accessing the raw content (ie, google).\n\nIt’s a bit like architecture. You can’t ’WYSIWYG’ a house plan very efficiently. Unless you dive into the framing and plumbing and elecrtical BEFORE you start randomly laying out rooms and picking out wallpaper, it won’t be a very efficient product in the end.\n\n“One discovers early on that writing HTML \\*does\\* determine both layout and appearance of a document - because browsers have inbuilt stylesheets, invisible to the user, thus ways of rendering it.”\n\nThat’s not the HTML determining that. That’s that one particular web browser’s default rendering of the HTML. I think you’re saying the same thing, but be careful stating it’s the HTML making that decision (as you state, it’s the browser’s built in style rendering).\n\n“So a better analogy could be HTML is the skeleton, nervous system, and all the organs (where they’re located mostly) and CSS is the skin and hair and color of the organs and blood.”\n\nIt’s hard to find a specific analogy that works well for this, but if I had to try:\n\nHTML = the movie script  \nCSS = directing, cinematography, acting, set design, etc.\n\n“HTML is the broad layout, and CSS is the nudged version of that layout.”\n\nNo, HTML is the pure content. CSS is the rest.\n\n"
    },
    {
      "time": " 11.Mar.2008 9.45am",
      "content": "Geez, we’re getting to far off the path. I understand that designing for web isn’t like designing for print. Prints more absolute, what you see IS what you get. Where designing for web, you can put the elements into places and hope that the format of your code keeps them there, but depending on who views it that will most certainly change. There are too many variables to create a single definite design and expect it to stay that way.\n\nIt’s something to keep into consideration when creating a design, but I just want to learn how to recreate my vision in web media. The syntax and the semantics of web design go over my head like low flying aircraft.\n\nSorry, I appreciate you guys running with the ball, but I have to pull the reigns in on this thread, you’re loosing me.\n\n"
    },
    {
      "time": " 11.Mar.2008 10.06am",
      "content": "\\> If HTML is the content on the page, and CSS is the style on that content, which controls the layout/location of that content?\n\nActually, the hardest part of a web designers job is to realize that the user controls much more than the designer does (in the true spirit of HTML).\n\nThe user decides the size of the page, always. He can change the size of the window, and gets to choose what resolution the monitor is at.\n\nThe user gets to decide on the size of the type, ideally (if the designer is savvy enough to use ems, % or another scalable size, and not fixed dimensions like points or pixels.) Some people need larger type to read clearly they should be able to do so with the browser controls that allow for larger type.\n\nThe user can even control the default typeface, which is pretty terrifying to the print designer. If I want my default sans to be Comic Sans, and my default serif to be Algerian, I should be able to do so (although I would probably be able to be certified insane for doing so). Then all I have to do is get rid of the rest of the fonts on my system to see all your pages in their prime ugliness.\n\nLearning these limitations exist, and then learning to design around them are the hardest parts of making the jump from print to web.\n\n"
    },
    {
      "time": " 11.Mar.2008 10.12am",
      "content": "<cite>«Then all I have to do is get rid of the rest of the fonts on my system to see all your pages in their prime ugliness.»</cite>\n\nOr use a browser that allows user styles to override page styles, so that _all_ text on any page on the Internet is rendered in Comic Sans or Algerian.\n\nAnd _then_ you can scoot right along to the insane asylum, ’cause that would drive anyone up the walls in a day.\n\n"
    },
    {
      "time": " 11.Mar.2008 11.10am",
      "content": "“It’s something to keep into consideration when creating a design, but I just want to learn how to recreate my vision in web media. The syntax and the semantics of web design go over my head like low flying aircraft.”\n\nWell, you might be loosing us too. Is your aim to learn the syntax and semantics? If not, then the best way to ’recreate your vision’ is to team up with someone that can do that back end stuff for you. Might be the least painless/most effective path. I do that for a handful of very talented print/visual designers that just didn’t have the need/want to dive into the back end space.\n\nOtherwise, if you do want to learn the syntax and semantics, I’d suggest looking at it from a slightly different angle. Get the semantic content down/in-place first (the HTML) and then build your vision from that.\n\nIn otherwords, don’t start with the photoshop mock-up. Start with the content.\n\n“Actually, the hardest part of a web designers job is to realize that the user controls much more than the designer does”\n\nYep. My favorite way to explain it:\n\nprint design = you dictate the visual design  \nweb design = you’re just suggesting a visual design\n\n"
    },
    {
      "time": " 11.Mar.2008 12.09pm",
      "content": "This should help to put all of the above into perspective:\n\n ![](http://web.archive.org/web/20081205192924im_/http:/typophile.com/files/design1_6444.jpg)\n\n"
    },
    {
      "time": " 11.Mar.2008 12.19pm",
      "content": "<cite>Well, you might be loosing us too. Is your aim to learn the syntax and semantics? If not, then the best way to ’recreate your vision’ is to team up with someone that can do that back end stuff for you. Might be the least painless/most effective path. I do that for a handful of very talented print/visual designers that just didn’t have the need/want to dive into the back end space.</cite>\n\nI want to learn, I want to understand the developer’s end. Knowing the capabilities of web design will help me make decisions within a design. I’d be designing smarter.\n\nEvery now and then I get into these web learning kicks, and every time I get overwhelmed and eventually loose interest/focus. The unstructured approach and not knowing where to start doesn’t help either. I figure if I can learn and create sites with the basic understandings of the web, then adding to that would be natural. I was hoping I’d get responses from people that went through what I’m going through and would respond with their experiences/suggestions.\n\nI appreciated the replies. When Janus suggested learning XHTML would be a better approach then learning the more forgiving and looser HTML 4, I thought that was a wise suggestion... then the debates started.\n\nPerhaps I should have asked a question like this:  \n**If YOU had to teach someone how to do web design/development, what would your teaching outline look like? Where would you start and what would come next?**\n\nRegardless, I’m going to follow the HTMLdog tutorials. It’s definitely shorter (and less overwhelming) than the books I’ve seen. Hopefully, by the end of the tutorials I’ll understand enough HTML and CSS to be able to take my original site and rebuild it (or at least optimize the code better.)\n\n"
    },
    {
      "time": " 11.Mar.2008 12.28pm",
      "content": "I did teach HTML, for about 10 years. I always started with a course in HTML, hard coding with Notepad (or the Mac text editor of your choice). CSS was a second course, and then, after the students knew code, they were introduced to Dreamweaver and FrontPage (this was back when the latter had a trace of relevance.)\n\nWithin the HTML portion, we spent considerable time building pages that were dynamic ... in other words, they would be workable at any size then current (640x480 was the minimum at that time, and later 800x600 was the minimum). The max was what the monitors at any time would take. I remember changing the screen background image so that it contained boxes of 640x480 and 800x600 as well as full screen so that the students would reduce their browser windows to those dimensions to see how the page would look to folk with older computers.\n\nThe other big concern I remember at that time was that pages had to work correctly in both the current IE and Netscape (today it would be IE and Firefox). The only other browser at that time with much share was Opera, but such a small usage that it could be safely ignored.\n\nOne thing I didn’t do at that time, that I would now, is to insist on validated code. Anyone wanting to submit invalid code would have to supply me with an essay explaining why the end results justified the invalid code.\n\n"
    },
    {
      "time": " 11.Mar.2008 12.37pm",
      "content": "<cite>Anyone wanting to submit invalid code would have to supply me with an essay explaining why the end results justified the invalid code.</cite> What would invalid code be considered, is that the same as deprecated code?\n\n"
    },
    {
      "time": " 11.Mar.2008 1.00pm",
      "content": "“If YOU had to teach someone how to do web design/development, what would your teaching outline look like? Where would you start and what would come next?”\n\nGood question.\n\nNot an entire course, but specifically the process to build an HTML page:\n\n1) Get the content. All of it.  \n2) How to mark it up with HTML in a semantic manner and talk about issues like SEO and Accessibility.  \n3) How to layout out the page structure via CSS (and adding the necessary additional HTML as needed).  \n4) How to now bring your visual layout (photoshop mockup) into the mix.  \n5) Polishing it all up adding the images, typography, color, to the CSS file.  \n6) Now let’s talk about why it looks like crap in IE and how to fix it. ;o)\n\n“What would invalid code be considered, is that the same as deprecated code?”\n\nInvalid code is code that doesn’t validate:\n\n[http://validator.w3.org/](http://web.archive.org/web/20081205192924/http:/validator.w3.org/ \"http://validator.w3.org/\")\n\nThe closest analogy I can think of is pre-press flight checking.\n\nDeprecated code is usually something that has been replaced with something ’newer and better’ though the ’better’ part can often be debated. ;o)\n\n"
    },
    {
      "time": " 11.Mar.2008 1.14pm",
      "content": "<cite> “1) Get the content. All of it.” </cite>  \nCheck\n\n<cite> “2) How to mark it up with HTML in a semantic manner and talk about issues like SEO and Accessibility.” </cite>  \nI think I understand the idea of semantic coding (it’s using the simplest code elements to describe the content). I don’t know what SEO is. Accessibility is coding for the disabled right, like putting in descriptions for images?\n\n<cite> “3) How to layout out the page structure via CSS (and adding the necessary additional HTML as needed).” </cite>  \nThis is what I’d really like to learn.\n\n<cite> “4) How to now bring your visual layout (photoshop mockup) into the mix.” </cite>  \nI assume this is where Dreamweaver comes into play.\n\n<cite> “5) Polishing it all up adding the images, typography, color, to the CSS file.” </cite>  \nAgain, understanding CSS is still a major hurdle for me.\n\n<cite> “6) Now let’s talk about why it looks like crap in IE and how to fix it. ;o)” </cite>  \nThe FEAR is almost crippling.\n\n"
    },
    {
      "time": " 11.Mar.2008 1.44pm",
      "content": "SEO=Search Engine Optimization.\n\n"
    },
    {
      "time": " 11.Mar.2008 1.51pm",
      "content": "“I think I understand the idea of semantic coding (it’s using the simplest code elements to describe the content).”\n\nIt’s more about using the proper markup.\n\n“I don’t know what SEO”\n\nSemantic markup can help with Search Engine rankings.\n\n“Accessibility is coding for the disabled right”\n\nIt’s a bit broader than that. It’s more about making sure your content is accessible by a wide range of people and devices. But, in a nutshell, yes, it’s related to things like the ADA.\n\nUltimately, it sounds like you really just need to start diving into CSS. Here’s some good books on it:\n\n[http://simplebits.com/publications/](http://web.archive.org/web/20081205192924/http:/simplebits.com/publications/ \"http://simplebits.com/publications/\")\n\n"
    },
    {
      "time": " 12.Mar.2008 11.53am",
      "content": "I like the Tizag Tutorials [http://tizag.com/](http://web.archive.org/web/20081205192924/http:/tizag.com/ \"http://tizag.com/\") Most tutorials confuse me even more but these are so easy to follow. -Jess\n\n"
    },
    {
      "time": " 12.Mar.2008 1.02pm",
      "content": "\\> What would invalid code be considered, is that the same as deprecated code?\n\nBasically, there are times that invalid code makes sense, perhaps in relation to javascript or other tools. I remember the W3 validator refusing to accept a link that was used on a site (due to the ? and # stuff within in). The sys admins were quite happy with their invalid links, and a mere designer could not force them to change their minds.\n\nMy goal as a teacher is (was?) to make the student validate the code, and correct anything that can be corrected. But in some cases invalid code is needed. I was trying to create designers, not autocrats.\n\n"
    },
    {
      "time": " 13.Mar.2008 9.06am",
      "content": "microspective, that chart speaks right out of my heart!\n\n"
    },
    {
      "time": " 13.Mar.2008 5.13pm",
      "content": "I was just like you two years ago, Asvetic. Back then, I used to save web pages a lot so i can analyse the source code (both html and css) locally. And looking at CSS ZenGarden is a must at that time.\n\nSo, my advice is: save web designs that you think awesome, then try to imitate it (it’s normal for beginners). You’ll learn faster when you like it. Of course, always keep “the manual” at hand so you can quickly find out about unfamiliar tags.\n\nThen, just exercise often. Try designing from scratch (writing code by hand) without Dreamweaver’s scripting aid.\n\nActually, I’m still just like you. Still learning about the new features of CSS3. :-)\n\n"
    },
    {
      "time": " 14.Mar.2008 12.04am",
      "content": "I find that it is not much different than how type was spec’d back in the olden days of yore. You have your type-written page of text, with notes written on it about how wide the columns are to be, what kind and size of font, what kind of alignment, etc.\n\nWith HTML and CSS, the HTML is the typed out page of text, and the CSS is the notes telling the browser how to set it.\n\nEasy as that.\n\n"
    },
    {
      "time": " 16.Mar.2008 6.38am",
      "content": "Don McCahill’s post about the occasional need for invalid code is incorrect (save for embed, which you can make valid by XHTML) and can be safely ignored. In fact, the only way to stay safe _is_ to ignore it.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20081205192924/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 17.Mar.2008 7.53am",
      "content": "This weekend, I had a good buddy (and webhead) walk me through a simple CSS layout. He used the [http://csstinderbox.raykonline.com/?page\\_id=12] center box template to help illustrate things.\n\nThings are starting to make more sense to me now. I’m definitely a visual learner, so this walk-through was a major eye-opener. He used a program called CODA to help illustrate things better, sadly it’s a MAC only program (I use a PC). I think I understand div and class better and he illustrated padding, margin and borders, explaining the Box Model more clearly. I loosely equated it to the stroke palette in illustrator.\n\nSurprisingly, he didn’t know that you could use em and % for padding and margins. This was an easy concept for me to understand (thanks to understanding EM and EN widths in type). However, we’re not sure what the base is, or what 100% or 1em is equal to. (I assume it’s the browser’s default text size, which is usually Medium/ 16 pt/px, right?) I do recall reading something about if a container is in another container, then that is the new base. This concept sounds confusing, especially if there are several layers of containers.\n\nNow all I need to learn is how to add rounded corners and rollover buttons that are CSS adapted, and I should be able to redo that website.\n\n"
    },
    {
      "time": " 17.Mar.2008 8.06am",
      "content": "<cite>I’m definitely a visual learner, so this walk-through was a major eye-opener.</cite>\n\nThese two Firefox add-ons will make your learning even easier:  \n [Firebug by Joe Hewitt](http://web.archive.org/web/20081205192924/https:/addons.mozilla.org/de/firefox/addon/1843) and [Web Developer by Chris Pederick](http://web.archive.org/web/20081205192924/https:/addons.mozilla.org/de/firefox/addon/60).  \nStrongly recommended. :-)\n\n"
    },
    {
      "time": " 17.Mar.2008 1.15pm",
      "content": "Actually, you can easily found tons of CSS tutorials scattered on the internet these days. But maybe you might want to browse A List Apart’s archives for articles like [this one](http://web.archive.org/web/20081205192924/http:/www.alistapart.com/articles/howtosizetextincss).\n\nIn addition to the above Firefox add-ons, I also used [this](http://web.archive.org/web/20081205192924/https:/addons.mozilla.org/en-US/firefox/addon/4111) and [this](http://web.archive.org/web/20081205192924/https:/addons.mozilla.org/en-US/firefox/addon/2104).\n\nGlad you’re doing well Asvetic. :)\n\n"
    }
  ]
}
