{
  "id": "43018",
  "title": "typefaces and what they tell us",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi fellow type addicts.\n\nI am doing a Research Project for my honors in Communication Design and I am interested in looking closely at some typefaces, and the messages they carry. After watching \"typomania\" from Erik Spiekermanns blog, I have become rather interested in the subject, investigating the kind of message a certain type style carries.  \nI am wondering if you can help me for a list of some decent research material for this topic, be it articles, videos, pdfs, books etc.\n\nThanks in advance!\n\n",
  "author": "<a href=\"/web/20100515125509/http://typophile.com/user/13653\" title=\"View user profile.\">victor ivanov</a>",
  "time": "<br>",
  "uid": "13653",
  "comments": [
    {
      "time": "",
      "content": "Have you watched [Helvetica?](http://web.archive.org/web/20100515125509/http:/www.helveticafilm.com/) There may not be a better work on this topic. Kai Bernau’s thesis [Neutral](http://web.archive.org/web/20100515125509/http:/www.letterlabor.de/book.php) is also a great read on this subject, albeit in a very roundabout way.\n\n"
    },
    {
      "time": "",
      "content": "There's been a great deal written and spoken in the last few months about the typefaces chosen by the US presidential candidates. Obama has received a great deal of praise from the design-world for his consistent use of Gotham, whereas Hillary Clinton's identity has been seen as very old-fashioned. It might be an interesting starting point to think about how a typeface can help or hinder someone running for political office.\n\n"
    },
    {
      "time": "",
      "content": "Thanks James, I'll see if I can find Helvetica in local stores or at library.  \nUnfortunately I don't have a credit card, so limited to in-store purchases/library.\n\nFeeltheKern : do you have any links to those discussions?\n\n"
    },
    {
      "time": "",
      "content": "Vic:\n\nThese threads contain discussions on presidential branding, as well as links to discussions on other blogs (found by googling \"Obama\" on typophile):\n\n[http://www.typophile.com/node/31338](http://web.archive.org/web/20100515125509/http:/www.typophile.com/node/31338 \"http://www.typophile.com/node/31338\")  \n [http://www.typophile.com/node/42054](http://web.archive.org/web/20100515125509/http:/www.typophile.com/node/42054 \"http://www.typophile.com/node/42054\")  \n [http://www.typophile.com/node/40583](http://web.archive.org/web/20100515125509/http:/www.typophile.com/node/40583 \"http://www.typophile.com/node/40583\")  \n [http://www.typophile.com/node/35349](http://web.archive.org/web/20100515125509/http:/www.typophile.com/node/35349 \"http://www.typophile.com/node/35349\")\n\n"
    },
    {
      "time": "",
      "content": "Certainly, typefaces tell design professionals something, but they have no inherent meaning for the non-professional reader, who only notices the most broad distinctions of genre, such as [scripts/a\\>.](http://web.archive.org/web/20100515125509/http:/www.shinntype.com/Writing/Scriptom.pdf)\n\n"
    },
    {
      "time": "",
      "content": "Thanks for all the input!\n\nNick, do you not think that type of different styles has different connotations, in regards to the nature of the product it is placed on.\n\n"
    },
    {
      "time": "",
      "content": "I definitely agree with Nick that most people aren't going to be able to tell Univers from Helvetica, or even Garamond from Times New Roman. The general population doesn't think too much about type, but has an innate feel for its various connotations. With Nick's script example, I'd say your average person could break scripts down into smaller groupings -- fancy wedding scripts, handwritten cursive, 50s brush scripts -- but wouldn't be able to talk much about the finer points of what differentiated them. And if you asked them to look at a bunch of fonts that all qualified as ornate Spencerian scripts, or \"wedding scripts,\" they'd have a hard time telling the difference. Almost everyone would have no trouble picking out their favorite, though -- very few could articulate why, but that never prevents people from having strong opinions.\n\n"
    },
    {
      "time": "",
      "content": "_Nick, do you not think that type of different styles has different connotations, in regards to the nature of the product it is placed on._\n\nNo, not for the reader.  \nBut it does have connotations for the typographer, which provide ideas for the way in which the type may be set, and the layout arranged, interacting with the other elements.  \nIt's only when all the design variables are determined that the piece as a whole acquires a meaning that can effect the reader.\n\nFor instance, the same typeface may look old-fashioned or trendy, depending on what kind of a project its used in, and how it's set.  \nA typeface that looks friendly and inviting can become menacing, by increasing its size and reducing its leading, or changing its colour or tone.\n\nIf typefaces have \"product connotations\", how is it that so many typefaces can be used for many different kinds of products and readerships?\n\n"
    },
    {
      "time": "",
      "content": "Pieces of clothing is a good analogy. Some of them have connotation within context only, and some of them (more \"extreme\", creating a very specific association) even without context.\n\n"
    },
    {
      "time": "",
      "content": "But what about, for instance, the very \"extreme\" type form of blackletter?  \nWhat connotation does that have without context?\n\n"
    },
    {
      "time": "",
      "content": "well, what about logos/corporate identity?  \nfor instance, if you were to create a visual style system for an established business, like an old winery for instance? I personally would consider using a typeface that has a Roman feel to it, something with serifs that resembles old inscriptions.  \nHowever when thinking about fashion magazine, i would consider something modern, perhaps something that resembles bodoni.  \nIs it just me?  \nAnd if that is true, what would you suggest i research, in order to become more obsessed with type, and gain a greater knowledge of it?\n\nthanks\n\n"
    },
    {
      "time": "",
      "content": "Blackletter might be an interesting case study, because it has so many different meanings throughout history. I doubt medieval monks ever imagined blackletter would be co-opted by LA thugs. While it has all these different connotations, there might a running thread of things that are very serious, like words that you want to present before the eyes of god -- in this way, an illuminated Bible is similar to a \"thug life\" tattoo, because they're all about being \"official.\"\n\n"
    },
    {
      "time": "",
      "content": "There was a magazine designer who spoke at a journalism design conference that I went to. He created something like 20 different thought bubbles with the word \"hello\" in them.\n\nWhen set in 20 different typefaces, they all had enough personality to tell what the speaker's \"voice\" was. This one is a 16-year-old girl, this one is a sophisticated French woman, this one was an athelete, and so on.\n\nAdmittedly, most were \"display\" faces, but the same principle, I feel, works its way all the way down to the text faces.\n\n"
    },
    {
      "time": "",
      "content": "You know, while the average reader won't know what distinguishes a 70's typeface, they sure as hell can spot one. That's the thing: the average reader will get a feel for the lettering the same way we can quickly tell how heavy something is going to be.\n\n"
    },
    {
      "time": "",
      "content": "Being able to describe a difference accurately and being affected by a difference are two different things. While I will certainly concede that the non-type professional reader will not be able to describe much about differences in type, they may still be affected by it and not perceive why. The type is just part of the whole communication piece. The type's success or failure to take part in the communication is subject to how well the whole job was done, writing, concept, layout, placement, delivery method, and audience. The skill of the graphic designer or typographer will make or break it. If you have great tires on a racecar that breaks down in a race you won't win or even know if the tires would have done their job well.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I think Nick is right about context. You can put a 1970's typeface in a modern setting and it implies something very different than if you set in in a \"period\" piece.  \nOn another level from my reading here I understand that the best text faces are invisible. They don't speak, they whisper.\n\npbc\n\n"
    },
    {
      "time": "",
      "content": "_Admittedly, most were “display” faces, but the same principle, I feel, works its way all the way down to the text faces._\n\nBut surely this absence/presence of personality is the very distinction between the way that text and display types work? Readers can spot the personalities in display types, for they have the kind of noticeable idiosyncracies that are removed from text faces, both because one wants these to have a broad and generic usage and not filter the neutrality of prose that is objectively written, or imply character when called upon in successive paragraphs to represent quotes from quite different people; and secondly because peculiarities are considered to draw attention to themselves and disrupt the immersive reading experience. If the faces presented to the readers had been Minion, Times, Utopia, Quadraat, etc., I doubt the spread of personalities would have been so broad and obvious, and suspect that such traditional serifed faces would have all suggested the character of someone who is serious, bookish, and old-fashioned.\n\n"
    },
    {
      "time": "",
      "content": "Let's talk children's books for a minute. One might think that Century Schoolbook is a boring mechanical typeface designed to help us learn how to read, and that other \"childlike\" faces, like Comic Sans, for example, exude silliness. What's neat about this is the irony found in Dr. Seuss books, where the mechanical Century Schoolbook is used to illustrate very silly text, and therefore this mechanical typeface assumes a silly personality, and makes learning \"fun.\" Maybe. At least that's how it worked for me, and that's why I still love Century Schoolbook so much. This goes along with the context theory. It is also very probable that most people's first exposure to Century Schoolbook is not in a Dr. Seuss book, but rather in a very dry mathematics text book, and for those poor folks, Century Schoolbook might forever be associated with dullness.\n\nSo this begs the question, \"How much does a typeface's first impression figure in to its lasting personality in a person's mind?\"\n\n"
    },
    {
      "time": "",
      "content": "Dezcom said it best. To put it as my old new (heh) media professor would say it, \"People can understand design language without being able to speak it\". That is, in a horror film, while people might not be able to explain why the tremolo strings in heightens the tension (other than that it's a common feature in such films), they receive the intended effect. Film is full of such examples, and type is the same way.\n\nFor my masters thesis (non-type related) I had to read a book which to be as a guy was rather disgusting (something about women and liberation of women through their bodies) and something about the font was bothering me too. It was a very feminine font, and while I think the majority of the population would get that, they might not be able to explain why it was like that. For women I supose it would make the text more inviting, for men, well, that much more repulsive (seriously, printing a book with an x-height at 90% of your ascender/cap height?).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "I hope you're not questioning the manliness of Ed Benguiat's type designs :-)\n\n"
    },
    {
      "time": "",
      "content": "Vic -- it might be interesting to try and create a disconnect for readers. The Bible set in Comic Sans, or a Garfield cartoon set in Courier, for example. What message do they get from an inappropriate typeface, if any?\n\n"
    },
    {
      "time": "",
      "content": "thank you guys, this is all good stuff!  \ngreat to hear your opinions on the topic.  \nI like how Dezcom put it, with the idea being that though a reader might not be able to understand why, he is still affected by type.  \nKoppa, thank you for providing an example.  \nI myself am unfortunately unfamiliar with the publications you've stated (I was born, and brought up in Russia, at 13 i went to UK, then New Zealand to do my Ba and now live and study in Melbourne, Australia) but i will try to find images on google.  \nFeeltheKern, thanks for your suggestion, it does sound interesting, and if i can somehow implement that somewhere in my project i will!\n\nGuifa, I love that, understanding design language without being able to speak it!\n\nAs a result of my research, I want to design a typeface, and promo stuff like Poster, Specimen, maybe a website, and some sort of a small publication that utilizes it.\n\nI hope that we continue discussing this as I am really getting some interesting ideas and perspectives from you guys!  \nDoes anyone have any books they suggest me to read.\n\nI've tried to find helvetica video but failed, so i had to download it, but I would really love to see if i can order the real thing, I love owning stuff like this. I am going to watch it tonight, very excited about it!\n\nAlso, if you guys have visuals to any examples you provide, and are feeling generous, feel free to embed them.\n\nThanks for all the responses, looking forward to more discussions!\n\n"
    },
    {
      "time": "",
      "content": "Try getting Oceans Thirteen and watching the extra on casino design. It is a good demonstration of how much subtle details do.\n\n"
    },
    {
      "time": "",
      "content": "Nick, take his Panache and then push its x-height up even higher, and then print an entire book about how man's vagina complex is the source of women's problems and how liberation of women can only occur by recognizing and refusing the female castration complex in said font, and I think you'll understand the difficulties I had :)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "A stern challenge indeed to your powers of objectivity, Matthew, but I'm not sure the typeface should be blamed for the book designer's transgressive behvior--it seems to be as much a victim of the text as you were.\n\n"
    },
    {
      "time": "",
      "content": "Oh I agree. As a display font, or titling font, or even heading font it would have been far better for the book. But, I think it was chosen for that reason. The book is very heavy, throwing its views at the reader, and setting the entire book in such a font greatly aided it.\n\nI'm sure to the average reader it was far more of a subtle effect. But, certain subtleties are lost on me.\n\nIn any case, back on the main topic, another thing that Victor may want to look comes out of the poetry world and highly relevant the discussion. Summed up, \"traditional\" poetry is composed on two components: the aural and semantic. Individuals words were only perceived to have these two qualities. Two words could have the same semantic value, but they were unique in their aural. However, starting in the _Vanguardismo_ period (I put it in Spanish because avant-garde in English has different meanings and connotations) at the beginnings of the 1900s, views changed. Words were then seen as having three components: the aural, semantic, and _graphic_. That's to say, simply changing the appearance of letters, spacing them further, making them bold, stretching them, would change the effect that the word had on the receiver and how the poem should be structured, so that two words with the same semantic and aural components (which would have been identical in traditional views) could be radically different. Iberian America is quite well known for its concrete poetry which is almost a direct result of this view.\n\nNeedless to say, these ideas are quite important to typography folk. You see it on this forum when people ask the best way to set the word \"Exclusive\" (I think that was the business IIRC) so that it would give off that feeling. If it's set in Comic Sans, it becomes a joke. In another face, antiquated. Another, modern and hip. But it's not the name or word or the spelling of the word that gives off that feeling rather it's the font. In logos it's far more pronounced as it's a single word, but in body text it can be much the same.\n\nPS Some other good poets in this vain include José Juan Tablada, Carlos Oquenda de Amat, Roberto Hidalgo, and the Oswald de Andrade (and the rest of the Andrade family).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "Every font has its own character. Script font is girly, flowing...etc. You should get a feel of the attributes each font carries.\n\n"
    },
    {
      "time": "",
      "content": "_The book is very heavy, throwing its views at the reader_\n\nBut how can a girly font be so butch?  \nSurely it is not the font itself which is overtly heavy or sexual, these are attributes which are created by the book designer, exploiting content and context to invest the typeface with these qualities.\n\n_That’s to say, simply changing the appearance of letters, spacing them further, making them bold, stretching them, would change the effect that the word had on the receiver and how the poem should be structured,_\n\nThese are not primarily typeface qualities, but layout qualities.\n\n\\*\\*\\*\n\nAccording to Saussure, the sign is completely arbitrary, i.e. there is no necessary connection between the sign and its meaning.  \nAnd so the shape of the Latin \"p\" signifies the sound \"p\" to me, but in the Greek script if signifies the sound \"r\". (Sorry, I would express that in phonetics if I knew how.)  \nThe same is true for typefaces. A particular glyph in a typeface can signify different qualities to different typographers, and many things to readers, depending on how the typographer sets the face.  \nThis is not to deny that there are broad clichés which everyone is \"supposed\" to get, but from a deconstructive perspective, these connotations are primarily dependent on the identity of the reader.\n\n[Sorry, this is out of order, I should have added that as a second post.]\n\n"
    },
    {
      "time": "",
      "content": "Nick, when I said heavy I meant the density of the material. And besides if you're from the South like I am, \\*ahem\\* we have a lot of heavy girls. (and guys too, I think Alabama is the 47 or 48th fattest state).\n\nAlso, those are indeed layout qualities, but I was just treating the historical events (and like typefaces, they are a purely graphical element of a poem, distinct from the aural and semantic). With the thousands of typefaces available today combined with modern layout engines, one could only imagine the stuff the _vangardistas_ would have come up with today.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "\"...the sign is completely arbitrary, i.e. there is no necessary connection between the sign and its meaning.\"\n\nI've been told that in Japanese two signs for \"woman\" combined mean \"to argue\" and three signs for \"woman\" combined mean something like \"immorality\", while \"beauty\" includes a sign for \"sheep\".\n\n:-)\n\n"
    },
    {
      "time": "",
      "content": "C. S. Pierce's semiotics, rather than semiotics in the Saussurean vein, might be more applicable to type design. Pierce talks about some signs being \"symbols\" which, like Saussure's sign, are related to the signified only arbitrarily or conventionally -- but there are also \"icons\" which share resemblance with their signifieds and \"indices\" which share a more direct relationship (e.g. causal) with their signifieds.  \nSo in [Pierce's terms](http://web.archive.org/web/20100515125509/http:/en.wikipedia.org/wiki/Semiotic_elements_and_classes_of_signs_%28Peirce%29#II._Icon.2C_index.2C_symbol) (as I understand them):\n\nthe letters d-o-g are a symbol of /dog/  \na drawing of a dog is an icon of /dog/  \na pawprint of a dog is an index of /dog/\n\nIn which way might type design be read as a sign? I can imagine arguments for all three.\n\n"
    },
    {
      "time": "",
      "content": "\"C. S. Pierce’s semiotics,\"\n\nand Roland Barthes?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "It's important to note that both Pierce and Saussurean's terminology is not necessarily referring to written language. Pierce's can be expanded to it, but Saussurean was looking exclusively at the aural v semantic distinction. Natural languages are spoken first and written later and a lot of his research was focused on earlier prerecorded languages so it was all worked out via how the languages would have been said. So, while for instance (using Japanese as an example), 木 means tree, 林 wood, and 森 forest, the words for these are not simply \"ki\", \"kiki\" and \"kikiki\" rather \"ki\", \"rin\" and \"mori\" (I looked up the pronunciations, they might be off, I welcome corrections), which have very little in common, although their graphic and semantic representations do link them, their aural components are quite different and unrelated with their meaning.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
