{
  "id": "4302",
  "title": "Tribal Fedra Match",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I wanted to use one of my all time favorite fonts Fedra for a new catalog job for Buddha Jewelry. B.J. is an importer/designer/distributor of organic (bone, wood, shell, etc) tribal jewelry mostly mfg. in Bali.   \nSo I decided to design a Caps version based on Fedra.   \nHere are some of the first glyphs.   \n   \n ![tribal](http://web.archive.org/web/20131020203322im_/http:/www.typophile.com/forums/messages/29/33557.jpg)\n\n",
  "author": "designalchemy",
  "time": "15 Apr 2004 — 5:36am",
  "uid": "804",
  "comments": [
    {
      "time": "15 Apr 2004 — 5:55am",
      "content": "Typographic logo to match.   \n ![tribal logo](http://web.archive.org/web/20131020203322im_/http:/www.typophile.com/forums/messages/29/33562.jpg)\n\n"
    },
    {
      "time": "15 Apr 2004 — 9:14am",
      "content": "I can't live without my spiky curls! Very nice direction.   \n   \nThe one tricky thing in this situation is something I encountered when making Domination Available: when you try to adapt a \"normal\", rigid design into something much more organic, it's difficult to decide what changes and what stays. The feeling I got was that to do the task properly you really have to redraw the new forms from scratch (even if you want to maintain some rigidity), otherwise you end up with a mish-mash - which is however fine if that's the effect you want!   \n   \nhhp\n\n"
    },
    {
      "time": "15 Apr 2004 — 4:43pm",
      "content": "I really like these forms, Ole. One thing I might examine some more is the G...I'm seeing an alternate C form there.\n\n"
    },
    {
      "time": "16 Apr 2004 — 10:29am",
      "content": "Ole,   \n   \nJust a couple of things I noticed, from a non type designer perspective:   \n   \n ![](http://web.archive.org/web/20131020203322im_/http:/www.typophile.com/forums/messages/29/33634.gif)   \n   \n1. This hairline is inconsistent with the rest of your design's weight.   \n2. Also too slim, but this whole feature seeems out of character. The \"J\" is nothing but smooth curves, apart from the spiky features, and this is not smooth.   \n3. This looks like a distressed bezier, which it is. Once again, out of character. You might try matching the curve of the b's crossbar instead.   \n4. The way this fleureon connects seems inconsistent with the other ones.   \n   \nI hope this helps.\n\n"
    },
    {
      "time": "16 Apr 2004 — 6:25pm",
      "content": "Good points. the hardest part of this design is time. I basically have less than a week to do the whole thing as client needs it for tradeshow may 1st. in a offset printed in a catalog that is underways. to make things a bit more complicated client is in Bali until we go to print April 23.   \n   \nThe concepts that I am working with are hard to explain.   \nLet my try anyway, Tribal jewelry is often used in rites of passage and is often applied through ritual with a shamen, it is often very painful to the point of ecstacy, example genital piercings. Somer shapes that were later scrapped are actual based erotic carvings from bali and indonesia.   \nI stated to think about how this could be translated into type?   \nHistorically speaking, I thought the most extreme times in history (with reference to sex) would be Roman and Victorian times (Victorian being all forbidden). Jump forward to 2004.   \nWhy do people get piercing and wear this type of jewelry?   \nTo be interesting so they can get laid, for a spiritual type of mission, and for plain adornment. Again how can this be transformed into type. Example above tkaes it there, Exuberant   \ndecoration with flourishes, spiky representing the tribal piercing aspect, and the shapes are similar to actual products being sold.   \nForgive my gibberish but I have been up too many hours this week.   \n   \n   \n  \n   \nOn spefic suggestions from Daniel   \ntoo thin? I agree a bit weight would make it more consistant.   \nfleuron on bottom was supposed to look like a curled extention of the thinner bar on the outside of the J. this worked much better in single colr. With color this seems to not work as well especially since it s two colors of high contrast.\n\n"
    }
  ]
}
