{
  "id": "43025",
  "title": "Good magazine typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey all, first post, although I've been lurking for a long time :)\n\nI need to make a 6-page spread for the internet TV station Diggnation.\n\nI would very much enjoy using 'Sauna' by Underware as the Title typeface. ( [Underware's Sauna here...](http://web.archive.org/web/20131014123937/http:/www.underware.nl/site2/index.php3?id1=sauna&id2=overview))\n\nWhat do you people recommend me to use for the body copy itself?\n\nI'm a little new at this thing and I just don't have the typographic sensitivity (yet) that you guys have!\n\nThanks a ton for your input,  \ninnovati!\n\n",
  "author": "innovati",
  "time": "10 Mar 2008 — 8:53pm",
  "uid": "28142",
  "comments": [
    {
      "time": "10 Mar 2008 — 9:53pm",
      "content": "That's a very general question – it really depends on what you're trying to achieve with the spread, and the magazine – but since you're using an Underware face for display, you might try Underware's excellent text typeface Dolly.\n\n"
    },
    {
      "time": "10 Mar 2008 — 10:18pm",
      "content": "I wasn't sure if Dolly was 'mature' enough to work for large bodies of text, but I certainly trust you more than my own intuition.\n\nIf you think it's worth it I'll certainly look into getting it!\n\nI don't know, but Underware really seems to have a rhythm to all of their typefaces, what are your thoughts on their font \"auto\" in general, I'm not sure what to make of it yet...\n\n"
    },
    {
      "time": "10 Mar 2008 — 10:29pm",
      "content": "Try to get your hands on a copy of the American magazine Sunset, which uses Auto for nearly everything, including body copy. It works really well, IMHO.\n\n"
    },
    {
      "time": "11 Mar 2008 — 5:19am",
      "content": "thanks for the tip Marcox, I'll make sure to keep my eyes open next time I'm downtown!\n\n"
    },
    {
      "time": "11 Mar 2008 — 11:43am",
      "content": "Don't use Dolly: yes, it's charming, but it lacks a bold italic, which you will need sooner or later, and the base weight is a little too heavy, esp if your paper stock is slick. Zingha, Proforma, Bitstream Iowan (available with OSFs as a separate bundle), and especially Esta (which is also inexpensive) have appeal similar to Dolly with no problems. Poynter Text Roman One, ITC Bodoni 12, Filosofia, Warnock, Quadraat, Scala, and Celeste each have a very distinctive appeal, but without problems or missing fonts. Take a peek.\n\n"
    },
    {
      "time": "11 Mar 2008 — 9:46am",
      "content": "If you like Dolly you will probably like [Dederon](http://web.archive.org/web/20131014123937/http:/www.fontshop.com/fonts/downloads/suitcase/dederon_serif_family/). The bonus? The companion, [Dederon Sans](http://web.archive.org/web/20131014123937/http:/www.fontshop.com/fonts/downloads/suitcase/dederon_sans_family/).\n\n"
    },
    {
      "time": "11 Mar 2008 — 10:08am",
      "content": "You've picked a tough one.  \nIt requires a lot of research to find a good contrast face for a distinctive hybrid face like Sauna (semi-serif, low contrast, large x-height/short capitals).  \nYou can always use Sauna!\n\n"
    },
    {
      "time": "11 Mar 2008 — 10:14am",
      "content": "What makes most Underware fonts like Sauna or Auto work is the fact they have weights that verge on display faces, and weights that work as body text.\n\n"
    },
    {
      "time": "11 Mar 2008 — 12:18pm",
      "content": "Karmina & Ronnia\n\n"
    },
    {
      "time": "11 Mar 2008 — 11:55pm",
      "content": "I had a vision of it in my head and I set it using Auto and everything just fell into place. I'll check out your recommendations too for other work, they also look very nice.\n\nThank you so much for your input everybody, it's been a big help :)\n\n"
    },
    {
      "time": "12 Mar 2008 — 7:10am",
      "content": "Second Miss Tiff on Dederon Serif and Sans--except for the price, $75 per font for four weights and 8 fonts! Some of those European boutique foundries are way overpriced: this one is Czech so maybe they should emulate Storm's moderate pricing.\n\n"
    },
    {
      "time": "12 Mar 2008 — 6:01pm",
      "content": "I totally agree with mondo... too expensive!!!\n\n"
    }
  ]
}
