{
  "id": "43064",
  "title": "Resume critique",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi,\n\nI'm a student of architecture and I'm trying to create a resume at the moment using InDesign.  \nI've had a look at some other examples which have been posted on this forum, and followed a few 'design tips and tricks' type tutorials that I found on the internet, and this is what I have come up with so far....\n\nThe typeface I'm using is Adobe Garamond Pro with the sub-headings set in 11pt and the rest of the text set in 10pt with 12.75pt leading. That box in the top right hand corner is for a passport type photo to be added to later, as the places I'm applying to require that. I like the layout more or less, but it still looks cluttered or awkward to my eyes and I can't work out why.\n\nAny comments or feedback would be greatly appreciated.\n\n",
  "author": "70",
  "time": "11 Mar 2008 — 8:24pm",
  "uid": "17355",
  "comments": [
    {
      "time": "11 Mar 2008 — 9:47pm",
      "content": "Firstly the dotted lines add a lot more unneccessary activity to the page - try making them lighter and solid.\n\nAlso in the professional experience section has a few issues - the city name and time period which is aligned to the right margin looks out of place with the unjustified text immediately underneath it. It also doesn't run very easily with the company name and position headings on the other side of the page. I'm not necessarily suggesting you justify the text, but you could try that. I'd suggest either putting the city name and time period under the other two headings, or left align them to a tab rather than right aligning them.\n\nThe headings in this section also don't differntiate themselves enough from the text - add some sort of hierachy there; maybe the grey colour you've used for the text with the headings black? A different weight, different size, or maybe even a sans?\n\nThe text does feel all blocked up, but probably because there isn't any hierachy or contrast going on anywhere, so it all looks rather homogenous.\n\nI also don't think the circular bullets work well with that font.\n\nHope some of that helps (not that I'm any expert, just a student)\n\n-Rafe\n\n"
    },
    {
      "time": "11 Mar 2008 — 9:49pm",
      "content": "Also if you can speak Japanese or Chinese, it might be worth including that information\n\n-Rafe\n\n"
    },
    {
      "time": "12 Mar 2008 — 10:39pm",
      "content": "Reduce your tracking, increase your leading! My eye goes down instead of across, especially in the \"Professional Experience\" section.\n\nThe bullets look out of place... In general, get rid of all (or most) lines, and think of the text itself as the visual elements. For the dates and locations, perhaps move them to be right after the names of the firms - try italic, or lighter grey, or something to deemphasize them. Where they are right now is unscannable and ugly.\n\nResumes need to work as a glance, a scan, and a read - I agree with rafe that right now it's all a bit too homogenous.\n\nGood luck!\n\n"
    }
  ]
}
