{
  "id": "4306",
  "title": "The Constitution",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "They are getting me a scan, but I thought I'd start the question now. Does anyone know if there have been typefaces created that mimick the Constitution of the USA? Both the blackletter and the script? (Don't ask why it is a bizarre client request.)\n\n",
  "author": "<a href=\"/web/20110519105314/http://typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": "<br>",
  "uid": "108",
  "comments": [
    {
      "time": "",
      "content": "Funny, I was under the mistaken impression that it was handwritten. I have not been able to find anything similar. It does look familiar.\n\n"
    },
    {
      "time": "",
      "content": "You could try English 157 for the script. But it won't perfectly mimic something handwritten.   \nOr one of the Shelley fonts. Or Berthold Script.   \n   \nhttp://www.myfonts.com/fonts/bitstream/english-157/english-157/\n\n"
    },
    {
      "time": "",
      "content": "There have been several re-creations of the writing on American historic documents, although perhaps not this identical handscript. Part 10 (Antique Handwriting) of the [Script Font ID Guide](http://web.archive.org/web/20110519105314/http:/bowfinprintworks.com/Script10Pg1.html) shows fonts called Article 10, Old Glory, Jeffersonian and American Scribe to name some of the more deliberate recreations. If you look through the type samples you may see others that fit the feel as well. Not all the fonts are truly modeled on antique writing, but I included them there if I thought they might look like they were (so Zapfino is there too, for example).   \n   \nThese do at least look more like something handwritten, rather than engraved.   \n   \nHowever, I do not know of anything that looks like the 'blackletter' (We the People) style.\n\n"
    },
    {
      "time": "",
      "content": "Letraset used to have a sheet of rub-down graphics from the Declaration of Independence. They issued it in 1976 for the Bicentennial. I don't know when it was discontinued, but it's not in the most recent catalog I have (1998).   \n   \nIt included characters similar to the text in the Constitution, but only enough to compose a few words. Here's what it looked like from an older catalog:   \n   \n ![1776](http://web.archive.org/web/20110519105314im_/http:/www.typophile.com/forums/messages/83/33631.gif)\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Mark. But, I was referring to the \"original\" draft.   \n   \n ![](http://web.archive.org/web/20110519105314im_/http:/www.typophile.com/forums/messages/83/33587.gif)\n\n"
    },
    {
      "time": "",
      "content": "Oh ... eeeeek!! ... That wouldn't be a very fun way to do it. :^/   \n   \nThanks to all suggestions. They ended up using the old cover. Not the best choice, but oh well. C'est La Vie!\n\n"
    },
    {
      "time": "",
      "content": "From Adobe Caslon:   \n   \nWilliam Caslon released his first typefaces in 1722. Caslon\n\n"
    }
  ]
}
