{
  "id": "43077",
  "title": "Illustrator as drawing tool (vs. Fontlab)",
  "forum": "Build",
  "tags": [

  ],
  "content": "As some of you say they prefer Illustrator to draw their glyphs, and then copy them to fontlab, I just asked myself: Is there a way to handle tangents of the curves in illustrator in a way similar to Fontlab?  \nIn Fontlab, I can klick on a tangent handle, then moving it with the cursor keys, having very detailed control (sometimes I even count the steps I move a handle, to reach symmetry, similarity to other glyphs, etc.)  \nIn Illustrator, it seems the only way is to drag the handle with the mouse, so there is no “numeric control” over the handle. There \\*is\\* control for points on the curve, you can select them and move them by mouse or keyboard.\n\nAs I use Illustrator as a ... well, illustration tool as well, I’d often wish that I could control the handles in a similar way to fontlab.  \nSo how do those who draw their glyphs in Illustrator do the detailed systematic fiddle work on their curves? Intuition? A good eye? A secret Illustrator mode I do not know yet?\n\nThanks  \nSebastian\n\n [‹ How to install the Adobe FDK for OpenType into Fontlab](http://web.archive.org/web/20081006023939/http:/typophile.com/node/42981 \"Go to previous forum topic\") [Standard practice for unicase font. ›](http://web.archive.org/web/20081006023939/http:/typophile.com/node/43227 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081006023939/http://typophile.com/user/5444\" title=\"View user profile.\">Sebastian Nagel</a>",
  "time": "<br>",
  "uid": "5444",
  "comments": [
    {
      "time": " 12.Mar.2008 6.46am",
      "content": "<cite>In Illustrator, it seems the only way is to drag the handle with the mouse, so there is no “numeric control” over the handle.</cite>\n\nThat has been one of my biggest Illustrator gripes for a long time.\n\n"
    },
    {
      "time": " 16.Mar.2008 10.32pm",
      "content": "Their is a plug-in called ’Better Handles’ [http://www.nineblock.com/products.html](http://web.archive.org/web/20081006023939/http:/www.nineblock.com/products.html \"http://www.nineblock.com/products.html\") that allows much more advanced control of handles and I believe will work similar to the precision allowed in Fontlab.\n\nI preferred Illustrator to draw characters until I realized the subtle distortion and extra time it created in drawing glyphs.\n\nThe other problem is that if you follow Fontlab’s guide to drawing characters in Illustrator with the grid set to match Fontlab’s whole point integer’s, you end up working at such a scale in Illustrator that there isn’t much room to work with more than a few characters without running off the pasteboard, requiring the use of layers or separate Illustrator files.\n\nIt is much easier and efficient to work in Fontlab and use Illustrator occasionally for select elements to assist in the process.\n\n"
    }
  ]
}
