{
  "id": "43100",
  "title": "Adobe Announces Font Folio Education Essentials",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20080314100629/http:/typophile.com/user/108 \"View user profile.\") : 12.Mar.2008 1.20pm \n\n**Font Collection for Design Education Developed in Collaboration with AIGA and Educators**\n\nSAN JOSE, Calif. — March 11, 2008 — Adobe Systems Incorporated today announced a comprehensive and affordable OpenType® font collection for teaching and learning about typography. Developed in collaboration with AIGA, the professional association for design, Adobe® Font Folio® Education Essentials software enables higher education students and faculty to design and express creative ideas using OpenType - the cross-platform solution for creative professionals. Students and faculty can create professional-quality print materials, effective websites, rich interactive experiences, and dynamic mobile content.\n\nAdobe Font Folio Education Essentials software includes nearly 500 elegant and trusted fonts, interesting designs, and glyphs. All fonts are OpenType format, which provides enhanced linguistic support, advanced typographic features, and true cross-platform compatibility. The collection has been assembled in collaboration with AIGA specifically to provide depth, breadth, and value for higher education.\n\n“Font Folio Education Essentials allows students to make appropriate type choices for the context and content of their work and helps faculty to teach the history of design,” said Ric Grefe, executive director of AIGA, “The collection is a true foundation for design students and educators alike.”\n\nAIGA and Adobe have long worked together in advancing the practice of design, the use of technology across creative industries, and highlighting the impact of design on the economy and society. Font Folio Education Essentials has been developed as a fundamental tool for teaching typography.\n\n“With AIGA, we’ve hand-picked typefaces that will be instrumental in educating tomorrow’s designers,” said Tom Prehn, senior product marketing manager for type and print technologies at Adobe. “Font Folio Education Essentials is comprehensive and affordable, and furthers our 25-year tradition of setting the standard for digital fonts.”\n\n**Key Features**\n\nAdobe Font Folio Education Essentials offers fonts for teaching the principles of typography at a price that eliminates cost barriers and encourages legal use of fonts. Chosen in collaboration with AIGA and leading design educators, the collection has depth, breadth, contrast, and historical variety. All fonts are OpenType format. Also included is a reference guide and two video features – one on OpenType technology and how it extends creative freedom; the other on how to apply type design to motion graphics.\n\n**Pricing and Availability**\n\nAdobe Font Folio Education Essentials will only be available online at the Adobe Education Store – North America. The collection is expected to be available on April 17. Estimated pricing for qualified educational customers is US$149; licensing options will be available. To learn more, please visit [http://www.adobe.com/education/products/fontfolioeducationessentials/ind...](http://web.archive.org/web/20080314100629/http:/www.adobe.com/education/products/fontfolioeducationessentials/index.html \"http://www.adobe.com/education/products/fontfolioeducationessentials/index.html\").\n\nUpdate: Find the list of fonts on Thomas Phinney’s Blog [Typblography](http://web.archive.org/web/20080314100629/http:/blogs.adobe.com/typblography/2008/03/ffee.html).\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080314100629/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 12.Mar.2008 1.20pm",
  "uid": "108",
  "comments": [

  ]
}
