{
  "id": "43115",
  "title": "Book Design - Margins",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nI’m designing a book and I need some advice from designers who have experience with printing. I am particularly interested in getting recommendations on the size of the margins to avoid printing issues.\n\nHere are my specs:  \nPages: 288 pages  \nInside Margin: 0.5 inches  \nOutside: 0.25 inches  \nTop: 0.25 inches  \nBottom: 0.5 inches\n\nIn many of the books and websites I’ve read, it seems 0.5 inches is the minimum margin recommendation for all sides. However, when I look at my favorite design books, some of them cut it quite close with less than 0.25 inches margin. I like my book to have an outside margin of 0.25 inches. How do I make sure the printer doesn’t overtrim the document down beyond 0.25 inches?\n\nthanks in advance!\n\n [‹ Novell.com Redesign](http://web.archive.org/web/20080320010853/http:/www.typophile.com/node/43099 \"Go to previous forum topic\") [Help re H&FJ's Archer ›](http://web.archive.org/web/20080320010853/http:/www.typophile.com/node/42996 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080320010853/http://www.typophile.com/user/11314\" title=\"View user profile.\">daiukun</a>",
  "time": "<br>",
  "uid": "11314",
  "comments": [
    {
      "time": " 13.Mar.2008 2.12am",
      "content": "I’m afraid that if I picked up a book with a quarter inch outside margin I would put it down again immediately as an abomination. Add to that that the inner margin is double the outer margin, whereas it should be the other way round if anything, and I think you have a recipe for disaster.\n\nJust my two cents.\n\n"
    },
    {
      "time": " 13.Mar.2008 5.49am",
      "content": "<cite>I’m designing a book and I need some advice from designers who have experience with printing.</cite>\n\nYou can’t be a book desiner if you don’t understand printing. You can be a <cite>stylist</cite> like the people who put ever-larger tailfins on late 1950s automobiles.\n\nIf it is a sheet-fed press, the fingers need some gripping room. Call the printer & ask; just which margin & how much depends on the press & workflow. But of course, printers can print full bleeds on 4 sides (3, really), so you don’t absolutely have to have margins at all. Usually, full bleed costs more, if for an entire book.\n\n<cite>when I look at my favorite design books, some of them cut it quite close with less than 0.25 inches margin. I like my book to have an outside margin of 0.25 inches,</cite>\n\nWell, you’ll have a pleased audience of at least one. Probably a few more, since you’ve apparently seen other design books that use .25 inch margins.\n\nIf you are talking about how far pictures can extend into a margin, that is one thing. If you are talking about text, quite another.\n\nMost book designers take their task as presenting the author’s work. From the tenor of your post, you seem to see the job of designing differently.\n\nCharles Ellertson\n\n"
    },
    {
      "time": " 13.Mar.2008 5.50am",
      "content": ".25” margin is generally considered safe, but I have to agree with Eluard that it’s crazy tight. What is your trim size? What kind of book is it, an illustrated book or a reading book? If the former you may be able to pull it off, if the latter your readers will probably hate you. I really wouldn’t put text that close to the edge of the page. Pictures... well ok if you insist.\n\nYour inside margin should be a little more, as you’ve specified, to avoid the text falling into the gutter, but depending on how it’s being bound, 1/2” might be tight as well.\n\n"
    },
    {
      "time": " 13.Mar.2008 8.45am",
      "content": "The only place I have seen quarter inch margins is in paper backs (the cheapies) where they are trying to cram as much into the page as possible. Less than a quarter and bad trimming/folding can cut text off. A quarter inch is 1.5 picas ... I like to see the text indent that wide, let alone the margin.\n\n\\> How do I make sure the printer doesn’t overtrim the document down beyond 0.25 inches?\n\nPray. A lot.\n\n"
    },
    {
      "time": " 13.Mar.2008 9.42am",
      "content": "A good printer will compensate for creep (that is the loss of width of a books pages in the final trim, based upon paperthickness and location of pages in a section — excuse my poor english) by reducing the innermargins. So your outer margin can be safe and steady…  \nBut I concurr with other respondents here: a quarter of an inch is dangerously little. Especially when you take into account the common practice of libraries to rebind (in hardcover) a lot of books, which requires an extra trim.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 13.Mar.2008 9.55am",
      "content": "I don’t do near as many books as Patty, but measuring a book recently that was supposed to be 6x9 to find it was 6x8.875 made me jump a little.\n\n"
    },
    {
      "time": " 13.Mar.2008 10.40am",
      "content": "Due to exigencies of large-scale printing and production, most book printers will cite as much as 0.125 inch to be an acceptable tolerance in trimming and recommend that any element that is not intended to bleed should be \\*at least\\* 0.25 inch from the trim. If you want that margin to appear consistent throughout the book, I’d make it larger. Not every printer imposes with adequate compensation for creep.\n\nRegarding inner margin, the safest bet is always to get a dummy from the manufacturer and evaluate your page design in relation to the physical object. My gut tells me that half an inch is too tight.\n\n— K.\n\n"
    },
    {
      "time": " 14.Mar.2008 11.23pm",
      "content": "My books, however bound, always have .75 to one inch left and right margins and never less. Hardbacks open fairly flat but paperback binding really chews up the inside margin space and the reader needs the extra relief. In my view, .25” inside gutter is totally wrong and you’re just asking for trouble.\n\n"
    },
    {
      "time": " 15.Mar.2008 11.19am",
      "content": "To my knowledge there’s nothing like a universal minimum margin in modern book design, at least in a technical way. It mostly depends on the means you are going to use for printing, binding, etc. and what you consider would be comfortable for the reader. Find out how it is going to be printed and ask about limitations, if you can have bleeding, etc. If possible see examples, ask questions, make tests.\n\nIf you like to define a harmonic margin structure look for known proportions, they can give you a good starting point: medieval, 3/4, there are many “formulas”... it would also be a good start to define the page, margins, and everything in picas and points - it will make things easier when defining line heights, typography and overall measures.  \nAlso look for books in similar sizes, it will give you an idea of how the margins, type and space look and feel.\n\nWhat kind of book is it anyway, is it an illustrated/art book?\n\nRegards,\n\n"
    },
    {
      "time": " 15.Mar.2008 12.34pm",
      "content": "Gabriel - I asked that same question (what kind of book). Daiukun has not revisited this thread since launching it. Perhaps he didn’t get the answers he wanted.\n\n"
    },
    {
      "time": " 17.Mar.2008 10.33pm",
      "content": "patty - Maybe he hasn’t seen yet. He’s been a member for over two years, lets give him some more time. He may be the one-day-a-week-poster kind. ;-)\n\nNice site of yours, by the way; I loved “mesa picante” logo, the “Magic Flute” and “Tequila” book covers.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.gabssnake.4t.com](http://web.archive.org/web/20080320010853/http:/www.gabssnake.4t.com/ \"www.gabssnake.4t.com\")\n\n"
    },
    {
      "time": " 18.Mar.2008 6.07am",
      "content": "Thanks Gabriel!\n\n"
    }
  ]
}
