{
  "id": "43112",
  "title": "Skin Care logo CC",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi, just looking for some cc on a logo I’m working on. I don’t know if I like the typeface, but I can’t really find on I love.  \nThe business is a skin care office, she wanted something with a leaf or leaves to symbolize natural products etc. so I drew up the Olive branch..\n\nAnywhoo, any ideas?  \nThank you in advance!  \n-Kaleb\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 3.png](http://web.archive.org/web/20090717011749/http:/typophile.com/files/Picture%203_33.png) | 116.71 KB |\n\n",
  "author": "<a href=\"/web/20090717011749/http://typophile.com/user/28252\" title=\"View user profile.\">figure8designs</a>",
  "time": "<br>",
  "uid": "28252",
  "comments": [
    {
      "time": " 12.Mar.2008 7.16pm",
      "content": "First thought that comes to mind: The smallest type is going to be no more than a smudge once this is used at logo size.\n\n"
    },
    {
      "time": " 12.Mar.2008 7.54pm",
      "content": "Too many thoughts for a logo. Concentrate on the name and perhaps skin care if that is indeed part of the company name. The rest can be inserted (more like a tagline) on a case by case basis.\n\npbc\n\n"
    },
    {
      "time": " 12.Mar.2008 8.04pm",
      "content": "Thanks for the input, to be honest I am not including her title on the final. It will be added on a case to case basis as you said Paul. I believe she wants one blown up fairly large to put on the front door of the office. Other than that I am making a brochure and business cards for her...\n\nPaul are you suggesting that I ditch the leaves?\n\n"
    },
    {
      "time": " 12.Mar.2008 8.11pm",
      "content": "Oh and I am using Baskerville, thought about Optima, but decided against it, I just want something to mimic and go well with the leaves...\n\n"
    },
    {
      "time": " 12.Mar.2008 8.47pm",
      "content": "I am not suggesting ditching the leaves at all. Shrink this down to the smallest size you can imagine it being used (I commonly use logos that are less than 1” wide) and see how it reads. I have my doubts that Skin Care would survive that but I might be wrong…\n\npbc\n\n"
    },
    {
      "time": " 13.Mar.2008 1.58am",
      "content": "I’m with the general opinion, the other texts are too tiny in proportion. Even the “skin care” looks too small. Try previewing in really small sizes, it will give you a better sense of proportion.\n\nIf you’re looking for something that goes nicely with Baskerville, try an Italic from a Serif type, I’d suggest Adobe Garamond Pro Italic, I find it really nice.  \nA sober, soft sans may also work great, and add a spicy contrast, I’d suggest Myriad Pro, if you don’t mind it’s popularity.\n\nI would say the line spacing between “olivia” and “trevino” is too small, as well as the spacing between the leaves and type. Just a little bit.  \nHow it would work with no dots in the “i”s at all, or lowering them a little?  \nCan the “T” in “Trevino” use a similar treatment as the “O”, I mean, be shorter?\n\nRegards,\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.gabssnake.4t.com](http://web.archive.org/web/20090717011749/http:/www.gabssnake.4t.com/ \"www.gabssnake.4t.com\")\n\n"
    },
    {
      "time": " 13.Mar.2008 11.28am",
      "content": "What you need is work on your letter spacing on the logo the Tre is bad and so are vin. The problem is it isn’t visually consistant. Some of it is floating some of it is bunched together. Make the color better and you have a very attractive look.\n\n"
    },
    {
      "time": " 13.Mar.2008 11.28am",
      "content": "What you need is work on your letter spacing on the logo the Tre is bad and so are vin. The problem is it isn’t visually consistant. Some of it is floating some of it is bunched together. Make the color better and you have a very attractive look.\n\n"
    }
  ]
}
