{
  "id": "43136",
  "title": "Wedding Place Mat",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Screen printing this onto a place mat for my wedding. advice pls\n\n ![](http://web.archive.org/web/20130310022005im_/http:/typophile.com/files/mat_5677.jpg)\n\n",
  "author": "richardphipson",
  "time": "13 Mar 2008 — 12:37pm",
  "uid": "27612",
  "comments": [
    {
      "time": "13 Mar 2008 — 1:27pm",
      "content": "What kind of advise? Looks fun, though I personally can't read the lowercase \"v\" or \"w\" without working at it.\n\n"
    },
    {
      "time": "13 Mar 2008 — 1:38pm",
      "content": "mostly composition advice, but thanks :)\n\n"
    },
    {
      "time": "13 Mar 2008 — 4:58pm",
      "content": "You might want to look at your spelling of Gateaux...\n\nJH\n\n"
    },
    {
      "time": "14 Mar 2008 — 3:20am",
      "content": "ihih.. thanks..\n\n"
    },
    {
      "time": "28 Mar 2008 — 1:09pm",
      "content": "At first I was confused, but then I got it, so I think it works. The only one that's a bit ambiguous to me is the \"\\* selection of lovely seasonal fresh veg PUDDING \\* ice cream with chocolate sauce\". Is this three items or two items? If three, \"PUDDING\" is missing an asterisk. If two, is it \"veg PUDDING\" or \"PUDDING ice cream?\" This needs to be clearer.\n\nThe \"ice cream sauce\" and \"with chocolate\" seem to be two different elements to me. It looks like \"ice cream sauce\" and \"mousse gateaux with chocolate wedding cake\". I'd tuck the \"with chocolate\" in between \"ice cream\" and \"sauce\" to be more consistent with the other items on the menu.\n\nAssuming \"PUDDING\" is its own item, I'd set \"ice cream with chocolate sauce\" (in a single column) in pink and \"wedding cake\" in white to help with clarity.\n\nI agree about the 'v' and 'w' - it reads as \"roedding cake,\" \"ice cream roith chocolate sauce\".\n\nOtherwise, this looks really cool :-)\n\n- Lex\n\n"
    },
    {
      "time": "28 Mar 2008 — 2:01pm",
      "content": "\"advice pls\"\n\nScrap it.\n\nIt's way too nice.\n\nYour wife will be pissed that she's no longer the center of attention.\n\n"
    },
    {
      "time": "20 May 2008 — 10:02pm",
      "content": "yes, to me the 'v's look like topless 'b's and the I's merge with the next letter to form U's\n\nI wonder if switching typeface might solve them or maybe it's just me. I mean, I'm a designer, so after studying typography I should be better equipped to deal with these things, but the reading order lost me a couple of times. (although I am canadian, so maybe I'm just not used to reading your typographic accent ;-)\n\noh, and good luck with the wedding, must be exciting times!\n\n"
    },
    {
      "time": "21 May 2008 — 3:45am",
      "content": "I would make \"lasagne\" to show as all others: not being over other text. Maybe giving more leading, so it breaths better.  \nLook Good!\n\n"
    },
    {
      "time": "22 May 2008 — 3:41am",
      "content": "Very nice -- the \"v's\" don't bother me as much.\n\nBut the \"e\" in lasagne is the only letter in the layout that overlaps.\n\numm what's a lasagne? Do you mean lasagna?\n\n"
    },
    {
      "time": "22 May 2008 — 3:46am",
      "content": "Lasagna. My bad. If you track me you will find out that I am THE champion of typos over here.\n\n"
    }
  ]
}
