{
  "id": "4314",
  "title": "Fibonacci and Golden Section",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm sure all of you are familiar with Fibonacci numbers and the golden section, but how many of you actually use them in your design projects?   \n   \nI'd like to hear your thoughts on the matter. Pros and cons. Whatever you think is relevent ;)\n\n",
  "author": "shannon",
  "time": "15 Apr 2004 — 7:00pm",
  "uid": "3287",
  "comments": [
    {
      "time": "15 Apr 2004 — 7:39pm",
      "content": "Forty years ago, when I was younger (especially just after graduate school when I was full of philosophical notions), I frequently applied mathmatical structure to my work. It was very rewarding to me as a person. I was attempting to resolve the \"unified fields\" theory in design and typography. My clients were, perhaps rightfully, merely concerned with their communication issues and were at best tolerant of my structuralist escapades.   \nWhat I discovered was that the human eye and the mind behind it a far better at finding inherant structural solutions than books full of mathmatical expressions. I have now completely abandoned forced application of known-to-be-sound ratios. I trust my eyes to know what is best. Type design is a prime example. There is so much optical correction in defining a font that you find yourself fudging anyway. Imagine the great type designers of centuries past cutting punches by hand. They had nothingcapable of measuring precisely enough so they just used their eyes and their talent. After the fact, critics write books analizing their fonts and ascribing great mathematical logic to the forms they created. Who knows what Claude Garamond used or how he really designed his type. I would bet that it is more hand and eye than anything else.   \nThis week I began work on a new typeface (it has been a few years since the last one). This time I decided to abandon all measurement, all rules, all comparison to existing faces, all \"school knowlege\" and just let my human faculties determine everything. This is not an \"Arty\" face or even a Humanistic face. It is a pretty straight forward workhorse sans serif that I intend to have broad usability\n\n"
    },
    {
      "time": "15 Apr 2004 — 8:56pm",
      "content": "I utilize the golden section quite a lot, but never at the detriment of the message.\n\n"
    },
    {
      "time": "15 Apr 2004 — 10:13pm",
      "content": "The cool mathematical stuff can work pretty well. But the combination of the eye and logic is the best.   \n   \nChris is particularly right about the differences between pure math and optically correct design when it comes to type design. I found it very instructional to look at reproductions of Paul Renner's original drawings for Futura and compare them to what Bauer issues. Renner's original design was based on pure geometry, and would have been an absolute failure as a typeface. The Bauer design staff corrected and fixed Renner's design to make it actually work as a typeface. If his original drawings had been cut as type, Futura would have been a complete failure.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "16 Apr 2004 — 12:51am",
      "content": "Quite often, as well as more or less fictional proportions on which I base a projct. Fibonacci and especially the folden section are fun tools, but of course, in the end you have to trust your eyes and your intuition.\n\n"
    },
    {
      "time": "16 Apr 2004 — 4:57am",
      "content": "Robert Bringhurst discusses the use of the Fibonacci series to create a style hierarchy in his book. It works well with a given font family, but can require some adjustment when you apply it to different typefaces.   \n   \nGolden rectangles are a nice shape for business cards here in the USA. I\n\n"
    },
    {
      "time": "16 Apr 2004 — 11:47am",
      "content": "I think where it comes to play best, in the type world that is, is in actual page proportions, and paragraph block sizes.\n\n"
    },
    {
      "time": "17 Apr 2004 — 7:28am",
      "content": "Kyle,   \n\\>I utilize the golden section quite a lot, but never at the detriment of the message.\\<   \n   \nI was refering to my then youthful exuberance in discussing the merits of proportion with my clients. I have since found that it is best, when talking to clients, to avoid \"design-speak\" and confine the presentation to how the solution I am presenting solves their communication problem. I didn't mean that I let the structure of the design interfere with communication. I quite agree with you, the message is of primary importance\n\n"
    },
    {
      "time": "17 Apr 2004 — 10:37am",
      "content": "It's nigh well impossible to add to the remarks given by our friends above, so I'll just try to add the experience of two other fields of art.   \n   \nPoetry: When a young poet first begins to discover (or discard) meter and rhyme, he is captivated by the orthographical aids which denote said meter rhyme\n\n"
    },
    {
      "time": "17 Apr 2004 — 2:48pm",
      "content": "h,   \nVert insightful. As a young man, at the time in my life when I was most enthralled with the mathematics of form, my most treasured book was \"Portrait of the Artist as a Young Man.\"   \n   \nMusic and painting follows the same pattern as the poetry you mentioned. Composers worked for centuries to evolve the formal rules of counterpoint and sonata style only for later composers to break from these rules to create music which has a structure based on \"unstructure\". Painters perfected naturalistic works to later have art move to total abstraction. It seems humankind repeatedly devlops a very sophisticated structure which then evolves into what appears to be its antithesis (unless you can \"see forms\").   \n   \nAs for \"... and my post would probably have been a lot shorter if I had just thought of these two sentences first. \"   \nPerhaps if you had just been reading Hemingway's sentences instead of Joyce's, it would have been easier to write a shorter post? :-)   \n   \nYour post, particularly the remark: \"But if you speak to old poets (and lucky you are if the opportunity arises)\" made me think about \"The allegory of the cave\" in Plato's Republic. Plato confines the ability to \"see forms\" to the Philosopher King. Using the entire book's length of Socratic dialogue to convince the reader, Plato ascribes the Philosopher King as the only type of person worthy of ruling a society.   \n   \nPerhaps as typgraphers, we seek to \"see forms\" in their purest state and become worthy of ruling society's image of the printed page?   \n   \nChris\n\n"
    },
    {
      "time": "18 Apr 2004 — 2:30pm",
      "content": "Ah, Chris, a man after my own heart. Everyone is so keen on bringing up Plato's banishment of the artists (which incidentally doesn't bother me in the least, especially since I _am_ one and could probably use a good banishment or two) that they forget this cruicial point about the seeing of forms (which I am going to rush back out and reread). If only he had known of typesetting, the whole of western thought might have been drastically altered...   \n   \nOf course, when the printing press was invented, western thought _was_ drastically altered...or at least affected. We might have even had Aristotle's second book of poetics preserved. Then again, there's only 250 First Folios in existence, so the odds would still have been rather slim...   \n   \n~h\n\n"
    },
    {
      "time": "18 Apr 2004 — 3:15pm",
      "content": "What's funny is, these days Photoshop really does keep type as vector font data until the last possible moment. I forget whether it's EPS, PDF or both where it remains actual font data.   \n   \nBut this is a relatively recent change, and I certainly don't recommend Photoshop for heavy type work.   \n   \nT\n\n"
    },
    {
      "time": "18 Apr 2004 — 10:51pm",
      "content": "Thomas: This is true, it saves it similar to PDF, and does rasterize at a higher level then it used to.   \n   \nI'm just thinking back to clients bringing me in the brochure that \"their old designer\" did, and trying to edit three pages of copy set all in the PSD. Its not unusual to her me cursing and spouting some nonsense about \"these people call themselves designers...\" ![:-)](http://web.archive.org/web/20120416002359im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
