{
  "id": "43179",
  "title": "Study on Medical Typography",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey again, I'm doing a study on typefaces commonly used in the medical world (in hospitals, medical research, reports, etc.) and I was wondering if anyone could point me to any typefaces commonly associated with this particular \"vernacular.\"\n\nThanks!  \nGeorge\n\n",
  "author": "anythinganymore",
  "time": "14 Mar 2008 — 11:41am",
  "uid": "21518",
  "comments": [
    {
      "time": "14 Mar 2008 — 11:49am",
      "content": "Helvetica all caps and similar ultra-legible typefaces. :-( Serious answer, try to contact Karel van der Waarde as he's the expert in this area.\n\n"
    },
    {
      "time": "14 Mar 2008 — 11:51am",
      "content": "This was in the WSJ earlier in the week - pretty cool...\n\n[http://online.wsj.com/article/SB120467987732012017.html?mod=googlenews\\_wsj](http://web.archive.org/web/20141017164856/http:/online.wsj.com/article/SB120467987732012017.html?mod=googlenews_wsj \"http://online.wsj.com/article/SB120467987732012017.html?mod=googlenews\\_wsj\")\n\n"
    },
    {
      "time": "14 Mar 2008 — 1:54pm",
      "content": "I don't think you'll find too many common threads in the areas you mentioned, although they are connected to the medical profession.  \nIn the US, hospital signs (as far as room identification and wayfinding) will need to conform to the ADA. The main identification for the hospitals is of course at the discretion of whatever designer the architectural firm contracted.  \nReports and research probably have common typefaces, but they'll be more related to the most common software used to produce and read them (TNR, Courier, Helvetica, Verdana, etc.)\n\nOK, so that wasn't particularly helpful, but maybe it's a warning?  \nFor info on Signs, you can search the articles on SignWeb, from Sign of the Times (sign industry) magazine here:  \n [http://www.signweb.com/search.php](http://web.archive.org/web/20141017164856/http:/www.signweb.com/search.php)\n\nJason C\n\n"
    },
    {
      "time": "14 Mar 2008 — 2:51pm",
      "content": "What kind of study, what will you use the results for ?\n\n"
    },
    {
      "time": "14 Mar 2008 — 3:08pm",
      "content": "Basically I'm just putting together a series of posters (the theme being \"sickness\"), and I'm try to see if I can find any typefaces that might easily trigger a \"medical\" association.\n\nDidn't really require an astounding amount of research, but obviously lots of humanist sans-serifs for hospital signage, etc ...\n\nAlso, probably not a font, but I was also looking at some prescription labels like this one: [http://www.abacusrx.com/images/pics/Forms/Rx%20Label.JPG](http://web.archive.org/web/20141017164856/http:/www.abacusrx.com/images/pics/Forms/Rx%20Label.JPG \"http://www.abacusrx.com/images/pics/Forms/Rx%20Label.JPG\")\n\nDoes anyone know of any typeface that recalls this sort of lettering?\n\nThanks for your help.\n\n"
    },
    {
      "time": "14 Mar 2008 — 3:16pm",
      "content": "Thanks for the link Sii. Bad typography <cite>can kill people</cite>.\n\nanythinganymore, your example shows how technical limitations associated with label creation are actually what many people associate with medical text.\n\nA lot of examples are more like this:\n\n ![](http://web.archive.org/web/20141017164856im_/http:/typophile.com/files/PrescriptionBottle_5383.jpg)\n\n"
    },
    {
      "time": "15 Mar 2008 — 12:40am",
      "content": "To be honest, sometimes those monospaced dot matrix printer types makes me feel good, but sure, there is placement, composition, tables, &c.\n\nGeorge, you can browse [similar](http://web.archive.org/web/20141017164856/http:/www.abacusrx.com/images/pics/Forms/Rx%20Label.JPG) typefaces in “ [computer related](http://web.archive.org/web/20141017164856/http:/www.myfonts.com/browse/category/myfonts/computer/),” Telidon by Ray Larabie is one. This story/style finds a related start in 1968 when ATF produced [OCR-A](http://web.archive.org/web/20141017164856/http:/www.myfonts.com/fonts/adobe/ocra/), one of the first optical character recognition typefaces. John Scheppler’s Orator for IBM typewriters is another interesting case ; Anuthin Wongsunkakon’ Carbon (T-26) is interesting, too, in my opinion.\n\nA student of mine is graduating with a thesis on this (your post) topic, the title will be something like “Medical Point of Purchase.” If you want to share some information I can put you in touch with him.\n\n"
    }
  ]
}
