{
  "id": "43178",
  "title": "Visual ligatures vs. pronounced ligatures (and accents)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My alphabet (the Norwegian) contain the characters æ, ø and å.\n\n“Æ” (or “æ”) is a ligature made up of “a” and “e”. I’m not so sure what the two others are made up of. We tend to write “ø” as “oe” in international communication. I’ve seen “å” written as “aa” in old newspapers and letters, but I’ve also heard that it’s made up of “ao”.  \nThese ligatures, or accented characters, are contained in the alphabet to describe a certain sound.\n\nMy question is this: How come the Germans don’t include for example “ü” in their alphabet?\n\n [‹ Are you a Grammarian? 10 Grammar Myths](http://web.archive.org/web/20080316080836/http:/typophile.com/node/42956 \"Go to previous forum topic\") [Study on Medical Typography ›](http://web.archive.org/web/20080316080836/http:/typophile.com/node/43179 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080316080836/http://typophile.com/user/17101\" title=\"View user profile.\">frode frank</a>",
  "time": "<br>",
  "uid": "17101",
  "comments": [
    {
      "time": " 14.Mar.2008 11.43am",
      "content": "About “visual”: Some ligatures excist purely to solve a visual problem. I understand why they aren’t included in the alphabet. I’m just wondering why some characters that actually do represent spoken sounds don’t make it into the “official” alphabets.\n\n"
    },
    {
      "time": " 14.Mar.2008 11.45am",
      "content": "Same thing in German. For example: ä was built from merging a and e. It’s just not as apparent as æ.  \nä/ö/ü/ß are regular letters of the German alphabet.\n\n(Origin of å: http://en.wikipedia.org/wiki/Å)\n\n"
    },
    {
      "time": " 14.Mar.2008 11.49am",
      "content": "Does the æ in Norwegian work the same as it does in Icelandic?\n\nChrisL\n\n"
    },
    {
      "time": " 14.Mar.2008 1.34pm",
      "content": "I think diacritic mark is a more correct term.\n\nralf:  \nSeems I have jumped to the wrong conclusions:) I talked this over with a friend earlier. She claimed the german alphabet contained just A-Z + the double s.\n\nHowever, let’s use the French alphabet as an example.  \nThe have a few different accents, but none of them are in the alphabet.\n\ndezcom:  \nYes, I think so.  \nOur “æ” sound very much like the “a” in “carry” (to _carry_ a heavy load).\n\n"
    },
    {
      "time": " 14.Mar.2008 2.03pm",
      "content": "Well, it just depends what you call the “alphabet”. Even when I say, ä/ö/ü/ß belong to our alphabet, we still usually say the alphabet has 26 letters, so we don’t count ä/ö/ü/ß. In a broader sense the “alphabet” are the letters that were used for Latin. But all the languages that are based on the Latin alphabet needed special characters (diacritical marks) to represent the certain local pronounciations. This is true for almost all European languages. A French é is equally important as your å. The reason why people sometimes don’t consider them as part of the alphebet is because they are build from other latin characters. But that doesn’t mean they can be omitted. I cannot use a o instead of ø in your language, can I? Same is true for German umlaut or French accents.\n\n"
    },
    {
      "time": " 14.Mar.2008 3.00pm",
      "content": "I believe Ææ (Œœ) are digraphs, not ligatures, and I believe further that it is very much a distinction with a difference.\n\nI am rather certain that the German alphabet considers Ä, Ö, and Ü distinct letters. Some francophones act as though É really were its own letter, influenced, I think, by typewriter and computer keyboards.\n\nYour questions were a tad vague, though.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20080316080836/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 14.Mar.2008 3.48pm",
      "content": "There is a distinction between digraphs and ligatures however the “ash” (æ) is indeed a ligature. A digraph is a combination of 2 characters representing a single sound (like the ph in phonetic) but are not necessarily visually connected like the æ.\n\nMy interpretation (without any scholarly backing) is that most written languages based on the latin alphabet gave up trying to represent every specific sound in their language with a contrived alphabetic symbol and just started adding diacritic marks to the latin symbol that seemed closest.\n\nConsider the history of the U, double-U and V. All based on one latin symbol with 3 distinct sounds.\n\n"
    },
    {
      "time": " 14.Mar.2008 5.46pm",
      "content": "In Spanish, the accents simply mean either A- stress this letter, or B- break the diphthong that this letter is in. There is no unique sound to them other than the letter is pronounced slightly louder. Ñ is not considered an accented letter but a separate letter and represents a separate sound. Older standards (pre 1998) dictated that the sequence «áéíóñúü» be capitalized thus: «AEIOÑUU», although now it’s standard to see «ÁÉÍÓÑÚÜ». This shows they aren’t really needed for understanding the language though they certainly help.\n\nIn German the umlauts developed from the writing traditions which had the letter e placed over top of vowels at times. In old German handwriting, the e is composed of two diagonal strokes which later became realized as the umlaut we have today, again, German is quite readable without umlauts but it’s easier and more efficient with them.\n\nEach language has its reason for writing them as they do. In some cases it means taking one letter and overtime re-realizing it as another letter with a mark (z-\\>ç), while other times it’s quite deliberate (Danish aa-\\>å). Even the same modern diacritic can have two different sources and meanings in different languages (Germanic umlaut versus Romance diæresis).\n\nRalf, my understanding was that although discouraged, it’s always “okay” when umlauts aren’t available to replace them with ae, oe, and ue respectively. Has that changed?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 14.Mar.2008 7.10pm",
      "content": "<cite>«I believe Ææ (Œœ) are digraphs, not ligatures, and I believe further that it is very much a distinction with a difference.»</cite>\n\nWhen typing on a keyboard that does not facilitate inputting Æ/æ or Œ/œ, forcing you to type Ae/ae and Oe/oe, then they are digraphs. In themselves, though, Ææ and Œœ are both alphabetic ligatures, not digraphs: they are single letters. Note that alphabetic ligatures are different from typographic ligatures in that they are historical contractions of letters (or one letter plus a second element) that have become single entities, rather than merely specialised versions of one or more letters, designed to be used only in conjunction with certain other characters.\n\nOther examples of alphabetic ligatures are regular letters with diacritic marks, especially when they are considered single letters, rather than modified letters, and even the letter G.\n\n&nbsp;\n\n<cite>«Does the æ in Norwegian work the same as it does in Icelandic?»</cite>\n\nNot quite, no. It appears in many (though not all) of the same words, where there are cognates, as in Norwegian, but phonetically and grammatically, they behave in different ways. In Norwegian, æ can be both long and short and is pronounced either [æ: / æ] or [e: / e] (the former being the ‘default’ pronunciation, the latter only found in a smaller number of words), whereas in Icelandic, it is always long and represents the diphthong [ai].\n\nIn Norwegian, while the original grammatical (by which I really mean morpho-phonological) rôle is still found in many cases, it is no longer productive. In Icelandic, it is nearly always productive, though not always: æ is the regular outcome of an i-umlauted á. The concept of i-umlauting has been lost as a productive pattern in all Scandinavian languages (including Danish, but excluding Faeroese and Icelandic).\n\n&nbsp;\n\nThe traditional way of representing æ, ø, and å in the Scandinavian languages when stuck in Cambodian Internet cafés and other such æøå-derived locations, is ae, oe, and aa. However, lately there seems to be a growing trend (especially common among Swedes) to simply use a, o, and a. Thus, a Swede would now commonly write, _“Min vaska holl pa a bli ranat”_ (“My bag was being stolen”) in a colloquial-style e-mail from said Cambodian Internet café, whereas his worried mother sitting comfortably in her home in Swedish would be likely to reply with a properly diacrined (if I may thus verb a noun), though no more grammatically correct, _”Höll din väska på å bli rånat?”_.\n\n"
    },
    {
      "time": " 14.Mar.2008 7.33pm",
      "content": "Thanks, Janus!\n\nChrisL\n\n"
    },
    {
      "time": " 14.Mar.2008 9.00pm",
      "content": "What constitutes a distinct letter in one alphabet may be considered only a modification of a letter, and hence of its pronunciation, in another alphabet. Hence, the same diacritic letter may function differently in different alphabets. This may affect sorting decisions.\n\nJoe: _I believe Ææ (Œœ) are digraphs, not ligatures, and I believe further that it is very much a distinction with a difference._\n\nA digraph is a sequence of two letters functioning as a single phonemic signifier — e.g. ’ch’ in English ’church’ —, so the term doesn’t automatically apply to the æ and œ. I would probably call those something like ’compound letters’, at least as the former is used in Norwegian, which is as a distinct letter, sorting separately from a and å. In other languages, æ and œ might be encountered as optional variant forms of the digraphs ae and oe; this is largely as they occur in modern French. In Latin, these forms have gone in and out of fashion, so are probably best considered ’historical ligatures’ for that language. So whether æ and œ are letters, digraphs or ligatures depends on what language you are looking at.\n\n"
    },
    {
      "time": " 15.Mar.2008 1.22am",
      "content": "<cite>I believe Ææ (Œœ) are digraphs, not ligatures, and I believe further that it is very much a distinction with a difference.</cite>\n\nIt’s a common misunderstanding that a »ligature« has to be a different thing than letter, digraph or whatever. Ligature just means that there is something that is connected (From Latin LIGARE - to bind).\n\n<cite>Ralf, my understanding was that although discouraged, it’s always “okay” when umlauts aren’t available to replace them with ae, oe, and ue respectively. Has that changed?</cite>\n\nRight. Someone named »Jörg Müller« would have the eMail address [joerg.mueller@host.com](mailto:joerg.mueller@host.com). You shouldn’t address him as Jorg Muller.\n\n"
    },
    {
      "time": " 15.Mar.2008 3.37am",
      "content": "Whether these special glyphs are considered as separate letters or just diacritical could perhaps be differenciated by their status in a “alphabet listing” - as learned in school?\n\nThe norwegian (and danish) alphabet contains 29 letters:  \nABCDEFGHIJKLMNOPQRSTUVWXYZÆØÅ  \nbut we also use many letters with diacritics:  \nÀÉÓÔÒ and even others for foreign loanwords\n\nThe swedish alphabet also has 29 letters, but a different selection (and order):  \nABCDEFGHIJKLMNOPQRSTUVWXYZÅÄÖ\n\nThese are all considered as separate letters, with their own entries/sections in encyclopaedias and dictionaries.\n\nDo most other latin languages consider their alphabets to contain 26 letters?  \nHey, I’ll start a separate thread for that train of thought. Carry on. ;-)\n\n"
    }
  ]
}
