{
  "id": "43176",
  "title": "Medial \"s\"",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This has bothered me for a while now: Do you know if there ever was a point to the long ’s’ (ſ) or it were just a decorative distinction? Unlike letters like ’Ѣ’ or ’Ѳ’ that came to represent the same sounds as ’е’ and ’ф’ in Russian, but were originally distinct, the s’s seem to have derived from the same source, and have always sounded exactly alike. I guess, what I am trying to discover, is weather there was any rationale behind their use, or was it merely a fluke of the evolutionary process.\n\n_Granted, it looks ſtunningly impreſſive in Italics!_\n\n [‹ typefaces and what they tell us](http://web.archive.org/web/20081119053101/http:/www.typophile.com/node/43018 \"Go to previous forum topic\") [Type families ›](http://web.archive.org/web/20081119053101/http:/www.typophile.com/node/43144 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081119053101/http://www.typophile.com/user/23991\" title=\"View user profile.\">oprion</a>",
  "time": "<br>",
  "uid": "23991",
  "comments": [
    {
      "time": " 14.Mar.2008 11.03am",
      "content": "[http://en.wikipedia.org/wiki/Long\\_s](http://web.archive.org/web/20081119053101/http:/en.wikipedia.org/wiki/Long_s \"http://en.wikipedia.org/wiki/Long\\_s\")\n\n"
    },
    {
      "time": " 14.Mar.2008 12.12pm",
      "content": "The long s was the default form of the letter, the short s being used only at the end of words, or as the second of two s’s.  \nSo the version in need of a rationale is the short s; why was an alternate form considered necessary, by scribes, for the end of words? Was there an ergonomic dividend, or did it just look good?\n\nIMO it was banished from the type case (in France first) due to a congruence of aesthetic and practical factors, the aesthetic being the 18th century modern movement, which was reductive (as modernism tends to be), the practical being the advatages to be had simplifying the contents of the type case by removing an alternate which was fragile and tricky to fit, necessitating many ligatures. There may also have been a connection to the increase in general literacy and reading which occurred at that time, so it could be considered “dumbing down”.\n\nAn interesting parallel today is the replacement of contextual alternates for left and right quote marks—“curly quotes”— by the single form of vertical “hash marks”, which would suggest that the process is indeed technologically precipitated, but adopted by a new franchise of users for whom the traditional distinction is meaningless.\n\nBTW, a parallel in Greek is the two forms of beta (again, with and without descender) used in some orthographies, although the version with descender was used only at the beginning of words, in a quasi-titlecase usage. At least, that’s my understanding, perhaps someone who is more of a Greek scholar than I am can confirm this?\n\n ![](http://web.archive.org/web/20081119053101im_/http:/www.typophile.com/files/barb_4300.png)\n\n"
    },
    {
      "time": " 14.Mar.2008 1.47pm",
      "content": "Hmm I wonder if there was a potential for it to emerge as a separate letter, similar to what happened with u/v.  \nInterestingly, I’ve heard an alternative theory, that it was the terminal s that will difficult to set as it tended to break, and was thus used sparingly, but your version sounds a lot more convincing.  \nI also vaguely remember something about a short s being used before f and k, and double ſſ being more standard to English then the Germanic ſs or ß.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20081119053101/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 15.Mar.2008 12.05pm",
      "content": "It seems to me there must be a relation between the short s and the terminal sigma.\n\n"
    }
  ]
}
