{
  "id": "43187",
  "title": "Missing parts of letterforms",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello\n\nI am currently intrigued by typefaces which aren't all there!\n\n[This is an idea I have been working on.](http://web.archive.org/web/20131026221100/http:/www.howenow.co.uk/suggestion.pdf)\n\nThese are a few other typefaces I have looked at (Phil Baines & Barbara Butterweck - both for FUSE).\n\n ![](http://web.archive.org/web/20131026221100im_/http:/typophile.com/files/letterforms_6494.JPG)\n\nNow I am interested in what everybody has to say on the matter - what works? What doesn't? Everybody I have asked seems to be able to read my design with little trouble when used in display and they have said that it is easier to read from a distance. I know we often see word shapes and not just individual letter shapes and this is important. Enough of my misinformed generalisations - tell me what you think please.\n\nTom\n\n",
  "author": "tomhowe",
  "time": "14 Mar 2008 — 5:47pm",
  "uid": "14955",
  "comments": [
    {
      "time": "14 Mar 2008 — 5:54pm",
      "content": "I think the T looks a little bit too much like the L. Also you might try doing the Q as the G but with a lower crossbar instead of a trailing stroke. I know I write my lowercase Gs and Qs identical except for it, and I went through a similar process a you did to simplify my handwriting.\n\nBut, looking very good.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "14 Mar 2008 — 6:24pm",
      "content": "Interesting.\n\nI've been looking at similar \"frontiers\" of legibility in deteriorated signage.\n\n[http://typophile.com/node/40826](http://web.archive.org/web/20131026221100/http:/typophile.com/node/40826 \"http://typophile.com/node/40826\")\n\n-=®=-\n\n"
    },
    {
      "time": "14 Mar 2008 — 6:41pm",
      "content": "Russell, I notice you mention the issue of 'illegibility' and 'Guifa' you pointed out that some of my letters may be confused with others. Not that it would be of much use to anyone, how about a typeface which really makes it difficult to distinguish between different forms?\n\n"
    },
    {
      "time": "14 Mar 2008 — 6:46pm",
      "content": "Maybe...\n\n ![](http://web.archive.org/web/20131026221100im_/http:/typophile.com/files/missing_3679.JPG)\n\n"
    },
    {
      "time": "14 Mar 2008 — 7:20pm",
      "content": "Now that one just hurts my eyes from the optical effects inherent in such designs. But if I squint my eyes I can read it more or less okay (the W and M are the same, for instance).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "16 Mar 2008 — 1:43pm",
      "content": "I'd be interested in seeing more samples (not alphabetical) so that we can see if the letters are still unidentifiable when they're out of order.\n\n"
    },
    {
      "time": "27 Mar 2008 — 5:26pm",
      "content": "Today I saw a logo on a moving truck that reminded me of this thread.\n\n ![](http://web.archive.org/web/20131026221100im_/http:/typophile.com/files/isaac_cordoba_cut_letters_3444.jpg)\n\nAs you can see, while not as drastically chopped off as your examples (nor as nice looking), it shows what has been done,. For example, the A I think most would not recognize if it were not for context, same for the S. The R and the B I think could hvae some confusion as well. But all put together, there is no trouble in reading it.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "28 Mar 2008 — 1:39pm",
      "content": "I have a feeling that when used to actually spell out words, at least the Futura example will become unreadable. The Clarendon might work.\n\n- Lex\n\nP.S. That \"CORDOBA\" logo is set in Motter Tektura.\n\n"
    }
  ]
}
