{
  "id": "4318",
  "title": "Printing Metallic Colors",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello   \n   \ni am preparing a broshure where i use 3 colors. Propably it will be 158 CV (orange), 539 CV (Dark Blue) and the metallic silver 877. I want to make compinations with those colors and also to use the silver 877 in tints to get tones in a picture.   \n   \nI would appreciate it if you could give me any tips about printing metallic colors.   \n   \nchristos\n\n",
  "author": "tsoler",
  "time": "Fri, 2004-04-16 07:28",
  "uid": "1058",
  "comments": [
    {
      "time": " Fri, 2004-04-16 08:45",
      "content": "Christos,   \n   \nThe Pantone web site has some very good information on metallic colours used in printing. Follow the links on this page.   \n [http://www.pantone.com/products/products.asp?idSubArea=0&idArea=1&idProduct=316&idArticleType\\_Products=0&ShowNav=23](http://web.archive.org/web/20050516143152/http:/www.pantone.com/products/products.asp?idSubArea=0&idArea=1&idProduct=316&idArticleType_Products=0&ShowNav=23)   \n   \nYou should also talk to your printer about what you want to do.   \n   \ngln\n\n"
    },
    {
      "time": " Fri, 2004-04-16 11:17",
      "content": "1. If you have large solid areas, always add a varnish -- metallics pick up fingermarks far more easily. (Think of aluminum fridge doors..)   \n   \n2. Type knocked out of a metallic works far better than surprinting (in other words, the reader's situation is usually with the metallic reflecting a darker part of their environment, so metallics appear dark in usage). In particular, surprinting fine black type on a solid metallic is a bad idea, as it doesn \"sit\" very well on the surface.   \n   \n3. Always use coated stock -- uncoated can look ghastly.   \n   \n4. Straight silver can look a little uneven (it tends to pick up the slightest unevenness in the paper stock) -- splurge on the \"mixed metallics\" pantone book, and try some subtler effects -- more like \"pewter\".\n\n"
    },
    {
      "time": " Sat, 2004-04-17 19:34",
      "content": "Weight and quality of paperstock is criticial when using metallics.   \n   \nYou need to be aware that metallics have a greater degree of opacity than standard inks. As a result, on lightweight or low-grade paper stocks the will tend to show through on the reverse side of the paper or even bleed through the paper itself.   \n   \nYour printer will generally advise on the minimum grade of paperstock you should be using.\n\n"
    },
    {
      "time": " Mon, 2004-04-19 05:06",
      "content": "Thank you all for the advices...the day after tommorow is the final day. I will talk to my printer and mention your recommendations.   \n   \nhave a good day   \n   \nchristos\n\n"
    },
    {
      "time": " Mon, 2004-04-19 08:40",
      "content": "\"_3. Always use coated stock -- uncoated can look ghastly.\"_   \n   \nI think this is not as clear cut as it might seem. If you choose the right uncoated stock, you can mute the reflective quality for a more subtle effect (I've done this). However, for what you want to do, I'd agree with Nick.\n\n"
    }
  ]
}
