{
  "id": "43194",
  "title": "graphic design studio logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "hello guys, im developing the logo of my design studio, so i want some advices and critiques... ok? thanks in advance\n\n| Attachment | Size |\n| --- | --- |\n| [lettering03.jpg](http://web.archive.org/web/20080925090730/http:/typophile.com/files/lettering03.jpg) | 22.29 KB |\n\n [‹ Simple Logo Redesign for Financial Advisor Company](http://web.archive.org/web/20080925090730/http:/www.typophile.com/node/43932 \"Go to previous forum topic\") [How does this image look to you? ›](http://web.archive.org/web/20080925090730/http:/www.typophile.com/node/43874 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080925090730/http://www.typophile.com/user/11632\" title=\"View user profile.\">dblanco</a>",
  "time": "<br>",
  "uid": "11632",
  "comments": [
    {
      "time": " 15.Mar.2008 5.30am",
      "content": "Sorry but I can’t work out what it says? - is it ’deveras’?\n\n- the lower case ’e’ is an interesting looking character.\n\n"
    },
    {
      "time": " 15.Mar.2008 7.38am",
      "content": "yes, it´s deveras, its a brazillian antique word!\n\n"
    },
    {
      "time": " 15.Mar.2008 7.56am",
      "content": "Good start but it is a bit hard to read, especially at a smaller size (I imagine it would go on stationary, sites etc). I would work more in refining the e+r. The “s” needs to open up a bit as well. You might have to exaggerate some of these quirkiness so it is readable at that small of a scale.\n\n"
    },
    {
      "time": " 16.Mar.2008 8.59pm",
      "content": "I found this so hard to read that I started feeling anxious. Does “deveras” mean anything along the lines of Spanish “de veras” or Italian “davvero”? Because your text does not communicate the sense of affirmation, confidence, or surprise that these phrases mean in the languages I mention. Of course, I am ignorant of Portuguese, so I would like to understand the meaning of the word before responding further.\n\n"
    },
    {
      "time": " 16.Mar.2008 10.56pm",
      "content": "Agreed. I had to work out what each letter was even at that size. Focus on the readability of your letterforms.\n\n"
    },
    {
      "time": " 18.Mar.2008 8.33am",
      "content": "I couldn’t read the R. I sat there and tried and tried to figure out what it was but it wasn’t clear until I read the comments. Perhaps because the rest are lower case.\n\n"
    },
    {
      "time": " 19.Mar.2008 7.47am",
      "content": "I like it. I think it would stand out from the crowd in a bunch of logos for graphic design studios. I think you need to open up the apertures on the Es, R and S though to make it more readable. I don’t think it would be legible at small sizes in it’s current form.\n\nNice work. Did you create this from the beginning?\n\nRoss\n\n"
    },
    {
      "time": " 27.Mar.2008 3.32am",
      "content": "hello guys ! thanks for the opinions and tips... yes, this lettering isnt so easy to read...it was my goal (hehhe).... and i thinks the problems you mentioned are real...\n\nDEVERAS is an oldfashioned word that means “real, true, that´s it”.... something like: “he DOES like the ramones...” or “...i liked this band from its VERY beginning...” its an affirmation...did you get that ?\n\nim so busy, so i will post the logo updated with the considerations you made here! thanks\n\nrlynch: i created it from the beginning...thanks for the nice words\n\nsorry bout the bad english...im still learning to write ! lol\n\ndiogo (hugs from brasil)\n\n"
    },
    {
      "time": " 27.Mar.2008 12.47pm",
      "content": "The expression in english would be “true that.” I think it’s a great choice.\n\n"
    },
    {
      "time": " 5.Apr.2008 4.18pm",
      "content": "hello guys, theres a new lettering !!! fire at will...hahha\n\n ![](http://web.archive.org/web/20080925090730im_/http:/www.typophile.com/files/logotipo_deveras_final_5483.jpg)\n\n"
    },
    {
      "time": " 7.Apr.2008 6.09am",
      "content": "this is really difficult to read ... especially at smaller sizes.\n\nwhat sort of design services do you offer?\n\n—————  \n**Paul Ducco**  \n [Logo Design](http://web.archive.org/web/20080925090730/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 7.Apr.2008 11.26am",
      "content": "The changes you made really don’t help. Perhaps it’s a matter of personal preference, but I don’t like it. Imagine if an engine block, a library and Ms. Pac Man had a baby: this would be the type that you could use for the baby’s name. And as Paul just said, it’s still hard to read.\n\nI suggest you go back to the drawing board on this one.\n\n—-  \nNick Hladek\n\n"
    },
    {
      "time": " 7.Apr.2008 11.53am",
      "content": "What kind of clients do you have? Certainly not corporate, get my drift.\n\n"
    }
  ]
}
