{
  "id": "43193",
  "title": "How goes the \"ABC\" in your country/language?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm curious to know how you learned the [alphabet](http://web.archive.org/web/20120126173114/http:/www.typophile.com/wiki/alphabet) in school. You know, the selection and order of the letters used to teach children the official alphabet in your country/region - what might be on top of the blackboard in first grade ;-)  \n**NOT looking for ALL characters used/needed in a language (I got that covered), only the basic \"A to Z\" or whatever you call it.**\n\nThis to get an overview over what may be considered separate basic letters in your language - it could perhaps be useful for a type specimen/sample directed towards specific languages?\n\nI'll start with the five languages I know first-hand - and expand with your input (\\*):\n\n\\*Bulgarian: 29 letters =\\>АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЬЮ  \n\\*Croatian: 30 letters (A to Ž) =\\> ABCČĆD Dž ĐEFGHIJKL Lj MN Nj OPRSŠTUVZŽ  \n\\*Czech: (42(!) letters =\\> AÁBCČDĎEÉĚFGH CH IÍJKLMNŇOÓPQRŘSŠTŤUÚŮVWXYÝZŽ  \nDanish: 29 letters (A to Å) =\\> ABCDEFGHIJKLMNOPQRSTUVWXYZÆØÅ  \nEnglish: 26 letters (A to Z) =\\> ABCDEFGHIJKLMNOPQRSTUVWXYZ  \n\\*Esperanto: 28 letters =\\> ABCĈDEFGĜHĤIJĴKLMNOPRSŜTUŬVZ  \n\\*Finnish: 29 letters (A to Ö) =\\> ABCDEFGHIJKLMNOPQRSTUVWXYZÅÄÖ  \n\\*German: 30 letters =\\> abcdefghijklmnopqrstuvwxyzäöüß  \n\\*Greek: 24 letters (Α to Ω) =\\> ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ  \n\\*Hawaiian: 13(!) letters =\\> AEIOUHKLMNPWʻ  \n\\*Hungarian: 44(!) letters =\\> aábc cs d dz dzs eéfg gy hiíjkl ly mn ny oóöőpqrs sz t ty uúüűvwxyz zs  \n\\*Icelandic: 30 letters (A to Ö) =\\> ABCDÐEFGHIJKLMNOPQRSTUVWXYZÞÆÖ  \n\\*Irish Gaelic (Gaeilge): 18(23) letters =\\> ABCDEFGHILMNOPRSTU (ÁÉÍÓÚ)  \n\\*Italian: 22(29) letters (A to Z) =\\> abcdefghijlmnopqrstuvz (àéèìòù î)  \nNorwegian: 29 letters (A to Å) =\\> ABCDEFGHIJKLMNOPQRSTUVWXYZÆØÅ  \n\\*Polish: 32 letters =\\> AĄBCĆDEĘFGHIJKLŁMNŃOÓPRSŚTUWYZŹŻ  \n\\*Portuguese: 26 letters (A to Z) =\\> ABCDEFGHIJKLMNOPQRSTUVWXYZ  \n\\*Russian: 33 letters =\\> АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ  \nSaami (north): 29 letters =\\> AÁBCČDĐEFGHIJKLMNŊOPRSŠTŦUVZŽ  \n\\*Saami (skolt): 37 letters =\\> АÂBCČƷǮDĐEFGǦǤHIJKǨLMNŊOÕPRSŠTUVZŽÅÄˊ  \n\\*Slovak: 46(!) letters =\\> AÁÄBCČDĎ DZ DŽ EÉFGH CH IÍJKLĹĽMNŇOÓÔPQRŔSŠTŤUÚVWXYÝZŽ  \n\\*Spanish: 27(29) letters =\\> ABCDEFGHIJKLMNÑOPQRSTUVWXYZ (Ch Ll)  \nSwedish: 29 letters (A to Ö) =\\> ABCDEFGHIJKLMNOPQRSTUVWXYZÅÄÖ  \n\\*Turkish: 29 letters (A to Z) =\\> ABCÇDEFGĞHIİJKLMNOÖPRSŞTUÜVYZ\n\nPlease supply the \"ABC\" for your country/language :-)  \n(apologies if this has already been covered - I searched, but found nothing on these forums)\n\n",
  "author": "<a href=\"/web/20120126173114/http://www.typophile.com/user/27336\" title=\"View user profile.\">Roger S. Nelsson</a>",
  "time": "<br>",
  "uid": "27336",
  "comments": [
    {
      "time": "",
      "content": "German: 30 letters =\\> abcdefghijklmnopqrstuvwxyzäöüß  \n(can't do it in caps, because we are still working on getting an uppercase ß)\n\nBTW: You can easily search for every alphabet at Wikipedia:  \n [http://en.wikipedia.org/wiki/Norwegian\\_alphabet](http://web.archive.org/web/20120126173114/http:/en.wikipedia.org/wiki/Norwegian_alphabet \"http://en.wikipedia.org/wiki/Norwegian\\_alphabet\")  \n [http://en.wikipedia.org/wiki/French\\_alphabet](http://web.archive.org/web/20120126173114/http:/en.wikipedia.org/wiki/French_alphabet \"http://en.wikipedia.org/wiki/French\\_alphabet\")  \n...\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Ralph! :-)  \nSo when learning the german alphabet at school the three diacritic letters are bolted on at the end of the A-Z, and the ß is of course a special case?  \nI was afraid this might get complicated (I'm anxiously awaiting the status of e.g. the Ññ for spanish ;-)\n\nYes, I have looked at wikipedia (which e.g. says that portuguese has 23 letters - omitting KWY), but... with wikipedia being wikipedia, what I'm looking for is firsthand experiences of what you actually learned at school :-)\n\n"
    },
    {
      "time": "",
      "content": "Gaeilge: 18(23) letters=\\> ABCDEFGHILMNOPRSTU(ÁÉÍÓÚ)\n\nA few letters from the standard Latin alphabet creep into use for modern and anglicised words. We don’t strictly learn this alphabet in school – generally it is the English alphabet that is taught. I could go off on a rant – but I’ll bite my lip.\n\n"
    },
    {
      "time": "",
      "content": "Finnish (29): ABCDEFGHIJKLMNOPQRSTUVWXYZÅÄÖ\n\n"
    },
    {
      "time": "",
      "content": "Portuguese\n\nPortugués from Portugal\n\nPortuguês from Brazil\n\n37 Letters:\n\nABCDEFGHIJKLMNOPQRSTUVXYZ\n\nÁ À Â Ã É Í Ó Ô Õ Ú Ü Ç\n\nYou can find out more in these links:\n\n[http://en.wikipedia.org/wiki/Portuguese\\_language](http://web.archive.org/web/20120126173114/http:/en.wikipedia.org/wiki/Portuguese_language \"http://en.wikipedia.org/wiki/Portuguese\\_language\")  \n [http://www.omniglot.com/writing/portuguese.htm](http://web.archive.org/web/20120126173114/http:/www.omniglot.com/writing/portuguese.htm \"http://www.omniglot.com/writing/portuguese.htm\")\n\nCheers\n\n"
    },
    {
      "time": "",
      "content": "<cite>«Danish: 29 letters =&gt; ABCDEFGHIJKLMNOPQRSTUVWXYZÆØÅ»</cite>\n\nGrowing up, I was always taught in school that the Danish alphabet has only 28 letters, w not being part of it; but this seems to have changed recently. Even _Retskrivningsordbogen_ now has a separate entry for w, which it did not before.\n\nI’m glad of this, by the way, since lumping w in with v never made sense to me.\n\n&nbsp;\n\n<cite>«Gaeilge: 18(23) letters=&gt; ABCDEFGHILMNOPRSTU(ÁÉÍÓÚ)»</cite>\n\nWhat is the status of h as a letter in Gaeilge? J, k, q, v, w, x, y, and z are only used in foreign words and are not counted as parts of the actual _aibítir_, but then again, the same goes for h, doesn’t it? The only indigenous word I can think of that contains an h would be _hurlamaboc_ (and that’s an onomatopoeia, barely an actual word)—is one word really enough to consider h a separate Irish letter, rather than a function?\n\n"
    },
    {
      "time": "",
      "content": "Conor: That would be irish gaelic, right?  \nThanks for not delwing too deep into the politics ;-)\n\nmili: so the basic finnish is the same as swedish (as danish and norwegian is also the same)...\n\nAGL: Yes, I know all those letters are needed for portuguese, but are they all considered basic letters? (you must have long blackboards in portuguese schools ;-) What I'm looking for is the stream of letters a child would give you if you asked if it knew the alphabet...\n\nOisín: interesting input :-)\n\nI've updated the first post to include these contributions...  \nKeep 'em coming :-)\n\n"
    },
    {
      "time": "",
      "content": "<cite>«Yes, I know all those letters are needed for portuguese, but are they all considered basic letters? (you must have long blackboards in portuguese schools ;-) What I’m looking for is the stream of letters a child would give you if you asked if it knew the alphabet...»</cite>\n\nNo, they’re not all considered basic letters, only the letters without diacritics are. And unlike in Spanish where Ll, Ñ, and Rr are considered separate letters (though Rr is sometimes an exception; it also never occurs initially, and thus has no separate dictionay entry), the Portuguese equivalents of these letters, Lh, Nh, and Rr, are considered regular digraphs, too, not individual letters. (See [Wikipedia article](http://web.archive.org/web/20120126173114/http:/en.wikipedia.org/wiki/Portuguese_alphabet#Basic_digraphs))\n\n&nbsp;\n\nAnd yes, Gaeilge (or Gaedhilge, Gaedhilg, Gaoluinn, Gaolainn, etc.) is Irish Gaelic, pronounced [ˈɡɛɪlɪk]. Scottish Gaelic, pronounced [ˈɡa(:)lɪk], would be Gàidhlig (interestingly, unlike the Irish, they don’t seem too keen on having half a bazillion different names for their own language). :-)\n\n[Edited for IPA accuracy]\n\n"
    },
    {
      "time": "",
      "content": "<cite>(interestingly, unlike the Irish, they don’t seem too keen on having half a bazillion different names for their own language). :-)</cite>\n\nI can relate to that - I'm not sure if I should call our indigenous language saami, sami og sámi... (but at least it is only called \"samisk\" in norwegian and \"samigiela\" in saami/sami/sámi ;-)\n\n"
    },
    {
      "time": "",
      "content": "Or Sápmi, even, if you’re nominatively inclined. ;-)\n\n(Doesn’t _sámigiella_ have two l’s?)\n\n"
    },
    {
      "time": "",
      "content": "_\"AGL: Yes, I know all those letters are needed for portuguese, but  \n are they all considered basic letters? (you must have long blackboards in portuguese  \n schools ;-) What I’m looking for is the stream of letters a child would  \n give you if you asked if it knew the alphabet.\"_\n\nThanks Roger\n\nUpdate:  \n A to Z, a to z, plus numbers. We had to learn it as a manuscript form.\n\n"
    },
    {
      "time": "",
      "content": "Oisín: <cite>Or Sápmi, even, if you’re nominatively inclined. ;-)<br>\n(Doesn’t sámigiella have two l’s?)</cite>  \nQuite possibly - I don't know how to read/write these languages, only how to design the letters ;-)\n\nAGL: thanks for clearifyng - list updated.\n\n"
    },
    {
      "time": "",
      "content": "here goes Polish (32): AĄBCĆDEĘFGHIJKLŁMNŃOÓPRSŚTUWYZŹŻ\n\nNotice that there's no Q, V and X which are used in some foreign words only and can be pronounced with KW, W and KS.\n\n[http://en.wikipedia.org/wiki/Polish\\_alphabet](http://web.archive.org/web/20120126173114/http:/en.wikipedia.org/wiki/Polish_alphabet)\n\n"
    },
    {
      "time": "",
      "content": "Esperanto: 28 letters\n\nABCĈDEFGĜHĤIJĴKLMNOPRSŜTUŬVZ\n\n[http://en.wikipedia.org/wiki/Esperanto](http://web.archive.org/web/20120126173114/http:/en.wikipedia.org/wiki/Esperanto \"http://en.wikipedia.org/wiki/Esperanto\")  \nMore on the alphabet: [http://en.wikipedia.org/wiki/Esperanto\\_alphabet](http://web.archive.org/web/20120126173114/http:/en.wikipedia.org/wiki/Esperanto_alphabet \"http://en.wikipedia.org/wiki/Esperanto\\_alphabet\")\n\nNote: I am not an esperanto speaker.\n\n"
    },
    {
      "time": "",
      "content": "Slovak:\n\nA, Á, Ä, B, C, Č, D, Ď, DZ, DŽ, E, É, F, G, H, CH, I, Í, J, K, L, Ĺ, Ľ, M, N, Ň, O, Ó, Ô, P, Q, R, Ŕ, S, Š, T, Ť, U, Ú, V, W, X, Y, Ý, Z, Ž\n\nSometimes I'm frustrated with the implementations of Central European accented characters in typefaces by non-CE designers. I have a client who will use Charter for long text purposes. Now see for yourself some of the available versions with CE codepage – this three have\n\n1) different carons in ď, ľ, ť  \n2) different euro sign (please tell me which euro character is best in your opinion)  \n3) different color of carons in č, š, ž etc. (darker vs. lighter)\n\nBT Charter Pro  \n [http://www.myfonts.com/fonts/bitstream/charter-bt-pro/roman/charmap.html...](http://web.archive.org/web/20120126173114/http:/www.myfonts.com/fonts/bitstream/charter-bt-pro/roman/charmap.html?vid=239841&cpselect=CP5 \"http://www.myfonts.com/fonts/bitstream/charter-bt-pro/roman/charmap.html?vid=239841&cpselect=CP5\")\n\nITC Charter Pro  \n [http://www.linotype.com/168474/itccharterproregular-charactermap.html](http://web.archive.org/web/20120126173114/http:/www.linotype.com/168474/itccharterproregular-charactermap.html \"http://www.linotype.com/168474/itccharterproregular-charactermap.html\")\n\nITC Charter Com  \n [http://www.linotype.com/140466/itccharterbylinotypecomregular-characterm...](http://web.archive.org/web/20120126173114/http:/www.linotype.com/140466/itccharterbylinotypecomregular-charactermap.html \"http://www.linotype.com/140466/itccharterbylinotypecomregular-charactermap.html\")\n\nThe amazing thing is, the latter two are both from Linotype.\n\n"
    },
    {
      "time": "",
      "content": "kontrapunkt: polish added to the list. Thanks!\n\npattyfab: adding esperanto, even though it came from a non-native speaker ;-)  \nI thought the diacritics was pronounciation related, but apparently they're not.  \n(And might I add: the lowercase ĥ is a nightmare to fit into the design of a font ;-)\n\nloremipsum: Wow! Are all those considered separate letters? None are e.g. accented for modified pronounciation or something? So a child listing the alphabet has to differenciate between -let me count- 46 letters while learning their A to Z !?  \nAsking because Wikipedia only lists the non-accented letters: <cite>The lexicographic ordering of the Slovak alphabet is very similar to that of English: A B C D DZ E F G H CH I J K L M N O P Q R S T U V W X Y Z. The complete alphabet, however, allows for characters with diacritics.</cite> So, 28 letters... Sounds simpler, but I'm not slovak ;-)\n\nAlso I'm intrigued by the double letters that are considered as a single entry in the alphabetical order. Fascinating stuff, this. :-)\n\n"
    },
    {
      "time": "",
      "content": "<cite>«I thought the diacritics was pronounciation related, but apparently they’re not.»</cite>\n\nIn Esperanto? Yes, they are.\n\nc = [ts] vs. ĉ = [tʃ]  \ng = [ɡ] vs. ĝ = [dʒ]  \nh = [h] vs. ĥ = [x _or_ χ]  \nj = [j] vs. ĵ = [ʒ]  \ns = [s] vs. ŝ = [ʃ]  \nu = [u] vs. ŭ = [w] (used only in diphthongs _aŭ_ and _eŭ_, and word-initially)\n\n"
    },
    {
      "time": "",
      "content": "There are estimated to be 1000 native Esperanto speakers. Be an interesting article or documentary film to find them. Native as opposed to taught. Gotta wonder about their parents.\n\n"
    },
    {
      "time": "",
      "content": "Hi Roger, my list is actually copied from Slovak wiki:  \nhttp://sk.wikipedia.org/wiki/Slovenská\\_abeceda\n\nIt's 46 letters. Yes, children must learn to read and write them all in the 1st school year.\n\nThe letters represent different sounds.\n\ná, é, í, ó, ú, ý are long sounds for a, e, i, o, u, y  \nE. g. Slovak ice-hockey player Marian Gaborik (Minnesota) is actually Marián Gáborík, pronounced Maria:n Ga:bori:k  \nĺ, ŕ are long sounds for l, r. Although r is pronounced very differently from English r, difference in length between r and ŕ is similar to r in English \"straight\" and \"burn\".  \nThese long sounds are not sorted separately in alphabetic lists.\n\nCarons:  \nč is prounounced as ch in English \"child\".  \nď is a little similar to UK pronunciation of d in \"dew\". (Uppercase form is Ď)  \nľ is pronounced similar to gl in Italian \"Cagliari\". (Uppercase form is Ľ)  \nň is pronounced as gn in Italian \"lasagne\", simlar to ny in English \"canyon\"  \nš is pronounced as sh in \"English\"  \nE. g. Slovak ice-hockey player Miroslav Satan (NY Islanders) is actually Miroslav Šatan, no association with Lucifer.  \nť is a little similar to UK pronunciation of t in \"tune\" ((Uppercase form is Ť)  \nž is pronounced as J in French name \"Jean\" or s in English \"pleasure\".  \nThese are sorted separately in alphabetic lists. Č after C, Ď after D etc.\n\nThen there is dz and dž:  \ndz is pronounced similar to ds in English \"odds\"  \ndž is pronounced as dg in English \"edge\" or j in \"jam\"  \nTypography-wise, it is not a ligature but simply d followed by z (or ž).  \nDz and Dž should be sorted separately. But sometimes they are in the end of D-section of alphabetic lists.  \nWritten as DZ and DŽ when all caps is used.\n\nCh: written as Ch if it is the first letter of names , sentence etc. Written as CH when all caps is used.  \nPronounced as J in Spanish name \"Juan\" or Kh in Russian surname Khrushev or ch in Scottish pronunciation of \"Loch Ness\"  \nCh is placed after H in alphabetic lists.\n\nThen we have ô:  \nit is \"uo\" pronounced simultaneously, little similar to uo in English \"quote\".\n\nä - pronounced as a in English \"mad\". Something between a and e, but majority of native speakers now pronounce it as simple e, like in English \"bet\".\n\ny is pronounced as i - no difference, only in written language.  \nj is pronounced as y in English \"yes\"  \nw is pronounced as v - no difference, only in written language (w is used in the words of foreign origin only)\n\nWhat is much more important, Slovakia has the greatest concentration of pretty women in the world. Especially Englishmen and Germans are very often embarrassed because of this in the streets of our towns.\n\nBTW, Slovak model Adriana Karembeu-Sklenarikova has Czech surname: it is actually Sklenaříková with Czech ř character, pronounced as r and z simultaneously.\n\n"
    },
    {
      "time": "",
      "content": "<cite> And unlike in Spanish where Ll, Ñ, and Rr are considered separate letters (though Rr is sometimes an exception; it also never occurs initially, and thus has no separate dictionay entry)</cite>\n\nClose, but most native speakers get it confused too. In Spanish the alphabet is (letters not in the English alphabet emboldened)\n\nA B C **Ch** D E F G H I J K L **Ll** M N **Ñ** O P Q R S T U V W X Y Z\n\nPart of the reason that the double r is not seen a separate letter is that, in reality, it simply represents a normal r, twice. Two flaps are for all intents and purposes, a trill. A single r is an alveolar flap in most dialects, and a double r is a alveolar trill. In the dialect of Portuguese I learnt, the r is either a flap or aspiration, and the double r is another sound entirely, roughly a voiceless uvular fricative though not quite exactly the same as the Spanish j.\n\nDictionaries are no longer sorted according to the alphabet, as in 1992 the RAE decided to not use the Spanish alphabet for collating purposes, although children are still taught the above alphabet. Additionally, each vowel can have an acute accent placed over it, though they aren't considered separate letters. As well the U can take a diæresis.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "<cite>«Part of the reason that the double r is not seen a separate letter is that, in reality, it simply represents a normal r, twice.»</cite>\n\nI don’t doubt that your information is more correct than mine (you’re the native speaker, after all), but I have often heard Spanish people spelling words like _pero_ and _perro_ as, respectively, “Pe E Ere O” and “Pe E Erre O”, which led me to believe that Rr is (at least in the mind of the common man) a separate letter. I’ve never heard a Portugese person spell out similar words like “Pê Ê Erre Ô”.\n\n(Theoretically, I suppose he’d be more inclined to spell it out as “Cê A com tilde O”, anyways, but that’s a different matter.)\n\nNot sure exactly how I managed to leave Ch out of the list before, though …\n\n&nbsp;\n\n<cite>«Dictionaries are no longer sorted according to the alphabet»</cite>\n\nWhat, then, length? ;-)\n\nFor some reason, I had never before realised that of the Spanish dictionaries I have (not that many, mind, only four), it’s only some of them that are sorted according to the alphabet you laid out above, and the way I’ve always learned it. My 2001 _Pequeño Larousse_, for example, lists Ll under L and so on. How did I miss this for so many years and still manage to use these dictionaries?\n\n"
    },
    {
      "time": "",
      "content": "I'm not a native speaker, though I study Spanish academically (native English but after living in Spain now my English has noticeably gotten worse mostly in syntax)\n\nAs I mentioned, many people mistakenly think that since LL is a letter, that RR is as well, even making its way into games like Scrabble, so as you mention, in the minds of the average person it is often thought of as a letter. I generally say \"erre doble\" when it pops up like I do with t when I inevitably have to spell out my obviously foreign name over here (eme a te doble hache e uve doble); otherwise they think I'm just repeating myself for emphasis, rather than because it actually is a doubled letter. Even for the CH, I generally spell Stuckwisch as ese te u ce ca uve doble i ese ce hache, to make sure they heard me correctly and because it's not of Spanish origin and thus it actually IS a c and an h. (it is possible to have a double R that is not a digraph, such as in the word superresponsable, which _technically_ should be supe **rrr** esponsable) because it's a flap followed by a separate and in theory distinct trill, but unlike the recent German reform, the Spanish realise that three letters like that in a row looks kind of silly).\n\nIn the entry for «abecedario» in the Diccionario panhispánico de dudas (published by the RAE) it mentions the following (I'm posting the translation for others, but the original is at rae.es in the DPHD\n\n**alphabet**. 1. To designate the ordered series of letters with which ones represents the sounds of a language, the terms abecedary and alphabet are used indistinctively. Like the rest of the romance languages, Spanish basically uses the Latin alphabetic series, which was adapted and completed over the course of the centuries. The Spanish alphabet is today formed by the twenty-nine following letters: _a, b, c, ch, d, e, f, g, h, i, j, k, l, ll, m, n, ñ, o, p, q, r, s, t, u, v, w, x, y, z_.  \n2. This Spanish variant of the universal Latin alphabet has been used by the Academy since 1803 (forth edition of the academic _Dictionary_) in the production of all its alphabetized lists. From this date, the digraphs _ch_ and _ll_ (graphic symbols composed of two letters) were conventionally considered letters of the alphabet, being that each of them represented a single sound. Nonetheless, in the 10th Congress of the Spanish Language Academies Association in 1994, it was agreed to adopt the universal latin alphabetic order, in which the _ch_ and _ll_ were not considered independent letters. Consequently, words which begin with these two letters, or that contain them, are alphabetized in the corresponding spaces under _c_ and _l_, respectively. This reform only affects the alphabetic ordering process of words, not the composition of the alphabet, of which the digraphs _ch_ and _ll_ still form a part.  \n3. While the digraphs _ch_ and _ll_ are the only glyphs that represent, respectively, the sounds /ch/ and /ll/, the sound that represents the digraph _rr_ is the same a that represented by the _r_ in the initial position of a word, or preceded by the consonants _n_, _l_, or _s_. This overlap explains why _rr_ has never been considered one of the letters of the alphabet. [_My addendum: not to mention that there is a minute difference between intervocalic r and the other r-based sounds especially compared to the large distinction that the second l or the addition of the h makes_]\n\nYou probably missed it because most of us when we don't think about it will instinctively look up a word like \"llave\" in the L section. If we don't find it and say to ourselves \"¿qué coño es este?\" it dawns on us that we need to check the LL section. Of course if it IS in the L section it doesn't cross our minds.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "Off topic - To Gulfa:\n\nYo creía qué eras español. (I thought you were from Spain).\n\n"
    },
    {
      "time": "",
      "content": "As did I. Must be a combination of your knowledgeable posts on Spanish, your (to me, as a completely ignorant sod) knowledgeable posts on Basque, and your avatar, which (again, to this particular ignorant sod) looks very Basque or northern Spanish.\n\n&nbsp;\n\n<cite>«(it is possible to have a double R that is not a digraph, such as in the word superresponsable, which technically should be superrresponsable) because it’s a flap followed by a separate and in theory distinct trill, but unlike the recent German reform, the Spanish realise that three letters like that in a row looks kind of silly).»</cite>\n\nDo words with initial [r] (represented by the letter r alone) not remain unchanged when used in compound codas if the compound onset ends in a consonant? If one were to join, for example, the prefix _sub-_ with _responsable_, the resulting word would still be only _subresponsable_, not _subrresponsable_, despite the combination ‑br‑ being usually [βɾ] rather than [βr]—wouldn’t it?\n\n"
    },
    {
      "time": "",
      "content": "Hello,\n\nI'm a Native Portuguese, and as we do learn the alphabet here is not 25 but 26 letters, with the w included although we, not that long ago did just care to learn 23 letters, as in ABCDEFGHIJLMNOPQRSTUVXZ, we didn't use the remaining 3.\n\nThis happened because we have a grammar that's based only on those 23 letters (plus the accents ´`^~, we dont use the ¨ like brazillian portuguese does; the \"nh\" – equivalent for the spoken \"ñ\" in spanish – and \"lh\" – sort of like the spanish \"ll\", but rather unique – digraphs).  \nBut with these foreign language words appropriations into our own language and neologisms, the portuguese grammar evolved, so we now include all the basic roman alphabet.\n\n"
    },
    {
      "time": "",
      "content": "Hmm. Yes, I was afraid this wouldn't be as easy as learning your A B C ;-)  \nNice explanations and discussions, folks - interesting reading.\n\nloremipsum: added your full list of letters. Impressive! :-)\n\ngulfa: added spanish\n\nturbulenz: added W to portuguese, thanks for the update!\n\n"
    },
    {
      "time": "",
      "content": "Roger, in Finnish alphabet the Å is there only because Swedish is our other official language, and for historical reasons there are a lot of Swedish names with å in them. In Finnish language å is not used at all.\n\n"
    },
    {
      "time": "",
      "content": "in Italian  \na-z abcdefghijlmnopqrstuvz àéèìòù î  \nThe last one, i.e. î, is used today only in (very) formal writing, in place of two i, for example at the end of words like \"principii\".\n\n"
    },
    {
      "time": "",
      "content": "I guess the logical extension of this thread is \"what does your keyboard look like?\" I'm always disconcerted when I go to an Internet cafe in a foreign country and have to make sense of the keyboard layout.\n\nHere's the American English (unfortunately the PC version, not Mac, was all I could find on wikipedia)\n\n ![](http://web.archive.org/web/20120126173114im_/http:/typophile.com/files/800px-KB_United_States_Dvorak_5206.svg.png)\n\n"
    },
    {
      "time": "",
      "content": "I mostly use a custom keyboard layout, which looks like this (the four states shown are Default, Shift, Alt, and Alt + Shift):\n\n ![](http://web.archive.org/web/20120126173114im_/http:/typophile.com/files/keyboardlayout_4011.jpg)\n\n&nbsp;\n\nThe standard Danish keyboard layout (in OS X) looks like this (laptop keyboard):\n\n ![](http://web.archive.org/web/20120126173114im_/http:/typophile.com/files/keyboardviewer2_5375.png)\n\n"
    },
    {
      "time": "",
      "content": "Italian \"ABC\" added. Thanks, MiseEnAbime! :-)\n\nMore?\n\n"
    },
    {
      "time": "",
      "content": "There. I throw in my keyboard :=)\n\n ![](http://web.archive.org/web/20120126173114im_/http:/typophile.com/files/pt_keyboard_5306.gif)\n\n"
    },
    {
      "time": "",
      "content": "n/m. n/t.\n\n"
    },
    {
      "time": "",
      "content": "tingiminn:\n\nThe first letter-string is icelandic, then - they learn the alphabet from A to Ö? Added.  \n(I'm currently reworking a retro/50s script, and let me assure you I have made the ð with no exit stroke, even though the d has one ;-)\n\nYour hungarian string has me mightily confused: I gather that the two-letter combinations are considered separate (like in slovak) - but what about the accented ones? You have E,É as separate entries, but the other acutes are together with their plain form - and the dieresis/double umlaut are considered separate from the plain/acute, but similar to each other?\n\n"
    },
    {
      "time": "",
      "content": "Here goes Turkish [alfabe](http://web.archive.org/web/20120126173114/http:/tr.wikipedia.org/wiki/T%C3%BCrk_Alfabesi)  \nABCÇDEFGĞHIİJKLMNOÖPRSŞTUÜVYZ  \n29 letters, A to Z.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, erhan - Turkish added :-)\n\n"
    },
    {
      "time": "",
      "content": "Actually, in Spanish it goes like this:\n\nABCDEFGHIJKLMNÑOPQRTUVWXYZ\n\nCh and Ll are no longer considered letter by themselves. Ch is 'filed' under C, and Ll under L.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the input, ArmandoCcs - I've updated the entry for Spanish, listing Ch and Ll as alternates (like for some of the other entries).\n\n"
    },
    {
      "time": "",
      "content": "A native on the hungarian alphabet :)\n\nHas 44 letters:\n\na, á, b, c, cs, d, dz, dzs, e, é, f, g, gy, h, i, í, j, k, l, ly, m, n, ny, o, ó, ö, ő, p, q, r, s, sz, t, ty, u, ú, ü, ű, v, w, x, y, z, zs\n\n4 special glyphs with double acute called (not surprisingly) \"hungarumlaut\":\n\nohungarumlaut (0151)  \nOhungarumlaut (0150)  \nuhungarumlaut (0171)  \nUhungarumlaut (0170)\n\nEight digraphs: Cs, Dz, Gy, Ly, Ny, Sz, Ty, Zs  \nand one trigraph: Dzs\n\nWikipedia article:  \n [http://en.wikipedia.org/wiki/Hungarian\\_alphabet](http://web.archive.org/web/20120126173114/http:/en.wikipedia.org/wiki/Hungarian_alphabet \"http://en.wikipedia.org/wiki/Hungarian\\_alphabet\")\n\n"
    },
    {
      "time": "",
      "content": "<cite>Do words with initial [r] (represented by the letter r alone) not remain unchanged when used in compound codas if the compound onset ends in a consonant? If one were to join, for example, the prefix sub- with responsable, the resulting word would still be only subresponsable, not subrresponsable, despite the combination ‑br‑ being usually [βɾ] rather than [βr]—wouldn’t it</cite>  \nLike you said, it does depend on what the final letter of the prefix is, and while it can change slightly depending on dialect, traditionally it is N, L, and S in front of an R. A word like \"cederrom\" has the double R (just being a pronounced out version of \"CDROM\"). Of course I'm rather lacking in examples at the moment otherwise (I need my morning coffee). It doesn't come up much but every once in a while.\n\n<cite>Yo creía qué eras español. (I thought you were from Spain).</cite>  \nPues de momento vivo en la periferia de Madrid, pero soy alabameño. I did my BA in New Media and Spanish, but my masters I'm working on is just in Spanish literature and I took a year off to come work in Spain _in theory_ to finish up my thesis while relaxing a bit outside of university life. There's been a bit more of relaxing than writing though...\n\n<cite>Ch and Ll are no longer considered letter by themselves. Ch is ’filed’ under C, and Ll under L.</cite>  \nThey are still considered letters, just not for collation (filing) purposes:\n\n“This reform only affects the alphabetic ordering process of words, not the composition of the alphabet, of which the digraphs ch and ll still form a part.” (orig: Esta reforma afecta únicamente al proceso de ordenación alfabética de las palabras, no a la composición del abecedario, del que los dígrafos ch y ll siguen formando parte.)\n\nThe Spanish alphabet is today formed by the twenty-nine following letters: a, b, c, ch, d, e, f, g, h, i, j, k, l, ll, m, n, ñ, o, p, q, r, s, t, u, v, w, x, y, z. (orig: El abecedario español está hoy formado por las veintinueve letras siguientes: a, b, c, ch, d, e, f, g, h, i, j, k, l, ll, m, n, ñ, o, p, q, r, s, t, u, v, w, x, y, z )\n\nBoth quotes are from the on-line copy of the first edition (2005) of the Diccionario panhispánico de dudas published by the Real Academia Española in collaboration with the other twenty-one national Academias de la Lengua Española in Latin American and elsewhere.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "Greek, 24 letters: (Α to Ω) =\\> ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ\n\n"
    },
    {
      "time": "",
      "content": "_There are estimated to be 1000 native Esperanto speakers. Be an interesting article or documentary film to find them. Native as opposed to taught. Gotta wonder about their parents._\n\nPattyfab, most of the parents have Esperanto as their common language (e.g., mom speaks French and Esperanto but dad speaks English, German and Esperanto). There is quite a community around Esperanto, and many people do marry people they meet at Esperanto conferences.\n\n(Mi parolas esperanton, sed ne denaske)\n\n"
    },
    {
      "time": "",
      "content": "pica pica: OK, all 44 letters for hungarian, then. :-)\n\ntingiminn: ???\n\ngulfa: thanks for the additional info.  \nMay we have a third vote for the spanish alphabet, please...? ;-)\n\ncdemetriadis: I wondered when the first non-latin alphabet would turn up. No problem, unicode makes it easy to add. Thanks! ;-)\n\n"
    },
    {
      "time": "",
      "content": "Croatian: 30 letters (A to Ž) =\\> A B C Č Ć D Dž Đ E F G H I J K L Lj M N Nj O P R S Š T U V Z Ž\n\n"
    },
    {
      "time": "",
      "content": "A more interesting (latin) alphabet: Hawaiian.\n\nA E I O U H K L M N P W ʻ\n\nYes, that's what looks like an apostrophe of sorts at the end and yes it's a letter, called _okina_.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "The below facilitates lossless transliteration of Devanāgarī (Hindi, Sanskrit, Pali, etc), following the order of the devanagari alphabet. I believe there are other diacritics used in classical Sanskrit.\n\na, ā, i, ī, u, ū, ṛ, ṝ, ḷ, ḹ, e, ai o, au, ṃ, ḥ  \nk, kh, g, gh, ṅ  \nc, ch, j, jh, ñ  \nṭ, ṭh, ḍ, ḍḥ, ṇ  \nt, th, d, dh, n  \np, ph, b, bh, m  \ny, r, l, v  \nś, ṣ, s  \nh\n\nOr, in addition to \"regular\" letters, āĀḍḌḥḤīĪḷḹḸḶṃṂṁṀṅṄñÑṇṆṛṚṝṜṣṢśŚṭṬūŪ\n\n"
    },
    {
      "time": "",
      "content": "Bulgarian/Cyrillic Alphabet  \nАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЬЮЯ  \nабвгдежзийклмнопрстуфхцчшщъьюя\n\n"
    },
    {
      "time": "",
      "content": "Hello! I am new here. The Philippine alphabet has all the letters in the Spanish alphabet + Ng. Ng comes after Ñ. :D\n\n"
    },
    {
      "time": "",
      "content": "In Typical's transliterated Devanagari alphabet, note that the distinction of capitalization doesn't actually exist in Devanagari, so the capitals are only used to follow certain romanized conventions.\n\nAnd, as I'm sure is probably true of some other alphabets, there are certain Devanagari letters which will never appear at the beginning of a word, and so the capital transliterated form is truly only theoretical. At least not in Sanskrit; there might be some Hindi or Pali conventions that I'm not aware of.\n\nAlso, Typical has, in his bottom summary, listed both m-underdot and m-overdot (sorry, I don't know how to enter the glyphs here) -- but I believe that those are both just alternatives for transliterating anusvara and are not two different members of the alphabet (and may be exclusive of one another, depending upon the transliteration scheme).\n\n"
    },
    {
      "time": "",
      "content": "Manlio Napoli: Croatian ABC added. Thanks! :-)\n\ngulfa: You sure got lots of language info ;-)  \nHawaiian added, but I would like to get it confirmed by someone FROM Hawaii - although perhaps the situation may be like for e.g. irish: they learn the english alphabet, so their local language is not teached alone as such?\n\nTypical & kentlew: Interesting, but a bit beside what I'm looking for - I want to know how children learn and list the alphabet they learn at school. Transliterations are for grownups ;-)\n\nworkandsupper: Welcome! :-)  \nEr... Do the Philippine alphabet use the spanish alphabet including the ch and ll - or excluding them? ;-)\n\n"
    }
  ]
}
