{
  "id": "4320",
  "title": "Commercial & Custom Pricing",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Although this is a topic that people who really know about will rarely address in public (hmmm, what topic isn't? :-) I'd like to ask for people's experiences, so we can build a \"knowledge base\" so the speak.\n\n**What are good pricing schemes for commercial licenses and custom work? By the former I mean like pricing for site licenses, etc. And by the latter I mean pricing for custom/exclusive fonts.**\n\nLet me break the ice with two things from my end:  \n1) One of my non-Latin commissions has involved pulling a then-recently-released and single-digit-sold Armenian font from the retail market and transferring exclusive rights (for 3 years) to a small literary publication: $1600. Two weights with mechanical obliques.  \n2) I recently sold an Armenian retail font set (four weights, no italics) to the local Church Diocese for use on any computer in their main headquarters (in Burbank). Normally costing $250, I charged them $400.\n\nhhp\n\n",
  "author": "hrant",
  "time": "16 Apr 2004 — 11:27am",
  "uid": "1250",
  "comments": [
    {
      "time": "16 Apr 2004 — 12:31pm",
      "content": "For custom work, I don't think it is possible to set a price independent of who the client is: Microsoft pays more for my services than the Society of Biblical Literature. Also, the price tends to vary according to the value added, which in turn should be reflected in the license rights. A license may be exclusive, but still might not permit some kinds of use or distribution; another license may not be exclusive, but may permit virtually any use and even redistribution. A client might say they want the font e.g. to bundle with a specific product, but if they request a license that permits more than that -- even if they only ever bundle with that one product -- then they pay for what the license permits, not what they actually intend or do.   \n   \n$1,600 seems very little for exclusive rights for three years for two weights. What were the license terms?\n\n"
    },
    {
      "time": "16 Apr 2004 — 12:58pm",
      "content": "\\> I don't think it is possible to set a price independent of who the client is   \n   \nSure. Just some real numbers would be great though. :-\\>   \n   \n\\> $1,600 seems very little   \n   \nNot for the Armenian market. In fact when the guy accepted my price I was shocked - partly because it was a really small operation out of the back of his house (so tying in to your point above). Plus no redistribution of the font was desired or needed: he installed it on his computer, and at the service bureau. He was strange. He even bought a (retail) font from me that he never used, seemingly only because I was waxing so poetic about it - in fact it started by me refusing to sell it to him (since it was a font that _required_ kerning to be on, otherwise the spacing would implode).   \n   \n--   \n   \nBTW, if people have pricing information about \"third-party\" commercial/custom work (like \"I've read that Carter got low five figures for Manutius\") that would be great too.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Apr 2004 — 3:18pm",
      "content": "This is/would be really useful information. Others please join the fray!   \n   \nRandy\n\n"
    },
    {
      "time": "18 Apr 2004 — 2:46pm",
      "content": "So what about some input about site license stuff? What are some significant and/or interesting ways in which font houses define and price uses beyond the basic level?   \n   \nhhp\n\n"
    },
    {
      "time": "19 Apr 2004 — 3:40pm",
      "content": "Hrant, for what it's worth, Larabie throws   \nout a ballpark price on his site.   \n   \n [http://www.typodermic.com/custom.html](http://web.archive.org/web/20150414102658/http:/www.typodermic.com/custom.html)\n\n"
    },
    {
      "time": "19 Apr 2004 — 6:58pm",
      "content": "Hobbiest pricing!\n\n"
    },
    {
      "time": "19 Apr 2004 — 7:51pm",
      "content": "So show us how that's true.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Apr 2004 — 9:36pm",
      "content": "_So show us how that's true._   \n   \nIt's true by virtue of the fact that one cannot earn a living wage charging $500 for a custom font and still produce high quality work of the kind that takes, at minimum, several weeks. It is necessarily 'hobbyist' pricing, because one could not do type design professionally, as the sole or primary means of earning a living, for such prices.\n\n"
    },
    {
      "time": "19 Apr 2004 — 9:46pm",
      "content": "You don't get it.   \nThis thread isn't about terminology, or economics.   \nIt's about friggin' sharing data. Let's see some.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Apr 2004 — 11:03pm",
      "content": "Sorry, but no.   \n   \nI share a huge amount of information that helps other people to make better quality fonts: lots of technical information and free resources that take me a lot of time to prepare. I do this because I cherish the explosion of creativity in type design that followed from the collapse of the old manufacturer system, and I want to do my part to make sure that this is not lost as font formats and technologies advance and become more complex. As I've said many times in the past, I don't believe that type designers should compete on the basis of technical quality. But I do think they should compete on the basis of design quality, and also on the basis of price. I'm not about to make it any easier for my competitors to compete with my prices.   \n   \nI will say this: a client who recently commissioned Tiro to produce some exclusive fonts -- who had invited a number of other companies to bid on the job -- told me that he thought we could afford to raise our prices. So when I say that some prices seem too low, it is not from the position of someone who is charging high prices within his market.\n\n"
    },
    {
      "time": "20 Apr 2004 — 5:33am",
      "content": "Hrant if you want to see data, why not do a simple P&L to determine the hourly rate you have to bill in order to make your business work. Using John's suggestion that a custom font takes several weeks minimun, that would amount to between 70 and 80 hours of billable time. A $500 fee would net you an hourly rate of $7.143 for 70 hours work or $6.25 if it took 80 hours.   \n   \nThese are not numbers that one can run a successful business with. They are therefore hobbyist.   \n   \nNow, instead of $500 subsitute $5000. Now your time is netting $71.43 or $62.50 per hour. Not entirely spectacular numbers but moving towards what it takes to keep a business afloat.\n\n"
    },
    {
      "time": "20 Apr 2004 — 8:00am",
      "content": "I understand your frustration Hrant, but also the frustration of the sons of thunder (James and John) with demands that they should lay bare their pricing structures for others to undercut.   \n   \nInstead of talking specific numbers, perhaps we can talk how factors in a custom job change the bottom line generally. I have not designed a custom font beyond the hobbyist level, so I'm keen to at least get a sense of the game. Here are some areas that have come up already:   \n   \n**1. Size of the client.**   \nIn John's first reply he notes that Microsoft would pay more than the Society of Biblical Literature. Is this because they have a larger purse or because they have more users or both? One way I would consider approaching the size of the client is the number of users. My thought would be to ramp up the cost with a similar scale as licensing a font (ie. with a reduction in cost per user as more users are added). Does this approach make sense? What are other things to consider?   \n   \n**2. Terms of agreement.**   \nExclusivity: the longer the agreement the more it will cost. I have no sense of how to approach this. I'd just be making up numbers out of the air. Any factors to consider that would lead to reasonable rate scale? What other terms would change the price?   \n   \n**3. Scope of delivered product.**   \nDo you think about this strictly in terms of hours, or a per weight basis? For example 2 weights vs 4 weights (two masters and two interpolated): Time analysis says 4 shouldn't cost twice as much. Weight analysis says it should. Thoughts?   \n   \n**What else should I ponder?**   \n   \nJohn and James, thanks for your candor thus far. I'd love to hear more if you're willing, but understand if you decline.   \n   \nCheers,   \nRandy   \n   \nOh, one other question:   \nThe approach I've taken in estimating freelance design projects is to provide a dollar estimate and an hour estimate. If I finish ahead of schedule I collect the total dollar estimate. If the project goes over hours (with unchanged scope), I continue billing at a slightly reduced rate. This gives me incentive to spec the job correctly, but protects me from getting taken to the cleaners. I think this would translate ok to type design also. Clients have reacted well to it, but I'm curious to hear if others do similar things, or how I could improve managing pricing.\n\n"
    },
    {
      "time": "20 Apr 2004 — 8:36am",
      "content": "I am not _demanding_ anything. But it's highly ungracious to both harp at people _and_ refuse to share the goods. If you want to stay quiet about the numbers, at least manage to stay quiet about your opinion of what _their_ numbers are. We're all in this together, in one way or another.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Nov 2012 — 2:16pm",
      "content": "...\n\n"
    },
    {
      "time": "20 Apr 2004 — 9:39am",
      "content": "-------------------------------------------   \nCross posted with James'   \n-------------------------------------------   \n   \n_It's about friggin' sharing data. Let's see some._   \n   \nThe facts are that you (and I) were hoping to see dollar values for custom fonts, but John and James aren't willing to go there. It may bug you that they will comment on other peoples pricing without sharing their own (though that does say something about theirs). You may think it ungracious, closed minded, silly, whatever... but that does not change the fact that they won't give you the information you want.   \n   \nIt seemed more productive to me to focus on what \\*goods\\* they do seem to be willing to discuss, rather than trying to convince them to reveal their pricing.   \n   \nFor the record: I appreciate your candor, and your willingness to reveal your pricing. Thank you for starting this thread!   \n   \nRandy\n\n"
    },
    {
      "time": "10 Nov 2012 — 2:16pm",
      "content": "...\n\n"
    },
    {
      "time": "20 Apr 2004 — 10:22am",
      "content": "Randy, in response to your points above:   \n   \n1. Yes, size of client affects the price both in terms of budget size and number of users. In the case of Microsoft and SBL, the fact that the latter is a scholarly organisation and would be making the font truly free to scholars, i.e. not bundling it as part of a commercial software package such as MS would, also affect the price. [In the case of the SBL font, I charged them a fair price for what they wanted, but I also donated all the smallcaps in the fonts, because they didn't have the budget for these and I thought the fonts needed them. But I made sure they knew that the smallcaps were being donated, and that what they were paying for was a subset of the total glyphs in the font.]   \n   \n2. Relating price to exclusivity is the most difficult thing, I find. You have to imagine how much more money you might make over time if you also had the right to license the font to other customers, but you can only guess that (unless you happen to have those other customers lined up). Obviously, if a client wants a real exclusive, i.e. to effectively own all rights outright (in which case you are doing work for hire), you can't expect them to compensate for every dollar you might possibly have earned in future. The process of imagining potential future profits is worthwhile, because it helps you come up with a price that is relative to the nature of the typeface. If someone wants to commission and exclusive text or display typeface for use in a glossy magazine, you have to consider that the future potential sales of licenses to such a type are considerable; if someone wants to commission an ISO CAD lettering and geometric tolerancing symbol font, the future market is probably fairly small, although the license price might be higher.   \n   \n3. I tend to do a lot of work up front when preparing a quote, particularly in terms of defining the glyph set. I usually do this in a spreadsheet, and keep track of which glyphs require individual design of outlines and which are composites. This enables me to base the bulk of my quote on a price per glyph for design, composite building, and hinting. Obviously things like OpenType Layout development, have to be estimated in terms of hourly rates, since they are not so easily quantifiable as designing and hinting, and the quote needs to be buffered so that clients can request additional glyphs at the last minute. I also add a full half day billable time for mastering each font, i.e. running through Font Validator, fixing table errors or inconsistencies, etc. I try to split testing duties with the client, but this is possible because most of my customers are software developers with their own testing departments.   \n   \nThe best thing about basing quotes on glyph counts is that it allows one to be fairly precise, both in relating work to typical amounts of time for different tasks, and in providing a justifiable price. This is reassuring to both clients and to oneself, and much better than picking numbers out of the air.   \n   \nSo this is my advice: try to break a project into specific tasks; estimate how long each task will take; figure out how much you want to be paid for that working time; multiply by the number of tasks; buffer. This will give you a basic price that will cover your work and keep you happy. Then add a percentage if the client if wants exclusive rights, either in perpetuity (high percentage) or for a limited time (lower percentage). I'm afraid I can't suggest what these percentages should be: by that stage you should have a feel for the client, and some sense of what their budget is likely to be.\n\n"
    },
    {
      "time": "20 Apr 2004 — 10:43am",
      "content": "\\> It seemed more productive to me to focus on what \\*goods\\* they do seem to be willing to discuss   \n   \nYou're right. I'm sorry for snapping.   \nAny insights (not just hard prices) are of course appreciated.   \n   \n--   \n   \nOne piece of third-party knowledge I can share about \"exclusivity\": some designers (for example Carter) generally give exclusivity for a short time, like 2-3 years. Although I guess this needs to vary depending on what the client needs, it seems to make sense in the case of magazines for example, since redesigns are about novelty, and there's no use tying up a design where it could serve the retail market later on.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Apr 2004 — 11:30am",
      "content": "This is like the tenth or eleventh discussion on this   \nthat I can remember here ...   \n   \nIn previous threads, I think $2000 to $4000 came up as a range.   \n   \n@ Hrant: I don't think John or James or anybody has   \nany obligation to talk about pricing. They have   \ncompetitors and those competitors will lurk   \nhere and use the information shared to nab   \nwork by underbidding. Keeping this information   \nconfidential is a key to their livelihood, is it not?   \n   \njust for the record, I pointed out the Larabie site   \nbecause it's one of the few with a price.   \n   \nOf course, $500 is a hobbyist price! And Ray is a clearly a hobbyist.   \n   \nIn previous threads, I think even $1500 was   \ncalled \"hobbyist\" pricing.   \n   \nI never did like the term _hobby_   \n   \nNevertheless, the term doesn't have to be used so   \npejoratively considering there are considerably   \nmore   \ntype designing hobbyists than those who   \nmake their living as Type Designers.   \n   \nAnd of course, most of the professionals were   \nhobbyists at some point.   \n   \nbj\n\n"
    },
    {
      "time": "20 Apr 2004 — 11:30am",
      "content": "James: Where does your lawyer teach the course?   \nI'm also here in New York and could use this kind of help (obviously). Thanks for the ballpark numbers.   \n   \nJohn: You mention your glyph-based strategy is divided into composites and others. By this I assume you mean\n\n"
    },
    {
      "time": "20 Apr 2004 — 11:35am",
      "content": "I see now that John already pointed out   \nwhy he doesn't share pricing info.   \n   \nbj\n\n"
    },
    {
      "time": "20 Apr 2004 — 11:43am",
      "content": "_You mention your glyph-based strategy is divided into composites and others. By this I assume you mean_\n\n"
    },
    {
      "time": "20 Apr 2004 — 11:45am",
      "content": "\\> I have no idea how long it takes to draw a glyph.   \n   \nYou know what's spooky? I once compared notes with Dan Carr (the punchcutter), and the numbers were virtually the same! About 8 hours per glyph. But that's for works of the heart\\*, not the stuff I generally whip up.   \n   \n\\* Hmmm, as much a factor in hobbyism as in _quality?_ Is Carr a hobbyist?   \n   \nhhp\n\n"
    },
    {
      "time": "20 Apr 2004 — 11:47am",
      "content": "Regarding revisions:   \n   \nI've taken to including a clause in contracts that specifies a 60 day test period following delivery of the fonts, and any bugs reported during this time are corrected free of charge. If bugs are reported after the 60 day test period, I reserve the right to charge hourly rates for fixing them, at my discretion. The main purpose of this clause is to encourage the customer to seriously test the fonts as quickly as possible, so they're not coming back to me six months later when I'm in the middle of another project.\n\n"
    },
    {
      "time": "20 Apr 2004 — 11:54am",
      "content": "BTW, this isn't just about custom pricing - I'd like to hear about notable site license schemes too - like P22's is great - what others?   \n   \nhhp\n\n"
    },
    {
      "time": "20 Apr 2004 — 12:05pm",
      "content": "Once I have the ideas in my head, it takes an average of 25 minutes per glyph. The shortest amount of time is probably five minutes: the longest is probably two hours, but that generally indicates that the idea in my head isn't quite right. Some letterforms are just plain difficult to get right: the Cyrillic _zhe_ is a bugger.   \n   \nOf course, it is nice to have the luxury to take longer -- to put things aside for a few weeks and come back to them refreshed -- but generally there are deadlines to be met.\n\n"
    },
    {
      "time": "20 Apr 2004 — 12:07pm",
      "content": "\\> 25 minutes per glyph.   \n   \nDoes that include spacing, hinting, etc.?   \n   \nhhp\n\n"
    },
    {
      "time": "20 Apr 2004 — 12:53pm",
      "content": "Here's how I would go about figuring out a rate for work for hire.   \n   \nFigure out how much annual salary you would like. Let's say $50,000 US. (Which is actually pretty darn low for the software industry; I'm assuming this is somebody early in their career.)   \n   \nAdd some amount for benefits and the like. If you aren't in a country with a real socialized medical system, say 50%. That's $75K.   \n   \nAlso, add in the costs of buying computer hardware and software, books, attending conferences, and any other major work expenses you'll have. I'll assume you're working from your home and your home office space expenses are minor. Let's say all this is $10,000/yr. So now we're at $85K.   \n   \nTake into account what percentage of your time you expect to actually spend doing paid work for your clients. After all, your billable hours probably don't include all that time pitching ideas, doing research and study on your own, accounting, going to conferences, or even a vacation. I'll say half the time is real billable work. So that means I have to double my numbers again. Now we're at $170K.   \n   \nSo, in this example one needs to charge a billing rate that would equal $170K annually, to live as if you were on a $50K salary.   \n   \nWith about 250 working days per year, that would be $170K/250, or $680 per day. If we assume an 8-hour day, that's $85/hr.   \n   \nSo that's how I would figure out an hourly rate for work for hire. I might have different numbers than the ones above, but that's the methodology I'd use.   \n   \nIf I'm doing custom work but I get to keep the rights afterwards, I'd base it off of the above rate. How much of a discount I'd give would depend on many factors previously discussed, such as how re-usable the work is, who the client is, and the extent of their expected use. Unless the work was stuff I would have done anyway on my own, is for a non-profit I'm in love with, or is clearly awesomely re-sellable, I'd never go below half my normal rates.   \n   \nFor fonts that one has already made, pricing is a very different issue. Here you need to look at it as a normal retail process and price based on those factors.   \n   \nSo, those are my thoughts on pricing methodology.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "20 Apr 2004 — 1:41pm",
      "content": "_Does that include spacing, hinting, etc.?_   \n   \nThat includes basic spacing, but not kerning. It typically includes PS stem hinting, but obviously not manual TT hinting.\n\n"
    },
    {
      "time": "23 Apr 2004 — 8:47am",
      "content": "Randy: Speaking of, will there be a Font Business workshop at Typecon?   \n   \nWith Jim Wasco of Agfa Monotype I'm doing a 1/2 day workshop aimed at helping type designers and software vendors work better together when it comes to licensing and custom font work - this will cover technical issues as well as business issues. I've not heard of other business related workshops at TypeCon, but the list hasn't been posted yet.   \n   \nCheers, Si\n\n"
    },
    {
      "time": "23 Apr 2004 — 10:28am",
      "content": "Thanks for the heads up!\n\n"
    },
    {
      "time": "24 Apr 2004 — 1:41pm",
      "content": "Thanks,   \n   \nThe workshop will be open to everyone. We hope to attract people from the software development community as well as type designers.   \n   \nCheers, Si\n\n"
    },
    {
      "time": "23 Apr 2004 — 8:52am",
      "content": "Simon -- Will this be open to non type designer's as well? I'd be very interested from perhaps a clients point of view.\n\n"
    },
    {
      "time": "31 Dec 2008 — 3:22pm",
      "content": "Pricing of work is not something unique to typography. Every industry has one or more accepted ways of doing things, but there are some common themes. In other words, this is a problem that has been solved time and time again. Look not just to other typographers but also other industries for lessons in how to handle this component of your business.\n\nI cringe at Randy's strategy of providing an estimate and charging for hours spent above and beyond that estimate (even at a reduced rate). In most industries that won't fly with serious clients. In fact, the exact opposite scenario is much more common: an hourly rate with a 'not to exceed' amount above and beyond which the client doesn't pay extra. No, it's not as friendly to the producer but most markets behave as buyers' markets when it comes down to it and hence clients walk away without that sort of price guarantee.\n\nEqually bothersome is the following:\n\n\"First, decide what you would truely like to get for the work. Regardless of what you think the cleint is prepared to pay. What do you want? Then Triple it.\n\nIf when presented to the client, they don't blink, well, you could have gotten more, but you are getting triple of what you wanted.\n\nIf they do blink, or gasp, or pass out, you still could cut it in half, come off as someone who knows how to compromise, and still be getting a third more than you wanted.\"\n\nI have had this experience before from the client side. I told them to hit the road, and they never got to bid our work again. It's not about 'enjoying negotiations'; I am as seasoned of a negotiator as they come, seasoned enough to know when you're wasting my time. While you're at it, don't try and act like you're doing me some big favor by patronizing my desire to negotiate. I fully expect to negotiate -- within 5 to 10 percent of the initial price. Any more, and I feel like you have too much margin in it. Any less, and I feel you don't have enough. Yes, I really do expect you to make money off me; just not too much. I also know your business well enough to know if this is the case. That's part of being a successful businessperson, to know your vendors' businesses in addition to your own. Even if I didn't, more likely than not I'm getting a bid from one or more of your competitors and I'll see right through any attempt to take advantage of me.\n\nBoth these strategies I list seem to result from a businessperson trying to mitigate risk. About that I'll say this: risk management is all fine and good, but don't take it too far. Focus more on refining the accuracy of your estimation process than ways to salvage a blown bid or win the lottery by having a clueless client take a high bid. Repeated application of a consistent pricing scheme that includes a margin with which you're comfortable will win out every time over trying to hit it big and dialing back when you fail.\n\n"
    },
    {
      "time": "13 Sep 2011 — 7:09am",
      "content": "[track] - very useful discussion thanks!\n\n"
    }
  ]
}
