{
  "id": "43216",
  "title": "Linkedin (yes no maybe?)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.linkedin.com\\>It seems like it might be a useful tool.](http://web.archive.org/web/20081008041247/http:/www.linkedin.com/)\n\nLinked in certainly looks more serious, but is it really useful for professional networking? Is it just another Facebook but with a resume attached?\n\nFacebook, I don’t think I quite get the point of. Yeah, OK it can be fun, and I can find out about events I’m interested in but I could find out about them as easily bay different means. It seems to mainly be a vehicle for delivering movie quizzes. Is it fair to compare the two?\n\n [‹ Why is the type design industry so secretive about sales volume?](http://web.archive.org/web/20081008041247/http:/www.typophile.com/node/35958 \"Go to previous forum topic\") [Does anyone have access to a Mac Plus/OS 6 ›](http://web.archive.org/web/20081008041247/http:/www.typophile.com/node/44282 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081008041247/http://www.typophile.com/user/13076\" title=\"View user profile.\">russellm</a>",
  "time": "<br>",
  "uid": "13076",
  "comments": [
    {
      "time": " 16.Mar.2008 12.07am",
      "content": "\\> It seems to mainly be a vehicle for delivering movie quizzes.\n\nOnly if you want it to be. Facebook is really quite flexible — and it’s simple too. I think it’s currently the best way for most people to create a web page about themselves and to find others.\n\nI can’t really say much for Linkedin. I’m on it, but I’ve only visited the site to accept connection requests. It is certainly more oriented towards job seeking and business relationships.\n\n"
    },
    {
      "time": " 16.Mar.2008 10.06am",
      "content": "I have not found LinkedIn particularly useful professionally. I’m on it but like Stephen only to accept connection requests.Other people have told me they have gotten job queries from it though. I don’t know what they’re doing that I’m not necessarily.\n\nFacebook - I dunno - it is a LOT of fun but I can’t see that any of it is professional. I play Scrabulous, superpoke my friends, get told that I look like a cat, figure out all the places in the world I’ve been, and match up words to protect the rainforest. Excellent way to waste time!\n\nLinkedIn ramped up first among my crew - both professional and personal connections. But Facebook is the Obama of the two - it surged out of nowhere and now it seems more people I know are on that. Probably just to play quizzes and conquer the world though.\n\nMy brother (who is in the tech world) tells me people he know use Facebook for their primary email nowadays because there is no spam. I wouldn’t do that because I can’t see any way to organize the InBox.\n\nPut another way - I’m on Facebook all the time. Linked In I look at maybe once a week.\n\n"
    },
    {
      "time": " 16.Mar.2008 11.07am",
      "content": "I don’t know many people who use LinkedIn for much of anything; I really just have an account so I don’t get repeated requests to join and connect. Facebook seems much more useful, especially in DC where the people with money—at least the ones who spend it—are yuppies who got hooked on Facebook in school or via friends who are in school.\n\n"
    },
    {
      "time": " 16.Mar.2008 12.45pm",
      "content": "I started getting LinkedIn messages a few years ago from good friends. It is just a list of people to keep up with. No work from it, but I didn’t expect that really. As soon as I joined all the people I used to work with in publishing got back in touch. I’m pretty neutral about it.\n\n"
    },
    {
      "time": " 14.Apr.2008 9.37pm",
      "content": "I use LinkedIn to ask nerdy questions of other professionals - there’s a lot of dreck in the Q&A section, but as a freelancer it allows me to retain some of the benefits of having colleagues! Things like: “OK, who’s used Yahoo’s UI toolkit and is it any good?” If I were a type designer, Typophile would be sufficient for that, but I’m a web designer who walks both the design and tech sides of the line. LI’s tech Q&A seems much stronger than the design one, btw - I think there’s way more developers than designers answering questions.\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 15.Apr.2008 6.16am",
      "content": "I treat it as my address book. Probably not using it to its full potential.\n\n"
    },
    {
      "time": " 15.Apr.2008 6.50am",
      "content": "LinkedIn is for business and your mostly co-worker connections to those you worked with. For best use, you should connect with people you have worked with first-hand. That’s one of the banes of it I think—-many times people ask to connect with me and I decline it. Sure, we know each other, but cant vouch for experience working together at all. It’s a great site overall, it proves invaluable for business networking for myself and many people I know. Because it a business network, you wouldnt add your mom to it.\n\nFaceBook is a social network of Friends to connect and interact with. It’s more robust in the way of interacting with your connections, with games and messaging etc. Unlike LinkedIn, becasue its a friend network, you WOULD add your mom to this.\n\n"
    },
    {
      "time": " 15.Apr.2008 9.28am",
      "content": "<cite>It’s a great site overall, it proves invaluable for business networking for myself and many people I know.</cite>\n\nHow has LinkedIn proved invaluable exactly? I mean for me it’s been fun to find a few old friends/colleagues on there, but I can’t say it’s led to anything I couldn’t have accomplished the old fashioned way, just by reaching out. I don’t see a lot of activity going on beyond racking up the connections. I suppose if you don’t have your own web site (as I do) it might be a handy place to post your resume but has it led to job opportunities for you?\n\nMy mom and I in fact have worked together - on 4 books! So I actually would add her to LinkedIn if only she was into that sort of thing.\n\n"
    },
    {
      "time": " 15.Apr.2008 12.53pm",
      "content": "Glad your mom is a good business contact, I was just using ’ol mom as an example.\n\nLinkedIn is a great place for people you dont know yet to contact you for work, freelance, fulltime, or otherwise, if youre interested in that kind of thing.\n\n"
    },
    {
      "time": " 15.Apr.2008 7.02pm",
      "content": "That is how it promotes itself, but do you know anybody (yourself included) who has actually gotten any work thru LinkedIn?\n\n"
    },
    {
      "time": " 16.Apr.2008 2.06am",
      "content": "I once got as far as a meeting. As far as I understood, the potential client/employer (I was after freelancing) just wanted to see a close up of a print ad I had in my web porfolio as he had thought of something similar for a design project of his own.\n\n"
    },
    {
      "time": " 16.Apr.2008 7.03am",
      "content": "I find the whole bit about who’s been viewing your profile to be a big tease.\n\nSomeone in the **Graphic Design** function in the **Publishing** Industry in the\n\nand then you find out there are 1500 people that meet that criteria.\n\n"
    },
    {
      "time": " 16.Apr.2008 10.21pm",
      "content": "I met one of my favorite client through LinkedIn. The only remotely useful part of it is the “Answers” section.... My client asked “do you know any graphic designers with mobile experience?” and I wrote him and said “I do”, and then after some emails and a phone interview, I got the job.\n\n—-  \neeblet.com\n\n"
    }
  ]
}
