{
  "id": "43228",
  "title": "Mashup,Google Maps,Panorama logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I need to design a logo for my web site. Its about google map and panoramas etc. I need to point out that I am not a designer i am a programmer, so any kind of critique wold be more than welcomed. The concept is an infowindow and camera. this is the basic forms in black and white.\n\n ![](http://web.archive.org/web/20080925080905im_/http:/typophile.com/files/black_4560.jpg)\n\nIn blue:\n\n ![](http://web.archive.org/web/20080925080905im_/http:/typophile.com/files/STRIPES_4498.jpg)\n\nUsing photoshop:\n\n ![](http://web.archive.org/web/20080925080905im_/http:/typophile.com/files/photoshoped_6653.jpg)\n\nSo what do you think or should I stick with programming only ;)\n\n [‹ Logo Critique](http://web.archive.org/web/20080925080905/http:/typophile.com/node/43145 \"Go to previous forum topic\") [ELL Logo - Thoughts ›](http://web.archive.org/web/20080925080905/http:/typophile.com/node/43293 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080925080905/http://typophile.com/user/28388\" title=\"View user profile.\">rzen</a>",
  "time": "<br>",
  "uid": "28388",
  "comments": [
    {
      "time": " 16.Mar.2008 11.35pm",
      "content": "It really depends how heavily you want to be critiqued.\n\nIf the site is a personal blog, etc it may be okay to design something yourself. I’d say the middle row in the blue is your strongest. If it’s at all business related, however... if there’s any money involved, I’d say hire a designer.\n\nI don’t mean to offend you, but I am curious why you’ve decided to try your hand at graphic design?\n\n"
    },
    {
      "time": " 17.Mar.2008 3.06pm",
      "content": "Thank you for your input Maverick. Well i would like to be critiqued because that’s the only way i could learn something new. I just wanted to know how a designer would see these concepts from their point of view.\n\nYes the website is business related its about marketing of firms in my country(Macedonia) using google maps, If i lived in a diferent country i would hired a designer but in my country there arent any good designers and the mentality is so diferent(if I hired a designer he would probably search the net and he would save the first image that he finds, with 360 on it and sell it to me as a logo). Further more my budget is small so i cant afford some freelance designer.  \nSo thats why i figured out since i know to work very well with Illustrator, Corel, and Photoshop i give it a try.\n\nI can make wonderfull cheese web 2.0 effects with photoshop but i wanted something different.  \nP.S  \nSorry if my english is poor it’s not my native language.\n\n"
    },
    {
      "time": " 17.Mar.2008 3.57pm",
      "content": "You may have too many concepts in one mark. An aperture says camera and is commonly converted into an icon. I would try and simplify the mark.\n\n"
    },
    {
      "time": " 17.Mar.2008 4.47pm",
      "content": "Thanks for the reply Jupiter Boy. I was more worried if it could be recognizable by my clients, (the camera and the info window - not to be mistaken by a speech bubble) so I had to incorporate to many elements. None of the elements were recognized by my potential customers:( (This is all so new to them, so i figured out its a nice business to start)  \nAnyway you do make a great point and ill give it a try and post the modifications.\n\n"
    },
    {
      "time": " 17.Mar.2008 11.19pm",
      "content": "“I just wanted to know how a designer would see these concepts from their point of view.”\n\nFrom a designers perspective, all these logos are very bad. The concepts need to be heavily refined and simplified, and the implantation needs to be absolutely overhauled. A designer giving you their honest opinion would suggest that you hire a professional.\n\nYou may not have a large budget, but the identity of your company is one of the most important investments you can make. When you have an online business your logo is the face of your company. People will make judgements because of your design that directly influence weather they choose you or your competitor.\n\nThere are plenty of inexperienced student designers who are very inexpensive. If there aren’t any in your country you can outsource the project to someone from another country. Another option is to hold a design contest where people compete for your prize money. [http://99designs.com](http://web.archive.org/web/20080925080905/http:/99designs.com/ \"http://99designs.com\") is a good site.\n\nI hope I didn’t offend you with my blunt honesty. Your english is very good by the way.\n\n"
    },
    {
      "time": " 18.Mar.2008 6.41am",
      "content": "“Another option is to hold a design contest”\n\nThat is awful advice after you first suggest hiring a professional. Professionals and those that would enter design contests are at opposite ends of the spectrum.\n\nAs for the logos, I think these are all decent ideas, and just need to be simplified/refined a bit.\n\nI think the first one has the most potential, but needs a lot of polish. Perhaps fewer lines. More geometric typeface.\n\n"
    },
    {
      "time": " 18.Mar.2008 12.52pm",
      "content": "Thank you all for your advices. Maverick non taken, those are good advices. I decided to hire a professional from a neighboring country. He liked the idea and he will work based on those. I hope he will come up with something decent. I will post the final logo when he finishes designing it.\n\n"
    }
  ]
}
