{
  "id": "43237",
  "title": "Critique for a church logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello\n\nI've been working on a logo for a church as a freelance gig for the last couple of months. I've gone through several revisions with them, and have narrowed the logo down to a finalist. I think the chosen logo fits the church; it's modern enough to appeal to the local suburban community, but doesn't completely do away with tradition either.\n\nI'm at the point where it's time for final tweaks. This is always easier said then done. I'm still reletively fresh out of school, so I'm still somewhat inexperienced in completely finalizing my concepts.\n\nAny help or advice would be very appreciated, especially for the symbol.\n\nThanks\n\nMichael\n\n| Attachment | Size |\n| --- | --- |\n| [Version-A-v2.jpg](http://web.archive.org/web/20131017172529/http:/typophile.com/files/Version-A-v2.jpg) | 44.18 KB |\n\n",
  "author": "myoung",
  "time": "16 Mar 2008 — 6:22pm",
  "uid": "2528",
  "comments": [
    {
      "time": "16 Mar 2008 — 7:11pm",
      "content": "I wish there was a bit more integration between the symbol and the name of the church, it doesn't feel like they need each other at all. I think you nailed the target, though.\n\n(I can't help but think of the \"Happy Hands Club\" in Napoleon Dynamite :)\n\n"
    },
    {
      "time": "16 Mar 2008 — 8:35pm",
      "content": "This is great. Any time you can design a logo for a church where the client doesn't demand a cross is a success. (I designed a logo for the church I work for, and everyone flipped when I even suggested not using a cross. Then I recently used it in an application and was told it wasn't \"Christian\" enough ... I really can't win with these folks, but I've already said too much about my own problems.)\n\nThe only issue I have is that I also see hands first, and then the dove. Is there any way you can make the hands a bit more subtle so that the dove is more dominant? (Maybe have the hands overlap so they're not so discrete.) The former definitely has a \"happy hands\" feel to it, and then one says, \"Oh, but it's also a dove.\" I imagine saying, \"Oh, a dove ... but it's also hands - neat!\" would be a better response. Overall, though, it's very nice.\n\n"
    },
    {
      "time": "16 Mar 2008 — 10:52pm",
      "content": "For what it's worth, I saw the dove first and then the hands.\n\n"
    },
    {
      "time": "17 Mar 2008 — 6:38am",
      "content": "Their last logo incorporated a dove, so most people I've talked to from the church see the dove first. Great to get more opinions though.\n\nHilarious, I didn't realize the similarity to the ‘happy hands club’. I've only seen Napoleon Dynamite once though.\n\n"
    }
  ]
}
