{
  "id": "43246",
  "title": "request for well-kerned text samples",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am presently in a kerning phase and I was wondering if you knew of any text samples in extensively (and well-) kerned serif/text fonts, in pdf form I’m assuming. (I’m not interested in buying or pirating the font, I just want to see it.) The letters t, i, o, s, and r, and their combinations with other letters in particular are causing brain fry.\n\nThanks!\n\n [‹ White box UI testing](http://web.archive.org/web/20081119053317/http:/www.typophile.com/node/43290 \"Go to previous forum topic\") [What's this font called? ›](http://web.archive.org/web/20081119053317/http:/www.typophile.com/node/43250 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081119053317/http://www.typophile.com/user/18406\" title=\"View user profile.\">Typical</a>",
  "time": "<br>",
  "uid": "18406",
  "comments": [
    {
      "time": " 17.Mar.2008 5.40am",
      "content": "If I were in your situation, I would just set the same long passage of text in a number of serif fonts, print these out, and look at how these fonts handle kerning.\n\nI like using the BBC website for “real” texts, since they have articles in a lot of languages.\n\nI don’t know what your font looks like, but some good fonts to compare come with Adobe products, like Minion, Garamond Premiere, Arno, etc.\n\nThen print out the same texts set in your font, and see what the color differences are.\n\n"
    },
    {
      "time": " 17.Mar.2008 6.53am",
      "content": "I have been using a strategy similar to what Dan recommends.\n\nWhen I have questions about letter combinations, I have additional windows open and check the same combinations in other fonts, and see how they were kerned in those fonts. Different fonts have different strategies for kerning, so you want those that are as similar as possible for comparison.\n\nOne thing is to match the x-height and style (old style serif, humanist sans, etc). Another issue is the approach to kerning. In Minion practically everything seems to be kerned—an effort to be as tight as possible without being cramped, I think—whereas Adobe Garamond is much more selective. If you look at a number of fonts, and narrow it down to two or three, and check those for the combinations in question, you will get a sense of what you want to do. In some cases your decisions may be a bit different than your models, based on your font’s style and your own feeling for the look you want.\n\n"
    },
    {
      "time": " 18.Mar.2008 4.23am",
      "content": "Thanks for the advice. Minion serves well.\n\n"
    }
  ]
}
