{
  "id": "43240",
  "title": "A CHEATER?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The proprietor of the site parachute.gr has in a different forum complained about TTF versions of his fonts being hacked and said to one member that he'd appreciate it if that member would buy his fonts instead of obtaining them in some unethical way.\n\nHowever, perhaps someone can visit this page:\n\n[http://www.parachute.gr/fonts.aspx?Sample=1&FontStyleID=&FontFamilyID=53...](http://web.archive.org/web/20150123054107/http:/www.parachute.gr/fonts.aspx?Sample=1&FontStyleID=&FontFamilyID=53&CharacterSetID=73 \"http://www.parachute.gr/fonts.aspx?Sample=1&FontStyleID=&FontFamilyID=53&CharacterSetID=73\")\n\nand tell me how the font \"Muse\" could not be so blatantly ripped off from Jos Buivenga's \"Delicious.\" Which can clearly be seen in the lower case f, g, c, and s, and certainly seen in the remainder of the lower case letters. For that matter, with the exception of a few minor tweaks and added \"serifs,\" the outlines are virtually identical.\n\nShameful.\n\n",
  "author": "Curioustype",
  "time": "16 Mar 2008 — 9:06pm",
  "uid": "15771",
  "comments": [
    {
      "time": "16 Mar 2008 — 9:43pm",
      "content": "_virtually identical._\n\nAre you alleging \"point piracy\", (i.e. file copying and modification), or just similarities of glyph shape?\n\n"
    },
    {
      "time": "16 Mar 2008 — 9:49pm",
      "content": "That I believe I'll leave to the person comparing. Let's just say there are what one would call \"similar\" glyph shapes, and then there are identical glyph shapes with one being scaled horizontally perhaps 101 percent, or merely had a small serif slapped on it. As mentioned, download the pdf for Muse, find and download Delicious, and just do a cursory comparison. If it's within your moral structure, strip the Muse pdf, and open both fonts in any font creation program. It would be downright comical if it wasn't so nauseating. Somehow this doesn't strike me as being similar to copying helvetica and re-naming it helstetica.\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:47am",
      "content": "[http://www.typophile.com/node/39777](http://web.archive.org/web/20150123054107/http:/www.typophile.com/node/39777 \"http://www.typophile.com/node/39777\")\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:56am",
      "content": "Certainly, there are many similarities.\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:56am",
      "content": "if you're going to make a serious accusation on a well-trafficked typography forum, you really should be a little bit more thorough, imo.\n\nso maybe you could do a side-by-side, or onion-skinned comparison?\n\ncan you post the creation dates of the two fonts?\n\ndid you make any attempt to contact Parachute, or either designer and see what they had to say?\n\nagreed, there are similarities, but if you are alleging point piracy, then show us what you have seen  \nand we can indeed make up our own minds.\n\n[Delicious](http://web.archive.org/web/20150123054107/http:/www.josbuivenga.demon.nl/delicious.html)  \n [Muse](http://web.archive.org/web/20150123054107/http:/www.parachute.gr/fonts.aspx?Sample=1&ShowFontFamilySample=1&FontFamilyID=53&FontStyleID=&CharacterSetID=73)\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:17am",
      "content": "Curioustype: _If it's within your moral structure, strip the Muse pdf, and open both fonts in any font creation program._\n\nWith moral structure intact and utterly unruffled by the journey near the Dark Side, here's a side-by-side comparison of the lowercase \"g\" from \"Muse\" and \"Delicious\" (no resizing involved, BTW).\n\nThe several instances of similarity are, to my eyes, disturbingly close.\n\n ![](http://web.archive.org/web/20150123054107im_/http:/typophile.com/files/Image1_3752.gif)\n\nRegards,  \nErnie\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:37am",
      "content": "Figures:\n\n ![](http://web.archive.org/web/20150123054107im_/http:/typophile.com/files/figurs_3516.png)\n\n"
    },
    {
      "time": "17 Mar 2008 — 4:51am",
      "content": "Sorry, but I just can’t let this one go unnoted, look at that \"v\" also.\n\nIn my opinion, they are way too close... something is not quite right here.\n\n ![](http://web.archive.org/web/20150123054107im_/http:/typophile.com/files/comparie_6213.png)\n\n"
    },
    {
      "time": "17 Mar 2008 — 5:01am",
      "content": "A follow up: Who did it first?\n\n"
    },
    {
      "time": "17 Mar 2008 — 7:47am",
      "content": "Mmm... This is the first time for me to see such a ripp-off thing. This is shameless contour hijacking. I started Delicious in 1994 and finished it in 1996. For what it's worth ... I can vouch for it that Delicious is completely my own thing.\n\n"
    },
    {
      "time": "17 Mar 2008 — 8:53am",
      "content": "[This is not the first time such allegations have been leveled at Parachute.](http://web.archive.org/web/20150123054107/http:/www.typophile.com/node/39777)\n\n"
    },
    {
      "time": "17 Mar 2008 — 9:14am",
      "content": "To add some [further proof](http://web.archive.org/web/20150123054107/http:/www.typophile.com/node/4055), dating from the 31st March of 2004.\n\n"
    },
    {
      "time": "17 Mar 2008 — 9:38am",
      "content": "These kind of things really makes me sick.\n\nPlease let us know how you will proceed with this, Jos.\n\n"
    },
    {
      "time": "17 Mar 2008 — 10:17am",
      "content": "Jos, your current license seems to prohibit this type of thing, but has your license always been this restrictive? Looks like it may have been posted without restrictions in the past?\n\n[http://web.archive.org/web/\\*hh\\_/www.josbuivenga.demon.nl/delicious.html](http://web.archive.org/web/20150123054107/http:/web.archive.org/web/*hh_/www.josbuivenga.demon.nl/delicious.html \"http://web.archive.org/web/\\*hh\\_/www.josbuivenga.demon.nl/delicious.html\")\n\nIn addition, there's no license text in the current download, not making any excuses but its easy for free fonts to end up in unintended places, and with no EULA it's a sitting duck.\n\n"
    },
    {
      "time": "17 Mar 2008 — 10:34am",
      "content": "I guess I have to take my loss on this one, Goran, and regard it as a wise lesson. As sii pointed out there's no license in the current download and it wasn't on the earliest Delicious page I clicked at the way back machine.\n\n"
    },
    {
      "time": "17 Mar 2008 — 10:51am",
      "content": "I wonder if an organization like the FDRC or ATypI couldn't reach out to starting-out freeware font designers more, by providing educational materials around font IP issues.\n\nOf course some designers will be happy to put their stuff straight into the public domain with no strings attached, but having standard EULAs (from open source, like to OFL, through to more traditional EULAs) might help prevent heartbreak further down the line.\n\nSomething for us to talk about at next month's [The Business of Type](http://web.archive.org/web/20150123054107/http:/www.microsoft.com/typography/links/news.aspx?NID=6121) event (plug :-)).\n\n"
    },
    {
      "time": "17 Mar 2008 — 11:02am",
      "content": "Jos: _there's no license in the current download and it wasn't on the earliest Delicious page I clicked at the way back machine_\n\nNevertheless, there is a clear notation that shouldn't be ignored or taken lightly: \"copyright\" — which, unfortunately, appears to have been in this instance shamelessly disregarded.\n\n"
    },
    {
      "time": "17 Mar 2008 — 11:11am",
      "content": "As far as my knoweledge goes: the EULA can protect a font as a piece of software and copyright is just a way of mentioning that the (type) design is yours. Because copyrighting a font or type design is not treated the same in every country, what should (or could) I do?\n\n"
    },
    {
      "time": "17 Mar 2008 — 11:12am",
      "content": "It's one thing that they \"borrowed\" the design and \"modified\" it, but it's another to try and profit from it. Honestly, artist to artist, a collaborative effort should have been forged, and Jos should see part of whatever profit they make.\n\nIf Jos goes on a reclamation crusade, he could hurt the Parachute guys were it counts... in the pockets. Following them around the net and offering the original, all for a price that's hard to argue with. Could make some serious waves, and hurt some one's credibility.\n\nBut it's possible the Parachute boys just had a moment of ethical and moral lapse, and bringing it to their attention might be enough to set things right. Jos, you're a giving, talented artist and imitation is the best form of flattery, but you shouldn't be taken advantage of.\n\n"
    },
    {
      "time": "17 Mar 2008 — 11:21am",
      "content": "amen to that last one\n\n"
    },
    {
      "time": "17 Mar 2008 — 11:26am",
      "content": "\\>It’s one thing that they “borrowed” the design and “modified” it, but it’s another to try and profit from it.\n\nIsn't that essentially how open source works? Many people out there believe that's how everything should work.\n\n\\>Nevertheless, there is a clear notation that shouldn’t be ignored or taken lightly: “copyright”\n\nTrue, the one font I looked at seemed to have a valid copyright string.\n\nIn the end I don't think it would hurt to contact the vendor.\n\n"
    },
    {
      "time": "17 Mar 2008 — 11:58am",
      "content": "A similarly close parallel investigation of other fonts offered by Parachute (a strikingly extensive catalogue) will probably answer many questions. There's no point contacting them, as they've been held accountable before and their position is known.\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:01pm",
      "content": "What is their position?\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:02pm",
      "content": "Is their position known? I'm afraid that I do not know it. I'd like to hear what they have to say.\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:03pm",
      "content": "I am not certain I understand how open source generates profit for anyone, but I claim ignorance because there could be an \"Open Source\" department store around the corner from me and I probably wouldn't know it.\n\nAs for the references to the other string regarding Parachute, I find this one much more provocative and specific. Furthermore, I believe there are a few posts from Parachute people in that string, which certainly now make for interesting reading. In fact I believe one comment was something to the effect of \"Stealing? Us? Are you kidding?\"\n\nAnd for those who've followed this thread and still have yet to view both fonts up close, let me just reiterate here that this is not someone reflecting an obvious influence in three or four characters ... we're talking about virtually every character being identical, point for point. There aren't enough zeros in the Milky Way to quantify the odds of something like that taking place by accident.\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:21pm",
      "content": "<cite>Following them around the net and offering the original, all for a price that’s hard to argue with. Could make some serious waves, and hurt some one’s credibility.</cite>\n\nHurting the credibility of Parachute has already been done and I'm satisfied with that. It would have been just if they had asked me to use Delicous as a base for their muse face.\n\nHowever it costs a lot of $$$ and Delicious is still free and [DeliciousX](http://web.archive.org/web/20150123054107/http:/exljbris.wordpress.com/2007/03/09/deliciousx/) will beat every competition (I hope :-) for a smaller price.\n\nMaybe I'll send them an e-mail, but actually I really want nothing to do with them. For the moment ... I just want to do my own type thing in the believe that I've got everything covered right now. I will however update my free downloads with a license.\n\n<cite>And for those who’ve followed this thread and still have yet to view both fonts up close, let me just reiterate here that this is not someone reflecting an obvious influence in three or four characters ... we’re talking about virtually every character being identical, point for point. There aren’t enough zeros in the Milky Way to quantify the odds of something like that taking place by accident.</cite>\n\nI second that, and I don't have to look at all the points' positions.\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:32pm",
      "content": "<cite>However it costs a lot of $$$ and Delicious is still free and DeliciousX will beat every competition (I hope :-) for a smaller price.</cite>\n\nLike I said, you can't argue with that. I'll be looking forward to DeliciousX!\n\n<cite>Isn’t that essentially how open source works? Many people out there believe that’s how everything should work.</cite>\n\nWell, usually the original creator gives their approval before someone starts whacking away.\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:49pm",
      "content": "\"Isn’t that essentially how open source works\"\n\nNot directly. Open Source Software typically requires that if one uses the open source software for their own software, then their software must also be open source.\n\nThere are many licenses out there, of course, but most of them follow that concept.\n\nNow, one can certainly still profit from the services that accompany the software (development, support, customizing, etc.)\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:13pm",
      "content": "\\> There’s no point contacting them, as they’ve been held accountable before and their position is known.\n\nthat's ridiculous.\n\nThe possibility exists that Parachute was duped by the 'creator' of the font, Vangelis Karageorgos. Logic suggests that the Parachute boys would not knowingly put up a font based on someone else's outlines, and logic also suggests that they'll take this font down as soon as they see evidence.\n\nthey might be guilty of not being aware of Delicious, but give them (the Parachute guys) a chance to defend themselves before calling them thieves, and setting out to hurt their business.\n\nKarageorgos knows what he did, but I'd bet that the Parachute guys did not know that PF Muse was tainted.\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:19pm",
      "content": "_Is their position known?_\n\nTheir position (explained on a previious Typophile thread) is that this is a dodgy business and everybody plagiarizes.  \nSo don't pick on the little guy if you're going to turn a blind eye and keep silent on, for instance, the Frutiger knock-offs, as long as they're done by a \"reputable\" company.  \nI would have to agree with them. Isn't this an industry that eulogizes the \"designers\" of \"revivals\"? Didn't we just celebrate 50 years of Max Miedinger's wonderfully derivative design?\n\nHaving said that, there are a lot of grey areas, and we have to draw the line in the sand somewhere, and \"plagiarism is acceptable but point piracy and trademark (name) infringement is not\" is what \\*we\\* as an industry have settled on, so all foundries should respect this, even though it's not perfect.\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:37pm",
      "content": "\\>what \\*we\\* as an industry have settled on, so all foundries should respect this,\n\nAgreed, but in a way it matters less what the industry decides on (or for that matter what's legal) it matters more what the customers (typically graphic designers) consider kosher vs a \"knock-off\".\n\n\\>and trademark (name) infringement is not\n\n[http://www.t26.com/fonts/Delicious](http://web.archive.org/web/20150123054107/http:/www.t26.com/fonts/Delicious \"http://www.t26.com/fonts/Delicious\")\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:38pm",
      "content": "Fair enough Brian. OK. Let's find out what they have to say. I've send an e-mail regarding this thing and I will let you know the outcome.\n\n@ Nick: Why shouldn't we try to stop the little guys before they become too big for us to make a difference?\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:42pm",
      "content": "That's unfair, and an abuse of power to protect the status quo. The end shouldn't justify the means.\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:56pm",
      "content": "Mr. Shinn I've agreed with you on more things than you'll ever know because I read quite a bit of what you write here and elsewhere. Unfortunately, this isn't one of those times.\n\nI believe the one major difference between what you've opined and the real tragedy here is in fact a two-parter: a.) Delicious was and is a free font and among the best at that; and b.) I sadly must admit I've got underwear older than Delicious. Delicious hasn't even reached its peak notoriety yet, much less be anywhere near eligible to be \"revived.\"\n\nAdditionally, the Parachute people are charging big bones, so to speak, for their version of someone else's font; not their version, interpretation, tribute, of the font, but a virtual exact copy. Certainly there are arguments for everything you wrote; however, perhaps another a$$-chapper here is that most legitimate \"revivals\" are interpretations, created in part as a quasi-honor, and most certainly not a point-for-point ripoff by someone who didn't really try all that hard to disguise his actions.\n\nWithout question, typography is a lot like music or the motion-picture industry. In this case, however, someone has taken the exact bars and notes from a Zeppelin song, changed \"day\" to \"afternoon\" in the lyrics here and there, named the song \"Foggy Hill Trot\" and are selling it for big bucks ... all while brazenly sitting among true professional musicians and saying \"really, we wrote that. It's nothing like ... what's that song you mentioned? Misty Mountain Hop? I've never even heard of that.\"\n\nAnd finally, at least from a personal perspective, the Parachute people are especially shameless when considering at least one of them seemed to be offended by the suspicion of any \"borrowing\" going on, and another trumpeted the foundry's value while cramming in between it all what amounted to, \"everyone else is doing it, so why can't we?\" Let's pray none of us in-denial plagiarists decide to jump off a bridge.\n\nThe bright side here is the Parachute version of this font seems aptly named with \"Muse.\" I'd say Delicious provided the perfect \"Muse.\"\n\nIn support of your point, however, certainly Southern Software and its ilk do this kind of thing on a massive scale. However, even in that case, SSI offered cheaper versions of more expensive fonts; here, someone's taken a very good free font, copied it, renamed it, and now is selling the Muse family for more than a downpayment on a JetSki.\n\nFrutiger vs. Myriad is a fight, even if a one-sided fight. This was unmitigated larceny by people who - despite having their faces on hi-def video surveillance and carrying a sign saying \"PARACHUTE\" - still come here and have the nerve to claim, \"that's not us.\" I'd swear one of them has to be Martin Short.\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:59pm",
      "content": "Nick, I'm not rioting typophile ... I'm just talking about the grey areas mentioned by you. This case is not really about revivaling a celebrated typeface.\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:11pm",
      "content": "\"Karageorgos knows what he did, but I’d bet that the Parachute guys did not know that PF Muse was tainted.\"\n\nJust a question - how could two self-proclaimed legitimate typographers go through the entire process of releasing the font, etc., and selling it for goodness knows how long without knowing about \"Delicious\" while at the same time a meaningless piss-ant like me recognized it the very first time I saw the font \"Muse?\" Delicious hasn't exactly been second behind where Jimmy Hoffa is buried as the planet's biggest mystery.\n\nAnd in furtherance of that, I can't remember Jos ever really plugging or pushing Delicious (if anything, he was justifiably protective of it), yet it still when you search Google for the string Delicious \"Jos\" free font, you get 67,000 results ... and that with the term \"Jos\" in quotes.\n\nShould someone lean more toward the basics of morality, however, one thought continues to come to mind: ignorance is no excuse.\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:08pm",
      "content": "Pay no attention to the man behind the curtain correcting a double post.\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:16pm",
      "content": "CrossPost ... WoW ... I'm flabbergasted with Christopher's replies. Guess I couldn't have said it better (only shorter :-)\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:14pm",
      "content": "_most legitimate “revivals” are interpretations, created in part as a quasi-honor, and most certainly not a point-for-point ripoff by someone who didn’t really try all that hard to disguise his actions._\n\nWhat's the difference--fessing up? That is indeed the distinction that separates plagiarism from homage.\n\nIMO, the \"expiry date\" is the key ethical concept with regards to copyright and plagiarism.  \nContent creators deserve a limited-time monopoly to benefit from their work (during their lives), but after that it enters the public domain.\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:13pm",
      "content": "<cite> &gt;It’s one thing that they “borrowed” the design and “modified” it, but it’s another to try and profit from it.</cite>\n\n<cite>Isn’t that essentially how open source works? Many people out there believe that’s how everything should work.</cite>\n\nThat stinks, implying that those of us who find good cause for some open source fonts also think copying someone else work without credit, and reselling it, is OK.\n\nBelow a portion of SIL's Open Font License, also followed, I believe by the Greek Font Society.\n\n<cite>The OFL allows the licensed fonts to be used, studied, modified and redistributed freely as long as they are not sold by themselves. The fonts, including any derivative works, can be bundled, embedded, redistributed and/or sold with any software provided that any reserved names are not used by derivative works. The fonts and derivatives, however, cannot be released under any other type of license. The requirement for fonts to remain under this license does not apply to any document created using the fonts or their derivatives</cite>\n\nPretty clear about prohibiting reselling or relicensing the font, modified or not.\n\nIf font developers in the commercial sector wish to so restrict their fonts that they are of little to no use for some applications that is their business; the marketplace will sort it out. But to insinuate that those of us who support OFL also support what amounts to piracy, strictly legal or not, does a disservice.\n\nWithout fonts like Charis, Gentium, and the offerings from GFS, a number of authors would not be able to prepare manuscripts so that typesetters could use the author's files economically; without permitting limited font modifications as allowed by Adobe's EULA, some scholarly books could not be published.\n\nBelieving in that is a far cry from supporting the shenanigans apparently going on as reported here.\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:14pm",
      "content": "\\>how could two self-proclaimed legitimate typographers\n\n\"Never attribute to maliciousness that which can adequately be explained by stupidity!\" Mark Twain\n\nOh and Typophile edit rides again! Yehaw!\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:17pm",
      "content": "\\>Believing in that is a far cry from supporting the shenanigans apparently going on as reported here.\n\nDo a search on the type designers name + \"font\" and see what links comes up. ;-)\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:27pm",
      "content": "_This case is not really about revivaling a celebrated typeface._\n\nRight Jos, I was just talking about the general skew in type culture. Of course, everybody mines history these days, but no-one does it better than type people!\n\nBut I'm repeating myself, I actually think there is a hell of a lot more original work being done now than five years ago -- just look at Typographica's [_Types of 2007._](http://web.archive.org/web/20150123054107/http:/typographica.org/)\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:34pm",
      "content": "\\>IMO, the “expiry date” is the key ethical concept with regards to copyright and plagiarism.\n\nAlso I think the expiry date varies according to the TM status of the name. Fonts that should perhaps have reached that date remain untouchable as their marks are actively policed.\n\n"
    },
    {
      "time": "17 Mar 2008 — 2:38pm",
      "content": "\"What’s the difference—fessing up? That is indeed the distinction that separated plagiarism from homage.\"\n\nNot only fessing up, but I'd like to believe in some cases that yes, homage. Perhaps my idealism is misguided ... I prefer to identify what you call \"fessing up\" as - at the absolute least - \"acknowledgement.\" And again, perhaps my ignorance is once again dancing on my forehead, but these \"revivals\" often are of typefaces not originally drawn on a computer and thus, unable to be duplicated hammer-stroke by hammer-stroke OR point by point.\n\nVisually they may be identical, but it still required some typographer to replace pounding iron with drawing his or her own points. Between that and yes, the confession/acknowledgement, I simply cannot see how the two directions could be compared. Believe me, I fully agree - originality is rare in typography, music, any form of art. But this wasn't a cover song, a conversion from metal or plate to digital, or even a parody like Mad Magazine. This was Brett Buster and Violet O'Mara starring in the four-hour southern epic Swept by the Storm and getting offended by comparisons to Gone With the Wind. They're playing a shell game here, except they're trying to use three balls and one shell.\n\nIf anything, just the flagrant nature of would seem to offend everyone, not just Jos, because it seems you're defending what in essence is Parachute's belief that we're all idiots. That's probably the difference between us - though not my font, I take this kinda personally; it seems you take a more pragmatic, liberal approach. Which is why I'll be dead at 50 and you'll probably live to something divisible by 50. Still, I can't shake the things said in the other thread by these people.\n\n\"Content creators deserve a limited-time monopoly to benefit from their work (during their lives)\"\n\nAgreed. I think Jos just posted something, however, so unless he died of carpal tunnel in the last half-hour, his limited time is still ticking.\n\nNow please, Mr. Shinn, would you just die already? Not actually die die, just for like an hour or so. OH my - never mind ... I lost my head there for a second pondering the idea of your work being part of public domain. My apologies sir.\n\n"
    },
    {
      "time": "17 Mar 2008 — 3:32pm",
      "content": "<cite>Right Jos, I was just talking about the general skew in type culture. Of course, everybody mines history these days, but no-one does it better than type people!</cite>\n\nI've never encountered it this way, but it seems like you want to thrive this discussion to some general thing that I —in this current thing that's going on— find hard to comprehend.\n\n"
    },
    {
      "time": "17 Mar 2008 — 3:35pm",
      "content": "_because it seems you’re defending what in essence is Parachute’s belief that we’re all idiots._\n\nChris (please call me Nick), it was more along the lines of \"as ye sow, so shall ye reap\".  \nParachute may have crossed the dividing line into point piracy, but I suspect they don't think that's any worse than a legitimately-drawn Frutiger clone which didn't even bother tacking on a few serifs.\n\n"
    },
    {
      "time": "17 Mar 2008 — 3:41pm",
      "content": "_it seems like you want to thrive this discussion to some general thing_\n\nIsn't that how Parachute considers it? They have said on Typophile (Ralf's link, above), \"We do not claim some high degree of originality here, but \\*only to the same level as other companies do\\*.\"\n\n"
    },
    {
      "time": "17 Mar 2008 — 3:54pm",
      "content": "just because _everyone else is doing it_ doesn't make it right. i learned that one in sunday school...\n\n"
    },
    {
      "time": "17 Mar 2008 — 3:58pm",
      "content": "\\*edit\\* @ Nick:\n\nWhat's your point? Let's get real. It's the \"How the differ\" thing in the same paragraph that bothers me.\n\n"
    }
  ]
}
