{
  "id": "43254",
  "title": "Wordmark for an ultimate frisbee league",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm on the exec of a small ultimate frisbee league in Barrie, Ontario. We're looking for a new wordmark and/or logo. I reckon the wordmark is easier, so have been playing around with a few concepts myself. (I'm definitely not a graphic artist or typographer—just a mechanical engineer who volunteered.)\n\nThis wordmark will go on our website, on jerseys, discs, and potentially other promotional stuff. I'd like it to be clear and legible at a distance for both small sizes (e.g., decals) and larger (jerseys).\n\nI'm also hoping to reflect the sport: it's co-ed and friendly; modern; fast, \"flow-y\", and fun.\n\nThis is my [first try](http://web.archive.org/web/20131020021735/http:/barrieultimate.com/images/barrieultimate.com_familian.gif):\n\n ![](http://web.archive.org/web/20131020021735im_/http:/typophile.com/files/barrieultimate_5838.com_familian.gif)\n\nThe font is Familian. I like the flow and roundedness of the font, and the aspect ratio of the block. However, I think this looked better in my mind's eye than when actually in front of me.\n\nI'm favouring my [second concept](http://web.archive.org/web/20131020021735/http:/www.barrieultimate.com/images/barrieultimate.com_century_gothic.gif):\n\n ![](http://web.archive.org/web/20131020021735im_/http:/typophile.com/files/barrieultimate_6439.com_century_gothic.gif)\n\nThe font is Century Gothic. I like that it's clean, and the very rounded characters remind me of the round shape of a disc. Not separating the words is an effect that to me suggests modernity.\n\nFor either, it should work in with either black/white or in colours. I just added the different colours in the second so that the .com was de-emphasized.\n\nAny feedback on these concepts would be very much appreciated. Also, any suggestions for a different font (preferably free or not too expensive) would also be great.\n\n",
  "author": "ian.brown",
  "time": "17 Mar 2008 — 7:34am",
  "uid": "28399",
  "comments": [
    {
      "time": "17 Mar 2008 — 12:11pm",
      "content": "Sorry, but this is the kindest way I can say it; hire a designer. At the VERY least, hire a design student.\n\n"
    },
    {
      "time": "17 Mar 2008 — 1:40pm",
      "content": "Georgian has a good design program from what I hear. Find a student there to do it.\n\n"
    }
  ]
}
