{
  "id": "43259",
  "title": "CID (Identity-H) encoded fonts in PDF",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have never understood exactly what these are. I do know that I have had problems with them before, I had a printer call me and complain about \"composite\" text, I ended up having to outline the fonts. Thomas Phinney once threatened to write a piece in his blog about them, but I remember checking and it never showed up.  \nID CS2 stopped generating them, by and large, and now with CS3 it seems that all the fonts are encoded this way.  \nCan anyone explain what a CID encoded font is? Is this something that is still going to cause me problems?\n\nthanks\n\npbc\n\n",
  "author": "Paul Cutler",
  "time": "17 Mar 2008 — 10:58am",
  "uid": "7347",
  "comments": [
    {
      "time": "17 Mar 2008 — 11:07am",
      "content": "Hi Paul,\n\nI guess you might already be aware of this older thread, and it might not fully answer your question. Still, here’s a link: [Why is InDesign CS converting fonts into CID?](http://web.archive.org/web/20140922101550/http:/www.typophile.com/node/13023).  \nCurious about further information, too.  \nF\n\n"
    },
    {
      "time": "17 Mar 2008 — 11:23am",
      "content": "I do remember that thread and thought that CS2 had put this issue to rest. But now it's back in full force with CS3. Weird. Bert in that other thread says this has been remedied by CS2 (which I found to be largely true). But now it has been \"un-remedied\".  \nI have just been experiencing some funny behavior on my computer and it feels like fonts are at fault so I have been looking into it.\n\npbc\n\n"
    },
    {
      "time": "17 Mar 2008 — 12:05pm",
      "content": "This from Dov Isaacs over on the Adobe ID board:  \n<cite> Unfortunately, some third party (i.e., non-Adobe) PostScript and PDF software either doesn't implement CID-encoding or improperly does so. However, using Distiller to create PDF contrary to popular belief does not preclude CID-encoded fonts from appearing in the resultant PDF files. </cite>\n\n<cite>Note that all PDF/X standards and Ghent PDF Workgroup best-practice PDF guidelines and standards support CID font encoding and PDF exported directly from InDesign. </cite>\n\nUnfortunately I can't possibly have a relationship with all the printers I use so this may become a problem. We shall see…\n\npbc\n\n"
    }
  ]
}
