{
  "id": "43269",
  "title": "Learning Calligraphy",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I want some books on learning calligraphy. One friend recommended [this one](http://web.archive.org/web/20080322021113/http:/www.amazon.com/exec/obidos/tg/detail/-/1579908098/ref=ord_cart_shr?%5Fencoding=UTF8&m=ATVPDKIKX0DER&v=glance), and Amazon suggests [these](http://web.archive.org/web/20080322021113/http:/www.amazon.com/s/ref=sr_st?keywords=calligraphy&rs=1000&page=1&rh=n%3A1000%2Ck%3Acalligraphy&sort=relevancerank), but I’d like to get suggestions from other people here. What books do you recommend? Is there a calligrapher’s bible equivalent to _The Elements of Typographic Style_?\n\n [‹ Interstate -vs- FHWA](http://web.archive.org/web/20080322021113/http:/typophile.com/node/14244 \"Go to previous forum topic\") [How do you type unicode symbols? ›](http://web.archive.org/web/20080322021113/http:/typophile.com/node/43278 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080322021113/http://typophile.com/user/19606\" title=\"View user profile.\">Thomas Levine</a>",
  "time": "<br>",
  "uid": "19606",
  "comments": [
    {
      "time": " 17.Mar.2008 3.04pm",
      "content": "I would try combining Noordzij’s _The Stroke_ with _The Speedball Textbook_.\n\n"
    },
    {
      "time": " 17.Mar.2008 8.22pm",
      "content": "It’s not a lettering book as much as a handwriting book, but I learned italic writing from [Back to the second basic R, Ritin](http://web.archive.org/web/20080322021113/http:/www.atlasbooks.com/marktplc/calligraphy.htm)\n\nIt was much better for me than any other book I came across.\n\n"
    },
    {
      "time": " 18.Mar.2008 12.05am",
      "content": "Workshops:\n\nJulian Waters\n\n[http://www.waterslettering.com/](http://web.archive.org/web/20080322021113/http:/www.waterslettering.com/ \"http://www.waterslettering.com/\")\n\n"
    },
    {
      "time": " 18.Mar.2008 6.59am",
      "content": "Hello Thomas, the equivalent to _The Elements of Typographic Style_ is probably [Mediavilla’s](http://web.archive.org/web/20080322021113/http:/images-eu.amazon.com/images/P/2743301597.08.LZZZZZZZ.jpg).\n\n"
    },
    {
      "time": " 18.Mar.2008 6.37pm",
      "content": "I’ve ordered all of those except Mediavilla’s. The only place I can find that one is [here](http://web.archive.org/web/20080322021113/http:/livre.fnac.com/a984983/Claude-Mediavilla-Calligraphie), where it costs 51€ including shipping. Do you know where else I can find it? Considering how expensive it is, I’ll probably not get this one unless I find it much cheaper elsewhere or you say it really is that good.\n\n"
    },
    {
      "time": " 18.Mar.2008 10.48pm",
      "content": "I’ll second the suggestion of the Speedball book. It’s reprinted every few years so there are thousands floating around including new ones in bookstores. It’s not the only, or the best for models, but it does focus on this basic information.\n\nThe thing you seem to want is models for alphabets, as well as correct stroke formation and order. Learn those basic things for several styles of alphabet and then, after gaining correct form and spacing, develop consistency and then speed. There are dozens of books out there, but very few offer a complete set of historical models of each style (Imperial caps, chancery, fraktur, schwabacher, rotunda, uncial, half-uncial, Carolingian lowercase, etc.). Those models will give you the foundation on which to build.\n\nI’d also look for direct sources rather than interpretations by the various authors of manuals. There ought to be clear images of historical manuscripts showing the original calligraphy, not just the instructor’s version of them.\n\nExcellent 20th-century calligraphers to observe: Hermann Zapf, F. Ernst Schneidler, Werner Schneider, Albert Kapr, Georg Trump, Rudolf Koch, Oldrich Menhart, Karlgeorg Hoefer, Helmut Salden, Imre Reiner, Martin Wilke, Alfred Linz, Friedrich Poppl, Gunnlaugur Briem, Julian Waters, Villu Toots, John Stevens, Michael Clark, Jovica Veljovic. There are many more, but I think it’s good to get a sense of the different styles. Some calligraphers have very conservative, classical style, some are more rough and visceral. Contrast Waters with Koch, and Hoefer with Toots.\n\nKeep in mind that all these calligraphers develop their styles from the foundational alphabets. It’s learning the rules completely that allows them to break them; they are able to make strong, individual works because they have mastered traditional calligraphic styles. I think the German calligraphers in particular exhibit the complete discipline that allows them to explore variations. There have been so many amazing German calligraphers, and so few of their caliber elsewhere.\n\n"
    }
  ]
}
