{
  "id": "43296",
  "title": "Typeface for a Book!",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi fellows! :D How are you?  \nI was invited to design a book for my old school!  \nThe book’s theme is the school’s 50th aniversary (1957-2007)!  \nI was thinking about Helvetica for obvious reasons...  \nBut the book has almost 200 pages... Helvetica is a sans-serif!  \nAny sugestions? I really appreciate any response!\n\nThanks in advanced!  \nJ\n\n [‹ Good tilde design](http://web.archive.org/web/20080322021123/http:/typophile.com/node/43305 \"Go to previous forum topic\") [Novell.com Redesign ›](http://web.archive.org/web/20080322021123/http:/typophile.com/node/43099 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080322021123/http://typophile.com/user/24562\" title=\"View user profile.\">J VILAS BOAS</a>",
  "time": "<br>",
  "uid": "24562",
  "comments": [
    {
      "time": " 18.Mar.2008 4.08am",
      "content": "Use serif. Cheers.\n\n"
    },
    {
      "time": " 18.Mar.2008 4.14am",
      "content": "I forgot to ask you: InDesign is the best program to design the book?\n\nJ itsa JOTAOITENTA&CINCO\n\n"
    },
    {
      "time": " 18.Mar.2008 4.19am",
      "content": "Serif? Which one?  \nAnd what do you think about combine a serif and a sans-serif?\n\nJ itsa JOTAOITENTA&CINCO\n\n"
    },
    {
      "time": " 18.Mar.2008 4.59am",
      "content": "[http://www.typophile.com/node/39592](http://web.archive.org/web/20080322021123/http:/www.typophile.com/node/39592 \"http://www.typophile.com/node/39592\")\n\n"
    },
    {
      "time": " 18.Mar.2008 5.52am",
      "content": "<cite>I was thinking about Helvetica for obvious reasons...</cite>\n\nIt is obvious if your school was composed only of type addicts. It might be appropriate if a very popular magazine or newspaper of the time — popular in Portugal — used Helvetica.\n\nIf what you are after is an allusion to the times, it is hard for someone in the States to know what might be appropriate in Portugal. But certainly we can say that font selection should be made on the basis of what your general audience will appreciate & understand.\n\nWhere you as designer fit in is to avoid the pitfalls an amateur would be apt to make. For example, if it were the States, a Bodoni might be selected (<cite>Life</cite> magazine, which many people read). But Bodoni’s are tricky, they fared poorly when rendered in photocomp, and many fared worse in PostScript. So, if the book is comprised mostly of photographs, and will be printed on a coated stock, you can probably find a Bodoni that will work. But if it is mainly text & will be printed on an uncoated stock, I’d skip the problems of Bodoni & get your allusion to the times by using something like Franklin Gothic Condensed for display. Again, this for the States; a far as I know, it would be inappropriate for Portugal.\n\n"
    },
    {
      "time": " 18.Mar.2008 6.21am",
      "content": "I think I’ve personally noticed nearly everything in the united states is Garamond. Although it’s kind of a default, it is a safe bet for a classic book. As for Helvetica, Most of us have read (I think) “A History of Graphic Design” by Philip B. Meggs, which is done in Helvetica, is around 500 pages, and perfectly legible. Aside from the cover, I’d call it a successful design. Just watch the leading. More importantly than Garamond, Bodoni, or Helvetica though, you’d want it to match any theme or mood in the book.\n\nAs for InDesign or Quark, I know a lot of seasoned vets who prefer Quark for books (largely because of the custom kerning abilities), but my comfort zone is InDesign, and i’ve not had a problem laying out a book with it.\n\n"
    },
    {
      "time": " 18.Mar.2008 6.46am",
      "content": "Both InDesign and Quark will work very well for book design. I’d say use whichever program you are more comfortable with.\n\n"
    },
    {
      "time": " 18.Mar.2008 6.52am",
      "content": "You can use Helvetica for a text font, sure. We set the journal <cite>boundary 2</cite> which uses Helvetica. Aside from watching the leading, you need to watch the character fit & word spacing. Space values are that way, they all relate. The usual problem with a sans for text is somebody gets the word spacing too tight. The second most common problem is selecting a font where the character spacing is too tight.\n\nHaving said that, unless your school was comprised of a bunch of modernists or font addicts who don’t mind being reminded for 200 pages that it’s the 50th anniversary of Helvetica, why select it.\n\nAs for the best layout program, it is the one you already know how to use. Forgive me, but you don’t sound too familiar with book work. Why add to the chore by using a program you’re not comfortable with?\n\n"
    },
    {
      "time": " 18.Mar.2008 11.01am",
      "content": "Thanks for the posts! :D  \nI’ll try different options!\n\nJ itsa JOTAOITENTA&CINCO\n\n"
    }
  ]
}
