{
  "id": "43309",
  "title": "\"Fonts and Encodings\" - Update",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "A few months ago, I raved here about a book I discovered called \"Fonts and Encodings\" by Yannis Haralambous.\n\n[http://typophile.com/node/40164](http://web.archive.org/web/20150420093252/http:/typophile.com/node/40164 \"http://typophile.com/node/40164\")\n\nAs you may recall from that thread, I was dismayed to find that the book had some serious typographic errors in the code listings. Other people also pointed out errors they had found. Not only that, but the book was not yet available in electronic form on O'Reilly's website.\n\nFirst the good news: The book is now available to view online (for free if you own the dead tree edition) through O'Reilly's Safari Books Online service:\n\n[http://safari.oreilly.com/9780596102425](http://web.archive.org/web/20150420093252/http:/safari.oreilly.com/9780596102425 \"http://safari.oreilly.com/9780596102425\")\n\nMore good news: The errata file for the book has been updated (previously it contained only a few minor errors).\n\nThe bad news: The code listing errors are still in the book, and are listed so far only as \"possible errors\" in the errata file.\n\nIn spite of the still-to-be-corrected errors, I think this is on balance a very good thing. Considering the shear amount of material in the book (over 1000 pages), having it available in electronic form (i.e., searchable, being able to copy snippets of code, etc.) makes it more useful by a magnitude.\n\nGiven that the errors are now listed (however tentatively) in the errata file means that they will likely be corrected eventually, so there is hope on that front as well.\n\n",
  "author": "Mark Simonson",
  "time": "18 Mar 2008 — 8:45am",
  "uid": "1043",
  "comments": [
    {
      "time": "22 Mar 2008 — 6:14pm",
      "content": "Excellent news. I was one of the people who griped about the size of some of the errors, but I'll be the first to say that if the bugs are ironed out, this could be \\*the\\* resource book for technical font info.\n\n"
    }
  ]
}
