{
  "id": "43324",
  "title": "Combining TT fonts into OTF",
  "forum": "Build",
  "tags": [

  ],
  "content": "Greetings, fellow typophiles. I have a question that verges on the edge of legality, but I believe remains within the realm of moral responsibility. If you believe that this is not so, let me know, and I'll gladly withdraw the request. My situation is this: I've bought a suite of Mrs Eaves a while ago, with ligatures and small caps as separate TT files, and would now like to combine them into one OT font. I know of the existence of the official OTF version offered by the foundry, but can't justify spending so much for something I already own. I've just started learning FontLab, and wonder if the process would have to be too labor intensive, of if there were a trick in combining fonts.  \nThanks in advance.\n\n",
  "author": "<a href=\"/web/20100430131317/http://typophile.com/user/23991\" title=\"View user profile.\">oprion</a>",
  "time": "<br>",
  "uid": "23991",
  "comments": [
    {
      "time": "",
      "content": "I suppose it depends upon what you consider morally responsible. ;^) But, Emigre's EULA doesn't allow modifications.\n\n"
    },
    {
      "time": "",
      "content": "I don't know what EULA was in force when you bought Mrs. Eaves, but the current one at Emigre says:\n\n\"3. Except as permitted herein, you may not modify, adapt, translate, reverse engineer, decompile, disassemble, alter or otherwise copy the Emigre Font Software.\"\n\nI can't find any modification permitted in the EULA, unless you think this implies some sort of permission:  \n\"6. You agree that any derivative works created by you from the Emigre Font Software, including, but not limited to, software, EPS files, or other electronic works, are considered derivative works under U.S. Law and use of the derivative work is subject to the terms and conditions of this License Agreement. Derivative works may not be sublicensed, sold, leased, rented, lent, or given away without written permission from Emigre. Emigre shall not be responsible for unauthorized, modified and/or regenerated software or derivative works.\"\n\n... I don't think it does.\n\nSo, bottom line, check the EULA you agreed to when you bought the font, but I'd be surprised if what you're planing is kosher.\n\n"
    },
    {
      "time": "",
      "content": "Basically, I look at it this way: Suppose I bought two cases of lead type, and decided to combine them in a single job case for easier access. Would that really be such a heinous act?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20100430131317/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "",
      "content": "Two different kinds of things.\n\n"
    },
    {
      "time": "",
      "content": "Wouldn't this be similar to converting a Mac font to PC with a program like Transtype?\n\nGranted there isn't a nice little program that takes TT files and smashes them into a OTF file quickly. Or at least not yet.\n\n[http://www.typophile.com/node/9696](http://web.archive.org/web/20100430131317/http:/www.typophile.com/node/9696 \"http://www.typophile.com/node/9696\") - devil's advocate, converting for a different OS is okay, but converting for the same isn't?\n\n"
    },
    {
      "time": "",
      "content": "what did Emigre say when you asked them?  \nDid they offer a deal on the OTF since you already own some TTFs from them already?\n\nJason C\n\n"
    },
    {
      "time": "",
      "content": "Legalities/morality aside, it also depends on how much your time is worth. I've changed a lot of our old Adobe Type 1 fonts into OT, and I started much closer to the final product that your proposed starting point. For example, we had already made \"database\" Type 1 fonts -- all glyphs in one font, but not named properly for OT. I also used programming to do the name changes (in a PFA font format), so once I had a list of names I had used consistently in Type 1 fonts -- like oneoldstyle -- and the proper OT name to replace it -- like one.op (for \"oldstye, proportional\") I just ran the program & the names were changd in both the font & metrical data.\n\nTo make an roman and italic OT font, writing all the features, making up & kerning extra stuff for fractions, superiors, etc. etc, takes me 2 to 3 eight-hour days. And this is with flat, pairs kerning, not class-based kerning.\n\nIf your time is of much value -- that is, if you can sell it for anything -- you are better off re-buying the fonts. So why don't we do that? Ah. We're in a specialized business, and and I have to rework even the most recent OT fonts from Adobe, like Arno. Arno, roman and italic, standard only, took me one flat week (40 hours). To be fair, much of the extra time was due to the complexities of Arno (including the changed naming system used in it), but some of those complexities are also in a font like Mrs. Eaves. For example, how do you handle the small-caps numbers? Switch them along with the small caps? Not a good idea in our line of work. Switch them separate with a Stylistic Set? Now you have more documentation to keep track of & write so me plus our other 2 comps will know to access them. Petite caps. And on & on.\n\nWith \"our\" Arno, I wound up with far fewer features & less kerning, but I did have what Adobe had left out that would cost us six hours per book in our specialized work. If I could have just paid Adobe an extra $500 to add what we needed, we'd have been money ahead. But Adobe is sensible; I doubt they could do what we needed for $1,000 or more, so we are money ahead. Plus I now have a font that i can go back into & add characters when one of our customers decides they want to use Arno for a text with transliterated Devanagari.\n\nUnless you have this kind of need, and are far more experienced with writing OT features & using Fontlab than you say, I'd suggest you spend the money to buy the new OT font.\n\n"
    },
    {
      "time": "",
      "content": "Holy jumping picas! Thats rather a lot more then I was prepared to invest in. Frankly, I hoped the whole operation would take about an hour or so, but a few weeks... I'll just stick to using multiple TrueType fonts then. Thanks everyone.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20100430131317/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "",
      "content": "Oh well, I did it anyway. Ligs, Caps, Old style Figures — all in one font The kerning pairs still need some polish, but otherwise I am quite happy.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20100430131317/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "",
      "content": "And you've written all the feature code, so things work with OT savvy layout programs? And the characters all properly named so if you want to pull text from a PDF you can get it? Or prepare an XML file from the source files? Fast work indeed.\n\n"
    },
    {
      "time": "",
      "content": "Well yeah, it's named and coded. Haven't really tested it yet in other applications, so things might not be as tuned as I imagine. As I am just starting to learn FontLab, I stole most of the naming, code, and class convention from Adobe Garamond. If nothing else,this is be a good lesson in using the program.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20100430131317/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "",
      "content": "And now you've publicly admitted to violating their EULA too. :^P O:^)\n\n"
    },
    {
      "time": "",
      "content": "I don't think they hold Copyright on names like Fsmall and l\\_l or standard expressions.  \nNot like I copied any Adobe code, just inspected it to learn how the OT scripting works, and written my own. Like I said, I stole the **conventions**. :)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20100430131317/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "",
      "content": "Tiffany means Emigre's EULA.\n\n"
    },
    {
      "time": "",
      "content": ":)\n\n\"Fsmall\"? You better learn from latest Adobe fonts, not from the old ones ...\n\n"
    },
    {
      "time": "",
      "content": "Um. last time I looked, Adobe Garamond didn't have small cap figures, just oldstyle and lining. But last time I looked, Mrs. Eaves had all three. So what feature did you use to access them?\n\nAs far as \"stealing\" Adobe's feature code, I don't think they would mind particularly. The old code from AG is pretty much the same as the examples that come with FontLab. Beyond that, we discuss ways to write code on this forum; we expect others to use what is helpful.\n\nAnd the naming conventions aren't exactly Adobe's property either, but it does pay to read what they've published about how an extraction of text from a PDF file works.\n\nWhat everyone is concerned about is that you agreed to abide by certain conditions when you licensed the right to use some software -- in this case, a font -- and have now shown a willingness to go back on your word.\n\nCharles Ellertson\n\n"
    },
    {
      "time": "",
      "content": "Speaking for Adobe, we publish the FDK source code (also usable in FontLab) for several of our fonts specifically to serve as a model for others. That being said, I'm sure our lawyers would object to people opening our fonts in FontLab and borrowing the code. If the published code samples we've posted are insufficient in some way, just let us know what you need, and we can try to accommodate the request.\n\nRegards,\n\nT\n\n"
    }
  ]
}
