{
  "id": "43376",
  "title": "Upcoming Church Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey all, I’d love you critique on a logo design I’m working on. This is a redesign for a church that has seen quite a bit of change in the last few months, and wants to carry that through to their print identity. While the church body has been around for a while, in many ways they’re like a new church plant. This church is part of the [foursquare denomination](http://web.archive.org/web/20080920053759/http:/www.foursquare.org/), which is a more charismatic church somewhat in between a baptist church and a pentecostal church. I’d love to have your opinions.\n\n ![](http://web.archive.org/web/20080920053759im_/http:/www.typophile.com/files/logo3_4234.jpg)\n  \n\n ![](http://web.archive.org/web/20080920053759im_/http:/www.typophile.com/files/logo2_4631.jpg)\n\n [‹ Font type suggestion? Multipurpose Logo (Web, T-shirt, Caps)](http://web.archive.org/web/20080920053759/http:/www.typophile.com/node/43735 \"Go to previous forum topic\") [Logo for trading company ›](http://web.archive.org/web/20080920053759/http:/www.typophile.com/node/43123 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080920053759/http://www.typophile.com/user/27335\" title=\"View user profile.\">Maverick18x</a>",
  "time": "<br>",
  "uid": "27335",
  "comments": [
    {
      "time": " 20.Mar.2008 5.06am",
      "content": "Well, this does look like the kind of logo you see for this type of church but I would love to see something more done with the type. The whole thing looks unbalanced.\n\nMaybe reducing the size of the logo in relation to the type and choosing a different type. The name GENESIS looks great set in all small caps in a font like Dolly. I think a font that has more character would be great. I keep mentioning Dolly because the small caps in Dolly has a squarish shape to me. I think it would match the shape of your logo better.\n\nSharon\n\n"
    },
    {
      "time": " 20.Mar.2008 10.44am",
      "content": "erm, a web 2.0 church??\n\n"
    },
    {
      "time": " 20.Mar.2008 12.53pm",
      "content": "Sharon, thanks for the comment, I’ll definitely take a deeper look at balancing out the different elements. Also, I’m seeing that maybe the font kerning is too loose for the shape.\n\nalyz, Can you explain what you see in this that feels web 2.0? Is it the mark? I’m actually not opposed to giving off that vibe, but it would be interesting to know why that registered with you. When I think of web 2.0 I tend to think of rounded fonts, glossy shapes, and reflections.\n\n"
    },
    {
      "time": " 20.Mar.2008 4.55pm",
      "content": "My first thought was that it looked and felt a lot like the Bahamas logo.\n\n ![](http://web.archive.org/web/20080920053759im_/http:/www.typophile.com/files/bahamas_logo_4858.gif)\n\n"
    },
    {
      "time": " 20.Mar.2008 10.30pm",
      "content": "Mav, loosen that thing up. It feels mechanical/lifeless.\n\n"
    },
    {
      "time": " 21.Mar.2008 6.36am",
      "content": "I looked at this several times before choosing to comment on it. Overall, I think that you’re moving in a promising direction.\n\nHere’s what I like about it:  \n- The shapes tastefully and subtly suggest foursquare.  \n- I get the impression of a cross in the negative space between the shapes. With the curves, the cross seems to flow around the shapes and has motion.  \n- It looks better in black and white than in color (which is good, because it means your core design works well; you can always tweak colors later).\n\nHere’s what needs improvement:  \n- The smaller shapes in the upper left and lower right quadrants may improve by being increased in size slightly.  \n- A second on getting “Genesis” in all same-sized small caps.  \n- I think a more useful arrangement would be to center “genesis” (now in small caps) over “Christian Fellowship” and then horizontally (or even vertically) arrange the text with the shapes. Right now, the arrangement is lumpy; I’m not perceiving a strong line that moves the eye through the whole work.\n\n"
    },
    {
      "time": " 22.Mar.2008 4.55pm",
      "content": "Hiroshige, if you’ve got any tips on making the logo feel more alive, I’d love to hear them. I definitely don’t want it to come off as lifeless.\n\nnvhiadek, I’m so glad you saw the things you did like, those were definitely intentional aspects of the shape and I’m glad to see someone mention them. I will definitely play with the other details though and agree that at the very least the arrangement could use some improvement.\n\n"
    },
    {
      "time": " 23.Mar.2008 8.35am",
      "content": "This feels really, really forced, but if you loosen up a little it can work. Also, the downward angle on the middle stroke of e just doesn’t make sense and looks odd. Last, ditch the “Christian Fellowship” tagline; leaving it in there is going to put everything this goes on in the same class as “Christian Babysitting” and “Christian Housekeeping”&nbsp;logos. There’s no reason the tagline cannot be added to individual project when appropriate, and in more creative ways.\n\n"
    },
    {
      "time": " 23.Mar.2008 11.12pm",
      "content": "The mono line weight around the squares and the mono line weight of genesis are so alike that the meaning of either element is lost and these two elements tighten up and bland. Loosen up those squares, give them their own rhythm and let genesis play on that. Put some life into that thing. And I too think the byline interferes with the other elements.\n\nCrank up the Rolling Stones for an uninterrupted twenty four hours, then get back to the design...\n\n"
    },
    {
      "time": " 24.Mar.2008 11.24am",
      "content": "As a pastor who is used to seeing churches who have no basic understanding of identity and design, I have to say, it is thrilling to see the beginnings of a design like this one that looks smart and refined. I agree with everyone who has said, thus far, that it is on the right track, but needs a little bit of help. The main issue (as others have pointed out) is balance. The four squares look like they are going to flip the whole logo on its side. I agree with nvhladek that the negative space in the mark is nice. I disagree with James that you need to ditch the tagline entirely, because, in this context “Christian Fellowship” is how you are trying to denote that Genesis is a church. Thus, “Christian Fellowship” here isn’t a tagline, but rather an integral part of the name “Genesis Christian Fellowship.” As such, I think you should lose the italics and actually rework it into the overall design to give it more weight than it currently has. Does that make sense? Nice work. I’m looking forward to seeing how it evolves...\n\n"
    }
  ]
}
