{
  "id": "43375",
  "title": "BBB & the Font Business",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was wondering what people's thoughts are as consumers and or business owners on the BBB/Better Business Bureau.\n\n",
  "author": "ebensorkin",
  "time": "19 Mar 2008 — 3:44pm",
  "uid": "2942",
  "comments": [
    {
      "time": "19 Mar 2008 — 3:51pm",
      "content": "Doing a search results in this hit...\n\n[http://orlando.bbb.org/codbrep.html?id=150457937&print=y](http://web.archive.org/web/20130323145543/http:/orlando.bbb.org/codbrep.html?id=150457937&print=y \"http://orlando.bbb.org/codbrep.html?id=150457937&print=y\")\n\n\"Mr Genesis A Font\"\n\nThat guy should be in the type development business. ;-)\n\nSeriously the only font business I know of that displays the BBB logo is Ascender... [http://www.ascendercorp.com/index.html](http://web.archive.org/web/20130323145543/http:/www.ascendercorp.com/index.html \"http://www.ascendercorp.com/index.html\") - there may be others, but starting an e-commerce font business from the ground up probably required it?\n\n"
    },
    {
      "time": "19 Mar 2008 — 4:06pm",
      "content": "I know that Monotype belongs. I hadn't put in the whole who's who yet. Mostly because I was wondering if it is a factor in anybody's thinking in the Font Biz.\n\nFor instance, would you Si, look someone up that way or react one way or the other to seeing it on a subcontractor's web page? I am guessing not. I could see where it might (maybe) make a difference to a foundry especially a small one. But my gut is that people come to Typophile or other forums and ask around... Or they do even less.\n\nA thread like this can't answer these questions definitively but it might help to get insight. So am I right in thinking that you think it's mostly a font customer & foundry issue if it's one at all?\n\n"
    },
    {
      "time": "19 Mar 2008 — 4:14pm",
      "content": "If I was considering giving my credit card details to a company I didn't know then I may well look them up.\n\n"
    },
    {
      "time": "19 Mar 2008 — 4:44pm",
      "content": "The Better Business Bureau is somewhat of a scam, from what I've heard. You pay your annual dues and get a little plaque, but they don't really do anything to verify that you're not a con artist. It's somewhat akin to having a business card -- it might convey professionalism, but in no way does it guarantee it.\n\n"
    },
    {
      "time": "19 Mar 2008 — 6:05pm",
      "content": "BBB has been directly involved, and helpful, with sellers on Ebay trying to sell large font bundles.\n\n"
    },
    {
      "time": "19 Mar 2008 — 9:23pm",
      "content": "So they have ben helpful with the industry then. That's good to know.\n\n"
    }
  ]
}
