{
  "id": "4339",
  "title": "handwritten mystery font",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Hi,   \n   \nI desperatly need help finding this font. I looked everywhere, it is somewhat similar to P22 Ruthie.   \n   \nPlease help! Thanks, Robin   \n ![whats this fonts name?](http://web.archive.org/web/20130406114030im_/http:/www.typophile.com/forums/messages/83/33746.jpg)\n\n",
  "author": "robin_b",
  "time": "18 Apr 2004 — 11:41am",
  "uid": "3491",
  "comments": [
    {
      "time": "18 Apr 2004 — 12:09pm",
      "content": "I collect script fonts, and this one looks unfamiliar to me. The major problem with finding handritten or printed fonts is that they are so easy and cheap to make. I will be watching this thread too, in case someone knows this one, but I made searches for anything to do with Einstein and typefaces or fonts or handwriting. There were no samples clear enough to say that this is even based on his handwriting, although this might make you want to suppose it is. I have also scanned through all the everyday handwriting fonts in the [Script Font ID Guide, Part 9](http://web.archive.org/web/20130406114030/http:/bowfinprintworks.com/Script09Pg1.html) without finding anything much like it. I will also check Part 10 (Antique Handwriting) in case I might have put it there.\n\n"
    },
    {
      "time": "18 Apr 2004 — 12:21pm",
      "content": "After looking through Part 10, I would have to say that I still don't recognize this, but rather than [P22 Ruthie](http://web.archive.org/web/20130406114030/http:/www.myfonts.com/fonts/ihof/p22-ruthie/), which is very 'greeting card-ish' (but nice), I would say this most resembles the new ITC Christoph's Quill (below):   \n ![Christoph's Quill sample](http://web.archive.org/web/20130406114030im_/http:/www.typophile.com/forums/messages/83/33749.gif)\n\n"
    },
    {
      "time": "18 Apr 2004 — 5:53pm",
      "content": "As this is a funny but juvenile mathematical 'proof' that women are evil, it probably has nothing to do with Einstein and probably is a recent and possibly free font.\n\n"
    },
    {
      "time": "20 Apr 2004 — 10:05am",
      "content": "to Mike: I was amazed about your answer. Fast and so resourceful. Thank you! I don\n\n"
    }
  ]
}
