{
  "id": "43408",
  "title": "Illustration degree?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Graphic design has been a huge interest of mine for the last few years and after attending a couple different colleges in non design related programs, I’m thinking about switching over to a design school. The only problem is I’ve looked into most area graphic design schools and they are a lot more than I can afford. That being said, there’s a local art school that offers a bachelors in illustration that is less expensive than the other schools. They have a decent amount of graphic design classes. So my question is, would this illustration program be a good way to go? My plan is to run my own graphic design studio, but just in case, would I be able to land a job as a graphic designer with that degree?\n\nThanks!\n\n [‹ Trainings in Open Source Multimedia Instruments](http://web.archive.org/web/20080705161528/http:/www.typophile.com/node/43342 \"Go to previous forum topic\") [How goes the \"ABC\" in your country/language? ›](http://web.archive.org/web/20080705161528/http:/www.typophile.com/node/43193 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080705161528/http://www.typophile.com/user/25231\" title=\"View user profile.\">Shawn_G</a>",
  "time": "<br>",
  "uid": "25231",
  "comments": [
    {
      "time": " 20.Mar.2008 8.39am",
      "content": "If you have a good portfolio, are creative, and know how the software works, you won’t have too much trouble getting a job with an illustration degree. There are some really great firms that do a lot of in-house illustration and ONLY hire people who can draw well.\n\n"
    },
    {
      "time": " 20.Mar.2008 9.54am",
      "content": "I came form an illustration background myself. I did a post-grad in electronic prepress to get my foot in the door and got a really good internship and job at a top design firm. As James said, it’s more about your portfolio. Having drawing skills definitely helps in design - for logos and project where there’s no good imagery or photography to work with. Learn all you can about typography - in and out of school.\n\n"
    },
    {
      "time": " 20.Mar.2008 5.15pm",
      "content": "That’s what I was hoping. Thanks for the input/info.\n\n"
    }
  ]
}
