{
  "id": "43414",
  "title": "Looking for a typeface for a logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm looking for a typeface (either for use or for inspiration) for use in a logo, some of the key words are:  \nnightlife, fun, party but still clean and professional. It is for a website that advertises \"packages\" for city nightlife, with different packages, like \"punk night out\", \"gay night out\", \"glamorous night out\" etc. So it can't be too this-or-that since it must work for several groups of people. Punks should like it, so should preps, glamorous high-fashionistas and so on. It's maybe vague, but anyone got any suggestions?\n\n",
  "author": "sondre m",
  "time": "20 Mar 2008 — 10:52am",
  "uid": "26373",
  "comments": [
    {
      "time": "20 Mar 2008 — 2:49pm",
      "content": "Since you will be presumably using secondary typefaces to stylize each of the different packages and in themselves will be very over-the-top and/or decorative you might look for something simple that plays well with others. What about [Omnes](http://web.archive.org/web/20131015115141/http:/www.joshuadarden.com/shop/omnes.php) or [Bryant](http://web.archive.org/web/20131015115141/http:/www.processtypefoundry.com/typefaces/bryant2/index.html)? Too round?\n\n"
    },
    {
      "time": "20 Mar 2008 — 3:32pm",
      "content": "Yeah, need something that will work well with others (although we won't be able to play with the typography as much as wanted since this is a web-project, hnngh).\n\nAnd the fonts you mentioned where nice, and something I'll keep in mind but I do think they are a bit round, yes. Since this is \"night out\" it's mainly focused at young people about 20-30 that wants to go out in Oslo and have a few drinks, dance or get insanely drunk or whatever they want to, so I'm thinking something abit more... urban perhaps?\n\n"
    },
    {
      "time": "20 Mar 2008 — 4:54pm",
      "content": "Are you going to create images with the type or are you hoping to use CSS? Many foundries don't allow embedding for the web so we need to know that too.\n\n"
    }
  ]
}
