{
  "id": "43436",
  "title": "Obama, Gotham, Presidential fonts... has it all been said?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m talking to a journalist tomorrow on this subject. Given the blanket coverage of this, is there really anything more to say, or has it all been said?\n\n",
  "author": "<a href=\"/web/20090607101653/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 20.Mar.2008 10.35pm",
      "content": "Discussion of the differences between the campaigns has been exhausted for sure. Maybe something about how design has changed over the years. Are the campaign buttons of today different or the same as those from the 20th century?\n\n"
    },
    {
      "time": " 21.Mar.2008 12.07am",
      "content": "or maybe the place in which a lot of this takes place. I have seen more Digg user icons and facebook group joins than all the obama anything in the real world. Maybe that’s just cause I spend too much time on the machine, but it seems like campaigning is lending itself more and more towards the internet, which is dominated by design rather than physicality. In the real world having a sign versus having no sign seems to make the difference. On the web the competition for space isn’t as wide a gap, so looking better seems to be more important.\n\nI also see calendars (albeit set in futura bold condensed) [signage](http://web.archive.org/web/20090607101653/http:/www.iclips.net/deadheadsforobama.php), etc. etc. which is campaign design taken into the hands of supporters, which bugs me greatly.\n\nsorry. as for the actual fonts I don’t think there’s a whole lot that hasn’t been covered.\n\n"
    },
    {
      "time": " 21.Mar.2008 12.49am",
      "content": "\\> is there really anything more to say, or has it all been said?\n\nDoes he care/know?\n\n"
    },
    {
      "time": " 21.Mar.2008 2.59am",
      "content": "david brings up a good point in that regardless of what we have seen, for the most part the publiac hasn’t heard a word. I’m sure sii knows that and is just digging deeper in case of a truly different question.\n\n"
    },
    {
      "time": " 21.Mar.2008 6.13am",
      "content": "I would be curious to know who made the decisions. Why did Obama’s camp develop the symbol? Why change to the Gotham slogans? Somebody who’s design savy must be on the political staff. The idea that an educated client is a big plus in getting good work is an hypothesis I’d like to see followed up.\n\n"
    },
    {
      "time": " 21.Mar.2008 6.14pm",
      "content": "Thanks everyone for the input, in the end I did talk a bit about the discussion around where will Gotham be in ten years time, sort of in the context of Office moving from TNR to Calibri. Seems like the chap had been talking to all the usual suspects, so hope he writes a good piece.\n\n"
    },
    {
      "time": " 21.Mar.2008 6.40pm",
      "content": "<cite>Somebody who’s design savy must be on the political staff.</cite>\n\nOr maybe they just got lucky when making the same random choices that they always do. Give enough monkeys a typewriter and all that.\n\n"
    },
    {
      "time": " 21.Mar.2008 7.10pm",
      "content": "From the beginning I’ve felt Obama’s team has made too many “right” choices for it to be dumb luck. He has been packaged in a way that no other presidential candidate ever has been. The designer in me loves this, but the pessimist in me keeps thinking it is just a little too perfect. But that’s when the designer in me pipes up again and asks why is that bad?\n\n"
    },
    {
      "time": " 21.Mar.2008 7.18pm",
      "content": "Like Colbert says, he’s a secret Muslim! At least that’s why I voted for him. I can hope.\n\n"
    },
    {
      "time": " 21.Mar.2008 7.52pm",
      "content": "<cite>The designer in me loves this, but the pessimist in me keeps thinking it is just a little too perfect.</cite>\n\nHe’s not remotely perfect. He just seems that way because everyone else is so much worse.\n\n"
    },
    {
      "time": " 22.Mar.2008 12.35am",
      "content": "I think it fits into a pattern: When he wants to solve a problem, he meets up with a real expert. Other politicians, faced with anything from the threat of a comet about to strike the Earth to choosing a campaign logo, would form a committee of career political staffers to hash out ideas with what little understanding they have of the subject, perhaps drawing some guidance from public opinion polls. Obama has often demonstrated that he would see that the best solutions can only come from, in the former case, an actual astrophysicist, or in the latter case, an actual graphic designer, and go talk to the best one he can find.\n\n"
    },
    {
      "time": " 22.Mar.2008 9.23am",
      "content": "\\>a comet about to strike the Earth\n\nSo he’d just get Bruce Willis opinion, and nuke it? Sweet!\n\n"
    },
    {
      "time": " 22.Mar.2008 9.25am",
      "content": "Maybe he wouldn’t get an opinion from someone who said it wasn’t a comet but rather a friendly jesus rock coming with KoolAide and cookies.\n\nMaybe he wouldn’t get an opinion from someone that had given a big donation or changed a vote to get some sort of globalist trade law passed previously.\n\nWho knows?\n\n"
    },
    {
      "time": " 22.Mar.2008 10.35am",
      "content": "\\>a friendly jesus rock\n\nA few days back my wife asked if I’d heard about Obama’s “pasta” controversy. I immediately thought of [this](http://web.archive.org/web/20090607101653/http:/en.wikipedia.org/wiki/Flying_Spaghetti_Monster). However I hadn’t taken her Leicester accent into account and she was really saying “pastor”.\n\n"
    },
    {
      "time": " 22.Mar.2008 10.39am",
      "content": "One other question came up, which I didn’t have an answer. I was asked what high-profile brands use Optima (the McCain font) and Baskerville? (the Hillary font) - I couldn’t think of anything off hand, except the use of Optima in the Vietnam memorial. Anyone help out on this question?\n\n"
    },
    {
      "time": " 22.Mar.2008 10.46am",
      "content": "\\>“pasta” controversy\n\nThe way internet rumors go, I suspect that by Thursday Fox News will be asking “Was Mr. O canoodling with someone other than Mrs. O? This could be devastating for Mr. O’s campaign. (At least we hope so.)”\n\n"
    },
    {
      "time": " 22.Mar.2008 10.49am",
      "content": "Is Pond’s (beauty cream etc.) Optima?\n\n"
    },
    {
      "time": " 22.Mar.2008 11.40am",
      "content": "I found some other specifics but they don’t seem to be household names so maybe the generic...\n\nBaskerville: Universities, law firms, governmental departments, professional organizations such as guilds - to invoke tradition and officialdom.\n\nOptima: Cosmetics companies, wayfinding (from the 70’s), opticians (they must gravitate to the name?).\n\n"
    },
    {
      "time": " 22.Mar.2008 12.00pm",
      "content": "Optima was the signage font in the Typecon 2007 hotel IIRC.\n\n"
    },
    {
      "time": " 22.Mar.2008 12.01pm",
      "content": "I think of Optima as a very typical hospital signage font.\n\n[Breast Cancer Research Foundation](http://web.archive.org/web/20090607101653/http:/www.bcrfcure.org/) is also Optima.\n\n"
    },
    {
      "time": " 22.Mar.2008 12.15pm",
      "content": "Optima:  \nCars: [Aston Martin](http://web.archive.org/web/20090607101653/http:/www.astonmartin.com/home)  \nDrugs: [Alka-Seltzer](http://web.archive.org/web/20090607101653/http:/www.alka-seltzer.com/home/default.htm)  \nMoney: [Commerzbank](http://web.archive.org/web/20090607101653/https:/www.commerzbank.de/)  \nCattle: [International Livestock Research Institute](http://web.archive.org/web/20090607101653/http:/www.ilri.org/)\n\n"
    },
    {
      "time": " 22.Mar.2008 2.06pm",
      "content": "It’s used in all the hilton hotels for small scale signage (plaquage?)\n\n"
    },
    {
      "time": " 23.Mar.2008 10.10am",
      "content": "Thanks everyone, I passed these on, with credit to typophile.\n\n"
    },
    {
      "time": " 23.Mar.2008 10.32am",
      "content": "update on some more optima stuff (for kicks)\n\nholiday inn express plaquage as well  \njergens uses it for packaging, as do about 25% of all the other companies in my bathroom.  \nmy theatre arts building has it machined metal as the building’s title.\n\n"
    },
    {
      "time": " 23.Mar.2008 3.19pm",
      "content": "\\>So, I ask you, will graphic designers rule the world one day?\n\nIf GW and Cheney can push the price of gas to $4, how much will font prices inflate under the designer regime?\n\n"
    },
    {
      "time": " 23.Mar.2008 3.45pm",
      "content": "Is Saudia Arabia running out of fonts?\n\nSomeone needs to get a Peak Fonts book rolling because at this rate it will take 48 years or so to see the results from the master plan.\n\n"
    },
    {
      "time": " 23.Mar.2008 4.15pm",
      "content": "I find it interesting that when you ebay the candidates, the number of items for sale comes very close to matching the ratio of the number of people who showed up to vote.\n\nItems for sale on ebay:  \nObama: 1806 items  \nClinton: 1289 items  \nMcCain: 453 items\n\nActual votes: (from CNN)  \nObama - 15,668,597  \nClinton - 14,363,015  \nMcCain - 5,722,366\n\nThe highest priced (by far) ebay items are Obama’s that include Gotham. Some Shepard Fairey (OBEY) Obama posters are selling for over a thousand dollars! I honestly think Obama’s savvy identity has targeted voters every bit as well as any strong retail marketing campaign targets a demographical market.\n\nSo, I ask you, will graphic designers rule the world one day? (like Cheney does now?)\n\nEileen\n\n"
    },
    {
      "time": " 23.Mar.2008 4.18pm",
      "content": "Hmm. So I fix a typo and my post moves to the bottom? That’s weird. I’ll never do THAT again!\n\n"
    },
    {
      "time": " 23.Mar.2008 4.20pm",
      "content": "Makes Simon seem rather prescient.\n\n"
    },
    {
      "time": " 23.Mar.2008 6.19pm",
      "content": "[Ron P aul](http://web.archive.org/web/20090607101653/http:/img.photobucket.com/albums/v240/furfur/ronpaul.jpg)\n\n(seen on my way through grapevine, tx)\n\n"
    },
    {
      "time": " 23.Mar.2008 6.33pm",
      "content": "Forgot the period after the P.\n\n"
    },
    {
      "time": " 23.Mar.2008 6.58pm",
      "content": "<cite>Hmm. So I fix a typo and my post moves to the bottom? That’s weird. I’ll never do THAT again!</cite>\n\nOr do it until someone fixes that. It didn’t used to be that way.\n\n"
    },
    {
      "time": " 23.Mar.2008 7.10pm",
      "content": "Moving edited comments down really twists the flow of a conversation. It makes it impossible to follow a thread - replies appear before the comments they’re replying to. It’s like we’re psychic and pushy.\n\nThis site is drupal, so I know it can be fixed rather simply, so perhaps they have their reasons for leaving it that way? I can’t imagine why, though ....? Shrug.\n\n"
    },
    {
      "time": " 23.Mar.2008 7.58pm",
      "content": "Have any of you guys ever imagined what will be the font market in one hundred years in the future? Would it be one billion trillion trillons faces? ;)\n\n"
    },
    {
      "time": " 23.Mar.2008 9.17pm",
      "content": "<cite>Have any of you guys ever imagined what will be the font market in one hundred years in the future?</cite>\n\nWhen you figure in the curve of technological progress, well, uh...never mind.  \n; )\n\n"
    },
    {
      "time": " 24.Mar.2008 3.38am",
      "content": "“Have any of you guys ever imagined what will be the font market in one hundred years in the future? Would it be one billion trillion trillons faces? ;)”\n\nI personally don’t think we will get to one billion trillion, much less a billion trillion trillon fonts. We will however, have that at least that many chaotic threads.\n\nCheers!\n\n"
    },
    {
      "time": " 24.Mar.2008 3.44am",
      "content": "indeed.\n\n"
    },
    {
      "time": " 24.Mar.2008 5.29am",
      "content": "\\>\\>  \nHave any of you guys ever imagined what will be the font market in one hundred years in the future?  \n\\<\\<\n\nYou think the cockroaches will be buying fonts?\n\n"
    },
    {
      "time": " 24.Mar.2008 5.47am",
      "content": "<cite>You think the cockroaches will be buying fonts?</cite>  \n [For sure.](http://web.archive.org/web/20090607101653/http:/www.latinotype.com/espanol/fonts/ChileanBugs/view_fonts.html)\n\n"
    },
    {
      "time": " 24.Mar.2008 6.50am",
      "content": "“You think the cockroaches will be buying fonts?”\n\nThey surely will be pirating them though.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Mar.2008 7.26am",
      "content": "Worse. They gonna file myriads of bug reports.\n\n"
    },
    {
      "time": " 24.Mar.2008 7.53am",
      "content": "and they will be real pests about it, too :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Mar.2008 8.18am",
      "content": "I asked myself once: “Does anybody file bug reports” Uhhhhh.....\n\n"
    },
    {
      "time": " 24.Mar.2008 8.42am",
      "content": "No, they just sandpaper them to death :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Mar.2008 10.17am",
      "content": "Thanks ChrisL, for the vote of confidence. Cheers! I get to go....\n\n"
    },
    {
      "time": " 25.Mar.2008 7.47pm",
      "content": "McCain’s Optima seems to be the font of [Oil of Olay](http://web.archive.org/web/20090607101653/http:/images.google.com/imgres?imgurl=http://www.adcrew.com/adcrew/OLAYADCr.JPG&imgrefurl=http://www.adcrew.com/adcrew/oilofolay.htm&h=320&w=298&sz=16&hl=en&start=1&sig2=1ayZ5oM2MB9cHPbKSStPNA&um=1&tbnid=0E6qrOEn9FBulM:&tbnh=118&tbnw=110&ei=B7jpR6KyJqGUet6H1ZQP&prev=/images%3Fq%3Doil%2Bof%2Bolay%26um%3D1%26hl%3Den%26client%3Dsafari%26rls%3Den%26sa%3DN)  \nWhat is he trying to tell us?\n\n-Rob\n\n"
    },
    {
      "time": " 25.Mar.2008 9.23pm",
      "content": "<cite>McCain’s Optima seems to be the font of Oil of Olay. What is he trying to tell us?</cite>\n\nI like that it feels natural, not greasy, and adds sunscreen at the same time. What more do you want?\n\nMcCain will give the Dems more war, and raise the taxes (and be lib on most other things) for the rest of us. What more do you want?\n\n(Letterman-Leno in ’08. If it has to be a joke, elect professionals.)\n\n"
    },
    {
      "time": " 3.Apr.2008 9.15am",
      "content": "”... has it all been said?”\n\nNO! :) there is a nice interview of Heller in the NY Times “Campaign Stops” blogs...\n\n...pushing the volume of 2008 electoral type talk beyond the total volume of all talk from the 1808 election.\n\nCelebrate!\n\n"
    },
    {
      "time": " 3.Apr.2008 10.00am",
      "content": "Also, Roger in Newsweek...\n\n[http://www.newsweek.com/id/129573](http://web.archive.org/web/20090607101653/http:/www.newsweek.com/id/129573 \"http://www.newsweek.com/id/129573\")\n\nand, closing the loop, here’s the article I contributed to...\n\n[http://www.calendarlive.com/tv/radio/cl-ig-font30mar30,0,3185765.story](http://web.archive.org/web/20090607101653/http:/www.calendarlive.com/tv/radio/cl-ig-font30mar30,0,3185765.story \"http://www.calendarlive.com/tv/radio/cl-ig-font30mar30,0,3185765.story\")\n\nThanks everyone!\n\n"
    },
    {
      "time": " 4.Apr.2008 4.02am",
      "content": "The essence of the quote (Tobias Frere-Jones in the above mentioned article in calendarlive) “I’ve never once seen a sign that’s in Arial, Helvetica or Comic Sans” I find is quite amazing, as it’s harder to prevent people from using these fonts all the time instead of a given corporate font ...\n\n"
    },
    {
      "time": " 4.Apr.2008 4.22am",
      "content": "All right then. The ballots will have the candidates name, party, and font. No more mistakes.\n\nCheers!\n\n"
    },
    {
      "time": " 4.Apr.2008 5.54am",
      "content": "\\>I find is quite amazing\n\nMaybe the Obama folks take away these signs at the door to the venue? More likely in a sea of white on blue Gotham they just don’t stand out?\n\n\\>All right then. The ballots will have the candidates name, party, and font. No more mistakes.\n\nWhat if I want to vote for McCain and Gotham? Or do I just get to pick one?\n\nCheers, Si\n\n"
    },
    {
      "time": " 4.Apr.2008 7.27am",
      "content": "“What if I want to vote for McCain and Gotham? Or do I just get to pick one?”\n\nSi, If you want to vote for McCain then you can only choose a much older typeface, perhaps even caligraphy :-)\n\nChrisL\n\n"
    },
    {
      "time": " 5.Apr.2008 1.41am",
      "content": "Perhaps they’ll provide little stickers with the crosses printed in the different fonts, then you could take a Gotham cross sticker and place it next to the name of McCain - whatever counts then ...\n\n"
    }
  ]
}
