{
  "id": "43466",
  "title": "Resume Review",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hello everyone. I'm still relatively new here so it feels a bit exploitative to request critique without providing any. But if you're willing, I'd like to have your thoughts on the design of my resume. I've changed most of the contact information because I'm not too hot on the idea of putting my phone number into the wild.\n\nI am interested in _any_ form of comment, those regarding content, design, layout, font choice, etc.\n\nI guess I'd call myself a \"design hobbyist\". It interests me, and I've taken some classes on it in high school, but nothing since then. I have very thick skin though, so please, don't hold any criticism back! Thanks!\n\n",
  "author": "mrestko",
  "time": "21 Mar 2008 — 7:18pm",
  "uid": "26958",
  "comments": [
    {
      "time": "21 Mar 2008 — 7:47pm",
      "content": "Okay, I've managed to attach the PDF to my first post.\n\n"
    },
    {
      "time": "22 Mar 2008 — 5:17am",
      "content": "It looks good to me. There are good white spaces and it is all in one single page. I don't dare to advice further. You could add professional and personal references from people who know you, as a short list as kind of referals, as a second page. I like the TT ligature.\n\nCheers\n\nAndre\n\n"
    },
    {
      "time": "22 Mar 2008 — 1:53pm",
      "content": "Thanks Andre. I'm a little ambivalent about the TT ligature---I kind of like the cleanliness, but I'm also worried that it calls too much attention to itself.\n\nI also wonder about my use of small caps. The _look_ I have right now is good, I think. But I'm not sure the usage is entirely consistent: \"B.S.\" needs to be capitalized (though as I look at it now, should there be a space between the two letters) but GPA could be in small caps. I tried that and it looked a bit weird so I left it with normal caps, is this acceptable? The two-letter abbreviations for the states are in small caps, and I think that works. Thoughts?\n\n"
    },
    {
      "time": "1 Apr 2008 — 4:05am",
      "content": "Well Matt, I guess you already have very good thoughts and modifications to it. As I said, all looks great. The trick are the blanks. Good luck, and good day :)\n\nAndré\n\n"
    }
  ]
}
