{
  "id": "43490",
  "title": "giving up garamond.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i guess at some point i fell in love with adobe garamond, and have been using it far too much along with bembo and a few other serifs. problem? i have to do an identity for a vintage clothing store and i’m trying to use a sans serif, although after about 50 tries and a few oddball fonts they all feel far too modern. any suggestions?\n\n [‹ Helvetica Documentary](http://web.archive.org/web/20080905211140/http:/www.typophile.com/node/43044 \"Go to previous forum topic\") [Type t-shirts ›](http://web.archive.org/web/20080905211140/http:/www.typophile.com/node/43550 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905211140/http://www.typophile.com/user/28648\" title=\"View user profile.\">laurenj</a>",
  "time": "<br>",
  "uid": "28648",
  "comments": [
    {
      "time": " 22.Mar.2008 8.17pm",
      "content": "Many such clothing stores use either an Art Nouveau or an Art Deco typography. It generally fits the era.\n\n"
    },
    {
      "time": " 22.Mar.2008 8.20pm",
      "content": "There are all sorts of vintage stores. Does this one specialize in any one period? Nineteenth century or orange-tag Nike?\n\n"
    },
    {
      "time": " 22.Mar.2008 8.22pm",
      "content": "For vintage inspiration and ideas, look at magazines of the era. Most of the 20th century is certainly represented well with sans serif, but what you’re probably missing is the differences in how type was set, spaced, arranged or accented in previous decades. Helvetica used in the 1950s is recognizably different from how Helvetica is used in 2008.\n\n"
    },
    {
      "time": " 22.Mar.2008 8.23pm",
      "content": "Orange-tag Nike is vintage?\n\nNow that makes me feel old!\n\n"
    },
    {
      "time": " 22.Mar.2008 11.20pm",
      "content": "im using a wide range. 40’s-80’s. i have a ton of old life magazines, but im looking for new sources of inspiration. there are a few boutiques in soho that just specialize in vintage but they have the same aesthetic as any other modern clothing store. it all looks nice but im getting bored of wood floors , white walls, and little else. this is for a school assignment i probably should have clarified that.\n\n"
    },
    {
      "time": " 23.Mar.2008 3.30am",
      "content": "Here are a few directions you might look at.\n\n[Vienna Round](http://web.archive.org/web/20080905211140/http:/www.p22.com/products/vienna.html)\n\n[Solano Gothic](http://web.archive.org/web/20080905211140/http:/www.myfonts.com/fonts/mvbfonts/solano-gothic/)\n\n[Moulin Rouge Solid](http://web.archive.org/web/20080905211140/http:/www.t26.com/fonts/Toulouse_Lautrec)\n\n"
    },
    {
      "time": " 23.Mar.2008 8.30am",
      "content": "If you have the budget, a Twentieth Century revival from H&FJ or Font Bureau could be great. There’s something really intriguing about their contemporary interpretations of history that people just can’t miss. On the much less expensive side are Bitstream’s revivals, which capture a lot of the funky quirks that type had back when designers weren’t endlessly revising their fonts to digital perfection. Custom distressed Cooper or Cheltenham would be really cool for vintage, and you could combine it with Alternate Gothic or Franklin Gothic to get some cool arresting heads.\n\n"
    },
    {
      "time": " 23.Mar.2008 9.09am",
      "content": "Check out this lovely sample from Typotheque. I’m not sure I’d have thought of Fedra as “vintage” inspired but it’s beautiful here:\n\n[http://www.typotheque.com/fonts/fedra\\_sans\\_display\\_1/features/](http://web.archive.org/web/20080905211140/http:/www.typotheque.com/fonts/fedra_sans_display_1/features/ \"http://www.typotheque.com/fonts/fedra\\_sans\\_display\\_1/features/\")\n\nalso Anisette from Porchez\n\n[http://www.typofonderie.com/alphabets/view/Anisette](http://web.archive.org/web/20080905211140/http:/www.typofonderie.com/alphabets/view/Anisette \"http://www.typofonderie.com/alphabets/view/Anisette\")\n\nAs Nathaniel said, it’s not only the font, it’s how you use it.\n\n"
    },
    {
      "time": " 23.Mar.2008 11.03am",
      "content": "What’s the problem?  \nThe second-hand clothing is likely to be from the modernist era (roughly 1930-1980), so why not use a modern sans-serif type of similar vintage? Futura, Univers, Avant Garde, etc.\n\n"
    },
    {
      "time": " 23.Mar.2008 11.30am",
      "content": "thanks so much for all your suggestions. they’ve been really helpful.\n\n"
    },
    {
      "time": " 23.Mar.2008 4.26pm",
      "content": "actually, does anyone have tips for setting helvetica or a typeface like it was in the 50’s. i keep playing with kerning etc. but i can’t get it.\n\n"
    },
    {
      "time": " 23.Mar.2008 4.40pm",
      "content": "Off the top of my head Helvetica came onto the scene in 1954 and may not have gained the instant popularity it has today. You might look at another grotesk that predates, and consider how popular hand-painted signs were at that time.\n\nGoogle Max Miedinger.\n\nAlso\n\n[http://www.experimentaljetset.nl/](http://web.archive.org/web/20080905211140/http:/www.experimentaljetset.nl/ \"http://www.experimentaljetset.nl/\")\n\n"
    },
    {
      "time": " 23.Mar.2008 4.46pm",
      "content": "Neutraface.\n\n[http://www.houseind.com/index.php?page=showfont&id=18&subpage=viewfonts](http://web.archive.org/web/20080905211140/http:/www.houseind.com/index.php?page=showfont&id=18&subpage=viewfonts \"http://www.houseind.com/index.php?page=showfont&id=18&subpage=viewfonts\")\n\nChrisL\n\n"
    },
    {
      "time": " 23.Mar.2008 7.25pm",
      "content": "one thing I’ve seen done is the shifting of the baseline between adjacent characters. The up-down-up-down arrangement of letters is (I think off the top of my head) a 50s/early 60s thing. You’ll also want to pick a color palette from the era.\n\nAlso, keep in mind that for anything before the 60s/70s, titles as often as not would be hand-lettered even if they were done in a specific typeface. So it makes sense to go in and convert that type to a path and tweak the letter shapes to fit the particular word, phrase, or container, the same way someone would have done when drawing the letters.\n\n"
    },
    {
      "time": " 23.Mar.2008 9.07pm",
      "content": "I think Helvetica is too ubiquitous today to really give a vintage feel unless you base your design strongly on what was being done with it in the early days.\n\nIf it’s mod you’re after you should check out House Industries Shag and Ed Benguiat among others.\n\n"
    },
    {
      "time": " 24.Mar.2008 7.56am",
      "content": "Right Patty.  \nTo me Helvetica always looks old-fashioned (except the Thin) whenever I see it in use, but people who don’t know its history might not think so.  \nEvery era is condemened to be remembered not for its successes (which last longer, and become associated with subsequent eras as well, or no era in particular), but for the things that died with it.\n\n"
    },
    {
      "time": " 24.Mar.2008 8.36am",
      "content": "40s to 80s is a pretty wide range - I’d try to focus on one era - either 50s retro, 60s mod, 70s groovy, 70s disco, whatever suits your fancy and run with it.\n\nYou can also go to [www.myfonts.com](http://web.archive.org/web/20080905211140/http:/www.myfonts.com/ \"www.myfonts.com\") and type in 1950s in the search window and see what comes up.\n\nIf you’re trying to distinguish yourself from the SoHo vintage stores you mentioned, I’d steer clear of Helvetica. It’s just not an evocative font.\n\nIt freaks me out that clothing I wore in college (80s) could be considered vintage. OTOH, I was wearing a lot of vintage clothing myself back then - 30s and 40s stuff. My mom used to joke that one day I’d come home wearing something she got rid of 30 years earlier.\n\nHearing the songs I danced to at my prom on an oldies station is no fun either.\n\n"
    },
    {
      "time": " 24.Mar.2008 8.36am",
      "content": "“whatever suits your fancy”\n\nGood pun, Patty :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Mar.2008 8.56am",
      "content": "I’ve been picking and reselling thrift for 15 years or so. I sold about 200 pieces this weekend. Usually the older styles don’t move much unless the shop deals with art directors for movies etc. One reason I suggested Solano is that it has a sort of Neville Brody vibe.\n\nOne thing Lauren has not shared is the actual name, and I think that knowing the exact characters and length will have much to do with what type works.\n\nBTW, I’ve never seen a resale shop that had a particularly good identity so there is much room to do something really nice.\n\nMy first thought was to go Douglas Sirk with an A. Paul script, but I don’t think that would hit the market really.\n\nOne of the best bits of thrift is the garment tags. I’ve always taken inspiration from the wonderful historic marks that live on in these little fabric rectangles.\n\n"
    },
    {
      "time": " 24.Mar.2008 9.00am",
      "content": "It isn’t just the typeface, the design has great bearing on it, too.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Mar.2008 9.17am",
      "content": "\\>Every era is condemened to be remembered not for its successes (which last longer, and become associated with subsequent eras as well, or no era in particular), but for the things that died with it.\n\nNick, am I right in thinking that Art Deco never died out? It is still popular but has a nostalgia factor with it. That may be an exception.\n\nOn the clothing store, you might consider the old-looking and somewhat weird but polished look of [Maple](http://web.archive.org/web/20080905211140/http:/processtypefoundry.com/typefaces/maple/index.html).\n\n"
    },
    {
      "time": " 24.Mar.2008 9.17am",
      "content": "Nouveau lives on as well. Just sold a Mucha print shirt from the ’70s. With VH-1 nothing may ever be allowed to die again.\n\n"
    },
    {
      "time": " 24.Mar.2008 9.18am",
      "content": "<cite>either 50s retro, 60s mod, 70s groovy, 80s disco</cite>\n\nLike this [chocolate packaging](http://web.archive.org/web/20080905211140/http:/www.fontblog.de/milka-retro-tafeln)? ;-)\n\n"
    },
    {
      "time": " 24.Mar.2008 9.38am",
      "content": "[http://en.wikipedia.org/wiki/The\\_Stuckists\\_Punk\\_Victorian](http://web.archive.org/web/20080905211140/http:/en.wikipedia.org/wiki/The_Stuckists_Punk_Victorian \"http://en.wikipedia.org/wiki/The\\_Stuckists\\_Punk\\_Victorian\")\n\n"
    },
    {
      "time": " 24.Mar.2008 10.14am",
      "content": "_am I right in thinking that Art Deco never died out?_\n\nAs a movement it died, but came back again in the 1970s, a revival.\n\nThere was a lot of overlap between Art Deco, Moderne, Modernism, etc.\n\nThe most popular new typeface of the Art Deco era, Futura, ceased to be associated only with the original era.  \nBut in general the new types of that era didn’t transfer well, the whole category of geometric slab serif types for instance.\n\n"
    },
    {
      "time": " 24.Mar.2008 10.30am",
      "content": "Nick, I meant Art Deco type. For example, I have seen Broadway, the typeface, ever since I can remember, which goes back to the 1950s. And I think the stuff has also been on packaging...\n\n"
    },
    {
      "time": " 24.Mar.2008 10.41am",
      "content": "You also have to remember that just because a type was released in the timeframe of category or “movement” does not mean that it is interpreted as such. AG came out in the 19th century but is thought of as more a mid 20th century type from the Swiss/German Modernists and International style. It was later supplanted by Helvetica but rarely thought of as a horse and buggy era typeface. Many types of the 1930s are viewed by laymen as older than AG even though they are not.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Mar.2008 11.06am",
      "content": "Bill, you would have to look at publications from an era, especially the specimens of type shops, to determine whether a face was in use then. I just grabbed my specimen of ACC (Advertiser’s Composition Company) from 1950s Los Angeles, and there’s no Broadway in it, although Raleigh, Radiant and Stymie, all Deco era faces, are. And absolutely tons of Futura. But maybe it was different on the East Coast.\n\n"
    },
    {
      "time": " 25.Mar.2008 3.34pm",
      "content": "Brothers is good for contempo-retro.\n\n"
    },
    {
      "time": " 25.Mar.2008 6.34pm",
      "content": "i think i decided im concentrating on the 70’s/80’s.\n\n"
    }
  ]
}
