{
  "id": "43502",
  "title": "Let's talk Atypi 2008 - St. Petersburg, Russia",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So I have been thinking of submitting a talk to Atypi for the 2008 meeting in St. Petersburg Russia. Any thoughts on what it will cost to be there? Have you been there before? What did you do? How much Russian (language) do you need to learn? What about visa/entry issues?\n\n [‹ imaginary shopping spree: what's in your cart?](http://web.archive.org/web/20081008041751/http:/www.typophile.com/node/46858 \"Go to previous forum topic\") [Mac and PC Type Quality Issues ›](http://web.archive.org/web/20081008041751/http:/www.typophile.com/node/46760 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081008041751/http://www.typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 23.Mar.2008 10.05am",
      "content": "I’ve never been to Russia, but you will certainly need a visa in order to enter. You will probably have to apply for this long in advance. I have even been told (although I cannot verify this yet) that you have to book your accommodation before you can apply for a visa. Your hotel will send you a letter that states that you really will be staying there at the certain dates, etc.\n\nI’ve been to the past four ATypI conferences, and am really looking forward to this year’s. I’m sure that even a little bit of Russian would go a long way in St. Petersburg, but I’ll be so busy writing my dissertation in the weeks (and days…) leading up to the conference that I doubt I will be able to learn any myself.\n\n"
    },
    {
      "time": " 23.Mar.2008 10.19am",
      "content": "I have a client who works with travel agencies in St. Petersburg. She is originally from Russia herself. She primarily deals with cruises but I know she would help you. Her site is here:\n\n[Tanya](http://web.archive.org/web/20081008041751/http:/www.renaissancetravelnantucket.com/)\n\nShe is a very nice lady. Please tell her I sent you. :-)\n\nSharon\n\n"
    },
    {
      "time": " 23.Mar.2008 12.36pm",
      "content": "BTW here are some links\n\n[http://typophile.com/node/43109](http://web.archive.org/web/20081008041751/http:/typophile.com/node/43109 \"http://typophile.com/node/43109\") ( Call for papers )\n\n[http://atypi.org/05\\_Petersburg](http://web.archive.org/web/20081008041751/http:/atypi.org/05_Petersburg \"http://atypi.org/05\\_Petersburg\")\n\nThanks Dan! Thanks Sharon!\n\n"
    },
    {
      "time": " 30.Jun.2008 3.29pm",
      "content": "Welcome to St.Petersburg!\n\nSince program is published now and registration is open, I am here to answer any questions related to ATypI 2008 conference. From visa requirements to metro navigation: feel free to ask.\n\n"
    },
    {
      "time": " 30.Jun.2008 7.50pm",
      "content": "Do you think it is any better to get a Visa by starting with the Hotel or by using a Visa Service? Or does it not matter?\n\nIf anybody has picked a hotel to stay in and is willing to tell me privately what hotel that is I would be glad for the info.\n\n"
    },
    {
      "time": " 30.Jun.2008 11.44pm",
      "content": "Technically you cannot get tourist visa (which is strongly recommended) until you have your hotel booking. So any “visa service” includes hotel booking.\n\nFor hotels there are 2 options: small hotels (also called “mini hotels”) and regular hotels. Small hotels may be unusual: sometimes they occupy only a part of the building. So you may share building entrance with either regular (and usually quite old) condo. It somtimes is interesting and lets you better feel how it is here. But there will be no lobby bar :). Most mini hotels are in walking distance from conference venue in the area which is filled with restaurants and caffees.\n\nThere are few regular hotels. “Moscow” is the one where we have booked many rooms ( [http://www.hotel-moscow.ru/english/home.htm](http://web.archive.org/web/20081008041751/http:/www.hotel-moscow.ru/english/home.htm \"http://www.hotel-moscow.ru/english/home.htm\")). It is OK, was recently renovated and is only a one metro (subway, tube) stop away (metro station is practically IN the hotel lobby). List of prebooked hotels is here: [http://onlinereg.ru/site.php?go=106&page=1464&lang=ENG](http://web.archive.org/web/20081008041751/http:/onlinereg.ru/site.php?go=106&page=1464&lang=ENG \"http://onlinereg.ru/site.php?go=106&page=1464&lang=ENG\")\n\nOn that list only “U Fontana” and “Rossiya” are located outside the center and will require several stop metro ride to reach the conference venue. While OK on weekend, it may be crowded on a weekday morning while taxi ride may take a lot of time due to traffic in the rush hour.\n\nVisa:  \nTruth is that getting visa is usually much easier than you might expect. There are 3 recommended ways:\n\n1. Do hotel booking and visa processing trough Monomax: [http://onlinereg.ru/atypi](http://web.archive.org/web/20081008041751/http:/onlinereg.ru/atypi \"http://onlinereg.ru/atypi\"). They are prepared to help you and their service was checked by Barbara who visited SPb few months ago.  \n2. Do hotel booking using one of online services and contact hotel to send you visa voucher. It will be less expensive than using Monomax (there is no extra payment), but you will be on your own while dealing with your local Russian Consulate ( [http://www.russianembassy.net/](http://web.archive.org/web/20081008041751/http:/www.russianembassy.net/ \"http://www.russianembassy.net/\")).  \n3. Contact any local tourist company who will guide you trough process.\n\nTwo important things to know:  \n1. Your passport must be valid at least 6 months after you plan to leave Russia.  \n2. You are getting tourist, not business visa. It is much easier and cheaper. There is no problem with that: SPb is the tourist destination, one of the top in Europe.\n\nSo the process is (explained here: [http://atypi.org/05\\_Petersburg/visas](http://web.archive.org/web/20081008041751/http:/atypi.org/05_Petersburg/visas \"http://atypi.org/05\\_Petersburg/visas\"))  \n1. Check that your passport is valid.  \n2. Make hotel booking. Get voucher and confirmation from the hotel. Make sure that hotel you are dealing with is “compatible” with visa requrements (you need it only if you are not using Monomax as service company). Which means that they can send you a voucher (they are registered somewhere) and they can handle registration of your passport while you are here. Almost all hotels, especially located in the city center have these services.  \n3. Prepare application (form is downloadable and Monomax will provide you with instructions how to fill it). Have your photo. Check any other requirements with your local consulate. Mail them all that or visit their office.  \n4. Get your visa and verify it.\n\nAccording to rules, in many consulates there is time/cost system. You may pay more, but have your visa ready fast. So it is up to you how much you want to pay. It does not work with all consulates, make sure you checked it. But in Russian consulates in US for $$$ you can have your visa ready same day.\n\nBegin early. Contact me in case of any problems. Use my email address which is yar at fontlab.com.\n\n"
    },
    {
      "time": " 1.Jul.2008 12.57am",
      "content": "Thanks very much for all this excellent advice Yuri!\n\n"
    },
    {
      "time": " 1.Jul.2008 5.07am",
      "content": "Dear Typophiles,\n\nThe preliminary [**ATypI 08 St Petersburg conference program**](http://web.archive.org/web/20081008041751/http:/www.atypi.org/05_Petersburg/20_main_program) is available, giving you overview over the five days packed with events. The [**registration**](http://web.archive.org/web/20081008041751/http:/www.atypi.org/05_Petersburg/70_register) for the conference is also open.\n\nThe preliminary list of speakers (subject to change) includes Tim Ahrens, Yomar Augusto, Ken Barber, John D. Berry, Roger Black, Frank E. Blokland, Robert Bringhurst, Nadine Chahine, Anna Chaykovskaya, Si Daniels, Susanne Dechant, Timothy Donaldson, John Downer, Olga Florenskaya, Irina Fomenko, J. Victor Gaultney, Yuri Gherchuk, Maxim Gurbatov, Bengisu Keleşoğlu, Jerry Kelly, Dmitry Kirsanov, Akira Kobayashi, Alexandra Korolkova, Tal Leming, Gerry Leonidas, Håkon Wium Lie, Paul Luna, Klimis Mastoridis, George D. Matthiopoulos, James Montalbano, Heidrun Osterer, Thomas Phinney, Tagir Safayev, Nick Shinn, Anna Shmeleva, Eben Sorkin, Erik Spiekermann, Konstantin Startsev, İpek Torun, Typophile, Gerard Unger, Vladimir Yefimov and Pascal Zoghbi.\n\nThose using **Apple iCal** on Mac OS X or iPhone can subscribe to the conference calendar. Once you have done it, it will be automatically updated as changes become available! To subscribe, click on the [**Subscribe in iCal link**](webcal://www.atypi.org/05_Petersburg/20_main_program/atypi08.ics), when iCal opens click on Subscribe, and in the Subscribing to atypi08.ics dialog, activate Refresh and set it to every week.\n\nThose using **Microsoft Outlook** can download and import the calendar. Right-click on the [**download calendar link**](http://web.archive.org/web/20081008041751/http:/www.atypi.org/05_Petersburg/20_main_program/atypi08.ics), choose Save target as and save it to some location. Then, start Outlook, choose File / Import and Export, click Import an iCalendar or vCalendar file, click Next, in the Files of type list, choose iCalendar Format, navigate to the location where you saved the calendar, and click OK. Note that after you import the calendar, it will not automatically update so you may need to import it again in a few weeks to see any changes.\n\nAs Yuri already wrote here, please start your travel preparations as early as possible since visitors to Russia must obtain a visa at their home country consulate.\n\nWe will post more information to the [**ATypI 08 St Petersburg conference site**](http://web.archive.org/web/20081008041751/http:/www.atypi.org/05_Petersburg), so check back soon!\n\nIf you have further questions, send an e-mail to the ATypI Secretariat at _secretariat [at] atypi [dot] org_.\n\nRegards,  \nAdam Twardoch  \n_secretary to the programme committee,  \nATypI 08 St Petersburg conference_\n\n"
    },
    {
      "time": " 2.Jul.2008 9.49pm",
      "content": "What about the issue of getting a fax vs a “original tourist voucher” eg a physical copy.\n\nHow would that play out in the US, Canada, various other places?\n\nRight now I am stuck in some sense because i don’t know which I need.\n\nWhat do you suggest?\n\nAlso, do you know if the prices for hotels quoted by Monomax include taxes? If not, how do you calculate those?\n\nThanks!\n\n"
    },
    {
      "time": " 4.Jul.2008 8.24am",
      "content": "I think it depends on your consulate. I believe that rules will be the same in all Schengen countries (most of EU with few exceptions). I know that in US fax copy works fine. When I asked Monomax about this, they said that fax copy is generally OK. Bascically you will need to have “original” voucher only if it is specifically required by the consulate in your country.\n\nAs I know, quoted hotel prices include taxes and are final. It must be said that you may find a better deal over the internet, but in this case you will have to contact hotel directly for voucher and instructions.\n\n"
    },
    {
      "time": " 4.Jul.2008 8.48am",
      "content": "I am all in now. I am just waiting for the fax.\n\n"
    },
    {
      "time": " 7.Jul.2008 12.04pm",
      "content": "It will be great if you can tell everyone how it goes and what kind of problems (if any) you had on the way.\n\n"
    },
    {
      "time": " 7.Jul.2008 6.11pm",
      "content": "So far I think I know what I need to do but I have not had my fax back from Monomax. I will write them tonight & Barbara to see if there is a problem. I have avery hectic schedule for the next 2 months so I hope I don’t get caught in snag! I am working hard not to.\n\nMy advice to other people (although they may not need it) is when you are on the monomax site don’t expect buttons to look like buttons. The buttons are just narrow rectangles with text. I thought they were headings for text for a long time...\n\nYuri, do you know or are you in contact with Tatiana Ryshkevich?\n\n"
    },
    {
      "time": " 8.Jul.2008 4.41am",
      "content": "Dear Typophile,\n\nwe have a new “Getting to St Petersburg” section at the ATypI 08 St Petersburg conference site, written by Yuri:  \n [http://www.atypi.org/05\\_Petersburg/travel](http://web.archive.org/web/20081008041751/http:/www.atypi.org/05_Petersburg/travel \"http://www.atypi.org/05\\_Petersburg/travel\")\n\nWe have also updated the visa section with some more clarifications:  \n [http://www.atypi.org/05\\_Petersburg/visas](http://web.archive.org/web/20081008041751/http:/www.atypi.org/05_Petersburg/visas \"http://www.atypi.org/05\\_Petersburg/visas\")\n\nWe also have done some updates to the venue section, with links to interactive maps of the venue and the city:  \n [http://www.atypi.org/05\\_Petersburg/10\\_venue](http://web.archive.org/web/20081008041751/http:/www.atypi.org/05_Petersburg/10_venue \"http://www.atypi.org/05\\_Petersburg/10\\_venue\")\n\nIf you have further questions, send an e-mail to the  \nATypI Secretariat at: secretariat [at] atypi [dot] org\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": " 8.Jul.2008 5.03am",
      "content": "I have gotten my fax now. I called and was helped by a Monomax employee. Tatiana is away until the 15th.\n\n"
    },
    {
      "time": " 8.Jul.2008 7.12am",
      "content": "I called guys in Monomax a hour ago and they told me that hey served a huge event here, some 2000 delegates. While it is weak excuse, they will work faster this week.\n\nTheir registration site is not a best example of the web design, but I don’t think I am in a position to improve it :)\n\n"
    },
    {
      "time": " 8.Jul.2008 4.08pm",
      "content": "I am not interested in being a critic of the design per se either. But I was stuck at one point and could think of what to do for maybe a an hour or more. It’s utterly possible that the fault was mine... but the point is I just didn’t want anybody else to have that problem.\n\nAdam, thanks for all the additional info!\n\n"
    },
    {
      "time": " 12.Jul.2008 3.58am",
      "content": "Never mind I figured it out...\n\n"
    }
  ]
}
