{
  "id": "43521",
  "title": "Upmarket burger restaurant",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hello Typophiles,\n\nI've recently been commissioned to design a rich and exotic poster promoting the addition of a 'burger bar' to a trendy lounge in my hometown. I'm concentrating on typography and copy considering not much can be said about the humble burger through imagery.\n\nAs such I'd like your expert opinion on my kerning, letting and overall choice of Didot, Gotham and Archer as my inventory for the piece.\n\nAny comments would be most valuably received,\n\nRegards,\n\nPaul\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 2.png](http://web.archive.org/web/20130310025739/http:/typophile.com/files/Picture%202_61.png) | 46.95 KB |\n\n",
  "author": "paul.w",
  "time": "24 Mar 2008 — 8:59am",
  "uid": "21493",
  "comments": [
    {
      "time": "24 Mar 2008 — 9:23am",
      "content": "I'd use would first suggest choosing between Archer and Didot.  \nI'd also not full-justify the bottom paragraph as it is throwing the balance off because of the spacing.  \nThe balance at the top seems off too. The lightness of the Gotham isn't working with the heavy (because of the tightness) line of the Didot.  \nDon't we say \"at Ruby's\" and not \"in Ruby's\"?\n\n"
    },
    {
      "time": "24 Mar 2008 — 9:32am",
      "content": "Overall I like it, quite elegant.\n\nJust 4 things to say, in my opinion, the \"money can't buy happiness\" is too tight and unbalanced despite I understand that you want it to come out.\n\nSecond thing is... why are you using 3 typefaces? I would use only 2, ther's no need to have 2 typefaces that are too close or haven't got enough diferences.\n\nThird, on the text below, i see that you have a tight letter space but a normal word space... try to balance those 2 values or else you'll get some odd holes on the text block. Usually i use oh the justification these levels: 85-100-125 for word spacing and -5-0-5 for letter spacing, and then teak as necessary.\n\nLast one... isn't the logo too big?\n\nGood work :)\n\nEdit: Tiffany posted first :D\n\n-\n\n[www.nunocoelho.com](http://web.archive.org/web/20130310025739/http:/www.nunocoelho.com/ \"www.nunocoelho.com\")\n\n"
    },
    {
      "time": "24 Mar 2008 — 10:07am",
      "content": "I once heard, at a design conference, that one of the easiest ways to impart elegance is to track out leading and word spacing. You want to feel as if the type has room to breath, to tight and it looks uptight.\n\nI also agree with Tiffany and Nuno, the balance is off (not to mention your logo isn't centered) and simplify your font choices.\n\n"
    },
    {
      "time": "24 Mar 2008 — 10:24am",
      "content": "Thank you as always for your valued commentary, I've adjusted the piece for some wording considerations (At rather than In Ruby's being one of them), and reduced the amount of typefaces to simply Gotham and Didot.\n\nI'm also liking the idea of NOT including photography, and letting evocative text do the image conception for me. Anyway, I dont think a picture of a burger will ever do the typographical genius of these two typefaces justice :)\n\nLatest version can be found [here](http://web.archive.org/web/20130310025739/http:/img237.imageshack.us/img237/6894/picture3cm5.png)\n\nThanks!\n\n"
    },
    {
      "time": "24 Mar 2008 — 10:33am",
      "content": "Design aside, the 'even the cows would be proud' line kind of turns me off for some reason.\n\nI would agree with the rest...make a version with 2 or even just 1 typeface.\n\nThe new version is better, though perhaps still a bit busy.\n\nAnother challenges is using a brown color pallet. That's always hard unless you are UPS.\n\n"
    },
    {
      "time": "24 Mar 2008 — 10:42am",
      "content": "<cite>Latest version can be found here</cite>\n\nPaul would you mind uploading the images here. Some people do not have access to outside image hosting sites (myself included). Plus, adding your images here will maintain the archival quality of the post for anyone that might stumble across it in the future.\n\n"
    }
  ]
}
