{
  "id": "4354",
  "title": "The DECLINE of PROPER PUNCTUATION",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://edition.cnn.com/2004/SHOWBIZ/books/04/19/punctuation.pedant.ap/](http://web.archive.org/web/20070708122510/http:/edition.cnn.com/2004/SHOWBIZ/books/04/19/punctuation.pedant.ap/)\n\n [‹ Top 10 typefaces](http://web.archive.org/web/20070708122510/http:/typophile.com/node/4249 \"Go to previous forum topic\") [Ren ›](http://web.archive.org/web/20070708122510/http:/typophile.com/node/4463 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070708122510/http://typophile.com/user/1014\" title=\"View user profile.\">bjharvey</a>",
  "time": "<br>",
  "uid": "1014",
  "comments": [
    {
      "time": " 19.Apr.2004 3.31pm",
      "content": "Hey, if you want your language to become the lingua franca of the entire world, purity is the first thing you gotta give up. All your base are belong to us.   \n   \nhhp\n\n"
    },
    {
      "time": " 19.Apr.2004 8.48pm",
      "content": "And while we're at it, isn't it terrible the way proper typography has also declined? -- bring back the long s!\n\n"
    },
    {
      "time": " 20.Apr.2004 12.51am",
      "content": "Can someone please explain \"All your base are belong to us\" to me. I've seen this so many times now, and I still have no idea where it comes from and what its meant to be about? Hrant?\n\n"
    },
    {
      "time": " 20.Apr.2004 1.27am",
      "content": "David,   \ncheck this out.   \n [http://www.planettribes.com/allyourbase/index.shtml](http://web.archive.org/web/20070708122510/http:/www.planettribes.com/allyourbase/index.shtml)   \n   \n\"History of 'All Your Base'   \n   \n1. Toaplan creates the Zero Wing video game.   \n2. Toaplan releases a port for the Sega Genesis console with the addition of an intro scene, which is then translated into english (very poorly) and released in the United States.   \n3. Toaplan goes out of business.   \n4. Someone from a Zany Video Game Quotes website notices the poor translation, and highlights the game.   \n5. Overclocked.org does a humorous voiceover of the Zero Wing intro in a fake Wayne Newton voice.   \n6. Dozens of game-related messageboards begin to post quotes from the parody, and images altered to show the phrase.   \n7. Most of the threads lose interest and die off quickly as the trend is pronounced dead countless times.   \n8. The Flash movie/video is released with images from the threads and music taken from the origional game someone had added the phrase \"all your base\" to.   \n9. AYB explosively expands to the general (non game messageboard-reading) public.   \n10. The origional site for the video is shut down within hours due to excessive traffic, and moves to PlanetStarsiege.   \n11. Lycos ponders how \"All your Base\" was transformed from obscurity to a top 50 search practically overnight.   \n12. Mainstream media begin to notice the trend, and stories appear in Time Magazine, USA Today, Fox News, The Los Angeles Times, Tech TV, Wired, and many others.   \n13. As the 'remix' used in the video goes from 58 hits a day to several thousand per day, mp3.com notices the track has been ripped directly from the video game and pulls the music off their site due to copyright violations. It is later returned unchanged.   \n14. The trend continues to grow as it expands into nearly every corner of the web.   \n15. Large websites like Angelfire and Hewlett Packard sneak \"all your base\" references into their designs.   \n16. \"All Your Base\" is pronounced dead several times every day, yet it's 15 minutes of fame continue for some reason...\n\n"
    },
    {
      "time": " 20.Apr.2004 1.35am",
      "content": "Fredrik, I'm a parent ![:-)](http://web.archive.org/web/20070708122510im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 20.Apr.2004 3.31am",
      "content": "Yiikees, poor thing!\n\n"
    },
    {
      "time": " 20.Apr.2004 3.33am",
      "content": "Oh. So its just about laughing at non-native English speakers then. Hmmm. Monolingualism for a conquering monoculture.   \n   \nYuk. Sorry I asked now! ![:-)](http://web.archive.org/web/20070708122510im_/http:/www.typophile.com/forums/clipart/happy.gif) ![:-)](http://web.archive.org/web/20070708122510im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 20.Apr.2004 4.51am",
      "content": "\\>\\>Oh. So its just about laughing at non-native English speakers then   \n   \nWell maybe its about laughing at an industry whose production values are such that no-one bothered to ask a native english speaker if the translation made sense.   \nOr maybe its celebrating the fact that people can get away with that stuff now - there are people who phone the BBC to complain if someone splits an infinitive on Radio 4. Maybe AYBABTU is a rebellion against the language police.\n\n"
    },
    {
      "time": " 20.Apr.2004 5.40am",
      "content": "Bite the wax tadpole.\n\n"
    },
    {
      "time": " 20.Apr.2004 7.08am",
      "content": "\\> _Bite the wax tadpole._   \n   \n [All your brand are belong to us](http://web.archive.org/web/20070708122510/http:/www.allyourbrand.org/), too.\n\n"
    },
    {
      "time": " 20.Apr.2004 9.34am",
      "content": "\\>So its just about laughing at non-native English speakers then.   \n   \nNative English language-manglers are not exempt from mockery (US presidents are a popular target).\n\n"
    },
    {
      "time": " 20.Apr.2004 10.18am",
      "content": "Wow, Peter.   \n   \n\\> So its just about laughing at non-native English speakers then.   \n   \nWell, it can be different things to different people. To me it's about the fact that imperialism is anti-cultural.   \n   \nhhp\n\n"
    },
    {
      "time": " 20.Apr.2004 1.40pm",
      "content": "You have no chance to survive. Make your time.\n\n"
    },
    {
      "time": " 21.Apr.2004 8.44pm",
      "content": "\"Hey, if you want your language to become the lingua franca of the entire world, purity is the first thing you gotta give up. All your base are belong to us. \"   \n   \nBut you see, I think the majority of the damage is coming from native speakers more than nonnative ones.   \n   \nJust surf around places were \"common\" people go; eBay for instance. The spelling and grammar of the people who use eBay, on average, is just this side of a moron with an IQ of 10.   \n   \nI'm always chastising my brother for his atrocious correspondance to eBay members. Even if they don't look intelligent, he should.   \n   \nAnd then of course you have the AOL/SMS/Scriptkiddie generation. WaT r U lOkInG aT?!?!?! DiS iZ nOrMlE sPeEk 4 uS!!!!111!11! We DoNt NeD SkOolL!!!!!! L8R!   \n   \n   \n:shudder:   \n   \nDon't get me started on \"1337\".\n\n"
    },
    {
      "time": " 22.Apr.2004 1.53am",
      "content": "\\> Just surf around places were \"common\" people go   \n   \nWell, let he who is without sin cast the first stone (only joking Chris ![:-)](http://web.archive.org/web/20070708122510im_/http:/www.typophile.com/forums/clipart/happy.gif) ).   \n   \nI don't think it's necessarily about purism, or linguistic imperialism (I'm sure Polish speakers get equally wound up about greengrocers' ogoneks or whatever). To me it's about supposedly qualified people who are quite well paid to do one thing (copyeditors) not doing it properly and thereby ultimately making language less beautiful and useful.   \n   \nI'm most certainly not a lingua-purist -- I'm quite content with neologisms and I'm quite content to let archaisms like 'an history' and the don't-end-a-sentence-with-a-preposition rule slide. But it annoys the hell out of me to be reading a quality newspaper and find redundant parentheses (commas all over the place where they're not, needed) and the like. It confuses meaning and annoys a close reader.   \n   \nIt is actually the job of the copyeditor to uphold certain values in language and punctuation. He/she should know not just the correct usage of colons and semicolons, but should be able to, e.g: distinguish em and en dashes; correct 'three period' ellipses; remove redundant punctuation; etc.   \n   \nI think when these skills decline -- as they are declining -- we lose a certain amount of precision from our language, and are thus less able to be precise in our communication. That's important, and worth getting wound up about. Wack apostrophes in the local supermarket, not so much.   \n   \nR   \n   \n(Please mark this post with red pen, give it a mark out of ten and send it back to me with your comments ![:-)](http://web.archive.org/web/20070708122510im_/http:/www.typophile.com/forums/clipart/happy.gif) )\n\n"
    },
    {
      "time": " 22.Apr.2004 4.29am",
      "content": "\\>\\>when these skills decline -- as they are declining   \n   \nAre they declining?   \nIn England there was a neglect of teaching English properly at primary schools throughout the 1980s & much of the 1990s, but under the new National Curriculum, standards seem to be improving, and going beyond the levels that were prevalent before the decline. My kids learn grammar in a much more formal way than I ever did.   \nI think we (in the 1970s) were expected to pick up the rules through osmosis, via exposure to correct English, rather than by actually being told what they were.   \n   \nI _am_ concerned about cultural imperialism (even within England, the language police have been, and continue to be, busy suppressing regional and class variations in speech and writing).   \nOn the other hand, I think that where precision is important, it is necessary to be able to write exactly what you mean, and to expect others to be able to correctly read what you have written. The primary purpose is communication, and if the rich tapestry of cultural variation gets in the way, then maybe that's not a good thing.\n\n"
    },
    {
      "time": " 22.Apr.2004 8.08am",
      "content": "Maybe we should rethink using words such as \"damage\" and \"proper\"--there has been no such thing since the inception of human language. It's all dynamic--always has been, always will be.\n\n"
    },
    {
      "time": " 22.Apr.2004 8.29am",
      "content": "I've just returned from a vacation in England, where, because this book was in featured in the news on the occasion of its US release, and my host had a copy, I read about half of it. I found nothing to justify claims that of \"laughing at non-native English speakers\" or linguistic imperialism. Surely the _British_ National Union of Teachers, the _British_ Broadcasting Corporation, and the _British_ government - examples from the CNN article - ought to be able to write English to native English speakers with native English fluency.   \n   \nTypophile readers might be amused that the author writes that she wishes she'd been around to have Aldus Manutius' babies....   \n   \nFinally, can anyone identify the typeface used in the text? Its bowls are shaped like those of Melior/Zapf Book but it has various distinctly calligraphic features.\n\n"
    },
    {
      "time": " 22.Apr.2004 8.33am",
      "content": "\\> I found nothing to justify claims that of \"laughing at non-native   \n\\> English speakers\" or linguistic imperialism.   \n   \n1) I'm pretty sure David was referring not to the book but my mention of \"All your base ....\".   \n2) The corruption of language is not linguistic imperialism, I was saying it's a _result_ of such.   \n   \nhhp\n\n"
    },
    {
      "time": " 22.Apr.2004 8.38am",
      "content": "\\>\\>Maybe we should rethink using words such as \"damage\" and \"proper\"   \n   \nYeah, agreed. That's sloppy on my part. Variation and innovation in language is of course inevitable. But variation/innovation can be beautiful and intelligent -- when it makes its own kind of sense and/or grows out of a love and deep understanding of communication and language -- or it can be just dumb, lazy mistakes that get to seem OK because they're repeated often enough by 'authoritative' sources. E.g. I really enjoy reading David Foster Wallace's stuff. He has an amazing ear for language. You find yourself eventually thinking the way he writes, which is very far from 'proper' usage a lot of the time (beginning sentences with 'And but' etc.). And regional vernaculars often have their own grammatical tics which make total sense within their contexts.   \n   \nBut there is usage, I think, which is just plain wrong and ugly -- generally usage which is trying to be transparent and authoritative but which falls over owing to lack of knowledge or skill on someone's part (either the writer, who can be excused, or the copyeditor, who can't).   \n   \nR\n\n"
    },
    {
      "time": " 22.Apr.2004 8.53am",
      "content": "This is the Post-modern era, and the authority of printed text is not what it was.   \n   \nSo the \"sloppier\" grammar of speech (and the \"semi-speech\" of email) finds its way back to the printed medium, dumbing it down, but also making it closer to the mainstream of reality.   \n   \nTwo landmarks: the Watergate Tapes, and the Roger Clemmons and the Boston Press Incident, really showed up the difference between corrected, edited, proper grammar, as it is supposed to be done in print, and the vagaries of language as it is spoke.   \n   \nIt was quite revealing to see, from transcriptions of the Watergate tapes, just how un-proper real speech is. (Of course, the plays of Beckett and Pinter made the point a lot earlier.)   \n   \nClemmons was always complaining how he was mis-quoted by the sports press in Boston, so they decided to report his utterances verbatim, without the benefit of normal \"speech-to-text\" copy-editing, thereby making him come across as a complete neanderthal.   \n   \nThe point is not that normal people are \"morons\", but that printed text has for a long time been mis-representing normal speech, and this is a correction.\n\n"
    },
    {
      "time": " 22.Apr.2004 9.29am",
      "content": "I'm totally with you, Robert. In fact, when I talk about this issue, I always mention DFW. He knows HOW to do it \"properly,\" he just chooses another form. He's not some hack from off the street--I'm sure you're familiar with the old saying \"You have to know the rules before you can break them.\" I might add that the ignorant don't break the rules, they're just ignorant. So, I think you're right.\n\n"
    },
    {
      "time": " 22.Apr.2004 1.25pm",
      "content": "All your design are belong to us...   \n   \nI just received this e-mail:   \n   \nOriginal Logo creates a Unigue lmage for Your Company   \n   \nAre you startling a new business ,iaunchinq a new website ,product or service or want to chanqe your corporate imaqe? Then you need an outstandinq loqo that wilI a compIete visual identity, Iike help you increase sales and revenues.   \n   \nTo create a powerfuI Iogo you need an expert team of graphic designers and artists that will put aIl its knowledge, experience, and talent into your project. Visit our website to make sure that we can provide you with such a original and professional corporate identity at at an affordable price and to your deadlines. We love designing, we are especially good at it, and we are absolutely devoted to your goals.   \n   \n [http://www.highendlogos.biz/](http://web.archive.org/web/20070708122510/http:/www.highendlogos.biz/)\n\n"
    },
    {
      "time": " 22.Apr.2004 7.49pm",
      "content": "You know what gets me? Spamglish. You know, the language spammers use to get past filters, except it's evolved way beyond that now, where plain old harebrained spelling seems to be the goal itself. Like look at this:   \n   \n\"   \nHave you ever wanted to own a h ome? Well here's your chance to get the ho me of your choice.   \nIf you already own a hom e, we've got the be.st de.als possible...   \n\"   \n   \nNobody with an IQ above 9 could think for example that the word \"home\" would cause a filter to kick in, and even if it did, misspelling it three different ways isn't gonna help. Then there's those periods.   \n   \nHere's another one:   \n\"   \nR u not satis.fying your mate...   \nR u unhappy with your size...   \nIf so, we've got the answer   \n\"   \n   \nWho comes up with this crap? Maybe they just think it's cute.   \nWhat's scary is that maybe many people DO find it cute...   \n   \nhhp\n\n"
    },
    {
      "time": " 23.Apr.2004 7.14am",
      "content": "Yeah, that is irritating. No excuse for it; it's funny though, because for the longest time I was completely oblivious to why it was done that way. I thought the structuring of \"h ome\" was just some wild-fast typing mistake. Dumb of me for not realizing what it was right away.   \n   \nSpeaking of all this, I've been getting some really wild messages in the body of some spams. I mean, the ad will come up and then afterwards one of those paragraphs--how do they come up with some of this stuff, some of it actually has a primitive plot. Makes me want to collect it and paste it all together as a bonafide piece of writing... Hmmm\n\n"
    },
    {
      "time": " 23.Apr.2004 9.52am",
      "content": "Andrei Codrescu did a thing on NPR about \"Spam Poetry\"   \n   \n [http://www.npr.org/features/feature.php?wfId=1761226](http://web.archive.org/web/20070708122510/http:/www.npr.org/features/feature.php?wfId=1761226)\n\n"
    },
    {
      "time": " 27.Apr.2004 2.33pm",
      "content": "Finnegans Wake anybody? Apostrophe or no? Joyce prefers the latter, the Irish musicians the former. It wasn't just the punning that made the text a typesetter's nightmare...   \n   \nAnd speaking of DFW and his cute & precious ilk (a heartbreaking cluster of staggering proportions), their style is like the common cold\n\n"
    },
    {
      "time": " 27.Apr.2004 9.23pm",
      "content": "Nick written language is not to represent spoken languaje, it has it\n\n"
    },
    {
      "time": " 28.Apr.2004 1.31am",
      "content": "\\>\\> Finnegans Wake anybody? Apostrophe or no?   \n   \nIf I'm reading you right, you're hitting the point bang on: Joyce made an _educated choice_ about how to punctuate (as did e.g. J P Donleavy, probably under a heavy Joyce influence; or Burroughs with cut-up grammar, or Burgess with A Clockwork Orange, etc.). Knowing the rules and playing with them for your own and the reader's pleasure isn't the same as repeating received mistakes.   \n   \n\\>\\> And speaking of DFW and his cute & precious ilk   \n   \nYeah, it's got that way recently. I'm no fan of the whole McSweeney's thing, and DFW is certainly susceptible to cuteness (and to the kudos of a coterie). I think he's capable of really great writing though, and a few people I know who are writers themselves agree with me. As you say, though, his style is infectious and there are lesser versions of it springing up everywhere.   \n   \n\\>\\>I'd rather be infected by Shakespeare or Samuel Beckett any day   \n   \nSurely any remotely widely-read person already is?   \n   \nR\n\n"
    },
    {
      "time": " 28.Apr.2004 4.16am",
      "content": "last weekend i participated in a typeworkshop, held by underware in vienna, austria.   \nthe topic was \"type and talk\" and a couple of groups developed various starting points for research on that issue.   \nmy group tried to create additional punctuations, expressing emotions, or rather different ways of talking.   \n [http://www.typeworkshop.com/index.php?id1=Vienna\\_04\\_2004&id2=daily&id3=day3&id4=&id5=&idpic=34#pictloader](http://web.archive.org/web/20070708122510/http:/www.typeworkshop.com/index.php?id1=Vienna_04_2004&id2=daily&id3=day3&id4=&id5=&idpic=34#pictloader)\n\n"
    },
    {
      "time": " 28.Apr.2004 6.22am",
      "content": "Oh yeah, I think all the comments about DFW thus far have been completely on. I would never try to emulate the man--mostly, though, because he's already done it and anything similar to his style which is not written by DFW is just unoriginal copying. Reminds me of the legion of young poets today who think they're breaking new ground by writing the way Charles Bukowski did... and, frankly, he was just a drunken hack who got lucky.\n\n"
    }
  ]
}
