{
  "id": "43544",
  "title": "Just a suggestion for the Type ID board...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was thinking, after noticing the 500th post titled \"WHAT IS THIS?!\" with a link to imageshack, that there must be a better way to do type ids.\n\nOf all the forums, I think the Type ID board gets the most workout during the day. I've seen an influx of fresh faces all asking the same question... \"This is awesome, what is it? By the way I need to know immediately.\"\n\nI'm not trying to dispel the bad habits of people that didn't know other wise. I just think the forum could use a little more organization. Could save a few members some headaches.\n\nPerhaps the \"open\" approach towards the Type ID forum should be corralled. A form with instructions could be a more benefiting approach.\n\n1. Title - please be specific, refrain from using \"What is this font\" or any variations. (think of poor Yves)  \n2. Image upload link - please don't post links to outside websites or image hosting, that may be blocked on some member's computers.  \n3. comments/information - What do you know about this font, where did you find it, is there specific thing you'd really like to know.  \n4. tags\n\nThis is just a suggestion of course. I think it would help clear up some confusion, help speed up type IDs and help people search for IDs already made.\n\nI know that Typophile is a labor of love for some of the Punchcut crew and other Typophile members. I don't expect these changes to be made. Though it would be cool to see my suggestions implemented.\n\n",
  "author": "AndrewSipe",
  "time": "25 Mar 2008 — 9:34am",
  "uid": "6496",
  "comments": [
    {
      "time": "25 Mar 2008 — 9:42am",
      "content": "Andrew, many of your suggestions are addressed quite clearly in the FAQ (especially about giving your threads more specific titles) and in \"How to post a sample or image\". It seems lots of people can't be bothered to read the FAQ, even tho it says READ THIS FIRST. There was also a recent epidemic of people re-posting threads when they weren't ID'd quickly enough - one guy hadn't even attached a visual! I mean, we are not psychic - and I got reamed (by Furioustype for one, LOL) for chastising them.\n\n"
    },
    {
      "time": "25 Mar 2008 — 9:45am",
      "content": "It's funny, I believe the \"PLEASE READ THIS FIRST\" FAQ actually seems to cover these points, but it seems that some people can't be bothered to read it first. Perhaps the only way to make some notice at all would to put the text with the above-mentioned suggestions in some separate box at the top of the forum, rather than an actual forum post itself. I'm no web developer, but I think it would take a lot less time to read the PLEASE READ HIS FIRST than it would for someone else to code that new window in.\n\n"
    },
    {
      "time": "25 Mar 2008 — 9:46am",
      "content": "Er-What Patty Said.\n\n"
    },
    {
      "time": "25 Mar 2008 — 9:48am",
      "content": "Exactly Patty, that's why I made the suggestion, nobody reads the FAQs. The main thing is that it's a form. With a form, you can control the content better and reduce the chances that someone will post something without an image, or a clear understandable title. You can even block \"What is this Font\" from being used, or any other popular phrase. The form acts as a posting moderator. Plus poor Yves wouldn't have to waste time changing the titles to reflect that the original poster should posted.\n\nAnyway, it's just a suggestion.\n\n"
    },
    {
      "time": "25 Mar 2008 — 9:51am",
      "content": "Why do I feel so tired... :^/\n\nThere should be an upgrade of the Type Identification Board taking cues from my and many other suggestions, such as some kind of standardized form to be filled out when starting a new thread and an automated way to track if the sample has been identified, but... well... :^(\n\n"
    },
    {
      "time": "25 Mar 2008 — 9:57am",
      "content": "<cite>automated way to track if the sample has been identified</cite>\n\nThat would be cool. Even though the personalized touch you give is nice, and I like seeing the \\* next to my name when I get one right!\n\nYou should take a nap, you earned it.\n\n"
    },
    {
      "time": "25 Mar 2008 — 2:47pm",
      "content": "I used to find it more interesting and challenging to ID typefaces... somehow you felt it educated visitors. Lately it seems like some sort of amusing trick we are able to perform, like circus seals.\n\nI can't imagine anyone actually using some of the faces they want ID for ;^P\n\n ![](http://web.archive.org/web/20131013231706im_/http:/typophile.com/files/seal_balancing_ball_lg_clr_3667.gif)\n\n"
    },
    {
      "time": "25 Mar 2008 — 3:00pm",
      "content": "I hate it when someone posts like six images (in one to six sequential posts) or one huge image with 12 different faces in it and then says, \"Get to work! I needed to know these yesterday.\" I like the challenge, but not when it feels like work. That's when I feel like our services are being taken advantage of.\n\n<cite>I can’t imagine anyone actually using some of the faces they want ID for ;^P</cite>\n\nDitto!\n\n"
    },
    {
      "time": "25 Mar 2008 — 3:30pm",
      "content": "require a $1 donation via PayPal for each new TypeID thread. ;o)\n\n"
    },
    {
      "time": "25 Mar 2008 — 6:56pm",
      "content": "Why is the Type ID Board fun for me?\n\n1.  \nI learn a lot.\n\n2.  \nThe sport.\n\n3.  \nI don’t care if they use the faces they want ID for as long as they thank me for the ID. They do that most of the time.\n\n4.  \nThe credit. I like to see my name in brackets. Yves seems to busy lately, so that’s maybe spoiling the fun a bit.\n\nIf IDing feels like work, don’t do it! Sure this service is being taken advantage of. That’s what it’s all about. If something like WHATSISFONT...INEEDIDASAP!!!!! comes up maybe a standart-reply like _Please read guidelines first_ would work. BTW - the Type ID Board doesn’t have guidelines like General Discussions, just FAQs. FAQs aren’t read unless there _is_ a question.\n\n"
    },
    {
      "time": "26 Mar 2008 — 8:09am",
      "content": "If you put a form in the type ID board, then people will just use the Design and General forum for type IDs (not that they don't anyway, but it would explode).\n\nAs for the requesters who are rude and demanding, the solution is simple. Tell them the font is Comic Sans, no matter what it is (or better yet, one of those pricey fonts only sold in packages that cost $1200.)\n\n"
    },
    {
      "time": "26 Mar 2008 — 9:15am",
      "content": "I wonder if all the type ID pop quizzes at the top of the forum distract people from the FAQ. I notice that the other two forums I frequent (Gen'l Discussions and Design) only have the one PLEASE READ at the top.\n\nAre the pop quizzes really popular? I never look at them.\n\n"
    },
    {
      "time": "26 Mar 2008 — 9:41am",
      "content": "\"Why is the Type ID Board fun for me?....\"\n\nJan, I totally agree with you. Particularly the learning part. While nowhere in the same league as you, trying to ID fonts has led me to so many previously unknown fonts and a lot of peripheral information.\n\n\"I wonder if all the type ID pop quizzes at the top of the forum distract people...\"\n\nTo overcome that, would it be an idea to have the posting guidelines come up as a mandatory step before a member is allowed to post on a forum for the first time? Or is that to much back-end work?\n\n-  \nArun  \n-\n\n"
    },
    {
      "time": "26 Mar 2008 — 9:48pm",
      "content": "Just wondered. The type ID board has two files noted as READ THIS FIRST!!!. Which one do I read first ? Shouldnt one read READ THIS SECOND!!! ;0)\n\n\\*Please note, all comments made under the postings by Typotheticals should not be taken to indicate any form of seriousness.\n\n"
    },
    {
      "time": "27 Mar 2008 — 9:20am",
      "content": "Some tool just titled a thread in the ID board \"You know the drill\". He's a student so I guess he should be cut some slack. But it doesn't inspire me to help him.\n\n"
    },
    {
      "time": "27 Mar 2008 — 9:34am",
      "content": "I think, and this is my opinion as a user and not a moderator, that while the titles are key to helping us when we are searching they aren't a big deal in the beginning because you still have to go into the thread to see what has been posted anyway. Right?\n\n@Patty: I think he was just trying to be funny. Somewhere in between his title and the first comment is where a good balance is to be found. The first comment was a little rude, IMHO.\n\n"
    },
    {
      "time": "27 Mar 2008 — 9:35am",
      "content": "I gave him a stern finger wag, Patty.\n\n"
    },
    {
      "time": "27 Mar 2008 — 10:17am",
      "content": "Tiffany, the titles are helpful more than just at the beginning. As the threads start to pile up, if you want to go back and see if something got ID'd it's much easier to find the thread you're looking for when they have descriptive titles.\n\n"
    },
    {
      "time": "27 Mar 2008 — 10:41am",
      "content": "@Andrew: I shouldn't have used the word \"rude\". That is too strong. My bad.\n\n@Patty: Good point. I just think that instead of ignoring the thread or going in and making a snarky comment, it is more helpful—albeit a right pain in the arse—to leave a friendly reminder that well-titled threads are more helpful.\n\n"
    },
    {
      "time": "27 Mar 2008 — 11:07am",
      "content": "Tiffany, it wasn't too strong at all. Considering that I started THIS thread, I might have been overly sensitive to the playfulness of this title. Hell, I'm hypocritical about this kind of stuff anyway. I'd probably have done the same thing, and as a noob, I probably did.\n\nIt does illustrate that unlike other forums we have a level of decorum here. It just needs to be presented better so the fresh faces aren't unwittingly stepping on toes.\n\nEither way you're right, a kind and friendly reminder will suffice.\n\n"
    },
    {
      "time": "27 Mar 2008 — 1:27pm",
      "content": "And the aforementioned thread was retitled and resolved with a nice sense of humor, thanks to all.\n\n"
    }
  ]
}
