{
  "id": "43558",
  "title": "TypeCon2008 Update - 3/24/08 - First Speakers, Pricing, and Hotel Announced",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20080327193251/http:/typophile.com/user/7006 \"View user profile.\") : 25.Mar.2008 6.45pm \n\nTypeCon2008 Update - 3/24/08 - First Speakers, Pricing, and Hotel Announced\n\nTypeCon2008: Punkt  \nJuly 15-20, 2008  \nHyatt Regency Downtown  \nBuffalo, New York\n\npresented by The Society of Typographic Aficionados (SOTA)\n\nin partnership with the Western New York Book Arts Collaborative, the Buffalo Academy of Science Charter School, the Roycroft Campus Corporation/Roycroft Inn, the University at Buffalo, and the Albright-Knox Art Gallery\n\n————————————————————————————————-  \n- TypeCon2008 Registration Fees Announced  \n- Book Your Hotel Room at the Hyatt Regency in Buffalo  \n- Join SOTA or Renew Your Membership for 2008  \n————————————————————————————————-\n\nGet ready for TypeCon2008! This year’s conference is going to be an incredible event you won’t want to miss. TypeCon2008 features more than 70 legends and innovators. Early confirmed participants include Chuck Bigelow, Matthew Carter, John Downer, Akira Kobayashi, David Pankow, Elizabeth Resnick, Stefan Sagmeister, Erik Spiekermann, Ilene Strizver, Jakob Trollbäck, Doyald Young, and NLXL. TypeCon2008 explores type for the screen, printing history, Dutch design, type in motion, the American Arts and Crafts movement, and much more. Special events include the third annual Type and Design Education Forum, an exhibition of international type and design, and a closing night gathering at the home of the Roycrofters. Read on for more info about TypeCon2008 and how you can be part of it!\n\n————————————————————————————————-  \nTYPECON2008 REGISTRATION FEES ANNOUNCED  \n————————————————————————————————  \nTypeCon2008: Punkt  \nJuly 15-20, 2008  \nHyatt Regency Downtown  \nBuffalo, New York\n\nType comes alive this summer as Buffalo plays host to TypeCon2008: Punkt. From the irreverent to the serious, the eclectic to the traditional, and the modern to the historical, SOTA’s tenth conference is a letterfest created for type lovers at every level.\n\nTypeCon2008 will offer a variety of great presentations and panel discussions, focused hands-on workshops, tours, special events, an international exhibition of new type and design, and more.\n\nConference registration fees are as follows:\n\nEarly registration (through April 28)  \nSOTA members: $235 professionals/$125 students  \nNon-members: $275 professionals/$150 students\n\nRegular registration (April 29 through June 16)  \nSOTA members: $275 professionals/$145 students  \nNon-members: $320 pro/$165 students\n\nLate/walk-up registration (after June 16)  \nSOTA members: $320 professionals/$165 students  \nNon-members: $375 pro/$185 students\n\nOptional pre-conference workshops  \nWednesday-Thursday, July 16-17 - 9:00 am-5:30 pm  \n$50 per half-day session | $100 per full-day session (plus materials/lab fees, if any)\n\nSecure registration and detailed conference info will be available on the TypeCon2008 website next month. The latest TypeCon2008 news is announced in this newsletter and on the TypeCon website. Visit [http://www.typecon.com](http://web.archive.org/web/20080327193251/http:/www.typecon.com/ \"http://www.typecon.com\") and check out the TypeCon blog and other info.\n\nTypeCon2008 website - [http://www.typecon.com](http://web.archive.org/web/20080327193251/http:/www.typecon.com/ \"http://www.typecon.com\")\n\n————————————————————————————————-  \nNOW BOOKING - TYPECON2008 HOTEL AND HEADQUARTERS - HYATT REGENCY DOWNTOWN BUFFALO  \n————————————————————————————————-  \nThe TypeCon2008 conference hotel and headquarters is the Hyatt Regency in downtown Buffalo. The center of activity for TypeCon2008, the Hyatt is in a terrific central location near to the main workshop venue, dining, and nightlife.\n\nThe Buffalo Hyatt Regency is currently undergoing a massive renovation, and just installed the wonderful Grand Beds we enjoyed so much in Boston. We’ll be in comfy updated digs during TypeCon2008. The Hyatt has plenty of space for us, an inviting restaurant and lounge in the atrium, an award-winning steakhouse on the premises, fitness center, and many other amenities.\n\nThe Hyatt Regency is offering TypeCon2008 attendees an incredible rate on rooms - just $124 (plus tax) per night for single/double rooms. This is a great deal in Buffalo during the height of summer, and the hotel will be completely sold out during TypeCon2008. Book your room ASAP - the special TypeCon2008 attendee rate is available until June 18, 2008, or until our room block fills, whichever comes first. We always fill our room block fast, and demand is higher than ever this year. Book now to avoid disappointment.\n\nTo book online with your credit card, please visit this link:\n\n[http://buffalo.hyatt.com/](http://web.archive.org/web/20080327193251/http:/buffalo.hyatt.com/ \"http://buffalo.hyatt.com/\")\n\nEnter your travel dates in the “Find Rooms and Rates” section, and enter G-SOTA in the field calling for Group/Corporate #.\n\nTo book by phone, call the Hyatt Reservations Department at 1-800-233-1234 and mention TypeCon and Group Code G-SOTA.\n\nHyatt Regency Buffalo information site - [http://buffalo.hyatt.com/](http://web.archive.org/web/20080327193251/http:/buffalo.hyatt.com/ \"http://buffalo.hyatt.com/\")\n\n————————————————————————————————-  \nBECOME AN OFFICIAL AFICIONADO - JOIN SOTA TODAY!  \n————————————————————————————————-\n\nPlease join us in our efforts to support the typographic arts and artists, and increase our educational programs. By joining SOTA, you will become part of an open community dedicated to achieving these goals and more. Your ideas and your vision are crucial to the advancement and strengthening of this community!\n\nSOTA members also receive discounted TypeCon admission - even more reason to join now.\n\nSOTA is a volunteer-driven non-profit organization, and we rely on the support and involvement of our members to accomplish our mission. There is so much that we can do together - join SOTA today!\n\nMembership benefits - [http://www.typesociety.org/membenefits.html](http://web.archive.org/web/20080327193251/http:/www.typesociety.org/membenefits.html \"http://www.typesociety.org/membenefits.html\")\n\nMembership levels - [http://www.typesociety.org/memlevels.html](http://web.archive.org/web/20080327193251/http:/www.typesociety.org/memlevels.html \"http://www.typesociety.org/memlevels.html\")\n\nDirect link to membership registration - [http://www.sotalink.com/membership/membership.php](http://web.archive.org/web/20080327193251/http:/www.sotalink.com/membership/membership.php \"http://www.sotalink.com/membership/membership.php\")\n\n————————————————————————————————-  \nABOUT TYPECON AND SOTA  \n————————————————————————————————-  \nTypeCon is the annual conference of SOTA, an international non-profit organization dedicated to the promotion, study, and support of type design, typography, and the related arts. For more information about SOTA, please visit the website at [http://www.typesociety.org](http://web.archive.org/web/20080327193251/http:/www.typesociety.org/ \"http://www.typesociety.org\").\n\nHave questions, need answers? Send us an email! [mailto:info@typesociety.org](mailto:info@typesociety.org \"mailto:info@typesociety.org\").\n\nSee you in Buffalo!\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080327193251/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 25.Mar.2008 6.45pm",
  "uid": "7006",
  "comments": [

  ]
}
