{
  "id": "43569",
  "title": "Open Contours warning in Fontlab",
  "forum": "difficulttype246's blog",
  "tags": [

  ],
  "content": "Hi all. I am new to FL. I have designed a font in illustrator and am importing it as an illustrator EPS file. This is for a uni project on a tight deadline.\n\nI have looked at similar blogs on here but still unsure what to do.\n\nthe warning message:  \n''Some glyphs in the font that is being exported contain open contours which cannot be exported as open into the font file''\n\nI have clicked the 'Contour' tab and selected 'correct connections', 'join broken contours' and 'close open contours' but this seems to have no effect.\n\nIs there any way to get round this or will I have to redraw in fontlab?\n\nthanks\n\n",
  "author": "difficulttype246",
  "time": "26 Mar 2008 — 6:31am",
  "uid": "28777",
  "comments": [
    {
      "time": "26 Mar 2008 — 7:04am",
      "content": "When you generate a font from a file which has open contours FontLab mark those glyphs with RED color. Try and check those warned glyphs again.\n\nWhen you get this warning box, make sure that you have \"Highlight glyphs..\" checked.\n\n ![](http://web.archive.org/web/20120424142902im_/http:/typophile.com/files/a_3757.jpg)\n\n"
    },
    {
      "time": "26 Mar 2008 — 7:05am",
      "content": "Before you export your file from AI, use the \"clean-up Path\" feature and this will fix a few things like stray points.\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2008 — 7:17am",
      "content": "In the Illustrator, even if you have some open countours it fills the shapes automatically. You should check your drawings in wireframe mode to make sure you have all your shapes closed. On a PC, Ctrl+Y is the shortcut for the Outline preview.\n\n"
    },
    {
      "time": "26 Mar 2008 — 7:17am",
      "content": "thanks for the comments, please keep them coming.\n\nI have tried the 'clean up path' feature and it says 'clean up note: no clean up was necessary'.\n\n"
    },
    {
      "time": "26 Mar 2008 — 7:36am",
      "content": " ![](http://web.archive.org/web/20120424142902im_/http:/typophile.com/files/Bletter_3668.jpg)\n\n"
    },
    {
      "time": "26 Mar 2008 — 7:38am",
      "content": "this is the 'B' so far, made up of individual blocks. I tested grouping them all together but this has the same result\n\n"
    },
    {
      "time": "26 Mar 2008 — 8:15am",
      "content": "How big your Illustrator drawings are? Enlarge your letters say 250mm height and try copy pasting the outlines directly into the FontLab. If that doesnt work, try welding all your blocks with the pathfinder and export it again.\n\n"
    },
    {
      "time": "26 Mar 2008 — 8:30am",
      "content": "It might be the little dots you can see in each of the rectangles. Illustrator (by default) places individual points at the center of shapes created using the rectangle tool and these can be carried over to FontLab when you import the art. You can eliminate them in Illustrator by selecting everything, opening the Attributes palette and clicking on the \"Don't Show Center\" button (middle left part of the palette). If you already got everything in FontLab, you'll have to manually delete them all.\n\n"
    },
    {
      "time": "26 Mar 2008 — 8:34am",
      "content": "make sure you dont have such dot on your entire art board.\n\n ![](http://web.archive.org/web/20120424142902im_/http:/typophile.com/files/aa_3789.jpg)\n\n"
    },
    {
      "time": "26 Mar 2008 — 8:36am",
      "content": "The illustrator vectors are 150mm approx. i have enlarged one to 250mm. the warning box appears again. Do the blocks need to be outlines or rasterized in any way?\n\n"
    },
    {
      "time": "26 Mar 2008 — 8:53am",
      "content": "Thanks for the tips. It doesn't seem to like it when I remove the center dots either.\n\n"
    },
    {
      "time": "26 Mar 2008 — 8:59am",
      "content": "Blocks should contain vector outlines only.  \nCan you upload the Illustrator file here? Only the one which has letter B.\n\n"
    },
    {
      "time": "26 Mar 2008 — 9:42am",
      "content": "i think its just jpg, gif or png. not sure how to upload the AI file\n\n"
    },
    {
      "time": "26 Mar 2008 — 11:59am",
      "content": "can you mail this to me at [snrajpurohit@gmail.com](mailto:snrajpurohit@gmail.com)?\n\n"
    },
    {
      "time": "26 Mar 2008 — 12:42pm",
      "content": "sure will mail it shortly\n\n"
    },
    {
      "time": "26 Mar 2008 — 1:22pm",
      "content": "Hi Ross,\n\nI saw the Eps file you sent me, it has those crop marks if you have noticed. When I import this Eps file into FontLab, those marks comes with it as well. You have to delete those crop marks in the FontLab. or else release the crop area in the Illustrator file itself. I have marked them in the red.\n\nHere is your Illustrator file\n\n ![](http://web.archive.org/web/20120424142902im_/http:/typophile.com/files/R1_6648.jpg)\n  \nAnd this is how it looks when you import it into the FontLab.  \n\n ![](http://web.archive.org/web/20120424142902im_/http:/typophile.com/files/R2_3477.jpg)\n\nI hope this will help.\n\n"
    },
    {
      "time": "26 Mar 2008 — 1:57pm",
      "content": "Thanks for the tips. The 'open contour warning' hasn't appeared so that must be a good sign. I have removed the crop marks in fontlab. I am not sure how to remove them in Illustrator though.\n\nTo test that the 'B' letter works do I select 'File', 'Generate font' or 'Generate All' to see if it will work as an output Truetype file to write with?\n\n"
    },
    {
      "time": "26 Mar 2008 — 2:27pm",
      "content": "Generate font and save as TrueType/OpenType TT.\n\n-  \nTo remove the crop marks in the Illustrator,  \nGo to Object/Crop Area/Release and delete the bounding box.\n\n"
    },
    {
      "time": "26 Mar 2008 — 4:08pm",
      "content": "The letter 'A' is the only one which seems to work when I click 'Generate Font'. 'A' is the only one which appears every time on output in truetype format.\n\nLetter 'B' appears but only in the preview when I click 'Generate All'.\n\nI don't even have those funky red arrows on my outlines.\n\n"
    },
    {
      "time": "27 Mar 2008 — 1:54am",
      "content": "Check out these basic [FontLab tutorials.](http://web.archive.org/web/20120424142902/http:/fontlab.com/FontLab-Studio/FontLab-Studio/FontLab-Studio-Tutorials/)\n\nAnd if you want to continue with designing typefaces, its worth buying a copy of this book called [Learn FontLab Fast by Leslie Cabarga.](http://web.archive.org/web/20120424142902/http:/www.amazon.com/Learn-FontLab-Fast-Leslie-Cabarga/dp/0965762858)\n\n"
    },
    {
      "time": "29 Mar 2008 — 2:33pm",
      "content": "Another pair of basic tips, for moving AI files into Fontlab:  \nFlatten/expand appearance of any object not drawn with the pen tool, and  \nSave the exported file in the earliest version of Illustrator/EPS file available in the Illustrator version you are using -- e.g. Legacy formats.\n\n"
    }
  ]
}
