{
  "id": "43560",
  "title": "Buy Cadena for cheap and awesome.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A friend of mine, Miguel (from [www.latinotype.com/](http://web.archive.org/web/20131011010730/http:/www.latinotype.com/ \"www.latinotype.com/\")) is selling his new fat face, Cadena for $5 for a limited time to raise some money to facilitate making more weights. It's a really nice face.\n\nCheck it out!  \n [http://www.flickr.com/photos/miguel\\_hernandez/](http://web.archive.org/web/20131011010730/http:/www.flickr.com/photos/miguel_hernandez/ \"http://www.flickr.com/photos/miguel\\_hernandez/\")\n\n ![](http://web.archive.org/web/20131011010730im_/http:/typophile.com/files/2353225834_f2c66903a1_4577.jpg)\n\n",
  "author": "HaleyFiege",
  "time": "25 Mar 2008 — 8:01pm",
  "uid": "17709",
  "comments": [
    {
      "time": "26 Mar 2008 — 6:17am",
      "content": "Well, it is certainly priced right.\n\nDoes he have a pdf available where one can look at the letters in enlarged sizes. A few (x, f) look a bit funky at this size, and I would want to see them larger.\n\n"
    },
    {
      "time": "26 Mar 2008 — 6:26am",
      "content": "I've just recently mentioned this on my Typophile 'blog' ( [typophile.com/node/43500](http://web.archive.org/web/20131011010730/http:/typophile.com/node/43500)). Very nice.\n\nDav\n\n"
    },
    {
      "time": "26 Mar 2008 — 6:52am",
      "content": "An EULA in English would be handy for the dullards (like myself) that can't read the one posted on the site. If anyone has a link to that.\n\n"
    },
    {
      "time": "26 Mar 2008 — 6:52am",
      "content": "geez...$5!? Can't go wrong there!\n\n"
    },
    {
      "time": "26 Mar 2008 — 7:20am",
      "content": "Don: yes, you can download a PDF from the [Latinotype website](http://web.archive.org/web/20131011010730/http:/www.latinotype.com/espanol/fonts/CadenaBlack/).\n\n"
    },
    {
      "time": "26 Mar 2008 — 8:14am",
      "content": "Thanks Florian.\n\nI should have looked there, I suppose. But my response did serve its secondary purpose of bumping message back up to the top of the board.\n\n"
    },
    {
      "time": "26 Mar 2008 — 9:47am",
      "content": "Re the EULA, basically states that for the fountains and/or sources of Latinotype (sorry, I hate it when Spanish-speakers call fonts \"fuentes\" which actually means either fountain or source :) )\n\n1. You may install it on one printer or other print/reproduction device as well as one computer.  \n2. For use on more than one machine or other device where the font is copied into a storage device you must by subsequent licenses.  \n3. You may not make any copies except for one backup copy, and you may not transfer or sell the license to anyone else.  \n4. No returns unless it's defective, and only then with receipt and within 1 week of purchase.  \n5. Any works using Latinotype fonts must be used under the respective licenses, therefore vector products must travel with a license. Embedding is not allowed, if necessary the user must request an embedding license.  \n6. Users must give credit to LatinoType™ as a registered trademark and the holder of copyright for the font.  \n7. Any violation terminates the license and you must return the font as well as a letter in writing that no other copy exists.  \n8. LatinoType takes no responsibility for damages resulting from the use of the software.  \nThe contract is under international and Chilean intellectual property laws and by either installing or downloading the fonts you agree that you have read understand and agree to the clauses in the contract.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "26 Mar 2008 — 10:04am",
      "content": "<cite>(sorry, I hate it when Spanish-speakers call fonts “fuentes” which actually means either fountain or source :) )</cite>\n\n<cite>Font</cite> means exactly the same thing, so you'll probably want to use a different term, such as <cite>typeface</cite>.\n\n"
    },
    {
      "time": "26 Mar 2008 — 10:08am",
      "content": "Thank you!\n\n"
    },
    {
      "time": "26 Mar 2008 — 11:40am",
      "content": "\"Embedding is not allowed\"\n\nbah!\n\n"
    },
    {
      "time": "26 Mar 2008 — 11:48am",
      "content": "<cite>6. Users must give credit to LatinoType™ as a registered trademark and the holder of copyright for the font.</cite>\n\n^that could be a sticky one in some instances too, like on a postcard. But I love that miniscule <cite>a.</cite>\n\n"
    },
    {
      "time": "26 Mar 2008 — 1:25pm",
      "content": "tipografía quizá?\n\n"
    },
    {
      "time": "26 Mar 2008 — 1:43pm",
      "content": "perhaps\n\nperhaps\n\nperhaps\n\n"
    },
    {
      "time": "26 Mar 2008 — 2:56pm",
      "content": "Damn!... I have Mote and Cadena from Latinotype and never noticed how heavy EULA item 6. was!!.... I have contacted asking to explore the EULA point 6... hopefully will see it as a bit heavy... if not I will have to delete both Mote and Cadena off my Mac... which sucks as I like both of the typefaces.\n\nWOW that is like buying a t-shirt (t-shirt without external branding) and have to wear it inside out so the label is present at all times...\n\nstill great typefaces and a nice guy too\n\n"
    },
    {
      "time": "26 Mar 2008 — 4:05pm",
      "content": "Not allowing embedding in a EULA in this competitive climate can be a sticking point for many users. When people ask me to read their EULAs that is one of the first things I look for. Not allowing (at least) PDF embedding is a mistake.\n\n"
    },
    {
      "time": "26 Mar 2008 — 4:08pm",
      "content": "This said I licensed it in hopes of (A) Miguel rethinking the embedding issue, and (B) $5 isn't much to support someone you believe in.\n\n"
    },
    {
      "time": "26 Mar 2008 — 4:38pm",
      "content": "It is a wonderful price, and it is worth supporting Miguel for his wonderful work regardless of the EULA.\n\n<cite>Glyph</cite> rather than <cite>Gliph</cite>. <cite>More than</cite> rather than <cite>Over</cite>. <cite>Only $5</cite> rather than <cite>Only at</cite> $5.\n\n<cite>Includes the OpenType® font and a single cpu license for Cadena Black™. Proceeds from this limited-time offer will support the development of the complete Cadena family—Roman, Italic, Small Caps, Black, Black Italic, and a printed sample book with CD. Share your love! PayPal: info@latinotype.com</cite>\n\nI’m boycotting PayPal, but I promise to watch the development and strongly consider the family when available. Feel free to use the above $5 worth of editing/writing as my donation to your effort. No credit required ; )\n\nThis would look great used in an identity for a bakery. I think I’m hungry.\n\n"
    },
    {
      "time": "27 Mar 2008 — 12:53am",
      "content": "I paid $25 for Cadena 2-3 months ago, and $50 for MOTE. still concerned by bullet no.6 of his EULA\n\n"
    },
    {
      "time": "27 Mar 2008 — 3:25am",
      "content": "great work Miguel.\n\n\\> Users must give credit to Latinotype™ as a registered trademark and the holder of copyright for the font\n\nEULA point No. 6 can be read in two ways:\n\n1. (the strict interpretation): In every use, let's say on a business card, you must credit Latinotype™ (printing the foundry name on the card) and indicate Latinotype™ as the copyright holder. Obviously this as impractical as it is illogical. I'd be genuinely surprised if this is the correct interpretation of the EULA. Nobody is going to put a foundry name on a poster, packaging, or title sequences. :|\n\n2. (the logical interpretation) When Latinotype is mentioned in print, in a colophon, in some liner notes, please indicate the ™ and © whenever appropriate.\n\nLatinotype™ does not appear to have been registered with the US Patent and Trademark Office, but maybe it has been registered with the Chilean PTO maybe?\n\nIn the U.S., ™ can be used at any time, even without federal registration, to put others on notice that you are claiming rights in the mark.  \n® is used when a Trademark has been officially registered after going through the required steps with the USPTO.\n\n"
    },
    {
      "time": "27 Mar 2008 — 5:11am",
      "content": "Not allowing embedding will make some people to actually do it... A way out can be converting to 1-bit tif (which will help selling blank CDs to carry the huge files...).\n\nFuerza Latinotype!\n\nSalud!\n\n"
    },
    {
      "time": "27 Mar 2008 — 5:48am",
      "content": "And I was going to order a copy today. Thanks for the alert on the EULA. I cannot spend even $5 on a font that will not allow embedding, and article 6 is ridiculous.\n\nIf BJ's interpretation is right, the clause should be rewritten to be clear about that. Guessing is not a wise thing to do in legal matters.\n\nSorry Miguel, at least one sale lost due to an over protective EULA.\n\n"
    },
    {
      "time": "27 Mar 2008 — 7:07am",
      "content": "bj...that sums up the confusion well. I agree that #2 is LIKELY the interpretation, but one never knows...\n\nAs for embedding...it's really just an issue of practicality for a designer. I want to be able to start a project and choose the typeface suitable for the project based on the LOOK of the typeface rather than the intricacies of the EULA.\n\nBut, damn...that's a fun typeface. I'll probably be getting it anyways ;o)\n\n"
    },
    {
      "time": "27 Mar 2008 — 7:13am",
      "content": "It's very similar to Bello's small caps. [http://vllg.com/Underware/Bello/mudTyper+Weights/](http://web.archive.org/web/20131011010730/http:/vllg.com/Underware/Bello/mudTyper+Weights/ \"http://vllg.com/Underware/Bello/mudTyper+Weights/\") which is close to Sauna Black... [http://vllg.com/Underware/Sauna/mudTyper+Weights/](http://web.archive.org/web/20131011010730/http:/vllg.com/Underware/Sauna/mudTyper+Weights/ \"http://vllg.com/Underware/Sauna/mudTyper+Weights/\")\n\n"
    },
    {
      "time": "27 Mar 2008 — 7:25am",
      "content": "A good case for a clear EULA in more than one language to avoid ambiguity. #6 is very confusing and if interpreted literally, it is a great way to self-promote but logistically difficult to have accommodated. Those who ignore EULAs will ignore this one as well.\n\nI like the PR spin here:_Proceeds from this limited-time offer will support the development of the complete Cadena family_. It may be fair to say that proceeds from any sales of fonts support the development of future fonts.\n\n"
    },
    {
      "time": "27 Mar 2008 — 7:52am",
      "content": "I think guifa’s shortening of point 6 in the EULA made it more ambiguous than the original:\n\n<cite>6.- El usuario de este software de fuentes Latinotype™ se comprometa a dar créditos a Latinotype™ como marca registrada y dueños del copyright de Latinotype™ como único distribuidor de las fuentes y sus nombres, sin importar los créditos de sus referentes, diseñadores y/o creadores que se muestren en el sitio.</cite>\n\nI read this as, “The user of this Latinotype™ font software is obliged to give credit to Latinotype™, as a registered trademark and owners of the copyright Latinotype™, as the sole distributor of the fonts and their names, regardless of credits to references, designers, and/or creators as given on the site”.\n\nMeaning that, regardless of who the web site has as the designer or creator of a font, users are required to credit Latinotype™ as the distributor and copyright holder of the font, rather than the individual designer; _not_ that you are obliged to always credit the foundry, every time you use the font.\n\n[I’m not sure what exactly they mean by _sus referentes_, though—guifa?]\n\nWould the more learned Spanish-speakers agree with such an interpretation?\n\n"
    },
    {
      "time": "27 Mar 2008 — 9:41am",
      "content": "I'd have to look, but there are other EULAs out there which share point 6 in common. I read it as \"When Possible\" please do it. Or, if you are crediting the photography, please also credit the type. I don't think it means put the credit on a business card.\n\n"
    },
    {
      "time": "27 Mar 2008 — 11:33am",
      "content": "Yeah, it wasn't meant to be a full translation, just a quick point-by-point you can do this or can't do that. Although I think the intent of #6 is to say when crediting, please credit it like exactly as shown with the TM symbol as opposed to crediting the individual designer (like Janus indicated), it's not the most clear thing. (Aside for Janus: «sus referentes» in this case means more or less references, or perhaps \"points/places of reference\". I would take this to mean the web-design credits, for instance)\n\nKegler makes a good point about having EULAs in multiple languages, but in this case it really needs to be rewritten for both English and Spanish users' sakes.\n\nThe problem is that the \"y\" (and) is not really well defined as to what it's joining, it could be creating a second object of the verb «give credits» or it could be adding a second object under the preposition «como» (as) or it could be a second obligation creating a sentence fragment. Unfortunately all three areas sound odd given that the second «como» (_as_ the only distributor) doesn't really seem to be well attached. Janus assumed an additional «y» (and) with his comma placement but it's not there or something else to indicate it's position in the hierarchy. And in any case, it sounds weird to need to identify Latinotype the only distributor of the _names_ of the fonts... It seems to me like a lot of words and phrases got mixed up.\n\nFor anyone who is interested, [I broke down #6](http://web.archive.org/web/20131011010730/http:/www.elahorcado.net/random/eula.html/index.html) with side-by-side English translations.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "28 Mar 2008 — 3:14pm",
      "content": "I like Canada Types EULA... [http://www.canadatype.com/cteula.php](http://web.archive.org/web/20131011010730/http:/www.canadatype.com/cteula.php \"http://www.canadatype.com/cteula.php\")\n\nAgain I support Miguel Latino Type as I have paid full price for 2 of his typefaces, $50 for MOTE\n\nI really love MOTE, which is no longer on his site, though I guess it will be the uppercase version of Cadena Heavy?  \n [http://www.flickr.com/photos/miguel\\_hernandez/585447484/](http://web.archive.org/web/20131011010730/http:/www.flickr.com/photos/miguel_hernandez/585447484/ \"http://www.flickr.com/photos/miguel\\_hernandez/585447484/\")  \n [http://www.typophile.com/node/33759](http://web.archive.org/web/20131011010730/http:/www.typophile.com/node/33759 \"http://www.typophile.com/node/33759\")\n\nLooking at all this I have to say I don't really think the 'point 6' really applies if you look at where his fonts are being used and that he is celebrating where they have been used. So sorry Miguel.\n\n"
    },
    {
      "time": "29 Mar 2008 — 11:32am",
      "content": "Hello Typophiles,\n\nI am agree in almost all the critiques for number 6 (embedding issue).  \nThe Latinotype EULA will be fixed very soon,\n\nThank you for all this help,\n\nMiguel Hernández\n\nLatinotype. The latin alphabet, on latino hands.  \n [http://www.flickr.com/photos/miguel\\_hernandez](http://web.archive.org/web/20131011010730/http:/www.flickr.com/photos/miguel_hernandez \"http://www.flickr.com/photos/miguel\\_hernandez\")\n\n"
    },
    {
      "time": "29 Mar 2008 — 12:38pm",
      "content": "_The latin alphabet, on latino hands._\n\ntattoos? \\>^D\n\nlove the typeface, btw. g'luck with the family expansion!\n\n"
    },
    {
      "time": "8 Aug 2008 — 9:10pm",
      "content": "interesante debate sobre EULA. ah Miguel, dime si no.\n\nY $5 dolares es muuuy poco.\n\n• jko •\n\n"
    },
    {
      "time": "8 Aug 2008 — 11:41pm",
      "content": "Thanks for the tip, Haley. When I first discovered Typophile, Miguel was here very often, and amazed everyone with creations like [Garadot](http://web.archive.org/web/20131011010730/http:/www.typophile.com/node/6215). Go, Miguel! Nice to see you around here again. :-)\n\n_sorry, I hate it when Spanish-speakers call fonts “fuentes” which actually means either fountain or source_\n\nguifa, I studied graphic design in Argentina and typefaces were called \"tipografías\" or \"fuentes tipográficas\" by our professors... And this was in the 80s, mind you, before everyone had a personal computer over there! Here's a Spanish Wikipedia page that talks about the use of both terms:\n\n[Tipo de letra](http://web.archive.org/web/20131011010730/http:/es.wikipedia.org/wiki/Fuente_tipogr%C3%A1fica)\n\nYou're correct as far as the Real Academia Española not listing the terms [fuente](http://web.archive.org/web/20131011010730/http:/buscon.rae.es/draeI/SrvltConsulta?TIPO_BUS=3&LEMA=fuente) or [tipografía](http://web.archive.org/web/20131011010730/http:/buscon.rae.es/draeI/SrvltConsulta?TIPO_BUS=3&LEMA=tipograf%EDa) as equivalents of the English \"typeface\"... which I have to admit really bugs me! But language is a living thing, and changes faster than dictionary editors can keep up, I'm afraid. :-)\n\n_Latinotype. The latin alphabet, on latino hands._\n\nMiguel, some friendly advice from a bilingual admirer: Your slogan would sound much better to an English speaker if it was \"The latin alphabet, **in** latino hands.\"\n\nCheers,  \nRicardo\n\n"
    },
    {
      "time": "12 Aug 2008 — 10:53pm",
      "content": "Ricardo, está muy bien la aclaración sobre los términos:\n\nEn Chile hablamos así:\n\nFuente is Typeface.\n\nTipografía could be Typeface and/or Letterpress (impresión tipográfica)\n\nDiagramación o composición es Typography\n\nTipógrafo (typographer) as typedesigner (diseñador de tipos)\n\nis a really confusing for the students (and for some designers also)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\njko | [www.sindicatodelaimagen.org/cft/blog](http://web.archive.org/web/20131011010730/http:/www.sindicatodelaimagen.org/cft/blog \"www.sindicatodelaimagen.org/cft/blog\") | [www.latinotype.com](http://web.archive.org/web/20131011010730/http:/www.latinotype.com/ \"www.latinotype.com\")\n\n"
    },
    {
      "time": "12 Aug 2008 — 10:56pm",
      "content": "Interesante, jko. Gracias por la aclaración. :-)\n\nTranslation: Interesting, jko. Thanks for the info. :-)\n\n"
    }
  ]
}
