{
  "id": "4358",
  "title": "Transcribing Music through Abstract Typographic Notation",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm working on a project right now that is in a very conceptual stage, and very abstract, so I'm trying to get some input to steer this in an appropriate direction.   \n   \nI'm working to build what I'm calling \"beatmaps\" right now. It is to be a linear transcription of music (mainly experimental electronic or electro acoustics) presenting harmony, dissonance, meter, and syncopation with only punctuation and letter forms. It isn't to be readable...the letters are only to represent sound through their visual presence. Color choices will also be a large issue in defining the melodic atmosphere.   \n   \nThink about it like looking at sheet music, but instead of seeing black and white dot and flag characters, you find colorful typographic fragments arranged so you SEE the music as plainly as you would hear it.   \n   \nVague, I know. Abstract, I know. I'm only typing this little bit of info so we can think about the wide possibilities here. If your musically attuned I'd really appreciate any things you can give me to consider, any visual ideas, or good references.   \n   \n-JT\n\n",
  "author": "link190",
  "time": "19 Apr 2004 — 6:41pm",
  "uid": "2523",
  "comments": [
    {
      "time": "19 Apr 2004 — 7:26pm",
      "content": "Robert Bringhurst has an abiding interest in what he calls typographic polyphony, i.e. the representation of multiple, simultaneous or contrapuntal voices in type. It is difficult to do convincingly, as Robert is the first to admit, largely because reading is an isolating process. Polyphonic texts are appreciated only as wholes: as soon as one starts to read the polyphony stops, as when one tries to pick out a particular instrument or voice in polyphonic music. That said, poly-typographic compositions can be visually very dramatic and exciting. One of my favourite such images, which Robert shows in some of his illustrated lectures, is of a heavily graffiti'd highway underpass in LA, in which multiple layers of tagging interact.   \n   \nAll this is a lengthy pre-amble to my suggestion that, in your attempt to represent music typographically, you may have an easier and more direct route to the kind of visual polyphony that interests Robert than the more common attempt to represent text musically.\n\n"
    },
    {
      "time": "20 Apr 2004 — 9:04am",
      "content": "Thanks John,   \n   \nI certainly haven't looked into Bringhurst's writing enough, and I didn't realize he treated music. It makes sense, with his poetic experience. I'm not finding much online about his though...just links to his books, and one interview that didn't get too interesting. Any info online you know of?   \n   \nIt might be a trip to the library for me.\n\n"
    },
    {
      "time": "20 Apr 2004 — 10:33am",
      "content": "I'm not aware of any written work by Robert that really deals with the 'typographic polyphony' topic, although there are some examples of his attempts to produce such work, e.g. his poem for several voices _The blue roofs of Japan_ and the more recent [_Ursa Major: A Polyphonic Masque for Speakers & Dancers._](http://web.archive.org/web/20131018074559/http:/www.chapters.indigo.ca/item.asp?N=35&R=1559107&act=A03&Item=978189403166&Section=books&Catalog=Books&Lang=en&mscssid=XV4TWKKWJNRQ9K58LTL93AW2R1XF2W0C&WSID=130497E96690691842A2A72FDFB184E370153120) I've not seen anything online.\n\n"
    }
  ]
}
