{
  "id": "43582",
  "title": "Need light font to replace Baskerville Reg.",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Design",
    "Type ID Board [OLD]"
  ],
  "content": "I'm looking for a serifed font to replace Baskerville that is lighter. Can anyone recommend a very similar typeface that has a light weight? If you can name more than one it would be helpful. I'm using the Lino Gold type library at the moment.\n\nThanks,  \nMartha Hoyle\n\n",
  "author": "Martha H.",
  "time": "26 Mar 2008 — 1:27pm",
  "uid": "27034",
  "comments": [
    {
      "time": "26 Mar 2008 — 2:32pm",
      "content": "Should I have posted under the Design Forum?\n\nFairfield light worked as a solution.\n\n"
    },
    {
      "time": "27 Mar 2008 — 1:34am",
      "content": "Yes indeed, these kind of requests should be posted in the Design section. :^)\n\n"
    },
    {
      "time": "27 Mar 2008 — 11:32am",
      "content": "Can anyone recommend a better solution than Fairfield light?\n\nI used Baskerville as body in a dark tan when I established a design that has been applied to a dozen different pieces. At the last minute, the body was changed to black on a layout, and the result made the type too heavy. I scrambled to come up with something suitable for the comp that had to go out in the next half hour. I settled on Fairfield light, but it doesn't have as nice an italic as Baskerville. Is there a prettier cousin someone can recommend? It has to be a close relation so as not to differ too greatly from the other extant pieces.\n\nThankyou!\n\nMartha H.\n\n"
    },
    {
      "time": "27 Mar 2008 — 1:04pm",
      "content": "Aw man, where are you lovely typophiles? I'm working on site and may not be able to rework this layout after tomorrow. Then Fairfield will forever be employed on designs for this client.\n\nI'm currently working on another job and cannot do research for this.\n\nPlease help me!\n\nMartha H.\n\n"
    },
    {
      "time": "27 Mar 2008 — 5:20pm",
      "content": "There are lots of different Baskervilles: perhaps Fry's Baskerville would be light enough for you, or this:  \n [http://www.myfonts.com/fonts/ef-typeshop/old-baskerville/light/](http://web.archive.org/web/20131013173735/http:/www.myfonts.com/fonts/ef-typeshop/old-baskerville/light/ \"http://www.myfonts.com/fonts/ef-typeshop/old-baskerville/light/\")\n\n"
    },
    {
      "time": "27 Mar 2008 — 5:43pm",
      "content": "I guess the problem here is that Monotype Baskerville (is this what you are using?) is already very, very light. Much lighter than that would be hard to get! (I did a comparison of four Baskerville's last night and it was the lightest, I think.)\n\n"
    },
    {
      "time": "27 Mar 2008 — 7:00pm",
      "content": "I would second taking a look at Monotype Baskerville. The fine strokes in the letterforms are fine indeed. The heavier strokes may be too heavy for you. But as I remember, I had to increase the weight of it A LOT to get a good printing, direct-to-plate, offset lithography, on Natures Natural (a recycled, uncoated sheet).\n\nFrequently, a serif font that is thin will have a lot of \"sparkle\"; that is, dramatic contrast between the light & heavier strokes. Bauer Bodoni immediately comes to mind.\n\n"
    },
    {
      "time": "28 Mar 2008 — 1:18pm",
      "content": "Thanks for your input guys. The Old Baskerville you suggest looks as if it would solve my dilemma perfectly. I'll see if they're willing to spend a little money.\n\nI know it seems an unlikely problem. I chose Baskerville (you're right Charles, it is Monotype) in the first place because it is a lighter typeface!\n\n"
    }
  ]
}
