{
  "id": "43581",
  "title": "I'm looking for some possibly life changing advice...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey There! I’m looking for some possibly life changing advice, so I’d greatly appreciate it if you could read my post and offer whatever thoughts you may have. Thanks in advance!\n\nLet me give you a quick run down on my life.\n\nI’m 20. After high-school I went to university for graphic design, but hating it, I dropped out after only the first year. For the next two years [to present], I’ve worked as a freelance web-designer. Now I’m thinking about the future. Freelance is unstable. I’d like to find work with a studio, but I have no idea how, where to begin, or whether I am qualified or skilled enough.\n\nI’ll link you to my portfolio so you can keep it in mind as you read the rest.  \n [www.skywide.net](http://web.archive.org/web/20080709010042/http:/www.skywide.net/ \"www.skywide.net\")\n\nMy question to you is: How does one go about finding their first full-time graphic design job?\n\nI have no full-time working experience. My resume consists of a scattering of freelance positions with a variety of individuals, organizations, and a few running overflow agreements with some local studios. I do have a few strong references.\n\nIs it generally accepted that studios/organizations only hire people who’ve completed university or college programs?\n\nPerhaps I need to do some sort of internship?\n\nPlease take a look at my website and offer honest feedback. Do I even stand a chance? Is my portfolio varied enough? Is it what employers are looking for?\n\nReally, whatever advice you have to give would probably be helpful.\n\nI have little interest in going back to university to complete my design degree [citing reasons such as insane tuition costs, lack of actual learning.], but it is an option...\n\nThanks,  \nBlake\n\n [‹ Books About Corporate Weblogs](http://web.archive.org/web/20080709010042/http:/www.typophile.com/node/43460 \"Go to previous forum topic\") [\"unnecessary\" quotation marks ›](http://web.archive.org/web/20080709010042/http:/www.typophile.com/node/43712 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080709010042/http://www.typophile.com/user/28802\" title=\"View user profile.\">blakehaven</a>",
  "time": "<br>",
  "uid": "28802",
  "comments": [
    {
      "time": " 26.Mar.2008 2.22pm",
      "content": "Okay, I’m only two years out of school, so take my advice with a grain of salt:\n\nI’d say you have a good start, especially considering you have almost no formal training. The majority of your work looks pretty “safe,” and seems to be very ad-company-ish, but there is obviously a lot of thought going into them. I would be curious to know in what capacity and how much of these websites are yours, and how much other team members contributed. I particularly like the design on “warfare grounds” and theillest.com, as they seem to have a little more personality.\n\nI have a hard time saying don’t go to school, but you may be okay. I’m not nearly in a position to tell you what employers are looking for, but I would have to say most creative firms have a “proof is in the pudding” philosophy. A BFA from RISD would certainly help your resumé, but I think what matters most is your portfolio. Depending on what languages of code you know, that will help bolster you as well. Java and Flash Actionscripting are a huge plus, but maybe you should here from someone who isn’t a print designer...\n\nIf you are an AIGA member, they have excellent networking events. Creative hotlist and coroflot.com may be good places to start looking for jobs as well.\n\n"
    },
    {
      "time": " 26.Mar.2008 2.52pm",
      "content": "If you understand server-side stuff you can probably land a job as a digital production artist in a design firm and work your way up from there.\n\n"
    },
    {
      "time": " 26.Mar.2008 3.02pm",
      "content": "Chipman223,\n\nI’ve worked as the sole designer on all these projects, and take full credit for everything you see on my website.\n\nThe problem I’ve found with freelancing is that the people who are willing to pay well, aren’t interested in taking risks. That’s why a lot of my more recent projects have been pretty simple and safe, unlike some of my older more fun designs.\n\nWhat is AIGA all about?\n\nThanks for the helpful comment, very much appreciated.\n\nJames Puckett,\n\nI write php, xhtml, css, javascript, actionscript, all relatively well.\n\n"
    },
    {
      "time": " 26.Mar.2008 3.38pm",
      "content": "AIGA: American Institute of Graphic Arts. They have annual dues of about $310, which may be a little steep on a tight budget, but like I said, they have great networking events, discounts on admission to some galleries/museums, great lectures as well as some exclusive job listings (aiga.org).\n\nJames is right, if you have all that coding skill, you should find a job relatively easily, at least compared to a print designer.\n\nBest of luck!\n\n"
    },
    {
      "time": " 26.Mar.2008 3.44pm",
      "content": "My advice is to hit up advertising agencies with small web departments. Can you do flash? Tech production is always in short supply and you can work your way up to a design position from there.\n\n"
    },
    {
      "time": " 26.Mar.2008 5.01pm",
      "content": "My advice would be to go back to school and then start a career in banking. Or forestry. Or dentistry. Anything but design. That way you’ll have a long career, a healthy lifestyle, retirement savings, some measure of social status as well as the gratification and esteem that goes along with doing something real, something that makes sense.\n\n"
    },
    {
      "time": " 27.Mar.2008 6.08am",
      "content": "\\> Is it generally accepted that studios/organizations only hire people who’ve completed university or college programs?\n\nNo. It is not generally accepted. Many people do not go through a college program.\n\n\\> Perhaps I need to do some sort of internship?\n\nThat is a good way to get started.\n\n"
    },
    {
      "time": " 27.Mar.2008 6.58am",
      "content": "I hated the first year of Art School too. Still life drawing...fundamentals of design...it felt like really hard/boring kindergarten. ;o)\n\nHowever, it gets better. Think of it as a hazing year. ;o)\n\nIt’s probably a bit regional, but, as you’re still young with little work experience, yea, I think most graphic design firms are going to lean towards folks with full art and design degrees.\n\nWeb design is a bit different. They’re not quite as picky as to specific degrees, as it’s such a varied field.\n\n“What is AIGA all about?”\n\nIt like a country club for graphic designers. You pay your dues so you can schmooze. ;0)\n\n(Seriously, a great org for you...especially if you’re new in the field...although they’ve never realy ’gotten’ the web side of things)\n\n"
    },
    {
      "time": " 27.Mar.2008 7.14am",
      "content": "If you love what you are doing, keep doing it and make it work for you.  \nIf you don’t like what you are doing freelance, you will hate doing it for someone else.  \nThe Don is right: If it’s about money, this is the wrong profession.  \nThe idea of working for an agency was hell to me, so I started doing my own thing (which is not for everyone, and the risk is high, but it works for me and I’m glad i took the gamble)\n\n"
    },
    {
      "time": " 27.Mar.2008 7.17am",
      "content": "<cite>That way you’ll have a long career, a healthy lifestyle, retirement savings, some measure of social status as well as the gratification and esteem that goes along with doing something real, something that makes sense.</cite>\n\nDoing something real is why I got into design. At the end of a job I have something solid to show for my efforts. That can’t be brought down by pretentious demagogues with MFAs or by idiot clients.\n\n<cite>You pay your dues so you can schmooze.</cite>\n\nI don’t pay my dues, I just show up and schmooze. It’s a lot less expensive to just pay an extra five bucks to get into the meetings.\n\n"
    },
    {
      "time": " 27.Mar.2008 12.26pm",
      "content": "That way you’ll have a long career, a healthy lifestyle, retirement savings, some measure of social status as well as the gratification and esteem that goes along with doing something real, something that makes sense.\n\nI love design, it makes me really happy. I can see where you’re coming from, but I’m hoping it’s just your experience, and not respective of the entire industry.\n\n"
    },
    {
      "time": " 27.Mar.2008 12.33pm",
      "content": "Who wants to be a thousandaire?!\n\n"
    },
    {
      "time": " 27.Mar.2008 1.04pm",
      "content": "Blake, you’ve worked with clients (which is a good thing to have under your belt) but have no formal training (no degree makes it harder). If you want to work for an agency/ firm, I think you’re on the mark when you suggested an internship or a junior position. Unless you are a design prodigy, you’ll have to prove yourself and build your resume for larger, more stable stuff. With web design, I gather it’s all about technical skills when you’re starting out.\n\nYour work has solidity and variety, but lacks a certain spark and depth which usually comes from experience and collaboration with a team. My advice is to hit AIGA’s site, craigslist, Coroflot, and anywhere else you can find to seek out openings.\n\n(disclaimer: I’m a print designer with a dash of web skills)\n\n"
    },
    {
      "time": " 28.Mar.2008 4.14am",
      "content": "Black, I don’t dare to advice anything. But I believe the trick on getting a career is more a matter of insistence and pursue of your dream, then diplomas. Keep going no matter what ’they’ say! I like what I have seen on your site.\n\nGood luck for you!\n\nAndre\n\n"
    },
    {
      "time": " 28.Mar.2008 1.57pm",
      "content": "Thanks everyone! Your comments have been very helpful.  \nAlthough I’m still debating on what I should do, I’m starting to lean towards an internship.\n\nIf anyone has any suggestions or advice on how to begin networking, or websites where I might find job postings [Toronto], I would love to hear your advice.\n\n"
    },
    {
      "time": " 28.Mar.2008 4.23pm",
      "content": "Who was the idiot who suggested AIGA to a Canadian? Oh, wait, that was me.\n\n"
    },
    {
      "time": " 28.Mar.2008 7.31pm",
      "content": "I’ve found RGD which seems to be an equivalent of some sort?\n\nAnyways, you hardly could have known I was canadian, and I found the aiga website useful, so hah.\n\n"
    },
    {
      "time": " 30.Mar.2008 1.41pm",
      "content": "Hi I always find it amazing people trying to find a quick fix or a short-cut. Nothing really comes for free and the only way to get there is by doing it... don’t wait for hand outs. Hard work or putting yourself on the line, by just doing it...\n\nYou are only 20!!!... if you think you need more design discipline or skills go back to design school NOW... take from it what you want, be motivated and inspired by others as they too may be inspired by you. 4-5 years now to get that dream job (maybe) is worth it... unless you are so talented that an agency will head hunt you and put you in a great role of creative... ... it’s not going to happen.\n\nHard work, put yourself out there... get noticed... go back to school or get a job as a junior or a mac op.... because once you are in an agency, the foot is already well in the door.\n\nFreelance as a mac op via design recruitment/HR/freelance company, though they will want to know history and will test you on your skills, once in they can get you temporary positions freelancing at small to large agencies.\n\nA problem for graduates is that no-one wants a graduate without real agency experience, how is a graduate supposed to get real experience if no-one is willing to take them on?... thats where the internships help out I guess.\n\nin your case you have had real experience in web, so I would be using that, it is your ’in’ your foot in the door.. or go to a company like Aquent (example only)... or bang on every door.\n\nGo back to design school and do an internship at the same time... maybe pick another school... remembering you quit design school, so an employer may think “this person may quit us?”...\n\nThe future is yours... play hard and have fun\n\n"
    },
    {
      "time": " 30.Mar.2008 1.49pm",
      "content": "<cite>You are only 20!!!... if you think you need more design discipline or skills go back to design school NOW...</cite>\n\nI walked away from an almost six-figure salary at 26 to go back to school. It wasn’t so bad.\n\n"
    },
    {
      "time": " 30.Mar.2008 3.00pm",
      "content": "NIce work James... I too resigned and went back to school, it was the best thing for me. Change is good and the only way is forward... made the commitment. It comes down to life choices and where you think you want to go... you can only experience it yourself by doing it (with a bit of research first)\n\n"
    },
    {
      "time": " 30.Mar.2008 4.47pm",
      "content": "Blake,  \nMy most important advice to you: Make sure it’s you who determines what direction you’d like to take in your career. Talking with others may help; but ultimately the desire must be discovered inside you.  \nI studied computer science for three years in college before finally coming to grips with the idea that—while I liked it, and was good at it—I didn’t love it. It would have been a safe career path for me, and I could have done what I really loved on the side; but I decided to change direction so I could work at what I love full-time.  \nMaybe you’re sticking with web design because you feel like it’s a safe path; but I assume that you’re wondering what’s next—meaning you’re not truly fulfilled with where you’re at presently. Find within yourself what kind of work you would eventually love to do everyday. For me it’s type design and print design. I’ve still got a way to go before type design can be the primary focus of my professional life every single day, but that’s what I’m working toward.  \nYou’re good enough to get contracts working in web design, but you might love working with animals or making music or teaching history for all we know.  \nSo try a lot of things; meet a lot of different kinds of people. But make sure it’s you who decides where you want to end up. Then follow your passion for it and you’ll get there.\n\n"
    },
    {
      "time": " 30.Mar.2008 7.41pm",
      "content": "I am terrified to see people saying you should continue to be a dropout. No matter what happens, it’s hard to see a downside to having finished your degree 5 to 10 years from now, and easy to imagine upsides: scenarios in which you’ll be very, very grateful you did. I agree with an earlier poster: switch schools. Do what it takes—and do internships along the way—but get yourself fully and conventionally credentialed. Otherwise you’ll be naked out there in the future. Not to mention the global depression now starting to stir! Please, please don’t play around with your future. It doesn’t seem very substantial yet at 20, but that is a flagrant, completely predictable error of perspective and nothing more.\n\n"
    },
    {
      "time": " 31.Mar.2008 8.57am",
      "content": "I agree with Peter. I’ve never heard anyone say they missed an opportunity because they had a college degree.\n\nSharon\n\n"
    },
    {
      "time": " 31.Mar.2008 5.05pm",
      "content": "You know what, he is 20! Aghhh. The ’canuto’ counts, no doubt. One thing is certain, you got to get da ass moving! Again, triple luck for you.\n\n[thousandaire] is that what I think?\n\nAndré\n\n"
    }
  ]
}
