{
  "id": "43599",
  "title": "Move Over Phillip Meggs",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Mary Ellen McFadden, in her 80 years of existence, has amassed an extensive collection of Graphic Design history. And she’s sharing it with everyone...\n\n[http://www.flickr.com/photos/20745656@N00/sets/](http://web.archive.org/web/20080905122855/http:/www.flickr.com/photos/20745656@N00/sets/ \"http://www.flickr.com/photos/20745656@N00/sets/\")\n\nHere you will find plenty of well organized images from some of history’s greatest graphic artists, graphic art movements and styles. It might not be hardbound, but it’s still inspiring.\n\n [‹ Ffffound account](http://web.archive.org/web/20080905122855/http:/www.typophile.com/node/42015 \"Go to previous forum topic\") [Happy Birthday Miss Haley ›](http://web.archive.org/web/20080905122855/http:/www.typophile.com/node/43518 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905122855/http://www.typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 27.Mar.2008 7.11am",
      "content": "Ms. McFadden has just made an absolutely incredible contribution to the field. Design students everywhere will be thanking her for years to come.\n\n"
    },
    {
      "time": " 27.Mar.2008 7.17am",
      "content": "My write up was a bit campy, wasn’t it?\n\n"
    },
    {
      "time": " 27.Mar.2008 7.24am",
      "content": "It was appreciated though.\n\nChrisL\n\n"
    },
    {
      "time": " 27.Mar.2008 8.04am",
      "content": "<cite>My write up was a bit campy, wasn’t it?</cite>\n\nNot half as campy as 99% of articles on Design Observer, and this Flickr gallery is very deserving of the praise. These images could have been collected into another overpriced stock library or sold to art schools for use during lectures. Turning them into a free online gallery is pretty generous. It may not equal the establishment of a great museum collection in financial terms, but it does in spirit. For design students, tracking down some of these images would involve tracking down an obscure book to see it at the size of a postage stamp. Good luck scanning that up for re-use in a research paper. Having these images available on Flickr is going to free up a hell of a lot of time that can be spent reading, writing, and of course, designing.\n\n"
    },
    {
      "time": " 27.Mar.2008 9.30am",
      "content": "This is great. Thanks.\n\npbc\n\n"
    }
  ]
}
