{
  "id": "43616",
  "title": "(x) Upright italic 'f' - various {gang}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Any notion of what type this is or, for that matter, what serif font has a similar vertical ital lc \"f\"?\n\n| Attachment | Size |\n| --- | --- |\n| [vertical f.jpg](http://web.archive.org/web/20130307143651/http:/typophile.com/files/vertical%20f.jpg) | 27.33 KB |\n\n",
  "author": "The Don Killuminati",
  "time": "27 Mar 2008 — 1:49pm",
  "uid": "25732",
  "comments": [
    {
      "time": "27 Mar 2008 — 1:59pm",
      "content": "[Sassoon Sans](http://web.archive.org/web/20130307143651/http:/www.myfonts.com/fonts/linotype/sassoon-sans/) has a vertical f like that, but there is more contrast in your letter suggesting a serif font. It's possible the italic was backslanted. It might also be a Math function (ƒ) symbol [Option-f on a Mac]. Most font showings don't show this glyph, so it would be hard to browse for this one.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 Mar 2008 — 2:08pm",
      "content": "Just for fun I typed that function symbol as the sample word and then used 'Garalde' as the search term. There were a few that were vertical, or nearly so, but most had different details. I thought [Dante](http://web.archive.org/web/20130307143651/http:/www.myfonts.com/fonts/adobe/dante/) was pretty close. You might find something even closer if you looked at more than the 225 families this search pulled up.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 Mar 2008 — 2:13pm",
      "content": "Thanks, Mike. I hadn't considered that it could be the function symbol; thanks for that and I'm sure I can find a suitable substitute, or at least one I can slant back to match closely enough.\n\nIndeed, it does seem that the vertical ital f is extremely rare in serif families.\n\nThank you again.\n\n"
    },
    {
      "time": "27 Mar 2008 — 3:17pm",
      "content": "This might also be florin (not italic). Here is Gentium's florin\n\n ![](http://web.archive.org/web/20130307143651im_/http:/typophile.com/files/flogin_6504.jpg)\n\n"
    },
    {
      "time": "27 Mar 2008 — 4:00pm",
      "content": "There sure is a resemblance. And it appears small enough that whatever differences there are may be negligible.\n\n"
    },
    {
      "time": "27 Mar 2008 — 5:16pm",
      "content": "If you are willing to play with a font editor, another solution is to take an upright integral sign and add some horizontal bar. Just look at the characters 0x0072 and 0x0077 in the opticals of the font [wasy](http://web.archive.org/web/20130307143651/http:/www.ctan.org/tex-archive/fonts/wasy2/ps-type1/hoekwater/) (that comes with the tex installation packages). Here is what the character looks like:\n\n ![](http://web.archive.org/web/20130307143651im_/http:/typophile.com/files/integral_4571.jpg)\n\nThe [license](http://web.archive.org/web/20130307143651/http:/tug.ctan.org/cgi-bin/ctanPackageInformation.py?id=wasy2) says \"public domain\".\n\n"
    },
    {
      "time": "27 Mar 2008 — 6:19pm",
      "content": "Mike mentioned Dante. The florin (character 0x0192) of Dante regular is close indeed:\n\n ![](http://web.archive.org/web/20130307143651im_/http:/typophile.com/files/0x0192dante_6406.jpg)\n\n"
    },
    {
      "time": "28 Mar 2008 — 8:36am",
      "content": "Hmm, some of the references I found said that Option-f on the Mac is the Florin. I just assumed it was the math function symbol.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "28 Mar 2008 — 9:58am",
      "content": "<cite>I just assumed it was the math function symbol.</cite>\n\nIf we look at the unicode chart [http://www.unicode.org/charts/PDF/U0180.pdf](http://web.archive.org/web/20130307143651/http:/www.unicode.org/charts/PDF/U0180.pdf \"http://www.unicode.org/charts/PDF/U0180.pdf\") we see this\n\n ![](http://web.archive.org/web/20130307143651im_/http:/typophile.com/files/unchart_5182.jpg)\n\nSo, it seems, you are not the only one to assume that, yet I am unaware of a character called \"function symbol\" in mathematics. In France, there is a tradition where capital letters and Greek letters used in mathematical formulae are upright (and that is why the psi in my avatar is upright) but I am unaware of a mathematical tradition that would denote functions with small upright italic letters. If I use the LaTeX fourier package with the upright option to denote a function _f_ from X to Y, I get this\n\n ![](http://web.archive.org/web/20130307143651im_/http:/typophile.com/files/function_6158.jpg)\n\nThe X and Y are upright (contrary to the American tradition) but the f is not.\n\n[Edit] However, I have seen comments on another thread where it is contended that the florin should be slanted...\n\n"
    },
    {
      "time": "29 Mar 2008 — 7:48am",
      "content": "Michel, I think it is usual for that symbol to be slanted, but apparently some typefaces use much less slant than others. When I was an engineering student it didn't matter, since it only needed to look like a lower case f with a tail (we were writing it all by hand in the 60's). It's not clear how the posted glyph was being used.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "30 Mar 2008 — 6:57am",
      "content": "Mike, there are two independent questions here, the hook and the slant. Concerning the use, here is something interesting I found in Victor Gaultney's (pdf) text [_gentium, a typeface for the nations_](http://web.archive.org/web/20130307143651/http:/scripts.sil.org/cms/scripts/render_download.php?site_id=nrsi&format=file&media_id=Gentium_RU_spec&filename=Gentium_RU_spec.pdf), and I cite:\n\n&nbsp;&nbsp;_The design of the italic f [in Gentium] allows a clear distinction to be made between it and the hooked version. Both are used for the Ewe language of Ghana._\n\nand he gives the example:\n\n ![](http://web.archive.org/web/20130307143651im_/http:/typophile.com/files/ufaital_5165.jpg)\n  \nI gather that in the regular, that should read  \n\n ![](http://web.archive.org/web/20130307143651im_/http:/typophile.com/files/ufareg_6116.jpg)\n  \nand that U+0192 should normally be upright in the regular and, in the italic, it should share it's slant.\n\nAs for the requirement of a hooked f in mathematical formulas, I am suprised at what you say but engineers may have conventions that mathematicians don't. Normally mathematics lowercase is italics and, in most fonts but not all, the italic f is hooked. So I looked at my math books to see if any would use a non hooked italic f to represent a function; I found a few nicely edited books from the Springer series \"Ergebnisse der mathematik\" (one of which is even printed in the USA) with f(x) written as in (1), which is less hooked than the non hooked gentium italic f. I found essentially the same f in two books published in France (2); I also found a little book from Mir publishers, Moscow, with an italic f(x) that is absolutely not hooked (3). Those books date from the sixties and seventies and are all \"graduate level\" pure mathematics.\n\n ![](http://web.archive.org/web/20130307143651im_/http:/typophile.com/files/fofx_5671.jpg)\n  \nIf you have any reference about that hook requirement, please let me know.\n\nMichel Boyer\n\n"
    },
    {
      "time": "30 Mar 2008 — 7:57am",
      "content": "Michel, you have done much more research on this than I have. I was an engineering student in 1962-67, when anything we did was done by hand. We didn't even have calculators, not to mention laptops. As long as what we wrote seemed to resemble the function symbol, that was good enough. Our textbooks were probably printed with metal type, and I can't honestly say that I paid too much attention in those days to what the function symbol f was like. At that point it would still be about 20 years until I started caring about fonts, or noticing details like that.\n\nI tend to think that the 'requirements' about this are just general conventions, and as long as the function symbol is distinct from the other lettering in the textbooks, no one would be confused. I have been told that mathematicians can be very particular about their symbols, but as long as I am not typesetting one of their books, I don't think I will worry about it much.\n\nWe still don't even know what the 'f' of this post was supposed to be -- a vertical italic f, or a Florin symbol, or a function symbol -- but it seems we have answered the question well enough.\n\nI am impressed by your thoroughness though, and I have noticed that about you before. Well done.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "30 Mar 2008 — 2:16pm",
      "content": "<cite>it seems we have answered the question well enough.</cite>\n\nAgreed, but the comment \"= function symbol\" for U+0192 in the unicode chart troubled me. I now had a look at the Unicode Technical Report #25, [_Unicode support for mathematics_](http://web.archive.org/web/20130307143651/http:/unicode.org/reports/tr25/), which seems to solve my worry: U+0192 is not in the mathematical character repertoire: the report refers nowhere to any character in the range U+0100..U+01FF.\n\nSolved for me too.\n\nMichel Boyer\n\n"
    },
    {
      "time": "31 Mar 2008 — 3:42pm",
      "content": "<cite>Most font showings don’t show this glyph, so it would be hard to browse for this one.</cite>\n\nMike, with the character palette, you can see them all by selecting the view \"Code Tables\", \"Latin Extended-B\" and then clicking on character 0192 (line 0190, column 2).\n\n ![](http://web.archive.org/web/20130307143651im_/http:/typophile.com/files/palette_5094.jpg)\n\n"
    }
  ]
}
