{
  "id": "43610",
  "title": "Need a ffffound invite",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone have a ffffound invite that they would give me. I've been searching for one for a long time. I will put you on my next Christmas list.\n\n",
  "author": "heymendoza",
  "time": "27 Mar 2008 — 10:38am",
  "uid": "21516",
  "comments": [
    {
      "time": "27 Mar 2008 — 10:43am",
      "content": "Can someone explain to me why these invites are so coveted? We've had at least 4 threads about this in the last while.\n\n"
    },
    {
      "time": "27 Mar 2008 — 11:09am",
      "content": "Try [We heart it](http://web.archive.org/web/20131015022904/http:/weheartit.com/). Just launched. Same concept as Ffffound but arguably a more functional design, plus tags and comments. Here's [my page](http://web.archive.org/web/20131015022904/http:/weheartit.com/user/stewf).\n\n"
    },
    {
      "time": "27 Mar 2008 — 11:16am",
      "content": "Hmm, while that site looks interesting, Stephen, I think one of the plusses of ffffound is that there is only images. No tagclouds, pages of comments and other things that distract from the content.\n\nBut I'll take a loot at We heart it. :)\n\n"
    },
    {
      "time": "27 Mar 2008 — 12:07pm",
      "content": "Tiff: I think, because Haley started a thread about it and when you google it typohile comes up as a top hit so people figure it's a good place to go. But if people actually read the threads they'd realize we don't have them.\n\n"
    },
    {
      "time": "27 Mar 2008 — 12:22pm",
      "content": "Sorry! You can delete my thread if you want. I found an invite :) I basically had to ask everyone on the internet so good luck to you sir. Every member only gets one invite thats why they're so hard to find.\n\n"
    },
    {
      "time": "27 Mar 2008 — 12:31pm",
      "content": "And ffffound is awesome because it doesn't have all those tags and comments and adding friends and listing your interests. It's anti social networking and that's totally fine with me.\n\nNothing ruins a good piece of design like some moron talking about how much he hates President Bush or PrincessGal69 inviting me to play online poker.\n\n"
    },
    {
      "time": "27 Mar 2008 — 12:33pm",
      "content": "Haley & Quincunx - I get your drift, but there is nothing extra on We Heart except the comments and tags, and they are not intrusive.\n\n"
    },
    {
      "time": "27 Mar 2008 — 1:07pm",
      "content": "I find the mouseovers annoying. I want large previews where I don't have to click to see the whole image.  \nDon't get me wrong, I love tags. Pretty much the best things ever.  \nBut ffffound kinda does that automatically by sourcing words from the website the picture was saved from to give you suggestions of similar images. We heart it relies on user input and I notice a lot of the images don't have tags anyway. And I never ever thought I'd be saying this. But there's too much pink.\n\nFfffounds not perfect but I think i prefer it.\n\n"
    },
    {
      "time": "27 Mar 2008 — 1:19pm",
      "content": "My big question is, does ffffound use a ligature for the first four letters of the word? If it doesn't I won't join.\n\n"
    },
    {
      "time": "27 Mar 2008 — 1:27pm",
      "content": " ![](http://web.archive.org/web/20131015022904im_/http:/typophile.com/files/found_01_4545.r2103.gif)\n\n"
    },
    {
      "time": "27 Mar 2008 — 4:39pm",
      "content": "Well I thought I would just ask in hopes that someone could let me in. Thanks for replying anyways.\n\n"
    },
    {
      "time": "27 Mar 2008 — 8:34pm",
      "content": "Haley Fiege said, \"I found an invite :)\"\n\nWell then you're a slacker. I've been hitting that site incessantly for months and have yet to see ANY cake images!\n\n"
    },
    {
      "time": "28 Mar 2008 — 6:32am",
      "content": "You're totally right.\n\nHere is my user: [http://ffffound.com/home/kingdomofawesome/found/](http://web.archive.org/web/20131015022904/http:/ffffound.com/home/kingdomofawesome/found/ \"http://ffffound.com/home/kingdomofawesome/found/\")\n\n"
    },
    {
      "time": "28 Mar 2008 — 8:04am",
      "content": "Like Tiffany, I have no idea what this site purports to be about - is it just an exclusive Flickr? Can someone enlighten me?\n\n"
    },
    {
      "time": "28 Mar 2008 — 9:26am",
      "content": "Haley, you have an invite to give out, then?\n\n:-)\n\ndr\n\n"
    },
    {
      "time": "28 Mar 2008 — 9:30am",
      "content": "No, it's more like del.icio.us, but with images instead of links.\n\n"
    },
    {
      "time": "28 Mar 2008 — 10:19am",
      "content": "Don, I think that pppperson in the llllogo is taping ligatures to the the 'f's\n\n& I'd like an invite too. Thanks.\n\n-=®=-\n\n"
    },
    {
      "time": "28 Mar 2008 — 10:54am",
      "content": "I'm not giving out my invite because everyone asks for it and it's not fair to decide between my friends.\n\n"
    },
    {
      "time": "28 Mar 2008 — 11:02am",
      "content": "Nice picture of delicious cake. I'm getting a sense of meanness though with all of the contrived charts of obstacles to cake, from medieval dogs to magnetic force fields.\n\nFfffound is about the found image. An endless visual jukebox randomly playing images. Ffffind more cake.\n\n"
    },
    {
      "time": "28 Mar 2008 — 11:25am",
      "content": "Thanks for mentioning 'We Heart It'. Niiice.\n\nDav  \n_( [weheartit.com/user/dav](http://web.archive.org/web/20131015022904/http:/weheartit.com/user/dav))_\n\n"
    },
    {
      "time": "31 Mar 2008 — 10:40am",
      "content": "If any one has a ffffound invite, please share. I promise to post responsibly.\n\n"
    },
    {
      "time": "8 Apr 2008 — 6:12am",
      "content": "You should also check [http://vi.sualize.us](http://web.archive.org/web/20131015022904/http:/vi.sualize.us/ \"http://vi.sualize.us\")\n\nNo invites needed and pretty good stuff around. I'm using it to save the images I like on fffound ;) The good thing is that you can search for images, and find really interesting things.\n\nIt definitely worths a try!\n\n"
    },
    {
      "time": "9 Apr 2008 — 5:14pm",
      "content": "damn,i love we heart it, but sure would love to be on ffffound!  \ninvite someone?  \n [chrisvilchez@gmail.com](mailto:chrisvilchez@gmail.com)\n\n"
    },
    {
      "time": "10 Apr 2008 — 4:43pm",
      "content": "No one has invites here! Stop asking.\n\nThis thread comes up when you google my name now :|\n\n"
    },
    {
      "time": "16 Apr 2008 — 12:53am",
      "content": "Haley,\n\nSince we aren't BFF's can you send me the ffffound invite? Just kidding, I hear what you are saying but if you change your mind please send it to [heymendoza@gmail.com](mailto:heymendoza@gmail.com) I wish we could get one started and then pass on the invites to each other until we are all in.\n\n"
    },
    {
      "time": "2 May 2008 — 12:36pm",
      "content": "I would like an invite too! I'm student in grafic design and this site is so great to find inspiration!\n\n[moutonoirx@gmail.com](mailto:moutonoirx@gmail.com)\n\nthx!\n\n"
    },
    {
      "time": "2 May 2008 — 8:50pm",
      "content": "Yes. If we could keep the process going, then we'd all be in eventually.  \nPlease, somebody...anybody...send me an invite. ^\\_^  \n [leslie20n@gmail.com](mailto:leslie20n@gmail.com)  \nThanx!\n\n"
    },
    {
      "time": "2 Jun 2008 — 11:51pm",
      "content": "Hey guys...\n\nI've been hammering fffound for a while and really would love an invite...\n\nIf anyone has got one spare, please shoot it off to [edenhannon@gmail.com](mailto:edenhannon@gmail.com)  \nIll be happy to throw mine back on here once im in.\n\nThanks dudes and dudettes.\n\nE\n\n"
    },
    {
      "time": "3 Jun 2008 — 3:50am",
      "content": "Haley you can collect the names of all interested on the invite. Gather all names in a bow and pick one, like a lottery. The winner takes it. I am out of it :-)\n\n"
    },
    {
      "time": "14 Sep 2008 — 2:31am",
      "content": "I would like an invite too! I’m grafic designer and this site is so great to find inspiration!\n\n[vitaliyzolotoy@gmail.com](mailto:vitaliyzolotoy@gmail.com)\n\nthx!\n\n"
    },
    {
      "time": "21 Sep 2008 — 12:33pm",
      "content": "If anyone is interested in sending me an invite, I'd greatly appreciate it!\n\n[blefferts@gmail.com](mailto:blefferts@gmail.com)\n\nThanks\n\n"
    },
    {
      "time": "4 Nov 2008 — 10:25am",
      "content": "I want one too. :(\n\n[mandilou@gmail.com](mailto:mandilou@gmail.com)\n\n"
    },
    {
      "time": "8 Dec 2008 — 4:58am",
      "content": "i want an invitation as well, plz.\n\n[schuyuan@gmail.com](mailto:schuyuan@gmail.com)\n\n"
    },
    {
      "time": "8 Dec 2008 — 5:11am",
      "content": "I think that anybody actually _reading_ the rest of this thread would have worked out that asking for an invite on here is probably about as effective as asking your dear old Gran for one. Repeatedly.\n\nAnd by displaying your email addresses in plaintext on a well-trafficked forum, you're probably going to end up with a lot of invites to buy generic diet pills instead. Convenient!\n\nAndi\n\n[[semibad](http://web.archive.org/web/20131015022904/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": "8 Dec 2008 — 8:00am",
      "content": "Besides, ffffound is _so_ half a year ago. You wouldn't want to be ffffound dead there now.\n\n"
    },
    {
      "time": "8 Dec 2008 — 12:03pm",
      "content": "Just use vi.sualize.us :)\n\n"
    },
    {
      "time": "7 Dec 2009 — 1:05pm",
      "content": "hi, can i get one invite plz\n\n[maxmaxmaxxx@gmail.com](mailto:maxmaxmaxxx@gmail.com)\n\nthankssss!..\n\n"
    },
    {
      "time": "7 Dec 2009 — 1:34pm",
      "content": "\\> _Just use vi.sualize.us :)_\n\nFirst thing you see on vi.sualize.us is **No invitation needed**.  \nThat's pretty funny and clever at the same time :)\n\n"
    },
    {
      "time": "2 Jul 2011 — 4:10pm",
      "content": "All you have to do is email [ffffoundinvites@gmail.com](mailto:ffffoundinvites@gmail.com) , that's how I got mine\n\n"
    }
  ]
}
