{
  "id": "43647",
  "title": "Creating a license",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm almost done with a font I created and I want to sell it but I'm not sure how to write a license. Is there a standard template where I can just replace some words or do I need to create one from scratch? If so, what should I cover in the license?\n\n",
  "author": "YOTS",
  "time": "28 Mar 2008 — 1:18pm",
  "uid": "18154",
  "comments": [
    {
      "time": "28 Mar 2008 — 1:57pm",
      "content": "Chester at Village has stated that [their EULA](http://web.archive.org/web/20130516102951/http:/www.vllg.com/Village/GalaxieCassiopeia/Licensing/) is open for use.\n\n"
    },
    {
      "time": "28 Mar 2008 — 1:59pm",
      "content": "KISS (keep it simple!)\n\n"
    },
    {
      "time": "28 Mar 2008 — 2:18pm",
      "content": "\\>KISS (keep it simple!)\n\nstupid?\n\n"
    },
    {
      "time": "28 Mar 2008 — 2:25pm",
      "content": "Or smart@ss. ;^)\n\n"
    },
    {
      "time": "28 Mar 2008 — 2:40pm",
      "content": "Ouch.\n\nRelated and possibly relevant question... if you sell your fonts via MyFonts (or another reseller) will they a. help you write a sensible EULA, b. review your EULA for unrealistic clauses? A question for the John Collins next week, maybe?\n\n"
    },
    {
      "time": "28 Mar 2008 — 2:55pm",
      "content": "Ouch? Oh. I was hoping you'd say touché. Sorry, Si!\n\nThat is a good question. Do distributors help foundries with their EULAs?\n\n"
    },
    {
      "time": "28 Mar 2008 — 3:00pm",
      "content": "\\>Sorry, Si!\n\nI thought 'touché' was French for 'ouch' - been worng all these years ;-)\n\n"
    },
    {
      "time": "28 Mar 2008 — 3:35pm",
      "content": ":^P Touché!\n\n"
    },
    {
      "time": "28 Mar 2008 — 7:10pm",
      "content": "As a font user (typesetting books for university presses), I find the Village EULA wonderful. It addresses all the concerns I know of in book publishing. The only caveat is there may be other user applications I don't know about.\n\nI thought <cite>touché</cite> meant \"touch\". As in \"you touched me with your foil, you dirty rat.\"\n\n"
    },
    {
      "time": "29 Mar 2008 — 8:06am",
      "content": "Simple or not, remember that the EULA is a document written primarily for the court.\n\n"
    },
    {
      "time": "30 Mar 2008 — 5:01pm",
      "content": "Where does Village state that their EULA is open for use?\n\n"
    },
    {
      "time": "30 Mar 2008 — 10:33pm",
      "content": "In [this thread](http://web.archive.org/web/20130516102951/http:/www.typophile.com/node/14264).\n\n"
    },
    {
      "time": "31 Mar 2008 — 10:45am",
      "content": "Isn't \"Touché\" a fencing term? As in \"you got me\".  \nOr have I been watching too many cartoons and musketeer movies ;)\n\n"
    },
    {
      "time": "31 Mar 2008 — 11:13am",
      "content": "\"Simple or not, remember that the EULA is a document written primarily for the court.\"\n\nTrue...but that then involves the courts. Better to KISS so a human can read it first and foremost hopefully avoiding the court thing to begin with. ;o)\n\n"
    },
    {
      "time": "31 Mar 2008 — 11:31am",
      "content": "I think I understand what James is saying. Sometimes too much simplicity is not enough coverage.\n\nThey have to keep their bottoms covered. We, the end user, cannot blame them for wanting that. EULAs like Village's are wonderful for us, but we can't count on that every time. That is why it is absolutely essential to not only read the EULA when you license a typeface. Don't be afraid to ask questions of the foundry. If the foundry doesn't care enough to answer you, or if they do and you don't like the answer, then don't license from them.\n\n"
    },
    {
      "time": "31 Mar 2008 — 11:34am",
      "content": "That is one of the most reasonable and practical EULAs I have ever seen. Makes me want to do all my shopping at Village.\n\n"
    },
    {
      "time": "31 Mar 2008 — 12:16pm",
      "content": "\"EULAs like Village’s are wonderful for us, but we can’t count on that every time.\"\n\nI guess that's my point. If you want to please the customer with the money, try writing the EULA in a way that a) will encourage them to actually read it and b) make it easy to understand.\n\nI agree that one still needs a lawyer, but lawyers tend to write for other lawyers. Make sure the lawyer you hire is also able to write for humans. ;o)\n\n"
    },
    {
      "time": "6 Apr 2008 — 4:50pm",
      "content": "\\>A question for the John Collins next week, maybe?\n\nJohn confirmed that MyFonts provides a standard license boilerplate for foundries. In his talk he gave some great EULA advice on what works and what doesn't - I hope he'll be willing to let us share his notes with the community.\n\n"
    },
    {
      "time": "7 Apr 2008 — 6:46am",
      "content": "\\> Isn’t “Touché” a fencing term? As in “you got me”.\n\nYes. It means touched, as in \"you got me\".\n\n"
    }
  ]
}
