{
  "id": "43653",
  "title": "Type for historic brewery",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello typophiles,\n\nI’m completely blank on this area, so I thought i would seek advice here. I would greatly appreaciate any feedback.\n\nI’m looking for suitable type for beer-house, that recently changed it’s name after an old brewery that used to be on the same street (apparently more than 200 years ago – from what I can udnerstand of their PR-material)\n\nA secondary element of my type choice is the home-like and unpretentious spirit of the beer-house, with their friendly service (e.g. the spirits on the first floor are self serviced, so you just take your glass of whiskey and pay on the way out). But for now, I’d like to just get a hint for tracking up relevant type/fonts for old style breweries.\n\nMy thought is, that I’d rather stay clear of too stereotypical german style blackletters, but still have some of it in it (I’m not even sure if blackletter is a relevant guess in any way, but again, I’m completely blank here!).\n\nThank you,  \nMalte\n\n [‹ How can I do a handwriting signature ?](http://web.archive.org/web/20081203003151/http:/www.typophile.com/node/43696 \"Go to previous forum topic\") [Recommended books about typography ›](http://web.archive.org/web/20081203003151/http:/www.typophile.com/node/43663 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203003151/http://www.typophile.com/user/24816\" title=\"View user profile.\">maltelunden</a>",
  "time": "<br>",
  "uid": "24816",
  "comments": [
    {
      "time": " 28.Mar.2008 7.15pm",
      "content": "I would play around with some of the fonts from LetterheadFonts.com\n\nMostly nostalgic fonts, but you might find the right look none the less.\n\n"
    },
    {
      "time": " 28.Mar.2008 7.45pm",
      "content": "depending on what kind of old style you’re looking for, P22’s Declaration is a nice historic font.\n\n[http://www.p22.com/products/declaration.html](http://web.archive.org/web/20081203003151/http:/www.p22.com/products/declaration.html)\n\n"
    },
    {
      "time": " 29.Mar.2008 2.14pm",
      "content": "Thanks for your suggestions. I think I’m in the lines of declarations script style, but I think it needs to be a little less authentic and a bit more warm, friendly and contemporary. Perhaps if someone had made a thicker script typeface with a strong inspiration from that kind of old style type, it would suit me quite well.\n\n– _Malte_\n\n"
    },
    {
      "time": " 29.Mar.2008 2.42pm",
      "content": "You might find some ideas here: Beer Label Store. I Googled “Beer Bottle Collectors” Apparently there are a lot of them. :-)\n\nThis is label that has a very plain but I think effective “historic” feel: [Thomas Hardy’s ale](http://web.archive.org/web/20081203003151/http:/www.ohanlons.co.uk/images/pop_up_labels/label_tom_hardy_bottle.jpg)\n\narcher, those P22 fonts are gorgeous.\n\n-=®=-\n\n"
    },
    {
      "time": " 30.Mar.2008 6.08am",
      "content": "Thank you very much rusellm. I will have a look at that site soon.\n\nI really like the direction towards Thomas Hardy’s Ale and agree in your description. Now, if it only had a slightly more “swing” in it, and if not completely script-styled, then maybe some swashes. Would that synthesis be possible?\n\n– _Malte_\n\n"
    }
  ]
}
