{
  "id": "43658",
  "title": "Who can give a scholarly definition of \"type size\"?",
  "forum": "Build",
  "tags": [

  ],
  "content": "A text typeset in 9 on 10 point using font A may look, as if it were identical with the same text typeset in 10 on 10 point using font B. This phenomenon is exemplified by me in this document:\n\n[http://www.sanskritweb.net/temporary/helve90.pdf](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/helve90.pdf \"http://www.sanskritweb.net/temporary/helve90.pdf\")\n\nWho can give a scholarly definition of the notion of “type size” (or “size of type”, “font size”, “point size”), taking into considering this phenomenon as exemplified above.\n\n [‹ Problems with manual kerning](http://web.archive.org/web/20081013234931/http:/typophile.com/node/44099 \"Go to previous forum topic\") ['Expert' PS1 fonts still broken in OSX 10.5.2 ›](http://web.archive.org/web/20081013234931/http:/typophile.com/node/42042 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013234931/http://typophile.com/user/11274\" title=\"View user profile.\">Uli</a>",
  "time": "<br>",
  "uid": "11274",
  "comments": [
    {
      "time": " 29.Mar.2008 4.51am",
      "content": "Type size at output is controlled by two factors.\n\nOne is the relationship between the glyphs and the em square, the default space upon which all glyphs of all fonts are defined and positioned. This definition and positioning of glyphs at a single scale, is done by the type designer, so that all output of a given size of a font will be compatible across all glyphs.\n\nThe other factor is the size input by whatever method is offered to the user, so that the user may control the size(s) of the output. The first factor is non-standard, or, not all font families share the same relationship to the em square. The size relationship to the em square should, however, be standard across the styles of a family. The second factor has multiple standards, but the predominent one is the point system, (72.289, or so, to the inch).\n\nThis second factor allows the user to define consistent measure from baseline to baseline between any two fonts of the same size and leading, regardless of the first factor, or size on the em. But the first factor often causes baseline to cap height, e.g., variation within the same point size across font families.\n\nFrom the energetic use of the two factors, both confusion and completness are found, somewhere.\n\nCheers!\n\n"
    },
    {
      "time": " 29.Mar.2008 5.26am",
      "content": "This is implied by David’s excellent explanation, but I wanted to further emphasize that the notion of “point size” which you refer to, should not be considered an absolute measurement. The only true absolute measurement within a font is the pixels per em size (ppm).  \nYou can request 10 point type, but the number of pixels used to represent the height of the capital “H” will still vary, depending on whether you’re displaying 10 point on a 96dpi display, a 72dpi display, a 600dpi printer, etc etc. The ratio of the em square to the cap height (and other height zones) within the font will remain roughly the same in each of these scenarios, but it won’t be exactly the same. This is mostly due to the effect that hints can have on glyph height zones.\n\nThere are 2 factors that determine the exact ratio of height to em square, displayed ultimately as some number of pixels. First, the outline is scaled, as David described, by scaling the height of the font (which could be derived from several different values, but that’s a complication for another discussion), with the outlines scaled proportionately. Then hints are applied. Remember that hints are specific to a ppm size not a point size (since they need to be related to an absolute value.) You could potentially have hints within a font that nudge x heights, cap heights, descenders, etc, by X number of pixels at Yppm size. This will normally only happen at display sizes, but could happen at up to 72ppm.\n\nHmm, I suppose you’re sorry you asked by now! But this might help explain why you may see variations in cap height to x height ratio, or cap height to em square ration, at different smaller point sizes.\n\nthanks,\n\nJason C\n\n"
    },
    {
      "time": " 29.Mar.2008 5.28am",
      "content": "The classic definition is the distance from ascender to descender, with the caveat that real fonts don’t necessarily conform to this. When fonts were metal, it was the height of the slug. Sometimes there would be a little more room on the top and bottom, by design or by necessity. The software equivalent of that block of lead is the em consisting of 1000 units. Type is sized according to that em, relative to which all the glyph outlines are drawn. If the type designer draws the glyphs smaller relative to the em (possibly out of a worry that diacritics on capitals could collide with descenders at zero leading), a 10pt setting of it will look smaller.\n\n"
    },
    {
      "time": " 29.Mar.2008 5.57am",
      "content": "I very much appreciate the technical comments by Mr. Berlow and Mr. Campbell, but it seems to me that I was not correctly understood. Therefore I added an additional page to the document as the last page\n\n[http://www.sanskritweb.net/temporary/helve90.pdf](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/helve90.pdf \"http://www.sanskritweb.net/temporary/helve90.pdf\")\n\nBoth “Helvetica” words on the last page are congruent, i.e. have the same mathematical size and shape, but they are typeset in different point sizes. Therefore the definition of “type size” is tricky here.\n\n"
    },
    {
      "time": " 29.Mar.2008 10.32am",
      "content": "Uli, what I think may be puzzling you is that a face may be ’large on the body’ or ’small on the body’. In the case of metal type this meant the height and depth of the type relative to the vertical dimension of the metal slug.\n\nIn the case of digital type, the ascender of the h + descender of the g may be less than the digital em. And the height of the A ring, for example, may take the extremes of the characters beyond the limits of the digital em.\n\nIt looks like in your examples of Helvetica 90 and 100, these are simply scaled differently in relation to the digital em. Then boosting the point size and reducing the leading in your application program can get the size and leading of the 90 and 100 to match. As David explained, the final result comes from the combination of the inbuilt size together with the user specified size.\n\nIf you look at it in a font making program like Font Lab, it will take the mystery out of it. You will see how the upm is defined (typically 1000 or 2400), and where the character outlines fall on the grid. Your application program will interpret the character point size and leading—distance from baseline to baseline—according to the user specification of the upm and baseline.\n\n"
    },
    {
      "time": " 29.Mar.2008 2.21pm",
      "content": "“Both “Helvetica” words on the last page are congruent, i.e. have the same mathematical size and shape, but they are typeset in different point sizes. “\n\nThank you for the example. I think the terminology you are using in describing the phenomenon you see, is backwards. I would say, both samples are typeset in the same point size, but they do not have the same mathematical size and shape. You might also say, the two samples were set at the same mathematical point size, but are typesetting at different sizes.\n\nIn this particular instance, it might be assumed that URW, who produced Nimbus, decided to scale the whole face to fit the accented uppercase into the Em, a common practice, and the first kind of sizing I mentioned.\n\n“The only true absolute measurement within a font is the pixels per em size (ppm).”  \nYou are heading out of type space and into device space though it counts eventually, this issue, is size measurement across fonts.\n\nCheers!\n\n"
    },
    {
      "time": " 29.Mar.2008 2.25pm",
      "content": "Uli, I don’t think it is possible to come up with a scholarly definition of _type size._ The phrases you listed are not specific enough to be defined in any absolute way. Forty years ago when I started messing about in type, the meaning was pretty clear. It was whatever read-off my line gauge when I hooked it over the top edge of the piece of metal I had in my hand.  \nBody size, cap height, and x-height all refer to something specific and unambiguous. However, today type size and point size do not. Type size is whatever you choose to measure and point size is that something measured in points. Although, generally speaking, the terms you asked about refer to the notion of body size, where body size is understood to be the native (unleaded) vertical measurement of the font including, in the case of metal type — which is the only place such measurements make any sense at all — all glyphs/strokes/elements that will be set from that singular font. Here font refers to a set of mechanical pieces used to produce printed letters of one style and a pre-determined system of vertical alignment and lateral spacing of those glyphs/strokes/elements.  \nTwo years ago, I asked a similar question about why on earth when some digital fonts are set solid do descenders collide with ascenders of the subsequent line. I received an answer that included the phrase “large on the body,” which I understand as a possible reality in type setting, but fail to understand as a desirable aspect of a system for the reproduction of letters.  \nThus, any definition of _type size_ will depend on whether you are talking about the system to control the size of the letters to be produced, the letters produced, or even some part of the letters produced. Take your pick and stick with it.\n\n"
    },
    {
      "time": " 30.Mar.2008 6.32am",
      "content": "<cite>“Two years ago, I asked a similar question about why on earth when some digital fonts are set solid do descenders collide with ascenders of the subsequent line. I received an answer that included the phrase “large on the body,” which I understand as a possible reality in type setting, but fail to understand as a desirable aspect of a system for the reproduction of letters.”</cite>\n\n1)\n\nThat nobody can supply a satisfactory definition of “type size” is due to the fact that the digital font formats (PS Type 1 etc.), have been primarily developed for American font users only with the consequence that, for instance, nowadays in European languages (French, German etc.), it is no longer possible to “set solid” (e.g. 10 on 10 point) without time-consuming experiments.\n\nsee [http://www.sanskritweb.net/temporary/solid.pdf](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/solid.pdf \"http://www.sanskritweb.net/temporary/solid.pdf\")\n\n2)\n\nAre “large on the body” and “small on the body” also applicable to non-American fonts?\n\nsee e.g. [http://www.sanskritweb.net/temporary/body.gif](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/body.gif \"http://www.sanskritweb.net/temporary/body.gif\")\n\nIs the font depicted here “large on the body” or “small on the body”?\n\nIn my view, such notions do not make sense for non-American fonts.\n\n"
    },
    {
      "time": " 30.Mar.2008 7.17am",
      "content": "\\>In my view, such notions do not make sense for non-American fonts.\n\nIn digital fonts ’large’ or ’small’ on the body is just a question of how the glyphs are scaled in relation to the em. ’Larger’ or ’Smaller’ is in comparison to other fonts in a similar script. It is not a matter of the nationality of the designer. It is true that many fonts today have the height of the A ring or A circumflex greater than the em—a common recommendation is that the total of highest and plus lowest points are up to 20% greater than the em. This is based on the default leading in many applications, including Microsoft Word. [See this](http://web.archive.org/web/20081013234931/http:/typophile.com/node/13081) for a detailed explanation.\n\nTherefore many digital fonts will not set solid without clashes in the diacritics—they often need something between solid setting and 20% leading to keep the highest diacritics clear of the above line of text. Some script fonts have swashes that greatly exceed the em—by more than 20%.\n\nYou seem to want all fonts scaled on the em so that they can set solid, as was the case with metal. But what is so sacred about setting solid? If you rescaled the font by 80% in font software, regenerated it, and put the point size in the application 25% larger you would get the same result. Isn’t what matters what is on the page or screen?\n\n\\>it is no longer possible to “set solid” (e.g. 10 on 10 point) without time-consuming experiments.\n\nIf you don’t want time consuming experiments, you can’t set type well—at least not without a lot of experience, which amounts to the same thing. Fonts, whether in metal or film or digital, have never had the same apparent size at the same point size. This has to be taken into account by the designer wherever you are in the world.\n\n\\>Is the font depicted here “large on the body” or “small on the body”?\n\nYou can’t answer the question of how big a font is on the body by one line. It doesn’t matter whether the font in question is latin, greek, arabic, and indic script or whatever. But you can answer by looking at it in font software, or by setting it on successive lines with highest and lowest extending characters—provided you know what rules your application software follows. And the question does make sense in any script. It doesn’t matter whether the designer is American or German or Indian. The question is the scale of the glyphs relative to the digital em.\n\n"
    },
    {
      "time": " 30.Mar.2008 9.11am",
      "content": "Mr. Bergson:\n\n\\> Word. See this for a detailed explanation.\n\nThe “Update to the update to the update” clearly shows that the “vertical metrics” is a mess. Even Apple and Microsoft application programmers do no longer know what is meant by what metrical values.\n\n\\> The question is the scale of the glyphs relative to the digital em.\n\nCould you please give a concrete numerical example for what you mean by “digital em”?\n\nAs mentioned by me, the plain Roman style of good-old Helvetica (HelveticaLTStd-Roman.otf) has the x-y bounding box of (-166, -225) to (+1000, +931) and uses a 1000 units per em grid. The glyph of “A ring” has the top-most value +931, and the glyph of “c cedilla” has the bottom-most value of -225.\n\nUsing these numerical data, please give the exact dimensions of what you call the “digital em”.\n\n"
    },
    {
      "time": " 30.Mar.2008 10.08am",
      "content": "\\>the “vertical metrics” is a mess.\n\nI agree. This mess seems to be a legacy of the old ’font wars’ with different standards for Windows, Mac, PS1, True Type, and now open type. I understand that such messiness is typical in the software industry.\n\n\\>Could you please give a concrete numerical example for what you mean by “digital em”?\n\nThe font contains a number called the “font upm value”. In Font Lab you can navigate: Font Info/ Metrics and dimensions/ Font UPM Value. It is commonly either 1000 or 2400. Thus the em is really a unit of measurement within the font such that ’one em’ is either a 1000 units or 2400 units, and the nodes, handles and metrics of the font are specified in terms of whole numbers of these units.\n\nWhat is confusing here—to me at any rate—is that the digital em is not defined as a box going from one place to another in the glyph window. You can’t say “the em in this glyph starts here and ends here,” as you could in foundry metal type—it was generally just the height of the metal slug.\n\nBut in fonts the ’em’ is just a unit of measurement. The ’em’ isn’t a thing that starts at the lowest descender and goes to the highest point in the tallest character. That’s got another name—’bounding box’ I think, but I’m not sure. And the ’bounding box’ may measure more or less than one em—and thus be “bigger or smaller on the em.” It would really be better to say “bigger or smaller as measured in em units.”\n\nWhat happens that complicates things is the different applications may define the ’top’ of the font differently. For example, I think Adobe puts the top of the text block at the ascender height. But another application might take the cap height or the highest point in the font.\n\nWhat all applications are \\*supposed\\* to do, anyway, is to make it so that if you specify the font size at ’12 point’, and specify the leading as zero points, then when you print it out, it should physically be 1/6 of an inch from baseline to baseline on the paper.\n\nSo that’s what the ’em’ really is: it is an instruction to scale the output so that the ’em’ as defined in the ’upm’ value is printed out at the correct physical point size as internationally defined.\n\nThanks, I think I now understand this myself!\n\n"
    },
    {
      "time": " 30.Mar.2008 12.10pm",
      "content": "The answer to your original question is no. No one can give a scholarly definition of “type size.” What a scholar could do is chronicle all the different ways the term “type size” has been used. It would be a longish chronicle.\n\nBTW, the digital era is from 1990 to 2008 — or, if you include the likes of the Linotron 202 in “digital” as opposed to “photocomp,” the mid-1960s to 2008. Even 48 years covers only about 10% of the period of “movable type” in the west, and that ignores China.\n\n"
    },
    {
      "time": " 30.Mar.2008 7.17pm",
      "content": "So — just trying to get a grip on this myself — does this mean that a 12 pt specification of a given font in QuarkXpress could lead to a different sized output (to paper) than the same size and the same font output from, say, InDesign? And, if so, does outputting to an intermediary format like pdf introduce any further uncertainty?\n\n"
    },
    {
      "time": " 30.Mar.2008 7.32pm",
      "content": "Where the top of the text box is in relation to the type might change in different applications—and hence the location of the printed output—but the size of the printed output should not.\n\nIf you specify 12/12 pt type in the application, the printed output should always have the baselines 1/6 inch apart.\n\n"
    },
    {
      "time": " 30.Mar.2008 8.13pm",
      "content": "OK, so let me see if I have this:\n\nThe size of a glyph is relative to the size of the em. The size of the em is however an absolute size because there is something in every program which will interpret it to give the same output as some other program operating on that input. (What might change is the calculation of the placement of the text block.)\n\n"
    },
    {
      "time": " 30.Mar.2008 11.29pm",
      "content": "Let’s assume, you make a printout on paper of the last page of the PDF\n\n[http://www.sanskritweb.net/temporary/helve90.pdf](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/helve90.pdf \"http://www.sanskritweb.net/temporary/helve90.pdf\")\n\n(I’ve just added this last page)\n\nIs is possible to measure the size in points of the printed word Type Size?\n\nIf so, what does the printed word Type Size measure in points?\n\n"
    },
    {
      "time": " 31.Mar.2008 3.21am",
      "content": "_Is is possible to measure the size in points of the printed word Type Size?_\n\nThat would depend on what you mean by “size in points”, considering the many possibilities given in this thread.\n\nJens\n\n"
    },
    {
      "time": " 31.Mar.2008 4.03am",
      "content": "\\> That would depend on what you mean by “size in points”\n\nWhat “size in points” do designers mean when they use a type gauge?\n\n[http://www.microtype.com/resources/mtruler.pdf](http://web.archive.org/web/20081013234931/http:/www.microtype.com/resources/mtruler.pdf \"http://www.microtype.com/resources/mtruler.pdf\")\n\n[http://www.misterart.com/store/view/001/group\\_id/1302/C-Thru-Type-Gauge-...](http://web.archive.org/web/20081013234931/http:/www.misterart.com/store/view/001/group_id/1302/C-Thru-Type-Gauge-and-Specifier.htm \"http://www.misterart.com/store/view/001/group\\_id/1302/C-Thru-Type-Gauge-and-Specifier.htm\")\n\n"
    },
    {
      "time": " 31.Mar.2008 4.47am",
      "content": "“Is is possible to measure the size in points of the printed word Type Size?”  \nYes. But because the line between the type size and lead size, if it exists, is invisible to the eye, one does not know if one is measuring type, or type and lead.\n\nThis does not mean, “No one can give a scholarly definition of “type size.” It just means some people simply will not accept “yes” as an answer.;)\n\n“That nobody can supply a satisfactory definition of “type size” is due to the fact that...”  \n...you didn’t accept that was given, preferring to go with, whatever. All scripts that are mechanized, or computerized for composition, use the em. This is not an “American” thing. European text can be set as solid as the presence of accented characters allows. The Em can be defined to exclude or include accents, and the flexibility of the baseline location allows all scripts to function with a flexibe relationship to other fonts and other scripts.\n\n“— does this mean that a 12 pt specification of a given font in QuarkXpress could lead to a different sized output (to paper) than the same size and the same font output from, say, InDesign? “  \nNot likely. All 12 point fonts, set solid (0 leading) , will measure the same distance from baseline to baseline, unless a lack of resolution causes minor differences between one low resolution, and another. E.G. the interline point measure of a 12 pt on zero leading at 72 dpi, may not match a 12 pt 96 dpi. But then again, they would never meet on the same page.\n\nAll one needs to do to prove these things, is make a glyph that is “complete on the body” a full em square character, and see for one’s self, just how it works.\n\nCheers!\n\n"
    },
    {
      "time": " 31.Mar.2008 5.13am",
      "content": "\\>Is is possible to measure the size in points of the printed word Type Size?\n\n\\>If so, what does the printed word Type Size measure in points?\n\nAs David writes, when you measure baseline to baseline on the printed page you measure a sum: point size of type + point size of leading. So to deduce the point size you need to know the leading specified in the application.\n\n\\>What “size in points” do designers mean when they use a type gauge?\n\nIn digital type, what is usually meant is the “postscript point”, which is 72 to the inch or 127/360 mm. The [wikipedia article](http://web.archive.org/web/20081013234931/http:/en.wikipedia.org/wiki/Point_(typography)) explains the different historical redefinitions of the size of the typographers point. If the type gauge is correctly set for the ’postscript point’ then, yes, it would measure correctly.\n\nYou will note that the the baselines of the text of the two different types in the last page of your PDF align. That is as it should be, given that they are set both 10/11 —meaning 10 point type with one point additional leading.\n\n"
    },
    {
      "time": " 31.Mar.2008 5.27am",
      "content": "I start a new quarter of teaching typography today, so your question has helped me concentrate on the nature of type and letters.\n\nIn their bizarre system of scientific nomenclature English scholars, who were educated at the theological universities of Oxford and Cambridge, took Greek roots and pinned them together to denominate the technologies of the 18th & 19th centuries. Thus _photos + graphos_ yields photography.\n\nSo the Greek root of the word _typography — typos + graphos_ refers to a form of writing/marking based on an impression and/or model. All of which infers that _type,_ in its most accurate use, refers not to the letters printed or displayed through the means of some predetermined model mounted on on a block of wood or metal, or configured within some relative system of measurement, but the means by which they reach the page or screen.\n\nAnd as this thread indicates, because the means of measuring this space has been so differently applied by various competing interests that any single definition of type size that applies to all fonts and systems awaits a standardization of a system that daily becomes more diffuse.\n\n_All one needs to do to prove these things, is make a glyph that is “complete on the body” a full em square character, and see for one’s self, just how it works._\n\nThe problem is not one glyph complete on the full em square, it is all the glyphs that make up the font “complete on the full em square.” Accept the em as the limit of vertical height, don’t let any aspect of any font extend beyond the limits of the vertical space, and then we can define _type size._\n\n"
    },
    {
      "time": " 31.Mar.2008 5.40am",
      "content": "\\>any single definition of type size that applies to all fonts and systems awaits a standardization of a system that daily becomes more diffuse.\n\nThis isn’t right, if you are talking about the current definition: it is standard, precise and clear. Digital type size is measured in points, 1/72 of an inch to a point. Digital type which is set solid will measure baseline to baseline according to the specified point size. If not set solid it will measure as type size plus leading. That’s the standard, specified size of the printed type.\n\nWhat isn’t clear is how the actual characters fit on that grid, which font developers can put anywhere they want. But if you measure vertically from one line to the next, you will get standard and consistent results.\n\nWhen you get to screen it is all more complicated, but that is another matter.\n\n"
    },
    {
      "time": " 31.Mar.2008 5.51am",
      "content": "_What “size in points” do designers mean when they use a type gauge?_\n\nhttp://www.microtype.com/resources/mtruler.pdf\n\nHave you read the comment in the PDF file regarding “Font Size”?\n\n_Is is possible to measure the size in points of the printed word Type Size? If so, what does the printed word Type Size measure in points?_\n\nYou can only measure what you can see, so in the last page of your Helvetica PDF you could measure the cap height, the stem width, the x-height, the width of the “T” ... anything you like. If there was more than one line you could also measure the baseline skip. All in points, or in mm if you like.\n\nWhat you cannot measure, because you can’t see it, is the size of the em.\n\nJens\n\n"
    },
    {
      "time": " 31.Mar.2008 6.00am",
      "content": "Charles Leonard wrote:\n\n_Accept the em as the limit of vertical height, don’t let any aspect of any font extend beyond the limits of the vertical space, and then we can define type size._\n\nFair enough, if nothing ever changes in your type design as you go along.\n\nE.g. what should you do if you later extend your font’s glyph repertoire and decide to add an especially unruly character like the A with ring and acute (Ǻ)? Scale all existing glyphs down to fit this one to the em height and make your new version of the font metrically incompatible with the old one? Or accept that some parts just don’t fit on the em and will clash with the descenders?\n\nJens\n\n"
    },
    {
      "time": " 31.Mar.2008 7.01am",
      "content": "I agree that digital type is _scaled_ to fit 72 points to the inch. The root drawing of the glyphs is measured in relative divisions of the line height where line height equals one line.\n\nAll I am trying to point out is that when type was in metal, hot or cold, there were standards of size. Those standards varied across both national and manufacturers borders, i.e. the Inland Standard adopted by ATF and the standard configurations of matrices imposed by the machine disciplines of Linotype and Monotype.\n\nWhen digital type was bit-mapped the data arrays were proportionally constricted and all possible glyphs had to be considered in the design of the fonts.\n\n_what should you do if you later extend your font’s glyph repertoire and decide to add an especially unruly character like the A with ring and acute (Ǻ)?_\n\nSince the fonts will be scaled by the system anyway, why not consider providing space for all potential characters within the limit of one line of vertical measure?\n\nSince English has become the defacto lingua franca — I know, I know , and English doesn’t require character modifiers above or below the line, and the governing operating systems that determine the format of the digital fonts were developed in English speaking environments, it seems to me that the lack of consideration of the needs of other languages is a bit insensitive. More radically I could speak of linguistic imperialism, but that is another subject and direction.\n\n"
    },
    {
      "time": " 31.Mar.2008 7.02am",
      "content": "<cite>All one needs to do to prove these things, is make a glyph that is “complete on the body” a full em square character, and see for one’s self, just how it works.</cite>\n\nI added a square at the request of Mr. Berlow to\n\n[http://www.sanskritweb.net/temporary/helve90.pdf](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/helve90.pdf \"http://www.sanskritweb.net/temporary/helve90.pdf\")\n\n(see final page of this file)\n\nbut I should mention that in the pop-up note of the file\n\n[http://www.microtype.com/resources/mtruler.pdf](http://web.archive.org/web/20081013234931/http:/www.microtype.com/resources/mtruler.pdf \"http://www.microtype.com/resources/mtruler.pdf\")\n\nit is stated that by measuring the cap height you can measure the font size.\n\nFor instance, if you want to measure the headline of the New York Times, you cannot request the editor of the newspaper to add “a full em square” to the headline. But you will have to measure the type size of the New York Times headline without such technical help.\n\n"
    },
    {
      "time": " 31.Mar.2008 7.15am",
      "content": "Another question, going back in the other direction, might be what is the value in setting stacked type? If you approach the type users dilemma, you look at the concepts of economy, fit, predictability, acceptable readability, efficient work process, and suitability to the task at hand. A daily newspaper will not only need to have efficient type that gets all the days news in but it must have predictable type that fits the system of production with minimal fuss. The paper comes out each day—there is no time to muck around. All of these attributes can be solved without stacked type. If you need a given number of characters to fit on a page, the many combinations of x-height, body height leading, line length, h&j, etc., can give you many solutions. The desired outcome is well set type, not stacked type. While the advent of PostScript and digital type has muddied the waters of exact point size definition, it has also given us the tools to quite quickly “experiment” and change settings to solve our typesetting problems with ease. A style sheet can be changed in a flash—certainly faster than resetting foundry type. Newspaper deadlines are shorter than ever and allow story edits up to very near presstime. This is made possible with the digital equipment and never could have been done with hot metal. The language issue is just another attribute. Languages with heavy use of diacritics need a bit more leading. This is not shocking. Another way to look at it is that being large or small on the body is just another way to adjust baseline-to-baseline spacing. Either lead it or pick a type with more generous built in linespace. I don’t see why we must be slaves to a metal ruler when we no-longer need to solve typographic problems with metal type. If we can resolve fit and economy and predictability, etc., with digital means, why would I care if the old sense of stacked type is no-longer viable?\n\nChrisL\n\n"
    },
    {
      "time": " 31.Mar.2008 8.18am",
      "content": "“it is stated that by measuring the cap height you can measure the font size.\n\nThis is not universally true, so the statement is false if it is intended to be universally true.\n\n“if you want to measure the headline of the New York Times...”\n\nIf you want to know the answer in points, you either must have the exact font, or ask for the exact point size. If you want to make a headline that is the same height as another headline, and do not know the point size, you simple try until the two fonts, the headline you are trying to match, and your headline, do match. That is “how it is done” often.\n\n“I added a square at the request of Mr. Berlow”\n\nWell, it was more of a suggestion, but good work. Now, you can compose this EM beside any other font, and assuming all the fonts are set at the same point size, you can see not only the relative size of fonts (to the em), but by setting it down the page, how applications treat leading, and by implication, where the em is in their composition scheme.\n\n”...don’t let any aspect of any font extend beyond the limits of the vertical space, and then we can define type size.”  \nI bet you think they are “your” students too :)\n\nCheers!\n\n"
    },
    {
      "time": " 31.Mar.2008 9.03am",
      "content": "<cite>“it is stated that by measuring the cap height you can measure the font size.</cite>\n\nThis is not universally true, so the statement is false if it is intended to be universally true.\n\nOf course, this is only true for those fonts, for which the measurements have been documented by the foundry. Nowadays, no foundry documents such things any longer. And even the larger foundries such as Linotype do no longer offer printed specimen books containing the full character sets of their fonts, let alone technical details, such as measurements etc.\n\nFor instance, in the 1980s, Berthold documented the following measurements for all its 2000-odd fonts:\n\nH-size = 1 (always 1)  \nx-size = 0.73  \nk-size = 1.00  \np-size = 0.23  \nkp-size = 1.23  \nÊ-size = 1.23  \nÊp-size = 1.46\n\nThe values above were those for Helvetica Roman:\n\n[http://www.sanskritweb.net/temporary/berthold.gif](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/berthold.gif \"http://www.sanskritweb.net/temporary/berthold.gif\")\n\nIn those days, when you came across a single printed letter of a known typeface, it was possible to ascertain the type size of this single letter.\n\n"
    },
    {
      "time": " 31.Mar.2008 9.59am",
      "content": "“In those days, when you came across a single printed letter of a known typeface, it was possible to ascertain the type size of this single letter.”\n\nThen, along came the photostat machine...\n\nChrisL\n\n"
    },
    {
      "time": " 31.Mar.2008 3.26pm",
      "content": "A related question:\n\nI have noticed that Word will sometimes cut off the descenders of a font when the font is viewed onscreen, though the print output is ok. Is this due to an incorrect setting of some number in the font, so that the size is being incorrectly specified, or due to a preset value in Word that is insensitive to the size values set in the font?\n\n"
    },
    {
      "time": " 31.Mar.2008 5.04pm",
      "content": "“I have noticed that Word will sometimes cut off the descenders of a font when the font is viewed onscreen, though the print output is ok. Is this due to an incorrect setting of some number in the font, so that the size is being incorrectly specified, or due to a preset value in Word that is insensitive to the size values set in the font?”\n\nApplications (like Word, XPress, InDesign) work with the Operating System to display text/type on screen. QuickDraw & Quartz on the Mac (I don’t know the equivalent in Windows) are the system components that “serve up” character bitmaps as requested by the application. More “Typographically Advanced” applications (like XPress/InDesign) may add to/do their own bitmap calculations, so they appear more “accurate” on screen, but Word just asks for a line of type and drops it where it thinks it should go.\n\nA lot of faces have ascenders/descenders that extend way beyond what the system expects a “normal” face to be, and these get cut off when the next line is displayed on screen (this is all happening in a fraction of a millisecond). Rather than calculate the exceptions to the norm, the system and the application ignore it in the quest for speed/efficiency.\n\n"
    },
    {
      "time": " 31.Mar.2008 5.42pm",
      "content": "What do you mean by ’scholarly’?\n\nIn order to have a definition of ’type size’ — or any other kind of size — you need to know what you are measuring and how you are measuring it. So the phrase ’type size’ by itself is pretty much meaningless, since it refers only to what is being measures — ’type’ — and not to how it is being measured. There are very many possible ways to measure type, some of which are represented in the digital font file (e.g. cap height, x-height, ascender+descender, etc.). So it is meaningful to talk about the cap size, or the x-height size, and to note that different typefaces at the same _set size_ (see below) may have different cap size or different x-height size, or the same, or a combination of e.g. similar cap height but different x-height etc..\n\nWhen you set type at e.g. 10pt, you have a set size (what I sometimes call a nominal size). Set size is the height of the ’body’ of the type, which in metal type is the height of the piece of metal on whose face the glyph appears, and in scaleable digital type is the scaled em. The relationship of any of the other measures — the cap height, the x-height, etc. — to the em height is free, and needs to be free in order to accomodate typefaces of different vertical proportions (and, these days, scripts of different vertical proportion within the same font).\n\n"
    },
    {
      "time": " 31.Mar.2008 5.48pm",
      "content": "I just wanted to reiterate what Dave Berlow said: the confusion over the definition of type size (which essentially the same issue as the confusion over the definition of “em”) is a consequence of the shift to digital type, and is completely unrelated to the question of the nationalities of those involved.\n\nSee also: [http://en.wikipedia.org/wiki/Em\\_%28typography%29](http://web.archive.org/web/20081013234931/http:/en.wikipedia.org/wiki/Em_%28typography%29 \"http://en.wikipedia.org/wiki/Em\\_%28typography%29\")\n\nIn the history of digital type there have been very many cases of American and English companies being quite insensitive to the needs of the rest of the world. But this is not one of those cases.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 1.Apr.2008 9.40am",
      "content": "I did not mean to imply that current practice sets out to be chauvanistic. But, we are left with some historical artifacts that makes any single definition of type size impossible. We can define letter size, em size, et al. What we cannot say in general is that type set at 100 points will measure 100 points in all features of the setting.\n\nBy way of demo I offer the following image of 100 point Futura — my hobby horse — set solid and displayed with a 100 point em square. In the second row, the p in the current character set is replaced with with an image of a p included in the c. 1928 font released for the German market. The diagram demonstrates that measured cap line to descender the “original face” would fit on a 100 point body. Such measurement still excludes the additional height of the ascender, which could have been kerned in the original casting, but I really doubt it.\n\nThe artifacts of technologies acrue as annomolies in our, imperfect, modern system.\n\n ![](http://web.archive.org/web/20081013234931im_/http:/typophile.com/files/DemoHelp_3620.jpg)\n\n"
    },
    {
      "time": " 1.Apr.2008 10.09am",
      "content": "Mr. Berlow, I do not use possessives with students, courses, nor the woman to whom I am married. Nor am I attempting to argue for a strait-jacketing standard where one specification of size fits all needs. I began by pointing out that a single definition of an imprecise phrase like type size is impossible, and that if the variables were removed from the system we could have a single definition what would fit all cases. If I have to seemed to suggect otherwise, please excuse any confusion I have caused.\n\n"
    },
    {
      "time": " 1.Apr.2008 10.29am",
      "content": "Could please anyone explain to me, why the texts written by Mr. Hudson and Mr. Phinney look, as if they were typeset in 1 point on 1 point, whereas the texts by other contributors such as Mr. Leonard have a legible type size.\n\nsee [http://www.sanskritweb.net/temporary/illegible.jpg](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/illegible.jpg \"http://www.sanskritweb.net/temporary/illegible.jpg\")\n\nI use Win XP and IE 6.\n\nBy the way, this text just written by me is as tiny as the texts written by Mr. Hudson and Mr. Phinney. I did not specify any font size for my text, but entered plain ASCII text.\n\nOr is this an April 1st joke by those who run Typophile?\n\n"
    },
    {
      "time": " 1.Apr.2008 11.26am",
      "content": "Mr. Lenhard:\n\nConcerning Futura, you should give a try to the old Berthold version, because here everything that was needed for German texts (including the capital letter umlaut dots) was entirely inside the em square.\n\nsee [http://www.sanskritweb.net/temporary/futura.gif](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/futura.gif \"http://www.sanskritweb.net/temporary/futura.gif\")\n\n"
    },
    {
      "time": " 1.Apr.2008 12.44pm",
      "content": "\\>is this an April 1st joke by those who run Typophile?\n\nTomorrow you’ll be able to tell whether this is part of a worldwide conspiracy, or just a joke :)\n\n"
    },
    {
      "time": " 2.Apr.2008 8.11am",
      "content": "Uli:  \nThank you for steering me to this version. The fact that in this Berthold version the descenders and ascenders are not as long as in the U.S. version helps explain why in the font in common circulation the face doesn’t fit the line height, and provides a glimmer of why later — post metal — versions of the font are bigger, and visually heavier, than what was intended by Paul Renner and originally released by the Bauer foundry.\n\n"
    },
    {
      "time": " 2.Apr.2008 8.48am",
      "content": "Charles L, the relative length of extenders doesn’t determine whether the glyphs “fit the line height”. This has to do with the scaling of the glyphs relative to the digital em.\n\nAny problems with the look of the font—and I understand that some digital versions are better than others—have to do with the way the glyphs are drawn, not the overall scaling. For the scaling can be compensated for by the way you specify the point size and leading in the digital font.\n\n"
    },
    {
      "time": " 3.Apr.2008 11.17am",
      "content": "Mr. Berkson, understood, one can increase the line setting value of any face to accomodate cap height, ascender, descender, diacritical, and so forth. But what interests me, and this is from a historical point of view, is how, where, and when these various arrangements occurred on the bodies of metal type. How one font can have different sizes at different times and locations of its production. In this context enlarging the font on the em, as appears to have happened in the most common versions of Futura, disguises Futura’s familial relationship to its contemporary serif-less romans — Gill Sans and Kabel.\n\nUli, didn’t mean to highjack the thread. I’ll drop out now. Charles\n\n"
    },
    {
      "time": " 3.Apr.2008 11.41am",
      "content": "\\> Uli, didn’t mean to highjack the thread.\n\nMr. Leonard:\n\nDon’t worry about hijacking :-)\n\nI learnt with pleasure that you published a book about Futura and Renner a few days ago. What beats me is that the book is in English, but the publisher is a German. Is there no interest in the U.S. for such a book?\n\n[http://www.libri.de/shop/action/productDetails/7272678/charles\\_leonard\\_p...](http://web.archive.org/web/20081013234931/http:/www.libri.de/shop/action/productDetails/7272678/charles_leonard_paul_renner_and_futura_383645954X.html \"http://www.libri.de/shop/action/productDetails/7272678/charles\\_leonard\\_paul\\_renner\\_and\\_futura\\_383645954X.html\")\n\n"
    },
    {
      "time": " 3.Apr.2008 1.47pm",
      "content": "Charles—and call me Bill—I don’t think you are ’hijacking’ the thread. I think what you are referring to is something real, and has to do with something lost in the transition to digital type from metal. And maybe it is what concerned Uli.\n\nNow, as I have at last understood it in trying to explain it, the digital em is just a unit of measure within the font, and all applications are supposed to scale the line height (vertical baseline to baseline with no leading) as one em, the point size of the type specified in the application. But the digital em no longer bears a unique relationship to any relative measurement within the glyph. Before, in metal, everything in the glyph was within an em dimension. Now not.\n\nWhat I think may have been lost is that in scaling the type for metal, the size of the characters, as they fitted on the em, were tested to look best or most readable at that size. And the adjustment for size may have involved adjustment of the glyph relative to the em, as well as x height etc. Now, with the ability to resize type at will, the type design is not telling us: this works at this size best. That’s been lost. What’s been gained is more flexibility.\n\n"
    },
    {
      "time": " 3.Apr.2008 1.59pm",
      "content": "“What beats me is that the book is in English, but the publisher is a German. Is there no interest in the U.S. for such a book?”\n\nThere certainly is from me!\n\nCharles, is your book available from a vendor who sells and ships to the U.S.?\n\nChrisL\n\nPS: I remember your thread on Typophile when you announced your thesis and would be interested in purchasing the printed copy.\n\n"
    },
    {
      "time": " 3.Apr.2008 2.55pm",
      "content": "“But the digital em no longer bears a unique relationship to any relative measurement within the glyph. Before, in metal, everything in the glyph was within an em dimension. Now not.”\n\nI beg to disagree, as I understand your phrasing of it. All of a glyph’s measures are in units of the em, so they are ’not’ at all unrelated. Any time one quotes the measure of a glyph or a part of a glyph, it is relative to the upm, and thus are all glyphs properly proportioned into a font in ’units of the em’. Your cap H stem is 100/1000ths of the em, vs. the 111/1000ths of the O’s stem. We just don’t have enough time to say /1000ths every time. And across fonts, these measures, assuming the units per em are the same, (1000, or 2048 per em, e.g.), usefully, are ’1:1’ for comparison.\n\nCheers!\n\n"
    },
    {
      "time": " 3.Apr.2008 3.56pm",
      "content": "I guess I wasn’t being clear.\n\nWhat I was trying to say is just that where the glyph is placed is no longer constrained by having the top and bottom of the character within a vertical span of one em of measurement, as the em is defined in the font. That also means there is less constraint on length of extenders.\n\nAs you say, the same scale is used throughout the font, as the upm is defined centrally for the whole font, not for each glyph.\n\n"
    },
    {
      "time": " 4.Apr.2008 6.46am",
      "content": "_What beats me is that the book is in English, but the publisher is a German._\n\nThe publisher is VDM — Verlag Dr. Müller. The firm is an academic publisher that specializes in POD versions of theses and dissertations. The connection is that prior to 1922 Paul Renner had an exclusive design contract with Verlag Georg Müller, an antecedent firm. The publisher has a web site with links to on-line booksellers, but be warned the book is priced in Euros making it a bit steep in our teensy greenbacks.\n\n"
    },
    {
      "time": " 4.Apr.2008 7.05am",
      "content": "_What I think may have been lost is that in scaling the type for metal … the glyph relative to the em, as well as x height etc._\n\nBill, that is the issue and I agree that flexibility is a worthwhile price. All of which is why while we can agree on a definition of what type size is, its application must vary in every font instance.\n\nSince it is the height of the body, the em, that provides the basis for the units that determine the unit count that controls glyph width, side-bearings, and kern offsets it is initially surprising that the glyph height compared to the em can be so unrestrained. Font designers and engineers spend a great deal of time in defining set width and kerning pairs. And as long as these relative measurements are sensitively set the effective fixed measurement, be it points, millimeters, or barleycorns doesn’t really matter. What does matter, for text columns anyway, is the character count in the setting width.\n\n"
    },
    {
      "time": " 4.Apr.2008 8.48am",
      "content": "Mr. Bergson:\n\n\\> <cite>But the digital em no longer bears a unique relationship to any relative measurement within the glyph. Before, in metal, everything in the glyph was within an em dimension. Now not.</cite>\n\nThis has the drawback that nowadays you cannot set a text solid (e.g. 10 on 10 point) without danger of clipping. Furthermore it is no longer easy to specify the **minimum leading** , i.e. the leading required at least so that clippling of accented letters does not take place, but on the other hand no space is wasted at all on the printed page by too big leading.\n\nHere an example:\n\nI have just received two big lawbooks. Each book comprises approx. 3000 large-format pages printed on India paper. In order to compress as much text as possible into these 3000 pages, the lawbook publisher typeset these huge books in Adobe’s Bembo, 8 on 8 point, i.e. 8 point solid, i.e. without leading. However, when an accented word occurs in the text (e.g. “A circumflex”), it is clipped. Now my question, which is not an easy one:\n\nWhat **minimum leading** is required **exactly** for Adobe’s Bembo Std (BemboStd.otf) so that on the one had no clipping of accented letters takes place, but on the other hand no unnecesary space is wasted on the printed page by too generous leading?\n\nIn the good old days, the answer was easy, because typesetting solid did not result in clipping of accented letters. But today, mathematical calculations are necessary to find out the minimum leading.\n\n"
    },
    {
      "time": " 4.Apr.2008 9.21am",
      "content": "If one were to take Bembo 8pt in InDesign or Quark and type a lowercase “g”, type a return and then type the Acircumflex (or whatever diacritic glyph that is in the text of the book) and then adjust leading to just avoiding overlap, you could quickly make such a determination. I assume the rare Aringacute would be the worst offender (or anything in Vietnamese) but just base your decision on the language used in your book.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2008 9.46am",
      "content": "Sorry, Mr. Lozos, I was speaking of “exactly”.\n\n"
    },
    {
      "time": " 4.Apr.2008 10.13am",
      "content": "\\>no unnecesary space is wasted on the printed page by too generous leading?\n\n\\>I was speaking of “exactly”.\n\n“Too generous leading” is an aesthetic judgment, so there is no ’exact’ you can specify objectively. As far as the minimum leading that will avoid vertical clashes, Chris’s procedure will do that for you.\n\n"
    },
    {
      "time": " 4.Apr.2008 10.26am",
      "content": "“Sorry, Mr. Lozos, I was speaking of “exactly”.”\n\nUli, but it is exactly. You can type any value in the leading field down to 3 decimal places (one thousandth of a point) which is as exact as ever in the history of typesetting. You did not exactly define clipping or overlap in your statement but you can define that for yourself and use that value as the x factor. If clipping is zero then touching is your value. If you consider clipping as 1 thousandth of a point, then use that as the x value. That is much smaller than a brass or copper was in handset type.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2008 10.28am",
      "content": "In photocomposition, the “minimum interline kp spacing” (k set directly below p) was 0.01 mm. So “minimum leading” would mean what was formerly achieved by “setting solid”. Since a 3000-page book may contain innumerable clipping situations, an exact calculation of the minimum leading would be necessary.\n\n"
    },
    {
      "time": " 4.Apr.2008 10.35am",
      "content": "In your example, the value of 0.01 mm is used as exact. In my example, 0.001 points are used as example of exact. Pick either one, the option is yours and not the least bit complex a calculation.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2008 10.45am",
      "content": "Mr. Lozos:\n\nIn the meantime, I made calculations concerning Helvetica (instead of Bembo). Here, the exact minimum leading for any type size of Helvetica Roman is 15.6 % of the respective type size.\n\nsee [http://www.sanskritweb.net/temporary/helve865.pdf](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/helve865.pdf \"http://www.sanskritweb.net/temporary/helve865.pdf\")\n\nHowever, such calculations are not possible for typesetters who are not familiar with font editors so that the ordinary compositor in a printing plant will never be able to calculate the minimum leading required for solid setting of Helvetica, Bembo or any other PS, OTF or TTF font.\n\n"
    },
    {
      "time": " 4.Apr.2008 10.51am",
      "content": "Uli,  \nI don’t have your Bembo so I used another example. Here is a screenshot of Bulmer showing the precise value. It took me 30 seconds.\n\n ![](http://web.archive.org/web/20081013234931im_/http:/typophile.com/files/Uli8_5594.png)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2008 11.06am",
      "content": "Mr. Lozos:\n\nIf you used Adobe MT Bulmer OTF version, then e.g. the “§”-sign would be “deeper” then the “g”, hence the value with “g” would not be exact. In the case of Bulmer, I calculate 8 point on 8.84 point, since the percentage would be 10.5 % for minimum leading.\n\n"
    },
    {
      "time": " 4.Apr.2008 11.10am",
      "content": "As I said before, you can choose which ever glyphs to measure that suit your font, language, and book job. Your calculation of 8.84 sounds quite reasonable.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Apr.2008 7.18am",
      "content": "”...the ordinary compositor in a printing plant will never be able to calculate the minimum leading required for solid setting of Helvetica, Bembo or any other PS, OTF or TTF font.”\n\nAll the data exists in the text of a document and the selected fonts in the formats you name, to do such a calculation, (i.e. all apps can know what glyphs are selected and all of the font formats carry glyph specific extent data). If no one has written a program to sort through the glyph repertoire of a text selection, flag the highest and lowest glyphs and determine the minimal/optimal leading for a given font, I’d be surprised, or maybe not...\n\nThe fact that we don’t have such a thing built-in to apps, I suppose, means composers who care to avoid vertical crashing, do so interactively, as Dez so adroitly demonstrates. Knowing what the glyph repertoire is, checking that tallest glyph against a descender, and leading accordingly. Changing the glyph repertoire can change the answer. Changing the font can change the answer. Changing the size can change the answer. It’s just like, changing the question, can change the answer.\n\nEuropeans have a similar process? Mentally filtering for A-rings, but otherwise leading to taste in the presence of another accented cap vs. the descender. It’s a part of, typography. If a composer wanted only to pour text, and print quality typography, they’ll need to either select from the 1,000’s of fonts that behave ’normally’ relative to their script/glyph use (which many 1000’s of fonts do), write some software as described above, customize some fonts, or a combination of these things.\n\nThe fact that it is not a big problem with digital type, is also the reason the answer to the original question, is not simple.\n\nCheers!\n\n"
    },
    {
      "time": " 5.Apr.2008 10.54am",
      "content": "Huh? No program or calculation is necessary. The piece of data needed is called the font bounding box (Font BBox) and is an intrinsic part of every TrueType or OpenType font. MS Office applications base their standard line spacing on the Font BBox (bbox plus 20%).\n\nIf you are using FontLab, go to File \\> Font Info \\> Metrics and Dimensions \\> Key Dimensions. At the bottom is the Font BBox info. Now, it’s true that FontLab has to calculate this from the glyphs in the font (and it does so automatically), but once the font is made, nobody else does.\n\nFor Adobe’s Bembo Std (licensed from Monotype), I find the BBox by poking it with a tool (could use FontLab, could use OS font APIs if the font were installed), and see that the regular face has a Y min of -233, and a Y max of 896, so the value Uli is looking for would be (233 + 896) or 1129. MS Word’s default spacing would be (233+896)\\*1.2, or 1354.8.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 5.Apr.2008 12.52pm",
      "content": "Thank you very much, Mr. Phinney.\n\nAt last, someone comes along and contributes some arithmetic calculations.\n\nHowever, what was required for the lawbook mentioned above was the **minimum leading** for Adobe Bembo. The **default spacing** will not do here, because it is usually greater than the minimum leading (or minimum line-to-line distance). In case of Bembo, by using the bounding box data supplied by Mr. Phinney, the minimum leading calculation for 8 point Bembo is as follows:\n\n(233+896) / 1000 \\* 8 = 9.032 point\n\nThis means, for minimum leading, you will have to typeset the text in Bembo 8 point on 9.03 point.\n\n(MS Word does not permit of exactly 9.032 point leading or line-to-line space, for it rounds off to 0.05 point fractions).\n\nThe reason, why nobody in this thread could supply a scholarly definition of type size is quite simple: The notion of the type size does not exist any longer, as far as digital fonts are concerned. In the “good old days”, i.e. in the foundry type era, the size of type was measured from the hightest to lowest characters, as shown in this old American printing handbook:\n\n[http://www.sanskritweb.net/temporary/sizeoftype.gif](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/sizeoftype.gif \"http://www.sanskritweb.net/temporary/sizeoftype.gif\")\n\nAnd the scholarly definition of type size usually met with in books at that time was (in my wording) as follows:\n\n**Type size is the vertical dimension from the top of the highest ascender** (in case of Latin types) **to the bottom of the lowest descender, measured in typographical points** (e.g. using the American point = 1/72 American inch).\n\nThis definition for foundry type could be directly transferred to the modern notion of the vertical dimension of the glyph bounding box, but there are three major drawbacks:\n\n- Firstly, the vertical dimension of the bounding box is expressed in relative units, whereas the type size of a foundry type letter was expressed in absolute points.\n\n- Secondly, no user of a word processing program (as opposed to the user of a font editor such as Fontlab etc.) sees this relative numerical unit value of the vertical dimension of the bounding box in his application program (MS Word, Adobe InDesign etc.).\n\n- Thirdly, leading in the sense of foundry type does not exist any longer. Remember: Leading in the foundry type era was the space **between** two lines, whereas the usual word processor programs measure the “line size”, see here for example:\n\n[http://www.sanskritweb.net/temporary/linesize.gif](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/linesize.gif \"http://www.sanskritweb.net/temporary/linesize.gif\")\n\nSo, you cannot enter the “type size”, you can only enter the “line size”, which is defined as the “line-to-line distance”, measured in points. If the old notion of “type size” still existed, then you would be able to enter the “ascender-to-descender distance”, i.e. the **absolute** vertical dimension of the glyph bounding box in points (not in units), but this is not possible (as least not in the word programs known to me).\n\nOne of the absurd consequences of all this is the fact that two congruent headlines may have different “type sizes”, as shown in the beginning of the thread in this file:\n\n[http://www.sanskritweb.net/temporary/helve90.pdf](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/helve90.pdf \"http://www.sanskritweb.net/temporary/helve90.pdf\") (page 10)\n\nIn view of this Helvetica sample shown on page 10, Mr. Berlow said:\n\n“I would say, both samples are typeset in the same **point size** ”.\n\nBut this is not correct, because for the first typeset word “Helvetica”, the “point size” entered in MS Word was 90, and for the second typeset word “Helvetica”, the “point size” entered in MS Word was 100.\n\nIn my opinion, the point size should refer to the vertical dimension of the letters, not of the line, i.e. when you enter e.g. the number “36” for Times as shown here:\n\n[http://www.sanskritweb.net/temporary/linesize.gif](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/linesize.gif \"http://www.sanskritweb.net/temporary/linesize.gif\")\n\nthis should denote that you enter the vertical size in points from the highest to the lowest characters of the font (as specified by relative units through the bounding box).\n\n"
    },
    {
      "time": " 5.Apr.2008 1.07pm",
      "content": "\\>in the foundry type era, the size of type was measured from the hightest to lowest characters\n\nUli, your source is not correct. The type size in foundry type is normally the same as the ’body size’, the vertical height of the piece of metal. This includes not only the face, but also the ’shoulder’ or ’beard’, which is the part of the metal between the face and the edge of the metal block. And for mechanical reasons there was almost always some shoulder.\n\nAnd the face could be smaller or larger on the body. Also sometimes type was also cast on a larger body, so you’d have “12 on 13” or something like that.\n\nSo even in metal things were more complicated.\n\n\\>In my opinion, the point size should refer to the vertical dimension of the letters, not of the line\n\nAs the above indicates, this was not ever true, even for metal type.\n\n"
    },
    {
      "time": " 5.Apr.2008 1.38pm",
      "content": "Mr. Berkson:\n\n\\> Also sometimes type was also cast on a larger body, so you’d have “12 on 13” or something like that.\n\nThis is correct. Technically, for hot-metal text typeset in 12 point on 13 point, you could either set the text in 12 point and insert a 1-line brass reglet for leading. Or you could cast letters containing the 1-point leading as part of the lead-metal body. But this does not change my definition. In both cases, you have 12 point text, irrespective of whether the leading is brass reglet or part of the cast lead-metal letter.\n\nCorrection: “The word “brass” is not correct. For leading, a special alloy was used, harder than foundry type.\n\n"
    },
    {
      "time": " 5.Apr.2008 2.01pm",
      "content": "Uli, maybe I wasn’t clear.\n\nBecause of the existence of the shoulder (which is lower than the face), the body size of metal type is almost always larger than the distance on the face from the top of the highest to the bottom of the lowest character. And how big the shoulders are varied from font to font. Hence even in metal there is not a unique relationship between what is now called the ’bounding box’ and the body or type size.\n\nHence your definition of ’type size’ is not correct for metal.\n\n"
    },
    {
      "time": " 5.Apr.2008 2.13pm",
      "content": "“The reason, why nobody in this thread could supply a scholarly definition of type size is quite simple: The notion of the type size does not exist any longer, as far as digital fonts are concerned.”\n\nThis is what we all have been trying to tell you, Uli. The value in the measurement and how it was done in the metal type era has gone the way of the steam locomotive. A fireman on a steam-powered train years ago could have told you how many shovels full of coal it would take to travel from point A to point B and he would be able to see if enough remained in the coal car for the journey. Today, they would use diesel fuel instead of coal but they would have no need of knowing about calculating coal consumption or translating the rate of coal consumption and translating it to diesel fuel consumption. Today, we use the tools of today for both train travel and copyfitting of type. We can copyfit much quicker and more accurately today than ever before. Yes, this digital way makes obsolete the methods we had become accustomed to but the end result is that we come to a more accurate answer and more speedilly than before. That seems like a fair trade off.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Apr.2008 3.22pm",
      "content": "Although I mostly agree with Chris L, I’d add that there is no techical reason an application could not allow you to set type in terms of the Font BBox size.\n\nActually, Word and its friends do, essentially. The complication is that their base spacing is 120% or 6/5 of the “set solid” BBox value. But you can set spacing in Word as 5/6 of that (0.833333) and set the type solid on the Font BBox. You’ll be doing it without ever knowing what the spacing is in points or any other absolute measurement, but it will work.\n\nThat being said, the problem with this is that heaven help you if you revise the font in a way that, say, adds a glyph that has the effect of enlarging the BBox. Also, sometimes you simply might not want certain glyphs to affect the overall line spacing. Just because there are some big ornaments in the font doesn’t mean you want the spacing of text to loosen, IMO.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 5.Apr.2008 5.44pm",
      "content": "_Actually, Word and its friends do, essentially. The complication is that their base spacing is 120% or 6/5 of the “set solid” BBox value._\n\nAs far as I know, in most situations Word and most other Windows apps use the OS/2 WinAscent and WinDescent values to determine default linespacing, and those values may or may not actually correspond exactly to the font BBox. They certainly shouldn’t be smaller than the BBbox, but in quite a lot of fonts they are padded to provide extra linespacing. There are a few reasons why the OS/2 Win metrics values might exceed the BBox, of which the best would be forward-thinking on the part of the font developer who knows that a future version of the font is likely to include added support for Vietnamese or some other taller glyphs, and in order to be able to both maintain linespacing compatibility and avoid clipping of the new glyphs a canny developer might set the OS/2 metrics larger than the current BBox in anticipation. There have been a couple of times when I really wish I’d done that!\n\nNote also that in Word 2007 the default linespacing in non 2003 compatibility mode is 1.15 spacing.\n\n"
    },
    {
      "time": " 6.Apr.2008 6.30am",
      "content": "Mr. Berkson:\n\n<cite>Because of the existence of the shoulder (which is lower than the face), the body size of metal type is almost always larger than the distance on the face from the top of the highest to the bottom of the lowest character.</cite>\n\nHere you are right too. Later in photocomposition, the “minimum leading” could be zero (although, e.g. Berthold used a default “minimum interline spacing” of at least 0.01 mm), but in hot-metal composition, the “minimum leading” was more than that, due to technical restrictions mentioned by you.\n\n"
    },
    {
      "time": " 6.Apr.2008 6.33am",
      "content": "Mr. Phinney:\n\n<cite>... that their base spacing is 120% or 6/5 of the “set solid” BBox value.</cite>\n\nThis technical information given by you was very useful.\n\nI at once made a test and I confirm your information that e.g. MS Word 10 (run on Windows XP) adds exactly 20%. My test is shown here:\n\n[http://www.sanskritweb.net/temporary/default.pdf](http://web.archive.org/web/20081013234931/http:/www.sanskritweb.net/temporary/default.pdf \"http://www.sanskritweb.net/temporary/default.pdf\")\n\nSee also the “psychiatric note” at the end of the file.\n\n"
    },
    {
      "time": " 7.Apr.2008 5.57am",
      "content": "“Huh? No program or calculation is necessary” and more Thomas, “Now, it’s true that FontLab has to calculate this from the glyphs in the font (and it does so automatically), but once the font is made, nobody else does.”\n\nOh? When the ’font’ contains all of the glyphs for all of the languages, i.e. it is sized to the em and populated with glyphs at the foundry for general use, and not by ’a user’s’ glyph requirements, and the requirement for a particular ’text’ or ’document’, perhaps from use of only english or just numbers, doesn’t use everything in the font, then the font’s bounding box is not the bounding box the user needs to know, if they need to know...you know?\n\nThe calculation of the bounding box required by the particular repertoire for a particular text, does not exist. The bounding box is ’foundry font’ specific, not ’use of font’ specific, understandably, but incompletely in my opinion.\n\nUli: “In my opinion, the point size should refer to the vertical dimension of the letters, not of the line”  \nThen take your opinion, and make a whole library of fonts that work that way. I’ll be waiting with a team of shrinks, or maybe not.\n\nCheers!\n\n"
    },
    {
      "time": " 8.Apr.2008 7.08pm",
      "content": "I agree with both David Berlow’s and John Hudson’s comments above. And I don’t know how I forgot that Windows is using usWinAscent and usWinDescent. These are commonly and by default the same as the font BBox values, but not \\*necessarily\\* so.\n\nRegards,\n\nT\n\n"
    }
  ]
}
