{
  "id": "43682",
  "title": "Font designers & multi year contracts?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Has a font designer ever been signed to an exculsive multi year deal by a font shack like FontFont ...or whomever, to produce fonts just for them?\n\n",
  "author": "Hiroshige",
  "time": "29 Mar 2008 — 10:52pm",
  "uid": "9690",
  "comments": [
    {
      "time": "30 Mar 2008 — 5:20am",
      "content": "In 1929, W.A. Dwiggins made an agreement with Mergenthaler Linotype whereby he would design typefaces only for them. But you're probably looking for something current.\n\n"
    },
    {
      "time": "30 Mar 2008 — 10:30am",
      "content": "So it has been done before, that's great. I was thinking that with today's dramatic increase in font design participation that a few talented designers would have landed the same sort of contract.\n\nPerhaps the internet now gives font designers more creative and financial security. Or, perhaps font shacks just aren't interested in signing design talent to a multi year deal.\n\n"
    },
    {
      "time": "31 Mar 2008 — 6:07am",
      "content": "I could imagine it might be in a foundry's interest to establish such a deal -- something like you might find in book publishing, where a publisher negotiates first right of refusal for a popular author's next several titles.\n\nBut in today's market, I think most freelance type designers would not be interested in any such restrictions.\n\nNote that back in Dwiggins's day, there were no such thing as royalties on sales of type. WAD's agreement amounted to something like a yearly retainer. So this would have been a more attractive arrangement.\n\nThings work differently now.\n\n-- K.\n\n"
    },
    {
      "time": "31 Mar 2008 — 10:46am",
      "content": "I think perhaps Jason Walcott works exclusively for Veer - they have purchased the rights to his whole library, and he still develops new fonts.  \nOr something to that effect.\n\nVeer also have quite a few exclusive fonts by Alejando Paul, but many other of his fonts are available from other sources like FontShop and MyFonts, so he is not completely exclusive for Veer.\n\nOnly examples I can think of offhand...\n\n"
    }
  ]
}
