{
  "id": "43690",
  "title": "Have You Got Fontographer / Any Font Software ?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Yes. Then would you like a Non-Profit Project / Pro Bono Project?\n\nInterested. Then please contact via this web site.\n\nThanks\n\n(This message is also for other \"forums\" where the one forum user visits via their browser bookmarks and clicks)\n\n",
  "author": "fontana",
  "time": "30 Mar 2008 — 6:21am",
  "uid": "25758",
  "comments": [
    {
      "time": "30 Mar 2008 — 6:34am",
      "content": "It's fairly rude to ask for a favor by spamming all over the forums. Once really is enough.\n\n"
    },
    {
      "time": "30 Mar 2008 — 6:48am",
      "content": "Would not like topic change on original message.\n\nnmerriam,  \nI did write \"(This message is also for other “forums” where the one forum user visits via their browser bookmarks and clicks)\"\n\nThanks\n\n"
    },
    {
      "time": "30 Mar 2008 — 7:14am",
      "content": "…which I never really could make sense of, really? Perhaps you could explain that bit to me?\n\nAnd yeah, crossposting excessively doesn't really build up MY goodwill, at least..\n\nMy problem isn't as much with the crossposting, though; it's the fact that your request has nothing to do with the topics of any of the specific forums here... It does belong in \"General discussion\"; not in the \"Release\", \"Type ID\", etc...\n\nSticking a disclaimer on it doesn't make it any more relevant to the forum.\n\n"
    },
    {
      "time": "30 Mar 2008 — 10:31am",
      "content": "If you are claiming to be a non-profit, you'd better be prepared to prove legal 501c3 status. Claiming to be a non-profit when you're not is illegal. Very few people will do pro-bono work for an organization without knowing what that organization does or even what it is is called.\n\nFinally, posting an identical message in several forums on Typophile, none of which are the correct forum for soliciting designers to hire, is extremely rude and inappropriate. Please stop spamming Typophile,\n\n"
    },
    {
      "time": "30 Mar 2008 — 2:28pm",
      "content": "\"Service\" is not a product, the forum postings and similarly utilities you have at your apartments, homes and offices etc are also a \"Service.\" Thus if I have used another \"room\" at the forums for posting a message that some users use frequently and perhaps they are not using all the rooms, then I am also posting a message for them.\n\nThe posting message is relevant for those \"rooms\" where I posted because you could have font designer using a sub-forum at \"Critique\" forum using font software and interested in pro bono work. There is not any \"room\" on this forum for hiring a designer and thus the posting was at the most frequented \"rooms\" where there were more messages. Some messages posted get a nil response and even at a \"room\" where based on the forum name you expect responses. Those postings thus should not have been deleted by the moderators based on the postings as a \"Service\" point.\n\nHow can anyone post the idea that a non-profit project / pro bono project is either (i) illegal (ii) illegal if new and not yet incorporated as an organisation (iii) illegal if abroad (iv) illegal if an organisation abroad and has different incorporation method not same as the system you have in the United States? (v) illegal if it is said that a project is a non-profit project / pro bono project?\n\n**Responding to the following posts:**\n\n<cite>twistedintellect<br>\n30.Mar.2008 7.14am<br>\n<cite><br>\n…which I never really could make sense of, really? Perhaps you could explain that bit to me?<br>\n<cite><br>\nAnd yeah, crossposting excessively doesn’t really build up MY goodwill, at least..<br>\n<cite><br>\nMy problem isn’t as much with the crossposting, though; it’s the fact that your request has nothing to do with the topics of any of the specific forums here... It does belong in “General discussion”; not in the “Release”, “Type ID”, etc...<br>\n<cite><br>\nSticking a disclaimer on it doesn’t make it any more relevant to the forum.<br>\n<cite><br>\nglyphobet<br>\n30.Mar.2008 10.31am<br>\n<cite><br>\nIf you are claiming to be a non-profit, you’d better be prepared to prove legal 501c3 status. Claiming to be a non-profit when you’re not is illegal. Very few people will do pro-bono work for an organization without knowing what that organization does or even what it is is called.<br>\n<cite><br>\nFinally, posting an identical message in several forums on Typophile, none of which are the correct forum for soliciting designers to hire, is extremely rude and inappropriate. Please stop spamming Typophile,</cite></cite></cite></cite></cite></cite></cite></cite>\n\n"
    },
    {
      "time": "30 Mar 2008 — 10:36pm",
      "content": "give it a break, man.\n\nasking for pro-bono work is asking for a certain amount of goodwill, so try and make a little...\n\nhas there been much discussion of job postings on typophile ? what's the policy in general ?\n\n"
    },
    {
      "time": "30 Mar 2008 — 11:36pm",
      "content": "I think more information needs to be posted here? Why not try a free fonts dot com website\n\nglyphobet@: nice\n\n"
    },
    {
      "time": "31 Mar 2008 — 3:07am",
      "content": "\"If you are claiming to be a non-profit, you’d better be prepared to prove legal 501c3 status.\"\n\nI take it you live in the United States. Not everybody does, you know. But 501(c)3 status is a specifically American thing. Many of the non-profit organizations in the world don't have that status, because they are based outside the USA.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "31 Mar 2008 — 2:15pm",
      "content": "I posted a neutral non-profit project / pro bono project message here to get some contacts and I / message get accused of these things:\n\n(1) Spam (nmerriam / Nathaniel Merriam, Austin TX, USA)\n\n(2) Irrelevance (twistedintellect / John Arnor G. Lom, Tromsø, Norway)\n\n(3) Illegality (glyphobet / Matt Chisholm, San Francisco CA, USA)\n\n(4) 'to stop criticizing or behaving in an unpleasant way to someone' (Ch / Ch, Troy NY, USA)\n\n(5) Small Quantity (concrete / Paul Everett, Christchurch, New Zealand)\n\nThen also my messages get deleted without any good reasons by the moderator/s.\n\nAll this detours away from the original message's purpose and as a result perhaps there is not any response and perhaps because there is peer pressure by:  \nnmerriam / Nathaniel Merriam, Austin TX, USA.  \ntwistedintellect / John Arnor G. Lom, Tromsø, Norway  \nglyphobet / Matt Chisholm, San Francisco CA, USA  \nCh / Ch, Troy NY, USA  \nconcrete / Paul Everett, Christchurch, New Zealand\n\n**Responding to the following posts:**\n\n<cite>Ch<br>\n30.Mar.2008 10.36pm<br>\n<cite><br>\ngive it a break, man.<br>\n<cite><br>\nasking for pro-bono work is asking for a certain amount of goodwill, so try and make a little...<br>\n<cite><br>\nhas there been much discussion of job postings on typophile ? what’s the policy in general ?<br>\n<cite><br>\nconcrete<br>\n30.Mar.2008 11.36pm<br>\n<cite><br>\nI think more information needs to be posted here? Why not try a free fonts dot com website<br>\n<cite><br>\nglyphobet@: nice<br>\n</cite></cite></cite></cite></cite></cite></cite>\n\n"
    },
    {
      "time": "2 Apr 2008 — 7:10pm",
      "content": "hi fontana,\n\nyou might have more luck by describing your project  \nin a little more detail. what is the (non-profit)  \norganization? what are its aims? what is the context  \nand scope of the project?\n\ni for one would be wary of responding to such a  \nvague request (as your original request appears).\n\njarrod\n\n"
    },
    {
      "time": "5 Apr 2008 — 12:20pm",
      "content": "I would suggest you not rush to any wild ideas about the status / stage etc.\n\nThere is the email facility at this website for registered users and should you be interested to put your typeface tools to work for a Non-Profit / Pro Bono Project, please send email.\n\n**Responding to the following post:**\n\n<cite>begsini<br>\n2.Apr.2008 7.10pm<br>\n<cite><br>\nhi fontana,<br>\n<cite><br>\nyou might have more luck by describing your project<br>\nin a little more detail. what is the (non-profit)<br>\norganization? what are its aims? what is the context<br>\nand scope of the project?<br>\n<cite><br>\ni for one would be wary of responding to such a<br>\nvague request (as your original request appears).<br>\n<cite><br>\njarrod<br>\n</cite></cite></cite></cite></cite>\n\n"
    }
  ]
}
