{
  "id": "43710",
  "title": "Bad typefaces used well?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nSo I'm a young designer, about two years out of school. I still run into a lot of people my age that LOVE to talk about their hate of Sand and Curlz. My first guess is that they love the sound of their own voice. My second guess is that they love to sound pretentious. I guess this may be a little juvenile to talk about, given the contributors here at typophile, but I always had it in the back of my mind that perhaps a good typographer could make lead look like gold. I have a gut feeling that as awful as some of these typefaces turned out, the designer must have known what they were doing.\n\nDo people really have a right to pan these fonts wherever they appear, or do they have places in which they actually work? Has anyone here been forced by a client to use one of these \"forbidden\" fonts? Why were they created in the first place?\n\nI would love to see a \"bad\" font validated. I know \"bad\" font is somewhat vague, and in the eye of the beholder, but I think we all know all the preloaded/bundled display fonts I'm talking about.\n\n",
  "author": "Chipman223",
  "time": "30 Mar 2008 — 9:13pm",
  "uid": "26908",
  "comments": [
    {
      "time": "30 Mar 2008 — 9:58pm",
      "content": "Selecting a font is a matter of selecting a costume that fits the occasion. Most of the funky fonts are useful for just a couple of words as a substitute for and illustration. To quote Dr. Irwin Corey \"Beauty in in the Behind of the Beholder\".\n\n"
    },
    {
      "time": "30 Mar 2008 — 10:13pm",
      "content": "I think that ubiquity of misuse can cause a typeface to be bad in any context. It is impossible to see typefaces like Sand and Curlz in almost any context without naturally making the connection with flyers for barbeques and things like that.\n\nWhat I'm more interested in is whether typefaces that are not novelty faces but are still considered bad, like Arial, have any sort of effective use.\n\n"
    },
    {
      "time": "31 Mar 2008 — 12:53am",
      "content": "[http://www.typophile.com/node/39353](http://web.archive.org/web/20131013050510/http:/www.typophile.com/node/39353)\n\n"
    },
    {
      "time": "31 Mar 2008 — 4:31am",
      "content": "It is too easy for people to bond by attacking an easy target. Ever hear old men hate on Hillary? People can be on the same team if they can identify a common enemy. It is just a social nervousness.\n\nEverything is a tool. The second something is perceived as useless or wrong it gains some power. That power can be useful. Our industry tends to be very derivative, with set concepts of what is good. If you can cut against the grain and make something undeniable in its appeal that is off trend, you may find you have created a new trend.\n\n"
    },
    {
      "time": "31 Mar 2008 — 5:21am",
      "content": "<cite>. . . I always had it in the back of my mind that perhaps a good typographer could make lead look like gold.</cite>\n\nI think you've been answered well here, but a little addition on this point. I don't think so. A good typographer can sometimes allow an appreciation of lead. But it is touchy, the same as using a visual pun that many readers won't get. Successfully tarting something up has to follow the first rule of medicine: do no harm. If you can achieve that and add to the enjoyment of those when appreciate your pun -- or use of lead -- you're a good typographer.\n\n"
    },
    {
      "time": "31 Mar 2008 — 5:58am",
      "content": "Avante Garde is a good example of a typeface that was verboten when I was in school, but recently found a revival by those who discovered its excellent alternates and unique ligatures set. It went from being a bad substitute for Futura, to being a dynamic display face (as was intended). It's now a trendy typeface that pops up all over. I'm not sure that Papyrus will ever get to that point, but who knows? Sometimes it takes one clever designer to help the rest of us to see with unbiased eyes. Another example is Dave Eggers' _McSweeney's_ using Times New Roman on its cover in an intriguingly complex design. TNR isn't bad, just often abused and as common as dirt. And now that design aesthetic has been reproduced by other designers.\n\n"
    },
    {
      "time": "31 Mar 2008 — 8:15am",
      "content": "Craig- Thanks for the other thread. I seem to have violated the thread mandate to thoroughly search for previously posted topics.\n\n"
    }
  ]
}
