{
  "id": "43732",
  "title": "Typophiles here who are color synesthetes?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm curious to know if any type designers here have color synesthesia and whether it influences or inspires your work.\n\nI don't know how this would manifest, but -- well, that's why I'm asking. This is just a personal query, something I've wondered about for years, nothing to do with research.\n\nI have it but am not a type designer. It doesn't influence my print design work, but I do occasionally employ it in my abstract art.\n\nColor synesthesia is perceiving specific colors associated with letters and numbers. See description at [http://en.wikipedia.org/wiki/Grapheme-color\\_synesthesia](http://web.archive.org/web/20131109014242/http:/en.wikipedia.org/wiki/Grapheme-color_synesthesia \"http://en.wikipedia.org/wiki/Grapheme-color\\_synesthesia\")\n\nThanks to [Alessandro](http://web.archive.org/web/20131109014242/http:/typophile.com/user/9599) for references in an earlier post.\n\n--Suzanne\n\n",
  "author": "Suz_Syn",
  "time": "31 Mar 2008 — 9:22am",
  "uid": "28078",
  "comments": [
    {
      "time": "31 Mar 2008 — 10:02am",
      "content": "I don't have it and would probably find i distracting if I did. Can you explain what it feels like or how it affects your work?\n\nChrisL\n\n"
    },
    {
      "time": "31 Mar 2008 — 10:22am",
      "content": "I have it slightly. It's greyscale for me and only has to do with numbers, dates, times of year or week. I can't say it has influenced my design work at all but I have considered working with it somehow in my fine art. I have sketched it out a little.\n\nChris, as far as I can explain it, when I think of a number, or a date, I see it kind of in a greyscale continuum. I can't explain why some numbers are lighter and others are darker. I can picture the year in the same way, different months have different tones.\n\n"
    },
    {
      "time": "31 Mar 2008 — 12:44pm",
      "content": "To me, it's as if there's a transparent overlay of color over a letter. I see type as black (or whatever the ink color is), but also sense/perceive a color to each letter and number. It's helpful in recalling names and phone numbers -- \"no, it's more green than that; must be a 4, not a 9\" -- and spelling.\n\nIt doesn't matter which typeface it is, though the bolder the glyph, the stronger the perceived color. It works in handwriting, too.\n\nGreyscale continuum, Patty -- cool! (BTW, \"grey\" is more grey than \"gray.\")\n\n--Suzanne\n\n"
    }
  ]
}
