{
  "id": "4374",
  "title": "Typophile Books",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is anyone still keeping up with the Typophile Books?   \n [http://typophile.com/booktracker/](http://web.archive.org/web/20131020205502/http:/typophile.com/booktracker/)\n\n",
  "author": "Isaac",
  "time": "20 Apr 2004 — 3:01pm",
  "uid": "540",
  "comments": [
    {
      "time": "20 Apr 2004 — 6:26pm",
      "content": "The latest talk about this project can be found [here](http://web.archive.org/web/20131020205502/http:/www.typophile.com/forums/read.php?file=/4105/13144.html).   \n   \nBasically, Jared said:   \n   \n_... I'm still making them ..._\n\n"
    },
    {
      "time": "20 Apr 2004 — 7:03pm",
      "content": "Right. I just saw that some books had pages to look at while others didn't, and thought maybe some got lost along the way. Jared must be a busy guy, so I won't complain too much.\n\n"
    },
    {
      "time": "21 Apr 2004 — 12:51pm",
      "content": "Grant's recent inquiry into this has prodded me back into action on this project. I had three books destroyed by an irresponsible paper cutter and it really sunk my sails for a bit. But I'm back in the saddle on it and hope to get the other books out before too long.   \n   \nThe short story on the project is this: One book disappeared the moment I gave it at TypeCon to an East Coast student, a second book has been to Russia (and back? I've lost this one as well, but heard it went to the last ATypI conference) and the third one, our most prosperous, has been bouncing around Brazil for months. I have some images to post on that one.   \n   \nIn the meantime I've been building a new world-map flash engine to track each book and potential recipients in the vicinity, as a sizeable number of people would like to participate.   \n   \nIf anyone has any sightings of the book(s) in question, please post it here.   \n   \nLast sightings:   \nBook 18: Alexander Bohn (East Coast) / 23 July 2003 - (email: [bohnal@rpi.edu](mailto:bohnal@rpi.edu) - Please help us track him down!)   \nBook 19: Graziella Iacocca (Sao Paolo) / 21 Jan 2004 (our most active book to date)   \nBook 20: Vladimir Yefimov (Moscow) / 8 Aug 2003 (did this go to AtypI?)   \n   \njb\n\n"
    }
  ]
}
