{
  "id": "43766",
  "title": "Big Foundries in Europe",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello, I was wondering which big foundries today have their HQ or main offices in Germany.\n\nMy quick research gave me Linotype and Fontshop... Is that right? -- Are there some more? (Even though Linotype belongs to Monotype now, right?)\n\nAlso more generally, which big foundries are situated in Europe ex Germany.\n\nI do have the impression that all the big contemporary font foundries and libraries are situated in the US.\n\nThanks, guys!\n\n",
  "author": "aszszelp",
  "time": "1 Apr 2008 — 2:26am",
  "uid": "25546",
  "comments": [
    {
      "time": "1 Apr 2008 — 2:53am",
      "content": "What is a \"big foundry\"? ;-)\n\nOther \"big\" German foundries:  \n [http://www.urwpp.de/english/home.html](http://web.archive.org/web/20131020155157/http:/www.urwpp.de/english/home.html \"http://www.urwpp.de/english/home.html\")  \n [http://www.elsner-flake.com/](http://web.archive.org/web/20131020155157/http:/www.elsner-flake.com/ \"http://www.elsner-flake.com/\")\n\n"
    },
    {
      "time": "1 Apr 2008 — 3:26am",
      "content": "\"What is big\" is a good question. I'll \"define\" (or at least will make it more clear what I mean) it futher below.\n\nOf course, URW++, I should have thought of that.  \nBut isn't Elsner-Flake pretty small (headcount), with a big fonts repertoire?\n\nSo basically I meant the size not in font repertoire aspect alone (though there will be correlation), but more from the economic size (revenue?, capitalisation?) and employee numbers point of view.\n\n"
    },
    {
      "time": "1 Apr 2008 — 3:57am",
      "content": "<cite>But isn’t Elsner-Flake pretty small (headcount), with a big fonts repertoire?</cite>\n\nThere certainly are other folks around here who are more qualified to answer this, but afaik, Fontshop International/FontFont (the foundry, not the distributor) is rather small in headcount, too.\n\n"
    },
    {
      "time": "1 Apr 2008 — 4:25am",
      "content": "Ok, I might have been blurry, I do include the distribution business as well. Clearly, foundry, in a strict sense _produce_ fonts, in the wider, however, are distributors.\n\nPlease go on, guys, and thanks for the replies so far.\n\n"
    },
    {
      "time": "1 Apr 2008 — 4:39am",
      "content": "While there are a big number of small, great and independent typeface designers living and working in Germany, the only \"Big Foundries\" with a \"high\" number of employees (what do you compare this too?; even their numbers are not very large…) are FontShop/FSI and Linotype.\n\nAside from the UK, no other European countries have big foundries, although just about every country has a number of great studios, smaller foundries, and star typeface designers.\n\nIn the UK, Monotype has a large and historic office. And then there are bigger studios, like Dalton Maag and FontSmith.\n\nThe US is still a champion of industry, at least in the very small world of digital type. But that really wasn't your question.\n\nI don't think that there are any secret, big foundries hiding in the corner :(  \nThe reason that you can't find any more big names in Germany, other than Linotype, FontShop, Elsner & Flake, and URW++, is because there aren't any others. If there were, you would hear about them. The old metal type names are gone (Stempel was bought by Linotype, although a spin-off company still sells metal fonts, Bauer has moved to Spain, and the East German TypoArt conglomerate of all pre-war eastern foundries seems to have dissolved into thin air in the early 1990s).\n\nTake heart that the \"not Big Foundries\" like FontFarm, Lazydogs, Volcano Type, etc. are still churning out interesting type for the German and international design market, too. The number of employees that one has is not enough to make one great ;-) great typefaces and great fonts make one great!\n\n"
    },
    {
      "time": "1 Apr 2008 — 5:39am",
      "content": "Dan, I was by no means asking for the \"Big Ones\" in search of \"great type\". On the contrary, I believe, most notable designs come from independent foundries. Well, there are some contemporary notable ones from the Big Ones as well, but compared to their size, capitalisation, etc. the small independent shops do an incredible job, and are in my \"I like this font\" list overweight! They are in my view the drivers of innovation and good designs.\n\nStill, I wanted to make sure I did not miss out any.\n\n"
    },
    {
      "time": "1 Apr 2008 — 7:33am",
      "content": "Another question is what employees are you wanting to count? If you are speaking in terms of designers, then a 'big' foundry might have 3-5 people designing full time. But there is this exponential curve of No. of employees x revenue... So when you are speaking of big (business) companies the number of employees will be drastically larger, but not necessarily in the design department. Most of these extra people though are to support the customers, make sales, make sure people get paid and the checkbook is balanced, etc.\n\nBut anyway, your question has been answered already. I only point this out because it was eye-opening for me to see how 'small' most companies really are - despite their overall size or what they produce.\n\n"
    },
    {
      "time": "1 Apr 2008 — 9:48am",
      "content": "I actually meant all the supporting staff included.\n\n"
    }
  ]
}
