{
  "id": "4383",
  "title": "Font inspired by hebrew as well as arab scripts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,   \n   \nfor my final project at university I'm making a (latin) typeface that is inspired by the hebrew as well as the arab scripts. What I really want to do is to make a typeface that is inspired by two very different and almost opposite scripts (though I found there are also a lot of similarities between them). So what I did in the end is that the bottom part of my typeface is arab inspired and the upper part is hebrew inspired. I have an example here ... does anyone have any suggestions, things that I did that I really shouldn't do or do different ?? All comments are welcome.   \n   \nIne   \n   \n ![example](http://web.archive.org/web/20131015104938im_/http:/www.typophile.com/forums/messages/4100/33944.gif)\n\n",
  "author": "ine_beerten",
  "time": "21 Apr 2004 — 3:15am",
  "uid": "2937",
  "comments": [
    {
      "time": "21 Apr 2004 — 10:18am",
      "content": "Congratulations, this is looking very good.\n\n"
    },
    {
      "time": "21 Apr 2004 — 10:34am",
      "content": "Very beautiful, I wish that good stuff like that help to bring peace in middle east.   \n   \nThis concept remind me a bit Per Jorgensen typefaces done for FontFont couple years ago.\n\n"
    },
    {
      "time": "21 Apr 2004 — 10:39am",
      "content": "Perhaps the \"a\" can be improved; It look a bit to constructed and large with his middle horizontal line?\n\n"
    },
    {
      "time": "21 Apr 2004 — 12:16pm",
      "content": "Wow, what an interesting typeface this is! I really liked your idea of putting together \"upper-lower\" parts of letters from both languages to conceive a new face.   \n   \nIssues I think you should consider: i+j looks like a \"y\". the \"p\" is very courageous, maybe make a subtler version of it?   \n   \nThe false \"dagesh dots\" that make the \"f\" and the \"m\" make those letters a bit hard to decypher, I'm trying to think of maybe a different way to incorporate them... Maybe consider using a false Arabic \"hamsa\" instead of Hebrew \"dagesh\"?   \n   \nThe \"e\" is also a bit harsh for me, but I'm all run out of ideas on this one... :\\>   \n   \nBasically that's a very well-done, innovative study of semitic letterforms. I'm very surprised to see it coming all the way from Antwerpen! Good job.\n\n"
    },
    {
      "time": "21 Apr 2004 — 1:10pm",
      "content": "Congrats! ![:-)](http://web.archive.org/web/20131015104938im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nI agree with Meir on his remarks though.   \nI think the key for solving the weaker letters would be to refare to the direction and dynamics of the letter rather than only to its final shape.   \nThe 'e' for example is a classic case where the mix does resemble the desired shape but the directions of the two scripts are opposite, more or less like the political situation here, it makes the letter unquite and tense. So to give us more hope of finding a mutual language in the middle east (and to further develope your already excelent project) try to find a way for the opposite energies to combine towards coexistance.\n\n"
    },
    {
      "time": "22 Apr 2004 — 9:49am",
      "content": "Wow. This is as well-executed as it is fascinating, and sensitive! A font might not suddenly cause the warmongers to lay down their arms, but thinking about peace can only help.   \n   \nThis is the only font I've seen that combines two scripts to convey a third! When I write my book :-) about formal \"migrations\" in writing systems this will definitely be included. And there's some great details that help it avoid being a gimmick (unlike FF Falafel, which I find unsatisfying). Like the way you've carried over some phonetic stuff is really cool: the \"b\" has the dot from Arabic baa', the \"p\" has the triple-dot from the Farsi pe, and the \"y\" has the double from the Arabic yaa'! Very clever. And I like that the \"i\" has two dots to contrast it against the \"j\".   \n   \nLegibility: there do seem to be problems, but I think you want to maintain _some_ ambiguity.   \n   \nStylistically the only big problem is the \"a\": that thin line isn't cutting it. You can try either using the capital form, or giving the \"a\" an ascender to gain room in the x-height - note that in the \"a\" the bowl is more important than having a strong top.   \n   \nI do however see a major \"ideological\" issue: if you really want to make the Hebrew and Arabic equals, it's not working - the former is too strong here. There are some details (like most of the terminals) that are pushing the whole too far towards Hebrew. I can thing of four things you can try, probably in some combination:   \n   \n1) Keep the x-height stuff Hebrew-looking, but make the ascenders Arabic (like the descenders). What's nice about this approach is that Hebrew is essentially an \"x-height\" script while Arabic is the opposite, so it makes perfect sense!   \n2) You're mixing Hebrew and Arabic style dots. I wouldn't get rid of all of the former (like in the \"m\" it's great), but maybe shift the balance a bit to the latter.   \n3) Add more angularity. Especially in the \"diagonals\", like u/v/w. This will make it feel like some Arabic newspaper fonts, while angularity seems to be much less common in Hebrew settings.   \n4) Those tagin (\"crowns\"?) are too evocative of the torah. I would either remove them, or add some qur'aan marks - there's a whole constellation of them, some very beautiful. But personally I would avoid both - after all, you don't have to be religious to benefit from Hebrew or Arabic.   \n   \nBut please, whatever you do, do finish and release this font!   \n   \nhhp\n\n"
    },
    {
      "time": "22 Apr 2004 — 8:04pm",
      "content": "The only suggestion I could make here - the pointing you've built is very beautiful; I'd love to see alternates with different (or no) pointing in a finished version; it'd allow for really interesting variation in slightly longer display texts. (It'd also give you the room for more fancy Torah/Qur'an marks.)\n\n"
    },
    {
      "time": "28 Apr 2004 — 6:04am",
      "content": "thank you for all these positive replies.   \nI've changed the a, though i'm still not completely satisfied with it. I also decided to loose the tagins for this version, maybe I will also make a version with torah and quran marks, but I don't have any information yet about Quran marks. Are there any websites or books about this ? I also agree that the ij-combination looks to much as a y, so I made a different i, for this combination.   \n ![example a](http://web.archive.org/web/20131015104938im_/http:/www.typophile.com/forums/messages/4100/34536.gif)\n\n"
    },
    {
      "time": "28 Apr 2004 — 11:04am",
      "content": "[http://www.unicode.org/charts/PDF/U0600.pdf](http://web.archive.org/web/20131015104938/http:/www.unicode.org/charts/PDF/U0600.pdf)   \n   \nhhp\n\n"
    },
    {
      "time": "8 Oct 2004 — 12:34pm",
      "content": "This was featured in that recent issue (#4, \"Gruppe 11\") of Spatium, btw. It's a must-read for anybody who gets turned on by cultural migration and expressions of variety.   \n   \n [http://www.spatium-newsletter.de/index.php](http://web.archive.org/web/20131015104938/http:/www.spatium-newsletter.de/index.php)   \n   \nhhp\n\n"
    },
    {
      "time": "23 Nov 2004 — 4:42am",
      "content": "Ine, I saw the nice font you did. A great job keeping the two in one font with the geace and elegance.   \nI am sure you have read the comments by now and I would add that the Hebrew is too dominant, in shape as well as in direction. Being a hebrew speaker, I am tempted to read this RTL which might miss the point, right?\n\n"
    },
    {
      "time": "18 Jan 2005 — 10:35am",
      "content": "Is this font available commercially?\n\n"
    },
    {
      "time": "18 Jan 2005 — 10:35am",
      "content": "Is this font available commercially?\n\n"
    },
    {
      "time": "8 Oct 2004 — 12:25pm",
      "content": "Gorgeous.\n\n"
    }
  ]
}
