{
  "id": "43866",
  "title": "Microtypographic Features (protrusion and font expansion): are they essential typographic tools?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am thinking of switching from Latex to Xetex, just because of the font facilities in Xetex — but Xetex doesn’t provide the microtypographic features of Latex: protrusion and font expansion. These are pretty subtle effects, but I find that they do make a difference in certain situations (e.g. with long documents or with pages that have narrow columns). It’s not an obvious difference, but the small adjustments do make a slight improvement in the justification line. I understand that InDesign also offers microtypographic features (since August 07, according to Wikipedia).\n\nWhat do people think of these features? Are they an essential part of modern typography? (Even though they are, as practices, actually very old.)\n\nRoss\n\n",
  "author": "<a href=\"/web/20091225143451/http://typophile.com/user/28986\" title=\"View user profile.\">rosslaird</a>",
  "time": "<br>",
  "uid": "28986",
  "comments": [
    {
      "time": " 3.Apr.2008 6.16pm",
      "content": "If I understand the features you are talking about correctly, they are useful only when their effect cannot be seen. Secondly, they are useful only when you can apply them globally (i.e., automatic, but with some penalty), rather than having to apply them as you see a need.\n\nWe used a set of our own macros with Plain TeX for 20 years, and did not have these features (we did write a letterspacing routine, which you absolutely have to have). And so, found other ways to achieve the same ends — handling lines that were only a trifle overset. If a line is overset — at least, with plain TeX, you see the value. In most lines, you will find one or more wordspaces surrounded by a pair of letters where optically, a lettle less space in that wordspace is needed. Take your overset values out of these spaces, and get a better line/paragraph. But of course, this isn’t automatic.\n\nThe point is every layout engine has pluses and minuses, you just have to decide what is best & easiest for you.\n\n"
    },
    {
      "time": " 4.Apr.2008 5.50pm",
      "content": "I use XeLaTeX, with Fontspec as an interface to the font calls, and yes, I do miss margin kerning. Font expansion I tend to think of as a mistake, and always turn it off, but margin kerning in LaTeX was great and is now, finally, implemented properly.\n\n"
    },
    {
      "time": " 5.Apr.2008 12.19pm",
      "content": "Thanks for the replies.  \nYes, it’s the margin kerning that I am mostly thinking about. It’s a very cool feature of the microtype package, and actually makes differences that I can see both in terms of the visuals on the page (a margin that looks straighter, even though it is technically more crooked!) and in terms of a reduced number of over and under set lines. I suppose I’ve decided that the appeals of the fontspec package — all the ways in which it opens up the OpenType features — are more beneficial than microtype overall. But still, I wish I could have both. From the discussions on the xetex info page, ( [http://tug.org/mailman/listinfo/xetex](http://web.archive.org/web/20091225143451/http:/tug.org/mailman/listinfo/xetex \"http://tug.org/mailman/listinfo/xetex\")), it doesn’t look like that is going to happen anytime soon.\n\nRoss\n\n"
    },
    {
      "time": " 5.Apr.2008 4.12pm",
      "content": "I think this is one of the areas where XeTeX’s relative youth is a disadvantage.\n\nAlthough it is not quite a subtle as margin kerning, it is possible to set up hanging punctuation in plain (Xe)Tex and (Xe)LaTeX. This would give an alternative “default” which might be appropriate in certain circumstances.\n\n-Jacob\n\n"
    },
    {
      "time": " 5.Apr.2008 4.52pm",
      "content": "“it doesn’t look like that is going to happen anytime soon.”\n\nIt took years just to get this neatly implemented in LaTeX with the microtype package. Before then it was a bit of a hack, what with protcode.foo.\n\nIt may take a third party package in this case as well. I suspect Jacob is right — XeTeX is just a bit too young.\n\n"
    },
    {
      "time": " 5.Apr.2008 6.01pm",
      "content": "Here are some responses from Jonathan Kew (XeTeX creator) and others about the pdflatex microtypographic facility and its likelihood of being implemented in XeTeX:\n\n[http://tug.org/mailman/htdig/xetex/2008-March/008945.html](http://web.archive.org/web/20091225143451/http:/tug.org/mailman/htdig/xetex/2008-March/008945.html)  \n [http://tug.org/mailman/htdig/xetex/2008-February/008865.html](http://web.archive.org/web/20091225143451/http:/tug.org/mailman/htdig/xetex/2008-February/008865.html)  \n [http://tug.org/mailman/htdig/xetex/2007-September/007420.html](http://web.archive.org/web/20091225143451/http:/tug.org/mailman/htdig/xetex/2007-September/007420.html)  \n [http://tug.org/mailman/htdig/xetex/2007-July/006964.html](http://web.archive.org/web/20091225143451/http:/tug.org/mailman/htdig/xetex/2007-July/006964.html)  \n [http://tug.org/mailman/htdig/xetex/2006-August/004731.html](http://web.archive.org/web/20091225143451/http:/tug.org/mailman/htdig/xetex/2006-August/004731.html)\n\n"
    }
  ]
}
