{
  "id": "43879",
  "title": "Bring out your ligatures.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm at the metrics and kerning stage now with my first serif -- a roman book face of standard weight. But before I start the endless tweaking I want to make sure everything is in order and my character set is nice and complete. I made a handful of (more-or-less accidental) discretionary [ligatures](http://web.archive.org/web/20150223073914/http:/typophile.com/wiki/ligature) in addition to the standards along the way and I was wondering if anyone has suggestions for other ones. I realise some would be, let's say 'indulgent', but it would be interesting to get a list going, useful for my particular design or not. My searching drew a blank on this one.\n\nSo let's hear 'em, serious or silly. (Unicode references would be handy for them too - I don't have them for my discretionary ones.)\n\n**The standards**\n\nff, fi, fl, ffi, ffl, AE, ae, OE, oe, eszett\n\n**Discretionaries**\n\nst, ft, ga\n\n",
  "author": "olho",
  "time": "4 Apr 2008 — 3:27am",
  "uid": "26242",
  "comments": [
    {
      "time": "4 Apr 2008 — 4:11am",
      "content": "Hi Mark,  \nÆ, æ, Œ, œ and ß are different from ‘fi’ etc., they can’t be referred to as ‘true ligatures’ anymore. They are ‘stand-alone’ characters now.  \nLigatures mostly solve problems of colliding characters. If your face doesn’t suffer from such problems, then you don’t need any additional ligatures.  \nYou might wanna take a look at this thread about [f colliding with various tittles](http://web.archive.org/web/20150223073914/http:/typophile.com/node/40439).\n\n"
    },
    {
      "time": "4 Apr 2008 — 4:42am",
      "content": "You're quite right of course, Florian, that ligatures solve character collision. Your f+umlauts/fj thread is very interesting too. Something I hadn't come across. (And perhaps something that as a native English speaker I was bound to overlook.)\n\nThat aside I'm still interested in other ligatures too: Those that perhaps have scant legitimacy beyond style, or what I meant by 'indulgent'. Like 'em or not.\n\nI doubt, for instance anybody's s and t ever collide!\n\n"
    },
    {
      "time": "4 Apr 2008 — 5:17am",
      "content": "<cite>perhaps something that as a native English speaker I was bound to overlook.</cite>\n\nThat’s why I’ve started it. :-)\n\nAnother pointer: the thread that triggered the other one, on [The Most Useful OpenType Ligatures](http://web.archive.org/web/20150223073914/http:/www.typophile.com/node/40338).\n\nYou certainly have checked out some of the well-equipped OpenType text fonts that are out there, to examine which ligatures were included. It depends on the style, of course. A lot of today’s text faces are revivals of, or – in a broader sense – are based on historical models. Thus, the designers often incorporate ligatures that have also been part of the original. This can relate to linguistics as to the specific style.\n\nOne frequently sees ‘Th’, for example. Also: ch, ck, ct, st, sp.  \nAll kinds of combinations of f and characters with ascenders, also triples like ffb, ffh, ffk. Same for long s (ſ), if you want to include that historic alternative.\n\nAn Italic may have even more. Adobe’s Garamond Premier has ta, th, us, is, ij, ll, among a lot others. Have a look at Arno, Requiem or Galliard, too.\n\n"
    },
    {
      "time": "4 Apr 2008 — 8:55am",
      "content": "If you can look at Mrs Eaves, I'm not sure if i've ever seen more unique triple ligatures anywhere else. I've kinda had a falling out with the typeface because of it's over/improper use, but it may be a good reference point. Some of them seem slightly (but not completely) useless, like ffy, tty, ggy, ffj, THE, and my favorite-cky. There's also the OG, OC, OO, gi, and a bunch more...\n\n"
    },
    {
      "time": "4 Apr 2008 — 9:10am",
      "content": "Thanks Florian. That's impressively complete. I must admit that I should've done some rummaging around inside the OpenTypes and I will now. Arno Pro is indeed a good tip which includes a lot of long s ligatures at my first glance.\n\nI guess then, that the st, sp type ligatures are either a scribal legacy or perhaps a gratuitous flourish on part of the designer. They are certainly decorative rather than practical (i.e. to prevent collision). I wonder if they test well in terms of readability compared to their individual counterparts or whether they're best put to use at display sizes.\n\n"
    },
    {
      "time": "4 Apr 2008 — 9:15am",
      "content": "kai bernau's [lyon italique](http://web.archive.org/web/20150223073914/http:/kaibernau.com/lyon_03.php) has some great ligs worth looking at as well. love the pp lig.\n\n"
    },
    {
      "time": "4 Apr 2008 — 9:21am",
      "content": "Oh yes, the Mrs Eaves Just Ligatures. To be honest, to me, some of them -- in particular the capitals like MD or HE -- look like criminally designed logotypes. Can't help but smile at the g's ears in gg and gi though.\n\n ![](http://web.archive.org/web/20150223073914im_/http:/typophile.com/files/eaves_6150.gif)\n\n"
    },
    {
      "time": "4 Apr 2008 — 1:27pm",
      "content": "Æ, æ, Œ, and œ may be considered discretionary ligatures for Latin words such as Cæsar.  \nOn the one hand, this is a \"quaint\" usage, but on the other it does aid the pronunciation of words like onomatopœia.\n\n"
    },
    {
      "time": "4 Apr 2008 — 2:55pm",
      "content": "<cite>To be honest, to me, some of them — in particular the capitals like MD or HE — look like criminally designed logotypes.</cite>\n\nIsn’t that half the fun of it, though? It’s amazing how a simple business card can come to life when Mrs. Eaves gets a chance to work on it. I would love to fool around with that face in metal…\n\n"
    },
    {
      "time": "4 Apr 2008 — 4:41pm",
      "content": "Nick: _\"... it does aid the pronunciation of words like onomatopœia.\"_\n\nIt may indeed aid pronunciation, but it strikes me as rather ahistorical since onomatopoeia — \"oe\" rather than \"œ\" — seems a far better-rooted transliteration of the Greek ονοματοποιία, don't you think?\n\nPerhaps you'll think it a footling point for a quibble, but it's likely best to eschew ligation in this particular case. Pardon my digression.\n\n"
    },
    {
      "time": "4 Apr 2008 — 6:08pm",
      "content": "_...don’t you think?_\n\nThe thing is, for English readers, without the benefit of accents--how does one pronounce the succession of four vowels in \"-poeia\"?  \nThe dipthong œ would seem to help, as it suggests the usual pronunciation \"-pee-ya\", as opposed to other candidates such as \"-po-ee-ya\", \"-po-ya\", or \"-po-ay-ah\".\n\n"
    },
    {
      "time": "4 Apr 2008 — 6:54pm",
      "content": "ll is nice in an italic, though I'm still searching for a good design for a double l in non-italic type. Ch / ch is nice, especially when designed so that it doesn't change spacing, so that it can be discreetly (as compared to, say, a ct lig) placed into a document. For language where ch constitutes a separate letter it's definitely an nice effect. Don't forget the capital DE ligature for Spanish, it's easy and quick to do so no reason not to include it IMO.\n\nOlho, some of those capital ligatures have a lot of history pre-printing presses. For instance, in [traditional basque writing](http://web.archive.org/web/20150223073914/http:/www.txikizabalo.org/grafia/grafia32.php)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "5 Apr 2008 — 5:11am",
      "content": "Hmm. The Basque connection is certainly interesting. Another thing the linguistically lazy English speaker won't have come across. NA, TR and RA are quite spectacular in the graphic on that link. I think you'd need a keen eye to decipher TR which relies on the left arm of the T only and would probably look like a swash (or bastard?) lone R.\n\nAs for onomatopœia, I think Nick's closer in thinking it's an aid to pronunciation, -- Like the diæresis is in 'naïve' or 'Zoë' -- despite English being largely non-phonetic.\n\nAmerican usage of English seems to strip both the ae and oe digraphs and replace them with a single e. As an English English speaker I ought to object, but the lone e does make some sense to me -- though I'll admit my fusty British heritage is squealing to object as I type. In terms of visual language -- i.e. set type on the page -- I can't help preferring Words like 'Encyclopaedia' to 'Encyclopedia' and 'Encyclopædia' is even better. Also, I suppose keeping the digraph respects more faithfully the word's etymology. Things change though and as there are more Americans speaking English in the world than Brits I can't see the æ/œ digraphs surviving.\n\n"
    },
    {
      "time": "6 Apr 2008 — 6:07am",
      "content": "I have never seen portuguese ligatures other then the \"DE\", where the \"E\" is centered inside the \"D\" or united to it. Maybe there is something recently done by portuguese designers, which I am unaware.\n\nI did a drawing with some ligatures but I am unable to upload the picture (I wonder if my uploading privileges has been revoked...).\n\nI united the \"ç\" with \"ã\" and \"õ\" in a way that the lower curve of the \"ç\" touches the bowl of the \"ã\" on lower case, to form \"çã\" and \"çõ\", but it actually could be done with 3 letters: \"ção\" or 4 for this sillabe \"ções\". As for the caps, \"ÇÃ\" and ÇÕ\" I centered \"Ã\" and \"Õ\" inside the cedilha \"Ç\". I did also some for \"lh\" and \"LH\", \"nh\" and \"NH\".\n\nIf these don't exist, then this tread \"has already won\".\n\nI will try to upload the picture later as a addendum.\n\nAndré\n\n"
    },
    {
      "time": "6 Apr 2008 — 12:02pm",
      "content": "Mrs Eaves demonstrated that \"quaints\" aren't necessarily anachronisms.  \nDepending on circumstances, a typographer may wish to set text _unmarked_ (crystal goblet theory) or _marked._ These distinctions were articulated by Johanna Drucker in \"The Visible Word\".  \nThere are various ways to mark text, and the option of discetionary ligatures is one of them.  \nOpenType recognizes and enshrines the distinction between marked and unmarked text, in the separation of default ligatures (`liga`), which serve to \"unmark\" potentially obtrusive glyph sequences, and discretionary ligatures(`dlig`), which are available to add marked interest.\n\n"
    },
    {
      "time": "6 Apr 2008 — 3:07pm",
      "content": "[edit]  \nOk. I tried to upload the pictures 200 times. I don't do it. I installed Firefox and tried, no way. Then I thought, store the picture somewhere else, so it is here:\n\n[http://www.photoblog.com/storage001/2008/04/06/](http://web.archive.org/web/20150223073914/http:/www.photoblog.com/storage001/2008/04/06/ \"http://www.photoblog.com/storage001/2008/04/06/\")\n\nI never seen anything like this.\n\n"
    },
    {
      "time": "6 Apr 2008 — 3:16pm",
      "content": "Andre, you can't get an image to upload?\n\n\"Ligaduras Portuguesas?\"\n\n ![](http://web.archive.org/web/20150223073914im_/http:/typophile.com/files/67431-1207515169-0_5181.jpg)\n\n"
    },
    {
      "time": "6 Apr 2008 — 5:19pm",
      "content": "yes. I have done it, I uploaded gifs and jpgs before with no problems. In the last few days I was unable to... who knows. Thanks honey ;)\n\nBy the way, what you see here is - o que VÊs é totalmente - free. You can even modify, twist, contract, fleep over or whatver pleases you.\n\nNo EULA :)\n\n"
    },
    {
      "time": "6 Apr 2008 — 5:50pm",
      "content": "Interesting AGL, you came up with the same solution essentially for the lh as I did for the ll, although I'm still not 100% satisfied with it (but I can't think of any other way to lig them without making it be too distracting for a reader or just not make sense). Seeing your solution and mine I think the longer serif but not connected works better. I'll try it out tomorrow and see it how looks. For now, here's my current ll, de, and ch ligatures for Spanish:\n\n ![](http://web.archive.org/web/20150223073914im_/http:/typophile.com/files/spanish_ligs_corunna_5115.png)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "6 Apr 2008 — 8:32pm",
      "content": "I thought also about connecting the \"lh\" by adding a round connector like the english \"ct\" or \"st\", but it it looked kind of a \"U\" inverted. I guess a way to do it could be not worrying about if it would distract the reader. The \"DE\" that I was talking about is just like yours and it can be seen anywhere you are in Spain, just look around.\n\n¡ awesome !\n\n"
    },
    {
      "time": "7 Apr 2008 — 7:42am",
      "content": "I discovered these earlier on from [Prestige B and C](http://web.archive.org/web/20150223073914/http:/www.fontshop.com/fonts/singles/presence_typo/prestige_b_light/).\n\n ![](http://web.archive.org/web/20150223073914im_/http:/typophile.com/files/prestige2_5641.gif)\n  \n\n ![](http://web.archive.org/web/20150223073914im_/http:/typophile.com/files/prestige3_5245.gif)\n\nAs for bespoke and complimentary ligatures, there's also the [Avant Garde Gothic Alternative](http://web.archive.org/web/20150223073914/http:/www.fonthaus.com/products/fonts/view.cfm/sku/EF10534) additions to the Avant Garde family of course too.\n\n"
    },
    {
      "time": "7 Apr 2008 — 1:35pm",
      "content": "Mark, now the trick is to get all of those same style ligatures but doing it via OpenType contextual substitutions :)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "7 Apr 2008 — 6:28pm",
      "content": "I love the \"AQ\" in Prestige, and \"LLA\" \"CHE\", \"CHA, this is great :)\n\n"
    },
    {
      "time": "8 Apr 2008 — 1:51am",
      "content": "I recommend using a \"merged\" fi-ligature only if your f and i would collide. I pretty much dislike fonts where an fi-ligature disrupts the rythm of the line (this often happens in fonts with narrow f's which would not make any trouble anyway).\n\nAlso, if you are to support extended latin (e.g. Eastern European), consider all possible f+ acute accented letter /f+ double acute accented letter diacritics combinations.\n\nI'd suggest to include gj, gy combinations if they would collide. Especially gy looks really awkward in a number of italics.\n\n"
    }
  ]
}
