{
  "id": "43874",
  "title": "How does this image look to you?",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This image is for my personal blog’s header.\n\nThe left font is ’Typesource Extol’ and the right is ’Amerika Sans’ (both 36 pt). The tagline script is ’Angelina’ (20 pt).\n\nI did several alternatives, all differing only with the tagline text and script font. I have tried to keep the logo simple and uncluttered but the outline ’Typesource Extol’ may have destroyed this.\n\nAny thoughts on the mixture of the three fonts will be appreciated very much.\n\n[http://i126.photobucket.com/albums/p116/readred\\_2007/tepidair.gif](http://web.archive.org/web/20080408000730/http:/i126.photobucket.com/albums/p116/readred_2007/tepidair.gif)\n\n [‹ graphic design studio logo](http://web.archive.org/web/20080408000730/http:/www.typophile.com/node/43194 \"Go to previous forum topic\") [FAST Logo Critique ›](http://web.archive.org/web/20080408000730/http:/www.typophile.com/node/43519 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080408000730/http://www.typophile.com/user/22303\" title=\"View user profile.\">Tommy32</a>",
  "time": "<br>",
  "uid": "22303",
  "comments": [
    {
      "time": " 3.Apr.2008 11.58pm",
      "content": "I must add that the dimensions are; 141 x 57 px.\n\n"
    },
    {
      "time": " 4.Apr.2008 8.30pm",
      "content": "This will be harsh: this is a terrible mixture of three fonts. I count logotype and tagline; you have one too many fonts. Also, I don’t have anything against free fonts (I used Coolvetica by Ray Larabie recently with a satisfactory result), but I’m getting the impression that you found three free fonts that you thought were cool and then gave them a role in your blog’s header.\n\nFind a font that strongly expresses the content of your blog and then design a logotype using that. If you have to pay for a font, then bite the bullet and shell out the cash. This is your brand you’re developing here. Actually, if you’re investing the money, you may consider hiring a professional...\n\n—-  \nNick Hladek\n\n"
    },
    {
      "time": " 5.Apr.2008 4.06am",
      "content": "Thank you for your reply, Nick. No, I don’t think it’s harsh, what I needed was an honest opinion and this is what I got.\n\nI’ve now used Helvetica at 12 pt for the tagline. Because the _first-choice_ font in the blog is Helvetica, this will create a more cohesive page. I see now that it was a terrible mistake to use so many different fonts and the header now looks stronger on the page.\n\nThe identity I want my blog to express is that of one (a person) who doesn’t want to be seen to ’blow his own trumpet’ (’Bashful’ in the ’Seven Dwarfs’). Hence the quasi derogatory title ’tepid air’ and tagline.\n\n_As a rank amateur_, I feel the fonts ’Typesource Extol’ and ’Amerika Sans’ express this concept well and, hopefully, wittily.\n\nI’d appreciate further thoughts on how well, if at all, this logotype now works. This is a link to the blog, [http://tepidair.blogspot.com/](http://web.archive.org/web/20080408000730/http:/tepidair.blogspot.com/)\n\nWhile doing this ’design project’ myself, I’m not trying to do it ’on the cheap’ and I have no objection to buying fonts. If specific fonts are suggested, I certainly will consider using them.\n\n"
    },
    {
      "time": " 7.Apr.2008 3.11am",
      "content": "I’ve got rid of the silliness of several fonts for the header and use just one.\n\nI like the shape of ’air’ in Amerika Sans, and would appreciate thoughts on the suitability of the image and how it looks on the page at [http://tepidair.blogspot.com/](http://web.archive.org/web/20080408000730/http:/tepidair.blogspot.com/).\n\n"
    },
    {
      "time": " 7.Apr.2008 6.00am",
      "content": "lose the drop shadow ... definitely.\n\n—————  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20080408000730/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
