{
  "id": "43887",
  "title": "[Gentium] Update #6 - Gentium Basic and Gentium Book Basic Final Release",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20080407114440/http:/typophile.com/user/7006 \"View user profile.\") : 4.Apr.2008 8.16am \n\nGentium-Announce List  \nUpdate #6 - Gentium Basic and Gentium Book Basic Final Release  \n- - - - - - - -\n\nDear friends of Gentium,\n\nThe Gentium Basic and Gentium Book Basic fonts have passed our final rounds of testing and are now officially released to the general public. Each family has a complete set of four weights: regular, italic, bold and bold italic. Gentium Book Basic is generally heavier than the original Gentium and better for some publishing uses. Both families also include a few OpenType and Graphite smart font features, including optimized diacritic positioning.\n\nThe new fonts are called ’Basic’ because they support a smaller set of characters than the full Gentium fonts. They only support basic Latin and a handful of extended Latin characters. There is no Greek or Cyrillic, or even full IPA. The purpose is to provide early versions of the new weights that meet the needs of most Latin script users.\n\nOur next release will not be a Gentium font at all, but a ’Basic’ release of our Andika font for literacy. Watch our web site for that release. After that we will return to the main Gentium fonts and complete an update of the existing regular and italic to add extended Cyrillic, ancient Greek glyphs, Unicode 5.1 updates, and smart font capabilities.\n\nGentium, Gentium Basic and Gentium Book Basic are available at:\n\n[http://scripts.sil.org/Gentium](http://web.archive.org/web/20080407114440/http:/scripts.sil.org/Gentium \"http://scripts.sil.org/Gentium\")\n\nThanks again for your interest in Gentium!\n\nVictor Gaultney  \nGentium /at/ sil.org\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080407114440/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 4.Apr.2008 8.16am",
  "uid": "7006",
  "comments": [

  ]
}
