{
  "id": "43909",
  "title": "Avoiding ignorance: Designing type across cultures",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Here’s one to ponder. It became quite obvious in [this other thread](http://web.archive.org/web/20080821195100/http:/typophile.com/node/43879) that as a native English speaker, I am insufficiently prepared for non-English design issues like clashing diacritical marks and the historical use of certain ligatures and digraphs.\n\nEnglish speakers are probably more susceptible to this — as English uses a simpler set of characters than other European languages — but written differences must exist in multiple directions across cultures and languages. So I was wondering what top traps type designers might fall into, through natural ignorance of other cultures and writing systems. Do non-Icelandic designers care enough to properly design and kern the ð for example? I admit that while I do care it’s low on my list.\n\nSo, do any grievances with English (or other) speaking designers need to be aired, or are there any other things I should be aware of before I kern and wrap-up my current design?\n\n [‹ My \"type\" of restaurant...](http://web.archive.org/web/20080821195100/http:/www.typophile.com/node/44082 \"Go to previous forum topic\") [Any advice on typeface for a gravestone ? ›](http://web.archive.org/web/20080821195100/http:/www.typophile.com/node/39537 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821195100/http://www.typophile.com/user/26242\" title=\"View user profile.\">olho</a>",
  "time": "<br>",
  "uid": "26242",
  "comments": [
    {
      "time": " 5.Apr.2008 6.59am",
      "content": "“Do non-Icelandic designers care enough to properly design and kern the ð for example? I admit that while I do care it’s low on my list.”\n\nYes, we do care enough. If you include glyphs in a font, they should be given equal respect and attention as those of your native tongue. Think of the user. If they purchased a typeface seeing Icelandic glyphs were there, they assume they are usable for their language. Type design requires attention to detail and caring for other language characters is part of it.\n\nChrisL\n\nHere is a starting point:\n\n[http://diacritics.typo.cz/index.php?id=12](http://web.archive.org/web/20080821195100/http:/diacritics.typo.cz/index.php?id=12 \"http://diacritics.typo.cz/index.php?id=12\")\n\n[http://www.microsoft.com/typography/developers/fdsspec/diacritics.htm](http://web.archive.org/web/20080821195100/http:/www.microsoft.com/typography/developers/fdsspec/diacritics.htm \"http://www.microsoft.com/typography/developers/fdsspec/diacritics.htm\")\n\n"
    },
    {
      "time": " 5.Apr.2008 7.08am",
      "content": "I completely agree. The ð was just an example. I’m really trying to get what things non-native designers might miss — so I don’t miss them. I mean things in a similar vein to [this thread](http://web.archive.org/web/20080821195100/http:/typophile.com/node/40439), that pointed out something I was unaware of.\n\nGreat links by the way. Good stuff.\n\n"
    },
    {
      "time": " 5.Apr.2008 8.57am",
      "content": "Great resources, Chris! I didn’t know about Filip Blazek’s site — thanks.\n\nWith the help of Google, I just spotted two other sites:\n\n[http://www.sil.org/~gaultney/research.html](http://web.archive.org/web/20080821195100/http:/www.sil.org/~gaultney/research.html \"http://www.sil.org/~gaultney/research.html\")\n\n(Scroll down to the research paper titled _Problems of diacritic design for Latin script text faces_.)\n\n[http://george-everet.blogspot.com/2007/02/designing-typefaces.html](http://web.archive.org/web/20080821195100/http:/george-everet.blogspot.com/2007/02/designing-typefaces.html \"http://george-everet.blogspot.com/2007/02/designing-typefaces.html\")\n\n(It’s a review of books by David Earls and Karen Cheng, but it has comments which Mark and any other budding type designer might find useful.)\n\n"
    },
    {
      "time": " 5.Apr.2008 9.06am",
      "content": "<cite>Do non-Icelandic designers care enough to properly design and kern the ð for example?</cite>\n\nI assume you’ve read your [Briem](http://web.archive.org/web/20080821195100/http:/briem.ismennt.is/2/2.11/2.1.5.eth.trouble.htm)? ;-)\n\nFor your question:  \nI guess you have to accept that you can’t separate typography from language. Let me explain. To my knowledge, a ‘g’ followed by an ‘f’ is absolutely rare in English language.\\*) In German, though not very frequent, it’s more common. A few words that come to my mind: wegfallen [to drop out], Bergfahrt [ascent], Tagfalter [butterfly], dingfest [fixated] – let alone names like Siegfried or Mangfall.  \nThis, of course, is due to the orthographic convention of writing compound nouns in one word: Ringfinger.\n\nNow have a look at this. A simple term, in two languages, set in a common typeface – common both in England and Germany.\n\n ![](http://web.archive.org/web/20080821195100im_/http:/www.typophile.com/files/Baskerville_4083.png)\n  \nWhile the ‘train conductor’ looks perfectly normal and unobtrusive (that’s what typographers want to achieve, usually), the ‘Zugführer’ has two major problems:  \n1. ‘g’ and ‘f’ collide, although kerning is on.  \n2. It has a capital letter, which is/might be inappropriately fancy\n\nThe design of Baskerville isn’t defective – it’s just British. That is, it doesn’t have to repress its descenders, because they’ll hardly ever meet. And it may have swashy caps, because those are rare and _should_ stand out.\n\nBaskerville (or Caslon) will look best with English text. And German will look better with typefaces made by designers who are aware of its peculiarities. Just compare to [Aldus](http://web.archive.org/web/20080821195100/http:/www.fontshop.com/fonts/singles/linotype/aldus_lt_std_italic_ot/?sample_text=ein%20Zugf%C3%BChrer&sample_size=48), [Schneidler](http://web.archive.org/web/20080821195100/http:/www.fontshop.com/fonts/singles/linotype/stempel_schneidler_std_italic_ot/?sample_text=ein%20Zugf%C3%BChrer&sample_size=48) or [Meta Serif](http://web.archive.org/web/20080821195100/http:/www.fontshop.com/fonts/singles/fontfont/ff_meta_serif_lf_book_italic/?sample_text=ein%20Zugf%C3%BChrer&sample_size=48). I’m not saying that this is a black-and-white issue, nor that Non-Germans can’t design fonts that will work in that language. It’s just very rare that a typeface performs equally well in a lot of languages and looks nice at the same time.\n\n[Peter Biľak said](http://web.archive.org/web/20080821195100/http:/www.typotheque.com/articles/interview_martin_majoor.html)  \n<cite>When I moved to The Netherlands, and start working with Dutch language I had to modify Eureka – it simply didn’t work well with a Dutch text, I hadn’t thought of some letter combinations, and the rhythm of the language.</cite>\n\nF\n\n\\*) Ha, I found one: [Jeremy Tankard](http://web.archive.org/web/20080821195100/http:/www.typophile.com/wiki/Jeremy%252BTankard)’s [Kin **gf** isher](http://web.archive.org/web/20080821195100/http:/www.typography.net/type/kingfisher.htm)! Guess what – though of British origin, its descenders don’t clash. Now, why is that? ;-)\n\n"
    },
    {
      "time": " 5.Apr.2008 10.19am",
      "content": "_’g’ and ’f’ collide_\n\nWell, they oughtn’t. The example of “Kin **gf** isher” is but a single word that would have caught the collision in testing, but so also are (off the top of my head): meanin **gf** ul, sta **gf** lation, ba **gf** ul, slu **gf** est, do **gf** ish, and bi **gf** oot.\n\nThere are probably a couple of dozen more English words containing a “gf” combination, but even the ones cited aren’t exactly uncommon. All of which points up a clear need for better testing — while also making a good case for the use of contextual alternates.\n\nCheers,  \nErnie\n\n"
    },
    {
      "time": " 5.Apr.2008 12.08pm",
      "content": "Adding to what Florian said, Eben Sorkin organized a great thread last year to make a list of word examples from many different languages, to get a quick idea of lhow the letters fit into words in these different languages:  \n [http://www.typophile.com/node/31399](http://web.archive.org/web/20080821195100/http:/www.typophile.com/node/31399)\n\nA list like that can’t cover all the pitfalls, obviously, but it makes a good start as a testing tool.\n\n"
    },
    {
      "time": " 5.Apr.2008 12.35pm",
      "content": "There’s no need to get language specific.  \nEvery character should fit nicely with every other.  \nClass kerning helps, but you still neeed to make the effort to, for instance, split up your “i” characters into several classes.\n\n"
    },
    {
      "time": " 5.Apr.2008 1.26pm",
      "content": "Nick said: <cite>Every character should fit nicely with every other.</cite>\n\nBut that severely limits you in your design, doesn’t it?  \nRestrained ascenders/descenders for example, though this diffidence isn’t necessary for a great number of applications/languages.\n\n"
    },
    {
      "time": " 5.Apr.2008 1.44pm",
      "content": "“But that severely limits you in your design, doesn’t it?”\n\nMost adjustments can be handled with kerning pairs (like the i diacritics bashing cap T,Y,V, etc.). Contextual alternates help other problems. I recently had to create an alternate f to fit next to several glyphs with diacritics to avoid the hook of the f hitting umlauts and such. Permutations are helpful but you can select only the problem children to use as interlace subjects.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Apr.2008 3.18pm",
      "content": "Ok, I’m with the italic problem gf pair, regardless of its occurrence in German or English. I’ve now certainly read my Briem and revisited my ð. In fact, this afternoon has been a whistle-stop tour of Europe’s love of the diacritical mark.\n\nThe test document thread looks interesting — thanks archaica — though I’ve not had time to look too closely yet. I’m partly battling with best-practice in Fontlab and I can’t imagine how I’d go about testing those multi-lingual strings. (It seems to be such a pain in the arse to view non-standard characters in the metrics window! Also, being an Illustrator/Adobe man there seems to be a tangible quality deficit in the Fontlab UI.)\n\nI have to say, that the more I get immersed in designing type the more impressed and astonished at how intimately and wonderfully complex it is. Not only does each font of a particular type require the designer to maintain consistent and rigourous discipline across hundreds of discrete designs which are ultimately required to express a single vision, the process also requires a broad and nuanced understanding of language and culture as well as the inevitable awareness of history.\n\nThough I’m no sportsman it reminds me slightly of an extra-complicated version of the rules of cricket. Unlike cricket though it takes months rather than days to complete and, as I have discovered, success isn’t guaranteed. I’ve been a type obsessed graphic designer for years, but my simple serif has proved the most challenging design undertaking I can remember — and I’m far from finishing a single weight of the roman.\n\n"
    },
    {
      "time": " 5.Apr.2008 4.40pm",
      "content": "Mark,  \nYou are just beginning to see a glimse of all that is involved :-)  \nWelcome to the task that never ends.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Apr.2008 7.59pm",
      "content": "That Baskerville example was Monotype Baskerville (italic), right? Monotype Garamond (italic) is equally problematic. With the Garamond, gg needs a ligature, as does gy (Egypt) and ggy (froggy?), as well as zy and zzy (as in fuzzy zygote).\n\nThe f & vowels-with-grave-accents are problematic in most fonts, f & vowels-with-dieresis problematic in many.\n\n& on & on.\n\n"
    },
    {
      "time": " 5.Apr.2008 9.24pm",
      "content": "<cite>I’m partly battling with best-practice in Fontlab and I can’t imagine how I’d go about testing those multi-lingual strings. (It seems to be such a pain in the arse to view non-standard characters in the metrics window! Also, being an Illustrator/Adobe man there seems to be a tangible quality deficit in the Fontlab UI.)</cite>\n\nYou can test it in InDesign or any other typographically competent program. Generate and install your font, make an InDesign file with the test text, set in your font. Then, when you spot possible problems - collisions, badly spaced pairs or triplets, etc. - you can go back into Fontlab and work on those particular glyph combinations in the metrics window.\n\n"
    },
    {
      "time": " 6.Apr.2008 2.14am",
      "content": "Charles: yes, Monotype’s.\n\n<cite>as well as zy</cite>\n\nHave a look at this:\n\n ![](http://web.archive.org/web/20080821195100im_/http:/www.typophile.com/files/lazy_6628.jpg)\nIt’s the Dante 592 specimen. I refuse to believe that Mardersteig did this on purpose. No, there simply aren’t that much ‘zy’ combinations in Italian or German texts that he had to worry about this detail. He must have cursed the quick brown fox for not jumping over something else instead.\n"
    },
    {
      "time": " 6.Apr.2008 6.46am",
      "content": "<cite>I refuse to believe that Mardersteig did this on purpose.</cite>\n\nI don’t know how much involvement Mardersteig had with Monotype’s metal version of Dante. It certainly looked a little softer than the foundry version that was Mardersteig’s work. And of course, he had no input on the PostScript version, which to me looks downright melted.\n\nHaving said that, the problem with Monotype’s italic z’s, y’s, and occasionally g’s, is solved by cutting a few alternate glyphs — a “z” that looks like the z’s in other fonts, a “y” where the terminal doesn’t bend back so much, and a “gg” ligature.\n\nMy older British friends told me that these alternate characters were available special order back in the metal era. I haven’t seen them, but it doesn’t take too much imagination to envision how they look, and I make them up as needed. You can see some of my Monotype Garamond alternates on p. 37 of Rich Hendel’s <cite>On Book Design</cite>, but it’s nothing very imaginative.\n\nAs for OpneType, until we can have a many-many substitution, ligatures are probably best. For example, you might want two regular “z’s” with jazz, but you’d need to use two of the alternates with “fuzzy”- a regular z and a altered z & y would look odd.\n\nJust to stay on topic, f + igrave is the toughest test I know. Doesn’t occur in English, but sure occurs in French.\n\n"
    },
    {
      "time": " 6.Apr.2008 10.09am",
      "content": "_But that severely limits you in your design, doesn’t it?_\n\nThere are no constraints in design, only criteria.\n\n"
    },
    {
      "time": " 6.Apr.2008 10.29am",
      "content": "<cite>«There are no constraints in design, only criteria.»</cite>\n\nIf this is to be taken to mean that anything perceived as a constraint is really only another part of the criteria for the design, then you might as well say that there are no constraints in this universe, only criteria.\n\n"
    },
    {
      "time": " 8.Apr.2008 7.58pm",
      "content": "Quotation Marks:  \nThe British and American system of quoting text, “Hello”, etc., is not followed in all languages. We purchased a font made by a Czech designer, and “A was not kerned. Why? Because there, they quote it like this: „A (or something like that). So a Czech type designer could best kern “A also, and a British designer, „A. (By the way, we alerted him to his omission, and he corrected it).\n\n—D\n\n"
    },
    {
      "time": " 9.Apr.2008 6.17am",
      "content": "Take diacritics.typo.cz with a pinch of salt.\n\nIn some cases it’s outright wrong. In the case of the Hungarian double acute accent it (correctly) claims that earlier it was not distinguished from the umlaut-dots. However it falsly claims that the earlier form of the umlaut was an “inverted comma, probably derived from the spiritus asper”. In fact, it’s a superscript e which he only might have interpreted as “probably from spiritus asper” by a) having a copy showing bleeding ink filling the counter of the e, and b) not knowing typographic history well enough (though as a Czech designer I’d expect him to have good knowledge of German typographic history. Early German antiqua fonts had o-supersript-e and u-superscript-e as well, for modern ö/ü. Hungarian typography followed German type tradition in that respect due to strong cultural ties at that time).\n\nThis is bad research.\n\nHis account on Czech diacritics might be more accurate, though having a mother tongue does not replace good and thorough research when dealing with (in this case: type-) history.\n\nJust a word of warning: take it with a pinch of salt.\n\n"
    },
    {
      "time": " 9.Apr.2008 11.16am",
      "content": "_If this is to be taken to mean that anything perceived as a constraint is really only another part of the criteria for the design, then you might as well say that there are no constraints in this universe, only criteria._\n\nWell you might, if you thought the universe was a design brief.\n\n"
    },
    {
      "time": " 10.Apr.2008 12.11am",
      "content": "a) I think Nick is right that it is wise to have a look at every possible combination. I built files to help me with this. I can email one to you if you like. email me via the Typophile contact form if you want.\n\nb) It is also quite true that is smart to look for the very most common pairs and perhaps triples for every language you want to support - or to the best of your ability. In English that would be “The” & “the” if I am not mistaken. There are a ton of great tools to help you with this. Try site search for Typophile on Google with the term “Language” and “Letter frequency” and you should find quite a few.\n\nc) Look for and keep a tally of the most common problems.\n\nd) “b” & “c” don’t invalidate “a”. They are just additional lines of defense.\n\n"
    }
  ]
}
