{
  "id": "43915",
  "title": "I want a girly handwriting font.",
  "forum": "Design",
  "tags": [

  ],
  "content": "Inspired by [David](http://web.archive.org/web/20090822160607/http:/www.typophile.com/user/2969)’s [button](http://web.archive.org/web/20090822160607/http:/www.typophile.com/node/42354), I made some advertisements for my school’s Help Animals Club. There was obviously a note about meeting times at the bottom, but I’ve removed it.\n\n ![](http://web.archive.org/web/20090822160607im_/http:/typophile.com/files/Help_Animals_Club_1_by_tlevine_3997.resized.png)\n\nThese ran in my school’s humor newspaper (which actually isn’t that funny) because it happens to be hated by the Help Animals Club.\n\n ![](http://web.archive.org/web/20090822160607im_/http:/typophile.com/files/Help_Animals_Club_2_by_tlevine_3812.resized.png)\n\nEveryone loves the idea, but I hate the typography. The dingbats don’t match the main font, and I don’t like the font that I used (Goudy Old Style). I’m planning on making T-shirts out of these, so I ask for advice regarding the font.\n\nI’m thinking it should be something like a pink shirt with white text in a girly handwriting font whose lowercase “i” is dotted with a ♡. It would also need matching ♤♡♧♢. (And they should be open like that.) Can someone recommend such a font? It’s fine if the i isn’t dotted with a ♡ as that should be easy to make if the font has a separate ♡.\n\nIf I can’t find that font, I’m thinking some other friendly font with matching ♤♡♧♢ so I don’t have to adjust free ones to match the font. You’re welcome to recommend other fonts if you don’t have any ideas for the girly handwriting font.\n\nI plan on removing the ♥♥ from the first one because the font will have hearts on the “i”s. Also, I plan on replacing “animals” with animals of the purchaser’s choice.\n\n",
  "author": "<a href=\"/web/20090822160607/http://typophile.com/user/19606\" title=\"View user profile.\">Thomas Levine</a>",
  "time": "<br>",
  "uid": "19606",
  "comments": [
    {
      "time": " 5.Apr.2008 1.52pm",
      "content": " ![](http://web.archive.org/web/20090822160607im_/http:/typophile.com/files/Stop_cluB_5513.jpg)\n\n"
    },
    {
      "time": " 5.Apr.2008 3.13pm",
      "content": "I hadn’t realized that other people had already done this, although it isn’t surprising. Still, even my original version was better than those things from Kingdom of Loathing.\n\n"
    },
    {
      "time": " 13.Apr.2008 1.14pm",
      "content": "It turns out that one of my friends also likes type, particularly handwriting, and recommended [Catholic School Girls](http://web.archive.org/web/20090822160607/http:/www.1001freefonts.com/catholicschoolgirls.htm). It’s close to what I want, but doesn’t feel quite right to me; I think I want something that looks neater. I tried it anyway. (I know the spacing’s all wrong.)\n\n ![](http://web.archive.org/web/20090822160607im_/http:/typophile.com/files/20080413_6585.png)\n  \nI think I want script that isn’t slanted (last row of the image). Can someone recommend a font like this?\n\nIt comes out pretty nicely when I do this with a pen, but it’s hard for me to do it so nicely with a graphics tablet, and I’d like to see what fonts like this are available. If I can’t find an existing font I like, I’ll do it by hand and scan it.\n\n"
    },
    {
      "time": " 13.Apr.2008 3.18pm",
      "content": "Maybe Rickles Script, a free font by [Font Diner](http://web.archive.org/web/20090822160607/http:/www.fontdiner.com/main.html)\n\n"
    },
    {
      "time": " 25.Apr.2008 3.23pm",
      "content": "free and fabulous. girlie handwriting font heaven:)\n\n[http://www.kevinandamanda.com/scrapbook/fonts/fontsforpeas/](http://web.archive.org/web/20090822160607/http:/www.kevinandamanda.com/scrapbook/fonts/fontsforpeas/ \"http://www.kevinandamanda.com/scrapbook/fonts/fontsforpeas/\")\n\n[http://www.kevinandamanda.com/scrapbook/fonts/fontsforpeas/index1.html](http://web.archive.org/web/20090822160607/http:/www.kevinandamanda.com/scrapbook/fonts/fontsforpeas/index1.html \"http://www.kevinandamanda.com/scrapbook/fonts/fontsforpeas/index1.html\")\n\n"
    },
    {
      "time": " 27.Apr.2008 3.09pm",
      "content": "House Industries has a typeface set called Las Vegas. One the fonts is Fabulous which is kinda girly, four fonts total. Each font comes with a glyph that look one of the suites from a deck of cards.\n\n-kirby  \nmegankirbydesign.com\n\n"
    },
    {
      "time": " 29.Apr.2008 7.36am",
      "content": "I already started using Catholic School Girls, but the ones that gumdrops and Megan suggested look interesting; I’ll check them out.\n\n"
    }
  ]
}
