{
  "id": "43927",
  "title": "Paper for Bookbinding",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi, I’m a student working on putting a bunch of portfolio books together for the end of the semester. I have to print all my work with my Epson R1400, and I have been having trouble finding good paper to print on. The main problems I run into are that the paper is not double-sided, it is not made for an inkjet printer, or the paper is too thick for pages in a book. I printed one of my books on Ilford Galerie Smooth Matte Multi-Use Dual Sided Inkjet Paper... but I can’t seem to find the paper any larger than 8.5 x 11, which was fine when I was perfect binding, but now it is too small.\n\nSo... Does anyone know of any good inkjet paper to print images on for a book?  \nAny help would be wonderful. Thanks!\n\n [‹ Linotype FontExplorer for Windows... When?](http://web.archive.org/web/20080422064736/http:/www.typophile.com/node/44035 \"Go to previous forum topic\") [Calligraphic fonts - recommendations ›](http://web.archive.org/web/20080422064736/http:/www.typophile.com/node/44036 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080422064736/http://www.typophile.com/user/27531\" title=\"View user profile.\">BaileyDwyer</a>",
  "time": "<br>",
  "uid": "27531",
  "comments": [
    {
      "time": " 5.Apr.2008 11.25pm",
      "content": "Hahnemuhle has a couple of dual sided papers that might be nice. The Natural Art Duo is .15mil and Photo Duo is .18mil. They come in sizes up to 17x22 inches and may come in rolls. You can check out [www.itsupplies.com](http://web.archive.org/web/20080422064736/http:/www.itsupplies.com/ \"www.itsupplies.com\") or [www.atlex.com](http://web.archive.org/web/20080422064736/http:/www.atlex.com/ \"www.atlex.com\"). You could also check with [www.shadesofpaper.com](http://web.archive.org/web/20080422064736/http:/www.shadesofpaper.com/ \"www.shadesofpaper.com\"). Any of those vendors are helpful.\n\nI don’t really know if these would be too heavy or not but they are nice papers. Epson’s enhanced matte dual-sided papers are nice too and don’t seem overly heavy. I don’t know about the sizes but it should come on a roll.\n\nSharon\n\n"
    },
    {
      "time": " 6.Apr.2008 12.33pm",
      "content": "I do a lot of my bookbinding work using cut-down sheets of Strathmore Aquarius II (it comes in 22 x 30 sheets with side deckles) and it runs through just fine on my Epson SPR300, even though it’s supposedly “not recommended.”\n\nYou might want to find a god art supply store that has packages of paper samples (Talas, for example, since it’s in Manhattan), buy one, and try running as much as you can (and like) through.\n\n"
    },
    {
      "time": " 6.Apr.2008 4.48pm",
      "content": "Staples 11x17 double-sided matte paper is fabulous for Epson inkjets, and cheap, at least for inkjet paper.\n\n"
    },
    {
      "time": " 6.Apr.2008 5.20pm",
      "content": "Talas is a great store.\n\nJames, I wonder if Staple’s matte paper is made by Epson? It wouldn’t surprise me.\n\nSharon\n\n"
    },
    {
      "time": " 7.Apr.2008 6.43am",
      "content": "_I wonder if Staple’s matte paper is made by Epson? It wouldn’t surprise me._\n\nMe either, although I’ve found the quality to be a little lacking — sort of the “it’s not good enough to market it with our name and charge the big money, but we want to get rid of this stuff” thinking.\n\nI’ve not used it, but I know a few folks who have used the Staples printer ink in their Epson and who thought the black was fine, but the colours left something to be desired.\n\n"
    },
    {
      "time": " 7.Apr.2008 9.42am",
      "content": "I have talked to a lot of people who have ruined their printers trying to save money on ink. I don’t know why it is so expensive. It runs in the tens of thousands per gallon. Ridiculous!\n\nSharon\n\n"
    },
    {
      "time": " 7.Apr.2008 9.53am",
      "content": "\\> _I don’t know why it is so expensive_\n\nInk sales are where the money is made. The printers do not make money on their own.\n\n"
    },
    {
      "time": " 7.Apr.2008 10.41am",
      "content": "But there’s something terribly counter-intuitive about being able to buy a new printer loaded with ink for less than just buying the ink.\n\nNot to mention having to recycle even more electronic waste....\n\n"
    },
    {
      "time": " 7.Apr.2008 11.25am",
      "content": "\\> But there’s something terribly counter-intuitive about being able to buy a new printer loaded with ink for less than just buying the ink.\n\nSo don’t buy ink. Just buy more printers. They make excellent paperweights and lawn ornaments.\n\n:)\n\n"
    },
    {
      "time": " 7.Apr.2008 11.25am",
      "content": "<cite>James, I wonder if Staple’s matte paper is made by Epson? It wouldn’t surprise me.</cite>\n\nI doubt it. It’s got a different feel than Epson paper.\n\n<cite>…but I know a few folks who have used the Staples printer ink in their Epson and who thought the black was fine, but the colours left something to be desired.</cite>\n\nI did a lot of reading before I loaded up my R1800, and it seems to be one of those things that varies wildly by model. The newer Epson photo printers are much pickier than the old ones.\n\nKodak is betting on a business model that involves selling inkjet printers at a profit and the ink at low prices. Unfortunately the quality is not up to professional work, and none of the printers handle paper larger than US Letter/A4.\n\nAnyway, my new Epson is already starting to streak, although that might just be because I loaded a few sheets backward and need to open the heads back up. But next time around I’m going with a Canon.\n\n"
    },
    {
      "time": " 7.Apr.2008 12.22pm",
      "content": "_So don’t buy ink. Just buy more printers. They make excellent paperweights and lawn ornaments._\n\nROFL! You just gave me a great idea for a piece of installation art.... ;-)\n\n"
    },
    {
      "time": " 8.Apr.2008 2.01pm",
      "content": "Concerning the paper, I would recommend:\n\n[http://www.redrivercatalog.com](http://web.archive.org/web/20080422064736/http:/www.redrivercatalog.com/)\n\nIMO, better than Staples paper but won’t break the bank. It also comes in many sizes as well. Use it on our old Epson 1280 without a problem.\n\n"
    }
  ]
}
