{
  "id": "43938",
  "title": "Xanadu",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am working on a mailer for a type project. We had to pick 3 plays and come up with a theme. Mine are Romeo and Juliet, Palm Beach, and Xanadu. My theme is facade. I'm having a hard time with Xanadu, so I thought I might get some feedback. Thank you for your time. I'm completely open so fire away.\n\nThanks,\n\nDesi\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 3.png](http://web.archive.org/web/20131018064115/http:/typophile.com/files/Picture%203_37.png) | 25.28 KB |\n| [Picture 8.png](http://web.archive.org/web/20131018064115/http:/typophile.com/files/Picture%208_2.png) | 16.82 KB |\n\n",
  "author": "Desi",
  "time": "6 Apr 2008 — 10:56am",
  "uid": "27344",
  "comments": [
    {
      "time": "6 Apr 2008 — 11:48am",
      "content": "Is Xanadu a fantasy/futuristic movie? I'm not really familiar with the play so fill us in on what the concept of the play is and we can help you from there.\n\nP.S. Don't remove the cross bars on uppercase _A_'s. I have seen it countless times; it draws to much attention to itself and is overdone.\n\n"
    },
    {
      "time": "6 Apr 2008 — 11:55am",
      "content": "thanks on the A tip. Xanadu is about the muse, Clio, that comes to earth to inspire this guy to open a roller disco in Venice Beach, CA.\n\n"
    },
    {
      "time": "6 Apr 2008 — 12:40pm",
      "content": "I really like options 2 and 4. But Wesley is right, the missing crossbars break things up the design.\n\nIf I was going to do Xanadu I would probably do some research into disco-era nightclub flyers. If thats especially hard to find (which seems likely) sifting through record covers from the period seems like another good idea.\n\n"
    },
    {
      "time": "6 Apr 2008 — 1:22pm",
      "content": "I just added another exploration. I did check out covers. They are a little too busy and I wanted to make it slightly more modern with a greek twist, but I haven't been very successful so far. Thanks for the advice.\n\n"
    },
    {
      "time": "6 Apr 2008 — 6:30pm",
      "content": "You should also check out [the logo created for the 1980 film](http://web.archive.org/web/20131018064115/http:/www.glenncase.com/10000/00012.jpg).\n\n"
    },
    {
      "time": "7 Apr 2008 — 9:53am",
      "content": "I would suggest you look up the Pan-Pacific Auditorium. It's where parts of Xanadu were filmed. The deco update is something to reference thematically.\n\nAnd listen to the song Dancin:\n\n[http://www.youtube.com/watch?v=0eEOFvBdD2k](http://web.archive.org/web/20131018064115/http:/www.youtube.com/watch?v=0eEOFvBdD2k \"http://www.youtube.com/watch?v=0eEOFvBdD2k\")\n\nThe periods which are referenced musically are at the heart of the Xanadu idea. Big Band meets Rock Band. The grandiosity, and fun, and over the top(-ness) never dies.\n\nThe film and sound quality is crap, but the song is great!\n\nHave fun!\n\n"
    }
  ]
}
