{
  "id": "43933",
  "title": "Leopard/Adobe CS users",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi I am wondering if I should upgrade to Leopard, am using Adobe CS Suite 3. Have done searches on other forums to see who has and if they are having issues with any of the Adobe CS Suite 3 applications... or fonts issues?\n\nI see the designers posting here of a high level, so who better to ask. Not wanting a poll for posters to do 1 liner posts like: “I have”, would prefer to read how the over all experience was and if it was worth while. Any issues with fonts, font managers, font caches...\n\nWanting to update the studio, and for once have not jumped in head first on this upgrade. thanks in advance.\n\n [‹ ciao FB Moderno!](http://web.archive.org/web/20080708213657/http:/www.typophile.com/node/44025 \"Go to previous forum topic\") [Mexico City type/printing museum tips? ›](http://web.archive.org/web/20080708213657/http:/www.typophile.com/node/44181 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080708213657/http://www.typophile.com/user/26106\" title=\"View user profile.\">concrete</a>",
  "time": "<br>",
  "uid": "26106",
  "comments": [
    {
      "time": " 6.Apr.2008 4.34am",
      "content": "I used to work in a printing company that has Mac OS X from 10.2 to the latest version. All of them worked just great, but, sometimes this one intel g5 simply didn’t ’want’ to print for some reason. When we had a problem like that, we opened the file back in a non-intel machine and it would print just right and easy.  \nI guess that if you upgrade to Leopard your CS3 suite will work just fine, but, question is: Do you really need (or want) to upgrade?\n\nGood luck!\n\nAndré\n\np.s.: You are going to laugh: I am still running Mac OS 9.2.2 = IT WORKS!\n\n"
    },
    {
      "time": " 6.Apr.2008 4.45am",
      "content": "Wow... Mac OS 9.2.2!.. nice work.\n\nI have all Power PC Macs G5, also other reason for asking as wanting to get another NEW Mac... and they now all are Leopard.  \nNeeds and wants... immm need it as I want to do other stuff that is only available in Leopard, so I guess need? ok want\n\n"
    },
    {
      "time": " 6.Apr.2008 5.02am",
      "content": "I am on a PowerMac G5 2\\*2.5G Hz and have had a fair amount of problems with the CS3 apps, esp. InDesign. Erratic crashes especially when doing stuff in Open, Import, Save dialogs. Using the workarounds that have been found by smarter people than me, one can cope, but it is a hassle: I have to restart ID often because of sudden disappearances, contain the amount of fonts active, be careful not to drag–and–drop images, and so on.\n\nWord is that Intel-machines behave better, though.\n\nI do feel that the combination PowerMac/Leopard/CS3 is not ideally suited for production work. You’re better of staying on Tiger. Or upgrade to Intel : )\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 6.Apr.2008 5.56am",
      "content": "All my experiences with machines that have been updated to Leopard have been somewhat disastrous, from permission issues through crashes, to general OS instability. This does not, generally, seem to be an issue with new machines that ship with Leopard, only machines that are upgraded from Tiger or earlier versions.\n\n"
    },
    {
      "time": " 6.Apr.2008 9.21am",
      "content": "Makes me think that Leopard is made for intel macs? And if you are going to add another new mac it will be Leopard. I guess you are going to do it no matter what (I wish I could...;..). Good luck, Leopard has the “Time Machine” to ’undo’ any changes to the system; that seems handy. Question is, does it work?\n\n"
    },
    {
      "time": " 6.Apr.2008 12.16pm",
      "content": "Oisin...machines that were upgraded as in “10.5 was installed on top of 10.4” or upgraded as in “10.4 was deleted and 10.5 was installed”?\n\nIf it’s the former, then it’s no wonder you have problems. The upgrade process for OS X is quite nice, however, it’s not perfect and a huge amount of cruft is still left over to cause problems. I never upgrade when I install a new OS; I back everything up and do a complete erase and install of the new version. Start fresh. It takes longer to get up and running that way but it saves problems in the future.\n\n"
    },
    {
      "time": " 6.Apr.2008 12.25pm",
      "content": "I’m pretty happy with my PowerMac dual 2.3 + 10.4.11 + CS3, as long as I give it enough memory. It’s amazing how 1 Gb doesn’t go very far these days (I remember the days when a Zip disk could back up the whole computer)!\n\n"
    },
    {
      "time": " 6.Apr.2008 1.09pm",
      "content": "Kakaze:\n\nBoth upgrades and erase-and-install installations have been plagued in my experience. The only time I’ve seen it go well was a completely nuke ’n’ pave, i.e., the entire hard drive was formatted (it was a server at work that was being sold off for some reason, so they overwrote it 35 times—best not to leave any valuable information on there) and a clean install was made.\n\nI suspect it has to do with the fact that standard user ids and groups have been changed, but I’m not sure.\n\n&nbsp;\n\nMili:\n\nIndeed! I remember doing work on a 40 MB hard drive. 16 MHz processor that beast had.\n\nLike you, I’m perfectly content with 10.4.11 on my Mac Pro. :-)\n\n"
    },
    {
      "time": " 6.Apr.2008 1.31pm",
      "content": "Thank you... Indesign, Illustrator, Photoshop, Acrobat/Distiller using everyday, if Leopard has issues with a Power PC then I think I will wait for 10.6? Tiger is working wonderfully, and in the case of: if it aint broke don’t fix it.\n\nI remember working on an Apple IIe, large thin floppy disks for saving and backing up our digitizing!!... that was only 22 years ago... another 22 years we will be laughing at our terabyte hard drives and a crazy thing called RAM.\n\nAlso should I upgrade... I would back everything up, wipe the drives clean (pull out the dishwashing liquid) and do a clean install of Leopard, I would expect to write off a day doing this... and the heart would be racing at 97%.... 98%.... 99%.... 100%... completed!... phew!\n\n"
    },
    {
      "time": " 7.Apr.2008 2.39pm",
      "content": "Oisin: erase and install is a complete “nuke ’n’ pave” of the drive. There will be no user ids or groups until after you’re done. Unless you’re thinking of an “archive and install” which preserves everything on the drive and creates a new system folder. I’ve done one archive and install since switching to Mac and less than a week later I had to erase and install because things were just wrong.\n\nConcrete: Leopard works perfectly on my G4 PowerBook along with CS3. I’ve heard of relatively few problems regarding Leopard on PPC Macs.\n\n"
    },
    {
      "time": " 7.Apr.2008 2.53pm",
      "content": "Kakaze@ : thanks, I phoned a colleague yesterday who did a clean install not long ago, he was in the middle repairing permissions at the time and said.. hold off. Another colleague said to wait at least for 10.5.3.\n\nI am in no rush, for once I have slowed down and reviewed the issues. I currently am issue free on Tiger.. so i will wait just a little.\n\n"
    },
    {
      "time": " 7.Apr.2008 5.50pm",
      "content": "Kakaze: You’re right, that was supposed to say “archive and install”, not “erase and install”.\n\n"
    },
    {
      "time": " 7.Apr.2008 6.14pm",
      "content": "concrete:\n\nYou don’t say what hardware you’re using, specifically. I’ve heard that Leopard and CS3 work well on G4 PPC macs, and I’ve had very few problems with CS3 on my Intel MacBook, but I’d recommend against using Leopard and CS3 with a dual G5 machine — this is what I use at the office and I’ve had a number of problems, even after a complete system/CS3 reinstall ... probably similar to Bert Vanderveen’s problems above: any Finder-related activity (Open, Save, Place, etc) can cause crashes and lockups and forced CS3 restarts.\n\nG4? Go for it. G5? Wait.\n\n"
    },
    {
      "time": " 7.Apr.2008 6.59pm",
      "content": "I really wanted to upgrade my Powerbook (PPC G4, 1.5 GHz/1.5 GB DDR SDRAM) to Leopard. But after a search on the Apple forums I’m going to wait until I upgrade to a new computer.\n\nSearched for: [upgrade powerbook g4 to leopard](http://web.archive.org/web/20080708213657/http:/discussions.apple.com/search.jspa?objID=c235&search=Go&q=upgrade+powerbook+g4+to+leopard)\n\n"
    },
    {
      "time": " 7.Apr.2008 7.04pm",
      "content": "Miss Tiffany, I guess your PPC G4 is very noisy. When getting another one, pick a power pc g5, they are almost silent.(don’t go intel..)\n\n"
    },
    {
      "time": " 7.Apr.2008 7.34pm",
      "content": "Hi Chris,  \nI have a G5 2gh dual and iMac G5 dual and about to get another new Mac... so I will wait.\n\nthanks all for the well informed posts.\n\n"
    },
    {
      "time": " 7.Apr.2008 8.10pm",
      "content": "I have a Mac Pro and Leopard is not very stable. Stay with Tiger. My G5 blew uo with tiger and they had to send me a new machine and they didn’t want to send me another G5 dual.\n\n"
    },
    {
      "time": " 7.Apr.2008 8.11pm",
      "content": "My G5 dual turned out to be a very noisy machine. The Mac Pro runs quite because of the new cooling system.\n\n"
    },
    {
      "time": " 8.Apr.2008 2.50am",
      "content": "I have an iMac 2.4 GHz and run with the shipped version of Leopard. I use the CS3 design suite a lot and never have problems with them. I think they are great together\n\n"
    },
    {
      "time": " 8.Apr.2008 12.05pm",
      "content": "Never had problems.\n\n-\n\n[www.nunocoelho.com](http://web.archive.org/web/20080708213657/http:/www.nunocoelho.com/ \"www.nunocoelho.com\")\n\n"
    },
    {
      "time": " 8.Apr.2008 1.00pm",
      "content": "Stay with Tiger until you upgrade your CS suite. Adobe has stopped developing even CS2 and CS3 is not fully compatible with Leopard yet. This has probably been said…\n\npbc\n\n"
    },
    {
      "time": " 8.Apr.2008 1.03pm",
      "content": "I’ve been running CS3 on 10.4 (Tiger) on a MacBook Pro 2.4 Core 2 Duo for months with no problems. I see no reason to update to Leopard, which still has some stability issues (albeit not so bad now that it’s been updated to 10.5.2).\n\nHowever, I think your hardware is more important than your software, in this case. A PowerPC Mac will probably give you trouble that an Intel won’t.\n\nAGL, why do you recommend against the Intel Macs? They are far, far beyond the PPCs, in terms of power and compatibility with newer apps.\n\n"
    },
    {
      "time": " 8.Apr.2008 1.22pm",
      "content": "No kidding - my intel Macs run perfectly and much faster than any PPC box.\n\npbc\n\n"
    },
    {
      "time": " 8.Apr.2008 1.25pm",
      "content": "PPCs are needed if you have to use older apps, like Freehand. They don’t run with Intel Macs. I hope that by the time of the next upgrade that old workhorse won’t be needed anymore. FH has been giving me gray hairs lately even with PPC. I only use it anymore to convert documents into Illustrator format.\n\n"
    },
    {
      "time": " 8.Apr.2008 2.09pm",
      "content": "I am locked in with 10.4 because I need Classic Mode and also I love the fact that I don’t need to think on upgrading. When you upgrade it is not just the new computer: Be ready to open your pockets up!\n\nAs for artwork for print, your QuarkXpress 3.32, Freehand 5.5 and Photoshop 3.05 Universal do the trick and can deliver ¡ awesome ! artwork, that will later on be opened anywhere in this world - even in China.\n\nJust think your artwork Postscrip “Level II” - IT WORKS! Still want to upgrade?...\n\n"
    },
    {
      "time": " 8.Apr.2008 2.30pm",
      "content": "@ AGL, Why on earth do you need classic mode? I’m curious to know what program you’re using.\n\nI just bought a new imac (2.8 intel duo extreme, 4gigs of ram). The guy told me at the store that 10.5 was somehow optimized for the new processors, and in turn, CS3 is indeed optimized for 10.5.\n\nSomething interesting that I didn’t know is that InDesign and Illustrator are single-processor aware programs, so a second processor (ie Mac Pro/Power Mac) won’t do anything for you in either app(but that’s kinda off topic).\n\n"
    },
    {
      "time": " 8.Apr.2008 2.49pm",
      "content": "I’ve had no problems with CS3 on my PPC running 10.4 — if someone is worried about this I meant to add this.\n\n"
    },
    {
      "time": " 8.Apr.2008 2.51pm",
      "content": "Well easily solved... get rid of Freehand. Actually I thought there was a ’modification’ available for Freehand for those who really need it, though don’t know if it is legit.? I use Adobe CS Suite 3.... I gave up Freehand when I went to a large agency and they said “Free what?”... I knew Quark fortunately (like driving a tank, blind) then I learnt Illustrator in 2 hours... got the job, I try to go with the flow and use the tools available. Also Illustrator CS3 can open FH files.\n\n"
    },
    {
      "time": " 8.Apr.2008 2.57pm",
      "content": "I am using CS3 on my G5 2gh dual and iMac 2gh with the functional 10.4.11 all tigered up and sweet as, no problems, loving it.  \nSort of an easy point though, seems to be ’nay’ with the Leopard on a Mac G5 2gh dual... running anything.\n\n’yay’ or ’nay’... I’ll wait until 10.5.3 - 10.5.5, 10.5.5 has a nicer sound to it if you say it out loud.\n\n"
    },
    {
      "time": " 8.Apr.2008 3.07pm",
      "content": "Mili,  \nI remember your Freehand story from before. Here is hoping your old clients finally let go of the beast and set your hands free :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Apr.2008 7.47pm",
      "content": "@ chipman223 “AGL, Why on earth do you need classic mode? I’m curious to know what program you’re using.”\n\nFor a long long time I had to constantly learn the new software that pops up every 3 months. As a production artist or prepress tech in a printshop you have to know every single piece of c\\*\\*p that is thrown in the market; secretaries are making flyers and brochures with Publisher; that customer of ours only has his text in WordPerfect; the guy that plotters the lettering only has CorelDraw7; the 20th century graphic designer got to have CS or die! It sure is good to have excellent top notch software and that can be seen on your work, but in my personal case I am locked to with OS9 and Classic, because the legit software that i have is for OS9. Now laugh big time, I am still using Quark 3.32 right out of the floppy discs! Whatever I do can be opened anywhere and RIPs just fine. Even in China.  \nLetterpress is very limited business, most of the artwork is vector and, if think screens, you have to think with 60 lpi or less, so any piece of program from the digital Renaissance works just great and allow the making of any TIF cmyk, vector editable eps.  \nOf course, to surf the web I use Safari, and you would be surprise how Grab and Preview are useful... combined with AppleWorks 6 ;-)\n\n@concrete:  \nIn the USA some people (like my last supervisor...) hate Freehand. I guess it is like that because people like Illustrator best. To draw Freehand used to be the best (version 8 and 9). I like illustrator and indesign cs2, but my budget right now is very low and between buying software or lead type, I buy lead.\n\nCheers!\n\nAndré\n\n"
    },
    {
      "time": " 8.Apr.2008 8.44pm",
      "content": "@AGL: I am looking out the window... I have the 1,000 yard stare...\n\nso anyway I will go for the ’nay’ on Leopard for now, Tigger is running smoothly with CS 3 and all my other applications.\n\n"
    },
    {
      "time": " 8.Apr.2008 10.27pm",
      "content": "Freehand... I transferred a newsletter to InDesign some years ago. My client had a designer coming back from maternity leave and she was given the job. She transferred it back to Freehand. Now she’s gone and the newsletter came back tome. I just moved everything back to InDesign, again.  \nIn Finland Freehand has been very commonly used, and it’s not going away very fast, it seems.\n\n"
    },
    {
      "time": " 8.Apr.2008 11.17pm",
      "content": "I upgraded to leopard. I run CS3 apps daily, including indesign on an intel machine. I made sure to back everything up manually, then did an full format, then installed on my clean hard drive. It was significantly easy for me however, as I have a hard drive for my OS + programs, then 2 hard drives set as RAID-1 mirrored for all my work. I unplugged my work hard drives during the install just in case.\n\nI went to the apple store before I switched and played around with all the CS3 apps. But i couldn’t be happier, leopard seems to run smoother, and although I was unsure, I now visually enjoy it more.\n\n"
    },
    {
      "time": " 9.Apr.2008 8.19am",
      "content": "”...designer coming back from maternity leave and she was given the job. She transferred it back to Freehand.”\n\nMili,  \nPerhaps you should switch that lady’s birth control pills with sugar pills to keep her pregnant and away from your office :-)\n\nChrisL\n\n"
    },
    {
      "time": " 10.Apr.2008 2.29pm",
      "content": "(hijacking my own posting, did I?...)\n\nre:Freehand:  \nWhat ever tool works for you, end of the day it comes down to the person operating the software and what they produce, you may have all the latest bells and whistles to design with, though if you suck... you suck, no application is going to help.\n\nMaybe Adobe could get a suggestive programme, a little pop up, “do you really want to that, how about doing this?” like the Microsoft man (eeewwh) not on my Mac\n\nahem anyway, Leopard and Adobe CS3 Suite on a ’PowerMac G5 dual 2gh’ if anyone is having success, please let me know, based on: Leopard and Adobe CS3 Suite on a ’PowerMac G5 dual 2gh’ or any PowerPC G5 Mac\n\nnot G4, not freewilly, not OS 9, not Quark, not Classic or any other relic thanks\n\n"
    },
    {
      "time": " 10.Apr.2008 8.03pm",
      "content": "RE:CS3Suite compatability:  \nI use it at home on my G4 Macpro powerbook with tiger 10.4.9 and I have no problems. However In the office I have a New Imac with Leopard and  \nI have issues. It forgets its registered for one. Photoshop and Indesign  \ntend to Freeze with complicated files. I like my imac and was going to  \nget one for at home too but I will wait till G3 upgrades.\n\n"
    },
    {
      "time": " 10.Apr.2008 9.19pm",
      "content": "Mac OS X Leopards greatest feature: Spaces. Mac OS X Leopards greatest weakness for Adobe Apps: Spaces. Adobe CS 3 works great on Mac Pro Intel desktop as long as you don’t use Spaces. If you use Spaces, your palettes will disappear every time you change from one space to another. HItting the tab key will restore them, but if you are using the text tool, you will get tabbed text until you click outside a text box.\n\n"
    },
    {
      "time": " 10.Apr.2008 11.38pm",
      "content": "I’m not sure why one would need to go to Leopard at this point, if you haven’t bought an Intel equipped Mac. As a typographer, is there something inherently better with CS3 and Leopard?\n\nI run a souped up G4 (souped up mainly for the internet and video, not type) and have another G4 with Classic. I have the ability to create Multiple Master instances with Classic and I favor Streamline over Illustrator’s Trace, so it often comes in handy for the work I do. Mainly the concern with older computers and software is the ability to port over. With a G4 or even a G3, this is still not a problem.\n\nThe speed of a MacPro is great but that really has little to do with typographic needs, especially if we are talking about print. The last great advance in the typographic realm was OT. And, quite frankly, that was nowhere near as earth shattering as PostScript Type I. It’s got some bells and whistles, but those have come at some cost; the loss of multiple masters, lack of user control of letterform configuration, etc. If you like your soup canned, great; but how does it taste?\n\nGerald\n\n"
    },
    {
      "time": " 11.Apr.2008 11.08am",
      "content": "just to clarify some mixed up assumptions, my understanding is that :\n\n1) CS2 was optimized for pre-Intel Macs running Tiger.\n\n2) CS3 was introduced for Intel Macs running Tiger.\n\n3) Then Leopard came out and various CS3 upgrades were  \ninevitable and are ongoing.\n\nI’m running CS2 on a pre-Intel G5 iMac w/ Tiger - no problems.  \nI’m also running CS3 on an Intel MacPro laptop w/ Tiger - no problems.\n\nI’m holding off on Leopard until some of the issues i’ve heard about  \nare worked out.\n\n"
    },
    {
      "time": " 11.Apr.2008 5.38pm",
      "content": "Leopard will one day be a great operating system — better than Tiger — but it isn’t at present, I think. Anyone who wants Spaces for multiple desktops — and for me this feature is something I can’t live without — then YouControl multiple desktops is far better and lets you have a different desktop picture for every desktop. I have Leopard installed on a different drive and I use it for some things but not for using CS2 (I’m skipping CS3!), which works perfectly in Tiger on my G5.\n\nAnyhoo — how long til CS4 arrives?\n\n"
    },
    {
      "time": " 12.Apr.2008 4.02pm",
      "content": "<cite>«I use it at home on my G4 Macpro powerbook»</cite>\n\nLovely machine, that.\n\n"
    },
    {
      "time": " 12.Apr.2008 4.27pm",
      "content": "CS4... will it be Cocoa or Carbon, not 64 bit yet as the CS4 Windows version will be. I want functional, though now there are applications that are Leopard only, though I don’t really need, them... not at the expense of functionality and sanity. So Tiger and CS3 will have to work for now, though then that puts me in a ’what the heck do I do’ situation of getting new Macs, as I want all of them to be running the same OS and applications.\n\nfor me enough said, on this forum.\n\n"
    },
    {
      "time": " 13.Apr.2008 5.49am",
      "content": "Just buy a new Mac and put Tiger on it. Problem solved!\n\n"
    },
    {
      "time": " 13.Apr.2008 4.42pm",
      "content": "<cite>«Just buy a new Mac and put Tiger on it. Problem solved!»</cite>\n\nNot necessarily possible.\n\nIn many cases (as far as I know, in all cases, actually, but I’m not certain), it’s not possible to install any older version of OS X than what the machine shipped with. If you buy a new Mac now, it should ship with Leopard, in which case you won’t be able to install Tiger on it.\n\n"
    },
    {
      "time": " 13.Apr.2008 5.19pm",
      "content": "You really want Time Machine it was so over-do. Tell me the last time you updated your files? I don’t even think about it any more.\n\n"
    },
    {
      "time": " 14.Apr.2008 1.40am",
      "content": "“it’s not possible to install any older version of OS X than what the machine shipped with.”\n\nYes, Oisin, it is possible. I did it on my Mac - I had to re-install the OS and by mistake I installed Panther; actually the Mac had been running on Tiger, which I installed when I noticed what I had done.\n\n"
    },
    {
      "time": " 14.Apr.2008 1.57am",
      "content": "Hi it is apparently not advised to install Tiger over a shipped Leopard unit, has something to do with firmware?... something not to mess with. Have heard of some dire results.\n\nAt the risk of having a my Mac not functioning properly or not at all, it is a LARGE part of my business... Leopard is presenting itself as not being stable on G5 2gh dual processor Power PC Macs.. for those wanting to do this, post your results here. based on the said Hardware running CS3.\n\n"
    },
    {
      "time": " 14.Apr.2008 2.26am",
      "content": "You are right, you can’t install an older version over a new one, but maybe by deleting the new version first ...? Anyway, I should consult an expert before going ahead and crashing the system.\n\n"
    },
    {
      "time": " 14.Apr.2008 4.37am",
      "content": "<cite>«Yes, Oisin, it is possible. I did it on my Mac - I had to re-install the OS and by mistake I installed Panther; actually the Mac had been running on Tiger, which I installed when I noticed what I had done.»</cite>\n\nHow odd. I recently changed the hard drive in a brand new MacBook that shipped with Leopard. Afterwards, I wanted to install Tiger instead of Leopard on it, since my friend whose computer it was likes Tiger better than Leopard, too; but when I tried booting from the Tiger install disc, it simply told me that “This operating system cannot be installed on this hardware” (or however that particular message goes).\n\nSomething someone said on a Mac forum led me to believe that this was a universal occurrence, that the version the computer originally shipped with was the earliest that could be installed, so I just let it go.\n\nAre you sure your Mac didn’t originally ship with Panther, and you then upgraded it to Tiger afterwards?\n\n"
    }
  ]
}
