{
  "id": "43932",
  "title": "Simple Logo Redesign for Financial Advisor Company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,\n\nMy new client asked me to design a website for them and also brush up their logo (but only slightly). The client is a financial advisor company, so their logo shouldn’t be too wacky. This is what I came up with:\n\n ![](http://web.archive.org/web/20080411032715im_/http:/www.typophile.com/files/logo_concept_6283.png)\n\nDo you think it looks ok? What could be improved? Any ideas? Thanks!\n\n [‹ Logo Crit](http://web.archive.org/web/20080411032715/http:/www.typophile.com/node/42078 \"Go to previous forum topic\") [graphic design studio logo ›](http://web.archive.org/web/20080411032715/http:/www.typophile.com/node/43194 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080411032715/http://www.typophile.com/user/19464\" title=\"View user profile.\">Tintin81</a>",
  "time": "<br>",
  "uid": "19464",
  "comments": [
    {
      "time": " 6.Apr.2008 7.49am",
      "content": "The horizontal bar in the F is too high I guess. Also am not sure about that disjoint in the H. The central horizontal bar seems too thick in F and E. E is too wide compare to the others. I would also reduce the stroke contrast a bit.\n\n"
    },
    {
      "time": " 6.Apr.2008 3.48pm",
      "content": "Hey satya,\n\nThanks for commenting on my logo. My initial post was a bit silly though (I realised that just now).\n\nI decided to change my strategy and go for a more conservative logo type. Maybe it’s best if you take a look at the entire website which can be found [here](http://web.archive.org/web/20080411032715/http:/hfe.designbits.de/) (currently only works in Safari or Firefox).\n\nBy the way, is there a sub-forum here where I might ask for a website critique?\n\nI really like the quality of the feedback on this message board, but mostly do web design, not logo design :-(\n\nAny idea where to get good feedback?\n\n[Webdesign Portfolio](http://web.archive.org/web/20080411032715/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 7.Apr.2008 6.05am",
      "content": "Liking th more solid type you’ve gone with. as a “logo” it needs something more. It’s really only just the 3 letters.\n\n—————  \n**Paul Ducco**  \n [Design Studio](http://web.archive.org/web/20080411032715/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 7.Apr.2008 11.31am",
      "content": "This is a strong base for your concept. Maybe try to have the right hand vertical of the H also be the vertical of the F, since you separated the right hand vertical of the H already. Then try to repeat this somehow with the E...\n\n—-  \nNick Hladek\n\n"
    },
    {
      "time": " 7.Apr.2008 11.43am",
      "content": "I would take a different tact. if that is a registered mark Just use a strong typeface and use various ways to express the mark. Make it a cut-out, a piece of glass, metal, but always with the same setting and spacing. The “logo” visually isn’t memorable.\n\n"
    },
    {
      "time": " 7.Apr.2008 2.02pm",
      "content": "I’m struggling with the H. I see the HFE but I naturally want to make it ’IFE’ with an odd shape in the front.\n\n"
    }
  ]
}
