{
  "id": "43934",
  "title": "FontLab Metrics window question",
  "forum": "Build",
  "tags": [

  ],
  "content": "Really quick — and hopefully not too stupid — question about the FontLab Metrics window:\n\nAnybody know if there’s a way to increase the leading between multiple lines of type displayed in the Metrics window? I can’t find a preference. This applies to the window display and the printed Font Samples.\n\nI’m finding it more difficult than it could be to reasonably judge colour in a paragraph or with multiple lines because they’re set solid. This also means the kerning marks beneath pairs often clash with ascenders in the line below — another hindrance to determining the look/colour/balance of a whole paragraph.\n\n [‹ Font audit: \"move is empty\"](http://web.archive.org/web/20080907051551/http:/www.typophile.com/node/43946 \"Go to previous forum topic\") [font book restoration ›](http://web.archive.org/web/20080907051551/http:/www.typophile.com/node/43924 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907051551/http://www.typophile.com/user/26242\" title=\"View user profile.\">olho</a>",
  "time": "<br>",
  "uid": "26242",
  "comments": [
    {
      "time": " 6.Apr.2008 5.24am",
      "content": "I don’t know if that is possible, however, I usually just generate a fontfile and set a paragraph in InDesign for print outs.\n\n"
    },
    {
      "time": " 6.Apr.2008 7.34am",
      "content": "Although this is not a good idea but you can temporarily Pull your descender line down, this will increase the leading between lines in the Metrix window too.\n\n"
    },
    {
      "time": " 6.Apr.2008 8.23am",
      "content": "You can export a fontfile in the font directory of the indesign program files. If you save a new document over this old one, it will automatically be updated in Indesign.\n\n"
    },
    {
      "time": " 6.Apr.2008 11.18am",
      "content": "Ok, I thought as much. Thanks all.\n\nI didn’t know of the local InDesign fonts directory, but that’s definitely a good tip. A bit more laborious than instant tests in the Metrics window though. Perhaps leading should be a feature request.\n\n"
    }
  ]
}
