{
  "id": "43947",
  "title": "logo for a company which provides solutions for small businesses",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey there, I'm working on a logo and I'm heading in all kinds of directions.\n\nThe company is called Post Industrial (PI)\n\nI tried combining it with the number π (3.1415...) in abstract ways.  \nLet me know what approach you like best and what I could improve. If you have any other good ideas, please tell me.\n\nCheers\n\n| Attachment | Size |\n| --- | --- |\n| [recap.jpg](http://web.archive.org/web/20131017053223/http:/typophile.com/files/recap.jpg) | 224.85 KB |\n\n",
  "author": "ChriZ",
  "time": "6 Apr 2008 — 2:14pm",
  "uid": "27166",
  "comments": [
    {
      "time": "6 Apr 2008 — 2:28pm",
      "content": "All of those are great logos, but i like the simplicity of b-1 the most.\n\nAnd the much friendlier a-4 also.\n\n"
    },
    {
      "time": "6 Apr 2008 — 3:39pm",
      "content": "I like the version b. The one with a square and the initial \"pi\" in the corner.\n\n"
    },
    {
      "time": "6 Apr 2008 — 5:37pm",
      "content": "I like B too... H looks a lot like the MIT logo: [http://web.mit.edu/](http://web.archive.org/web/20131017053223/http:/web.mit.edu/).\n\n"
    },
    {
      "time": "7 Apr 2008 — 6:02am",
      "content": "if these are the concepts moving forward then B is definitely the strongest.\n\nWhy did they (or you) chose to focus on the mathematical symbol of \"PI\" ... I might be missing something, but I can't see the connection.\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20131017053223/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:40am",
      "content": "_removed this post and replaced with revised comments below_\n\n---  \nNick Hladek\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:39am",
      "content": "@Ratbaggy:  \nThe initials of Post Industrial are P.I., hence the Greek letter π.\n\nYes, B is certainly the strongest. If Post Industrial did anything mathematical or industrial, or creative with technological applications, then π would have especially apt associations. Still, B is very nice.\n\n---  \nNick Hladek\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:48am",
      "content": "The concept is forced. It will go sailing over anyones head. K.I.S.S. Keep it simple smarty. You are selling your services to small businesses, not MIT\n\n"
    },
    {
      "time": "7 Apr 2008 — 12:13pm",
      "content": "Thank you all for your great feedback!  \nkeeping it simple might be difficult sometimes, what I'm still not too sure about is wether or not to work with a pictogram or mainly something typographic.\n\nI'll try to do more B-ish ;)\n\nThanks again!\n\n"
    },
    {
      "time": "7 Apr 2008 — 12:30pm",
      "content": "A lone voice out in the wilderness... I like the H. versions. The pi symbol is abstracted to look like interesting building blocks. Unfortunately I don't know what the company does so I don't know if it's appropriate. Just as a graphic I preferred h. B is good, strong and safe. What does Post Industrial do?\n\n"
    },
    {
      "time": "7 Apr 2008 — 12:47pm",
      "content": "Post Industrial provides solutions for small businesses.  \nIt also works in the field of rich media, but mainly develops concepts for such projects.\n\nInteresting, I preferred h as well, but it feels too much like a building company. Too massive, but then again, that could be good =/\n\n"
    },
    {
      "time": "7 Apr 2008 — 2:48pm",
      "content": "yeah I just think the associations with the PI symbol are irrelevant ... the fact the initials of the business name are PI isn't a focal point, it doesn't tell a story about what they do (and if it does ... it's probably the wrong story.)\n\n:)\n\n----------  \n**Paul Ducco**  \n [Logo Design Melbourne](http://web.archive.org/web/20131017053223/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "7 Apr 2008 — 4:13pm",
      "content": "I don't know if i should be ashamed or not to say that you're not off to a very good start. The type choices are fairly \"system\" based and don't give much character to the idea of the company nor play off the name in a figurative or metaphorical way.\n\nWhy is it called Post Industrial? Is this a real company or a student project?\n\nI'm still very unclear as to what the company does? Provides small business solutions doesn't mean anything. What solutions does it provide? Accounting, design, manufacturing, rich media?\n\nThe name is interesting in that the rise of micro economies is in full force or the D.I.Y. movement as some would call it. What i mean is that the name could infer \"being past mass consumerism\" and you are a middle man that is bridging the gap between them. Though since we don't know what services you're offering it's hard to tell.\n\nSteps-\n\n1. Restate the purpose of the business and what services it specifically provides.  \n2. Research the competition to avoid cliches and well know your enemies  \n3. Research visual elements, styles that could be used in service of creating variation on the identities.  \n4. Find a hybrid of the above, put them togther and bring them back to the forum for a better, insightful critique.\n\n"
    },
    {
      "time": "7 Apr 2008 — 6:50pm",
      "content": "Paul:\n\nI agree - tell the story of the company and from what you have said, the Pi association is purely coincidental and will only serve to confuse not enrich.\n\nI would work on the concept from the ground up and back again. Think of who they sell to and what there clients are really buying with their service. Is it speed, peace of mind etc.\n\nJay\n\n"
    },
    {
      "time": "8 Apr 2008 — 11:14am",
      "content": "I'm attracted to h also. Not so much the top one but the bottom two. The grayscale inparticluar. I think I don't like the rounded corners on the one with the blue block, but I like the blue block.\n\nI'd stick with PI instead of illustrating the symbol of pi.\n\n"
    }
  ]
}
