{
  "id": "43955",
  "title": "cardboard CD case sizing issues",
  "forum": "Design",
  "tags": [

  ],
  "content": "G'day guys,\n\nI'm laying out a CD case which is entirely made of cardboard consisting of two pockets, one which contains the booklet and the other which contains a sleeve with the CD inside.\n\nMy problem is that I don't know the correct sizes (I've just been measuring a whole bunch of CD cases) and I can't seem to make it so the pocket fits the sleeve without making it too big for what seems like the standard size. This is fine it itself but it would seem to make it a potential annoyance for people wanting to put it in standard CD racks etc, not to mention retailers.\n\nMy question is: have you successfully made a cardboard CD case containing another sleeve which still manages to fit in standard racks? or Have you got any wisdom on sizes or Cardboard CD creation generally?  \nthanks\n\n--N\n\n",
  "author": "<a href=\"/web/20100708204908/http://typophile.com/user/9500\" title=\"View user profile.\">nicholasgross</a>",
  "time": "<br>",
  "uid": "9500",
  "comments": [
    {
      "time": "",
      "content": "I hope you're using a [caliper](http://web.archive.org/web/20100708204908/http:/en.wikipedia.org/wiki/Calipers), rather than a ruler, to measure those CD cases.\n\n"
    },
    {
      "time": "",
      "content": "hm, unfortunately no caliper just a ruler and a careful eye.\n\n"
    },
    {
      "time": "",
      "content": "Ask the place where you'll print it (or check their website), they usually have templates for download that fits their working process.\n\n"
    },
    {
      "time": "",
      "content": "Other places do, this place doesn't really specialize in CD cases so they don't seem to have that kind of thing. Also this CD case is non-standard.\n\n"
    },
    {
      "time": "",
      "content": "_Also this CD case is non-standard._\n\nIn that case, you've sort of answered your own question about getting it to fit into a standard rack. A survey of my collection for cardboard sleeve cases shows they are all just a light bristol board stock that match the height of a standard plastic case, and are otherwise square (with gluing tabs, of course).\n\nHave you looked at setting it up with a thicker spine to accommodate the brochure with a sleeve for the CD (open at either the spine or the fore edge)? Back in the good old days, Adobe used to ship out software in some really elegant all-cardboard constructions....\n\n"
    },
    {
      "time": "",
      "content": "One alternative, if you can spare some $$, is to buy a CD with a cardboard sleeve and then take it apart -- you'll get better measurements that way, if you're using a ruler. The first pressings of Cat Power's \"You Are Free\" had a cardboard sleeve like the one you want to make. It might be easier to find Sleater Kinney's \"The Woods,\" though. Aimee Mann's \"Bachelor No. 2\" has just a half-pocket for the booklet, but you can use the measurements of the other half.\n\nCheaper alternative: [Sleeve City](http://web.archive.org/web/20100708204908/http:/www.sleevetown.com/cardboard-cd-sleeve.shtml) will send you a sample of their cardboard sleeves for just a penny. They also state that their pocket measures 5 in. x 4-7/8 in.\n\nI'll try to post more later -- right now I have to go to work. :-)\n\n"
    },
    {
      "time": "",
      "content": "Thanks guys, this is good advice. I'd love to know how Cat Power and Sleater Kinney do it, maybe a trip down to the CD store... (although it would hurt to buy a CD I didn't really want to own, I've tried with Cat Power really I have)\n\nThe printer is proposing a 230GSM board, to my mind that seems comparable to the bristol board. What I'd love would be a set of standard sizes for CDs that retailers can cope with. hm...\n\nthanks again guys\n\n"
    },
    {
      "time": "",
      "content": "Hey, Nicholas, I looked at my copy of _Forms, Folds and Sizes_ to see if there were any CD templates, but no such luck.\n\nBut check this out... I just found some templates online:\n\n[http://www.discwizards.com/cd-dvd-artwork-templates.htm](http://web.archive.org/web/20100708204908/http:/www.discwizards.com/cd-dvd-artwork-templates.htm \"http://www.discwizards.com/cd-dvd-artwork-templates.htm\")\n\n[http://www.duplication.ca/printspecs/1000.htm](http://web.archive.org/web/20100708204908/http:/www.duplication.ca/printspecs/1000.htm \"http://www.duplication.ca/printspecs/1000.htm\")\n\n[http://www.kyric.com/templates2/templates.html](http://web.archive.org/web/20100708204908/http:/www.kyric.com/templates2/templates.html \"http://www.kyric.com/templates2/templates.html\")\n\n[http://www.thecdduplicator.com/cd-sleeve-templates.html](http://web.archive.org/web/20100708204908/http:/www.thecdduplicator.com/cd-sleeve-templates.html \"http://www.thecdduplicator.com/cd-sleeve-templates.html\")\n\nSo forget about Chan Marshall... Typing \"CD sleeve templates\" into Google does the trick. :-)\n\nSeriously, maybe one of these templates will be helpful. Good luck!\n\n"
    },
    {
      "time": "",
      "content": "Thanks Ricardo! So apparently we're not going with the inner sleeve cause it would be too fiddly, I guess that solves my problem, but this is great stuff thanks a lot. I did search for CD templates but I couldn't find one that had the double sleeve only basic wallets or digipaks etc. Cheers.\n\n"
    }
  ]
}
