{
  "id": "43971",
  "title": "Apple says Web designers can post \"any font\" for use with Safari.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This came up at the Business of Type Event on Friday, and yes Apple font people were given a heads up...\n\n ![](http://web.archive.org/web/20140716014803im_/http:/typophile.com/files/Capture_3793.JPG)\n\n...from the Fonts section of the main Safari page on Apple.com - [http://www.apple.com/safari/](http://web.archive.org/web/20140716014803/http:/www.apple.com/safari/ \"http://www.apple.com/safari/\")\n\nOne of the biggest concerns around the Web fonts scheme is that Web designers would post commercial fonts through either ignorance or disregard of font licensing rights. Apple were aware of this (both Safari folks and Font folks) so I find it hard to understand why they’re telling web designers that they can post any font to the Web.\n\nThis is probably a break-down in communication between marketing folks and the font/browser folks, but the damage has been done – Mac World appears to have parroted the misinformation in their recent Safari review...\n\n[http://www.macworld.com/article/132708/2008/03/safari31.html](http://web.archive.org/web/20140716014803/http:/www.macworld.com/article/132708/2008/03/safari31.html \"http://www.macworld.com/article/132708/2008/03/safari31.html\")\n\nHopefully Apple will fix this quickly, and post material that directs web designers to freeware fonts that can be used with the scheme.\n\nCheers, Si\n\n",
  "author": "Si_Daniels",
  "time": "7 Apr 2008 — 8:50am",
  "uid": "1049",
  "comments": [
    {
      "time": "7 Apr 2008 — 9:03am",
      "content": "That sounds very damaging. This is \\*exactly\\* the sort of information that leads people to think some things are ok.\n\n"
    },
    {
      "time": "7 Apr 2008 — 9:09am",
      "content": "Wow, this sounds like a declaration of war to me. Apple declares war on type designers and font foundries. Who would've thought?\n\nPerhaps if enough people complain, they will change their website copy. Just like that whole wrong-quotation-marks thing in the _New York Times_ anti-Vista ad…\n\n"
    },
    {
      "time": "7 Apr 2008 — 9:13am",
      "content": "Si, any chance that you (or other attendees) could publish an online re-cap of the Business of Type event? I'm not asking for full presentation decks or discussion minutes or anything; I know that some of that must be private. But just an event summary… like you commonly see on blogs after TypeCon or the ATypI conference?\n\n"
    },
    {
      "time": "7 Apr 2008 — 9:28am",
      "content": "It isn’t Apple’s job to educate designers about font licensing. It would certainly be good of them to point it out, but nobody should expect them to do it. If the foundries aren’t licensing their fonts for web embedding, it’s their responsibility to be very upfront about it. This has been coming for years, foundries really should have started doing more than just tucking a “no embedding” provision into EULAs, which most people never bother to read. Put the terms up there in big red letters that people will actually see before they click “buy.”\n\n"
    },
    {
      "time": "7 Apr 2008 — 9:38am",
      "content": "It's not Apple's job to educate, but when they make misleading and arguably false claims like \"limitless choices\" (from the press release) and \"use any font they want\" (from the web site), then there's a problem.\n\nI pinged Apple on Saturday and followed up this morning as well. Maybe I'm an optimist, but I'd expect the text will be changed some time this week. As I said on Friday in our panel discussion on Web fonts, this is the sort of thing that can easily happen at any big company when the PR/marketing folks go off and write something without quite enough careful vetting by the technical folks. Not that I'd know that myself, nosirreeBob.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "7 Apr 2008 — 9:46am",
      "content": "\\>It isn’t Apple’s job to educate designers about font licensing.\n\nSorry, but I disagree. There are various options re. developer education around technologies that redistribute fonts. I believe that it absolutely is the responsibility of people who make font-exploiting technology to help developers and users stay legal. Here's a recent example from Microsoft - [http://windowsclient.net/wpf/starter-kits/sce/sce-howto-using-fonts.aspx](http://web.archive.org/web/20140716014803/http:/windowsclient.net/wpf/starter-kits/sce/sce-howto-using-fonts.aspx \"http://windowsclient.net/wpf/starter-kits/sce/sce-howto-using-fonts.aspx\")\n\nI can understand why a Apple might want to stay silent, and that might have been the safest thing for them to do legally. But in this case they are giving plain bad advice to web page designers, and that needs to be fixed.\n\n\\>Si, any chance that you (or other attendees) could publish an online re-cap of the Business of Type event?\n\nWe're working on that.\n\n\\>Perhaps if enough people complain, they will change their website copy. Just like that whole wrong-quotation-marks thing in the New York Times anti-Vista ad…\n\nI think this is a good test to see how seriously they take this problem. The ad in question was fixed within 24hrs, correct? And that involved editing a multipart Flash animation. This should be a quick fix. Clock is ticking.\n\n"
    },
    {
      "time": "7 Apr 2008 — 10:05am",
      "content": "\"I find it hard to understand why they’re telling web designers that they can post any font to the Web.\"\n\nIt's called 'marketing'. Marketing usually has little to nothing to do with the product's inherit abilities or lack thereof.\n\n\"I believe that it absolutely is the responsibility of people who make font-exploiting technology to help developers and users stay legal.\"\n\nIANAL, but I think this would be really bad precedence. Just because you CAN copy a book on a photocopier, should the photocopier manufacturer be liable for you infringing copyright?\n\nIt'd be NICE if apple's marketing folks ran this kind of stuff through their developers and added important details like we're discussing here, but I can't say Apple HAS to do that on any legal grounds.\n\n\"But in this case they are giving plain bad advice to web page designers\"\n\nEh...any competent web designer isn't going to believe anything on a marketing web site anyways. Mom the scrapbooker might believe it, though. So, yea, some concern there.\n\n"
    },
    {
      "time": "7 Apr 2008 — 10:12am",
      "content": "\\> _Just because you CAN copy a book on a photocopier, should the photocopier manufacturer be liable for you infringing copyright?_\n\nDon't newer scanners and printers prohibit you from copying and printing money?\n\n"
    },
    {
      "time": "7 Apr 2008 — 10:23am",
      "content": "I've seen plenty of photocopiers that have warning notices on them, and I've seen plenty of photocopiers with no warning (or one buried in the manual). What I've not seen is a photocopier with a notice from Xerox saying - \"go ahead use me to photocopy anything you like, it's all good.\"\n\n\\>should the photocopier manufacturer be liable for you infringing copyright?\n\nI'm not saying the're any liability if you stay silent, what I'm saying is that it's good customer service to give your customers a heads-up.\n\n"
    },
    {
      "time": "7 Apr 2008 — 10:37am",
      "content": "If web designers can post \"any font\" for use with Safari, what exactly makes this a 'marketing' issue?\n\nCheers!\n\n"
    },
    {
      "time": "7 Apr 2008 — 10:37am",
      "content": "\"Don’t newer scanners and printers prohibit you from copying and printing money?\"\n\nThey try. But that's a counterfeiting issue rather than IP infringement.\n\n\"what I’m saying is that it’s good customer service to give your customers a heads-up\"\n\nNo argument there. Let me know if you ever find a software company that does that. ;o)\n\n"
    },
    {
      "time": "7 Apr 2008 — 10:46am",
      "content": "\"what exactly makes this a ’marketing’ issue\"\n\nThe text on Apple's web site (aside from the support section) is, in all likelihood, owned by marketing.\n\nSaying you can upload any font for use with safari is true, just greatly overstating the feature both technically and legally. But that's what marketing does. The fine print/asterisks/caveats/gotchas are reserved for the back pages of the documentation or the knowledge-base articles, or some blog post somewhere in the future...\n\n"
    },
    {
      "time": "7 Apr 2008 — 10:46am",
      "content": "\\>Let me know if you ever find a software company that does that.\n\n;-) You are too funny!\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:15am",
      "content": "I would guess the amount of people using Safari is limited and the damage is probably limited if they take action.\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:19am",
      "content": "<cite>Don’t newer scanners and printers prohibit you from copying and printing money?</cite>\n\nNot the hardware, but some scanning software and Photoshop will not scan US money properly. Most color laser printers sold in the states tag every document with unnoticeable serial numbers. But doing so with fonts means bringing back font DRM, which some important entities are openly against.\n\nThe purpose of my comment was not to elevate Apple’s actions above criticism. I just wanted to point out that this will not be the first time this happens, that the type industry should expect these incidents to happen, and foundries need to start being proactive and creative about licensing and educating users before it becomes a problem—i.e. before Firefox or IE jump on board. Some people are already doing so—creative license models, Adobe working with the AIGA on student fonts, Microsoft’s event hosting and of course, all the industry types talking about it here and elsewhere. But if you guys slip, you could end up in a nasty hole like the record industry, and that’s not something anyone in the industry really wants, is it?\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:42am",
      "content": "Hm, I'd like to play the devil's advocate for a moment ... if the text read \"With [NCSA Mosaic](http://web.archive.org/web/20140716014803/http:/en.wikipedia.org/wiki/Mosaic_%28web_browser%29), web designers can go beyond text and use any image they like to create stunning web sites ...\", would you want the Web back without images? Or would anybody come to believe from that sentence that no legal restrictions would apply? That would be just naive.\n\nOkay, granted, there are too many naive people doing so-called web design. It all boils down to that people must be educated to respect intellectual property more. (I know, it's easy to say.)\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:42am",
      "content": "\"...Not that I’d know that myself, nosirreeBob.\"\n\nThe corporate world has its own axis :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Apr 2008 — 12:37pm",
      "content": "<cite>Hm, I’d like to play the devil’s advocate for a moment ... if the text read “With NCSA Mosaic, web designers can go beyond text and use any image they like to create stunning web sites ...”, would you want the Web back without images?</cite>\n\nMr. Kutilek hits the nail on the head:\n\nWhile fonts **are not** copyrightable in most countries (although Typophiles wish they were), images or pictures (\"pictorial works\" as per US Copyright Law) **are** copyrightable in most countries, but many Typophiles do not hesitate to upload copyrighted pictures to Typophile threads without having obtained the permission to do so from the picture copyright owners. The Typophile website threads abound with pictures, for which the publication rights have not been acquired.\n\nLook, for instance, at the start of this thread: Even this tiny picture (screen shot) inserted by Mr. Daniels probably is copyrightable, although this might be disputed at court, but by browsing through other Typophile threads you certainly will find many copyrighted pictures, for which the uploaders never acquired the picture publication rights.\n\nIf you download the pictures made by others, \"as they're are needed\", and upload them without permission to your website, why do you complain that Apple Inc. intends to do the same with your fonts by downloading them without permission, \"as they're needed\" by Safari?\n\n"
    },
    {
      "time": "7 Apr 2008 — 12:39pm",
      "content": "Interesting point, Uli.\n\n"
    },
    {
      "time": "7 Apr 2008 — 12:47pm",
      "content": "The thing is, a tiny 72 dpi image does not have scalability and usability as a piece of softwarre. I would not have a problem seeing images of type at 72dpi on web sites but I would objectto the useable font being extracted by the browser and made available as free software to pirates as well as naive users who would assume anything on the web is free. Think of Si's image as a small quote of text as opposed to stealing an entire novel and selling it as your own.\n\nChrisL\n\n"
    },
    {
      "time": "7 Apr 2008 — 12:58pm",
      "content": "Uli is back! Wooo!\n\n"
    },
    {
      "time": "7 Apr 2008 — 1:00pm",
      "content": "Wooo!\n\nI agree with Chris (Apple lawyers please don’t come after me) ;-) there’s a difference between the hi-res © photograph and a 60px x 60px picture of a Seahawk helmet (at least I hope so). In the case of the Safari scheme we’re talking complete, unobfuscated, unsubsetted source fonts. However, it’s been my experience that drawing analogies between fonts and other forms of IP, be that pictures, music, books, etc., almost always break down.\n\n"
    },
    {
      "time": "7 Apr 2008 — 1:21pm",
      "content": "Note Apple said you CAN, as in, you are able to technically. Apple didn't say you MAY use any font. Mincing words yes, but that's what marketing is about. Web designers _can_ post any font. That doesn't mean they _may_. I can use any picture I want on my website, of course as well \\*\n\nYes, it's bad advertising that I agree should be changed, but it's not encouraging people to violate their licenses either.\n\n\\* Provided I obtain proper permission.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "7 Apr 2008 — 1:27pm",
      "content": "In some cases, because we’re having discussions about the images or their subjects, and the images are being used in part or at small scale, and for no profit, use of said images constitutes fair use. At least in does in the USA, where Typophile is hosted and maintained. Redistributing an entire font, especially when done to make a profit, is very different.\n\n"
    },
    {
      "time": "7 Apr 2008 — 1:36pm",
      "content": "\\>\\* Provided I obtain proper permission.\n\nI think adding \"(license permitting)\" after \"any font\" would be a good quick fix.\n\n"
    },
    {
      "time": "7 Apr 2008 — 1:59pm",
      "content": "Uli has a point, but it's not really about 'lo-res' vs. 'hi-res'. It's more of an issue of fair use and/or common sense.\n\n"
    },
    {
      "time": "7 Apr 2008 — 2:11pm",
      "content": "In the Netherlands (and I guess in most of the world) people are supposed to know the law. In other words: everyone has to find out if there are rules regarding the things they do. May it be driving a car, selling fruit, designing a website — you need to know what’s forbidden, restricted, allowed, etcetera.\n\nSame goes for using some typeface on your site with the technology Apple provides. If the law, the typedesigner or the typeseller forbids this, you just can’t do it. Even when Apple suggests you could. But then, Apple also suggests you can make a video masterpiece using Final Cut. : )\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "7 Apr 2008 — 2:38pm",
      "content": "The headline for _this thread_ is dynamically created from a commercial font using Flash and Javascript.\n\nWhy is Safari making this exact same thing possible with CSS wrong and illegal if doing it with Flash and Javascript is not?\n\n"
    },
    {
      "time": "7 Apr 2008 — 2:44pm",
      "content": "Yeah I agree with Bert. Sure there's maybe like some soccer mom in Minnesota who thinks all fonts on the internet are free... but the majority of professional designers know the general laws surrounding copyright. They just choose to ignore them.\n\n"
    },
    {
      "time": "7 Apr 2008 — 2:46pm",
      "content": "I think many people are missing a bigger issue here which is that Safari is only implementing something that is already a published web standard from the Worldwide Web Consortium. Whatever the marketing hyperbole from Apple, web fonts will eventually be a feature of every browser and designers and font foundries need to recognise this.\n\n"
    },
    {
      "time": "7 Apr 2008 — 2:47pm",
      "content": "\\>The thing is, a tiny 72 dpi image does not have scalability and usability as a piece of software...\n\nAh.. But that all depends on the person, his abilities and the useage. I know ways to take 72dpi images from the net, tweek and rez up them in photoshop and use them on the side of Buses.\n\nBut again as was stated before by Aluminum about Uli's point is that it's more about fair use and/or common sense.\n\nI think part of the problem lies in how easy it is to pass a font from place to place with out retribution. Where a copyrighted image when the same is done.. the creator pushes much harder to bring retribution for it's mis-use.\n\nP.S. Pardon my grammer I'm more of a visual person.\n\n"
    },
    {
      "time": "7 Apr 2008 — 3:54pm",
      "content": "Who sez you can't scan money?\n\n[http://gethelveticaoffourmoney.com/](http://web.archive.org/web/20140716014803/http:/gethelveticaoffourmoney.com/ \"http://gethelveticaoffourmoney.com/\")\n\n"
    },
    {
      "time": "7 Apr 2008 — 4:26pm",
      "content": "<cite>\"While fonts are not copyrightable in most countries\"</cite>\n\nThey certainly are in the USA, which is the country Apple is most primarily operating in. The fonts in question are the actual digital font files. As far as I know, most countries recognize digital fonts as software and as therefore subject to copyright as software. Certainly the USA does.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "7 Apr 2008 — 10:05pm",
      "content": "\\>The headline for this thread is dynamically created from a commercial font using Flash and Javascript.  \n\\>Why is Safari making this exact same thing possible with CSS wrong and illegal if doing it with Flash and Javascript is not?\n\nYou’re missing the point, it’s not \"wrong\" or \"illegal\" to post \"a font\" to a web site – the point of this thread is that Apple’s promotional material suggests that Web designers can post “any font”, when the reality is that no known commercial fonts can be used under the scheme. If Adobe’s material said the same thing about Flash embedding it would be wrong, just not as wrong as Apple’s statement as many commercial font licenses allow for Flash embedding.\n\n\\>I think many people are missing a bigger issue here which is that Safari is only implementing something that is already a published web standard from the Worldwide Web Consortium.\n\nActually been discussing the “bigger issue” on Typophile since the issue resurfaced in 2006. I started this thread to specifically address the Apple positioning of the technology.\n\n"
    },
    {
      "time": "7 Apr 2008 — 10:15pm",
      "content": "<cite>“While fonts are not copyrightable in most countries...”</cite> (Ulrich Stiehl)\n\n<cite>\"They certainly are in the USA, which is the country Apple is most primarily operating in. The fonts in question are the actual digital font files. As far as I know, most countries recognize digital fonts as software and as therefore subject to copyright as software. Certainly the USA does.\"</cite> (Thomas Phinney)\n\nMr. Phinney:\n\nThis is the famous fairy tale you have been propagating for many years.\n\nLet us assume, Germany belongs to your <cite>\"most countries\"</cite>  \n(\"As far as I [Thomas Phinney] know\").\n\nIf so, then quote the German law and/or the German Supreme Court decision ruling that fonts are copyrightable. You will not be able to do so with regard to Germany, because your story of \"copyrightable fonts\" is a fairy tale.\n\nAnd you will not be able to do this with regard to France, Belgium, Italy, Spain, Portugal, etc. etc. etc. etc. etc. etc., because your story of \"copyrightable fonts\" is a fairy tale. Only little children think that fairy tales become true by telling them over and over again.\n\n<cite>\"Certainly the USA does\"</cite>\n\nI do not know an American Copyright Law nor do I know an American Supreme Court decision ruling that fonts are copyrightable.\n\n**You** , who you as an American are claiming that this is so, should at least be able to specify the section of the American Copyright Law ruling that fonts are copyrightable and/or to specify the American Supreme Court decision ruling that fonts are copyrightable. But even with regard to your own country, you cannot specify this to make your fairy tale become true.\n\nPS: The **design** of \"new and original\" fonts may be registered in certain countries, e.g in Germany, on the basis of a design law (\"GeschmMG\" in Germany), but this has nothing to do with copyright laws.\n\n"
    },
    {
      "time": "8 Apr 2008 — 12:04am",
      "content": "<cite>the point of this thread is that Apple’s promotional material suggests that Web designers can post “any font”, when the reality is that no known commercial fonts can be used under the scheme. </cite>  \nAgain, the key word is can. You CAN post any known commercial font, provided it's not in any odd known format. Whether or not you MAY is another question entirely.\n\nTeacher, can I go to the bathroom?  \n— Well, I don't know, can you?\n\nTeacher, may I go to the bathroom?  \n—Yes, you may.\n\nAgain, this is not to say that I don't think it's a bit misleading, but still, we can't fault them for being inaccurate.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "8 Apr 2008 — 12:27am",
      "content": "Don't you see that new fonts will get exposed to new customers? It shouldn't even be illegal for copying and font foundries can still web-embed their fonts.\n\n"
    },
    {
      "time": "8 Apr 2008 — 1:44am",
      "content": "I have to second Jens and guifa here.\n\nThey say you can use any font. And yes, you technically can. Whether you legally are allowed to or not is a completely other question and its up to you to check that.\n\nThey merely claim to provide the technology, so that you _can_, what they actually do.\n\n"
    },
    {
      "time": "8 Apr 2008 — 1:46am",
      "content": "On the other hand, Apple has its HQ in the US. And over there they have a strange interpretation of law (why would a microwave producer have to put a warning sign \"not for drying pets\" onto it, to avoid ligitation? -- actually, is that an urban legend or not? Even if so: very telling).\n\nSo it may be a concern for \\_their\\_ legal department not to claim such a possibility of using any font.\n\n"
    },
    {
      "time": "8 Apr 2008 — 2:40am",
      "content": "Something which doesn't seem to be an issue in the discussion so far is safety.\n\nIt is possible to build fonts which crash rasterisers. I can think of a couple opportunities in a .ttf or .otf which can cause serious problems in the app and the OS. Fonts are part of a text engine, usually integrated deeply into the OS. Fonts are subject to ambiguous standards and can contain many values which catch the rasteriser unaware. Integrity tests for fonts usually catch some of the problems, but never all of them. (Aside, it seems the PostScript Type 1 format is great for non-downloadable fonts). So far, bad fonts were always dealt with by the person who installed them. Even when something goes wrong, the user will usually know what happened and how to solve it.\n\nIn the context of a website there is no sanity check on the server end, it is up to the browser to make sure the font is fit. The user will be unaware of any potential problems in a webpage which is about to open.\n\nSpeculating, if the fonts-for-download is part of WebKit, it won't have its own rasteriser and the Doomsday.ttf might be possible. Speculating even more, Mail.app uses webkit, it would be possible to make an html mail message which links to malevolent fonts. It might even work on the iPhone, depending on how much code is shared between the iPhone and MacOSX.\n\nPerhaps Apple has separated the rasteriser in Safari from the rest of the OS. Perhaps Safari also checks the integrity of the font after download. In that case a bad font would just not load. But if a bad font isn't caught, and with a rasteriser in Safari, it could crash the app, but not the OS. In the worst possible case, if Safari uses the OS rasteriser, it could trigger a series of crashes which eventually take the whole OS down. And that is quite unacceptable.\n\nAt the very least, the downloading of fonts should be covered in the security prefs of Safari, and off by default. A bad font can do more damage than a run away javascript. Even Java and Flash don't have access to the core OS functions as fonts do. But these do have their own controls in the security prefs.\n\nAnd that's just Safari. Will Firefox be able to follow to same safety precautions Safari might have?\n\nOf course, all of these problems can be fixed in rasterisers and font handling code. But given that rasterisers, after almost 20 years of improvements, still contain problems, makes me wonder how fast browser and rasteriser builders can respond.\n\nJust my 2¢ of gloom.\n\n"
    },
    {
      "time": "8 Apr 2008 — 3:06am",
      "content": "Dez:\n\n<cite>\"The thing is, a tiny 72 dpi image does not have scalability and usability as a piece of softwarre. I would not have a problem seeing images of type at 72dpi on web sites but...\"</cite>\n\nSii:\n\n<cite>\"I agree with Chris (Apple lawyers please don’t come after me) ;-) there’s a difference between the hi-res © photograph and a 60px x 60px picture of a Seahawk helmet...\"</cite>\n\nAlthough it is awfully boring for me to explain again and again the most simple notions of copyright law, I will try to explain them again. For this purpose I refer to a copyrighed picture in this new Typophile thread\n\n[http://www.typophile.com/node/43945](http://web.archive.org/web/20140716014803/http:/www.typophile.com/node/43945 \"http://www.typophile.com/node/43945\")\n\nThe \"Ali boxing poster\" shown in this thread is indubitably a \"work of art\". The date 1975 proves that this poster was made roughly 30 years ago. If the poster was made in the USA, then it will be protected by copyright for a period of 70 years post mortem auctoris (after the authors's death). So nobody except the author (here the designer or painter) or his/her assignee (e.g. the company which acquired the picture rights) is allowed to publish this picture.\n\nIt does not matter, whether this poster is photographed or scanned or reproduced by whatever technical means, and it does not matter, whether this reproduction is done in high or low resolution: In all these cases, you have to acquire the publication rights from the author or his/her assignees.\n\nEven if you want to reproduce this poster in a very tiny size and in very low resolution, e.g. as a postal stamp, you will have to obtain the right to do so.\n\nTherefore, the publication of this Ali poster as a scanned reproduction in low resolution at the Typophile thread\n\n[http://www.typophile.com/node/43945](http://web.archive.org/web/20140716014803/http:/www.typophile.com/node/43945 \"http://www.typophile.com/node/43945\")\n\nconstitutes a copyright infringement, unless he who uploaded this picture has acquired the right to reproduce this poster on the Typophile website.\n\nLet us assume this legal information just given by me were not correct, and everybody were allowed to upload scans and photos of any pictures to any websites, then for example, everyone were allowed to scan all pictures painted by Picasso and upload them to whatever internet sites. This of course is definitely illegal and would constitute an infringement of copyright, in the very same way, as the publication of the Ali poster constitutes an infringement of copyright.\n\nEnd of tutorial. I need some fresh air now.\n\n"
    },
    {
      "time": "8 Apr 2008 — 4:00am",
      "content": "click around on these two sites ....\n\n[good reading on Fair Use](http://web.archive.org/web/20140716014803/http:/www.utsystem.edu/ogc/intellectualproperty/distance.htm#fu)\n\n[Chilling Effects](http://web.archive.org/web/20140716014803/http:/www.chillingeffects.org/)\n\nand read this\n\n[Fair Use on the Internet (pdf)](http://web.archive.org/web/20140716014803/http:/www.fas.org/irp/crs/RL31423.pdf)\n\ni haven't gotten through all of it, but it seems that Typophile's use of images would constitute Fair Use under most reasonable interpretations. If it wasn't 4 a.m., I'd make a more detailed post.\n\nalso interesting is the notion of an [Implied License](http://web.archive.org/web/20140716014803/http:/www.utsystem.edu/ogc/intellectualProperty/useofnet.htm) when you post something on the internet.\n\n<cite>Whenever an author posts anything to the Internet, he or she should reasonably expect that it will be read, downloaded, printed out, and perhaps forwarded on a limited basis. The author impliedly grants a limited license to users to utilize the work in this manner.</cite>\n\n"
    },
    {
      "time": "8 Apr 2008 — 3:55am",
      "content": "It doesn’t matter whether fonts are copyrightable or not. That only affects your ability to sue people who have been given copies illegally by someone who owns a legal copy. It doesn’t change the fact that fonts are only distributed subject to a licence agreement; if you don’t comply with the agreement, you could be sued for breach of contract, even if in your country fonts are not subject to copyright.\n\nIn a sense, therefore, the issue of copyright here is a red herring. The real issue is that fonts are licensed, and that the licence agreement (which is a contract between two parties, and applies regardless of copyright law) would in many cases be breached by distributing a font file in the manner presently supported by Safari. And since many users don’t bother reading or following licence agreements, the likelihood of a breach is high. Hence the complaints here about Apple’s marketing of Safari’s new feature.\n\nPersonally I would like to see support for subsetting and maybe a new file format for web fonts that can't be easily installed by end users. This has been tried in the past (WEFT, for instance), and I think it's the only way that those of us who would like to be able to embed fonts on the web are going to be able to convince the commercial type foundries to permit this type of usage. It also has the advantage of not requiring every visitor to your site to download large font files when all they needed was the letters ‘a’ through ‘z’. But it needs to be standardised across platforms and browsers, or nobody will want to use it.\n\n--  \n [http://alastairs-place.net](http://web.archive.org/web/20140716014803/http:/alastairs-place.net/ \"http://alastairs-place.net\")\n\n"
    },
    {
      "time": "8 Apr 2008 — 4:42am",
      "content": "Erik\n\nI would hope that Safari is running its own text renderer (even if just a separate instance in a sandbox of sorts) because it is lacking many text rendering features standard in CoreText. Neither required ligatures or kerning render, both of which feature in any standard NSTextField that you can do in Interface Builder in a dummy app (one that just has a single NIB file and no code).\n\nI'm not sure why Apple turned off those features, but I do know they (oddly) have inconsistent font technology between their programs. Why would it be that TextEdit (which uses the available-to-anyone NSTextView) have a more advanced engine that Safari or even Pages? My only guess is that they don't expect very large documents in a program that would use NSTextView, or that it's not as highly optimized as the engines used in Safari or Pages where speed is more important, especially for long HTML pages or doctoral dissertations, and they've cut out features or done other optimizations.\n\nOne of the main features I've noticed (and irritated me to know end with some of my term papers) is that Pages does not support combining diacritics very well (needed for putting the tilde on a lc Q).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "8 Apr 2008 — 5:30am",
      "content": "i'm not sure anyone else noticed this, but Safari now runs on Win XP and Vista, so this issue is not limited to just Mac users.\n\n"
    },
    {
      "time": "8 Apr 2008 — 5:39am",
      "content": "I think Erik's point related to font rasterizers (converting a vector glyph outline to a rasterized image of the requested glyph), not text layout (where features like contextual substitution are done), which are normally separate issues handled by different applications.\n\nIt wouldn't surprise me if the Safari browser (for the desktop) uses it's own rasterizer; on Windows it uses it's own rasterizer which produces results similar to the Mac OS. But I am not sure that would be true on the iPhone, where there could be advantages to sharing the system's rasterizer, and the architects may have seen this as a safer environment than the desktop (which would probably be a bad idea!)\n\nAlthough it may seem like it's a stretch that a font could crash a system or application, it is entirely possible, and I'd guess that this aspect of \"font downloading/embedding\" has not been sufficiently tested.\n\nJason C\n\n"
    },
    {
      "time": "8 Apr 2008 — 7:10am",
      "content": "Re. security (off-topic I know) - Safari's lengthy legal page includes a reference to Freetype (ironic given the patent tussles between Apple and Freetype but that's another story), the Open Source rasterizer, so I imagine they're using it. Freetype is mentioned several times in this Linux Watch article - [http://www.linux-watch.com/news/NS5622797384.html](http://web.archive.org/web/20140716014803/http:/www.linux-watch.com/news/NS5622797384.html \"http://www.linux-watch.com/news/NS5622797384.html\") - about the importance of keeping components up to date. So the next time the Apple pop-up ad appears asking you if you want to update Safari, iTunes and ice water etc., you better click 'yes'.\n\n"
    },
    {
      "time": "8 Apr 2008 — 7:44am",
      "content": "The issue raised at the head of this thread seems to be less about copyright protection and law than the responsibility of a company to keep its public statements in line with protected practice. Copyrights exist to protect an author's economic interest, and the basic test of infringement is whether or not the original owner of the copyright has suffered economic loss (actual or real potential) from the unauthorized use of the item for which the copyright was recorded.  \n_web designers can go beyond web safe fonts and use any font they want…_  \nA true statement, as long as the requisite licensing fees have been paid or grants of use received. Like most spin meisters the Apple flacks don't detail the costs. How many politicians this season have detailed what costs their programs would entail?\n\n"
    },
    {
      "time": "8 Apr 2008 — 9:59am",
      "content": "Uli,\n\nAs usual, you resort to insults.\n\nIt is a simple fact that the US Copyright Office accepts the copyright registrations of digital fonts, and does so following an explicit policy decision made in 1992 (quoted below in the court judgment excerpt).\n\nTo the best of my knowledge, you are correct that the US Supreme Court has not ruled on the applicability of copyright to digital fonts. That's because they haven't needed to, because no case has been appealed all the way to the US Supreme Court. Things don't need to be ruled on by the Supreme Court to be law in the USA.\n\nHowever, Judge Whyte's 1998 summary judgment in the Adobe vs SSi case in Federal District Court did rule on this issue, and upheld the principle that digital fonts are subject to copyright. [http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4](http://web.archive.org/web/20140716014803/http:/directory.serifmagazine.com/Ethics_and_Law/Copyright/judgement.php4 \"http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4\")\n\nThe relevant section of the judgment follows:\n\n\\* \\* \\* \\* \\*\n\nIn a 1988 Copyright Office Policy Decision, the Copyright Office determined that digitized typefaces were not copyrightable because they were not computer programs and required little selection or arrangement beyond that dictated by the uncopyrightable typeface design. \"Policy Decision on the Copyrightability of Digitized Typefaces, \" 53 Fed. Reg. 38 1 lo-381 13 (September 29, 1988).\n\nHowever, in 1992 the Copyright Office issued a final regulation regarding the registrability of \"computer programs that generate typefaces\" which appears to back off the 1988 policy decision, although the parties dispute this. The 1992 Regulation states:\n\n<cite>After a careful review of the testimony and the written comments, the Copyright Office is persuaded that creating scalable typefonts using already digitized typeface represents a significant change in the industry since our previous Policy Decision. We are also persuaded that computer programs designed for generating typeface in conjunction with low resolution and other printing devices may involve original computer instructions entitled to protection under the Copyright Act. For example, the creation of scalable font output programs to produce harmonious fonts consisting of hundreds of characters typically involves many decisions in drafting the instructions that drive the printer. The expression of these decisions is neither limited by the unprotectible shape of the letters nor functionally mandated. This expression, assuming it meets the usual standard of authorship, is thus registrable as a computer program.</cite>\n\n\"Registrability of Computer Programs that Generate Typefaces,\" 57 Fed. Reg. 35 at pp.6201-2 (February 12, 1992)). Plaintiff contends that the 1992 Regulation supports protection for the scalable typefonts at issue. Defendants contend that the 1992 Regulation reaffirms the 1988 policy decision stating that digitized typefaces are not protectable.\n\nDefendants base their assertion on the fact that the 1992 Regulation specifically states that it \"does not represent a substantive change in the rights of copyright claimants.\" Id. at 6202. They argue that the effect of the 1992 Regulation is merely to revise the procedure in referencing font-depicting data in the registration process. Thus, defendants contend that the numerical reference points that define an outline of a glyph are unprotectable as a matter of law.\n\nDefendants argue that after one has filtered out the unprotectabie elements of plaintiffs software in order to compare what remains, one finds that minimal, if any, protectable expression remains. Thus, defendants state that \"merely manipulating an unprotectable font image to create another, slightly different (but still unprotectable) font image cannot possibly give rise to protectable expression . . . .\" Defs. Memo., pp. 15-16. Defendants assert that no matter what points are selected by the Adobe editor performing the process, they correspond directly to, and hence are determined by, the unprotectable font shape. Therefore, because the output is not protected and there cannot be any creativity in what the editor does to obtain the output, nothing is protectable.\n\nAdobe contends that King copied literal expression.7 Adobe contends that while the shape of the glyph necessarily dictates some of the points to be chosen to create the glyph, it does not determine all the points to be chosen. Thus, each rendering of a specific glyph requires choices by the editor as to what points to select and where to place those points. Accordingly, Adobe asserts that the selection of points and the placement of those points are expression which is copyrightable in an original font output program. The actual code is dictated by the selected points.\n\nAdobe relies on Feist Publications v. Rural Telephone Serv. Co., 499 U.S. 340 (1991) and argues that because the glyph coordinates are not prescribed entirely by the shape of the glyph they involve creativity and are protectable. \"To qualify for copyright protection, a work must be original to the author. [citation omitted]. Original, as the term is used in copyright, means only that the work was independently created by the author . . . and that it possesses at least some minimal degree of creativity.\" . Id at 345. Further, \"the requisite level of creativity is extremely low; even a slight amount will suffice. The vast majority of works make the grade quite easily, as they possess some creative spark, no matter how crude, humble or obvious it might be.\" Id. Thus, Adobe argues that because there is some creative choice by the editors who select the on-curve and off-curve reference points, Adobe's font software programs are protectable.\n\nDefendants contend that FontMonger and Fontographer go beyond the code and extract the coordinates and express the coordinates in absolute values. Thus, defendants assert that the source code is not being copied but only the coordinates or points which are not protectable. Defendants then assert that FontMonger and Fontographer create code based on the selection of the points which is necessarily dictated by the shape of the glyph. Defendants contend that because they only extracted the points, they have not infringed because the points themselves are not protectable.\n\nThe evidence presented shows that there is some creativity in designing the font software programs. While the glyph dictates to a certain extent what points the editor must choose, it does not dictate every point that must be chosen. Adobe has shown that font editors make creative choices as to what points to select based on the image in front of them on the computer screen. The code is determined directly from the selection of the points. Thus, any copying of the points is copying of literal expression, that is, in essence, copying of the computer code itself.\n\nFurther, the selection of points is not dictated by functional concerns only. See 57 Fed. Reg. 6201-2. Defendants argue that efficiency is the key which is driven by the goal of minimizing the number of reference points. However, simply because there are several ways to create the same glyph, some being more efficient than others, i.e. using fewer points, does not mean there is no creativity in the process of creating the software to produce the glyphs. That some creativity is involved is illustrated by the fact that two independently working programmers using the same data and same tools can produce an indistinguishable output but will have few points in common. Accordingly, the court finds that the Adobe font software programs are protectable original works of authorship.\n\n\\* \\* \\* \\* \\*\n\nAfter this, I think I need to revert back to my principle of not responding to Uli, which I let lapse after nearly a year.\n\nBye,\n\nT\n\n"
    },
    {
      "time": "8 Apr 2008 — 10:53am",
      "content": "I love an Apple :)\n\n-------- [http://www.theapplemuseum.com](http://web.archive.org/web/20140716014803/http:/www.theapplemuseum.com/ \"http://www.theapplemuseum.com\")\n\nJust get rid of the \"any\" - that will do.  \nCould you add \"any of your fonts\" instead?\n\nAndré\n\n"
    }
  ]
}
